[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOd1p2RVBvaHpkSkxpdGtTX3VuZXN1Q3hxTElTV3BGdjk1UV9rcUdBOEZCejNRQlAzdmtBa09oaHhmZzN4WXRFSkVnaFMteC1xaGU0MDNHMDVvT1BRSlo2eTRsaVRHYWdabExsdERlWE5nakJqak05QUNMZzN0dmhBR2xnaGxKOW5KUTFMbEFDbGVlNlNGZmtjYUpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Solana Up 700% Last Year, Beats Bitcoin and Ethereum Growth - Crypto Times",
        "content": "Solana (SOL) has risen by an amazing 700% in the last year, outperforming other cryptocurrencies like as Bitcoin (BTC) and Ethereum (ETH).\n\nAs per the data from CoinMarketCap, Solana is currently up 702% from the previous year. During the same time, Ethereum eclipsed Bitcoin, thanks to final approvals for token-focused funds. Ethereum has grown by 51% since the beginning of the year, outpacing Bitcoin’s 45% increase.\n\nAt the time of this writing, SOL is currently the fifth-largest cryptocurrency by market capitalization, having a bullish year till now. Currently, SOL is trading at $145.6, and a year ago it was trading at $20, and at its peak in 2024, it was $200.\n\nSolana Chart\n\nBitcoin’s initial run this year, aided by the launch of the first U.S. spot ETFs in January, saw it hit a new high of $73,798 by March. However, demand and price have subsequently slowed, and Bitcoin’s performance is being overshadowed by increased interest in Ethereum and Solana.\n\nETF excitement is responsible for Solana’s recent rise, especially when exchange-traded fund company VanEck applied for a cryptocurrency-based product.\n\nThe SOL token experienced its largest spike since late May after VanEck filed the necessary paperwork with the Securities and Exchange Commission (SEC) for the new Solana ETF. The boost reached as high as 11%.\n\nThe VanEck Solana Trust is the company’s newest product and the first Solana ETF to be registered in the US. This submission comes after spot Ether (ETH) ETFs were approved by the SEC for the United States on May 23, 2024."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPSXpDZ2pneWlQM1RIM2xvM0VheFFUSHZ0MHVMYWw4ZFBDV3lSUnhlNExTWTN1Wl95MnZ2aW14Q3NydXVZS3cwdkVTUkRyaHJsNU1VMElEYk1HYm5WUTVwTWdWSlFFUnFVTHpILWc0QTdJZDZBSTNwT1N6VWpOWDE0aTlubFladUt1ekc2eA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Solana (SOL) Surges 800% This Year, Outpacing Bitcoin & Ethereum - Watcher Guru",
        "content": "Solana (SOL) has shown impressive growth this year, surging by almost 800% and outpacing both Bitcoin and Ethereum. Over the last 12 months, the token has increased by more than 770% according to CoinMarketCap, despite its recent dip to the $141 level.\n\nAlternatively, Bitcoin and Ethereum have grown 100% and 82% in the same time frame, respectively. The development has firmly established SOL alongside both BTC and ETH as the top three cryptocurrencies in the market. That fact has led two firms to file for Spot Solana ETFs this week alone.\n\nSource: Bitcoin.com\n\nAlso Read: Solana June End Prediction: Solana Blinks To Help SOL Cross $180?\n\nSOL Beats Both Bitcoin and Ethereum in Yearly Gains So Far\n\nThroughout 2024 thus far, the US has approved two crypto-based ETFs. That is expected to grow, and Solana has emerged as a favorite to get the investment product, especially as its 800% yearly gains have outpaced both Bitcoin and Ethereum.\n\nA recent report from GSR Markets has said SOL “cemented itself as a part of crypto’s Big Three.” Additionally, they stated that it is “just a matter of time before Solana” gets its own ETF. That would place the three assets in rarified air, but looks more and more like it will become reality.\n\nSource: Decrypt\n\nAlso Read: 21Shares Officially Files for Spot Solana ETF\n\nBoth 21Shares and VanEck have filed for the Solana investment product this week. It speaks as much to Sol’s potential as an investment offering, as it does to the shifting regulatory conversion in the country. Moreover, it could speak to an even greater overarching change taking place.\n\nBloomberg recently said that “Bitcoin’s performance is starting to be overshadowed by Ether and Solana” as ETF hype grows. Additionally, there is the expectation that the latter could get a much-needed boost from the investment product discussions. If it does get approved, the industry, and the token itself, should be massively helped."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPN3JxZlA0RGh0enZWd2pKeExGc3NsOHNrWmh5S0hlUGZpbGQzRzFzRjc0Vm1PYkhQV2dibTA5ZHh4eTBnR1pEUXpJSUVjZHlYWXZva04zSGU0ZmVaNnA5MHVsMGp3RG1hSldUMmJPVnI0U1c0UGdXVmJwNGllYXNVT2NTbkJhT2dsc1NVOVNIMThmNUo1alRuY25DbmVFTXNlS2FGQndxOTdDaUlYZXdUSkNvLUNLTkhYRVAzY1ZFMjg1anBlSWFfNWhTMlhoTDkwX21ncGFWblTSAd4BQVVfeXFMTkJNSUhWUWpVak9ZbHlYVXVWX2NEcmpWbmFobmlSZWhMQU1ZLThtb1ZOMjFpZUpCLU5iZnZEeDJVTU5DeVdTTWRmZjF3UnBYTmZYcnBoc2ZkazNJTGFGVjB2VkNFbkx0THNLZElNNmplZnFYV0g5anFCSUF5S0hyMEJnRVF1WGRFT3k4Yi0xUlRDOG0zTWRkLXRrcFBiLWtvcU42cVFVdVlINFFFNUFmVS1KVWVpTWl2MEM5ZE9xaTNIZnNBRWIzS2VCWjRTQ3RxYnlqLS03QW5SZHU3TmVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Crypto Analyst Says One Ethereum Rival Is Extremely Undervalued, Maps Path Forward for Bitcoin and Chainlink - The Daily Hodl",
        "content": "A widely followed crypto analyst and trader believes that one Ethereum (ETH) rival is well below fair market value.\n\nCrypto trader Michaël van de Poppe tells his 722,500 followers on the social media platform X that layer-2 scaling solution Polkadot (DOT) could follow ETH’s upward trend.\n\n“DOT is likely going to follow Ethereum in its expansion upwards. This means that the current valuations of Polkadot are extremely low. I expect a lot from the Polkadot ecosystem with all the new segments.”\n\nLooking at his chart, he suggests the possibility of a bullish divergence for DOT on the three-day chart, a metric where a lower low appears on the price chart but then a corresponding indicator shows a higher low.\n\nDOT is trading for $6.20 at time of writing, down nearly 2% in the last 24 hours.\n\nNext up, the analyst predicts that Bitcoin (BTC) will consolidate in the near term around the lower $60,000 range.\n\n“Bitcoin did make a retest at $61,000. I expect this to continue consolidating, where I’m assuming that altcoins will have a higher return than Bitcoin.”\n\nLooking at his chart, the trader suggests that Bitcoin will bounce around $60,000 and soon return to around $64,000.\n\nBitcoin is trading for $60,757 at time of writing, down 1.47% in the last 24 hours.\n\nLastly, the analyst says that leading blockchain oracle service Chainlink (LINK) will likely rally against Bitcoin (LINK/BTC) in the near term as it bounces off a trading range low on the weekly chart.\n\n“Pretty significant start for LINK with this weekly candle of +11% on the Bitcoin pair. It’s still the cycle low and likely the bottom during this period of consolidation.”\n\nLINK/BTC is trading for 0.0002308 BTC ($13.92) at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQTEEtUmc3M1d0QjJEcGJvLWJabEt3U0xNb3Y5dldfNkZIT1dNa19HRzlhOTdoVU5BOGo0MDl0a2ZJM2NScGd4cHFOZVZVQ2k2d3lWVUlQTkRUaGVMMkFieUNRTkVON0FoVV9VdC0xdDJZZzkxd3MtYVY3WjFBTVFhbzFsUEpyZlI0TmNwT1Zsb2VBWHozcWkzY0xwc1dLM1M1YXExbW9FNWtoQdIBsgFBVV95cUxPc3VJLURpdmxzWm96eEl2emd0dTBSTk9Zak1lOF8zNV9WYWxVN201LWM1LUJvTnhnQlRRZGd1MkpNM1VPR3pZYllmYk53YTFmUGsza29RcE05SjI1WTJoQkdrb3dCS3FScW1uZkNiN2VZM1FuVVhEYmN1XzJxeHNkb2J2QTJkRFBsS29SUUdOOHJIbFlmUUxoRUVSUjVkemtnWld5cDZJcHVzdjY4NmtPWGZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Grows with Fidelity’s $4.7M; 5thScape’s 2024 ROI to Hit 30,000x - Crypto News Flash",
        "content": "A recent major shift in the entire crypto market has seen Fidelity risk $4.7 million in its place, Ethereum ETF, according to a new filing in the updated registration document. It shows that Fidelity believes Ethereum is slowly shifting the dynamics of the financial system as the world transforms its economy. On the other hand, there is a VR/AR blockchain platform, the 5thScape, which exhibits a massive precedent in tech investment with an estimated ROI of 30,000 by 2024. This growth potential has been unseen in the financial markets. It is a clear sign of significant investment opportunity tied to the marriage of innovative blockchain technologies and emerging digital asset markets that marks a new era of progress for our digital economy and the burgeoning VR/AR business.\n\n5thScape’s Remarkable ROI Projection Amidst Ethereum ETF Growth with Fidelity’s $4.7M\n\nAmidst Fidelity’s substantial investment in the Ethereum ETF, 5thScape stands out with an extraordinary projected ROI of 30,000x by 2024. This VR/AR blockchain platform represents a significant precedent in tech investment, demonstrating unparalleled growth potential. The convergence of VR/AR technology and blockchain innovation positions 5thScape as a high-growth investment opportunity, with its unique features and promising returns making it an attractive choice for investors. While Fidelity’s Ethereum ETF gains traction, 5thScape’s exceptional growth potential underscores the importance of recognizing and investing in groundbreaking technologies within the evolving digital asset market.\n\nBuzz Around 5thScape’s Success\n\n5thScape, a groundbreaking project that merges Virtual Reality (VR), Augmented Reality (AR), and blockchain technology, has made significant strides in its presale. It recently surpassed $6.5 million in funding.\n\nThe project aims to develop proprietary VR hardware and software, including five AAA games, a VR headset, and a motion-support VR chair. Notably, the presale token price has been rising, currently at $0.00285, and is set to increase further.\n\n>>Click Here To Visit 5thScape Presale Page\n\nInvestors worldwide have shown confidence in 5thScape, with active wallets from countries like Poland, Switzerland, Spain, the United States, and Canada.\n\n5thScape’s roadmap includes creating its own VR Ultra Headset, promising precise motion tracking, high-resolution visuals, and intuitive controls. This headset will be compatible with various games and educational resources, extending beyond the 5thScape ecosystem.\n\nBeyond gaming, 5thScape envisions applications in education, healthcare, and enterprise. These include employee simulation exercises, enhanced learning experiences, and medical training.\n\nThe VR industry is rapidly growing, with a current valuation of $67.66 billion. By 2029, it will reach $204.35 billion (CAGR of 24.74%). 5thScape’s focus on developing its hardware and fostering a competitive VR ecosystem positions it well to capitalize on this market growth.\n\nCentral to 5thScape is the 5SCAPE token, built on the Ethereum blockchain. Holders can use it within games, purchase hardware, and access exclusive content. Developers can also contribute by designing new games and models for the ecosystem, earning 70% of subscription fees.\n\nMoreover, 5thScape’s innovative approach, ambitious goals, and market leadership make it an intriguing investment prospect.\n\n5thScape’s Earning Opportunities and Volatility Management\n\nOwning 5thScape tokens (5SCAPE) grants exclusive benefits. These include access to premium content, discounts, and lifetime privileges within the VR ecosystem.\n\nThe native token 5SCAPE plays a crucial role:\n\nUsed for trading within the platform.\n\nRewarded to players in the play-to-earn ecosystem.\n\nTradable like other coins\n\nIts capped market supply adds scarcity, potentially influencing its value.\n\nIndustry experts foresee substantial growth opportunities for 5thScape and similar VR tokens. As virtual reality gains mainstream adoption across gaming, education, and other sectors, demand for specialized VR cryptocurrencies is set to soar.\n\n5thScape’s VR/AR platform positions it at the forefront of revolutionary gaming and crypto integration. Beyond gaming, 5thScape can extend to DeFi (Decentralized Finance) and NFTs (Non-Fungible Tokens).\n\nWhile high-cap assets may yield 100–200% returns in a few months, 5SCAPE, with its smaller market cap, would offer even more significant profits.\n\n5thScape’s immersive virtual reality environment, combined with its strategic roadmap, makes it an enticing investment opportunity.\n\nConcluding Thoughts\n\nThe burgeoning growth of Fidelity’s $4.7 million Ethereum ETF highlights a significant shift in the financial market’s dynamics. Concurrently, the extraordinary projected ROI of 30,000x for 5thScape underscores a remarkable investment opportunity.\n\nBy merging VR/AR technology with blockchain innovation, 5thScape sets a new precedent in tech investments, emphasizing the transformative potential of these emerging digital assets. As both the Ethereum ETF and 5thScape continue to gain traction, they collectively signify a new era of progress and opportunity in the evolving digital economy."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNQURrakpnbk5QWGluMUZQRFJ5cTlKODhEUk1EMHVzLXFILTdjY1RUenVhSUlVWkZob2lNdnJ0WnFoSkExN2xKNkRSMnRPeGFQODgtQVZxMmwyTENmeVdRSDhTLW5NNGpIT1IxbUQ4UC1TeFdOUkZ3Qk5PR0lZcXpqb9IBiAFBVV95cUxNWXNoVEZjQ1Fja092NnNGR3RnVG9pZEhESDNaWDJ2ckYtNUpPT1NpcnZUNk9idUczYjZxVVRCVmVSLTlwYV9fNm9ZRnM2VVVvQkFMd2ZvN0d2c09CYkNSRnEwRENvQlpHWlJod3lpQ1c0LVVVMzhHSWpBc2draUNlOGUzQjVpRW9U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "What Are Blobs? Improving Ethereum’s Scalability - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOfficially introduced to the Ethereum network on March 13, 2024 in the Dencun upgrade, blobs are a new type of data storage space designed to make rollups cheaper and more efficient.\n\nThe consensus within the Ethereum community is that the best way to scale Ethereum is through rollups, also known as Layer 2s or L2’s, and that the best way to scale rollups is via the introduction of blobs.\n\nBefore blobs, if Ethereum went through a period of congestion, that would also affect the price of transactions on all of its Layer 2s. The introduction of blobs removes the correlation between Ethereum congestion and the cost of transactions on Layer 2s.\n\nWhat are blobs?\n\nBlobs are a new data structure introduced to Ethereum in EIP-4844, more colloquially referred to as “Proto-danksharding”. EIP stands for Ethereum Improvement Proposal—the process by which Ethereum core developers suggest improvements to Ethereum.\n\nProto-danksharding is the precursor to full-danksharding, and sets the foundation for it by introducing blobs. It does so in the same format in which they’ll be used when full-danksharding is implemented, in order to simplify the transition to full-danksharding.\n\nFull-danksharding, or just Danksharding, is an upcoming Ethereum protocol update. It represents what Ethereum core devs believe will be the last step (for now) in making Ethereum a truly scalable blockchain, by making transactions faster and cheaper.\n\nProto-danksharding is a step towards implementing Danksharding—it introduces concepts from Danksharding, such as blobs, to Ethereum. Starting with proto-danksharding and the introduction of blobs, instead of diving straight into full-danksharding, reduces the risk created by introducing drastic changes to a network too quickly.\n\nHow do blobs work?\n\nBefore blobs, when a Layer 2 needed to verify its transactions, it would batch up transactions, and send them to Layer 1 (Ethereum) to verify. The problem was, after the data was verified, it was still stuck on the Ethereum blockchain, taking up blockspace, forever.\n\nAD\n\nAD\n\nThis contributes to state bloat, and makes Ethereum more congested—which, in turn, also made Layer 2s more congested.\n\nWith blobs, when the data is sent to the Layer 1 for verification, it’s sent in a blob, short for “Binary Large Object.” Each blob has 4096 field elements and can hold up to 32 bytes of data per field element, which equates to around 75 MB per blob. You can think of it as a giant table of data, or… a big blob of data.\n\nBlobs improve on the previous method of verifying data in that once data has been verified from a blob, it can be deleted. This way, all the transaction data from every rollup built on top of Ethereum doesn’t have to live permanently on the Ethereum blockchain, taking up valuable space.\n\nBlobs also operate using a separate blob fee market—introducing “blob gas”. Blob gas is independent of gas on Ethereum mainnet, meaning the only things that use blob gas are blobs themselves.\n\nWhat’s so special about blobs?\n\nDespite the funny names involved in Ethereum’s Dencun upgrade, it’s a serious improvement. Blobs help to make Ethereum less congested, and they make rollups cheaper and faster to use.\n\nThis is because the data that’s verified in blobs can be deleted after use. As such, it doesn’t cause state bloat on Ethereum mainnet. “State bloat” refers to the fact that the more data that is processed by Ethereum, the more data lives permanently on its blockchain—and the more intensive maintaining that network’s “state” becomes.\n\nSeparating the blob gas market from the existing gas market is also a marked improvement. Because blobs have a separate gas market, congestion on Ethereum doesn’t affect them. In the past, if there was a large event on Ethereum such as a highly anticipated NFT mint, the congestion caused by this event would leak onto Layer 2s and make transactions there more expensive as well. Separating blob gas markets from traditional ethereum gas markets removes the correlation between Ethereum network congestion and Layer 2 transaction costs and speed.\n\nBlobs also make Layer 2s much more profitable. Before blobs, when gas fees on them correlated with Ethereum network congestion, the cost of operation for Layer 2s, and the Dapps built on top of them, were much higher. Lowering transaction fees make it so that builders and operators are able to run complex smart contracts or products at a fraction of the cost.\n\nAD\n\nAD\n\nBlobs at work\n\nLooking at onchain data from rollup.wtf, we can see that the majority of Layer 2s with the highest transactions per second are already using blobs.\n\nIn a tweet, Jesse Pollak, founder of Layer 2 network Base, revealed that after Dencun, the cost of a simple swap transaction on Base dropped from $0.31 to $0.0005.\n\nafter 2 years of hard work, blobs are now live on @base before: $0.31\n\nafter: $0.00 (but actually $0.0005) wallets need to update to handle these cost reductions! pic.twitter.com/solIX9D4HM — Jesse Pollak (jesse.xyz) 🛡️ (@jessepollak) March 14, 2024\n\nHowever, it hasn't been all sunshine and rainblobs. Blobs have been slower than anticipated when it comes to actually posting transactions to Layer 1. Creating a new gas market for blobs succeeded in decoupling Ethereum congestion from rollup transaction costs, but the gas market itself needs some fine-tuning before it’s everything it’s been hyped up to be.\n\nIn one example in June 2024, blob transactions became more expensive than their predecessor– but that can be seen as a sign that blob adoption is still in progress, and hopefully, as L2’s become more efficient at using blobs, more block builders start accepting blocks that include blobs, and blob capacity increases— the costs will go down.\n\nVitalik Buterin addressed both of these issues in a March 2023 blog post published shortly after Dencun’s release. In it, Buterin cites two core areas of focus that are needed to continue scaling blobs: “Progressively increasing blob capacity, eventually bringing to life the full vision of data availability sample with 16MB per slot of data space,” and “Improving L2s to make better use of the data space that we have.”\n\nSo while blobs have seen some growing pains, they were for the most part anticipated, and solutions are underway."
    }
]