[
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNMUh0Wkxwc0FfbFE3cWVXWmxGWC1yYUZuMzd5UWZUN3VaY2dBNjVPWDlBNWdwOWNOcGlhZ1dxVmxSTlJFQkFKc0QwclNrNzd3cm1TMGIwenlYTkxJVVphY3ItRzU2WmdCMnpnYklHdmMtVVJUUk1JcG9GenU5dFlWUUx0dkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Blast Mainnet Launch Boosts Ethereum L2 - Crypto Times",
        "content": "The Blast optimistic rollup, an Ethereum layer 2 solution, officially launched its mainnet on 29th February at 9 PM GMT. Since November, over $2.3 billion in ether and stablecoins have been deposited onto Blast, allowing users to earn staking yields and interest.\n\nThe Blast Mainnet is NOW LIVE\n\n\n\nEarly Access users can bridge to Mainnet and use Blast-native Dapps that don’t exist anywhere else👇 pic.twitter.com/mt5dJOADMp — Blast (@Blast_L2) February 29, 2024\n\nThe launch enables the first withdrawals from the network after deposits have been locked since Blast’s beta launch. The news comes after criticism from Paradigm’s Dan Robinson over the inability to withdraw funds.\n\nBlast aims to attract developers by allocating 50% of its community airdrop to mainnet protocols.\n\nA bonus goes to winners of its Big Bang competition that drew over 3,000 participating protocols.\n\nSome users found a way to deposit funds into Blast before the official launch by sending them to a smart contract address. Over $50 million has already been traded, mostly in memecoins like BlastCat. But depositing early carries risks as tokens can rug pull by removing all liquidity.\n\nNow live, Blast is the 7th largest blockchain and 2nd largest Ethereum layer 2 by total value locked at over $2.3 billion. Users can still earn Blast points until the token airdrop in May. Blast futures trading on Aevo implies a fully diluted valuation of $6.7 billion."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOTmplWGlIeWRFdzk2dUhlUXdWRzQ2R1M3TGIzV1FpNkdhaTB1S0xsMGZKUEZwaFZmLXluQUp3MmZMV2VDUnlTTUcyeUl1WlNFSjQ5OGZuSFhwS0s0ckZkSE52eGkzQ0t5WjU0MTZJMGZxOGxfRWJ2QXJhOTNYaGZOWEhFLTExcEo0Q0lrS2lfVVdWVVhy0gGaAUFVX3lxTE1VSEQ0cHBzQ2lQWERHdWtXWjZpdXBZa2NFaWZUR2xUakhIWVp0SEdfRzdGRmliZ1FUcHJlZGcwSl9UbWdKQ1dSeTBtMjdRYjRBdFVtMTg1THJsY2xTSWpocFhNbkpyNFBfTXhSRi1rTWtlalZQbVA1WVQ2cE1PWC13TFVJNXdUQTVEMVhLOEgtUVFRZmtmZWxhSmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Is ETH Headed for $5,000 in the Mid Term? - CryptoPotato",
        "content": "Renowned trader and technical analyst Michael van de Poppe believes altcoins are rising, and Ethereum is set to benefit from the upcoming upswing.\n\nVan de Poppe, who shares insights with his 697,000 followers on X, predicts a surge in the altcoin market, which could lead Ethereum (ETH) to potentially reach $5,000 as investors turn their attention away from Bitcoin towards altcoins.\n\n#Altcoin market capitalization is slowly moving upwards. The upside could be captured on Bitcoin, meaning a rotation towards altcoins. Therefore, Ethereum to $4,500-5,000 is likely, while altcoins will accelerate with 2-4x returns. pic.twitter.com/FKEaPpjrZv — Michaël van de Poppe (@CryptoMichNL) February 29, 2024\n\nIt’s worth recalling that layer-2s on Ethereum are experiencing a boom in Total Value Locked, pushing ETH to new peaks. Moreover, it seems the attention is shifting to the possibility of an Ethereum spot ETF by May 2024.\n\nThis week, multiple altcoins have exploded in price, especially meme coins like WIF and PEPE. Solana reached an intraday high of $134, gaining over 10% in 24 hours.\n\nPossible Bitcoin Correction?\n\nRegarding Bitcoin, Van de Poppe hinted at a possible correction following the substantial net inflows driven by institutional demand. He pinpoints possible support levels at $46,000 or $53,000.\n\nPoppe is not the only analyst warning about retraces. Daniel Yan, co-founder at Matrixport, warned against a possible correction of 15% by the end of April, which would be around $52,000-$53,000.\n\nSimilarly, well-known crypto trader Ali (Ali_Charts on X) reports a notable increase in profit-taking by Bitcoin whales, highlighting that over the past three days, they’ve sold off more than 80,000 BTC, equivalent to around $4.8 billion.\n\nAli also pointed out that the TD Sequential indicator has signaled a sell on the 4-hour chart for Bitcoin. He notes that since February 15, “every sell signal from this indicator has been spot-on, leading to $BTC price corrections between 1.50% and 4.20%.”\n\nHowever, only time will tell whether Bitcoin will find and sustain support above $50K or correct below that figure. One thing remains true —Bitcoin and the overall crypto market have had their best month in years, with BTC adding thousands of dollars to its price daily and most altcoins going vertical this week."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNYVRWQ1QzZmYtNHFhOEVUT1UwcVRLaWNacGdPNlFkc1lPVk53Vms0MVBJa2Y4OUl6TGlqc2JXcXlQQ0twRHdsRHdORVNWZmdXeFhWVVQ4c3lBOXRJdWhlWEE4Q0RBanZkRWY0U0RYQ0pVR09rdjNJYlk5REZWQ0cwTmdlSS1aQWV3Y3pLSXRQbEN0VkVwN1BVai1rS2k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Ethereum memecoins go viral with $6.4bn traded in February - DLNews",
        "content": "Ethereum memecoin trading volumes surged by 61% in February, reaching over $6.4 billion.\n\nMemecoin market dynamics are influenced by their meme appeal rather than by utility, showcasing a unique aspect of crypto speculation.\n\nSmaller market cap memecoins on Ethereum, MOG and GROK, saw extraordinary gains of 920% and 172%, respectively.\n\nTrading volumes for memecoins on Ethereum soared by 61% in February from January, reaching over $6.4 billion.\n\nMemecoins are cryptocurrencies that draw their inspiration from internet memes, pop culture phenomena, and trends that have gone viral.\n\nThe coins hold no inherent value. Instead, their price appreciation is driven by the attention they garner from traders and speculators.\n\nThe prices of memecoins on the Ethereum blockchain with market capitalisations of over $1 billion exploded in February. Pepe, Shib, and Doge all soared, rising 292%, 57%, and 59%, respectively.\n\nSmaller market caps on Ethereum, MOG and GROK, rose 920% and 172% in February from January.\n\nPrice history of memecoin MOG\n\nMOG describes itself as “effortless cosmic domination and unadulterated success distilled into computer photons, wrapped into ERC-20 tokens, and placed directly on the Ethereum blockchain.”\n\nThe GROK memecoin was inspired by the release of GROK AI from Tesla CEO Elon Musk, but it has no official relationship with GROK AI. Rather, GROK, the memecoin, describes itself as “establishing a community of GROK AI enthusiasts who want to save the world and love making memes while doing it!”\n\nThis is all to say that memecoins are quite random and their price performance doesn’t come from utility, but rather from how well the meme behind the coin resonates with crypto traders.\n\nJoin the community to get our latest stories and updates\n\nIn December, memecoin trading was largely dominated by Solana, but now volumes have shifted back to the Ethereum mainnet.\n\nVolumes on Telegram trading bots, which are apps designed to simplify onchain trading by letting users trade on decentralised exchanges through the popular messaging app Telegram, have also shifted to Ethereum mainnet over the last month.\n\nThe top trading pairs on Telegram bots are generally memecoins, and so it provides insight where memecoin trading volumes might be.\n\nPrevious 30 days of Telegram trading bot volumes. (Whale Hunter)\n\nAlthough trading volumes are dominated by Ethereum, memecoins have still been successful on other chains.\n\nPopular Solana memecoin dogwifhat, WIF — named after an internet meme of a dog wearing a pink knit hat — hit an all-time high today of $1.10, giving it a total market cap of $1.1 billion. This is a 70,000% gain since the coin launched on December 13 at a price of $0.0015.\n\nBase, an Ethereum layer 2 blockchain, witnessed its native memecoin, Toshi—named after the cat of Coinbase CEO Brian Armstrong—reach an all-time high of $0.00018. The surge pushed its market cap to over $75 million.\n\nGot a tip about DeFi? Reach out at ryan@dlnews.com."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNM2phdXo1N0lTOWRCbVRxeVM3aW53V2NQV3ExM3J5QkFISnhUaklzcDNuWUFGa2VMb0g3WU5vZmtpLTFtVXkxczVBam1wUEFrSnZBZDBsY0RrUmVxaWNnM2kyaWFHX0wtcmFkcVZyWnk2bTJQOHNtRTFHaUJlTjFjS3A4VDdFVnZsUWoybGZYSGRyanpFa2tiejlKbVVoQ215c1haOHZpNWtLMHJjNzdZQ0J30gG3AUFVX3lxTE5ra3VLc3VMRVBUUEI5V28tNWx4TTFmZml5eldOOVVWWHZVS2FubVEtQkIyTnlXMGFFZ0pDLXhvREpUZE84dEUwTnliRlI2NEpqdnZ2S2txcnVQTUxmcnB2NVBGbFhnalJlYzJaZE5BQk5EanNzUUFjSEJYVnpVOWZvMUFLRjhCZ3R4ZUdsOWNhZTE1TERlZ3QxcW82SFJkdURicFFWUHhXNVVFMUc0TTFpb3o1Nkp1aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Solana (SOL) Performs Enormous Breakthrough, Ethereum (ETH) Euphoria Continues, Will Bitcoin (BTC) Reach ATH in Next Few Days? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nSolana has broken through a critical resistance level, marking a potential trend shift for the cryptocurrency. The chart indicates a significant break of the upper trendline resistance, establishing a new movement scenario for the asset.\n\nSolana has showcased remarkable price performance, as evidenced by its latest rally past the upper trendline of its ascending channel. This breakthrough is a classical technical confirmation of bullish sentiment, and it suggests the possibility of a sustained upward trajectory. With SOL's price pushing through the $130 mark, the cryptocurrency has not only defied immediate resistance but has set the stage for testing further highs.\n\nLooking at the support levels, Solana's price is comfortably positioned above the 50-day (orange line) and 100-day (blue line) moving averages, which have historically acted as dynamic support in uptrends.\n\nThe immediate support level now stands around the $107 mark, which coincides with the previous resistance-turned-support trendline. The robust volume accompanying the breakout adds credence to the bullish outlook, indicating strong buyer interest.\n\nAdvertisement\n\nConversely, the next resistance level to watch is near the $140 zone, where profit-taking and psychological round numbers may temporarily stall the rally.\n\nEthereum looks unstoppable\n\nEthereum continues its meteoric rise, currently showcasing a price surge that has left investors and enthusiasts in a state of euphoria. However, amid the celebration, if a vigilant eye is cast toward the chart, signs of a potential bearish reversal loom, warranting a closer analysis of the second-largest cryptocurrency's extraordinary rally.\n\nEthereum's rally has been nothing short of spectacular, with prices breaking past resistance levels with apparent ease. As of the latest trading sessions, ETH stands tall above $3,500, yet this unstoppable rally may have investors questioning the sustainability of such growth.\n\nShould a reversal occur, the focus would shift to potential support levels that could cushion Ethereum's descent. The $2,695 mark emerges as a critical juncture, aligning with the 50-day moving average, a dynamic level that historically serves as a battleground between bulls and bears. A breach below this level could see Ethereum testing the $2,065 support, near the 100-day moving average, which may provide a stronger foundation for the digital asset.\n\nThe current trend indicates that while the market is riding a wave of optimism, caution is advised. Ethereum has defied traditional market expectations, but no asset is immune to corrections. The foreseeable future suggests that if traders begin to lock in profits, a bearish scenario could unfold, triggering a sell-off toward the identified support zones.\n\nBitcoin's strength is rising\n\nThe cryptocurrency flagship, Bitcoin (BTC), is showcasing a formidable display of strength on the market, with its price trajectory pointing sharply upward. As the market rides a wave of euphoria, the question on many investors' minds is whether Bitcoin is poised to reach new all-time highs in the near future.\n\nBitcoin's price has been on a relentless climb, and the latest candles on the chart reflect significant buyer confidence. Currently, the price has surged past the $60,000 resistance level, an important psychological barrier that could now be serving as a platform for further gains. The steep ascent is accompanied by a substantial increase in trading volume, indicating a strong conviction behind the move.\n\nThe moving averages - 50-day, 100-day and 200-day - are aligned in ascending order, which is a classic bullish signal. These lines are likely to act as dynamic support levels in the event of a price retracement. The 50-day moving average, in particular, has been a reliable support throughout the recent rally, suggesting that any dips might be viewed as buying opportunities by bullish investors.\n\nAs of now, the RSI is trending toward overbought territory, suggesting that Bitcoin is extending into an area where a reversal could occur. However, during strong trends, assets can remain overbought for extended periods, defying the traditional expectations of an immediate pullback."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNUk9rdmRrUTdlQXpTNG95ejBIbHJ1bnVSazZRbDdtTVV6b0RhRE80RDRHcTR3Umx2a3U2WVlZYzFvWUxPdnRDQXFUZjM1V1Z1THdVcVRpRFdyenAwYUU1SUZjbFdtUk5aS2xLajUtRTNYQ2xIN292enU5Zi0tT0xXMkVlNHhZMWVpNG9BMWhEcEZ4aGZyQU5oMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Ethereum’s Dencun Upgrade Can’t Come Soon Enough as Gas Fees Surge - Unchained",
        "content": "Ethereum users say they are spending upwards of $100 on gas fees for swaps and NFTs during peak times. The upcoming Dencun upgrade will lower fees, but there is a caveat.\n\nEthereum users are struggling with high gas fees as usage increases on the network.\n\nBitcoin’s renaissance\n\nand a\n\nspectacular rally\n\nin cryptocurrency prices is making life difficult for users of the Ethereum network.\n\nAs user demand and interest in both bitcoin (BTC) and ether (ETH) surges—on the back of the approval of spot bitcoin ETFs in the US and the potential approval of spot ether ETFs — gas prices on Ethereum are spiraling out of control.\n\nAt peak times, users are reporting paying over $100 in transaction fees for swaps, which is the exchange of one crypto token for another on the network. The average gas fee for a swap transaction is currently around $79, according to data from Etherscan.\n\nGas prices for swaps back above $100 lmao — Pentoshi 🐧 euroPeng 🇪🇺 (@Pentosh1) February 28, 2024\n\nThe “top gas guzzlers” are decentralized exchange Uniswap and Blast, an Ethereum layer 2 network that launched on mainnet yesterday. Respectively, they’ve earned $2.5 million and $1.4 million in fees within the last 24 hours, per Etherscan data.\n\n400 fucking dollars to migrate .1 ETH to Blast mainnet. It's so over. Pack it up. Ethereum is unusable today. pic.twitter.com/hZRrwRAMlz — Pop Punk (@PopPunkOnChain) February 29, 2024\n\nThe high transaction fees once again draw attention to Ethereum’s scaling challenges and how difficult it can be to onboard new users to the network during times of increased interest.\n\nEthereum is not blind to these issues, which continue to reoccur in bull market cycles. Ethereum has an ambitious multi-year roadmap to reduce transaction fees, increase security, and future proof the network.\n\nRead more: An Overview of Ethereum Scaling\n\n“Ethereum is trying to learn from this mistake of pricing away marginal users to other, cheaper chains,” said Luke Nolan, Ethereum research associate at digital asset investment manager CoinShares. “The proposed and implemented solution is to scale through layer 2 solutions, mostly rollups.”\n\nTwo key upgrades from the roadmap have already been implemented including “The Merge,” which was Ethereum’s transition to the proof-of-stake consensus mechanism, and the “Shapella” upgrade, which enabled the release of staked ether withdrawals. The next major upgrade is Dencun, which is scheduled for March 13.\n\nRead more: What Is the Cancun-Deneb (Dencun) Update on Ethereum?\n\nOne of the key introductions in the Dencun upgrade is a new transaction type called “blobs.” Ethereum layer 2 rollups currently post data to Ethereum using calldata. This is costly and makes up around 90% of the gas fees that rollups pay to post bundled transactions to the network. After Dencun, layer 2s will post the data to blobs, which are highly optimized and are much cheaper than calldata.\n\n“Overall, yes fees will reduce on Ethereum, but only for layer 2s,” Nolan said. “The general hope here is that layer 2s will become sophisticated enough over time, with seamless UX, high speed and low transaction costs … In this end state, Ethereum can compete with any new fast chain that comes out of the box because layer 1 continues to be the secure settlement layer, and layer 2 becomes the data availability layer that allows it all to scale to new heights.”\n\nUnder the upgrade, transaction fees on layer 2s will decrease between 10 to 100 times depending on the chain, said Nolan, adding that it could get very close to “Solana-esque transaction fees.”\n\nSolana’s Surge\n\nThis fee reduction couldn’t come soon enough for many users. Many Ethereum users, particularly those who trade NFTs, are talking about moving to Solana, which is a layer 1 blockchain that offers much cheaper transaction fees.\n\nIt costs 52 dollars to purchase a standard ERC-721 off Blur right now. It costs another 20-30 dollars per marketplace you want to list that NFT on. and that's with gwei relatively low (70) by bull market standards ETH does not make sense for the majority of NFT collections. — root (@rootslashbin) February 27, 2024\n\nThe average transaction costs for NFTs on Ethereum is around $140, per Etherscan, which is sometimes more than the cost of the actual NFT being traded. While on Solana, the average cost of a transaction is 0.000036 SOL, which is $0.0047, according to data from Solscan.\n\n“As of the last few months, a lot of attention has shifted to Solana NFTs, which has certainly taken some of Ethereum’s market share,” said Nolan, adding that Ethereum NFT trading is not back to the same transaction volume levels as last year.\n\nMost activity on Ethereum is centering around collections with high floor prices such as Bored Ape Yacht Club and Moonbirds, Nolan said. They have floor prices of $75,000 and $4,000 respectively. In these scenarios, a trader is unlikely to be phased by a $100 transaction fee.\n\nDaily NFT trade volume on Ethereum in millions (CoinShares)\n\n“Whilst on Solana I would venture to say that the activity for smaller collections (as well as big ones) has been picking up because transaction fees are 100x smaller on average and so the smaller value accounts have logically flocked over there,” Nolan said. “It has made for a much more enjoyable speculative playground for participants.”\n\nWeekly NFT volume on Solana in millions (CoinShares)\n\nThis is echoed by Anastasia Melachrinos, a DeFi product manager at crypto data firm Kaiko, who notes that new users are generally entering the blockchain ecosystem through centralized exchanges or directly via Solana.\n\n“It is without a doubt that high throughput upgradeable chains like Aptos or Solana will receive most of the non crypto native traffic, which is most of the world in the case mass adoption does take place,” said Sharvin Baindur, chief of staff at investment firm Saison Capital, who focuses on investing and supporting high performance and low cost blockchains.\n\nEven if gas fees on layer 2s are reduced to Solana levels, Nolan notes that Ethereum layer 2s still face challenges around fragmentation and poor user experiences, which can act as a barrier to capturing those smaller value transactions. On the flip side, Ethereum and layer 2s have a strong reputation and a very complete ecosystem, so once the execution cost is fixed the barriers to entry to those chains will be lowered, Melachrinos said."
    }
]