[
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPemxnUWFzUUlhb2xMOUpTOGt0RTA5SUVFRDJtNTZmdV80QWVqNEEzc2RhMDNVbU96T1cwbElqOGtUQm9JbnRzZFhOdm9zUGFoWGk5UXRCU3ZaT3UwdlVGWF83SF8yQXIyamdYdmVSVTBTWXUwM1BFeUUya3lNZXFCbUZOMDZHd2E4MGlWdWxB0gGTAUFVX3lxTE0xWUJHckxFZlhXVDBZM2J5eF9BVnpzTWxWeFBwMG15SzdKMUZxTi03SGY5T1ZrNnhFcm1oMWo0WndLOElxTUVSal92dFI1MEpXQXJ5b0NHQl9xTFM5Ul9lVzNwSnVMTzNBMkdIbEtzcHJWczlBM05ySkJYZkMxSklqT25uUVlSa0tJbXowc20zY0tIdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Apr 2024 07:00:00 GMT",
        "title": "Solana to $1000 or Ethereum to $10,000? This analyst is betting on… - AMBCrypto News",
        "content": "Crypto-analyst bets SOL could hit $1k and outshine ETH in this cycle\n\nETH proponent believes the altcoin could climb as high as $10k\n\nCrypto-Twitter is back on the Solana [SOL] vs. Ethereum [ETH] debate again. So, which token will emerge as this cycle’s best performer? Well, as expected, both the Solana and Ethereum camps feel they’ll emerge to be top.\n\nIf the last 24 hours are taken into account, it would seem that SOL has a headstart of sorts. While SOL hiked by 9.5% and climbed back above $140 on the charts, ETH appreciated by a mere 3%, according to CoinMarketCap.\n\nSolana also outperformed Ethereum in Q4 2023 on the price charts. It’s not surprising then that crypto-analysts like Ansem are uber-bullish on SOL. In fact, in doing so, he also downplayed Ethereum’s edge on Solana, stating,\n\n“There is not a single thing Ethereum does better than Solana, was true before the metrics shifted last year and is even more true now with objectively verifiable data. $1,000 per $SOL”\n\nThe analyst also cited Solana’s commendable improvement in DEX (decentralized volume), daily active users, and validator data to predict a 7x potential surge from its press time levels.\n\nEthereum is still a big shot\n\nOn the other hand, Ethereum’s community is confident the token can hit $10k on the charts. Some community members like Ryan Adams of Bankless actually think that the target should have been reached by now.\n\nReferencing ETH’s massive revenues, Adams recently claimed,\n\n“No, Ethereum isn’t like the other chains. Ethereum is profitable. Over the past 18 months, Ethereum generated almost $1 billion in earnings.”\n\nAdams added,\n\n“Ethereum is only 9 years old. ETH should be over $10k based on this alone.”\n\nApart from higher revenue, TVL (Total Value Locked), and overall market cap, Solana dwarfs Ethereum on several fronts, as evidenced by a previous AMBCrypto report.\n\nHowever, the price chart performance is the most crucial for HODLers. A possible ETH move to $10k from $3.1k means a potential 3x upswing. Even if you take the wildest estimates, ETH’s 3x would be way lower than SOL’s 7x potential.\n\nIn other words, SOL might have higher potential for gains if the bull cycle explodes. That being said, ETH could play catch-up if the United States finally approves Spot Ethereum ETFs."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQWXQ5S0VacllIQ0xQZDEyUkRESjJxUlc0X3lyaFo2QkhmQklob2laZzVCSFRrWkpGSDdUOWJjUl9GdjFoVmVNNDRzd0xnNjA3SGZCc1RZX2tQZWhBQlhLQktWVUZwNXhaTHRhaGFHZkNURFpwWEhVYVVGTWJPdU50ZDZfTS0zNlE4dy10NTRlRWRUczgyNnZYR1FsZjREOUxiSEHSAacBQVVfeXFMUDktVjZTMTRLNVhyWTZMbHpTU1ZtWlFvcHF6MjZtUXd0a1FSbHl1Qkt2Qy1fc0Z0YkI2U2t1ZlFEUzA4VGFDbXlnUmJLbkpublpxSzhfVmxEb2VZZUUwODk3TWdWY1RMc3d0VFFFZk90RE0ySEFPUm5tYzNRWUdqVURvMkNCdGNlMG9VWTN1RlpZcWVZbjg1Q0FpMXRjTG9iMzNoNmhJdk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Poised to Retest $3.5K as Bullish Sign Reappear (ETH Price Analysis) - CryptoPotato",
        "content": "After experiencing a rapid downturn, Ethereum has found itself supported by a substantial zone, comprising the 100-day moving average and a critical price range between the 0.5 and 0.618 Fibonacci levels. Consequently, a bullish rebound is anticipated in the medium term.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA thorough examination of the daily chart reveals an extended period of corrective retracements, culminating in the price finding support within a pivotal zone.\n\nThis zone encompasses the 100-day moving average at $3050 and the significant price range between the 0.5 ($3190) and 0.618 ($2972) Fibonacci levels.\n\nThis range carries significance as it attracts considerable demand, potentially hindering further downward pressure from market sellers. Additionally, a minor bullish divergence between the price and the RSI indicator suggests the potential for a bullish resurgence, targeting a reclaim of the $3.5K threshold. However, despite the bullish indications, an unexpected breach below this critical support zone could trigger a cascade effect toward the 200-day moving average at $2.5K.\n\nThe 4-Hour Chart\n\nA closer inspection of the 4-hour chart reveals the formation of a descending wedge pattern during a multi-month consolidation correction. Following a significant decline, the price has reached the lower boundary of the wedge and the support region around $3K.\n\nNonetheless, given the potential buying pressure within this crucial range, the price has entered a consolidation phase characterized by minimal volatility.\n\nThis price action highlights a tug-of-war between buyers and sellers. Nevertheless, a noticeable divergence between the price and the RSI indicator on the 4-hour timeframe suggests the strength of buyers, increasing the likelihood of a bullish upswing in the medium term. In such a scenario, the next target for the price would be the critical resistance level at $3.5K. Conversely, should a break below this support occur, a descent toward the $2.7K support becomes increasingly probable.\n\nSentiment Analysis\n\nBy Shayan\n\nAs Ethereum’s price exhibits signs of recovery, it’s crucial to determine whether this resurgence stems from spot buying or leveraged futures activity. A key metric for this analysis is the funding rates, where positive values signify bullish sentiment and negative values indicate fear in the market.\n\nObserving the recent downtrend in Ethereum’s price, it’s notable that the funding rate metric has mirrored this trajectory, steadily declining until reaching near-zero levels. This alignment suggests that the recent price drop has led to the liquidation of a significant number of positions in the perpetual market, resulting in a cooling effect on the futures market. Consequently, the market appears primed for the re-emergence of long positions, with the potential for a fresh upward surge."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNek9QanQzSVU3ckNSQlZIQnhtS3poSDR2a2pRMnlMMzlhcUFFQ0w1S1ZBQ2FFLUdfN3E3c1gxTVZuTVNkVWt3WWVoT29WQm1kTDRid0lDYmxEd0U4VmlrTmp5MFBFNGtvM2h6RUdYTVk4VF9fOE5xTms0TlpzS0FHQWcyLTFDaHN4cW5SYmNuellxaWlOaDdWQjVQaWNUQVBfMXlB0gGoAUFVX3lxTE9lRGN1YjJDdlBlVF9aemd5dnlMSkYtampmNWtsclBuZlJIbVZsaU1LUk1nUUVUMzZxMU4tQW43T0xyR2JUVDZGM1hLUDhSMmNZM0tDNm81cGdoVDNLejlwNTJCdEpWejM5U1V5MF9UZlU3bEgxOGNLSFFQTGt4Wk1BUFlsMks1WFhsRTlBWnFpLTBrUzB1M2ZaazgxVWtiRXV2WUdKdWp2aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Apr 2024 07:00:00 GMT",
        "title": "EY Launches Ethereum-Based OpsChain Contract Manager for Business Contracts - CryptoPotato",
        "content": "Ernst & Young (EY) has launched OpsChain Contract Manager (OCM), an Ethereum solution that leverages zero-knowledge proofs technology.\n\nThe solution will help private businesses efficiently manage and execute intricate business agreements while ensuring confidentiality, timeliness, and cost-effectiveness.\n\nEY Launches the OpsChain Contract Manager\n\nEY, one of the top “big four” accounting firms alongside Deloitte, KPMG, and PwC, has been exploring the business applications of zero-knowledge proofs (zk proofs) since at least 2018.\n\nOpsChain Contract Manager (OCM) is tailored to facilitate the secure management of business contracts on a public blockchain. By leveraging zero-knowledge proofs, OCM ensures contract integrity and confidentiality while enhancing efficiency and reducing costs.\n\nThe platform integrates with existing enterprise systems through a standardized API and supports various contract types, including volume purchase agreements and pricing models linked to market data feeds.\n\nThe development of OCM came from EY’s previous client engagements, where it realized that contract term accuracy could be enhanced while significantly reducing cycle times and administrative costs by approximately 90% and 40%, respectively.\n\nMeanwhile, EY chose Ethereum, a public blockchain, over a private network to prevent any party from gaining undue advantage while mitigating the risk of sensitive business information leakage.\n\nPaul Brody, EY Global Blockchain Leader, highlighted that the technology behind OCM, Nightfall, initially emerged on Ethereum and underwent testing on its test network. The upcoming update will transition Nightfall to Ethereum’s mainnet and may incorporate a Layer-3 upgrade to enhance scalability and functionality.\n\nEY’s Venture Into Blockchain\n\nEY’s launch of OpsChain Contract Manager comes amid increasing blockchain adoption by major financial players. BlackRock also recently entered the space with a tokenized fund on Ethereum.\n\nEY’s OCM reflects its commitment to revolutionizing how enterprises handle contracts, focusing on enhancing process efficiency and transparency through blockchain solutions. By integrating blockchain into traditional business practices, EY sets a precedent for the industry’s progression toward embracing this transformative technology in routine operations.\n\nThis latest development builds upon EY’s ongoing engagement with the blockchain sector. EY recently made headlines with a “healthcare breakthrough” by leveraging blockchain technology in collaboration with Canadian Blood Services.\n\nIn October 2023, EY unveiled the fourth generation of its EY blockchain analytics tool, Reconciler, designed to aid Fidelity in enhancing internal risk management for digital assets.\n\nIn September 2021, EY also announced its collaboration with Polygon to integrate Polygon’s solutions with EY’s flagship blockchain services, including EY OpsChain and EY Blockchain Analyzer."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxPZjVubFk2YlJrVllrS3VTaTl0a2VGaHA2LVVaZE5pR0ZCOUVZWnpfaThZemtaMlNBTjRNQmIwWmtxSGhCemwwU2VqeFpzd3M3ZmhXY1d0QVgtSzkxQ3NhRUpmbTFVNlJJdDczclhaMU1qOG12MmR4dzdUTXYyWEhrbDJDTDI1akYtVGhxTGs5LTMzWWhFT1MzcmtwZ2huRndhYU1odUdUSkpkblAzX0luQkt6RGZyQ2E4TjhBNXJxN0NnWUhhdkVKbE1R0gHPAUFVX3lxTE5CSXY5UnVxX2ZmUVlrUV95dXZ0WmVsS2loZ1ZlQWc3WUdDTkl1X2dpc3N3c3JGV2twZ19zUHEySndiTTltaGVkOVZCQlpCSkFBc3RhWWdTRDZNRWUwc2xXbXYyVTF2ZkptN21QeUZxY00teU1IMDEyN3pyWUhXdTZDUjNZemhQYWRWOU1vd3lxcU92WlVsYnlJc0p2RGd4elZGUDJjcWptVUpiTm9pVVdDWVpDMnlaVU9SVDZuZGlIYjk0MmxseVFfZTBpb0NFOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Apr 2024 07:00:00 GMT",
        "title": "Ethereum resumes consolidation after brief dip, buyback yield exceeds that of major S&P 500 companies - FXStreet",
        "content": "Ethereum whale jumps on ‘buy the dip’ opportunity after Israel's attack on Iran.\n\nThe buyback yield of Ethereum exceeds that of major S&P 500 firms.\n\nEthereum may continue trading inside key range as investors await the market's response to Bitcoin halving.\n\nEthereum resumed its sideways movement on Friday after briefly crashing due to Israel's attack on Iran. The move presented a buying opportunity for a whale, who quickly profited from it. This also comes when Ethereum's buyback yield exceeds that of several S&P 500 firms.\n\nRead more: Ethereum shows firm support at key level as its correlation with US indices increase\n\nDaily digest market movers: Israel's retaliation, whale activity, buyback yields, Hong Kong's ETH ETF\n\nEthereum wasn't left out, as the entire crypto market took a hit on Friday following Israel's strike in retaliation to Iran's attack on April 13. Here are your key market movers:\n\nAs ETH dipped briefly on Friday, a whale jumped on the opportunity, spending 9.5 million USDT to buy 3,253 ETH at ~$ $2,925, according to crypto analytics platform Spot On Chain. However, ETH's price has quickly recovered, especially as Iranian officials have downplayed responding to the attack. As a result, the whale made nearly $625,000 in unrealized profit.\n\n\n\nEthereum is outshining major tech and financial giants in terms of buyback yields, according to Token Terminal. In a list of $200 billion+ finance and tech S&P 500 companies, including Apple, Alphabet and Berkshire Hathaway, Ethereum ranks number 16, above Tesla and JPMorgan with a buyback yield of 0.23%.\n\n\n\nBuyback for Ethereum, in this case, is implemented through token burns that began after The Merge in 2022. The number one smart contract blockchain achieved this feat in only nine years compared to the median age of 44 years of other companies in the list.\n\nETH buyback yield\n\nAlso read: Ethereum moves sideways as Q1 report indicates token burns are making it deflationary\n\nMeanwhile, Bloomberg ETF analyst Eric Balchunas expressed doubts that Mainland China investors may not get access to Hong Kong's spot ETH ETFs when they start trading. This pessimism is based on China's ban on all crypto-related activities in 2021. However, other analysts have pointed to Hong Kong's positive reception to crypto investment as a good sign that spot ETH ETFs would see impressive inflows when they launch in the region.\n\n\n\nDespite ETH's brief price decline, ETH's long liquidations weren't heavy, sitting around $34.4 million in the past 24 hours. This may be due to heavy liquidations already seen earlier in the week.\n\nTechnical analysis: ETH may continue trading inside key range\n\nETH attempted to break the $2,852 support on Friday after Israel attacked Iran. However, prices have quickly bounced back, and ETH appears to be continuing its consolidation. The calm may be due to investors exercising caution as they await how the market responds to Bitcoin's fourth halving, which is a few hours away.\n\nRead more: Ethereum declines as crypto market crash increases bearish sentiment\n\nConsidering that many analysts have predicted that Bitcoin halving is already priced in, ETH may experience light volatility in the next few hours.\n\nETH/USDT 4-hour chart\n\nBut in the coming weeks, it won't go outside the range of $2,852 and $3,406 formed in recent price movements, except if major external factors prevail on its price. In the long term, ETH could test the resistance of $3,730. An unlikely approval of spot ETH ETFs by the Securities & Exchange Commission (SEC) would send it past the $4,000 key level to a new all-time high."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxNNEcybEUzV0VZQXhXUjg5QUliN2k0MDlWZVJ3VW9kYXNyMnB5UWc1RjZjSHJqNFNxc3dLTkI0ZW9EcFllRDkyN3BPTEFFNWk5N0xYUVVMQVN2TFRHV05GOWE0WHhKLWVKdThGQ29KY0VuSmFNQmNCMGlCTHhObW00U0YwcjBhYklWU3lvMERkQXRocjJ3QmJuWTZhS2lqQktaazB1R2ZxZkkwaGdtX0hDZ0N3Rk1OVWdhUmdBVTBTV3lxNFpRUDEySDJNVGhTWG5HQld5NWR2bTIzcEw5ek9wTU1PQlY4YnZ50gHuAUFVX3lxTE1mWVBQV0kxSlZpc1FzR3ZTTm5ZSUM5c3Y5dE5nQkhMUzZYYVlfSGtDSko5SVJTNHpicXM5Q3FKbnc5MVhuZlFXSVlqRU0zbzloc1ZhRE9MRUk1OHM4cXJuLWZFMVlQVVl2dFhaQVdVLWlZb3JqVWw3MjRxSzBTY3RRNTgwQXlhWHBmQ3MzeV9XR1hQM0NRU1AxcEVCQ2NkUjk0ZTUzMkQ3TnlqUHRRT3hDRVZ4ZndPWWV5SHBCVGt3T1BadU1fT0VtS0RUS1JLb3RDb1BUeWtxV2tEdmFaT19WQ0FvX0drTy1lU2ViWHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Apr 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Altcoins come ashore after BTC halving arrival - FXStreet",
        "content": "Bitcoin price could drop to $60,000 or lower as investors cash in on BTC halving news.\n\nEthereum price could make a bullish breakout if altcoin market cap seesaws against BTC price.\n\nRipple price holds above support, could reclaim above $0.5783 as XRP bulls reawaken.\n\nBitcoin (BTC) price remains lull, but the outlook seen among altcoins is different with Ethereum (ETH) and Ripple (XRP) holding above key levels. It comes following the successful arrival of the fourth BTC halving, which has Bitcoiners and market enthusiasts euphoric.\n\nBITCOIN 'HALVING' CUTS IN HALF REWARDS PAID TO MINERS — *Walter Bloomberg (@DeItaone) April 20, 2024\n\nThe highly awaited Bitcoin halving finally happened on Saturday, with the Bitcoin block height hitting 840,000. In the aftermath, the global cryptocurrency market capitalization has increased by 3.22% to $2.32 trillion. It comes as altcoins begin to reawaken, with most flashing green to outperform the pioneer cryptocurrency.\n\nAlso Read: Bitcoin halving concludes successfully as BTC miner rewards reduce to 3.125\n\nBitcoin price could drop to $60,000\n\nBitcoin price remains lull following the conclusion of the BTC halving, and in the ‘sell the news’ situation the big crypto risks a correction to $60,000 or lower. Notice the lower lows and lower highs on the Relative Strength Index (RSI), showing momentum is dropping.\n\nIn its place, the Awesome Oscillator (AO) is edging toward negative territory as the red shade intensifies. Similarly, the Moving Average Convergence Divergence (MACD) has slipped below the orange band of its signal line, suggesting a potential bearish cycle.\n\nBitcoin price could drop below $60,000 to test the $59,530 support or extend lower to the $50,420 threshold.\n\nBTC/USDT 3-day chart\n\nConversely, a surge in buying pressure could send Bitcoin price further north. A decisive candlestick close above the $70,000 psychological level on the 3-day time frame would confirm the continuation of the uptrend. This could see BTC price reclaim its $73,777 peak, or higher to record a new all-time high.\n\nAlso Read: Bitcoin Price Outlook: When should BTC peak post-halving?\n\nEthereum price coils up for a breakout\n\nEthereum price is consolidating within a falling wedge pattern, a bullish reversal technical formation that could see the largest altcoin rise. ETH is back above the $3,000 level and could record a bullish breakout as the market capitalization of altcoins seesaw against that of Bitcoin.\n\nThe RSI is tipping north, primed to recover above the 50 mean level. If it does, it could precipitate a strong move north for Ethereum price to extend higher.\n\nETH/USDT 3-day chart\n\nConversely, early profit booking among the bears could see Ethereum price drop, with a slip below $2,850 support negating the bullish thesis. This could see the fall extend to the depths of $2,500.\n\nAlso Read: Ethereum resumes consolidation after brief dip, buyback yield exceeds that of major S&P 500 companies\n\nRipple price shows strength\n\nRipple price could move up as it holds above the ascending trendline. The RSI seems primed for a pullback as it rejects further downside as it holds above 34. If XRP bulls are able to haul above 50, it could kick off a strong move north, sending Ripple price above the $0.5783.\n\nA decisive candlestick close above this level on the three-day timeframe would encourage more buy orders. To confirm the continuation of the uptrend, bulls should watch for a candlestick close above $0.7630, the mean threshold of the supply zone between $0.7277 and $0.7959.\n\nXRP/USDT 3-day chart\n\nOn the other hand, if the bears pull XRP price below the ascending trendline, it could encourage a sell off to send the Ripple price to the $0.4183 support. In a dire case, the altcoin’s price could drop all the way to the $0.3078 support.\n\nAlso Read: XRP fails to break past $0.50, posting 20% weekly losses"
    }
]