[
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNMHU4Y2JxR0J3SjMzS2sxbEx3anJxY3lfOU5IU2g2VGhxRnItZ2t5UXFxdEVxSm5NcVJjak16SXZ2eWtJb1A3VHdLcGJDX01wb3RvTUlJQm00bHZheFZGcTNpVElVRDlmUjNMWENLbWRvTUYxY2hRR05xMWtpZUxSbnhCWkZ4MmU4UGMxRFlaUE05aTQ0Mmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Transfers $1.01B Ethereum to Coinbase Prime - Crypto Times",
        "content": "Recent reports indicate that Grayscale transferred $1.01 billion worth of Ethereum to Coinbase Prime. This is in preparation for the U.S. debut of Ethereum-based exchange-traded funds (ETFs), which have been approved to start trading as from today.\n\nThis early transfer has led market speculators to wonder if Grayscale might reallocate its Ethereum holdings to other cryptocurrencies like Solana.\n\nHowever, Jon Campagna, the managing partner at crypto hedge fund Nexyst Digital and a former associate at Coinfund and BlackRock, refuted these claims. In a post on X, Campagna stated that Grayscale is unlikely to reallocate its Ethereum assets.\n\nThis is a bit deceiving. On July 18th Grayscale carved off 1/10 of all ETHE holdings into a new “ETH” ticker for their ETF. They said the new ticker “ETH” would go live and ETHE holders would get their 1/10 ETH etf position tomorrow, July 23rd. In order to fund the 1/10 or 10% of… — Jon Campagna (@thecampsishere) July 22, 2024\n\nThis move follows Grayscale’s recent decision to shift 10% of its Grayscale Ethereum Trust (ETHE) holdings into a separate Ethereum ETF (ETH) on July 18. This transition is part of the preparations for the new fund, which is expected to become active on Wednesday, with ETHE holders receiving proportional ETF positions.\n\nDespite maintaining a 2.5% fee on ETHE, which is higher than its competition, Grayscale’s strategy seems to be aimed at retaining more assets under its management by offering the lower-cost ETH ticker.\n\nFollowing the SEC approval for Spot Ethereum to commence trading, Wintermute, an algorithmic trading firm, predicted that demand for Ethereum ETFs might be lower than anticipated.\n\nHowever, Matt Hougan, chief investment officer at Bitwise Asset Management, remains optimistic and has projected that Ethereum ETFs could reach $15 billion within the first 18 months of trading.\n\nMoreover, Grayscale is just one among several major investment firms, including BlackRock, Fidelity, and Franklin Templeton, preparing to launch Ethereum ETFs, with demand for these funds projected to be between $3.2 billion and $4 billion."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTE42M0ltX3l5NjdrVkZLckFNV0FGT2wwejQ0WVRIWTZFNVNKdFNBWWRCcHVxNmoySXpBdWVIN2ozdGJTcmJkQkp6QXBUcmpXN25lMnFkUWZVQlR3VTFaLWhEMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs debut on US markets as trading commences - Crypto Briefing",
        "content": "Ethereum's utility has been highlighted as ETFs launch on major US exchanges.\n\nKey Takeaways First-ever spot Ethereum ETFs begin trading in the US today.\n\nEthereum ETFs expected to attract up to $1 billion in initial monthly inflows.\n\nShare this article\n\nToday marks a watershed moment in the US financial markets as the first-ever spot Ethereum ETFs commence trading.\n\nApproved by the US SEC, these funds allow investors to directly engage with the world’s second-largest cryptocurrency.\n\nJay Jacobs, BlackRock’s US head of thematic and active ETFs, highlighted Ethereum’s utility, stating, “You could think of Ethereum as a global platform for applications that run without decentralized intermediaries.”\n\nThe SEC allowed S1 registration statements to become effective on Monday afternoon, giving final approval for the funds to begin trading. This development comes less than three months after spot Bitcoin ETFs were launched in January.\n\nEight issuers are offering spot Ethereum ETFs with varying fee structures:\n\nGrayscale Ethereum Mini Trust (NYSE: ETH): 0.15% post-waiver fee\n\nFranklin Ethereum ETF (CBOE: EZET): 0.19%\n\nVanEck Ethereum ETF (CBOE: ETHV): 0.20%\n\nBitwise Ethereum ETF (NYSE: ETHW): 0.20%\n\n21Shares Core Ethereum ETF (CBOE: CETH): 0.21%\n\nFidelity Ethereum Fund (CBOE: FETH): 0.25%\n\niShare Ethereum Trust (NASDAQ: ETHA): 0.25%\n\nInvesco Galaxy Ethereum ETF (CBOE: QETH): 0.25%\n\nAdditionally, Grayscale’s existing Ethereum Trust (NYSE: ETHE) will continue trading with a 2.5% fee. Six of the funds will use Coinbase as a custodian, while VanEck has chosen Gemini and Fidelity will self-custody its ether.\n\nAnalysts project more modest inflows for Ethereum ETFs compared to their Bitcoin counterparts. Citigroup estimates between $4.7 billion and $5.4 billion in inflows over the first six months of trading. Nate Geraci, president of The ETF Store, suggests Ethereum ETF demand may reach about one-third of what was seen with Bitcoin ETFs.\n\nThe ETFs are available to both institutional investors and retail traders. Notably, six of these funds have chosen Coinbase as their custodian, with others opting for different custody solutions. The trading platforms and their respective fees vary, with the Grayscale Ethereum Mini Trust and the Invesco Galaxy Ethereum ETF among those listed.\n\nComparatively, Ethereum ETFs are expected to see lower initial inflows than their Bitcoin counterparts, with projections suggesting up to $1 billion in net inflows monthly for the first half-year. Despite the smaller market size relative to Bitcoin, the introduction of these ETFs is poised to provide a new avenue for cryptocurrency investment."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPTGM3MUlyczNvWEZ2SW8weHlQTTBuZU5QVV8zaEc1YkNQelBoZ1AzaFlpZUNuLXlsWXdYeUQtYWVHNUJiUkhxRTg2cV9OZ2FBaVFWZjFza1VSVVNMdUFsaUJBdEJtX3dKZmxTcDBZQzU0Ujk0UDVWUE56MXkySTBSeVFTcXR3YUhtR1FNc1ZDckc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs: Potential inflows and Ethereum price impact analysis - crypto.news",
        "content": "Today, Ethereum ETFs made their long-awaited debut on major stock exchanges. This article will analyze projected inflows for Ethereum ETFs and how they might influence the future price of ETH. By comparing the recent success of Bitcoin ETFs, we will explore the potential impact on Ethereum prices in the coming months.\n\nUnderstanding Bitcoin ETF inflows and their implications for Ethereum\n\nWhile Bitcoin ETFs have seen substantial inflows, expectations for Ethereum ETFs are more modest. Since their inception, Bitcoin ETFs have attracted significant investor interest. As of July 18, these financial instruments saw a net inflow of $16.67 billion over approximately six months. Despite being the second-largest cryptocurrency, Ethereum is often perceived differently from Bitcoin. It is not typically seen as a store of value or “digital gold.” This distinction, combined with Bitcoin’s more established market position, suggests that Ethereum may not attract the same level of ETF inflows as Bitcoin.\n\nSource: Farside Investors\n\nEric Balchunas, a senior ETF analyst at Bloomberg, has provided conservative estimates for Ethereum ETF inflows and believes that these funds will attract only 10-15% of the inflows seen by Bitcoin ETFs.\n\nI think me comparing Ether ETFs following Bitcoin ETFs to a concert where Sister Hazel comes on after Nirvana is prob why a few ppl coming at me on this and that's ok. Maybe that was harsh but I still see the ether etfs getting 10-15% of the assets of the btc ETFs (altho James is… — Eric Balchunas (@EricBalchunas) May 21, 2024\n\nYou might also like: Election politics or crypto evolution? Speculation abounds as SEC hints at approving Ethereum ETFs\n\nAdditionally, when looking at the derivatives market, the open interest for Ethereum futures and options on the CME is approximately $1.67 billion, while Bitcoin’s open interest stands at $12.56 billion. The CME, which mainly serves institutional investors, shows that Ethereum’s share is about 13.3% of Bitcoin’s. In the broader derivatives market, Ethereum’s total open interest is $20.74 billion compared to Bitcoin’s $54.1 billion, which translates to a 38.34% ratio. These figures reinforce the conservative projections for Ethereum ETF inflows compared to Bitcoin.\n\nAcademic insights into ETF effects on market prices\n\nA question often arises: why would ETF inflows impact the price of an underlying asset, such as Ethereum? Several academic studies have confirmed ETFs’ significant influence on underlying asset prices. Research by Ben-David et al. (2018) demonstrates that ETFs can lead to increased volatility and price deviations from fundamental values in the securities they track. The study attributes these effects to the mechanical rebalancing and trading strategies employed by ETFs, which can amplify price movements and introduce non-fundamental shocks into the market.\n\nFurther supporting evidence comes from Luca J. Liebi’s literature review. The research highlights ETFs’ role in improving market liquidity and price efficiency under normal conditions. Empirical evidence suggests that ETFs, particularly those with high leverage, can magnify price changes in underlying assets due to their rebalancing activities. These studies collectively indicate that ETF inflows tend to push up the prices of the assets they track, lending credence to the hypothesis that Ethereum ETFs could similarly impact ETH prices.\n\nPotential inflow scenarios for Ethereum ETFs\n\nBased on the analysis above, four potential scenarios for Ethereum ETF inflows emerge:\n\nPercentage of Bitcoin ETF Inflows Ethereum ETF Inflows 10% $1.67B 15% $2.50B 20% $3.33B 25% $4.17B\n\nThese projections estimate the potential inflows Ethereum ETFs might experience by the end of 2024, using the $16.668 billion figure for Bitcoin as a baseline.\n\nEthereum price impact analysis\n\nTo estimate the price impact of these potential inflows, four multipliers are considered: 0.5x, 1x, 1.5x, and 2x. These multipliers reflect varying degrees of price sensitivity to ETF inflows.\n\n10% 15% 20% 25% 0.5x $3,570 $3,655 $3,740 $3,825 1x $3,740 $3,910 $4,080 $4,250 1.5x $3,910 $4,165 $4,420 $4,675 2x $4,080 $4,420 $4,760 $5,100\n\nAssuming a current Ethereum price of $3,400, the estimated price impact by the end of 2024, solely from ETF inflows, would range from $170 to $1,700. With more likely multipliers (1x to 1.5x), the price increase would be between $340 and $1,275. This suggests a potential Ethereum price range of $3,740 to $4,675."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQcTVoMV90Um9FT1h3eGJjMG8yX0hjT2c2b1lZMDZPMGRCOElaZ1NTb2RyNVd2d3F2YVRoQUhWUUREaVJhQlNGOEdTRUxWQUpmU0R3SU1RVDN0SUFTVWwxRmMzYnZTMThLT3gzaFhOaWh5Rllhb3FBVGZsWWdKWmNsamNMdXpyRXozOFNncXpGTkZJQU9fbnVRekZtU1QzeXlJdW1heTExdUp1bUg1bkFmadIBtgFBVV95cUxQcUF1RGJKY0thUll2UzZRT0o3RVBGWklMbXRmaFVuQWI0OXJKVW9RWXE2OVJMcUpjTnQ0dloyMHU0Q2JENVE1dlJDSVNDSjdVTHJiZ0VNS0JFX1F1UThURHRjZnZJQTRHdW5KY2hJclhsdzltaXRGWWMxeU5ZUmZRcW8wTDNZRDRGMm5Ibnk5SjFMdV9JVGVXd1h1ZDlKU1pCc1U0c2FRNGY5RUxVd3pUdGhfdnBHQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Spot ether ETFs are set to trade Tuesday. Here’s what it means for the Ethereum blockchain - CNBC",
        "content": "Nurphoto | Nurphoto | Getty Images\n\nSpot ether exchange traded funds are set to begin trading on Tuesday. Crypto enthusiasts are hopeful it will broaden the investor base for Ethereum, a blockchain technology many argue has a far wider use case than bitcoin. These ETFs will invest directly in ether, which is the cryptocurrency used in the Ethereum network. There are already ether ETFs that track futures contracts, but these are the first to track spot ether. Spot ether ETF applications Grayscale Ethereum Mini Trust (ETH)\n\nGrayscale Ethereum Trust (ETHE)\n\nBitwise Ethereum (ETHW)\n\nVanEck Ethereum (ETHV)\n\n21Shares Core Ethereum (CETH)\n\nInvesco Galaxy Ethereum (QETH)\n\nFidelity Ethereum (FETH)\n\nFranklin Ethereum (EZET)\n\niShares Ethereum Trust (ETHA) Like the spot bitcoin ETFs that launched in January, most are waiving fees initially — in many cases for up to a year.\n\nBitcoin ETF have been a hit. Will ether ETFs be the same?\n\nBy the standards of ETF launches, spot bitcoin ETFs have been a success: They recently topped $17 billion in net flows year to date since their debut. For a new asset class, that is a big hit. However, at $1.3 trillion in total assets, bitcoin has about three times the value of ether, which has about $414 billion in assets. That may limit the initial appeal of ether ETFs. Bitcoin prices rose going into the launch of spot bitcoin ETFs. Ether has been a bit spottier: It is up 50% in 2024, but most of the gain came in the first three months of the year. Still, for Ethereum enthusiasts, the primary value of a spot ether ETF is that it's a perfect vehicle to educate the public about the use cases for Ethereum, which are far greater than anything bitcoin has to offer. Ben Johnson, Morningstar's head of client solutions and an ETF research veteran, noted that while bitcoin is often advertised as digital gold, \"Ethereum is more like picks and shovels.\" \"The case for the former is that it is finite and could be a store of value, the latter is not finite and being used to build some real-world applications,\" he said.\n\nWhat the Ethereum platform does\n\nMany investors have never been impressed with bitcoin, primarily because the use case seems limited: It is purely a digital currency. But the Ethereum platform is different. Bitcoin and Ethereum both utilize blockchain, which is a decentralized, immutable ledger to record transaction histories, but they have very different purposes. Bitcoin uses the blockchain as a digital currency. Ethereum utilizes digital money just like bitcoin, but its blockchain has broader purposes. (Ether is the cryptocurrency used in the Ethereum network, but in practice the terms Ethereum and ether are often used interchangeably.) Ethereum is a platform for building smart contracts, which are self-executing programs that enforce a pre-existing contract or agreement. It can be as simple as \"If I do this, you do that.\" The key is that they execute automatically, are done on the blockchain (the Ethereum network) and produce the same result each time they are executed. They also have a wide variety of applications. The most common use is for decentralized finance, or \"DeFi.\" This is just a fancy term for using financial services on the blockchain. In theory, you could perform almost any banking services: Users can send, lend or borrow money, open a savings account, trade stocks or derivatives or other cryptocurrencies, get insurance. Theoretically, you could also do real estate transactions. Users can perform these functions using software called \"decentralized apps.\" The use case goes beyond financial services. Users can play games. Corporations could use it for tracking supply chains. It could even be used as a clearing platform to settle stock trades. Another application for Ethereum: stablecoins. These are cryptocurrencies whose value is pegged to another asset, usually the dollar. Because cryptocurrencies like bitcoin and ether are volatile, many DeFi applications rely on stablecoins for lending, borrowing and trading. The promise is a transaction network that — in theory — could be a much cheaper and faster way to do business.\n\nDoes this open the floodgates for more crypto ETFs?\n\nIt's not clear whether this latest development will open the floodgates for more crypto ETFs — or whether the U.S. Securities and Exchange Commission will find a way to stop the potential tidal wave. Any applicant for other crypto ETFs would still need to show that the underlying market was not subject to manipulation, a crucial requirement for approval of these funds. But a lot may depend on the political climate. In the past, for commodities, the SEC has traditionally required a regulated futures market to trade alongside the asset. Right now, that only exists for bitcoin and ether, so it would take time to develop futures markets for other crypto products. \"Under the current regime in Washington, that would not change,\" Matt Hougan, chief investment officer of Bitwise told me. \"But if you get a change of regimes in Washington, that could change.\" Regardless, expect a lot of trading. \"These new ETH ETFs will likely trade a lot,\" Johnson at Morningstar told me. \"I'd guess that if and when options on these ETFs become available, this will all go into overdrive.... These ETFs effectively add a whole new wing to the crypto casino.\"\n\nIs Ethereum essentially a tech play?"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiqgJBVV95cUxPSWtFWVhFczJOLVEtckZjb3o0WVA1T01VVFN6VWRTOFNweTVqbTAxRjctSWMxbVlzLUZmaWhJZ19WOTZMS1JFMWEtN2t4X2tmQ2lUQVlVX3M3d1BBc2VxWHdVWGlIRjZDTkJ1WUFZajRmZ1prVFpQdzhWMENKaFVmVVBWaTV3T1NiOGZ3SHVlaHRlSDVwSWpad2lkYWdKY3JaOUlZS1FBYklTeE5iTC0tNmNOS1lEV2h2UVBQN3pvZHpWNjRNcF9FMnljZExiVGpNaG1BdnBMY3lBMWFxMXdDdmpOQ0s2OHZmTmdTdjhFeTlFcTFfTjMxbnN2Q3N4eVZQVEFibE1tUDFuWjcyRDNybkFmQXR6UU0zemJfTGp2VUdVRkdwa0dNSE13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Ethereum Mini Trust (Ticker: ETH) and Grayscale - GlobeNewswire",
        "content": "STAMFORD, Conn., July 23, 2024 (GLOBE NEWSWIRE) -- Grayscale Investments®, the world’s largest crypto asset manager*, offering more than 20 crypto investment products, today announced that Grayscale Ethereum Trust (Ticker: ETHE) and Grayscale Ethereum Mini Trust (Ticker: ETH) have begun trading on NYSE Arca as of 4:00 AM ET today as spot Ethereum ETPs following the recent regulatory approval by the U.S. Securities and Exchange Commission (SEC). The launch and commencement of trading for ETH and ETHE represents a groundbreaking achievement for Grayscale’s clients and the broader Ethereum community.\n\nGrayscale Ethereum Mini Trust (“ETH”) and Grayscale Ethereum Trust (“ETHE”) are not funds registered under the Investment Company Act of 1940 and are not subject to regulation under the Investment Company Act of 1940, unlike most mutual funds or ETFs. Investing involves significant risk, including possible loss of principal. The Trusts may not be suitable for all investors.\n\nETHE has become the largest spot Ethereum ETP with $9.19B AUM as of July 23, 2024, and has come to market with an established and diverse investor base across retail and institutional investors alike.\n\nETH launched today as a lower fee** spot Ethereum ETP through the innovative mechanics of initial seeding by distributing 10% of ETHE's underlying Ethereum. As such, ETH has commenced trading as the second largest spot Ethereum ETP*, with a uniquely diversified investor base, and $1.02B AUM as of July 22, 2024. ETHE’s distribution event is colloquially known as a “spin-off,” and is a corporate action that is not expected to be a taxable event for ETHE nor any beneficial owner of ETHE shares as of the previously announced Record Date of July 18, 2024. Investors are encouraged to consult a tax advisor for related tax guidance.\n\n\"The Grayscale team could not be more excited for ETH and ETHE to begin trading today as spot Ethereum ETPs on NYSE Arca,” said Grayscale Senior Managing Director, Global Head of ETFs David LaValle. “Spot Ethereum ETPs will provide U.S. investors, financial professionals, and asset allocators reliable and convenient access to Ethereum for the first time in the familiar, time-tested ETP wrapper. This is a huge milestone for investors and the ETF market, and demonstrates Grayscale’s ongoing commitment to advancing digital asset investing in the United States.”\n\nGrayscale remains committed to addressing increasing investor and market demand for Ether by expanding its range of Ethereum-focused investment products – aiming to build a product suite that can cater to investors' unique needs at every stage of their Ether investing journey. Grayscale has been and remains unwaveringly focused on working constructively with its investors, partners, regulators, and policymakers to help deepen the understanding of Ethereum and the Ethereum fee protocol to expand familiar access to the second largest crypto asset by market cap***.\n\n“ETH and ETHE will allow investors to invest in Ethereum's potential to create markets, transform financial systems, utilize Decentralized Finance (DeFi), and drive innovation through the trusted ETP wrapper -- without the need to buy, store, or manage Ethereum directly,” said Grayscale Managing Director and Head of Distribution and Strategic Partnerships John Hoffman. “Client demand is growing alongside the maturation of the crypto asset class, and Grayscale is proud to offer pioneering financial products that provide our clients’ choice when considering convenient, registered exposure to crypto assets, like Ethereum.\"\n\nFor additional information about ETH, please visit: https://etfs.grayscale.com/eth For additional information about ETHE, please visit: https://etfs.grayscale.com/ethe.\n\n*By AUM as of July 22, 2024\n\n**Low cost based on gross expense ratio at 0% for the first six months of trading for the first $2.0 billion. After the fund reaches $2.0 billion in assets or after a 6-month waiver period, the fee will be 0.15%. Brokerage fees and other expenses may still apply. See prospectus for additional fee waiver information.\n\n*** By Market Cap as of July 22, 2024\n\nNO OFFER OR SOLICITATION\n\nThis communication is for informational purposes, solely in your capacity as a shareholder of ETHE, and does not constitute an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such jurisdiction. No shareholder approval of the distribution is required by applicable law, and we are not seeking ETHE shareholder approval.\n\nADDITIONAL INFORMATION AND WHERE TO FIND IT\n\nA definitive information statement on Schedule 14C will be furnished to ETHE shareholders for the purpose of informing ETHE shareholders of the distribution, in substantial compliance with Regulation 14C of the Exchange Act. The information statement will describe the Grayscale Ethereum Mini Trust, risks of owning shares of the Grayscale Ethereum Mini Trust and other details regarding the distribution, and will be made available on our website at www.grayscale.com/documents#regulatoryfilings. ETHE shareholders will not need to pay any consideration, exchange or surrender existing ETHE shares, or take any other action to receive shares of the Grayscale Ethereum Mini Trust in connection with the distribution.\n\nGrayscale Ethereum Trust (ETHE) and Grayscale Ethereum Mini Trust (ETH) (collectively the “Trusts”) have filed registration statements (including a prospectus) with the SEC for the offering to which this communication relates. Before you invest, you should read the prospectuses in the registration statements and other documents the Trusts have filed with the SEC for more complete information about the Trusts and this offering. You may get these documents for free by visiting EDGAR on the SEC Website at www.sec.gov. Alternatively, the Trusts or any authorized participant will arrange to send you the prospectus (when available) if you request it by calling (833)903-2211 or by contacting Foreside Fund Services, LLC, Three Canal Plaza, Suite 100, Portland, Maine 04101. Foreside Fund Services, LLC is the Marketing Agent for the Trusts.\n\nInvesting involves significant risk, including possible loss of principal. The Trust holds Ethereum; however, an investment in the Trust is not a direct investment in Ethereum. There is no certainty that an active trading market for shares will develop or be maintained which will adversely affect the liquidity of shares of the Trust.\n\nGrayscale Ethereum Trust and Grayscale Ethereum Mini Trust Risk Disclosures:\n\nAn investment in the Grayscale Ethereum Trust or Grayscale Ethereum Mini Trust may be deemed speculative and is not intended as a complete investment program. An investment in ETHE or the Grayscale Ethereum Mini Trust should be considered by persons financially able to maintain their investment and who can bear the risk of total loss associated with an investment in ETHE or the Grayscale Ethereum Mini Trust. Extreme volatility of trading prices that many digital assets, including Ethereum, have experienced in recent periods and may continue to experience, could have a material adverse effect on the value of ETHE and the Grayscale Ethereum Mini Trust and the shares could lose all or substantially all of their value. Digital assets represent a new and rapidly evolving industry. The value of ETHE and the Grayscale Ethereum Mini Trust depends on the acceptance of the digital assets, the capabilities and development of blockchain technologies and the fundamental investment characteristics of the digital asset. Digital asset networks are developed by a diverse set of contributors and the perception that certain high-profile contributors will no longer contribute to the network could have an adverse effect on the market price of the related digital asset. Digital assets may have concentrated ownership and large sales or distributions by holders of such digital assets could have an adverse effect on the market price of such digital assets. The value of ETHE and ETH relates directly to the value of the underlying digital asset, the value of which may be highly volatile and subject to fluctuations due to a number of factors.\n\nA registration statement related to Grayscale Ethereum Mini Trust has been filed with the SEC but has not yet become effective. An investment in the Grayscale Ethereum Mini Trust cannot be made, nor money accepted, until the registration statement is effective. An investor should consider the investment objectives, risks, and charges and expenses of the Grayscale Ethereum Mini Trust carefully before investing. A preliminary prospectus which contains this and other information about Grayscale Ethereum Mini Trust may be obtained by emailing info@grayscale.com. The information in the preliminary prospectus is not complete and may be changed. The final prospectus should be read carefully before investing, and when available may be obtained from the same source. This communication is not an offer to sell shares and is not soliciting an offer to buy shares in any state where the offer or sale is not permitted.\n\nGrayscale Investments, LLC is the Sponsor of Grayscale Ethereum Trust and Grayscale Ethereum Mini Trust.\n\nAbout Grayscale Investments®\n\nGrayscale enables investors to access the digital economy through a family of future-forward investment products. Founded in 2013, Grayscale has a proven track record and deep expertise as the world's largest crypto asset manager. Investors, advisors, and allocators turn to Grayscale's private placements, public quotations, and ETPs for single asset, diversified, and thematic exposure. Grayscale products are distributed by Grayscale Securities, LLC (Member FINRA/SIPC).\n\nMedia Contact\n\nJennifer Rosenthal\n\npress@grayscale.com"
    }
]