[
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOTFN2TFpMcXVBUW96VmNXdjVtRjk5YjFDWmF1b1AzblQxVW9IRlFnUjJLNjJ4UkIwN0E5VmxhVldsS19IM0ZrYWJkbmhqZjVUeGd4b3F6RHFFbGRxZWdxWTI3RjFDTHZSMzl6TDMzamYtYWlCSnByYU5wUEs0T1NSYkgyQWJFNjZXaVBoOUJQVEHSAZ4BQVVfeXFMUFZySUx2Z0ZvM3lpblNpeDVVekxHWXZvQWhudGNySVo5Qlo1NW9TSlJoaXNpNnRDVU1MQUxaQlBKS2hBS0daaTBRX09hQ3Ffb0M3VkdaUDd1M2NwSHFaNUFRaDRoRDRNQjQ3aWtOdWdkLTN5MDNFVlk3MVRLWkpwUVZLNXdPMEo3cldLSWVMN3h5cHREWE84SlRQaFl0cXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 05, 2024 - Analytics Insight",
        "content": "Decline and Recovery: Ethereum price declined below the US$3,760 support zone. However, it found strong buying interest around US$3,720, forming a low at US$3,728.\n\nAttempted Rally: Following the low, ETH attempted to rally, moving past the US$3,800 level but encountering resistance just shy of US$3,840. A high was formed at US$3,836, after which the price entered a consolidation phase.\n\nConsolidation Phase: Currently, ETH is consolidating within a range, trading below the 23.6% Fibonacci retracement level of the recent upward move from US$3,728 to US$3,836."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPbHNVRGZvbmh3YUhtaHE5YTdCTGR6eklsQnktOG0xdHlyMWUyOEZfLWNENEN5emZiT05sb1E5VE1PZlRzaWJEdGNhNGdUa24xNmNMMGJBeFZ2MkppSmxnNDZwS3lZWndNRHVQQ0w3eVlneThsaXhzVUxVaW95aWdiY0lici1CZWlq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Shiba Inu: How High Can SHIB Go When Ethereum Hits $20,000? - Watcher Guru",
        "content": "Cryptocurrency investors are watching the performance of major coins like Ethereum (ETH) and their potential impact on the broader market. One coin that is in the spotlight is Shiba Inu (SHIB). With Ethereum’s price on the rise, the question on everyone’s mind is: how high can Shiba Inu go when Ethereum hits $20,000?\n\nShiba Inu’s Current Market Performance\n\nIn recent days, SHIB has gained momentum, reaching a low of $0.00002369 and a high of $0.00002577 in the past 24 hours. Currently, SHIB is trading with an 8% surge in its overall performance during this period.\n\nAlso read: Can Solana (SOL) Breach $260 And Hit New ATH in June?\n\nHowever, the meme coin has been down by 10.3% in the last seven days. Despite this temporary setback, SHIB enthusiasts remain confident in the coin’s prospects in the current bull market.\n\nShiba Inu’s Potential Value with Ethereum at $20,000\n\nAt press time, Ethereum is trading at $3,813, reflecting 30-day gains exceeding 20.3%. For ETH to reach the $20,000 threshold, it would need to increase by 427%.\n\nIf Shiba Inu were to mirror Ethereum’s growth and achieve a 427% increase from its current price, its value could skyrocket to $0.0001282. This price level would be a new all-time high for Shiba Inu, breaching its previous ATH of $0.00008845.\n\nAlso read: Ripple: How Many XRP You Need To Make $5 Million If Price Hits $2?\n\nThe Correlation Between Ethereum and SHIB\n\nAccording to IntoTheBlock stats, SHIB has a 69% correlation with the price of ETH, indicating that there is a 69% chance that SHIB will follow ETH if it rises to $20,000.\n\nThis strong correlation suggests that Shiba Inu’s price is heavily influenced by the performance of Ethereum, and a significant surge in ETH’s value could have a profound impact on SHIB’s price trajectory.\n\nAlso read: Shiba Inu Poised to Hit $0.0001 in June, Says Leading Analyst"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPSlkxV2Eyc0tKMDVsZjF0S2Z5aUFkalp0VGJGUlduVlpkRG1XTU1xQmFDUUpiOEV5aUtEeWVHbFBmTEhaUEFzVVZBVGdhbnY4Nm1fT1ZWaWhyR2pBZ212R0hDRVlGYUNCYVkwZFRtcU9Pcjk3SHI1a3dsejVmVEp3Q3VsaFVDN0hJUkk3R3JpVEdUSFhEdW44SVItb1A1YTlGcS10VWt3eVkxQUxZWm82T1FMdXVmYzRXeG1FMjhRZWxjN09sdC0wVUxXN2ZPZXozRnNNOURoM201YXRw0gHiAUFVX3lxTE9iOXBVb0dESUd2d1FPME1lZmZrb2YzTlFjVlNEMU9GUWM0VkRheDd1ZzZTWGFDOGFoUE1wR3NJREVjRlBvdWVMTzdMS3dHY2VZLThHZGQtelNXY2FPTk5HbGdxWm5XTU9UNGNGVE0yaFZIOGtHVzFxSmtxYjB1cWlQaGs1cUhVMEhiZ1dFMTR1cXZaT1JId0pMaU0zVFd6NWVhMFlCT0hqY3dkT0FXSGZiTEc2NkZ5U0Z1STR6N21tSjl1SkpIQ2JmcDZIdVRzeUZsWm40aG5jNzZzMFRNVnVpN0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Ethereum open interest surges by 50%, SEC Chair says ETH ETF launch will take more time - FXStreet",
        "content": "Ethereum ETFs ‘will take some time’ before they launch, according to SEC Chair.\n\nETH's open interest on exchanges surged 50% to a new all-time high after SEC’s U-turn towards ETH ETFs.\n\nNew accumulating addresses holding 10-10K and 10K-100K ETH have grown steadily after ETH ETF 19b-4 approvals.\n\nEthereum (ETH) price hovered around $3,860 on Wednesday following Securities & Exchange Commission (SEC) Chair Gary Gensler expressing his opinion that the launch of spot ETH ETFs may be delayed. Meanwhile, Ethereum derivatives products on exchanges have seen a surge in open interest (OI).\n\nDaily digest market movers: ETH ETFs delay, rising open interest, new accumulating addresses growth\n\nIn an interview with CNBC on Wednesday, SEC Chair Gary Gensler said spot ETH ETFs would \"take some time\" before they go live on exchanges, indicating S-1 approvals are not imminent. He noted that his agency is still working on disclosure measures with exchanges.\n\nRead more: Ethereum leveraged ETFs go live as price fails to react\n\nAfter the SEC's sudden approval of 19b-4 filings from eight issuers on May 23, several analysts expected the agency to respond to S-1 registration statements quickly. The SEC's request for issuers to submit updated S-1 filings on Friday also seemed to have confirmed the expectations of these analysts.\n\nFollowing the filings, Bloomberg analyst Eric Balchunas suggested spot ETH ETFs would launch in July. However, with Gensler's recent comments, it may take longer before the ETFs begin trading.\n\nIn other news, open interest (OI) for ETH derivatives products on exchanges reached a new all-time high, rising by 50.3% to $14 billion, according to CCData Exchange Review for May. Notably, open interest on the Chicago Mercantile Exchange (CME) surged by 59.4% to $1.25 billion.\n\nAlso read: Ethereum sustains week-long consolidation, sees over $3 billion exodus from exchanges\n\nMeanwhile, the balance of new accumulating addresses holding between 10 - 10K and 10K to 100K ETH has been growing steadily since the SEC's pivot on ETH ETF, according to data from CryptoQuant.\n\nETH New Accumulation\n\nETH technical analysis: Ethereum to maintain sideways trend until spot ETH ETFs launch\n\nEthereum saw a slight gain on Wednesday, trading near $3,860 and continuing its sideways trend.\n\nETH's 30-day MVRV also aligns with the horizontal move, hovering around 6% in the past week. This indicates that the number of Ethereum addresses that purchased the coin within the last 30 days has seen an average of 6% gains.\n\nRead more: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin’s momentum poise to propel crypto market\n\nDespite the horizontal trend, whales are still accumulating ETH, and both long-term and short-term holders will likely hold onto their tokens.\n\nETH may continue its horizontal trend until the official launch of spot ETH ETFs. The $3,618 price level remains key support in case of short-term price swings. In the long term, ETH may overtake the $4,093 resistance and flip the $4,878 level to set a new all-time high of around $5,000.\n\nETH/USDT 4-hour chart\n\nQCP Capital analysts also share the bullish view: \"ETH has been lagging on this move, but we expect a catch-up and possibly even outperformance against BTC when the ETH spot ETF begins trading,\" they said.\n\nETH liquidation data shows a total of $23.78 million liquidations, with $13.81 million of liquidated long positions and $9.97 million of shorts, according to data from Coinglass."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPSlkxV2Eyc0tKMDVsZjF0S2Z5aUFkalp0VGJGUlduVlpkRG1XTU1xQmFDUUpiOEV5aUtEeWVHbFBmTEhaUEFzVVZBVGdhbnY4Nm1fT1ZWaWhyR2pBZ212R0hDRVlGYUNCYVkwZFRtcU9Pcjk3SHI1a3dsejVmVEp3Q3VsaFVDN0hJUkk3R3JpVEdUSFhEdW44SVItb1A1YTlGcS10VWt3eVkxQUxZWm82T1FMdXVmYzRXeG1FMjhRZWxjN09sdC0wVUxXN2ZPZXozRnNNOURoM201YXRw0gHiAUFVX3lxTE9iOXBVb0dESUd2d1FPME1lZmZrb2YzTlFjVlNEMU9GUWM0VkRheDd1ZzZTWGFDOGFoUE1wR3NJREVjRlBvdWVMTzdMS3dHY2VZLThHZGQtelNXY2FPTk5HbGdxWm5XTU9UNGNGVE0yaFZIOGtHVzFxSmtxYjB1cWlQaGs1cUhVMEhiZ1dFMTR1cXZaT1JId0pMaU0zVFd6NWVhMFlCT0hqY3dkT0FXSGZiTEc2NkZ5U0Z1STR6N21tSjl1SkpIQ2JmcDZIdVRzeUZsWm40aG5jNzZzMFRNVnVpN0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Ethereum open interest surges by 50%, SEC Chair says ETH ETF launch will take more time - FXStreet",
        "content": "Ethereum ETFs ‘will take some time’ before they launch, according to SEC Chair.\n\nETH's open interest on exchanges surged 50% to a new all-time high after SEC’s U-turn towards ETH ETFs.\n\nNew accumulating addresses holding 10-10K and 10K-100K ETH have grown steadily after ETH ETF 19b-4 approvals.\n\nEthereum (ETH) price hovered around $3,860 on Wednesday following Securities & Exchange Commission (SEC) Chair Gary Gensler expressing his opinion that the launch of spot ETH ETFs may be delayed. Meanwhile, Ethereum derivatives products on exchanges have seen a surge in open interest (OI).\n\nDaily digest market movers: ETH ETFs delay, rising open interest, new accumulating addresses growth\n\nIn an interview with CNBC on Wednesday, SEC Chair Gary Gensler said spot ETH ETFs would \"take some time\" before they go live on exchanges, indicating S-1 approvals are not imminent. He noted that his agency is still working on disclosure measures with exchanges.\n\nRead more: Ethereum leveraged ETFs go live as price fails to react\n\nAfter the SEC's sudden approval of 19b-4 filings from eight issuers on May 23, several analysts expected the agency to respond to S-1 registration statements quickly. The SEC's request for issuers to submit updated S-1 filings on Friday also seemed to have confirmed the expectations of these analysts.\n\nFollowing the filings, Bloomberg analyst Eric Balchunas suggested spot ETH ETFs would launch in July. However, with Gensler's recent comments, it may take longer before the ETFs begin trading.\n\nIn other news, open interest (OI) for ETH derivatives products on exchanges reached a new all-time high, rising by 50.3% to $14 billion, according to CCData Exchange Review for May. Notably, open interest on the Chicago Mercantile Exchange (CME) surged by 59.4% to $1.25 billion.\n\nAlso read: Ethereum sustains week-long consolidation, sees over $3 billion exodus from exchanges\n\nMeanwhile, the balance of new accumulating addresses holding between 10 - 10K and 10K to 100K ETH has been growing steadily since the SEC's pivot on ETH ETF, according to data from CryptoQuant.\n\nETH New Accumulation\n\nETH technical analysis: Ethereum to maintain sideways trend until spot ETH ETFs launch\n\nEthereum saw a slight gain on Wednesday, trading near $3,860 and continuing its sideways trend.\n\nETH's 30-day MVRV also aligns with the horizontal move, hovering around 6% in the past week. This indicates that the number of Ethereum addresses that purchased the coin within the last 30 days has seen an average of 6% gains.\n\nRead more: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin’s momentum poise to propel crypto market\n\nDespite the horizontal trend, whales are still accumulating ETH, and both long-term and short-term holders will likely hold onto their tokens.\n\nETH may continue its horizontal trend until the official launch of spot ETH ETFs. The $3,618 price level remains key support in case of short-term price swings. In the long term, ETH may overtake the $4,093 resistance and flip the $4,878 level to set a new all-time high of around $5,000.\n\nETH/USDT 4-hour chart\n\nQCP Capital analysts also share the bullish view: \"ETH has been lagging on this move, but we expect a catch-up and possibly even outperformance against BTC when the ETH spot ETF begins trading,\" they said.\n\nETH liquidation data shows a total of $23.78 million liquidations, with $13.81 million of liquidated long positions and $9.97 million of shorts, according to data from Coinglass."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOSUhZcU5iX21vLWpuWENjNHIzZUZLMTJSdUVwWTBwT1NfeThzTF9rS2VFWFpzWG5aQVNndnpKVXFyckhmM1RNblhPM1BuTmFGY21xSDhGSFlJY0x3MmVWM2lZeUJBT0x3ZEc1aGpOT1BDR04xeUFiZlB3Zk1ETlVBRHVnejJDRzRvZ3VsQXRVbXFnNmtWQ3RqRUtjYl91dHFpQ3dDVUZma3PSAa4BQVVfeXFMT0lVSFpUd2lXNDU1dVpWMjJPb3A1dVk2MkQzYjZ0blgzbmM1Sm1rZk90VG51QV9rN1BnMVlMVklnM3NVbm9VNWRDWDJuNUFjaWlWMTBFZkg4b09oc25rX2wxd1k4NzVhSDU5a1h6LVVnakxjWW0zVjJxNVE2c0tMVVdWYkhvX0xySXMxV0QwVVA1UFphVUl5WXk1MW93ck9DMFhLN2VSOW9oU3JMT2ZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Prediction: Will Ethereum Price Hit $10,000 On BlackRock ETH ETF? - CoinGape",
        "content": "Ethereum price has been in consolidation for the past few weeks as the market prepares for an S-1 application approval. Ethereum price is currently trading at $3,787, a 0.6% increase in the past 24 hours. On the other hand, Bitcoin broke above $70,000 once more after more than a month of trending below this crucial level and continues its journey to try and break an all-time high.\n\nETH/BTC Price Analysis: Ethereum Price Succumbs to Bitcoin Rally, Can ETH Bounce Back?\n\nadvertisement\n\nETH price against Bitcoin witnessed some downward pressure as Bitcoin bulls pushed its price above $70,000 for the first time in the last 30 days. The majority of cryptocurrencies shed some value against BTC, and Ethereum was not left out.\n\nThe price of Ethereum broke downward from the consolidation zone and is headed toward the 50% Fibonacci retracement level around 0.052 BTC. Based on the Ethereum price prediction, this retracement level may act as a zone of support a bounce back higher toward the 27% Fibonacci extension level around 0.06 BTC.\n\nOn the way up, ETH price may encounter resistance around 0.057 BTC, and $0.058 BTC. Conversely, the support structure around 0.052 BTC may prevent the price of ETH from falling lower.\n\nOn the other hand, Bitcoin price just broke out of a descending triangle in a classic textbook breakout and retest pattern. BTC price may move higher, with a profit target for this kind of setup anywhere around $74,000. This would establish a new all-time high price for the king of cryptocurrencies.\n\nBitcoin price may find some overhead resistance around $72,200 and $74,000, but on the flip side, a key support level around $67,000 may help keep the price up.\n\nETH/BTC Price Future Outlook\n\nAs the Ethereum community awaits S-1 application approval, the Bitcoin community continues to spearhead mass adoption for the number one crypto. El Salvador, the ‘Bitcoin State’ now owns 5,660 BTC worth over $402 million, and is still accumulating.\n\nMoreover, the University of Austin, a private Texas institution, will now accept Bitcoin for tuition and create a long-term Bitcoin fund.\n\nMeanwhile, liquid staking and restaking on Ethereum is only gearing up, and much more liquidity is about to hit the ecosystem, a phenomenon that could pump the price of Ethereum even higher. When including liquid staking, Ethereum mainnet TVL came within 2% of its ATH recently\n\nBottom Line\n\nThe crypto community is optimistic about an S-1 Form approval because BlackRock submitted it. The firm has a clean history of only wins when it comes to ETF applications and the Ethereum community is banking on this to pump ETH price to $10,000.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]