[
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxONDJCbm5QcklXNlRpdW9JSlhuSUx6QlA1bDBQejZrRU5qbVkxZUpESENFdnJSbXFKVHU0MmlqbFVSN01uZV9fX0FpaGZ3NmRyTm4xMHhFSmpoUDV0bXVCUDdvU0JHUFR3ZXpiMjBydWdPSlFhQzlVeFZROGhLa0REWFE3SGd0VkZBamc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Stripe Enables Merchants To Accept USDC Payments on Ethereum, Solana and Polygon - Yahoo Finance",
        "content": "Stripe Enables Merchants To Accept USDC Payments on Ethereum, Solana and Polygon\n\nPayments giant Stripe has announced its return to the cryptocurrency space after co-founder John Collison revealed their plan to allow merchants to receive funds in the form of the USD Coin (USDC) stablecoin. According to Collison, the “transactions instantly settle on-chain and automatically convert to fiat” and will begin as soon as this summer.\n\nBusinesses utilizing Stripe's technology will have the capability to accept payments made in USDC, the second-largest stablecoin in the crypto market and the sixth-largest cryptocurrency by market capitalization. By embracing USDC, Stripe aims to empower its users by facilitating global transactions and providing customers with easy, fast, and secure payment options, regardless of their access to traditional banking services or credit cards.\n\nJohn Egan, the head of crypto at Stripe, expressed enthusiasm about the integration of stablecoin payments, highlighting the potential to enhance merchants' reach and offer their customers a seamless payment experience. Stripe plans to initially support USDC transactions on the Ethereum, Solana, and Polygon networks, with additional network compatibility to be announced closer to the launch date.\n\nThis move marks Stripe's reentry into the crypto landscape after its initial foray in 2014 when it became one of the earliest major companies to accept Bitcoin payments. However, the company discontinued its crypto services in 2018 due to rising costs on the Bitcoin blockchain. Despite this setback, Stripe remained optimistic about cryptocurrencies as a whole."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxONDJCbm5QcklXNlRpdW9JSlhuSUx6QlA1bDBQejZrRU5qbVkxZUpESENFdnJSbXFKVHU0MmlqbFVSN01uZV9fX0FpaGZ3NmRyTm4xMHhFSmpoUDV0bXVCUDdvU0JHUFR3ZXpiMjBydWdPSlFhQzlVeFZROGhLa0REWFE3SGd0VkZBamc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "Stripe Enables Merchants To Accept USDC Payments on Ethereum, Solana and Polygon - Yahoo Finance",
        "content": "Stripe Enables Merchants To Accept USDC Payments on Ethereum, Solana and Polygon\n\nPayments giant Stripe has announced its return to the cryptocurrency space after co-founder John Collison revealed their plan to allow merchants to receive funds in the form of the USD Coin (USDC) stablecoin. According to Collison, the “transactions instantly settle on-chain and automatically convert to fiat” and will begin as soon as this summer.\n\nBusinesses utilizing Stripe's technology will have the capability to accept payments made in USDC, the second-largest stablecoin in the crypto market and the sixth-largest cryptocurrency by market capitalization. By embracing USDC, Stripe aims to empower its users by facilitating global transactions and providing customers with easy, fast, and secure payment options, regardless of their access to traditional banking services or credit cards.\n\nJohn Egan, the head of crypto at Stripe, expressed enthusiasm about the integration of stablecoin payments, highlighting the potential to enhance merchants' reach and offer their customers a seamless payment experience. Stripe plans to initially support USDC transactions on the Ethereum, Solana, and Polygon networks, with additional network compatibility to be announced closer to the launch date.\n\nThis move marks Stripe's reentry into the crypto landscape after its initial foray in 2014 when it became one of the earliest major companies to accept Bitcoin payments. However, the company discontinued its crypto services in 2018 due to rising costs on the Bitcoin blockchain. Despite this setback, Stripe remained optimistic about cryptocurrencies as a whole."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPUkh5S0YwU0dhWkY4ZDVDVmx5cEZpUVJtWngwcU8zSkVJaWNHbExsTXJySjhJVXRnNW13cnE2RUdPbmRkZUd0Yl9TaHJlazV0aUtyRU5zVGJnaENVYTZKXzZiWVJYTW1mQUFfV2V0aGlMemdFWWRWWjRhYU9UQmVqclJRZWJkQThXMkpZNDhHVkZSeXBYc081REFaRmZ5ejdFTDZ2M2JTNzdzSTEtVm5VYXhuR0xnUDRq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "SEC sued over Ethereum, crypto firm asks court to state token is not a security - Fortune",
        "content": "A bitter legal fight between the crypto industry and the Securities and Exchange Commission grew more intense on Thursday as Consensys, a major backer of the Ethereum blockchain, filed a lawsuit against the agency in Texas federal court. The complaint seeks to head off an impending SEC lawsuit against the company over features of its popular MetaMask wallet, but also asks the court to resolve one of the biggest legal uncertainties hanging over the crypto industry by stating that Ethereum’s digital token, Ether, is not a security.\n\nIn its 34-page legal filing, Consensys uses dramatic language to argue that the SEC’s efforts to exert jurisdiction over Ethereum is both illegal and a threat to blockchain technology more broadly.\n\n“The SEC’s unlawful seizure of authority over ETH would spell disaster for the Ethereum network, and for Consensys. Every holder of ETH, including Consensys, would fear violating the securities laws if he or she were to transfer ETH on the network,” the complaint states. “This would bring use of the Ethereum blockchain in the United States to a halt, crippling one of the internet’s greatest innovations.”\n\nThe new lawsuit comes as SEC Chairman Gary Gensler pursues an aggressive enforcement campaign against leading companies in the crypto sector, including Coinbase and Uniswap. In recent weeks, this campaign has involved a wave of subpoenas asking firms and developers for documents related to their dealings with the nonprofit Ethereum Foundation, which supports the blockchain’s development.\n\nGensler’s tactics have angered many in the crypto industry who have complained the SEC has failed to provide clear rules or to create a regulatory model that accounts for the distinct features of blockchain technology. Gensler has disputed this, claiming existing securities laws are clear and sufficient, and that the crypto industry refuses to comply with them.\n\nThe controversy over Ethereum has been especially heated since the SEC has signaled repeatedly in the past that the blockchain’s tokens, like Bitcoin, are not securities and therefore outside its jurisdiction. This includes a landmark 2018 speech where a senior official stated that Ethereum had become “sufficiently decentralized” as well as the agency’s decision last year to allow Ethereum futures trading—an implicit acknowledgement that Ether is a commodity. Meanwhile, video has surfaced of Gensler himself, in his role as a private citizen, telling hedge funds in 2018 that Ethereum is not a security.\n\nThese precedents, however, have failed to dissuade Gensler, who appears to be using a recent feature of Ethereum, known as staking, as grounds for the recent legal campaign.\n\nA warning notice and a preemptive lawsuit\n\nThe Consensys complaint filed on Thursday reveals that the SEC earlier this month issued a so-called Wells Notice, which describes a formal letter warning the agency intends to sue a firm, and often leads to a settlement soon after. The complaint added that, in a related phone call, the SEC told Consensys that MetaMask was operating as an unlicensed broker dealer.\n\nAccording to Consensys, the SEC objects to MetaMask offering users a means to stake Ethereum on their behalf. Staking is a relatively new process for Ethereum, introduced on a blockchain-wide basis in September 2022, that replaced energy-intensive mining with a system of validators who pledge collateral in order to become a trusted validator.\n\nIn an interview with Fortune, Consensys founder Joe Lubin described as “preposterous” the theory that staking transformed Ethereum from a commodity into a security.\n\n“The act of staking is really just posting a security bond so you can get paid to contribute labor and resources to help operate the Ethereum protocol. Now they’re trying to turn that into some sort of investment contract,” Lubin said.\n\nThe SEC did not immediately respond to a request for comment from Fortune about the lawsuit or on the agency’s view of the legal status of staking.\n\nLubin also stated that Gensler’s legal position appeared to be an attempt to halt the overall growth of crypto, and to justify the SEC blocking pending applications by companies to launch spot ETFs for Ethereum following the huge popularity of Bitcoin ETFs.\n\n“They are trying to regulate a technology on its merits, which the SEC shouldn’t be doing. They’re trying to stifle certain kinds of innovation. And they’re trying to do that because probably they see Ether spot ETFs as a floodgate that’s going to bring a lot of capital into our ecosystem,” said Lubin.\n\nThe Consensys lawsuit was filed in Texas, which dovetails with a broader strategy of the crypto industry to tee up eventual legal appeals in the U.S. Court of Appeals for the Fifth Circuit. The circuit has shown greater skepticism of agency actions than other courts and, if the industry can win a favorable judgment, it would likely tee up an appeal for the Supreme Court.\n\nIt’s unclear for now what will happen in the event the SEC chooses to file a lawsuit on its own to follow up on the Wells Notice instead of resolving the issues with Consensys in the Texas court.\n\nThe complaint itself asks the court for a number of additional rulings beyond declaring that Ethereum is not a security. Those include declarations that MetaMask is not a broker dealer, and that the SEC is violating the Administrative Procedure Act and the Constitution’s guarantee of due process. It also seeks an injunction barring the SEC from conducting any investigations on the premise that Ethereum is a security."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOc0VwWENkamdsYnphR3FNdUlhOUhvTGVNYlJaMEhBZXdOYVh1Smowa0p1Rm5GOFRBSExwQ1hDLVo4ZG85alprNlp0Rm5ocG1wc2pab0hMc0Y2aFlTbWI5NnBYLWVfc0Y4WXRJbVZ3X1plQ1JkUDczdV9GTVYycDRTVURn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "SEC Postpones Ethereum (ETH) ETF Decision, Solana (SOL) Climbs 12% as Network Issues Resolve, Furrever Token (FURR) Excels in $1M Presale - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, April 25, 2024 (GLOBE NEWSWIRE) -- The cryptocurrency landscape is currently witnessing significant movements and regulatory developments that are shaping the future of digital assets. From the SEC's delayed decisions on Ethereum (ETH) ETFs to the surge in Solana's (SOL) network performance and the charming ascent of Furrever Token ( FURR ) , the dynamics within the crypto market continue to offer both challenges and opportunities for investors and enthusiasts alike.\n\nSEC Delays Decision on Ethereum (ETH) Spot ETFs, Extending Market Uncertainty\n\nThe United States Securities and Exchange Commission (SEC) has again postponed its decision regarding the spot Ethereum ETF applications submitted by Grayscale Investments and Franklin Templeton, casting prolonged uncertainty over the introduction of these investment vehicles on U.S. stock markets. This delay continues the trend of cautious regulatory scrutiny in the rapidly evolving cryptocurrency sector.\n\nPreviously, in a landmark decision last January, the SEC had approved 11 Bitcoin ETFs, which led to significant market inflows and demonstrated a strong investor demand for cryptocurrency-based financial products. Encouraged by this development, Grayscale attempted to convert its existing Grayscale Ethereum Trust (ETHE) into a spot ETH ETF in October. Shortly after, in February, Franklin Templeton also submitted an S1 form, signaling a robust interest among financial giants to facilitate access to Ether, which ranks as the second-largest cryptocurrency by market capitalization.\n\nDespite the evident enthusiasm and forward momentum from these asset management firms, the path to regulatory approval remains strewn with obstacles. Industry experts, such as those from JP Morgan, express skepticism regarding the rapid approval of these ETFs, estimating the probability of a favorable outcome by the May deadline to be less than 50%. This skepticism reflects the SEC's meticulous strategy in assessing new ETFs, emphasizing the protection of investor interests above all.\n\nThe ongoing postponements prompt speculation about the broader impact on the cryptocurrency market. A denial of these applications might lead these firms to consider legal action against the SEC, highlighting the tense interaction between evolving financial innovations and traditional regulatory frameworks. Nonetheless, the final decision by the SEC will critically shape the market landscape, potentially easing the integration of crypto assets into conventional financial systems or presenting new barriers.\n\nStory continues\n\nAs developments continue to unfold, the cryptocurrency community and prospective investors remain keenly focused on the SEC's actions. The forthcoming decisions will be pivotal in determining the future of Ethereum ETFs in the U.S. and will significantly influence the accessibility of digital assets to mainstream investors, marking a critical moment in the integration of blockchain technologies within formal financial systems.\n\nSolana (SOL) Sees 12% Increase as Network Congestion Clears and Block Production Stabilizes\n\nSolana has shown notable signs of recovery today, successfully breaking past the $150 resistance level, with its price now standing at $157.08 according to recent CoinMarketCap data. This 1.81% rise over the past 24 hours marks a significant turnaround for the cryptocurrency which had been struggling with network congestion issues.\n\nThe recovery in Solana's network is primarily attributed to improvements in block production, which has returned to a normal rate with an average block time of two seconds. Recent updates from SolanaFloor indicate that all 409 transactions were confirmed successfully, signaling a robust rebound in network health. This improvement has led to positive speculation about an increase in demand for Solana's native token, SOL.\n\nSolana's network had faced severe congestion problems, causing delays and operational challenges for many projects within its ecosystem. Some projects were forced to postpone their launches, while others sought alternatives, moving their operations away from Solana during the congestion period.\n\nHowever, the situation has seen a dramatic change with the latest update on block production. This development might signal a new phase of growth and stability for Solana, encouraging both current and potential project developers about the network's reliability.\n\nThe resolution of these issues can be credited to the efforts of Solana’s development team, including cofounder Anatoly Yakovenko, who have been actively addressing the scalability challenges. A significant breakthrough was achieved earlier this month when a major fix was implemented on the testnet by the core development team, supported by additional enhancements from other validator clients such as Anza.\n\nThis collective effort has not only resolved the immediate technical issues but also contributed to a substantial 24.5% increase in trading volume, pushing it to over $3.14 billion. The Solana community and investors are now looking forward to a promising future, energized by the network's recovery and the potential for continued growth and enterprise adoption.\n\n\n\nFurrever Token (FURR) Emerges as a Delightful Contender in the Cryptocurrency Market\n\nFurrever Token ( FURR ) has made an impressive entry into the cryptocurrency market, quickly setting itself apart from more traditional memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB) with its captivating, cat-themed design. Designed to resonate with cat lovers, Furrever Token offers a unique, heartwarming experience that infuses the digital currency space with a new level of cuteness.\n\nStrategically positioned for growth and long-term viability, Furrever Token allocated 65% of its tokens during the presale phase, successfully raising over $1,000,000. This significant achievement highlights the strong investor confidence in the project's vision and potential. Additionally, the decision to lock 10% of the tokens for the team underscores a commitment to the project's future prospects and stability.\n\nFurrever Token has also placed a strong emphasis on security and compliance. Comprehensive audits conducted by Securi Lab have bolstered its credibility, ensuring that the project meets high standards of safety for its participants. Beyond its financial attributes, Furrever Token has fostered a vibrant community atmosphere. Nearly 4,000 active members on Telegram contribute to a dynamic and engaging environment, turning the project into a movement that extends beyond traditional cryptocurrency dynamics.\n\nAs the presale phase draws to a close, anticipation is mounting for Furrever Token's upcoming launch on PancakeSwap. With the potential for returns up to 15X and a current trading price of $0.000648, Furrever Token is poised to capture both the hearts and investments of the cryptocurrency community. It offers a refreshing and cheerful alternative to conventional memecoins, appealing to both seasoned investors and newcomers attracted by its charming theme.\n\nFor anyone seeking further information or needing assistance with Furrever Token, official communications are advised to be conducted through the designated support channel at support(at)furrevertoken.com to ensure authenticity and avoid potential scams. This measure protects the community and maintains the integrity of the Furrever Token experience.\n\nDiscover the Most Exclusive Presale Opportunity of 2024 Now:\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support(at)furrevertoken.com\n\n\n\n"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOc0VwWENkamdsYnphR3FNdUlhOUhvTGVNYlJaMEhBZXdOYVh1Smowa0p1Rm5GOFRBSExwQ1hDLVo4ZG85alprNlp0Rm5ocG1wc2pab0hMc0Y2aFlTbWI5NnBYLWVfc0Y4WXRJbVZ3X1plQ1JkUDczdV9GTVYycDRTVURn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Apr 2024 07:00:00 GMT",
        "title": "SEC Postpones Ethereum (ETH) ETF Decision, Solana (SOL) Climbs 12% as Network Issues Resolve, Furrever Token (FURR) Excels in $1M Presale - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, April 25, 2024 (GLOBE NEWSWIRE) -- The cryptocurrency landscape is currently witnessing significant movements and regulatory developments that are shaping the future of digital assets. From the SEC's delayed decisions on Ethereum (ETH) ETFs to the surge in Solana's (SOL) network performance and the charming ascent of Furrever Token ( FURR ) , the dynamics within the crypto market continue to offer both challenges and opportunities for investors and enthusiasts alike.\n\nSEC Delays Decision on Ethereum (ETH) Spot ETFs, Extending Market Uncertainty\n\nThe United States Securities and Exchange Commission (SEC) has again postponed its decision regarding the spot Ethereum ETF applications submitted by Grayscale Investments and Franklin Templeton, casting prolonged uncertainty over the introduction of these investment vehicles on U.S. stock markets. This delay continues the trend of cautious regulatory scrutiny in the rapidly evolving cryptocurrency sector.\n\nPreviously, in a landmark decision last January, the SEC had approved 11 Bitcoin ETFs, which led to significant market inflows and demonstrated a strong investor demand for cryptocurrency-based financial products. Encouraged by this development, Grayscale attempted to convert its existing Grayscale Ethereum Trust (ETHE) into a spot ETH ETF in October. Shortly after, in February, Franklin Templeton also submitted an S1 form, signaling a robust interest among financial giants to facilitate access to Ether, which ranks as the second-largest cryptocurrency by market capitalization.\n\nDespite the evident enthusiasm and forward momentum from these asset management firms, the path to regulatory approval remains strewn with obstacles. Industry experts, such as those from JP Morgan, express skepticism regarding the rapid approval of these ETFs, estimating the probability of a favorable outcome by the May deadline to be less than 50%. This skepticism reflects the SEC's meticulous strategy in assessing new ETFs, emphasizing the protection of investor interests above all.\n\nThe ongoing postponements prompt speculation about the broader impact on the cryptocurrency market. A denial of these applications might lead these firms to consider legal action against the SEC, highlighting the tense interaction between evolving financial innovations and traditional regulatory frameworks. Nonetheless, the final decision by the SEC will critically shape the market landscape, potentially easing the integration of crypto assets into conventional financial systems or presenting new barriers.\n\nStory continues\n\nAs developments continue to unfold, the cryptocurrency community and prospective investors remain keenly focused on the SEC's actions. The forthcoming decisions will be pivotal in determining the future of Ethereum ETFs in the U.S. and will significantly influence the accessibility of digital assets to mainstream investors, marking a critical moment in the integration of blockchain technologies within formal financial systems.\n\nSolana (SOL) Sees 12% Increase as Network Congestion Clears and Block Production Stabilizes\n\nSolana has shown notable signs of recovery today, successfully breaking past the $150 resistance level, with its price now standing at $157.08 according to recent CoinMarketCap data. This 1.81% rise over the past 24 hours marks a significant turnaround for the cryptocurrency which had been struggling with network congestion issues.\n\nThe recovery in Solana's network is primarily attributed to improvements in block production, which has returned to a normal rate with an average block time of two seconds. Recent updates from SolanaFloor indicate that all 409 transactions were confirmed successfully, signaling a robust rebound in network health. This improvement has led to positive speculation about an increase in demand for Solana's native token, SOL.\n\nSolana's network had faced severe congestion problems, causing delays and operational challenges for many projects within its ecosystem. Some projects were forced to postpone their launches, while others sought alternatives, moving their operations away from Solana during the congestion period.\n\nHowever, the situation has seen a dramatic change with the latest update on block production. This development might signal a new phase of growth and stability for Solana, encouraging both current and potential project developers about the network's reliability.\n\nThe resolution of these issues can be credited to the efforts of Solana’s development team, including cofounder Anatoly Yakovenko, who have been actively addressing the scalability challenges. A significant breakthrough was achieved earlier this month when a major fix was implemented on the testnet by the core development team, supported by additional enhancements from other validator clients such as Anza.\n\nThis collective effort has not only resolved the immediate technical issues but also contributed to a substantial 24.5% increase in trading volume, pushing it to over $3.14 billion. The Solana community and investors are now looking forward to a promising future, energized by the network's recovery and the potential for continued growth and enterprise adoption.\n\n\n\nFurrever Token (FURR) Emerges as a Delightful Contender in the Cryptocurrency Market\n\nFurrever Token ( FURR ) has made an impressive entry into the cryptocurrency market, quickly setting itself apart from more traditional memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB) with its captivating, cat-themed design. Designed to resonate with cat lovers, Furrever Token offers a unique, heartwarming experience that infuses the digital currency space with a new level of cuteness.\n\nStrategically positioned for growth and long-term viability, Furrever Token allocated 65% of its tokens during the presale phase, successfully raising over $1,000,000. This significant achievement highlights the strong investor confidence in the project's vision and potential. Additionally, the decision to lock 10% of the tokens for the team underscores a commitment to the project's future prospects and stability.\n\nFurrever Token has also placed a strong emphasis on security and compliance. Comprehensive audits conducted by Securi Lab have bolstered its credibility, ensuring that the project meets high standards of safety for its participants. Beyond its financial attributes, Furrever Token has fostered a vibrant community atmosphere. Nearly 4,000 active members on Telegram contribute to a dynamic and engaging environment, turning the project into a movement that extends beyond traditional cryptocurrency dynamics.\n\nAs the presale phase draws to a close, anticipation is mounting for Furrever Token's upcoming launch on PancakeSwap. With the potential for returns up to 15X and a current trading price of $0.000648, Furrever Token is poised to capture both the hearts and investments of the cryptocurrency community. It offers a refreshing and cheerful alternative to conventional memecoins, appealing to both seasoned investors and newcomers attracted by its charming theme.\n\nFor anyone seeking further information or needing assistance with Furrever Token, official communications are advised to be conducted through the designated support channel at support(at)furrevertoken.com to ensure authenticity and avoid potential scams. This measure protects the community and maintains the integrity of the Furrever Token experience.\n\nDiscover the Most Exclusive Presale Opportunity of 2024 Now:\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support(at)furrevertoken.com\n\n\n\n"
    }
]