[
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNNkFoSGxWWXFacmh0Q2FrOUVJd2JvcHQ5OTJtNGl6eUtzN0V2U19EMV8tLVM3cEdEY0JsQlJSUTB2TEdvTXNtalJSVktiY2xBR1BqWGhXQlE2OHdRRlh5S2k5TklVMjNkdC1odkw0Z2t3OHFDejExTHIyR0xjRFhIa29BWmVOZ3Mzb285TTF0SEprUTc5cnRIdjh5TEh0dF9Dc3JhYWdici14eHBvVzUtbGJELXBwMi02by1vTUtTQXZtc3I5WG5IeUZkQWFpZ9IB0wFBVV95cUxQVVhKcWRFc0Vvd0ZrZml0ckwwMi1GaFEzZjFiMEdPSVFOb2w0Z256NUlBdEFucG1MMk9qR25ieVJ6U2UwTDk4NUQyQXBDUC1UVnZRWlp0WGZTM190Sm1iWGw1dVRYMnZLZzI1V1hTQ2k1WEs1cUk4TTRMMHlGeGNiWUplWWtmdTR0WWo3MWxiYVBfZ0ZRVEVyTmR4ZGF4R0xVako0VTNsV2k4aTdNZGt3ODN6T1ZEek1SVThlQ0p4d3ZkbS1STWlCQW1za0JOYWFqZk1v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Top Ethereum Challenger Could Skyrocket by Over 2x, According to Crypto Analyst Michaël van de Poppe - The Daily Hodl",
        "content": "A widely followed crypto analyst believes one Ethereum (ETH) competitor could more than double in price.\n\nCrypto trader Michaël van de Poppe tells his 718,900 followers on the social media platform X that interoperability blockchain Polkadot (DOT) is poised to rally due to major network advances.\n\nHe also says DOT is likely to see a boost from ETH’s upward momentum as well.\n\n“Polkadot did a retest at the crucial levels and wakes up slowly. Given their Polkadot 2.0 release and the JAM ( Join-Accumulate Machine) white paper and the correlation with ETH, I’m expecting a lot from them. Next target is likely $18.”\n\nPolkadot is trading for $7.14 at time of writing, up more than 4% in the last 24 hours.\n\nThe analyst also believes the broader altcoin market is entering a bullish phase after correcting.\n\n“The altcoin market capitalization has finished its correction. The next step: reaching all-time high, which is ~60%-70% from here. I think Ethereum is likely reaching that in the next two-four months.”\n\nHe says alts could outperform Bitcoin (BTC) in the months ahead.\n\n“The altcoins are still heavily undervalued. Most of them are down 70% against Bitcoin. That doesn’t mean we shouldn’t be having any correction, but feeling fear of missing out (FOMO) here is the wrong emotion to have. In the coming months, I expect altcoins to do way better.”\n\nLastly, the analyst says he is bullish on Bitcoin but expects the crypto king to retest the $68,000 level on the 12-hour chart before continuing upward.\n\n“Bitcoin slowly consolidating. Expecting a retest at the $68,000 mark, before a continuation upwards. The trend is clearly upwards.”\n\nBitcoin is trading for $67,553 at time of writing, down more than 2% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFB6LXkyTkoyd3M0SVdfVGVqVTdKc1lLclplVzJzZS15QXhNVnlvQ1A4bzd6MFdzNU5NRzJMQ1NPekJKbGJtTFdVNzR4QlNCeEJOdzJxYkZRaVBtZkRnaFFaMUt5QU44ckFtU3ZCaUg2Ym9nQnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Buterin's Ethereum Transfer Sparks Crypto Frenzy: $300K Surge For Privacy Shield - TronWeekly",
        "content": "Vitalik Buterin, cofounder of Ethereum, made a notable move in the cryptocurrency space today by transferring 80 ETH, valued at approximately $300,000, to the privacy-focused coin mixer Railgun. This transaction marks the latest in a series of monthly transfers Buterin has made to Railgun over the past six months.\n\nRailgun, renowned within the crypto community for its robust privacy protocols, offers coin mixing services designed to protect user anonymity and prevent malicious activities. Buterin has been an outspoken advocate for Railgun’s privacy pools protocol, which he argues significantly bolsters user privacy by complicating efforts to trace transactions back to their origin. “Privacy is normal,” Buterin has previously stated, underscoring the critical role of privacy in cryptocurrency transactions.\n\nThe privacy pools protocol employed by Railgun uses advanced cryptographic techniques to ensure transactional anonymity, addressing mounting concerns about privacy breaches in the crypto ecosystem. This innovative approach has made Railgun a favored platform for users seeking heightened security and confidentiality in their crypto dealings.\n\nEthereum Navigates Privacy Imperatives\n\nButerin’s consistent use of Railgun reflects a broader industry trend towards prioritizing privacy in cryptocurrency transactions. As regulatory scrutiny of cryptocurrencies intensifies globally, platforms like Railgun, which emphasize privacy, are increasingly viewed as essential for maintaining transactional confidentiality while complying with regulatory requirements. This trend is particularly significant for Ethereum, which continues to see growing adoption and an evolving regulatory landscape.\n\nThe timing of Buterin’s latest transfer coincides with a bullish phase for Ethereum’s market performance. Recent data shows ETH trading at $3,740, a 2.06% increase over the past 24 hours and a significant 29% rise over the past week. This surge in Ethereum’s price is fueled by community anticipation around potential approvals of spot Ethereum ETFs by the U.S. Securities and Exchange Commission (SEC).\n\nButerin’s strategic move underscores the importance of privacy-focused solutions like Railgun in the rapidly evolving cryptocurrency market. As Ethereum continues to gain traction and regulatory landscapes shift, the role of platforms like Railgun in safeguarding user privacy is set to become increasingly vital."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE9GNVU5NF9zMXEydy1SVHRVTG1PYXpOLV9nQU9yM2xQTHhlQ1pBYUgxdGZTQWs1SnlpVkdDREFnQmF5ZjFqSXd1ZUptR1NzNmg5WWotS01aMHRzUG9xNURxa2FDb0VMeUs0UDA0TnFxNNIBd0FVX3lxTE1HTEZIU1lpTDNEclZEZFFQN0U0YUthc2xvc3E4MzhsV1I2WE5YbmsxeWlsQkpUM0tjNW1weHMxNFNib2E4RlFja0pfQ1R4WHQ5WHd6M19jblQ3R2FQd29ZT2Y0VmNTMjhPa2tsdWw0ckpTNENfaUhz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Could Lead to 'Serious' Security Risks, Say Experts - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nExperts are warning of the looming threat that the newly approved U.S. spot Ethereum ETFs could pose if staking is ever introduced.\n\nIn a crucial bid to push the approval process over the line, Ethereum ETF issuers dropped language regarding the staking of customer ETH.\n\nWhen the network transitioned to a proof of stake consensus in September 2022, it required ETH to be locked up in a process called staking. The staked ETH belongs to validators who help to secure the network. They’re rewarded for staking their ETH, but can be penalized if they don’t verify transactions on time.\n\nCentralization concerns have arisen in the past when single validators gained control of large portions of staked ETH. At time, people have even compared liquid staking provider Lido to a \"cartel\" when it swelled in size.\n\nAD\n\nAD\n\n“Removing staking language from ETH ETF applications was a move to appease the SEC. But this short-term solution could cause a long-term problem.” Ganesh Swami, CEO and co-founder of blockchain data analytics company Covalent, told Decrypt, “If multiple ETFs use the same custodians, this type of centralization would cause concentration to increase, exposing the network to operational risks such as malicious collusion.”\n\nTaking a look at the U.S. spot Bitcoin ETFs, we can see that Coinbase is the custodian for 90% of the total assets. While this poses an obvious centralization risk already, adding staking to the equation, well, ups the stakes.\n\n“Staking ETH ETFs are not a new concept, they exist in other countries, but clearly the U.S market brings a much larger scale,” Andrew O’Neill, analytical lead on digital assets at S&P Global, told Decrypt. “The risk in that case is that if ETFs are concentrating their stake with a small number of custodians, this could create validator concentration risks in the consensus mechanism.”\n\nCoinbase, which is already the second largest Ethereum validator, is currently set to be the custodian of at least six out of the nine firms planning to launch an Ethereum ETF. If we see similar interest as we did with the U.S. spot Bitcoin ETFs, which as a group currently have a market capitalization of $54 billion, this concentration of power could pose a security risk.\n\nAD\n\nAD\n\n“You can measure concentration risk by the number of nodes a single entity would need to control the chain. The lower that number, the higher the central point of failure.” Mona El Isa, CEO and co-founder of institutional DeFi company Avantgarde Finance, told Decrypt, “If any party amassed that much control, they could potentially alter the state of the blockchain itself. That poses serious risks to security.”\n\nIt appears that staking was removed from Ethereum ETF applications due to the SEC’s view that staking is equivalent to a securities service. It’s not without precedence. The SEC has sued companies, like Kraken and Coinbase, to stop them offering staking services to U.S. customers.\n\nAs staking is currently not allowed for ETF providers or custodians, there are no guidelines put in place to reduce the potential centralization and concentration risks that could be looming.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMingJBVV95cUxQVHFYLW9IU1NVOTdJM2pOOG5JVTBTSldyWXY4WVIybmZZeVBxMkRCajhlaFk1RDZabzdIS0FZRU5ET09uNDgxSHVma1p3YURHWTU2TXdEU0JnbWl0YkZPS0EtcmszU2RiN0xHTC1ZR2dWNkh5c01NZm9mRVc0d0dxS01wVGhnSG9PVFZON1puWUQwS1ZrS0p5TlBOR05OS0pqd2NuWEVHTjcyVmg4T3lJUVYtcnBMZXdpUHgzc1dHdzlwNndveGY0LTc3U1Q0XzVlOFpwY0JzZFhZS2xGSVNkTE1WWlZSZXNEUkxFYTRsU3RJcGZJeDhtYVJseVZXdjR4Rkk0T0ExRDgwbjhSVTdCWFhIdEJ1ODdfenRERGh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "“This is the Time to Get In ” – Bitcoin and Ethereum on the - GlobeNewswire",
        "content": "London, UK, May 24, 2024 (GLOBE NEWSWIRE) -- Bitcoin, Ethereum, and BlockDAG Network are all making significant moves in the market. This is what’s happening;\n\n\n\n\n\n\n\n\n\nBitcoin surged over $70,000 per BTC on Wednesday, nearing its all-time high of $73,500 reached last March. Meanwhile Ethereum has seen a 20% rise to nearly $4,000 per Ether, as the crypto market anticipates a pivotal vote in Washington.\n\nThe rally follows the U.S. Securities and Exchange Commission (SEC) requesting updates from entities applying to issue spot Ethereum exchange-traded funds (ETFs). Analysts foresee approval triggering a $4.2 trillion price surge, especially after the SEC's communication with potential fund managers, suggesting accelerated approval may be imminent.\n\nETF analysts have increased approval odds, citing the political climate and potential impact on Ethereum's value. The decision is expected this week on VanEck's and Ark/21 Shares' ETF applications, with analysts anticipating a significant market response akin to Bitcoin's ETF approval in January.\n\nThe potential approval of spot Ethereum ETFs is predicted to propel the Ethereum price to $8,000 by 2024 and $14,000 by 2025, impacting Bitcoin positively as well. With spot Bitcoin ETFs reporting record inflows and continued growth since their launch, analysts anticipate further market highs, aligning with projections of a $150,000 Bitcoin price by 2024 and $200,000 by 2025, amounting to a combined near-$4.2 trillion valuation for Bitcoin and Ethereum.\n\nIn the meantime, BlockDAG Network is revolutionizing the cryptocurrency landscape, emerging as the fastest-growing community in the crypto world and hosting the largest Initial Coin Offering (ICO) of 2024. With over 120,000 holders already on board, up $31 million in record time and a goal of $600 million within reach, BlockDAG is not just a network but a whole movement.\n\n\n\n\n\n\n\n\n\n\n\nBlockDAG Network stands out with its cutting-edge Directed Acyclic Graph (DAG) architecture, which allows it to achieve unmatched transaction speeds of 10 blocks per second. This high throughput positions BlockDAG as an ideal solution for both everyday transactions and institution-level decentralized finance (DeFi) protocols. The platform’s commitment to technological excellence ensures a seamless and efficient user experience.\n\nBlockDAG introduces a unique mining system designed to provide passive income opportunities. The newly launched X1 mobile miner allows users to mine cryptocurrencies on their smartphones without significant data or battery usage. This innovation means anyone can earn money virtually anywhere and everywhere, making mining more accessible and convenient than ever before.\n\nJoining the BlockDAG Network means becoming part of a vibrant, global community of enthusiasts dedicated to making this project the best in crypto-history. With tens of thousands of members, the community is the backbone of the project’s extreme success, driving innovation and growth through continuous engagement and collaboration.\n\nBlockDAG Network is on an ambitious journey to “the moon,” with every milestone bringing it closer to the ultimate goal of revolutionizing the digital space.\n\nThe BlockDAG presale is the fastest growing in crypto history, offering an unmatched opportunity to join a burgeoning journey. Expert analysts predict incredible potential for BlockDAG, with $BDAG tokens projected to reach $10 in 2025.\n\n\n\n\n\n\n\n\n\nIn the midst of Bitcoin and Ethereum's market surge, BlockDAG Network emerges as the fastest-growing community and the largest ICO of 2024.\n\nAnalysts project BlockDAG's $BDAG token to reach $10 by 2025 from its current $0.0085 price, marking an unprecedented rise. As the BlockDAG presale gains momentum and rises upwards from the $31 million already raised, it's clear: in this time BlockDAG Network will redefine the future of cryptocurrency.\n\nRead About BlockDAG Presale:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram:https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\n\n\n"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNaF82d0pYUlA3X0Z3c0dfTGloUm5YTVFtUDN4bjBuM2NTbWVZSmRHV0hqMTRyOU9lU2U0NWFQMkpoTnc4THNJX2FkaG52YTJndFRyNWxmVGxyRVZvaUpqNmxHWFhhaWtvRno2b21naWtTRlFueWJFYTdLZEpmNGtmMFhPXzNiUktLbWVUbWpYTElMUVJpWktuUG9nY3JHWHhyTDk3cThxN1lVcW82V3ZZTlREbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Ethereum’s powerful new ‘EigenLayer’ promises a wave of innovation. But is it a threat to the blockchain? - Fortune",
        "content": "Ethereum has spent the current bull market living in the shadow of Bitcoin, but two recent developments could thrust the world’s second-biggest blockchain back into the spotlight. The first is the Securities and Exchange Commission’s surprise move to greenlight Ethereum ETFs. The second is a popular but divisive new investing feature called EigenLayer, which has received $100 million in backing from Andreessen Horowitz (a16z) Crypto.\n\nEigenLayer is a new protocol, or set of instructions, that sits atop the main Ethereum blockchain. It offers a way for those who have already invested tokens by means of staking—a blockchain feature that rewards those who lock up their tokens to secure the network—the ability to “restake” those tokens. The term is what it sounds like. By restaking, users take Ethereum tokens they have already invested and then invest them again. But instead of receiving a reward from the Ethereum network, as happens with staking, those who restake get paid by other projects piggybacking off the blockchain’s existing security pool.\n\nRestaking has existed for some time but EigenLayer is seeking to turbocharge the process by adding a lot more participants. The protocol aspires to be something akin to an Amazon Web Services for cryptoeconomic security.\n\nThe implications of this are “profound,” a16z wrote in a blog post about the company, noting that EigenLayer has the potential to accelerate innovation on Ethereum “100x faster.” While this appears to be a promising development for the blockchain, EigenLayer has yet to be tested at scale. And while it could result in a burst of innovation for Ethereum, some point to a major potential drawback: a new concentration of risk that, in a worst-case scenario, could harm both users and the broader blockchain ecosystem. Should Ethereum users view EigenLayer with excitement, fear, or both?\n\n‘Opens up a wormhole’\n\nThe arrival of EigenLayer is a boon both to investors, who can now more easily earn an additional slice of yield, and for developers who can more quickly add a trust layer in the form of collateral. The issue, however, is that using the same pool of collateral to secure multiple aspects of the blockchain creates new vulnerabilities.\n\n“It opens up a wormhole,” Rushi Manche, cofounder of Ethereum layer 2 Movement Labs, told Fortune. Manche raised a troubling hypothetical posed by EigenLayer critics: What happens if there’s a hack or a bug in the restaking smart contract? How does that affect the wider ecosystem which is also relying on this single deposit?\n\nAt the same time, Manche noted that proponents say “an entire new design space has opened up” for developers thanks to EigenLayer, allowing the same asset to be stretched much further and achieve much more. From this view, the rewards far outweigh the risk. It’s also worth considering the drawbacks if tools like EigenLayer are not available.\n\nSpecifically, in the absence of restaking, decentralized applications built on top of Ethereum must create their own proof-of-stake token—a high bar of entry for any startup. With restaking, protocols can dip into the main blockchain’s almost $95 billion of staked Ether for security. To revisit the cloud computing analogy: If hackers want to attack small businesses, they have to get past the likes of Google Cloud or AWS on which those businesses rely. EigenLayer proponents make the same case: Hackers need to get past a security system created by Ethereum, which has worth more than triple the market cap of Nike.\n\nBut, what happens when the same collateral gets reused again and again?\n\n“EigenLayer reminds me of the 2008 recession: undercollateralize, overleverage. That’ll go well,” one X user posted—just one of the industry onlookers who have drawn parallels with the financial crash, where banks rehypothecated subprime mortgage loans.\n\nAustin Campbell, the former head of portfolio management at Paxos, told Fortune that the comparison isn’t trivial. “At the core of every levered system is the simple truth that the more leverage you use, the less stable your system is,” he said.\n\nThere is a risk of “cascading failures” if one project fails, agrees Omid Malekan, an adjunct professor at Columbia Business School. But he and many experts were also quick to offer nuance to the 2008 parallels: Restaking doesn’t involve rinse-and-repeat borrowing and lending. Instead, it’s taking a locked-up asset, and locking it up again. Think of it more like reusing the security deposit on an apartment to secure further apartments, suggests Jack O’Holleran, CEO of Skale, an Ethereum layer 2.\n\nBut then what if you trash both apartments?\n\nOne scenario of so-called apartment trashing would be if those operating the restaking services—known as AVS for “actively validated services”—choose to devalue the restaked tokens. “There could be this ‘house of cards’ effect, but backwards,” says O’Holleran.\n\nThe debate is analogous to the criticism of liquid staking provider Lido, which currently accounts for 28% of all Ethereum being staked. In theory, Lido introduces a “centralized point of failure” which is “obviously concerning,” Tekin Salimi, founder of dao5 Capital and seed investor in EigenLater, told Fortune. But in his view, rather than barring this innovation, diversifying the liquid staking providers is the solution.\n\nNoting these concerns, EigenLayer says on its website that it includes a “veto committee” to contain slashing—the term used in the Ethereum world for destroying the collateral of validators who fail to fulfill their duties—and to prevent contagion to the mainnet or other protocols. It will serve as a “doubly-trusted intermediary between AVS and staker.” So, slashing conditions fall to each AVS, instead of the overall protocol’s discretion. But what this will really look like in practice, is unclear. To that effect, slashing risks remain “the most real and yet the most undefined” of all those raised, thinks Vance Spencer, cofounder of crypto venture capital firm Framework Ventures.\n\n‘Don’t overload the system’ Ethereum founder warns\n\nEigenLayer has given rise to specific security concerns, but also to a more broader existential one: What fraction of staked tokens can be concentrated on a separate protocol on Ethereum, which holds up decentralization as its paramount value? According to O’Holleran, empowering EigenLayer amounts to the Ethereum community giving considerable leverage and power to another system. Furthermore, copycat restaking services are also popping up, such as Karak, which announced a $48 million Series A raise last month. In addition, an unnamed but similar version is soon coming to market, sources close to the matter told Fortune.\n\nVitalik Buterin, Ethereum’s founder, raised concerns about EigenLayer in a blog post last May. “Be wary of application-layer projects taking actions that risk increasing the “scope” of blockchain consensus to anything other than verifying the core Ethereum protocol rules,” he wrote. Buterin warns of the “slippery slope” of the underlying network’s “fragile” social consensus losing credibility. His message was clear: Don’t overload the network’s consensus.\n\nOne of the concentration risks of top concern to Buterin is overloading the system’s security.\n\nThe strength of Ethereum’s security system is directly correlated to the economic value of the network—it would be prohibitively expensive for hackers to muster the resources to defeat the consensus system that protects the network. “We agree that Ether is being used to secure the main net network, and that is the only purpose thereof,” says Campbell. But if you are using your staked tokens to secure Ethereum and other networks, then the surface of things that Ether is being used to secure grows. So, the value resting on any single point gets larger, explains Campbell, which may provide more attractive incentives for hackers.\n\nThe second concentration risk concerns decision-making. Let’s say 40% of Ethereum’s tokens eventually becomes restaked and EigenLayer’s smart contract experiences a hack or bug. It’s unclear when there would be consensus to rollback Ethereum to release it, explains Tom Schmidt, partner at crypto venture capital firm Dragonfly. “I don’t know where that threshold is,” he admits."
    }
]