[
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQWGF5N1JRTjBncFdocDZjd0sxcVFIbE5ONnZyM3hTVDAzWFpLZ1IxeUdUdGJQUUhCVUNIRmxuS1k3dGNGNklPVjRaSWxfeEZXTXJINGVLSmR2R0tVZmNQRUR0QUM5eU0xRUhJS2FhSE5lRHVqLW5jZmNCbDFiX1Z5R1ZMMDkySjB3NVAyZnNNcUHSAZYBQVVfeXFMTkRJNjZ0a01HYl9KS2ZXcnh5NTFDcUxveWstQzVHcS1jbGdKYkJRb3hEZV84R1VQXzNsdC13RC1qVF8yR3pGR24wNjB3QkRQYjRHbVFkWllxblB2NldOaF9tVEdXR0dYNHZQYnZHT1JCV1RSSmQ0RmlqLVM5MTZFYjNheGdaV0t6UnFKS0p0bktXRjQ5UWdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Ethereum L2s take the center stage as countdown to Dencun begins - AMBCrypto News",
        "content": "ETH L2s handled nearly 10x more transactions than the base layer in the last seven days.\n\nTVL on ETH L2s jumped 65% YTD.\n\nEthereum [ETH] layer-2 (L2) solutions carried on the strong momentum generated in the last year to 2024 as well.\n\nEthereum scales and how\n\nAccording to a recent post by on-chain analytics firm IntoTheBlock, transaction volumes across leading optimistic rollups including Arbitrum [ARB], Optimism [OP] and Base have nearly doubled since the start of this year.\n\nOn expected lines, Arbitrum accounted for more than 50% of the total volume.\n\nTo get more insights, AMBCrypto examined the broader ETH L2 market, which included zero-knowledge rollups (zk-rollups) as well.\n\nData sourced from L2Beat showed scaling solutions processing nearly ten times as many transactions on the mainnet over the last seven days.\n\nThe average transactions per second (TPS) on the L2s consistently remained above 100 since the 25th of February, while the mainnet’s count hovered in the usual range between 12-14.\n\nL2 solutions witness jump in TVL\n\nThe so-called L2 solutions, built atop the base layer of Ethereum, were projected to be the answer to the scalability question.\n\nWhile these chains handle the bulk of the low-value transactions, the mainnet would take care of security and decentralization, thus addressing the blockchain trilemma to a great extent.\n\nThe fundamental advantages like high throughput and low fees attracted a plethora of decentralized applications (dApps) towards L2s.\n\nAs of this writing, more than $33 billion was locked into L2 projects, implying a 12.9% increase over the week, and a 65% leap year-to-date (YTD).\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nA watershed event awaits\n\nSuch numbers come at a time when the L2 proponents and the broader Ethereum ecosystem were eagerly awaiting for the Dencun Upgrade. The biggest upgrade since last year’s Shapella, Dencun was expected to bring about a whopping 10x reduction in L2 transaction fees.\n\nIf these estimates come true, the ETH L2 ecosystem might hold the vast majority of all DeFi users and apps in the near future."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE5keWZzeUM1c0NMb0RhSlBWV2R0cmRrUmpOQW82ZnJiRUp4TU9EUUxqS0NxSnhRYm5wRDlCX1RIR1VQWlM3VVEyOENKOS0tUjBrODI3TU9uX0FXbl9pUklCaER6cWRIZDFW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Solana 500% Surge Sparks Ethereum Déjà Vu - TronWeekly",
        "content": "Buoyed by the bullish market momentum, Solana has recaptured investors’ sentiment, steering attention away from Bitcoin and Ethereum. SOL is on the cusp of breaking new records as the token approaches a 2-year high. From less than $10 a year ago, the leading altcoin exceeded $130, a whopping 500% surge.\n\nSimilarly, the trading volume of the 5th largest crypto asset has spiked 120% to $3.2 million. Market experts have drawn parallels between SOL’s price trajectory and that of Ethereum in 2020. If the rest of the cycle plays out similarly, a takeoff is imminent.\n\nSOL still really reminds me of ETH in 2020. Pretty sure the rest of the cycle plays out similarly too, expecting takeoff soon. Bring it on.\n\nWhile price is one way to look at it, the other perspective is revenue, as gauged by the gas fees of the respective blockchains. And Solana’s gas fees have been soaring, both in absolute terms and as a percentage of Ethereum’s gas fees. In February 2023, Solana’s daily gas fees were less than 0.2% of Ethtereum’s. In January 2024, the table flipped as Solana’s daily gas fees exceeded 8% of Ethereum’s, making a nearly 40-fold increase.\n\nImage Credit: PYOR\n\nSolana’s DeFi TVL has also scored a new milestone, surpassing $2 billion, a level not seen in the last 20 months. The new feat is a testament to its robust DeFi ecosystem, which has bounced back strongly since the 2022 FTX collapse. Since December, the total value locked has doubled, indicating increased user activity and trust in the platform’s DeFi applications [DApps]. The blockchain’s scalability and affordability make it a cheaper and faster alternative to Ethereum.\n\nSolana: Dynamics of DEX Volume and Notable Sector Gains\n\nWhat’s more interesting is that while constituting less than 3% of total DeFi TVL, Solana generates over 20% of the overall on-chain DEX volume. Along with SOL, Ethereum, Manta, and Arbitrum also recorded notable gains. This uptrend marks the fourth consecutive month of growth for DeFi since it finally broke its downtrend in October 2023.\n\nMarket observers have noted that the liquid staking and lending/borrowing sectors led the surge across key protocols, culminating in a robust DeFi week for Solana."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE5keWZzeUM1c0NMb0RhSlBWV2R0cmRrUmpOQW82ZnJiRUp4TU9EUUxqS0NxSnhRYm5wRDlCX1RIR1VQWlM3VVEyOENKOS0tUjBrODI3TU9uX0FXbl9pUklCaER6cWRIZDFW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Solana 500% Surge Sparks Ethereum Déjà Vu - TronWeekly",
        "content": "Buoyed by the bullish market momentum, Solana has recaptured investors’ sentiment, steering attention away from Bitcoin and Ethereum. SOL is on the cusp of breaking new records as the token approaches a 2-year high. From less than $10 a year ago, the leading altcoin exceeded $130, a whopping 500% surge.\n\nSimilarly, the trading volume of the 5th largest crypto asset has spiked 120% to $3.2 million. Market experts have drawn parallels between SOL’s price trajectory and that of Ethereum in 2020. If the rest of the cycle plays out similarly, a takeoff is imminent.\n\nSOL still really reminds me of ETH in 2020. Pretty sure the rest of the cycle plays out similarly too, expecting takeoff soon. Bring it on.\n\nWhile price is one way to look at it, the other perspective is revenue, as gauged by the gas fees of the respective blockchains. And Solana’s gas fees have been soaring, both in absolute terms and as a percentage of Ethereum’s gas fees. In February 2023, Solana’s daily gas fees were less than 0.2% of Ethtereum’s. In January 2024, the table flipped as Solana’s daily gas fees exceeded 8% of Ethereum’s, making a nearly 40-fold increase.\n\nImage Credit: PYOR\n\nSolana’s DeFi TVL has also scored a new milestone, surpassing $2 billion, a level not seen in the last 20 months. The new feat is a testament to its robust DeFi ecosystem, which has bounced back strongly since the 2022 FTX collapse. Since December, the total value locked has doubled, indicating increased user activity and trust in the platform’s DeFi applications [DApps]. The blockchain’s scalability and affordability make it a cheaper and faster alternative to Ethereum.\n\nSolana: Dynamics of DEX Volume and Notable Sector Gains\n\nWhat’s more interesting is that while constituting less than 3% of total DeFi TVL, Solana generates over 20% of the overall on-chain DEX volume. Along with SOL, Ethereum, Manta, and Arbitrum also recorded notable gains. This uptrend marks the fourth consecutive month of growth for DeFi since it finally broke its downtrend in October 2023.\n\nMarket observers have noted that the liquid staking and lending/borrowing sectors led the surge across key protocols, culminating in a robust DeFi week for Solana."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQNUdxSExGQ2pZTGF2U0xCWFkybVdqUnBodkdmSXlYQTFzX3lLRC1XWVlOWVBBYjZia2d2RTJDTm1wQjlLUnB1WVZ1Y0pieDNCYWstOHdQeUhfc3otbHdLS3JzZGQ0SHZmOTdmUzlLbWtZbjhNYXgwdnBYN19aYTI4Umg3WdIBiAFBVV95cUxONGtpc3RFSGZaNDJLd1d6ZTA1M2FTX2lWbGt4QVNBcXpQN2QteS1nRllsYjluRlNGdEJ3eVEwQ2FKcF9jdzdGN1J3NVhSWTlMTkp1UzVyWGp0dzNlNElHR3NTb2N0dVBHTTA2d2RGUjhTWHRZNnRTZHQtSldsLXF0LTBxQ0dQRTFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Ethereum’s latest milestone – What about ETH prices? - AMBCrypto News",
        "content": "Ethereum’s MVRV ratio now sits above 100%.\n\nThis marks its highest level since April 2022.\n\nEthereum’s [ETH] Market Value to Realized Value (MVRV) ratio has climbed to its highest point since April 2022, data from Santiment revealed.\n\nThe MVRV ratio assesses whether an asset is overvalued or undervalued. It does this by comparing the current market value of an asset to the average price at which all units were last moved on the blockchain.\n\nWhen it increases, it suggests that the current market value of an asset is significantly higher than the price at which most investors acquired their holdings.\n\nAt press time, ETH’s MVRV ratio was 103.11%, having risen by 145% since 25th January, per Santiment’s data. This rally coincides with the recent surge in ETH’s price, which recently surpassed the $3,400 mark, according to data from CoinMarketCap.\n\nWith an MVRV ratio of 103%, ETH’s current market price is 1.03 times higher than the average price at which all ETH units were last moved on the blockchain. Therefore, on average, most coin holders would realize at least 100% profit on their investments if they sold now.\n\nNo cause for alarm\n\nWhile readings from ETH’s Bollinger Bands indicator observed on a single-day chart revealed that ETH’s price remained prone to swings, other key indicators showed that bullish sentiments exceeded bearish activity.\n\nFor example, the coin’s Awesome Oscillator returned green upward-facing bars at press time. This indicator measures market momentum by comparing its short-term and long-term moving averages.\n\nWhen it returns only green bars, it indicates that the short-term moving average is rising faster than the long-term moving average. This suggests that the bullish sentiment is strong and gaining momentum.\n\nFurther, the coin’s Moving Average Convergence/Divergence (MACD) line (blue) rested solidly above the trend (orange) and the zero lines as of this writing.\n\nWhen readings from this indicator show the MACD and trend lines above zero (as is the case here), it suggests that bullish momentum is prevailing in the market.\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nOn the coin’s derivatives market, futures open interest totaled $11.38 billion as of this writing. The last time ETH’s futures open interest was that high was in December 2021, per data from Coinglass.\n\nWith the growth in the coin’s positive funding rates across exchanges, futures traders continue to place bets in favor of a price rally."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNeHpTdEdjTEM3OVNPOTExaVZGOE5ZM3Z6MHp2eW5tTXhZNG5xZ3JGMnhIRGJLUGZFdmNraGxIQ2VwQzBKNVpMNzN6UmdvMnhSbGhySXotQkpiQnVobVFGRkR0c0MtR1RjU2hncjRGQ3g0UVVMUTlqVjZncmlWQm4yUmk0UzhzNkhZTEVz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Filecoin is riding the boom in liquid staking - DLNews",
        "content": "Liquid staking is booming on Filecoin.\n\nMost of the increase has come from the GLIF protocol.\n\nGLIF said it intends to launch a points system, a trend among Ethereum and Solana DeFi applications.\n\nAlmost one year after the introduction of Ethereum-style smart contracts, so-called liquid staking protocols are booming on Filecoin, a blockchain built to store data.\n\nSince January 1, the value of crypto locked in Filecoin’s dozen liquid staking protocols has grown to more than $450 million from $272 million.\n\nIt’s a sign users are becoming more familiar with Filecoin and its nascent DeFi ecosystem.\n\nIt’s also another sign that users love the points systems that have taken over Ethereum and Solana, too.\n\nA “likely catalyst” for Filecoin’s recent growth “is the anticipation of rewards programs that incentivise user activity,” Messari analyst Mihai Grigore told DL News.\n\nLike airdrops — projects’ distributions of free tokens to reward early or loyal users — points programs, which function much like traditional businesses’ rewards programs, can juice user activity.\n\nUnlike airdrops, however, they allow US-based projects to avoid the regulatory headache that can come with promising or issuing tokens.\n\nAs such, they have spread like wildfire among decentralised finance applications on Ethereum and Solana. They appear to be a powerful incentive on Filecoin, too.\n\nJoin the community to get our latest stories and updates\n\nOf the dozen liquid staking protocols tracked by DefiLlama, all have grown at least 48% in the past month. But GLIF, the largest, has separated itself from the pack.\n\nGLIF is a long-running project on Filecoin. It built one of the blockchain’s first wallets, according to founder Jon Schwartz. When Filecoin developers added smart contract functionality in March 2023, GLIF built a liquid staking service.\n\nDeposits to GLIF have skyrocketed since early February, when it announced a $4.5 million raise and the launch of a points system sometime in the first quarter of the year.\n\nSince then, the total value of crypto locked in GLIF has more than doubled. On February 22, user activity briefly overloaded GLIF’s website.\n\n“Year-to-date, GLIF’s increase in net deposits of [about] 6.9 million FIL accounted for nearly 76% of the total DeFi net deposits on Filecoin,” Grigore said. That figure doesn’t account for collateral posted by borrowers on GLIF.\n\nSchwartz attributes the jump to points and to growing comfort with Filecoin.\n\nWhen Filecoin developers launched the blockchain in October 2020, there were only 11 built-in smart contracts.\n\n“That would be analogous to Ethereum having, say, 11 smart contracts, and those were the only ones you could really use on the network,” Schwartz told DL News. “No developers like myself could deploy custom smart contract logic to the chain.”\n\nThat changed last March, when developers introduced smart contract functionality.\n\nThat change brought Ethereum-style smart contracts on Filecoin, enabling DeFi use cases, “notably liquid staking,” Grigore said.\n\nSchwartz believes the blockchain is now reaping the benefits of that paradigm change.\n\n“You know how these things go, especially with new and immature networks,” he said. “It takes time for DeFi to develop and for people to get comfortable.”\n\nLiquid leasing\n\nLiquid staking is the biggest business on Ethereum. As of Wednesday, users had deposited more than $46 billion in cryptocurrencies in Ethereum’s three dozen liquid staking protocols.\n\nThat’s because it addresses a key issue with Ethereum’s so-called proof-of-stake security system, which was adopted in September 2022.\n\nIn a proof-of-stake system, security, as well as the privilege of confirming and ordering transactions, comes from users willing to lock up, or stake, their Ether in exchange for a modest annual yield.\n\nLiquid staking protocols address the opportunity cost that comes with locking away one’s Ether by issuing derivative tokens, which typically trade at par with Ether and are accepted in its stead by decentralised exchanges and lending protocols.\n\nFilecoin isn’t a proof-of-stake blockchain, and Schwartz prefers to call GLIF a “liquid leasing” protocol.\n\n“That said, the problem space the GLIF is filling for Filecoin is pretty much the same problem space that, say, Lido is building for Ethereum, or Jito for Solana,” he said, referring to other blockchains’ liquid staking protocols. “But the mechanisms are different.”\n\nFilecoin’s big year\n\nIt’s just the beginning of what could be a busy year for Filecoin.\n\nEarlier this month, Filecoin and Solana project Triton One announced a partnership, in which Triton would store Solana data on Filecoin.\n\nDevelopers behind billion-dollar decentralised exchange Uniswap deployed the protocol to Filecoin this week. SushiSwap developers launched their decentralised exchange on the blockchain in November.\n\n“A lot of these new projects that have components that were built on the [smart contract functionality] … they’ll come out this year,” Schwartz said.\n\n“It’s going to look like a different Filecoin, simply because what’s possible this year was not possible in the three, four years prior,” he added.\n\nAleks Gilbert is a DeFi correspondent for DL News. Have a tip? Contact Aleks at aleks@dlnews.com."
    }
]