[
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNMldoR1h3QW44d3N5LVpoRmVxdFpxUFUyYXVabHpESVdrUkY2RG00T0RQWXljRldNQjFmbEFkZ200T0pmREs1bVd2amJIbktxRWFONzhlbXVSSm5fTTlRM29RejlPX2pfUjVVSUYxLS1HYmtoRkpzYkIzSkgzcnhTTmpVamI0RzJF0gGQAUFVX3lxTE95ZFJVdzlKc2VfTmpMRVB0Zm12NGlUcUNEUUVLRmo4TEhRZDhsZ25GX2RMVnhQelRrejdQMGNqRlltWGhfUjhfV0p4YVhPaEJET01ham9JZXlzVXFDd1RmQUk1c0RzZTk4azBDcS1IWWVZQl8yRGVlcFdFdTdYRjNoT3FMbTF6bHRFTmNJU0lBMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Solana Meme Coin Bonk and Ethereum's Pepe See Big Losses - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMeme coins Bonk, Pepe, and Brett are among the top five worst losers in the top 100 cryptocurrencies in the past day, according to Coingecko data.\n\nSolana’s dog coin Bonk (BONK) has taken the greatest hit, falling 12.1% to $0.000023 on the day. This comes amid a Bonk DAO vote to burn 100% of the BONK earned by the Decentralized Autonomous Organization (DAO). At the time of writing, the approval is set to pass with 99.3% of the vote.\n\nMeanwhile Ethereum’s Pepe (PEPE) is down 9.6% and Base chain’s Brett (BRETT) has fallen 8.1%. These are outsized losses compared to the broader meme coin market, as defined by CoinGecko, which has slipped by 3% in the past 24 hours.\n\nOther big meme losers include Dogwifhat (WIF) which has fallen 5.1%, Mog Coin (MOG) down 12.7%, and Popcat (POPCAT) which has stumbled 10.6%. Even meme coin veteran Dogecoin (DOGE) is down 3.1%.\n\nAD\n\nAD\n\nIn fact, the meme coin market has been hit so hard that only one of the top 50 meme coins by market cap is in the green over the past 24 hours. Ethereum’s Kendu Inu (KENDU) is up 13.3% after a Coinbase video advertising its new wallet web app included the token’s ticker.\n\n“Notice anything chads,” the meme coin’s Twitter account posted, “Coinbase it’s time.”\n\nAccording to CoinGecko, KENDU has a market cap just shy of $100 million after its 21% rise over the past week.\n\nAD\n\nAD\n\nDespite the meme coin market taking a hit, zooming out it doesn’t look too bad.\n\nThe meme coin category has gained 3.1% over the past 7 days, with many of today’s losers still being valued higher than they were a week ago.\n\nThis includes MOG which is up 21.3%, Bonk up 12.9%, Doge still up 7.8%, Popcat 4.4%, and Pepe 5.2%.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOMldIeG5tdWg4ZVNmaTVOQjYwVEpNVWJmTTA0TjhLTGM4c3VkSmVLb3V5am9jd3ZQV212djYzNDJoaEJmR01rM2tWcmdYZmZWM2hHWlpHU05RaXhub0JCLXpkNUNRdlBTR2E4TTdObUZOaFZyMnBCbjU0dldzQmpnc2g0eHdzZmdZQThsOElqTGw4UU5DeGI4VVM2UU9SNTB4a0QwZU4yb9IBrAFBVV95cUxNYUFreE91V0hMaEVSTE83WkRJeERaejZuTEhIYWtBcjN3ekswd1dINUszcnp6a0FLTDZ5QTA5WDFwT05Eb0pCQ2YzTUtHWUFzSkxOTXJWTGpzNUVicFNMWGw3LW1CNGpzdmJXdUZhRjF3c2NqeXhGZWVoeFY0a0ViUktpZm9LLXZSSDBiTjRON2RWS0pzWHJZbWNjaGpZcWFMVlJUNzFjeDBVWTl6?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Is ETH on the Verge of a Deeper Correction Toward $2.7K? - CryptoPotato",
        "content": "Ethereum’s price has been dropping recently, following a second rejection from the $4,000 resistance level, and it has yet to recover.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily chart, the price has been making lower highs and lows since failing to break the $4,000 level to the upside a while ago. The market has also broken below the 200-day moving average, around the $3,100 mark.\n\nThe price is currently retesting the 200-day moving average but is seemingly getting rejected to the downside. As things currently stand, the cryptocurrency seems likely to drop toward the $2,700 support level in the short term.\n\nThe 4-Hour Chart\n\nThe 4-hour chart demonstrates a zoomed-in view of the recent price action. As evident, the downtrend has recently been aggravated to the downside, with the market briefly breaking below the $3,000 support level.\n\nYet, following an oversold signal by the RSI, the price has recovered above the mentioned support zone. However, the price seemingly lacks the momentum to continue higher and might be on the verge of a deeper decline toward the $2,700 area.\n\nOn-Chain Analysis\n\nBy TradingRage\n\nEthereum Exchange Reserve\n\nDuring the Ethereum downtrend in the last few weeks, many analysts have been looking for signs of capitulation that point to a potential bottom. Some signals are becoming evident.\n\nThis chart displays the Ethereum Exchange Reserve metric, which measures the amount of ETH held in exchange wallets. An increase shows potential selling pressure, while a decline indicates a decrease in supply.\n\nFollowing the recent brief decline below the $3,000 level, the exchange reserve metric has experienced an increase above its 30-day moving average. This might indicate the beginning of the capitulation phase, as many investors’ stop losses were below the $3,000 level."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQVmdxdDV2U2pMNnBzY0Rod0VvMm9td1puVGFEUGM4ZTNUMnRJazNfS0xnZHdZLS13N2ZQenF4V2l5VklYVzVJTEFENWxWOVJaeXhFOTJSYjJfd3BxeV9aVENYNU1nQ3J3ajN6VmNPSlFxQUUwM2M4OFBCZnZpa2dNNkFXRllSY0JZT2hPbmZPOF9qcUlEYUdDbXVIXzY4VVJVNWNxQkduek1RMEpxUVJnSWJiSVgxTTNEblJpUFRjLXZVRXZKeHpSZGpUWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Recover As Germany Runs Out Of BTC To Sell - Benzinga",
        "content": "Cryptocurrency markets are trading up as PPI data has sparked speculation of an interest cut in September.\n\nCryptocurrency Price Gains +/- Bitcoin BTC/USD $57,825.58 +0.6% Ethereum ETH/USD $3,129.43 +0.5% Solana SOL/USD $138.75 +1.2% Dogecoin DOGE/USD $0.1076 +0.4% Shiba Inu SHIB/USD $0.00001644 +0.3%\n\nNotable Statistics:\n\nIntoTheBlock notes that 83% of Bitcoin holders are in profit at current levels despite the volatility. While concentration by large holders stands at 12%, 70% of holders have accumulated the coin for more than a year. Exchange netflows widened by 163.9%.\n\nDegen News revealed the German government is out of Bitcoin.\n\nCoinglass highlights 40,300 traders liquidated in the past 24 hours for $126.7 million.\n\nNotable Developments:\n\nTop Gainers:\n\nCryptocurrency Price Gains +/– ORDI ORDI/USD $33.56 +8.5% Maker MKR/USD $2,498.75 +6.5% Ronin RON/USD $2.05 +4.9%\n\nTrader Notes: Andrew Crypto sees a \"clean break above $59,200 next to continue this bullish momentum.\"\n\n\n\nHe concluded, \"A reclaim of the range is needed to confirm a local bottom.\"\n\n\n\nAnother crypto trader noted that \"Just like that market sentiment shifts to more positive but still doubt over hangs price performance. Will need to see multi-day follow through from spot buyers.\"\n\n\n\nCrypto trader Kevin also highlighted that Bitcoin has recovered nicely as Germany runs out of all its Bitcoin. He also reaffirmed his prior prediction that if Bitcoin \"can break above $60,000 and hold it then we can negate this pattern, which would be bullish.\"\n\n#BTC almost broke down last night but has recovered nicely since.. Germany all out of BTC. Send it higher https://t.co/Pbyn34rcUU pic.twitter.com/bBzYVmkw2x — Kevin (@Kev_Capital_TA) July 12, 2024\n\nCryptoquant Founder & CEO Ki Young Ju revealed that whales use a lot of leverage at cyclical bottom. While he suggests trading like a whale, he added \"whales use a lot of leverage only at the cyclical bottom.\"\n\nRead Next:\n\nImage: Shutterstock"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQWWpDZHVlWWpqS0YxU0hoenN4MjVQcllTcWVvVGlOM3BKMkkycm1mc3pwQ1NXdUVXc3RPaTlHNVhUdDBLZXpYYXE5c3ZHNTgxR0VoT2lUb3FLLUdhYXlndFBPT1hzX3dwVkZ1Vjh5czVPcU5vSGo3bzN6UFQySDBNcFVaVmctSUEzLVhRMXQyNFBLU3Q0aG5YVUk3dk41VlU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Reclaims $3,200 on Dovish CPI Report: What Next? - The Crypto Basic",
        "content": "Ethereum price gained 14% within the 7-day timeframe, as reclaimed the $3,200 territory on July 11, on-chain data trends suggest ETH retail traders could pile on more demand in the days ahead.\n\nEthereum Price Bounces 5% on Positive CPI Report\n\nEthereum price bounced 5% within the daily timeframe on June 11 as the crypto markets reacted positively to the latest US economy inflation report. On Wednesday, the US Bureau of Labour Statistics published the Consumer Price Index (CPI) report which showed that inflation slowed for the first time in 4 years, adding more luster to calls for interest rate cut.\n\nThe dovish US CPI report of June 2024 sparked a way of buying pressure across the crypto markets, but Ethereum’s ETF impending launch further fuelled the ETH price surge on Thursday.\n\n- Advertisement -\n\nLooking at the chart above, Ethereum price surged by more than 4% on Thursday, to reach a weekly timeframe top of $3,213 on Thursday, July 11, marking a 14.37% recovery from the 100-day low record during the market crash last Friday.\n\nWhile the positive CPI report, and louder calls for rate cuts have boosted investor confidence across all risk assets markets, ETH price is also receiving bullish tailwinds from the Ethereum ETF anticipated launch slated for July 15 according to Bloomberg analysts.\n\nAfter Thursday’s gains, the ETH price retraced toward the $3,100 level at the time of writing on Friday, July 12. However, according to on-chain data, more retail traders are looking to pile on additional demand for Ethereum as the ETF launch date draws closer.\n\nThe exchange order book data from IntoTheBlock provides comprehensive information on the total number of active buy and sell limit orders for a specific asset. This data is aggregated from 16 well-established cryptocurrency exchanges, such as Binance and Coinbase.\n\nA higher volume of buy orders often precedes a price bounce, as it means that market demand has exceeded the current short-term supply of the asset and vice versa.\n\n- Advertisement -\n\nThe chart above depicts that Ethereum buyers have listed active bids to purchase 300,000 ETH at the average price of $3,099. Meanwhile traders have only placed 232,000 ETH up for sale close to the current prices.\n\nEssentially, this means there is currently an excess market demand for over 68,000 ETH. Valued at the current prices, the bears must now place another $321 million worth of sell-pressure to halt Ethereum’s current price rebound phase.\n\nBut with the spot Ethereum ETFs due to launch in less than a week, existing ETH investors could opt to sit-and-watch approach and consolidate on their holdings. Other strategic short-term traders may also be waiting to sell into the expected market euphoria around the launch date.\n\nAs this cooling sell-side pressure persists on the dovish CPI report and the anticipated ETF launch, ETH price could be on the verge of a parabolic breakout towards $3,500.\n\nEthereum Price Forecast: ETH Bulls Can Target $3,500 Rebound\n\nEthereum (ETH) has shown signs of recovery, currently trading at $3,092.12 as of July 12. The price has rebounded by 14.37% over the past six days, suggesting a potential continuation of the bullish trend. The Parabolic SAR indicator at $3,256.23 signals a possible upward momentum, with ETH aiming to break key resistance levels.\n\nThe immediate resistance is at the Parabolic SAR level of $3,256.23. A break above this could open the door for a retest of the $3,500 level, a significant psychological and technical barrier. The Relative Strength Index (RSI) is at 39.20, indicating that ETH is still in the oversold territory but showing signs of recovery. If the RSI continues to rise, it could further confirm the bullish outlook.\n\nSupport levels are crucial to monitor in the event of a pullback. The first support level to watch is around $3,000, which has proven to be a strong psychological support. Below this, the next significant support is at $2,800. A drop below $3,000 could weaken the bullish momentum and lead to a retest of the lower support levels.\n\nIn summary, Ethereum’s price action and technical indicators suggest a bullish outlook with a target of $3,500. Traders should watch the key resistance at $3,256.23 and the support at $3,000. A successful break above the resistance could see ETH retesting $3,500 while maintaining support at $3,000, which is crucial for sustaining the bullish momentum."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQUHlCVnVnWDE5ZEgwSmxJMEVjZFRxaWVhUzBFOFN5STl1eWc0Q0UwUGJrSHFXZWFPVWVPLVV4T29UcGl3eTdadGEzRVpmMHM2bW54MjJkemJrMUIyS0R5SFNlVVR0Tk42NFVLRFVXazRNWnFvYUllM3YtRV9YZGxrcDFlMTjSAYoBQVVfeXFMTnRmZ0JkWlNNMzVHcmpvNHFQQjJ2TmVVaWdLWXNoZ1FhT0Njc1B0UXZkaHZhSXVqZWl6UC1ZTkhIMXJWeThGTjBSNDVMQ0JvNW9jN05BVDlhNGJzNGRNc0NwQWRyLW0wTGYzUWp0Y1h3c1ZKdlB2bjNMejRkYkN2V2M3YjdMTFJyNWdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Key Reasons To Invest In Ethereum And Solana Now - CoinGape",
        "content": "Ethereum and Solana, prominent Layer-1 blockchains and decentralized application (dApp) hubs, currently face significant market dips. Ethereum leverages blockchain technology in its open-source platform, ensuring secure decentralized applications. Solana, also open-source, exploits the blockchain’s permissionless nature to innovate in decentralized finance (DeFi).\n\nSolana’s price recently dipped, disrupting a short-term upward trend. Typically, such corrections persisted for over a month before recovery. Meanwhile, Ethereum price exhibits a bearish pattern, albeit with modest rebounds.\n\nadvertisement\n\nThese platforms are known for their distinctive strengths; Ethereum prioritizes robust security, whereas Solana offers high throughput and minimal transaction costs. Despite the current volatility, this combination of features makes them pivotal players in the cryptocurrency domain.\n\nAnticipated Growth with New ETFs\n\nEther and SOL are poised for significant growth with the anticipated arrival of new investment products. Ethereum is at the forefront of excitement with its upcoming spot ETFs.\n\nThe financial community buzzes as the possibility of introducing Ethereum ETFs as early as this week remains pending approval from the U.S.\n\nSecurities and Exchange Commission. Investment experts, like Bitwise Asset Management’s Matthew Hougan, are preparing to capitalize on this development. Ethereum’s price is expected to surge, potentially exceeding its previous peak of $4,867.60 in November 2021.\n\nOn the other hand, Solana is not far behind, with a major ETF launch planned for March 2025. As the market begins to stabilize from recent fluctuations, Solana has shown impressive recovery.\n\nThe Cboe Exchange recently confirmed that asset managers VanEck and 21Shares would list their Solana-based products, pending regulatory green lights. The exchange has formally requested approval from the SEC to list these innovative ETFs.\n\nEthereum and Solana Drive Innovation in Blockchain Technology\n\nEthereum and Solana are pivotal in the blockchain landscape, fostering dynamic ecosystems for decentralized applications. Ethereum, a pioneer in smart contracts, maintains a vast array of dApps encompassing DeFi and NFTs, making it a leader in the field.\n\nOn the other hand, Solana excels in scenarios demanding high transaction speeds and minimal delays, such as gaming and high-frequency trading, thanks to its superior throughput capabilities.\n\nThese platforms rank among the top ten in market capitalization, enjoy robust developer support, and enjoy surging trading volumes. Their ongoing rivalry promises further advancements, making them attractive investment prospects in the blockchain domain.\n\nETH and SOL: Surge In DeFi TVL Dynamics\n\nEthereum holds a significant advantage as the leading platform in TVL, representing the total capital held within its smart contracts. High TVL indicates strong user activity and commitment to the platform, suggesting many users are locking up their assets in Ethereum-based DeFi projects. According to data from Defillama, ETH’s total value locked is currently at $54.273 billion.\n\nSolana has a smaller TVL than Ethereum. It’s known for its high-speed and low-cost transactions, which appeal to a different segment of DeFi users and developers. Solana’s focus on scalability and efficiency has helped it quickly become a competitive DeFi ecosystem, attracting innovations and developers, which could boost its TVL over time. Currently, the total value locked is $4.47 billion.\n\nScalability and Efficiency\n\nHistorically, Ethereum has faced challenges with scalability and high gas fees, especially during peak usage. However, ongoing upgrades, notably the shift to Ethereum 2.0, aim to address these issues by moving from proof-of-work (PoW) to proof-of-stake (PoS), which is expected to improve transaction speeds and reduce costs significantly.\n\nSolana is designed for high throughput and can process thousands of transactions per second (TPS), making it one of the fastest blockchains. This technical advantage makes it an attractive platform for high-frequency trading environments and applications requiring quick transaction settlements.\n\nFrequently Asked Questions (FAQs) 1. Is Solana Faster Than Ethereum? Yes, Solana is faster than Ethereum. Solana can handle over 65,000 transactions per second, while Ethereum manages about 15 to 45. This speed comes from Solana’s special design for handling many transactions. 2. Is Solana Cheaper Than Ethereum? Yes, using Solana costs less than Ethereum. Solana’s transaction fees are very low, only a fraction of a penny. Ethereum’s fees vary and can be high when the network is busy. 3. Is Solana More Secure Than Ethereum? Ethereum is considered more secure than Solana. Its network is more tested and has more validators, which makes it more decentralized. Solana has had more issues with network outages.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]