[
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOeXdlaGlBZWcyeVJhZ0o3R05GazhGNS1TS0syekdVdV83Snlyc2RiUzVDZXg5eXEtWm1GakFoSXVySnBGZkJKZlhxZEJ2MWQ4N21MUVZzTGpyY015eHpsVWdJeF9iZGhtdV9KdFJWUFpQQmtQejR2OUk5T1RVU1R2X2lZRDNvRFA1U1piejV6VW9jekhPaUJmcHhIei1lNE5MdnpuQWZSc011cE5XT0w0YtIBtgFBVV95cUxPOEZfY1U3RGRjRlhLMmVUaF9oRmdKRE1sTDFnNTN1dWNtZnBUcm9TeWI4VElqS2ZyRTVSQmxtYXZvaGNDMEZZbTR3OXc4S01PLUI2NFItM0dka2d5aXRyb0JKVUphZ3NJeTJyN3ROY1p2Rk93eFVPc3NqcldlbVhnYW5CUnN6a3ZEclRMT2tZZmxtNEk3ODZCYk9lcmpJN3FGR25kQmh0MlpOMC1ldnBJUkwtS00yUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Ether Tops Bitcoin as the Largest Crypto Asset for Institutions: Bybit Research - CoinDesk",
        "content": "Despite Solana's (SOL) strong performance in the third quarter of last year, where it rallied and erased many of the losses of the crypto winter , Bybit's data suggests that both institutions and retail users have not been interested in HODLing the token that was once at the center of Sam Bankman-Fried's portfolio."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9ha2NYZjZ5TE1IMlY0YWc4NHd6QjFXRFh1eWphaUlsSXJiaXh6RlZ3SGxuZ2F6NjNkZTJmUG9DRVAxUDdLS19ReDAyQjYwNWZVZkdTeG5CbVhyWGVvNnp2NFdOY0YwTnBEeTVranVfYmxDM3VlZHBPT0hiWXbSAYQBQVVfeXFMUHNCVzFwSFRBVnZPUk9pQS1GaWRNeE00Rm1oWFl4TXVQX1RMaTNSTkFnVThwX3VQVlI4N1RUa2FiU3MzQWVGTHM4UjRpUno1SHByZ3ZzdUQyWVZTZUNZZkNneE9RQVhjWlRWTC1NdVk0MEZCaFRWa3hSVmtPRVlOM2M1SExq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price at 22-Month High as Open Interest Soars and Dencun Nears - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum (ETH) continues to be the top coin. The second biggest digital asset by market cap is trading at 22-month highs on Monday.\n\nETH is now priced at $$3,151, CoinGecko shows, having broke past the $3,000 mark for the first time since April 2022 last week. It has gained 3.5% since the same time yesterday and risen by more than 8% over the past week.\n\nKaiko analyst Dessislava Aubert told Decrypt that \"open interest just hit a multi-year high of $7.7 billion and funding rates are at their highest levels since early January,\" meaning new capital is entering the market due to rising speculative interest as well as hedging.\n\nAD\n\nAD\n\nETH's network is set to undergo an important upgrade next month. Named \"Dencun,\" it aims to solve scalability problems with the blockchain.\n\nThe upgrade will bring \"proto-danksharding\" to the network, promising to make it faster and cheaper to use via layer 2 solutions. Layer 2s, or L2s, batch together unverified transactions made on Ethereum, process them on an external network, and send confirmation back to mainnet.\n\nA number of high-profile, traditional Wall Street firms are also hoping to get a spot ETH exchange-traded product approved.\n\nSuch a fund, if given the green light by the Securities and Exchange Commission (SEC), would bring the asset to traditional investors. Big names like BlackRock, VanEck, and Grayscale are all waiting on the regulator. Just last week publicly traded crypto exchange Coinbase submitted a comment letter to back Grayscale's bid for an Ethereum ETF.\n\nThe SEC in January approved 10 spot Bitcoin ETFs, which have so far been popular and received huge inflows of capital.\n\nAD\n\nAD\n\nBritish multinational bank Standard Chartered said last month that a spot ETH ETF will get approved by May and send the asset's price above $4,000 per coin.\n\nDespite its recent surge, ETH is still well below its November 2021 all-time high of $4,878.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOamtZVno5emM4cFZ6RkpBTXp4NG9UNEgxcFVDRWxQTVdsaUR2clRzUmhTUU1rZFFObFItWUFXYkpldUV6ZTV1WWpINEV3YVRCeFFXVWUzWWdkM19nQ2NDaUtWU2lnTU10V3Zha0R2WEtYemRoNkhhRVdnVGN4OFR3cEg5TzdvaEN3SFVxeEc3Zkd4eDU0anRHMlh0RGpkQnpBZ0x5ajJJTUg5YlZPZW0wakIySWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Starknet (STRK) Surges to Fourth Largest Ethereum Layer 2, TVL Exceeds $1.3 Billion - Crypto News Flash",
        "content": "Starknet’s TVL surpasses $1 billion, becoming the 4th largest Ethereum L2 solution.\n\nSTRK token faces volatility but shows promise with a market cap of $1.39 billion.\n\nIn an electrifying development this week, Starknet, an Ethereum-based Layer-2 (L2) scaling solution, has taken the crypto world by storm with its historic launch. This new entrant in the blockchain domain has quickly ascended to become the 4th L2 solution on Ethereum, with its Total Value Locked (TVL) surpassing the remarkable $1 billion milestone, marking a significant achievement in its nascent journey.\n\nThe Surge of Starknet\n\nFollowing the strategic launch of its STRK airdrop, Starknet catapulted into the limelight of the crypto ecosystem. The protocol generously rewarded its early adopters, distributing over 700 million tokens from the allocated 1.8 billion for the airdrop, a move that significantly contributed to its rapid ascendancy.\n\nDespite a few hitches, such as inconsistencies where some users received millions of STRK tokens leading to an immediate sell-off and a subsequent price drop post-launch, the airdrop was largely deemed a success. This event mirrors the tumultuous debuts typical of Ethereum L2 solutions but hasn’t deterred Starknet’s momentum.\n\nStarknet’s growth trajectory has been nothing short of phenomenal. With data from L2Beat showcasing a staggering TVL of $1.31 billion, up by over 620% since its inception, Starknet now only trails behind giants such as Arbitrum One, OP Mainnet, and Manta Pacific in the L2 space.\n\nThe adoption by leading trading platforms like Binance Exchange, which listed STRK for trading, further bolstered Starknet’s position in the market. This support from top exchanges underscores the confidence in Starknet’s potential and technology. Dive deeper into this development in the YouTube video below.\n\nUnique Approach to Scalability\n\nStarknet sets itself apart with its innovative use of zk Rollup technology, addressing the Ethereum scalability challenge in a novel way. This distinctive approach has attracted significant new capital inflows, with major smart contracts like Orbiter Finance and Rango Exchange now leveraging the platform, drawing a diverse user base. To explore how Ethereum is revolutionizing the digital industry, check out the following YouTube video.\n\nSTRK Token Dynamics\n\nThe journey of the STRK token has been marked by volatility, a common trait in the digital currency landscape. Currently trading at $1.92, the token has seen a slight decline of 1.53% in the last 24 hours. Despite the selling pressure from early recipients and a more than 30% decrease in trading volume, the launch of Starknet and its native token STRK is perceived as relatively successful, with a current market capitalization of $1.39 billion.\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNbHNIMVNVVFBTdXQwNjV4S2FhOThCSVM4dHV2VFdvTzJmcFVhTWIxZ0MwOW04MnZWRWd0VjltVE1td05JOEN4WnEzOTFjZ1FxejRQTGFiWFM3bFE4QS1EX2U0RkRJYmppQnduS1ZZMEJBTEg0cmxMam56ZnB3eHNMb2JjcmdvTWU5c0x2aEJpekl4T3k3dk44S3ZXT1p4dXVqdVRIaXV3d3RpZ1piMnNFMlRRNmhYT2wzVkHSAb8BQVVfeXFMTzdLYU1TcjJ1REhxbFdBeEUzVzJvM1dKNEgwbkRJWmh2bnB5N2N0RXVRaVVrTVRfMldwTGxlbUI5cVljS1ZoRVBUd0wwZ2ZVQWI4d2EyZ2RDcUl1SHJsY1Z1VWtwMlduZ05CeldfSmNrUzFvMmRuTWFEcW1PS2pNanI1MklmTEkxcklvY28zZkFOZnFOTmdLVmlhQ1QwQUljNUNWOXZBRlJTUmFOTzNVMnpVZXI2SWw4ejVGT2JDZ1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Ethereum price rally beyond $3,000 depends on two catalysts - FXStreet",
        "content": "Ethereum whales are accumulating large volumes of ETH after supply on exchanges hit a six-month peak.\n\nETH price sustained its uptrend even as Ether holders consistently realized gains since February 15.\n\n$20.48 million in short positions were liquidated in the past 24 hours as ETH price climbed to a new 2024 high.\n\nEthereum’s large wallet investors, including a wallet address that allegedly belongs to Justin Sun of TRON, have been spotted accumulating the altcoin, according to on-chain data. The accumulation by whales could offset the altcoin’s Supply on Exchanges, thereby reducing the selling pressure on ETH.\n\nTypically, Ethereum price rallies post a Bitcoin halving event, the upcoming halving in April 2024 could catalyze gains in ETH if the trend repeats itself.\n\nAlso read: Ethereum price teases with a breakout, eyes $3,200 milestone as ETH bulls show resolve\n\nEthereum price could sustain uptrend with whales’ massive ETH accumulation\n\nData from on-chain intelligence tracker Lookonchain revealed that wallet that allegedly belongs to TRON co-founder Justin Sun scooped up 12,702 ETH worth $36.9 million on February 21. Between February 11 and 21, the address bought 104,055 Ether worth $296 million at an average price of $2,846 from Binance and decentralized exchanges.\n\nWallet that allegedly belongs to Justin Sun, Ethereum accumulation. Source: Etherscan\n\nThe tracker identified addresses that are accumulating Ether in the past week. A whale wallet withdrew 14,632 ETH tokens from Binance, worth $45.5 million and staked it in the past week. Two other large wallet addresses withdrew 6,000 Ether from Kraken, worth $18.7 million, in the past two days.\n\nWhile Santiment shows that ETH Supply on Exchanges has hit its highest level in six months, the recent activities of whale wallets could reduce the selling pressure on the asset.\n\nEthereum Supply on Exchanges. Source: Santiment\n\nEthereum wallet addresses holding between 100,000 and 1,000,000 ETH tokens have accumulated more Ether since the beginning of February. Wallets holding between 10,000 and 100,000 ETH and 1,000,000 and 10,000,000 ETH have shed their Ether, reducing their Ethereum holdings in the same timeframe.\n\nKey catalysts\n\nThe accumulation of ETH wallets holding between 100,000 and 1 million Ether coincides with Ethereum price rise, as observed in the chart below, in the past six months. This suggests it could be a key catalyst to the token’s gains. If this trend continues, Ethereum price could continue rallying past the $3,000 mark.\n\nEthereum holdings of different whale cohorts. Source: Santiment\n\nAnother key catalyst is the upcoming Bitcoin halving. As seen in previous halving events, Ethereum price rallies in response to the mining reward halving of the largest asset. This is a trend that has repeated in the previous three halvings. If it continues, Ethereum price could rally towards its $4,000 target, ahead of the SEC’s decision on Spot Ethereum ETF approval in May 2024.\n\nIt's important to note that in the past 24 hours, $20.48 million in short positions were liquidated as Ethereum price surged to a new peak in 2024, according to CoinGlass data. ETH price climbed to a high of $3,135.65 on Monday."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxON2NuanVEVDNFMjdzUTkzRVlXeWJEYmdGQTZEazBLSnl5VFlaX2hBTXlzWnN0WTczSTlMajlFb2s5YTAwUERGMHFnSVNqWFJaZk9ORUVWTFpBZTlZcm9LcEhxRXFlSHZTN3dxbWZ4ck9ZOU5MVzMtMlFKby12all4Y3pkc1RVZlJV0gGOAUFVX3lxTFBGbGtLVEdnQjlNbTB3blVXTWdpSkpPdjhleEdJMmN6TWZQdWwxWWhvdE1iNDdNeHFQcnRhTDNXd19ENXFpSmxlMURmdnNYOFl5ZDFuaGlLaGhSTHNnWWNnWFpscWhpWGJ5NXJ6UHBEZm9CblVBak5NbkJ0UTZxczRQYVE4VlkteDdrTWY5NWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Is Ethereum Price Heading to $3500? This Chart Pattern Offers Insight - CoinGape",
        "content": "Ethereum Price: ETH, the second-largest cryptocurrency, experienced significant volatility this week, reflecting the consolidation of Bitcoin prices below $38,000. This sideways movement led to a decrease in bullish momentum across the crypto market, hindering the progress of most major cryptocurrencies.\n\nDespite this, with the Bitcoin price stabilizing above $30,600, ETH witnessed a resurgence in buying interest. This surge pushed ETH’s price beyond the psychological barrier of $3,000. Is this breakout a signal to enter the market?\n\nadvertisement\n\nAlso Read: Grayscale Sees Ethereum’s (ETH) Parabolic Run Post Dencun Upgrade\n\nIs ETH Price Ready to Gain $3500?\n\nThe Ethereum (ETH) coin initiated its current recovery trendline in late January when the price showcased sustainability above $2166. This upswing recorded 41% over the past five weeks and reached the current trading price of $3062.\n\nThe recovery was spared in response to the Bitcoin price rally, following the massive inflow of funds into the spot BTC ETG. The bull run gained further momentum as the Ethereum network steadily progressed to its much-awaited Dencun upgrade scheduled for implementation at slot 8626176 around mid-March.\n\nThis week, the Ethereum price traded majorly sideways resonating between the two horizontal levels of $3030 and $2875. Following an aggressive rally, the recent consolidation must have asserted the ETH price to recuperate strength.\n\nWith an intraday gain of 3%, the altcoin gave a decisive breakout from the range’s resistance and reclaimed the psychological level of $3000. If the coin price shows sustainability above the reclaimed level, the buyers may aim for a potential target of $3180, followed by $3280.\n\nAlso Read: ETH/BTC Chart Analysis: Is Ethereum’s Rally Against Bitcoin Ushering In the Altcoin Season?\n\nChannel Pattern Puts Ethereum Price at Risk of New Correction\n\nWhile the current market outlook for Ethereum seems bullish, a look at the daily chart shows the ongoing rally is strictly following the structure of an expanding channel pattern. With the coin price close to the pattern upper trendline at $3180, the ETH price may face intense supply to trigger a new correction.\n\nTechnical Indicator\n\nExponential Moving Average (EMA): A bullish crossover state between the daily EMAs (20, 50, 100, and 200) indicates a strong uptrend in action.\n\nAverage Directional Index: The ADX slope at a high of 41% indicates the buyers may soon hit exhaustion and need a minor pull to recuperate strength.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]