[
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPQ3FjN1JnVlNrZ0tKcnYybGZRMHBmV1dRM0JkZjBMcmlSM1Y3STg4a2lEUmVPZHgyWXNaMDJRLTB6M1BnaWpPSjJZbXR0WW45UlhFa3h1aFYzOWdjNzQ3czh2UERva3d5LUFjRXJEUG1peWR6Q3l1eUV5VThLUC01djBzdmd6TDJyMlI1d0p0R3MyaDU0U1VJ0gGcAUFVX3lxTE94U0ZTSDRXQmxMVFJCS0RidFkxdmdWODhLSzJ1VEFpT2FVTk1LUTI1bTNnZ1hwUm1rWG5YZ2h4LTNra2o4Y29QT2RWejZXeW02REhSM3BVeTljVXk4dGMyeTduNzAycFBnRkl3UFpsb1N0c1dkZFh2RkxNdWZqVXpOb0E4YVEtV0R2THZmZ3hFTEJoS3VGYWNHcnUtRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Restaking Platform EigenLayer Launches EigenDA to Mainnet - CryptoPotato",
        "content": "On April 9, the EigenLayer team announced that the platform’s EigenDA, the first Available Validator Service, had launched on the Ethereum mainnet.\n\nThe team added that over 4.1 million ETH had been restaked on EigenLayer, and over the past few weeks, 70% of all new Ethereum validators restaked to the platform.\n\nMoreover, restakers can now delegate their entire stake to an operator that has opted in to run available validator services like EigenDA.\n\nAnnouncing: EigenLayer ♾ EigenDA Mainnet Launch pic.twitter.com/bTp5BfnsKE — EigenLayer (@eigenlayer) April 9, 2024\n\nRestaking Narrative Grows\n\nRestaking allows users to stake the same ETH on both Ethereum and other protocols. Platforms such as EigenLayer leverage Ethereum’s validators and staked tokens, enabling smaller and newer blockchains to benefit from its security and trust system.\n\nEigenLayer also faces a tradeoff between neutrality, allowing free market behavior, and decentralization, thus preventing dominance by a single staking provider.\n\nMoreover, EigenDA provides hyper scalability, cost flexibility, and ease of integration for rollups. It aims to be the endgame solution for data availability on Ethereum.\n\nRollups can onboard to EigenDA mainnet after the operator set and delegations stabilize, it said.\n\n“Over the next few weeks, we expect high operator turnover in the top 200 active set as new operators, delegations, and AVSs come online.”\n\nIn-protocol payments from AVSs to operators and slashing mechanisms are not included yet, but will be added later in 2023, the announcement noted.\n\nAn AVS is essentially a middleware or service that runs on top of the EigenLayer protocol to provide specific functionality. AVSs act as a layer between Ethereum’s execution layer and the various rollups, blockchains, and networks built on top of the L1 network.\n\nEigenLayer total value locked is currently $13.3 billion, having skyrocketed 1,100% since the beginning of this year, according to DeFiLlama.\n\nEthereum Staking Outlook\n\nThe Ethereum staking ecosystem is extremely healthy, with around 27% of the total circulating supply currently staked.\n\nThis works out at 32.2 million ETH, according to Dune Analytics, worth around $112 billion at current spot prices. Ethereum also has just over a million validators, making it one of the most secure blockchains in the crypto space.\n\nLido remains the dominant liquid staking provider, with 29% of the total amount staked, or $33.2 billion worth of ETH."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQYkowYnNyQ3JOcFZzcmJUZTIwTTFpSVZyX0J1bHBESWEwSkhXWmF6TnA4d01ld1VsNXJDSzV1UmdFb0FpRVUyTkZsTGo3aDJtRE16UlhiaHBaZWk4VkRXN3F3Z3BfOElFNlF0MlFyaXRSc1A5Umx2UGV5cExiRUNSOWNxX2ZvZHN4OUtUX1NkMnplT1k10gGaAUFVX3lxTE5uTFdpUFlHbDZDRFpTZjJxQ1lqRVJ2b2lUaWFmd3gzel8zWlNwVmlOd08wbFptVTJ1bWZQZml6bTVqR3loZUxaYzY4cDd3RTF0dVVMM0E1dTM0NmdZM0NxYjc3OU5uejVOanhWa1dxZTIwY3ZWRXZtRjJjWENOSmtXdU5yU1hTMmFoLS0xWmFUWVJNWUkwZUZ2S0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, Solana prices crashed to trigger $950M liquidations - AMBCrypto News",
        "content": "Bitcoin, Ethereum, and Solana fell significant on the price charts\n\nAlmost $1 billion worth of positions were liquidated in the last 24 hours\n\nFollowing a surge in its price over the past week, Bitcoin [BTC] recorded a significant correction over the last 24 hours. Over the said period, the cryptocurrency’s price fell by 4.95%, with BTC trading at $67,829.94 at the time of writing. Bitcoin fell on the back of traditional markets tanking owing to the geopolitical uncertainty associated with Iran possibly attacking Israel. Accordingly, both the S&P500 and Nasdaq fell, with the value of traditional safe havens like gold appreciating.\n\nThe decline in Bitcoin’s price had a cascading effect, leading to other cryptocurrencies depreciating on the charts too as well.\n\nAnother one bites the dust\n\nDue to the high correlation with Bitcoin, Ethereum [ETH] and Solana [SOL]‘s prices also fell dramatically and suffered a worse fate. SOL fell by 11.93% over the last 24 hours and ETH declined by 8.33% over the same period. Thanks to the same, both SOL and ETH broke past their previously established higher lows, disrupting their ongoing bullish trend on the charts.\n\nIn fact, the price of ETH fell all the way to $3099 during this drawdown. However, after testing this level, it managed to climb back up to $3256.96, at the time of writing.\n\nPreviously, Ethereum had tested this level on 20 March. If Ethereum follows a similar trajectory going forward, it may attain the $3384-level soon.\n\nSolana traced a similar trajectory. Even though the correction was fairly recent, the price movement of Solana since 1 April hinted at a potential decline in price. Since the beginning of the month, SOL had exhibited multiple lower lows and lower highs, indicative of a bearish trend.\n\nIn order to rally, a massive resurgence in bullish momentum would be required for both ETH and SOL.\n\nAre whales to blame?\n\nDespite these price corrections, however, interest in BTC and ETH remains high. In fact, AMBCrypto’s analysis of Santiment’s data revealed that the number of addresses holding BTC and ETH grew materially over the last few weeks.\n\nThis indicated that the recent decline in prices could have been caused by the behavior of a few whales who were indulging in profit-taking.\n\nHow are traders holding up?\n\nIn the last 24 hours, $947 million worth of positions were liquidated. Out of this, $824.94 million were long positions. Traders that were bullish on BTC, ETH and SOL lost the most amount of money. At this point in time, however, it’s too soon to say which direction BTC will head in, especially with the halving just over the horizon."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPVnJORGcyY2RKRmNoR1dCT3pQZEl4Q0xsWTh2QzJ4N3UwTmc2eDYxQV91dkxzOGdjaGJELTlGVFNLcjJ2SG5GVEtwWXhhVG9DdHVyMDhFWEZjUUJjbmZHMHJhVEdmcG9menJvX0NJRGpKd09zUlB2cUpVelREQldjdUF5V3HSAYoBQVVfeXFMTVRwMUFqdFJpZ1FUMHlubzdIRndUQkZHUXRpby1HSEpGemtNM1NSdFp5c0Jqd0JLV1dfcFYxa3prMUUyMkZkZUpFb19zbjhjSlVEYmNmamZYSUJfQ2F0U3Z1M09vb3AyRTZUYmgzM3BFcjJuQUk1bThGaDVwX0c1M0JmUFJVZ2J1Y1lR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Shares Take on Verkle Trees Coming to Ethereum - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe conversations around Ethereum (ETH) and its data storage for optimal functionality have made it to crypto X with Polygon co-founder Mihailo Bjelic and Vitalik Buterin debating the possibilities. The conversation started with Bjelic posting a question in which he sought to know if developers are sure it is right to switch Ethereum to Verkle trees, given that its zk-fication is quite likely.\n\nAdvertisement\n\nWading into the conversation, Vitalik Buterin said, \"ZK-ifying keccak merkle patricia trees with worst case 300 MB witness sizes is a non-starter.\" Notably, the Merkle Patricia trees form the current or primary data structure that is being used within the Ethereum blockchain. This data storage structure has its limits, and the plan soon is to replace it with Verkle trees with shorter proofs and increased bandwidth.\n\nTo Bjelic, the current structure, according to the capacity of Polygon zkEVM, can handle the 300 MB benchmark noted by Buterin. The Polygon founder noted that the protocol could even do this easily with a total block time of 12 seconds. He, however, acknowledged that for this to work, it would need approximately 10 server-class CPUs.\n\nButerin's lasting solution\n\nPer the presentation made by Vitalik Buterin, Merkle trees were not designed to be compatible with ZK technology. However, he noted that Verkle trees with a vector element are designed to help achieve this goal ultimately.\n\nZK-ifying keccak merkle patricia trees with worst case 300 MB witness sizes is a non-starter.\n\n\n\nThe verkle tree spec is designed to be zk friendly (eg. choice of curve, using pedersen as the hash)\n\n\n\nSo switching to verkle helps with ZKing the L1. — vitalik.eth (@VitalikButerin) April 12, 2024\n\nPer the design of the entire Ethereum architecture, ZK protocols are mostly embodied as Layer-2 scaling solutions. While these L2s have better throughput, scalability, gas fees and data storage, Ethereum still battles to keep up with scaling up amid the demand.\n\nTo convert Ethereum to a ZK-tech compatible network, Vitalik Buterin highlighted how this can only be achievable using Verkle trees. If this is achieved, ultimately, Ethereum may also benefit from the impacts of the Dencun upgrade in the long term."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiWEFVX3lxTFAyS2N1R1Z4TnlvSzlIdlhpTVNkaEwzRlA1SnRMTG9Ra1BiYTVjRGJ4S2twZWcwQURudmZ2RE1iY2lpV3FLSmdtZjlHT3dpWHRpU1VSZ2s1Yk4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Crypto hack 2024: Ethereum is the most hacked chain to dateCrypto hack 2024: - The Cryptonomist",
        "content": "For the “crypto hack 2024” column, it seems that Ethereum is the most violated chain so far, with 33 hacking incidents, scams, and more. Currently, the estimated total losses amount to 437 million dollars.\n\nCrypto hack 2024: the most targeted blockchain at the moment is Ethereum with 33 incidents\n\nAccording to a research conducted by experts from Smart Betting Guide on crypto hack 2024, it seems that Ethereum is the blockchain most targeted by scams and hacker attacks.\n\nAnd in fact, Ethereum seems to already have 33 incidents. Following that, there is BNB Chain with 14 incidents, Arbitrum with 6, Solana and Bitcoin both with 2 attacks each.\n\nIn general, experts also point out that the most vulnerable crypto sector for this 2024 remains DeFi, due to all the incidents that have occurred.\n\nAnyway, making an estimate on the total, Smart Betting Guide reveals that this year’s crypto hacks have already caused losses of over 437 million dollars.\n\n“Crypto hack 2024”: Ethereum and DeFi remain the most vulnerable\n\nLast month, even MarketWaves analyzed reports on crypto hacks in the DeFi and Web3 world, sharing the De.Fi REKT report.\n\nAnd in fact, the latter had reported that the losses for the month of February 2024 alone were already 82 million dollars.\n\nBasically, during the month in question, the DeFi sector would have experienced a significant increase in security-related incidents. Specifically, the total lost due to various exploits on different chains and platforms was $82,287,101.\n\nHowever, it seems that efforts to mitigate these losses have led to the recovery of $1,325,932, highlighting the ongoing battle between hacking and security in the crypto sector.\n\nOnly in the month of February 2024, there have been several significant events with the platforms PlayDapp, Fixed Float, and Jeffrey Zirlin among the most affected.\n\nSome tips on how to keep your crypto safe\n\nExperts from Smart Betting Guide, in light of the already significant presence of crypto hacks in this 2024, wanted to share a guide on how to keep your crypto safe.\n\nFirst of all, the most useful advice of all, concerns the storage of the password and seed phrase of the various crypto wallets or exchanges where you hold your cryptocurrencies, which should absolutely not be stored on the Cloud.\n\nDespite the convenience, the Cloud could be violated, therefore the best way is to save them in writing or have them engraved on a metal card (to protect them from water damage or fire) to be kept in a safe place.\n\nGoing forward, Smart Betting Guide recommends not using exchanges but hardware wallets to store your crypto in a safer way.\n\nIt is important to always stay updated through DYOR – Do Your Own Research (Do your own research). In fact, it is only in this way that you can understand any crypto hack techniques such as rug pull, before falling into the scam.\n\nNot only, for the experts at Smart Betting Guide, when you want to invest in new blockchains or crypto projects, users should consider who the team and developers are, read and verify the quality of the Whitepaper.\n\nIn DeFi, it is also important to verify that the new project has a Total Value Locked (TVL) and that this value should be between 80% and 100%, as well as complying with standard practices of external audit."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNaE01dExmY0NITGFwRnc3R2hwUUV4TTdCbWlIRVpjR1FNZks3cnpxUzdJMnh1SWFFSnl1LTF3MUtfNnVwX3VXd0lSR2JUdW9hV3VZREhRUWZYbU5CMlJieVk4ZWtoWVZWcnFBNER1Tk8ySk5kVlZadlpCVFYwWl9vaF8yQWlGdDZqVmVvMk1ncWVXVGJSZFVTS01EUGY2U01RZWptSkdsZWhUZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Why (Almost) Everyone in Ethereum Is So Excited About a Wallet-Related Proposal - Unchained",
        "content": "While EIP-3074 offers a potential leap in the Ethereum wallet user experience by enabling batch transactions and smart contract-like features, some experts have concerns about its security and long-term impact.\n\nEthereum Improvement Proposal (EIP) 3074 will go live during Ethereum’s next hard fork, dubbed ‘Pectra,’ and many in the Ethereum community are very excited that it’s finally coming to fruition.\n\nInitially proposed by Ethereum researchers Sam Wilson, Ansgar Dietrichs, Matt Garnett, and Micah Zoltu in October 2020, EIP-3074 will be included in the next fork, as decided on Thursday on Ethereum All Core Developers call, and is designed to improve Ethereum wallet usability. It proposes a new set of code changes that would allow users to batch multiple transactions together and confirm them in a single action, unlike now where users usually have to sign at least two transactions to, for example, swap an asset on a decentralized exchange.\n\n“This is a big deal. Wallet [user experience] will 10x,” wrote Georgios Konstantopoulos, research partner at crypto VC Paradigm, on X.\n\nEIP-3074 suggests a novel way to extend the functionalities of externally owned accounts (EOAs) by delegating control to a smart contract. This method allows users to enjoy some of the advantages of smart contract wallets while keeping the straightforward approach of EOAs. Unlike account abstraction (ERC-4337), which focuses on transaction sponsoring and relaying, EIP-3074 lays the foundation for these new features to be possibly added in future proposals.\n\nBy enabling EOAs to interact like smart contract wallets, EIP-3074 could redefine how wallets operate, easing the transition to advanced wallet systems without requiring users to undertake complex migrations. “This is huge, because it allows EOAs to be magically converted to Smart Accounts,” wrote Ivo Georgiev, CEO of Ambire, on social media.\n\nLearn more: What Are Externally Owned Accounts (EOAs) in Ethereum?\n\nThe proposal also aligns with the broader goal of ensuring a smoother user experience across multiple EVM-compatible chains, maintaining consistency as users navigate different platforms.\n\nThe community’s support for EIP-3074 reflects its potential to simplify transaction processes and enhance the Ethereum network’s usability, making it a significant upgrade anticipated by both developers and users alike. Hayden Adams, founder of prominent DEX Uniswap, posted on X: “EIP-3074 inclusion will be a monumental upgrade to Ethereum UX.”\n\nMeanwhile, Dan Finlay, MetaMask’s cofounder, said: “3074 couldn’t come at a better time: There’s momentum to define an onchain permissions system for smart contract accounts, and 3074 can allow EOAs to still enjoy some of its benefits.”\n\nNot Everyone Agrees\n\nWhile there is significant excitement around EIP-3074, not everyone in the Ethereum community is equally enthusiastic.\n\nMartin Köppelmann from Gnosis voiced his concerns, saying that the EIP “brings us in a weird state with EOAs getting some of the benefits but not all, such as no option for key rotation.” He explained that instead of moving towards a unified and improved future, EIP-3074 could solidify the division between two different types of wallet technologies—smart contracts and traditional EOAs.\n\nMoreover, Köppelmann criticized its revocation capabilities, arguing that they provide only a “fake sense of security.” He wrote: “After 3074, an EOA will always have the danger that signing one wrong message can mean you lose anything this account controls.”\n\nKöppelmann’s criticism was echoed by 0xngmi from DefiLlama, who pointed out that with EIP-3074, “it’ll be possible to fully drain an address (all tokens, all nfts, all defi positions…) with only one bad signature.”"
    }
]