[
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOZy1POHZ2NnF1dHg3ZWE0Q2p4QlhWMF9WVkJFekFFVm80YktIOTB5NDc5blhSdEd3UXp0WDhHVlJyRHFKanVnenhIeV9adFNiQTIzb2wxN28tajVld3ZGVC1saEFCandZZDlFN0RfeFVGQllMeXNNd3hMZlE1aXhldmRXZXQ0OGQybDRN0gGTAUFVX3lxTFA3WGg3MW53ZWhpckJ6bjBqaUFOTDBxN3hMSWpTTHZaNWI4SEp0azh0MjJ6QUJBZkF1eDhkcGstRTZKNTdCQkU0X24xWV9TNlUxcWNzaDloS3ZRUlhEWmtoMUxEMnhSNzN0dkZtUjJVbEVPMXVQTXN5R3dzaWUwSnEyUmxCSDFRQWJQNEpqVWZqQWJ6Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "This Week in Coins: Bitcoin Touches $70,000 As Major Altcoins Soar - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nIt had been a long time coming: Bitcoin hit a new all-time high on Tuesday, soaring past its November 2021 record of $69,044 in the U.S. before dipping again.\n\nThen, on Friday, it did it again—this time by jumping above $70,000. This is remarkable, considering that the coin was trading for below $17,000 in January 2023.\n\nBitcoin's rise was aided by record-setting trading days in the spot crypto exchange-traded funds (ETFs). BlackRock's iShares Bitcoin Trust has been particularly popular.\n\nAD\n\nAD\n\nThe price of Bitcoin is now $68,413, up 10% over the past week, per CoinGecko data.\n\nAnd Ethereum, the second biggest digital asset, hit $4,000 for the first time since 2021. Over seven days, it has soared by 13% and the price of ETH stands at $3,894.\n\nBut the two biggest coins' gains over the week have been pretty tame compared to other assets. Meme coins, for a start, have jumped in value a ridiculous amount. Shiba Inu (SHIB) is the winning asset out of the top 20 biggest digital coins and tokens, after having jumped nearly 135% over the week.\n\nIts rival, Dogecoin, had a very good week—it nearly doubled in price. It has since dropped and is now priced at $0.1749. It touched $0.19 on Monday, and the Elon Musk favorite is still up over 27% the past seven days.\n\nElsewhere, Solana, the fifth biggest digital asset, rose above the $150 price point on Friday for the first time since January 2022. The token behind the Ethereum-competing blockchain is now up more than 13% over the past week and is priced at $145.82.\n\nAD\n\nAD\n\nBitcoin spin-offs like Bitcoin Cash also did well, although the gains were fleeting. BCH, the 20th biggest coin, was up nearly 40% over a seven-day period at one point—but it has now fallen back to $430 after peaking over $450 yesterday. BSV now trades at $109, up over 6% for the week.\n\nDespite the surge in alts and their tremendous gains, it's worth noting that most of them are well below their all-time highs from the previous bull market in 2021. Many still have a long way to go.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQdFNmZzgtdllUQlRJeUY4WHV6SW1fUGloMDRnc0tIamFjcnZUazFZUTZvN2RwWEUteHc0UEE2b01NUzhtN3Nyczd2WWZIdUMwdlgyUC1vdzZzZF9tcEF6R09uMjlpMlNFcTJ0ZkdJREJucDhLeEVnenNub1N3YWpyYmh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Bloomberg Analyst Who Forecasted BTC ETF Not Optimistic About Ethereum ETF - Coinfomania",
        "content": "Grayscale’s recent survey highlighted the approval of a spot Ethereum ETF could increase US investor interest in Ethereum by 25%.\n\nThis increase in interest is driven by economic concerns like inflation and worries about financial stability, particularly among younger individuals and minority communities. 40% of voters from the previous year desired to invest in cryptocurrency. Due to economic instability, that percentage has increased to 47% this year, indicating that more individuals are interested in digital assets.\n\nSource: Grayscale\n\nAccording to Grayscale’s survey, many Americans are drawn to cryptocurrencies because they see them as a way to achieve financial stability and manage their expenses.\n\nEconomic worries have historically influenced crypto interest. Bitcoin’s limited supply allows it to function like gold, acting as a store of value. Grayscale found that familiarity with cryptocurrencies increases the likelihood of seeing Bitcoin as a hedge against inflation and other macroeconomic events.\n\nDemographic Ownership Patterns\n\nNearly 70% of people surveyed said they own some form of investment and around 19% own cryptocurrencies. Men, Black and Hispanic voters, and younger people have higher ownership rates. Gen Z respondents, in particular, reported a 31% ownership rate, with many saying they are more interested in cryptocurrencies because of inflation.\n\nDespite the FTX crash, enthusiasm for crypto remains strong in the US. Approximately 40% of investors believe their future portfolios will include Bitcoin.\n\nGrayscale’s data shows that cryptocurrency interest transcends political boundaries. Ownership rates are similar among Republicans (18%) and Democrats (19%). Voters are split on which party is more favorable to the crypto industry, with 30% believing both parties have a favorable stance on crypto policies.\n\nThis balanced interest aligns with recent bipartisan support in Congress for the resolution of SAB 121, enabling banks to serve as custodians for crypto, making it more accessible.\n\nPolitical Views on Crypto\n\nHowever, differences exist in how each party views the importance of crypto-related issues. Republican voters are more likely to prioritize inflation and the economy, with 54% compared to 33% of Democrats. Conversely, Democrats focus more on issues like gun violence, climate change, and income inequality.\n\nMeanwhile, Bitcoin and Ether prices continue to be affected by government sell-offs and Mt. Gox’s repayment. Bitcoin has stabilized around $57,000, while Ether stands at $3,027 as of press time."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQUHlRa2pMOWItWHNqODh3aTdSMWlGazdRem0wNzUwOTZJN2pOM0JicXpCcFlrOWwyLV9mWnFBS1VwNTJ3TV9Fc3pmQ3F6SEJFSmZ5TUlvVHE5eW9jckFxdl9KcksxQ0E2SGlGUkoxNVUxaTRIbFNadWpzYTBUUWRtMC1MXzNhUVlXbU5HMHA4ZXQtaUN40gGaAUFVX3lxTE1DSVR1cFdacFA1a0FBQmlNZHc5UG5fVlhqRDZpcUpqWlcxakpCUjFlcHRWMDVZZWQ5cGtpU3RNalJONXBJa1llaElUb1lKMFlNQkdKQnJPdktzNVgxWEdyQ2Jna0xZbVJ2UWpWNi1mQ3FlMW82UW8xNndDT3BHVmdzZEppZ1A4UWRpMVljUXdiMXNDSVlBRjI3REE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum’s Dencun Upgrade Set to Drive Near-Zero Transaction Fees - CryptoPotato",
        "content": "The forthcoming Ethereum Dencun upgrade scheduled for March 13 offers a chance for near-zero transaction fees for layer 2 (L2) solution users, possibly drawing in more new ones, as per a research report by Fidelity Digital Assets.\n\nThe forthcoming upgrade marks the initial step in Ethereum’s rollup-focused roadmap. This advancement will empower the network to function as a resilient database, enhancing the efficiency and cost-effectiveness of data storage for layer 2 blockchains.\n\nDencun Upgrade to Reduce Costs for L2 Blockchains\n\nAnalyst Max Wadington wrote that the Dencun upgrade would provide the necessary scaling capability to accommodate millions of users on layer 2 blockchains, positioning Ethereum as a more suitable distributed database for other blockchains. These enhancements are anticipated to attract significantly more users to the Ethereum ecosystem and broaden the network’s total addressable market (TAM).\n\nMoreover, the upgrade is poised to reduce costs for layer 2 blockchains to store data on the main network. This cost reduction is expected to be transferred to users through lower fees.\n\nLayer 2 solutions are separate blockchains constructed on top of layer 1, or the base layer, to alleviate scalability issues and efficiently manage data. However, the upgrade is not expected to benefit Ethereum users significantly, as the fee reductions promised to layer 2 users will not extend to those transacting on the base Ethereum blockchain.\n\nWadington explained that in the short term, users seeking to capitalize on this fee adjustment would need to compromise some decentralization and security by conducting transactions on layer 2 solutions instead of directly on the Ethereum network. Hence, it will likely encourage more users to bridge assets to other platforms.\n\nThe report added that conducting transactions on Ethereum for application-specific purposes would remain the preferred choice in the medium term, especially as layer 2 platforms mature.\n\nEthereum Price Surges\n\nEthereum surpassed the $3,000 mark and surged to over $3,900 earlier this week, reaching its highest value in almost two years.\n\nInvestor sentiment reflects optimism regarding the forthcoming Dencun upgrade and the potential approval by the U.S. Securities and Exchange Commission (SEC) of Ethereum exchange-traded funds(ETFs). Additionally, on-chain data reveals that nearly $200 million worth of ETH was burned in the past week, reducing the altcoin’s circulating supply and potentially fueling further price appreciation.\n\nAccording to CoinGecko data, Ethereum is trading at $3,789, up 8% in the last week. Notably, the second crypto by market cap has surged over 60% over the last month."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOTDRsWmZ2d0NtbG5Ra1hUSTJ2NnRJSXNqcDVxVTgzSEZkbmt5SkVfODRlT1dJai1wc0QzLXJERnk4RFZrN1YySVNoUXVBX3ZhNHJxT2FfTS1hYmJScmFmUHg4UFdGTkZCTnpBeHBTSmxNUXMxNlRuZm5vTkptRTZicjJpYWl5VmF6MENsWTFybUpiSWx0TWVaazJjcTUtZDdhMlgzbTNIMGRNUkI3cmdvajVVNl82WjjSAbwBQVVfeXFMT2QwY3pMN3pYY2t6ZDF3UV82UzdVYk9BajhXdHExSmZSdmxZdE9ZbFNqS1NpWEdOdHNtVXdtSUFud3czOXFYSnV1cmQ0YTZWeEFfRjhJOGV6R1B2Vlo1OUQxX1VISHBmV19tZnpCS1N5Ul9OakRya043aXIxMTc3N0VmZ3otMU15YzFFUlNyekR1LW1zNlJkOF9UdUY2MFdUUTRESnYwdFJSZzhnWjF2b2YxdkJJbzR1UXc3bm8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Crypto Prices Today March 9: Bitcoin At $68K, Ethereum Nears $4K, PEPE Gains 20% As FLOKI Rallies 50% - CoinGape",
        "content": "The top crypto prices today witnessed a positive shift as the Bitcoin (BTC) price neared a new all-time high at $69,000 while other altcoins gained notably. In addition, the Ethereum price approached the $3,900 mark. Meanwhile, other top altcoins, such as Solana (SOL) and XRP witnessed a substantial price hike while Cardano (ADA) dipped\n\nMajor Crypto Prices Today\n\nThe Bitcoin price held firmly above $68,000 amid the bullish run. The Bitcoin price was up by 1.89%, reaching $68,434.94 at the time of writing on Saturday, March 9. On the other hand, it’s trading volume surged by 31.39% to $58.22 billion in the last 24 hours. Meanwhile, the crypto boasted a market cap of $1.34 trillion.\n\nadvertisement\n\nTurning to altcoins, the Ethereum price gained 0.83% to $3,931.55 at press time with a market valuation of $472.14 billion. Whilst, ETH saw its trading volume increase by 14.71%, reaching $24.76 billion. Meanwhile, the Binance Coin (BNB) price surged by 4.30%, reaching $489.40. In addition, its 24-hour trade volume rose by 0.11% to $3.52 billion.\n\nThe Solana price sustained above the $140 level. The Solana price was up by 1.85%, settling at $146.83 On the contrary, SOL witnessed a 9.77% dip in trade volume to $5.36 billion in the last 24 hours. Whilst, the XRP price traded beyond $0.62 amid the gains. The XRP price recorded a gain of 0.48%, reaching $0.6277. However, XRP’s trading volume dipped by 3.41% to $2.08 billion.\n\nMeanwhile, the Cardano price defied the gaining trend by dropping 0.38% to $0.7323 today. Whilst, ADA recorded a 7.03% hike in its 24-hour trading volume, settling at $899.59 million. As the top crypto prices witnessed a hike, popular meme coins also followed. The Dogecoin price gained 5.45% to $0.1714 while its rival, Shiba Inu price surged by 6.85% in value and traded at $0.00003561.\n\nAlso Read: Shiba Inu Aiming For The Second Peak Of The Week\n\nTop Crypto Prices Today Are\n\nPepe Coin Rallies 20%\n\nThe Pepe Coin (PEPE) crypto, a popular meme coin, witnessed nearly 20% gains today. At press time, the Pepe Coin price was up by 18.80% to $0.000009314 with a market valuation of $3.87 billion. In contrast, its 24-hour trade volume spiked by 103.98% to $3.43 billion.\n\nFloki Soars 50%\n\nFloki (FLOKI), a popular dog-faced meme crypto, recorded an phenomenal surge of 50% and ranked as the top crypto gainer for the second day in a row. The FLOKI price soared by 46.69% to $0.0002505 at the time of reporting. Moreover, its trade volume was up by skyrocketed by a whopping 300.16% to $2.72 billion. Furthermore, the FLOKI crypto recorded a new high of $0.0002767 amid the rally recently.\n\nAlso Read: Ethereum’s Price Hits $4000 Following Bitcoin’s Record Bull Rally\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOU2I2Q0tQQkhVX3NwT20wZ0t5ZC1Bb3FJMVVqakFXYUFydko4dWpxWjdzNGZLVUdUVHVScTgxbXhJRVlzeWp6ejJTUl9CWExPQ093WHpMd1k3VmZaaWVrUVVRbTBoT2R5T0s2U2VLLWp0Mno3WWV4TDc5X01Beng5OTlQLTl6NGI3cF9mLTNwZmdleVZVYVNIYzYwcEQwQTE1ZVEyNHpjMzg4TnpLZjBtYVlIcFk0UGtoSFpyWnFNMTRqRFJCQXhWSzdDVWJQQdIB0wFBVV95cUxPdTFmaEJtSERSRUp1REh3dTQzQUViZE05VV93UjdabW1ZVzZNMFFXQ1NWT0F2U1ptY3o1eFBvdjA3U1JXRzhtY2lSLTF5TmpEd01GWDJodHdRemlGRDloMEN6d29YMTVEZjdGV2t3R01BVDFXY19nbktjSTc0NUd3UDRrc2RxOU9vX1VjVUozOGNnM2V2Sm9DOEgxSndtNTFNM1ZFdDE1bkxqOG5hdEd2a21CUlVvQ0gzUUktS3AwQ0hLZDhXV1lKZ1ZfbDRSeGhKYy1V?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Hits $3,900 As Experts Believe NuggetRush Could Be A Potential Leader In Coming Altcoin Run - Crypto News Flash",
        "content": "Ethereum (ETH) is nearing the $4,000 milestone following Bitcoin’s recent surge. Altcoins like Dogecoin and Shiba Inu have also experienced significant gains, contributing to a bullish market sentiment.\n\nNuggetRush (NUGX) is an emerging token positioned in GameFi, DeFi, impact gaming, and play-to-earn (P2E). Still, in the ICO phase, it introduces a P2E game with governance tokenomics and deflationary features.\n\nIn the dynamic cryptocurrency landscape, Ethereum (ETH) is surging towards the significant psychological milestone of $4,000.00, propelled by the recent ascent of Bitcoin (BTC). On the other hand, NuggetRush (NUGX) emerges as an advanced token strategically positioned at the center of GameFi, DeFi, impact gaming, and play-to-earn (P2E). Here are reasons why Ethereum investors believe NuggetRush could lead the upcoming altcoin run.\n\nEthereum (ETH) Surges Toward $4,000 Amidst Bullish Crypto Landscape\n\nEthereum (ETH) is constantly heading towards the psychological $4,000.00 milestone after Bitcoin’s (BTC) rise to $68,537.15 on March 4, 2024. Multiple altcoins, including Elon memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB), have seen remarkable triple-digit gains, strengthening the current bullish sentiment in the market.\n\nCoinMarketCap data reflects a massive surge in Ethereum’s (ETH) liquidity and trading volume, hitting $33 billion, while its market cap has surged past $450 billion. These figures highlight the massive fundamental factors helping propel the current Ethereum (ETH) rally, especially the imminent Dencun upgrade set for March 13.\n\nThe upcoming Ethereum (ETH) Dencun upgrade, preceded by three successful test introductions, promises many boosts for Ethereum’s (ETH) ecosystem. Prominent aspects include decreased transaction fees on layer-2 protocols and easing network congestion, accomplished by raising the block size to 25 MB, up from the existing 12.5 MB.\n\nThe implementation of proto-danksharding will enable Ethereum (ETH) to resolve scalability issues efficiently.\n\nThe Dencun upgrade, combined with optimistic market sentiment fueled by Bitcoin’s surge to its all-time high and the potential for a spot exchange-traded fund (ETF), has strengthened Ethereum’s (ETH) upward momentum.\n\nOn March 7, 2024, Ethereum (ETH) was valued at $3,936.27, up 14.71% in the past week. Analysts say ETH will rise to $4,050.00 by the End of March, supported by increased bullish momentum in the crypto space.\n\nNuggetRush (NUGX): Unveiling an Advanced GameFi Token with Deflationary Features\n\nNuggetRush (NUGX) is an advanced token perfectly positioned at the center of GameFi, DeFi, impact gaming, and play-to-earn (P2E). Since it is still in the early stages of development, it is still available as a blockchain ICO.\n\nIn that context, NuggetRush (NUGX) will introduce a play-to-earn (P2E) game while blending tokenomics, consisting of a governance token. Interestingly, the token has a deflationary mechanism and characteristics. The rapid growth of an active community and massive interest in NuggetRush (NUGX) in its presale is subject to different factors and elements.\n\nThe main factors include community-driven progress, advanced technology, and a vision that supports decentralized finance (DeFi) non-fungible token (NFT) and gaming enthusiasts to engage with and derive considerable value from NuggetRush’s (NUGX) “ecosystem of rewards.”\n\nAlthough it is a relatively new project, NuggetRush dominates the crypto space. Its mission goes beyond its presale phase, and the team plans to help push NUGX toward a crypto market cap of $100 million. The significant target and many use cases confirm a growing momentum that may help NuggetRush (NUGX) become the best GameFi crypto.\n\nAdditionally, no taxes were charged on transactions executed in the presale space. On that note, NuggetRush has become attractive for most investors. The project has sold over 211 million NUGX tokens and raised over $2.7 million.\n\nCurrently, NUGX is valued at $0.019 in the Launchpad round of its presale. At the end of this round, NuggetRush will rise to $0.020, its mainstream listing price. The many utilities and growth potential make NUGX the best crypto investment today.\n\nVisit NuggetRush Presale Website\n\n[thrive_leads id=\"228374\"]"
    }
]