[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQM1BpMm43dTJucC1zM282U2VqeEpoTzg3NTU0WUZ6MFJ5VXFTbExBdGdNS3UtV2RGdldfc1ZBb3pQbzN0SV9wZG94VmFuWlRNX21SVXhhOVRHaDQ2RWRjM080VnRQTUpCSlVFRTFXcEVuUV93bG5wTGhrWHRZelhDQnRzVldUX3hXZS13SWxlRXRWZms?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Solana Meme Coins Outshine Ethereum by 800% in 2024 - Crypto Times",
        "content": "Solana-based meme coins have significantly outperformed their Ethereum-based counterparts in 2024, yielding an average return of 8,469% as compared to Ethereum’s 962%, per the “CMC 2024 H1” report.\n\nSolana-based meme coins Vs. Ethereum-based meme coins, Source: CoinMarketCap\n\nAs per the report, the explosive rallies of WIF and BONK on Solana have drawn significant attention and capital from other blockchains, creating a cycle of increased meme coin performance and investment. While meme coins exist across various blockchains, Solana and Ethereum lead in activity and trading volume.\n\nEthereum meme coins are more well-known because they were primarily introduced in 2023 or earlier. In contrast, most Solana meme currencies came onto the scene in late 2023 or early 2024, capitalizing on the surge in attention at the time.\n\nPolitical meme tokens have become a prominent subgenre inside the $57.7 billion meme currency market with a market valuation of $784 million. The MAGA (TRUMP) meme coin has increased in value by more than 5,100% this year due in large part to Trump’s open endorsement of cryptocurrencies and his acceptance of cryptocurrency contributions for his campaign.\n\nThe exceptional performance of Solana-based meme coins underscores a growing shift in speculative investments within the crypto space. This trend is not only reshaping the dynamics between different blockchain ecosystems but also highlights the increasing integration of political narratives within the meme coin market.\n\nAs crypto becomes a significant topic for the upcoming November US elections, political meme coins are expected to continue attracting speculative interest, further driving their market activity and value."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOQjg4bWlrQ1gxZUtYT2NSUmI0dFN6TUozVGNJR1B3djBUTmxNSVVYQ0ZoYXJ6YWt4NFFySHBfWW1qZkpHWllKelR1NndOdGhlN19BTFBiNW9XQ1lTWXJZMERuRUI3aTF2VGNNWUtBTjVDTU0yek1nVGNIb29RSlY1UXo5cE1naUdteEtRRTFYaWs3bTZ2T3UxVy0zbzZIUUFodGhKWTl2LVRxU3BmcDJEa3lqQXliWlR2YWZHZtIBwgFBVV95cUxOTk1MbUFPR0hqeGl0NVhteUpZMzk2VG1XSGR3b0thVXNkc0xlNGpsY3hLdkhMRTZoOTRTSWRNY0Ewd0VRdEZoeXpqXzdIbUQzZ2F0N3l0eHhYY3hpekJwcEVWYWMzanpCWjdscmVlTEV5YkVPQ2F4Y3Y0eHFFVTJjeWhfWFZnU3hQOVFuZHpvMEdObXBVT195QnRnUDhwUEVjYmEyT0Fwdk9mem8zbGRCYmpRMENUMnhwakpMUGhMZmdHZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Here’s the Most Probable Level for a Recovery After ETH Crashes 5% Daily - CryptoPotato",
        "content": "As Ethereum’s price continues to trend lower, investors are wondering whether the bull market is over. Yet, there is still a key support level that can provide the staging grounds for a recovery.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily chart, the price has been trending lower inside a large descending channel pattern. In the last few days, the market has failed to reclaim the $3,500 level, and it dropped lower following a bearish rejection.\n\nCurrently, a decline toward the $3,000 support level, which coincides with both the lower boundary of the channel and the 200-day moving average, could be expected.\n\nWhile this confluence of support elements makes $3,000 a strong support zone, if it gets broken down, things can get much worse very quickly.\n\nThe 4-Hour Chart\n\nThe 4-hour timeframe shows a clear picture of the price’s rejection from the $3,500 resistance level. The $3,350 short-term support zone is also getting broken to the downside, making $3,000 a probable upcoming target for ETH.\n\net, investors should keep an eye on the RSI, as it has entered the oversold region, which could point to a potential recovery soon.\n\nSentiment Analysis\n\nBy TradingRage\n\nTaker Buy Sell Ratio\n\nAnalyzing the futures market metrics for Ethereum can be a great complement to price analysis. This chart demonstrates one of the most useful futures market metrics, the Taker Buy Sell Ratio.\n\nIt measures whether the buyers or sellers are more aggressive in executing their orders on aggregate.\n\nAs the chart demonstrates, following the rejection from the $4,000 level, a huge volume of market sell orders has been executed in the futures market, bringing the Taker Buy Sell Ratio to its lowest value in the past few months. This indicates that futures market traders believe the price will be dropping even lower in the short term."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNTGh6T18xazV0anRJY21QRV92Vkp1TFgtVFVLY2V1TVBoTmQtWHU5empzWjQtbVUzRnhOVS1EOHdJS1lpUG1wc2JCZ2ZhaWtZNWhEWXVwU0tyejQ0aTEwQTFuZFpGOXRHOHZ5T2VHZEFkZHFHMzVTYlpMVHZPbDdhV2xTZWpCckpuZXRCVTRhc3BFbUo5TDNXbjhWNHBGVlpM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Developers Unveils EIP-7732 Designed for Speed - Crypto Times",
        "content": "Ethereum developers have proposed an exciting update, EIP-7732, which aims to overhaul the block validation process and accelerate the blockchain. This proposal introduces significant changes designed to bolster security and performance by bifurcating the process into consensus and execution stages.\n\nIn response to the ever-growing demand for efficiency, EIP-7732 aligns with Ethereum co-founder Vitalik Buterin’s advocacy for quicker transaction confirmation times. At the heart of this proposal lies the Enshrined Proposer-Builder Separation (EPBS), a groundbreaking method that splits block creation into two distinct roles: the consensus proposer and the execution proposer.\n\nImage Source: Farcaster (Vitalik Buterin exploring methods to enhance the confirmation speed of Ethereum transactions)\n\nUnder this new system, the consensus proposer selects the execution proposer, who then commits to generating a valid block pack or a block hash. Ensuring this block’s timely submission is a dedicated group of validators known as the Payload Timeliness Committee (PTC).\n\nBy segregating the consensus and execution layers, EIP-7732 aims to alleviate the computational burden on validators, thereby enhancing network efficiency and speed. Presently, validators juggle both roles in rapid succession, a process filled with potential inefficiencies and delays.\n\nEPBS promises a solution by allowing validators to immediately handle consensus and defer execution validation, all without compromising performance or security.\n\nMoreover, this proposal introduces a trust-free exchange mechanism between builders and proposers. This guarantees payment and the inclusion of valid blocks, eliminating the need for intermediary middleware. As Buterin emphasized in a recent post, “One of the important properties of a good blockchain user experience is fast transaction confirmation times.”\n\nThanks to the transaction fee overhaul of EIP-1559 and consistent block times post-merge, Ethereum’s transaction confirmation now ranges between five and twenty seconds. While this matches the speed of credit card transactions, certain applications demand even faster processing, far outpacing the current 12-second Gasper consensus mechanism.\n\nWith EIP-7732 under discussion, the promise of swifter transaction speeds seems within reach. However, this advancement may come with the necessity of another hard fork, introducing backward-incompatible changes."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOZ3VYTU1XUTBfWFE0ZC1fcDczRjlWWElPOTdMeGQ5TmJFZHF0dy1PdmlmV2pDX1ZRQ25Fb054TkdHRWprWFlQMFJMQ0taVy1pNVg2Y2FVeDNqbDd1VGQ4TGIxV2plZWc0aGNQN2d4MDZYajM5c3pIclZTWGd5ZEFCbGRxN3k5eG9fY3JYcVVjQTJCTkpkN0FFZEtXemR0UXBMNTE3QkZlczhobGZ2S2ItMkx1aXVQbk9VOVIyT0dBX00wdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Solana Meme Coins Outperform Ethereum 800% YTD – Top Winners Revealed - TradingView",
        "content": "In the first quarter of the year, Solana-based meme coins have emerged as the frontrunners, surpassing Ethereum’s meme coin ecosystem and artificial intelligence (AI) tokens, according to a recent report by market data platform CoinMarketCap.\n\nThis shift in popularity signifies a change in dynamics within the cryptocurrency market, with meme coins gaining traction and challenging previously dominant narratives such as smart contracts, decentralized finance (DeFi), and non-fungible tokens (NFTs).\n\nSolana Ecosystem Dominates Growth Chart\n\nThe CoinMarketCap report highlights that the Solana ecosystem has consistently topped the growth chart for the past eight months, with over 20 new tokens introduced in Q2 alone.\n\nEthereum’s ecosystem followed closely behind with 14 new tokens, while Derivatives and Stablecoins witnessed relatively lesser growth with 5 and 4 new tokens, respectively. This surge in Solana-based token offerings indicates a growing interest in the network and its potential.\n\nSolana’s meme coin ecosystem, in particular, has gained significant momentum in price performance and popularity since October 2023. Although Ethereum remains the dominant blockchain, Solana’s growing prominence suggests a noteworthy trend in the crypto space.\n\nInterestingly, SOL memes have significantly outperformed ETH memes, delivering an average return of 8,469% compared to 962% for Ethereum, as seen in the chart below.\n\nNewsBTC\n\nAs “speculative capital” from other chains rushed into Solana, attracted by the explosive rallies of tokens like dogwifhat (WIF) and Bonk Inu (BONK), more meme coins experienced price surges, attracting additional attention and capital.\n\nThe top winners in the meme coin space include the cat characters MEW, POPCAT, and Book of Meme (MEME). These tokens have outperformed even the most popular ones like WIF, BONK, Ethereum’s Pepe coin (PEPE), and Shiba Inu (SHIB).\n\nNotably, political memes also emerged as a popular subcategory, with the leading MAGA (TRUMP) meme coin gaining over 5100% year-to-date, largely due to vocal support for crypto from former President Donald Trump and the acceptance of crypto for campaign donations.\n\nEthereum Tops Fee Income Rankings\n\nDespite Solana’s significant gains, Ethereum continues to dominate the Layer 1 (L1) smart contracts market, representing 62.11% of the major L1s. The report notes that Ethereum’s recent milestone was propelled by the SEC’s approval of Ethereum Spot ETFs.\n\nHowever, Binance Smart Chain (BNB) and Solana have also gained traction, adding $42 billion and $18 billion to their market share among L1 networks. Solana currently leads with over 1.6 million active daily addresses, followed by BNB with 1 million active addresses.\n\nIn Q2, Ethereum experienced record low gas fees, reaching levels not seen since 2020 due to the growing adoption of Layer 2 solutions and the market excitement surrounding Solana-based meme coins.\n\nDespite representing 62% of the market cap among major L1s, Ethereum accounted for 70% of the daily revenue, generating approximately $2.7 million. Solana ranked second with around $900,000 in daily revenue.\n\nAccording to Lookonchain, Ethereum topped the fee income rankings in the past year with $2.728 billion, followed by Bitcoin with $1.302 billion.\n\nOther notable networks include Tron ($459.39 million), Solana ($241.29 million), Binance Smart Chain ($176.56 million), Avalanche ($68.83 million), zkSync Era ($59.77 million), Optimism ($40.4 million), and Polygon ($23.91 million).\n\nDespite both platforms experiencing success in various financial metrics and growth charts, Solana’s native token, SOL, has significantly outperformed Ethereum’s ETH token.\n\nAs of the current trading price, SOL is valued at $143.25, showcasing a year-to-date growth of 650%. ETH has seen a more modest surge of 68% during the same time frame, currently trading at $3,310.\n\nFeatured image from DALL-E, chart from TradingView.com"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQVmI1TEhWVkR4NDNacnZSRUJKbE16UDVJVDBaNlFBS3UydjlIWVN0dTJhZnZpZzJDQ3l6dTZpd1pZWGhGdFBBZGxWY0p4S2NWQTl3OEdfcmNFY2NYa01CZmMtaGw4SWJkWXhNZWtqRUo0MlFtNXNKUmg5clR6QmxjbVFLWWFkMW1LX0ZJdEF6ZzREaW1iVDBvb0Zad0E3eFVMZm16YjMtZkF3T05pMmthM0ItTzVGMzYtUGdvVGV2TnZiYknSAcgBQVVfeXFMUF9fb0pUWDRsNG40SUtIclJoS3RsRFVOX2s1Vzg0eEJwSW9MM21rcUxXTDV0THBTbUtNUEIyQjl6OFltb1dwRkNTSWFRRjROQkhqLXFmWm9aeEZrV3lvQ3hiYlA5Z3RVbFBZVXJSQk1EVnpLZmloSnQyUC1BZTZBTG5uOW1iaFlKQkcwdWZHUnpfM0hWWGtMSG5UTFoxb1BETXhCbnlBNnR1RTBkckZ2Ql95U1ZHOUM1T205R0pTVl8xS0RoN3JzQzU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum poised to follow Nvidia's steps as Bitwise files updated S-1 draft - FXStreet",
        "content": "Ethereum ETFs expected to begin trading in July after Bitwise files amended S-1 ahead of due date.\n\nEthereum ETFs could flip analysts' expectations if investors buy into ETH's Nvidia-like high-growth tech play narrative.\n\nEthereum derivatives data reveals investors are becoming more risk averse following Mt. Gox headwind on horizon.\n\nEthereum (ETH) is down 3% on Wednesday following Bitwise filing an updated S-1 draft and a wider market downturn with potential Mt. Gox BTC supply flooding the market. Despite the general market lull, investors may gain consolation from Bitwise prediction that Ethereum ETFs could outperform analysts' expectations if positioned as a high-growth tech play similar to Nvidia.\n\nDaily digest market movers: Could Ethereum be the next Nvidia?\n\nAsset manager Bitwise filed its amended S-1 registration statement with the Securities and Exchange Commission (SEC) today ahead of its July 8 due date. The new filing added a fee waiver for up to $500 million in assets under management, similar to Van Eck's waiver last week.\n\nConsidering the comments on these drafts were light, Bloomberg analyst Eric Balchunas said spot ETH ETFs should have begun trading and expects them to launch before the end of July.\n\nThe SEC approved spot ETH ETF issuers' 19b-4 filings in May but also needs to greenlight their S-1 registration statements before the products can begin trading.\n\nAccording to Bitwise CIO Matt Hougan, Ethereum ETFs could be more successful than earlier predicted if investors buy into the narrative that Ethereum is a high-growth tech play similar to Meta and Nvidia. Hougan had earlier predicted that spot ETH ETFs could attract up to $15 billion in net flows before the end of 2025.\n\n\"It's pretty easy for me to imagine investors selling a small amount of their tech exposure and adding ETH. I'd argue it's easier than imagining investors carving out an entirely separate portfolio sleeve for a new monetary asset,\" Hougan noted.\n\nHowever, people need to buy into the idea that \"Ethereum is a technology investment\" for this to happen. Hougan noted that a clear understanding of how Ethereum differs from Bitcoin and the growth of applications on its network would help strengthen the “high-growth tech play” narrative.\n\n\"What might that look like? Imagine stablecoins going from $160 billion to $1.6 trillion in assets as more people embrace the speed and transparency of blockchain-enabled payments. Or consider decentralized finance applications opening up new avenues for lending and borrowing with the onset of regulatory clarity. Or imagine more firms following BlackRock's lead and building tokenized funds on the Ethereum platform,\" said Hougan.\n\nMeanwhile, Lookonchain revealed in a recent analysis that Ethereum ranks number one among blockchain networks in terms of yearly revenue. Ethereum's revenue is at $2.728 billion per year, with Bitcoin coming behind at $1.302 billion. Increased revenue often indicates high user activity in a blockchain network, which helps estimate bullish sentiment.\n\nETH technical analysis: Ethereum traders are skeptical with Mt. Gox headwind in sight\n\nEthereum is trading around $3,307, down about 3% in the past 24 hours. ETH breached the $3,367 support level, pouring cold water on hopes of a potential rebound. ETH liquidations reached $44.33 million, equalling that of BTC in the past 24 hours despite having a lower market cap. Long liquidations accounted for 87% of ETH's total liquidations, with shorts at 13%.\n\nEthereum options open interest has declined by 57% since its spike following the SEC's approval of 19b-4 filings of spot ETH ETF issuers. As of May 24, ETH options OI was at $13.44 billion. However, following the expiry of May and June options, most investors have failed to open new positions as indicated in the chart below.\n\nETH options OI\n\nETH options OI is now at $5.69 billion, its lowest level since September. The decreasing options OI accompanied by ETH's price decline suggests option traders are more risk-averse. Two possible reasons for the uncertainty among traders include:\n\nSEC's delay in greenlighting prospective spot ETH ETF issuers’ S-1 drafts.\n\nPrevailing wider market bearish sentiment from Mt. Gox BTC supply.\n\nThe ETH Long/Short ratio also provides insights into traders' sentiment in the past week. The ratio's 7-day average is at 0.946, indicating the futures market is tilted toward the downside.\n\nAs a result, ETH may sustain a horizontal movement in the coming weeks until the SEC approves issuers' S-1 drafts for spot ETH ETFs to begin trading.\n\nETH/USDT 4-hour chart\n\nA breach of the $3,203 support could strengthen bearish sentiment and send ETH back to the $2,850 to $3,029 range."
    }
]