[
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBaWTdjcE1DOFhEMzRHdWF6Y21yRXBmX2djdjJTbUUzYVYyV1p6eEN1ekF4amwzYXZsdWJMaW5fcHJZaU1IVmcxcGs5cmxmWkMtYzIwekp2WGFpWjJaZjdTenplcFlXcHVTUEhqODRFRFBVRGpXQjYycmExQjPSAYIBQVVfeXFMT3pRMEppcVlVZFFkM3JWUDhicE1YakctenJ2YzFQN0ZhVkIyTkkwWVNOQzRwekt3WmctQ3F4RnZhV3ZsX3A4TGNyU05ZMnFaaTVMR3FWRGVQTDlxSFNwZEs5dWpWM2VwQVAweXpMSDgybVNLdXB5OENtQ3hoWEJLcG42Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Nearly $70 Million in Ethereum (ETH) Sent to Major Exchange - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) whales appear to be igniting a potential sell-off today, as nearly $70 million worth of the cryptocurrency was transferred to Binance, one of the world’s largest cryptocurrency exchanges. This movement has sparked concerns among ETH traders about a possible market downturn.\n\nAdvertisement\n\nWhale Alert, a prominent blockchain tracking service, reported two big transactions early this morning. The first tweet revealed that 9,999 ETH, worth around $34.3 million, were transferred from an unknown wallet to Binance. Shortly thereafter, Whale Alert tweeted again to disclose that another 7,413 ETH, worth around $25.4 million, were transferred from an unknown wallet to Binance.\n\nThese transactions amount to a total of 17,412 ETH, equivalent to approximately $69.86 million at current market prices. Such large transfers to an exchange typically signal an impending sell-off, as whales — large holders of cryptocurrency — often move their assets to exchanges when they intend to sell.\n\nBroader market impact\n\nThe news of these substantial transfers has already had a palpable effect on the market. Ethereum’s price has shown increased volatility following the alerts, with traders closely monitoring Binance for any signs of large-scale selling activity. The potential sell-off by these whales could exert downward pressure on the ETH price, impacting the broader market as well.\n\nAdvertisement\n\nHistorically, significant movements by whale accounts have led to notable price fluctuations. When large amounts of cryptocurrency are sold off, it can trigger a domino effect, causing other traders to panic and sell their holdings, further driving down the price.\n\nAs of writing this article, the Ethereum price is $3,447.60. It has fallen 0.30% in the last 24 hours. However, the ETH price is down 8.94% over the past 30 days thanks to the ongoing bearish phase on the broader market. While the ultimate impact on Ethereum’s price remains to be seen, the movement of such large amounts of ETH to an exchange is a signal that cannot be ignored."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOendzUnlldlZIVGJNWWI1aGFHQUdpcnBJSnlPZ2toOFE3cHBNbXB0SHJrREw5SE94T2hsYW9iYnZ3bXZuemNzQy1CclN3cnJZS2hTbTViSEVwaWhSckhkMy1GZi1oSTYtMkdNQllQb3hDYmJiZmN1eVN1RC1mWFVISFQtQ3lWMWdLbEJYd2hndVYydm8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Memecoin Deployer Pump.Fun’s Daily Revenue Surpasses Ethereum - Unchained",
        "content": "Pump.Fun’s annualized revenue, calculated by taking revenue data from the last 30 days and multiplying the figure by 12, is projected to be $268.95 million, DefiLlama shows\n\nDespite a $1.6 billion decrease in total memecoin market cap since June 17, dropping from $53.3 billion to $51.7 billion per CoinGecko, Pump.Fun averages $692,000 in daily revenue, indicating ongoing memecoin activity.\n\nThe memecoin frenzy is showing few signs of slowing down. Solana-based memecoin deployer Pump.fun surpassed Ethereum in revenue generated over a 24 hour period on Monday.\n\nPump.Fun, a platform where crypto users can create memecoins at low costs, hit an all-time high, generating $1.99 million in revenue within a 24 hour period, according to blockchain analytics firm DefiLlama. This surpassed the daily revenue figures generated by popular layer 1 blockchains such as Ethereum’s $1.19 million in revenue, Tron’s $1.58 million, and Solana’s $806,957.\n\nThe revenue spike for Pump.Fun stems from the memecoin frenzy that has largely taken place on Solana, with celebrities such as Caitlyn Jenner, Iggy Azalea, Rich The Kid, and Davido using the platform to launch their own memecoins.\n\nRead More: Solana Attracts Attention From Mainstream Celebrities\n\nFew Success Stories\n\nWhile some tokens have seen some success such as Azalea’s MOTHER token reaching a roughly $150 million market cap before settling around $53 million at the time of writing, success stories are seldom with nearly 1.2 million tokens having been deployed through Pump.Fun since its inception, which are all competing for the market’s attention, a Dune Analytics dashboard by Asian-based blockchain firm Hashed shows.\n\nFor example, the majority of celebrity tokens, such as Nigerian singer-songwriter Davido’s memecoin, have seen their prices plummet since their launch in May.\n\nProjected Revenue\n\nEven though the market cap of all memecoins has decreased by $1.6 billion since June 17 from $53.3 billion to $51.7 billion at presstime per CoinGecko, Pump.Fun has been able to average $692,000 per day in revenue, a sign people are still using Pump.Fun for memecoin activities.\n\nIf the momentum around memecoins sustains, the platform is projected to have an annualized revenue of $268.95 million, which DefiLlama calculates by taking revenue data from the last 30 days and multiplying the figure by 12. Pump.Fun recorded revenue of $22.05 million in June.\n\nPump.Fun earns revenue in a few ways, namely a 1% swap fee from those trading memecoins on the venue and an additional two SOL fee when the token gets listed to decentralized exchange Raydium."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBEdHZlaUNNdFZpUmhldHRhVzJNUFpZTC1RcklMNk0wQy1OemJNM1Flc1V6djBhbW5wS0FZZGFCYnpNTUU1dWVJZnNIekNiUnV1N0hlYzdZc0NiRVJtWnQ4NHNKVm5sYmVadC1RT09HeHJRSUxPQlQ2dlpFQ1oycWPSAYcBQVVfeXFMTzk5RFFCcUFudzBBLXVXaVZTWmJMc3ZfOGRSWUlwVi1HcFNTQmRqZU1xQlFlRTExODNTamNRWXlXVHIzdFpDNjVXbHZYdEo3M1lGSzRIVmdWYXNoM3ZEck1uQ1RRNlliZXZBaDdneWtLTmRwYnRHWTFJS0tmSWFaLWdGZExrNHpB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Will Soar Against Bitcoin After ETF Approvals: K33 Research - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum is primed to mount a comeback against Bitcoin this month after underperforming its sibling cryptocurrency since the start of the year, according to K33 Research.\n\nOn the one hand, the leading smart contract platform is poised to receive its first US-listed spot exchange-traded fund (ETF) in July, inviting a tidal wave of new institutional demand into ETH. Meanwhile, Bitcoin holders are awaiting a 141,686 BTC ($8.8 billion) distribution from defunct Bitcoin exchange Mt. Gox—a looming tsunami of potential sell pressure now ten years in the making.\n\n“The chickens of 2014 have come home to roost,” wrote K33 Research in a Tuesday market update. “We expect net selling pressure to burden Bitcoin in an otherwise dry summer market, widening the chop suey range until rosier days arise as the leaves turn orange.”\n\nAD\n\nAD\n\nThough the crypto market has lost much of its bullish momentum since April, K33 maintains that Ethereum ETFs will absorb between 0.75% and 1% of all ETH in circulation within their first five months on the market. Though the ETF launch could spark a “sell the news” event for ETH in the short term (much like Bitcoin ETFs in January), the firm says ETH’s “positive supply dynamics” will afford it “relative strength” over the next several months.\n\n“ETFs are a solid catalyst for relative ETH strength as the summer progresses and flows accumulate,” continued K33 senior analyst Vetle Lunde, “and I firmly view current ETH/BTC prices as a bargain for the patient trader.”\n\nThe ETH/BTC ratio steadily declined from 0.056 after the Bitcoin ETFs launched down to 0.046 By May 24. That’s when surprise news broke that the SEC would soon approve Ethereum ETFs, taking the ratio back up to 0.055 today.\n\nIndicators suggest that positive sentiment around both ETH and BTC is returning to form—particularly in the futures market.\n\nBitcoin futures premiums on the Chicago Mercantile Exchange (CME) are back to trading in double digits at 10.9%, according to the report. As for Ethereum, the newly launched VolatilityShares 2x leveraged ETH ETF now holds 33,700 ETH ($114 million) equivalent exposure after just 15 trading days, showing that CME traders want long-leveraged exposure to ETH right now.\n\nAD\n\nAD\n\nThe new ETF’s popularity has helped push CME ETH open interest back towards all-time highs, currently sitting at 372,000 ETH ($1.26 billion). K33 Research said such high interest signals intent to make directional trades around ETH before the ETFs go live – though the direction of those trades remains unclear.\n\n“The soft funding rates suggest that the directional expectations are balanced, with neither bullish nor bearish positioning dominating – highlighting the uncertain market outlook and lack of consensus as ETH ETF launches are nearing,” the report concluded.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9HSnJ5UXZkWjhsRjBhV2pLNnZjSFpGNFRHUlhjUHhiMDhSNVVPTWJKbkVyWUVJaG05bmRXUXdqeEk4MW0zSFViaUFoNWV0VTNmNXJ5R1BzVFVLalFEa3FFV3MtbWxEX3p6eDZ5NFd0TXI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Set For Explosive 30% Surge As ETF Approval Nears, Says Analysts - TronWeekly",
        "content": "Ethere­um (ETH) is generating considerable­ excitement as the­ U.S. edges closer to approving spot ETFs. Analysts pre­dict substantial capital inflows into these ETFs, potentially driving ETH price­s higher. This optimism is bolstered by re­cent technical analyses pointing to a bullish tre­nd for Ethereum.\n\nRenowne­d analyst Ali Martinez recently e­xamined Ethereum’s 3-day chart, re­vealing insightful data. Martinez highlighted the­ TD Sequential indicator, known for pinpointing market turning points, which flashe­d a buy signal for Ethereum. This signal suggests a possible­ rebound for ETH, indicating a short-term bullish outlook.\n\nEthereum Set for Explosive 30% Surge as ETF Approval Nears, Says Analysts 5\n\nThe TD Se­quential indicator is respecte­d for identifying trend exhaustion points. A marke­d 9 buy signal typically precedes price­ recovery or trend re­versal. Martinez interpre­ts this signal as a precursor to a rebound following a period of downward price­ movements. Historically, such signals have be­en followed by a consolidation or a reve­rsal.\n\nMartinez’s analysis indicates that Ethere­um might see a corrective­ upward move. The rece­nt price action shows Ethereum trading downward, with occasional upward spike­s. The ‘9’ buy signal suggests a potential pause­ in the bearish trend, possibly le­ading to a brief rally. This aligns with historical behaviors observe­d after such signals.\n\nBullish Breakout Suggests Ethereum Price Surge\n\nAnother notable­ analyst, ZAYK Charts, presents a bullish scenario for Ethe­reum. ZAYK identified a falling we­dge on the ETH/USDT 12-hour chart. This bullish pattern ofte­n reverse downtrend, sugge­sting a potential upward breakout. The chart illustrate­s ETH consolidating within converging trend lines ove­r the past months.\n\nEthereum Set for Explosive 30% Surge as ETF Approval Nears, Says Analysts 6\n\nZAYK’s analysis shows that the breakout from the­ falling wedge is complete­, indicating a shift in market sentiment. This te­chnical pattern’s confirmation suggests a bullish wave, with 20-30% price­ increase projections. Following this bre­akout, Ethereum’s target price­ range is optimistic and promising.\n\nCurrently, ETH is trading at $3,484.66, showing a 3.38% increase­ and a 53.58% rise in trading volume within a day. This positive price­ action indicates potential further upside­s. The price is encounte­ring resistance around the $3,500 mark, with significant barrie­rs at the $3,520 and $3,550 levels. A close­ above $3,550 could propel Ether towards the­ $3,650 resistance.\n\nEthereum Set for Explosive 30% Surge as ETF Approval Nears, Says Analysts 7\n\nFurther re­sistance is near $3,720, and an upside bre­ak above this level could drive­ the price higher, pote­ntially reaching $3,880. However, a downside correction might start if Ethe­reum fails to clear the $3,550 re­sistance. Initial support is ne­ar $3,480, with significant support at the $3,440 zone.\n\nA move be­low the $3,420 support might push the price towards $3,350. Furthe­r losses could decrease­ the price to $3,320 in the short te­rm. Overall, technical indicators and market se­ntiment suggest Ethere­um is poised for a potential price surge­, supported by expecte­d ETF approvals and bullish technical patterns.\n\nRelated Readings | Solana (SOL) Faces 16% Value Drop, Yet Bullish Predictions Drive Hope Amidst Decline"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQTDRzWDN6bGQyVEh5RW52U2NuWWxLbzJBbVBOVlFGcHFQcVdpTGZyVFNYVjBSeWtqRnVXeFMtQXAwMlV2VTJvZHA5am5RN1dBNFMtbms5NlRRdjdrdkVmUngxcFg5NG15WmtHVWtrc01nS1FoVW53ZFNzRUVXWDV4enc3QzJKNXQwOG1MRUFTWUt2WWxSQ3JISnRlV0IxRmx1RFp1RXlWQkVmdGJyQ1hIY19OeXZ2OEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Lido Takes Initial Step to Decentralize Ethereum Node Operator Set Amid SEC Allegations - Unchained",
        "content": "Monday saw the debut of Lido’s Community Staking Module on the Holesky test network, which aims to allow new entities, including solo stakers, to become node operators without needing permission from its DAO.\n\nLido jumpstarted the liquid staking ecosystem in 2020 by introducing its flagship product, stETH, a rebasing token representing a person’s principal amount of staked ETH and their rewards from helping secure the Ethereum blockchain network.\n\nAs it faces allegations by the U.S. Securities and Exchange Commission, liquid staking leader Lido is preparing to become more decentralized by taking a step toward integrating a more diverse set of Ethereum node operators, such as solo stakers, the “gold standard” for staking, per the Ethereum Foundation.\n\nOn Monday, a Lido initiative called Community Staking Module, which is expected to allow permissionless entry for node operators, activated on the Holesky test network, according to a governance post in Lido’s forums by Dmitry Gusakov, the tech leader of Lido’s community staking product.\n\nThe move comes days after the SEC implied in a lawsuit against Ethereum software provider Consensys that Lido’s liquid staking token, stETH, is an unregistered security. Staked ETH, aka stETH, represents a person’s principal amount of staked ETH and their staking rewards from helping secure the Ethereum blockchain network.\n\nLido’s stETH has a market cap of $33 billion, making the liquid staking provider the leading DeFi protocol by total value locked. According to a Dune Analytics dashboard by crypto analyst Hildobby, Lido commands a 29% share of the total 33.3 million staked ETH.\n\nThe advent of Lido’s community staking module marks a change to the protocol that first introduced liquid staking in 2020, because Lido on Ethereum has had a curated and permissioned validator set since its inception, in which those interested in acting as a node operator for Lido had to be vetted by the Lido DAO.\n\nPermissioned and Restricted Since Inception\n\nUnlike its competitor Rocket Pool, before a node operator can conduct validator operations for Lido, governance has to vote on whether to include a prospective address into Lido’s active set of node operators. At presstime, Lido has 39 node operators, which includes the likes of P2P.org, Chorus One, and Consensys.\n\nThe initiative centered on permissionless entry allows “any node operator – and especially community stakers, from solo stakers, to groups of friends, to amateur operators – to operate validators by providing an ETH-based bond (security collateral),” according to its documentation.\n\nThe new community module is expected to make solo staking more accessible through its inclusion of several features such as a low bond for node operators as well as smoothed rewards from Ethereum’s execution layer and maximum extractable value.\n\nLido becomes less centralized by making its node operator set permissionless. During the lifecycle of a crypto project, a protocol will typically start with heavy elements of centralization, ranging from core developers holding control over the direction of the project, sometimes in the form of fundraising to delaying a protocol’s token generation event that aims to introduce governance mechanisms for those in the community.\n\nEventually, founders and core members of a protocol would introduce decentralization initiatives, such as implementing onchain voting processes or making node operation permissionless such as the case with Lido.\n\nSEC’s Focus on Consensys and Lido\n\nAlthough, like most DeFi projects, Lido has had a roadmap to decentralization for a while, the initiative comes several days after the SEC charged Consensys for offering and selling unregistered securities, namely Lido and Rocket Pool’s liquid staking tokens, through Metamask, a crypto wallet where people can stake and swap cryptocurrencies.\n\nConsensys, which is also a node operator for Lido, “has offered and sold tens of thousands of unregistered securities on behalf of liquid staking program providers Lido and Rocket Pool, who created and issue liquid staking tokens (called stETH and rETH) in exchange for staked assets,” the SEC’s press release states.\n\nRead More: Could the SEC Have a Case Against Liquid Staking Protocols?\n\nThe complaint calls Lido and Rocket Pool issuers of unregistered securities, alleging that their staking programs “are each offered and sold as investment contracts and, therefore, securities.”\n\nFollowing the prongs of the so-called Howey test, which, since a 1946 court case, has been the legal measure to determine whether an investment is a securities offering, the agency said these liquid staking tokens meet the criteria.\n\nIn its press release it said, the buyers of LSTs “make an investment of ETH in a common enterprise with a reasonable expectation of profits from the managerial efforts of Lido and Rocket Pool, respectively.” However, neither Lido nor Rocket Pool has filed registrations to offer these securities with the SEC.\n\nWith the fourth prong of the Howey test being “the managerial efforts of others,” crypto projects have sought to be decentralized enough that such a third party could not be easily named.\n\nWhen Unchained reached out to the founders and key members of Lido in May for commentary on whether the SEC took action against the liquid staking provider or contacted them about stETH, Unchained did not receive a response. According to a snapshot vote taken in Aug. 2022, Eric Hill, who goes by @Rotorless on X, is Lido’s head of legal and general counsel. However, when Unchained contacted Hill for commentary, he said he did not hold that position anymore and wasn’t “the right person to talk to.”\n\nAfter the SEC’s lawsuit against Consensys, when Unchained highlighted SEC’s claims that stETH is an unregistered security, Lido marketing lead Kasper Rasmussen said, “We’re on it,” but did not provide additional insights.\n\nLDO, the governance token for Lido, has decreased 6.3% in the past 24 hours and 19.7% over the last 30 days to trade at $1.92, making its market cap stand at $1.7 billion, per CoinGecko.\n\nUPDATE (July 3, 2024, 3:08 p.m. ET): Added clarification on the timeline for Lido’s plan to make the process to become a node validator permissionless, as well as the way Lido founders and key members responded to queries about regulatory issues when Unchained reached out to them in May."
    }
]