[
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPMklFNW85TG5wRUZpOThaZzV5Z2w3TXVTRXVTRi1fR3g3eUtIR09QNHV3VTJNNnJNazUzZDlRSFZ2WGNzUEhET3I1dVJjSFRjcHk3VVd2MVo1NVVHMk5pOHRqVFNibFlSdGhkWDZpVDJjOGpidUxvVF9JaWhvLWR0SDJXTTBGMjZ2a3hndElxWXg1Z9IBlwFBVV95cUxQSkI0dTMxcjFrbjMtd2dDR1JIQW5nV09HUDluR05YdERoaFI1SUkwNkNhLWl1azN5MDJtcG9wVnpoeUlLNlFjNjFMeXdYVFRpVHVwODh4TFRfRVNNdEc1VFd1cHhvZ1NYVHM3NVdxZW9RNFNTU2V2OXBoT1ZQX0NxTUxMbVdudENReHJPbVY4bjdJNkdtc1VN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Emerges as Crypto Darling After SEC’s Spot ETF Nod - CryptoPotato",
        "content": "Ethereum witnessed its strongest week in terms of capital inflow since March, with total inflows amounting to $69 million over the past week, as per the latest stats by CoinShares. The latest influx can be attributed to the surprise decision by the US Securities and Exchange (SEC) to allow spot Ether ETFs.\n\nAs a result, Ethereum’s YTD inflows surged to almost $81 million.\n\nThe improvement in investment products based on Ethereum had a significant impact on other digital asset products, attracting a staggering $2 billion. This subsequently resulted in the recent 5-week streak of inflows to $4.3 billion.\n\nBitcoin Still King with $1.97B Weekly Inflow\n\nEthereum products may have overshadowed Bitcoin for the past few weeks, but the latter remained the main attraction, with weekly inflows of $1.97 billion. On the other hand, short-Bitcoin investments experienced outflows for the third consecutive week, recording $5.3 million.\n\nAltcoins also saw a minor uptick in activity. Investment products based on Solana, Litecoin, and Chainlink witnessed $0.7 million in weekly inflows each. Meanwhile, XRP and Fantom stood out with inflows of $1.4 million and $1.2 million over the past week.\n\nTrading volumes in exchange-traded products (ETPs) soared to almost $13 billion for the week, representing a 55% increase from the previous week. According to the latest edition of CoinShares’ Digital Asset Fund Flows Weekly Report, inflows were observed across almost all providers, coupled with a continued deceleration in outflows from established players.\n\nThis turnaround in sentiment is believed to be a direct response to weaker-than-expected macroeconomic data in the United States, which has brought forward expectations for monetary policy rate cuts. Positive price movements led to a rise in total assets under management (AuM), surpassing the $100 billion mark for the first time since March of this year.\n\nUS Leads $2B Global Crypto Inflow\n\nRegionally, the US experienced the highest inflows last week, registering $1.98 billion. In fact, CoinShares found that the first day of the week marked the third-largest daily inflow ever recorded. The iShares Bitcoin ETF now comfortably exceeds the incumbent Grayscale, with $21 billion in assets under management.\n\nHong Kong, Canada, and Switzerland followed suit with inflows of $26.1 million, $12.7 million, and $10.6 million, respectively, whereas Brazil, Germany, and Australia settled with $9.5 million, $2.5 million, and $1.7 million in inflows, respectively. Sweden, on the other hand, recorded a weekly outflow of $9.2 million."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9zZHdCTENnS3h3NV9fMzgwZjJUV0FicFJRQUVMaFNPTjB1eURQTWtodDkyamllVnEtSGg0LWtNQlJxR0wtWVdlSFIwazZ6UEdmY1FhS0VBTGdteWw4VzY1QUd6SWl5ZWRZc095eWpkZHZDaTBJV1VZTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum exchange balances at 4-year low - crypto.news",
        "content": "Bitcoin and Ethereum user balances have dropped to levels not seen since 2020.\n\nGlassnode data revealed that user balances of Bitcoin (BTC) and Ether (ETH) on centralized exchanges reached a four-year low as investors held out for higher prices in a bull market.\n\nBTC balances dipped to below 2.3 million coins, valued at around $160 billion, while ETH balances have dropped below 16 million, amounting to less than $59 billion.\n\nBitcoin and Ethereum exchange balance at 4-year low | Source: Glassnode\n\nWhy Bitcoin and Ethereum exchange levels dropped\n\nThe amount of BTC and ETH on exchanges has been in a downtrend since before July 2020, per Glassnode. Data confirmed that users continued to withdraw assets from these platforms following the pandemic, through the previous 2021 peak, during the 2022 Terra-FTX contagion, and even after spot BTC ETFs were approved.\n\nThe four-year pattern suggests that crypto users have adopted a bullish long-term outlook, expressing confidence in the future appreciation of these assets regardless of market cycles.\n\nAfter the COVID-19 crisis in 2020, inflation also rocked world economies and incentivized investors to station capital in technologically sound vehicles. Bitcoin’s hard-capped supply and immutable design bolstered its status as an inflation hedge and sovereign nations like El Salvador have adopted the cryptocurrency as legal tender.\n\nYou might also like: Bitcoin ETFs see significant inflows despite market fluctuations\n\nThe bullish thesis is perhaps solidified even further as Wall Street behemoths like BlackRock and Fidelity drove institutional demand through spot BTC ETFs. Companies like MicroStrategy under BTC maxi Michael Saylor have also parked billions in the top digital asset.\n\nAs the second-largest crypto and top altcoin asset, ETH commands its own bullish thesis as the leading substitute for BTC. The token powers the biggest decentralized finance (defi) ecosystem worth nearly $70 billion per DefiLlama.\n\nIn 2020, developers launched the Beacon chain, which kicked off the eventual transition from proof-of-work (PoW) to proof-of-stake (PoS). The move unlocked Ether staking, a process of locking up ETH for network security and passive yield.\n\nAt press time, over 27% of Ethereum’s supply was staked. In other words, users have deposited over $119 billion worth of ETH in staking providers like Coinbase, Lido, and EigenLayer.\n\nThe hype around spot ETH ETF approvals, defi growth, and staking surges has culminated in a positive outlook for the cryptocurrency and has further encouraged users to hold on for dear life, otherwise known in the crypto community as “hodl.”"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPQ2FlbkdveHVOVDFseWpWeHZJZ1ZXLVRxMkliaXVnRWlYRWlocVZ5NURUbFloaVZGNUJqcDMtZDBGdzgtYjZVeHF0Wng3SzNrU2lEeTdtdWpBSDNqT25POGtYTm9vUkpuakg2OGJfdlc0OWxEcHVzTWJfbXNFcTF3WV9Dd2RRWS1MaWRRMmJuUFRLYjVtTERvZnZxQ0FESXBIT3lHTk5XU1RMTzNfWURHSDVtekR2NUo1Z3hoZ3QtZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "World's largest bank ICBC praises the evolution of Bitcoin, Ethereum as innovative financial assets - CryptoSlate",
        "content": "The world’s largest lender, Industrial and Commercial Bank of China (ICBC), recently published an in-depth analysis highlighting the rapid evolution and growing diversity in digital currencies, where it compared Bitcoin to gold and deemed Ethereum “digital oil.”\n\nThe report emphasizes the human capacity for imaginative belief, as noted by historian Yuval Noah Harari, as a driving force behind the exponential growth in digital currency types and applications.\n\nVanEck head of digital assets research Matthew Sigel noted:\n\n“Chinese SOE banks keep writing love letters to Bitcoin and Ethereum.”\n\nThe ICBC report outlines the divergent development paths of various digital currencies, each addressing unique needs within the financial ecosystem.\n\nThe love letter\n\nAccording to ICBC’s report, market demand has fueled innovation in the digital currency sector, from the birth of Bitcoin (BTC) to advancements in Ethereum (ETH) and the exploration of central bank digital currencies (CBDCs).\n\nICBC said that Bitcoin has managed to retain a scarcity similar to gold through its mathematical consensus mechanism. The flagship crypto has resolved issues related to divisibility, authenticity verification, and portability. The report added that despite Bitcoin’s waning monetary attributes, its status as an asset is solidifying.\n\nMeanwhile, Ethereum provides “technical power for the digital future” and is establishing itself as “digital oil” capable of powering myriad applications across the web3 ecosystem.\n\nEthereum, distinct from Bitcoin, incorporates Turing completeness through its proprietary programming language, Solidity, and its virtual machine, EVM.\n\nThis feature allows developers to create and manage complex smart contracts and applications, positioning Ethereum as a critical platform for DeFi and NFTs. The report also acknowledged Ethereum’s potential to extend its influence to decentralized physical infrastructure networks (DePin).\n\nDespite the potential, Ethereum faces several practical challenges, including security vulnerabilities, scalability issues due to high computational demands, and significant energy consumption.\n\nEthereum developers are exploring various solutions to address these challenges. The introduction of the Proof of Stake (POS) consensus mechanism and sharding technology in the Ethereum 2.0 upgrade aims to enhance network throughput and sustainability. Additionally, developers are working on Layer 2 solutions such as state channels, side chains, and rollups to improve scalability.\n\nStablecoins and CBDCs\n\nThe report also highlighted the crucial role of stablecoins in bridging the gap between the digital currency market and the real world. Stablecoins, which peg their value to traditional assets like fiat currencies, offer stability in the volatile crypto market.\n\nICBC said that stablecoins facilitate seamless transactions and provide a reliable store of value, making them an essential tool for everyday financial activities and a bridge for integrating digital currencies into the global financial system.\n\nFurthermore, CBDCs represent a significant innovation in the modern monetary system. By digitizing fiat currencies, central banks can improve the efficiency of payment systems, reduce transaction costs, and enhance the effectiveness of monetary policy.\n\nAccording to the report, CBDCs can streamline cross-border transactions, reduce reliance on intermediaries, and offer greater financial inclusion by providing access to digital financial services for unbanked populations.\n\nThe report noted that the development and implementation of CBDC infrastructure requires careful consideration of privacy, security, and regulatory implications to ensure their success and widespread adoption.\n\nThe report concluded that while the development vision for each digital currency varies, all aim to enhance financial inclusion, security, and payment efficiency. As digital currencies continue to evolve, developers and policymakers need to focus on balancing sustainability, security, and efficiency.\n\nMentioned in this article"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPZ3dZc3FnaUN1d1RYdU9LSkFPeHpVZE5pODNwWVBCR2thUktpamp2LVZ6SzRzS1Z6N3JKNV9adjFQdElsd2xpcWQ5MDRVZnBabWR4Rk9yeDBpcVVYVHFsRUlHM2ltY21rUFIxb3k5MDF0U0JXdDl3enFNaDRkTWJqVkk4SGctTVVrc3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Crypto Market on Fire: Bitcoin's Breakout, Ethereum's Growth, and Furrever Token's Promising Launch - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY , June 10, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency market is experiencing a fiery surge as Bitcoin, Ethereum, and the newly introduced Furrever Token make significant strides. This trifecta of digital assets is creating a buzz among investors, each offering unique opportunities and showcasing promising growth trajectories.\n\nBitcoin's Breakout: A Bullish Run\n\nBitcoin, the leading cryptocurrency by market capitalization, is once again in the spotlight with a remarkable breakout. Recent activities have seen Bitcoin reclaim and stabilize around the $69,000 mark, driven by substantial whale activity. High-net-worth investors have opened massive long positions, indicating strong confidence in Bitcoin's potential for further gains. This bullish sentiment is underpinned by record-high open interest and funding rates, suggesting that the market is poised for continued upward movement.\n\nHistorical data shows that Bitcoin often experiences significant price appreciation following such bullish patterns, making it an attractive option for both new and seasoned investors. As Bitcoin continues to lead the market, its influence on the broader cryptocurrency ecosystem remains unparalleled, driving momentum across various digital assets.\n\nEthereum's Growth: Innovation and Expansion\n\nEthereum, the second-largest cryptocurrency by market cap, is also witnessing impressive growth. Known for its robust smart contract capabilities and a vast ecosystem of decentralized applications (dApps), Ethereum continues to innovate and expand. The recent approval of Ethereum ETFs has further fueled optimism, attracting institutional investors and enhancing market stability.\n\nEthereum's transition to Ethereum 2.0, aimed at improving scalability and reducing energy consumption, is a significant milestone. This upgrade is expected to enhance the network's performance and security, making Ethereum an even more attractive platform for developers and users. The increased adoption of Ethereum-based DeFi applications and NFTs (non-fungible tokens) further cements its position as a leader in the blockchain space.\n\n\n\n\n\nFurrever Token: A Whimsical Revolution in Crypto\n\nAmidst the excitement surrounding Bitcoin and Ethereum, Furrever Token (FURR) is carving out its own unique niche. Unlike traditional cryptocurrencies, Furrever Token infuses the crypto world with a playful and heart-warming twist. Centered around adorable cat imagery, Furrever Token aims to create an engaging and fun ecosystem that appeals to both crypto enthusiasts and cat lovers alike.\n\nStory continues\n\nA Delightful Concept\n\nFurrever Token stands out with its focus on cuteness and community. The platform features cat-themed stickers, emojis, and visuals that enhance user interaction and foster a sense of camaraderie among holders. This whimsical approach not only differentiates Furrever Token from other digital assets but also creates a loyal and enthusiastic user base.\n\nRobust Tokenomics and Community Engagement\n\nThe tokenomics of Furrever Token are meticulously crafted to support its long-term vision. With a total supply of 9 billion tokens, the distribution includes 65% available during the presale, 25% allocated for decentralized exchanges (DEXs), and 10% reserved for the team, locked for a year to ensure project stability and trust. This thoughtful allocation aims to balance initial accessibility with sustained growth potential.\n\nCommunity involvement is at the heart of Furrever Token. By empowering early adopters as moderators, the project fosters organic growth and meaningful engagement. This strategy has already attracted nearly 4,000 active members on Telegram, demonstrating the strong interest and participation in the Furrever ecosystem.\n\nPromising Presale and Future Prospects\n\nFurrever Token has raised over $1.3 million and is in the ninth stage of its presale, targeting a total of $1.9 million. The token’s upcoming launch on PancakeSwap offers up to 15X returns for early investors, creating significant buzz and FOMO (fear of missing out) within the crypto community. With a current price of $0.000732, FURR presents an attractive opportunity for those looking to invest early in a unique and promising project.\n\nEnsuring Security and Trust\n\nSecurity and transparency are paramount for Furrever Token. The project's smart contract has been audited by Securi Lab, providing an additional layer of assurance for investors. While the team remains anonymous—a common practice in the crypto world—they have implemented measures such as locking their tokens for a year to build trust and demonstrate commitment to the project's success.\n\nConclusion\n\nAs Bitcoin and Ethereum continue to lead the charge in the cryptocurrency market with their impressive breakouts and sustained growth, Furrever Token is set to be the next big thing with its unique and whimsical approach. With strong tokenomics, community involvement, and a promising presale performance, Furrever Token offers a refreshing and potentially lucrative opportunity for investors. The combined momentum of these digital assets underscores the dynamic and exciting nature of the crypto market. For more information, visit Furrever Token's official website.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPZ3dZc3FnaUN1d1RYdU9LSkFPeHpVZE5pODNwWVBCR2thUktpamp2LVZ6SzRzS1Z6N3JKNV9adjFQdElsd2xpcWQ5MDRVZnBabWR4Rk9yeDBpcVVYVHFsRUlHM2ltY21rUFIxb3k5MDF0U0JXdDl3enFNaDRkTWJqVkk4SGctTVVrc3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Crypto Market on Fire: Bitcoin's Breakout, Ethereum's Growth, and Furrever Token's Promising Launch - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY , June 10, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency market is experiencing a fiery surge as Bitcoin, Ethereum, and the newly introduced Furrever Token make significant strides. This trifecta of digital assets is creating a buzz among investors, each offering unique opportunities and showcasing promising growth trajectories.\n\nBitcoin's Breakout: A Bullish Run\n\nBitcoin, the leading cryptocurrency by market capitalization, is once again in the spotlight with a remarkable breakout. Recent activities have seen Bitcoin reclaim and stabilize around the $69,000 mark, driven by substantial whale activity. High-net-worth investors have opened massive long positions, indicating strong confidence in Bitcoin's potential for further gains. This bullish sentiment is underpinned by record-high open interest and funding rates, suggesting that the market is poised for continued upward movement.\n\nHistorical data shows that Bitcoin often experiences significant price appreciation following such bullish patterns, making it an attractive option for both new and seasoned investors. As Bitcoin continues to lead the market, its influence on the broader cryptocurrency ecosystem remains unparalleled, driving momentum across various digital assets.\n\nEthereum's Growth: Innovation and Expansion\n\nEthereum, the second-largest cryptocurrency by market cap, is also witnessing impressive growth. Known for its robust smart contract capabilities and a vast ecosystem of decentralized applications (dApps), Ethereum continues to innovate and expand. The recent approval of Ethereum ETFs has further fueled optimism, attracting institutional investors and enhancing market stability.\n\nEthereum's transition to Ethereum 2.0, aimed at improving scalability and reducing energy consumption, is a significant milestone. This upgrade is expected to enhance the network's performance and security, making Ethereum an even more attractive platform for developers and users. The increased adoption of Ethereum-based DeFi applications and NFTs (non-fungible tokens) further cements its position as a leader in the blockchain space.\n\n\n\n\n\nFurrever Token: A Whimsical Revolution in Crypto\n\nAmidst the excitement surrounding Bitcoin and Ethereum, Furrever Token (FURR) is carving out its own unique niche. Unlike traditional cryptocurrencies, Furrever Token infuses the crypto world with a playful and heart-warming twist. Centered around adorable cat imagery, Furrever Token aims to create an engaging and fun ecosystem that appeals to both crypto enthusiasts and cat lovers alike.\n\nStory continues\n\nA Delightful Concept\n\nFurrever Token stands out with its focus on cuteness and community. The platform features cat-themed stickers, emojis, and visuals that enhance user interaction and foster a sense of camaraderie among holders. This whimsical approach not only differentiates Furrever Token from other digital assets but also creates a loyal and enthusiastic user base.\n\nRobust Tokenomics and Community Engagement\n\nThe tokenomics of Furrever Token are meticulously crafted to support its long-term vision. With a total supply of 9 billion tokens, the distribution includes 65% available during the presale, 25% allocated for decentralized exchanges (DEXs), and 10% reserved for the team, locked for a year to ensure project stability and trust. This thoughtful allocation aims to balance initial accessibility with sustained growth potential.\n\nCommunity involvement is at the heart of Furrever Token. By empowering early adopters as moderators, the project fosters organic growth and meaningful engagement. This strategy has already attracted nearly 4,000 active members on Telegram, demonstrating the strong interest and participation in the Furrever ecosystem.\n\nPromising Presale and Future Prospects\n\nFurrever Token has raised over $1.3 million and is in the ninth stage of its presale, targeting a total of $1.9 million. The token’s upcoming launch on PancakeSwap offers up to 15X returns for early investors, creating significant buzz and FOMO (fear of missing out) within the crypto community. With a current price of $0.000732, FURR presents an attractive opportunity for those looking to invest early in a unique and promising project.\n\nEnsuring Security and Trust\n\nSecurity and transparency are paramount for Furrever Token. The project's smart contract has been audited by Securi Lab, providing an additional layer of assurance for investors. While the team remains anonymous—a common practice in the crypto world—they have implemented measures such as locking their tokens for a year to build trust and demonstrate commitment to the project's success.\n\nConclusion\n\nAs Bitcoin and Ethereum continue to lead the charge in the cryptocurrency market with their impressive breakouts and sustained growth, Furrever Token is set to be the next big thing with its unique and whimsical approach. With strong tokenomics, community involvement, and a promising presale performance, Furrever Token offers a refreshing and potentially lucrative opportunity for investors. The combined momentum of these digital assets underscores the dynamic and exciting nature of the crypto market. For more information, visit Furrever Token's official website.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    }
]