[
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPYzdtc1VlbFNZeXpvajRva24xeDM3ejBBZm8xQ05kaldMTXRoLVktUzg2T3Etb0VZYnN6aGZZLXdWQ3lvdjlIUm9LcGVvRVNBQXlrVHBHUlFRLWpycVU5UTlRRDc2X1A1dUJFUlVlUmZoWnJNNzZlbTlaSGoxWXRTRWNxczNDZ3M5QWlKQVBianNXUHFXZlVXUlRlODhVRHBreThscUppUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Mar 2024 08:00:00 GMT",
        "title": "The ether is breaking records: Ethereum's crypto soaring to historic highs! - Cointribune EN",
        "content": "Thu 07 Mar 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nEther (ETH), the second most popular cryptocurrency in the market, is drawing investors’ attention due to its exceptional performance. Like bitcoin (BTC), which it follows, it has reached an all-time high price of $3,800. Here’s how analysts explain this surge in power.\n\nThe reasons behind the surge of Ethereum’s native crypto\n\nLike the price of bitcoin, ether has shown a remarkable surge in power. A dynamic that has recently taken the crypto to a valuation of $3,800. An absolutely historic record.\n\nWhile the question arises as to how the asset managed such a performance, Michael Van Pope, a well-known analyst in the crypto industry, gave his opinion on the matter. According to his view, ether’s breakthrough is due to two factors.\n\nThe first is linked to expectations around Dencun. This is an upgrade that Ethereum is expected to undergo soon. An update that should address many of the platform’s challenges in terms of transaction fees, scalability, and attractiveness.\n\nThe second factor behind the rise of ether comes from speculation about the potential approval of an Ethereum spot ETF. An option that should improve the accessibility of institutional investors to this crypto, similar to what is observed with Bitcoin ETFs.\n\nEthereum Hits $3,800: Dencun Upgrade and ETF Hype Propel Surgehttps://t.co/JBS63Upqo3 — John Morgan (@johnmorganFL) March 7, 2024 Factors behind the rise of ether according to Michael Van Pope\n\nA surge that’s just beginning?\n\nAnalyzing the dynamics of ether, Michael Van Pope highlights Ethereum’s certain robustness relative to resistance levels. Moreover, the crypto seems to show a relatively stable behavior compared to bitcoin.\n\nThus, according to the analyst, ether is demonstrating remarkable resilience. It manages to progress in a more consistent manner. This suggests that it is in a solid position compared to bitcoin and the challenges of the crypto market in general.\n\nBased on this observation, he believes Ethereum is ready to achieve significant new gains in the coming weeks and months. These would also be driven by the Dencun upgrade and the possible approval of an Ethereum spot ETF.\n\nIn essence, Michael Van Pope’s projection is not new. In early February, he had notably anticipated a market explosion around Ethereum, driven not only by the two arguments previously mentioned but also by a reallocation of profits from BTC to ETH.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBQZV9UOUhvQmdyQzNSRjdMRlRwbTZMcTRFaXVsdk5QbEhnbzVLeGVDaFRrN3JYRXVGX1hYTTBWME0wQXY3NzlEdzJZSUxEUFNVZEhJUmhmT0hONHBScVlxS0I3Z0Q1NWl5V1cxcDFRcWUyRHIwMmRtcElLTWzSAYIBQVVfeXFMTlZ5N194QkExQzgyN2ZiZ21qUEFSRHdhYkNwbWl1dXA2MTNPWnN5UXM3UmNIV2c2Q29Gd3luM1ZYZ0N6eGh2THI0NEg3WVN1VVJKM0k4NjNFLTlIM3RBWV8ybUdJaTIwQk03bGptUTdyMWFOTHRlYVVaQWtvOVZnTmRZZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Mar 2024 08:00:00 GMT",
        "title": "Ripple CEO Predicts Setback For US SEC In Ethereum Case, Similar To XRP | Bitcoinist.com - Bitcoinist",
        "content": "The legal battle between the United States Securities and Exchange Commission (SEC) and Ethereum (ETH) has transformed into an intriguing case within the entire cryptocurrency landscape, with several experts predicting possible outcomes regarding the dispute.\n\nRipple CEO Warns US SEC’s Inevitable Defeat Against Ethereum\n\nAs the battle wages on, the Chief Executive Officer (CEO) of Ripple Labs Brad Garlinghouse, has revealed his optimistic insights on the case, while sharing a daring prediction in favor of the Ethereum ecosystem. His positive insights came in light of reports that the SEC is attempting to classify Ethereum “as a security” through its legal dispute with the digital asset.\n\nBrad Garlinghouse has predicted that the US regulatory watchdog is most likely to “lose its war against Ethereum” – the second largest cryptocurrency asset. According to Garlinghouse, the Commission’s several “attempts to include the cryptocurrency industry in legal battles have resulted in severe court losses” over time.\n\nAs a result, the agency is now “lagging behind its foreign counterparts” and “competing with other regulators” such as the United States Commodity Futures Trading Commission (CFTC).\n\nThe Ripple CEO then posed a question, “When would the SEC realize that it would not be able to continue fighting to categorize Ethereum as a security, as it did with XRP?”\n\nIt is noteworthy that Coinbase submitted self-certifications with the CFTC on March 7, which could pave the way for Bitcoin Cash (BCH), Dogecoin (DOGE), and Litecoin (LTC) futures Exchange-Traded Funds (ETFs), if the CTFC has no complaints against it.\n\nConsequently, the SEC’s prospects of overturning the “Programmatic Sales of XRP” ruling might be impacted by the categorization of these aforementioned tokens as commodities by the CFTC. This could be one of the reasons why the SEC could be fighting the CFTC.\n\nRipple’s Partial Victories Against The SEC\n\nRipple first secured a partial win in its lawsuit with the agency when Judge Analisa Torres declared in July last year that programmatic sales of XRP do not meet the requirements of the third prong of the Howey Test. Also, three months later, the SEC’s request for an interlocutory appeal against the programmatic sales order was denied by the US Judge.\n\nDue to the order, the SEC will be unable to file an appeal until the conclusion of the ongoing SEC v. Ripple lawsuit. It is believed that the resolution of this dispute may have a profound impact on the US regulatory landscape and the cryptocurrency landscape as a whole.\n\nThe long-running legal dispute between Ripple and the US SEC began in 2020 when the Commission accused Ripple of selling XRP to US investors as an unregistered security. However, the lengthy battle is slowly approaching its climax as the grand trial is scheduled to take place by April 23.\n\nFeatured image from iStock, chart from Tradingview.com"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxQV2RQYzVDZHlUaHNaUU5iVzE1c1B4UElmMjZHUkhsbUoyclA4UUVzNk9CT1ZUZXhYVC1YLWZVMDNmcXpJTlNIai0tdGF6SmtDUHJyVHo3NDRfd0JrTjF4LXl0MmliREdCQkxJdVZqX3IxZTkxemlKdXh6Vzd3bHFWZ2RVOXhaVmh2MWN5SHQ0UnZ5U2pkY1QxWkRBZ1ZIcGpyUC1KYTQ1YU85WXl1Qkl3Nzc2VmY2MEpFanBCX1ljRnFMMzc0WXQ4QkJpTXfSAdIBQVVfeXFMTnRFa2dwWHQySVFTSUZZOVVRRjMtcTVFVzJVZzlXZHlkeU1zYjd3Y201a2dRbi1aOFZRRnFVOFBZeWFaOF9mN2UzQ3ZVNlJSZkgtdXA5aGtMOVNNVHVUMnVxOUFJYUxmLUttekllMVpFb2ZSWlZ6Z0Q0Q2ZmRy1neGJHMXNhNV9VLW11dW1QbC1jRHljbzVSUWlfV3pxMnoyb1hiQXVFSG5iSXJ1dkY3WkVrSndZR0pJNVUzcVFmOEFwbHlReGhVelhlaVVmejNTR3h3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Mar 2024 08:00:00 GMT",
        "title": "Nearly $200 million in ETH burned as Ethereum gears up for Dencun upgrade - FXStreet",
        "content": "Ethereum worth $190 million was burned during the past week, effectively reducing the altcoin’s circulating supply.\n\nEthereum’s Cancun-Deneb upgrade is scheduled to occur on March 13.\n\nWhales are accumulating the altcoin while retail investors and small-wallet holders appear to be taking profits following Ether’s rally.\n\nEthereum (ETH) price has increased sharply in the past week as investors appear to be pricing in the positive effects of the upcoming Dencun upgrade and the possibility that the US Securities and Exchange Commission (SEC) approves this year exchange-traded funds that track Ether. Meanwhile, on-chain data shows that almost $200 million in ETH were burned in the past week, another indicator of further price gains as it reduces the circulating supply of the altcoin.\n\nEthereum holders are anticipating the two catalysts that are likely to drive ETH price rally this cycle. The upcoming Cancun-Deneb (Dencun) Hard Fork and the SEC’s decision on the Spot Ethereum ETF are the two catalysts for the altcoin.\n\nEthereum price is $3,790 at the time of writing.\n\nAlso read: Ethereum price beats crypto market bloodbath nearly a week away from Dencun upgrade\n\nEthereum price gains could be triggered by these catalysts\n\nEthereum price rally to the psychologically important $4,000 target and beyond could be catalyzed by the upcoming Dencun upgrade, an important technical improvement that resolves the scalability aspect of the so-called “Blockchain Trilemma”.\n\nThe Blockchain Trilemma is the trade-off between three important aspects: security, scalability and decentralization. Ethereum has prioritized decentralization and security, meaning that the scalability aspect can be improved with upgrades and Hard Forks to the blockchain.\n\nFind out more about why the Dencun upgrade is important and how it could reduce the transaction costs for Layer 2 chains, in this post.\n\nLooking at on-chain data, some indicators also signal upside momentum for Ethereum. The altcoin’s circulating supply, which plays a role in gauging the asset’s selling pressure, is declining. According to data from Ultrasound.money, $190 million worth of ETH was removed from the circulating supply by token burn.\n\nEther burned in the past week. Source: ultrasound.money\n\nAn analysis of the different cohorts of investors holding ETH, the so-called supply distribution, also signals the possibility of further price gains. While retail and small-wallet holders (those with 10 to 10,000 ETH) have shed their holdings and likely taken profits since the beginning of March, large-wallet investors are adding ETH to their holdings. Typically, whale accumulation has been a bullish sign for the asset and has preceded Ethereum price rally, as seen in the chart below.\n\n\n\nEthereum Supply Distribution. Source: Santiment\n\nEthereum Network Realized Profit/Loss. Source: Santiment\n\nETH holders are also awaiting the SEC’s decision about the potential approval of a Spot Ethereum ETF. The US regulator has several applications on the table, and the deadline to decide about them is May 23. Ethereum traders believe that an approval could usher institutional capital inflow and catalyze gains in ETH, as it has happened with Bitcoin.\n\nAt the time of writing, Ethereum’s price is $3,790, up nearly 13% in the past week."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNSkxpbDBmUmtpOUMxeWFHbzhCTENwLWh1SDRoWVBJc1JyWUhRaVd2clVMcHVqUFRDRVI0NGdtVV9XaFRMZ1pvWkplVFJQaTc4Y3E0cUVRTUJvVl9XWVFvZlpENjRidFlTa0wwOHFsXzhEY0Vib0M0bWgxUGQtSjQ5Qm5UN3d3UHlocmtuNEpGV0hFa1pNUUpXUDhfd1RFbkNh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Mar 2024 08:00:00 GMT",
        "title": "Cheatsheet: Ethereum sees net validator outflow for first time in 6 weeks - Blockworks",
        "content": "This is Cheatsheet, a primer on what’s happening in crypto today.\n\nMarkets have rotated from AI to dog coins and now back to AI, all in the same month.\n\nFetch.ai (FET), Render (RNDR), SingularityNET (AGIX) lead top cryptocurrencies over the past day, with each rallying between 33% and 35% as of 7:30 am ET.\n\nAll three tokens power marketplaces for decentralized computing power, which have captured imaginations ever since ChatGPT made generative AI a household term last year.\n\nMemecoins fell the most, with pepe (PEPE), bonk (BONK), dogwifhat (WIF) and shiba inu (SHIB) losing more than 15%. (Memecoins are still the best performers over the past week.)\n\nBitcoin (BTC) traded flat while ether (ETH), still more than 20% below its all-time high, slipped 2.3% to below $3,800.\n\nOn-chain mail\n\nAll eyes are on Ethereum after bitcoin briefly hit all-time highs earlier this week — as a subset of validators pull their ETH from the chain.\n\nThere were slightly more validators exiting the Ethereum blockchain than joining yesterday, a first since late January.\n\nTotal ETH staked dropped by more than 2% overnight, or more than 670,000 ETH ($2.54 billion).\n\nEthereum’s staking APR has risen from below 3.5% to 3.69% since the start of the month.\n\nStill, ETH staking has exploded over the past year, from about 15% of the supply to as much as 26% earlier this week (now back to just above one quarter).\n\nAbout 40% of all ETH staked (12.16 million ETH worth $46.2 billion) is with liquid staking protocols like Lido and Rocket Pool — up from 10.84 million ETH at the start of the year (under 38% of total ETH stake).\n\nNew restaking apps like EigenLayer allow users to unlock additional rewards on their staking tokens. The amount of ETH in EigenLayer has popped 75% since January, from 1.7 million ETH to almost 3 million ETH right now.\n\nThere’s 4.3 million ETH ($16.25 billion) in restaking apps overall, about 14% of the total ETH stake and over one-third of what’s in liquid staking platforms.\n\nEigenLayer has sent users almost 2.4 billion points to date, part of an incentive system for future airdrops.\n\nThose points are selling for more than $0.15 per unit on Whales Market, effectively valuing the EigenLayer points market at nearly $360 million.\n\nThe ETH supply staked is more volatile since prices went up (source)\n\nCrypto business\n\nStocks across the crypto space found their footing Wednesday alongside bitcoin.\n\nBitfury-owned miner Cipher Mining surged more than 27% and held onto most of those gains after hours, propelled by strong Q4 earnings.\n\nMicroStrategy rallied 18.5% throughout the day — rounding out a 160% pump over the past month.\n\nMicroStrategy’s surge came in response to its upsizing of a fresh convertible debt offering, from $600 million to $700 million (you guessed it — it plans to buy more bitcoin with it).\n\nMicroStrategy is up more than 100% on its bitcoin to date.\n\nThe firm already has $2.6 billion in liabilities after multiple rounds of corporate bond sales going back to 2021.\n\nTotal common shares outstanding for MSTR has nearly doubled across that period, from 7.623 million shares in December 2020 to 14.904 million at the end of last year.\n\nNot that markets seem to mind, MSTR’s share price is up 750% since then.\n\nCoinbase’s common share count has grown 38% since it went public in April 2021.\n\nCOIN has meanwhile swelled its cash pile from $4 billion to $5.71 billion per its latest disclosure.\n\nOn the ground\n\nLoading Tweet.. Everything is a perp, everything, all of it, past, present, future, the infinite expanse of the universe\n\nLoading Tweet.. A real lightbulb moment\n\nLoading Tweet.. Hear me out: Web3 Angelfire with its own token\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFA5Vlo0akoya211TDdoTW9TRF9XdDFWbEI5RWpDT0tZcmMzWlNaLWpMQ3Z5U04tWlRlSE5PSjBOZFQwUW5xZFNhenJub25QdlhxQm9EZXVHRHIzMEZBa0tpQWp2bzhSRFRkNjViMDBGZFpDUTBs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Mar 2024 08:00:00 GMT",
        "title": "Two-thirds of EVM smart contract deployments in 2024 are from Optimism: Report - Blockworks",
        "content": "A Flipside Crypto report shows that over 637 million Ethereum Virtual Machine (EVM) smart contracts have been deployed across seven layer-2 blockchains since January 2022.\n\nEVM-compatible smart contracts refer to software that the computing state of the Ethereum blockchain can understand.\n\nWith scaling solutions becoming more efficient and accessible, fewer EVM contracts are directly deployed on the Ethereum blockchain. With the Dencun update around the corner — which will introduce blob transactions and other infrastructure upgrades — this trend is likely to accelerate.\n\n“With layer-2s able to only publish critical data to ETH layer-1, the costs for interacting with layer-2s should significantly decrease. This enables much more creativity in protocol development, a much easier experience for users to have complex transactions abstracted away from them and ultimately lowers the costs for layer-2s to interoperate with each other,” Carlos Mercado, a data scientist at Flipside Crypto told Blockworks.\n\nRead more: Ethereum devs debate future of account abstraction\n\nLeading this movement today is Optimism, an Ethereum optimistic rollup layer-2, which currently stands out as the most popular blockchain for deployments, accounting for over two-thirds (~70%) of the total EVM smart contract deployments so far this year. According to Flipside Crypto, the chain has seen over 28.8 million EVM deployments since Jan.1.\n\nHowever, for non-EVM smart contracts, Polygon and BNB smart chains (BSC) remain the most popular deployment chains. On Sept. 6 of last year, BSC saw 5.3 million contracts deployed, the most deployments seen on a chain ever, though this number quickly trailed off around Sept. 13.\n\nDeFi contracts on the rise\n\nDeFi smart contracts have been the most popular for developers across all chains this year, accounting for roughly 34.7% of all deployments that can be “categorized.” This number is roughly 11.2% higher than in 2022 and 2023.\n\nBy contracts, NFT smart contracts, which drove the bull market between 2021 and 2022, have become less popular over time. Deployments decreased from 18.6% to 8.2% in the same period.\n\nRead more: Stellar sparks smart contract upgrade — and it’s not an EVM\n\nMercado notes that this can be interpreted as both positive and negative.\n\n“The positive argument is that the space is finding product market fit, there’s more tokens than ever and new primitives that enable lending, borrowing, options, perpetuals, oracles for more assets than ever,” Mercado said.\n\nHe adds, “the somewhat negative argument is that given more money [is] flowing to more blockspace, fragmentation of liquidity is forcing more (arguably unproductive) activity: bridging and swapping for arbitrage as opposed to individuals’ specific desire to be on a chain or have a token.”\n\nMercado acknowledges both sides of the argument but notes his bias towards the space evolving faster than it is fragmenting.\n\nRead more: zkLink’s Nexus wants to solve liquidity fragmentation between ZK ecosystems\n\n“Other” smart contracts\n\nUncategorized smart contracts, or those classified as “other” by Flipside Crypto, are by far the most commonly deployed smart contracts. They make up 93.8% of all smart contracts deployed across the observed chains.\n\nThis number is significantly higher than it was in 2022, where these smart contracts made up an estimated 37% of deployed contracts. It’s also a little higher than in 2023, where these smart contracts made up around 86% of all deployments.\n\n“While it is difficult to draw clear conclusions from this wide-ranging category, this figure, coupled with the growing proportion of dapps across all chains, suggests more experimentation and diversification at the protocol level,” Flipside Crypto wrote.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]