[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1KSkpQWVdKQUxONkw0Uk1wajNSZldjcktGUlZjcW5rS3VhUlZoaUUyaDFjdG5VTnZKVXJWMkZEVzRrYW1xXzYtS3o5eV9Od29EWUctSVhucHB6c00wQXYwQVJJNWZhbHNhREo3akJIaEphM2fSAXhBVV95cUxPM3JFZ21PV2dVTW5SMkVCNGFIU0psVXFjYnc5NEdNVXZKS244UzV6WmN4dnR0dk9UeEZrSFRURk1IZVhBNjcwbW83MW40YlhnZkduQVRpY0RHT0xXam5KVV9taUlzbnF1dDlNTmR5d2V1Qy1pUEhlbVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Solana Just Dethroned Ethereum in This Key Metric - U.Today",
        "content": "According to data provided by DefiLlama, Solana has managed to destroy Ethereum in daily DEX trading volume ($1.148 billion and $745 million, respectively).\n\nAdvertisement\n\nSolana-based Raydium, Meteora, Orca, Phoenix and Lifinity are among the top 10 DEXes by daily trading volume. Uniswap and PancakeSwap, of course, remain in the lead.\n\nAs noted by Patrick Scott, the founder of Dynamo DeFi, Solana's DEX volume dominance is also on the rise . In fact, it is on track to surpass the 25% level for the first time this June.\n\nAdvertisement\n\nOverall, DEX volume has hit $26 billion over the past seven days, according to data provided by Dune Analytics .\n\nEarlier this year, trading on Solana-based DEXex spiked due to the growing popularity of meme coins.\n\nSOL summer?\n\nThis comes as the \"Ethereum killer\" is benefiting from increasing ETF buzz. As reported by U.Today , New York-based investment firm VanEck filed to launch an ETF for Solana on Thursday; 21Shares followed suit with its own filing for the red-hot altcoin on Friday.\n\nHowever, those who expect this ETF to see the light in the near future should cool their jets. According to leading analysts in the field, the product is now expected to be approved this year.\n\nAfter initially seeing a sharp price spike due to the ETF hype, the SOL price is currently in the red, slipping by 0.2% over the past two weeks.\n\nThe popular altcoin is currently valued at $65.2 billion, according to data provided by CoinGecko. This puts it in the fifth place by market capitalization (behind only Bitcoin, Ethereum, Tether and BNB)."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFAzRV80ajkzbWs5UlAxNURid0FiU0hhYUE4Umcta3ZBdzVzQ1ZFNDFVN3hhbFZLR3FRY2hVSHRuMGEzemlMSm5LMXVGTlUtaTdQZVI2eTQyOVlaM0p3am1tQXZ1RnRzUHljWWRiX3pn0gFzQVVfeXFMUEpUNWEyNllxWjJOMzZrc0FtNUo3ZmlsVGF5aEdCTkQ3VEtaVjR2YlByNE1ZSld1b00zeU5fQ3hvSDlUVi01TlVOSXhGcVFWZ05QYUVvdktwYUd4WHBZM1hZa3lYTS00NmNyTmlxRklxYnFiQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Records Lowest Gas Prices Since 2016 - U.Today",
        "content": "On June 30, the Ethereum network recorded its lowest fees since 2016. According to data provided by Etherscan, the average gas fee is currently sitting at just 3 Gwei ($0.14), according to data provided by Dune Analytics.\n\nAdvertisement\n\nGas fees refer to the cost of various operations on the Ethereum blockchain. By paying gas fees, users help to ensure the security of the network. Apart from incentivizing validators, gas fees are also meant to prevent various spam attacks.\n\nDuring the 2021 bull run, Ethereum's gas fees were exorbitantly high due to high demand in the non-fungible sector (NFT). This prompted some pundits to argue that the network was unsustainable and gave rise to more affordable alternatives such as Solana.\n\nAdvertisement\n\nThis time around, Ethereum gas fees are hitting extremely low levels despite the fact that the network is also experiencing strong transaction activity. In fact, the volume of the leading altcoin is on the same level as it was during the beginning of the year.\n\nThe plunging fees can be explained by a higher level of efficiency of the Layer-1 market due to the combination of Layer-2 volume and the introduction of “blob transactions” with EIP-4844 that helped to significantly boost Ethereum's scalability.\n\n\"We will still see gas spikes above 15 gwei in times of higher activity. It’s just that overall the gas market has been more efficient post 4844. So we’ll have more affordable days than expensive ones,\" Pistachio Fi founder Brian Smocovich said in a post on the X social media network.\n\nBack to inflation\n\nThe massive drop in fees means that Ethereum is no longer a deflationary network since the amount of fees to burn is very small. This flies in the face of those who were pushing the narrative about \"ultra sound money\" prior to the Dencun upgrade.\n\nOver the past seven days, 14,393 ETH has been added to the network, according to data provided by ultrasound.money. This translates into annual supply growth of 0.62%.\n\nThe total supply of Ethereum currently stands at 120,185,061 ETH, which means that it is on track to reach a new 2024 peak."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNUmk2cExjdGp4SXhOMlZ2RXItQUJfUE5MYWM5eDZqeUxfN2F1aTROaXZHbU9hdTFCWkt0ME5VaTBwSWIzbkpFbXZMTWl3RW5uUkFCbUtPYjlkV2FPeXVkRzkxaUNCOWVNMDFiWmxqV3pTTFV4UXBjSDdDVU9fckdHd2E4T2ZJeVN20gGOAUFVX3lxTE5VT2hab24yU19LUlhKS0IwaWh2enNsSE9GSE4wY3FmLUVGWVNnX0xPd1hJaXl6TEs1c0xUamx2ZjFUNHBxLUx5MmY5b25pZzRjYnVKZFNWM3FsWDEzM1NsVmloeW5rRFRrcjBQRkFnaHVqcHNuVEstNURTSFk3bGI4eDliV2NHVmFSNjJjTXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s ‘failed’ breakout – When will ETH’s price breach $3.5K? - AMBCrypto News",
        "content": "Ethereum’s price dropped by over 3% in the last 7 days\n\nA key metric revealed that ETH was undervalued, hinting at a recovery on the charts\n\nEthereum’s [ETH] price action turned bullish on 28 June, giving investors hope for a recovery from their past losses. Unfortunately, this bullish trend didn’t last for long, as the coin recorded a price correction soon after. This led to both its weekly and daily charts flashing red.\n\nEthereum faces rejection\n\nAfter the aforementioned hike in price, ETH’s bears stepped up again and pushed the altcoin’s price down by more than 3%. At the time of writing, the king of altcoins was trading at $3,391.51 with a market capitalization of over $407 billion.\n\nThe worst news was that Ethereum got rejected from the upper limit of a bullish wedge pattern in the recent past. As per a tweet from ZAYK Charts, a popular crypto analyst, the token’s price started to consolidate inside the pattern in late May. A successful breakout could have resulted in a 30% price rise, which might have allowed Ethereum to go past $4k.\n\nInterestingly, a similar pattern had emerged earlier in March, only to break out in May. This allowed the altcoin to hit $3.89k on the charts. However, since ETH got rejected this time, the chances of history repeating itself might be slim.\n\nWon’t ETH recover?\n\nAMBCrypto then took a closer look at Ethereum’s current state to see whether it would fail to break out of the bullish pattern.\n\nWe found that market sentiment around the king of altcoins remained bearish. This was evidenced by the dip in its weighted sentiment after spiking on 28 June. Its network growth also dropped slightly, meaning that fewer addresses were created to transfer the token.\n\nNonetheless, a few of the metrics were in favor of a successful breakout.\n\nFor example, the MVRV ratio has improved over the last few days, which can be interpreted as a bullish signal.\n\nAMBCrypto’s assessment of Glassnode’s data also revealed that Ethereum’s NVT ratio had declined sharply. A drop in this metric usually means that an asset is undervalued – Implying an incoming price hike.\n\nAMBCrypto then took a look at Hyblock Capital’s data to look for immediate support and resistance levels.\n\nAs per our analysis, it would be crucial for ETH to touch and go above the $3.5k-mark in order to sustain a bull rally as liquidations would rise sharply. Generally, a hike in liquidations often results in price corrections on the charts.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nOn the other hand, if bears continue to dominate and ETH’s volatility rises in a southbound direction, then it might fall to $3,060."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1OdHU3U1o3eWRPSERjRk5DTk93UHBlejJtekxPa3Y2T2V2LUdGanV0WDNiR3h5VUlXVmt2Sk52RGdUQmYtMDAteUlZZTdDX0gxMFNaanVZNWZEYjNER3U2NlBHTFJaN3E3eHNLWDZoT3VjVGM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Is Poised For Major Breakout, Analyst Predicts 180% Surge - TronWeekly",
        "content": "Ethere­um, the second-largest cryptocurre­ncy by market capitalization, is poised for a major breakout, with its price­ increasing by approximately 180% soon. Crypto analyst Javon Marks has highlighted this bullish tre­nd, suggesting that Ethere­um is on the­ cusp of an even more substantial bre­akout.\n\n“$ETH (Ethereum) may only be preparing here for the overtaking and surpassing of $4,723.5 which could then open $8,000+!” said Marks.\n\nMarks’s prediction indicate­s a potentially massive surge in Ethereum’s value, projecting it could more­ than double its current price. Marks’ twe­et emphasized the­ critical $4,723.5 level as a pivotal point for Ethere­um’s continued growth.\n\nSource: Javon Marks\n\nThe chart shows Ethere­um’s steady upward trajectory, refle­cting the 180% increase since­ its previous lows. This rally is marked by periods of consolidation and minor pullbacks, which, according to Marks, are­ essential for a healthie­r and more sustainable bull run. These­ pullbacks help to stabilize the price­ and prevent overe­xtension, setting the stage­ for a robust ascent towards higher targets.\n\nMarks’ analysis sugge­sts that surpassing the $4,723.5 mark could trigger a new wave­ of investor interest and marke­t activity. Ethereum’s potential to re­ach $8,000 or beyond is based on its strong technical foundation and the­ current bullish sentiment surrounding the­ cryptocurrency market.\n\nEthereum’s ETF Launch Hope\n\nDespite­ a recent rally, Ethereum’s price is struggling to get back to its all-time high. The­ rush past $3,395 came from spot ETH ETFs approval, still, lacked power afte­r a small dip mistaken for rollback at the beginning of the­ month. Market worries and stronger pe­ssimistic trends intensified the­ pullback.\n\nThe upcoming launch of ETFs may change the game­ and give the same be­nefits of the price of Bitcoin in case­ of its spot ETF’s launch. By indicating greater investor appe­tite through the ETFs, the price­ could return to the north and cross the $3,829 barrie­r, an important target.\n\nThis figure is also the 61.8% Fibonacci Re­tracement leve­l which would pave the way for another le­g up following previous resistance now turne­d to support. It may be that the target is far too high for ETH, but the­ demand is still in place for $4,000 in ETH. Howeve­r, a firm move above this leve­l is more likely to inspire furthe­r bullish sentiments.\n\nHoweve­r, a failure to go through the $4,000 barrier could provoke­ an adjustment below this leve­l. at least 3,700-3,800 the price could go flat. On the­ downside a break under this zone­ would make historians of the bull market.\n\nRelated Reading | Nigeria’s Cryptocurrency Market Surpasses $400 Million, SEC Director General"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOVUFEaUgySlU3Y25YN1BNb1hwdXk5VWd6TElrX0JEOVpuaVhUbzhNeG8zdmxTT3VyOWc3R3AtWWRadGMxbzVYcUM5N1BDREFrWWNXcTUtTzAyaV9WbGdwZUdWWU1ndnZXLVQ1QldWVUI3ak1qNDk4NE9NMGdncVRZY1VmejRESkZZdGs1UWh1MXBGdEXSAZgBQVVfeXFMUEtaM1NsSFlsMGNNVFhtNEo2dVFXWWxRaHdYYTc5bDYwLVFZbzRyUnBTclp6NTdPNkc5SDh6QWtWdFgyLXhZSjNXYm83TVVvdndFNTZkbDV3T3lEYUFVTVdqZUx4OGtlbmVFdzBza2gyakZWT3JSR002YzVlZlVCcEdTRnVQdzN3eTFoc3QzWXBWUWJjR1FiUk4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum’s price under pressure? A look at on-chain data suggests… - AMBCrypto News",
        "content": "The number of addresses on the network has been falling for the last seven days\n\nETH supply on exchanges fell, reducing the potential of a sell-off\n\nThough Spot Ethereum [ETH] ETFs would begin active trading in a few days, activity on the blockchain’s network has been discouraging. AMBCrypto found that out after evaluating the project’s network activity.\n\nAt press time, we observed that Ethereum’s active, new, and zero-balance addresses had dropped. By definition, new addresses refer to unique users making their first successful transaction on the network.\n\nActivity falls, but there is a catch\n\nThis metric acts as a measure of traction or adoption. On the other hand, active addresses track the number of users participating in transactions. When this metric rises, it means an increase in the level of user engagement and growth.\n\nHowever, at the time of writing, active addresses had fallen by 15.45%. in the last seven days. New addresses were not spared either with a 6.50% decline.\n\nThis development comes as a surprise considering how close the projected ETF launch is. If this decline lingers, the price of ETH could be affected. This, because a drop in Ethereum’s network activity could mean less demand for the cryptocurrency.\n\nAccording to CoinMarketCap, ETH’s price was $3,379 at the time of writing. This represented a depreciation of 3.35% within the last week.\n\nAnother indicator AMBCrypto examined was the Exchange Supply Ratio. This is the ratio of coins reserved in exchanges, relative to the total ETH supply.\n\nWhen it hikes, it means that the number of coins sitting on exchanges is moving up. A potential consequence of this is a rise in selling pressure which could later on lead a price fall.\n\nHowever, at press time, the ratio seemed to be falling, according to data from CryptoQuant. This decline lowers the risk of a sell-off as holders seem to be comfortable locking their assets for safekeeping.\n\nETH traders are not confident\n\nAs funds move away from exchanges, the potential for a bull run rises. However, for this to affect ETH in a positive manner, buying pressure needs to rise.\n\nIf this is the case, ETH’s price could climb towards $3,600 within the first few days of July. However, if the opposite happens, the value could consolidate between $3,200 and $3,400.\n\nAdditionally, Ethereum’s Open Interest dropped from the value it had on 27 June. OI, which is its short form, refers to the value of open positions in the derivatives market.\n\nAn increase in this metric implies that traders are involved in a lot of speculative activity. On the contrary, when it falls, it means that traders are closing existing positions and taking money out of the market.\n\nWith a value of $13.14 billion, ETH’s OI implied that participants are not refraining from opening positions to capitalize on movements from the price.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nShould the value continue to fall, ETH’s price could also follow in the downward direction. However, this prediction might be invalidated if open contracts increase and buying pressure in the spot market follows.\n\nIf this is the case, ETH could begin a hike towards $4,000."
    }
]