[
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOTGtxY3E5RGVJZkE3ZFFvcVJ4bnVCeVJmdzcwU3FRYlZpTnVzRDZ5enJkNXZvZUlCOWZiMThOcU8tcjZhTDdEWGFvZHRnbTJSb1JkUEQwVUpaSkZXMlpfeE0xVnlweE5rVWNiVDFrLXJQLThxRzhmN1pZWlBjc01TMHU5WVI5QmE3d0pTdnZuVzFBUWRMZ0FrX2drX2hiMlQyU3dWV3lBeFZYWGpUNjYwajNWaUtoZmd4ZmY2amtaWUgxRnY5eW1BZS0tVHdwVWVTREI00gHYAUFVX3lxTE9rdVZpbVBrRmxhcWZZR0VVUzk5WUwwdVNuYlJ4NjItRzV4MW1HVExVQ0RTbzdLQ3hlOWN6bko4MlkyMG9qdVRwQjVhQzhtd083MXcxSDNkRWFEU1ZtY1NJR3lGWmRYcTMzSUk3YzlHV2ZZSTg4ODZiZkgwWUE0ZUwwQkNwSUgzX1JwMXZGXy0zQUR1V3JMZzNKZXR6OVEyTDNieWJ0RmZhcHNnLUVyVWtPR21NM0hEWERKQVlDeERwLUVvMWppUjdjT1hkMlBvbTNMbXJzbGxraQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Crypto Exchange WazirX Hacked, Loses Over $230,000,000 in Ethereum, Shiba Inu and Other Assets: On-Chain Data - The Daily Hodl",
        "content": "Hackers have breached and siphoned large amounts of assets from the India-based crypto exchange WazirX.\n\nAccording to blockchain tracking firm Lookonchain, an analysis of on-chain data shows that the exchange lost more than $230 million worth of crypto in the incident.\n\nThe stolen funds include $52.5 million worth of Ethereum (ETH), $102 million worth of Shiba Inu (SHIB), $11.24 million worth of Polygon (MATIC), $7.6 million worth of Pepe (PEPE), $3.5 million worth of Gala (GALA) and $5.79 million in Tether (USDT).\n\nLookonchain says that the hacker is dumping funds and has so far sold all of the stolen PEPE and SHIB tokens.\n\n“Currently, wallet “0x04b2” is dumping these assets, and has dumped 640.27B PEPE ($7.6 million).\n\nWazirX Exploiter has sold all 5.43T SHIB for 26,535 ETH ($92 million)!”\n\nWazirX confirms that its platform was compromised and is investigating the incident.\n\n“A cyber attack occurred in one of our multisig wallets involving a loss of funds exceeding $230 million. This wallet was operated utilizing the services of Liminal’s digital asset custody and wallet infrastructure from February 2023.”\n\nThe exchange says it is also temporarily suspending withdrawals to protect user funds.\n\n“This is a force majeure event beyond our control, but we are leaving no stone unturned to locate and recover the funds. We have already blocked a few deposits and reached out to concerned wallets for recovery. We are in touch with the best resources to help us in this endeavor.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQTGlmaWxXVnFHRFpzelpFc0Q5RlhPWEdOdFpjSkt2Y0ZmS1hZcVhwX3dZSUVyTjVEQ1hfLTZ3TUR1S0JncFNkdTVJN09LcWxna21FYWRWc2RGdWdpWjZFY3NtTEk4RVpOaWJobzhLZ1FFSEU2UjF3Q21RNC1Eblc4eGoyRFo2ZGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Five Spot Ethereum ETFs To Launch on July 23, CBOE Says - Watcher Guru",
        "content": "Five Spot Ethereum ETFs, including Fidelity and VanEck, are set to launch on July 23rd, according to the CBOE exchange. Cboe posted new issue notifications Friday afternoon, which are procedural for ETF launches, revealing the Ethereum ETF launch date.\n\nJUST IN: Five Spot Ethereum ETFs to launch on July 23, Cboe confirms.\n\n\n\n• VanEck\n\n• Invesco\n\n• Fidelity\n\n• 21Shares\n\n• Franklin Templeton — Watcher.Guru (@WatcherGuru) July 19, 2024\n\nCboe will house most of the first trading of Ether ETFs. The exchange has revealed that trading will commence next week. These include the Fidelity Ethereum Fund, the Franklin Ethereum ETF, the Invesco Galaxy Ethereum ETF, the VanEck Ethereum ETF, and the 21Shares Core Ethereum ETF. “We are pleased to announce that 1 Exchange Traded Product (‘ETP’) will be listed on Cboe and will begin trading as a new issue on July 23, 2024,” the exchange said.\n\nAlso Read: Ethereum: Will ETH ETF Have a Bigger Impact Than Bitcoin Did?\n\nHow Are Firms Pricing Their Ethereum ETFs?\n\nSource: Unsplash\n\nEther ETF applicants first received 19b-4 form approvals back in May. However, there has been a delay in wrapping up final loose ends. In addition, firms disclosed fee amounts in amended registration statements on Wednesday:\n\nFidelity set its fee at 0.25% and said it would waive it through the end of 2024.\n\nFranklin Templeton said it will waive its fee until Jan. 31, 2025, on the first $10 billion of the fund’s assets.\n\nVanEck said it will waive its fee for a year after the fund is listed for the first $1.5 billion.\n\n21Shares set a 0.21% fee, which will be waived for six months starting when the shares are listed or during the first $500 million, whichever comes first.\n\nAlso Read: Pepe Coin’s 390% Boom: Next Big Crypto?\n\nFurthermore, an interesting note is the timing of the approval. The SEC is greenlighting the launch date of the Ethereum ETF during the biggest Bitcoin conference of the year. That week will be a memorable one for all of crypto, as BTC and ETH represent the only two cryptocurrencies with an ETF in the US.\n\nNow, all eyes are on what token could be next. There has been a lot of anticipation surrounding a possible Solana ETF soon. Crypto ETFs have entered the spotlight. As a result, the opening week performance of Ether ETFs may dictate how easily the next ETF is approved in the future."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNZVRaYkZCeG50OHdZcG1UR0NlZWhSRGRWX0tEbmh4a0c1YVJIRGp2MmEyMUV4cGs1dkZVRkVOTnFlVG9kaWQ3eVpJdERUTjlEaVNoNWJCOS0zSEhKMER0UTR6eWtmM3BRM1VSSEVrY1hOMmNzcWxfRjhodlR2eGFxSEJQRmgwYzctR2tWM3k5WVFYUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Cboe confirms trading launch of 5 spot Ethereum ETFs on July 23 - CryptoSlate",
        "content": "The Chicago Board Options Exchange (Cboe) issued listing notifications for five new spot Ethereum exchange-traded funds (ETFs) scheduled to begin trading on July 23 — confirming reports from earlier in the week.\n\nThe notifications clarify that the funds are pending final regulatory approval. The five ETFs are 21Shares’ CETH, Fidelity’s FETH, Franklin Templeton’s EZET, Invesco’s QETH, and VanEck’s ETHV.\n\nEach ETF will be listed on Cboe’s BZX Exchange and quoted on the SIAC Tape B data feed.\n\nSenior Bloomberg ETF analyst Eric Balchunas reported on July 15 that the SEC had instructed issuers to submit final amendments in preparation for a trading launch next week.\n\nSources told Balchunas that the regulator would give the final green light on July 22, setting the stage for a Tuesday trading launch. The issuers subsequently filed amended S-1 forms on July 18, revealing the final details for their funds, including sponsor fees.\n\nThe introduction of these ETFs is anticipated to enhance Ethereum’s liquidity and market depth. Analysts predict that the ETFs will attract a broad range of institutional investors who have been cautious about direct cryptocurrency investments due to regulatory uncertainties.\n\nThe ETFs are expected to pave the way for further institutional adoption, potentially driving Ethereum prices higher. Some analysts project that the token will climb above $5000.\n\nThe launch of these ETFs could mark the beginning of a broader trend of integrating digital assets into traditional financial products. The SEC’s decision may influence other jurisdictions to follow suit, potentially leading to a global expansion of crypto ETFs.\n\nSome firms have already begun work on ETFs linked to other major crypto tokens like Solana and Injective. However, some experts believe the lack of a regulated futures market for these tokens could be a challenge in securing approval.\n\nEthereum was trading at $3515 as of press time, up 2.2% over the past 24 hours, based on CryptoSlate data.\n\nBitcoin Market Data At the time of press 12:43 am UTC on Jul. 20, 2024, Bitcoin is ranked #1 by market cap and the price is up 4.22% over the past 24 hours. Bitcoin has a market capitalization of $1.32 trillion with a 24-hour trading volume of $36.95 billion. Learn more about Bitcoin › Bitcoin $66,736.68 4.22% Crypto Market Summary At the time of press 12:43 am UTC on Jul. 20, 2024, the total crypto market is valued at at $2.43 trillion with a 24-hour volume of $83.85 billion. Bitcoin dominance is currently at 54.19%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPdWdsbVk1MGRuY0RSdXhhWmpOWmxFMEFnRDlXeVJSZkNXWlJkckUtT2NWUDd2TlJUTGlzLXItbGI4ekUwZXVzRC1Ja2tHZnBNUlNuZ2xScFBTM0UtUjBNV25WQkN2QUhsa2V4Y2YwcWtXb1ZNcnhYWHJtM2JjZnAzWGUxS2ZfeDBid2tYbTM1U0NFU3pLcXRoc1lNcWZ6clVTVHhDcU02ajFBZDDSAbABQVVfeXFMTWpXR0RRVXN3aEVzU3A2emVKZ0FEb0g5RVRFcEs4aF9sY0tidzZCUTFHNXVKcTVobVAwazl6aTVSc255eWx2VlZXOXZuVnVoWGNxaEg5WWFORGN5YmxlT1JZdVZXTmN0REp2NjY2UUtqeDBrMVV3LXlGNHZ0U0RQYXpER3YtczlJVTB0VUd1ZnNraWFqbEFuVUhJc2E2cnpuVW9aQ01WNDdHS2pwbDRVWWs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "XRP Loses 7%, Here's How Ethereum (ETH) Going to Move Now, Toncoin (TON) Loses Crucial Support at $7 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nXRP is in the process of correction as its price printed a 7% drop in the last 24 hours, potentially pushing the market to its first major correction. However, it could be temporary, and things could turn bullish again in a few days.\n\nThe 50-day moving average is the first major support level for XRP. If XRP remains above this barrier, it may level off and even rise once more. As a psychological barrier for traders, this level has historically served as a foundation for price rebounds. The support level at $0.50 is followed by the 100-day moving average. In the past, during downtrends, it has provided solid support. If XRP drops below $0.55, this level may act as a safety net to stop further losses.\n\nTraders frequently scan these levels for opportunities to buy, which could aid in a price reversal. Recovering from a drop below the 200 EMA level may indicate a longer-term bearish trend for XRP. Sustaining this level is critical to XRP's bullish outlook, as it is regarded as a long-term trend indicator.\n\nEthereum can't break it\n\nEthereum could not break the 50 EMA resistance level and is currently sliding below the moving average. Unfortunately, the lack of a breakthrough will lead us to a drop below $3,300. There are a few levels for traders to watch.\n\nAdvertisement\n\nEthereum encountered significant resistance during its most recent attempt to breach the 50 EMA, suggesting that bearish momentum may be developing. A critical technical indicator, the 50 EMA frequently acts as a level of support or resistance. The failure of an asset to cross this threshold may signal waning bullish sentiment and potential losses.\n\nThe 50 EMA has consistently demonstrated its ability to predict market trends. Ethereum frequently retraces its losses when it is unable to rise above this level. This pattern implies that there may be more selling pressure on the market in the near term.\n\nIt is critical to avoid a drop below the $3,000 barrier. Ethereum may experience panic selling if it drops below that barrier, which would accelerate the decline. It has historically served as both support and resistance.\n\nThe amount of $3,200 represents yet another crucial support level. This threshold has previously been tested several times and has frequently served as a buffer against additional declines. Ethereum must stay at this level in order to stabilize and prevent a more severe correction. The 200 EMA acts as a longer-term support at around $3,200. That is why long-term investors need to keep an eye on this level, as a decline below it might signal a longer bearish phase.\n\nToncoin does not attract bulls\n\nToncoin's success was enormous during the market downturn, but as soon as the majority of digital assets retraced, TON quickly lost most of its momentum and even dropped below the crucial 50 EMA support.\n\nCertain investors have perceived Toncoin as a possible hedge against the larger cryptocurrency market, notwithstanding its recent performance. Due in large part to its integration with the Telegram ecosystem, this thesis's strength lies in its foundation.\n\nOne of the main benefits of Toncoin is its integration with Telegram. Telegram offers TON an audience that is already there and the chance to be widely adopted thanks to its enormous user base. TON may be more resilient than other cryptocurrencies due to this fundamental strength, particularly in times of market turbulence.\n\nIn times of market turbulence, investors frequently seek investments that offer some degree of stability. Its ability to function as a more stable investment was demonstrated by Toncoin's performance during the market slump.\n\nTON is not totally immune to larger market movements, though, as seen by the most recent decline below the 50 EMA support level. The support of a significant platform such as Telegram, and Toncoin's strong technological base, contribute to its increasing popularity.\n\nInvestors seeking long-term stability over short-term gains may be drawn to this strength. The theory is that despite difficulties facing the market as a whole, Toncoin's strong fundamentals will enable it to weather storms better than its competitors."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNTGt5eGF2dWFEVVp0YWhYdndBZGxUaVBFY0RjSjRvQXRXQjkzNVdpMHZKNDJ4TnpmNk1uclVEOThLYzIyR1NUSXIxeTBHVktZS0k0dEMwNkVFR0lxdklHN3lrVGtNSVVVZHVQdXlwN2hrZ3o5c3FUMnBCRGgtYmQ4UERBT1lZNVp2X3RTN0FVa1czZmplUnhwRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Is Ethereum a No-Brainer Buy After the Bitcoin Halving? - The Motley Fool",
        "content": "The world's second largest cryptocurrency still has near-term catalysts.\n\nMany cryptocurrencies pulled back a couple of years ago from their all-time highs as rising interest rates drove investors toward more conservative investments. Yet three tailwinds have lifted the broader market this year: expectations for lower rates, the approvals of the first Bitcoin (BTC -4.01%) spot exchange-traded funds (ETFs) in January, and Bitcoin's halving in April.\n\nBut now that Bitcoin has concluded its long-awaited halving, which reduces the rewards for mining Bitcoin every four years, there will probably be fewer near-term catalysts for the world's top cryptocurrency. So is it time to turn our attention toward Ethereum (ETH -6.78%), the world's second largest cryptocurrency, for bigger gains this year?\n\nThe differences between Ethereum and Bitcoin\n\nEther is the native token of the Ethereum blockchain, which was launched in 2015. Ethereum initially used the same energy-intensive proof of work (PoW) mining method as Bitcoin, but it transitioned to the more energy-efficient proof of stake (PoS) method in a process called The Merge in 2022. That transition reduced Ethereum's mining energy consumption by 99.95% and made it deflationary -- which meant more coins were being burned, or permanently removed from circulation, than created. PoS blockchains also allow investors to stake, or lock up, their tokens for fixed periods to earn interest-like rewards.\n\nThe Ethereum blockchain was also developed to support smart contracts, which can be used to create decentralized apps (dApps), smaller tokens, and other crypto assets. Bitcoin's blockchain can be used only to mine more coins. That's why Ethereum is usually valued by the expansion of its developer ecosystem, while Bitcoin is often compared to gold or silver.\n\nThat key difference drove the U.S. Securities and Exchange Commission (SEC) to say that Bitcoin was the only cryptocurrency that could be classified a commodity. That classification supported its approvals of the first spot Bitcoin ETFs.\n\nYet the SEC was reluctant to call Ethereum and other PoS coins commodities, saying the staking process made it similar to securities. Nevertheless, the SEC still cleared the way for Ethereum's first spot-price ETF applications earlier this year.\n\nThe tailwinds and headwinds for Ethereum\n\nEthereum's biggest near-term catalyst will be the potential approvals of its first spot ETFs. The SEC has already reportedly granted preliminary approvals to at least three of the eight planned spot-price ETFs, according to Reuters, and the latest speculation suggests most of those funds could start trading as early as July 23.\n\nEthereum's price has already risen about 50% this year, but the first spot ETFs might drive its price even higher. For reference, Bitcoin's price has rallied more than 40% since the approvals of its first 11 ETFs on Jan. 10.\n\nAnother major catalyst is Ethereum's recent Dencun upgrade, which increases its speed and reduces the gas fees -- essentially network user fees -- for its Layer-2 blockchain. Stabilizing and declining interest rates could also drive investors back to Ethereum and other cryptocurrencies.\n\nYet Ethereum still faces unpredictable headwinds. The Dencun upgrade made Ethereum inflationary again, and its supply will keep rising unless more tokens are burned. It also still processes transactions at a slower rate than newer PoS blockchains such as Solana (SOL -6.89%) and Cardano (ADA -9.13%) -- and those limitations could curb the expansion of its ecosystem.\n\nEthereum's planned spot ETFs also won't feature any staking mechanisms like its underlying tokens, so it might not be a compelling alternative to directly owning the cryptocurrency. Lastly, the market's expectations for lower rates and ETF approvals might have already been baked into its current price.\n\nSo is Ethereum a no-brainer buy right now?\n\nEthereum is trading at about $3,400 as of this writing, but some bullish investors expect it to generate huge gains during the next few years. VanEck's Matthew Sigel and Patrick Bush expect its price to more than triple to $11,800 by 2030, while Ark Invest's Cathie Wood says it could be worth a whopping $166,000 by 2032.\n\nWe should take those rosy estimates with a grain of salt, but I believe Ethereum's spot-price ETF approvals and lower interest rates should limit its downside potential this year. The Ethereum network's next planned upgrade, Pectra, should further increase its speed and lower its gas fees to keep pace with Solana and Cardano. Therefore, I believe Ethereum is still a good cryptocurrency to accumulate right now -- but investors shouldn't necessarily expect it to blast off in the next few months."
    }
]