[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFBHcTk5ZUYzZ3NnYjdqc3YxMGhnTm8wOHVGMjN5YXBOcGktd0dnRkZvM25BY1JaMDN5RzJnT0NWQmg3cHEwVUFid1VZdF9INTY2M0VZZWhheFpfZTl2VjdHZzh1bHA1cTBtSmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Mar 2024 07:00:00 GMT",
        "title": "The biggest Ethereum upgrade ever goes live - Blockworks",
        "content": "The long-awaited Dencun upgrade activated on Ethereum mainnet Wednesday at approximately 9:55 am ET — or the start of epoch 269568 if you’re following on-chain.\n\nA scalability-focused upgrade, Dencun features EIP-4844 or Proto-Danksharding which carves out a dedicated data channel on Ethereum for layer-2 data, dramatically reducing the transaction fees on rollups.\n\nBut that’s not all. Dencun ships a total of 9 Ethereum Improvement Proposals (EIPs) in all, making it tied for the largest single hard fork in terms of improvements shipped, according to Tim Beiko, who coordinates the Ethereum core developer calls, on the Ethereum Foundation livestream commemorating the event.\n\nRead more: Ethereum Improvement Proposals to watch in 2024\n\nPost-Dencun, most rollups and their users will see benefits within hours to days, as the availability of data blobs on Ethereum — introduced by EIP-4844 — should slash transaction fees by 5-10x.\n\nThis real-world benefit to users is primarily driving anticipation for the upgrade, according to Hannes Graah, a builder of crypto wallet Zeal.\n\n“The Dencun upgrade brings us closer to a future where fees are an afterthought, not a dealbreaker,” Graah told Blockworks. “Just as we generally don’t worry about the cost of traditional domestic bank transfers, Web3 users should be able to transact without worrying about fees.”\n\nAki Balogh, co-founder and CEO of DLC.Link, likens EIP-4844 to the “NoSQL movement of the 2010s,” which removed constraints of structured SQL data, through developments like MongoDB.\n\n“Giving developers large blobs of temporary data (deleted after 30 days) provides them the opportunity to innovate while not increasing load on the network,” Balogh told Blockworks, removing a major Ethereum bottleneck. “Similar to Mongo’s effect, this proposal will help innovation as dApps and chains find new ways to use the temp storage space,” he said.\n\nIn contrast to scaling in Web2, this new data storage channel for Ethereum doesn’t sacrifice decentralization, notes Philippe Schommers, head of infrastructure at Gnosis, which implemented Dencun already on Monday.\n\nRead more: Gnosis Chain premieres Ethereum’s Dencun hard fork\n\n“When working towards scalability solutions on the blockchain, there are choices that developers have to make to prioritize decentralization,” Schommers told Blockworks. “When you look at Web2 infrastructure, it’s easy to see how centralized scalability can be done, but that’s not the path we’re trying to follow.”\n\nWhile “less glamorous” Schommers said, it was part of Ethereum’s “big ambition,” calling Dencun “one piece of the puzzle that gets us a little bit closer to building a larger scale, fully decentralized network.”\n\nOthers are more effusive.\n\nLucas Henning, chief technology officer of Suku, says it’s still early days and the upgrade “will guide the Ethereum ecosystem towards a more sustainable future.”\n\n“It’s an exciting time for Ethereum, and I am keen to see the effects of these changes on the decentralized world landscape,” Henning said.\n\n“It’s the moment we’ve been waiting for,” said Eli Ben-Sasson, president of StarkWare. “Today will go down as the date of birth for a dapp-for-everything culture.”\n\nUpdated March 13, 2024 at 11:30 am ET, clarifying Dencun is equal to one earlier fork for the most number of EIPs included.\n\nCorrection March 13, 2024 at 1:40 pm ET: Misattribution of one quote.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQMVdvQl9XMERSUFBPWUY1OWFpNTROUVJ0dnNSU01jTy1OYjN4MVBSS0dpdVR1ZC1ySGJ5VHROTHpBcnMzVHBDbGlLd0t2OXV3LUI3bkpGaTFjR1pScVp5aUZESXM5SDRWMGNFR2NMUmxVUml0RjhnWF9XM3g1cnZyNFVHS0plTG9COUIyOGpPTjUyMGtCazh0UzVRclE1SXc2SXBkenA3UlNHc2dJdTNwSA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Completes Milestone Dencun Upgrade, Which Should Substantially Reduce Fees - Unchained",
        "content": "Layer 2 blockchain networks can now use a different way to store data, which is intended to help these rollups scale the Ethereum blockchain network that was plagued by huge spikes in gas fees in years prior.\n\nEthereum has completed a significant upgrade of its blockchain network, which is expected to pave the way for the next generation of crypto users to transact onchain without suffering significant spikes in gas fees.\n\nThe upgrade, named “Dencun,” was completed early morning Wednesday ET after it was activated on Ethereum’s mainnet at epoch height of 269568, according to Ethereum developers in a live stream on YouTube. At one point, more than 3,600 people were watching the official rollout of Dencun on the livestream.\n\n“We basically enter this new era of Ethereum scalability,” said Anthony Sassano, the creator of Ethereum-focused media site The Daily Gwei, referring to how Dencun implements EIP-4844 and “proto-danksharding,” which creates a highly optimized and much cheaper storage space where rollups can post data to called “blobspace.”\n\n“It’s the first step on a long journey that has been going on for a few years now towards what we [Ethereum contributors] call full danksharding, which will greatly increase Ethereum’s scalability properties specifically for layer 2s,” Sassano added.\n\nRead more: How Much Will the Dencun Upgrade Really Reduce Ethereum Layer 2 Fees By?\n\nDencun is Ethereum’s most substantial software change since Shapella, which occurred about 10 months ago. Before the hard fork upgrade, rollups had to store information such as transaction history in calldata, which is “really expensive, because Ethereum calldata has to be stored forever,” said Polygon’s vice president of product, David Silverman, in an interview with Unchained.\n\nAfter the upgrade, when rollups post data to this new blobspace in the form of “blobs,” the information isn’t stored forever and so it’s much cheaper, while still providing similar security guarantees. Consequently, “rollups can generally pass those cost [savings] on along to their users,” lowering transaction fees on Ethereum’s layer 2 networks, Silverman added.\n\nThis impact could occur immediately or more gradually over time. The various L2s will go through their respective governance processes to change the target of where they’re posting data from either calldata to blobspace or possibly a mix of the two. This means some networks may see changes immediately on day one, while others may take as long as a month-and-a-half, depending on when their governance votes are held and how easy it is for a rollup to integrate the upgrade, noted Silverman.\n\nFor example, the team for the layer 2 blockchain network Base, which was incubated by crypto exchange Coinbase, said in a blog post that Base will have support for the Dencun upgrade on the first day.\n\nAnother Ethereum rollup, zkSync, is already ready to submit blob transactions, per Daniel Lumi, senior product manager at Matter Labs, the software firm building zkSync, adding that zkSync has a solution for where the protocol decides to post data.\n\nGetting Lucky\n\nThe Dencun upgrade comes as the price of Ethereum’s native cryptocurrency, ETH, is trading around $4,000, a level not seen since the end of 2021 before Ethereum changed its consensus mechanism to proof-of-stake.\n\nWhile Ethereum developers don’t implement upgrades based on market pressure, the Dencun upgrade implementation coinciding with the start of an early bull market and ETH trading around the $4,000 level is “lucky,” Silverman noted.\n\nThe DeFi Summer in 2020 ended in part because Ethereum’s infrastructure was not ready to accommodate the mass of new users coming onchain, which became evident when gas prices to execute a token swap on a decentralized exchange soared to hundreds of dollars.\n\nAs a result of Dencun and specifically EIP-4844, which will bring transaction costs down, “we now have a ton more capacity from all these rollups to handle this next generation of users without gas prices spiking up to $200 [or] $300 per swap, killing our momentum,” Silverman said. “We got lucky in the sense that we got this [the Dencun upgrade] out of the way before retail is coming back.”"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPWHhnNnl0MmJrZGFXV0NtQU5FQ21EVUdrNDM0aVNKWk81UFEtM0o3V1h0SXdQSHpCcE5WUlNuSmxnNDg2d1hCTEd5amVPS0NjOEhxVEtlVm1YM3FOSWhxOUY5TTQ5VUlZblRWODVzamI2R1g5RUVuNlZSVGZKeHExNmlnOTB0VkRLblBuTzlYWEdSblJJUktEaEw4bDBFNmZiTVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Mar 2024 07:00:00 GMT",
        "title": "What You Need To Know Ahead of Ethereum's Dencun Update Wednesday - Investopedia",
        "content": "Key Takeaways Ethereum's next major network update, known as \"Dencun,\" is scheduled for Wednesday.\n\nDencun is expected to lower transaction fees on the many Layer 2 networks built on top of the base Ethereum blockchain.\n\nThis update is part of a major push by Ethereum developers to head toward mass scalability via Layer 2 blockchains.\n\nReports from digital asset managers Grayscale and Fidelity Digital Assets indicate the update could be a boon for scaling the overall Ethereum userbase.\n\nEthereum is scheduled to undergo a network update called the Deneb-Cancun, or Dencun, on Wednesday, aimed at improving user experience and lowering transaction fees for some users on the the network's Layer 2 blockchains.\n\nEther (ETH), the native coin of the Ethereum blockchain, soared past $4,000 early Wednesday, but gave up some of those gains to trade a shade under that threshold at 10:30 a.m. Eastern.\n\nWhat is the Dencun Ethereum Update?\n\nThe Dencun update prioritizes scalability, efficiency, and security through the implementation of various Ethereum Improvement Proposals (EIPs).\n\nAccording to the Ethereum Foundation, the most notable change is EIP-4844 for proto-danksharding, which seeks to optimize gas fees for Layer 2 network (L2) data and enhance the network's ability to handle greater transaction volumes via those secondary layers.\n\nExchanges may face delays in processing Ethereum transactions on Wednesday as the update rolls out. Coinbase (COIN) said Monday that it expects disruption due to the update to last for at least an hour on or around 9:45 a.m. Eastern time, although that could change. Kraken, meanwhile, is budgeting for about 15 mins of delay for maintenance around 4:00 a.m. Eastern time and recommends users \"not to place or cancel orders during this timeframe.\"\n\nBlobs, Rollups, Gas: What Is Changing?\n\nLayer 2 networks, such as rollups, are secondary blockchains built on top of the base Ethereum network. In a bid to scale transaction volumes, rollups compress transactions by bundling them. The initial verification for those transactions happens off the chain, but the transactions are settled on the main Ethereum blockchain.\n\nHowever, even with the compression, nodes processing transactions hold on to Layer 2 data forever, expanding their hardware requirements, which are then passed on to users via higher transaction or gas fees. More than 90% of the fees paid by users on rollups are because of this data storage.\n\nThe Dencun upgrade will alter that, allowing information related to Layer 2 networks to be added to the base Ethereum blockchain via temporary, more efficiently stored \"blobs\" rather than as permanent data. As of this writing, blob data will be available for 18 days. This is intended to lower costs.\n\n\"Each byte of data that L2s store on Ethereum costs roughly 16 gas. The introduction of blobs and a new fee market designed for blob data drops the gas cost down to 1 per byte of data stored,\" noted Fidelity Digital Assets in a report about the upgrade. \"This is a maximum gas cost reduction of 94%!\"\n\nHowever, it is important to note that Ethereum users on the main blockchain or Layer 1 users won't stand to benefit much from the lower fees found on Layer 2 networks after the upgrade.\n\nMore Accessible and Competitive Ethereum?\n\n\"Currently, Ethereum’s performance is hindered by its slow transaction speed, low throughput, and high costs for users. With average transaction fees of $2.3 as of February 22nd, Ethereum is significantly more expensive versus alternatives like Solana. This threatens to drive away end users to other chains,\" said crypto asset manager Grayscale in a report.\n\nThe Dencun upgrade \"could help Ethereum compete in terms of scalability with faster chains,\" the Grayscale report said.\n\nFidelity also points out that in addition to differentiating it from competitors, the latest changes to the Ethereum network could help transition from being a general-purpose blockchain to a global database for Layer 2 networks. The best way to gauge the success of the Dencun upgrade will be to track the number of Layer 2 users via a metric such as active addresses,\" Fidelity said.\n\n\n\n(Update—March 13, 2024: This story has been updated with more recent ETH price information.)"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxOX2VnbWxiejBvT1c2TV9LU1FLOTVQNW9OUFVTRndGVWJmNkpvS0pNVGlncXd2NU9rdm5WME5wMWh6RllGMlpPbHY3M3IxOTBjVjM0U0hXWFhlUEdYNFFGSjJrY010VjRNTEc4NFBGbUE3dnN5QlFjM1pFRnNMSzFJb1h4Y01FdlA1blRCMjBpLXNpRWtWNUNtZmpLNGxPNWw1NDRCbnpya0dOa2FXOU40dE9pVDVRN0JKcGlDVWtVR3AyajNHRjc1czFQMG1jXzNu?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Mar 2024 07:00:00 GMT",
        "title": "Ethereum’s fix for its gas fee problem is now live: What you need to know about the Dencun upgrade - Fortune",
        "content": "On Wednesday morning, the Ethereum blockchain completed an upgrade called Dencun, the biggest change to the network’s code in over a year. The upgrade is an important step to help the world’s second-most valuable blockchain overcome its scaling challenges, and reduce its infamous gas fees. But what exactly is Dencun and how does it work? Our plain-English explainer tells all you need to know.\n\nWhat is the Dencun upgrade?\n\nDencun describes two upgrades that took place at the same time on Ethereum. The name combines the “Cancun” upgrade of the execution layer and the “Deneb” upgrade on the consensus layer. The latter refers to how network users agree on the state of the blockchain, while the former refers to how transactions are processed.\n\nIn technical terms, the upgrade is the result of a new Ethereum Improvement Proposal (EIP) called “proto-danksharding,” or EIP-4844, which improves the blockchain’s propensity to handle data from secondary networks.\n\nGathering of the five families in London for the Dencun upgrade pic.twitter.com/4cyxFSQoVh — David Mihal.eth (@dmihal) March 13, 2024\n\nWhy did Dencun come about in the first place?\n\nThe upgrade will lower gas fees for the growing number of networks built on top of Ethereum that are known as Layer 2 (L2), or “roll-ups.” This is important since gas fees have historically soared whenever there is a surge of activity on the blockchain, making it unviable to use at a large scale. Roll-ups help address this by processing transactions separately, and then stamping them to the main Ethereum blockchain in batches.\n\nWhile roll-ups have already made Ethereum more efficient, one issue that is that, post-compression, nodes processing transactions hold on to L2 data infinitely, requiring a greater volume of hardware as time goes on. This has meant that over 90% of the fees on roll-ups are used for this data storage.\n\nThe upgrade means L2 data will be added to the base Ethereum network via fleeting, more efficient “blobs” rather than data held indefinitely. Instead, “blob data” will be stored for 18 days.\n\nWhat about the main Ethereum network?\n\nThe overall effect should be lower costs, but users on the main blockchain (L1) won’t enjoy these lower fees until at least 2026–2027, says Pitchbook’s crypto analyst Robert Le, until there is “full danksharding,” referring to a roll-up scaling method which provides extra storage for increased transactional capacity.\n\n“Over the next couple of years, you’ll see less and less individual users, whether retail or businesses, transact directly on Ethereum. More will move to L2s and the only ones transacting on Ethereum will be the rollups,” he said.\n\nEIP-4844 marks the beginning of the “Surge” phase for Ethereum, outlined by the network’s cofounder Vitalik Buterin in December. The aim of this phase is to reach 100,000 transactions per second.\n\nHow much will Dencun lower fees?\n\nGas fees had risen to an average of 98 gwei (a denomination worth one-billionth of an Ether, the native cryptocurrency for the Ethereum blockchain) the week before the upgrade, a level not seen since early May 2023, according to Ethercan data. A swap would cost users $87.45 in gas fees on average, while non-fungible token (NFT) sales average $147 in gas.\n\nAfter the Ethereum Dencun upgrade this week, EIP-4844 will reduce L2 gas fees. According to IntoTheBlock statistics, for a DEX swap, the gas fee for Aribitrum will be reduced from $2.02 to $0.4, Optimism will be reduced from $1.42 to $0.28, Base will be reduced from $0.58 to… pic.twitter.com/0x6jGDYF5z — Wu Blockchain (@WuBlockchain) March 11, 2024\n\nL2 fees will drop by a factor of 10 after the upgrade. Swapping tokens on decentralized exchanges, which currently costs $1–$2, should fall to around 10–20 cents, and could even go as low as a fraction of a cent.\n\nWhat does Dencun mean for the price of Ether?\n\nEther (ETH) has climbed over 150% since October. Last week it broke $4,000, for the second time ever, where it has hovered since, indicating it could soon pass its all-time high of $4,878.26, reached in November 2021.\n\nThe price surge is part of a broader bull crypto bull market spurred by the approval of Bitcoin ETFs in January, and optimism that regulators will approve Ethereum ETFs, too, this year. But experts told Fortune they foresee the upgrade having a continued, positive impact on ETH’s price that could be more significant than ETFs, as investors bet on the network’s development potential.\n\nIt will be an “absolute game changer” for the token, and is the “bigger story right now,” Matt Hougan, Bitwise’s CIO, told Fortune.\n\n“There are a billion applications you can build if transactions are below a penny that you can’t build if they range from 10 to 50 cents,” said Hougan. “Once we get them reliably free to people, you will see financial applications, DeFi and NFTs, but you will also see nonfinancial applications. I think we’re gonna see this massive explosion of mainstream uses,” he said.\n\n“We’re building a new type of technology, a new type of platform. I think that’s what ETH has going for it on the sentiment side, and why it’s doing so well,” Vance Spencer, co-founder of Framework Ventures, added."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOQUZFNlhVVExmZWsxRW1nbTAyRG1sNXhsZW55ZDE1bWRZTmFzQXo4eFMyVjBoNFFxSzJMYTFleVVaRnlDM1FSdUZ4dzJDaUI5ekZUZWxiaTcyYlFNamVxVk5ub3UxWjdRQ00zUmN1blZWODNZZEVRSWdUTkZDd2NSTUtfM2t0bXVlNFdpSXE3SWMxMndjN3djZExB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Mar 2024 07:00:00 GMT",
        "title": "Dencun Upgrade: Ethereum's Leap into the Future of L2 Scalability is Here - hackernoon.com",
        "content": "\n\n\n\nIf you are familiar with Ethereum, you know its mission – to be scalable, secure, and decentralized. As Ethereum's popularity has surged, so too have the demands on its network, raising gas fees and highlighting its scalability challenges.\n\n\n\n\n\nLayer 2 solutions, Ethereum's answer to the scalability problem, enabled handling transactions off the main chain without compromising its core principles. Still, gas prices on L2 – lower, but not yet low enough – remain a barrier to Ethereum’s widespread adoption. Imagine finding an NFT collection you like, only to discover that the transaction will cost nearly as much as the NFT itself! Even on L2, this scenario is all too common.\n\n\n\n\n\nToday, March 13, 2024, this is all going to change!\n\n\n\n\n\nWhat’s so special about the day? Well, the next Ethereum upgrade, Dencun, is scheduled for activation, as announced during Consensus Layer Call 127 and confirmed by Tim Beiko of the Ethereum Foundation.\n\n\n\n\n\nDencun is poised to be a game-changer for Ethereum's scalability. Encompassing a hard fork involving Deneb (Consensus layer) and Cancun (Execution layer) upgrades, Dencun promises to usher in a new era of affordability for transactions on Ethereum L2s. With the upgrade already live on devnets and testnets like Goerli, Sepolia, and Holesky, and Mainnet readiness confirmed, we finally stand on the brink of a gigantic leap forward.\n\n\n\n\n\nOne of the most anticipated changes is the introduction of off-chain data blobs via Proto-Danksharding. Let’s explore what this entails for Ethereum.\n\n\n\n\n\nUnveiling Blobs and Proto-Danksharding\n\nData blobs are a novel concept designed to optimize L2 transaction data storage on Ethereum. Currently, rollups store their data in transaction calldata . It’s not only limited in size but is also stored forever, creating a problem of always-rising requirements for running a validator.\n\n\n\n\n\nProto-Danksharding , as introduced by EIP-4844 , lays the groundwork for an innovative, dramatically more efficient data handling mechanism, addressing the limitations of current on-chain data storage. With data blobs, specifically designed to handle large amounts of data outside the main Ethereum blockchain, rollups will be able to store data in a more cost-effective and scalable manner.\n\n\n\n\n\nThis new storage solution for rollup transactions will reduce the rate of future Ethereum data growth, contributing to a leaner and more efficient network. For developers, this brings the ability to create more complex and data-intensive smart contracts without being hindered by prohibitive gas costs. For users, it translates into lower fees, making L2-based applications more accessible and appealing to a wider audience. Finally, it also allows Ethereum Validator Node Operators to optimize disk space usage as blobs are pruned after around 2 weeks.\n\n\n\n\n\nThe Expected Effect of the Dencun Upgrade on the Ethereum Ecosystem\n\nSeveral key players in the Ethereum ecosystem, such as OP Labs and the zkSync team, have provided quantitative insights into the expected benefits of this upgrade. OP Labs forecasts an extraordinary 20x reduction in gas costs for data storage on Ethereum by Optimism L2. Similarly, the zkSync team anticipates a tenfold decrease in gas costs for data storage, projecting the total gas costs on zkSync to drop from an average of $0.20 per transaction to under $0.10.\n\n\n\n\n\nWhile these projections highlight dramatic savings in data storage costs, it's important to keep in mind that the overall gas costs experienced by users involve multiple factors beyond L1 data storage. The Proto-Danksharding upgrade, by reducing the rate of future Ethereum data growth, addresses a crucial aspect of transaction costs. However, the actual effect on user transaction fees will vary, as these fees also depend on computational complexity, network congestion, and other factors.\n\n\n\n\n\nBeyond Dencun: The Road to Full Danksharding\n\nAs you can see, the Dencun upgrade is indeed a crucial milestone for Ethereum. Yet, it is only the first step on a much larger, bolder path towards full Danksharding. This future phase in Ethereum's evolution is set to massively boost the network’s transaction processing capability and efficiency. Imagine a blockchain that can smoothly process more than 100,000 transactions per second. Yes, that's where we're headed!\n\n\n\n\n\nAs I mentioned above, Proto-Danksharding sets the groundwork by integrating off-chain data blobs and reducing the cost of L2 data storage on Ethereum. The full Danksharding expands on these principles, aiming to increase the maximum amount of blobs per block from 16 to 64. This transition does not just mean an increase in data storage efficiency but a fundamental re-architecture of how blocks are processed and validated across the network.\n\n\n\n\n\nThe move towards full Danksharding will require several significant technical and operational changes:\n\nProposer-Builder Separation : This mechanism separates the roles of proposing blocks and building blocks within the network. Dealing with a large amount of blobs per block would be too tasking for a single builder+proposer, so the duties will be separated. Additionally, this change will reduce the risk of censorship or manipulation by preventing proposers (validators) from being influenced by the contents they're including in a block.\n\n\n\nData Availability Sampling: To ensure data within shards remains available, DAS allows nodes to verify the availability of shard data without needing to download the entire shard. This technique is crucial for maintaining blob data integrity and accessibility efficiently across the network.\n\n\n\n\n\nEmbrace the Future of Ethereum!\n\nThe Dencun upgrade is a pivotal milestone for Ethereum, marking a major leap forward in its evolution. This upgrade not only promises to elevate the platform's efficiency and L2 transaction affordability but also lays the foundational steps toward the much-anticipated transition to full Danksharding.\n\n\n\n\n\nAs we transition into this transformative phase, it's imperative for the Ethereum community, including developers, investors, and enthusiasts, to remain informed and actively contribute, thus ensuring a seamless evolution of the ecosystem. Engaging across forums, chats and social media, as well as participating in development projects, enriches our collective journey towards realizing a more efficient, inclusive, and forward-thinking blockchain platform for all."
    }
]