[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQMmlFWVJHVUZIaHBZYmRhaEhWM2FMeXZTRll2LU9ycmVhdjVEdVQzamtEQlltNjJOdS1NUEt6V0liQTBlRkpUdEJpaUsxX2FOVW9aaFluYlA3OE94NGFDR09EWUUzZmlWX2xnVVVIRTBBeGVFbzF3RTZBY1JFcVdzaGlzZk14UdIBjgFBVV95cUxQZEZkRE5qeTYyTmFIWjhDMEFCb1NZemlaVDVYbUFpRjFqbFdFdVlVbzRFQTZNRTVlaGkyTzEyNjk4SVNhM1pIcjdmeGtFRWxrdTB5TU9oM2pYTXR5VU1JRHhUNlhjNkRBbVg2VklZV0pjVzVGakNabGpVXzlaa2QxVFpiTTl3NjlRTmhwSFZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Hits $3,500 Just Days Before Dencun Upgrade - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum is starting the week having inched its way past $3,500, marking a 3% gain since this time yesterday, according to CoinGecko data.\n\nAt the time of writing, the Ethereum price is $3,506.38, which means that ETH has gained 15% in the past week. This is the highest Ethereum has been since January 2022, when it was coming down from the late 2021 bull run. And 91% of ETH held in wallets is now in the money. That means all but 9% of ETH has appreciated in value since it was purchased, according to blockchain analytics firm IntotheBlock.\n\nEthereum developers are now only 9 days away from pushing the Dencun upgrade to mainnet on March 13. It's long been said that the upgrade, which will introduce proto-danksharding to the network, will make transactions much faster and cheaper. Last week a handful of devs told Decrypt the change will be striking, adding that this is the kind of upgrade they've been \"dreaming of.\"\n\nAD\n\nAD\n\nIt tends to be the case that when investors are bullish on Ethereum, DeFi projects see a lot more action. That's very much been the case this time around. The total value of assets in DeFi protocols has reached $94 billion as of Monday morning—the highest it's been since TerraUSD crashed in 2022, according to DeFi Llama.\n\nIn super simple terms. the TerraUSD crash and the contagion that followed scared a lot of money out of DeFi protocols. The total value locked in DeFi projects had been $132 billion just before the Terra collapse, according to DeFi Llama.\n\nA quick refresher: The Terra ecosystem was able to grow so large so fast because it promised upwards of 20% returns on deposits. When it suddenly crashed in May 2022, it took lots of other projects and firms with it and made traders wary of protocols that promised sky-high returns.\n\nThat wariness sent the TVL as low as $36 billion in October 2023. But as of this writing, assets in the DeFi ecosystem have nearly tripled in value. Ethereum has seen 64% growth over the past month—which outpaces the 54% growth it's seen in price. And Solana isn't far behind it, having seen 57% growth in the past 30 days after its native SOL token has gained 34% over the same period."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPZ0haSjVnRmxTX3BfbmttN0hlSXBDVmpycUp2czZhMFZYR0ZFYUp1MmFJYUV2UElPTlgxT051ekcyNUZfOVV4ZU5UenM0TlVoNEV5TUhCUVpXQm9tMlpRaERrMGpmT0ZCZG9rRjhuNHgzSnhTYkluam1wVDhaY2Z5aHVHdldlN1VLN2fSAZIBQVVfeXFMUGhzYTlQWGs4U0ItQVdxVjNPZWlIaVV5WU15ZmFIcE9jMFVEUXF0cklJb0hmOGx5V0c0T2pYN0xlNE1Dby1lTjdMRHd4YVJLWjlBTjJqNlNuMDliaHhRd1Y4aXJFeG94ZS1DVVo0bld4RXlUQV9FSzYySkpOTzB4N0VFc1dPcG9BcjZEWGoydks5OGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Gas Fees Skyrocket Again, Pushing Price of NFT Transactions Near $400 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAll good things come at a cost—and in this case, skyrocketing prices across the crypto market have also triggered an equally steep rise in Ethereum gas fees.\n\nOn Ethereum, massive levels of network traffic pushed gas fees beyond 174 gwei by midday Monday according to Etherscan, incurring significant costs for traders attempting to complete various types of transactions within the blockchain’s ecosystem.\n\nTo give an indication of the severity of the gas fee uptick: The average charge to complete a typical NFT transaction on Ethereum eclipsed $372.29 at certain points on Monday. This means users, even if they were swapping profile pictures (PFPs) among friends for free, would have to pay hundreds of dollars just to see those transactions completed.\n\nSwapping tokens on Ethereum cost almost as much at several points on Monday, upwards of $220 per transaction. Such prohibitively expensive fees potentially eliminate the value of certain crypto transactions, as the costs could eliminate any potential profits from flipping tokens.\n\nAD\n\nAD\n\nBorrowing on Ethereum cost above $186 per transaction at certain points on Monday; attempting to escape such steep prices by bridging funds from Ethereum to another blockchain cost over $70 on average.\n\nIn the last 24 hours, the largest gas guzzler in the Ethereum ecosystem has been Uniswap, a protocol for trading fungible ERC-20 tokens. Over $4.2 million worth of ETH has been burned completing transactions on the platform in the last day.\n\nThe uptick in exorbitant on-chain surcharges comes as cryptocurrencies like Ethereum and Bitcoin—as well as on-chain assets like NFTs—are experiencing massive surges in value.\n\nOn Monday morning, ETH hit $3,500 for the first time since the start of 2022. Minutes later, an Ethereum-based CryptoPunks NFT sold for a whopping $16.03 million worth of ETH, the second-highest price ever fetched by a piece in the popular PFP collection.\n\nAD\n\nAD\n\nThe gas fee surge also comes just days before Ethereum’s much-anticipated Dencun upgrade, which is set to substantially reduce transaction costs on Ethereum layer-2 scaling networks via a novel data storage method called proto-danksharding.\n\nSeveral layer-2 developers recently told Decrypt that they anticipate Dencun will so significantly reduce gas fees in the Ethereum ecosystem, that the concept of such charges may soon become obsolete.\n\n“We’re going to enter a world where most users are just not going to experience gas at all,” Polygon Labs VP of Product David Silverman previously told Decrypt, “and it becomes abstracted away.”\n\nEdited by Andrew Hayward"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMilwJBVV95cUxNRm90bVhsVVFCMEROQXpOR0V3OHI3Uk5DU1FzWGlCcDNZeEFXSS1GR3Ztb3NzVDNtUnd1dHZFZ3VHaDZuR05KRzF6REotQlppWGhHSS15ZDVPU0d1b20zVElQWmlheU5nWWFVMFlEMVloRWpFR1U2UWJaNXQ4N2dnc2xDX3htZzFGWFFtMWNwWG5CTUVwc3RuQUJkTXJKOExkeXR1Q21IMWlZaFU1bUhBWTZMWk01V09fV1FqVE1sZUdTMkN2LUZpMWRFVmVFRV9rU3BOMUU0R0JCZUhyRllFNmh2WS1XVElGbWt1Vkt6RF9RXzZ6TXVyN0VmVi13SUNMdXdndjN5OGhTTHpsQTFyZ0xzYko5R03SAZwCQVVfeXFMTmZPd3ZyWjVuYVJvSVdIUjdGMnh2NGRiVWZCaERyVDJZRVFqSkFjN0RKS1RXT1BLWVNBM1pDRGowOS1HRTZINk50QXI0VHc5TmxaSmFELWFNRnRrZDdwN21vbjFvT29BWHhuSmJSYWVNczA4cUlvQVlWZFJtVDdoUkZOZzRwWjdzZlBWUUF4X0pzd2hnX1NodEYzQS1YeEFFdGZhWEltN09Pdl9RbDJCakcyX1ZhVEYxZ3pkT014XzdieWpIY2djVXJjdDRpVHJFRHlTTGZCaDNrTi1qRXZMQnJvaUxGSVEzT3g1cDhnUE5TTDZoQ3NkUE1LM1ZEaVQ3N0s3Vnp0dFFlUVllMkVuOGtJVkpUMGgtdFZFR1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Mar 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price on March 4: Bitcoin trades above $63,000; Dogecoin, Shiba Inu jump up to 11% - The Economic Times",
        "content": "Tech view by ZebPay trade desk\n\n\n\nAgencies\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nTop cryptocurrencies were trading higher in Monday's trade. While Bitcoin rose 2.2% in the last 24 hours and traded at $63,275 around 11:21 am IST, other major cryptos such as Cardano, Ethereum, Dogecoin , Shiba Inu, and Polkadot surged up to 11%. However, a few of the top crypto tokens such as Avalanche, Chainlink, Polygon, Solana, and XRP were the laggards.Meanwhile, the global cryptocurrency market cap surged 1.5% to around $2.38 trillion in the last 24 hours.\"Bitcoin traded above the $63,000 mark over the weekend. The upswing in price is attributed to growing mainstream adoption of spot Bitcoin ETFs and the approaching Bitcoin Halving event. BTC is eyeing towards $67,150 resistance level, if the momentum continues, a close above it this week could signal the potential for a new all-time high,\" said Edul Patel, CEO of Mudrex.Meanwhile, Shivam Thakral, CEO of BuyUcoin, said, \"Ethereum, on the other hand, is trying to break the $3,600 level, which could potentially push the second-largest cryptocurrency beyond $4,000.\"The total crypto market volume over the last 24 hours is $110.12B, which makes a 28.38% increase. The total volume in DeFi is currently $9.6 billion, 8.71% of the total crypto market 24-hour volume. The volume of all stablecoins is now $129.27 billion, which is 88.33% of the total crypto market 24-hour volume, as per data available on CoinMarketCap.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, surged to $1.244 trillion. Bitcoin's dominance is currently 52.36%, according to CoinMarketCap. BTC volume in the last 24 hours rose 65.6% to $34.75 billion.\"In the past 24 hours, around $59.27 million worth of Bitcoin positions, with $38.52 million in shorts, were liquidated. This surge is linked to the growing mainstream adoption, notably propelled by the introduction of Spot Bitcoin ETFs, cultivating a stronger holding mentality among investors,\" said Rajagopal Menon, Vice President at WazirX.Bitcoin's recent surge to over $62,000 has captivated crypto enthusiasts and surprised sceptics alike, marking a period of exponential growth. The rally witnessed in February even set a record, representing the longest monthly green candle in Bitcoin's history. Despite this remarkable rise, several key factors and upcoming events suggest that this may just be the beginning of a significant bull run with further potential gains.Bitcoin after taking multiple support at $40,000 resumed the up move and rallied up to $52,985. The asset was facing stiff resistance at $52,000 and started consolidating between $52,000 and $50,000. Post this move, BTC finally gave a breakout above the range and surged up to $6,248. The asset has a strong resistance at $64,000 and $69,000 and to further rally it needs to break, close and sustain above these levels. $52,000 and $56,000 will act as a strong support for the asset."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMilwJBVV95cUxNRm90bVhsVVFCMEROQXpOR0V3OHI3Uk5DU1FzWGlCcDNZeEFXSS1GR3Ztb3NzVDNtUnd1dHZFZ3VHaDZuR05KRzF6REotQlppWGhHSS15ZDVPU0d1b20zVElQWmlheU5nWWFVMFlEMVloRWpFR1U2UWJaNXQ4N2dnc2xDX3htZzFGWFFtMWNwWG5CTUVwc3RuQUJkTXJKOExkeXR1Q21IMWlZaFU1bUhBWTZMWk01V09fV1FqVE1sZUdTMkN2LUZpMWRFVmVFRV9rU3BOMUU0R0JCZUhyRllFNmh2WS1XVElGbWt1Vkt6RF9RXzZ6TXVyN0VmVi13SUNMdXdndjN5OGhTTHpsQTFyZ0xzYko5R03SAZwCQVVfeXFMTmZPd3ZyWjVuYVJvSVdIUjdGMnh2NGRiVWZCaERyVDJZRVFqSkFjN0RKS1RXT1BLWVNBM1pDRGowOS1HRTZINk50QXI0VHc5TmxaSmFELWFNRnRrZDdwN21vbjFvT29BWHhuSmJSYWVNczA4cUlvQVlWZFJtVDdoUkZOZzRwWjdzZlBWUUF4X0pzd2hnX1NodEYzQS1YeEFFdGZhWEltN09Pdl9RbDJCakcyX1ZhVEYxZ3pkT014XzdieWpIY2djVXJjdDRpVHJFRHlTTGZCaDNrTi1qRXZMQnJvaUxGSVEzT3g1cDhnUE5TTDZoQ3NkUE1LM1ZEaVQ3N0s3Vnp0dFFlUVllMkVuOGtJVkpUMGgtdFZFR1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Mar 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price on March 4: Bitcoin trades above $63,000; Dogecoin, Shiba Inu jump up to 11% - The Economic Times",
        "content": "Tech view by ZebPay trade desk\n\n\n\nAgencies\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nTop cryptocurrencies were trading higher in Monday's trade. While Bitcoin rose 2.2% in the last 24 hours and traded at $63,275 around 11:21 am IST, other major cryptos such as Cardano, Ethereum, Dogecoin , Shiba Inu, and Polkadot surged up to 11%. However, a few of the top crypto tokens such as Avalanche, Chainlink, Polygon, Solana, and XRP were the laggards.Meanwhile, the global cryptocurrency market cap surged 1.5% to around $2.38 trillion in the last 24 hours.\"Bitcoin traded above the $63,000 mark over the weekend. The upswing in price is attributed to growing mainstream adoption of spot Bitcoin ETFs and the approaching Bitcoin Halving event. BTC is eyeing towards $67,150 resistance level, if the momentum continues, a close above it this week could signal the potential for a new all-time high,\" said Edul Patel, CEO of Mudrex.Meanwhile, Shivam Thakral, CEO of BuyUcoin, said, \"Ethereum, on the other hand, is trying to break the $3,600 level, which could potentially push the second-largest cryptocurrency beyond $4,000.\"The total crypto market volume over the last 24 hours is $110.12B, which makes a 28.38% increase. The total volume in DeFi is currently $9.6 billion, 8.71% of the total crypto market 24-hour volume. The volume of all stablecoins is now $129.27 billion, which is 88.33% of the total crypto market 24-hour volume, as per data available on CoinMarketCap.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, surged to $1.244 trillion. Bitcoin's dominance is currently 52.36%, according to CoinMarketCap. BTC volume in the last 24 hours rose 65.6% to $34.75 billion.\"In the past 24 hours, around $59.27 million worth of Bitcoin positions, with $38.52 million in shorts, were liquidated. This surge is linked to the growing mainstream adoption, notably propelled by the introduction of Spot Bitcoin ETFs, cultivating a stronger holding mentality among investors,\" said Rajagopal Menon, Vice President at WazirX.Bitcoin's recent surge to over $62,000 has captivated crypto enthusiasts and surprised sceptics alike, marking a period of exponential growth. The rally witnessed in February even set a record, representing the longest monthly green candle in Bitcoin's history. Despite this remarkable rise, several key factors and upcoming events suggest that this may just be the beginning of a significant bull run with further potential gains.Bitcoin after taking multiple support at $40,000 resumed the up move and rallied up to $52,985. The asset was facing stiff resistance at $52,000 and started consolidating between $52,000 and $50,000. Post this move, BTC finally gave a breakout above the range and surged up to $6,248. The asset has a strong resistance at $64,000 and $69,000 and to further rally it needs to break, close and sustain above these levels. $52,000 and $56,000 will act as a strong support for the asset."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE5idWVkelZsSzFUdVVDRnA2SlI0R19Fb1d5U2J1VGNHR2RVa3lwMjBISWpFbjg1OExFWGtmMnNxY1FEVVpDZTBHQ2JEaUpGN216T1g4MFZNUWhmSFJ4djNMZldB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Mar 2024 08:00:00 GMT",
        "title": "As Ethereum’s Dencun upgrade nears, here is all you need to know - crypto.news",
        "content": "Discover how Ethereum’s Dencun upgrade could enhance security and reduce transaction fees.\n\nThe Ethereum (ETH) network is set to receive a major update named “Dencun,” a blend of two smaller upgrades, Cancun and Deneb. The upgrade is expected to significantly reduce layer 2 (L2) transaction fees and enhance Ethereum’s scalability, efficiency, and security.\n\nThe Ethereum upgrade date is scheduled for March 13, with a Feb. 27 entry on the Ethereum Foundation Blog announcing that it has been successfully activated on all test networks, including Goerli, Sepolia, and Holešky.\n\nquick notes from the eth dev call this morning, acdc #128:\n\ndencun 🐡\n\n– all client teams, except lodestar, have released final software versions for the dencun upgrade\n\n– these versions plus the dencun-ready candidate client for lodestar are currently being tested on one last… — Christine Kim (@christine_dkim) February 22, 2024\n\nSo, what is the Ethereum Dencun upgrade? Read on to find out why it is causing so much excitement among the Ethereum community.\n\nEthereum’s journey and its next big step\n\nIn December 2020, Ethereum introduced the Beacon Chain, which brought in the proof-of-stake (PoS) consensus mechanism and allowed for ETH to be staked—this was essential for moving Ethereum away from the older proof-of-work (PoW) consensus method.\n\nBy September 2022, Ethereum had made a big move called “The Merge,” linking its main network with the Beacon Chain and switching completely to proof-of-stake. In April 2023, the Shanghai upgrade allowed users to withdraw staked ETH, making it easier for validators (people who help verify transactions) to manage their stakes.\n\nOn Sept. 28, 2023, Ethereum launched a new testing network called Holešky, which supports 1.4 million validators and is a foundational step for the ETH Dencun upgrade.\n\nMany have asked what is the main goal of Ethereum’s Dencun upgrade. Looking back, the earlier Ethereum network upgrades were more about laying the groundwork for a more sustainable and secure Ethereum rather than directly tackling the issue of scalability.\n\nThe Merge was about moving to a greener and more efficient system of verifying transactions, and the Shanghai upgrade improved how people can stake their ETH. The ETH Dencun update, a fusion of two pivotal enhancements, is seen by many as the culmination of the journey started by previous upgrades to turn Ethereum into a faster, more secure, and more scalable network.\n\nThe first part of the upgrade, Cancun, focuses on the “execution layer”—how transactions are processed and managed. The second part, Deneb, tackles improvements in the “consensus layer,” which is all about how network participants agree on the state of the blockchain.\n\nEnhancements for a better Ethereum\n\nThe Dencun upgrade brings several technical improvements to solidify Ethereum’s infrastructure. For instance, it introduces techniques for more streamlined data management and smarter contract security, along with tweaks that promise to make Ethereum run smoothly and cost-effectively for its users.\n\nIt also aims to improve the experience for those who stake ETH, making it easier and more beneficial for users to participate in the network’s security.\n\nProto-danksharding\n\nAmong Dencun’s spotlight features is proto-danksharding, which was introduced through a specific Ethereum Improvement Proposal (EIP) known as EIP-4844. In simpler terms, this feature is about making Ethereum more scalable by efficiently managing large chunks of data.\n\nIt employs a method that temporarily holds transaction data, making the process smoother and cheaper.\n\nTraditionally, all transaction data is kept on the blockchain permanently. However, this new approach introduces a way to include large chunks of data (blobs) in transactions without storing them forever.\n\nIts proponents claim it will make processing transactions faster and cheaper, especially for rollups. Rollups bunch several transactions into one, reducing the workload and cost (gas) of recording them on the Ethereum network.\n\nWhile rollups are already a step forward in managing transactions more efficiently, they still leave room for improvement. Until now, the data collected by rollups had to be stored permanently on the blockchain, taking up space and potentially slowing things down.\n\nProto-danksharding proposes a way for this data to be temporarily stored and removed after a specific time. It is done by creating a summary (or commitment) of the data, which ensures that even after the detailed data is deleted, the integrity of the transactions is not compromised.\n\nWhat’s more, this approach means that only temporary storage of data is necessary, significantly reducing the clutter and maintaining the speed and efficiency of the Ethereum network. This temporary storage could last a few months before the data is deleted to prevent an overload of unnecessary information.\n\nImproved security and performance\n\nThe most recent update to Ethereum introduces several EIPs aimed at making the network more secure and efficient.\n\nA standout feature is EIP-4788, which enhances how information travels within Ethereum, particularly improving the connection between its execution and consensus layers. In the past, these layers worked together as separate entities, ensuring that for every block of data in one layer, there was a corresponding block in the other.\n\nHowever, getting these layers to talk to each other could be quite complicated, sometimes even needing extra help from external services.\n\nWith the new upgrade, this process gets simpler by incorporating a summary from the consensus layer directly into the execution layer’s current block of data. This summary acts like a bridge, allowing direct access to the consensus layer’s information without needing a middleman, making the system more trustworthy.\n\nFurthermore, this update supports Ethereum’s apps by keeping a log of these summaries in a smart contract, making it easier to check on the consensus layer’s status.\n\nYou might also like: Grayscale: Ethereum’s Dencun upgrade driving price upward\n\nImproved staking\n\nDencun is also on a mission to improve the staking experience on Ethereum.\n\nProposals like EIP-7044 and EIP-7045 aim to streamline the process of exiting and making attestations, making it more user-friendly. Here’s a simple breakdown:\n\nEIP-7044 is expected to simplify earning rewards from Ethereum for those who prefer not to be full validators. Since Ethereum transitioned to a Proof of Stake (PoS) model, individuals can earn rewards by staking 32 ETH. However, those who are not interested in managing the technical aspects of being a validator can opt for delegated staking. With delegated staking, they stake their ETH through a third party while retaining control over their assets. Previously, stopping staking with a specific validator required a pre-signed exit message, which relied on trust. EIP-7044 aims to make these exit messages permanent, providing more security and peace of mind.\n\nMeanwhile, EIP-7045 seeks to improve the Ethereum network’s efficiency and competitiveness. For a block to be considered official, it needs validations or attestations from validators. Currently, validators have a limited time window to submit these attestations. However, EIP-7045 proposes to extend this period significantly. This change would allow more validators to earn rewards and, importantly, speed up the confirmation of blocks on the blockchain.\n\nEnhanced cost efficiency\n\nThe forthcoming update will also introduce significant cost-efficiency improvements, particularly those highlighted by innovations such as EIP-5656 and EIP-1153.\n\nThese changes focus on streamlining smart contract functionality and enhancing temporary storage techniques. Specifically, EIP-5656 introduces an operation code, or opcode, called MCOPY, aimed at boosting the efficiency of memory copying within the Ethereum Virtual Machine (EVM).\n\nThis opcode simplifies the process by replacing the previously cumbersome method involving MSTORE and MLOAD opcodes, offering a more streamlined and effective approach.\n\nFurther addressing efficiency, EIP-6780 targets the controversial SELFDESTRUCT opcode. While widely used in numerous smart contracts, its problematic nature has caught the community’s attention.\n\nThrough EIP-6780, the goal isn’t to remove SELFDESTRUCT entirely—which would impact existing contracts—but to render it obsolete for future applications, effectively sidelining it without direct elimination.\n\nThese improvements are all about making Ethereum staking more flexible, secure, and efficient for everyone involved.\n\nSimplifying Ethereum’s growth\n\nAnother proposal in the next Ethereum upgrade is EIP-7514, and it’s all about managing how many new validators can join Ethereum at once. Too many validators joining too fast could cause problems, like making some tasks harder or leading to too much control being in the hands of a few big players.\n\nNext up, we continued a conversation from last week's ACDC call, about whether to add a constant cap to the validator activation queue. The proposal had since then been formalized as EIP-7514: https://t.co/sd4D4GlMRY — timbeiko.eth ☀️ (@TimBeiko) September 14, 2023\n\nEIP-7514 plans to limit how many new validators can start in each epoch (a set period in the Ethereum network) to 8. This change aims to make the growth of validators more steady instead of jumping up fast. It’s like inviting only a certain number of people to a party to make sure it doesn’t get too crowded.\n\nAnother important part of this proposal is that it treats joining and leaving differently. More specifically, the limit only applies to new validators joining, not those wanting to leave.\n\nWhile it might seem like a small tweak, it’s an important step to keep Ethereum running smoothly and ensure it’s ready for future changes and growth. By doing this, Ethereum hopes to maintain its security and decentralization, ensuring no single group has too much power and keeping the network accessible and fair for all users.\n\nA cautious yet optimistic outlook\n\nWhile the Dencun upgrade offers promising prospects for enhancing Ethereum, developers are proceeding with caution. Introducing new consensus mechanisms and architectural changes could bring unforeseen complexities and operational hurdles.\n\nAdditionally, network upgrades inherently involve uncertainty, as unexpected technical issues may temporarily affect user experience and network stability. Concerns include potential challenges related to storage capacity and data management with the introduction of larger data blocks.\n\nTo fully embrace this transformative upgrade, stakeholders must exercise prudence and conduct thorough due diligence.\n\nNevertheless, the anticipation surrounding the next Ethereum upgrade underscores a strong belief in its benefits, reaffirming the network’s commitment to continuous improvement."
    }
]