[
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOZmV5WHVZTDJxeGl5ekpGMHIwMmpTdTI2UXdVckdJSC1zSkdyR19SY3J4bWg5N01YQjJsMXVwYXNYRkRORWw3dWplSEx3aU1IMWNIbU5rNDVlLU1vZ1ByV2QweEt6MllIcnVQbTZPNXByMWI3Y29yUmhvN3Bnc2VGaVBPVmo2a2ozQ0l1TkwybHN5bDJNeFdyMmVWMVp3OUQxSUJmNTVkT0VPdnZERzYyZ29JNzRrb05IR0R0a0MzMld4aDMwb2NWQXAyMEZVYkRSUzVMb0NOT2NpYUFTT2k4MEhlWFJRQk04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Secures 'Momentous' Win After SEC Closes Security Probe: Whale Accumulates Over $19M Worth Of ETH In Immediate Aftermath - Benzinga",
        "content": "ConsenSys, a blockchain software company, announced a major victory for Ethereum ETH/USD, following the closure of the SEC’s investigation into whether the world’s second-largest cryptocurrency is a security.\n\nWhat Happened: On Tuesday, ConsenSys took to X to reveal that the regulator will not move forward with the charges alleging that sales of Ether are securities transactions.\n\nThe announcement followed a letter sent by ConsenSys to the SEC on June 7, asking for confirmation that the Ether spot ETF approvals last month, based on ETH being a commodity, would lead to the closure of the investigation.\n\nETHEREUM SURVIVES THE SEC.\n\n\n\nToday we're happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0.\n\n\n\nThis means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nSee Also: Bitcoin, Ethereum, Dogecoin Go Sideways, But ‘Market Structure Back To Bullish,’ Says Trader\n\nConsenSys emphasized that the closure of the Ethereum investigation, while significant, does not resolve all issues faced by blockchain developers, technology providers, and industry participants under the SEC’s crypto enforcement regime.\n\nThe company now seeks a declaration that its software offering MetaMask Swaps and Staking does not violate securities laws.\n\nThe positive news also got whales excited, with one investor scooping 5,603 Ether, worth $19.6 million, in the aftermath, according to Lookonchain.\n\nAfter @Consensys posted that the #SEC had closed its investigation into #Ethereum 2.0, the whale bought another 5,603 $ETH($19.6M).\n\n\n\nThe whale has withdrawn 16,604 $ETH($59M) at an average price of $3,600 from #Binance since May 30.https://t.co/NYbgSJevaT pic.twitter.com/N3vsISPeyX — Lookonchain (@lookonchain) June 19, 2024\n\nWhy It Matters: In April, ConsenSys alleged that the SEC had been covertly targeting Ethereum for over a year, scrutinizing its nature and whether it should be classified as a security.\n\nIn response, ConsenSys filed a lawsuit against the SEC, arguing that the SEC is overstepping its authority by attempting to regulate Ether.\n\nFor context, the CEO of ConsenSys, Joseph Lubin, was one of the co-founders of Ethereum.\n\nPrice Action: Reacting to the development, Ether spiked 3.32% to trade at $3,549.33, according to data from Benzinga Pro.\n\nRead Next: Bitcoin, Ethereum, Dogecoin Trade In The Red As Summer Doldrums Kick In: Analyst Says ‘We Are Early In The Cycle’"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE41V1Z0bTMyMXkyWUF4M2xvVjl2Q1BNUThIUG96S0FYLTVxM2lzRllVMjFMSEw5cGFOU3p2bXRrY0VZUDhySkpCSFVHZzBQM0NvUnBQbWtkZkRNaHExRmF6dVp2Tnp2YUh6dXlKVTNMd1F3RDR3Ny11andnSdIBgAFBVV95cUxNSDhpWjZYenYzd1g3dmlUMjBrdnNTU3VEM3BUUlNjOE1veWxCejlzRkNKTndZWU5KeGVBS2c5M1ZoMjJpRTN3dGZMZ0RRaXZhZ1NNN2xXWVo5MndWb3NyeG5MZnlpeHZ0bmc1VUxFbFpyVUtfOXlMbGFmS3VaQ2ZmUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Wins As US SEC Ends Securities Investigation - Bitcoinist",
        "content": "The crypto industry received a significant jolt of clarity and optimism as the US Securities and Exchange Commission (SEC) concluded its investigation into Ethereum 2.0, announcing that it will not pursue any enforcement actions. This decision marks an important victory for Ethereum and could serve as a critical reference point for the treatment of digital assets under US securities law.\n\nEthereum Is Not A Security\n\nIn 2018, the SEC made a key distinction that Ether was not a security. However, by 2023, amidst evolving functionalities and the transition to Ethereum 2.0, the SEC revisited this stance, hinting at possible regulatory oversight. This shift led to increased scrutiny and uncertainty within the Ethereum community, culminating in a lawsuit filed by Consensys on April 25, 2024. The lawsuit aimed to confirm the classification of ETH as a commodity, arguing that the SEC lacked jurisdiction over its trade and governance.\n\nIn a pivotal response dated June 7, 2024, Consensys urged the SEC to acknowledge the approvals of Ethereum-based ETFs made earlier that May, which were predicated on the assumption that ETH is a commodity. Consensys argued this should conclusively end the SEC’s investigation into Ethereum 2.0.\n\nThe SEC’s Enforcement Division officially responded on June 18, 2024, as communicated in a letter addressed to Kevin S. Schwartz, attorney for Consensys. The letter stated, “We write to provide notice that we have concluded the investigation in the above-referenced matter […] based on the information we have as of this date, we do not intend to recommend an enforcement action by the Commission.”\n\nImportantly, the SEC underscored that this closure should not be seen as an exoneration or that no action may ultimately result from the staff’s investigation. Nonetheless, Laura Brookover, a lawyer at Consensys, underscored the significance of this development, stating, “The SEC sent us a closing letter in the Ethereum 2.0 investigation today. Things have changed remarkably fast since we filed our lawsuit against the SEC in late April, culminating in today’s development.”\n\nThis resolution can be perceived as a critical moment for the broader crypto industry, particularly in how digital assets are classified and regulated. Alexander Grieve from Paradigm noted the tone of the SEC’s notification, commenting, “They’re pretty hedge-y/evasive in their notification—BUT it is relatively unusual for the SEC to specifically highlight to a company that they’ve closed an investigation.”\n\nThe closure of this investigation without enforcement action could set a precedent for how other cryptocurrencies are treated by regulatory agencies, potentially easing the regulatory environment for digital assets.\n\nWhile the immediate threat of an enforcement action has been alleviated, Consensys and the wider crypto industry are looking towards further clarifications in regulatory policy. Consensys in their lawsuit also seeks a federal court ruling regarding their operations, asserting that they do not act as brokers nor issue securities through their software offerings like MetaMask Swaps and Staking.\n\nAs stated in their lawsuit, “Consensys is built on creating software products that allow people around the world to use and build on top of the Ethereum network, and it is entitled to run its business without the cost, burden, and uncertainty of an unlawful enforcement action.”\n\nAt press time, the price of Ether (ETH) has responded favorably to the SEC’s decision, showing a notable increase of 3.3%, bringing it to a current trading price of $3,561.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQNVJGQ1NwZXd1TXl5WkxOVFdpSEFaMmNDc2loSktxeHk2d0drN0xtZi1Jc3JkZ0otMUk3bWRYOEEtN0p3OWRFZkVURlo4NnpaYklYMENPVy1BNHVFUkhnYksxeE5WWUxHYk4tRzhfSGNCV2FTbk02eFEtLXdYUHRKNVFxaEtLbzRVY29VMzdTSGwzckc4a3VZbUwxMDRYMW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "What Will Allocations Look Like in Combined Bitcoin and Ethereum ETFs? - Unchained",
        "content": "After the first combined ETF was filed today, what will other issuers do regarding the allocation to BTC and ETH?\n\nAs the first combined BTC/ETH ETF was filed, what can we expect from future allocations?\n\nOn Tuesday, as the market eagerly anticipates the full approval of spot Ether ETFs, Nasdaq filed for a combined Bitcoin and Ethereum ETF. This new ETF, managed by Hashdex, will allocate 70.54% to bitcoin and 29.46% to ether. These allocations are based on the relative free float market capitalizations of bitcoin and ether.\n\nBut, is this the only way newly combined ETFs will allocate to bitcoin and ether? And what impact might this have on the market?\n\nRead more: There Are Now 11 Spot Bitcoin ETFs. Here’s the One That’s Best for You\n\nWhy Combined ETFs Matter\n\nThe introduction of combined BTC and ETH ETFs is significant for several reasons. Firstly, these ETFs offer investors diversified exposure to the cryptocurrency market without having to choose between Bitcoin and Ethereum. This diversified approach might attract more inflows, especially from more conservative investors, as it mitigates the risk associated with investing in a single asset. By holding both BTC and ETH, investors can benefit from the possible upside of both leading cryptocurrencies, potentially stabilizing returns compared to single-asset ETFs.\n\nThe structure of combined ETFs could also impact the prices of BTC and ETH. As these ETFs gain popularity, increased demand for the underlying assets could drive up their prices. If there are ETFs that allocate more to one asset or another, it could be positive for that specific asset.\n\nNate Geraci, president of the ETF Store, explains that the success of broad commodity ETFs suggests that combined crypto ETFs could find a larger audience “due to the novel nature of the category.”\n\n“Some investors and advisors will prefer a diversified approach to an emerging asset class like crypto versus attempting to pick winners and losers,” Geraci told Unchained. He believes that once additional crypto assets are available in an ETF wrapper, such as SOL or XRP, we can expect to see various index-based and actively managed strategies.\n\nAllocation Strategies\n\nGeraci believes that, as in the Hashdex ETF, the division should be reflective of their respective market caps. “Ether is currently valued at about one-third the market cap of Bitcoin. I think that’s a reasonable proxy for what spot Ether ETF demand will look like compared to spot Bitcoin ETF demand,” Geraci told Unchained. And despite the lack of staking options in the initial spot Ether ETFs, Geraci believes this won’t significantly deter demand.\n\nHowever, Geraci also expects the emergence of multiple flavors of combined BTC and ETH ETFs, including market cap-weighted and actively managed products. “Market cap-weighted products will hold BTC and ETH in the proportions described above. Actively managed ETF holdings will be dictated by the manager and prevailing market conditions,” he notes, indicating potential variability in allocations based on market dynamics.\n\nScott Johnson, general partner at Van Buren Capital, suggests that combined BTC and ETH ETFs might feature a 50/50 split or follow some type of index-weighted approach. “To the extent these come online in the near term, you might see a 50/50 or some type of index-weighted allocation,” Johnson told Unchained via email.\n\nLooking at other markets, such as Canada, where crypto ETFs have been available for several years, provides valuable insights. For example, the Evolve Cryptocurrencies ETF is weighted on a market capitalization basis and rebalanced monthly. As of the latest data, this ETF allocates 71.90% to Bitcoin and 28.10% to Ethereum.\n\nMeanwhile, CI Financial offers the CI Galaxy Multi-Crypto ETF, an actively managed ETF, and uses a rules-based, momentum-signaling strategy, allocating roughly 50/50 to BTC and ETH.\n\nLearn more: Bitcoin ETFs Explained: What Are They & How Do They Work?"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE05VlY3V2V3c3Fld25xZ2pnLTRFVXM1OWEzRWpyZnRyRDVNOTZqUzJMYnZmMGVwaTRjSUlaUTdHUXA3blVkcmJWMjNwX3FtQ2hWdktMUjlBVGNQN25lYUY3aGN1a0NXa2d6NVdTdklMNVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "The dark side of tokenisation - Financial Times",
        "content": "Print this page\n\nThe writer is a law professor at the American University Washington College of Law\n\nTraditional financial institutions are increasingly showing interest in “tokenising” real-world assets, meaning they are curious about how these assets could be digitally represented by programmable tokens recorded on shared ledgers. There could be real efficiency gains associated with tokenisation, but the drive towards it could also take a dark turn.\n\nThe most dangerous outcomes would arise if tokenisation of real-world assets were pursued simply to feed into what has been described as “the perpetual motion machine that is crypto trading”. Regulators around the world have expressed concerns about the integration of crypto and traditional financial markets, because of the high levels of volatility, leverage, concentration and operational risk associated with the crypto markets. This integration would be sped up if ownership of tokenised real-world assets were recorded on so-called permissionless public blockchains. The type of ledger favoured by the crypto industry, these blockchains can be accessed by any computer running the necessary software to host them, no identification or vetting required\n\nThe tokenisation of real-world assets can and should proceed without using these problematic blockchains. Their inefficiencies are well documented, and experimentation to resolve problems in scaling their use tends to focus on processing transactions off the blockchain (defeating the stated goal of decentralisation).\n\nIt is perhaps less well appreciated that these kinds of blockchains are also plagued by governance problems. We cannot simply trust in the code of the blockchain. Public permissionless blockchains are “designed by people, maintained by people, and governed by people”, as one research paper put it. but we don’t necessarily know who these people are, who pays them, or if they’ll show up in an emergency. This is an untenable position for critical financial infrastructure.\n\nUnfortunately, BlackRock has chosen to host its tokenised Buidl fund on the public permissionless Ethereum blockchain. The good news is that some other financial institutions have taken a different path, and are experimenting with other kinds of ledgers to see if tokenisation yields efficiencies in their markets.\n\nEfficiencies can arise from programmability, meaning that software known as “smart contracts” can be built into the tokens to allow for the automation of functions, like interest payments. Smart contracts can also be used to build bespoke financial products out of multiple tokenised assets — this is known as composability. Ownership of tokenised assets can also be split into smaller pieces in a process known as fractionalisation. When ownership of all tokenised assets used in a single transaction is recorded on the same ledger, the transaction can be settled “atomically”, or simultaneously, 24/7.\n\nCross-border payments seem particularly ripe for improvement through tokenisation, but we shouldn’t rush to tokenise everything. Some purported benefits (particularly those relating to financial inclusion) are overhyped. And where efficiencies gains are real, they can invite corresponding fragilities. Even when divorced from crypto, there is a dark side to tokenisation.\n\nTokenisation promises to bring more real-world assets into the financial markets, and to engineer them into new categories of bespoke financial products both big (through composability) and small (through fractionalisation). This may unlock liquidity and efficiencies in good times, but we learned in 2008 that illiquidity, deleveraging and fire sales will be on the menu when things turn south. Discretion and forbearance (for example, with regard to margin calls) are often critical to containing the damage in these circumstances, but obligations automated with smart contracts will inflexibly self-execute regardless of context.\n\nIn addition, smart contract software provides another attack surface for hackers, and the more comprehensive the underlying ledger, the more attractive a target it becomes for cyber attacks. Atomic settlement also deprives markets of the benefits of netting of transactions.\n\nIf we think back to 2020, we learned the hard way that supply chains could become brittle when the unexpected occurred; now there is increasing interest in production strategies that are less efficient, but more resilient. We should explore tokenisation with the same mindset. We need to ask “when something is efficient enough, will making it more efficient introduce too many fragilities and be counterproductive in the long run?” In the best-case scenario, tokenisation experimentation will spur the financial industry to start thinking intentionally about this question.\n\n."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE05VlY3V2V3c3Fld25xZ2pnLTRFVXM1OWEzRWpyZnRyRDVNOTZqUzJMYnZmMGVwaTRjSUlaUTdHUXA3blVkcmJWMjNwX3FtQ2hWdktMUjlBVGNQN25lYUY3aGN1a0NXa2d6NVdTdklMNVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "The dark side of tokenisation - Financial Times",
        "content": "Print this page\n\nThe writer is a law professor at the American University Washington College of Law\n\nTraditional financial institutions are increasingly showing interest in “tokenising” real-world assets, meaning they are curious about how these assets could be digitally represented by programmable tokens recorded on shared ledgers. There could be real efficiency gains associated with tokenisation, but the drive towards it could also take a dark turn.\n\nThe most dangerous outcomes would arise if tokenisation of real-world assets were pursued simply to feed into what has been described as “the perpetual motion machine that is crypto trading”. Regulators around the world have expressed concerns about the integration of crypto and traditional financial markets, because of the high levels of volatility, leverage, concentration and operational risk associated with the crypto markets. This integration would be sped up if ownership of tokenised real-world assets were recorded on so-called permissionless public blockchains. The type of ledger favoured by the crypto industry, these blockchains can be accessed by any computer running the necessary software to host them, no identification or vetting required\n\nThe tokenisation of real-world assets can and should proceed without using these problematic blockchains. Their inefficiencies are well documented, and experimentation to resolve problems in scaling their use tends to focus on processing transactions off the blockchain (defeating the stated goal of decentralisation).\n\nIt is perhaps less well appreciated that these kinds of blockchains are also plagued by governance problems. We cannot simply trust in the code of the blockchain. Public permissionless blockchains are “designed by people, maintained by people, and governed by people”, as one research paper put it. but we don’t necessarily know who these people are, who pays them, or if they’ll show up in an emergency. This is an untenable position for critical financial infrastructure.\n\nUnfortunately, BlackRock has chosen to host its tokenised Buidl fund on the public permissionless Ethereum blockchain. The good news is that some other financial institutions have taken a different path, and are experimenting with other kinds of ledgers to see if tokenisation yields efficiencies in their markets.\n\nEfficiencies can arise from programmability, meaning that software known as “smart contracts” can be built into the tokens to allow for the automation of functions, like interest payments. Smart contracts can also be used to build bespoke financial products out of multiple tokenised assets — this is known as composability. Ownership of tokenised assets can also be split into smaller pieces in a process known as fractionalisation. When ownership of all tokenised assets used in a single transaction is recorded on the same ledger, the transaction can be settled “atomically”, or simultaneously, 24/7.\n\nCross-border payments seem particularly ripe for improvement through tokenisation, but we shouldn’t rush to tokenise everything. Some purported benefits (particularly those relating to financial inclusion) are overhyped. And where efficiencies gains are real, they can invite corresponding fragilities. Even when divorced from crypto, there is a dark side to tokenisation.\n\nTokenisation promises to bring more real-world assets into the financial markets, and to engineer them into new categories of bespoke financial products both big (through composability) and small (through fractionalisation). This may unlock liquidity and efficiencies in good times, but we learned in 2008 that illiquidity, deleveraging and fire sales will be on the menu when things turn south. Discretion and forbearance (for example, with regard to margin calls) are often critical to containing the damage in these circumstances, but obligations automated with smart contracts will inflexibly self-execute regardless of context.\n\nIn addition, smart contract software provides another attack surface for hackers, and the more comprehensive the underlying ledger, the more attractive a target it becomes for cyber attacks. Atomic settlement also deprives markets of the benefits of netting of transactions.\n\nIf we think back to 2020, we learned the hard way that supply chains could become brittle when the unexpected occurred; now there is increasing interest in production strategies that are less efficient, but more resilient. We should explore tokenisation with the same mindset. We need to ask “when something is efficient enough, will making it more efficient introduce too many fragilities and be counterproductive in the long run?” In the best-case scenario, tokenisation experimentation will spur the financial industry to start thinking intentionally about this question.\n\n."
    }
]