[
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBKNUxXTFZRQUplR2F0Q2ZxWTJERUp1ZVJtdVo0UkJZU0l3bXRGcmtEMHA2TUNTb3d2QXc1NkZaQVZEWUNzdE1tRE5DRkFtaTgzTGRCRDc0MllNaDNKcWpWcmp5eTN3bjA40gFuQVVfeXFMTmwzeVNNbnR4SUlIeUtEOFdSUVVlQ0ZwNU1RWV9wdS1TMnNqa2NyR3BtU2JLN2xUUnZUbUF3SWtrNjZDN00yR1FqR0dtYXVkaENuc1NUSllPZWhxdDNfeUhoTVZrSV8zMGNzMkIzM2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Loses Critical Support Level - U.Today",
        "content": "Ethereum fell below the $3,700 threshold, failing to break through the consolidation channel. With the price failing to surge upward, we might see another period of consolidation where the moving average could catch up with the massive volatility witnessed a few weeks ago and potentially provide some ground for a rally continuation.\n\nAdvertisement\n\nSince this level has been a crucial area of support for ETH, the recent decline below $3,700 is especially raising some concerns and questions. If it breaks below, it may indicate that bulls need to reorganize as bears are becoming more powerful.\n\nSharp swings in price action are characteristic of a volatile asset like Ethereum. Based on the current trend, it appears that ETH is having difficulty keeping up its upward momentum.\n\nEthereum went through a consolidation phase, fluctuating between support and resistance levels, as the chart illustrates following a significant rally. This type of activity typically occurs before a notable change in price either upward or downward.\n\nAdvertisement\n\nA deeper drop toward the 200-day MA, a more reliable measure of the direction of the long-term trend, could occur if it is unable to hold. In the near run, this might entail increased downside risk. An additional important consideration is volume.\n\nHigher-than-average trading volumes were seen along with the recent decline, suggesting that sellers are more active. This could indicate that more traders are cutting their positions, which would put more pressure on the price to decline. The RSI, on the other hand, is circling around neutral. This shows that Ethereum has room to recover if the mood of the market turns around, and it is neither overbought nor oversold."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNenBhVS1CRTFxMUd4X0pMSDlyU1IxYjU3YTJvVE1SSFpvSDhpXzVwUnE1cEt4SGhGWVVoTGFqMElyWEl2SXhiRmo2bm15Y3pJUnZoZXoteWFqbjBrdmN3VkEtb2Iwa19LVUIxdG1ITUxEQXNtSDYxeVMxcVZQdU56cFk0NmlnWHAzUGt0bkR2OHBVaUpMOEFn0gGcAUFVX3lxTE9SNzRCelhaTGxLVnBkdS1MWG5SdVktVnk5TzZPLTBRZ0J4N2VzR2k1LWFqbDBCXzRBMS14Y0cwOUN6dDdaQXFGMC1YU3FpY3ItTGNQUnlYb1FwTmwtWmJKaXBRQU1rMEsxVVd0dE9fdEQ2Qno5MjNVOHpiRTB0WlFKVURacWhQaHpwX2tBa2N0cTJKQko1NnY0OXdHQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Top Ethereum Contributor Makes Epic U-Turn With Unexpected Gas Fee Statement - U.Today",
        "content": "Hayden Adams, the founder and CEO of Uniswap Labs, recently made a surprising statement about transaction fees on the ETH network. Adams, who leads the largest decentralized exchange on Ethereum, declared that users should never have to worry about \"gas fees.\" This unexpected opinion has added a new dimension to the ongoing debate about Ethereum's high transaction costs.\n\nAdvertisement\n\nAdams' statement comes amid a heated discussion about the expenses associated with Ethereum transactions. Recently, artist Iggy Azalea commented on the issue, questioning how gas fees are used and expressing skepticism about their impact. Although Azalea incorrectly assumed that all fees directly benefit Ethereum's founders, her comments have once again highlighted the issue of high transaction costs.\n\nNo user should ever have to hear the term “gas fee” Advertisement June 8, 2024\n\nThe debate over Ethereum's gas fees has become more intense with the rise of Solana, a blockchain known for its lower transaction costs. Solana's recent performance has led some to speculate about the blockchain's future and its ability to compete with more affordable alternatives.\n\nKey Ethereum developers, including co-founder Vitalik Buterin, have been addressing the gas fee problem for some time. Last month, Buterin introduced EIP-7706, a proposal aimed at optimizing transaction calldata and reducing gas usage. This proposal includes a new type of gas specifically for calldata transactions, with the goal of creating a separate fee market and making calldata more affordable.\n\nAmid Adams' words, Uniswap has continued to succeed, earning over $3.64 billion in total commissions to date. In the past 24 hours alone, Uniswap collected $1.62 million in fees, and over the last month, it amassed $65.95 million."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPb0pZd0wtdVU2UVdOVHVXRzJVSkRFMmpDMUMtdk40Sll3LXN3T2V2QWhDUVZ3V3ppWC1ZOTlQc1hNc2JoTTZGUmM4elhiMGUzMjgxQ2ozZUVMRE9xRUFpZ2N1enVvR1JzMTExSEZRZUcwcTJjTzl1Q2NTa1VZMFd2YU5nN2ZndlHSAYwBQVVfeXFMUGlOaEF2QnRneUpiSEdOMUNEWUJ2MnRJMWZpeEtuTi1iSmVTVGNDWlQxaWpGVC1USlEtN3c0QlBNS3NZOEdyaEZvbXFNRVRtSVhZSDNtVjZ6amt1aUpVZmRadFd4bHRYM2dhalZDYjBWdlRQSGZfM0FGY18wRHBwZE1qRmZKUTU5aGZjVkI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s rally halts: Examining ETH’s potential next moves - AMBCrypto News",
        "content": "Ethereum’s current decline signaled a cooling-off from its recent highs\n\nDerivative data pointed to continued market interest.\n\nEthereum [ETH] seems to have come off its ETF hype-induced rally as bulls have started to take a hike.\n\nAt press time, the largest altcoin in the world has seen a decrease of 3.7% over the past day and 2.5% over the past week as the market awaits the approval of the S-1 forms for the ETFs. So, is the rally over already?\n\nAMBCrypto’s analysis of TradingView saw that Ethereum has been unable to maintain its highs and is now consolidating at lower levels.\n\nThe Moving Averages (MA50 in blue and MA200 in red) indicated a cooling-off period.\n\nInitially, the price surged above both moving averages in a strong bullish move but has since declined and is now trading below these key indicators, as we see a shift to bearish momentum in the short term.\n\nThe RSI, sitting around 45, also indicated a lack of strong buying momentum, with values leaning more toward the oversold territory, but not conclusively so.\n\nEthereum’s social volume has also declined significantly, suggesting that public interest in and sentiment toward the altcoin are low.\n\nThis reduction in social engagement could be contributing to the decrease in Ethereum’s price, as less discussion might correlate with reduced trading activity and demand.\n\nInterestingly, the trading volume of Ethereum’s derivatives market has sharply increased by over 70%, meaning there is heightened market engagement.\n\nNotably, the long/short ratio across different platforms also shows more bullish sentiment on platforms like Binance [BNB] and OKX.\n\nWhat Ethereum’s future holds\n\nThe on-chain data for Ethereum presented a predominantly bullish scenario. 89% of holders are currently making money at the present price, indicating a strong upward trend that has benefited the majority.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe significant concentration of the token by large holders (51%) suggested that while there was potential for high volatility due to possible large-scale sell-offs, the market was stable, with these major holders likely maintaining their positions.\n\nOverall, Ethereum bulls seem to be cooling off temporarily, likely due to the latest US jobs data. But the rally is not over yet."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1XMmJySVNrVDRZMG14dm1ZQlA4TEZraUlFX1NNN0ZPVFJrMWZEcTVlS2V2QUR0MDh5Xzc3U0kzUFF1RGMwTTVobkJDWW52bTgtQ0VSZ3lCOFJwU0Y1SWpFX3paVzhaVFB3cGZmb2lweGU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Wintermute CEO questions Ethereum's leadership paradox amid celebrity memecoin controversy - Crypto Briefing",
        "content": "Ethereum leaders faces criticism for trying to merge capitalist and social goals.\n\nShare this article\n\nEvgeny Gaevoy, CEO of Wintermute, said if Ethereum fails in the future, it will not be because of technical shortcomings compared to competitors like Solana. Instead, the core issue is the contradiction in Ethereum’s leadership.\n\n“If ETH fails in the future it [won’t] be because ‘Solana is faster’, it will be because the [ETH] ‘elite’ is still stuck in a massive contradiction,” Gaevoy stated in a recent post on X.\n\nHis remarks come as a response to the controversy that erupted following Vitalik Buterin’s critique of celebrity memecoins. According to Buterin, projects should aim to deliver societal value and leave participants content, rather than focus on enriching celebrities and early investors.\n\nButerin’s stance drew a sharp rebuke from hip-hop artist Iggy Azalea, who recently launched her own memecoin, MOTHER. She posted a meme showing her holding a baby that resembled Buterin.\n\nAzalea’s photo prompted Uniswap Labs co-founder Hayden Adams to defend Buterin’s role.\n\nHe criticized Azalea for downplaying Buterin’s contributions to the crypto community, expressing disappointment that instead of reacting positively and using profits to support social causes, the singer chose to mock Buterin.\n\nNo issues with memecoins or celebcoins – I think there’s value to memetic attention and it’s cool to create markets for it That said, the underlying purpose and value of the tech goes way beyond financial games. And the best builders in the space are motivated by positive social… https://t.co/FQhawNl7GP — Hayden Adams 🦄 (@haydenzadams) June 6, 2024\n\nThat was when the Wintermute CEO jumped into the debate and criticized Ethereum’s leadership. He argued that Ethereum leaders are attempting to create a capitalist blockchain system while simultaneously addressing social issues—a stance he sees as inherently contradictory.\n\n“You are either building capitalism or planned socialism. I’m sorry, you really [can’t] have both,” Gaevoy added.\n\nGaevoy’s comments sparked controversy among crypto members. Many disagreed with his view, saying that being against celeb memecoins does not equate to building a socialist system.\n\nNot sure how Hayden and Vitalik saying how they don't like certain trends means they are against capitalism (or aren't involved in building capitalist systems anymore) They both have a certain vision of crypto, in terms of the types of things people will build and what people… — Mike van Rossum (@mikevanrossum) June 6, 2024\n\nExcuse me, but in what way Vitalik or Hayden are building socialism? Being against obvious rug pulls != building socialism — DeFi Made Here (@DeFi_Made_Here) June 6, 2024\n\nIn response to these disagreements, Gaevoy said it all came down to the underlying principle.\n\nAccording to him, if capitalism is the foundation, integrating features to mitigate its negative impacts is beneficial. However, if the primary goal is “social justice” or creating “only good things,” capitalism should not be an afterthought.\n\nTo me its about the primary guiding principle. If you key guiding principle is capitalism and then you make extra steps to make it less damaging – I'm all for it. If your guiding principle is, idk, \"social justice\" or \"only good things should be built\" and then you attach… — wishful cynic (@EvgenyGaevoy) June 6, 2024"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNQWtpenpiZy0zNlVEdXJQT1h4YllsSnIyYWZuMC1IajZZdERjNmxBX2c0ejdocHVGdFNvcjJNV25HYVBfQ3VWSEpkMkxadkwzLWpmVXJJbW1wR3d5M0ptTF9tVWlfdEs2NTBsMkdoUUF5ZnpRTkdwYXJqM09hRnFUZlo1Q3VnV280SE9tRFdPM1E2c2pDWDZrRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Should You Buy Solana Right Now While It's Below $200? - The Motley Fool",
        "content": "If Solana can convince investors it's the next Ethereum, it could skyrocket in value.\n\nIn 2023, Solana (SOL 0.81%) was one of the top-performing major cryptocurrencies, up an eye-popping 900%. In 2024, Solana has continued to turn in a stellar performance. At its current price of $165, Solana is up more than 60% through the first five months of the year.\n\nThe problem, however, is that Solana appears to be running into a wall right now. It is down nearly 20% since it hit an intra-year high of just over $200 in March. Should you view this as a potential buying opportunity, or as a warning sign that Solana's impressive recent gains could be coming to an end? Let's take a closer look.\n\nIs Solana the next Ethereum?\n\nThe primary reason to invest in Solana right now is that it could eventually become the next Ethereum (ETH 0.18%). Solana is a direct challenger to Ethereum in the Layer 1 blockchain space, and has been steadily gaining ground in every major niche, from decentralized finance (DeFi) to non-fungible tokens (NFTs). For nearly four years, Solana has been tagged as a potential \"Ethereum killer,\" and now it finally seems to be delivering on its promise.\n\nCathie Wood of Ark Invest raved about Solana last year, calling it a faster, cheaper, and more efficient version of Ethereum. That's backed up by real numbers. Solana, for example, says it can process 50,000 transactions per second. Ethereum, by way of comparison, can only process 15 to 20 transactions per second. To achieve faster transaction processing speeds, Ethereum relies on a confusing mix of Layer 2 scaling solutions that even developers say is becoming too hard to use.\n\nSolana's secret weapon\n\nMoreover, Solana has a secret weapon that Ethereum simply cannot match: A mobile crypto strategy that is finally gaining traction with customers. Solana officially launched its new \"crypto phone\" (the Saga) last year. Early sales were weak, but a clever marketing promotion based around Solana meme coins has led to sales taking off.\n\nFrom the outset, Solana's mobile strategy was designed as a way to onboard new crypto users. The goal was to get a mobile phone into people's hands, give them plenty of apps they couldn't find anywhere else, and design new mobile experiences to make crypto easier to use. That, in turn, could result in people beating down the door to become part of the Solana blockchain ecosystem.\n\nAdmittedly, this might be a very long-term strategy. But it might just work. According to investment firm VanEck, all Solana needs is a single \"killer app\" with at least 100 million users, along the lines of a ChatGPT. If Solana can find a \"killer app\" for its mobile phone, it could be worth hundreds of billions of dollars.\n\nVanEck ran the numbers and determined that, in a bull-case scenario, Solana might be worth over $3,200 by 2030. So, yes, if you buy into this analysis, you should be buying Solana while it's still below $200. At today's prices, you might be able to make a 20-fold return on your investment.\n\nThe case against Solana\n\nHowever, there are a number of reasons to be concerned about Solana. For example, the current bout of meme coin popularity taking over the Solana blockchain seems to be leading to some unsustainable performance. All of the improvement that we've been seeing in Solana's metrics -- such as new users, new unique wallets, and spikes in transaction activity -- might just be a lot of smoke and mirrors.\n\nMoreover, Solana continues to stand in Ethereum's shadow when it comes to exchange-traded funds (ETFs). At the end of May, the SEC granted approval for new spot Ethereum ETFs to begin trading soon. If they are anywhere near as successful as the spot Bitcoin ETFs, they could lead to a huge influx of investor money flowing into Ethereum. That's fantastic for Ethereum holders, but it could act as a negative drag on Solana's price over the short to medium term. Money that otherwise might have gone into Solana will now be going into Ethereum.\n\nHow high can Solana go?\n\nThat being said, I'm taking a long-term approach when it comes to Solana. As Solana steadily gains market share at the expense of Ethereum, and as it continues to build out its mobile crypto strategy, I'm highly confident that it can continue to boost its valuation. Solana is still 36% below its all-time high of $260, which could be a reasonable near-term price target.\n\nIn a best-case scenario, of course, Solana will find the one \"killer app\" that it needs. If that happens, it could skyrocket in value and achieve what many have been predicting for several years now."
    }
]