[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5SX3FhUkpocG1ubWthQ2NjckpkT3Y3bzlVeFl3dXNrYUN2MXlaYTlvMm5UcnlrMzAzRmlRVUFWRjNWTW5SZjhneEN4UDhoeXRYbjRtY09ybS1KcEdYUmRSUUs4QzdfTlVNdHFvNnd4WlMxMTR3cUlZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "ENS partners with GoDaddy to enable users to link wallets to domains - Blockworks",
        "content": "Ethereum Name Service (ENS), a domain naming system on the Ethereum blockchain, has partnered with GoDaddy, a domain registrar, to enable users to easily link their wallets to web pages.\n\nENS can be considered the blockchain-based counterpart to the Domain Name System (DNS) that is widely utilized in Web2.\n\nDNS services assign unique IP addresses to devices, facilitating the translation of these addresses into user-friendly domain names for accessing internet web pages. Similarly, ENS services convert intricate wallet addresses into easily readable names.\n\nThis latest integration with GoDaddy, one of the world’s largest web hosting providers, will allow users to connect their simplified ENS wallet addresses with their DNS.\n\nBridging the gap between Web2 and Web3 comes with its own set of problems, however, like concerns around censorship.\n\nRead more: Ethereum devs consider ‘existential’ upgrade to the EVM\n\nMost recently, Kubi Mensah, the co-founder of Gattaca, noted in a post on X that its domain was suspended indefinitely without any prior notice.\n\nAlthough the issue was resolved after escalating concerns to the senior management of the domain provider, the reason for the suspension was never made apparent.\n\n“We see this incident as a reminder that the fight against censorship is hard but worth every bit of our effort,” Mensah wrote.\n\nGenerally speaking, due to the decentralized nature of Web3 domains, entities themselves can not suspend, take or control an ENS .eth domain, Nick Johnson, the founder and lead developer of ENS, told Blockworks.\n\n“ENS .eth domains are censorship-resistant and tamper-proof by design; even the ENS DAO has no power to revoke or restrict a .eth domain,” Johnson said.\n\nHowever, this latest collaboration is a gateway for Web2 domain users to access blockchain technologies via their domains, and ownership of a DNS domain ultimately remains with the registrar.\n\n“Names that are imported from DNS — using our new integration with GoDaddy or our legacy integration — remain subject to the registrar they are held with, and the rules imposed by the registrar and ICANN,” Johnson said.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE9ER09QN1JrbnpYazBRWmdmS1pGalFxR1hUZFZEbGFTaTh2alZZLXd1VVREQS15anZ1Y2ROLWlhTmZXa1lSYlVkSGJUUHktdUlUTFl6d1NfczIzM1djLWpZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Gitcoin is restructuring to focus on grants for the Ethereum ecosystem - Blockworks",
        "content": "Gitcoin, an open-source software funding platform, has announced it will shift focus away from public goods funding and towards enhancing grants infrastructure designed for the Ethereum ecosystem.\n\nSince its launch in May 2021, Gitcoin’s organizational hierarchy has been relatively flat, with no CEO calling the shots. Workstreams, or focused groups dedicated to specific tasks or projects within the organization, have always required budgets to be approved through community voting — an often time consuming process.\n\nAs the DAO has evolved, however, it morphed from an impact-focused organization to something more technology-centric. Gitcoin executive director Kyle Weiss told Blockworks in an interview that this did not align well with the existing DAO structure.\n\n“It was too disjointed,” said Weiss. “In a DAO environment where everyone is fully remote, we have folks contributing from nearly every continent — stability, operations, and software development is really important, you need a core group of individuals who have context.”\n\nRead more: Gitcoin’s co-founder wants to return from the sidelines\n\nAs part of the new restructuring plan, two business units have formed within Gitcoin. One unit will focus on coordinating product-specific work, while a subDAO will manage matters of community and governance.\n\nWeiss noted that over the years, the company has experimented with various products. He said that some of these have been distractions, while others have been valuable to its growth.\n\n“A lot of 2024 is focusing on grants. We want Gitcoin to be much more associated with grants, whereas right now, our narrative has been around public goods funding, and that shift is because we’ve moved from being an impact organization to a technology organization,” Weiss said.\n\nFor this reason, Weiss explained the DAO will transition from independent workstreams towards a structure more akin to a “Labs” structure. This is something that is common among existing protocol development teams, similar to how Uniswap has Uniswap Labs or how Optimism operates with OP Labs.\n\n“We want to make sure there is stability in the software development side and then give the DAO material scopes of work to own,” he said.\n\nWeiss says that by granting software development teams greater leadership and more defined decision-making powers, the community can remain concentrated on achieving results through the grants programs via token voting.\n\n“I don’t know if the token holders are the right people to decide on multi-year roadmap decisions on the technology side,” Weiss said.\n\nGitcoin co-founder Kevin Owocki shared this sentiment.\n\n“It’s not proven that DAOs can develop software, so the Labs team is designed to recognize that in our organizational structure, and make sure that we’re building world-class software.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOU0FmWERSOEF4My1PUWFDX0lSMy1pQ0s0MDZfWmx0cWsyaFMtZmdDeFRTdEEzazB3UkVjR1R1c0dLOFhYZEk4TURQN1YybGlLMm0tR0RLbk5ra0lGZTZ4Qzk0UjVlLW9uY0d1ZzJlVDF5MzlYN3E2X1hpdjAzX0gzM19nZS1RNzRkMVpPU1JlLXdXNUNDVllINW4zR2h0dGZSMDJF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Dogwifhat: some crypto-wallets pocket over $1.3 million - The Cryptonomist",
        "content": "During the weekend, it seems that some crypto wallets that collected a large supply of the Ethereum version of dogwifhat (WIF) pocketed over $1.3 million. The incident suggests that these are apparent “insiders” of the project.\n\nEthereum Dogwifhat: 12 probable insider crypto-wallets of the project pocket over $1.3 million\n\nOn Saturday, it seems that the Ethereum version of dogwifhat (WIF) was pumped and then dumped within a few hours, showing some suspicious data.\n\nAnd indeed, it seems that there are 12 crypto-wallets that, thanks to their wide supply of the memecoin version Ethereum, have managed to pocket a whopping 1.3 million dollars.\n\nThe suspicions suggest that these crypto wallets are apparent “insiders” of the project. This is confirmed by the on-chain analysis tool Lookonchain, which shows that these crypto wallets have purchased 24 million Ethereum WIF tokens for 3,000 dollars in ETH.\n\nThe purchase took place in the same block in which the deployer opened the negotiations, which implies that the trader knew exactly when the tokens would be issued and traded.\n\nAnyway, on Saturday, the Ethereum WIF went from prices of fractions of a cent to 30 cents in just a few hours, and then crashed by over 80%.\n\nEthereum Dogwifhat: word from the creator\n\nAlways on Saturday, on X, the issa account came forward, claiming to be the creator of the crypto dogwifhat.\n\nAs many of you know, I originally created the meme you all know as \"dogwifhat\". It recently gained a ton of traction within the crypto space, most notably through a coin named $WIF that launched on Solana, currently trading at $270M~ market cap.\n\n\n\nWith so many of you reaching out… — issa (@issa) February 3, 2024\n\n“As many of you know, I originally created the meme that you all know as ‘dogwifhat’. Recently, it has gained a lot of popularity in the cryptocurrency space, especially thanks to a coin called $WIF, launched on Solana and currently traded with a market cap of 270 million dollars. Since many of you have contacted me and the $WIF team has never recognized me as the original creator, I wanted to clarify that I have no affiliation with them and I have never owned or received any allocation. Today I officially announce that I will launch the REAL $dogwifhat, but on Ethereum. The website explaining the origin story of dogwifhat is directly linked below this text. If you are not familiar with the cryptocurrency space, please proceed with caution, this is not financial advice. All other tweets following this can be found on the official website @dogwifhat_eth”\n\nIn practice, the Ethereum version of dogwifhat is not connected to Solana-based WIF, which was launched at the end of November.\n\nSeventh crypto in the “Meme” category\n\nMeanwhile, looking at the meme crypto ranking by market capitalization, the dogwifhat (WIF) based on Solana blockchain is in seventh place.\n\nWIF has a total market cap of over 217 million dollars, not far from the other meme cryptos like FLOKI (265 million dollars) and MEME (227 million dollars).\n\nOn the memecoin scene, the dominant one is Dogecoin (DOGE) with over 11 billion dollars of market cap, followed by SHIB with 5.2 billion dollars and BONK with 655 million dollars.\n\nIn the last month, WIF Solana-based has seen a price pump of 97%, with the price going from $0.09 to the current $0.21. However, during the month, its highest recorded price was $0.45."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMi9gFBVV95cUxQVV9uVl9IUFNXZGVjS3R5UDg3MExYR3NZUGlEVE4tcWx4RUFVZ09nTU8wbG44YUZfdjUtLUJOYW1wVUtSSl95dzZxZDhqRU9UUnNqRkFiLTBGWTduZGRxTGk3MnBLSlg5blBFSlFsRUgwYmRseVppVDNSaThxX25RSWpBc0poemdjdDZJZm8wRWFaVmw3REJGSGVHeVNQdTVhZWRtYWItb2k3STRGN3FTNm9USjNtREdwRjNNdmpNY1ZkdjF2dVJSVEhvUlIyZTNhcTRrQndPTnpIWGxPUC1DR0dDTk1MQ2J0bXIyVlFPdDRNZVN4NFHSAfsBQVVfeXFMTkRmNy1QazhKRTF3bXJma09mUjJPNmpORV85aXVLVThXTC14RTJCcDVpajFyRk15MDdueDFWVjRHanZtVXZQUWdfcVVLaUthZV9ZekdzVHhnbjJCNzZsSWM3RXFGX3FaUFZsRTZnRUZRZ3dpWkoyeGV4NEVpenpicWtTOTVSbXRZVUdIUWhIMW42bFpPMG01RE9PWnZ2b1dsdllnMzdzOS1jUFFibGstM19SYnF2UTZVaHdjRzcxYXowOF93MU5ra1pXTW5KdHBJMU14RTN2QXJTdUx4RmhBT0g1MGhudWpkazNGbWVrZ2h6OFFzelNOZGVITTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC to record rash move soon as Bollinger Bands contract - FXStreet",
        "content": "Bitcoin price could fall 5% to the support confluence between 100-day SMA and horizontal line at $40,650 as boring chop continues.\n\nEthereum price could revisit $2,200, a 4% correction, as the 50-day SMA proves impenetrable.\n\nA retest of the October lows around $0.4734 seems likely for Ripple price as XRP token holders show weakness.\n\nBitcoin (BTC) price continues to record a boring chop, trading horizontally, with altcoins such as Ethereum (ETH) mimicking the price action. Meanwhile, Ripple (XRP) price continues to suffer in the hands of unmotivated traders.\n\nAlso Read: Week Ahead: Crypto markets to turn volatile as AI steals the spotlight\n\nBitcoin price likely to fall 5%\n\nBitcoin (BTC) price is trading within a range, consolidating between the centerline and the upper band of the Bollinger indicator at $41,895 and $44,210, respectively. With the two Bollinger bands contracting, BTC could record an impulsive or rash move soon.\n\nThe Relative Strength Index (RSI) is closely bearish, teasing with a cross below the signal line (yellow band). The Moving Average Convergence Divergence (MACD) also appears subdued with miniature volumes on the histogram bars. This is also reflected in the Awesome Oscillator (AO), tilting the odds in favor of the bears.\n\nIf the bears have their way, Bitcoin price could descend 5% to find support due to the confluence between the 100-day Simple Moving Average (SMA) and the horizontal line at $40,650. If this level fails to hold as support, BTC could extend the fall into the demand zone between $38,496 and $39,582. A break and close below the midline of this order block at $39,196 would confirm the continuation of the downtrend, potentially going as low as the $37,800 support.\n\nBTC/USDT 1-day chart\n\nConversely, if bulls have their way, Bitcoin price could shatter past the upper band of the Bollinger indicator at $44,210. This could see BTC climb to $48,000, or in a highly bullish case, tag $50,000, nearly 20% above current levels.\n\nAlso Read: Bitcoin price gains strength as GBTC outflows shrink\n\nEthereum price could drop to $2,200\n\nEthereum (ETH) price action is almost similar to that of BTC. It could fall 4% to $2,200 as overhead pressure due to the 50-day SMA continues to build. The Proof-of-Stake (PoS) token’s price has made multiple attempts to breach this supplier congestion level to no avail.\n\nWith the RSI below 50, the AO and MACD in negative territory, and below the latter’s signal line (orange band), the odds favor the downside. Ethereum price could slip past $2,200 to test the 100-day SMA at $2,203. In a dire case, the fall could see ETH dip into the demand zone between $2,059 and $2,118.\n\n\n\nETH/USDT 1-day chart\n\nOn the other hand, increased buying pressure could see Ethereum price overcome the 50-day SMA to confront the $2,388 barrier. Flipping this into support could restore Ether into the ascending parallel channel, a gateway to more gains.\n\nAlso Read: Ethereum monthly transaction count climbs to highest level since July 2022\n\nRipple price looks for pullback as XRP holders show weakness\n\nRipple (XRP) looks ready to fall as it is stuck below the foothold of the midline of the descending parallel channel. Increased selling pressure could see XRP price retest the October lows around $0.4734, with technical indicators showing an unmotivated holder community. This is seen by the waning momentum on the RSI below 50 and the position of the AO and MACD in negative territory.\n\nXRP/USDT 1-day chart\n\nOn the flipside, enhanced buyer momentum could see XRP price breach the resistance due to the midline of the channel, bringing the $0.6000 psychological level into focus.\n\nAlso Read: XRP price trades broadly unchanged leading up to crucial milestone in SEC vs. Ripple lawsuit"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOX09ScEpEb19pYkhFbmVOQjIwRW5oMXJqcTdrMGtCX25lbmtxZHJJZHk4ZUotMnl6OUJNdExVVkdQWGotNDFReVQzaURiaDE3VFhlY29tckJLWVJjUmxUd0lMQzZia3daamlOQlJINVZpLUJMX0RQak03S2pRNnZWUHpwLURiQdIBjgFBVV95cUxPUUFsMk8tVkY5dm5KWi02WlFSVk55eEQwSnV2THRUX25DeHdWNEZLRDZKWnZHbk1HeUlJZzlPZUpPZnhkNXdtX2NYdXRJLVlXRnhwTHdSWVNiSEtpZFhWd3JLMzR6SHluN1BVeEVkRHdXMXhuMHdoeXFzM3NlSExmZzJZX3V1QmRRQlVUS2Fn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "What Is Farcaster and Why Is Crypto So Excited About the Twitter Alternative? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn the last two years—particularly, since Elon Musk’s divisive purchase and overhaul of Twitter in late 2022—a number of upstart decentralized social media protocols have attempted to harness the transparent, uncensorable power of blockchain networks to improve the online social experience.\n\nFarcaster is the latest such project to do so. Now, it’s making waves after releasing a key update that has attracted thousands of new users in a matter of days. Here's why Crypto Twitter is so optimistic about this new potential replacement.\n\n(Video by Rug Radio Creator Benjamin White.)\n\nAD\n\nAD\n\nWhat is Farcaster?\n\nFounded by Coinbase alums Dan Romero and Varun Srinivasan in 2020, Farcaster is a social media protocol built on Optimism, the Ethereum scaling network. On top of the public and decentralized Farcaster ecosystem, users can create (and have created) a slew of integrated apps that perform various social media functions.\n\nThe most popular app built on the Farcaster network is Warpcast, a Twitter-like platform for writing posts (called “casts”), following other users, and liking or sharing (“recasting”) those users’ posts. Though a slew of apps currently live on Farcaster, Warpcast accounts for almost half of all sign ups across the entire protocol, according to on-chain data from Dune.\n\nMost of Farcaster’s most popular accounts are major players in the crypto space: Ethereum co-founder Vitalik Buterin, Ethereum core developer Tim Beiko, and Base creator Jesse Pollak.\n\nFarcaster shares its main selling points with other decentralized social media protocols: a lack of censorship, control over one’s data, and seamless interoperability of accounts across all apps built on the network. That’s opposed to, for example, the lack of interconnectivity between accounts on Twitter and Instagram.\n\nOne element that particularly distinguishes Farcaster from other social media protocols is the network’s emphasis on eliminating bot activity. To sign up, users must pay a $5 sign-up fee, meant to prevent the creation of spam accounts. Further, users can only post a limited number of “casts” on Farcaster apps, which are tied to packages called storage units.\n\nAD\n\nAD\n\nStorage units, which go for $5 a piece, grant a user 5,000 casts, 2,500 reactions, and 2,500 links or photo posts within a one-year period. Users who wish to buy additional storage units to post more can do so via a fairly technical and complicated process. This storage unit structure was designed to prevent Farcaster apps from being inundated with the millions of bot comments and likes that plague traditional social media platforms like Twitter.\n\nBut far and away, the most popular innovation on Farcaster is called Frames—and it upended the protocol’s trajectory overnight.\n\nWhat are Frames?\n\nLaunched on January 26, Frames are a new Farcaster feature that allows users to perform a suite of functions, both on-chain and off-chain, within Farcaster apps—without exiting to a third party.\n\nOn Warpcast, for example, users scrolling through a feed of casts can now click on a Frame posted by someone they follow, and perform a variety of functions—including minting NFTs, browsing an art gallery, playing games, subscribing to newsletters, and making online purchases—all while staying in their feed.\n\nSome popular Frames include “Girl Scout Cookies,” which enables one-click purchases of the popular dessert, “Nethria,” a text-based monster combat game, and “NFT Mint,” a gasless NFT drop.\n\njust came across one of the coolest new features in social media that I've seen in a decade not being dramatic, it's actually genius@farcaster_xyz Frames TL;DR - you can embed an \"iframe\" (not fully) into your tweets (casts) and people can interact with them without leaving… pic.twitter.com/30e9lgGkfa — mert | helius.dev (@0xMert_) January 28, 2024\n\nFrames is powered by Farcaster’s EdDSA authorization system, which already underlaid the Farcaster ecosystem. According to Farcaster co-founder Dan Romero, that structure eliminates the possibility of wallet drains, spoofing, and other malicious crypto hacks.\n\nAn easy to miss part of frames is it's powered by Farcaster's EdDSA auth system. 1. UX — every Farcaster user already has an EdDSA in the app they are using whether Warpcast or Supercast or something else. Every Farcaster client supports frames under the hood. And for… — Dan Romero (@dwr) January 29, 2024\n\nAD\n\nAD\n\nCurrently, on-chain functionality for Frames is limited to Ethereum-affiliated networks. As soon as next week, however, Farcaster’s founders have indicated the protocol will expand to support Solana.\n\nFarcaster is easily my favourite app in crypto right now and it's now coming to Solana 😱 colossal hint: with Farcaster Frames (embeddable actions into posts) — Solana is the **only** way to go from frames -> onchain without a backend OPOS pic.twitter.com/qrxte8okiy — mert | helius.dev (@0xMert_) February 2, 2024\n\nWithin days of introducing Frames, Farcaster exploded in popularity. The ecosystem, which typically supported around 2,000 daily users in recent months, quickly shot up over 1,300% in activity, to an average of over 28,000 daily users by Monday, according to data from Dune.\n\nThe volume of casts and likes on the platform has increased exponentially over the same period, from an average of 100,000 daily engagements just weeks ago, to over 2.3 million on Monday.\n\nAll in all, just north of 125,000 users have signed up for Farcaster so far—a statistic that pales in comparison to mainstream social media platforms, but nonetheless marks a substantial milestone for an on-chain network that has yet to cater to non-tech savvy users.\n\nEdited by Andrew Hayward"
    }
]