[
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNLXJnczBKMnRXT2dUQ19obXJZQm1QTWJqbFdSeXBKTmtLN1V3TzU0dVd4RjdJTjFrWDdmWEh3ZW8wend1QnRfQ19nY1F3WXdfaHJLa2Z3T1NjUHhlcXNOdzkxdDFmX0NreTN0dUxwbTYzLTNGbE9JYk5CbHQ3ZGhrVkVjb0l3WER1aDg00gGQAUFVX3lxTFBGdHpZN2R5NmMxRnJ3SVd5ZkVMZm9Mbm1waDdWcm1Xd2tDYWtEVjg1QVFiaW5Vb0lGekJlZmc1SFV4ZGRzb2pGeDZrYWtBOXVLQmR5Y2dlS1VsSjVrTHY2Ri1rX1Z5US1STzE2WTc1eGxfd0lVOVE2eWJ2eElXTnI1RDhEb1JyUTVDQWFKOTJxdg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "APE to $1? As Ethereum NFTs fall to Bitcoin, here is the impact - AMBCrypto News",
        "content": "Ethereum loses more ground on Bitcoin in NFT volume.\n\nApecoin continues to decline.\n\nEthereum [ETH] remains prominent in the NFT conversation; however, recent data indicates a reduction in its dominance.\n\nApeCoin [APE], the ecosystem token associated with Bored Ape Yacht Club (BAYC) – an Ethereum-based NFT collection – has experienced a decline in relevance, mirroring the recent downturn in BAYC’s floor price.\n\nEthereum NFT volume continues to slide down\n\nNFTs were primarily associated with Ethereum in the past, given the multitude of projects hosted on the platform. However, the emergence of alternative platforms has disrupted this monopoly.\n\nIn recent months, Bitcoin has emerged as an unexpected competitor in the NFT space despite operating differently.\n\nAnalysis of NFT volume on Crypto Slam revealed that Bitcoin has surpassed Ethereum in volume over the last 30 days.\n\nSpecifically, the NFT volume on the Bitcoin network was over $455.59 million, whereas it amounted to $291.15 million on Ethereum.\n\nData indicated that Bitcoin collections occupy the top three spots in volume. In contrast, popular ETH collections like Bored Ape Yacht Club (BAYC) only rank sixth.\n\nA look at how BAYC has trended\n\nAn analysis of the overall price trend of Bored Ape Yacht Club (BAYC) on NFT Price Floor showed a significant decline in the BAYC floor price over the past few months.\n\nParticularly, in April, there has been a noticeable drop in the floor price.\n\nAt the time of writing, the floor price was around 10.89 ETH. The floor price represents the lowest price for the Ethereum-based NFT collection, and the chart indicates a decline of over 67% over the past year.\n\nThe decline in BAYC and other Yuga collections has also impacted ApeCoin, bringing it close to its lowest price.\n\nAPE close to ATL\n\nThe analysis of ApeCoin indicates a negative trend for the de facto ecosystem coin of Ethereum-based collections. Examination of the Relative Strength Index (RSI) showed an oversold condition.\n\nRealistic or not, here’s APE market cap in BTC’s terms\n\nAt the time of writing, the RSI was below 30, signaling a strong bear trend and an oversold state. Additionally, APE was trading around $1.15, reflecting a more than 4% decline.\n\nFurther analysis showed that APE’s all-time low was around $1.01, suggesting a further drop could bring the price to this region."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNV2ozbnhwRkJhLVRNOTR4TjRNWjk5WmhHZXNOMzRXSk43dE5CZGRjSXE0YkJqd05KNEtzV3RTU1VlZjN4NEozNnoyRGpBT3BBaWR5ZGRlZ29JWDNTN3JUcVEyZWF2MVR4WnpGZkYxOVBKV2dTeEZSTDFlckplbFo4bDlMWm9XR21GVmFTT21ZS0RiM1NnRF9md2p1cmllZFJzVHBRVGt4d2g1WGtydEFFaG9SUFBnRWhickJ5djM2RkV2VknSAcgBQVVfeXFMT0VIMnVSMTRhcWloMWNQOU5ydWZYdmhzTXN0LXhRTkpGNzlLck1kc0FGTDRkWHNZQ2NwaGVsYm9QNFZMQmo5Zy14V0ZEaXRVS19uZmN2UlpGd3lST0U1UTZnYWl6cV9sWHdfYUlRczFnRVhVR0dvckJHdlBaZXItVVFPa1A3VVc4YUpDS2F0SEw5ZjFUYV9qYzgzX3F6Sm5CQ0pSZEJtV1BIbndGVU9vbTR0Y1N2eHp6TzVkbzNYaGRSeXp1aENZMjc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Ethereum shows firm support at key level as its correlation with US indices increase - FXStreet",
        "content": "Ethereum's correlation with the traditional market is now higher than Bitcoin's.\n\nEthereum restakers may be responsible for its strong support just below the $3,000 level.\n\nEthereum could trade sideways for weeks until the SEC's spot Ethereum ETF decision.\n\nEthereum's (ETH) price continued a sideways movement on Thursday as the market still awaits a trigger. Ethereum isn't alone in this horizontal trend; several major index funds have also traded sideways, underscoring ETH's positive correlation with the traditional financial market.\n\nRead more: Ethereum moves sideways as Q1 report indicates token burns are making it deflationary\n\nDaily digest market movers: traditional market correlation, whale activity, fragile long side\n\nEthereum has maintained a sideways price movement for the third consecutive day. Here are ETH's key market movers:\n\nDespite the recent launch of spot Bitcoin (BTC) ETFs in the US, Ethereum's correlation to the traditional market has soared above that of BTC, according to data from The Block. Compared to BTC, Ethereum showed a high correlation to indices like the Nasdaq 100, S&P 500 and Dow Jones Industrial Average. This can be seen in Ethereum's recent price action, which has traded horizontally in tandem with these indices.\n\n\n\nWhile ETH's price stagnates, whales are making moves behind the scenes. A participant in its initial coin offering (ICO) came online to sell 2,000 ETH for 6 million USDC at $2,997, according to Spot On Chain. The whale bought 33,213 ETH at $0.31 during the Ethereum Genesis ICO. Since then, the whale has sold 5,110 ETH and still holds about 29,700 ETH across three wallets.\n\n\n\nAnother whale, who spent 10 million USDT to buy 3,279 ETH at $3,050 on Wednesday, withdrew 21,474 ETH — worth $64.7 million — from Binance on Thursday, according to Lookonchain. The whale has bought 107,931 ETH from decentralized exchanges and Binance since April 8.\n\nAlso read: Ethereum declines as crypto market crash increases bearish sentiment\n\nOptions indicators also show that \"the long side of Ethereum is more fragile and have limited ability to lead the market,\" according to Greekslive.\n\nTechnical analysis: ETH sideways movement may continue for weeks\n\nEthereum bears attempted to shift its price below the $2,900 key level on Wednesday, but it quickly rebounded to the $3,000 support level on Thursday.\n\nETH has maintained trading around the range of $2,900 and $3,300 since the market crash of April 12. Despite bulls showing weak hands, bears haven't been able to break below the range.\n\nThe scarcity of ETH driven by the increased attractiveness of Ethereum restaking and anticipation of the Bitcoin halving may be what's sustaining its price to stay within the range.\n\nRead more: Ethereum recovers from dip as Hong Kong ETH ETF approval sparks whale buying spree\n\nETH/USDT 4-hour chart\n\nAs stated in a previous analysis, ETH may continue the sideways movement. Minor market triggers may see it posting tiny gains but not above or below the $3,300 and $2,852 range identified previously.\n\nThe sideways movement may prevail for weeks until days leading to the Securities & Exchange Commission's decision on a spot Ethereum ETF. This thesis would be invalidated if the Bitcoin halving triggers an unlikely rally.\n\nEthereum is trading at $3,062, up 1.7% on the day."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQUjN0RVd2ZC11RG5GblgzeC15X3NVeDQwbXZfMGF6QXJBdmNma1FPTWs5dTQ1UXgzLTFBaU9CSnk0SU5rck8tWDVKNEZXd2JJNE11Q3k1SWV3RDY3ejYwNHVtbzl0QXNFWHE0dElMbXA0aDRBcFJrTG5iWm1SV3pFcnluSlhMRHVWN0x0NkM4THByRVHSAZsBQVVfeXFMUHdGbzN4cUJZS0tkbTQxc3RJS2RWVEdsQWNrUW1MR3VicG9PSGJHaklaSG9ZYjNoYm1oWWdFMnBKeVBkYV8tZk9VWG1SOUpiVnhnRGdxS2hhZG11eDA4V25ZMWQ4QUcxQmlWSU1vOThQTUhqd09yd3ZvMTFhR0RFWHItcmJLbFJ3RFI3YWs4Ni16V3pibDFMdzlhaEU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum ETFs in Hong Kong Could Lead to 'More Progressive' Policies in China: OSL - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAt the start of the week, spot Bitcoin and Ethereum ETFs were conditionally approved in Hong Kong. Alongside this news, digital assets platform OSL announced it will be a “sub-custodian partner” for both the China Asset Management, also known as ChinaAMC (HK), and Harvest Global Investment ETFs.\n\nLooking forward, OSL's CEO believes that these ETFs could lead to a wave of “more progressive” regulation in China and potentially cause a ripple effect across the region.\n\n“[It] is likely to set a precedent for other financial markets in Asia,” Patrick Pan, Chairman of the Board and CEO of OSL, told Decrypt. “For China, this development in Hong Kong solidifies Hong Kong’s place as a unique financial center for innovations and may influence future regulatory considerations and market openness towards crypto, potentially leading to more progressive policies aligned with global standards.”\n\nChina has a long and rocky history with cryptocurrencies—effectively banning crypto multiple times.\n\nAD\n\nAD\n\n“Presently, there are rigorous regulatory controls over cryptocurrency transactions, expressly prohibiting the operation of cryptocurrency exchanges within its territory,” Thomas Zhu, the ChinaAMC (HK) head of digital assets and head of family office business, told Decrypt.\n\nBut with Hong Kong's status as a Special Administrative Region controlled by China—which has been called a ‘testing ground’ for China—its financial decisions may set the table for future movements on mainland China.\n\nLooking at the wider continent, both firms see the approval of spot ETFs as a catalyst for regulatory evolution.\n\n“It may prompt regulators to accelerate their own frameworks to accommodate such products, which may lead to a broader acceptance and deeper integration of cryptocurrency into the Asian financial landscape,” Zhu said, “potentially setting the stage for a new era of digital asset trading and investment in the region.”\n\nAD\n\nAD\n\nHowever, crypto-friendly countries like Japan, South Korea, and Singapore could be the first to be influenced, Zhu suggested.\n\nThe United States approved spot Bitcoin ETFs in January—11 years after the first application for a U.S. Bitcoin ETF was filed. This is a stark contrast to Hong Kong’s process, which OSL said has only taken four months.\n\n“In the U.S., where the legal framework and regulatory landscape have been highly fragmented—and at times, vulnerable to highly polarized political cycles—the journey for spot crypto ETF products has been far more arduous.” Pan told Decrypt. “Hong Kong’s framework has managed to prove once again that it can be mobilized quickly to innovate, while ensuring robust investor protection, setting a benchmark for crypto-related financial products in Asia.”\n\nDespite this, the U.S. still beat Hong Kong to the punch. That means Hong Kong regulators and potential ETF issuers have been able to study the impact that spot crypto funds might have on the market. One primary lesson: ETFs significantly drive demand. The firms that spoke to Decrypt think it will be no different this time around.\n\n“We anticipate a similar uplift in Hong Kong,” Pan said. “Given the structured and familiar investment mechanism of these ETFs, akin to those in traditional finance, they are likely to facilitate education and adoption among local investors. This positions the Hong Kong market to potentially experience substantial growth, tapping into a deep well of enthusiasm and capital.”\n\nWith Hong Kong’s population a fraction of the size of the U.S., its impact on the wider crypto ecosystem is likely to be less pronounced than January’s spot ETF approvals. But the ripple effect it could have on China and the rest of Asia may dwarf anything the U.S. could muster.\n\nEdited by Stacy Elliott and Andrew Hayward"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPcFBfTlpnTENsRWlfME9GTlAweGdCcWhLRXpWbXI0T2NteXdvZUxFc2UtUHFma0Q5MXRiWlhnMFozVVRNMEVkSHFhS0luanpLbmlKWTZZWVN3Sjk0a1FLdTlFM0x3Vlktc3poYTdhVE5Vb0o4TFlXQWZoUEZJZWJlU2dDU3dQbDNja1lvWlBZbjRLQmxGeHNTcXJGWk9NdTd2X292ZEdzQzJ5dWIxVjd4LW10ZVlnemxmak5iSlVxUdIBxwFBVV95cUxOV2RGcW1XM1lDelplWURFeS1JMkttTVAwWi1Pelo1MnA0RmpPaFdHLW5JU1lyZE9HYll5Ul9FNWZRX0l5ajloaTZDV1J6MmdsbEtoRzM5QWUyMldMajJsR09OVzduVjE3MTg0RE1MVnItT3cxOVNRLVh6N243aHFpdnhWc0k2XzJXWHllanpWTmNCRUZPNlNhMW9VMS01cWhMLUlBMDlnRmxMX001Nk1iSlRicjNkUzdPSDFWajVIbFVfV3RIWFJR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Eyes All-Time High: Changelly Analysis Predicts Surge After Bitcoin Halving - Crypto News Flash",
        "content": "Despite Hong Kong’s ETF approval, Ethereum sees increased liquidations and bearish sentiment, with shorts rising by 54%.\n\nEthereum faces price volatility due to geopolitical tensions and regulatory concerns, dipping below $3,000 briefly this week.\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, faced significant price volatility this week, briefly dipping below the $3,000 mark. This downturn followed a combination of geopolitical tensions and market sentiments surrounding regulatory developments.\n\nTensions between Iran and Israel contributed to market jitters, suppressing the positive impact of Hong Kong’s approval of a spot Ethereum Exchange-Traded Fund (ETF) as previously reported by Crypto News Flash. Investors exercised caution across the cryptocurrency landscape, with Bitcoin and other altcoins also experiencing losses. Notably, Ethereum saw a 20% decrease in risk reversals on Tuesday, indicating heightened nervousness among investors.\n\nData from Santiment revealed a surge in Ethereum liquidations, totaling over $81.9 million within 24 hours. Long positions accounted for the majority of liquidations, totaling $67.4 million. The largest liquidation, valued at $6 million, stemmed from an ETH-USD swap. Moreover, discussions surrounding Ethereum intensified after the Hong Kong ETF was approved, making it the most trending token among traders. However, bearish sentiment persisted, as evidenced by a 54% rise in ETH shorts.\n\nEthereum Foundation’s Issuance Reduction Proposal\n\nDespite recent developments, the Ethereum Foundation’s proposal to reduce ETH issuance garnered attention. Glassnode’s report highlighted ongoing criticism of the proposal despite clarifications emphasizing its aim to maintain Ethereum’s status as a form of currency and balance governance power within the network.\n\nGlassnode also addressed the rise of restaking and liquid restaking tokens, impacting Ethereum’s inflation rate and holders. These tokens, offering significantly high yields, facilitate a wealth transfer from non-staked ETH holders to staked counterparts. Consequently, there is a potential shift in the “real yield” and the role of money within the Ethereum ecosystem, potentially favoring projects issuing derivative tokens.\n\nAccording to a recent analysis conducted by Changelly, a prominent cryptocurrency data provider, Ethereum could experience a notable surge in price following the Bitcoin halving. Changelly predicts that on April 21, 2024, just one day after the halving event, Ethereum could reach a price of $3,171.61. This forecast has sparked optimism among Ethereum investors, who eagerly anticipate the potential for significant gains.\n\nChangelly’s analysis extends beyond the immediate aftermath of the Bitcoin halving, offering a bullish long-term outlook for Ethereum. By June 2025, Changelly suggests that Ethereum could surpass its previous all-time high and reach an impressive price of $4,964.07. Such a milestone would mark a new record for the cryptocurrency, signaling continued growth and potential for further appreciation.\n\nEthereum Struggles to Break Key Resistance\n\nETH’s price trajectory has been marked by challenges in surmounting key resistance levels, particularly the $3,200 mark. The cryptocurrency remains below this critical threshold, along with the 100-hourly Simple Moving Average, signaling persistent bearish pressure. Additionally, a notable bearish trend line has formed with resistance at $3,120 on the hourly chart of ETH/USD, sourced via Kraken.\n\n\n\nFollowing a brief period of consolidation, Ethereum experienced a minor recovery attempt, briefly surpassing the $3,000 resistance zone. However, this upward momentum was stifled as bears asserted control near the $3,280 resistance zone, resulting in a subsequent downturn. The price retraced below the 23.6% Fibonacci retracement level of the upward move from the $2,536 swing low to the $3,278 high, underscoring the prevailing bearish sentiment.\n\nRecommended for you:\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTE52VEZDOUxoQjdDOHFmakx3b293UHU3QW44VjA5ZjRCMjRtdlVRWWkwVWpGRDNlUzBrbmpOVHRXdDVCOHl6OXoxd1NybjdVcEdMMzcwYnJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "BlobScriptions: A New Type of Inscription on Ethereum - Unchained",
        "content": "BlobScriptions made waves in the Ethereum community as a new type of inscription, similar to Ordinal inscriptions on Bitcoin.\n\nEthereum blockchain underwent the Dencun upgrade in March 2024, introducing a concept called Blobs. Blobs are a novel data storage concept intended to lower transaction costs on layer 2 scaling solutions. While the concept was intended primarily to lower costs, some creators used blobs to develop “BlobScriptions.”\n\nRead on to learn what BlobScriptions are, how they work, and their similarities to Bitcoin inscriptions.\n\nWhat Are BlobScriptions?\n\nBlobScriptions are Ethscriptions that use EIP-4844 blobs to store additional data. Blobs, or binary large objects, were introduced to the network in the latest Ethereum network upgrade in March as a cost-effective solution for storing data on-chain. However, their ‘misuse’ is now dubbed BlobScriptions.\n\nTom Lehman and Michael Hirsch developed the concept by launching BlobScriptions.io, a platform enabling anyone to inscribe data onto a blob.\n\nTheir proposal, ESIP-8, was to use blobs to store data within the Etherscriptions Protocol, enabling data storage and allowing users to access blob data alongside other blockchain data currently utilized by the protocol.\n\nLehman said the idea was a means of democratizing blobs, making them available for everyone. For a fee of about $20, anyone, potentially including bots, can submit a BlobScription since blobs have made data storage on Ethereum 10x to 100x cheaper.\n\nHow Do BlobScriptions Work?\n\nBlobScriptions function similarly to Bitcoin inscriptions, allowing users to store various data types on Ethereum’s blobs, including images, text, and even tokens. Blobs are unique because they don’t interact with smart contracts, and nodes only need to store them for up to 18 days, making them cost-effective.\n\nWhen sharing data using blobs, one requires the content itself and the content type. Initially, data URIs were used to achieve this, but to make BlobScriptions cheaper; its creators implemented CBOR, which natively supports binary data.\n\nOnce the BlobScription payload is prepared, it needs to be split into one or more blobs, each consisting of 32-byte segments. These blobs are then sent as transactions to the Ethereum blockchain.\n\nThe Ethscriptions indexer, Ethereum RPC, and the Beacon API are then used to retrieve blobs. Using their versioned hashes, the blobs can be associated with individual transactions.\n\nAfter retrieving a transaction’s blobs, they can be decoded and concatenated into a single binary value using Viem’s “fromBlobs” method. This decoded data includes the content and content type, forming an “Ethscription Attachment,” also called a BlobScription. The indexer can then serve the attachment content via its API.\n\nRegarding the concern about blobs being removed from storage after 18 days, Ethscriptions indexers and other decentralized data stores retain the data, ensuring that as long as someone has it, the BlobScriptions can still be used.\n\nHow to Create a BlobScription on Ethereum\n\nTo create a BlobScription on Ethereum, follow these steps:\n\nStep 1: Visit the BlobScription Website\n\nYou need to first visit the BlobScription website to begin the process. Click on “Create a burner for me.” This creates a new wallet and imports the private key to a Web3 wallet like MetaMask.\n\nAfter importing, double-check if the displayed address matches your own.\n\nStep 2: Enter the Initial Owner\n\nThe next step requires you to specify the individual or entity credited with creating the BlobScription on the blockchain.\n\nStep 3: Choose a File\n\nYou will then select the data you want to store on the Ethereum blockchain via the BlobScription.\n\nStep 4: Create BlobScription\n\nClick the “Create BlobScription” button to finalize the process, and you have successfully created your first BlobScription!\n\nBlobScriptions vs. Bitcoin Inscriptions: Similarities & Differences\n\nNow, let’s look at the similarities and differences between BlobScriptions and Bitcoin Ordinal inscriptions.\n\nHere are some of the aspects in which they are similar:\n\nData storage purpose: BlobScriptions and Ordinal inscriptions allow users to embed data directly onto the blockchain. This data could include text, images, or any other digital content.\n\nImmutable storage: Once data on BlobSriptions and Ordinal inscriptions is embedded, it becomes part of the blockchain’s immutable ledger. Hence, the data cannot be altered or deleted.\n\nStill, BlobScriptions and Bitcoin Ordinal inscriptions have several differences, as outlined in the tale below.\n\nFeature BlobScriptions Bitcoin Inscriptions Blockchain Ethereum Bitcoin Data storage On Ethereum’s blobs On the Bitcoin blockchain Introduced After Dencun upgrade in March 2024 After Taproot upgrade Transaction type Data is inscribed onto blobs Data is attached to individual satoshis (sats) Cost Cost-effective as blob transactions have lower fees compared to calldata transactions Bitcoin Inscription fees depend on the size of the data being inscribed Permanence Data is temporary on Ethereum’s main network and may be preserved by external indexers Data remains on the Bitcoin blockchain indefinitely\n\nFinal Word\n\nMany Ethereum enthusiasts anticipate that the hype and use of BlobScriptions will be short-lived.\n\nAccording to Jim McDonald, co-founder of Ethereum staking provider Attestant, there’s an expectation that the pricing of blobs for layer 2 solutions will become more reasonable for their intended purpose over time. This could render Ethereum too costly for those seeking to utilize it merely as a “graffiti wall.”\n\nHowever, if BlobScriptions continue to gain traction or remain stable, the price of layer 2 solutions, significantly reduced by the March software upgrade, might increase more rapidly than anticipated. This could necessitate the development of new tools, and additional upgrades could be needed to lower the prices."
    }
]