[
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQV19Fek5TbDBsMmctTHNSWk5FSWhJVU5wQ2F6RFFYRHJ5V1p3T2NteXJTcXB6V0dCbkFiM1hTSGFBUGNMNzNlUXc2MjdkSzR2TVgtcHJmNjIxYVRTdjh2S1pYdGIxTThjNVBmeXJwTjNSR2JuZEpTeDVrZXFYQloxMjJ4Rm5CM0U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Decision Recalls Spot Bitcoin Launch - Yahoo Finance",
        "content": "Cryptocurrency\n\nRemember the spot bitcoin ETF launch?\n\nAs the spot Ethereum ETF approval drama unfolds, investors and exchange-traded fund industry observers can recall parallels between this case and events leading to the eventual approval and unveiling of spot bitcoin ETFs.\n\nIn both cases, the Securities and Exchange Commission (SEC) initially exhibited caution toward approving spot ETFs for these cryptocurrencies. However, pressure from various stakeholders, including issuers, investors and the maturing crypto market, spurred a potential shift toward approval.\n\nBoth decisions reflect growing recognition of the maturing cryptocurrency market and rapidly increasing institutional interest in these assets.\n\nThe presence of spot bitcoin ETFs and the potential approval of an ether-based ETF suggest the SEC is considering the growing demand from investors for regulated ways to gain exposure to these cryptocurrencies.\n\nA key difference between the two cases is that the Ethereum ETF approval process may be faster than bitcoin's due to the legal precedent set by the August 2023 Grayscale court case, which effectively reversed the SEC’s initial rejection of the asset manager's spot bitcoin ETF application.\n\nBoth cases highlight the complex path to approval and greater receptivity toward well-structured spot cryptocurrency ETFs.\n\nIs a Dogecoin ETF Next?\n\nIn the first two days of trading this week, the popular cryptocurrency Dogecoin (DOGE) jumped 9% as investors began to speculate that the largest meme coin by market cap could be the next for a spot ETF approval.\n\nCrypto trader Andrew Kang tweeted to his 244,000 followers on X Tuesday, “the odds for a DOGE ETF look brighter than ever.”\n\nWhile speculation over more spot ETFs is not surprising, it would be surprising if a spot DOGE ETF was next in line.\n\nCryptocurrencies with clear and demonstrably valuable use cases beyond speculation might be viewed more favorably. Additionally, a well-developed ecosystem with robust infrastructure for secure storage and transactions could be a plus. Widespread acceptance, measured by larger market capitalization (total value of all outstanding coins) and higher trading volume (liquidity) may also be considerations.\n\nFor example, there are five cryptocurrencies other than Bitcoin and ether that have larger market caps than Dogecoin, according to data from CoiMnarketCap.com.\n\nBehind Bitcoin and Ethereum, these are the largest cryptocurrencies on the market:\n\nTether USDt (USDT): This stablecoin, with a market cap of roughly $111 billion, is pegged to the U.S. dollar and is a popular choice for investors seeking stability within the crypto market.\n\nBNB (BNB): The native coin of the Binance ecosystem, BNB, has a market cap of around $91 billion and is used for various purposes within the Binance exchange and its blockchain applications.\n\nSolana (SOL): Solana, known for its fast transaction processing speeds, currently has a market cap of approximately $80 billion.\n\nStory continues\n\nOverall, the spot Bitcoin ETF launches and increasingly likely spot Ethereum approvals are positive developments, but they don't guarantee a flood of spot ETFs for more cryptocurrencies. The SEC will likely continue cautiously, prioritizing established cryptocurrencies with well-structured ETF proposals.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQV19Fek5TbDBsMmctTHNSWk5FSWhJVU5wQ2F6RFFYRHJ5V1p3T2NteXJTcXB6V0dCbkFiM1hTSGFBUGNMNzNlUXc2MjdkSzR2TVgtcHJmNjIxYVRTdjh2S1pYdGIxTThjNVBmeXJwTjNSR2JuZEpTeDVrZXFYQloxMjJ4Rm5CM0U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Decision Recalls Spot Bitcoin Launch - Yahoo Finance",
        "content": "Cryptocurrency\n\nRemember the spot bitcoin ETF launch?\n\nAs the spot Ethereum ETF approval drama unfolds, investors and exchange-traded fund industry observers can recall parallels between this case and events leading to the eventual approval and unveiling of spot bitcoin ETFs.\n\nIn both cases, the Securities and Exchange Commission (SEC) initially exhibited caution toward approving spot ETFs for these cryptocurrencies. However, pressure from various stakeholders, including issuers, investors and the maturing crypto market, spurred a potential shift toward approval.\n\nBoth decisions reflect growing recognition of the maturing cryptocurrency market and rapidly increasing institutional interest in these assets.\n\nThe presence of spot bitcoin ETFs and the potential approval of an ether-based ETF suggest the SEC is considering the growing demand from investors for regulated ways to gain exposure to these cryptocurrencies.\n\nA key difference between the two cases is that the Ethereum ETF approval process may be faster than bitcoin's due to the legal precedent set by the August 2023 Grayscale court case, which effectively reversed the SEC’s initial rejection of the asset manager's spot bitcoin ETF application.\n\nBoth cases highlight the complex path to approval and greater receptivity toward well-structured spot cryptocurrency ETFs.\n\nIs a Dogecoin ETF Next?\n\nIn the first two days of trading this week, the popular cryptocurrency Dogecoin (DOGE) jumped 9% as investors began to speculate that the largest meme coin by market cap could be the next for a spot ETF approval.\n\nCrypto trader Andrew Kang tweeted to his 244,000 followers on X Tuesday, “the odds for a DOGE ETF look brighter than ever.”\n\nWhile speculation over more spot ETFs is not surprising, it would be surprising if a spot DOGE ETF was next in line.\n\nCryptocurrencies with clear and demonstrably valuable use cases beyond speculation might be viewed more favorably. Additionally, a well-developed ecosystem with robust infrastructure for secure storage and transactions could be a plus. Widespread acceptance, measured by larger market capitalization (total value of all outstanding coins) and higher trading volume (liquidity) may also be considerations.\n\nFor example, there are five cryptocurrencies other than Bitcoin and ether that have larger market caps than Dogecoin, according to data from CoiMnarketCap.com.\n\nBehind Bitcoin and Ethereum, these are the largest cryptocurrencies on the market:\n\nTether USDt (USDT): This stablecoin, with a market cap of roughly $111 billion, is pegged to the U.S. dollar and is a popular choice for investors seeking stability within the crypto market.\n\nBNB (BNB): The native coin of the Binance ecosystem, BNB, has a market cap of around $91 billion and is used for various purposes within the Binance exchange and its blockchain applications.\n\nSolana (SOL): Solana, known for its fast transaction processing speeds, currently has a market cap of approximately $80 billion.\n\nStory continues\n\nOverall, the spot Bitcoin ETF launches and increasingly likely spot Ethereum approvals are positive developments, but they don't guarantee a flood of spot ETFs for more cryptocurrencies. The SEC will likely continue cautiously, prioritizing established cryptocurrencies with well-structured ETF proposals.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNTDliYkhySmlnWWwtVzY2bkVQZVFmVHBOdzJfYVppb3VQX29qVXBXOFNXTjQ2NktwNTBFYzYxRFRnYktGZ2hjaUxVSUFLeTloNjJmYmJuLTl1MUtJSWVEWjgwYUZ5YjEwRFVxRU5aUVlZRGROV2hpUlQyRFU1RXVqNHZYQnhnTlBYalNVUzZFRTAyOXFLbXZBVtIBngFBVV95cUxQbDlHdG5HdXUtZUtvbVJUWFI2R0Q0MW5oX3BSMzdMaFRPNFVMUWpVWVQ4b0N5d0FORGpoWDhqcktKODZEdGRydnZWcWExYUQ3MFNOSXhwb0lETm1lUVpiM000RlJQVWJ2LW1HWXdFS0ZFMF9qd0tFcW55N0FRaVVyLUhIYmxjOHFZM3ZkazlDM0xTOFk0Vy1NN2F3YlhCdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "SEC approves rule change to allow creation of ether ETFs - CNBC",
        "content": "A representation of cryptocurrency Ethereum is placed on a PC motherboard in this illustration taken on June 16, 2023.\n\nThe SEC has approved a rule change Thursday that would pave the way for ETFs that buy and hold ether , one of the world's largest cryptocurrencies.\n\nThe decision comes less than six months after the Securities and Exchange Commission approved bitcoin ETFs. Those funds have proven to be a big success for the industry, with net inflows already surpassing $12 billion, according to FactSet.\n\nLate May had long been pegged as a potential decision date for the ether funds since it coincided with a deadline for the SEC to decide whether the VanEck Ethereum ETF could proceed.\n\nMany of the companies that sponsor bitcoin ETFs — including BlackRock, Bitwise and Galaxy Digital — have also started the process of the launching an ether fund.\n\nThe price of ether rose just 2%, although it follows a 20% surge from earlier in the week in anticipation of Thursday's decision. Some investors may also be on pause, as the SEC's rule change approval does not guarantee that all the funds will launch.\n\nSpecifically, the SEC's order approves applications from various exchanges to list eight different ether funds. The order technically does not approve the funds themselves or set a date for the ETFs to begin trading.\n\nEther ETFs are expected to be smaller, at least initially, than their bitcoin counterparts. The Grayscale Ethereum Trust currently has about $11 billion in assets, much smaller than what the firm's bitcoin fund was before its conversion.\n\nThe approval of the ether ETFs is a sign that the SEC's stance toward crypto may be softening after a series of legal fights. The agency lost a lawsuit against Grayscale in 2023 that spurred the approval for the bitcoin products.\n\nThe SEC's push to regulate crypto has also come under scrutiny by politicians. The Senate last week passed a resolution to withdraw an SEC staff bulletin about accounting rules for digital assets.\n\nEther is the second largest crypto asset and has become something of a blue chip coin along with bitcoin, although its value proposition is distinctly different. While bitcoin is seen primarily as a long-term store of value, an investment in ether is considered more akin to an investment in early stage technology. The ether token fuels the Ethereum network, which powers different applications, like decentralized finance (DeFi) projects, nonfungible tokens (NFTs) or the tokenization of real world assets like commodities, securities, art, real estate and more.\n\nThe applications approved Thursday do not apply to other crypto projects on the Ethereum network, said Richard Kerr, a partner in the law firm K&L Gates.\n\n\"If and when an ether product is approved, it won't mean that a similar product for other digital assets on the Ethereum platform would be approved,\" Kerr said.\n\nEthereum also provides opportunities for staking, which is a way for investors to earn interest on their ether holdings by locking up tokens on the network for a period of time — although ether ETFs in the U.S. may not participate. The SEC has alleged in lawsuits against Coinbase and Kraken that staking-as-a-service offerings are unregistered securities. Ark, Fidelity and Grayscale updated their filings this month to remove staking from their proposals.\n\nThe lack of staking in the ETF products is another reason why ether ETFs may see less demand than their bitcoin counterparts, said Steven Lubka, managing director at Swan Bitcoin and head of Swan Private.\n\n\"These numbers are not going to match the bitcoin ETF inflows, and there are some structural differences in the product that just make it less attractive overall,\" Lubka said."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOb1o0SUR2VFFpYlJMR1RBRm1BUWJoMXM5U2hQdzkwTXBWVGpjRElGRzRBRDBDZnozdHBMc0huMDhKSzZFN2FBNFVJVm5lckMxOWdjM29PTkNPdnRQRndHRG82ZjVQcXI1cTFtYWNpSENOUEJkWDZJVkRBMXVfRXBrYThra0h3Y2dr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Crypto Roundup: Bitcoin Stays Steady, Ethereum Jumps 23%, and Furrever Token's 15X Returns Capture Attention - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, May 23, 2024 (GLOBE NEWSWIRE) --\n\n\n\nThe cryptocurrency market is buzzing with activity today, marked by notable developments in Bitcoin, Ethereum, and Furrever Token. As Bitcoin holds steady on Bitcoin Day, maintaining its value from yesterday, Ethereum has captured significant attention by surging 23% in just one week. Adding to the excitement, Furrever Token has caught the eye of many investors with its potential for up to 15X returns, making waves in the crypto community. These dynamic shifts highlight the ever-evolving landscape of digital currencies and the diverse opportunities they present for traders and investors alike.\n\nEthereum Surges 23% in a Week Amid Record ETF Trading Volumes\n\nEthereum (ETH) is currently trading around $3,750, nearly unchanged from yesterday but up 23% over the past week. This surge is driven by growing anticipation of spot Ethereum ETF approvals from the U.S. Securities and Exchange Commission (SEC).\n\nOn Tuesday, Ethereum futures ETFs hit a record daily trading volume of $47.75 million, a 40% increase from the previous peak in March. ProShares' Ether Strategy ETF (EETH) led the way, accounting for $43.14 million of the volume, followed by VanEck's Ethereum Strategy ETF (EFUT) with $2.6 million and Bitwise's Ethereum Strategy ETF (AETH) with $2.01 million.\n\nDespite this new record, Ethereum futures ETF trading volumes remain far below those of spot Bitcoin ETFs, which saw $2.16 billion in trading on Tuesday, dominated by BlackRock’s IBIT with $1.12 billion. Grayscale's Ethereum Trust (ETHE) also saw a significant increase, reaching $684.44 million in daily trading volume, the highest since May 2021.\n\nBloomberg ETF analysts Eric Balchunas and James Seyffart have increased the likelihood of spot Ethereum ETF approvals from 25% to 75%, citing a possible shift in the SEC’s stance on crypto regulation. This optimism has further fueled Ethereum's recent gains.\n\nAs the market awaits potential SEC approval for spot Ethereum ETFs, the increased trading activity and positive sentiment continue to bolster ETH's price, positioning it for further growth.\n\nBitcoin Holds Steady at $69,400 Amid Market Uncertainty\n\nBitcoin (BTC) is currently trading around $69,400, maintaining a stable position from yesterday but up by 5% over the past week. The slight drop in Bitcoin’s price on Wednesday came as traders cashed in on recent gains fueled by optimism over a potential spot Ether ETF approval.\n\nEther, the world's second-largest cryptocurrency, also experienced a pullback after reaching a two-month high earlier in the week. This movement was driven by reports of progress towards the approval of spot ETFs by the U.S. Securities and Exchange Commission (SEC), which is expected to make a key decision later this week.\n\nStory continues\n\nDespite the optimism surrounding the spot Ether ETF, broader market sentiment remains cautious due to ongoing concerns about U.S. interest rates. Persistent inflation and warnings from several Federal Reserve officials about the need for more evidence of decreasing inflation before rate cuts can begin have kept traders wary.\n\nAttention is now focused on the minutes from the Fed's late-April meeting, which could provide further insights into the central bank’s plans regarding interest rates. High interest rates generally have a negative impact on crypto markets, as they reduce the attractiveness of high-risk and speculative assets like cryptocurrencies.\n\nThe cautious sentiment in the market underscores the delicate balance between optimism over potential regulatory approvals and concerns over macroeconomic factors affecting the crypto landscape. As traders await further cues from the Fed, Bitcoin's price stability reflects the broader uncertainty in the market.\n\nFurrever Token's 15X Return Promise Attracts a Wave of Investors\n\nFurrever Token (FURR) has captured the crypto community's attention with its promise of up to 15X returns for presale investors after its official launch. This enticing potential has sparked a significant influx of investors eager to capitalize on the opportunity before the presale concludes.\n\nThe Furrever Token presale has been a roaring success, with over $1.1 million raised in just three months. Currently in stage 8 of its 10-stage presale, Furrever Token aims to raise a total of $1.9 million. The current token price is $0.000648, and investors can purchase FURR exclusively from the official website, furrevertoken.com.\n\nFurrever Token's mission is to create a fun and heart-warming crypto ecosystem centered around adorable cat imagery. The project integrates cute cat-themed stickers, emojis, and visuals, fostering a warm and friendly community. This unique approach has resonated with many investors, contributing to its organic growth and engaged community of nearly 4,000 members on Telegram.\n\nThe legitimacy of Furrever Token is bolstered by a smart contract audited by Securi Lab, no buy/sell tax, and a team committed to locking their tokens for a year. These measures reassure investors of the project's long-term viability and security.\n\nWith the presale nearing its end, now is the perfect time to invest in Furrever Token. The potential for significant returns, combined with the project's innovative and community-focused approach, makes FURR an attractive investment opportunity. Don’t miss out on the chance to be part of this exciting journey. Visit furrevertoken.com to invest in Furrever Token before the presale ends and join a community that celebrates the lighter side of crypto.\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nJoin $20,000 Furrever Token Giveaway\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOb1o0SUR2VFFpYlJMR1RBRm1BUWJoMXM5U2hQdzkwTXBWVGpjRElGRzRBRDBDZnozdHBMc0huMDhKSzZFN2FBNFVJVm5lckMxOWdjM29PTkNPdnRQRndHRG82ZjVQcXI1cTFtYWNpSENOUEJkWDZJVkRBMXVfRXBrYThra0h3Y2dr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Crypto Roundup: Bitcoin Stays Steady, Ethereum Jumps 23%, and Furrever Token's 15X Returns Capture Attention - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, May 23, 2024 (GLOBE NEWSWIRE) --\n\n\n\nThe cryptocurrency market is buzzing with activity today, marked by notable developments in Bitcoin, Ethereum, and Furrever Token. As Bitcoin holds steady on Bitcoin Day, maintaining its value from yesterday, Ethereum has captured significant attention by surging 23% in just one week. Adding to the excitement, Furrever Token has caught the eye of many investors with its potential for up to 15X returns, making waves in the crypto community. These dynamic shifts highlight the ever-evolving landscape of digital currencies and the diverse opportunities they present for traders and investors alike.\n\nEthereum Surges 23% in a Week Amid Record ETF Trading Volumes\n\nEthereum (ETH) is currently trading around $3,750, nearly unchanged from yesterday but up 23% over the past week. This surge is driven by growing anticipation of spot Ethereum ETF approvals from the U.S. Securities and Exchange Commission (SEC).\n\nOn Tuesday, Ethereum futures ETFs hit a record daily trading volume of $47.75 million, a 40% increase from the previous peak in March. ProShares' Ether Strategy ETF (EETH) led the way, accounting for $43.14 million of the volume, followed by VanEck's Ethereum Strategy ETF (EFUT) with $2.6 million and Bitwise's Ethereum Strategy ETF (AETH) with $2.01 million.\n\nDespite this new record, Ethereum futures ETF trading volumes remain far below those of spot Bitcoin ETFs, which saw $2.16 billion in trading on Tuesday, dominated by BlackRock’s IBIT with $1.12 billion. Grayscale's Ethereum Trust (ETHE) also saw a significant increase, reaching $684.44 million in daily trading volume, the highest since May 2021.\n\nBloomberg ETF analysts Eric Balchunas and James Seyffart have increased the likelihood of spot Ethereum ETF approvals from 25% to 75%, citing a possible shift in the SEC’s stance on crypto regulation. This optimism has further fueled Ethereum's recent gains.\n\nAs the market awaits potential SEC approval for spot Ethereum ETFs, the increased trading activity and positive sentiment continue to bolster ETH's price, positioning it for further growth.\n\nBitcoin Holds Steady at $69,400 Amid Market Uncertainty\n\nBitcoin (BTC) is currently trading around $69,400, maintaining a stable position from yesterday but up by 5% over the past week. The slight drop in Bitcoin’s price on Wednesday came as traders cashed in on recent gains fueled by optimism over a potential spot Ether ETF approval.\n\nEther, the world's second-largest cryptocurrency, also experienced a pullback after reaching a two-month high earlier in the week. This movement was driven by reports of progress towards the approval of spot ETFs by the U.S. Securities and Exchange Commission (SEC), which is expected to make a key decision later this week.\n\nStory continues\n\nDespite the optimism surrounding the spot Ether ETF, broader market sentiment remains cautious due to ongoing concerns about U.S. interest rates. Persistent inflation and warnings from several Federal Reserve officials about the need for more evidence of decreasing inflation before rate cuts can begin have kept traders wary.\n\nAttention is now focused on the minutes from the Fed's late-April meeting, which could provide further insights into the central bank’s plans regarding interest rates. High interest rates generally have a negative impact on crypto markets, as they reduce the attractiveness of high-risk and speculative assets like cryptocurrencies.\n\nThe cautious sentiment in the market underscores the delicate balance between optimism over potential regulatory approvals and concerns over macroeconomic factors affecting the crypto landscape. As traders await further cues from the Fed, Bitcoin's price stability reflects the broader uncertainty in the market.\n\nFurrever Token's 15X Return Promise Attracts a Wave of Investors\n\nFurrever Token (FURR) has captured the crypto community's attention with its promise of up to 15X returns for presale investors after its official launch. This enticing potential has sparked a significant influx of investors eager to capitalize on the opportunity before the presale concludes.\n\nThe Furrever Token presale has been a roaring success, with over $1.1 million raised in just three months. Currently in stage 8 of its 10-stage presale, Furrever Token aims to raise a total of $1.9 million. The current token price is $0.000648, and investors can purchase FURR exclusively from the official website, furrevertoken.com.\n\nFurrever Token's mission is to create a fun and heart-warming crypto ecosystem centered around adorable cat imagery. The project integrates cute cat-themed stickers, emojis, and visuals, fostering a warm and friendly community. This unique approach has resonated with many investors, contributing to its organic growth and engaged community of nearly 4,000 members on Telegram.\n\nThe legitimacy of Furrever Token is bolstered by a smart contract audited by Securi Lab, no buy/sell tax, and a team committed to locking their tokens for a year. These measures reassure investors of the project's long-term viability and security.\n\nWith the presale nearing its end, now is the perfect time to invest in Furrever Token. The potential for significant returns, combined with the project's innovative and community-focused approach, makes FURR an attractive investment opportunity. Don’t miss out on the chance to be part of this exciting journey. Visit furrevertoken.com to invest in Furrever Token before the presale ends and join a community that celebrates the lighter side of crypto.\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nJoin $20,000 Furrever Token Giveaway\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    }
]