[
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5XbndqSXAzR1ZBXzRSSHNhTVdaNlEwVlBOOEtPcjZ2d3Z1cUNtYW5Obm81VHFvZlluM1hIMXNnVWJHNFNWUlZkM01PQnlsSkgwZVhBbU4ydzI3Vjhza1RLYkdya3BqN2RaY3pkano1Z3nSAXZBVV95cUxPSm9jT25haTd6RTZ0OWt1bTBDS3NEbmlwZUQ3Uk5mVVdIODczSDlUcnFfQV9GRTM4eFNQTnY1b2tWRDFKTHFubUo3R3JSdE5pZlJIaVVJYkxqTkJJRUFwVTE0LWJic01EMnN5aWR5S3JwRWltVnVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 03:29:03 GMT",
        "title": "Ethereum Price Sets Sights on Upside Break: Indicators Turn Green - NewsBTC",
        "content": "Ethereum price is moving higher above the $3,080 resistance zone. ETH could gain bullish momentum if there is a close above the $3,150 resistance.\n\nEthereum is slowly moving higher above the $3,050 level.\n\nThe price is trading above $3,050 and the 100-hourly Simple Moving Average.\n\nThere was a break above a short-term bullish flag with resistance near $3,090 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could gain bullish momentum if there is a close above the $3,150 resistance zone.\n\nEthereum Price Could Extend Gains Above $3,150\n\nEthereum price extended its recovery wave above the $3,000 resistance zone. ETH even climbed above the $3,050 resistance. There was a break above a short-term bullish flag with resistance near $3,090 on the hourly chart of ETH/USD.\n\nThe pair even spiked above the $3,110 resistance, outperforming Bitcoin. It tested the $3,150 resistance zone. A high was formed at $3,149 and the price is now consolidating gains. There was a minor decline below $3,120. The price tested the 23.6% Fib retracement level of the upward move from the $2,895 swing low to the $3,149 high.\n\nEthereum is now trading above $3,050 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $3,120 level.\n\nThe first major resistance is near the $3,150 level. The next major hurdle is near the $3,220 level. A close above the $3,220 level might send Ether toward the $3,320 resistance. The next key resistance is near $3,400. An upside break above the $3,400 resistance might send the price higher toward the $3,500 resistance zone in the coming days.\n\nAnother Decline In ETH?\n\nIf Ethereum fails to clear the $3,150 resistance, it could start another decline. Initial support on the downside is near $3,080. The first major support sits near the $3,020 zone and the 50% Fib retracement level of the upward move from the $2,895 swing low to the $3,149 high.\n\nA clear move below the $3,020 support might push the price toward $2,955. Any more losses might send the price toward the $2,880 support level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $3,020\n\nMajor Resistance Level – $3,150"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxNTDdKMXNacXlLY0RwWnZQZEVMZDUtQ1FPN1BHRW5MUC1RN09ZdFg2a1lZNWZPNVJxWGIzTFdHSHdsNXB1OE1XYXFEV19HdXA4bHZDZWRIdXh2eW44OHJ5bWJoaV9PNXBVWW1vQWhxQmNtQ084V1RLQ09lcjdxS0pzTm9CcDRZbEdXRVB3V0FnTWwweGo0WlJ3TExXTDc4WWJnZV9lUWtndEZMS19mc1lDcm5rMHNZS0dLY1N3Y1JsaHp4TDVVRkZLemdQNW8tQ0lr0gHWAUFVX3lxTE5sbjVWNXBINjhpTVdDN3AtQTg4Y3l2UVl5SVI2dEtEN09Fc3paS19EYldtTWlNS2JFS2hhLU85S0NXRG1WT01CSUs5QXhUQUpKSGs4YTdpaHFDQnhsQll5NFBtbGtPRlVBWVZPMlZIVHVOY0JEcTF3bmhrY291MnVpUHhzR2hlcGtQWkQ2MGdrT3dfTVA1QnU5OVI5WllIM1dtZ3Vzemh6bzVuNjR5RzlRbnNvTzlod0JmWm5wNG5Wbnd6UDhuNXhCemtQdjJMcVEwb0FGdWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Trader Says Ethereum Rival To Perform Well Over Coming Months, Updates Outlook on Bitcoin and Celestia - The Daily Hodl",
        "content": "A popular crypto trader thinks one Ethereum (ETH) rival is primed to perform well over the coming months.\n\nThe pseudonymous analyst known as Altcoin Sherpa tells his 217,800 followers on the social media platform X that he’s “pretty neutral” on Solana (SOL) over the short term but more optimistic on the asset as 2024 winds down.\n\n“I still believe $120-170 is a decent region to accumulate SOL overall, and I think this still does pretty well in the second part of the year. Not really expecting this one to move until the overall market environment improves though.”\n\nSOL is trading at $140.87 at time of writing. The 5th-ranked crypto asset by market cap is down more than 1% in the past 24 hours.\n\nAltcoin Sherpa also shares his prediction on Bitcoin (BTC).\n\n“Expecting a few days of green, after that, I have no clue. Next week should be pretty telling if we’re headed back within the range or not. Short-term bullish but mid-term, no clue.”\n\nBTC is trading at $57,519 at time of writing and is down more than 1% in the past 24 hours.\n\nThe analyst also says he plans to watch the native asset of the modular blockchain network Celestia (TIA) for a potential bull flag.\n\n“Modular is back and sexy. I’m looking to buy TIA at $6.00 or a bit lower. Let’s see if/when it comes.”\n\nBull flags, as the name suggests, are typically seen as bullish technical setups that imply an upward impulse and then a brief consolidation before another move up.\n\nTIA is trading at $6.82 at time of writing. The 66th-ranked crypto asset by market cap is down more than 3.5% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOUDhBNW1lUEhGZUhLNTRiQVE4YjlNOFJldkYwQWVDM3B6REFCWWh0eEZ6VEkzc3hnOExKRmU5cjNpYTVmbGd3bkdyMHJELUktZEdrcmh3MktPaDNZRkN2cEYyMXRtaHNNdHZleEZNeWJibWlsRC1zYjMyTlo2SzJ4Zmc0NXBqOWVNVTFyTNIBkgFBVV95cUxQOW9uU2taS2FvTG8zSFBYUGs1ZlpRTm1lVFEtOHJVdWJpem1MeUtlNGlLSVJJbl9NTjNpMndRcnlrUVRMT1pTaXREX3U2Wm9LYnAwc3dsNVdJSy10RGpZbHQzOVY3cGw5TUh6RW96OUtkaWMybnF1RVBnajk4blVMS3UyZUliSmZtU1ZVUDczeEduZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs ‘close to the finish line,’ celebrates Bitwise CCO - AMBCrypto News",
        "content": "The launch of Ethereum ETFs remained uncertain despite Gensler’s summer prediction.\n\nSEC’s cautious crypto stance contrasted with the Bitcoin ETF approval under Gensler.\n\nAmid mounting anticipation, the upcoming launch of a spot Ethereum [ETH] exchange-traded fund [ETF] has garnered significant attention.\n\n\n\nRemarking on the same, Katherine Dowling, Bitwise’s chief compliance officer, emphasized the uncertainty surrounding the exact launch date.\n\nBitwise CCO on ETH ETF\n\nDespite SEC Chair Gary Gensler predicting a summer debut for the ETH ETF, Dowling in a recent conversation with Bloomberg, said,\n\n“We’re seeing in the S-1 amendments that there are fewer and fewer issues that are being vetted back and forth between issuers and the SEC.”\n\nShe further added,\n\n“So that points all signs in the direction that we are close. We’re close to the finish line on the launch.”\n\nTime for a crypto-friendly SEC admin?\n\nThis is quite surprising because Bitwise was one of the first issuers to take proactive steps by submitting an amended S-1 form to the SEC ahead of schedule, on 8th July.\n\nThis move had back then sparked excitement within the crypto community about the imminent approval of the ETH ETF.\n\nHence, the delay and uncertainty in approval highlight the SEC’s cautious stance on crypto during the Biden administration.\n\nExpanding on the topic, Eric Balchunas, Senior ETF Analyst at Bloomberg, put it well when he said,\n\n“Looks like Solana ETFs are going to have a final deadline of mid-March 2025. But between now and then the most imp date is in November. If Biden wins, these likely DOA. If Trump wins, anything poss.”\n\nReiterating the same, Dowling added,\n\n“I think it’s going to be a really long haul to get some of these products out in the market, given the history we’ve had with getting these products to market and the fact of not having futures trading in some of these potential products.”\n\nNot all bad things!\n\nHowever, she also highlighted the SEC’s potential for positivity during the ETF approval process when she said,\n\n“But it’s an act of dialogue and I think our communication with the SEC about the prospects for these products has actually been quite welcoming.\n\nThis is important because, despite the SEC’s historical lack of interest in crypto, the current leadership under Gensler approved a decade-long-awaited Bitcoin [BTC] ETF.\n\nNeedless to say, the performance of the BTC ETF has been phenomenal since its debut on the 11th of January. As of the latest update on the 9th of July, the BTC ETF recorded inflows totaling $216.4 million as per Farside Investors."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQdS1FWXpZMzJEX2JtX1FxSVd2Nm4ybFF2Ym1vU0dJd3BhaDVCS3JxZmFNcmtRRlVXbDhaX2tqTGhwRGxBLW9qYnIwVlc4T0NpUmVXWlMwZ00zRl9lT1poSkZ0cEZ3dmFWMmgzUmZ6dGI2cTh1SGJYRVhXb2dmd2ExQzF30gGHAUFVX3lxTFBSYjQzck1kdjhBQi1NZV9JOFAySGxIRkItT091RjVtNmFKQjBkazg0T0RjaXBtYkZCaTZrVnZjbE5DRkQ5dzh2SGx3b2ZOUndmTE85ZHpwM3FvLTJPdmNnbUFadm9NUG1sNFgwYmU1Q2R2ZnhxZWd1d1ZQVHI2UXRYN1RFOE1Ncw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Justin Sun Buys $5 Million In ETH Ahead of Ethereum ETF Approval - CoinGape",
        "content": "Amid the current market volatility, the Ethereum (ETH) price is showing strength and holding steady around $3070 levels. There’s a massive whale activity currently happening around Ethereum, with Tron founder Justin Sun trying to absorb all the selling pressure before the upcoming approval of spot Ethereum ETF, scheduled within the next two weeks.\n\nJustin Buys Ethereum in Huge Quantity\n\nAs per on-chain data provider Spot on Chain, Tron founder Justin Sun spent a total of $5 million USDT in order to acquire 1,614 ETH at a price of $3,097 per token.\n\nadvertisement\n\nSun has been on an Ethereum accumulation spree since the beginning of the year. Spot on Chain reports that since February 8, Justin Sun has reportedly accumulated a total of 362,751 ETH across three different wallets, for an estimated total investment of $1.1 billion, and an average price of $3,047 per ETH.\n\nAlong with these purchases, Spot on Chain also noted that Sun recently deposited 45 million USDT to Binance, suggesting the possibility of future Ethereum acquisitions.\n\n12 hours ago, Justin Sun (@justinsuntron) allegedly spent 5M $USDT to buy 1,614 $ETH at ~$3,097. Since Feb 8, Justin Sun might have bought 362,751 $ETH (est. cost: $1.11B) at ~$3,047 via 3 wallets (more details in previous posts 👇). Note that he also deposited 45M $USDT to… https://t.co/xeW1usR3MJ pic.twitter.com/aJ4zhXFas2 — Spot On Chain (@spotonchain) July 11, 2024\n\nInterestingly, the ETH whale accumulation has been happening just ahead of the spot Ether ETF approval, likely to happen before the end of July.\n\nAlso Read: Justin Sun Confirms Development Of Gas-Free Stablecoin Solution\n\nEthereum Whale Activity Jumps\n\nWhile Justin Sun has been picking up Ethereum from the exchanges, there have also been huge ETH deposits taking place recently. In the last 24 hours, the Golem Project was one of the major depositors of ETH to crypto exchange Binance. However, on-chain data shows that they have reportedly stopped selling ETH, while simultaneously staking a total of 40,000 ETH.\n\nMoreover, Elwood Technologies has also deposited 26,811 ETH worth over $84 million to crypto exchange Binance in the last three days. However, some of the Elwood-related addresses also withdrew 24,463 ETH from Binance during the same time.\n\nAs of now, the ETH price is holding firmly above $3,000 despite this massive whale activity. Technical indicators suggest that the Ethereum bottom could already be in.\n\n$ETH – Thought we were gonna bounce at the first support (red line) but that broke. The good news is this support is looking much stronger and that’s a much better response. I’m hoping that was the low of Q3. pic.twitter.com/GzitxuQN8i — IncomeSharks (@IncomeSharks) July 10, 2024\n\nAlso Read: Ethereum Investors Are Ready To Sell ETH As It Hits $3.2K\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBtdzNIakdkeEliN01BYXZGd0tFcmhpWDN5a3FEamlKVTMxSGsyRXhuYVVsdWxNQmtJWHpUNlc0T3hYc08yNU1MbTJZM2hCLVVJS1plVXI5MmRaeG9WYmp5Y1VwRk5VN0V0dktB0gFwQVVfeXFMUFdOQXBjQ3dVTjJjWXF0YWI0SGxzalFOUTNRLUY5S1l5bE1Xb2Uzd1hTN2szT0RuazdSbnBCNF8wRG56ZXk0QTgtc1lXWXlRNWFINVBHS19hOWxNVGNMWEpsUlR0UE5pZ21QMmJyZV9fOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "What is ENS? Ethereum Name Service Explained (Updated 2022) - CryptoPotato",
        "content": "Back in the days, when the Internet wasn’t so mainstream, one of the main problems that users faced was that domain names hadn’t been matched up to Internet protocol (IP) addresses.\n\nThis made them very unfriendly towards the average Joe, who had to type in the IP address of the website they wanted to visit, as in to type in the numbers literally.\n\nUnlike traditional IPs, cryptocurrency addresses represent even longer strings of numbers and letters. If a user wants to send another user funds over Ethereum’s network, they would have to input the address and make sure that each number and letter is written correctly.\n\nQuick Navigation\n\nIt’s also important to know that blockchain-based technology is very punishing in this regard. If you fail to input the address correctly and mistype a letter, the funds you send will be irreversibly lost. There’s no central authority to contact to reverse or refund the transaction—that money is lost.\n\nAnd just like Domain Name Services (DNS) came to life when using the Internet, the Ethereum Name Service (ENS) came to be.\n\nWhat is Ethereum Name Service (ENS)?\n\nEthereum Name Service (ENS) uses the same concept as the Domain Name Service (DNS) but adjusts it for the needs of Ethereum users. At its core, the Ethereum Name Service is a distributed, open, and extensible naming system operating on the Ethereum blockchain.\n\nIt aims to map human-readable names to machine-readable identifiers. In this case, the human-readable name can be something like “cactus.eth,” whereas the machine-readable identifier can be the Ethereum address (or other cryptocurrency addresses, for that matter.)\n\nIn the image below, we have given an example of what it looks like. The address belongs to the Ethereum Foundation. The ENS domain name that we created is just an example for the purpose of this guide:\n\nThe standard Ethereum Address is converted into human-readable text (foundation.eth). This means that users can send funds or interact with “foundation.eth” instead of the standard address. Obviously, this makes it much easier for regular users and also considerably tightens the possibility of a mistake.\n\nAccording to the official ENS documentation, the system “has similar goals to DNS, the Internet’s Domain Name Service, but has significantly different architecture due to the capabilities and constraints provided by the Ethereum blockchain.”\n\nSimilar to DNS, ENS operates on a system of dot-separated hierarchical names called domains. The owner of a domain also has full control over the subdomains.\n\nHow Does ENS Work?\n\nThere are two core components to the Ethereum Name Service. Namely, these are the registry and the resolvers. The architecture of the system looks like this:\n\nRegistry\n\nThe registry is composed of a smart contract designed to maintain a list of all the domains and subdomains while also storing three essential pieces of information about each. These pieces are:\n\nThe owner of the domain\n\nThe resolver of the domain\n\nThe caching time-to-live for all the records that are under the domain\n\nThe purpose of the ENS registry is very straightforward – it’s to map from a name to the resolver who’s responsible for it. Meanwhile, owners of domains in the ENS registry are allowed to:\n\nChange the ownership of the subdomains\n\nTransfer ownership of their domain to another address\n\nSet the resolver and the time-to-live (TTL) for the domain\n\nResolvers\n\nResolvers, on the other hand, are responsible for translating names into addresses. Every contract that implements the required standards can be a resolver in the Ethereum Name Service. However, resolving a name in ENS is a process that is composed of two steps.\n\nThe first one is to ask the registry what resolver is responsible for the said name. The second one is to ask that particular resolver for the answer to the query. In terms of architecture, it looks like this:\n\nThe Difference Between DNS and ENS\n\nThe Domain Name Service (DNS) was created in 1983 by Paul Mockapetris, a US computer scientist. It followed the research of another American scientist, Elizabeth Feinler.\n\nPut in simple terms, the purpose of DNS is to match internet protocol (IP) addresses with human-friendly domain names. This allows users to type in the website’s name instead of having to input the literal numeric IP address.\n\nIn a similar yet different way, Ethereum Name Service attempts to make it easier for people (and applications) to read and share cryptocurrency addresses.\n\nHow to Register an Ethereum Name Service (ENS) Domain?\n\nRegistering an Ethereum Name Service domain is pretty straightforward. All you need is a hot wallet such as MetaMask.\n\nGo to app.ens.domains (the official website for registering an ENS domain), and type in the domain name that you want to register. This will check its availability.\n\nOnce you have selected your name, all you need to do is follow the instructions given below:\n\nEthereum Name Service Governance\n\nThe Ethereum Name Service is governed by several different arms, each with its own significance.\n\nENS Token + Distribution\n\nThe ENS token is a standard token using the ERC-20 standard on the Ethereum blockchain. Its main purpose is to be used for the governance of the system.\n\nToken holders can submit proposals and cast their votes. The main place where community members can discuss ideas and have governance-related discussions is the forum discuss.ens.domains.\n\nThe ENS token was airdropped to early adopters who had previously registered an ENS domain name. The claiming process started on November 8th, 2021, and users had until May 4th, 2022, to claim their allotted tokens.\n\n25% of the total supply was distributed through the airdrop, while the rest is designated as shown in the following piechart:\n\nENS DAO\n\nIn the spirit of decentralization, the Ethereum Name Service is operated by a decentralized autonomous organization (DAO). The DAO is governed by holders of the ENS token, who can submit proposals and vote on them to determine the protocol’s future development.\n\nENS Foundation\n\nThe ENS DAO itself is represented by an existing Cayman Islands Foundation called the ENS Foundation.\n\nIt has a few purposes, including:\n\nTo comply with tax requirements because without a legal entity, DAO participants may be responsible for a certain proportion of the DAO’s income, even if they don’t have access to these funds.\n\nTo enter into contracts with other companies.\n\nTo provide limited liability for participants in the DAO for the actions of the DAO.\n\nConclusion\n\nENS is a critical advent in the cryptocurrency field and a step towards solving some of the pressing issues that riddle the industry – namely, user experience.\n\nHaving to deal with long strings of random numbers and letters is oftentimes the reason for mistakes, and in the field of crypto, mistakes are quite commonly very expensive. Normalizing addresses and presenting them in a human-readable and friendly way is a step towards improving the overall user experience, the way DNS improved the UX for Internet users.\n\nAt the same time, though, DNS records of domains and names are typically stored on centralized servers, making them prone to hacks. ENS, on the other hand, are secured by Ethereum’s blockchain, making them multifold and more secure.\n\nThat said, the Ethereum Name Service is undoubtedly an important invention and innovation that’s quickly become widespread and used by thousands of people."
    }
]