[
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPOXJsUjhvYU1iMHhCWmRoOXQxZy1DU3FsdkdDVWJubE1CVmgtZVgyZzJUVVlabTJGWnphRElCOF9sWkU1bG5lVkhCUkUwLTBTRzQtRmxNQW9lX1pNUWphanowUUotSmwtdm9QTm13VmYzVUdObEtfRHFfbk9GTl9pRHhrWHc2R0NXNmk1dG4zTng?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Ethereum Witnesses a Significant Drop in Daily ETH Burning - Yahoo Finance",
        "content": "Ethereum Witnesses a Significant Drop in Daily ETH Burning\n\nThe Ethereum network has experienced a notable decline in the daily amount of ETH burned, reaching its lowest level this year. This has resulted in fewer ETH being burned. On Sunday, only 610 ETH was burned, setting a record low for this year as Ethereum's gas fees remained minimal. In contrast, during the first four months of the year, the daily amount of ETH burned stood consistently above 2,500-3,000 ETH.\n\nThe ongoing decline in gas fees can be attributed to several factors. Firstly, there has been a shift in activity towards Layer 2 scaling solutions, which offer improved scalability and lower transaction costs. Additionally, the adoption of blob transactions, introduced with the Dencun upgrade in March, has contributed to reducing transaction costs on Layer 2 solutions.\n\nThe London hard fork, also known as EIP-1559, implemented in August 2021, brought about a fundamental change to Ethereum's fee structure. This upgrade introduced a base fee that is burned and a priority fee that serves as a tip to validators. The relationship between gas fees and ETH burning is closely monitored as an essential aspect of Ethereum's economic model. While lower fees are advantageous for network users, the decrease in ETH burn has implications for the deflationary nature of Ethereum.\n\nIn recent weeks, Ethereum's supply has shifted towards being inflationary, with a growth rate of 0.49%, according to ultrasound.money. However, if activity picks up and more ETH is burned than issued, Ethereum could return to a deflationary state, where the supply decreases over time."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOOFJ0OWIxUFhqN3h6VjBFajc0bG1DUWdIMld6WXA0UmFsREk3Qmh1RHdJUGVYOXhfQkpTaFZpdGFWYlhwOHhvTEJ2ejZMWFJOY2FKbHdMQlplT3Zkb0tkVzZTNlczVDdZckF6SHRTREFTSG9GenFSOUVBWmptcnJEdnZUX3E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Ethereum devs propose new transaction type with EIP-7702 - Crypto Briefing",
        "content": "The proposal outlines a new transaction type that temporarily upgrades externally owned accounts.\n\nShare this article\n\nA group of prominent Ethereum developers, including Vitalik Buterin, has proposed a new transaction type (EIP-7702) to enhance the functionality and security of Externally Owned Accounts (EOAs). The proposal aims to address common issues such as transaction batching, sponsorship, and privilege de-escalation.\n\nAccording to the EIP-7702 draft, the new transaction type “adds a contract_code field and a signature, and converts the signing account (not necessarily the same as the tx.origin) into a smart contract wallet for the duration of that transaction.” The proposal is intended to offer similar functionality to EIP-3074.\n\nThe motivation behind EIP-7702 is to provide short-term functionality improvements to EOAs, increasing the usability of applications and, in some cases, allowing for improved security. The proposal outlines three particular applications: batching, sponsorship, and privilege de-escalation.\n\nWhile EIP-3074 solves these use cases, the authors of EIP-7702 believe it has forward-compatibility concerns. They state that EIP-3074 “introduces two opcodes, AUTH and AUTHCALL, that would have no use in an ‘endgame account abstraction’ world where eventually all users are using smart contract wallets.”\n\nAdditionally, they argue that EIP-3074 “leads to the development of an ‘invoker contract’ ecosystem that would be separate from the ‘smart contract wallet’ ecosystem, leading to possible fragmentation of effort.”\n\nThe specification of EIP-7702 details the transaction payload format and the process of executing the transaction, which involves setting the contract code of the signing account temporarily and reverting it back to empty at the end of the transaction.\n\nThe authors provide a rationale for how EIP-7702 can convert EIP-3074 use cases, stating that “it requires fairly little work to convert an existing EIP-3074 workflow.”\n\nThey also argue that EIP-7702 is designed to be forward-compatible with future account abstraction, avoiding the creation of separate code ecosystems and the need for new opcodes that may become obsolete.\n\nDespite the potential benefits, the authors acknowledge that EIP-7702 breaks the invariant that an account balance can only decrease as a result of transactions originating from that account, which may have consequences for mempool design and other EIPs.\n\nAs with any proposal requiring users to sign contract code, the authors emphasize the importance of user wallets being cautious about which contract_code they sign, highlighting the shared security considerations with EIP-3074."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPck5LUXVFT2Jua3B5VTF1LW1lY252ak5DazVYN21yaWRkWjZabnNBZ1RTNTF4QkhpQUJVWlQ3TldBYlY1OHB0YnNHNW5iQlR0TlE0dXhQRDlRYkdYX1FyWHktR0NuRDg2eHlDSTZjclZJZnhxRlk1cjVJRVBMc1BnbElPNjd6VXFJRHdxbExzb3BFenFIT2xmaG9JTzAzY1RIVGtMX01TMU9XdHFWb2oxdnFLMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "EIP-3074 vs EIP-4337: Ethereum Developers Disagree on Endgame for Account Abstraction - Unchained",
        "content": "Ethereum developers can’t see eye to eye on a proposed code change that could potentially improve user experience with wallets.\n\nSome developers believe EIP-3074 could introduce security risks to the network.\n\nEthereum’s next major hard fork Pectra would introduce a host of new Ethereum Improvement Proposals (EIPs), but one of them is facing pushback from the developer community, including the blockchain’s cofounder Vitalik Buterin himself.\n\nThe proposal, known as EIP-3074, introduces Ethereum Virtual Machine (EVM) opcodes: AUTH and AUTHCALL. The former allows externally owned accounts (EOAs) to authorize actions via a signed message and a commit, and the latter executes transactions on behalf of the authorized EOA.\n\nLearn more about it: What Is the EIP-3074 Proposal on Ethereum?\n\nAuthors of EIP-3074 expect that this change will make EOAs easier to use because of the ability to sign off on batched transactions together and also having third parties sponsor transaction fees, opening the doors for decentralized protocols to potentially cover these costs for their users.\n\nEIP-3074 is coming in the next Ethereum hard fork. This is a big deal. Wallet UX will 10x. Congratulations to Ethereum and the EIP-3074 sponsors. Reth has already implemented and tested it. We are fans. Let's go. https://t.co/lUiK2kb3UT — Georgios Konstantopoulos (@gakonst) April 11, 2024\n\nWhile the proposal is an effort in Account Abstraction (AA), aimed at making wallets more flexible, it has faced pushback from authors of EIP-4337, which was deployed to the Ethereum mainnet in March 2023.\n\nEIP-4337 is also an AA proposal, which supports introducing features to EOAs such as paying gas fees in tokens besides ether and account recovery mechanisms. However, that proposal sets out to achieve the goals AA using an offchain transaction relayer, without requiring any changes to the consensus layer.\n\n“This is of course NOT simply a matter of ‘my AA proposal good, your AA proposal bad,'” said ZeroDev CEO in a blog explaining that developers behind the two proposals had fundamentally different visions for the Ethereum roadmap.\n\nThe core disagreements include whether EIP-4337 is the endgame for AA and if it is more urgent to solve censorship resistance or user experience issues. Those in the EIP-4337 camp believe that Ethereum should prioritize censorship resistance even if it means delaying UX improvements, while those in the EIP-3074 camp think that the network is already censorship-resistant enough.\n\nThe big really valuable and necessary thing that ERC-4337 provides for account abstraction is a *decentralized fee market* for user operations going into smart contract wallets.https://t.co/JUigSO5OtW — vitalik.eth (@VitalikButerin) October 1, 2022\n\nWhile the proposal would bring about more immediate user experience improvements, some developers think that including EIP-3074 in the Pectra hard fork would introduce security risks to the network.\n\n“Ethereum’s account model is complex for users and thus introduces security risks,” wrote Ethereum developer Yoav. “We need to improve it, not to weaken it. After 3074 inclusion I expect we’ll see more rugpulls, replay attacks, wallets drained. I hope to be proven wrong here as well.”\n\nThe Ethereum Foundation is hosting a discussion on the proposal on Tuesday, which may determine its future."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMipAJBVV95cUxPMlYtaTlFLXVpN0VmSUZDLWdCczJveEFneThNY2ZXNlFiaHJBdUhSN1hHeE5qSmhIVDJ4S1F1dzk4Sm9vekdzOUlmazc0Qlc0YXZjdlZtZG9qdGVjbkxtMWlFWFZfU1hXVHhRTlQ3VkZ5eWFmU1hac3JxTTZoYXhLSG43UzEyQ0dweUJTTkxJbm1wMjVoOUtsQ0V1dlI4M0d6ZTJDMUJrVkpiMDNnc3BVN2hQYWFwQ28yMlZCVkFlTjBUYlVoeHdFVXlHUDZLLXJKWXdlaE40aEtYWXZUVTVUbHhxUXBITGhBT29pM2J3YnZRbWpSWnRTcmx1U1ptMG1zcXJpNENSYk03TWZjUVVhZ0w2OHBqbEhveW1HTm1ORm4zTWpB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Bitcoin Surges 8.33% to $65,000, Ethereum Holds Strong at - GlobeNewswire",
        "content": "New York, NY, May 07, 2024 (GLOBE NEWSWIRE) -- In the dynamic and ever-evolving world of cryptocurrencies, recent movements within the market showcase the resilience and potential of major digital assets. Bitcoin (BTC) recently experienced a surge from $60,000 to $65,000, predicted by the Bitcoin Fundamental Index (BFI). Ethereum (ETH), maintaining stability above the $3,000 mark, shows strong holding signals from investors, while Furrever Token (FURR) demonstrates the merging of cuteness with crypto, reaching a significant presale milestone.\n\nBitcoin's (BTC) Recent Surge Predicted by Fundamental Index, What's Next?\n\nThe recent surge in Bitcoin's price, moving from approximately $60,000 on May 1st to $65,000 by May 6th, was successfully forecasted by the Bitcoin Fundamental Index (BFI) developed by Swissblock. This innovative analytical tool correlated fundamental metrics of the Bitcoin network to its price movements, signaling a potential reversal just before the rally began.\n\nOn-chain data from the period leading up to the price increase showed a significant rise in transactions exceeding $100,000, alongside balanced inflows and outflows on cryptocurrency exchanges. Specifically, exchanges saw total inflows of around $8.3 billion and outflows slightly less at $7.23 billion. This pattern reflected a healthy market sentiment, with substantial buying pressure counterbalancing profit-taking by some investors.\n\nInterestingly, the BFI highlighted that the concentration of Bitcoin by large holders was relatively low at 11%, suggesting that the recent price movement was not predominantly driven by whale activities. This is significant as movements driven by large stakeholders can often introduce increased volatility into the market. Moreover, the price correlation of Bitcoin remained stable, with a perfect correlation score of 1, indicating predictable movements aligned with key market indicators.\n\nAs Bitcoin navigates through various economic and market conditions, tools like the Bitcoin Fundamental Index offer valuable insights for predicting potential price movements. With the recent rally now aligning with fundamental and on-chain analyses, the cryptocurrency community continues to watch closely, using these indicators to gauge future market directions effectively. As always, investors are encouraged to consider such comprehensive data when making investment decisions in the volatile crypto market.\n\n\n\n\n\nEthereum (ETH) Shows Strong Hold as Prices Soar Above $3,000\n\nEthereum (ETH), a major player in the cryptocurrency market, is currently showcasing signs of strong investor confidence as its price stabilizes above the crucial $3,000 mark. With the current trading price at $3,177, Ethereum is approaching the 23.6% Fibonacci Retracement level, which is recognized as a vital support zone.\n\nEthereum investors are increasingly choosing to hold onto their assets rather than sell, contributing to a bullish market sentiment. This behavior is evidenced by a significant reduction in active deposits, which have decreased by 27% over the past week. Active deposits are essentially the unique addresses that transfer Ethereum from personal wallets to exchanges, and this decrease marks an eight-month low in potential selling activity.\n\nHowever, if Ethereum fails to hold the $3,000 support, it might face a correction towards $2,539, challenging the current bullish outlook and potentially extending losses for investors.\n\nAs Ethereum continues to navigate through these pivotal price points, the market's response to these holder behaviors and technical levels will play a crucial role in determining the short-term trajectory of this leading cryptocurrency. Investors and market watchers are advised to monitor these developments closely, as they could significantly impact Ethereum’s pricing and market positioning in the coming weeks.\n\n\n\n\n\nExploring the Charming World of Furrever Token (FURR): A Blend of Cuteness and Crypto Innovation\n\nFurrever Token (FURR) offers a unique twist in the cryptocurrency landscape by integrating the charming allure of cats into its platform. At the heart of Furrever Token's strategy is its commitment to enhancing user interaction with delightful cat imagery. By incorporating cat-themed stickers, emojis, and visuals, FURR transforms everyday transactions into enjoyable and heartwarming interactions. The project's focus extends beyond mere aesthetics; it actively fosters community engagement through various challenges and initiatives that encourage users to express their affinity for cats and cuteness.\n\nHaving raised over $1 million in just two months and currently in stage 8 of a 10-stage presale, Furrever Token is priced at $0.000648. The token offers potential returns up to 15X, appealing to investors looking for both fun and financial growth. Ensuring security and transparency, Furrever Token has undergone a smart contract audit by Securi Lab and maintains active engagement with its community on platforms like Telegram.\n\nAdding an element of excitement, Furrever Token has launched the $10,000 Frenzy Bonanza Competition, captivating participants globally. Hosted on the Gleam platform, this contest offers a total prize pool of $10,000 in FURR tokens. Participants increase their chances of winning by completing various tasks, with the more tasks completed, the higher the probability of securing a top spot.\n\nScheduled to run from May 2, 2024, at 12:00 pm (UTC +1) to May 9, 2024, at 12:00 pm (UTC +1), the week-long event allows ample time for participants to partake and gather points. At the end of the competition, three winners will be chosen randomly to receive $5,000, $3,000, and $2,000 in $FURR tokens, respectively, potentially boosting their cryptocurrency holdings significantly.\n\nFurrever Token is proving to be a standout in the cryptocurrency world by merging the appeal of playful themes with serious financial potential, promising to be an enticing venture for both cat enthusiasts and crypto investors alike.\n\nFor further information or any assistance regarding Furrever Token, reach out only through the official channel at support@furrevertoken.com to avoid potential scams.\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Furrever Token $10,000 Bonanza Competition\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9sdUsyVHJKck81X2l3UjBHeTJ6TnZmTmlUcUZYZGhJc29oakp2VFZISEV5TzlOcFJjZnFBWWN5M3lOdk5ENG5KdWpDQWtXOE5GOXdpVDNmc1dKempJVnJLYndacm9wcVdIQVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "What Is the EIP-3074 Proposal on Ethereum? - Unchained",
        "content": "EIP-3074 is an Ethereum Improvement Proposal (EIP) that aims to improve account management for Ethereum users.\n\nEIP-3074 has been approved for inclusion in the Prague/Electra Ethereum hard fork, scheduled for Q4 2024. The proposal aims to streamline transaction processes and decrease expenses by introducing third-party transaction sponsorship. EIP-3074 represents an advancement in Ethereum’s account model, paving the way for future developments.\n\nSo, what exactly is EIP-3074, what implications does it hold for Ethereum, and how is it different from EIP-4337?\n\nWhat Is EIP-3074?\n\nEIP-3074 is an Ethereum Improvement Proposal (EIP) that revolutionizes account management within the Ethereum network. It allows externally owned accounts (EOAs) to delegate control to smart contracts, enabling more advanced transaction strategies.\n\nEIP-3074 was introduced in 2020 by Ethereum core developers and researchers Sam Wilson, Ansgar Dietrichs, light clients, and Micah Zoltu.\n\nIt introduces two new operations, “AUTH” and “AUTHCALL,” to empower EOAs to transition seamlessly into smart contracts without requiring the deployment of new contracts.\n\nThe primary goal of implementing EIP-3074 is to enhance the wallet user experience by enabling gas sponsorship, facilitating batch transactions, and enabling wallet asset recovery processes.\n\nSee the illustration below to understand the flow of transactions.\n\nHow Does EIP-3074 Aim to Improve Ethereum?\n\nEIP-3074 proposes delegating control of EOAs to smart contracts which offers developers a flexible framework for innovative EOA transaction strategies. This transformation is facilitated by two instructions: “AUTH” and “AUTHCALL.”\n\nThe AUTH establishes the “authorized” context variable based on ECDSA signatures. On the other hand, AUTHCALL initiates authorized account transfers, allowing for additional logic to be implemented around “AUTHCALL” without compromising security or user experience.\n\nThe AUTHCALL opcode functions similarly to the existing CALL opcode within Ethereum. It establishes the authorized address as the message sender in the subsequent call, effectively permitting the invoker contract to act on behalf of an EOA when interacting with other contracts.\n\nIn practice, the process involves the EOA address user signing the transaction off-chain, then either the EOA user or a gas sponsor sending the transaction to the invoker contract, which verifies and calls each target contract using “AUTH” and “AUTHCALL.”\n\nThat way, EIP-3074 enables any EOA to function as a smart contract wallet without contract deployment, facilitating more complex transaction schemes. This introduces various exciting use cases to Ethereum, such as gas sponsorship, batch transactions, and wallet asset recovery.\n\nGas sponsorship allows dapps, projects, and third parties to cover gas costs for users, removing the need for users to hold ETH themselves, which is particularly user-friendly for new Web3 users.\n\nIn addition, EIP-3074 supports executing multiple operations in a single transaction, streamlining non-ETH token trading by eliminating the token approval process. Hence, this enhances transaction efficiency and reduces costs.\n\nFor wallet asset recovery, EIP-3074 allows users to recover assets via a special invoker contract when they lose their private keys through a social recovery mechanism.\n\nEIP-3074 vs. EIP-4337: What’s the Difference?\n\nEIP-3074 and EIP-4337 tackle unique aspects of account abstraction on Ethereum. They are similar in that they both address execution abstraction, enabling functionalities such as batching multiple calls to multiple destinations, ensuring atomicity, and enhancing dapp-specific user experiences.\n\nHowever, they are quite different in how they work.\n\nEIP-3074, primarily focused on enhancing the capabilities of EOAs, introduces a novel approach by supercharging EOAs with arbitrary execution logic through invokers. It extends the functionalities of EOAs without necessitating asset migration to new accounts.\n\nHowever, EIP-3074 only addresses execution abstraction and doesn’t deal with decentralized access. It prioritizes simplicity and aims to streamline transaction processes for existing EOAs.\n\nEIP-4337 takes a broader approach, aiming to abstract the entire account, involving all five functionalities. It looks to preserve Ethereum’s core properties of decentralization and censorship resistance while mitigating potential vulnerabilities, such as DoS and griefing attack vectors.\n\nUnlike EIP-3074, EIP-4337 necessitates migration to a smart account as it cannot extend the capabilities of EOAs. It aspires to achieve full account abstraction without compromising the fundamental tenets of the Ethereum network.\n\nReasons For and Against EIP-3074\n\nLet’s take a look at the benefits that will come with the new EIP-3074 token standard proposals.\n\nReasons For EIP-3074\n\nNew Opcodes: EIP-3074 introduces new Ethereum opcodes, enabling EOA users to authorize smart contracts to execute actions on their behalf within a single transaction. This improves security and control, as users don’t need to permanently transfer their private keys.\n\nUser-Friendly Utilities: The new opcodes enable various user-friendly utilities, including transaction batching, sponsored transactions, conditional transactions, meta-transactions, and delegated security. These utilities streamline transaction processes, improve efficiency, and expand possibilities for decentralized applications (dapps) and users.\n\nEasier Migration: EIP-3074 allows easier migration to smart accounts by empowering EOAs. Previously, the effort and gas cost of migrating existing assets posed a challenge for users switching to smart accounts. With EIP-3074, migration is smoother and in a single batched and gas-sponsored transaction.\n\nUnified User Experience (UX) and Developer Experience (DevEx): dApps can enhance user experiences without excluding EOAs, thereby increasing incentives to leverage sponsored transactions and transaction batching. This introduces standardization around these features and allows for the integration of smart account functionalities into development frameworks.\n\nHybrid Accounts: EOAs can designate smart accounts as invokers, enabling hybrid custody use cases and facilitating testing of smart accounts before asset migration. This flexibility gives users more control over their assets and opens up new possibilities for custody solutions.\n\nReasons Against EIP-3074\n\nWhile EIP-3074 provides many advantages, it also has some potential downsides.\n\nSecurity Concerns: The security of invokers is a significant concern associated with EIP-3074. Poorly implemented invokers could pose a threat to user funds. To address this risk, rigorous audits of invokers and safeguards in EOA wallets need to be implemented.\n\nRequirement for Hard Fork: The adoption of EIP-3074 necessitates a hard fork due to new opcodes. This requires agreement and integration, which can be a lengthy process and has brought some resistance to the EIP-3074 proposal.\n\nThe Bottom Line\n\nThe decision to implement EIP-3074 came from the community’s recognition that the journey of achieving full account abstraction (AA) through proposals like EIP-4337 and RIP-7560 may require more time than initially anticipated.\n\nAt this time, focusing on enhancing EOAs offers immediate benefits. By fixing EOAs, EIP-3074 enables greater on-chain flexibility and execution abstraction within the existing Ethereum ecosystem.\n\nThe seamless integration of EIP-3074 into the Ethereum ecosystem and its reception by wallets and decentralized applications (dApps) will be crucial to its success. Moreover, ongoing efforts to address security concerns and ensure safe, user-friendly operations will be important for the widespread adoption and sustained effectiveness of EIP-3074."
    }
]