[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNQUk5Vk41RWFBSVJnYzRQUURCdzJUTUtKQ0gta1FibHlzbS1Wc3NzaVljTHNLeE5vYlNQSjJtbWZGYXhBOU4yWDgtYnlUdEZNSkg3TFByelpabGtFNElobFlUbXFBZXVMdkhPWGtRMzc1TXpuNGRBdzFBUXhUVzdMbnBNQUJSN2xO0gGOAUFVX3lxTE5HWmk1YnZPaHlYOFFQdTNyb3JQUXI1RFB0X0Z6ZVdCQ01NczJLbFVOczZnMF8yaDExeDlib2VHenVkVndwOE1kR0dfVFZSeGh1a2JQMmY1ZUVWVjR0Wm1WVlliTkRYTXl1RjNSNy1oU3h2Mm5rQWoxdnR0eVR3cWxiZjlZckNmV1RrSG4xTGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Makes Important Statement About Ethereum Layer 2s - U.Today",
        "content": "A recent conversation with Vitalik Buterin on X platform sheds light on a few important topics regarding L2 networks – the main scalability tool for the Ethereum network.\n\nAdvertisement\n\nAt its core, an L2 solution is a secondary framework or protocol built atop the Ethereum blockchain, designed to increase transaction capacity and speed without compromising the security provided by the main chain, known as layer 1 (L1). This conversation is vital because it helps users understand the types of solutions available and their respective tradeoffs.\n\nYeah I agree with this. I called them \"security-favoring\" vs \"scale-favoring\" here, but we can probably come up with better terms (\"strong L2\" vs \"light L2\" perhaps?)https://t.co/oSPZkB3Xo3 — vitalik.eth (@VitalikButerin) January 16, 2024\n\nButerin participated in a discussion clarifying that \"L2s\" encompass both rollups and validiums. The distinction is important for users to grasp the different security and scalability features. Rollups are \"security-favoring\" solutions that bundle or \"roll up\" transactions into a single proof, which is posted to the main chain.\n\nThis process allows for high security, as the L1 blockchain directly secures them. In contrast, validiums are \"scale-favoring,\" designed to boost capacity by storing data off-chain but with proofs still on-chain, offering slightly less security for much greater scalability.\n\nThe distinction is nuanced but significant. While rollups are more expensive due to the data being posted on-chain, they offer higher security. Validiums, on the other hand, provide a cheaper alternative, with a slight tradeoff in security. Buterin suggests that the terminology should reflect these differences without delegitimizing either option. In the spectrum of L2 solutions, he proposes terms like \"strong L2\" for rollups and \"light L2\" for validiums to help users navigate their choices better.\n\nInterestingly, Buterin also points out that the architecture of L2 solutions is not strictly about security levels. He previously attempted to categorize these layers but recognized that there is a significant \"intermediate space\" between rollups and validiums, further complicating the classification."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOX0NwMGRMeUtHSGhTVGk4WnJ5ek5vSzdJTDR2UG4wVFdndmpVMm1jQzBKVHI2RERnMGwwbk9KWExqRHQ5MXlyekl5UXBIenAwSzFiSWNjODRBck0xR1VoZ3drMkJUZlNLOTZsQlo3MzM0YTRiS2xTVnJ1RHFYZm9felVya1JQZUVGczBFOTVmbnFtUzZpTjNUZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Telegram trading bot Unibot hits record use on Solana after Ethereum success - DLNews",
        "content": "Telegram bots welcome a flood of new users from the memecoin trading community on Solana.\n\nTrading volumes through Unibot are now heavily dominated by Solana.\n\nThe success of Unibot’s migration has caught the attention of competitors in this sector.\n\nDaily users on Unibot, the mega-popular Telegram trading bot, hit an all-time high after its Solana integration this month.\n\nOn January 11, Unibot’s daily users soared to a record. Days later, daily users jumped another 43%, reaching a new all-time high of 3,151 on January 15.\n\nTelegram bots are designed to simplify on-chain trading by letting users buy and sell tokens on decentralised exchanges — or DEXs — through the popular messaging app.\n\nThese features were trendy among meme coin traders on Ethereum last summer, as six of the top 10 trading pairs of all time were meme coins.\n\nUnibot’s Solana launch has helped turn its fortunes around after falling use on Ethereum, where it was initially launched. Solana users now account for 90% of Unibot’s users, and over 79% of the total volume.\n\nSince its Solana launch on January 4, Unibot earned $275,000 in fees to add to the $534,000 it earned in fees on Ethereum.\n\nThis is an over 50% increase in total fees generated that Unibot would not have had without integrating Solana.\n\nTotal volume generated by Unibot daily. (Dune: @Whale_Hunter)\n\nThe episode shows that Solana, which prides itself on low transaction fees and its dApps’ slick interfaces, is winning over the DeFi degens who make up Unibot’s user base.\n\nJoin the community to get our latest stories and updates\n\nA second start with Solana\n\nUnibot’s expansion to Solana comes as trading on the blockchain has boomed throughout December.\n\nDecentralised exchanges on Solana are now the third-most active among traders behind those built on Ethereum and Arbitrum.\n\nLast summer, Ethereum also saw a similar memecoin mania to the one that just occurred on Solana, driven mainly by the advent of Telegram trading bots like Unibot and Maestro.\n\nAt its peak in August, Unibot facilitated over $8 million in daily trading volume through its Telegram trading interface, generating over 11,400 Ether worth $29.5 million in lifetime fees.\n\nBut with a significant portion of memecoin trading activity exiting Ethereum to other chains — most notably Solana — in recent months, Unibot’s revenue has also dropped.\n\nNow, in what was a bid to boost revenues, trading bots popular among traders are following them to Solana. And it appears to be working.\n\nCompetitors follow suit\n\nOne of Unibot’s main competitors, Banana Gun Bot, has also made the move to Solana.\n\nBanana Gun Bot saw similar success following its launch on Solana. The total fees generated on January 16 were the most since December 6, and the fourth highest all time.\n\nIn just three days, it has generated over 270 SOL in fees, worth approximately $27,000 at current prices.\n\nDaily active users also saw a bump, on January 16th 1,727 new users and 4,543 total users interacted with the bot. This is just below the previous all time high of 4,730 total users set on November 29.\n\nUNIBOT token\n\nThe price of Unibot’s eponymous token has gone up by 85% over the past month, trading around $94.\n\nRevenues generated by Unibot are shared with token holders who hold at least 10 UNIBOT. Holders have received over 4,496 ETH in total rewards, valued at over $11.3 million at current prices.\n\nUnibot's token price\n\nToken holders can earn even more rewards by distributing their unique referral code to other users. Referrers earn 25% of the total fees generated by anyone who uses their referral code.\n\nHolders can expect to receive a 9.43% APR for staking."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNZWpBTjFYbnBnTERkOGtWRFJ0cGMtb29zbk90WVJ6NXJ3ckp5eXA1dzBfVG1uWWE2ZFRVVHM1SHBfaHJJWEVCUnNhdEtrS1BtRkJFWlIweHd4Z3g5eVhYN1Fzek1idHRCbVdZUmxsY2tEdWV1ZHdMTUJMQjk0dEMzb0ZNemxCdVlMZzFmMtIBlAFBVV95cUxNdTdhajlYRWljTUFZMzc0d1lhcE01RFlfWkg1Y0J1YkoxNzFYVzVQMGdPME5vbDFGS0FuYVRUZlVRcHhsOU83N0NXejdTUzUzRU55RU1nTzZ4UFU3STN3YVp3R0pvT0Q4R1g3ZWl1UUg1MlVodUEydXVHN0VHek54Znc0dWhoLUY4LTFZQWE2WXhQemM2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Laser-Eyed Franklin Templeton Sets Sights on Ethereum, Solana After Bitcoin - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn a series of tweets on Wednesday, global investment firm Franklin Templeton opined about the merits of layer one blockchain Solana and Ethereum, leading to speculation about the investment giant’s next move.\n\nWe got the reins back. Thanks to our DA research team for the thread today. Please follow our @FTI_DA account for more updates from our Digital Assets team. https://t.co/D7Lgt0A0nU — Franklin Templeton (@FTI_US) January 17, 2024\n\nOne of the largest asset management companies in the world, Franklin Templeton, manages over $1.4 trillion in assets.\n\nAD\n\nAD\n\n“We believe as blockchains improve in fees and performance, the potential use cases that are unlocked grow exponentially,” the Franklin Templeton digital asset team said. “Improving the economics and experience for the end user cannot be overstated.”\n\nLast week, Franklin Templeton joined other major firms, including BlackRock, VanEck, Ark Invest, and Fidelity, in having their spot Bitcoin ETFs approved by the U.S. Securities and Exchange Commission.\n\nFranklin Templeton expressed admiration for the Solana blockchain, calling Solana Labs co-founder Anatoly Yakovenko's vision of it as a single atomic state machine a “powerful use case.”\n\n“On Solana, we see Anatoly’s vision of a single atomic state machine as a powerful use case of decentralized blockchains, lowering information asymmetry,” they said. “And we are impressed by all the activity seen on Solana in Q4 2023.”\n\nProjects driving the activity on the Solana Blockchain Franklin Templeton highlighted include DePIN, meme coins, NFTs, DeFi, and the high-performance validator client Firedancer.\n\nAD\n\nAD\n\nThe account also expressed excitement about Ethereum and its ecosystem, highlighting the growing pains of the largest proof-of-stake blockchain.\n\n“We are excited about ETH and its ecosystem,” the company said. “Despite the midlife crisis it's recently experienced, we see a bright future with many strong tailwinds to push the Ethereum ecosystem forward.”\n\nWe are excited about ETH and its ecosystem. Despite the midlife crisis it's recently experienced, we see a bright future with many strong tailwinds to push the Ethereum ecosystem forward\n\n-EIP 4844\n\n-Alt DA\n\n-Community Revitalization\n\n-Restaking — Franklin Templeton (@FTI_US) January 17, 2024\n\nThe firm highlighted several factors that it believes contribute positively to the Ethereum ecosystem's momentum, including EIP 4844, developments in alternative data availability (Alt DA), community revitalization, and restaking.\n\nThe Franklin Templeton account went on to say the company believes other layer-one blockchains besides Bitcoin, Ethereum, and Solana have potential.\n\n“Other L1s outside of BTC, ETH, SOL have massive potential, and we are continuing to support, monitor, and develop on these networks as they grow and mature,” they said.\n\nOther L1s outside of BTC, ETH, SOL have massive potential, and we are continuing to support, monitor, and develop on these networks as they grow and mature — Franklin Templeton (@FTI_US) January 17, 2024\n\n“The lawyers won't let us respond to comments, but we hear you,” the account concluded.\n\nAD\n\nAD\n\nThe lawyers won't let us respond to comments, but we hear you — Franklin Templeton (@FTI_US) January 17, 2024\n\nWhen asked to comment on the tweets, a Franklin Templeton spokesperson declined to comment further.\n\n“We cannot comment on any potential future fund offerings, but we can say that we are continuously monitoring developments in the digital assets and ETF ecosystems for opportunities to diversify our off,” the spokesperson told Decrypt.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE9Cc1NVeWxRNC1BekhCcHpTVDhwbmFmSVRPekZTSnN5SWtsTGlsa1dtSXVZVmFHSjFYUkVJNHNlN0NMM1lkUUpnRWRpSnVCT2dmbUxRdU01cC1MSzR2NlBjaDd5SWIwZ0JLVENlU3ZB0gFzQVVfeXFMT1VDWENJOWw4V3JDS0VmcDhOT0pWVXFKWHdfVUNwRjRRU0FtTlQ0bGtVNlRkT0l6M3k5THF5UkZUczlXZVc0ZTg0LUozY242QWk0OUVnX1BzS1Q3TXlKU0NZRzZXWTU4TmhJMW1lUnVmTmZYNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum: Dencun Activation Goes Wrong, Mainnet Launch Uncertain - Bitcoinist",
        "content": "Ethereum’s journey towards a more scalable and efficient blockchain encountered a significant roadblock when the highly anticipated Dencun upgrade failed to achieve finalization on the Goerli testnet today. Activated at 6:32 UTC, the upgrade’s inability to reach consensus has injected uncertainty into the timeline for its deployment on the mainnet, prompting a detailed examination of the factors at play.\n\nEthereum Dencun Fails To Finalize – Here’s Why\n\nEthStaker, a prominent voice in the Ethereum staking community, shed light on the complexities underpinning the non-finalization issue. “The low participation on Goerli suggests a mix of potential client issues and a lack of updated validators. While not overly concerning in the short term, this does necessitate a deep dive into whether these issues stem from validators not upgrading their systems or more systemic client-side problems,” EthStaker explained.\n\nAnd it seems like we have a chain split! Client teams are looking into it, but it's likely to a while to pin down + fix the issues. Keep an eye out for updates! — timbeiko.eth ☀️ (@TimBeiko) January 17, 2024\n\nTerence Tsao from Offchain Labs elaborated on the multifactorial aspects contributing to the testnet’s challenges. “With a participation rate hovering around 80%, the key to losing finality often lies in approximately 10% of validators being offline,” he stated.\n\nThis may be due to several factors, including failure to update software components or the presence of bugs. “Given Goerli‘s diverse validator composition, it’s premature to conclusively determine the root cause of the issue at hand,” Tsao remarked.\n\nHe advocated for a comprehensive and time-intensive analysis before making any definitive judgments about the Dencun upgrade’s success or potential delays. Proto Lambda, an Ethereum scaling and R&D expert, pinpointed a specific technical mishap that exacerbated the situation. “The accidental removal of ‘historical roots’ from the beacon state by Prysm led to a network split. This highlights the intricate challenges in managing the beacon state, a pivotal component of Ethereum’s consensus mechanism,” Proto Lambda highlighted.\n\nEthereum Goerli upgraded to Dencun / EIP-4844 🎉 And historicalRoots accidentally dropped from the beacon state by Prysm & a resulting network split 😅 pic.twitter.com/5jHU6pq2vX — proto.eth (@protolambda) January 17, 2024\n\nThe beacon state’s evolution, especially with the implementation of SSZ tree hashing, was meant to streamline state management, including the handling of the HistoricalSummary container. This container plays a crucial role for light clients and in creating Merkle proofs against past states.\n\nEthereum Improvement Proposal 4844 (EIP-4844)\n\nThe Dencun upgrade, deeply intertwined with EIP-4844, represents a cornerstone in Ethereum’s strategy for scaling and enhancing network efficiency. EIP-4844’s introduction of blob-carrying transactions is a groundbreaking step towards reducing gas costs by facilitating temporary data storage in beacon nodes. This move is expected to significantly enhance transaction throughput and lower fees, providing immediate relief and setting a foundation for future scalability solutions.\n\nProto-danksharding, a term coined from the contributions of researchers Protolambda and Dankrad Feist, underpins this process. It represents a simplified yet potent version of danksharding, aiming to radically cut down gas fees and improve transactional efficiency. This development is a crucial part of Ethereum’s scaling roadmap, ensuring compatibility and future readiness with the network’s long-term strategic vision.\n\nImplications And Future Steps\n\nThe Ethereum community and developers are now racing against time to resolve these unforeseen challenges.\n\nTsao stated:\n\nPrysm encountered a bug right at Goerli’s hard fork. The bug has been identified, and a fix is currently being merged. A hot patch image will be released within the next few hours. Sorry for the inconvenience, and thank you for your patience!\n\nThe transition from Goerli to Sepolia, and eventually to the Holesky testnet, signifies a cautious but strategic approach in Ethereum’s upgrade rollout.\n\n“If all goes well with the testnets, my own personal estimate for Dencun on mainnet is mid-late March,” Sassal.eth, founder of The Daily Gwei, noted prior to the Dencun testnet upgrade. Following the faulty start, it is uncertain whether this schedule is still tenable.\n\nAt press time, ETH traded at $2,546.\n\nFeatured image from Shutterstock, chart from TradingView.com"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQdjBHZm9fYVNJbVlUVnMzanNKMG9mNVJsR0w0Zk1QMTJ0d202aU1QVmJsM2RpNVZRQVJRN2M4RG1xX3FVN3VpdTc3N3FWRFl2RWlpcW5ZSkNmbGRPREh2RC1LVWpSOThhSGRpZE0yczNGUWgyejhmYVZZS2Q1SlJMUENISm1INknSAY8BQVVfeXFMUFB6eEJmVVpYQlF5RUgyRlFraUZLQkdkSWdtQnNKM0Y0c1pTcnBWcjNuRU5YWnBtNVV5Z3ZHMER6dmNlOUhFaEZ3bGsyV3cyeGV5U0xodFBkV3hJVDY4cFd3VHQxNE9hWVFNQ3RxTEs5NWt2VlZkMGtlUG5ySl9uMjhFTzBlLXl1TXN0MlViS0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "What Is Immutable? The Ethereum Network for Crypto and NFT Games - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nImmutable X is a layer-2 scaling network built on top of Ethereum, the leading blockchain for decentralized applications. Developed by the Web3 firm Immutable via tech created by StarkWare, Immutable X uses the native ERC-20 token IMX and hosts a number of different blockchain games on its network like Gods Unchained, Guild of Guardians, Illuvium, and Ember Sword, to name a few.\n\nWhile Ethereum proponents argue that its mainnet is among the most decentralized and secure of all cryptocurrencies, it’s also historically suffered from high gas fees and long waits to make transactions. This has long caused friction with NFT creators like those behind the CryptoKitties, who once clogged the mainnet with their digital cats and made it virtually unusable.\n\nBecause NFTs—unique blockchain tokens that signify ownership—are currently so essential to blockchain games, it’s unfeasible for most game developers to build on the Ethereum mainnet. That’s where layer-2 solutions like Immutable X come in, plus Immutable is expanding with another new zkEVM scaling network ahead. Here’s what you need to know about the Immutable platform.\n\nWhat is Immutable X?\n\nAD\n\nAD\n\nImmutable X is a gaming-focused protocol that’s built atop the Ethereum mainnet’s security, but with the speed and lower transaction costs of a layer-2 scaling network. In other words, it provides additional benefits on top of the Ethereum mainnet.\n\nAccording to Immutable X’s whitepaper, the network allows users to make transactions with zero gas fees. This is partly possible due to Immutable X’s use of StarkWare’s ZK rollup technology which bundles transactions and can enable over 9,000 NFT transactions per second.\n\nWho created Immutable X?\n\nImmutable is the main Web3 firm behind the Immutable X protocol. The company is part blockchain developer and part game publisher, as Immutable developed the NFT card-battling game Gods Unchained and is publishing the action role-playing game Guild of Guardians.\n\nPer Crunchbase data, Immutable has raised nearly $280 million in funding from 32 investors as of January 2024, with firms like Tencent, GameStop Digital Ventures, King River Capital, and the now-defunct Alameda Research investing.\n\nHow does Immutable X work?\n\nImmutable X supports all Ethereum wallets, such as MetaMask and Coinbase Wallet. Users can also create an Immutable Passport to transact on the network. Immutable Passport is designed to be a streamlined and more approachable crypto wallet for gamers, plus it provides a unified identity across games.\n\nAD\n\nAD\n\nThe protocol itself sits on top of the Ethereum mainnet, allowing for Immutable X to leverage the mainnet’s decentralization and security for finalizing transactions. But because Immutable X uses ZK rollups, its transactions on its layer-2 network are still able to be fast and cost-effective.\n\nImmutable has built multiple REST application programming interfaces (APIs), meaning they are APIs that adhere to a specific set of architectural standards. Immutable’s REST APIs mean that transactions can consist of an API call, which takes less time than engaging with a protocol directly via a smart contract.\n\nWho's using Immutable X?\n\nA number of different NFT marketplaces and game developers have chosen to offer their products and services on ImmutableX. In June 2022, Immutable Ventures established a massive $500 million fund to invest in Web3 gaming projects being built on Immutable X and to also provide various developers with grant-based funding.\n\nRarible, Mintable, NFTrade, TokenTrove, OKX, and Kinguin are NFT marketplaces that use Immutable X. Brick-and-mortar video game retailer GameStop also launched its NFT marketplace on Immutable X in 2022, but has since discontinued its own crypto wallet and has said that it will shut down its marketplace in February 2024.\n\nGames like IMVU, Guild of Guardians, Habbo, Cross the Ages, Undead Blocks, Ember Sword, Planet Quest, Gods Unchained, WAGMI Defense, and Tiny Colony are building their Web3 elements on Immutable X.\n\nAs the world of Web3 gaming heats up, Immutable X faces competition with other blockchains like Polygon, Avalanche, Arbitrum Nova, Sui, and Solana to offer a fast and seamless gaming experience.\n\nWhat is Immutable zkEVM?\n\nImmutable is developing more than just Immutable X as its Ethereum gaming platform expands. In March 2023, the firm announced that it is working with competitor Polygon to develop a new Immutable zkEVM scaling network that combines Polygon zkEVM technology with Immutable’s gaming platform.\n\nA number of games have already announced that they’ll be using the Immutable zkEVM, from MetalCore to Shardbound and Elemental Knights. According to an Immutable blog post, the zkEVM network provides native compatibility with Ethereum Virtual Machine smart contracts, potentially making it easier for developers to port over from EVM chains and utilize an array of third-party tools.\n\nAD\n\nAD\n\nAs the Immutable platform grows, the IMX token has become the most valuable gaming token as of this writing, with a market cap of nearly $2.7 billion. That makes it the 37th largest overall cryptocurrency by market cap according to data from CoinGecko, as of January 17, 2024.\n\nEdited by Andrew Hayward"
    }
]