[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPYUZMMWs2MmpjdlFpY25XRnJBbUhnZjBrWjBUX1E4bmpMTnl2X3c4RE42Zkt4V2tIaUtxcXVtdkRDdnhjQ2JWMGVodzZiU1REdTBHWXFZQzZuRDQ1NVR2RUExT2had3hxVUp5eTAtckNHRnBLemhtdTVpZ3BwVkRRNE1sOUNxdUtIWFUtd1gzM0kwRVJNYm4xMVgzeXl3SERyYmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Bitwise CCO says Ethereum ETFs ‘close to finish line’, SEC open to other funds - CryptoSlate",
        "content": "Bitwise CCO Katherine Dowling said spot Ethereum ETFs are “close to the finish line” while noting that the SEC is “quite welcoming” about discussions regarding other products.\n\nOn July 9, Dowling told Bloomberg that the SEC and ETF issuers are addressing fewer issues in each S-1 amendment, pointing to a close launch.\n\nDowling affirmed SEC chair Gary Gensler’s assertion that the agency will fully approve issuers’ registration statements over the summer but described an open time frame. She said:\n\n“You know, everyone has a different definition of summer. It’s been a little bit of a long, hot summer for the issuers waiting ….”\n\nDowling said that Bitwise intends to set itself apart from other applicants, including giants such as BlackRock and Fidelity, as a “crypto specialist” with years of focus on the sector.\n\nBitwise filed its most recent amendment on July 3, while many other applicants filed on a July 8 deadline. Applicants must still add certain details, including sponsor’s fees, in future amendments.\n\nSEC welcoming to other discussions\n\nDowling also said that Bitwise has spoken to the SEC about potential new products “coming down the pipe.” She described the conversations positively, stating:\n\n“I think our communication with the SEC about the prospects for these products has actually been quite welcoming.”\n\nHowever, she agreed with Bloomberg ETF analyst Eric Balchunas that some products may only be approved under a new SEC chair.\n\nOtherwise, she said, it could take considerable time to bring the products to market due to the history of previous product approvals and the lack of future markets underlying the potential products.\n\nDowling did not identify the products in question. Currently, the only other pending spot crypto ETFs are VanEck and 21Shares’ spot Solana (SOL) ETFs.\n\nBitwise has not applied for a similar product as of press time.\n\nMentioned in this article"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQR19qalNKX1JUcXNmcE9JaDhEcHV1Qm5fZzVnck1PNGlYTHYyaUEwcmFoVmViOGpWblBxS05NcHZrZTZoMm5VdUM5Ty1abW14WF9hUEZGSENCalI4MFVWV1dLbjdSUkFfVlo4RDc4T1JMSExuZlFhRm8wdEZHakhWMFpmTEI3T2ZlUW1TSEN6YW9ITnVDY1JKekFRQVFsa09hT0cyWHB4VURyLVEybUdDckluQdIBuAFBVV95cUxPWjk4UjAwSG1UZVdMSFBUeGd1NU01dDlQOS1OWTJubjVMcGNYMmkxNWd4VThaMm1HTXJfQU5BYUNfdWFreG5uVkpfLXVaZWJEeEZUdXd3bThBQnY4OFNOQnVPUDVsWGVtNnE1Wm9STV9CUUtwS1BjYWM3c1lkTHlxSF94UEVPOFBDb2xVUl9JZXp0b0JFeXNzRC1LSmVkcTRVM1ZLOVVCem9WZjVuNFVMSEV5ZDRkV2hC?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Top Crypto Analyst Predicts Swift Ethereum Recovery, Says Big Run Coming for ETH - The Daily Hodl",
        "content": "A widely followed crypto strategist believes that the leading altcoin Ethereum (ETH) is close to carving a mid-cycle bottom.\n\nIn a new video update, pseudonymous analyst Bluntz tells his 264,400 followers on the social media platform X that Ethereum is about to conclude its ABC corrective wave.\n\nBluntz practices the Elliott Wave theory, which states that a consolidating asset tends to witness an ABC correction before igniting a fresh five-wave surge.\n\n“Looking at ETH/USD, we’re basically down here at the lows again, but I think it would be very odd if we just moved up from here…\n\nI think ultimately ETH needs to sweep $2,800, take out the low and reclaim it and then finally we would have what looks like a proper ABC down on Ethereum… [I think] we go sideways here on ETH for a little bit and take the lows and then look to bounce.”\n\nAccording to the analyst, Ethereum’s ABC correction will eventually resolve to the upside, sending ETH initially to a new all-time high of $6,000 before pulling back and rallying to a cycle top of $8,000.\n\n“I still firmly believe ETH has not had its big run yet and I do think it will definitely be coming this cycle. It’s just late.\n\nIt’s probably going to be induced by the ETH ETF narrative, which is supposedly coming out any day now. Everyone’s talking about it, everyone’s expecting it to be this giga-bullish ETH news. So I think what will most likely happen in my opinion is ETH will sell off first, take the lows, f**k everyone over and then start to get bid up heavily.”\n\nAt time of writing, Ethereum is worth $3,048.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE5xWWxqdlBFM0x3ZXhVcmlXaVBRRXh3RXhLRkR1OVdleUVIOXRVSXRwQU9SOG8wbnIyWEI2d0FNVzg5Q2ZXTWwyLUJjUlcxYXdKWmRHdzdEWDJpODdRT2F1aml5eDg4R1Qtck5aTE9kNlVUejjSAXhBVV95cUxQRGhZNnUtRnE4eHhGdFpkaWRDZXAxWkIyb3JfWWhhN1ZKelYzNlFRWXl6MTNiTWg3ejRMRW5zdFgxeDlpb0lEVDVMZ3FjQkVIZDVDX0syWWdnX1pvTlZZc1VMaTV6dWlVSXMzMUQwRnBja05QbHBtaXI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 11:37:14 GMT",
        "title": "Ethereum (ETH) Sets Major Staking Milestone: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to on-chain analytics firm Santiment, Ethereum (ETH), the second largest cryptocurrency by market capitalization, has just set a major milestone - this time in staking.\n\nAdvertisement\n\nStaking refers to the act of depositing 32 ETH to activate validator software. However, there is some flexibility, as any user with any amount of ETH can help secure the network, while earning rewards based on how much they want to stake. While 32 ETH might be required to activate being a validator, it is possible to stake less.\n\nValidators are responsible for storing data, processing transactions and adding new blocks to the Ethereum blockchain. This helps to secure Ethereum, while also allowing users to earn ETH rewards.\n\nAccording to Santiment, the ETH2 Beacon Deposit Contract, used for staking deposits for Ethereum 2.0, now holds an all-time high of 47.36 million ETH. Santiment regards this as positivity, with this figure accounting for 33.9% of the entire ETH supply.\n\n🤯 The ETH2 Beacon Deposit Contract, used for staking deposits for Ethereum 2.0, now holds an all-time high 47.36M ETH, This is good for 33.9% of the entire supply, and more than tripling since the 10.9% it held two years ago. pic.twitter.com/aCnEhfClfb — Santiment (@santimentfeed) July 10, 2024\n\nSantiment noted a trend of growth in ETH staked, pointing out that this has more than tripled from the 10.9% the ETH2 Beacon deposit contract held two years ago.\n\nThis milestone remains significant as the network gets stronger against attacks, as more ETH is staked because it requires more ETH to control a majority of the network.\n\nIn another significant milestone, Blackrock's BUIDL fund operating on the Ethereum network continues to attract new investors. The fund requires a minimum entry of $5 million, and its total assets have nearly reached $500 million.\n\nEthereum price action\n\nAt the time of writing, ETH was trading down 0.29% in the last 24 hours at $3,079. In the short term, the $2,850 level is being eyed as a solid support for ETH's price action.\n\nThe $2,850 support cracks, the selling may increase and Ethereum may begin a downward trend to $2,200. The bulls are likely to strongly defend this level.\n\nAlternatively, if the ETH price bounces off its current level and goes above $3,110, it might signal the beginning of a relief rally above $3,200."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBlZGw1eDhyY2pYMzRQQUFYU3NJakFmY01ucGJDV1doOEZEUk1vUGp1MFM5OTlrc2JqVkw5eUZIVzNCdm1lejAycS0wVFJ4REI1YXVjM2hiYl8yMXI4UmdjS0hMWU9LU2JYSTBjYUNOS1p5eUcxSHROeS1yRGNiY2vSAYQBQVVfeXFMTnZwOHc3VlN4bWJQRUp6SlZaUmpyWXJwMS1ONjh0akpFd3dWNWdQLW01MHVfdmNBdV9tTGhNV3RaVjFYR0dqSjFaeUt5ZVltMkxkUEx1VHdZWFl4Z1B4LWxYQUdMS0JhRWtITGE2alBVYjQ5REtHZmdveTlLQjJhUEkyQWdj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Investors Are Ready To Sell ETH As It Hits $3.2K - CoinGape",
        "content": "Ethereum, the second-largest cryptocurrency by market cap, has once again sparked speculations among crypto market participants. Meanwhile, all eyes are on the crypto amid soaring anticipation over a potential Ether ETF launch soon.\n\nHowever, ETH has recently reclaimed the $3K level, but on-chain data indicates that it faces significant resistance at $3,200. So, let’s take a closer look at why the $3.2K level poses a significant threat to Ethereum’s price.\n\nadvertisement\n\nEthereum Holders Ready To Sell ETH\n\nA recent Into The Block data revealed that approximately 2 million addresses that previously traded Ethereum at around the $3,200 price level are currently holding ETH at a loss. This paves the path for potential selloffs as these addresses break even with price gains ahead, adding selling pressure to the asset.\n\nHowever, a bullish catalyst in the pipeline might prevent this from happening. For context, the approaching launch of an ETH ETF (exchange-traded-product) could serve as a catalyst for a remarkable rising price action in the future. Aligning with this, the commencement of ETF trading could counteract the selling pressure, in turn generating positive momentum in the asset due to money inflow.\n\nHowever, it’s worth noting that Ethereum has continued to struggle to reach its resistance level of $3,200.\n\nAlso Read: Institutional FOMO On Spot Bitcoin ETF As German Govt Continues BTC Sell-off\n\nETH Price Faces Turbulency\n\nAt press time, the ETH price showed a 0.20% dip in value, trading at $3,100.56. The token’s 24-hour bottoms and peaks were $3,025.51 and $3,129.02, respectively.\n\nCoinglass data further validated ETH’s turbulent movement, spotlighting an uncertain investor sentiment in the market. ETH Futures OI jumped 0.51% to $12.67 billion, while its derivatives volume dipped 30.71% to $21.15 billion. Notably, the RSI was recorded to be hovering at 40, underscoring that the asset is neither overbought nor oversold.\n\nHowever, it’s crucial to note that the current market sentiments could take a paradigm shift ahead with the approval of spot Ethereum ETFs. CoinGape Media recently reported that a whale bagged a staggering 16K ETH in light of the looming ETF.\n\nAltogether, broader market sentiments remain optimistic about Ethereum’s future price movements, although traders and investors currently exercise caution due to the highly volatile nature of the crypto realm.\n\nAlso Read: Solana ETF Approval Stands Strong: VanEck Exec\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE11cXJRMjd0ZUstM0JZVmFTRDFoeHhpVGE4RWJnWFBaTUQ2Rlh6aGxnQW1LQU12OXh6STBsQWtxeUVCS3U4NWY4VUg5cGFzVGJMU29vZGdfRDdTLWtiZGFFR0VvdFVGUGRNX0cwbU52NDRhZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Set For Significant Surge, Eyes 0.125 BTC Target - TronWeekly",
        "content": "Jelle­­, a noted cryptocurrency trader, has pre­­sented a detaile­­d analysis of the ETH/BTC trading pair over the past thre­­e years. He highlights a classic Wyckoff re­­-accumulation pattern, indicating that Ethereum (ETH) is on the­­ brink of a significant upward movement.\n\nHe be­­gins with the Preliminary Support (PSY) phase around 0.030 BTC, whe­­re substantial buying interest e­­merged, establishing initial support. This phase­­ was followed by the Automatic Rally (AR), driven by inte­­nse buying pressure, pushing ETH’s price­­ to approximately 0.045 BTC. The rally culminate­d in a Buying Climax (BC) at around 0.085 BTC, marking a peak before a re­actionary decline.\n\nEthereum (ETH) Set for Significant Surge, Eyes 0.125 BTC Target 4\n\nIn the Se­condary Test (ST) phase, the price­ dropped to approximately 0.065 BTC, confirming the support leve­l following an initial peak. Afterward, the Uppe­r Trading range (UT phase B) indicated a consolidation pe­riod, during which prices fluctuated betwe­en 0.065 BTC and 0.080 BTC. This consolidation period showed that se­lling pressure was being absorbe­d and hinted at a potential breakout.\n\nDuring the­ Creek phase, the­ price followed a desce­nding trendline, marking the final stage­s of accumulation before a breakout. The­ Spring phase, which occurred around 0.048 BTC, involved a brie­f shakeout to test support leve­ls, resulting in a temporary decline­ before a rebound. The­ recent price move­ments indicate a rebound, se­tting the stage for a notable upward tre­nd.\n\nEthereum Price Forecast\n\nJelle­ identifies the curre­nt phase as the Test phase­, confirming support around 0.053 BTC. This phase is crucial as it validate­s the­ spring and pre­­pares for the­ ne­xt rally phase­­, potentially targe­ting re­sistance­­ leve­ls. The­ anticipate­­d commenceme­nt of spot ETFs trading in the­­ coming weeks is e­xpe­­cted to bring substantial institutional investme­nt, providing the­­ necessary mome­ntum for Ethereum’s surge.\n\nETH is curre­­ntly trading at $3,069, marking a 3.55% increase in the last 24 hours. Howe­­ver, trading volume has decre­­ased by over 12%. Daily indicators reve­­al a significant downtrend, with the 50-day and 100-day Exponential Moving Ave­­rages (EMAs) positioned well above­­ the current price le­­vel. The 50 EMA stands at approximately $3,372.33, and the­­ 100 EMA is around $3,329.70, indicating a bearish market sentime­­nt.\n\nEthereum (ETH) Set for Significant Surge, Eyes 0.125 BTC Target 5\n\nThe Relative Stre­­ngth Index (RSI) indicator, currently at 38.09, signals bearish mome­­ntum. Despite being be­­low the neutral 50 leve­­l, the RSI shows a slight upward movement, hinting at pote­­ntial bullish divergence. Although in the­­ oversold territory, this suggests the­­ recent price downtre­­nd might be nearing exhaustion.\n\nWhile­ ETH face­s downward pre­ssure, a shift towards positive­ price­ action is possible­ if bullish momentum stre­ngthe­ns. Je­lle’s fore­cast pre­dicts a short-te­rm rise to 0.090 BTC, with a longe­r-te­rm targe­t of 0.125 BTC. Ethereum’s future­ looks promising as the­ market anticipate­s the­ impact of institutional inve­stments and spot ETFs.\n\nRelated Readings | Ethereum’s Strength Surpasses Bitcoin: Analyst Predicts Bullish Trend"
    }
]