[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPM3E5VG1TR0Itc2ZpbV96aEYxNU1GM29zd1Y3Y3RhQndrcFJFbjhxaXRqREZYVFFscTI2ZzlCbE1aUDM2LXRSSzBKOWJrSGxFM2dXdUloeVlINFMzemZiUk1RVFFNT3hrV3kzU2RLSFpvMV9qcG1aLTRIWGkyd0JQRlp6M1pHdDR3dDBz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "SEC Sues Ethereum Developer Consensys Over Alleged Unregistered Broker Activities - Yahoo Finance",
        "content": "SEC Sues Ethereum Developer Consensys Over Alleged Unregistered Broker Activities\n\nThe United States Securities and Exchange Commission (SEC) has filed a lawsuit against Ethereum software firm Consensys. The SEC's filing claims that since January 2023, Consensys has engaged in the unregistered offer and sale of securities via its crypto asset staking programs and acted as an unregistered broker through its MetaMask Staking service, allegedly collecting over $250 million in fees.\n\nIn April, Consensys preemptively sued the SEC after receiving notice of the agency's intention to sue over MetaMask’s staking programs. The firm claimed that the SEC had secretly considered Ethereum to be a security for over a year and was quietly assembling a broader case against the crypto asset. Earlier this month, Consensys announced that it had been informed by the SEC that the regulator was closing its case against Ethereum, a development that was celebrated within the crypto industry.\n\nIn the SEC's lawsuit, the agency highlights Consensys's facilitation of ETH staking via third-party services like Lido and Rocket Pool through MetaMask. The SEC argues that these staking programs are offered and sold as investment contracts, and therefore, should be classified as securities.\n\nThis lawsuit emerges during a turbulent period for the SEC and crypto regulation. Earlier on Friday, the U.S. Supreme Court's conservative majority struck down the \"Chevron doctrine,\" a critical piece of American law that had allowed federal agencies, including the SEC, considerable latitude to interpret their regulatory powers. Consensys appeared to reference this Supreme Court decision, forcefully asserting that the SEC lacks the authority to regulate crypto products like MetaMask."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPM3E5VG1TR0Itc2ZpbV96aEYxNU1GM29zd1Y3Y3RhQndrcFJFbjhxaXRqREZYVFFscTI2ZzlCbE1aUDM2LXRSSzBKOWJrSGxFM2dXdUloeVlINFMzemZiUk1RVFFNT3hrV3kzU2RLSFpvMV9qcG1aLTRIWGkyd0JQRlp6M1pHdDR3dDBz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "SEC Sues Ethereum Developer Consensys Over Alleged Unregistered Broker Activities - Yahoo Finance",
        "content": "SEC Sues Ethereum Developer Consensys Over Alleged Unregistered Broker Activities\n\nThe United States Securities and Exchange Commission (SEC) has filed a lawsuit against Ethereum software firm Consensys. The SEC's filing claims that since January 2023, Consensys has engaged in the unregistered offer and sale of securities via its crypto asset staking programs and acted as an unregistered broker through its MetaMask Staking service, allegedly collecting over $250 million in fees.\n\nIn April, Consensys preemptively sued the SEC after receiving notice of the agency's intention to sue over MetaMask’s staking programs. The firm claimed that the SEC had secretly considered Ethereum to be a security for over a year and was quietly assembling a broader case against the crypto asset. Earlier this month, Consensys announced that it had been informed by the SEC that the regulator was closing its case against Ethereum, a development that was celebrated within the crypto industry.\n\nIn the SEC's lawsuit, the agency highlights Consensys's facilitation of ETH staking via third-party services like Lido and Rocket Pool through MetaMask. The SEC argues that these staking programs are offered and sold as investment contracts, and therefore, should be classified as securities.\n\nThis lawsuit emerges during a turbulent period for the SEC and crypto regulation. Earlier on Friday, the U.S. Supreme Court's conservative majority struck down the \"Chevron doctrine,\" a critical piece of American law that had allowed federal agencies, including the SEC, considerable latitude to interpret their regulatory powers. Consensys appeared to reference this Supreme Court decision, forcefully asserting that the SEC lacks the authority to regulate crypto products like MetaMask."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPM3E5VG1TR0Itc2ZpbV96aEYxNU1GM29zd1Y3Y3RhQndrcFJFbjhxaXRqREZYVFFscTI2ZzlCbE1aUDM2LXRSSzBKOWJrSGxFM2dXdUloeVlINFMzemZiUk1RVFFNT3hrV3kzU2RLSFpvMV9qcG1aLTRIWGkyd0JQRlp6M1pHdDR3dDBz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "SEC Sues Ethereum Developer Consensys Over Alleged Unregistered Broker Activities - Yahoo Finance",
        "content": "SEC Sues Ethereum Developer Consensys Over Alleged Unregistered Broker Activities\n\nThe United States Securities and Exchange Commission (SEC) has filed a lawsuit against Ethereum software firm Consensys. The SEC's filing claims that since January 2023, Consensys has engaged in the unregistered offer and sale of securities via its crypto asset staking programs and acted as an unregistered broker through its MetaMask Staking service, allegedly collecting over $250 million in fees.\n\nIn April, Consensys preemptively sued the SEC after receiving notice of the agency's intention to sue over MetaMask’s staking programs. The firm claimed that the SEC had secretly considered Ethereum to be a security for over a year and was quietly assembling a broader case against the crypto asset. Earlier this month, Consensys announced that it had been informed by the SEC that the regulator was closing its case against Ethereum, a development that was celebrated within the crypto industry.\n\nIn the SEC's lawsuit, the agency highlights Consensys's facilitation of ETH staking via third-party services like Lido and Rocket Pool through MetaMask. The SEC argues that these staking programs are offered and sold as investment contracts, and therefore, should be classified as securities.\n\nThis lawsuit emerges during a turbulent period for the SEC and crypto regulation. Earlier on Friday, the U.S. Supreme Court's conservative majority struck down the \"Chevron doctrine,\" a critical piece of American law that had allowed federal agencies, including the SEC, considerable latitude to interpret their regulatory powers. Consensys appeared to reference this Supreme Court decision, forcefully asserting that the SEC lacks the authority to regulate crypto products like MetaMask."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPV3BIUVJvYl9McU9TRjBtdlhNem1YTlVJUFc3QWlkUEV1eTR4Szh1RjRPY3VTOHFtMWJOSmRncHhSWFk4VExlak0yNFUtZHpaOU9VTlhpLUN0SW5pQy1qdHN6WlZTR0FTYVdoWHc0UExNSFZ0NDRRbTdob0lJc2g4NmFyc3pVaWJGOFVjRTNVTEZwOWZWMnFUTGMtc1J6YmNQZXRwZExudk1RRXlqUHhDamJFbnY4TExTRXdN0gHAAUFVX3lxTE55UVFRUG0zRGx2R21hN3NqTm5nbXI0YUlSSlBhYzVIbVBrcW96RkRpV013VGJRS3Y4X1NoemFkZ2NiMGQxeU5FY1FudUhRZ2tEZ29SaGx0b25YN0FuelFxaVI1Zm1hT2dGNnFjLWtLeDN6d2lVdzE2MmJRRXMyYjFXX2dqbnJyek1wclJIaE5OYTcxSDl3YTR1ZW0zaG9ZczJoU2dTSDVFR1pvakZxZ2hZUXk1YW5fbFNiMUxNVS1WbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Products See Largest Institutional Outflows Since August 2022: CoinShares - The Daily Hodl",
        "content": "Digital assets manager CoinShares says that institutional crypto products sustained outflows last week for the third week in a row.\n\nIn its latest Digital Asset Fund Flows report, CoinShares says digital asset investment products suffered $30 million in outflows last week.\n\n“Digital asset investment products saw a third consecutive week of outflows totaling US$30m, with last week indicating a significant stemming of the outflows. In contrast to prior weeks, most providers saw minor inflows, although this was offset by incumbent Grayscale seeing US$153m outflows.”\n\nDespite overall outflows, the US, Brazil and Australian regions saw $43 million, $7.6 million and $3 million in inflows, respectively.\n\n“Negative sentiment pervaded Germany, Hong Kong, Canada and Switzerland with outflows of US$29m, US$23m, US$14m and US$13m respectively.”\n\nWhile the leading crypto by market cap Bitcoin (BTC), multi-asset investment vehicles, Solana (SOL) and Litecoin (LTC) brought in $18 million, $10 million, $1.6 million and $1.4 million in inflows, Ethereum (ETH) had one of its worst weeks in years.\n\n“Ethereum saw the largest outflows since August 2022, totaling US$61m, bringing the last two weeks of outflows to US$119m, making it the worst performing asset year-to-date in terms of net flows.”\n\nChainlink (LINK) and XRP also brought in $0.6 million and $0.3 million, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/phive/Sensvector"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQcWRiTzJMNExQZVUyZHBCM2RSQ2VzWkRCOU03MkJiLXdtUkVOVmlqYm1SVk8wTC1meExtUF9lRnNmdHFxTjB2a1JDUDVDSURXTThodml4NkY5UUV5UFY3eVk5dGRuRXQyU1pRWTlQbnNSQzlRY2NLbjRTbHNXWUJrb1hxWlBBdEtnemhkdVBxbUExLWlaTG1lY3dPbWRFb0xYZTFF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin suggests ways to speed up Ethereum transaction confirmations - CryptoSlate",
        "content": "Ethereum co-founder Vitalik Buterin has suggested ways to help the blockchain improve its transaction confirmation times.\n\nButerin, in a June 30 blog post, explained that Ethereum’s Gasper consensus mechanism uses a slot-and-epoch architecture that contains certain complexities, like bug interactions and a 12.8-minute confirmation time, that makes it “more and more uncomfortable” for user experiences.\n\nSo, he highlighted some of the “practical options” Ethereum has to improve its user experience further.\n\nSSF\n\nButerin stated that the single-slot finality (SSF) mechanism is similar to the Tendermint consensus, as it allows the finalization of blocks as soon as they are produced.\n\nHowever, unlike the Tendermint consensus, Ethereum will keep the “inactivity leak” mechanism to allow chains to remain functional even if a third of the validators go offline. Buterin added that the single-slot finality mechanism also has its faults. Notably, all Ethereum stakers must publish two messages every 12 seconds, overloading the chain.\n\nMeanwhile, Buterin furthered that while there are ideas to mitigate this issue, users may still have to wait 5-20 seconds. He wrote:\n\n“There are clever ideas for how to mitigate this, including the very recent Orbit SSF proposal. But even still, while this improves UX significantly by making ‘finality’ come faster, it doesn’t change the fact that users need to wait 5-20 seconds.”\n\nRollup preconfirmations\n\nRollup preconfirmations aim to improve Ethereum’s Layer 2 (L2) solutions. These solutions process transactions with the same security as the Ethereum base layer (L1) but on a larger scale.\n\nRollups confirm transactions much faster than the current 5-20 seconds, targeting latencies of hundreds of milliseconds. This method divides responsibilities — the L1 network remains stable, censorship-resistant, and reliable, while the L2s offer faster transaction times and address user needs directly.\n\nTo achieve faster confirmations, L2s create decentralized sequencing networks. These networks have smaller groups of validators who quickly sign off on blocks, often within milliseconds, and commit them to the blockchain.\n\nHowever, validators must ensure their commitments are consistent and trustworthy. If a validator signs conflicting blocks, they risk losing their deposits.\n\nBased preconfirmations\n\nBased preconfirmations leverage Ethereum proposers’ advanced capabilities, driven by Maximum Extractable Value (MEV) prospects.\n\nThe concept involves establishing a standardized protocol where users can pay an extra fee for immediate assurance that their transaction will be included in the upcoming block. This service, known as preconfirmations-as-a-service, would assure users of swift transaction confirmation.\n\nProposers who fail to fulfill their commitment or breach the agreement face penalties (slashing). Buterin noted that this framework will apply to L1 transactions and extend to L2 solutions. By treating all L2 blocks as L1 transactions, the preconfirmation mechanism ensures accelerated confirmations throughout the Ethereum network.\n\nButerin noted that Ethereum implementing SSF and rollup or based preconfirmations could significantly reduce transaction confirmation times.\n\nHowever, he pointed out that this would return to the initial “epoch-and-slot architecture” the blockchain was trying to ditch. He stated:\n\n“There is a deep philosophical reason why epoch-and-slot architectures seem to be so hard to avoid: it inherently takes less time to come to approximate agreement on something, than to come to maximally-hardened ‘economic finality’ agreement on it.”\n\nHe suggested that the network developers explore other options that are not as tightly interwoven as Gasper.\n\nMentioned in this article"
    }
]