[
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPNG9sbjBOcTJzbkdwYVQtaVJFS1N6Um83LTFyOVRGMWhnbWNiaG95N2ZFUVA3bjBfTVl4SmdIM0JrTk4wNGpoejJ4d1QxR3M4eDdhc2EteXZMOEVCZ2Jpd0oyRXhpVTZTX19tU1lrVzdGSENjMmFnS3lJNUlHQ0VNeUNVd1haYU1KSFV0VnlJMXZuSjJNWDBvVmlVb09qR1FRQVktV3NkclRpUE05NUtlTEZkc2tsU1hF0gG-AUFVX3lxTE56LVpBX2M2SUkwYkRGN0tjbmRBWUprNzZ2RmxDY0FUNFdsRFVXay0tUkYwbmU4RHVMcVFuQkNSdnRmX3dMWWpvMmtDT1AzYW9ydDBMdjVuYnBTc1pOMXFFVFNNc2lhMWFkeDZTaDdsb3QyMXpYRVBYdUFEcmp6WGxfb3FnczhlMF9qeGlWeUJUUC1VNE5OTElJRGg0SDNiNTJra2RabmZLc3pJcXdVaFE0NUowS3I0VXlHRFo3QWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Bitcoin’s downtrend, Solana and Ethereum form double bottom - FXStreet",
        "content": "Market picture\n\nCrypto market capitalisation rose 3.3% in 24 hours to $2.22 trillion. Local capitalisation bottomed near $2.10 trillion, confirming a sequence of declining local lows (2.3 in March, 2.25 in April) and highs (2.76 in mid-March, 2.67 in early April and 2.46 in late April).\n\n\n\nEthereum and Solana are adding from the area of the April lows and forming a double bottom. This is a positive but not too reliable signal, as Bitcoin has been in a downtrend throughout April.\n\n\n\nAfter the halving, it is logical to expect miners to increase sales from inventory, to invest in new capacity or to lock in profits. Also, the hype around spot Bitcoin ETFs is going away, which reinforces selling by speculators.\n\n\n\nAssuming Bitcoin stays within the global growth cycle starting in 2023, we should expect further price declines in the coming weeks. The nearest likely target looks to be the $51-52K area, where growth was paused in February and where the 200-day MA will be pulled up by the end of the month.\n\nNews background\n\nSoSoValue notes that outflows for $563.8 million from spot bitcoin-ETFs on 1st May reached their highest since product approval. Bloomberg noted the formation of IBIT and FBTC price discounts relative to net asset value (NAV).\n\n\n\nBlackRock believes that financial institutions, including pension, endowment, and sovereign wealth funds, will enter the ETF market in the coming months.\n\n\n\nVanEck calculated that the aggregate value of Bitcoin in the wallets of governments and companies is $175bn. That’s about 15% of the total BTC capitalisation.\n\n\n\nBitfinex said that Bitcoin options traders are preparing for a summer lull in the market. Summer is usually a period of low volatility in the crypto market. Cube.Exchange, on the other hand, pointed to the likelihood of increased price fluctuations in the summer against a background of low liquidity.\n\n\n\nToncoin (TON) resumed growth after a correction amid an investment from venture capital firm Pantera Capital with over $5bn in assets under management. ‘We believe TON has the potential to bring crypto to the masses as it is widely used in the Telegram ecosystem’, Pantera noted.\n\n\n\nOn 2nd May, TON developers announced the platform’s integration with the on-chain analytics service Arkham Intelligence. On 1st May, integration with the cross-chain platform Layerswap was implemented, which, according to its representative, will make it possible ‘to send USDC from any network and receive USDT on the TON blockchain’."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNRXJic3hhOHV6TjRpOExmMFZTTHFiNTg4cmdZVmtyV1NSU1UtRHJXbGJBdUpXV0lwWWN6RTZoV1ZtNjg3U2NmekVnUjdTTGxiWG9oZ2RpYUV1UkZSWDROeFBfTzRXcmdwSk9tOEVKUzU3a1JUTEVid0liNXFyM1hCaW42YzZ4TzkxX3NIdnFfOFdFTjF5dVZUSlhhRWpRb2RzeEJTWG1tME43Y3NYREdfZFZvV21sN1dRcDZDcWpGaUUyZ00wV2w2MlRtRFN5VVhRU3lj0gHYAUFVX3lxTE5HaHRQQzNxLU5HMHhlNFMyRGg4NDNyUTBnNHdfc3QxQlpDMjI0WWZwQUkzV3lJN1FyS3pGZkpfWU93X0p3ektqa3RYR2JtM3UwV3cxdzNrY0ZUM3dHMzhKMmwzUDlOb01JcXVnLXlQcElLdHZRenVPZzl0Z3RHcFBMLTRuX1c3anE0bmtjenhOODQ2akttbE5NdkNyZDRlRGNuZXhQU0h5RmxETzFBQkw1bDhKaGhKeUJaa2wwVEVhZUwzanNwdmtFYkdGZkx5V2JMVGxkS1gxbQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Here’s Why One Crypto Analyst Doesn’t Think an Ethereum ETF Will Get Approval Despite ‘Altcoin Bull Market’ - The Daily Hodl",
        "content": "One widely followed crypto analyst is warning Ethereum (ETH) traders that an ETH exchange-traded fund (ETF) approval from the U.S. Securities and Exchanges Commission (SEC) is unlikely to happen soon.\n\nCrypto trader Michaël van de Poppe tells his 715,800 followers on the social media platform X that traders may have to wait a little longer for an ETH ETF.\n\n“The Ethereum ETF is likely not going to be approved in May.\n\nHowever, the markets are undervaluing a potential approval in August, as Ethereum is still getting sold off.\n\nI think the chances of an approval in August is positive, through which I expect Ethereum to outperform.”\n\nAccording to Van de Poppe, the current turbulence of the crypto markets presents an opportunity for crypto investors.\n\n“You wanted to buy Bitcoin at <$60,000.\n\nYou wanted to buy Chainlink at <$15.\n\nYou wanted to buy any altcoin in a correction.\n\nHowever, now, emotions kicked in and sentiment expects another drop, while the opportunity is here.\n\nMaybe you don’t feel you want to, but this is the time.”\n\nAccording to Van de Poppe, he favors trading newer altcoins over the “old” ones.\n\n“Old coins continue to provide bad returns as Polygon (MATIC) is on a cycle low.\n\nIt’s in the area of interest, but you should wonder whether it is going to generate a lot of returns or whether a new coin is going to yield higher upward returns.\n\nTo me: I stick to new coins.”\n\nMATIC is currently down 20% in the last month.\n\nThe analyst concludes by noting the most recent Federal Open Market Committee (FOMC) data is helping fuel today’s Bitcoin (BTC) rally and a wider altcoin bull run.\n\n“Terrible economic data -> DXY (US dollar index) down, additionally the case for quarterly earnings and rate cuts will increase and therefore risk-on assets rally.\n\nBitcoin back to $61,600.\n\nFOMC was the low for the markets and the altcoin bull market has started.”\n\nBTC is worth $61,702 at time of writing, up 4% on the day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/KumaSora/LongQuattro"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPQm93S2pWVnVNTXhKMnZVQVF0bzZaNXFka2NybE5xbURnMGxIWHQ5V19wblRvMFJQb0JiTU9rU0xQdUpubTlPU1h6eW9jNXFOMmdMNVZ0SVBvSGNweVFrMTY4ODJNcWdsV0dPNEdPeW9lZm9WbVZIWEJ2Z1pSWHJTQzlrOWI0dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "SEC will classify ETH as security and reject spot Ethereum ETFs, says Michael Saylor - Crypto Briefing",
        "content": "Bitcoin stands alone in institutional acceptance, with Ethereum and others facing SEC scrutiny.\n\nShare this article\n\nMichael Saylor believes that the US Securities and Exchange Commission (SEC) will label Ethereum as a security this summer and consequently deny all spot Ethereum ETF applications. He also claimed that other major cryptos like Binance Coin (BNB), Solana (SOL), Ripple (XRP), and Cardano (ADA) will likely face similar security classifications from the SEC.\n\n“Ethereum is deemed to be a crypto asset security, not a commodity. After that, you’re gonna see that Ethereum, BNB, Solana, Ripple, Cardano, everything down the stack is just crypto-asset securities unregistered,” said Saylor during today’s presentation at the MicroStrategy World 2024 conference.\n\n“None of them will ever be wrapped by a spot ETF. None of them will be accepted by Wall Street. None of them will be accepted by mainstream institutional investors as crypto assets,” he added.\n\nIn contrast, Saylor highlighted Bitcoin’s unique position as the only crypto asset with full institutional acceptance, describing it as the “one universal” institutional-grade crypto asset without any contenders.\n\nMicroStrategy’s founder is known as a vocal Bitcoin proponent; he exclusively focuses on Bitcoin investment and building Bitcoin infrastructure.\n\nSaylor’s comments come a day after MicroStrategy unveiled MicroStrategy Orange, a Bitcoin-based decentralized identity solution. Earlier this week, the company also announced last month’s acquisition of 122 BTC.\n\nMounting skepticism\n\nSaylor is not the only person who is skeptical about the near-term approval of spot Ethereum ETFs. Justin Sun, the founder of TRON Foundation, previously voiced concerns about Ethereum ETF’s regulatory hurdles. He believes the SEC will not approve spot Ethereum ETFs this month.\n\nThe SEC is set to make decisions on filings by VanEck and ARK on May 23 and May 24, respectively. Recent discussions surrounding the SEC’s approval process for spot Bitcoin funds have been notably shallow compared to prior discussions preceding the SEC’s approval of spot Bitcoin funds, with SEC staff reportedly not engaging in detailed conversations about the proposed Ethereum ETFs.\n\nThis lack of interaction heightens frustration and raises the chances of either a rejection or a postponement of decisions.\n\nA definitive classification for Ethereum could clarify how companies interact with the asset. It could also influence the SEC’s approval of products like spot ETFs and the willingness of companies to engage with Ethereum.\n\nHowever, not everyone shares this doubt. BlackRock CEO Larry Fink said on the Fox Business show “The Claman Countdown” that a spot Ethereum ETF could still be possible even if the SEC classifies ETH as a security."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQbUx2b3RSd3V1TGZCa3puV293TEFwa2hPbTJtajVQaGlCMXhFQUpSOVVkV3FiNnFGek92eGRyUlhDT09KQmEzSVNvWUVnY1NUbVAzZHJFNVN1NzN3bkVYMXdxQ29vTl91VlozNThYaktuLU1Qc1NkLVRQZktaRXlOeXFrUTZLaHcydXR2bl9TX0M1MTTSAZgBQVVfeXFMUFJadEhWLUxlVk5WUnlWcWlDcktHX0RZUGNIaU5aODBvMDBHLV9ieU01MzlMYlZRWTdsaUpGbU5OTlYwTDU5SHlkSHVNaHJmaklVTk5GQUcweTJkRloyS1BScnFtSXUtSkM2YVhmNHZnY2R6QmV5a0l6aFV3REtCN2FGTWlPUEd5WTA4S0l2YXBNbjhKdTVNV18?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Ethereum Price: Whales Move 36K ETH As Price Regains Momentum, What’s Next? - CoinGape",
        "content": "Despite a weekly pullback in Ethereum’s price trajectory, the world’s second-largest crypto by global market cap has once again sparked substantial investor attention. Today, on May 3, Ethereum’s price not only regained an upward momentum but also surpassed the significant $3K mark, a positive development that has reinvigorated the market, instilling a sense of optimism among investors.\n\nThis upward trend, coupled with a considerable spike in whale activity, has ignited a flurry of interest surrounding the token’s future price movements. Nearly 36,000 ETH was shifted over the past day, with whales dumping and buying and buying the so-called ‘eternal Solana rival’ token in hand.\n\nadvertisement\n\nETH Whale Activity: A Closer Look\n\nInsights from on-chain analysis platforms reveal that a total of 36,762 ETH was moved in the past day. Notably, whale 0xf83c… made a significant move by transferring 25,772 ETH to Coinbase Institutional, a prominent player in the crypto industry. In contrast, whale 0x0b4… acquired 10,990 ETH from Coinbase during the same period, showcasing contrasting strategies.\n\nThese transactions, coming in tandem with Ethereum’s recent turbulent price action, have ignited mixed sentiments within the broader crypto market. While one whale continued to buy the token amid a broader market dip, the other whale dumped colossal amounts of the same token, underscoring a bearish sentiment amid ETH’s status as a security saga.\n\nNonetheless, the price trajectory’s upward movement at press time skewed the scale more toward the optimistic side.\n\nAlso Read: Jack Dorsey’s Block Boosts Its Bitcoin Bet With 10% Gain Reinvestment\n\nETH Price Jumps\n\nAs of writing, Ethereum’s price jumped 3.08% in the past 24 hours and currently sits at $3.001. The token witnesses a high price flux movement at the $3K mark, with its monthly charts illustrating a consolidatory phase.\n\nCrypto market enthusiasts continue to extensively eye the token for further price action shifts as the security lawsuit and a post-BTC halving rally remain poised to impact the token’s market dynamics.\n\nIt’s worth noting that XRP, a Ripple Labs-backed token, has been on a sluggish price trajectory ever since it entered a legal tussle with the U.S. SEC. On the other hand, a post-halving rally usually pushes a parabolic uptrend in altcoins as well, historical data suggests, although it’s not always a guarantee of future price movements.\n\nAlso Read: Michael Saylor Attacks Ethereum Calling It A Security, Disapproves spot ETF\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPcEswQ2R2WUJxc2ZSQjFCVHVDbm5HcW1VYl9WQ3JyajkwWC1lR1hDdF9tTjVmUFZpTVYzaUtSWHpiXzBzQWFnVzBIZVA2dUFELVNiTUtjeUQ2UURfZU5ZbG5CUUxVYlJHOFEyOW9wMmNrTUV2aWxNbF9KcC0xd1owMnhSSWd4RHBqak5JU0dwRFRweUttNnpxRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, and Dogecoin Make a Massive Recovery on Friday - The Motley Fool",
        "content": "A bad jobs report was good for crypto today.\n\nAfter a week of lower trends, Bitcoin (BTC -3.41%), Ethereum (ETH -2.30%), and Dogecoin (DOGE -7.20%) jumped in trading on Friday morning.\n\nAs of 3 p.m. ET, Bitcoin was up 4.1% versus yesterday's stock market close, Ethereum had risen 2.6%, and Dogecoin was up 5.6%. And they all moved based on the same piece of information.\n\nUnemployment data and crypto\n\nCrypto values jumped the moment the U.S. Labor Department released April 2024 jobs data. The U.S. added 175,000 jobs last month and the unemployment rate rose slightly to 3.9%.\n\nEconomists were expecting 235,000 new jobs and an unemployment rate of 3.8%.\n\nThere can be revisions to initial data, but the market will often react solely to the headline report. And that's exactly what happened with the crypto market's reaction only seconds after the report was released.\n\nDoes unemployment really impact crypto?\n\nThe question is really about what this news has to do with cryptocurrencies. Many market participants think a worsening economy means the Federal Reserve will lower rates more quickly. Current expectations are for a September rate cut, but there may be no rate cuts this year if inflation remains high.\n\nIt's a balance to keep rates higher if the economy weakens because lower rates can be a catalyst for more economic activity.\n\nI also question whether or not rates really have much of an impact on cryptocurrencies at all. Outside of more speculation, lower rates don't have any fundamental impact on the crypto market in most instances.\n\nHigher rates are bad for the crypto meme\n\nWhile Bitcoin has solidified its position as a form of digital gold and Ethereum is commonly known as a more utility blockchain with many scaling solutions, Dogecoin could be the most sharply impacted if rates stay where they are and the economy gets worse.\n\nDogecoin is a meme coin with no real utility and that meme position will be tough to hold if people have fewer funds to spend on speculative assets. I think that explains the reaction today.\n\nThis is part of the normal volatility of the crypto market, but it also highlights that eventually, the meme that started in 2020 may not hold much water.\n\nCaution in crypto today\n\nThe crypto market has been on a tear in 2024 despite higher interest rates and signs the economy is getting weaker. And there was also the tailwind from the approval of Bitcoin exchange-traded funds (ETFs) in the U.S.\n\nBut some of the market's tailwinds may be subsiding and that won't be good for valuations long term unless there's a significant increase in the utility of cryptocurrencies. Bitcoin is getting more expensive after the most recent halving and Ethereum hasn't proven to be very cost-effective either.\n\nDogecoin has very little utility and has been focused on its meme status, which can come and go.\n\nI think a day like this is a time to take some chips off the table in crypto as the market telegraphs there are weaker fundamentals for the economy ahead. Like it or not, the economy and the Fed are still the biggest drivers of crypto long term."
    }
]