[
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPal9ZTkNqN19tMThHVWlLUTNkdVlVb0thQkhMVXdaSHh1Wk43ZjlfNVAyNndWM1JIMmZ6d0RIOXRWb3FRMDNZc0FjVHVKV1Mwb2RYZUZ0OE1vMjFnMTMwNEo4aGZua2hLS3FXejVHZENXVmN3R0F2OVQyOVRRU3Y0VWpibDFCNEVIYmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "SEC postpones Ethereum ETF decisions - Yahoo Finance",
        "content": "The U.S. Securities and Exchange Commission (SEC) has postponed its decision on approving spot Ethereum exchange-traded fund (ETF) from Franklin Templeton, initially anticipated for May, to a new deadline of June 11.\n\nThe SEC also delayed the deadline for the agency’s decision on Grayscale’s spot Ethereum ETF application to June 23.\n\nMeanwhile, the SEC is soliciting public feedback on a revised ETF proposal from BlackRock, which now includes a cash redemption model, a change from the original direct Ethereum exchange mechanism.\n\nBlackRock’s proposal, initially submitted in November 2023, has been revised to better align with the SEC’s regulatory framework, mirroring the cash redemption feature of previously approved Bitcoin ETFs.\n\nThe SEC has maintained a cautious approach to cryptocurrency ETFs despite approving spot Bitcoin ETFs earlier in the year.\n\nThe Bitcoin ETFs, approved in January, have since provided investors a regulated trading vehicle for the cryptocurrency and have experienced a cumulative total net inflow of US$12.42 billion.\n\nThe potential approval of Ethereum ETFs would provide investors with access to the second-largest cryptocurrency by market capitalization, marking another step toward the integration of digital assets into conventional investment portfolios."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPal9ZTkNqN19tMThHVWlLUTNkdVlVb0thQkhMVXdaSHh1Wk43ZjlfNVAyNndWM1JIMmZ6d0RIOXRWb3FRMDNZc0FjVHVKV1Mwb2RYZUZ0OE1vMjFnMTMwNEo4aGZua2hLS3FXejVHZENXVmN3R0F2OVQyOVRRU3Y0VWpibDFCNEVIYmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "SEC postpones Ethereum ETF decisions - Yahoo Finance",
        "content": "The U.S. Securities and Exchange Commission (SEC) has postponed its decision on approving spot Ethereum exchange-traded fund (ETF) from Franklin Templeton, initially anticipated for May, to a new deadline of June 11.\n\nThe SEC also delayed the deadline for the agency’s decision on Grayscale’s spot Ethereum ETF application to June 23.\n\nMeanwhile, the SEC is soliciting public feedback on a revised ETF proposal from BlackRock, which now includes a cash redemption model, a change from the original direct Ethereum exchange mechanism.\n\nBlackRock’s proposal, initially submitted in November 2023, has been revised to better align with the SEC’s regulatory framework, mirroring the cash redemption feature of previously approved Bitcoin ETFs.\n\nThe SEC has maintained a cautious approach to cryptocurrency ETFs despite approving spot Bitcoin ETFs earlier in the year.\n\nThe Bitcoin ETFs, approved in January, have since provided investors a regulated trading vehicle for the cryptocurrency and have experienced a cumulative total net inflow of US$12.42 billion.\n\nThe potential approval of Ethereum ETFs would provide investors with access to the second-largest cryptocurrency by market capitalization, marking another step toward the integration of digital assets into conventional investment portfolios."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPal9ZTkNqN19tMThHVWlLUTNkdVlVb0thQkhMVXdaSHh1Wk43ZjlfNVAyNndWM1JIMmZ6d0RIOXRWb3FRMDNZc0FjVHVKV1Mwb2RYZUZ0OE1vMjFnMTMwNEo4aGZua2hLS3FXejVHZENXVmN3R0F2OVQyOVRRU3Y0VWpibDFCNEVIYmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "SEC postpones Ethereum ETF decisions - Yahoo Finance",
        "content": "The U.S. Securities and Exchange Commission (SEC) has postponed its decision on approving spot Ethereum exchange-traded fund (ETF) from Franklin Templeton, initially anticipated for May, to a new deadline of June 11.\n\nThe SEC also delayed the deadline for the agency’s decision on Grayscale’s spot Ethereum ETF application to June 23.\n\nMeanwhile, the SEC is soliciting public feedback on a revised ETF proposal from BlackRock, which now includes a cash redemption model, a change from the original direct Ethereum exchange mechanism.\n\nBlackRock’s proposal, initially submitted in November 2023, has been revised to better align with the SEC’s regulatory framework, mirroring the cash redemption feature of previously approved Bitcoin ETFs.\n\nThe SEC has maintained a cautious approach to cryptocurrency ETFs despite approving spot Bitcoin ETFs earlier in the year.\n\nThe Bitcoin ETFs, approved in January, have since provided investors a regulated trading vehicle for the cryptocurrency and have experienced a cumulative total net inflow of US$12.42 billion.\n\nThe potential approval of Ethereum ETFs would provide investors with access to the second-largest cryptocurrency by market capitalization, marking another step toward the integration of digital assets into conventional investment portfolios."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNb3BGalRlSDJnVnRTbGZVT19IbjJCNUIwMnJpT3Fyei1oZENBRGdjQVEyZHdSTTdWUUpDZUpnZXNxQkVWcTU1Z1p2TTRjM3VXTktvQ3hHTzJTdTdabmNrWHlIb1l5a2xlcFF5U2M1VHlzTHV0d0JBcDMwRkFIZ3NlUHFZbi1OU0ZDQl9wMXFLZ1p5RXlDaEFGbzNUaklhbmhJ0gGmAUFVX3lxTE5tTGxzY1Q4eXd4S2NvSEdxOWRxZE1UT3o5SWFtb0hOUkV3VGt1cUxaSlU4QUpNaURiWGZEQTN0a2cwQjRJNEQ5NlZFRTNRS2dhdGhOSU9obzBhaFlqd2ppemstUTBHQzAtZEZad0lTUkw0NzEwa1V0SlFodnVWeFQ1azNORjBVUk1tTlN2TkVjSUlIai1aWjEtRjlQUkM2QldkZ0tVOVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Jumps As TRON Founder Justin Sun Accumulates 15K ETH, What’s Next? - CoinGape",
        "content": "Ethereum, the second-largest cryptocurrency by global market cap, appears to have ignited a torrent of optimism among crypto market traders and investors globally today, April 24. As ETH’s price action illustrated a considerable rebound, followed by heightened whale activity orbiting the token, the eternal Solana rival garnered noteworthy investor attention today, with crypto market participants speculating about the token’s price action ahead.\n\nNotably, TRON founder Justin Sun, a prominent figure within the crypto realm, continued accumulating staggering amounts of ETH, per today’s on-chain data. Meanwhile, whale activity surrounding the token has been burgeoning over the past few days, with bullish sentiments swirling around ETH. Here’s a closer look at why Ethereum curates market optimism with whales buying the token despite its sideways trading over the past few days.\n\nadvertisement\n\nEthereum Accumulations Note A Spike, Fuels Market Optimism\n\nAccording to Lookonchain’s insights, a blockchain data analytics platform, the Justin Sun-linked wallet 0x4359 withdrew 15,389 ETH, worth $49.78 million, from Binance today, April 24, nabbing global attention. This massive accumulation by Sun underscored a heightened sense of confidence in the asset’s future, birthing immediate bullish sentiments for the ETH price trajectory ahead.\n\nIntriguingly, CoinGape Media spotlighted a plethora of ETH whale accumulations yesterday, weighing in on the token’s optimistic take on the market. Per the report, Justin Sun invested a staggering $1 billion in Ethereum yesterday, further anchoring the TRON founder’s confidence in the asset. This, coupled with the rising Ethereum whale accumulations, paints a highly bullish outlook for Ethereum’s price action ahead.\n\nAlso read: Crypto News: FTC Votes to Ban Noncompete Agreements in Employment Contracts\n\nEthereum Price Jumps\n\nAs of writing, the Ethereum token’s price has been noted to have gained 1.67% in the past 24 hours and is currently trading at $3,242. The ETH market cap sprung 1.58%, accompanied by a 24-hour trading volume upswing of 2.16%, amassing slight optimism on the token.\n\nThis price rebound showcased by ETH primarily aligns with the colossal accumulations recorded in the past few days, as mentioned above. However, derivatives data for the token signals reduced investor interest and market activity for the token, underscoring a potential downtrend for Ethereum in the market as of press time. Coinglass revealed a 0.39% dip in the token’s open interest, accompanied by a derivatives volume fall of 2.88%.\n\nThis painted an uncertain scenario surrounding ETH’s price action ahead, as bulls or bears may take over the token at any moment in the future. Nonetheless, with post-BTC halving optimism, further accompanied by significant whale accumulations, crypto market enthusiasts continue to extensively eye the token, hoping to see a rising price action ahead.\n\nAlso Read: Block Inc Successfully Wraps Up Bitcoin Mining Chip Development\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNTUdxQ1hFRnE2eklyaGlBZE44eU9tXzdWREtXekRfaWwzcG5ma3VfblJQS0hGb3RSZkJiOERBSkNYcWVsZ1BCUDZvTmlhbjZ3Mk9mSWZtaDdCY2NvSjBIVzhfM1NiMnpMYUpPbm44bWRLV1FjdmMzeTktX09MM1dYdG1ZSHZTeGFzSmVwSlJ4UTZHbUtSam91Tm1hWdIBowFBVV95cUxNYjFRdkVHbVFCTUxMb3lLdlZmRUhlRV9fUjNVUkYySWswd2ZOV2huaVRIMzdjSU9aMURDc3NCNlpUcUNYMVl6YnRtWmpYVjFTdkI3ekVneGZUa3RRTExUSjBXY1B0QmF5SVhfQVZ4UWtaS21reVk4bkRSY1NCankwZmV5N0swUndlRm9NT21JRHBnSHQxamFCb19wU3FLckdtX1NZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "What Is Xai? The Rising Ethereum Layer-3 Gaming Network on Arbitrum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA new gaming blockchain has entered the lobby in 2024: Xai.\n\n“Xai is built to enable open trade in the next generation of video games,” the official site says. In its quest to do so, the network aims to reduce fees, offer account abstraction to hide some of those pesky blockchain elements, and empower game creators in the process.\n\nThe layer-3 blockchain is developed in part by Offchain Labs, the original creator and primary developer behind the Ethereum layer-2 Arbitrum network that Xai is built on top of. And Xai is getting help from game developer Ex Populus, which will deploy the first games planned to launch on the network in collaboration with the Xai Foundation.\n\nBut what does this really mean? We’ve rounded up all you need to know.\n\nAD\n\nAD\n\nWhat is Xai?\n\nMany crypto users are familiar with the concept of layer-1 blockchains and layer-2 scaling networks built on top of them, but Xai brands itself as a layer-3 network. This is because it’s built atop Ethereum layer-2 scaling network Arbitrum.\n\nIn practicality, this means that Xai keeps Arbitrum’s core functionalities the same while tweaking certain aspects of the network for a more targeted experience intended for a specific use case. While Arbitrum is a general layer-2 scaling solution that can be tapped for all kinds of apps, Xai specifically caters to the needs of gamers and game developers alike.\n\nFor example, Xai offers account abstraction—meaning it’ll hide confusing parts from users—when it comes to the blockchain wallet and account experience. The network also provides developers with increased gas and contract limits.\n\nMost notably, the Xai site says that it “introduces parallel processing and advancements for enhanced scalability, efficiency, and cost reduction.” That’s on top of Arbitrum’s existing layer-2 approach, which handles transactions away from the Ethereum mainnet to do so at a lower cost and greater volume via its optimistic rollup tech.\n\nAD\n\nAD\n\nBy reducing fees and increasing transaction times, Xai aims to create a smoother gaming experience while embracing the unique elements that make blockchain gaming what it is—such as true ownership of unique, in-game items, as well as tokenized economies.\n\n“The cheaper and faster we can make things,” Ex Populus co-founder and CEO Tobias Batton told Decrypt, “the better experience we can provide users.”\n\nWhat is the XAI token?\n\nKicking off 2024 with a bang, 125 million XAI tokens (5% of the token supply) were airdropped to gamers, according to the Xai Foundation. The airdrop’s total value was nearly $70 million at launch, growing to $140 million less than a week later.\n\nThe XAI token’s primary purpose is to be used as the gas fee token on the layer-3 blockchain. But there are also potential benefits, as XAI tokens can be exchanged for esXAI (or escrowed XAI) tokens and staked to earn interest-like rewards.\n\nOnce you have staked your esXAI tokens, you're able to participate in staking pools. Coming in Q4 2024, you’ll also be able to participate in governance as well as gain “exclusive access” to special events and assets associated with projects on the Xai blockchain.\n\nWhich games are building on Xai?\n\nAll of this technical stuff is great, but a gaming network is ultimately defined by the games on it. After all, no one would buy a PS5 if it had no games. So which games are being built on Xai?\n\nWith Ex Populus as a key partner, the developer has committed its suite of games to the layer-3 network. Currently, we know two of the games that are in development by Ex Populus: rogue-lite auto-battler Final Form, and hover car action shooter LAMOverse. But the studio’s website also states that an open-world experience is currently in pre-production, with details still to be announced.\n\nOutside of this partnership, early this year it was announced that Crypto Unicorns and its related NFT games will migrate from Ethereum sidechain network Polygon to Xai. Crypto Unicorns NFTs have generated $35 million of trading volume. The switch was motivated primarily due to “challenges” that arose when operating a game on Polygon, the team told Decrypt, namely in the form of network gas fee spikes.\n\nAD\n\nAD\n\nAfter that, a prominent indie gaming curator called The MIX, or The Media Indie Exchange, said that it plans to launch over 100 games on Xai before the end of 2024. While what games will be launched on the network is yet to be confirmed, Xai said that “many” of the games are already on Steam and will be reworked to benefit from blockchain tech.\n\nThis means that it's likely that currently Web2 games are going to get Web3 functionality using Xai, which The MIX suggests will bear a “striking resemblance” to how Valve allows players to buy and sell Counter-Strike: Global Offensive in-game items.\n\nMost recently, Reboot, the crypto gaming protocol powering Pixel Vault’s flagship game BattlePlan, announced an alliance with the Xai Foundation to migrate the game to the network. Sometime this quarter, BattlePlan will move one layer deeper from Arbitrum Nova to Xai in an attempt to “enhance player experience.”\n\nHow staking works on Xai\n\nAs an incentive to keep users on the network and reward them for supporting its consensus model, Xai began rolling out staking across two waves.\n\nVersion one allowed owners of Sentry Nodes—which are responsible for monitoring and flagging blocks on the Xai network—to stake up to 25,000 esXAI they hold. Then, in April, version two was rolled out, which opened the gates to any holder of esXAI.\n\nNow, staking pools can be created by Sentry Key holders—the NFT is used to operate a Sentry Node to support the network—and then anyone can stake esXAI in the pools that have been created. Pool operators can determine the distribution of pooled network rewards, specifying the percentages allocated to themselves, Sentry Key-holding stakers, and standard esXAI stakers.\n\nXai also introduced a tier system where the higher the tier of a staking pool, based on the amount of esXAI staked, the greater the reward multiplier for the staked Sentry Keys.\n\nAD\n\nAD\n\nFor example, if 500,000 esXAI is staked, then the Sentry Key will see a 3x reward multiplier. This starts at \"bronze\" with no bonus reward, but climbs all the way up to \"diamond,\" which has a 6x reward multiplier.\n\nThe future\n\nXai is like an onion: It has layers. As a layer-3 blockchain, it attempts to improve on the layers that came before it to optimize the gaming experience. Peel back more layers and you find a robust token and staking system with governance in layers to come.\n\nOf course, the one layer that’s still a bit thin as of this writing concerns the actual games themselves build on top of the network. But based on the announcements thus far, it appears those games are coming.\n\nEdited by Andrew Hayward"
    }
]