[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5QQ2RlcjBjSlhhYlRwNE9HN2oxRXU2bE5MTGVabTlwMVptS2VaaDQ4UFJxbHJLVXhvR2d0Q2RiMnJyUE5JcXN2Um1WTENrX1RxdklJZWl5VjkwTkZhaWtlR2RhVmEtRkRtdGF2OW53TXBRdDMtZHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? - Yahoo Finance",
        "content": "Former President Donald Trump has sold more than 1,000 Ether (ETH) in the past several weeks, according to blockchain analytics company Arkham Intelligence, which has been tracking his ETH holdings for the past several months. It obtained the data through Trump's financial filings and disclosures.\n\nMost of the ETH comes from royalties for non-fungible token (NFT) projects that Trump created. In December 2022, Trump released a set of 45,000 NFTs, each priced at $99. The project has amassed trading volumes of over $35 million or 15,000 ETH.\n\nThe NFTs are largely trading above their original price of $99. As of Jan. 19, the cheapest NFT is listed for over $600 and the highest sale was for 37 ETH.\n\nDon't Miss:\n\nIn early 2024, Trump announced another trading card NFT project that has some unique rewards for owners. Some of the potential perks could be dinner with the former president, or even a small piece of fabric from the suit he wore in his Georgia mugshot.\n\nHowever, Trump and his companies are not directly associated with these NFT projects. NFT International created and distributed the NFTs and uses Trump's \"name, likeness and image under paid license from CIC Digital LLC, which license may be terminated or revoked according to its terms.\"\n\nTrump sold 1,075 ETH for over $2.4 million through Coinbase.. At its peak, it was worth more than $4 million.\n\nThe sale comes after a strong month for Ethereum. The price was up more than 17% in the month leading up to the sale, 30% in the six months before and 60% over the past year.\n\nEven though Trump said during his presidency that he was \"not a fan\" of Bitcoin and that crypto is a \"disaster waiting to happen,\" it is hard to pass on several million dollars. Though Trump is largely unaffiliated with the project, he is still earning royalties. While his stance on crypto is still up in the air, the recent sale is an interesting development in Trump's relationship with crypto.\n\nAs the presidential race heats up, it will be important to watch for news relating to presidential candidates' stances on crypto, as this could have large implications for prices, future adoption and use cases going forward.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nStory continues\n\nGet the latest stock analysis from Benzinga?\n\nThis article Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5QQ2RlcjBjSlhhYlRwNE9HN2oxRXU2bE5MTGVabTlwMVptS2VaaDQ4UFJxbHJLVXhvR2d0Q2RiMnJyUE5JcXN2Um1WTENrX1RxdklJZWl5VjkwTkZhaWtlR2RhVmEtRkRtdGF2OW53TXBRdDMtZHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? - Yahoo Finance",
        "content": "Former President Donald Trump has sold more than 1,000 Ether (ETH) in the past several weeks, according to blockchain analytics company Arkham Intelligence, which has been tracking his ETH holdings for the past several months. It obtained the data through Trump's financial filings and disclosures.\n\nMost of the ETH comes from royalties for non-fungible token (NFT) projects that Trump created. In December 2022, Trump released a set of 45,000 NFTs, each priced at $99. The project has amassed trading volumes of over $35 million or 15,000 ETH.\n\nThe NFTs are largely trading above their original price of $99. As of Jan. 19, the cheapest NFT is listed for over $600 and the highest sale was for 37 ETH.\n\nDon't Miss:\n\nIn early 2024, Trump announced another trading card NFT project that has some unique rewards for owners. Some of the potential perks could be dinner with the former president, or even a small piece of fabric from the suit he wore in his Georgia mugshot.\n\nHowever, Trump and his companies are not directly associated with these NFT projects. NFT International created and distributed the NFTs and uses Trump's \"name, likeness and image under paid license from CIC Digital LLC, which license may be terminated or revoked according to its terms.\"\n\nTrump sold 1,075 ETH for over $2.4 million through Coinbase.. At its peak, it was worth more than $4 million.\n\nThe sale comes after a strong month for Ethereum. The price was up more than 17% in the month leading up to the sale, 30% in the six months before and 60% over the past year.\n\nEven though Trump said during his presidency that he was \"not a fan\" of Bitcoin and that crypto is a \"disaster waiting to happen,\" it is hard to pass on several million dollars. Though Trump is largely unaffiliated with the project, he is still earning royalties. While his stance on crypto is still up in the air, the recent sale is an interesting development in Trump's relationship with crypto.\n\nAs the presidential race heats up, it will be important to watch for news relating to presidential candidates' stances on crypto, as this could have large implications for prices, future adoption and use cases going forward.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nStory continues\n\nGet the latest stock analysis from Benzinga?\n\nThis article Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5QQ2RlcjBjSlhhYlRwNE9HN2oxRXU2bE5MTGVabTlwMVptS2VaaDQ4UFJxbHJLVXhvR2d0Q2RiMnJyUE5JcXN2Um1WTENrX1RxdklJZWl5VjkwTkZhaWtlR2RhVmEtRkRtdGF2OW53TXBRdDMtZHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? - Yahoo Finance",
        "content": "Former President Donald Trump has sold more than 1,000 Ether (ETH) in the past several weeks, according to blockchain analytics company Arkham Intelligence, which has been tracking his ETH holdings for the past several months. It obtained the data through Trump's financial filings and disclosures.\n\nMost of the ETH comes from royalties for non-fungible token (NFT) projects that Trump created. In December 2022, Trump released a set of 45,000 NFTs, each priced at $99. The project has amassed trading volumes of over $35 million or 15,000 ETH.\n\nThe NFTs are largely trading above their original price of $99. As of Jan. 19, the cheapest NFT is listed for over $600 and the highest sale was for 37 ETH.\n\nDon't Miss:\n\nIn early 2024, Trump announced another trading card NFT project that has some unique rewards for owners. Some of the potential perks could be dinner with the former president, or even a small piece of fabric from the suit he wore in his Georgia mugshot.\n\nHowever, Trump and his companies are not directly associated with these NFT projects. NFT International created and distributed the NFTs and uses Trump's \"name, likeness and image under paid license from CIC Digital LLC, which license may be terminated or revoked according to its terms.\"\n\nTrump sold 1,075 ETH for over $2.4 million through Coinbase.. At its peak, it was worth more than $4 million.\n\nThe sale comes after a strong month for Ethereum. The price was up more than 17% in the month leading up to the sale, 30% in the six months before and 60% over the past year.\n\nEven though Trump said during his presidency that he was \"not a fan\" of Bitcoin and that crypto is a \"disaster waiting to happen,\" it is hard to pass on several million dollars. Though Trump is largely unaffiliated with the project, he is still earning royalties. While his stance on crypto is still up in the air, the recent sale is an interesting development in Trump's relationship with crypto.\n\nAs the presidential race heats up, it will be important to watch for news relating to presidential candidates' stances on crypto, as this could have large implications for prices, future adoption and use cases going forward.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nStory continues\n\nGet the latest stock analysis from Benzinga?\n\nThis article Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNVHBCVS1lZktCa3lpbXpXTUY1cVpIbkc2LVlmUHN3NzZXN0d6U2MtdlBDU1ctcC1zQk15ekdVcVpqUlJ1eVhsakRuTVpjLU1BMFpRUE5TWEpjbmg3aFJYR3I2LUxGOTVGalFFamlCUUxpV0p3c0tpREhzR3N3YnBZcWo2a3ZoclJIZXFDTmRQVzBzMTNjYkVDdNIBoAFBVV95cUxPR0QxVUhrTlQwYW5fUzR4ckUwS3FrTnd4UlFqQnJfclFjRnNWVHlhTVo1UDlpM28wdzZTUUUxNVpSQTc3WGZERDZORkhMVlVwbzdRMVFiN2k3RFhBb1N3Q2JjZzIySzg0b1g1SGRSUFBWdF9uUUxLOVBDU3JlVDlJdEpHYnN3NXhGTXJXMEZtSjBydkIxMGE3Q0dxLXI3dnRW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum, Solana Losses Pile Up as Bitcoin Sell-Off Sinks Crypto Market - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin (BTC) and the wider crypto market are down bad this week. But some of the biggest losers near the top of the market were once recently stars of the show, including Ethereum (ETH), Solana (SOL), and Avalanche (AVAX).\n\nIn recent weeks, all three of those top 20 cryptocurrencies were making big gains as they attracted institutional investor interest. Now, each has slipped by at least 14% over the past seven days, and have posted sizable losses on the day.\n\nEthereum is down sharply this morning, per data from CoinGecko, falling 7% over the past 24 hours to a current price of about $2,200 and pushing its seven-day dip to 14%.\n\nSolana is down almost 16% over the past seven days at a current price of $82.50. It has rebounded slightly from earlier this morning, but remains down about 5% on the day.\n\nAD\n\nAD\n\nMeanwhile AVAX, which is the 11th largest cryptocurrency, has plunged 19% on the week to a current price of just under $29. Like Solana, it has shored up some of its losses since this morning, now down about 5% over the past 24 hours.\n\nIt was just over a week ago that Ethereum came just shy of hitting $2,700, its highest price since April 2022. Excitement over Ethereum grew amid the launch of spot Bitcoin ETFs as investors considered the next wave of prospective institutional adoption, particularly as BlackRock CEO Larry Fink talked up the prospect of an Ethereum spot ETF.\n\nSOL had been on a big run starting from the end of October. It was expected to take a hit during the trial of disgraced crypto mogul Sam Bankman-Fried, who was heavily invested in the asset via his now collapsed crypto empire, FTX.\n\nBut major companies such as Visa and Shopify sung the project's praises and said they'd use its blockchain. A growing developer base also meant the price of SOL shot up. It rose as high as $123 in December 2023, nearing a two-year high after plunging to a price of about $8 in December 2022.\n\nAD\n\nAD\n\nAVAX also attracted interest when investment banking giant J.P. Morgan said in November it had used the Avalanche blockchain to tokenize portfolios.\n\nLong-term holders have reason to be optimistic, though—despite the recent dips in price, both coins over a one-year period are doing well: SOL is up 239%, while AVAX has jumped by 64%. Even Ethereum is up by 35% over the last year.\n\nThe broader crypto market has taken a nosedive as it follows the price action of the biggest digital asset by market cap, Bitcoin.\n\nSince crypto fund Grayscale converted its flagship BTC fund into an exchange-traded fund (ETF) and started trading on the stock market, investors have been keen to redeem shares previously locked into the product.\n\nThis has put pressure on the price of the biggest and oldest digital coin in recent days.\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE56eTFLazFlb3lzemtwb3NXWmhPWHN3TGtPdGpNeUFpOEU5NTUtcjRyTXAtOHlFQ2g5cmRVWWtsSm53cHluS2JFMmQ0MFZKdWFDNWNLbU9jRnk3WjYwX2RKMkVNZ1MxZHR2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Polymer Labs secures $23M to bring IBC to Ethereum - Blockworks",
        "content": "Polymer Labs, a modular IBC-based networking protocol, has secured a $23 million Series A co-led by Blockchain Capital, Maven 11 and Distributed Global.\n\nOther investors, including Coinbase Ventures, Placeholder, Digital Currency Group, North Island Ventures and Figment Capital also participated in the round.\n\nPolymer can be described as a modular layer-2 network that employs Cosmos SDK’s IBC protocol, OP stack’s settlement functionality and Eigenlayer’s data availability layer. It is the brainchild of Bo Du and Peter Kim.\n\nAfter being in the blockchain industry for a few years, the Polymer founders experienced firsthand how difficult it was to build interchain products. In the summer of 2021, they made a decision to drop their side projects and focus on fixing blockchain interoperability.\n\nRead more: The Interchain Foundation puts aside $26.4M to grow Cosmos ecosystem\n\nInitially, the team wanted to design their own interoperability protocol — similar to that of many general message-passing protocols that exist today. However, during their research, they came across the Cosmos SDK’s Inter-Blockchain Communication protocol, Du told Blockworks.\n\nIBC is an inter-blockchain communication protocol, as its name suggests. It allows different blockchains in the Cosmos ecosystem to communicate with each other. The protocol is designed to ensure that information can be securely transferred between separate operating chains.\n\nRead More: DeFi users ‘don’t care’ what chain apps are on\n\n“IBC already had years put into its design and architecture, so we decided to stick with IBC and not invent a whole new standard,” Du said.\n\nKim added that at the time, IBC was the most decentralized, elegant solution to establish connections and pass messages between chains.\n\n“​​We realized this was something that could be expanded to other chains; basically export the technology to have industry penetration rather than just the Cosmos app chains,” Kim said.\n\nSo how does it work?\n\nThe team wanted to find ways to make the already established interoperability protocol on Cosmos a mainstream standard in the Ethereum ecosystem.\n\n“It’s not easy to integrate IBC natively into all these different chains, which is why we designed the virtual IBC protocol, which essentially allows chains that don’t natively implement IBC to access IBC execution through Polymer and have Polymer execute IBC on its behalf,” Du said.\n\nMany blockchain interoperability protocols today are focused on the state component of interoperability, which involves aligning the status of the data stored within separate systems, but Du believes this is just one part of the interoperability problem.\n\nRead more: Interoperability isn’t just a buzzword\n\nBeyond the state layer, two other layers need to be considered. This includes the application layer — that is, the layer responsible for encoding and decoding sent data and the transportation layer (TAO) — which manages the routing of raw data.\n\n“All of IBC’s core logic will live on the transportation layer; this becomes decoupled from the application layer, and Polymer will hold the IBC state on behalf of the connected chain,” Du said.\n\nThis means that at the end of the day, the application — which lives on Ethereum — will be able to interact with the IBC network through Polymer smart contracts.\n\n“Polymer will then take the apps intended actions and execute the associated IBC logic and produce a commitment to the IBC state of that chain on Polymer — so essentially, Polymer is maintaining this merkle-ized IBC state on behalf of the connected chain,” he said.\n\nRead more: 2023’s top 5 DeFi protocols by revenue\n\nSimilar work to decouple state, application and transport layers is being explored by the interoperability protocol LayerZero.\n\nIBC has been around for a long period of time. Du notes that its specs cover various considerations ranging from authentication, timeouts and acknowledgment, somethings its competitors may not have.\n\nThis means that applications will not have to individually implement these different changes when there are protocol upgrades.\n\n“If you want to design a protocol that is going to last for generations of builders, you need to be able to handle these different edge cases properly,” Du said. “This is a foundational level protocol.”\n\nInvestors in Polymer Labs, Yuan Han Li and Joshua Rivera from Blockchain Capital, shared this sentiment.\n\nThey note in a press release reviewed by Blockworks that “while numerous arbitrary messaging protocols have emerged to address the cross-chain interoperability, they have all done so by building a new messaging standard, paradoxically causing more fragmentation when a standardized and battle tested way to move data between heterogeneous blockchains already exists.”\n\nUltimately, the Polymer team is hoping to ensure that IBC becomes a widely adopted interoperability standard that will shape how blockchain applications of the future will communicate. This latest funding round will bring the team closer to launching mainnet.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]