[
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQUjZJeG1pNlBnWk1kUGVQaUVKSDZsSmp4Z3pXVUtYbGQyX2pqYTlxa1dYd3ZaUGZYeVplVlBPS1JoNU0zZ2dOU2NGZHlsRUkwWndOWGpfNmYySVpVUnRvdkFGTURCeVhTc0xJN29valdmckYzV1pOalRHcWwxRXlSYjd2aXFTR2RKMDNPUEU1c3I1ZmRULWR1b1hmeVpSc3hFbll0RmN2QWNvcjNXRFlmbXppWHBxeFN00gG-AUFVX3lxTFBicGYzVWRBbUJOMlhrUjZWVjgweDRqZ2drZzFEeS0xeWk3RklEZlVBbTVubzlNbzJacDJWOW0zVTNuYWZlMExRT3ZWMW9VSzQ4a3NSUGFJSW8yLWYzbFZPaXVlT1lTZVlyN2RxdHE5U05BUXZTSXpVSHBZcmFNSTFlcm5taHFjOEZyeXA5Qjc3ekVXamNuR0VaZTRNY0hEOU5KMkV4NGhKQ2Nlb2xHNm9pZUJtTUpKNG9xZzRoNHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Solana Meme Coin Slerf Clocks Higher Trading Volume Than All of Ethereum - CoinDesk",
        "content": "SLERF came into existence following a token presale , during which it raised $10 million from users. It quickly went viral on social platform X after its developer said they accidentally sent all the money raised to a burn address, a crypto wallet address that’s not controlled by anyone, thus losing access to the funds."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNTERxbXVmemRfVnVSejRrUVA5UDJYRmZLUVlsQUZKNHBaR1VXYm9DUlRQNnhmaDV3REh6cnhPTHJHb0hmV25JNk1Ua2MwbW10N2lwc1c1dDc4NFE0TkxyNUwtM0xSTlNCdWROVWJkb0E4b2NhVDhleGxESGlOYWtUUlRjMjFxYklGR1k2VVYtS0dYNnVh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "BlackRock Launches Digital Asset Fund Backed by $100M on Ethereum - Watcher Guru",
        "content": "Asset management company BlackRock is launching a tokenized digital asset fund, a new SEC filing on Tuesday shows. In turn, BlackRock seeded the fund by depositing $100 million in USDC stablecoin on the Ethereum Network.\n\nJUST IN: BlackRock launches digital asset fund and deposits $100 million $USDC on the Ethereum network. — Watcher.Guru (@WatcherGuru) March 19, 2024\n\nThe BlackRock USD Institutional Digital Liquidity Fund was incorporated in the British Virgin Islands and will be launched in partnership with Securitize, a tokenization firm. According to wallet data from Etherscan, BlackRock deposited Circle’s USDC stablecoin into a wallet on the Ethereum Network.\n\nBlackRock is continuing its journey into the digital asset industry following its Spot Bitcoin ETF launch earlier this year. The company’s Bitcoin ETF has been one of the best-performing Bitcoin products out of the field of new launches in 2024. Additionally, BlackRock also has a pending application for a spot Ethereum ETHER (ETH) ETF, which the SEC is putting off approval of.\n\nMANHATTAN, NEW YORK, UNITED STATES – 2021/05/25: BlackRock offices in New York City. Founded in 1988, BlackRock, Inc. is an US multinational investment management corporation. The corporation is the world’s largest asset manager, with $8.67 trillion in assets under management as of January 2021. (Photo by Erik McGregor/LightRocket via Getty Images)\n\nBlackRock Continues Its Mission For Tokenization\n\nIn a January interview with CNBC, BlackRock CEO Larry Fink said that BTC and ETH ETFs “are just stepping stones towards tokenization, and I really do believe this is where we’re going to be going.” Now, we are seeing the asset manager shift towards tokenization with a major step.\n\nAlso Read: Solana (SOL) Market Cap Predicted to Reach $1 Trillion\n\nFurthermore, BlackRock’s digital asset fund also represents a major milestone for the tokenization of real-world assets. Tokenization is a growing sector in the intersection of digital assets and traditional finance. It involves placing traditional assets on blockchain rails in pursuit of faster settlements and higher efficiency."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE55b1NxTktDREdTNzNvZzBkYzVEM3dNRmNqSTVuamNmdHdkRTluQUctdHhpTkZRdTNyVmxXMm9aUUdldjJ4SW91ekx1ejRtb1czMG5ETzRkbVBWQ1BzWF9DMGFTV3A5NGRIc0hrSTRFc0FaUi1VQi1lNnBBQ0ZMUdIBgwFBVV95cUxNUE1HVGlILTVuemF2X2R4aTZCZFQwTFUxN0hGU3RVNEc3cndEeWwxcHZyMGI4Q0ZKelVnWWI0Qi13eFltZ1REUWw4Tmp6VHFvMUljLW8yeHlfM1lZYWx2Y2cwY1hsODRuVmtGTFhKaTFrTlRoT2Y1TXJCS0tNQk1kZnBRbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "ETH Whales Cashing out Massively Amid Ethereum Price Drop - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAmid a tumultuous week for the crypto market, ETH whales have made substantial moves, cashing out millions before Ethereum's price downturn. In the past four days of market downtime, three smart traders have offloaded a staggering 26,946 ETH, equivalent to a jaw-dropping $95.7 million. Their combined profits stand at an impressive $39 million, according to data from Spot On Chain.\n\nAdvertisement\n\nThe first trader, identified as \"0xb82,\" executed a strategic move, selling 7,300 ETH for $24.4 million in stablecoins via Binance, netting a handsome profit of 22.7%, which is equivalent to a remarkable $4.59 million. Not far behind, \"0xebf\" deposited 8,870 ETH, valued at $33.1 million, onto Binance on March 16, reaping an estimated total profit of $25.3 million, an impressive 55.8% gain.\n\nLastly, \"0xa43\" sold 10,776 ETH for $38.2 million on March 15, realizing a notable $9.14 million profit, equating to a 31.5% gain.\n\nAdvertisement\n\nETH to USD by CoinMarketCap\n\nThese moves come against the backdrop of Ethereum's price plummeting over 11% since the start of the week. After reaching a two-year high of $4,093 last week, Ethereum faced a significant sell-off, driving its price down to $3,200 per ETH.\n\nCoinGlass reports that within the past 24 hours, positions totaling $120 million were liquidated, with an estimated 85% of them being long positions, suggesting a wave of sell-offs and profit-taking among investors.\n\nThe mass cash-outs by ETH whales amid the price drop raise questions about the future trajectory of Ethereum and the broader cryptocurrency market. Whether the main altcoin finds a foothold will largely be both the cause and the consequence of how events develop further."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPNUtfNUZSb195b0F0UUVYcDZ3aGhOa3N5bkY4dlloSnMxajVEWlh0ZDNEWkpJMTBmdksxajVMLW95VjMzUmtJUTJDVzF3UEpIYXRFLWlINi1LLWhYXzNydGtrY215SEhaUXdVd0pNVWtlTTBDWk5paXpXZ0g4ek5tT2VqdHJLeWNwTXlBYVVnY3NfZk0tVWNVNlJrSDJXeWMxbS1iWndXc3owRngxNk9lLUcxRzVRYzNFMDVGWmhza1LSAcYBQVVfeXFMTjQxUlpjMGFVcmlRYzl6bFJJOFZZYnAwR3Rnd2FiS3U1NjR2RmxVdnFmTVNrOGkwNGozTnhPRFNaTDRZM25EQ3hwWVYxaFlqaWdGY3RZSVVkeTJsS0JJVVpIdVRMajFKVzRFSlZuZkJkN3prZHp4NUV6Vm8xc0czZGhJTlBjSlc1dXhaS0E2RGdsZVh0ZVVOMmdkck01c19Bb1lnR3ZJSTBFbWZQSlNhdkNqeTNMZVVvQ2dUdFhOc2VNZmZISHVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum price plummets as large investors take profits - FXStreet",
        "content": "Ethereum’s price loses nearly 7% on the daily time frame, adding to the almost 20% weekly decline.\n\nThree Ethereum whales sold $95 million in Ether, taking nearly $40 million in gains since Friday.\n\nETH price could sweep the $2,900 level for liquidity before attempting a rebound.\n\nEthereum (ETH), the second-largest crypto asset by market capitalization, is currently in a state of decline. ETH price is down 7% on the day and almost 20% on the week, wiping out recent gains. On-chain data insights reveal that large-wallet investors, popularly known as whales, are shedding their Ethereum holdings and taking profits, increasing the selling pressure on ETH.\n\nAlso read: Grayscale amends Spot Ethereum ETF filing, ETH trades sideways below $3,700\n\nEthereum price crumbles under rising selling pressure\n\nData from crypto intelligence tracker Spotonchain shows that three large-wallet investors have taken profits on their Ethereum holdings in the past four days. The three Ethereum whales sold 26,946 Ether, worth $95.7 million, and took $39 million in profits. The transactions took place on Binance between March 15 and 19.\n\nAs whales shed their Ether, the altcoin’s supply on exchanges has increased. Between March 15 and 19, ETH reserves on exchanges are up from 13.92 million to 14.43 million. An increase in supply on exchanges implies there is a higher volume of Ether available to sell.\n\nAs seen in the Santiment chart below, Ethereum price declined alongside this supply increase, supporting the thesis that profit-taking has partly driven the drop in Ether’s price.\n\nSupply on Exchanges. Sources: Santiment\n\nEthereum price could sweep $2,900\n\nEthereum price is strongly correlated to Bitcoin. Therefore, the price decline seen in BTC likely helped Ethereum’s price to drop as well alongside factors like profit taking and whale activity.\n\nETH price is on the verge of dipping into the range between $2,717 and $3,200, represented by the Fair Value Gap (FVG) on its monthly chart. Once the altcoin collects liquidity in this zone, its price could rebound towards resistance at $3,500 (represented by R1 in the chart below).\n\nThe ETH/USDT 1-day chart shows that bears are taking over as the Moving Average Convergence/Divergence indicator flashes red bars. The Relative Strength Index (RSI) is at 42.05, close to the neutral zone, meaning ETH is not currently oversold. Should the RSI for ETH drop into the oversold zone, it would give a buy signal for sidelined buyers to step in.\n\n\n\nETH/USDT 1-day chart\n\nA daily candlestick close below $3,200 (the upper boundary of FVG) would result in a steeper correction that could send ETH price towards support at $2,166."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOYzRLRTJhcy1aSkZZT2tfaVFBZ1lNNXFEUTZnTlNvNGlrUzduXzZFYlQ1ODR2ZEI0eWswd2JOYjlCNVN1Um5nbEJzem4taXVMNWhldDl5amh5X29lY2VIOVdaaGZnOHdtNUxZakcyc0R1dWE3NklPWktfMHZvdXlyVV9pNVl1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Slumps Below $3400: Can ETH Hit $4000 This Week? - Watcher Guru",
        "content": "The Ethereum network has undergone notable changes in recent times. On September 15, 2022, the network transitioned from a proof-of-work mining model to a proof-of-stake model. This transition has led to a significant reduction in energy consumption, with reports indicating a 99.95% decrease.\n\nA few days ago, the network implemented the Dencun upgrade, which was designed to improve its functionality and performance. However, following this upgrade, the price of Ethereum (ETH) has experienced a decline, falling below the $4,000 mark.\n\nETH had recently shown growth, surpassing $4,000. However, the coin has since experienced a decrease in value along with the broader cryptocurrency market. As of press time, ETH is trading at $3,391, which represents a 6.1% decrease in the last 24 hours. Despite this recent decline, ETH remains up by 89% year-to-date and is still the second-largest cryptocurrency by market capitalization.\n\nAlso read: Cryptocurrency: Top 3 Coins That Could Hit ATH In The Coming Week\n\nEthereum Price Prediction for the week\n\nAs investors and traders closely monitor Ethereum’s price action, cryptocurrency experts at Changelly have shared their predictions for the week. According to their analysis, ETH is expected to reach a minimum price of $3,637 and a maximum price of $3,726. The average price is expected to be $3,680.\n\nThe recent surge in Ethereum’s price has been largely attributed to the growing expectations of ETH exchange-traded fund (ETF) approval. However, the current market sentiment, coupled with Bitcoin’s struggle to push further highs, has dampened the likelihood of ETH surpassing the $4,000 mark this week.\n\nAlso read: Can Shiba Inu (SHIB) Hit $0.00005 This Week?\n\nDespite the recent price setback following the Dencun upgrade, Ethereum remains one of the most promising and influential blockchain projects in the cryptocurrency space. Its robust ecosystem, which hosts a wide array of decentralized applications (dApps), decentralized finance (DeFi) protocols, and non-fungible tokens (NFTs), continues to drive innovation and adoption.\n\nHowever, Ethereum also faces challenges, such as high gas fees and scalability issues, which have led to the rise of competing blockchain networks.\n\nWhile the recent drop in Ethereum’s price following the Dencun upgrade may be disappointing for some investors, it is essential to view the cryptocurrency market’s volatility in the context of its long-term potential.\n\nAlso read: Solana Breaches $200, But Analyst Warns Investors To Stay Out of SOL\n\nEthereum’s fundamental strengths, including its large developer community, robust ecosystem, and commitment to sustainability, position it well for future growth and adoption."
    }
]