[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNbVdjcjdvOUcxM3VwakpzSl9qUlgwX0tTZXhKV3o3V3k5bHNkcTViVFc4NWZDbC15Vy1scUo0a2tYdmNTOWRhWENISmpITWhYd2ZFVUlodTlVUGw5QkpaOHMyMXZVVlE0OEVJYU1CUDJDY3VSSVE3STh0RDFtRmEzQXAzc2dXcjFlSkJZajJqNDc0cjB3c05CODhyQVg5MmxrMUVjeFlzT2oyejg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum-Bitcoin ratio drops to historic low as ETF approval speculation heightens - CryptoSlate",
        "content": "Ethereum’s value against Bitcoin has dropped to historical lows as market anticipation grows for an imminent launch of a spot exchange-traded fund in the U.S.\n\nData from Paris-based crypto intelligence platform Kaiko showed that the ETH/BTC ratio has steadily declined since the smart-contract-enabled blockchain transitioned into a proof-of-stake network in September 2022. During the last 24 hours, the metric dropped to 0.048, its lowest point since May 2021.\n\nThe ETH/BTC ratio is a crucial measure for gauging Ethereum’s performance in relation to Bitcoin. When this ratio rises, Ethereum gains strength or maintains its value better than Bitcoin, suggesting a market preference for ETH over BTC.\n\nConversely, a decrease in the ETH/BTC ratio indicates Ethereum’s weaker performance compared to Bitcoin, potentially signaling investor leanings toward the perceived safety of Bitcoin.\n\nThis ratio goes beyond mere price movements as it encapsulates shifts in investor confidence and market sentiment between these two prominent cryptocurrencies.\n\nCryptoSlate’s data shows that BTC’s price has greatly outperformed Ethereum’s over the past year. During the period, the top cryptocurrency’s price rose by more than 170% to a 21-month high of more than $47,000, while ETH was able to post a modest gain of 74%.\n\nBTC’s positive run could be attributed to the surrounding market optimism and demands for the potential approval of a spot ETF. Over the past several months, several asset managers, including BlackRock, VanEck, Grayscale, and others, have actively engaged the U.S. Securities and Exchange Commission (SEC) over the applications, fueling speculations that these products could begin trading as early as Jan. 11.\n\nOn the other hand, Ethereum’s lukewarm price performance came amid the launch of several futures-based ETFs for the digital asset last year. These ETFs barely made a ripple in the market as they saw tepid demand, forcing asset manager CoinShares to describe ETH as the “least loved altcoin” compared to rivals like Solana.\n\nMentioned in this article"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNbVdjcjdvOUcxM3VwakpzSl9qUlgwX0tTZXhKV3o3V3k5bHNkcTViVFc4NWZDbC15Vy1scUo0a2tYdmNTOWRhWENISmpITWhYd2ZFVUlodTlVUGw5QkpaOHMyMXZVVlE0OEVJYU1CUDJDY3VSSVE3STh0RDFtRmEzQXAzc2dXcjFlSkJZajJqNDc0cjB3c05CODhyQVg5MmxrMUVjeFlzT2oyejg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum-Bitcoin ratio drops to historic low as ETF approval speculation heightens - CryptoSlate",
        "content": "Ethereum’s value against Bitcoin has dropped to historical lows as market anticipation grows for an imminent launch of a spot exchange-traded fund in the U.S.\n\nData from Paris-based crypto intelligence platform Kaiko showed that the ETH/BTC ratio has steadily declined since the smart-contract-enabled blockchain transitioned into a proof-of-stake network in September 2022. During the last 24 hours, the metric dropped to 0.048, its lowest point since May 2021.\n\nThe ETH/BTC ratio is a crucial measure for gauging Ethereum’s performance in relation to Bitcoin. When this ratio rises, Ethereum gains strength or maintains its value better than Bitcoin, suggesting a market preference for ETH over BTC.\n\nConversely, a decrease in the ETH/BTC ratio indicates Ethereum’s weaker performance compared to Bitcoin, potentially signaling investor leanings toward the perceived safety of Bitcoin.\n\nThis ratio goes beyond mere price movements as it encapsulates shifts in investor confidence and market sentiment between these two prominent cryptocurrencies.\n\nCryptoSlate’s data shows that BTC’s price has greatly outperformed Ethereum’s over the past year. During the period, the top cryptocurrency’s price rose by more than 170% to a 21-month high of more than $47,000, while ETH was able to post a modest gain of 74%.\n\nBTC’s positive run could be attributed to the surrounding market optimism and demands for the potential approval of a spot ETF. Over the past several months, several asset managers, including BlackRock, VanEck, Grayscale, and others, have actively engaged the U.S. Securities and Exchange Commission (SEC) over the applications, fueling speculations that these products could begin trading as early as Jan. 11.\n\nOn the other hand, Ethereum’s lukewarm price performance came amid the launch of several futures-based ETFs for the digital asset last year. These ETFs barely made a ripple in the market as they saw tepid demand, forcing asset manager CoinShares to describe ETH as the “least loved altcoin” compared to rivals like Solana.\n\nMentioned in this article"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPY09USnNtNTMwYjQ2dFZUMThYaUl5N25CRnA3WjZBQ1c2N3ptR1ZnM0lsd1lkZHhnVzhhcF85Zk1oRHhycmZwM1RpTUpEQXdxckNyVmNsV0JEWDI5UmU1ZExzM0dNZXppamlmcWlIZ3Q1RElRYzF6cnZEanNlejU4djNNNk5OdFBvUm12cnhqWVpLT2pkdHRiWUdjaGhHWHpE0gGmAUFVX3lxTE84S0k2ZWpYRUNXRUdJTFJlSmRlRVo0WkNBeERjSzdlY0N1SW5lc2dfMkpnbU9GSzhPU1FBVW5fSnA1M2ZCaVdvRUUxd055YXBzTHZTUi1STGcwSzNKQTlUNll0XzQyQ0JBcU1KTkVzTVRMUE44MlliZmxLcVliSDgwYTgxTFhoNlhNeTVRUHZlMDZyV1AxSXp2Z1lxQ3NYd0FFdWFYaFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Fantom Founder Andre Cronje Reflects On Bitcoin & Ethereum’s State Bloat Problem - CoinGape",
        "content": "Fantom co-founder Andre Cronje, known as the godfather of decentralized finance (DeFi), further raised concerns over probabilistic finality in blockchains including Bitcoin and Ethereum as the market sees expanding use cases and adoption in traditional finance. He said Fantom has already solved state bloat as Ethereum developers look to solve state bloat in the chain.\n\nAndre Cronje Says Fantom Has Resolved S tate Bloat Issue\n\nIn response to Ambient Finance founder Doug Colkitt’s belief that Ethereum is the only chain looking to solve state bloat in its long-term plan, Andre Cronje said “I am pretty confident in saying we already solved state bloat at Fantom.”\n\nadvertisement\n\nEthereum roadmap entails using Verkle trees to allow for “data to be small enough to be attached to every block.” It could help validators and nodes to become stateless as all ‘state’ can be stored more efficiently off-chain.\n\nHowever, Andre Cronje said any blockchain that uses probabilistic finality or any variant of the longest chain rule won’t resolve this issue. Bitcoin and Ethereum chains depend on probabilistic finality. Finality refers to when a block of transactions is considered permanent and cannot be altered or reversed.\n\nFantom uses aBFT (Asynchronous Byzantine Fault Tolerance) consensus mechanism, which does not require the longest chain rule.\n\nMoreover, Fantom introduced the new database Carmen, a flat storage method that does not use tree or dictionary structures while maintaining a cryptographic signature of the world state. This greatly reduces the bloat of the current active state (two epochs). Carmen supports real-time pruning, and although archive nodes still need to retain all data, most validators can enable pruning.\n\nAfter adopting the above technology, Fantom’s status is reduced from about 2TB (archive) to 60GB (archive). Cronje said state bloat has been one of Fantom’s core milestones since its early days.\n\nAlso Read: BlackRock And VanEck Files Updated S-1 For Spot Bitcoin ETF Approval\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQRGY1dzdOSkxLZ3M4dEZyckpXY3BwMTl6Qko1dGRvU3JuSWowdjE4RzRfMXRpbjBfNWNKR0dlSDRucDdDd0Vmend3aTFST3VQNG54Y1JaMEpOX3JvLTBnVUdjbTFoYWhra3VPeFNINVVIZDh1VUVQcWNHUkNBY0R1bXRJc0ZuTGk3d0NxRzk1b0dxNy1UTi1r0gGcAUFVX3lxTE8wX2VINVEta2ZyWVNLQTVQR1VHZ29XSlNhekUtWUFHQnZNTFlya2NPOHcxOENZVTh2RzJLdEw4YktNbjNfa3FHZ3N0N1NNWWp0c0VkemlBWHdOQU1sZmlUcTFxR0NEMlpvdEkwY2hLZ294d3d5S2dBcHBxdUowWVppVUtoM19fZmRBTE1iYmN0Sno3REMzTEd5WVBpcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Scam Alert: Crypto Hackers Lure Ethereum, Solana & Tron Communities Into Fake Airdrop - CoinGape",
        "content": "Wallet drainers have now started targeting Ethereum (ETH), Solana (SOL), and Tron (TRX) communities to execute phishing scams. Earlier, they focused on conducting crypto scams via EVM chains. However, the trend has changed after they expanded their reach into well-established crypto groups.\n\nAlso Read: Crypto Scam: Trading Platform Coinspaid Might be the Latest Victim\n\nadvertisement\n\nOverview of Wallet Drainers’ Airdrop Scam\n\nAccording to a post by Scam Sniffer on X, phishing scams have been initiated by attracting crypto enthusiasts via fake airdrops. They have designed a webpage wherein one can claim Ethereum, Solana, and Tron airdrop rewards.\n\nThe scammers term the airdrop scam as an “exclusive opportunity” for the community. Moreover, they encourage people to connect their primary wallet to be able to access these airdrops. In addition, Scam Sniffer noted that these fraudsters can drain various types of crypto wallets via this webpage.\n\nThis update is an alarming one considering the popularity of Ethereum, the second-largest crypto, Solana, and Tron. It could instill crypto investors into believing such wallet drainers in anticipation of high-end crypto rewards. Thereby, millions and billions of digital asset investments could be wiped off owing to such wallet drainer scams.\n\nHowever, it is possible to identify such scams via a few checks. The snapshot shared by Scam Sniffer shows that the concerned airdrop scam webpage has grammatical errors, which could be a way to be safe from such fraudsters. But, they can upgrade their strategies from time to time.\n\nHence, it’s always better to check the source of such links. If a trusted entity isn’t posting such airdrop updates, then avoid such offerings completely. Moreover, it’s time to be even more cautious since hackers have been hacking reputed companies’ X (formerly Twitter) accounts to promote crypto scams.\n\nCertik and Mandiant Official X Accounts Get Hacked\n\nEarlier this month, Certik, a blockchain audit firm, witnessed its X account being hacked. Thereafter, malicious links were posted that promised people to return the digital assets they lost to various crypto scams. The dubious link was available on their website for quite sometime before the Certik team managed to regain access.\n\nThe X account of Mandiant, a cybersecurity company, was successfully reclaimed by its rightful owner on January 4, 2024, after falling victim to hacking. The incident unfolded over several hours on X, with users presenting evidence of the account takeover. The attackers, posing as the Phantom, a non-custodial crypto wallet, used the compromised Mandiant X account to promote a cryptocurrency scam.\n\nAlso Read: Just In: Founder of ACE Crypto Exchange Arrested for Fraud\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxQY3EzdXhHeUMtcFkwa3BCMXhZVU5HZFNIQkk1LUJsSk1yMDVDNWpJTmc2SzBFd21LVElsZVFIVDRQT3ZPZTJLSl9aWDRPUG5IZ1VCVlRwYmZiQWFmM0RwV01Dd0FRNjVjanJtdFdPSk1JbWRfLVAtLUhodHZQMlQwTmJiVFpmYTZKMi1qSVVDbHRQaTZjWG55bC00d240YVhNb1FmNlZjOTdTRXBxbHNrVEE1b09ET09VV1lRcWF3RUdMNE5nLS1vOHE4ckh0RC1MR3NxREN4bmYzWEdOYTZkc2dFUWt0NVhNUEItVm1SUGpRQVN1V1k40gH8AUFVX3lxTE42VnY2YU9oak1XV09FVUI5LWVfYjhwcHBmZTF4cUswNEt0TnBjLV9RT1RNSHluVTh6S2RjX0RFWXN0eTFuWG9QaVRwV2VxNTdXUVh3WloyYUxNSk9oUUEtakxLTTRVdzN6cng4X1c1REJLMk5HekVIN0ZoamtRSEZuMnlhZTdUaW82RXNHSzVGS0FYOVU5TUVXVHM3OVk0TzFLMWZ0a2xFOU56bnFrWWFjdFVnLWhWZlFGTkVVVDRyVFNxWllYSFpWQy1Mb25xOGpDMnR3M1lzT0xGVDNSVFE5ZmcyLWw0ZWFLT3F5SVMyaEcweGtaSU1kMWlNUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Rises Above $47,000 For The First Time Since April 2022 - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, managed to touch the $47,000 mark early Tuesday, before settling down at around $46,800 at the time of writing. The coin managed to achieve the $47k high for the first time since April 2022. As was expected, the buildup to the possible approval of BTC spot exchange-traded funds (ETFs) by the US Securities and Exchange Commission (SEC) continues to keep the interests of investors buoyed. Popular altcoins — including the likes of Ethereum (ETH), Ripple (XRP), Litecoin (LTC), Solana (SOL), and Dogecoin (DOGE) — landed in the greens across the board. Memecoin BONK became the biggest gainer of the lot, with a 24-hour jump of over 27 percent.\n\nThe global crypto market cap stood at $1.72 trillion at the time of writing, registering a 24-hour dip of 6.86 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $46,790.79, registering a 24-hour gain of 7.61 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 41.80 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,307.31, marking a 24-hour jump of 5.19 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.06 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour gain of 4.96 percent, as per CoinMarketCap data, currently priced at $0.08034. As per WazirX, Dogecoin price in India stood at Rs 7.20.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour jump of 6.94 percent. At the time of writing, it was trading at $67.06. LTC price in India stood at Rs 5,918.70.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5735, seeing a 24-hour gain of 1.68 percent. As per WazirX, Ripple price stood at Rs 50.68.\n\nSolana (SOL) Price Today\n\nSolana price stood at $101.84, marking a 24-hour jump of 15.83 percent. As per WazirX, SOL price in India stood at Rs 8,999.\n\nTop Crypto Gainers Today (January 9)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nBonk (BONK)\n\nPrice: $0.00001248\n\n24-hour gain: 27.81 percent\n\nAstar (ASTR)\n\nPrice: $0.1495\n\n24-hour gain: 27.28 percent\n\nBitcoin SV (BSV)\n\nPrice: $89.67\n\n24-hour gain: 25.29 percent\n\nStacks (STX)\n\nPrice: $1.99\n\n24-hour gain: 23.75 percent\n\nInternet Computer (ICP)\n\nPrice: $13.13\n\n24-hour gain: 23.27 percent\n\nTop Crypto Losers Today (January 9)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nGMT (GMT)\n\nPrice: $0.3485\n\n24-hour loss: 6.06 percent\n\nMina (MINA)\n\nPrice: $0.9865\n\n24-hour loss: 14.10 percent\n\nInternet Computer (ICP)\n\nPrice: $10.71\n\n24-hour loss: 13.24 percent\n\nGala (GALA)\n\nPrice: $0.02317\n\n24-hour loss: 13.19 percent\n\nConflux (CFX)\n\nPrice: $0.1707\n\n24-hour loss: 12.95 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin has surged beyond the $47,000 mark within the last 24 hours, fueled by growing optimism among investors regarding Bitcoin spot ETFs. The upcoming SEC decision on Bitcoin ETF approval, anticipated this week, has the market eagerly awaiting. BTC has maintained an upward trend for the last five days, marking a 10 percent increase month-to-date and an impressive 173 percent rise year-to-date. If the current price level holds, the next hurdle lies at $49,000.”\n\nCoinSwitch Markets Desk noted, “The crypto market experienced a rise of 5.8 percent in the last 24 hours, resulting in a total market capitalization of $1.8 Trillion. The crypto fear and greed index is highly positive and has jumped by 6 points as compared to yesterday. With just one day to go for SEC’s decision on ARK/21 Share’s Bitcoin ETF, SEC Chief Gary Gensler posted a series of posts on Twitter mentioning the risks associated with cryptocurrency investments. If history is to be repeated this might be considered a positive sign as in Oct 2021 a similar post was made by SEC’s investor education account, a day before the first Bitcoin futures ETF became effective.”\n\nRajagopal Menon, Vice President, WazirX, said, “Bitcoin has surged up to $47,000, indicating a bullish sentiment among investors. This rally has sparked anticipation about the digital currency potentially reaching $48,000 soon. A key catalyst propelling this momentum is the fervent speculation surrounding the potential introduction of a Bitcoin ETF, which has garnered considerable attention and excitement.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin's surge past $47,000 is attributed to expectations that the US SEC will approve a spot bitcoin ETF this week. With a 7 percent daily gain and an 87 percent increase since September 2023, the market is expecting a historic moment after the ETF's approval. Applicants such as BlackRock and Fidelity, which are updating their filings and disclosure fees, have fueled FOMO as analysts predict spot bitcoin ETFs will attract significant demand and legitimacy, easing investor scepticism. Standard Chartered predicts an inflow of $50-100 billion in 2024 and a potential BTC price of $200,000 by 2025. Traders are trying to stop this rise, looking for short-term profits towards $48,500 and the psychological level of $50,000. However, caution prevails with expectations of choppy conditions and potential profit-taking, while the long-term outlook appears bullish, driven by factors such as the Fed tapering cycle, Bitcoin rate halving and growing institutional adoption via new ETFs.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The overall crypto market witnessed a mini rally as the deadline for SEC approval for Bitcoin ETF nears. The total crypto market cap touched the $1.72 trillion mark with Bitcoin and Ethereum jumping by almost 8 percent and 6 percent respectively. Any confirmation of ETF approval by the SEC will push the market higher and it may lead to a market-wide rally. It is important to note that Bitcoin has surged by 10 percent since the beginning of 2024.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    }
]