[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE0wVWw3bkZITFE1YjRYV2ZnbTJHLVBKdTl0Tkk1T2Z1SDdfc0RlSVkzX2RQTVJUbW95dlV1QU95YjA5ZlhVbF9Jd1FGSUpXQmZaSV93bFhNSzB2a3dxZWZkdGxn0gFnQVVfeXFMTUVXM09ONTdOREEtcXVERUhSM3NhbURaNGFEZUZzMlJhemNmVnpUSmZORXkwRmJxTDlsSWktWkhGVXU4bThyQnhKWUc0bFFueVJkM0pHYVdEekpWWGFENFBFX2d5V1Jxbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "New Crucial Ethereum Update Released - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nGo Ethereum has announced the launch of Geth v1.13.12, preparing the ecosystem for a major upgrade scheduled for March 13, 2024.\n\nAdvertisement\n\nGeth v1.13.12 incorporates the mainnet fork number for Cancun, marking a decisive step toward implementing a suite of evolutionary Ethereum Improvement Proposals (EIPs). The specifications, which are publicly accessible for review, introduce pivotal changes that promise to refine the operational mechanisms of the Ethereum Virtual Machine.\n\nAmong the notable EIPs included in this update are:\n\nEIP-1153: Introducing transient storage opcodes for optimized data handling. Advertisement\n\nEIP-4788: Incorporating the Beacon block root within the EVM, enhancing interoperability between Ethereum and its Beacon chain.\n\nEIP-4844: Facilitating Shard Blob Transactions to enable sharding and improve scalability.\n\nEIP-5656: Adding a new memory copying instruction, MCOPY, for more efficient data processing.\n\nEIP-6780: Restricting the use of SELFDESTRUCT to the same transaction, improving system resilience.\n\nEIP-7516: Introducing the BLOBBASEFEE opcode to calculate base fees for blob transactions.\n\nThe release also resolves a critical bug related to Geth miner tip enforcement, ensuring the network operates more reliably.\n\nAccompanying the Cancun upgrade, Go Ethereum is providing updated Grafana dashboards for InfluxDB and Prometheus, allowing users to monitor network performance with greater precision. The release packs an array of various improvements, which can be found on the official announcement page on GitHub.\n\nThis Ethereum client update is a testament to the continuous evolution of the Ethereum ecosystem, reflecting the dedication of developers to enhance the blockchain’s capabilities. With these changes, Ethereum takes a step closer to its vision of a more efficient, scalable and interoperable network."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE0wVWw3bkZITFE1YjRYV2ZnbTJHLVBKdTl0Tkk1T2Z1SDdfc0RlSVkzX2RQTVJUbW95dlV1QU95YjA5ZlhVbF9Jd1FGSUpXQmZaSV93bFhNSzB2a3dxZWZkdGxn0gFnQVVfeXFMTUVXM09ONTdOREEtcXVERUhSM3NhbURaNGFEZUZzMlJhemNmVnpUSmZORXkwRmJxTDlsSWktWkhGVXU4bThyQnhKWUc0bFFueVJkM0pHYVdEekpWWGFENFBFX2d5V1Jxbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "New Crucial Ethereum Update Released - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nGo Ethereum has announced the launch of Geth v1.13.12, preparing the ecosystem for a major upgrade scheduled for March 13, 2024.\n\nAdvertisement\n\nGeth v1.13.12 incorporates the mainnet fork number for Cancun, marking a decisive step toward implementing a suite of evolutionary Ethereum Improvement Proposals (EIPs). The specifications, which are publicly accessible for review, introduce pivotal changes that promise to refine the operational mechanisms of the Ethereum Virtual Machine.\n\nAmong the notable EIPs included in this update are:\n\nEIP-1153: Introducing transient storage opcodes for optimized data handling. Advertisement\n\nEIP-4788: Incorporating the Beacon block root within the EVM, enhancing interoperability between Ethereum and its Beacon chain.\n\nEIP-4844: Facilitating Shard Blob Transactions to enable sharding and improve scalability.\n\nEIP-5656: Adding a new memory copying instruction, MCOPY, for more efficient data processing.\n\nEIP-6780: Restricting the use of SELFDESTRUCT to the same transaction, improving system resilience.\n\nEIP-7516: Introducing the BLOBBASEFEE opcode to calculate base fees for blob transactions.\n\nThe release also resolves a critical bug related to Geth miner tip enforcement, ensuring the network operates more reliably.\n\nAccompanying the Cancun upgrade, Go Ethereum is providing updated Grafana dashboards for InfluxDB and Prometheus, allowing users to monitor network performance with greater precision. The release packs an array of various improvements, which can be found on the official announcement page on GitHub.\n\nThis Ethereum client update is a testament to the continuous evolution of the Ethereum ecosystem, reflecting the dedication of developers to enhance the blockchain’s capabilities. With these changes, Ethereum takes a step closer to its vision of a more efficient, scalable and interoperable network."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQS0dkNzZlRFhqc25oT19tT0JlUWJobWlWN0lId3NadVlzUW9EeW5RSF9XVEJvSG9JY0QtUzJtOW9SamxualptSGd4U1lzTVFpVnplcHRVNHZ6QnUyZ05Ec0VqeDNqTEc5a0lrdVI3SjR1MGQxNmprcWNBdVRKUXh4RENoWk9vQdIBiwFBVV95cUxPMndRQzMtbUl6SzhHZzJueVdXc0JUVDdGQzJubW0ya2x3VlBpdzhqbzdmc1I1Z1lCY2RtZ0FiOXlER3YzT3Y0RWFscTZ5MWdyWXNlNGdTS0VKYzVCdnZpZklENzBRM0RPSUJwak01bDAyVDFaWE52TkVBTGhxMjJIS2NBaEd4Z1dibF9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "Why Arbitrum seems to be the most desired chain for DeFi - AMBCrypto News",
        "content": "Arbitrum accounted for over 50% of ETH’s total transaction volume across top optimistic rollups.\n\nArbitrum had the highest TVL among all ETH scaling solutions.\n\nDespite the emergence of several Ethereum [ETH] scaling solutions in the past year, Arbitrum’s [ARB] dominance in the landscape has remained largely intact.\n\nArbitrum scales Ethereum and how!\n\nAccording to on-chain analytics firm IntoTheBlock, the layer-2 (L2) blockchain accounted for over 50% of ETH’s total transaction volume across top optimistic rollups, including Optimism [OP] and Base.\n\nHowever, it should be noted that in the broader L2 market, Arbitrum lost out its transaction dominance to zk rollup, zkSync Era.\n\nAccording to AMBCrypto’s examination of L2Beat data, Arbitrum clocked a little over 24 million cumulative transactions in the past month. This paled in comparison to zkSync Era’s 30-day tally of 41.3 million.\n\nThe significant disparity in transaction numbers was due to the difference between the fees on the two scaling solutions. AMBCrypto noticed through L2 Fees that a user had to pay $0.14 on Arbitrum to send ETH while the same task could be performed on zkSync Era at a 64% discount.\n\nHowever, Arbitrum proponents in particular, and those of L2 in general, have pinned their hopes on the upcoming Dencun upgrade. The watershed technical transformation was expected to bring about a 10x drop in L2 transaction fees.\n\nL2 transaction fees are expected to drop by 10x from a current average of $0.23 thanks to the upcoming Ethereum Dancun upgrade. pic.twitter.com/9GuLgxky08 — IntoTheBlock (@intotheblock) February 10, 2024\n\nArbitrum outshines competition in DeFi\n\nWhile Arbitrum trailed zkSync Era in network traffic, the former was still the decentralized finance (DeFi) leader in the L2 ecosystem.\n\nAccording to AMBCrypto’s analysis of Artemis data, Arbitrum had over $2.7 billion in total value locked as of this writing. This was head and shoulders above the competition.\n\nFathom this – the combined TVL of the next three scaling solutions in the list was still less than Arbitrum’s tally.\n\nAnother dominant aspect of Arbitrum’s DeFi game was the performance of its decentralized exchanges (DEXes). As seen from the graph above, Arbitrum has solidified its position as the top L2 in DEX volume.\n\nIn fact, Arbitrum DEXes facilitated trades worth over $1.7 billion over last week. In contrast, DEXs on Base and zkSync Era couldn’t even cross $300 million.\n\nRealistic or not, here’s ARB’s market cap in BTC terms\n\nARB lifts 8.5% over the week\n\nAs of this writing, the native token ARB was trading in the green, with weekly gains of 8.5%, according to CoinMarketCap.\n\nThe jump in ARB value could be just sentiment-driven. As is well-known, ARB doesn’t accrue any value from Arbitrum’s on-chain activity and functions just as a governance token."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNOU93MjFvTUFjaFRRWGphQ292R2ZnWXpwV090bGZYOHZPQTZVX1Eyb3dMSVZRYVZzTHU4TzM4bS10aXZSRHI5RGg3aTJMcWVkai1YWXpPbGtGYWJjSElOekM1M2MyLWJpcTM0R3ZEOVBjUEJSM3kxanVTOXl0S1FIaFhZMktDNGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "Ethereum in danger? The Geth monopoly is worrying! - Cointribune EN",
        "content": "Sun 11 Feb 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nGeth, short for Go Ethereum, is an open-source software client for the Ethereum network. It is a crucial tool for Ethereum developers, miners, validators, and users. Its popularity is due to the numerous crypto benefits it offers. However, over-reliance on this tool can be harmful, according to warnings from several analysts.\n\nA Challenge Involving Ethereum that Endangers Crypto Exchanges\n\nCoinbase, Kraken, and several other major players in the crypto sphere are facing a critical issue within the Ethereum network. It’s their over-reliance on a single software client named Geth.\n\nThis dependency poses significant risks. Experts warn against the potential catastrophic consequences if a bug were discovered in Geth. As a reminder, this client is used by nearly 80% of Ethereum validators!\n\nRecent incidents, such as a bug in the less frequently used software Nethermind, have already highlighted the vulnerability of the Ethereum ecosystem. With Geth dominating the crypto activities involving validators, any bug in this software could disrupt the processing of transactions.\n\nAnalysts are apprehensive of this prospect. According to them, such a scenario would have severe consequences for the crypto industry players. Moreover, such an incident could result in losses for investors and even lead to a fragmentation of the network.\n\nMany Ethereum validators use the same software, fueling worries about what happens if there's a bug https://t.co/Efrroa4iSs — Bloomberg Crypto (@crypto) February 8, 2024 Coinbase and Kraken are looking for alternatives to Geth to diversify and secure operations on Ethereum\n\nPalliative Initiatives Are Taking Shape\n\nIt must be said that some crypto industry players seem to grasp the magnitude of the situation. Criticisms about the lack of diversity among client software used by validators have spurred some crypto providers to explore alternative solutions.\n\nConsequently, Coinbase and Kraken are actively considering the integration of smaller software clients into their platforms to mitigate risks associated with Geth’s dominance. This already marks the beginning of a response to these growing concerns.\n\nBut the urgency to meet these diversification challenges in a sustainable way is evident. Especially when considering the significant financial stakes involved and the broader implications for the stability and growth of Ethereum.\n\nUltimately, the realization of these diversification efforts and increased vigilance are essential to ensure the stability and long-term success of crypto platforms. But also, more broadly, of the crypto ecosystem itself.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOTTIxOEs0aTlBYmlmeHZPOWFPZGdIekZ3MWxxN3lSZ3ctdnd3NF9sSFIzX0k2cUNmNnpzb1BYV0c0aGxJaWJkczcyVEY0aDNXVnhYV3dGMjdDYXBDYmJ0bVR0T2dMNHotUmV0VzhMcUkycmpDWUF5cjhiQTU0dVFmemNEN1RoMGVsSWktajB0OUw3bU5VdFl1NUJoY202aUZENVZnMFBHc1NLdnFuOUhCMG9sb9IBuAFBVV95cUxPTEU2X09KNWdCT2ZkLXhQdzE1SFNtU1NaWFQ3VHN3aHdPbFBSRjNKTGNZTEYtUkpSaVI5RFpsUFZYa0pJeWFYNGZ3QTFMUWNYRnpocGdSbE44SDRmRXFvclVid09FMXlkaGZCR2pVdWpzRlJ2Nzhua0pUcTNXRGVLa0pkMzZhRGlEUWF5RGJTTmk1bGNfekU2MjJ0OWI3b0hXQjAxLXlZZERWOGRwd2x2V25MaUF1WS1m?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "$3,000 Is Next for Ethereum (ETH), Cardano (ADA) Shows Massive Breakthrough, Solana's (SOL) Suspicious Rally - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAs the Ethereum network continues to evolve with its recent ERC-404 token standard being massively implemented, its native asset is finally gaining some traction on the market. It is showcasing promising growth, and its price trajectory suggests that the coveted $3,000 mark may be on the horizon.\n\nAn analysis of Ethereum's price chart reveals a steady upward trend, with the asset recently crossing the $2,500 threshold. The next significant resistance level appears to be at $2,600, a point that has previously seen sellers stepping in. A break and hold above this level could pave the way for Ethereum's ascent toward the $3,000 psychological and technical barrier.\n\nSupporting this potential growth scenario is the continued development of the Ethereum network, including the anticipated benefits of the ERC-404 update. This new standard is expected to enhance the utility and interoperability of tokens on the Ethereum blockchain, potentially increasing demand for ETH as the required \"fuel\" for deploying tokens.\n\nAdvertisement\n\nHowever, there remains a cautionary scenario to consider. Ethereum's rival, Solana, has recently experienced a slowdown due to network outages, which could potentially cause a ripple effect across the broader crypto market. If such events lead to a loss of confidence in blockchain networks or a shift in investor sentiment, Ethereum could face a setback.\n\nA potential price drop scenario could be triggered by technical rejections at the $2,600 resistance level, coupled with negative market sentiment stemming from issues in competing blockchains like Solana. Should Ethereum fail to sustain its momentum, a pullback toward the local support level at $2,300 may occur, where buyers have previously shown interest.\n\nCardano remains strong\n\nCardano (ADA) has recently demonstrated a significant breakthrough in price action, suggesting a bullish trend could be forming. Cardano's price has been tracing an upward trajectory, recently punctuating this ascent by breaching a key resistance level.\n\nA technical analysis of ADA's chart indicates that the cryptocurrency has managed to surpass the resistance near $0.515, which had previously capped several attempts at an upward move. Closing above this level could signal newfound confidence among investors and pave the way for further gains.\n\nOn the growth front, if ADA sustains its momentum above this resistance turned support level, the next target for the asset could be the $0.580 mark. Such a move would represent a significant uptick in market valuation and could attract more attention to Cardano as a viable investment in the blockchain space.\n\nHowever, every market scenario has its counterpart. Should ADA face rejection at higher levels, there is potential for a pullback toward the local support at $0.485. A drop below this point might compel traders to reassess the short-term outlook for Cardano, potentially leading to a consolidation phase or even a deeper correction if broader market sentiment turns negative.\n\nSolana slows down\n\nThe recent price movements of Solana have caught the eye of many in the cryptocurrency community, with its ascent on the charts prompting discussions around the sustainability of its rally. Despite the uptick, there is a pervading sentiment of caution as the momentum behind the rise appears to lack conviction.\n\nAn analysis of Solana's trading patterns reveals that while SOL has made strides to overcome resistance, achieving a local high of approximately $112, the rally's foundation seems tenuous. The support level to watch is around $98.89, where SOL has previously found a degree of stability. Should the asset maintain above this level, it might dispel some of the skepticism surrounding its recent performance.\n\nHowever, the growth scenario for Solana is shadowed by concerns of a potential breakdown. The momentum indicator on the charts suggests that the energy behind the rally is not as robust as investors might desire. If Solana fails to sustain the buying pressure needed to push higher, it could see a retreat back to the support level or even lower, which might trigger a more pronounced sell-off."
    }
]