[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxObjFVNF82dEwtUTFOdXJDTjJUTkt0ekFtNFh0TGg3SHpaNllURWw2bU1Ecm01NFk0QlRJeDljdm9hRFNtX0FsUDR5RTJHdDF4NUp2UV9HX3VweVZqYTdPZmpzamRpVlBjZmNDMm5XZlVuczNYYy1kR0kteExnbGozcXRNYmF6X3JXZWdlQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Solana Surges to $84, Flips Ethereum in Weekly DEX Volume - Unchained",
        "content": "Solana’s native token rallied 13% over the last 24 hours, while the blockchain overtook Ethereum in seven-day DEX trading volume.\n\nIt may not be altcoin season just yet, but one of them has already doubled Bitcoin’s percentage gains over the last year.\n\nSolana’s native token SOL is up 580% over a one-year period, gaining 13% in the last 24 hours to trade at $84 at the time of writing.\n\nDaily trading volume for the token was up a whopping 108% to $3.9 billion, making it the third most traded crypto asset outside of Bitcoin, Ethereum and stablecoins like USDT and USDC.\n\nRead more: Solana Mobile Is Making a Second Crypto Smartphone\n\nActivity on the blockchain has also picked up significantly over the last week, with data from DeFiLlama showing that decentralized exchange (DEX) volume on Solana surpassed Ethereum over the last seven days.\n\n🚨BREAKING: Solana Overtakes Ethereum in Weekly DEX Trading Volume for the First Time Ever Solana Now Becomes No. 1 Chain for Both NFT and DEX Daily and Weekly Volume pic.twitter.com/w6dSuEtcUu — SolanaFloor (@SolanaFloor) December 21, 2023\n\n\n\nEarlier this week, Unchained reported that Solana had taken the lead in daily stablecoin transfer volume, which has grown 600% to $16.6 billion since the start of December.\n\nInstitutional data platform Artemis attributed the uptick in the blockchain’s usage to growth of memecoins like BONK and WIF, which created more room for retail activity evidenced by the high number of daily active addresses on the network since the summer of 2022.\n\nThe dog-themed memecoin BONK now has a market capitalization of $1.2 billion, and those cashing out of their holdings will typically convert their coins back into SOL creating a fair amount of buying pressure.\n\nRead more: Paxos Bringing Stablecoin Issuance on Solana, Diversifying Beyond Ethereum\n\nIt is worth noting that the bankruptcy estate in charge of crypto exchange FTX has been approved to sell its $3.4 billion in crypto holdings, of which $1.16 billion is in SOL.\n\nEarlier this month, a wallet associated with FTX unstaked $90 million worth of SOL and sent it to Coinbase, presumably with the intention to sell, meaning that the token has been able to withstand a large amount of selling pressure coming from the exchange’s liquidation plans."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxObjFVNF82dEwtUTFOdXJDTjJUTkt0ekFtNFh0TGg3SHpaNllURWw2bU1Ecm01NFk0QlRJeDljdm9hRFNtX0FsUDR5RTJHdDF4NUp2UV9HX3VweVZqYTdPZmpzamRpVlBjZmNDMm5XZlVuczNYYy1kR0kteExnbGozcXRNYmF6X3JXZWdlQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Solana Surges to $84, Flips Ethereum in Weekly DEX Volume - Unchained",
        "content": "Solana’s native token rallied 13% over the last 24 hours, while the blockchain overtook Ethereum in seven-day DEX trading volume.\n\nIt may not be altcoin season just yet, but one of them has already doubled Bitcoin’s percentage gains over the last year.\n\nSolana’s native token SOL is up 580% over a one-year period, gaining 13% in the last 24 hours to trade at $84 at the time of writing.\n\nDaily trading volume for the token was up a whopping 108% to $3.9 billion, making it the third most traded crypto asset outside of Bitcoin, Ethereum and stablecoins like USDT and USDC.\n\nRead more: Solana Mobile Is Making a Second Crypto Smartphone\n\nActivity on the blockchain has also picked up significantly over the last week, with data from DeFiLlama showing that decentralized exchange (DEX) volume on Solana surpassed Ethereum over the last seven days.\n\n🚨BREAKING: Solana Overtakes Ethereum in Weekly DEX Trading Volume for the First Time Ever Solana Now Becomes No. 1 Chain for Both NFT and DEX Daily and Weekly Volume pic.twitter.com/w6dSuEtcUu — SolanaFloor (@SolanaFloor) December 21, 2023\n\n\n\nEarlier this week, Unchained reported that Solana had taken the lead in daily stablecoin transfer volume, which has grown 600% to $16.6 billion since the start of December.\n\nInstitutional data platform Artemis attributed the uptick in the blockchain’s usage to growth of memecoins like BONK and WIF, which created more room for retail activity evidenced by the high number of daily active addresses on the network since the summer of 2022.\n\nThe dog-themed memecoin BONK now has a market capitalization of $1.2 billion, and those cashing out of their holdings will typically convert their coins back into SOL creating a fair amount of buying pressure.\n\nRead more: Paxos Bringing Stablecoin Issuance on Solana, Diversifying Beyond Ethereum\n\nIt is worth noting that the bankruptcy estate in charge of crypto exchange FTX has been approved to sell its $3.4 billion in crypto holdings, of which $1.16 billion is in SOL.\n\nEarlier this month, a wallet associated with FTX unstaked $90 million worth of SOL and sent it to Coinbase, presumably with the intention to sell, meaning that the token has been able to withstand a large amount of selling pressure coming from the exchange’s liquidation plans."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBzUTJsMHJ5cUJsZ0hRNzZqanhSSlRxTm10SXREdktCUVB0U0lsUVJoU0x1X3A2TXNBWFk0ZGZVWms3c3pybEJqV1JRY0JRdW5LcG9HLWRReF9BMUttcjlvZDNRb1lmT29O0gFuQVVfeXFMTkltcHRCVk15NXZDdC10cGh3X2w4LW85cTluU21pSGluWlhoRkxELXpJVEZPNTktRWxGZzlqTmVQN1pHLWNBa216ckVjcE9tQ3BEUUhYWnRZZmxXNzZxZzNRVmlUY1lHeER5QkFzTHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 21:02:16 GMT",
        "title": "Solana Headed To $100? Here’s What’s Driving The Growth - NewsBTC",
        "content": "Solana (SOL) is flying high at the moment, and from all indications, the crypto token has no intention of slowing down anytime soon as it eyes $100. This is no doubt feasible, considering the several bullish narratives that continue to build up in the Solana ecosystem. Interestingly, SOL recently surpassed XRP to become the fifth-largest cryptocurrency by market cap.\n\nSolana DeFi 2.0 Is No Joke\n\nOn December 16, the official X (formerly Twitter) account for Solana made a post where it stated that “Solana DeFi 2.0 is just getting started.” Indeed, SOL may be up to something as its DeFi ecosystem continues to garner steam. Data from DeFiLlama shows that Solana has been going head to head to Ethereum in terms of DEX volumes on the respective chains.\n\nRelated Reading\n\nCrypto Analyst Says Ignore FUD, XRP Is Headed To $5.85 9 months ago\n\nSolana recently surpassed Ethereum in 7-day DEX volume for the first time in history. SOL has seen about $9.03 Billion in trading volume across all the DEXs on the chain in the last seven days. At the same time, Ethereum saw $8.836 Billion. This is more impressive when you consider the fact that Ethereum houses the most prominent decentralized exchanges.\n\nWith such liquidity flowing into the ecosystem, it is only a matter of time before SolaSOLna hits $100. Data from DeFi Llama also shows that many are doubling their stakes in the Solana ecosystem. At the time of writing, the Total Value Locked (TVL) on Solana stands at $1.20 billion, its highest level since last year.\n\nMuch credit needs to be given to the protocols that continue to build on Solana. One of them happens to be the liquid staking protocol Jito, which has over $570 million locked on its protocol. The DeFi platform recently distributed $225 Million in airdrop to SOL users causing new money to flow into the ecosystem.\n\nSOL price breaks $88 | Source: SOLUSD on Tradingview.com\n\nIs SOL Coming For Ethereum?\n\nFor a long time, Solana has been dubbed the “Ethereum Killer,” but that has never really materialized. The network has for a long time, suffered numerous outages, which made many assume that it could not match Ethereum. However, this time around, there is a growing belief that SOL is well-prepared to live up to the hype.\n\nIt is worth mentioning that the Solana network has been 100% uptime since the last time it recorded a network outage in February this year. This is also more commendable considering the surge in network activity that Solana has experienced in recent times.\n\nRelated Reading\n\nDogecoin Price In Trouble: Whale Transfers 85 Million DOGE To Robinhood 9 months ago\n\nIf Solana is somehow able to put these outages in the past, there is no doubt that people could look to it as a better alternative to Ethereum. An increase in its utility will also undoubtedly increase SOL’s value.\n\nARK Invest’s CEO Cathie Wood recently praised how Solana is “doing a really good job.” She further alluded to the fact that SolaSOLna is even faster and more cost-effective than Ethereum.\n\nAt the time of writing, SOL is trading at around $86, up over 10% in the last 24 hours, according to data from CoinMarketCap.\n\nFeatured image from Disruption Banking, chart from Tradingview.com"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxObDlweWJUam4yVnlIUGpMamk4dGZTNldzektJdklxN3k5b3ZVSk1Tb2tSZjQtczdYTVVydTdPcHdSY1g0YlRib3FTb1dNY3dMM1FGREFoMFhOQ183aWZ0S0Y0c1N5eTlfYktfUEE3aEgtQnVOOVRLOWpDTVFfdUpFdHZfZGl0MG0yTjBlM1M2MnQ2SlliU2J5TGhVTEI5VFQxd0dwQmt6OXlSMFowRU1HQnVxSjBHLUtMZmN0MlFEWHQ4aXFPbWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Il report di Six Degree: la supply delle stablecoin presenti sulla blockchain di Ethereum è in calo - The Cryptonomist",
        "content": "According to the latest report provided by Six Degree, an on-chain data analysis company, the recent crypto market rally has not been supported by a significant influx of capital into the sector, as the supply of stablecoins on the Ethereum blockchain has decreased compared to 2022.\n\nTo tell the truth, the total supply of stablecoins has decreased in recent years, with the only exception being the Tron network, which has seen an increase in this metric.\n\nBUSD and USDC have been the most affected assets by this downward trend, while USDT has strengthened its dominance in the market by increasing its capitalization.\n\nWhat does all this mean for the crypto market? Should we expect a growth of the stablecoin market on the Ethereum blockchain before witnessing the true cryptocurrency bull run?\n\nLet’s see all the details below.\n\nThe latest report from Six Degree highlights a significant drop in the supply of stablecoins on the Ethereum blockchain from 2022 to date\n\nAccording to the latest report from the on-chain analysis company Six Degree, the supply of stablecoins on the Ethereum blockchain has decreased by over 35% since reaching its peak in March 2022.\n\nIn that period, the total supply of fiat-backed stable cryptographic coins on the chain had a value of 108 billion dollars compared to the current 67.5 billion dollars.\n\nThe entire bear market of 2022 was driven by a redemption of these cryptographic assets that were moved from Ethereum to fiat currencies, in a continuous downward trend.\n\nOnly at the end of September/beginning of October 2023 did things start to take a different turn, with the total supply of stablecoins on the blockchain starting to grow again but at a very slow pace.\n\nThis trend has not only affected Ethereum but all decentralized networks that support stablecoins, with the only exceptional case represented by Tron which has seen the aforementioned metric increase by 57% from 2022 to date.\n\nLooking more closely at the composition of the Ethereum stable market, we can see that almost half of these tokens are held in so-called “external owned accounts” (EOA), which are addresses of private users.\n\nA good 30% is managed by centralized exchanges which represent the main trading platforms for exchanges between stablecoins and bitcoin.\n\nFollowing are other entities that own a significant portion of stable on Ethereum: Bridge, DeFi protocols, and multisignature wallets (which usually represent the wallets of crypto project teams).\n\nIt is very interesting to note how the Six Degree report relates the trend of stablecoin supply on Ethereum with the price performance of Bitcoin in recent years.\n\nIn particular, the focus of attention is on the fact that during the last bull market of 2021, the price growth of Bitcoin was accompanied by an increase in the presence of stablecoins in DeFi on the blockchain in question.\n\nAt the same time, the bearish market that started in 2022 saw a strong contraction of these coins in DeFi, which shortly after reached one of the lowest values in recent years.\n\nThe relationship was only recently interrupted with the latest crypto market rally, in which there was no longer the same interdependence between stablecoins in DeFi on Ethereum.\n\nThis is a positive signal for ETH and for the market as a whole: when the stable sector sees a return to the all-time highs of 2022, we can expect a very strong price pump for the major crypto assets.\n\nTether (USDT) supply growing at the expense of USDC and BUSD\n\nTrying to observe the situation more closely, without focusing exclusively on the Ethereum blockchain stablecoin market, let’s see which coins have contributed the most to the contraction of 2022 just described in the previous paragraph.\n\nIt is immediately noticeable that Tether (USDT), after experiencing a slight decrease in its total supply in mid-2022, immediately recovered all the lost ground, even reaching historical highs in terms of market capitalization for stablecoins.\n\nPaolo Ardoino’s currency is therefore the only exception to this trend.\n\nThe largest growth has been in the Tron network, which currently has 48.8 billion USDT, while on Ethereum the currency has barely managed to recover the 2022 highs at 41 billion USDT.\n\nOther blockchains like BSC, Arbitrum, Solana, etc., capitalize on a small percentage of the total supply of crypto held by Tether.\n\nOn the opposite side, we can clearly see that USDC represents one of the main contributors to the decrease in the total supply of stablecoins on Ethereum.\n\nOn this chain, in fact, the currency still has a deficit of 25.6 billion dollars compared to the historical highs of February 2022.\n\nUnlike USDT, the presence of USDC on Tron is non-existent, and in general, the supply of the stablecoin has not recovered from last year’s sharp decline.\n\nThe hope is that the bearish trend can stabilize and that USDC can attract capital that would likely be poured into DeFi applications, giving the right push for a rise in cryptocurrency prices.\n\nAnother protagonist of the reduction of stablecoins on the Ethereum blockchain is BUSD, a resource managed until recently by Binance and issued by Paxos, which a few months ago received a notice from the SEC to cease its activities.\n\nIn particular, Paxos is no longer authorized to issue this type of stablecoin and Binance is obliged to reduce its presence in the market.\n\nDue to these events, the federal agency BUSD has seen a drastic reduction in its market strength, going from 18.19 billion dollars in February 2022 to the current 1.46 billion dollars.\n\nObviously BUSD is destined to disappear."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxObDlweWJUam4yVnlIUGpMamk4dGZTNldzektJdklxN3k5b3ZVSk1Tb2tSZjQtczdYTVVydTdPcHdSY1g0YlRib3FTb1dNY3dMM1FGREFoMFhOQ183aWZ0S0Y0c1N5eTlfYktfUEE3aEgtQnVOOVRLOWpDTVFfdUpFdHZfZGl0MG0yTjBlM1M2MnQ2SlliU2J5TGhVTEI5VFQxd0dwQmt6OXlSMFowRU1HQnVxSjBHLUtMZmN0MlFEWHQ4aXFPbWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Il report di Six Degree: la supply delle stablecoin presenti sulla blockchain di Ethereum è in calo - The Cryptonomist",
        "content": "According to the latest report provided by Six Degree, an on-chain data analysis company, the recent crypto market rally has not been supported by a significant influx of capital into the sector, as the supply of stablecoins on the Ethereum blockchain has decreased compared to 2022.\n\nTo tell the truth, the total supply of stablecoins has decreased in recent years, with the only exception being the Tron network, which has seen an increase in this metric.\n\nBUSD and USDC have been the most affected assets by this downward trend, while USDT has strengthened its dominance in the market by increasing its capitalization.\n\nWhat does all this mean for the crypto market? Should we expect a growth of the stablecoin market on the Ethereum blockchain before witnessing the true cryptocurrency bull run?\n\nLet’s see all the details below.\n\nThe latest report from Six Degree highlights a significant drop in the supply of stablecoins on the Ethereum blockchain from 2022 to date\n\nAccording to the latest report from the on-chain analysis company Six Degree, the supply of stablecoins on the Ethereum blockchain has decreased by over 35% since reaching its peak in March 2022.\n\nIn that period, the total supply of fiat-backed stable cryptographic coins on the chain had a value of 108 billion dollars compared to the current 67.5 billion dollars.\n\nThe entire bear market of 2022 was driven by a redemption of these cryptographic assets that were moved from Ethereum to fiat currencies, in a continuous downward trend.\n\nOnly at the end of September/beginning of October 2023 did things start to take a different turn, with the total supply of stablecoins on the blockchain starting to grow again but at a very slow pace.\n\nThis trend has not only affected Ethereum but all decentralized networks that support stablecoins, with the only exceptional case represented by Tron which has seen the aforementioned metric increase by 57% from 2022 to date.\n\nLooking more closely at the composition of the Ethereum stable market, we can see that almost half of these tokens are held in so-called “external owned accounts” (EOA), which are addresses of private users.\n\nA good 30% is managed by centralized exchanges which represent the main trading platforms for exchanges between stablecoins and bitcoin.\n\nFollowing are other entities that own a significant portion of stable on Ethereum: Bridge, DeFi protocols, and multisignature wallets (which usually represent the wallets of crypto project teams).\n\nIt is very interesting to note how the Six Degree report relates the trend of stablecoin supply on Ethereum with the price performance of Bitcoin in recent years.\n\nIn particular, the focus of attention is on the fact that during the last bull market of 2021, the price growth of Bitcoin was accompanied by an increase in the presence of stablecoins in DeFi on the blockchain in question.\n\nAt the same time, the bearish market that started in 2022 saw a strong contraction of these coins in DeFi, which shortly after reached one of the lowest values in recent years.\n\nThe relationship was only recently interrupted with the latest crypto market rally, in which there was no longer the same interdependence between stablecoins in DeFi on Ethereum.\n\nThis is a positive signal for ETH and for the market as a whole: when the stable sector sees a return to the all-time highs of 2022, we can expect a very strong price pump for the major crypto assets.\n\nTether (USDT) supply growing at the expense of USDC and BUSD\n\nTrying to observe the situation more closely, without focusing exclusively on the Ethereum blockchain stablecoin market, let’s see which coins have contributed the most to the contraction of 2022 just described in the previous paragraph.\n\nIt is immediately noticeable that Tether (USDT), after experiencing a slight decrease in its total supply in mid-2022, immediately recovered all the lost ground, even reaching historical highs in terms of market capitalization for stablecoins.\n\nPaolo Ardoino’s currency is therefore the only exception to this trend.\n\nThe largest growth has been in the Tron network, which currently has 48.8 billion USDT, while on Ethereum the currency has barely managed to recover the 2022 highs at 41 billion USDT.\n\nOther blockchains like BSC, Arbitrum, Solana, etc., capitalize on a small percentage of the total supply of crypto held by Tether.\n\nOn the opposite side, we can clearly see that USDC represents one of the main contributors to the decrease in the total supply of stablecoins on Ethereum.\n\nOn this chain, in fact, the currency still has a deficit of 25.6 billion dollars compared to the historical highs of February 2022.\n\nUnlike USDT, the presence of USDC on Tron is non-existent, and in general, the supply of the stablecoin has not recovered from last year’s sharp decline.\n\nThe hope is that the bearish trend can stabilize and that USDC can attract capital that would likely be poured into DeFi applications, giving the right push for a rise in cryptocurrency prices.\n\nAnother protagonist of the reduction of stablecoins on the Ethereum blockchain is BUSD, a resource managed until recently by Binance and issued by Paxos, which a few months ago received a notice from the SEC to cease its activities.\n\nIn particular, Paxos is no longer authorized to issue this type of stablecoin and Binance is obliged to reduce its presence in the market.\n\nDue to these events, the federal agency BUSD has seen a drastic reduction in its market strength, going from 18.19 billion dollars in February 2022 to the current 1.46 billion dollars.\n\nObviously BUSD is destined to disappear."
    }
]