[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPZlRKRTBNbWE4OEF4YU9qSVVlNDJIVjN4Q2cwanJncXZzU1dzUi0ySnhFVGJ4MGpzaWdWclV6QURWeWtUZlVENDc5MGxySV92dkxuZnhMRWJ6b2JsQ0VCTFJHa0pSZmltY2tEX01UMzJpbnBZeVlnc2h5REJFSm4wU2hpTm5sVzNDX3l1N0RWVEpqQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Ethereum will outperform bitcoin next year and recapture market share in crypto, JPMorgan says - Yahoo Finance",
        "content": ": A photo illustration of the digital Cryptocurrency, Ethereum, is seen on September 13 2018 in Hong Kong, Hong Kong. Yu Chun Christopher Wong/S3studio/Getty Images\n\nJPMorgan analysts expect ethereum to outperform bitcoin next year.\n\nA proposed network upgrade could serve as a catalyst for market share gains, they added.\n\nMeanwhile, JPMorgan is also less bullish on bitcoin's price than others on Wall Street are.\n\nA potential network upgrade for ethereum could be bullish for the crypto next year, according to JPMorgan analysts.\n\nIn their crypto outlook for 2024, they see ethereum beating bitcoin and gaining market share.\n\n\"While we are cautious on overall crypto markets into 2024, we are looking for ethereum to outperform bitcoin and other cryptocurrencies next year helped by the forthcoming EIP-4844 upgrade or Protodanksharding,\" they wrote on Wednesday.\n\n\"Protodanksharding\" is essentially a proposal to reduce transaction costs and boost the number of transactions per second.\n\nThose changes could serve as a catalyst for ethereum to recoup its share of the crypto market by improving network activity.\n\n\"We believe that next year ethereum will re-assert itself and recapture market share within the crypto ecosystem,\" analysts wrote.\n\nEtherum has ridden the wave of the crypto comeback this year, up almost 90% since January. The currency now sits at $2,270. But its gains have lagged behind bitcoin, which has rocketed by around 154%.\n\nThe rally has largely been buttressed by optimism that a spot bitcoin ETF will get regulatory approval soon. But JPMorgan analysts are more skeptical about the bullish bets on bitcoin.\n\nCrypto optimists believe a spot ETF approval would improve liquidity and lower the barrier of entry for more investors to invest in bitcoin without owning the currency. JPMorgan, however, thinks it's not so much new capital that would flow into the crypto as much as it is re-shuffled money from other crypto assets.\n\nAlso fueling the hype in bitcoin is the halving event scheduled for April next year, which tends to reduce the supply of the currency and lift prices. But the more bearish take by JPMorgan analysts is that the quadrennial event has been \"well factored\" into the current price, and the currency won't rally post-halving.\n\n\"We instead look for around 20% drop in the hash rate post halving as miners in higher cost locations or with less efficient hardware would be forced to exit the market,\" they wrote. \"This scenario would be more consistent with around $35k bitcoin price post halving.\"\n\nRead the original article on Business Insider"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPZlRKRTBNbWE4OEF4YU9qSVVlNDJIVjN4Q2cwanJncXZzU1dzUi0ySnhFVGJ4MGpzaWdWclV6QURWeWtUZlVENDc5MGxySV92dkxuZnhMRWJ6b2JsQ0VCTFJHa0pSZmltY2tEX01UMzJpbnBZeVlnc2h5REJFSm4wU2hpTm5sVzNDX3l1N0RWVEpqQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Ethereum will outperform bitcoin next year and recapture market share in crypto, JPMorgan says - Yahoo Finance",
        "content": ": A photo illustration of the digital Cryptocurrency, Ethereum, is seen on September 13 2018 in Hong Kong, Hong Kong. Yu Chun Christopher Wong/S3studio/Getty Images\n\nJPMorgan analysts expect ethereum to outperform bitcoin next year.\n\nA proposed network upgrade could serve as a catalyst for market share gains, they added.\n\nMeanwhile, JPMorgan is also less bullish on bitcoin's price than others on Wall Street are.\n\nA potential network upgrade for ethereum could be bullish for the crypto next year, according to JPMorgan analysts.\n\nIn their crypto outlook for 2024, they see ethereum beating bitcoin and gaining market share.\n\n\"While we are cautious on overall crypto markets into 2024, we are looking for ethereum to outperform bitcoin and other cryptocurrencies next year helped by the forthcoming EIP-4844 upgrade or Protodanksharding,\" they wrote on Wednesday.\n\n\"Protodanksharding\" is essentially a proposal to reduce transaction costs and boost the number of transactions per second.\n\nThose changes could serve as a catalyst for ethereum to recoup its share of the crypto market by improving network activity.\n\n\"We believe that next year ethereum will re-assert itself and recapture market share within the crypto ecosystem,\" analysts wrote.\n\nEtherum has ridden the wave of the crypto comeback this year, up almost 90% since January. The currency now sits at $2,270. But its gains have lagged behind bitcoin, which has rocketed by around 154%.\n\nThe rally has largely been buttressed by optimism that a spot bitcoin ETF will get regulatory approval soon. But JPMorgan analysts are more skeptical about the bullish bets on bitcoin.\n\nCrypto optimists believe a spot ETF approval would improve liquidity and lower the barrier of entry for more investors to invest in bitcoin without owning the currency. JPMorgan, however, thinks it's not so much new capital that would flow into the crypto as much as it is re-shuffled money from other crypto assets.\n\nAlso fueling the hype in bitcoin is the halving event scheduled for April next year, which tends to reduce the supply of the currency and lift prices. But the more bearish take by JPMorgan analysts is that the quadrennial event has been \"well factored\" into the current price, and the currency won't rally post-halving.\n\n\"We instead look for around 20% drop in the hash rate post halving as miners in higher cost locations or with less efficient hardware would be forced to exit the market,\" they wrote. \"This scenario would be more consistent with around $35k bitcoin price post halving.\"\n\nRead the original article on Business Insider"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPYmNEV0wtUUhteUxwbW41MkQ1eGYtdGUyNTEyaXJDaFdsSXdsbnV4bHZrczg3bW1PUk0wbUlPcld6U0RHQjl2amI4Qzl2Z0ZYUl9OQVozeXdIYTJVMlRidWpQLUlkSklUTnpOdVNzY2FWWm1iNzFPUmZKNnE2Q3ozV3JIbXJUQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "JPMorgan says ETF optimism is overhyped, and Ether could overshadow Bitcoin in 2024 - Fortune",
        "content": "While many investors have rejoiced at Bitcoin’s recent price upswings, others are betting that crypto’s second fiddle, Ether, will actually be the big winner of 2024.\n\nWhile loud voices on Crypto Twitter have predicted the start of another bull run with Bitcoin’s recent resurgence, JPMorgan analysts just wrote in a new report that the coin is overbought.\n\nThe report took aim at one of the biggest drivers of Bitcoin’s recent rosy performance: the possibility that the Securities and Exchange Commission will approve several spot Bitcoin ETFs in early January.\n\nSome have predicted that the approval of spot ETFs from TradFi firms like BlackRock and Fidelity will drive billions of dollars of inflows to Bitcoin, but JPMorgan said this optimism is misplaced.\n\nThe bank pointed to weak demand for existing spot Bitcoin ETFs in Europe and Canada as evidence that the investment vehicle could fail to garner significant traction in the U.S. Instead of bringing in fresh capital, spot ETFs are likely to instead draw from capital already invested in Bitcoin-backed vehicles such as the Grayscale Bitcoin Trust (GBTC), Bitcoin futures ETFs, or Bitcoin mining companies.\n\nIf the Grayscale Bitcoin Trust, the world’s largest Bitcoin fund, in particular, is allowed to become a spot ETF, existing investors could take profits and remove as much as $2.7 billion from the exchange-traded fund. That could severely dent prices, the report said.\n\n‘Recapture market share’\n\nThe report also claims that the upcoming Bitcoin halving, which will cut the mining reward in half, has already been priced in and will not give the coin the boost some expect.\n\nOn the other hand, the JPMorgan report said Ether could outperform Bitcoin in 2024 owing in part to an upcoming upgrade to the underlying Ethereum blockchain dubbed EIP-4844 or proto-danksharding. The update is meant to increase throughput and decrease gas fees charged to those who execute transactions on the network.\n\n“We believe that next year Ethereum will reassert itself and recapture market share within the crypto ecosystem,” the analysts wrote.\n\nAs crypto prices have fallen over the past several months, funding dollars have dried up, and some VCs have cut the valuations of some of their biggest crypto bets by double digits. JPMorgan said it’s seen a “reinvigoration” of VC funding this quarter, although it still looks preliminary.\n\nStill, analysts think a revival in venture capital activity in the crypto industry could make a meaningful difference. “To the extent this improvement continues into the first quarter of 2024,” the report continued, “that would represent a significant development that would herald in our opinion the end of the Crypto Winter.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNSTloZVgwckE2cWtqMUNDUzdBdXp3RmJObTA5R0djUnY5RWhtYUlaYUtuNkN3Q0x2YzFrckFNdVhabmwxMERmaUNLeHdlS05FNWpIYVpoUk5JV19OcG44cC1XZmV6eFhISndRU0lGR2o2LUdZa211YVBURGE2d0daaUFlQ0RRMWJoRUtENEw1bTBHZEN4TF9n0gGfAUFVX3lxTE40dUpZTmJhZnBGWnV3V1RyWjh1bnU3M1gzaDBiaU5PWXVQSW1RZGpBRUxfWlVRanVNMjYzeTRFWnctTzRCcUlvMVVXeV9SZllOSUlkQWdzSzlhZ3huN3R5b05hVE5SYS11S0FzU0E3MmZ1WWRHNVlKZlByclE1M0xYa0FrcTFqbktDTFlHM0htR1V2b0tfNmRwY0ZSblE5MA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "JP Morgan: Ethereum to Outperform Bitcoin in 2024, Halving ‘Priced In’ - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nJP Morgan has poured cold water on hopes of a crypto bull run next year, with the bank’s analysts taking a “cautious” stance in their 2024 crypto outlook.\n\nAnalysts led by Nikolaos Panigirtzoglou said in a newly published report that the Bitcoin halving is “largely priced in,” since the halving event and its effect on the Bitcoin supply are “predictable and in our opinion are well factored into the current bitcoin price.”\n\nThe team argued that based on the current Bitcoin hash rate and mining difficulty, that the production cost for miners would rise from around $22,000 at present to around $44,000 post-halving.\n\nBitcoin’s current price of around $42,000 is consistent with a 5% drop in the post-halving hash rate, which “seems too low,” with the team anticipating a 20% drop in the hash rate and miners with higher overheads exiting the market.\n\nAD\n\nAD\n\nSince the 2020 halving brought Bitcoin's price to a 1:1 ratio with miners’ production cost, and the current Bitcoin price is around twice the production cost, it implies that the 2024 halving is largely priced in, the report suggested.\n\nEthereum could “outperform” Bitcoin in 2024, the report said, pointing to the EIP-4844 “Protodanksharding” upgrade as a potential catalyst, but raised concerns about centralization of staking on the Ethereum network.\n\nThe report cautioned that it is “too early to be getting excited” about a revival of DeFi and NFT activity, while pointing to the “encouraging” rise of new DeFi chains including Aptos, SUI and Pulsechain, and the “renewed interest” in NFTs prompted by the emergence of Bitcoin Ordinals.\n\nA Bitcoin ETF flop?\n\nJP Morgan analysts also expressed skepticism that the long-anticipated approval of a spot Bitcoin ETF would bring fresh capital to the market.\n\nAD\n\nAD\n\nThe report cited both the lack of interest from investors in already-approved spot ETFs in Canada and Europe, and the likelihood that capital would move into spot Bitcoin ETFs from existing Bitcoin products, such as the Grayscale Bitcoin Trust (GBTC), Bitcoin futures ETFs and Bitcoin mining companies.\n\nThe report argued that as much as $2.7 billion could exit GBTC following its conversion to a spot Bitcoin ETF, as investors take profit. Were those funds to exit the market rather than moving into other Bitcoin instruments, it would put “severe downward pressure” on the price of Bitcoin, analysts said.\n\nJP Morgan and crypto\n\nThe JP Morgan report comes just a week after the firms’ CEO, Jamie Dimon, took aim at crypto in a Senate Banking Committee hearing, saying that he would “close it down” if he were the U.S. government.\n\nDimon claimed that, “The true use case for it [crypto] is criminals, drug traffickers, money laundering, tax avoidance,” adding that, “I’ve always been opposed to crypto, Bitcoin, etcetera.”"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOazVKVUZ3QUktSnRWT1ZUNnBHdlRnZURvQmxaY1g2QnRBdHNzamduT1BZdGIxbTdqa18tSkVFd1RZTDhTZmFtNU5PbEFfWjBuMVFEcXZCOUhFckNjTGVfNnlEM0tKanhRUnZsUnRvSm13ZU8teEpoc3BNUmFtZ0ZockZqX0Rld1JsWDlQVkduVzBvaUZFdDRqN2FqTEJPVjdlaFpXXzhtakxHaWdHNVpRbmpfTjJfWGlXWmpITnlObE5ld9IBxwFBVV95cUxONHktejBodkFZX3dVUm43MFV5ZDZqR1RCR19Dc2RjTVZWLTNRTVBuVWl4Q1R5MlVuX1NJVFZ2clVmZk92RFNFQzd5bk5lcHd4RDZ2cnpWazRDOTcyOW9GMUZORnlab2J4RTljTUlWTk4zSTF3UmFsdkJuWGxicG41WWNGRlVjbm1fS2FVMEZJeEdveEhVOHNzcW1BRWp6SGYxT1dmVHdWMHdtT1FxdnFmcENUa0ZiYmRkUlVzZmRYaURzMWQ2ZXJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 00:01:37 GMT",
        "title": "Ethereum Rising User Base Boosts Revenue Projections: Predicted To Double To $5 Billion - NewsBTC",
        "content": "Bitwise Invest, an investment firm specializing in the crypto space, recently unveiled its anticipated crypto predictions for 2024.\n\nThese projections provide a glimpse into the future of the cryptocurrency industry, highlighting major milestones and potential breakthroughs for the largest cryptocurrencies such as Bitcoin (BTC), and Ethereum (ETH), and exchanges like Coinbase.\n\nBitcoin Predicted To Smash Records\n\nBitwise’s first prediction suggests that Bitcoin will surpass previous records and trade above $80,000, setting a new all-time high. The firm attributes this bullish outlook to two key catalysts: the imminent launch of a spot Bitcoin exchange-traded fund (ETF) early in 2024 and the anticipated halving of new Bitcoin supply by the end of April.\n\nFurthermore, Bitwise expects the spot Bitcoin ETFs to be approved and to collectively become the most successful ETF launch in history.\n\nRelated Reading\n\nInterestingly, Bitwise also forecasts that Coinbase, one of the largest cryptocurrency exchanges, will witness its revenue double, surpassing Wall Street expectations by at least 10 times.\n\nThe firm points out that Coinbase’s trading volumes typically surge during bull markets, and they anticipate a similar trend in 2024. Additionally, Bitwise highlights Coinbase’s successful launch of various new products that have gained traction in the market.\n\nOn the other hand, the investment firm predicts that more money will settle using stablecoins compared to traditional payment giant Visa. Bitwise highlights stablecoins as one of crypto’s “killer apps” and notes their remarkable growth from virtually zero to a $137 billion market in just four years. Bitwise anticipates 2024 to be another significant year for stablecoin expansion.\n\nEthereum Set For Major Breakthrough\n\nBitwise expects Ethereum’s revenue to more than double from $2.3 billion in 2023 to $5 billion in 2024. The firm attributes this growth to the increasing number of users flocking to crypto applications. Bitwise emphasizes Ethereum’s potential as one of the fastest-growing large-scale tech platforms globally.\n\nFurthermore, Bitwise anticipates a major upgrade to Ethereum, labeled EIP-4844, which could reduce average transaction costs to below $0.01. This significant cost reduction is expected to pave the way for mainstream adoption and the development of groundbreaking applications within the crypto ecosystem.\n\nRelated Reading\n\nCrypto Pundit Predicts That XRP Price Will Rise “Dramatically,” Here’s When 9 months ago\n\nBitwise’s bonus prediction suggests that by the end of 2024, one in four financial advisors will allocate funds to cryptocurrencies in their clients’ accounts. The firm foresees increased adoption by financial advisors once Bitcoin becomes easily accessible and mainstream.\n\nIn summary, Bitwise Invest’s crypto predictions for 2024 paint an exciting future for the cryptocurrency market. With expectations of a new all-time high for Bitcoin, the successful launch of spot Bitcoin ETFs, and revenue growth for industry giants like Coinbase and Ethereum, the crypto space is poised for significant advancements in the coming years.\n\nAs of the current update, ETH is trading at $2,200, reflecting a 1.4% increase over the past 24 hours. This positive movement follows a similar trend set by BTC. However, Ethereum has experienced a slight decline of 2.4% in the past seven days.\n\nFeatured image from Shutterstock, chart from TradingView.com"
    }
]