[
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNUXdLd2FIWXp2X2FFbHd1aFkxS2t5dnhWd1RIa0dEN0lyVUNob29VckVLSkFVczdxNUs1M2loSHB3ak9NUW1jdzdSSlJCbHJLVVI4cTMzX2xVLXNMdHFzNVNJSzJhZms3NV9YaTJ3Tm1RYkpZTVhrRTdFYlNaR1hNTGtkTlAxNm9USEVEbElaUWtzNHhyd0NRWlpOX3lobXA5V1IzaWNLS3cyZldkNENSTkNRQ08xaFhxVFZFQnA5U19BaUVobGFSbFNJaVA2MG4yNlVr0gHYAUFVX3lxTFBuYUQxeFBhWHhPQzR0UzlUMVY1S3RwZ1Zma0pZSnVMSTU5djFhOU9LNjRNMUotZ0tmVVdGVEhWMVZXNWYxS3dFWk1FN0RDaGkzalIwanctcXRnUFphZEc1ck01akQwcC1KSXUxbW5hRHk4Y2VHRFZvSkJ5ZkhSb0RGMlBYaTMtQ1FEMUhZTnc5WEJkZXRnbmtHYWhhY2N4TEV1X1AtWjFDV0Q0RTRyWnFnZDNFakpVcjFvZHVSMUhXWjFrX05BeERMTU9za0JMdk03d0NHUkg2cQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Veteran Trader Peter Brandt Issues Ethereum Alert, Says ETH Could Crash by up to 70% – Here Are His Targets - The Daily Hodl",
        "content": "A widely followed crypto analyst is issuing a warning about the second-largest digital asset by market cap.\n\nVeteran trader Peter Brandt warns his 707,300 followers on the social media platform X that top altcoin Ethereum (ETH) could soon see an epic crash that sends it below $700.\n\n“Classical chart patterns in price charts are not sacred – they fail to perform according to the textbooks all the time.\n\nBut, if the rising wedge in Ethereum complies with the script, the target is $1,000, then $650.\n\nI shorted ETH on Friday — I have a protective B/E stop.”\n\nWhen questioned by a follower if the pattern Brandt characterized as a rising wedge was not interpreted as an ascending triangle, a typically more bullish technical analysis pattern, Brandt offers further insight into his technical analysis process.\n\n“1. I did consider (and still might consider) the ascending triangle interpretation.\n\n2. When in doubt on a pattern I look at [the] closing price line chart – in this case, a wedge.\n\n3. Too many on Twitter are calling this an ascending triangle – my contrarian tendencies.\n\n4. Super low risk shorting set up.”\n\nWith ETH currently worth $2,156 at time of writing, a fall to $650 would represent a nearly 70% decline for the leading smart contract platform.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/CYB3RUSS"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTFAyck8tOVcyMWVzaklRMENHSW1NTktyUlVZbG1WcWJWOWFnbFZKbUxPN1IxZVhoU2RQa3JKb05zYUlldFRDT2k0UHhTWldzRXc4ei1QcHBDSi1wdThQaEF6LURPcmtrck0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 22:24:50 GMT",
        "title": "With all eyes on bitcoin ETF decision, SEC kicks ether can down the road - Blockworks",
        "content": "The US Securities and Exchange Commission — expected to rule on planned spot bitcoin ETFs next month — is pushing its decisions on similar funds focused on ether.\n\nThe regulator said it needed more time to rule on an ether ETF proposed by Brazil-based fund group Hashdex in a filing Monday — adding it “encourages” public comments on the proposal.\n\nIf approved, the Hashdex Nasdaq Ethereum ETF would hold ether futures contracts, as well as ether directly. The SEC had last postponed its ruling on the product last month.\n\nNasdaq — the exchange on which the new fund would trade — makes similar arguments in the Hashdex ether proposal as those made in spot bitcoin ETF applications, the Monday disclosure notes.\n\n“Do commenters agree that arguments to support the listing of Bitcoin ETPs apply equally to the shares?” the filing says. “Are there particular features related to ether and its ecosystem…that raise unique concerns about ether’s susceptibility to fraud and manipulation?”\n\nRead more: Grayscale court victory used in arguments for spot ether ETF\n\nThe SEC published similar filings Monday indicating it would “institute proceedings” for the planned Ark 21Shares Ethereum ETF, Grayscale Ethereum Futures Trust and VanEck Ethereum ETF.\n\nThe Monday filings came after the SEC postponed its decision on the Invesco Galaxy Ethereum ETF last week. It designated Feb. 6 as the date by which it would rule on the product, or again reveal an intention to take more time.\n\nThe SEC has until Jan. 10 to rule on a proposed spot bitcoin ETF by Ark Invest and 21Shares. It could approve or deny other similar proposals at the time.\n\nNeena Mishra, director of ETF research at Zacks Investment Research, previously told Blockworks that if spot bitcoin ETFs are approved, “the debut of ether spot ETFs would not be far behind.”\n\nBloomberg Intelligence analyst James Seyffart added last month: “Assuming we do get a spot bitcoin ETF and we are right about that, I think the SEC will be very hard-pressed to find a way to deny spot Ethereum ETFs.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBlZjl0bXJDMFI1WkU5UEdLaDZQdC1ZZWROX29GQ2hXTWpTZnZHZlYwcEZrcWFyeHdrVllmREhjMjlJdGFyWUFyODZ1Q0w5bHpGdm5qZV80eVhJZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "What Is Polygon? • Layer-2 Ethereum Scaling - Benzinga",
        "content": "Want to invest in Polygon? eToro makes it easy to buy MATIC with a simple trading platform and low fees!\n\nThe Ethereum ecosystem is the largest and most vibrant of smart contracts compatible Layer 1 blockchain. However, high transaction fees on the Ethereum network have alienated investors from this product. High gas fees on the Ethereum network have led to the development of rival blockchains — such as Cardano, Solana, Avalanche — sometimes referred to as ETH killers. Although these blockchains are often faster and cheaper than Ethereum, they lack the security and the network effect of Ethereum's massive user base.\n\nLayer 2 solutions are applications created to help scale a blockchain. Examples of Layer 2 solutions are the Bitcoin Lightning network, Arbitrum and Polygon Crypto. These Layer 2 solutions process transactions off the mainnet, or Layer 1, and post them back in groups using rollups. Layer 2 solutions help increase transaction speed and reduce gas fees while still providing the security and decentralization of the mainnet. Layer 2 solutions are also often referred to as sidechains.\n\nOverview of Polygon\n\nPolygon is a Layer 2 scaling solution for the Ethereum blockchain. Polygon acts as a faster blockchain running concurrently alongside the Ethereum blockchain that uses multiple sidechains. These sidechains operate using the following methods to help improve scalability methods.\n\nZK-Rollups: ZK-rollups process multiple transfers off the Ethereum mainnet. These transfers are then bundled into a single transaction and posted to the mainnet. This process reduces the volume of transactions and the amount of data being processed on the Ethereum mainnet, enabling cheaper and faster transactions.\n\nPlasma chains: Plasma chains are blockchains that run alongside the Ethereum mainnet. The two blockchains can communicate with each other and allow assets to travel between them. Plasma chains have a consensus mechanism that creates blocks, and the root of each plasma chain block is published to the Ethereum mainnet. These roots are little pieces of information that can be used to prove the contents of those blocks.\n\nOptimistic rollups: Optimistic rollups are similar to ZK-rollups, except that they assume transactions are valid by default. They only run computations in the event the integrity of a transaction is challenged.\n\nThe MATIC token is Polygon’s native cryptocurrency. MATIC, an ERC-20 token, is used for staking, fees and governance.\n\nWhy Do People Use Polygon?\n\nPeople use Polygon because of its fast transaction speeds and low gas fees. Gas fees on Polygon are often just a couple of cents, far lower than those charged on Ethereum. People also use Polygon because the network benefits from the strong security of the Ethereum blockchain, and it can benefit someone who wishes to be a contributor to the blockchain technology.\n\nPolygon History\n\nPolygon was launched in October 2017 as the Matic Network. Polygon was co-founded in Mumbai, India, by developers Anurag Arjun, Jaynti Kanani and Sandeep Nailwal. Kanani was a former data scientist at Housing.com before helping found Polygon and serving as the company’s CEO. Nailwal was the previous chief technology officer (CTO) of Welspun Group. He also worked as a consultant at Deloitte and started another company known as ScopeWeaver. Arjun worked as a project manager at IRIS Business, SNL Financial and Dexter Consultancy. Matic was rebranded as Polygon in February 2021 to reflect its wide array of scaling solutions.\n\nWhere To Buy MATIC\n\nMATIC can be purchased from most centralized exchanges such as Voyager, Crypto.com and Binance. MATIC can also be purchased from decentralized exchanges such as Uniswap and MetaMask Swap. Polygon uses a proof-of-stake consensus mechanism. If you already own MATIC, you can earn more of it by staking and buy cryptocurrency to diversify your portfolio along with the Polygons you already hold.\n\nPolygon vs. Other Blockchains\n\nThe Polygon blockchain fundamentally differs from other blockchains such as Bitcoin and Solana because it relies heavily on another blockchain for its security. Polygon is in effect a part of the greater Ethereum ecosystem.\n\nArbitrum is another Ethereum Layer 2 scaling solution. Arbitrum is slightly more decentralized because it is secured by Ethereum’s large network of miners. Polygon, on the other hand, is secured by MATIC staking, which is a smaller pool of capital when compared to the miners who secure the Ethereum network. Polygon is slightly cheaper to use and has faster withdrawal times when transitioning your assets back onto the Ethereum Network.\n\nHow to Store MATIC Safely\n\nIf you wish to purchase a large sum of MATIC tokens, it is crucial to take the proper precautions to store your cryptocurrencies safely. The best place to store your MATIC tokens is on the hardware wallet Ledger.\n\nLedger is a hardware cryptocurrency wallet that stores access to your cryptocurrencies on an external device. Ledger wallets are not connected to the internet. This feature is beneficial because hot wallets that are connected to the internet are much more likely to be exposed to scams, hacks and private key leaks. Ledger wallets are currently priced at around $60 to $250 depending on the model you choose.\n\nShould You Use Polygon?\n\nPolygon is a scaling solution for the growing cryptographer that aims to improve the speed and reduce the cost of using the Ethereum blockchain. The company not only helps bring new cost-conscious users into the Ethereum ecosystem, but it also retains existing users. Many Ethereum projects are in the process of deploying on Polygon, and the Polygon Labs ecosystem is only expected to grow and add scaling solutions over time. However, the Ethereum 2.0 upgrade risks rendering Ethereum’s Layer 2 solutions less valuable as the mainnet scalability improves.\n\nFrequently Asked Questions"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBlZjl0bXJDMFI1WkU5UEdLaDZQdC1ZZWROX29GQ2hXTWpTZnZHZlYwcEZrcWFyeHdrVllmREhjMjlJdGFyWUFyODZ1Q0w5bHpGdm5qZV80eVhJZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "What Is Polygon? • Layer-2 Ethereum Scaling - Benzinga",
        "content": "Want to invest in Polygon? eToro makes it easy to buy MATIC with a simple trading platform and low fees!\n\nThe Ethereum ecosystem is the largest and most vibrant of smart contracts compatible Layer 1 blockchain. However, high transaction fees on the Ethereum network have alienated investors from this product. High gas fees on the Ethereum network have led to the development of rival blockchains — such as Cardano, Solana, Avalanche — sometimes referred to as ETH killers. Although these blockchains are often faster and cheaper than Ethereum, they lack the security and the network effect of Ethereum's massive user base.\n\nLayer 2 solutions are applications created to help scale a blockchain. Examples of Layer 2 solutions are the Bitcoin Lightning network, Arbitrum and Polygon Crypto. These Layer 2 solutions process transactions off the mainnet, or Layer 1, and post them back in groups using rollups. Layer 2 solutions help increase transaction speed and reduce gas fees while still providing the security and decentralization of the mainnet. Layer 2 solutions are also often referred to as sidechains.\n\nOverview of Polygon\n\nPolygon is a Layer 2 scaling solution for the Ethereum blockchain. Polygon acts as a faster blockchain running concurrently alongside the Ethereum blockchain that uses multiple sidechains. These sidechains operate using the following methods to help improve scalability methods.\n\nZK-Rollups: ZK-rollups process multiple transfers off the Ethereum mainnet. These transfers are then bundled into a single transaction and posted to the mainnet. This process reduces the volume of transactions and the amount of data being processed on the Ethereum mainnet, enabling cheaper and faster transactions.\n\nPlasma chains: Plasma chains are blockchains that run alongside the Ethereum mainnet. The two blockchains can communicate with each other and allow assets to travel between them. Plasma chains have a consensus mechanism that creates blocks, and the root of each plasma chain block is published to the Ethereum mainnet. These roots are little pieces of information that can be used to prove the contents of those blocks.\n\nOptimistic rollups: Optimistic rollups are similar to ZK-rollups, except that they assume transactions are valid by default. They only run computations in the event the integrity of a transaction is challenged.\n\nThe MATIC token is Polygon’s native cryptocurrency. MATIC, an ERC-20 token, is used for staking, fees and governance.\n\nWhy Do People Use Polygon?\n\nPeople use Polygon because of its fast transaction speeds and low gas fees. Gas fees on Polygon are often just a couple of cents, far lower than those charged on Ethereum. People also use Polygon because the network benefits from the strong security of the Ethereum blockchain, and it can benefit someone who wishes to be a contributor to the blockchain technology.\n\nPolygon History\n\nPolygon was launched in October 2017 as the Matic Network. Polygon was co-founded in Mumbai, India, by developers Anurag Arjun, Jaynti Kanani and Sandeep Nailwal. Kanani was a former data scientist at Housing.com before helping found Polygon and serving as the company’s CEO. Nailwal was the previous chief technology officer (CTO) of Welspun Group. He also worked as a consultant at Deloitte and started another company known as ScopeWeaver. Arjun worked as a project manager at IRIS Business, SNL Financial and Dexter Consultancy. Matic was rebranded as Polygon in February 2021 to reflect its wide array of scaling solutions.\n\nWhere To Buy MATIC\n\nMATIC can be purchased from most centralized exchanges such as Voyager, Crypto.com and Binance. MATIC can also be purchased from decentralized exchanges such as Uniswap and MetaMask Swap. Polygon uses a proof-of-stake consensus mechanism. If you already own MATIC, you can earn more of it by staking and buy cryptocurrency to diversify your portfolio along with the Polygons you already hold.\n\nPolygon vs. Other Blockchains\n\nThe Polygon blockchain fundamentally differs from other blockchains such as Bitcoin and Solana because it relies heavily on another blockchain for its security. Polygon is in effect a part of the greater Ethereum ecosystem.\n\nArbitrum is another Ethereum Layer 2 scaling solution. Arbitrum is slightly more decentralized because it is secured by Ethereum’s large network of miners. Polygon, on the other hand, is secured by MATIC staking, which is a smaller pool of capital when compared to the miners who secure the Ethereum network. Polygon is slightly cheaper to use and has faster withdrawal times when transitioning your assets back onto the Ethereum Network.\n\nHow to Store MATIC Safely\n\nIf you wish to purchase a large sum of MATIC tokens, it is crucial to take the proper precautions to store your cryptocurrencies safely. The best place to store your MATIC tokens is on the hardware wallet Ledger.\n\nLedger is a hardware cryptocurrency wallet that stores access to your cryptocurrencies on an external device. Ledger wallets are not connected to the internet. This feature is beneficial because hot wallets that are connected to the internet are much more likely to be exposed to scams, hacks and private key leaks. Ledger wallets are currently priced at around $60 to $250 depending on the model you choose.\n\nShould You Use Polygon?\n\nPolygon is a scaling solution for the growing cryptographer that aims to improve the speed and reduce the cost of using the Ethereum blockchain. The company not only helps bring new cost-conscious users into the Ethereum ecosystem, but it also retains existing users. Many Ethereum projects are in the process of deploying on Polygon, and the Polygon Labs ecosystem is only expected to grow and add scaling solutions over time. However, the Ethereum 2.0 upgrade risks rendering Ethereum’s Layer 2 solutions less valuable as the mainnet scalability improves.\n\nFrequently Asked Questions"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBlZjl0bXJDMFI1WkU5UEdLaDZQdC1ZZWROX29GQ2hXTWpTZnZHZlYwcEZrcWFyeHdrVllmREhjMjlJdGFyWUFyODZ1Q0w5bHpGdm5qZV80eVhJZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "What Is Polygon? • Layer-2 Ethereum Scaling - Benzinga",
        "content": "Want to invest in Polygon? eToro makes it easy to buy MATIC with a simple trading platform and low fees!\n\nThe Ethereum ecosystem is the largest and most vibrant of smart contracts compatible Layer 1 blockchain. However, high transaction fees on the Ethereum network have alienated investors from this product. High gas fees on the Ethereum network have led to the development of rival blockchains — such as Cardano, Solana, Avalanche — sometimes referred to as ETH killers. Although these blockchains are often faster and cheaper than Ethereum, they lack the security and the network effect of Ethereum's massive user base.\n\nLayer 2 solutions are applications created to help scale a blockchain. Examples of Layer 2 solutions are the Bitcoin Lightning network, Arbitrum and Polygon Crypto. These Layer 2 solutions process transactions off the mainnet, or Layer 1, and post them back in groups using rollups. Layer 2 solutions help increase transaction speed and reduce gas fees while still providing the security and decentralization of the mainnet. Layer 2 solutions are also often referred to as sidechains.\n\nOverview of Polygon\n\nPolygon is a Layer 2 scaling solution for the Ethereum blockchain. Polygon acts as a faster blockchain running concurrently alongside the Ethereum blockchain that uses multiple sidechains. These sidechains operate using the following methods to help improve scalability methods.\n\nZK-Rollups: ZK-rollups process multiple transfers off the Ethereum mainnet. These transfers are then bundled into a single transaction and posted to the mainnet. This process reduces the volume of transactions and the amount of data being processed on the Ethereum mainnet, enabling cheaper and faster transactions.\n\nPlasma chains: Plasma chains are blockchains that run alongside the Ethereum mainnet. The two blockchains can communicate with each other and allow assets to travel between them. Plasma chains have a consensus mechanism that creates blocks, and the root of each plasma chain block is published to the Ethereum mainnet. These roots are little pieces of information that can be used to prove the contents of those blocks.\n\nOptimistic rollups: Optimistic rollups are similar to ZK-rollups, except that they assume transactions are valid by default. They only run computations in the event the integrity of a transaction is challenged.\n\nThe MATIC token is Polygon’s native cryptocurrency. MATIC, an ERC-20 token, is used for staking, fees and governance.\n\nWhy Do People Use Polygon?\n\nPeople use Polygon because of its fast transaction speeds and low gas fees. Gas fees on Polygon are often just a couple of cents, far lower than those charged on Ethereum. People also use Polygon because the network benefits from the strong security of the Ethereum blockchain, and it can benefit someone who wishes to be a contributor to the blockchain technology.\n\nPolygon History\n\nPolygon was launched in October 2017 as the Matic Network. Polygon was co-founded in Mumbai, India, by developers Anurag Arjun, Jaynti Kanani and Sandeep Nailwal. Kanani was a former data scientist at Housing.com before helping found Polygon and serving as the company’s CEO. Nailwal was the previous chief technology officer (CTO) of Welspun Group. He also worked as a consultant at Deloitte and started another company known as ScopeWeaver. Arjun worked as a project manager at IRIS Business, SNL Financial and Dexter Consultancy. Matic was rebranded as Polygon in February 2021 to reflect its wide array of scaling solutions.\n\nWhere To Buy MATIC\n\nMATIC can be purchased from most centralized exchanges such as Voyager, Crypto.com and Binance. MATIC can also be purchased from decentralized exchanges such as Uniswap and MetaMask Swap. Polygon uses a proof-of-stake consensus mechanism. If you already own MATIC, you can earn more of it by staking and buy cryptocurrency to diversify your portfolio along with the Polygons you already hold.\n\nPolygon vs. Other Blockchains\n\nThe Polygon blockchain fundamentally differs from other blockchains such as Bitcoin and Solana because it relies heavily on another blockchain for its security. Polygon is in effect a part of the greater Ethereum ecosystem.\n\nArbitrum is another Ethereum Layer 2 scaling solution. Arbitrum is slightly more decentralized because it is secured by Ethereum’s large network of miners. Polygon, on the other hand, is secured by MATIC staking, which is a smaller pool of capital when compared to the miners who secure the Ethereum network. Polygon is slightly cheaper to use and has faster withdrawal times when transitioning your assets back onto the Ethereum Network.\n\nHow to Store MATIC Safely\n\nIf you wish to purchase a large sum of MATIC tokens, it is crucial to take the proper precautions to store your cryptocurrencies safely. The best place to store your MATIC tokens is on the hardware wallet Ledger.\n\nLedger is a hardware cryptocurrency wallet that stores access to your cryptocurrencies on an external device. Ledger wallets are not connected to the internet. This feature is beneficial because hot wallets that are connected to the internet are much more likely to be exposed to scams, hacks and private key leaks. Ledger wallets are currently priced at around $60 to $250 depending on the model you choose.\n\nShould You Use Polygon?\n\nPolygon is a scaling solution for the growing cryptographer that aims to improve the speed and reduce the cost of using the Ethereum blockchain. The company not only helps bring new cost-conscious users into the Ethereum ecosystem, but it also retains existing users. Many Ethereum projects are in the process of deploying on Polygon, and the Polygon Labs ecosystem is only expected to grow and add scaling solutions over time. However, the Ethereum 2.0 upgrade risks rendering Ethereum’s Layer 2 solutions less valuable as the mainnet scalability improves.\n\nFrequently Asked Questions"
    }
]