[
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOd3VKeTB3dXkzYVRVaFQ5Ql9URUFmTXBodjJSU08zWjZXd01aM3NyY01uMzQzczUxcXJWMzNISGp0OWpsbkszcXlRVUtRWGtwSTNELVA5WDdrRDhNa3d0RHloQ1p0OUtFTW9qSGJ6TUN6TTVISmEzbTNBeVcwT0d3ckNwWlJtRlRyX2hwM2w1b9IBlAFBVV95cUxNM2k5NDlkMUVTbzk5MTV6YUVQc0VtZURZanhkMXJlTDNPX0RoS3BmWmdkcEpzNTBvWDUzdWlVbUdfNGJTbHhCb3hUMUZfRVNMelM0ajAxVEZlS3B4YVpvaU5QM2t6d0FUQzJvYnlQRWNhUF9PWUpDMVE2UVpVeXB2NnZJQWtZdThRZ25WOF9HS0xBY0Zl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin says he wants to ‘make Ethereum cypherpunk again’ - AMBCrypto News",
        "content": "Ethereum founder Vitalik Buterin talked about the blockchain’s future in his recent blog.\n\nUsage of network remained high, however, its price saw a correction.\n\nEven though multiple altcoins have followed suit after Bitcoin’s [BTC] rally, Ethereum’s [ETH] price has not seen much growth in the recent past.\n\nDespite this developments have ensued on the network with founder Vitalik committed to the vision of Ethereum.\n\nHas Ethereum lost its Cypherpunk?\n\nIn a recent blog post titled “Make Ethereum Cypherpunk Again,” Vitalik Buterin outlined a promising future for the network, driven by significant developments across various fronts.\n\nHe stated that scalability solutions, such as rollups, are addressing Ethereum’s historical scalability challenges, allowing for more efficient transaction processing. Second-generation privacy solutions, including projects like Railway and Nocturne, are enhancing user confidentiality.\n\nHe also mentioned the concept of account abstraction is gaining traction, enabling users to interact with smart contracts without the need for native cryptocurrency holdings, making Ethereum more accessible.\n\nProgress in the development of light clients is reducing resource requirements and increasing network accessibility. Zero knowledge proofs, once considered a distant technology, are becoming more developer-friendly, offering enhanced privacy and verification capabilities.\n\nThe blog post also emphasizes a return to core values within the crypto community, including open global participation, decentralization, and a cooperative mindset.\n\nThese updates collectively aim to address scalability concerns, reduce transaction fees, and bolster privacy and security.\n\nAs a result, Ethereum may experience improved efficiency, making it more appealing to a wider user base and enabling a broader array of applications.\n\nHowever, the success of these changes depends on community adoption and effective implementation.\n\nHow is Ethereum doing?\n\nComing to the state of the protocol, it was seen that the gas usage on the network has remained consistent. This meant activity on the network was high.\n\nHowever, the number of NFT trades occurring on the Ethereum network has fallen.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nThis could have a negative impact on Ethereum in the future as NFT trades make up a large amount of the overall activity on the network.\n\nAt press time, ETH was trading at $2,361.39 and its price had fallen by -1.21% in the last 24 hours. Only time will tell whether Vitalik’s long term vision will help ETH’s price see further growth."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQN1l4SDJsbk9tMWJaSG9IbTdwaGU5M0U0RUlKZ2xiQUFxUUxJZDZDcDd4RE1OVkZEbWJlX3VneHlOV0lQaVhWMDlvZzh4MExaZUdmc1FqMjV2MHVsUTZBZnFGRlpJb2lYZGtQcVdaX21aSnlsT2ZkT2l6dDREZkFRMjQzRHB6ZUpLVEdDNjhVbjhGVW5aWkdoVXNsN0FvMWQ2LXfSAacBQVVfeXFMUFh3RlpHcGcwai1XMWtoSzFWOU56bUFCdXdHR216aGJ1c2ZTeFVITW1hU21mSlZJVVdFODBYRFNhWmNubXRVQk9DLUdObGppdjg4LWtFaGNaMlM2T3RaX3RKai1nZ29Tc1BZc2h6bEc2MEdHR21Dbi1PLWVLYUVOR2JRVUxXcHU3VzdSRVJ3Q0VnWmhpOXR3TG9VMlJ4eVBJaTJld2w5VnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin & Ethereum Open Interest (OI) And Funding Rates Signals Bullish 2024 Start - CoinGape",
        "content": "After $11 billion in annual options delivery on Friday, Bitcoin and Ethereum are expected to close the year below $44,000 and $2400 levels. As BTC and ETH continued to rally this year due to rising open interests (OI), a record rise in funding rates stalled the rally at the end of the year.\n\nBTC price rallied 170% and ETH price leaped 105% this year. Experts anticipate further rally after the funding rates decline gradually.\n\nadvertisement\n\nBitcoin And Ethereum OI and Funding Rates\n\nBitcoin and Ethereum futures open interest (OI) fell after Friday’s expiry and recent crypto market selloffs this week. However, traders remain positive on further upsides.\n\nAs per current data, the total Bitcoin futures OI on all exchanges is over $18 billion. BTC OI on CME and Binance are $4.81 billion and $4.31 billion, rising again after the recent wipe out. Deribit, Coinbase, Bybit, OKX, and others have similar figures.\n\nThe total Ethereum futures OI is $3.36 million. ETH OI on the top three futures crypto exchanges Binance, Bybit, and OKX are rising after a massive drop.\n\nCrypto influencer Kamikaz shared that OI is totally wiped on BTC and ETH after expiry but funding remains higher as people are scared to short due to spot Bitcoin ETF approval sentiment. He says it is super bullish and wants to long.\n\nPopular analyst CredibleCrypto agreed with Kamikaz that the market is bullish. He explained that people are mistaking high funding rates for an excess of over-leveraged participants. In reality, OI is completely wiped at levels not witnessed in the last few years. He said, “funding is only relatively high because the few that are levered are predominantly directional longs.”\n\nFunding rates are also actually falling from the record high. The BTC OI-weighted funding rate chart indicates probability of upside movement in the next few days.\n\nAlso Read:\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBvSEE1aDJnV3hTQnZVeWdLd3p6N1RXVG42YS14UURhY3lLeU00WHEySkIzTzlBejNFeVhDaVlraW5BVEFOV3JxX0JITVZJSXhUNVpxbW1WYmFibGlkT1h4U1o5NFFGOW1lcV91QW5QXzlsUjYyTUJBYmJMSEVJQzDSAYQBQVVfeXFMTlc0QTZrY0JsRWtHdU9VQS1tYW12c0lvVDlKb2pPWUlUamZnaUtTNUJhdHRLd29yUmF5THhIZHQzR3dlN05vTlhMY1dkU2NNYlJ2V0hHNExheFFSUHlha3hLNDc5VW8tVm9yRkhkTUJtN2I5SXBGQXhIQzA2YjRSSHJFVzZZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin Reveals Ethereum’s Road Map For 2024 - Bitcoinist",
        "content": "Ethereum founder Vitalik Buterin has shared the crypto project’s roadmap for 2024. In a series of posts on X on December 30, Buterin spoke extensively on Ethereum’s gameplan for the new year, which he claims is quite similar to the plan for 2023, albeit with a few changes.\n\nEthereum Roadmap 2024\n\nAccording to information revealed by Buterin, the main focus of Ethereum for 2024 centers around six key goals, namely the Merge, the Surge, the Scourge, the Verge, the Purge, and the Splurge.\n\nThe Ethereum Merge aims to create an ideal, simple, robust, and decentralized proof-of-stake (PoS) network.\n\nThe Merge occurred in September 2022 with the integration of the Ethereum mainnet with the Beacon Chain, thus marking the end of the proof-of-work consensus algorithm. Speaking on post-Merge improvements in 2024, Buterin claimed that the single-slot finality (SSF) mechanism presented the easiest method of eliminating the current restrictions of Ethereum’s PoS design.\n\n\n\nBy popular demand, an updated roadmap diagram for 2023! pic.twitter.com/oxo58A2KuG — vitalik.eth (@VitalikButerin) December 30, 2023\n\nIn regards to the Surge, Buterin stated that there will be notable advancements in rollup scaling with significant developments both on EIP 4844 and within various rollups. Additionally, there will be a focus on long-term improvement in cross-rollup standards and interoperability, all of which will drive Ethereum toward achieving the goal of processing over 100,000 transactions per second.\n\nThe Ethereum co-founder also highlighted that the Scourge target has been re-oriented to tackling economic centralization in two key areas namely MEV and liquid staking/pooling. In addition, Buterin stated that there will be significant progress in achieving the Verge with the incoming introduction of verkle trees, which will contribute to the easy verification of blocks in the Ethereum network.\n\nButerin Faces Allegations From Former Ethereum Foundation Advisor\n\nIn other news, Buterin has been accused of “defrauding the world” by former Ethereum Foundation adviser Steven Nerayoff. This statement came in response to Buterin’s concerns about the perversion of the original vision of Web 3.\n\nIn a blog post on Dec 28, the Ethereum founder shared that the blockchain project was initially designed to function as a decentralized, shared hard drive. However, users have since diverted from the vision with a focus more on the financial applications of Ethereum.\n\nNerayoff countered Buterin’s claims, stating that the Ethereum’s co-founder, along with “his cabal,” are responsible for the perversion of the “Web 3 vision,” which they used to “defraud the world.” So far, there has been no response to these accusations.\n\nAt the time of writing, Ethereum trades at $2,285.41 with a 0.81 decline in the last day. Meanwhile, the token’s daily trading volume is down by 36.68% and valued at $6.84 billion.\n\nETH trading at $2,285.41 on the daily chart | Source: ETHUSDT chart on Tradingview.com\n\nFeatured image from Forbes, chart from Tradingview"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQQnh2Vi1VT0hYSkdyQmZQV3NqN1N4QlBTbEZpZkpTbFVpdkpTVDdnV0E2OHVPcDdjSWhPbFp2RWEwVlhLZ1d5Y2E3M0hOZzlnSmttNWxaaVhrQkxBa3o5b0tKM0t2ZjBva241WkNNaGR0R3lDR1lBRkFXUFFwbHVlT9IBhgFBVV95cUxNOVF6eTcyVXhsWnliazZvdy1lZUxraGNUN2hFMklsZlZLdzFjV3lvWDNXbmdQWURiQ3lYQnJnQlo4WnJtWFBTYkVKX2UxTlNPTGl1elpEeHFfZzVPbXF0ZWRtQW81QlQ5Z1Q3QmpVNEVLYzZURWRRSThzUV9tQ3M4Z2RvWXU4Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "The Year Of Ethereum: ETH Long-Term Holder Percentage Surpasses BTC - Bitcoinist",
        "content": "The percentage of long-term ETH holders has skyrocketed this year to surpass Bitcoin for the second time ever. According to data from on-chain analytics platform IntoTheBlock, Ethereum has done pretty well in its percentage of long-term holders this year, with over 70% of investors currently holding on to their assets for more than a year, a new milestone for the blockchain.\n\nETH Long-Term Holders Now Top BTC\n\nEthereum’s price activity has largely underperformed this year when compared to Bitcoin. But this isn’t surprising, as Bitcoin has led the entire industry in bullish metrics and investor confidence this year. However, data from IntoTheBlock suggest more Ethereum investors are holding onto ETH for the long haul, hopefully with the belief that it will continue to rise substantially in value over time.\n\nLong-term holders are investors who refuse to sell their crypto even during times of market volatility and price depreciation. They are particularly important in maintaining the overall health of any blockchain, as they help to provide stability and reduce price volatility.\n\nHistory has shown Ethereum surpassing Bitcoin as regards this metric only once before. It’s important to note that the last time this happened, ETH would go on to lead in this metric over the subsequent months.\n\n2023 Review! This year, the percent of long-term $ETH holders surpassed that of Bitcoin for the second time ever! pic.twitter.com/i6kDzAjzgM — IntoTheBlock (@intotheblock) December 30, 2023\n\nOn the other hand, In/Out of the Money metric by IntoTheBlock shows Bitcoin leading Ethereum in terms of profitability. At the time of writing, 82.25% of all BTC addresses are making money at the current price, compared to 76.10% of ETH addresses.\n\nBitcoin’s high profitability can be linked to a huge number of early Bitcoins assumed to be lost forever. As a result, the percentage of holders who bought at the current price metric puts Ethereum ahead of Bitcoin.\n\nTotal crypto market cap is currently at $1.6 trillion. Chart: TradingView.com\n\nAround 63% of ETH addresses who bought around the current price of $1,948 and $2,641 are still in profit compared to BTC’s 52% of addresses that bought between $35,729 and $48,402.\n\nWhat’s Next For Ethereum?\n\nEthereum is currently trading at $2,285 and is up by 91% this year. However, the asset’s price has largely underperformed in comparison to major altcoins like Solana and Cardano, who are currently up by 925% and 145% respectively this year.\n\nInterestingly, this hasn’t stopped bullish predictions from coming in regarding Ethereum. One of these is a prediction from BitMex founder Arthur Hayes, who estimated an astounding $5,000 price for Ethereum. Crypto analyst Raoul Pau also looked at price history to predict ETH outperforming BTC becoming a key macro trend of 2024. The first step in achieving this would be to break above the $2,380 price level.\n\nFor all the ETH bears… in Feb 2021, BTC first hit $44,000 (where it is today) and ETH was at $1400 (now $2250), 9 months later ETH was up 245%, BTC was up 45%… I think ETH outperforming BTC will be a key macro trend of 2024 and our work at EXPAAM suggests it. 1/ pic.twitter.com/QGSZahhldg — Raoul Pal (@RaoulGMI) December 21, 2023\n\nFeatured image from Pexels"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5YS1BPMHUtdlNiYmRWeXR6X3c1YjZoM05wTTRTY2swNGJIUTdYemZiaDA3YkdsSHhiRG5ld1VhUjZ4U01qQ0RFUERBdDdIbnI1Uk9NVFl4OFZncnpCdDFlcGsyV29ZYXM4MEFXYk1DZnJGWmkwMVI4X1ozOXI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "What’s Behind Solana’s Recent Surge - Yahoo Finance",
        "content": "What’s Behind Solana’s Recent Surge\n\nSolana Flipped Ethereum in Google Search Interest\n\nGoogle searches for the term \"Solana\" surpassed \"Ethereum\" for the first time in 2023, indicating growing interest in the Solana ecosystem.\n\nFrom December 17 to 23, Solana's search interest score reached 56, while Ethereum's was 50. Google Trends data suggests that Solana's search interest is set to peak during the week of December 24 to 30, with a score of 100.\n\nUsers searching for Solana also showed interest in terms like \"bonk\" and \"tensor.\" Bonk (BONK) is the leading Solana memecoin that reached a peak market cap of $1.9 billion after being listed on Binance and Coinbase, while Tensor is the leading NFT marketplace on Solana, after surpassing Magic Eden in trading volume.\n\nSolana’s DEX Volumes and NFT Sales Surpassed Ethereum’s\n\nOn December 23, Solana surpassed Ethereum in weekly decentralized exchange (DEX) volume and non-fungible token (NFT) sales.\n\nDEX volume on Solana surged to over $10 billion, surpassing Ethereum's $8.8 billion for that week. Meanwhile, Solana also processed $109 million in NFT sales in that week, eclipsing Ethereum by $30 million.\n\nAt the time of writing, Ethereum is leading in terms of DEX volumes, with $10.12 billion compared to Solana’s $8.71 billion. However, Solana’s NFT sales volume is still ahead of Ethereum’s, although Bitcoin is leading due to the recent Ordinals frenzy.\n\nThe current frenzy on Solana is partly driven by memecoins, particularly BONK, which has skyrocketed by 300% in December and has a market cap of over $1 billion. Another Solana-based memecoin, Dogwifhat, has also gained 428% in the past week.\n\nSolana Flipped BNB in Market Cap Momentarily\n\nOn December 22, Solana surged by 18% to overtake BNB (BNB), propelling it to 4th place in terms of market capitalization. SOL traded at a market cap of $41.9 billion, surpassing BNB, which had a market cap of $41.8 billion.\n\nThis surge came after SOL overtook XRP in market cap on December 21. However, BNB has since regained its position after gaining over 17% in the past week. BNB is currently trading at a market cap of $47.8 million, compared to SOL’s market cap of $43.7 million.\n\nSOL gained over 71% in the past month, outperforming many large-cap cryptocurrencies such as ETH, which has only gained 12.4%.\n\nWhat’s the Reason Behind Solana’s Recent Rally?\n\nSolana's recent price surge can be attributed to several factors, including:\n\nIncreased User Activity\n\nActive addresses on Solana have increased by nearly 400% in the last three months, surpassing Ethereum’s in mid-November. This suggests an exceptional increase in retail activity, with crypto users likely migrating to Solana for its lower transaction costs, increased speculative activity, airdrop farming and more.\n\nStory continues\n\nAirdrops and Memecoins Caused Surge in DEX Volume\n\nRecent airdrops on Solana, particularly the Jito (JTO) airdrop worth five figures, have resulted in more users flocking to other Solana-based protocols in hopes of securing a future airdrop. Furthermore, memecoins trading craze, led by the Bonk memecoin, have boosted speculative user activity, causing the DEX volume on Solana to surpass Ethereum’s for a week. Other memecoins on Solana, like Dogwifhat (WIF) and Silly Dragon (SILLY), also saw millions in daily volume on-chain, contributing to the rise in DEX volumes.\n\nInstitutional Capital Flows Into Solana\n\nSource: CoinShares\n\nSolana-based investment funds attracted $156 million in institutional inflows as of December 16, making it the crypto asset with the highest inflows behind only Bitcoin, suggesting robust institutional interest in Solana."
    }
]