[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQQVFfYnZhX1V1Mi0yX2pXYkNlcFJDVVdZVmJjelRraXAxZEJwOTAyb0pOSjBPQVNWWHlWaDFLRU5KTU1iTHh4VDFJRzBYUWd3cjNNekV0alVCWm1RY1Jsbk5mSWowSG94RVBxZER3MDZIbnExZDkyZWk1aFROMnBhNEhCanZVYXNlajJUOW1VcDI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Solana surpasses Bitcoin and Ethereum in weekend trading volume - CryptoSlate",
        "content": "Crypto traders’ interest in Solana remains very high as the trading volume for the digital asset surpassed that of Bitcoin and Ethereum on major centralized exchanges during the weekend.\n\nConor Grogan, a director at Coinbase, first pointed out this milestone on Dec. 24, saying SOL saw more trading than the combination of the top two largest cryptocurrencies by market capitalization.\n\nRiyad Carey, an analyst with Paris-based crypto intelligence platform Kaiko, further corroborated this finding, saying the same trend was observed on Kraken and Gemini, two of the largest U.S.-based crypto trading platforms.\n\nSOL’s trading volume also beat BTC and ETH on UPbit and MEXC for the past 2 and 3 days, respectively.\n\nCarey further shared a chart showing that SOL’s trading activities, compared to ETH and BTC, were experiencing an uptrend. According to the chart, SOL trading is approaching 40% of trading activities on centralized crypto platforms, while ETH and BTC were declining.\n\nAccording to Carey, these metrics are “unprecedented” and show the sustained interest SOL is currently generating in the market.\n\nWhy SOL volume is rising\n\nOver the past year, Solana has experienced remarkable growth, defying earlier associations with Sam Bankman-Fried, the disgraced founder of the bankrupt FTX cryptocurrency exchange. Despite this, the network has flourished, attracting an expanding user base.\n\nDuring this period, Solana forged strategic alliances with renowned global financial players like Visa and Shopify. These partnerships harness blockchain technology to streamline payment procedures, showcasing SOL’s network’s potential to a broader global audience.\n\nMoreover, the recent surge in interest surrounding the Solana-based BONK memecoin and the resurgence of decentralized finance (DeFi) activities on the smart contract-enabled blockchain have contributed significantly to its recent upward trajectory.\n\nThese developments have helped push the price of SOL to new highs, up more than 800% on the year-to-date metric to nearly $120 as of press time, according to CryptoSlate’s data.\n\nMentioned in this article"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQVG01T0pjeUJIcVRIeFl2ZnBRd0N6c1prZnJCTy1zT2VMX3F1Zk0wN2hsQkJmY25XUnM5VHdYUk1lQ1RMbU43bGExMzN0cGJsaVc0Zk5OU0hHSE1Jd0ZOTFU5MjV3ZXJibE5ReTBKYm1FR1A5Xzd6bC1iMmtMREZZMzB0cmpaOG9jT0JMQjVYZDNnSUo3cnhyTHdYQXFJSnQtZGVaM2ZGbjFXa3BwZEJpT0h3aXF4ZHJmODJHT2RONE9hMVJQOHFwSGdRTnRKMEV4UmYzNE5STzY2UERqZmo2Vmw5UlVlMW1a?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "If You Gifted Your Family $100 In Bitcoin, Dogecoin And Ethereum Last Christmas, Here's How Much They Would Have This Christmas - Benzinga",
        "content": "One of the annual traditions of Christmas for most families is the giving and receiving of gifts. While popular gift items include toys, clothes, gift cards, and money, another option is to give a gift of cryptocurrency.\n\nHere's a look back at how much a gift of cryptocurrency for Christmas in 2022 would be worth today.\n\nWhat Happened: Just like Mother's Day, Christmas is a holiday that could see the selection of gifts for loved ones in your family.\n\nGiving cryptocurrency as a gift at Christmas 2022 may not have been a popular choice for gift-givers or for those receiving gifts as the year was full of negative headlines.\n\nThe year 2022 saw several cryptocurrency platforms go bankrupt and all the major cryptocurrencies traded down during the year.\n\nIn 2023, cryptocurrencies have turned around with many of the largest cryptos outperforming the top stocks and overall broad stock market.\n\nHere's a look back at how much three major cryptocurrencies given as gifts for Christmas 2022 would be worth today.\n\nRelated Link: Tim Draper Says Yes to Bitcoin For The Holidays, Anticipates $250,000 BTC In 2024\n\nInvesting $100 in Bitcoin, Dogecoin, Ethereum: A popular gift amount may have been giving $100 in cryptocurrency to a loved one on Christmas Day 2022. Here's a look at how much one could have bought of Bitcoin BTC/USD, Dogecoin DOGE/USD and Ethereum ETH/USD based on the intraday high on Dec. 25, 2022.\n\n$Bitcoin: 0.0059 BTC\n\nDogecoin: 1,287.93 DOGE\n\nEthereum: 0.0817 ETH\n\nInvesting $100 in each cryptocurrency last Christmas would be worth the following based on prices at the time of writing:\n\nBitcoin: $254.84, +154.8%\n\nDogecoin: $119.00, +19.0%\n\nEthereum: $185.77, +85.8%\n\nA $300 gift consisting of the three top cryptocurrencies would be worth $559.61 today, an increase of 86.5%.\n\nFamily members would likely welcome the return of any of these three cryptocurrencies over the last year.\n\nCrypto Christmas 2023\n\nFor comparison, a $100 investment in the SPDR S&P 500 ETF Trust SPY, which tracks the S&P 500 Index, would be worth $123.72 today. This represents a return of 23.7%.\n\nThe holidays would likely be happier for loved ones who got cryptocurrency as a gift last year than many clothes, gift cards, cash, or stocks.\n\nRead Next: If You Invested $1,000 In Coca-Cola Stock When Company Redesigned Santa Claus, Here’s How Much You’d Have Today"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQVG01T0pjeUJIcVRIeFl2ZnBRd0N6c1prZnJCTy1zT2VMX3F1Zk0wN2hsQkJmY25XUnM5VHdYUk1lQ1RMbU43bGExMzN0cGJsaVc0Zk5OU0hHSE1Jd0ZOTFU5MjV3ZXJibE5ReTBKYm1FR1A5Xzd6bC1iMmtMREZZMzB0cmpaOG9jT0JMQjVYZDNnSUo3cnhyTHdYQXFJSnQtZGVaM2ZGbjFXa3BwZEJpT0h3aXF4ZHJmODJHT2RONE9hMVJQOHFwSGdRTnRKMEV4UmYzNE5STzY2UERqZmo2Vmw5UlVlMW1a?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "If You Gifted Your Family $100 In Bitcoin, Dogecoin And Ethereum Last Christmas, Here's How Much They Would Have This Christmas - Benzinga",
        "content": "One of the annual traditions of Christmas for most families is the giving and receiving of gifts. While popular gift items include toys, clothes, gift cards, and money, another option is to give a gift of cryptocurrency.\n\nHere's a look back at how much a gift of cryptocurrency for Christmas in 2022 would be worth today.\n\nWhat Happened: Just like Mother's Day, Christmas is a holiday that could see the selection of gifts for loved ones in your family.\n\nGiving cryptocurrency as a gift at Christmas 2022 may not have been a popular choice for gift-givers or for those receiving gifts as the year was full of negative headlines.\n\nThe year 2022 saw several cryptocurrency platforms go bankrupt and all the major cryptocurrencies traded down during the year.\n\nIn 2023, cryptocurrencies have turned around with many of the largest cryptos outperforming the top stocks and overall broad stock market.\n\nHere's a look back at how much three major cryptocurrencies given as gifts for Christmas 2022 would be worth today.\n\nRelated Link: Tim Draper Says Yes to Bitcoin For The Holidays, Anticipates $250,000 BTC In 2024\n\nInvesting $100 in Bitcoin, Dogecoin, Ethereum: A popular gift amount may have been giving $100 in cryptocurrency to a loved one on Christmas Day 2022. Here's a look at how much one could have bought of Bitcoin BTC/USD, Dogecoin DOGE/USD and Ethereum ETH/USD based on the intraday high on Dec. 25, 2022.\n\n$Bitcoin: 0.0059 BTC\n\nDogecoin: 1,287.93 DOGE\n\nEthereum: 0.0817 ETH\n\nInvesting $100 in each cryptocurrency last Christmas would be worth the following based on prices at the time of writing:\n\nBitcoin: $254.84, +154.8%\n\nDogecoin: $119.00, +19.0%\n\nEthereum: $185.77, +85.8%\n\nA $300 gift consisting of the three top cryptocurrencies would be worth $559.61 today, an increase of 86.5%.\n\nFamily members would likely welcome the return of any of these three cryptocurrencies over the last year.\n\nCrypto Christmas 2023\n\nFor comparison, a $100 investment in the SPDR S&P 500 ETF Trust SPY, which tracks the S&P 500 Index, would be worth $123.72 today. This represents a return of 23.7%.\n\nThe holidays would likely be happier for loved ones who got cryptocurrency as a gift last year than many clothes, gift cards, cash, or stocks.\n\nRead Next: If You Invested $1,000 In Coca-Cola Stock When Company Redesigned Santa Claus, Here’s How Much You’d Have Today"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOV2dpT1pERkVXRUhIb1ZxTXhEaThxTlBpMTA0dzdOXy1ZQVJvSTZBNkR6R2w3SVF6TlZLUEl6NlN3SmlZbmxTVVYxZW9JdnNYdzdnME1sR1QtNUZENVg3WExSV21lYUNyOE5PTTZVNzJvOUVaQ0wzbFpzbmNKLU1RSjVBTURoNy1INlpDcF82OE02cW5vbXc0V2dtVmtaWmRST0U5UV9jbld6eUY5ZHRPTWIyeEFuOGZfZzdfd0hnaHRpSTB5dXZNOGI3d21GZGNMamZ1aNIB2gFBVV95cUxQT3RQaHBEZVRhSjVYVEEwcFJTNTJQMkFZSEt6Y2gzeTdRU21qUGtfczcyQks2OUtCY09LUm9nRHFkY0RkU183MWFrMHE5ZTNkU0Z3eE9mYVdTQUlMS1BoQWNRVFR2czdPTjdkaTVBanZTY0d5Ul9JNGdZM29rR1JYTzJvNjlhTkltRVVreVl6ZmNuRHNPLVMtWVg0UnMwNE9OT09MdndqamhTclNGeDRKVXU3UnJ4WEE2ZHQ4cmVvQjVDY2NOZnhoTkVqMVJZaG9oUndaQ0I1SVJ5UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Solana Surges Nearly 83% in a Week As SOL’s Decentralized Exchange Volumes Now Rank Second After Ethereum’s - The Daily Hodl",
        "content": "New data from decentralized finance (DeFi) tracker DeFi Llama reveals that surging altcoin Solana (SOL) is now the top traded digital asset on decentralized exchanges (DEXs) behind Ethereum (ETH).\n\nSolana’s trading DEX volume has soared by more than 25% in the past week for a total of $5.6 billion, catapulting it into the second highest traded digital asset on DEXs, according to DeFi Llama. On December 13th, Solana ranked just fourth by DEX trading volume.\n\nEthereum is the top traded DEX asset with $8.89 billion in trading volume in the past week.\n\nIn the past 24 hours, Solana’s DEX trading volume totaled $895.9 million compared to ETH’s 1.07 billion.\n\nSolana is trading for $122.32 at time of writing, a 7.73% gain during the last 24 hours and a massive increase of over 1,000% since the start of the year.\n\nAs the ETH competitor’s value surges, the network is gaining participants. Last week, stablecoin issuer Paxos announced its expansion to the Solana network after exclusively working with the top smart contract platform.\n\nThe New York-based crypto firm will release its dollar-pegged crypto asset, Pax Dollar (USDP), over the Solana blockchain starting January 17th, 2024.\n\nAs stated by Raj Gokal, co-founder of Solana, in a press release,\n\n“Paxos’s decision to bring stablecoin issuance to the Solana blockchain will showcase how Solana’s high-performance network and low transaction fees can support regulated financial products and provide leaders like Paxos new ways to scale and innovate”\n\nSolana has also seen high interest in its Web3 smartphone, Saga, which recently sold out after sales began in April. Buying Saga came with a reward of free Bonk (BONK), a surging meme coin built over Solana.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Rattanamanee Patpong/WhiteBarbie"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNS2pYWUhRTF9zREVZSDhPNVpYOE1va2JQd3hZbGFwS3ZZbU13Qm1SajVmbDhKdGNBMl82a3daUENTVTRnNzkyM3RQdHNicFFzS3ZGREtVcXFvMEV1b2J3UDdjUGhQZG5hMEJGRUpDZGM4SU84N2JoOGxSYU9zMDJtWDZiWXcxZGhCN0dTUFpRVms1cUlsQTFUcDczdDFRbXZFUmlfTG1HQ3Z5dXVjSlBwZ1NZOXRfdHRWdEFWcm00cjJhWkR2eldUX2RTU2zSAdIBQVVfeXFMTVFJSEhTYjFSc3k5ZEIycEp3NlFYeGJGXy1Odm81dzRveFc4aV9abU5VZWNhSVFvVzFPMWc4SHNoa2E4UVBrUXlPSXUyd0c0U2F1UEdIdDJzd0xuejlFU1dkc1kwd3U5R0hldW40d0VFZW1ETUR0cUNfYi1HdHdBa3lXRGdKWkJuNTVudDRQb285N1Y3eVRvUWFidVV6OG9xTTVNOFpIQkNFQ3gwai1VLWZBLUQ1M21FYmV4UHRrazd5MmtRS0VHYkZtM1M5VHRzOUFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Top Analyst Unveils Ethereum Catalyst That Could Trigger Nearly 50% Surge for ETH – Here’s His Outlook - The Daily Hodl",
        "content": "An analyst who nailed the end of the 2021 Bitcoin bull market believes that Ethereum (ETH) will rally behind a catalyst that’s been overshadowed by the potential approval of a spot market BTC exchange-traded fund (ETF).\n\nPseudonymous analyst Pentoshi tells his 727,600 followers on the social media platform X that the possible approval of spot Ethereum ETFs next year will likely give ETH a much-needed shot in the arm.\n\nEarlier this year, multiple asset management firms including BlackRock, Fidelity and Hashdex filed applications for spot-based Ethereum ETFs with the U.S. Securities and Exchange Commission (SEC).\n\nPentoshi says that Ethereum will likely generate bullish momentum as market participants anticipate the event.\n\n“We’ve been bull tweeting the BTC ETF since $25,000-$28,000. Soon, we get to do this all again with the ETH ETF in 2024.\n\nNo matter what you believe, it’s all game theory. As the date approaches, people will be less willing to sell, and others will feel the need to buy. $2,7xx and $3,400 on the table.”\n\nPentoshi is not the only crypto strategist who believes 2024 will be a good year for ETH. Trader Michaël van de Poppe tells his 678,200 followers on the social media platform X that Ethereum is likely in the process of carving a bottom against Bitcoin (ETH/BTC). He shares a chart that shows ETH massively outperforming BTC in the first few months of 2024.\n\n“Ethereum isn’t dead. There’s a temporary snapshot of hype taking place that other ecosystems are better.\n\nThey aren’t.\n\nThe best quarter for ETH is the first quarter of the year and that’s approaching.\n\nThree to eight months prior to Bitcoin halving -> bottoming period.”\n\nBased on the trader’s chart, he seems to predict that the ETH/BTC pair will rally toward his target of 0.12 BTC worth $5,243 by April next year. At time of writing, ETH/BTC is trading for 0.05257 BTC ($2,297).\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Terablete"
    }
]