[
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNM3pMdzJFSzdMMnZoU09NRW5MLTNoaVk1cGI4b0htempoaVhKOWdqakdUbjdUUEVpc1dELVVtNFhiZWYydWZKdWI4MGstRzFXcEhON1RnM3FlRTJKZ2pQcjB4WnV2S1JwR0pxRUtsS0phdXdHcjhKdVctSWlqR1ZmVW4taUtJdlExdmJXQjVoODNuSjkzX3dlZWdZTmRPLXdp0gGmAUFVX3lxTE5lWEF4VEtINUJwSWJ3eEF5YkNtQWFuY3N1TlZKV3FfTklUV2x3UlpKVnAzZWZXQXc0RUVBUFcyMC1SN3NGOWVTZC0zdE4xZ1NjRkFtbzBobG0yNkF6SFFWazllLUJsZ01VUGY4TFZzdEtTNnVjZ0xUeUJUSGNITzhqcVZzWGFJWGROU0dGUGhvTnctalJnTXVUVnhHU25Nc3I0bzVQcXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Dec 2023 08:00:00 GMT",
        "title": "Cantor Fitzgerald CEO Howard Lutnick Is a Bitcoin Maxi and Tether Fan - CoinDesk",
        "content": "\"I am a fan of crypto, but let me be very specific: bitcoin, just bitcoin. These other coins, they are just not a thing,\" he said during an interview with CNBC's Money Movers podcast . Lutnick also said that he's a fan of Tether, as Cantor Fitzgerald is one of the stablecoin's custodians."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNNG1zVzVZdTRWbU9KcnMxRTFwVzU5LUNzTDJjdlYtMjZNcm51MWlMNFVrc0RGMC00Tk5RWVBtWjQ5Y3pyZ0xPSlhSZ1ZQWHZfTVVtN1d6dnhOM19uS0liSVhqUXppLUh6Qi0wcm5JbDhDbUpFaVdNZWFEc2cyS21QXzduRmxBbUtVamJ5elBSbm5KNUE2LVZpOXQ4TUNqMEF0UlBOOFZHYVIxQi1kTGpHOUJBSErSAboBQVVfeXFMUFluMTlPNVhHdS1MWjVLUDk4dGxpTHFtV2I2TlZ1d25qQ3M4bHRyVktWNy1wVkNON1F0VnJNTFNzazlGWTJSYk4tTmk4bVJuLV9DVGVUWUc0bzVxX1JaLVlfTm9vYnVTZktHQUR0Qmo3SWxoa0VCTTg1SmRCUVBiVG9ka19tUG9idTYxYWwtTVJEbDhhaDljZnZLYjlRTVVWaXR4SWdfYXR4d2Jfc1ZSYi1PclRBUmh2dXdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Dec 2023 08:00:00 GMT",
        "title": "Crypto Exchange Coinbase Lists New DeFi Altcoin Project Built on Base Blockchain - The Daily Hodl",
        "content": "Coinbase, the biggest crypto exchange in the US, is listing a new altcoin project built on its proprietary Ethereum (ETH) layer-2.\n\nIn a new announcement made through the Coinbase Assets account on the social media platform X, Coinbase announces they are listing Seamless (SEAM).\n\nAccording to the Seamless website, the crypto project is the first “native, decentralized, non-custodial lending and borrowing protocol” built on the Coinbase-backed layer-2 scaling solution Base.\n\nProject incubator Coinbase says Base is designed to offer a safe, low-cost, developer-friendly way to build on-chain. The layer-2 network is powered by the Optimism (OP) development stack and is compatible with Ethereum, Ethereum layer-2s and alternative EVM chains.\n\nAccording to Seamless, SEAM is the protocol’s new governance token.\n\n“SeamlessFi is excited to introduce SEAM, the governance token of Seamless, which is Base’s largest native lending protocol!”\n\nCoinbase is listing SEAM as the new governance token is being airdropped.\n\nAt time of writing, SEAM is less than 24 hours old, making it relatively volatile, which is why Coinbase is listing the asset under its Experimental Label.\n\nSEAM is currently worth $13.11, down 5.8% from its all-time high of $14.35, reached mere hours ago.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    }
]