[
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOdm9VVkZmRlFFLW5EUFItenlyNFk0ZFJHXzhJN3UxOHZaRFpFV25Dd2NDeG5BNjd6X253eWRsT3BqY09EbnNCS3I5U0J3QVdzVjc3SFd5Ql9KM2o0Nk1CZkRaTm1xVWNpaURtZ0RPYVphMkUxNGt0UFRHNzlOVjlXTjhBWXRmb2dib3hGbTV6SlVtbGp0QlpZQlh0RGJWeE9BdVRFZldKRTNHcEhaSE53T240U1E0WktlS2Q4aS10SHp2NFFoa1FrQUhSMWpDd9IB2wFBVV95cUxPQTY5amxFSGVxRzRtT2JVZVVSUk82YjItUGdpbEFJNDNlX3FiWmN2R2tGR3FVSnVaZ25PU3ljaDJqM2hlWFcxTm5OMFl6V0ROak5lME9PbU51dEpfaS1hbjdYZGJvMFBmall4eTc4bW1RcExDRkdEUkxTVk5lVUF1M2E5MXdSdTBtQk9yZl9RN2RIWFc5cldvUVFWS3NWODdfUXF0bENQaGVISW53d3E4MnhiNlRHM3lfSFF4TDlQallaQUoyRVcxZDlQcno1andkVmJ5ZTZoMmtVRnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Solana’s Ambitious $2,000 Price Target Could Flip Ethereum and Bitcoin - Analytics Insight",
        "content": "Solana is showing no signs of slowing down as it makes an ambitious move to reach $2,000 in the coming bull run. This will likely excite SOL holders and potentially challenge the crypto giants, Bitcoin and Ethereum. Today's post will discuss more on Solana's ambitious price target and how certain new coins, such as Bitcoin ETF token, Bitcoin Minetrix, and others, are poised to revolutionize the crypto market in the coming year. Without further ado, let's dive in!"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxONGljMlRTWGpveHFaOVZMQnFBRkc3VlBuRG1EaUF5ZWt1eWVPYVhpd3lGOThmSEdTbXlreWUzVXM2VzhwV1dhZzZXbFRhSTFYdEtwWGNWRWlGNGg4aXZfNXB6Y3BVNFJxX1JHUjZYLVZ6VHBUUUZlMnoxUEd3QWJEZWVR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Ethereum: $2.5B Worth of ETH Burned Since 2022 Merge - Watcher Guru",
        "content": "An analysis of Ethereum’s financial information has shown that an astronomical $2.5 billion worth of ETH has been burned since the Merge Event in September of 2022. Indeed, Ultrasound Money shows that the supply of Ethereum is at an 18-month low, currently standing at 309,663 ETH.\n\nThe development shows a clear contrast to the inflation that Ethereum had previously observed. Indeed, the asset has now shown a deflationary shift due to the 1,195,238 ETH that has been burned. Moreover, that permanent reduction in supply will have a long-term positive impact on the asset’s value.\n\nSource: Investopedia\n\nAlso Read: Will Ethereum Flip Bitcoin in 2024? VanEck Weighs In\n\nEthereum Supply Drops by 1 Million ETH Since Merge\n\nThroughout the entire history of the digital asset sector, Bitcoin has reigned supreme. However, the rising prominence of Ethereum has caused it to be the only true competitor within the space. Moreover, the landmark merge event had been a massive moment in the increased prominence of the asset. Now, the fruits of that development are starting to take shape.\n\nSpecifically, recent observation has shown that Ethereum is $2.5 billion worth of ETH burned since that merge event in 2022. Altogether, the event has caused a net decrease in overall supply. That decrease has still been present despite the issuance of $1.86 billion worth of the digital asset.\n\nSource: Bitcoinist\n\nAlso Read: Ethereum Whale Makes $78 Million Profit After Investing $11 Million\n\nCurrently, Ethereum’s total supply is at its lowest point since that Merge event, with 120,211,380 ETH. Moreover, that supply equates to a market cap for the asset that is still north of $266 billion. Subsequently, it further reiterates the place Ethereum holds in the greater digital asset market.\n\nThe effects of that very Merge event are already being felt, but still have longstanding positives to be uncovered down the line. The decrease in supply will have a massive impact on the token’s scarcity. Therefore, it will only grow in value overtime, and potentially ascend to previuoly unkown heights."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOeDd2alRCeGIyRUVxd19LdHFnZkM2NWJvUHdxUFd3ZDlLMVo0WFlWRDVQbFdlWE5icE5aNnVwVFRCNGlDSVh3WDFuWG9GZlZoY3puQ1I0NENLNEdoSlNLSnBObHVmU0J2bzlpM1hLNnMwZDduZlFxN2puRkZuQUd5YUY4Mno2NTRjQVVOLXFicG1oZVktM0VFZmVPSXA0c3dTbHZraUZ4b0FfWk5BdjUtdTVheGs4MFdxX1FF0gHAAUFVX3lxTE9kNllHMEVjNFduaU0yam5tVGh2YW5KeWRrNDZySlFXVW16Z0s5YlVLQUM2azFMcUpnMjlkUWY4WTI5VE5MU3NtZHM0MThBeEVHNDlQdUxUaDJUYVNFd2Q3eGY0Qk5LaDE0QXRHTEMwRUt4Zk5wTzNxYldnWkVBdjVDQWsxWHcyd24tSEl4R2o0WHJVWnpEdmdEcEk1WkpfdnVrUVFKZHFSM0hEOWZlWWs3MGNtWTNlVUhFTUNuMGlmdA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Gaming Altcoin Rallies As Massive Whale Withdraws From Binance: On-Chain Data - The Daily Hodl",
        "content": "One Ethereum (ETH)-based gaming altcoin soared as a crypto whale suddenly moved a massive amount of the project’s tokens off an exchange, on-chain data shows.\n\nAs reported by blockchain tracking firm Lookonchain, layer-2 scaling solution ImmutableX (IMX) shot up 20% as a crypto whale made big moves.\n\n“The price of IMX increased by 20% today. We noticed that three wallets (possibly belonging to the same whale) withdrew 4.3 million IMX ($9.6 million) from Binance [Monday].\n\nThis whale has six related wallets and currently holds a total of ~40.54 million IMX ($90.8 million).”\n\nIMX is trading for $1.98 at time of writing, down 3.8% in the last 24 hours.\n\nLookonchain also noticed that SATS (Ordinals) is soaring amid a key listing by top global crypto exchange Binance.\n\n“The SATS price is up ~120% since Binance announced the listing of BRC-20 Sats.\n\nOn-chain data shows that the top 20 holders of SATS hold 333.3T SATS ($150.8 million, 15.90% of the total supply).\n\nSix of the top 20 holders obtained SATS through minting, with ~78.57 million SATS ($35.5 million).”\n\nSATS is trading for $0.000000515075 at time of writing, up 123.4% in the last 24 hours.\n\nLastly, Lookonchain reported a HashKey-suspected wallet abruptly moved a massive amount of Ethereum onto Binance, suffering a loss.\n\n“The wallet related to HashKey has deposited a total of 17,108 ETH ($38.1 million) to Binance after the ETH price plummeted, losing more than $2 million.”\n\nEthereum is trading for $2,187 at time of writing, down 1.4% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxOWVNvdFc1ZWt0V2UtMmpJV0ZjaTNieHdBWlhBNGFqcFFpTy1tdVFlWmFXcU5ZQTRSNkdlQmtIYXpkdUZYWXpXZHJKUFVqWjZIOUdtYUx6T2sxRUthUVUxdDdpb1J5VFRZSXhSZlJRZUJRRUhKX0EtdkRTUVI0N21yRndrcWlRVHpYU0ZNLWtNX05BS2RSOFlYWHVNUl9Nclp6dEN6OUJJeUxzcVNpbVpybXpaakNXSERSdW5CU2NHREVTaXJtY3p4MEpjUklqdUMtUjRRVjFQR1RDbVNTbWhNNmNHaGtWckhUOXfSAe8BQVVfeXFMT2M5TGNoMGx0MlBuUnhmS0t5cUpEMGJGM1B5TThVZm00YUxpd0pQUkx3VlRsWTlnNTJuNG00YlNRa3RXUUxvdG5PVFFjSG51Z2ZEYk5kbFNmalVDNlBvQlhITi1leVNFVFAwVWhReGFHRWJ6TUpNeXkydDRENTFYWGpMN2xZWmlVMUF3NlJPTnFLVzhvazN0RlBrRmJYUXJwRk9idE9sLVI4VndzcGF0UlhsUWFyRG1CTHpqcTI5d25VTVo2TmREV1lMUGFTbnJ6S3FROUlYeTFzbGdXTnBZdjBmTUJTNTJHNllXYW1oeVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC eyes $45,000 as FOMC minutes spur volatility - FXStreet",
        "content": "Bitcoin price could rise 6% to test the $45,000 level amid rising volatility steered by broader market macroeconomics.\n\nEthereum price coils up for a 7% move to the range high of $2,403 as the bulls scale a comeback.\n\nRipple price could climb 10% to the supply zone as the $0.5773 support floor presents a springboard for XRP.\n\nBitcoin (BTC) price recorded increased volatility during the afternoon hours of the New York session. This spilled over to altcoins, with Ethereum (ETH) and Ripple (XRP) prices showing strength alongside the king of cryptocurrency. It came after the Federal Open Market Committee (FOMC) minutes with Fed chair Jerome Powell hinting at more rate cuts than he did previously. Specifically, the markets moved as the 1-year interest rate outlook fell from 5.1% to 4.6%.\n\nAlso Read: Bitcoin price shoots to $42,800 as FOMC keeps interest rates unchanged\n\nBitcoin price eyes a 6% climb to $45,000\n\nBitcoin (BTC) price has witnessed increased volatility, as the Fed kept interest rates unchanged. However, the anticipation of more rate cuts to come has inspired bullish momentum in the crypto market, with BTC standing first in line to benefit.\n\nThe Relative Strength Index (RSI) has deviated to the north, suggesting rising momentum, bolstered by the presence of the Awesome Oscillators AO) in the positive territory.\n\nIncreased buying pressure could see Bitcoin price pull north, potentially clearing the range high at $44,700 or higher, tagging $45,000, 6% above current levels. In a highly bullish case, BTC could extend to the $48,000 psychological level. Such a move would constitute a 12% climb above the current level.\n\nBTC/USDT 1-day chart\n\nOn the flipside, if profit booking ensues, Bitcoin price could pull south, potentially losing the $40,000 support level. In the dire case, the slum could extend for Bitcoin to test the $37,800 critical support, below which BTC could spiral all the way to the $32,000 level or worse, the $30,000 psychological level.\n\nAlso Read: Bitcoin price looks insecure, thinly holds above $40,000 heading into FOMC\n\nEthereum price finds strength for a possible 7% climb\n\nEthereum (ETH) price is attempting to recover all the ground lost since the December 11 fall, getting tailwinds from the FOMC-inspired optimism. Increased buyer momentum could see Ether reclaim the support due to the midline of the ascending channel at $2,288, or higher, extending to tag the $2,403 range high.\n\nETH/USDT 1-day chart\n\nOn the other hand, after a 5% climb, investors who bought ETH at the $2,147 low could be tempted to book profits. The ensuing selling momentum could see Ethereum price lose the aforementioned base, potentially descending into the supply zone turned bullish breaker. A daily candlestick close below the midline of this order block under $2,075 would confirm the continuation of the slump.\n\nThis could set the tone for Ethereum price to spiral towards the $2,000 psychological level or worse, extend a leg lower to the $1,935 support.\n\nAlso Read: Ethereum leads altcoins north as Bitcoin halts amid bull trap fears\n\nRipple price finds strength for a 10% climb\n\nRipple (XRP) price has found an inflection point, pivoting around the $0.5773 support amid rising momentum. If buying pressure increases, XRP price could foray into the supply zone ranging from $0.6572 to $0.7161. To confirm the continuation of the uptrend, the price must break and close above the midline of the zone at $0.6872. This would represent a 10% climb above current levels.\n\nThis could set the tone for an extended climb, potentially going as high as the $0.8000 psychological level, or in highly ambitious cases, stretch to test $0.8505.\n\nXRP/USDT 1-day chart\n\nConversely, if sellers have their say, Ripple price could descend below the critical support at $0.5773, with a break and close below this level invalidating the bullish scenario.\n\nAlso Read: XRP price risks 7% fall as Ripple lawyer names ‘the single biggest threat to crypto in the US’"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1raUxxb2dBMWVOOEpoLTlKYm9nYlZnaXlxMnpZSGM2bzRnNk5DdFRGSW1HTURabUR0XzlvQ2pjRl94Q2FqZXlYS3MybzRpVlQ5ODNLRkNKS1o2TUkya0w4OFl3aVFpb3JmYzdFNXVKdzRDWUJ2VjBPX0VR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Galaxy, DWS and Flow Traders eye stablecoin launch on Ethereum, Solana - Blockworks",
        "content": "Crypto firm Galaxy looks to collaborate with asset management firm DWS and trading specialist Flow Traders. Their goal is to introduce a stablecoin to accelerate the widespread adoption of on-chain assets.\n\nThe forward-looking plan seeks to capitalize on an evolving regulatory framework in Europe, but will ultimately hinge on various approvals.\n\nThe proposed stablecoin, named AllUnity, will be fully collateralized and denominated in euros, the company said Wednesday. The entity is planned to be incorporated in Frankfurt. Its next step involves applying for an E-money license from the German financial regulator BaFin. The company’s aim is to launch the stablecoin within 12 to 18 months.\n\nThe stablecoin intends to launch on several public permissionless blockchains, including Ethereum and Solana, a spokesperson told Blockworks.\n\nRead more: SocGen’s crypto unit debuts euro-pegged stablecoin\n\n“Digital currencies are the natural evolution of the world’s payment system, and Europe — a region at the forefront of the exploration of safe, secure digital money — is paving the way for this inevitable shift,” Galaxy CEO Mike Novogratz said in a statement.\n\nThe firms expect to appoint Alexander Höptner as AllUnity’s CEO, according to the Wednesday news release. Höptner has extensive experience as a chief executive, leading teams at 100x Group — the holding structure for crypto trading platform BitMEX — as well as stock exchange Börse Stuttgart GmbH and financial services firm Euwax AG.\n\nThe plans come after passage of the Markets in Crypto-Assets (MiCA) regulation in April. US lawmakers have lagged behind in making similar progress on such a framework.\n\nThe Europe regulation “we believe will contribute to growing the stablecoin market as it provides a robust regulatory framework that enhances investor protection and market integrity,” Höptner said in a statement.\n\nStablecoins — digital assets pegged to the value of another asset or fiat currency — have a combined market capitalization of roughly $130 billion, according to CoinGecko data.\n\nTether (USDT) is the dominant player in the segment with a market cap of about $90 million, USDC and DAI are a distant second and third with market caps of $24 billion and $5 billion, respectively.\n\nPayments giant PayPal debuted a dollar-backed stablecoin — issued on Ethereum by Paxos Trust Co. — in August.\n\nStablecoins enable peer-to-peer value transfers and protect against unstable currencies, as noted by Pantera Capital product manager Jeff Lewis in an October letter. They also enable users to conduct transactions without relying on the trustworthiness of service providers, but don’t come without risks.\n\nRead more: Stablecoins set to succeed where BTC, ETH failed: Pantera\n\nGalaxy has crypto-focused asset management, global markets and digital infrastructure business units. The firm in September hired ex-Genesis sales head Leon Marshall as its CEO of Europe, noting the continent is critical to its growth strategy.\n\nGermany-based DWS — formerly a part of Deutsche Bank — had 860 billion euros (about $929 billion) in assets under management, as of Sept. 30.\n\nFlow Traders, headquartered in the Netherlands, offers liquidity across major exchanges and trading platforms via its trading hubs in Europe, the US and the Asia Pacific region.\n\nGalaxy and DWS have worked together before, expressing the intent earlier this year to roll out exchange-traded products in Europe. Galaxy, with partner Invesco, is among the fund issuers vying for a spot bitcoin ETF in the US.\n\nIn a statement, DWS CEO Stefan Hoops highlighted that corporations with internet-of-things (IoT) businesses could use the proposed stablecoin to make fractional payments. He noted that these transactions could occur around the clock, 24 hours a day, seven days a week.\n\nHoops added: “Through the future creation of AllUnity, we will bridge the gap between the traditional and digital finance ecosystems to build a core infrastructure provider that facilitates secure on-chain settlement for institutional, corporate and private use.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]