[
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBwZldCTVgzT3JWSGZESG81UDZTZW9jeUlZQlhvcWpkY0tKcmxRTmd2N1BRWERBOXBRb2pRV3ktYnVta1lQc3c0cWgyUmp5V01DMklYb0NqRVZubGwxS0gzMWJqSEZQZG42am80X0UydlNpVmdkUE1Ya2wtMNIBgAFBVV95cUxPbGlzUElyYUFzeG5SZUt0dHhSQ2NINXh0RDdCUW00TVp5MkRaeUZoa3pBWGR6Z1lBT240ZXZzblZmTnk3YnEwVm5SNnR3NmIwdzlLVWJET1RDMVlMSFhjMnF5YVBVOFBhV3pIdy1iSnUxQUpza1c1b0FoWmVzVzdXMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum ETF Race: Grayscale Trust's Discount Drops to 16% - U.Today",
        "content": "Advertisement\n\nGrayscale's Ethereum Trust (ETHE) has seen its discount narrow significantly, dropping to 16%. This marks a substantial change from its nearly 30% discount a month ago and close to 60% earlier this year.\n\nNate Geraci, an industry analyst, suggests that this trend could be interpreted as a gauge of market expectations regarding the approval of a spot ether ETF.\n\nCurrently, ETHE stands at an impressive $6 billion in assets under management (AUM).\n\nGrayscale's new conversion effort\n\nAs reported by U.Today, Grayscale, the leading crypto asset manager, has applied to the Securities and Exchange Commission (SEC) to convert its ETHE into a spot Ethereum ETF.\n\nAdvertisement\n\nETHE, launched in early 2019, has become the foremost Ether investment vehicle globally, accounting for 2.5% of the chief altcoin's total circulating supply.\n\nThis followed Grayscale's recent legal victory against the formidable regulator. A federal appeals court has ruled in their favor regarding their Bitcoin trust's ETF conversion application, thus adding momentum to their Ethereum efforts.\n\nConverting the trust into a spot ETF would be a significant development for the company and the crypto market. ETFs are well-known and widely used investment vehicles that are familiar to both retail and institutional investors. This familiarity could attract a broader investor base to Ether. This would enhance liquidity and potentially stabilize the market. Additionally, ETFs generally offer lower fees and greater transparency compared to trusts, making them more appealing to cost-conscious investors.\n\nBlackRock's Ethereum ETF plan\n\nIn parallel, BlackRock, the world's largest asset manager, has revealed its intention to bet big on Ethereum. Recently, the financial titan registered the iShares Ethereum Trust and partnered with Nasdaq, intending to list and trade shares of this trust.\n\nFollowing this announcement, Ethereum's price experienced a surge, reaching a high of nearly $2,150.\n\nBlackRock is also attempting to launch a spot Bitcoin ETF. Analysts believe that the SEC is very likely to greenlight such a product in the near future.\n\nLarry Fink, CEO of BlackRock, has notably shifted from skepticism to becoming a vocal crypto proponent."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1nTDZEeWduMWdMWWxjRkttQnpxbXBEQzZpcTRBWFgxMGZCVzVRa2NvcG9mb0VUNWhlVWROOGtBWk82aFpQbmlzZ3M0dlVscEFHTjRjQW1jMGxOb2RlQS1Fa2tfdmI4cW5XQlUzdDBRZGVCRThRNHBMQTdB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum gets a BlackRock boost, but the real test lies ahead - Fortune",
        "content": "Happy Friday. The week is ending on a high note for Ethereum, which is back in the news after financial giant BlackRock filed to launch an ETF backed by Ether, the blockchain’s native currency. This led the price to jump 10%, back over the $2,000 mark, for the first time in months as investors bet that BlackRock’s entry will attract billions of dollars in new capital.\n\nThis development brings renewed attention to the world’s second-largest cryptocurrency, which has largely been overshadowed by Bitcoin and even Solana during the long-awaited rally of the last two months. But while Ethereum boosters are rightfully enjoying the price surge, the return of the spotlight has also raised some familiar concerns.\n\nThese include griping about Ethereum’s transactions costs, known as gas fees, which have soared along with the burst of activity on the blockchain that has come with more trading. For long-time crypto watchers, this will bring back unpleasant memories of 2017 and 2021 when hype over Ethereum’s smart contract promise led to a surge in price—followed by the blockchain slowing to a crawl, which in turn forced those who wanted to transact to pay outrageous fees.\n\nEthereum’s momentous shift last year to a proof-of-stake system was supposed to alleviate the price and congestion issues, along with so-called layer-2 solutions—sub-layers on the network that process transactions in batches and then record them on the main blockchain.\n\nThe trouble is that while the layer-2 systems do indeed lower costs dramatically, they add complexity and make the Ethereum user experience—already an ordeal for those who aren’t crypto diehards—even more of a headache. They are also less secure. This has led some to gripe that Ethereum should have devoted its energy to making its main network cheaper and efficient rather than outsourcing the task to other projects.\n\nFinally, the switch to proof of stake has also raised concerns over centralization as a relatively small amount of validators are now responsible for maintaining the network—a fact that Bitcoin purists, never gracious at the best of times, have lampooned mercilessly as part of the crypto world’s eternal infighting.\n\nNone of this means that Ethereum is facing major trouble—the network is the leading smart contract for a reason, with by far the most users and a robust and dedicated developer community. But as a new crypto bull market emerges, it will be harder for the platform to blame familiar headaches on growing pains. Ethereum is now almost a decade old, and the time has come for it to show it can deliver on its enormous potential.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nChainlink's LINK token is up 175% since January as the oracle provider has branched out from pure crypto pricing to tie-ups with the TradFi sector. (Fortune)\n\nThe notorious \"Cryptoqueen\" who oversaw legal and compliance for Ponzi-like OneCoin pled guilty in the $4 billion fraud. (WSJ)\n\nEconomist Nouriel Roubini, a.k.a Dr. Doom, has long been a fierce critic of Bitcoin and crypto, but in a surprise move is launching his own stablecoin. (The Defiant)\n\nIn a first-of-its-kind crypto bankruptcy exit, a restructuring plan will give Celsius customers 37 cents on the dollar and shares in a new company dedicated to staking and mining. (WSJ)\n\nBitcoin brushed $38,000 on Thursday, the highest the token has traded in 18 months. (Fortune)\n\nMEME O’ THE MOMENT\n\nTFW you learn one-third of Ethereum nodes are 20 miles from CIA headquarters:"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPelZ3eWk2a3pJSE1BOWY1aHY2RU1mWEU1VUp2dGgxaERES0xGeHpYQXBGZ1lkVnpLNTU2SDk2MVFRTFFvMWZuV0h2YVh4TnY4RlBMYjFMM1B5UEpoQTRBMW1tNTRvWEFsVVd4Sk5wQlBiRF9qRGhfaWhLX2J6MkZJc1Fnb0ZZa0ZHLXVDUjRQWFc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Solana Is on a Tear. So Why Do Ethereum NFTs Remain Top Dog? - Unchained",
        "content": "SOL more than doubled in the last month. But here’s why Ethereum NFTs continue to outperform Solana NFTs by a mile.\n\nSolana is ripping. Not only has general crypto market sentiment turned more positive, which has boosted assets beyond just bitcoin, but Solana also just completed another one of its attention-grabbing conferences, Breakpoint. That’s all led to SOL more than doubling in the past month.\n\nDespite developer interest in Solana, the jump in its token price, and the fact that the speedy chain is known for NFT activity, as of yet, the leading blockchain for NFTs remains Ethereum.\n\nRead more: NFT Trading Activity on Ethereum Surges, Reaching a Six-Month High\n\nAccording to data from CryptoSlam, in the past 30 days, Ethereum led the NFT market in sales volume with $245 million in sales. Ethereum’s activity underscores its dominance, with a vast number of transactions totaling 745,175 and engaging 70,423 buyers.\n\nComparatively, Solana, which stands fourth in the ranking, reported $30.1 million in sales, just 12% of Ethereum’s volume, even after considering the fact that SOL has outperformed ETH by 127% in the last 30 days.\n\nWith Solana struggling to grab market share in the NFT ecosystem, Hildebert Mouiliere, aka Hildobby, a data scientist at VC firm Dragonfly, told Unchained that “a lot of things that appear on [Solana] are just copying what happened on Ethereum, which isn’t very innovative.”\n\nSolana is also battling the fact that Ethereum’s longer history makes it a hub for many types of activity beyond just NFTs. “I think Ethereum has become a center of liquidity for a lot of things,” said gmoney, NFT collector and founder of 9dcc. “And not just NFTs, but also certain tranches of DeFi and what have you. And so I think that’s going to be hard to displace even though there are narratives that build up around other chains.”\n\nHowever, Solana could still become a contender if it builds on the particular advantages of its technology over Ethereum. “I hope that we see in the future some teams actually using what this tech can do to leverage what is lower fees and higher frequency transaction,” said Hildobby.\n\nRead more: Anatoly Yakovenko on Solana’s Astounding Recovery and Its Future Plans\n\nOver a year has passed since marketplaces like Magic Eden sparked a seismic shift in the NFT industry by making creator royalties optional—a move that continues to influence market dynamics.\n\nHildobby noted the complex nature of enforcing such payments and suggested that creators may need to consider additional incentives to encourage voluntary compliance. “It’s impossible to enforce those things,” he said.\n\nAs for where the market could go, Hildobby said he’s looking to the rise of NFT derivatives and lending platforms, which could diversify NFTs as financial instruments. “The vast majority of volume now is around lending, which allows for those high prices to now land at a much discounted rate,” Hildobby explained, emphasizing the potential for these platforms to broaden market participation.\n\nLearn more: What Are NFT dApps?\n\nGmoney also thinks future innovation in NFTs will come in their financialization and bringing real world assets on chain. As an example, he said, “the sneaker resell market is huge,” noting that with NFTs, “you can give them access to credit that they otherwise wouldn’t have.” Once that is a proven application, he said that could show the potential for NFTs to unlock value in other collectors’ items such as watches and handbags. “To me, one of the most interesting things is obviously, definitely the real world asset side of things, because I just think that you need to see the melding of those two worlds at some point, and I think that starts to happen over the next three to five years.”"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA5QlR4S25jVFk4ZXRGUE1RWGc1eERiN1R4WFZKQURoU1hJUHdZQ3BDdEFaYkt0ZXRMSXBTdExFQ01lcUFVaWtBWDVsVVNBdEN4dFZwa2lOZHprY0haYVRyX1N3MGFXN0hiQThwTlZQQ3pJbFBNMXhBeHB0NkPSAYQBQVVfeXFMTlg0RnZ2cDU1Q2JYT0RzTEY5UUlseDNSVTBMazZ3RHpEd2J0cExSbmpnUjNvUUxNV0dpUGtLVGpCdHBkZW1RN0w5VjhrRHYxSWo4T3VrdHNXY1hRQl92UDljcTJKRVFrOWFWMHdscmNfdUJSNzM1ZmQxRmZiQU1TbWJpY05s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Here We Go Again: Pet Rock JPEGs on Bitcoin, Ethereum Sell for Over $100K - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThis week, half-giddy, half-cautious optimism spread across crypto circles as Bitcoin surged past $37,000 for the first time in 18 months on excitement regarding the approval a spot Bitcoin ETF, and Ethereum pumped past $2,100 on similar news of a pending ETH ETF application from BlackRock.\n\nThere’s clearly an emergent hope within crypto that the bottom—finally—is in. But to those who protest that it could never be a true bull market without obscenely expensive, seemingly pointless JPEGs trading hands: there’s now reason to rejoice on that front as well.\n\nOn Friday, two separate on-chain images of illustrated rocks—one hosted on Ethereum as an NFT, the other inscribed on Bitcoin as an Ordinal—sold for six-figure respective sums on secondary markets.\n\nAn NFT from the EtherRocks collection, EtherRock #95, traded hands this morning for 100 ETH, or just over $209,000. Just hours prior, an Ordinal from the visually identical Bitcoin Rock collection sold for 2.99 BTC, worth just over $111,000 at writing.\n\nAD\n\nAD\n\nThe JPEGs do not come with any affiliated memberships or perks, or anything that doesn’t meet the eye. They are, quite simply, lightly illustrated images of nearly indistinguishable gray boulders that don’t even feature backgrounds.\n\nBitcoin Rock #75 has sold for 3btc on the secondary market. Congratulations to @Scobra9000 on the sale. A warm welcome to @GrantWSchneider, already a legendary collector in the ordinals community, who has now taken it to the highest level. pic.twitter.com/wkqkk8Kbn9 — BITCOIN ROCKS ◉ (@ordrocks) November 10, 2023\n\nDumb as rocks?\n\nEtherRocks first launched in 2017 to little fanfare. Only during the height of the NFT bull run, in late 2021, did the 100-piece collection catch fire—largely as a means to poke fun at the absurdity of value and the crypto market. Individual EtherRocks regularly sold at the time for hundreds of thousands of dollars a piece; one sold for the equivalent of $1.3 million.\n\nAD\n\nAD\n\n“Monetary value of art is all an illusion,” an EtherRocks buyer wrote at the time. “The pet rocks present the perfect shock value, it’s so stupid that it’s perfect. Fate loves irony.”\n\nIn January, an apparently unaffiliated Ordinals user inscribed a set of 100 images almost identical to the EtherRocks onto small denominations of Bitcoin, creating a new collection: Bitcoin Rocks. While that Ordinals collection has not enjoyed the same success as its Ethereum predecessor, it has generated five-figure secondary market sales in recent months.\n\nIn the context of recent market trends, though, Friday’s sales appear to be hitting differently. Numerous Twitter users saw the news as a harbinger of the return of the type of obscenity, absurdity, and flagrant financial foolishness that defined the previous crypto bull run.\n\nLol that scam again.\n\nWe're so back — Dr.M₳ryJ⚡I buy Shitcoins,I hold ₿itcoin ❤₳d₳ᴺᶠᵀ𓊽 (@mary_el83) November 10, 2023\n\nMembers of the crypto community appear divided about whether that’s a good thing or a bad thing.\n\nThis space never fails to amaze me — sugarspicysauce (@sugarspicysauce) November 10, 2023\n\nBut despite the return of bull market antics, crypto activity is nowhere close to the levels enjoyed when EtherRocks were last ascendent. Though Bitcoin Ordinals trading did indeed hit a six-month high earlier this week, and NFT trading volume posted its best numbers since August, those numbers still pale in comparison to the type of volume witnessed during the 2021/2022 NFT bull run.\n\nLast week’s apparently encouraging NFT figures, for example, marked a 93% decrease in trading volume from the market’s peak in April 2022. But these pricey digital rock purchases point to at least a desire for the same kind of frothy, frenzied excitement that defined that earlier era.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQN1VrcXliLS03bTlVd3Rya09OWDNZY05PeFFiRzFFcGIzVFZCbHV3Q3VNdEFOT05jWkhYUGw1YVAzVzh4UzJOZF9yc19BdE9LQ1JxZ3JBZS1EZXZuYXp4RHhmNmJULVdkMnk4Z2FaOVl3bmtFcVA3X2FfTnNweDRVQm9nd2d3dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum hits 52-week high: analyzing the surge beyond $2,000 - crypto.news",
        "content": "Ethereum’s latest surge to over $2,098 signals a bullish market trend. What’s driving the price, and how far will ETH go?\n\nEthereum (ETH), the second-largest digital asset by market capitalization, experienced a noteworthy surge on Nov. 9, reaching its 52-week high of $2,137.\n\nAs of this writing, Ethereum is well above the $2000 mark, trading at approximately $2,098, marking a nearly 10% increase within a 24-hour period​​.\n\nOverall, since the beginning of the year, Ethereum has seen an impressive uptick, increasing by more than 75% year to date (YTD)​​. However, despite these gains, Ethereum is still considerably below its all-time high of $4,891 in November 2021​​.\n\nLet’s delve deeper into Ethereum’s recent price action, explore the underlying factors driving this surge, and provide insights into where Ethereum could be headed in the coming days.\n\nWhy the ETH price is up\n\nThe recent surge in Ethereum’s price can be attributed to a combination of factors. One of the significant triggers for Ethereum’s price increase on Nov. 9 was BlackRock‘s registration of an iShares Ethereum Trust in Delaware.\n\n🚨BREAKING: The iShares Ethereum Trust has just been registered in Delaware.\n\n\n\nBlackRock did the same thing before filing for a $BTC spot ETF. $ETH spot ETF incoming?\n\n\n\nh/t: @SummersThings pic.twitter.com/e4kxAZrcOG — Miles Deutscher (@milesdeutscher) November 9, 2023\n\nIndustry observers believe that Blackrock is preparing to launch a spot Ethereum exchange-traded fund (ETF) following the potential approval of its spot Bitcoin ETF proposal.\n\nYou might also like: Understanding Bitcoin’s recent market dynamics and price predictions\n\nBlackrock applied for a spot Bitcoin ETF on June 15, 2023, and is now awaiting a verdict from the SEC.\n\nBloomberg Intelligence analysts have indicated that the U.S. Securities and Exchange Commission (SEC) might soon decide on the approval of 12 Bitcoin ETFs filed by major Wall Street firms, which has contributed to the bullish sentiment in the crypto market​​.\n\nNew Research note from me today. We still believe 90% chance by Jan 10 for spot #Bitcoin ETF approvals. But if it comes earlier we are entering a window where a wave of approval orders for all the current applicants *COULD* occur pic.twitter.com/u6dBva1ytD — James Seyffart (@JSeyff) November 8, 2023\n\nThis window for all 12 ends by 11/17. But theoretically SEC could make a decision on the first 9 on this list at any point from now until Jan 10, 2024.\n\n\n\nI've added a column for those that have provided amended S-1's/prospectuses (ive been repeatedly asked about this on here) pic.twitter.com/OlGajPkhZA — James Seyffart (@JSeyff) November 8, 2023\n\nETH on-chain metrics\n\nETH on-chain volume\n\nOn-chain volume refers to the total value of transactions conducted on the Ethereum blockchain. In September 2023, Ethereum’s on-chain volume was around 1.5 billion, which has increased to 2.62 billion as of Nov. 10.\n\nETH on chain volume | Source: The Block\n\nThis metric is crucial as it indicates the level of activity and usage of the Ethereum network. A higher on-chain volume often suggests increased adoption and utilization of the network for transactions.\n\nGenerally, a higher on-chain volume can signify heightened investor and user interest in Ethereum, which can positively influence its price. As more transactions occur, it implies a robust demand for ETH, potentially leading to a rise in its value.\n\nETH deposited to the Beacon Chain\n\nThis refers to the amount of ETH staked in the Ethereum 2.0 Beacon Chain and the number of validators participating in the network. The staked ETH in the Beacon Chain increased from 786,000 in August 2023 to 885,000 as of Nov. 10.\n\nDeposited ETH on the Beacon Chain | Source: The Block\n\nDepositing ETH into the Beacon Chain for staking is vital for the security and operation of the Ethereum 2.0 network. More staked ETH and validators mean a more secure and decentralized network.\n\nAn increase in staked ETH and validators can boost confidence in Ethereum’s long-term stability and demonstrate a commitment from stakeholders to the network’s success, which can be a bullish signal for investors.\n\nEthereum (ETH) price prediction\n\nWhile exploring Ethereum price predictions, it’s crucial to acknowledge the inherent uncertainties in such forecasts. These predictions are speculative and subject to market volatility.\n\nAn ETH price prediction for Nov. 25 projects a value of $2,199.93, showing a 5.17% increase. For December 2024, the ETH prediction is around $3,555.88.\n\nAn ambitious ETH price analysis suggests Ethereum might reach $4,487.64 in 2023 and potentially $6,809.84 by 2025.\n\nRemember, cryptocurrency investments are risky, and market predictions can be inaccurate. Never invest more than you can afford to lose, and consider seeking professional financial advice. Stay informed and cautious, especially in the volatile crypto market."
    }
]