[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNdXJKZ1MzVExjdTRVZHZQQ1pEaVJLNHVScWpreTJrbXVzc2pBLWNodXg5dV9hRUZRQUR3LTIwSkdSeWxYSEhiMkdFanEwVHNzQjQ4enVCNG9mVHZkWF8tVzIwUTVNMk16ejZyNVhLMVlxU0Vwbjh2eDE5T1ZiellzRnJiT2V3MjFNNmt5RzFCdDBTbm9TUmF1UWQtTkFvdTRnNkg5aDB3UDJDcUMzbXBMNmdfb0duWU81ajF5em9hUjlZeENOa3k1Nk5B0gHPAUFVX3lxTE5FRldwSVVCWTZ6YmVQRGZ3OF8wTEtad0NZTWkxUDRibUp2d2FvMFVyVGlFTS1KclR6YjEtWE8ydUlxTWhSLVNEYW0wdHRVdVMzZHJzTjl0ZGpQVjlYdHAwaFdXNjNqUk5qM3oxQl95eFI4aFFiWkJVR0pfV19TNzRCZVVka1JfVExxNWRDRlpWRThaMmJRekVISkpUM1FvVTZZOHQwanQ1cnQ2MEVHOUtReTgyNUUxVkRjXzB6SHRRZ0Y1b2U3aXJoeHZmTWRUcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Nov 2023 08:00:00 GMT",
        "title": "Trader Unveils Bull Market Price Targets for Bitcoin, Ethereum, Solana and Two Additional Altcoins - The Daily Hodl",
        "content": "A closely followed crypto analyst is sharing his price targets for Bitcoin (BTC) and four other digital assets.\n\nPseudonymous analyst Inmortal tells his 201,000 followers on the social media platform X that Bitcoin could soar by more than 255% from its current value in the next bull market.\n\nHe also says that Ethereum (ETH) could soar more than 393% from its current value and ETH competitor Solana (SOL) could soar more than 813% from its current value.\n\nLastly, the trader predicts decentralized oracle provider Chainlink (LINK) could soar more than 1,190% from its current value, and 0x0.ai (0x0), an AI-powered smart contract auditor, could soar more than 3,378% from its current value.\n\n“I don’t usually do this, but here it goes. Bull run (2024-2025) predictions:\n\nBTC: $131,000\n\nETH: $9,800\n\nSOL: $490\n\n0x0: $4\n\nLINK: $180.”\n\nLooking at Ethereum, the trader predicts that ETH will soon take out recent high prices and cross the $2,100 level within days.\n\n“Sweep the highs first.”\n\nHe also predicts that 0x0 will continue its strong performance against Wrapped Ethereum (0x0/WETH) and hit 0.00110 WETH in early 2024, up from its current value of 0.0000557 WETH.\n\n“Casual +70% up move in one week.\n\nAnother normal day for 0x0 holders.”\n\nBitcoin is trading for $36,851 at time of writing, down 1.8% in the last 24 hours. Meanwhile, Ethereum is trading for $1,985 at time of writing, down 2.2% in the last 24 hours.\n\nSolana is trading for $53.66 at time of writing, down 5.8% in the last 24 hours, while Chainlink is trading for $13.95 at time of writing, down 4.5% in the last 24 hours.\n\n0x0 is trading for $0.115 at time of writing, down 13.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE10OElkWmYzSU1mSDhYaGNDbHNpZUdkemVhRXFuZmZjNERKaDdjelhEdHZrTmRQOTcyTnZWX0tDU2pZWkI5eFJab0tSMzh0bDBxb21wbkdyMEJ4NmZrZ09CQ1FlVEVqdnJMS0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Nov 2023 08:00:00 GMT",
        "title": "Huobi’s ‘Heco’ chain bridge drained of $87M in crypto assets - Blockworks",
        "content": "The bridge connecting the HTX exchange (formerly Huobi) and Ethereum was exploited for approximately $87 million in crypto assets early Wednesday.\n\nLarge quantities of ether, tether (USDT) and a wrapped version of bitcoin (HBTC) were seen leaving the bridge for a previously unused Ethereum wallet.\n\nThe suspicious transactions were first analyzed by various blockchain security firms including CertiK, Peckshield and Cyvers.\n\nAccording to CertiK, the bridge’s private key was likely compromised.\n\n“The suspicious transactions were initiated by the Huobi HECO Bridge operator wallet indicating that this wallet was compromised,” a CertiK spokesperson told Blockworks.\n\nRead more: Crypto exchange HTX loses $8M in weekend hack\n\nVarious other ERC-20 tokens were drained, swapped for ether, and distributed to at least 8 other wallets.\n\nTwo hot wallets of HTX Global (formerly Huobi) lost funds, according to Cyvers. Board member Justin Sun confirmed the incident on X.\n\n“HTX and Heco Cross-Chain Bridge Undergo Hacker Attack. HTX Will Fully Compensate for HTX’s hot wallet Losses,” Sun said.\n\nJustin Sun assumed control over the Huobi Eco Chain in October 2022, Bloomberg previously reported, although Sun denied he owns a majority stake. He referred to it as a merger with the Tron and BitTorrent Chain ecosystems, which he also controls.\n\nThe primary purpose of the HECO bridge is to enable the movement of digital assets between the Huobi Eco Chain and other blockchain networks, such as Ethereum.\n\nThe HECO hack is not an isolated incident but rather part of a pattern of security lapses in blockchain projects associated with Sun. Poloniex, an exchange acquired by Sun, suffered a $100 million exploit two weeks ago, which security analysts believe also may have resulted from compromised private keys.\n\nPoloniex officials have been in the process of negotiating with the hacker in that case.\n\nIt’s not yet clear if the two thefts are directly related.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNWmdrWUsyTm9KRWYyYXREX2gyM29mck1aWVJ4TXpQcDBJWmVnTFAyUUZQRFZlZWNDcmZBNkdvd1VJQkVoSkdvR2ttdm93WDUxUWwyblFnM0RKSjNHSzVDa0JxRkktelNVS3E0M29OVHZPQUV1UkNkR01GdHdkWjFkeUlWS25hTEMtSjBKaEQtWTQ2ZGkwZ3NwVNIBoAFBVV95cUxPVGNDSVkxU3ZLaXIwZ3NkYktNRnpUUWpJWkZUelkyMUZlRFptZVBUQnJDZWVLcHE2LWp5d0d3VkowbTFqMEhXSTR0djJIMDl1NVVjODdJMTZjdWVHTnpoS01LallTX1N1SnRKTUkxTnpLZVRnYzFiTmE2Ry15YjFuUkFfOHpDU1p4eUNlczRXSy1ValFaal8zNW5VeXhxS1NE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Trade Sideways as Binance Turmoil Drops BNB 11% - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum were mostly trading sideways on Wednesday after news that Binance's boss stepped down from the world's largest crypto exchange and pleaded guilty to anti-money laundering violations sent the BNB token plummeting.\n\nCoinGecko data showed that Bitcoin was trading for $36,609 as of this writing—a drop of 2% in the past day. Over the past seven days, it's up 0.3%.\n\nWhile Ethereum, the second-biggest digital asset, was up by more than 3%, trading hands for $2,034.\n\nBut Binance's BNB, the fourth biggest digital asset and the utility token for Binance's exchange, was continuing to drop—and fast—Wednesday morning Eastern Time. It had dropped in price by over 11% and was priced at $231 per token.\n\nAD\n\nAD\n\nYesterday, Binance CEO Changpeng Zhao agreed to step down from his role at the company as part of a settlement with the U.S. Department of Justice. The settlement also stipulates that the exchange has to make a complete exit from the U.S.—that includes its Binance US exchange and the U.S. customers who were trading on the dotcom exchange.\n\nAs a result, traders are selling their BNB holdings. Approximately $3.3 billion worth of BNB has changed hands in the past 24 hours, almost all of it on Tether (USDT) trading pairs, according to CoinGecko.\n\nThere's a very short list of times BNB volume has been higher: During the 2021 bull market, after TerraUSD collapsed in May 2022 and the day Binance announced it had a tentative agreement to acquire FTX before calling the deal off. FTX filed for bankruptcy days later.\n\nOther major coins and tokens such as Avalanche, XRP, and Dogecoin all dipped in price. AVAX is suffering the most, having dropped 9% in the past day. XRP and DOGE have each fallen 2% since yesterday.\n\nAD\n\nAD\n\nDecentralized exhange Uniswap's UNI token surged in price, though, and was at the time of writing priced at $5.66—a 12% 24-hour jump.\n\nThe DOJ said Tuesday that the crypto brand didn't have sufficient anti-money laundering and Know Your Customer controls in place. As a result, the platform was used by terrorists, cybercriminals and child abusers wanting to move funds.\n\nBinance agreed to pay a $4 billion settlement—one of the biggest corporate penalties in U.S. history—and exit the American market. Zhao pleaded guilty to failing to maintain an effective anti-money laundering program.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNWmdrWUsyTm9KRWYyYXREX2gyM29mck1aWVJ4TXpQcDBJWmVnTFAyUUZQRFZlZWNDcmZBNkdvd1VJQkVoSkdvR2ttdm93WDUxUWwyblFnM0RKSjNHSzVDa0JxRkktelNVS3E0M29OVHZPQUV1UkNkR01GdHdkWjFkeUlWS25hTEMtSjBKaEQtWTQ2ZGkwZ3NwVNIBoAFBVV95cUxPVGNDSVkxU3ZLaXIwZ3NkYktNRnpUUWpJWkZUelkyMUZlRFptZVBUQnJDZWVLcHE2LWp5d0d3VkowbTFqMEhXSTR0djJIMDl1NVVjODdJMTZjdWVHTnpoS01LallTX1N1SnRKTUkxTnpLZVRnYzFiTmE2Ry15YjFuUkFfOHpDU1p4eUNlczRXSy1ValFaal8zNW5VeXhxS1NE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Trade Sideways as Binance Turmoil Drops BNB 11% - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum were mostly trading sideways on Wednesday after news that Binance's boss stepped down from the world's largest crypto exchange and pleaded guilty to anti-money laundering violations sent the BNB token plummeting.\n\nCoinGecko data showed that Bitcoin was trading for $36,609 as of this writing—a drop of 2% in the past day. Over the past seven days, it's up 0.3%.\n\nWhile Ethereum, the second-biggest digital asset, was up by more than 3%, trading hands for $2,034.\n\nBut Binance's BNB, the fourth biggest digital asset and the utility token for Binance's exchange, was continuing to drop—and fast—Wednesday morning Eastern Time. It had dropped in price by over 11% and was priced at $231 per token.\n\nAD\n\nAD\n\nYesterday, Binance CEO Changpeng Zhao agreed to step down from his role at the company as part of a settlement with the U.S. Department of Justice. The settlement also stipulates that the exchange has to make a complete exit from the U.S.—that includes its Binance US exchange and the U.S. customers who were trading on the dotcom exchange.\n\nAs a result, traders are selling their BNB holdings. Approximately $3.3 billion worth of BNB has changed hands in the past 24 hours, almost all of it on Tether (USDT) trading pairs, according to CoinGecko.\n\nThere's a very short list of times BNB volume has been higher: During the 2021 bull market, after TerraUSD collapsed in May 2022 and the day Binance announced it had a tentative agreement to acquire FTX before calling the deal off. FTX filed for bankruptcy days later.\n\nOther major coins and tokens such as Avalanche, XRP, and Dogecoin all dipped in price. AVAX is suffering the most, having dropped 9% in the past day. XRP and DOGE have each fallen 2% since yesterday.\n\nAD\n\nAD\n\nDecentralized exhange Uniswap's UNI token surged in price, though, and was at the time of writing priced at $5.66—a 12% 24-hour jump.\n\nThe DOJ said Tuesday that the crypto brand didn't have sufficient anti-money laundering and Know Your Customer controls in place. As a result, the platform was used by terrorists, cybercriminals and child abusers wanting to move funds.\n\nBinance agreed to pay a $4 billion settlement—one of the biggest corporate penalties in U.S. history—and exit the American market. Zhao pleaded guilty to failing to maintain an effective anti-money laundering program.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMi9gFBVV95cUxOczJ5aGxacnBmb1B1R01tdkpWczlGYTBtT3RqVUhVT244SE5NTEVNTk5mbUhOYjlyeW9FNlk4SndLVDc4U0M5WGV6UV9zUnhZY25BTnpqZjJ3bXphMlhEY1I2aklrbWk3R19CYzNGMFJrRkJhWFF6emY0NVV4YmxjSGZSOHk1eXFkVm40ODI1c0g5T0ZTeV9lV2tFSFJHcjExTWVpcWNycE92U2tLcVJwQkhFM3ZfTjJPOFNOVkJLYmNBSUtDN0FIdUJpNWZSN195SUZHbmxTeTRVVkFKdkpESWpNYW9Zdk9mQzhqYVJlUDlPSWVRTHfSAfsBQVVfeXFMUFdFRVcxU1lRWUc1a29HQzh0TlZfMnZ6NkRSNEFSbmFKTTF3M0NiQmlqVlEzS2pFZXdDREpxRTJjbWswbHl2aGx3MmRSYzUwSE5jTmY2dzYzT3hPclUxS053SE9CMDVQYWtZQktoRGZqOEU3MThBOWRVdEs5WHh6VkRzXzg1ZUVYbXhDZjl4WnNMWm10b0RkSTRGUWlqeEFzZzJSZFFSRWQ2SjJDZm1KNUhrUUlCZ0tGVDNRUG1wejNhNUEyX0dHT1gtdFpWcFVOQkh0Z0RSc1VwaUJHR2N0VzZuZ1ZxbkpyYnhfTXEyUDkxX0hneEp1ZzBZazg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC holds up as US DoJ clears path to spot ETF approval - FXStreet",
        "content": "Bitcoin price must hold above the critical support at $36,788 to keep hope for a continuation of the intermediate trend alive.\n\nThe $1,935 support level continues to hold for Ethereum price but the slump is likely to continue 5% lower.\n\nRipple price extends south, invalidating the bullish thesis with the potential for a further 8% slump to $0.5392.\n\nBitcoin (BTC) price remains bearish, but there is hope, after the US Department of Justice may just have cleared the path for the approval of spot BTC exchange-traded funds (ETFs). According to some analysts, one of the stumbling blocks to the approval was the dominance of Binance exchange in the industry.\n\nLots of chatter on this Blackrock #Bitcoin ETF. And rightfully so. Blackrock more or less IS is the US government. They’ve also received approval on 575/576 of ETF applications.\n\n\n\nOne thing I’ll say- there is no chance, and I mean zero, that this ETF is approved with Binance in… — Travis Kling (@Travis_Kling) June 16, 2023\n\nAlso Read: With Binance market dominance under threat, experts say path for spot Bitcoin ETF is now clear\n\nBitcoin price tests key support\n\nBitcoin (BTC) price is showing weakness, recording a 3% fall on the day, with most of these losses recorded following news around Binance exchange. Testing the critical support at $36,788 and with the Relative Strength Index (RSI) showing weakening momentum, BTC could fall.\n\nIncreased selling pressure below the $36,788 mean threshold of the supply zone stretching from $36,276 to $37,301 could open the drains for an extended fall, with experts anticipating a crash to the $30,000 psychological level.\n\nAlready, the Awesome Oscillator’s (AO) histogram bars are soaked in red and inching closer to the midline by the day. This points to the bears steadily taking over.\n\nBTC/USDT 1-day chart\n\nConversely, increased buying pressure from investors looking to capitalize on the retest of $36,788 could send Bitcoin price north, first clearing the local top at $37,972 before testing the range high at $37,980 and ultimately claiming the $40,000 psychological level, 10% above current levels.\n\nAlso Read: Bitcoin price holds above critical support at $36,788 as Binance CEO CZ begins BTC halving countdown\n\nEthereum price struggles to keep $1,935 support base\n\nEthereum (ETH) price risks losing the critical support at $1,935, marking the midline of the supply zone turned bullish breaker that extend between $1,864 and $2,004. If the $1,935 level fails to hold, it could spell doom for token holders, with ETH likely sliding to the $1,800 psychological level, or in the dire case, invalidating the bullish thesis below $1,753.\n\nBoth the RSI and the AO support this outlook, edging south as momentum continues to fade.\n\nETH/USDT 1-day chart\n\nOn the other hand, increased buying pressure, enough to vindicate Ethereum price from the grasp of the aforementioned supply barrier above $2,009 could spur optimism, setting ETH back above the ascending trendline. This could clear the skies for a stretch to $2,136, denoting a 10% ascent from the current level.\n\nAlso Read: Ethereum price dilemma or buy signal before 60% rally"
    }
]