[
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQMFlnb0JVZDl3Y2trNWZBWEdzUkNLV2MzcndXYktmSEJwT2ZWVWVkTlZ0aW1wbm1FckRNUkVWZnV6SUZWTHVaNVlpbmlTOHpUNWlrajZJcW9rSjFUX25DVmctS0VhY2dhVWxvN1NOQVhMbm05c3o1ak9PbXd3U2I4ME5iMTBqdUR4Q3JpUVBfZXl4UV81d2xuTjdCc21fRTBlQVU0OFZQckV1SzM4RWhXNGVDTkZkR0hWVW1BMWxWWVpZZXdrTkRsdkJ0WHpOYVJjYmt6YXB30gHbAUFVX3lxTE9uSUFod2xrNkhKWVhOVEFWaFY4WWFuYlZyd3lfYl9RaFZMbEYxeVdKUVlPaENseWZHc0NxbHdPeEphM1pNOU84SGJtSmR6cjBEQzJycE9NcFBhYm9taDFLZHVXdFEwYWx1bnZDamFGQjVOdXFBT2cyMzg2YmxjVGhvMmE0UVRmU0l1TG5mSTd2Z2JRVUZfY0NXdzVLVlpPbFZMNl9aWHpZQzc1SjBMbFoySGppd0pQaTN1elJmSVlqd2xJTFhhOC1pMW1BZzNieTk0NV9wSWNJYkctMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Layer-2 Crypto Project’s Token Soars Over 260% in a Week Amid Launch of a $425,000,000+ Ecosystem Fund - The Daily Hodl",
        "content": "The native token of a little-known Ethereum (ETH) scaling solution has soared by triple digits amid the announcement of an incentive program.\n\nEthereum layer-2 Metis (METIS) is up nearly 20% over the past 24 hours and up 261% in seven days from December 20th’s opening price of $25.67.\n\nMETIS is trading at $92.58 at time of writing.\n\nThe explosive rise in the token’s price comes a little over a week after the Metis crypto project announced the launch of the Metis Ecosystem Development Fund (Metis EDF).\n\n“The Metis Ecosystem Development Fund (Metis EDF) is a 4.6 million METIS fund dedicated to accelerating adoption in the Metis ecosystem. The Metis EDF will be used to fund grants for new project deployments, product development for existing DApps, Builder Mining rewards, sequencer mining, and more.”\n\nAt the current price of $92.58 per METIS the fund’s allocation is currently worth nearly $426 million. The Metis Ecosystem Development Fund is expected to commence disbursements in the first quarter of 2024 and the funds will be distributed over the course of a decade.\n\nThe lion’s share of the funding, 65.4%, will go to sequencer mining while 34.6% will be allocated to ecosystem funding. Sequencer mining is the process by which various parties stake their tokens to earn mining rewards while assisting in block production.\n\nAmong the potential beneficiaries of Metis EDF’s ecosystem funding include sectors such as decentralized finance, Real World Assets tokenization, decentralized identity and privacy solutions, blockchain gaming and metaverse applications and prediction markets.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxONGhzOG1ZdFFDWC02RFlJQWpsdkhMWWZfdUlKZnp2NkQzaUMwUjFUNFZEQ1cyTWJERS02NjV0MmtrYjAyWGNXMm40SmE4Mm92WmdWTVE3TGdZckxPeGp3dmYwS1BmUHNvVjhrVmpreUZHRDVGMDJpWUUxbU9VN1lsSzFRd0NZYXVxWUt0OVp5SE16RTAwUkE5Mm5VOG1JdlhHTlZZbUlTUzk1U25nY2ZoOFMwT3JLeG5tV2F5VDhfeGlaOGZWZlMwZ1pzV19EdS1QTW04NnZ1Z2VGSUlRVk1vcGp2NEnSAeoBQVVfeXFMT3NfbUl5QzRYODhPejZ2VXRLTUpka1FtYl9ubE1FWVlGbnlTUGVIbll4SHVxNEFkNEJmN1I4X2hXVkUzd3diMW5NTHFEb3VfeWJwdlVxOVdHN3VHdjg1MlFvbXJGcEpiaDRYYWplRWdmTG9veHU4WVNzWG5aakpPd2xjaVVwd1ZIeFhlb2dNbHVoTWlYRm5EaVI0Q0doeTNjRUZtM0V0WmVBd2ZFS0JjejdvY0FXZ3NuUklZM1hPMnBlaGQ0amIxdDI3VHJKUEVDcUU3U3Zvb1lyTkxLSzNmV19LQXhfWkVtMkZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH will likely rally to $2,550 following recent bullish breakout - FXStreet",
        "content": "Ethereum price validated the inverse head and should formation, which is a known bullish pattern.\n\nOn the short-term timeframe, ETH is likely set to witness another 5% growth to meet the target price set by the pattern.\n\nPrice indicators also suggest room for further increases; however, ETH might not be able to breach $2,440.\n\nAhead of the new year, cryptocurrencies are exhibiting volatility, with no asset following a fixed pattern. This kind of behavior is expected before a major event that can have a considerable impact on the price action, and in the crypto market’s case, it is the upcoming spot Bitcoin ETF approval.\n\nEthereum price sees another bout of growth\n\nEthereum price trading at $2,433 recently breached a crucial resistance level marked at $2,334. This price point is key to a historically known bullish pattern called the inverse head and shoulder formation.\n\nThe Head and shoulder formation generally signals a bearish outcome, but this pattern does the opposite. Inverse head and shoulders is a reversal pattern that is formed by three consecutive lows along with two intermediate highs. The first and third lows are called shoulders, located approximately at the same level above the second low – the head. Another important line is the one drawn along the intermediate highs – the neckline.\n\nThe pattern is completed only when the right shoulder rises above the neckline, suggesting that further rallying will be akin to the height of the head.\n\nIn the case of ETH, the height of the head marks a $218 growth, placing the target at $218 above $2,334. This brings the expected rise to $2,551, marking a 9.3% growth. Since, on the 8-hour chart, Ethereum price has already satisfied the pattern with the breach of the neckline, there is room for further growth.\n\nETH/USD 8-hour chart\n\nTrading at $2,433, ETH could still rise by another 5% before reaching the target price, breaching which would set the altcoin up for an increase to $3,000.\n\nPrice indicators, Relative Strength Index (RSI) and Moving Average Convergence Divergence (MACD), are both exhibiting room for bullishness.\n\nEthereum RSI and MACD\n\nHowever, a failed breach of the target price could bring ETH back down to $2,400, which could happen if short-term traders look for profit-taking as well, invalidating the bullish thesis."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQUmIteGlBTXhscXg0NFdJSmFENFJacVYxYnFUMnVZX1k5ckh2SWdrOWp6XzdlZFY4d2wxaUplNGhZaURDMjcxWElGWWN4WENLRTdUTkdPekl6cE5STnVKaE1EU1N3MkFTeG5IYnUzWHR5d2l4TEpXQWlIVjc1Zm9ZZlplRWFuZ9IBiwFBVV95cUxQS2RjX0Jnajk1US1CcGk0V3ZCdGMtUTlFNFhkVzlkUU9nM1VOZWxWcS1CVU5HaC1CazdSY25iaXdLT3BxaUtLYkctRjFzMnpPZWtHR1BTeVNMYkw2blNJVFBONG8zd053QmNqUUtwVEZHMFQxU0p4c0NMRnFDOFpRTzdzUkljSnI1VDc4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "New Ethereum (ETH), XRP and Solana (SOL) Pairs to Go Live on Binance - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a bid to enhance the user trading experience and provide a wider array of choices, Binance has announced the launch of USDC-margined perpetual contracts for popular cryptocurrencies such as Ethereum (ETH), Solana (SOL) and XRP.\n\nAdvertisement\n\nThe introduction of these new trading pairs with up to 125 times leverage is set to go live on Jan. 3, 2024, at 12:30 p.m. (UTC). This move follows closely on the heels of Binance's recent addition of XRP and ADA trading pairs against USDC, showcasing the platform's strategic maneuvers and a notable return of the stablecoin to its ecosystem.\n\nTo celebrate the launch of USDC-margined futures contracts, Binance Futures is offering a 10% promotional trading fee discount on all trades within the specified period. The promotion period is from Jan. 3, 2024, at 12:30 p.m. (UTC) to April 3, 2024, at 12:30 p.m. (UTC).\n\nAdvertisement\n\nFor users opting to pay their trading fees with BNB on the Binance Futures platform, the 10% promotional trading fee discount for USDC-margined futures contracts will be an additional benefit on top of the existing 10% BNB fee discount. This double discount provides added value for BNB users, encouraging further engagement with the new trading pairs.\n\nBinance’s regulatory landscape and delisting decisions\n\nThe expansion of trading pairs and the reintroduction of USDC come at a time when Binance is navigating increased regulatory scrutiny.\n\nRecent delisting decisions, including spot trading pairs linked to the British Pound (GBP), such as ADA, BTC, DOGE and XRP, reflect Binance's efforts to streamline operations and comply with regulatory requirements.\n\nThe ongoing investigations by the U.S. Department of Justice (DOJ) and the SEC have created an atmosphere of uncertainty, prompting the exchange to make strategic decisions to ensure regulatory compliance. Traders and enthusiasts alike will be closely watching how these developments unfold in the coming months."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1rSUFYY1VXX1dfQVM0ZWNuT3JiRTFfOUFFTGFfdXE1X29teGR1aGI1MjdHeThIWXAybXdhQjdycldoLXR2XzVxTWdhamo1akdIU1NNaXpFd3VPRS1xMk51d3BDQXE1dUdEeF9Nc1haU2p2RzJjblHSAXtBVV95cUxPdzBUVFZLaVV1ZnpObl82TVU5cG1udTFrTG9tMnZEejhWSFN2SlFzTGF5ZG5kUVdBMW9tMGllYXpOeHFDRzJYcG9BeV94U3Y5ZkZoNTRzOFJta0ROV3NkU2xGbjJuSVY5QmRhcklJUDlUell5MEVhNWRGR0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price to Hit $10,000, Lark Davis Believes - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nCrypto YouTuber Lark Davis has taken to the Twitter/X social media network to share his view on the enormous all-time high he expects the second largest cryptocurrency, Ethereum, to reach. He has not named any definitive time frames for this surge, though, and just stated that this is a questions of “when, not if”.\n\nDavis bets on Ethereum ultimately reaching a mind-blowing $10,000 price tag. To achieve that price milestone, Ethereum would have to showcase a whopping 321.52% from its current price level - $2,370.\n\nEthereum reaches new milestones\n\nAs reported by the popular on-chain data aggregator Santiment, Ethereum has been moving towards a new record recently, along with the flagship digital currency Bitcoin. Per recent tweet, Ethereum is now within 1.6% of the highest value since May 11 last year. As for Bitcoin, BTC is within 2.9% of the highest value since April 6 last year. Both highs were reached by these two largest cryptocurrencies at the start of December.\n\nAdvertisement\n\nBesides, top 10 exchange wallets continue to move Ethereum, according to an earlier tweet published by Santiment as they are withdrawing their ETH into smaller blockchain addresses from centralized crypto exchanges or are moving Ethereum away from CEXs entirely. About two weeks ago, a massive 240,000 ETH was transferred from exchanges. This massive amount of ETH is evaluated at an impressive $569,347,200 at the time of this writing.\n\nGalaxy Digital dumps tonnes of Ethereum\n\nAs reported by U.Today, approximately a week ago, a major cryptocurrency market player, Galaxy Digital investment fund created and spearheaded by former Goldman Sachs partner Mike Novogratz transferred 11,200 Ethereum to the Binance exchange with an apparent goal to sell it. At that time, this ETH lump was worth roughly $24.3 million.\n\nHowever, it was not the only Ethereum transfer made by Novogratz’s company recently. Blockchain sleuth @OnchainDataNerd stated that until that day, Galaxy Digital had deposited 31,437 ETH in total to various cryptocurrency exchanges.\n\nMike Novogratz himself is an early Ethereum investor. In one of his interviews, Novogratz stated that he had bought 500,000 ETH from Vitalik Buterin right after the ICO, before Ether began trading on exchanges and was worth less than $1. He was the first even Wall Street buyer of Ethereum back then."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxONXItbU9zZGRUMjg5WkpTS3U2a201R085S0pCZEVVcnFMSG9GNkRhWXR4a3BuM1hLLXRBaUd0VWE4SVhLajhYVWRmeG1vSDRMLVk2QWR6UnNRM2pJa19FdXJmU3l4TG8xOUIyUFJ0dEY1aDQ3UlluS1Y2YnoxamhnbUk1OVZDTm1FSXlYNGc5djlnSXBiNERJbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "ZkSync beats Ethereum in monthly transaction count despite Christmas outage - DLNews",
        "content": "Ethereum has been upstaged by one of its layer 2s in 30-day transaction count.\n\nZkSync’s transaction spike has resulted in lower fees.\n\nDevelopment is positive step for Ethereum's scalability.\n\nEthereum has been knocked off its perch, at least when it comes to the monthly number of transactions.\n\nZkSync, an Ethereum layer 2 blockchain, has managed to process more transactions than Ethereum in the last 30 days, according to data from L2Beat, a portal that tracks data for such buzzy blockchains.\n\nIt’s quite a feat because it is the first time Ethereum has been surpassed by any of its layer 2s in 30-day transaction numbers.\n\nEthereum layer 2 blockchains like zkSync help scale the blockchain with increased speed while relying on the mainnet’s security.\n\n30-day transaction count for Ethereum and its layer-2s. Source: L2Beat\n\nIt’s also significant that the transaction spike has not resulted in higher fees on zkSync. Instead, fees have dipped 44% within the same period, data from blockchain analytics portal growthepie shows.\n\nIt currently costs about $0.13 to use the network to send tokens while it is $2 on the Ethereum mainnet. More complicated transactions like token swaps cost even higher, as much as $35 as of the time of reporting.\n\nThis fee decline supports the expectation that zkSync should become cheaper to use as it scales.\n\nZkSync’s run to the top of the ladder has come amid a boom in inscriptions on Ethereum-based blockchains.\n\nJoin the community to get our latest stories and updates\n\nInscriptions are data files for applications like NFTs and meme coins embedded on blockchains in a way that is supposed to be cheaper than using smart contracts.\n\nThey first emerged on Bitcoin but have now become a trend on Ethereum-based blockchains.\n\nTotal investor deposits in zkSync, as measured by \"total value locked\"\n\nTransaction-spamming associated with the inscriptions trend has become a stress test for blockchains like zkSync and Arbitrum with the latter going offline on December 15.\n\nThe milestone also comes after zkSync had a minor hiccup on Christmas. Block production was paused amid a temporary network outage for the blockchain.\n\nThe developers behind zkSync said the problem was due to a bug in the chain’s server and promised a full post-mortem of the incident. Some security researchers say the issue may have involved the blockchain’s Sequencer.\n\nZkSync uses a Sequencer to verify, organise, and bundle transactions to Ethereum for finality. Layer 2 Sequencers have been prone to faults in the past with Arbitrum, a zkSync suffering a similar fate in June.\n\nApart from Inscriptions, zkSync’s transaction count also has a prominent airdrop footprint. Matter Labs has been mum about the possibility of an airdrop, but that has not stopped DeFi users from piling into the chain in hopes of a potential airdrop win.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    }
]