[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPQTFDV0k0U1VJVlV1V3ZwY0RLYy1iN0x6NUE5UFZpYlczWDhSNVE5SUJOaGdHTVYtYUVDR0R5Y0FwVzRGaW93UDY5SnIwMldhblAzS0xMVDNaMmZyc3VUMXFoQ0xyQUIzUnFENEpTVHhxemZDOE01R0VJMF83WG1Bd05DQWdDQ0hIOWNKdWxB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 May 2024 07:00:00 GMT",
        "title": "Bitcoin, ethereum rally: Why legislators 'can't ignore crypto' - Yahoo Finance",
        "content": "The cryptocurrency market is rallying, with the prices of bitcoin (BTC-USD) and ethereum (ETH-USD) soaring amid the potential introduction of new crypto legislation. Anticipation is also building around the approval of spot ether ETFs, fueling investor optimism for the digital assets.\n\nYahoo Finance's Jared Blikre breaks down the details.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime.\n\nThis post was written by Angel Smith"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPQTFDV0k0U1VJVlV1V3ZwY0RLYy1iN0x6NUE5UFZpYlczWDhSNVE5SUJOaGdHTVYtYUVDR0R5Y0FwVzRGaW93UDY5SnIwMldhblAzS0xMVDNaMmZyc3VUMXFoQ0xyQUIzUnFENEpTVHhxemZDOE01R0VJMF83WG1Bd05DQWdDQ0hIOWNKdWxB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 May 2024 07:00:00 GMT",
        "title": "Bitcoin, ethereum rally: Why legislators 'can't ignore crypto' - Yahoo Finance",
        "content": "The cryptocurrency market is rallying, with the prices of bitcoin (BTC-USD) and ethereum (ETH-USD) soaring amid the potential introduction of new crypto legislation. Anticipation is also building around the approval of spot ether ETFs, fueling investor optimism for the digital assets.\n\nYahoo Finance's Jared Blikre breaks down the details.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime.\n\nThis post was written by Angel Smith"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNOV9pcDM0bkZPdUVRR05OSDhZMGh0SGk4V2VyZk9ZUWxfWk1EMzA5WHVZR2JkQmoteU5WeDJHRy1qM0VvaVZQVU1hYmRXQU9RYVRXTC0xZkRPb2VwLXJaRWNkbkNmdktPNUFRc3BBbFAtSDN1NENzeVdqV1NMb3ZicjlBb01NQ1ozRFhv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 May 2024 07:00:00 GMT",
        "title": "WisdomTree Bitcoin, Ethereum ETPs To List in U.K. - Yahoo Finance",
        "content": "WisdomTree\n\nWisdomTree has received approval from the Financial Conduct Authority (FCA) to list its bitcoin and Ethereum exchange-traded products on the London Stock Exchange (LSE).\n\nThe WisdomTree Physical Bitcoin ETP (WBTC) and the WisdomTree Physical Ethereum ETP (WETH) will be among the first set of crypto ETPs to be listed in the U.K., with the unveiling expected to be on May 28.\n\nIt comes after the FCA gave the green light for crypto listings on U.K. exchanges in March, giving professional investors access to the products for the first time.\n\nHowever, crypto ETNs in the U.K. will only be available to professional investors, with the ban on retail access still in place.\n\nTo list on the LSE, crypto ETNs must be physically backed, non-leveraged and offer exposure to bitcoin or Ethereum only.\n\nMore Institutional Interest?\n\nAlexis Marinof, head of Europe at WisdomTree, said: “The FCA approval of our crypto ETPs’ prospectus is a significant step forward for the industry and U.K.-based professional investors seeking exposure to the asset class.\n\n“While U.K.-based professional investors have been able to allocate to crypto ETPs via overseas exchanges, they will soon have a more convenient access point.”\n\nHe added he expects the approval to generate greater institutional adoption of the asset class with barriers to entry removed.\n\nThis story initially appeared in etf.com's sister publication, ETFStream.com.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOOWdrSExhX0p2N3pZdW8zZUozdkZaUWdUcUdZc2hmX0tQeXVob2txQmc5TjJDN05NVXp1WEhWaDdsRFAwTUlJZmlRSnI4NFVKU2R5RWE5SnNuRzJkeGJib01XeVItX2w0WWxLNlVIcm9zT2pCUVJLemRPMlNSTEdiY2lZV0M5bGZ2NnlXZGZNai1DRG9TNWNuVGRDaXFzcFM1UzlaWFUwQ2R4alJzdERUcnZvd3pjUTdGSmZCZ3FEOVNaVWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 May 2024 07:00:00 GMT",
        "title": "VanEck's Spot Ethereum ETF Listed On DTCC As SEC Decision Looms - Benzinga",
        "content": "Amid growing anticipation about the potential approval of a spot Ether exchange-traded fund (ETF) in the United States, global investment manager VanEck's ETF has been listed by the Depository Trust and Clearing Corporation (DTCC) under the ticker symbol \"ETHV.\"\n\nWhat Happened: This development is seen as a critical step before receiving final approval from the U.S. Securities and Exchange Commission (SEC).\n\nThe DTCC, a key American financial market infrastructure provider, offers clearing, settlement, and transaction reporting services.\n\nA listing on DTCC is a necessary precursor to SEC approval. Currently, VanEck's ETF is designated as inactive on the DTCC website, indicating it cannot be processed until it secures the required regulatory approvals.\n\nNotably, VanEck is not the first Ether ETF listed by the DTCC; Franklin Templeton's spot Ethereum ETH/USD ETF was listed on the platform a month ago.\n\nThe DTCC's list includes both active ETFs that can be processed and those that are not yet active.\n\nThe final SEC decision on the VanEck spot Ether ETF application is expected by May 23.\n\nAfter months of speculation about a likely denial of spot ETH ETFs, the SEC took significant action earlier this week by asking financial managers to amend and refile their 19b-4 filings on their proposed spot Ether ETFs.\n\nThis move has been interpreted by some analysts as a positive indication, raising the potential approval chance to 75% from 25%.\n\nIn a parallel development, Nasdaq Stock Market LLC has filed an updated 19b-4 form for BlackRock‘s BLK spot Ethereum ETF, with other amended filings also coming in.\n\nNasdaq submitted the amended form for the world's largest asset manager on Wednesday, while Exchange CboeBZX filed revamped 19b-4 forms late Tuesday for five spot ETF proposals.\n\nThese amended filings followed the SEC's request for exchanges to revise their 19b-4s earlier this week.\n\nAlso Read: White House Won’t Veto Crypto Bill, But Seeks Stronger Consumer Protections\n\nForm 19b-4s notify the SEC about a proposed rule change and need the agency's approval before spot ether ETFs can become effective.\n\nAdditionally, S-1 registration statements would need to be approved before the funds can start trading.\n\nNasdaq's latest filing includes language similar to other amended 19b-4s regarding staking, indicating that the Fund’s ETH cannot be staked.\n\n“Neither the Trust, nor the Sponsor, nor the Ether Custodian (as defined below), nor any other person associated with the Trust will, directly or indirectly, engage in action where any portion of the Trust's ETH becomes subject to the Ethereum proof-of-stake validation or is used to earn additional ETH or generate income or other earnings,” according to BlackRock’s filing.\n\nAdding to the flurry of activity, Bloomberg analyst James Seyffart revealed on platform X that Grayscale GBTC has submitted a revised 19b-4 file for its Ethereum Mini Trust.\n\nWhat’s Next: The implications of these developments and other regulatory trends in the digital asset space will be further explored at Benzinga’s Future of Digital Assets event on Nov. 19.\n\nThis event will bring together industry leaders, investors, and policymakers to discuss the evolving role of digital assets in the global financial landscape.\n\nRead Next: Is Donald Trump Accepting Crypto Donations ‘Just Another Cow For Him To Milk?’\n\nImage: Shutterstock"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFAxUXBNM19jVmZSeUdHdll2SVdFcVJJUk5sRlRYclpnVGtRMWVVVGViY0IxUnk3MHlUeVZFQ1h6a0hxWlVSNjNJcWllTTNVT0JXUXE3bEsxUVBYVThtSnIzdTA2ZHduV3MzU01QdHhZVXk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 May 2024 07:00:00 GMT",
        "title": "First UK crypto ETPs to launch on May 28 - Financial Times",
        "content": "Print this page\n\nLatest news on ETFs Visit our ETF Hub to find out more and to explore our in-depth data and comparison tools\n\nThe UK’s first cryptocurrency exchange traded products are finally set to begin trading next week, almost a decade after the first such vehicles appeared in Sweden.\n\nWisdomTree, 21Shares and Invesco have been given the green light by the Financial Conduct Authority, the City regulator, to list ETPs investing in “physical” spot bitcoin and ether, the two most popular digital tokens, on the London Stock Exchange on May 28.\n\nHowever, the ETPs — which form part of a barrage of similar vehicles expected to list on the LSE — will only be available to professional investors because the FCA has ruled that “crypto derivatives are ill-suited for retail consumers due to the harm they pose”.\n\nThe stance is in sharp contrast to stock exchanges across much of continental Europe, as well as Australia, Brazil, Canada, Hong Kong and the US, which offer crypto ETPs to both retail and institutional investors.\n\nUS-listed spot bitcoin ETFs already boast combined assets of $50bn, despite only launching in January, with about 80 per cent of this held by retail investors, according to regulatory filings.\n\nA series of other crypto ETP managers, including ETC Group and CoinShares, are known to have filed to list vehicles on the LSE, ideally also on May 28 if they receive regulatory sign-off from the FCA in time.\n\n“The FCA approval of our crypto ETPs’ prospectus is a significant step forward for the industry and UK-based professional investors seeking exposure to the asset class,” said Alexis Marinof, head of Europe at WisdomTree, which has $111bn under management globally.\n\n“While UK-based professional investors have been able to allocate to crypto ETPs via overseas exchanges, they will soon have a more convenient access point. FCA approval in this respect could result in greater institutional adoption of the asset class, as many professional investors have been unable to gain exposure to bitcoin and other cryptocurrencies due to regulatory limitations and uncertainty,” he added.\n\nWisdomTree’s Physical Bitcoin (BTCW) and Physical Ethereum (ETHW) ETPs will have fees of 0.35 per cent, the same as equivalent vehicles listed in a number of continental European exchanges.\n\nOphelia Snyder, co-founder of 21 Shares, which will cross-list its existing Bitcoin and Ethereum Staking ETPs in the UK, with fees of 1.49 per cent, said: “London hosts one of the deepest, most liquid capital markets in the world — where there is proven institutional interest in cryptocurrencies.”\n\nInvesco will bring its $240mn Physical Bitcoin ETP, already listed in Germany and Switzerland, to London with a 0.39 per cent fee.\n\nAll the UK-listed crypto funds will be constructed as exchange traded notes, a structure common across the European cryptocurrency market. The FCA has only approved vehicles that invest in bitcoin and ether and which are unleveraged and physically backed.\n\nDespite the retail investor ban, issuers remain hopeful that there will be sufficient interest among UK-based professional investors to make cross-listing their ETPs in London worthwhile.\n\nMore than 900 institutional investors have built stakes in US-listed spot bitcoin ETFs, SEC filings show, suggesting there may be an audience even for ETNs that are off-limits to retail investors.\n\n“Hedge funds and small family offices have always had an appetite [for crypto ETFs]. Private banks and discretionary fund managers are a little bit more hesitant, but they want to look at this asset class. Multi-asset managers are also looking at it,” said Ravinder Azad, head of UK sales at WisdomTree. The company attracted 14 institutional investors to a UK crypto webinar earlier this year but already had more than 140 sign-ups for a follow-up event in June, according to Azad.\n\nBrown Brothers Harriman’s 2024 Global ETF Investor Survey, released this week, found that in each of the US, Europe and Greater China, more institutional investors said they were bullish about the prospects for digital assets than any other asset class over the next 12 months.\n\nHowever, one crypto ETF issuer that has no plans to list a product in the UK while retail investors remain off limits told the FT: “You are launching a product that is not universal. It needs to be universal. That is the principle that underlies ETFs everywhere.”"
    }
]