[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5DWFpLcmhIeEpGS0ZTLWVxODYwaFNMUnNEUGdYSlNYNmtyMU01SHNZY28xMVZBbXhmYThKZDdMcHJuUVhYb0VGUVhzYTE3UFZxcXdNYzJkamY2b2tISzBQZ3R2ZzVXRzJjUDJsUXlJNVo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "SEC paves way for ethereum ETFs in boost for crypto - Financial Times",
        "content": "Print this page\n\nThe US Securities and Exchange Commission has paved the way for the potential launch of eight exchange traded funds tied to the world’s second-largest digital coin, following the regulator’s approval of the first bitcoin ETFs earlier this year.\n\nThe regulator on Thursday approved rule changes in support of ETFs that invest in ether, the native cryptocurrency of the ethereum blockchain, for several groups including BlackRock, Fidelity, Invesco and Ark Invest. A second round of approvals will be needed before the products can launch.\n\nWidespread anticipation of the approvals has sent ether’s price soaring more than 20 per cent since Monday and more than 60 per cent year-to-date.\n\nIt is a significant regulatory shift for the SEC after months of silence on the issue. On Monday the SEC suddenly gave feedback to issuers and exchanges on the pending applications, sparking a flurry of paperwork and revisions. The SEC had faced deadlines of Thursday and Friday to respond to ether ETF applications from VanEck and Ark, respectively, according to data from Bloomberg Intelligence.\n\n“This is a key step to offering Ethereum access through the ETF structure, which will offer US investors easier access, higher protection and safeguards,” Invesco and Galaxy, a digital assets group, said in a statement on Thursday evening. “We hope this approval indicates a willingness by the SEC to approve the launch of these products.”\n\n“I think most of us were resigned to a disapproval order coming down the pike,” said Katherine Dowling, general counsel for Bitwise Asset Management, one of 11 US bitcoin ETF issuers and which has filed to launch an ether ETF.\n\nIt is unclear if and when the SEC will grant the second round of approvals needed before the products can launch.\n\nSEC chair Gary Gensler on Thursday morning explained his reticence to allowing crypto investment products to launch on the US market at an Investment Company Institute conference. He alluded to the myriad fraud cases that have affected the crypto industry, such as that of FTX founder Sam Bankman-Fried, who in March was sentenced to 25 years in prison in connection with the billions of dollars that went missing from his cryptocurrency exchange.\n\n“It comes down to the rampant non-compliance with US law,” Gensler told ICI chief executive Eric Pan. “It comes down to the frauds and scams. This is a field where some of the leading lights of the field are either now in jail, awaiting jail, awaiting extradition.”\n\nThe SEC last year lost a court battle with Grayscale Investments over the asset manager’s push to convert its flagship bitcoin trust into an ETF. After that decision, the regulator — with apparent reluctance — approved Grayscale’s bitcoin product and 10 other new ETF launches earlier this year."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxORE51WjA0R2wySzVaYkRwLWhPaTdZMlBHWGVkSVZ2azZ4Q2JsejdvZTNsX1V6NG0xMlltZmV6b2lBVUc4QWVRTUd4NTN0ekhNaGNDLVJwWmxSWGxuT2xENjZlSkxwUzlrV1ZyckE3OE43NDhxQjhHS25tZVJxaDkwV3pPOVFyZkdVdHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum Records Largest Daily Gains In 3 Years, Flips Mastercard And LVMH In Market Cap - Yahoo Finance",
        "content": "Ethereum Records Largest Daily Gains In 3 Years, Flips Mastercard And LVMH In Market Cap\n\nOn Monday afternoon, news broke that the probability of the SEC at least partially approving a spot ethereum ETF had vastly increased. This immediately led to massive buying activity for ETH, sending the price from less than $3,100 to over $3,800 in 24 hours. This marked the largest daily move for ETH since May 2021.\n\nDon't Miss:\n\nHolding 0.001 Bitcoin could make you a multimillionaire, according to Fidelity director — but for how long?\n\nBitcoin has jumped another 45% already this year – how much would you need to get started today?\n\nThe move followed a post on X from Eric Balchunas, a Bloomberg ETF analyst, who has been covering crypto ETFs for several months. The post detailed how he is raising the \"odds of spot Ether ETF approval to 75% (up from 25%), hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone scrambling (like us everyone else assumed they’d be denied).\"\n\nThe post has amassed nearly five million views at the time of writing and was one of the first to start the frenzy surrounding the spot ETH ETFs. The announcement was highly unforeseen, as many had written off the ETFs due to the SEC's lack of comment on the issue and final deadlines for a decision looming later this week.\n\nTrending: According to Cathie Wood, holding 6 Ethereum (ETH) could make you a millionaire, here’s why it can be true.\n\nThis news further enabled ethereum to reach a market cap of over $450 billion, making it larger than all but 20 companies worldwide. Here are some of the companies that ethereum surpassed after the news:\n\nMastercard (MA)\n\nLVMH (LVMUY)\n\nProcter & Gamble (PG)\n\nSamsung (KRW)\n\nBank of America (BOA)\n\nHowever, approval of ETFs is not as black and white as a simple \"yes\" or \"no\" from the SEC because two forms must be approved for the ETFs to go live. The 19b-4 form allows the funds to list the ETFs, while the S-1 form is a detailed account of how the ETFs would work. According to ETF analyst Nate Geraci, the SEC could greenlight the 19b-4 forms but delay a decision on the S-1s. This would give them time to take a closer look at the individual applications from different sponsors to understand what a launch would look like.\n\nIf this were to happen, it would be a positive for the spot ETFs and ethereum. It would allow the applications to move into the next stage of the process and one step closer to launch. Additionally, the possibility of full approval of the 19b-4s and S-1s is still on the table.\n\nMany crypto enthusiasts believe that a spot ETF approval would propel ETH to a price above $4,000, with some predicting that ETH could set new ATHs above $4,900. Given that Bitcoin hit new highs after the approval of its ETFs, a similar trend could occur for ethereum.\n\nStory continues\n\nRead Next:\n\ncrypto digital assets\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum Records Largest Daily Gains In 3 Years, Flips Mastercard And LVMH In Market Cap originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQV19Fek5TbDBsMmctTHNSWk5FSWhJVU5wQ2F6RFFYRHJ5V1p3T2NteXJTcXB6V0dCbkFiM1hTSGFBUGNMNzNlUXc2MjdkSzR2TVgtcHJmNjIxYVRTdjh2S1pYdGIxTThjNVBmeXJwTjNSR2JuZEpTeDVrZXFYQloxMjJ4Rm5CM0U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Decision Recalls Spot Bitcoin Launch - Yahoo Finance",
        "content": "Cryptocurrency\n\nRemember the spot bitcoin ETF launch?\n\nAs the spot Ethereum ETF approval drama unfolds, investors and exchange-traded fund industry observers can recall parallels between this case and events leading to the eventual approval and unveiling of spot bitcoin ETFs.\n\nIn both cases, the Securities and Exchange Commission (SEC) initially exhibited caution toward approving spot ETFs for these cryptocurrencies. However, pressure from various stakeholders, including issuers, investors and the maturing crypto market, spurred a potential shift toward approval.\n\nBoth decisions reflect growing recognition of the maturing cryptocurrency market and rapidly increasing institutional interest in these assets.\n\nThe presence of spot bitcoin ETFs and the potential approval of an ether-based ETF suggest the SEC is considering the growing demand from investors for regulated ways to gain exposure to these cryptocurrencies.\n\nA key difference between the two cases is that the Ethereum ETF approval process may be faster than bitcoin's due to the legal precedent set by the August 2023 Grayscale court case, which effectively reversed the SEC’s initial rejection of the asset manager's spot bitcoin ETF application.\n\nBoth cases highlight the complex path to approval and greater receptivity toward well-structured spot cryptocurrency ETFs.\n\nIs a Dogecoin ETF Next?\n\nIn the first two days of trading this week, the popular cryptocurrency Dogecoin (DOGE) jumped 9% as investors began to speculate that the largest meme coin by market cap could be the next for a spot ETF approval.\n\nCrypto trader Andrew Kang tweeted to his 244,000 followers on X Tuesday, “the odds for a DOGE ETF look brighter than ever.”\n\nWhile speculation over more spot ETFs is not surprising, it would be surprising if a spot DOGE ETF was next in line.\n\nCryptocurrencies with clear and demonstrably valuable use cases beyond speculation might be viewed more favorably. Additionally, a well-developed ecosystem with robust infrastructure for secure storage and transactions could be a plus. Widespread acceptance, measured by larger market capitalization (total value of all outstanding coins) and higher trading volume (liquidity) may also be considerations.\n\nFor example, there are five cryptocurrencies other than Bitcoin and ether that have larger market caps than Dogecoin, according to data from CoiMnarketCap.com.\n\nBehind Bitcoin and Ethereum, these are the largest cryptocurrencies on the market:\n\nTether USDt (USDT): This stablecoin, with a market cap of roughly $111 billion, is pegged to the U.S. dollar and is a popular choice for investors seeking stability within the crypto market.\n\nBNB (BNB): The native coin of the Binance ecosystem, BNB, has a market cap of around $91 billion and is used for various purposes within the Binance exchange and its blockchain applications.\n\nSolana (SOL): Solana, known for its fast transaction processing speeds, currently has a market cap of approximately $80 billion.\n\nStory continues\n\nOverall, the spot Bitcoin ETF launches and increasingly likely spot Ethereum approvals are positive developments, but they don't guarantee a flood of spot ETFs for more cryptocurrencies. The SEC will likely continue cautiously, prioritizing established cryptocurrencies with well-structured ETF proposals.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNTDliYkhySmlnWWwtVzY2bkVQZVFmVHBOdzJfYVppb3VQX29qVXBXOFNXTjQ2NktwNTBFYzYxRFRnYktGZ2hjaUxVSUFLeTloNjJmYmJuLTl1MUtJSWVEWjgwYUZ5YjEwRFVxRU5aUVlZRGROV2hpUlQyRFU1RXVqNHZYQnhnTlBYalNVUzZFRTAyOXFLbXZBVtIBngFBVV95cUxQbDlHdG5HdXUtZUtvbVJUWFI2R0Q0MW5oX3BSMzdMaFRPNFVMUWpVWVQ4b0N5d0FORGpoWDhqcktKODZEdGRydnZWcWExYUQ3MFNOSXhwb0lETm1lUVpiM000RlJQVWJ2LW1HWXdFS0ZFMF9qd0tFcW55N0FRaVVyLUhIYmxjOHFZM3ZkazlDM0xTOFk0Vy1NN2F3YlhCdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "SEC approves rule change to allow creation of ether ETFs - CNBC",
        "content": "A representation of cryptocurrency Ethereum is placed on a PC motherboard in this illustration taken on June 16, 2023.\n\nThe SEC has approved a rule change Thursday that would pave the way for ETFs that buy and hold ether , one of the world's largest cryptocurrencies.\n\nThe decision comes less than six months after the Securities and Exchange Commission approved bitcoin ETFs. Those funds have proven to be a big success for the industry, with net inflows already surpassing $12 billion, according to FactSet.\n\nLate May had long been pegged as a potential decision date for the ether funds since it coincided with a deadline for the SEC to decide whether the VanEck Ethereum ETF could proceed.\n\nMany of the companies that sponsor bitcoin ETFs — including BlackRock, Bitwise and Galaxy Digital — have also started the process of the launching an ether fund.\n\nThe price of ether rose just 2%, although it follows a 20% surge from earlier in the week in anticipation of Thursday's decision. Some investors may also be on pause, as the SEC's rule change approval does not guarantee that all the funds will launch.\n\nSpecifically, the SEC's order approves applications from various exchanges to list eight different ether funds. The order technically does not approve the funds themselves or set a date for the ETFs to begin trading.\n\nEther ETFs are expected to be smaller, at least initially, than their bitcoin counterparts. The Grayscale Ethereum Trust currently has about $11 billion in assets, much smaller than what the firm's bitcoin fund was before its conversion.\n\nThe approval of the ether ETFs is a sign that the SEC's stance toward crypto may be softening after a series of legal fights. The agency lost a lawsuit against Grayscale in 2023 that spurred the approval for the bitcoin products.\n\nThe SEC's push to regulate crypto has also come under scrutiny by politicians. The Senate last week passed a resolution to withdraw an SEC staff bulletin about accounting rules for digital assets.\n\nEther is the second largest crypto asset and has become something of a blue chip coin along with bitcoin, although its value proposition is distinctly different. While bitcoin is seen primarily as a long-term store of value, an investment in ether is considered more akin to an investment in early stage technology. The ether token fuels the Ethereum network, which powers different applications, like decentralized finance (DeFi) projects, nonfungible tokens (NFTs) or the tokenization of real world assets like commodities, securities, art, real estate and more.\n\nThe applications approved Thursday do not apply to other crypto projects on the Ethereum network, said Richard Kerr, a partner in the law firm K&L Gates.\n\n\"If and when an ether product is approved, it won't mean that a similar product for other digital assets on the Ethereum platform would be approved,\" Kerr said.\n\nEthereum also provides opportunities for staking, which is a way for investors to earn interest on their ether holdings by locking up tokens on the network for a period of time — although ether ETFs in the U.S. may not participate. The SEC has alleged in lawsuits against Coinbase and Kraken that staking-as-a-service offerings are unregistered securities. Ark, Fidelity and Grayscale updated their filings this month to remove staking from their proposals.\n\nThe lack of staking in the ETF products is another reason why ether ETFs may see less demand than their bitcoin counterparts, said Steven Lubka, managing director at Swan Bitcoin and head of Swan Private.\n\n\"These numbers are not going to match the bitcoin ETF inflows, and there are some structural differences in the product that just make it less attractive overall,\" Lubka said."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQUVFraXVNUWdzek41UHdqUkk3VGwzbmwySnJlc212V0pJcWFFcGMxcDY0V0FSX0pyckdRSklmSFpDOGxQblhYX2Q0TVBJR0JvZ3dNVUhtY21uNmZnaUVvUGxJaWxmYVdFY3VJeWppZk8yTm1hWFA1Q3hBdFhaN3Q0X0lwV1JVcWw2OU5PWm5zaUg3bHNtM0d0Z3J0ZDBkQTBQT0dxSFRiOUVnQTdkUnR4bm9sdWlZc1I3eUI4QzUyZzZZQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "What Would Ethereum ETF Approval Mean For The Price Of ETH? - Benzinga",
        "content": "As the financial world closely watches the developments around the Ethereum ETH/USD Exchange-Traded Fund (ETF), market participants are gearing up for significant price movements.\n\nWhat Happened: According to QCP Asia’s report on May 23, the impending ETH ETF decision has created a buzz, with implied volatility for Friday exceeding 100%, indicating that the market is bracing for substantial fluctuations.\n\nKey players such as BlackRock Inc. BLK and five other issuers have recently amended their ETF filings with the Securities and Exchange Commission (SEC), and VanEck's ETF has already been listed by the Depository Trust & Clearing Corporation (DTCC).\n\nThis has led analysts to believe that an approval is highly likely, with trading expected to commence as early as next week.\n\nMarko Jurina, CEO of Jumper.Exchange, said, \"If the BTC ETF approval was any indication, we could see a similar 60% rally from here.\"\n\nQCP Asia’s trade idea further supports this optimistic outlook.\n\nThe likelihood of ETH ETF approval under SEC Chair Gary Gensler‘s tenure appears strong.\n\nBoth Jurina and James Davies, co-founder and CPO at Crypto Valley Exchange, note that recent regulatory developments, such as minor requested changes to 19b-4 forms, suggest that approval is imminent.\n\n\"Everyone sees that ETH ETFs will pass very soon,\" said Davies. \"The SEC is following its pre-approval process, asking submitters to make minor changes to their applications, which they would not do if this was clearly not passing.\"\n\nIn the event of a denial, the most probable outcome would be a series of lawsuits, similar to the reaction following the initial rejections of spot Bitcoin ETFs.\n\nApplicants would likely challenge the SEC’s decision in court.\n\nDavies explained, \"If BTC ETF approval story is informative, we will likely get ETH ETF approval as a result of legal challenges.\"\n\nAlso Read: Bitcoin Spot ETFs Notch $154M Inflows As Popular Bitcoiner Slams Ethereum: ‘A Speculative Platform For Gambling’\n\nWhy It Matters: The approval of ETH ETFs holds significant relevance as it would enhance the credibility of the cryptocurrency industry.\n\n\"ETFs increase the level of credibility of the industry, given that the SEC is giving a stamp of approval,\" noted Jurina.\n\nThis would attract larger funds and institutional investors who have been hesitant due to regulatory uncertainties, potentially leading to substantial capital inflows and bolstering Ethereum's market position.\n\nWhile the approval of ETH ETFs could pave the way for other crypto asset ETFs, analysts like Davies believe that Ethereum’s unique status in the industry makes it an outlier.\n\n\"The broader adoption of ETFs for other digital assets would require significant market infrastructure development,\" said Davies.\n\n\"We need to see places to instantly hedge other tokens in a cost-effective manner, with depth, to enable ETF providers to manage risks.\"\n\nIf ETH ETFs are approved, the repercussions for the ETH token price could be substantial.\n\n\"The market is not anticipating a rejection,\" Jurina commented, indicating that political ramifications could also arise if the SEC were to deny the applications at this stage.\n\n\"Household names have filed for ETFs and committed significant capital to their building. If the SEC were to reject at this late stage, it would be a shock and create political repercussions, which it is apparent Biden would not want to see at the present moment.\"\n\nWhat’s Next: For those looking to stay ahead of these developments and gain deeper insights into the future of digital assets, Benzinga’s Future of Digital Assets event on Nov. 19 will be a crucial gathering.\n\nIndustry leaders and investors will converge to discuss the regulatory landscape, investment strategies, and the evolving digital asset market, providing a comprehensive overview of what lies ahead in this dynamic field.\n\nRead Next: VanEck’s Spot Ethereum ETF Listed On DTCC As SEC Decision Looms\n\nImage: Shutterstock"
    }
]