[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNMWE4OTdzRVh6ZWhCem1NLVFmYkI5WmFVOVJEVGRLOFdiR0hGSm9WcEhXTUhKSDFyeGtNU3dGTUFtR1ZVMU53eU1DMjA1Zy1hRzVGTWZwbTQ3U0p1STc3QVA1dGw5OTY3eU5fa0dzSmJxdmZiMkg4ZlJpeVdUT1VwcEpsckV1dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "SEC has considered Ethereum a security for extended period - crypto.news",
        "content": "The U.S. SEC and its Chairman, Gary Gensler, have considered Ethereum a security for at least a year.\n\nAccording to FOX Business, Consensys, which develops Ethereum software, filed an unredacted complaint against the agency after this was revealed.\n\nThe document states that the Ethereum 2.0 investigation was based on the SEC’s belief that possible offers and sales of certain securities, including but not limited to ETH, had occurred since at least 2018.\n\nThe Consensys lawsuit shows that the SEC has made multiple document requests over the past year asking for more details about the company’s role in the proof-of-stake (PoS) update and its acquisitions, holdings, and sales of Ethereum. Documents also show that the SEC may believe that sales of Ethereum even before the 2018 merger were securities.\n\nYou might also like: Spot Ethereum ETFs reportedly facing potential SEC denial\n\nThe SEC’s belief that Ethereum is a security contradicts the previous guidance under the chairmanship of Jay Clayton. Additionally, in June of 2018, then-CFO Bill Hinman stated in a speech the SEC’s position that Ethereum, along with Bitcoin, is not a security.\n\nEven before Gensler’s testimony, the chairman’s reluctance to give a definitive answer on Ethereum’s regulatory status raised alarm bells for the crypto industry. Many speculate that Ethereum’s Merge has made the cryptocurrency more security-like than the original consensus mechanism.\n\nConsensys initiated legal action against the SEC to keep the regulator from overseeing the Ethereum blockchain.\n\nConsensys said its action against the SEC followed the April 10 Wells notice indicating the regulator was preparing to take enforcement action against the company regarding its MetaMask wallet services. The company emphasized that MetaMask is not a broker and “does not store clients’ digital assets or perform any transactional functions.”"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMinANBVV95cUxOcWVnemRNenRqSUU2TU5kSmI5RFAtZmN5b0d0Y2cxcjBKT0hoOUJtQmtNckZId1B3d1V3dXRsbi10dUZaNmxzemJNRThmR19vb3NHVy1yQ0toMVN3ZnRySThjdWJ3Y1dJVnNfSjNPbks5WWgzUy1wdGFZM1RmRFBEOVR4SHl4MDZTd005Q1lpREtKVzdUQmNueWM4LVY0Ykt3Zl9HZjVwRV95ekhzNzllME55X29xdzMzYXhWcXBOU3I2VV9XenBBZXdQdkdSeGViZjhEN3YzWDFkQkxsbUpaS3Fld25HaG8td2NuWjF2amxEbGtHMC12aTNuS0o2TGIxMm5kdnk4WHZlNXNickQtVFhOMTV5S1U1c2szN3JNRmd3Y3RVYVZXNE9BMVZnV2hUb2YycWo2cEt0cFE4VFo4OFI2eTQ2TVZEdWZVa3JZVU82ZWxHTm9ZNm1vcXBMZmtBLXgtT21IN1ozaWh4dHlCNWVSdm5wY3U1M2Y2YnZlZ1o0MVc3LUtLZVFQUThNSzhqT2diQkpoM0FkbXlV0gGiA0FVX3lxTE1FM1dtWHNmaFBoRmYtdmdMVlI4RGNhbTZGSEFBUUpSbldQclhIVVJpTkRmV3BnMWFqVnE1c3pJLWZuWmJxR0VHSUhPOFJvcUNTSFJNdUNSY2dVUURsdXlVWE95Q0NpM3lEV2ktbzk3b2lFZ3hLMXhSYk9BYVgzcXpkYXh0dThSbmxtM2xfVXhMNzRTZjBucWpqYUtOQ2I0VzgwVm9oTWVhbjFjTUk5bHdKODBBNUlIOTQxV3doNGptanR6LTRBakRERHNaMFZadnVuMm0tS0dUTklNSnI1dkQ1cldKdWxaMXZOeXBPMWQxVWxuUktrekZpeHJXdlVOVFQwZHdaODdCTFJPaTZKclRYSDdnQjZfaXFxUGd6N2EzWHBYVy1SdTliaVpNNEZFODFnYldTVFc4bjBPcnpidVJTMnVleU9md0p6RmxhSFRLaVZxY2gxQ1NjakNEd2FPRlJtc3M5QjJjOUhpQlJsTzR1YU9KdE1ESU5WY0JEZG5pMGI2THhyTG56SDhfVEtFOWxpWXNyUzdYMnE2eVVJMno3RkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Cryptocurrency market sees decline as Bitcoin and Ethereum slip - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe cryptocurrency market experienced a decline in Monday's trading session, with Bitcoin slipping 2.3% to $62,300, while Ethereum fell 4.3% to $3,170.In addition, the global cryptocurrency market cap decreased by 2.94% to approximately $2.31 trillion over the last 24 hours.\"Bitcoin failed to continue the relief rally after it crossed $67,000 briefly last week. Bitcoin’s current price momentum could be linked to low demand from Spot ETFs and negative sentiment among investors expecting a potential post-halving crash,\" said Shivam Thakral, CEO of BuyUcoin.\"$59,600 is an important level bulls need to defend to prevent further downsides. A strong break and close above $65,000 could clear the path for a rise to $68,000 and then to $71,000,\" said Thakral.Meanwhile, Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said, \"There seems to be a bearish trend forming for BTC, and we can expect some slow-moving days ahead. Immediate resistance is around $63.4k.\"Other major crypto tokens such as BNB (-2.2%), Solana (-5.2%), XRP (-3.4%), Dogecoin (-5%), Toncoin (-4.7%), Polkadot (-5.2%), Shiba Inu (-5.3%), and Avalanche (-4.4%) also declined.The volume of all stablecoins is now $52.74 billion, which is 90.58% of the total crypto market 24-hour volume, as per data available on CoinMarketCap.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, declined to $1.227 trillion. Bitcoin's dominance is currently 53.15%, according to CoinMarketCap. BTC volume in the last 24 hours rose 19.3% to $21 billion.Regarding the future price movements of cryptocurrencies, the CoinDCX Research Team noted, \"This week's macroeconomic events, such as the Fed's fund rate and unemployment rate announcements, could potentially increase market volatility.\"On the technical front, Edul Patel, CEO of Mudrex, said, \"Bitcoin has been range-bound between $60,000 and $70,000 level since a while now. The support lies at the $62,500 level and the resistance is at the $64,200 level.\""
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMinANBVV95cUxOcWVnemRNenRqSUU2TU5kSmI5RFAtZmN5b0d0Y2cxcjBKT0hoOUJtQmtNckZId1B3d1V3dXRsbi10dUZaNmxzemJNRThmR19vb3NHVy1yQ0toMVN3ZnRySThjdWJ3Y1dJVnNfSjNPbks5WWgzUy1wdGFZM1RmRFBEOVR4SHl4MDZTd005Q1lpREtKVzdUQmNueWM4LVY0Ykt3Zl9HZjVwRV95ekhzNzllME55X29xdzMzYXhWcXBOU3I2VV9XenBBZXdQdkdSeGViZjhEN3YzWDFkQkxsbUpaS3Fld25HaG8td2NuWjF2amxEbGtHMC12aTNuS0o2TGIxMm5kdnk4WHZlNXNickQtVFhOMTV5S1U1c2szN3JNRmd3Y3RVYVZXNE9BMVZnV2hUb2YycWo2cEt0cFE4VFo4OFI2eTQ2TVZEdWZVa3JZVU82ZWxHTm9ZNm1vcXBMZmtBLXgtT21IN1ozaWh4dHlCNWVSdm5wY3U1M2Y2YnZlZ1o0MVc3LUtLZVFQUThNSzhqT2diQkpoM0FkbXlV0gGiA0FVX3lxTE1FM1dtWHNmaFBoRmYtdmdMVlI4RGNhbTZGSEFBUUpSbldQclhIVVJpTkRmV3BnMWFqVnE1c3pJLWZuWmJxR0VHSUhPOFJvcUNTSFJNdUNSY2dVUURsdXlVWE95Q0NpM3lEV2ktbzk3b2lFZ3hLMXhSYk9BYVgzcXpkYXh0dThSbmxtM2xfVXhMNzRTZjBucWpqYUtOQ2I0VzgwVm9oTWVhbjFjTUk5bHdKODBBNUlIOTQxV3doNGptanR6LTRBakRERHNaMFZadnVuMm0tS0dUTklNSnI1dkQ1cldKdWxaMXZOeXBPMWQxVWxuUktrekZpeHJXdlVOVFQwZHdaODdCTFJPaTZKclRYSDdnQjZfaXFxUGd6N2EzWHBYVy1SdTliaVpNNEZFODFnYldTVFc4bjBPcnpidVJTMnVleU9md0p6RmxhSFRLaVZxY2gxQ1NjakNEd2FPRlJtc3M5QjJjOUhpQlJsTzR1YU9KdE1ESU5WY0JEZG5pMGI2THhyTG56SDhfVEtFOWxpWXNyUzdYMnE2eVVJMno3RkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Cryptocurrency market sees decline as Bitcoin and Ethereum slip - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe cryptocurrency market experienced a decline in Monday's trading session, with Bitcoin slipping 2.3% to $62,300, while Ethereum fell 4.3% to $3,170.In addition, the global cryptocurrency market cap decreased by 2.94% to approximately $2.31 trillion over the last 24 hours.\"Bitcoin failed to continue the relief rally after it crossed $67,000 briefly last week. Bitcoin’s current price momentum could be linked to low demand from Spot ETFs and negative sentiment among investors expecting a potential post-halving crash,\" said Shivam Thakral, CEO of BuyUcoin.\"$59,600 is an important level bulls need to defend to prevent further downsides. A strong break and close above $65,000 could clear the path for a rise to $68,000 and then to $71,000,\" said Thakral.Meanwhile, Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said, \"There seems to be a bearish trend forming for BTC, and we can expect some slow-moving days ahead. Immediate resistance is around $63.4k.\"Other major crypto tokens such as BNB (-2.2%), Solana (-5.2%), XRP (-3.4%), Dogecoin (-5%), Toncoin (-4.7%), Polkadot (-5.2%), Shiba Inu (-5.3%), and Avalanche (-4.4%) also declined.The volume of all stablecoins is now $52.74 billion, which is 90.58% of the total crypto market 24-hour volume, as per data available on CoinMarketCap.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, declined to $1.227 trillion. Bitcoin's dominance is currently 53.15%, according to CoinMarketCap. BTC volume in the last 24 hours rose 19.3% to $21 billion.Regarding the future price movements of cryptocurrencies, the CoinDCX Research Team noted, \"This week's macroeconomic events, such as the Fed's fund rate and unemployment rate announcements, could potentially increase market volatility.\"On the technical front, Edul Patel, CEO of Mudrex, said, \"Bitcoin has been range-bound between $60,000 and $70,000 level since a while now. The support lies at the $62,500 level and the resistance is at the $64,200 level.\""
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOQk5rekwyYXhLeFVvSU56M21MRmVxS3dqVzVrdXZCelhVX1kteFpRSmJMTHpxRVFOOEFBaFNHTEVaektNZEpjUmRoR2Y4LTFNdVNvc2h5OGVBeGd1Z0pudDdvelhPSjhWZTYzNTh2NkRWd1JWUmhuM1hObldaNnZseUZXRWlCQ3Y4cDVWcdIBlAFBVV95cUxNVlVnQ3I4a2VrS3k1ZjlGOHBzQmhXM3RMN2lXUThBcWhmYzNxY2xCLUxzaHFMUkh3ZEhxMzB6NFBNT0FZNXJKam1lbjd3MGJjMVBsLXFESnVXOFpJX2swYzZzX1VZNHVBcjZVZ1ZxZXJzeHNSUFJWQ2RUZVYxUkNjbjBuSXRkdDVleWZqeUR3OTFYajQ0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "SEC Has Secretly Considered Ethereum a Security Since 2023, Says Consensys in Unredacted Lawsuit - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe U.S. Securities and Exchange Commission (SEC) has internally considered Ethereum to be a security for over a year, according to previously redacted portions of a lawsuit filed by software giant Consensys against the SEC that were revealed this morning.\n\nPer Consensys’ complaint, Gurbir Grewal, the Commission’s Director of the Division of Enforcement, issued an internal Formal Order on March 28, 2023, announcing an investigation into “Ethereum 2.0,” authorizing employees of the regulator to investigate and subpoena parties involved in the buying and selling of ETH.\n\nThe order, which Consensys says was approved by the Commission on April 13, 2023, explicitly refers to Ethereum as a security in and of itself, as it authorizes the investigation of “certain securities, including, but not limited to ETH, as to which no registration statement was or is in effect… and for which no exemption was or is available.”\n\nThe revelation that the SEC has officially considered ETH to be a security for over a year is a remarkable one. SEC Chair Gary Gensler has repeatedly deferred when asked explicitly regarding the agency’s stance on the matter. As recently as last month, Gensler refused to state the SEC’s position when it comes to ETH.\n\nAD\n\nAD\n\nAn SEC spokesperson told Decrypt that the regulator declines to comment on the matter.\n\nEthereum, which had already been sagging with the rest of the market on Monday, was trading for $3,143.69 at the time of writing—marking a 5% slip from this time yesterday, but only 1.5% lower than this time last week, according to CoinGecko data.\n\nFor years, the crypto industry has held out hope that Ethereum—the second largest cryptocurrency in the world after Bitcoin, and the foundation of the massive Ethereum ecosystem—might be considered a commodity in the American government’s eyes, paving the way for ETH’s integration into the American economy on a trajectory similar to Bitcoin.\n\nThe head of the Commodity Futures Trading Commission (CFTC) has explicitly declared Ethereum to be a commodity in the past.\n\nAD\n\nAD\n\nIt would appear that the SEC’s scrutiny of Ethereum escalated after the blockchain’s September 2022 merge event, which transitioned it to an energy-efficient proof of stake consensus mechanism. That new structure now allows users to stake ETH with the network to help it function—and accrue rewards in the process—a financial incentive the SEC clearly takes issue with.\n\nIn the year following the SEC’s reported internal Formal Order regarding Ethereum, the agency has steadily ratcheted up its offensive against entities involved with the cryptocurrency. In February, the Ethereum Foundation, the Swiss non-profit that supports the Ethereum ecosystem, was subpoenaed by an unnamed “state authority.” Several American crypto companies have received subpoenas related to their dealings with the Ethereum Foundation.\n\nAnd last week, Consensys, perhaps the largest Ethereum-focused American company, filed a preemptive lawsuit against the SEC, arguing that it does not have the grounds to regulate Ethereum, as the asset should not be classified as a security.\n\nEditor's note: This story was updated to reflect the SEC's decision not to comment on the unredacted lawsuit and to clarify the process of ETH staking.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPeFBUS1BHVEJiNFEzeEVKWTlqV21VbHVrdVcwOGV2WTdXNmxibUpvdTZMazJQaU9sbi1WUFRoSHU1R2FSOE1YaUVOZjduVWVSX09NTWtlUVQtajdWMTdLMFBkQ1V6aVA2Tjlwa2JDWnhYMFo3dUhES1NoRXhheERFVGpyQUh5NjZJRmVuajhUZkgzTmU1YkRwRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Why Ethereum, Dogecoin, and Bitcoin Cash Are Slumping Today - The Motley Fool",
        "content": "These three large-cap tokens are seeing various regulatory pressures impact their valuations today.\n\nMany of the closest-watched large-cap cryptocurrencies are seeing significant selling pressure in the market today. Ethereum (ETH -1.79%), Dogecoin (DOGE -5.49%) and Bitcoin Cash (BCH -2.13%) have dropped 4.5%, 5.8%, and 3.8%, respectively, over the past 24 hours as of 2:30 p.m. ET.\n\nThese moves come despite relatively strong price action in the stock market, with a number of more speculative meme stocks surging today. With cryptocurrencies associated closely with these assets (particularly when we're talking about meme tokens such as Dogecoin), one needs to ask the question -- what's going on here?\n\nIt does appear some uncertainty around this week's upcoming Federal Reserve Open Market Committee meeting is leading to declines among major tokens, driving uncertainty with the macro backdrop in this space. But there are also some key token-specific fundamental factors that also appear to be in play. Let's dive into what's causing today's turmoil among these three top tokens.\n\nMacro/regulatory uncertainty remains\n\nEthereum's status as the world's second-largest cryptocurrency means it's a top digital asset of focus for many conventional investors looking to diversify into this space. What it also means is that regulators tend to pay greater attention to this token, particularly with an upcoming decision on spot Ethereum ETFs looming. Uncertainty around these ETF approvals in the U.S. continues to remain high, despite other jurisdictions already approving exchange-traded products aimed at Ethereum.\n\nAdditionally, a lawsuit filed against the SEC by Ethereum developer Consensys has generated significant attention in recent days. This lawsuit aims to prevent what the developer calls an \"unlawful seizure of authority,\" a move many in the crypto community are applauding, ahead of key regulatory decisions in this realm.\n\nOther regulatory impact of various moves from exchanges such as Coinbase (COIN -5.55%) to list Dogecoin futures, among other products, remains to be seen. For now, these three tokens will likely receive outsized scrutiny on this front, with investors clearly taking a more cautious approach to these assets in today's session.\n\nThis slate of regulatory concerns can be capped off by news that a recent payment update on claims tied to Bitcoin Cash and other tokens for those impacted by the Mt. Gox debacle years ago has been provided. This update indicates a completion date for claims has been put forward, leading to likely selling pressure for Bitcoin Cash, at least over the near term.\n\nWill this bearish momentum continue?\n\nFor now, there are plenty of regulatory-related headwinds investors appear to be pricing into the crypto sector. These three tokens have perhaps the most unique and noticeable headwinds, though it's also true that the Securities and Exchange Commission has continue to drive home a hawkish narrative on the space. That could mean continued uncertainty over the near term, which often leads to the kind of volatility we're seeing today.\n\nIt remains to be seen if we'll see an immediate bounce-back from this selling pressure. The crypto market continues to see impressive attention, and while capital flows into digital assets appears to be slowing, these projects are worth considering. Thus, for now, I'm going to keep these projects on my watch list and provide updates as they come."
    }
]