[
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQV255UXdJRFFLcEI5aks5S2hYcEJjdGhaeHF0VFpUaVNLYmpIN3pqa1RnT3Ewb1JQWm5EcDZQeFE5UkpQNk9OTUdLYVZvcVNnaGtHVDJqTzQ1SnlwZGdZZ1NfbTlaRjhnQ2ZLV0lVQ3JidF9GVXpnRXFOT3gtalZNZGtBV04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "SEC delays Fidelity’s Ethereum ETF decision - Yahoo Finance",
        "content": "Fidelity’s quest to launch a spot Ethereum exchange-traded fund (ETF) has hit a regulatory roadblock as the U.S. Securities and Exchange Commission (SEC) extended its decision window.\n\nFidelity’s Wise Origin Ethereum Trust, if approved, is a fund that would track the performance of Ether, the second-largest cryptocurrency by market capitalization. It would allow investors to gain exposure to digital assets without directly owning them.\n\nAccording to James Seyffart, an ETF analyst at Bloomberg, the SEC may choose to approve a batch of spot Ethereum ETFs as it did with Bitcoin. Seyffart pointed to May 23 as the next key date, the deadline for the regulator’s decision on VanEck’s Ethereum ETF application.\n\nThe SEC approved 11 spot Bitcoin ETFs last week, allowing such funds to be traded for the first time in the U.S. Before the approvals, the SEC rejected all spot Bitcoin ETF applications.\n\nEther price outshined Bitcoin’s price following the approvals surging past US$2,600 for the first time since May 2022, CoinGecko data shows. Ether has since fallen, losing 7% over the past week to US$2,436 at 12:30 p.m. ET. Bitcoin dropped 6.4% in the same period to trade at US$40,642.\n\nFidelity’s Bitcoin ETF, one the funds that received the SEC’s green light last week, crossed the US$1 billion today, becoming the second to do so, The Block reported."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQV255UXdJRFFLcEI5aks5S2hYcEJjdGhaeHF0VFpUaVNLYmpIN3pqa1RnT3Ewb1JQWm5EcDZQeFE5UkpQNk9OTUdLYVZvcVNnaGtHVDJqTzQ1SnlwZGdZZ1NfbTlaRjhnQ2ZLV0lVQ3JidF9GVXpnRXFOT3gtalZNZGtBV04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "SEC delays Fidelity’s Ethereum ETF decision - Yahoo Finance",
        "content": "Fidelity’s quest to launch a spot Ethereum exchange-traded fund (ETF) has hit a regulatory roadblock as the U.S. Securities and Exchange Commission (SEC) extended its decision window.\n\nFidelity’s Wise Origin Ethereum Trust, if approved, is a fund that would track the performance of Ether, the second-largest cryptocurrency by market capitalization. It would allow investors to gain exposure to digital assets without directly owning them.\n\nAccording to James Seyffart, an ETF analyst at Bloomberg, the SEC may choose to approve a batch of spot Ethereum ETFs as it did with Bitcoin. Seyffart pointed to May 23 as the next key date, the deadline for the regulator’s decision on VanEck’s Ethereum ETF application.\n\nThe SEC approved 11 spot Bitcoin ETFs last week, allowing such funds to be traded for the first time in the U.S. Before the approvals, the SEC rejected all spot Bitcoin ETF applications.\n\nEther price outshined Bitcoin’s price following the approvals surging past US$2,600 for the first time since May 2022, CoinGecko data shows. Ether has since fallen, losing 7% over the past week to US$2,436 at 12:30 p.m. ET. Bitcoin dropped 6.4% in the same period to trade at US$40,642.\n\nFidelity’s Bitcoin ETF, one the funds that received the SEC’s green light last week, crossed the US$1 billion today, becoming the second to do so, The Block reported."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQV255UXdJRFFLcEI5aks5S2hYcEJjdGhaeHF0VFpUaVNLYmpIN3pqa1RnT3Ewb1JQWm5EcDZQeFE5UkpQNk9OTUdLYVZvcVNnaGtHVDJqTzQ1SnlwZGdZZ1NfbTlaRjhnQ2ZLV0lVQ3JidF9GVXpnRXFOT3gtalZNZGtBV04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "SEC delays Fidelity’s Ethereum ETF decision - Yahoo Finance",
        "content": "Fidelity’s quest to launch a spot Ethereum exchange-traded fund (ETF) has hit a regulatory roadblock as the U.S. Securities and Exchange Commission (SEC) extended its decision window.\n\nFidelity’s Wise Origin Ethereum Trust, if approved, is a fund that would track the performance of Ether, the second-largest cryptocurrency by market capitalization. It would allow investors to gain exposure to digital assets without directly owning them.\n\nAccording to James Seyffart, an ETF analyst at Bloomberg, the SEC may choose to approve a batch of spot Ethereum ETFs as it did with Bitcoin. Seyffart pointed to May 23 as the next key date, the deadline for the regulator’s decision on VanEck’s Ethereum ETF application.\n\nThe SEC approved 11 spot Bitcoin ETFs last week, allowing such funds to be traded for the first time in the U.S. Before the approvals, the SEC rejected all spot Bitcoin ETF applications.\n\nEther price outshined Bitcoin’s price following the approvals surging past US$2,600 for the first time since May 2022, CoinGecko data shows. Ether has since fallen, losing 7% over the past week to US$2,436 at 12:30 p.m. ET. Bitcoin dropped 6.4% in the same period to trade at US$40,642.\n\nFidelity’s Bitcoin ETF, one the funds that received the SEC’s green light last week, crossed the US$1 billion today, becoming the second to do so, The Block reported."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNdGhYNVQ4dG1sRkZITjloY3RUTFVGTWh2T3pLXzI1SmhJZVNvaV9HY2ZPb20wVjUxTVFqZGlERlBCY0lmbzhZdnFWMVRYWWh4b0FYM3ZTd2hpZUJfUUpOUXA1UlFNdERENk53ZHZablpVQ3Ffd3B3ZG1LR1ZydTRMdjVQX0xVWGJXb2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum correlation plunges to lowest since 2021 - crypto.news",
        "content": "Kaiko Research highlighted that the correlation between Bitcoin and Ethereum has dropped below its average of 0.71 for the first time since 2021.\n\nThis development comes amidst a broader market downturn, with BTC and ETH prices falling nearly 6% over the past week, currently at $40,991 and $2,463, respectively.\n\nHistorically, BTC and ETH have demonstrated a strong correlation in their market movements. However, the recent divergence raises questions about Ethereum’s future trajectory, especially in light of its trade volume surge without corresponding signs of a rally in the derivatives market. This phenomenon contrasts sharply with the BTC market, which saw significant growth in anticipation of ETF approvals.\n\nYou might also like: Grayscale CEO: Most spot Bitcoin ETFs will not survive\n\nReflecting on Bitcoin’s past, it’s observed that BTC exhibited a remarkable 100% return over the past year, overshadowing Ethereum’s 60% gains. The approval of spot Bitcoin ETFs marked a pivotal moment; BTC prices dipped while ETH experienced a rally, fueled by speculation that it might be the next to receive ETF approval.\n\nInvestors had previously focused on “ETH beta” tokens, like Optimism (OP) and Arbitrum (ARB), which are closely linked to Ethereum but with higher volatility. However, after ETF approval, this trend saw a reversal, with these beta tokens experiencing a slump and ETH showing relative resilience by registering the smallest decline.\n\nThe current scenario underscores the evolving dynamics between Bitcoin and Ethereum. While BTC’s ETF journey catalyzed its market presence, Ethereum’s path appears less clear. Its reduced correlation with Bitcoin suggests a potential for independent market behavior. Yet, the lack of traditional rally indicators in derivatives markets and the shift away from ETH beta tokens post-BTC ETF approval inject uncertainty."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPbFZlbWNjckxYd2tUaXZncUQtVnV0Sy1JaTE0WXUyRUZrQUhvLWpFRnRrdlZScXZnbWJORE0yVWRkQ1lvWkZpdXphNUJudFVEdVVua3pXcUdsXzNpSk5sclZhLUREZ2RZX2VZNktucGU5S3dicTlDQjExdlhDQXlHdkR2X0VDeGc5d1hmdU9KRlJYQVcwdXVQTXJ0UVh4dWxjU2RMOEFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "SEC delays Fidelity’s Ethereum spot ETF, but decisions are still expected in May - CryptoSlate",
        "content": "The U.S. Securities and Exchange Commission (SEC) said on Jan. 18 that it has delayed its decision on Fidelity’s proposed spot Ethereum ETF.\n\nMore specifically, the decision concerns a proposed rule change that would allow Cboe BZX to list and trade shares of Fidelity’s planned fund.\n\nThe SEC noted that the proposed rule change was originally filed on Nov. 17, 2023 and published for comment in the federal register on Dec. 6, 2023.\n\nThe SEC said today that, based on those dates, it was previously required to approve, reject, or institute proceedings determining whether to disapprove the proposed rule change by Jan. 20. However, it has now chosen to use a provision that allows it to extend that deadline by 45 days to March 5, 2024.\n\nIt is likely that the SEC will choose to institute proceedings around Fidelity in March, as it done for certain other pending funds.\n\nSEC expected to decide on ETH ETFs in May\n\nBloomberg ETF analyst James Seyffart said today that the Fidelity delay was “completely expected” and asserted that late May deadlines “really matter.”\n\nThat May deadline appears to be related to the fact that the SEC must either approve or reject VanEck’s competing spot Ethereum ETF proposal by May 23.\n\nAs the SEC has already instituted proceedings on VanEck’s application, it cannot delay its decision any further. And because the SEC generally approves similar ETFs together, it will likely decide on all pending spot Ethereum ETFs in late May, even though other applications have later deadlines.\n\nIt should also be noted that Fidelity, VanEck, and several other applicants succeeded in gaining approval for spot Bitcoin ETFs on Jan. 10. The success of those Bitcoin ETFs does not guarantee that Ethereum ETF proposals will also gain approval.\n\nPublic expectations are divided: one prediction market on Polymarket currently reports 54% odds in favor of spot Ethereum ETF approvals.\n\nEthereum Market Data At the time of press 12:26 am UTC on Jan. 19, 2024, Ethereum is ranked #2 by market cap and the price is down 2.47% over the past 24 hours. Ethereum has a market capitalization of $295.94 billion with a 24-hour trading volume of $11.91 billion. Learn more about Ethereum › Ethereum $2,462.54 -2.47% Crypto Market Summary At the time of press 12:26 am UTC on Jan. 19, 2024, the total crypto market is valued at at $1.63 trillion with a 24-hour volume of $63.06 billion. Bitcoin dominance is currently at 49.61%. Learn more about the crypto market ›\n\nMentioned in this article"
    }
]