[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxNd1pnWGRJZk90NVZCd2J2cTMxeUVfSzZaUHloVTJLZGNkUU9JOTRNdlE3cUsydVUwblBYc3lIZE11T0QxMXNtcGx1RmMzUVpxV095Rnp3TmVJekFJWWZLRUNHODRrOEtBUTR3VzdEZUVoSGV0UWdqbTZyNHRiVFNmQ1NqUXdUSTRNbDNMRURud1ZMUF9TeG40czlNOVZyOS1uNjBWMENyYnFibFFSWEU2LW95eXNxcDBNQVdkd3RDWXNsU2h3UHlrRXFZT052V2tPSEdOeGUzTVVlWWta0gHiAUFVX3lxTFBibWFHVTFuNUJIVmZHZWtoNFpfZlctQXVGWWgzNExyUHpGNGdlWmhvWWlTOERiRXV6ekJMbzNhc1pFSkNGcGtVemNHd1VsMlRKTU1hX0thRzRhLUprTmlmdDg3dENXbGtLZUdNX1c0eFdNOGhSVzNrX0tFZHREUko5STNVTjBZSGctdXpsdDk3bGtndUVuY3Z3cUhmS2d6b2NsbTY1ZG1MU21UWDV5eEpkamZNcm4zeXpPdXQ1R0FrR1NfUjBpNE81VHBqUFdTQmtnVlFuX2Z3Nk8xNklfYnVsd3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum On-Chain Metric Suggests Potential for Altcoin Market Rallies, According to Analytics Firm CryptoQuant - The Daily Hodl",
        "content": "An Ethereum (ETH) on-chain metric suggests the altcoin market could be primed for a price surge, according to the digital asset analytics firm CryptoQuant.\n\nThe firm says on the social media platform X that Ethereum’s Market Value to Realized Value (MVRV) indicator is rising faster than Bitcoin’s (BTC) MVRV.\n\n“This suggests that ETH’s market is heating up. Historically, when Ethereum surges, other alts tend to follow.”\n\nMVRV is the ratio of a digital asset’s market capitalization relative to its realized capitalization (the value of all the assets at the price they were bought). It is used to assess whether the token is undervalued or overvalued.\n\nETH is trading at $3,514 at time of writing. The second-ranked crypto asset by market cap has largely traded sideways this week.\n\nCryptoQuant also notes that Bitcoin is trading below the critical support level of $65,800, which the firm says suggests a potential 8%-12% correction toward $60,000.\n\nBTC is priced at $64,148 at time of writing. The top-ranked crypto asset by market cap is down nearly 1.5% in the past 24 hours and more than 3% in the past week.\n\nJulio Moreno, CryptoQuant’s head of research, says on X that the Bitcoin market is currently at its least bullish point since September 2023, based on its bull market cycle indicator.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQVFEwaktMd2daOGVWMHB6dDdNNEVUOF8tSHotdjN0RnVab0tSM2dldUMzNDE1MFZYTTQ1ZHBEcUg5d0xvSHF6Wm12dGxYRV9pQkhRWVJmTE9lN2l1cExEVEJSUnlBVDVTZW5lT3c3OHJCU1M1OHpZSXZNYVlDUVRSRi1vVzVVUVF1VnhhS0RTT01Fa3k4cVotZWJGZFNXd0hRMkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "BlackRock, other issuers update S-1 filing for spot Ethereum ETFs, raising expectations for July launch - CryptoSlate",
        "content": "Seven spot Ethereum ETF applicants amended their registration statements with the SEC on June 21, leading to increased expectations of a trading launch in early July.\n\nFranklin Templeton, VanEck, Invesco Galaxy, BlackRock, 21Shares, and Fidelity submitted updated S-1 registrations for their respective funds.\n\nGrayscale submitted an amended S-3 registration for its Ethereum Trust and an additional amended S-1 statement for its mini Ethereum Trust. Bitwise did not amend its registration statement.\n\nBloomberg ETF analyst Eric Balchunas continued to predict July 2 as an over/under date for the funds’ launch following the latest filings, saying:\n\n“Anyway that’s basically a wrap. Ball in SEC’s court now.”\n\nHe also maintained his view that Ethereum ETFs are unlikely to attract more than 20% of the AUM Bitcoin ETFs have attracted.\n\nFees disclosed\n\nFranklin Templeton disclosed a 0.19% sponsor fee in the updated filing. The firm will waive the fee for the first $10 billion assets for six months. Meanwhile, VanEck disclosed a similar 0.20% sponsor fee, which it intends to waive for the first $1.5 billion assets until an unstated date in 2025.\n\nBalchunas believes the low fees will pressure BlackRock to announce sub-30 basis point sponsor fees for its fund as well. Notably, both BlackRock and Fidelity have yet to disclose sponsor fees for their ETFs.\n\nExperts believe BlackRock’s fee, in particular, will be a key detail that could lead to heightened competition among the firms. Balchunas said the asset manager’s fee is the most important missing detail other than the launch date.\n\nAccording to the analyst:\n\n“[BlackRock’s] fee is the sun that the rest will need to orbit around.”\n\nThe launch of spot Bitcoin ETFs in January notably led to a “fee war” among issuers, each vying to offer competitively low fees. Currently, spot Bitcoin ETF fees largely range between 0.19% and 0.39%, though Grayscale’s GBTC has a higher 1.5% fee.\n\nSeed investments\n\nInvesco Galaxy disclosed a $100,000 seed transaction on June 17 in which the seed investor purchased 4,000 Shares at $25 per share.\n\nGrayscale disclosed a $100,000 seed share purchase for its mini Ethereum trust. On May 31, the sponsor purchased 10,000 shares at $10 per share.\n\nFidelity said its seed capital investor, FMR Capital, purchased 125,000 shares at $37.99 per share on June 4, contributing $4.7 million to the trust.\n\nMeanwhile, BlackRock previously reported $10 million in seed funding for its ETF.\n\nMentioned in this article"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNUndSbVNhbXJGam5fWDlRajdpMzdHUEZuZVRHQUtLME03MEppcDczbzI2MHRoZzk4Yl9CUjhRQXhaWjVtRWVHbFhxU2FwN253QTVLUmhHTVJrOXFQX1dJejlISVA2aDdTdV9aWDFrd3ZFZEtKcXZfZjY4VXR3ZnE3dEt30gGKAUFVX3lxTE81T1hPRmpIX2RPZFhMREVHSW9TQmJudTZ3Tk15YXhFeXdxZFVWbW1TUWJ6T3FSN0lKSjlGZnZESm5KTnR2RTEwMXN4bFNhOWNBT2NhLTBKc3pxbUVON09uRDhMTExVbTFKUEtzT21NUVBZWWF2YXZlOWtDX3RBRVZHdUFIQVF2a2tnQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "This Week in Coins: Ethereum Stays Afloat as Crypto Market Sinks - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nIt’s been another uninspiring week for Bitcoin, with the top crypto asset chopping sideways to enter the weekend below $64,500, notching another 2.6% loss in the last seven days.\n\nIt's extra disappointing given how MicroStrategy bought another $786 million in BTC this week, which the company’s founder says it never plans to sell. Still, MicroStrategy’s demand was overpowered by an onslaught of sell pressure from other long-term Bitcoin whales, including the German government.\n\nCryptoQuant noted that the broader crypto market is starting to lose momentum due to a lack of new investor demand. It follows, thenn, that most momentum-based meme coins like PEPE, DOGE, SHIB, and WIF are all down 5%, 9%, 13%, and 25%, respectively, on the week.\n\nAD\n\nAD\n\nToncoin also lost some of its momentum from last week, dropping 10% after previously rising to all-time highs on hype from projects within its gaming ecosystem. It remains a top ten crypto by market cap, and is only $300 million away from overtaking Dogecoin.\n\nDefying the market’s momentum to some degree is Ethereum. Its trading at $3,492 as of writing, hovering within a percent of its price seven days ago as Ethereum spot ETFs inch closer to reality. Multiple asset managers have now unveiled the fee on their ETFs, and Bitwise even published a commercial advertising ETH to old-school TV audiences.\n\nSolana—Ethereum’s top smart contract competitor—was less fortunate, sliding another 6% this week to $134.92.\n\nOne of the network’s high-flying Trump-based memecoins, DJT, amassed a $110 million market cap this week, and made headlines on rumors that it may have been launched by Trump’s team itself. One of the ex-president’s legal consultants later confirmed that the coin wasn’t launched by Trump nor his offspring.\n\nEven crypto stocks couldn’t retain momentum this week. Coinbase (COIN) fell 8%, MicroStrategy (MSTR) fell 1.96%, and DeFi Technologies (DEFTF)—which soared after buying Bitcoin earlier this month—has cratered 29.9% this week after crypto reports spread doubt about the company online.\n\nAD\n\nAD\n\nAll the negative momentum from altcoins this month has many analysts saying the crypto bull market may already be over. Still, BitMEX co-founder Arthur Hayes doubled down on his bullish thesis this Thursday that now is the time to ape into shitcoins and “buy the fucking dip” – before global money printers go brr.\n\nPrices as of 3am ET. Edited by Ryan Ozawa."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNb0wzSnlqdTlYMTl5X2NTY1dUZ0lKbTBBS2tWUTZEdlkxRklPNEdJaHBCbWNLS0FzeVZia1BXdUYtMmtIRllYUHZSQWxmeWtFMGFmdXJzVWRSV3BTR1FzcXFrdGN2RDA3c1BIZUk2UWZKbnVrYUtjRzB5enhzVjVrMTdIWEYzNWM0RFpCWlZ4OXdTZlc2V0dEdWNRd3VYVVdGQXlaQlRR0gGrAUFVX3lxTE1ES3hxbzNseG9pRlIwRC1FRERJeXZ0UEE5dmxKODhzajQ5aUhIRjlsRDVsWnEzcm9DZmlGTDE3WXBlT1ZJb1BFdHlZbVdWY3o1VE5hYXFzQjdReTdrU2pUVURtajV1VllaYXlGdlpyY3ZROWJkZHlxaHIwWnhWczhCcHRpR0hNOVhSeU5HaEhoQjlJVFJfa3A5S3Jqc3laT2ZuN0QyRThONVdYSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Eyes $3900 Rebound as On-Chain Data Favors Ethereum Over Bitcoin - CoinGape",
        "content": "The second largest cryptocurrency Ether witnessed medium volatility for the past two weeks, hovering above $3360. The prolonged correction in Bitcoin and development around spot ETH ETF are fueling the uncertainty sentiment in this asset resulting in sideways action. However, with the broader trend bullish the Ethereum price shows growth in on-chain data indicating a potential for bullish reversal.\n\nAlso Read: S&P Global: Ethereum Restaking Can Give Birth to ‘Internet Bond’ Market, Will SEC Approve?\n\nadvertisement\n\nKey Support Levels In Ethereum Price Amid ETF Updates\n\nEthereum coin entered the current correction trend in late May as the price reverted from the $3975 level. With Bitcoin price leading a downward trend, the ETH price of 15.5% to seek support at $3360, concising with the 100-day EMA.\n\nThe long-tail rejection candles at this support indicate the intact demand pressure likely bolstered by the development in Spot ETH ETF. Six companies have updated their SEC applications for Ethereum ETFs, as highlighted by Satoshi Club.\n\n📜Six companies have submitted amended applications to the SEC for the registration of spot Ethereum ETFs. Two of them disclosed the commission fees of 0.19% and 0.2%. Three companies indicated the initial investment volume, which is significantly lower than that of… — Satoshi Club (@esatoshiclub) June 22, 2024\n\nTwo firms disclosed fees of 0.19% and 0.2%, while three revealed initial investment volumes significantly lower than BlackRock’s. With the recent success of Bitcoin ETFs, the U.S. listing of spot ETH is anticipated for a major impact on Ether price.\n\nAccording to CryptoQuant, Ethereum’s Market Value to Realized Value (MVRV) ratio is outpacing that of Bitcoin, suggesting an uptick in market activity for Ethereum. This increase is often a precursor to broader market movements, historically leading to rallies in other altcoins following Ethereum’s lead.\n\nThus, even if the overhead supply pressure persists, the ETH price may likely fall 6% before witnessing high demand pressure at the ascending trendline. This dynamic support intact since November 2023 bolsters a series of higher lows maintaining a buy-the-dip sentiment.\n\nIf the support holds, the ETH price could take the next recovery leap targeting the $3900.\n\nHowever, for buyers to regain better control of this asset, a breakout from the above overhead trendline (blue line) is crucial which could assist the ETH price prediction to target ATH at $4842.\n\nTechnical Indicator:\n\nPivot Levels: With the ETH price projecting a potential for a new high, the Pivot indicator highlights potential resistances at $5371, followed by $6000.\n\nRSI : A daily Relative Strength Index slope wavering around the 50% mark indicates a neutral sentiment among market participants.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPa085cXVBV0Vjb3JfNllmMzRWYUNUUE5FZXdheUZIaW9uMGhrdjFVNnNMenZrbFJEbkNwU0tiSkdVQmJicEl6cUxfRzR2UG1nUmkxSDAtM0hDSkVhb0hJdllZa1hIZXpQNVdXcWVKZnVnZDVDZTJOai0xSHlvOWZfSTF30gGHAUFVX3lxTE5VZVoyMkl1S01qVkhncXp6aW80MlZGSXZrNklQY2ppRm03RTJYb0JvUFNKa2NkaHlNREs1TUMxczhwWjJFcW9qUTV3Y3A0WnFJZXVObE50dWtEUUJhOVZsbzRKeGFJN2I5MDRhTFlVS0NyZFlKaHlDUkFucy00SXpzTWo0OEZEOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) vs. Ethereum (ETH): Which Will Win Q3 2024? - CryptoPotato",
        "content": "The world’s number one and two leading cryptocurrencies by market capitalization, daily transaction volume, and crypto exchange volume have almost perfectly tied for ROI from Jan. 1 through the middle of June.\n\nFor comparison, the S&P 500 Index notched up nearly 15% over that same period. But that’s more than the broad stock market benchmark usually makes in an entire year.\n\nSo even during an unusually good two quarters for U.S. stocks, Bitcoin and Ethereum delivered investors four times more ROI. In other words, Bitcoin broke the government’s investment planning tool. Again.\n\nThe average annualized ROI for Bitcoin and Ethereum price performance since Jan. 1 is aces. The top two cryptocurrencies are pacing for a +116% year.\n\nThat’s a return so high that the compound interest calculator tool on Investor.gov does not even allow users to enter interest rates above 100%.\n\nBy the way— if you enter $100 a month into the calculator for 15 years at an estimated interest rate of 15% (above average for the S&P 500), with a daily compounding frequency, you end up with $68,815 in 15 years for capitalizing your country’s economy with a total of $18,100 in contributions.\n\nIf you do the same exercise with Bitcoin or Ethereum profits, and just enter 99% for the interest rate – the result is a little different (more like a bajillion dollars).\n\nQuestion is which cryptocurrency will outdo the other in Q3, or will Bitcoin and Ethereum come remarkably close again to earning the same amount of profit for crypto investors in the next half of the year?\n\nHere are six salient factors that may be worth considering. Some are more bullish for BTC, some for ETH, and some are a wash between the two blockchain network giants.\n\n1. Fed Dollar Inflation (Advantage Bitcoin)\n\nThe center of gravity for the entire global financial system is the U.S. federal funds rate. It represents the cost for Federal Reserve banks to borrow cash from the ultimate lender in the economy.\n\nThe Fed interest rate calibrates the dollar interest rates for loan products all the way down the food chain to store credit cards and pay day lenders. When it goes up or down, so does the rest of the financial economy with it.\n\nBut when it goes up that’s a big headwind that puts downward pressure on prices for stocks and cryptocurrencies. However, when it goes down, there’s a big tailwind for investment products that tends to put upward pressure on their market prices.\n\nIt looks like there will be one interest rate cut for the U.S. dollar later this year. “If all of it happens to be as forecasted, I think one rate cut would be appropriate by year’s end,” said Philadelphia Fed President Patrick Harker on Monday. After the Fed left rates unchanged last Wednesday for the seventh FOMC meeting in a row, Investopedia reported:\n\n“A bevy of tamer-than-expected inflation numbers over the past week has supercharged expectations that a Federal Reserve rate cut is ahead, but Fed officials themselves are proceeding with caution.” “What we’ve been getting is good progress on inflation, with growth at a good level and with a strong labor market,” said Fed Chair Jerome Powell. “Ultimately, we think rates will have to come down to continue to support that. But so far, they haven’t had to.”\n\nMeanwhile, other central bank economies, like those in the United Kingdom and South Korea, are getting antsy to cut rates.\n\nNot if, but when the Fed eventually begins to trim rates back down again, it will be a tailwind for crypto, but especially for Bitcoin – because of its deflationary tokenomics, with a hard supply cap of only 21 million BTC tokens to ever be issued by the blockchain network.\n\n2. DeFi and DApps (Advantage Ethereum)\n\nBitcoin is like digital gold, but Ethereum is like the automotive economy that burgeoned in the 20th Century as a result of the Industrial Revolution. Bitcoin is scarcity in the digital world of cyber abundance.\n\nIt turns out that a world without scarcity is missing something useful. Meanwhile, Ethereum is a vehicle to bring different parts of the economy closer together so they can engage in smart financial markets.\n\nMetaMask, Oasis App, MakerDAO, and Uniswap usage statistics continue to wow in 2024. In February, MetaMask announced a 55% surge in users from 19 million to 30 million in a matter of four months.\n\nThe numbers are almost as high as the 2022 peak for MetaMask installations now. The company behind the Ethereum wallet says those 30 million users manage 100 million accounts with MetaMask.\n\nOasis App is a decentralized app (dApp) built on Ethereum. According to data hosted by BitDegree the app’s balance was worth some $1,769,996,160 in market value Thursday and the dApp had executed 308,620 transactions in the last 30 days (a 100% increase over the prior month).\n\nEthereum MakerDAO is one of those beefy, serious DeFi dApps making the Ethereum vision happen. The decentralized app’s native cryptocurrency, the stablecoin DAI, is a small economy unto itself, with a market capitalization this week exceeding $5.4 billion.\n\nMeanwhile, Uniswap continues to impress. The leading decentralized exchange (DEX) for cryptocurrencies absolutely dominates other DEXs, ranking in fees almost as high as $100 million in total over the previous 30-day period.\n\nThe only Web3 apps to generate more fee revenue in the past month were: Bitcoin, Ethereum, Tron, and Lido.\n\n3. Institutional Adoption (Advantage Bitcoin)\n\nBlackRock CEO Larry Fink noted in March how the Bitcoin exchange traded fund was the fastest growing ETF in history.\n\nBlackRock CEO Larry Fink says the $IBIT Spot #Bitcoin #ETF is the fastest growing ETF in history\n\npic.twitter.com/NOsDlFgROi — Simon Dixon (@SimonDixonTwitt) March 27, 2024\n\nAgainst every other cryptocurrency, Bitcoin and Ethereum both have an advantage in regard to regulatory approval. But against each other, Bitcoin still has a clear advantage going into Q3 2024. Hundreds of millions of dollars flow into and out of the Washington-regulated Bitcoin ETFs daily.\n\nFormer U.S. President Donald Trump now has the confidence to promote cryptocurrency to voters on the campaign trail. Before the last presidential election in 2020, Trump said he was anti-Bitcoin and crypto.\n\nThat is a strong signal of institutional and mainstream crypto adoption for Bitcoin and Ethereum. Trump recently said he wants all Bitcoin to be mined in the United States and he thinks it can help win the AI arms race.\n\nMeanwhile, VanEck announced Thursday that it will be launching the first Bitcoin exchange-traded fund in Australia.\n\n4. Prague Electra (Pectra) Update: (Advantage Ethereum)\n\nThe Dencun Update – the most recent major upgrade to Ethereum – was a massive boon to Ether’s market value on crypto exchanges. Ether price went parabolic buying the news from Jan. 24 until the upgrade happened on Mar. 13.\n\nEthereum devs plan to ship the Pectra upgrade by early 2025, maybe in Q4 2024, so this will be a bullish tailwind supporting ETH price in the background for the medium term.\n\nPectra is short for the Prague-Electra update.\n\nThe Wall Street stock analysts over at TipRanks recently praised the Pectra upgrade in an article featured on Nasdaq for the update’s enhanced rollups and new staking limit for ETH validators: 2,048 ETH.\n\n5. Meme Coins (Advantage Ethereum)\n\nEthereum is still dominating meme coins, but the emergence of fungible token issuance on Bitcoin through the UTXO function using a technique branded Runes and some big hits in Q2 – like Dog Go To The Moon (Runes) – shows Bitcoin is a relevant player in this niche as well.\n\nThrough the Bitcoin Ordinals technique, BTC-minted NFTs remain popular and transacted in volumes of five and ten million dollars daily in June, according to Dune Analytics data.\n\nThe Ethereum meme coin economy, however, is a multi-billion dollar concern that continues to drive capital inflows to Web3 like the world’s gone mad.\n\n6. Competitive Analysis (Advantage Bitcoin)\n\nThe competitive landscape is an important factor in the horse race between BTC and ETH. These are far from the only two cryptocurrencies in the world in 2024.\n\nEthereum grows faster because of motivation from its competition, but it has far more competitors than Bitcoin. Market share in a competitive landscape is a real issue for this currency. It’s not just a technology, toy, or platform; it’s a business.\n\nWhile BNB, Solana, Cardano, Avalanche, Aptos, and a hundred others compete with Ethereum for DeFi market share, there is only one Bitcoin with only 21 million BTC. The Web 2.0 dons, Messrs Jack Dorsey and Mark Zuckerberg, both know the Web3 competition for those oranges is about to get fierce."
    }
]