[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOd1p2RVBvaHpkSkxpdGtTX3VuZXN1Q3hxTElTV3BGdjk1UV9rcUdBOEZCejNRQlAzdmtBa09oaHhmZzN4WXRFSkVnaFMteC1xaGU0MDNHMDVvT1BRSlo2eTRsaVRHYWdabExsdERlWE5nakJqak05QUNMZzN0dmhBR2xnaGxKOW5KUTFMbEFDbGVlNlNGZmtjYUpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Solana Up 700% Last Year, Beats Bitcoin and Ethereum Growth - Crypto Times",
        "content": "Solana (SOL) has risen by an amazing 700% in the last year, outperforming other cryptocurrencies like as Bitcoin (BTC) and Ethereum (ETH).\n\nAs per the data from CoinMarketCap, Solana is currently up 702% from the previous year. During the same time, Ethereum eclipsed Bitcoin, thanks to final approvals for token-focused funds. Ethereum has grown by 51% since the beginning of the year, outpacing Bitcoin’s 45% increase.\n\nAt the time of this writing, SOL is currently the fifth-largest cryptocurrency by market capitalization, having a bullish year till now. Currently, SOL is trading at $145.6, and a year ago it was trading at $20, and at its peak in 2024, it was $200.\n\nSolana Chart\n\nBitcoin’s initial run this year, aided by the launch of the first U.S. spot ETFs in January, saw it hit a new high of $73,798 by March. However, demand and price have subsequently slowed, and Bitcoin’s performance is being overshadowed by increased interest in Ethereum and Solana.\n\nETF excitement is responsible for Solana’s recent rise, especially when exchange-traded fund company VanEck applied for a cryptocurrency-based product.\n\nThe SOL token experienced its largest spike since late May after VanEck filed the necessary paperwork with the Securities and Exchange Commission (SEC) for the new Solana ETF. The boost reached as high as 11%.\n\nThe VanEck Solana Trust is the company’s newest product and the first Solana ETF to be registered in the US. This submission comes after spot Ether (ETH) ETFs were approved by the SEC for the United States on May 23, 2024."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOd1p2RVBvaHpkSkxpdGtTX3VuZXN1Q3hxTElTV3BGdjk1UV9rcUdBOEZCejNRQlAzdmtBa09oaHhmZzN4WXRFSkVnaFMteC1xaGU0MDNHMDVvT1BRSlo2eTRsaVRHYWdabExsdERlWE5nakJqak05QUNMZzN0dmhBR2xnaGxKOW5KUTFMbEFDbGVlNlNGZmtjYUpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Solana Up 700% Last Year, Beats Bitcoin and Ethereum Growth - Crypto Times",
        "content": "Solana (SOL) has risen by an amazing 700% in the last year, outperforming other cryptocurrencies like as Bitcoin (BTC) and Ethereum (ETH).\n\nAs per the data from CoinMarketCap, Solana is currently up 702% from the previous year. During the same time, Ethereum eclipsed Bitcoin, thanks to final approvals for token-focused funds. Ethereum has grown by 51% since the beginning of the year, outpacing Bitcoin’s 45% increase.\n\nAt the time of this writing, SOL is currently the fifth-largest cryptocurrency by market capitalization, having a bullish year till now. Currently, SOL is trading at $145.6, and a year ago it was trading at $20, and at its peak in 2024, it was $200.\n\nSolana Chart\n\nBitcoin’s initial run this year, aided by the launch of the first U.S. spot ETFs in January, saw it hit a new high of $73,798 by March. However, demand and price have subsequently slowed, and Bitcoin’s performance is being overshadowed by increased interest in Ethereum and Solana.\n\nETF excitement is responsible for Solana’s recent rise, especially when exchange-traded fund company VanEck applied for a cryptocurrency-based product.\n\nThe SOL token experienced its largest spike since late May after VanEck filed the necessary paperwork with the Securities and Exchange Commission (SEC) for the new Solana ETF. The boost reached as high as 11%.\n\nThe VanEck Solana Trust is the company’s newest product and the first Solana ETF to be registered in the US. This submission comes after spot Ether (ETH) ETFs were approved by the SEC for the United States on May 23, 2024."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPSXpDZ2pneWlQM1RIM2xvM0VheFFUSHZ0MHVMYWw4ZFBDV3lSUnhlNExTWTN1Wl95MnZ2aW14Q3NydXVZS3cwdkVTUkRyaHJsNU1VMElEYk1HYm5WUTVwTWdWSlFFUnFVTHpILWc0QTdJZDZBSTNwT1N6VWpOWDE0aTlubFladUt1ekc2eA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Solana (SOL) Surges 800% This Year, Outpacing Bitcoin & Ethereum - Watcher Guru",
        "content": "Solana (SOL) has shown impressive growth this year, surging by almost 800% and outpacing both Bitcoin and Ethereum. Over the last 12 months, the token has increased by more than 770% according to CoinMarketCap, despite its recent dip to the $141 level.\n\nAlternatively, Bitcoin and Ethereum have grown 100% and 82% in the same time frame, respectively. The development has firmly established SOL alongside both BTC and ETH as the top three cryptocurrencies in the market. That fact has led two firms to file for Spot Solana ETFs this week alone.\n\nSource: Bitcoin.com\n\nAlso Read: Solana June End Prediction: Solana Blinks To Help SOL Cross $180?\n\nSOL Beats Both Bitcoin and Ethereum in Yearly Gains So Far\n\nThroughout 2024 thus far, the US has approved two crypto-based ETFs. That is expected to grow, and Solana has emerged as a favorite to get the investment product, especially as its 800% yearly gains have outpaced both Bitcoin and Ethereum.\n\nA recent report from GSR Markets has said SOL “cemented itself as a part of crypto’s Big Three.” Additionally, they stated that it is “just a matter of time before Solana” gets its own ETF. That would place the three assets in rarified air, but looks more and more like it will become reality.\n\nSource: Decrypt\n\nAlso Read: 21Shares Officially Files for Spot Solana ETF\n\nBoth 21Shares and VanEck have filed for the Solana investment product this week. It speaks as much to Sol’s potential as an investment offering, as it does to the shifting regulatory conversion in the country. Moreover, it could speak to an even greater overarching change taking place.\n\nBloomberg recently said that “Bitcoin’s performance is starting to be overshadowed by Ether and Solana” as ETF hype grows. Additionally, there is the expectation that the latter could get a much-needed boost from the investment product discussions. If it does get approved, the industry, and the token itself, should be massively helped."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPN3JxZlA0RGh0enZWd2pKeExGc3NsOHNrWmh5S0hlUGZpbGQzRzFzRjc0Vm1PYkhQV2dibTA5ZHh4eTBnR1pEUXpJSUVjZHlYWXZva04zSGU0ZmVaNnA5MHVsMGp3RG1hSldUMmJPVnI0U1c0UGdXVmJwNGllYXNVT2NTbkJhT2dsc1NVOVNIMThmNUo1alRuY25DbmVFTXNlS2FGQndxOTdDaUlYZXdUSkNvLUNLTkhYRVAzY1ZFMjg1anBlSWFfNWhTMlhoTDkwX21ncGFWblTSAd4BQVVfeXFMTkJNSUhWUWpVak9ZbHlYVXVWX2NEcmpWbmFobmlSZWhMQU1ZLThtb1ZOMjFpZUpCLU5iZnZEeDJVTU5DeVdTTWRmZjF3UnBYTmZYcnBoc2ZkazNJTGFGVjB2VkNFbkx0THNLZElNNmplZnFYV0g5anFCSUF5S0hyMEJnRVF1WGRFT3k4Yi0xUlRDOG0zTWRkLXRrcFBiLWtvcU42cVFVdVlINFFFNUFmVS1KVWVpTWl2MEM5ZE9xaTNIZnNBRWIzS2VCWjRTQ3RxYnlqLS03QW5SZHU3TmVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Crypto Analyst Says One Ethereum Rival Is Extremely Undervalued, Maps Path Forward for Bitcoin and Chainlink - The Daily Hodl",
        "content": "A widely followed crypto analyst and trader believes that one Ethereum (ETH) rival is well below fair market value.\n\nCrypto trader Michaël van de Poppe tells his 722,500 followers on the social media platform X that layer-2 scaling solution Polkadot (DOT) could follow ETH’s upward trend.\n\n“DOT is likely going to follow Ethereum in its expansion upwards. This means that the current valuations of Polkadot are extremely low. I expect a lot from the Polkadot ecosystem with all the new segments.”\n\nLooking at his chart, he suggests the possibility of a bullish divergence for DOT on the three-day chart, a metric where a lower low appears on the price chart but then a corresponding indicator shows a higher low.\n\nDOT is trading for $6.20 at time of writing, down nearly 2% in the last 24 hours.\n\nNext up, the analyst predicts that Bitcoin (BTC) will consolidate in the near term around the lower $60,000 range.\n\n“Bitcoin did make a retest at $61,000. I expect this to continue consolidating, where I’m assuming that altcoins will have a higher return than Bitcoin.”\n\nLooking at his chart, the trader suggests that Bitcoin will bounce around $60,000 and soon return to around $64,000.\n\nBitcoin is trading for $60,757 at time of writing, down 1.47% in the last 24 hours.\n\nLastly, the analyst says that leading blockchain oracle service Chainlink (LINK) will likely rally against Bitcoin (LINK/BTC) in the near term as it bounces off a trading range low on the weekly chart.\n\n“Pretty significant start for LINK with this weekly candle of +11% on the Bitcoin pair. It’s still the cycle low and likely the bottom during this period of consolidation.”\n\nLINK/BTC is trading for 0.0002308 BTC ($13.92) at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQdlpySGswSldrbHpRTGxYM1Z6SVJxekxJNlptSnkzYUJ3a1JCR2Uya2pPVnlzOHBsWDM3eDQtaGJoMmJFWVhOaHBJanZnYTl1Nk1DNGFORzZaaWNXVy03TGpLVTVvOUhhTUpueW9tQVpzNnpsdjhiQUdlbDVtU3A2UlJQWnM0eWlDbm00Rld4VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Cryptocurrency: 3 ETH Coins To Stash Before Ethereum ETF Boom - Watcher Guru",
        "content": "The cryptocurrency world is now witnessing a dynamic shift. After Bitcoin ETF approval, Ethereum ETFs are in the queue to embrace the world and have already started to make waves in the current cryptocurrency realm.\n\nPost the Ethereum ETF approval, several analysts have already started to bet on how the phenomenon will help several Ethereum-based altcoins to skyrocket, turning them into a huge investment opportunity to capitalize on and make the most out of. Here are the latest top three ETH-based coins that an investor should stash before they hit big post the Ethereum ETF approval.\n\nAlso Read: Cryptocurrency: 3 Coins Set To Give 2x Returns In July\n\n3 ETH Coins To Stash Before They Skyrocket Post The Ethereum ETF Approval\n\nSource: WatcherGuru\n\nCryptocurrency #1- Floki Inu\n\nFloki Inu is another noteworthy Ethereum-based token that has made significant strides in the cryptocurrency realm. The token boasts a stellar community ecosystem and has been known to have float distinct marketing to tempt users from across the board. Floki Inu has recently launched a telegram bot with the intent to simplify crypto trading for traders and investors. The token is currently ranked 51st largest currency by market cap.\n\nAccording to CoinCodex, the token may surge and spike by nearly 222% by mid-July to trade at a price high of $ 0.00055. Post the Ethereum ETF approval, this figure can further amp up, making it an apt investment choice to explore and entertain. While Floki Inu is currently projected to be in a bearish mode, the cycle may change soon post the ETH ETF approvals.\n\n“The price of Floki Inu is predicted to rise by 225.91% and reach $ 0.00055 by July 28, 2024. Per our technical indicators, the current sentiment is Bearish while the Fear & Greed Index is showing 47 (Neutral). Floki Inu recorded 13/30 (43%) green days with 22.09% price volatility over the last 30 days.”\n\nCryptocurrency #2- Shiba Inu\n\nThe Shiba Inu ecosystem is known to constantly revamp its proceedings to woo investors. The token is currently busy curating a bunch of new product offerings that include launching the Shiba Eternity Blockchain version, as well as Shiba Hub, as new elements embellish its ecosystem. With the Ethereum ETF approval launch, SHIB can gain new price strength, which can help its investors accumulate new profits.\n\nAccording to CoinCodex, Shib may spike by 65% to trade at a new price high of $ 0.00002884. Per CC, SHIB is currently projecting a bearish signal but is bound to recover and heal, as its positive ecosystem upheavals will play a pivotal role in correcting its price valuation.\n\n“The Shiba Inu price forecast for the next 30 days is a projection. It is based on the positive/negative trends in the past 30 days. SHIB will be changing hands at $ 0.00002884 on Jul 5, 2024, gaining 65.31% in the process.”\n\nCryptocurrency #3- Pepe\n\nPepe is another notable cryptocurrency token that has made significant waves in the cryptocurrency sector. The token recently surged by nearly 3000% banking on the recent GME stock surge. Similarly, being an Ethereum-based token, Pepe can avail significant price valuation once Ethereum ETFs gain momentum in the mainstream market.\n\nAccording to CoinCodex, Pepe may surge by nearly 200% in mid-July, claiming an all-time high of $ 0.00003972. The CC buy indicators further project Pepe in the bullish realm.\n\nAlso Read: De-Dollarization Debunked: US Dollar Still King, Study Finds\n\n‘The price of Pepe Coin is predicted to rise by 225.55% and reach $ 0.00003972 by July 28, 2024. Per our technical indicators, the current sentiment is Bullish while the Fear & Greed Index is showing 47 (Neutral). Pepe Coin recorded 11/30 (37%) green days with 11.17% price volatility over the last 30 days."
    }
]