[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPdlBGRUd2eTRycEJYWjhGTF9wWFRySndkTGcyUkE4LXhrRXg4ajZCMVc2dFBwUGFWMjlmeUg3NUwyMmx2RlUwSWhXR01aU1FDbVlVTXQ1WnFtS25tdnh5WjhINVpjdVJ3NlNjYU9UeE5pNkNGVEhNY2NKcEJCY2RISGdabWNOMTVXdnFkNkpsN1RCVmNkQzlfNWxTRUNXMk1KY3NXb3ZGMkQ0ZHpiU2o2NQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Bitwise CIO on what a successful Ethereum ETF launch would look like - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitwise CIO on what a successful Ethereum ETF launch would look like\n\nMatt Hougan, Bitwise Asset Management CIO, joins CNBC’s Bob Pisani on “Fast Money Halftime Report: ETF Edge” to discuss the timeline for Ethereum ETF approval, potential next steps, and the track record of Bitcoin ETFs so far this year."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPdlBGRUd2eTRycEJYWjhGTF9wWFRySndkTGcyUkE4LXhrRXg4ajZCMVc2dFBwUGFWMjlmeUg3NUwyMmx2RlUwSWhXR01aU1FDbVlVTXQ1WnFtS25tdnh5WjhINVpjdVJ3NlNjYU9UeE5pNkNGVEhNY2NKcEJCY2RISGdabWNOMTVXdnFkNkpsN1RCVmNkQzlfNWxTRUNXMk1KY3NXb3ZGMkQ0ZHpiU2o2NQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Bitwise CIO on what a successful Ethereum ETF launch would look like - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitwise CIO on what a successful Ethereum ETF launch would look like\n\nMatt Hougan, Bitwise Asset Management CIO, joins CNBC’s Bob Pisani on “Fast Money Halftime Report: ETF Edge” to discuss the timeline for Ethereum ETF approval, potential next steps, and the track record of Bitcoin ETFs so far this year."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQS0wtRWU0dlhzcEYwQ3p5ZVRuS0ZrSjdza2U2cXlMQ2EyMzd3LVJFOU56ejQ0Zndua3lBT2ZKQk8xdjZpX1NxTk1VOTFHVnZSR1ZXeGl2MERCWFYzZU94elN4a19Mak54a3JTUkpReGc3djlPbWZxT0xySmFUSWdFWGxlb0ZHMGx0TmZodjNNYnBKQ0ZKRF9EQ19iNkU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF Could Start Trading by July 15th – ETFStore President - Crypto Times",
        "content": "Nate Geraci, the President of ETFStore, has forecasted that spot Ethereum ETFs could commence trading within the next two weeks, potentially as early as July 15.\n\nAccording to Geraci, the U.S. Securities and Exchange Commission (SEC) is likely to complete its approval process for spot Ethereum ETF trading this week.\n\nWill be *shocked* if spot eth ETFs not trading w/in next 2 weeks…\n\n\n\nLater next week a possibility, but think week of July 15th more likely.\n\n\n\nInterestingly, price of eth ↓ 20%+ since \"surprise\" 19b-4 approvals in late May. — Nate Geraci (@NateGeraci) July 6, 2024\n\nRecently, the SEC returned S-1 filings to prospective issuers, including major firms such as BlackRock, Fidelity, and Grayscale, with minimal comments.\n\nGeraci outlined a potential sequence of events, suggesting that issuers will submit revised S-1 forms by July 8, with final SEC approval possibly occurring around July 12. This expedited timeline reflects what appears to be constructive dialogue between the regulator and ETF providers.\n\nThe increasing momentum surrounding Ethereum ETFs has prompted additional market activity. YieldMax, a known ETF issuer, has filed for an Ether Option Income Strategy ETF, while Hashdex is pursuing approval for a combined Bitcoin and Ethereum ETF.\n\nThe SEC’s decision in the coming days is expected to have significant implications for crypto investment. Approval of spot Ethereum ETFs could potentially facilitate broader mainstream adoption of Ethereum-based financial products."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPNDUxWmZVTHFRdXNzZTRsVklkUXA3RjVGLTBMRjBVTTF3RXc2cHowTzdBX3Ruam4yUkpKTzF3ODRQRzJHVVNZdWJuY0k1elVKUXB2aWsxSWoyMG44N202cExLOVI1RnhsV1ZNalNMdXlqcFpnVlhvWUx3MWNwd1kzV1RZczlFM2tIUWFyOGc1djBETC11NG1YT0xscmo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "I’d be ‘shocked’ if Ethereum ETFs aren’t trading soon, says expert — here’s when to expect an SEC nod - DLNews",
        "content": "The launch of spot Ethereum ETFs is expected to jolt crypto markets.\n\nInvestors are expected to pour $500 million into the fund in their first week.\n\nThe question is when the ETFs will begin to trade.\n\nThe crypto industry’s high hopes for the launch of spot Ethereum exchange-traded funds this week are fading.\n\nWhile some experts went into the Independence Day weekend with the prediction that the ETFs could start to trade as early as this week, ETF Store president Nate Geraci says it’s more likely that the launch will happen the week of July 15.\n\nHe said he would be shocked if spot ETH ETFs don’t launch within the next two weeks.\n\nThe delay is a minor setback after market watchers had already pushed back their launch estimates from the week of July 4 to after July 8.\n\nThe timing of when the Securities and Exchange Commission green lights the next batch of ETFs is crucial.\n\nWhen the SEC approved 11 spot Bitcoin ETFs in January, it triggered a market rally that saw Bitcoin surge to record heights.\n\nIf spot Ethereum ETFs can replicate that success, it could jolt cryptocurrencies out of last week’s nosedive that wiped almost 20% off the sector’s total value, according to CoinGecko.\n\nExperts estimate investors will pour up to $500 million and $15 billion into the new funds in the first week and first 18 months, respectively.\n\nJoin the community to get our latest stories and updates\n\nYet, pundits keep pushing their estimated launch date forward as the regulator repeatedly asks applicants like Blackrock and Fidelity to amend their applications.\n\n“No one really knows why the SEC is taking their sweet time with these, given how light comments were, these could have easily been trading by now,” Erich Balchunas, analyst at Bloomberg Intelligence, tweeted.\n\n“Could be one ‘problem’ issuer slowing down process or just summertime lazy or people on vacation. Not sure.”\n\nHe added that all indications suggest the launch will still happen this month.\n\nCrypto market movers\n\nBitcoin is down 0.2% over the last 24 hours to about $56,809.\n\nEthereum is up 1.5% over the same timeframe to about $3,012.\n\nWhat we’re reading\n\nEric Johansson is DL News’ News Editor. Got a tip? Email a eric@dlnews.com."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQYXlRQ3hfRWdZWS0yekNLcG1FQWdUR1Q1RW1weVZDYTZETlNEZWhyMkktdEt4cUtuek9tTDFsazgzcW5LT2RWQWRPMzhBalYwcm5FSXI0azg4OURqa2dnR296NmNHSHBrWGFLcVhCVnBjMmVsaFlKd2wzYjFDNDV5TUJFMTMyMnBFenfSAZIBQVVfeXFMTkRqM0ZsTnd6ajZ3NW1OUWpNVjNqaEJQd1U5cEpoN2FMYTI0Ry1PNGpQS2RONTlkOU16UTY3YkZVVmhVamlsc1Y1S2tJaGhmUDFvdzhSczNQbWd5MkNGVTcwU1h2RlczczAycnJmVGcyVzktdXZlT2QwMWdQYllTZklkWm9jeDVzTDhKeHpKeFVEMXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Staked Ethereum Hits 27% of Supply as ETF Trading Start Looms - Decrypt",
        "content": "In brief Over 27% of the Ethereum supply is currently being staked.\n\nThe rise of staking has prompted concerns over centralized firms overseeing so much ETH.\n\nProviders of spot Ethereum ETFs in the U.S. won't be able to stake their ETH due to regulatory concerns.\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAs the crypto market eagerly anticipates the potential launch of spot Ethereum ETFs in the U.S., a staggering 32.6 million ETH—over 27% of the total supply—is now being used to secure Ethereum's proof-of-stake network, according to the latest data from Coinbase.\n\nThis milestone underscores the growing enthusiasm for Ethereum staking, even as the ecosystem grapples with the implications of the long-awaited Ethereum ETFs. The new exchange-traded funds, unlike their underlying asset, won't be able to stake their holdings due to regulatory constraints.\n\nThe rise in staked ETH has been steady, with a brief slowdown following the Shanghai upgrade in spring 2023. As of this writing, Ethereum is trading just below $3,000, down 14% over the past week amid broader market volatility.\n\nThe SEC's approval process for Ethereum ETFs has been slower than initially expected. Bloomberg ETF analyst James Seyffart noted on Twitter (aka X), \"We're thinking these things could potentially list later next week or the week of the 15th at this point.\"\n\nAD\n\nAD\n\nThis comes after Bitwise filed an amended S-1 form ahead of the July 8 deadline, potentially indicating that the products are nearly ready for launch. VanEck then filed its own amended S-1 on Monday.\n\nEvan Van Ness, a prominent Ethereum researcher, offered insights on the staking situation. \"We definitely don't need this much ETH staked, given how Ethereum proof-of-stake has so many times more economic security than proof-of-work,\" he told Decrypt.\n\nHe also cautioned about centralization risks: \"If your staking pool is running a majority client or runs in the cloud, you are putting your ETH at risk.\"\n\nThe inability of ETFs to stake has spurred innovative approaches from traditional finance players. Franklin Templeton, managing $1.6 trillion in assets, is planning to launch a fund focused on altcoins and staking rewards, unnamed sources with knowledge of the firm told The Information.\n\nAD\n\nAD\n\nStaked Ethereum, Source: Beaconcha.in\n\nMeanwhile, Toronto-based Purpose Investments already has an Ethereum fund that's allowed to stake the underlying ETH.\n\n\"We've always been excited about Ethereum and what the technology and ecosystem represent,\" he said in a press release. \"Initially, a corporate structure was the best option; now we believe an ETF is the most efficient.\"\n\nThe flurry of activity around Ethereum staking and ETFs raises questions about the future of the ecosystem, too. As more institutional players wade into staking waters and the percentage of staked ETH climbs, the Ethereum community will be watching closely to see how these developments impact the network's security, decentralization, and overall health.\n\nDanny Ryan, an Ethereum Foundation researcher, shared his thoughts on staking economics at the EthStaker Staking Gathering last year. \"Staking on Ethereum is influenced by reward curves and overall economic incentives built into the protocol,\" he said. \"The goal is to create a sustainable and secure system that encourages participation and maintains the network's integrity.\"\n\nThe recent market downturn, attributed to factors such as the imminent Mt. Gox repayments and macroeconomic concerns, saw Bitcoin fall below $55,000 again on Sunday after nearly touching $54,000 on Friday—the lowest it's been since late February. This volatility underscores the complex interplay between staking trends, ETF anticipation, and broader market forces.\n\nFor now, the 24=7% staking milestone serves as a testament to the growing conviction among ETH holders that staking is the future. Whether that future includes ETFs directly, or whether it will be shaped by a new breed of staking-focused funds and companies, is still unclear. As the crypto world holds its breath for the SEC's final decision, the stage is set for a potentially transformative moment in Ethereum's history.\n\nEdited by Stacy Elliott."
    }
]