[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5QQ2RlcjBjSlhhYlRwNE9HN2oxRXU2bE5MTGVabTlwMVptS2VaaDQ4UFJxbHJLVXhvR2d0Q2RiMnJyUE5JcXN2Um1WTENrX1RxdklJZWl5VjkwTkZhaWtlR2RhVmEtRkRtdGF2OW53TXBRdDMtZHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? - Yahoo Finance",
        "content": "Former President Donald Trump has sold more than 1,000 Ether (ETH) in the past several weeks, according to blockchain analytics company Arkham Intelligence, which has been tracking his ETH holdings for the past several months. It obtained the data through Trump's financial filings and disclosures.\n\nMost of the ETH comes from royalties for non-fungible token (NFT) projects that Trump created. In December 2022, Trump released a set of 45,000 NFTs, each priced at $99. The project has amassed trading volumes of over $35 million or 15,000 ETH.\n\nThe NFTs are largely trading above their original price of $99. As of Jan. 19, the cheapest NFT is listed for over $600 and the highest sale was for 37 ETH.\n\nDon't Miss:\n\nIn early 2024, Trump announced another trading card NFT project that has some unique rewards for owners. Some of the potential perks could be dinner with the former president, or even a small piece of fabric from the suit he wore in his Georgia mugshot.\n\nHowever, Trump and his companies are not directly associated with these NFT projects. NFT International created and distributed the NFTs and uses Trump's \"name, likeness and image under paid license from CIC Digital LLC, which license may be terminated or revoked according to its terms.\"\n\nTrump sold 1,075 ETH for over $2.4 million through Coinbase.. At its peak, it was worth more than $4 million.\n\nThe sale comes after a strong month for Ethereum. The price was up more than 17% in the month leading up to the sale, 30% in the six months before and 60% over the past year.\n\nEven though Trump said during his presidency that he was \"not a fan\" of Bitcoin and that crypto is a \"disaster waiting to happen,\" it is hard to pass on several million dollars. Though Trump is largely unaffiliated with the project, he is still earning royalties. While his stance on crypto is still up in the air, the recent sale is an interesting development in Trump's relationship with crypto.\n\nAs the presidential race heats up, it will be important to watch for news relating to presidential candidates' stances on crypto, as this could have large implications for prices, future adoption and use cases going forward.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nStory continues\n\nGet the latest stock analysis from Benzinga?\n\nThis article Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5QQ2RlcjBjSlhhYlRwNE9HN2oxRXU2bE5MTGVabTlwMVptS2VaaDQ4UFJxbHJLVXhvR2d0Q2RiMnJyUE5JcXN2Um1WTENrX1RxdklJZWl5VjkwTkZhaWtlR2RhVmEtRkRtdGF2OW53TXBRdDMtZHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? - Yahoo Finance",
        "content": "Former President Donald Trump has sold more than 1,000 Ether (ETH) in the past several weeks, according to blockchain analytics company Arkham Intelligence, which has been tracking his ETH holdings for the past several months. It obtained the data through Trump's financial filings and disclosures.\n\nMost of the ETH comes from royalties for non-fungible token (NFT) projects that Trump created. In December 2022, Trump released a set of 45,000 NFTs, each priced at $99. The project has amassed trading volumes of over $35 million or 15,000 ETH.\n\nThe NFTs are largely trading above their original price of $99. As of Jan. 19, the cheapest NFT is listed for over $600 and the highest sale was for 37 ETH.\n\nDon't Miss:\n\nIn early 2024, Trump announced another trading card NFT project that has some unique rewards for owners. Some of the potential perks could be dinner with the former president, or even a small piece of fabric from the suit he wore in his Georgia mugshot.\n\nHowever, Trump and his companies are not directly associated with these NFT projects. NFT International created and distributed the NFTs and uses Trump's \"name, likeness and image under paid license from CIC Digital LLC, which license may be terminated or revoked according to its terms.\"\n\nTrump sold 1,075 ETH for over $2.4 million through Coinbase.. At its peak, it was worth more than $4 million.\n\nThe sale comes after a strong month for Ethereum. The price was up more than 17% in the month leading up to the sale, 30% in the six months before and 60% over the past year.\n\nEven though Trump said during his presidency that he was \"not a fan\" of Bitcoin and that crypto is a \"disaster waiting to happen,\" it is hard to pass on several million dollars. Though Trump is largely unaffiliated with the project, he is still earning royalties. While his stance on crypto is still up in the air, the recent sale is an interesting development in Trump's relationship with crypto.\n\nAs the presidential race heats up, it will be important to watch for news relating to presidential candidates' stances on crypto, as this could have large implications for prices, future adoption and use cases going forward.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nStory continues\n\nGet the latest stock analysis from Benzinga?\n\nThis article Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5QQ2RlcjBjSlhhYlRwNE9HN2oxRXU2bE5MTGVabTlwMVptS2VaaDQ4UFJxbHJLVXhvR2d0Q2RiMnJyUE5JcXN2Um1WTENrX1RxdklJZWl5VjkwTkZhaWtlR2RhVmEtRkRtdGF2OW53TXBRdDMtZHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? - Yahoo Finance",
        "content": "Former President Donald Trump has sold more than 1,000 Ether (ETH) in the past several weeks, according to blockchain analytics company Arkham Intelligence, which has been tracking his ETH holdings for the past several months. It obtained the data through Trump's financial filings and disclosures.\n\nMost of the ETH comes from royalties for non-fungible token (NFT) projects that Trump created. In December 2022, Trump released a set of 45,000 NFTs, each priced at $99. The project has amassed trading volumes of over $35 million or 15,000 ETH.\n\nThe NFTs are largely trading above their original price of $99. As of Jan. 19, the cheapest NFT is listed for over $600 and the highest sale was for 37 ETH.\n\nDon't Miss:\n\nIn early 2024, Trump announced another trading card NFT project that has some unique rewards for owners. Some of the potential perks could be dinner with the former president, or even a small piece of fabric from the suit he wore in his Georgia mugshot.\n\nHowever, Trump and his companies are not directly associated with these NFT projects. NFT International created and distributed the NFTs and uses Trump's \"name, likeness and image under paid license from CIC Digital LLC, which license may be terminated or revoked according to its terms.\"\n\nTrump sold 1,075 ETH for over $2.4 million through Coinbase.. At its peak, it was worth more than $4 million.\n\nThe sale comes after a strong month for Ethereum. The price was up more than 17% in the month leading up to the sale, 30% in the six months before and 60% over the past year.\n\nEven though Trump said during his presidency that he was \"not a fan\" of Bitcoin and that crypto is a \"disaster waiting to happen,\" it is hard to pass on several million dollars. Though Trump is largely unaffiliated with the project, he is still earning royalties. While his stance on crypto is still up in the air, the recent sale is an interesting development in Trump's relationship with crypto.\n\nAs the presidential race heats up, it will be important to watch for news relating to presidential candidates' stances on crypto, as this could have large implications for prices, future adoption and use cases going forward.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nStory continues\n\nGet the latest stock analysis from Benzinga?\n\nThis article Donald Trump Sold $2.4 Million Ethereum: Smart Move Or Big Mistake? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNVHBCVS1lZktCa3lpbXpXTUY1cVpIbkc2LVlmUHN3NzZXN0d6U2MtdlBDU1ctcC1zQk15ekdVcVpqUlJ1eVhsakRuTVpjLU1BMFpRUE5TWEpjbmg3aFJYR3I2LUxGOTVGalFFamlCUUxpV0p3c0tpREhzR3N3YnBZcWo2a3ZoclJIZXFDTmRQVzBzMTNjYkVDdNIBoAFBVV95cUxPR0QxVUhrTlQwYW5fUzR4ckUwS3FrTnd4UlFqQnJfclFjRnNWVHlhTVo1UDlpM28wdzZTUUUxNVpSQTc3WGZERDZORkhMVlVwbzdRMVFiN2k3RFhBb1N3Q2JjZzIySzg0b1g1SGRSUFBWdF9uUUxLOVBDU3JlVDlJdEpHYnN3NXhGTXJXMEZtSjBydkIxMGE3Q0dxLXI3dnRW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum, Solana Losses Pile Up as Bitcoin Sell-Off Sinks Crypto Market - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin (BTC) and the wider crypto market are down bad this week. But some of the biggest losers near the top of the market were once recently stars of the show, including Ethereum (ETH), Solana (SOL), and Avalanche (AVAX).\n\nIn recent weeks, all three of those top 20 cryptocurrencies were making big gains as they attracted institutional investor interest. Now, each has slipped by at least 14% over the past seven days, and have posted sizable losses on the day.\n\nEthereum is down sharply this morning, per data from CoinGecko, falling 7% over the past 24 hours to a current price of about $2,200 and pushing its seven-day dip to 14%.\n\nSolana is down almost 16% over the past seven days at a current price of $82.50. It has rebounded slightly from earlier this morning, but remains down about 5% on the day.\n\nAD\n\nAD\n\nMeanwhile AVAX, which is the 11th largest cryptocurrency, has plunged 19% on the week to a current price of just under $29. Like Solana, it has shored up some of its losses since this morning, now down about 5% over the past 24 hours.\n\nIt was just over a week ago that Ethereum came just shy of hitting $2,700, its highest price since April 2022. Excitement over Ethereum grew amid the launch of spot Bitcoin ETFs as investors considered the next wave of prospective institutional adoption, particularly as BlackRock CEO Larry Fink talked up the prospect of an Ethereum spot ETF.\n\nSOL had been on a big run starting from the end of October. It was expected to take a hit during the trial of disgraced crypto mogul Sam Bankman-Fried, who was heavily invested in the asset via his now collapsed crypto empire, FTX.\n\nBut major companies such as Visa and Shopify sung the project's praises and said they'd use its blockchain. A growing developer base also meant the price of SOL shot up. It rose as high as $123 in December 2023, nearing a two-year high after plunging to a price of about $8 in December 2022.\n\nAD\n\nAD\n\nAVAX also attracted interest when investment banking giant J.P. Morgan said in November it had used the Avalanche blockchain to tokenize portfolios.\n\nLong-term holders have reason to be optimistic, though—despite the recent dips in price, both coins over a one-year period are doing well: SOL is up 239%, while AVAX has jumped by 64%. Even Ethereum is up by 35% over the last year.\n\nThe broader crypto market has taken a nosedive as it follows the price action of the biggest digital asset by market cap, Bitcoin.\n\nSince crypto fund Grayscale converted its flagship BTC fund into an exchange-traded fund (ETF) and started trading on the stock market, investors have been keen to redeem shares previously locked into the product.\n\nThis has put pressure on the price of the biggest and oldest digital coin in recent days.\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNeW4tREZubjBNdzVKOWxIWkgtaVB2TXNuc2tjZXB2SVI2a3JCREJWU0JqS1FRTk1VSDZnaUk2WUhjLTB5QkxjQXF1anBSWkVEV2ZNU1JKUVljeFlvN2FXdHpvUkNZYUF5R29DRWltM0FaNmtRRVcwVll4bzYySUtsby1vNjJ5OGstU3ZqVGFac0duVGtoQy0tRjViYkhGc3JDeGpha21NRHl6clhLRjY5MDNsdnnSAboBQVVfeXFMTzJyRlcyRHJZTEdNcTlBd3ZmS19ZZFQ0cW9Rano5YUM0UTZybGQtLU5OQWVFdWlKUXVpX2h5WUtReDNCUmpDWkRhTXkwckk4U1YyWUlwTG8yTnB5Yi03NGhUT0tHRllYSktWQW1ER3I0dHdxQVM4UGN5LUxuRDhVSGFiaTlhVk5zYXVsVks3N0wwVlBGaXJVaUFyYWx0SWtpM3JhSHJJMVpsLU1tbHVEbC1LYmhLM09MV3d3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) In Dangerous Position, Bitcoin (BTC) About to Lose $40,000, Shiba Inu (SHIB) At Local Support - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum finds itself shaky on the edge of a precarious position. The recent price chart indicates a concerning situation: the 26-day Exponential Moving Average (EMA), a key indicator of short-term momentum, is under threat. If this level fails to hold, Ethereum could see its value dip to the $2,347 mark, a scenario that may well trigger a more pronounced decline.\n\nThis potential slip below the 26 EMA is crucial because it suggests a weakening in buying pressure and a shift in market sentiment from accumulation to potential distribution. A break below this level would not only establish $2,347 as the next price floor but could also exacerbate the asset's losses, leading to further bearish momentum.\n\nETH/USD Chart by TradingView\n\nThe Ethereum ecosystem has faced its share of challenges despite the rise of layer 2-networks, which have not catalyzed the anticipated rally. The broader market has similarly not exhibited the explosive bull run many investors had hoped for, with Ethereum’s trajectory reflecting this subdued market energy.\n\nAdditional support and resistance zones can be gleaned from the chart. On the support side, following the $2,347 level, the next critical support lies around $2,175.2 - a breach of which could see ETH test the psychological and technical support near the $2,000 level. Resistance, on the other hand, is firmly established at the recent high of $2,547.6. This price point serves as a litmus test for Ethereum’s ability to rebound and reclaim bullish momentum.\n\nAdvertisement\n\nThe current market dynamics, marked by cautious trading and a lack of definitive direction, have placed Ethereum in a zone of uncertainty. Investors are advised to monitor these levels closely, as a break below or above these could signal Ethereum's next significant move.\n\nBitcoin in trouble\n\nBitcoin finds itself at a precarious juncture as it teeters on the edge of the critical $40,000 mark. The recent price action paints a troubling picture for Bitcoin enthusiasts, with the asset losing its grip on the 50-day Exponential Moving Average, a key support level that has historically indicated bullish sentiment.\n\nAs Bitcoin's price struggles to maintain the $40,000 level, the next potential foothold lies at the 100-day EMA. However, this level does not traditionally offer substantial support, and a breach below could precipitate a fall below $39,000, triggering heightened market concern. The chart reveals that the next major support zone stands near the $35,888 mark, a level that buyers might attempt to defend vigorously.\n\nOn the resistance front, Bitcoin faces a significant challenge at the $42,786 price level. Overcoming this resistance is crucial for Bitcoin to regain stability and demonstrate potential for a recovery. However, the market currently lacks the necessary liquidity to facilitate a strong rebound, as trading volumes remain relatively low.\n\nShiba Inu gets hit\n\nThe token is currently trading at a local support level, which is a make-or-break situation for its short-term future. A breakdown below this point could spell trouble, signaling a potential decline and testing the resilience of its investor base.\n\nThe current market landscape for SHIB is challenging, with a noticeable lack of growth catalysts and low liquidity in the broader cryptocurrency market, both of which could exacerbate the asset's precarious position.\n\nHowever, there is a glimmer of hope. The descending trading volume accompanying SHIB's price consolidation suggests that bearish momentum could be waning. This deceleration of selling pressure often precedes a stabilization of price, or even a reversal if bulls regain control.\n\nIn terms of specific price levels, SHIB is currently finding tentative support around the $0.000027 mark. Should this level fail to hold, the next support zone lies near $0.000022, which may serve as a new accumulation point for buyers. On the resistance side, SHIB faces a hurdle at $0.000035, a breach of which could open the door to a retest of higher levels, possibly around the $0.000040 range."
    }
]