[
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOVGRXc3BMR2t5WTdXX2ZjX3ZseHppdTg2UFZCbW53RjZkcVRjeVppVEh6UTFrNVE1UGVlZ1NiNGZBdzUxbnhYQzdmVTY1SVZ4OWVOUUZBcUhERFM1X0JHRjZfZTNxMkFXTERlSVRPNF8zZ0ZTMnB4QXVDcFpqcXdkODhReXPSAYwBQVVfeXFMTk8zMUxGQVMtQWJKYy1RNlVVa2VHZmpCTzVndXVvQldraWRnWkN3NGhnQlY4bE5jNmRCV1hQekM4ejh5eEFDY1RaRUpmeWJ1aFpNb0NBQ1RxUnpuNGN2V0FGdndfTlk3MGdEQ3FIVHFTczNPNUJQN1Y0WlBObU9EQW82WmtHM3ZaX3hDOWs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Wobble Heading Into the Weekend - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum have shown some volatility in the past 24 hours, both trading 1% lower than they were this time yesterday.\n\nThe Bitcoin price has been hovering around $70,000 after looking like it might rise above $71,000 yesterday evening. It's now 0.9% lower than it was this time Thursday. Ethereum has also seen its own dip, currently trading at $3,557, marking a 1% decrease.\n\nOn the flip side, Binance Coin (BNB) has experienced a notable increase and is trading for almost $614. That's a 4.6% increase since yesterday and 7.7% higher than it was last week.\n\nThere's no telling how much the two are linked, but BNB is rising just as there are signs the crypto exchange and its executives are finding ways to fight back against allegations leveled at it from the Nigerian government.\n\nAD\n\nAD\n\nAccording to a local news outlet, Binance executive Tigran Gambaryan has asked the Federal High Court in Abuja to compel the Office of the National Security Advisor (NSA) and the Economic and Financial Crimes Commission (EFCC) to apologize to him over his detention in the country. He's also filed a lawsuit alleging his fundamental human rights have been violated.\n\nFor nearly a month, Nigerian government officials had detained Gambaryan alongside another Binance executive, Nadeem Anjarwalla—who managed to escape custody earlier this week.\n\nMeme-while, popular Solana meme coin Dogwifhat (WIF) has climbed another 17% since Thursday morning. It was only yesterday that WIF managed to flip PepeCoin (PEPE). Its $3.6 billion market capitalization makes it the 41st overall largest cryptocurrency. And in the meme category, it's now also much larger than Ethereum meme coin Floki Inu (FLOKI) and its Solana competitor Bonk (BONK).\n\nAnother top gainer in the last 24 hours has been the native token for the Celestia network, TIA. Celestia, a Layer-1 network, has recently gained some buzz for being a serious Ethereum competitor. Since yesterday, the TIA price has gained 9.2% and is currently trading for $15.15.\n\nAD\n\nAD"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPRGt3UDhMbXhYSDlYdzVnUDloOEVVSVMtMDJwVHpvZHZ3dFBtWkFtd21ZemRHS1FzMVdXcE5fc2JxMERHeW1aaFdvWG9uczFWSENOY1VUakJVWWlQazFnancyZ3lTZUFKVmY4MS1Cb1E1akxGdHdiUUFXUmd5V1JDNW5Ud25rTHJUMlhCMTJPUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin & Ethereum Have $15B Worth of Options That Expire Today - Watcher Guru",
        "content": "A development that could bring upward volatility to the assets market, both Bitcoin (BTC) and Ethereum (ETH) have $15 billion worth of options that are set to expire on Friday, March 29th. Indeed, options exchange Deribit is set to sell Bitcoin options worth $9.5 billion. Alternatively, they will also settle Ether options worth $5.7 billion.\n\nThe expiry of BTC and ETH options that take place quarterly could be set to infuse the market with bullish price movement, according to experts. Moreover, those options are officially set to expire at 08:00 UTC.\n\nJUST IN: $15,100,000,000 worth of #Bitcoin & Ethereum options expire today. March 29, 2024\n\nAlso Read: Cryptocurrency: 3 Coins That Could Hit ATH After Bitcoin Halving\n\n$15 Billion in BTC & ETH Options to Expire\n\nThe digital asset market has been one of the most interesting in the financial sector thus far in 2024. Bitcoin has seen its price skyrocket amid the approval of Spot ETFs in January. Ultimately, the asset reached an all-time high of $73,000 this month.\n\nOn the other hand, Ethereum has been front and center as the next likely asset to receive Spot ETF approval in the United States. However, it is also the subject of a reported legal campaign by the US Securities and Exchanges Commission (SEC) as it seeks to dispute the asset security status.\n\nAlso Read: Fidelity Files for Spot Ethereum ETF With Staking\n\nThose developments further solidify the two assets as leaders in the sector. Now, they will be facing another interesting reality, as both Bitcoin and Ethereum have $15 billion in options expiring today.\n\nSpecifically, the leading cryptocurrency options exchange on the planet, Deribit, notes the quarterly settlement of options contracts. For Bitcoin, it will see $9.5 billion expire. That figure is also 62% of total open interest. The rest is constituted by Ethereum, which will see $5.7 billion worth of options contracts expire.\n\nSpeaking to Coindesk, Luuk Strijers, chief commercial officer of Deribit, discussed the options. specifically, he noted that most of the options will expire in the money. Subseuqnlety, there could be renewed upward pressure that is distributed into the market."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQbldfVWlmb3J3OFJuckVuLVEwYjNDa29FYXM0S0dqN0hUeFZLNzZEWjJNUl9IN0pqbTY5SWVrMm5PWHpTUF9XQVlQWVRmd0N2TDJIN1E0OEx2bjJmcEdrMjJMMjUxdWxOTWNrOG8yZkg4N01wcGRlemdRakk5d2dIWlU3RG0wa3Z4UTBxbXBBYW04MDB0alFhZkxqRdIBoAFBVV95cUxORjJqT0tGRXdDdVhoYkY5NmdCR19aeC1pUlZULVgzZEhmQi1BdFRNd2hMVllhbC01NmlEWWNtdTVTTGFleXBfTWZfRHFtcXp4OHgyZXNBcUt0cC1zOGhTUWdkY0d2dndHSkJyWDJISndtbmpjNmNZbV8yb3llVU1QS0VlMGhyQXFIYy0yc3ZZeFlWcUNUUUNXZzJNUkJOc0Fk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Founder Thinks Meme Coins Can Be More Than Fun, Simple Tokens - CryptoPotato",
        "content": "Vitalik Buterin, the co-founder of the Ethereum network, believes meme coins can become higher quality projects that contribute positively to the crypto ecosystem and the world around them, squashing the narrative that such tokens are useless, racist, and sexist.\n\nAccording to a new report titled “What Else Could Meme Coins Be?,” Buterin looks forward to seeing meme coin projects that support public goods instead of enriching insiders and creators. He urged creators to make games instead of just tokens.\n\nMeme Coins Can Be More\n\nThe Ethereum founder cited a report he wrote ten years ago and published on Bitcoin Magazine, which addressed the role cryptocurrencies could play in funding important public projects like cancer research and saving the environment. He explained at the time that society needed new ways to fund valuable large-scale projects other than markets and institutions, and issuing new coins could fill in the gaps.\n\nPeople who wanted to support cancer research could hold and trade AntiCancerCoin, while those passionate about saving the environment could use ClimateCoin. These assets would determine which projects get funded, creating long-lasting and positive tokens that are different from what meme coins have become today.\n\nButerin explained that people participate in meme coin projects because they feel they are democratic and open for anyone, they are fun, and the value of the tokens may increase. He suggested that the crypto community could use a large percentage of a meme coin’s supply to support valuable public causes, but that could happen at the expense of the token’s worth and democracy.\n\nSo, the remedy would be to create gaming projects that are democratic, meaningful, fun, and have the tendency to rise in value.\n\n“Don’t just make a coin, make a game. But make an actually meaningful and fun game. Don’t think Candy Crush on the blockchain; think World of Warcraft on the blockchain,” the Ethereum founder stated.\n\nCreating Interesting Games\n\nFurthermore, the computer programmer insisted that if the goal of creating meme coins and related games is to satisfy people’s desire to have fun, then developers should stop making simple copy-and-paste coins. He urged owners of these projects to make the games more complicated and interesting.\n\nUsing blockchain gaming platform Axie Infinity as an example, Buterin commended how well the entity had improved the quality of its projects since its boom in 2021."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNTlFNaUpMYTByUXEyaHZVOXg1WmFoRDVxWmhXRTdjYmJXMnJHbFZqOFdCM0dUdG9ZN3dZTkJ6UTdQVl80X3A2WEVBUmoydGdWaW5NbzBmWlM5Y3NMYzNzYlhzMEVxLWI1XzhpUHR0NW5wTmJ4UUVILVl6dE9hR2dUZjk4UWVfdmhJX1U0bWRR0gGWAUFVX3lxTE5WQWxUeEF3X3ppWW9ZRnJacTlWRUxvcEdkS2Zfc0U2MzJITkptbjV5UWpHUXNudEVaOWw5RVItT0xzSThZOWVVTkFLNkQweEVwejR4ejh5TzFsa2FoeERBQ0xLbUR3dlh3MjFkTDJUalFyWFRWclVqeVBqeldZQkNzTG0yNlJuT1E3UTI5Yy1yLURJWTRNZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Mar 2024 07:00:00 GMT",
        "title": "Litecoin Price Spikes After CFTC Calls It Commodity Alongside Bitcoin and Ethereum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMeme coin lovers may be having a great month, but Litecoin (LTC) hodlers are celebrating today with their coin taking the spot as the second best-performing cryptocurrency in the top 100, with a bullish performance in the last 24 hours that saw its price spike nearly 11%.\n\nThis comes on the fifth day of relatively slow markets, with Bitcoin and Ethereum correcting by less than 2% in the same period. The global cryptocurrency market cap today sits at $2.79 trillion, marking a mere -0.1% change in the last 24 hours.\n\nThe most significant non-technical event contributing to Litecoin's spike is a recent statement by the United States Commodity Futures Trading Commission (CFTC). In a lawsuit against crypto exchange KuCoin, the CFTC declared Litecoin a commodity. This statement is crucial as it places Litecoin outside the scope of the Securities and Exchange Commission (SEC), which regulates securities and imposes stricter responsibilities on coin issuers.\n\n“KuCoin solicited and accepted orders, accepted property to margin, and operated a facility for the trading of futures, swaps, and leveraged, margined, or financed retail transactions involving digital assets that are commodities including Bitcoin (BTC), Ether (ETH), and Litecoin (LTC),” the complaint reads.\n\nAD\n\nAD\n\nBeing declared a commodity potentially opens the door for more comfortable endorsements and further integrations for Litecoin, with less fear of the SEC attempting enforcement actions.\n\nLitecoin started the day at $94.80 and traded sideways until 6am UTC, when bulls took over the markets and spiked the coin to its daily high of $106 before correcting slightly to its current mark of $104.99. The coin is up 11.56% in the last 24 hours and 21.71% in the last week, plus 27.5% in the last 30 days. Friday marks the second best performing day of the year for LTC, only behind an 18.7% spike on March 11.\n\nOn the technical side, Litecoin was trading sideways during January and February, bouncing in a horizontal channel between $63 and $77. The coin broke its channel on February 29 and started a bullish trend on March 1. Most of the positive performance registered in 2024 has been due to March's positive results. Since the bottom of the channel to today's high, there has been a roughly 63% spike.\n\nImage: Tradingview\n\nPast data shows that many of the unusually large candlesticks are followed by a correction of many small-bodied candlesticks in the days after. Litecoin failed to break past the resistance set by March 11's spike, which could point to a possible cup-and-handle pattern: A big spike followed by a symmetrical period of a correction, and a recovery that cancels all the losses almost in a semi-circle shape. If this is the case, there should be a smaller correction followed by a similar recovery before a bullish breakout.\n\nAD\n\nAD\n\nOverall, the coin looks bullish and healthy in a longer timeframe. The Relative Strength Index (RSI) shows that the coin is slightly overbought with a 66% dominance of bulls over bears, with Litecoin proving its bullishness after bouncing from its Exponential Moving Average (EMA) 55 and going back again to trade on top of the EMA 10.\n\nImage: Tradingview\n\nGiven that the coin is bullish in charts set at 24 hour candlesticks and in weekly candlesticks for the first time since June of 2023, an immediate resistance could be around $115 for a 10% gain. If it remains strongly bullish, the next one appears to be near $135 for a nearly 29% gain. However, if it fails to meet expectations and corrects down, it could drop somewhere near the $80 price line for a -22.5% loss.\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOY2tRdzFvbWE1WEpPbjRxdlk1cFdxQlZVdzFUQndNdGZka2hjb25zZ3ViS2tsd3ZjdDVRUkNSeWp0WTlVcXRzeHBFcTdVZlZvWkxrWjItRDZtbXAxQkp5UWhOd3ZiaFlobGZySW5PY0ZaU3ZqR2hyS2RmcFZuTWJNNTNlTGswSUdObG1PaUZNVFlkbE5qa3ZndTAtYktHQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Mar 2024 07:00:00 GMT",
        "title": "Put memecoins to good use, says Ethereum co-founder Vitalik Buterin — and he has examples - DLNews",
        "content": "Despite having little to no purpose, some memecoins have valuations in the billions.\n\nEthereum founder Vitalik Buterin suggested tying them to charity or finding other ways to tap taders' desire for fun and profit.\n\nEvery day, crypto traders swap billions of dollars of memecoins — defiantly useless tokens with tickers that often point to internet memes like Pepe the Frog.\n\nEthereum co-founder Vitalik Buterin thinks there’s a better way.\n\nMemecoin creators should set aside a large chunk of tokens for charitable causes — or, better yet, create crypto-based video games designed to help low-income players, he said on his blog Friday.\n\n“I have zero enthusiasm for coins named after totalitarian political movements, scams, rugpulls or anything that feels exciting in month N but leaves everyone upset in month N+1,” he wrote, referencing a rash of offensive memecoins on the Solana blockchain.\n\n“At the same time, I value people’s desire to have fun, and I would rather the crypto space somehow swim with this current rather than against it.”\n\nMemecoin mania\n\nDogecoin is the original meme coin. It was made as a joke in 2015, poking fun at the speculative frenzy that often overtook the crypto economy.\n\nIt was not meant to be digital cash or digital gold, a la bitcoin. It did not represent governance rights in a digital cooperative, like Arbitrum’s ARB. It had no built-in yield, no peg to some other stable asset.\n\nBut Dogecoin’s market capitalisation surged to more than $88 billion during the 2021 bull market. And paved the way for other similarly silly, useless tokens.\n\nJoin the community to get our latest stories and updates\n\nLast year, PEPE took Ethereum by storm. This year, Dogwifhat surged on Solana. Both now have market capitalizations above $3 billion.\n\nMost have no intrinsic value, and their values are determined entirely by hype and an investors’ gain (or loss) by the timing of his or her exit.\n\nMemecoins have accounted for roughly 5% of Ethereum transaction fees over the past month, according to data gathered by data analyst James Tolan.\n\nAnd they have made up a similar percent of trade volume on Ethereum’s decentralised exchanges, according to SixDegree Lab.\n\nOn Thursday, meme coin trade volume topped $113 million on Ethereum.\n\nPositive-sum tokens\n\n“If people value having fun, and financialized games seem to at least sometimes provide that, then could there be a more positive-sum version of this whole concept?” Buterin said.\n\nHis first idea is rather straightforward: some percent of a newly-issued memecoin, or the transaction fees it generates, should be set aside for charity.\n\nAccording to Buterin, the most successful example of this might be Dogelon Mars, an Elon Musk-themed token.\n\nIn 2021, he transferred $145 million worth of Dogelon to the Methuselah Foundation, a space travel and anti-aging nonprofit dedicated to “making 90 the new 50,” according to its website.\n\nIt was 43% of Dogelon’s circulating supply, spurring panic among other investors, who feared a fire sale that would destroy the token’s value. But the nonprofit promised to be a good steward of the token.\n\n“We will take the same nurturing approach with our Dogelon Mars holdings because we understand that the cryptocurrency’s value depends on maintaining the public’s confidence and capturing its imagination, much like baseball cards or other collectibles,” David Gobel, the foundation’s co-founder and CEO said in a statement at the time.\n\n“We want the $ELON to keep accruing value over the long term.”\n\nLater that year, Dogelon holders voted to fund a Methuselah-led experiment.\n\n“The community has donated funds to send prize-winning vascular tissue science to the International Space Station (ISS), where experiments can continue beyond Earth’s gravity,” the nonprofit said on its blog.\n\n“The ability to grow human organs will be important for crews who will eventually be involved in deep-space travel.”\n\nWhile the token’s value has cratered since the heady days of 2021, Vitalik believes the foundation has made good on its promise.\n\n“The two Methuselah Foundation and the Dogelon Mars community seemed to develop a positive-sum relationship with each other, retroactively converting $ELON into a charity coin,” Buterin said.\n\nOther charity-related coins have been less successful.\n\nGiveWell Inu — named after a Shiba Inu, like most dog-themed memecoins — donated its proceeds to GiveWell, Buterin noted. But it’s borderline defunct, with only one or two transfers a day, on average.\n\nVideogames\n\nButerin is more optimistic about the impact of crypto-based video games.\n\nWhile some have criticised the so-called play-to-earn model employed by crypto-based games such as Axie Infinity, Buterin hopes to see “Robin Hood games” — new crypto-based games designed to benefit low-income players.\n\n“If the goal is to satisfy people’s desire to have fun, we should be making not simple copy-paste coins but rather more complicated and interesting games,” he wrote.\n\nMoreover, “games that leave lower-income players in particular economically better off are more likely to leave their communities better than they came in.”\n\nAleks Gilbert is DL News’ New York-based DeFi correspondent. You can reach him at aleks@dlnews.com."
    }
]