[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOQzFaMEpQN0NVUnRXQTIyTVZHX0xnX0JiM3c0bWlOa0dmUlRBRlB5Vlo4MlhGcHN4QmFPR1pNVU1fbkxqOXFWTDFkZDVOd2NOeUxUTFRJR3F6ZERoeGRKVHZZNy1ZLUhlcFU0bkJRZHFnY01Qd3Y4Rl9xMEo4NUdCemNoeW9wRFhm0gGQAUFVX3lxTE5McVdYOU1oaVc1ZjBTY2NnWmhIMWNFUzRialZyRFFZWGFHbV92S08yazk2MkJ5d0czYmdLODU0MlhmWThpb0JGWXBId1FqakU2QnNWeGlRajhxZTJjWW5LZ0pUTHlzeVBuSVRqT1dsOVRfUno5N1JvTHBPUkdSQkljZ1FGMmktSko2S0p6YUdmdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Gains on Bullish Sentiment and Institutional Interest - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum (ETH) is making waves yet again.\n\nOver the past 24 hours, ETH has climbed 3%, pushing its price from $3,077 to a high of $3,287, before settling at its current $3,258. This is a price point not seen since April 10, 2022, marking a significant milestone in Ethereum's ongoing journey.\n\nThe last seven days have also been quite profitable for ETH bulls. Starting the week at $2,968, it maintained a steady sideways trade for the first four days before spiking in the last three, resulting in a robust 9.9% gain.\n\nThe technical indicators are painting a vivid picture of a strongly bullish market.\n\nAD\n\nAD\n\nThe relative strength index (RSI) is currently at 82, indicating that ETH is extremely overbought. The RSI refers to the split between traders looking to buy and those looking to sell an asset. So that means 82 out of 100 traders are buying ETH.\n\nThe gap between the exponential moving average of the last 10 days (EMA10) and the average of the last 55 days, (EMA55) is widening. This means that in the short term, ETH is experiencing faster upward movement compared to its longer-term average, which is why it’s considered a strong bullish sign.\n\nHowever, swing traders may want to brace for a short correction, which could bring ETH's price closer to the EMA 10, currently around the $3,050 mark. The price of Ethereum has been bouncing over this line as support since the beginning of the month.\n\nImage: Tradingview\n\nEthereum's bullish trend is simply a reflection of a broader bullish sentiment across the wider crypto market, with only five coins out of the top 100 experiencing a dip in the last 24 hours. The whole space has grown $155 billion in the last 24 hours alone.\n\nAD\n\nAD\n\nBy some measures, institutional investors could playing a significant role in this bullish trend. A new report from ByBit reveals a growing interest in Ethereum over Bitcoin among its institutional clients. The exchange compared institutional portfolio allocations of its clients from September 2023 through the end of January 2024.\n\n\"Since our last report, we have observed remarkable changes in portfolio allocation for institutions,\" the report states. \"Their portfolio has become more concentrated than ever, with a total of 80% of assets to Bitcoin and Ethereumeum, where institutions allocate 30% of total assets originally in stablecoin to Bitcoin and Ethereumeum.\"\n\nInterestingly, the world’s largest altcoin has been capturing the most attention, even though Bitcoin has gained a lot of steam in Wall Street.\n\n\"It is very interesting that Ethereum has become the institution’s new favorite,\" the report notes. \"The updated data suggests that they have shifted assets from Bitcoin and stablecoins to Ethereum.\" Right now, the average crypto portfolio of an institution has 40% BTC and 40% ETH, ByBit wrote.\n\nIt’s not hard to see why institutions have started favoring ETH over BTC. \"The outperformance of Ethereumeum in the past 30 days echoes the timing of this tactical shift by institutions,\" the report adds.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE1vNmZtT0hqbUtNQk9lRG5CRW9fM0tRdEFsZDNpWVhYLVR2M0EySzJaZEt4WWthamwybzBReW9GWEkxZTNuUm5ROHRZYUw2TUJxdk4yVU5Fc3kyeFBLSHo5QjY0OXk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Is Ether Heading for $3,500? - Unchained",
        "content": "The price of ETH passed above $3,000 last week for the first time since April 2022. What’s the next milestone for the world’s second-largest digital asset?\n\nThe price of ETH is important to the future of the blockchain itself.\n\nLast week, the price of Ethereum’s native token ether (ETH) went above $3,000 for the first time since April 2022. The token continued to wobble around that mark before breaking through, standing at nearly $3,260 on Tuesday. What’s the next price milestone for the world’s second-largest digital asset by market cap?\n\nStablecoins as a Bullish Indicator\n\nOne way to predict the new capital inflows into ETH is through stablecoin issuance, Patrick Doyle, blockchain researcher at crypto analytics firm Amberdata, told Unchained in an email. Doyle noted that roughly $3.5 billion in new Ethereum-based stablecoins, led by USDT and USDC, have been issued on Ethereum since the beginning of 2024. The growth from the $67 billion worth of stablecoins in January to the current $70.5 billion marks a 5% year-to-date growth.\n\n“New stablecoins being issued onchain is a bullish indicator for all assets in the crypto space. Confidence in the crypto space is slowly being restored,” he explained. “Traders and investors are starting to bring capital back onchain which means they plan to deploy/invest that capital in a number of crypto assets.”\n\nRead More: Why Has Bitcoin Rallied More Than Ether in 2023?\n\n“With conversations of an ETH ETF in the works, it wouldn’t be unlikely to see ETH run past $3,500 leading into Q2,” Doyle continued.\n\nEight firms have filed applications for spot Ethereum exchange-traded funds (ETFs) with the U.S. Securities and Exchange Commission. The regulator approved the first spot bitcoin ETFs in January, which topped $625 million in inflows just on the first day of trading. The trading success of those ETFs helped push the price of bitcoin higher. BTC briefly passed the $57,000 mark on Tuesday, the highest level in two years, according to CoinMarketCap data.\n\n‘ETH as a Store of Value Is Essential for Proof of Stake’\n\nA price premium for ETH has more implications than just providing profits for traders. The price is important to the future of the blockchain itself, Alejo Pinto, co-founder and chief growth officer at Web3 product development studio Pontem, told Unchained in an email.\n\n“The monetary premium for ETH as a store of value is essential for proof of stake to work fundamentally,” said Pinto, referring to the consensus method that Ethereum shifted to in Sept. 2022. “Bitcoin is secured by physics, Ethereum is only secured by our collective belief that Ethereum is worth protecting. If ETH is worthless then there is nothing at stake.”\n\nSupply and demand dynamics are also at play following the blockchain’s EIP 1559 upgrade in 2021 that changed how network fees are calculated and processed.\n\n“The narrative for ETH as a store of value through supply/demand dynamics is strong. After EIP 1559, gas from using the chain gets burned, which creates a deflationary mechanism for the token. This could prove even more powerful than BTC’s fixed supply long term,” Pinto continued.\n\nBitcoin has a hard cap of 21 million BTC that can ever be created, creating a fixed supply. The deflationary mechanism for Ethereum is another way to achieve scarcity, reducing supply and potentially driving up the token’s value over time.\n\nRead more: Spot Ether ETFs Could Introduce New Concentration Risk in Ethereum: S&P Global"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOQjhGWGFFRU92YlVOdkFGdm1VWUNfVFZYSWhVeWNPTTZtQzlDSzVQTjBUTzhndUtMZ1p1UUVKMXdiR29ZLTNwaHZjRFk0T2pxTG1tRklVTnJyNjJzbWY1d0RQN1lHUEhFSnFmRGU3U3dveE56QndhMFM5MzhSdXlDa3Bsbmk4ejdoZ09EWk1pLTlLbzFN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Rallied on Tuesday - The Motley Fool",
        "content": "Major cryptocurrencies jumped amid speculation for another extended rally ahead of the first Ether ETFs.\n\nSeveral major cryptocurrencies rallied on Tuesday amid news of growing crypto adoption and speculation surrounding the timing of the first spot Ethereum-centric exchange-traded fund (ETF) approvals.\n\nWhen all was said and done during today's regular trading session, the price of Bitcoin (BTC -0.09%) was up 4.5%, Ethereum (ETH -0.78%) had gained 1.8%, and Dogecoin (DOGE 3.96%) climbed 12.2%.\n\nWith Bitcoin ETFs approved, are Ether ETFs next?\n\nThe price of Bitcoin climbed above $57,000 today for the first time since December 2021, apparently bolstered by record inflows into Bitcoin ETFs. Around $2.5 billion flowed into digital asset investment products last week, according to data from crypto research firm CoinShares, with Bitcoin funds responsible for 99% of those inflows. That influx of capital followed a historic decision last month by the United States Securities and Exchange Commission (SEC) to simultaneously approve the first 13 applications for spot Bitcoin ETFs.\n\nThose approvals, of course, were the culmination of months of speculation after the SEC declined to appeal a federal court's ruling in August that prevented crypto-asset manager Grayscale Investments from converting its popular Grayscale Bitcoin Trust into an ETF. That inaction put the onus back on the SEC to move forward with its Bitcoin ETF approval process.\n\nFor several weeks leading up to the SEC's multiple thumbs up, many opportunistic traders capitalized on a broad crypto rally while noting that ETFs are a much more accessible medium for investors hoping to put their money to work in cryptocurrencies. ETFs can be bought and sold throughout the normal trading day through nearly any online brokerage, in contrast to the previous need for investors to set up separate crypto accounts or wallets with a crypto-specific broker. The approvals also stand tall as a de facto vote of confidence from a government agency in crypto ETFs as a legitimate investment medium.\n\nStill, it's worth noting that after a multi-month rally that began in October, major cryptocurrencies initially pulled back following the official launch of the first spot Bitcoin ETFs six weeks ago.\n\nAccording to data analytics firm CryptoQuant, however, the capital influx stemming from spot crypto ETFs -- including a potential Ether ETF next -- has the potential to increase the overall cryptocurrency market capitalization by a total of more than $1 trillion over the long term.\n\nTo that end, crypto traders have now turned their eyes toward the date of May 23, 2024 -- which is the final deadline for the SEC to approve (or deny) spot Ether ETF applications from multiple investment management companies including VanEck and Ark's 21Shares.\n\nWhat's next for crypto investors?\n\nThere are no guarantees, of course, that spot Ether ETFs will be approved in May. But given the similarity of the assets and the precedent set by the dozens of now-live Bitcoin ETFs, the likelihood of an SEC denial seems extraordinarily low with the proverbial crypto ETF floodgates already opened.\n\nBut with the May 23 deadline now less than three months away, analysts at both Bloomberg and Standard Chartered have mused in recent weeks that anticipation of the first Ether ETFs could spark a similar extended rally to what we saw leading up to the first Bitcoin ETF approvals. Considering the Bitcoin ETF hype cycle appeared to spark its own rally around three months prior to those approvals, it's no surprise we're now seeing increased speculation surrounding the potential Ether ETF approval timeline.\n\n\"The Ether spot [ETF] is tied to the hip of Bitcoin spot for sure,\" mused Bloomberg ETF analyst Eric Balchunas last month. \"It's gonna go wherever it goes -- it's basically like on a 15-foot rope following it.\"\n\nIn the end, keep in mind these hype-based gains could be fickle over the short term. But there's obviously multiple billions of very real dollars each week flowing into crypto assets as the world steadily appears to be accepting it as a valid place to park capital. If that keeps happening, it will be no surprise to see the prices of major cryptocurrencies continue to rise accordingly."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOTEJRdHVJOVFOcERpQzVHSmFfSk1za0hvY2JTajlPSjRLYWVxNTZYOHRIU2x4dWV4Q3BPalBoYmE2RVBHSHNyckNsUW5qV21jN05EZ3dEOXZxRFJZYmhyWGkwLWlEQ1Q5bWtmNXV4U2UzdGxEeVctN3B4NGJ5T0FUNkxxSWRaZ0dEU2F0b3BDSExfN2ZJa0RhdjVKcDF0Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "4 Crypto Stocks to Watch in the 2024 Ethereum Institutional Rally - Nasdaq",
        "content": "The second-largest cryptocurrency in the world, Ethereum (ETH), has started 2024 on a great note. While Bitcoin (BTC), too, has been fast off the blocks, rising 20% year to date, ETH has risen 33%. Ethereum, which trails only Bitcoin in the crypto world, is known for its uses as a blockchain-powered, open-ended decentralized software platform.\n\nThe network has, over the past year, completed the Shanghai Upgrade. The upgrade has ensured that it shifts its blockchain validation system from proof-of-work to proof-of-stake. Under the proof-of-stake system, miners of Ethereum will rely on Ether holders who will act as validators, thus lending more assurance to the system. In essence, proof-of-stake allows holders of Ether to lock up their funds as collateral to validate transactions and create new blocks, reducing the need for extensive computation and energy consumption.\n\nThis has led to far stricter trading, and ETH supply has remained stagnant as a result. Also, the amount of Ether locked up has risen significantly, with ETH held on exchanges at an all-time low of 11%.\n\nHowever, per Bybit Research, the biggest boost has come from the new institutional investments. Institutions are over-allocating their portfolio to ETH compared to BTC. This is in contrast to the retail crypto market, where investors lean on Bitcoin.\n\nMajor players like Franklin Templeton and Fidelity, which already had Bitcoin ETFs approved by the Securities and Exchange Commission, are among firms that have submitted applications for an ether ETF. In fact, demand has gone up over the past few weeks, with market participants expecting a probable ether spot ETF approval by May of this year. ETH is currently trading above $3200, and the next earmarked resistance level is $3500.\n\nSo, with Ethereum already starting to make good of the state of the market, it might be prudent to keep a watch on stocks exposed to this open-source, decentralized blockchain platform. Here is a selection. These currently carry a Zacks Rank #1 (Strong Buy), #2 (Buy) or #3 (Hold). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nAccenture plc ACN: This global system integrator provides consulting, technology and other services markets Ethereum-based blockchain solutions to businesses to make it easier to process payments.\n\nAccenture’s expected earnings growth rate for the current year is 4.7%. The Zacks Consensus Estimate for its current-year earnings has improved 0.1% over the past 60 days. Accenture currently carries a Zacks Rank #3.\n\nCME Group Inc. CME: This company operates as one of the world's largest futures exchanges and offers a wide range of derivatives contracts and various solutions to invest in cryptocurrencies like Ethereum.\n\nCME Group’s expected earnings growth rate for the current year is 2.8%. The Zacks Consensus Estimate for its current-year earnings has improved 1.5 % over the past 60 days. CME Group currently carries a Zacks Rank #3.\n\nHIVE Digital Technologies Ltd. HIVE: This cryptocurrency mining company that operates in Canada, Sweden and Iceland, engages in the mining and sale of digital currencies, including Ethereum Classic.\n\nHIVE’s expected earnings growth rate for the current year is 66.5%. The Zacks Consensus Estimate for its current-year earnings has improved 11.9% over the past 60 days. HIVE currently carries a Zacks Rank #3.\n\nBlackRock, Inc. BLK: This publicly owned company, which is one of the world’s largest investment managers andwas one of the first companies from the traditional market to join the Bitcoin ETF race back in June 2023 and got it approved this January, has already entered the ETH fray by applying for spot ETF.\n\nBlackRock’s expected earnings growth rate for the current year is 4.9%. The Zacks Consensus Estimate for its current-year earnings has improved 5.2% over the past 60 days. BlackRock currently carries a Zacks Rank #2.\n\nJust Released: Zacks Top 10 Stocks for 2024\n\nHurry – you can still get in early on our 10 top tickers for 2024. Hand-picked by Zacks Director of Research, Sheraz Mian, this portfolio has been stunningly and consistently successful. From inception in 2012 through November, 2023, the Zacks Top 10 Stocks gained +974.1%, nearly TRIPLING the S&P 500’s +340.1%. Sheraz has combed through 4,400 companies covered by the Zacks Rank and handpicked the best 10 to buy and hold in 2024. You can still be among the first to see these just-released stocks with enormous potential.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nAccenture PLC (ACN) : Free Stock Analysis Report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nHIVE Digital Technologies Ltd. (HIVE) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOTEJRdHVJOVFOcERpQzVHSmFfSk1za0hvY2JTajlPSjRLYWVxNTZYOHRIU2x4dWV4Q3BPalBoYmE2RVBHSHNyckNsUW5qV21jN05EZ3dEOXZxRFJZYmhyWGkwLWlEQ1Q5bWtmNXV4U2UzdGxEeVctN3B4NGJ5T0FUNkxxSWRaZ0dEU2F0b3BDSExfN2ZJa0RhdjVKcDF0Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "4 Crypto Stocks to Watch in the 2024 Ethereum Institutional Rally - Nasdaq",
        "content": "The second-largest cryptocurrency in the world, Ethereum (ETH), has started 2024 on a great note. While Bitcoin (BTC), too, has been fast off the blocks, rising 20% year to date, ETH has risen 33%. Ethereum, which trails only Bitcoin in the crypto world, is known for its uses as a blockchain-powered, open-ended decentralized software platform.\n\nThe network has, over the past year, completed the Shanghai Upgrade. The upgrade has ensured that it shifts its blockchain validation system from proof-of-work to proof-of-stake. Under the proof-of-stake system, miners of Ethereum will rely on Ether holders who will act as validators, thus lending more assurance to the system. In essence, proof-of-stake allows holders of Ether to lock up their funds as collateral to validate transactions and create new blocks, reducing the need for extensive computation and energy consumption.\n\nThis has led to far stricter trading, and ETH supply has remained stagnant as a result. Also, the amount of Ether locked up has risen significantly, with ETH held on exchanges at an all-time low of 11%.\n\nHowever, per Bybit Research, the biggest boost has come from the new institutional investments. Institutions are over-allocating their portfolio to ETH compared to BTC. This is in contrast to the retail crypto market, where investors lean on Bitcoin.\n\nMajor players like Franklin Templeton and Fidelity, which already had Bitcoin ETFs approved by the Securities and Exchange Commission, are among firms that have submitted applications for an ether ETF. In fact, demand has gone up over the past few weeks, with market participants expecting a probable ether spot ETF approval by May of this year. ETH is currently trading above $3200, and the next earmarked resistance level is $3500.\n\nSo, with Ethereum already starting to make good of the state of the market, it might be prudent to keep a watch on stocks exposed to this open-source, decentralized blockchain platform. Here is a selection. These currently carry a Zacks Rank #1 (Strong Buy), #2 (Buy) or #3 (Hold). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nAccenture plc ACN: This global system integrator provides consulting, technology and other services markets Ethereum-based blockchain solutions to businesses to make it easier to process payments.\n\nAccenture’s expected earnings growth rate for the current year is 4.7%. The Zacks Consensus Estimate for its current-year earnings has improved 0.1% over the past 60 days. Accenture currently carries a Zacks Rank #3.\n\nCME Group Inc. CME: This company operates as one of the world's largest futures exchanges and offers a wide range of derivatives contracts and various solutions to invest in cryptocurrencies like Ethereum.\n\nCME Group’s expected earnings growth rate for the current year is 2.8%. The Zacks Consensus Estimate for its current-year earnings has improved 1.5 % over the past 60 days. CME Group currently carries a Zacks Rank #3.\n\nHIVE Digital Technologies Ltd. HIVE: This cryptocurrency mining company that operates in Canada, Sweden and Iceland, engages in the mining and sale of digital currencies, including Ethereum Classic.\n\nHIVE’s expected earnings growth rate for the current year is 66.5%. The Zacks Consensus Estimate for its current-year earnings has improved 11.9% over the past 60 days. HIVE currently carries a Zacks Rank #3.\n\nBlackRock, Inc. BLK: This publicly owned company, which is one of the world’s largest investment managers andwas one of the first companies from the traditional market to join the Bitcoin ETF race back in June 2023 and got it approved this January, has already entered the ETH fray by applying for spot ETF.\n\nBlackRock’s expected earnings growth rate for the current year is 4.9%. The Zacks Consensus Estimate for its current-year earnings has improved 5.2% over the past 60 days. BlackRock currently carries a Zacks Rank #2.\n\nJust Released: Zacks Top 10 Stocks for 2024\n\nHurry – you can still get in early on our 10 top tickers for 2024. Hand-picked by Zacks Director of Research, Sheraz Mian, this portfolio has been stunningly and consistently successful. From inception in 2012 through November, 2023, the Zacks Top 10 Stocks gained +974.1%, nearly TRIPLING the S&P 500’s +340.1%. Sheraz has combed through 4,400 companies covered by the Zacks Rank and handpicked the best 10 to buy and hold in 2024. You can still be among the first to see these just-released stocks with enormous potential.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nAccenture PLC (ACN) : Free Stock Analysis Report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nHIVE Digital Technologies Ltd. (HIVE) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]