[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPSnlLYXZDZUIzTTBvWW9VN0FXZGpCaUs4U25TMWI3a0JmUk0wVHJ1U2x4dXhJU0c4NTl5NTZGQTBwRHoyQnBKTWtWWS1BSUVkZDZ3a3NQUHo5OFFubnhTQkQ5Vk5fVU9BY2dtZTBlanFmdGxDOFVTOGpXX2VNbFFERkxiVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval odds drop as SEC remains silent - Yahoo Finance",
        "content": "Bloomberg analysts have significantly reduced the likelihood of a spot Ethereum exchange-traded fund (ETF) being approved by the U.S. Securities and Exchange Commission (SEC) by May.\n\nThe SEC’s silence and inaction have led analysts to reassess the chances of a spot Ethereum ETF approval, with Bloomberg Senior ETF Analyst Eric Balchunas now estimating a 30% probability, down from his January prediction of 70%.\n\nThe absence of typical pre-approval activities, such as filing changes and issuer engagement, has been a cause for concern among industry experts.\n\nThe revised estimates come as the SEC has not provided feedback or engaged with ETF issuers, which is typically part of the approval process.\n\nThe lack of movement and communication from the SEC has dampened the previously optimistic outlook for the approval of a spot Ethereum ETF, contrasting with the successful launch of spot Bitcoin ETFs.\n\nThe SEC’s stance on Ethereum as a security, as opposed to a commodity like Bitcoin, may influence its decision-making process. SEC Chair Gary Gensler’s previous political challenges following the approval of spot Bitcoin ETFs and a court loss to Grayscale in August 2023 could also be factors in the SEC’s current approach.\n\nEthereum traded at around US$3,970, at 3 p.m. ET, according to CoinGecko."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPSnlLYXZDZUIzTTBvWW9VN0FXZGpCaUs4U25TMWI3a0JmUk0wVHJ1U2x4dXhJU0c4NTl5NTZGQTBwRHoyQnBKTWtWWS1BSUVkZDZ3a3NQUHo5OFFubnhTQkQ5Vk5fVU9BY2dtZTBlanFmdGxDOFVTOGpXX2VNbFFERkxiVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval odds drop as SEC remains silent - Yahoo Finance",
        "content": "Bloomberg analysts have significantly reduced the likelihood of a spot Ethereum exchange-traded fund (ETF) being approved by the U.S. Securities and Exchange Commission (SEC) by May.\n\nThe SEC’s silence and inaction have led analysts to reassess the chances of a spot Ethereum ETF approval, with Bloomberg Senior ETF Analyst Eric Balchunas now estimating a 30% probability, down from his January prediction of 70%.\n\nThe absence of typical pre-approval activities, such as filing changes and issuer engagement, has been a cause for concern among industry experts.\n\nThe revised estimates come as the SEC has not provided feedback or engaged with ETF issuers, which is typically part of the approval process.\n\nThe lack of movement and communication from the SEC has dampened the previously optimistic outlook for the approval of a spot Ethereum ETF, contrasting with the successful launch of spot Bitcoin ETFs.\n\nThe SEC’s stance on Ethereum as a security, as opposed to a commodity like Bitcoin, may influence its decision-making process. SEC Chair Gary Gensler’s previous political challenges following the approval of spot Bitcoin ETFs and a court loss to Grayscale in August 2023 could also be factors in the SEC’s current approach.\n\nEthereum traded at around US$3,970, at 3 p.m. ET, according to CoinGecko."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQMENtRDdTNkE5R2ozQ3hCMlFGZnptTE96Rk45bXJWcThILW5ZYVU1eEQxZFd2d0QyQ0ljMXdIRHNGdlJvVlpvanNlcHNBc0p6Z1BwVS1rNTNmM1NNR241Yk1DdVRGd2k1QW93bWtRb1ZfRVIxZXdXMmNla1BLdEFlVXQxb1dwa291WkduVGtlWTk2Ym5MVnN3Wjk2SlU2MVhwZnJnd1ItSzRRZmhFVjhrOXoyX2t5TDJ0TDY4SThlUVlpcEhuVklZdmV3X1dZNlZPY3BIVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "'Solana Is The Ethereum Of The Last Cycle,' Says Raoul Pal: SOL Up 11% In A Week - Benzinga",
        "content": "Layer-1 blockchain Solana SOL/USD is up 11% over the past week, taking back the spotlight from meme coins and looking to build further bullish momentum.\n\nWhat Happened: \"Macro guru\" and Real Vision CEO Raoul Pal stated that \"crypto summer\" just started and is \"up only\" in his latest interview on the Rug Radio YouTube channel.\n\nHe described crypto summer as being in the middle of a strong uptrend, wherein you can get 30% pullbacks in the short term. Pal foresees 2024 as a crypto summer year:\n\n“This is the time when ETH outperforms Bitcoin, Solana outperforms ETH, a bunch of alts will outperform Solana… The big trade is now on.”\n\nSpecifically highlighting Solana, he predicts the token to peak at fresh all-time highs this market cycle, saying that “Solana is the Ethereum of the last cycle.”\n\nDepending on the upcoming crypto cycle, Solana is likely to witness a surge between 235% and 570% from current levels, Pal said.\n\nAlso Read: Bitcoin Rally Sparks Hope For Altcoins Revival Despite 72% Of Projects Dying Since 2020: 'BTC Increasing Lifts All Boats In A Way'\n\nWhy It Matters: The rise in Solana addresses and total value locked indicates rising adoption of the token and genuine user engagement on the network.\n\nThe surge in addresses comes amid a weekly 8% price rally, taking its monthly gains to 35%.\n\nZeta Markets Founder Tristan Frizza told The Block, “With Solana already recording more daily transactions than Ethereum, Arbitrum, Optimism, BNB Chain, Tron, and Avalanche combined, its ascent to a top three blockchain by market cap seems inevitable.”\n\nBased on The Block’s Data Dashboard, the number of daily active addresses on Solana has surged to 1.01 million as of March 11, compared to 779,080 addresses one week prior.\n\nAdditionally, the number of new addresses on the Solana network surged to 717,960 as of March 11, compared to 513,270 one week prior.\n\nSolana's value moved on-chain, daily, standing at $3.18 trillion as of March 10, compared to $1.13 trillion as of last week.\n\nWhile meme coins have been witnessing a rally for some weeks now, Layer-1 coins may be heating up to catch the market rally.\n\nRead Next: Dogecoin, Pepe, Shiba Inu Rally Raises Hopes For Impending Altcoin Season: '...Will Start Outperforming About The Time We Are Now'\n\nImage: Rcc_Btn/Shutterstock"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQMENtRDdTNkE5R2ozQ3hCMlFGZnptTE96Rk45bXJWcThILW5ZYVU1eEQxZFd2d0QyQ0ljMXdIRHNGdlJvVlpvanNlcHNBc0p6Z1BwVS1rNTNmM1NNR241Yk1DdVRGd2k1QW93bWtRb1ZfRVIxZXdXMmNla1BLdEFlVXQxb1dwa291WkduVGtlWTk2Ym5MVnN3Wjk2SlU2MVhwZnJnd1ItSzRRZmhFVjhrOXoyX2t5TDJ0TDY4SThlUVlpcEhuVklZdmV3X1dZNlZPY3BIVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "'Solana Is The Ethereum Of The Last Cycle,' Says Raoul Pal: SOL Up 11% In A Week - Benzinga",
        "content": "Layer-1 blockchain Solana SOL/USD is up 11% over the past week, taking back the spotlight from meme coins and looking to build further bullish momentum.\n\nWhat Happened: \"Macro guru\" and Real Vision CEO Raoul Pal stated that \"crypto summer\" just started and is \"up only\" in his latest interview on the Rug Radio YouTube channel.\n\nHe described crypto summer as being in the middle of a strong uptrend, wherein you can get 30% pullbacks in the short term. Pal foresees 2024 as a crypto summer year:\n\n“This is the time when ETH outperforms Bitcoin, Solana outperforms ETH, a bunch of alts will outperform Solana… The big trade is now on.”\n\nSpecifically highlighting Solana, he predicts the token to peak at fresh all-time highs this market cycle, saying that “Solana is the Ethereum of the last cycle.”\n\nDepending on the upcoming crypto cycle, Solana is likely to witness a surge between 235% and 570% from current levels, Pal said.\n\nAlso Read: Bitcoin Rally Sparks Hope For Altcoins Revival Despite 72% Of Projects Dying Since 2020: 'BTC Increasing Lifts All Boats In A Way'\n\nWhy It Matters: The rise in Solana addresses and total value locked indicates rising adoption of the token and genuine user engagement on the network.\n\nThe surge in addresses comes amid a weekly 8% price rally, taking its monthly gains to 35%.\n\nZeta Markets Founder Tristan Frizza told The Block, “With Solana already recording more daily transactions than Ethereum, Arbitrum, Optimism, BNB Chain, Tron, and Avalanche combined, its ascent to a top three blockchain by market cap seems inevitable.”\n\nBased on The Block’s Data Dashboard, the number of daily active addresses on Solana has surged to 1.01 million as of March 11, compared to 779,080 addresses one week prior.\n\nAdditionally, the number of new addresses on the Solana network surged to 717,960 as of March 11, compared to 513,270 one week prior.\n\nSolana's value moved on-chain, daily, standing at $3.18 trillion as of March 10, compared to $1.13 trillion as of last week.\n\nWhile meme coins have been witnessing a rally for some weeks now, Layer-1 coins may be heating up to catch the market rally.\n\nRead Next: Dogecoin, Pepe, Shiba Inu Rally Raises Hopes For Impending Altcoin Season: '...Will Start Outperforming About The Time We Are Now'\n\nImage: Rcc_Btn/Shutterstock"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOU01NcjByVGZSVlg1SWFqRGpJRmU3MEdaUWpRVURCR1Y0NXpubXpmVDRMY28yN1dJMGRfczBaNnA5SDkyYUJueUlkb3piX2ZUU0ZFR2hzOUFHRWVLb3J2YTVvZjVpTHBFNU85aGJGWWpySzNnZU92OW9MOFhhX2NVR0xTNEthTGdrZFZ1RDFndDV2cE5WY1gyWlZBcUo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Punters put 79% odds on Ethereum all-time high even as ETF approval chances shrink - DLNews",
        "content": "Ethereum has a four-in-five chance of hitting a new record high in 2024, according to bettors on Polymarket.\n\nAt the same time, analysts and online punters’ hopes for an Ethereum ETF approval are dwindling.\n\nSo what’s driving the surge?\n\nOnline punters put the odds of Ethereum breaking a record this year at 79%, according to a bet on crypto predictions platform Polymarket. That’s up from 31% in mid-February.\n\nYet bettors and analysts are putting slim chances of a Securities and Exchange Commission approval of a spot Ethereum exchange-traded fund.\n\nThe deadline for an SEC decision on VanEck’s application is on May 23.\n\nBettors on Polymarket give a spot Ethereum ETF a 31% chance of being approved, down from 82% at the beginning of January.\n\n“I get all the reasons they should approve it — and we personally believe they should — but all the signs/sources that were making us bullish [two and a half months] out for Bitcoin spot are not there this time,” Eric Balchunas said in a post on X.\n\nHe and his fellow Bloomberg Intelligence analyst James Seyffart revised their approval odds to 35% on Monday, down from 70% in February.\n\nThe hope is that if and when spot Ethereum ETFs are approved, they will give the asset a similar growth as Bitcoin had on the back of ETFs in January.\n\nThe news comes as Bitcoin hit a new all-time high of $71,000 on Monday, with many wondering if Ethereum will follow suit.\n\nJoin the community to get our latest stories and updates\n\nEthereum surged to a yearly high above $4,070 on Monday and is up more than 60% over the last 30 days.\n\nEthereum reached a record $4,878 in November 2021.\n\nAnalysts have identified several key factors that could super-charge it to new peaks.\n\nThey include broad optimism, supply-side dynamics, and the upcoming Dencun upgrade.\n\nSupply constraints\n\nAnother Ethereum tailwind: its shrinking supply due to tokens being locked up for staking, Pratik Kala, senior digital asset investment analyst at crypto fund manager DigitalX, told DL News on Monday.\n\n“Less supply to go around is always bullish,” Pratik said. “This also indicates strong long-term investor demand to buy/hold/stake ETH versus using it for short-term speculation.”\n\nStaking in Ethereum parallels Bitcoin mining by generating additional tokens, verifying transactions, and safeguarding the blockchain.\n\nLocking up tokens for staking effectively means removed them from the circulating supply, which can lead to a decrease in the overall available supply.\n\nRoughly 26% of Ethereum’s estimated circulating supply of more than 120 million tokens are locked away, according to blockchain explorer beaconcha.in.\n\nDencun upgrade\n\nInvestment bank JPMorgan and spot Bitcoin ETF provider Grayscale are among those that have identified the Dencun upgrade as a catalyst for Ethereum.\n\nThe upgrade, due Wednesday UK time, is designed to enhance scalability and reduce transaction fees on layer 2 platforms.\n\n“With layer 2 solutions built on top of Ethereum, the blockchain is becoming the settlement layer for a whole new digital infrastructure encompassing gaming, trading, and investing,” Eugene Cheung, Bybit’s head of institutions, told DL News earlier in March.\n\n“The value of all of this will tend to accrue to the ETH asset.”\n\nCorrection: A previous headline misstated the Polymarket odds of an Ethereum record at 56%. It has been corrected to 79%.\n\nSebastian Sinclair is a markets correspondent for DL News. Have a tip? Contact Seb at sebastian@dlnews.com."
    }
]