[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTFBwaUtuZkpGX21qWGd6WXdkV0o0Z3RBaHRMTGNMTGdNbnBBMVl6Zm9EcVJpTHJiSnpFenZoZ1ZIeE9yQjRYNmhuRXotSl9nZTNzMlduVnZ0elZicUxEN1pvdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Ethereum resurgence and layer-2 boom define crypto Q2: IntoTheBlock - Crypto Briefing",
        "content": "Spot ETH ETFs boost Ethereum as Bitcoin miners increase sell-off.\n\nKey Takeaways Bitcoin's price declined following its fourth halving, despite reduced issuance.\n\nEthereum's price rose following SEC's approval of spot ETH ETFs.\n\nShare this article\n\nThe second quarter in crypto was marked by Bitcoin (BTC) and Ethereum (ETH) trending down, BTC miners selling their reserves at a rapid pace, and layer-2 blockchains activity leaping four times, according to IntoTheBlock’s “On-chain Insights” newsletter.\n\nBitcoin’s price fell by 12.8% following its fourth halving on April 20, and an anticipated price surge caused by a supply shock did not materialize. IntoTheBlock analysts shared that this is likely due to long-term holders taking profits in 2024.\n\nImage: IntoTheBlock\n\nMoreover, miners have offloaded over 30,000 BTC in June alone, which amounts to near $2 billion. Again, the halving could be tied to this movement, as profit margins for miners decreased since then.\n\nIn contrast, Ethereum saw a modest decline of 3.1%, a feat made possible by the approval of spot ETH exchange-traded funds in the US, the analysts highlighted. This event boosted Ethereum’s price by over 10%, as those investment products are expected to attract substantial investment, mirroring the inflows seen with Bitcoin’s ETFs.\n\nAdditionally, Ethereum’s landscape was notably different, with an increase in transactions on layer-2 blockchains like Arbitrum, Base, and Optimism, following the integration of EIP-4844.\n\nCaption\n\nThis development introduced the “blobs”, which significantly reduced transaction fees for layer-2 blockchains and encouraged greater on-chain activity. Therefore, this potentially prepared the stage for long-term network benefits despite a short-term decrease in fee revenue."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5BWjlfakZUUFhCZUp3VERmZHlUNm55dFRHT3JJLTR0Q1o3ZThNNnFXdGFCTm5FTDBOUkVyMlY4ZDNLU0NPZEhUWFItWmN4V2RRUmRITlc4ZHdYZmVYV2FjUE9nMzdYa21ycThPVV9RNzZDVTNHYWfSAXtBVV95cUxQNnQ3dVg0UTBvd0wyNzRyekg4SmZCQzFnWUdlQ3JWRHFSaWd2N19WNlZpWGh1LUJfZmxaVlV2b1JubmdxNjBvZWctcHF2VXd1VUo1U1NldFd6d1liN19uV2hWNHdybktrWXgwd1Blbi12QWRldlBQUFJZYnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Reach $7,500? Analyst Makes Bold Claim - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nDespite the depressing performance Ethereum has been showing us lately, the potential behind it is greater than it may seem. The Glassnode analyst believes we have not yet seen everything Ethereum has to offer.\n\nAdvertisement\n\nA comparable trend that emerged in the early months of 2021 can be seen if we examine Ethereum's past. The current market structure is consistent with this historical pattern, indicating that Ethereum may have a price target of about $7,500. Based on the current structures and 161.8 Fibonacci extension level, the projection has been made by the analyst.\n\nETH to ~7500 USD as a Final Top?\n\n\n\nIf we look to ETH history, we observe how we in early 2021 had similar pattern for ETH developing. See YELLOW MARKINGS!\n\n\n\nWe believe Market moves in structures. And this structure gives us a target at ~7500 as a Final High for #ETH.\n\nThat is the… pic.twitter.com/FID62C9uyt — 𝗡𝗲𝗴𝗲𝗻𝘁𝗿𝗼𝗽𝗶𝗰 (@Negentropic_) June 27, 2024\n\nA similar Fibonacci extension level signaled a notable rally and large price gains in 2021. According to the analyst, the market moves in predictable patterns, and the current pattern indicates that ETH's high will occur at $7,500. Additionally, the chart shows a bull flag pattern, which traditionally denotes the continuation of a bullish trend.\n\nAdvertisement\n\nEthereum might be ready for a big increase in the near future if this pattern continues. Additionally, there is a surge in interest and investment on the larger cryptocurrency market. This situation, along with Ethereum's impending updates and growing institutional traction, may create the ideal conditions for a robust rally.\n\nIn order to reach this goal, Ethereum must overcome multiple obstacles. The $4,000 threshold, which corresponds to the 1.618 Fibonacci extension from the previous cycle, is the first significant obstacle. Achieving this level would confirm the bullish structure and open the door to higher objectives.\n\nAs for potential catalysts and the overall sentiment on the market, we are currently seeing a recovery after the most recent plunge, witnessed a few days ago, when Bitcoin plummeted below the $60,000 level. The best fuel for Ethereum and the market in general would be the approval of the Ethereum ETF and some technological advancements, similar to those we have seen from Solana."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBVay04ZXRaUzdkR2RkSGUxNVNnTGRlTDNfLVFuQ2NJYXVUTGVqWTdENDFNekVCU3VqbUhWUUVab3ZucWw2YXF4YXVxdmVSRmlyR3RVU0gxUnJLWVZpUW5xMmVOU3dkWUFJc1MwWWhYLUFwSl9BNFRKS2JIVXU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Ethereum price could go parabolic soon, analysts say - crypto.news",
        "content": "Ethereum price has held relatively well in the past few days as the odds of spot ETF approvals rose. ETH token was trading at $3,455 on Friday, a few points above this week’s low of $3,233. It remains in a correction zone after falling by 13% from its highest point this month.\n\nThe main catalyst for Ethereum is the anticipated spot Ethereum ETF approval by the Securities and Exchange Commission (SEC). As we reported on Thursday, there is a rising possibility that spot Ethereum ETFs will start trading soon.\n\nThe rising anticipation happened after VanEck filed form 8-A, which is an important document in the ETF application process. Eric Balchunas, a senior ETF analyst at Bloomberg believes that these funds will start trading on July 2nd.\n\nVanEck just filed 8-A form for spot Eth, which is just part of process, but.. should be noted that they filed their 8-A for spot bitcoin exactly 7 days before launch. Good sign for our July 2nd over/under (7 days from now). But again, anything poss. Sure we'll hear more soon.. https://t.co/2BlkDnWhrz — Eric Balchunas (@EricBalchunas) June 25, 2024\n\nThe approval of spot Ethereum ETFs would be a big deal. As we saw with Bitcoin, there is a strong demand for cryptocurrencies from institutional investors.\n\nSimilarly, the Grayscale Ethereum Trust (ETHE), which has a management fee of 2.50%, has over $10 billion in assets. As such, lower-priced funds will likely see heavy demand from retail and institutional investors.\n\nEthereum ETFs will also start trading at a time when balances in exchanges continue dropping, as shown below.\n\nEthereum reserves in exchanges\n\nEthereum’s ecosystem is still doing well even as the crypto sell-off continued. The network has over $108.95 billion in total value locked (TVL) and almost $80 billion in stablecoins. It has collected fees worth $1.65 billion, higher than Tron’s and Bitcoin’s combined.\n\nAnalysts are bullish on Ethereum price\n\nSome of the top crypto analysts believe that Ethereum is on the cusp of a bullish breakout. In an X thread, Rekt Finance noted that Ethereum’s open interest in the futures market was rising, which is a sign of institutional demand ahead of the ETF approval.\n\nHe also noted that Ether was a deflationary asset that has constantly been reducing its supply over time. Altogether, he expects that ETH will jump after the ETF approval, then move to a consolidation or pullback as many Grayscale Ethereum Fund holders move to cheaper options, and then it will resume its bullish trend.\n\n🚨 \"ETH IS GOING TO ZERO\" – that's what everyone's saying.\n\n\n\nBut I'll prove them wrong.\n\n\n\nI dug into the data and what I found was shocking.\n\n\n\n🧵: When & why $ETH is heading to $10K (+ trigger altseason) 👇 pic.twitter.com/nnlUDJlbNz — Rekt Fencer (@rektfencer) June 25, 2024\n\nIn another Tweet, Crypto Rover, who has over 700k followers, noted that Ethereum had formed a descending channel that resembles a falling wedge pattern. In most cases, this is one of the bullish patterns that supports upside potential. He expects that the breakout could happen soon."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxQT25NWTNOZklDQ2oyS2JIOVp5RnBtLTJxUmxwb3htcnZSSjBGTGFWV0ZpbkktcDU1c0w4a2s5RGJRaU5hd1BVVnhUeGJfMTVZWWlyQ0xkTXFwVmtGRUZWSlVVdTBibE92ZVVwWTJHMEYtVm9tNG5Xd2VmY2E3NmlmdXYtNDdlX2NPaG10NTdlaDRqT2otNWhKVEJKaDF6bzhLRWt2SnVCUWFVX2JsMXN2ZDFYYnhhemJpa0JhU1JJZENoYjVkYzBQbWFQOXNaR0s5RVYyV3RqcjNCNWps0gHiAUFVX3lxTE1GYjJSWFBfaF9qTEIyLTE1czRTN09oTkR4NnlhZ0xsU2VpN1p3REJKT3VnN0FLUG9BZ0FQdWxTSEhmZUMwQnRUQjRVRXRGQzRZWmk0b3F6SjVSbWtCX182cUpvZzNKdG1pdl93SnhpSm05OFhSUGtBTFpPbWZ6a3k4d3NkUnFVU0oyNllSM29xbWR6R0NYaWdSTjVPcTVzd3N1My1NM0xMSVN1QXNiQTdnNWZ2UWFiSEhhY3Atc0ZjMDJvWWsxZG9YVm94d0RmWTk5VVR5eU8zeEk1bFFQYnI2ZGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC struggles around the $62,000 level - FXStreet",
        "content": "Bitcoin price faces pullback resistance at the lower band of the descending wedge around $62,000.\n\nEthereum price finds support at $3,288, the 61.8% Fibonacci retracement level.\n\nRipple price faces resistance at $0.500, its daily resistance level.\n\nBitcoin (BTC) encounters resistance near the $62,000 mark, while Ripple (XRP) mirrors BTC's challenge around the $0.500 level. Meanwhile, Ethereum (ETH) finds solid support around the critical price point of $3,288.\n\nBTC faces resistance at the lower band of the descending wedge\n\nBitcoin's price broke below the descending wedge on Monday, declining approximately 7.5% to retest its crucial weekly support near $58,375 and rebounded by 5.8% on Tuesday.\n\nSince Tuesday, BTC has faced resistance at the lower boundary of the broken descending wedge. At the time of writing, it trades around $61,704 on Friday.\n\nIf the lower boundary of the descending wedge around $62,000 holds as resistance, BTC could decline roughly 5% to reach its weekly support near $58,375.\n\nOn the daily chart, the Relative Strength Index (RSI) and the Awesome Oscillator (AO) are below their respective neutral levels of 50 and zero. This indicates that, according to these momentum indicators, the bearish sentiment prevails, suggesting the potential for further decline in BTC’s price.\n\nBTC/USDT daily chart\n\nHowever, if BTC closes above the $63,956 level and forms a higher high in the daily time frame, it could indicate that bullish sentiment persists. Such a development may trigger a 5% rise in Bitcoin's price, revisiting its next weekly resistance at $67,147.\n\nEthereum price looks promising\n\nEthereum price retested its support level of $3,288, the 61.8% Fibonacci retracement level drawn from a swing low of $2,862 on May 14 to a swing high point of $3,977 on May 27. ETH rebounded by 5% from the 61.8% Fibonacci retracement level and trades at around $3,457, edging up approximately 0.3% on Friday.\n\nIf this support at $3,288 holds, ETH price could rally 8% from its current trading level of $3,457 to tag its previous high of $3,717 on June 9.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator in the daily chart are both below their neutral level of 50 and zero. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective neutral levels.\n\nIf ETH closes above $3,717, the high of June 9, it could extend an additional rally of 7% to reach its previous resistance level of $3,977.\n\nETH/USDT daily chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $3,288 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 13% crash to the previous support level of $2,862.\n\nRipple price shows resilience\n\nRipple's price currently trades at $0.476, below the daily resistance level of $0.499. Despite Monday's fall in Bitcoin’s price, XRP has shown resilience in its price action.\n\nIf Ripple's price surpasses the barrier at $0.499, it could rise 7% from $0.499 to $0.532, its previous high from June 5.\n\nIn the daily chart, the Relative Strength Index (RSI) is currently below the 50 mark, indicating neutral to bearish sentiment, while the Awesome Oscillator (AO) remains below zero, suggesting bearish momentum. Both indicators must rise above their critical thresholds of 50 for RSI and zero for AO for a sustained bullish trend. Such a development would bolster the ongoing recovery rally in the market.\n\nIf the XRP daily candlestick closes above $0.532, it could extend an additional 9% rally to $0.581, a 50% price retracement level of $0.419 and $0.744 from March 11 to April 13.\n\nXRP/USDT daily chart\n\nHowever, if the Ripple price daily candlestick closes below $0.450, marking the June 7 low, it would invalidate the bullish outlook by establishing a lower daily low. This scenario might lead to a 7% decline in XRP's price towards the April 13 low of $0.419."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNbFJmWkV2T0hFNG92cFR5Z0tiQ0Nxd1VMNjJBM3pnMV9oX2FDUXBYOHZjWG8tTC1jaTVEMHp5NWFGMjNLYnczXy1rYWZ4UElFWjZlVmlYMmZhTmxrek53V3ZrRkdjNjJOMmotYmJEc1R6NjFuaHZaNGlDeV9sNWZ4VG9KQ0JMM1N5dW9iWjh6Y0VidE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "4 Reasons to Buy Ethereum While It's Under $4,000 - The Motley Fool",
        "content": "Ethereum could outperform Bitcoin in the second half of 2024. Here's why.\n\nThrough the first six months of the year, Ethereum (ETH -5.70%) has largely kept pace with Bitcoin (BTC -3.10%). Both are now up about 45% year to date, and the big question on the minds of many investors is which is going to outperform during the rest of 2024.\n\nIn early May, the easy no-brainer answer would have been Bitcoin. But Bitcoin has stumbled of late, and that has opened the door for Ethereum. There are now four compelling reasons Ethereum could soar higher, even if Bitcoin continues to trade sideways.\n\nThe new ETFs\n\nBitcoin, of course, has had spot exchange-traded funds (ETFs) since January. And the introduction of this new investment product has arguably been one of the most important crypto narratives of 2024. But there's a new twist to that narrative. At the end of May, the Securities and Exchange Commission (SEC) finally approved new spot ETFs for Ethereum.\n\nIt is still uncertain how much of a boost these new ETFs are going to provide. The current thinking is that they will start trading sometime this summer and that they could lead to $3 billion flooding into the new ETFs. That's a bull case scenario, though. According to JPMorgan Chase (JPM -1.81%), the bear case scenario is closer to $1 billion. That's barely a blip on the radar compared to the $30 billion that has flowed into the new Bitcoin ETFs. Nevertheless, they are still likely to move the needle for Ethereum.\n\nEthereum as the market leader\n\nEthereum continues to be the clear market leader in every important blockchain sector. Take decentralized finance (DeFi), for example, where Ethereum still accounts for more than 60% of all total value locked (TVL) in the blockchain world. No other blockchain even comes close. So we can start to downplay any notion that a challenger such as Solana (SOL -5.36%), Cardano (ADA -6.00%), or Avalanche (AVAX -7.38%) has any clear-cut path to toppling Ethereum anytime soon.\n\nThe market seems to agree. Ethereum is significantly outperforming all of its peers. For example, Solana is up 35%, and Sui (SUI -2.02%) is up 9%. Other top competitors are reeling. Aptos (APT -2.47%) is down 28%, Cardano is down 32%, and Avalanche is down 33%.\n\nRegulatory clarity\n\nThere's another big reason to cheer on Ethereum, and that is regulatory clarity. Just about anyone who has ever heard of Ethereum considers it to be a cryptocurrency. However, through the first six months of the year, there were rumbles and murmurs about a pending SEC investigation into Ethereum, due to uncertainty over whether it might actually be a security.\n\nBut those rumors now appear to be quashed, with the SEC saying that it is closing down any investigation into Ethereum. That's important because it could turn on the money spigots for risk-averse institutional investors. Crypto is risky enough without the added risk of an SEC probe.\n\nLong-term disruptive potential\n\nAnd, finally, there's the long-term disruptive potential of Ethereum. For the past decade, Ethereum has been a true innovator, pioneering niches of the blockchain world that had never existed before. And, judging by all the tech upgrades that have been made to the Ethereum blockchain over the past two years, this trajectory should continue.\n\nIn fact, investment firm VanEck expects Ethereum to grow dramatically in several key areas, led by DeFi. It's here that the Ethereum blockchain can offer the greatest disruptive potential. It's simply faster, cheaper, and more transparent to manage financial assets on a blockchain. And that could lead to Ethereum gaining market share at the expense of traditional financial rivals.\n\nIn fact, VanEck has run the numbers and determined that Ethereum could soar to a value of $22,000 per token by 2030. That would give Ethereum an implied market cap north of $2 trillion. Given that the top companies in Silicon Valley are now worth anywhere from $1 trillion to $3 trillion, a market cap of $2 trillion for Ethereum is not as unreasonable as it might sound at first.\n\nWhat to look for over the next six months\n\nFrom my perspective, the biggest threat to Ethereum remains the rise of blockchain challengers such as Solana. The economic moat that once surrounded Ethereum seems to be getting smaller and smaller with each passing year.\n\nThat said, Ethereum is shaping up to be one of the best crypto investments you can make in the second half of 2024. If the new ETFs perform as expected, then it could be off to the races for the world's second-most-valuable cryptocurrency."
    }
]