[
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxONFlsbG9EQU9mNm5GSDlzNll1aldNTGFocTQtUl9yVkJ6TnNWTjVHNVN2NnFWaldNZUJMRldTSTlHRU9zV0FjdFlyVWFDVnZZS0QxdC1pSzJuRHhxZWctVkhPQ3NnU0FraTFya1d2RDl0dWJ2a2M4Q2x6dUVlQjEwb1lTbGZmNE9SWUNyZFFzeUl1enJZNGxjSjNxbmJpZGFKVnQ3OWc0NlFsZTlVdmRoQnA5bWExUHlSbEJ4TW10TklxYlQwbVJ4WVoxQm1SOG5jeW02aXBVdmtGek4ydTMyTXExWkF0U0hn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Popular French Magazine Paris Match Converts Iconic Photos Into Ethereum NFTs, Puts Them For Sale In Auction - Benzinga",
        "content": "Paris Match, considered one of the best outlets for photojournalism, plans to auction some of the most iconic photos from its archives as non-fungible tokens.\n\nWhat Happened: The French weekly news magazine said that the auction, beginning Monday, will have 75 NFTs for sale, all of which were created on Ethereum ETH/USD, the blockchain known for housing some of the biggest collections like CryptoPunks and Bored Ape Yacht Club, reported Decrypt.\n\nSome photos selected for Monday's auction included The Rolling Stones, Jack Nicholson, Orson Welles, and John Travolta. News reports on watershed events like the Berlin Wall were also included.\n\nThe opening bid for photos began at 0.3 Ether, worth $1,148 at the time of writing. Along with the NFTs, the owners will also get physical prints of the photos.\n\nAs with other assets in this category, Paris Match NFT owners will have full digital license rights to the photos.\n\nWhy It Matters: The development coincides with an increased desire to convert entities with important historical and artistic significance to NFTs.\n\nEarlier this month, digital asset investment firm Galaxy Digital announced the tokenization of a nearly 300-year-old vintage violin once owned by Russian royalty. The tokenized version was used as collateral for a loan.\n\nThe global NFT sales volume surged 45% to $19.25 million in the last 24 hours, according to CryptoSlam. The total number of sales rose 11% to 193,714.\n\nEthereum clocked the highest sales at $7.19 million, followed by Polygon MATIC/USD and Bitcoin BTC/USD.\n\nRead Next: Deutsche Telekom, T-Mobile’s Parent Company, Will Mine Bitcoin"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOZmV5WHVZTDJxeGl5ekpGMHIwMmpTdTI2UXdVckdJSC1zSkdyR19SY3J4bWg5N01YQjJsMXVwYXNYRkRORWw3dWplSEx3aU1IMWNIbU5rNDVlLU1vZ1ByV2QweEt6MllIcnVQbTZPNXByMWI3Y29yUmhvN3Bnc2VGaVBPVmo2a2ozQ0l1TkwybHN5bDJNeFdyMmVWMVp3OUQxSUJmNTVkT0VPdnZERzYyZ29JNzRrb05IR0R0a0MzMld4aDMwb2NWQXAyMEZVYkRSUzVMb0NOT2NpYUFTT2k4MEhlWFJRQk04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Secures 'Momentous' Win After SEC Closes Security Probe: Whale Accumulates Over $19M Worth Of ETH In Immediate Aftermath - Benzinga",
        "content": "ConsenSys, a blockchain software company, announced a major victory for Ethereum ETH/USD, following the closure of the SEC’s investigation into whether the world’s second-largest cryptocurrency is a security.\n\nWhat Happened: On Tuesday, ConsenSys took to X to reveal that the regulator will not move forward with the charges alleging that sales of Ether are securities transactions.\n\nThe announcement followed a letter sent by ConsenSys to the SEC on June 7, asking for confirmation that the Ether spot ETF approvals last month, based on ETH being a commodity, would lead to the closure of the investigation.\n\nETHEREUM SURVIVES THE SEC.\n\n\n\nToday we're happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0.\n\n\n\nThis means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nSee Also: Bitcoin, Ethereum, Dogecoin Go Sideways, But ‘Market Structure Back To Bullish,’ Says Trader\n\nConsenSys emphasized that the closure of the Ethereum investigation, while significant, does not resolve all issues faced by blockchain developers, technology providers, and industry participants under the SEC’s crypto enforcement regime.\n\nThe company now seeks a declaration that its software offering MetaMask Swaps and Staking does not violate securities laws.\n\nThe positive news also got whales excited, with one investor scooping 5,603 Ether, worth $19.6 million, in the aftermath, according to Lookonchain.\n\nAfter @Consensys posted that the #SEC had closed its investigation into #Ethereum 2.0, the whale bought another 5,603 $ETH($19.6M).\n\n\n\nThe whale has withdrawn 16,604 $ETH($59M) at an average price of $3,600 from #Binance since May 30.https://t.co/NYbgSJevaT pic.twitter.com/N3vsISPeyX — Lookonchain (@lookonchain) June 19, 2024\n\nWhy It Matters: In April, ConsenSys alleged that the SEC had been covertly targeting Ethereum for over a year, scrutinizing its nature and whether it should be classified as a security.\n\nIn response, ConsenSys filed a lawsuit against the SEC, arguing that the SEC is overstepping its authority by attempting to regulate Ether.\n\nFor context, the CEO of ConsenSys, Joseph Lubin, was one of the co-founders of Ethereum.\n\nPrice Action: Reacting to the development, Ether spiked 3.32% to trade at $3,549.33, according to data from Benzinga Pro.\n\nRead Next: Bitcoin, Ethereum, Dogecoin Trade In The Red As Summer Doldrums Kick In: Analyst Says ‘We Are Early In The Cycle’"
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNZ24tVlN0Ym9wVUtyclF1WUxVYU1kYm8xczBoUFFVUkU3d29mYzRWZXZJRDJGV1VSMWRVdHV2QzFqeHNQR2MzdnlnSmw1ZjItRklMTW9mMHlaS2JYMGdQSi1yMkFDREN4LXkwMzBPWTBJRkZpWHBpckJsZ0Y2TndmR0NUSVBuRVlGdVJKams5UUZySExramdZalNtZ0RwUWMyQk9rYWxLMXh5UVhU0gGyAUFVX3lxTE5PNjQ5LW5PUGVweHktZWF2WTRTTXFhRmhGb1hIOXdkS21DcUhLTWFRS2VJVVozeEFyZmJhV0Vjd0RyLUx5U2NFN0JNOFpBeGpYc3lScGlIVzBHY1dWXzNycnJUNmFPQUlObzlKUjhDaG1uRDNqdFNma2x0cXhFNXBBWXcxSUc3NndyM0hNUDZ5ZGNaUmNsdWlJZVpGakhhdWNXWGp1X0lham1CeUl1ODhWMmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Crypto Prices Today June 18: Bitcoin Nosedives To $65K, Ethereum Sinks 5% Amid Bearish Market - CoinGape",
        "content": "The crypto prices today rode a bearish wave as Bitcoin (BTC) slipped to the $65K mark, whereas Ethereum (ETH) showed signs of a pullback. Altcoins Solana (SOL) and others mainly followed, with Dogecoin (DOGE) and Shiba Inu (SHIB) meme coins noting a dip of 9%-13%. However, XRP traded in the green, defying broader market trends.\n\nThe global crypto market cap saw a significant 3.14% decline to $2.35 trillion, although the total crypto market volume from yesterday spiked 104.01% to $94.07 billion. This follows whopping outflows recorded across the crypto sector, triggered by the U.S. Fed’s recent hawkish stance.\n\nadvertisement\n\nHere’s a collection of some of the top cryptos and their price movements today, June 18.\n\nTop Crypto Prices Today\n\nBitcoin Price\n\nThe BTC price chart illustrated a faded movement today, nosediving to $65,374.98, down 1.39% over the past day. The token’s 24-hour bottoms and highs are $64,597.25 and $67,252.08, respectively.\n\nBitcoin’s dominance stood at 54.87%, a 0.93% jump over the past day. The token boasted a waned market cap of $1.29 trillion. This drop comes in the background of nearly $146 million outflows recorded in the U.S. spot BTC ETFs, per data by Farside Investors.\n\nEthereum Price\n\nETH price traded primarily in the red in the past 24 hours, falling 4.39% to $3,428.45. The token’s 24-hour lows and highs are $3,371.59 and $3,591.67, respectively.\n\nEthereum boasted a market cap of $419.50 billion.\n\nSolana Price\n\nSOL price corrected 9.25% over the past day to trade at $134.26 at press time. Solana’s 24-hour slumps and peaks are $130.16 and $148.95.\n\nXRP Price\n\nHowever, the Ripple Labs-backed crypto noted slight gains of 0.33% over the past day to reach $0.4893. XRP’s 24-hour lows and highs are $0.4808 and $0.5194, respectively.\n\nDOGE & SHIB Prices\n\nBesides, the meme coins sector mimicked the broader market’s tumbled movement. Dogecoin (DOGE) fell 9.74% from yesterday to $0.122, while Shiba Inu (SHIB) fell 12.12% to $0.00001802. Further, Pepe coin (PEPE) plummeted 11.84% to $0.00001055.\n\nAlso Read: GameStop (GME) Plunges 13% After Unexpected Announcement From CEO\n\nTop Crypto Gainers Today\n\nThe only top gainer for today was XRP, per CoinMarketCap’s data, with its price action facilitated above.\n\nTop Crypto Losers Today\n\nzkSync (ZK) price crashed 30.23% to $0.2002.\n\nFantom (FTM) price plummeted 20.69% to $0.5013.\n\nEthena (ENA) price plunged 18.89% to $0.6021.\n\nStarknet (STRK) price dipped 17.82% to $0.7444.\n\nMeanwhile, it’s also worth mentioning that BTC and ETH noted gains in their hourly timeframe charts, underscoring a tussle to gain upside momentum. Similarly, altcoins SOL, XRP, DOGE, and others followed.\n\nAlso Read: Ex-SEC Official Denies Joining Memecoin Platform\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE41V1Z0bTMyMXkyWUF4M2xvVjl2Q1BNUThIUG96S0FYLTVxM2lzRllVMjFMSEw5cGFOU3p2bXRrY0VZUDhySkpCSFVHZzBQM0NvUnBQbWtkZkRNaHExRmF6dVp2Tnp2YUh6dXlKVTNMd1F3RDR3Ny11andnSdIBgAFBVV95cUxNSDhpWjZYenYzd1g3dmlUMjBrdnNTU3VEM3BUUlNjOE1veWxCejlzRkNKTndZWU5KeGVBS2c5M1ZoMjJpRTN3dGZMZ0RRaXZhZ1NNN2xXWVo5MndWb3NyeG5MZnlpeHZ0bmc1VUxFbFpyVUtfOXlMbGFmS3VaQ2ZmUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Wins As US SEC Ends Securities Investigation - Bitcoinist",
        "content": "The crypto industry received a significant jolt of clarity and optimism as the US Securities and Exchange Commission (SEC) concluded its investigation into Ethereum 2.0, announcing that it will not pursue any enforcement actions. This decision marks an important victory for Ethereum and could serve as a critical reference point for the treatment of digital assets under US securities law.\n\nEthereum Is Not A Security\n\nIn 2018, the SEC made a key distinction that Ether was not a security. However, by 2023, amidst evolving functionalities and the transition to Ethereum 2.0, the SEC revisited this stance, hinting at possible regulatory oversight. This shift led to increased scrutiny and uncertainty within the Ethereum community, culminating in a lawsuit filed by Consensys on April 25, 2024. The lawsuit aimed to confirm the classification of ETH as a commodity, arguing that the SEC lacked jurisdiction over its trade and governance.\n\nIn a pivotal response dated June 7, 2024, Consensys urged the SEC to acknowledge the approvals of Ethereum-based ETFs made earlier that May, which were predicated on the assumption that ETH is a commodity. Consensys argued this should conclusively end the SEC’s investigation into Ethereum 2.0.\n\nThe SEC’s Enforcement Division officially responded on June 18, 2024, as communicated in a letter addressed to Kevin S. Schwartz, attorney for Consensys. The letter stated, “We write to provide notice that we have concluded the investigation in the above-referenced matter […] based on the information we have as of this date, we do not intend to recommend an enforcement action by the Commission.”\n\nImportantly, the SEC underscored that this closure should not be seen as an exoneration or that no action may ultimately result from the staff’s investigation. Nonetheless, Laura Brookover, a lawyer at Consensys, underscored the significance of this development, stating, “The SEC sent us a closing letter in the Ethereum 2.0 investigation today. Things have changed remarkably fast since we filed our lawsuit against the SEC in late April, culminating in today’s development.”\n\nThis resolution can be perceived as a critical moment for the broader crypto industry, particularly in how digital assets are classified and regulated. Alexander Grieve from Paradigm noted the tone of the SEC’s notification, commenting, “They’re pretty hedge-y/evasive in their notification—BUT it is relatively unusual for the SEC to specifically highlight to a company that they’ve closed an investigation.”\n\nThe closure of this investigation without enforcement action could set a precedent for how other cryptocurrencies are treated by regulatory agencies, potentially easing the regulatory environment for digital assets.\n\nWhile the immediate threat of an enforcement action has been alleviated, Consensys and the wider crypto industry are looking towards further clarifications in regulatory policy. Consensys in their lawsuit also seeks a federal court ruling regarding their operations, asserting that they do not act as brokers nor issue securities through their software offerings like MetaMask Swaps and Staking.\n\nAs stated in their lawsuit, “Consensys is built on creating software products that allow people around the world to use and build on top of the Ethereum network, and it is entitled to run its business without the cost, burden, and uncertainty of an unlawful enforcement action.”\n\nAt press time, the price of Ether (ETH) has responded favorably to the SEC’s decision, showing a notable increase of 3.3%, bringing it to a current trading price of $3,561.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQNVJGQ1NwZXd1TXl5WkxOVFdpSEFaMmNDc2loSktxeHk2d0drN0xtZi1Jc3JkZ0otMUk3bWRYOEEtN0p3OWRFZkVURlo4NnpaYklYMENPVy1BNHVFUkhnYksxeE5WWUxHYk4tRzhfSGNCV2FTbk02eFEtLXdYUHRKNVFxaEtLbzRVY29VMzdTSGwzckc4a3VZbUwxMDRYMW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "What Will Allocations Look Like in Combined Bitcoin and Ethereum ETFs? - Unchained",
        "content": "After the first combined ETF was filed today, what will other issuers do regarding the allocation to BTC and ETH?\n\nAs the first combined BTC/ETH ETF was filed, what can we expect from future allocations?\n\nOn Tuesday, as the market eagerly anticipates the full approval of spot Ether ETFs, Nasdaq filed for a combined Bitcoin and Ethereum ETF. This new ETF, managed by Hashdex, will allocate 70.54% to bitcoin and 29.46% to ether. These allocations are based on the relative free float market capitalizations of bitcoin and ether.\n\nBut, is this the only way newly combined ETFs will allocate to bitcoin and ether? And what impact might this have on the market?\n\nRead more: There Are Now 11 Spot Bitcoin ETFs. Here’s the One That’s Best for You\n\nWhy Combined ETFs Matter\n\nThe introduction of combined BTC and ETH ETFs is significant for several reasons. Firstly, these ETFs offer investors diversified exposure to the cryptocurrency market without having to choose between Bitcoin and Ethereum. This diversified approach might attract more inflows, especially from more conservative investors, as it mitigates the risk associated with investing in a single asset. By holding both BTC and ETH, investors can benefit from the possible upside of both leading cryptocurrencies, potentially stabilizing returns compared to single-asset ETFs.\n\nThe structure of combined ETFs could also impact the prices of BTC and ETH. As these ETFs gain popularity, increased demand for the underlying assets could drive up their prices. If there are ETFs that allocate more to one asset or another, it could be positive for that specific asset.\n\nNate Geraci, president of the ETF Store, explains that the success of broad commodity ETFs suggests that combined crypto ETFs could find a larger audience “due to the novel nature of the category.”\n\n“Some investors and advisors will prefer a diversified approach to an emerging asset class like crypto versus attempting to pick winners and losers,” Geraci told Unchained. He believes that once additional crypto assets are available in an ETF wrapper, such as SOL or XRP, we can expect to see various index-based and actively managed strategies.\n\nAllocation Strategies\n\nGeraci believes that, as in the Hashdex ETF, the division should be reflective of their respective market caps. “Ether is currently valued at about one-third the market cap of Bitcoin. I think that’s a reasonable proxy for what spot Ether ETF demand will look like compared to spot Bitcoin ETF demand,” Geraci told Unchained. And despite the lack of staking options in the initial spot Ether ETFs, Geraci believes this won’t significantly deter demand.\n\nHowever, Geraci also expects the emergence of multiple flavors of combined BTC and ETH ETFs, including market cap-weighted and actively managed products. “Market cap-weighted products will hold BTC and ETH in the proportions described above. Actively managed ETF holdings will be dictated by the manager and prevailing market conditions,” he notes, indicating potential variability in allocations based on market dynamics.\n\nScott Johnson, general partner at Van Buren Capital, suggests that combined BTC and ETH ETFs might feature a 50/50 split or follow some type of index-weighted approach. “To the extent these come online in the near term, you might see a 50/50 or some type of index-weighted allocation,” Johnson told Unchained via email.\n\nLooking at other markets, such as Canada, where crypto ETFs have been available for several years, provides valuable insights. For example, the Evolve Cryptocurrencies ETF is weighted on a market capitalization basis and rebalanced monthly. As of the latest data, this ETF allocates 71.90% to Bitcoin and 28.10% to Ethereum.\n\nMeanwhile, CI Financial offers the CI Galaxy Multi-Crypto ETF, an actively managed ETF, and uses a rules-based, momentum-signaling strategy, allocating roughly 50/50 to BTC and ETH.\n\nLearn more: Bitcoin ETFs Explained: What Are They & How Do They Work?"
    }
]