[
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxOMWpYcnNHZEF1M2dHamw2NDAyRGZCN1IyXzcyWnVVX29KRzkyNWRNSTMwUHl0MWdfYmNVV2VfMmZnUVlhdVpRam1sUndaY05UWjdwd3QteTZjN3lmMTluR19ab1lRdFgzMVFIcUk2WFBuTlRkcGpSUGFnWEZEdVNxUS14eDhJLUVSU0w2cW1ZZ1hwZU51Mmg2VXoySHBLX2hfdk51NzFKbTBqM1NMSVc1Q2ROVHd5cUh4VU5RMDhseHZLS1NKOWNRYXFFTGNTUWYxTzh1X01ac9IB3AFBVV95cUxOYUxia2hMd084U2NrcUs0cUdET3RCRUxQQUlBdmZTSHZoTkFqb0VQMDYxdDQzVjZtck5ocXRPcWVsOHpfN3FVQjdSemt4azM5aUVNNmFna0pqM2liQTg1czVGZVNTbGxsXzJ0UkE1T3M3emZMYldWZGV4dEcxdFBhTVpqRmVxS3lOekpiS1BsWFZEdUZGb0dJY3JYY3hrT1BRcmRGY0NvX2FYMk43bjZIM2Q0eTJPX2RVelhOM3RNa2dDUVZqYmpUN3Vxb3JNbURFT3I0SVVRWmZsZGtO?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, Bitcoin & RUNE – European Wrap 9 February - FXStreet",
        "content": "ThorChain (RUNE) price is trading with a bullish bias, completing a full swing V-shaped recovery after the steep dip in the first four days of February. It comes amid an altcoin revival recourse, inspired by Bitcoin (BTC) price breaking past the $45,000 psychological level.\n\nDespite the Bitcoin spot Exchange-Traded Fund (ETF) approval, BTC price failed to rally as anticipated. The news of ETF inflows and outflows, caused a widespread panic among investors, which led to a brief pause. But lately, things are starting to improve with regard to ETF inflows.\n\nBitcoin (BTC) price action is showing strength and volatility after seven weeks of consolidation. The current weekly BTC candlestick has already registered a 9.30% gain and is likely to close on a positive note.\n\nAmong the top 10 most capitalized cryptocurrencies, Ethereum (ETH) has outshone its peers, marking the strongest performance with a 7% increase over the week. As market analyst for FXStreet Mike Ermolaev noted, the ETH price recently peaked at $2,706 and, even despite a pullback, many are eagerly eyeing the potential for Ethereum (ETH) to breach the $3,500 mark in the near future.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxNTDNnZmZWdERIeUpDUU5VdTlHbjd5cVF6Ul9CeXJmUWViM2xlOHp0NXFtZFAyUWJ5c1o1YTgxZzdjeUI2T1BZRTVRVkNhVlU2UnhEWWxzMmtka1RVaVhNdV92cjkwcnowdjN0MGl3Nm5MTUxYWEZVVHJrN3VRTzAxdzJwWXItNWxId0xxNUhfbE5RTWYzMVVBMnhwOGdhdEp5ZkZ0WExhTjhDUVpKVDVaZk5HaXZ4MjFqZDhsNkVVLUlGX19SWUZJelIxRW5KN1Z1dWx5dXZwYTIyVTlEMkdybVBR0gHnAUFVX3lxTE16MkpKVGJPMkdRdXZvNDktMEx6RUprNHF0LTFnczBsWW4zWVFvaWR2aFhqaFEwZmdkUHJjZURvT0lNajBXZUF0TnNVeUNtcWJITGV5a2hHUTgzbm4wM2dTZUJRTjQ2MDJvaENob3NBNDNBRFVPVjQ1dWZJRFZVaHlTNHRCQzhfZEEyRnlzdGdRczFBM1VNTGpmZ0RFbXN4UHEwaW5nU1VpcHJLeVNKT2xlUHpOaGVNeGc4aXZlYnNpVVFjZTV6Y1BXb3BubnNhQVVwbTA3STJySXV0WVJkNkZGNjFNN29ZVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) rockets ahead this month – So why does a market analyst fear further collapse? - FXStreet",
        "content": "Among the top 10 most capitalized cryptocurrencies, Ethereum (ETH) has outshone its peers, marking the strongest performance with a 7% increase over the week. As market analyst for FXStreet Mike Ermolaev noted, the ETH price recently peaked at $2,706 and, even despite a pullback, many are eagerly eyeing the potential for Ethereum (ETH) to breach the $3,500 mark in the near future.\n\nNevertheless, according to Ermolaev, the possible declaration of ETH as a security could cast doubt on the possibility of reaching this coveted milestone. He also points out a crucial detail that could temper expectations: some technical indicators suggest a potential slowdown in Ethereum’s (ETH) growth.\n\nEthereum (ETH): Updates, sentiments, and transactions\n\nEthereum (ETH) has exhibited significant growth while trading within the range marked with its support at $2,016 and resistance at $2,633. The ongoing price increase may be associated with the upcoming Dencun update aimed at increasing network scalability and stability.\n\nAdditionally, one of the main pieces of news was that Whale Alert flagged a series of sizable Ethereum (ETH) transactions totaling close to 240,000 ETH. These movements have piqued the interest of traders and investors alike, especially considering that the majority of these transfers were directed towards leading crypto exchanges. Such big movements often raise questions about potential market shifts and the intentions behind such transfers.\n\nAdding fuel to the fire, Prometheum is poised to make waves with its upcoming announcement of custody services for Ethereum (ETH). With ETH's market capitalization trailing closely behind Bitcoin at $280 billion, this move may serve as part of a larger effort by Prometheum to challenge regulatory perceptions and push for Ethereum (ETH) to be recognized as a security – a stance met with skepticism by industry peers.\n\nEthereum (ETH) technical analysis\n\nDespite a small pullback observed earlier in the week, the ETH price has shown good growth, but key technical indicators depict a mixed picture: the Accumulation/Distribution Indicator (ADI) sits at 30.06, indicating moderate buying pressure.\n\nDespite the bullish crossover, the MACD signal line at 8,83 remains slightly above the MACD line at 7.3. This suggests a potential bearish divergence if the signal line continues to diverge away from the MACD line, indicating weakening bullish momentum.\n\nEthereum (ETH) price prediction\n\nIn a bullish scenario, if Ethereum (ETH) manages to break above the resistance level at $2,633, it could signal further upside potential toward $2,983 and $3,600.\n\nConversely, in a bearish scenario, if ETH fails to hold above the support level at $2,016, it might trigger selling pressure, potentially pushing the price lower towards $1,750 and $1,134.\n\nWhat awaits Ethereum (ETH)?\n\nEthereum’s (ETH) recent surge past the $2,400 barrier has sparked both excitement and concern among investors. Ethereum’s (ETH) upward trajectory is supported by optimistic sentiments and bullish predictions from industry experts. However, according to Mike Ermolaev, the path forward is uncertain, with key technical indicators suggesting potential challenges ahead. As Ethereum (ETH) navigates these dynamics, attention will remain focused on its ability to maintain momentum and potentially breach the $3,500 mark. But it remains unclear what will happen if Ethereum (ETH) is indeed declared a security. There is reason to fear that this event could crash the indicators to historic lows."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxPQWRZaW1MdHBkVjJHeU9oUWZTM1JDM0l6R2dITEMzVUcyaFlBZFFzMEhNbm9BYm10MVhGNkpobEg3cHFITnczVlY1aFdZOUdMZERsSVh4UXdVRzBpMWFub3VpSXRWMmNDQTI5dXBZQ3dmRUJkaHBzb0Qxd29mS1g1SjhGZC1WcktNT2dkWlRQN2d4RXlMbDhnM05Za1RERFBIWjJDaHhRY2NMVDF3dVF2VjhhVXc2OEV0QzgydXROemtzanFQbEptTDYxTFM4Q0cxMldOY2VydWZROTBlY2RYeGZTMHd6ZVV0Rm8ycHBDenBBT3JvcW5B0gH8AUFVX3lxTE5YODRQZ3JiRXp6a1RUa2F4bTV2Sm9HRWtna2dSSFY2Tkw0cDJ1NXF0b2E1NDlUT1pEWWRHbmhvTk9CUGZVY21kcVBDeWY4WTFvbVc5S1JoR3ZQSmNFcHE0MU9tM2pjMk1zdlBpdTJWd3VyNXRtQ3c5Q2NIYXNXTGNvUlBKcGc4TWJYMnV4ZVY0cjFFQ01uOG5IdkJBaExrQi1KRW9jMko4cHRUeWZxaW9vVm56dWdrbUhoRzY4Q0pibFBxVTNfMk1FMkU4cWY4UHRldGt3dHdnSWV1QWh4VllXYzVrVHhOTzFEUHE0YmdqanZoZUh4UlUwYzh4UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC eyes $48,000 with Chinese Lunar New Year of the Dragon - FXStreet",
        "content": "Bitcoin price could hit $48,000 this weekend if BTC decisively closes above $45,451 mean threshold.\n\nEthereum price could reclaim $2,717 range high as ETH leads altcoin’s revival recourse.\n\nXRP could reclaim $0.5500 as Ripple price breaches midline of the descending parallel channel.\n\nBitcoin (BTC) price started moving after a prolonged consolidation, and with it Ethereum (ETH) and Ripple (XRP) prices. The general outlook is revival recourse, with markets flashing green as the Chinese Lunar Year of the Dragon sets in this weekend. It is a special year, representing strength.\n\n“We’re happy to do the Year of the Dragon, because it’s a very powerful year and very auspicious,” said local board member of the Organization of Chinese Americans, Anna Wong, adding, “and everyone feels lucky when they’re in the Year of the Dragon.”\n\nWith this optimism, crypto markets could rally this weekend as Chinese investors feel lucky.\n\nAlso Read: Bitcoin price shows strength as US BTC ETF flow percentage beats AUM in most regions\n\nBitcoin price could make it to $48,000 this weekend\n\nBitcoin (BTC) price has forayed past the midline of the supply zone at $45,451. The supply zone extending from $44,235 to $46,715 is an order block characterized by aggressive selling. If BTC manages to close above its midline, it could extend the gains to $48,000 this weekend, or in a highly bullish case, extend the gains to $50,000. Such a move would denote a 5% climb above current levels.\n\nThe Relative Strength Index (RSI) is northbound, pointing to rising momentum. The Moving Average Convergence Divergence (MACD) is also in positive territory with histogram bars flashing green to show a strong bullish wave.\n\nBTC/USDT 1-day chart\n\nConversely, with the RSI above 70, BTC is in overbought territory and a correction may be looming. Another threat to Bitcoin price upside potential is early profit-taking, which could see BTC fall back into the range between $40,650 and $43,750.\n\nIf selling pressure sends BTC all the way to $37,800, the cliff could see Bitcoin price roll over to $30,000, below which the bullish thesis would be invalidated.\n\nAlso Read: Bitcoin Weekly Forecast: BTC targets $52,000, will New Moon trigger a pullback first?\n\nEthereum price could reclaim its $2,717 range high\n\nEthereum (ETH) price is on a sustained uptrend, and could extend the climb past $2,600 to tag $2,717, levels last tested on January 12. This would constitute a 9% climb above current levels.\n\nThe RSI position at 63 shows there is more room in the north before ETH is overbought, with the inclination of the momentum indicator showing rising buying strength.\n\nThe MACD histogram bars are also green to show the strong presence of bulls in the market. Enhanced buyer momentum could see Ethereum price shatter past the range high to hit $2,800.\n\nETH/USDT 1-day chart\n\nOn the flip side, if traders start cashing in, Ethereum price could drop. While a break below $2,388 would harm ETH holders, the prevailing bullish outlook would only be invalidated if ETH crosses and closes below $2,280.\n\nAlso Read: Ethereum price tops $2,400 as 25% of ETH supply is staked and ETF applicants amend filings\n\nRipple price could take back $0.5500\n\nRipple (XRP) price has broken above the midline of the descending parallel channel. With momentum rising, XRP price could extend the gains 5% to the $0.5500 level. In a highly bullish case, the price could extend the climb, shattering the 50, 200 and 100-day Simple Moving Averages (SMA) at $0.5633, $0.5730 and $0.5970, respectively. This could lay the path for XRP to hit the $0.6000 psychological level.\n\nXRP/USDT 1-day chart\n\nOn the flipside, if the bears have their way, Ripple price could dwindle, potentially retesting the $0.4734 support.\n\nAlso Read: XRP Price faces threat of fall below $0.50 as XRPLedger AMM amendment is uncertain"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBGWjRsVWxUcGJHWnRYYUZDVy1tX0UtbFVJcU5EY1daR25UWW9TbGk0QkJZamRZampIU0I2enBQOTdYdTB5VWkzdXV1TXNfS1ZmNjdkcHBiMFV1bHBiSnBuYXZjNDlHVjNUSE5nQTVvblQ5ODRRX2040gF8QVVfeXFMT0dUbk9jUmp3eUxpU2ZhNTlVQWxZVUJSMDNVR3Y5bFBBZEJXU0VVN2c0OFR0TFNPdFRpX2ZwbERiMUkxYjF5ODl6NmVETDhmSDJhX1lNTFg1dlQ3SXBTQWhkNGljd2JWakZiZFNkb3NSSVJ0bmR0bm5LZmZoWA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Insider: China's ETH Stake 'Jeopardizes Crypto' - Bitcoinist",
        "content": "Steven Nerayoff, a former advisor to Ethereum, has publicly voiced concerns about the Chinese Communist Party’s (CCP) alleged dominance over the ETH blockchain. His comments, made on X (formerly Twitter), echo the investigative findings of TruthLabs, an on-chain sleuth.\n\nAccording to TruthLabs, the CCP is speculated to control approximately 66.6% of ETH supply. This claim, if accurate, presents significant implications for the decentralization, security, and regulatory standing of Ethereum.\n\nThe CCP has taken over Crypto by being Ethereum's largest hidden whale, with an ownership estimation on my end of near 66.6% of the Eth supply today. They've clearly compromised the SEC, and CFTC, with Prometheum being given the ONLY Special Purpose Dealer Broker license for… pic.twitter.com/C5eCrGUH7d — TruthLabs 🫡 (@BoringSleuth) February 8, 2024\n\nNerayoff’s statements bring to light the potential deep-seated vulnerabilities within the ETH ecosystem. The CCP’s stake in Ethereum jeopardizes the entire crypto world. It’s inevitable. Ethereum has vulnerabilities—that’s a fact. The SEC and other entities are compromised. We can’t ignore this; we must confront the corruption, hold key figures accountable, and keep advancing this constantly evolving industry,” Nerayoff stated, underlining the urgency of addressing these issues head-on.\n\nA focal point of these allegations is Prometheum, a company that recently received a Special Purpose Dealer Broker (SPDB) license from the US Securities and Exchange Commission (SEC), marking a controversial step towards potentially classifying Ether as a security. Nerayoff’s critique extends to this development, emphasizing the implications of such a classification.\n\n“Prometheum’s declaration of Ethereum as a security extends beyond regulatory semantics; it’s a move by entities with deep CCP ties, aiming to control the narrative and the crypto space,” he remarked, highlighting the strategic influence exerted by the CCP through entities like Wanxiang, which is deeply involved with Prometheum.\n\nIn his comments, Nerayoff also referenced TruthLabs findings about the SEC filings that underscore the pivotal role of Wanxiang in the operation and development of the Prometheum Network.\n\n“The company (Prometheum) uses Wanxiang (CCP) as their SOLE project developer and relies on Wanxiang’s ability to create and maintain a successful platform. The loss of the services of Wanxiang could have a material adverse effect on the ability of the Company to Develop, Operate, or maintain the Prometheum Network,” TruthLabs quoted, spotlighting the ties with China.\n\nIs Ethereum Really Infiltrated By China’s CCP?\n\nTruthLabs has been at the forefront of uncovering these unsettling dynamics, alleging that the CCP’s influence over Ethereum and entities like Prometheum could compromise the privacy and security of American citizens. The researcher’s analysis suggests that the CCP’s involvement enables direct access to sensitive information of US consumers, a claim that amplifies the call for scrutiny and accountability within the crypto industry and regulatory bodies.\n\nTune in at 1:10 and tell me @prometheuminc isn't eager to sell you their Wanxiang, deep CCP tied, Crypto. Why is Gary Gensler giving this company access to our markets, and to American consumers? How did this CCP front company get the only approval and US companies did not? Now… https://t.co/0FcfqHvv3i — TruthLabs 🫡 (@BoringSleuth) February 9, 2024\n\nMoreover, Nerayoff’s direct challenge to prominent Ethereum figures, including Vitalik Buterin and Joseph Lubin, underscores the gravity of the situation. “It’s undeniable now. Your day of reckoning approaches… Vitalik Buterin, Joseph Lubin, Ethereum Foundation,” he warned, signaling the need for a concerted effort to address and mitigate the alleged corruption and external influence that threaten the ethos and integrity of the Ethereum network.\n\nAs Bitcoinist reported, Nerayoff is currently preparing a fraud lawsuit with the help of TruthLabs against the Ethereum Foundation, Buterin and Lubin. It is not yet known when the lawsuit will be filed in a US court.\n\nOver the past few months, Nerayoff has made numerous serious accusations against the Ethereum founders and submitted an old audio recording as evidence. Neither the Ethereum Foundation nor Buterin or Lubin have yet commented on any allegations, something Nerayoff and TruthLabs interpret as an admittance of guilt.\n\nAt press time, ETH traded at $2,454.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNWDc5LW54cFRMQjkxZ2M1T3RpcWJaS0RKQms5WFlZRFJkMk9aN0tLVU9zNHkwVXpyX2dDUkJtMm9MMFplVmlYWWZjQUYzc3A0T25VMkVxQUhlT2lQN3g4aTFLWDhBd1FGbjBQbGxIQ21lc0tQWXJYVEpzQzdBYmdEeVBtWTZuZ0dNT2xmUlNkS2dHWmJoMTFydkp4Z2JwLUtaMDQwYkNxR2F6Um96ZklXNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Wrapped TAO on Ethereum soars to $82m — but it’s all controlled by one person - DLNews",
        "content": "The Wrapped TAO token on Ethereum is gaining popularity.\n\nBut the bridge that issues the token is controlled by a single person.\n\nThe bridge's creator stands to make $16 million in staking rewards over the coming year.\n\nCryptocurrencies tied with artificial intelligence projects have been some of the buzziest lately, and Bittensor and its native TAO token is the biggest of all by market value.\n\nA crypto bridge letting users send Bittensor’s TAO token to Ethereum has soared in popularity in recent months, as Ethereum users clamour for exposure to the buzzy AI token.\n\nThe bridge, which is community-run and independent of the project, now holds $82 million worth of TAO — all at the mercy of one person.\n\nOnchain records analysed by DL News show that the bridge creator must sign off every time someone holding wTAO on Ethereum wishes to redeem it for TAO tokens on the Bittensor network.\n\nIn DeFi, permissioned bridges are unusual. It means one individual or entity has total control over funds deposited into the bridge.\n\nThe pattern of these onchain movements is further explained through chat records in the project’s official Discord server, a messaging app.\n\n“Verification happens at least once a day morning/night or whenever I see a [transaction] come through,” CreativeBuilds, the pseudonymous developer who built the bridge said in the Bittensor Discord on July 9.\n\n“Withdrawals are verified manually but automatically processed once verified,” CreativeBuilds said.\n\nJoin the community to get our latest stories and updates\n\nDL News attempted to contact CreativeBuilds for comments on Discord and via email but has not heard back.\n\nUsually, developers use smart contracts to shift control of crypto bridges from humans to immutable computer code.\n\nBut the Bittensor network cannot handle smart contracts, making it difficult to create a bridge that functions in this way. This bridge was set up by CreativeBuilds, independently from those developing the Bittensor network.\n\nBittensor says it is transforming machine learning by decentralising it, creating a global marketplace for AI knowledge. It enables AI models to share intelligence, forming a digital collective brain.\n\nThe Tao Bridge\n\nThe Tao Bridge works by letting users deposit TAO tokens on the Bittensor side, and issuing Wrapped TAO — or wTAO for short — on Ethereum, which represent the TAO held in the bridge.\n\nIn the context of crypto bridges, wrapped tokens are placeholder tokens which represent tokens held by a bridge.\n\nBittensor’s TAO token has a maximum supply of 21 million tokens and thus the same tokenomics as Bitcoin. As with Bitcoin, there is a halving of the token rewards every four years. The current circulating supply amounts to 6.2 million TAO.\n\nThe project uses a proof-of-stake validation mechanism, meaning the network is secured by TAO holders staking their tokens. Currently, 89% of the supply is staked and the staking yield, paid in TAO, sits at 15.99% annually. For those who run their own staking validator, yields increase to 19.49%.\n\n$16 million a year\n\nOnchain data from TaoStats shows that 150,000 TAO tokens held in CreativeBuilds’ bridge are staked through a connected validator, earning a nearly 20% yield.\n\nIn Discord posts from January 2023, CreativeBuilds said he had been “very clear” about the fact that the funds were staked, and said the staking yield would be used to “to offset the cost of bridge [transactions].”\n\nWith some 150,000 TAO deposited into the bridge, its owner is set to earn around 29,250 TAO over the coming year. If TAO continues to trade at its current value of $550 per token, this haul will be worth over $16 million.\n\nIn the same Discord posts from January, CreativeBuilds said he would “create a system which passes through the rewards to an onchain contract in which users can stake wTAO and receive rewards.”\n\nThe Tao Bridge website does not appear to link to such an onchain staking contract.\n\n‘Just want to make sure it’s safe’\n\nSince October, TAO has rallied 990% amid a broader ETF-fueled rally in crypto assets.\n\nBittensor's TAO token has surged in recent months.\n\nAs the only option to buy the TAO token without using a centralised crypto exchange, the Tao Bridge has surged in use. Since October, the amount of wTAO issued on Ethereum through the bridge has almost tripled.\n\nMany users appear to trust the bridge due to CreativeBuilds’ active role in the Bittensor community.\n\nSome are still wary.\n\nThe Tao Bridge’s code is closed-source meaning that other users and developers cannot check it for bugs, or make sure it does what it is advertised to do.\n\n“Can’t find anything on the team behind it. Are they doxxed? It’s way easier to purchase and store wTao for me. Just want to make sure it’s safe,” said one user in the Bittensor Discord posting under the name The_1Legend.\n\n“The team is me and no I’m not doxxed,” CreativeBuilds replied.\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Ryan Celaj is DL News’ New York-based Data Correspondent. Reach out with tips at tim@dlnews.com and ryan@dlnews.com."
    }
]