[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOeWtSY1lqdU0wczcyZFk4NFdOQzk2bDhZQ3NsNUp0bFY5bi1PMGJzQXdqbEE2UjJ2OWl3T1pKa2NfU2hCc1M2LXBDS0xJMDdhNUhBLWd1ZWtVWGtkN2tCSU9DRGduRDc5N1hudUlGSzBrYUxRYmZucnpzdG1abzduaHRUQdIBiAFBVV95cUxQZEJ1MHZ1Qm9ZeGR4UHc1c1M2bXVjVy1qclRrMS1pTm1HZ0FtTnpSeGtZODdIOWhmM19yQ3dyM0h1enZPME50QXVnMjczNlBObl9IUno1d0F2VU03aVZqUUh6UzVGc3RMWjNPeU5UTjItU25PVlZlQTNaaklkTlJESjVzR052dU4y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Coinbase Sees Over $1 Billion Ethereum Outflow - What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nIn a significant development on the crypto market, crypto exchange Coinbase has witnessed the largest Ethereum (ETH) outflow of the year, amounting to over $1 billion. This massive movement, reported by CryptoQuant, has sparked discussions and speculations about its potential implications for ETH and the broader market.\n\nCryptoQuant's data reveals that more than 336,000 ETH were withdrawn from the trading platform, totaling an approximate value of $1.17 billion on June 12, 2024. This event marks the fifth instance in 2024 where withdrawals from Coinbase have exceeded 150,000 ETH. The range of these transactions has varied from $400 million to $1.1 billion, indicating the involvement of substantial market participants.\n\nWho's behind withdrawals?\n\nThe scale and frequency of these withdrawals suggest that they are not driven by individual Ethereum traders . Instead, the transactions are likely the actions of whales or unknown institutional players. This assumption aligns with the observation that such large-scale movements are typically beyond the capacity of retail traders and are more characteristic of significant entities with major holdings and strategic market positions.\n\nThe exact reasons behind this enormous withdrawal remain speculative. However, historical patterns and market behaviors provide some insights. Similar large-scale withdrawals were observed on Coinbase for Bitcoin (BTC) before the launch of Bitcoin spot ETFs earlier this year. This has led to speculation that the current ETH outflow might be driven by anticipation of potential Ethereum spot ETFs in the near future.\n\nAdvertisement\n\nPositive indicators for long term\n\nIf these withdrawals are not merely internal movements by the exchange, they could signal a positive indicator for Ethereum's long-term prospects. Reducing the circulating supply of ETH, particularly in such large quantities, can create scarcity, leading to upward pressure on its price. This supply-demand dynamic is a fundamental principle on asset markets and is especially pertinent on a volatile and sentiment-driven crypto market."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNSk9xaGZzWEdKQnpyNXQySlFobmpULTNjNmg0aE1rUUZDR0ZsaDlVTFhRT1NaeDBvVWhaclRybFRsVGpnMFpBN1VSSTVSZTNWYUthSS1DM3BycE9lTzBxM2xjb05BTUtrZERodTNNSkdDbU53bDRPNnJqNlhQZGhFQ1BUMDBRQdIBjgFBVV95cUxPOFZjX193Ri1FWndDUnhPeEt2OXF4d3AyRW1aaHAybzZ3cE1PSjExVHdyVEw5Rm5NV3BCRmdUOHJEUkxpbG5iZGZiTWxSbGw2OUJ1RTI5LU90dWhKSFNIcUVVai1rVnpGSG96ZWludUp5bTBmR0V5OTNKdFdqUy16czhxTjI3TmVKQ1hyaVN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Prices Pop as US Inflation Growth Slows - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe prices of Bitcoin and other leading cryptocurrencies popped Wednesday after a widely watched inflation gauge showed that U.S. consumer prices increased last month by less than economists had expected.\n\nThe Consumer Price Index (CPI) rose 3.3% in the 12 months through May, the U.S. Bureau of Labor Statistics said Wednesday, coming in slightly below economists’ forecast of 3.4%. Previously, the index tracking American goods and services showed that consumer prices rose 3.4% annually.\n\nImmediately following the report’s release, Bitcoin jumped 2.8% to around $69,500 from $67,900. Other cryptocurrencies, including Ethereum and Solana, showed gains of over 3% over the past day, but their prices had still fallen over the past week after Friday’s flash crash.\n\nMeanwhile, the S&P 500 and tech-heavy Nasdaq Composite opened in the green. The move came just hours before the Federal Reserve’s June policy meeting, where the U.S. central bank is expected to hold its benchmark interest rate steady for an 11th straight month.\n\nAD\n\nAD\n\nAs the Fed’s decision loomed, Bitcoin is nearing a price of $70,000 as of this writing, showing gains of over 4% over the past day, according to CoinGecko.\n\nOn a month-to-month basis, U.S. inflation was flat. The reading followed a 0.3% bump in consumer prices in April and a 0.4% increase in March and February.\n\nWhile investors had already anticipated that Fed policymakers would leave interest rates untouched Wednesday, rate cut hopes for September strengthened, however. That chance rose after the report’s release to 62% from 46%, according to the CME Group’s FedWatch Tool.\n\nLikely delivering a boost to the U.S. economy through lower borrowing costs, Fed Chair Jerome Powell said last month that policymakers need “greater confidence” that inflation is heading to its target of 2% annually before loosening monetary policy through rate cuts.\n\nAD\n\nAD\n\nShifting rate cut expectations dented Bitcoin’s price in April, knocking the cryptocurrency away from all-time highs above $73,000 a month prior. However, analysts say Bitcoin could test those prices again as a path toward rate cuts emerges with more certainty and a weaker U.S. dollar.\n\n“At this point, my confidence in Fed rate cuts is pretty high,” Grayscale's Head of Research Zach Pandl said on Twitter (aka X), adding that rate cuts becoming a base case again is good for the strength of Bitcoin relative to the dollar in a separate post.\n\nLow Core CPI inflation in May => Fed rate cuts again the base case => bad for Dollar, good for Bitcoin $BTC pic.twitter.com/2Ntlfl3iJs — Zach Pandl (@LowBeta_) June 12, 2024\n\nMarkets largely shrugged at hotter-than-expected U.S. job growth last Friday. Still, hours after the figures were released, Bitcoin plunged alongside the rest of the crypto market, causing hundreds of millions of dollars worth of liquidations in leveraged crypto positions.\n\nOn Wednesday, the dollar value of liquidated positions was comparatively muted. Within the past four hours, $10 million worth of crypto long positions have been purged, while bearish traders saw $39 million worth of short positions be closed, per data from CoinGlass.\n\nEdited by Andrew Hayward\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOaGlyVVo3U2thNE50T09ocUM5MW9wTldKdFNuSmp0SlZJWTJubW5pMzNzVk1lOFpKMHpyblJzSVJEcF9NYmNnX2J4NU1YNXhKcnRYaGMySXlBanluUzU1TkQ5elNXWmotSzJXVkJGMmZpQXNkcWEwdmc3VFB2bjF2dGw0VU5HVWtRUUtyM1ZOTDF4cV9tZVZlS0FMM1N6dzNKcFlvTDdYV09uMWI1Sm1DQ2czUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "How MetaMask says it can beat cheaper rivals as it widens Ethereum offering - DLNews",
        "content": "MetaMask users can now stake small amounts of Ether through the wallet.\n\nThe new offering charges higher fees than market leader Lido.\n\nMetaMask is going all in on the $116 billion market in Ethereum staking.\n\nConsensys, the firm behind the top crypto wallet, announced Wednesday the launch of Pooled Staking, a new offering that will let those with small amounts of Ether pool their tokens and earn staking rewards.\n\n“It’s a simple way to be rewarded for contributing to the security of Ethereum,” Matthieu Saint Olive, a senior product manager at Consensys, told DL News. “This solution will be competitive.”\n\nPreviously, only users with 32 Ether could stake through MetaMask.\n\nThe Pooled Staking launch puts MetaMask on an equal footing with other staking providers that accept small amounts of Ether for staking.\n\nBut it could be an uphill battle for MetaMask to break into this highly-competitive market.\n\nSaint Olive said MetaMask will charge Pooled Staking users 15% of their staking rewards for its service — much higher than leading Ethereum staking provider Lido’s 10%.\n\nThe market for Ethereum staking is huge. Almost 33 million Ether tokens worth $116 billion are staked on the blockchain, earning at least 3.1% per year, paid in Ether.\n\nJoin the community to get our latest stories and updates\n\nLido dominates the market, accounting for almost 29% of all Ether staked.\n\nLido dominates the Ethereum staking market. (Dune Analytics/@hildobby)\n\nBy providing a more accessible option to MetaMask users, Consensys is hoping its Pooled Staking feature can compete against dozens of other options, many of which, like Lido, offer lower fees.\n\nStaking fees\n\nStaking on Ethereum is complex.\n\nIt requires in-depth technical knowledge, a stable internet connection, and a minimum of 32 Ether — worth $113,000. Mistakes can cause significant financial losses.\n\nBecause of this, many Ethereum users choose to stake through a third party provider.\n\nStaking providers usually take a percentage of rewards — between 10% and 25% — in exchange for helping their users stake.\n\nAt the low end, Lido, Binance Staked ETH, and Mantle Staked ETH charge a 10% fee on staking rewards.\n\nCoinbase’s Wrapped Staked ETH sits on the high end, charging 25%.\n\nMetaMask’s 15% Pooled Staking fee, Saint Olive says, falls somewhere in the middle.\n\n“Users care more about the rewards they actually receive, and how secure the solution is, rather than the provider fee itself,” Saint Olive said.\n\nSecurity and convenience\n\nThe new offering may appeal to more casual crypto users because of its convenience.\n\nMetaMask users can start staking their Ether via the wallet’s interface.\n\nHowever, MetaMask also gives users the option to stake through rival staking providers Lido and Rocket Pool — both of which offer lower staking fees — through the same interface.\n\nAs for security, Pooled Staking will use the same staking system used by Consensys Staking, the firm’s enterprise-grade staking product.\n\nConsensys says it has received third-party security certifications for both Consensys Staking and MetaMask.\n\nConsensys Staking has 33,000 Ethereum validators with more than 1 million Ether staked, equivalent to 3.3% of all staked Ether, according to the Pooled Staking announcement.\n\nEven so, it says it has never had one of its validators get slashed.\n\nSlashing is when the Ethereum network takes Ether from validators who don’t publish data when they are supposed to, or don’t publish the correct data.\n\nIn November, Bitcoin Suisse, a company that provides staking services for institutional clients, suffered a $200,000 loss after nearly 100 of its validators were slashed for trying to publish incorrect data.\n\nIn October, 20 of Lido’s validators were also slashed, costing the protocol $45,000.\n\nTim Craig is a DeFi Correspondent at DL News. Got a tip? Email him at tim@dlnews.com."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNdUZaRGdZOWJtVllnWFdOOHZzeWJXb0JzbkJwdlVjUldUeHcxVFRBV2RPSUpuUmhDMUZMS2hpanhMNVJxTE9zcXYtQ1RhRE1rUUUwYXJhSTdXWjdXYjM5WE1fVERXZEowMUNwSE5FdVBMbWdVclNTTnJqS19RWFAxLXFWaDBVUENRYTM2Qjdn0gGWAUFVX3lxTFBRd1BrZ0ZaRDlWYkJXWEJJMVRJQ1RSS0pSNU0tUHd2RkUxbHhlWGRiWWprV0t4UmhGOW0xM3RvNjZQMWdkeHdFdDVQdzdKaDNtZnZDenBTS3E4RDQ1bzhyMFBfUTItaDJRT2d4VW1lM1JEdHpHSG9YQ3V5WU9TSEpvcDJfNkJqMW5HNVRDbUViMm50R0l1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Prices Dip as Fed Signals One Rate Cut Ahead in 2024 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCryptocurrency prices wavered Wednesday as investors parsed commentary from the Federal Reserve that provided new insight into the U.S. central bank’s fight against inflation.\n\nPolicymakers’ move to leave interest rates unchanged for an 11th consecutive month was a foregone conclusion, based on movements in Fed futures markets. At its most restrictive position in over 20 years, the Fed kept its benchmark borrowing rate at a range between 5.25% and 5.50%.\n\nThis month’s release of a so-called “dot plot,” however, suggested shot callers at the U.S. central bank have seen a notable shift in financial conditions since March. The Fed in its most recent Summary of Economic Projections had penciled in three rate cuts through years-end.\n\nThe dot plot released Wednesday suggested Fed policymakers now think one rate cut could be more appropriate—interpreted by the market as a hawkish sign. The projection went beyond the two rate cuts that economists had expected the Fed could telegraph, as it looks to keep rates higher for longer in the face of a strong economy and U.S. labor market.\n\nAD\n\nAD\n\nCryptocurrency prices had risen earlier in the day on news that inflation had slowed to 3.3% in the 12 months through May. The report indicated that consumer prices for American goods and services rose slightly less last month than economists had expected.\n\nFollowing the Fed’s announcement, Bitcoin and other cryptocurrencies fell. Just 15 minutes after the Fed’s move, for example, Bitcoin’s price swiftly fell 1.2% to around $69,000 from $69,900. Meanwhile, the prices of Ethereum and Solana also ticked down at similar rates.\n\nThe Fed has maintained in recent months that it will not cut rates until it has “gained greater confidence that inflation is moving sustainably toward 2%.” Federal Reserve Chairman Jerome Powell affirmed that stance on Wednesday and said, “So far this year, the data have not given us that greater confidence.”\n\n“Recent indicators suggest that economic activity has continued to expand at a solid pace,” Powell added in a statement. “In recent months, there has been modest further progress toward the Committee’s 2% inflation objective.”\n\nAD\n\nAD\n\nBefore the conclusion of the Fed’s policy meeting, futures traders penciled in a 61% chance that the Fed cuts rates in September, likely delivering a boost to the U.S. economy through lower borrowing rates. That figure fell to 59% following the release of Powell’s written remarks.\n\nNot long before U.S. inflation peaked at 9.1% in June 2022, the Fed began lifting interest rates from near-zero to cool a red-hot economy. While inflation has come down significantly since then, Powell affirmed Wednesday that the U.S. central bank’s quest to 2% isn’t over yet.\n\nPowell pointed to Wednesday’s Consumer Price Index report, where inflation was flat on a month-to-month basis in May, as a sign of potential progress. “Let me say that we welcome today's reading and hope for more like that,” he said.\n\n“The Committee would be prepared to adjust the stance of monetary policy as appropriate if risks emerge that could impede the attainment of the Committee’s goals,” Powell added, of which one is “maximum employment” among U.S. workers.\n\nThe price of so-called risk assets, including stocks and crypto, typically face pressure as interest rates rise and the payouts on holding cash and U.S. Treasuries become more attractive. Investors anticipate the opposite would happen as the Fed loosens U.S. monetary conditions.\n\n“We can't know what the future holds, but in the meantime, we've made pretty good progress on inflation with our current stance,” Powell said, adding that the Fed is looking for a gradual decline in inflation and greater balance in the labor market. “We’re making good progress here.”\n\nEdited by Andrew Hayward\n\nEditor's note: This story was updated after publication to add a further quote from Powell.\n\nAD\n\nAD"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQT0ZiRmk5MU5nN1VZNjdlUThhXzNyVlNqcGtGZW82LWlDdjQ2T25tX2U4VUxrVkRpYXotcDFlWGdaei1sOV9vcy1GQTN1dE1mTzFtV0tsdGc5QS1lVWFCZGRhMlA5Y1NvdVhjcXJJSUNNU2VZNlRZZWhCbVREMkpfWlNlSkRlSlFaQURrN2FGRWp6RVkzNXN5WjZZREdNUFYzSktNdU1ZY0dfeGtXY2pTNG1UMHk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jun 2024 07:00:00 GMT",
        "title": "Could Telegram-Associated TON Blockchain Be the 'Next Solana' and Challenge Ethereum? - Unchained",
        "content": "While lagging behind Solana, TON’s daily active addresses have exceeded Ethereum’s figures every day except for one thus far in June. Some believe TON could close the distance in market cap with Solana.\n\nThe price of TON has increased nearly 392% to around $7.40 in the past year, making its market cap stand at $18 billion.\n\nThe Open Network (TON) Blockchain is showing signs it may be the next Solana by virtue of challenging the historical smart contract leader, Ethereum.\n\nDriven by Telegram’s crypto wallet built into every app and the rampant play of mini-games, the TON blockchain has surpassed Ethereum in daily active addresses every day in June except one, a sign of growing popularity for the network connected to Telegram, the popular messaging application with more than 900 million monthly active users.\n\nAccording to blockchain analytics firm Artemis, TON has averaged 465,200 daily active addresses in June with a high of 568,300 on June 3, levels Ethereum has not crossed as the latter has yet to see more than 400,000 daily active addresses on its base layer in the month, excluding its various layer 2s.\n\n“For early ecosystems such as TON, we believe [daily active users] is a better metric to watch than [total value locked] or fees, as gathering users is a higher priority than making money,” wrote Kelly Ye, portfolio manager at liquid venture firm Decentral Park Capital, in her weekly newsletter published on May 20.\n\nDespite having higher levels of daily active addresses than Ethereum, TON’s growing figures still dwindle in comparison to Solana’s which has averaged roughly 1.64 million daily active addresses in June.\n\n“TON is good for the blockchain industry as data shows it’s adding net new activity,” wrote Andrew Van Aken, a data scientist at Artemis, in a Telegram message to Unchained. “Daily active addresses on both Solana and TON have increased over the course of the year, indicating TON is onboarding new addresses.”\n\nTON’s Opt-Out Wallet Launches With Massive User Base\n\nTelegram’s built-in community aided by its in-app crypto wallet has helped propel TON’s level of daily active addresses to where it is currently, argued Jehan Chu, an investor in the TON ecosystem and managing partner of blockchain venture capital firm Kenetic.\n\nThe native crypto wallet in Telegram is “an opt-out wallet, which means other than the 30 or 40 million US users who are geoblocked, the other 860 million Telegram users all have a crypto wallet natively [and] automatically,” Chu said in a conversation with Unchained. “Let that sink in… That is Thanos-level kind of change.”\n\nTelegram has been able to scale its technology as well as the onboarding of its large user base through the official rollout of Telegram’s crypto wallet, launched in Sept. 2023. “What’s interesting about this is it’s not really about wallets. It’s about the seamless integration of web3 technology into where users already are,” namely messaging, “one of the highest traffic destinations for users on a daily basis,” said Chu.\n\n“99.999% of blockchain projects are a tech idea trying to create a community – from nothing. According to CoinMarketCap there are more than 23,000 cryptocurrencies. That’s a hard road for most,” wrote Dan Morehead, CEO of crypto-focused venture firm Pantera, in the company’s May announcement about how TON was its largest investment ever. “Telegram is a community [of over 900 million users] integrating blockchain technology. That’s just got to be easier.”\n\nPantera, which has $4.7 billion in assets under management, cited other reasons in its rationale for investing in TON, including its values as a neutral platform independent of state influence and easy onboarding process.\n\nGames Drive Record Levels of Activity\n\nWhat has driven the recent surge in activity is another factor that led Pantera to its massive investment: an ecosystem of mini-applications which include chatbots and games. Referring to Telegram’s increased levels of daily active addresses, Chu said it arose from “a combination of things – obviously, games are a big driver.” A number of mini-games within Telegram have attracted substantial attention from its users, such as Notcoin, Hamster Kombat, and Catizen.\n\nNotcoin, a free game on Telegram where over 35 million users have tapped their screens to earn tokens, rolled out its cryptocurrency in May and has since garnered a market cap of $1.6 billion, data from CoinGecko shows. Similarly, Hamster Kombat has nearly 33.6 million subscribers in its Telegram channel, while Catizen has over 3.6 million users.\n\nBloomberg also reported on Tuesday that many in the crypto space believe this trend of mini-games in Telegram “could be the ‘killer app’ that will define the current bull market.”\n\nWhile they don’t interact with the TON blockchain, popular trading bots such as BONKbot native to Solana and Banana Gun, which is on Ethereum, depend on Telegram to generate fees from enabling crypto users to trade on their mobile devices. Telegram also has trading bots for the TON blockchain, such as sTONks and TOB Bot.\n\n“We believe that similar TON-native Telegram bots will become the preferred user experience for many traders,” according to Ryan Barney, a partner at Pantera.\n\nThe price of TON has increased nearly 392% to around $7.40 in the past year, bringing its market cap to $18 billion. Despite outpacing the two largest cryptocurrencies by market cap, BTC and ETH, TON’s price performance this last year is not as strong as Solana’s, whose native token soared 860% in the same period to a market cap of more than $68 billion.\n\nAccording to Decentral Park Capital’s Ye, TON has solid potential “to close the gap in market cap with Solana this cycle.”\n\nCorrection (June 13, 2024 11:14 A.M. EST): The previous title erroneously referred to TON Blockchain as belonging to Telegram. Following the SEC’s ruling, Telegram has no relationship with The Open Network (TON) Blockchain, which is now stewarded by the TON Foundation. Unchained regrets the mistake."
    }
]