[
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNbFNWeUV6U2ZERkVwWktTaGQ0QUVTa0xSVUQ2bGNCUUpHTGFxRjJJbVExYmpfUEdtM09RX1FrOVRzMlFGRW1mZmhoV2VERTRpcXNWSTAydWxnSGQ0U2RTSHdSNTZRT2gxbTNBQWpEV1VCQW1CLVhSTmFMa3ZaYXFaMUEzc3lINjhEckx5aVVBQkNNUXczNnJXQXNNQ1NPXzRrU2xPTURka0Y5OU1LN1lLNWR0MHliVnlpRFN0NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "SEC Chair Gensler Says Ethereum ETF Review 'Going Smoothly' - Benzinga",
        "content": "U.S. SEC chair Gary Gensler highlighted on Tuesday the smooth progress of Ethereum ETF filings, indicating that the final decision lies with asset managers to make full disclosures for the registration statements to go effective.\n\nSpeaking at the Bloomberg Invest Summit, he said, “I don’t know the timing, but it’s going smoothly,” when asked about the possibility of seeing an Ethereum ETH/USD ETF in the coming weeks.\n\nHe elaborated, “It’s really about the asset managers making full disclosure so that those registration statements can go effective.”\n\nThe SEC chair noted Ethereum futures ETFs are already available, having gone live last year.\n\nHowever, the potential introduction of a spot Ethereum ETF has generated significant excitement in the crypto community and financial markets.\n\nGensler was also asked about the increasing political discourse surrounding cryptocurrency, particularly comments from former President Donald Trump.\n\nAlso Read: Congressman Matt Gaetz Introduces Bill To Allow Federal Tax Payments In Bitcoin\n\nIn response to whether this political momentum surprises him, Gensler reiterated his role as a securities regulator, focused solely on protecting investors and ensuring market integrity.\n\n“I don’t speak about elections,” when questioned about the intersection of cryptocurrency and the upcoming presidential election, when asked about former President Trump's increasing support for cryptocurrencies and criticisms from figures such as Mark Cuban.\n\n“I just really look, my role as a securities regulator, as chair of this great 5,000-person agency that oversees $120 trillion capital markets. We are here to look out for investors, look out for issuers, and, where appropriate, to be a cop on the beat,” he stated.\n\nRepublican presidential candidate Trump has been vocal in his support for cryptocurrency, promising to advocate for Bitcoin mining and to accept political donations in crypto.\n\nAt a recent event at Mar-a-Lago, Trump criticized President Joe Biden’s stance on digital assets, vowing to end what he termed Biden’s “crusade to crush crypto.”\n\nRead Next: FTX Faces Customer Backlash Over Proposed Liquidation Plan\n\nPhoto: Shutterstock"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNbFNWeUV6U2ZERkVwWktTaGQ0QUVTa0xSVUQ2bGNCUUpHTGFxRjJJbVExYmpfUEdtM09RX1FrOVRzMlFGRW1mZmhoV2VERTRpcXNWSTAydWxnSGQ0U2RTSHdSNTZRT2gxbTNBQWpEV1VCQW1CLVhSTmFMa3ZaYXFaMUEzc3lINjhEckx5aVVBQkNNUXczNnJXQXNNQ1NPXzRrU2xPTURka0Y5OU1LN1lLNWR0MHliVnlpRFN0NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "SEC Chair Gensler Says Ethereum ETF Review 'Going Smoothly' - Benzinga",
        "content": "U.S. SEC chair Gary Gensler highlighted on Tuesday the smooth progress of Ethereum ETF filings, indicating that the final decision lies with asset managers to make full disclosures for the registration statements to go effective.\n\nSpeaking at the Bloomberg Invest Summit, he said, “I don’t know the timing, but it’s going smoothly,” when asked about the possibility of seeing an Ethereum ETH/USD ETF in the coming weeks.\n\nHe elaborated, “It’s really about the asset managers making full disclosure so that those registration statements can go effective.”\n\nThe SEC chair noted Ethereum futures ETFs are already available, having gone live last year.\n\nHowever, the potential introduction of a spot Ethereum ETF has generated significant excitement in the crypto community and financial markets.\n\nGensler was also asked about the increasing political discourse surrounding cryptocurrency, particularly comments from former President Donald Trump.\n\nAlso Read: Congressman Matt Gaetz Introduces Bill To Allow Federal Tax Payments In Bitcoin\n\nIn response to whether this political momentum surprises him, Gensler reiterated his role as a securities regulator, focused solely on protecting investors and ensuring market integrity.\n\n“I don’t speak about elections,” when questioned about the intersection of cryptocurrency and the upcoming presidential election, when asked about former President Trump's increasing support for cryptocurrencies and criticisms from figures such as Mark Cuban.\n\n“I just really look, my role as a securities regulator, as chair of this great 5,000-person agency that oversees $120 trillion capital markets. We are here to look out for investors, look out for issuers, and, where appropriate, to be a cop on the beat,” he stated.\n\nRepublican presidential candidate Trump has been vocal in his support for cryptocurrency, promising to advocate for Bitcoin mining and to accept political donations in crypto.\n\nAt a recent event at Mar-a-Lago, Trump criticized President Joe Biden’s stance on digital assets, vowing to end what he termed Biden’s “crusade to crush crypto.”\n\nRead Next: FTX Faces Customer Backlash Over Proposed Liquidation Plan\n\nPhoto: Shutterstock"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNbFNWeUV6U2ZERkVwWktTaGQ0QUVTa0xSVUQ2bGNCUUpHTGFxRjJJbVExYmpfUEdtM09RX1FrOVRzMlFGRW1mZmhoV2VERTRpcXNWSTAydWxnSGQ0U2RTSHdSNTZRT2gxbTNBQWpEV1VCQW1CLVhSTmFMa3ZaYXFaMUEzc3lINjhEckx5aVVBQkNNUXczNnJXQXNNQ1NPXzRrU2xPTURka0Y5OU1LN1lLNWR0MHliVnlpRFN0NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "SEC Chair Gensler Says Ethereum ETF Review 'Going Smoothly' - Benzinga",
        "content": "U.S. SEC chair Gary Gensler highlighted on Tuesday the smooth progress of Ethereum ETF filings, indicating that the final decision lies with asset managers to make full disclosures for the registration statements to go effective.\n\nSpeaking at the Bloomberg Invest Summit, he said, “I don’t know the timing, but it’s going smoothly,” when asked about the possibility of seeing an Ethereum ETH/USD ETF in the coming weeks.\n\nHe elaborated, “It’s really about the asset managers making full disclosure so that those registration statements can go effective.”\n\nThe SEC chair noted Ethereum futures ETFs are already available, having gone live last year.\n\nHowever, the potential introduction of a spot Ethereum ETF has generated significant excitement in the crypto community and financial markets.\n\nGensler was also asked about the increasing political discourse surrounding cryptocurrency, particularly comments from former President Donald Trump.\n\nAlso Read: Congressman Matt Gaetz Introduces Bill To Allow Federal Tax Payments In Bitcoin\n\nIn response to whether this political momentum surprises him, Gensler reiterated his role as a securities regulator, focused solely on protecting investors and ensuring market integrity.\n\n“I don’t speak about elections,” when questioned about the intersection of cryptocurrency and the upcoming presidential election, when asked about former President Trump's increasing support for cryptocurrencies and criticisms from figures such as Mark Cuban.\n\n“I just really look, my role as a securities regulator, as chair of this great 5,000-person agency that oversees $120 trillion capital markets. We are here to look out for investors, look out for issuers, and, where appropriate, to be a cop on the beat,” he stated.\n\nRepublican presidential candidate Trump has been vocal in his support for cryptocurrency, promising to advocate for Bitcoin mining and to accept political donations in crypto.\n\nAt a recent event at Mar-a-Lago, Trump criticized President Joe Biden’s stance on digital assets, vowing to end what he termed Biden’s “crusade to crush crypto.”\n\nRead Next: FTX Faces Customer Backlash Over Proposed Liquidation Plan\n\nPhoto: Shutterstock"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOeDc0UDM0cGt3cW1wTGt1ek9TT0FNT3RCa3ZydHN5Yi1paURUWkFyWEJxMEU1azZFa3ZRSEM5bjFHXzVCdHpKY0F3S0xMQTdGSlB3SWM2a09BbEZQdlBFcTlRMF84bGk2LWpWTXVFTy1hcmhHRlpJWWtzYXB1VWZoeHdnbVdmT0JHS25VWkpEdUh0MWJyX2xneE9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF update: Speaking at Bloomberg Invest, CFTC chair Gary Gensler says application is ‘going smoothly’ - Fortune",
        "content": "Securities and Exchange Commission Chairman Gary Gensler betrayed impatience upon fielding questions from reporters about crypto, including his agency’s handling of applications to launch Ethereum ETFs. In speaking with journalist Annmarie Hordern at the Bloomberg Invest event in New York on Tuesday, Gensler accused his interviewer of going after “clicks” after she asked him several questions related to crypto policy.\n\nThe issue of cryptocurrency ETFs has been contentious during Gensler’s SEC tenure, most notably when a federal appeals court last year rejected the agency’s decision to refuse applications for a Bitcoin ETF. The court ruling led the SEC to approve those Bitcoin applications in January and, despite initial signals from Gensler that the Ethereum petitions would be rebuffed, the agency more recently indicated it would grant them.\n\nThe agency’s apparent change of heart has led to ongoing speculation about how long the process will take. Despite his grumblings, Gensler—a noted crypto opponent—offered a few details.\n\n“I don’t know the timing, but it’s going smoothly.” He elaborated that his team is waiting for asset managers to make “proper disclosures.”\n\nGensler’s comments came after SEC filings from this spring suggested that the agency may have adopted the position that Ethereum was a security for more than a year.\n\nGensler also made a point to clarify that an ETF trading Ethereum futures has already been approved. Last October, the SEC approved futures ETF applications for Valkyrie Investments, VanEck Funds, Proshares, Bitwise Asset Management, and five others. The pending spot ETF applications would give investors direct exposure to the asset via regulated exchanges.\n\nOnce heralded as a supporter of crypto by many who saw his tenure teaching a course on the subject at MIT as an endorsement, Gensler has come down hard on the industry over the past few years. Last year alone, the regulator brought 46 enforcements against crypto-related firms, according to a Bloomberg report.\n\nGensler juxtaposed the 11 Bitcoin ETFs the SEC approved this year, which are currently trading on regulated markets, with what he called the “non-compliant model,” or exchanges that also knowingly trade non-compliant securities. “It’s about real protections for investors and for other people that want to access the capital markets,” said Gensler. It’s about trust in those markets.”\n\nGensler declined to answer a question about reports that his stance on crypto might cost Joe Biden, who appointed him, the election. “My number one priority is the American public,” said Gensler. “That’s the client, and so that’s who we represent.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE1vYklBNVZZRlkxWm1YNk16SS01Z05wRWJBZmhKMGw0dVN6bmEydkRlakpJbXZaVllyOXNKY3pLNXktYWxTajlBcnBPRkNtZjdWcnl0MkhyaV9kc2VQeW9LYU85NXcxSXpKalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Cega Shark Bull vaults on Ethereum and Arbitrum combine stability with high returns - Blockworks",
        "content": "The promise of guaranteed high yields with downside protection is often a red flag when navigating a sea of DeFi app marketing speak.\n\nYields are often exaggerated while risks get buried. It’s easy to promote sky-high APRs when you print your own token to fund temporary incentives.\n\nIn the offchain financial world, however, there is such a wild beast emerging from the depths: Shark Fin notes.\n\nDeFi app Cega Finance, a leader in exotic options and structured financial products, launched an onchain version on Ethereum and Arbitrum today.\n\nA Shark Fin is a type of structured financial product that offers a unique risk-reward profile. These notes provide investors with enhanced returns if the price of the underlying asset stays within a predetermined range. The name derives from the shape of the payoff diagram, which resembles a shark’s fin.\n\nSource: Cega.fi\n\nThe potential returns sharply increase to a peak if the asset’s price remains within the range, and then level off or decline if the price moves beyond the specified threshold. This structure allows investors to benefit from stable market conditions while protecting against significant downside risk.\n\nCega’s launch provides conservative investors an onchain version with crypto as the underlying assets.\n\nExpansion from Solana to Ethereum\n\nCega debuted its first four vaults on Solana almost exactly two years ago, but branched out to Ethereum in the second quarter of 2023.\n\nRead more: Solana options protocol Cega comes to Ethereum\n\nThe decision to launch on the Ethereum Virtual Machine (EVM) was always part of Cega’s roadmap, but the collapse of FTX in November 2022 prompted Cega to expedite its plans, according to co-founder Winston Zhang.\n\n“We knew that we couldn’t wait, and we wanted to continue growing,” Zhang told Blockworks.\n\nInitially, the team considered expanding crosschain via LayerZero or Wormhole, but ultimately decided to hire a new team of Solidity developers to rebuild on Ethereum.\n\n“While that was a little bit slower, it provides the best affordance for safety and security because we’re able to control the smart contracts design ourselves and not rely on a third party,” Zhang explained.\n\nThis transition, which took three to six months, was particularly a response to demand from large-scale investors like DAOs, funds and high-net-worth individuals who prefer the stability of Ethereum.\n\nThe decision to add Arbitrum was driven by its strong DeFi community and significant TVL, making it an ideal target audience for Cega’s products. Arbitrum’s growth, fueled by platforms like GMX, aligns well with Cega’s offerings, which appeals to trading aficionados and derivatives enthusiasts.\n\nIt’s not a migration — Cega maintains a presence on Solana with thousands of users, and the product will continue to be developed there.\n\n“We are having conversations about what it means to reprioritize the Solana ecosystem and how to think about product parity for some of the new products that we’ve launched on Arbitrum and [Ethereum] mainnet,” Zhang said.\n\nMaking complex products accessible\n\nOne of the biggest challenges Cega faces is how to simplify complex financial products for their non-professional users. They made a conscious effort to create intuitive visualizations and straightforward documentation to avoid overwhelming users with technical jargon.\n\nTypically reserved for accredited investors in traditional finance, the goal is to make this class of investment tools accessible to everyone, regardless of investment size.\n\n“The products that we’re building are ultimately derivatives products, but they add a number of benefits for the end user that they can’t get from existing [perpetual futures] platforms or vanilla options platforms,” Zhang said.\n\nThe new “Shark Bull” vaults target users who might typically have capital on lending platforms like Aave, and want to increase their stablecoin yield without taking directional risk to crypto markets.\n\nThese vaults offer 100% principal protection with a guaranteed yield of 12.7%, and the potential for up to 30% returns under certain circumstances by combining lending and options strategies.\n\nStablecoins’ lending yield forms the baseline return, while a portion of the yield is used to purchase out-of-the-money (OTM) call options on crypto assets — the “bull” component, driving the high bonus payouts if prices rise.\n\nThe lending counterparties in this case are not smart contracts but major crypto market makers, so this introduces some credit risk. Cega facilitates these loans but is not a custodian, and manages the risk through stringent legal agreements and ongoing credit monitoring provided by Credora.\n\nRead more: Bitcoin lenders have a new regulation-friendly option for yield\n\nCega, based in Singapore, emphasizes compliance with global regulations. These days, that requires geofencing the US-based customers.\n\nDecentralization plans\n\nThe company raised a total of $9.3 million from notable investors including Dragonfly and Pantera, and does not yet have a token.\n\nZhang said his team deliberately avoided participating in the points incentivization game popular over the past year, preferring to focus on providing real sustainable yield.\n\n“We’re actually really proud of that,” Zhang said.\n\nEven without incentives, the platform has about $16.6 million in TVL currently, and about $404 million in cumulative trading volume.\n\nLooking ahead, Cega does plan to launch a token while maintaining its core values of responsibility and prudence, Zhang said.\n\n“There’s way too many protocols in crypto and in DeFi that just aren’t built on real foundations,” he said, citing the project’s published values.\n\n“There just have been way too many examples in the ecosystem of carelessness, and lack of responsibility, and that is not us.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the Forward Guidance newsletter.\n\nGet alpha directly in your inbox with the 0xResearch newsletter — market highlights, charts, degen trade ideas, governance updates, and more.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]