[
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPQm4zbWRxYURFMXlKWnlrMHl2WXM4VXl4V2R2YVNvLXFuVGs5cUhfYmNEYmY2STc3V3VOZ0RBZXBNSmR1ZXYySHBIZHZXNHFmclBoVkNaYUpnaDAySTh1SDh3RENlODY5TW9NTUlDX2ZsdGNybW9nYnVlTWQ4eHNsR3d4di1URWlyd1hkcjdlSDd4X0ZraXRGcnN2SUJDYmszamVzQ3R6cUJkMTdOVzJpLW930gG3AUFVX3lxTFBLX3lEU0dNaTV0LVRfSGIyd0lYdFMyUjhsQlNtcFFvalFCTE1MV25qSWR2S2VaVENfNnJUM2E0azdNcHJIdWdEZlBWOWNyZXNENUNRQUc5dGZvTTJDS2p5NTdDdkhBenlYZzctMjVqbWZMMTZyVktNc3VmaGthdXhRSTNTVjJsMTl1di14TUZvdHV5eUg4dElKWVFPZXNLT0dPaGpkZ09SWXRWa3B1d2YzcVMtYWZGWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Genesis Seeks Approval to Sell $1.6B in Bitcoin, Ether Trust Holdings - CoinDesk",
        "content": "Some of the GBTC shares were transferred to the crypto exchange Gemini by Genesis as collateral as part of the Gemini Earn program, the filing stated. Genesis seeks an additional 31 million GBTC shares that were pledged to Gemini but never transferred, the filing added."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNem9NNGp4STZEazV1dGxKQVliTV9DMVhVcXZ2VXl4RHZHMWhSMnUzaVhaaWJzelNfaDF2YzVOdGlvXzExWGg0NmExRDlOYmdyQ1l6MzF0eWdzNUpDaW9zQThWZVhrb0hpQzd2bEl6MWhsV3pRdXFQbEtYbTdfWktPYUJUN0ZMbGVRemE3d1QtdTN4cFhhZnfSAaMBQVVfeXFMT0F2b0JJdi12Z3htMi13cWtoNTMxYzhCdTQ5XzYyRjlBMnhYS28zejVYZlgzQ2tEZTdKclpKb3J4cHU4aENBenY2a3laVW1IMjkyMzkxbWZQS1JxQTRyb0tVS1ItSm5sQkpnYzA0cEROeVFVRXlBZFNXcEF5SG95YWF4cDFHd3RvUnFzbXAyVzdMSk5VU1RlNlVpUUV2UGl3Q3o1WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "How Bitcoin and Ethereum Move Together: An Analysis - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQNFk3Z0kxYnI1WVRXZTBoSlM1aTZ2THpScXhGcnhDa1pRUEFwa0t2N25lenBTTWY0dDBFU0J2dHJ6ZVJpN1lISUlucXEzcy10QUF4NVdIRGlOX2hmWlQ1d1htdVRXLUswZGN2S0pLQm1MaWpKUUc2R0h6TnNjUnotcTAybnYtQU1ta1hnOGxZcUtuazRUWm5kXzZhV08yWTRwcFdheGdzSVFlMkpueWNCYtIBtgFBVV95cUxPbGJMM3RqSTRweS11OFJXZ2p5UDRnVnpWd1BOMkxwbFloM1pnUXZXMlN3VXVzVVgweFlpdzA3a003ZzgwMXJDTlIzVFkteEwwMjhTbXVoRzZORnpzZzUtMG1sLVpyYmp1ZUY3S0pSUnhTa3J6Z1RKdGQ5N0NUb2NTRVR5NGp0SHZhVWk1Yml1VUIwMU40LVhSc1BPWTMwRXl5QkpmalNSTk1PUWIxbUhMYU5kOHRVQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "GoDaddy To Link Website Domains to Ethereum Name Service (ENS) Domains for Free - The Daily Hodl",
        "content": "GoDaddy, a world leader in web hosting and registration, is announcing a partnership with Ethereum Name Service (ENS), a domain naming service built on top of Ethereum (ETH).\n\nAccording to a new press release, users of GoDaddy domains can now link their domains to ENS without any additional costs or technical knowledge.\n\nAs stated by Paul Nicks, president of domains at GoDaddy,\n\n“As a long-time domain industry steward, we are always looking for innovative enhancements that benefit our customers.\n\nPartnering with ENS presents our customers with a unique opportunity to experience the fusion of domain names and blockchain technologies, bringing some great benefits for users in both areas.”\n\nAccording to the press release, the DNS will translate domain names into unique IP addresses while ENS turns wallet addresses into more easily readable-by-humans names.\n\nThough it has been possible before to bring domain services to the ENS, the integration has not been simple enough for most users, and the partnership aims to change that.\n\nSays ENS founder Nick Johnson,\n\n“With this milestone, we are furthering our mission to build a more secure, decentralized and user-friendly internet. ENS, much like DNS, is a public good and a core part of the internet infrastructure.\n\nBy pairing up ENS names and GoDaddy domains, we will streamline the way users interact with web domains, blending the familiarity of the DNS with the potential of blockchain technology.”\n\nENS is worth $19.78 at time of writing, up 9.3% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nShutterstock/Tomasz Makowski"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMi9gFBVV95cUxQVV9uVl9IUFNXZGVjS3R5UDg3MExYR3NZUGlEVE4tcWx4RUFVZ09nTU8wbG44YUZfdjUtLUJOYW1wVUtSSl95dzZxZDhqRU9UUnNqRkFiLTBGWTduZGRxTGk3MnBLSlg5blBFSlFsRUgwYmRseVppVDNSaThxX25RSWpBc0poemdjdDZJZm8wRWFaVmw3REJGSGVHeVNQdTVhZWRtYWItb2k3STRGN3FTNm9USjNtREdwRjNNdmpNY1ZkdjF2dVJSVEhvUlIyZTNhcTRrQndPTnpIWGxPUC1DR0dDTk1MQ2J0bXIyVlFPdDRNZVN4NFHSAfsBQVVfeXFMTkRmNy1QazhKRTF3bXJma09mUjJPNmpORV85aXVLVThXTC14RTJCcDVpajFyRk15MDdueDFWVjRHanZtVXZQUWdfcVVLaUthZV9ZekdzVHhnbjJCNzZsSWM3RXFGX3FaUFZsRTZnRUZRZ3dpWkoyeGV4NEVpenpicWtTOTVSbXRZVUdIUWhIMW42bFpPMG01RE9PWnZ2b1dsdllnMzdzOS1jUFFibGstM19SYnF2UTZVaHdjRzcxYXowOF93MU5ra1pXTW5KdHBJMU14RTN2QXJTdUx4RmhBT0g1MGhudWpkazNGbWVrZ2h6OFFzelNOZGVITTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC to record rash move soon as Bollinger Bands contract - FXStreet",
        "content": "Bitcoin price could fall 5% to the support confluence between 100-day SMA and horizontal line at $40,650 as boring chop continues.\n\nEthereum price could revisit $2,200, a 4% correction, as the 50-day SMA proves impenetrable.\n\nA retest of the October lows around $0.4734 seems likely for Ripple price as XRP token holders show weakness.\n\nBitcoin (BTC) price continues to record a boring chop, trading horizontally, with altcoins such as Ethereum (ETH) mimicking the price action. Meanwhile, Ripple (XRP) price continues to suffer in the hands of unmotivated traders.\n\nAlso Read: Week Ahead: Crypto markets to turn volatile as AI steals the spotlight\n\nBitcoin price likely to fall 5%\n\nBitcoin (BTC) price is trading within a range, consolidating between the centerline and the upper band of the Bollinger indicator at $41,895 and $44,210, respectively. With the two Bollinger bands contracting, BTC could record an impulsive or rash move soon.\n\nThe Relative Strength Index (RSI) is closely bearish, teasing with a cross below the signal line (yellow band). The Moving Average Convergence Divergence (MACD) also appears subdued with miniature volumes on the histogram bars. This is also reflected in the Awesome Oscillator (AO), tilting the odds in favor of the bears.\n\nIf the bears have their way, Bitcoin price could descend 5% to find support due to the confluence between the 100-day Simple Moving Average (SMA) and the horizontal line at $40,650. If this level fails to hold as support, BTC could extend the fall into the demand zone between $38,496 and $39,582. A break and close below the midline of this order block at $39,196 would confirm the continuation of the downtrend, potentially going as low as the $37,800 support.\n\nBTC/USDT 1-day chart\n\nConversely, if bulls have their way, Bitcoin price could shatter past the upper band of the Bollinger indicator at $44,210. This could see BTC climb to $48,000, or in a highly bullish case, tag $50,000, nearly 20% above current levels.\n\nAlso Read: Bitcoin price gains strength as GBTC outflows shrink\n\nEthereum price could drop to $2,200\n\nEthereum (ETH) price action is almost similar to that of BTC. It could fall 4% to $2,200 as overhead pressure due to the 50-day SMA continues to build. The Proof-of-Stake (PoS) token’s price has made multiple attempts to breach this supplier congestion level to no avail.\n\nWith the RSI below 50, the AO and MACD in negative territory, and below the latter’s signal line (orange band), the odds favor the downside. Ethereum price could slip past $2,200 to test the 100-day SMA at $2,203. In a dire case, the fall could see ETH dip into the demand zone between $2,059 and $2,118.\n\n\n\nETH/USDT 1-day chart\n\nOn the other hand, increased buying pressure could see Ethereum price overcome the 50-day SMA to confront the $2,388 barrier. Flipping this into support could restore Ether into the ascending parallel channel, a gateway to more gains.\n\nAlso Read: Ethereum monthly transaction count climbs to highest level since July 2022\n\nRipple price looks for pullback as XRP holders show weakness\n\nRipple (XRP) looks ready to fall as it is stuck below the foothold of the midline of the descending parallel channel. Increased selling pressure could see XRP price retest the October lows around $0.4734, with technical indicators showing an unmotivated holder community. This is seen by the waning momentum on the RSI below 50 and the position of the AO and MACD in negative territory.\n\nXRP/USDT 1-day chart\n\nOn the flipside, enhanced buyer momentum could see XRP price breach the resistance due to the midline of the channel, bringing the $0.6000 psychological level into focus.\n\nAlso Read: XRP price trades broadly unchanged leading up to crucial milestone in SEC vs. Ripple lawsuit"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNdkh0dTltMWVTcjNvWU42Nk1aTnJyM1Jaek9fbE5CbGtHT2plUjhwaFZYcDNIWklTdkJHWmJlbTdyNXRJNnlCWVZtbEFrUTJucl9kT1dGMVh0OGNmckpPUGtHdE0zMmZCTnNNcXc1cTliemZCOUNMX0Q1THd4UnVldktFQmJaVEpEVzNYRElBZU9PMW5wWnY2enZ4M21JVUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Mollars ICO & What You Need to Know About Ethereum Blockchain’s New Bitcoin - CryptoPotato",
        "content": "The official Initial Coin Offering [ICO] for the Ethereum blockchain token “Mollars” launched on Monday, November 21st. The token price starts at $0.30 in the first phase.\n\nMollars is a hybrid cryptocurrency that will be an alternative to Bitcoin as it’s a store of value tokens. There will be a difference, however, as it’s starting a decade after BTC was first introduced to the world.\n\nWhat are Store of Value Tokens and Coins?\n\nLike Bitcoin, Mollars aims to be a store of value that’s in high demand, and the founder will not hold tokens privately. Possibly as high as 99.5% of today’s cryptocurrency founders have a personal stash of tokens that was likely introduced to investors through the ‘fine print’ in the crypto brand’s whitepaper.\n\nIn Mollars whitepapers, it’s clearly stated that no party involved in the development of this token will be given tokens. A complete 100% of the tokens generated by the founder and developer team will be put onto the crypto market and exchanges.\n\nAnother attribute that makes Mollars a store of value, like Bitcoin, is that it will be fully decentralized.\n\nThe founder will not own the brand. The creator of the token created infrastructure and formulas to give the token longevity, but the enigmatic figure will have no control over the token once it has been released on top crypto exchanges.\n\nMollars ICO and Potential Exchange Listings\n\nThe first exchange that Mollars will be listed on is Uniswap, the world’s #1 decentralized crypto exchange. If the ICO reaches its goal of US$ 2 million dollars, it will have a listing day price of US$0.62.\n\nThe 62-cent listing would mean today’s first-round ICO investors would get ROI Yields of over +200%.\n\nThe price of the listing day could be weaker if the US$2,000,000 milestone is not met with the Initial Coin Offering fundraising.\n\nWith 15,661 tokens sold since its debut on November 21st, the Mollars ICO listing is averaging a daily buy rate of just over 2,610 tokens. At this rate, it would take the Initial Coin offering a substantial amount of time to complete. However, the ‘buzz’ is building, and that daily buy rate is expected to increase.\n\nAnother reason users might begin buying more is the crypto token’s founder’s recent release of the white paper and mission statement. One of those statements includes a ‘catalyst’ to expand the Mollars brand via product.\n\nBitcoin Had a 10-Year Head Start… So Here’s The Catalyst\n\nThe new ERC-20 token will be a necessity for those who wish to use Mollars developers’ coming mystery web3 product. This decentralized app [dApp] will launch in early 2024 at the same time as the hybrid tokens launch on its first major crypto exchange.\n\nWhat exactly is the dApp Mollars will launch? It’s not yet clarified but the web3 ‘goody’ is being believed to target P2E gamers and metaverse enthusiasts of the Ethereum blockchain world.\n\nMollars ICO in 2024\n\nThese claims by the new ERC-20 token’s developers have left some analysts to believe today’s first round ICO investors could generate more than just the typical listing day gains.\n\nAs the Mollars token is being offered at US$ 0.30 cents today, it will list on a major crypto exchange in second quarter of 2024.\n\nMany new tokens see gains when listed on new cryptocurrency exchanges, but having an actual product could lift the token.\n\nICO & Tokenomics\n\nSpecifics for the ICO launch and post-listing plans have been made clear based on the fundraising goal being met successfully. A total of 4,500,000 tokens will be sold. Mollars initial coin offering will have 4 funding rounds. The price of the token pre-exchange will increase with each round incrementally.\n\nFirst-round investors will have the best opportunity to buy Mollars tokens at the previously mentioned rate of US$0.30. After a modest 200,000 tokens have been sold, the second round will begin.\n\nThe ICO price for second-round token investors will be US$0.40, which is a substantial increase. A maximum of 300,000 tokens will be sold in this second stage before the price is bumped upward again in the third round.\n\nAs popularity grows, the supply available in the ICO’s third round will more than double to 700,000 $MOLLARS tokens. By this third round, Mollars will have the first details and possibly a preview of their web3 product.\n\nIn the fourth round of the ICO, investors will have to pay half a dollar to buy tokens early.\n\nIn the 2 rounds following the fourth, the token presale will increase by US$0.05 each round. Specifically, 5th-round investors will have to pay US$0.55 per token, and 6th-rounders will have to buy tokens at a rate of US$0.60 each.\n\nThe total token supply that will be sold in the Mollars presale totals 4,000,000 crypto coins.\n\nAfter the ICO presale is completed, the $MOLLARS coin will appear on a top crypto exchange quickly — according to public plans.\n\nLearn more about the ICO and this new hybrid token at their official website — www.Mollars.com.\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    }
]