[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOdGFRR2VTT2h2ZS1jX3cxdnFiUTJ5blVFTEltTm1nOE53WWhKSDNidFhnWkZ6cWhlb1pmbUFDSlNaWEVwX3UxUEVqOG9yOGtWSDN0S0xUMUNHejhQNWxOc3d4YTg5RlFPa2pYempkYW82X2JJUjZuNjl4VWlyd3dKTjRXNW1ySURNZlhGbjJGMDJFWkhka2U4NEFYcHpRSkNCRWswMTZmNGdDSUxYZHN2SUFJSGhfUVB6c1BEZGJOaHQzd9IBxwFBVV95cUxPTzBPdHgwaENWM1EwMEFDTTl6WHRXY2xJRUxGaDRRQ1d3VGRqMXkxcGczYldWanh3UTFQR1F1YW55X2dReVVBNllyRm9acmtQdFZDeUFtUUJXcUs3LTZTLWc0VW5pNmM1bk5mYlpTaGtoSXdaZDZ4eGV4WWUzUDQ0RWEtcXBXWjAwV2oxN2E3U1Y0MkxWc2xaMlFKM2Q2RDNXbTN6R2VzWTNGRlZGTU9MWWdnWmhPSkFhWlNqZ3pIdENJWl82aGlR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Feb 2024 08:00:00 GMT",
        "title": "More Than $1,000,000,000 in Ethereum Flows out of Centralized Exchanges This Week: IntoTheBlock - The Daily Hodl",
        "content": "Ethereum (ETH) flew off centralized exchanges this week, potentially reducing selling pressure on the ETH market, according to the crypto analytics firm IntoTheBlock.\n\nIn a new analysis, Lucas Outumuro, IntoTheBlock’s head of research, tracked Ethereum’s netflows, which measure the ETH moving in and out of centralized crypto exchanges by subtracting the amount of ETH’s withdrawals from its deposits.\n\nOutumuro notes that more than $1 billion worth of Ethereum netflows left centralized exchanges this week. ETH’s network fees, which indicate the willingness to spend and demand to use the asset, increased by more than 30% over the same time period.\n\nBitcoin (BTC) also flowed off centralized exchanges, clocking $300 million worth of net outflows and breaking an eight-week trend of inflows onto exchanges. Bitcoin’s network fees spiked by more than 50% this week as well.\n\nLarge upticks in exchange inflows tend to lead to an average price drop of 5% for crypto assets, according to a 2021 study published by fellow crypto analytics firm Santiment.\n\nETH is trading at $2,512 at time of writing. The second-ranked crypto asset by market cap is up 2.64% in the past 24 hours.\n\nBTC is trading at $47,478 at time of writing. The top-ranked crypto asset by market cap is up nearly 3% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOdGFRR2VTT2h2ZS1jX3cxdnFiUTJ5blVFTEltTm1nOE53WWhKSDNidFhnWkZ6cWhlb1pmbUFDSlNaWEVwX3UxUEVqOG9yOGtWSDN0S0xUMUNHejhQNWxOc3d4YTg5RlFPa2pYempkYW82X2JJUjZuNjl4VWlyd3dKTjRXNW1ySURNZlhGbjJGMDJFWkhka2U4NEFYcHpRSkNCRWswMTZmNGdDSUxYZHN2SUFJSGhfUVB6c1BEZGJOaHQzd9IBxwFBVV95cUxPTzBPdHgwaENWM1EwMEFDTTl6WHRXY2xJRUxGaDRRQ1d3VGRqMXkxcGczYldWanh3UTFQR1F1YW55X2dReVVBNllyRm9acmtQdFZDeUFtUUJXcUs3LTZTLWc0VW5pNmM1bk5mYlpTaGtoSXdaZDZ4eGV4WWUzUDQ0RWEtcXBXWjAwV2oxN2E3U1Y0MkxWc2xaMlFKM2Q2RDNXbTN6R2VzWTNGRlZGTU9MWWdnWmhPSkFhWlNqZ3pIdENJWl82aGlR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Feb 2024 08:00:00 GMT",
        "title": "More Than $1,000,000,000 in Ethereum Flows out of Centralized Exchanges This Week: IntoTheBlock - The Daily Hodl",
        "content": "Ethereum (ETH) flew off centralized exchanges this week, potentially reducing selling pressure on the ETH market, according to the crypto analytics firm IntoTheBlock.\n\nIn a new analysis, Lucas Outumuro, IntoTheBlock’s head of research, tracked Ethereum’s netflows, which measure the ETH moving in and out of centralized crypto exchanges by subtracting the amount of ETH’s withdrawals from its deposits.\n\nOutumuro notes that more than $1 billion worth of Ethereum netflows left centralized exchanges this week. ETH’s network fees, which indicate the willingness to spend and demand to use the asset, increased by more than 30% over the same time period.\n\nBitcoin (BTC) also flowed off centralized exchanges, clocking $300 million worth of net outflows and breaking an eight-week trend of inflows onto exchanges. Bitcoin’s network fees spiked by more than 50% this week as well.\n\nLarge upticks in exchange inflows tend to lead to an average price drop of 5% for crypto assets, according to a 2021 study published by fellow crypto analytics firm Santiment.\n\nETH is trading at $2,512 at time of writing. The second-ranked crypto asset by market cap is up 2.64% in the past 24 hours.\n\nBTC is trading at $47,478 at time of writing. The top-ranked crypto asset by market cap is up nearly 3% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOVjNjcFY4Mk91RnE4YWdfcnRuLVRFSl9zYjdIOUh0RVIwWnNUY0RuMHdHNFBtbFlFYXRDZVdhcXJWazFxY0RkQW1ZLWtHUnRCdGZjMkN4MHd0RUdxTGVtelgzOG5QcGx0Z1Zmemd4OXV2VXFwV2ZyQkNEcnpmTU9SREJ4RExFSknSAYwBQVVfeXFMTWZyN3d2d3FiUGQyeXBhNlBoZzJCbW5WcnpQYW84aEZvSFdmd0lJNHdsT09CWjVSWXBNOTd2amVHeExuc1Mxc3pycjRDbnFaVm1DX1BPeHBiazNLbmpJaW9hREVBeHBaeDFSX0pGWHZQdHNXc0pnd3hTeUtVSW83WFdFS1ZOYzRJbmUtZTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Feb 2024 08:00:00 GMT",
        "title": "Week in review: Analyzing the Bitcoin, Ethereum price surge - AMBCrypto News",
        "content": "BTC and Ethereum lead the 7-day increase metric.\n\nBTC and ETH have contributed to the increase in the general market cap.\n\nOver the last seven days, both Bitcoin [BTC] and Ethereum [ETH] witnessed price increases, consequently impacting their respective market caps. Furthermore, the growth observed in these two assets has contributed favorably to the overall market cap as well.\n\nBitcoin and Ethereum lead market increase\n\nAccording to CoinMarketCap data, Bitcoin and Ethereum have exhibited substantial value growth among the top assets in the past seven days. At the time of this writing, BTC has increased by about 7%, while ETH has increased by over 6%.\n\nA more detailed analysis showed that during the last week, the market cap of BTC witnessed a rise of over $60 billion. The market cap moved from around $845 billion on 3rd February to about $908 billion on 9th February.\n\nSimilarly, examining the ETH market cap showed a notable uptrend in the past seven days. Between 3rd February and 9th February, the market cap increased from about $276 billion to around $295 billion, reflecting a rise of around $19 billion.\n\nBitcoin and Ethereum’s market cap boost general market cap\n\nAt the time of this writing, Bitcoin and Ethereum held market dominance figures of about 52% and 17%, respectively. This implied that any fluctuations in their market caps would substantially impact the overall market.\n\nBased on the analysis of market caps on CoinMarketCap, BTC and ETH saw an increase of around $79 billion in the past seven days. This showed that the combined contributions of BTC and ETH accounted for a $79 billion addition to the overall market cap.\n\nAt the time of this writing, the general market cap has risen by about 1.7%, reaching around $1.7 trillion.\n\nHow BTC and ETH have trended\n\nAt the time of this writing, Bitcoin traded at about $46,200 on the daily timeframe chart. A chart review showed that it has experienced a growth of over 2%, marking the fifth consecutive day of increase.\n\nAdditionally, the Relative Strength Index (RSI) suggests that it is nearing the overbought zone at the time of this writing.\n\nHow much are 1,10,100 ETHs worth today\n\nFurthermore, an examination of Ethereum on the daily timeframe showed it was trading with an increase. At the time of this writing, it was trading at around $2,454, showcasing a rise of about 1.45%.\n\nIt is noteworthy that ETH has not displayed the same seamless increase as BTC but has witnessed an increase nonetheless."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOY0RpU0dJdFNUeE9iQVZrTTZQaFpRRlRqZlZ0SW9kd3FZdW82SHBKZmFsOHB6dW1fOWEwanA5NllBVXQzeFdIUlE5ZkNCZF9tZmZOZ09PZ0xHanZZRXltWjNfYXFQUTRhT2NITkpsOWVrU2RDTjkxc0RFZGlhc0xSS05HMFhZRUt3RzRKQ0dlLUJkdmY3MFlGQmhWRkR0T29GZlhqMFpPOGJrLWhUd3pLanpoNUxWd9IBuwFBVV95cUxQaGJTb0czdnlXUld4RHNqVnUxLTRFRVFETWQ3Zk81NXJMUFdpSU13dWNvU2ZncDdra3plTlJxRE5OZlNHd3NHR2lXOHJPTFFEMEZrSU9yZXRoVWRidGtkc19IOE82T1JBNDV0VW5PeXVnMDl1dFI3ZG1ZZWJHUTVoYmY1eHlFcmotQm1EYTVBcmloMUVuZTBQam50OFZ5MFRUVldocU5MY1RrWnlSSEVYMmtVUm1qQ1BwZjEw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Feb 2024 08:00:00 GMT",
        "title": "Crypto Drama Unfolds: Ethereum Co-Founder’s 22,000 ETH Transfer Sparks Price Speculation - NewsBTC",
        "content": "In a recent development, Ethereum [ETH] co-founder Jeffrey Wilcke’s wallet has made a notable deposit of 4,300 ETH to a cryptocurrency exchange.\n\nThe deposit made by Wilcke amounts to 22,000 ETH, valued at approximately $41.1 million at the time. With Ethereum’s current price standing at $2,500, this deposit has injected renewed interest and excitement into the market.\n\nEthereum Co-Founder Transfers 22K ETH: Impact On Price\n\nDespite this substantial deposit, the overall trend of Ethereum’s netflow remains unaffected. This deposit comes after a considerable hiatus, with the last recorded transaction from this wallet dating back to June 2023.\n\nSource: Lookonchain/X\n\nAccording to an analysis of the Netflow metric on CryptoQuant conducted by NewsBTC, there has been a continued outflow of ETH from exchanges. In fact, more than 9,800 ETH left the exchanges at the end of trade on February 10th. However, it is worth noting that the previous day witnessed a significant inflow of over 75,000 ETH.\n\nRelated Reading\n\nShiba Inu On Cusp Of Lunar Launch As 1.3 Trillion SHIB Barrier On Crosshair 7 months ago\n\nIn the midst of these market movements, Ethereum’s price has been on an upward trajectory over the past three days. As of the time of this report, ETH is trading at over $2,500, indicating a strong positive trend.\n\nEthereum Bulls Gain Momentum: $3,000 Milestone?\n\nThe Short Moving Average and Relative Strength Index (RSI) further validate this bullish sentiment. The RSI has crossed the 60 mark and is moving towards the overbought zone, while the price remains above the yellow line, acting as a support level.\n\nFurthermore, Ethereum has been making waves in the crypto world, surpassing even Bitcoin and signaling a robust bullish trend. All eyes are now on ETH, with growing expectations that it may soon hit the $3,000 milestone.\n\nEthereum currently trading at $2,501.5 on the daily chart: TradingView.com\n\nSpeculation is also building about a potential climb to $5,000, with rumors circulating about an upcoming upgrade referred to as “Dencun” next week. However, it is important to note that information regarding this specific upgrade is limited, and further research is required to verify its impact on Ethereum’s potential price surge.\n\nAs the market eagerly anticipates the future trajectory of Ethereum, investors and enthusiasts are advised to exercise caution and stay informed. Tracking official Ethereum community channels, developer blogs, and reputable cryptocurrency news sources will provide valuable insights into the latest developments and upgrades affecting ETH’s price movements.\n\nRelated Reading\n\nWilcke’s recent deposit, combined with Ethereum’s positive trend and the anticipation surrounding the rumored Dencun upgrade, has created an atmosphere of excitement and speculation within the cryptocurrency market. With ETH surpassing Bitcoin and eyeing new all-time highs, the future of Ethereum holds immense potential for investors and traders alike.\n\nFeatured image from Adobe Stock, chart from TradingView"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQNl9kNklxUzF2SHlYWE1LMWQyMjMwaTRocXd1aUEyc2FlMHBVVEkxbDdIUHdFLWdYTDN5MjFJelF0VzdrNmE3RDFLNDlkQ0dEbHVXb2paWHYxTm1YLXZnRUNJTHE2MXBiMmJHaXkyVzMtNmFDSGFmRnk2SjBKU0FLYlhB0gGHAUFVX3lxTE82WDJYYTZVbXhRcW9QMVhPcDhyem1nc1VvNkl0NmJOZDVCOTFXNVZ3YS1JdXpTd2xUUWFaMS1sOFlhWHNoWGJQOEVGSFltaWtwZmpyMERKZlRtUlhadk9JWS1fTG5FS294a2ZmODZRODM1YzI0aFgwODU5OWo0MHRUVVMtN2lfSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Rally: Experts Foresee ETH to $4,887 by 2024, $19,190 by 2030 - CoinGape",
        "content": "A recently published report by Finder conducted in January 2024 and shared with Coingape features the combined opinions of 40 crypto industry experts on the price projections for Ethereum (ETH) up to 2030. This survey, being a notable move to assess the growth potential of Ethereum, has delivered a common idea that there is a great future perspective of ETH among the participants.\n\nEthereum’s Trajectory of Price Through 2030\n\nAs per the findings, the panelists expect a big rise in the market value of Ethereum and an average price of $4,887 by the end of 2024. This upward trend is expected to persist, with projections indicating a further growth to $7,492 by 2025 and an amazing jump to $19,190 by 2030.\n\nadvertisement\n\nThese forecasts are all the more positive than the panel surveys in October 2023 and January 2023 and, in another way, highlight that the market and its performance are winning the confidence of market actors.\n\nCurrently, Ethereum (ETH) has had a bullish rally in the last 24 hours with price bouncing between an intra-day low and high of $2,475 and $2,522. At press time, ETH was exchanging hands at $2,492, a 0.30% surge from the support level. During the rally, ETH market market capitalization surged to $299,492,362,705 while the 24-hour trading volume dipped by 36% to $8,169,785,827.\n\nExpert Ethereum Insights\n\nJonathan Hababou Solomon, co-founder and co-CEO of A.R.I.A., emphasized the significant milestone of Ethereum exceeding $2,470, indicative of a reversion to the bullish mode. Solomon and other experts, including Damian Chmiel of Finance Magnates, noted that Bitcoin and Ethereum prices are strongly correlated. That suggests Ethereum may benefit from the same catalysts that have previously pushed Bitcoin up, such as ETF regimes and halving events.\n\nPedro Febrero, VP of Web3 at RealFevr, noted that Ethereum is in fact undervalued when compared to Bitcoin, considering its massive adoption and capabilities in DeFi, NFTs, gaming, etc. Nonetheless, experts’ viewpoints on Ethereum’s imminent future differed.\n\nWhilst some, including Josh Fraser of Origin Protocol, foresee an ETH peak price of $17,000 in 2024, influenced by such factors as possible ETFs and diminishing sell pressure, others, such as John Hawkins of the University of Canberra, take a more careful approach and predict a decline to $2,000.\n\nThe Consensus on Buying, Holding, or Selling ETH\n\nThe survey shows a strong preference for buying ETH, as 71% of the panelists recommend the acquisition at the current time. The expectation of Ethereum ETFs and the changing discourse around on-chain assets and decentralized applications gives credence to this view. Identically, a very small 3% of the shareholders believe that the best time to dispose of ETH is today because of the belief in the future development of Ethereum.\n\nDiversity of views is what one comes across in the discussion on the current valuation of Ethereum. Due to its impressive growth and potential as a global settlement layer, about half of the panelists think ETH is undervalued. On the other hand, however, a sizable 45% believe that Ethereum is fairly priced given the recent approval of Bitcoin ETFs and the potential for a similar event happening for Ethereum. Though a small fraction of the market views ETH as overpriced, the persistent system flaws within the Ethereum network are pointed at.\n\nThe survey further looked at the competition between Ethereum and new blockchain platforms, such as Solana. The majority of analysts (66%) have predicted that crypto fans will rely on the usage of Ethereum and Solana, thus taking advantage of the different features each provides. This point of view leads to a diverse and multi-chain future of the blockchain industry where different platforms meet the needs and choices of different groups of users.\n\nRead Also: XRP Price Prediction As Renewed Recovery Hints 14% Surge, But There’s A Catch\n\nKelvin Munene Murithi Kelvin is a distinguished writer with expertise in crypto and finance, holding a Bachelor's degree in Actuarial Science. Known for his incisive analysis and insightful content, he possesses a strong command of English and excels in conducting thorough research and delivering timely cryptocurrency market updates.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]