[
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOYjlwSjBtNWVlOWhmMVk4VllkVVpHMGxNVWdDWWVUd1VwaEREQ0dxREVvMzIxa1ZFRlBVaTJhZ3FJWUotdHZiMk9ZbVF4cFNvUlAtczN5ZlFtZ0c3ekR1RDJwbm5CbDN0UUtvcFEtbzdCSEVQQllPWjI1MXZGRWNCcEw5dkl5NEZEczFkV21YTWlPMnhtSUVYMDE5TW9XSUR1MXZMSTdtMDJ1VkZCSDlYVXRvZS1DSzd1UGNpbUQ2UXBPdmlsTW95cHlPVVY0bFZRM2RvZXZJNEFTOVhlMXlDQ2hHamRkVmh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "While Bitcoin, Ethereum, Shiba Inu Witness A Meltdown, This Solana-Based Memecoin Has Surged 147% In Last Week - Benzinga",
        "content": "In defiance of the market’s downturn, a memecoin built on the Solana blockchain, Billy BILLY/USD, has experienced a significant surge, with its value increasing by nearly 147% in the last week.\n\nWhat Happened: The value of Billy, a memecoin with a dog theme, has surged by nearly 147% in the last week, reaching $0.182. This surge in value comes after several cryptocurrency exchanges, including Bittrue, Bitget, MEXC, and Gate.io, added support for the coin, reported The Daily Hodl.\n\nBilly, which was launched in June, features a puppy image and has outperformed other popular meme coins during the current market consolidation phase, which has led to significant declines across the board, the report noted.\n\nDespite the market’s downturn, Billy’s market cap is currently at $181.8 million, with a 24-hour trading volume of $55.3 million, according to data from CoinMarketCap.\n\nWhy It Matters: Despite their often whimsical nature, meme coins have been gaining traction and demonstrating significant market resilience.\n\nOther dog-theme assets such as Shiba Inu SHIB/USD and Dogecoin DOGE/USD are trading at $0.00001538 and $0.1081 respectively as of the time of writing this article.\n\nOther top-tier cryptocurrencies like Bitcoin BTC/USD and Ethereum ETH/USD have come under selling pressure over the past week – while Bitcoin has fallen over 7%, Ethereum declined by over 11%.\n\nRead More:\n\nPhoto courtesy: @billydogsolana\n\nThis story was generated using Benzinga Neuro and edited by Anan Ashraf."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOYjlwSjBtNWVlOWhmMVk4VllkVVpHMGxNVWdDWWVUd1VwaEREQ0dxREVvMzIxa1ZFRlBVaTJhZ3FJWUotdHZiMk9ZbVF4cFNvUlAtczN5ZlFtZ0c3ekR1RDJwbm5CbDN0UUtvcFEtbzdCSEVQQllPWjI1MXZGRWNCcEw5dkl5NEZEczFkV21YTWlPMnhtSUVYMDE5TW9XSUR1MXZMSTdtMDJ1VkZCSDlYVXRvZS1DSzd1UGNpbUQ2UXBPdmlsTW95cHlPVVY0bFZRM2RvZXZJNEFTOVhlMXlDQ2hHamRkVmh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "While Bitcoin, Ethereum, Shiba Inu Witness A Meltdown, This Solana-Based Memecoin Has Surged 147% In Last Week - Benzinga",
        "content": "In defiance of the market’s downturn, a memecoin built on the Solana blockchain, Billy BILLY/USD, has experienced a significant surge, with its value increasing by nearly 147% in the last week.\n\nWhat Happened: The value of Billy, a memecoin with a dog theme, has surged by nearly 147% in the last week, reaching $0.182. This surge in value comes after several cryptocurrency exchanges, including Bittrue, Bitget, MEXC, and Gate.io, added support for the coin, reported The Daily Hodl.\n\nBilly, which was launched in June, features a puppy image and has outperformed other popular meme coins during the current market consolidation phase, which has led to significant declines across the board, the report noted.\n\nDespite the market’s downturn, Billy’s market cap is currently at $181.8 million, with a 24-hour trading volume of $55.3 million, according to data from CoinMarketCap.\n\nWhy It Matters: Despite their often whimsical nature, meme coins have been gaining traction and demonstrating significant market resilience.\n\nOther dog-theme assets such as Shiba Inu SHIB/USD and Dogecoin DOGE/USD are trading at $0.00001538 and $0.1081 respectively as of the time of writing this article.\n\nOther top-tier cryptocurrencies like Bitcoin BTC/USD and Ethereum ETH/USD have come under selling pressure over the past week – while Bitcoin has fallen over 7%, Ethereum declined by over 11%.\n\nRead More:\n\nPhoto courtesy: @billydogsolana\n\nThis story was generated using Benzinga Neuro and edited by Anan Ashraf."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQNGM3M2hOOUNxYWs2YjNBVmZaZGY0STJndjZ1R2VDVUd3Z2VES3FWdTlqejlFaWlGMzg3ZXVEZUg3QmY3NVNQanN6SGxkWkIxM0dTRDU2cjFqVmhuTG43OTQwVHZ5bkgzODQtb0R5YlFHLVVsLXpLSlBPeUNTc09UWjdhYi16RHRjcjJTWDJXN18xNlhlVk95bnhGN05FWS1iZGNicnNEMDNpSkh1bnhKbmpuZDBob0plc1VVU1VIT1dDUjjSAcgBQVVfeXFMUGYzSGZRcUdVVUhJNFZQemhXS1lGREV3WHRwS242R1M3emtKMGx4LXlpQmhfMi1TWWRpNDVaSEU1Q3VJM0hkXzlJZS15ZmtuTmhrNl9zeW9rZkNhQ0ZxX01Nb0NqUzBDNk1GdE5LWGloZWJoUnhDMHJ1VGt2clhxN0drS0tPWlpTRFVLWmxmZ1lnNGlmLVNBYXJVcEYzSnlJY0pheUJCVGNkOUdzWjNHTFZrQzFkRTJTSkJ5cE0za09HNkhhVmJJWjg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "Bitwise CIO Matt Hougan Says Ethereum Cycle Incoming, Outlines Two Massive Tailwinds for ETH - The Daily Hodl",
        "content": "The chief investment officer (CIO) of Bitwise Asset Management, Matt Hougan, is predicting a massive bull cycle for Ethereum (ETH) based on several factors.\n\nIn a new interview with Scott Melker, Hougan says that spot Ethereum exchange-traded funds (ETF) could draw $15 billion within 18 months of their approval, which is expected soon.\n\n“So I think it’s a down-the-middle prediction. We could be higher, we could be a little lower, but I think $15 billion is in the bag.”\n\nHe also believes two additional bullish factors for ETH could send its value soaring: a greater acceptance of crypto by the US government and Ethereum’s recent network upgrade, Dencun, which aims to reduce costs for layer-2 transactions and data availability.\n\n“I think that these numbers overlook the fact that we’re entering what is usually the ETH cycle. They also overlook two huge tailwinds that I see for ETH, which is it had a lot of regulatory uncertainty, and over the last two months, a lot of that has gone away.\n\nNot only did we get movement forward on ETFs, but we also saw Washington generally change its tune on crypto. That’s a massive tailwind for ETH. And then you have the aftereffects of the Dencun upgrade, which I don’t think the market has fully recognized what that will mean for this market.”\n\nEthereum is trading for $2,974 at time of writing, down 3.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxQNmV5aVBpa2J1MW5vdy1feVNUUUwyUGxfUmd0MmtBSlNKU2kzdS1fRjkzU2FyRFVBdTNnZUpVMmxfOWczb3JqZERFVkxta2M3QkRfaVViS3NTQUFHUkhLRi0zWWRLeVE1SWhJbHhYMm5NUHRzQTRlQlFpYm4zRk4yeTBrUVprN2ZWOE5nZ09OOC1lY09YUFZmVHFuZ0N4NVpLZXdGWTEtZXBKdU9keWJYaVVTcF9nRzA2RzBkendFdlRFQVUtMkVlS3J2bWRPOURCU0Yya3BOR2HSAd4BQVVfeXFMT0VISHVNOUJ2NDJGRjR4VlVrTm9TX2FHQ01mMGtKWlY0dzZwdUFLV2dnSG1yQVVPODQ0amlFdnVVaWJ2Z1V2cDZkMXRSNjFoT1oxa01FSFZJVHpDTi1oaGZwakE4VkdiSzBrUDZIcTViRExra3JfbDR2QjdtV0ltVE9tWmc3Vm95YWt1NDdoU2VUdTd4Z28xR0ZDZEFHSzMtQ19ySlJNZjdjU1NsNGNPeVFzMTcyODhHRWVWT0VOV2RVT1VGNy1ZNFE3VU4tU0ZFTmh0NFFXNzhRVG1QSE93?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Ecosystem Suffers $400,000,000 in Losses Year-to-Date, Amount of Crypto Hacks Rise by Over 50%: SlowMist - The Daily Hodl",
        "content": "New research from cybersecurity firm SlowMist reveals that the Ethereum (ETH) ecosystem has lost $400 million in exploits year-to-date as the number of crypto hacking cases sees a 50% rise.\n\nAccording to SlowMist’s 2024 mid-year report, the second largest digital asset by market cap saw the most funds lost due to exploits as an ecosystem, followed by layer-2 scaling solutions Arbitrum (ARB) and Blast.\n\n“From an ecosystem perspective, Ethereum suffered the highest losses, amounting to $400 million. Followed by, Arbitrum incurred losses of $72.46 million, and Blast suffered losses of $70 million.\n\nAdditionally, Binance Smart Chain (BSC) experienced the highest number of security incidents, totaling 57, with losses of approximately $32.12 million.”\n\nThe firm says that based on its research, the digital assets industry saw a total of 223 security incidents during the first half of 2024 that resulted in a combined $1.43 billion worth of losses. The figure represents an increase of more than 50% from the $920 million lost during the first half of 2023.\n\nSlowMist goes on to note that decentralized finance (DeFi) is the most attacked sector in crypto, comprising nearly 71% of all incidents in the first half of the year.\n\n“From the project track perspective, DeFi is the most frequently attacked area. In the first half of 2024, there were 158 DeFi security incidents, accounting for 70.85% of the total incidents, with losses amounting to $659 million.\n\nCompared to the first half of 2023 (111 incidents with losses of approximately $480 million), this represents a 37.29% year-on-year increase in losses.”\n\nAccording to SlowMist, the top two causes of exploits were contract vulnerabilities and exit scams, which accounted for 56 and 50 incidents, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE5OWHFqSnZENHhINVY2ZWdxam43UjQzcWZDYW50cVNrSWJWQUhRcmVTZG56dk1YMkVJaE9PaGtlWHA4cFlEeG9OVEtocW1yT1BraGJ3TFJxNjJVdzAtajlTeUNINnpxNDh30gFuQVVfeXFMTjFhNXd2eTFhU0ZvamVFV0tMRVB2RWRpSFpCWUZzeGhNM0JlVnZMWHJ4OWNFb1lkem1VSGpIT0FPQUhydmd0TjhLdDI1Q0tybndqZ2kwUl9KUW1xZ2VkM1ZJVlV2YzI1Y2ZYOFQ3aXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "When Will Ethereum Price Recover? - U.Today",
        "content": "Advertisement\n\nWhat's happening?\n\nThis past week, Ethereum has witnessed a massive sell-off crisis, with the price dropping below $2,900.\n\nA recent report by CoinShares highlights that Ethereum has experienced a massive capital outflow, the largest since August 2022, with total losses amounting to $119 million over the last couple of weeks.\n\nSource: CoinMarketCap\n\nThis continues a trend from a week ago, when Ethereum's price dropped from a high of $3,887 to a low of $3,232, marking a 16.9% loss. Even though ETH's price may be stagnating at the moment, a surge in staking indicates that existing users believe in the long-term potential of ETH.\n\nIn wake of ETF launch\n\nAccording to Bloomberg, multiple applicants are supposed to submit their amended S-1 forms before July 8. This could mean that the final approval of S-1 forms is expected to take place by July 12, while the launch could happen somewhere the following week.\n\nAdvertisement\n\nAsset managers are optimistic that the SEC will approve the first U.S. ETFs that invest directly in Ether by mid-July. There was earlier market speculation that approval would come during the July 4 holiday week.\n\nHowever, the SEC has informed Ether exchange-traded fund applicants that they have until July 8 to submit updated paperwork. There might be another round of filings after this date.\n\nSome experts, such as Eric Balchunas, point out to an unnecessary pause on the SEC part.\n\nNo one really knows why the SEC is taking their sweet time with these, given how light comments were, these could have easily been trading by now. Could be one 'problem' issuer slowing down process or just summertime lazy/ppl on vaca. Not sure. That said, all indications launch… — Eric Balchunas (@EricBalchunas) July 3, 2024\n\nThe SEC’s feedback to issuers consisted of minor questions that are now being addressed. In May, the SEC approved a proposal by exchanges to list these products, but a separate approval is needed before they can be launched.\n\nGalaxy Digital’s head of asset management believes that spot Ether ETFs will be approved in “weeks” rather than days but agrees the decision will come sometime in July.\n\nWho's joining in?\n\nAsset manager Bitwise has filed an amended S-1 form for an Ethereum exchange-traded fund ahead of its July 8 deadline, indicating the products are nearly ready for launch. Other firms, including BlackRock Inc., Fidelity Investments, 21Shares and Invesco, also have filings waiting for approval.\n\nMany issuers have yet to disclose the fees on their respective funds, which is necessary before trading can begin.\n\nWill price follow?\n\nEther has underperformed relative to Bitcoin for over a year, with Bitcoin posting significant gains bolstered by over $14 billion in flows to its spot ETFs in 2024.\n\nThe anticipated launch of ETH ETFs on July 8 could be a \"golden egg\" for Ether's price action. However, Bitcoin is expected to face sell pressure as $8.5 billion worth is returned to creditors of the collapsed exchange Mt. Gox starting this week, according to a report by K33 analysts.\n\nSource: TradingView\n\nThe 100 EMA frequently serves as a reliable gauge of the general trend, and a break below it could trigger a large sell-off. Having currently regained the critical $3,000 level, Ether now needs to reclaim the $3,360 support level before July 8. If it fails, the short-term rally might be paused."
    }
]