[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxObEZRbDd3NnVSVWl0ekIwV3RyTkYyNU9kVlBoaUNvaERsbUFZNFRHWHlSZHByTTBEQjFQMlNJWXBXUTM3YldtdUM1VUxrcFFLaHBsdUgtVjlCeWpjNUVtVEhXaC1YMTQwRkFRV05qaGdTaF9xX1NYZW9nazFyLUMwbWJia0h6N2tyMW4wWHpXbzBwZE5JSFhiMUhxbW1TLVA2VUFCNHN4czZhQlg5d29QU1hLQnBwZzZ6d3Atck1n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "London Stock Exchange to Accept Applications for Bitcoin, Ethereum ETNs - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQS2luYVJGN1lMNWU4VXJvUTRXSzd0eDNiX3YwQ2hPazMyTzI3SmFjaUo3aXoxb1dtNjd2SHBjWk9RcUxna1Nva0tVbVI2NWtWWXRWUGg4dkZJWmZGS1d2TW96T3hMVml0c214YlA5T1NKSVdNZVZDMjRmR29qNll6TU5nZElja3k2cU5MaA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin ETFs Are a Smashing Success, and Ethereum ETFs May Be Next - Yahoo Finance",
        "content": "Bitcoin (CRYPTO: BTC) ETFs have been a huge success in the U.S., and it makes sense Ethereum (CRYPTO: ETH) ETFs are next. We learned last week that Coinbase (NASDAQ: COIN) is pushing for exactly that.\n\nIn this video, Travis Hoium explains why Ethereum ETFs may not only drive crypto higher, but also could be a double benefit for Coinbase.\n\n*Stock prices used were end-of-day prices of March 9, 2024. The video was published on March 11, 2024.\n\nShould you invest $1,000 in Coinbase Global right now?\n\nBefore you buy stock in Coinbase Global, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Coinbase Global wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of March 11, 2024\n\nTravis Hoium has positions in Coinbase Global, Ethereum, and Solana. The Motley Fool has positions in and recommends Bitcoin, Coinbase Global, Ethereum, Polygon, and Solana. The Motley Fool has a disclosure policy. Travis Hoium is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through their link they will earn some extra money that supports their channel. Their opinions remain their own and are unaffected by The Motley Fool.\n\nBitcoin ETFs Are a Smashing Success, and Ethereum ETFs May Be Next was originally published by The Motley Fool"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPSEpVNTBMWFhoREdkZmJvN1Z3Y0g5ZncxRUNfRGlSYlBfakxxX0haZ3d5LUtVZnJvMl9oM190NDh2RTdwc3N6Nm5tRnlKOFl6VTF4eFJKbEloVTZLemJUQXEwdHlOYXlzQVBEeWx1SzJJbW1hZFRnaUZVam1Rcy1VZFFOWUpKOFhkUlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "London Stock Exchange To Accept Bitcoin and Ethereum ETNs Applications Starting Next Quarter - Yahoo Finance",
        "content": "London Stock Exchange To Accept Bitcoin and Ethereum ETNs Applications Starting Next Quarter\n\nThe London Stock Exchange (LSE) has announced plans to accept applications for Bitcoin and Ether crypto exchange-traded notes (ETNs) in the second quarter of 2024. However, the exact date has yet to be confirmed.\n\nAccording to the LSE's Crypto ETN Admission Factsheet, eligible ETNs must be physically backed and non-leveraged. They must also be backed by Bitcoin or Ether and have a market price or value measure of the underlying asset that is publicly available.\n\nThe underlying crypto assets must be held in a cold wallet or similar storage solution, including cold staking, and by a custodian subject to Anti-Money Laundering laws in the United Kingdom, the European Union, Switzerland, or the United States.\n\nETNs are debt securities that provide exposure to an underlying asset. They allow investors to trade securities that track the performance of crypto assets during the exchange's trading hours.\n\nThe U.K.'s Financial Conduct Authority (FCA) has stated that it will not object to requests from Recognised Investment Exchanges (RIEs) to create a market segment for crypto-backed ETNs.\n\nHowever, these products can only be offered to \"professional investors,\" such as credit institutions and investment firms. However, it will not be available to retail investors, with the statement saying:\n\n“The FCA continues to believe cETNs and crypto derivatives are ill-suited for retail consumers due to the harm they pose. As a result, the ban on the sale of cETNs (and crypto derivatives) to retail consumers remains in place.”\n\nThe FCA has also emphasized that cryptocurrencies are still deemed “high risk and largely unregulated,” and warns the public that their investments could go to zero. The UK government has recently ramped up regulatory efforts in the crypto industry, including allowing law enforcement to seize crypto assets suspected of being involved in illicit activities without a conviction."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1OQWNaMTRrcm5EWW9BS29jaERsZzlTN0U5UTBqN0cwX2lmTUZRY2NjYTJxaFg5b1REOTAxT3cxSWl1QnZocGJtUDI2UzRXa1ZPem1mOGtCbW1zSHU4ZFotMnFEOXhHcC05TmRJQ1UyUDA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "UK regulator to allow crypto-related securities - Financial Times",
        "content": "Print this page\n\nSimply sign up to the UK financial regulation myFT Digest -- delivered directly to your inbox.\n\nThe UK’s financial regulator will allow some bitcoin-linked securities to be listed on the stock market, in a softening of its tough stance on digital assets as investors around the world snap up funds investing directly in cryptocurrencies.\n\nThe Financial Conduct Authority said on Monday it would “not object” to the creation of bitcoin and ethereum-backed exchange traded notes for professional investors.\n\nIssuers can apply to list notes that are linked to the bitcoin and ethereum coins on the London Stock Exchange from April. ETNs are debt securities that track an underlying asset but are traded and settled through a central market entity like a stock exchange and securities depository.\n\nThe news helped push bitcoin and ethereum higher. Bitcoin, the world’s largest cryptocurrency, hit $72,000 for the first time while ethereum touched $4,000 for the first time since December 2021.\n\nThe UK had become one of the last major markets to hold out against the trading of crypto-related securities, even though the government has been championing the country as a potential centre for digital asset markets.\n\nIn 2021 the FCA banned crypto-related derivatives, which included exchange traded products, owing to concerns over the amount of leverage, or borrowing, available to consumers. Some operators offered as much as 100 times leverage on bitcoin.\n\nThe ban — which also covered unleveraged securities — has drawn sharp criticism from members of the crypto industry, who argue that the UK cannot become a leading market for digital assets unless retail investors are given regulated and easy routes into popular tokens such as bitcoin.\n\n“Bitcoin is by far the most well-known crypto asset, and for it to be very difficult for the UK public to be able to buy it, how can we claim to be a crypto hub if we only offer risky ways of buying this asset?” said Tim Lowe, strategic adviser at London-based institutional staking firm Attestant.\n\nRegulators in other major markets have become increasingly comfortable with investors buying crypto-linked securities, as long as the securities are in a regulated product.\n\nAt the start of the year the US approved spot bitcoin ETFs, following countries in the EU, Australia and Canada. Hong Kong has also signalled it will approve ETNs. The newly approved group of US spot bitcoin ETFs, including ones issued by BlackRock and Fidelity, have collectively pulled $10bn since their launch in January, according to crypto investment group CoinShares.\n\n“With increased insight and data due to a longer period of trading history, the FCA believes exchanges and professional investors should now be able to better establish whether crypto-ETNs meet their risk appetite,” the regulator said in a statement.\n\nIt continues to believe “that crypto derivatives are ill-suited for retail consumers due to the harm they pose. As a result, the ban on the sale of ETNs . . . to retail consumers remains in place.”\n\nThe LSE said that securities behind the ETNs could not be leveraged. They must be kept in an offline storage vault and held by custodians subject to anti-money laundering rules in the UK, EU, Jersey, the US and Switzerland."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPN084YVEwMWFiNUVsclVMU2NvZDI3THRtOEdvTWhQUkRfQ2tXeGd3NWRGQ0MxZE5uZElVSVQzZXZpZmJjWEl0YVVwU1lOdjU4TEY0SHVkT1IxOHJpUlV2U2FMakx6dnVmOUhZRXptejJnVnVjMDNvS2lUZjh6ZFpWX2VlZncxN0lCbGdMd1ozR0VpQ0VQM0xvZExoSdIBoAFBVV95cUxNbURCTHJXakI0ZFpEdnZUTml5aHgyb01LOHdkRG5OenByekNxbnNERzZVUnA4cWU4MHpZQkdaOXVDNFpEeEd3SXljRXZFZjdfWnM1eEUwUmZfNzFSMGhzTjBuZnhqWmRMTnFzd1JKeEE0eTZSQTlEXzB3RS1Oc25CQ0ZzVmh4cWRGem5pNEJ6bGc0VmV2eXprV3I5dWIyVlpG?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin rises to another record, ether breaks through $4,000 - CNBC",
        "content": "Last week, bitcoin hit new records in volatile trading for the first time since 2021, before more subdued trading over the weekend.\n\nThe price of the flagship cryptocurrency was last higher by 3% at $72,022.16, according to Coin Metrics. Earlier, it reached an all-time high of $72,750.16.\n\nAt the same time, heightened leverage in the crypto market has led to the biggest price swings in nearly a year, with funding rates at their highest levels since January 2021 and bitcoin open interest at all-time highs.\n\nInflows into U.S. spot bitcoin ETFs continue to drive the cryptocurrency's price action. Last week, crypto investment products saw record inflows totaling $2.7 billion, according to CoinShares. That put the year-to-date total at $10.3 billion, just off the record of $10.6 billion for all of 2021.\n\nMeanwhile, ether broke $4,000 for the first time since December 2021, lifted in part by bitcoin. It was last higher by 3% at $4,034.00.\n\nInvestors were also looking ahead to the Ethereum network's next big tech upgrade, dubbed \"Dencun,\" this week. In the past, the crypto asset has rallied into the day of the upgrade and then seen traders sell on the event.\n\nCiti analyst Alex Saunders pointed out in a note Monday that price action could look different for Dencun given the strength of other key crypto catalysts in play at the moment – specifically, the inflows into bitcoin ETFs, the upcoming Bitcoin halving and the potential that the Securities and Exchange Commission could approve trading of spot ether ETFs in the U.S. in May.\n\nCompanies whose performance is tied to the price of bitcoin was mixed on Monday. Crypto exchange Coinbase advanced gave back earlier gains but closed just under flat as the broader rally in tech cooled. Bitcoin proxy Microstrategy rose 4% after the company purchased another roughly 12,000 bitcoins for more than $821 million in cash, according to a filing.\n\nMiners fell. Marathon Digital lost 12%, CleanSpark fell 16%, Iris Energy lost 5% and Riot Platforms slipped 4%. These were some of the biggest stock market gainers in February but have turned lower for March as investors digest the upcoming Bitcoin halving event, when mining companies' revenue will be slashed.\n\nNew U.K. crypto trading products\n\nElsewhere, the U.K.'s Financial Conduct Authority said Monday that it would allow exchanges to list cryptocurrency-linked exchange-traded products for the first time – two months after spot bitcoin ETFs began trading in the U.S.\n\nSpecifically, the FCA said it would not object to requests from recognized investment exchanges to create a U.K.-listed market segment for crypto-backed exchange-traded notes, or ETNs. The London Stock Exchange said it will accept applications for the admission of bitcoin and ether ETNs from the second quarter of this year.\n\nUnlike an ETF, which is a fund that holds assets, an ETN is an unsecured debt security issued by a bank. It is typically linked to a market index or other benchmark. An ETN promises to pay out at maturity the full value of the index, minus management fees.\n\nBitcoin bulls note this will lead to increased institutional investment into bitcoin and other cryptocurrencies. They say this will, in turn, impact the price positively as more serious money floods into the market."
    }
]