[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQVGJsSmxiaHNETXk3SzVVQTFlV2t0dTlXTkpWOGRkMG1XRlNGV3BDdklTSU53YU5xZXNqSU9oR05UdjV3OGFwUXp0ZEpMZnJoa19HakVrREZjTmNCSDAzM3A2eUFBaHNjeUdUeUlMQjEyajVSenV4bUlmRDM4UTZnWVRUUzlReFo4eVEzeXF4bVE5ekVaY2NIWjIyb3Q5a2I0b09EVUtpWVo5QkY2aE5Halp2dkVMZXF4TDdjZNIBwgFBVV95cUxQVFpXSXh0emZJNHBneVNZcVdseXkzZjFZeWlFeXdiZWZhV1pnWnlLRHFBTllPSXUyQVNfZkdqdmtCVU1kSjlCRWZiQXh0QlpBRU5VR1FQdm96c3ZYelQwV1REdUFCWDFERjdzOW5iSks4bWxtX21UTEQ0aEc1ZDFMekloSmc5bldCRjZtZmpjOGtVMVg2a1lUaF9qcE4za2lrTEpKUWJRd3hhSFV4MWt4THJRdHJhaVNaZUxNX2Y2MGVaUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Gearing Up for More Than 35% Surge, According to Top Analyst – Here’s the Timeline - The Daily Hodl",
        "content": "A closely followed crypto analyst says Ethereum (ETH) is setting up for a sizeable rally after successfully completing a long consolidation phase.\n\nThe pseudonymous crypto analyst known as Pentoshi tells his 742,000 followers on the social media platform X that he believes Ethereum is on its way to the $3,500 range, the upper level of a range he sees ETH trading in.\n\n“ETH.\n\nWent to the mid-range of the new range we are in.\n\nYear-long consolidation into mid.\n\nExpect the higher range sometime Q1 early Q2.”\n\nAt time of writing, ETH is trading for $2,511.\n\nPentoshi is also keeping an eye on ETH’s biggest rival, Solana (SOL). According to the popular analyst, SOL, which had a dramatic run in the latter part of 2023, needs to consolidate for some time before making any new moves.\n\nHe pinpoints the $70 level as potential support for Solana.\n\n“SOL.\n\nThink this is just going to take time to play out. So far following squiggly [line]. While there is support just below here where it bounced from, think there has to be at least 30 days of consolidation somewhere. Even if we don’t see that $70 area.”\n\nSOL is trading for $95.49 at time of writing.\n\nLooking at Bitcoin, Pentoshi says that the recent approval of the spot BTC exchange-traded funds (ETFs) is a huge win for the crypto markets.\n\n“Day one volume record already broken on the BTC ETF. What [does it] mean?\n\nAnd what does it mean for other digital currencies?\n\nWill give a few hints:\n\n1. Others in line for ETF\n\n2. This is a great advertisement for the space. A ton of new eyes and entrants will come as a result\n\n3. You aren’t bullish enough long term.”\n\nBitcoin is trading at $42,625 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOczdtMmRLMGtsdXdEU01KVk1IRnVYbFhmd2lLSVhUUEhEZnF1bE9wM0JPeHZIQmI4elpON204LURveXJPYngwazRrckI2cUpQdmhpTHlNYXY0Z1dydl9hbHIzYUNaYlBpNXQ2UGY3VU5CNHpfYS1mb2c4emJVNE03RHZ2OWNTMFh1LXNqa3libTZZcTNWNjFxcWJORWVob0Z2ckdseDRreUMwRVJoRm5TRmpGVEZMc1dYeFNTQdIBwgFBVV95cUxPYWNCZlAwZldVRE54ZEVaX19wU3pDd2pIanI2eC1aN0xwRXZ6cm1VYVBtaDRpcG42N1pjQzdqSFhLd1BqR2hjYjJRQnFCV1FsNnRRLWpkSDZ5Y2VDTDdtNExJWTBJajdGWVl5TjlLUDdTRHZzRWZQUzhVZV9YMkxaMEgwdnp4MzFyUnlxczhRN0hMcklYZDd1UjNaZG1ZN0h4ZzdmcER0NmNCZ0RhamI4aXhkQ1ZXaUpoc2FIZW1VMlhJUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Rival Records Nearly 2,000% Growth in Unique Active Wallets Last Year: DappRadar - The Daily Hodl",
        "content": "Crypto intelligence platform DappRadar says user activity on one Ethereum (ETH) challenger exploded in 2023 as decentralized applications (DApps) saw remarkable growth during the period.\n\nAccording to DappRadar’s yearly industry report, smart contract platform Near (NEAR) recorded 302,000 new unique active wallets (UAWs) last year, marking a year-over-year (YoY) increase of 1,902%, the most out of any chain.\n\nEnterprise-grade blockchain Klaytn (KLAY) and layer-2 scaling solution Arbitrum (ARB) rank next to Near as the networks with the highest UAW increase gain with 73,000 new UAWs, representing a 1,099% increase, and 88,000 UAWs, a 624% increase, respectively.\n\n“In terms of chain performance, Near, Klaytn, and Arbitrum were the top gainers in UAW percentage increase. They had also a good performance looking with their token, as Near had an increase of 200% since the beginning of the year, Klaytn a 20% and Arbitrum a 32% increase since its launch in March 2023.”\n\nConversely, DappRadar says Ethereum rival Solana (SOL) recorded only 65,000 new UAWs in 2023, a 76% drop on a year-over-year basis. Web3-focused blockchain Hive (HIVE) saw 77,000 new UAWs, representing a 68% drop, as per the firm.\n\n“Solana experienced a rough start of the year, influenced by its association with the FTX fallout. However, the Solana ecosystem saw an impressive recovery during the last months of 2023. Hive, primarily hosting the trading card game Splinterlands, also had a difficult year, missing financial targets and reporting significant losses.”\n\nOverall, DappRadar says the DApp industry had a good run in 2023 with a 124% YoY increase in UAWs and ending the year with an average of 4.2 million daily UAWs.\n\n“In 2023, the DApp industry surpassed all expectations, and reinforced the notion that it’s an enduring and evolving part of the global financial and technological landscape.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNWlFkNHpnbngzYnR0QVBwb2xlMndJTlREbjBPZEhCU0FnZzZSZ0VUVjVkM2NINWxNTlNoaVcxUU43ZktUdmVISGh4ZnRqa01OYVZtSUY4SHpERHNCejlxbE1fV0dwVUVHbEoxUVUwRmFmVWdvLWY0YmVLN05FUl9ZbC1R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Where Will Ethereum Be in 3 Years? - The Motley Fool",
        "content": "Although Ethereum appears to be getting lost in the fray, it has quietly climbed to its best level in nearly two years. But can that continue?\n\nEthereum (ETH 0.17%) is a cryptocurrency that really doesn't get as much attention as it probably should. Over the past week, that's certainly true, with any sort of discussion around Ethereum dwarfed by the massive catalyst that hit the overall crypto sector -- the highly anticipated approval of spot Bitcoin (BTC -0.17%) ETFs by the Securities and Exchange Commission (SEC).\n\nThis key catalyst initially drove a significant amount of buying interest in Bitcoin but has since given way to outperformance for Ethereum. As it turns out, investors are clearly focused on the next crypto with a big catalyst on the horizon, which could certainly be the introduction of spot Ethereum ETFs. Given the rather positive stance regulators have taken with Ethereum, market anticipation around such an event has driven Ethereum upward this week to levels not seen since spring 2022.\n\nNow, the question is whether this momentum can continue. For long-term investors, the question of where Ethereum may be in three years' time is one that is certainly worth trying to answer.\n\nNo one knows where any asset will ultimately end up over any given period of time, and I'm not going to suggest I have a crystal ball. However, I'll attempt to at least rationalize why I think Ethereum will more likely than not continue to move higher over the next three years and potentially surge past its previous highs.\n\nEthereum ETF hype should be taken seriously\n\nIt's not just crypto bros, talking heads, and pundits suggesting spot Ethereum ETFs could be on the horizon. There's been some rather compelling commentary from big-name investors around the potential approval of such investing vehicles, with Blackrock (NYSE:BLK) CEO Larry Fink opining on this topic.\n\nFink noted in a recent interview that he believes there's \"value\" in a spot Ethereum ETF being launched at some point. His view is that Ethereum is among the most viable assets within the crypto space, and while these aren't necessarily currencies by technical definition, they do carry value similar to other assets like gold. That's a rather widespread view among mainstream investors, and given the SEC's stance toward Bitcoin and Ethereum, if regulators take a similar view, it's certainly likely we could see spot Ethereum ETFs on the horizon.\n\nIt's worth pointing out that Blackrock is among the companies that have applied for a spot Ethereum ETF already. So, perhaps there's some level of \"talking his book\" that investors need to price in. But given the interest major institutional investors have in promoting digital assets as a viable investment-grade option, Ethereum certainly has a future catalyst investors need to watch closely.\n\nTokenization likely to remain a key catalyst for Ethereum investors\n\nThe tokenization of real-world assets, or the ability to trade rights to physical assets such as art, collectibles, or even real estate, is a trend that's continuing to gain steam. In 2023, it's been estimated that the total value of all real-world assets that have been tokenized and trade on the blockchain has doubled, from around $1 billion at the start of 2023 to $2 billion at year's end. Notably, much of the trading volume in this nascent space has taken place on Ethereum's network, given its scale and ubiquity among users in the decentralized finance sector.\n\nEthereum's pole position as the leading blockchain for anything tied to decentralized finance (including tokenized real-world assets) benefits investors. Ethereum's token price has proven to be correlated over long periods of time to its network activity. Considering Ethereum's impressive ecosystem growth over the years, some investors have called into question where the next growth catalyst will come from. In the past, gaming and non-fungible tokens (NFTs) alongside other financial services took center stage. But given the nascent nature of the tokenized real-world assets market, this could be the next growth catalyst that drives Ethereum's fundamentals, and its price, higher over time.\n\nDoes Ethereum have what it takes to make new highs over the next three years?\n\nLong-term investors can find plenty of other catalysts to focus on when it comes to Ethereum. After all, this ecosystem is vast and supports a great deal of the utility created in the crypto space. The launch of an ETF, continued growth in tokenization, and future Ethereum-network upgrades all remain key catalysts to watch over the next three years. However, who knows, maybe a bigger and more prominent catalyst will materialize. After all, this innovative space continues to evolve in rapid fashion, and I wouldn't rule it out.\n\nMy view is that over the next three years, Ethereum will continue to see the sort of volatility it's seen in the past. But given its fundamental tailwinds, and the potential for the macro- and monetary-policy environments to improve, I think it's far more likely that Ethereum makes new highs rather than multiyear lows."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPckUxY2I5VW9IVXc1NUdaVUQwZXFocXBNZWNNXzlKWkZJZEprYjNwZlN6T3BNYy1XaGdQaEp5Qk81aWpQcWF0VUIweXByaW16Y3pWT0dTanBjMnpiQ3R6RG45azkwTFVMS192TU55SkdERmVhZGJ2eEZndXFmRlZfRUpiRU05am83d2FyeVU2bFV6UFF3N0ZEVHJvMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Could Reach $5k in 2024 If this Scenario Plays Out - crypto.news",
        "content": "Ethereum price has prodded above $2,500 on Jan. 15, further stretching its post-ETF approval lead over BTC, on-chain data trends provide vital insights into the underlying drivers.\n\n‘Buy-the-rumor, sell-the-news’ is a popular trading strategy where speculators make acquisitions ahead of a material news event in hopes of selling at a profit when news is confirmed. BTC speculators capitalized on this trading strategy to earn historic gains in the build-up to the spot Bitcoin ETF approval verdict. Vital on-chain data trends now reveal that Ethereum (ETH) has also begun to show early signs of a similar phenomenon.\n\nBTC speculators earned 97% profits in build-up to ETF approval\n\nThe Bitcoin spot ETF approval quest suffered multiple setbacks recently, with the U.S. Securities and Exchange Commission (SEC) citing market manipulation, oversight, and liquidity concerns.\n\nHowever, on June 15, 2023, things turned positive when BlackRock (NASDAQ: BLK) officially filed for a spot Bitcoin ETF with the SEC. With over $13 trillion in assets under management (AUM), BlackRock is one of the largest asset management firms in the world.\n\nBlackRock’s entry into the fray raised optimism about Bitcoin derivatives and effectively spun the rumor mill.\n\nAs of June 15, Blackrock’s official filing date, Bitcoin price was trading around $24,800. Within the first two weeks, speculators who aped-in early on the rumor sent Bitcoin price rallying 25% to hit $30,000 for the first time in 12 months, dating back to June 2022.\n\nBitcoin (BTC) price action in build-up to spot ETF Approval June 2023 – Jan. 15, 2024 | Source: TradingView\n\nBetween June 15 and Jan. 11, when the SEC eventually confirmed the news, Bitcoin price nearly doubled, moving from $24,800 to a local top of $48,890. This effectively sent speculators who bought the rumor after BlackRock’s filing into 97% profit.\n\nUnsurprisingly, the wave of profit-taking that ensued in the aftermath of the SEC approval has sent BTC price spiraling to 15% toward $42,500 as of Jan. 15. This affirms the full cycle of the buy-the-rumor, sell-the-news cycle on the spot Bitcoin ETF narrative.\n\nWith the Bitcoin ETF now at a conclusion, investors have switched focus to Ethereum. BlackRock had filed for spot Ethereum ETF on Nov. 16. In a recent interview on Jan. 12, BlackRock CEO Larry Fink re-emphasized the value of an Ethereum spot ETF as an asset class.\n\nWhile the BTC price has dropped by 3.8%, Ethereum has increased by 13.5% in the past week. In effect, ETH price has outperformed BTC by approximately 10%.\n\nEthereum (ETH) vs. Bitcoin (BTC) price performance – Jan. 9 – Jan. 15, 2024. Source: Coin360\n\nInterestingly, in addition to this divergent interplay between ETH and BTC price movement over the past week, strategic on-chain movements from Ethereum whales since Jan. 11 also corroborate early signals of the buy-the-rumor strategy playing out in ETH markets.\n\nEthereum whales have acquired $1.4 billion ETH since Bitcoin ETF approval verdict\n\nOn paper, Ethereum price has outperformed BTC by 10% in the past week, per Coin360 data. Looking beyond the price charts, a vital on-chain indicator has revealed that ETH’s performance has been boosted by corporate entities and high net-worth investors who increased their buy pressure shortly after the Bitcoin ETF approval verdict.\n\nSantiment’s ‘supply held by top addresses’ metric shows a real-time snapshot of the aggregate balances currently controlled by the largest wallets in a crypto ecosystem.\n\nThe latest readings show that the top 1,000 Ethereum wallets held just 66 million ETH in cumulative balances as of Jan. 10.\n\nBut since the focus switched to spot Ethereum ETF, strategic ETH investors have entered a buying spree, adding 570,000 ETH to bring their balances to 66.5 million ETH at press time on Jan. 15.\n\nEthereum (ETH) supply held by top addresses | Source: Santiment\n\nValued at the current price of $2,540, the Ethereum ‘top holder supply’ chart above illustrates that the top 1,000 investors have added ETH coins worth $1.4 billion to their holdings in the last four days alone.\n\nIntuitively, when the largest stakeholders increase their balances rapidly by hundreds of millions, it is interpreted as a strong bullish signal. Firstly, the buying trend among the largest stakeholders increases overall confidence within the cryptocurrency’s ecosystem.\n\nGiven that large holders are often likely to hold longer than small-holder swing traders, this accumulation puts ETH in a prime position to score historic gains in the weeks ahead.\n\nEthereum market dominance climbs after spot Bitcoin ETF approval | Source: TradingView\n\nBut more importantly, the timing of the recent buying spree suggests that investors are buying the rumor with optimism that Bitcoin’s ETF approval will increase the likelihood that ongoing ETH applications will also obtain a positive verdict from the SEC.\n\nThe Ethereum Dominance (ETH.D) chart further affirms this stance. Ethereum has cornered 14% more market share between Jan. 10 and Jan. 15, while Bitcoin price has declined at a nearly identical 15%.\n\nThis suggests that speculative traders are selling the news on BTC, rapidly buying the rumor ahead of a possible spot ETH ETF approval verdict.\n\nETH price forecast: can Ethereum reach $5,000 in 2024?\n\nFrom the data points analyzed above, the large holder wallets’ accumulation and the rising ETH dominance suggest that the buy-the-rumor strategy is now widely in play in the Ethereum markets.\n\nGiven that Bitcoin had scored 97% gains in the build-up to the spot ETF approval verdict, a similar performance could put ETH in line to reach $5,000 in the instance of a positive outcome.\n\nBut in the short term, the ETH bulls will have to scale the $2,900 resistance to keep the momentum going. IntoTheBlock’s Global In/Out of the Money chart, which highlights potential support/resistance points using the historical entry prices of current ETH holders, also supports this ETH prediction\n\nIt shows that with ETH prices currently trading above $2,500, 91% of all ETH holders are now in profit positions. With the ETH ETF approval process on the front burner, these holders could increasingly become less inclined to sell.\n\nHowever, the 8.5 million Ethereum holders who bought 4.1 million ETH coins could pose significant resistance if they book early profits as prices approach their break-even point.\n\nEthereum (ETH) price forecast | Jan. 2024 | Source: IntoTheBlock\n\nThe bears could negate this bullish prediction if the ETH price unexpectedly retreats below $2,000. However, 7.9 million investors acquired 43.4 million ETH at the maximum price of $2,039.\n\nConsidering this is the largest cluster of ETH current holders, they will likely have enough in the tank to overturn such bearish pressure."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE1sdmhWWVQxWG5BQlY3cjN3YkR1RjFFY2UyZ19mYkVqN0hkbWpBSVJkRXpJSUE2OV9nOWZBMWc3cXFzejJ0blVyQnFpU25pRkVLUWw2NmUxc0NOYzNFRWxKbE5zbVdLdjjSAWxBVV95cUxPRnNKcXQ1UGFuNnJHVW5OQ2NkWjFBS2loNVVZX0QyQU85QzlPU3V5clpYV0hMM2dZLVZnWk5oZ0JfVzF0aUpSRG1zT19Xc0JtbkpWNlJORnlhTFNJUVpkREF6ZGZ1dTRNSkFWdzA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Can Ethereum flip Bitcoin by 2030? - AMBCrypto News",
        "content": "Ethereum’s transition to PoS puts it on course to give Bitcoin a fight.\n\nA prediction said that Ethereum’s revenue could hit $51 billion by 2030 while ETH may hit $11,848.\n\nDestiny cannot be denied. It can only be delayed. This statement explains the sentiment of those who believe that Ethereum [ETH] will flip Bitcoin [BTC] by 2030. However, this discussion has been going on for a long time.\n\nBut at the time of writing, Ethereum had not yet flipped Bitcoin in terms of market cap.\n\nDespite the state of things, some Ethereum supporters argue that the flipping would happen. AMBCrypto checked if there was any time that the smart contract blockchain came close to overtaking Bitcoin.\n\nAccording to data from Blockchain Center, Ethereum’s market dominance rose to 36.9% in June 2017.\n\nAt that, Bitcoin’s dominance was around 44.4%. Eventually, the flipping did not happen. But between that period and now, a lot of things have changed.\n\nEthereum’s new model changes Bitcoin’s operation\n\nOne of the major changes was Ethereum’s move away from Proof-of-Work (PoW). Up until September 2022, both Bitcoin and Ethereum utilized the PoW consensus mechanism.\n\nThe PoW mechanism allows the verification of transactions through miners. In this case, miners get rewards for adding computation power to the network. But Ethereum stopped using that method and transitioned to Proof-of-Stake (PoS) during a major upgrade called “The Merge.”\n\nWith PoS, Ethereum no longer needs miners but validators. Here, users don’t have to be miners, and they also get rewarded for validating new blocks of transactions.\n\nThis “ease” has aided Ethereum’s popularity. It is also one of the reasons some predictions are confident that Bitcoin will play second-fiddle by 2030.\n\nHowever, Bitcoin has not been resting on its oars. Recent developments have proven that the Satoshi Nakamoto-developed project could be ready to fight Ethereum pound for pound.\n\nCompetition escalates between the kings\n\nThis assertion could be linked to the creation of NFTs on the Bitcoin network. During the 2021 bull market, NFTs got popular, and most of them were built on the Ethereum blockchain. For this reason, demand for ETH increased.\n\nHowever, the introduction of Bitcoin Ordinals in 2023 Q1 has ensured that Ethereum has intense competition in that regard. AMBCrypto looked at CryptoSlam’s data and found that Bitcoin was giving its opposite number a run for its money.\n\nAt press time, NFT seven-day sales on the Ethereum blockchain were $92.39 million. Bitcoin was a close second with $90.18 million within the same period.\n\nSo, if demand for ETH rises as a result of these assets, there is a high chance that BTC also follow. Should this remain the same case, Ethereum flipping Bitcoin by 2030 would be difficult.\n\nFurthermore, Ethereum dominating the Decentralized Finance (DeFi) space makes a strong case for the flipping. This is major because of its smart contract functionalities.\n\nAt the peak of the bull market in 2021, Ethereum’s Total Value Locked (TVL) hit $97 billion.\n\nThe TVL determines the total value of digital assets locked in a protocol. So, the increase at that time implied that market participants trusted the project enough to continuously add liquidity to it.\n\n5 figures for ETH by 2030?\n\nThis DeFi dominance is why some analysts believe that the Vitalik Buterin-led project can bite into Bitcoin’s market share. For example, in May 2023, VanEck predicted that the blockchain’s revenue could rise as high as $51 billion by 2023.\n\nThe research also mentioned that Ethereum’s dominance among smart contracts protocols could rise to 70%. The mutual fund and ETF management firm also talked about the price, noting,\n\n“In our Base Case, we assume that Ethereum will achieve $51B in annual revenue in the year ending 4/30/2030. We deduct a validator fee from this total, 1%, and a global tax rate of 15%, and we arrive at cash flows of $42.90B to Ethereum. Assuming an FCF multiple of 33x, 120.7M token, we come to a Base Case 2030 Price Target of $11,848 per token.”\n\nOn an all-time basis, ETH’s price has increased by 89,382.45%. BTC, on the other hand, had seen its value rise by 68,863,742%. By comparing both prices, one can assume that ETH was undervalued massively undervalued compared to Bitcoin.\n\nHowever, there have been predictions that the Bitcoin price could rise higher. One of the reasons could be linked to the recently-approved Bitcoin spot ETFs.\n\nWith the ETF approval, more institutional capital is expected to flow into Bitcoin. This could also affect the price action positively. As a result of this, ARK Invest CEO Cathie Wood noted that BTC could cross the $1 million mark by 2030.\n\nEthereum flips Bitcoin here\n\nIn the meantime, analyst Michaël van de Poppe believes that the Bitcoin spot ETF approval was a signal for ETH to shine. According to him, the development could force liquidity rotation into the Ethereum ecosystem.\n\n#Ethereum approaches the low of 2022 and is likely going to take the liquidity there. If an ETF approval for #Bitcoin happens, I think we'll have a liquidation candle on ETH/BTC and after that a rotation into Ethereum, combined with a bullish weekly divergence. pic.twitter.com/kGq91S7kq9 — Michaël van de Poppe (@CryptoMichNL) January 9, 2024\n\nBut will this lead to Ethereum flipping Bitcoin? Well, that might be hard to decide, considering that an Ethereum spot ETF could be approved before or by May 2024.\n\nRegarding the number of holders, AMBCrypto analysis of Santiment showed that BTC had 52.76 million. ETH, on the other hand, had more than double that at 112.52 million.\n\nCan Ethereum flip Bitcoin by 2030? Our verdict\n\nThis data indicated that Ethereum had experienced more adoption than Bitcoin. If the growth continues in this manner, then it could increase its chances of flipping Bitcoin by 2030.\n\nAnother possible impact of the flipping is the supply. For Bitcoin, it has a fixed supply of 21 million coins. This is one of the reasons Ethereum might find it hard to flip it.\n\nBecause if demand for BTC increases with its fixed supply, the price and market cap will go higher.\n\nThe supply of ETH, however, is unlimited. But the project, thanks to its burning mechanism, ensures that demand matches the ETH supply.\n\nAlso, the shift to PoS had greatly impacted the tokenomics. This is also one of the reasons market participants have stuck to ETH since it became a yield-generating asset.\n\nGiven its different use cases, demand from retail and institutions alike is expected to increase.\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nBut to flip Bitcoin would be a hard nut to crack. Furthermore, 2030 is a long time to predict what would happen with both projects.\n\nBut considering the recent developments, Ethereum might get very close to flipping Bitcoin. However, it is not guaranteed that the former would surpass the number one cryptocurrency by that time."
    }
]