[
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxOMWxGb1JlcjJDeEFjd19fVms5cWk5YmVpbEdmWkxLbjZ4SHhVcnVkRHJoTGt4MWh4TEdSNEJZNllySzQ0VnNHU09fMk5NNmJLSHJlcTU1YWw2eFVZT1BNcFRQWXNtT1VmTWNZejRZWXVheG1CWl92SXNEZHBkZUluWGRIalhUaVZZelBKWk4yYzNWWVRaaFotbjVfT2R3Mnh4V21CR2JqYl9lMXRLaFRrcFhlbXB2TXhyaWt0YnpWbTFaSkRCbk1iMHNmclNsazBDMERsYkl4WmJtN2w5SE1yc2RvMFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Spot ETFs On The Horizon: Regulatory Approval Expected By Fourth Of July: Report - Benzinga",
        "content": "The Securities and Exchange Commission is reportedly on the verge of greenlighting exchange-traded funds linked to the spot price of Ethereum ETH/USD.\n\nWhat Happened: Discussions between asset managers and regulators are nearing their end and the hotly anticipated investment avenues could go up for listing as soon as July 4, a Reuters report indicated Wednesday.\n\nExecutives from two of the firms anonymously revealed that the process of amending the offering documents is down to resolving minor issues. A lawyer associated with one of the issuers stated that approval is likely just a week or two away.\n\nEight asset managers, including BlackRock, VanEck, and Grayscale Investments which had previously launched spot Bitcoin BTC/USD ETFs such as iShares Bitcoin Trust IBIT, VanEck Bitcoin Trust HODL, and Grayscale Bitcoin Trust GBTC, are seeking SEC approval for the funds.\n\nSee Also: Here’s How Much Profit Donald Trump Would Make If He Sold His TRUMP Memecoin Today\n\nWhy It Matters: The launch of funds tracking the spot price of Bitcoin BTC/USD in January was a massive success, attracting about $8 billion in assets. As of late June, these nine new products have nearly $38 billion in assets. However, some ETF and cryptocurrency analysts believe the launch of the new spot ether ETFs will be less impressive due to ether’s smaller market cap and trading volumes.\n\nThe latest speculation comes a week after Bloomberg ETF analyst Eric Balchunas moved up the launch date for the ETFs to July 2. Balchunas had said that there was a “decent chance” the SEC would declare them effective and get it off their plate before the holiday weekend.\n\nIn a recent interview, SEC Chair Gary Gensler highlighted the smooth progress of ETF filings He indicated that the final decision lies with asset managers to make full disclosures for the registration statements to go into effect.\n\nWhile the enthusiasm was palpable, a few analysts predicted that the launch could potentially lead to a 30% drop in Ether's price.\n\nPrice Action: At the time of writing, Ether was exchanging hands at $3,377.13, following a 1.06% drop in the last 24 hours, according to data from Benzinga Pro.\n\nPhoto Courtesy: Shutterstock.com\n\nRead Next: Congressman Matt Gaetz Introduces Bill To Allow Federal Tax Payments In Bitcoin\n\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxOMWxGb1JlcjJDeEFjd19fVms5cWk5YmVpbEdmWkxLbjZ4SHhVcnVkRHJoTGt4MWh4TEdSNEJZNllySzQ0VnNHU09fMk5NNmJLSHJlcTU1YWw2eFVZT1BNcFRQWXNtT1VmTWNZejRZWXVheG1CWl92SXNEZHBkZUluWGRIalhUaVZZelBKWk4yYzNWWVRaaFotbjVfT2R3Mnh4V21CR2JqYl9lMXRLaFRrcFhlbXB2TXhyaWt0YnpWbTFaSkRCbk1iMHNmclNsazBDMERsYkl4WmJtN2w5SE1yc2RvMFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Spot ETFs On The Horizon: Regulatory Approval Expected By Fourth Of July: Report - Benzinga",
        "content": "The Securities and Exchange Commission is reportedly on the verge of greenlighting exchange-traded funds linked to the spot price of Ethereum ETH/USD.\n\nWhat Happened: Discussions between asset managers and regulators are nearing their end and the hotly anticipated investment avenues could go up for listing as soon as July 4, a Reuters report indicated Wednesday.\n\nExecutives from two of the firms anonymously revealed that the process of amending the offering documents is down to resolving minor issues. A lawyer associated with one of the issuers stated that approval is likely just a week or two away.\n\nEight asset managers, including BlackRock, VanEck, and Grayscale Investments which had previously launched spot Bitcoin BTC/USD ETFs such as iShares Bitcoin Trust IBIT, VanEck Bitcoin Trust HODL, and Grayscale Bitcoin Trust GBTC, are seeking SEC approval for the funds.\n\nSee Also: Here’s How Much Profit Donald Trump Would Make If He Sold His TRUMP Memecoin Today\n\nWhy It Matters: The launch of funds tracking the spot price of Bitcoin BTC/USD in January was a massive success, attracting about $8 billion in assets. As of late June, these nine new products have nearly $38 billion in assets. However, some ETF and cryptocurrency analysts believe the launch of the new spot ether ETFs will be less impressive due to ether’s smaller market cap and trading volumes.\n\nThe latest speculation comes a week after Bloomberg ETF analyst Eric Balchunas moved up the launch date for the ETFs to July 2. Balchunas had said that there was a “decent chance” the SEC would declare them effective and get it off their plate before the holiday weekend.\n\nIn a recent interview, SEC Chair Gary Gensler highlighted the smooth progress of ETF filings He indicated that the final decision lies with asset managers to make full disclosures for the registration statements to go into effect.\n\nWhile the enthusiasm was palpable, a few analysts predicted that the launch could potentially lead to a 30% drop in Ether's price.\n\nPrice Action: At the time of writing, Ether was exchanging hands at $3,377.13, following a 1.06% drop in the last 24 hours, according to data from Benzinga Pro.\n\nPhoto Courtesy: Shutterstock.com\n\nRead Next: Congressman Matt Gaetz Introduces Bill To Allow Federal Tax Payments In Bitcoin\n\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPTFRPbGlUa3BETjlkYWttWDB2MU1RN25PR1I1b0VyOUs3NHpER19BWDJ3VV9PU2ZfWEdJeVBrd2ItMnJ3MENxc1dFZktRX0hCVUNvNmsxRno1al9WSUc3Ujc0ekU4QVQyRkpsUUtnWTZPQng2ZG9nbVlSbldnYXhic3hRdTVlVnhtWlRpU0swRlFqTmpHb1dUXzVrdEdHOGVpLUZYNGdRQ181Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Investing in Ethereum ETFs: What to Know - The Motley Fool",
        "content": "Ethereum (ETH -5.71%) exchange-traded funds (ETFs) offer a convenient way to invest in the second-largest cryptocurrency by market capitalization in a manner similar to buying stocks. Much like the early days of Bitcoin ETFs, the landscape for Ethereum ETFs currently features futures-based options, while spot ETFs are still pending regulatory approval.\n\nDefinition Icon Cryptocurrency Cryptocurrency is decentralized and secure digital money, based on blockchain technology, that offers new investment opportunities.\n\nIn this article, we'll explore the available Ethereum ETFs, examining both the futures-based products currently accessible and the potential future of spot Ethereum ETFs. We'll also provide guidance on how to invest in these ETFs, offering insights into their structure, the benefits they offer, and considerations for investors looking to add Ethereum exposure to their investment portfolios.\n\nImage source: Getty Images.\n\nWhat is it? What is an Ethereum ETF? The easiest way to understand Ethereum ETFs is to break them down into two main components. Ethereum itself is a blockchain platform with its own cryptocurrency, Ether (ETH). It's widely used for its smart contract functionality, which enables automatic, decentralized agreements that execute when their conditions are met.\n\nDefinition Icon Ethereum (ETH) Ethereum is a blockchain created in 2015 that is supported by a decentralized network of computers all over the world.\n\nAn ETF is an open-ended investment fund that holds assets like stocks, commodities, bonds, or even cryptocurrencies. ETFs are unique because they trade on stock exchanges much like individual stocks, offering the liquidity and accessibility that typical mutual funds do not. Combining these, an Ethereum ETF is a type of investment fund that either holds Ethereum directly or invests in related derivatives like Ethereum futures contracts. This setup allows investors to gain exposure to Ethereum's market movements without buying and holding the actual cryptocurrency through a crypto exchange or dealing with the complexities of digital wallet security. Essentially, when you buy shares of an Ethereum-based ETF, you're indirectly investing in Ethereum's performance with all the trading ease of traditional stocks. Holdings What do Ethereum ETFs hold? Due to regulatory constraints, U.S. Ethereum ETFs are currently unable to hold Ethereum directly. Instead, these ETFs gain exposure to Ethereum through Ethereum futures contracts traded on the Chicago Mercantile Exchange (CME). These futures allow investors to speculate on the future price of Ethereum without the challenges -- such as security and custody -- of managing actual cryptocurrencies.\n\nSince these futures are based on Ethereum's anticipated future price, they provide a method for investors to gain indirect exposure to Ethereum's price dynamics. Due to the nature of futures trading, which requires a margin, it is common for Ethereum ETFs to maintain significant holdings in cash or cash equivalents. Low-risk assets, like money market funds, commercial paper, or Treasury bills, are often used as collateral for these trades. This setup ensures that the ETF can meet potential margin calls during periods of high volatility, thereby securing the leveraged positions taken on futures contracts. What is Ethereum? What is Ethereum? Ethereum, launched in 2013 by Vitalik Buterin, is a comprehensive decentralized finance (DeFi) platform for decentralized applications (dApps) and smart contracts that run autonomously without a central authority. Ether is Ethereum's native cryptocurrency and is essential for operating dApps and executing smart contracts. It serves as \"gas,\" paying for the computational resources needed to execute operations and giving Ethereum its value. Ether trades on various cryptocurrency exchanges and is used both as an investment and a utility token. In September 2022, Ethereum underwent a major update, transitioning from a proof-of-work (PoW) to a proof-of-stake (PoS) system. This shift significantly reduced the platform's energy consumption by changing how transactions are verified and blocks are added to the blockchain. Instead of miners solving puzzles, validators now stake Ether to earn the right to validate transactions and yield, enhancing Ethereum's sustainability and scalability. Spot ETFs Spot Ethereum ETF approval While Canadian securities regulators have allowed spot Ethereum and other cryptocurrency ETFs to trade since April 2021, the U.S. Securities and Exchange Commission (SEC) has been slower to adopt similar measures. This landscape shifted significantly on May 23, 2024, when the SEC finally greenlit spot Ethereum ETFs. However, these ETFs have not yet started trading in the market since the SEC still needs to approve the individual prospectuses submitted by ETF issuers aiming to launch these products. SEC Chair Gary Gensler has suggested that the process should be completed by the end of summer, although no specific timeline has been confirmed. Once these approvals are in place, though, spot Ethereum ETFs will be allowed to begin trading on exchanges.\n\nHow to buy How to invest in Ethereum ETFs Investing in Ethereum ETFs is straightforward and follows the same procedure as trading any other ETF or stock. Here's a step-by-step guide to help you get started: Figure out your position size: Decide how much of your portfolio you want to allocate to Ethereum ETFs in terms of dollar value. Consider whether this investment fits with your overall risk tolerance and investment strategy versus regular stocks. Pick the right ETF: In the next section, we've provided a table of the major Ethereum ETFs currently available. Choose the one that best meets your needs based on factors like fees, liquidity, and past performance. Search the ETF on your brokerage: Locate the ETF by typing its full name or ticker symbol into your brokerage's search function. Make sure you select the option for \"shares\" or \"equity\" to ensure you are purchasing the ETF itself and not options based on it. Enter an order: Specify the number of shares you wish to buy. You can place a market order, which executes the trade at the next available price, or a limit order, which sets a maximum price you are willing to pay and executes only if the share price meets or falls below this threshold. Finishing up: If your order is successful, your brokerage account will reflect the purchase, with the ETF shares added and the corresponding amount of cash deducted. Top three Top three Ethereum ETFs Here's an overview of the largest Ethereum ETFs on the market in terms of assets under management (AUM):\n\nLargest Ethereum ETFs by assets under management, June 2024. Fund Name Ticker Symbol Net Expense Ratio ProShares Ether Strategy ETF (NYSEMKT:EETH) 0.95% VanEck Ethereum Strategy ETF (NYSEMKT:EFUT) 0.66% Bitwise Bitcoin and Ether Equal Weight Strategy ETF (NYSEMKT:BTOP) 0.85%\n\nRelated investing topics\n\nOutlook An outlook for Ethereum ETFs Currently, investors can trade Ethereum futures ETFs, and with the recent SEC approval, spot Ethereum ETFs are expected to hit the market soon. The ETFs offer the convenience of trading through a regular brokerage account, eliminating the need for a crypto exchange or self-custody of digital assets. However, it's important to note that these ETFs incur expense ratios and do not offer the 24/7 trading capability that direct investments in the cryptocurrency sector provide. Looking ahead, much like Bitcoin ETFs, which have attracted significant investor interest and led to new price highs for Bitcoin, Ethereum ETFs may similarly benefit from substantial inflows and expanded interest from retail investors.\n\nFAQ\n\nInvesting in Ethereum ETFs FAQ Which Ethereum ETF is best? angle-down angle-up There's no universal answer, but the VanEck Ethereum Strategy ETF (NYSEMKT:EFUT) is a great candidate with a lower 0.66% expense ratio. Is there an Ethereum ETF in the U.S.? angle-down angle-up U.S. investors can currently buy Ethereum futures ETFs. Spot Ethereum ETFs, which were recently approved, are still awaiting launch. How to get Ethereum ETFs? angle-down angle-up You can buy shares of Ethereum futures ETFs via most brokerages. Spot Ethereum ETFs are still unavailable. Is there an Ethereum spot ETF? angle-down angle-up Spot Ethereum ETFs are available on Canadian exchanges, denominated in both Canadian and U.S. dollars. U.S.-listed spot Ethereum ETFs are still unavailable, although they have received regulatory approval."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5qQU43TjkzWVFmQkJiMndRYXc0NVAtbmtnTUNPdThhM0Y5bW9zeUhqOExPVXFINGpNS1ZVVkxMUW9yeU55cDFMOTJRY2UtX0ctVS1iekdBc1JaZFFBbGNFY1pULXdSYVdfdnFOcWxlMnhmMkZBMWpnRTNTX2FZZ28?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "7 Cryptos to Watch This Week: Bitcoin, Ethereum and More - Yahoo Finance",
        "content": "If you can’t handle the extreme ebb and flow of high-risk asset classes, the cryptocurrency market probably isn’t right for you. We’re getting a taste of the wildness of the blockchain ecosystem, with the total market capitalization of all cryptos slipping conspicuously on Monday. At the moment, the value of global virtual currencies comes in at $2.26 trillion.\n\nOf course, that’s disappointing for those who recently got into the space. Previously, the sector had done a good job of holding onto the $2.5 trillion market cap support line. Unfortunately, with the benchmark digital assets slipping badly in recent sessions, investors need to prepare for possibly extended rough waters.\n\nWhat’s causing the choppiness in the high seas? Some experts point to the German government standing poised to liquidate a significant amount of cryptos “earned” through illicit means. Further, some evidence exists that the whales — or the big dogs in the market — have slowed their trading activity. With the fading momentum, people aren’t as eager to participate in cryptos.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nFrankly, the erosion of major tech players like Nvidia (NASDAQ:NVDA) probably doesn’t help either in terms of ginning up sentiment. Still, that could also spell discounts for the opportunist. Below are several cryptos to watch this week.\n\nBitcoin (BTC)\n\nCrypto prices collapse downturn. Bitcoin (BTC-USD) cryptocurrency value drop bear market concept. Doomed Cryptos to Dump. cryptos to sell\n\nSource: Quality Stock Arts / Shutterstock.com\n\nIt’s not time to hit the panic button. However, crypto investors need to pay close attention to Bitcoin (BTC-USD) this week. In the past 24 hours since the clock officially turned to Tuesday morning, the benchmark virtual currency lost more than 2% of market value. Over the past seven days, it sank more than 6%.\n\nTo be sure, it’s not so much the red ink in the basis points that hurt. Rather, it’s that Bitcoin is threatening to slip below — and perhaps well below — the critical $60,000 level. Yeah, you can say it’s just a number. But let’s keep in mind that not too long ago, BTC received praise for jumping back up above the 70K milestone. Going backwards is not what the bulls had in mind.\n\nIs it time to buy the volatility, though? I think it might be the right idea but I wouldn’t be surprised if more downside materializes. So far, the candlestick of the June 25 session is very small compared to the red blotch represented by the Monday session.\n\nMaybe take a nibble but keep the powder keg dry. That would be my idea.\n\nEthereum (ETH)\n\nCrypto currency etherium. ethereum coin on exchange charts. e-currency Ethereum. Ethereum price predictions\n\nSource: viktoryabov / Shutterstock.com\n\nAs with the benchmark digital asset, it’s not time to panic on Ethereum (ETH-USD). It is time to put your crosshairs on this bad boy because circumstances are getting volatile. In the past 24 hours, ETH slipped about a half percent. During the trailing one-week period, the number two crypto by market cap dipped around 2%. These stats aren’t what’s important.\n\nStory continues\n\nRather, as with other cryptos, the technical profile for Ethereum appears to be weak. Conspicuously, the popular virtual currency is trading hands at $3,374. That’s below its 50-day moving average, a key barometer for near-term market health. Also, it goes without saying that ETH is off its 20-day exponential moving average.\n\nIf more volatility materializes, which wouldn’t be out of the question, the $3,100 support line must hold. Otherwise, it could be a quick drop to $2,900. That’s the type of activity that the bulls will not want to see.\n\nAs for playing this market, I’m not liking how the response to the June 24 fallout has been so pensive. Again, nibble at Ethereum if you must but keep the powder keg dry.\n\nTether (USDT)\n\nA concept token for the Tether cryptocurrency.\n\nSource: DIAMOND VISUALS / Shutterstock.com\n\nAs the mainline stablecoin or cryptocurrency pegged to a fiat currency (typically the dollar), Tether (USDT-USD) provides a critical look into broader blockchain sentiment. Basically, USDT represents the oil that keeps the digital asset ecosystem’s chains moving smoothly. That’s because crypto investors will convert their wealth into Tether. When opportunities arise, they can respond immediately.\n\nSo, here’s how the theory plays out. If more market participants are comfortable storing their wealth in crypto terms, Tether should rise in value relative to dollars. In other words, USDT should be traded at a higher peg relative to USD. On the other hand, if people are not comfortable with cryptos overall, they’re less likely to hold Tether units. In this case, dollars will be worth more than USDTs.\n\nRight now, one dollar is worth about 0.9996 Tethers. Under a perfect peg, one dollar should be worth one USDT unit. So, the fact that the stablecoin is worth less than a single greenback suggests broader pessimism. That’s not surprising given the evidence that we’ve seen.\n\nAgain, this isn’t meant to panic investors. However, it’s worth mentioning so that you don’t go too aggressive on cryptos this week. Like I said earlier, you may want to keep the powder keg dry.\n\nSolana (SOL)\n\nConcept art of the Solana (SOL-USD) blockchain.\n\nSource: Shutterstock\n\nLet’s move to some potential opportunities in cryptos, beginning with Solana (SOL-USD). What’s interesting about SOL is that unlike many other major digital assets, SOL gained 8% of market value in the past 24 hours. That said, it didn’t move anywhere in the past week, losing about half-a-percent. So, what’s going on with this popular altcoin or alternative crypto?\n\nTechnically, Solana finds itself at an interesting crossroads. Generally, circumstances don’t look particularly pleasant. First, SOL failed to secure its top-level support line around the $178 mark. It then failed to hold the $156 line, represented by its 50-day moving average (DMA). At one point, Solana briefly slipped below its 200 DMA, which sits at $133.\n\nMoving forward, the next few sessions will be critical in establishing the near-term trajectory. Presently, Solana trades hands at approximately $135.50. It really has to move higher from here, perhaps jumping to its 20-day exponential moving average (EMA), roughly $145.\n\nIf SOL is unable to make progress, it risks falling to the $100 level. As with the other cryptos, a small position now may be warranted. However, keep the powder keg dry for a bigger discount.\n\nCardano (ADA)\n\nCardano (ADA) token with blue and orange digital background.\n\nSource: Stanslavs / Shutterstock\n\nA fan favorite within the altcoin community, Cardano (ADA-USD) enjoys no shortage of supporters. However, it might be put-up-or-shut-up time for the blockchain asset, at least from an immediate perspective. In the past 24 hours, ADA gained about 2.5% of market value. That’s good. In the trailing week, it gained over 2%. That’s even better.\n\nHowever, the problem is that Cardano’s technical profile is very suspect. Presently, the coin trades at just under 39 cents. That’s noticeably below the 20-day EMA, which comes in at 40.6 cents. Also, it’s significantly under its 50 DMA, which stands at 43.9 cents. The 200 DMA? Forget about it — that’s up at 54.2 cents. Honestly, the bulls need to think about small steps first.\n\nA horizontal support line is evident around the 45.5-cent level. For Cardano to regain credibility immediately, it must move to this mark, full stop. I’m hoping that the legion of supporters will see the discount and bid ADA higher.\n\nBut it’s also possible that with the whales being pensive, ADA could struggle. For speculators, nibble at the currently cheapened price. Just know that there’s a possibility that Cardano could fall quickly below the 35-cent line.\n\nChainlink (LINK)\n\na digital representation of the chainlink (LINK) cryptocurrency\n\nSource: Stanslavs / Shutterstock.com\n\nThose seeking a speculative upside wager in cryptos may want to turn their attention to Chainlink (LINK-USD). Let’s look at some interesting stats. During the past 24 hours, LINK gained nearly 7% of market value. Over the course of the last seven days, the cryptocurrency gained more than 2%. Amid the blockchain fallout, those are pretty encouraging numbers.\n\nIt just might get better. LINK has a tendency of see-sawing violently. Throughout much of April and May, the price of the digital asset baselined at approximately $13. However, during the recovery rally late last month, LINK briefly shot up beyond $19 on an intraday basis. That provided temporary hope that sentiment can carry Chainlink back to the $20 level.\n\nUnfortunately, earlier this month, the crypto encountered a series of volatile sessions. The bad news is that the blockchain asset finds itself trading below its 50 and 200 DMAs. However, the good news is that the bears attempted to drive LINK below $13 but failed. Just to repeat, that price represented a prior support line.\n\nMoving forward, it’s possible that LINK could start marching higher. I’ll start getting excited should the price breach its 50 DMA, which stands at $15.71.\n\nUniswap (UNI)\n\nA concept image for the Uniswap (UNI) token.\n\nSource: Shutterstock\n\nOne of the most popular altcoins for its underlying utility, Uniswap (UNI-USD) dipped about 1% in the trailing 24 hours. During the past one-week period, the digital asset dropped almost 4%. At the moment, the crypto features a market cap of $5.67 billion. That’s good enough for number 18 in terms of the most valuable virtual currencies.\n\nLooking at the technical profile, Uniswap finds itself in an interesting position. Presently, at a price per unit of $9.47, it sits below its 20-day EMA ($9.98). Further, it’s trading right at its 50 DMA. During the June 24 session, the bears managed to drive the price below this key barometer briefly before rebounding. To establish credibility, Uniswap needs to build from here.\n\nOne positive news item is that the price action has held strong above the 200 DMA ($8.79). If a correction materializes, a drop below this point could send the digital asset down to $7.\n\nWhat may work in favor of Uniswap is strong support for the underlying ecosystem. If enough investors jump in, UNI could start moving higher. Still, I would probably keep the powder keg dry just in case for unexpected headwinds.\n\nOn the date of publication, Josh Enomoto held a LONG position in BTC, ETH and USDT. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nA former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia.\n\nMore From InvestorPlace\n\nThe post 7 Cryptos to Watch This Week: Bitcoin, Ethereum and More appeared first on InvestorPlace."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5qQU43TjkzWVFmQkJiMndRYXc0NVAtbmtnTUNPdThhM0Y5bW9zeUhqOExPVXFINGpNS1ZVVkxMUW9yeU55cDFMOTJRY2UtX0ctVS1iekdBc1JaZFFBbGNFY1pULXdSYVdfdnFOcWxlMnhmMkZBMWpnRTNTX2FZZ28?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "7 Cryptos to Watch This Week: Bitcoin, Ethereum and More - Yahoo Finance",
        "content": "If you can’t handle the extreme ebb and flow of high-risk asset classes, the cryptocurrency market probably isn’t right for you. We’re getting a taste of the wildness of the blockchain ecosystem, with the total market capitalization of all cryptos slipping conspicuously on Monday. At the moment, the value of global virtual currencies comes in at $2.26 trillion.\n\nOf course, that’s disappointing for those who recently got into the space. Previously, the sector had done a good job of holding onto the $2.5 trillion market cap support line. Unfortunately, with the benchmark digital assets slipping badly in recent sessions, investors need to prepare for possibly extended rough waters.\n\nWhat’s causing the choppiness in the high seas? Some experts point to the German government standing poised to liquidate a significant amount of cryptos “earned” through illicit means. Further, some evidence exists that the whales — or the big dogs in the market — have slowed their trading activity. With the fading momentum, people aren’t as eager to participate in cryptos.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nFrankly, the erosion of major tech players like Nvidia (NASDAQ:NVDA) probably doesn’t help either in terms of ginning up sentiment. Still, that could also spell discounts for the opportunist. Below are several cryptos to watch this week.\n\nBitcoin (BTC)\n\nCrypto prices collapse downturn. Bitcoin (BTC-USD) cryptocurrency value drop bear market concept. Doomed Cryptos to Dump. cryptos to sell\n\nSource: Quality Stock Arts / Shutterstock.com\n\nIt’s not time to hit the panic button. However, crypto investors need to pay close attention to Bitcoin (BTC-USD) this week. In the past 24 hours since the clock officially turned to Tuesday morning, the benchmark virtual currency lost more than 2% of market value. Over the past seven days, it sank more than 6%.\n\nTo be sure, it’s not so much the red ink in the basis points that hurt. Rather, it’s that Bitcoin is threatening to slip below — and perhaps well below — the critical $60,000 level. Yeah, you can say it’s just a number. But let’s keep in mind that not too long ago, BTC received praise for jumping back up above the 70K milestone. Going backwards is not what the bulls had in mind.\n\nIs it time to buy the volatility, though? I think it might be the right idea but I wouldn’t be surprised if more downside materializes. So far, the candlestick of the June 25 session is very small compared to the red blotch represented by the Monday session.\n\nMaybe take a nibble but keep the powder keg dry. That would be my idea.\n\nEthereum (ETH)\n\nCrypto currency etherium. ethereum coin on exchange charts. e-currency Ethereum. Ethereum price predictions\n\nSource: viktoryabov / Shutterstock.com\n\nAs with the benchmark digital asset, it’s not time to panic on Ethereum (ETH-USD). It is time to put your crosshairs on this bad boy because circumstances are getting volatile. In the past 24 hours, ETH slipped about a half percent. During the trailing one-week period, the number two crypto by market cap dipped around 2%. These stats aren’t what’s important.\n\nStory continues\n\nRather, as with other cryptos, the technical profile for Ethereum appears to be weak. Conspicuously, the popular virtual currency is trading hands at $3,374. That’s below its 50-day moving average, a key barometer for near-term market health. Also, it goes without saying that ETH is off its 20-day exponential moving average.\n\nIf more volatility materializes, which wouldn’t be out of the question, the $3,100 support line must hold. Otherwise, it could be a quick drop to $2,900. That’s the type of activity that the bulls will not want to see.\n\nAs for playing this market, I’m not liking how the response to the June 24 fallout has been so pensive. Again, nibble at Ethereum if you must but keep the powder keg dry.\n\nTether (USDT)\n\nA concept token for the Tether cryptocurrency.\n\nSource: DIAMOND VISUALS / Shutterstock.com\n\nAs the mainline stablecoin or cryptocurrency pegged to a fiat currency (typically the dollar), Tether (USDT-USD) provides a critical look into broader blockchain sentiment. Basically, USDT represents the oil that keeps the digital asset ecosystem’s chains moving smoothly. That’s because crypto investors will convert their wealth into Tether. When opportunities arise, they can respond immediately.\n\nSo, here’s how the theory plays out. If more market participants are comfortable storing their wealth in crypto terms, Tether should rise in value relative to dollars. In other words, USDT should be traded at a higher peg relative to USD. On the other hand, if people are not comfortable with cryptos overall, they’re less likely to hold Tether units. In this case, dollars will be worth more than USDTs.\n\nRight now, one dollar is worth about 0.9996 Tethers. Under a perfect peg, one dollar should be worth one USDT unit. So, the fact that the stablecoin is worth less than a single greenback suggests broader pessimism. That’s not surprising given the evidence that we’ve seen.\n\nAgain, this isn’t meant to panic investors. However, it’s worth mentioning so that you don’t go too aggressive on cryptos this week. Like I said earlier, you may want to keep the powder keg dry.\n\nSolana (SOL)\n\nConcept art of the Solana (SOL-USD) blockchain.\n\nSource: Shutterstock\n\nLet’s move to some potential opportunities in cryptos, beginning with Solana (SOL-USD). What’s interesting about SOL is that unlike many other major digital assets, SOL gained 8% of market value in the past 24 hours. That said, it didn’t move anywhere in the past week, losing about half-a-percent. So, what’s going on with this popular altcoin or alternative crypto?\n\nTechnically, Solana finds itself at an interesting crossroads. Generally, circumstances don’t look particularly pleasant. First, SOL failed to secure its top-level support line around the $178 mark. It then failed to hold the $156 line, represented by its 50-day moving average (DMA). At one point, Solana briefly slipped below its 200 DMA, which sits at $133.\n\nMoving forward, the next few sessions will be critical in establishing the near-term trajectory. Presently, Solana trades hands at approximately $135.50. It really has to move higher from here, perhaps jumping to its 20-day exponential moving average (EMA), roughly $145.\n\nIf SOL is unable to make progress, it risks falling to the $100 level. As with the other cryptos, a small position now may be warranted. However, keep the powder keg dry for a bigger discount.\n\nCardano (ADA)\n\nCardano (ADA) token with blue and orange digital background.\n\nSource: Stanslavs / Shutterstock\n\nA fan favorite within the altcoin community, Cardano (ADA-USD) enjoys no shortage of supporters. However, it might be put-up-or-shut-up time for the blockchain asset, at least from an immediate perspective. In the past 24 hours, ADA gained about 2.5% of market value. That’s good. In the trailing week, it gained over 2%. That’s even better.\n\nHowever, the problem is that Cardano’s technical profile is very suspect. Presently, the coin trades at just under 39 cents. That’s noticeably below the 20-day EMA, which comes in at 40.6 cents. Also, it’s significantly under its 50 DMA, which stands at 43.9 cents. The 200 DMA? Forget about it — that’s up at 54.2 cents. Honestly, the bulls need to think about small steps first.\n\nA horizontal support line is evident around the 45.5-cent level. For Cardano to regain credibility immediately, it must move to this mark, full stop. I’m hoping that the legion of supporters will see the discount and bid ADA higher.\n\nBut it’s also possible that with the whales being pensive, ADA could struggle. For speculators, nibble at the currently cheapened price. Just know that there’s a possibility that Cardano could fall quickly below the 35-cent line.\n\nChainlink (LINK)\n\na digital representation of the chainlink (LINK) cryptocurrency\n\nSource: Stanslavs / Shutterstock.com\n\nThose seeking a speculative upside wager in cryptos may want to turn their attention to Chainlink (LINK-USD). Let’s look at some interesting stats. During the past 24 hours, LINK gained nearly 7% of market value. Over the course of the last seven days, the cryptocurrency gained more than 2%. Amid the blockchain fallout, those are pretty encouraging numbers.\n\nIt just might get better. LINK has a tendency of see-sawing violently. Throughout much of April and May, the price of the digital asset baselined at approximately $13. However, during the recovery rally late last month, LINK briefly shot up beyond $19 on an intraday basis. That provided temporary hope that sentiment can carry Chainlink back to the $20 level.\n\nUnfortunately, earlier this month, the crypto encountered a series of volatile sessions. The bad news is that the blockchain asset finds itself trading below its 50 and 200 DMAs. However, the good news is that the bears attempted to drive LINK below $13 but failed. Just to repeat, that price represented a prior support line.\n\nMoving forward, it’s possible that LINK could start marching higher. I’ll start getting excited should the price breach its 50 DMA, which stands at $15.71.\n\nUniswap (UNI)\n\nA concept image for the Uniswap (UNI) token.\n\nSource: Shutterstock\n\nOne of the most popular altcoins for its underlying utility, Uniswap (UNI-USD) dipped about 1% in the trailing 24 hours. During the past one-week period, the digital asset dropped almost 4%. At the moment, the crypto features a market cap of $5.67 billion. That’s good enough for number 18 in terms of the most valuable virtual currencies.\n\nLooking at the technical profile, Uniswap finds itself in an interesting position. Presently, at a price per unit of $9.47, it sits below its 20-day EMA ($9.98). Further, it’s trading right at its 50 DMA. During the June 24 session, the bears managed to drive the price below this key barometer briefly before rebounding. To establish credibility, Uniswap needs to build from here.\n\nOne positive news item is that the price action has held strong above the 200 DMA ($8.79). If a correction materializes, a drop below this point could send the digital asset down to $7.\n\nWhat may work in favor of Uniswap is strong support for the underlying ecosystem. If enough investors jump in, UNI could start moving higher. Still, I would probably keep the powder keg dry just in case for unexpected headwinds.\n\nOn the date of publication, Josh Enomoto held a LONG position in BTC, ETH and USDT. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nA former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia.\n\nMore From InvestorPlace\n\nThe post 7 Cryptos to Watch This Week: Bitcoin, Ethereum and More appeared first on InvestorPlace."
    }
]