[
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPQXRCLVJMZDZnX3FGQndqaS1TbkJHUmFJV0NZR0dtSlhjb0tBMTNreW0zTEhUNTRCRExOYW4xTE5waWkwaFhSN3JCODl2OWlTbDQ5UFhZUi1Qc1JqNk5vN0xYZWFNbUpuOEZQeTJnRVpxWjVTS3VvUFBId2dMNk1nNUlfRVY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Ethereum: ETH Could Hit $3500 in Q1, But There’s a Catch - Watcher Guru",
        "content": "In a recent tweet, Michaël van de Poppe, the founder of MN Trading, sheds light on Ethereum’s current trajectory, emphasizing its ongoing momentum.\n\nHowever, he points out a significant gap that Ethereum needs to bridge to attain parity with Bitcoin. Van de Poppe anticipates a phase of consolidation before Ethereum can forge ahead, aiming for the ambitious target range of $3,000 to $3,500 in the first quarter of 2024.\n\n#Ethereum is still showing momentum but has a big gap to gain in order to be at the same level as Bitcoin.\n\n\n\nWe'll see some consolidation before continuing towards $3,000-3,500 during Q1 2024. pic.twitter.com/gz3T6dHl6K January 3, 2024\n\nAlso read: Top 3 Cryptocurrencies To Watch In 2024\n\nThe current state of Ethereum\n\nAs of the latest data, Ethereum (ETH) has witnessed a remarkable year-to-date surge of 77.3%. Despite its upward journey, ETH is currently facing a 6% drop in value, trading at $2,219.68. The 24-hour trading range reflects a low of $2,113.93 and a high of $2,385.12, underscoring the inherent volatility in the cryptocurrency market.\n\nChangelly analysts contribute their perspective to Ethereum’s future, projecting a potential surge to $3,000 by July 2024. However, they caution that these predictions are subject to fluctuations based on overall market conditions.\n\nAlso read: Ripple (XRP) or Cardano (ADA): Which Coin Will Hit $1 in January 2024?\n\nThe volatile nature of the crypto market necessitates a cautious approach, emphasizing the influence of various factors on Ethereum’s price trajectory.\n\nSo, while the ride may prove choppy in the interim, ETH’s long-term technical picture remains starkly bullish. Another wave higher appears imminent; its scale is becoming the next key question."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNQVNiQXNWejMyUHJ1b0dVTm83TWdKaWM4SHpzd3lGUGFoZ2UzaW9JSlRjdmE0V3h4RUVnQ2V5c2xHcHJxUzNKZm9uSUstUDRGNVlVOTAwTXJ4VFdQNEptRGpvRElXVURQVjByMF94eFZ5b0ZFb3BwUWV5NkVxdUlwb3hfZldRd2hlMm9oOHRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Ethereum: 3 Indicators Suggest ETH Could Reach $10,000 in 2024 - Watcher Guru",
        "content": "2023 was not particularly Ethereum’s (ETH) best year. Although the second-largest cryptocurrency rallied almost 90%, other altcoins, such as Solana (SOL) and Avalanche (AVAX), were miles ahead. SOL’s price went up by nearly 1000% in 2023. AVAX, on the other hand, saw an increase of over 200%. However, things may change for ETH in 2024, as there is a possibility that the project could surge to new heights.\n\nAlso Read: Ethereum to “Easily” Rally 350% and Hit $10,000: Predicts Analyst.\n\nEthereum (ETH) to hit $10,000 in 2024?\n\nOne of the biggest drivers for ETH’s price would be a bull run for the crypto market. Analysts anticipate a bull market in 2024, fuelled by the SEC‘s (Securities and Exchange Commission) possible approval of a spot Bitcoin (BTC) ETF (Exchange Traded Fund) and BTC’s halving event in April. Both developments could usher in a 2021-like bull run for the crypto market. In such a scenario, BTC might hit a new all-time high. If BTC reaches a new peak, ETH is likely to follow.\n\nAlso Read: Ethereum: ETH Could Hit $3500 in Q1, But There’s a Catch\n\nThe second factor that could send Ethereum (ETH) to $10,000 is the possibility of an ETH ETF. The world’s largest asset manager, BlackRock, is among the interested parties. Moreover, the SEC has accepted ETH as a commodity. Hence, an ETH ETF approval could be smooth sailing for the industry.\n\nAnother aspect to consider is that an Ethereum (ETH) rally is long overdue. Other altcoins, such as Solana (SOL), Avalanche (AVAX), Cardano (ADA), etc., rallied hard towards the end of 2023. ETH, however, kept calm. Hence, we may see a late rally for the second-largest cryptocurrency.\n\nEthereum (ETH) is also one of the most-used networks right now. The project dominates in terms of applications and adoption. This metric will play a vital role in ETH’s journey to $10,000."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOTTZRVEtSVS00R0dFSEtHb3VaUGExRURRajl2SVd5V0RtTzVHeEwtdzRob0UyOWRtYldDaGE5X3ZnYkdXNmdsU2N0YmdHMGd0MnVXZTdReEFQWkRZVWtnTHJXUV8zZElOWm16RXI2NEN4WjZxTjRHSnhmNDg1WXU2NDExVUpXVGpXc0tEZVV6Ti1fYmR2WThwZmd3QUVwaFd4M1hoTE5LSS1DbUZ5Y1FlQVBpV2dSOEw1SjhPOEU1MTNTZ9IBxwFBVV95cUxNRVpSQWxmeXpXV002QkloMWY2M3hvLXJWSjFzRmRGdHVRNkZKWHF1SXItZGRGSVYwanlXdzRQSFBYcDBoOUNSQzFaSUhzN1ZNOHFhbkh6Sm1RNjk3RFZnMUlza1NpSnRRSDd4eERzLVo5WVFuNkRoN0hRNnNxc1ZZSmo5T1BnMjlwQTRNRV9ybUtZVFFjTEhfNFVfNHpFTm9TczJHWlV1cEg4Nlk3VmZMMkhfaUplemo2RWMwM3dHZS1zVzg4b3NF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Ethereum price could target $3,000 with ETH whales buying the dip - FXStreet",
        "content": "Ethereum price has shown interest in a recovery rally, trading around $2,244.\n\nA spike in whale transaction count suggests investors could be buying the dip.\n\nOn-chain metrics hint at little to no resistance up to $2,800.\n\nA flip of the $2,145 level into the resistance level will invalidate the bullish thesis.\n\nEthereum (ETH) price is attempting a recovery bounce that could kickstart a run-up to new yearly highs. Supporting on-chain and technical indicators add credence to this bullish ETH outlook.\n\nAlso read: Institutions’ interest in crypto grew by 176% in 2023 but seems to be waning ahead of Bitcoin ETF\n\nEthereum price ready to move higher\n\nEthereum price slipped low as $2,100 on January 3 after Matrixport’s ETF-rejection post. But ETH, like many other cryptocurrencies, recovered quickly. Ether currently trades at $2,244, forecasting a potentially explosive move to the upside.\n\nThe Relative Strength Index (RSI) hovers around 42 after its recovery from the oversold region a few days ago. A higher low formation could indicate a slow but steadily gaining upward momentum.\n\nThe Awesome Oscillator (AO) is much more optimistic than the RSI, which shows a decline in bearish momentum as the indicator approaches the zero line. A flip of the mean level would indicate that the bullish momentum is in play and could push Ethereum price higher.\n\nIn such a case, if Ethereum price flips the $2,300 hurdle into a support floor, it could move higher and retest the $2,400 barrier. In a highly bullish case, ETH could tag the 161.8% Fibonacci level at $2,562 and also the monthly resistance level at $2,652.\n\nRead more: Ethereum price could make a recovery as ETH supply on exchanges hits an all-time low\n\nETH/USDT 1-day chart\n\nThe bullish Ethereum price outlook is supported by the spike in Whale Transaction Count and Volume on January 3. According to Santiment’s data, this uptick occurred on the day of a massive sell-off, which is a sign of investors buying the dip.\n\nSince whale-transaction count tracks transfers worth $100,000 or more, this uptick has a high chance of being a buy-the-dip move from institutional investors. Considering that the volume coincides with this uptick adds even more credence to the bullish outlook.\n\nETH whale transaction count, volume\n\nFurthermore, IntoTheBlock’s Global In/Out of the Money (GIOM) indicator shows that the immediate key hurdle at $2,347 is relatively weak. Hence, overcoming this blockade could send ETH to the next critical level of $2,859. Here, roughly 10.77 million addresses that accumulated 5.2 million Ether are sitting at a loss.\n\nTherefore, a potential move into this hurdle could see a considerable spike in selling pressure from these holders trying to break even.\n\nETH GIOM\n\nOn the other hand, if Ethereum price flips the range low of $2,144, it will create a lower low and invalidate the bullish thesis. In such a case, ETH could slide 6.50% and revisit the $2,000 psychological level.\n\nAlso read: Following spot Bitcoin ETF applicants, SEC holds meetings with NYSE, NASDAQ and other exchanges"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOMnpPV21uNTlDWks4ajh3ZXN0TnlwdkNmaUpUTWx6Wm1zYnZPa1Rkamx2cWxoTGREOXF2UmJCTXppZXJDbkpBTkFhYWZvUWRScEFnOVRwdFNyQktaUDJqdHAtTUNPNEJkTzRGM2cyV0Rmd0xwTUJtOGpLTTEteDRhVUQydzNlX0FPNUY3WVVXQW5lVU11TF9BYndkZmpzUV9KZ2o5aGhodndVclVZWUFDYWRUZ0I?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Arbitrum Takes Lead in Daily DEX Volume for First Time, Surpassing Ethereum and Solana - Unchained",
        "content": "The surge in Arbitrum’s daily volume likely stems from the upcoming Ethereum upgrade dubbed Dencun, not the memecoin frenzy experienced by other blockchain networks.\n\nArbitrum, a layer 2 scaling solution for Ethereum, has taken the lead in daily volume on decentralized exchanges (DEX) for the first time in Arbitrum’s history, according to the most recent data from crypto analytics firm DefiLlama.\n\nOver the past 24 hours, the total value of transactions made on Arbitrum by crypto users stands at $1.83 billion, taking the lead from base layer blockchain Ethereum, which has a 24-hour volume of $1.44 billion. In fact, the combined 24-hour volume of Solana, Binance Smart Chain, Polygon, Avalanche, Optimism and zkSync Era is less than that of Arbitrum.\n\n\n\nThe historical leader in 24-hour volume has been Ethereum, though its seat on the throne has been challenged recently. Solana, a layer 1 blockchain that implements proof-of-history, surpassed Ethereum’s daily DEX volume for several days in December 2023. Now, less than a month later, Arbitrum has taken the lead.\n\n“It’s not an easy feat, there’s a lot of chains and not many have been able to do that, even if it’s just temporarily,” said Martin Lee, content lead at on-chain metrics firm Nansen, to Unchained via Telegram. “While it’s an impressive achievement, ideally, I’d want to see this trend continue over a longer time horizon before putting any weight behind it. We’ve seen moments where chains get massive spikes in activity but few manage to maintain it.”\n\nDencun’s Impact\n\nThe spike in Arbitrum’s volume likely stems from the upcoming Ethereum upgrade known as Dencun, Lee noted. Set to be activated on several testnets this month, Dencun is the first major upgrade to Ethereum since Shapella in April of last year, which enabled stakers to withdraw their ETH. The newest upgrade includes EIP-4844, also known as proto-danksharding, which is designed to scale Ethereum in a decentralized way.\n\n“Proto-danksharding reduces the cost of posting large amounts of data to Ethereum and thereby lowers the operational cost of rollups,” wrote Galaxy’s vice president of research Christine Kim in a research report last June. “EIP 4844 is considered a boost to Ethereum scalability because it makes Layer-2 networks built atop Ethereum more cost-effective,” the report said.\n\nIn addition, Carlos Mercado, data scientist at blockchain data firm Flipside Crypto told Unchained over Telegram that “Arbitrum over the last few weeks has been preparing for Arbitrum Orbit, their competitor to the Optimism ‘Superchain’ thesis,” a network of chains that all share Optimism’s open-source development stack.\n\nNotably, the surge in Arbitrum’s daily DEX volume is not from the recent memecoin frenzy that has gone viral on other Layer-1 networks such as Bitcoin, Solana, and Avalanche. Memecoins “never took off” on Arbitrum, according to Nansen’s Lee.\n\nARB, the native governance token for the Arbitrum ecosystem, has slid roughly 11% in the past 24 hours, but has gained nearly 27% in the past seven days to change hands at $1.86, according to CoinGecko.\n\nDisclosure: Arbitrum is a sponsor of Unchained."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNN0JZM0piOG0xWUktaXNCOGtqSnlJQk9iUDJsZWVuWE5CTzZBZEpOQllPMEhhR0tadU5ybEhCWTNaNkMyT0U1dG5rQUJxX2xpNE5nNHV2RktHM0dOQ05UTlF5ZUUycVN3eUhOM3RsQ0ZQdjV5emdyT1p0enNaMC1FN25TRTgyNmJmR3BCVExzSkVSaXli?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Will Ethereum hit $10k in 2024 or is this altcoin a better alternative? - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nWith market conditions trending higher, many speculators are contemplating whether Ethereum (ETH) could hit $10,000 in 2024. Currently, it is trading at $2,254, up 2.9% this month and 81% year-to-date. However, some analysts are backing Bitcoin Minetrix after its presale hits $7.5 million.\n\nAnalysts bullish on Ethereum\n\nGiven Ethereum’s trajectory in the last bull run, market participants are eagerly anticipating for the coin to hit $10k, hoping it comes in the early stages of the upcoming bull market rally.\n\nYou might also like: Ethereum suffered highest losses due to rug pulls and hacks, data shows\n\nFollowing the last Bitcoin halving, Ethereum rose from $200 to over $1,200.\n\nIf the same growth applies, ETH may soar above $13K by the end of 2024.\n\nEven so, several variables are at play, mainly Ethereum’s significantly higher market cap of $272 billion.\n\nAs such, it is not as simple as using past data to determine future results. However, several analysts have weighed in on this possibility in 2024.\n\nGeoff Kendrick, head of FX Research, West, and Digital Assets Research at Standard Chartered Bank, believes the coin could be headed to $4,000 by the end of 2024.\n\nThe analyst referenced the Bitcoin halving, speculating it “should lift all boats.”\n\nMeanwhile, X commentator icircle_nft recently said ETH will rally to $5K by the end of 2024.\n\nhttps://twitter.com/icircle_nft/status/1741776096969077001?s=20\n\nHowever, the analyst has higher hopes for ETH in 2025, forecasting it will reach $18K.\n\nMeanwhile, FieryTrading said the coin is trading inside a rising wedge pattern and may reach $16K by the end of 2025.\n\nThat said, analyst CrediBULL Crypto is even more optimistic, speculating Ethereum could reach highs of $20K or a minimum of $10K by the end of 2024.\n\nUltimately, whether Ethereum will underperform, equal, or outperform its last market cycle remains to be seen. While most analysts are bullish, there are many opinions on where it could be headed.\n\nThough many analysts expect Ethereum to outperform in 2024, some are more bullish on Bitcoin Minetrix after raising $7.5 million in the ongoing presale.\n\nBitcoin Minetrix raises $7.5 million in presale: what’s next?\n\nBitcoin Minetrix allows users to earn passive BTC rewards by staking on Ethereum.\n\nThe project is a cloud mining solution where users can stake BTCMTX for Bitcoin mining credits.\n\nThey can then burn these credits on the Bitcoin Minetrix platform for cloud mining power, receiving Bitcoin.\n\nThis use case requires no hardware or technical know-how from users, making it ideal for beginners.\n\nAnother benefit is that the decentralized and transparent BTCMTX eradicates the risk of cloud mining scams.\n\nOther advantages include no space or noise constraints on the user and it offers a more eco-friendly way to mine Bitcoin.\n\nThese benefits seem to be supporting the project in the ongoing presale which has raised $7.5 million so far.\n\nFor what it offers, an analyst, Jacob Bury, says BTCMTX is set for more gains after launching."
    }
]