[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNeUxibmJQd1NvQWF1U2ZNWFB3ZVlUMF8zX194Y0R2WmJQRnFpTFo4UmI1ZTFmRzZ4M0ZmNGVLV3ZUaWZiVGlIUGhpa0JPaUNrTFpZdmFFaEt5NEZ5SE1uSnJWcjRaekdmY2dMc3Q4dmlIOURmOWF3RFNlZHFuWTBxT25WbkRxZzVsdXo4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Reddit invests in Bitcoin and Ethereum ahead of IPO - Yahoo Finance",
        "content": "Reddit, the popular social media platform, has invested in Bitcoin (BTC) and Ethereum (ETH) as part of its treasury management strategy.\n\nThe company’s initial public offering (IPO) filing with the U.S. Securities and Exchange Commission (SEC) on Feb. 22, also mentioned the acquisition of ETH and Polygon (MATIC) for virtual goods sales.\n\nReddit’s potential IPO is anticipated to be one of the largest tech IPOs of the year, although the company has not yet disclosed the number of shares to be sold or the price range for the offering.\n\nThe S-1 filing unveiled that select Reddit moderators and users could participate in its IPO via a directed share program, diverging from the norm of shares being predominantly bought by large institutional investors.\n\nReddit’s foray into the cryptocurrency market is part of a larger vision to integrate blockchain technology into its network of forums and discussions.\n\nThe social media platform has a history with blockchain technology, though not always successful.\n\nLast year, Reddit announced the shutdown of its community points program associated with its MOON cryptocurrency."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE80c01MTFBWdXp3YlJFNEZmWENraktsZGdTWF95UE5pSkNwNWhsSUo4ZnlFVGpFSWdTcTJfclgxd1NTVDQ4SEJBY0swZGRvLXQyZHRiNDlGTDFqbUE0bXBwUkFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Grayscale: Ethereum’s Dencun upgrade driving price upward - crypto.news",
        "content": "While a possible spot Ethereum ETF approval looms ahead, Grayscale experts believe an upcoming technological improvement is behind recent price upticks.\n\nGrayscale research analyst William Ogden Moore said in a Feb. 23 report that Ethereum’s Dencun upgrade has most likely triggered rallies in Ether (ETH) prices. According to CoinMarkerCap, ETH is up 34% in the last 30 days and 28% year-to-date per TradingView.\n\nEthereum’s Dencun upgrade, scheduled for March 13th, 2024, represents a major step forward and could help Ethereum compete in terms of scalability with faster chains in the Smart Contract Platforms Crypto Sector, such as Solana. We believe that recent price performance reflects the market’s anticipation of this upgrade. William Ogden Moore, Grayscale research analyst\n\nETH 30D price chart | Source: CoinMarketCap\n\nYou might also like: Coinbase calls on SEC to approve Grayscale’s spot Ethereum ETF\n\nDencun promises to uplift throughput and reduce transaction costs, allowing users to spend less gas fees and make more transactions on ETH’s mainnet and layer-2 scaling solutions like Arbitrum.\n\nDevelopers plan to achieve this key overhaul via proto-danksharding, introducing data blobs.\n\nMoore’s report suggests that Ethereum could seize greater smart contract business share from competitors like Solana if the network can offer cheaper fees. Moore opined that this might unlock a multi-billion market tied to real-world assets.\n\nIf Ethereum can simply become more competitive in throughput and cost, it could position itself to capture smart contract applications that demand high levels of security and censorship-resistance like stablecoins or tokenized financial assets. William Ogden Moore, Grayscale research analyst\n\nGrayscale’s bullish outlook on ETH and its blockchain complements the investment firm’s bid for a spot exchange-traded fund following its successful GBTC conversion last month. According to Yahoo Finance, the company hopes to do the same with its Grayscale Ethereum Trust (ETHE), which holds over $7 billion in assets under management (AUM).\n\nThe U.S. SEC delayed a decision on Grayscale’s application till May, along with several other issuers.\n\nETH YTD chart | Source: TradingView"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQMXJwbXAyMXhhV0JJUVBHbjNESzNKVG05dzg1RU9fMjRHS0tSektkUGJBcVJUcFY2TnI4WklWS3hRaDREeENDZldEeFpxYmQzZXM1MHkydnVYREY5ZWlUVVpsX2VDNGFZUXZaTmJQR3ZSTTBiZ0tGRTZCQnlqcTNRZ19qUUNkWTFsUlpxc1FZLXFYcEcxODFIMWUxU0dzUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "A retail revival is afoot in crypto. JPMorgan names three factors driving it - DLNews",
        "content": "JPMorgan analysts outlined three key catalysts driving retail investors back to crypto.\n\nBitcoin’s next halving and Ethereum’s Dencun upgrade are “largely priced in.”\n\nWhile approval of a spot Ether ETF is 50/50, the bank said this has attracted interest.\n\nThe retail push into crypto was likely responsible for February’s rally, JPMorgan said.\n\nRetail investors are flocking back to crypto in anticipation of three key catalysts in the coming months, according to JPMorgan analysts.\n\nCatalysts\n\nRetail interest rebounded in February after slowing in January, and it was “likely responsible for this month’s strong crypto market rally,” analysts at JPMorgan said in a note on Thursday.\n\nJPMorgan analysts, led by Nikolaos Panigirtzoglou, showed a chart depicting total flows onchain for smaller versus larger wallets.\n\nA smaller wallet is a proxy for a retail investor, they said.\n\nThey then adjusted for inflows into the newly launched spot Bitcoin ETFs, explaining: “Retail investors’ Bitcoin holdings that have shifted to the new spot Bitcoin ETFs are technically held in larger institutional wallets, even if the end-investor is retail.”\n\n“After a pause in January, the crypto rally gathered pace in February,” they wrote.\n\nThe Bitcoin halving in April, Ethereum’s next major upgrade, and the prospect of spot Ether exchange-traded funds have lured investors back to crypto, the investment bank said.\n\nThe first two catalysts, the halving and Ethereum’s Dencun upgrade, are “largely priced in,” the analysts said.\n\nJoin the community to get our latest stories and updates\n\nJPMorgan analysts “only see a 50% chance,” of spot Ether ETFs gaining approval in May, meaning this catalyst isn’t fully priced in.\n\nThe halving\n\nBitcoin’s so-called halving, which occurs automatically once every four years, is expected in April. It marks a supply change, halving the amount of new Bitcoin created each day.\n\nWith less supply and growing demand for Bitcoin due to new investment vehicles, such as spot Bitcoin ETFs, analysts expect the halving to push prices higher.\n\nThe Dencun upgrade\n\nEthereum’s upgrade, dubbed Dencun, is scheduled March 13, and aims to enhance scalability and reduce transaction fees on layer 2 platforms.\n\nDencun is considered Ethereum’s most significant change since April 2023, when the so-called Shapella upgrade allowed stakers to withdraw staked Ether on the network.\n\nSpot Ethereum ETF approval\n\nThe potential US approval of spot Ethereum ETFs is the final catalyst JPMorgan cites.\n\nAfter more than $10 billion poured into Bitcoin ETFs following their approval last month, Ethereum is also positioned to attract investors.\n\nBlackRock is among fund giants hoping to win a green light for a spot Ethereum ETF, following its hugely popular entry into a Bitcoin version.\n\nSome say Ethereum may even outperform Bitcoin if the ETFs win a regulatory nod, given that it’s more levered to economic activity in the crypto ecosystem.\n\nCrypto market movers\n\nBitcoin fell 0.6% to $51,200 on Friday. The leading cryptocurrency is down 2% over the past seven days.\n\nEthereum traded just below $3,000, down 1.1% since Thursday.\n\nWhat we’re reading"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOXzNFeEhacnU2dVd4QlJzYmJDZkNFcVVMMzlwWjd4VjJ2Z2NMbjM3eDVuMHFXRUhRamRBQklUNUFfR1RJUWZBcjEyYzNDM1N1NTg4cmdzcklabjY3Q0t5b2RyMEVrOGRRZlJfYTVmQlJOcl95QXRXaS1SSXJzQlRMMUh5TzVsMUFFQmM0ZWtCSEpYSW1KZmfSAZ4BQVVfeXFMTXAxUkstWjNJWG5sYXJLQ1VuSGZlU0FKSDI0d0JQN18tZVNzMnc3OWhGRklKVnhiUjFsNEhlRl9RMmRMdnJac3pUQjhvaldtcjY1MWE0MUV6RlRtWXY1YUtXd1hUWUw5bnk3eHhfcEFhU2NNSEFyV1RXSkxiX2xhaUV5Y2tlZXJCUm0xZU1KeVJDYS0teW91NFAyRl94Znc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "AI Tokens Resist Cooling Crypto Market as Bitcoin, Ethereum Wobble - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter a month of bullish activity, the broader cryptocurrency market is settling as the week draws to a close. Major currencies like Bitcoin and Ethereum are trading relatively flat, reflecting a pause in recent upward momentum.\n\nArtificial intelligence-linked tokens are still going strong, however, buoyed by the current momentum within the AI industry, which is sparking increased investor interest and activity in related digital assets.\n\nIndeed, after Nvidia's blockbuster earnings report this week, tradfi stocks related to AI tech are all on the rise: NVDA, AMD, and MSFT on the Nasdaq are all in the green for the week. Nvidia called it a “tipping point” for AI.\n\nBitcoin's current market position\n\nAD\n\nAD\n\nBitcoin opened the day at $51,252 but slightly decreased to around $51,134, marking just short of a 1% drop within the last 24 hours. This movement underscores a trading sideways period consistent since February 15, as Decrypt previously reported.\n\n\n\nThe cryptocurrency's current position below its EMA10 mark (the average price of the last 10 days) raises concerns about a strong correction. Closing the day under this critical threshold could suggest that bearish forces are gaining a foothold in the market.\n\nSome market indicators signal that a correction might already be underway.\n\nThe RSI—an indicator that measures the strength of bulls over bears in a market—was previously at an exceptionally high 80 points (meaning 8 out of every 10 traders were buying), but has decreased to 66 points. Although still high, this reduction suggests a shift towards a more balanced market dynamic and shows that traders are not as crazy about BTC as they were just a few days ago.\n\nThe convergence of Bitcoin's EMA10 and EMA55 points to a narrowing gap between short-term and long-term buying performance. This trend suggests a cooling off, where recent buyers (who bought BTC during the last 10 days) are not seeing the same returns as those who entered the market earlier (in the last 55 days). It also explains why the RSI is also dropping.\n\nAD\n\nAD\n\nIf this correction continues and the EMA55 crosses above the EMA10, it could mean that the correction may be turning into a bearish trend that leaves newer buyers facing losses.\n\nThe current market is weighing the potential impacts of recent spot ETF approvals and the upcoming Bitcoin halving. The halving has historically influenced Bitcoin's value, sparking a major bull run every four years, and could play a significant role in shaping future market trends.\n\nEthereum's market dynamics\n\nEthereum opened the day at $2,970 but has experienced a 1.4% drop, with its price adjusting to $2,947 by the time of this report. This movement reflects a stronger intra-day decline compared to Bitcoin.\n\nDespite a stronger bullish trend earlier, Ethereum has not maintained its momentum this week. The appearance of a Doji candlestick in yesterday's trading session indicates a potential shift in market dynamics.\n\nThe Doji descriptor is used when a candlestick is flat and has no body—in other words, the price doesn’t move during the session. Yesterday, ETH started the day at $2,967 and ended at $2,968, signaling indecision among traders.\n\nThis pattern indicates a balance between buyers and sellers, with neither side gaining significant ground, and suggests that Ethereum's dominant bullish trend may be weakening.\n\nEthereum's weekly performance remains positive, though, with a 6% gain over the last seven days. However, this growth is modest compared to the substantial increases seen in previous weeks. Last week, it spiked 14.89%.\n\nAD\n\nAD\n\nThe observed deceleration in Ethereum's value growth suggests a potential for minor corrections. These adjustments may be influenced by Bitcoin's market movements, as altcoins often follow the lead of the flagship cryptocurrency.\n\nFor long-term Ethereum holders, the current market conditions still present a bullish outlook. Despite the potential for short-term corrections, the overall trend supports holding onto the coin—for now.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxQc0V5QnRnVjJwVU1uVTl1Rk9od2xTMHdwSHcwdHZqQlpLNkozVkhTNTJUeGc1U19ibVpEQjZMaE9wdHFTM2Nybi0zYUwteXZpOFRVSkU3SlRRSGV1STdvdG5SalYxTWxva2pyRS1zWmJRRlFvOWdtc283ZW9jN1JPVjN4WVVNWW5SWEpnbUJBbGRSaDFtQmZiOWhIWDZIdW9feTRfbW55ZDB4OGRCS2dtOWhUU0pHbENRbXdSdkMwZ2VROFJEOW15cnBUd3NKX0hsWFRiM2tzQkUzQlRRcGlaRnVDa9IB6AFBVV95cUxOMl9SeldvTkFGeEJnYWh5UGpqd1pMc2dmZFZoN3JsNVduOFdFN0NDWXctOUhNZ0JkbUdoQl9sUUpTV1c5R0hvOE1YT09LYnJhNENBdG1sM00yU1o4cERXcXRxbEhNRmpaVGZrT0UxN0dmVXItZXlrTm5kYlc2WlFFVm1qak80cmZxcTk2UThvUGlMdklqY2s3cWYwT3F2UzdTaFBydHlUWk15Q2YtaHJHMDhmblhaQ2dDQVhweGFKYkFvQTVkb1N2TWgzdWJrcXFUT0ExNTNJVHFaR1NRUDJvWXRHS2NkS1Rn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Possible start of a trend reversal for BTC - FXStreet",
        "content": "Bitcoin (BTC) price is leading markets into weekend mode where trading volumes are low and, therefore, the price becomes susceptible to volatility. With altcoins awaiting the BTC cue, Ethereum (ETH) and Ripple (XRP) prices appear to have taken a hint.\n\nAlso Read: Bitcoin Weekly Forecast: BTC likely to correct to $50,000 soon\n\nBitcoin, altcoins, stablecoins FAQs What is Bitcoin? Bitcoin is the largest cryptocurrency by market capitalization, a virtual currency designed to serve as money. This form of payment cannot be controlled by any one person, group, or entity, which eliminates the need for third-party participation during financial transactions. What are altcoins? Altcoins are any cryptocurrency apart from Bitcoin, but some also regard Ethereum as a non-altcoin because it is from these two cryptocurrencies that forking happens. If this is true, then Litecoin is the first altcoin, forked from the Bitcoin protocol and, therefore, an “improved” version of it. What are stablecoins? Stablecoins are cryptocurrencies designed to have a stable price, with their value backed by a reserve of the asset it represents. To achieve this, the value of any one stablecoin is pegged to a commodity or financial instrument, such as the US Dollar (USD), with its supply regulated by an algorithm or demand. The main goal of stablecoins is to provide an on/off-ramp for investors willing to trade and invest in cryptocurrencies. Stablecoins also allow investors to store value since cryptocurrencies, in general, are subject to volatility. What is Bitcoin Dominance? Bitcoin dominance is the ratio of Bitcoin's market capitalization to the total market capitalization of all cryptocurrencies combined. It provides a clear picture of Bitcoin’s interest among investors. A high BTC dominance typically happens before and during a bull run, in which investors resort to investing in relatively stable and high market capitalization cryptocurrency like Bitcoin. A drop in BTC dominance usually means that investors are moving their capital and/or profits to altcoins in a quest for higher returns, which usually triggers an explosion of altcoin rallies.\n\nBitcoin may have just chosen a directional bias\n\nBitcoin (BTC) price has recorded a steady series of lower highs and lower lows over the past four days, suggesting a clear directional bias. However, this is subject for confirmation considering that the $50,638 support level continues to hold. A break and close below it would confirm the continuation of the downtrend, likely sending BTC to $50,000.\n\nThe Relative Strength Index (RSI) has already executed a selling signal by crossing below the signal line (yellow band). This is reinforced by the histogram bars of the Awesome Oscillator (AO), which are steadily edging toward the midline.\n\nIn addition, based on the Mean Reversion Channel (MRC) indicator principle that holds that price tends to return to its average over time, the market is leaning to the downside.\n\nBTC/USDT 1-day chart\n\nOn the flip side, if buyer momentum increases, Bitcoin price could push north, escaping the market range above $52,829. In a highly bullish case, BTC could shatter the range high at $52,985 before confronting the $53,000 psychological level. A decisive candlestick close above this level would clear the path for an extended move north.\n\nAlso Read: Bitcoin price eyes $48,000 as European Central Bank tears down at BTC after spot ETF approval\n\nEthereum price repels $3,000\n\nAfter a rejection from the $3,000 psychological level, Ethereum price is trading within the ascending parallel channel. However, it risks an extended fall following the execution of a selling signal on the RSI. With the weekend setting in, low trading volumes and the resultant volatility could see ETH retest the $2,874 support. In a dire case, the slump could send the Proof-of-Stake (PoS) token to the $2,770 support confluence between the horizontal line and the midline of the channel.\n\nETH/USDT 1-day chart\n\nHowever, with the bulls still maintaining a presence in the BTC market, seen with the large volumes of green histogram bars of the AO, Ethereum price could overcome the $3,000 milestone, or in a highly bullish case, clear the range high of $3,036 to tag the $3,200 milestone.\n\nAlso Read: Ethereum price risks decline as increasing exchange supply raises chances of profit taking\n\nRipple price eyes $0.5000\n\nRipple (XRP) price has recorded a series of lower highs and lower lows over the past four days after a rejection from the upper boundary of the descending parallel channel. After crossing below the signal line, the RSI is below 50, showing the market is leaning to the downside. The red histogram bars of the AO accentuate this and add credence to the bearish thesis. In a dire case, Ripple price could roll over to the $0.4734 support floor.\n\nXRP/USDT 1-day chart\n\nOn the other hand, enhanced buyer momentum could send Ripple price above resistance stemming from the upper boundary of the channel, with a decisive candlestick close above it setting the pace for an extension to $0.6000. Such a move would constitute a 12% climb above current levels.\n\nAlso Read: XRP price plunges as Kraken cites SEC v. Ripple lawsuit in its legal battle against the regulator"
    }
]