[
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQVmdxdDV2U2pMNnBzY0Rod0VvMm9td1puVGFEUGM4ZTNUMnRJazNfS0xnZHdZLS13N2ZQenF4V2l5VklYVzVJTEFENWxWOVJaeXhFOTJSYjJfd3BxeV9aVENYNU1nQ3J3ajN6VmNPSlFxQUUwM2M4OFBCZnZpa2dNNkFXRllSY0JZT2hPbmZPOF9qcUlEYUdDbXVIXzY4VVJVNWNxQkduek1RMEpxUVJnSWJiSVgxTTNEblJpUFRjLXZVRXZKeHpSZGpUWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Recover As Germany Runs Out Of BTC To Sell - Benzinga",
        "content": "Cryptocurrency markets are trading up as PPI data has sparked speculation of an interest cut in September.\n\nCryptocurrency Price Gains +/- Bitcoin BTC/USD $57,825.58 +0.6% Ethereum ETH/USD $3,129.43 +0.5% Solana SOL/USD $138.75 +1.2% Dogecoin DOGE/USD $0.1076 +0.4% Shiba Inu SHIB/USD $0.00001644 +0.3%\n\nNotable Statistics:\n\nIntoTheBlock notes that 83% of Bitcoin holders are in profit at current levels despite the volatility. While concentration by large holders stands at 12%, 70% of holders have accumulated the coin for more than a year. Exchange netflows widened by 163.9%.\n\nDegen News revealed the German government is out of Bitcoin.\n\nCoinglass highlights 40,300 traders liquidated in the past 24 hours for $126.7 million.\n\nNotable Developments:\n\nTop Gainers:\n\nCryptocurrency Price Gains +/– ORDI ORDI/USD $33.56 +8.5% Maker MKR/USD $2,498.75 +6.5% Ronin RON/USD $2.05 +4.9%\n\nTrader Notes: Andrew Crypto sees a \"clean break above $59,200 next to continue this bullish momentum.\"\n\n\n\nHe concluded, \"A reclaim of the range is needed to confirm a local bottom.\"\n\n\n\nAnother crypto trader noted that \"Just like that market sentiment shifts to more positive but still doubt over hangs price performance. Will need to see multi-day follow through from spot buyers.\"\n\n\n\nCrypto trader Kevin also highlighted that Bitcoin has recovered nicely as Germany runs out of all its Bitcoin. He also reaffirmed his prior prediction that if Bitcoin \"can break above $60,000 and hold it then we can negate this pattern, which would be bullish.\"\n\n#BTC almost broke down last night but has recovered nicely since.. Germany all out of BTC. Send it higher https://t.co/Pbyn34rcUU pic.twitter.com/bBzYVmkw2x — Kevin (@Kev_Capital_TA) July 12, 2024\n\nCryptoquant Founder & CEO Ki Young Ju revealed that whales use a lot of leverage at cyclical bottom. While he suggests trading like a whale, he added \"whales use a lot of leverage only at the cyclical bottom.\"\n\nRead Next:\n\nImage: Shutterstock"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxONlB0OGZRd0hJd3hQU3FaLWlXa280UFVubVUtQkJYVXZPc2lNd1drcnFlVTlVd1BiVVFhRGVDLTJERTlxWENIMVp1TzJDZDZxdG9od3c4MFA0LXMzQzEwS2FEWUlENDdraTF3WExjaW0yd1RuNTRvVFlQem1meGFrMWpObnc3cHZKWFRHY29sXzk0Q3JkWWZzTUQzMUd1dDFFbkhHRUhqOG9MYWF0eWloZERXMUgzZ1RNM1puRHR5VnRxUjRoQVpLRmVGVmFCQWZ4RThoU290RdIB3AFBVV95cUxQSVZpSHZmUFduQjVGWFB6cjZQWV9ydkFrOWhLYzdvdUFZeURzc0hYVTBRU0lZSG12cGdmV1FyUjJORzctcXdadlRpSWlFU1VNZW5wUkNsNW54UEhXTTZwRkRoY3hRTGc4bGpYdUN5Q3JtUTVOVmZYYk1PSHgxNXUwa1dkazdfcGFUWmpKLUZ0aDVTSmFUVFFnTlhQNnp4U2E2cXFFaGVPTkNxYzBQclQ1ZzNlaXJmemlzR1ZHTWtOdVk4SG9xNFJXRVE5U3NYUUEzRFNvV0R0RnY1QV9p?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Could Continue Underperforming Bitcoin Even After Spot ETF Approval, Says Benjamin Cowen – Here’s Why - The Daily Hodl",
        "content": "A widely followed crypto analyst believes that Bitcoin (BTC) could continue to outperform Ethereum (ETH) even if a spot ETH exchange-traded fund (ETF) were approved as expected.\n\nIn a new video update, crypto strategist Benjamin Cowen tells his 803,000 YouTube subscribers that Bitcoin could continue to have an edge over Ethereum as past narratives about ETH outperforming BTC haven’t lived up to the hype.\n\n“I ultimately don’t think the spot ETF for ETH will necessarily keep the ETH/Bitcoin valuation from staying at relatively low levels… There’s been so many narratives that have been given out over the last few years as to why the ETH/Bitcoin valuation would never go to even the current levels that it’s at… In 2022 when ETH/Bitcoin was at .08 BTC, if you had told them that it was going to go down into the mid-.04s BTC by 2024 they would have laughed at you…\n\nWe have these narratives about the transition from proof-of-work to proof-of-stake on this deflationary mechanism theoretically causing the Ethereum/Bitcoin valuation to ‘hold up well’ and that didn’t play out. And so it sort of gave us a glimpse into the idea that, hey, maybe this is more about monetary policy than it is about anything else.”\n\nETH/BTC is trading for 0.05416 BTC ($3,112) at time of writing.\n\nThe analyst also says the Bitcoin dominance (BTC.D) chart excluding stablecoins could decline in the near term only to increase in the fourth quarter, based on historical precedence in both 2016 and 2020.\n\n“There is a case to be made that whatever pullbacks there might be will likely be over some time the next month or so… In Q4 of halving years, we have seen dominance go up both times.”\n\nThe BTC.D index tracks how much of the total crypto market cap belongs to Bitcoin. A bearish BTC.D chart suggests that altcoins are about to outperform Bitcoin.\n\n?\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxNWUNIWV94dkRMM0xrZGRUYzB4dGhWb05sN1BwWko0NWtwc1U0NnE4dnQ2REJSWVVhMlpUODU4WEFFSW1PUzRJSTE2QmdJYnR4UEpVdmJEWDBvaVdQeGNTM3JiSmtmTXBnNVJLcnA5Ni1KRkpJV2FPMFlSUkF4SnkyUndhQ0t4YXE2NW1iZngtT2N2eVdQYUxfY21sb1QxWTBZUUhEUk5Ba2lneldoQlJ6QzBLZGUzMXkzUmc3dWZTWUZVRGxzWUZXcmIwcldVbVNDLTNyalVVd0JYQW5IM1ZLZllkazQwR3RKR1psall5SGzSAfYBQVVfeXFMT2RrTUlPUENBTXZfanZNOERMeWFfUlZHNHo2LXFxMkJlZENkYUl6TE5kQzZMZy1xSUdlNFJDdVEyenV5bmN0ZnJzYXR4Z0FwU0ZwV1BmZzlTdHlleXJFQktSVjhJMWNYaWlUS0UyZUUxSGlpN3BDQm1BQ1hVU2ppdG45Z1gyeElFV3l2WTE2MURtaUNIY181aEFDQ1gtVzNSRXVWeUQ5NVo2dklzbnVQck9JVTdMei1GS1VkVDJGNHdyd1R3RzlGeHJ2Tk1JNzZvUjFQeFpaUGIzd3FQV3pZeVkzSnRfcmdGcjYxN3l5Y05jMENPYndB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin volatility surges amid impact of US CPI data - FXStreet",
        "content": "Bitcoin price finds resistance around the weekly level of $58,375; a breakout of this level could signal a bullish move.\n\nEthereum finds support around the key level at $2,817, with potential recovery on the cards.\n\nRipple price finds support around the weekly support level of $0.413, impending rally eyed.\n\nBitcoin (BTC) initially dipped before rallying after the release of US CPI data on Wednesday. Ethereum (ETH) and Ripple (XRP) are possibly set to mirror BTC’s pattern, showcasing the synchronized dance of cryptocurrency markets.\n\nBitcoin price shows potential\n\nBitcoin has encountered resistance near the $58,375 weekly resistance throughout this week. As of Friday, BTC is trading at $57,250, showing a slight decline of 0.2%.\n\nFurthermore, BTC is currently below a descending trendline formed by connecting multiple swing high levels from early June to mid-July.\n\nIf BTC closes above the weekly resistance at $58,375 and a breakthrough above the descending trendline could potentially lead to a 9% increase, targeting a revisit of the daily resistance at $63,956.\n\nMoreover, the daily chart shows a lower low formation on July 5, while the Relative Strength Index (RSI) indicated a higher high during the same period. This bullish divergence often signals a trend reversal or a short-term rally.\n\nBTC/USDT daily chart\n\nConversely, if BTC closes below the daily support level at $52,266 and forms another lower low in the daily timeframe, it could indicate continued bearish sentiment. Such a scenario might trigger a 4% decline in Bitcoin's price, potentially revisiting the low of $50,521 observed on February 23.\n\nEthereum price displays resilience with promising upside\n\nEthereum's price found support on Monday at $2,817, which was its low on May 1. It rebounded by 2.7% in the next two days. As of Friday, it is trading slightly up by 0.32% at $3,059.\n\nIf Ethereum's price closes above the $3,240 level, ETH could potentially increase 8.8%, targeting a retest of its daily high from July 1 at $3,524.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator (AO) on the daily chart are currently below their respective neutral levels of 50 and zero. For bullish momentum to be sustained, both indicators need to rise above these critical levels, which could support the ongoing recovery rally.\n\nFurthermore, surpassing the $3,524 level could open the way for an additional 5.5% rise, aiming to retest the next daily high, recorded at $3,717 on June 9.\n\nETH/USDT daily chart\n\nOn the other hand, if Ethereum's daily candlestick closes below $2,817, forming a lower low in the daily timeframe, it may signal persistent bearish sentiment. This scenario could potentially trigger a 7% decline in Ethereum's price, targeting a revisit of its daily support at $2,621.\n\nRipple price eyes a rally\n\nRipple's price found support near the weekly mark of $0.413 early this week, rebounding by 4% over the subsequent two days. As of Friday, it trades up by 0.6% to trade at $0.452.\n\nA daily close above the $0.450 threshold for XRP could potentially fuel an 11% rally, targeting a revisit of its daily resistance level at $0.499.\n\nOn the daily chart, both the Relative Strength Index (RSI) and the Awesome Oscillator (AO) are currently positioned below their critical thresholds of 50 and zero, respectively. To maintain bullish momentum, these indicators need to rise above these levels, potentially bolstering the ongoing recovery.\n\nFurthermore, surpassing the $0.499 level could pave the way for an additional 6.4% increase, aiming to retest the next daily high at $0.532 recorded on June 5.\n\nXRP/USDT daily chart\n\nHowever, if Ripple's daily candlestick closes below $0.413, forming a lower low in the daily timeframe, it indicates sustained bearish sentiment. Such a scenario could potentially lead to a 16% decline in Ripple's price, targeting a revisit of its low from March 12 at $0.347."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOeEhwMFJ6YzJ6UnpjcURfRTlQY2U2QUV6UTB5bHVldHl6b2lnWHZQSkhTRndyb2ctUEoyNmxVS19DT19BeU9QVmpkQk9oRW1OM3FNazF6Ym5sRHRUQTBaU0tpc1dMUy1NQmdzbHVKQkllUnoxakdOX1I2akZKOHdsb1BPS3owWTMyVG91MFVDdEVOcWVCalJr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "The Ultimate Cryptocurrency to Buy With $1,000 This Summer - The Motley Fool",
        "content": "Amidst the recent market correction in crypto, Ethereum stands out among a crowded field for several reasons.\n\nAfter a strong start to 2024, the crypto market suddenly fell by nearly 20% last month. While it is still well within bull market territory, the recent correction can present a compelling opportunity for investors looking to bolster their exposure.\n\nHowever, not every crypto is cut from the same cloth. Just because there is a widespread correction doesn't mean just any cryptocurrency is worth your hard-earned money. While a handful could meet this criteria, one in particular stands out from the crowd -- Ethereum (ETH -7.32%).\n\nThe pending approval of spot Ethereum ETFs\n\nCrypto has come a long way in the last decade and a half, culminating in the recent approval of spot Bitcoin ETFs in January. A spot Bitcoin ETF allows investors to buy and sell shares that represent real Bitcoin (BTC -4.18%) on the stock market. Not only does this serve as a de facto stamp of legitimacy, but it also opens up the underlying asset (in this case Bitcoin) to a broader range of investors, specifically those who prefer the regulated environment of traditional financial markets.\n\nSo far the spot Bitcoin ETFs have been hit and one of the most successful ETF launches in history. In hopes of snagging the next big thing, attention has shifted to Ethereum.\n\nCurrently, there are eight applications under review by the Securities and Exchange Commission (SEC) to grant approval for a spot Ethereum ETF. While these processes can be cumbersome, the consensus is that they will gain approval sometime this month, and in the worst-case scenario, by the end of summer.\n\nWhy it matters\n\nThe approval of spot Ethereum ETFs will undoubtedly have a significant impact. First and foremost, it will open up Ethereum to new money and buyers, just like we are seeing with spot Bitcoin ETFs. Most evident are institutional investors. Known for their deep pockets, with a regulated and secure way to gain exposure to Ethereum, the expectation is that there will be an influx of institutional capital that can drive up demand and, consequently, the price of Ethereum.\n\nTake a look at Bitcoin for evidence. When Bitcoin ETFs were approved, Bitcoin surged 50% in just three months following approval, showcasing the potential impact on Ethereum.\n\nHowever, while there's no way to estimate the total influence of spot ETFs in the long term, there is some clear and compelling evidence that could show where Ethereum is headed in the short term.\n\nAt the beginning of May, many analysts estimated that the chances of a spot Ethereum ETF being approved were less than 25%. However, things quickly changed just a few weeks later.\n\nOn May 20, reports started circulating that the SEC was pivoting and planning on granting approval. In a matter of hours, Ethereum jumped more than 20% from roughly $3,000 to $3,800. Fast forward a month or so, and now Ethereum has fallen victim to the wider cryptocurrency sell-off that occurred, with its price now back down to around $3,100.\n\nYou might be able to see where this is going. The ETF approvals are likely a matter of when, not if. When they are approved, it would likely be safe to assume that Ethereum should, at a minimum, rise back up 20%, as this is how the market reacted when initial reports of approval started circulating. While 20% might not be massive in the world of crypto, it is still a commendable return and one that could be just the beginning of a more significant upward trend.\n\nThe opportunity at hand\n\nThe ETF news is incredibly bullish for Ethereum, not just in the short term but also in the long term. However, this is just one aspect of Ethereum's value proposition.\n\nEthereum is one of the most proven blockchains with clear utility over the years. It is the primary blockchain of DeFi, one of crypto's most prominent and innovative use cases, with more than 60% of the digital economy calling Ethereum home. Additionally, it has recently attracted the likes of BlackRock, which is pioneering the tokenization of real-world assets on the Ethereum blockchain.\n\nAll these factors combined make Ethereum the ideal crypto investment this summer. The pending ETF approvals, coupled with its proven utility and increasing institutional interest, position Ethereum as a standout in the crypto market. Investing in Ethereum now could offer substantial returns as the market recovers and new opportunities arise.\n\nSo, while the recent market correction may have caused some hesitation, it's important to see the bigger picture. Ethereum's robust ecosystem, ongoing developments, and potential for ETF approval make it a compelling investment and the ultimate cryptocurrency to buy with $1,000 this summer."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNaDhIR2pvUGhSUW9CdDlGNzZ5MExSVVZYSnRCMmZHdHJia1hRUU15QkZmWWVZZnk0VmliWnZrdkdVWUNfTmFIWnRDNTBnckgxRFNkQl92YlF6c2dIakI4ck1DN0owSXEwako4VGIwNGpFMFFnbm01dmRhdFQtcE05SlRlaXFjY3JkY0RNRTNyeTJ2Wk4w0gGaAUFVX3lxTE1XVkRMbXVUT3V4WDdhd2JQeW1KaXhhZmdTZU5TT21VNHpsWnZQZnFUa0ktbUlnMDloMlVQal9qNDhBUjRkY016c1dFSHJBY2pBX19jVmtYUE1uS0tvYjhIUldESy1CbWFydkFFRkhWOWdmUGI3cktFVlpjZWp4NGwzdFJBVHowQXNmR3RNRFY3YlBpSGtDSGRJR3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "4 Undervalued Ethereum Altcoins Gaining Institutional Interest - CoinGape",
        "content": "The consolidation trend in the cryptocurrency market continues as the leading digital asset Bitcoin struggles to sustain above $58000. Amid the uncertainty, the Ethereum altcoins in the ecosystem show a slight uptick due to market speculation of spot ETH ETFs getting approved around mid-July.\n\nA recent report by on-chain data tracker Lookonchain reveals significant Ethereum price ecosystem token accumulations by whales and institutions. Notably, aavebank.eth withdrew 21,027 AAVE ($1.98M), 205,493 UNI ($1.62M), 446 ETH ($1.37M), 102,313 LINK ($1.28M), and 20,797 ENS ($534K) from Binance.\n\nadvertisement\n\nMeanwhile, whale “Ox345f” withdrew 508,001 PENDLE ($1.89M) and 1.08M LDO ($1.77M). These large-scale transactions suggest a bullish outlook on Ethereum altcoins, indicating strong confidence from major market players.\n\nHere are the top four Ethereum ERC-20 tokens from the list above, each well-positioned for a significant market reversal.\n\nEthereum Altcoins -Chainlink (LINK)\n\nChainlink (LINK) is a decentralized oracle network that plays a crucial role in bridging real-world data to smart contracts on the Ethereum blockchain.\n\nAmid the current market uncertainty, the native cryptocurrency LINK is hovering sideways above $12.2 support. This horizontal level has been intact for the past eight months now coinciding with 200W EMA to create a strong accumulation zone.\n\nToday, the Chainlink price jumped 0.44% to trade at $12.4, while the market cap surged to $7.53 Billion as seen on CoinGecko. A potential rebound could uplift the asset by 28% before challenging the key resistance of a downloping trendline.\n\nAn upside breakout from this resistance will offer a better confirmation of sustainable recovery.\n\nAlso Read: Ethereum Price Forecast: Dwindling Open Interest Hints Sluggish Climb To $4,000\n\nUniswap (UNI)\n\nUniswap (UNI) stands out in the decentralized finance (DeFi) landscape as a leading decentralized exchange (DEX) built on the Ethereum blockchain.\n\nUNI, the native governance token of Uniswap, has been trading sideways for the past five months amid the triangle formation. The two converging trendlines of the chart setup are majorly influencing this altcoin’s price movement.\n\nCurrently, the Uniswap price trades at $7.75 seeking support at the pattern’s lower trendline. Consequently, the Uniswap market cap holds at $4.65 Billion, while the 24-hour trading volume is at $123.1 Million.\n\nA potential rebound could push the asset 20% before piercing the upper boundary of the triangle. This breakout will signal the end-of-correction pattern and attract momentum trades into the market.\n\nLido DAO (LDO)\n\nLido DAO (LDO) is a prominent project in the Ethereum ecosystem, known for its innovative liquid staking solutions. Amid the recent market correction, the LDO price fell from a $2.5 high to a $1.4 low registering a 44% loss.\n\nThe $1.4 support marked as the August 2023 bottom, provides the LDO buyers with renewed demand pressure. With an intraday gain of 3%, the Lido Dao coin trades at $1.629, while the market maintains around $1.45 Billion.\n\nIf the support holds, this altcoin may rally 22% before challenging the first resistance carrying the correction trend. The daily chart shows two downsloping trendlines that the buyers need to breach before reclaiming better control over this asset.\n\nEthereum Altcoins To Buy: AAVE\n\nAAVE is a leading decentralized finance (DeFi) protocol that allows users to lend and borrow a wide range of cryptocurrencies.\n\nOutperforming the market consolidation, the AAVE price has been rising for five consecutive days. From the multi-month of $75.5, the altcoin surged 23% to hit $93.27 and the market cap jumped $1.39 Billion.\n\nThe AAVE price currently testing the downsloping trendline of the descending triangle pattern indicates a pivot momentum for the coin holders. If buyers flip the overhead trendline into suitable support, the ongoing recovery could chase the potential target of $134, followed by $153.7.\n\nHowever, a bearish reversal could signal the continuation of the consolidation trend within triangle formation.\n\nAlso Read: 32.7 Million Ethereum Staked, Nears ATH: What Is Fueling This?\n\nKey Takeaway\n\nThe ongoing consolidation in Bitcoin and Ethereum shows no clear initiation from buyers or sellers to drive the crypto market. However, as the BTC price faces additional supply pressure from the German Government liquidating their Bitcoins, the potential approval of ETH ETFs bolsters Ether. Thus, the market whale/institutional entities show a higher interest in the Ethereum altcoins increasing their possibility of reversal.\n\nFrequently Asked Questions (FAQs) 1. What is a \"spot ETH ETF\"? A spot ETH ETF refers to an exchange-traded fund that directly holds Ethereum as its underlying asset, allowing investors to gain exposure to its price movements without owning the cryptocurrency themselves. 2. What does \"whale accumulation\" mean? Whale accumulation refers to large-scale buying activities by individuals or entities (whales) who hold significant amounts of cryptocurrency. 3. How does \"support\" function in technical analysis? In technical analysis, support refers to a price level below which a cryptocurrency has historically not fallen, suggesting a concentration of demand or buying interest at that level.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]