[
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNNUdGanZ5eUZkR3NFRWZxaE1OMVJxZm5lY25CMkZxWUJ2emwwY3FnM29TcHE1SFlHMUgyZzViWG9mNWgycDR1MV9Lc0VQT2xuZlhuWkhXQmpCYXpIV1c2N0UyeUZvUVFhY3N5bkNuVEdDWTY4SEZEbzlVbElCY3RnWVlsaDRvTTdScUJqSXBSc0hsTjB5TllJQjBzSGxoUk4wSTBnT2QtWFlKMnVGUnZfdUFzd3hBQmlqRVlFdFhHdW1DU3fSAcgBQVVfeXFMTUJqaENDUnozSVluaXdLMWtpOFktMlI4T0FWWVVlX2tXd3ZqOW5kUXNtQ2NLMXY0X3NLQ1d2cndoNjJEVEQ2NXJUSm1WUlRWTHRCbm42X3VVSFNTV3NNa09PODh2VVZEdUo1aUxHZmZmSzlhQkxzYko2eFZDUHZhUzAyNXpSOGpnOFY5b192ZDl5MHZVd2NsU3dGdi14SUpETlZzMU5yYUFrUk0xZFJjMDdaUnk0RS1IelFOblVuNWphem1ONjFfZVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Ether Could Hit $4,000 With Likely Spot ETH ETF Approval in May: Standard Chartered - CoinDesk",
        "content": "The market currently underestimates the odds of an approval, according to the report, but the bank sees \"no fundamental reason\" for the SEC to treat ETH differently than bitcoin. It highlighted that ETH futures are also listed on the regulated Chicago Mercantile Exchange (CME) and the SEC did not include ETH among the 67 cryptocurrencies the agency claims to be securities during its legal fight against Ripple."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPb3FkQl9KS1Z6RnV0ak9vODV3amJXaHFPUmN1MXRxTlFLcjhlVXlrUmJoRTZBd3lqQVlHWVY1LWNlRnRkcTcwaF9abUhrSURDazhYVU0tbk90azE0LTNEMGU0VERfZ0hLYWI1UmxSWk9UVXVxaXB4RUdMNFBMdjY1b09PQ1FvNmRHNm5yMVJVYmRWOWJoRy1MS2xZekRSRy1s0gGmAUFVX3lxTE14bVFnOTFsV1VDMFhQeXN1Nm5hc2xNQTJvWmF5c2ZGR3RKRHVud3Foa2J4WUhpbGVNcDQ1N0NxQjMzSVB1TGppN3NoUXFJUXF4UnNTLXZJTkR4S3IwRzNlQmF4V1IydTdHM3Q0MUtwbGFQZzA5YXhQQm1GYUtHejdrUW1wUVRmajEwOV9kWFNVWU95UmUzUGdGbW9sdlQ1V2Q5RWFtRGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Standard Chartered Predicts Ethereum (ETH) Price Will Hit $4,000 Following ETF Approval - U.Today",
        "content": "Advertisement\n\nStandard Chartered has forecasted that the U.S. Securities and Exchange Commission (SEC) is poised to approve exchange-traded funds (ETFs) for Ethereum in May, Bloomberg reports.\n\nThis anticipated approval is expected to significantly impact Ethereum's market value, with predictions suggesting a surge to $4,000 by May 23, the final deadline for ETF applications from VanEck and Ark 21Shares.\n\nNot so fast?\n\nDespite the optimistic outlook from Standard Chartered, the SEC's impending decision on Ethereum ETFs is met with varying opinions from analysts.\n\nLegal experts Jake Chervinsky and Scott Johnsson have voiced skepticism over a guaranteed positive outcome.\n\nAdvertisement\n\nChervinsky stressed the erroneous assumption that the SEC's past decisions on Bitcoin ETFs will automatically translate to Ethereum.\n\nJohnsson pointed to potential regulatory hurdles, arguing that the SEC might demand consistent correlation across a 2.5-year sample period.\n\nThis diverging viewpoint is echoed in the industry, with JPMorgan offering a cautious 50% chance of approval due to legal uncertainties, while Bloomberg Intelligence's Eric Balchunas predicts a more optimistic 70% chance of approval.\n\nEthereum's price performance\n\nThe current trading price of Ethereum stands at approximately $2,372.37 with a market cap nearing $285 billion.\n\nDespite these robust figures, the Ethereum Fear and Greed Index indicates a neutral market sentiment, with a current score of 54.\n\nThis underscores the cautious optimism among investors as they await the SEC's decision and its potential impact on Ethereum's value."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNdVlvaWYxTWl5TEJJNlpWV3lHMXdnaVRRNkhqTS1oUi1iMmZyMkJmSG10dXRwcFQ2VTRLbXROdWRXQ2RFNVMxZ3N2TVFnRzRNeko2bW1ZRWlsaDVSVGNlU1pwbVBaeDg5c0NTdEEyTjdXYjNFWVpkOElmQ1NFbVZpMzFwc9IBiwFBVV95cUxPaUc5RXpheEJsbzFFWkdXQlhtUFhROEFvNVo3NFhvRjIwa2FXUjQ0SUV1SkJNM1pyWUg0ZUkyeVVmWVh6NjVWb244SFhDUmg4MVVBNTdFUGhSZ0hfZlZwaEZWb2thekhSdFVTNWtQdDY4R21fX0lQVl9UeFBncjdhTmhnY0wxQmdyT2kw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Could Nearly Double in Price on ETF Approval in May: Standard Chartered - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nExchange-traded funds (ETFs) giving investors exposure to Ethereum (ETH) will be approved in May, British multinational bank Standard Chartered has projected.\n\nIn a Tuesday report, the bank said that it was likely that the U.S. Securities and Exchange Commission would give spot ETH ETFs the green light by the final deadline of May 23.\n\nAnd when the funds start trading, Standard Chartered expects the value of ETH will go as high as $4,000. ETH is currently priced at $2,372, according to CoinGecko, and hit an all-time high of $4,878 in November 2021.\n\nA number of high-profile firms including Wall Street titan BlackRock have proposed their own spot ETH ETFs. Such ETFs—sought in earnest now that Bitcoin spot ETFs are available in the U.S.—would allow investors to gain exposure to the second-biggest digital asset without the need to buy and store it themselves.\n\nAD\n\nAD\n\nStandard Chartered said that the investment vehicles were likely to get the approval stamp from the regulator because the SEC has not said ETH is a security. Meanwhile, the SEC has come down hard on crypto companies selling what it deems to be unregistered securities.\n\nThe Commodities and Futures Trading Commission (CFTC) has said ETH is a commodity—an asset that can be bought and sold, unlike a security—for years.\n\nThe SEC approved 10 Bitcoin ETFs on January 10 after a decade of denials. The BTC investment vehicles then started trading the next day and have since been a success.\n\nStandard Chartered said last year that BTC would hit $100,000 per coin by the end of 2024. In today’s report, Geoffrey Kendrick, head of Standard Chartered Bank's forex and digital assets research, added that this price range “still looks achievable.”\n\nAD\n\nAD\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOVDMyOHhUX1BPQlJQT0hPNkJvQzlHLUE5bUZJc2pUd2MwUnBQajhaN3k1d3c1eW1LU0VycUIxRzFOMHZER285S0ZrY3BKMnIxaUljTzNNU0tNZVhhY2NjMUpHaG5RMTVlQ2tBUjF6cGdsb0tIa19oWEU0Ym0wSmVKNDVNT3hKUS1ic3dIeEJQVU5XZHZzejVROExqN3NPWHZncnNYaVV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Spot Ethereum ETFs Likely to Be Approved on May 23: Standard Chartered Bank - Unchained",
        "content": "The bank’s report also predicted ETH could hit $4,000 in the lead-up to an approval.\n\nStandard Chartered Bank is eyeing May 23 as the date for the Securities and Exchange Commission to approve spot Ethereum exchange-traded funds, according to a report shared with the bank’s clients and reviewed by Unchained.\n\nThe Block first reported the news.\n\nThe SEC is likely to take a strategy similar to the one it took for approving spot Bitcoin exchange-traded funds, according to the report. If approved, Ethereum ETFs would be the second domino to fall after the long-awaited approval of Bitcoin ETFs on Jan. 10, and be a boon for an industry that has undergone a prolonged bearish period.\n\nRead more: SEC Delays Decision on BlackRock’s Spot Ethereum ETF\n\nUnder a section of the report entitled “History doesn’t repeat itself, but it often rhymes,” Geoffrey Kendrick, head of Standard Chartered Bank’s crypto research, wrote that he expects “pending applications for ETH U.S. spot ETFs to be approved on May 23, the final deadline for the first of the ETFs under consideration — the equivalent date to Jan. 10 for BTC ETFs.”\n\nKendrick noted that if Ether follows how Bitcoin performed in the lead-up to its ETF approval, its price could hit $4,000 by late May. Ether is currently trading at around $2,370, according to CoinGecko.\n\n“We don’t comment on individual filings,” said an SEC spokesperson when asked for comment. “Broadly speaking, if the Commission declares a registration statement effective, that is reflected on EDGAR. Any Commission 19b-4 orders will be posted on our website and then published in the Federal Register.”\n\nStill, the SEC postponing decisions on two ETH ETFs (BlackRock and Fidelity) on Jan. 24 follows the same pattern as its deliberative process when it came to Bitcoin ETFs.\n\nThe market doesn’t seem to agree with Kendrick, however, with a wide range of opinions about whether Ethereum ETFs will even be approved at all.\n\n“Based on market commentary, we believe approval expectations are relatively low, likely below 50%,” wrote Kendrick. Yet, he believes the market is wrong in this case."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPUGxDaTd2UFRCSFgwNjFLR2Q3NWlRbmdfTERaSjFNMGxYeElaVVVKRmJDOUZvOThQclpWVkY0X3VWR01Oem1TUGI3RXlhdFduVEo4SWRnT01PajJJVl8wUE83dk94RlpNUWpWdDRZWlpSazl2WE9CcldFcktaRVBsYWRpNkZCRDBkb1dzekhFU3owQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "TD Cowen expects spot Ethereum ETF no earlier than 2025 or 2026 - CryptoSlate",
        "content": "TD Cowen’s Washington Research Group predicted that spot Ethereum ETFs will not gain approval this year, according to Kitco on Jan. 29.\n\nThe U.S. Securities and Exchange Commission (SEC) must soon decide on proposed rule changes that would allow spot Ethereum ETFs to be listed and traded on securities exchanges. TD Cowen argued that approval is unlikely, stating:\n\n“[The SEC] can eventually reject the rule change, which either will lead to a new application or litigation … Either will take another year or two to play out.”\n\nIn that event, any possible spot Ethereum ETF approval is unlikely to occur until late 2025 or early 2026, the research group said.\n\nThe SEC must reach a decision on VanEck’s spot Ethereum ETF application by May 23 but is not required to approve the fund. The securities agency is expected to reach a decision on similar applications at the same time.\n\nOther sources are divided on whether a May approval is likely. One Polymarket prediction market suggests 47% odds of approval, while one JP Morgan executive has suggested a 50% chance of approval. Bloomberg ETF analyst James Seyffart is slightly more optimistic and has predicted a 60% chance of approval.\n\nPolitical factors are at play\n\nTD Cowen said that its low approval expectations are based on partisan attitudes toward cryptocurrency. The research group wrote:\n\n“This is a political call. We believe there is no upside for SEC Chair Gary Gensler to approve a spot Ethereum ETF given how upset progressive Democrats were over the agency’s approval of a spot bitcoin ETF earlier this month.”\n\nTD Cowen noted that SEC Chair Gary Gensler, a Democrat, needs support from progressives in order to advance his agenda or potentially obtain a different government position in the event that U.S. President Joe Biden wins a second term. It suggested that approving a spot ETF would involve a “needless fight” and that Gensler is likely in “no hurry” to approve such a fund.\n\nDemocrats broadly opposed the earlier approval of spot Bitcoin ETFs, as TD Cowen observed. Within the SEC, two Democratic commissioners voted against the approval of a spot Bitcoin ETF while two Republicans voted in favor of approval. Gensler voted in favor of approval in spite of his Democratic party membership and his broader concerns about cryptocurrency.\n\nOutside of the SEC, Democratic Senator Elizabeth Warren expressed complaints about the decision to approve a spot Bitcoin ETF on Jan. 12.\n\nMentioned in this article"
    }
]