[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPbHY0eDdJYXJ4b3I0M3Y5VVVpRzNIUGE1QWxzaTUtSDlVSzlPY0RoSThFaXAtekMxNElxdEREemhlMTlWVl9QbVktU1F5c1dnS3dFeWxtbVRFTFdMREJ6czZzeDUwNEowNVB0UHp5YzZkUW1INGpCcS1tZzdpVGNHcHBGVGNMWEtyMy1vVjJuZGhOWnU3NW9jdTJHQ1hsVnhsSWZ4QllCTDRhcHNTQzVHSzRERnJMR3VLWmZsMFJxTktZZXYzbHBDWWVuT2V2MEZq0gHWAUFVX3lxTE9Wajl0cmxXWlRLdDRtcHhTRThPYjNzYm5rb1dyUG15SDV3M1lKcDM1T01KNWNhTFVsZk5FTjd4b3BnSlBCemNobEx1b1NHY3JkQ3dVUkhNNzZKTUtZS3NGd3ZwaTBoczFzWUctYVM3RUMteXdyRlNrRFE0ci1nYVNkc1NwakVJanBNSE9OSnFzdURLajhRaGUyTTF2VVFhR1JqS1NqT3VfdmxlZmYyejZxYVlnb2RDM2dSeWlxeTRFSVFJbkc2Q0NwbWNGOXQwbmFQX2N3TUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "XRP Ledger Now Closer Than Ever To Ethereum Compatibility As Second Audit Nears Completion: Developers - The Daily Hodl",
        "content": "The XRP Ledger (XRPL) is almost ready for the launch of its much anticipated Ethereum Virtual Machine (EVM) compatible sidechain, according to developers working on the project.\n\nThe project aims to allow Ethereum (ETH) developers, who are used to Solidity, the main programming language for writing smart contracts on Ethereum, to access and build on the XRPL network.\n\nDevelopment firm Peersyst Technologies says on the social media platform X that the new sidechain is waiting for a few components to come together, such as its XChainBridge which is currently being voted on by validators.\n\nThe bridge aims to allow users to automatically bridge any token from the sidechain onto the XRPL.\n\nPeersyst also says that the sidechain, which is “more advanced than ever” and has already been audited by security firm Bishop Fox, is going through a second audit with “a recognized supplier” that will be published soon.\n\nThe firm also says that a new version of blockchain explorer Blockscout is being built for the sidechain.\n\nAccording to Ripple, some highlights of the EVM sidechain include:\n\nSupport for 1000 transactions per second, enabling large loads and throughput.\n\nLow transaction confirmation times, producing a block every 5 seconds.\n\n1 block finalization time; once a block is added to the chain and confirmed, it’s considered final.\n\nFull Ethereum Virtual Machine (EVM) compatibility, enabling you to connect your wallet and interact with or deploy smart contracts written in Solidity.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Natalya Yudina/INelson"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE1wTXdtQ2k3OUZhaENZTmhTV2tGVFlGbDB5UlB5aWdUeUtnZGFENkdRVEpzQldXbnhkdllBalpteTl5MC1oWnZhQ0NPcjZNQ29MV0JKSGRSRUplc0tEZWx5VHVR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 20:30:31 GMT",
        "title": "BlackRock spot ether ETF decision delayed by SEC - Blockworks",
        "content": "\n\nThe Securities and Exchange Commission delayed a decision on BlackRock’s proposed spot ether ETF.\n\nThe delay pushes any decision on the proposed fund to March 10, according to an official release by the agency.\n\nThe delay was largely expected, with the SEC also delaying decisions on Fidelity’s proposed fund on Jan. 18.\n\nRead more: After spot bitcoin ETF approval, eyes shift to ether fund decision\n\n“Spot Ethereum ETF Delays will continue to happen sporadically over the next few months. Next date that matters is May 23rd,” Bloomberg Intelligence analyst James Seyffart said.\n\nLoading Tweet..\n\nThe decision comes just weeks after the SEC approved nearly a dozen spot bitcoin ETFs. Three commissioners — Hester Peirce, Mark Uyeda and Chair Gary Gensler — voted in favor of the ETFs.\n\nFollowing Grayscale’s legal victory in August, the SEC was compelled to reevaluate its application for a spot bitcoin ETF conversion. Despite this progress, the status of ether ETFs continues to be unclear.\n\nIn an interview on Tuesday, Peirce said that the SEC would “apply precedent” to any decisions on spot ether ETFs. She further noted that the agency doesn’t plan to repeat history and face another court case in order to approve such funds.\n\n“I’m not holding my breath,” Lara Crigger, editor-in-chief at VettaFi previously told Blockworks about ether ETF approval.\n\nHowever, Seyffart previously said that he was more bullish about the future of ether ETFs.\n\n“If [Gensler] goes after ETH, it’s not just going to be a lot of these industry players; it will also be the CFTC that he has to contend with, and it’s just not worth it,” he told On the Margin podcast.The delay was largely expected after the SEC also delayed Fidelity’s proposal\n\nIn his press release following bitcoin ETF approvals, Gensler noted that the decision “should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxQbDRlTUk0SENRWEFvMXJQTE56VXRKUzdQZmJNTGpHZ1djdm9VMnhla1JRNmpUZ1JDZER1QTZRb0pkNThqS2JENUJBTWtpY1FYLVpLRjBVWjliQ0VPSDh3b3NuNU1JTkI5VHlkNUNqaXVUV0lrYlZJTXMwZ0tPdTFDVWxvRXpUODBULUlLN2RkTUlPLWx6azdyNEJZUjM5ckdtenB0WWhqaV9IdkllR2xFTzg3eWJzeUtHTmtRVnhkbFlwMUFfN2lzUjQ5VVc0TURhRC16T2pBS1k1aG1QanNsMlZ30gHnAUFVX3lxTFBvMWJwWnRXX1d0cFRwUnRWMWdUVUVwT3RaTFhVbG8zcnUyMUgyOWFod3hRd3hnQlBKSHZKOEwwamJIOEFIRlRyT25DS0NzS0FnYXB2aDd5RS0xS2o4eFJWU1Z0MVlOXzE5UmE4UjlyMTRzdzRaNFQ2VDBRQkNZRjlpd29mRnZfdTZhWDgwQ3N4UE1vV0wwSjMtVGRRUnFIWURtM3FITGF4S2NieHlYR3FnUG9xNlVnOVJ0SnMtb1piZ19vT1N4Wkd1bVJqV2pvbnlWZWZxbVRWQ0ZqT2dVbEVXZ0IybThpQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Analyst Says Ethereum Massive Bullish Reversal Signal Flashing, Updates Forecast on Bitcoin and One Low-Cap Altcoin - The Daily Hodl",
        "content": "A widely followed crypto strategist says that Ethereum (ETH) is giving off a bullish reversal signal when paired against Bitcoin (ETH/BTC).\n\nTrader Michaël van de Poppe tells his 685,700 followers on the social media platform X that he thinks Ethereum will outperform Bitcoin in the coming weeks.\n\nAccording to the analyst, ETH/BTC is flashing a bullish divergence on the weekly chart, indicating that the pair may be gearing up for a move to the upside.\n\n“I personally believe that Ethereum is going to outperform Bitcoin in the upcoming period and it has started since the ETF (exchange-traded fund) approval.\n\nMassive weekly bullish divergence created, but facing crucial resistance at 0.06 BTC ($2,385).\n\nSome more consolidation and then we’re likely going up.”\n\nLooking at the trader’s chart, he seems to think that ETH/BTC will rally to as high as 0.13 BTC ($5,168) sometime this year.\n\nAt time of writing, ETH/BTC is worth 0.05596 BTC ($2,224).\n\nAs for Bitcoin itself, Van de Poppe thinks BTC may fall to around $38,000 before finding support.\n\n“Bitcoin is at the range low and is actually in the area to be accumulated.\n\nAdditionally, this also means that altcoins are in stages to be bought as those 20-40% dips are a great opportunity.”\n\nAt time of writing, Bitcoin is trading for $39,800.\n\nVan de Poppe is also keeping a close watch on the price action of blockchain data-aggregator Covalent (CQT). According to Van de Poppe, CQT is likely headed to its next support level at around $0.15 before igniting a strong surge.\n\n“One of the latest runners has been TIA (Celestia), but competitors are likely to pace up momentum too.\n\nCQT is one of them. Market capitalization is relatively low and correcting, just like the entire market.\n\nThis provides opportunities and I think CQT is one before it reaches $0.42.”\n\nAt time of writing, CQT is trading for $0.214.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/PeachShutterStock/Spyro the Dragon"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOdVZFQ1NRaGFnSGxUenZWOGZfVWJ0UE5BQTZwdGx1STBNTGw4d24xS2xkOVZ2clBORWNOeWl5eVFGbkU1eUFhRVR5VG43Wklac05WeEUtNmNWNGFlOVNybjkzOEF2d01TUmJEeFFfQ0gtZEJtbWQ3azNNWVREcjViWER6ckdRT0RIanBoTnQtRGRHUFRjWXRvWTJHT3NuMnlIdmpuY0VBOXo1UGxOSXhvOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "SEC has a ‘hard no’ stance on spot Ethereum ETFs, but issuers are optimistic: FOX reporter - CryptoSlate",
        "content": "FOX Business reporter Eleanor Terrett reported a wide range of expectations regarding spot Ethereum ETF approvals on Jan. 23.\n\nNotably, Terrett suggested that the U.S. Securities and Exchange Commission (SEC) is opposed to approving a spot Ethereum ETF. She said:\n\n“Another source tells me the line at the SEC at this very moment is a ‘hard no’ and there’s currently ‘some internal resistance’ to the idea.”\n\nTerrett did not state whether that source is a member of the SEC itself or a member of an asset manager seeking approval from the SEC.\n\nTerrett also noted that SEC commissioner Hester Peirce, known for her pro-cryptocurrency stances, has advocated for a more straightforward decision process. The SEC in part approved spot Bitcoin ETFs because one applicant, Grayscale, obtained a legal victory, as SEC chair Gary Gensler explained in a statement. Peirce criticized that approach in an interview with crypto news platform Coinage today, as she said that ETF approvals should involve “regular way consideration” rather than court cases compelling action.\n\nTerrett concluded that further indications of the SEC’s stance will emerge in the coming months as it becomes clear whether it engages with S-1 registration statements. The SEC typically posts notices of meetings with asset managers and exchanges on each ETF’s page as they occur.\n\nAsset managers appear to be optimistic\n\nDespite resistance within the SEC, Terrett suggested that the asset managers responsible for issuing each fund are optimistic about approval.\n\nAccording to Terrett:\n\n“[One] issuer with an ETH Spot ETF application says they’re confident the approval and smooth launch of the Bitcoin spots will compel the [SEC] to approve ETH spot ETFs.”\n\nAnother unnamed issuer said that they expect a spot Ethereum ETF to launch by the end of the summer because of the SEC’s earlier approval of Ethereum futures ETFs, and because of BlackRock’s strong ETF approval record.\n\nThat source also cited the CFTC comments suggesting Ethereum is a commodity, as well as Ripple’s partial legal victory against the SEC, as factors that could more broadly prevent the SEC from labeling crypto assets as securities. However, it is not clear that those developments will directly impact spot Ethereum ETF approvals in the coming months.\n\nPublic expectations around approval vary. Bloomberg ETF analyst Eric Balchunas posits a 70% chance that an spot Ethereum ETF will be approved in May, while JP Morgan executive Nikolaos Panigirtzoglou has predicted a 50% chance of approval. Polymarket odds suggest a 53% chance of approval.\n\nMentioned in this article"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPOGV2TjF0XzRwZXI5NWh0V19oNlByRmJZRDFScEFsNERYMnNPdmtRUnZWZl9HZGdXSjBDVWRtOF85YVZLXzRXZlNlOU1iR3M1Z3Y3clQ2d1FDeGFxTEhJNGY1NUZKcW94a0RpZVZ5OHNjY3JBaW8yaVVFdXNjOWk2d0ZLd0VDcXVHVzZScnpNTTRRRnlzZ0M5dE1KNlljV3JxZXd1QWNobGN5dmwtU2RaVlUycUROZXAyNm9SS09UcDRURmtqdlk0X0lJc9IB0AFBVV95cUxNYm9uWmZMQy04bXd4VzhKRHY1TS1DdjMtTWJJa1RLWmRCQXJ1SXN0c2dpSkNDekVPdEdGSUwwSXlfZE84OVZ2ajFFZHhBWTJCRHhzYmFRb196elZmR1puSDBXdnZpY3pQV2ViS1ZxRzNULUQwSUxpSmF2aVVLTWdGaDdjX3JHallnWlhLeFBnalg1QUhNRjBMTXEwMm4xTlBzN0NLUzlFdnZPRFN2OURWcjJmcHV3aDBwaUhIVGxoRVVWVi1ITXZFTXdVOUs5RUF1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Celsius Wallet Deposits Nearly $36,000,000 Worth of Ethereum (ETH) Into Crypto Exchanges: On-Chain Data - The Daily Hodl",
        "content": "A wallet associated with the defunct crypto lending platform Celsius deposited $30.34 million worth of Ethereum (ETH) to Coinbase on Monday, according to the crypto tracker Lookonchain.\n\nLookonchain also notes that Celsius deposited $5.13 million worth of ETH to the crypto exchange FalconX.\n\nCelsius’ two staking wallets still hold a total of 557,081 Ethereum worth around $1.3 billion.\n\nCelsius filed for bankruptcy in July 2022 after its native token, CEL, plummeted by 99% and it was unable to fulfill withdrawals.\n\nIn July, the project’s founder, Alex Machinsky, was arrested and charged with multiple counts of fraud in the US. Mashinksy is also being sued by the U.S. Securities and Exchange Commission (SEC) for similar reasons. The regulatory agency alleges Mashinksy raised billions of dollars by lying to customers and offering unregistered securities.\n\nLate last year, a judge approved a new plan from Celsius that aims to generate funds for a new mining and staking corporate spinoff designed to repay creditors.\n\nThe company, dubbed “NewCo,” will have a $1.25 billion balance sheet, $450 million of which will be liquid crypto.\n\nIn a statement earlier this month, Celsius said it has begun the unstaking process for its Ethereum holdings, which it has been using to generate income for its estate over the last year and a half.\n\n“In preparation of any asset distributions, Celsius has started the process of recalling and rebalancing assets to ensure ample liquidity\n\nCelsius will unstake existing ETH holdings, which have provided valuable staking rewards income to the estate, to offset certain costs incurred throughout the restructuring process.\n\nThe significant unstaking activity in the next few days will unlock ETH to ensure timely distributions to creditors.\n\nAs a reminder, eligible creditors will receive in-kind distributions of BTC and ETH as outlined in the approved Plan.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/ex_artist"
    }
]