[
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNNW5md1VTbDUtMXFWdnh1UzhsaTBKeEZaMFBHYXh3YWl3RWFQZzFrVi1tcDQyU2ltLUh3SnByRl9FMzh0VmFwX1V2UGlMNmFERVktWkwtLWZPcTZpc2lvZWhpX0tVZXJoa1psZW0tWnVoYnBuMFpGaGM4dHBwdGs2SGFyMmVjc202bWhQNdIBkgFBVV95cUxOVFlJbTR2aUR6ajVLS0taaU9FUHoxOUhpVnBGTElSTVFiSHdhNTBCcTlFTDFSd3hjUlhuZDl0SnZ1RXRqRDVMRHZ6ZGdYdWxuVUY2NjM2SmhMT0lBZzdadk04VHlpVzE0Sm1FeXZhRUFadGRFbzJqYXBlTGE0SFYtN3IyX3hnNXZydmkxb2ZORWNmdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 May 2024 15:36:14 GMT",
        "title": "Gas Gone Cheap! Ethereum Fees Plunge 93% To Rock Bottom Prices - Bitcoinist",
        "content": "Ethereum users are rejoicing over a dramatic drop in gas fees, with the network experiencing its lowest point since early 2020. This translates into significantly cheaper transactions, making the platform more accessible for everyday users and developers. However, experts caution that this fee fiesta might be temporary, raising questions about the long-term health of the network.\n\nEthereum Gas Prices Hit Rock Bottom\n\nData from from BitInfoCharts shows intraday gas fees dropping 93% from the peak of $30 just six months ago. This translates to a significant cost reduction for various activities on the Ethereum blockchain. Simple asset swaps now cost around $5, while minting NFTs has become a much more affordable endeavor at roughly $9.\n\nThis newfound affordability is attributed to a confluence of factors. The recent Cancun-Deneb upgrade is believed to have played a role in optimizing network efficiency. Additionally, a general downturn in network activity coincides with a calmer period in the broader cryptocurrency market.\n\nA Boon For Users, But A Challenge For Miners\n\nWhile users are celebrating the lower fees, concerns linger about the long-term sustainability of this trend. The near-zero “blob fee” suggests a lack of demand for block space, raising the specter of future congestion and fee spikes. Additionally, lower fees could negatively impact the profitability of miners who secure the Ethereum network.\n\nAccording to analysts, this situation is a double-edged sword. While lower fees are great for users, they could make it more economical for large players to dominate block space, hindering decentralization.\n\nEthereum is now trading at $2927. Chart: TradingView\n\nThe Quest For Scalability: Enter Multi-Dimensional Gas\n\nThe recent gas fee developments highlight the ongoing struggle to optimize Ethereum’s scalability and affordability. In response to these challenges, Vitalik Buterin, the platform’s founder, has proposed a significant upgrade introducing the concept of “multi-dimensional gas.”\n\nThis upgrade aims to provide Ethereum with greater flexibility in managing various resources. By taking a more nuanced approach to resource allocation, the network could potentially improve transaction throughput without compromising security.\n\nA Look Ahead: Will Ethereum Maintain Its Momentum?\n\nThe dramatic drop in gas fees serves as a welcome respite for Ethereum users. However, the long-term viability of these low fees remains uncertain. The network’s ability to handle future surges in demand and maintain a healthy balance between user experience, miner profitability, and decentralization will be crucial for its continued success.\n\nThe proposed multi-dimensional gas mechanism embodies the ongoing efforts to address these challenges. As the Ethereum ecosystem continues to evolve, its ability to adapt and innovate will determine its position in the ever-changing landscape of blockchain technology.\n\nFeatured image from AutoDeal, chart from TradingView"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNUlIyRTlQNHJ2NlNJeDNHQW5JSmZRdDk4R0VPc0NfQS1mZlBQMjdkSkF4bEx0OXdYNl9FUTVXUHZDWVdDOHNPUlJLelNpRUxzNlF5M2ZPc0ZoeEplS2Rjd244cUdPaXdiNDU3d3YydXAtZllESzFRVkp3X1FZY1RzeGFvc1lhV3F3RjdOMmlkVTBrc050TDlxWFBOQWRiSHBvZVpJTlczVUhCYVg1dlpzeEhPcXVseVBMTS0zTlBUUlo5OUVTakhGeFRhT0J1UdIB0wFBVV95cUxNUV9oQmJscVE1SURfME1rWVpxOVFBTUx1b1p0SmFZdHBidnVLUmZaakVlYW9oc01jcE9sM01aS1VqbXdnakVORi02bE5KekVKUFZRcGFOV2hleGZUSWNGVUo2a3lqMTNDNDFqNlRLWWxRVU5rWHR0QWNSVl9fZFN0RGM4dnVrRERHU0tJc3pVMjlLcUdZUm53QW95R1p1WFVYSGoydHliVzJwdDJnRk1lZHlJXzBscmYzTW1URmVHS2t4ZUN0ZnVlY0lleHBENTVwdzVz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 May 2024 07:00:00 GMT",
        "title": "Analyst Michaël van de Poppe Says Big Moment Coming for Ethereum, Predicts Rally for Layer-1 Altcoin - The Daily Hodl",
        "content": "Crypto strategist Michaël van de Poppe believes that Ethereum (ETH) is close to witnessing a big trend shift.\n\nVan de Poppe tells his 717,600 followers on the social media platform X that he doesn’t expect the U.S. Securities and Exchange Commission (SEC) to approve pending applications for spot Ethereum exchange-traded funds (ETFs) in the coming weeks.\n\nThe SEC is slated to approve, delay or deny the ETH ETF applications by financial giants Hashdex and Ark 21Shares on May 30th after postponing it in March.\n\nVan de Poppe predicts that the SEC’s decision will end up being a pivotal point for the top altcoin by market cap.\n\n“This is a very likely scenario with Ethereum, through which the delay/denial in two weeks is the big moment of reversal for ETH and the markets.”\n\nLooking at the trader’s chart, he seems to predict that ETH will plunge below $2,700 before reversing and rallying to $3,800.\n\nAt time of writing, ETH is worth $2,920.\n\nNext up is the layer-1 crypto project AIOZ (AIOZ). According to the analyst, he expects AIOZ to sustain its bullish momentum as long as it continues to trade above $0.65.\n\n“This one looks very promising and is one of the strongest trending assets.\n\nIn-trend level to hold: $0.65-0.68.\n\nIf that’s lost, then the long-term investment region comes into play.\n\nIf we hold, I expect $1.35-1.45 might seem next.\n\nVery strong one.”\n\nAt time of writing, AIOZ is trading for $0.795.\n\nAnother altcoin on the trader’s list is the Ethereum scaling solution Arbitrum (ARB). Van de Poppe thinks that ARB is very close to carving a bottom.\n\n“This one has a full correction and is at the end stage of the correction. Massive cascade in the past weeks, through which the markets often fill that wick in the weeks after. In that regard, markets are close to the end of the correction.”\n\nBased on the trader’s chart, he seems to predict that ARB will bottom out at around $0.90.\n\nThe last altcoin on Van de Poppe’s radar is the native asset of the video-sharing blockchain Verasity (VRA). According to the analyst, VRA is in a full-blown downtrend and may find support at $0.004\n\n“A full retracement is happening, which is relatively common for altcoins in this stage of the cycle.\n\nAn important area of support, and I think most of the pain is already in.\n\nThis support has held in the past, and I expect to do the same here.”\n\nAt time of writing, VRA is worth $0.0051.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOVDU2dWozeEFCcjR3bGV4cjh1NnFFVy1IaXlKNnQ3UUFQOU1oVVQybGx0SURxVFhuck5yam5yUmtSako3SlZZTl90R3hFWGJ0aTdBbHhsTkEyS3MwOE5BU2pRMTQ0WE53cTVIWUkxN2M3SzI5MXphTjhya2FCVU9lSmJ1TmcxelFUN3o0NkhfcTJfLUJ5OXBF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 May 2024 07:00:00 GMT",
        "title": "4 Reasons to Buy Ethereum Like There's No Tomorrow - The Motley Fool",
        "content": "The world's second-largest cryptocurrency still has a lot of upside potential.\n\nEther (ETH 0.02%), the largest cryptocurrency of the open-source Ethereum network, has rallied nearly 70% over the past 12 months. However, it's still trading about 35% below its all-time high of $4,815, which it reached during the apex of the buying frenzy in cryptocurrencies in November 2021.\n\nSome bullish investors believe Ether's price could soar even higher. VanEck's Matthew Sigel and Patrick Bush expect its price to reach $11,800 by 2030, while Ark Invest's Cathie Wood believes it could be worth $166,000 by 2032. Investors should take those estimates with a grain of salt, but I believe Ether could still head much higher for four simple reasons.\n\n1. Interest rates are stabilizing\n\nEther, Bitcoin (BTC -1.65%), and many other cryptocurrencies were crushed in 2022 as rising interest rates drove investors toward more conservative investments. However, the Federal Reserve recently left its rates unchanged and won't likely raise them again this year. That stability -- and expectations for lower rates after inflation cools off -- should drive more investors back toward cryptocurrencies and riskier plays.\n\n2. Its supply is declining\n\nIn August 2021, the Ethereum Network implemented two major changes with its \"London\" upgrade. First, it changed the calculations of transaction fees -- also known as \"gas fees\" -- from a manual bidding system instead of an automated one. That change simplified and streamlined the process by setting prices based on the congestion in the network.\n\nSecond, it started to \"burn\" -- or remove from circulation -- the base fee of every transaction on its network. That burning process ensured that only Ether could be used to pay for transactions across the Ethereum Network (which solidifies its economic value) while gradually reducing its supply to stabilize its market price.\n\nIn September 2022, the Ethereum Network switched from the energy-intensive proof of work (PoW) mining method (used by Bitcoin) to the more energy-efficient proof of stake (PoS) method. That transition, known as \"The Merge,\" reduced its total mining energy consumption by about 99.95%.\n\nIt also made the Ethereum Network deflationary -- so more Ether was being burned than being issued. As a result, about $12.7 billion in Ether has been burned since the London upgrade. That's equivalent to 3% of its current market cap of $378 billion. While that burn rate might gradually cool off, the ongoing process should limit the crypto's downside potential.\n\n3. Possible ETF approvals in the future\n\nThe U.S. Securities and Exchange Commission (SEC) approved the first spot price Bitcoin exchange-traded funds (ETFs) earlier this year. However, the SEC has been reluctant to approve the first spot price ETFs for Ether because it believes Bitcoin is the only cryptocurrency that can be considered an asset instead of a security.\n\nThe SEC believes that Bitcoin's PoW process is more similar to the physical process of mining precious metals, so it can be assigned a market-driven spot price like gold and silver. But it says the PoS process that Ethereum uses makes it more similar to a security, which is subject to tighter regulations than commodities.\n\nThe SEC doesn't seem eager to approve the first \"spot price\" Ether ETFs anytime soon, but ETF issuers -- including VanEck, Ark Invest, and seven other companies -- could file litigation against the agency to accelerate the process. The recent approvals of Bitcoin and Ether ETFs in Hong Kong could also force the SEC to stop dragging its feet.\n\n4. The growth of decentralized apps\n\nThe main thing that sets Ether apart from Bitcoin is its open-source network. Bitcoin's blockchain can only be used to mine the cryptocurrency, but developers can build decentralized apps, tokens, and other crypto assets on the Ethereum Network.\n\nAccording to Fortune Business Insights, the decentralized apps market could grow at a compound annual growth rate (CAGR) of 28% from 2023 to 2030 as more companies roll out decentralized investing, lending, and crypto services that aren't tethered to centralized financial institutions. That expansion could drive more companies and consumers to adopt Ether as a mainstream digital currency.\n\nInvestors should brace for lots of volatility\n\nEther, like Bitcoin, is a volatile asset that could easily lose half its value before it doubles again. Therefore, investors shouldn't use any cash they need over the next five to 10 years to buy Ether. That said, Ether could still generate massive long-term gains for investors who can stomach all the near-term volatility."
    }
]