[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFB6SUpaUmM5Rk85QkpoMWo0UThkR0NVWE9XMnBCUE53WVdRNVQ3TFBBUzFGbWZnWG9XZTRrNTZpdzB0TUg0X1VtUDI4cGg5NFdNNTVmQnFnZW1TbDVSbU9NWWZoTVRMd3lN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "SEC closes investigation into Ethereum 2.0, no securities charges against ETH: Consensys - Crypto Briefing",
        "content": "SEC's decision marks a turning point for Ethereum, likely confirming its commodity status.\n\nShare this article\n\nThe US Securities and Exchange Commission (SEC) has wrapped up its investigation into Ethereum 2.0 and will no longer pursue legal action claiming that ETH sales are securities transactions, according to a recent announcement from Consensys.\n\nConsensys said this is a major win for Ethereum developers and businesses. It removes a cloud of uncertainty that could have hampered Ethereum’s growth.\n\nIn March, an update on the Ethereum Foundation’s GitHub repository revealed that the organization was under investigation by an unnamed “state authority.” After the discovery, Fortune reported that the SEC pursued an “energetic legal campaign” to classify Ethereum as a security.\n\nUncertainty intensified after Consensys filed a lawsuit against the SEC in April. Part of the company’s effort was seeking a court ruling that would declare that Ethereum’s native token, Ether (ETH), is not a security.\n\nFOX Business reported in late April that the SEC’s Enforcement Division, headed by Gurbir Grewal, initiated a formal investigation into Ethereum’s status as a security in March 2023. The investigation, known as “Ethereum 2.0“, explores transactions and activities associated with Ethereum dating back to 2018.\n\nAs noted, the SEC’s latest decision comes after Consensys sent a letter to the SEC arguing that the recent approval of spot Ethereum ETFs implies ETH is not a security, and the SEC should close the investigation. The move likely hinged on considering ETH a commodity, much like BTC, and signifies no forthcoming legal challenges.\n\nDespite this progress, Consensys said the quest for definitive regulatory guidelines continues, especially concerning services like MetaMask Swaps and Staking. The team is still seeking broader clarity from the SEC on crypto regulations.\n\nOur fight continues. In our lawsuit, we also seek a declaration that offering the user interface software MetaMask Swaps and Staking does not violate the securities laws. It should not take a lawsuit to provide the much-needed regulatory clarity to allow an industry that serves… — Consensys (@Consensys) June 19, 2024"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNeV9Xa1pVWWNHek1LN0J3ZjFwc1NqdkFHZHJzZTF4T25QYTZMY1VjWUJ0ZUdSR3NxWEhubFcyT01FY2xyQ0pPdkdkMUlfT2JkTHl6dVlKc1VpUjhZVUJJT3VYUlBnVzhBLVFPU1pwR2t5Ymx0NWpsaGRucFJCUk13TldOaU5zellqVWZ4UDgtYVNSbHFaVld1cW1CQ2M4R0ZCb0hXT1E0OFFKcmd4Y2stMG9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Ethereum gets huge win as SEC closes investigation into securities sale allegations - CryptoSlate",
        "content": "The SEC has closed its investigation into Ethereum 2.0, determining that sales of ETH are not securities transactions. The decision comes after a letter from Consensys on June 7, seeking clarity following the May approvals of ETH ETFs, which were based on ETH being classified as a commodity. Consensys stated,\n\n“Today we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0. This means that the SEC will not bring charges alleging that sales of ETH are securities transactions.”\n\nEthereum rose over 4% overnight following the news, pulling the rest of the crypto market with it as many projects positive over the past 24 hours. Bitcoin is the notable exception, down 0.74% according to CryptoSlate data as of press time.\n\nConsensys announced this development as a significant victory for Ethereum developers and the broader industry. The closure of the investigation signifies a pivotal moment for the Ethereum community, providing a reprieve from potential regulatory actions that could have categorized ETH as a security. The SEC’s decision aligns with the Commodity Futures Trading Commission’s (CFTC) stance, which has consistently classified ETH as a commodity.\n\nDespite this positive outcome, Consensys continues its legal battle against the SEC to secure further regulatory clarity. The company argues that the SEC’s enforcement actions against blockchain developers and technology providers have been overly aggressive and unlawful. Consensys’s lawsuit also seeks a declaration that offering user interface software like MetaMask Swaps and Staking does not violate securities laws.\n\nAs Consensys emphasized, the legal fight is not just about Ethereum but about safeguarding the future of blockchain innovation in the United States. The SEC’s stance on Ethereum had posed a risk to adopting and developing blockchain technologies, with potential negative implications for US leadership in this sector. By challenging the SEC’s authority, Consensys aims to prevent what it describes as an unlawful power grab that could hinder technological advancements and economic opportunities.\n\nThe resolution of the Ethereum investigation marks a critical juncture, but Consensys insists that the broader regulatory environment still requires significant reform. The company’s lawsuit highlights the need for clear guidelines that support innovation while ensuring compliance with existing laws. As the blockchain industry evolves, resolving these regulatory issues will be crucial in determining the pace and direction of technological progress.\n\nAccording to Consensys, fighting for regulatory clarity is essential to ensuring blockchain technology continues growing and contributing to the economy. The company’s actions reflect a broader concern within the crypto community about the need for balanced regulation that fosters innovation without stifling growth.\n\nIndustry participants and regulators alike will closely watch the outcome of Consensys’s ongoing legal battle with the SEC. The case highlights the tensions between regulatory oversight and technological innovation, a dynamic that will shape the future of blockchain technology and its applications.\n\nMentioned in this article"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNQ1YxNldJTURIdFhuTnNoUlZsckZuYWtQNkhyRWdZZ3N4a2NMZ1hCYS1CWU1lakJVeE9Ia3p6cEw3bFhEQU9JaExkcl9TcTRBVkJoLW9ma2J2T29ocVprRm1sZ0ZpRDF1V19jZi1tTVgydG55Vk5uM1dtdVRvTW44enlkb01vVzBNb0NB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Investing Smart: Ethereum’s ETF Progress, Bitcoin’s Decline, and Furrever Token’s Rewards - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY , June 19, 2024 (GLOBE NEWSWIRE) --\n\nAs the cryptocurrency market evolves, investors are constantly seeking smart investment opportunities. The latest developments show Ethereum making significant strides with its ETF progress, while Bitcoin experiences a decline in dominance. Amid these changes, Furrever Token presents a unique and rewarding investment option.\n\nEthereum’s ETF Progress\n\nEthereum has been gaining traction with its exchange-traded funds (ETFs), surpassing Bitcoin in terms of performance and investor interest. The approval and launch of Ethereum ETFs have sparked optimism among investors, positioning ETH as a strong contender in the crypto market. This progress reflects the growing confidence in Ethereum’s long-term potential and its robust decentralized finance (DeFi) ecosystem.\n\nBitcoin’s Decline\n\nBitcoin, the pioneer of cryptocurrencies, has seen its dominance drop to 56%. This decline suggests that investors are diversifying their portfolios and exploring other promising assets. While Bitcoin remains a significant player, its reduced market share highlights the expanding landscape of digital assets and the potential for altcoins to gain prominence.\n\n\n\n\n\nFurrever Token: A Smart Investment Choice\n\nIn the midst of these market dynamics, Furrever Token (FURR) offers a unique and engaging investment opportunity. Designed around cute cat-themed imagery, Furrever Token aims to create a fun and community-driven ecosystem. Here’s why investing in Furrever Token during this period is a smart move:\n\nInnovative Referral System\n\nFurrever Token’s referral system allows users to earn 10% in FURR tokens for every deposit made through their personal referral links. This system incentivizes community growth and provides a source of passive income. By sharing referral links with friends, family, and social networks, users can actively contribute to the project’s expansion while reaping financial rewards.\n\nAttractive Tokenomics\n\nFurrever Token’s tokenomics are designed to ensure security and trust within the community. With a total supply of 9 billion tokens, 65% are allocated for the presale, 25% for decentralized exchanges (DEXs), and 10% for the team, locked for one year. The presale has already raised over $1.3 million, currently in its 9th stage, with the potential for up to 15X returns for early investors. The current price of Furrever Token is $0.000732, presenting an attractive entry point for those looking to invest in a project with both financial and emotional rewards.\n\nCommunity Engagement and Future Growth\n\nFurrever Token places a strong emphasis on community engagement. The project’s mission is to create a fun, user-friendly environment where investors can enjoy their experience while contributing to the growth of the ecosystem. Regular challenges, exclusive cat-themed content, and active community interaction make Furrever Token an appealing choice for both seasoned investors and newcomers.\n\nStory continues\n\nConclusion\n\nAs Ethereum’s ETF progress and Bitcoin’s decline reshape the cryptocurrency market, Furrever Token offers a refreshing and rewarding alternative. Its unique referral system, attractive tokenomics, and strong community focus make it a smart investment choice during this period of market transformation.\n\nInvesting in Furrever Token not only provides potential financial returns but also an enjoyable experience within a vibrant and supportive community. Don’t miss out on the chance to be part of this exciting project—visit furrevertoken.com to join the presale and create your referral link today.\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nVisit Furrever Token Presale\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNQ1YxNldJTURIdFhuTnNoUlZsckZuYWtQNkhyRWdZZ3N4a2NMZ1hCYS1CWU1lakJVeE9Ia3p6cEw3bFhEQU9JaExkcl9TcTRBVkJoLW9ma2J2T29ocVprRm1sZ0ZpRDF1V19jZi1tTVgydG55Vk5uM1dtdVRvTW44enlkb01vVzBNb0NB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Investing Smart: Ethereum’s ETF Progress, Bitcoin’s Decline, and Furrever Token’s Rewards - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY , June 19, 2024 (GLOBE NEWSWIRE) --\n\nAs the cryptocurrency market evolves, investors are constantly seeking smart investment opportunities. The latest developments show Ethereum making significant strides with its ETF progress, while Bitcoin experiences a decline in dominance. Amid these changes, Furrever Token presents a unique and rewarding investment option.\n\nEthereum’s ETF Progress\n\nEthereum has been gaining traction with its exchange-traded funds (ETFs), surpassing Bitcoin in terms of performance and investor interest. The approval and launch of Ethereum ETFs have sparked optimism among investors, positioning ETH as a strong contender in the crypto market. This progress reflects the growing confidence in Ethereum’s long-term potential and its robust decentralized finance (DeFi) ecosystem.\n\nBitcoin’s Decline\n\nBitcoin, the pioneer of cryptocurrencies, has seen its dominance drop to 56%. This decline suggests that investors are diversifying their portfolios and exploring other promising assets. While Bitcoin remains a significant player, its reduced market share highlights the expanding landscape of digital assets and the potential for altcoins to gain prominence.\n\n\n\n\n\nFurrever Token: A Smart Investment Choice\n\nIn the midst of these market dynamics, Furrever Token (FURR) offers a unique and engaging investment opportunity. Designed around cute cat-themed imagery, Furrever Token aims to create a fun and community-driven ecosystem. Here’s why investing in Furrever Token during this period is a smart move:\n\nInnovative Referral System\n\nFurrever Token’s referral system allows users to earn 10% in FURR tokens for every deposit made through their personal referral links. This system incentivizes community growth and provides a source of passive income. By sharing referral links with friends, family, and social networks, users can actively contribute to the project’s expansion while reaping financial rewards.\n\nAttractive Tokenomics\n\nFurrever Token’s tokenomics are designed to ensure security and trust within the community. With a total supply of 9 billion tokens, 65% are allocated for the presale, 25% for decentralized exchanges (DEXs), and 10% for the team, locked for one year. The presale has already raised over $1.3 million, currently in its 9th stage, with the potential for up to 15X returns for early investors. The current price of Furrever Token is $0.000732, presenting an attractive entry point for those looking to invest in a project with both financial and emotional rewards.\n\nCommunity Engagement and Future Growth\n\nFurrever Token places a strong emphasis on community engagement. The project’s mission is to create a fun, user-friendly environment where investors can enjoy their experience while contributing to the growth of the ecosystem. Regular challenges, exclusive cat-themed content, and active community interaction make Furrever Token an appealing choice for both seasoned investors and newcomers.\n\nStory continues\n\nConclusion\n\nAs Ethereum’s ETF progress and Bitcoin’s decline reshape the cryptocurrency market, Furrever Token offers a refreshing and rewarding alternative. Its unique referral system, attractive tokenomics, and strong community focus make it a smart investment choice during this period of market transformation.\n\nInvesting in Furrever Token not only provides potential financial returns but also an enjoyable experience within a vibrant and supportive community. Don’t miss out on the chance to be part of this exciting project—visit furrevertoken.com to join the presale and create your referral link today.\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nVisit Furrever Token Presale\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQQnBEaUxOR180djVyc1ZkVWNtREY5U1JlWlVuazRMTEZzcVhmcmxpN2FZNzdSbGg4U3djSjZMWG9uVi1JczdJZ1NtVThpZ2lWeU1KcHVQa19LcUpVTzhpOUZYSjNYLV9INjJYVS1iTmZqX2ZlRzloNnJCS3NWU0xXTEtEb9IBiwFBVV95cUxQelROeXFVUlpHN2ZCX245RFhnNEVvSmsxOXk4UmMtamhpd08wc3FEYndfSkNBcGVQUDMzcF9hVXlJSnN2a3FVeTRZX1ViWkJ4ZEd3V0c1M3BuaXBRQkVCRlB4SnJ6dHFJMk0xY3RVa0RDUVVIYVZUdmhURkFseDNweWQ2Vm0wc0ZSX2Rr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Are Solana and Polygon Safe Now That SEC’s Ethereum Investigation Is Over? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIf the SEC is no longer investigating Ethereum, does that mean other similar cryptocurrencies are off the hook?\n\nThe U.S. Securities and Exchange Commission on Tuesday informed Ethereum software company Consensys that it has dropped its investigation into “Ethereum 2.0,” referring to the blockchain network’s transition to proof of stake nearly two years ago.\n\nThis combined with the SEC’s approval of Ethereum ETFs for trading in the U.S. has been widely perceived as an admission by the Commission that Ethereum is not a security, which in turn could mean that other proof-of-stake coins like Solana and Polygon are also not securities. But legal experts who spoke with Decrypt have warned against thinking in such black and white terms.\n\n“I expect that the letter has little to no impact on the legal classification of other [proof-of-stake] coins,” Drew Hinkes, an attorney who specializes in digital assets, told Decrypt. “Those other tokens were presumably not investigated in the investigation of Ethereum 2.0 and their facts as to creation, distribution, etc. are likely different from those of Ethereum.”\n\nAD\n\nAD\n\nConsensys sued the SEC earlier this year in a preemptive move after receiving a Wells Notice, which typically indicates the regulator intends to bring an enforcement action. (Disclosure: Consensys is one of 22 investors in Decrypt.) In its lawsuit, Consensys revealed the SEC has been operating under the assumption that Ethereum is an unregistered security for at least a year, partially because of the network’s switch to proof of stake.\n\nProof of stake refers to a system in which cryptocurrency network users pledge their assets—in this case ETH—in order to participate in validating transactions and securing the network. Users who stake are then rewarded in ETH for their trouble, with yields ranging from 1% to 4% APY, depending on the staking platform.\n\nEthereum, which once operated much more like the energy-intensive Bitcoin blockchain, completed its transition to proof of stake in September 2022 after a years-long process. At the time, questions immediately arose as to whether staking could implicate federal securities laws in the United States. SEC Chair Gary Gensler said he believed staking could run afoul of the law because “the investing public is anticipating profits based on the efforts of others,” according to the Wall Street Journal.\n\nThe SEC has now apparently changed its view. But even if the Commission is no longer investigating Ethereum, it could proceed differently with other tokens, says Hinkes, according to the manner in which those specific assets were initially sold. The SEC may also consider factors like the state of the technology, the mechanics of its block validation, and more, according to the attorney.\n\nAD\n\nAD\n\nMatt Corva, a lawyer for Consensys, seemingly concurs, posting yesterday on Twitter: “We don't know [if Polygon, Solana, or other coins are securities] because the SEC has evaded showing their homework on precisely why they've now concluded that Bitcoin and Ethereum are not securities,” he tweeted. “We don't know the specifics of import for other coins.”\n\nNot all companies can spend millions of dollars and thousands of hours dealing with an unlawful investigation - and they shouldn't need to. We know Bitcoin is not a security and we know Ethereum is not a security. What about Polygon, or Solana, or any other coin? — Matt Corva (@MattCorva) June 19, 2024\n\nOther legal experts are similarly befuddled by the SEC’s opaqueness.\n\n“The SEC was very careful in the language it used in its letter,” crypto criminal defense lawyer Carlo D'Angelo told Decrypt. “Without a more specific statement from the SEC, or a definitive ruling from a court, it remains unclear how the agency views ETH and other [proof of stake networks].”\n\nWhile the end of the Ethereum investigation might not be a carte blanche for proof-of-stake coins, one expert believes it’s a good building block.\n\nSebastian Heine, head of risk and compliance at institutional staking company Northstake, claims it does “strengthen” some cases, but every coin is “too individual” to make sweeping statements. “The SEC is still very crypto negative so there shouldn’t be any high expectations from the SEC acting favorably towards other proof-of-stake coins,” he said."
    }
]