[
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNSkxUdnpBU01IY2lobERjN2VhV1l5dWY1UmJsSkh4Q2ZVem1ySmN3QktvVndlZzlsUmV0U2k4aEFNMmZaWUxtMnZ2UnpTUUg3cWctVUhZenlubEhNNjUtNldMelY1bkxyTXBuMmR2cVp5RVhnMkNpSVpVcEQ3eVVsYzJXcmRkcm8tNlRXWXVYdWhuYUN6ajd4R1FB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin vs Ethereum: A Battle of Titans for Blockchain Revenues - Cointribune EN",
        "content": "Thu 04 Jul 2024 ▪ 3 min read ▪ by Fenelon L.\n\nThe race for revenue in the crypto universe is intensifying, with Ethereum taking a considerable lead over its historical rival, Bitcoin. Ether generated $2.728 billion, while BTC followed with $1.302 billion, illustrating a new dynamic in the blockchain ecosystem.\n\nEthereum dominates the Blockchain revenue landscape\n\nThe Ethereum blockchain has established itself as the undisputed leader in terms of fee revenue, surpassing Bitcoin. Its exceptional performance of $2.728 billion over the past year illustrates its dominance in the Decentralized Applications (dApps) and smart contracts ecosystem.\n\nThe first quarter of 2024 proved to be particularly lucrative for Ethereum, with its revenue reaching $365 million, marking a remarkable year-on-year growth of 155%. This spectacular rise is mainly due to the boom in innovative sectors such as decentralized finance (DeFi) and non-fungible tokens (NFTs).\n\nEthereum’s transaction fee revenue reached a record high of $1.17 billion in the first quarter, marking an 80% increase over the previous quarter.\n\nBitcoin: A giant that remains in the race\n\nAlthough surpassed by Ethereum in terms of revenue, Bitcoin maintains its position of strength with $1.302 billion generated through transaction fees.\n\nThe introduction of Bitcoin Ordinals has played a crucial role in this performance, leading to a notable increase in transaction fees. Furthermore, the Runes technology has contributed significantly, accounting for up to 68% of Bitcoin transactions since the last Halving.\n\nDespite its primary function as a store of value and medium of exchange, Bitcoin proves its ability to generate substantial revenue. This resilience testifies to its growing adoption and persistent importance in the crypto landscape, beyond its status as a benchmark digital asset.\n\nIn sum, the future looks promising for these two leading cryptos. With the imminent launch of Ethereum ETFs and the continued growth of the Bitcoin ecosystem, analysts foresee significant capital inflows in the coming months.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPeGZONFlMNjVoQzllZHAzTkUtbHU3TTNLdmJBTUZzbXZGQ0hKSzFvN2t3SWZtcktXM2lUVmF6VmJZc2RFRjZobV8yOV92dk5tQlotTk12ZUVoemcwcWN4N2JKbHhsQVFjaDlsdVBBcjdPT2VXREFxVXU3YkRkZnFrQlZTU1hIa2N4THRjSGZMTHpsQ21Rc2swUXRsZVFQdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Crypto Heist in GTA 6? Bitcoin, Ethereum Rumors Swirls Again - Crypto Times",
        "content": "Rumors that the highly anticipated Grand Theft Auto 6 will utilize cryptocurrency have been circulating for more than a year now—and they’re swirling again. Recent claims by a popular Crypto Twitter influencer have reignited speculation, but as of now, there is no official confirmation.\n\nThe Source of the Rumors\n\nOn Wednesday, a pseudonymous Crypto Twitter influencer called Gordon—apparently named after Gordon Gekko from the iconic 1987 film “Wall Street”—shared with his nearly 500,000 followers that “GTA 6 will enable cryptocurrency payments,” and that “so far only Bitcoin, Ethereum, and USDT are confirmed.” This tweet quickly went viral, garnering over 500,000 views in just a few hours.\n\n🚨GTA 6 will enable crypto currency payments.\n\n\n\nSo far only Bitcoin, Ethereum and USDT confirmed 😳 pic.twitter.com/MoYQoppH5z — Gordon (@AltcoinGordon) July 3, 2024\n\nThe tweet by Gordon also included a fake trailer for GTA 6, which contributed to its virality. When asked for sources, Gordon humorously replied that his “uncle works there,” or dismissed previous reports as outdated. This playful attitude did little to quell the excitement and speculation among fans and crypto enthusiasts.\n\nDespite the buzz generated by Gordon’s tweet, there has been no official announcement from Rockstar Games or its parent company, Take-Two Interactive, regarding the inclusion of cryptocurrencies in Grand Theft Auto 6. Official trailers and announcements have made no mention of any crypto elements, and Rockstar Games has not responded to inquiries on the matter.\n\nPrevious Rumors and Speculation\n\nThis is not the first time rumors about cryptocurrencies in GTA 6 have surfaced. Earlier speculation in May 2023 suggested similar possibilities, and the game’s first official trailer, which leaked last December, featured a “BUY BTC” stamp—though this was likely added by the leaker. Despite these hints, there has been no substantial evidence to confirm these rumors.\n\nPotential Impact of Cryptocurrency in GTA 6\n\nThe idea of integrating cryptocurrencies like Bitcoin and Ethereum into GTA 6 is tantalizing for many. If such features were implemented, it could represent a significant step forward in the mainstream adoption of cryptocurrency within the gaming industry. This potential has fueled much of the ongoing speculation and interest.\n\nWhile the rumors about Bitcoin and Ethereum in Grand Theft Auto 6 continue to swirl, they remain unconfirmed at this time. For now, fans will have to wait for official news from Rockstar Games and hold on to their excitement as the game’s 2025 release date approaches."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQSVFKaVhEMk50YlNDaktOd0RnY0o4M29TT2x1QjFrazVtSkRUOVRRV3prWFlmNENYeDNmTm5xMExkVzREOFNnSGoycFNhbzdFZzNCWXlpY0paMkdmVXF2V25TTzMyN0xCT3U4OU5aVXd5ZUhoaUo0Sy1oWk9Wd0t6alowM2FNODg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Crypto - Ethereum ETF: Launch Imminent on July 15th? - Cointribune EN",
        "content": "Thu 04 Jul 2024 ▪ 3 min read ▪ by Eddy S.\n\nIn the dynamic landscape of crypto, a new advancement is about to materialize with the imminent launch of an Ethereum ETF. According to the latest updates, Bitwise has filed an amended version of its S-1 form with the SEC! Signaling a decisive step towards the introduction of a spot Ethereum ETF as early as this July.\n\nIs the Ethereum ETF arriving this July 15?\n\nThe ETF, which allows investors to access Ethereum without directly holding the crypto, is eagerly awaited by the financial community. Analysts predict that SEC approval could come as early as mid-July, with a potential target date set for July 15. This anticipation is based on the recent update of Bitwise’s S-1 form, which includes a fee waiver for the first six months up to a cap of 500 million dollars.\n\nNo one really knows why the SEC is taking their sweet time with these, given how light comments were, these could have easily been trading by now. Could be one 'problem' issuer slowing down process or just summertime lazy/ppl on vaca. Not sure. That said, all indications launch… — Eric Balchunas (@EricBalchunas) July 3, 2024\n\nThe SEC, which already gave the green light to spot Bitcoin ETFs earlier this year, appears ready to extend this approval to Ethereum. This represents a significant evolution for crypto, as Ethereum is often considered to have higher growth potential due to its extensive applications in decentralized finance (DeFi) and smart contracts.\n\nA launch eagerly awaited by the crypto community\n\nThe launch of the Ethereum ETF by Bitwise could mark a turning point for crypto investment. It will offer a new regulated and simplified path for institutional and individual investors. This could also signal increased recognition of the value and legitimacy of digital assets in the traditional financial system.\n\nAs the probable launch date approaches, the industry is closely monitoring the developments. If everything goes as planned, Bitwise’s Ethereum ETF could very well be the catalyst for a new era of crypto investment, accessible to a broader audience and integrated into the global financial framework.\n\nThe launch of the Ethereum ETF by Bitwise is a highly anticipated event that could transform the crypto investment landscape. With the SEC poised to give its approval, the financial world is on high alert, ready to welcome this new era of financial innovation.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOREh5M0wwVll4U095X1laWlJKeGM2RVdwSUdFSVR5LXI1anZicnVjZWstRk9vVVNLU29nTUdEZ0kzb1ZkZ0V0enRmUFZaUTc1a1d2VHAzb1JNd3pPTVVPYjBEYWxMb2VQUHBnVHZQSUFXbjhscHlkNUtpNWJEOUhzZm1OUkFYT2VmNUhBY0cyczRoSXMycXh6REZrV1Myb05VQ3BBR0pMeGVOQdIBrwFBVV95cUxPV0h0TmViWW1JZWJ1MXFnVVBNcnRTNE5Qb1ZGcHlEYVhxZ1hpal91T2tiMTdjaGlpUkNTTlF3WW45SURhbW1qYkNnS0xfRVNYQmNodXVsaTJnT09VVGdMQ1NWM1dwRHpHS0lvOUNyN25zUm1XeEgxVjJjZmtHcTlsMDBzd1RMTnFydGdBTkZvRVFOcXV3ektyeHdtZHZ1WWpVd1lYakNsX2N3VjJaLW13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Predictions: ‘Buy the Dip’ Opportunity or Further Pain for Bulls? - CryptoPotato",
        "content": "TL;DR\n\nEthereum (ETH) has faced significant declines, currently around $3,200, but some analysts remain bullish, predicting potential rebounds and an all-time high of $8,000.\n\nThe upcoming launch of spot Ethereum ETFs, expected to attract $3-$5 billion in net inflows, could boost investor confidence and drive ETH’s price higher, similar to the impact seen with spot BTC ETFs earlier this year.\n\nWhat’s Next for ETH?\n\nEthereum (ETH), similar to many other leading cryptocurrencies, has been severely affected by the latest market correction. Its price currently hovers at around $3,200 (per CoinGecko’s data), representing a 5% daily decline and 15% on a monthly scale.\n\nAccording to some industry participants, though, the negative trend may soon be replaced by a fresh uptick. The X user Poseidon claimed the “future is bright,” and ETH is poised for an all-time high of $8,000.\n\nCaptain Faibik was also bullish, forecasting that the price of the second-largest cryptocurrency “will bounce back hard,” meaning it currently offers a great “buy the dip” opportunity.\n\nOn the other hand, there are some worrying signs that Ethereum’s freefall may continue in the coming days. The popular crypto analyst, using the X handle Crypto Tony, claimed that everything would be under control as long as ETH’s valuation remains above $3,270. The asset lost that resistance level a few hours ago.\n\nWaiting for the ETF Launch\n\nOne important factor that could place ETH back into green territory is the launch of spot Ethereum ETFs (expected this month). Recall that the US Securities and Exchange Commission (SEC) approved multiple such products earlier this year, but they are not yet live.\n\nAccording to crypto exchange Gemini, the official introduction of spot ETH ETFs in America could attract net inflows in the range of $3-$5 billion within the first six months of trading. The move might improve the asset’s market position, moving it closer to the leader Bitcoin (BTC), the analysis reads.\n\nSpot ETFs will make it easier for traditional investors to gain exposure to Ethereum without needing to hold the cryptocurrency directly. This removes some hurdles, such as self-custody, for example.\n\nThe launch of those products could also be seen as a positive signal for the legitimacy and acceptance of ETH and the broader cryptocurrency market. As a result, investor confidence could be significantly boosted, leading to a potential fresh flow of capital and a subsequent price rally.\n\nRecall that the US SEC greenlighted spot BTC ETFs in January this year. The price of the primary digital asset hit an all-time high of over $73,500 approximately two months after that."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQVmI1TEhWVkR4NDNacnZSRUJKbE16UDVJVDBaNlFBS3UydjlIWVN0dTJhZnZpZzJDQ3l6dTZpd1pZWGhGdFBBZGxWY0p4S2NWQTl3OEdfcmNFY2NYa01CZmMtaGw4SWJkWXhNZWtqRUo0MlFtNXNKUmg5clR6QmxjbVFLWWFkMW1LX0ZJdEF6ZzREaW1iVDBvb0Zad0E3eFVMZm16YjMtZkF3T05pMmthM0ItTzVGMzYtUGdvVGV2TnZiYknSAcgBQVVfeXFMUF9fb0pUWDRsNG40SUtIclJoS3RsRFVOX2s1Vzg0eEJwSW9MM21rcUxXTDV0THBTbUtNUEIyQjl6OFltb1dwRkNTSWFRRjROQkhqLXFmWm9aeEZrV3lvQ3hiYlA5Z3RVbFBZVXJSQk1EVnpLZmloSnQyUC1BZTZBTG5uOW1iaFlKQkcwdWZHUnpfM0hWWGtMSG5UTFoxb1BETXhCbnlBNnR1RTBkckZ2Ql95U1ZHOUM1T205R0pTVl8xS0RoN3JzQzU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum poised to follow Nvidia's steps as Bitwise files updated S-1 draft - FXStreet",
        "content": "Ethereum ETFs expected to begin trading in July after Bitwise files amended S-1 ahead of due date.\n\nEthereum ETFs could flip analysts' expectations if investors buy into ETH's Nvidia-like high-growth tech play narrative.\n\nEthereum derivatives data reveals investors are becoming more risk averse following Mt. Gox headwind on horizon.\n\nEthereum (ETH) is down 3% on Wednesday following Bitwise filing an updated S-1 draft and a wider market downturn with potential Mt. Gox BTC supply flooding the market. Despite the general market lull, investors may gain consolation from Bitwise prediction that Ethereum ETFs could outperform analysts' expectations if positioned as a high-growth tech play similar to Nvidia.\n\nDaily digest market movers: Could Ethereum be the next Nvidia?\n\nAsset manager Bitwise filed its amended S-1 registration statement with the Securities and Exchange Commission (SEC) today ahead of its July 8 due date. The new filing added a fee waiver for up to $500 million in assets under management, similar to Van Eck's waiver last week.\n\nConsidering the comments on these drafts were light, Bloomberg analyst Eric Balchunas said spot ETH ETFs should have begun trading and expects them to launch before the end of July.\n\nThe SEC approved spot ETH ETF issuers' 19b-4 filings in May but also needs to greenlight their S-1 registration statements before the products can begin trading.\n\nAccording to Bitwise CIO Matt Hougan, Ethereum ETFs could be more successful than earlier predicted if investors buy into the narrative that Ethereum is a high-growth tech play similar to Meta and Nvidia. Hougan had earlier predicted that spot ETH ETFs could attract up to $15 billion in net flows before the end of 2025.\n\n\"It's pretty easy for me to imagine investors selling a small amount of their tech exposure and adding ETH. I'd argue it's easier than imagining investors carving out an entirely separate portfolio sleeve for a new monetary asset,\" Hougan noted.\n\nHowever, people need to buy into the idea that \"Ethereum is a technology investment\" for this to happen. Hougan noted that a clear understanding of how Ethereum differs from Bitcoin and the growth of applications on its network would help strengthen the “high-growth tech play” narrative.\n\n\"What might that look like? Imagine stablecoins going from $160 billion to $1.6 trillion in assets as more people embrace the speed and transparency of blockchain-enabled payments. Or consider decentralized finance applications opening up new avenues for lending and borrowing with the onset of regulatory clarity. Or imagine more firms following BlackRock's lead and building tokenized funds on the Ethereum platform,\" said Hougan.\n\nMeanwhile, Lookonchain revealed in a recent analysis that Ethereum ranks number one among blockchain networks in terms of yearly revenue. Ethereum's revenue is at $2.728 billion per year, with Bitcoin coming behind at $1.302 billion. Increased revenue often indicates high user activity in a blockchain network, which helps estimate bullish sentiment.\n\nETH technical analysis: Ethereum traders are skeptical with Mt. Gox headwind in sight\n\nEthereum is trading around $3,307, down about 3% in the past 24 hours. ETH breached the $3,367 support level, pouring cold water on hopes of a potential rebound. ETH liquidations reached $44.33 million, equalling that of BTC in the past 24 hours despite having a lower market cap. Long liquidations accounted for 87% of ETH's total liquidations, with shorts at 13%.\n\nEthereum options open interest has declined by 57% since its spike following the SEC's approval of 19b-4 filings of spot ETH ETF issuers. As of May 24, ETH options OI was at $13.44 billion. However, following the expiry of May and June options, most investors have failed to open new positions as indicated in the chart below.\n\nETH options OI\n\nETH options OI is now at $5.69 billion, its lowest level since September. The decreasing options OI accompanied by ETH's price decline suggests option traders are more risk-averse. Two possible reasons for the uncertainty among traders include:\n\nSEC's delay in greenlighting prospective spot ETH ETF issuers’ S-1 drafts.\n\nPrevailing wider market bearish sentiment from Mt. Gox BTC supply.\n\nThe ETH Long/Short ratio also provides insights into traders' sentiment in the past week. The ratio's 7-day average is at 0.946, indicating the futures market is tilted toward the downside.\n\nAs a result, ETH may sustain a horizontal movement in the coming weeks until the SEC approves issuers' S-1 drafts for spot ETH ETFs to begin trading.\n\nETH/USDT 4-hour chart\n\nA breach of the $3,203 support could strengthen bearish sentiment and send ETH back to the $2,850 to $3,029 range."
    }
]