[
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNTjByQnZtTzRiaE1sNGF4c2Z2clI3cmp2bHpxV0oxc0VJVkd3Tmlub1JFVHF3Z0plNkVuOUl2bV85dWtxTGJSMnNnMTVTS0NNeU1EX3pYVFd6Rlp3ZmhMbXhkUkpBYnlvX2dteXpPUWdYN0FqVXVsT05oTXluY3gzWnpHSWxzbV9WX1dzNTVjMHFpWVpF0gGcAUFVX3lxTE96NWFWTWdRamZDaVFETjZYcW9WcDhpMnFzU2k3V0NNWHVhS2ltNXlaM2MzUS1hb1VuSTNROG44QWE1TS14ODNuS1JNREh4aTdNcndJSklLUHJXYWkyNGpwdzdPb3E5UXhvLVQxTkkycWpsdWYtcU1NaVEwTUtwZzR3ck0zUVhKbU1aZ0RKd1pLdmZwVFNSTXJVMC1kbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Tank as Crypto Liquidations Top $150 Million - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe prices of Bitcoin and Ethereum both plunged Friday morning, prompting a fresh wave of long position liquidations that pushed total crypto liquidations above $150 million over the past 24 hours, per CoinGlass.\n\nBitcoin dropped by more than $2,000 in an hour, falling from a price above $63,000 to a daily low of $60,890, according to CoinGecko. It has since rebounded slightly to $61,130 as of this writing, and is down more than 1% on the day.\n\nMeanwhile, Ethereum is down by 2% over the last day, falling from $3,027 to a low of $2,927 alongside Bitcoin's plunge. It's up slightly since to $2,940, but still is down lower than it's been since May 1.\n\nIt's not immediately clear what prompted the price drops for the leading cryptocurrencies. Many other top coins have similarly lost ground this morning, including Solana, which fell back below the $150 mark after reclaiming that price earlier Friday.\n\nAD\n\nAD\n\nMore than $62 million worth of long positions were liquidated over the last hour alone. Over the last day, the total of long and short liquidations was just over $150 million across all major cryptocurrencies. Long positions are bets that the price of the coin in question will increase, while short positions bet against gains.\n\nEditor's note: This story was updated after publication with additional detail.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE83QjhuZGJyTUlSeEZvSjYxTVFRdm9Ybm51dnZwOHNrc0hPVGJPbkx6YzZkVy1ueE8tdDlJVXYxWEdMLU5TWmE2OXBMQU5DMGF1bFg2NjJEWnZkcWlaRDNxU0tsRlNPSmstMlZETXBn0gFzQVVfeXFMT3ZMNExFbWpXakdEVUlWck1GY3g2ZnBxWnpXQkl6LXBOZEhRYUVZdnZuUE1IQkVMclVTZEM0LW9qYWJud0Zua09ZTk9IeTVKcDlMWWwyMHRNMVVzeXhlRVhlVDlyLU9BZEh2VTg4a1BsUHFlYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "This Bull Run Might Skip Ethereum (ETH): Opinion - U.Today",
        "content": "Advertisement\n\nIn an acerbic X post, Ethereum (ETH) veteran, prominent investor, podcaster and crypto educator Ryan Sean Adams describes two alternative midterm forecasts for Ether (ETH) as a crypto coin.\n\nBearish: Inevitable puberty of Ethereum (ETH)\n\nIn a 2024-2025 potential rally, Ethereum (ETH) might be overlooked by investors as it is going through the \"awkward\" phase of \"puberty.\" It looks too slow and expensive compared to its own second-layer solutions of various types, Adams admits.\n\nWhile L2s are necessary for the scaling of such a blockchain and reflect the founder's vision of its progress, it has nothing to do with the interests of its most obvious investors.\n\nAdvertisement\n\nMeme coin champions and dApps users (including retroactive airdrop farmers) are too focused on alternative L2/L3 blockchains, while institutional \"big money\" is on its way to Bitcoin (BTC).\n\nThe approval of Spot Ether ETFs in the U.S. might change the status quo but, as U.Today previously reported, analysts are skeptical of the possibility of this step in the coming months.\n\nAs such, Ethereum (ETH) is getting through the challenges of its \"puberty\" while \"toddler chains\" are looking for shortcuts and, therefore, might look more attractive in the midterm.\n\nBullish: Rock solid monetary economics for \"chain of 1000 chains\"\n\nAt the same time, the arguments of Ethereum (ETH) optimists also look strong as of Q2, 2024. Ethereum (ETH) meets this cycle stronger than in 2020 with viable overhyped L2s and zkEVMs driving innovations and attracting value.\n\nWith its \"rock solid monetary economics\" cemented by ERC 4337 implementation, it remains the only profitable blockchain, and its competitors are not even close to this status.\n\nAlso, despite the growing audience of alternative blockchains, Ethereum (ETH) mainnet remains the root chain for 1,000 blockchains, Adams says.\n\nThese two theses are just \"two perspectives for ETH bulls,\" the author concludes.\n\nEther (ETH) is changing hands at $2,925, being 3% down in the last 24 hours."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPOTQ0MWdZUEM5a0I3NGZ5SDFnWV90MlM4TlpyVm5hX2YwVGNfRndXS0wwUHpPV1BzRGxrSWxrbS13R1c5aFZqNm1rRU03OTBobkdsektiNmlVd1c3aS10MkNYSVA5RTdvUGRBU2RqdS1pTUhYYkhlRTV4SVFWSktUWDZ0Z3pETzZrVFp2T3R0ZktsYkpSWHNDMzBB0gGfAUFVX3lxTE1jekRXY0VkRENPZnZLbEY1enVqZGU2dGhYRGg1dTI2UHFCdF9ibjNtSXJGRUZjUi1MU0ZkcWxpeDhpbVdaMW5wRDN6RVRFVENVNjBaQmc1NTltV25aZHMtUEJ5WWJYaXNFbTMxZ3V2Z09YWXZHYUh6c0o1aTVOdmcyMnN4NjA4cFF1dVp3RndIZmYwdmFLV2pWUFlNUDEzNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "This is Why Ethereum is No Longer a Deflationary Network: CryptoQuant - CryptoPotato",
        "content": "Over the years, analysts and developers have touted Ethereum as a deflationary network, presenting the blockchain as ultrasound, aligning with Bitcoin’s sound money principle. However, that seems to have changed with the network’s latest upgrade.\n\nCryptoQuant analysts revealed in the firm’s latest weekly report that Ethereum ceased to be a deflationary network after the Dencun upgrade, implemented in March, which reduced the blockchain’s transaction fees by a substantial amount.\n\nThe Ultrasound Money Narrative\n\nEthereum’s ultrasound money narrative refers to the network as a system that maintains its purchasing power over time and stays resistant to inflation. Compared to Bitcoin, the term suggests that Ethereum has the potential to remain more sound by not just preserving purchasing power but reducing the supply of the network’s token, ether (ETH), over time.\n\nIn the nine years of its existence, Ethereum has implemented several upgrades to sustain the decrease in its inflationary rate or the issuance of new ETH.\n\nThe London upgrade, implemented in August 2021, introduced a mechanism that burned a portion of Ethereum’s gas fees, removing ETH from circulation with every transaction. The upgrade exerted deflationary pressure on ETH supply, making it more valuable and scarce over time.\n\nIn September 2022, developers implemented the Merge, transitioning Ethereum from a proof-of-work to a proof-of-stake network. The blockchain stopped issuing new ETH as block rewards to miners, drastically reducing the issuance and inflation rate of the crypto asset.\n\nThese two upgrades had deflationary effects on Ethereum until Dencun came along.\n\nEthereum is No Longer Deflationary\n\nDencun reduced transaction fees on Ethereum layer-2 chains and introduced danksharding, which allows the storage of additional data in blobs, making the network more efficient and less expensive.\n\nBefore the Dencun upgrade, the amount of fees burned on Ethereum was positively correlated with higher network activity; ETH supply was reduced faster, and more fees were burned due to higher network activity. However, the reduction of network fees has slashed the amount of ETH burned despite high activity.\n\nThe new supply of ETH has become positive again, increasing to its highest daily rate since the Merge, while the amount of fees burned has plummeted significantly. Hence, Ethereum is no longer deflationary.\n\n“We conclude that, at the current rate of network activity, Ethereum will not be deflationary again, the narrative of ‘Ultra sound’ money has probably died or would need much more higher network activity to come back to life,” CryptoQuant stated."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPbGVyU19sTWV0X0hMUGhHZkY0Unc0bUhVNDBtZnFMWWpkRHdkamtZdXRWSExZb0hZLWdKUUh2LWxia05jYWRwdm5tUHVGTWtVTVZfckF1emdZRWFJMDQyT0pFSjZKSFdNWGZzc2lEcTgwb05kQUtxUmJUTC1QSU9vaTIwTUFyUEx2Sl9OYWxrYUJZVW9feHBCYkE1QmNmMzdaT2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Franklin Templeton expects this network to ‘remain a leader’ on Ethereum - DLNews",
        "content": "Franklin Templeton expects Base to capture a large share of the Ethereum layer 2 market.\n\nBase is a major draw for memecoins and SocialFi projects.\n\nUSDC is the major stablecoin on Base.\n\nOnly Arbitrum at $2.6 billion has a great amount of deposits than Base’s $1.6 billion among all Ethereum layer 2 networks, DefiLlama data shows, and in a note published Thursday, Franklin Templeton said it expects Base to “remain a leader.”\n\nBase is an Ethereum layer 2 blockchain that was started by crypto exchange Coinbase.\n\nFranklin Templeton, a $1.5 trillion asset manager, pointed to “strong support” from Coinbase as a major positive for Base.\n\nBase’s recent growth has been propelled by memecoin trading and interest in so-called SocialFi projects, Franklin Templeton said.\n\n“In recent months, Base has seen a significant rise in activity, primarily driven by Base meme coins trading activity and SocialFi applications such as friend.tech,” the firm’s note stated.\n\nBase’s buzzing activity levels have prompted an increase in transaction fees for Sequencer ― the part of Base’s network responsible for organising, verifying, and transferring transaction bundles to the Ethereum network.\n\nLike other Ethereum layer 2 networks, Base hasn’t “decentralised” its Sequencer yet. All of its revenue now goes to Coinbase, the entity responsible for running the Sequencer.\n\nThe bulk of the spike in activity on Base came in March when memecoin trading reached a fever pitch. Some popular tokens included TOSHI and BRETT, with BRETT reaching a peak of $800 million in market value.\n\nJoin the community to get our latest stories and updates\n\nThe memecoin trading came in the aftermath of Ethereum’s Dencun upgrade that lowered transaction fees on layer 2 networks by as much as 98%.\n\nFranklin Templeton’s report also said that “Base has hit a home run” in the SocialFi niche.\n\n“Currently, Base has [about] 46% for all transactions related to SocialFi,” the report said. “This category is a key vertical for Base adoption and growth.”\n\nBefore memecoins exploded on Base this year, friend.tech, a popular SocialFi project, was the major draw in 2023 for activity on the network.\n\nBase’s growing user adoption has also meant a big increase in stablecoin volume on the network. The market cap for stablecoins on Base has reached $2.8 billion, according to DefiLlama.\n\nCircle’s USDC stablecoin accounts for the bulk of the volume. That’s not common in DeFi where Tether’s USDT is the dominant stablecoin on most blockchains.\n\nCoinbase’s support for free USDC transfers to the Base chain via the exchange’s wallet since December 2023 is a likely reason for the stablecoin’s popularity on the network.\n\nCrypto market movers\n\nBitcoin is down 2.31% in the last 24 hours\n\nEthereum has fallen below $3,000 again, down 3.1% today.\n\nWhat we’re reading\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOVXE0WlhDMWI0Nmk4M0xVSTZFcVlleUN4c3dBRFFJNzZ3VUI1SGJUc0NpY1A2cVVlNl9MRHFxVUFhOVk0ZjJCVk50a19ZNWxxVHVXQk82aV9ZWk1qOVJsbGdkN2F4N3RYUk41ODg0VXcyUzQzTGt4MW5EZUdIcXFtSFAyUGRiUFNhWUJyTU1ZOWswT09j?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Why the US election will decide the fate of Ethereum ETFs - DLNews",
        "content": "Ethereum spot ETFs will likely be denied on May 23.\n\nProspective issuers probably won’t sue the SEC — even though the strategy worked to get Bitcoin ETFs out.\n\nThe US election may hold the key to an approval.\n\nThe Securities and Exchange Commission will probably deny applications for Ethereum spot exchange-traded funds on May 23.\n\nThe lack of meaningful interaction with prospective issuers, coupled with Ethereum’s ambiguous regulatory status, have made analysts pessimistic about the chances.\n\nNot to mention the SEC’s recent investigation into the Ethereum Foundation.\n\nThat means spot Ethereum ETFs probably won’t see the light until the end of 2025, Bloomberg Intelligence ETF analyst Eric Balchunas told DL News.\n\nFaced with a rejection, prospective ETF issuers — like BlackRock, Fidelity, or Ark Invest — have two options: either sue the SEC like Grayscale did for the Bitcoin spot ETFs, or file again at a later date.\n\nFactoring into the equation is the US election. Should former President Donald Trump win a second term in the White House, the SEC is likely to face a change of leadership. And a new chair could be friendlier towards crypto than Gary Gensler.\n\n“If there’s a new president, you file again,” Balchunas said. “Maybe you get approved. Or you sue. Either way, that will take a whole other year to play out.”\n\nSuing the SEC\n\nThe SEC spent years shooting down Bitcoin spot ETF applications before Grayscale filed a lawsuit against the regulator in protest in 2022.\n\nJoin the community to get our latest stories and updates\n\nIn September, a judge found that the SEC had acted in an “arbitrary and capricious” manner by denying the applications. Four months later, the Bitcoin ETFs were launched.\n\nStill, it’s unlikely that the strategy will be replicated for Ethereum ETFs. For one, Grayscale will probably not bring the fire to the SEC a second time, Balchunas told DL News.\n\nLawsuits are expensive — not just in terms of money, but in attention and bandwidth too. And after suffering massive outflows when its Bitcoin trust was converted into an ETF, it wouldn’t be surprising if Grayscale did not aggressively pursue a conversion of its Ethereum trust.\n\nOther prospective issuers, meanwhile, won’t dare pick up the baton and sue the regulator themselves, Balchunas said.\n\n“None of these other firms want to piss off the SEC,” Balchunas said. “Grayscale was unique in that it wasn’t a big ETF issuer. The rest of these firms have other things going on, and they’re more scared.” “Nobody else will step up,” he added.\n\nElection time\n\nAnd why sue the SEC when the US presidential election, slated this November, may solve the problem?\n\nWith Trump leading in some polls, the odds that a new SEC chair will be appointed are higher than previously expected.\n\n“Trump is not necessarily pro-crypto,” Balchunas said. “Remember his previous SEC chief Jay Clayton didn’t allow that ETF either. So he’s not going to be like, ‘let’s just go crazy.’ But he’ll probably still be better for crypto and spot ETFs.”\n\nAssuming a new chair is appointed in April or May, and filings submitted immediately afterwards, that could bring the deadline for approval or rejection to somewhere around December 2025.\n\nAlternatively, issuers could try to file as soon as the election is over — or even before results are in — to speed up the timeline.\n\nAnd if Joe Biden wins?\n\n“In the past cycles, when they denied spot Bitcoin ETFs, there was usually a cooling off period for like a year where nobody did anything,” Balchunas said. “And then out of the blue someone is like, ‘Oh, the hell with it’ and files again.”\n\n“My guess is that issuers will take the summer, lick their wounds, just be bummed, and then see what happens in the election,” he added.\n\nTom Carreras is a markets correspondent for DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com"
    }
]