[
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFBjRUE0ZDAwT2tKUS1vcUs4d0xxQ25qSTZGV1kxSDhicEpMVlFOY1BaeDU3TU9qUFFEOThHSTd4dUxmUnlOc0Y5SFRaS2FsY1dmQkRYNXpxVzFpbDRUOWlTTjhTMFV2YjFtNUU1eHBPbklrOTjSAXhBVV95cUxOSFpEdGtTZVhWeFJFelIzZmp0NW4ycmpkMnNLRUNUOUh2YXdEeUJlUE9hTjlNRjJXTDNjY2E2QlZ3NEVaLS1aNWR4dVpUMEJoRzZZcFllN0pRV2U0SUU2S3AyUHp1R2dVQ2diYkRzNVU1bUNUdWFHMjE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Send Crypto to Gmail Account: New ZK Tech Revealed - U.Today",
        "content": "Advertisement\n\nYet another eccentric cryptocurrency application on zero-knowledge proofs (ZKPs) addresses the Web2-Web3 synergy in an entirely novel way. With Bonsai Pay, every Google account can be turned into a non-custodial crypto wallet almost seamlessly.\n\nSending Ether to Gmail account becomes possible with ZK proofs\n\nBonsai Pay by RISC Zero, an open source ZK-powered payments platform designed to allow every Gmail user to receive Ethereum (ETH) payments, has landed to the Sepolia Ethereum testnet. It is a new-gen way to replace sophisticated Ethereum (ETH) wallet addresses with familiar email contacts.\n\nAs per the team's statement, any active Google account is compatible with the service and requires zero additional setup to start receiving ETH funds.\n\nAdvertisement\n\nTechnically, cryptocurrency is transferred via an escrow contract created on the Ethereum (ETH) network. Recipients can retrieve assets from this escrow just by logging into Gmail and generating a zero-knowledge proof.\n\nJSON-based identity tokens and OpenID Connect Protocol are technologies the new product is backed by. Its core codebase is written in the Rust programming language.\n\nAlso, it leverages the protocol's own virtual machine dubbed RISC Zero zkVM. Moreover, this instrument can be used by third-party developers via API keys.\n\nZK-powered projects on fire as Ethereum's L2s recovering\n\nThe live demo of the protocol has been launched on top of Sepolia: The team invites all developers to stress-test it and share feedback on GitHub.\n\nZK-proof is a cryptographic method by which the prover can prove to the verifier that this or that statement is true, while avoiding disclosing any information beyond the mere fact of the statement's truth.\n\nZK-proofs are used in many of the top-tier L2 protocols on top of the Ethereum (ETH) mainnet. Three of them, Polygon zkEVM, zkSync Era and Scroll, showed double-digit increases in TVL over the last 24 hours."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxOVWN6ZExrX2l4Q1dGNktzczdFUGdmMjFhWW14MzBza2RoZ2FMWnYxM3RNbW1qcV9ZbGZJOHY5eFQyVkRFbTQxWlE2MUw0c2toOXhOcjJBTnJsODVyeFNKUXFYTmNCWHZKSFBadDJ1cllNQzlmSWg0eHJGb0RNNEZuX2U0VUN0NVlmcDA2TFdycWo5Qlo1bjdtOUZwTnZURlRkN1M1UXZ6eExlVl9ZWG1mNVJvWjdtYjJvSExvSlQyaDI5VEdVWmhpenRzN2_SAdIBQVVfeXFMTWFUaEtmb0JLcFNqQWNkLUR2TFZDRkVXRG1ReGZFNHVVMGo3LWNIWHlWMEVpbkZ5RTNyT2Ixc3lzbVBoS2MtWHkzcnZCN2pLaGJPUFIyeDR2dVZ2UFJOdmVVOGJNNTYyVVUyamdHMWRNeDZkYmhpYUVfQVNQb3dIaDRYS3hLNlJkTnlwbkFrWTEyblNiS2RwZFF1dWl3bndkcGtxVU1hT0RPTnVBZzB2S0kxemFrN255dmdiT2V1Zk5UR2VYX1h4RFRLZXMyYkRfajJ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Arthur Hayes Says Ethereum Could Explode by Over 4,600%, Doubles Down on $1 Million Bitcoin Prediction - The Daily Hodl",
        "content": "BitMEX co-founder Arthur Hayes is doubling down on his massively bullish Bitcoin (BTC) predictions while forecasting that Ethereum (ETH) could hit a six-figure price.\n\nHayes says that the time to turn bullish on crypto is “now” while unveiling a target of $100,000 for Ethereum – an increase of about 4,669% from the current level.\n\nThe BitMEX founder also reiterates his prediction that Bitcoin will hit $1 million.\n\nIn a new blog post, Hayes further says that as currencies debase across the globe, the “smartest trade” would be “going long crypto.” According to the BitMEX founder, Bitcoin and Ethereum are “crypto’s reserve assets” while “everything else is a sh*tcoin.”\n\nBesides Bitcoin and Ethereum, Hayes says there are other opportunities that exist in the crypto space offering the potential of higher returns at a greater risk.\n\n“Then, we get to other layer-one blockchains that claim to be an improvement on Ether. Solana is an example. These all got beaten up real bad during the bear market. As such, they will levitate off extreme lows and provide great returns for intrepid investors. But, they are still all overhyped, me-too, pieces of sh*t that won’t overtake Ethereum in terms of active developers, decentralized applications (DApps) activity, or Total Value Locked.\n\nFinally, all manner of DApps and their respective tokens will pump. This is the most fun, because down here is where you get the 10,000x returns. Of course, you’re also more likely to get rugged, but where there is no risk there is no return.”\n\nEthereum is trading at $2,097 at time of writing while Bitcoin is worth $37,083.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxQT25oTkVRcVhBN0x5MWZmMnVfdDk5WWZTenFqMnVWMnc5b2NER2dBRWZBUDNTTEZRT08tVDFlOTZMS0xzVnlQUTk4VGZESi1tS3Z0aU1hSlJsaFphTE04WmQ4ZjByQ2V0MFh5d3lpY0ZNbjF1VU1EZkZhdmtWWkdSS2NkWnlwWUFkWFQybE9fVmhSZGVqYUtsOUZlOWJwcmJxZE9DQzcwX3JTMzYxSERnUlF0elZmZEdBdTg1ZnpDdHNoMnNqT2ZKUzRMXzRMazd2M1FRLTVxci1oUm1NNkt0eEhYUnFreUJtbVEyWVo2RHfSAfYBQVVfeXFMUEY5TWx1ODhuTGlHaHJMM1RXMlZ3d0NYZW1aenMzdk1lWWZNYkp0Qm5uSGN4QXp3M2hPdlVpWVZPQ1oxWFpkd29hbjM1Tm4tcXplMko3ZUFDN0tKMU1qR1VVR0dlSjQ4aHgyamdoWGlmcm85dDhVVmhEUGp5aXg0aUlJeG9NUnJURTduQTNva29kdUc1OGh0eS1oT0hKMDhZc0cxcEJmQUIxdk5iNmZ2blFnUHJPbmk3ODh1MHpfUnlmSUZpQnV6ZGp1bmt5T0VLZDJjd0VMbkhURHRtTElvUGk4V2UzaUExclAweG1EWGJxN0Z0dGtB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Eighteen-months ascending triangle pattern appraises $4,000 target for ETH - FXStreet",
        "content": "Ethereum price has been consolidating along an ascending trendline for the past eighteen months, with the $2,035 level holding as resistance.\n\nThe overall price action has formed an ascending triangle pattern, which forecasts a $4,736 price target for ETH.\n\nThe bullish thesis will be invalidated once the altcoin breaks and closes below the ascending trendline at the $1,500 psychological level.\n\nEthereum (ETH) price is bullish on lower and higher timeframes alike, as token holders ride the wave of what already seems to be the making of a bull market. On the higher timeframe, however, the target objective for the largest altcoin by market capitalization looks overly ambitious, but not impossible as community members turn faces toward the exchange-traded fund (ETF) narrative and the much-anticipated Bitcoin (BTC) halving, together with their combined effect on asset prices.\n\nAlso Read: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC rages on, $40,000 may not be hopium after all\n\nEthereum price 18-month ascending triangle forecasts $4,736 target\n\nEthereum (ETH) price consolidating above an ascending triangle, combined with the effect of the formation of multiple local tops around the$2,035 level has led to the formation of an ascending triangle pattern.\n\nSuch a technical formation is created when the asset’s price lead to the formation of a horizontal line connecting the swing highs, while a rising trendline trails it from below connecting the swing lows. Together, the trendlines form a triangle, with traders watching for breakouts from the horizontal trendline. The target objective for such a technical formation is determined by measuring the height of the triangle and superimposing it at the breakout point.\n\nFor Ethereum price, the height of the triangle is around 134%, from $865 to $2,035 on the weekly timeframe. Superimposing this percentage difference on the weekly chart puts a target objective of $4,736.\n\nThe Relative Strength Index (RSI) spurs optimism, moving north to signify rising momentum while its position at 64 shows there is still more room to the north. Effectively, the Awesome Oscillators (AO) histogram bars are also flashing green to show the bulls maintain a strong presence in the ETH market.\n\nETH/USDT 1-week chart\n\nOn the flip side, profit-taking could nullify the projection by sending Ethereum price south, potentially losing the support offered by the ascending trendline at the $1,500 psychological level. This would invalid the bullish thesis."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQclRQeVdiT3V5U3M2ZzVrTmZoY0k3c0pQY0x3bmN2UFF4SWMybHgwclVicFYzeUJmc1E4UWl1M1lQV1dMZjI5a3Qtb1YxOTI5UENLcUlNSGp0a2ZnRFJ2Z3czS0xyX3hkWGE4RmdhaGdubWlnVkVDYUl1VllPVld2S2dZaGkyeEFYRC1vOU96Q1czQ3hj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin price will continue dwarfing Ethereum, analyst says - crypto.news",
        "content": "Into The Cryptoverse CEO Benjamin Cowen recently discussed Ethereum’s (ETH) performance in relation to Bitcoin’s (BTC) dominance as the flagship digital asset.\n\nIn a recent YouTube video, Cowen suggests a continued rise in Bitcoin dominance (BTC.D), indicating that Ethereum may lag behind and show smaller gains compared to BTC.\n\nCowen explains that his crypto portfolio has predominantly held more Bitcoin because he anticipates that BTC will outperform numerous assets, though not all.\n\nAdditionally, Cowen notes that Ethereum against Bitcoin (ETH/BTC) is encountering substantial resistance after falling below the trendline and attempting a retest.\n\nYou might also like: Bitcoin and Ethereum outperform traditional assets in 2023\n\nA BTC rally would result in the breakdown of Ether-Bitcoin, he explained. He pointed out how the ETH/BTC pair finally broke the wedge to the downside, highlighting that it’s akin to what happened in the last cycle.\n\nAs he connects the dots, the Ether-Bitcoin pair is potentially backtesting the trendline that served as support in October 2022, March 2023, June 2023, and September 2023. Since the ETH/BTC pair is now testing from beneath the wedge in November 2023, it could offer a significant resistance level.\n\nHowever, Cowen cautions that even if ETH/BTC manages to move above the trendline, the pair will encounter several resistance levels to the upside. These levels must be successfully flipped as support to convincingly reverse the downtrend.\n\nHe further explained, stating that, there are numerous resistance levels. Whether one opts to depict them horizontally or analyze them differently, ETH/BTC still faces a significant challenge. It must have to overcome these resistance levels to indicate a meaningful reversal.\n\nAt the time of writing, ETH/BTC is valued at 0.05578 BTC, equivalent to $2,068.80 on Tradingview. Meanwhile, BTC/USDT is valued at $37,112, according to Coingecko.\n\nETF expectations\n\nThe recent surge in Bitcoin and Ethereum has significantly influenced the cryptocurrency market.\n\nBitcoin has reached $37,000, marking highs not seen since May 2022. This may be driven by the ongoing expectation that U.S. regulators approve a spot Bitcoin exchange-traded fund (ETF).\n\nSimultaneously, Ethereum has rallied close to $2,100, reclaiming the $2,000 level for the first time since mid-July. The rise in digital assets, especially XRP, may also be attributed to Bitcoin surpassing $35,000.\n\nAdditionally, news about BlackRock planning to file for an ETH-based ETF may have also fueled Ethereum’s upward momentum.\n\nFollowing the anticipation of the ETF approval, which has propelled cryptocurrency prices and related stocks, This rally could be part of a broader uptrend in the crypto sector, recognized as a significant $17.7 trillion opportunity by market strategists.\n\nHowever, altcoins like XRP, DOGE, UNI, and XLM have experienced declines, possibly due to a pause in capital rotation towards smaller tokens.\n\nFed chair Jerome Powell recently delivered a policy address to the Economic Club of New York, providing insights into the current state of the US economy and monetary policy.\n\nThis statement is significant given the critical juncture of the U.S. economy, marked by improving inflation figures alongside surging Treasury yields, creating conflicting signals about the direction of monetary policy.\n\nInterpreted as a signal, Powell’s statement suggests that the Fed might persist with its tightening cycle, contrary to recent market expectations of a more dovish approach."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxQejNIa3hBTWUzTktxWGNxUHhuMkdleXp1d0YxSVh0ZGJ2S1R1eHZocmNkbC1QMW12aG9UblEteGpudzNQRkFfbHhmODdDVlAycUFvYzdJWGtTaHozNlhqcFlsTFdsQUJXb0VXTmdDcFFxSDNFWFhMZHpVSk5wR2lZOVZ5S2dnNFRZU0RRSVBtbU1mcTZkVFRQVEtvdVVoa1Rmb1NfV2ZYcElCSjd5RG5UV2RER3RHakFENVZkNXhULVhWeXlSMDdqcjln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Pundit Says Assets Like XRP With no Ties to China’s CCP Will Benefit Most in Coming Bull Run - The Crypto Basic",
        "content": "A crypto pundit has expressed his bullish outlook on XRP and other protocols that he claims have no ties to the Chinese Communist Party (CCP), China’s ruling party, as he positions them to benefit most from the upcoming bull run.\n\nIn a recent post, influential crypto commentator BoringSleuth hinted at a strategic advantage for cryptocurrencies not entangled with the Chinese Communist Party (CCP) in the upcoming bull market.\n\nAccording to him, protocols avoiding association with the CCP would thrive in the coming market cycles. BoringSleuth singled out Constellation (DAG) as a prime example. He also pointed to XRP as another well-positioned asset.\n\nThe protocols that weren’t in bed with the CCP will be the benefactors of future bull cycles. A protocol like $DAG, who works with the DOD is one example of a well positioned protocol. $XRP is another. — TruthLabs ? (@BoringSleuth) November 11, 2023\n\n- Advertisement -\n\nIt bears mentioning that Constellation boasts ties with the U.S. Air Force in a Department of Defense (DoD) partnership that started in 2019. Details of the partnership came to light in August 2021, with the Phase II of the collaboration announced to have been completed in May this year.\n\nXRP Boasts Robust Potential\n\nFurthermore, BoringSleuth’s endorsement of XRP stems from the robust potential the asset holds. The mention of XRP’s detachment with China also prompts a closer look at the ongoing rivalry between the XRP and Ethereum communities.\n\nAs both assets vie for market dominance, their supporters have continuously engaged in heated debates. Last August, Ethereum founder Vitalik Buterin said XRP lost its right to protection when Ripple executives threw Ethereum under the bus in claims that the project is “Chinese-controlled” during the SEC’s lawsuit.\n\nNonetheless, amid XRP’s victory in the lawsuit, BoringSleuth’s nod to the asset suggests a belief in its resilience and potential to capitalize on the forthcoming bullish trends. The XRP community has also repeatedly propagated claims of Ethereum’s ties to China.\n\n- Advertisement -\n\nClaims of Ethereum Ties to China\n\nSeveral pundits have jumped on this narrative, and BoringSleuth is one of them. Although his recent post does not specifically highlight this, he had previously taken to X to express his concerns.\n\nButerin has also claimed that XRP is centralized, yet people still consider it a crypto asset. Last month, BoringSleuth accused Buterin of securing funding from CCP-affiliated entities in the project’s early days.\n\nThe post unfolded a narrative wherein over 66% of ETH tokens prior to the Merge allegedly entered into wallets associated with China-backed entities, including the Ethereum Foundation.\n\nThe allegations extended to Ethereum’s pre-sale and ICO backers, claiming they received funds through Wanxiang Blockchain, an entity with connections to China. The Crypto Basic spotlighted these claims in June, as disclosed by Fox Business journalist Eleanor Terrett.\n\nBoringSleuth contended that these entities, purportedly responsible for financing a significant portion of the crypto ecosystem, have manipulated and controlled various aspects of the industry.\n\nHe also questioned the decentralization of Ethereum 2.0’s Proof of Stake model, asserting that the system has never been genuinely decentralized.\n\nHe argued that blockchain has lost its identity. According to him, those who fear loss of power, wealth and influence have hijacked the crypto scene. He alleged that these entities used corruption and theft to gain control over the crypto landscape."
    }
]