[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxOODNZOUdTYXI0UVJCdnBFdmFLbEtsY3Vabk5XendEZjFaZ184eU9QVzdvVlpiVHg5UFY5bVJ0a0ItTS1QNTVqRnRHcnRKZVJIc3hGb1BLT2VKNGwwV2RkY003Y3hRWi0zMkpZV3poSVEwb285OVVyZlh1TVI1QzNFcFJDV3BaTGI3Qk9CU0tCNEtFRHp4YUJqYWdGRHZOZWttbF82TTRPOWFCZEVuS0pRcW1MWVh4UlJkdElEVVBXWUdmWXY2TXl2amE5YkFXTDFXTlVOXzJmQdIB3AFBVV95cUxOdVZDWnRlclozSWl1MmVqNnI4STNCSGFael9FRUM4cWJvUE1teEpURDJPS1AxSFVZb0JSU05WS3o3V3Jxdkk2SnBQSkM5NW4tbFdOeXo4dWxYVmtfLVgwZEJWM2pQcHp0N0FsdHRsUXM5bkhIUVJaTDNzQ3V5S2VZQldOZnNKS2d0bkl2OHUtRU1FU0tILVVId1BhbDhiemJ6U1BVQWV3MFNHY0lpUWs5YS1MbEF6ZlI4TEtrMEN1OVF0eTJCX3RPNzhDbmFveXFtMk1jNS11Y0k0RVpZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Nov 2023 07:00:00 GMT",
        "title": "Trader Says Ethereum Rival That’s Exploded Over 300% To ‘Keep Running,’ Unveils Targets for Chainlink and Sushi - The Daily Hodl",
        "content": "A widely followed crypto analyst says that one Ethereum (ETH) rival that’s skyrocketed by over 300% this year still has more room to rally.\n\nPseudonymous crypto trader Altcoin Sherpa tells his 194,200 followers on the social media platform X that smart contract platform Solana (SOL) will likely continue surging up in price until proven otherwise.\n\nThe strategist also says he’s not sure what will become of bankrupt crypto exchange FTX’s holdings of Solana worth $1.16 billion as of August 31st.\n\n“SOL: I think that $35-$32 are buy-the-dip zones. I don’t know what happens with FTX supply but this should keep running until shown otherwise.”\n\nSolana is trading for $39.83 at time of writing, a staggering 300% rise since the start of 2023 when it was moving for just $9.97.\n\nMoving on to the decentralized crypto exchange (DEX) platform SushiSwap (SUSHI), Altcoin Sherpa says that accumulating the digital asset at $0.91 seems like a good idea with the 0.5 Fibonacci level offering support.\n\n“SUSHI: I think buying $0.91 seems pretty solid. S/R(support and resistance) level, etc.”\n\nAt time of writing, SUSHI is worth $1.06.\n\nThe crypto strategist concludes his analysis by noting that traders should keep an eye on the $9.50 price level of the decentralized oracle provider Chainlink (LINK).\n\n“LINK: come on… let’s fill the rest of my bids, please. $9.50 is the area.”\n\nAt time of writing, LINK is trading for $11.32.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPV0c0d2JJbzlkMXlaV2pPZy04ZGxJN2VQdjdHSTVrRVc2RHlOUTlwWC1NWXBURFhGeFV0TXBzRjh5NG80RzZ3OXRwaWVGaEVQQTczdHFHeHF6T3p1ZmJBVUNwS1lzYW55cE05VXAzQ2lQV0U5V0g3c0E1anVWbG1raWw0SjkzcmlwblZpeTVxeG5lLWtUY0VpSjBrNGtNaHhmUThpV0tCZHhLQm51YmNsLU12TXBSdUNMMWdHeEQ4czjSAcYBQVVfeXFMT2ZQZDhTeHNJdGpmS1hLUENJLUF3X0lNSjNkMllKTTFPcGtJTC1FT0JQeVAybV9ESURJaXRKOEJFXzJKYXdOQ0owcWxKanpHUEhEbld1ZTRCTFJiUnBvNkdERmVRNGluZ2daUU9Pb0tqWU1Qbzh5TlFXQ3R4OG5XVlpFR2twLW9TU0VYc2xFSEFzQUVPNmgxYjRsZlhOaXMzSFJLQW0yQUYweFllTU83cWo5cjdZczlOMTNCeFdYN3d1WWNLaGN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Nov 2023 07:00:00 GMT",
        "title": "Bloomberg Analyst Says This Crypto Sector’s Market Cap Could Explode by 3,900% in Five Years - The Daily Hodl",
        "content": "Bloomberg Intelligence analyst Jamie Coutts says that one crypto sector could experience explosive growth over the next half a decade.\n\nCoutts says that smart contract blockchains such as Ethereum (ETH) and Solana (SOL) could reach 100 million daily users by 2028 by growing at 20% quarter-on-quarter.\n\nAccording to Coutts, the number of daily users of smart contract blockchains is currently over five million as a result of a quarter-on-quarter growth rate of 29% since 2019. A growth in the user base from five million to 100 million equates to 20x growth.\n\nThe Bloomberg Intelligence analyst says that the growth of smart contract blockchains may mirror that of online payments giant PayPal.\n\n“It took PayPal 13 years to reach 100 million daily users. They now have more than 400 million but growth has slowed.\n\nIf Ethereum was day zero for smart contracts (2015) then it may take a similar time frame for blockchains to reach a similar level of adoption.”\n\nAccording to Coutts, a 20% growth rate quarter-on-quarter could result in the total market cap of the smart contracts ecosystem soaring from around $350 billion currently to between $5 trillion and $14 trillion when the number of users rises to 100 million – an increase of between 1,328% and 3,900%.\n\n“While overly simplistic extrapolations such as this should never be solely relied on for valuation purposes, the exercise illustrates that users and prices are inextricably linked and that as adoption continues, prices are likely to track much higher for some assets.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQcXJLeXd5VmRhTE4yRmxMNWtoUEFOWnhpbDJ3dlhYOGhyRDZITGdoRm5BbHN4enBWS3JZRmlYZkxVRk1FSHFOeTR3R25hemFaUXpESnVRdDdvMFJKS2YwMUQwR3puZUZERFpvWG1HX0ZzVFlyZHZQMUxyUjVMdEZtQjFjUDZkXzVsVW9QTndnVUFVUdIBlwFBVV95cUxNT0swM2V3Q2YtUHd5enZqR1hFMTVwSXBOeHBfem1qbTVaWl9sQWtNTzg5WEN0WmJnTmoyOHhUa19pZWRGTEllWER1YTMwZHFJWXFzR21mSW5wWEZQdk8xQVo0MzNrb2wwSzFuUDFkNlVGNVVNUGN1UVR1dFp1a19vR3lZbUV4MWZma0ZMUGFudURDeFdxZ1pJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Nov 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Distribution Phase at Key Resistance Hints 16% Drop - CoinGape",
        "content": "Ethereum Price Prediction: Since the onset of November, Ethereum has experienced heightened volatility with the $1830 level proving to be a formidable resistance, impeding its upward trajectory. This resistance has led to two weeks of indecisive trading, as evidenced by long-wicked candles which reflect the market’s current uncertainty. Investors are pondering whether this consolidation could usher in another bearish downturn.\n\nAlso Read: US Seizes $54 Mln Crypto, Including Ethereum, In Narcotics Scheme\n\nadvertisement\n\nIs a Correction Underway?\n\nThe channel pattern leads to the current consolidation in the ETH price\n\nA bearish breakdown channel pattern would set the price at 16%.\n\nThe intraday trading volume in Ether is $5.3 Billion, indicating a 27% loss.\n\nSource- Tradingview\n\nThe ongoing recovery in the Ethereum price journey initiated from the mid-October low of $1522 to a three-month high of $1874, amounting to a 23% increase. Nonetheless, this rally brought it to a resistance level that aligns with the upper trendline long-standing wedge pattern, potentially introducing a new supply zone for the market participants.\n\nMirroring the Bitcoin price consolidation, the ETH price is encountering substantial selling pressure around the $1830 threshold, as suggested by the long-wicked rejection candles. However, a detailed analysis at shorter timeframes, reveals a rising channel pattern demarcated by two ascending trendlines.\n\nShould this pattern hold, we might see this altcoin oscillate within the $1800 to $1880 band, indicating a moderate bullish continuation.\n\nFrom a bearish viewpoint, a breach below the channel’s lower boundary could precipitate a short-term downturn for Ethereum. The Fibonacci Retracement Tool delineates critical support levels at $1750 (corresponding to the 38.2% Fibonacci level) and $1700 (at the 50% retracement mark).\n\nA retracement to these zones could potentially be a precursor to a renewed ascension above the $1880 threshold, maintaining the larger bullish narrative.\n\n1 ETH to USD = $2656.323 0.95% (24h) ETH btc\n\nbtc eth\n\neth xrp\n\nxrp bnb\n\nbnb sol\n\nsol ltc\n\nltc polygon\n\npolygon cardano\n\ncardano tron\n\ntron doge\n\ndoge WETH\n\nWETH LUNC\n\nLUNC XMR\n\nXMR LIRA\n\nLIRA BITS\n\nBITS IHINU\n\nIHINU SWEAT\n\nSWEAT PI\n\nPI SATS\n\nSATS ILV\n\nILV BDX\n\nBDX MCOIN USD USD\n\nUSD INR\n\nINR JPY\n\nJPY CNY\n\nCNY GBP\n\nGBP EUR\n\nCan the ETH Price Fall Back to $1500?\n\nEthereum’s daily chart over the last seven months illustrates a methodical pullback within the confines of a descending wedge pattern. The latest uptick was a part of this pattern, testing both of its boundaries. If the pattern endures, a correction towards the $1500 mark might materialize, though traditionally, such a pattern concludes with a bullish reversal, as Coingape mentioned in our previous article.\n\nExponential Moving Average: The daily EMAs (20, 50, 100, and 200) waver around the $1780 to $1700 price bracket, fortifying this area as a strong support zone.\n\nRelative Strength Index: The daily RSI forming lower highs within the overbought territory signals a possible price retracement.\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPNmpmZU1RZGZya082bXo4bElDbmk1TFYzRVlPc2kyc01sTkRXeVhrVXNhVzZEYzNmcmRvSUd0a0h5TzJfS25zajRFcEF3TU5fQzZkT1ZVLUZGRVZaN3BxcTNWMDRBRkQyWGdnOVBwQXQ4cGZtY3lyWExJbTNJZTJ5WDdqcHB0eVhMbEJnd09oZjdrOUJlUjZxTzRhVERvaGtVU0ZmUEhLZUdZRVRIMnR0a3E2X05zbms5bXfSAcIBQVVfeXFMTlZwN19VTTlwYlpRMmgxVTgzZmJoUHd1dTJpMml6UW5uVmhtTWxrQWpvNmJTc05STW5TUEZOWlcxTDhWeV9fMFFVZV9LSVdVMjg5ZkdQajByVV80bnVFUURjWXBqdDZXRWZZRGNMUG9PT3BLNXB1TWd6X2pfR2NaNDNwUzlfNjB2TGJyTDc1QXI0VjdCN0htYkppQlFCaWYzNV9nQ0xQdmNCaXljbnZsZFRJRDFvOFViRU1Kc1ZDZGF5eGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Nov 2023 07:00:00 GMT",
        "title": "Bored Ape Creator Yuga Labs and Magic Eden Launching Ethereum NFT Marketplace That Enforces Royalties - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMulti-chain NFT marketplace Magic Eden announced Saturday that it will launch a new Ethereum platform by the end of the year in collaboration with Bored Ape Yacht Club creator Yuga Labs—with a firm commitment to honor creator royalties on NFT sales.\n\nThe companies said in a statement that Magic Eden will have a “contractual obligation” to pay Yuga Labs its share of secondary market sales of its future NFT collections.\n\n“We’re very much happy to put our money where our mouth is,” Magic Eden co-founder and CEO Jack Lu told Decrypt.\n\nLu said that Magic Eden’s overhauled Ethereum marketplace would use new smart contracts—which contain the code that powers decentralized apps (dapps)—with technical innovations that it says will ensure that royalties are paid out during secondary market sales.\n\nAD\n\nAD\n\nTechnical details will be revealed before the marketplace launches, but Lu did confirm that the standard ERC-721 Ethereum non-fungible token (NFT) standard will indeed be in use. NFTs minted with certain “properties of the marketplace contract” will have royalties enforced.\n\nThe change will not impact the way that traders interact with Magic Eden, Lu said; for example, it does not mean that they’ll have to identify themselves via know-your-customer (KYC) checks.\n\nRoyalties disputes\n\nA creator royalty is a small fee set by the artist or company behind a project and taken from the sale price of any follow-up sale of an NFT. The fee typically ranges between 2.5% and 10% of the sale price, and such fees had initially been widely honored by marketplaces as a way for creators to benefit long-term from their tokenized creations.\n\nBut in the second half of 2022, with NFT sales fading, some upstart marketplaces began using workarounds to let traders skip such creator fees, or pay smaller amounts. Major players then followed suit to keep pace, and prominent marketplace OpenSea ultimately decided to stop enforcing royalties this past August after previously committing to honor such fees.\n\nAD\n\nAD\n\nYuga Labs criticized OpenSea in late 2022 when it publicly said it had considered moving away from royalties and came out swinging again this past August after the decision was finalized. The Bored Ape creator said that it planned to stop supporting OpenSea’s marketplace contracts with new collections and those collections with upgradeable contracts.\n\n“Obviously, the genesis of this was what we saw happening in the overall ecosystem with secondary royalties,” Yuga Labs CEO Daniel Alegre told Decrypt. “The gauntlet that unfortunately OpenSea dropped made it very clear to us that we, as a company at the forefront of the NFT space, had to stand up for content creators.”\n\nA press release from Yuga Labs and Magic Eden announcing the news appears to subtly jab at OpenSea, noting that the companies have “made it unequivocal that respecting creator royalties is non-negotiable, a clear stance amidst a sea of other marketplaces who turn their backs on creative entrepreneurs.”\n\n“Going forward, for new collections, Yuga Labs will exclusively engage with marketplaces that uphold these principles, ensuring fair treatment of creators,” the release notes.\n\nAlegre said that Magic Eden—which is also in a working group with Yuga Labs in OMA3 (the Open Metaverse Alliance of Web3) to improve royalties standards—has pledged to address any loopholes or workarounds with this new technological solution.\n\nAnd this isn’t an exclusivity deal with Magic Eden, either. The companies say that other marketplaces can choose to use the same kind of contracts introduced through this collaboration, and that Yuga Labs hopes to see them broadly adopted. Furthermore, other NFT creators can mint their projects using the contracts to adopt similar protections.\n\nShifting strategies\n\nMagic Eden, best known for its original iteration on Solana, is one of those aforementioned marketplaces that switched to optional royalties last year after pressure from rising rivals. The platform also launched an Ethereum NFT marketplace last fall, but eventually took it offline ahead of the planned revival.\n\nLu acknowledged that Magic Eden “went through our own changes” in regards to royalties enforcement on Solana, but that it always wanted to support creators—it just wanted a “technical solution” for that. Such solutions have emerged on Solana over the past year, and now Magic Eden is among the builders trying to enact such standards on Ethereum, too.\n\nAD\n\nAD\n\n“We want to be on the right side of history here,” Lu said.\n\nAlegre said that he’s confident that this approach of supporting marketplaces that enforce royalties will work, and that Magic Eden will work to address any shortcomings of the tech once it’s in the wild. But he also admitted that Yuga has another potential way of encouraging traders to use such marketplaces: withholding future benefits for those who buy NFTs elsewhere.\n\nThe Yuga CEO said that the company will “provide value to holders who engage with the platforms that make the most sense.” Asked if there will be consequences for NFT buyers who purchase Yuga assets from marketplaces that don’t enforce royalties, Alegre replied that his team is “still thinking through exactly what that means.”\n\nLanded in HK, pumped for Day 1 of #ApeFestHK & to support @yugalabs on this Had to pick out this this clean boy with Magic Eden colors to celebrate. We've been non stop cooking at @MagicEden across all ecosystems lately - Rare Sats & BTC Amsterdam, Tokenized Pokemon Cards &… https://t.co/sPXt17U83a pic.twitter.com/wMmLRlunub — Jack Lu (@0xLeoInRio) November 3, 2023\n\n“You can imagine situations where we say, ‘Look, if the last trade was done on a certain platform, then certain benefits in ongoing engagement or ongoing experiences may actually not accrue to the holder of that asset,’” Alegre explained. But he said that Yuga would rather not “put the onus on the consumer” to deal with that because it becomes “complicated.”\n\n“The ideal way is actually to ensure that you're working with the right partner,” he said of Magic Eden, “and you direct as much traffic as you possibly can to that partner.”\n\nThat ability to restrict perks and benefits to NFT holders is framed as a potential backup plan for now—a nuclear option, if needed. But Alegre and team hope instead that Magic Eden’s approach will prove to be the solution to flagging creator royalties enforcement.\n\n“We're confident in the capabilities of Magic Eden,” Alegre told Decrypt. “We're obviously leaning in very heavily into this partnership, and we have full trust in Jack and his leadership team. And for now, that’s the approach that we're going to take.”\n\nAD\n\nAD"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPNmpmZU1RZGZya082bXo4bElDbmk1TFYzRVlPc2kyc01sTkRXeVhrVXNhVzZEYzNmcmRvSUd0a0h5TzJfS25zajRFcEF3TU5fQzZkT1ZVLUZGRVZaN3BxcTNWMDRBRkQyWGdnOVBwQXQ4cGZtY3lyWExJbTNJZTJ5WDdqcHB0eVhMbEJnd09oZjdrOUJlUjZxTzRhVERvaGtVU0ZmUEhLZUdZRVRIMnR0a3E2X05zbms5bXfSAcIBQVVfeXFMTlZwN19VTTlwYlpRMmgxVTgzZmJoUHd1dTJpMml6UW5uVmhtTWxrQWpvNmJTc05STW5TUEZOWlcxTDhWeV9fMFFVZV9LSVdVMjg5ZkdQajByVV80bnVFUURjWXBqdDZXRWZZRGNMUG9PT3BLNXB1TWd6X2pfR2NaNDNwUzlfNjB2TGJyTDc1QXI0VjdCN0htYkppQlFCaWYzNV9nQ0xQdmNCaXljbnZsZFRJRDFvOFViRU1Kc1ZDZGF5eGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Nov 2023 07:00:00 GMT",
        "title": "Bored Ape Creator Yuga Labs and Magic Eden Launching Ethereum NFT Marketplace That Enforces Royalties - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMulti-chain NFT marketplace Magic Eden announced Saturday that it will launch a new Ethereum platform by the end of the year in collaboration with Bored Ape Yacht Club creator Yuga Labs—with a firm commitment to honor creator royalties on NFT sales.\n\nThe companies said in a statement that Magic Eden will have a “contractual obligation” to pay Yuga Labs its share of secondary market sales of its future NFT collections.\n\n“We’re very much happy to put our money where our mouth is,” Magic Eden co-founder and CEO Jack Lu told Decrypt.\n\nLu said that Magic Eden’s overhauled Ethereum marketplace would use new smart contracts—which contain the code that powers decentralized apps (dapps)—with technical innovations that it says will ensure that royalties are paid out during secondary market sales.\n\nAD\n\nAD\n\nTechnical details will be revealed before the marketplace launches, but Lu did confirm that the standard ERC-721 Ethereum non-fungible token (NFT) standard will indeed be in use. NFTs minted with certain “properties of the marketplace contract” will have royalties enforced.\n\nThe change will not impact the way that traders interact with Magic Eden, Lu said; for example, it does not mean that they’ll have to identify themselves via know-your-customer (KYC) checks.\n\nRoyalties disputes\n\nA creator royalty is a small fee set by the artist or company behind a project and taken from the sale price of any follow-up sale of an NFT. The fee typically ranges between 2.5% and 10% of the sale price, and such fees had initially been widely honored by marketplaces as a way for creators to benefit long-term from their tokenized creations.\n\nBut in the second half of 2022, with NFT sales fading, some upstart marketplaces began using workarounds to let traders skip such creator fees, or pay smaller amounts. Major players then followed suit to keep pace, and prominent marketplace OpenSea ultimately decided to stop enforcing royalties this past August after previously committing to honor such fees.\n\nAD\n\nAD\n\nYuga Labs criticized OpenSea in late 2022 when it publicly said it had considered moving away from royalties and came out swinging again this past August after the decision was finalized. The Bored Ape creator said that it planned to stop supporting OpenSea’s marketplace contracts with new collections and those collections with upgradeable contracts.\n\n“Obviously, the genesis of this was what we saw happening in the overall ecosystem with secondary royalties,” Yuga Labs CEO Daniel Alegre told Decrypt. “The gauntlet that unfortunately OpenSea dropped made it very clear to us that we, as a company at the forefront of the NFT space, had to stand up for content creators.”\n\nA press release from Yuga Labs and Magic Eden announcing the news appears to subtly jab at OpenSea, noting that the companies have “made it unequivocal that respecting creator royalties is non-negotiable, a clear stance amidst a sea of other marketplaces who turn their backs on creative entrepreneurs.”\n\n“Going forward, for new collections, Yuga Labs will exclusively engage with marketplaces that uphold these principles, ensuring fair treatment of creators,” the release notes.\n\nAlegre said that Magic Eden—which is also in a working group with Yuga Labs in OMA3 (the Open Metaverse Alliance of Web3) to improve royalties standards—has pledged to address any loopholes or workarounds with this new technological solution.\n\nAnd this isn’t an exclusivity deal with Magic Eden, either. The companies say that other marketplaces can choose to use the same kind of contracts introduced through this collaboration, and that Yuga Labs hopes to see them broadly adopted. Furthermore, other NFT creators can mint their projects using the contracts to adopt similar protections.\n\nShifting strategies\n\nMagic Eden, best known for its original iteration on Solana, is one of those aforementioned marketplaces that switched to optional royalties last year after pressure from rising rivals. The platform also launched an Ethereum NFT marketplace last fall, but eventually took it offline ahead of the planned revival.\n\nLu acknowledged that Magic Eden “went through our own changes” in regards to royalties enforcement on Solana, but that it always wanted to support creators—it just wanted a “technical solution” for that. Such solutions have emerged on Solana over the past year, and now Magic Eden is among the builders trying to enact such standards on Ethereum, too.\n\nAD\n\nAD\n\n“We want to be on the right side of history here,” Lu said.\n\nAlegre said that he’s confident that this approach of supporting marketplaces that enforce royalties will work, and that Magic Eden will work to address any shortcomings of the tech once it’s in the wild. But he also admitted that Yuga has another potential way of encouraging traders to use such marketplaces: withholding future benefits for those who buy NFTs elsewhere.\n\nThe Yuga CEO said that the company will “provide value to holders who engage with the platforms that make the most sense.” Asked if there will be consequences for NFT buyers who purchase Yuga assets from marketplaces that don’t enforce royalties, Alegre replied that his team is “still thinking through exactly what that means.”\n\nLanded in HK, pumped for Day 1 of #ApeFestHK & to support @yugalabs on this Had to pick out this this clean boy with Magic Eden colors to celebrate. We've been non stop cooking at @MagicEden across all ecosystems lately - Rare Sats & BTC Amsterdam, Tokenized Pokemon Cards &… https://t.co/sPXt17U83a pic.twitter.com/wMmLRlunub — Jack Lu (@0xLeoInRio) November 3, 2023\n\n“You can imagine situations where we say, ‘Look, if the last trade was done on a certain platform, then certain benefits in ongoing engagement or ongoing experiences may actually not accrue to the holder of that asset,’” Alegre explained. But he said that Yuga would rather not “put the onus on the consumer” to deal with that because it becomes “complicated.”\n\n“The ideal way is actually to ensure that you're working with the right partner,” he said of Magic Eden, “and you direct as much traffic as you possibly can to that partner.”\n\nThat ability to restrict perks and benefits to NFT holders is framed as a potential backup plan for now—a nuclear option, if needed. But Alegre and team hope instead that Magic Eden’s approach will prove to be the solution to flagging creator royalties enforcement.\n\n“We're confident in the capabilities of Magic Eden,” Alegre told Decrypt. “We're obviously leaning in very heavily into this partnership, and we have full trust in Jack and his leadership team. And for now, that’s the approach that we're going to take.”\n\nAD\n\nAD"
    }
]