[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPcDJUa2k0SGtzZzJycWlLZmowdFVzY0tKUl9QbC1zMl94dDZUMTI4c3lLRF9FMjRCU2JfQW04ZncwQnBxMWFEcGI5akw1WjFpU3NyZXVNWmZnZmg4WmZ3MWcyN0lpNzRjZ3EtU29rSzY1VDAzSWdCTE0tSl9MUlJLTkprY1ZGSk9wM2ZyNjhkaEIyWU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin’s Three Solutions for Ethereum’s PoS - Crypto Times",
        "content": "The proof-of-stake consensus mechanism at the core of Ethereum, according to co-founder Vitalik Buterin, may face systemic complexity. To address this, he has three solutions.\n\n“A PoS simplification proposal: make a design that only requires 8192 signatures per slot (even with SSF), making the consensus implementation considerably simpler and lighter,” he wrote in a post on X.\n\nThe primary problem is that to keep the network functioning properly, validators that maintain it must create a large number of digital signatures using encryption.\n\nThe network already has a lot of work to handle from this, but as additional validators join, the number of signatures will rise, adding to the system’s workload. Subsequent updates are expected to raise the required signatures even more dramatically.\n\nOn December 27, Buterin wrote a post to the Ethereum Research forum outlining three approaches to avoid this. The shared goal is to reduce the number of signatures needed for each Ethereum blockchain space to 8,192.\n\nThe first solution is centered on decentralized staking pools. This would need raising the minimum amount of ether needed to run a validator to force people running validators to collaborate and pool their resources.\n\nVitalik’s second solution is to have two layers of stakeholders, one with stricter criteria and the other with more lax ones would be the second strategy. During the block finalization process, the two levels would be used in distinct ways.\n\nThe third option would be to have a rotating group of participants, in which case a different group of validators is chosen at random for each slot. Although Buterin pointed out that it would increase complexity, this would divide out the workload and lower the overall number of signatures."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPVkpGWFhKcGl6ZEIwanVvVURUZWVpaTU0UldCREFCNVlDR2FQX0gta1oyUmJEMFRmR2VCZWVKaUk4a21uNHFfcEVpcmFUREF0Q2ZhM1gyYjFIMndIT0YwRWpkd1JUd2lHd2hobHkxcTJoOFVkbkwxZTloWHRDWkcyUzY0MVFEMGV4cTNURC05ejE2WkpSckdSMVo3aTF3NEVQd1NuZWVtUG1kZTlPQ3fSAbMBQVVfeXFMTVFWZk82QURwTTdReFM4WDE0cTh6Y1lZWkZQSUlIWEE3WmRKUF9ac3BtWmpRVzg3UkZNM05kVC13eThWbktadFdUalgzbWY4TS1oRktxckxZTmNYb2I2cWwxc2x6dXI3aTN3TUZ0c1phVHQtM2JTZ0FubUNhaUIzYzFFNnY5dEdCRlMxc0dheDR5bzdTdnlLNWp5LUFPcWliT3VfMVJnaUpvYkxZT3NZVDRONkk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "ETH Could Hit $15K in 2024, But These Ethereum-Related Tokens Will Outperform: Analyst - CryptoPotato",
        "content": "On Dec. 26, crypto YouTuber Lark Davis said, “Ethereum is going to make a lot of new millionaires in 2024.”\n\nHowever, he added that those with a lot of ETH, purchased at much lower prices and staked, will do well in the next bull market. But those getting into the market now, with the asset trading over $2,000, are not going to make it big unless they have a lot to invest.\n\nThe big returns will be made trading Ethereum layer-2 assets, he said.\n\nEthereum Will Make Millionaires In 2024, BUT Not How You Think pic.twitter.com/00YCLPyGCl — Lark Davis (@TheCryptoLark) December 25, 2023\n\nEthereum to $15,000\n\nLark highlighted a number of current and upcoming layer-2 listings, such as zkSync, Starknet, Linea, Scroll, Blast, Manta, and Celestia. “New listings can make money, especially in the short term,” he said.\n\nNewly launched tokens often exhibit pump-and-dump patterns as airdrop hunters offload them quickly. However, there have been several that have begun up trending soon after when they get listed on larger exchanges.\n\nFor the Ethereum hodlers, things could still be good in 2024. He compared gains for ETH from previous cycles and made a prediction for the next bull cycle in 2024 and 2025.\n\nNow that the asset has broken out from its resistance zone at $2,150, “it’s going to do big things.”\n\nIf Ethereum makes similar gains to the last cycle high, or even slightly less, “that will get us up to around $15,000 per coin.”\n\nThis is on a hypothetical 200% gain from the previous high, which was around $4,880 in November 2021.\n\nFor those buying now, there is a potential 500-600% gain, he said, which is a “relatively low-risk bet for crypto.”\n\nEthereum is very strong fundamentally despite the lack of love recently from the crypto community.\n\nETH Price Outlook\n\nCrypto markets are in retreat this Wednesday in Asia. As a result, ETH prices dropped 2% on the day in a fall to $2,223 at the time of writing.\n\nMoreover, the asset has now declined 6.8% from its 2023 high of $2,385 on Dec. 9. There is solid support at the $2,150 area where it could be heading next as markets continue to cool.\n\nThere is little doubt that the asset will perform well in the next bull cycle, but at the moment, the Ethereum engines are spluttering a little."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQNmtub0JJbEpicHFaX3VENGRxNFVzMXpWc2diY2FCNTUtQ2NzSUhjTzkwTXRsbElKUm5EVGY1SFQwc1pNbmVUZDAwd3A4Smc3QW5BUzJ6elRuWVdlR3FoUGVFMkVGT3h5c0Q5RTFUZ29sYjNJUm1oZXp4N3N2QUVFV0xIYUJNcjNLMDhUcENpNDNxNm5BSmdwMjhEY3lTcmNfZG5BSnlwR2xCeU9ydzUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Continues to Consolidate - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPU052OG9sa20wc0FDNWlaQUtkazhveG9ETldJbXFNR2dtd2c4OVJkSmZkWHZQd0RfeTZpLVAzaFNuTjJMLXl0TERpVE5GRG0xS2lwWDVFOHlxQk9vdVN5Q1lMZmNad0UwcDRFRmhGc2lYZWhpdTFfZFRsT1hzRk1YZUJtRm9VSERaRmlucUtVbzFxQ3NneGthT3NXZmZpOGR1SEhaYXNmT2RRb1VZc2ZyQmZMNTR3UXlIckowbDR5c0pnQdIBxwFBVV95cUxPZk1VeGpYQlZ6eVRMdnVMb2NreGtrcV8wYWJKOGNsdEFlX1lmYWZqMDg4TjZTbDFJMnJiQldadjhUS1dNd0dWdldkUTh1TUl6NkpWV2JkOVg2Sk51UkVreVd5Z08ySEdxOVl5MFV4S1Y0azhRc3Q2ZzZiS016M3p1VHNvNlF4U1RFaVk4RlRMc1NudHBTQ253LXZVOGZ0M0UwRFBrbWg4M2t1cTJ4RG5RTkJNeHNodW1LTElVWU0yazBQWWVxWTVZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Ethereum price eyes $2,500 mark as Solana market takes a breather - FXStreet",
        "content": "Ethereum price looks poised for a continuation of the uptrend, with several technical indicators favoring the upside.\n\nMeanwhile, Solana price is likely to face a correction after a multi-month period of SOL being massively overbought.\n\nETH could rise almost 7% to hit $2,500 amid rising momentum and a possible pending buy signal.\n\nA break and close below the critical support at $2,147 would invalidate the bullish thesis.\n\nEthereum (ETH) price looks poised for a shine after a prolonged contention against its peer in the Layer 1 space, Solana (SOL). This brings to mind previous reports where Solana founder Anatoly Yakovenko said he envisions a future where SOL and Ether co-exist, urging that the whole narrative of one ecosystem kills the other be binned.\n\nAlso Read: Crypto hack: Ethereum, Solana DeFi trading platform Thunder exploited for $239,000\n\nEther displays upside potential as Solana price shows weakness\n\nEthereum (ETH) price has spent the better part of December consolidating between the critical support at $ 2,147 and the $2,380 resistance level. Based on technicals such as the Relative Strength Index (RSI), the largest cryptocurrency may be poised to shine, at least for the short term.\n\nMeanwhile, the SOL market is exhibiting weakness, as the technical indicators hint at a possible dip in the Solana price. It comes after a prolonged period of SOL being massively overbought, indicated by the presence of the RSI above the 70 level since October 18, when the markets turned bullish. This preceded a correction.\n\nSOL/USDT 1-day chart, ETH/USDT 1-day chart\n\nEthereum price outlook with ETH shining at Solana’s expense\n\nAfter Solana price’s epic surge across the fourth quarter, the SOL market is taking a breather, with capital flowing into Ether. With this, Ethereum price looks ready to shine at the expense of Solana.\n\nThe RSI is northbound, suggesting rising momentum. The Awesome Oscillators (AO) indicator remains in the positive territory, adding credence to the bullish thesis. Increased buying pressure above current levels, therefore, could see Ethereum price rise, potentially flipping the $2,380 resistance level to a support before testing the $2,403 range high.\n\nIn a highly bullish case, the gains could extend for Ethereum price to tag the forecasted $2,500 psychological level, in a move that would constitute a 7% climb above current levels.\n\nETH/USDT 1-day chart\n\nOn the other hand, if the $2,380 roadblock holds as resistance, the ensuing rejection could see Ethereum price lose the critical support at $2,147, below which the bullish outlook would be invalidated. In the dire case, Ether market value could descend to test the supply barrier that now acts as a bullish breaker between $2,049 and $2,107.\n\nA break and close below the midline at $2,075 would confirm the continuation of the downtrend, with Ethereum price likely to spiral towards the $2,049 support, levels last tested in November."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTE5PaERSUUhpZlZrcmpEQk02VmZ4QzFRb0xOTU9tX0RqWnZYRjZtSVlYY2VjMGZZMV8yWHhzcW5GUXFqWHpoTzhBc09GYUJ3a3JXSVlwUHQ5eXJGMmgydldjbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Three privacy-focused Ethereum L2s arising in 2024 - Blockworks",
        "content": "Several crypto startups are looking to develop the first-ever privacy-centric Ethereum L2.\n\nOn Ethereum today, transactions and other smart contract executions are all publicly visible. Transparency is a core principle of blockchain technology, meant to allow verification of systems and instill confidence, but it can also be a double-edged sword.\n\n\n\nWhile transparency ensures accountability, it also means that the details of these transactions and contracts are exposed to everyone, including malicious actors and hackers who can analyze transaction patterns, identify vulnerabilities in smart contract code, and exploit these weaknesses for nefarious purposes.\n\nPrivacy solutions offer dapp developers the opportunity to build applications that shore up these shortcomings without compromising security.\n\nIn the process, these privacy-first applications must endeavor to prevent harmful actors from concealing their identities, while protecting the rights of law-abiding citizens. In short, to avoid the fate of crypto mixer Tornado Cash, which allegedly was used to launder over $455 million stolen by sanctioned North Korean hackers.\n\nRead More: Tornado Cash Developer’s Arrest Sparks Protest in Amsterdam\n\nHere are a few teams that are hoping to build a functioning privacy-centric L2:\n\nAztec\n\nAztec is a privacy layer of Ethereum. It’s referred to as a hybrid solution using zkSNARKs and its very own programming language, Noir, to offer private transfers, meaning that the network is designed to validate transactions without revealing any sensitive information about them, such as the amount and parties involved.\n\nUnlike other zero-knowledge (zk) rollups on Ethereum, Aztec combines private and public execution in one single zk rollup. Meaning that a user’s own device is responsible for encrypting the transactions before it is processed by the blockchain.\n\nIts primary focus, for now, is to design a platform for engineers to write private smart contracts without requiring in-depth mathematical knowledge of zk proofs. It recently revealed a new testing environment, Aztec Sandbox, for interested developers and plans for a testnet launch early next year.\n\nFhenix\n\nEncryption start-up Fhenix hopes to bring fully homomorphic encryption (FHE) to smart contracts.\n\nUnlike privacy startups that use zero-knowledge technology, where data must be moved off-chain and decrypted in order for a prover to verify its accuracy, FHE encryption performs computations directly on encrypted data.\n\nBy keeping data on chain, the network will have the capability to process computations that come from various sources, such as an on-chain poker game or a sealed-bid auction contract.\n\nFhenix launched a developer testnet in July and plans for a full-scale testnet launch of its FHE rollup in early 2024.\n\nCOTI\n\nCOTI is a privacy L2 building on Ethereum. Unlike Aztec, which uses zkSNARKS and Fhenix with FHE, COTI V2 will use so-called Garbled Circuits to enable private transactions.\n\nGarbled Circuits enable two different parties to evaluate information, even if they distrust one another. The parties can each submit their ‘garbled’ or encrypted inputs, computations are conducted on these inputs and an outcome is obtained.\n\nCOTI will launch a developer testnet V2 in Q2 of 2024, and its mainnet launch will come soon after.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]