[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQUi1zR09wTGVNcVFudlZGRG9CUk4zczJ1d013R0JuQkMzTVpUdUJLek9Vb1YyLXlCeHF3X1lYendady1uWFRVaDBCSjhvRDB2ZzdEdWxJdEs2YVlrY1RoU1VKVy1MSkpuVVgwZ1FZY1pyWW01T0RFaFVvUXpHaE4yY0VvTUFqRUk5aUJoMXFLQVlZUUJYWWszVFRyTGg2ZnYyb25WWW1PR2lEVDVDbDFQdVl3UEpBby1Hb3fSAb8BQVVfeXFMT3NyMW5sR21XUU5ySi1PZ1lrY2ZoVkdVY1ZFdXlXRDBSUHJJQkU3LVY0YTg4WXdYeWt6QkhZLXpLeFZrSVJqOGJKY3d5M2tfa1FwQ09Bd1poNUdNLUVEVFpkYUdfU1l5ajkzM2FQUlU0RzZ2OEJfNFVmblFENTI5RTU3dHJlMFlDMlJPU0kzbmEtNHpZVXNEUkRBb19mVEI2WU5sOU1ReU9OcWVfVXNoSHZnemMzYUR4bVNBYjc2bzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ether Could Hit $3,000 as Soaring Network Activity Turns Token Deflationary - CoinDesk",
        "content": "As a result of soaring activity on Ethereum, blockchain data shows that more ETH was burned than added to its supply over the past week, turning the token deflationary after two months of being inflationary."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQclhDNWZScDJRUHVWOTFKdTZpNmZiMWJUREtockktNTNvSllOMVN4bVV5andiTno5NHI2YzBORk1xaXZxZXhFWWxaRjRhUjNhUDF2VG9YYmdQR3V2Um1JcWM4VS16NVdPWERVZXZvVnEwSjhYdUszLUZPNjdnNGFyU19EVmU2YkFudXdlT21mLXhuSE8tQ295Nl91bmxLVFhJelZla3hzaEpONzZ4U191Zm0zRV9XeS1kWEhhWm1mMnd5d9IBxwFBVV95cUxNMnI4b3hvbjNaeVlJZWJkX3dyM2VFSUlRXzNVNG9ld0NNNnJmS1lVaHFoaEhGQUNVdUpZQXBDU19zNTlLU3h1Q09fdWVWU2RFamtJOG16NTVkdV8tN19UbGRINDR1WER4UDdtaTQyWUhpVTItNkprUlJUSU5GVVB4R1g4U1V2QjBKeTlnLWpIYlYzNVNRSkJJdDRKMExkck9CWlFLLW05V3ZRenI0WVplbmRtam9Qc3NONDVnbUZVQVhHWG9tN3hF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Banker Loses Access to $450,000,000 Worth of Ethereum (ETH) After Misplacing Wallet Keys: Report - The Daily Hodl",
        "content": "An Estonian banker has confirmed himself to be the owner of an Ethereum address with over 250,000 ETH worth nearly half a billion dollars – but says he lost the keys.\n\nIn a new interview with Vikerraadio in Estonia, LHV Bank founder Rain Lõhmus was asked about something he said years ago about getting into Bitcoin (BTC) and Ethereum in their early days but then losing access to his wallets.\n\nAsked if he ever found his keys, Lõhmus says,\n\n“No, and I haven’t made much effort either. It’s no secret that I have a wallet with 250,000 Ethereum units, anyone can calculate for themselves what it’s worth.\n\nInterviewer: That’s hundreds of millions?\n\nYeah, and I can’t solve this alone; if someone thinks they can, I’ll take all offers. My own best plan is to build Rain Lõhmus as an AI and see if he can get his memories back.\n\nLõhmus said the dangers of handling your own keys and seed phrases was one of the weak points of crypto.\n\n“I absolutely agree that this is a very weak point of this system, which makes you think that this perfect decentralization has other risks that you don’t usually think about. But it’s very common for me to lose passwords. I went to renew my ID card passwords today; if it were crypto, I’d be in a big crisis again, but luckily the police and border police work.”\n\nBased on the information shared by Lõhmus, on-chain analysts have identified his Ethereum address, and according to Etherscan, it is the fourth biggest holding of ETH excluding exchanges, the Ethereum Foundation, and the Wrapped Ether (wETH) address.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Tithi Luadthong/Natalia Siiatovskaia"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE93T1R0cEt4UGlHV1NYTVNUT3R4Nml2bWcwQnlxcFhkdTViNktFM0ZvWHB6eVZuOXlTakswZENjZ1JzOWJXOGxXSlE5ek1HQ2VKQ3ROM0wwTFFCZkR1Ynp2OWl3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Evmos hopes to lure Ethereum developers to IBC by deprecating Cosmos transactions - Blockworks",
        "content": "On the Cosmos-based EVM chain Evmos, Cosmos transactions and Ethereum transactions have been operating under different standards, leading to complications as these two types of transactions struggle to decode each other effectively.\n\nEvmos plans to relieve this technical headache by only supporting Ethereum-formatted transactions by 2024 Q3, it announced in a blog post Tuesday. Despite this strategic shift, the protocol emphasized that Evmos is not exiting the Cosmos ecosystem. Additionally, Evmos’ founder suggested that the move could help bring Ethereum developers to the IBC.\n\nEvmos functions as an Ethereum Virtual Machine (EVM) compatible blockchain that integrates the Cosmos IBC protocol, allowing it to operate as an EVM within the Cosmos network. Evmos raised $27 million via token sale in late 2022.\n\nRead more: Uniting the blockchain ecosystems: Q&A with Cosmos founder Ethan Buchman\n\nThe project’s co-founder Federico Kunze Küllmer said that by only supporting Ethereum transactions, Evmos hopes to make it easier for Ethereum developers to start working in Cosmos.\n\n“The wallets and the tools that they are already used to on Ethereum do not work easily on Cosmos,” Küllmer said. “We want to make it very easy for the developers and users that are already interacting with Ethereum wallets to interact with any Cosmos application specific blockchain.”\n\nThe Interchain Foundation, a non-profit focused on Cosmos adoption, made onboarding Ethereum developers a large part of its 2024 roadmap, Blockworks previously reported.\n\nIn the lead-up to fully embracing Ethereum-formatted transactions by Q3 2024, the protocol has committed to burning all Cosmos transaction fees during this interim period. This action will effectively remove these fees from circulation, signaling a shift towards revised token economics for the EVMOS token. Küllmer indicated that further details on the new tokenomics will be unveiled next week.\n\nEvmos (EVMOS) was worth around $0.07 at the time of publication.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOV2t1aHVOZzNXbzQ2cm1xYWNWZVFVdWlTMTNHV1lDdmI2MmRRNlB5THNBVVVaWHN0RlBfZEVOU3UtUUN6UENYYjVOMUtmSnl5MDZIU3QtSGV3Tm1yMC12VThjY2JxaVhZeEFsUW9QeTk2dV9ESmw3bUd6UWpMTFVlTW1zdDJvVHptWTJUT1pR0gGTAUFVX3lxTE5PeTlWb1JVV1VBVzJIa3ZnTlB0aUI0bERmX2d2Z2xHUkY5cDQ4VXFFWFdBM2RfNjh6SEg1MEZaOWNxRnZQeVpBMTNYUFNRN3M0SXhjSmVJbUx1OEtTYWItQW8zX1FxU195ZUp0TXdiX2VxUFBoQjJkNmJYZUxpanBBQk5DRTAxdXdsMDFmTi04bUItZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ethereum: Mysterious Owner of 250,000 ETH, Who Lost Wallet Keys, Revealed - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBlockchain sleuth @lookonchain has reported that the mysterious holder of 250,000 ETH acquired during the Ethereum ICO in 2014 has been identified.\n\nThe sleuth cited Coinbase's director of product strategy and business operations, Conor Grogan, on this issue. The latter is famous on Twitter for tracking huge sums of cryptocurrencies that were once lost by their owners.\n\nRain Lohmus, the founder of LHV Bank, received 250K $ETH from the #EthereumICO.\n\n\n\nThe cost is ~$77.5K, and now worth ~$473M.\n\n\n\nBut unfortunately, he lost the keys.https://t.co/PG2vALcDmU pic.twitter.com/ZPuexmdR1t — Lookonchain (@lookonchain) November 7, 2023\n\n$437 million in ETH locked dead over lost wallet keys\n\nData shared by Grogan in a recent tweet shows that he had managed to identify the unknown whale who acquired approximately $77,500 worth of ETH. This crypto, Grogan comments, has been completely untouched, and there has not been a single transfer made from it since 2014.\n\nAdvertisement\n\nThe owner turned out to be the founder of LHV Bank based in the Baltics, Rain Lohmus. Apparently, he has lost his private keys and has been unable to move his ETH or convert in into fiat.\n\nBy now, the ETH he holds is worth roughly $437 million – that is 5,333x growth.\n\nGrogan mentioned that if anyone can help him recover these hundreds of millions, he is willing to pay a generous reward for it: \"If you can help him recover them somehow, he's willing to split them with you.\"\n\nNearly 910,000 ETH lost forever in total\n\nSumming up his recent estimations, Conor Grogan stated that the overall amount of Ethereum that has been lost for good with very low chances of recovery now constitutes 886,000 ETH – that is more than $1.63 billion in the fiat equivalent.\n\nWith a few extra addresses added, the total amount of lost Ether rises to 909,800 ETH, worth more than $1.73 billion, or over 0.75% of the whole Ethereum supply circulating on the market.\n\nAdded a few extra addresses I've been meaning to (Incl. Prime Trust lost ETH) and we are up to 909,800 ETH worth $1.73B+ that are lost forever: 0.75%+ of all circulating supply pic.twitter.com/mb2XSqsQb2 — Conor (@jconorgrogan) November 6, 2023\n\nLargest ETH outflow from CEX observed\n\nAs reported by on-chain data vendor IntoTheBlock earlier, over the past week, a massive outflow of Ethereum was detected from centralized crypto exchanges – the largest outflow since August.\n\nIn total, more than $210,000,000 worth of Ethereum was moved to self-custody by investors. A likely reason for this is that investors plan to hold their ETH long term, which is best to do in one's own wallets rather than holding digital currencies on crypto exchanges.\n\nBetween Sunday and Monday this week, the second largest crypto, Ethereum, staged a minor growth of 3.13%, reaching the $1,914 level. However, within the last 24 hours, ETH failed to hold there or show a further rise. Instead, the crypto went down by 2.33%, now exchanging hands at $1,869 on the Bitstamp exchange."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOeGVzS2EwRjBMZUhibmxWcHdKbWFXOV81d3l2QXpJdk02d2dLMzgzYUJhTVZWSC1mUWEyQmhzNWRnSU5PY0hGdVdyMkxNeXNrempWMVJkRGt5WGJVQy11Q2xkWWpqbE1GOFF3UjdDTUZNcVJpYXV6TmR4aE8tQTlnaEZLMzE2MWs4aXdj0gGTAUFVX3lxTE4xWVBnZHBONzZ0eFhlcll2YmhnRXZJTjl3TWdvdW11ZVgyMnN0d05ldml4QThQOUpzb0RDd1RFY3pUNy0tMTNmSFNRTXdfT1pXUldaQXk1WGxySFNmZVBpOFF1aGkzcmptWklDRWZwSzFza3FMUF9uRHBvZjZXdTdsZ1hmQmpGQ2NGejNHd29WT2tNWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Rival Solana Is Back—Experts Say It's No Surprise - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSolana is once again the talk of crypto, and its native coin SOL is benefiting from the attention. The price of SOL is up over 9% today, hitting a 24-hour high of $44.41.\n\nOver the past 30 days, it has exploded in value by over 88%, according to CoinGecko—making it the biggest winner of all the major cryptocurrencies.\n\nAnd despite its association with the collapsed FTX crypto exchange and its criminally convicted founder Sam Bankman-Fried, experts say Solana’s recent rise shouldn’t come as a shock.\n\nWidely considered a competitor to Ethereum, Solana aims to be the go-to network for on-chain applications and experiences. Ethereum proponents argue that the leading smart contract network offers greater stability and security, but Solana is objectively cheaper and faster for those wanting to build or use lending protocols, games, and other applications that utilize blockchain technology.\n\nAD\n\nAD\n\nSolana gas fees right now stand at $0.000522; to make a transaction on Ethereum, it costs $6.58 on average.\n\nFor this reason, Solana has grabbed the attention of Visa, Shopify, and developers wanting to build on the network.\n\n“Solana adopts a streamlined approach, emphasizing high base layer throughput while simplifying the developer experience,” portfolio manager at Yield App Akash Mahendra told Decrypt, highlighting how much data can be processed by the blockchain.\n\nMahendra added that major partnerships and institutional interest are also helping drive up the price of SOL.\n\nAD\n\nAD\n\nIt wasn’t that long ago that Solana was getting a bad rep. FTX, once one of the biggest and most recognizable brands in the crypto space, was heavily invested in Solana.\n\nEx-FTX boss and co-founder Sam Bankman-Fried was a prominent Solana supporter, and the company invested in numerous Solana-related projects. FTX launched a marketplace for Solana NFTs, and even co-created Serum, which at one point was considered a foundation of the Solana DeFi space. At its peak in 2021, Solana commanded a market cap of $78 billion and boasted a $10 billion DeFi ecosystem.\n\nFTX then collapsed in a highly publicized bankruptcy while holding over $1 billion in SOL. The cryptocurrency plunged as a result.\n\nBut big players still see real value in the project.\n\nIn August, Solana’s payment protocol Solana Pay integrated with the e-commerce platform Shopify, allowing merchants to accept stablecoin USDC via the blockchain. This collaboration “capitalized on Shopify’s influential 10% share in the U.S. online retail sector, which translates to an estimated $444 billion in global transactions,” according to Mahendra.\n\nThen, payments giant Visa announced in September that it had chosen Solana’s blockchain for its stablecoin ambitions. This, according to Solana Foundation’s head of strategy Austin Federa, “validates the importance of the network’s unmatched speed and scalability.”\n\nThese two moves were seen as bullish by investors who have since been plugging fresh cash into the project. And things really picked up in the last month.\n\nPatrick Felder, founder & CIO at Prismatic Capital, told Decrypt this was because when Bitcoin and the broader crypto market started rallying, SOL was the most deeply oversold asset in the space following news that FTX’s new management might sell off large amounts of SOL.\n\nAD\n\nAD\n\nBut this, according to Felder, was “massively overblown” FUD (fear, uncertainty and doubt) and “triggered a massive short squeeze.” In the world of trading, a short squeeze is when the price of an asset shoots up unexpectedly due to short sellers (those who’ve bet on the asset going down) exiting their positions.\n\nThis happened with SOL, according to Felder, as many had bet on Sam Bankman-Fried’s FTX trial hurting the asset's price.\n\nThe Solana community’s annual conference, Breakpoint, took place at the end of October, leading to an even bigger rally, added Felder.\n\nThe irony is that at Breakpoint last year, the price of SOL had plunged by 60% in the week following the FTX crash. Spirits were low. But now, the coin has made a stunning comeback.\n\nAs always the question is, will it last?\n\nEdited by Ryan Ozawa."
    }
]