[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNYkQ3Q0pUVFF3TkpqZ1FKTDlYLVg1Sy1sNjRhUGNkVnpabnl0N1VUcEk1WUtpZ3dJdTRyajdPeUk1SVgyTEo3a01BOUpPc2hVS3oyU0JxNmRTYW1CZ2dqUTVvZG1hdkNLY3R1WlFSQmVVVnE1VndDMVhzVWhwazNOWmhUSEZpWlHSAY8BQVVfeXFMTzFwUGJUdFhwLVl3bU5hNTVGZ2lBcmxNd25rZUE4QzEzek5GODlVTnN4Q3lNbDBtLWFSbXREdnVkbEYtTGswT3F6dFE4bG1NT2o4TkpQdF8xTU9OUk11UThnT05xS0VvWU16bHRZSUJRQnlVS1VqeDFvckFCWHV2WGJ1ZTZLSm1xMXdYWUFfTEk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "NFTs Are Back? Sales Jump 32% in October, Led by Ethereum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto’s JPEG market is showing signs of life—despite mass layoffs at prominent marketplace OpenSea on Friday—as NFT trading volume grew by $99 million in October compared to the month before, according to a report released by crypto data firm DappRadar.\n\n“The yearlong downward trend in NFT trading has been broken,” DappRadar wrote, noting that NFT trading volume increased 32% from $306 million in September to $405 million last month. The firm described it as levels of sales not seen since August.\n\nNFTs are unique digital tokens that represent the ownership of an item, often digital art. While the market for NFTs was bubbly in 2021 and early 2022, this year has been tough for many profile picture (PFP) projects so far—as hype for collections like Yuga Labs’ Bored Ape Yacht Club (BAYC) chills amid a prolonged crypto winter.\n\nAD\n\nAD\n\nHowever, signs of warmth in the broader digital assets industry could be at play. The uptick in NFT trading volume came as the price of Bitcoin bounced above $35,000—touching its highest price in 16 months on anticipation that a spot Bitcoin ETF could be approved in the U.S. soon, analysts say.\n\nDappRadar’s report highlighted Solana as a notable network in terms of growth. NFT trading volume on the speedy layer-1 grew 15% from $24 million to $27.6 million, DappRadar reported. Meanwhile, the price of Solana itself surged 65% in October, jumping from $23 to around $38, according to CoinGecko.\n\nNFT trading volumes across a breadth of blockchains that support the class of tokens are captured in DappRadar’s report. And across all networks, a 50% jump in NFT trading volume on Ethereum—crypto’s second-largest coin—kept it “leading the pack,” DappRadar said.\n\nAs the flow of JPEGs grew in October, the floor price—or cheapest listed NFT on a secondary marketplace—for some popular PFP projects increased as well. For example, the floor price of NFTs from the aforementioned Bored Ape Yacht Club rose from $40,000 worth of Ethereum to around $55,000.\n\nAn uptick in the price of PFP projects boasting large market capitalizations was recently touched on by Punk9059, director of research at NFT startup Proof. “Uptober has arrived,” the pseudonymous researcher said on Twitter last week.\n\nAD\n\nAD\n\nWe've had 4 consecutive weeks of rising NFT volume. pic.twitter.com/GnuqmxA5xN — NFTstats.eth (@punk9059) November 3, 2023\n\nWhile DappRadar’s report could provoke WAGMI-like hopes among some NFT traders, $405 million in NFT trading volume throughout October is a paltry sum compared to the $2 billion in JPEGs that traded hands in March. Additionally, NFT sales continued to slump last month.\n\nDespite the rise in trading value, the overall number of NFTs sold in October slid by 5%, from 3.58 million in September to 3.4 million last month, DappRadar reported. Still, the decrease was less severe than when NFT sales fell by 290,000 in August.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNc3JWOWVzMGtjenJxV24wUk9LRjlrVVNqRjVTNnNSYllnUGc1LWFDMGtfM0NRMlVyYVNENnZndjhlbE15ZnlXY1VUV3RBTTFOTkRiZUpSUUNvY2ptUllJTUNXSWlmOS0zSzJWenh4YXNKM2toQTYyZC1tXzNwekdyS05sU21Fd2FUWTlUTkRVWHJaeC1LZENZLUtrX2VYa21ZRkhTdnloNUx3R0UyOG9jam5BQUNJZ3VHLXpMcXF0MHU3RGozTWRHMGFn0gHPAUFVX3lxTE5pUXVkbGUxazRvUFgtSi03bnNHYnRoUXh1a3pyYVM4WnhjanNidW9GekI2bXRtUmtaR2IzUWZLS2tPYXRseUpjdl82WjhkMW5BaDlyWHQ5aTBVZlk3YmlVNFBGVHJVcmo5SmZoRmVkR05MM3JkRzQ1TDMzTk9FalN6SGJrTkhFQkp5YlRtT3Y2RW45enBvbW0tYnU3N196X3dSSUhmNWFDdVBJdkg4cUdsS1dtN21wb3c1aDZOQUxiQ1A1dnZiUGRvdFUwd3Z6Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "Render price crashes by 8% following transition from Ethereum to Solana - FXStreet",
        "content": "Render price slipped to trade at $2.22 after a nearly 8% decline following the failed breach of $2.55.\n\nThe Render Network successfully completed upgrading its core infrastructure to Solana from Ethereum.\n\nRender Foundation, in accordance with the upgrade, allocated $2.5 million worth of RNDR as a reward to migrate RNDR tokens to the Solana blockchain.\n\nRender price exhibited a reaction opposite to market expectations after the Render Network achieved a milestone, upgrading from Ethereum to Solana. The network, seeing as to how the transition might affect its users, is assisting by granting subsidies using RNDR tokens.\n\nRead more - Breaking: FTX founder Sam Bankman-Fried found guilty on all counts, including stealing $8 billion from users\n\nRender moves to Solana from Ethereum\n\nRender Network, which is a blockchain and crypto-enabled protocol that enables individuals to contribute unused GPU power to help projects render motion graphics and visual effects, was launched on Ethereum back in 2017. But after six years, the project is moving from the \"home of Decentralized Finance (DeFi)\" to Solana, also known as the \"Ethereum killer\".\n\nThe move was touted to be a \"watershed moment\" for Render and seen as an attempt at capitalizing on the benefits of the Solana blockchain. Jules Urbach, the founder and architect of the Render Network, commenting on the transition, stated,\n\n\"Solana's incredible transaction speeds, low costs, and commitment to web-scale architecture make it a perfect fit for the Render Network as we continue building a scalable and decentralized metaverse infrastructure.\n\nIn the announcement, Render Network noted that the transition of assets from Ethereum to Solana is being facilitated by Wormhole. Furthermore, to ease the transition for its users, Render also stated that it has allocated up to 1.14 million RNDR worth about $2.5 million at the current price in grants.\n\nThis would be used to subsidize user transfer fees on Ethereum associated with the upgrade for up to three months.\n\nInterestingly, the market reacted much differently than what was expected out of RNDR.\n\nRender price takes a hit\n\nRender price at the time of writing, trading at $2.22, noted a 7.8% decline in the past day despite the historic milestone. The influence of the broader market cues trumped the impact of the network upgrade, resulting in RNDR falling through the support level at $2.26.\n\nThe altcoin is still in the bullish zone, as noted on the Relative Strength Index (RSI), albeit observing a downtick. If the investors' sentiment remains negative, a further downfall can be expected, which might bring RNDR down to $2.08 and RSI to test the neutral line at 50.0 as support.\n\nIf the broader market cues further push the Render price downward, losing the support of $2.08 is possible, sending the token to tag the support line at $1.91. This level is also coinciding with the 50-day Exponential Moving Average (EMA).\n\nRNDR/USD 1-day chart\n\nHowever, if the Render price bounces above $2.08, it could invalidate the bearish thesis. The confirmation of the same would be achieved when the RSI bounces off the neutral line. This would enable RNDR to reclaim the support at $2.26."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPSkt1VDY1cjJGdDU1N25CNG9RNXBXOW1VNzNfcnNlOVhlZDd1Q2MxTjRxX1hETF9jaURGdkF4UFV5ek15akhrY3FqeDkwekN0ZjF0MnZmcmVLVU05a0hsSGptSVBTYzZueXRKZDdJTmhsZGhwM1JzSzRFdmlsYm5GbVFDbk51bU1hXzVjVFl1azVqQlNOOS1yaTNlYXlCN2lXNHBNUjRuVUt2VVB2TVc4OWhYaUR1enk5aGxxR21jdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin's Golden Cross, Ethereum's And Dogecoin's Bellwether Indicator: A Look At Cryptos Into The Weekend - Nasdaq",
        "content": "Bitcoin (CRYPTO: BTC), Ethereum (CRYPTO: ETH) and Dogecoin (CRYPTO: DOGE) were trading relatively flat during Friday’s trading session on lower-than-average volume despite the general market surging following the Federal Reserve’s decision Wednesday to hold interest rates steady.\n\nThe three popular cryptos have been consolidating since Oct. 24, after Bitcoin, Ethereum and Dogecoin surged on hopes the Security and Exchange Commission is close to approving a spot Bitcoin ETF.\n\nFrom a technical analysis standpoint, the cryptos have been consolidating near highly important technical levels, with Bitcoin trading under strong resistance at the $36,000 mark and Ethereum and Dogecoin moving horizontally above the 200-day simple moving average (SMA).\n\nThe 200-day SMA is an important bellwether. Technical traders and investors consider a stock trading above the level on the daily chart to be in a bull cycle, whereas a stock trading under the 200-day SMA is considered to be in a bear cycle.\n\nThe 50-day SMA also plays an important role in technical analysis, especially when paired with the 200-day. When the 50-day SMA crosses below the 200-day SMA, a death cross occurs whereas when the 50-day SMA crosses above the 200-day, a bullish golden cross takes place.\n\nWant direct analysis? Find me in the BZ Pro lounge! Click here for a free trial.\n\nThe Bitcoin Chart: Bitcoin has been consolidating sideways on lower-than-average volume, while rejecting the important $36,000 mark on each attempt. The consolidation has been taking place on declining volume, which is often followed by a burst in high volume.\n\nThe sideways consolidation is helping to lower Bitcoin’s relative strength index (RSI), which has been trading above the 70% level since Oct. 19. When a stock’s or crypto’s RSI is above 70%, it’s considered to be overbought, which can be a sell signal for technical traders.\n\nBullish traders want to see Bitcoin’s RSI continue to lower and then for big bearish volume to come in and break the crypto up through $36,000, which could accelerate a move to the upside toward $40,000. Bearish traders want to see big bearish volume come in and break Bitcoin down below the eight-day exponential moving average, which would negate the crypto’s current uptrend.\n\nIt should be noted that a golden cross, which occurs when the 50-day SMA crosses above the 200-day, formed on Bitcoin’s chart on Oct. 29, which suggests the crypto is in a strong bull cycle.\n\nBitcoin has resistance above at $35,593 and at $38,105 and support below at $31,862 and at $31,418.\n\nThe Ethereum and Dogecoin Charts: Ethereum and Dogecoin have been consolidating sideways near the 200-day SMA, with Ethereum trading sideways above that area and Dogecoin under it. Both Ethereum and Dogecoin have been consolidating near the 200-day on decreasing volume, which like Bitcoin, indicates a larger move in one direction is on the horizon.\n\nWhile Ethereum is trading in an uptrend within its consolidating pattern, Dogecoin is trading in a tightening range, forming a triangle formation. If the cryptos break bullishly from their respective patterns, a more powerful move to the upside could be in the cards.\n\nBearish traders want to see Ethereum break down under the 200-day SMA and for Dogecoin to break down from the lower ascending trendline of the triangle. If either of those two things happens, downside pressure is likely to accelerate.\n\nEthereum has resistance above at $1,825 and at $1,937 and support below at $1,717 and at $1,615.\n\nDogecoin has resistance above at $0.069 and at $0.075 and support below at $0.065 and at $0.061.\n\nRead Next: Jack Dorsey's Block And Michael Saylor's MicroStrategy Are Both Big On Bitcoin — But Here's The Real Winner - MicroStrategy\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPSkt1VDY1cjJGdDU1N25CNG9RNXBXOW1VNzNfcnNlOVhlZDd1Q2MxTjRxX1hETF9jaURGdkF4UFV5ek15akhrY3FqeDkwekN0ZjF0MnZmcmVLVU05a0hsSGptSVBTYzZueXRKZDdJTmhsZGhwM1JzSzRFdmlsYm5GbVFDbk51bU1hXzVjVFl1azVqQlNOOS1yaTNlYXlCN2lXNHBNUjRuVUt2VVB2TVc4OWhYaUR1enk5aGxxR21jdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin's Golden Cross, Ethereum's And Dogecoin's Bellwether Indicator: A Look At Cryptos Into The Weekend - Nasdaq",
        "content": "Bitcoin (CRYPTO: BTC), Ethereum (CRYPTO: ETH) and Dogecoin (CRYPTO: DOGE) were trading relatively flat during Friday’s trading session on lower-than-average volume despite the general market surging following the Federal Reserve’s decision Wednesday to hold interest rates steady.\n\nThe three popular cryptos have been consolidating since Oct. 24, after Bitcoin, Ethereum and Dogecoin surged on hopes the Security and Exchange Commission is close to approving a spot Bitcoin ETF.\n\nFrom a technical analysis standpoint, the cryptos have been consolidating near highly important technical levels, with Bitcoin trading under strong resistance at the $36,000 mark and Ethereum and Dogecoin moving horizontally above the 200-day simple moving average (SMA).\n\nThe 200-day SMA is an important bellwether. Technical traders and investors consider a stock trading above the level on the daily chart to be in a bull cycle, whereas a stock trading under the 200-day SMA is considered to be in a bear cycle.\n\nThe 50-day SMA also plays an important role in technical analysis, especially when paired with the 200-day. When the 50-day SMA crosses below the 200-day SMA, a death cross occurs whereas when the 50-day SMA crosses above the 200-day, a bullish golden cross takes place.\n\nWant direct analysis? Find me in the BZ Pro lounge! Click here for a free trial.\n\nThe Bitcoin Chart: Bitcoin has been consolidating sideways on lower-than-average volume, while rejecting the important $36,000 mark on each attempt. The consolidation has been taking place on declining volume, which is often followed by a burst in high volume.\n\nThe sideways consolidation is helping to lower Bitcoin’s relative strength index (RSI), which has been trading above the 70% level since Oct. 19. When a stock’s or crypto’s RSI is above 70%, it’s considered to be overbought, which can be a sell signal for technical traders.\n\nBullish traders want to see Bitcoin’s RSI continue to lower and then for big bearish volume to come in and break the crypto up through $36,000, which could accelerate a move to the upside toward $40,000. Bearish traders want to see big bearish volume come in and break Bitcoin down below the eight-day exponential moving average, which would negate the crypto’s current uptrend.\n\nIt should be noted that a golden cross, which occurs when the 50-day SMA crosses above the 200-day, formed on Bitcoin’s chart on Oct. 29, which suggests the crypto is in a strong bull cycle.\n\nBitcoin has resistance above at $35,593 and at $38,105 and support below at $31,862 and at $31,418.\n\nThe Ethereum and Dogecoin Charts: Ethereum and Dogecoin have been consolidating sideways near the 200-day SMA, with Ethereum trading sideways above that area and Dogecoin under it. Both Ethereum and Dogecoin have been consolidating near the 200-day on decreasing volume, which like Bitcoin, indicates a larger move in one direction is on the horizon.\n\nWhile Ethereum is trading in an uptrend within its consolidating pattern, Dogecoin is trading in a tightening range, forming a triangle formation. If the cryptos break bullishly from their respective patterns, a more powerful move to the upside could be in the cards.\n\nBearish traders want to see Ethereum break down under the 200-day SMA and for Dogecoin to break down from the lower ascending trendline of the triangle. If either of those two things happens, downside pressure is likely to accelerate.\n\nEthereum has resistance above at $1,825 and at $1,937 and support below at $1,717 and at $1,615.\n\nDogecoin has resistance above at $0.069 and at $0.075 and support below at $0.065 and at $0.061.\n\nRead Next: Jack Dorsey's Block And Michael Saylor's MicroStrategy Are Both Big On Bitcoin — But Here's The Real Winner - MicroStrategy\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQakgyc0M1d3I0OFI5WGl5U0NGUkRWRzg1dFFxX05Obzd2MDYyWXpaTVVobXRLb3ViazhwdVFPOUNibC1VTl9WdFJFTVlKR2U3b0dqcDZlWVlRS3owbXhESWVOY2t1c21hVUVVSHROMFNRVzFFc1cyZWVRMm5KblVUSVpwdnV1aG91Yi1mNFc1X2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "Should You Buy Ethereum While It's Below $2,000? - The Motley Fool",
        "content": "There are two important reasons Ethereum could soar higher in 2024.\n\nDespite being up nearly 50% for the year, Ethereum (ETH 1.11%) seems to have fallen out of favor with investors. While other cryptos have been soaring in value of late, Ethereum has not. Currently trading at just under $1,800, Ethereum has repeatedly failed to surge past the $2,000 price mark this year and is now significantly underperforming Bitcoin (BTC 2.47%).\n\nAll of which makes Ethereum an intriguing investment right now. It's still the second-largest digital asset in the world (trailing only Bitcoin), and there are at least two good reasons Ethereum's price could start to move upward as we head into 2024.\n\nThe clear market leader\n\nFirst and foremost, Ethereum is still the 800-pound gorilla of the blockchain world. Ever since it pioneered the concept of smart contracts back in 2015, Ethereum has consistently been the first to market with just about every new blockchain innovation. And that has given Ethereum an enviable first-mover advantage in key areas such as non-fungible tokens (NFTs) and decentralized finance (DeFi).\n\nIn both areas, Ethereum is still the clear leader. For example, Ethereum is responsible for an eye-popping 54% of total value locked (TVL), arguably the single-best metric for measuring overall DeFi strength. No other blockchain even comes close.\n\nUntil rival blockchains, such as Solana or Avalanche, begin to chip away at Ethereum's market dominance at a faster pace, it's safe to say Ethereum will remain entrenched as the premier Layer 1 blockchain in the world. And that's exactly what I'm looking for in a long-term investment prospect: a clear market leader with an established track record of excellence.\n\nContinuous cycle of improvement\n\nEthereum's success to date has not been an accident. Ethereum boasts the largest developer network in the world, and these developers are highly focused on maintaining Ethereum's market-leading position. Case in point: Last year, Ethereum pulled off The Merge, one of the most difficult and complex technical achievements ever in the blockchain world. Some compared its difficulty to that of changing the engine of an airplane while mid-flight.\n\nWhat makes Ethereum particularly enticing to long-term investors is that it has a very detailed roadmap for future development. Even after The Merge, Ethereum has plans for new technical changes to its blockchain to boost performance, lower fees, and improve overall scalability. The next major upgrade (known as Dencun) is now tentatively scheduled for the first quarter of 2024 and has already received plaudits from Wall Street giant Goldman Sachs.\n\nWhy has Ethereum fallen out of favor?\n\nSo the obvious question becomes, \"If Ethereum is so great, why has it fallen out of favor with investors?\" While there are several possible explanations, the most likely is that The Merge may have over-promised and under-delivered. There was so much buzz and speculation surrounding The Merge that it couldn't possibly live up to the hype.\n\nInvestors woke up the next day to find that nothing really seemed to have changed with the Ethereum blockchain. Transaction processing times were faster but only marginally so. Transaction fees were still high, and there were still pressing questions about the future of staking on the blockchain (something Ethereum fixed in April). On top of all that, Ethereum founder Vitalik Buterin himself acknowledged that a lot of work still had to be done. So, The Merge wasn't some kind of magic rocket fuel that was going to send Ethereum soaring. That lack of immediate sizzle certainly disappointed a lot of investors.\n\nAdd in that many of the blockchain sectors that initially generated a lot of buzz for Ethereum -- such as NFTs and the metaverse -- fell out of favor with users, developers, and investors in 2022. And don't forget, the unprecedented rise of ChatGPT out of seemingly nowhere late last year led to a tremendous swing in investor sentiment. Suddenly, generative artificial intelligence (AI) became the talk of the investment world, and Ethereum admittedly didn't have much to offer in this regard.\n\nInvest in Ethereum for the long haul?\n\nFrom my perspective, Ethereum remains a great long-term investment play. Right now, investor sentiment seems to be at a low point, but that could change soon. Buying Ethereum now, while it's still below $2,000, seems like a fantastic bargain. You're getting a proven market leader at a discount price, combined with a potential catalyst (the new Dencun tech upgrade) to start off the New Year with a bang."
    }
]