[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOeXdNSzllMDRWWGZQSWFHNm9iNjFfdC12c01DeENIUi0wcXM0T3JSaXhfdTlvdGZPZGFyeFdBQl9UaHJVSmo3MFV0TVJfZjdfbWJicThEaFh4MFZNX2o3Zm1wUm4zdWl3aXV3WlgyQ29IUTRBRDg0Y3pPdFJRZ3NxNV9reW9oa0xleTlYMU50UlY5M0g4NWFhY2lvYWJqNldXaFE0YTJMZ1JJb1RfY1o0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "BlackRock files spot Ethereum ETF application with the SEC: CNBC Crypto World - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBlackRock files spot Ethereum ETF application with the SEC: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Jonathan Levin, co-founder and chief strategy officer at Chainalysis, discusses his testimony before the House Financial Services Committee on crypto's role in illicit finance."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOeXdNSzllMDRWWGZQSWFHNm9iNjFfdC12c01DeENIUi0wcXM0T3JSaXhfdTlvdGZPZGFyeFdBQl9UaHJVSmo3MFV0TVJfZjdfbWJicThEaFh4MFZNX2o3Zm1wUm4zdWl3aXV3WlgyQ29IUTRBRDg0Y3pPdFJRZ3NxNV9reW9oa0xleTlYMU50UlY5M0g4NWFhY2lvYWJqNldXaFE0YTJMZ1JJb1RfY1o0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "BlackRock files spot Ethereum ETF application with the SEC: CNBC Crypto World - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBlackRock files spot Ethereum ETF application with the SEC: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Jonathan Levin, co-founder and chief strategy officer at Chainalysis, discusses his testimony before the House Financial Services Committee on crypto's role in illicit finance."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQQklUa2t1LUh1djRMNDRURC02Vl9OQUpfbWd1endaLXlveEFwcE43ejJpZnVxMTFrYkZhaW5MX0xzXzRHUEoyNGFDZ0hCMnhmbm5QNHQxOG1fZ0JlcUdiTFlZZV9nNDZwcE5qV0sxWU5NWmZhU29LQ2NnSUVQVEZ5UmpGSjFoSmhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "SEC Receives BlackRock's Ethereum Spot ETF Application - Crypto Briefing",
        "content": "BlackRock brings legitimacy to Ethereum with new ETF filing.\n\nShare this article\n\nThe Securities and Exchange Commission (SEC) has received a registration statement on Form S-1 from BlackRock for an exchange-traded fund (ETF) that will hold ETH, the native token of the Ethereum network.\n\nAccording to the Form S-1, the iShares Ethereum Trust is structured as a Delaware statutory trust. It will hold ETH as its primary asset and issue shares to investors that will be listed and traded on Nasdaq.\n\nThe stated objective of the Trust is to reflect the performance of the price of ether. The Trust will value its ether holdings based on the CF Benchmarks Ether-Dollar Reference Rate index.\n\nThe sponsor of the Trust is iShares Delaware Trust Sponsor LLC, an affiliate of BlackRock, the world’s largest asset manager. BlackRock Fund Advisors will serve as the trustee, while Coinbase Custody, will act as the custodian for the Trust’s ETH.\n\nCoinbase will also serve as the prime broker for the Trust. According to the filing, the prime broker will facilitate the sale of the Trust’s ether as needed to pay expenses and fees.\n\nThe filing notes that the Trust may hold rights to acquire other digital assets through forks, airdrops, or similar events related to its ether holdings. However, the sponsor has discretion on whether to claim these assets.\n\nA substantial portion of the S-1 discusses various risks related to investing in the Trust and ether itself. These include volatility risk, security threats, regulatory uncertainty, and competition from other digital assets and blockchain platforms.\n\nThe SEC will now begin its review process to determine whether to approve the proposed ether ETF. The regulator has rejected several previous applications for spot bitcoin ETFs but has yet to rule on an ether ETF.\n\nThe official filing comes days after BlackRock registered the iShares Ethereum Trust entity with the Delaware Department of State Division of Corporations. Hours after the filing, Nasdaq also submitted a 19b-4 filing with the SEC, confirming that BlackRock is working on launching a spot ether ETF.\n\nBlackRock’s size and influence could help sway regulators towards finally approving a spot crypto ETF in the US. As the world’s largest asset manager with over $10 trillion in assets under management, BlackRock brings institutional legitimacy to the volatile crypto space."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFByMUR0Y2xXcXN1NC1SVmZiV3IyUW42Vmp3eDJQTFZFc0tTc05TWGpJWFQ1TldMSkphcnJ6bTd3WTJBV2hxUklNa1lxSTFBcFE2bXNYZllkTUdWY2U2OHRjTEh0MlFPU0libkVnRDZ4djk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "Ethereum won’t flip Bitcoin anytime soon, but Ordinals could change that - Blockworks",
        "content": "Bitcoin block space looks set to be the hottest commodity in crypto.\n\nBitcoin once again occupies more than half the entire crypto market, having outperformed ether by nearly double so far in 2023. Now, the long-prophesied “flippening” of ether over bitcoin is even further in the future.\n\nThe market currently values Bitcoin three times higher than Ethereum. Bitcoin’s market cap, at $727 billion, has swelled by $400 billion in 2023 — a figure bigger than Mastercard’s entire stock valuation and about twice that of Netflix’s.\n\nEthereum’s valuation has grown by $100 billion, jumping from under $145 billion in January to nearly $245 billion today.\n\nSome anticipate that Ethereum’s market cap will one day eclipse Bitcoin’s, despite the latter’s half-decade head start.\n\nThings were looking good coming out of the 2019 bear market and into 2021’s explosive bull cycle. DeFi summer and NFT mania boosted interest in Ethereum, at times driving up fees for certain actions beyond $250.\n\nBitcoin‘s market value was 925% of Ethereum’s — $130 billion to $14 billion — at the end of 2019 (bottom of the bear market).\n\nThat figure had shrunk to under 200% by the end of 2021 (peak bull market).\n\nBitcoin’s market value is now 300% of Ethereum’s.\n\nThe Bitcoin rally has widened the gap\n\nThe case for flippening has recently taken a hit by a different flip: The Bitcoin network now rakes in more fees than Ethereum for the first time since December 2020.\n\nOver the past four days, Bitcoin users have paid miners about $40 million to have their transactions processed.\n\nEthereum users, meanwhile, forked out less than $27 million ether (most of those fees have been burned, slightly reducing Ethereum’s overall supply).\n\nLayer-2 Ethereum networks Arbitrum and Optimism haven’t bridged that gap as they each generate less than $200,000 in fees per day right now.\n\nThe fee-flippening (flee-pening?) is awkward when you consider the sheer amount of use cases supported by Ethereum. Decentralized exchanges, DAOs, memecoins, NFTs, stablecoins, DeFi and GameFi all run atop Ethereum.\n\nRead more: Ethereum’s Justin Drake is unconcerned despite ether’s middling year pricewise: Q&A\n\nBitcoin, on the other hand, had for the longest time mostly had one application — bitcoin transactions. But the rate of on-chain transactions had until recently sustained very little growth since 2015. Perhaps due to its “digital gold” narrative and the rising ubiquity of alternative cryptocurrencies.\n\nOver the past five years, Ethereum users have paid $17 billion in fees, Bitcoin users just $2.9 billion\n\nAll that changed with Ordinals — a protocol for inscribing individual units of bitcoin (BTC) with unique data to create digital collectibles, first launched in January.\n\nMusic, text, art, video and even code for browser-based DOOM clones have since been inscribed to Bitcoin, resulting in an on-chain collectibles market worth thousands of BTC. Bitcoin users trade Ordinals as Ethereum or Solana users would trade NFTs.\n\nToday, anywhere from around a third to one half of Bitcoin transactions contain Ordinals, driving up demand for blockspace as well as transaction fees. At times today, “medium priority” transactions went for around $11 compared to around $2.30 for the same on Ethereum (more priority generally means faster processing), although those prices have since come down.\n\nTron comes in third overall for monthly fees, mostly thanks to stablecoin Tether\n\nSo is Bitcoin netting more fees than Ethereum good for Bitcoin? Maybe not.\n\nSome Bitcoin insiders worry the network isn’t properly equipped to handle Ordinals and potential influxes of interest in its original use case, BTC payments.\n\nThe CryptoKitties incident in December 2017 — during which a NFT game grew so popular that it spectacularly clogged Ethereum — first showed that Ethereum probably couldn’t handle serving as the “World Computer” just yet.\n\nThen, the 2021 bull market saw NFT mint costs soar to $250 at times — a reminder of how necessary it was to port activity to smaller chains, including rollups. Still, memecoins and low quality token projects ratcheted up fees beyond $20 earlier this year, drastically reducing Ethereum’s usefulness for non-critical tasks.\n\nThe NFT craze of 2021 made Ethereum block space the hottest commodity in crypto. Even while tanking its utility.\n\nOrdinals may end up having the same effect on Bitcoin, especially if demand keeps up and the bull market truly hits.\n\nAt that point, it would seem reasonable to value Bitcoin and Ethereum more similarly. It might just take another run.\n\nUpdated Nov. 16, 2023 at 4:25 pm ET: Corrected reference to percentages in bullet points.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBHeDJkdXFhTnFua2ZFMmNrcFp6dldvai1SYUlBTzNIcUg1MFk2YlFrSXdvNE40S1Npb2tBeEhlTWRQWGt0NTFYcTdTQWhzQW1zWmtQbGVxbm4ybjgtME9iRmZEQnRnanBt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "What Is Validium in Ethereum? A Beginner’s Guide - Unchained",
        "content": "Validium is an innovative addition to the suite of scaling solutions helping to solve Ethereum’s scalability challenges.\n\nValidium is a protocol that was introduced to improve scalability issues on the Ethereum network. In this guide, we look at what Validium is, how it works, and its benefits and challenges.\n\nWhat Is Validium?\n\nValidium is a Layer 2 (L2) scaling solution that leverages zero-knowledge proofs (zk-proofs) to verify off-chain transactions. Its primary goal is to enhance the scalability, privacy, and security of the Ethereum network.\n\nAt the solution’s core are sidechains or L2 solutions linked to but handling transactions separately from the Ethereum main chain. In this way, they move transactions off-chain and help ease transactional pressure on the Ethereum network.\n\nConsequently, users can enjoy faster confirmation times while moving more volumes. Furthermore, Validium significantly reduces gas fees due to the reduced computational overhead, as it doesn’t need to verify every transaction individually.\n\nHow Does Validium Work?\n\nValidium bundles sidechain transactions into batches and generates zk-proofs for each batch. Zk-proofs ensure the validity of the transactions and that the off-chain chain has been updated correctly.\n\nEvery sidechain has a validator responsible for aggregating transactions and generating zk-proofs, which are then submitted to the Ethereum mainnet for verification.\n\nIf the proof is valid, the verifiers update the mainnet record to reflect the changes that occurred in the sidechain.\n\nUse Cases and Applications of Validium in Ethereum\n\nValidium has several potential use cases and applications within the Ethereum ecosystem.\n\nDecentralized Finance (DeFi)\n\nDeFi protocols can use Validium to improve their efficiency and usability. For example, they can adopt the technology to create faster DeFi investment platforms with lower gas fees. This efficiency broadens the platform’s accessibility and enhances the user experience.\n\nGaming and NFTs\n\nValidium solutions can facilitate seamless in-game transactions and interactions with NFT marketplaces due to their low fees and faster confirmation times. This provides gamers and collectors with more enjoyable experiences.\n\nSupply Chain Management\n\nThrough Validium, manufacturers can set up more efficient and transparent supply chain management systems. They can track their consignments off-chain easily and cost-efficiently without overloading the blockchain with data.\n\nKey Benefits of Validium in Ethereum\n\nLet’s take a look at some of the key benefits Validium brings to Ethereum.\n\nEnhanced Scalability\n\nValidium can process thousands of transactions per second (tps), compared to the Ethereum mainnet’s 15-25 tps. This feature makes it ideal for high-throughput applications like decentralized exchanges and gaming platforms. Increased throughputs are crucial to Ethereum adoption as they guarantee timely transactions.\n\nPrivacy and Security\n\nValidium uses zk-proofs to verify transactions by allowing one party to prove to another party that they know something without revealing what the thing they know is. As such, zk-proofs provide an elevated level of security for transactions, ensuring that validators cannot cheat or steal user funds. Additionally, Validium improves privacy by excluding sensitive user data from the public Ethereum blockchain.\n\nLower Transaction Fees\n\nReduced computational overhead makes Validium settlements significantly cheaper than mainnet ones. This is a major benefit for users, making Ethereum more affordable.\n\nFaster Transaction Speeds\n\nDue to its off-chain processing, Validium operations are much faster than those on the mainnet. This is important for applications that require fast and reliable transactions, such as decentralized exchanges and gaming platforms.\n\nChallenges and Limitations of Validium\n\nDespite its benefits, Validium also has some challenges and limitations.\n\nCentralization of the Network\n\nUsers must trust the validator to process transactions correctly. This could lead to centralization concerns, as few validators could control a sizable portion of the network. Introducing a trusted third party contradicts the decentralization philosophy of cryptocurrencies.\n\nInteroperability and Compatibility\n\nIntegrating Validium with existing Ethereum smart contracts and protocols can be challenging due to potential data structure incompatibilities. Ethereum developers are working on ways to ensure seamless interaction between the mainnet and its sidechains.\n\nDependence on Data Providers\n\nThe technology relies on data providers to make off-chain data available. This dependence on them introduces an element of trust that runs counter to decentralization, a central tenet of cryptocurrencies.\n\nHaving external data providers also puts the data processed on the network at risk of hacking or unauthorized access by malicious parties.\n\nConclusion\n\nValidium is important in Ethereum’s journey toward scalability. Its ability to significantly improve transaction speeds, lower costs, and streamline operations is poised to redefine the network’s experience, with many developers seeking to integrate it into their products."
    }
]