[
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOdnFaakVHTm5VZHBOeEVBQkRmZEVpSnRxejRIdUphblVySmJCNFNZU3RhZkNJMnpValg1a0NWOUVqLWdkaVNWZ2V5QXBHQVh4SUZKM01ReDFRTmZPYVpxc1htLWx1aUxMUWRnZTI5MEZBT3ZMRTFhLWNuSjdyb3FEaTNQR1JjWm8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Coinbase Lists Pre-Launch Ethereum Restaking Protocol at $12.2 Billion Valuation - Yahoo Finance",
        "content": "Coinbase Lists Pre-Launch Ethereum Restaking Protocol at $12.2 Billion Valuation\n\nIn a recent development, Coinbase has listed the Ethereum (ETH) restaking protocol project, EigenLayer (EIGEN), for pre-launch trading. Coinbase’s announcement on X confirmed that EIGEN is now open for trading ahead of its official launch on Coinbase’s International Exchange and Coinbase Advanced. This is specifically for users in eligible jurisdictions outside of the US, UK, and Canada.\n\nDon’t Miss:\n\nThe exchange explained, “You can now trade EIGEN-PERP with up to 2x leverage. EIGEN opens with a price of $7.307 and an Implied FDV of $12.2 B.” EigenLayer enables ETH holders to re-stake their tokens for use as “cryptoeconomic security” for protocols other than Ethereum, in return for protocol fees and rewards. An example: if you staked $100 of ETH for 10 years at a rate of 5%, you would have $127. However, if you restaked the original ETH just one time for a total of $100 staked across 2 protocols for 10 years at a rate of 5%, you would have $154.\n\nThe pre-launch trading feature on Coinbase is a novel addition. It permits users to trade perpetual futures contracts on tokens that are yet to be launched. Once the underlying token is launched on relevant spot exchanges, the instrument transitions to a standard perpetual contract. Its accepted collateral/margins were listed as USDC, BTC, and ETH with a minimum order size of 10 USDC.\n\nHowever, Coinbase has also issued a warning to users about the increased risks associated with trading pre-launch digital assets. The exchange emphasized the need for users to fully understand the risks involved before trading contracts.\n\nThe listing of EigenLayer’s restaking protocol on Coinbase for pre-launch trading marks a significant step in the evolution of the cryptocurrency market. This move not only provides traders with an opportunity to engage in futures contracts on tokens that are yet to be launched, but it also reflects the growing acceptance and integration of Ethereum-based protocols in the broader digital asset ecosystem.\n\nFurthermore, the introduction of pre-launch trading on Coinbase could potentially pave the way for other exchanges to follow suit, thereby expanding the range of trading options available to cryptocurrency investors. However, it’s crucial for traders to heed Coinbase’s warning and fully understand the risks associated with pre-launch trading.\n\nStory continues\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Coinbase Lists Pre-Launch Ethereum Restaking Protocol at $12.2 Billion Valuation originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOdnFaakVHTm5VZHBOeEVBQkRmZEVpSnRxejRIdUphblVySmJCNFNZU3RhZkNJMnpValg1a0NWOUVqLWdkaVNWZ2V5QXBHQVh4SUZKM01ReDFRTmZPYVpxc1htLWx1aUxMUWRnZTI5MEZBT3ZMRTFhLWNuSjdyb3FEaTNQR1JjWm8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Coinbase Lists Pre-Launch Ethereum Restaking Protocol at $12.2 Billion Valuation - Yahoo Finance",
        "content": "Coinbase Lists Pre-Launch Ethereum Restaking Protocol at $12.2 Billion Valuation\n\nIn a recent development, Coinbase has listed the Ethereum (ETH) restaking protocol project, EigenLayer (EIGEN), for pre-launch trading. Coinbase’s announcement on X confirmed that EIGEN is now open for trading ahead of its official launch on Coinbase’s International Exchange and Coinbase Advanced. This is specifically for users in eligible jurisdictions outside of the US, UK, and Canada.\n\nDon’t Miss:\n\nThe exchange explained, “You can now trade EIGEN-PERP with up to 2x leverage. EIGEN opens with a price of $7.307 and an Implied FDV of $12.2 B.” EigenLayer enables ETH holders to re-stake their tokens for use as “cryptoeconomic security” for protocols other than Ethereum, in return for protocol fees and rewards. An example: if you staked $100 of ETH for 10 years at a rate of 5%, you would have $127. However, if you restaked the original ETH just one time for a total of $100 staked across 2 protocols for 10 years at a rate of 5%, you would have $154.\n\nThe pre-launch trading feature on Coinbase is a novel addition. It permits users to trade perpetual futures contracts on tokens that are yet to be launched. Once the underlying token is launched on relevant spot exchanges, the instrument transitions to a standard perpetual contract. Its accepted collateral/margins were listed as USDC, BTC, and ETH with a minimum order size of 10 USDC.\n\nHowever, Coinbase has also issued a warning to users about the increased risks associated with trading pre-launch digital assets. The exchange emphasized the need for users to fully understand the risks involved before trading contracts.\n\nThe listing of EigenLayer’s restaking protocol on Coinbase for pre-launch trading marks a significant step in the evolution of the cryptocurrency market. This move not only provides traders with an opportunity to engage in futures contracts on tokens that are yet to be launched, but it also reflects the growing acceptance and integration of Ethereum-based protocols in the broader digital asset ecosystem.\n\nFurthermore, the introduction of pre-launch trading on Coinbase could potentially pave the way for other exchanges to follow suit, thereby expanding the range of trading options available to cryptocurrency investors. However, it’s crucial for traders to heed Coinbase’s warning and fully understand the risks associated with pre-launch trading.\n\nStory continues\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Coinbase Lists Pre-Launch Ethereum Restaking Protocol at $12.2 Billion Valuation originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPeWx3UFB1UTRaZXRUZkVscnBMZnR4cFVFM0tlTk9QdV9zaEliUlVFRVBTTDUteHF0WXdiSzZZMFYya05HZDdPU2lZRElHYXpWOU1FdnliS21qZkhxclNpb2ppUXRTbTFDQXFiSU85bUZsZXBfb0hTcmtna2lKN0FjckJZN1U3TXpQbnRnRA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ultimate Crypto Guide: Bitcoin, Ethereum, and Furrever Token with Cutting-Edge 10% Referral Bonuses - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, June 20, 2024 (GLOBE NEWSWIRE) --\n\n\n\nAs we look to the future of cryptocurrencies, Bitcoin stands strong as a market leader, while Ethereum continues to captivate meme coin enthusiasts. Now, Furrever Token is poised to join the fray. This article examines what Furrever Token brings to the table alongside these giants.\n\nBitcoin Price Proceeds To Fall As Whale Activities Deepen\n\nBitcoin's price fell underneath $65,000 on Wednesday taking after Expanded whale exercises that will be offered orders. In the interim, hedge funds have experienced a drag in their Bitcoin introduction, which may be fueled by steady surges among Bitcoin ETFs.\n\nEthereum ETFs May Not Cause Upward Surge in ETH Price As Numerous Anticipate\n\nEthereum's (ETH) price expanded over 4% within the past 24 hours after the Securities & Exchange Commission (SEC) dropped its Ethereum 2.0 examinations in the midst of desires of spot ETH ETFs. In any case, the later energy encompassing ETH ETFs may not lead to the anticipated price increase.\n\n\n\n\n\nFurrever Token Stands Out with Innovative 10% Referral Program\n\nFurrever Token's presale has as of now raised over $1.3 million, with the venture right now in arrange 9 and pointing for an add up to of $1.9 million.\n\nFurrever Token offers a delightful client involvement centered around cat-themed symbolism and community-driven engagement. The unused referral framework permits clients to earn 10% in $FURR Tokens for each store made through their individual referral connection, making a fabulous opportunity for passive income. This framework not as it were incentivizes users but too cultivates natural community development.\n\nSupported by a comprehensive review from Securi Lab, Furrever Token guarantees a secure and reliable stage for its clients. The project's guide incorporates progressing integration of cat-themed substance and energizing future shocks, situating it as an interesting and agreeable speculation within the crypto space.\n\nDon't lose your opportunity to include Furrever Token to your venture portfolio and be prepared for the setup to rule the meme coin sector. Visit www.furrevertoken.com to secure your tokens and be a part of this crypto space.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nStory continues\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOb2tHYWE1VzE1RW9KZzdFakJjU2ZjWXpscHJNZ2h2MEUxU1R1LW5FUi1oMmpLYzBsTFhyb2JmRWxDb0RaXzhJZlEtbDZBLWJLbHU5ZzZfSFFhRGFZZWgxczhsVk1MUWhwczd4UDFzY1VYY2pOa0ZhOEtJUjFSblZNdXRhdWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "ChangeNOW Lists ZKsync's $ZK Token: Boosting Ethereum with Enhanced Scalability and Speed - Yahoo Finance",
        "content": "Kingstown, Saint Vincent and the Grenadines--(Newsfile Corp. - June 20, 2024) - ChangeNOW, a leading non-custodial cryptocurrency exchange platform, is thrilled to announce the listing of the highly anticipated $ZK token from ZKsync. Starting from June 19, users will be able to trade $ZK on the ChangeNOW exchange platform.\n\nFigure 1: ChangeNOW Lists ZKsync’s $ZK Token: Fast Transactions & Lower Fees for Ethereum Users\n\nAbout ZKsync and $ZK Token\n\nZKsync, developed by Matter Labs, is a pioneering Layer 2 scaling solution for Ethereum, leveraging zero-knowledge rollups to enhance transaction speed and reduce costs. Since its inception in 2019, ZKsync has been at the forefront of tackling Ethereum's scalability challenges, making it a popular choice for decentralized applications (dApps) and DeFi projects.\n\nThe $ZK token, which serves as the backbone of the ZKsync ecosystem, is designed to incentivize users, facilitate transactions, and secure the network. With features such as lower fees and faster transactions than the Ethereum network, $ZK aims to provide a seamless user experience on ZKsync-powered platforms.\n\nAirdrop Details\n\nThe $ZK token airdrop, set to launch on July 15, 2024, will distribute 17.5% of the total token supply, amounting to 21 billion tokens, to its users. The snapshot date to determine eligibility is June 30, 2024. Eligible participants include ETH holders, regular users of ZKsync, and those interacting with dApps built on ZKsync.\n\nListing of $ZK on ChangeNOW\n\nListing the $ZK token on ChangeNOW aligns with the commitment to offering users access to innovative and high-potential cryptocurrencies. ZKsync's technology and vision resonate with the mission to provide seamless and efficient trading experiences.\n\n\"We are excited to support ZKsync by listing the $ZK token on our platform,\" said Kate L, CMO of ChangeNOW. \"This listing reflects our dedication to bringing our users the best tokens in the market and supporting groundbreaking projects like ZKsync.\"\n\nTrading $ZK on ChangeNOW\n\nStarting June 19, users can exchange $ZK on ChangeNOW without the need for registration or limits, ensuring a fast and secure trading experience. Inviting all crypto enthusiasts to take advantage of this new listing and explore the benefits of $ZK.\n\nFor more information on the $ZK token listing, visit ChangeNOW's website.\n\nAbout ChangeNOW\n\nChangeNOW is a non-custodial cryptocurrency exchange platform offering fast, reliable, and user-friendly services for trading a wide range of cryptocurrencies. With a focus on security and customer satisfaction, ChangeNOW provides a seamless exchange experience without the need for registration or limits.\n\nStory continues\n\nStay connected for more updates and announcements.\n\nChangeNOW\n\nWebsite | Twitter | Telegram\n\nDisclaimer: Cryptocurrency trading involves substantial risk and may not be suitable for every investor. The value of cryptocurrencies can fluctuate widely, and there is a potential risk of loss. Always conduct thorough research and consult with a financial advisor before engaging in cryptocurrency trading.\n\nPR Contact:\n\nZEX PR WIRE\n\ninfo@zexprwire.com\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/213703"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPSDZwTkh2dWs5S2xReklET1RHNy1IUXZfLTJWLWg5c2FhSEVZM3c2VHdfUWwwVU1vVVBJVFRaclBzZ3BlU1FZRlAxNWR2YVdkUmhUMUZ0RS14RDQ4OTFTYndjX0xMTWpWclcybTgtSXZudkFIVHNWZGFTbmQweEhGQVVLclhfcldo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Shiba Inu ETF Speculation, Ethereum's $4K Potential, and Furrever Token's 10% Referral Award - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, June 20, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency advertise is energetic and ever-evolving, with certain tokens standing out due to their special advancements and promising prospects. As we move through 2024, Shiba Inu, Ethereum, and Furrever Token rise as the must-watch cryptos, each advertising unmistakable focal points and openings for financial specialists.\n\nShiba Inu (SHIB): Pointing for 3x growth\n\nShiba Inu (SHIB) is the driving ETH memecoin, continuing to advertise dominance in spite of Pepe's (PEPE) bullish runs. As one of the foremost prevalent animal memecoins, the dog-themed cryptocurrency is set to blow up within the moment half of the year as the Ethereum biological system skyrockets.\n\nIts bullish viewpoint is obvious in analysts' promising estimates, anticipating a 3x upswing some time recently as the shade closes on the year. This will broaden the hole between Solana memecoins and possibly beat trending memecoins like celebrity and president memecoins.\n\nAdvance contributing to its appeal is its low passage point—a budget-friendly altcoin. It may be a retail favorite as a result, which is able play a key part in its other bounce.\n\nEthereum Price Forecast\n\nConcurring to the most recent crypto news, the SEC might give the much-anticipated S-1 approval for spot Ethereum ETF on 2nd July. In the event that this happens, the Ethereum price forecast might ended up exceptionally bullish once the ETF goes live on conventional trades. Be that as it may, the savvy contract advanced resource ought to break out of the neighborhood bearish drift to begin with. This would cruel a recover of the $3,500 support level, as appeared within the taking after 4H chart.\n\nFurrever Token: Entry in the Crypto Market with 10% Referral Program\n\nIn the midst of the major players like Bitcoin and Ethereum, Furrever Token presents a revival and locks in turn to the crypto showcase. Outlined with a charming cat-themed environment, Furrever Token points to supply a delightful user involvement whereas advertising considerable monetary openings. One of its standout highlights is the modern referral program, which permits users to earn 10% in $FURR Tokens for each deposit made through their individual referral interface. This framework not as it were incentivizes community development but moreover makes a stream of inactive salary for users.\n\nThe continuous presale of Furrever Token has as of now raised over $1.3 million, with the extent as of now in arrange 9, pointing for an add up to of $1.9 million. Furrever Token's guide incorporates energizing future advancements, such as elite charming cat substance, guaranteeing nonstop engagement and rewards for its community. The project's commitment to security, approved by an audit from Securi Lab, assists in enhancing its credibility.\n\nStory continues\n\nDon't lose your opportunity to include Furrever Token to your venture portfolio and be prepared for the setup to rule the meme coin sector. Visit www.furrevertoken.com to secure your tokens and be a portion of this energizing meander.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    }
]