[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPLVQwclJFa21CVVR1ekNTYkxXUlJ0T2F0VGJOaTdCVWx3cjlVdnVXOXZiTVhkYUFtOXBkUG5KVG9iMUZmdEhpc0NOWFM1NEVHczkxOS1HSVY0VzJMYjhZcnpXdElBcjVGTTZxdDF6MzJVREpYTkpHNDZSZnVPNGdWclYyR0RHZUdBN1RlQ0trT0p3UmFIMWtNbtIBngFBVV95cUxOdlYzSm13WllHV1k5NXpsbGpSSTBZVVIyWnVYQkNzekpJVloyYnRzYzRFclh6TGJXTE0tLWwxUy0xNkVXZDI1UnJRRjZURWF3bmJFeWs2NzFiVlVTYUlWa3pObUxQeklKcXBNMkk2MVR3NzBXbE9ycjZtaWlxNnc5MTNYcFY1bHd4Uld4a0pGaTVZaEc1Y2Z5eFVZVnY4Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Taiko, an 'Ethereum-Equivalent ZK Rollup,' Raises $15M - CoinDesk",
        "content": "Taiko says it provides an \"Ethereum-equivalent ZK rollup\" – described by Ethereum co-founder Vitalik Buterin in a 2022 post as the holy grail of technological achievement for these scaling networks. A \"rollup\" is a term for a layer-2 chain, which acts like an auxiliary network to provide faster and cheaper transactions that can then be settled to a main or \"base\" blockchain like Ethereum. The \"ZK\" refers to \"zero-knowledge\" cryptography, a hot trend in blockchain design."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxOSXBDRjdKbmVNRGNSWE04a2l2RW1GcDdlajZkSzJxaHMzS3QwZk9vckR6bmNYcEEzMHkyMzhwelZyWlZuMTJESkpjaWE1MzVIWm8wazRKWjVTeHd6TW9kR0ZZcmVBR0NJc2ZmM0wxUUVZN1FMN0xXOHBPbm5FSEE2Tnh5Zl9kTFhWYS1XWm1XUFJDdjk1Z2Y2TjFXaVhsa2prYnpvSVdVZUNWUzFuZ2lIck5RNnpPYkpVZ0FqYlJsMFdMeGFmamQzdjNvYXkwU0JtLTJQRFhiYi3SAd4BQVVfeXFMT09NYnpuS2RneWtVWW92TEFOVElHZEdQdVg5dUpKdjI0WHZFdEdkTGg0OGFkWWNKMHVkUHhsYWNQVlJRMFVUNzBMclhndlg2b1pmQXFZdGJBbDZKQ3N0bDUtMWhoZWpiUGFBN3NIRWowdzM2Z1hfVldqUkdNUGR3cEhWQUNiSUhNTTRfcUhMM0FhY1Y4TkU2QmZFTHhZNlhBLXpVQThvMUEteVZDTUhhXzJyalRZQS00UENuTWtLdUMzeUd0Z2xzdkhvNk4yMDBDYlo2TUpudmVfZ0ttcGNn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Layer-2 Transaction Volumes Skyrocket in First Two Months of 2024, Says Analytics Firm IntoTheBlock - The Daily Hodl",
        "content": "Ethereum (ETH) layer-2 projects are on the rise, according to the crypto analytics firm IntoTheBlock.\n\nIntoTheBlock notes that Ethereum L2s have seen a 91% surge in transaction volumes since the beginning of 2024.\n\nThe analytics firm also notes that both ETH and Bitcoin (BTC) continue to fly off centralized exchanges.\n\nIn a new analysis, Lucas Outumuro, IntoTheBlock’s head of research, tracked the top two crypto assets’ weekly netflows, which measures the level of each asset moving in and out of centralized crypto exchanges by subtracting the amount of their withdrawals from their deposits.\n\nOutumuro notes that $906 million worth of ETH netflows left centralized exchanges, the smart contract platform’s 8th consecutive week of net outflows. IntoTheBlock interprets the movement of netflows off crypto exchanges as a potentially bullish sign for crypto assets.\n\nThe analyst also notes that $797 million worth of Bitcoin netflows left centralized exchanges in the past week.\n\nBTC is trading at $62,703 at time of writing. The top-ranked crypto asset is up by nearly 23% in the past seven days and nearly 42% since the beginning of 2024.\n\nETH is trading at $3,445.00 at time of writing. The second-ranked crypto asset by market cap is up by nearly 17% in the past week and more than 46% since the beginning of the year.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQNUdxSExGQ2pZTGF2U0xCWFkybVdqUnBodkdmSXlYQTFzX3lLRC1XWVlOWVBBYjZia2d2RTJDTm1wQjlLUnB1WVZ1Y0pieDNCYWstOHdQeUhfc3otbHdLS3JzZGQ0SHZmOTdmUzlLbWtZbjhNYXgwdnBYN19aYTI4Umg3WdIBiAFBVV95cUxONGtpc3RFSGZaNDJLd1d6ZTA1M2FTX2lWbGt4QVNBcXpQN2QteS1nRllsYjluRlNGdEJ3eVEwQ2FKcF9jdzdGN1J3NVhSWTlMTkp1UzVyWGp0dzNlNElHR3NTb2N0dVBHTTA2d2RGUjhTWHRZNnRTZHQtSldsLXF0LTBxQ0dQRTFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Ethereum’s latest milestone – What about ETH prices? - AMBCrypto News",
        "content": "Ethereum’s MVRV ratio now sits above 100%.\n\nThis marks its highest level since April 2022.\n\nEthereum’s [ETH] Market Value to Realized Value (MVRV) ratio has climbed to its highest point since April 2022, data from Santiment revealed.\n\nThe MVRV ratio assesses whether an asset is overvalued or undervalued. It does this by comparing the current market value of an asset to the average price at which all units were last moved on the blockchain.\n\nWhen it increases, it suggests that the current market value of an asset is significantly higher than the price at which most investors acquired their holdings.\n\nAt press time, ETH’s MVRV ratio was 103.11%, having risen by 145% since 25th January, per Santiment’s data. This rally coincides with the recent surge in ETH’s price, which recently surpassed the $3,400 mark, according to data from CoinMarketCap.\n\nWith an MVRV ratio of 103%, ETH’s current market price is 1.03 times higher than the average price at which all ETH units were last moved on the blockchain. Therefore, on average, most coin holders would realize at least 100% profit on their investments if they sold now.\n\nNo cause for alarm\n\nWhile readings from ETH’s Bollinger Bands indicator observed on a single-day chart revealed that ETH’s price remained prone to swings, other key indicators showed that bullish sentiments exceeded bearish activity.\n\nFor example, the coin’s Awesome Oscillator returned green upward-facing bars at press time. This indicator measures market momentum by comparing its short-term and long-term moving averages.\n\nWhen it returns only green bars, it indicates that the short-term moving average is rising faster than the long-term moving average. This suggests that the bullish sentiment is strong and gaining momentum.\n\nFurther, the coin’s Moving Average Convergence/Divergence (MACD) line (blue) rested solidly above the trend (orange) and the zero lines as of this writing.\n\nWhen readings from this indicator show the MACD and trend lines above zero (as is the case here), it suggests that bullish momentum is prevailing in the market.\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nOn the coin’s derivatives market, futures open interest totaled $11.38 billion as of this writing. The last time ETH’s futures open interest was that high was in December 2021, per data from Coinglass.\n\nWith the growth in the coin’s positive funding rates across exchanges, futures traders continue to place bets in favor of a price rally."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOdXk0dC1sNmpHWEpta2x1cGtIRnBORkUyRHdTZjdLcTVzT0ZlaGxMUkdKU2YyYk9QckE1UkhyYXZLTnR2aE1UWlhUTnBQQXU2M0tCRWxRN3lzRVpVbFRZYUk3b1huYnVibC1LNlhyMzB1cGViVDZWeFc5d2V1NWg3RkpHbmw1MVpOVUdtRXRpTTktUms4Ulk4RzBSdjBvSHdwX2RPYkxZZWpQNlA2RFpJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price to Break $4,000 After Bitcoin’s Latest Move? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOaGNRMzl6WUp6bF9HY0lza3NxX0NqTGRFbVNBT1FxLVFISW9CWXNsaVRPVTFYQk5sd0tHRk0wUEtIR0hnaWhWTUNkeUs3akJFaXJHWkdHR1FyX3p2anhfVTFHUlZiODFjaWk5Nzc5Q05VcnV5TElzOFpqR3hHNktCdtIBiAFBVV95cUxOaDNqMkhRTDB4NDFBbUs3ZF9fdVEzdEN4R281bHpyT2wyZnRxQWgwX3o1WmtsRUZDcmdrTXZEUXhuU3FBaDQxRUNHdXhGTFAxa1FRbFYyQWNYRjVJN1R3Z3VEYlRTV08zLVRQeFViZ3V0dmQ2c1A0dEFHSnc0QmNMOXBCVkkwZWdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Blast: 7 of the Hottest Projects and Airdrops on the Ethereum Scaler - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nJust two days after the launch of Blast, an Ethereum layer-2 network from the founder of dominant NFT marketplace Blur, hundreds of millions of dollars have flowed into newly created protocols living on the network—and buzz is growing about several other projects emerging in the ecosystem.\n\nThe network already boasts a total value locked (TVL) north of $2.4 billion, according to the Blast website. Many users have flocked to Blast in order to capitalize on future airdrops that may reward early users of applications and protocols within the network.\n\nAlready, clear winners have emerged, with some DeFi protocols receiving huge sums of investment, and other games and tokens garnering sizable attention on social media. Here’s a glance at some of the projects dominating Blast in its first days.\n\nOrbit Protocol\n\nAD\n\nAD\n\nWith a TVL of over $200 million, Orbit is currently the hottest DeFi protocol built within the Blast ecosystem. The protocol allows users to lend and borrow assets while remaining within Blast, and incentivizes users by letting them earn liquid rewards in the process. It also boasts its own native token, ORBIT.\n\nOrbit lending/borrowing and the $ORBIT token are now both live on @Blast_L2 mainnet🥮🚀 Heres how you can skip the endless points by earning liquid $ORBIT yield and owning your Blast allocation 🧵 Get started:https://t.co/Aikku3Tr77 pic.twitter.com/Xu5bpP3vl0 — Orbit Protocol 🥮 (@OrbitLending) March 1, 2024\n\nSpacebar\n\nSpacebar, which refers to itself as an “on-chain playground,” is a gamified platform on which users are encouraged to interact and engage with each other to earn various types of points. Users connect their profile picture (PFP) NFTs to the ecosystem to create an avatar, and also mint new NFTs within the Spacebar game world.\n\nSpacebar also incentivizes users to stake ETH within the platform to earn additional rewards. A major pull to the project appears to be the promise of an upcoming airdrop to early and active participants.\n\nDegens, we are live on @Blast_L2 with Phase 1 🧑‍🚀 If you're looking for the best playground to play and farm, you found your home. 🏡 In Phase 1, you can:\n\n- Choose a PFP NFT as your digital identity on Spacebar.\n\n- Mint a free Blast Protoship NFT.\n\n- Stake $ETH.\n\n- Refer friends.\n\n-… pic.twitter.com/6I1koiIpLX — Spacebar 🚀 (@spacebarxyz) February 29, 2024\n\nAD\n\nAD\n\nPac Finance\n\nThe first hybrid lending protocol to launch on Blast, Pac Finance facilitates both peer to peer loans, and peer to pool loans on the Blast network. The project includes features like self-repaying loans, one-click leverage trading, and instant lending loops. The platform is currently pledging quantities of Blast’s yet-to-launch native token, which it received after winning the blockchain’s “Big Bang” app development competition, to early adopters.\n\nPacMoon\n\nThe self-proclaimed “community meme coin” of the Blast ecosystem, PacMoon is a decidedly independent token project that took off this week to much fanfare. The token, PAC, has yet to launch—it will via airdrop at some point “soon,” according to the project’s team. But in the meantime, it has generated a frenzy on Twitter, where posts about the coin noticed by the PacMoon team are purportedly being rewarded with PAC allocations.\n\n1. Create content about PacMoon If we like or rt your post, you get $PAC. A rt will get you more $PAC than a like. You can stack likes and rts for more $PAC. — PACMOON (@pacmoon_) February 29, 2024\n\nZerolend\n\nAnother lending market on Blast, Zerolend incentivizes users to borrow and lend a range of tokens in exchange for rewards in ETH, BLAST, and ZERO, the protocol’s native token. Unlike Orbit Protocol and Pac Finance, Zerolend already exists on two other blockchains: Manta and zkSync Era.\n\nDistrictOne\n\nDistrictOne is a gamified, incentivized group messaging platform built on Blast. By liking messages and engaging with posts, DistrictOne users can collectively earn rewards and compete for jackpots. A key element of the ecosystem are “gems,” which are rewarded to users for high engagement, and earn them spots in weekly and ongoing airdrops.\n\n3. 🎮 Gamified Spaces\n\nD1 transforms group interactions into thrilling rallies with jackpots. Participate in daily sessions, support your favorite spaces, and stand a chance to win big. It's all about community power and shared success. pic.twitter.com/S6WCqCqMJe — DistrictOne (@DistrictOneIO) February 15, 2024\n\nJuice Finance\n\nJuice Finance is a protocol that enables levered cross-margin trading. Users can yield farm and spot trade on other Blast protocols through Juice, and in the process, lenders and borrowers can earn various rewards. Holders of certain Ethereum NFT projects, including Pudgy Penguins, Wassies, CryptoPunks, Azuki, DeGods, and RektGuy, are automatically eligible to claim the platform’s native Juice points. At writing, Juice has a TVL of nearly $35 million.\n\nAD\n\nAD\n\nThe Time is Now. Juice has officially launched on the @Blast_L2 Mainnet 🧃 Head over to https://t.co/hlbbCAMn6X to deposit & begin maximizing your Points 🚀 All Blast bridgers, Juice testnet users and many NFT holders are eligible to claim Juice points 🧵 pic.twitter.com/Ps36mkduY1 — Juice (@Juice_Finance) February 29, 2024\n\nEdited by Andrew Hayward"
    }
]