[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNeUxibmJQd1NvQWF1U2ZNWFB3ZVlUMF8zX194Y0R2WmJQRnFpTFo4UmI1ZTFmRzZ4M0ZmNGVLV3ZUaWZiVGlIUGhpa0JPaUNrTFpZdmFFaEt5NEZ5SE1uSnJWcjRaekdmY2dMc3Q4dmlIOURmOWF3RFNlZHFuWTBxT25WbkRxZzVsdXo4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Reddit invests in Bitcoin and Ethereum ahead of IPO - Yahoo Finance",
        "content": "Reddit, the popular social media platform, has invested in Bitcoin (BTC) and Ethereum (ETH) as part of its treasury management strategy.\n\nThe company’s initial public offering (IPO) filing with the U.S. Securities and Exchange Commission (SEC) on Feb. 22, also mentioned the acquisition of ETH and Polygon (MATIC) for virtual goods sales.\n\nReddit’s potential IPO is anticipated to be one of the largest tech IPOs of the year, although the company has not yet disclosed the number of shares to be sold or the price range for the offering.\n\nThe S-1 filing unveiled that select Reddit moderators and users could participate in its IPO via a directed share program, diverging from the norm of shares being predominantly bought by large institutional investors.\n\nReddit’s foray into the cryptocurrency market is part of a larger vision to integrate blockchain technology into its network of forums and discussions.\n\nThe social media platform has a history with blockchain technology, though not always successful.\n\nLast year, Reddit announced the shutdown of its community points program associated with its MOON cryptocurrency."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE1BZnlKMmFNNnBzTjJ0QlljeGFLRThEZHZyUXJLbThKdTgxLS1HN204OUYtdmRWei16ZTducHJtbGxmM19TYlkzT09vZUFHT05XZ3FQYUdOdUFmM2hIOUFGSVRuYUExS0Jld25seHRjSdIBdEFVX3lxTE04bEI2eGdub2RJdERUM05jOTloV1RjUDhkWUpodXh1cGxjdkdBNld0eXVwX1VUelRPS2N1LXJFbVl0VXVBbFZSRWNXbFRMOVVTVWpSbVlEWmlIT3ZmT2FFdDlmRjNIM0xjT2xmYkFOSllSX1FV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Dencun Upgrade Date Confirmed by Devs - U.Today",
        "content": "Almost all software clients are ready for Ethereum Dencun activation, says Galaxy researcher Christine Kim. Meanwhile, Ethereum (ETH) developers agreed on the first EIPs of Electra, a hardfork expected in late 2024.\n\nAdvertisement\n\nEthereum Dencun activation on March 13 confirmed\n\nDencun mainnet activation is scheduled for March 13; the timeline is confirmed by Ethereum All Core Developers Consensus Call #128 that happened yesterday, Feb. 22, 2024. All software clients except Lodestar are ready for mainnet Dencun release.\n\nquick notes from the eth dev call this morning, acdc #128:\n\ndencun 🐡\n\n- all client teams, except lodestar, have released final software versions for the dencun upgrade\n\n- these versions plus the dencun-ready candidate client for lodestar are currently being tested on one last… — Christine Kim (@christine_dkim) February 22, 2024\n\nUpdated software client versions together with Lodestar are currently being tested on one last testnet within the framewok of a so-called mainnet shadow fork. Meanwhile, Ethereum (ETH) devs scheduled more testing on the shadow fork over the next few days.\n\nDencun-ready MEV-Boost software will be released by the Flashbots team next week, Kim says. Prior to March 13, all node operators should upgrade their clients and MEV protection software.\n\nAs covered by U.Today previously, Dencun or Cancun-Deneb upgrade reconsiders the way data is being processed in Ethereum (ETH) to make it more resource-efficient.\n\nDevs started working on Electra, next major Ethereum hard fork\n\nDencun will introduce the Proto-Danksharding mechanism and \"blob\" data instrument to reduce the volume of data Ethereum (ETH) network needs to store.\n\nEthereans have started working on the Electra upgrade. The first version of the agenda includes three EIPs: EIP 6110 \"Supply validator deposits on chain,\" EIP 7002 \"Execution layer triggerable exits\" and EIP 7549 \"Move committee index outside attestation.\"\n\nEthereum Electra is the next major milestone in the Ethereum proof-of-stake (PoS) roadmap."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE80c01MTFBWdXp3YlJFNEZmWENraktsZGdTWF95UE5pSkNwNWhsSUo4ZnlFVGpFSWdTcTJfclgxd1NTVDQ4SEJBY0swZGRvLXQyZHRiNDlGTDFqbUE0bXBwUkFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Grayscale: Ethereum’s Dencun upgrade driving price upward - crypto.news",
        "content": "While a possible spot Ethereum ETF approval looms ahead, Grayscale experts believe an upcoming technological improvement is behind recent price upticks.\n\nGrayscale research analyst William Ogden Moore said in a Feb. 23 report that Ethereum’s Dencun upgrade has most likely triggered rallies in Ether (ETH) prices. According to CoinMarkerCap, ETH is up 34% in the last 30 days and 28% year-to-date per TradingView.\n\nEthereum’s Dencun upgrade, scheduled for March 13th, 2024, represents a major step forward and could help Ethereum compete in terms of scalability with faster chains in the Smart Contract Platforms Crypto Sector, such as Solana. We believe that recent price performance reflects the market’s anticipation of this upgrade. William Ogden Moore, Grayscale research analyst\n\nETH 30D price chart | Source: CoinMarketCap\n\nYou might also like: Coinbase calls on SEC to approve Grayscale’s spot Ethereum ETF\n\nDencun promises to uplift throughput and reduce transaction costs, allowing users to spend less gas fees and make more transactions on ETH’s mainnet and layer-2 scaling solutions like Arbitrum.\n\nDevelopers plan to achieve this key overhaul via proto-danksharding, introducing data blobs.\n\nMoore’s report suggests that Ethereum could seize greater smart contract business share from competitors like Solana if the network can offer cheaper fees. Moore opined that this might unlock a multi-billion market tied to real-world assets.\n\nIf Ethereum can simply become more competitive in throughput and cost, it could position itself to capture smart contract applications that demand high levels of security and censorship-resistance like stablecoins or tokenized financial assets. William Ogden Moore, Grayscale research analyst\n\nGrayscale’s bullish outlook on ETH and its blockchain complements the investment firm’s bid for a spot exchange-traded fund following its successful GBTC conversion last month. According to Yahoo Finance, the company hopes to do the same with its Grayscale Ethereum Trust (ETHE), which holds over $7 billion in assets under management (AUM).\n\nThe U.S. SEC delayed a decision on Grayscale’s application till May, along with several other issuers.\n\nETH YTD chart | Source: TradingView"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNeVVEcU5sZ1JWY1FLc1Rra0F5UFZuY09mYURTS0VRR1F2VmtrbGxJOURCcmI4UDJlZng3Zy1MUjhoMEtocFV0MFpnaGdJcTFMQVdJSzdGbE05UFo4TURjQURmYVFRZUZjbmxreWlDSGxLcTR4U20tNV9lal9FTDhTN0Vxcjc5TXMtU2NCWUVNOVpFQTZhUmFabFBB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "New Layer 2 Ethereum network soars past $128m in deposits in 24 hours - DLNews",
        "content": "Zircuit has attracted over $128 million in deposits within the first 24 hours since opening deposits.\n\nIt is backed by notable investors including Pantera, Dragonfly Capital, and Maelstrom, and introduces \"sequencer level security.\"\n\nZircuit allows for the staking of restaked and staked Ether.\n\nA new Ethereum Layer 2 network, Zircuit, enables the staking of restaked and staked Ether.\n\nYes, you read that right.\n\nOver $128 million has already been deposited in Zircuit since deposits opened in the last 24 hours, all before Zircuit’s mainnet has even gone live.\n\nZircuit is backed by Pantera, Dragonfly Capital, and Maelstrom and considers itself an Ethereum zero-knowledge layer 2 network. One of the key features Zircuit introduces is what it has dubbed, “sequencer level security.”\n\nZircuit monitors the mempool, the backlog of pending transactions on a blockchain, and searches for malicious transactions to prevent their inclusion in a block.\n\nEssentially, if a hack or exploit is detected, the Zircuit network has the ability to stop it in its tracks.\n\nDeposits now sit in a smart contract on Ethereum, and once the Zircuit mainnet goes live, users will have the option to migrate to the mainnet or withdraw at any time without penalties.\n\nUntil then, users can earn yield and points on their deposits. This includes the yield from Ether staking, EigenLayer points, liquid restaking protocol points, and Zircuit points.\n\nJoin the community to get our latest stories and updates\n\nFor users who want to experiment on Zircuit’s testnet, it is already live.\n\nEigenLayer is a new protocol within the Ethereum ecosystem that extends Ethereum’s security across blockchain networks by implementing restaking. The launch of the EigenLayer mainnet — the core blockchain infrastructure — is slated for the second quarter.\n\nZircuit accepts deposits in Ether, in liquid staking token stETH or in any of the following liquid restaking tokens: ezETH, rswETH, rsETH, and LsETH.\n\nThe largest depositor so far is wallet address, 1ef2, who has deposited over $22 million so far in stETH and rsETH tokens.\n\nPoints are part of a wider trend in crypto that generally precede a forthcoming airdrop. Users earn points, which are later migrated to tradable tokens in the future just by using these protocols.\n\nStaking restaked staked Ether\n\nStaking Ether secures the Ethereum network and offers users an annual percentage yield of 3%-4%.\n\nUsers can run their own node to stake, which involves a certain level of technical knowledge and at least 32 Ether, or they can use a liquid staking protocol like Lido that abstracts away the technical know-how and capital requirements of staking.\n\nRestaking Ether involves depositing a liquid staked token, like stETH from Lido, into EigenLayer, a buzzy new Ethereum protocol that extends Ethereum’s security to other blockchain networks through restaking.\n\nCurrently, because the EigenLayer mainnet is still not live, staked Ether that is restaked with EigenLayer, or one of the many liquid restaking protocols, does not earn any additional yield, but earns EigenLayer points. It is expected when EigenLayer’s mainnet is live, restaked Ether will earn an additional yield.\n\nAdditionally, these liquid restaking protocols offer their own points on top of the EigenLayer points.\n\nFinally, users can take their liquid restaked tokens, which are already earning the Ether staking yield, EigenLayer points, and liquid restaking protocol points and deposit them into Zircuit to earn Zircuit points. Or, users can choose to just deposit staked Ether.\n\nPoints are generally non-transferable, but one protocol, Whales Market, has opened up a secondary market for these points.\n\nPoints for EigenLayer have already seen over $2.1 million in total volume at an average price of $0.14, giving the estimated 1.7 billion points in circulation a market cap of $250 million.\n\nRyan Celaj is DL News’ New York-based Data Correspondent. Reach out with tips at ryan@dlnews.com."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOXzNFeEhacnU2dVd4QlJzYmJDZkNFcVVMMzlwWjd4VjJ2Z2NMbjM3eDVuMHFXRUhRamRBQklUNUFfR1RJUWZBcjEyYzNDM1N1NTg4cmdzcklabjY3Q0t5b2RyMEVrOGRRZlJfYTVmQlJOcl95QXRXaS1SSXJzQlRMMUh5TzVsMUFFQmM0ZWtCSEpYSW1KZmfSAZ4BQVVfeXFMTXAxUkstWjNJWG5sYXJLQ1VuSGZlU0FKSDI0d0JQN18tZVNzMnc3OWhGRklKVnhiUjFsNEhlRl9RMmRMdnJac3pUQjhvaldtcjY1MWE0MUV6RlRtWXY1YUtXd1hUWUw5bnk3eHhfcEFhU2NNSEFyV1RXSkxiX2xhaUV5Y2tlZXJCUm0xZU1KeVJDYS0teW91NFAyRl94Znc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "AI Tokens Resist Cooling Crypto Market as Bitcoin, Ethereum Wobble - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter a month of bullish activity, the broader cryptocurrency market is settling as the week draws to a close. Major currencies like Bitcoin and Ethereum are trading relatively flat, reflecting a pause in recent upward momentum.\n\nArtificial intelligence-linked tokens are still going strong, however, buoyed by the current momentum within the AI industry, which is sparking increased investor interest and activity in related digital assets.\n\nIndeed, after Nvidia's blockbuster earnings report this week, tradfi stocks related to AI tech are all on the rise: NVDA, AMD, and MSFT on the Nasdaq are all in the green for the week. Nvidia called it a “tipping point” for AI.\n\nBitcoin's current market position\n\nAD\n\nAD\n\nBitcoin opened the day at $51,252 but slightly decreased to around $51,134, marking just short of a 1% drop within the last 24 hours. This movement underscores a trading sideways period consistent since February 15, as Decrypt previously reported.\n\n\n\nThe cryptocurrency's current position below its EMA10 mark (the average price of the last 10 days) raises concerns about a strong correction. Closing the day under this critical threshold could suggest that bearish forces are gaining a foothold in the market.\n\nSome market indicators signal that a correction might already be underway.\n\nThe RSI—an indicator that measures the strength of bulls over bears in a market—was previously at an exceptionally high 80 points (meaning 8 out of every 10 traders were buying), but has decreased to 66 points. Although still high, this reduction suggests a shift towards a more balanced market dynamic and shows that traders are not as crazy about BTC as they were just a few days ago.\n\nThe convergence of Bitcoin's EMA10 and EMA55 points to a narrowing gap between short-term and long-term buying performance. This trend suggests a cooling off, where recent buyers (who bought BTC during the last 10 days) are not seeing the same returns as those who entered the market earlier (in the last 55 days). It also explains why the RSI is also dropping.\n\nAD\n\nAD\n\nIf this correction continues and the EMA55 crosses above the EMA10, it could mean that the correction may be turning into a bearish trend that leaves newer buyers facing losses.\n\nThe current market is weighing the potential impacts of recent spot ETF approvals and the upcoming Bitcoin halving. The halving has historically influenced Bitcoin's value, sparking a major bull run every four years, and could play a significant role in shaping future market trends.\n\nEthereum's market dynamics\n\nEthereum opened the day at $2,970 but has experienced a 1.4% drop, with its price adjusting to $2,947 by the time of this report. This movement reflects a stronger intra-day decline compared to Bitcoin.\n\nDespite a stronger bullish trend earlier, Ethereum has not maintained its momentum this week. The appearance of a Doji candlestick in yesterday's trading session indicates a potential shift in market dynamics.\n\nThe Doji descriptor is used when a candlestick is flat and has no body—in other words, the price doesn’t move during the session. Yesterday, ETH started the day at $2,967 and ended at $2,968, signaling indecision among traders.\n\nThis pattern indicates a balance between buyers and sellers, with neither side gaining significant ground, and suggests that Ethereum's dominant bullish trend may be weakening.\n\nEthereum's weekly performance remains positive, though, with a 6% gain over the last seven days. However, this growth is modest compared to the substantial increases seen in previous weeks. Last week, it spiked 14.89%.\n\nAD\n\nAD\n\nThe observed deceleration in Ethereum's value growth suggests a potential for minor corrections. These adjustments may be influenced by Bitcoin's market movements, as altcoins often follow the lead of the flagship cryptocurrency.\n\nFor long-term Ethereum holders, the current market conditions still present a bullish outlook. Despite the potential for short-term corrections, the overall trend supports holding onto the coin—for now.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    }
]