[
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNbmRDVHJvVHc0NmJpUnJzT1VqY1hJUGotbWlMOExZTy1MN0Fnem5reVlfRUExLWVsd1ZpSXFjaFJOVWU2VzlCTXNWUHh6eFBqbGkzamhFV2ZfT0xCdzNRRThURnZzcmx0MWg1aEd4cl9MR2dlQzFNT3lLcFhxSHk2dnV2eUZiSTZGVF9vSldfeTRpREZ4VWVwbHBxQXJZY1ZWNUwwanNFeUh6Mm8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Delta Blockchain Fund CEO: Ethereum Has Been Reliable - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQVFM3SktRcDhaZlBITUdqano5ODVPMWtMVXRSbXN0WUptdGx4ejhVS1hjMXhDRnhUcllHOEFCTXJ1UGs5VFhGaWI4RWFLTk9qWERhZ21xb0h2R3EtUHJDdHZOdng3Vmd0QlNCY2NObmNJWl9iYXhIZzdBZjB2NHFkNGwwT3VCNWVwZGtz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Remains Flat Following Historic Spot ETF Approval - Yahoo Finance",
        "content": "Ethereum Price Remains Flat Following Historic Spot ETF Approval\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, experienced relatively minor price movements, gaining 0.80% over the past 24 hours, following the surprising approval of eight spot Ether exchange-traded funds (ETFs). After the news of the ETF approvals broke, Ethereum's price briefly surged to $3,935, according to CoinMarketCap data, before settling down at $3,794. Although Ethereum has experienced a 28% surge in the last week, it remains 22% below its all-time high of $4,878, reached in November 2021.\n\nThe sudden approval of these ETFs by the SEC represents a momentous decision that paves the way for Ethereum trading to take place on Wall Street. The approved funds include the Grayscale Ethereum Trust, Bitwise Ethereum ETF, iShares Ethereum Trust, VanEck Ethereum Trust, ARK/21 Shares Ethereum ETF, Invesco Galaxy Ethereum ETF, Fidelity Ethereum Fund, and Franklin Ethereum ETF.\n\nThe availability of these ETFs allows everyday investors to purchase shares that trade on stock exchanges and track the price movements of Ethereum. This simplifies the process of buying, selling, and storing Ethereum for traditional investors who may find the world of digital coins and tokens daunting. ETFs are widely recognized and regulated investment vehicles that provide an accessible entry point into the crypto space without requiring extensive technical knowledge.\n\nThe approval of Ethereum ETFs marks a significant turn of events, as the U.S. Securities and Exchange Commission (SEC) had been silent on the matter for several months, leading many industry experts and analysts to anticipate a rejection. In a similar turn of events earlier this year, the SEC reluctantly approved 11 spot Bitcoin exchange-traded funds, leading to a surge in the price of the largest cryptocurrency to all-time highs of $73,750."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQVFM3SktRcDhaZlBITUdqano5ODVPMWtMVXRSbXN0WUptdGx4ejhVS1hjMXhDRnhUcllHOEFCTXJ1UGs5VFhGaWI4RWFLTk9qWERhZ21xb0h2R3EtUHJDdHZOdng3Vmd0QlNCY2NObmNJWl9iYXhIZzdBZjB2NHFkNGwwT3VCNWVwZGtz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Remains Flat Following Historic Spot ETF Approval - Yahoo Finance",
        "content": "Ethereum Price Remains Flat Following Historic Spot ETF Approval\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, experienced relatively minor price movements, gaining 0.80% over the past 24 hours, following the surprising approval of eight spot Ether exchange-traded funds (ETFs). After the news of the ETF approvals broke, Ethereum's price briefly surged to $3,935, according to CoinMarketCap data, before settling down at $3,794. Although Ethereum has experienced a 28% surge in the last week, it remains 22% below its all-time high of $4,878, reached in November 2021.\n\nThe sudden approval of these ETFs by the SEC represents a momentous decision that paves the way for Ethereum trading to take place on Wall Street. The approved funds include the Grayscale Ethereum Trust, Bitwise Ethereum ETF, iShares Ethereum Trust, VanEck Ethereum Trust, ARK/21 Shares Ethereum ETF, Invesco Galaxy Ethereum ETF, Fidelity Ethereum Fund, and Franklin Ethereum ETF.\n\nThe availability of these ETFs allows everyday investors to purchase shares that trade on stock exchanges and track the price movements of Ethereum. This simplifies the process of buying, selling, and storing Ethereum for traditional investors who may find the world of digital coins and tokens daunting. ETFs are widely recognized and regulated investment vehicles that provide an accessible entry point into the crypto space without requiring extensive technical knowledge.\n\nThe approval of Ethereum ETFs marks a significant turn of events, as the U.S. Securities and Exchange Commission (SEC) had been silent on the matter for several months, leading many industry experts and analysts to anticipate a rejection. In a similar turn of events earlier this year, the SEC reluctantly approved 11 spot Bitcoin exchange-traded funds, leading to a surge in the price of the largest cryptocurrency to all-time highs of $73,750."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOZjV5ZVFlUUxGSUdTbG1UTGpNN0xJMW8xOVhEZEdJbmUtNkVWZEc4OUZuamlMTExqNWgtNER5Ymd6cFNhX05sdnM1SVJENWJEWFA0cFlLcDZ6aW1DeFhDdTIxcDRIa0ZyVGpSN3ZycmdhNDhHMWQ3YWdUUnlUSlNRckY5Si1KZ00?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "SEC Changes Ethereum Rule, Sets Stage for ETF Approval - Yahoo Finance",
        "content": "SEC Renders Decision on Spot Ethereum ETFs\n\nThe Securities and Exchange Commission on Thursday approved a rule change that sets up proposed spot Ethereum ETFs for final approval.\n\nThe SEC must still approve the S-1 registration statements, but observers of the process have said such approvals are generally a formality.\n\nThe announcement on Thursday on the agency's website seemed unlikely barely a week ago and underscores the growing demand for cryptocurrency-based investments.\n\nThe decision affects funds proposed by VanEck, BlackRock, Fidelity, Bitwise, Ark 21 Shares, Grayscale. These new products will be based on the ongoing price of ether the native cryptocurrency of the smart contracts Ethereum blockchain. Existing ether-based ETFs are based on futures contracts.\n\n\"This approval order is based on all of the Exchanges’ representations and descriptions in their respective amended filings, which the Commission has carefully evaluated,\" the SEC said in the filing. \"For the reasons set forth above, including the Commission’s correlation analysis, the Commission finds that the Proposals are consistent with the requirements of the Exchange Act and the rules and regulations thereunder applicable to a national securities exchange\n\nEther fell about 5% since the announcement, to about $3,710 this morning after was recently trading hands at about $3,820 shortly after the SEC statement last night, according to crypto markets data provider CoinMarketCap. The second largest digital asset behind bitcoin in market capitalization has risen more than 30% over the past week with much of the gains coming after the SEC signaled a willingness to approve the rules change. In the days before Thursday's announcement, the agency asked issuers to amend the 19b-4 forms to address concerns about investor protections and regulatory oversight.\n\nThe updated applications have eliminated staking rewards, a high-risk strategy in which investors use ether as collateral to validate transactions on the blockchain.\n\nVanEck, Ark 21/Shares September Filings\n\nVanEck and Ark/21 Shares filed their spot Ethereum proposals on Sept. 6. Seven other issuers filed their applications in the ensuring seven months, including Grayscale, BlackRock, and Fidelity, whose slightly more than four-month-old spot bitcoin funds are the largest by assets under management. The 11 spot bitcoin funds have generated about $13 billion in inflows.\n\nDespite the spot bitcoin funds' success, investors and analysts doubted that the SEC would greenlight VanEck's and other spot ether-based funds—at least any time soon.\n\nStory continues\n\nThe agency had been concerned that spot Ethereum ETFs are vulnerable to market manipulation and fraud, which agency Chairman Gary Gensler has argued plage digital assets, and which presented an obstacle to spot bitcoin approvals. But amid robust demand and shifting political winds that have seen once crypto-shy Democrats join Republicans in support of digital asset-related investments, the SEC seemed to become more receptive to the products based on ether's price.\n\nGrayscale praised the decision in a statement.\n\n\"At Grayscale, we appreciate the opportunity to engage constructively with regulators as they review spot Ethereum ETFs, and we remain optimistic about the potential of bringing Ethereum further into the US regulatory perimeter in the ETF wrapper,\" a company spokesperson said.\n\nBut in a note to etf.com, Peter Eberle, president and chief investment officer of Lafayette, Calif.-based digital asset fund manager Castle Funds, wrote that he was \"surprised\" by the SEC decision and was uncertain about investor interest in the products.\n\n\"As a long-term investor in ETH, we stake our ETH, which earns us about 3%,\" he wrote. \"These ETF’s will not be allowed to stake.\"\n\nHe added: \"I also don’t believe that institutional investors need to add ETH to their portfolio since it is highly correlated to BTC. If they allocate 1-3% to crypto, do they really need both BTC and ETH? I am bullish on ETH despite my skepticism of ETH ETFS.\"\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOanFCZEtYTi1wbGY2cE4zN1FGdG5qSGdKSnd6SWdEVm5NZTh4UDE3U2ZGVjc5YU5QZFNCODB4bGZ6Y3FxWFV2M1JSUlhEaUFfeXphOVBKOHhXcFBadzk1MkRmY09hdUF2T19KTXNFRG9aTmEzU1lmS0ZUci1nVndiR1JRaUtsNGZnNWVNVnVhdlIwZGtvbzV4WTA2NU91VlB2aWg4anJaWUtuNTc5YjN6ZEIybVY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "With Ethereum ETFs Approved, Why Is ETH Not Going Up? - Benzinga",
        "content": "Ethereum ETH/USD enthusiasts were left scratching their heads this week after the long-awaited approval of a spot Ethereum ETF failed to ignite the anticipated price surge.\n\nWhat Happened: While many expected a repeat of Bitcoin‘s BTC/USD rise following similar ETF approval in January, ETH prices have remained relatively flat.\n\nThe SEC’s approval of the 19b-4 forms is a crucial step in the regulatory process but does not fully clear the path for ETF trading.\n\nThe S-1 registration statements, which provide detailed information about the ETFs to the SEC, must still be approved for trading to commence.\n\nThis approval is often seen as a formality, but the current political climate has added uncertainty.\n\nHowever, new information suggests the approval process might not be as straightforward as initially believed.\n\nGabriel Shapiro, co-founder of MetaLeX Labs, explains that only the 19b-4 forms were approved, not the S-1 registration statements.\n\nThis limited approval was made by the SEC’s Division of Trading and Markets under “delegated authority,” allowing any commissioner to challenge the decision within ten days.\n\nShapiro suggests this procedural move indicates an attempt to obscure the political nature of the vote.\n\nShapiro hints at a broader political strategy, suggesting the SEC’s actions are part of a “horse trade” to secure environmental, social, and governance (ESG) rules before a potential challenge by Donald Trump if he wins the 2024 election.\n\nThis complex backdrop contributes to the uncertainty surrounding the approval of the S-1 forms, which Shapiro believes are unlikely to be approved soon.\n\nHe describes the situation as “political progress” for crypto, similar to the Financial Innovation and Technology (FIT) Act.\n\nAlso Read: EXCLUSIVE: All You Need To Know About The FIT21 ‘Crypto Bill’\n\nMarket Reactions\n\nEric Balchunas, Senior ETF Analyst at Bloomberg, offers a counterpoint, expressing confidence that the S-1 forms will eventually be approved and downplaying the likelihood of significant challenges.\n\nHe attributes the lack of a price spike to the fact that the ETF approval was already anticipated by the market following earlier news.\n\n“S-1s will be approved, don't be silly… It prob didn't moon IMO bc approval was baked in already based on Monday's bombshell news,” Balchunas tweeted.\n\nScott Johnsson of Van Buren Capital questions the SEC’s strategy, arguing that using crypto regulations as leverage for ESG rules undermines the commission’s credibility and political strategy, especially if they fail to achieve their ESG objectives.\n\n“This is tough to square…they don’t get ESG rules and also lose all credibility that they actually intend to govern reasonably in a Biden second term,” Johnsson stated.\n\nStaking and Market Dynamics\n\nPranav Kanade, Investment Partner at VanEck‘s Digital Assets Alpha Fund, highlighted another crucial factor: the nature of ETH staking in the approved ETFs.\n\n“The ETH ETFs approved on May 23rd do not currently include staking, and all of the ETH held in these ETFs will remain unstaked. However, even if this were to change (via new staked ETH ETFs), the risk of staking concentration would be largely mitigated by three factors,” Kanade explained.\n\nHe pointed out that regulatory and compliance requirements would likely prevent U.S. ETF issuers from staking with dominant players like Lido.\n\nAdditionally, emerging staking protocols are already reducing Lido’s market share, and Lido itself is diversifying its node operators, minimizing concentration risks.\n\nLooking Forward\n\nThese developments highlight the intricate interplay between regulatory actions and political considerations affecting Ethereum’s market dynamics.\n\nInvestors remain cautious as they await further clarity on the full approval process.\n\nFor a deeper dive into the implications of these regulatory shifts and the future of digital assets, industry leaders and investors can join Benzinga’s Future of Digital Assets event on Nov. 19.\n\nThis event will provide valuable insights into the evolving regulatory landscape and investment strategies within the digital asset space.\n\nRead Next: Bitcoin Spot ETFs Record $108M Inflows While Ethereum ETF Potential Remains Uncertain\n\nImage: Shutterstock"
    }
]