[
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQeWVuQ0pkMl9McG5mcURObXFpTEdKWmFsODgwdThvWm1nT3FuU1lZM3BkX2szM3drbHkyOGd3VU1hNHhBMEdiX2wySWNVNV9iQk5oY3ZfNVhfTGpBRGVUamNBdUYyT2hYbU1jN3hqRENYUW91ZjV3VHBUazk0Q05ZT1ZZSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Odds of Ethereum Spot ETF Approval Are “Slim to None,” Says Bloomberg Analyst - Yahoo Finance",
        "content": "Odds of Ethereum Spot ETF Approval Are “Slim to None,” Says Bloomberg Analyst\n\nThe crypto world anxiously awaits the U.S. Securities and Exchange Commission's (SEC) pivotal ruling on the approval of a spot Ethereum ETF, scheduled for May 31st. As the deadline draws near, several factors have come into play, casting uncertainty over the decision's outcome.\n\nAt the center of the SEC's deliberations is a crucial question: whether Ethereum should be classified as a security or a commodity. This determination could significantly impact the fate of the spot ETF applications filed by various firms, including VanEck, ARK 21Shares, Hashdex, Invesco Galaxy, BlackRock, and Fidelity.\n\nIn a recent development, finance lawyer Scott Johnsson highlighted a concerning detail from a March filing by BlackRock regarding its spot Ether ETF application. The filing called for public feedback on whether the investment vehicle could be listed as a commodity, suggesting that the SEC might be exploring the possibility of labeling Ether (ETH) as a security.\n\n\"The obvious purpose is to potentially deny on the basis that these spot filings are improperly filed as commodity-based trust shares and do not qualify if they are holding a security,\" Johnsson stated in an X post.\n\nMixed Expectations and Market Reactions\n\nBloomberg's senior ETF analyst, Eric Balchunas, has expressed skepticism regarding the likelihood of approval, reflecting the general sentiment that the regulator might maintain a cautious stance toward cryptocurrency-related products."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQeWVuQ0pkMl9McG5mcURObXFpTEdKWmFsODgwdThvWm1nT3FuU1lZM3BkX2szM3drbHkyOGd3VU1hNHhBMEdiX2wySWNVNV9iQk5oY3ZfNVhfTGpBRGVUamNBdUYyT2hYbU1jN3hqRENYUW91ZjV3VHBUazk0Q05ZT1ZZSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Odds of Ethereum Spot ETF Approval Are “Slim to None,” Says Bloomberg Analyst - Yahoo Finance",
        "content": "Odds of Ethereum Spot ETF Approval Are “Slim to None,” Says Bloomberg Analyst\n\nThe crypto world anxiously awaits the U.S. Securities and Exchange Commission's (SEC) pivotal ruling on the approval of a spot Ethereum ETF, scheduled for May 31st. As the deadline draws near, several factors have come into play, casting uncertainty over the decision's outcome.\n\nAt the center of the SEC's deliberations is a crucial question: whether Ethereum should be classified as a security or a commodity. This determination could significantly impact the fate of the spot ETF applications filed by various firms, including VanEck, ARK 21Shares, Hashdex, Invesco Galaxy, BlackRock, and Fidelity.\n\nIn a recent development, finance lawyer Scott Johnsson highlighted a concerning detail from a March filing by BlackRock regarding its spot Ether ETF application. The filing called for public feedback on whether the investment vehicle could be listed as a commodity, suggesting that the SEC might be exploring the possibility of labeling Ether (ETH) as a security.\n\n\"The obvious purpose is to potentially deny on the basis that these spot filings are improperly filed as commodity-based trust shares and do not qualify if they are holding a security,\" Johnsson stated in an X post.\n\nMixed Expectations and Market Reactions\n\nBloomberg's senior ETF analyst, Eric Balchunas, has expressed skepticism regarding the likelihood of approval, reflecting the general sentiment that the regulator might maintain a cautious stance toward cryptocurrency-related products."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFB4NkZVZ0NHQXJaMzN2V3JFQXNhYjZvZy1YU1VieHlzSENNRXZ6MjdyNWV4cmZsR21Ra1pLOHV6alNQYmtBaFdhSExremtrQzlyNXNJZlpVU1Z4cVVPeUNreFEtSXI1VVR3U3VBWU9ucFoxMXd1M09sRWFQMHBPQXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "ARK 21Shares Amends Spot ETH ETF Filing: Cathie Wood On Ethereum ETF Approvals - Yahoo Finance",
        "content": "ARK 21Shares Amends Spot ETH ETF Filing: Cathie Wood On Ethereum ETF Approvals\n\nIn January, ARK Invest teamed up with 21Shares to offer a spot bitcoin ETF, which trades as ARKB. The ETF has been hugely successful, attracting several billion dollars in investment. However, the duo is not content with just a spot in a bitcoin ETF. They have also applied for a spot in ethereum ETF, which is currently under review by the SEC.\n\nDon't Miss:\n\nAccording to Cathie Wood, holding 6 Ethereum (ETH) could make you a millionaire, here’s why it can be true .\n\nBitcoin has jumped another 45% already this year – how much would you need to get started today?\n\nThough they did not make a formal comment, ARK and 21Shares updated their filing for the spot ethereum ETF application. The update removed a small clause related to staking. Originally, the firms were looking to stake ETH that was held by the firms, which would have been labeled as income from the fund. \"Sponsor may, from time to time, stake a portion of the Trust's assets through one or more trusted Staking Providers,\" the clause noted.\n\nHowever, the update excluded this clause. While they did keep all of the other clauses specific to ethereum, the change caused some to raise eyebrows. Eric Balchunas is an ETF analyst for Bloomberg and in a post on X, he said, \"While it may seem like this is them getting their docs in shape based on SEC comments (which would be good news) there hasn't been any comments. So it’s prob either a Hail Mary or maybe trying to give SEC one less thing to use in their rejection. Not sure (yet).\"\n\nAccording to Balchunas, the SEC did not prompt ARK and 21Shares to make the change. So, in his opinion, it is some sort of preemptive action to give their application a higher probability of acceptance.\n\nTrending: 1 in 4 Americans own a share of Bitcoin according to NASDAQ, how much would $10 get you today?\n\nThe issue of staking has been seen by some as a hang-up for potential approval of spot ethereum ETFs. The novelty of the system could cause further delays in the already lengthy decision-making process by the SEC. So, by leaving it out of the application, ARK could improve its chances of approval. However, this does come at the cost of having a less attractive ETF, as the staking rewards would not be earned.\n\nThe SEC has already made delays to decisions on multiple applications. As it stands, the final date for a decision on the VanEck ETH ETF application is May 23, followed by ARK 21Shares' on May 24th.\n\n\"Our odds of approval remain the same: slim to none,\" Balchunas said in a post on X.\n\nCathie Wood is the CEO of ARK Invest and is known to be extremely bullish on cryptocurrency. However, even she acknowledged that the crypto ETF market may not see much more growth. \"We'd be surprised to see anything but bitcoin and ether being approved by the [U.S. Securities and Exchange Commission],\" she said in an interview.\n\nStory continues\n\nThe case for a spot ethereum ETF is getting weaker, and the SEC has not spoken often on the topic. While there is certainly a possibility that the ETFs could receive approval in late 2024 or 2025, it seems unlikely that they will occur anytime soon.\n\nRead Next:\n\ncrypto digital assets\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article ARK 21Shares Amends Spot ETH ETF Filing: Cathie Wood On Ethereum ETF Approvals originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFB4NkZVZ0NHQXJaMzN2V3JFQXNhYjZvZy1YU1VieHlzSENNRXZ6MjdyNWV4cmZsR21Ra1pLOHV6alNQYmtBaFdhSExremtrQzlyNXNJZlpVU1Z4cVVPeUNreFEtSXI1VVR3U3VBWU9ucFoxMXd1M09sRWFQMHBPQXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "ARK 21Shares Amends Spot ETH ETF Filing: Cathie Wood On Ethereum ETF Approvals - Yahoo Finance",
        "content": "ARK 21Shares Amends Spot ETH ETF Filing: Cathie Wood On Ethereum ETF Approvals\n\nIn January, ARK Invest teamed up with 21Shares to offer a spot bitcoin ETF, which trades as ARKB. The ETF has been hugely successful, attracting several billion dollars in investment. However, the duo is not content with just a spot in a bitcoin ETF. They have also applied for a spot in ethereum ETF, which is currently under review by the SEC.\n\nDon't Miss:\n\nAccording to Cathie Wood, holding 6 Ethereum (ETH) could make you a millionaire, here’s why it can be true .\n\nBitcoin has jumped another 45% already this year – how much would you need to get started today?\n\nThough they did not make a formal comment, ARK and 21Shares updated their filing for the spot ethereum ETF application. The update removed a small clause related to staking. Originally, the firms were looking to stake ETH that was held by the firms, which would have been labeled as income from the fund. \"Sponsor may, from time to time, stake a portion of the Trust's assets through one or more trusted Staking Providers,\" the clause noted.\n\nHowever, the update excluded this clause. While they did keep all of the other clauses specific to ethereum, the change caused some to raise eyebrows. Eric Balchunas is an ETF analyst for Bloomberg and in a post on X, he said, \"While it may seem like this is them getting their docs in shape based on SEC comments (which would be good news) there hasn't been any comments. So it’s prob either a Hail Mary or maybe trying to give SEC one less thing to use in their rejection. Not sure (yet).\"\n\nAccording to Balchunas, the SEC did not prompt ARK and 21Shares to make the change. So, in his opinion, it is some sort of preemptive action to give their application a higher probability of acceptance.\n\nTrending: 1 in 4 Americans own a share of Bitcoin according to NASDAQ, how much would $10 get you today?\n\nThe issue of staking has been seen by some as a hang-up for potential approval of spot ethereum ETFs. The novelty of the system could cause further delays in the already lengthy decision-making process by the SEC. So, by leaving it out of the application, ARK could improve its chances of approval. However, this does come at the cost of having a less attractive ETF, as the staking rewards would not be earned.\n\nThe SEC has already made delays to decisions on multiple applications. As it stands, the final date for a decision on the VanEck ETH ETF application is May 23, followed by ARK 21Shares' on May 24th.\n\n\"Our odds of approval remain the same: slim to none,\" Balchunas said in a post on X.\n\nCathie Wood is the CEO of ARK Invest and is known to be extremely bullish on cryptocurrency. However, even she acknowledged that the crypto ETF market may not see much more growth. \"We'd be surprised to see anything but bitcoin and ether being approved by the [U.S. Securities and Exchange Commission],\" she said in an interview.\n\nStory continues\n\nThe case for a spot ethereum ETF is getting weaker, and the SEC has not spoken often on the topic. While there is certainly a possibility that the ETFs could receive approval in late 2024 or 2025, it seems unlikely that they will occur anytime soon.\n\nRead Next:\n\ncrypto digital assets\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article ARK 21Shares Amends Spot ETH ETF Filing: Cathie Wood On Ethereum ETF Approvals originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOZ1JaZkNTczZGSTNFYjA5d2pnQUdOUVd3RTlwVHJXUHVEU1NmakNmUUFwMWdSWURnODlFakdRQ3FCb3JJSGFNelRwUVdGUU5vbHZIYnlXVzZiT0Jhd3ZsRWpsMFdISVY3S0p4anZ0elpYcTdYcUJYdHZCUDgyaUdRQjQ2VnozNl9ybnF5ekZOTHBwZDhFN2RrNUs3VGxGbGU5RVNLQ0N0OVpwSXdCUklSRExyONIBuAFBVV95cUxPOFMtNmd5WmhWM0VRZWtjSWNMMEVHWjFMZ29weTN4V1c5NEkwMklOUXljV0pXa0diaWdCUmw5NDBKcVpkZmR5VDlPcDRZU2VNV3B0TVBvXzhwa3J6SXJXam11VzFfTWt4eUU2ZEFLVnlySG1Sc1N1Y1hKbmVsaW9oa2U3S2I4QVA1NnlfZExQODVLYXpGY0N3a0MxanZVRmFzd1duNWx5cHRZMXNhcTFhclRXTXlWSlRi?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Justice Department charges MIT brothers with $25 million crypto theft that took 12 seconds - CNBC",
        "content": "The Department of Justice on Wednesday announced the indictment of two brothers who graduated from the Massachusetts Institute of Technology for allegedly stealing $25 million in cryptocurrency within roughly 12 seconds.\n\nThe DOJ said the brothers —James Peraire-Bueno and Anton Peraire-Bueno — plotted the \"first-of-its-kind\" crypto fraud involving Ethereum blockchain over several months.\n\nTheir father is Jaime Peraire, the H.N. Slater Professor in Aeronautics and Astronautics at MIT and a former head of the university's Department of Aeronautics and Astronautics.\n\n\"We are in shock, we don't even know what's going on,\" Jaime Peraire told CNBC when contacted at his home in Massachusetts, and asked about the arrest of James, 28, and 24-year-old Anton.\n\nPeraire declined to comment further.\n\nProsecutors said that Peraire-Bueno brothers allegedly identified a vulnerability in the Ethereum blockchain that allows outsourced bots to identify the most valuable pending crypto transactions before adding them to the blockchain, according to the indictment.\n\nThey then allegedly posed as the Ethereum validators that use those bots and redirected the pending transactions to steal the $25 million, the indictment said. Foreign law enforcers allegedly froze roughly $3 million of those funds, but the two men converted the unfrozen money to the DAI crypto token, which is pegged to the U.S. dollar, the DOJ said.\n\nThe Peraire-Buenos also allegedly set up shell companies and used multiple private cryptocurrency addresses and foreign cryptocurrency exchanges to hide their scheme.\n\n\"The defendants' scheme calls the very integrity of the blockchain into question,\" said Manhattan U.S. Attorney Damian Williams, whose office is prosecuting the two men.\n\n\"Once they put their plan into action, their heist only took 12 seconds to complete,\" Williams said. \"This alleged scheme was novel and has never before been charged.\"\n\nJames, who lives in New York City, and Anton, who lives in Boston, were arrested Tuesday on charges of conspiracy to commit wire fraud, wire fraud and money laundering.\n\nThey appeared separately in federal court in New York and Boston on Wednesday afternoon.\n\nJudges set their bonds at $250,000 apiece, and each will be required to obtain two co-signers for their release bonds by May 29, according to a spokesman for the Manhattan U.S. Attorney's Office. They are also barred from trading cryptocurrency, securities and commodities.\n\nIf convicted, the brothers face a maximum sentence of 20 years in prison for each of the three counts.\n\nWilliams's office said the Peraire-Bueno brothers studied math and computer science \"at one of the most prestigious universities in the country,\" and said that their education would have helped them to acquire the ability to carry out the alleged fraud.\n\nJames Peraire-Bueno earned a Bachelor of Science in mathematics with computer science, and in aerospace engineering in June 2019 from MIT, and then in June 2021 earned a Master of Science in aeronautics and astronautics from the school, according to an MIT spokeswoman.\n\nDuring his undergraduate years, he was a member of MIT's sailing team.\n\nAnton Peraire-Bueno earned a Bachelor of Science in computer science and engineering from MIT in February. He was a member of the university's rowing team.\n\nAnton's LinkedIn page says he was a cryptocurrency researcher intern at a San Francisco-based Polychain Capital for several months in 2021.\n\nIn 2020, Anton co-authored an academic paper about a machine learning model that could have \"a strong practical impact\" for organizations \"with large amounts of sensitive data,\" according to a synopsis of that paper.\n\nLawyers for Anton did not immediately respond to requests for comment. The court docket did not show that any attorneys had filed appearances on behalf of James.\n\nThe charges come ahead of a long-awaited ruling expected from the Securities and Exchange Commission later this month on whether to approve an Ethereum exchange-traded fund.\n\nThat ETF would allow investors access to the ether token without having to directly own the cryptocurrency.\n\nIssuers of Bitcoin ETFs have already been bearish on the chances that the SEC will approve an ether ETF.\n\nThe DOJ's announcement of the alleged fraud could increase skepticism as the SEC completes that review.\n\nSEC Chair Gary Gensler has expressed concern about lacking regulation in crypto markets that could make it a dangerous listing for investors.\n\n\"To me, the fundamental question is, how do we ensure that the American investor is protected? And right now, they're not getting the required or needed disclosures,\" Gensler said in an interview on CNBC's \"Squawk Box\" earlier this month.\n\n\"And the intermediaries in the center of this rather centralized market generally are conflicted and doing things we would never allow the New York Stock Exchange to do,\" he said."
    }
]