[
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNRGNOMmtyMUYycUE4SnkwVlVMVDlzSFFkdG5FQjhCN2QtN1luLWxhb1o3aVFZSGxQbzZ4cDNGMlJDRXNHTW9uRlRRcklYOFlxQW5GT2JHMHMzeGlJT3AyOWNfc1BrRnJnODF4QW13NlBRV0xjem9yTGFWcV9GaHFJaWhEWjhsMlhwQTdNNTJDVTJFMWNNT29VSTBaQ1ZGUdIBowFBVV95cUxNWGRqeEJTcGlYQ1ZlSEU4dnZ5VWdqT0tUNGtnVXlwX2h1MGZjRXdaRDB0OGYtWFU4R1hDdm1USGRTUFRPVDdVbkZodGxvYXNWTnVYRkFYbndkNEE4UTUyQ3BZX3BpMmhjc2hBaEx5ZDNYc05hZGk1VEtPby1pcGhqc2Y3dmlZLVdLX3hncGNILXlNV3Q3VmI4SWNvSExlVjd3aGF3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) Price Taps $67K, Ethereum (ETH) Climbs Above $3.1K (Weekend Watch) - CryptoPotato",
        "content": "Bitcoin’s most recent run continued in the past 24 hours as the asset’s price climbed to its highest price in over a month at just over $67,400 yesterday.\n\nEthereum has also joined the party at last, having surged past the coveted resistance line of $3,000 and jumping above $3,100.\n\nBTC Sees 5-Week Peak\n\nBitcoin suffered a lot at the start of May as it dumped to a multi-month low of under $57,000. It began to recover some ground in the following week when it soared past $65,000 on May 6 but quickly reversed its trajectory and saw its price dropping to under $61,000 on May 10.\n\nThe bulls intercepted the move at this point and didn’t allow any further declines. Just the opposite, BTC maintained its ground last weekend and started climbing on Monday to just over $63,000. Another brief correction came on Tuesday to $61,200, but the lowering inflation rates in the US, which were announced on Wednesday, sent the cryptocurrency flying.\n\nIn a matter of hours, BTC skyrocketed by several grand and jumped past $66,000. Although there was another brief retracement, the growing Bitcoin ETF inflows meant more price gains for the underlying asset, which charted a 5-week high of over $67,400 yesterday.\n\nAlicia Bakery CMO - A really good agency Did you like this market update?\n\nThis is all you need not to miss any price action in the raging crypto markets. Start receiving this recap, for free, every day: Invalid email address Your privacy is guranteed. Thanks for subscribing, you will get your first report in the next hours!\n\nDespite losing some ground since then, BTC still trades around $67,000 now. Its market cap has increased to $1.320 trillion on CG, but its dominance over the alts is slightly down to 51.6%.\n\nETH Goes Beyond $3.1K\n\nThe second-largest cryptocurrency was among those who trailed behind in terms of gains, as reported earlier and was losing ground to BTC. This was because ETH couldn’t reclaim decisively $3,000 despite several challenges in the past few weeks.\n\nHowever, that resistance level finally gave in yesterday, which allowed Ether to shoot up above $3,100 for the first time in over a week.\n\nMost other larger-cap alts are also in the green, with gains of around 1-2%. In contrast, Toncoin has retraced by more than 3%, and so has HEAR, which is down by 4%.\n\nThe total crypto market cap has added around $20 billion overnight and is now at $2.560 trillion on CG."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOQTBaX3kyM3A4S3k3eXNmVEZVWkRJaUhFSko3T1l2djNmUmRucFBOQ3hZcVB6YWtqb1RLdHRCaGVnTEdYcm9SZlFhYzdXeS1rMDRMemRiRTBrNXlVdkpnRFhtV0pTVGl5aWpZRHJyTUFVM2RDck5Edll5d2RCemRYMGFNSEJ4R0NnZk1rLXAzRdIBlAFBVV95cUxOcXYyNEZ4cURiLUphdks2WlJST1B6c002blhFS19oLUJUU3VJMkF3SFhMa29WTXZsQzlvSkJGOTV6RENoQm5LbDY0dnV5bkVHNVdMLVRzSm5uT1MxUmZwckExQ0RXekc1dTc2MjYxbS1kMjRyaVg2VFA3enY3Q21GY1lBUFpFYUg1WjhGYS1hRm9xZURq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Predicting how ETH will react IF the SEC approves Ethereum ETFs - AMBCrypto News",
        "content": "Coinbase analyst sees a 30-40% chance of approval for Ethereum ETFs.\n\nEthereum’s dominance and performance are at a low, suggesting a need for positive development soon.\n\nIt is generally believed that the U.S. SEC will not approve any applications for the spot Ethereum [ETH] ETF due to several factors pointing to the fact that the agency’s new crypto enemy is Ethereum.\n\nBut still, no real confirmation has been gotten from the agency itself on what it’s planning. So there is still a chance, no matter how slim, that the SEC would approve these ETFs.\n\nHowever, if they do, is the market ready for that impact? How would Ethereum’s price react?\n\nApproval odds for Ethereum ETFs\n\nCoinbase institutional research analyst David Han suggests there could be a surprising upside.\n\nIn Coinbase’s monthly outlook report published on the 15th of May, Han mentioned that the odds of approval are between 30-40%.\n\nBloomberg ETF analyst Eric Balchunas has similarly set his approval odds at 35%. Meanwhile, the crypto community took a survey from Polymarket and the general estimate is 7% odds of approval.\n\nLarry Fink, CEO of BlackRock, echoed the somewhat optimistic sentiment during an appearance on CNBC, saying that the SEC might approve spot ETH ETFs even if it does consider Ethereum a security\n\nWhat does the data tell us?\n\nShould the SEC approve an Ethereum ETF, the market could see an unexpected surge. However, Ethereum’s dominance and recent performance are trending toward their lowest point ever.\n\nIts SEC-proclaimed status as a security has negatively impacted investment sentiment.\n\nNo one expects an approval, so Ether prices could likely see very little action in the near future.\n\nBitcoin’s [BTC] price hardly reacted to its ETF approvals earlier this year. And the community were actually looking forward to it.\n\nRecently, the Funding Rate has been relatively low or negative, which could imply a cooling off of bullish momentum or increased caution among traders, especially during price dips as it happened in mid-April.\n\nMoreover, the increase in Open Interest despite lower trading volumes suggests that traders might be preparing for significant price moves ahead, as positions are being built up.\n\nBut Ethereum’s trading chart shows a consistent bullish trend over a two-day period. The highest price point just above $3,160 could act as a short-term resistance level.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nWatching how the price reacts upon retesting this level could be critical for short-term investment strategies.\n\nGiven the strong upward momentum and successful price recovery post-retraction, if the market maintains its bullish sentiment, Ethereum could potentially break through the current resistance level."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOSVZkNmVCUFpIbXJmbHZGVnBZeTRMNnZNbnNwWmZsUm8wUE9HcDRxUklwdDlUR2NrOXN4YTQ4eUVlamc1S3BVOXdtS1d5anFIUWZrN3h3ZmtYM2hqX2dWdlBXMkdTZHV6UkhuQVBCS2phV0NhUlpNa2xJUHlndTZsd2tVU01DSUVGMl8wRkdR0gGTAUFVX3lxTE8zSHlBX2o3Vk1DNHFXMVJtMG85dWkzdmp5MWg3ZkhHNlhlVXlHa1prc1dBUnNCOXc0TzZCM2xBX1NfOG0yRVZCNVJfQmxYSXdoUmh5WnBrNDQwTnNXOVZiazBOZzYzeFZqVC1Mc3F3VFVIcWlfb0E2MmtXcXYzWnlkTlk3ZVpuU1NreHBDNWU4bEVxYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Ethereum sets sights on $4K: Will THIS spark a new rally for ETH? - AMBCrypto News",
        "content": "ETH was up by more than 6% over the last seven days.\n\nA few of the metrics suggested that the bullish momentum might not last.\n\nEthereum [ETH] caught investors off guard as its price gained bullish momentum on the 17th of May.\n\nWhile the token’s price moved up, it broke above a bullish pattern that could allow the king of altcoins to touch $4k in the coming days or weeks.\n\nEthereum eyes $4k again\n\nCoinMarketCap’s data revealed that ETH investors enjoyed profits last week, as the token’s price had surged by more than 6%.\n\nThings heated up in the last few hours as ETH’s value increased by over 2.6% over the last day. At the time of writing, ETH was trading at $3,108.31 with a market capitalization of over $373 billion.\n\nThe bullish price action had a positive impact on the token’s social metrics, as its Social Volume remained high last week.\n\nIts Weighted Sentiment also entered the positive zone, meaning the bullish sentiment around ETH became dominant in the market.\n\nThanks to the price uptick, ETH broke above a bullish pattern that hinted at a price rise towards $4k.\n\nWorld Of Charts, a popular crypto analyst, recently posted a tweet highlighting that ETH broke out of a falling wedge pattern.\n\nThe pattern appeared on ETH’s chart during the beginning of March, and since then, ETH has consolidated inside it.\n\nThe tweet mentioned that the breakout could result in a 50% price rise, in turn allowing Ethereum to reclaim $4k once again.\n\nWhat to expect in the short term?\n\nAMBCrypto then analyzed ETH’s metrics to see whether they support the possibility of it touching $4k anytime soon.\n\nOur analysis of CryptoQuant’s data revealed that ETH’s net deposit on exchanges was low compared to the last seven days’ average, signifying less selling pressure.\n\nAnother positive metric was the Coinbase premium, as it indicated that buying sentiment was dominant among U.S. investors. However, not everything looked bullish for the king of altcoins.\n\nAMBCrypto’s look at Glassnode’s data revealed that ETH’s Network To Value (NVT) ratio registered a sharp uptick. A rise in the metric suggests that an asset is overvalued, hinting at a price decline.\n\nEthereum’s Money Flow Index (MFI) also indicated a possible price correction as the indicator registered a decline. Nonetheless, the MACD displayed a bullish crossover.\n\nThe Chaikin Money Flow (CMF) also supported the bulls as it went northward.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nTo see what targets it might reach if its bull rally sustains, AMBCrypto analyzed Hyblock Capital’s data. We found that ETH’s liquidation would rise near the $3.2k zone.\n\nA successful breakout above that would allow it to reach $3.5k in the coming days before it targets $4k. However, if ETH’s price turns bearish, then its value might plummet to $2.85k."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE96LU9TZGpyNXFRQ0ZWMmFGeVF3bXFJbGhCMnU4cTVUalJhSVJUWkpmclR3QVZtaGpxaXdfRWxVTWZDalVDeFo2Y3ZrT0pKN3pwNUJWNVpXeG5xSzRuQUMyWW930gFnQVVfeXFMUFFZYWN6dm9CanU2a2Jqc3RpdWkyNjdYUTdGcXJGajhZSUZVZ1dhX1FjXzlCRVFWazN0dnhFYng1RUJ3WF9oRGdnY1Qxd2dSZ2xrajMzei15cndLbWNiV3c5Z01ZbHhudw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Why Is ETH Price Falling Despite SEC Approving All Spot Ethereum ETFs? | Bitcoinist.com - Bitcoinist",
        "content": "Ethereum’s (ETH) price has failed to make any significant rally following the Securities and Exchange Commission’s (SEC) approval of the Spot Ethereum ETFs. This is undoubtedly surprising, given that the approval was expected to spark a massive price surge for the second-largest crypto token.\n\nWhy ETH’s Price Has Failed To Rally\n\nEthereum’s price may have failed to rally because the crypto token was already priced into the news about a potential approval. It is worth noting that ETH’S price rallied by almost 20% earlier this week when Bloomberg analysts Eric Balchunas and James Seyffart increased their approval odds from 25% to 75%, suggesting that approval was almost likely.\n\nTherefore, this could have turned out to be a typical ‘sell the news’ event, with many traders currently taking profits from their earlier ETH investments. NewsBTC reported that Ethereum whales had bought over 110,000 ETH ($341 million) between May 19 and 20 as they positioned themselves ahead of any news regarding a potential approval of these funds.\n\nMeanwhile, historically speaking, this could have been expected from ETH’s price, considering that Bitcoin (BTC) experienced a significant drawdown following the approval of the Spot Bitcoin ETFs.\n\nHowever, it is worth mentioning that unlike the Bitcoin ETFs, which began trading immediately, these Spot Ethereum ETFs won’t start trading just yet. The SEC only approved the exchange filings (19b-4s) and will still have to approve the registration filings (S-1s) for these funds to begin trading.\n\nThe fact these Ethereum ETFs won’t begin trading just yet could be another reason why ETH’S price hasn’t reacted positively to this development. As such, approval of the registration filings, which may take weeks or months, may be needed to spark another rally for Ethereum and other altcoins by extension.\n\nA key positive is that ETH is up by over 28% in the last seven days, which is a big deal considering that the crypto token has lagged for a while now and failed to match up with other major-cap crypto tokens.\n\nAnother Reason To Be Bullish On Ethereum\n\nThe approval of the Spot Ethereum ETFs is a clear indication that the SEC doesn’t consider ETH a security, contrary to earlier reports that the Commission might have held this belief for some time now.\n\nTuongVy Le, a General Counsel at Anchorage Digital, noted in an X (formerly Twitter) post that funds whose assets are 40% or more securities may not register through a form S-1 but through Form N-1A or N-2.\n\nTherefore, if the SEC considered ETH a security, it would have rejected the S-1 filings made by the various fund issuers like BlackRock since these Ethereum ETFs will hold ETH as their major assets.\n\nAt the time of writing, ETH is trading at around $3,803, according to data from CoinMarketCap.\n\nFeatured image created with Dall.E, chart from Tradingview.com"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxObmN6enI2SXpqc3lXOW9BS1pEOVdIWWFiRjZsa2VJT3c5aWhpcjhjeUtxTTFNTnlZTllEV1JhYUNrenZSUkM5WkNtaUJneXRjc0RiVHh1RmMzR2V4cWlyLXRyRXItVlEzUnFFbktldVRSenIySGlaSVpWV1N3WjJYNmYyd1ZEa213OFV1Qm5WNHpMNVRZd3JN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "IBC to Ethereum: Building the interconnected Internet of Blockchains - CryptoSlate",
        "content": "Since the advent of Bitcoin in 2009 and the explosion of innovation that followed, the web3 industry has faced many challenges. Beyond dealing with regulators, improving UX, and weeding out bad actors, blockchain engineers continue to tackle two major hurdles: scalability and interoperability.\n\nWhile many Layer 2s are working to scale Layer 1s like Bitcoin and Ethereum by improving throughput and reducing transaction fees, protocols like Union enable both—interoperability at scale.\n\nThe need for blockchain interoperability\n\nWhatever your opinion on the WEF, its 2020 whitepaper on blockchain interoperability hit the nail when it stated, “Organisations do not want to find themselves on a blockchain platform that may limit their options for external collaboration in the future.”\n\nTo elaborate further on that point, imagine having a Gmail account, sending a message to a Yahoo account, and being unable to exchange communications. The internet was able to develop as quickly as it did because it factored in interoperability from the early days, and blockchains must do the same.\n\nA notable player in the interoperability space is Cosmos, whose flagship Inter-Blockchain Communication (IBC) protocol has enabled a host of sovereign chains to connect, transact, exchange, swap tokens, and perform other actions without compromising sovereignty. Map of Zones shows 91 zones now connected via IBC transacting more than $2.1 billion over the last 30 days in more than 8.7 million transactions.\n\nIBC isn’t limited to Cosmos chains, either. The trustless interoperability protocol has broadened its scope to include EVM-compatible chains such as Ethereum, Polygon, and Avalanche. However, most bridging solutions so far have been offered by centralized providers, meaning users must trust the bridging protocol.\n\nUnion provides a permissionless bridging protocol that connects modular blockchains and rollups trustlessly, without depending on trusted third parties, oracles, multi-signatures, or MPC, using advanced zero-knowledge (ZK) cryptography.\n\nAlready connecting several ecosystems, Union recently announced a partnership with L2 developer Polygon Labs that will tap into Polygon’s AggLayer “to facilitate message passing and asset transfers between the Polygon ecosystem and IBC-enabled chains,” bridging two of the largest blockchain ecosystems: Polygon and Cosmos.\n\nPermissionlessly bridging Polygon, Cosmos, and beyond\n\nUnion founder and prior CTO at Composable Finance Karel Kubat told CryptoSlate, “It’s not just a Cosmos to Polygon bridge but anything that’s IBC-enabled, which includes Scroll, and soon Arbitrum, Berrachain, Movement Labs, M2… They can build and connect into the Agglayer using Union,” permissionlessly tapping into the liquidity of one of the largest blockchain Layer 1s, Ethereum.\n\n“Right now it’s very interesting because we have big L1 ecosystems that really only have permissioned centralized bridges or something in between. You need to go to the bridge provider to get support for a small ecosystem. What Union does, is if you’re building a new Cosmos chain or a new rollup that’s IBC enabled, you don’t need to go to a centralized provider to get support. You just open the connection to Ethereum and you’re done… So we’re going quite quickly from a world with only 200 to 300 ecosystems to a world with thousands and thousands.”\n\nThis type of seamless interoperability isn’t possible with centralized solutions because the “wait queue” is too long. Every chain wanting to connect needs to request the bridging protocol’s permission.\n\nWith Union, chains can permissionlessly open a channel with Ethereum, enabling a seamlessly interconnected future… of potentially millions of chains. Karel gives the example of dYdX, one of the largest decentralized exchanges that began as a smart contract on Ethereum and moved ecosystems to become a sovereign Cosmos app chain.\n\n“We all went into crypto for sovereignty,” he says. “Any successful smart contract is contemplating going to their own L2 or app chain.” This means the total addressable market for Union is potentially vast. “It isn’t anyone that wants to build a blockchain. It’s any existing app on Ethereum and Solana that could benefit from making this move.”\n\nUnion’s IBC to Polygon bridge should be completed by the end of this year and you can keep up with the latest developments by following Union on X.\n\nMentioned in this article"
    }
]