[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOcmNKZnhVOVZQSWhUNzVnQlltOHF6alBxNTRzT0RubkxiRVZOYm9UQUt4eExiOV82M1pUcnI5QzVfQW9XektfZEYyWkEza1R3UGtUY1Nkd1FNUmQ4b0F3WkRsN0tWX2VIZnNsS1QxREpvS1hVa2I5TkVvQ0lIX19qRFdEdmJIdTNxUXE5Tmx0VjBQUVozenRwRHZvRm1qN05WRnVqc0U4N0w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Watch Kraken Head of Strategy: Ethereum ETF Is a Big Deal - Bloomberg - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOcmNKZnhVOVZQSWhUNzVnQlltOHF6alBxNTRzT0RubkxiRVZOYm9UQUt4eExiOV82M1pUcnI5QzVfQW9XektfZEYyWkEza1R3UGtUY1Nkd1FNUmQ4b0F3WkRsN0tWX2VIZnNsS1QxREpvS1hVa2I5TkVvQ0lIX19qRFdEdmJIdTNxUXE5Tmx0VjBQUVozenRwRHZvRm1qN05WRnVqc0U4N0w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Watch Kraken Head of Strategy: Ethereum ETF Is a Big Deal - Bloomberg - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE9lZDZEcmZ2SmJMX1JSaFNMMnFXd1l3VlRQXy1VM2MyVDk0RDNzRU50YndUa1BNMi0wR1g4eldVbkswUVpldHBnV25HWGhSNHd4aVp0ZFNZRDEtM29iRU5lZFV1dFVlRUNM0gFuQVVfeXFMT1M4OHlVQ2JkZ2ZrYmU2ZDBrckpMODc4WmJPdTF0b3poa2M1eVhvMjJxTE9iVlVjTGRZb3lYTGRiRVJzRGtTdjRTUFZ0dnFob0dnbkdzb09JbHlsR3ZxQ08tRFRvUzhmaWpPUE9IX0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction for July 12 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBulls do not seem ready for a continued upward move, according to CoinStats.\n\nAdvertisement\n\nETH chart by CoinStats\n\nETH/USD\n\nThe price of Ethereum (ETH) has fallen by 1.66% over the last 24 hours.\n\nImage by TradingView\n\nOn the hourly chart, the rate of ETH remains bearish as it is coming back to the local support level of $3,055. If the situation does not change by the end of the day, one can expect a breakout to the $3,000 zone.\n\nImage by TradingView\n\nOn the bigger time frame, one should pay attention to yesterday's bar's low. If the candle closes near it or below, the fall may continue to the vital area of $3,000 shortly.\n\nImage by TradingView\n\nFrom the midterm point of view, the rate of ETH is far from key levels, which means neither buyers nor sellers are ready for a sharp move.\n\nIn this case, ongoing sideways trading in the zone of $2,900-$3,100 is the more likely scenario.\n\nEthereum is trading at $3,074 at press time."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOMldIeG5tdWg4ZVNmaTVOQjYwVEpNVWJmTTA0TjhLTGM4c3VkSmVLb3V5am9jd3ZQV212djYzNDJoaEJmR01rM2tWcmdYZmZWM2hHWlpHU05RaXhub0JCLXpkNUNRdlBTR2E4TTdObUZOaFZyMnBCbjU0dldzQmpnc2g0eHdzZmdZQThsOElqTGw4UU5DeGI4VVM2UU9SNTB4a0QwZU4yb9IBrAFBVV95cUxNYUFreE91V0hMaEVSTE83WkRJeERaejZuTEhIYWtBcjN3ekswd1dINUszcnp6a0FLTDZ5QTA5WDFwT05Eb0pCQ2YzTUtHWUFzSkxOTXJWTGpzNUVicFNMWGw3LW1CNGpzdmJXdUZhRjF3c2NqeXhGZWVoeFY0a0ViUktpZm9LLXZSSDBiTjRON2RWS0pzWHJZbWNjaGpZcWFMVlJUNzFjeDBVWTl6?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Is ETH on the Verge of a Deeper Correction Toward $2.7K? - CryptoPotato",
        "content": "Ethereum’s price has been dropping recently, following a second rejection from the $4,000 resistance level, and it has yet to recover.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily chart, the price has been making lower highs and lows since failing to break the $4,000 level to the upside a while ago. The market has also broken below the 200-day moving average, around the $3,100 mark.\n\nThe price is currently retesting the 200-day moving average but is seemingly getting rejected to the downside. As things currently stand, the cryptocurrency seems likely to drop toward the $2,700 support level in the short term.\n\nThe 4-Hour Chart\n\nThe 4-hour chart demonstrates a zoomed-in view of the recent price action. As evident, the downtrend has recently been aggravated to the downside, with the market briefly breaking below the $3,000 support level.\n\nYet, following an oversold signal by the RSI, the price has recovered above the mentioned support zone. However, the price seemingly lacks the momentum to continue higher and might be on the verge of a deeper decline toward the $2,700 area.\n\nOn-Chain Analysis\n\nBy TradingRage\n\nEthereum Exchange Reserve\n\nDuring the Ethereum downtrend in the last few weeks, many analysts have been looking for signs of capitulation that point to a potential bottom. Some signals are becoming evident.\n\nThis chart displays the Ethereum Exchange Reserve metric, which measures the amount of ETH held in exchange wallets. An increase shows potential selling pressure, while a decline indicates a decrease in supply.\n\nFollowing the recent brief decline below the $3,000 level, the exchange reserve metric has experienced an increase above its 30-day moving average. This might indicate the beginning of the capitulation phase, as many investors’ stop losses were below the $3,000 level."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQVmdxdDV2U2pMNnBzY0Rod0VvMm9td1puVGFEUGM4ZTNUMnRJazNfS0xnZHdZLS13N2ZQenF4V2l5VklYVzVJTEFENWxWOVJaeXhFOTJSYjJfd3BxeV9aVENYNU1nQ3J3ajN6VmNPSlFxQUUwM2M4OFBCZnZpa2dNNkFXRllSY0JZT2hPbmZPOF9qcUlEYUdDbXVIXzY4VVJVNWNxQkduek1RMEpxUVJnSWJiSVgxTTNEblJpUFRjLXZVRXZKeHpSZGpUWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Recover As Germany Runs Out Of BTC To Sell - Benzinga",
        "content": "Cryptocurrency markets are trading up as PPI data has sparked speculation of an interest cut in September.\n\nCryptocurrency Price Gains +/- Bitcoin BTC/USD $57,825.58 +0.6% Ethereum ETH/USD $3,129.43 +0.5% Solana SOL/USD $138.75 +1.2% Dogecoin DOGE/USD $0.1076 +0.4% Shiba Inu SHIB/USD $0.00001644 +0.3%\n\nNotable Statistics:\n\nIntoTheBlock notes that 83% of Bitcoin holders are in profit at current levels despite the volatility. While concentration by large holders stands at 12%, 70% of holders have accumulated the coin for more than a year. Exchange netflows widened by 163.9%.\n\nDegen News revealed the German government is out of Bitcoin.\n\nCoinglass highlights 40,300 traders liquidated in the past 24 hours for $126.7 million.\n\nNotable Developments:\n\nTop Gainers:\n\nCryptocurrency Price Gains +/– ORDI ORDI/USD $33.56 +8.5% Maker MKR/USD $2,498.75 +6.5% Ronin RON/USD $2.05 +4.9%\n\nTrader Notes: Andrew Crypto sees a \"clean break above $59,200 next to continue this bullish momentum.\"\n\n\n\nHe concluded, \"A reclaim of the range is needed to confirm a local bottom.\"\n\n\n\nAnother crypto trader noted that \"Just like that market sentiment shifts to more positive but still doubt over hangs price performance. Will need to see multi-day follow through from spot buyers.\"\n\n\n\nCrypto trader Kevin also highlighted that Bitcoin has recovered nicely as Germany runs out of all its Bitcoin. He also reaffirmed his prior prediction that if Bitcoin \"can break above $60,000 and hold it then we can negate this pattern, which would be bullish.\"\n\n#BTC almost broke down last night but has recovered nicely since.. Germany all out of BTC. Send it higher https://t.co/Pbyn34rcUU pic.twitter.com/bBzYVmkw2x — Kevin (@Kev_Capital_TA) July 12, 2024\n\nCryptoquant Founder & CEO Ki Young Ju revealed that whales use a lot of leverage at cyclical bottom. While he suggests trading like a whale, he added \"whales use a lot of leverage only at the cyclical bottom.\"\n\nRead Next:\n\nImage: Shutterstock"
    }
]