[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE52Z0ZEQThIcS0tNzZ6M1VuNlhVS1Q0T1p6Q0J2aDJkdjJFY0xqS2dUa2ZvanVVQWJTN21BU0ZQNzBaaTJoclNRTGdIbkRmN2xTNWRqWUxubTVoWWRzSmpieUN5bkxzam5VanItVUVrZGF4SDMxbmRNQWllb2E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Franklin Templeton's Ethereum spot ETF listed on DTCC - Crypto Briefing",
        "content": "The listing represents a preliminary step in the trading process, yet it does not ensure that the SEC will grant approval for the fund.\n\nShare this article\n\nFranklin Templeton’s proposed spot Ethereum ETF has appeared on the Depository Trust and Clearing Corporation’s (DTCC) new securities list with the ticker EZET. This development occurred just a day following reports of the SEC’s probable rejection of spot Ethereum ETF applications.\n\nThe DTCC listing represents a preliminary step in the trading process, yet it does not ensure that the SEC will approve the Ether Spot ETF. The SEC’s decision on the fund remains pending.\n\nFranklin Templeton filed for spot Ethereum ETF in February, joining other industry giants like BlackRock, Grayscale, VanEck, and ARK Invest, in the race. However, the outlook for Ethereum-based funds is not as promising as it was for Bitcoin-based predecessors.\n\nBloomberg ETF analyst Eric Balchunas estimates there is only a 25% chance of SEC approval for a spot Ethereum ETF. He cites a noticeable absence of engagement from the SEC, contrasting with the Bitcoin ETF approval process. Balchunas interprets this silence as a deliberate ‘tactical’ decision rather than mere ‘procrastination.’\n\nJPMorgan analysts anticipate a protracted delay in the regulatory approval of the spot Ethereum ETF, though they suggest that approval could eventually follow a legal challenge similar to Grayscale’s lawsuit, which compelled the SEC to reassess spot Ethereum ETF applications.\n\nMeanwhile, Ethereum’s market performance has stagnated post-Bitcoin’s fourth halving, with its price staying between $3,100 and $3,200, according to CoinGecko. At press time, Ethereum is trading at around $3,100, down 1% in 24 hours."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxPRUJ3NVBZZHEyN09vZEd5SWl4Wk9TdmNDVnNQMUpORXNkWWM5a3NrWHlPNWk2TUxlU25OVEk0TTQtUU83bDY3NXViRW1OcmhubTlmdUs2bUJCb0x4Q1BfMU1zNlA1VzJ3LXVROG5JSUhMM0trQzdHdTZ2TkpjcVl1Vjd0WXZmQ1Y0elRhX0FRM1BvOVZNQWVobXlzUEJrcktCdEgwaktnSHZHZkpYSU0tSkR1aXJleVBlZHhWX3lBZkpmeDhJazlmQ21hNTRhQ1lxM2fSAdcBQVVfeXFMUG1ZWlYzWGFfWExFVTBxQzUzbUdKMVBQN2luRGtsTU1RbktzcmJGX1pleHp1QWJram9YR2FpU1poVnUwclJzQzg0bWt1eTdLYW0weFptYTE0ZUN6ZFhpdzhkeW95emFGZEhObWxpWXQyUENIRTd4dDlaOFdvSXo4UncxRGwybzZUb0dtYXhpalRlMmFDVVZXTnNVNTJYa1JvNmRja0xUTEZHUFc5T3FKdDlYaGZwZ1FydVp4VUhleEJCcW55SE5KS2RSTmFvNzUtU3FwcS01SzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Franklin Templeton’s Ethereum ETF listed on DTCC, no guarantee of SEC approval - FXStreet",
        "content": "Franklin Templeton has launched its Ethereum ETF coded as EZET, as seen on the DTCC website.\n\nFranklin Templeton’s Spot Ethereum ETF listing on DTCC does not guarantee S-1 filing approval by the US SEC.\n\nETH price is $3,125 at the time of writing, down nearly 3% from Monday’s close.\n\nEthereum (ETH) holders have long awaited the approval of the Spot Ethereum ETF by the US Securities and Exchange Commission (SEC). The firm’s ETH ETF, dubbed Franklin Ethereum TR Ethereum ETF was listed on the Depository Trust and Clearing Corporation (DTCC) website.\n\nSpot Ethereum ETF approval anticipation brews\n\nFranklin Templeton, the $1.5 trillion asset management firm has listed its Ethereum ETF on the DTCC website. The website lists the ETF and indicates that it is available for creation and redemption. The DTCC listing however does not imply an approval of the S-1 filing with the US Securities and Exchange. Franklin Templeton submitted its Spot ETH ETF application on February 12.\n\nEthereum ETF appears on DTCC website\n\nWhile not directly related to the S-1 filing, listing on the DTCC is a crucial step that allows for supply adjustment of ETF shares to help keep up with their demand in the market. It helps keep an ETF’s market price closer to its net asset value (NAV).\n\nIn previous instances, the website has listed securities that are eligible for trading and settlement once ETFs complete registration and compliance procedures. The SEC postponed its decision on Franklin Templeton’s Ethereum ETF application on April 23. The final deadline is now June 11, this offers the regulator an additional 45 days to make its decision on the Spot Ethereum ETF application.\n\nEric Balchunas, Bloomberg ETF analyst says that the chances of an approval by the SEC are 35%.\n\nETH price is $3,125 at the time of writing, down nearly 3% from Monday’s close."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQMWhBMTEtek5KY084VWhXcEs3dWFQSW52SU1VaDJlQUZuY2pyZ1hteUhtcjJpdENia2FCSzM1VEttMFBIQk5PUTlvd2RSOW9IbVdDZGdEeUpOS1AyVXhid3NUR0NZdmFMV3A5UU1Va2kxTDV3TmFMRnp0c0dkSFJtZVpXa2g1QmV5MHJnLWlyTDlzSjJ0QnFN0gGcAUFVX3lxTE1SZWVreUNMNHNadjZfb1JRc0pueWtYQVlSdjR3dUh2dmVpS3I2a01xTEUzNU1hTXZIUnl0TGlxNEY1dXJ3R25lWi0zcWtRVHRMN3U1aGZmT3ZFMWlNaHBJdEZwSjluY182WTc1M0NrUGRSR2dMbHh2ZWd3azB6MFJVUzlMNlRNbjJXdElYTUFtMFl4Rkk1dnlqTEUzdQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s correction – $2,700 and ETH price’s other targets if it falls again - AMBCrypto News",
        "content": "Selling pressure on Ethereum rose over the past week\n\nMost market indicators looked bearish on ETH’s charts\n\nEthereum’s [ETH] price managed to climb past $3.2k last week. Soon after, however, the altcoin turned bearish as ETH was unable to hold its position on the charts. Given how everything has panned out, if the worst scenario is to be considered here, ETH might fall to its $2.7k support level.\n\nMore red for Ethereum\n\nAccording to CoinMarketCap, ETH’s price appreciated by 2% last week, allowing it to go past $3.2k on 24 April. However, the uptrend didn’t last long as its price dropped over the last 24 hours. At the time of writing, ETH was trading at $3,118.13 with a market capitalization of over $380 billion.\n\nAccording to IntoTheBlock’s data, 79% of Ethereum investors are still in profit. The decline in ETH’s price also affected its social volume negatively. Additionally, after a spike on 25 April, its weighted sentiment dropped on the charts. This alluded to bearish sentiment around ETH being on the higher side.\n\nThings can get worse, however, as if ETH records more price corrections, its value might drop to the $2.7k support level in the coming days, as per a recent tweet from Crypto Tony, a popular crypto analyst. The possibility of ETH hitting that support level would increase if it fails to go above $3.6k.\n\nTherefore, AMBCrypto took a look at Santiment’s data to see whether metrics seemed bearish.\n\nWe found that selling pressure on the token has been increasing. This was evidenced by the hike in its exchange inflows over the past week. The fact that selling pressure was high was further proven by ETH’s supply on exchanges, which rise.\n\nOn the contrary however, whales remain confident in ETH as its supply held by top addresses went up.\n\nEthereum’s immediate support levels\n\nAMBCrypto then checked ETH’s daily chart to find whether a sustained downtrend is inevitable or not. We found that the Money Flow Index (MFI) went north – A sign predicting a price uptick.\n\nNonetheless, the rest of the indicators seemed bearish. For instance, both ETH’s Relative Strength Index (RSI) and Chaikin Money Flow (CMF) headed south, meaning that the chances of a further price drop were high.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nFinally, AMBCrypto’s analysis of Hyblock Capital’s data revealed that ETH has a strong support level near $3.1k if a price correction happens.\n\nA drop below that level could result in ETH plummeting to $2.8k before it reaches its tested support level at $2.7k in the coming days or weeks."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOVFkxNFJOZnIzS0R0Uy1oVlJPajlIcUFzX251SlBLbUI4ZVdSQndFQ1gxc2NoTTRVaEFobHNGOWNZclhrWGtMWjRkd3BsQ1l6MUFSQW9QVzYtMEJLTjEzMXZUaHlHQnctMlpyZmktYk05dWtxMzN0ZHZmX2oyc3pvLUtEWktTTG84eWd1VjEtaVhZMC1H0gGaAUFVX3lxTFBIYktnbkpQSlN2UW1LNUFIVlNuYzViUjdJQ1FYRGhBWVRoNnExWDlBQkowR09OYzdqTHBrTm5Xa2U4cnFaenVMOTZMVFNBbmpwT2xxQkROZFlNdkczVWZjbzNIeDJuUTlQaEJSYk1PQnowTEpvQ2JMR01JeDI5emFsSEZQWmtMeVZDdE1WcnprbnZvcl8wMUlDbFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Polkadot vs Ethereum, BNB Chain – Here’s what the stats are telling you - AMBCrypto News",
        "content": "Though dev activity dropped, Polkadot’s network activity hiked on the charts\n\nA trend reversal could be on the cards for DOT’s price action\n\nPolkadot [DOT] has been renowned for having robust development activity consistently over the years. However, as per recent data, other blockchains like Ethereum [ETH] and BNB Chain have emerged to overtake its levels over the last few days. While this shift happened, DOT’s price action turned bearish on the charts.\n\nPolkadot’s development activity drops\n\nCoin98 Analytics recently shared a tweet mentioning a list of blockchains ranked in terms of their development activity. As per the tweet, Polkadot registered 827 developers last week, with the blockchain witnessing over 5000 weekly code commits.\n\nThough the number by itself wasn’t low, it was lower than other blockchains. For instance, ETH had more than 2000 weekly developers who executed over 19,000 commits. Polkadot was also behind BNB Chain, whose weekly commits exceeded 6,000.\n\nOther blockchains that outshined DOT were Polygon [MATIC] and Optimism [OP], whose weekly commits stood at 6,300 and 5,200, respectively.\n\nAMBCrypto’s analysis of Santiment’s data also revealed a similar story. We found that DOT’s development activity dropped sharply over the last seven days. However, despite the drop in dev activity, the blockchain’s dev activity contributor count spiked multiple times last week.\n\nHere, it is interesting to note that while the blockchain’s dev activity fell, its network activity registered a massive spike last week.\n\nAMBCrypto’s look at Artemis’ data revealed that after several days of dormancy, DOT’s daily active addresses shot up considerably on 24 April. Thanks to the rise in active addresses, its daily transaction count also followed a similar trend.\n\nBears are attacking DOT\n\nIn the meantime, Polkadot bears buckled up as the token’s price dipped on the charts. According to CoinMarketCap, DOT lost more than 1.5% of its value in the last seven days. In fact, in the last 24 hours alone, the token’s value dipped by 2%. At press time, DOT was trading at $6.70 with a market capitalization of over $9.6 billion.\n\nDOT’s funding rate has risen over the last few days too. This is a bearish development as prices tend to move in the opposite direction from the funding rate.\n\nNonetheless, Polkadot’s open interest also went down. A decline in the metric is a sign that chances of the ongoing market trend changing are high.\n\nRead Polkadot’s [DOT] Price Prediction 2024-25\n\nDOT’s Money Flow Index (MFI) also registered a sharp uptick and was heading further above the neutral level, suggesting a possible price hike.\n\nFinally, as per the Bollinger Bands, DOT’s price was resting under its 20-day Simple Moving Average (SMA). A successful breakout above that level could result in a fresh bull run for the altcoin on the charts."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOWjJ4RXlwaW9UMUVmS2hUMm1NMzh1RGZJYmF1VF9FMDlFRHZSMERibEJXTFRXa2V6ZEpOcVp1TV9meDM3Z2taZG95cEVLTFhWUkFhN1VqOTNJNlFFN3VFRUNLcUp3ZXZhZDc3T090VFhNTE53ckZ0M3NIMGM0MzV5dVIzZEzSAYoBQVVfeXFMTzlMU25HMkw1MGFXaVlSa1ZaXzE1UnFiS3p5Y1VMaUpXZ2ZBWmJDelI0SzcteW9UUVdFT3dBWXBJeTN4OF9VNE1VVmJmYjY1TUlMTU1LTHh0b1ZxMC1vM1FjMHBuT2J1M2FlTlgzVW1GSUZvOHhpQmJDcFlvVmVNazdMbkNGY3R1TzNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Apr 2024 07:00:00 GMT",
        "title": "Best Time To Buy Longs In Bitcoin (BTC) and Ethereum (ETH): QCP Capital - CoinGape",
        "content": "Crypto trading firm QCP Capital on Friday recommended buying Bitcoin and Ethereum, saying “If you are still a bullish believer, a consolidating market could be the best time to accumulate longs.”\n\nBitcoin and Ethereum prices are consolidating near $63,000 and $3,100 levels for a massive rally this year. Santiment reported that Bitcoin active wallets are rising quickly despite choppy prices.\n\nadvertisement\n\nBitcoin and Ethereum Fall Raises Questions\n\nPost-Bitcoin halving performance of Bitcoin (ETH) and Ethereum (ETH) prices raised questions of whether the market has lost faith or is this just a short pause in a longer-term bull run.\n\nQCP Capital, a Singapore-based digital asset trading company, in a new trade idea on April 27 noted the volumes in Bitcoin and Ethereum options have compressed drastically. This week, heavy selling of BTC options has seen the vol curve collapse, with Bitcoin vols further compressing from 70% to 50%. The company added that if people are looking to buy BTC and ETH, then this consolidating market is the best time to accumulate longs.\n\nOther the other side, the downside skew in Ethereum (ETH) risk reversals has also dropped further to -13%, said QCP Capital. This could be due to recent reports of SEC possibly denying or further delaying spot Ether ETF. According to people familiar with the matter, the SEC and its staff have shown no interest in the spot Ether ETF and its potential. Four people who participated said the discussions were one-sided.\n\nAlso Read: Shiba Inu or Dogecoin: Which Is Better & Likely to Outperform This Year\n\nHong Kong’s Spot Bitcoin and Ether ETF Going Live\n\nSpot Bitcoin and Ether ETFs to begin trading in Hong Kong on April 30. QCP Capital says this is potentially a big positive catalyst next week as Hong Kong financial industry joins other financial markets such as the U.S. and Europe to invest in spot Bitcoin ETF.\n\nExperts predict market reaction similar to the United States, which saw massive buying by institutional investors. Interest is growing in what could be a gateway for the inflow of Asian institutional capital, said QCP Capital.\n\nQCP Capital suggests BTC Accumulator and ETH Accumulator strategies for options traders, which a weekly buying call at a discount of the spot prices of BTC and ETH.\n\nBTC price fell over 2% in the last 24 hours, with the price currently trading under $63,000. Meanwhile, ETH price trades at $3,116, down more than 1% in the past 24 hours.\n\nAlso Read: Bitcoin ETF Records First All Net Outflow Of $83M Since Launch, Bitcoin Bottomed?\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]