[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQTGMxQlg4SzdqMlZXOWtaVGhBbzF0aEprMDNEZHVQWVRnTDB6dDlRaFJVOUJyczAzT3RQNWJlY01WTDZVWjExUk5LOXZJVFFhQWttSUxEcVYzYVNGRnRnSWlIUUZMQnBNZ2J2VmtCMEtSNnFsbWV2WUIwaXhnN2xGSVpINzFDYTl2LWMyRG1n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Shares Ethereum Roadmap For 2024, Focuses on Six Key Components - Yahoo Finance",
        "content": "Vitalik Buterin Shares Ethereum Roadmap For 2024, Focuses on Six Key Components\n\nEthereum co-founder Vitalik Buterin has shared the Ethereum roadmap for 2024, outlining the project's continued focus on six main components.\n\nButerin posted on X (formerly Twitter) an updated roadmap with annotations and diagrams, elaborating on each of the six elements: the Merge, the Surge, the Scourge, the Verge, the Purge and the Splurge.\n\nButerin noted that as Ethereum's technical direction becomes clearer, there are only a handful of minor adjustments compared to the 2023 roadmap. The Merge, which integrated the Ethereum mainnet with the proof-of-stake (PoS) blockchain the Beacon Chain in September 2022, remains a key focus area. Buterin emphasized the importance of maintaining a simple and resilient PoS consensus.\n\nFollowing the Merge, the most significant observation on Ethereum was the transition from a power-intensive proof-of-work (PoW) consensus mechanism to PoS, leading to a major reduction in the network's overall energy consumption.\n\nButerin also highlighted the developments in Ethereum's single-slot finality (SSF), which aims to ensure that changes to a blockchain block are irreversible without burning at least 33% of the total staked Ether (ETH).\n\nButerin stated:\n\n\"The role of single slot finality (SSF) in post-Merge PoS improvement is solidifying. It's becoming clear that SSF is the easiest path to resolving a lot of the Ethereum PoS design's current weaknesses.\"\n\nButerin's roadmap also emphasizes the importance of rollups, zero-knowledge proofs, account abstraction, and second-generation privacy solutions, which align with the original cypherpunk principles of Ethereum.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQTGMxQlg4SzdqMlZXOWtaVGhBbzF0aEprMDNEZHVQWVRnTDB6dDlRaFJVOUJyczAzT3RQNWJlY01WTDZVWjExUk5LOXZJVFFhQWttSUxEcVYzYVNGRnRnSWlIUUZMQnBNZ2J2VmtCMEtSNnFsbWV2WUIwaXhnN2xGSVpINzFDYTl2LWMyRG1n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Shares Ethereum Roadmap For 2024, Focuses on Six Key Components - Yahoo Finance",
        "content": "Vitalik Buterin Shares Ethereum Roadmap For 2024, Focuses on Six Key Components\n\nEthereum co-founder Vitalik Buterin has shared the Ethereum roadmap for 2024, outlining the project's continued focus on six main components.\n\nButerin posted on X (formerly Twitter) an updated roadmap with annotations and diagrams, elaborating on each of the six elements: the Merge, the Surge, the Scourge, the Verge, the Purge and the Splurge.\n\nButerin noted that as Ethereum's technical direction becomes clearer, there are only a handful of minor adjustments compared to the 2023 roadmap. The Merge, which integrated the Ethereum mainnet with the proof-of-stake (PoS) blockchain the Beacon Chain in September 2022, remains a key focus area. Buterin emphasized the importance of maintaining a simple and resilient PoS consensus.\n\nFollowing the Merge, the most significant observation on Ethereum was the transition from a power-intensive proof-of-work (PoW) consensus mechanism to PoS, leading to a major reduction in the network's overall energy consumption.\n\nButerin also highlighted the developments in Ethereum's single-slot finality (SSF), which aims to ensure that changes to a blockchain block are irreversible without burning at least 33% of the total staked Ether (ETH).\n\nButerin stated:\n\n\"The role of single slot finality (SSF) in post-Merge PoS improvement is solidifying. It's becoming clear that SSF is the easiest path to resolving a lot of the Ethereum PoS design's current weaknesses.\"\n\nButerin's roadmap also emphasizes the importance of rollups, zero-knowledge proofs, account abstraction, and second-generation privacy solutions, which align with the original cypherpunk principles of Ethereum.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxORFJvQk1TbGgwZ3A0UUtBamtWTXl1OWJHcUFHM1RMaUo4Q0U2VWlaZWF2NU92MFotWEVoR01zRjZieklNWHdZZjYyM2hOYlB0eEpYMnl3UlVnZzg0UXpmQmY5akpCVHFXOFFrSGk3ZEcyWXJ3dmM4Uy1lek1ES0IzTkY1Ny1MZzhYSEQxWmRyUU80WE1FTGd2R1JldWhZcGdONWZjWE9md1djN2dNZHRrMGptM2Z3ZDBDM2hvbG9lNWlwcjdUWVJIdUZoT2xmQmtSekdDb0hocThDV0Nf0gHiAUFVX3lxTE93VGE2Zlp4Q09wM0RlRXMtQVRvR3JhUS1TQ3RzWkN4QTlvTkZUSFZaYTh3eHFpTTVEbWctWU9BVzJrSVd5LW1EdVJMVURWQTRVLTRZNDhTb3ZRVU5wOFA0am1yQWx1cmJKYUpFd09SdkJELTlsRVlqSVAzRGRJT1hTWjhEd0oyUHRLd3hzVmZPZV8taFZtejFNSy01TGdXZ1kzM0hsb1NPVmhQcE14Wks2RjcyaDFCRDhIc081eFBBMHJINVl4dnZ6Q2NVMFpSN0ZaTDJjV1cxRnVUcENYMjBQZkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jan 2024 08:00:00 GMT",
        "title": "Ethereum price could make a recovery as ETH supply on exchanges hits an all-time low - FXStreet",
        "content": "Ethereum supply on exchanges hit an all-time low, 8.04% of the asset’s total supply is in exchange wallets.\n\nETH price gears up for a recovery alongside rise in active addresses on the Ethereum chain.\n\nETH price sustains above psychological barrier at $2,000, despite consistent profit-taking activities of traders.\n\nEthereum, the second largest cryptocurrency by market capitalization, noted a considerable decline in its supply on exchange platforms. ETH tokens on exchanges have hit a new all-time low since Ether’s genesis.\n\nAlso read: Orbit Chain hackers ring in New Year with $81.4 million exploit\n\nEther on exchanges hits lowest level recorded\n\nEthereum supply on exchanges now accounts for 8.04% of the asset’s total supply according to Santiment data. This is the lowest level recorded since Genesis. The altcoin’s supply on exchanges typically influences the asset’s price. A reduction in supply is considered bullish as it supports the thesis of declining selling pressure on ETH.\n\nEthereum supply on exchanges and price. Source: Santiment\n\nThere is an increase in active addresses on Ether, as noted by Santiment’s active addresses metric, in the chart below. This supports a thesis for ETH price recovery.\n\nEthereum active addresses. Source: Santiment\n\nEthereum trades above $2,200 despite consistent profit-taking by ETH traders since October 2023. The Network Realized Profit/Loss chart indicates whether traders are realizing losses or gains in their ETH trades.\n\nNetwork Realized Profit/Loss. Source: Santiment\n\nEthereum price could make a recovery to $2,551, the 61.8% Fib level of ETH’s decline from its April ‘22 peak of $3,582 to June ‘22 low of $883.42. Ethereum price faces resistance at $2,458, and $2,500 as seen in the chart below.\n\nETH/USDT 1-day chart\n\nA daily candlestick close below 50% Fib level at $2,232 could invalidate the bullish thesis for Ethereum price."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOVHFwdWxKckRzclhNei1TSUZrekk2WHdialdteTVaZWZCMHFsRlRoY0t6aXc0YjYyUkIya2pYYnQ3bnZoZ3ZFU3VDTEdBODJjUEd2ZDJTQ290NVF3TmpxMW9ZbjBVQWUzWkFQaGJkcFFlVTlFc0hiblZLak54ZGtlWk5zMkJDN3BwdURFYm5pdUsxV1BnaVFUSjRKZFJyQjcxMkVhaEQxUnBkamdUQVlNeDY3ekVXejg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Eyes $2,800 after Vitalik Buterin’s 2024 Proposal - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE1DanBNUEpNQWNxaEdWSVBDM1o5N3VkZ2FYQklyZV9CTzJzMzMwNHlHZzlmQ3YtbGkwMGtfVEdJdHk3eVF2LWZWdnFNWTNfOFJ6cmp3NEVmUENiNlVWYXFsall6MHVjTExQQzVFVmI2bw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Improvement Proposals to watch in 2024 - Blockworks",
        "content": "The latest Ethereum All Core Developers meeting finally put some tentative dates on the upgrade schedule for the next mainnet hard fork, Dencun.\n\nWith the caveat that it’s only “if no major issues arise,” Ethereum devs are eyeing the following dates for forking Ethereum’s public testnets:\n\nGoerli: Jan. 17\n\nSepolia: Jan. 30\n\nHolesky: Feb. 7\n\nThis will be the last time that Goerli is included in the testing regimen, as the network is slated for deprecation.\n\nThey also discussed what comes next — the as-yet-un-nicknamed Prague/Electra upgrade. The Ethereum community is considering whether to focus on a large core feature — which could take a year of work — or structure the upgrade around multiple smaller improvements, which could be feasible for late 2024.\n\nA decision will come in the new year, but for now, here are some of the improvements to watch in 2024 in the wake of Dencun:\n\nEIP-4844 (Proto-Danksharding)\n\nThis is the big kahuna among Dencun EIPs, which were the focus of many news stories in 2023.\n\nRead more: Ethereum’s next upgrade to focus on blobs\n\nThe upgrade “will reduce the cost of data availability across all layer-2s,” StarkWare co-founder Eli Ben-Sasson told Blockworks. “So that’s something that Starknet is very much anticipating so that users can have lower costs.”\n\nIt’s at the “forefront” of what Lucas Henning, chief technology officer of Web3 wallet developer Suku, calls “a year of groundbreaking improvements for Ethereum.”\n\n“[EIP-4844 is] a transformational enhancement” that will slash rollups gas fees “by up to 100x,” Henning told Blockworks.\n\nRead more: Core devs rule out Dencun fork this year\n\nAccount abstraction comes into its own\n\nAlso at the top of Henning’s mind are improvements taking advantage of account abstraction: ERC-4337 and its extension, ERC-6900.\n\nERCs are a subset of EIPs focusing specifically on token standards within the Ethereum ecosystem. They define rules for token implementations to ensure interoperability. Unlike some EIPs that modify the core protocol, ERCs typically don’t require a hard fork.\n\nERC-4337 went live in March and the concept of account abstraction “will play a pivotal role as the most significant changes for the end-user,” Henning said.\n\n“Account abstraction is set to revolutionize the way we perceive and interact with wallets, making gasless transactions the standard and secure social logins the new norm, fundamentally reshaping the Ethereum user experience,” he said.\n\nTraditionally, Ethereum has two types of accounts: externally owned accounts (EOAs) controlled by private keys and contract accounts controlled by their code. Account abstraction blurs this distinction, allowing users to create accounts that behave more like smart contracts.\n\nIt can enhance both user experience and security, and allows for more complex account logic, such as multisig wallets or social recovery of lost keys.\n\nERC-6900, introduced the concept of “delegated transactions.” This standard, which also did not require changes to Ethereum’s mainnet consensus, allows users to delegate the ability to send transactions on their behalf, for instance, to make one approval for a batch of actions to save time and hassle.\n\nEIP-1153 (transient storage opcodes)\n\nThis proposal, part of Dencun, aims to introduce a new mechanism for handling temporary or transient storage during smart contract execution.\n\nTraditional storage operations on Ethereum are permanent and consume gas. This can be inefficient for temporary data that doesn’t need to persist for longer than one transaction.\n\nEIP-1153 is an opcode (operational code) that would allow smart contracts to use transient storage — storage that would be wiped clean at the end of transaction execution.\n\nThe Uniswap team lobbied for 1153 to be included, and wanted it already in Shapella, but they couldn’t rally enough support to reach consensus among the core developers. The upgrade is expected to play a significant role in enhancing the capabilities and efficiency of Uniswap’s upcoming v4 protocol.\n\nRead more: What has Uniswap Labs cooked up for v4?\n\nBy enabling temporary storage, EIP-1153 can reduce the gas costs associated with storing data during contract execution and provide developers more flexibility in designing smart contracts.\n\nAnd by reducing the burden on permanent storage and minimizing state bloat, EIP-1153 can contribute to the overall scalability of the Ethereum network.\n\nEIP-4788 (Beacon block root commits)\n\nImagine Ethereum as a vast library with two main sections: the Ethereum Virtual Machine (EVM) section, which is like the reading room where people come to read books (execute smart contracts), and the Beacon Chain section, which is like the library’s catalog system, keeping track of all the books and their locations (consensus and coordination of the Ethereum network).\n\nBefore EIP-4788, these two sections functioned somewhat independently. The EVM section doesn’t have direct access to the up-to-date catalog; it has to rely on indirect methods to understand what’s happening in the Beacon Chain section.\n\nEIP-4788 proposes to put a “Beacon Block Root” (a summary or hash tree root of the parent block) into each EVM block.\n\nIt’s like moving from an outdated card filing system in a library — inefficient and sometimes inaccurate — to a system with a real-time, accurate and direct link to the main library database.\n\nIn this modern library, every time a new book is added, moved or removed (the Beacon Chain updates), the readers (EVM) have immediate and accurate information. Readers can trust they’re getting the most current information and the library operations (like executing smart contracts) are more aligned with the overall catalog system (the state of the consensus layer).\n\nAll this happens in a trust-minimized manner, eliminating the need for external oracles to provide this data, and thereby reducing potential points of failure or manipulation.\n\nThis change is particularly beneficial for liquid staking protocols such as Lido, smart contract-based bridges and restaking solutions, as it allows these protocols to access crucial data like validator balances and states directly from the consensus layer, enhancing their security and operational efficiency.\n\nEIP-4788 essentially introduces a protocol-level oracle, relaying Ethereum’s consensus state throughout the mainnet.\n\nMisha Komarov, founder of Nil Foundation, which is deploying a zkOracle for Lido, called it “definitely helpful.”\n\n“They need the consensus layer state root within their application logic (right now it is being proven by Casper FFG proof done via zkLLVM to the execution layer within the zkOracle design,” he told Blockworks.\n\nRead more: New Ethereum rollup takes a zero-knowledge approach to sharding\n\nEIP-5656 (MCOPY opcode)\n\nThe EVM operates using a set of opcodes that dictate various operations.\n\nEIP-5656 introduces a new opcode called MCOPY, which is proposed to optimize the process of copying data in memory during the execution of smart contracts.\n\nIn the current EVM architecture, copying large data segments can be inefficient and costly when using existing opcodes. MCOPY offers a more efficient way, one which is expected to reduce the gas fees associated with these operations, while improving performance.\n\nFaster memory operations mean quicker execution of contracts, and developers would have more tools at their disposal to optimize their smart contracts — particularly when dealing with large data structures or complex operations that involve memory manipulation.\n\nEIP-6780 (restrict SELFDESTRUCT)\n\nIn Ethereum, the SELFDESTRUCT opcode allows a smart contract to delete itself from the blockchain.\n\nWhen executed, it removes the contract’s code and storage from the state and sends the contract’s remaining ether to a specified address.\n\nHowever, this feature has led to several issues, including complexity in state management and potential security vulnerabilities.\n\nBy restricting SELFDESTRUCT, Ethereum can better manage its state size, leading to a more stable and predictable blockchain.\n\nThis is crucial for the network’s long-term scalability and maintenance, as it will simplify future Ethereum upgrades.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]