[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNX1JDVU1Nd3p1aDlma09qVXdFWUFKTDhkdEpJNFNoamhxczRsX0FTdTl4c1Z1WVFZOXQtOGNlOFFuQkVTUllyM1R4bGF5OThyX3A0alpOa1RudVRwdXJXUERYVWJBZFVwT2V2UkpaaThVVl9FaG50ckxZQThzSFZwNlMzNndhOUpsSjVka1pCb2xHNW1QNkVlRHN2R0ppdlpPdEVTXzF0SzNiZGp2UDBtRVJIb1NCRENNUURMZFdQTTItcFU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Bullish $34 Billion Signal Appears after $4k Rally - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQUHlRa2pMOWItWHNqODh3aTdSMWlGazdRem0wNzUwOTZJN2pOM0JicXpCcFlrOWwyLV9mWnFBS1VwNTJ3TV9Fc3pmQ3F6SEJFSmZ5TUlvVHE5eW9jckFxdl9KcksxQ0E2SGlGUkoxNVUxaTRIbFNadWpzYTBUUWRtMC1MXzNhUVlXbU5HMHA4ZXQtaUN40gGaAUFVX3lxTE1DSVR1cFdacFA1a0FBQmlNZHc5UG5fVlhqRDZpcUpqWlcxakpCUjFlcHRWMDVZZWQ5cGtpU3RNalJONXBJa1llaElUb1lKMFlNQkdKQnJPdktzNVgxWEdyQ2Jna0xZbVJ2UWpWNi1mQ3FlMW82UW8xNndDT3BHVmdzZEppZ1A4UWRpMVljUXdiMXNDSVlBRjI3REE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum’s Dencun Upgrade Set to Drive Near-Zero Transaction Fees - CryptoPotato",
        "content": "The forthcoming Ethereum Dencun upgrade scheduled for March 13 offers a chance for near-zero transaction fees for layer 2 (L2) solution users, possibly drawing in more new ones, as per a research report by Fidelity Digital Assets.\n\nThe forthcoming upgrade marks the initial step in Ethereum’s rollup-focused roadmap. This advancement will empower the network to function as a resilient database, enhancing the efficiency and cost-effectiveness of data storage for layer 2 blockchains.\n\nDencun Upgrade to Reduce Costs for L2 Blockchains\n\nAnalyst Max Wadington wrote that the Dencun upgrade would provide the necessary scaling capability to accommodate millions of users on layer 2 blockchains, positioning Ethereum as a more suitable distributed database for other blockchains. These enhancements are anticipated to attract significantly more users to the Ethereum ecosystem and broaden the network’s total addressable market (TAM).\n\nMoreover, the upgrade is poised to reduce costs for layer 2 blockchains to store data on the main network. This cost reduction is expected to be transferred to users through lower fees.\n\nLayer 2 solutions are separate blockchains constructed on top of layer 1, or the base layer, to alleviate scalability issues and efficiently manage data. However, the upgrade is not expected to benefit Ethereum users significantly, as the fee reductions promised to layer 2 users will not extend to those transacting on the base Ethereum blockchain.\n\nWadington explained that in the short term, users seeking to capitalize on this fee adjustment would need to compromise some decentralization and security by conducting transactions on layer 2 solutions instead of directly on the Ethereum network. Hence, it will likely encourage more users to bridge assets to other platforms.\n\nThe report added that conducting transactions on Ethereum for application-specific purposes would remain the preferred choice in the medium term, especially as layer 2 platforms mature.\n\nEthereum Price Surges\n\nEthereum surpassed the $3,000 mark and surged to over $3,900 earlier this week, reaching its highest value in almost two years.\n\nInvestor sentiment reflects optimism regarding the forthcoming Dencun upgrade and the potential approval by the U.S. Securities and Exchange Commission (SEC) of Ethereum exchange-traded funds(ETFs). Additionally, on-chain data reveals that nearly $200 million worth of ETH was burned in the past week, reducing the altcoin’s circulating supply and potentially fueling further price appreciation.\n\nAccording to CoinGecko data, Ethereum is trading at $3,789, up 8% in the last week. Notably, the second crypto by market cap has surged over 60% over the last month."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOVG8tOFRJS1dVWW96Q1pVOEkwS0ZQSWZ4TnRHekxQM0hQbUtYTVVkQjl3aTNmZURUbVZOMGltN2ZYeVJsLTBYSzN3Z2U3Yi12RW9LdkM2YW5zVndSdzkzSXF5ZV9RNXp0bHJMTkMwTnZUTldyS1dmOTdWU1pQRDZmUtIBhgFBVV95cUxQQmp0V05jaW52QXZLYXplZkdiSzZVQmtUZ1BrZWpwVlRhM0wtOHN0MHlYeElvOVNmSUNoaWRjMW95Mi12VmRaTmltQWo3dzFkaDlnbFk2REhtLUktZTc2WXdDdE9lV1M3VUtlYlRBd245cXVQeGFRakJQWHdXM1F4UDJPMU5mdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum is surging – Does that mean alt season is finally here? - AMBCrypto News",
        "content": "Capital is rotating into other altcoins led by ETH.\n\nEthereum’s TVL increased by 73.78%, indicating high altcoin interaction.\n\nEthereum’s [ETH] rise above $3,900 could be the catalyst that changes the market dynamics and helps altcoins climb higher than they have.\n\nEver since Bitcoin [BTC] hit a new all-time high, ETH has been outperforming it. This brought about the notion that Bitcoin’s dominance might have taken a step back.\n\nWhenever this happens, ETH’s price performs better. But the second most valuable cryptocurrency is not always the only beneficiary of this flipping. Most times, profits gained from ETH and BTC increase flow into other altcoins.\n\nETH is set to kickstart the ride\n\nAMBCrypto analyzed on-chain data from Santiment to check if it was the case this time. According to our analysis, we observed that capital has been rotating into other cryptocurrencies. Some of these include Render [RNDR], Fetch.ai [FET] and Fantom [FTM].\n\nWe arrived at this conclusion after assessing the whale transactions valued over $100,000. At press time, these large transactions have been occurring since the 5th of March.\n\nBut the ones recorded in the last 24 hours have been enormous, indicating that the much-anticipated altcoin season was here.\n\nAltcoin season is a terminology used to describe a market boon when other cryptocurrencies outperform Bitcoin. But something AMBCrypto noticed about the aforementioned cryptocurrencies was that they were all ERC-20 tokens.\n\nFor those unfamiliar, ERC tokens refer to fungible assets created on the Ethereum blockchain. Therefore, one can conclude that there was high interest in ETH and other assets linked to the network.\n\nIf capital continues to flow into these assets, other tokens built on Ethereum might follow. How about the Total Value Locked (TVL)?\n\nAssets locked proves that it’s time\n\nAccording to DeFiLlama, Ethereum’s TVL was $55.30 billion. This value represents a 73.78% increase in the last 30 days.\n\nThe TVL is an indicator of a protocol’s health. When it decreases, it means the protocol lacks an inflow of liquidity. This could also mean that market participants do not trust the blockchain enough to produce good yields.\n\nOn the other hand, an increasing TVL suggests that participants perceive the project to be trustworthy. Thus, the network enjoys a wave of capital flow which improves its health. This was the case with Ethereum.\n\nIf participants continue to bridge assets into Ethereum, the TVL might close in on its previous all-time high.\n\nRealistic or not, here’s FET’s market cap in ETH terms\n\nA rise toward $106 billion could also affect ETH’s price. Should this be the case, ETH could rise past $5,000 at the peak of the bull market.\n\nAlso, other altcoins might not be left out. For instance, FET, which has seen a 377% 90-day increase might trend higher. FTM’s price might also rise in the $3 direction while RNDR’s price could also swing upwards."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxOQmNjb0w1SVRhaUZ2QXBxdzVNOGNsOHBjLUNza1dmTGRfWWFpYXJXcjlvUUF3R0tYWUtLVUpSYmtuSmQtdkZZY3pSSG56bHdNRTZSTXU3d1BoVkJmdHQ2SnFPd0szQVpxOUlucjM0QW5nTEpMX0l5LUFFZ1ZIYzAzZGs2S0lnSmJvX0RWeG9SSUZJcEhkSmpGcHFCZWpXNWg5TTJTWG92SWRZNHVTa3h6QnZxbkZUVG82TzhFZG9CbmU3UWh6NzRaVnpUbDl0S3prbW5xRmd6cHdBaEVnb05VRlBpQnZUcFU5eUZ0R2FSZ0XSAfYBQVVfeXFMUFlKMlF1SkpvYkQtY0cyYXpJRzVhN3Jqb3BmQ19sV3B4YWFwWVZnX3BhMzNsWE91WW9EWmJtdnliLTBuMnNNTEM1ZnFsa0UxeEkwbnNGUDV5bDI1MlNlS0owTjA1b1V6QS0tWUZ2UGZVODFWX3FOOWJ0c0QxMllqbHlvUHhGZGQtbG9Qb0tnSnpjUU9Lc042TDczdzVxS2liMmJGdDhVU2dYbm5aalZBenNfRldKUXRNVF9pbVh1YnlvXzdzUmMwVHQtampqRnFNS3dsVFN0a3pWYWdzQWxucmhrQ0E0Ti1PVmdObC0zbDJERzdhU1hn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Over half a billion dollars in Ethereum has been burnt in the past month, ETH holders await Spot ETF approval - FXStreet",
        "content": "Ethereum worth $583.94 million has been burnt in the past thirty days, slashing the altcoin’s circulating supply.\n\nEthereum hit a new high at $4,012 on Binance, ahead of the upcoming Dencun upgrade.\n\nETH holders await Spot Ethereum ETF approval by the SEC, attorney comments on likelihood of approval.\n\nEthereum price hit a new high of $4,012 for the first time since late December 2021, marking a key milestone for the altcoin ahead of its key upgrade. Ethereum holders are awaiting the upcoming Dencun upgrade, the most significant development since the altcoin’s migration to Proof-of-Stake.\n\nAlso read: Ethereum price tags $4,000 on Coinbase for the first time since 2021\n\nEthereum burn picks up pace closer to Dencun Hard Fork\n\nEthereum has been under the spotlight since the altcoin hit a new high on Friday, crossing the $4,000 level, on Coinbase and Binance. The altcoin made a comeback above this level for the first time since late 2021.\n\nEthereum had a major developmental milestone when it migrated from Proof-of-Work consensus mechanism to Proof-of-Stake, marked by the Merge. The next major milestone is the introduction of proto-danksharding, through EIP-4844, one of the improvement proposals included Dencun Hard Fork, scheduled for March 13.\n\nData from ultrasound.money shows that nearly half a billion dollars in Ether have been burned in the past thirty days. This metric has significance for ETH holders since it supports the reduction of the altcoin’s circulating supply and reduces the selling pressure on Ether.\n\nEthereum burned in 30 days. Source: Ultrasound.money\n\nEthereum price gains are supported by the bullish developments in the altcoin. The next target in Ethereum’s uptrend is likely $5,000, close to the December 2021 peak of $4,936. The Moving Average Convergence/ Divergence (MACD) indicator and the Awesome Oscillator (AO) support Ethereum’s uptrend and signal that the altcoin could rally higher.\n\nETH/USD 1-day chart\n\nA daily candlestick close below the 38.2% Fibonacci retracement of Ethereum’s climb to its 2024 high, at $3,307 could invalidate the bullish thesis for ETH. The altcoin could find support at the psychologically important $3,000 level if a correction ensues.\n\nSpot Ethereum ETF approval likely?\n\nAttorney Jake Chervinsky commented on the status of Ethereum as a commodity. The attorney states that the Securities and Exchange Commission (SEC) is less likely to follow through on its classification of the altcoin as a security, since this would conflict with the Commodity Futures Trading Commission’s authority. The CFTC has labeled Ethereum a commodity and the two entities are less likely to engage in a “civil war” like situation, says Chervinsky.\n\nThe status of Ethereum as a security or non-security has a direct impact on whether the SEC approves a Spot Ethereum ETF in May, the last deadline for the applications. Ethereum holders are anticipating an approval, and a similar impact on institutional capital inflow and is likely to act as a catalyst for the second-largest asset by market capitalization.\n\n(This story was corrected on March 10 at 04:33 GMT to say that Ethereum price hit a new high of $4,012, not a new all-time high.)"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQaFdXa1pITFRnTElCc0lWZW1HRG1PVHpVc1E4dTlyR2Y2WUplalNJSkRsdkNRZ1M2cUVxNWZaTmEzZDRUNzVjei1NYlVtZ1doRTR3Q2NFbkc4NkZCNWdhYXF6TUwyaEtmTGM0dnctb3VlcWF3T3pnNlZVX2J5bzVDQjR4MDJGUnRUQ0QwY0dGdEp5bWFX0gGaAUFVX3lxTE1QUlFRaVFFSUZFZVFaSTh3QmRMb1BBVW1EMnAyeV9GemZJcDg2U3d2MkZGSEFrVDB2T2hXVndKdzVhT0VjaTBQd3JoZ0NzWHRMaE9vRk1xblJ3OEdteVl3RGpYdldvaE8tWVppWGZnYWtxd21hN21Eb1NTMTdJbE1ybEJaTDNmaHcwVTZySVlrczRSQmFCYW9zN3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Braces For $5000 Rally With No Major Pullback On Horizon - CoinGape",
        "content": "The world’s second-largest cryptocurrency by market cap, Ethereum (ETH) ,surged past $4,000 on Friday, March 8. However, the ETH crypto faced a minor pullback. At press time, the Ethereum price was trading at $3,933 with a market cap of $472 billion.\n\nEthereum (ETH) Price To See All-Time High Soon\n\nCrediBULL crypto, a prominent crypto analyst, has weighed in on the current market dynamics, particularly focusing on Ethereum (ETH) following Bitcoin’s recent achievement of tagging its previous all-time high (ATH).\n\nadvertisement\n\nAccording to the analyst, there’s widespread anticipation within the crypto community that Ethereum is the next in line to surge, given Bitcoin’s ATH milestone. Those who have remained on the sidelines are reportedly eyeing a potential pullback to the $3600-$3700 range, a sentiment echoed by many participants in the market.\n\nHowever, CrediBULL crypto suggests that such a pullback might not materialize immediately, as the demand for Ethereum remains strong. The analyst says he wouldn’t be surprised to witness Ethereum’s price surge by another 25% or more before any significant correction occurs.\n\nOn the other hand, Ethereum continues to outperform Bitcoin as we move ahead in 2024. Over the last week, Bitcoin (BTC) price gained by 10% while ETH added 15% gains in the same period.\n\nBoosted by the imminent Dencun upgrade and a bullish atmosphere from Bitcoin’s profit recirculation, Ethereum, the second-largest cryptocurrency, is gaining momentum. Analysis of the ETH/BTC chart indicates that altcoins are nearing a breakout point.\n\nAll Eyes on Dencun Upgrade\n\nIn the next week, the Ethereum blockchain will undergo its much-awaited Dencun upgrade bringing significant improvements to the network. The upcoming Dencun upgrade scheduled for this month will reduce transaction costs on layer 2 networks, stimulating increased activity and potentially drawing mainstream consumer interest to Ethereum.\n\nAnother catalyst is the pending regulatory decision on spot Ethereum ETF applications, expected in May. Although the approval odds are less certain compared to spot Bitcoin ETFs, it still brings excitement to ether, according to the Bitwise analyst.\n\nAccording to IntoTheBlock data, ETH mainnet’s revenue from network fees surged to $193 million this week, marking the highest level since May 2022 and reflecting a 78% rise from the previous week. This notable increase in on-chain activity was primarily fueled by heightened speculation involving meme coins.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]