[
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxQZ2kya3pQLWdwT3FZVUN5a2g3dW10NjRmWmN2S2RuYXpLUGRKcmQzci1qS05YUXNsUEZCZ1hPSkk2cVpIYW9vU1JlMEVtS3ZPck9SODhKVmFLVGRhOVhyZi16MTN0dEh4WFhtMEFObUNpZ0pUcEkyQTNZejI3ZXM1dnVNUDh6Qnl3WWNRSXAzTEJYbm1oQXdRTmMtZE9YOXVGRVdVUUhlSENRWFI2UzVUZkFtS18zNFVLWkxZMXJQSXpRSW10TG1LLXhObm1MdWVEU1pzX3U3dnJudHpn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "If You Invested $100 In Bitcoin Cash, Ethereum Classic And Dogecoin In March 2020, Here's How Much You'd Have Now - Benzinga",
        "content": "Investors who have put money into major U.S. indices have enjoyed respectable returns since the bottom of the market in March 2020.\n\nIn fact, the SPDR S&P 500 ETF, Invesco QQQ Trust Series 1 and SPDR Dow Jones Industrial Average ETF Trust have returned 127%, 159% and 102%, respectively, since then.\n\nAs good as investors in the major U.S. indices have had it since 2020, a number of cryptocurrencies have performed that much better. Crypto bulls who bought when U.S. markets bottomed out in March 2020 and held on for the long term, despite the ongoing volatility, have been treated to epic returns on their investments.\n\nSee Also: EXCLUSIVE: Marathon, Riot, Hut8 CEOs Tell Benzinga How Bitcoin Halving Will Impact Miners\n\nWinners Since March 2020: Here's how much $100 in each of the following cryptocurrencies and stocks back at the bottom of the U.S. market in March 2020 would be worth today:\n\nBitcoin Cash BCH/USD : $354\n\n: $354 Ethereum Classic ETC/USD : $715\n\n: $715 Dogecoin DOGE/USD : $10,965\n\nWhy This Matters\n\nInvestors keen on maximizing returns and diversifying their portfolios must acknowledge the emergence of cryptocurrencies as a viable asset class offering substantial growth opportunities. The staggering returns exhibited by cryptocurrencies such as Bitcoin Cash, Ethereum Classic and Dogecoin highlight the potential for outsized gains in this rapidly evolving market.\n\nWhether one chooses to allocate funds to established indices or explore the potential of cryptocurrencies, staying abreast of market trends and assessing risk factors are essential for making informed investment decisions in an ever-changing financial landscape.\n\nSee Also: Hold On To Your Dogecoin: It’ll Be The ‘First Meme Coin To Reach $100B Market Cap,’ Says Trader"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNMVNFVTBCa2tQVmlFTHNCcjRTdnZCRXhuSkYyZmhsb1A2TUpycVZxTHhGbVVoanQyYTcybExxaWlzZzlMTlRsSmdUWFA5anhOWWswZDJBdkktWlY5UWlFeGdaelZmdVpUbkRfODdNQmFWaFBYVWRTQXA5TFVRUGxEMTJFOXZzTlNYX3JKNmU0V1lrblpwRTAweFNwbkxmWVc5ZVBSeC1EelNpTEZKbGpyUnlnaXpOSUhrcnJfU09ROHI4eV8tMm1yclBTS1pJNmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Outpaces Bitcoin With 8% Surge Fueled By US ETF Approval Rumors - Benzinga",
        "content": "Ethereum ETH/USD, the world’s second-largest digital asset, has experienced an 8% surge in the last 24 hours, outperforming Bitcoin BTC/USD.\n\nWhat Happened: This sudden increase is believed to be connected to rumors about the possible approval of U.S. exchange-traded funds (ETFs) for the cryptocurrency, reported Bloomberg.\n\n“There’s been some chatter about Ether ETF issuers meeting with the U.S. Securities and Exchange Commission,” said Edward Chin, co-founder of digital-asset hedge fund Parataxis Capital.\n\nInvestment powerhouses such as BlackRock Inc. and Fidelity Investments have lodged applications to initiate Ether ETFs. However, the regulator’s approval of these applications remains uncertain.\n\nJames Seyffart and Eric Balchunas, Bloomberg Intelligence ETF analysts, predict a 75% likelihood that the SEC will deny Ether applications by May. They refer to data that indicates relatively weak correlations between spot and futures markets.\n\nPrice Action: At the time of writing this article, Ether is currently trading at $3,690.58, marking a 7.57% increase over the last 24 hours, while Bitcoin surged 1.72% in the same time period. Moreover, the price has surged by 10.74% over the past 5 days, according to the data from Benzinga Pro.\n\nSee Also: Benzinga Bulls And Bears: Tesla, Apple, Meta And A 2013 Bitcoin Supporter Now Says ‘Yes’ To Shiba Inu\n\nWhy It Matters: The recent surge in Ether’s value comes after a period of uncertainty in the cryptocurrency market. Earlier this month, both Bitcoin and Ethereum fell below key support levels, hinting at a potential shift in market sentiment.\n\nDespite this, optimism about the approval of Ether ETFs has been growing. Digital Finance Group CEO James Wo stated there was a “high likelihood” of such approval. This sentiment was echoed by JPMorgan, which remains hopeful about the SEC’s eventual approval of spot Ethereum ETFs.\n\nThe speculation surrounding Ether ETFs has also led to a surge in the Bitcoin-Ether ratio, a key indicator in the cryptocurrency market, signaling caution amid the ongoing crypto rally.\n\nRead Next: ‘We’re F’d,’ Says ‘Rich Dad Poor Dad’ Author Robert Kiyosaki Because Fed Chair Powell ‘Finally Admitted Admitted Inflation Is Winning’"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNMVNFVTBCa2tQVmlFTHNCcjRTdnZCRXhuSkYyZmhsb1A2TUpycVZxTHhGbVVoanQyYTcybExxaWlzZzlMTlRsSmdUWFA5anhOWWswZDJBdkktWlY5UWlFeGdaelZmdVpUbkRfODdNQmFWaFBYVWRTQXA5TFVRUGxEMTJFOXZzTlNYX3JKNmU0V1lrblpwRTAweFNwbkxmWVc5ZVBSeC1EelNpTEZKbGpyUnlnaXpOSUhrcnJfU09ROHI4eV8tMm1yclBTS1pJNmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Outpaces Bitcoin With 8% Surge Fueled By US ETF Approval Rumors - Benzinga",
        "content": "Ethereum ETH/USD, the world’s second-largest digital asset, has experienced an 8% surge in the last 24 hours, outperforming Bitcoin BTC/USD.\n\nWhat Happened: This sudden increase is believed to be connected to rumors about the possible approval of U.S. exchange-traded funds (ETFs) for the cryptocurrency, reported Bloomberg.\n\n“There’s been some chatter about Ether ETF issuers meeting with the U.S. Securities and Exchange Commission,” said Edward Chin, co-founder of digital-asset hedge fund Parataxis Capital.\n\nInvestment powerhouses such as BlackRock Inc. and Fidelity Investments have lodged applications to initiate Ether ETFs. However, the regulator’s approval of these applications remains uncertain.\n\nJames Seyffart and Eric Balchunas, Bloomberg Intelligence ETF analysts, predict a 75% likelihood that the SEC will deny Ether applications by May. They refer to data that indicates relatively weak correlations between spot and futures markets.\n\nPrice Action: At the time of writing this article, Ether is currently trading at $3,690.58, marking a 7.57% increase over the last 24 hours, while Bitcoin surged 1.72% in the same time period. Moreover, the price has surged by 10.74% over the past 5 days, according to the data from Benzinga Pro.\n\nSee Also: Benzinga Bulls And Bears: Tesla, Apple, Meta And A 2013 Bitcoin Supporter Now Says ‘Yes’ To Shiba Inu\n\nWhy It Matters: The recent surge in Ether’s value comes after a period of uncertainty in the cryptocurrency market. Earlier this month, both Bitcoin and Ethereum fell below key support levels, hinting at a potential shift in market sentiment.\n\nDespite this, optimism about the approval of Ether ETFs has been growing. Digital Finance Group CEO James Wo stated there was a “high likelihood” of such approval. This sentiment was echoed by JPMorgan, which remains hopeful about the SEC’s eventual approval of spot Ethereum ETFs.\n\nThe speculation surrounding Ether ETFs has also led to a surge in the Bitcoin-Ether ratio, a key indicator in the cryptocurrency market, signaling caution amid the ongoing crypto rally.\n\nRead Next: ‘We’re F’d,’ Says ‘Rich Dad Poor Dad’ Author Robert Kiyosaki Because Fed Chair Powell ‘Finally Admitted Admitted Inflation Is Winning’"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQcmszVnVYZHBHSWUzc1dfaUtSTGcwSlR6ZFROaXZhbHFXX3JrZ2IzdTBhVHFmWU1rdEF2ZlVvNi12UzZJd2prMlpiOG1ZTFY2NVM3eHVlZG1Ya3JqUm1FaFB0eWZad1pVMUpwcS1uN1FCcGRGa2Z1V3dTUHlWZTl1YmlsWk1xaXFhUWJrbmJ5R21LSWVuODJUcGlZNDZramRtTlFBeVpjTm_SAa4BQVVfeXFMUFE5bUpGQzhKUEl6NlFNek9qajNTUmgxZHFNVmxMY1J3aDQyU21lYUtYbk9obVB2X3JrR3g5YUYyRnBlVlNXRXFqd081MnNSY3VjdnlMcGtrNGo0clZkVW54eUdjdkNwNjA0MnE1WEZ3MjFwS2lPTUhzMFBXcTMtVmJJdTJOaEdiRnlrYlNwcWtVUDUyYmRXeHlIZHRiVUo4VW1jamc2US1ZRWZOZndR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin ETF issuers say SEC will reject ether exchange-traded funds - CNBC",
        "content": "\"We were the first to file as well for ethereum in the U.S., and we and [Ark Invest CEO] Cathy Wood, are kind of the first in line for May, I guess, to probably be rejected,\" VanEck CEO Jan van Eck told CNBC's Arjun Kharpal at the Paris Blockchain Week crypto event in France.\n\nSome issuers are not confident the SEC will greenlight the ether applications.\n\nCompanies ranging from BlackRock to Fidelity and VanEck, which issued spot bitcoin ETFs this year, have been waiting for approval of an ether product.\n\nThe regulator has a late May deadline to conclude its review on an ether ETF. That comes after the SEC in March delayed its original deadline for a decision on the ether ETF application.\n\nPARIS — Issuers of spot bitcoin exchange-traded funds on Tuesday say the U.S. Securities and Exchange Commission is unlikely to approve such a product for the cryptocurrency ether .\n\nArk Invest was not immediately available for comment when contacted by CNBC.\n\n\"The way the legal process goes is the regulators will give you comments on your application, and that happened for weeks and weeks before the bitcoin ETFs — and right now, pins are dropping as far as ethereum is concerned,\" van Eck added.\n\nEnthusiasm has been mounting among the crypto community for an ether ETF, ever since the SEC approved the first spot bitcoin ETFs in January.\n\nThe ether price has been climbing this past week on the back of hopes that the SEC will approve an ether-backed ETF.\n\nThe token is up about 10% in the last seven days, according to CoinGecko data.\n\nHowever, the U.S. regulator has signaled that it might not be so willing to approve such an investment product.\n\nSEC Chair Gary Gensler has previously stressed that \"the vast majority of crypto assets are investment contracts and thus subject to the federal securities laws,\" in the agency's view.\n\nThis complicates matters for an ether ETF.\n\n\"We are observing the ethereum decision very, very closely,\" CoinShares CEO Jean-Marie Mognetti told CNBC on Tuesday. \"CoinShares was not in the race for the bitcoin ETF until three months before the approval, and we managed to qualify ourselves at the last minute.\"\n\nHe was equally pessimistic over the odds of gaining such an approval in the short term.\n\nCoinShares is not one of the companies in the running for an ether ETF in the U.S.\n\n\"I don't see anything being approved this side of the year,\" he noted, suggesting it may be difficult to gain SEC approval for proof of stake — a protocol specific to blockchain.\n\nBitcoin is underpinned by a different protocol, known as proof of work, where volunteer miners validate transactions and mint new tokens.\n\nThe SEC has not taken issue with proof of work from a securities law standpoint."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPLWc5QWI1WkR2TFFUODQySGNFVTZXRjUzOHpMR3J0azRJTEQ5UFdiUjFwaWY2NF9aSnluRnByVlplQWREZzNMMnBjaTN5Q1BiYTNRME1OYVAwQkprTGxTZDViMWk2UjRTcWpzaDA5OVR3SmVJYTUzYWxHcnNJM0pMdmtYUUJXbUNoMUJLc1J0LVp5VHI0RnpBYzVSLW9vZ0p4Nl9JbWxyNnZiTVprblpaeXZPV3JBODdvcGNqNjJrTElUZnF1SW01OXpmS28xZThrdVBsQjQwWnVDRlg20gHiAUFVX3lxTE80X0FBR0lHbWZoOUNYZFhNZ1V0ODYydEJnZTNLbzd4QVNITDQzclM0ZzU3TzIwN1ozdU9rOHZnd3R4ZHRLX0RZNm5TSkFZSzFuWDlhbGlHc1hhejdwLWZyUkxoTVFJem5naTZheWZuX0RMMnE2UWhqdG1ZeW92RWlmNHNlbHpGUkRyOUNXQU1lUEVxdUktdlRnRmFQWU5sVGZESEdGZzNLWXRkeEpDLXgwcVp5VHZTU3lSY3hoTUxkRjRKaXE2bGNzVEx4bmhmVnNEaWNhLXNyaDJ1VzZTYWt0N2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Will Ethereum's classification as a security disrupt Web3 innovation? - The Economic Times",
        "content": "Transitioning to Proof-of-Stake\n\n\n\nChallenges and Uncertainties for Web3\n\n\n\nThe Decentralization Dilemma\n\n\n\nLooking Ahead: A Web3 Future in Question\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nBlackRock’s CEO Larry Fink has been quoted today in the media stating that even if Ethereum (ETH) is classified as a security, a spot Ethereum exchange-traded fund ( ETF ) might still be possible. The recent launch of several Bitcoin ETFs by the U.S. Securities and Exchange Commission ( SEC ) was a positive step for the crypto industry, offering investors a clearer path to participate in the virtual digital asset class. This regulatory progress has fueled optimism within the crypto space, with many anticipating a similar green light for Ethereum ETFs in the near future.The success of Bitcoin ETFs, alongside the ongoing price rally, has undeniably instilled a sense of excitement about the potential of Ethereum and the broader blockchain landscape.Amidst these, the recent media reports about SEC reportedly investigating the Ethereum Foundation, coupled with the ongoing debate about Ethereum’s native token, ether (ETH) ’s potential classification as a security, raises critical questions about the impact on Web3, the burgeoning decentralized ecosystem built on Ethereum's blockchain technology.Ethereum, conceived by the visionary Vitalik Buterin in 2013, introduced a revolutionary concept: a decentralized platform for building smart contracts and decentralized applications (dApps). Its impact has been profound, fueling the rise of DeFi (Decentralized Finance), NFTs (Non-Fungible Tokens), and a myriad of other innovations that comprise the Web3 industry.Previously Ethereum relied on a proof-of-work system to secure its network. Like in Bitcoin, in Ethereum computers competed to solve complex puzzles, with the winner earning newly minted Ethereum tokens. Every time a transaction is carried out on the Ethereum platform, one has to pay a gas fee or a transaction fee, irrespective of what the nature of that transaction might be. The gas fees previously were high, going up to $150 per transaction.To solve this problem and after years of testing to replace energy-intensive mining, Ethereum switched on its proof-of-stake mechanism in 2022. The new proof-of-stake system eliminated this competition. Instead, users \"stake\" their existing Ethereum holdings to validate transactions and earn rewards. This shift is estimated to have reduced Ethereum's energy consumption significantly. The ecosystem carried out another upgradation recently, called the Dencun upgrade, as a result of which transaction fees are expected to plummet to almost zero. Dencun achieves this by reducing rollup fees through the introduction of \"blobs,\" larger data packets that enable more efficient handling and storage of transaction-related information.Does staking constitute an investment contract, a key characteristic of a security?Since the transition from a proof-of-work to a proof-of-stake system, a debate among regulators and industry experts has sparked: could Ethereum's new model classify it as a security? The US SEC, for instance, in the past suggested this model could grant excessive control to the network's developers, potentially undermining its core tenet of decentralization.The potential classification of Ethereum as a security could have significant ramifications for the Web3 industry, raising critical questions about decentralization, regulation, and accessibility. It might lead to overly broad regulations, potentially impacting trading platforms, investor participation, and the overall market dynamics within the crypto space.Ethereum is the foundation for a vast ecosystem of decentralized applications (dApps) and Web3 projects. These applications, ranging from DeFi to NFTs rely heavily on Ethereum's Layer2 Of late, the total value locked (TVL) in DeFi ecosystem has experienced a significant resurgence, reaching a milestone of $100 billion, Ethereum leads the space with over 60% market share.A security designation for Ethereum could create regulatory hurdles for dApps built on its network, potentially stifling innovation and growth within the Web3 space.Decentralization is a core principle of Web3, aiming to create a more transparent and user-controlled internet experience. However, the SEC's potential classification of Ethereum as a security could centralize control, as exchanges may delist the asset or restrict trading for certain investors.The inherent decentralization of Ethereum, or for that matter any blockchain, presents a significant challenge to the potential enforcement of any forthcoming regulations. The ability of the SEC, or any national regulatory body, to effectively implement restrictions would be limited by the global nature of the crypto market.The ramifications extend beyond Ethereum itself, encompassing the broader crypto space. If Ethereum is classified as a security, it sets a precedent that could potentially impact other blockchains operating on similar principles.Currently, DeFi boasts 15 million daily transacting users, a number projected to surge to 100 million by 2025. The prospect of mass adoption of blockchain technology looms large, and the recent upgrades in Ethereum network were certain to incentivize developers to build even more innovative use cases. While regulations aim to protect investors, and rightly so, finding a balance between investor protection and fostering innovation will be crucial.As we confront these questions, one thing remains clear: navigating a new and innovative space like Web3 requires ongoing collaboration and a commitment to fostering responsible growth. Ethereum holds a significant place in the broader decentralized ecosystem and any such regulatory decision will have profound implications for the future of Web3 and shaping the next chapter of the digital revolution.(The author is Co-Founder, CoinDCX & Okto)(Disclaimer: Recommendations, suggestions, views, and opinions given by experts are their own. These do not represent the views of the Economic Times)"
    }
]