[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNU3hITFRmXzNtdG1qTDdaWlBRM24xMVJUZ05jVnpnYUd3WDR1djQ2clhfT2pUUlV3Ul9YZ1MtNGtCNnFfa2ZFQk94NE1NUGQ2TzhISGxwUDJUNlhTVDNQWHNFZWlfTkpwT0p6Q2Z6bFdGSUliQWlJczh4ekZWbDl6Vm45cDg4am1aMzJaMzF1TDdnOFU2V3lz0gGkAUFVX3lxTE5Cb3FxdExxM1RyQ2U2cVpHRWM1bHZDWnFzRUdORkI5aHpKME1tSnFILVJzemtOQ2RWU1o3VXYza2RCYTFFeHJHUXdHdFR3V3R4NTJRY3gyNU12SDNiaEJEa3ZtT0JrRHZMRHk1TXdHSDAxWE9XUHN4UllRZmNtU01FS1I4dWliZFJtNVJ2VTVEX2hudXhiV1NvOW1MbDQzV05CaEVv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 03 Feb 2024 08:00:00 GMT",
        "title": "Role of Ethereum (ETH) in the Digital Art Revolution - Analytics Insight",
        "content": "In the realm of blockchain technology, Ethereum (ETH) has emerged as a trailblazer, not only reshaping the landscape of decentralized finance but also playing a pivotal role in the digital art revolution. This article explores the multifaceted ways in which Ethereum has become a catalyst for the transformation and empowerment of digital art."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNaFlHdTViTDFUb2MtLURwLTRDTGxZS0w5SE5NVjhCa2cwV1BLWm5vTHJyeUJtUjQ5cFRKTHc4eGY1YjRoYUJzX2ZIZGdWUFJoNm10a05BR19MaG5PMlBXVy1ESnlGbHptaks5cWZKZlBtY0xmUHc1eGE4M3BHdU93XzlrMGRvVDNtcHBqd0RidHRIMENB0gGaAUFVX3lxTE5ybTZ6cml5THFYWU1rLVhoVnNQcVZQaTV0RmNkN2FTazdZaDROdjQzMlVEcXpGdy1mdEVrNkJLdFdmZnBNMkNfT2ZlblppSFN2azZ3aUF2cV9pZ2JsWmZKQVdJbmpwNTFDcDF3R0lVMWZnMkVQV0x2N3dpWS1mdFRac182cDNLcUt6dkc4R3drdnJNOThIZHRDNnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 03 Feb 2024 08:00:00 GMT",
        "title": "Ripple (XRP) Competing With Ethereum? XRP Ledger Developer Chips In - CryptoPotato",
        "content": "Not many cryptocurrency investors think of XRP as an Ethereum competitor. That would be blockchain coins like Solana, Cardano, BNB Coin for Binance Smart Chain (BSC), and Avalanche.\n\nRipple Is A Real Ethereum Competitor\n\nXRP Ledger (XRPL), however, extends the RippleNet ecosystem. With it, the cross-border payments platform for easy foreign currency exchange and fast settlement is a full-fledged DeFi chain.\n\nXRPL provides support for coin issuance, smart contracts, and the full gamut of DeFi use cases, with XRP as the native token. That makes XRP Ledger an Ethereum competitor.\n\nSolana, Cardano, and Avalanche get most of the media attention as potential “Ethereum Killers.” But XRP Ledger is in the background, quietly and steadily developing Ripple into a DeFi crypto.\n\nXRP Ledger’s Road Map In 2024\n\nMoreover, in a recent update on X, XRPL lead developer Wietse Wind outlined the Ledger project’s road map:\n\n“Well, [Vitalik Buterin] had a profound impact on this entire space, and now, 10+ years later, the XRPL ecosystem is still trying to capture even the tiniest bit of developer activity compared to what EVM did. If we can iterate on his contributions, ship even better L1 smart contracts more suitable for real life, every day utility, and capture dev and retail activity, we’re on the right track.” Well, the guy had a profound impact on this entire space, and now, 10+ years later, the XRPL ecosystem is still trying to capture even the tiniest bit of developer activity compared to what EVM did. If we can iterate on his contributions, ship even better L1 smart contracts more… — WietseWind (🛠+🪝 Xumm @ XRPL Labs) (@WietseWind) January 31, 2024\n\nThat part about shipping “better L1 smart contracts” for “real life, everyday utility” is important. That’s what drives active user statistics, brings on developers, and interests investors.\n\nBirthday well-wishes to Buterin, who founded Ethereum in 2013, prompted Wietse’s post. XRPL Commons posted,\n\n“Happy Birthday [Vitalik Buterin]! Celebrating your visionary impact on the blockchain space, you are a true innovator that continues to inspire our ecosystem.”"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFB1S2hfLTU2TmdtOFlEZi1yZ3BDMTVZUUFxZUFfSjEzV0ZiNmtTekd3UzhpTnNGeVQxbXB6TUFBbWtNLVFUSk4xc0kybUVTTkNENTFOWDV6dDVFc04wZ1ZtRktiS2xITXRKcUpOdXgwUWk3U3Q3Uzg0b1huVFo2WmvSAYQBQVVfeXFMUG9WcEt3clRDN05iUktxeEJ1Wkt0TERIYXltWEdpV2E3amlKNUhqaHQwc1M0MjcyYUpTb1VPTTNISzhKTE1Tby1UOGRWOUVFcXhNWEQyZDQzSnd0MFYyOGd4U3hJMDFEN2pZODREVEIzSnBCVWpXTVFHdjItVjBsT3lRQkd4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 03 Feb 2024 08:00:00 GMT",
        "title": "$500 Million Worth Of ETH Leave Exchanges Last Week - What This Means For ETH - Bitcoinist",
        "content": "Ethereum is currently trading at $2,290 and is on a marginal increase of $0.17 in the past week. Although lacking much action and trading around $2,300 for most of the week, on-chain data regarding outflows has revealed the current sentiment among traders. According to data from on-chain analytics company IntoTheBlock, $500 million worth of ETH was withdrawn from centralized exchanges this week, bringing the total outflow in the past month to $1.2 billion.\n\nSurge In Ethereum Outflow From Exchanges\n\nEthereum went on an unforeseen price growth subsequent to the approval of spot Bitcoin exchange-traded funds in the United States. Consequently, various on-chain data have revealed a strong bullish sentiment, with the second largest crypto witnessing outflows from exchanges since this period. Outflows were particularly exacerbated last week, per IntoTheBlock, contributing a larger portion of $1.2 billion ETH withdrawn from exchanges in the past month.\n\n$500M in $ETH was withdrawn from CEXs this week, adding to a total of over $1.2B in outflows in the last month pic.twitter.com/e8NFOGtrDV — IntoTheBlock (@intotheblock) February 2, 2024\n\nEthereum currently trading at $2,308 on the daily chart: TradingView.com\n\nAccording to CryptoQuant, 1.622 million ETH were withdrawn from crypto exchanges last week. A similar metric from the analytics platform shows the ETH reserve on exchanges has been on a free fall for the past year. As of the 4th of January, the statistics indicated that the total quantity of Ethereum that was deposited with various cryptocurrency exchanges amounted to 14.69 million. This number, however, has decreased by 397,012 ETH over the past month, bringing it down to 14.296 million ETH at the time of this writing, its lowest level ever.\n\nWhat Does This Mean For ETH Price?\n\nDropping exchange reserves reduces the amount of ETH available for trading, thereby increasing scarcity. The data from both Cryptoquant and IntoTheBlock indicates Ethereum might be gearing up for a price spike fueled by increasing scarcity.\n\nAt the time of writing, Ethereum is up by 3.21% in a monthly timeframe. However, it is important to note that the crypto has been on a downtrend after reaching a 23-month high of $2,706 on January 12. A larger part of this downside can be attributed to a $1 billion selloff by Celsius Network as part of its plans to repay its creditors. At the same time, the cryptocurrency is facing constant competition from other blockchains, with Solana recently surpassing it in terms of daily trading volume on Decentralized exchanges.\n\nBased on the current price action, it appears like Ethereum has established a support level slightly above $2,280 and is now attempting a strong increase above this price point. According to a crypto analyst, the current configuration is an apparent replica of a price movement in 2021 which led to ETH reaching its current all-time high of $4,878 in the months after.\n\nFeatured image from Adobe Stock, chart from TradingView"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNSEF1emo5dmNCcldyaXNlRlU2MkF1a0JaVk9wZy1LSGdpUmlyZnJUQWxSMGJ2dFBjUVlQSjRmTGVNUVZYckVtbE8tanM3dEgxSjM5VHhEZ1RKelNOSVRjaGVPVGo3Y1ZfdDBoNElGTWZ1RWRNb0hWWVhwVkp6cGtHcWtMRXhQaGZveWw1M2Q0WXZEYXFBazM1QjNMbndmbnFjU1MxdWlvaU1MU0lSeS1vRUtkRmJCbWg5OVAzZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 03 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Could Touch $4K In Next 3-6 Months: Crypto Analyst Michael Van De Poppe Expects 72% Bull Run Amid ETF Hype - Nasdaq",
        "content": "Crypto analyst Michaël van de Poppe has predicted a bullish run for Ethereum (CRYPTO: ETH) in the next three to six months, amid the scheduled final \"Dencun\" upgrade and anticipation of a spot Ethereum ETF (exchange-traded fund.)\n\nWhat Happened: Van de Poppe forecasted that Ethereum could reach $3,500-4,000 in the forthcoming three to six months, translating to a 72% upside compared to the current prices.\n\nHe cites the Dencun upgrade’s final testnet on Feb. 7, the Ethereum Spot ETF hype, and Bitcoin (BTC) rotation after halving towards the rest of the ecosystem as contributing factors to this prediction.\n\n#Ethereum is still ready for $3,500-4,000 in the coming 3-6 months. – Dencun upgrade -> final testnet February 7th.– Ethereum Spot ETF hype.– Bitcoin rotation after halving towards the rest of the ecosystem. pic.twitter.com/bs3W5WomMi\n\n— Michaël van de Poppe (@CryptoMichNL) January 31, 2024\n\nWhile the SEC has approved spot Bitcoin ETFs, Ethereum’s classification as a security or commodity is still a matter of debate. The potential approval of Ethereum ETFs could contribute to a potential 72% bull run in the cryptocurrency's prices.\n\nSee Also: Pro-Crypto Senator Cynthia Lummis Says Bipartisan Lawmakers Engaged In ‘Delicate’ Talks\n\n\"The time for Ethereum is on the horizon,\" Van de Poppe added, noting that the reversal of more than a two-year-old trend will be \"impactful.\"\n\nThe time for #Ethereum is on the horizon. It took 2+ years for $LINK to wake up. Ethereum is in a downtrend for 2.5 years already, the turn around is going to be impactful.\n\n— Michaël van de Poppe (@CryptoMichNL) February 2, 2024\n\nWhy It Matters: According to Bloomberg Intelligence ETF analyst James Seyffart, there is a 60% chance of Ethereum ETFs launching in 2024. If his prediction holds, Ethereum could experience a monumental surge in value, further reinforcing Van de Poppe’s prediction.\n\nUntil there is more clarity on Ethereum ETFs, though, traders are reportedly showing a preference for King Crypto Bitcoin (CRYPTO: BTC).\n\nFurthermore, Ethereum co-founder Vitalik Buterin has mentioned the potential integration of AI with cryptocurrency, with trading bots on blockchain-based exchanges as an established example of AI's involvement in the crypto space. This development could further influence Ethereum’s price.\n\nETH Price Action: Ethereum was trading at $2,322.72 at the time of writing, gaining 0.67% in the past 24 hours.\n\nRead Next: From Silicon Valley To Sandy Beaches: Google Cofounder Larry Page Reportedly Makes Silent $32M Purchase Of Puerto Rico Island\n\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors.\n\nPhoto by Kanchanara on Unsplash\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNSEF1emo5dmNCcldyaXNlRlU2MkF1a0JaVk9wZy1LSGdpUmlyZnJUQWxSMGJ2dFBjUVlQSjRmTGVNUVZYckVtbE8tanM3dEgxSjM5VHhEZ1RKelNOSVRjaGVPVGo3Y1ZfdDBoNElGTWZ1RWRNb0hWWVhwVkp6cGtHcWtMRXhQaGZveWw1M2Q0WXZEYXFBazM1QjNMbndmbnFjU1MxdWlvaU1MU0lSeS1vRUtkRmJCbWg5OVAzZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 03 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Could Touch $4K In Next 3-6 Months: Crypto Analyst Michael Van De Poppe Expects 72% Bull Run Amid ETF Hype - Nasdaq",
        "content": "Crypto analyst Michaël van de Poppe has predicted a bullish run for Ethereum (CRYPTO: ETH) in the next three to six months, amid the scheduled final \"Dencun\" upgrade and anticipation of a spot Ethereum ETF (exchange-traded fund.)\n\nWhat Happened: Van de Poppe forecasted that Ethereum could reach $3,500-4,000 in the forthcoming three to six months, translating to a 72% upside compared to the current prices.\n\nHe cites the Dencun upgrade’s final testnet on Feb. 7, the Ethereum Spot ETF hype, and Bitcoin (BTC) rotation after halving towards the rest of the ecosystem as contributing factors to this prediction.\n\n#Ethereum is still ready for $3,500-4,000 in the coming 3-6 months. – Dencun upgrade -> final testnet February 7th.– Ethereum Spot ETF hype.– Bitcoin rotation after halving towards the rest of the ecosystem. pic.twitter.com/bs3W5WomMi\n\n— Michaël van de Poppe (@CryptoMichNL) January 31, 2024\n\nWhile the SEC has approved spot Bitcoin ETFs, Ethereum’s classification as a security or commodity is still a matter of debate. The potential approval of Ethereum ETFs could contribute to a potential 72% bull run in the cryptocurrency's prices.\n\nSee Also: Pro-Crypto Senator Cynthia Lummis Says Bipartisan Lawmakers Engaged In ‘Delicate’ Talks\n\n\"The time for Ethereum is on the horizon,\" Van de Poppe added, noting that the reversal of more than a two-year-old trend will be \"impactful.\"\n\nThe time for #Ethereum is on the horizon. It took 2+ years for $LINK to wake up. Ethereum is in a downtrend for 2.5 years already, the turn around is going to be impactful.\n\n— Michaël van de Poppe (@CryptoMichNL) February 2, 2024\n\nWhy It Matters: According to Bloomberg Intelligence ETF analyst James Seyffart, there is a 60% chance of Ethereum ETFs launching in 2024. If his prediction holds, Ethereum could experience a monumental surge in value, further reinforcing Van de Poppe’s prediction.\n\nUntil there is more clarity on Ethereum ETFs, though, traders are reportedly showing a preference for King Crypto Bitcoin (CRYPTO: BTC).\n\nFurthermore, Ethereum co-founder Vitalik Buterin has mentioned the potential integration of AI with cryptocurrency, with trading bots on blockchain-based exchanges as an established example of AI's involvement in the crypto space. This development could further influence Ethereum’s price.\n\nETH Price Action: Ethereum was trading at $2,322.72 at the time of writing, gaining 0.67% in the past 24 hours.\n\nRead Next: From Silicon Valley To Sandy Beaches: Google Cofounder Larry Page Reportedly Makes Silent $32M Purchase Of Puerto Rico Island\n\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors.\n\nPhoto by Kanchanara on Unsplash\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]