[
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMihgJBVV95cUxQWThiUjVLSEhndkNTazROaWJHa2Z5dFF3SkFuYV9RSkh5T3lSSFRtSjRBZFU5OVYtcE1DX1VtYUY1TFF2eGhYb0Y2QTlONkRMbzUwa3h6U3BYd2F4eVVxdnROZlBNQW9RNE41MnlVUk04QXQ2UC1NRmZTYjFmc1hiNmxuU0NMbF9Xa1Nsel96bDV6SmsxTkNrV1lVcHhjeTFabUhXQTFzVzc1STJkQWhqMzVxd24xNGtleXlRb0djOEJteGxoM3J6a1Y5ZFNKUGRDV0I5X3BsSDJuUUs4ZEN5QkVSbERHdVlGekNxenJTdDlKVGZSSVV0WkJzZmRSWHZENEJMdFJn0gGTAkFVX3lxTE1YYlVBTTR6czdFWTlHaFJJbEhRZ3hoRmZxbnJxa1AyQzZNblVaaVlnTkhCRTVFSTNQZmM5WkZ4NmdseWNTV1ZYcmw1OXNKOTNJS2JpNXlLV21UR0pCZndDckVrTWt6OUJScDFjUkI5Si1QOEVjYXVoMlN0aFdra1R3RFpjNEkyMGJpWkZ2VFRmSnJ1VGFMWEFpQi1faHQ5NExoNW1XZjltZGlhbzh2ZTY3Skl3VjhFNE5HLWU0SVVjOE1HeDZtTkNEaGNrVUZTUUVxSVNQLWFrTXdlMWdQam5PQmI0R1U5M0czSmNYSUtraFlYS1BybXhrRnRQRG1lQXlpZUxveUVtTzV2eFJLcDY4Smc0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Bitcoin And Ethereum Prices Rebound As Dogwifhat (WIF), Uniswap (UNI) and Aptos (APT) Go Ballistic With 10%-15% Surges - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQejM5VENWc281WHY2cmdnVkxYQ2JjWnlrTTYtLUtxSzg2OWNlbUtoaFJiZjd2WnZEQzlVMmJaZkNXQ2xadnY1dW9kSlFPbGc5UmlGVlJ4cGFiRWh5cWl2SmtqeFdPcmZRM2xIYWdxZXhJeEV5SkVyeEpVanpaTm9pN01sX1ZXbFMtX3B3b3Y3djhFRm1HRXZzZl83b3EzVWd6Y204cXpJQkpseFFNYld1N2NCLWRmVk9aYVJya2tiOHJLOUZQTTRyU25fZGNNTl9hYkRfSEEzWdIB3AFBVV95cUxOalVXVVJLVWxUMGlwS0V2OTdnUjlvdDU5NFR2bm1IMEFMT2JLOFBnM2t3LWd6TllwQmIxbDhFNGFFYVZzU3d0OEFCaWFGb0N1c3BMaDlZenpvMUp1UnVudnRma3NEUXdaRzI4eGhQcjZFQ0RINmVKVURpaW1VMzVuQllSSVFhc1VSUWJLUHhjZFNFNFY4NXJ1NVRzRHppcDE2NmtrT3BkNVFUMUlYNHh2ZzdhaVJ4LURsYUk1RmRPUFN6V08zVnUyeERjTXJPWjBaRzhRdENIWTBpbWpn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum surges past $3,800, hits highest level since January 2022 - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nIn a notable surge within the cryptocurrency market, Ethereum (ETH) has surpassed the $3,800 mark, reaching a peak above $3,860 in Wednesday's trade, marking its highest level since January 2022.Meanwhile, at 4.20 pm, the crypto token was trading 4% higher at $3,830. It has also gained nearly 65% in the last one month, and over 145% in the past one year.\"This rally is fueled by a combination of factors, including Ethereum's shift to a proof-of-stake consensus model, which has made its token supply deflationary. Additionally, the amount of ether locked up in staking pools, DeFi smart contracts and layer-2s is also an important factor,\" said Sumit Gupta, Co-Founder of CoinDCX.The rise in Ethereum also comes amid speculation of the launch of an Ethereum ETF following the recent launch of a Bitcoin ETF However, according to a regulatory filing on Monday, the U.S. Securities and Exchange Commission (SEC) further delayed its decision on an application by asset manager BlackRock for its spot Ethereum exchange-traded fund.BlackRock in November last year filed its application for its iShares Ethereum Trust, which will be listed on the Nasdaq if approved.The SEC in January delayed its decision on BlackRock's application after it gave the green light to several Bitcoin ETFs.A spot crypto ETF tracks the market price of the underlying digital asset, giving investors exposure to the token without having to buy the currency.Meanwhile, in today's trade, Bitcoin also touched new all-time highs for the first time in over two years before experiencing a sharp decline as traders decided to cash out some profits.Bitcoin hit a high of $69,170, topping November 2021's all-time peak of $68,999.99. Investor interest has increased since the Securities and Exchange Commission approved 11 spot bitcoin ETFs in late January. It then reversed course and was recently down around 0.5% at $66,658 at 4:17 pm IST."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5tQ0IwUW5yY0M0aWlpVXF3ZEk5VUJOT3VSSmpHZFh0YzJwSjF4cTBjR0xmcDJCNEZnYzJGSld0djRpVEZEN2taT2Q5OEhDZXplUFpTb2pGZEI5LVlIenlQWXN1cXN4RmhTNHBYS3V3TVZKQmxHVnpnVEVpNkI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Here's How Much Trump Could Have Had if He Didn't Sell His Ethereum - Yahoo Finance",
        "content": "Though former President Donald Trump is famous for many things, Ethereum trading is not usually something that comes to mind for most. However, Trump dealt in Ethereum in recent months, according to data from Arkham Intelligence. The blockchain analytics company cross-references on-chain transactions with financial filings made by a Donald Trump account to find the former President's wallet address.\n\nIn December 2023, Trump sent more than 1,000 Ethereum (ETH) tokens to Coinbase, presumably to sell. At the time, the Ethereum was worth $2.4 million. However, ETH has since performed very well, and the former president may be wishing that he held on for longer.\n\nDon't Miss:\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today .\n\nBitcoin has jumped nearly 50% already this year – how much would you need to get started today?\n\nIf Trump were still holding all 1,075 ETH that he sent to Coinbase, they would be worth more than $4 million, nearly 60% higher than what he sold them for, as ETH reached higher than $3,700 today. By selling in December, Trump could have had $1.6 million more in his portfolio.\n\nAdditionally, some expect the price of ETH to continue going up in the near term. The chain is expected to unveil new upgrades soon, which will increase speeds and security while lowering costs. The potential for spot Ethereum ETFs as early as May 2024 could provide another boost for the token.\n\nWhile Trump may be regretting his sale, the ETH was essentially free for him. He obtained the tokens through an NFT project that used his name, image and likeness and gave Trump royalties.\n\nThe project, called Trump Digital Trading Cards, was minted in December 2022 for $99 each. The 45,000 unique NFTs feature photos of Trump in different settings and poses. As of right now, the cheapest NFT is on sale for a little less than $500 (0.14 ETH), and the most expensive sale goes for 37 ETH (worth nearly $150,000 at the time).\n\n—\n\nTrending: Large boom in cryptocurrency and metaverse interest as BTC skyrockets — has Apple Vision Pro increased the demand for virtual real estate?\n\n—\n\nAdditionally, the project has generated more than 15,000 ETH in trading volume, which is what has allowed Trump to amass his ETH holding. In total, Trump has received nearly 1,500 ETH from the project.\n\nHowever, the Trump NFT projects do not stop there. Trump announced the release of another project in late 2023. The project is largely similar to the original project but carries some much more personalized rewards. For example, those who buy more than 47 NFTs, priced at $99 each, will receive a physical piece of the suit Trump was wearing in his infamous Georgia mugshot. Other rewards include autographed cards and even a dinner with Trump himself.\n\nStory continues\n\nAs Trump continues to earn royalties and does well on the campaign trail, it will be interesting to see how he handles his ETH position going into the presidential election in November.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Here's How Much Trump Could Have Had if He Didn't Sell His Ethereum originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPa1YyeTJSLTZnWWV3UXhZUGJPS1RSUkNRcTdsTDY5QmVNVHdyV28zNEk5V1lWUjg5Y2JlNHpZZXhnOGgxVWJIa3F5NVRzdW5aT3Z2UkVzRkN5Z2UxbkZ3MnYxa3hWeGJVc1lqX21SWUZfMFZVSnJtU0pBR0I0Rll0N3hmbFh1WE1Nb1owb3V2V0wtczF4cGg1SEJMZ3RYa0dnOHNPQnRfaFN0Tk9XSEMxONIBtgFBVV95cUxQM2UzcDRrNThyUEFxZVp3Zmp0S2ZMNXRsNi00aVhpelp4U0VGVnBRWndLVnV3Y1JfZ2FqcHRTQ2VQZ09wWFRhcG9tVWlSWjRPZVV6Wm15QUswLUVwMFdRYWtOQWlvaFNaYy1leENyQm9rMkwzRVlsOTg3MGhWZ2hGazJCbzBiRWJJWGs4WVM4ZzZwcUNNMnlxMGxRa2U5TUNRQUlaczkzbmRUQk5BNUpoU25DRFc2Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Recovers From Dip: ETH Hits $3,900 For The First Time In Two Years - NewsBTC",
        "content": "After Bitcoin (BTC) recorded a new all-time high (ATH), Ethereum (ETH) rallied above $3,800 before the price crashed over 10%. The second-largest cryptocurrency has recovered from the dip and reached $3,900 momentarily for the first time in over two years.\n\nRelated Reading\n\nThe Ethereum Foundation Is Selling ETH Again, Is The Top In? 6 months ago\n\nEthereum Recovers And Rallies to $3,900\n\nOn Thursday, Bitcoin reached a crucial milestone after breaking above $69,000 and recording a new all-time high (ATH). Before the euphoria was over, the flagship cryptocurrency’s price started to drop, trading as low as $60,000. Since then, BTC’s price has recovered to hover between the $66,000-$67,000 price range.\n\nFueled by the bullish sentiment, Ethereum rallied above $3,800 before suffering a considerable price drop. The ‘king of altcoins’ lost momentum and shredded about 12% of its price to trade at a price as low as $3,360, according to CoinMarketCap data.\n\nAfter the dip was done, ETH started to show a recovery alongside Bitcoin. As reported by NewsBTC, a crucial resistance level to clear during this recovery was $3,600. Ethereum surpassed this support level and has maintained its price above the $3,800 range during the last 4 hours.\n\nEthereum reached the $3,800 support level twice in the last 24 hours. This price range was not seen since January 2022, and the regained bullish momentum propelled the token’s price to a higher milestone.\n\nEthereum hit $3,900 for the first time since December of 2021. The biggest altcoin briefly soared to $3,901 before falling to the $3,850 price range.\n\nAt the time of writing, ETH is trading at $3,834, representing a 1.6% price drop in the last hour and a 2% increase from 24 hours ago. Similarly, the token exhibits green numbers on longer timeframes.\n\nETH price performance in the 4-hour chart. Source: ETHUSDT on TradingView.com\n\nEthereum’s price performance has surged almost 16% in the past week, 65% in the last month, and an impressive 145% in one year.\n\nETH’s market capitalization increased 1.55% to $459.7 million on the last day. Its daily trading volume has increased by 58%, with $52.16 billion in market activity in the previous 24 hours.\n\nWhat’s Next For ETH’s Price?\n\nMany analysts have forecasted that ETH’s rally is far from over. Analyst Altcoin Sherpa predicted that Ethereum could reach $4,000 when it breaks through the $3,000 price barrier.\n\nEthereum’s rally seems to be fueled not only by Bitcoin’s momentum but also by the general market dynamics. The date for the Dencun upgrade is approaching, and this update is expected to bring several technical improvements to Ethereum’s infrastructure,\n\nMoreover, the possibility of Ether-based spot exchange-traded funds (ETF) being approved by the US Securities and Exchange Commission (SEC) in May has built expectations for Ether and the blockchain’s ecosystem.\n\nPseudonym trader Ash Crypto suggested to his Telegram subscribers that the price correction experienced after Bitcoin’s new ATH was not a “reason to panic.”\n\nMessage from Ash Crypto to his Telegram Subscribers. Source: Ash Crypto on Telegram\n\nRelated Reading: Ethereum Price Follows Bitcoin Surge, Why $4K Is Just A Matter of Time\n\nThe trader considers that the “late long flush to cut all the leverage” was expected and that a soon-to-come stabilization in BTC’s price will propel the run of ETH and all altcoins. Similarly, he announced the ‘incoming alt season’ after the price of ETH hit $3,900 and suggested that Ethereum’s next support level will be $4,200.\n\n$ETH JUST MADE A NEW HIGH 🔥 $4,200 IS COMING NEXT ! GET READY FOR ALTSEASON pic.twitter.com/ZLirlerVDJ — Ash Crypto (@Ashcryptoreal) March 6, 2024\n\nCover image from Unsplash, chart from Tradingview"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPVTNoX21wNGNERjBNQldsOUQ5cWpDTF9OOVd6cTdzakpQNlhmR1dLTkpEdGkxaTZTekVqNlZLcW1jQkp6UU5rcTJTLTNPSm5zQm93bTVhby1kRW9WYXBqdkpaRWJ6Z0s0WlZ0MmxVYUZmTFRxMFpFbVNDRGE4R3ZCTjVzWkE2d3VMUHYyWlNTRUVJSHhHbmVWeHNWYWEtcmxoRG8w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Experts see two factors driving Ethereum to $10,000 in catch-up rally with Bitcoin - DLNews",
        "content": "Bitcoin's all-time high cranks up pressure on Ether to follow suit.\n\nInvestors are counting on Ether ETFs to spur gains.\n\nAn Ethereum upgrade is on the way.\n\nBitcoin just hit a new high, and the wider crypto market is now worth more than $2.6 trillion.\n\nEthereum’s not been lost in the bullish run-up, rallying more than 65% since the beginning of the year.\n\nIt’s impressive, but sitting at $3,809 in late afternoon trading UK time Wednesday, Ether is still 21% below its all-time high of $4,800.\n\nWhat gives?\n\nIn a word, time.\n\nSzymon Sypniewicz, CEO of crypto onboarding solution Ramp, said it may simply take longer for the market to understand Ethereum’s complexity, especially “compared to the much simpler idea of Bitcoin as digital gold.”\n\nNew financial system\n\nEthereum lovers have long argued the second most valuable blockchain network will be the infrastructure of an entirely new financial system.\n\nThrough smart contracts, supporters point to a future with more transparent markets, tokenised versions of popular funds, and faster settlement times.\n\nJoin the community to get our latest stories and updates\n\nOthers say it’s only a matter of time before institutional investors take bigger positions in Ether. And the advent of Bitcoin ETFs may be increasing their appetite.\n\n“ETH hasn’t hit its institutionalised hype cycle yet,” like Bitcoin has, Robby Greenfield, co-founder and CEO of payments protocol Umoja Labs, told DL News. “Thus, the vast majority of new inflows from the BTC ETF will naturally lead toward greater buy pressure, along with the upcoming BTC halving,”\n\nGreenfield predicted that Ethereum will close the gap with Bitcoin in terms of its gains.\n\nHe told DL News the cryptocurrency should “clear $10,000 this year.”\n\nGreenfield added that an Ethereum ETF approval would undoubtedly help drive up its value. He joins a host of industry players counting on the US Securities and Exchange Commission to follow up its January approval of Bitcoin ETFs with a green light for Ether.\n\n‘It’ll be good for investors to have access to ETH in a way that’s easy and familiar.’ — Eugene Cheung, Bybit\n\n“An ETH ETF should naturally be approved,” Eugene Cheung, Bybit’s head of institutions, told DL News. “It’ll be good for investors to have access to ETH — one of the world’s premier risk assets — in a way that’s easy and familiar.”\n\nMaybe so, but the SEC, and especially its hard-charging chair, Gary Gensler, may take a different approach to an Ether ETF.\n\nGensler acknowledged reluctantly clearing the way for Bitcoin after the commission lost a court ruling in its effort to stop Grayscale from converting its BTC trust into an ETF.\n\nThere is no such court case driving decision-making on an ETH ETF.\n\nThe SEC is expected to weigh in on a slew of different Ethereum ETF applicants, including those from BlackRock and Fidelity, in May.\n\nCrypto prediction market Polymarket puts the odds of approval at 43%. JPMorgan’s latest analysis gives it a 50% chance.\n\nBloomberg ETF analyst Eric Balchunas called an Ethereum ETF “small potatoes,” characterising it as “the opening act coming on after the headliner.”\n\nEthereum upgrade\n\nJPMorgan does, however, point to another catalyst for Ethereum: the Dencun upgrade, which is designed to help the network scale up by cutting costs for various rollup solutions on the market.\n\nRollups batch crypto transactions, be they simple swaps or borrowing activity, into much smaller chunks of data.\n\nThese small chunks are then settled on Ethereum, reducing the overall data footprint on the network.\n\nBybit’s Cheung says this is good news for Ethereum supporters.\n\n“With layer 2 solutions built on top of Ethereum, the blockchain is becoming the settlement layer for a whole new digital infrastructure encompassing gaming, trading, and investing,” he told DL News.\n\n“The value of all of this will tend to accrue to the ETH asset.”\n\nUnlike Bitcoin’s automated halving event, Ethereum’s Dencun upgrade does not regulate the cryptocurrency’s scarcity. In contrast to Bitcoin’s pre-programmed 21 million token cap, Ethereum’s supply is infinite.\n\nNot a sure thing\n\nStill, the upgrade’s success isn’t a sure thing for the asset’s price performance.\n\nThe layer 1 competition is heating up, and one exec says Ethereum may even be overtaken this cycle.\n\n“Given the network’s poor performance during periods of high activity and the proliferation of alternative layer 1 protocols that have optimised for Ethereum’s shortcomings, Ethereum’s position as the second-ranked cryptocurrency is not necessarily guaranteed this cycle,” CMO of crypto exchange VALR, Ben Caselin, told DL News.\n\nLiam Kelly is DL News’ Berlin correspondent. Contact him at liam@dlnews.com."
    }
]