[
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOUUgxM1pacTFsSW9OSVRMak9lNklaN1E0Z2F1di14MWRSeFBYdnVFX0NVMkFRbzJrSzI2eHhpMW5NTFFfOEtjU01yTzk4Yy1qb3hFd2xWakpYbGZmLVNDM2Y1YWpadDFHLVc0Rm5qd2dKTXdLMXV2bVgzUkhlcDhkTnQ4Q1BiazlXRnNJTE9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Solana Surpasses Ethereum in User Activity Amidst Surge in Memecoins like ‘Book of Meme’ - Yahoo Finance",
        "content": "Solana Surpasses Ethereum in User Activity Amidst Surge in Memecoins like ‘Book of Meme’\n\nThe Solana network experienced a surge in activity over the weekend, surpassing Ethereum in total trading volume. However, the network struggled to keep up with the influx, leading to frequent transaction failures and delays.\n\nSolana's 24 hour trading volume reached nearly $3 billion on March 17, beating out Ethereum's daily volume of $2.04 billion. The network also reached a new record of $3.79 billion in trading volume on March 15. The surge in activity was driven by a speculative frenzy for new Solana-based memecoins. Book of Meme (BOME) rallied from near-zero to a market capitalization of $1.45 billion in just 56 hours.\n\nThe surge in trading activity overwhelmed the Solana network, causing ping times to spike and transaction failures to increase. According to data from Solana Validator, Solana's ping time ran as high as 46 seconds on March 18, resulting in approximately 30-40% of transactions failing.\n\nHowever, this hasn’t stopped the price of Solana (SOL) rallying to $203, up 8.69% over the past 24 hours and 45% in the last week alone. Solana's market capitalization also reached a new all-time high of $89.3 billion, overtaking BNB (BNB) to become the fourth-largest cryptocurrency by market cap."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOUUgxM1pacTFsSW9OSVRMak9lNklaN1E0Z2F1di14MWRSeFBYdnVFX0NVMkFRbzJrSzI2eHhpMW5NTFFfOEtjU01yTzk4Yy1qb3hFd2xWakpYbGZmLVNDM2Y1YWpadDFHLVc0Rm5qd2dKTXdLMXV2bVgzUkhlcDhkTnQ4Q1BiazlXRnNJTE9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Solana Surpasses Ethereum in User Activity Amidst Surge in Memecoins like ‘Book of Meme’ - Yahoo Finance",
        "content": "Solana Surpasses Ethereum in User Activity Amidst Surge in Memecoins like ‘Book of Meme’\n\nThe Solana network experienced a surge in activity over the weekend, surpassing Ethereum in total trading volume. However, the network struggled to keep up with the influx, leading to frequent transaction failures and delays.\n\nSolana's 24 hour trading volume reached nearly $3 billion on March 17, beating out Ethereum's daily volume of $2.04 billion. The network also reached a new record of $3.79 billion in trading volume on March 15. The surge in activity was driven by a speculative frenzy for new Solana-based memecoins. Book of Meme (BOME) rallied from near-zero to a market capitalization of $1.45 billion in just 56 hours.\n\nThe surge in trading activity overwhelmed the Solana network, causing ping times to spike and transaction failures to increase. According to data from Solana Validator, Solana's ping time ran as high as 46 seconds on March 18, resulting in approximately 30-40% of transactions failing.\n\nHowever, this hasn’t stopped the price of Solana (SOL) rallying to $203, up 8.69% over the past 24 hours and 45% in the last week alone. Solana's market capitalization also reached a new all-time high of $89.3 billion, overtaking BNB (BNB) to become the fourth-largest cryptocurrency by market cap."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNOHlzYzhGYThsUWZLZDZGLUh4N0RIbS1GcjdMT3RXMEZJVnBKc1ZxSUhrcHotYkN2WFVta1R5Zl9IUmh4cGZFaXJiZnYtLTl5REFLQVdTSWREMDF2MkwzQWxGWldHSjl1QVA0dnppMWxHMGZuV3hSV3dqcU0xZmlCbnMtWVJrQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Owners of Shiba Inu Behind Dogwifhat Meme Auctions NFT on Ethereum - Yahoo Finance",
        "content": "Owners of Shiba Inu Behind Dogwifhat Meme Auctions NFT on Ethereum\n\nA South Korean Instagram user announced that the Shiba Inu featured in the \"Dogwifhat\" meme, named Achi, was their pet. To celebrate, they planned to auction an NFT of the original photo of Achi wearing a woven beanie on the Ethereum blockchain.\n\nThe user's Instagram profile has consistently posted photos of Achi in various woven clothing for the past five years. They also posted the famous \"Dogwifhat\" photo itself in December 2018, almost a year before it went viral online. Partners of the Achi NFT auction have confirmed that the user has been verified as Achi's true parent. At writing, Dogwifhat (WIF)'s market capitalization is almost $3 billion, while the current bid for the Achi NFT is 55 ETH, around $197,800.\n\nSeveral members of the WIF community and other Solana users expressed disappointment that the Achi NFT auction was not partnered with the WIF team. The new Achi NFT is minted as an Ethereum NFT and is currently up for auction on the Ethereum NFT platform Foundation.\n\nAchi's parents previously attempted to work with the Solana community, partnering to launch a memecoin called ACHI, but the experience ended in a rug pull. As a result, they opted to partner with Feisty DAO for the NFT auction.\n\nDespite the community's frustration, it appears that the WIF community has done little to reach out to Achi's family. WIF launched in December, and as of a few weeks ago, Achi's parents had reportedly never heard from anyone in the community. Path, the Feisty DAO member behind the NFT auction, said he is open to re-minting the NFT on Solana if there is interest. However, he has not yet received any inquiries from WIF community members."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPT3JFWTFBSWpjNE84T09xUTRTTThQMTI3ZEh0dHlUaEIzZXNhV3Q3UFdld2dDN0liY3J3Qmppel92OEhMb2lwTGppVnFfVlViMWVEdlpESGlRcFB3WnFmcGFzLUxqaEJZOVJsVlVNbXVSMTY0TDZrYmpmbk1lOFJRT2JsLWNta09JZlRoVk1kRWVjTzV3SGRyem1DdnBJdFdrRUlR0gGrAUFVX3lxTE5kWHZiekZnZXhHR3RXdExLSnFIeER0dmhxaFBTXzlwTDhMdnRCblFFazdEb1BRM3FhU01Uemh0S2R4aHYtSnMyeWN5YUsweE1tbXIydkdDT3NkRVQ4cGsyVUlwM1pLdGw3NWhrNFE4RWJyRFdMd1dXNTNoTmstd3BLTENhVVRZNmhENWUzMjlrYjVEMlZSZjQtUGk5NERaUktJWnloVEZTMFVMWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Could Top $14,000 Next Year Alongside Bitcoin Boom: Standard Chartered - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBritish multinational Standard Chartered isn’t just bullish on Bitcoin—Ethereum is also going to the moon, its analysts say.\n\nA Monday report from the bank claimed that the second-biggest digital asset could hit $8,000 by the end of this year, and $14,000 is possible by the time 2025 is up.\n\nIf, that is, spot Ethereum exchange-traded funds (ETFs) get approved, Geoffrey Kendrick, head of forex and crypto research at the firm, said in the note.\n\nThe price of Ethereum is currently hovering slightly above $3,500 per coin, CoinGecko data shows.\n\nAD\n\nAD\n\nSeveral high-profile fund managers have filed paperwork with the Securities and Exchange Commission (SEC) to release Ethereum ETFs. Such investment vehicles would expose traditional investors to the cryptocurrency via shares that trade on a stock exchange.\n\nKendrick wrote in the note that the bank expects the ETFs to get the green light from the SEC by the summer.\n\n“Ethereum is currently between two important events that we see driving price upside,” wrote Kendrick. “It has just had a structurally significant upgrade, and U.S. regulatory approval of ETH ETFs is expected in May.”\n\nKendrick also said that the network’s recent Dencun upgrade could be the reason for Ethereum shooting up rapidly.\n\nAD\n\nAD\n\nThe network behind the second-biggest cryptocurrency was upgraded last week. Developers say the improvement will make transaction fees on the blockchain super cheap.\n\nKendrick added that the upgrade and lower costs on the network make Ethereum “more competitive.”\n\nStandard Chartered said in a different research note Monday that Bitcoin could hit $150,000 per coin by the end of this year if the newly approved ETFs continue to be popular.\n\nIn January, the U.S. Securities and Exchange Commission approved 11 of the investment vehicles.\n\nThey have so far been hugely popular with investors—and the massive inflows have pushed the price of Bitcoin up significantly.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOTkFjSVUySnhTNmNaSHJuazVQazhpYzdrb0JLTFBOSGI4dnFLUjNTZzQ4cUpMVk9EX2pwd0lyTWQ5VFRTcjJRYnFsVjdhenhsd3J5RFhUR3RFT2RaZFdxZngyV0N5ZFFQVkRmOWNjLUF2QVN6UFZLSGVXUzZtOVlNZ0hkVGFGRnRCc0NuYVBvTjFXWG4tQk80?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Could Ethereum Hit a New All-Time-High of $5,000 by the End of 2024? - The Motley Fool",
        "content": "Ethereum has two solid catalysts in place for 2024, but will they both deliver as planned?\n\nNow that Bitcoin (BTC -0.63%) has hit a new all-time-high, could Ethereum (ETH -1.03%) be next?\n\nCurrently, Ethereum is trading at just under $4,000, within striking distance of its all-time-high of $4,891.70. Given that Ethereum is already up about 70% for the year, it wouldn't seem to require much for Ethereum to rise another 25% before the end of 2024.\n\nAnd indeed, there are two potentially major catalysts in place this year. If Ethereum is going to soar to an all-time-high of $5,000, it's likely that both of these are going to be needed. Let's take a closer look.\n\nNew tech upgrade\n\nThe first major catalyst is a brand-new tech upgrade (Dencun). It is the biggest change to the Ethereum blockchain since The Merge, which took place nearly 18 months ago. So understandably, analysts are getting excited about what this new upgrade might mean for Ethereum's growth prospects.\n\nThe Dencun upgrade has two major goals: to improve the scalability of the Ethereum blockchain (which can still suffer from congestion and slow throughput times), and to lower the costs of transactions within the Ethereum ecosystem. If Dencun can deliver on both, it would help to cement Ethereum's role as the preeminent smart contract platform in the world. Even better, Dencun is setting the stage for Ethereum's next upgrades, all of which have been carefully laid out by Ethereum co-founder Vitalik Buterin in the blockchain's latest annual roadmap.\n\nSo far so good, right? You have a tech upgrade promising major performance enhancements, and you also have a roadmap for future growth. But not so fast. A number of blockchain analysts are taking issue with the Dencun upgrade.\n\nAs they see it, Dencun is not a long-term fix because it relies too much on third parties (known as Layer 2 scaling solutions) to make all the performance enhancements work. In a worst-case scenario, reliance on these Layer 2 scaling solutions could lead to all kinds of interoperability issues, fragmentation within the Ethereum ecosystem, and a loss of cohesion among Ethereum developers.\n\nSpot Ethereum ETFs\n\nThe second big catalyst is the potential launch of new spot Ethereum exchange-traded funds (ETFs) as early as May. Given all the enthusiasm and excitement around the spot Bitcoin ETFs, it's easy to see why a new spot ETF investment product could send Ethereum soaring.\n\nAs in the case of Bitcoin, it would become remarkably easy for any investor to buy Ethereum. If these investors decide to allocate even 1% of their portfolios to Ethereum, that could send the crypto soaring.\n\nThe only problem, from my perspective, is that analysts seem to be vastly overstating how easy this process is going to be. As they see it, the Securities and Exchange Commission (SEC) has already bought into the idea of spot ETFs for cryptocurrencies, and thus, new approvals are going to be coming on a regular basis from here on out.\n\nBut what they fail to take into account is that the spot Bitcoin ETF process took years to achieve, and only after very specific milestones had been met. Even up until final approval in January, there were serious doubts about the SEC finally approving them.\n\nAnd we're starting to see the same thing with the spot Ethereum ETFs now. The probability of an SEC approval taking place in May has recently been lowered from 70% to 30%, according to a top Bloomberg analyst.\n\nThat's because the SEC has maintained what can only be described as radio silence ever since the spot Ethereum ETF applications were filed. There has been no outreach to the investment firms trying to bring them to market, and no indication that regulators are now ready to sign off on other cryptocurrencies beyond Bitcoin.\n\nIs the glass half-full or half-empty?\n\nIf you're an optimist and see the glass as half-full, the new Ethereum tech upgrade in 2024 is worthy of the same type of acclaim as The Merge was back in 2022. You probably also think that a fresh batch of spot Ethereum ETFs are on their way before the start of summer.\n\nHowever, if you're a skeptic and see the glass as half-empty, the new Dencun upgrade is at best a temporary fix for problems that have been plaguing Ethereum for years: high transaction fees and slower transaction processing speeds compared to many other blockchains. Moreover, you're probably also thinking the SEC will take its time with the spot Ethereum ETF approvals, much as it did with the Bitcoin ETF approvals.\n\nMy concern right now is that the optimistic scenario has already been baked into the price of Ethereum. How else to explain the fact that Ethereum is up just as much as Bitcoin this year?\n\nThus, if either of these two catalysts fail to deliver as expected, we could see a pullback in the price of Ethereum. For that reason, I'm taking a wait-and-see approach with Ethereum right now."
    }
]