[
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNQVRLdmotR3NpRUxWWVRtbC12czlRV2NuMllSNmVRVjUwc0ZSa2diX2YwVnBKU2tURW1QWEVYaDNiS0w5U3kzMWFkamN6eEN1ay14VzR5SDgwUnlEQllSdkN5OUJ5VHY4MnpCMzloaUxHRE5ISFF3WlRqOUFxc2FUTlZEUlNYU19iVjdQa1Uxd2dZRllzYUhFR1BXVW01bkh4bl9vMUUyc3FUN3BMSlI2Vl9UalFuSjBrUGJITTl4ajA2Y1BsSWfSAcsBQVVfeXFMUHduazNLYVc1aVRaVkNkN25QT0MzTTV4LUFEbVpYSW42dUxPSnRRN0hyTVVOdEVMZ2wxTHZ0Y19Mb3pQYU82a1FmYUVHNmFoX3hXeS1ULUhtcDAwa185NHgzVTE4Vk5ZUUFHdmwwSDlrQ3c5M00wZmJzZzUyNE5fek1XUlVGaXhMSzBmdGp4UmV5eVNSczRQTjctMHkyY0todjFBRTgyYjI0b2VPSHZobnpWeVViUlVhdUJXWHQwVWp6RXZKVWpZNmhtLW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Ether's Bitcoin Beating Rally Not Just Because of Potential ETF Approval: Bernstein - CoinDesk",
        "content": "The amount of ether locked up is also an important factor. Bernstein notes that ETH held on exchanges is at an all-time low of 11%, a sign that more of the cryptocurrency is being locked up. There is ETH locked in staking pools, decentralized finance (DeFi) smart contracts and on layer-2s ."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOeXdlaGlBZWcyeVJhZ0o3R05GazhGNS1TS0syekdVdV83Snlyc2RiUzVDZXg5eXEtWm1GakFoSXVySnBGZkJKZlhxZEJ2MWQ4N21MUVZzTGpyY015eHpsVWdJeF9iZGhtdV9KdFJWUFpQQmtQejR2OUk5T1RVU1R2X2lZRDNvRFA1U1piejV6VW9jekhPaUJmcHhIei1lNE5MdnpuQWZSc011cE5XT0w0YtIBtgFBVV95cUxPOEZfY1U3RGRjRlhLMmVUaF9oRmdKRE1sTDFnNTN1dWNtZnBUcm9TeWI4VElqS2ZyRTVSQmxtYXZvaGNDMEZZbTR3OXc4S01PLUI2NFItM0dka2d5aXRyb0JKVUphZ3NJeTJyN3ROY1p2Rk93eFVPc3NqcldlbVhnYW5CUnN6a3ZEclRMT2tZZmxtNEk3ODZCYk9lcmpJN3FGR25kQmh0MlpOMC1ldnBJUkwtS00yUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Ether Tops Bitcoin as the Largest Crypto Asset for Institutions: Bybit Research - CoinDesk",
        "content": "Despite Solana's (SOL) strong performance in the third quarter of last year, where it rallied and erased many of the losses of the crypto winter , Bybit's data suggests that both institutions and retail users have not been interested in HODLing the token that was once at the center of Sam Bankman-Fried's portfolio."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPNE83QkptYkhJdk42S3JJMFoxRzFpTE1tUUxNOUR0WVZFNmJhbWdaTHVoSGktSENjVEhVTXg3dmdpaWppTHNjRnNZam5rOWg2R1FSM1VxaVN6RE45RGpGSzdWa190bmpDd3Q3ZjFZbmJId0NybllUb3pNaWlmNWpwWW5jZzNmbnZyNGZST1dLdXViaEk3SWtfaUU5R1haZTlkQW80aktsaGlQX3ZkRzVBdnE0OVhiZ9IBuwFBVV95cUxNaXhwVW9NUFZnSGxsdjNyZ1hnSXhvRnZBcUZUeHNYVTZFZklVNlFWdHNuXzNNbVFsdEVoWmsxeDBSVERXVG1QaFE2NkdwZ0pnQVRGX2dsN0dHMjVUR1pfcXZDNXZSZzdTb1JpaXFDMDlna0NnZjU2M1pDSGhCUExTcmVSdE1jNXZKeTdWN3dBdDJ2UDVxSFlXZm9TSFZSd2dUMW85WlM2UFFURERrbC1YY0xTcllCdXdhMUxB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Avail, an Ethereum Data Network to Rival Celestia, Raises $27M In Seed Round - CoinDesk",
        "content": "Avail Nexus is a “zero-knowledge, proof-based coordination rollup on Avail DA,” meaning that it will operate as an infrastructure layer that connects different rollups through the Avail ecosystem to talk to one another, according to a press release seen by CoinDesk. It will “act as the verification hub, which unifies a wide array of rollups both inside and outside the Avail ecosystem, utilizing Avail DA as the root of trust.”"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPYTk1V1FGQXZ6NGdnSC1zRFR6YVJUQVpPZFptNFNFN1FZNVRjY1RJWmxMQUlsY0VncU9DajBkUm4xUlpHNE12TDVzWTJWYXUtZ3p0eVlGcTFDcC1aeno0aUVsaGROSWlfSkVLMDc4a0dFMUZtdWptX3k4dVlVdWV6WmtiRFp4QXd2VzFsVXA3N2pqNVNObkVPenBJclBWb29jRHMyRTh3SDFmZWtxWlJ4N2VB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Ethereum and Bitcoin futures open interest near record highs in notional value - CryptoSlate",
        "content": "Quick Take\n\nThe total amount of funds allocated in open futures contracts or “futures open interest” is nearing an all-time high for Ethereum and Bitcoin in terms of notional value.\n\nEthereum’s open interest currently stands at $10.5 billion, aligning with it crossing the significant price threshold of $3,000.\n\nThis is particularly noteworthy as its current level mirrors that of November 2021, Ethereum’s peak at $11 billion, when the price of ETH was approximately $4,700.\n\nSimilarly, the notional value of Bitcoin is also approaching all-time highs, with roughly $22.5 billion corresponding to the same levels observed in May and November 2021, when Bitcoin traded over $60,000.\n\nFor Bitcoin, the open interest represents about 2.25% of its market cap. For Ethereum, the open interest accounts for approximately 2.77% of its market cap. Both have seen increases in the past weeks, but they are historically at an average level."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9ha2NYZjZ5TE1IMlY0YWc4NHd6QjFXRFh1eWphaUlsSXJiaXh6RlZ3SGxuZ2F6NjNkZTJmUG9DRVAxUDdLS19ReDAyQjYwNWZVZkdTeG5CbVhyWGVvNnp2NFdOY0YwTnBEeTVranVfYmxDM3VlZHBPT0hiWXbSAYQBQVVfeXFMUHNCVzFwSFRBVnZPUk9pQS1GaWRNeE00Rm1oWFl4TXVQX1RMaTNSTkFnVThwX3VQVlI4N1RUa2FiU3MzQWVGTHM4UjRpUno1SHByZ3ZzdUQyWVZTZUNZZkNneE9RQVhjWlRWTC1NdVk0MEZCaFRWa3hSVmtPRVlOM2M1SExq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price at 22-Month High as Open Interest Soars and Dencun Nears - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum (ETH) continues to be the top coin. The second biggest digital asset by market cap is trading at 22-month highs on Monday.\n\nETH is now priced at $$3,151, CoinGecko shows, having broke past the $3,000 mark for the first time since April 2022 last week. It has gained 3.5% since the same time yesterday and risen by more than 8% over the past week.\n\nKaiko analyst Dessislava Aubert told Decrypt that \"open interest just hit a multi-year high of $7.7 billion and funding rates are at their highest levels since early January,\" meaning new capital is entering the market due to rising speculative interest as well as hedging.\n\nAD\n\nAD\n\nETH's network is set to undergo an important upgrade next month. Named \"Dencun,\" it aims to solve scalability problems with the blockchain.\n\nThe upgrade will bring \"proto-danksharding\" to the network, promising to make it faster and cheaper to use via layer 2 solutions. Layer 2s, or L2s, batch together unverified transactions made on Ethereum, process them on an external network, and send confirmation back to mainnet.\n\nA number of high-profile, traditional Wall Street firms are also hoping to get a spot ETH exchange-traded product approved.\n\nSuch a fund, if given the green light by the Securities and Exchange Commission (SEC), would bring the asset to traditional investors. Big names like BlackRock, VanEck, and Grayscale are all waiting on the regulator. Just last week publicly traded crypto exchange Coinbase submitted a comment letter to back Grayscale's bid for an Ethereum ETF.\n\nThe SEC in January approved 10 spot Bitcoin ETFs, which have so far been popular and received huge inflows of capital.\n\nAD\n\nAD\n\nBritish multinational bank Standard Chartered said last month that a spot ETH ETF will get approved by May and send the asset's price above $4,000 per coin.\n\nDespite its recent surge, ETH is still well below its November 2021 all-time high of $4,878.\n\nEdited by Stacy Elliott."
    }
]