[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxONEtLOEJ2UTlCNWRINkROUV9wSWFPN2VUM1FQblpwU201V1FhMzFOSUpWUm05MEIzc2pUSkpiWTJ2U0gySmN6NHN0Mk1BcjlDM1g3bEtnd1Q2dnZvNGVQVUJuVW5EOXFhcGlyVkRYekNMTFF4dUNVMEI2NGZVMUdvbkZReDNadWthMHZoNE1kOHZweTkxWU1qemRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Sets New Policy for Conflict Issues - Crypto Times",
        "content": "The Ethereum Foundation is swiftly developing a formal policy to address potential conflicts of interest. This initiative follows the revelation that two of its researchers received substantial incentives from the EigenLayer project.\n\nExecutive Director Aya Miyaguchi emphasized the importance of maintaining the foundation’s neutrality to effectively serve the ecosystem.\n\nThe Ethereum Foundation’s credible neutrality is critical for us to perform our role in the ecosystem. We are aware of the current conversation about potential conflicts of interest, and share the community’s concerns.\n\n\n\nIt is clear that relying on culture and individual judgment… — Aya Miyaguchi (ayamiya.eth) (@AyaMiyagotchi) May 24, 2024\n\nThe foundation’s action comes after researchers Justin Drake and Dankrad Feist disclosed receiving significant EigenLayer token incentives. Drake highlighted the substantial value of the tokens, potentially surpassing all his other assets.\n\nMiyaguchi reiterated the foundation’s dedication to its role within the blockchain community. She acknowledged that previous reliance on culture and individual judgment was insufficient. The new policy aims to formalize the approach to conflict resolution and enhance the foundation’s integrity.\n\nLefteris Karapetsas, a former Ethereum software engineer and the founder of the cryptocurrency portfolio tracking tool Rotki, believes the Ethereum Foundation should adequately compensate its employees so that they do not feel the need to seek additional compensation packages elsewhere.\n\nThis development marks a significant step in addressing community concerns and ensuring the foundation’s actions align with its ethical standards."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNY3VaWDVYODY5cDl6UXJJRXJTLUduQWoyVlpGUjdoazk1VEFHVW5idHVTM1ltblg1cThMS3hXalUzczVZUWdNMWh2Wm5DSjF3VkNJaXpSRV9hV3hnTXJGNXYwN01vMW1OWDhhdEtLcldhZldTZU9obVNtRm5vMktjN1VUZU9EVjM3SmVHUWdaWm9wLWppWk11MzVXaktLOGVlQmdVQ0JFNnFKdHFIYlJLVUdvSmRPaldTM2dyNll1dlZoT2PSAcgBQVVfeXFMUHE3bkdpcWR2SzRvQk9NNE9wY1U4cGtIRWp3dHIyVmxJNGo5QXU5amZXUVRyejlhMm5BaHpjejFrMVRwYlJJcFlIQkQ3emt1R3FOcndYRVFDTi1mdmU0MHNzbzd5NFd4SjNKTkhJdXdhTEJQT2FOdGE2ajdudWRkX2V6aEU3aDQxTi1CNlJJaGNNUWtwRWdXeUhFM29aMVJsS1lTUmJtMWcyaUtrOGJ0OHdzZEdVbDk1R051anhRenZpSVBtVEh6VzA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF Approval Could Send ETH to a New Record High, Says Bitwise CIO Matt Hougan - The Daily Hodl",
        "content": "The chief investment officer of crypto fund manager Bitwise is predicting new all-time highs for Ethereum (ETH) if spot ETH exchange-traded funds (ETFs) are ultimately approved.\n\nEarlier this week, the U.S. Securities and Exchange Commission (SEC) approved a rule change that sets the stage for the potential green lighting of spot market Ethereum ETFs.\n\nIn a new interview on the Bankless podcast, Matt Hougan predicts investor inflows into ETH ETFs would total billions of dollars and drive ETH beyond its all-time high of about $4,900, which it hit back in November 2021.\n\n“I don’t think Ethereum ETFs will match Bitcoin ETFs. But I do think it will be measured in terms of many billions of dollars…\n\nWill it be enough to drive Ethereum to new all-time highs? I definitely think that’s possible as well. If Bitcoin ETFs did $12 billion in their first four months, I think Ethereum ETFs will do less than half of that but more than a quarter of that. And that’s going to be pretty significant. Remember, that’s against a market with no net new supply. So I think there is real demand.”\n\nHougan believes that ETFs with exposure to multiple digital assets will also launch in the future and investor demand will exist for the different types.\n\n“I think if you think about the ETF investor market if I had to put numbers on it a year from now, I think you’ll have 30% of the market that’s Bitcoin only, you’ll have like 50% of the market that’s a mix, you’ll have 20% of the market that’s ETH only…\n\nMany professional investors looking at the crypto market are looking for sort of tech alpha. They’re looking for that high-returning asset. Ethereum fits nicely into that dialogue. So I think you’ll see all three. And I think the market as a whole will benefit from there being multiple crypto asset ETFs if that’s what we get. It makes the market feel more robust, more real. There’s more to talk about. I think it’ll be a net positive. These are going to be significant.”\n\nEthereum is trading for $3,736 at time of writing, down more than 1% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQWkxVWGZmQ0RmM0ViX2pPLUd2NUNOTS10b211azk2dm95Zk42U0Y0aDU1QUVyaTNzYWpUdTdYNEl4dVhyZ3lEUHlLZkgxT21KSzlueG5xUVpwMW9SQk9aOWZUbWJZa0xJQTZHb0xpWktnbUtzbE1IeWY1UTdBSDRVckY5Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "1 Top Cryptocurrency Will Soar 116%, According to Standard Chartered. Is It a Buy? - The Motley Fool",
        "content": "A Standard Chartered analyst expects Ethereum to more than double by the end of the year. Here's how that bullish analysis checks out, and how it moved markets this week.\n\nAnalysts from a major British bank say that Ethereum (ETH 0.07%) should more than double from here to the end of 2024. Does this projection make sense?\n\nStandard Chartered's bullish Ethereum analysis\n\nGeoff Kendrick, head of crypto research and emerging markets foreign exchange at Standard Chartered (OTC: SCBF.F), hung an $8,000 year-end price target on Ethereum (ETH 0.07%) earlier this week.\n\nSpeaking to the crypto news site The Block on Tuesday, Kendrick predicted that the U.S. Securities and Exchange Commission (SEC) would approve the first exchange-traded funds (ETFs) tracking Ethereum's spot price. He argued that the approval would inspire large money inflows into the Ethereum cryptocurrency, similar to the inflows that followed after the approval of spot Bitcoin ETFs in January.\n\nThe analyst also noted that he called the money-flow effects of the Bitcoin ETF approval correctly, and underscored the long-term price boosts that should result from these substantial investment moves.\n\nMind you, Kendrick based his Ethereum price target on his latest Bitcoin (BTC -1.31%) target. In other words, the Ethereum ETFs strike him as good news for the crypto market as a whole, not necessarily driving Ethereum prices any faster than the rest of the sector. Historically, Ethereum has closely followed Bitcoin's price movements due to their strong market correlation and shared investor sentiment.\n\n\"Given that we now see Bitcoin reaching the $150,000 level by end-2024, this would imply a level of $8,000 for Ether,\" the Standard Chartered analyst said.\n\nSEC moves closer to approving Ethereum ETFs\n\nTwo days later, the SEC approved a rule change that will result in the first Ethereum-based ETFs on the American markets. The funds aren't hitting the market right away, as the SEC must review each application in detail before approving anything. While this process could take months, the established precedent of Bitcoin ETFs suggests that the SEC's approval may be expedited. It's still a big move in the direction of final approvals, which looks like a matter of time now.\n\nCrypto investors were enthusiastic about Standard Chartered's forecast, driving Ethereum's price 23% higher the next day while Bitcoin rose as much as 7%.\n\nMarket reactions to the forecast and ETF news\n\nThe two largest cryptocurrencies barely moved on the actual ETF news, though. Ethereum has stayed steady since Kendrick's forecast and Bitcoin is down by a couple of percent on Friday.\n\nBut Kendrick's analysis still looks directionally correct. The combination of ETF approvals and the recent Bitcoin halving should indeed power another price surge in Bitcoin, Ethereum, and many smaller altcoins over the next year or so. Growth investing star Cathie Wood of Ark Invest also pegged her year-end Bitcoin target at approximately $150,000, with much loftier long-term goals in mind.\n\nEvaluating Kendrick's analysis and its implications\n\nFrom a perspective of simple logic, the idea of rising crypto prices makes sense.\n\nBitcoin's market value is receiving boosts from both sides of the supply and-demand calculation. The halving of Bitcoin mining rewards makes it harder to come by freshly minted digital coins. At the same time, the new ETFs open the floodgates to nearly direct Bitcoin investments by several new types of buyers -- retail investors can now access Bitcoin ETFs (and soon Ethereum ETFs) in their retirement accounts, while institutional money managers can rely on familiar ETFs instead of opening new accounts in unapproved crypto exchanges.\n\nBurning the value candle at both ends, Bitcoin is experiencing higher demand and strictly limited supply. That's a recipe for higher prices, especially since the necessary Bitcoin mining process stops making economic sense unless coin prices increase enough to make up for the smaller rewards.\n\nAnd where Bitcoin goes, other cryptocurrencies tend to follow. In particular, Ethereum tends to follow Bitcoin's price chart quite closely:\n\nBalancing your portfolio with crypto investments\n\nStandard Chartered's Ethereum target stands 116% above the smart contracts pioneer's current price (and 160% beyond where it sat before Kendrick spoke to The Block). I can't promise that it will meet this exact goal, but I'm convinced that both Ethereum and Bitcoin will rise as the year plays out.\n\nUnexpected twists can throw a spanner in the works, of course, and other unplanned events might drive the cryptos even higher instead. You never really know what will happen in this young and volatile market until it happens.\n\nHence, I wouldn't recommend backing up the truck, betting the literal farm, or otherwise going overboard with crypto investments right now. A diversified approach with crypto playing a modest part in a diversified portfolio will let you enjoy the benefits of a price surge without risking it all. Ethereum looks like a solid buy today, but I wouldn't hold my breath waiting for Kendrick's specific $8,000 target to materialize."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNSTBEZU54c2NYNmVOLTlZM042ZGtGRFZwbWVLQndMaDdDeEo5dVFmU2l6bk01NVBPXzVNMVhxQ1dWV2VfektsYVIyV3luclBuenJERXVDVmYzZFAwZVN6LWxDQ3dvZ3doWnJlNGc5cy0wbE1qYVZTdDRFZ1htb0N4c1pFbzRaeVhPNDhiX2duOGTSAZYBQVVfeXFMTm5DbmZ3Y3k0WkxKZ0N6LVdUZWtPTDBMX0Iyd0ZLQmJQQWtBck9POW1hd2IwVU1OQ25wUE1wUkExaVVoUlAyTV9jbFNPcVFmbFE0LTFVaERUNlhsaEZsU2dOampZSlZBd2JUV0hfUFF5djE5WnlxQmRZd0dSV05TUFFicXNpbDFXMmtMdnJhUElkRm4tTDJR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "ETH vs. ADA: Is Cardano or Ethereum a Better Investment in 2024? - CryptoPotato",
        "content": "Markets got a big spike in Ethereum price this week on crypto exchanges. What’s behind it and what factors can investors take into consideration to determine whether Ether or its friend Cardano is the better buy?\n\nEthereum has a birthday coming up on July 30. It was launched in 2015 to create a “world computer” with the same Web3 blockchain properties as Bitcoin has for storing cash and making payments.\n\nCardano was launched on September 23, 2017 by initial coin offering (ICO) and founded by an Ethereum co-founder, Charles Hoskinson. Today it’s the 10th largest cryptocurrency by market capitalization.\n\nEthereum Market Cap (May 22): $451.8 billion\n\nCardano Market Cap (May 22): $17.2 billion\n\nCertain differences between the two cryptocurrencies are an advantage for one or the other and a good reason to be bullish or bearish for ETH or ADA tokens.\n\nBut some of the two networks’ differences are tradeoffs that are more complex to evaluate as yielding an advantage for either crypto. Here are 7 key factors at play in the future Ethereum price against Cardano:\n\n1. ETH vs. ADA – Technical Analysis (a tie)\n\nEthereum price is nearly all the way back to its ATH (all time high) after spiking this week on Ethereum spot ETF buzz. Cardano has a long way to go. That might actually be more bullish for ADA, with more upside left in its price.\n\nThe recent Ethereum ETF approval will shake up the entire meta for investing in Ether. If bulls take the price past $4,000, another 12.5% increase would pump ETH to $4,500— within striking range of the previous Ethereum ATH of $4,721 in Nov. 2021.\n\nForbes recently mentioned an Ethereum price prediction of $5,000 by the end of 2024. Bitcoin ETF issuer VanEck predicts $11,800 by 2030. An even more bullish outlook forecasts $10,000 ETH by the end of the year.\n\nOver the short term, Cardano technical indicators and moving averages over the weekly span recommended “Sell” on Thursday. Meanwhile, Ethereum technical indicators for the seven-day span recommended “Strong Buy,” according to data from Investing.com.\n\n2. Ether Spot ETF – Regulatory Analysis (bullish ETH)\n\nThere’s no denying it. Charles Hoskinson would certainly agree: U.S. regulators seem to favor Bitcoin and Ethereum over Cardano and other DeFi networks.\n\nThe SEC said okay to Ethereum futures ETFs in October, revealing it didn’t seem to think of Ether as an unregistered security. However, the U.S. regulator has classified Cardano and other cryptocurrencies as unregistered securities in lawsuits against multiple blockchain companies, while ignoring Bitcoin and Ether.\n\nAs Fortune Magazine reported on May 1, “Furthermore, despite launching a number of lawsuits against crypto companies since April 2023, the agency has never named Ether to be a security in its complaints.”\n\nThe SEC lawsuit against Ripple has taken years (since Dec. 2020) and still has not yet been resolved. It is costly and leaves the future unsure for the currencies under the government’s crosshairs.\n\nMarkets abhor uncertainty.\n\nIt may not be fair, but it’s a bullish factor for ETH and bearish for ADA.\n\n3. ADA vs. ETH – Fundamental Analysis (a wash)\n\nFundamental analysis is the preferred method of investors who are not total degenerates. Instead of chart technical analysis or meme currency voodoo economics, the fundamentalist looks at an investment prospect and asks what would “The Intelligent Investor” author Benjamin Graham do if he were here?\n\nGraham says:\n\n“The intelligent investor is a realist who sells to optimists and buys from pessimists. In the short run, the market is a voting machine but in the long run, it is a weighing machine.”\n\nIf a business’s expected future revenues discounted to the present day exceed its current market value, then it may be a good investment. If they match or fall short of the business’s market cap, then it may be a poor investment.\n\nADA: $263.8 million TVL (3% annual reward rate + 121% annual growth rate) / Market Cap: $16.4 Billion\n\nETH $64.9 Billion TVL (5.5% annual reward rate + 145% annual growth rate) / Market Cap: $453 Billion\n\nGoing by the data above without any further context, it appears Cardano would be the winner, because its inflows make up a much smaller portion of its market cap than Ethereum (0.019 to 0.22), but only if we expect it to grow at the same rate as Ethereum in the future.\n\nThe lopsided institutional adoption between the two will make that difficult for Cardano unless it finds a use case, a feature/benefit, and a narrative that shakes up the retail Internet markets for cryptocurrency.\n\n4. Cardano vs. Ethereum – Gas Fees (cat’s game)\n\nThere are lower and more predictable fees on Cardano, but higher fees on Ethereum are also a feature, not necessarily a bug. They make it more expensive to misuse the network for cybercrime that doesn’t pay, so it’s more secure. Big institutions like that.\n\nThat’s one reason why the industry leader, Bitcoin’s slow, expensive network, with a low transaction bandwidth holds its capital so well. In many ways these built-in costs qualify participants better than Know Your Customer policies and automatically and without discriminating on any basis other than ability and willingness to pay the network’s fees.\n\nStill for newcomers, enterpreneurs, startups, and investors starting out with a smaller cash pile, smart contract blockchain networks with lower fees like Cardano have an advantage. Transaction fees on both networks are highly variable and spike during periods of high network use.\n\n5. Ease Of Use – Cardano (another tie)\n\nSome people in Web3 feel Ethereum has an ease-of-use problem. It’s become too overgrown with complicated, byzantine layers on top of layers, creating a steeper learning curve and potential security threats.\n\nBlockchain advocate Daniel Cawrey wrote in a recent opinion article on Blockworks:\n\n“Ethereum is becoming a multilayered lasagna-like system whereby complexity and fees are pushing people to the margins, causing interoperability and security concerns.”\n\nWhile true, much like Ethereum’s higher transactions fees— the complexity of Ethereum may be a reason to be bullish for ETH. It could simply be proof of the network’s success. As Cawrey acknowledges in the piece, the network is beginning to achieve its “world computer” concept.\n\nAny computer architecture expert would be hard-pressed to explain how a Turing-complete global computer that anyone can use on a peer-to-peer network would become anything but a flying spaghetti monster of complexity.\n\n6. Ether vs. Cardano Whales (bullish ADA)\n\nA massive 15,000 ETH whale deposit to Kraken on May 18 spotted by Whale Alert suggested a bear run on Ether by whales could be incoming, but after the SEC approved the spot Ethereum ETF a surge in whale-sized transactions has been net positive for the network, according to IntoTheBlock data.\n\nMeanwhile, Cardano whales have been extremely bullish for ADA in May. They boosted holdings in Cardano tokens by 11% in a month. Whales tend to be smart money with some of the most advanced analytics and market outlooks to know what they’re doing, so that’s positively bullish for Cardano.\n\nhttps://x.com/intotheblock/status/1790774801277042863\n\n7. Ethereum vs. Cardano Memes (bullish ETH)\n\nMeme coins are a definite advantage for Ethereum. While Cardano does have meme coins, none of them are notable and they have not topped the market cap charts like Ethereum’s SHIB, PEPE, and FLOKI.\n\nCardano has succeeded in making a simpler, lower-fee Ethereum, but crypto markets tend to reward projects that leaven their technology with some meme karma. Maybe an Orange Pill Moon Boys NFT collection or something with a dog on it would do the trick."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE1POEJkS3ZkRWtibGZWeEt1bWhMd0NZQmJMeUJTczJzUUpheVhUNnF3bU1fRGw1azJrQ0dJZjh5TGJ2cHk2ejg4M0lrN2Y3NEdhRjhibWpsOXpOTTNPYlBZckRDaS1TMEN5ZHQtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "How far will Ethereum (ETH) go? - Cointribune EN",
        "content": "Sat 25 May 2024 ▪ 10 min read ▪ by Thomas A.\n\nBull markets in cryptocurrencies generally benefit altcoins in a second phase. In the month of May, Ethereum (ETH) performed over 15%, and nearly 65% since the beginning of the year. This resurgence of Ethereum comes after the SEC approved the establishment of ETFs on the world’s second-largest cryptocurrency. While the correlation between Bitcoin and Ethereum remains high, the cyclicity of Ethereum’s price seems to act with as much precision in the structure of this bull market. Decoding the indicators and the dynamics of Ethereum’s price.\n\nSoon an ETF to boost the market?\n\nAs with Bitcoin (BTC), the U.S. Securities and Exchange Commission has approved the establishment of an ETF on Ethereum. Thus, this decision will allow major global managers to expand the cryptocurrency offerings to their clients. However, the SEC still needs to approve its commercialization…\n\n“This decision follows the successful introduction of Bitcoin ETFs in January, which quickly attracted $13.3 billion in net inflows, setting performance records for ETFs at their launch. The arrival of Ethereum ETFs could experience similar success, attracting a new influx of capital to the second-largest cryptocurrency.” Crypto: Ethereum ETFs approved by the SEC! – Cointribune\n\nThis same announcement for Bitcoin had particularly favored the price hike to historical highs. The arrival of an ETF on Ethereum thus leaves potential for a return to the November 2021 highs of $4,868. In May 2024, ETH thus represents nearly 17.7% of the market capitalization. This market share is still far behind Bitcoin, with a dominance near 53%.\n\nThe approval of Ethereum ETFs could thus instigate a catch-up effect compared to Bitcoin. Moreover, these ETFs could also be used to create ETFs representing a basket of cryptocurrencies in the future.\n\nTaking a look at fractals: the rise persists\n\nA major indicator for measuring the viability of the trend on ETH is to use fractals. Indeed, the Hurst exponent (read more) allows measuring the degree of trend persistence from one time scale to another. Furthermore, the Hurst exponent is ideally bounded between 0 and 1. With Ethereum, a Hurst exponent close to 1 indicates significant upward potential, and consequently a good symmetry with major lows. Conversely, a Hurst exponent close to 0 will indicate that the trend is anti-persistent and is likely to turn downward.\n\nEthereum (ETH) price (top chart) and Hurst exponent (bottom chart). Measures the positive (>0.5) or negative (<0.5) persistence of the trend. Graph and data by Thomas ANDRIEU.\n\nGraphically, we see that ETH gained significant upward potential in mid-2022, and reconfirmed it in early 2023. The ensuing bull market, in accordance with theory, was accompanied by a decrease in the Hurst exponent, signaling the loss of upward potential. In March 2024, the Hurst exponent was below 30%, indicating a bearish risk, or at least, the absence of upward potential. Nevertheless, the recent rebound in Ethereum seems to reaffirm a renewal of upward potential, thereby limiting the bearish risks observed in spring 2024.\n\nDespite everything, this approach encourages us to be more cautious about the nature of the bull market compared to 2023. Indeed, it appears clear that the bull market has exhausted a significant portion of its overall potential.\n\nThe cycles acting on ETH\n\nIn several papers, we have had the opportunity to highlight a cycle close to 3.6 years on Ethereum. Furthermore, this dominant cycle corresponds to the same dominant cycle as Bitcoin (BTC). The timing of this cycle thus allows us to judge, and compare, the different bull or bear markets. For example, the bull market observed on Bitcoin since 2023 is strongly symmetrical to previous bull markets.\n\n“Indeed, we know that two cycles of 4 months and 22 months synchronized in February 2018. We are now looking for the time period needed to achieve the next constructive interference. By calculating the LCM(4,22), we get 44 months (3.6 years), which strongly correlates with the cyclicity of equities and Bitcoin (Bitcoin Cyclicity (BTC) – Cointribune).” Technical Indicators: Constructive Interferences and Destructive Interferences – Cointribune\n\nThus, a little more than 3.6 years separate the major peak of 2018 from that of 2021 on Ethereum. Likewise, 3.6 years separate the major low of early 2019 from that of mid-2022, etc. We see here a clear cyclical dynamic, mainly fueled by the correlation of Ethereum with Bitcoin. In this perspective, which remains admittedly theoretical, we could expect an Ethereum peak around mid-2025. We will finally mention the good symmetry observed so far between the current bull market and the previous bull market.\n\nCurrent cycle for Ethereum and previous cycle\n\nETH remains correlated with Bitcoin\n\nIn our previous paper, we highlighted the importance of the correlation between Ethereum and Bitcoin. The lows and the major lows of the cryptocurrency market are indeed linked to the relationship that exists between the two main cryptocurrencies.\n\n“We notice in our case that a high correlation coefficient between Bitcoin and Ethereum is conducive to translating major lows on Bitcoin. Conversely, a low correlation coefficient (prominent low of the coefficient) is likely to translate a sharp weakening of market strength, and major peaks. A major explanation would be that, during bull markets, the dependence of altcoins on Bitcoin decreases.” Bitcoin (BTC) decorrelates from other assets – Cointribune\n\nETH price (top chart) and 6-month correlation coefficient with Bitcoin price (bottom chart). Graph by Thomas ANDRIEU.\n\nGraphically, we can verify that major lows on ETH are linked by a very high correlation with Bitcoin. However, before major bull markets on ETH, we notice that the BTC/ETH correlation is minimal. In March 2024, the 6-month correlation between Bitcoin and Ethereum thus reached a low around 70%. By symmetry, this indeed signaled the likely arrival of an intense bull market on ETH. The study of the correlation between the two assets, however, does not allow us to effectively judge the probable highs on Ethereum.\n\nDespite everything, we see that the correlation between the two assets remains generally high. It is mostly above 80%, which is significant.\n\nTowards $6,000?\n\nThe Technical Analysis of Ethereum’s price can provide us with additional elements. Indeed, we notice that the consolidation of March/April 2024 does not undermine the bullish trend initiated since 2023. On the contrary, the recent bullish breakout allows us to set an initial target (almost reached) towards the recent peaks around $4,000.\n\nEthereum (ETH) price\n\nThen, as we have highlighted, it would be coherent, given the correlation with Bitcoin, to reach the historical peaks at $4,800. In the continuation of this theoretical bullish movement, the next extended target of the consolidation pattern (flag, logarithmic scale) would be near $6,000. This level does not seem graphically and statistically impossible. Conversely, continued difficulties in surpassing recent peaks, or a prolonged drop below $3,000, would signal a probable exit from the bullish trend.\n\nWe have also mentioned the good timing of this dynamic, similar to that of Bitcoin. Nevertheless, we see that a continued upward trend would be with less foundation than the rise of 2023 and early 2024. This necessarily encourages greater attention to market strength indicators.\n\nIn conclusion\n\nThe approval of Ethereum ETFs seems to have triggered a break in the consolidation since March. The upward trend on Ethereum thus continues:\n\nWith an extension of demand to ETFs and the rebound of Bitcoin’s price.\n\nA weakening of bullish strength in terms of fractals. Nevertheless, the upward potential seems to be maintained in April/May concerning the price rebound.\n\nAdditionally, the market’s timing and cyclicity still seem relevant. So far, a certain symmetry persists between the current bull market and the previous one. The upward dynamic is thus accompanied by the market’s structural cycles.\n\nThe correlation with Bitcoin is maintained despite a decorrelation in March 2024. This signal indicates that the bull market on ETH is likely to continue in line with Bitcoin.\n\nFinally, Technical Analysis clearly shows a potential for continuation. The target towards previous peaks, then towards historical peaks, would thus be likely in a bull market. If the bullish strength is maintained, some extended targets are around $6,000, and beyond by extension.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    }
]