[
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPd19vcUJiMGZvMm04b3QxNi1Qc0VLSWFMeG1tZ2RxQnphZGIwT2NqZkZxSURRaFc3aUxpbHotY2U2WE9nanh4UHlnVnBFNG1rYkphUEVCS0l5bGt5TWVRNjAwQVN6eDQzLTEzQ0RZZHM1QTlyN3laY2NZMUtnQ0tkWGNSZVppYXlpVmR1bDRZdTZFdThhNkpzVkxORFZMWmtLdDV1cUZLdU9yLUF1dXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "BlackRock's Mitchnick on Ethereum Trust ETF, Regulation - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNRUlNdjd2b3kyVUF5LWJkYU9kLU9LbE9pZGhTTnRuX3ktbmpwSzB3dWgwZ0hZUlBVN2RSUmxsX0JLbkhNWlRHNGVJSlQyZ1lTdUU1RzQzR2xOcUFweXhkdEFydEpjVTJ3bXlfWVpUbDI4TW14MDg3ckhha294T2haUWttR2F2WTNEU0JoVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "VanEck CEO on the launch of Ethereum ETFs - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nVanEck CEO on the launch of Ethereum ETFs\n\nJan van Eck, CEO of VanEck, joins CNBC’s Bob Pisani on ‘ETF Edge’ to discuss the launch of VanEck Ethereum ETF, how the ETF has launched with no fees, and what having the second largest cryptocurrency in ETF products could mean for investors."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNbE45SHJfcjJEOEt2ZDN3LTNPT292MzZOVVdNNS14QzFZRW1wZnNUWFhiWGxfbGhwbnBXOEl2M0VyakNQUjJ5dVBsNFdEUUotSXRVYjkzTFBBRXIzdnZxWDF5YjE2aWFTYmdDLXhING9wOFgxdm9GLW4yOFpVXzhHUnhmWDRidFowUmJDNU1lbXNKekxGZmRBek9KaHRQSGVpcHF5RmFDZHpob1NLS0s4cVloajUyYjlKNTdvaVJUcmRPTmJLcWJvRjd3dThNdXJjUy1pOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval shows that all of the altcoins will come to Wall Street: Anthony Pompliano - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nEthereum ETF approval shows that all of the altcoins will come to Wall Street: Anthony Pompliano\n\nAnthony Pompliano, Professional Capital Management founder and CEO, joins 'Squawk Box' to discuss the approval of spot ethereum ETFs, what to make of the crypto industry's latest milestone, the road ahead of ethereum and crypto at large, and more."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOZTJ6b2xIczdDcHdOa01WckpISFZEYmc0T2lxOWM0eE02RkluQmFuT1JISUVOYzBmbk10SVdTTXJhRmlSbWRDWU1xbXNDNlpSYVppS2xDRGlLbWtpR0J3ZFZ0UXJod0R6UFI2YVBQdmpGRnotVEFzdTF2VEd0eW5iVmczUXVQbzUy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "What's Going On With Ethereum Classic? - Benzinga",
        "content": "Ethereum Classic ETC/USD is trading up by 2.23% to $24.12 during Tuesday’s session after the SEC approved the first Ethereum spot ETFs, which began trading Tuesday.\n\nThe introduction of Ethereum spot ETFs is a significant event for the cryptocurrency market, primarily benefiting ETH.\n\nInstitutional investors, who are more likely to invest through ETFs, will focus on ETH rather than ETC. This shift in attention and investment could cause a relative decrease in demand for ETC.\n\nSee Also: What’s Going On With Wells Fargo Shares? Analyst Lowers Price Target\n\nInitial reactions might have included speculative buying of ETC due to its association with Ethereum.\n\nHowever, as the market rationalizes, investors may realize that the direct beneficiary of the ETF approval is ETH, not ETC. This realization can lead to a sell-off in ETC as the enthusiasm wanes.\n\nAs retail investors look for cheaper alternatives to ETH, they might initially drive up ETC’s price. However, with the spotlight on ETH due to the ETF, the perceived value proposition of ETC might diminish, causing investors to reallocate funds back to ETH, leading to a drop in ETC's price.\n\nThe cryptocurrency market is also highly correlated. If Ethereum (ETH) is experiencing a downturn despite the positive ETF news, broader market sentiment could turn negative, affecting ETC as well. Traders might sell ETC in response to overall bearish trends in major cryptocurrencies like ETH and Bitcoin.\n\nNow Read:"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQcTVoMV90Um9FT1h3eGJjMG8yX0hjT2c2b1lZMDZPMGRCOElaZ1NTb2RyNVd2d3F2YVRoQUhWUUREaVJhQlNGOEdTRUxWQUpmU0R3SU1RVDN0SUFTVWwxRmMzYnZTMThLT3gzaFhOaWh5Rllhb3FBVGZsWWdKWmNsamNMdXpyRXozOFNncXpGTkZJQU9fbnVRekZtU1QzeXlJdW1heTExdUp1bUg1bkFmadIBtgFBVV95cUxQcUF1RGJKY0thUll2UzZRT0o3RVBGWklMbXRmaFVuQWI0OXJKVW9RWXE2OVJMcUpjTnQ0dloyMHU0Q2JENVE1dlJDSVNDSjdVTHJiZ0VNS0JFX1F1UThURHRjZnZJQTRHdW5KY2hJclhsdzltaXRGWWMxeU5ZUmZRcW8wTDNZRDRGMm5Ibnk5SjFMdV9JVGVXd1h1ZDlKU1pCc1U0c2FRNGY5RUxVd3pUdGhfdnBHQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Spot ether ETFs are set to trade Tuesday. Here’s what it means for the Ethereum blockchain - CNBC",
        "content": "Nurphoto | Nurphoto | Getty Images\n\nSpot ether exchange traded funds are set to begin trading on Tuesday. Crypto enthusiasts are hopeful it will broaden the investor base for Ethereum, a blockchain technology many argue has a far wider use case than bitcoin. These ETFs will invest directly in ether, which is the cryptocurrency used in the Ethereum network. There are already ether ETFs that track futures contracts, but these are the first to track spot ether. Spot ether ETF applications Grayscale Ethereum Mini Trust (ETH)\n\nGrayscale Ethereum Trust (ETHE)\n\nBitwise Ethereum (ETHW)\n\nVanEck Ethereum (ETHV)\n\n21Shares Core Ethereum (CETH)\n\nInvesco Galaxy Ethereum (QETH)\n\nFidelity Ethereum (FETH)\n\nFranklin Ethereum (EZET)\n\niShares Ethereum Trust (ETHA) Like the spot bitcoin ETFs that launched in January, most are waiving fees initially — in many cases for up to a year.\n\nBitcoin ETF have been a hit. Will ether ETFs be the same?\n\nBy the standards of ETF launches, spot bitcoin ETFs have been a success: They recently topped $17 billion in net flows year to date since their debut. For a new asset class, that is a big hit. However, at $1.3 trillion in total assets, bitcoin has about three times the value of ether, which has about $414 billion in assets. That may limit the initial appeal of ether ETFs. Bitcoin prices rose going into the launch of spot bitcoin ETFs. Ether has been a bit spottier: It is up 50% in 2024, but most of the gain came in the first three months of the year. Still, for Ethereum enthusiasts, the primary value of a spot ether ETF is that it's a perfect vehicle to educate the public about the use cases for Ethereum, which are far greater than anything bitcoin has to offer. Ben Johnson, Morningstar's head of client solutions and an ETF research veteran, noted that while bitcoin is often advertised as digital gold, \"Ethereum is more like picks and shovels.\" \"The case for the former is that it is finite and could be a store of value, the latter is not finite and being used to build some real-world applications,\" he said.\n\nWhat the Ethereum platform does\n\nMany investors have never been impressed with bitcoin, primarily because the use case seems limited: It is purely a digital currency. But the Ethereum platform is different. Bitcoin and Ethereum both utilize blockchain, which is a decentralized, immutable ledger to record transaction histories, but they have very different purposes. Bitcoin uses the blockchain as a digital currency. Ethereum utilizes digital money just like bitcoin, but its blockchain has broader purposes. (Ether is the cryptocurrency used in the Ethereum network, but in practice the terms Ethereum and ether are often used interchangeably.) Ethereum is a platform for building smart contracts, which are self-executing programs that enforce a pre-existing contract or agreement. It can be as simple as \"If I do this, you do that.\" The key is that they execute automatically, are done on the blockchain (the Ethereum network) and produce the same result each time they are executed. They also have a wide variety of applications. The most common use is for decentralized finance, or \"DeFi.\" This is just a fancy term for using financial services on the blockchain. In theory, you could perform almost any banking services: Users can send, lend or borrow money, open a savings account, trade stocks or derivatives or other cryptocurrencies, get insurance. Theoretically, you could also do real estate transactions. Users can perform these functions using software called \"decentralized apps.\" The use case goes beyond financial services. Users can play games. Corporations could use it for tracking supply chains. It could even be used as a clearing platform to settle stock trades. Another application for Ethereum: stablecoins. These are cryptocurrencies whose value is pegged to another asset, usually the dollar. Because cryptocurrencies like bitcoin and ether are volatile, many DeFi applications rely on stablecoins for lending, borrowing and trading. The promise is a transaction network that — in theory — could be a much cheaper and faster way to do business.\n\nDoes this open the floodgates for more crypto ETFs?\n\nIt's not clear whether this latest development will open the floodgates for more crypto ETFs — or whether the U.S. Securities and Exchange Commission will find a way to stop the potential tidal wave. Any applicant for other crypto ETFs would still need to show that the underlying market was not subject to manipulation, a crucial requirement for approval of these funds. But a lot may depend on the political climate. In the past, for commodities, the SEC has traditionally required a regulated futures market to trade alongside the asset. Right now, that only exists for bitcoin and ether, so it would take time to develop futures markets for other crypto products. \"Under the current regime in Washington, that would not change,\" Matt Hougan, chief investment officer of Bitwise told me. \"But if you get a change of regimes in Washington, that could change.\" Regardless, expect a lot of trading. \"These new ETH ETFs will likely trade a lot,\" Johnson at Morningstar told me. \"I'd guess that if and when options on these ETFs become available, this will all go into overdrive.... These ETFs effectively add a whole new wing to the crypto casino.\"\n\nIs Ethereum essentially a tech play?"
    }
]