[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOSWlMeGVNZFZLZDl5SThZcENLcndYM0VUTzV4ODB5dzFMQi1CZ05zamIwNkF1aTBuTU94TERxeWJGYUl4N01BT2RqcHZ5N0s3WnNtRjVRQWl5Wl9jZG5KOHotVWx2N082azlNblk1S1BiSU5udFdFUkQtUWx0WVlrdWpyRVB0YTQ5TG4yZG1FbW1DZzJpaE1jYkltaGtqcEJfME9IUVBFNFNPd3ZOTnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Rival Ether Jumps on Bets Token Is Next for ETF Approval - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOSWlMeGVNZFZLZDl5SThZcENLcndYM0VUTzV4ODB5dzFMQi1CZ05zamIwNkF1aTBuTU94TERxeWJGYUl4N01BT2RqcHZ5N0s3WnNtRjVRQWl5Wl9jZG5KOHotVWx2N082azlNblk1S1BiSU5udFdFUkQtUWx0WVlrdWpyRVB0YTQ5TG4yZG1FbW1DZzJpaE1jYkltaGtqcEJfME9IUVBFNFNPd3ZOTnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Rival Ether Jumps on Bets Token Is Next for ETF Approval - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOU2pKZm5Ta1ZaemFSWjRwLUlqTkJwbmtLX1BoQnMtVGdXemU0U2lSekF3MV81VEhLbUFkUWNLYlNWWFVYS3Q1M0ZYNDRpNGYwdjlFMmdwUWJLUzNmY1N1aWp0MWZnSXMzSFBBR0dnOE1PMXA3dVkyYlp4a1FQUUpuQS1fZUpDNjV5ZERpSlBTWldXQmpuSVlIaVdTa9IBowFBVV95cUxOZ3A4RmpsOW9qUWo1alZ6MFNzb1IzVTREXzRFckFFWDhucWpwNlNCbWVaYlVIVnpGZzVzRlU4RzRJSlFzY0hRS2xxeU1Fa2ZvN0M5ck9WX0R4ZDZab3ItbXo4VWVPZ2V6NGx5M00tVTZqOGNYZU5CZXNuVkQ1M1B1WFBkSVdtMUltNlpFZy1wdUUxMUEzZmthUDNUTEtnY3VmZDh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Dips, Then Bounces After ETF Approval While Ethereum Tops $2,500 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe United States Securities and Exchange Commission (SEC) officially approved the trading of spot Bitcoin exchange-traded funds (ETFs) Wednesday, as expected—but the price of Bitcoin itself has been choppy since, though it's currently sitting about where it was when the news hit.\n\nBitcoin (BTC) is currently trading for $45,814 according to CoinGecko. It was around $45,840 when the news leaked via an order on the SEC website that was posted and then removed, and the price jumped as high as $46,263 soon after. It's mostly down since, however, albeit not significantly.\n\nEthereum (ETH), on the other hand, rose above $2,500 for the first time since May 2022 on Wednesday afternoon, and has continued climbing while Bitcoin pops up and down. Ethereum is currently trading for about $2,550, up about 11% over the past day.\n\nOn top of that, native tokens for Ethereum scaling networks have also been hot on Wednesday. Arbitrum (ARB) is up 26% over the last 24 hours to a current price of $2.18, while Optimism (OP) is up 11% today to $3.92. Arbitrum set an all-time high price Wednesday afternoon, following the Bitcoin ETF approval.\n\nAD\n\nAD\n\nBroadly, the cryptocurrency market is up about 2% over the past 24 hours.\n\nEditor's note: This story was updated after publication with additional information.\n\nSHOW ALERT: Tune in to Rug Radio’s FOMO Hour at 10:30am ET Thursday to hear Decrypt’s Stacy Elliott and Fox Business’s Eleanor Terrett chat all things Bitcoin ETF with Farokh Sarmad, Michael Anderson, and Ovie Faruq."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQWm13TFg2M0pBSzYtV0NCQU80VnpGelJwa3dmUWd4Z1FjUG1vYUlGZkRBdmFpYkNLVFBvWUkyV25LYk5GelRKSnFrTExxdTdJcWZ2V1I5V2I3VkJhOEJuOFpnQzhCRHVDNFViTFlSaWhpVXFoa2pseTZHdXF6cklFMjNjclpyc0VDX1ZUQ3F0NjEtb2hRLTlMUExB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum applications take place as top gainers ahead of ETF announcement - crypto.news",
        "content": "According to CoinMarketCap, native tokens of Ethereum applications, including Lido DAO, Rocket Pool, and Aribtrum, take the lead ahead of spot Bitcoin ETF approval day.\n\nLido DAO (LDO) takes the top spot on the gainers on the Jan. 10 charts with a live price of $3.80, with a 24-hour trading volume reaching $385 million, in what is a 16.1% increase. The surge in the value of Ether (ETH) and native tokens of Ethereum-based applications is said to be driven by trader optimism surrounding the potential approval of an Ether exchange-traded fund (ETF) following the anticipated approval of a Bitcoin ETF in the United States.\n\nBlackRock’s iShares Ethereum Trust, a spot Ether ETF, may have its way paved by the approval of its Bitcoin counterpart.\n\nTop crypto gainers of the day | CoinMarketCap\n\nYou might also like: Stacks, Injective, Internet Protocol emerge as crypto top gainers\n\nFor similar reasons, Rocket Pool (RPL) has also seen an increase in value today, operating as a decentralized Ethereum staking pool that offers a competitive annual percentage rate (APR) of up to 4.3% for ETH2 staking. As of the most recent update, the live price of Rocket Pool stands at $31.76, accompanied by a 24-hour trading volume of $22 million, revealing a 14.9% increase in Rocket Pool’s value over the last 24 hours.\n\nRounding out the third spot is Arbitrum (ARB), which stands out as an Ethereum layer-two (L2) scaling solution, employing optimistic rollups to enhance speed, scalability, and cost-effectiveness within the Ethereum network. As of the latest data, the live price of Arbitrum is currently $1.94, accompanied by a 12.1% increase in value.\n\nWith the market experiencing significant volatility this week in response to ETF updates, investors are making many big moves in the crypto space."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNMmROUGR5bFFOUEZ6Q2tJQkkwZmdnY3NSa1ZJbks1RGxMM3BMcFh0aWNCQ1NMSlFXNEM5M0REMHVjeGFqNXBqaThkUmNnVGhKX085X0RfZU5IRDlnWEN5NlZ2MlQ4bi03WUJLWGlXYnJXaHhoVDFfc1YyejFJSnhnM3J3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum vs Bitcoin: Will ETH Price outperform BTC After ETF Approval? - crypto.news",
        "content": "Ethereum price briefly broke past the $2,400 mark on Jan. 10, up 10% within the weekly time frame, ahead of the much-anticipated Bitcoin ETF Approval.\n\nThe crypto market experienced widespread volatility on Jan 9 after the U.S. Securities and Exchange Commission (SEC) announced false Bitcoin (BTC) ETF approval in a now-denounced post on X.\n\nDespite the raging controversy, Ethereum’s (ETH) price has maintained a steady uptrend, trading as high as $2,440 on Jan. 10.\n\nEthereum vs Bitcoin: Crypto derivatives traders are betting bigger on ETH\n\nBetween Jan. 7 and Jan. 10, Ethereum’s 11% price growth performance has dwarfed Bitcoin’s 4%. Interestingly, vital derivative market metrics now suggest that ETH price could further outperform BTC if the SEC issues a timely positive verdict on Bitcoin Spot ETFs.\n\nFirstly, the funding rate represents the interest paid by bullish traders to inverse traders to keep their LONG futures contract positions open. As of morning trading hours Eastern time on Jan. 10, ETH currently has a Funding rate of 0.014%, which marginally exceeds currently exceeds BTC’s 0.12%\n\nEthereum (ETH) vs Bitcoin (BTC) Funding Rate | Source: Coinglass\n\nPut concisely, a higher positive funding rate in Ethereum than in Bitcoin implies increased demand for long positions in the ETH derivatives market, potentially reflecting a more optimistic sentiment.\n\nIn further confirmation that Ethereum price could outperform Bitcoin, the open interest dynamics have also flashed similar signals since the week’s turn.\n\nYou might also like: Bloomberg ETF analyst: Bitcoin ETF to be approved today\n\nETH open interest growth has outpaced BTC\n\nETH Open Interest has increased by 14.6% from $3.71 billion at close on Jan. 7 to $4.57 billion at the time of writing on Jan 10. Meanwhile, BTC open interest has witnessed only a 5% boost, from $6.4 billion to $7.3 billion during this period.\n\nEthereum (ETH) vs. Bitcoin (BTC) Open Interest | Source: Velo Data\n\nOpen interest represents the dollar value of all active futures contracts for a specific cryptocurrency. An increase in open interest implies more new entrants are bringing fresh capital than those closing out their positions.\n\nThe chart above clearly illustrates that the percentage increase in ETH has outpaced Bitcoin’s open interest amid intense speculation on the spot BTC ETF verdict. This affirms that crypto traders are betting on Ethereum to deliver larger price gains in the days ahead.\n\nWill ETH reach $3,000 after BTC ETF approval?\n\nDespite Bitcoin pulling more media traction, the current ETH Funding rate and Open Interest trends imply that crypto traders anticipate higher price gains in Ethereum after a positive ETF verdict. If this scenario continues, ETH’s price will likely reclaim the $2,500 territory.\n\nHowever, IntoTheBlock’s in/out of the money around price (IOMAP) data, which groups the current ETH holders by their historical entry points, shows a major resistance sell-wall around the $2,475 range.\n\nThe IOMAP depicts that 567,150 addresses have acquired 398,810 ETH at the average price of $2,475.\n\nGiven that this cluster of holders has been holding at a loss for nearly two years, they could rapidly book profits as ETH price approaches their break-even point again.\n\nBut if the derivative traders continue doubling their bullish positions as depicted by the elevated ETH funding rates, Ethereum’s price could break above $2,500 for the first time since May 2022.\n\nEthereum (ETH) Price Forecast, Jan. 2024 | Source: IntoTheBlock\n\nConversely, if a material market even sends ETH price into a down trend, the $2,200 support level could be crucial.\n\nAs seen above, the 2.85 million addresses that had acquired 7.7 million ETH coins at the minimum price of $2,220 could mount a formidable buy-wall to avert a prolonged Ethereum price downswing."
    }
]