[
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQV1BqdjJUaDRaSnhyT1lJMF9nVERCcFpMeVR4MUF0Tk1fUDkzUFhXNnNNVFZ0V0lmcklMSVJOY1BEaDZnS04wQVJCMW9VdDB5TGZjcGdsaXBpS215MTFndml4NWNLREpZOGx2TmNxaE9Ic3JWZE5zdGkwRWUyX1BlTldFTUxJNnM4bnI1Vy14eUFmZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval likelihood increases with SEC’s positive signals - Yahoo Finance",
        "content": "The U.S. Securities and Exchange Commission (SEC) appears to be leaning towards approving spot Ether exchange-traded funds (ETFs), prompting a surge in Ether’s value.\n\nEther traded as high as US$3,710 in the past 24 hours, according to CoinGecko.\n\nBloomberg analysts Eric Balchunas and James Seyffart have revised their approval probability from 25% to 75%, citing a rise in discussions about expedited 19b-4 filings, a critical step for ETF launches.\n\nThis potential regulatory shift has not only elevated Ether’s price but also spurred a wider market rally, with Bitcoin trading above US$70,000 for the first time since April.\n\nThe price jump and market optimism coincide with the SEC’s upcoming deadline to rule on VanEck’s spot Ether ETF application by May 23.\n\nWhile the market reacts positively, Seyffart warns that the necessary S-1 registration statements could still face delays.\n\nThe SEC’s evolving stance is influenced by expectations of a potential shift in crypto policies, including a recent cryptocurrency-supportive legislation."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNZ19yT3k0Z2ZPQmNWYmZLYUJHVzhSSnJsU0VIUkF2VE1YSzZvb09hV0lIOUtXYlFmNTEyaVNFTUVSUkpEVkZJQmNvMmppc1A1d0RmcGJncTNVSVhTY0dfQWR0NnAyZnMxTWt4b3dtNC10VWxCb19uSUhIMGhSZ2ZMbWw4UjFSR0U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Fidelity adjusts Ethereum ETF plan, excludes staking rewards - Yahoo Finance",
        "content": "Fidelity Investments has revised its Ethereum exchange-traded fund (ETF) proposal, now excluding staking rewards.\n\nThe updated filing with the U.S. Securities and Exchange Commission (SEC) arrives just days before the May 23 deadline for the ETF’s approval decision.\n\nThe amendment to Fidelity’s S-1 registration statement, which now omits references to staking rewards, appears to be a response to the SEC’s enforcement actions, particularly the June 2023 case against Coinbase for offering staking services, which was deemed a securities law violation.\n\nThe removal of staking from Fidelity’s ETF strategy could alter the product’s attractiveness to investors, particularly those interested in the additional yield from Ethereum’s validation process.\n\nHowever, SEC approval could signal a major step in integrating cryptocurrencies into mainstream finance, with analysts predicting strong investment inflows, akin to the initial success of Bitcoin ETFs.\n\nMeanwhile, the SEC may be leaning towards approving spot Ether ETFs.\n\nBloomberg analysts Eric Balchunas and James Seyffart on Monday revised their approval probability from 25% to 75%.\n\nEther has since surged in value, trading as high as US$3,818 on Tuesday, according to CoinGecko."
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9lejJkYUNPcDdITTRwSlI1OWtzZmtrdGI5VlVUM3NHQ0xLanYxdmlWZ0pRQ2pNNHVoTDJzTHFOV3FydmlMM1Y3RGllckdRZmprcFFmbmYzSnB0UXVmakk5NGZmZTJDVGxLd1JxOVpTODE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ether jumps 16% on US ETF approval speculation - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Cryptocurrencies myFT Digest -- delivered directly to your inbox.\n\nThe price of ether has jumped more than 16 per cent on speculation that US regulators will give the green light to stock market funds that invest in the world’s second-biggest cryptocurrency.\n\nThe sharp rise, which began last night, caught many traders by surprise as most had expected the Securities and Exchange Commission to delay or reject the first ether exchange traded fund by a Thursday deadline. Bitcoin also rose 6 per cent overnight to just over $71,000.\n\nThe renewed pressure on the SEC comes after the agency in January gave approval to exchange traded funds that invest bitcoin, giving way after years of delays. The spot bitcoin ETFs have drawn more than $10bn into funds run by assets managers such as Fidelity, BlackRock and Ark Investment Management, and helped fuel bitcoin’s rise to a record high of more than $73,000 in March.\n\nEther hit a six-week high of $3,700 after several media reports said issuers had been asked by the SEC to file amended applications for their spot ether ETFs.\n\n“Given the radio silence and lack of [SEC] engagement on the filings, consensus was that an ether exchange traded fund would be denied,” said Gautaum Chhugani, an analyst at Bernstein.\n\nThe first decisions, on funds run by VanEck and Ark Investment Management, are due on Thursday and Friday respectively.\n\nBut analysts said this first stage of the approval process might not mean investors could shortly start trading the funds. Nate Geraci, president of The ETF Store, a financial adviser, said on social media site X that the SEC had no deadline to sign off the second, final stage.\n\nChhugani said the political dynamics around crypto in Washington were shifting, after 18 months of regulatory crackdowns and Democrat-led blocks to regulation.\n\nHe noted that former president Donald Trump had hosted an event for crypto enthusiasts and last week Congress agreed to overturn a controversial accounting rule that penalised banks wanting to hold digital assets for customers.\n\n“All of these, in our view, have likely caused a last-minute change of heart in the incumbent administration, perhaps realising the anti-crypto stance may turn out to have a political cost,” he said.\n\nEther is the cryptocurrency linked to the ethereum blockchain, which is widely used as the platform for building new cryptocurrency projects. Its technology can hold assets and enables programmers to code functions for buying and selling into smart contracts.\n\nSeveral other asset managers also have filed applications with the SEC for ETFs that invest directly in ether, including Fidelity and BlackRock.\n\nGeoff Kendrick, an analyst at Standard Chartered, said he expected the price of ether to rise to $8,000 by the end of the year as “once investors realise ETH is the ‘big tech’ of digital assets they are likely to embrace it”."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxNYnFNMU9IOHFLMlhDSmRENFhWczVRNmdBQWd1bDBSeTg4SGRWQVg1b0JOYWNTQk9YeGRib2J3X2h5dEJ3LXhCR3phaGI5TU1aWndxanZUdkRiZUs1dnhWSVdldVBPUnFfc2RxM3d6X0I3ZG8xZ0xMcjVPdWVYYTNHY3Y1YWhkM0FUZUFWTXFkR0dzTmFReE1RdmVLak9fZksyX1RyTm5pWjFjWGlMYzFGVWVQNkhKU3hQcEdHN1UtUTdGa0tvWFRQZzZDcXRPemF6YWx1VGtyU3ZIdjdJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "EXCLUSIVE: Ethereum ETFs Could Drive 'Mass Adoption' — What Investors Need To Know Now - Benzinga",
        "content": "The U.S. Securities and Exchange Commission’s (SEC) recent request for revisions to Ether ETF applications has sparked a wave of optimism in the cryptocurrency industry.\n\nBenzinga talked to experts, who believe a potential green light for these ETFs could attract new investments and accelerate the mainstream adoption of Ethereum and other alternative cryptocurrencies.\n\nWhat Are Ethereum ETFs?\n\nEthereum ETFs would function similarly to any other ETF you might find on the stock market.\n\nIt would be a basket of investments that tracks the price of ether ETH/USD, the native cryptocurrency of the Ethereum blockchain.\n\nInvestors could buy shares in the ETFs just like they would buy shares of a company, gaining exposure to Ethereum’s price movement without needing to directly own or manage the cryptocurrency itself.\n\nWhy Are Ethereum ETFs Important?\n\nThe approval of Ethereum ETFs would be a significant milestone for the cryptocurrency industry. Here’s why it’s generating so much buzz:\n\nIncreased Accessibility: ETFs offer a familiar and regulated investment vehicle for mainstream investors who might be hesitant to dive into the complexities of cryptocurrency exchanges. This could lead to a significant influx of new capital into the Ethereum ecosystem, potentially driving up its price.\n\nETFs offer a familiar and regulated investment vehicle for mainstream investors who might be hesitant to dive into the complexities of cryptocurrency exchanges. This could lead to a significant influx of new capital into the Ethereum ecosystem, potentially driving up its price. Enhanced Legitimacy: A green light from the SEC would be a major vote of confidence for Ethereum, signifying its acceptance as a legitimate asset class. This could attract institutional investors who have so far remained on the sidelines due to regulatory uncertainty.\n\nA green light from the SEC would be a major vote of confidence for Ethereum, signifying its acceptance as a legitimate asset class. This could attract institutional investors who have so far remained on the sidelines due to regulatory uncertainty. Potential Price Impact: Analysts at Standard Chartered predict a surge in ether prices to $8,000 by the end of 2024 if an ETF is approved. The influx of new capital, combined with the increased legitimacy, could fuel a significant price rally.\n\nJohn Patrick Mullin, Founder and CEO of MANTRA, emphasized the relevance of ETH ETFs, noting that they represent a substantial opportunity for institutional investment.\n\n“Given the innovative nature of Ethereum’s tech, including smart contracts and a wide range of dApps, ETH ETFs might attract significant interest from investors who are keen on more diverse crypto exposures,” Mullin stated.\n\nThe approval of ETH ETFs could potentially lead to massive inflows of capital.\n\nMullin believes that ETH ETFs could see similar or even greater inflows compared to Bitcoin ETFs due to Ethereum’s versatile technology.\n\nOn the other hand, Andrey Stoychev, Head of Prime Brokerage at Nexo, estimated that Ether-based ETFs might see volumes roughly 30% lower than spot Bitcoin ETFs, reflecting Bitcoin’s pioneering status.\n\nCould It Lead To Other Altcoin ETFs?\n\nApproved ETH ETFs could set a precedent for other altcoin ETFs. Cryptocurrency traders have even suggested a Dogecoin DOGE/USD ETF is not out of the question.\n\nMullin suggests that once regulatory bodies are comfortable with Ethereum, it could lead to broader acceptance and recognition of other cryptocurrencies.\n\n“This could diversify the market further and provide more investment opportunities,” he said.\n\nStoychev echoed this sentiment, stating that the success of an ETH ETF could streamline the approval process for future altcoin ETFs, provided they meet the SEC’s requirements.\n\nWhat Does This Mean For The Price Of Ethereum?\n\nThe approval of ETH ETFs is expected to have a significant impact on Ethereum’s market dynamics.\n\nMullin believes that approval would initiate a virtuous cycle of stable liquidity and trust-building, potentially leading to more ETFs and increased adoption.\n\n“Mass Adoption. It's happening due to ETF approvals,” he affirmed.\n\nIn contrast, a denial could lead to a temporary drop in ETH’s price due to negative sentiment, although the long-term impact might be less severe if the broader crypto market remains positive.\n\nStoychev noted that if approved, ETH could experience a price increase similar to Bitcoin’s 50% rise post-ETF approval.\n\n“ETH could potentially rise to above $4,000,” he suggested, while also warning of a temporary lull and a potential drop back to $3,000 if the ETF is not approved.\n\nAlso Read: Top House Democrats Will Not Rally Party Against Crypto Bill Despite Opposition\n\nWhat Do Experts Think About Ethereum ETFs?\n\nRoy Hui, Co-Founder and CEO of LightLink, highlighted Ethereum’s expansive ecosystem and its role as a pivotal infrastructure for the global digital landscape.\n\n“The ETH ETF stands out amid other crypto ETFs due to Ethereum’s expansive ecosystem, robust economy and leading market capitalization,” Hui said.\n\nAlvin Kan, COO of Bitget Wallet, pointed out that the approval of Ethereum spot ETFs could lead to increased investment, funds, and liquidity from the U.S. stock market, supporting ETH’s price.\n\n“This may mimic the impact of Bitcoin, where external liquidity significantly increases its price, leading to a new historical high in a relatively short period of time,” Kan explained.\n\nWhat Happens Next?\n\nThe approval process for Ethereum ETFs faces several challenges, especially from the SEC.\n\nUnder Chairman Gary Gensler, the SEC has shown a preference for cryptocurrencies that adhere to Bitcoin BTC/USD like standards, posing special challenges for Ethereum due to its security and securitization risks.\n\nKan also noted that the approval of an Ethereum ETF could set new standards for other cryptocurrencies and provide them with examples of applying for their own ETFs.\n\nConversely, a rejection could imply that only cryptocurrencies following Bitcoin-like standards would be considered for ETFs, excluding those based on proof of stake (PoS).\n\nThe potential approval of ETH ETFs represents a critical juncture for the cryptocurrency market, with significant implications for Ethereum and other digital assets.\n\nAs the industry waits with bated breath, the decision could either propel Ethereum into a new era of institutional adoption or prompt a temporary market correction.\n\nThe future of digital assets and regulatory trends will be further explored at Benzinga’s Future of Digital Assets event on Nov. 19.\n\nIndustry leaders, investors, and policymakers will gather to discuss the evolving role of digital assets in the global financial landscape, offering valuable insights into the impact of regulatory decisions like the potential approval of Fidelity’s spot Ether ETF.\n\nRead Next: Bitcoin Fear And Greed Index Turns Bullish: 10x Research Highlights Key Trade Strategy\n\nImage: Shutterstock"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOWjU4Tkp0S215RFBWOEFqTzZMcTV6NWtCT1VkUDFkZnlWMjRmeWl5MEtON2ZiVkphcVRQVTFGZ2phSWcyanU5VVpGSGRrWS1GQ2tKeXFEYVdkV0g5ZlRjbVFnS0JlY0NXQTJFb3B6cWtRa1E3dVlwNnlQS0p6QmVwQUplVE1BbjVqMVo4MkJhQmtRSi1kSDkxcDVSLUd2ZzVZc2Q5ZDNMONIBrAFBVV95cUxPR01FQlFIbXo4bk55RTdWWGtpSjg1SXNQdlFINVRvc3dUNm9PN3RidEphOC12ZVZKYU1DdVBnb1VVXzI5bV8wN1hsdi1BbVdianJYZ2ZYX0R2bDY3d1FlYnEtWnp4STRvNnJTS1lmSTA5NFB3czEyM0cwc2R6OUV3cks5NkVLUHVxMU9zSEhVeFJCcWR6THhFTTZQX040LW5xMUgyMzFjS2pnUU9h?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Uniswap fights back against SEC as the ethereum crackdown continues - CNBC",
        "content": "watch now\n\nFor years, the Securities and Exchange Commission has been cracking down on the crypto sector writ large, but in the last few months, the agency appears to have trained its sights on ethereum , in particular. Some of the biggest names in decentralized finance are now fighting back. In a 40-page filing Tuesday, Uniswap Labs — which builds decentralized finance infrastructure including a popular DeFi crypto exchange that enables users to custody their own coins — detailed to the SEC all the reasons why the agency shouldn't pursue legal action against them. It comes a few weeks after the commission issued Uniswap a Wells notice, warning the company that it identified potential violations of U.S. securities law. \"The SEC's entire case rests on the false assumption that all tokens are securities. Tokens are in fact, simply a file format for value,\" said Uniswap's chief legal officer, Marvin Ammori. \"The SEC has to essentially unilaterally change the definitions of exchange, broker and investment contract in order to try to capture what we do,“ Ammori said. A Wells notice is typically one of the final steps before the SEC formally issues charges. It generally lays out the framework of the regulatory argument and offers the potentially accused an opportunity to rebut the SEC's claims. So far this year, the federal regulator has sent Wells notices, filed lawsuits, or reached settlements with a host of crypto firms, and the SEC's legal challenges are increasingly focused on ethereum and players working in decentralized finance, including ShapeShift, TradeStation, Uniswap and Consensys. It also comes as the agency is reportedly investigating the Ethereum Foundation. CNBC reached out to the SEC about the recent batch of Wells notices sent to crypto firms, and an agency spokesperson declined to comment. In April, Consensys tried to preempt the SEC's action with its own lawsuit, alleging overreach on the part of the regulator. The 10-year-old crypto firm said its suit followed three subpoenas issued last year, plus a Wells notice from the SEC that claimed the company was violating federal securities laws. \"This action is about the almost certainty that we hold that the SEC is trying to slow or kill ethereum, decentralization, disintermediation and disintermediated technology in the U.S., and probably wouldn't stop there with its long arm,\" said long-time ethereum veteran Joseph Lubin, who went from co-founding the blockchain to launching and running Consensys. \"It might influence other nation-states to do similarly draconian things,\" continued Lubin.\n\nSecurity vs. commodity\n\nThe recent spate of actions targeting major names working in the ethereum ecosystem comes ahead of a long-awaited decision on whether the regulator will approve or deny applications to launch spot ether exchange-traded funds. To date, the agency's stance on ether's classification as either a commodity or a security remains uncertain. \"We think big banks like the way things are organized. We think certain factions of the U.S. government like the way they operate,\" said Lubin. “Without explicitly stating their intentions, without public discussion and clear rulemaking, the SEC seems to have decided to reclassify ether as a security without being able to utter that that's what they're doing.\" The industry argues if ether — the native token of the ethereum blockchain — gets classified as a security, it could throw the future of the ethereum network and many adjacent crypto firms into question. Exchanges, both centralized and decentralized, would be forced to choose between registering with the SEC, or delisting ether altogether. \"If the SEC, in fact, does take the position that ethereum is a security, pretty much everyone in this business that is using or providing services of the ethereum blockchain, they're going to be on notice that they might need to be registered,\" said digital assets attorney Christopher Gerold, who previously served as the chief of the New Jersey Bureau of Securities. \"Whatever protections they thought they had before are no longer going to be there, and we're going to see a shift in the industry,\" continued Gerold.\n\nwatch now\n\nThe head of litigation and investigations at Consensys told CNBC that the firm's been alarmed that the SEC has been targeting developers. \"They asked for a list of the names of any Consensys developers who contributed any coding to the merge,\" said Laura Brookover. The so-called merge was a years-in-the-making systemwide upgrade to the ethereum blockchain that took effect in September 2022 and changed the way transactions are verified. The proof-of-stake model, which replaced the proof-of-work model, requires volunteers on the network to put up their ether tokens, or \"stake\" them, in order to secure the network. Brookover says the agency has explicitly asked for the identities of public and private Consensys software developer code repositories. \"Those are very strange requests from a financial regulator,\" continued Brookover. \"I can speak to that, because I used to be in the CFTC's enforcement division and investigated cases myself.\" Multiple coders and industry executives have told CNBC that it is possible the SEC could be taking more of an interest in ethereum, because the regulator thinks its native token functions more like a security after the merge. Brookover told CNBC that the Consensys suit asks the court to declare both that ether is not a security and that the SEC lacks jurisdiction to investigate ethereum. Ultimately, the regulator will have to respond to the Consensys complaint in a legal filing. \"They're going to be hard pressed not to say in their answer whether they think ethereum is a security or not,\" said Gerold, adding that he suspects that the agency will take the position that it is a security because of the proof-of-stake change that took effect two years ago. One thing the SEC has been clear on is its classification of bitcoin as a commodity. With ether, the narrative has changed. In 2018, when Bill Hinman was still the director of the Securities and Exchange Commission's Division of Corporation Finance, he told CNBC that, \"When we look at bitcoin or if we look at ether and the highly decentralized nature of the networks, we don't see a third-party promoter where applying the disclosure regime would make a lot of sense.\" \"So we're comfortable ... viewing these as items that don't have to be regulated as securities,\" continued Hinman. In April 2023, when Rep. Patrick McHenry, R-N.C., asked SEC Chair Gary Gensler whether ether was a commodity or a security, Gensler demurred.\n\nwatch now\n\nSEC vs. crypto\n\nGensler has, in multiple interviews, repeatedly shared that he believes much of the industry already belongs under its jurisdiction, and its lawsuits are simply bringing the industry under compliance. Crypto firms argue that the recent legal battles haven't given the regulatory clarity the industry has been seeking for years. With the Uniswap Wells notice, for example, a source at the company told CNBC that dealing with the SEC was akin to \"talking to a wall.\" For two years preceding the Wells notice, Uniswap described the protracted interactions with the agency as an opaque process that involved responding to multiple requests, including giving testimony and sending several documents to the agency, without getting much feedback about the regulator’s concerns around potential wrongdoing. This source also told CNBC they had not heard from the regulator at all in 2024 until the agency told them in a half-hour phone call that they would be receiving a formal notice.\n\nwatch now\n\nBoth Consensys and Uniswap suggest the SEC's broad approach to classifying securities may be outdated. \"The SEC is arguing that the Uniswap protocol is an unregistered securities exchange, and that the Uniswap interface and wallet are both unregistered broker brokers,\" Ammori said. But Uniswap argues that the protocol itself is a general purpose computer program that anyone can use and integrate. \"So the protocol is not an exchange also, because under the law, it would have to be specifically designed for securities trading, and it is not,\" continued Ammori. Uniswap argues in its response to the SEC that the majority of its trading volume is obvious nonsecurities, like ether, bitcoin and stablecoins. \"It's not run by a group, as the definition requires, but as autonomous software no person or group controls,\" added Ammori. \"The SEC knows that the current definition of exchange does not cover the protocol, or anything we do. That's why as we speak, there's a pending rulemaking, for the SEC is trying to redefine about a half dozen words in their own regulations to try to capture us,\" continued Uniswap's chief legal officer. Alma Angotti, partner and global legislative and regulatory risk leader at the consulting firm Guidehouse, cautions that it is less clear whether decentralized exchanges function like an alternative trading system, or a market maker — or whether they really are just a technology that does not act as a broker-dealer. Meanwhile, as the SEC ramps up its focus on decentralized players in the crypto ecosystem, centralized players also remain under scrutiny by the regulator. In May, investment platform Robinhood announced it received a Wells notice for the company's crypto operations. The SEC has also sued Coinbase and Binance. With multiple pending legal challenges from the regulator and enduring uncertainty about the future of crypto regulation in the U.S., multiple crypto businesses have said they are considering decamping from the country altogether. \"We've got companies that are wasting resources trying to figure out, 'Am I a broker-dealer? Are these assets securities?'\" said Binance's former chief compliance officer, Christina Rea. \"We're already having a hard enough time trying to get them to be compliant with other important laws — anti-money-laundering laws, anti-bribery and corruption laws.\" On Thursday, the commission will issue a decision on whether to approve one of the spot ether ETF applications after a multimonth delay. Many are waiting to see whether the regulator will offer clarity on its stance on ether. — CNBC's Jordan Smith contributed to this report."
    }
]