[
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPRDJHWlVMaElqOXlQWG5QTUVEcWszNU1TNDk2Z0xIMTRUMFU2SVFwS21CNVFCWXlFMzhpYnlCdEdLMFZGVWdrWmtSdXFBMktYNDlHa1FQZzltMnFFVzNnRUhhTWNPRkJvcUZ6Sm5PazhiZ0tqd3JnRng5SXVlWTJoMDRaUzBNcE0yT19R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Gaming Blockchain Ronin’s Mobile Wallet Adds Ethereum, Polygon, BNB Chain Support - Yahoo Finance",
        "content": "Gaming Blockchain Ronin’s Mobile Wallet Adds Ethereum, Polygon, BNB Chain Support\n\nSky Mavis, the creator of the popular play-to-earn NFT game Axie Infinity, has announced a significant upgrade to the Ronin blockchain's official crypto wallet. The latest update introduces several new features, including multichain support, an in-app web browser, a revamped visual design, and support for multi-party computation (MPC).\n\nThe Ronin wallet now supports the Ethereum mainnet, Polygon and BNB Chain. This integration allows users to easily manage and transfer assets across multiple blockchain networks from a single wallet. The new version of the Ronin wallet includes an in-app web browser that enables users to access decentralized applications (dApps) and interact with blockchain-based services directly from the wallet.\n\nThe wallet's visual design has been revamped to provide more detailed information on specific token activities and NFT information. Users can now easily view their asset balances, transaction history, and NFT collection in a more user-friendly interface.\n\nThe Ronin wallet now supports MPC, an optional security feature that allows users to divide their wallet's login information on the backend. This feature requires two or more pieces of login information instead of a single private key, enhancing the security of the wallet. When combined with a social login, the MPC feature can be used across multiple Ronin-based games like Axie Infinity and Pixels without creating separate wallets for each game.\n\nThe Ronin wallet upgrade is a significant step forward for the Ronin ecosystem, providing users with a more versatile and secure platform for managing their digital assets. The addition of multichain support and other features is likely to attract new users and further drive the adoption of the Ronin blockchain.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPRDJHWlVMaElqOXlQWG5QTUVEcWszNU1TNDk2Z0xIMTRUMFU2SVFwS21CNVFCWXlFMzhpYnlCdEdLMFZGVWdrWmtSdXFBMktYNDlHa1FQZzltMnFFVzNnRUhhTWNPRkJvcUZ6Sm5PazhiZ0tqd3JnRng5SXVlWTJoMDRaUzBNcE0yT19R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Gaming Blockchain Ronin’s Mobile Wallet Adds Ethereum, Polygon, BNB Chain Support - Yahoo Finance",
        "content": "Gaming Blockchain Ronin’s Mobile Wallet Adds Ethereum, Polygon, BNB Chain Support\n\nSky Mavis, the creator of the popular play-to-earn NFT game Axie Infinity, has announced a significant upgrade to the Ronin blockchain's official crypto wallet. The latest update introduces several new features, including multichain support, an in-app web browser, a revamped visual design, and support for multi-party computation (MPC).\n\nThe Ronin wallet now supports the Ethereum mainnet, Polygon and BNB Chain. This integration allows users to easily manage and transfer assets across multiple blockchain networks from a single wallet. The new version of the Ronin wallet includes an in-app web browser that enables users to access decentralized applications (dApps) and interact with blockchain-based services directly from the wallet.\n\nThe wallet's visual design has been revamped to provide more detailed information on specific token activities and NFT information. Users can now easily view their asset balances, transaction history, and NFT collection in a more user-friendly interface.\n\nThe Ronin wallet now supports MPC, an optional security feature that allows users to divide their wallet's login information on the backend. This feature requires two or more pieces of login information instead of a single private key, enhancing the security of the wallet. When combined with a social login, the MPC feature can be used across multiple Ronin-based games like Axie Infinity and Pixels without creating separate wallets for each game.\n\nThe Ronin wallet upgrade is a significant step forward for the Ronin ecosystem, providing users with a more versatile and secure platform for managing their digital assets. The addition of multichain support and other features is likely to attract new users and further drive the adoption of the Ronin blockchain.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOUE9zYk1POUJNZ1Y4d0ZpcGNzQXp2MDE3TlUwU2xtdDVCc3JJaFAzUnprNTlzMkNBUFVvU0xWTW9WNDJoRGlvN3EyTmYtRnNaY0RmaGFaS2FYd3Flb2pKUmtSeFB0N3A1MXpiRC1YU3BPaXZGTEhldWVKejdYR0haZnM2aV9VemFjc2VNUzFTM1BSWjRFaHMzSVR6R3pSdm5KTFJrSEdkZ0RNcjhVNzJBaUM4RlcyMG5PdUwwOElxa0s5LW9KYnJv0gHMAUFVX3lxTFBiMEJlZVhZd2F4ellMNkdCRDNCdWZPRTJocWVFbDNMQkVTWl9NT2N4M2ZYVlB6SnJlUXdTYnVnT1pTb1M5TGpoSlA2N3pTX0FpMk5Ua2dXTzd1N1cxampDc1RiRjNUVGIwVzdnNzRqTlh4S24wZUZFYjBVczNYNlZrTFRta04xbVQ5cmxURHNTbkNCRlZQODFINjNUOXVLMUNXcjZuWlZJTk9SbFVuMS1WcWdGeWIwM0psUWIyM2tkcFc3ai1fdTVhMnZVcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Crypto Whales Taking Advantage of Bitcoin, Ethereum and Chainlink Dips, According to Lookonchain - The Daily Hodl",
        "content": "Crypto whales are buying up the correction in digital assets markets, according to blockchain tracking firm Lookonchain.\n\nLookonchain says that as Ethereum dipped in price, a “smart whale” with a solid track record of profitable trades bought up the dip with over 3,600 ETH.\n\n“After the price of ETH dropped [on Friday], this smart whale bought 3,600 ETH ($8.9 million) back at a lower price…\n\nThis whale is very good at buying ETH at low prices and selling ETH at highs.\n\nThe profit is ~$25.8 million currently!”\n\nAt time of writing, ETH is trading at $2,470.\n\nLookonchain also spotted a whale scooping up decentralized oracle provider Chainlink (LINK) as it dipped to the $14.81 level.\n\nAfter the price of LINK dropped [on Friday], a whale spent $8.9 million to buy 601,949 LINK at $14.81 with three new wallets.\n\nThe price of LINK appeared to have stabilized after the large whale purchase. At time of writing, LINK is trading for $15.53.\n\nLooking at Bitcoin, the on-chain data tracking firm says that a crypto whale withdrew nearly $30 million worth of BTC from crypto exchange Binance as the price fell below the $42,000 level.\n\n“It seems that a whale is buying BTC!\n\nIn the recent market drop, a new wallet withdrew 700 BTC ($29.36 million) from Binance at an average price of $41,948.”\n\nAt time of writing, BTC is trading for $41,570.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPRzlGZlNkRUpCeThJNWhPVWdsQjNSNGUxVkJSaF8xbHZJMkRubGE0R0NTSk1UOFJ6a2tDNF9wZS1CcmZ4ZFIwZWpQU0EwS2Nhc1BGdV9faDJqX2tWWEJ2Wm9UNXVKNXZkYzdIUFdCX2w5dGZhYnRxMGhXcnJLaEVsYXJnM21MQk5tV3Q0S3o3Y1pNeTEtXy02WDlubFdwODNiXzg2SWdoRUpDbDFwM2paOFFaWTJKaS1WUldSQzQ2NUZqek5zWUVUMGVzNXLSAdIBQVVfeXFMTXZTZjFuNTc0V1g1c1pRay1LaC11S3JJemZRdXEtajNRODliX0lvV1JYZWxjNWVWU1JUUl80cS0tYW9zbmlldkVzMmw1NDB3X3J4Z1RWY25CczQ1aHJiSmdjR2hiQ1RkcWtpelpRdlF0QjBKWEJRcmw3WW9JQ050d2puOGtqckM5bHF1MGE5YTVXZndlc0VMSUwyNzlYZlAxSVcyYWE1bDBGVFkzbC1sN1pZVlJ2bHl3ZlNVa0NVeWlaWFVMMW9LalcxcWdEMUJNVWNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Aggressive Bull Market Speculation on Ethereum Has Not Yet Begun, According to Analytics Firm Kaiko - The Daily Hodl",
        "content": "Crypto analytics firm Kaiko says that speculative fervor on Ethereum (ETH) hasn’t yet kicked off, despite being well off its 2022 lows.\n\nIn a new report, Kaiko says that Bitcoin has benefited from the hype surrounding the approval of BTC exchange-traded funds (ETFs) in the US, but that speculation on an Ethereum ETF has not yet begun.\n\nThe U.S. Securities and Exchange Commission (SEC) has recently decided to delay its decision on banking giant Fidelity’s spot market Ethereum ETF application until March.\n\nSays Kaiko,\n\n“While there is some hype around ETH ETF applications, the data suggest that aggressive speculation hasn’t yet begun. ETH trade volume has spiked, but derivatives markets have lacked the telltale signs of traders positioning for a rally. ETH futures ETFs have also had a slow few months of trading.\n\nETH and BTC correlation has sunk to multi-year lows as each asset matures and develops its own narratives. While ETFs were one of the most catalyzing narratives in BTC’s history, it remains to be seen whether ETH will be able to replicate this. However, ETH has many narratives it can lean on; if ETFs don’t spur enthusiasm, perhaps new Layer-2s or the success of EigenLayer and restaking can.”\n\nKaiko says that derivatives data also indicates that recent ETH moves have largely been driven by spot markets rather than by perpetual futures, which the firm says provides evidence that traders are not using leverage in anticipation of an ETH ETF.\n\n“September and October marked a low point in futures markets, with aggregated open interest (in USD) falling more than 20% from its summer levels. At this time, there was little price movement and funding rates were neutral…\n\nPost-BTC approval, funding rates have reset to neutral, while open interest has surged ahead of price, indicative of increased shorting. Even still, we have not yet seen a major build-up in open interest that is typical of a bull market.”\n\nAt time of writing, ETH is trading for $2,473.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBGOEV0U0Joa2w1SS1fSWwtRGgwc1JiY0VNc0NkaFlxZWRIRGduTEdOa1FoN3Q2Tm5XV1NGOURCcWV6TzUwV3llSEdIM2ZGYS1YNXgxeE52QThDdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "What Are Parallelized EVMs? A Beginner’s Guide - Unchained",
        "content": "Parallelized Ethereum Virtual Machines (PEVMs) enhance blockchain scalability and efficiency, allowing multiple transactions to be executed at the same time rather than sequentially.\n\nThe blockchain landscape is constantly evolving to overcome limitations and unlock new possibilities. One of the latest innovations to address scalability within the Ethereum ecosystem is Parallelized Ethereum Virtual Machines (PEVMs).\n\nRead on to learn about parallelized EVMs and the potential impact of parallelization on Ethereum’s scalability.\n\nWhat Are Parallelized EVMs?\n\nTo understand parallelized EVMs, let’s first grasp the Ethereum Virtual Machine (EVM).\n\nThe EVM allows for the execution of smart contracts on the Ethereum Network. It provides the infrastructure vital to all transactions happening on the blockchain. The growing adoption of Ether and other Ethereum-based tokens strains the EVM, leading to calls for its scaling.\n\nOne intervention that’s gaining traction is parallelized EVMs.\n\nParallelized Ethereum Virtual Machines (PEVMs) enhance blockchain scalability and efficiency by allowing multiple transactions to be executed simultaneously rather than sequentially.\n\nImagine them as supercharged versions of their predecessor capable of handling multiple transactions together. This approach is crucial in tackling the blockchain trilemma as it significantly reduces latency, boosting transaction throughput.\n\nSome of the front runners in the PEVM adoption are the Sei network, Neon, and Monad. The Sei Network went live in August 2023, attracting roughly 29,000 active users. Neon is also active and working on integrating Ethereum decentralized applications (dApps) into the Solana ecosystem. Meanwhile, Monard is yet to launch despite being production-ready.\n\nHow Do Parallelized EVMs Work?\n\nPEVMs leverage the power of parallel processing to achieve timely and scalable transactions.\n\nUnlike the typical EVMs that handle transactions back-to-back, PEVMs split transactions into smaller, independent tasks that can be tackled simultaneously. This means setting up different points for the concurrent handling of multiple trades.\n\nThere are many approaches to parallel processing, but two popular ones stand out:\n\nSharding : Imagine dividing the Ethereum blockchain into smaller, self-contained shards, each with its own EVM. Transactions are then distributed across these shards, allowing for independent and simultaneous processing.\n\nRollups: These batch transactions off the main Ethereum chain, processing them on a separate layer, and then re-submitting them to the mainnet for verification. This significantly reduces the burden on the main Ethereum network, leading to faster and cheaper transactions.\n\nThe Potential Impact of Parallelized EVMs on Ethereum\n\nPEVMs can significantly reduce transaction times and fees by removing network bottlenecks, making Ethereum more user-friendly and accessible to developers and users alike.\n\nWith PEVMs paving the way for faster and cheaper transactions, Ethereum can potentially handle a much larger volume of activity. This opens the door to widespread adoption of dApps and DeFi, bringing the power of blockchain to a broader audience.\n\nThe increased processing power of PEVMs could unleash a wave of more complex and resource-intensive dApps, pushing the boundaries of what’s possible on Ethereum. Applications that might have previously been impractical on the blockchain could become feasible.\n\nAdditionally, making improvements on Ethereum’s mainnet could significantly impact other Ethereum layers. L2 scaling solutions could gain more attention, leading to further development and adoption among users.\n\nPEVMs, however, also present a possible downside. The technical complexity required to implement parallelized EVMs might lead to centralization if only a few big players can implement it. They could also present backward compatibility and transition challenges to existing smart contracts.\n\nBenefits and Drawbacks of Parallelized EVMs\n\nPEVMs could hold so much promise for crypto enthusiasts. But like any technology, it could have its drawbacks too.\n\nPros\n\nReduced transaction latency: Devolving transaction handling to many units hastens their confirmation. Users will no longer have to endure lengthy completion times due to network clogging.\n\nLower transaction fees: PEVMs streamline transactions, eliminating the need to pay more for prioritized exchanges, which makes transaction fees more affordable.\n\nEnhanced Interoperability: PEVM projects such as Neon are working on bringing Ethereum dApps to Solana. Such initiatives will make it easy for users to interact with their peers on different networks without migrating to their platforms.\n\nCons\n\nIncreased complexity: Implementing and maintaining robust PEVMs can be technically demanding. As such, developers and users may face a steep learning curve.\n\nPotential security risks: Parallel processing introduces new synchronization and coordination challenges, increasing the likelihood of bugs and errors with improper implementation\n\nFinal Word\n\nParallelized EVMs are the latest attempt at achieving Ethereum scalability. By introducing parallel processing capabilities, PEVMs open the doors to various applications, from real-time financial transactions to seamless cross-chain exchanges. However, these novel projects require meticulous development and rigorous security edits to ensure stability."
    }
]