[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOVkZhRmhtZ2cyYXF6UzY1NkFPZXZIUEFfUHVVMkxseDRibG55OHMwOGlVNHQyZHhZUHVDWGN0TDVVeXQtRGNhNGZMTkZGSTEteUVPM0hvcjlYczJuN2RidUZpY1JVWUZWNVp3RXcxQjRRdXFNNXM5U2NaTnpTdG5zRWtVWDlUQnBKakR1LUgxVkZsUm1NY0Q0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Should You Buy Ethereum While It's Still Underperforming the Market? - The Motley Fool",
        "content": "A number of factors are holding back Ethereum's market performance, including the reemergence of Bitcoin.\n\nAt first glance, Ethereum (ETH 1.79%), the world's second-most valuable cryptocurrency, seems to be having a banner year. Ethereum is up 57% and appears to be gaining momentum heading into the final weeks of the year. Over the past 30 days, Ethereum is up more than 20%.\n\nBut context matters, and right now, Ethereum is badly underperforming the crypto market. Bitcoin (BTC 2.86%), for example, is up a spectacular 112% this year. And other top cryptocurrencies are similarly posting triple-digit gains in 2023. All of this has complicated the decision-making calculus around Ethereum, which now looks like a market laggard. If you are thinking about buying Ethereum, this is what you need to know.\n\nWhy is Ethereum underperforming?\n\nWhat's particularly puzzling about Ethereum this year is that it's just so hard to pinpoint exactly why it's underperforming Bitcoin and other top cryptos. Heading into 2023, Ethereum seemed to be riding a wave of momentum after pulling off The Merge, which was widely hailed as one of the greatest technical achievements ever in the blockchain world. As a result of The Merge, Ethereum changed its overall blockchain infrastructure, all with the goal of reducing transaction fees, boosting transaction processing speeds, and improving overall efficiency.\n\nBut a number of issues have popped up throughout this year. For one, overall activity on the Ethereum blockchain seems to be down and that's not a good sign for future growth. Case in point: Bitcoin recently passed Ethereum for the first time ever in terms of 24-hour non-fungible token (NFT) sales volume, an area Ethereum has always dominated. And Total Value Locked (TVL), which measures activity on the blockchain, also recently reached a 12-month low, a potential sign of Ethereum's weakening position in decentralized finance. These might just be short-term blips on the radar, but they are still concerning.\n\nThere have been regulatory concerns, too, such as those related to staking activity on Ethereum's brand-new proof-of-stake blockchain. The primary concern is that the SEC's willingness to go after major cryptocurrency exchanges for their staking activity, as we saw earlier this year, will eventually erode the attractiveness of Ethereum as an investment option.\n\nMoreover, The Merge is not having the sort of breakthrough impact it was supposed to have, as measured by transaction fees and transaction processing speeds. For example, transaction fees for relatively straightforward activities, such as buying a new NFT, can sometimes run into the hundreds of dollars. And the main Ethereum blockchain can still only handle 20 to 30 transactions per second, a far cry from the 1 million transactions per second promised years ago.\n\nEthereum vs. Bitcoin\n\nPerhaps the best explanation, though, might be that investors are almost single-mindedly focused on Bitcoin at the moment. Just about everyone seems to be looking ahead to the imminent launch of the first-ever spot Bitcoin exchange-traded fund (ETF), and what that could mean for the broader crypto market. Ethereum almost feels like an afterthought right now.\n\nPerhaps as a result, the longtime strong correlation between Ethereum and Bitcoin appears to be weakening. Until mid-March, the correlation between Bitcoin and Ethereum was nearly 0.95. That's almost a perfect 1-to-1 match in terms of performance. But now the 90-day correlation between the two has dipped to the 0.8 level.\n\nEthereum vs. other altcoins\n\nIn addition, many other cryptos appear to be passing Ethereum right now. That's of particular concern in the case of Solana (SOL 4.65%), which is arguably Ethereum's greatest rival right now in the Layer-1 blockchain space. Solana is up a stunning 325% year to date. While Solana has its own fair share of regulatory and technical issues, investors have largely been willing to shrug them off due to Solana's perceived growth prospects. Solana's new \"crypto phone\" is just one of the most exciting projects.\n\nThese shifting investor perceptions of Ethereum are having an impact on institutional money flows. Quite simply, large institutional investors appear to be taking their money out of Ethereum and moving it into Solana. In 28 of 32 weeks this year, Solana has seen net positive inflows, according to CoinShares, which tracks inflows and outflows into different cryptocurrencies. In contrast, Ethereum has seen outflows. And that has led to CoinShares calling Solana \"the altcoin of choice\" for institutional investors right now.\n\nCan Ethereum bounce back?\n\nAt the end of the day, the decision whether or not to invest in Ethereum comes down to your view of its long-term growth prospects. Ethereum is still the clear leader in just about every niche or sector of the blockchain world and it's one of the few cryptos that seems to have the implicit support of federal regulators. Notably, SEC Chair Gary Gensler has always stopped short of calling Ethereum a \"security.\" And it's not like analysts have completely given up on Ethereum. Standard Chartered Bank, for example, just put out an aggressive $8,000 price target for Ethereum.\n\nGoing forward, I'm keeping a close eye on how Ethereum fends off the threat from rival Solana. This one factor could end up having the greatest impact on Ethereum's long-term growth prospects. If Ethereum is unable to keep up with Solana and other Layer-1 blockchains, that could have a huge impact on my decision of whether or not to invest in Ethereum going forward."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBPeEZTS1ZIUmpsY0ctWXhiY2VuMHBXUDc2QVVrOXFYMFQydWVCOGVPMUhfaTduR3dEZ2l1clJmT0xBWWpWR2NJS1IwZEpBZC1FbVlZeUx1TXNrMTFMaWprRWxmdi0xNzk0VzFaVlpaY0fSAXZBVV95cUxPZW9UaFNza1BtS3h3R2lLSXdEQzQyTlA1WnZxWW5CRjRLaGI1SkRpUDBKSDVfbS1PaEVnZTlCRTc4LVpZRUNBc0gyNFZnVHNCcFBfTUJISFQ5UmhXRVQzdnJEcmZUQ0oxd1REMF9LNTM3a0N1QkZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Is Ethereum once again the victim of its own success? - Forkast News",
        "content": "Ever since Ethereum’s shift to a proof-of-stake (PoS) consensus mechanism, an increasing number of users are getting in on the staking action to reap the rewards that come with it. Institutions are also paying attention, given the decrease in network risk and volatility following “The Merge.” This has led to concerns about how much ETH is getting locked into staking contracts, potentially interfering with liquidity on the network.\n\nDevelopers are already proposing possible solutions to limit the rate of staking, which benefits overall network health but has now limited the opportunities for users to earn a yield from the network. Coupled with an ongoing DeFi winter, there just aren’t as many lucrative returns opportunities in this space as there once were. Truth is, without profitable and reliable alternatives, ETH holders are going to continue to be drawn to staking as the best means of generating return on their assets.\n\nThe rise of Ethereum staking\n\nIt’s been about a year since Ethereum successfully completed the Merge, in which the blockchain switched from a proof-of-work (PoW) consensus mechanism, like Bitcoin, to a PoS one. This was done to significantly improve the efficiency of the Ethereum network and allowed users to earn a passive income by staking their ETH to secure the network. Ethereum 2.0 was born.\n\nOverall, this has been seen as a positive move for the Ethereum network. A significant number of users have staked their assets already, to the tune of 20% of all circulating Ether. In theory, this sounds great, as the idea is that a diverse array of users are both helping to ensure the security of the blockchain and are being rightly rewarded for doing so. The reality, however, is a bit different.\n\nThe rise of large staking providers have made it easier for virtually anyone to get involved, but this is causing the amount of ETH that is staked to continue to quickly rise. At the current trajectory, the amount of ETH locked up could balloon up to as much as 50% by May 2024 and even approach 100% by December next year, according to projections in an Ethereum Improvement Proposal co-authored by Ethereum co-founder Tim Beiko. While actually seeing the entire supply of Ethereum get locked up won’t happen, this situation could still cause a significant liquidity crunch that limits the functionality of the blockchain ecosystem, decentralized apps, and services built on top of it.\n\nThis fiasco has led to Ethereum developers approving a new proposal that would control the rate at which new validators could stake ETH. Known as EIP-7514, this change will modify the “churn limit” function to give it a maximum value that will regulate how many validators are able to join or exit the network within a given timeframe. The proposal is already being included in the Cancun-Deneb upgrade that was slated for this October but will likely now be delayed until early next year.\n\nWhile EIP-7514 will help to buy some time, it doesn’t actually address the underlying problem. Namely, the fact that Ethereum staking, as is, incentivizes locking up funds over keeping them liquid. It’s true that users don’t have to stake Ethereum directly but can turn to other yield-bearing services. However, in the wake of FTX and other recent disasters, the entire DeFi market has seen an almost 80% contraction over the last year. This means there are fewer and less useful places for asset holders to earn yield.\n\nWhat alternatives need to offer\n\nUsers need a safe and lucrative alternative that has advantages to staking, even if the returns aren’t quite at the level provided by staking. These could come in the form of yield-generating accounts that allow for returns on the Ethereum stored inside them, but don’t have days or weeks-long limits on when funds are accessible. Because no staking is actually done, users stay in full control of their own assets.\n\nBetter still, accounts such as these could be significantly more user-friendly than the confusing, alienating process of Ethereum staking, holders would simply need to deposit their funds and sit on them. They could remove them at any time, and overall liquidity on the network is not affected. Users also wouldn’t rely on the health of DeFi as a whole, and will generate returns regardless of what the market is doing.\n\nAnother essential aspect of these offerings is that they can also be “ring-fenced,” meaning the assets are never intermingled with other user’s funds or company activities and aren’t exposed to broader systemic risk. Assets that are used for growth opportunities are separate from those that are just being held as savings. This is important for keeping users safe, as even if the service itself should collapse, all held funds will be completely intact.\n\nImplementing a service where anyone can grow savings without the need to lock up ETH is the ultimate key to solving the ongoing staking issue that is plaguing Ethereum. Protocol changes are helpful, but what is essential is changing the incentive that users have for earning yield on their assets. By providing growth opportunities that don’t involve actual staking, these accounts can be simpler, safer and healthier for the whole ecosystem than centralized alternatives. The solution is obvious; now it’s time to bring something like this to Ethereum holders worldwide."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5fd09jR2ktNzhLSlZnSklVd0lpeEdYYWYwcE9UZU4wUzQzT1doNGRGeTdKcTFFODBBYUhVZm9YaW1SRHl6MzczTVRQZGJEV1hFc3kwNmlVY0JtM1lxenJPdGVuVUtjSmhpN2Z2UXVKYlk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Ethereum research explores zk-based privacy for mainnet - Blockworks",
        "content": "New research into the Ethereum blockchain looks at ways to use zk-SKNARKs (zero-knowledge succinct non-interactive argument of knowledge) to enable private transactions using Solidity, the primary programming language on Ethereum.\n\nThis research is primarily focused on being able to enable privacy-enhancing functionality that is traditionally reserved for layer-2 networks built on top of the Ethereum application layer.\n\nAccording to Mirror Tang, co-founder of Salus Security and author of the research paper, enabling ZK functionality within Solidity may remove the need for layer-2 blockchains, such as zero-knowledge rollups.\n\n“A lot of DeFi activity remains on Ethereum L-1, and less so on L-2s,” Tang told Blockworks. “If we can use computational optimization to enable ZK technology on Solidity, we would be able to reduce gas fees on Ethereum itself significantly.”\n\nThis may allow transaction activity to be concentrated on Ethereum rather than its disparate L-2 ecosystems, Tang explained.\n\nThere are existing technical barriers to introducing zk-SNARKs to Ethereum, however.\n\nFor example, Solidity is currently single-threaded in nature, meaning that it executes one transaction at a time. It will be important, therefore, to find ways to introduce multithreading to Ethereum.\n\nFurther, to enable zk-SNARKs to operate effectively and securely on the network, it will be necessary to ensure it is auditable.\n\nBy nature, ZK technology relies on provers to send accurate proofs to third-party verifiers without revealing the information of the statement, meaning there would be additional storage requirements at the verification stage.\n\nAbsent these barriers, Tang’s research indicates Zk-SNARKs on Solidity could enhance privacy and improve MEV resistance by enabling private transactions and voting on existing Ethereum projects. Fast-tracking the verification process would enhance the performance of the blockchain as a whole.\n\nThis research, if pursued, would be entirely open-source, enabling further development and contribution by the Solidity community, Tang said.\n\nHe hopes that his research will be noticed by venture capitalists in the crypto community so that his team can continue working towards making its findings a reality.\n\nInterview with Tang was conducted in Mandarin. Quotes in this article have been translated from Mandarin to English.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPXy1LTkhvSElwS3FraTVvMURRM0ctSzdLSk9heWlkLWVFOGZuVi1DUV9tTC1ybktsRUlzeGphclFlMGNqQm5HdElGbUF1X0F3T1Jtdl9PYV9ySHhUM3N4OGpuamVFdE41NV9fMjVlbUUtRnVtRXFlZkxpakxMYWlsZGtlZVVyT0w4ckNWZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Solana Overtakes Ethereum By Active Users After 70% Spike - Yahoo Finance",
        "content": "The number of daily active users on Solana overtook the Ethereum mainnet on Nov. 11 following a sharp uptick in activity.\n\nAccording to data to Artemix, Solana hosted 356,300 unique users on Saturday, surpassing Ethereum’s nearly 330,000 by 10%. The milestone was driven by a sharp uptick in activity on Solana, with the network hosting only 208,000 active addresses on Nov. 7.\n\nFor comparison, Ethereum consistently hosted between 290,000 and 350,000 users daily over the majority of the past three months, with two brief spikes above 400,000 and a surge to more than 1M wallets.\n\nSolana Overtakes Ethereum By Active Users After 70% Spike\n\nThe milestone is the latest sign of Solana’s recovery following last year’s brutal bear and the fallout from the collapse of its major investor, FTX.\n\nThe price of SOL plummeted more than 96% from its November 2021 all-time high of $250 to less than $10 in January, according to CoinGecko. Active addresses on the network shrank 85% from 1.28M in May 2022 to around 200,000 this September, according to The Block.\n\nBut Solana refused to stay down, with the network outperforming the broader markets amid the recent cryptocurrency rally as evidenced by the recent surge in active addresses.\n\nThe price of SOL is up 145% in four weeks, beating out many rival digital assets by at least double. The total value locked in Solana-based DeFi protocols is up 62% over the same period, according to DeFi Llama, while NFT sales volume grew 35% in the past 30 days, according to Crypto Slam.\n\nThe move followed progress towards Solana's firedancer upgrade in the form of a testnet, and dissipating expectations that the FTX bankruptcy estate would soon offload large sums of SOL on the markets.\n\nEthereum’s Layer 2s\n\nWhile some analysts have been quick to pronounce that Solana has flipped Ethereum by active users in response to the recent uptick in activity. However, the Ethereum ecosystem has expanded beyond its base-layer, with the majority of activity now taking place on Layer 2.\n\nAccording to data from Token Terminal, more than 800,000 users were active on the top seven Layer 2 networks over the past day combined. Coupled with the Ethereum mainnet, the data suggests more than 1M wallets were active across the Ethereum ecosystem. However, said data does not account for users operating the same wallet across multiple networks.\n\nAccording to L2beat, Layer 2 networks are driving 80% of activity in Ethereum’s broader ecosystem, which is driving roughly 60 transactions per second.\n\nTo continue reading this as well as other DeFi and Web3 news, visit us at thedefiant.io"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOVGYzbFd5X0k2NkQzck05TlBENkI1aUpQOThUblhuZG9OaFlLSV9aeWNidEQwVnJQSXhEYjh6MU5JS3hWblcxQ25LNWNyVFlHdndRdE5TeWVPQThTNmhHcU5Rdnp0WGx5c3hlNmNoZDFvNktvY25FN2hUdlMya0lMb18xMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "The Rise of Zero-Knowledge Rollups in Ethereum Scaling - hackernoon.com",
        "content": "Zero-knowledge rollups are gaining momentum as the ultimate Ethereum scaling solution.\n\nThis year alone, no less than four major projects based on ZK rollups were launched, and four more are in the works. The technology has proven to be exceptionally fitting for the crypto space, and given the growing enthusiasm from venture capitalists, the ZK trend is here to stay.\n\n\n\n\n\nThis is a comprehensive overview of the current zk rollup landscape and its most prominent projects: zkSync, Starknet, Polygon zkEVM, Linea, and Scroll.\n\n\n\n\n\nBut first: What are zk rollups, and why is everyone so excited about them?\n\nWhat are ZK rollups?\n\nThe ZK FOMO has a good reason behind it.\n\n\n\n\n\nThis method allows executing smart contract computations off the blockchain, rolling them up in batches, and then submitting these batches back to the main chain using zero-knowledge proofs to show that the computations happened within the rules of the EVM. Simply put, zk-rollups allow to outsource computation, all while leveraging the main chain’s decentralization and security.\n\n\n\n\n\nUnlike their closest competitor, optimistic rollups, zk rollups offer quicker transaction finality time and better user privacy. Optimistic roll-ups take an “optimistic” stance, assuming that all layer-2 transactions are valid unless proven otherwise by an honest network validator. If the optimistic rollup batch faces no challenges during the dispute period, the transaction data is successfully added to the Ethereum main chain.\n\n\n\n\n\nIn contrast, ZK rollups count on cryptography: after all, math is always more reliable than humans. However, this comes with its own set of complications, such as high computation costs, as well as a more complex cryptographic and engineering network. Fortunately, the former can be solved with special hardware, such as FPGA or ASIC, and the latter – with quality engineering education, like the one provided by RareSkills.\n\n\n\n\n\nYet, there is another hurdle associated with ZK rollups.\n\nEVM-compatibility vs performance\n\nEthereum was not designed to be ZK-friendly, and there are many parts of its protocol that take a large amount of computation to generate validity proofs. This means that building a functional zkEVM – a replica of the Ethereum Virtual Machine that uses zk-rollups – implies a major trade-off: EVM compatibility vs performance. There is a balance between these two qualities, and different zk rollup-based projects are trying different ways to find the perfect one.\n\n\n\n\n\nVitalik Buterin formulated this dichotomy in 2022, drafting a chart with five types of protocols using zk-proofs, from the most compatible to the most performant.\n\n\n\n\n\nEach approach has its pros and cons, and several major projects are exploring them now.\n\nzkSync Era\n\nAccording to Vitalik’s framework, this protocol corresponds to Type 4: high-language-equivalent.\n\nDeveloped by Matter Labs, zkSync Era went live in March 2023. Its current TPS (transaction per second) stands at 4.75, down from this summer’s 9.9. However, according to the protocol’s documentation, it can offer up to 2,000 TPS at peak load.\n\n\n\n\n\nZkSync uses its LLVM compiler to translate code from Solidity, Vyper, and Yul. A compiler adds a step in the coding process and increases the risks of bugs, but in exchange for this inconvenience, zkSync offers other perks. Not only does its custom VM generate zk-proofs fast, but it also implements native account abstraction, which allows programmable authorizations, enabling a greater diversity of wallet and protocol design.\n\n\n\n\n\nZkSync is among the most developed projects, coming with a Hardhat plugin, Web3 API parity, and a well-functioning L2-L1 messaging infrastructure.\n\n\n\n\n\nThe most popular zk rollup, zkZync Era, processes 22 million monthly transactions (source: L2Beat), ranking second only to Polygon PoS with its 75 million monthly transactions.\n\n\n\n\n\nStarknet\n\nStarknet is a zk-rollup using a slightly different version of the cryptographic proof system. Unlike other popular protocols built on zk-SNARKs (zero-knowledge succinct non-interactive argument of knowledge), it uses zk-STARKS (zero-knowledge scalable transparent argument of knowledge). The main difference between the two is that the former uses elliptic curve pairings, while the latter relies on transparent post-quantum algebraic proofs, which generally makes zk-STARKs more efficient but also more computationally demanding. Zk-SNARKS are also being criticized for the trusted setup they require for the initial creation of keys. If the secret used to create the keys is not destroyed, this may introduce a security threat.\n\n\n\n\n\nZK-STARKs were discovered several years after ak-SNARKs, which were already used in the Zcash protocol. Hence, zk-SNARKs are considered more developed as a technology, with extensive developer libraries and numerous projects working on them. Starknet is a notable exception, adopting STARKs as a base for its protocol. The project also puts emphasis on Layer-3 development, providing a set of tools that can help build customizable “App Chains.”\n\nStarknet Alpha went live in November 2022 and has since developed an important ecosystem, handling 13 million monthly transactions.\n\n\n\n\n\nWith Warp, a compiler from Solidity to its language Cairo, Starknet can also be considered as a Type 4 zkEVM.\n\nPolygon zkEVM\n\nThe famous Ethereum sidechain joined the zk race by releasing in March its own version of zkEVM as a separate blockchain (so far in Beta). It will be a part of Polygon 2.0, an ambitious vision of a network of zk-powered layer-2 chains unified via a novel cross-chain protocol.\n\n\n\n\n\nZkProver, Polygon zkEVM’s main component, follows the state machine model, which uses both STARK and SNARK methods. STARK is used to prove the transactions, and then a SNARK circuit is used to verify it, de facto submitting to Ethereum a proof of a proof. To achieve full compatibility, the Polygon team has come up with the concept of micro opcodes, or instructions that EVM will use to manipulate inputs.\n\n\n\n\n\nCurrently, Polygon zkEVM is a Type 3 (almost EVM-equivalent), which will turn into Type 2 (fully EVM-equivalent) when all pre-compiled contracts are supported. It processes 1.1 million monthly transactions.\n\nLinea\n\nThis zk-proof solution was developed by none other than Consensys, the Godfather of all things Ethereum. Released in March 2023, Linea (Type 3 aiming for Type 2) strikes its own balance of speed and EVM compatibility.\n\n\n\n\n\nLinea uses lattice-based cryptography, known to be quantum-resistant, to efficiently generate zero-knowledge proofs, making for a faster prover time.\n\n\n\n\n\nLinea aims for a full equivalence with Ethereum. It is able to execute an unaltered, native bytecode in accordance with the EVM specifications, thus reducing the risk of bugs and hacks. Developers can deploy and verify any smart contract with Truffle, Hardhat, or Foundry exactly as if they were building on Layer 1. Linea’s developer-friendliness is enhanced by the native integrations of Consensys tools, such as MetaMask and Infura.\n\n\n\n\n\nWith Alpha mainnet launched in August, Linea now handles 3.5 million monthly transactions.\n\nScroll\n\nThe most recent protocol to go live, Scroll, launched its mainnet in October 2023.\n\nThe project aims at fully mapping the Ethereum opcode to the zkEVM, which would allow Ethereum native smart contracts to be fully executed without modifying the bytecode. Currently, Scroll is still a Type 3 but aims to become Type 2.\n\n\n\n\n\nLaunched with a centralized sequencer and a centralized central approver, Scroll intends to decentralize over time.\n\n\n\n\n\nSeveral other projects based on zk-proof are still in the works. This includes Taiko, a rare Type 1 (fully Ethereum-equivalent) rollup, as well as projects based on the Polygon’s codebase, such as Immutable zkEVM, Canto, and Astar zkEVM."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPaXowekpvdEV3R1l3UXNVR2tNamt0TElhdDJuOUF3RjlxU0ZtQ0xxTzVyYm02eUJvcHJKeGxSQThNRU14X2I4cmVuaWd3STNqNjhzVnRSckRnbjZGMk9zOFJsZHFEWEU5UFI0dmZIaVpudm14M25manFfYm5tdU9IUGp1anl2bEF4UkNvNkVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum and Solana lead DeFi surge as TVL and DEX activity soar - CryptoSlate",
        "content": "The DeFi sector has experienced a significant increase in both activity and token prices, primarily driven by Bitcoin’s October rally. Central to understanding this landscape is the concept of Total Value Locked (TVL) and decentralized exchange (DEX) volumes, two critical metrics that offer insights into the health and trajectory of DeFi protocols.\n\nTVL, the aggregate value of assets deposited in DeFi protocols, serves as a barometer for sector health and investor sentiment. CryptoSlate analysis found an interesting growth pattern across various chains. Ethereum, the frontrunner with $25.336 billion in TVL, has seen a 31.14% increase over the past month, cementing its dominant position in the DeFi space. Solana, though lower in overall TVL, showed the highest growth rate at 89.31%. Notably, all chains recorded positive growth over the month, indicating a robust expansion across the sector.\n\nThe number of active users on these chains offers additional insights. Despite its lower TVL, Tron boasts a significantly larger active user base of 1.69 million, which could result from a more retail-oriented user landscape. Conversely, Ethereum’s lower active user count than its TVL might indicate a higher engagement of institutional or sophisticated, high-net-worth investors.\n\nThe market cap to TVL ratio is another critical metric, shedding light on the market’s perception of a chain’s value. Ethereum’s ratio of 9.72 suggests a mature market. In contrast, Solana’s higher ratio of 43.49 indicates either potential growth opportunities or an undervalued ecosystem, warranting closer investor scrutiny.\n\nName Protocols Active Users 1D Change 7D Change 1M Change TVL Stablecoins 24h Volume 24h Fees Market Cap to TVL ratio 1.Ethereum 946 304,493 -0.12% +6.50% +31.14% $25.473b $64.929b $1.718b $7.27m 9.63 2.Tron 26 1.69m -1.34% +5.04% +25.14% $8.291b $47.455b $11.33m $1.66m 1.13 3. BSC 663 945,060 +0.22% +1.70% +12.58% $2.996b $4.992b $429.32m $348,294 12.62 4.Arbitrum 481 133,870 -0.38% +10.90% +25.21% $2.095b $1.844b $925.94m 0.66 5.Polygon 488 +1.28% +8.10% +21.93% $852.6m $1.17b $369m $87,858 10.06 6.Optimism 197 91,508 -0.12% +11.94% +25.87% $739.39m $576.85m $109.27m 2.11 7.Avalanche 344 33,880 -1.04% +12.63% +28.18% $615.82m $1.07b $140.2m $36,244 9.73 8.Solana 115 -1.55% +23.58% +89.31% $530.8m $1.513b $425.62m $108,773 42.62\n\nTable showing the TVL, active users, volume, and market cap to TVL ratio for the 8 largest L1 chains on Nov. 14, 2023 (Source: DeFi Llama)\n\nDEX volumes provide a lens into the trading activity within these ecosystems. Ethereum leads with a 24-hour volume of $1.718 billion, accounting for a substantial portion of the total market. The rapid growth in DEX volumes on platforms like Solana and Polygon, with increases of 81.35% and 86.32%, respectively, reflects growing user adoption and confidence.\n\nName Weekly change Volume (24h) Volume (7d) TVL % of total Cumulative volume 1. Ethereum +27.29% $1.718b $10.65b 5.941b 37.12% $1.888t 2. Arbitrum +58.15% $925.94m $4.415b 1.127b 20.00% $138.902b 3. BSC +7.54% $429.32m $2.752b 1.577b 9.27% $757.4b 4. Solana +81.35% $425.62m $2.571b 185.78m 9.19% $54.616b 5. Polygon +86.32% $369m $1.711b 0 7.97% $101.421b Table showing trading volumes and total value locked for decentralized exchanges (DEXs) across the five largest L1 chains on Nov. 14, 2023 (Source: DeFi Llama)\n\nThe observed trends in TVL, active users, and DEX volumes show a market booming with activity. Ethereum continues to lead, both in terms of TVL and DEX volume, signaling strong investor confidence and market dominance.\n\nHowever, the rapid growth of newer platforms like Solana and Polygon suggests a diversifying landscape, with different chains catering to varied user needs and investment profiles. The market cap to TVL ratios further confirms the growth potential of lower market cap chains, with Solana and Polygon positioning themselves for future growth.\n\nMentioned in this article"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPVXRBaXZ1SFEwbWZqaHU5YXhTVWxZWXJ4blE5WGYza0F4TGh1YTVxS3NKUU9EdGRRUjd2c1RKb2pwVDJLZ2stSUtua28ydFhjTHUyLW5pMURYT0NHMktSS29ZZmFyeXB6Sl9CN3JPaVNPRkI4Q2hROFI5dVJ4ZzJQYkxOaUJ5WGQ4NThlb2lkTnVfYjcxUk00WWRCc3NmeWpLczB4RTRTSDMtOVRt0gGyAUFVX3lxTFA1NWJ1eVljVHBWZ1VyZGkxWUpKdjh5QnhXWnFjazVBQzd3aV9CeG02WDI1VGtpTF9TRlVjSTQ2MklTUXJfLTdhd2VrMFFtOXlrWFB5UXZESUlfVkhVM0lmaWktcndta1VSdzVrT1VYRGRodWxnemZCc0ZhYURHNUp1ZURXVzJmMkk0X2I4N2hyU2JvX2ZTQ3Y1OVBaLXpZVUFMcHo0bUJKNTZzcXYzSEVfdWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Ethereum feature abused to steal $60 million from 99K victims - BleepingComputer",
        "content": "Malicious actors have been abusing Ethereum's 'Create2' function to bypass wallet security alerts and poison cryptocurrency addresses, which led to stealing $60,000,000 worth of cryptocurrency from 99,000 people in six months.\n\nThis is reported by Web3 anti-scam specialists at 'Scam Sniffer,' who observed several cases of in-the-wild exploitation of the function, in some cases losses incurred by one individual reaching up to $1.6 million.\n\nLegitimate function\n\nCreate2 is an opcode in Ethereum, introduced in the 'Constantinople' upgrade, that allows creating smart contracts on the blockchain.\n\nUnlike the original Create opcode, which generated new addresses based on the creator's address and nonce, Create2 allows calculating addresses before the deployment of the contract.\n\nIt's a powerful tool for Ethereum developers, enabling advanced and flexible contract interactions, parameter-based contract address pre-calculation, deployment flexibility, suitability for off-chain transactions and certain dApps.\n\nCreate2 introduced significant benefits, but several security implications and new attack vectors also came along with them.\n\nCreate2 opcode abuse\n\nScam Sniffer's report explains that Create2 can be abused to generate fresh contract addresses with no history of malicious/reported transactions, hence bypassing wallet security alerts.\n\nWhen a victim signs a malicious transaction, the attacker deploys a contract at the pre-calculated address and transfers the victim's assets to it, a non-reversible process.\n\nIn a recent case analysts observed, a victim lost $927,000 worth of GMX after they were tricked into signing a transfer contract that sent the assets to a pre-computed address.\n\nThe smart contract used in the attack (Scam Sniffer)\n\nThe second type of Create2 abuse is generating addresses similar to legitimate ones owned by the recipient, thus tricking users into sending assets to the threat actors, thinking they're sending it to a known address.\n\nThe scheme, which is named 'address poisoning,' involves generating a large number of addresses and then picking those that match their specific phishing needs each time to trick their targets.\n\nSince August 2023, Scam Sniffer has recorded 11 victims losing nearly $3 million, with one of them transferring $1.6 million to an address resembling one they had sent money to recently.\n\nMost of these attacks went under the radar, silently siphoning millions, but some have caught the attention of the community.\n\nAt the beginning of the year, MetaMask warned about scammers using freshly-generated addresses that match those used by the victim in recent transactions.\n\nIn the scam, the threat actor may also send the victim a small amount in crypto to register the address in the wallet's history, thus increasing the chances of the victim making the payment.\n\nIn early August 2023, a Binance operator mistakenly sent $20 million to scammers who employed the 'address poisoning' trick but noticed the error quickly and froze the recipient's address.\n\nNotably, using lookalike cryptocurrency addresses is a trick seen in clipboard-hijacking malware tools, like the Laplas Clipper, highlighting the method's effectiveness.\n\nWhen performing cryptocurrency transactions, it is always recommended to check the recipient's address thoroughly, and not just the first and last three-four characters, before approving it."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOVHE3VDZXNzZvXzJTSlE0M0hhRk5uZEZmVE5rNnJOMDY5Q0NVRGVaUXJtYllSQy1ySTNVb1JGVHhJUEZiaUhVdXhaZXZhRzFrMGJERkVsTXJ6ejc3UFpIeWVkTG9kLXdUbkIyMkdEVVdCWVlfb2hGT0tQSXpzaFFiM2NqUGl2dDlLN3g4SVFFRGlsd2I4OWdMUXhZaHN1M25EYWdHLUk1Tk05REFuX213?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Watch SkyBridge's Scaramucci Says Bitcoin, Ethereum Prices to Trend Higher - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQdTNoZEtqbjB3d3VTTnZCZHJPcElCaFAzaERubVN1bHpxd05UenVCZzREMVVDLW9BbUZmcFpRSi1EaXdTSHVNNHlnZndvWXFvd0JRTHg1S09VaUVleDVZQzV4QU5IY3ZWSlJOajkzUHhrc09qT01fVDNfaXA5RERueUp2aU9GN2tuTzhncUZ4YUFMOHI2X0p2TDQtTFVQT3BhNFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum hacked to steal millions from users across the world - TechRadar",
        "content": "Hackers have been observed abusing a feature in the Ethereum blockchain to trick victims into sending money.\n\nIn the last six months, the criminals were able to trick almost 100,000 people into giving away a total of $60 million, according to a new report from Scam Sniffer.\n\nAs per the report, the hackers used a function called Create2, an opcode that allows users to predict the address of a contract before it is deployed on the Ethereum network. In other words, hackers can create temporary addresses for each individual transaction - addresses that greatly resemble the ones where the victims intended to send the funds. The scheme is dubbed “address poisoning”.\n\nReader Offer: $50 Amazon gift card with demo\n\nPerimeter 81's Malware Protection intercepts threats at the delivery stage to prevent known malware, polymorphic attacks, zero-day exploits, and more. Let your people use the web freely without risking data and network security. Preferred partner (What does this mean?)\n\nBypassing security\n\nMost users, before sending any funds, do two things: 1) they double-check the recipient’s address to make sure they’re sending the money to the right place; 2) they send a small transaction first to make sure everything works, before sending the remaining funds. However, as the addresses are a long string of seemingly random characters, most users just cross-check the first and last few characters, instead of comparing the entire strings.\n\nBy creating an address that differs in just a few characters, the attackers can trick people into thinking the address is valid, before sending the funds. That, however, still leaves the second failsafe - the test transaction. Criminals are working around this by forwarding the test transaction to the actual address.\n\nThe lookalike addresses don’t belong directly to a wallet controlled by the attackers, but are rather a smart contract that then transfers the funds to the final destination. The researchers said they observed multiple cases of fraud leveraging Create2, with one victim losing up to $1.6 million.\n\nUsers are advised to thoroughly check the entire address before sending the funds, and not just first and last characters.\n\nAre you a pro? Subscribe to our newsletter Sign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nVia BleepingComputer"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9rQVBzZExCZGhLTkNnQ2FReFY1Wno5SndKeUJ0ZVhnVjRWeHN6ZThLZG5saWctVDJrMFh5S3hNdEdYOG5xM0Q0X1RjaUs1LVhwQ0NYSF9fUVpZSzZtSVh6S2xlNkRnMnFqdjBtTzE2QmktSWhjaEREb2RPMF9qUdIBhgFBVV95cUxOQWt5d2VKdnJKR3lRZXZOcDVFWXU3eVUxdVA1WTctdkpUTFJHOEFseHI1eVY1c2lJLXlCeGZyYnpfNllKdE9WUjBQV1Q5X2FsUU5qclozNFg0SzhuM0QxU2ZqclMtQkFIckpvNVpuVUJzT0NDWUNHTXpaX1J3VTM5SVBKc3BUZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Solana Rally Cools as Bitcoin and Ethereum Hold Steady and These Alts Surge - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter a stunning climb last week, Solana (SOL) has cooled its rally and is now down over the past 24 hours.\n\nSolana, the seventh biggest cryptocurrency by market cap, is down nearly 5% in the past day, trading hands for $55.39, CoinGecko data shows.\n\nLast week, the Ethereum-competitor had experienced a surge in price unlike any other coin or token over a month period. Its price notably soared past $50 for the first time since May 2022. The boom was likely down to a short squeeze caused by short sellers exiting their positions and renewed interest from institutions, experts said.\n\nBut despite the cool off today, Solana is up nearly 40% over the last seven days.\n\nAD\n\nAD\n\nBitcoin, the biggest cryptocurrency by market cap, is down 1% today Monday morning Eastern Time and is trading for $36,839. While the second-biggest digital asset Ethereum (ETH) is up nearly 2% and trading for $2,096.\n\nLast week Ethereum got a big boost past $2,000 for the first time in some months on the news that BlackRock had filed an application to list an iShares Ethereum Trust.\n\nMeanwhile, a number of Solana's altcoin rivals are experiencing gains today.\n\nLeading the charge out of the major coins and tokens is decentralized storage provider Filecoin's native token FIL, which is up nearly 10% in 24 hours and priced in at $5.33, according to CoinGecko. Over the past seven days, it has shot up in value by 23%.\n\nAD\n\nAD\n\nProtocol Labs, the company behind Filecoin, is this week hosting a its LabWeek23 event in Istanbul, which might explain the sudden surge.\n\nOf other major players in the crypto market, Polygon (MATIC) is also up significantly today: the 13th biggest digital asset by market cap has surged more than 6% in the past day and is now trading for $0.88.\n\nAnd Cosmos (ATOM), a project which aims to create an \"Internet of Blockchains\" by improving interoperability, has also shot up by more than 9%; it's right now priced at $9.90.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxOZGJINm9DTkVLVmk0SVVHb20zcktaUFVVTzQwSHREVEdYVW9IUWJPNWZIM0QtSktlbXdpQm96UWxOcWR4ZjhVQ1dvcnlXNjdIN1UyRUtkdFhqVlNtS0JiNGR1Y1VZLUVsSV9vU1NjM0R1QTJjRTNucDZ6THIwNG5MWFhrS1RwbW1BX1RSX0h5UFZTZ0NMQzhRY3p1WWVFMGkxdEpnX2FjTWdlcWUyR1p5S2lMdTgxUlhEOU9OX2pUU1lDMjZnYW1GdzJ3VncyUW5Rc3JDbGQ3THpvaW9venBfclJmQ2Q?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Andrei Jikh Decodes BlackRock's Proposed Spot Bitcoin and Ethereum ETFs - CryptoGlobe",
        "content": "Andrei Jikh, a renowned personal finance expert, recently released a video to his 2.3 million YouTube subscribers, explaining the intricacies of BlackRock’s proposed spot Bitcoin and Ethereum ETFs. Jikh’s analysis provides a comprehensive understanding of these financial instruments and their potential impact on the cryptocurrency market.\n\nJikh has established himself as a prominent educator in finance, primarily through his YouTube channel. Here, he explores topics such as personal finance, investment strategies, and digital currencies. He is known for his clear and direct method of breaking down complex financial topics, often using visual aids and real-life examples to make the information more accessible to his audience. His channel covers a wide range of subjects, from insights into the stock market to discussions about cryptocurrencies and advice on personal financial management.\n\nPrior to his career as a content creator, Jikh worked professionally in the finance industry. His approach to education is praised for its appeal to a varied audience, accommodating both beginners and those with a deeper understanding of finance. The content he creates is deeply influenced by his own financial experiences and thorough research.\n\nAccording to Jikh, BlackRock, the world’s largest asset manager, has filed with NASDAQ to launch a spot Ethereum ETF. He says that this move, coupled with a proposed Bitcoin ETF, signifies BlackRock’s confidence in the cryptocurrency market. Jikh notes that BlackRock’s track record in ETF approvals is impressive, with only one denial out of 575 filings.\n\nJikh mentions that the Securities and Exchange Commission (SEC) is expected to make a decision on these ETFs by January 2024 and that BlackRock’s history suggests a strong possibility of approval.\n\nJikh explains that an Exchange-Traded Fund (ETF) pools money to replicate the price growth of its target asset. He highlights iShares, a BlackRock subsidiary, as a key player in managing diverse ETFs, including those tracking major indexes and bonds.\n\nFor the Ethereum spot ETF, Coinbase will serve as the custodian, safeguarding the assets, a significant portion of which will be in cold storage, Jikh points out. He clarifies that investors in these ETFs won’t be able to convert their holdings into Ethereum or withdraw them.\n\nJikh emphasizes the importance of Net Asset Value (NAV) in ETF valuation. He speculates that if BlackRock purchases Ethereum to back the ETF, it could potentially increase Ethereum’s price due to heightened demand.\n\nWhile the exact expense ratio for the Ethereum ETF is not specified, Jikh anticipates it to be between 1-2%. Although this rate is higher than average, Jikh says that it is understandable given the early stage of such ETFs in the crypto market.\n\nJikh underscores that ETFs offer protection against fraud and bankruptcy, ensuring security for investors. Additionally, he points out that investments in these ETFs are covered by SIPC insurance, providing a safety net of up to $500,000.\n\nJikh also touches on global trends, mentioning UBS’s allowance for wealthy Hong Kong clients to invest in Bitcoin through an ETF."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOdHJmQ0w1T3ZGUkRtYzdHQ21oTHpkQzhVS1dGVEtqNHQ2TXpPYzdIUFFqakIxdll4cWh3aDJPVUNmS2lxLWRCbWR6TnE2WjVWcFVsakFKS2x4ZTBUX2JVRGo0NzQ1cWk1aEllTnZaUC1hQThRSnl2Si1LYmJCUVJubHV5Mk5Ya3RLMDNV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Fund Inflows Hit 2022 High on ETF Listing Request - Crypto Briefing",
        "content": "Crypto funds surpassed $1 billion in inflows this year.\n\nShare this article\n\nFund inflows into Ethereum investment products hit their highest level since August 2022 last week, according to digital asset manager CoinShares. The spike comes as investors anticipate the potential approval of a physically-backed Ethereum exchange-traded fund (ETF) in the US.\n\n“Ethereum, saw its largest inflows since August 2022 of US$49m, with the last 2 weeks signifying a real turnaround in sentiment, likely related to the recent spot-based ETF listing request,” said James Butterfill, Head of Research at CoinShares.\n\nThe asset manager said the flows indicate a distinct turnaround in investor sentiment, likely fueled by BlackRock’s move to file for an Ethereum spot ETF last week.\n\nOverall, digital asset funds saw $293 million in inflows last week across crypto products, marking the seventh consecutive week of inflows. Bitcoin products attracted $240 million, bringing their year-to-date inflows to over $1 billion.\n\nExchange-traded product (ETP) trading volumes have also increased, making up nearly 20% of total Bitcoin volumes on trusted exchanges and suggesting more ETP investor participation compared to the 2020 and 2021 rallies.\n\nThe streak of inflows has pushed total assets under management in crypto investment products to $44.3 billion, a 99% increase since the start of 2023.\n\nBlockchain equity ETFs also saw their highest inflows since July 2022 at $14 million. Their year-to-date flows have now turned positive at $11 million after substantial outflows for most of 2022.\n\nETH is up 1.7% over the past 24 hours, according to CoinGecko."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQTkEwTWJhVXEwZW9CY0VUUnlVaV9MUVEzTlE1NF9YdmFWdzlOUXpMVTM2djVROUVYbHZNMW5ELUk3QXdZZ3RqZWlRZ1pUeGkwR3FwVTBnSUIyU0RkSWczaGlTVS05YVhvcHBIa1JrR3l0bXdEeFdCb0w3NkU2SVBpb2l1eGxON0VBSWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum maintains position above $2k after ETF proposal surge - crypto.news",
        "content": "Ethereum (ETH) has been holding above the $2,000 mark as investment products significantly surged after the exchange-traded fund proposal.\n\nThe largest asset manager with $9.4 trillion of assets under management, BlackRock, registered an iShares ETH Trust on Nov. 9. Since the proposal, Ethereum saw a 9% rise, surpassing the crucial $2,000 mark.\n\nETH price, whale activity, open interest and Binance funding rate – Nov. 14 | Source: Santiment\n\nAccording to data provided by Santiment, following the rise, whale transactions consisting of at least $100,000 worth of ETH surged by 25% over the past 24 hours — hiking from 2,151 to 2,678 transactions over the past day.\n\nYou might also like: NFT market revives as major collections soar in sales and volume\n\nAccording to a crypto.news report on Nov. 13, whales have accumulated over $58 million worth of Aave (AAVE), Ethereum, Arbitrum (ARB), Pepe (PEPE), and a few more altcoins over the past week.\n\nWith the hike in whale activity, data provided by Santiment shows that ETH’s price-daily active addresses (DAA) divergence took a deep dive, declining to negative 45.17%. When the price DAA divergence drops to below zero, the indicator suggests a “sell” signal since large whales might manipulate the market.\n\nOn the other hand, per Santiment, Ethereum’s total open interest (OI) declined from $4.15 billion on Nov. 10 to $3.85 billion at the time of writing.\n\nMoreover, ETH’s Binance funding rate currently stands at 0.02%, suggesting the dominance of short position holders until further movements.\n\nEthereum is up by 0.7% in the past 24 hours and is trading at $2,050 when writing. The asset’s market cap rose to $247.5 billion with a 24-hour trading volume of $13.4 billion."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNM1JoYXdNYTl4R1ZaV3IxdFFkV0huS050eWZwVUVlTmxIa0x4RVVSaV9xS05DTkk3bmg3WVNBZENZbTg5VHl2cUZJX2JmRjh3YmplRlg1a1FWejcyN2R0RldhNXlQYjlxekRuZFNyNU5CRENJSUo0OTlmNVhrbHhVZmlFNlNEeFF2YnRyb2U5UERWM0JfTnRXN2ZLM2tTVzdERXNtZVhITnlhZ1FqbjFJTlBEOUJBVHoxQWJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Solana Hits New Annual High At $58 — Analyst Predicts 'Ethereum Killer' Could Skyrocket To $1,000 - Nasdaq",
        "content": "Solana (CRYPTO: SOL), once called an ‘Ethereum (CRYPTO: ETH) killer' has experienced a remarkable surge in price, surging by 40% in the past week and reaching a new high for the year 2023 at approximately $58.\n\nWhat Happened: Crypto analyst Jacob Canfield has conducted a comprehensive analysis suggesting that Solana could be on the verge of an unprecedented market surge. Canfield suggests that Solana could potentially increase its market dominance to the range of 12-15%.\n\nCanfield’s analysis is based on several indicators. He highlights the Solana Dominance (SOL.D) chart, noting that even at its peak market cap, it didn’t surpass 3%. With the current trends and the breakout of SOLBTC from its weekly resistance, Canfield envisions a scenario where Solana could enter a parabolic rally phase.\n\nIn my opinion, I think that @Solana is going to continue to be one of the biggest movers during this current bull market cycle and I'm going to lay out some ideas for you.It's possible that with the Ethereum ETF news that some of these ideas don't play out, but it's worth… pic.twitter.com/oii8vWs0W9\n\n— Jacob Canfield (@JacobCanfield) November 9, 2023\n\nCanfield suggests that if Solana continues to trend against Bitcoin (CRYPTO: BTC), it could easily reach a price of $1,000 per coin and claim the second spot behind Bitcoin. \"Solana could triple or quadruple it's all time high market dominance around 12-15% and if it continues to trend against Bitcoin, could easily see a $1,000 per coin and take the #2 spot behind Bitcoin,\" the analyst said.\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nWhy It Matters: Solana’s gains have been fueled by various factors, including the broader uptrend in the cryptocurrency market and the excitement surrounding Bitcoin ETFs, as well as an increasing appetite for risk among investors.\n\nInterestingly, Solana’s upward trajectory coincides with the daily selling of 250,000 to 750,000 SOL tokens by the FTX bankruptcy estate over the past two weeks. These sales follow the approval by the Delaware Bankruptcy Court in September 2023 to sell 55.75 million SOL tokens.\n\nImage Via Shutterstock\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE16MTBGU0ROOUV4c0V3ZTlsal94dWRvQTdIQm04TWVFOVZ3SkNKZ0t6VFVLa3IySWcxOU5ic3MzVG90VmN2Z0dtOHk4U2YycmVtcEljOW9obXdxQW5XYnhReVE5ZUxPQnd3eTdaSkFnbk9pQdIBekFVX3lxTE5sRFVxYnV4ZFNtYUdLNTBVZlZ6YjV0TkhRX29TVnNTVkE4RmhRU3c5UE1LRWxKTGdYV1BSMDZCRWJFNTMtYlVUM3JtMEZNek51dmdaSi0wUjRFMlRRZmpTRWtldXJKRVY3V0xLenJNN3NuTzVycUtNcTBB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Lag While DeFi Tokens dYdX and Maker See Gains - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA number of decentralized finance (DeFi) assets surged on Tuesday while major cryptocurrencies—including Bitcoin and Ethereum—experienced losses.\n\nDecentralized lender dYdX, which runs on Ethereum, was at the time of writing trading for $3.34, having gained nearly 7% in 24 hours. Over the week, the protocol's native token, ETHDYDX, had boomed by 42%, CoinGecko data showed.\n\nElsewhere, Maker (MKR) also experienced a surge: at the time of writing, it was only up over 1%, trading for $1,366, but had shot up earlier on Tuesday morning Eastern Time to a high of $1,423.\n\nAnd decentralized exchange PancakeSwap (CAKE) was also up nearly 3%, coming in at a price of $2.24.\n\nAD\n\nAD\n\nDeFi refers to the projects in the cryptocurrency space which want to replace traditional financial services, such as borrowing, lending or banking.\n\nSuch projects are new, experimental and prone to hacks—which means respective coins and tokens are volatile.\n\nBitcoin, the largest digital asset by market cap, had lost more than 2% of its value by the time this story was published, and was trading hands for $36,049.\n\nAnd Ethereum, which last week pushed past $2,000, was down nearly 3%. It is priced at $2,041 per coin.\n\nAD\n\nAD\n\nLast week ETH saw major gains on news that BlackRock Advisors, a division of the Wall Street titan, was preparing to file an application for an Ethereum ETF. The iShares Ethereum Trust application is BlackRock's first official application for an Ethereum ETF.\n\nWithin 24 hours after the filing of the iShares Ethereum Trust application, the price of Ethereum crossed the $2,000 mark, a level it had not seen since July 2023. The price of Ethereum experienced a substantial increase, with gains reported at over 8%. Moreover, the trading volume surged by 259%, indicating a significant rise in market activity.\n\nConcurrently, the market capitalization of Ethereum increased by a little more than 10%—reflecting a marked growth in investor confidence and market valuation following the news of the filing.\n\nElsewhere, major coins and tokens were having a rough morning. Solana (SOL), which last week blew up in value, was trading little over $56 per coin, up less than 1%. Even when ETF optimism cooled for Bitcoin and Ethereum, Solana has held onto its gains.\n\nSOL has surged nearly 160% over 30 days. For a few days, it briefly overtook the market capitalization of major stablecoin USDC. But it has since dropped below it again. As of this writing, SOL has a market cap of $23.8 billion and USDC has a market cap of $23.9 billion.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOaE4wZ1N5ck1uaS1QOTRMQzZEVDRvS1Z4Tkw4VjVvQ2tKSVR5UU16MXdqcEZGLWJtMkxtVHVpbGNWejNvaEltR1NBQXc1aTNTVlZTVks0WHBjRXUxN3l6cjd5bXFFdUxhUjVPTVZtQXJDVElJLUZxdVI2RGh5YXl4YkN2UVNwbkJtalIxTHEtSEdObTVDYWV6TEhYT29DZTjSAacBQVVfeXFMTjBtekZNazVEVkFzdjFra3hHVVRrQ1BNa3dmMnlpX09FSzJDNVRhaC1SbS0wUjBIR0NzNUNKTGo2V0Q5OGJPRGlPemZGNVlIdTBYYl94SnM1b3RBTHk3TUNMT0gxZEFwUm1jbmhxaEtyYXMzMXhYOW9vTE9mdUFJdE9ZNzhMQUg3NmNmZ2lqZnNiVUEtSEc5Y2NaUFBRREcxQzVocDRpVzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Former Polygon Labs President Ryan Wyatt Joins Ethereum Layer-2 Optimism - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFour months after departing Polygon Labs, Ryan Wyatt is joining the team supporting a totally different Ethereum scaling network: Optimism.\n\nOn Monday, the former Polygon Labs president was announced as the Chief Growth Officer for Optimism Unlimited, a newly created subsidiary of the Optimism Foundation. Wyatt will build a team to support adoption and development on Optimism across a variety of functions, including business development, marketing, partnerships, and beyond.\n\nAhead of the announcement, Wyatt described Optimism to Decrypt as having the “best team in all of crypto.”\n\n“They've really shown what they can do in the last 12 months, particularly, from both the tech perspective as well as people buying into Optimism and the ethos,” he continued. “I just think there's an opportunity to really ramp up the non-technical efforts of the Optimism Collective. That's what I'm good at and that's what I like doing.”\n\nAD\n\nAD\n\nWyatt was with Polygon Labs from February 2022 until this past July, when the company announced that he was stepping down. Marc Boiron, previously Polygon Labs’ Chief Legal Officer, stepped into a new CEO role to lead the firm as Wyatt departed. Wyatt said at the time that he planned to stay in the crypto industry.\n\nAsked why he wanted to leave Polygon Labs and take on a new challenge elsewhere in the space, Wyatt told Decrypt that his move was “less about leaving Polygon” and more about taking on a new challenge to grow a decentralized network that’s still relatively young.\n\n“There's really a special moment in time where you get to build out a team, build out a community, stand it up, and then turn the keys over to the world. And that is a moment in time that's happening now,” he said. “I want, on a personal level, to be really impactful during that time, and I think there's a huge opportunity to do it at Optimism.”\n\nJing Wang, co-founder of Optimism, told Decrypt that current adoption on the network has been supported by a two-person business development team. She believes that Wyatt’s addition, and his plans to ramp up those efforts, will make a considerable impact.\n\nAD\n\nAD\n\n“I think Ryan can 100x adoption for us,” said Wang. “That's what I'm most excited about.”\n\nAt Polygon Labs, Wyatt was credited with helping to court a number of prominent brands to build on the Ethereum scaling network, including Starbucks, Nike, and Reddit. Decrypt named Polygon its 2022 project of the year based in part on the significant mainstream brand adoption that took place during that span.\n\nAsked if he will approach business development and brand adoption for Optimism like he did with Polygon, Wyatt said that some of the same tactics will come into play. However, he said that given Optimism’s focus on decentralization, he plans to help encourage growth across communities rather than assemble a large, central team to try and drive adoption.\n\n“Optimism is so focused and so far ahead on the decentralization front,” he said. “And so there's a unique opportunity to leverage and rally around the community to be able to amplify our efforts.”\n\nOptimism’s OP Stack tech is already driving other networks, most notably Base, the Ethereum layer-2 network incubated by Coinbase and launched earlier this year. Base, which houses the buzzy social app Friend.tech and other applications, shows the kind of path forward that Wyatt hopes to see more broadly, with the OP Stack standing up various scaling networks.\n\n“You have Ethereum here; we want the bedrock of all the blockchains to be built on Optimism,” said Wyatt. “And that's where I think it's going, and that's where it's certainly going fast\n\nWyatt comes from a gaming and esports background, and led YouTube Gaming for several years before joining Polygon Labs. Before that, he was an esports commentator and industry executive. Wyatt said that gaming will be a significant focus for him at Optimism as he tries to drive forward adoption around digital item ownership.\n\n“I truly believe that digital ownership in a certain subset of games is going to be really important,” said Wyatt, affirming previous comments during his time at Polygon Labs. “Gaming will be very important for Optimism, and we're going to do a bunch of cool shit in gaming.”\n\nAD\n\nAD\n\n“That’s why it’s called the OP Stack,” added Wang, citing the gaming term “OP” or “overpowered.”"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxONFpHVThiUm9jdTlVVkRJc09ZbmY4NkJYajR5ZFJDX3Z6Y2NKQzlaZUJvOW4xUFN6ZHl3eGVUOWRvb0NLZW9IRnFlZWg3b3J5U0Vsa3dzR1JIZVIyTzBtZk5EZjByLXJic0t1UmhQNXJsZVBQTXRyUlN6dTdKNHROX2dZYnZmYnZZODlYaV9nMHIyZXJDVEJfN2x30gGfAUFVX3lxTE9oQkdoY3FPMElCVERwQm9SN2ZHN1VkS3JLNFBkb3BxT0ZvYU9odHpQTnRqVGx4eUZ3bzd6ZkltajlnVVA5UnRZV0E0Y0JKelE3ei05dnpPU0Z4X2pPN3JZTkZvSTByM0FkMUNxczgzMjNfNU9NUDBjNENYa1ZkSmVXbEhPcGRIOXRmQkZYdmpKUllfTGdSMFVMYUlLTDEtSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Wallet Drainer Steals $60M in Six Months - CoinDesk",
        "content": "The wallet drainers are misusing Create2, a piece of code that is used by the likes of Uniswap to predict the address of a contract before it is deployed on the Ethereum network."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5FR2V1YzBlempMQThNS0JiY28xYTZ1SUtyb0lCTmNlaWwwMVlNWnNXdkhBaEEtUnB4VnJqU0JxUk9sU2lmYjFDQWtwVmsyMkFIakF4dGYzdEUzdDFrN0VVRHV6RnA2clMzbXlTVzBYdUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "BlackRock's Ethereum Spot ETF: What Does It Mean for Investors? - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQdWdFa1Z6NEZQN1RXY1hFZ1Z5cWJaVUo1TFhmVkd6VmF0dUpqLUxnS1ZaT3ZkZUVfa0dBN2hxTEo5VEtfa21oZmdNcUZqMnpYTmJfM2ZpRThMYlQ1QWVVc2ZzalZzRDhwSVFrWUYycVg0VzVSSFhCbFpVM3lhSXI2bU5iTFVNdUtBaWlPa3VuNkVRYnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Tokenum Unveils Innovative Gasless Platform for the Ethereum Blockchain - A Game-Changer for the World of Cryptocurrency - Yahoo Finance",
        "content": "Tokenum\n\nTOKYO, JAPAN, Nov. 13, 2023 (GLOBE NEWSWIRE) --\n\nTokenum, a pioneering cryptocurrency platform, is proud to introduce its groundbreaking \"gasless technology.\" This revolutionary innovation simplifies cryptocurrency transactions and token offerings on the Ethereum blockchain, ushering in a new era of user-friendly accessibility.\n\nThe platform has already embarked on alpha testing, with an accelerated beta version scheduled for release within a week.\n\nRevolutionary Technology\n\nTokenum's gasless technology marks a significant advancement in the cryptocurrency landscape for several compelling reasons.\n\n1) Innovative Gas-free Transactions\n\nIn traditional banking, transaction fees are paid using the same currency that is being transacted. However, in the world of cryptocurrency, fees are often paid in another, blockchain-specific digital currencies. Such fees are referred to as \"gas.\" Tokenum's gasless technology eliminates the need for users to grapple with this complex concept, making cryptocurrency more accessible to a broader audience.\n\n2) Supercharged Token Sales\n\nNew cryptocurrency projects face various challenges, including scheduling, legal compliance, compatible wallets, and sale regulations. Additionally, for users to participate in project sales, users must first acquire specific coins to cover blockchain gas fees. Tokenum's gasless technology simplifies this process, making it easier for crypto projects to attract users and maximize revenue from each sale.\n\n3) NFT Industry Transformation\n\nTokenum's gasless technology presents an opportunity to reshape the NFT industry. NFT creators and owners can now prepay for NFT transfers, removing the burden of gas payments for users. This opens the door to entirely new audiences and streamlines the process, making it as effortless as managing digital art on Instagram or Pinterest.\n\n4) Removal of Entry Barriers for New Ecosystems\n\nTokenum also benefits new blockchains by allowing users to leverage the tokens they already have, eliminating the need to acquire blockchain-specialized coins for different networks and ecosystems. This significantly simplifies the sophisticated process of navigating and using new blockchains, platforms, or even metaverses.\n\nAll Gas No Brakes and Light-Years Ahead\n\nOne of the most notable aspects of Tokenum is its current full-fledged operational status. While other industry players, such as Circle Inc., Auros, 0xGasless, Open Zeppelin, and more, are still in the developmental stages, Tokenum is live and fully functional on the Ethereum network. The platform's future plans include expanding its support to encompass additional networks.\n\nStory continues\n\nThe AI-Powered CEO Behind Tokenum\n\nTokenum's powerful technology is spearheaded by a distinctive team, represented by Takeshi Tokenai, an AI-powered CEO. Notably, Takeshi was formally appointed as the leader on July 1, 2021, making him the world's first AI CEO. Conversely, Tokenum's technological prowess is underpinned by the collective expertise of its international team, boasting two decades of experience in the realms of cybersecurity, high technology, and blockchain. When asked to share their comments on the matter, Takeshi Tokenai's only statement was: \"Tokenum is here to take the crypto world by storm.\"\n\nWhat Lies Ahead\n\nIn summary, Tokenum's gasless technology is reshaping the cryptocurrency landscape by simplifying transactions, facilitating token sales, and supporting the growth of new blockchains. Now the project is already integrated with CyberWallet, the one of the most secure wallets at the market, and HyperID, the single identity solution. Together, they creates seamless entrance to any web3 project, space or activity for any user, regardless of their crypto skills. Tokenum is poised to become a major player in the future of cryptocurrency.\n\nCurrently, the company is offering giveaways and opportunities on its X channel (formerly Twitter), as well as on Zealy and QuestN, prominent crypto-community platforms. In the cryptocurrency world, such initiatives often signal preparations for rapid expansion and the potential launch of their own token.\n\nFor further updates and insights, please visit Tokenum's official website: https://tokenum.net\n\n\n\nJoin the conversation on Tokenum's X channel (formerly Twitter) by following @tokenum\n\n\n\n\n\n\n\nFor more information, press inquiries, or collaboration opportunities, please contact:\n\nTakeshi Tokenai at info (at) tokenum.net\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, or intended as investment advice, financial advice, or trading advice. It is strongly recommended that you practice due diligence (including consultation with a professional financial advisor) before investing in or trading securities and cryptocurrency.\n\nCONTACT: Takeshi Tokenai info at tokenum.net\n\n\n\n"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOY2ktdjBFRldGSW85aFFkSmFSVWVhM29zT1ZlZHdxLVpzZVUzZkN2R2puY2hpbGI1Q2JTMUVGM1JfVDJac2RQQm1MNnJkYlY5dDdYTnIzQU14UTR3c1NydWZSSE9ucDNSY0Fsem9Yc0poaWwxOU1tZl8xQlRWd1paYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "OKX Unveils New Ethereum L2 Network Powered by Polygon - Crypto Briefing",
        "content": "OKX leverages its 50 million user base to fuel X1 growth.\n\nShare this article\n\nCrypto exchange OKX and blockchain developer Polygon Labs have announced a collaboration to launch a new Ethereum layer 2 network called X1.\n\nThe X1 testnet launched today uses zero-knowledge (ZK) proofs to allow quick and low-cost transactions on a secure network that is compatible with Ethereum.\n\n“X1 will be a key pillar of our efforts to educate and bring our users on-chain and into the world of Web3,” said Jason Lau, OKX’s Chief Innovation Officer. “By collaborating with Polygon Labs, we look to bring more builders, more use cases, and ultimately the mass adoption of Web3.”\n\nOKX’s token OKB will be used to pay gas fees on the X1 network. OKB token is the native utility token of the OKX exchange, used to pay for trading fees on OKX, to participate in OKX’s Jumpstart token launch platform, and to earn rewards on OKX Earn.\n\nThe goal of X1 is to attract developers to build decentralized applications that can leverage OKX’s user base which exceeds 50 million worldwide. As part of the partnership, OKX will contribute engineering resources to enhance Polygon’s Chain Development Kit (CDK), a framework that enables developers to build custom ZK-powered layer 2 blockchains on Ethereum\n\nThe launch of X1 comes as competition heats up among crypto exchanges offering proprietary layer 2 solutions. Coinbase recently launched its Base layer 2 network using Optimism’s technology, while Kraken is exploring building a new scaling solution in collaboration with Polygon.\n\nOKB has remained relatively flat over the last 24 hours, down just 0.3% according to CoinGecko."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNZ1dNLVVtUGpyLWUwWTk3TTA0SnZyTTEzOU1jLWNoV1FVWngzZTQyc0ViR29YRGhaemRZbjJOV0c5eGFuYzJTdnRTVFpzQzBDWWNoQk1veTNsNVE0cFdCYkh1cVNvLTZibm9lUm05QnNwUGtYTEt1clpCd1BibVBSdg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Fees Surge 5x As Network Utility Explodes - TronWeekly",
        "content": "Ethereum, the second-largest cryptocurrency by market capitalization, has seen a significant rise in transaction fees as its price surged back above $2,000 last week. This increase in fees is unsurprising, given the correlation between ETH’s price and network activity. As ETH’s price rises, more users are drawn to the network, leading to increased congestion and higher fees.\n\nHowever, despite the recent rise in fees, ETH transactions are still relatively cheap compared to the peak levels of $14 per transaction we saw in May. The current average fee is around $2, which is still significantly lower than the $14 peak. This suggests that the recent increase in fees is primarily due to increased network activity, rather than a fundamental change in the ETH network’s fee structure.\n\nEthereum Fees Reflect Growing Network Popularity\n\nThe rise in Ethereum fees is a sign of the network’s growing popularity and utility. As more and more people use Ethereum for transactions and other applications, the network is becoming more congested. This congestion is leading to higher fees, but it is also a sign of the network’s success.\n\nThe ETH network is constantly evolving, and there are a number of proposals in the works that could help to reduce transaction fees in the future. These proposals include increasing the block size, implementing sharding, and using a different fee mechanism.\n\nIt is unclear which of these proposals will be implemented, but there is a clear consensus among Ethereum developers that the network needs to be able to handle more transactions at a lower cost. If the Ethereum network can successfully reduce its transaction fees, it will become an even more attractive platform for developers and users.\n\nOverall, the rise in Ethereum fees is a sign of the network’s growing popularity and utility. While the current fees are higher than they have been in the past, they are still relatively cheap compared to other blockchains. The Ethereum network is constantly evolving, and there are a number of proposals in the works that could help to reduce transaction fees in the future."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPTGJqLVBkYjdMQzdWbENvYno3czBXUERFaWxrUE9pUEk3UjZnZVFaVTc5a0lPZzlsQUlZc01uX2o2WkVvYkdwYUdFdWdpQkhsbVAyanY1aTV4a0R2dXhyckVSQ3dGcm43YkhxazZocVUxX1ZWbnI4Rjl5U3hxOUpSd25aWmJiZEtmYjhvVTkyYmNqaVdrREd2RFRwbjlLWF90bF9WSDNyRjRDLXVTRmpR0gG0AUFVX3lxTE9lTlFkdV8wa1o1bFlHMW5qNGt0Z01YR0x4U19udlNNS2xwd0lLX1N6UkRUSzh3YlNoV3Iza2V2YlhiYUsweGtaTVM3RGkwWmhUMmdYVkM3SVl3OHFGNy1UeFZkQmZzLVR5ejFKcHhrM0VCWVNxcmhGRmtqV056N095TGt6NE13ekhpRWFqQ01lcjV3NkdiS3YzVUdyVW5DQkZHaUhDdVJ1NW5KSTU4cWZpcmZfTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "OMG Token Surges 16% as Vitalik Buterin Hails the 'Return of Plasma' - CoinDesk",
        "content": "OMG Network, formerly known as OmiseGO, was among the first layer-2 scaling products when it debuted with an initial coin offering (ICO) in 2017. It aimed to increase the efficiency of the Ethereum blockchain by using Plasma, a framework that bundles transactions together off of Ethereum and segments them into \"child chains.\""
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOaFhEY3dPbmwzeW5wNDNocVlVRnVldi04ZnE3NTZnbDFXMVdNOS1CMVRUVFFzWFg1TllwVU1ETlNUbE1BUDE4Y1JFRWxDcUx1bjhzclJ4Sk9Zb3pOdTVmVjlZZ3FraHJHYlhDMnFablllQ1NTLUl0czJlbDlYaHIydGlIclhnZGY0WG9JRlJhZVNLZTQxbW9fQmRRaXVZUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Surges After BlackRock Trust Filing, DOGE, ORDI, FTT, Nov. 13 - Bitrates",
        "content": "Ethereum rallies on a BlackRock ETF filing. DOGE sees a $1.7bn surge in whale interest. ORDI is back in demand. FTT continues a speculative run.\n\nETH\n\nEthereum started to chase Bitcoin last week with gains of 10% on the news that BlackRock had filed for an Ethereum-based trust.\n\nThe world’s largest asset manager started a surge in crypto interest when it filed a Bitcoin spot ETF application in recent weeks. Investors have been piling into BTC with hopes for investor interest in the ETF and the Bitcoin halving due next year.\n\nBlackRock registered the iShares Ethereum Trust as a Delaware statutory trust last week, while Nasdaq also filed a proposal on Thursday to list and trade shares of the trust. So far, almost a dozen ETF providers have filed to create spot bitcoin ETFs or convert existing products into spot ETFs, helping to fuel the recent rally in the cryptocurrency.\n\nThe SEC has up to 240 days to decide on product approvals and that could push any potential start date to next fall. However, Bloomberg gave a BTC approval a 90% chance by January.\n\nIt wasn’t all good news for ETH with rival project Solana overtaking Ethereum with the largest number of daily users after a 70% rise in activity on the chain. Artemix data said Solana hosted 356,300 unique users on Saturday, surpassing Ethereum’s nearly 330,000 by 10%.\n\nEthereum bounced off resistance at the $2,139 level and will need to get above that for further gains.\n\nDOGE\n\nDogecoin, the world’s most famous meme coin, has been seeing some bullish backing recently.\n\nAccording to recent data from IntoTheBlock, Dogecoin has been the focus of a surge in whale interest over the last few weeks.\n\nDOGE whales have increased their holdings with accounts of over $100,000 rising in value from $7.65 billion to $9.35 billion over a one-month period.\n\nAnalyst Kaleo has over 600k followers on X and believes DOGE could surge in the coming days or weeks. He said:\n\nWhen DOGE starts moving higher, it usually moves pretty fast. I wouldn't be surprised to see a daily from here to somewhere in the 9 - 10 cents range, chop there for a bit, then another daily to ~15 cents. It'll be a fast move.\n\nHe also believes that a larger rally will happen in 2024. Investors are still hopeful that X owner Elon Musk will add the coin to his social media when it rolls out its planned payments capability. Altcoins have been slower to catch up to Bitcoin’s recent price gains but often lag behind as BTC dominance increases.\n\nDOGE was trading at $0.0765 on Monday after touching resistance at the April highs. A push-through is needed to keep the bull run alive. DOGE is currently the number 10 cryptocurrency with a valuation of over $10 billion.\n\nORDI\n\nORDI was a strong performer this week with gains of over 100%.\n\nOrdinals is being boosted by the recent strength in Bitcoin as the protocol allows users to write information to each BTC that is mined, such as text, pictures, and audio. The goal of the project was to allow the creation of Non-Fungible Tokens (NFTs) on the Bitcoin ecosystem.\n\nBitcoin transaction fees have now risen to a six-month high due to the resurgence in the popularity of Ordinals. Data from BitInfoCharts said that the average transaction fee is trading at its highest point since May, after a 2,000% since the August low of $0.64. Average BTC transactions were trading at around $15 but fell back to $6.\n\nOrdinals surged in popularity when they were launched earlier this year, but interest faded.\n\nThese assets had gained popularity earlier in the year and heralded Bitcoin’s foray into the NFT space. But interest in them soon faded as the market landscape evolved. The market cap of the protocol hit over $400 million last week catapulting the project back into the top 100 cryptocurrencies.\n\nORDI was trading at $6.00 just over a week ago and has now settled around the $21 level.\n\nFTT\n\nThe top-performing coin this week was FTT, the native token of the failed FTX crypto exchange.\n\nFTT surged by 181% over the last seven days as investors believe it may have future utility. The rise in FTT was also spurred by comments from SEC Chair Gary Gensler’s comments that he was open to a restart of the exchange, \"within the law.\"\n\nThe exchange was once valued at over $30 billion but famously collapsed in a matter of days in November 2022. The exchange’s founder Sam Bankman-Fried was last week convicted of numerous charges last week and faces a lengthy jail sentence.\n\nGensler's comments came following reports that three bidders are circling FTX, including former NYSE president Tom Farley's crypto exchange Bullish.\n\nThe latest move is a speculative play as any new founder may not want to revive the FTT token on the platform.\n\nThe price of FTT was now trading around the $3.20 level after tumbling from its all-time high of $80."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMi8gFBVV95cUxPREswRndBVkRSQm9FYU16ZW1TMm4yb0g4am9mTFhZNUVJRlJxTmNnWVQtU2NPUDdDb3Vra2QtOXBDMDQ2Ujl6TXhsV0VSZ0VjOFVCZlpkYlM2bDRLZTJHcW5FRDZZemJsbFR5aW9mWkdBR0JpWkwyWmg1bkVhblh2OUxRMUhnek44RU9YLTNpZnR0Rl9QWjh6MV9ndWR6UXVGT1Q5NDJCTzgyMWtadW9MeHVfVXF2SF8tWXV0emIwUEVBTVBpa3NUaFJ3UzhvdHFDVTZOWHNOd1V4SGxac3lZUUp2anh4aVNwQWlESnNpdjhRd9IB9wFBVV95cUxPbDZ2d09ITy1iamlOZXNZX1VLYXVYcXhZZkJhdW85TzlBQUNWN2FybXpPNEdrdFhqekk2ZFJVV3VhZWo5bU5xTXdIZnk1enZxa1dvU0Mtd0s1QmpPbnFWd29wVGZDQ3NUUHNVb3hFeHBSdDhEUml5cUVkQ3hudFZJLUtVRjR6Q3FwZ0J1T3ZSWlFZcnZYUmNZVFExbTVYMEtKQ2k4c3lwXzVuTGlXb09DeG5kWFdVQjJaTTdtdnI5UHJFRGF6ZzVCaElrMnBWUzd0UDZ2TGFJSWRiVHJJMnhiVkRNVVQzeVlNbDlLNW56NGd4SWNPb3Zr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Next 3 days could be interesting for BTC as Nov 17 draws - FXStreet",
        "content": "Bitcoin price could fall 5% to bounce at the 250-day EMA at $34,483 for the next leap north.\n\nEthereum price likely to rise 5% to $2,136 range high if the support provided by the ascending trendline above $2,029 holds.\n\nRipple price filling up a symmetrical triangle makes a 10% drop to $0.5981 likely as XRP erases its weekly gains.\n\nBitcoin (BTC) price along with that of Ethereum (ETH) and Ripple (XRP) are static for the moment. However, following recent comments by James Seyffart, an analyst with Bloomberg Intelligence, the US Securities and Exchanges Commission (SEC) has a narrow window ending November 17 to approve spot BTC exchange-traded funds (ETF). On the back of speculation and investors trying to front-run a possible launch, the next three days could be interesting for the king of cryptocurrency.\n\nAlso Read: Week Ahead: Bitcoin ETF approval this week, yay or nay?\n\nBitcoin price eyes 5% slump unless a spot BTC ETF launches\n\nBitcoin (BTC) price could fall 5%, or not, depending on what the US SEC decides to do in the next three days. Whether it will be a yay or nay in regard to the spot Bitcoin exchange-traded funds (ETFs) will be the determining factor as the detailed eight-day window closes fast.\n\nMeanwhile, a 5% slump seems likely for Bitcoin price amid falling momentum. It comes amid buyer exhaustion after BTC was massively overbought. With the Relative Strength Index (RSI) and the Awesome Oscillator (AO) supporting the downside, BTC could slide to test the support confluence between the 25-day Exponential Moving Average (EMA) and the horizontal line at $34,483 before a possible bounce.\n\nIn a more dire case, the slump could crack past $34,483 to test the 50-day EMA at $32,332. Selling pressure could see Bitcoin price lose critical support at $31,190. A daily candlestick close below this level would invalidate the bullish thesis.\n\nBTC/USDT 1-day chart\n\nOn the flipside, increased buying pressure, which would happen if the SEC approves the launch of a spot BTC ETF, could send Bitcoin price north, clearing the range high at $37,972 to bring the $40,000 psychological level into sight.\n\nAlso Read: Bitcoin rages on, $40,000 may not be a hopium pipe dream for BTC after all\n\nEthereum price must hold above ascending trendline to realize upside potential\n\nEthereum (ETH) price is showing weakness, but the overall trend remains bullish. To realize more gains, the second largest cryptocurrency by market cap must hold above the ascending trendline, which could deliver 5% gains for a test of the $2,136 range high. In a highly bullish case, the gains could stretch to the $2,200 psychological level.\n\nETH/USDT 1-day chart\n\nOn the other hand, increased seller momentum could send Ethereum price below the ascending trendline at $2,029. A break and close below this level could see ETH fall into the supply zone turned bullish breaker. A break and close below its midline at around $1,935 would solidify a continuation south.\n\nAlso Read: Ethereum Price Prediction: Eighteen-months ascending triangle pattern appraises $4,000 target for ETH\n\nRipple price fills up a triangle\n\nRipple (XRP) price has filled up a triangle amid reducing volatility in the XRP market. For the next directional bias, investors should wait for a confirmed breakout of this pattern. Meanwhile, all signs point to a downside move, amid falling momentum, indicated by the RSI and the AO histogram bars flashing red.\n\nIncreased selling pressure could see Ripple price break the lower trendline of the triangle to test the 25-day EMA at $0.6187. If the 25-EMA fails to hold as support, the slump could extend for XRP to tag the $0.5981 support level, 10% below the current price. A break and close below this level would clear the path for the remittance token to spiral further, slipping past the 50-day and 100-day EMAs at $0.5837 and $0.5619, respectively, to fall into the consolidation range between $0.5392 and $0.4735.\n\nXRP/USDT 1-day chart\n\nOn the flipside, a break above the upper trendline could see Ripple price stretch to reclaim the November 13 high of $0.7500. In a highly bullish case, it could break past the Fair Value Gap (FVG) ranging from $0.7519 to $0.7623, restoring balance before tagging the $0.8000 psychological level. Such a move would constitute a 20% climb above current levels.\n\nAlso Read: SEC v. Ripple lawsuit still drags on, Judge Torres sets schedule for 2024"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOdGsyZXhXQTlBWlVaZEVnMVppU3g5SUpUbXNJdXNoemNsRmJVYVZUREZzV1VlaU1tQ0NQd2NjcFlYUktqczBEZkNONUUwcGxEcWZYY3VOVmQtTXl1R3NKY09aZUVacldmVGxUME0zZFU3RXhzV1FfQUNSZjl6QnpneEY2TWMybEdtNGpaWHg1VjZlcDA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Cryptos surge as BlackRock Ethereum ETF plan is confirmed - Nasdaq",
        "content": "Bitcoin (BTC) has again been making headlines and capturing the attention of crypto enthusiasts and traders. The popular digital currency has recently surged to levels not seen in almost eighteen months.\n\nSince taking out the $32,000 level of resistance near the end of October, the price of one bitcoin has surged to $38,000. The last time the bitcoin price traded near this level was over a year ago, in May 2022.\n\nBitcoin and another leading, popular digital currency, Ethereum (ETH), have also been in the headlines for reasons other than price surges. The world's largest asset manager, BlackRock, recently filed for an Ether exchange-traded fund. This move created further optimism that the crypto markets could see greater access, more significant institutional involvement, and liquidity.\n\nSo, as the price leading cryptocurrency’s trade higher in part due to the potential of a regulated exchange-traded product tied to the spot price of Ethereum, it’s worth looking closer at some individual stocks tied to digital currency and also noting where the U.S. Securities and Exchange Commission (SEC) stands with regards to approving a Bitcoin ETF.\n\nBlackRock takes steps toward launching Ethereum ETF\n\nBlackRock has officially confirmed its plans for a spot Ethereum exchange-traded fund (ETF) through a filing with the SEC. The filing, submitted by Nasdaq on behalf of BlackRock, proposes an ETF named the \"iShares Ethereum Trust.\" This move signifies BlackRock's intention to expand its ETF offerings beyond Bitcoin, marking a significant step in its cryptocurrency investment strategy.\n\nThe filing comes after BlackRock registered the corporate entity \"iShares Ethereum Trust\" in Delaware, hinting at the imminent submission of a spot Ether ETF filing. Several financial firms, including BlackRock, have shown interest in cryptocurrency-backed ETFs, with at least five firms vying for SEC approval for a spot Ethereum ETF, according to Bloomberg’s James Seyffart.\n\nSpeculation grows about the SEC approving a spot Bitcoin ETF\n\nSpeculation is growing about the SEC approving a spot Bitcoin ETF. Analysts have estimated a January approval at the earliest, emphasizing the SEC's cautious stance. Recent speculation suggests potential decisions on applications from BlackRock and Fidelity, but the SEC extended the timeline for the ARK 21Shares Bitcoin ETF to Jan. 10.\n\nSo, as speculation grows and the price for several popular digital currencies surges, here’s a list of four crypto-related stocks that could see rapid price appreciation should breaking news occur.\n\nFour crypto-related stocks to keep an eye on\n\nMarathon Digital (NASDAQ: MARA)\n\nMara is a Las Vegas-based digital asset technology company. The company specializes in blockchain-based mining and produces digital assets such as Bitcoin. Shares of the crypto company have skyrocketed this year, up about 180%. However, the stock has failed to join the latest crypto uptrend and, over the previous three months, fell almost 36%.\n\nMicroStrategy (NASDAQ: MSTR)\n\nMicroStrategy is a global provider of enterprise analytics software and services. MicroStrategy is actively involved with Bitcoin, holding and acquiring the cryptocurrency as part of its strategic investment strategy. As of November 1, 2023, MicroStrategy possesses 158,400 bitcoins, acquired at an average purchase price of $29,609.65 per bitcoin, resulting in a total investment of $4.69 billion.\n\nCoinbase Global (NASDAQ: COIN)\n\nCoinbase Global is a major cryptocurrency exchange offering tools for trading over 200 cryptocurrencies. COIN shares have performed exceptionally on the year by any standard, up almost 163% and recently rallying double-digits off key support in the $70s. However, analysts are not bullish on the stock, with a consensus Hold rating and a price target of $75.64, predicting almost 19% downside.\n\nRiot Platforms (NASDAQ: RIOT)\n\nRiot is a U.S. blockchain technology company that strives to be the premier provider of Bitcoin mining services in North America. The company offers cryptocurrency mining hardware, hosting services, and proprietary software. Shares of RIOT have impressed this year, to say the least, up 205%. However, the stock has failed to catch a bid off the recent sector headlines and has fallen almost 32% over the previous three months.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxPRkhOWDFWdzc1bDVyWTZ5UDNsNV93ekRDU003VzAxNlJWNkhFbEtpdzBSX2xBZEx0a0Uzc0JIZjJ5V0RVSFlWZ19aOHpVamlpZDE3MWtFbEhwaVZuSGZuSnlpU0duT21EUG9TVTR6enJnWWZXeGhUSWNKWW5fVHlSVTE5TkVWRmVfOVh6ZzVNOTgxRE16THlCY1NCU2NoYVRlT0Nhd1FMdEFNX1BwYWlWNnE0MlNwa3NpYk5wVDNkcTBsTTk0QWRtX1ZlTWp1b1BCU1otc1RPdHdEY1pTWDhVMUVNNTHSAeoBQVVfeXFMUDVrOEhDQUNpYzF4eVNOdHVoWXZKVlpMYlJfTlI5TS1KMExVM2gyTHN0dmJ1N3I2V0ZnaHZ6WXlXaVp1Rm14aGNLQ0FVaXlwNXI1SDcyTlZ2VDFhQl9VMTV3RXNOVnU5SmhjalBlSEl1c2ZVUS00UUlsV00zU1BVZjgzMWdvMkQ5eEdNS3BBa3lldU1fVWR2bkhBTkJWcF9yMW1yeU9adjVjNnNoNkRSdTlsYm95dU9pTjdPZDR0YzhNWWtlVnlvSEdQV1IzZFV6WG1BbC1QWjgtLXdHUjc0eU1HbEYyX21wVkNR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "SOL becomes institutional investors' choice over Ethereum as Solana price sustains above $50 - FXStreet",
        "content": "Solana price has been one of the biggest attention grabber over the past couple of days owing to its unexpected 25% rally in a single day right before the weekend. While a specific reason cannot be deduced for the rise, the potential lies in the fact that SOL is now becoming one of the most preferred institutional assets.\n\nSolana sees institutional interest\n\nSolana is already one of the biggest cryptocurrencies in terms of gains, and the institutions seem to be observing this keenly, too. Consequently, cryptocurrency has become the most in-demand asset when it comes to institutional investors, surpassing even Ethereum.\n\nThe CoinShares weekly institutional investors’ report highlights that for the week ending November 10, SOL observed inflows worth $12.4 million, which added to the monthly inflows of $23.1 million, bringing the year-to-date inflows to $121 million.\n\nEthereum and others, on the other hand, are far below SOL when it comes to year-to-date flows, although Ethereum is making slight progress this past month, as noted by the $62 million inflows since November began.\n\nSolana institutional investment\n\nThis will prove to be highly helpful for SOL in noting a boost in its value but also push the price and value of the Grayscale Solana Trust, also known as GSOL. The Grayscale investment product, following the rally in Solana price, has exploded, with the investment vehicle trading at a premium of 378% since the beginning of October.\n\nGSOL 3-day chart\n\nWhile investment product value is not considered to be an accurate measure of demand, it does highlight the rate of improvement.\n\nSolana price reverses after rally\n\nSolana price trading at $52.41 has noted a near 7% decline on the 3-day chart, with SOL noting an 18.02% decline from the intra-day trading highs of the token. The most likely outcome right now for the altcoin is slow declines followed by a reversal in the cryptocurrency’s price.\n\nSOL could see a gradual decline over the next couple of days, bringing the altcoin to test the support line at $46.42. While the drawdown may not be significant, losing this support would prove to be harmful as it would extend the 24-hour losses towards the $40 level.\n\nAlthough no clear signals of a price reversal are visible, the consistent rally has overheated the market, which would need some cooldown. This might result in further decline.\n\nSOL/USD 3-day chart\n\nHowever, if Solana price bounces off the $46.42 support line and climbs back to breach the $59.03 resistance level, it would invalidate the bearish thesis and send SOL towards tagging the new highs beyond $60.\n\n\n\n"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQLWhKYzVRTVpzdjItWURhQ0d0Y3Z3RVJKU29oMjkzVFFmQkRFeW9GSmJHWG54UXVjZzNkNUtmMFZWcXY3TXkwNFpmUWZXckdfbnNLOVdISWJLWFNoRFRmaWVORkdueWt3YVAyTDFNcy1uTTJaWnZnOGZpd0xpd0JVWHZyVzBkQXROX2RDSHREVHpoOFZmT05pc3oyQksxaVRlQlNWcXRoMGFqQWhzd3Z0OW1Ydno4dkZoMVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "What Are All the Different Types of Cryptocurrency? - The Motley Fool",
        "content": "Since its creation in 2009, Bitcoin (BTC 2.9%) has become a revolutionary digital currency. Because it enables peer-to-peer payments without a third party (like a bank), it has set off a tidal wave of other cryptocurrencies and digital assets making use of blockchain technology. Blockchain is a digital public ledger where information on each transaction receives a unique \"hash\" (or identity) and is added to the end of the ledger. Bitcoin's success has put blockchain on the map and put its potential to decentralize and improve the digital economy on a path to disrupting the status quo.\n\nImage source: The Motley Fool\n\nCrypto coins vs. tokens Crypto coins vs. tokens First things first: Know the difference between a coin and a token. When discussing cryptos, you may hear the terms \"coin\" and \"token\" frequently used. Although they may sound like interchangeable terms, there is a difference. It's important to keep them straight. A digital coin is created on its own blockchain and acts in much the same way as traditional money. It can be used to store value and as a means of exchange between two parties doing business with each other. Examples of coins include Bitcoin and Litecoin (LTC 2.58%). Tokens, on the other hand, have far more uses than just digital money. Tokens are created on top of an existing blockchain and can be used as part of a software application (like to grant access to an app, to verify identity, or to track products moving through a supply chain). They can represent digital art (like with NFTs, or \"non-fungible tokens\" that certify something as unique). There has even been experimentation using NFTs with physical assets, such as real-life art and real estate. Ether is an example of a token, which is used to make transactions on the Ethereum (ETH 1.77%) network.\n\nWhy so many? Why are there so many types of cryptocurrency? Blockchain technology is open source, meaning any software developer can use the original source code and create something new with it. Developers have done just that. There are estimated to be more than 10,000 different cryptocurrencies in circulation at the time of this writing, and the figure keeps increasing. For reference, the number of cryptos surpassed 1,000 only four years ago. Part of the reason for the surge is the relative ease with which new cryptocurrencies can be created. The source code of one can be used to build another. For example, the Ethereum network could be used to create your own personal digital coins. Sometimes there are \"forks\" in the software code that change the rules about how a crypto is governed, which can lead to the creation of a new crypto. Bitcoin Cash (BCH 4.04%) was created in 2017 as a result of a Bitcoin fork allowing more transactions to be recorded on a single block of the blockchain. Surging crypto prices have led many developers to try getting a cut of the action. And blockchain technology has usefulness beyond just digital currencies. So, while some cryptos might be a bubble that will eventually pop, the decentralized nature of the technology and the broad scope of how it can be applied in the software world are two reasons why there are so many cryptos. Main types Main types of cryptocurrency Bitcoin is considered the first cryptocurrency created, and other individual cryptocurrencies are known as \"altcoins\" (a combo word derived from \"alternative coin\"). It's difficult to say which cryptos are the best ones, but Bitcoin and some of the largest altcoins out there are top-tier options because of their scalability, privacy, and the scope of functionality they support.\n\nTable by author. Data source: coinmarketcap.com. Data as of October 27, 2023. Coin Total Market Value* Bitcoin (CRYPTO:BTC) $656 billion Ethereum (CRYPTO:ETH) $212 billion Tether (CRYPTO:USDT) $84.5 billion Binance Coin (CRYPTO:BNB) $62.6 billion USD Coin (CRYPTO:USDC) $24.9 billion XRP (CRYPTO:XRP) $29.1 billion Terra (CRYPTO:LUNA) $249.5 million Solana (CRYPTO:SOL) $13.3 billion Cardano (CRYPTO:ADA) $10.1 billion Avalanche (CRYPTO:AVAX) $3.7 billion\n\nThere really isn't one \"best\" cryptocurrency since each has different features built in based on what the developer designed it for. Here's an overview of some of the most popular digital coins and how each is being used. 1. Bitcoin Bitcoin is regarded as the first decentralized cryptocurrency using blockchain technology to facilitate payments and digital transactions. Instead of using a central bank to control the money supply in an economy (like the Federal Reserve in tandem with the U.S. Department of the Treasury) or third parties to verify transactions (such as your local bank, credit card issuer, and the merchant's bank), Bitcoin's blockchain acts as a public ledger of all transactions in the history of Bitcoin. The ledger allows a party to prove they own the Bitcoin they're trying to use and can help prevent fraud and other unapproved tampering with the currency. A decentralized currency can also make peer-to-peer money transfers (like those between parties in two different countries) faster and less expensive than traditional currency exchanges involving a third-party institution. 2. Ether (Ethereum) Ether is the token used to facilitate transactions on the Ethereum network. Ethereum is a platform that uses blockchain technology to enable the creation of smart contracts and other decentralized applications (meaning the software doesn't have to be distributed on app exchanges like Apple's (AAPL 0.51%) App Store or Alphabet's (GOOGL 0.77%)(GOOG 0.52%) Google Play Store, where they might have to give a 30% cut of any revenue to the tech giants). Ethereum is both a cryptocurrency (the actual coins are measured in units called Ether) and a software development sandbox. 3. Tether Tether is a stablecoin, or a currency tied to a fiat currency -- in this case, the U.S. dollar. The idea behind Tether is to combine the benefits of a cryptocurrency (such as no need for financial intermediaries) with the stability of a currency issued by a sovereign government (versus the wild price fluctuations inherent with many cryptos).\n\n4. Binance Coin Binance Coin is available on the Binance cryptocurrency exchange platform, along with other digital coins that are available for trading. Binance Coin can be used as a type of currency, but it also facilitates tokens that can be used to pay fees on the Binance exchange and to power Binance's DEX (decentralized exchange) for building apps. 5. USD Coin USD Coin is another stablecoin, and, like Tether, it is pegged to the U.S. dollar. Also like Tether, USD Coin is hosted on the Ethereum blockchain. The idea behind USD Coin was to create a \"fully digital\" dollar, one that has the stability of U.S. fiat currency but doesn't require a bank account or that the holder live in a particular country. Rather than an investment, USD Coin is envisioned as everyday money that can be spent with merchants on the internet.\n\nCrypto trading Are there different types of cryptocurrency trading? Investing in cryptocurrencies is a little different than investing in shares of a company. Stock represents ownership of a business and a claim to profits the company generates. Purchasing coins of a cryptocurrency, though, is a speculative bet on the price movement of that digital currency -- which can be highly volatile and is subject to the law of supply and demand since digital currency by itself is not a dynamic asset. Cryptocurrencies can be exchanged for other digital currencies or for fiat currencies like the U.S. dollar using a digital wallet on a trading app. But there are other ways to make money besides trading. Certain cryptocurrencies can be \"staked\" to earn rewards. Once an investor has purchased a crypto, it can be held in account and used to verify transactions occurring on the blockchain network. This method of powering a blockchain network is known as \"proof of stake,\" and the owner of the crypto can earn a type of dividend by staking their holdings, which are usually paid in additional coins or tokens. In addition to trading digital currencies, derivatives contracts are also available on Bitcoin and Ethereum from leading derivatives exchange CME Group (CME 0.44%). Derivatives such as futures and options are primarily used as a hedge against price fluctuations in the underlying asset.\n\nRelated investing topics\n\nWhere to buy Where to buy all types of cryptocurrency With so many cryptocurrencies out there right now, there is no single place that grants access to all of them. However, Coinbase Global (COIN 7.69%) is one of the largest trading platforms and currently supports more than 100 cryptocurrencies (including most of the top 10 largest cryptos by market cap). Binance is another top trading platform and is where Binance Coin and tokens can be traded. If you're looking to buy company stock and cryptocurrency from a single place, here are the apps worth checking out: Robinhood\n\nWebull\n\nBlock 's ( SQ 1.96% Cash App\n\n's ( Cash App SoFi\n\nThese trading apps don't support all account types like a full-service stock broker, but they have lots of functionality that combines basic crypto and stock trading with digital banking capabilities. This is just the tip of the cryptocurrency iceberg. There are thousands of different digital currencies utilizing blockchain technology being used for an incredibly diverse list of applications within the digital economy. Bitcoin is far and away the most popular crypto because it has picked up momentum among a young generation of consumers, but developers are always innovating new blockchain tech and uses for it. The developments give other platforms such as Ethereum a lot of value since they are used to build new software. For investors trying to peer into the future, that could hold a lot of appeal since decentralized blockchain could remove third parties from business transactions and make payments around the world more efficient."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQSTNQMWNwSDJKY0pLbHdvQV9hZkh3TDcxelM0OTVCdWlpSG1ScmdNelVzQmxWWEhYeVdpQTdDX2VoRmc3ckg5ZjloWF80NW9vaG16QWpPenZHb3pNcjBMWEU2dTM3R2lqa25xM21Ka2wyR3IyazNfMEhYTDVxMExXdnoyOWJpaUwya21Dd28wZjQ0U1Mwb3BZQWEtUjMzN2t2d3dZbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum and Everlodge price prediction: Dogecoin Foundation member issues warning - crypto.news",
        "content": "A Dogecoin Foundation member recently issued a warning to the crypto community. Meanwhile, Ethereum (ETH) and Everlodge (ELDG) are relatively firm.\n\nDogecoin: the crypto warning\n\nThe Dogecoin Foundation, an organization dedicated to developing and promoting the meme-inspired coin, has a familiar presence in the scene.\n\nYou might also like: Dogecoin (DOGE) millionaire wallets declined by 40% in 2023\n\nMisha Boar, a member of the Dogecoin Foundation, recently issued a warning, pointing to the growing number of phishing scams in the industry. He advised his audience to withdraw funds from “dogechain dot info” and other centralized exchanges.\n\n– Phishing attempts will often imitate a legitimate circulating e-mail.\n\n\n\nSo, NEVER click directly on the links in the e-mail, always type the address dogechain dot info directly in the browser and access your wallet from there.\n\n\n\n2/n — Mishaboar (@mishaboar) November 5, 2023\n\nWhile this statement sparked a debate, DOGE prices remain in an uptrend. DOGE prices rose from $0.070 to $0.074 in three days from Nov. 4.\n\nBased on this, analysts are bullish on the coin, forecasting it to reach $0.098 by December 2023.\n\nEthereum: rising exchange outflows\n\nWhile the warning from the Dogecoin Foundation has sparked conversation, it’s crucial to consider broader market dynamics, especially for coins like Ethereum (ETH).\n\nIn recent Ethereum news, it was noted that more ETH were moving from centralized exchanges.\n\nYou might also like: Near Foundation and Eigen Labs partner to enhance Ethereum rollups\n\nAccording to IntoTheBlock, approximately $210 million worth of ETH left centralized exchanges (CEXs) in late October; the highest in seven days since August.\n\nThis week, $210M worth of ETH left CEXs, the largest 7-day net outflows since August. pic.twitter.com/frYWasXvwZ — IntoTheBlock (@intotheblock) November 3, 2023\n\nMeanwhile, ETH prices rose from $1,799 on Oct. 31 to $1,878 on Nov. 7.\n\nAnalysts are optimistic, predicting ETH to reach $2,335.71 in Q4 of 2023.\n\nEverlodge could outperform Dogecoin and Ethereum\n\nEverlodge presale is in progress. The project aims to address challenges in the real estate market.\n\nIt is establishing a unique niche with innovative solutions that could disrupt traditional real estate practices and improve global accessibility.\n\nIn the real estate market, entry barriers are typically high, limiting access to wealthy individuals.\n\nHey, Lodgers! 🏡\n\n\n\nDo you know? 🤔\n\nWith $ELDG, enjoy the warmth of passive income, monthly surprises, and exclusive club access.\n\nPlus, who can resist sweet discounts?\n\n\n\nDive into a token that feels like home. 💙\n\n\n\nJoin the presale: https://t.co/kIufYkD05d#Presale pic.twitter.com/9yzt5hZhul — Everlodge (@EverlodgeHQ) September 26, 2023\n\nEverlodge aims to overcome this by digitizing and minting luxurious villas or hotels into non-fungible tokens (NFTs), which are later fractionalized.\n\nThis approach enables investors of all income levels to become fractional owners of properties.\n\nMinted NFTs should rise in sync with the associated real-world property.\n\nELDG holders can join the Rewards Club, granting them free nightly stays in Everlodge properties that can be resold.\n\nIn stage 6 of the Everlodge presale, ELDG is available for $0.023.\n\nExperts predict ELDG to reach $0.038 by the end of the presale.\n\nVisit Everlodge"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPNVF5T3hHR2g1T3JzcEJqZkdIaG0zTWxDMUhrZUZTaWJvVlVRaGxhYURXTWVxUmRnbFN4SkZST0hYRmhuZHkwR2F3UjBfMTRXTnR6aW82bFo4UmxMQ0FfR0tRX1NIRS1jT2ZuaVc0VTJSb0ExNXNuTW96QlM1X1ZWNnpTWno?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin in Jeopardy? Ethereum Supremacy is Near - Cointribune EN",
        "content": "Tue 14 Nov 2023 ▪ 3 min read ▪ by Evans S.\n\nWhile Bitcoin (BTC) has long dominated the market, a new wind is blowing, carrying a bold promise: the imminent supremacy of Ethereum (ETH). This prospect, considered by a former Goldman Sachs executive, raises questions about the future of Bitcoin. Is it really in peril?\n\nA New Leader Emerging?\n\nThe widely respected Tom Demark Sequential indicator suggests a significant turnaround: Ethereum is on the verge of surpassing Bitcoin.\n\nRaoul Pal, a former Goldman Sachs executive and macroeconomics guru, supports this theory. According to him, Ethereum, with its smart contract platform, is not only technologically superior but also on its way to becoming a more profitable asset.\n\nThe reason? Exchange-Traded Funds (ETFs) based on Ethereum, described by Pal as the “Holy Grail” for asset managers.\n\nThese ETFs would allow for capturing an attractive yield while providing ETF holders with more stable price performance. This competitive edge could redefine the crypto landscape.\n\nThe Counter-Argument: Bitcoin Remains the King\n\nHowever, not everyone shares this vision of Ethereum’s supremacy. Benjamin Cowen, a prominent crypto analyst, maintains that Bitcoin’s dominance is far from waning. He argues that BTC’s market capitalization continues to hold a significant place in the market.\n\nCowen argues that despite the innovations and advancements of Ethereum, Bitcoin retains its status as the primary safe haven asset in the crypto universe. His portfolio, mainly composed of BTC, testifies to this belief. For Cowen, Bitcoin remains the unshakable giant, a safe bet in the tumult of the crypto markets.\n\nThe real question is this: are we witnessing the emergence of a new era where Ethereum will reign supreme, or will Bitcoin and Ethereum coexist as complementary giants?\n\nAs the debate rages on between the proponents of Ethereum and those of Bitcoin, one thing remains certain: the crypto sphere continues to surprise us. Between bold predictions and market realities, the future of Bitcoin and Ethereum remains fertile ground for speculations and analyses.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOZ1c5NjNpUzFHZXduUDE1Y1cwS0JQUFVMLUhnalV6YnY1V0Nqc2g2Z05RZjZwZElQTjNPNXpYSnVSdTdHYmJEdWdkWFlzZnpUQlJOWlFvWEJyTHFjaVpsaGFxbXNQRXpZemZ1MXJLRHpHM2tjZ2hFS1E1M2V1ZmphOTdtX191aTE2WDlvUnBGU0NUMlowbk94TDJYczQ5bTVTMG1GU2lYQ3YzXzZmcDNOOER1SEF1bFVKRjc5VXJn0gHDAUFVX3lxTE1ROWpGNWROU1M5Z29yMl8xOGs2WVlTdVowcGJZeVNZcnRfZXAxaXV5Q2pidzBkOHJhdmZ0MXBSaDZ1ZkdObWY0SG5NSUxmUXE2OGxBeTF6YjVGNW9DbUZSc3hldTlNV0pfM2pRa3pkX2M4cTFPaGxId3RZd3B1SlREX0tVa19samQ1eFBiSWhMTFdVSmFicjJOVkc3ZV9zWlYwMWN5WTR0SkNLNXhsTDZTM1N3eXRtckp3U0pBWDR3WW1mRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Circle to Enable Cross-Chain USDC Transfers With Cosmos's Noble Later This Month - CoinDesk",
        "content": "“What is important here is the sheer amount of USDC liquidity we expect to migrate to Cosmos using this novel non-custodial bridging mechanism,” said Jelena Djuric, CEO and co-founder of Noble. “DYdX is uniquely positioned to be the first power user of CCTP given its v3 product on Ethereum and the industry-leading trading volumes of billions of dollars per day it has achieved.”"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNcDVUcnJURmt1d0t2S1pyYjBFZWhhcFh3ZXRaZDZEb0ZxVlkzZUpCOWRMOUpWbmpZZjY0blhGS2MxMzZxNlEtdFFMT1hURkZHY2NlRGN2U1BpSEEwUTEtYUVwS2xQZTFBWHhMbXJvMHNwZ0w5REtidi1LZEZtU3p0TnpmLTMySUZkUmZqSTI3ZkFIbEhXNVd3c04tbU1OYVh6Z1E1RU1VU2FQVERmbl8xUTZfR1RoNENPSWZoaGln0gHDAUFVX3lxTE92V2R3Nk1rR1RBVXN1SW9VM0dmUzBETXpkWjI1Zi1NckZyaVNmRHduUjR3cWFkSUdzeDVBN18tNXo3b29lS0NQMzNhYzV2Y29jUXVNUlozMkRfNV9USEtSVi1uZVN6ak1EcFdpVDNnYnlqRjlMRTZWLWFtLWVwOU50TXpKcTBmSHU4MTRpRFVwb3pwbmQ2S3QwU2lPQXE1NUVTSGVoUjlMNkZBRGdNMC01RW01ZDI5cWg1RTNnMTk2SXVJMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Massive Altcoin Season Is Still Yet To Come, Says Crypto Analyst Jason Pizzino – Here’s Why - The Daily Hodl",
        "content": "Closely followed crypto analyst Jason Pizzino is saying that the altcoin season has yet to begin even though some digital assets are now surging.\n\nIn a new strategy session, Pizzino tells his 293,000 YouTube subscribers that based on a historical pattern, the true altcoin season will arrive sometime around October 2024.\n\nHe bases his prediction on prior market cycles centered around Bitcoin’s (BTC) halving events, which occur every four years. The next Bitcoin halving, when miners’ rewards are cut in half, is expected in April 2024.\n\nSays Pizzino,\n\n“This is not the altcoin season that most are waiting for. However, they’re still very good gains. But this Bitcoin chart is indicating that the massive altcoin season is still ahead of us and the biggest gains of them all are still to come. This is basically the precursor to the big explosive gains that we are yet to see in the market.”\n\nLooking at his chart, he says that prior BTC bull market cycles generally last three years with the first 18 months leading to increases that confirm the bullish uptrend, followed by 18 months of huge gains. He says the altcoin season begins in the second half, months after the halving event.\n\nThe trader says that Ethereum (ETH) experienced an initial rise heading into October 2016 and October 2020, both BTC halving years, followed by more massive increases during what he considers the altcoin season.\n\n“So Ethereum, we have two cycles to look at here.\n\nETH from the last cycle, October 2020, we had a 1,300% rise. We look at where it was from the low to that high point – 277% to that October period…\n\nOctober 2016… the first move to that low point, 2,200%. Where’s my other one? Here it is, 14,000%. So all I’m doing here is this number is smaller than this number here. This is the confirmation.”\n\nHe says a similar pattern also occurred in 2020 for ETH competitor Solana (SOL).\n\n“Solana, here it is, October 2020 to the upside, 20,000%. If you bought it right at the bottom here [in April 2020] to this point [in October 2020], that’s about 500%. So beautiful gains either way.”\n\nCardano (ADA), another ETH competitor, also followed the same price pattern, the trader says.\n\n“[Cardano in] October 2020 to the top – 3,400%. From this bottom here in March 2020 [to October 2020] you got around 400%, so this is the confirmation that the markets are ready to break out.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiUkFVX3lxTE9nQ2M1aDRuQW5JaWNJWTVJaWdzMF9pejhSM09wc2otb0FBUTR1QTVEekdKczJkZEVYQXFLVjg3alRSa1pjLVNBYXB3czhOdThJN3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Introducing X Layer: Our New EVM Compatible Layer 2 Network Designed to Build the Future of Web3 - OKX",
        "content": "A message from our Chief Marketing Officer Haider Rafique\n\nCalling all Web3 builders!\n\nToday we’re excited to introduce X Layer to the world. Our new native network, X Layer is a Zero-Knowledge (ZK) Ethereum Layer 2 (L2) and is built with the Polygon Chain Development Kit (CDK) as part of a strategic collaboration between us and Polygon Labs.\n\nAs a state-of-the-art, user-friendly protocol for developers, creators and Web3 enthusiasts, X Layer utilizes ZK proofs and is highly secure and scalable with low transaction costs. X Layer users may pay for gas fees using our platform token, OKB.\n\nWith today’s testnet launch, the X Layer network connects the us, Polygon and Ethereum communities, allowing anyone to build on its global on-chain ecosystem. And we're looking to attract the next generation of developers who see the potential of these ecosystems and interoperability between them. We believe developers can use this network to build world class consumer Web3 applications, otherwise harder to build on other ecosystems because of high fees and lack of interoperability.\n\nWhy build X Layer?\n\nWeb3 changes everything. Leveraging blockchain technology, Web3 empowers everyone to take full control of their digital lives.\n\nIt's about decentralization and using the architecture of Web3 to create a new internet: one with more transparency, control and mobility for all. Our mission is to accelerate its mainstream adoption. To achieve this goal, we believe:\n\nThe best way to achieve mainstream adoption is to help scale the largest existing Web3 community, Ethereum, instead of competing with it.\n\nBlockchain infrastructure that can gracefully scale to the needs of its growing user base by billions of users, is necessary for the healthy growth of the global crypto and digital asset ecosystem\n\nWhat makes X Layer unique?\n\nX Layer is designed with developers top of mind, and its core differentiators include:\n\nBringing us and Polygon ecosystems together: Both companies will continue to contribute to the development of the Polygon Chain Development Kit (CDK), enhancing the user experience while giving builders native access to the most advanced technology stack available. Collaboration between our and Polygon builder communities will result in better outcomes, more developer attention, innovation, more projects built on X Layer and ultimately more users.\n\nThe power of our platform: We're one of the world’s largest crypto ecosystems, with over 50 million users with billions in assets on the platform. Using OKB as the X Layer native token, users can move value seamlessly between us and X Layer. This is an instant advantage for X Layer as it looks to grow the Web3 community to new heights.\n\nEthereum compatibility: X Layer is Ethereum compatible, which means that all existing EVM smart contracts, developer tools and wallets can work seamlessly on X Layer with zero code rework required. In a nutshell, existing DApps can be migrated to X Layer at zero cost.\n\nLow cost: X Layer uses improved zkSNARK to make transactions more compact and therefore cheaper. This cost saving is passed on to developers and end users, which serves to make their experience smoother and more enjoyable.\n\nHigh performance: X Layer ensures transactions are confirmed swiftly, sparing users the long wait times commonly associated with other networks. This transaction speed is possible because X Layer is powered by one of the fastest ZK proof algorithms and the most advanced hardware cluster in the world.\n\nWhat’s next?\n\nThe excitement is just beginning. We're teaming up with leading projects and partners who believe in the X Layer vision. Stay tuned as we unveil more in the weeks to come. We aim to onboard billions of users from Web2 to Web3 by scaling Ethereum, and believe that the X Layer will unlock this potential. We recognize the magnitude of this mission and understand that it's a collective effort. This is why we invite all builders to join us: https://www.okx.com/xlayer. For more information about X Layer testnet, click here. To connect with our growing community, follow X Layer's social channels below: X | Discord | LinkedIn | Web"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPaDFTY1VKb3pLbFN3blM3bElUcENQeHdORWMzelhuZ3BCWjRHZFlNd3BTV2dQdXBqTU85T0JUcUkwNnBxQklKWlY0WEIwdlpyRFhONnZ5ZEo4cEh1QTNWTnA5VkdsSmNkaUVqOXBkR1VXVkNOWWlmRTg2TGxhVjdJUWMtOXUxMlNhbEktYg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Daily Crypto Price Analysis: BTC, ETH, SUI, LUNA, and FTT - Blockchain Reporter",
        "content": "Cryptocurrency markets, known for their inherent volatility, provide a captivating landscape for investors who closely monitor price movements to make informed decisions. In this comprehensive analysis, we delve into the recent trends of five prominent cryptocurrencies: Bitcoin (BTC), Ethereum (ETH), Sui (SUI), Terra (LUNA), and FTX Token (FTT). Each coin’s performance over the last 24 hours is scrutinized to identify noteworthy trends and potential opportunities for investors.\n\nBitcoin (BTC) Price Analysis\n\nBitcoin, the pioneer cryptocurrency, has experienced a recent uptick in its price. As of the latest data, the current price stands at $37,022, reflecting a 0.18% decrease in the last 24 hours. Over the past week, Bitcoin has shown resilience, registering a notable 6.02% gain. Bitcoin’s price continues its upward momentum, breaking through the upper limits of an ascending parallel channel. This bullish trend suggests the potential for further gains, with $40,000 now within reach.\n\nIf the bulls maintain their buying pressure, the BTC price might surpass the range high at $37,972. In an exceptionally bullish scenario, the cryptocurrency could achieve the coveted $40,000 mark, representing a substantial increase from its current levels. Investors are closely monitoring these developments, anticipating the potential for continued positive momentum in the market.\n\nEthereum (ETH) Price Analysis\n\nEthereum has witnessed a mixed trend in the last 24 hours. Currently priced at $2,058, ETH has experienced a slight surge of 0.16% during this period. Moreover, over the past week, Ethereum has demonstrated strength with an impressive 9.40% increase. ETH is currently grappling with a significant hurdle at the $2,139 resistance level, a formidable barrier that could signal a shift to the territory last tested in May 2022.\n\nA successful breach and close above the $2,139 resistance level would pave the way for further Ethereum price gains, starting with the clearance of the range high at $2,141. On the other hand, the Relative Strength Index (RSI) indicates that ETH is heavily overbought, and its southward deviation suggests a waning momentum. These factors pose potential threats to the upside momentum of Ethereum’s price.\n\nSui (SUI) Price Analysis\n\nSui has shown significant growth in the last 24 hours. With a current price of $0.6442, SUI has surged by 7.48%. Based on our latest price analysis, our SUI price prediction anticipates a potential decrease, with the expected value reaching $0.713 in the following week. However, technical indicators suggest a prevailing bullish sentiment, complemented by a Fear & Greed Index reading of 70 (Greed).\n\nNotably, SUI crypto has seen 19 out of the last 30 days (63%) marked as green, showcasing a 12.01% price volatility during this period. Considering these factors, our price forecast suggests that the current market conditions present a favorable opportunity to consider buying SUI. Investors and enthusiasts are likely to keep a close eye on this emerging coin as it establishes its presence in the market.\n\nTerra (LUNA) Price Analysis\n\nTerra has experienced substantial gains in the recent 7-day period. Priced at $0.8036, LUNA has seen a 0.64% increase in the last 24 hours and a remarkable 73.3% in the last week. Should the bulls succeed in surpassing the resistance threshold of $0.8752, LUNA is poised to recover momentum and position itself for a forthcoming challenge of its higher resistance level at $0.8429. Sustaining the price at this level will lay the groundwork for a potential endeavor to test the resistance at $0.900 in the upcoming week.\n\nConversely, in the event of a market trend reversal, the LUNA price may lose its upward momentum, prompting a descent to examine the support level at $0.6207 in the near term. Furthermore, if bearish forces persist, a more substantial decline could unfold, leading to a test of the lower support level at $0.5462 within this month. Traders are advised to closely monitor these key levels for strategic decision-making in the dynamic market.\n\nFTX Token (FTT) Price Analysis\n\nFTX Token, the native utility token of the FTX exchange, has exhibited remarkable growth in the last week. Priced at $3.505, FTT has dipped by 10.3% in the last 24 hours and an impressive surge by 210.10% in the last 7 days. While the FTT token’s upward trajectory persists, it encounters resistance at $4.3648, which may lead to a subsequent period of sideways trading. The commencement of November brought a bearish tone with the legal issues surrounding Sam Bankman-Fried (SBF), causing a dip in prices.\n\nAlthough the market initially suffered a breakdown below its support level, momentum was restored, allowing the price to reclaim its position. During a brief period, the MACD exhibited a consistent flatline, followed by a significant surge in momentum, indicative of substantial price action for the FTT token. Additionally, the chart reveals a rising green histogram, signaling the likelihood of continued value appreciation in the upcoming days.\n\nConclusion\n\nThe cryptocurrency market continues to be dynamic, with each coin showcasing unique price movements. Investors and enthusiasts must remain vigilant, considering both short-term fluctuations and long-term trends. As the market evolves, staying informed about the factors influencing each cryptocurrency’s performance is crucial for making well-informed investment decisions."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9DX2hYXzhOZ3ctNDJaMmo0dExmT1h3Z1BBbFJTMDJzRUo4SHVVWHM0Y0JNSC1mQW9LdHFRQm54WV9OSG8zOUtuay1INHJvWjV1OU1YWl9DeUtPM2FrcjR6OXVKZXVZX1lTa3NmLW9UOG4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "We're Launching X Layer, a New zKEVM Layer-2 Network, Built with Polygon CDK - OKX",
        "content": "X Layer connects our 50m+ users with massive global Polygon and Ethereum builder communities\n\nThis collaboration also sees us becoming a core contributor for Polygon CDK, committing engineering and other resources to scaling Ethereum\n\nX Layer to be our new native network\n\nIn a landmark strategic collaboration, we, a global-leading crypto exchange and Web3 ecosystem, and Polygon Labs, a leading international blockchain software technology company, today announced the launch of the testnet for 'X Layer,' a new, highly performant and secure Ethereum-based Zero Knowledge (ZK) Layer-2 (L2) network, built with the Polygon Chain Development Kit (CDK).\n\nDesigned with developers in mind, X Layer enables anyone to build on its on-chain ecosystem and will drive the future of Web3, attracting builders across DeFi, enterprise and other verticals by connecting our more than 50 million users with the Polygon and the Ethereum communities - two of the biggest globally in Web3 in terms of developer participation.\n\nAdditionally, and as part of the collaboration between us and Polygon Labs, we will become a core contributor to Polygon CDK, and will invest substantial engineering resources to enhance the technology stack for Ethereum scaling solutions.\n\nX Layer will serve as our new native network and will provide users and developers access to the world’s biggest blockchain ecosystems. X Layer’s native token will be our platform token OKB, which will be used to pay for gas fees on the network.\n\nA state-of-the-art, user-friendly protocol for builders, creators and Web3 enthusiasts, X Layer utilizes ZK proofs, making it highly secure and scalable while also reducing transaction costs. The network is compatible with Ethereum, allowing seamless and secure deployment of EVM-based DApps and connectivity with a broad spectrum of smart contracts, wallets and tools.\n\nOur Chief Innovation Officer Jason Lau said: \"X Layer will be a key pillar of our efforts to educate and bring our users onchain and into the world of Web3. This scalable and accessible network is perfect for developers, who can build on X Layer to deliver user friendly world-class consumer Web3 applications, all while maintaining interoperability with other networks and ecosystems. By collaborating with Polygon Labs, we look to bring more builders, more use cases, and ultimately the mass adoption of Web3.\" Polygon co-founder Sandeep Nailwal said: \"The X Layer network offers developers an affordable and user-friendly platform to create decentralized apps, seamlessly bridging the vast OKX community with the Polygon and wider Ethereum ecosystems. The utilization of Polygon CDK technology represents a significant leap forward, enabling developers to design and deploy ZK L2 solutions on Ethereum with ease. Looking ahead, Polygon CDK-deployed chains can interoperate and coexist within a larger network of ZK-powered L2s in the Polygon CDK ecosystem. We’re excited to collaborate with OKX's team to advance this technology and drive the success of the X Layer network.\"\n\nPolygon CDK launched in late August and allows enterprises and developers to launch ZK-powered Layer 2 chains on Ethereum, offering infinite scalability and unified liquidity. Many tech and enterprise companies have announced plans to build their own Ethereum ZK L2s, including Astar (the largest chain from Polkadot), Canto (the largest public common chains from Cosmos), Gnosis Pay, Palm and IDEX. In the coming weeks, we and Polygon Labs will announce more details on the collaboration, as well as upcoming developer events. Connect with X Layer X | Discord | LinkedIn | Web\n\nAbout Polygon Labs:\n\nPolygon Labs develops Ethereum scaling solutions for Polygon protocols. Polygon Labs engages with other ecosystem developers to help make available scalable, affordable, secure and sustainable blockchain infrastructure for Web3. Polygon Labs has initially developed a growing suite of protocols for developers to gain easy access to major scaling solutions, including Layer 2s (zero-knowledge rollups), sidechains, app-specific chains and data availability protocols. Scaling solutions that Polygon Labs initially developed have seen widespread adoption with tens of thousands of decentralized apps, unique addresses exceeding 350 million, 1.6 million smart contracts created and 3 billion total transactions processed since inception. The existing Polygon network is home for some of the biggest Web3 projects, such as Aave, Uniswap, and OpenSea, and well-known enterprises, including Robinhood, Stripe and Adobe. Polygon Labs is carbon neutral with the goal of leading Web3 in becoming carbon negative.\n\nIf you're an Ethereum Developer, you're already a Polygon developer! Leverage Polygon’s fast and secure txns for dApps you develop, get started here.\n\nWebsite | Twitter | Developer Twitter | Telegram | LinkedIn | Reddit | Discord | Instagram | Facebook\n\nAbout OKX\n\nOKX a global leading technology company building the future of Web3.\n\nAs a top partner of English Premier League champions Manchester City FC, McLaren Formula 1, Olympian Scotty James, and F1 driver Daniel Ricciardo, OKX aims to supercharge the fan experience with new engagement opportunities. OKX is also the top partner of the Tribeca Festival as part of an initiative to bring more creators into Web3.\n\nThe OKX Wallet is the platform's latest offering for people looking to explore the world of NFTs and the metaverse while trading GameFi and DeFi tokens.\n\nOKX is committed to transparency and security and publishes its Proof of Reserves on a monthly basis.\n\nTo learn more about OKX, visit: okx.com"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNbUVRN3RXZHJpVWNicDhIajBlcWVoV1RpVHpmTnlTQmdxV2dOUVA1eGhiMTd5WVlxV0lwcm1FRmY1b0FzeEk3UUhOcE9FUkUxWEEzcVVIcW9WdFBYTUNKS0lkd29nYzRPQWhQUFZtS3N5aHd1WjhCWHBNbFhlbzh1U21IblAwQ2lHTDNOc19VMzkxdGxQWW0tbUhiN0p0Yl9XVlVBdjRrdDNVV0xPUjJNMjE5NkJaSHkzSUxsSVF30gHCAUFVX3lxTE1zNzVwTWhocUtoS0NhQWVMVEt6N2I4NlNsR016Wmg4U2FSWnY1VEJZSTA1ZkQ3SFI2QU00dDY3c3Jsb290dWUwSGY2NGpCZ1lMWGVuMF8wd2hDME5Sc1dBUFVralFXTTBSR0lsTC1faGVpSVZ0T1dOSHpUTHZLSmx4VE4xQWZCRmZhZzZPNE8xdHlneGZTRFpIVHJqOVZwaGo1NFBmemdiYTI5MkRmcG9wOGlfdXhULU9hWXh4MThhZXhR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Render Network Migrates from Ethereum to Solana as SOL Ecosystem Continues to Expand - CoinCodex",
        "content": "Key Highlights:\n\nRender network unveils successful migration to the Solana network, and bids farewell to Ethereum.\n\nIn a bid to make the migration process an easy and convenient experience for users, the Render Foundation has offered 1.14 million RNDR tokens to incentivize token holders.\n\nSolana ecosystem continues to expand after seeing an impressive surge of +144.00% in the last one month.\n\nRender Network, a leader in the decentralized computing space, has just experienced a massive shift within its ecosystem as the platform announces successful migration from Ethereum to the Solana network.\n\n“We’re thrilled to welcome Render to the ecosystem, making it the latest project to fully migrate their network to Solana,” Ryan Shea, Advisor to the Render Foundation expressed excitement on the company's latest move.\n\nThis remarkable upgrade comes after the platform considers a need to leverage Solana's exclusive use cases while avoiding the high gas fees offered on the Ethereum network.\n\nIn essence, while the Render network has successfully upgraded its core infrastructure to the Solana blockchain, users of Render can now explore several use cases on the network without the need to bother about high transaction fees.\n\nWhy Solana?\n\nAccording to the announcement, the company believes that Solana's incredible features in collaboration with its core infrastructure has the potential to unlock significant and exciting opportunities for the Render ecosystem.\n\nThis may include crucial new capabilities like real-time streaming and dynamic NFTs, creating a whole new experience for the Render community.\n\nMoreso, the company has also emphasized that Solana's superior speed, cost-effectiveness, and scalability, aligns suitably with Render's expansive vision. Hence, the big transition to Solana will mark a remarkable stepping stone towards achieving its vision.\n\nThe Render Network is committed to building a scalable and decentralized metaverse infrastructure. Thus, Solana’s incredible transaction speeds, low costs, and commitment to web-scale architecture appears promising to facilitate the actualisation of the stated goals.\n\nRyan Shea, Advisor to the Render Foundation, acknowledged this noting that:\n\n“Solana is the home of DePIN, and Render Network is one of the most important DePIN networks in existence today. Solana will help extend Render Network into new applications, such as machine learning and inference training, and unlock new utility through Solana’s best-in-class technologies like compressed NFTs, on-chain order books, and real-time oracles.”\n\nRender Offers 1.14 million RNDR as Incentives to Aid Token Transfers\n\nPer the announcement, users of Render who hold the RNDR token can now proceed to transfer their tokens to the Solana blockchain.\n\nIn a bid to make this an easy and seamless experience for users, Render Network has launched an Upgrade Assistant and Incentive program. It also announced the allocation of 1.14 million RNDR in grants to subsidize the high transaction fees charged on Ethereum.\n\nNotably, the Upgrade Assistant program will offer users the opportunity to transfer their RNDR tokens to Solana blockchain easily with a guarantee on safety and trustless upgrade process using the Wormhole protocol.\n\nMoreso, through the Upgrade Assistant, users have been encouraged to transfer their tokens from the Ethereum network to Solana as soon as possible as early migrators will be awarded a share of the 1.14M RNDR. Notably, holders who do not transfer their tokens within the specified period of three months, will have to pay their own gas fees to migrate RNDR tokens to the Solana blockchain when the period elapses.\n\nSolana Ecosystem Continues to Expand as it Welcomes Render\n\nRender's integration with the Solana ecosystem marks a significant addition to the continuous improvement the network has been witnessing lately.\n\nThe Solana market performance has been on the bright side for several months, with the SOL price showcasing an impressive surge of +144.00% in the last one month.\n\nAlthough the SOL price has decreased by -6.66% in the last 24 hours, the network still retains a bullish sentiment, seeing it outperform the Ethereum network. While Solana has impressively risen by 15.89x against Ethereum, it appears that this may continue to be the case following Solana's recent collaboration with Render Network against Ethereum.\n\nThe transition of Render between Ethereum and Solana implies that there will be a reduction in the use of the Ethereum network, while the use of Solana will be increased as it will see new adoption from the users of Render.\n\nNonetheless, the Render Network has also instructed that while the ETH token ($RNDR) will remain, it will no longer be maintained by Render Foundation and won't function on the Render Network."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOUU1HZW9xcWdtZzE1U2hmNTRhWGdyVkhDSDdJakFUT2t0NF9xQlVtNUhGS19BajFtVGxPNHUxWUJlN1E0bnFnMGx5b19oRHo2MXBzSl81WUFvQ3BTVFdUaXJiM1ZCSndmY1VENmJ1dUVDcjBWaGVuMDJ1ZWk0QTM5dGJZeU80eHNCOHd0YllMaFQ5Rko3YWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Analyst says ETH could spike to $3,100 if key resistance breaks - CoinJournal",
        "content": "Ethereum is looking to break above a key resistance level at $2,150.\n\nCrypto analyst Michael van de Poppe says ETH price could jump to between $3,100 and $3,600 if a breakout happens.\n\nCatalyst for the market include a spot Bitcoin ETF approval and developments on Ether spot ETF applications.\n\nEthereum (ETH) traded to highs of $2,136 last week, before giving up some of the gains over the weekend to touch $2,016.\n\nThe top altcoin has however seen an uptick on Monday, rising to change hands around $2,120 as buyers looked for a first green candle in three days.\n\nVarious market observers see a potential approval for a spot Bitcoin ETF as a catalyst that could catapult both BTC and ETH. While many experts opine that the most likely period for approval is early January, there’s a window for the SEC to greenlight the first spot Bitcoin ETF for the US market.\n\nThis window is open until November 17.\n\nReminder: There is currently a window open this week for an early approval of the $BTC etf through the 17th. in addition last week blackrock filed for a spot $ETH etf If the BTC etf is approved, expect both to fly pic.twitter.com/DbWWa68UAj — Pentoshi 🐧 euroPeng 🇪🇺 (@Pentosh1) November 13, 2023\n\nAnalyst on what next for ETH if resistance breaks\n\nFor one top analyst, ETH/USD faces a major hurdle near $2,150 – break this and the price of the world’s second largest cryptocurrency by market cap could surge to the next supply zone around $3,100. Above this would be the key resistance at $3,600.\n\nThe prediction thus forecasts a 44%-67% price jump for Ethereum if bulls break higher.\n\nAccording to Michael van de Poppe, the highlighted resistance at $2,150 is comparable to the massive wall that rebuffed numerous bullish attempts for Bitcoin (BTC) at $30,000. Sharing his prediction with more than 672k followers on X, the founder and CEO of crypto trading group MN Trading wrote:\n\n“Ethereum faces the final resistance. Breaking above $2,150 marks the end of the bear market, as this level is comparable to the $30,000 barrier of Bitcoin. If it breaks, then we’re likely seeing a run towards $3,100-3,600.”\n\nVan de Poppe shared a price chart for Ethereum showing an ascending triangle pattern, which in technical analysis, signals a potential bullish breakout. The chart marks the two anticipated primary resistance zones as shown below.\n\n#Ethereum faces the final resistance. Breaking above $2,150 marks the end of the bear market, as this level is comparable to the $30,000 barrier of #Bitcoin. If it breaks, then we're likely seeing a run towards $3,100-3,600. pic.twitter.com/i91ULBRtLz — Michaël van de Poppe (@CryptoMichNL) November 13, 2023\n\nEther was trading around $2,093 on Monday evening, 2.4% up in the past 24 hours. The cryptocurrency’s value shows an 11% and 35% surge in the past week and 30 days respectively."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiS0FVX3lxTFBOeHRUeHFQUnVvMFRsbWNYbzhJRlRKWThqS0xBNXJyX1duUjB3dTgxR1pNcHk1c0FxM1lvUTBoQW9FNVNQWGlCYmMxMNIBQkFVX3lxTE9VY3Qxclc0ZlNzS3NxM3hBTHYzdjRQX0FnN1lzcG9weTVBZ2RmTFhrc2RUTWpEUW5LYUlKbXRpdlRDdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Transaction Fees Soar, Ethereum Follows In Bitcoin Traces - VOI English",
        "content": "JAKARTA - Transaction fees for bitcoin (BTC) and ethereum (ETH) have seen a significant increase in recent weeks. This shows the high activity of crypto transfers on onchain networks, which also has an impact on other operating costs such as exchange, bridging, and NFT.\n\nReporting from Bloomberg, the average cost for bitcoin transactions peaked at 15 US dollars (Rp234,825) per transfer on November 9, 2023, a sharp increase from US$3.5 (Rp54,795) on October 22, 2023. Similarly, the average cost for Ethereum transactions jumped by 219% in the same time range, up from US$2.08 (Rp32,564) to US$6.64 (Rp103,824) per transaction.\n\nEthereum transaction fees (ETH) on November 12, 2023. The average fee reached a maximum of 10.52 US dollars (Rp164,556) on November 9, 2023. Crypto transaction fees are a reward paid by the sender to the miner or validator who processes and confirms transactions on the blockchain.\n\nThe transaction fee is determined by demand and supply in the market, as well as the complexity and size of the transaction. The more transactions occur on the network, the higher the cost that must be paid by the sender to ensure their transactions are prioritized.\n\nHigh transaction fees show that crypto networks are experiencing congestion or capacity constraints, which can reduce their efficiency and scalability. In addition, high transaction fees can also reduce crypto appeal as a cheap and fast means of payment, especially for low-value transactions.\n\nThe Impact Of High Transaction Fees\n\nThe high transaction fee does not only apply to crypto transfers, but also for other types of operations carried out on blockchain, such as being involved with smart contracts, decentralized exchange platforms (dex), decentralized financial solutions (DeFi), and non-fungible tokens (NFT).\n\nFor example, exchanging ETH-based assets on a dex platform can cost from 27.77 US dollars (Rp 434.118) to 28.50 US dollars (Rp 445,388) per transaction. Meanwhile, the cost of making NFT transactions fluctuates between 46.93 US dollars (Rp 733,636) to 48.16 US dollars (Rp 752,304).\n\nIt also has an impact on increasing costs for transferring assets across different chains via bridging, which is estimated to be around $8.93 (Rp139,485) to $9.17 (Rp143,307) per transaction. Bridging is a process that allows crypto assets to move from one blockchain to another, for example from ethereum to smart chain binance.\n\nFrom October 22, 2023 to November 11, 2023, ethereum has processed an average of around 1,071,448 transactions daily. This number is still lower than the record high of around 1.4 million transactions per day achieved in May 2021, when NFT and DeFi activities were booming.\n\nWhile ethereum is still the second largest blockchain after bitcoin by market cap, high transaction fees show that ethereum faces challenges in competing with other blockchains offering lower transaction fees, such as solana, avalanche, and polygons.\n\nThis blockchain-blockchain uses a different consensus mechanism from ethereum, which currently uses proof-of-work (PoW) which requires a lot of computing power and energy. Ethereum has made a transition to proof-of-stake (PoS), which is expected to increase its efficiency and scalability, as well as lower transaction costs.\n\nMeanwhile, bitcoin, which also uses PoW, still leads ethereum in terms of market cap, daily trading volume, and transaction fees within 24 hours collected by miners.\n\nThe English, Chinese, Japanese, Arabic, and French versions are automatically generated by the AI. So there may still be inaccuracies in translating, please always see Indonesian as our main language. (system supported by DigitalSiber.id)"
    }
]