[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQdjZLdDlpLTd1c1lHUWJrbkN4b0xBQVhBWDdUaVFmMndDN0RCYzBuNW9zY29IcE1PbFAzV1BZV1dFd2t6V2VEdGpVLVY1eFp4OUk2M1hzdVZLX2lNTkd5ZlpDZG5neWRTdlBEdGJWY29hWmhXeFhxVU41MDlqSnZDQ29zTnFFZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "The latest assessment of public Ethereum’s readiness for enterprise usage - Ledger Insights",
        "content": "In the middle of last year, the Enterprise Ethereum Alliance (EEA) assessed the readiness of the public Ethereum mainnet for enterprise use cases. It concluded it was ready but with a few caveats. Today the EEA published its latest assessment, reducing its caveats.\n\nLike the previous report, the paper doesn’t sugarcoat the challenges. But it does come across as pretty bullish.\n\nThat said, it surprisingly undersells itself in one important area. It describes the advantages to business as the “strong ecosystem, security, and decentralization.” The reference to the strong ecosystem is a bit of an understatement. The consumer reach of public blockchain, and Ethereum in particular, is like a magnet for financial services firms seeking global distribution. Private blockchains do fine for institutional usage.\n\nThis is one of the reasons why so many institutions are exploring public blockchain, including SWIFT, Standard Chartered, HSBC, Citi, UBS and and JP Morgan. Asset managers are leading the way with Franklin Templeton’s high profile blockchain money market fund – although the biggest chunk of that is on Stellar.\n\nOne massive Ethereum accomplishment since the previous assessment was “The Merge”, Ethereum’s move to Proof of Stake (PoS) which addressed the environmental concerns.\n\nNonetheless, the EEA acknowledges that PoS comes with downsides. Businesses are probably a little less concerned about the possibility of greater centralization. But the potential to exclude or reorder transactions (frontrunning) to achieve Maximal Extractable Value (MEV) is recognized as a challenge for business.\n\nPrivacy and scalability\n\nPrivacy and scalability are two of the biggest issues. The takeup of Layer 2 solutions has grown enormously in the past 18 months, which addresses scalability and costs. However, that also comes with some tradeoffs. One of the biggest criticisms of private blockchains is fragmentation, which is happening because of numerous layer 2 solutions. They also add complexity but, at the same time, provide more choice.\n\nThe one upside is bridges that enable interoperability for layer 2 solutions can be more secure than cross chain bridges, but are still a risk. In 2022 the value lost in hacks was $3.8 billion, according to Chainalysis, with bridges making up the majority.\n\nBeyond layer 2 solutions, scalability will be addressed at the mainnet level with Ethereum’s plans for sharding.\n\n“Privacy remains a paramount concern, particularly in the context of Ethereum’s application in business and financial systems,” the report says. “As a result, many opt for private chains, which pose their own set of challenges, including the complexities of maintaining nodes and establishing trust among participants.” However, increasingly privacy is addressed with zero knowledge proofs and other privacy enhancing technologies. Over time their scalability is being addressed.\n\nEY’s Paul Brody did a good job of managing expectations. “The most consistent thing missing from every analysis is a reasonable sense of timeline,” he wrote. “The blockchain industry is far too big to go back to the days of 100-200% annual growth. That’s not sustainable.”\n\nHe concluded, “This is a multi-decade project, and if we want to sustain our enthusiasm and our energy to complete this transformational and valuable task, we need to calibrate our expectations accordingly.”\n\nThe author holds nominal amounts of Ethereum for experimentation."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPOGU5dFNyODdxYWhKZUxycTFDRzlEaWJCaWlVbzR6aUN1ellFZzFRa0lxaTBEc2hMaUV3Y29YdnU0aFAwTElZdzRXVE82dzA4Z1F0NFpmMFpJSFFKLTV2ZmpTcVBCeVlGdWFRanpXckw2ekV5aXFqN0ZKWnlWRmhnelVHd3YyN2FCbzRtTktna0RrT0pXT3hBWEUwaDBsSkg3bWlWMmtOQ2FTNXBDOUtpU2tuX2tCYlJZallZdHl0Y9IBxAFBVV95cUxPSkpwUWlVYlpWdVMwekNCVHdTblBmbmpObTBXMVBMTjV5aEEzSTZQYmszSjU1SVdiLXZYZjNpSG9ReXhUZnZSNkxJZUxUc0FfVlJWTDVmc1k0dk8xUEpyb25ZNG9wcURDV1VuOTE0U1k0OGVJcldqLWdiU0R2S0VTYjQxNlNGM0kySFBsZkNRRWpzbUlfVEdQblExOC1rTXdEUUZFWW5TcURSVW94N1FHRlVudzRZdkp1UU1FcVBJQjJvaGNG?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Developers Target January for First Testnet Deployment of Next Big Upgrade, 'Dencun' - CoinDesk",
        "content": "“Obviously if we find a major issue or something crazy before then we can always cancel,” Tim Beiko, protocol support lead at the Ethereum Foundation, said on the call. “This would mean ideally we’re putting out the blog post for the fork sometime during the week of Jan. 8, so people have at least a week to update.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5IN2FHeXVLaWJoN0FLYWRpM3Q5eFdGemxtNkxmdzZMVVRWZFFVLVpRS1F1eEdZNHRzUXdVUUhlZEQxbDhoQVdwcC04VlBTMmFISG9SdUtablFRcWFhWjQyU3I4SDZIUkNWQm85ZHFBVkRHQUg2WnJaNlJ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Buterin, Coinbase and more to fund Ethereum decentralization grants - Blockworks",
        "content": "The PBS Foundation is opening applications for an initial $1 million in grants for research and development on Ethereum proposer-builder separation.\n\nThe non-profit’s pilot phase drew support from Coinbase, Consensys, Fenbushi Capital, Flashbots, Paradigm, the Uniswap Foundation and Vitalik Buterin.\n\nGrants will be disbursed by a council. The council includes representatives from Blocknative, Consensys, the Ethereum Foundation and Flashbots, among others. The foundation’s grant lead is Eugene Leventhal from the research group Metagov.\n\nRead more: For Ethereum rollups, dealing with data remains a bottleneck\n\nFirst proposed by Ethereum founder Vitalik Buterin, proposer-builder separation (PBS) is the concept of separating proposers — which submit transaction bundles to validators on a blockchain — and builders, which organize the transactions in a specific order.\n\nPBS represents an attempt at decentralization, as the combination of proposing and building gives well-heeled centralized mining pools a competitive advantage.\n\nPBS first went into effect after Ethereum’s Merge to proof-of-stake. Now, the PBS Foundation aims to promote research and infrastructure to address some of the challenges the concept currently faces.\n\nNotably, MEV-boost relays have become centralized since the Merge. Relayers operate between block builders and validators on maximal extractable value (MEV) boosted transactions, selecting blocks with the highest possible fees. Roughly 90% of transactions in the last 500 epochs, or roughly two days, made use of MEV-boost. Of MEV-boost transactions in the past 24 hours, roughly 97% have been handled by five relayers, according to relayscan.\n\nBlocknative, once among those top relayers, discontinued its service in September, citing economic viability concerns. Relayers do not currently collect fees. Uri Klarman, CEO of bloXroute, which runs a large relayer, has advocated fee structures outside of public goods funding to incentivize more relayers to join the fray.\n\nA spokesperson for the PBS Foundation said the grant funding could be used to fund relayers, with a particular emphasis on those who introduce novel designs for relaying.\n\nThe funding will also be focused on community and educational materials, data transparency on Ethereum’s mempool and blocks, and research on how PBS can be improved — or even enshrined — on both the primary network and on layer-2 networks.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPWjhuNHBlczYzSGhKdnZDVmQyS21IcnZNSEU1cDJ1N2xaRnpIVnFEXzFzZ0FDOEM3SGFVaHU4MjNFN2ctNzBlaXZQX2xrdUdUMXFoN0t6ejB6MFJCOTJCV0d2VHlaQl9yaS1kN253OXZldEZ5a1FUUWtybzkxRHR0bVN6Vzk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Solana’s DeFi DEX Volume Surpasses Ethereum’s For the First Time - Yahoo Finance",
        "content": "Solana’s DeFi DEX Volume Surpasses Ethereum’s For the First Time\n\nSolana (SOL) has achieved a significant milestone by surpassing Ethereum (ETH) in terms of decentralized exchange (DEX) trading volume over the past week. According to DefiLlama, DEX volume on Solana soared to $10.1 billion over the last seven days, while Ethereum recorded $8.8 billion in volume during the same period.\n\nSolana's recent surge in DEX activity can be attributed to its lower gas fees compared to Ethereum, and rise of memecoin trading. The chain’s leading memecoin, BONK, dominated headlines after its meteoric rise to over a billion-dollar market capitalization, following Binance and Coinbase listings. Another Solana memecoin, Dogwifhat (WIF), has also captured attention, skyrocketing from obscurity to reach $322 million in market cap. BONK and WIF are among the top traded tokens on Solana DEXs over the past week, excluding stablecoins.\n\nThe success of these memecoins and heightened activity, coupled with major airdrops from protocols like Jito (JTO), have contributed to SOL's impressive rally, with the token flipping XRP and reaching a new 2023 high of $99, according to CoinMarketCap data.\n\nHowever, despite recent gains, SOL's market cap currently sits just above $41 billion, while Ethereum remains has a market cap of $268 billion, more than seven times larger than Solana.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxObjFVNF82dEwtUTFOdXJDTjJUTkt0ekFtNFh0TGg3SHpaNllURWw2bU1Ecm01NFk0QlRJeDljdm9hRFNtX0FsUDR5RTJHdDF4NUp2UV9HX3VweVZqYTdPZmpzamRpVlBjZmNDMm5XZlVuczNYYy1kR0kteExnbGozcXRNYmF6X3JXZWdlQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Solana Surges to $84, Flips Ethereum in Weekly DEX Volume - Unchained",
        "content": "Solana’s native token rallied 13% over the last 24 hours, while the blockchain overtook Ethereum in seven-day DEX trading volume.\n\nIt may not be altcoin season just yet, but one of them has already doubled Bitcoin’s percentage gains over the last year.\n\nSolana’s native token SOL is up 580% over a one-year period, gaining 13% in the last 24 hours to trade at $84 at the time of writing.\n\nDaily trading volume for the token was up a whopping 108% to $3.9 billion, making it the third most traded crypto asset outside of Bitcoin, Ethereum and stablecoins like USDT and USDC.\n\nRead more: Solana Mobile Is Making a Second Crypto Smartphone\n\nActivity on the blockchain has also picked up significantly over the last week, with data from DeFiLlama showing that decentralized exchange (DEX) volume on Solana surpassed Ethereum over the last seven days.\n\n🚨BREAKING: Solana Overtakes Ethereum in Weekly DEX Trading Volume for the First Time Ever Solana Now Becomes No. 1 Chain for Both NFT and DEX Daily and Weekly Volume pic.twitter.com/w6dSuEtcUu — SolanaFloor (@SolanaFloor) December 21, 2023\n\n\n\nEarlier this week, Unchained reported that Solana had taken the lead in daily stablecoin transfer volume, which has grown 600% to $16.6 billion since the start of December.\n\nInstitutional data platform Artemis attributed the uptick in the blockchain’s usage to growth of memecoins like BONK and WIF, which created more room for retail activity evidenced by the high number of daily active addresses on the network since the summer of 2022.\n\nThe dog-themed memecoin BONK now has a market capitalization of $1.2 billion, and those cashing out of their holdings will typically convert their coins back into SOL creating a fair amount of buying pressure.\n\nRead more: Paxos Bringing Stablecoin Issuance on Solana, Diversifying Beyond Ethereum\n\nIt is worth noting that the bankruptcy estate in charge of crypto exchange FTX has been approved to sell its $3.4 billion in crypto holdings, of which $1.16 billion is in SOL.\n\nEarlier this month, a wallet associated with FTX unstaked $90 million worth of SOL and sent it to Coinbase, presumably with the intention to sell, meaning that the token has been able to withstand a large amount of selling pressure coming from the exchange’s liquidation plans."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQc29lV3g1c0lVNkxQcWJjTHQ1T1hrYnJySzV4UERqZGxPbnphcEh3bDd4MFJxdi1OZlV6WnUtV1dGMW9EZDd2LVlhTkdwWlNDNTJ4UWVpTUp5cG95ZWR6LTdjVmpDclNoemducTZBYjEzT3lmMnlqSWxxM0FVdll6cTJubw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Ethereum’s Dencun upgrade set for 2024 testnet launch - CryptoSlate",
        "content": "Ethereum developers have tentatively decided on Jan. 17, 2024, for the upcoming “Dencun” upgrade’s first testnet deployment during the latest bi-weekly dev meeting on Dec. 21.\n\nOriginally slated for the last quarter of 2023, the ‘Dencun upgrade was pushed to 2024 due to the engineering complexities involved.\n\nTim Beiko, the protocol support lead at the Ethereum Foundation, noted that the date is not set in stone and could change if major issues arise. The team aims to release a blog post detailing the fork during the week of Jan. 8, 2024 — giving stakeholders a week to prepare for the update.\n\nDencun upgrade timeline\n\nThe meeting set out a draft timeline for the testing phase of the Dencun upgrade.\n\nFollowing the Goerli testnet on Jan. 17, 2024, developers plan to run tests on other networks — Sepolia on Jan. 31, 2024, and Holesky on Feb. 7, 2024.\n\nThe developers aim to deploy the changes on the mainnet by the end of February 2024 if everything goes smoothly. However, these dates are subject to change based on the results of the testnet forks.\n\nDencun will be Ethereum’s first major upgrade since ‘Shapella’ earlier this year, which was a significant milestone in itself, enabling staked ether (ETH) withdrawals from the blockchain.\n\nSimilarly, a major aspect of the Dencun upgrade is the implementation of “proto-danksharding.” This new process is designed to enhance Ethereum’s capacity for data storage, a move that is expected to reduce fees for Layer 2 rollups and scale the blockchain by increasing space for “blobs” of data.\n\nBy improving data handling capabilities and efficiency, it aims to enhance the performance of rollups and, consequently, the overall throughput and affordability of the Ethereum network.\n\n“Layer 3 app-chains”\n\nIn addition to the Dencun upgrade, the meeting also highlighted a collaboration between Avail and StarkWare. The partnership aims to augment data availability for appchains within the Starknet Layer 2 network. Leveraging Madara, a customizable sequencer, this initiative seeks to develop app-chains that will function as Layer 3 solutions within the Starknet ecosystem.\n\nThese Layer 3 app-chains, powered by the combined efforts of Avail and StarkWare, aim to revolutionize data availability modes, including validium and sovereign rollups. This, in turn, will help optimize transaction processing efficiency and finality, which is crucial for blockchain scalability.\n\nThe developers also touched upon Ethereum’s role in the broader context of decentralized finance (DeFi) and blockchain technology. They reiterated their commitment to maintaining Ethereum’s position as a leader in the space, emphasizing the need for continuous innovation and adaptation to meet the ever-evolving demands of the market.\n\nThe meeting also provided a platform for developers to discuss the challenges and opportunities that lie ahead for Ethereum. From addressing network congestion issues to enhancing user experience, the developers explored a range of topics that are critical to Ethereum’s roadmap and its users’ needs.\n\nMentioned in this article"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOVmFNSThMd2ZpamUzS2dNNy1Sd3ZXekFOZG1mWm8tY1Rnb1dNM1c0S0xPMmlTNnVUUXM2dm00aHBGcElVbVhDcDFrX1BzZUJZNzdNbGdvT1BVNlR4dUg5U005WURjQ1NEV1FkVGdROEszRXJMRjR0MXlMT3IzQ19wZkxsTjVJbXJuREZMLWhUQnpDRzNLT3hLV2ZSYV9SSHpSRjZOZ1A2ZTlUWHFZNF9FbHcwMy1aUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Exclusive: NY financial regulator approves Paxos expansion to Solana, allowing for its first stablecoin issuance beyond Ethereum - Fortune",
        "content": "The leading stablecoin issuer Paxos has received regulatory approval to expand its products to the Solana blockchain, which it plans to launch on Jan. 17, 2024.\n\nWith peers including Circle and Tether vying for critical market share, the expansion is a major step for Paxos, which touts its relationship with the New York Department of Financial Services (DFS).\n\n“Paxos is the most regulated stablecoin issuer in the world,” Walter Hessert, head of strategy at the firm, told Fortune in an interview. “We are the only company that has been issuing regulated stablecoins at scale—period.”\n\nStablecoin wars\n\nCofounded by financial veteran Charles Cascarilla, Paxos became the first crypto firm to receive a trust charter under the new digital asset regulatory regime implemented by DFS in 2015. To this day, DFS remains the sole U.S. financial regulator to implement a comprehensive framework for crypto, which has attracted a number of leading companies, including Coinbase and Gemini.\n\nPaxos received DFS approval to issue its first stablecoin in 2018, which it called Paxos Standard, rebranding the token to USDP in 2021. Stablecoins are a type of crypto token pegged to an underlying asset—in this case, the U.S. dollar. Unlike the other leading USD-pegged stablecoins Tether and Circle’s USD Coin, Paxos only issues USDP on Ethereum owing to restrictions from DFS.\n\nPaxos has argued that its commitment to working directly with DFS on issuance, rather than operating outside the framework of a financial regulator, sets it apart from competitors. While Tether is often critiqued for its offshore, opaque operations, Circle also presents itself as following U.S. regulatory standards, although it does not issue USDC under DFS supervision. As a result, Circle offers USDC across more than a dozen blockchains, including Tron, which has come under fire in recent months for facilitating illicit finance.\n\n“From a growth perspective, you’d like to issue across every single chain,” Hessert said. “Circle and other players can issue on to other protocols, but no one knows who’s overseeing it—or what their process is.”\n\nHe argued that Paxos’s approach helps gain trust with its partners, including major financial players like MercadoLibre, PayPal, and Mastercard, that customer protections are in place.\n\nEven so, Paxos has had its missteps. One of its first stablecoins, BUSD, was issued in partnership with leading crypto exchange Binance. After reports surfaced that Binance was creating a synthetic version of the stablecoin with questionable reserves, DFS ordered Paxos to stop issuing the token. As Fortune later reported, over 95% of Paxos’s revenue came from that partnership.\n\nHello, Solana\n\nPaxos received a “non-objection” from DFS to expand USDP from Ethereum to Solana, after what a spokesperson described as an “extensive and exhaustive review,” although the firm declined to specify how long the process took.\n\nWhile Hessert declined to say what type of information DFS required for the Solana expansion, citing the confidential supervisory process, he said it involved an internal risk framework built by Paxos to assess the blockchain and its processes, including its compliance protocols.\n\nFirst launched in early 2020 with the promise of increasing transaction speeds and reducing costs compared with Ethereum, Solana became one of the most popular blockchains before taking a major hit last year owing to its association with Sam Bankman-Fried. While its native token, SOL, is still far off from its all-time high of about $260, it has gained substantial traction over the past month.\n\nHessert said Solana’s speed and cost relative to Ethereum will make it an attractive option for Paxos’s partners, who aim to implement stablecoin in use cases from cross-border remittances to payments for goods and services.\n\n“We’re actually going to start to see this new wave of adoption be enabled in ways that we haven’t seen in stablecoins yet,” he told Fortune.\n\nFor now, Paxos’s highest-profile project is its new stablecoin PYUSD, issued in partnership with PayPal. Hessert said he imagines that firms like PayPal will want to expand to Solana. Paxos’s first Solana-based offering will be USDP, which has a market cap of just $370 million, compared with nearly $25 billion for USDC and nearly $94 billion for Tether.\n\nA spokesperson for PayPal declined to comment.\n\nHessert said Paxos hopes to gain approval to issue stablecoins across other layer-1 and layer-2 blockchains, although he declined to provide specific examples."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNVl9LWWpQV0pSVkV5NDRCZi1tN0tRUXhHdm9OXzhtcWxCWndWdDVhLVlKdzMyZGtWY0dETmM2YnRscGFoSlBpSEs4R0tpY2VZSk0tdXZMWEFmWE1UN0ppVXpDZ3ZWdzVLSFZzNjRlZUc3RnpDSXJIelBBazVOZ1VhZUhBV2R2aXNTc3dYSFBVRldVSUFnLWlWQVJXZUF6TUM0MEpMR2w0elJpUlhVZGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Ethereum core devs decide on Dencun testnet schedule, soft launch slated for January 2024 - Crypto Briefing",
        "content": "The Dencun upgrade represents Ethereum's next major upgrade after the Shapella hard fork.\n\nShare this article\n\nEthereum developers have agreed on a tentative date for the first testnet phase of the Dencun upgrade.\n\nConsolidating the testnet in three phases, Ethereum developers marked January 17, 2024, for Dencun’s deployment on the Goerli testnet. The Sepolia and Holesky testnet launches are scheduled for January 31 and February 7, 2024.\n\nSo, if no major issues arise, we're looking at the following schedule: – Goerli: Jan 17, 6:32:00 UTC\n\n– Sepolia: Jan 30, 22:51:12 UTC\n\n– Holesky: Feb 7, 11:34:24 UTC … and then, mainnet 🫡 pic.twitter.com/JFRt0ZHAi8 — timbeiko.eth (@TimBeiko) December 21, 2023\n\nAccording to Ethereum protocol support lead Tim Beiko, the dates for the three testnet phases are not yet final. They are thus subject to change if developers encounter major issues during the testnet.\n\nBeiko added that a blog post covering details of the fork will be released within the second week of January 2024 to provide stakeholders with ample time to adjust to the updates.\n\nThe meeting discussed pending issues with the Dencun upgrade. In particular, the developers discussed requirements for implementing “proto-danksharding,” a process that would enhance Ethereums data storage capacity by using “blobs.”\n\nBlobs are a new type of transaction with extra space for data designed to lower Ethereum gas fees by moving rollup data from the expensive EVM layer to the consensus layer.\n\nProto-danksharding limits the number of blobs in each block (16 per block, limited to 128 KB each). This adds about 2 MB of space to each processed block. The proposal for proto-danksharding was first forwarded through EIP-4844.\n\nDevelopers also discussed recent developments for Layer 3 app-chains, particularly the recent partnership between Avail and StarkWare. Avail has partnered with StarkWare to integrate their data-availability solutions for app-chains within the latter’s Layer 2 network. The integration will use StarkWare’s Madara sequencer to build app-chains that can function as Layer 3 solutions.\n\nThe Dencun upgrade represents Ethereum’s next major upgrade after the Shapella hard fork earlier in April, which introduced staked ether withdrawals."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9UTlJJSTJPQ3lRSkpCNVFMVXZzUHVyajFyZzJqU1RmZy02NmVyc3FqWk56ZnVMelhOak13RFhGelhyNWFEeVdYLXFWWjRadHA4LThKRzQ0T1BJUGkyanp3Ym1UNlJzU0dtcUFFay0yOHBQVHUtZFNKQ2Vn0gF_QVVfeXFMT3R3dE4zVlY5LXdPTUl3NnhENHJ3ZEFvSzZZWldfaDBGdnEwMkk4RTlJUmpBT1NRSUNycU1tQXQ5VWRoWEdNVWxJOVZxTWhwZ0dwTWNYbVJXZTUydnV2dVZUZksyRTE4R3hLcU9wZXlORmV4bC1OdXVYaHB3YlpSWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price About To Bloom As ETHE Discount Rapidly Close: ETH To $3,500? - Bitcoinist",
        "content": "Ethereum (ETH) prices have been languishing below the $2,500 mark despite the strong performance of other cryptocurrencies like Solana (SOL) and Cardano (ADA).\n\nTaking to X on December 22, the CEO of Lumida Wealth, Ram Ahluwalia, has offered a theory on why ETH prices are likely to recover and reverse losses, possibly outperforming the world’s most liquid coin, Bitcoin (BTC).\n\nETHE Discount Rapidly Closing\n\nTo illustrate, the CEO pointed to the ETHE chart, whose discount has been steadily closing over the past few trading months. Ahluwalia observed a 4% gain on December 22, further reducing the discount.\n\nBased on the CEO’s analysis, this development suggests that institutional investors, most of whom chose to buy the regulated ETHE product by Grayscale to gain exposure in a regulated manner to ETH, are now opting to buy ETH on the spot market, not through a derivatives product.\n\nThis shift from ETHE to ETH spot, Ahluwalia added, could be explained by the “cheapest-to-deliver” contract theory. In the derivatives market, this theory states that a derivatives product like ETHE is the cheapest way for institutional investors to gain exposure to the underlying asset, in this case, ETH.\n\nThis is because the derivative in question, ETHE, is a futures contract that tracks the price of ETH via a regulated exchange, in this case CME.\n\nWill Capital Flow To Spot Ethereum And Lift ETH To $3,500?\n\nTherefore, based on this theory, the CEO continued that it is likely that as the ETHE discount closes, marginal flows will go to the ETH spot to capture the staking yield. For this reason, institutions are not likely to pour more funds into ETHE since “big gains” are done.\n\nAs a proof-of-stake (POS) project, users can stake ETH, helping secure the network, and as compensation, Ethereum distributes a yield of around 4.3% to validators. These operators must lock at least 32 ETH to validate a block of transactions and earn block fees. Since they have to stake, they also earn a yield.\n\nAs of December 22, there were over 28.6 million ETH staked, with the reward rate or yield at 4.32%, according to Staking Rewards. Considering how staked amount and yield are correlated, the more users choose to stake physical ETH, the lower the reward rate, or yield, is.\n\nThis dynamic will now come into play as ETHE discounts close and institutions or big players rotate funds into ETH via the spot market, possibly lifting prices.\n\nLooking at the ETH price action in the daily chart, buyers have the upper hand. However, a comprehensive close above $2,400 could lift ETH to $2,500 and later to $2,500 in a buy trend continuation pattern.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxOMlZ0dC1iUmp6S21XemVhV2EwdlpQbER1bERnZzBEdDFuV1VjMEVjOEpkTGJUaHRtQ1VqY0ZGaVhJbFpVUV93M09kX19JOHp3Nkp5QWhLUEtmZGhuN2JUN1NrMHFfdW1EaUc0dWRsRlNQc3ZleXZXbjlMX1BBNVdCRmcyd2I4OFpQMG1OelJ1M0NrZ3NTNHJSWW1FLXA3SlFzT1BIb0FMU3c3Rl84MlN4QWUzZHlRTTA1VjFXMmVUV1RSSVRqaTBJMTVlV2l5VjBvMG9TczFxdVNaV21iUHFr0gHkAUFVX3lxTE5YU1dOWXFTSENlV3YzM0FjMmJ6YXB2ZzItUU5PaHhJU3ltR05PWGJuOElQeklBX0g2U2VYejJVNEVXUnVoTUNhTnFVamJWREw1TFFyVWF4UDFEbWd1ZjVBT3BtU1lBS25GcUhFcUFpNFFEMDBPYzVmYXMwZnpZUG43Z1gwOU5DaGZyN1pjSWxtNTI5UXRqSEhONllOMWZHc2FsQVRNdjRSbklqQkVpNnlPbElXLVdWZUJyNVdhRUE5a2ZjdlJMSUZqalF1a2o2OGIyWW1McHdOSFZHNXNscGktTncyYQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Ethereum could surpass $4,000 in 2024, propelled by Bitcoin spot ETF and sharding - FXStreet",
        "content": "Ethereum price rallied by over 85% in 2023 – a similar increase in 2024 places the target above $4,000.\n\nSpot Bitcoin ETF approval will be a key catalyst for a price rally and also set a precedent for ETH ETF approvals in Q2 and Q3 2024.\n\nEthereum mainnet is expected to undergo the sharding upgrades, starting with Dencun, which will introduce proto-danksharding.\n\nInvestors and traders alike are anticipating ETH price to rise in order to book profits before Q2 2024.\n\nEthereum price increased considerably in 2023, recovering about a third of the crash from December 2021 to May 2022. However, the remaining two-thirds of this crash is expected to be recovered in 2024 owing to multiple factors.\n\nETH investors have a lot to look forward to throughout the year as events such as spot Bitcoin ETF approval, Dencun (sharding) update, and spot Ethereum ETF decision will be taking place, which are expected to be bullish catalysts. However, the lack of institutional investors' interest might act as a barrier to this growth and keep ETH from reaching $4,000.\n\n2024 Fundamental outlook: Ethereum price to witness growth from spot Bitcoin ETF approval\n\n2024 is expected to kick off the bull run that the crypto market has been waiting for since June 2022. Ethereum price, along with the rest of the market, is set to witness bullishness owing to one single factor – the approval of spot Bitcoin exchange-traded funds (ETFs).\n\nOver a dozen investment fund managers, including the likes of BlackRock, ARK Invest, and Fidelity, have applied for ETFs. The initial outcome was not positive as the Securities and Exchange Commission (SEC) exhibited skepticism, but following Grayscale's win, sentiment changed.\n\nThe court ruled in favor of the asset manager in the lawsuit filed against the SEC for rejecting the request to turn the Grayscale Bitcoin Trust (GBTC) into an ETF. This imbued confidence in the market, and the deadline for the final decision is expected to arrive by January 10, 2024.\n\nBitcoin spot ETF update\n\nAs Bitcoin price rallies, Ethereum will fulfill its role as the \"Silver to BTC's Gold\" and likely push other altcoins to rally as well.\n\nFurthermore, this approval will also set a precedent for Ethereum spot ETFs, which asset managers are already eyeing. VanEck, ARK Invest, and BlackRock, among three others, have already applied for a spot ETH ETF. Grayscale, too, filed to convert its Ethereum Trust (ETHE) into a spot ETF.\n\nAccording to Bloomberg ETF analyst Eric Balchunas, these applications have strong odds of approval, too, since they would be similar in design and structure to spot Bitcoin ETFs. However, their final deadline is between May and August 2024, giving investors time before they can get their hands on the investment products.\n\nEthereum spot ETF filings\n\nThat said, following the spot BTC ETF approval, ETH ETFs will see much less friction in acquiring a green light from the SEC. This will be the driving factor for the continuation of the Ethereum price rise in Q2 2024.\n\nThe Surge after the Merge\n\nDuring a recent Ethereum Community Conference in Paris, Ethereum founder Vitalik Buterin discussed the future of the blockchain. Referencing the Merge, Buterin stated that the chain is only 55% complete and has a long way to go.\n\nThe next four stages, as noted by Buterin, will be The Surge, the Verge, the Purge, and the Splurge. The first of these four – The Surge – will introduce sharding on Ethereum.\n\nSharding is a key scalability solution for Ethereum that aims to improve the network's capacity to process transactions and execute smart contracts. This is done by splitting the network into smaller, more manageable chains called shards.\n\nEthereum Sharding structure\n\nThese shards are individual components of the Ethereum network itself. Each shard operates as an independent blockchain with its own set of smart contracts. These chains can process transactions and execute smart contracts independently, reducing congestion on the Ethereum mainnet.\n\nThe main goals of Ethereum developers with the sharding update are as follows:\n\nScalability: As the Ethereum network continues to grow, it faces significant limitations in transaction throughput and processing capacity. Sharding introduces a parallel processing approach, allowing multiple transactions and smart contracts to be processed simultaneously across different shards. Crosslinking: Shards communicate with each other through crosslinks, which are references to the state of one shard included in another shard's block. Crosslinking helps maintain consistency and integrity across the entire Ethereum network. Increased opportunities for validators: Validators participate in the consensus process by proposing and validating blocks on individual shards. Validators are chosen to propose blocks based on the amount of cryptocurrency they lock up as collateral in the Ethereum 2.0 Proof-of-Stake system.\n\nIn the sharding update, the beacon chain will play a crucial role as well. The beacon chain was the first Ethereum 2.0 upgrade, which acts as a separate blockchain that coordinates the overall network and manages the consensus algorithm (Proof-of-Stake). This chain will be used to coordinate communication between the shards.\n\nThe process of implementing sharding will begin with the Dencun upgrade. Set to be executed in Q1 2024, the upgrade will bring proto-danksharding to the network. Proto-danksharding will act as the scaffolding for future scalability upgrades, including danksharding, which is a crucial part of the Surge.\n\nDencun upgrade will also optimize the Ethereum gas fees, which has been a prevailing issue for users. Throughout 2023, Ethereum layer-2 chain’s fee per transaction has averaged $0.02 to $0.21, whereas Ethereum mainnet transaction fees have averaged $4.86.\n\nEthereum and layer-2 chains’ gas fees\n\nAs these updates are set to arrive in Q1 and Q2, with many of them expected to be deployed by May-June, they will likely act as the bullish catalyst of the second half of 2024.\n\n2024 Technical Outlook: Ethereum price could see $4,000\n\nEthereum price over the past year had a good run, rising by more than 85%. While Q1 proved to be a good quarter for the altcoin, the growth halted, and ETH largely consolidated throughout Q2 and Q3, struggling to breach the $2,000 mark.\n\nHowever, in Q4, Ethereum price began rallying again, mostly owing to expectations surrounding the spot Bitcoin ETF approval, which also led to many investment funds filing for spot ETH ETFs. During this duration, ETH shot up by 51% to end the year at around $2,200, which is the present trading price.\n\nThus, if throughout 2023 ETH rose by over 85% despite the bearish market conditions, a similar rally or even a larger one can be expected out of a bullish year in which ETF approvals are expected, network developments are implemented, and Bitcoin halving will take place.\n\nETH/USD 1-week chart\n\nIf ETH repeats 2023’s performance in 2024, the target for next year will be at over $4,000. The price indicators also suggest a bullish outcome despite the slight correction in the past few weeks. The Relative Strength Index (RSI) has just exited overbought, coinciding with the pullback witnessed over the last week, whilst the Moving Average Convergence Divergence (MACD) is rising above the zero line, showing the uptrend is accompanied by strong bullish momentum.\n\nAlthough the receding green bars do suggest that the bullishness is waning at the moment, some pullback before bullish momentum regains strength is common in longer timeframes, and this can be observed during the past bull runs as well.\n\nFurthermore, ETH has observed the 50, 100 and 200-day Exponential Moving Averages (EMAs) as support, which is a bullish indication since the last time this happened was in July 2020. At that time, ETH ended up scoring a 1,577% rally from $288 to $3,928, a feat that will not be replicated in 2024.\n\nNevertheless, despite the bullish indications, one should remember that the recent rally has caused the Ethereum price to be overbought on RSI, and investors might attempt to book profits in the first half of 2024 again. This falls in line with historical movement where ETH lived in the overbought zone (RSI above 70.0) for about six months before initiating short-term corrections in June 2021.\n\nEthereum RSI and MACD\n\nThe prospect of investors selling their holdings to realize profits is also evident from the on-chain metrics, which suggest investors may book profits if the Ethereum price shoots up. Nevertheless, ETH would still be expected to remain above the $2,500 mark until Q2, after the corrections, the ETF hype subsides, and the market moves on to the Ethereum network upgrades.\n\nProfit-taking will bring corrections, but traders remain bullish\n\nOn-chain metrics can be used to analyze investors' behavior and make predictions about future price activity. One of the most important on-chain metrics is the Market Value to Realized Value (MVRV) ratio. This metric is an indicator used to assess the average profit/loss of investors who purchase an asset. It can provide clues as to when investors might begin taking profits and selling their holdings, leading to pullbacks in price.\n\nThe quarterly and yearly MVRV ratios are the most useful for long-term analysis. The 90-day MVRV ratio measures the average profit/loss of investors who purchased an asset in the past three months, and the 365-day MVRV ratio measures the same over the last year.\n\nFor Ethereum, the 90-day MVRV sits at 15.25%, which indicates that investors who purchased ETH in Q4 2023 are sitting at 15.25% profit. Similarly, the 365-day MVRV ratio is presently at 24.18%, suggesting that those who purchased throughout 2023 are, on average, witnessing 24.18% profits.\n\nInterestingly, considering both the timeframes, it is evident that these investors are likely to be tempted to sell their holdings soon to realize profits. This could most certainly trigger a sell-off. As seen in the chart, when MVRV hits 9% to 34% on the yearly time frame and 7.8% to 31% on the quarterly time frame, ETH has undergone considerable corrections. Hence, this area is termed a danger zone.\n\nEthereum MVRV ratio\n\nApart from investors, the traders are also seemingly bullish. This inference is derived from the funding rates, which show an increasing trend. Such a trend suggests that long positions are gaining dominance, indicating a prevailing bullish market sentiment.\n\nAs can be observed on the chart below, the last time funding rates plunged into negative, i.e., short traders gained dominance, was back in March 2023. Since then, the rates have largely been positive, which means people are betting on a rise. This is solely being done with the intention of selling for profits.\n\nEthereum funding rate\n\nSo, considering these conditions, the bull run that starts due to spot Bitcoin ETF hype, followed by the sharding update, will likely urge investors to sell and realize profits. However, long-term holders will refrain and wait until the bull run flips and ETH begins witnessing a downtrend.\n\nWatch out for institutions\n\nOne key factor that might act as a headwind to Ethereum price reaching the target of $4,000 is the lack of institutional interest ETH has been witnessing. Year to date, the crypto asset only managed to rake in $19 million, which is far lower than Solana's $146 million worth of inflows and astronomically less than Bitcoin's $1.7 billion.\n\nEthereum's year-to-date institutional flows\n\nIf this trend continues in 2024 as well, ETH might struggle to capitalize on the rest of the bullish cues since institutions are expected to drive the next bull run, and lack of interest from them may not play in Ethereum's favor.\n\nSummary\n\nTo summarize the outlook for Ethereum in 2024, the best advice is to sit on holdings, wait and gain. A bullish year for the broader crypto market and a bullish year for ETH investors is the forecast. But that does not mean the Silver to Bitcoin's Gold is completely immune to bearish outcomes.\n\nWhile an increase to $4,000 is possible, it is not a certainty since regulatory changes and unprecedented crashes plague the crypto market. Furthermore, considering the performance in 2023, ETH has not necessarily been the favorite asset of institutional investors. This lack of interest, if noted in 2024 as well, could act as an opposing force on ETH's potential growth.\n\nThus, it is advised always to do your own research and make the most ETH-ducated decision."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQNTlCQnBSYmU4WDlxZmp1S2lXWXZ1M3Q1QnE4RnQ3V1EtRGNzRU9CV0RUNGpEY2VuRkdpOUNOSmY0T3dlblhhN1VpYnpiY3YwWlZHUkJQZHBhRWZ5Sy0xNU1sUHpzV0l1TnlzeVVkYTdMWTFZY2ZnTEZyaFNNSk5POVZQWDcxazk4MHk00gGQAUFVX3lxTE9HZTBUYlpra0FlVldJVkVWZFlaWmFlMXY3NzluVFk1cW1WTGd2YWpXbFIxMzN5aXdzdUd5ZWZxbzZRYzlFM09TVVFEYUpmTUdnSGdkZ2NtRkhCVkxvY1p6TFN6OG9yMmNERHdJZ1IxNDNsdUhvajlnaC0wYjJlZVpMbEhLaGdLTEZSSWloREdacw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price at $5,000 Predicted by BitMex Founder Arthur Hayes - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a surprising turn of events, BitMex founder Arthur Hayes took to social media to reveal a bold prediction regarding the future price of Ethereum (ETH).\n\nAdvertisement\n\nHayes, known for his insightful market analyses, confessed to having received a divine message during meditation, leading him to make significant changes in his cryptocurrency portfolio.\n\nIn a cryptic post, Hayes humorously claimed to have received guidance from a higher power, jokingly attributing it to Satoshi Nakamoto, the mysterious creator of Bitcoin. The message allegedly urged him to divest from Solana (SOL) and express his admiration for Ethereum's cofounder, Vitalik Buterin.\n\nAdvertisement\n\nFam ... I have a confession to make.\n\n\n\nI received a msg from the Lord while meditating. He said dump that Sam coin POS, and profess your love for Archangel Vitalik.\n\n\n\nSo I dumped $SOL, and bot more $ETH.$ETH = $5,000 — Arthur Hayes (@CryptoHayes) December 22, 2023\n\nTaking heed of this celestial advice, Hayes reportedly sold his Solana holdings and doubled down on Ethereum, predicting a surge that would propel the cryptocurrency to an impressive $5,000. This announcement follows Hayes' earlier call predicting Solana's price to reach $100, a forecast that has proven accurate, with SOL recently peaking at $99.6.\n\nRotation\n\nHayes' decision to pivot from Solana to Ethereum may be rooted in his assessment of the market dynamics. While Solana has outperformed Ethereum in recent weeks, with a staggering 350% surge since mid-December, Hayes seems to believe that ETH has more room for growth.\n\nComparing the two cryptocurrencies, Ethereum's performance appears lackluster in the short term, showing nearly 10 times less growth than Solana during the same period. Despite trading at yearly highs, the percentage increase in ETH's value pales in comparison to the meteoric rise of SOL."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxObDlweWJUam4yVnlIUGpMamk4dGZTNldzektJdklxN3k5b3ZVSk1Tb2tSZjQtczdYTVVydTdPcHdSY1g0YlRib3FTb1dNY3dMM1FGREFoMFhOQ183aWZ0S0Y0c1N5eTlfYktfUEE3aEgtQnVOOVRLOWpDTVFfdUpFdHZfZGl0MG0yTjBlM1M2MnQ2SlliU2J5TGhVTEI5VFQxd0dwQmt6OXlSMFowRU1HQnVxSjBHLUtMZmN0MlFEWHQ4aXFPbWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Il report di Six Degree: la supply delle stablecoin presenti sulla blockchain di Ethereum è in calo - The Cryptonomist",
        "content": "According to the latest report provided by Six Degree, an on-chain data analysis company, the recent crypto market rally has not been supported by a significant influx of capital into the sector, as the supply of stablecoins on the Ethereum blockchain has decreased compared to 2022.\n\nTo tell the truth, the total supply of stablecoins has decreased in recent years, with the only exception being the Tron network, which has seen an increase in this metric.\n\nBUSD and USDC have been the most affected assets by this downward trend, while USDT has strengthened its dominance in the market by increasing its capitalization.\n\nWhat does all this mean for the crypto market? Should we expect a growth of the stablecoin market on the Ethereum blockchain before witnessing the true cryptocurrency bull run?\n\nLet’s see all the details below.\n\nThe latest report from Six Degree highlights a significant drop in the supply of stablecoins on the Ethereum blockchain from 2022 to date\n\nAccording to the latest report from the on-chain analysis company Six Degree, the supply of stablecoins on the Ethereum blockchain has decreased by over 35% since reaching its peak in March 2022.\n\nIn that period, the total supply of fiat-backed stable cryptographic coins on the chain had a value of 108 billion dollars compared to the current 67.5 billion dollars.\n\nThe entire bear market of 2022 was driven by a redemption of these cryptographic assets that were moved from Ethereum to fiat currencies, in a continuous downward trend.\n\nOnly at the end of September/beginning of October 2023 did things start to take a different turn, with the total supply of stablecoins on the blockchain starting to grow again but at a very slow pace.\n\nThis trend has not only affected Ethereum but all decentralized networks that support stablecoins, with the only exceptional case represented by Tron which has seen the aforementioned metric increase by 57% from 2022 to date.\n\nLooking more closely at the composition of the Ethereum stable market, we can see that almost half of these tokens are held in so-called “external owned accounts” (EOA), which are addresses of private users.\n\nA good 30% is managed by centralized exchanges which represent the main trading platforms for exchanges between stablecoins and bitcoin.\n\nFollowing are other entities that own a significant portion of stable on Ethereum: Bridge, DeFi protocols, and multisignature wallets (which usually represent the wallets of crypto project teams).\n\nIt is very interesting to note how the Six Degree report relates the trend of stablecoin supply on Ethereum with the price performance of Bitcoin in recent years.\n\nIn particular, the focus of attention is on the fact that during the last bull market of 2021, the price growth of Bitcoin was accompanied by an increase in the presence of stablecoins in DeFi on the blockchain in question.\n\nAt the same time, the bearish market that started in 2022 saw a strong contraction of these coins in DeFi, which shortly after reached one of the lowest values in recent years.\n\nThe relationship was only recently interrupted with the latest crypto market rally, in which there was no longer the same interdependence between stablecoins in DeFi on Ethereum.\n\nThis is a positive signal for ETH and for the market as a whole: when the stable sector sees a return to the all-time highs of 2022, we can expect a very strong price pump for the major crypto assets.\n\nTether (USDT) supply growing at the expense of USDC and BUSD\n\nTrying to observe the situation more closely, without focusing exclusively on the Ethereum blockchain stablecoin market, let’s see which coins have contributed the most to the contraction of 2022 just described in the previous paragraph.\n\nIt is immediately noticeable that Tether (USDT), after experiencing a slight decrease in its total supply in mid-2022, immediately recovered all the lost ground, even reaching historical highs in terms of market capitalization for stablecoins.\n\nPaolo Ardoino’s currency is therefore the only exception to this trend.\n\nThe largest growth has been in the Tron network, which currently has 48.8 billion USDT, while on Ethereum the currency has barely managed to recover the 2022 highs at 41 billion USDT.\n\nOther blockchains like BSC, Arbitrum, Solana, etc., capitalize on a small percentage of the total supply of crypto held by Tether.\n\nOn the opposite side, we can clearly see that USDC represents one of the main contributors to the decrease in the total supply of stablecoins on Ethereum.\n\nOn this chain, in fact, the currency still has a deficit of 25.6 billion dollars compared to the historical highs of February 2022.\n\nUnlike USDT, the presence of USDC on Tron is non-existent, and in general, the supply of the stablecoin has not recovered from last year’s sharp decline.\n\nThe hope is that the bearish trend can stabilize and that USDC can attract capital that would likely be poured into DeFi applications, giving the right push for a rise in cryptocurrency prices.\n\nAnother protagonist of the reduction of stablecoins on the Ethereum blockchain is BUSD, a resource managed until recently by Binance and issued by Paxos, which a few months ago received a notice from the SEC to cease its activities.\n\nIn particular, Paxos is no longer authorized to issue this type of stablecoin and Binance is obliged to reduce its presence in the market.\n\nDue to these events, the federal agency BUSD has seen a drastic reduction in its market strength, going from 18.19 billion dollars in February 2022 to the current 1.46 billion dollars.\n\nObviously BUSD is destined to disappear."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNSHFkNU9ZTXZyLURRN3NEdTJIdnVLQmViVEhETlJIZWg4UnJ5N01XcHN0QUVvUVNfYXlBb1EwTFlHbGNxZThyeVFseUhfek5qVWY1eEFYRVhPSGt6UHhWdi12SFlkMFVRNFh5TzJqbnV6b0k1bjUzWkNtNDNHbklvQk5od0V0a000S1pIR3hNZjNSVU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Solana Network Activity Surpassed Ethereum in Q4 2023: Report - Bitcoinsensus",
        "content": "Solana’s Q4 Surge: A New Era in Blockchain Dynamics\n\nSolana’s user activity soared by 400% in Q4, significantly outperforming Ethereum’s growth, with key boosts from strategic token airdrops and increased platform engagement.\n\nThe platform witnessed a 255% increase in transaction volumes through its Decentralized Exchanges (DEXes), with notable growth in its DeFi sector and a near 500% increase in NFT sales volume.\n\nThe surge in Solana’s network activity positions it as a formidable challenger to Ethereum’s dominance in the blockchain space, indicating a shift towards more diversified blockchain ecosystems.\n\nIn a striking development in the world of blockchain technology, Solana (SOL) has recorded an extraordinary 400% increase in user activity in the fourth quarter of 2023, significantly surpassing Ethereum’s modest 3% growth.\n\nThis surge, as reported by on-chain data provider Messari, represents a significant shift in the dynamics of blockchain user engagement.\n\nUnleash the potential of leverage trading! Join Bybit today with our link, complete KYC, and earn up to a $40 bonus on a $100 deposit. Don’t miss out on this exclusive offer; claim your bonus now!\n\nA Series of Strategic Airdrops\n\nThe remarkable rise in Solana’s user activity is largely attributed to a series of lucrative token airdrops by various protocols on the Layer 1 (L1) blockchain network. For instance, the Solana-based oracle network Pyth (PYTH) executed an airdrop of 250 million PYTH tokens, valued at approximately $77 million, to its early adopters on November 20. Additionally, Jito, another Solana-based project, followed suit with an airdrop of tokens worth $225 million on December 7. The anticipation around these airdrops has fueled a significant uptick in network engagement.\n\nJupiter, a leading swap aggregator and DeFi protocol on Solana, has also been a major contributor to this uptrend. The platform’s announcement of an upcoming airdrop of 4 billion JUP tokens scheduled for January has generated considerable excitement. Concurrently, the dog-themed token BONK has seen a staggering 544.4% rally over the past month, further enhancing the network’s activity and attracting more users.\n\nUnleash the potential of leverage trading! Join Bybit today with our link, complete KYC, and earn up to a $40 bonus on a $100 deposit. Don’t miss out on this exclusive offer; claim your bonus now!\n\nSolana’s DeFi and NFT Sectors Thrive\n\nSolana’s DeFi sector has experienced substantial growth, with the total volume of transactions through Solana-based Decentralized Exchanges (DEXes) increasing by 255% in just 30 days, amounting to a total of $871 million as of December 18. According to Messari, nearly 60% of Solana’s DEX volume is now channeled through Jupiter, surpassing the volumes of Uniswap V3 on Ethereum. Orca, another DEX on Solana, has emerged as the second-largest DEX in the crypto world, trailing only Uniswap V3.\n\nIn parallel, Solana’s Non-Fungible Token (NFT) market has also witnessed an impressive growth spurt. Sales volume in this sector has escalated by almost 500% in the last 90 days, marking a significant milestone for Solana in the burgeoning NFT space.\n\nImplications and Future Prospects\n\nThe surge in activity on Solana is a testament to the evolving landscape of blockchain technology and user preferences. While Ethereum has long been a dominant player in the blockchain ecosystem, the rapid growth of Solana suggests a diversifying market with increasing opportunities for emerging platforms. This shift could herald a new era in blockchain technology, where innovation, user engagement, and strategic initiatives become key drivers of success.\n\nAs Solana continues to gain momentum, it will be intriguing to watch how it shapes the future of blockchain technology and digital finance. With its growing DeFi and NFT sectors, Solana is positioning itself as a formidable competitor in the blockchain space, challenging the long-standing dominance of Ethereum and potentially reshaping the digital asset market.\n\nEnhance Your Crypto Trading Skills With Our Legends’ Trading Masterclass\n\nEmpower your crypto trading skills with our Legends Masterclass. Sign up now and take advantage of our limited-time discount offer! Join the class today."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNeXR4cDFlTEc5Q2JvQlJ1UTBaLWtMQ3NoLU9JZjhZV3lLdi1HaFFVUEsyRm1yR0tqMUptcVYtVE53SnBTXzFibVpDSV9ZTGhxWUhHOFBsVVlKMTE5NkFCUVNuTDdESTJDb253bEw0RGlEZDVhLXJyTmQ2NUUwSnFuWmNNS3ZVcTV1NEFtSF95b2QyajFQLTZDcmlTNmRNbGdoWDlaLVBBTGl6d2dIUk1hd1JPdTd5Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Insider Says ETHGate Affects XRP Price, Holders Should Care About it - The Crypto Basic",
        "content": "Former Ethereum adviser Steven Nerayoff urges XRP holders to be concerned about ETHGate, emphasizing how the infamous theory affects XRP price.\n\nSteven Nerayoff, an early adviser to the Ethereum Foundation, has pointed out reasons why XRP community members should care about ETHGate.\n\nThe popular crypto adviser made this known yesterday during an exchange with an XRP holder who goes by the pseudonym XRP_Krnboy.\n\n- Advertisement -\n\nNerayoff Sues StormX Co-Founder\n\nIn his latest tweet, Nerayoff disclosed that he had sued StormX CEO Simon Yu and co-founder of U.S. Blockchain Coalition Arry Yu for colluding with the government in fabricating charges that led to his indictment in 2019.\n\nNerayoff, who has been commenting on ETHGate for months, alleged that Simon and Arry stole his tokens worth millions of dollars when they leveled extortion charges against him.\n\nThe crypto advisor revealed that he has enough evidence, including voice recordings, to show that Simon and Arry offered him more tokens in order to silence him.\n\nWhy XRP Holders Should Care About ETHGate\n\nCommenting on the development, XRP_Krnboy said XRP community members do not care about ETHGate. The X user stated that Ripple needs to settle its lawsuit with the SEC to set the stage for a potential XRP rally.\n\nFurthermore, XRP_Krnboy expressed concern about XRP’s current price, suggesting that it seems stuck around the $0.60 level.\n\n- Advertisement -\n\nResponding, Nerayoff highlighted two major reasons why XRP enthusiasts should care about ETHGate. According to Nerayoff, the so-called ETHGate theory is the major reason why XRP is still stuck around $0.60.\n\nIn addition, the former Ethereum advisor stated that XRP holders should be concerned about the corruption happening beyond their tokens if they care about living in a free society.\n\nInvestors in XRP don’t give a shit about #ethgate? You should care because that why $XRP is as you say “$0.6 omg”. More importantly you should care about this level of corruption beyond your tokens if you care about living in a free society. — Steven Nerayoff (@StevenNerayoff) December 21, 2023\n\nETHGate Scandal and Debate\n\nFor context, ETHGate is a theory that has gone viral in the crypto space for years. Proponents of the theory alleged that the team behind Ethereum fostered relationships with prominent SEC officials to create a favorable regulatory environment for ETH to the detriment of other crypto assets.\n\nThis relationship, according to critics, prompted former SEC director William Hinman to declare ETH alongside Bitcoin as non-securities in 2018. In his remark, Hinman stated that ETH has become “sufficiently decentralized” over the years and should no longer be classified as a security.\n\nOn the contrary, several crypto proponents, including Nerayoff, argued that Ethereum’s 2014 ICO displayed less decentralization than initial sales of other digital assets.\n\nTo corroborate this claim, former Ethereum core developer Lane Rettig alleged that 70% of ETH supply was distributed during the pre-mine stage.\n\nHe added that only a few individuals purchased a huge percentage of the pre-mine ETH because they participated pseudonymously during the sales. To this day, no one knows the identity of the whales that scooped the huge amounts of pre-mined ETH."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQeG9oUlpidWFtNkJHQ3VybXZxZHQtR00yQWpEZXViZExLaTJ0MlFScWFpYlM5SXdDQ2U2aHZXZWFYYTlBTmFhUzZMZUZuQ1Z2cmR3Qzh6V2FVTnpRX2s5OHNoTUllem9nSHRoZG0wSVVCZzVfYlNkX0tnZkE0S0NMVXlLNDBWOVN4QnlkSWZmQ3lwaVVQcnNnQzhoSG1SLWRwakp3RHZpYjFrNllxT1lEZWVKYVdZeWFTc2RsLXdKUVhCQWo0NEZEbnBpZmg5T3JZQUVxWjFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Hashnote e Lido danno il via ad una soluzione di crypto staking liquido su Ethereum per gli utenti istituzionali - The Cryptonomist",
        "content": "Hashnote, a Miami-based technology company focused on institutional investments, has just launched the stETH Fund: a regulated fund that allows for compliant and transparent participation in Ethereum’s liquid staking by leveraging the renowned Lido platform.\n\nHasnote acts as a gateway between clients who are looking for security in the investment world and a fund manager regulated by the CFTC.\n\nThe birth of this particular product reflects the increasingly growing demand from users who want to enter the crypto world, particularly in the liquid staking of Ethereum, without having the necessary skills to face the challenges of decentralized finance.\n\nIn the meantime, other investment solutions in Lido and other more complex LSD platforms are also emerging, mainly dedicated to more experienced individuals.\n\nLet’s see all the details below.\n\nHashnote launches stETH Fund and opens up to investments in liquid staking of Ethereum based on Lido\n\nYesterday, the on-chain financial technology company Hashnote officially launched the stETH Fund investment product which allows investing in liquid Ethereum staking through a regulated fund that relies on the LSD Lido Finance platform.\n\nThe goal of Hashnote is to merge the transparency of the blockchain world with its ability to comply with the requirements of US market supervisory bodies such as CFTC, offering a crypto investment solution primarily to institutional clients.\n\nThe Miami technology company has noticed how liquid staking on Ethereum has been growing steadily for several months, able to incorporate about 24% of the total ETH supply on the market, and has decided to strongly focus in this direction with a regulated fund.\n\nstETH Fund is built on the decentralized liquid staking middleware open-source Lido, which represents the undisputed leader in this niche sector.\n\nFor investors who rely on this product, there are multiple advantages:\n\nReliability: the product has been designed to meet the highest standards required by institutional investors;\n\nthe product has been designed to meet the highest standards required by institutional investors; Compliance: Hasnote is regulated by the Commodity Futures Trading Commission (CFTC) as a CPO and its funds are registered with the Cayman Islands Monetary Authority (CIMA) as mutual funds. Furthermore, the offered structure is compliant in terms of KYC/AML, providing a compliance front also for the verification of the participants’ identity;\n\nHasnote is regulated by the Commodity Futures Trading Commission (CFTC) as a CPO and its funds are registered with the Cayman Islands Monetary Authority (CIMA) as mutual funds. Furthermore, the offered structure is compliant in terms of KYC/AML, providing a compliance front also for the verification of the participants’ identity; Safety: Hashnote Smart Contract Vault is managed by MPC (multi-party computation) wallets and is impervious to cyber attacks. The whitelist of client/wallet addresses is maintained and enforced by the proprietary smart contract of Hashnote. The smart contract code is audited by third parties;\n\nHashnote Smart Contract Vault is managed by MPC (multi-party computation) wallets and is impervious to cyber attacks. The whitelist of client/wallet addresses is maintained and enforced by the proprietary smart contract of Hashnote. The smart contract code is audited by third parties; Maximized earnings: the investment in stETH Fund is characterized by maximizing the yield obtained on Lido. This allows for liquidity while staking Ethereum;\n\nthe investment in stETH Fund is characterized by maximizing the yield obtained on Lido. This allows for liquidity while staking Ethereum; Easy to use: the reference interface is easy to use, intuitive, and allows effortless monitoring.\n\nAmong the other features of the regulated fund of Hashnote that invests in liquid Ethereum staking supported by Lido, we see the possibility of a T+0 refund, made possible by the breadth of the portfolio managed by the provider and a redemption with zero slippage in the unstaking process.\n\nIn addition, stETH Fund does not have any financial leverage, making it a less risky product compared to other similar derivatives.\n\nFinally, we must mention the minimal risk of the DeFi protocol Lido, the automation of compounding rewards, the diversification of node operators staking on Ethereum, and a smooth and efficient operation.\n\nThe state of the crypto LSD market on Ethereum: increasingly innovative investment options\n\nSince the “Shapella” update went live on Ethereum, opening up the possibility for chain users to unstake previously locked ETH, liquid staking platforms like Lido have started to see increasingly growing numbers.\n\nCurrently, all LSD applications hold a total of over 12.03 million ETH locked on the beacon chain, corresponding to approximately 26.827 billion dollars.\n\nThis data corresponds to almost 42% of all Ether staked in Ethereum 2.0 contracts.\n\nLido in particular is the undisputed leader in liquid staking and accounts for about 76% of this market niche, in addition to holding the record for the DeFi protocol with the highest TVL of 20.37 billion dollars.\n\nFollowing are names that boast a significant percentage of ETH in this context, such as, for example, RocketPool (8.77%), Binance Staked ETH (6.46%), Frax Ether (2.56%), Coinbase Wrapped Staked ETH (1.62%), Mantle Staked ETH (1.26%), and StakeWise (0.79%).\n\nThe success of this type of platforms is due to several reasons.\n\nFirst of all, liquid staking offers a convenient solution for those who intend to hold ETH but also want to simultaneously earn a yield and use parallel liquidity for crypto exchanges.\n\nSecondly, the ways in which the liquid tokens of these protocols, such as stETH, wstETH, frxETH, and many others, are integrating with other DeFi dapps offer significant advantages to stakers who can sometimes benefit from double yield.\n\nFinally, there is also a “convenience” speech since many LSD projects have announced or hinted that they will reward their users who have used Ethereum’s liquid staking with an airdrop.\n\nIn this regard, a few weeks ago the layer-2 Blast, which integrates the “native yield” formula and relies on Lido and MakerDAO, reached a TVL of over 920 million dollars, demonstrating all the interest in this sector.\n\nThere are also many other smaller platforms that have still managed to cover a good percentage of all the ether locked in LSDs: among these we find EigenLayer, Swell, Kelp, Morpho, Diva Staking, EtherFi, Mev Staking and many others.\n\nThe Twitter user “Olimpio Crypto” has created a collection of all these dapps that still do not have a native token and will probably launch it through an airdrop."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQUkd4dFhmWmdJcHdxaGZwREQtZndidHVmNjBLbW9uOVdxbzNtcXdPTzZYQjhpUm9aQVRvbFpZZDBwVTd6T18xU2hCLXVFSnFmMXI4Qk44Y3JXM3hIcTlNX2pDZ3ZjR2FRZEw3WFNvNEpsV3F0ZjhHMTFpUC14dnNHblk1VU0tOV96LXZld3lpQkUyRExydzUtLXJESUN3Q2h4QVpINg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Solana Dwarfs Ethereum on Top Exchanges, Beats XRP in Market Cap - The Crypto Basic",
        "content": "Solana (SOL) is extending its breakthrough for the year as its record-breaking transaction volume exceeds that of Ethereum (ETH) on key trading platforms.\n\nThe intriguing performance of Solana has placed the cryptocurrency on the radar of most traders. At press time, the digital currency soared as high as 12.23% in the past 24 hours to $87.18. In tandem, Solana’s market capitalization has jumped by more than 12% to $37,245,046,339, as the 24-hour trading volume recorded a 100% jump to $4,455,508,322.\n\nWith the current outlook, Solana has now surpassed XRP in market capitalization, as the latter is now worth just $33,431,974,071.\n\n- Advertisement -\n\nSolana Outranking Ethereum\n\nAccording to insights from Kaiko Researcher Riyad Carey, Solana’s trading volume on Upbit has surpassed that of Ethereum for 55 consecutive days. The same trend surfaced on MEXC, where Ethereum’s volume has lagged behind Solana’s for 15 days straight.\n\nKraken and Coinbase Global Inc are not left behind, with Solana outpacing Ethereum for 9 days out of the past 14 on the former and 3 of the past 13 days on the latter. This impressive performance has also rubbed off on the differentials in the price of the two assets,\n\nSOL has done more volume than ETH: 9 out of the last 14 days on Kraken\n\n3 out of the last 13 days on Coinbase\n\nThe last 15 days straight on MEXC\n\nThe last 55 days straight on Upbit The @blknoiz06 Effect pic.twitter.com/c4LLsX24ya — Riyad Carey (@riyad_carey) December 20, 2023\n\nWhile Solana has jumped by 345% in the past 3 months, Ethereum has only managed to grow by 40% within the same period. With the growing debate about Ethereum and Solana, by all metrics, the latter is winning as a high-performance outfit, however, its market capitalization is a fraction of the $270,614,040,135 that Ethereum boasts of.\n\nThe Solana Advantage\n\nAs blockchain networks with established developer ecosystems, it is worth noting that both Ethereum and Solana have robust developmental activity at this time. The shift in embrace, however, is based on sentiments that most traders are nursing at times.\n\n- Advertisement -\n\nWhile Shiba Inu (SHIB) and other Ethereum-based memecoins have helped elevate the status of the blockchain in times past, investors are now more gravitating to BONK, the sensational memecoin built on Solana. The debut of an airdrop for BONK and Solana Mobile phone owners has also driven sentiment through the roof in recent times.\n\nBesides the influence of BONK, the fact that all fears related to the liquidation of SOL as a major asset owned by bankrupt FTX Exchange have been allayed is further giving investors the confidence to go all out on the coin. For its ecosystem potential, top firms like VanEck have tipped Solana to hit a high price target of $3,211 before the end of this decade."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQWElaQ1FZa2pYNTdubFBTLVZ4a3c1b2NfLUJ0clJzcDZpempUbnpSU3I2R3lJYXR3cGFyakVFN2c3ODFDZFRVUzhTQlRpbWNwZklyVzRpM0l2Tmd0eDBUUVBaRkVZdFF4R0ZIdFdCazlqN1FMT2xIMkpLcVlqdlZHUFRR0gGHAUFVX3lxTFBOb09DZEZPLTJ0aU5FOWMySkZQemVxLVpqWk1IdWJmU2hZNlg4SmZFakRuUUdIWHRIeVZKY2x5YXYybGw0NGtjMjc1NWcwaVlsdExoYjJEaTJCOF91ZlJRM0FQUWRrblBoX2owS2JVV0tPRG5TbGE4dExYYUVsRnBSWE9MRVFuTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Ethereum: Why a price move to $2.5K is a good prediction - AMBCrypto News",
        "content": "ETH accumulation has been increasing, suggesting a move toward $2,500.\n\nMarket participants are not convinced that the coin is about to jump.\n\nAccording to AMBCrypto’s evaluation of Santiment, active addresses on the Ethereum [ETH] blockchain have been rising. As of 18th December, the 24-hour active addresses was 395,000.\n\nBut at press time, the metric has climbed to 512,000. Active addresses measure daily interaction and speculation around a token.\n\nTherefore, the increase suggests that there are more market participants involved in ETH transfers. Like the active addresses, Ethereum’s on-chain volume also increased.\n\nAt the time of writing, the volume was 13.02 billion. The rise in active users and volume implies a surge in network activity on the blockchain\n\nETH’ season to switch states\n\nAlso, this could be a bullish sign for ETH’s price. For a while, ETH has come under intense criticism for its inability to replicate Bitcoin’s [BTC] form. Likewise, ETH has also been unable to outperform many other altcoins.\n\nHowever, this does not mean that ETH will not have its season.\n\nOne reason for this assertion is the number of new ETH wallets created. Based on Glassnode’s data, new addresses on Ethereum have been growing.\n\nThis indicates a surge in traction which could translate to a positive move for the price action. On a Year-To-Date (YTD) basis, ETH’s value has increased by 84.11%.\n\nHowever, the cryptocurrency has been stuck between the $2,000 and $2,300 levels for some time. A look at the ETH/USD daily chart showed that a bullish thesis could soon be validated.\n\nThis was because of the Exponential Moving Average (EMA). At press time, the 20-day EMA (blue) had crossed over the 50-day EMA (yellow).\n\nThis position is bullish and could be termed a buy/long trend. So, traders may need to desist from opening short positions.\n\nBut the Awesome Oscillator (AO) revealed that ETH’s bullish season may not happen in a few days. At the same time, it may not be far away.\n\n$2,500 or nothing\n\nAt the time of writing, the AO had formed red bars. However, the red bars were decreasing in height, suggesting a weak bearish momentum.\n\nAlso, the increase in the Accumulation/Distribution (A/D) indicator means a move to $2,500 could be possible in the short to mid-term.\n\nIn the meantime, market participants are not all bullish on ETH. This was indicated by the Weighted Sentiment.\n\nAt press time, the Weighted Sentiment was -1.736. This negative reading is a confirmation of the bearish bias most market players have.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nConsidering ETH’s circulation, on-chain data showed that it decreased to 242,000. This decrease implies that the number of ETH engaged in transactions has reduced compared to the hike on the 20th of December.\n\nPrice-wise, the drop in circulation suggests low selling pressure for ETH. So, it may be unlikely to see a nosedive in ETH’s value soon."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOR0hza0luYXU5dXFnN3dtQ3lMcXlyR2gtcDJubmdLTWhmby14eEQxd04xMmxXaXZXMlVGMHFKaTNQZmJUX1daVFY3N0o4TFR0WGFud0ZoUC16bkRDTnI0QV9nYzRFVXk1MXBQeUxBWTNGTXZjYXk1MWoxeFBwOGgwWW5fNU1xQWJBVlh6VWpsbW5Fb3JmNEw4clpISQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Founder Dumps 100T DOBE and 1.8T DOJO Memecoins - The Crypto Basic",
        "content": "An address linked to Ethereum co-founder Vitalik Buterin has sold off huge chunks of meme coins Doberman (DOBE) and DOJO.\n\nBlockchain security and intelligence platform PeckShieldAlert spotted the transactions. According to the insights shared, a total of 100,000,000,000,111.11 DOBE tokens and 1,858,140,000,000 DOJO were featured in the token swapping.\n\n- Advertisement -\n\nVitalik Buterin on Memecoin Liquidations\n\nOver the years, memecoins looking for relevance in the industry sent some quantity of their token’s supply to Vitalik Buterin’s public wallet address for legitimacy proof.\n\nSoon, this wallet harbored millions of dollars worth of memecoins with no restrictions on how Vitalik could liquidate them.\n\nThe liquidations of DOBE and DOJO mark two of the selloffs signed by Vitalik in recent times. According to the PeckShieldAlert update, the address swapped the 100,000,000,000,111.11 DOBE for 10.44 ETH worth approximately $36,228.60 at the time he initiated the transaction.\n\nThe DOJO liquidations saw the Vitalik-linked address secure a total of 3.1258 ETH from the 1,858,140,000,000 tokens sent.\n\nFrom the PeckShieldAlert insight, the Vitalik Buterin-linked address carried out the transactions using the Uniswap V2 engine with Wrapped Ethereum (WETH) providing the liquidity pathway for the liquidations.\n\n- Advertisement -\n\nRegular Buterin-Linked Transfers\n\nAs reported earlier by The Crypto Basic, Vitalik Buterin moved the sum of 2,000 ETH worth approximately $3.1 million in September to an address with a history of depositing to Bitstamp.\n\nOther high-profile transfers have also been recorded. In a bid to water down the growing speculations surrounding some of his transfers, Vitalik Buterin denied selling some 3,000 ETH in November last year to prove that not all affiliated transactions are best described as liquidation tools.\n\nWhile selloff is the easy explanation for some of these transfers, the movement of funds to affiliated research entities and collaborative partners also forms a major motivation behind some of the Vitalik-linked transfers."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOMzJPZHY3Y2Nlc1R0SDFfbEJOVDFrQ01UUjJJX1BDNHJMVDdBY1JTQnpwTVczUEtQUFFMdjdNeFFFVC1jU2FHTzEyaFp0VXFRcUZaSkpPWnl5elZOTXZKLUdPTGJzVXI4MkxMbmdFLVFTLVdFTnh5MVpTTUwxc3lZOWVsNTJHVVZUMl9pazVFeTdUSkc2V0E4QllFdXduWkJNUUxJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Gas Fees Hit Around 6x of October Lows After Steady Rise - Bitcoinsensus",
        "content": "Ethereum’s Gas Price Surge: Analyzing Causes and Consequences\n\nOver the past two months, Ethereum has seen a notable increase in gas prices.\n\nThe rise in Ethereum’s gas fees can be attributed to several factors, including the launch of the Buterin Cards NFT collection, which caused a 13% spike in fees, and the network’s shift to a proof-of-stake consensus mechanism through Ethereum 2.0, which historically correlates with demand and activity on the network.\n\nThe spike in gas fees reflects growing demand within the DeFi sector but also leads to network congestion.\n\nEthereum gas prices have experienced a significant surge over the past two months, with the median gas price peaking at over 58.6 Gwei this early December 2023, almost doubling from the previous month and marking the highest point since October this year​​.\n\nMany factors led to this rise. Traditionally, Ethereum network users have been accustomed to paying gas fees. However, recent trends have seen these fees escalate dramatically. In a striking instance last May, one user even incurred an eye-watering $118,600 in ETH for a single transaction, highlighting a significant uptick in gas fees.\n\nUnleash the potential of leverage trading! Join Bybit today with our link, complete KYC, and earn up to a $40 bonus on a $100 deposit. Don’t miss out on this exclusive offer; claim your bonus now!\n\nFactors Leading to the Rise in Ethereum Gas Prices\n\nOne of the notable triggers for the recent surge in Ethereum gas fees was the introduction of the Buterin Cards NFT collection on December 1st. This event alone led to a 13% increase in gas fees on the Ethereum network within just three hours, surpassing fees from other significant contributors like Uniswap and Tether​​​​.\n\nMeanwhile, the transition of Ethereum to a proof-of-stake (PoS) consensus mechanism through Ethereum 2.0 brought about a substantial decrease in gas fees due to a significant reduction in energy consumption by 99.9%. However, gas fees on Ethereum have historically mirrored the demand on the network, with higher activity periods leading to increased fees​​.\n\nA resurgence in decentralized finance (DeFi) activity on Ethereum has also contributed to rising gas fees. Platforms like Uniswap experienced a surge in transaction volumes, particularly with meme coins, pushing the block space demand higher and subsequently increasing gas fees​​​​.\n\nUnleash the potential of leverage trading! Join Bybit today with our link, complete KYC, and earn up to a $40 bonus on a $100 deposit. Don’t miss out on this exclusive offer; claim your bonus now!\n\nImplications of Rising Ethereum Gas Prices\n\nRising gas fees reflect the growing demand for Ethereum’s network, particularly in the DeFi sector. However, this increase in fees can also lead to network congestion, affecting transaction speeds and costs for users.\n\nThe spike in Ethereum’s transaction costs has intensified interest in alternative layer-1 blockchains, such as BNB Chain, Solana, and Cardano. These alternatives are being explored for their lower fees and faster transaction capabilities, although it’s uncertain whether they will substantially impact Ethereum’s dominance in the DeFi sector​​.\n\nBut ultimately, increasing gas fees could potentially signal a market rally, which might be beneficial to leading Ethereum-based DeFi platforms. However, tokens like Uniswap (UNI) have seen some stagnation in prices despite the overall increase in transaction volumes and network activity​​.\n\nThe recent surge in Ethereum gas prices is a multifaceted issue influenced by factors like NFT launches, the transition to Ethereum 2.0, and increased DeFi activity. While it reflects the growing demand for Ethereum’s network, it also raises concerns about network congestion and prompts users and investors to explore other blockchain platforms. As the landscape of blockchain technology and digital finance continues to evolve, these developments will be important to look at in analyzing the state of the broader cryptocurrency market.\n\nEnhance Your Crypto Trading Skills With Our Legends’ Trading Masterclass\n\nEmpower your crypto trading skills with our Legends Masterclass. Sign up now and take advantage of our limited-time discount offer! Join the class today."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9IcldoY2otUkNwQ3BnRkRpeEo0TWhJbnNDNG1wSVcxRXozWFIyXzNQSzcwLUR2YzJ4RnRKSk1nQ25oX2hqUlhSZUxENUlDQlk5YlJfM015TkxucURMOWc3N003aHR6alczT2stRFBZZU8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin leaves the rest of the crypto market behind - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Fintech myFT Digest -- delivered directly to your inbox.\n\nHello and welcome to the final edition this year of the FT Cryptofinance newsletter. This week, we’re looking at the digital coin that bitcoin is threatening to leave behind. We’ll be back on January 13th.\n\nOne common — and not always unfair — criticism made by crypto enthusiasts is that the wider world conflates bitcoin and cryptocurrencies.\n\nIf the subject comes up over Christmas, chances are family and friends will use the two interchangeably. In their minds bitcoin IS the crypto market. Yet people working around it, or even have more than a passing interest, know there is much more going on.\n\nRight now, bitcoin is in a happier place than it has been for 18 months, supported by speculation that the SEC will approve a bitcoin exchange traded fund after Christmas. But the rest of the market doesn’t quite have that same warm fuzzy feeling.\n\nA large chunk of “the rest” is ether, the second largest cryptocurrency on the market, because of the blockchain it represents, ethereum.\n\nEthereum has always been a more ambitious project than the bitcoin blockchain, which is a database for transactions. It can hold assets and lets programmers code functions for buying and selling into smart contracts. That means it is the foundation for so much of the industry’s non-bitcoin activity ranging from decentralised finance (DeFi) projects and NFTs to gaming.\n\nHistorically, these markets have given ethereum a unique position of strength over competing blockchains: if one sector of the industry explodes, so should ether.\n\nBut while ether has climbed a respectable 93 per cent this year, it has underperformed bitcoin (up 162 per cent), Solana (up over 550 per cent), and Cardano (up 154 per cent).\n\n“This year ether has been totally outshined by the excitement related to bitcoin,” said CK Zheng, co-founder and chief investment officer at crypto hedge fund ZK Squared Capital.\n\nFor ether, the problem is that these cutting-edge crypto projects, like decentralised finance, NFTs and gaming — the ethereum network’s bread and butter — still haven’t shaken off their past.\n\nProjects like DeFi crypto exchange Uniswap have yet to generate any mainstream buzz, crypto-inspired games like Axie Infinity are today synonymous with North Korean hacking exploits, and NFTs have only recently made headlines for blinding party goers in Hong Kong.\n\nAs far as the non-bitcoin crypto market is concerned, the coins that have performed best this year are the ones exploring the links between crypto and artificial intelligence.\n\n“The demand for AI investments has found its way into crypto,” said Ram Ahluwalia, chief executive at investment adviser at Lumida Wealth Management. “Crypto tokens linked to AI have emerged as one of the strongest crypto investing themes,” he added.\n\nWhether there are overlaps between crypto and AI is a theme for another day. For now, they are the kingfishers catching the sunlight. “It’s not surprising to see the far superior returns of AI-related tokens compared to other tokens,” added Zheng, adding that these tokens will be “the most exciting theme going into 2024.”\n\nBut ethereum’s lacklustre year behind bitcoin is not all down to being superseded by the latest tech hype cycle. US regulators are still pursuing cases that could end up defining ether and other crypto tokens as securities.\n\nAnd ethereum also has to face up to its own disappointments. In September last year the network underwent a supposedly revolutionary surgery with the “Merge”. It was a technical operation, blending one ethereum blockchain with another, but came with big promises.\n\nBefore the Merge, if the ethereum network were a country, it would have ranked in the world’s top 35 by energy consumption, surpassing nations like Belgium and Finland.\n\nThe Merge virtually eliminated the network’s carbon footprint, and when I dedicated 2,500 words to ethereum’s supposed revolution, everyone I spoke to told me it was the removal of the biggest obstacle to mainstream adoption. Ether would even come on to the radars of ESG-conscious investors.\n\nIn fact, the anticipation for a record-setting future was so intense that YouTube’s former head of gaming Ryan Wyatt told me that crypto could soon focus on “onboarding the next billion users.”\n\nBut the price of ether fell in the months after the Merge, and while it has recovered, those billion users haven’t materialised.\n\n“If the expectation was that the Merge would boost investments from ESG-minded investors I think that expectation would be premature,” said Alex de Vries, co-founder of Digiconomist, a website that tracks the environmental impact of the crypto industry.\n\nInstead, ether is at risk of being eclipsed by bitcoin. At the time of the Merge, bitcoin’s market capitalisation represented roughly 40 per cent of the entire crypto market and ethereum’s share was 18 per cent, according to industry data aggregator CoinMarketCap.\n\nToday ethereum accounts for 17 per cent while bitcoin’s share has expanded to 52 per cent.\n\nIf conversations with family and friends this Christmas do veer down the cryptocurrency road, good luck in explaining it. And even better luck in explaining how it’s not all about bitcoin.\n\nWhat’s your take on ether’s future? As always, email me your thoughts at scott.chipolina@ft.com.\n\nWeekly highlights\n\nEarlier this week failed crypto exchange FTX settled with its debtors after its collapse in November last year. The agreement, subject to the approvals of the US bankruptcy court and Supreme Court of The Bahamas, will pool the assets of the FTX debtors and exchange’s Bahamian unit to ensure customers receive “substantially identical relative distributions.”\n\nETF speculation heated up yet again this week when BlackRock — the largest asset manager in the world — disclosed in a fresh filing with the Securities and Exchange Commission that its proposed fund would only allow new shares to be created with cash, instead of bitcoin. The move, while hardly groundbreaking, was taken as yet another sign that the Wall Street giant is making headway with the regulator.\n\nSoundbite of the week: A big freeze from the BVI\n\nRemember Kyle Davies and Su Zhu, founders of collapsed crypto hedge fund Three Arrows Capital? Sadly the courts won’t leave them alone to continue painting and surfing.\n\nA court in the British Virgin Islands this week issued a worldwide freezing order hitting over $1bn of their assets. The order also goes after Kelly Chen, Davies’s wife, representing the latest effort by the liquidators to return assets to creditors of the collapsed business.\n\nThe order turns up the heat on the disgraced founders by closing as many possible avenues available to access funds. Zhu was imprisoned in Singapore in September for four months for failing to co-operate with investigations into Three Arrows’ failure; the whereabouts of Davies remains unknown.\n\n“The order is specifically designed to prevent the founders and Ms Kelly Chen from disposing of or otherwise dealing with assets in any way that might frustrate eventual enforcement by the liquidators.”\n\nData Mining: Tether’s Christmas naughty list\n\nLast month Tether, the company behind the largest stablecoin, signed up the US Department of Justice, Federal Bureau of Investigation and the US Secret Service to help prevent illicit use of its USDT token.\n\nUnsurprisingly the number of blacklisted Tether wallets has shot higher. Total numbers of banned wallets are up 20 per cent to 1,236 so far this month, according to CCData.\n\nFT Cryptofinance is edited by Philip Stafford. Please send any thoughts and feedback to cryptofinance@ft.com."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQY3N5eV90Q3l6c2x1ZV94b2pJLWEwQWtRR3JKWC1sX1pOWFVvU1hZcG9IdzJVOER2a3EzOVdpb2l3TEdxNE9zUm5vUEtJM0k2c2pYa25md2VLUURqRnZyZVZYeXZIMmZVMHR3WURVTmZKRk5ULTJCbkVvV2tiRkl3NzlHdS1hWGZlYTRiaEx1MNIBlAFBVV95cUxORFZiYTZQNVpzRFN5Ymt3RThxNDUzbGhZTkN5TE5nZDVDUFNuTllhdHVsLWl2NlVYX3N3WFVEaFRuT0RhdHZPeEptTmZWeU8ySG9PWjNuQmw5dHFOa01KdlluMWRYQ2FteHo1Yng4djZBWUJja2thb1kyaTA0WlZkUF9XbkRVRDB3aS03T1dLUTBVM0xw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin's Mom's Token METIS Skyrockets 36% in Epic Ethereum Rally - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a noteworthy development, Metis token, associated with MetisDAO and led by Natalia Ameline, mother of Ethereum founder Vitalik Buterin , has experienced a significant 36% surge in the past 24 hours, reaching the $39 per token mark during the ongoing Ethereum rally.\n\nAdvertisement\n\nCoinMarketCap's recent layer-2 sector token ranking places Metis in eighth place, with a capitalization of $168.55 million. The token has demonstrated superior performance in the last 24 hours and an impressive 106% increase in the last 30 days, positioning itself as a standout performer in the Metis ecosystem.\n\nMETIS to USD by CoinMarketCap\n\nThe surge in the Metis price can be attributed to the announcement of the creation of a $100 million initiative aimed at supporting the growth of the Metis ecosystem.\n\nScheduled for distribution in the first quarter of 2024, the fund will facilitate sequencer mining, retroactive funding and the development of new projects, fostering a community-driven approach managed by the MetisDAO Foundation and token holders.\n\nWhat is Metis?\n\nMetis stands out in the layer-2 landscape due to its efficient use of Optimistic Rollups, facilitating quick and cost-effective transactions on the Ethereum blockchain by consolidating multiple transactions into a single batch."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQc1dYeDFkY0xfSVRoUlZOdWhNaTNUdHpZQnJuTVJNRXo4SHpjUnowNThxODVDamNNNm45OWJQekhGaDkwQkJmMjRLU19hNnRyT1kzbjl3eWNMYWdObkVoUnNWVUJvNlgyaHlHcDRscWlUWmJUSDhHMDFoLUJkbDJKYVBidWxiSG1pOW1SaWRhM2FRb3dwcWZBR25qMEthOGtWREVkYmVhQ2vSAa4BQVVfeXFMT3kyZDBvbWRGNVdCY2U2Z3pCSW1uUEJNdGxjYUdMak9ReEVlM29uQXlWNkExN1VMTTVHYVc2SWpQMzVpRV9JTmxmUFZ6LVZ5YUphRXlCQzd6M2VnQ1Q5ekdfWEFEUnotcjJTeU1Gd1lCTmRRR0xzYzBseE1lQ3BtVkpkOFFEWE5BbmotVF9lWVBuWDkzdUk3TTJOT0p5dDV6VV9UaGZJSHB1SkJORFd3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Crypto Analyst Predicts ‘ETH can easily hit $10,000’ In Next Bull Run - Investing Haven",
        "content": "A recent post on X by Altcoin Daily caught our attention when they made a bold projection for Ethereum hitting $10,000 in the next bull run.\n\nEthereum price can EASILY hit 10k! 🛸 🌕 – deflationary\n\n– high yields\n\n– massive dev activity\n\n– P/E ratio of 98 (better than Amazon)\n\n– staking ratio keeps increasing\n\n– no sell pressure from miners anymore\n\n– 99% more energy efficient (than last cycle)\n\n– thriving L2 scene\n\n– EIP4844… pic.twitter.com/M5gDN15cg2 — Altcoin Daily (@AltcoinDailyio) December 19, 2023\n\nFor context, ETH is currently trading around the $2,300 range – giving their ETH prediction a 350% gain in order to reach $10,000.\n\nWhile our ETH prediction is not quite $10k, let’s identify some bullish trends for the second most popular crypto (behind Bitcoin).\n\nETH staking yields\n\nNo. 1 is the adoption of ETH staking – and the promising yields it can return investors.\n\nFor staking your Ether you could get anywhere between 4-6% depending on which exchange you’re using.\n\nNote, that in order to receive those yields – users have to stake their ETH for an average of one year, or 365 days.\n\nFor our US base, this may or may not be enough to cover the costs of inflation, though it presents a much better alternative to any US checking accounts, which offer meager savings’ yields.\n\nBlackRock spot ETH ETF\n\nThe crypto community and institutional investors alike are all excited for the BTC ETF, expected to be approved in Jan. 2024.\n\nHow does this affect ETH? Good question.\n\nThis shows institutional adoption at a mass scale for crypto. We note that typically institutions and large companies are slower to adopt trends.\n\n$ETH/usdt weekly It’s all programmed and you can cry all you want, but nothing will stop $ETH from getting back to its previous all time high. You don’t fade BlackRock + #Ethereum … EVER pic.twitter.com/ZRARZnieNw — Satoshi Flipper (@SatoshiFlipper) December 22, 2023\n\nOnce they do, we expect more retail investors to pile back into crypto.\n\nThe BTC spot ETF will give a view of ‘safety’ to crypto, whereas institutions have previously been cautious about anything blockchain related.\n\nAfter the BTC spot ETF gets approved, BlackRock is likely to turn their attention to ETH, the second most-popular crypto.\n\nWhile there has been a delay to any potential ETH spot ETFs until May of 2024, this could mark a sector rotation into ETH.\n\nWhat do we mean by sector rotation?\n\nRetail may be more willing to put up capital toward ETH than BTC due to lower buy-in costs.\n\nWeb3 Dev Activity Dominance\n\nMany of the complaints directed toward the ETH bear case, is the high gas fees.\n\nWhile this is the ‘elephant in the room’, so to speak, this can be overlooked by Web3 dev activity.\n\n\n\n\n\n\n\nETH → Conglomerate of bullish patterns. Waiting for growth ↑ by RLinda on TradingView.com\n\nEthereum dominated trends of protocol preferences in the U.S., with 18.8 billion (38.9%) of node requests.\n\nNearly a 40% market share of node requests is indicative to us that Web3 will be dominated by ETH, and its various projects/apps launched on the network.\n\nIt’s like the old saying ‘follow the money’, except in this case, we’re following the dev trends.\n\nWill ETH hit $10,000 in 2024?\n\nWhile there’s too much economic uncertainty to make such a bold claim, ETH seems like a very likely candidate to at least hit $3,500-$4,000 in 2024.\n\nWith the ETH bull catalysts mentioned above, it’s feasible to see it reaching $5,000, but our readers know how volatile crypto can be.\n\n$10,000 for ETH seems feasible by 2025, but at this point there are too many unknowns to make such a bold proclamation.\n\nSummary\n\nIn summary, we are bullish on ETH and will continue to provide our readers the latest ETH news and trends.\n\nConsider subscribing to our paid Crypto newsletter to get the latest ETH updates and be alerted of any updates to our crypto projections.\n\nWhile $10,000 seems like a long shot for ETH in 2024, we are excited about the future and will look to be accumulating more Ethereum over the next few years.\n\nDisclaimer: this is not financial advice. At InvestingHaven we use models, chart analysis and fundamental analysis to make informed commentary on crypto, stock and precious metal trends."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBza3VzbUdtejZaQnlESVNpbkZzcDlvN3RqWFo1NkxScDR0djI4bFZWMlU4b1d5bnNfRWoyX1NhX3dJdWIyWkxwbHRVakdSMWh0dG04UnotQ3VnWXIzelpDTmdGd3hYUkhyVy1mbnltOEdrM3lFd0ViVlZrVE1XdTDSAYQBQVVfeXFMTW5RWExwNTdCRzlONnlJRXhRNTYweHRreF9CTVQ5bE82em52MEtUMTZSZE1BMkFEZnc4SE1UMWJVYlhWdU11QXBJX3pNRmlUcVhhdFNnZTBWdmVIeXJJNEhPZW10djZyaGtrMDJUT1FFRmZiNmROV0NudTBPSHZhNDRKQzFU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Over 200,000 Ethereum Tokens Sent To Centralized Exchanges - A Threat To ETH Price? | Bitcoinist.com - Bitcoinist",
        "content": "Following a relatively quiet start to the week, Ethereum’s price seems to have returned to some of its early December promises. However, the latest on-chain revelation shows that the “king of altcoins” might be facing some uncertainty over the coming the coming weeks.\n\nA massive amount of ETH has made its way to centralized exchanges over the past few days, resulting in a spike in the Ethereum balances of these platforms.\n\n200,000 ETH Sent To Exchanges In Four Days – What’s Next?\n\nIn a post on the X platform, a crypto pundit revealed that investors have been moving massive amounts of Ethereum to centralized exchanges over the past few days. This on-chain revelation is based on the “Balance On Exchanges” metric from data analytics platform Glassnode.\n\nIn just the past 96 hours, approximately 200,000 $ETH, valued at around $460 million, have been transferred to known #crypto exchange wallets. Such a substantial spike could indicate upcoming #Ethereum price volatility. pic.twitter.com/N09a0NZLvR — Ali (@ali_charts) December 22, 2023\n\nAccording to the data from Glassnode, around 200,000 ETH (worth more than $460 million) have been transferred to known cryptocurrency exchange wallets in the past four days. When most cryptocurrencies are sent to centralized exchanges, it typically suggests that some investors might be looking to offload their assets.\n\nTotal balance of Ethereum on all crypto exchanges | Source: Ali_charts/X\n\nExchange inflows can be an indication of sell-offs, as investors often use these centralized exchanges for the purpose of selling assets. Consequently, the transfer of massive crypto amounts to these platforms could trigger downward pressure on the price of a crypto (Ethereum, in this case).\n\nMoreover, the crypto pundit noted in their post on X that a substantial spike in exchange inflows could indicate upcoming price volatility for ETH. This implies that there is an increased likelihood of big price swings in the near future.\n\nEthereum Price Overview\n\nHowever, it is worth noting that there has not been any clear impact on Ethereum’s price so far. As of this writing, the cryptocurrency is valued at $2,287, reflecting a mere 1.4% price growth in the past 24 hours.\n\nOn the weekly timeframe, the price of ETH has also been quiet, with barely a percent increase in the past seven days. This emphasizes the altcoin’s struggles to hold above $2,300 despite making it above the price mark on Friday, December 22.\n\nNevertheless, Ethereum maintains its position as the second-largest cryptocurrency in the sector, with a market capitalization of more than $274 billion.\n\nEthereum price faces rejection at $2,300 on the daily timeframe | Source: ETHUSDT chart on TradingView\n\nFeatured image from Bernard Marr, chart from TradingView"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOd3RXRUlmWmZETFJuTmtBSVg0bEJwN3daUjNGVFdwc3lDVGRGOW1qOWtoRWlhVWcwT3RST3JtSnkyQWFSbVZqeHJpNTVJODFvbnBraXZmSHhiektBbU5hZk0ybENKaGFXN1pSMHdVZUd5SUN6N1ZHenVKdHh6R0hkcjZ6SWlZUk50Q21KYXJvaThld2F0TDFNUWp5Z1RReEVEU29qbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "MOLLARS presale ongoing, project building a decentralized store of value ecosystem - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nThe initial coin offering for MOLLARS, a store of value token on Ethereum (ETH), is now live.\n\nDesigned to serve as the new “Bitcoin (BTC)” of the ERC-20 and Ethereum community, crypto traders have already purchased 0.07% of the total supply of MOLLARS allocated.\n\nWhat this new ERC-20 token is about\n\nMolars is a fully decentralized, community-driven project, designed as a store of value token for the Ethereum ecosystem.\n\nIt aims to become the “Bitcoin of Ethereum’s blockchain” with no owner and no tokens being held by developers, just as Satoshi is believed to have done with Bitcoin.\n\nThe ongoing token presale is to raise funds from the community to build technology, market, and launch a single web3 product that will be a catalyst for MOLLARS demand.\n\nSo far, over 18,000 MOLLARS have been bought.\n\nCrypto Investors can use Tether (USDT), Ethereum (ETH), or a credit card to buy the token.\n\nThe project plans to raise $2 million, the hard cap, by the time the crowdfunding event ends in mid Q2 2024.\n\nIn the first stage, reading from its roadmap, funds will be used to develop its smart contracts. This code will be foundational to the platform. Accordingly, it will be audited before deployment.\n\nYou might also like: Grass raises $3.5m as Polychain Capital and others bet on decentralized AI\n\nMOLLARS powers all transactions in the platform. It also complies with the ERC-20 standard of Ethereum, making it compatible with already existing decentralized finance (defi) infrastructure and protocols.\n\nThe platform’s design combines elements of meme coins, fostering engagement and fun, and those of mainstream altcoins. As such, MOLLARS is viewed as a utility.\n\nMoreover, MOLLARS plans to release a web3 product on the same day its token is listed on crypto exchanges.\n\nThe product would be a utility, integrated to add tangible value to MOLLARS, allowing its holder s to carry out transactions, raise awareness, onboard more token holders, and stimulate an increase in daily transactions.\n\nLiquidity and governance\n\nSimilar to the original design of Bitcoin, MOLLARS focuses on building a community of retail investors due to its commitment to decentralization, thereby eliminating the centralization of control.\n\nAs such, the MOLLARS distributed follows guiding and foundational principles guiding decentralized crypto projects.\n\nYou might also like: SpaceX’s DOGE-1 mission to moon reportedly delayed\n\nFunds raised in the ongoing presale will go into developing its long-term liquidity pool (LP) of $1 million.\n\nThis LP will of course be verified with governance verification.\n\nThe 7-figure pool would help provide a solid foundation for MOLLARS’ liquidity, even supporting prices and ranking on crypto indices such as CoinGecko and CoinMarketCap."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNU2JtUDV5bFBLNXFmZmFLV1Ywb0dXYWNsVUVSYjFVUU16dmJrOUFSU21qaldVNHlqWk5OT0Z1U0ZyNWRUYWctcW9aN29Na0trTGhsYkdnZFlfbW5YUmVMaHB5WlFRWmg1NXZvTmo5dXg2X3FsUWdlR0k0V3dOeDhlZ2c5bzZmTjd2bThRcNIBkgFBVV95cUxQakVOLWNteHBEYktOWkM5bGpFazNpWTVWQ1hDNXNrX1RPN0VFdzBFUzdWVy12aGlNemx4ek56aUV4aGhtN3o1cGZFLW1fS2h1T1JhcVBZd0RoanRIRmR2UDFSbDNsdXUtNUtmRS1UU2ZHNmVMam1ranhfX016VzJ1dkhOdXROUzBQYm5kVFNlX1ozdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "BitMEX’s Arthur Hayes Dumps Solana & Predicts Ethereum To Hit $5000 - CoinGape",
        "content": "In a surprising turn of events, BitMEX co-founder Arthur Hayes, a prominent figure in the cryptocurrency space, recently made waves in the digital asset space with his comments on Solana and Ethereum. Meanwhile, Hayes took to the X platform to reveal a divine revelation and share his strategic shift in investments.\n\nSo, brace yourselves as we delve into the intriguing details of Arthur Hayes’s unexpected maneuvers and the ripples they’ve sent across the cryptocurrency landscape.\n\nadvertisement\n\nArthur Hayes Shifts Gears From Solana To Ethereum\n\nBitMEX founder Arthur Hayes has sent shockwaves through the crypto community with his investment decisions on the X platform. Hayes ‘confessed’ to receiving a divine “message” during “meditation”, urging him to part ways with Solana (SOL) and embrace “Archangel Vitalik” or Ethereum co-founder Vitalik Buterin by investing more in Ethereum (ETH).\n\nMeanwhile, Hayes stated that this has led him to dump Solana and accumulate more Ethereum. In addition, he also made a bold prediction for Ethereum price, saying it is going to hit the $5,000 mark.\n\nNotably, the timing of Arthur Hayes’s move adds a layer of complexity to the unfolding drama, coinciding with Solana’s remarkable surge in the market. The SOL crypto has recently climbed toward the $100 milestone, surpassing BNB to claim the 4th spot in the crypto rankings.\n\nAlso Read: Bitcoin’s Profit Supply Ratio Flashes Signs of Caution, Altcoins Provide Opportunity\n\nPrice Comparison Of The Two Cryptos\n\nThe crypto market has witnessed a bullish momentum today, as evidenced by the surge in most of the major crypto prices. Meanwhile, as of writing, the Ethereum price was up 2.87% to $2,259.54, and its trading volume soared 0.53% over the last 24 hours to $12.97 billion. Notably, the ETH price hit a high of $2,278.12 and a low of $2,205.40 over the last 24 hours.\n\nOn the other hand, the Solana price has witnessed a massive pump of 15.48% at the time of writing and traded at $97.55, suggesting strong confidence of the investors towards the crypto. Meanwhile, the trading volume of the crypto also noted a surge of 31.52% to $5.46 billion. Notably, the SOL price has touched a high of $99.12 in the last 24 hours.\n\nMeanwhile, as the crypto community grapples with the implications of Arthur Hayes’s actions during Solana’s bull run, opinions diverge. While some see it as a cause for confusion, others interpret his Ethereum prediction as a potential catalyst for a bullish run on the second-largest crypto by market cap.\n\nAlso Read: Crypto Market Rallies As BTC, Pepe Coin, NEAR Take Lead\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE4tdFRjV1l5bjlORTZVNllNSjRDa3A1aktheTFKTjFIRkRJQUlrT1c3M0JHaXJEUklwc0hEZ2NjbEY2R2FVMDZ5N0RLOWltNHNhQTJDSU43Y2kxV2ZiQjJ0c1k4WllrbnU5c0Jv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Understanding The Current Ethereum Price UK - Markets.com",
        "content": "On Monday, December 11, 2023, Ethereum was trading at £1,795.70 per coin. This represents a nearly 4% drop from Sunday’s price of £1,865.69. The weekly high came on Saturday the 9th when the Ethereum price in the UK hit £1,880.69.\n\nSince then, it has been on a downward trajectory, falling to £1,870 on Friday and £1,777 on Thursday before recovering slightly to £1,821 on Wednesday the 6th. Tuesday the 5th saw the weekly low price per ETH coin at £1,775.65.\n\nThe 7-day price history shows volatile but ultimately declining value for Ethereum when priced in GBP. The coming days and weeks indicate whether this is a temporary price correction or a more sustained downward momentum. Nevertheless, Ethereum remains a top cryptocurrency with a significant market presence.\n\n\n\nCheck out this article: Understanding Crypto CFDs: Advantages and Risks\n\nHow Much Is Ethereum Per Coin UK?\n\nThe value of Ethereum (ETH) compared to the British Pound (GBP) has seen its fair share of volatility over the years, but as of December 2023, the exchange rate stands at a stable point.\n\nA single ETH token converts to GBP 1,795.70 at the most basic level. Larger holdings of ETH carry ever-greater value in pounds sterling—two ETH converts to £3,591.40, five ETH equals £8,978.49, ten ETH comes to £17,956.99, and so forth in ascending denominations. Even fractional ETH reserves still translate into usable GBP sums—0.01 ETH covers £17.96, and 0.1 ETH comes to £179.57.\n\nFor large-scale crypto investors or institutions, the immense value of high-volume ETH holdings becomes clearer when converted into pounds. 20 ETH today equals GBP 35,914, showing that mid-level holdings still carry tens of thousands of pounds in real economy value. At even higher volumes, we see 50 ETH valued at GBP 89,785, 100 ETH hitting GBP 179,570, and 1,000 ETH reaching over GBP 1.7 million.\n\nLearn to trade with this article: Crypto Trading: The Ultimate Beginner’s Guide\n\nWhat Is The All-Time High Price Of Ethereum In GBP?\n\nThe current all-time high price for Ethereum was reached on November 10, 2021. At that time, 1 ETH traded for as high as £3,610.11 in British pounds sterling based on historical exchange rates.\n\nThis represents the peak Ethereum value reached in GBP terms so far. However, with increasing adoption and development, the record high could one day be surpassed.\n\n5 Factors Influencing ETH Prices In The UK\n\n1. Supply And Demand Fundamentals\n\nThe price of Ethereum depends heavily on demand growth, outpacing the slowly increasing token availability. The more Ethereum is used and adopted for decentralized finance, NFTs, metaverse applications, enterprise solutions, and other use cases, the higher the demand for ETH puts upward pressure on prices.\n\nAs developers build on Ethereum and real-world usage grows in these cutting-edge domains, speculation on future growth potential will likely increase the Ethereum price UK.\n\n2. Competition From Other Smart Contract Networks\n\nWhile Ethereum is currently the dominant global smart contract blockchain network, it does face increasing competition from alternative layer-1 blockchain projects like Cardano, Polkadot, Solana, etc.\n\nAs investors evaluate whether these networks may gain ecosystem share from Ethereum or fragment future demand and usage, the increased competitive threat can weigh Ethereum's price UK or temper the upside. However, if Ethereum maintains its first-mover advantage, this factor would have a limited impact on its price resiliency.\n\n3. UK And EU Regulations\n\nThe regulatory stance taken by UK and EU policymakers also influences crypto prices significantly. Any indications of restrictive policies or regulations around investing, trading, transacting, or holding crypto-assets would dampen the Ethereum price UK. For example, if regulators outright banned financial institutions from facilitating crypto transactions, it could spark investor uncertainty and suppress prices. More crypto-friendly regulations could enable greater mainstream institutional and retail adoption, providing a bullish impulse.\n\n4. Mainstream Adoption\n\nThe more Ethereum expands into mainstream finance and commerce, powered by trends like decentralized apps/protocols, NFTs, and the metaverse, the more its real-world utility and value grows. Major banks exploring DeFi applications, leading corporations buying virtual real estate in blockchain-based metaverse environments, and surging individual usage of services like Uniswap or OpenSea drive fundamental demand for ETH, supporting higher valuation.\n\n5. Media Hype And Sentiment\n\nAs with any asset, excessive positive hype or negative publicity can move crypto prices sharply, often disconnected from underlying network fundamentals. Highly speculative and volatile, Ethereum prices are quite susceptible to growing or fading public enthusiasm. Viral media narratives lauding innovation potential or criticizing its complexity sway investor psychology either way. This makes ETH prices strongly sentiment-driven.\n\nTo further expand your knowledge about ETH, read this article: What is cryptocurrency and how does it work?\n\nIn Essence\n\nEthereum and other cryptocurrencies remain highly complex and risky investment assets. While the potential upside is immense for early adopters, the extreme volatility also brings the potential for losses. Still, blockchain technology promises tremendous innovation across industries.\n\nFor traders new to this space, ample research and learning of risk management strategies is essential before buying digital assets like ETH. With an informed approach, allocating a responsible portion of your portfolio to ride future waves in this emerging asset class may be worth it.\n\nBut caution is always warranted as regulations and competition continue shaping the landscape. By continuing to educate yourself, you can make wise choices balancing risk and reward in these unfamiliar markets.\n\nLearn and trade with markets.com: The ultimate trading community!"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPQjdCSnhHeVpUYloxVVBwcnZ3NGktTmtST2NNMUppeEcxZ3lOMjM4a2dKOWNMeFFSRnVaa240dWFiUExjODcwWVRaX0RCTXljdTNTcjU1b1BMT2hvVlMxZlFkRk80eF9aREtyeW81eFVtblZ5V2poSkw1LUJVaVBGNG1IWVhMVzFqOHltTEN1Q1pITXlWUm9CQnhQY0dTZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "What is Immutable X? Demystifying the Layer 2 solution for NFTs and Web3 gaming - OKX",
        "content": "Entering the list of advanced new blockchain solutions, Immutable X is considered by many a revolutionary Layer 2 solution on the Ethereum blockchain. This new player in non-fungible token (NFT) minting and GameFi stands out for its unparalleled features. It offers gas-free NFT minting and seamless integration into the vast landscape of mainstream gaming.\n\nIn this comprehensive guide, we explore Immutable X, uncovering its nuances, technological foundations, and influence in the world of blockchain gaming.\n\nWhat is Immutable X?\n\nImmutable X is a Layer 2 scaling solution within the Immutable ecosystem designed for Ethereum (ETH). Its primary focus is on NFT minting and Web3 gaming. Launched by James Ferguson, Robbie Ferguson, and Alex Connolly in Australia in 2018, Immutable X aims to democratize Web3 game development, providing a gateway for millions of gamers globally to seamlessly navigate the complexities of blockchain technology.\n\nImmutable X was a response to the challenges faced by gamers engaging with \"Gods Unchained,\" the world's first NFT trading-card game. The platform set out to address the high trading costs of NFTs within the game, setting the stage for its transformative trajectory. Immutable X has since evolved into a versatile gaming-specific blockchain, prioritizing cost-efficiency, scalability, and rapid transaction processing.\n\nHow does Immutable X work?\n\nThe technology behind Immutable X\n\nAt the heart of Immutable X's functionality lies the groundbreaking Zero-Knowledge Rollup (ZK-rollup) technology, a Layer 2 scaling solution powered by StarkWare. ZK-rollup technology combines multiple transactions into a single zero-knowledge proof, also known as the zk-STARK proof, on the Immutable network. The transactions are then securely moved as a single unit onto the Ethereum blockchain. Smart contracts then validate the proof, maintaining transaction details at this layer. This process guarantees near-instant confirmation, all while keeping gas fees minimal.\n\nEmpowering developers with REST APIs and SDKs\n\nImmutable X's REST APIs and software development kits (SDKs) are powerful tools empowering developers within its ecosystem. The REST APIs, or application programming interfaces, provide a streamlined approach to complex blockchain interactions. Through API calls, users can easily create and transfer NFTs without the need for direct interaction with smart contracts. This simplifies the development process, allowing for efficient integration into various platforms, spanning from gaming applications to broader decentralized ecosystems.\n\nAlongside this, SDKs support the seamless incorporation of APIs and crypto wallets into diverse applications. This not only accelerates the development timeline but also enables developers to construct NFT projects, including innovative play-to-earn games, in a matter of hours rather than weeks.\n\nExtending functionality with Immutable zkEVM\n\nImmutable boasts another Layer 2 solution, Immutable zkEVM, incorporating Ethereum's Virtual Machine (EVM) functionality. Powered by Polygon, Immutable zkEVM allows developers to launch smart contracts on Ethereum's Layer 1 chain and subsequently register them on Immutable. Immutable zkEVM supports effective interoperability, allowing game developers to create experiences that seamlessly interact with other games or platforms within the Ethereum ecosystem. This can broaden access and promote economies of scale.\n\nWhile Immutable X boasts zero gas fees, applying Immutable zkEVM generates minimal gas fees for using Ethereum smart contracts. These fees, although small, are notably negligible compared to the Ethereum main chain.\n\nOffsetting the carbon footprint\n\nImmutable has taken a step towards sustainability through its carbon-neutral approach. Addressing concerns related to the environmental impact of blockchain technology, the platform actively counters the carbon footprint associated with minting and trading NFTs.\n\nImmutable's approach begins by significantly reducing gas usage per NFT trade or mint, diminishing its carbon footprint. Using zero-knowledge proofs, Immutable compresses the information required for NFT transactions, making them more energy-efficient.\n\nGoing a step further, Immutable commits to offsetting the carbon footprint of all NFT transactions on its platform to zero by purchasing carbon credits. This initiative extends to NFT marketplaces and games built on Immutable, making sure the entire ecosystem is carbon-neutral.\n\nImmutable's dedication to sustainability not only aligns with the growing demand for eco-conscious initiatives but also establishes a responsible and ethical standard within the blockchain industry.\n\nWhat are the benefits of using Immutable X?\n\nImmutable X stands out as a top choice for NFT enthusiasts, offering a multitude of compelling benefits. With features like instant trade execution, zero gas fees, a remarkable capacity of up to 9,000 transactions per second (TPS), and a commitment to environmentally friendly practices, the platform delivers a seamless and cost-effective trading experience.\n\nSecurity takes precedence on Immutable X, as it leverages ZK-rollups to establish a secure and tamper-proof environment for NFT ownership and transactions. The platform's integration with the Ethereum ecosystem also enables users to effortlessly engage with various Ethereum-based platforms, services, and tools, fostering a smooth and interconnected experience within the broader Ethereum network.\n\nMeanwhile, the inclusion of extensive APIs and SDKs enriches the overall user experience, empowering developers with robust tools to innovate and create within the Immutable ecosystem.\n\nWho created Immutable?\n\nImmutable, the company behind Immutable X, is steered by a visionary team led by James Ferguson, recognized as a Forbes 30 Under 30 entrepreneur, and supported by his brother Robbie Ferguson. The project boasts investments from prominent crypto VC funds, including Coinbase, Naspers, Nirvana Capital, Apex Capital Partners, Continue Capital, and Galaxy Digital.\n\nWith the Ethereum Merge completed, Immutable may continue its development within the scaling Ethereum ecosystem. Partnerships with Param Labs and Ambrus Studios, along with the launch of a wallet SDK, underline Immutable's commitment to enhancing the developer experience and fostering growth.\n\nImmutable's native utility and governance token: IMX\n\nImmutable's native utility and governance token, IMX, is an ERC-20 token central to the platform. It serves as a cornerstone for transactions, governance, and active participation. With multifaceted functions, IMX is integral to the smooth operation and expansion of the Immutable ecosystem.\n\nTokenomics and distribution\n\nIMX employs a robust tokenomics model designed to align incentives and foster a thriving community. A departure from traditional Proof of Work (PoW) cryptocurrencies like Bitcoin (BTC), utility tokens are pre-mined and thoughtfully distributed by the project's team.\n\nAs outlined in the white paper, the maximum total supply of 2 billion IMX tokens is strategically allocated to ecosystem development (51.74%), project development (25%), public sale (5%), private sale (14.26%), and foundation reserve (4%).\n\nUse cases\n\nThe IMX token is intricately woven into the fabric of Immutable, creating an economic system where participants are rewarded for contributing to the network's growth and stability. The community uses IMX to pay transaction fees and access exclusive features or services. Moreover, IMX token holders wield governance power, enabling them to vote on crucial proposals, including reserve token allocation, developer grants, and changes in token supply.\n\nStaking IMX tokens is another rewarding endeavor within the Immutable ecosystem. Participants who choose to stake their IMX holdings receive staking rewards in the form of additional tokens or governance privileges. This mechanism not only encourages long-term commitment but also contributes to the overall security and stability of the network.\n\nThe Immutable ecosystem: Gods Unchained and beyond\n\nAs a dedicated blockchain for NFT trading and gaming experiences, Immutable has strategically positioned itself as a go-to platform for game developers seeking to leverage the potential of blockchain technology. Within the expansive umbrella of games and collectibles, Immutable's ecosystem hosts a rich tapestry of decentralized applications (DApps), creating a fertile ground for innovation and exploration.\n\nWhile \"Gods Unchained\" is considered by many to be the inaugural masterpiece, Immutable's platform is behind numerous other titles.\n\nGuild of Guardians: A roguelite mobile RPG where players build their team of Guardians to battle against the threat of the Dread while earning rewards.\n\nEmber Sword: A social sandbox MMORPG that offers a PVP and PVE player experience while allowing players to have true ownership of their in-game assets.\n\nMomoguro: A captivating storytelling RPG created by 9x Emmy-winning Baobab Studios.\n\nMetalcore: A multiplayer FPS that features mechs, tanks, infantry, and planes.\n\nIlluvium: An open-world RPG adventure game where players hunt and catch creatures to fight in arenas or trade them.\n\nThe support provided by Immutable extends beyond gaming giants, with an open invitation to developers worldwide to explore and contribute to the ecosystem. This inclusive approach fosters a diverse and thriving community, resulting in an ever-expanding collection of games.\n\nWhat's new with Immutable?\n\nIn March 2024, Immutable began dropping teasers on its X account about \"The Main Quest\". After you log into the platform's passport, you'll find a new rewards area. IMX holders have shown much excitement over X, with Immutable gearing up to open its rewards area up for more opportunities.\n\nIn another update, Immutable's Minting API marks a major advancement in the gaming and blockchain sectors. This update effectively tackles key issues that game developers commonly encounter, including complicated technical processes, challenges when managing wallets, and expensive gas fees. The Minting API streamlines and lowers the expense of creating in-game assets on a large scale.\n\nImplementing the Minting API can help support the creation of a new digital economy in games by offering batch processing, cost-effective transactions, and seamless integration with blockchain technology. Additionally, Immutable's promise to cover gas fees until September 2024 underlines its commitment to promoting a more inclusive and financially sustainable gaming ecosystem.\n\nThe final word\n\nAs Immutable solidifies its position in blockchain gaming, many expect the entity to continue to expand and innovate. Immutable is positioned as a transformative force in the gaming industry with a desire to lower barriers for both developers and gamers. The platform's continuous partnerships, technological advancements, and commitment to sustainability underscore its dedication to evolving alongside the ever-changing blockchain landscape."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBzUTJsMHJ5cUJsZ0hRNzZqanhSSlRxTm10SXREdktCUVB0U0lsUVJoU0x1X3A2TXNBWFk0ZGZVWms3c3pybEJqV1JRY0JRdW5LcG9HLWRReF9BMUttcjlvZDNRb1lmT29O0gFuQVVfeXFMTkltcHRCVk15NXZDdC10cGh3X2w4LW85cTluU21pSGluWlhoRkxELXpJVEZPNTktRWxGZzlqTmVQN1pHLWNBa216ckVjcE9tQ3BEUUhYWnRZZmxXNzZxZzNRVmlUY1lHeER5QkFzTHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 21:02:16 GMT",
        "title": "Solana Headed To $100? Here’s What’s Driving The Growth - NewsBTC",
        "content": "Solana (SOL) is flying high at the moment, and from all indications, the crypto token has no intention of slowing down anytime soon as it eyes $100. This is no doubt feasible, considering the several bullish narratives that continue to build up in the Solana ecosystem. Interestingly, SOL recently surpassed XRP to become the fifth-largest cryptocurrency by market cap.\n\nSolana DeFi 2.0 Is No Joke\n\nOn December 16, the official X (formerly Twitter) account for Solana made a post where it stated that “Solana DeFi 2.0 is just getting started.” Indeed, SOL may be up to something as its DeFi ecosystem continues to garner steam. Data from DeFiLlama shows that Solana has been going head to head to Ethereum in terms of DEX volumes on the respective chains.\n\nRelated Reading\n\nCrypto Analyst Says Ignore FUD, XRP Is Headed To $5.85 9 months ago\n\nSolana recently surpassed Ethereum in 7-day DEX volume for the first time in history. SOL has seen about $9.03 Billion in trading volume across all the DEXs on the chain in the last seven days. At the same time, Ethereum saw $8.836 Billion. This is more impressive when you consider the fact that Ethereum houses the most prominent decentralized exchanges.\n\nWith such liquidity flowing into the ecosystem, it is only a matter of time before SolaSOLna hits $100. Data from DeFi Llama also shows that many are doubling their stakes in the Solana ecosystem. At the time of writing, the Total Value Locked (TVL) on Solana stands at $1.20 billion, its highest level since last year.\n\nMuch credit needs to be given to the protocols that continue to build on Solana. One of them happens to be the liquid staking protocol Jito, which has over $570 million locked on its protocol. The DeFi platform recently distributed $225 Million in airdrop to SOL users causing new money to flow into the ecosystem.\n\nSOL price breaks $88 | Source: SOLUSD on Tradingview.com\n\nIs SOL Coming For Ethereum?\n\nFor a long time, Solana has been dubbed the “Ethereum Killer,” but that has never really materialized. The network has for a long time, suffered numerous outages, which made many assume that it could not match Ethereum. However, this time around, there is a growing belief that SOL is well-prepared to live up to the hype.\n\nIt is worth mentioning that the Solana network has been 100% uptime since the last time it recorded a network outage in February this year. This is also more commendable considering the surge in network activity that Solana has experienced in recent times.\n\nRelated Reading\n\nDogecoin Price In Trouble: Whale Transfers 85 Million DOGE To Robinhood 9 months ago\n\nIf Solana is somehow able to put these outages in the past, there is no doubt that people could look to it as a better alternative to Ethereum. An increase in its utility will also undoubtedly increase SOL’s value.\n\nARK Invest’s CEO Cathie Wood recently praised how Solana is “doing a really good job.” She further alluded to the fact that SolaSOLna is even faster and more cost-effective than Ethereum.\n\nAt the time of writing, SOL is trading at around $86, up over 10% in the last 24 hours, according to data from CoinMarketCap.\n\nFeatured image from Disruption Banking, chart from Tradingview.com"
    }
]