[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPOXZ5MEE4dlNZd1lTbDhFVVFMb0VTUC1CUktSVkxSb1pkdXlWbFc4MFhUdUJRZDlmTkl6a292TXBEcW5OcndtLURNaWRvU2hVUlN5SjNMbHJuNTl6ekZFZ25WVy1kMmVqVVhNUDZ4d20wanJjQ2Nvblp3bXFVcDhfb2dmUUZURzhWM004S1dsdmYyTXhNWVFEN3JBa2RuNUZTT3hJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Dec 2023 08:00:00 GMT",
        "title": "Ethereum burns $2.5B worth of ETH since merge as supply drops to 18 month low - CryptoSlate",
        "content": "Analysis of Ethereum’s recent financial data on Ultrasound Money reveals a continued shift in its economic model since the historic merge in Sept. 2022.\n\nThe decline in Ethereum’s supply stands at 309,663 ETH, equivalent to approximately $686.2 million. This reduction reflects a deflationary trend, contrasting the previous inflationary nature where new ETH was consistently created. The cause of this shift can be traced to the burning of 1,195,238 ETH, valued at around $2.65 billion. Permanently removing tokens from circulation plays a crucial role in reducing the total supply and could enhance ETH’s scarcity and value over time. Further, despite the issuance of 885,581 ETH, worth about $1.96 billion, Ethereum’s total supply experienced a net decrease, illustrating that the rate of ETH burning continues to surpass the rate of new issuance.\n\nPresently, the total supply of Ethereum stands at the lowest point since the merge at 120,211,380 ETH, translating to a market capitalization of approximately $266.39 billion, reinforcing its significant standing in the crypto market.\n\nA look at the ETH burning leaderboard presents further insights by analyzing the leading contracts contributing to the burning of ETH. The top contributors to this activity include major dApps and services, notably Uniswap in its various iterations, Tether, and OpenSea. Uniswap’s prominent position suggests a high transaction volume within the DeFi sector, with $543.8 million burned across four contracts in the top 10.\n\nThe presence of Tether indicates substantial stablecoin transactions on Ethereum’s network, while OpenSea’s inclusion highlights the enduring nature of NFT transactions even through the bear market. This diversity, encompassing DeFi platforms, stablecoins, NFT marketplaces, and Layer 2 solutions like Arbitrum, showcases the multifaceted utilization of Ethereum.\n\nBurned ETH Entity Value (USD) 84,006.46 Uniswap Universal Router $186,158,315.36 75,926.77 Uniswap V2 $168,253,722.32 74,739.31 ETH transfers $165,622,310.96 58,030.71 Uniswap Universal Router 2 $128,596,053.36 53,626.72 Tether $118,836,811.52 27,441.92 Uniswap V3 $60,811,294.72 26,935.76 New contracts $59,689,644.16 23,405.50 OpenSea $51,866,588.00 22,891.92 Arbitrum $50,728,494.72 22,201.66 MetaMask $49,198,878.56\n\nSource: ultrasound.money\n\nThe top 10 contracts total $1,039,762,113.68 worth of ETH burned, just under half of the total burn since the merge.\n\nEthereum’s transition to a deflationary model may continue to attract investors seeking a store of value, especially when contrasted with inflationary fiat currencies. The heightened activity in decentralized exchanges and DeFi applications indicates a robust trend toward decentralized finance.\n\nInterestingly, under its current proof-of-stake (PoS) model, the Ethereum network has burned an average of 1.83 ETH/min since the merge. However, since the burn mechanic was implemented as part of the EIP-1559 upgrade in Aug. 2021, the average burn rate is almost double, 3.09 ETH/min. Yet, due to the drastic reduction in supply issuance since proof-of-work mining was removed, the total supply has steadily declined.\n\nIf Ethereum had retained its PoW mode, the supply would have reached a mammoth 124,941,176 ETH, some 4.7 million ETH more than the current level. Theoretically, at the current price of $2,228, this would have given Ethereum a market cap of $12 billion higher than current $266 billion. Importantly, due to the increased supply, this is merely academic due to the nature of supply/demand market dynamics.\n\nLooking ahead, these dynamics may influence Ethereum’s trajectory in various ways. Continued deflationary tendencies could lead to increased demand and potentially higher ETH prices, assuming steady or rising demand coming out of the bear market. However, it’s essential to consider that market volatility and external factors like regulatory changes or macroeconomic trends can significantly impact these dynamics, especially with continued activity from the SEC in the U.S. toward categorizing PoS tokens as securities.\n\nIn summary, Ethereum’s post-merge statistics signal a notable move towards a deflationary framework, underscored by high network usage, particularly in the DeFi and NFT sectors, and the potential for heightened value due to diminishing supply. However, these trends warrant continued analysis and understanding of macroeconomic factors to comprehend their long-term impact and sustainability fully.\n\nMentioned in this article"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPWFFzbzlXTlprSnpkMmN4aWdxZlJ2a0FNc3F6U3pfZE96N3h1d3pXNlRlRFMtT0VWbWdYcjl2blppczg2dEFkUDJmQzlRTnc2OVFsTkpwVmhiMFVvbWZtWWd6Y2E4WmlGM1FEY3dIRUE0Ujk4V3EyWDZrc0J1TXJPQkVURTQ0WHFtZFFRWnZxMVZJaXFPakh6amRkZk91UnNxZDFsUlNKZmEtTmJTdXVtakNOZzJBemZIa0NsWmRhQW5NQUM2UUHSAcsBQVVfeXFMUDcwcmRGY05aa21vTVZ6cFIwQ3FZU0pRRENUNzFfcVhTTy1WaTZVNWJNTTlYczhDWThZRmhkNXhETUp3MmlqQzZxWDVpUnNfelUyZHJSdlVnUmF2eDZGbVZZY3M3cGZjX2JmT0ZWMjVoNUJ5UVJ4WmNBOHY4MWpObXMtalA4UFZyMTNiMGQzYUpIN3loWUhaaGdjQU1yN0doeFdnMUM1Z3lzN3Q1QUUxRmthRDY2T1FlWVB5UTFERWFSMnY1Y3J4cTVpb0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Ethereum's Buterin Floats Prospect of Taking Some Layer-2 Functions Back on Main Chain - CoinDesk",
        "content": "In his latest blog post, posted on the Ethereum Foundation's website, Buterin wrote that so-called \"light clients\" – a skimpier and less data-intensive way to read and verify data on a blockchain, as opposed to hardware-heavy full nodes – will get \"more and more powerful\" over the next few years. Ethereum's light clients will \"pretty soon get to the point\" where they can use zero-knowledge cryptography to fully verify transactions executed on the layer-1 chain."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOSmpGejRBNmRDUHpzU2w2SkQ2SzJjbHVMa2VKaTZhX0FQbWpmVE5aS3ptYklxelVyNHVFemVmc2hEb1Vlb2ZqcU1yWlBBRW1ETGpLdWpob3pQU2Q1d3RGSUU1YmtiVV9PTEVSSFY5c3J1cS1keUZvai13R0pLeGEyazVvTS1ENlNpN1ZtYXhsWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Dec 2023 08:00:00 GMT",
        "title": "SIX Digital Exchange (SDX) tokenizes ethereum stocks in its CSD - Ledger Insights",
        "content": "Today SIX Digital Exchange (SDX) announced it has tokenized the shares of a private company Aktionariat AG in its blockchain-based central securities depository (CSD). The tokenized shares had already been issued on the Ethereum blockchain.\n\nWhat’s the point?\n\nWhile tokenizing securities should improve liquidity, today that’s often not the case. Part of the issue is the fragmentation of investor pools. You have crypto-savvy investors who are comfortable investing in public blockchain tokens. And you have institutions where sometimes that’s not the case.\n\nBy tokenizing the stocks in a central securities depository, you can have the best of both worlds. Crypto-savvy investors can buy the stocks directly on Ethereum. And institutional investors and brokers can can access the stock via a CSD, in a similar way to how they usually access stocks and other securities.\n\nBerner Kantonalbank (BEKB) acted as the issuer agent and custodian. Aktionariat was eating its own dog food, given its business is helping companies to tokenize their stocks.\n\n“With this transaction, the involved players from the traditional finance world are proving that they are open to the integration of assets that were originally issued on an open, permissionless blockchain,” said Nicola Plain, CEO of Aktionariat. “An important step towards building a bridge between decentralized finance and traditional finance.”\n\nThis particular transaction was more of a pilot. The three companies now plan to explore commercializing the concept.\n\nIt also aligns with SDX’s strategy to engage with private market ecosystem partners and the Swiss SME investor community,” said Alexandre Kech, Head Digital Securities at SDX.\n\nMulti blockchain tokens – some takeaways\n\nThis sort of solution raises a few questions. If the two records got out of sync, which one would be legally valid? We’re assuming the CSD but it’s a question worth asking.\n\nIt leads to another issue we’ve raised before. Companies generally have one system where they record their capitalization table. So far, most securities issuances have been on a single blockchain. But that is unlikely to be the case in the future. We’re not talking about this example, where in theory the same issuances are mirrored.\n\nConsider stablecoin issuers such as Tether and Circle. They issue stablecoins on several public blockchains. Stock issuers might choose to do likewise. Franklin Templeton has launched its government money market fund on multiple blockchains. The Franklin Templeton case is a little different because the U.S. SEC requires a separate traditional database as the definitive record.\n\nMeanwhile, Korea’s CSD is building a solution to support multiple blockchain security token issuance.\n\nAlso when you start involving the regulatory sector, there’s a good chance that banks could hold the stocks on their balance sheet. That triggers the Basel banking rules. The Basel Committee is not too keen on public blockchain and seems to want to treat tokenized public blockchain securities like crypto. Given in this SDX case there is a CSD, would they be treated as public blockchain? If the CSD is the definitive record, does it matter that they are also issued on a public blockchain?\n\nOver time these sorts of issues will become clearer."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPSGJSR3ppZERYVUtnbDRGVWllNUlUdmFJeko2Tkx5OU5POS1ILU51Y3ZaM2JSeHpCd0FzT0lpQ0tlVk9jQ181MDE0MHBHNm0yY3c4aUdwa1QxOGNzd2prV3NCVzlpbmU0VFhDNkxSUnFPX2I1RVNDUHk0OFVqZ0phSXJhSDNhbmZJUHJmMkRpVVA2QjUtVVNteU01ZE8ySGJCdFFwazJxS2xoUkdVWjJXT0JNRVBKTzNxdm1YQ2w0ZjhMTDJJcW5kS1BzWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin Supports Integrating Zero-Knowledge Ethereum Virtual Machines Into Main Ethereum Chain - Unchained",
        "content": "In a new post, the Ethereum co-founder laid out the benefits and challenges of an “enshrined” ZK-EVM to improve security and speed.\n\nVitalik Buterin says that the setup of Layer 2s are “suboptimal.”\n\nIn a new blog post on Wednesday, Ethereum co-founder Vitalik Buterin detailed a proposal for “enshrining” a zero-knowledge Ethereum Virtual Machine (ZK-EVM) into the Ethereum blockchain, in large part to improve the security and speed of verifying transactions.\n\nEnshrining, in the context of development of the Ethereum blockchain, refers to the integration of a new feature directly into the fundamental code of the chain.\n\nAn enshrined ZK-EVM would seek to internalize the EVM verification methods currently used by layer 2 solutions, such as optimistic and ZK-rollups. These solutions have typically relied on large external codebases, which may present security vulnerabilities. Buterin’s proposal aims to address this by bringing the verification process under the Ethereum protocol’s governance and update mechanisms.\n\nRead more: Ethereum Virtual Machine Chain Inscriptions Gain Traction, Dominating Polygon Transactions\n\nButerin outlines several technical considerations and challenges associated with implementing the ZK-EVM. Technical considerations include ensuring data availability, supporting various types of EVMs, and the need for adaptability and upgradeability.\n\n“What key properties do we want out of ZK-EVM implementations?” Buterin asked rhetorically. “The most important property, in addition to basic guarantees of correct functionality and security, is speed.”\n\nOngoing Roles for Layer 2s\n\nButerin notes that the setup of Layer 2s is “suboptimal,” since they replicate functionality already available on Ethereum, where Ethereum governance is already responsible for making upgrades and fixing bugs.\n\nHowever, he still sees ongoing roles that Layer 2 solutions could play in the Ethereum ecosystem. Those roles might include providing fast pre-confirmation activities for before a block is confirmed and helping to mitigate the negatives of maximal extractable value (MEV), which is the maximum amount of value a miner can make by manipulating the order of transactions when a block is being made.\n\nRead more: Ethereum Devs Aim to Activate Dencun in January 2024\n\nButerin also said that Layer 2s are good at attracting users and are compensated for this popularity by capturing MEV and congestion fees in their network, which would all continue to happen."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPZFgtZUIxRWtOYUthaDAxUlBsOWVjSmE5c0toMmRpRVpTNDdDekxIcjdUSjYzWG9pNTByQ3J2bUpwd3ZIZXVoQ0lxZUUzcjRCLVktZzJUWUlRVHRhSXJ5VmdVZ3ZpcWREaVZoWGp6bmtwbnlEQVA5SG9sekRFN3dIMHh0SHQ1aHZhelRabVhZZ0tqdEVWTi16bVhneFQwd1ZwVUJvMkxLOE4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Dec 2023 08:00:00 GMT",
        "title": "PulseChain Unleashes Interoperability: Transforming the Ethereum Landscape with Advanced Features and Inclusive Solutions - Yahoo Finance",
        "content": "TOKYO, JAPAN / ACCESSWIRE / December 12, 2023 / PulseChain , the blockchain platform, has introduced a groundbreaking interoperability feature, allowing seamless trading between the Pulse and Ethereum networks. Through PulseBridge and ETHbridge contracts, users can easily transfer ETH and PLS between the two networks, opening up new possibilities for decentralized finance and smart contract capabilities.\n\nWith the recent development, PulseChain is set to redefine the Ethereum landscape, offering a compelling combination of technological advancements and user-centric features. As the blockchain community eagerly anticipates the official launch, PulseChain stands poised to leave an inexpungeable mark on the future of decentralized ecosystems.\n\nPulseChain has its mission to elevate the Ethereum ecosystem by achieving several key objectives as follows\n\nIncrease Ethereum's Value:\n\nPulseChain aims to boost the value of Ethereum by implementing innovative solutions that enhance its overall performance.\n\nLower Ethereum Fees:\n\nTo alleviate the burden on Ethereum users, PulseChain will contribute to lowering fees by sharing the network load, ensuring a more cost-effective and efficient experience for participants.\n\nEnrich ETH Users:\n\nPulseChain introduces a novel approach to re-enabling priced-out use cases. By bringing the Ethereum system state and ERC20s into its launch, PulseChain rewards holders and founders of Ethereum-based projects, fostering a more inclusive environment.\n\nEmpower ERC20 and NFT Users:\n\nWith the largest airdrop in history, PulseChain is set to distribute free versions of thousands of Ethereum-based tokens and NFTs. This unparalleled opportunity presents a gold rush of value discovery, allowing users to become influential stakeholders in their preferred ERC20 or NFT projects.\n\nEasy to Use:\n\nPulseChain ensures a seamless transition for users by enabling compatibility with MetaMask wallets. With just a single setting adjustment, users can access PulseChain effortlessly. ETH holders can also benefit from fee-free transactions using the freemium PLS.\n\nLower PulseChain Fees and Serve More Users:\n\nBoasting a 17% increase in speed with 10-second blocks, PulseChain is designed to process transactions faster than Ethereum, promising lower fees and improved scalability to accommodate more users.\n\nGame Theory Improvement:\n\nPulseChain strategically reduces the issuance of PLS by 25% per block compared to Ethereum, enhancing the platform's overall game theory for the benefit of its users.\n\nEmpower PulseChain Holders:\n\nPulseChain's native token, $PLS, serves as a key utility within the ecosystem, allowing users to activate validators and earn PLS by contributing to the security of the network.\n\nStory continues\n\nPulseChain's ambitious goals underscore its commitment to revolutionizing the Ethereum ecosystem and creating a more inclusive and sustainable blockchain environment.\n\nFor more information about PulseChain, please visit their website.\n\nThe PulseChain Suite: GoPulse.com\n\nBuy PLS: GoPulse.com/buy\n\nTrade on PulseChain: GoPulseX.com\n\nNews: GoPulse.com/trends\n\nMore Infos: wiki.GoPulse.com\n\nAbout PulseChain:\n\nPulseChain is a cutting-edge blockchain platform committed to enhancing the Ethereum ecosystem by implementing innovative solutions and fostering inclusivity. With a focus on sustainability, efficiency, and user empowerment, PulseChain is set to redefine the landscape of blockchain technology.\n\nMedia Contact\n\nOrganization: GoPulse\n\nContact Person: Midas Nakamoto\n\nWebsite: https://gopulse.com/\n\nEmail: contact@gopulse.com\n\nCity: Tokyo\n\nCountry: Japan\n\nSOURCE: GoPulse\n\n\n\n\n\nView the original press release on accesswire.com\n\n\n\n"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE42LV9aeUNLRlo1Y0hpeVZzQWN3ZXVPdENVWm1iYTFYdWVkSks3ajdwSm1mYU9BWUw0b2hwdmF2MVJUdkJ5YkhUVHZQOHh1SE5iRU92R0pnRWUzazJ3dXg0UGdPeDJ3V3h0Wi05SEI2LUg1SHdhalRiLV85MXBaQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "For Ethereum rollups, dealing with data remains a bottleneck - Blockworks",
        "content": "When it comes to scaling Ethereum, rollups are the name of the game. But as rollups increase transaction throughput, they face a challenge in where to store their data.\n\nThe obvious option is on Ethereum itself. Some argue that doing so is even core to the claim that rollups “inherit” Ethereum security. Ethereum’s execution layer nodes store a complete copy of the blockchains ledger and history, allowing clients to independently verify the accuracy of its transaction history.\n\nWhile great for security and resilience, this comes at the cost of scalability. This is one of the main reasons why the Ethereum mainnet maxes out at around 15 transactions per second (TPS), and can be expensive during times of high demand.\n\nRead more: So your layer-2 is ‘secured by Ethereum’ — what does that mean?\n\nIncreasingly, blockchain developers are looking at alternatives for “data availability” to resolve Ethereum’s shortcomings. Some developers are turning towards modular blockchain solutions such as Celestia and Avail.\n\nModular blockchains often refer to networks that disaggregate specific blockchain functionalities. Dedicated data availability layers are designed to increase the efficiency of a blockchain, improve its transaction speeds and minimize costs.\n\nRead More: Why data availability sampling matters for blockchain scaling\n\nCelestia was one of the first data availability layers to launch its mainnet beta. Since October, it has seen over 900,000 transactions and around 278,000 accounts on its network, according to Celenium, Celestia’s block explorer. The explorer does not break down the network’s data volume or number of submissions.\n\nThe network has also been working on integrations with other layer-2 solutions, most recently with the Polygon CDK, enabling interested developers to choose Celestia for data availability alongside other options.\n\nFor developers using Optimism’s OP Stack, Celestia also introduced Ethereum fallbacks — a backup solution for data availability. That means that if the Celestia network is temporarily unavailable, layer-2s can post their transaction batches back onto Ethereum mainnet. This avoids the risk that end-user funds remain stranded.\n\nAvail recently launched its testnet, dubbed “Clash of Nodes,” which uses gamification to incentivize validators and light client operators with points and rewards, Anurag Arjun, Avail’s co-founder, told Blockworks.\n\nAccording to Avail’s blockchain explorer, there are 56,000 accounts on its testnet, which has processed over 1.2 million transactions since it began. Its mainnet is expected to launch in the first half of 2024.\n\nThe two networks serve a similar purpose, but there are some key differences.\n\nFor one, Arjun notes that Avail uses KZG polynomial commitments — a type of validity proof used to sample random parts of a block to verify it, without needing to access the full data.\n\nThese KZG commitments “are ideal for zero-knowledge-based blockchains, where efficiency, privacy and scalability are essential,” Arjun said.\n\nCelestia instead uses secure hash functions, which Arjun notes “introduces potential delays in ensuring data availability guarantees.”\n\n“The tradeoff here is that they have to rely on fraud proofs to confirm the accuracy of erasure coding,” Arjun said.\n\nThe choice between these two depends on the specific requirements and priorities of a blockchain system.\n\nRead more: Sovereign rollups carve a path for blockchain scaling\n\nAside from Celestia and Avail, re-staking protocol EigenLayer has also recently revealed its plans to launch EigenDA.\n\nEthereum core developers are also not standing still; the core piece of Ethereum’s next major upgrade Dencun will introduce “proto-danksharding,” or EIP-4844, a process where costs of transactions are reduced by storing them in temporary data blobs.\n\nData availability and storage remains a significant cost driver on Ethereum. Solutions under development are still in their early stages. While its roadmap calls for an eventual transition to “stateless” Ethereum, the current data bloat puts the full Ethereum chain at nearly 1.4 terabytes.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE1OTmZacWU4S05TTC03dWRQeV9fM2M0cE5PdUprQ1B4Zms5RmF0X0d1OExlY1JjVHhFUEtNSTNQY0p3VU9JM21YeXRGbDVjeVZIMkZ4cVp4U3dBeGxMdUdjVXViUVQ2QkU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Dec 2023 08:00:00 GMT",
        "title": "What Is Ethereum and How Does It Work? - Binance Academy",
        "content": "TL;DR\n\nEthereum is the second most popular blockchain network with a native cryptocurrency ETH, which is the second largest crypto in terms of market capitalization after Bitcoin.\n\nEthereum network transitioned from Proof-of-Work consensus mechanism to Proof-of-Stake in 2022 to improve the network's capabilities.\n\nVitalik Buterin's vision for Ethereum focuses on utility, providing developers with the infrastructure to build diverse decentralized applications\n\nEthereum's ecosystem spans DeFi, gaming, NFTs, DAOs, and more, bolstering its position as a foundational pillar in the digital economy\n\nWhat Is Ethereum?\n\nEthereum, conceptualized in 2014 by programmer Vitalik Buterin, stands as a monumental pillar in the world of blockchain technology. At its essence, Ethereum is a decentralized, open-source platform powered by its native cryptocurrency, Ether (ETH). Unlike traditional systems that operate on centralized servers, Ethereum runs on a vast, interconnected network of computers, known as nodes. This globally dispersed setup ensures that the platform remains resilient against single points of failure and censorship.\n\nWhile Ethereum and Bitcoin, the inaugural blockchain protocol, both function as platforms facilitating digital money transfers, Ethereum's distinction lies in its broader utility. Ethereum serves as a platform for deploying \"smart contracts,\" which are autonomous computer programs that automatically execute actions when certain conditions are met, reducing the need for intermediaries and enhancing transactional transparency.\n\nThis feature has made Ethereum an indispensable tool for developers, offering them a canvas to create decentralized applications (DApps). These DApps can range from decentralized finance (DeFi) platforms to games, each tapping into Ethereum's robust infrastructure. As blockchain technology continues its ascent in the modern digital age, Ethereum's role as a facilitator for DApps underscores its relevance and potential for transformative impacts across various industries.\n\nHow Is Ethereum Different From Bitcoin?\n\nDespite sharing the foundational principle (blockchain technology) with Bitcoin, Ethereum serves distinct purposes and is built on divergent philosophies. The key differences between Ethereum and Bitcoin are:\n\n1. Origin and purpose\n\nBitcoin, introduced in 2009 by the enigmatic Satoshi Nakamoto, was conceived primarily as a digital alternative to traditional currencies. Bitcoin is envisioned as a decentralized form of money immune to governmental interference or inflation. Its primary function is to serve as a medium of exchange, store of value, and, for some, a unit of account.\n\nEthereum, on the other hand, was created in 2014 by Vitalik Buterin with a broader vision. While it does have its own cryptocurrency, Ether (ETH), Ethereum's true purpose extends beyond just facilitating transactions. It's designed as a platform for developers to build and deploy smart contracts and decentralized applications (DApps). These allow for programmable transactions and a multitude of applications beyond mere currency transfers.\n\n2. Smart contracts and DApps\n\nEthereum's aforementioned capability to facilitate smart contracts and DApps is its defining distinction. While Bitcoin does offer a form of smart contract functionality, Ethereum's is more flexible and generalized, allowing for an array of applications, from games to DeFi platforms, to be built atop its platform.\n\n3. Tokenomics\n\nBitcoin has a capped supply, with a maximum of 21 million coins ever to be mined into existence. This scarcity principle is one of its core value propositions. Ethereum, in contrast, doesn't have a hard-capped supply. However, following its transition to Proof of Stake (PoS) in 2022, Ethereum has shown more deflationary characteristics in its supply dynamics.\n\nIn summary, while both Bitcoin and Ethereum leverage blockchain technology, they cater to different domains of the digital economy. Bitcoin aims to disrupt the way we perceive and use money, while Ethereum seeks to revolutionize how applications and agreements function in a decentralized setting.\n\nHow Does Ethereum Work?\n\nEthereum’s functionalities extend beyond mere cryptocurrency transfer, and therefore has some unique designs in its working mechanisms.\n\n1. Smart Contracts\n\nSmart contracts are self-executing contracts with the terms of the agreement directly written into code. Once deployed on the Ethereum blockchain, they autonomously execute predefined functions when certain conditions are met. For instance, a smart contract might automatically transfer funds from one party to another on a specified date.\n\n2. Decentralized Applications (DApps)\n\nBuilt atop Ethereum's platform, DApps are applications that run on a blockchain. They leverage Ethereum's smart contract capabilities, ensuring that all data and transactions are secure, transparent, and immutable. This has led to the rise of various decentralized platforms, ranging from DeFi, GameFi, to decentralized identities.\n\n3. Ether and gas\n\nAt Ethereum's core is its native cryptocurrency, Ether (ETH). While Ether can be used for peer-to-peer transactions like Bitcoin, it's primarily used within Ethereum to facilitate and incentivize operations. Every action on Ethereum, from simple transfers to complex smart contract interactions, requires computational effort. This effort is quantified as \"gas\", and users pay for this gas using Ether.\n\n4. Ethereum Virtual Machine (EVM)\n\nThe EVM serves as the runtime environment for smart contracts in Ethereum. More than being confined to just the Ethereum network, it's mirrored across every node within the Ethereum ecosystem, reinforcing decentralization and consensus-driven operations. This comprehensive replication fosters a high level of security and uniformity across the network.\n\nFurthermore, the EVM's design plays a pivotal role in promoting interoperability. Various blockchain platforms have recognized the potential of the EVM and have integrated EVM-compatible layers or mechanisms into their systems. By doing so, smart contracts designed for Ethereum can be deployed and run on these EVM-compatible blockchains without significant modifications. This adaptability not only reduces development efforts but also bridges different blockchain communities, fostering collaboration and expanding the decentralized application landscape.\n\n5. Consensus Mechanisms\n\nEthereum originally operated on a Proof of Work (PoW) consensus mechanism, much like Bitcoin. However, the network successfully transitioned to Proof of Stake (PoS) with the Ethereum 2.0 upgrades in 2022. PoS offers increased scalability and energy efficiency. In PoS, validators replace miners in the creation and verification of blocks based on the amount of cryptocurrency they \"stake\" or lock up as collateral.\n\nIn essence, Ethereum works as a multi-faceted platform, not just enabling digital currency transactions but also fostering a space where decentralized, trustless applications and agreements can thrive. Its flexibility and adaptability make it a foundational pillar of the modern crypto ecosystem.\n\nThe Merge: Ethereum’s Transition from Proof-of-Work to Proof-of-Stake\n\nEthereum previously relied on a process known as mining, utilizing the Proof of Work (PoW) consensus algorithm, akin to Bitcoin's method. Yet, with the landmark event of \"The Merge\" on September 15, 2022, Ethereum pivoted to the Proof-of-Stake (PoS) model for its network state updates. This transition to PoS marked the end of Ethereum's reliance on PoW, culminating in a dramatic decrease in energy consumption by nearly 99.95%.\n\nProof-of-Stake is a consensus algorithm introduced in 2011 as an alternative to Proof-of-Work. It aims to overcome the scalability limitations of PoW networks. PoS is the second-most-popular consensus algorithm, adopted by chains including BNB Chain, Solana (SOL), and Cardano (ADA).\n\nWhat Is Ethereum 2.0?\n\n​​Ethereum 2.0 (aka Eth2 or \"Serenity”) is a series of the long-awaited upgrades to the Ethereum network that promises, among other things, to improve the network’s scalability. Through the implementation of several enhancements, speed, efficiency, and scalability should be improved without sacrificing security and decentralization. This version of Ethereum has always been on the horizon, but it’s taken some years to roll out. The primary reason for this is that scaling a blockchain in a secure and decentralized way is a challenging task.\n\nThe roll-out of Ethereum 2.0 is a gradual process that was initially planned in three main phases to ensure its success: phase 0, phase 1/1.5 and phase 2. Each phase incorporated distinct features essential to Ethereum's new and effective implementation.\n\nPhase 0 saw the successful introduction of the Beacon Chain, launched on December 1st, 2020. It runs parallel to the mainnet and focuses on accepting validators (or stakers) through a one-way deposit contract. Validators' ETH is locked until the next phase, making it essential to understand that un-staking is only possible once shard chains are fully implemented.\n\nPhase 1/1.5 was intended to be the combination of two phases, the introduction of shard chains and Ethereum's mainnet transition from Proof of Work (PoW) to Proof of Stake (PoS). Phase 1 introduces shard chains which enables validators to create blocks on the blockchain through PoS. Phase 1.5 began rolling out in 2021 and marks the official transition away from PoW.\n\nPhase 2, the final phase, will enable Ethereum 2.0 to support fully formed shards and become the official Ethereum network. Shard chains will also work with smart contracts, allowing seamless integration of dApps and various technologies with Ethereum 2.0.\n\nThe Ethereum Ecosystem: DeFi, NFTs, DAOs, and Beyond\n\nSince the inception of Ethereum, countless applications and products have been developed on the platform making it the second most popular cryptocurrency. Here are some of the most exciting and interesting features to come from this ecosystem.\n\n1. Decentralized finance (DeFi)\n\nDeFi represents financial applications developed atop blockchain infrastructures. The unique feature of DeFi is that it functions without central authorities, providing an open and programmable financial system.\n\nBy leveraging smart contracts and distributed systems, users can securely create decentralized finance applications. DeFi businesses currently offer services ranging from P2P lending and borrowing, to accruing interest on crypto assets, and decentralized exchanges to trade on. Some notable DeFi platforms include Compound Finance, Aave, and UniSwap.\n\n2. Gaming\n\nGaming and virtual reality has become a large part of the Ethereum network. Decentraland and Sandbox are two of the biggest platforms that have created virtual worlds. The Ethereum blockchain is used to secure tokenized ownership of land, avatars, wearables and other goods. Non-fungible tokens\n\n3. Non-Fungible Tokens (NFTs)\n\nNon-fungible tokens (NFTs) are tokenized versions of digital or real-world assets that function as verifiable proofs of authenticity and ownership within a blockchain network. They can be used by decentralized applications (DApps) to allow for the creation and ownership of unique digital items and collectibles.\n\nVarious frameworks have been created to facilitate the issuance of NFTs. The most prominent of these is ERC-721, which is a standard for the issuance and trading of non-fungible assets on the Ethereum blockchain.This standardization of NFTs allows a higher degree of interoperability, meaning that unique assets can be transferred between applications with relative ease.\n\nIt is evident that non-fungible tokens (NFTs) have the potential to be one of the key components of a new blockchain-powered digital economy. They could be used in many different fields, such as video games, digital identity, licensing, certificates, or fine art - and even allow fractional ownership of items. Storing ownership and identification data on the blockchain would increase data integrity and privacy, while easy, trustless transfers and management of these assets could reduce friction in trade and the global economy.\n\n4. DAO development\n\nDecentralized Autonomous Organizations (DAOs) are community-led entities, governed by computer code and without central authority. These organizations use smart contracts or applications to gather information or votes to buy into the majority of the group transparently and without the use of a third party.\n\nEven though the role of the Ethereum cryptocurrency may be vague for DAOs, it is clear that there is some sort of influence or interest from a personal and corporate finance perspective.\n\nFrequently Asked Questions.\n\n1. Is Ethereum a cryptocurrency?\n\nEthereum is the blockchain technology platform which uses ether (ETH) as its native cryptocurrency. The platform itself supports a large range of DdApps, including other cryptocurrencies powered by the ethereum blockchain. It is important to note that many people will refer to the cryptocurrency as Ethereum.\n\n2. How can I buy Ethereum?\n\nIn order to buy ether you can use one of many cryptocurrency exchange platforms. Ethereum is supported by all major centralized and decentralized exchanges. You can simply create your account at an exchange that you trust, deposit fiat or cryptocurrencies to buy or swap ETH.\n\n3. Is Ethereum a good investment?\n\nAs with any investment, it really depends on your risk tolerance, financial stability, objectives, and so forth. ETH is certainly a volatile investment, you should conduct your own research to determine if ETH is a good investment for you.\n\n4. How does Ethereum make money?\n\nAs a decentralized platform, Ethereum does not make money like a traditional organization. Those who participate in securing and maintaining the network as stakers and validators get rewarded. They earn ether as a reward for validating transactions and creating new blocks.\n\n5. Can you convert Ethereum into cash?\n\nThe simple answer is yes! You can use online cryptocurrency exchanges for this process. You can create your exchange account and link your bank account to it. Once this has been done, you can send ETH to an exchange account from an Ethereum compatible wallet. Once the ETH has arrived into your exchange account, you can place an order to sell it. Once this order has been processed, you can transfer the fiat currency to the linked bank account.\n\n6. What happens if I lose my ETH?\n\nSince there aren’t any banks involved, you’re responsible for your own funds. You can store your coins on an exchange, or in your own wallet. It’s important to note that if you use your own wallet, you absolutely must take care of your seed phrase. Keep it safe because you need it to restore your funds in case you lose access to your wallet.\n\nFurther Reading\n\nWhat Is Ethereum 2.0 And Why Does It Matter?\n\nWhat is Etherscan and How to Use It?\n\nBNB Smart Chain vs. Ethereum: What’s the Difference\n\nDisclaimer and Risk Warning: This content is presented to you on an “as is” basis for general information and educational purposes only, without representation or warranty of any kind. It should not be construed as financial, legal or other professional advice, nor is it intended to recommend the purchase of any specific product or service. You should seek your own advice from appropriate professional advisors. Where the article is contributed by a third party contributor, please note that those views expressed belong to the third party contributor, and do not necessarily reflect those of Binance Academy. Please read our full disclaimer here for further details. Digital asset prices can be volatile. The value of your investment may go down or up and you may not get back the amount invested. You are solely responsible for your investment decisions and Binance Academy is not liable for any losses you may incur. This material should not be construed as financial, legal or other professional advice. For more information, see our Terms of Use and Risk Warning.\n\n"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNTHdCYkVGWENyNkdNUXl0WlNVYnNOSTAtV1pwdTVsdktpa1NiNU9TbkotLTAwWE1WUUlVajVlZXhsWTZVTTRTMk16M0sxc1p4MGJkam5kYTQyTnQ4b05MaGtKQmJobGhQcDBBNExGVXlES09URTNUMlV4eUF6Zk04cVNvZVFYdGxjNGVyRlNDRzF5QdIBmgFBVV95cUxNOGx3aS1sUi11ejcwTzIybDhYb2J0ZF9UcHlNekt1c0psWHZiQmRUV3VsbFBKME1raXdUd1dkRjVCcmk5NHlTVWtDamg2VVAwMFlkcE5KZDBnb0drQ1cwbG5LMnlMTHcydVYwaVRwaTUtMjRhaFNJRlRZVERyTlpWU0g4Q2dyZXpCbG1Send2VUpVdmMtMThxZDVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Ubisoft Reveals Mint Date for Free 'Champions Tactics' Ethereum NFTs - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nUbisoft has announced the Ethereum NFT mint date for its first original blockchain game, Champions Tactics: Grimoria Chronicles, sharing that its “Warlords” will be available on December 18.\n\nChampions Tactics will offer a private mint for those added to its “darklist” beginning at 6am ET, and will open the mint up to the general public at 2pm ET on Monday.\n\nAn NFT mint is effectively the primary sale for a project—but unlike most NFT launches, Ubisoft is promising that 8,000 Champions Tactics Warlord NFTs will be free to mint.\n\nIn the game, Warlords are pixel-style heroes with weapons and have been designed like social media profile picture (PFP) NFTs. Collectors will only need to pay Ethereum network gas fees to mint the NFTs, which can then be used as one’s account avatar in-game.\n\nAD\n\nAD\n\nAccording to Ubisoft, holding a Warlord NFT in a crypto wallet will grant access to the game’s next mint for its playable in-game characters. Warlord NFT owners will be able to mint five Champions Tactics characters for free at a later, yet-to-be-announced date.\n\nWhile the Warlords NFTs will be on Ethereum, the Champions Tactics game itself will be deployed on the Ethereum-compatible Oasys chain. A total of 9,999 Warlords NFTs will be minted, with another 1,000 given out to the Oasys community and 999 held back by Ubisoft for future marketing initiatives and giveaways.\n\nNot much has been revealed about Champions Tactics’ strategy and gameplay, but some lore details have been revealed. In the world of Grimoria, there are seven different factions ruled by battle-hungry warlords. Each faction has its own look, as there are zombie-like characters, demonic characters, and medieval knights, to name a few.\n\nAD\n\nAD\n\nThe Warlords👑, a collection of 9,999 digital collectibles for Champions Tactics by @Ubisoft ♦ Timeless badass pixel art on Ethereum\n\n♦ Exclusive in-game perks\n\n♦ Access to the upcoming Champions mint\n\n♦ VVIP status\n\n♦ And more🤐 Follow, Like, RT & Comment if you are ready 🔥 pic.twitter.com/hxbUSitfjZ — Champions Tactics (@ChampionsVerse) December 6, 2023\n\nThe player-versus-player tactical RPG has a dark fantasy aesthetic and will offer characters that resemble collectible tabletop game figurines. First announced in June 2023, Champions Tactics is slated to release on PC sometime in early 2024.\n\nUbisoft has also confirmed \"collaborations\" with the NFT gaming projects Pixelmon and CyberKongz in recent days, though the extent of each alliance is unclear.\n\nIn each case, the project tweeted that it would be \"supporting Champions Tactics with its upcoming Warlords mint and launch\" and exploring further opportunities together. Ubisoft's official game account quote-tweeted and shared both announcement tweets.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOeDd2alRCeGIyRUVxd19LdHFnZkM2NWJvUHdxUFd3ZDlLMVo0WFlWRDVQbFdlWE5icE5aNnVwVFRCNGlDSVh3WDFuWG9GZlZoY3puQ1I0NENLNEdoSlNLSnBObHVmU0J2bzlpM1hLNnMwZDduZlFxN2puRkZuQUd5YUY4Mno2NTRjQVVOLXFicG1oZVktM0VFZmVPSXA0c3dTbHZraUZ4b0FfWk5BdjUtdTVheGs4MFdxX1FF0gHAAUFVX3lxTE9kNllHMEVjNFduaU0yam5tVGh2YW5KeWRrNDZySlFXVW16Z0s5YlVLQUM2azFMcUpnMjlkUWY4WTI5VE5MU3NtZHM0MThBeEVHNDlQdUxUaDJUYVNFd2Q3eGY0Qk5LaDE0QXRHTEMwRUt4Zk5wTzNxYldnWkVBdjVDQWsxWHcyd24tSEl4R2o0WHJVWnpEdmdEcEk1WkpfdnVrUVFKZHFSM0hEOWZlWWs3MGNtWTNlVUhFTUNuMGlmdA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Gaming Altcoin Rallies As Massive Whale Withdraws From Binance: On-Chain Data - The Daily Hodl",
        "content": "One Ethereum (ETH)-based gaming altcoin soared as a crypto whale suddenly moved a massive amount of the project’s tokens off an exchange, on-chain data shows.\n\nAs reported by blockchain tracking firm Lookonchain, layer-2 scaling solution ImmutableX (IMX) shot up 20% as a crypto whale made big moves.\n\n“The price of IMX increased by 20% today. We noticed that three wallets (possibly belonging to the same whale) withdrew 4.3 million IMX ($9.6 million) from Binance [Monday].\n\nThis whale has six related wallets and currently holds a total of ~40.54 million IMX ($90.8 million).”\n\nIMX is trading for $1.98 at time of writing, down 3.8% in the last 24 hours.\n\nLookonchain also noticed that SATS (Ordinals) is soaring amid a key listing by top global crypto exchange Binance.\n\n“The SATS price is up ~120% since Binance announced the listing of BRC-20 Sats.\n\nOn-chain data shows that the top 20 holders of SATS hold 333.3T SATS ($150.8 million, 15.90% of the total supply).\n\nSix of the top 20 holders obtained SATS through minting, with ~78.57 million SATS ($35.5 million).”\n\nSATS is trading for $0.000000515075 at time of writing, up 123.4% in the last 24 hours.\n\nLastly, Lookonchain reported a HashKey-suspected wallet abruptly moved a massive amount of Ethereum onto Binance, suffering a loss.\n\n“The wallet related to HashKey has deposited a total of 17,108 ETH ($38.1 million) to Binance after the ETH price plummeted, losing more than $2 million.”\n\nEthereum is trading for $2,187 at time of writing, down 1.4% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxOWVNvdFc1ZWt0V2UtMmpJV0ZjaTNieHdBWlhBNGFqcFFpTy1tdVFlWmFXcU5ZQTRSNkdlQmtIYXpkdUZYWXpXZHJKUFVqWjZIOUdtYUx6T2sxRUthUVUxdDdpb1J5VFRZSXhSZlJRZUJRRUhKX0EtdkRTUVI0N21yRndrcWlRVHpYU0ZNLWtNX05BS2RSOFlYWHVNUl9Nclp6dEN6OUJJeUxzcVNpbVpybXpaakNXSERSdW5CU2NHREVTaXJtY3p4MEpjUklqdUMtUjRRVjFQR1RDbVNTbWhNNmNHaGtWckhUOXfSAe8BQVVfeXFMT2M5TGNoMGx0MlBuUnhmS0t5cUpEMGJGM1B5TThVZm00YUxpd0pQUkx3VlRsWTlnNTJuNG00YlNRa3RXUUxvdG5PVFFjSG51Z2ZEYk5kbFNmalVDNlBvQlhITi1leVNFVFAwVWhReGFHRWJ6TUpNeXkydDRENTFYWGpMN2xZWmlVMUF3NlJPTnFLVzhvazN0RlBrRmJYUXJwRk9idE9sLVI4VndzcGF0UlhsUWFyRG1CTHpqcTI5d25VTVo2TmREV1lMUGFTbnJ6S3FROUlYeTFzbGdXTnBZdjBmTUJTNTJHNllXYW1oeVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC eyes $45,000 as FOMC minutes spur volatility - FXStreet",
        "content": "Bitcoin price could rise 6% to test the $45,000 level amid rising volatility steered by broader market macroeconomics.\n\nEthereum price coils up for a 7% move to the range high of $2,403 as the bulls scale a comeback.\n\nRipple price could climb 10% to the supply zone as the $0.5773 support floor presents a springboard for XRP.\n\nBitcoin (BTC) price recorded increased volatility during the afternoon hours of the New York session. This spilled over to altcoins, with Ethereum (ETH) and Ripple (XRP) prices showing strength alongside the king of cryptocurrency. It came after the Federal Open Market Committee (FOMC) minutes with Fed chair Jerome Powell hinting at more rate cuts than he did previously. Specifically, the markets moved as the 1-year interest rate outlook fell from 5.1% to 4.6%.\n\nAlso Read: Bitcoin price shoots to $42,800 as FOMC keeps interest rates unchanged\n\nBitcoin price eyes a 6% climb to $45,000\n\nBitcoin (BTC) price has witnessed increased volatility, as the Fed kept interest rates unchanged. However, the anticipation of more rate cuts to come has inspired bullish momentum in the crypto market, with BTC standing first in line to benefit.\n\nThe Relative Strength Index (RSI) has deviated to the north, suggesting rising momentum, bolstered by the presence of the Awesome Oscillators AO) in the positive territory.\n\nIncreased buying pressure could see Bitcoin price pull north, potentially clearing the range high at $44,700 or higher, tagging $45,000, 6% above current levels. In a highly bullish case, BTC could extend to the $48,000 psychological level. Such a move would constitute a 12% climb above the current level.\n\nBTC/USDT 1-day chart\n\nOn the flipside, if profit booking ensues, Bitcoin price could pull south, potentially losing the $40,000 support level. In the dire case, the slum could extend for Bitcoin to test the $37,800 critical support, below which BTC could spiral all the way to the $32,000 level or worse, the $30,000 psychological level.\n\nAlso Read: Bitcoin price looks insecure, thinly holds above $40,000 heading into FOMC\n\nEthereum price finds strength for a possible 7% climb\n\nEthereum (ETH) price is attempting to recover all the ground lost since the December 11 fall, getting tailwinds from the FOMC-inspired optimism. Increased buyer momentum could see Ether reclaim the support due to the midline of the ascending channel at $2,288, or higher, extending to tag the $2,403 range high.\n\nETH/USDT 1-day chart\n\nOn the other hand, after a 5% climb, investors who bought ETH at the $2,147 low could be tempted to book profits. The ensuing selling momentum could see Ethereum price lose the aforementioned base, potentially descending into the supply zone turned bullish breaker. A daily candlestick close below the midline of this order block under $2,075 would confirm the continuation of the slump.\n\nThis could set the tone for Ethereum price to spiral towards the $2,000 psychological level or worse, extend a leg lower to the $1,935 support.\n\nAlso Read: Ethereum leads altcoins north as Bitcoin halts amid bull trap fears\n\nRipple price finds strength for a 10% climb\n\nRipple (XRP) price has found an inflection point, pivoting around the $0.5773 support amid rising momentum. If buying pressure increases, XRP price could foray into the supply zone ranging from $0.6572 to $0.7161. To confirm the continuation of the uptrend, the price must break and close above the midline of the zone at $0.6872. This would represent a 10% climb above current levels.\n\nThis could set the tone for an extended climb, potentially going as high as the $0.8000 psychological level, or in highly ambitious cases, stretch to test $0.8505.\n\nXRP/USDT 1-day chart\n\nConversely, if sellers have their say, Ripple price could descend below the critical support at $0.5773, with a break and close below this level invalidating the bullish scenario.\n\nAlso Read: XRP price risks 7% fall as Ripple lawyer names ‘the single biggest threat to crypto in the US’"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1raUxxb2dBMWVOOEpoLTlKYm9nYlZnaXlxMnpZSGM2bzRnNk5DdFRGSW1HTURabUR0XzlvQ2pjRl94Q2FqZXlYS3MybzRpVlQ5ODNLRkNKS1o2TUkya0w4OFl3aVFpb3JmYzdFNXVKdzRDWUJ2VjBPX0VR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Galaxy, DWS and Flow Traders eye stablecoin launch on Ethereum, Solana - Blockworks",
        "content": "Crypto firm Galaxy looks to collaborate with asset management firm DWS and trading specialist Flow Traders. Their goal is to introduce a stablecoin to accelerate the widespread adoption of on-chain assets.\n\nThe forward-looking plan seeks to capitalize on an evolving regulatory framework in Europe, but will ultimately hinge on various approvals.\n\nThe proposed stablecoin, named AllUnity, will be fully collateralized and denominated in euros, the company said Wednesday. The entity is planned to be incorporated in Frankfurt. Its next step involves applying for an E-money license from the German financial regulator BaFin. The company’s aim is to launch the stablecoin within 12 to 18 months.\n\nThe stablecoin intends to launch on several public permissionless blockchains, including Ethereum and Solana, a spokesperson told Blockworks.\n\nRead more: SocGen’s crypto unit debuts euro-pegged stablecoin\n\n“Digital currencies are the natural evolution of the world’s payment system, and Europe — a region at the forefront of the exploration of safe, secure digital money — is paving the way for this inevitable shift,” Galaxy CEO Mike Novogratz said in a statement.\n\nThe firms expect to appoint Alexander Höptner as AllUnity’s CEO, according to the Wednesday news release. Höptner has extensive experience as a chief executive, leading teams at 100x Group — the holding structure for crypto trading platform BitMEX — as well as stock exchange Börse Stuttgart GmbH and financial services firm Euwax AG.\n\nThe plans come after passage of the Markets in Crypto-Assets (MiCA) regulation in April. US lawmakers have lagged behind in making similar progress on such a framework.\n\nThe Europe regulation “we believe will contribute to growing the stablecoin market as it provides a robust regulatory framework that enhances investor protection and market integrity,” Höptner said in a statement.\n\nStablecoins — digital assets pegged to the value of another asset or fiat currency — have a combined market capitalization of roughly $130 billion, according to CoinGecko data.\n\nTether (USDT) is the dominant player in the segment with a market cap of about $90 million, USDC and DAI are a distant second and third with market caps of $24 billion and $5 billion, respectively.\n\nPayments giant PayPal debuted a dollar-backed stablecoin — issued on Ethereum by Paxos Trust Co. — in August.\n\nStablecoins enable peer-to-peer value transfers and protect against unstable currencies, as noted by Pantera Capital product manager Jeff Lewis in an October letter. They also enable users to conduct transactions without relying on the trustworthiness of service providers, but don’t come without risks.\n\nRead more: Stablecoins set to succeed where BTC, ETH failed: Pantera\n\nGalaxy has crypto-focused asset management, global markets and digital infrastructure business units. The firm in September hired ex-Genesis sales head Leon Marshall as its CEO of Europe, noting the continent is critical to its growth strategy.\n\nGermany-based DWS — formerly a part of Deutsche Bank — had 860 billion euros (about $929 billion) in assets under management, as of Sept. 30.\n\nFlow Traders, headquartered in the Netherlands, offers liquidity across major exchanges and trading platforms via its trading hubs in Europe, the US and the Asia Pacific region.\n\nGalaxy and DWS have worked together before, expressing the intent earlier this year to roll out exchange-traded products in Europe. Galaxy, with partner Invesco, is among the fund issuers vying for a spot bitcoin ETF in the US.\n\nIn a statement, DWS CEO Stefan Hoops highlighted that corporations with internet-of-things (IoT) businesses could use the proposed stablecoin to make fractional payments. He noted that these transactions could occur around the clock, 24 hours a day, seven days a week.\n\nHoops added: “Through the future creation of AllUnity, we will bridge the gap between the traditional and digital finance ecosystems to build a core infrastructure provider that facilitates secure on-chain settlement for institutional, corporate and private use.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOc2k3clBaS05OZDM5TFBpRHM2QTBPWFVwd0pxNEF0YTRoZ2tnNVNJX0p0cmwwcDMxanFFU01ab1VXWjh2QmdPSElnYUtrUVNvb2RUczUtM2RDM3BlOGhzazFoanhIVjM0T1lOZEZPaGxreEZJSHZqVkd6bWxuNFlCRGJoSjlkMjJYdlRkWi1QUHE2UURj0gGcAUFVX3lxTE9TaXA5QW1OSF9wTnlFYmlLOGZYcVdwdldHemRtbkNEX2ItOTNRS29GeS1BN2JrbG1hcHc2NVRMeENYR09tblZ1dmEzRUkxaVllYlFZNGItSnUyQ0NUSnRRdnp3cnFtMFZUam42Z212WjI0Um5EQkF2U0RsSFZBUzdBNXlfdmxfY3FLbFpfVG1uakt6N1o2UEtWdG84NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Rainbow Wallet Teases Airdrop on Ethereum in 'Fox Hunt' Against MetaMask - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum wallet Rainbow announced the launch of its Rainbow Points rewards program on Tuesday, calling it “the first step towards including our community in the future success of Rainbow”—and potentially teasing a future token airdrop ahead.\n\nAll Ethereum users were airdropped points based on their on-chain activity, Rainbow said, including their wallet balance, with extra rewards for switching from the popular MetaMask wallet to Rainbow, and for holding at least one Rainbow NFT at the time holders on Monday.\n\nRainbow’s points-based incentive model recalls that of leading NFT marketplace Blur, which stole away dominant market share from OpenSea by giving out points that eventually led to the BLUR token airdrop. Blur has since given out hundreds of millions of dollars worth of tokens to users since earlier this year.\n\nIt’s considered a form of “vampire attack.” A vampire attack is when a new project or protocol provides more incentives or rewards to use its comparable service over that of an established market leader—in this case, MetaMask.\n\nAD\n\nAD\n\nWelcome to Rainbow Points — the first step towards including our community in the future success of Rainbow Every Ethereum user has been dropped points today 🌈 Claim your points and start earning more by doing the things you already do onchain pic.twitter.com/UsUOOGxC0b — Rainbow (@rainbowdotme) December 12, 2023\n\nIn its announcement, Rainbow said users who import their MetaMask wallet into Rainbow could receive up to 150,000 extra points. Rainbow “true believers,” or dedicated users of the wallet, will “get the most” points per a tweet thread. That recalls Blur’s own model, which revolves in part around a “loyalty score” for traders who exclusively use the NFT platform.\n\nIn a tweet thread announcing the rewards initiative, Rainbow cheekily reframed the notion of it being a vampire attack, calling out MetaMask’s prominent fox mascot.\n\n“This isn’t a vampire attack. It’s a fox hunt,” Rainbow wrote. “Are you a MetaMask user looking to enjoy, not suffer through, Ethereum? We're here to help!”\n\nAD\n\nAD\n\nYou’ll earn points for almost everything you do onchain in Rainbow → https://t.co/ZEPJSicyog However if you want to be #1 on the leaderboard you should:\n\n🔁 Swap and Bridge in Rainbow\n\n🫂 Invite your friends to Rainbow Points are dropped to users every Tuesday at 4:20pm ET pic.twitter.com/cHQg9Zt2ay — Rainbow (@rainbowdotme) December 12, 2023\n\nRainbow has not yet responded to Decrypt’s request for comment, including on whether the points program should be taken as a first step towards a future token airdrop. MetaMask said in early 2022 that it plans to launch a token, but nothing has come of it yet.\n\nWhat is an airdrop?\n\nAirdrops refer to free cryptocurrency tokens sent to wallets already holding a cryptocurrency like Ethereum or Solana, or to the wallets of early users or contributors to a new protocol or app.\n\nWho receives an airdrop can vary depending on the stipulations of the groups sending the tokens. Similar to play-to-earn tokens, airdrops from protocols like Blur and Pyth Network reward users who participate in the network.\n\nAirdrops are very popular in the DeFi space; last month, a single user received $8.4 million worth of BLUR in the “second season” of Blur NFT marketplace airdrops.\n\nLast week, Jito, a DeFi protocol on the Solana network, announced an airdrop of 90 million tokens in anticipation of the JTO token being listed on Coinbase. After the listing on Coinbase, the combined value of the distributed tokens hit $225 million.\n\nEdited by Andrew Hayward"
    }
]