[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQakgyc0M1d3I0OFI5WGl5U0NGUkRWRzg1dFFxX05Obzd2MDYyWXpaTVVobXRLb3ViazhwdVFPOUNibC1VTl9WdFJFTVlKR2U3b0dqcDZlWVlRS3owbXhESWVOY2t1c21hVUVVSHROMFNRVzFFc1cyZWVRMm5KblVUSVpwdnV1aG91Yi1mNFc1X2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "Should You Buy Ethereum While It's Below $2,000? - The Motley Fool",
        "content": "There are two important reasons Ethereum could soar higher in 2024.\n\nDespite being up nearly 50% for the year, Ethereum (ETH 1.11%) seems to have fallen out of favor with investors. While other cryptos have been soaring in value of late, Ethereum has not. Currently trading at just under $1,800, Ethereum has repeatedly failed to surge past the $2,000 price mark this year and is now significantly underperforming Bitcoin (BTC 2.47%).\n\nAll of which makes Ethereum an intriguing investment right now. It's still the second-largest digital asset in the world (trailing only Bitcoin), and there are at least two good reasons Ethereum's price could start to move upward as we head into 2024.\n\nThe clear market leader\n\nFirst and foremost, Ethereum is still the 800-pound gorilla of the blockchain world. Ever since it pioneered the concept of smart contracts back in 2015, Ethereum has consistently been the first to market with just about every new blockchain innovation. And that has given Ethereum an enviable first-mover advantage in key areas such as non-fungible tokens (NFTs) and decentralized finance (DeFi).\n\nIn both areas, Ethereum is still the clear leader. For example, Ethereum is responsible for an eye-popping 54% of total value locked (TVL), arguably the single-best metric for measuring overall DeFi strength. No other blockchain even comes close.\n\nUntil rival blockchains, such as Solana or Avalanche, begin to chip away at Ethereum's market dominance at a faster pace, it's safe to say Ethereum will remain entrenched as the premier Layer 1 blockchain in the world. And that's exactly what I'm looking for in a long-term investment prospect: a clear market leader with an established track record of excellence.\n\nContinuous cycle of improvement\n\nEthereum's success to date has not been an accident. Ethereum boasts the largest developer network in the world, and these developers are highly focused on maintaining Ethereum's market-leading position. Case in point: Last year, Ethereum pulled off The Merge, one of the most difficult and complex technical achievements ever in the blockchain world. Some compared its difficulty to that of changing the engine of an airplane while mid-flight.\n\nWhat makes Ethereum particularly enticing to long-term investors is that it has a very detailed roadmap for future development. Even after The Merge, Ethereum has plans for new technical changes to its blockchain to boost performance, lower fees, and improve overall scalability. The next major upgrade (known as Dencun) is now tentatively scheduled for the first quarter of 2024 and has already received plaudits from Wall Street giant Goldman Sachs.\n\nWhy has Ethereum fallen out of favor?\n\nSo the obvious question becomes, \"If Ethereum is so great, why has it fallen out of favor with investors?\" While there are several possible explanations, the most likely is that The Merge may have over-promised and under-delivered. There was so much buzz and speculation surrounding The Merge that it couldn't possibly live up to the hype.\n\nInvestors woke up the next day to find that nothing really seemed to have changed with the Ethereum blockchain. Transaction processing times were faster but only marginally so. Transaction fees were still high, and there were still pressing questions about the future of staking on the blockchain (something Ethereum fixed in April). On top of all that, Ethereum founder Vitalik Buterin himself acknowledged that a lot of work still had to be done. So, The Merge wasn't some kind of magic rocket fuel that was going to send Ethereum soaring. That lack of immediate sizzle certainly disappointed a lot of investors.\n\nAdd in that many of the blockchain sectors that initially generated a lot of buzz for Ethereum -- such as NFTs and the metaverse -- fell out of favor with users, developers, and investors in 2022. And don't forget, the unprecedented rise of ChatGPT out of seemingly nowhere late last year led to a tremendous swing in investor sentiment. Suddenly, generative artificial intelligence (AI) became the talk of the investment world, and Ethereum admittedly didn't have much to offer in this regard.\n\nInvest in Ethereum for the long haul?\n\nFrom my perspective, Ethereum remains a great long-term investment play. Right now, investor sentiment seems to be at a low point, but that could change soon. Buying Ethereum now, while it's still below $2,000, seems like a fantastic bargain. You're getting a proven market leader at a discount price, combined with a potential catalyst (the new Dencun tech upgrade) to start off the New Year with a bang."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNYkQ3Q0pUVFF3TkpqZ1FKTDlYLVg1Sy1sNjRhUGNkVnpabnl0N1VUcEk1WUtpZ3dJdTRyajdPeUk1SVgyTEo3a01BOUpPc2hVS3oyU0JxNmRTYW1CZ2dqUTVvZG1hdkNLY3R1WlFSQmVVVnE1VndDMVhzVWhwazNOWmhUSEZpWlHSAY8BQVVfeXFMTzFwUGJUdFhwLVl3bU5hNTVGZ2lBcmxNd25rZUE4QzEzek5GODlVTnN4Q3lNbDBtLWFSbXREdnVkbEYtTGswT3F6dFE4bG1NT2o4TkpQdF8xTU9OUk11UThnT05xS0VvWU16bHRZSUJRQnlVS1VqeDFvckFCWHV2WGJ1ZTZLSm1xMXdYWUFfTEk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "NFTs Are Back? Sales Jump 32% in October, Led by Ethereum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto’s JPEG market is showing signs of life—despite mass layoffs at prominent marketplace OpenSea on Friday—as NFT trading volume grew by $99 million in October compared to the month before, according to a report released by crypto data firm DappRadar.\n\n“The yearlong downward trend in NFT trading has been broken,” DappRadar wrote, noting that NFT trading volume increased 32% from $306 million in September to $405 million last month. The firm described it as levels of sales not seen since August.\n\nNFTs are unique digital tokens that represent the ownership of an item, often digital art. While the market for NFTs was bubbly in 2021 and early 2022, this year has been tough for many profile picture (PFP) projects so far—as hype for collections like Yuga Labs’ Bored Ape Yacht Club (BAYC) chills amid a prolonged crypto winter.\n\nAD\n\nAD\n\nHowever, signs of warmth in the broader digital assets industry could be at play. The uptick in NFT trading volume came as the price of Bitcoin bounced above $35,000—touching its highest price in 16 months on anticipation that a spot Bitcoin ETF could be approved in the U.S. soon, analysts say.\n\nDappRadar’s report highlighted Solana as a notable network in terms of growth. NFT trading volume on the speedy layer-1 grew 15% from $24 million to $27.6 million, DappRadar reported. Meanwhile, the price of Solana itself surged 65% in October, jumping from $23 to around $38, according to CoinGecko.\n\nNFT trading volumes across a breadth of blockchains that support the class of tokens are captured in DappRadar’s report. And across all networks, a 50% jump in NFT trading volume on Ethereum—crypto’s second-largest coin—kept it “leading the pack,” DappRadar said.\n\nAs the flow of JPEGs grew in October, the floor price—or cheapest listed NFT on a secondary marketplace—for some popular PFP projects increased as well. For example, the floor price of NFTs from the aforementioned Bored Ape Yacht Club rose from $40,000 worth of Ethereum to around $55,000.\n\nAn uptick in the price of PFP projects boasting large market capitalizations was recently touched on by Punk9059, director of research at NFT startup Proof. “Uptober has arrived,” the pseudonymous researcher said on Twitter last week.\n\nAD\n\nAD\n\nWe've had 4 consecutive weeks of rising NFT volume. pic.twitter.com/GnuqmxA5xN — NFTstats.eth (@punk9059) November 3, 2023\n\nWhile DappRadar’s report could provoke WAGMI-like hopes among some NFT traders, $405 million in NFT trading volume throughout October is a paltry sum compared to the $2 billion in JPEGs that traded hands in March. Additionally, NFT sales continued to slump last month.\n\nDespite the rise in trading value, the overall number of NFTs sold in October slid by 5%, from 3.58 million in September to 3.4 million last month, DappRadar reported. Still, the decrease was less severe than when NFT sales fell by 290,000 in August.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE8tUi1lS1FzRGtSUV9ENHFoLWJucnRRX29uUzVPYTlqUlhzU1AwN2x4M0ZTRk45R0ptTkVqU1RSU2FUMnN4RHZHT09NUTR3eVV6LWV1T05xRDFubGdIOGpyaEM3STNNVmJwdzRLOU1qVDh2aFU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Nov 2023 07:00:00 GMT",
        "title": "ProShares Introduce SETH, World’s First Ethereum Inverse ETF - TronWeekly",
        "content": "ProShares has taken a groundbreaking step in the world of cryptocurrency investment by introducing the first-ever Ethereum inverse ETF. Known as the ProShares Short Ether Strategy ETF, and traded under the ticker symbol SETH, this innovative ETF aims to generate returns inversely correlated to the daily performance of its underlying index, the Standard & Poor’s CME Ether Futures Index. What sets SETH apart from other ETFs is its focus on the inverse movement of Ethereum’s price. In simpler terms, this means that as the price of Ethereum decreases, the value of the ETF increases, making it an attractive option for investors with a bearish outlook on Ethereum’s future.\n\nThis introduction comes at a time when traditional spot ETFs are still awaiting approval from the US Securities and Exchange Commission. SETH offers investors a unique opportunity to engage with the volatile crypto market without the complexities of directly shorting the asset. Listed on the New York Stock Exchange, SETH marks ProShares’ pioneering venture into the world of inverse ETFs.\n\nProShares Introduce SETH, World's First Ethereum Inverse ETF 3\n\nThe launch of Ethereum ETFs began in early October, with ProShares unveiling three out of a total of nine new products. However, the initial response was lukewarm compared to the enthusiastic reception received by their Bitcoin Strategy ETF in the past. Michael Sapir, the CEO of ProShares, emphasized SETH as a solution to the challenges associated with obtaining short positions in Ether, which often involve cumbersome and costly processes. Sapir stated that SETH was specifically designed to simplify the process of acquiring short exposure to Ether, making it more accessible for investors.\n\nProShares Forefront In Diverse ETFs Launch\n\nProShares, a prominent player in the crypto-linked ETF market, has been leading the ETF revolution since 2006. The company boasts one of the most extensive ETF lineups and manages over $60 billion in assets, along with its affiliates. This recent development follows ProShares’ previous successes in the cryptocurrency market.\n\nIn June, the company introduced its first short bitcoin-linked ETF in the United States, trading under the ticker BITI. Moreover, in October 2021, ProShares made history by launching BITO, the first US bitcoin-linked ETF, amassing over $1 billion in assets within just two days of its release. Additionally, the ETF issuer pioneered the creation of the first BTC-linked mutual fund, BTCFX, in July 2021, further solidifying its position as an innovative leader in the cryptocurrency investment landscape."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPSkt1VDY1cjJGdDU1N25CNG9RNXBXOW1VNzNfcnNlOVhlZDd1Q2MxTjRxX1hETF9jaURGdkF4UFV5ek15akhrY3FqeDkwekN0ZjF0MnZmcmVLVU05a0hsSGptSVBTYzZueXRKZDdJTmhsZGhwM1JzSzRFdmlsYm5GbVFDbk51bU1hXzVjVFl1azVqQlNOOS1yaTNlYXlCN2lXNHBNUjRuVUt2VVB2TVc4OWhYaUR1enk5aGxxR21jdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin's Golden Cross, Ethereum's And Dogecoin's Bellwether Indicator: A Look At Cryptos Into The Weekend - Nasdaq",
        "content": "Bitcoin (CRYPTO: BTC), Ethereum (CRYPTO: ETH) and Dogecoin (CRYPTO: DOGE) were trading relatively flat during Friday’s trading session on lower-than-average volume despite the general market surging following the Federal Reserve’s decision Wednesday to hold interest rates steady.\n\nThe three popular cryptos have been consolidating since Oct. 24, after Bitcoin, Ethereum and Dogecoin surged on hopes the Security and Exchange Commission is close to approving a spot Bitcoin ETF.\n\nFrom a technical analysis standpoint, the cryptos have been consolidating near highly important technical levels, with Bitcoin trading under strong resistance at the $36,000 mark and Ethereum and Dogecoin moving horizontally above the 200-day simple moving average (SMA).\n\nThe 200-day SMA is an important bellwether. Technical traders and investors consider a stock trading above the level on the daily chart to be in a bull cycle, whereas a stock trading under the 200-day SMA is considered to be in a bear cycle.\n\nThe 50-day SMA also plays an important role in technical analysis, especially when paired with the 200-day. When the 50-day SMA crosses below the 200-day SMA, a death cross occurs whereas when the 50-day SMA crosses above the 200-day, a bullish golden cross takes place.\n\nWant direct analysis? Find me in the BZ Pro lounge! Click here for a free trial.\n\nThe Bitcoin Chart: Bitcoin has been consolidating sideways on lower-than-average volume, while rejecting the important $36,000 mark on each attempt. The consolidation has been taking place on declining volume, which is often followed by a burst in high volume.\n\nThe sideways consolidation is helping to lower Bitcoin’s relative strength index (RSI), which has been trading above the 70% level since Oct. 19. When a stock’s or crypto’s RSI is above 70%, it’s considered to be overbought, which can be a sell signal for technical traders.\n\nBullish traders want to see Bitcoin’s RSI continue to lower and then for big bearish volume to come in and break the crypto up through $36,000, which could accelerate a move to the upside toward $40,000. Bearish traders want to see big bearish volume come in and break Bitcoin down below the eight-day exponential moving average, which would negate the crypto’s current uptrend.\n\nIt should be noted that a golden cross, which occurs when the 50-day SMA crosses above the 200-day, formed on Bitcoin’s chart on Oct. 29, which suggests the crypto is in a strong bull cycle.\n\nBitcoin has resistance above at $35,593 and at $38,105 and support below at $31,862 and at $31,418.\n\nThe Ethereum and Dogecoin Charts: Ethereum and Dogecoin have been consolidating sideways near the 200-day SMA, with Ethereum trading sideways above that area and Dogecoin under it. Both Ethereum and Dogecoin have been consolidating near the 200-day on decreasing volume, which like Bitcoin, indicates a larger move in one direction is on the horizon.\n\nWhile Ethereum is trading in an uptrend within its consolidating pattern, Dogecoin is trading in a tightening range, forming a triangle formation. If the cryptos break bullishly from their respective patterns, a more powerful move to the upside could be in the cards.\n\nBearish traders want to see Ethereum break down under the 200-day SMA and for Dogecoin to break down from the lower ascending trendline of the triangle. If either of those two things happens, downside pressure is likely to accelerate.\n\nEthereum has resistance above at $1,825 and at $1,937 and support below at $1,717 and at $1,615.\n\nDogecoin has resistance above at $0.069 and at $0.075 and support below at $0.065 and at $0.061.\n\nRead Next: Jack Dorsey's Block And Michael Saylor's MicroStrategy Are Both Big On Bitcoin — But Here's The Real Winner - MicroStrategy\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNc3JWOWVzMGtjenJxV24wUk9LRjlrVVNqRjVTNnNSYllnUGc1LWFDMGtfM0NRMlVyYVNENnZndjhlbE15ZnlXY1VUV3RBTTFOTkRiZUpSUUNvY2ptUllJTUNXSWlmOS0zSzJWenh4YXNKM2toQTYyZC1tXzNwekdyS05sU21Fd2FUWTlUTkRVWHJaeC1LZENZLUtrX2VYa21ZRkhTdnloNUx3R0UyOG9jam5BQUNJZ3VHLXpMcXF0MHU3RGozTWRHMGFn0gHPAUFVX3lxTE5pUXVkbGUxazRvUFgtSi03bnNHYnRoUXh1a3pyYVM4WnhjanNidW9GekI2bXRtUmtaR2IzUWZLS2tPYXRseUpjdl82WjhkMW5BaDlyWHQ5aTBVZlk3YmlVNFBGVHJVcmo5SmZoRmVkR05MM3JkRzQ1TDMzTk9FalN6SGJrTkhFQkp5YlRtT3Y2RW45enBvbW0tYnU3N196X3dSSUhmNWFDdVBJdkg4cUdsS1dtN21wb3c1aDZOQUxiQ1A1dnZiUGRvdFUwd3Z6Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "Render price crashes by 8% following transition from Ethereum to Solana - FXStreet",
        "content": "Render price slipped to trade at $2.22 after a nearly 8% decline following the failed breach of $2.55.\n\nThe Render Network successfully completed upgrading its core infrastructure to Solana from Ethereum.\n\nRender Foundation, in accordance with the upgrade, allocated $2.5 million worth of RNDR as a reward to migrate RNDR tokens to the Solana blockchain.\n\nRender price exhibited a reaction opposite to market expectations after the Render Network achieved a milestone, upgrading from Ethereum to Solana. The network, seeing as to how the transition might affect its users, is assisting by granting subsidies using RNDR tokens.\n\nRead more - Breaking: FTX founder Sam Bankman-Fried found guilty on all counts, including stealing $8 billion from users\n\nRender moves to Solana from Ethereum\n\nRender Network, which is a blockchain and crypto-enabled protocol that enables individuals to contribute unused GPU power to help projects render motion graphics and visual effects, was launched on Ethereum back in 2017. But after six years, the project is moving from the \"home of Decentralized Finance (DeFi)\" to Solana, also known as the \"Ethereum killer\".\n\nThe move was touted to be a \"watershed moment\" for Render and seen as an attempt at capitalizing on the benefits of the Solana blockchain. Jules Urbach, the founder and architect of the Render Network, commenting on the transition, stated,\n\n\"Solana's incredible transaction speeds, low costs, and commitment to web-scale architecture make it a perfect fit for the Render Network as we continue building a scalable and decentralized metaverse infrastructure.\n\nIn the announcement, Render Network noted that the transition of assets from Ethereum to Solana is being facilitated by Wormhole. Furthermore, to ease the transition for its users, Render also stated that it has allocated up to 1.14 million RNDR worth about $2.5 million at the current price in grants.\n\nThis would be used to subsidize user transfer fees on Ethereum associated with the upgrade for up to three months.\n\nInterestingly, the market reacted much differently than what was expected out of RNDR.\n\nRender price takes a hit\n\nRender price at the time of writing, trading at $2.22, noted a 7.8% decline in the past day despite the historic milestone. The influence of the broader market cues trumped the impact of the network upgrade, resulting in RNDR falling through the support level at $2.26.\n\nThe altcoin is still in the bullish zone, as noted on the Relative Strength Index (RSI), albeit observing a downtick. If the investors' sentiment remains negative, a further downfall can be expected, which might bring RNDR down to $2.08 and RSI to test the neutral line at 50.0 as support.\n\nIf the broader market cues further push the Render price downward, losing the support of $2.08 is possible, sending the token to tag the support line at $1.91. This level is also coinciding with the 50-day Exponential Moving Average (EMA).\n\nRNDR/USD 1-day chart\n\nHowever, if the Render price bounces above $2.08, it could invalidate the bearish thesis. The confirmation of the same would be achieved when the RSI bounces off the neutral line. This would enable RNDR to reclaim the support at $2.26."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxOODNZOUdTYXI0UVJCdnBFdmFLbEtsY3Vabk5XendEZjFaZ184eU9QVzdvVlpiVHg5UFY5bVJ0a0ItTS1QNTVqRnRHcnRKZVJIc3hGb1BLT2VKNGwwV2RkY003Y3hRWi0zMkpZV3poSVEwb285OVVyZlh1TVI1QzNFcFJDV3BaTGI3Qk9CU0tCNEtFRHp4YUJqYWdGRHZOZWttbF82TTRPOWFCZEVuS0pRcW1MWVh4UlJkdElEVVBXWUdmWXY2TXl2amE5YkFXTDFXTlVOXzJmQdIB3AFBVV95cUxOdVZDWnRlclozSWl1MmVqNnI4STNCSGFael9FRUM4cWJvUE1teEpURDJPS1AxSFVZb0JSU05WS3o3V3Jxdkk2SnBQSkM5NW4tbFdOeXo4dWxYVmtfLVgwZEJWM2pQcHp0N0FsdHRsUXM5bkhIUVJaTDNzQ3V5S2VZQldOZnNKS2d0bkl2OHUtRU1FU0tILVVId1BhbDhiemJ6U1BVQWV3MFNHY0lpUWs5YS1MbEF6ZlI4TEtrMEN1OVF0eTJCX3RPNzhDbmFveXFtMk1jNS11Y0k0RVpZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Nov 2023 07:00:00 GMT",
        "title": "Trader Says Ethereum Rival That’s Exploded Over 300% To ‘Keep Running,’ Unveils Targets for Chainlink and Sushi - The Daily Hodl",
        "content": "A widely followed crypto analyst says that one Ethereum (ETH) rival that’s skyrocketed by over 300% this year still has more room to rally.\n\nPseudonymous crypto trader Altcoin Sherpa tells his 194,200 followers on the social media platform X that smart contract platform Solana (SOL) will likely continue surging up in price until proven otherwise.\n\nThe strategist also says he’s not sure what will become of bankrupt crypto exchange FTX’s holdings of Solana worth $1.16 billion as of August 31st.\n\n“SOL: I think that $35-$32 are buy-the-dip zones. I don’t know what happens with FTX supply but this should keep running until shown otherwise.”\n\nSolana is trading for $39.83 at time of writing, a staggering 300% rise since the start of 2023 when it was moving for just $9.97.\n\nMoving on to the decentralized crypto exchange (DEX) platform SushiSwap (SUSHI), Altcoin Sherpa says that accumulating the digital asset at $0.91 seems like a good idea with the 0.5 Fibonacci level offering support.\n\n“SUSHI: I think buying $0.91 seems pretty solid. S/R(support and resistance) level, etc.”\n\nAt time of writing, SUSHI is worth $1.06.\n\nThe crypto strategist concludes his analysis by noting that traders should keep an eye on the $9.50 price level of the decentralized oracle provider Chainlink (LINK).\n\n“LINK: come on… let’s fill the rest of my bids, please. $9.50 is the area.”\n\nAt time of writing, LINK is trading for $11.32.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNSmJmTTM4WGc3dDRXOXZlc1RaX2NMQldLS3BrVTV3Z2xMU2VhUXJwUmpGeTU2QUVjSUsxdFlhN3laYTJfQjUyNFl0SXZEZ3lmR2VtRndmZ3paSFozZ2ZEY0JZS2g1UFBFVDBIWk1tY0dPMGJOTXhJczZ1VnZSeU1mX1V6VHpVNFlJeEpQcVFKUFVPeERzc2hrbmRySDlHYjZubWttaDlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "What Impact Did Ethereum 2.0 Brought On The Crypto Ecosystem And Beyond - Blockchain Magazine",
        "content": "What Impact Did Ethereum 2.0 Brought On The Crypto Ecosystem And Beyond\n\nThe cryptocurrency landscape has seen remarkable growth and innovation over the years, but few developments have generated as much anticipation and excitement as Ethereum 2.0. This significant upgrade to the Ethereum blockchain promises to transform not only the crypto ecosystem but also the broader world of technology and finance. In this article, we will delve into Ethereum 2.0’s potential impact, the problems it aims to solve, and how it might reshape the future.\n\nUnderstanding Ethereum 2.0: The Beacon of Progress\n\nEthereum, often referred to as the “world computer,” has been a driving force behind blockchain technology since its inception in 2015. Ethereum introduced smart contracts, enabling developers to create decentralized applications (DApps) and launch their tokens via initial coin offerings (ICOs). However, the Ethereum network has faced challenges, primarily scalability issues that have limited its potential for mass adoption.\n\nEthereum 2.0, also known as Eth2 or Serenity, aims to address these fundamental issues by transitioning from a Proof of Work (PoW) to a Proof of Stake (PoS) consensus mechanism, among other improvements.\n\nLet’s explore the potential impacts of Ethereum 2.0’s transformation.\n\n1. Scalability and Speed: Unleashing the Next Wave of DApps\n\nOne of the most pressing issues Ethereum has faced is scalability. The existing Ethereum network can become congested during periods of high demand, resulting in slow transaction speeds and high gas fees. Ethereum 2.0 introduces shard chains, each capable of processing transactions independently. This enables parallel processing, significantly increasing the network’s capacity and transaction throughput.\n\nThe impact on DApps is profound. With greater scalability and faster transaction speeds, developers can create more sophisticated and responsive applications, potentially unlocking new use cases across various industries, from finance to gaming.\n\n2. Energy Efficiency: A Greener Blockchain\n\nEthereum 2.0’s transition to PoS is not just about scalability; it also addresses environmental concerns associated with PoW blockchains like Bitcoin. PoS reduces the energy consumption required for mining and securing the network. This shift aligns with the growing global emphasis on sustainability and environmentally responsible technology.\n\nAs the world looks for more eco-friendly alternatives, Ethereum 2.0’s green approach might attract more investors and users, leading to broader adoption and investment in the platform.\n\n3. Security and Decentralization: A More Robust Network\n\nThe move to PoS enhances the security and decentralization of the Ethereum network. Validators, who replace miners in validating transactions, are incentivized to act honestly by staking their own cryptocurrency as collateral. This reduces the risk of attacks, making the network more secure and resistant to manipulation.\n\nA more secure and decentralized network can attract a wider range of applications, including those in sectors where data integrity and trust are paramount, such as healthcare and supply chain management.\n\n4. Staking Opportunities: Passive Income for Cryptocurrency Holders\n\nEthereum 2.0 introduces the concept of staking, where users can lock up their cryptocurrency as collateral to validate transactions and earn rewards. This provides an opportunity for passive income for cryptocurrency holders, potentially making Ethereum more attractive for long-term investors.\n\nThe ease of participation in staking can attract a broader demographic of users and investors, further expanding the Ethereum ecosystem.\n\n5. DeFi and NFT Growth: Fueling the Crypto Renaissance\n\nEthereum is already the epicenter of decentralized finance (DeFi) and non-fungible tokens (NFTs), and Ethereum 2.0’s improvements will only enhance these sectors. Faster transaction speeds and lower fees will make DeFi applications more efficient and user-friendly. Moreover, the increased security will boost confidence in DeFi platforms.\n\nFor NFTs, Ethereum 2.0’s scalability will enable artists and creators to mint and trade NFTs with less environmental impact and lower costs, potentially fueling the growth of the digital art and collectibles market.\n\n6. Cross-Chain Compatibility: A More Interconnected Crypto Ecosystem\n\nEthereum 2.0’s enhancements are not limited to its own blockchain. The introduction of shard chains and the Beacon Chain will facilitate greater interoperability with other blockchains. This cross-chain compatibility could lead to the creation of a more interconnected crypto ecosystem, where assets and data can flow seamlessly between various networks.\n\n7. The Broader Impact: Eth2 Beyond Crypto\n\nWhile Ethereum 2.0’s primary focus is on blockchain and cryptocurrency, its impact extends beyond these realms. The emphasis on energy efficiency aligns with global sustainability goals. The security and trust elements are applicable to various industries, from logistics to legal, where blockchain can be a transformative force.\n\nAlso, read – Ethereum 2.0: What’s New and What Is The Future Of Ethereum 2.0\n\nHow ethereum 2.0 has changed the world?\n\nEthereum 2.0, often referred to as Eth2 or Serenity, is poised to bring significant changes to the world, not just within the crypto ecosystem but also in broader technological and financial contexts. While the full impact of Ethereum 2.0 is still unfolding, here are some of the ways it has already started to change the world: 1. Scalability and Speed: Unlocking New Possibilities Ethereum 2.0’s transition from Proof of Work (PoW) to Proof of Stake (PoS) and the introduction of shard chains have addressed scalability challenges. This has led to faster transaction speeds and significantly increased capacity. With these improvements, Ethereum 2.0 is enabling a new wave of decentralized applications (DApps) and services that can serve a global audience at scale. This opens up opportunities across industries, from decentralized finance (DeFi) to supply chain management and gaming. 2. Energy Efficiency: Embracing Sustainability The move to PoS has not only enhanced network security but has also made Ethereum more energy-efficient. PoW blockchains, like Bitcoin, are known for their energy-intensive mining processes. Ethereum 2.0’s reduced energy consumption aligns with global sustainability goals and addresses concerns about the environmental impact of blockchain technology. In a world increasingly focused on green and eco-friendly solutions, Ethereum 2.0’s approach has made it more attractive to environmentally conscious investors and users. 3. Network Security: Building Trust The transition to PoS enhances the security and decentralization of the Ethereum network. Validators, who replace miners in validating transactions, are incentivized to act honestly by staking their own cryptocurrency as collateral. This reduces the risk of attacks and makes the network more robust. The improved security and trust in the network are extending to various sectors where data integrity and trust are crucial, such as healthcare, finance, and legal applications. 4. Passive Income: Staking for All Ethereum 2.0’s introduction of staking provides an opportunity for passive income to cryptocurrency holders. Users can lock up their assets as collateral to validate transactions and earn rewards. This has the potential to attract a broader demographic of users and investors who are looking for ways to grow their crypto holdings and earn returns. The ease of participation in staking is making the Ethereum ecosystem more inclusive. 5. DeFi and NFT Growth: A Flourishing Ecosystem Ethereum is already the epicenter of DeFi and NFTs, and Ethereum 2.0’s improvements are accelerating the growth of these sectors. Faster transaction speeds, lower fees, and enhanced security are making DeFi platforms more efficient and user-friendly. For NFTs, Ethereum 2.0’s scalability is enabling artists and creators to mint and trade NFTs with less environmental impact and lower costs. This is fueling the growth of the digital art and collectibles market. 6. Cross-Chain Compatibility: Interconnectedness Ethereum 2.0’s enhancements are not confined to its own blockchain. The introduction of shard chains and the Beacon Chain is facilitating greater interoperability with other blockchains. This cross-chain compatibility could lead to a more interconnected crypto ecosystem, where assets and data can flow seamlessly between various networks, enhancing collaboration and efficiency. 7. Broader Impact: Beyond Cryptocurrency While Ethereum 2.0’s primary focus is on blockchain and cryptocurrency, its influence extends beyond these realms. The emphasis on energy efficiency aligns with global sustainability goals. The security and trust elements are applicable to various industries, from logistics to legal, where blockchain can be a transformative force. In conclusion, Ethereum 2.0 represents a paradigm shift in the world of blockchain technology. With improved scalability, security, energy efficiency, and potential for passive income, it has the potential to usher in a new era of decentralized applications and blockchain adoption. Its impact is not limited to the crypto ecosystem; it resonates with wider societal and technological trends. As Ethereum 2.0 continues to develop and expand, its implications for the future are profound, shaping not only the crypto space but also influencing innovation and sustainability in the broader world of technology and finance. Ethereum 2.0 is becoming a beacon of progress, signaling a new chapter in the evolution of blockchain technology and its impact on the world.\n\n“Ethereum 2.0’s Proof of Stake consensus will deal with environmentental impact & allow sharding which is a scalability solution i.e blockchain of blockchain – remove the limit on number of users affecting the gas fees and blockchain app” — Sharon Jebitok ⚡ (@SharonJebitok) June 9, 2022\n\nIn Conclusion: A Paradigm Shift in the Making\n\nEthereum 2.0 is more than just an upgrade; it’s a paradigm shift in the world of blockchain technology. With improved scalability, security, energy efficiency, and the potential for passive income, Ethereum 2.0 has the potential to usher in a new era of decentralized applications and blockchain adoption. Its impact is not limited to the crypto ecosystem; it resonates with wider societal and technological trends.\n\nAs Ethereum 2.0 continues to develop and expand, its implications for the future are profound, shaping not only the crypto space but also influencing innovation and sustainability in the broader world of technology and finance. Ethereum 2.0 represents a beacon of progress, signaling a new chapter in the evolution of blockchain technology.\n\nFAQ’s About Ethereum 2.0\n\n1. What is Ethereum 2.0? Ethereum 2.0, also known as Eth2 or Serenity, is a major upgrade to the Ethereum blockchain. It aims to improve scalability, security, and sustainability by transitioning from a Proof of Work (PoW) consensus mechanism to Proof of Stake (PoS).\n\n2. Why is Ethereum 2.0 needed? Ethereum 2.0 is needed to address the scalability issues of Ethereum 1.0. It will increase transaction throughput, reduce energy consumption, and enhance the overall network’s security and efficiency.\n\n3. What is Proof of Stake (PoS)? Proof of Stake is a consensus mechanism in which validators are chosen to create new blocks and confirm transactions based on the amount of cryptocurrency they hold and are willing to “stake” as collateral. This is in contrast to Proof of Work, which relies on miners solving complex mathematical puzzles.\n\n4. What are the main components of Ethereum 2.0? Ethereum 2.0 comprises the Beacon Chain, Shard Chains, and Docking. The Beacon Chain is already live and acts as a PoS blockchain, while Shard Chains aim to enhance scalability by dividing the network into smaller chains. Docking is the process of migrating from Ethereum 1.0 to Ethereum 2.0.\n\n5. When will Ethereum 2.0 be fully deployed? Ethereum 2.0 is being rolled out in several phases. The Beacon Chain, which launched in December 2020, is already operational. The full transition from Ethereum 1.0 to Ethereum 2.0 is expected to take a few years, with no fixed completion date."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQcXJLeXd5VmRhTE4yRmxMNWtoUEFOWnhpbDJ3dlhYOGhyRDZITGdoRm5BbHN4enBWS3JZRmlYZkxVRk1FSHFOeTR3R25hemFaUXpESnVRdDdvMFJKS2YwMUQwR3puZUZERFpvWG1HX0ZzVFlyZHZQMUxyUjVMdEZtQjFjUDZkXzVsVW9QTndnVUFVUdIBlwFBVV95cUxNT0swM2V3Q2YtUHd5enZqR1hFMTVwSXBOeHBfem1qbTVaWl9sQWtNTzg5WEN0WmJnTmoyOHhUa19pZWRGTEllWER1YTMwZHFJWXFzR21mSW5wWEZQdk8xQVo0MzNrb2wwSzFuUDFkNlVGNVVNUGN1UVR1dFp1a19vR3lZbUV4MWZma0ZMUGFudURDeFdxZ1pJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Nov 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Distribution Phase at Key Resistance Hints 16% Drop - CoinGape",
        "content": "Ethereum Price Prediction: Since the onset of November, Ethereum has experienced heightened volatility with the $1830 level proving to be a formidable resistance, impeding its upward trajectory. This resistance has led to two weeks of indecisive trading, as evidenced by long-wicked candles which reflect the market’s current uncertainty. Investors are pondering whether this consolidation could usher in another bearish downturn.\n\nAlso Read: US Seizes $54 Mln Crypto, Including Ethereum, In Narcotics Scheme\n\nadvertisement\n\nIs a Correction Underway?\n\nThe channel pattern leads to the current consolidation in the ETH price\n\nA bearish breakdown channel pattern would set the price at 16%.\n\nThe intraday trading volume in Ether is $5.3 Billion, indicating a 27% loss.\n\nSource- Tradingview\n\nThe ongoing recovery in the Ethereum price journey initiated from the mid-October low of $1522 to a three-month high of $1874, amounting to a 23% increase. Nonetheless, this rally brought it to a resistance level that aligns with the upper trendline long-standing wedge pattern, potentially introducing a new supply zone for the market participants.\n\nMirroring the Bitcoin price consolidation, the ETH price is encountering substantial selling pressure around the $1830 threshold, as suggested by the long-wicked rejection candles. However, a detailed analysis at shorter timeframes, reveals a rising channel pattern demarcated by two ascending trendlines.\n\nShould this pattern hold, we might see this altcoin oscillate within the $1800 to $1880 band, indicating a moderate bullish continuation.\n\nFrom a bearish viewpoint, a breach below the channel’s lower boundary could precipitate a short-term downturn for Ethereum. The Fibonacci Retracement Tool delineates critical support levels at $1750 (corresponding to the 38.2% Fibonacci level) and $1700 (at the 50% retracement mark).\n\nA retracement to these zones could potentially be a precursor to a renewed ascension above the $1880 threshold, maintaining the larger bullish narrative.\n\n1 ETH to USD = $2656.323 0.95% (24h) ETH btc\n\nbtc eth\n\neth xrp\n\nxrp bnb\n\nbnb sol\n\nsol ltc\n\nltc polygon\n\npolygon cardano\n\ncardano tron\n\ntron doge\n\ndoge WETH\n\nWETH LUNC\n\nLUNC XMR\n\nXMR LIRA\n\nLIRA BITS\n\nBITS IHINU\n\nIHINU SWEAT\n\nSWEAT PI\n\nPI SATS\n\nSATS ILV\n\nILV BDX\n\nBDX MCOIN USD USD\n\nUSD INR\n\nINR JPY\n\nJPY CNY\n\nCNY GBP\n\nGBP EUR\n\nCan the ETH Price Fall Back to $1500?\n\nEthereum’s daily chart over the last seven months illustrates a methodical pullback within the confines of a descending wedge pattern. The latest uptick was a part of this pattern, testing both of its boundaries. If the pattern endures, a correction towards the $1500 mark might materialize, though traditionally, such a pattern concludes with a bullish reversal, as Coingape mentioned in our previous article.\n\nExponential Moving Average: The daily EMAs (20, 50, 100, and 200) waver around the $1780 to $1700 price bracket, fortifying this area as a strong support zone.\n\nRelative Strength Index: The daily RSI forming lower highs within the overbought territory signals a possible price retracement.\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPNmpmZU1RZGZya082bXo4bElDbmk1TFYzRVlPc2kyc01sTkRXeVhrVXNhVzZEYzNmcmRvSUd0a0h5TzJfS25zajRFcEF3TU5fQzZkT1ZVLUZGRVZaN3BxcTNWMDRBRkQyWGdnOVBwQXQ4cGZtY3lyWExJbTNJZTJ5WDdqcHB0eVhMbEJnd09oZjdrOUJlUjZxTzRhVERvaGtVU0ZmUEhLZUdZRVRIMnR0a3E2X05zbms5bXfSAcIBQVVfeXFMTlZwN19VTTlwYlpRMmgxVTgzZmJoUHd1dTJpMml6UW5uVmhtTWxrQWpvNmJTc05STW5TUEZOWlcxTDhWeV9fMFFVZV9LSVdVMjg5ZkdQajByVV80bnVFUURjWXBqdDZXRWZZRGNMUG9PT3BLNXB1TWd6X2pfR2NaNDNwUzlfNjB2TGJyTDc1QXI0VjdCN0htYkppQlFCaWYzNV9nQ0xQdmNCaXljbnZsZFRJRDFvOFViRU1Kc1ZDZGF5eGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Nov 2023 07:00:00 GMT",
        "title": "Bored Ape Creator Yuga Labs and Magic Eden Launching Ethereum NFT Marketplace That Enforces Royalties - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMulti-chain NFT marketplace Magic Eden announced Saturday that it will launch a new Ethereum platform by the end of the year in collaboration with Bored Ape Yacht Club creator Yuga Labs—with a firm commitment to honor creator royalties on NFT sales.\n\nThe companies said in a statement that Magic Eden will have a “contractual obligation” to pay Yuga Labs its share of secondary market sales of its future NFT collections.\n\n“We’re very much happy to put our money where our mouth is,” Magic Eden co-founder and CEO Jack Lu told Decrypt.\n\nLu said that Magic Eden’s overhauled Ethereum marketplace would use new smart contracts—which contain the code that powers decentralized apps (dapps)—with technical innovations that it says will ensure that royalties are paid out during secondary market sales.\n\nAD\n\nAD\n\nTechnical details will be revealed before the marketplace launches, but Lu did confirm that the standard ERC-721 Ethereum non-fungible token (NFT) standard will indeed be in use. NFTs minted with certain “properties of the marketplace contract” will have royalties enforced.\n\nThe change will not impact the way that traders interact with Magic Eden, Lu said; for example, it does not mean that they’ll have to identify themselves via know-your-customer (KYC) checks.\n\nRoyalties disputes\n\nA creator royalty is a small fee set by the artist or company behind a project and taken from the sale price of any follow-up sale of an NFT. The fee typically ranges between 2.5% and 10% of the sale price, and such fees had initially been widely honored by marketplaces as a way for creators to benefit long-term from their tokenized creations.\n\nBut in the second half of 2022, with NFT sales fading, some upstart marketplaces began using workarounds to let traders skip such creator fees, or pay smaller amounts. Major players then followed suit to keep pace, and prominent marketplace OpenSea ultimately decided to stop enforcing royalties this past August after previously committing to honor such fees.\n\nAD\n\nAD\n\nYuga Labs criticized OpenSea in late 2022 when it publicly said it had considered moving away from royalties and came out swinging again this past August after the decision was finalized. The Bored Ape creator said that it planned to stop supporting OpenSea’s marketplace contracts with new collections and those collections with upgradeable contracts.\n\n“Obviously, the genesis of this was what we saw happening in the overall ecosystem with secondary royalties,” Yuga Labs CEO Daniel Alegre told Decrypt. “The gauntlet that unfortunately OpenSea dropped made it very clear to us that we, as a company at the forefront of the NFT space, had to stand up for content creators.”\n\nA press release from Yuga Labs and Magic Eden announcing the news appears to subtly jab at OpenSea, noting that the companies have “made it unequivocal that respecting creator royalties is non-negotiable, a clear stance amidst a sea of other marketplaces who turn their backs on creative entrepreneurs.”\n\n“Going forward, for new collections, Yuga Labs will exclusively engage with marketplaces that uphold these principles, ensuring fair treatment of creators,” the release notes.\n\nAlegre said that Magic Eden—which is also in a working group with Yuga Labs in OMA3 (the Open Metaverse Alliance of Web3) to improve royalties standards—has pledged to address any loopholes or workarounds with this new technological solution.\n\nAnd this isn’t an exclusivity deal with Magic Eden, either. The companies say that other marketplaces can choose to use the same kind of contracts introduced through this collaboration, and that Yuga Labs hopes to see them broadly adopted. Furthermore, other NFT creators can mint their projects using the contracts to adopt similar protections.\n\nShifting strategies\n\nMagic Eden, best known for its original iteration on Solana, is one of those aforementioned marketplaces that switched to optional royalties last year after pressure from rising rivals. The platform also launched an Ethereum NFT marketplace last fall, but eventually took it offline ahead of the planned revival.\n\nLu acknowledged that Magic Eden “went through our own changes” in regards to royalties enforcement on Solana, but that it always wanted to support creators—it just wanted a “technical solution” for that. Such solutions have emerged on Solana over the past year, and now Magic Eden is among the builders trying to enact such standards on Ethereum, too.\n\nAD\n\nAD\n\n“We want to be on the right side of history here,” Lu said.\n\nAlegre said that he’s confident that this approach of supporting marketplaces that enforce royalties will work, and that Magic Eden will work to address any shortcomings of the tech once it’s in the wild. But he also admitted that Yuga has another potential way of encouraging traders to use such marketplaces: withholding future benefits for those who buy NFTs elsewhere.\n\nThe Yuga CEO said that the company will “provide value to holders who engage with the platforms that make the most sense.” Asked if there will be consequences for NFT buyers who purchase Yuga assets from marketplaces that don’t enforce royalties, Alegre replied that his team is “still thinking through exactly what that means.”\n\nLanded in HK, pumped for Day 1 of #ApeFestHK & to support @yugalabs on this Had to pick out this this clean boy with Magic Eden colors to celebrate. We've been non stop cooking at @MagicEden across all ecosystems lately - Rare Sats & BTC Amsterdam, Tokenized Pokemon Cards &… https://t.co/sPXt17U83a pic.twitter.com/wMmLRlunub — Jack Lu (@0xLeoInRio) November 3, 2023\n\n“You can imagine situations where we say, ‘Look, if the last trade was done on a certain platform, then certain benefits in ongoing engagement or ongoing experiences may actually not accrue to the holder of that asset,’” Alegre explained. But he said that Yuga would rather not “put the onus on the consumer” to deal with that because it becomes “complicated.”\n\n“The ideal way is actually to ensure that you're working with the right partner,” he said of Magic Eden, “and you direct as much traffic as you possibly can to that partner.”\n\nThat ability to restrict perks and benefits to NFT holders is framed as a potential backup plan for now—a nuclear option, if needed. But Alegre and team hope instead that Magic Eden’s approach will prove to be the solution to flagging creator royalties enforcement.\n\n“We're confident in the capabilities of Magic Eden,” Alegre told Decrypt. “We're obviously leaning in very heavily into this partnership, and we have full trust in Jack and his leadership team. And for now, that’s the approach that we're going to take.”\n\nAD\n\nAD"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNSnl4Slp1TTBQV2VtM1FMQy1VR3NxU1JiUnA5M1ozWk9KdFpoVGpXZGpVV0F1cUE5RkFFZ1hIMnhtTmw2alB3a0ZkUW12dkJCY0YybUhoSzJJVnRuNnd4TERCZDE5LWlQQ3NLMER5bU9UZjEwbXd5UHZtQ2ctMjM3UVpuVl9tdTVZU0VENm8yZ00yMDNHeWJURDY5cXdHT0JoUWZ6a1pId0F5SUhHc3JXd081MF9xLXF0TzJpQTdQckNUbW9xaXBNMEdHeTBjWTctdlM1Q1drMTB0UkHSAeABQVVfeXFMT29jX0xId2RjY3pUWmZXeXFzYXh0cHNMS0phMTIzMmtUNUlPVHJPdU9MaXpXNV9kejhUS0JjMi0tdUtiemZPcnVlSjNKVlNyell1M1JMT1JfUG4tbTUzcGZVVHhjZHp0OGY2MkRjeHZvQ3VSOTc2Y3ZpWng3MEVodDhWTmgtdUdScFY5TWhsTEpTZDdEcGs5UnR6d3VLSDZsOWpZZUdJN3IxQ0tZUlZNcklrZlFvdGR1ZzlUZVFKV2tZbWtXWnFvckdWVlN2NWk3ajBfU1ZPNVI2Y2I3TE1raWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "Trader Who Called 2022 Crypto Bottom Predicts Massive Pump for Bitcoin, Updates Outlook on Ethereum and Solana - The Daily Hodl",
        "content": "A trader who accurately predicted the crypto bottom in November of 2022 is expressing bullish sentiment on Bitcoin (BTC).\n\nPseudonymous analyst DonAlt tells his 54,100 YouTube subscribers that he foresees Bitcoin getting a “massive pump” that will siphon funds from altcoins and into BTC.\n\nDonAlt says that Bitcoin could afterward consolidate, a move that would positively impact altcoins.\n\n“And then you might see another [Bitcoin] consolidation like this [BTC ranging roughly between $33,400 and $35,200], another rotation into altcoins where people chase the 5%, 10%, 15%, 20% and then maybe we get a little bit of nice altcoin action.”\n\nBTC is worth $35,223 at time of writing, after hitting a new 2023 high of just under $36,000 earlier in the day.\n\nOn the likely next course of action for Ethereum (ETH) over the short term, the trader says,\n\n“ETH… my view on it is I think there’s a good chance it bounces in general like altcoin sentiment seems to be up, like people are kind of euphoric right now on the altcoin front, even though like they’re only bouncing a tiny percentage of what they lost before. So as long as that maintains you could see a little bit of a bounce.”\n\nETH is trading at $1,831 at time of writing.\n\nTurning to Solana (SOL), DonAlt says a buying opportunity could arise if and when the seventh-largest crypto asset by market cap starts consolidating after the recent rally.\n\n“There’s no real good pullback level to buy [Solana]. I think if it goes back to $30, that is scary. It’s a pullback level but it’s scarily close to where it’s actually just full-blown invalidated. And it starts looking really shitty.\n\nOn this one, if this consolidates maybe you just buy the consolidation, like that’s a pullback of sorts that I could see.\n\nOtherwise, if Bitcoin tops [out], this probably goes down. If Bitcoin rips, this probably just keeps on going.”\n\nSOL is trading at $43.21 at time of writing, up by more than 30% over the past week.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPV0c0d2JJbzlkMXlaV2pPZy04ZGxJN2VQdjdHSTVrRVc2RHlOUTlwWC1NWXBURFhGeFV0TXBzRjh5NG80RzZ3OXRwaWVGaEVQQTczdHFHeHF6T3p1ZmJBVUNwS1lzYW55cE05VXAzQ2lQV0U5V0g3c0E1anVWbG1raWw0SjkzcmlwblZpeTVxeG5lLWtUY0VpSjBrNGtNaHhmUThpV0tCZHhLQm51YmNsLU12TXBSdUNMMWdHeEQ4czjSAcYBQVVfeXFMT2ZQZDhTeHNJdGpmS1hLUENJLUF3X0lNSjNkMllKTTFPcGtJTC1FT0JQeVAybV9ESURJaXRKOEJFXzJKYXdOQ0owcWxKanpHUEhEbld1ZTRCTFJiUnBvNkdERmVRNGluZ2daUU9Pb0tqWU1Qbzh5TlFXQ3R4OG5XVlpFR2twLW9TU0VYc2xFSEFzQUVPNmgxYjRsZlhOaXMzSFJLQW0yQUYweFllTU83cWo5cjdZczlOMTNCeFdYN3d1WWNLaGN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Nov 2023 07:00:00 GMT",
        "title": "Bloomberg Analyst Says This Crypto Sector’s Market Cap Could Explode by 3,900% in Five Years - The Daily Hodl",
        "content": "Bloomberg Intelligence analyst Jamie Coutts says that one crypto sector could experience explosive growth over the next half a decade.\n\nCoutts says that smart contract blockchains such as Ethereum (ETH) and Solana (SOL) could reach 100 million daily users by 2028 by growing at 20% quarter-on-quarter.\n\nAccording to Coutts, the number of daily users of smart contract blockchains is currently over five million as a result of a quarter-on-quarter growth rate of 29% since 2019. A growth in the user base from five million to 100 million equates to 20x growth.\n\nThe Bloomberg Intelligence analyst says that the growth of smart contract blockchains may mirror that of online payments giant PayPal.\n\n“It took PayPal 13 years to reach 100 million daily users. They now have more than 400 million but growth has slowed.\n\nIf Ethereum was day zero for smart contracts (2015) then it may take a similar time frame for blockchains to reach a similar level of adoption.”\n\nAccording to Coutts, a 20% growth rate quarter-on-quarter could result in the total market cap of the smart contracts ecosystem soaring from around $350 billion currently to between $5 trillion and $14 trillion when the number of users rises to 100 million – an increase of between 1,328% and 3,900%.\n\n“While overly simplistic extrapolations such as this should never be solely relied on for valuation purposes, the exercise illustrates that users and prices are inextricably linked and that as adoption continues, prices are likely to track much higher for some assets.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNMmdyZm9rTWJrbGdTX09OLWdUb1JoOE9VbkZCZVF1cnB1UGRxQlZlcDJXZEFjcnV3bEhLYlhkOVZXZzZsOEdQUTBaNjNHNndnM1lON0d0YWItcE9EdnVlMXFhOGx0TFMtREE5MWFqZXJYZVluSHN4NHNYZVJBamctOTlR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "Prison plot to move $54M ether to Bahamas ends in seizure - Protos",
        "content": "More than $50 million worth of ether purchased during the crypto’s 2014 initial coin offering (ICO) is the subject of a forfeiture action from the US Attorney’s Office after it was linked to a New Jersey drug distribution operation.\n\nAccording to the Department of Justice (DoJ), Christopher Castelluzzo was able to secure 30,000 ether (now worth around $54 million) during Ethereum’s ICO by exchanging bitcoin he made through his drugs network. Castelluzzo sold cocaine and ‘designer drugs’ for bitcoin between 2010 and 2015 and mailed the sold product to his customers.\n\nHe made a further 30,000 Ethereum Classic in 2016 and continued to invest in different cryptocurrencies. However, the operation was eventually discovered and he was arrested, charged, and pled guilty in May of that year.\n\nCastelluzzo was sentenced to 21 years in 2018. However, three years into his sentence, he attempted to launder his 30,000 ether by sending it to an overseas entity. His plot was only discovered after police listened to his recorded prison phone calls.\n\nRead more: Fintech owner laundered millions with bitcoin for ‘finger cutter’ drug lord, police say\n\nForfeiture documents reveal Castelluzzo and an associate named Brian Krewson discussed moving the funds into a tax haven in either Ireland, Malta, or the Bahamas, while also exploring the possibility of keeping it in USDT. “Dude I would say leave it in USDC, USDT, something (UI) so nobody can touch it,” his associate says.\n\nA search warrant was subsequently issued and Krewson’s home was raided. Police found the relevant crypto wallets under Krewson’s control and, after Krewson gave up the relevant passwords, police made the ether seizure, valued at $31 million at the time.\n\nIn a DoJ statement, FBI special agent James E. Dennehy said: “Our forfeiture action of $54 million should serve as a lesson to those who mistakenly believe we can’t trace their illicit behavior or their ill-gotten proceeds. We will successfully hold all criminals responsible in the open, with real world consequences.”\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9wUFFDTGxTc1VSdW9hUmdwbTJHVGJOR2VPV2pJb0hyNEx1V01fWC1ITldtUXlNT3BQVDVXM1VXTEZHNFRKMkoyNlpoczIwNmFNZTdLSlhwOFhMZ0N3NS1CX0JGekFuZzZBZGxMeEZnMnkxY2hXclZF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Nov 2023 07:00:00 GMT",
        "title": "Daily Analysis: BTC, ETH, GAS, RUNE, BLUR - Blockchain Reporter",
        "content": "Markets are on bull activity today, with the global market cap sitting 1.36% above its previous 24-hour mark, as the total cap stands at $1.3T as of press time. The fear and greed index is at 72, as greed still dominates. The global trading volume is 18% down in 24 hours, at $38.3B as of press time.\n\nBitcoin price analysis\n\nBitcoin (BTC) has started on bull activity, as Bitcoin price stood at $34.8K as of press time after recording a daily increase of 1.6% and a weekly rise of 2%. As a result of the Bitcoin price, the token’s trade volume dropped by 30% during the same period and is presently at $13.8B.\n\nThe Bollinger bands are wide apart, showing high volatility levels on Bitcoin Price. The Relative Strength Index (RSI) is below the average line, showing some bear activity on Bitcoin price despite the uptick.\n\nBTC 1-day chart | Source: TradingView\n\nEthereum price analysis\n\nEthereum (ETH) has also started on bull activity, as Ethereum price stood at $1846 after recording a daily increase of 3.3%, as the weekly rise now stands at 3.1%. ETH’s trade volume dropped by 15% during the same period and is presently at $6.9B.\n\nThe Bollinger bands are far apart, showing high volatility levels on Ethereum Price as the Relative Strength Index (RSI) approaches a shift above the average line, showing bull dominance on Ethereum price as it heads for the overbought region.\n\nETH 1-day chart | Source: TradingView\n\nGas price analysis\n\nGas (GAS) is among today’s top gainers, as Gas price stood at $12.44 after recording a daily increase of 57%, as the weekly rise now stands at 201%. GAS’s trade volume jumped by 77% during the same period and is presently at $831M.\n\nThe Bollinger bands are diverging, showing high volatility levels on Gas Price as the Relative Strength Index (RSI) moves above the average line. This shows bull dominance on Gas price.\n\nGAS 1-day chart | Source: TradingView\n\nTHORChain price analysis\n\nTHORChain (RUNE) is among today’s top gainers, as RUNE price stood at $3.4 after recording a daily increase of 17%, as the weekly rise now stands at 34%. RUNE’s trade volume jumped by 95% during the same period and is presently at $280M.\n\nThe Bollinger bands are diverging, showing high volatility levels on RUNE Price as the Relative Strength Index (RSI) moves above the average line. This shows bull dominance on RUNE price.\n\nRUNE 1-day chart | Source: TradingView\n\nBlur price analysis\n\nBlur (BLUR) is among today’s top gainers, as Blur price stood at $0.2933 after recording a daily increase of 14%, as the weekly rise now stands at 32%. BLUR’s trade volume jumped by 28% during the same period and is presently at $163M.\n\nThe Bollinger bands are diverging, showing high volatility levels on Blur Price as the Relative Strength Index (RSI) moves above the average line. This shows bull dominance on Blur price."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQRU1NZHR3blNYbkxYdHZaMUNPRnV1ZVFnQ0xnckNiSTI0LWl4YXNSellJZzJubC1qNGFza2d1TW5IUERyNEFETFBIcXhueEVURS1rWEN2MmgwZ2xONktqamdHZjh3cjEwMjM1bG5CTDdQbzVuRXB2cHctc0IyNnFFTWVpWGM0RENPN1dXMVFNQmdFQVhCWTJMSnQ5UThrQl9TbUYxejY4bkRQSDVTSzhaRNIBtAFBVV95cUxQZEtTWGJhd0hGUTVSV1NGTmZkMVh4T0pGQUw3Vi1vWEREWGhDZjJQVWkxQk5YaHJCQ1ZwUzl1ekRURXlXanFpM2JIRXctRUtLeUhCbkVoQnp2S3p1bmxaWS1jTG02Z2RhVzlxbTd3dWNBaVBneXVVRGxzcW1EdlM4MDlzbXJ3U3dwR0pfbmoxQzlwc1dCdVZaaHZxT3YteFBZMVlFNTl4OE9jcUdBQTdfTjUwa2w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "Here’s How High AI Predicts Ethereum Price Will Go After the Next Halving - CoinCodex",
        "content": "Key takeaways\n\nEthereum (ETH) price is expected to reach new all-time highs in Q2 2024, following the next Bitcoin halving event\n\nThe Bitcoin halving occurs approximately every four years and has historically ushered in a new bull market for blockchain-based digital assets\n\nETH rose +2133% after the previous BTC halving to reach its all-time high of $4864, Sporia on TradingView expects a similar level of upside this time around\n\nHere’s how high AI predicts Ethereum price will go after next halving\n\nEthereum (ETH) is currently valued at $1788 after dropping -2.67% in the past 24 hours. This follows a period of upside in which ETH climbed +23.22% over the course of a 3-week period at the end of October.\n\nThe recent surge from ETH means that it has now reclaimed the 50% level on its July-October range in a single bullish move. So far, ETH has held up well at the range’s midway point and early forecasts are suggesting that the positive price action could continue over the coming months.\n\nThe ETH price prediction algorithm has forecasted a +253% move by Q2 2024. This would place ETH at $6,339 — a new all-time high for the second-largest cryptocurrency by market cap. The main catalyst for the projected move is the Bitcoin (BTC) halving event, where the total mining rewards in each BTC block are cut in half.\n\nWhat is Bitcoin halving and when is it due to happen?\n\nThe Bitcoin halving event occurs every 210,000 blocks, which works out to approximately every four years. The process of reducing the blockchain’s total mining rewards by half provides a greater level of deflationary pressure — after each halving event, the current circulating supply for BTC becomes increasingly scarce.\n\nWhen each block miner was awarded 12.5 BTC, the circulating supply increased by 1,800 BTC each day. After the 2020 halving event, each block miner was then awarded with 6.25 BTC, which meant that there were just 900 BTC being created each day. As a result, the proportion of the circulating supply that is newly mined is continually reduced, making those that are already in circulation more scarce, and in theory, more valuable.\n\nBitcoin’s deflationary mechanism has historically ushered in a new bull market for blockchain-based digital assets. BTC formed new all-time highs in 2013, 2017, and 2021 — approximately one year after a halving event took place. Right now, the next Bitcoin halving event is expected to occur on 15th April 2024.\n\nHow high could ETH go after the next halving event?\n\nETH shot up +2133% in total after the previous BTC halving. The move cemented Ethereum’s position as the second-most valuable cryptocurrency by market cap, taking the ecosystem’s native token from $217 to $4,864 in a period of 18 months.\n\nA trader who goes by the username Sporia on TradingView shared a long-term projection for the price of ETH. The chart highlights two parallel channels in which ETH has been trading since the 2018 alt season, including a strong support line that has been held throughout the bear market of 2022 and 2023.\n\nThe reversal indicator signal has fired off just 4 times in ETH’s history, each time preceding a massive rally. Image source: TradingView (@Sporia)\n\nSporia expects that ETH will continue to hold this market structure over the next 5 years. The upper resistance line provides the ETH price target during the next two bull stages of Bitcoin’s 4-year cycles, including a $16,090 price target in 2025. In total, this would be a +799% price increase from the current level.\n\nBottom line: AI sets bullish near-term target for ETH and long-term outlook remains positive\n\nETH has been a relative straggler during recent bullish moves in the crypto markets, climbing +60% while the total crypto market cap climbed +80% over the past year. The relative underperformance of ETH during this time frame has increased Bitcoin dominance to more than 50%, which in itself is a metric that has historically heralded a fresh period of upside for the entire crypto market.\n\nThe slight underperformance from ETH in recent times should not be a cause for concern. The network was upgraded during the bear market as Ethereum’s consensus mechanism changed from proof-of-work to proof-of-stake during The Merge, which helped make the blockchain more energy efficient.\n\nETH also benefits from new ETFs and a degree of regulatory clarity from the SEC. On top of that, Ethereum’s various layer-2s have been making major progress in isolation and each one provides an increasing level of buy pressure for the native ETH token.\n\nTo summarize, there are plenty of bullish catalysts for ETH, and it seems only a matter of time before the digital asset starts gaining momentum. As things stand, the ETH price prediction algorithm expects a +253% move in the next 7 months, which would take ETH to a new all-time high just 2 months after the next BTC halving event."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE15cVlsdDZxVTZqaDZSd3oyYnZxRC1TR0hJd3J2b0tMY0oySkhLUWdRVWhYem1YN0dncUhtSEc0M3NjS0RiSzdxR2IxLVJ4UktTLVRVQU1IbWJ6UlNzaExTU3VEeUp5TTJvdnptaU1yX1BaNjhCc1Z0TDM4UHR3WE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Nov 2023 07:00:00 GMT",
        "title": "ChatGPT predicts Ethereum price for the start of 2024 - Finbold - Finance in Bold",
        "content": "2023 has been a great year for Ethereum (ETH), summing up $74.5 billion to its capitalization year-to-date (YTD). This amounts to an increase of 50.9% from the $146.31 billion market cap observed on January 1.\n\nMoreover, investors are continuously staking ETH, with subsequent all-time highs for the total value staked in the Ethereum 2.0 smart contract. It recently achieved the value of a $32 million stake, according to data from CryptoQuant retrieved by Finbold on November 4.\n\nEthereum: Total Value Staked. Source: CryptoQuant\n\nWithin the current positive outlook for Ethereum and the cryptocurrency market expectations for a coming bull market in 2024, Finbold asked ChatGPT to forecast a price range for ETH by the start of the next year.\n\nChatGPT-4: Ethereum price will be between $3,000 to $10,000 in 2024\n\nNotably, the ChatGPT-4 forecasts Ethereum price to trade between $3,000 to $10,000 in 2024. The lowest price in this range would mean an increase of 63% for ETH from its price of $1,835 per ether by press time.\n\n“Predicting Ethereum’s price in 2024 involves analyzing current trends and factors. As of now, Ethereum’s price moves impelled by increased adoption, platform upgrades, and market sentiment. Its price could range between $3000 and $10,000 by 2024. The breadth of this forecast attributes to the volatile crypto market.” — ChatGPT-4\n\nInterestingly, the GPT-4 artificial intelligence has also mentioned “expanding institutional adoption” and the role of ETH 2.0 proof of stake network for its price prediction.\n\nEthereum price prediction for 2024 Source: Finbold (ChatGPT-4 Telegram Bot)\n\nAdditionally, it has also pointed toward technical analysis indicators to justify the mentioned price range for Ethereum.\n\n“Analyzing with indicators like Moving Average Convergence Divergence (MACD), Relative Strength Index (RSI), and Bollinger Bands, Ethereum is on a bullish trend.” — ChatGPT-4\n\nHowever, the ChatGPT also mentioned that factors like regulatory changes or a significant tech advancement by competitors could potentially drop ETH’s value in 2024. With that in mind, investors and cryptocurrency traders must continuously monitor their position and adjust accordingly as the new year arrives.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]