[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQWlhVLW54WHFaRV9wQU9TLVo2ZjZhYzR5VzZ4WGpZX1hpcTZ4NXJDVEJ2UHRwaEJoQzBZaFlxSER0VW5VV09oaThVN3FhcnBmcmpoTEZoNE5ZT0ZvSGJSUm13YTF0S0RwZ0JsLUpTWmhhYUJTdzVsbXRQZU83RmtxU1djaWhRRlRiLXI3VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Introducing Base: Coinbase’s Solution to Scaling Ethereum - Global X",
        "content": "While Ethereum is the leading public smart contract blockchain, its widespread popularity, transaction limitations, and variable demand levels can lead to network congestion and increased costs. These high costs often render small transactions impractical and pose obstacles to developing new use cases. For Ethereum to become a globally adopted data settlement platform, there is a growing need for solutions that can enhance transaction speed and reduce costs without compromising the network’s security.\n\nLayer 2 (L2) networks such as Base offer pathways to ease the computational burden on the Ethereum network. Developed by Coinbase, one of the largest offchain cryptoasset exchanges globally, Base is built for speed, affordability, and user-friendliness. In this blog post, we explore the successful early adoption of Base following its launch in July 2023 and how it is contributing to Ethereum’s growth.\n\nKey Takeaways\n\nBase aims to scale Ethereum by expanding its reach and providing a more efficient, affordable, and user-friendly experience.\n\nFueled by Coinbase’s strong brand, L2 technology adoption, and Base’s considerably lower transaction costs compared to Ethereum, adoption has happened quickly as Base has onboarded 100,000 daily active users faster than any other L2 network. 1\n\nBase represents a strong show of commitment to Ethereum by Coinbase and positions the exchange to benefit from the growth of Ethereum’s onchain ecosystem.\n\nBase Unveils New Avenues That Expand the Ethereum Ecosystem\n\nImagine Ethereum as a bustling boulevard replete with businesses of all types. Potential patrons of these businesses visit the boulevard in their cars but find themselves stuck in traffic due to inadequate infrastructure to handle the influx of vehicles. Meanwhile, a new train system running parallel to, but seamlessly integrated with the main boulevard makes its debut, providing a swift and cost-effective means of transport for these travelers, and a means of alleviating some of the road traffic.\n\nNow, instead of travelers sitting in traffic and paying high tolls, the train works to spread the cost out among a larger group of people, with individuals paying only a minimal fee for the convenience of boarding and disembarking at a station of their choice. This system not only alleviates traffic congestion but also enhances affordability, thereby improving the overall ecosystem’s efficiency and expanding the available navigation space.\n\nJust like trains help to alleviate traffic on the boulevard, L2s play a crucial role in alleviating network congestion on Ethereum. They work by shifting the execution of transactions away from the Ethereum chain and onto adjacent networks. Periodically, they consolidate these transactions into a single cryptographic proof and post the proof to Ethereum as a single transaction. This innovative approach not only ensures that activity on L2 networks inherit the security assurances of Ethereum, but also expands the Ethereum ecosystem’s transactional throughput while reducing average user costs.\n\nIn this context, Base is one of a growing number of L2 networks that extends the surface area of Ethereum and embraces ether (ETH) as the denominating currency within the ecosystem. What sets Base apart is its unique position as the first L2 network supported by a well-established public company committed to advancing crypto adoption.\n\nCoinbase unlocks access to a vast user base and over $130 billion in assets on its exchange platform.2 Furthermore, it offers a comprehensive suite of tools and infrastructure for developers to harness. For example, application developers have access to a range of integrations, including fiat onramps, a bridge to its widely adopted mobile app, and a user-friendly self-custodial wallet. Similarly, for users, Base is expected to simplify the blockchain experience as Coinbase streamlines interactions with these applications through direct in-app integrations.\n\nBase Gains Strong Momentum as Transactions Migrate from Ethereum to L2 Networks\n\nEarly indications are that L2 networks like Base have found strong product-market fit. The clearest evidence of this is that over 2 million daily transactions are now facilitated by L2 networks. Much of this migration can be attributed to the much lower costs of using L2s. Base, for example, charges an average transaction fee of $0.31 for a ~$200 USDC stablecoin transfer, a ~94% reduction over Ethereum’s current fee of $5.02.3,4\n\nFurther, in just three months as a live network, Base has grown its user base to more than 2.5 million addresses.5 Undoubtedly, Base’s rapid growth has been driven by increasing awareness of and familiarity with L2 networks over the past two years, as well as by the significant technological advancements that have been made within scaling technology during this time. Coinbase has also made the marketing of Base a strategic priority.\n\nAs the ecosystem of available applications on Base expands and the user experience continues to improve, we expect Base’s active user base to continue to grow.\n\nAt present, more than $565 million has been transferred onto Base by its active user base, making it the third-largest L2 network behind only Arbitrum and Optimism which have $6.5 billion and $3 billion in assets deposited on their network.6 The majority of this value periodically engages with a diverse range of applications, mostly consisting of onchain financial services and novel social platforms.\n\nBase Solidifies Coinbase’s Commitment to Ethereum and Paves the Way for New Business Horizons\n\nBase symbolizes Coinbase’s vote of confidence in Ethereum and a commitment to expand the network. Coinbase is well-positioned to make Ethereum more accessible, reducing the barriers for users to engage with the sea of available applications and providing developers with the tools to contribute to the ecosystem’s growth more easily and effectively.\n\nThis commitment not only strengthens Ethereum’s ecosystem but strategically positions Coinbase to explore novel business opportunities. As Base is used, cryptographic proofs summarizing network activity must be submitted and settled on the Ethereum network. Coinbase currently manages the data relay process, referred to as the sequencer, and can capitalize both by ordering transactions as well as on the margin between fees charged for offchain transaction execution and the costs associated with settling batches of transactions on Ethereum.\n\nTo date, Base has generated approximately $5.3 million in profit through these operations.7 As user activity on Base continues to grow, we expect the profits earned from these activities to grow in kind. Eventually, the task of operating the L2 sequencer and relaying transactions back to Ethereum is poised to become a collaborative effort involving multiple parties, thus, an eventual distribution of these profits beyond Coinbase is anticipated.\n\nOperating Base presents a fresh opportunity for Coinbase, but there may be additional avenues to explore. By having access to a user’s first touch point into Base via its mobile app and wallet infrastructure, Coinbase can strategically implement design choices and processes to extract fees and generate value. For example, this could involve earning fees by providing a fiat onramp for applications deployed on Base and implementing backend fees for streamlining user experience processes that simplify user interactions with these applications. Looking ahead, Coinbase may even explore the development of its own fee-generating applications, further contributing to the growing ecosystem of the Ethereum network.\n\nConclusion: Base Is an Acknowledgment of Ethereum’s Vision and We Believe a Key Player in Advancing Crypto Adoption\n\nEthereum needs alternative pathways to improve network efficiency and affordability, and Base is a prime example of such an alternative. Marking a significant milestone in the maturation of Ethereum, Base embodies the ongoing progress in open-source L2 software while benefiting from Coinbase’s expertise and large user base. By positioning itself as an accessible gateway to the Ethereum ecosystem, Base is expected to provide users with a streamlined and user-friendly experience, making the Ethereum ecosystem more approachable for the masses.\n\nThe launch of Base also highlights how companies like Coinbase can contribute to Ethereum’s scalability and unlock new business opportunities. With Base, Ethereum takes a step closer to becoming an integral part of our digital lives, while Coinbase solidifies its trailblazing role in the industry.\n\nRelated ETFs\n\nClick the fund name above to view current holdings. Holdings are subject to change. Current and future holdings are subject to risk."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBMM2pkNWJaNDk2b1M0RWJtcE9kTE5NbXJBMWc0Tko0M2gyRnM2ODdfME1DOGVKSkc2bnMtR0VubXpxVlB3UFpFSDFvc1FJWDRLNjVHUTNYMWJINWRUMTN0MERKWGE5eldTUHlMRjJBdWJQT3pmMy1YUWc1MA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "What Is Ethereum (ETH) and How Does It Work? - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE8tSHlwemlBa3h6TG4wZGhqY2FiNThUMlFWODJXNVhWUEJIUHVLSFlCczVPLUVLWW80R293Yl9ROGZBUV9iWV9LckFrdDlSbHdWdDdfYm9hcF9TYmdtOXJpRk1KMlVRUVFtR1pOY1ZSSkp5RWJCb2dQTE9sN3o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Transient Storage: Ethereum's Game-Changing Feature - hackernoon.com",
        "content": "Imagine a blockchain that operates swiftly, with each transaction costing less yet doing more. That’s the promise Transient Storage holds for Ethereum. This fresh feature is garnering attention for its potential to cut transaction costs while enabling more complex operations drastically.\n\nThat’s the promise Transient Storage holds for Ethereum, introduced through EIP-1153.\n\nDive in as we unravel Transient Storage, its mechanism, and its significance in the blockchain community! 🌐\n\nWhat is Transient Storage?\n\nTransient Storage is a temporary data storage area within Ethereum’s Virtual Machine (EVM). Unlike permanent storage, which retains data indefinitely, Transient Storage preserves data only during the transaction’s execution. It operates with two new opcodes, TLOAD (0x5c) and TSTORE (0x5d), facilitating temporary storage operations and making transactions cheaper and faster.\n\n\n\n\n\nUnderstanding Existing Data Storage:\n\n\n\n\n\nStack: Holds temporary data during a transaction, operating on a Last In, First Out (LIFO) principle. Storage: A place for persistent data storage on the blockchain. Memory: A volatile storage area cleared after a transaction for temporary data storage. Calldata: Accompanies a function call, temporary and erased post-transaction.\n\nWhy Transient Storage Matters?\n\nTransient Storage brings a cost-effective solution. It substantially lowers transaction costs, making blockchain interactions more affordable. This novel concept reduces expenses and enables more intricate operations and better communication between smart contracts and external entities.\n\nTransient Storage offers a way to store data temporarily during a transaction, helping to cut down on gas costs significantly. This is especially useful in cases like contract deployments and rollups, where temporary data handling is needed. It is like having a cost-effective temporary workspace that gets cleared out once the work is done.\n\n\n\n\n\nClear Examples and Use Cases:\n\n\n\n\n\nRe-entrancy Guards: Transient Storage can cut the cost of re-entrancy guards by over 90%, a significant reduction in gas fees. ERC20 Approvals: It enables single-transaction approvals, boosting security and user experience. Data Communication: Functions within smart contracts can securely and economically communicate data using Transient Storage. KYC verification: The user’s document can be temporarily stored, verified, and then erased post-verification, all within a single, cost-effective transaction.\n\nState Change Costs with SSTORE Operation:\n\n\n\n\n\nThe first diagram depicts Persistent Storage, with an “SSTORE” operation incurring a gas cost of 5000 for setting a variable and 2900 for resetting it, reflecting the expense of permanent state changes on the blockchain.\n\nState Change Efficiency with TSTORE Operation:\n\n\n\n\n\nThe second diagram highlights Transient Storage, where “TSTORE” operations cost only 100 gas each for setting and resetting a variable, showcasing the gas efficiency of transient, non-permanent state modifications.\n\nConclusion\n\nTransient Storage is a big step forward for Ethereum, making transactions cheaper and easier. It lowers the cost, making it affordable to run more complex operations and interact securely.\n\nThis new feature saves gas and money and opens doors to new possibilities in how we use blockchain. Transient Storage is indeed a valuable addition to the Ethereum community, pushing us towards a more user-friendly and cost-effective blockchain experience.\n\n\n\n\n\nThe future of Ethereum looks promising, with innovations like Transient Storage paving the way! 🚀\n\n\n\n\n\nFor more insights on Ethereum development, visit:\n\nConnect with me on:\n\n\n\n"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQUi1zR09wTGVNcVFudlZGRG9CUk4zczJ1d013R0JuQkMzTVpUdUJLek9Vb1YyLXlCeHF3X1lYendady1uWFRVaDBCSjhvRDB2ZzdEdWxJdEs2YVlrY1RoU1VKVy1MSkpuVVgwZ1FZY1pyWW01T0RFaFVvUXpHaE4yY0VvTUFqRUk5aUJoMXFLQVlZUUJYWWszVFRyTGg2ZnYyb25WWW1PR2lEVDVDbDFQdVl3UEpBby1Hb3fSAb8BQVVfeXFMT3NyMW5sR21XUU5ySi1PZ1lrY2ZoVkdVY1ZFdXlXRDBSUHJJQkU3LVY0YTg4WXdYeWt6QkhZLXpLeFZrSVJqOGJKY3d5M2tfa1FwQ09Bd1poNUdNLUVEVFpkYUdfU1l5ajkzM2FQUlU0RzZ2OEJfNFVmblFENTI5RTU3dHJlMFlDMlJPU0kzbmEtNHpZVXNEUkRBb19mVEI2WU5sOU1ReU9OcWVfVXNoSHZnemMzYUR4bVNBYjc2bzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ether Could Hit $3,000 as Soaring Network Activity Turns Token Deflationary - CoinDesk",
        "content": "As a result of soaring activity on Ethereum, blockchain data shows that more ETH was burned than added to its supply over the past week, turning the token deflationary after two months of being inflationary."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE93T1R0cEt4UGlHV1NYTVNUT3R4Nml2bWcwQnlxcFhkdTViNktFM0ZvWHB6eVZuOXlTakswZENjZ1JzOWJXOGxXSlE5ek1HQ2VKQ3ROM0wwTFFCZkR1Ynp2OWl3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Evmos hopes to lure Ethereum developers to IBC by deprecating Cosmos transactions - Blockworks",
        "content": "On the Cosmos-based EVM chain Evmos, Cosmos transactions and Ethereum transactions have been operating under different standards, leading to complications as these two types of transactions struggle to decode each other effectively.\n\nEvmos plans to relieve this technical headache by only supporting Ethereum-formatted transactions by 2024 Q3, it announced in a blog post Tuesday. Despite this strategic shift, the protocol emphasized that Evmos is not exiting the Cosmos ecosystem. Additionally, Evmos’ founder suggested that the move could help bring Ethereum developers to the IBC.\n\nEvmos functions as an Ethereum Virtual Machine (EVM) compatible blockchain that integrates the Cosmos IBC protocol, allowing it to operate as an EVM within the Cosmos network. Evmos raised $27 million via token sale in late 2022.\n\nRead more: Uniting the blockchain ecosystems: Q&A with Cosmos founder Ethan Buchman\n\nThe project’s co-founder Federico Kunze Küllmer said that by only supporting Ethereum transactions, Evmos hopes to make it easier for Ethereum developers to start working in Cosmos.\n\n“The wallets and the tools that they are already used to on Ethereum do not work easily on Cosmos,” Küllmer said. “We want to make it very easy for the developers and users that are already interacting with Ethereum wallets to interact with any Cosmos application specific blockchain.”\n\nThe Interchain Foundation, a non-profit focused on Cosmos adoption, made onboarding Ethereum developers a large part of its 2024 roadmap, Blockworks previously reported.\n\nIn the lead-up to fully embracing Ethereum-formatted transactions by Q3 2024, the protocol has committed to burning all Cosmos transaction fees during this interim period. This action will effectively remove these fees from circulation, signaling a shift towards revised token economics for the EVMOS token. Küllmer indicated that further details on the new tokenomics will be unveiled next week.\n\nEvmos (EVMOS) was worth around $0.07 at the time of publication.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOeGVzS2EwRjBMZUhibmxWcHdKbWFXOV81d3l2QXpJdk02d2dLMzgzYUJhTVZWSC1mUWEyQmhzNWRnSU5PY0hGdVdyMkxNeXNrempWMVJkRGt5WGJVQy11Q2xkWWpqbE1GOFF3UjdDTUZNcVJpYXV6TmR4aE8tQTlnaEZLMzE2MWs4aXdj0gGTAUFVX3lxTE4xWVBnZHBONzZ0eFhlcll2YmhnRXZJTjl3TWdvdW11ZVgyMnN0d05ldml4QThQOUpzb0RDd1RFY3pUNy0tMTNmSFNRTXdfT1pXUldaQXk1WGxySFNmZVBpOFF1aGkzcmptWklDRWZwSzFza3FMUF9uRHBvZjZXdTdsZ1hmQmpGQ2NGejNHd29WT2tNWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Rival Solana Is Back—Experts Say It's No Surprise - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSolana is once again the talk of crypto, and its native coin SOL is benefiting from the attention. The price of SOL is up over 9% today, hitting a 24-hour high of $44.41.\n\nOver the past 30 days, it has exploded in value by over 88%, according to CoinGecko—making it the biggest winner of all the major cryptocurrencies.\n\nAnd despite its association with the collapsed FTX crypto exchange and its criminally convicted founder Sam Bankman-Fried, experts say Solana’s recent rise shouldn’t come as a shock.\n\nWidely considered a competitor to Ethereum, Solana aims to be the go-to network for on-chain applications and experiences. Ethereum proponents argue that the leading smart contract network offers greater stability and security, but Solana is objectively cheaper and faster for those wanting to build or use lending protocols, games, and other applications that utilize blockchain technology.\n\nAD\n\nAD\n\nSolana gas fees right now stand at $0.000522; to make a transaction on Ethereum, it costs $6.58 on average.\n\nFor this reason, Solana has grabbed the attention of Visa, Shopify, and developers wanting to build on the network.\n\n“Solana adopts a streamlined approach, emphasizing high base layer throughput while simplifying the developer experience,” portfolio manager at Yield App Akash Mahendra told Decrypt, highlighting how much data can be processed by the blockchain.\n\nMahendra added that major partnerships and institutional interest are also helping drive up the price of SOL.\n\nAD\n\nAD\n\nIt wasn’t that long ago that Solana was getting a bad rep. FTX, once one of the biggest and most recognizable brands in the crypto space, was heavily invested in Solana.\n\nEx-FTX boss and co-founder Sam Bankman-Fried was a prominent Solana supporter, and the company invested in numerous Solana-related projects. FTX launched a marketplace for Solana NFTs, and even co-created Serum, which at one point was considered a foundation of the Solana DeFi space. At its peak in 2021, Solana commanded a market cap of $78 billion and boasted a $10 billion DeFi ecosystem.\n\nFTX then collapsed in a highly publicized bankruptcy while holding over $1 billion in SOL. The cryptocurrency plunged as a result.\n\nBut big players still see real value in the project.\n\nIn August, Solana’s payment protocol Solana Pay integrated with the e-commerce platform Shopify, allowing merchants to accept stablecoin USDC via the blockchain. This collaboration “capitalized on Shopify’s influential 10% share in the U.S. online retail sector, which translates to an estimated $444 billion in global transactions,” according to Mahendra.\n\nThen, payments giant Visa announced in September that it had chosen Solana’s blockchain for its stablecoin ambitions. This, according to Solana Foundation’s head of strategy Austin Federa, “validates the importance of the network’s unmatched speed and scalability.”\n\nThese two moves were seen as bullish by investors who have since been plugging fresh cash into the project. And things really picked up in the last month.\n\nPatrick Felder, founder & CIO at Prismatic Capital, told Decrypt this was because when Bitcoin and the broader crypto market started rallying, SOL was the most deeply oversold asset in the space following news that FTX’s new management might sell off large amounts of SOL.\n\nAD\n\nAD\n\nBut this, according to Felder, was “massively overblown” FUD (fear, uncertainty and doubt) and “triggered a massive short squeeze.” In the world of trading, a short squeeze is when the price of an asset shoots up unexpectedly due to short sellers (those who’ve bet on the asset going down) exiting their positions.\n\nThis happened with SOL, according to Felder, as many had bet on Sam Bankman-Fried’s FTX trial hurting the asset's price.\n\nThe Solana community’s annual conference, Breakpoint, took place at the end of October, leading to an even bigger rally, added Felder.\n\nThe irony is that at Breakpoint last year, the price of SOL had plunged by 60% in the week following the FTX crash. Spirits were low. But now, the coin has made a stunning comeback.\n\nAs always the question is, will it last?\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNcFIzaHkwLUY4Q01QWTFwZWU1WkhMSjRTMnhKOERTYko0VnpiWW9CTG5ZOXpnWFBDdzFxVXFVbmVkd2JRdXFKb3NnVm8zckpOemJNRFFQVXJwQVRDUnYzdHUxZmdKbmU5bTFTUWNRZ0pMZF8yc1B1VzJLTDNxRFZoNWJ0YzgwdURFT2N2QnNvNFdQcnpabHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Why Ethereum, Dogecoin, and Shiba Inu Jumped Today - The Motley Fool",
        "content": "The crypto market was hot over the weekend.\n\nCryptocurrencies had a great weekend and are off on the right foot on Monday as well. Economic news last week gave investors reason to move further out on the risk curve, and that meant in part bidding up the value of cryptocurrencies.\n\nThree of the biggest movers were Ethereum (ETH 1.11%), Dogecoin (DOGE 7.30%), and Shiba Inu (SHIB 13.68%). Ethereum rose as much as 5.4% between Friday's close and noon ET on Monday and is now up 4.8% over that time. Dogecoin had a more pronounced move, climbing 10.2% and currently trading 9.1% higher. Shiba Inu is at its high point, up 7.1%.\n\nEconomic data driving markets\n\nThe economic news last week helped push markets, including cryptocurrencies, higher to end the week. Investors saw the Federal Reserve's decision to pause rate hikes as a positive and there was a lot of speculation that rates would be kept flat through the end of the year.\n\nOn top of that, a weaker-than-expected jobs report was seen as a positive for markets. As the thinking goes, if job growth is slowing, the economy may not be overheating -- which means the Federal Reserve will stop raising rates to slow the economy.\n\nIt may seem counterintuitive, but lower interest rates are currently seen as very bullish for riskier assets like stocks and cryptocurrencies. And short term, that's driving values higher.\n\nETF speculation continues\n\nTrading momentum continues to be strong on speculation that more crypto ETFs will be approved. We know the SEC is considering multiple Bitcoin ETFs, and that could pave the way for both more crypto ETFs and more funds flowing into the industry more broadly.\n\nBlackRock is one of the leading institutions applying for a spot ETF. The company controls $9 trillion in assets under management, so it could lead to a big inflow of funds to the crypto industry. That's the speculation.\n\nMany institutions have shied away from crypto because of the legal grey area it operates in, especially in the U.S. So, approval by the SEC would be generally bullish for crypto broadly at a time when many countries are writing specific rules on how cryptocurrencies can be traded and how blockchain companies can operate.\n\nWhile the market is speculating that a Bitcoin ETF would eventually be bullish for tokens like Ethereum, Dogecoin, and Shiba Inu, it's not clear if they would eventually get spot ETFs as well.\n\nSpeculation rules the day\n\nThe reality is that everything I discussed above is speculation about the value of cryptocurrencies. There's no increased utility or ability to pay for goods using the blockchain. Investors are simply bidding up digital assets because of what the Federal Reserve did and what they think the SEC might do.\n\nIf any of this speculation ends up being false, it's possible that crypto values could crash again. I would like to see more real world utility being built into the blockchain and tokens like Dogecoin and Shiba Inu find real use cases. Until they do, this is just a speculative asset.\n\nEthereum still has the potential to be a valuable blockchain, but it also struggles with high costs and slow transactions. Upgrades could change that, but that will take time. Investors seem to be glossing over that utility need today."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQclhDNWZScDJRUHVWOTFKdTZpNmZiMWJUREtockktNTNvSllOMVN4bVV5andiTno5NHI2YzBORk1xaXZxZXhFWWxaRjRhUjNhUDF2VG9YYmdQR3V2Um1JcWM4VS16NVdPWERVZXZvVnEwSjhYdUszLUZPNjdnNGFyU19EVmU2YkFudXdlT21mLXhuSE8tQ295Nl91bmxLVFhJelZla3hzaEpONzZ4U191Zm0zRV9XeS1kWEhhWm1mMnd5d9IBxwFBVV95cUxNMnI4b3hvbjNaeVlJZWJkX3dyM2VFSUlRXzNVNG9ld0NNNnJmS1lVaHFoaEhGQUNVdUpZQXBDU19zNTlLU3h1Q09fdWVWU2RFamtJOG16NTVkdV8tN19UbGRINDR1WER4UDdtaTQyWUhpVTItNkprUlJUSU5GVVB4R1g4U1V2QjBKeTlnLWpIYlYzNVNRSkJJdDRKMExkck9CWlFLLW05V3ZRenI0WVplbmRtam9Qc3NONDVnbUZVQVhHWG9tN3hF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Banker Loses Access to $450,000,000 Worth of Ethereum (ETH) After Misplacing Wallet Keys: Report - The Daily Hodl",
        "content": "An Estonian banker has confirmed himself to be the owner of an Ethereum address with over 250,000 ETH worth nearly half a billion dollars – but says he lost the keys.\n\nIn a new interview with Vikerraadio in Estonia, LHV Bank founder Rain Lõhmus was asked about something he said years ago about getting into Bitcoin (BTC) and Ethereum in their early days but then losing access to his wallets.\n\nAsked if he ever found his keys, Lõhmus says,\n\n“No, and I haven’t made much effort either. It’s no secret that I have a wallet with 250,000 Ethereum units, anyone can calculate for themselves what it’s worth.\n\nInterviewer: That’s hundreds of millions?\n\nYeah, and I can’t solve this alone; if someone thinks they can, I’ll take all offers. My own best plan is to build Rain Lõhmus as an AI and see if he can get his memories back.\n\nLõhmus said the dangers of handling your own keys and seed phrases was one of the weak points of crypto.\n\n“I absolutely agree that this is a very weak point of this system, which makes you think that this perfect decentralization has other risks that you don’t usually think about. But it’s very common for me to lose passwords. I went to renew my ID card passwords today; if it were crypto, I’d be in a big crisis again, but luckily the police and border police work.”\n\nBased on the information shared by Lõhmus, on-chain analysts have identified his Ethereum address, and according to Etherscan, it is the fourth biggest holding of ETH excluding exchanges, the Ethereum Foundation, and the Wrapped Ether (wETH) address.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Tithi Luadthong/Natalia Siiatovskaia"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQa1NWYXVxTmloVFg1UUNnbldnVE0wdmRNVEZsYkZQcEJ5dmNBOGlCZUZFbjVuVHlqeVhjVEc4cEFzM21CaFp2NGtEdGRiNzlkVk1JTDhMWU9yVUNZYlNoRGkwUWpjcjNQajNkZGI3OGpoajNWSkgwcTVjV3ZfZkl1c1hzWGNLeWlGcnczcjExUnQxOTlWejNsatIBngFBVV95cUxPWFVCTUdDWFlTeEJOWHZSc05xdjJHdzF4aTJnSTZhMG9oemtDb0Q5SWhQUlk4ZXBXcFFsQ0RvYzYxaVlnVloyMWJvekZ2MXdTSEk4VkFTaHotLVFKRFQ3UE1mb0ZjYXBZMGJaSldHbDZVZGdUTlktcTZYYmI2dTMwdUJfV2o2OS14cG1FZjl1eG9yZ3ZnYVBOQk1NbVdaUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Yuga Labs, Magic Eden to launch Ethereum NFT marketplace with enforced royalties - Forkast News",
        "content": "Yuga Labs, the company behind the Bored Ape Yacht Club (BAYC) non-fungible tokens (NFT), has partnered with Solana-based NFT marketplace Magic Eden to launch a new Ethereum-based marketplace by the end of the year.\n\nSee related article: Sam Bankman-Fried found guilty on all charges\n\nFast Facts\n\nMagic Eden Ethereum will become the first major Ethereum-based NFT marketplace that is contractually obligated to honor creator royalties, Yuga Labs said in a press release on Saturday.\n\n“We remain committed to the betterment of the Web3 creator ecosystem, steadfast in our belief that we should champion creators who are the heart and soul of the industry,” said Jack Lu, the co-founder and chief executive officer of Magic Eden.\n\nThe current NFT bear market saw the Forkast 500 NFT index fall over 54% year-to-date, while blue-chip collections like the BAYC shed over 59% of their floor price in the same period.\n\nOpenSea, often ranked as the world’s largest NFT marketplace by volume, announced Friday on X (formerly Twitter) that it reduced its headcount.\n\n“We are immensely grateful for the contributions of those who are leaving OpenSea, and we are supporting them with a robust package consisting of both financial and non-financial support. With these changes, we are better positioned to deliver for the community, shipping high-impact efforts and matching the speed at which this space evolves,” an OpenSea spokesperson told Forkast.\n\nIn August, OpenSea cut creator royalties on its platform, making them optional. Several artists told Forkast that OpenSea’s decision has driven their search for alternative platforms.\n\nSee related article: NFT’s October treat\n\n(Update adds comment from OpenSea)"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOV2t1aHVOZzNXbzQ2cm1xYWNWZVFVdWlTMTNHV1lDdmI2MmRRNlB5THNBVVVaWHN0RlBfZEVOU3UtUUN6UENYYjVOMUtmSnl5MDZIU3QtSGV3Tm1yMC12VThjY2JxaVhZeEFsUW9QeTk2dV9ESmw3bUd6UWpMTFVlTW1zdDJvVHptWTJUT1pR0gGTAUFVX3lxTE5PeTlWb1JVV1VBVzJIa3ZnTlB0aUI0bERmX2d2Z2xHUkY5cDQ4VXFFWFdBM2RfNjh6SEg1MEZaOWNxRnZQeVpBMTNYUFNRN3M0SXhjSmVJbUx1OEtTYWItQW8zX1FxU195ZUp0TXdiX2VxUFBoQjJkNmJYZUxpanBBQk5DRTAxdXdsMDFmTi04bUItZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ethereum: Mysterious Owner of 250,000 ETH, Who Lost Wallet Keys, Revealed - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBlockchain sleuth @lookonchain has reported that the mysterious holder of 250,000 ETH acquired during the Ethereum ICO in 2014 has been identified.\n\nThe sleuth cited Coinbase's director of product strategy and business operations, Conor Grogan, on this issue. The latter is famous on Twitter for tracking huge sums of cryptocurrencies that were once lost by their owners.\n\nRain Lohmus, the founder of LHV Bank, received 250K $ETH from the #EthereumICO.\n\n\n\nThe cost is ~$77.5K, and now worth ~$473M.\n\n\n\nBut unfortunately, he lost the keys.https://t.co/PG2vALcDmU pic.twitter.com/ZPuexmdR1t — Lookonchain (@lookonchain) November 7, 2023\n\n$437 million in ETH locked dead over lost wallet keys\n\nData shared by Grogan in a recent tweet shows that he had managed to identify the unknown whale who acquired approximately $77,500 worth of ETH. This crypto, Grogan comments, has been completely untouched, and there has not been a single transfer made from it since 2014.\n\nAdvertisement\n\nThe owner turned out to be the founder of LHV Bank based in the Baltics, Rain Lohmus. Apparently, he has lost his private keys and has been unable to move his ETH or convert in into fiat.\n\nBy now, the ETH he holds is worth roughly $437 million – that is 5,333x growth.\n\nGrogan mentioned that if anyone can help him recover these hundreds of millions, he is willing to pay a generous reward for it: \"If you can help him recover them somehow, he's willing to split them with you.\"\n\nNearly 910,000 ETH lost forever in total\n\nSumming up his recent estimations, Conor Grogan stated that the overall amount of Ethereum that has been lost for good with very low chances of recovery now constitutes 886,000 ETH – that is more than $1.63 billion in the fiat equivalent.\n\nWith a few extra addresses added, the total amount of lost Ether rises to 909,800 ETH, worth more than $1.73 billion, or over 0.75% of the whole Ethereum supply circulating on the market.\n\nAdded a few extra addresses I've been meaning to (Incl. Prime Trust lost ETH) and we are up to 909,800 ETH worth $1.73B+ that are lost forever: 0.75%+ of all circulating supply pic.twitter.com/mb2XSqsQb2 — Conor (@jconorgrogan) November 6, 2023\n\nLargest ETH outflow from CEX observed\n\nAs reported by on-chain data vendor IntoTheBlock earlier, over the past week, a massive outflow of Ethereum was detected from centralized crypto exchanges – the largest outflow since August.\n\nIn total, more than $210,000,000 worth of Ethereum was moved to self-custody by investors. A likely reason for this is that investors plan to hold their ETH long term, which is best to do in one's own wallets rather than holding digital currencies on crypto exchanges.\n\nBetween Sunday and Monday this week, the second largest crypto, Ethereum, staged a minor growth of 3.13%, reaching the $1,914 level. However, within the last 24 hours, ETH failed to hold there or show a further rise. Instead, the crypto went down by 2.33%, now exchanging hands at $1,869 on the Bitstamp exchange."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNTHdweHpUVDZHM3Qzc3haUVA2SXE3cmlvdnJZekd6NF9nMENmYnRNaGotOU9HQlJocWh5Q2NFMTZ0RlpmZ1A1RkhaZEZZdEhaRndqZDJxTHY2WXQ1a0xBYUFjQTZ6Q1Q5TUNZMU5DNUdDYjVyM3VuTk4xY3dEdFlVY21scw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Study lowers Ethereum price expectation for next 7 years - crypto.news",
        "content": "Cryptocurrency experts have lowered their predictions for Ethereum (ETH), over the next few years, according to a new survey from Finder.\n\nThe survey asked 31 industry specialists for their ether price forecasts for the end of 2023, 2025 and 2030. The average predictions were down compared to a previous Finder survey conducted in July 2022.\n\nThe panel predicted Ether will be worth $1,840 on average by the end of 2023, down from a prediction of $2,451 in July. The 2025 forecast fell to $5,824 from $5,845 previously, and the 2030 prediction declined to $14,411 versus $16,414 in the earlier survey.\n\nFinder calculates the average forecasts by removing the top and bottom 10% of responses and taking the mean of the rest, a technique known as the truncated mean. This is designed to eliminate outliers and arrive at a more consistent consensus.\n\nYou might also like: Investor optimism fuels meme coins growth: predictions and market analysis\n\nWhile still bullish long term, some panelists cited near-term economic challenges and competition from other blockchains as reasons for tempered short-term expectations.\n\nETH has a huge growth potential. […] Growth is [currently] limited by high rates in TradFi. In [the] case of reaching a soft landing by US authorities, ETH[‘s] price will increase dramatically, but not until the middle of next year. Ruslan Lienkha, chief of markets at YouHodler\n\nOthers pointed to historical price patterns around Bitcoin (BTC) halvings. “Historically, as we approach a Bitcoin halving, Ethereum tends to revisit its price valuations from earlier that year,” explained Pav Hundal of cryptocurrency exchange Swyftx.\n\nThe panel predicted ETH could climb as high as $2,800 but also slump to $1,200 or below by year-end 2023. Nearly half see it finishing the year between $1,751 and $2,000.\n\nMost experts said now is a good time to hold or buy Ether, though around 17% believe it is currently overvalued. Asked if and when ETH’s total market value could surpass Bitcoin’s, 43% of panelists said they don’t expect that to ever happen. But around 20% think the ‘flippening’ — with Ethereum’s market cap overtaking Bitcoin’s — could occur by 2030."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQOW8zNUZzcEl1Vi1pUXdsVUxMQ3Z3TWxtRFZQb0lKNW1jWjNTTl9VYVNkS3prRXROcnZZWU82RDhXYXBvNnFUY0pFemktdzgyRmhmNVl6UG1XUy1SSlpIOXFFSFp4azVWR09RYjNmNlcweE5sNUR4a2FIWnhFaXctSnFtUml1Wkc4bnpVRWx6YVVHb2RIX05OZjhIdEZjTFVIaURTYVBhRE5vcXdWSXJjU3Y0Rl9iVzZvZ3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Steven Nerayoff Accuses Ethereum Founders of Massive Frauds and Corruption - Cointribune EN",
        "content": "Tue 07 Nov 2023 ▪ 3 min read ▪ by Fitah\n\nSteven Nerayoff, a former advisor to Ethereum, has publicly accused the founders of Ethereum of fraud. According to his allegations, Vitalik Buterin and Joseph Lubin, two iconic figures in the crypto industry, were conducting fraudulent activities 1,000 times larger than SBF. The founder of FTX, now convicted, orchestrated one of the biggest financial frauds in American history. But what are the reasons behind these accusations? Let’s find out.\n\nEthereum founders accused of fraud\n\nSteven Nerayoff declared on X (Twitter) that the Ethereum fraud is 1,000 times greater than that of SBF. As a reminder, the FTX case is one of the biggest financial frauds in the crypto industry. Sam Bankman-Fried was implicated in numerous crimes, including the misappropriation of customer and lender funds. This led to the collapse of his crypto exchange FTX and his trading company Alameda Research.\n\nEthereum is the fraudulent elephant in the room in plain sight 1000x bigger than SBF. Joe Lubin & Vitalik Buterin have been the front with corrupt officials at the highest levels of federal agencies such as Clayton, Gensler & many others. Cover this now. — Steven Nerayoff (@StevenNerayoff) November 2, 2023 Steven Nerayoff on X (Twitter)\n\nThe FTX founder was convicted on all seven federal counts and faces a maximum sentence of 110 years in prison. He was charged with money laundering, securities fraud, wire fraud and more. Considering the frauds committed by SBF, it’s hard to imagine anything worse. Yet Steven Nerayoff claims otherwise, revealing that Ethereum’s founders are major fraudsters.\n\nAllegations of corruption within the SEC\n\nAccording to this former Ethereum advisor, Ethereum’ s founders have allegedly bribed SEC officials. Joseph Lubin and Vitalik Buterin provided cover for corrupt officials at the highest levels of federal agencies. In particular, he cited Clayton, Gensler and many others. This would have given the project an unfair advantage on the crypto market. Ethereum executives gave bribes to the SEC to turn a blind eye to the network’s ICO, he said. Ethereum could thus escape charges of violating securities law.\n\nHowever, Nerayoff provided no substantial evidence to support his allegations against Ethereum’s founders (ETH). Moreover, his reputation for distorting the truth undermines the credibility of his information.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE9oYWFralhTRDhsVFllVVRTdFpnSS10VXpxVXdtbmIyR3hjQzQ1Mm9LTzg4REhWMC1UY1J6bk9aOFMwQ2thNV9yRjlqRVVvYlZ0WkNWeG5Cb0JlSDVPN3hCTDAwNUZ1aUctYlNvc2wtMnZYUTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "New Ethereum rollup takes a zero-knowledge approach to sharding - Blockworks",
        "content": "Ethereum scaling solution builder =nil; Foundation has introduced zkSharding for Ethereum, the latest infrastructure attempt at gaining faster transaction speeds while maintaining Ethereum’s economic security.\n\nSharding, unlike other popular scaling solutions, is designed to divide the Ethereum network into different sections and process transactions in a cheaper, more efficient manner.\n\nZkSharding utilizes zero-knowledge (zk) technology to generate proofs, ensuring that transactions are valid across different layer-2 shards before being submitted to Ethereum mainnet. The greater the sub-shards, the higher the maximum throughput on Ethereum.\n\nThis technique is not to be confused with Proto-Danksharding, which refers to Ethereum Improvement Proposal (EIP) 4844, and whose primary purpose is to reduce the costs of transactions for zk rollups by storing them in temporary data blobs, Misha Komarov, CEO and co-founder of =nil; Foundation told Blockworks.\n\nAll zk rollups can benefit from Proto-Danksharding, but only applications built on =nil; will be able to benefit from zkSharding on top of that, Komarov explains, noting that data-intensive environments and high-load environments will be able to benefit most from zkSharding.\n\n“As a zk rollup, =nil; benefits from Proto-Danksharding that cheapens storing transactions on Ethereum, however zkSharding as a scaling concept addresses fragmentation of liquidity and economic security,” Komarov said.\n\nZkSharding represents a combination of modular and monolithic blockchain architectures and delivers an appropriate solution based on its features in a competitive layer-2 environment, he said.\n\n“We believe that zkSharding addresses the drawbacks common for other alternatives on the market that go, by design, with application-specific scaling,” she said.\n\nSpecifically, Komarov notes that applications built on other zk rollups can only interact with liquidity or data that was migrated to its specific zk rollup environment, limiting market efficiency and creating additional trust assumptions and costs through bridges for interoperability.\n\n“zkSharding introduces separate shards as dedicated execution layers that are fully composable with each other, meaning a transaction can trigger the creation of new transactions on other shards,” Komarov said.\n\nThe goals are familiar from other zk-based scaling approaches such as zkSync’s, however. ZkSync terms chain connections using the ZK Stack architecture “hyperbridges,” which are also designed to trigger transactions on other “hyperchains,” a spokesperson told Blockworks.\n\n“As a rule, don’t trust, verify the claims of those that promise to solve the layer-2 fragmentation of liquidity issues — even with cutting-edge zk tech, it’s definitely not solvable for native assets without adding non-negligible security assumptions,” the spokesperson said.\n\nFinding the proof in the pudding will have to wait in the case of the new =nil; layer-2, which is initially operating with a single shard on a testnet."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOV2RoQ0puZ0R0SG1idGZzRnJkWHFlUUJqVEVkNjBvdFNjMzJpYkRleW9ZbnE1VzFZS0IxV3hzZHRhVVNxdG5LRnlLdVU1Z0pXbVZGWUg5YmFIQXRwVjNJMFdGVVlWOXk0Y0dnZk9HR2RRR1FwOHBKdnYxRXRfWTNlMllHaVUta1VSem54X3g1dGhjMldlU1RjblZoQmNBeEx1bGNMTmNvaTFfR1gza0NaRGtIbkbSAboBQVVfeXFMT2dJY0FmWk9PMUZCeGlQb09zeHpUQWZHbERONDFsUmp2cVcwUjNJa2l2SEg0ZkgzaUVKcUN6RDRwc0EyU2tlcms0ZmNpUTl0dm9aWk1jd29UTnBGWXFHVFl6UkdFSGNmdm5IcjZIM3BTVTJtdXBaVkhleDZJOEJBSmczNGwyY2RPek82SHlZS3MxeHo4dDJwRFhYMkRqS0JWRGhmQ3lJU1RKV1lGS2Q4UkJsY2tVN3BYMmRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Nil Foundation Plans New Ethereum Rollup With Zero-Knowledge Proofs, Sharding - CoinDesk",
        "content": "“We’re trying to bring that long-promised sharding, which has been on the roadmap for a while, but to try to bring it in a non-invasive way, ” Misha Komarov, the CEO and co-founder of Nil Foundation, told CoinDesk in an interview."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxORWxaREhXaUp6cVZ5UVl4UXRrV1psOXRJczdMZ0J6NWZWYVVrNjZqaG5yamhjTmJvUDNON01SeXUtSUpFZ0tLaHV5aGlUSjhLaWF0WHRUU3NEMFNBTnlXUHVMY081Q2s2eWc2MmxIdzZWMktEb1JIQ0thVllhSDltbi1ZaXd6RjlHLUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Smart Contract Optimization: How to Use Less Gas in Ethereum - hackernoon.com",
        "content": "It is well known that most transactions on Ethereum require a fee to ensure that the network is spam-resistant and doesn’t get stuck in an endless loop of calculations.\n\n\n\n\n\nThe gas fee is the amount of gas required to complete the transaction multiplied by the cost per unit of gas. The fee is paid whether the transaction succeeds or fails. As of November 2023, gas costs about 10 gwei. Although 1 gwei is now equivalent to about US$0.000002, we need to understand that this is just one unit, and you have to pay tens and sometimes hundreds of thousands of gas to complete transactions, which will be a more tangible amount. That is why we need to keep optimization in mind.\n\n\n\n\n\nAs developers, we cannot influence the price of gas, so we need to focus on the units of gas consumed by the code to reduce it as much as possible.\n\n\n\n\n\nDue to the optimizations, developing on Ethereum is different from developing Web 2.0 applications because we have to give up familiar patterns, such as splitting into small functions, for ease of testing. In this article, I will provide several examples, for each of which I will give an optimized and unoptimized smart contract with the amount of gas consumed.\n\nOptimizations and operation codes\n\nThere are two main approaches to optimization:\n\n\n\n\n\nOptimizing the cost of deployment (minimizing the size of the smart contract and the cost of executing the constructor)\n\nOptimizing each function call\n\n\n\n\n\nThe first thing to check is that the smart contract does not contain unnecessary and unused code, as deployment is compiled to bytecode, and the more of it there is, the more expensive deployment will be.\n\n\n\n\n\nHere are some expensive gas operation codes in EVM:\n\n\n\n\n\nCREATE/CREATE2 – Deploys a smart contract (32,000 gas)\n\nSSTORE – Stores the value in memory (20,000 gas if the slot has not been accessed, 2,900 otherwise)\n\nBALANCE (address(this).balance) – (2,600 gas if not previously accessed)\n\n\n\n\n\nA complete list of all the codes for the different forks can be found here: https://www.evm.codes.\n\n\n\n\n\nOptimizing each function call is a better strategy because the smart contract is deployed once.\n\nTips\n\nDo not initialize variables with default values\n\n\n\n\n\nIf a variable is not initialized, the compiler assumes that it has a default value: 0 for uint , “” for string , false for bool , 0x(0) for address . So, initializing with default values is a waste of gas.\n\n\n\n\n\n\n\n\n\nOrganize variables\n\n\n\n\n\nSolidity stores variables in cells of 32 bytes. If a variable is smaller than a cell, it is packed with another variable, but such variables must be declared side by side.\n\n\n\n\n\n\n\n\n\nDo not truncate variables\n\n\n\n\n\nWhen declaring a single variable, it makes sense to use uint256 , because otherwise, the variable has to be truncated, which takes a bit more time.\n\n\n\n\n\n\n\n\n\nUse static values\n\n\n\n\n\nIn cases where there is an option to pre-calculate static values, it is better to use it, even if it is hardcoded. For instance, in the example below, you need to call two functions that increase the gas consumption.\n\n\n\n\n\n\n\n\n\nUse constant variables\n\n\n\n\n\nFor variables that will be constants, just one immutable keyword will save a lot of gas.\n\n\n\n\n\n\n\n\n\nDo not declare temporary variables\n\n\n\n\n\nIt may seem harmless to introduce an extra variable that is stored in memory rather than on the blockchain, but adding an intermediate variable requires more gas.\n\n\n\n\n\n\n\n\n\nUse mappings instead of arrays\n\n\n\n\n\nThis is not always possible, but where possible, arrays should be avoided as they are more expensive to work with.\n\n\n\n\n\n\n\n\n\nPrefer a fixed-length array to a dynamic one\n\n\n\n\n\nIn some cases, you cannot avoid using arrays. Dynamic arrays are more expensive than fixed-length arrays because you have to change the array length when using the push and pop functions.\n\n\n\n\n\n\n\n\n\nUse the data type you need in the array\n\n\n\n\n\nWhat applies to variables does not apply to arrays. If you specify the required type, the engine will pack the data in the correct way.\n\n\n\n\n\n\n\n\n\nDo not create many functions that call each other\n\n\n\n\n\nIn any other language, the smaller the function, the better it is for debugging and testing, but things are not the same in Solidity. It is also desirable to minimize function calls to third-party smart contracts.\n\n\n\n\n\n\n\n\n\nAvoid multiple changes to state variables\n\n\n\n\n\nIf there is a variable in the blockchain whose value needs to be changed multiple times, it is better to create a temporary variable and write the final value to the blockchain after the loop is executed.\n\n\n\n\n\n\n\n\n\nOptimize gas by removing unnecessary variables\n\n\n\n\n\nEthereum offers gas refunds for deleting variables. Using the delete keyword with a variable name will return 15,000 gas but no more than half of the transaction value.\n\n\n\n\n\nUse selfdestruct() to compensate for gas\n\n\n\n\n\nDeleting a contract without the option to restore will return 24,000 gas but no more than half of the transaction value.\n\n\n\n\n\nUse Solidity Gas Optimizer\n\n\n\n\n\nThe built-in optimizer allows you to adjust the value of iterations depending on your optimization goals. A lower value should be set to minimize deployment costs, and a higher value should be set to optimize runtime costs. Below is the configuration file for the Solidity Optimizer with Hardhat.\n\n\n\n\n\nSummary\n\nAt compile time, contract code is converted to byte code for EVM, and transaction codes have a cost depending on the Ethereum fork. Despite initiatives to reduce the cost of gas (in particular, the introduction of variable size blocks in the London update, which changed the way fees are calculated), as developers, we need to optimize both the deployment and function calls in smart contracts to save money on deployment and execution."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxQQTczLWJURkVTczdUT1cyVEdNT1owZlNHdWNqMkdtaERwcmk5ajZYMjBCd21tbmYtdGxOclZuekJBaDJyNVJOamI2OUU1NnBXN2hBSm4td2hGUldoVnpkelZ5TE5PcUhUenl5Q3I0U2pfY1N1SDVILWhXUndrOXVJSElYRXF4VkdwMFdqckJ1ZDE5Y2lwVEFweHBjWnFRYXAyNVJyYXdrYmpBZmFyZlZfak9rQkpnLWVWR2dLaWlqQXMxZ2Q5YXJKX0dZb25fWGVlRTVPT0piaVNWbmhXanYyYmkxRDVBTzA2c0toZXRhd2VnS0JKbjRR0gH8AUFVX3lxTE14VXZWWjdTMVJUQ01oWm9zRmxfZmREUkktTjA5cmhFRHR2WXVfWEVXM1o5RmNjUlJIMWRFNE1zTG02UFZ5Z2lDQTI3LWVXSHUwelg5VlI2RXlkWEEydFU1cVJwZjFZSXRsdC1aZ0RRcmw4bmtabmxVUE5RcDV1d1Z3dmJBUllpV3c1TjMxM1RESWxkMjVuZVR6cjJQbl9LbGpNZTh0ZVVhb09weDNRVTQ4T3lobVktR0ctQTRXbEJpM1piUGh1UHYwRzVWaHBvbXVOaTdHYlhkeXBuT3JQdUkzblNEVHpBSjJ2NmpCTGppbGNtWGN2ekxSdVpETw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC to pivot below $35,500 after fortnight of consolidation - FXStreet",
        "content": "Bitcoin price uptrend may be exhausted for the short term, as the $35,500 level pressures BTC.\n\nEthereum price at crossroads below $1,935 mean threshold represents a make-or-break moment for the largest altcoin by market capitalization.\n\nRipple price’s bullish momentum continues to build, but the supply barrier ahead may pose a challenge with $0.800 likely to hold.\n\nBitcoin (BTC) has been consolidating below $35,500 for almost two weeks now, being static, with analysts attributing the slow-down in pace to the absence of ETF-related news. With its Ethereum (ETH) and Ripple (XRP) prices have also come to a halt, facing critical barriers that will determine the next move.\n\nAlso Read: Bitcoin and Ethereum price rise halting makes way for layer-2 & DeFi tokens to chart over 40% gains\n\nBitcoin price marks time below $35,954\n\nBitcoin (BTC) price is marking time below the $35,954 level after a steady 40% climb that began in mid-September. Exchanging hands for $35,091 as of press time, the rally seems exhausted, with the price showing reluctance around the $35,500 level. The bulls are likely to take a breather as the Relative Strength Index (RSI) position shows BTC is massively overbought.\n\nWith this outlook, it is likely that Bitcoin price could correct soon, likely for the short term, before a continuation of the primary trend. Likely targets in a downward directional bias include the $32,000 psychological level, a critical juncture having capped the upside potential for the king of cryptocurrencies since May 2022 when the Terra (UST) ecosystem fell off a cliff.\n\nThe RSI deviated from the northbound move, flattening to show complacency as buying pressure continues to weaken. This observation favors the downside.\n\nBTC/USDT 3-day chart\n\nHowever, if sidelined investors join the bull’s camp, Bitcoin price could continue north, breaking past the $35,954 resistance level with a breakout objective above the $40,000 psychological level. In a highly bullish case, the gains could extrapolate for BTC to test the supply zone extending from $44,321 to $47,122, with the $48,000 handle presenting the next logical target, a level last seen in March 2022.\n\nAlso Read: Holders of $600 billion worth of BTC are asking for Bitcoin price to rally not by 15% but by 96%\n\nEthereum price on collision with $1,035 mean threshold\n\nEthereum (ETH) price’s 22% uptrend that started on October 13 has the second largest cryptocurrency by market capitalization confronting a crucial barrier – the $1,935 mean threshold of a supply zone extending from $1,861 to $2,004.\n\nIf Ethereum price records a daily candlestick close above the $1,935 midline, it would confirm the continuation of the uptrend, setting the tone for a successful foray above the $2,000 psychological level, with $2,029 as the next logical target.\n\nETH/USDT 1-day chart\n\nA rejection from the $1,935 level could send Ethereum price spiraling south, potentially slipping below the $1,800 psychological level and testing the $1,748 support. Such a move would denote an 8% drop below current prices.\n\nAlso Read: Ethereum net exchange deposits hits five-month peak with almost 130,000 ETH flowing to exchanges\n\nRipple price eyes 10% more gains\n\nRipple (XRP) price continues northbound, with robust higher highs and higher lows surpassing key barricades. Despite XRP being massively overbought, the primary trajectory of the RSI is still northbound, showing that momentum is still rising.\n\nIncreased buying pressure above current levels could see Ripple price test the supply zone extending from $0.7771 to $0.8199. For a confirmed uptrend, the price must break and close above the $0.8000 psychological level, with the move likely to catalyze an extension to the $0.9000 psychological level, 25% above the current price.\n\nXRP/USDT 1-day chart\n\nConversely, with XRP being massively overbought, it is likely that the supply zone will hold as a resistance order block. The ensuing rejection could see Ripple price pull south, slipping through the $0.6968 support level and testing the $0.6242 support with bulls seeking rejuvenation. Another evaluation will be required at this point to determine the next step for XRP, considering the prevailing bullish outlook in the broader market.\n\nAlso Read: XRP price could extend gains with Ripple’s likely win through $20 million settlement with SEC"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNTUwyZVJMWndTWUhnZkZtUl9JdS0tcVBKWXdkTnc2RXhLQzBSNDNnZEFnUTZSOGFxUW5XY3dTZ2tvNnduYjJkTDJoc2Z2LTVxY1FwSU40M1BIVGlCSVZsdm9JcG1LY3Nmdl9kY3NvOTZjVmx4a2I4NS1US2hXX0FGbGN0a2FlS1NaS1hwdXZEdGRZZFpMZDZWM1JQdVU5djJQbDdpRXo0X3hTbl9fdHZj0gG0AUFVX3lxTE5qUjVQT3VKNVZ5cXh1UnNnZi1lblhtYmY4SG12SDRNejY0OVJDbmNHbzQ2QWltdFJCeG9acXh4bzVXaHNQd1kwRXNsdFdjVjhDdnBmMFMxc01kemFwenEtUVBVWHJxc2ZrVS12M3FJX25oT3VhY19EX3hmOWk1U0JqTmtmQndKTzF1LUt2QlM3Q1djdXhBSkxlQmNCU09xT001OF90bDNMek1BaGRVT1V2alV4Uw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH Going To $5.8? Here’re The Levels To Watch - CoinGape",
        "content": "Ethereum (ETH) price is pulling back after taking a breather in the wake of the climb to $1,900 earlier this week. The prominent smart contracts token needs to sweep fresh liquidity preferably at $1,800; the immediate support. Traders may take this opportunity to lock in the gains, a move likely to trigger a larger sell-off.\n\nHowever, with a bull flag pattern validated on the weekly chart, investors do not need to panic, as the next rebound could overcome resistance at $2,000 and pave the way for gains to a new all-time high of $5,800, foreshadowed by the Finder’s panel.\n\nadvertisement\n\nA higher support is anticipated above $1,800 as Ethereum collects liquidity for the next breakout above $2,000. For now, it might be prudent to let the consolidation play out before betting on either longs or shorts.\n\nEthereum Price Bullish Scenario – Bull Flag Pattern\n\nThe weekly chart highlights the formation and validation of a bull flag. This is a bullish flag pattern, formed by a couple of price rallies set apart by a consolidation period.\n\nThe flagpole represents the bullish muscle blindsiding sellers who then briefly assume control over the price (the channel), as profit-booking takes place, but eventually, the price breaks out to a higher level.\n\nIn Ethereum’s case, the bull flag breakout has already been validated. However, due to the resistance at $1,900, buyers lack the momentum to complete the 49.44% breakout target of $2,678.\n\nWith Ethereum price holding above all three moving averages, including the 50-week Exponential Moving Average (EMA), the 100-week EMA, and the 200-week EMA, the uptrend has a higher chance of resuming than a correction taking place below $1,800.\n\nTraders should be on the lookout for how Ethereum price responds to the support provided by the 100-week EMA (blue) at $1,806. A retest of this support could prove highly bullish and trigger a larger breakout.\n\nHowever, trading below $1,800 might be detrimental to ETH price as it may discourage traders from booking new long positions afraid of capitulation. Below $1,800, the next key support areas are the 50-week EMA (red) at $1,757 and the 200-week EMA (purple) at $1,633.\n\nFinder Analysts Predict Ethereum Price Rise To $5.8k By 2025\n\nFinder, a platform that brings together predictions from different industry leaders, has predicted a potential surge in Ethereum price to $5,800 by 2025.\n\n“On average, our panel thinks Ether (ETH) will be worth US$1,840 by 2023 before rising to US$5,824 by 2025 and then US$14,411 by 2030,” Finder’s latest report states.\n\nMeanwhile, Ethereum is expected to close the year at $1,840 based on the average prediction of the panel of 31 crypto industry specialists. The panel appears to have changed its tune toward the bearish side, following a previous optimistic prediction of $2,451 in July.\n\nMost panelists believe that “ETH has a huge growth potential” especially with the growing interest in “Ethereum staking and [ETH’s] exceptional low inflation rate” which points to a potential short squeeze likely to culminate in a remarkable upside in the ecosystem, believes Ben Richie, the managing director at Digital Capital Management Pty Ltd.\n\nHowever, some specialists like Ryan Grace, the head of tasty tastycrypto said that like Bitcoin price, Ethereum price is bound to encounter macro headwinds which could limit its upside action in the short-term, especially with the Federal interest rates above 5%.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNUzFiZGhZVVpSbkJxZmNKZnFGT0ZQVXpuZnF5QktWZzlUMkdRRm95WjdIVzhMZl9JZllrMXcxbVVMRm9PLXNXbkJMWGpIek1Wemx5VENuaWVfRW40Y1B2dnJBTXdTTC1oLXhXQ1AyWC1kNnAwYjE4Q19qTklORXVUWg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Weekly Highlights: Bitcoin & Ethereum Show Resilience, Altcoins Soar - TronWeekly",
        "content": "The cryptocurrency market had an upbeat week, with Bitcoin and Ethereum showing resilience around key resistance levels. Altcoins, in particular, had a remarkable week, with significant gains that suggest further growth in the near future.\n\nIn the top 20 cryptocurrencies, some altcoins stood out as the week’s biggest gainers. Leading the pack was Solana (SOL), followed closely by XRP and Cardano (ADA), securing the third position with impressive growth.\n\nSource: CoinMarketcap\n\nSolana (SOL) made an impressive mark with a 23% surge in the past week, reaching a peak of $46.33. Currently trading at $40.28, SOL has shown robust performance, even though it experienced a 3.80% decrease in the last 24 hours.\n\nSource: CoinMarketcap\n\nXRP also made waves with a remarkable 22% gain over the past week. Currently trading at $0.6788, it demonstrated noteworthy performance, with a 10% increase in the last 24 hours and a 138.64% surge in trading volume.\n\nSource: CoinMarketcap\n\nCardano (ADA) gained significant attention with a more than 16% weekly increase, currently trading at $0.3435, and a 55.63% rise in trading volume in the last 24 hours.\n\nOther popular altcoins such as Chainlink (LINK), TON, and Polygon (MATIC) also saw gains in their weekly charts, with LINK up by 12%, TON by 10%, and MATIC showing a 10% increase, according to data from CoinMarketCap.\n\nBitcoin (BTC) & Ethereum (ETH) Weekly Review\n\nDespite a fairly neutral weekend in terms of trading sentiment, recent data from Santiment suggests that sentiment has turned bearish once more. Notably, previous instances of higher ratios of negative keywords coincided with rising prices for Bitcoin and other market caps.\n\nSource: CoinMarketcap\n\nIntoTheBlock highlighted that Bitcoin’s open interest in perpetual swaps relative to its market cap (OI/MC) is near its yearly lows. This indicates that the recent price surge has been driven by spot volumes rather than derivatives-based leverage, suggesting a more organic demand.\n\nA crypto analyst noted some bearish signals in Bitcoin’s weekly analysis, such as a bearish cross on the daily MACD and a minor bearish divergence on the daily RSI. However, these signals are not a cause for concern, as the base case suggests a brief pause under $36,000.\n\n$BTC WEEKLY CLOSE ANALYSIS 🧐\n\n\n\nLet me knock out some quick SLIGHT bearish signals first, and then we will get to the weekly closing chart and commentary (emphasis on slightly).\n\n\n\n🔸While not shown, we did finally get a bearish cross on the DAILY MACD. I want to stress that our… pic.twitter.com/IVqeBW5R9p — JT ✝️ (@JTheretohelp1) November 6, 2023\n\nOn the positive side, the weekly analysis reveals bullish strength with the Weekly Stoch/RSI above 80 and a Bull Cross on the Vortex Indicator, a key trend indicator for BTC. The price remains above key moving averages, and the resistance at $36,000 and support levels at $31,800 and $30,500 are highlighted. Breaking through the $48,000 resistance could pave the way for a new all-time high for Bitcoin, indicating an overall positive trend.\n\nFurthermore, Santiment pointed out that Ethereum’s rise above $1,800 was accompanied by the largest number of new addresses created since October 7th. If the long-term trend of network growth continues and exchange supplies continue to drop, Ethereum (ETH) has a strong case for crossing $2,000 once again.\n\nSource: CoinMarketcap\n\nIntoTheBlock noted that Ethereum’s settled volume reached a 6-month peak, with over $213 billion transacted on Ethereum’s mainnet last week. Layer 2 networks like Arbitrum, Optimism, and Base contributed an additional $16 billion to this impressive volume.\n\nEthereum's settled volume hits a 6-month peak!\n\nLast week, over $213B was transacted on Ethereum's mainnet, with layer 2 networks like Arbitrum, Optimism, and Base contributing an additional $16B. — IntoTheBlock (@intotheblock) November 4, 2023\n\nAs of the latest data from CoinMarketCap, Bitcoin is currently trading at $34,914.86, with a 2% increase over the past seven days and a 0.96% increase in the past 24 hours. Ethereum (ETH) is trading at $1,877.05, showing a 0.47% increase in the past 24 hours and a 5.58% gain over the past seven days.\n\nRelated Reading | Bitcoin Strategy For Capital Preservation: Insights From MicroStrategy CEO"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxObTFFYkFWVm1WZ2JFTmxOcWQ4cVZrQm0wbkx4N0FrU0pxS0JkWmVxVzBlUDE0ZWZlaTlTanBRLUh6dGhpaDAxQzFMRnpLNHVTVW1LNmFtU1VwSml2QnZqMGlSU1ZQNmozcmxUa1RNb1U0b1hOMlQtU1VYWmpVMGZEekVQVFRvaV9McUNVdFVnLXBYZ9IBlwFBVV95cUxPRC1ydTBzMUxGTnBYbzhhLTJ6S2Yza2t1RDhPanh0aHotVG5pUjlKVFBJV0RCQjhuNUtfR19ucy1pcHFWSDNoYV9tanNnRXNRMW1jU2pwcUl4WEViMG1uSm95RVFXU3lvZVdpTWZLQS1iUTViQ3AxSU0zRFF1cWQ2UGE0ZlhYV202OGt1ZHlJY1hnX09JNlZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Is $ETH Ready to Regain $3000 Mark? - CoinGape",
        "content": "Ethereum Price Prediction: Amid a vigorous bull market that stretched from November 2022 through April 2023, the Ethereum coin entered a consolidation phase, characterized by the formation of a bullish flag pattern on the daily chart. This chart setup is formed to recuperate exhausted bullish momentum before the buyers take the leap. Coinciding with the market’s current recovery mood, the ETH price gave a decisive breakout from the upper boundary of this pattern on November 5th. This breakout hints at the potential for a substantial rally in the near term.\n\nAlso Read: Ethereum Price Under Pressure As $400 Million Of Open Interest Wiped Out\n\nadvertisement\n\nIs ETH Price Ready to Surpass $2000?\n\nA flag pattern is often spotted at an established uptrend offering buyers a temporary break before the next rally\n\nA bullish breakout from the chart set ETH price for a potential 22% jump\n\nThe intraday trading volume in Ether is $8.6 Billion, indicating a 22% gain.\n\nSource- Tradingview\n\nThe bullish flag on the Ethereum price chart has been clearly defined over seven months, with the coin’s price oscillating between the pattern’s converging trendlines.\n\nNotably, this altcoin price has bounced off the pattern’s upper boundary twice and its lower boundary four times, demonstrating its strong influence on the market’s psyche. The last bounce from the lower boundary occurred on October 13th, sparking a 25% rally to the present price of $1911.\n\nThis upward movement was accompanied by a decisive break of the resistance trendline, signaling a potential conclusion to the correction trend. Currently, with a modest 1% daily gain, the ETH price is positioned favorably after the resistance breakout, poised to target the $2340 mark, which would represent a 24% upside.\n\nFurthermore, the projection from the flag’s pole hints that the climb could extend toward the significant $3000 mark.\n\n1 ETH to USD = $2656.323 0.95% (24h) ETH btc\n\nbtc eth\n\neth xrp\n\nxrp bnb\n\nbnb sol\n\nsol ltc\n\nltc polygon\n\npolygon cardano\n\ncardano tron\n\ntron doge\n\ndoge WETH\n\nWETH LUNC\n\nLUNC XMR\n\nXMR LIRA\n\nLIRA BITS\n\nBITS IHINU\n\nIHINU SWEAT\n\nSWEAT PI\n\nPI SATS\n\nSATS ILV\n\nILV BDX\n\nBDX MCOIN USD USD\n\nUSD INR\n\nINR JPY\n\nJPY CNY\n\nCNY GBP\n\nGBP EUR\n\nETH vs SOL Performance\n\nSource: Coingape| Ethereum Vs Solana Price\n\nThe last three months’ price period accentuates that Solana price recovery has outperformed the second-largest cryptocurrency Ethereum. From mid-October, the SOL price picked up aggressive bullish momentum, which led to parabolic growth in the last three weeks, However, the ETH price is making a steady yet slow recovery trying to sustain its higher ground.\n\nSuper Trend: A green film projected in the daily chart of this trend-defying indicator reflects a bullish sentiment in the market.\n\nAverage Directional Index: The daily ADX slope at a high of 50% reflects ETH price may witness some occasional pullback to keep sustaining high bullish momentum.\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNbUtnQlkzMHBzODlyZWtRM2RqdV9hT05VbzN1bXVOcjFvWENVWFV4MEFqWGhUTllTSUd5UmNzTHRNTDBBNUhxMzNpWjdsZHRTbzdwQm9TbEtPME9ZOHlRZ25EUGtKLVpCY2pES0g5OVhHSDFOMnFrOE0tVzNxamoxVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Analysis of Ethereum’s on-chain data and ETH price - The Cryptonomist",
        "content": "During 2023, Ethereum Layer 2 sector, and more generally the entire blockchain infrastructure landscape, has seen strong growth in terms of new users not in price.\n\nThe DeFi sector saw a 52% increase in activity this year, driven by the strong development of the L1 interoperability and scalability platform.\n\nIndeed, Ethereum users seem to prefer decentralised finance to other NFT and gaming activities, with on-chain trend data clearly indicating the dominance of this sector as the first choice of individuals on the network3.\n\nMeanwhile, the speculative cryptocurrency market continues to make progress, with ETH topping $1,900 per unit overnight, only to retreat slightly this morning.\n\nCompared to the beginning of the year, the price of the industry’s second most capitalised crypto has risen sharply, but will this be the case in 2024?\n\nWill Ethereum’s technology be able to dominate and attract the next billion users?\n\nAll the answers in this article.\n\nOn-chain data in the Ethereum market and classification of user habits\n\nOn-chain data for 2023 shows that the Ethereum infrastructure and its entire ecosystem is booming.\n\nThe entire layer 2, bridging platforms and web3 services sector is growing rapidly, with a positive estimate of 149.28% of new users compared to the beginning of the year.\n\nIn particular, the niche that seems to be attracting the most attention is that of DeFi, which, as we will see later thanks to the metrics provided by Nansen, has achieved higher user traffic than other decentralised industries.\n\nMore specifically, we start collecting on-chain data by looking at the change in the number of active addresses on the Ethereum blockchain over the course of 2023.\n\nAs of October 2023, there are over 300,000 entities that have successfully completed at least one transaction, such as transferring assets to another address.\n\nThis shows that, despite two turbulent years consisting of price collapses of most cryptocurrencies, global crises and hack attacks on the largest DeFi infrastructures, there is still a user base working on Ethereum on a daily basis.\n\nTrying to go deeper, thanks to Nansen’s custom queries, we can sample active users on Ethereum to understand their attitudes in 2023.\n\nWe classify the people in question as\n\nDeFi users : addresses that have used DEX, lending and yield farming platforms, opened positions with decentralised futures, executed stablecoin payments, exploited yield optimiser or arbitrage protocols, etc.\n\n: addresses that have used DEX, lending and yield farming platforms, opened positions with decentralised futures, executed stablecoin payments, exploited yield optimiser or arbitrage protocols, etc. NFT scammers : addresses that have participated in NFT auctions, played crypto casinos, roamed the metaverse, invested in NFT liquidity platforms, bet on GambleFi;\n\n: addresses that have participated in NFT auctions, played crypto casinos, roamed the metaverse, invested in NFT liquidity platforms, bet on GambleFi; Scaling solution enthusiasts: addresses that have used scaling solutions such as rollups, cross-chain interoperability platforms, bridges, sidechains and L2.\n\nAccording to the data recorded by Ethereum’s various web3 applications, we can conclude that the majority of active users have made DeFi their primary choice in 2023.\n\nAbout 92,000 addresses are classified as ‘DeFi users’, while only about 40,000 preferred NT and scaling substrates overall, according to a snapshot from 12 October.\n\nSince March, there has been a strong increase in scaling protocols, supported by the trend of Ethereum rollups and alleged airdrops for early adopters.\n\nIn contrast, the NFT niche has lost over 50 percent of its on-chain assets over the past year.\n\nAnother way to analyse the regularity of Ethereum users is to look at the FIRST on-chain transaction made by NEW addresses in 2023.\n\nBasically, all wallets that were funded by other entities in 2023 and executed a transaction within 7 days were analysed.\n\nOnce again, DeFi seems to be the preferred choice of the crypto world’s degenerate, with the majority of transactions flowing to this sector.\n\nAccording to data from 12 October, only 17% of new users used Ethereum scaling solutions as their first transaction, but this figure is up on the beginning of the year.\n\nOn the other hand, transactions in the NFT market were less frequent, falling from 24% at the beginning of the year to 6% on 12 October.\n\nDeFi confirmed its dominance by recording a significant increase in this metric, with data showing 66% at the beginning of the year and 76% on 12 October.\n\nEthereum (ETH) price analysis and predictions\n\nAs mentioned above, it’s not just Ethereum’s on-chain data that will have supporters of the smart contract platform smiling in 2023, but also the performance of the ETH price, which has risen by more than 50% over the past 10 months.\n\nAfter starting the year just above $1,200 per unit, the Ethereum coin returned to the $2,000 area around April, then went through a mild distribution phase until the rally of the past three weeks.\n\nCurrently, the price of ETH remains firmly above the 50 EMA, suggesting another leg higher before the end of the year.\n\nThe RSI is rising on the weekly time frame and there is plenty of room for further upward movement.\n\nThe Super Trend Indicator, which has been very useful in predicting the beginning and end of previous bull/bear cycles, has called for a buy around the middle of the year (remember that it arrives a little later than market logic).\n\nIf we compare the current phase with that of 2020, when the Supertrend indicated a buy opportunity with ETH at around $250, we could say that we expect at least 4 more months of crypto price rises.\n\nGrafico settimanale del prezzo di Ethereum (ETH/USD)\n\nIndicatively, 2024 should be a good year for Ethereum and its cryptocurrency. Next year we can expect the halving of Bitcoin, which is usually the market’s best stimulus, and probably the SEC’s approval of the first crypto spot ETF tradable on US stock exchanges.\n\nIn addition, the Fed could also provide a positive boost to the price of Ethereum, with US interest rate forecasts signalling a high probability of quantitative tightening in favour of economic expansion with reduced debt costs.\n\nAll in all, the price of ETH is likely to exceed at least $3,000 next year. Several analysts agree that it will surpass its previous all-time high of $4,950.\n\nDespite this, ETH is still suffering in the pair against BTC and is down -25% since the beginning of the year.\n\nThis means that so far it has been cheaper to hold bitcoin than ethereum.\n\nIt will be interesting to see if this trend starts to reverse with the start of the new year, as it did during the last bull run in 2020."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQRWtFT0tSc3dvQ1NmVWREdDN0cnR1dHdoZG9leGQ0R3A4WkR2eWtrTllJOVh5aXdXVzU1WWNvejhGQTVOU2xwVHpjQ3JMQlpOckVBUkh5MV9zVnpodVdLRXlLclVmR3lsQzExZC0zQWNOUFl4M0tBMzlxTzk2MTlOSzkxeTRXaURLdzlMZFplNE4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Gold remains stable while volatility rocks Bitcoin and Ethereum’s 2023 - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxPVFJGS0pyRmlXRUdNcFF1cWk2c29hUmtoMThZQmVGMFF4Y2VOYUhnVVBYTEVsalY3bEg0dC16b3c4d0x1aEdybzFlbENKYlBDRk9KaGRsWkt1QVdLOWZVQkc2RFFKa3RZM0hsbUF6dkhHOFdPTXV5bVlCVkI4WTc1aTBEMHh1Q0hLS3N0YTQ4SlpFSU5ycWVENG5rbktpeEhZSGNfRWtLVnJCVm15dVo5WHFkUUZGT1F0MEpUQkd0ZmtnRW5kOUtEeTNiNW9odW1fUV9KUlNvT3cxSnfSAeABQVVfeXFMUHJsamtKWXRNaFhVOWZuNjlRYUNLWEwzVUNqaFdrc1BVR0x0cDJkamVGQTUzWUVjblgwdEhsOHRBSlNRSTQ0bElZNklDdExzdi1sLTdZeXJFMlFOMWNnNmdUT3lnUGNhZGh1Z1pzRXI2VU1hT0Zublg3MUNCZ0k0QmVyZHRjd0NjMGtEZFI4eEZ6MXM4eEloUllXdnhSVkx2VkxWR3lnaWN0aklKWkd1Y1VVSzNEcEE4R3lSUXJVLWpLM05YbHFfT29nZGNJdHJrU21zQWJaVHhXVEpKeDJPeE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Floki, Chainlink & Ethereum – American Wrap 6 November - FXStreet",
        "content": "Ethereum witnessed a spike in the holdings of large wallet investors in the network. Supply of the altcoin held by large addresses, as a percentage of the total supply has climbed consistently between May and November 2023.\n\nFLOKI, one of the largest meme coins in the crypto ecosystem, hit a key milestone early on Saturday. The token’s total value locked hit $54.4 million and catalyzed a price rally in the meme coin. FLOKI price climbed over the weekend, hitting $0.00003132 on Binance.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxNUFdOdEh1Rm95X2d1ZlZCV2NHa211Mi1wektkVVYwbURrWGdnRmZ6RFZEWXMwTmR1Q0I1enRLelpkVTRRYzM3MTU5SHgwMzlIUmlZbURXQmZUM0pwUjlMUkwtNmQwSHF1SzF3S3dGc1ZPWXVvZzFkWDNMb1BGRDB5Z0YtYVFsU3JqUkpJVUdrVV9Fend1Rk55Z016M09vVUxpNS1QVzFRMUIxakFPaTFUU0ZpUVByRlh4bUFsbWhRYVpPMFYxcjhEWDN2Vm9zcW8tdEFNSnVLM1VTVmFESmlTTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin below $35,000; Ethereum holds $1,900; Altcoins rally up to 6% - Business Today",
        "content": "Bitcoin and other crypto tokens continued their bullish momentum on Thursday as the oldest crypto asset hit a 17-month high after the Fed's dovish tone. Crypto tokens posted big gains following the completion of one year of Sam Bankman-Fried's crypto empire- FTX exchange.\n\nBitcoin was trading in red as the largest crypto token edged marginally lower, less than half-a-per cent but remained below 35,000-levels. However, its largest peer, Ethereum, was also seen in green, slightly up and hovered around $1,900-level. Majority of the altcoins were trading with decent gains.\n\nBitcoin kept on trading in a very narrow range of less than 2 per cent movement in the last 24 hours. It has now been close to two weeks. Although this means volumes in Bitcoin worldwide have started to slightly drop, any movement in its prices should mean the volumes are back in, said Shubham Hudda, Senior Manager at CoinSwitch Markets Desk.\n\n\"While BTC has been rising for a few weeks now, the ETH/BTC pair has seemed to find a little support around the 0.05 BTC per ETH mark. The little bounce back has helped other prominent altcoins as well to show some momentum on the upside price action,\" he said.\n\nOn the other hand, altcoin BLUR (+18.1%) has seen a positive price action in the last 24 hours. This could be as investors speculate it to be the world’s biggest NFT marketplace by trading volumes, especially after Opensea downsized by letting go of 50% of its staff recently\n\nBarring a few exceptions, all top crypto tokens were trading sharply higher on Tuesday. Chainlink was up 6 per cent, while Toncoin surged more than 5 per cent. Dogecoin and Polygon rose 4 per cent each, while Cardano and BNB added over 3 per cent each. Among the laggards, Tron was down a per cent.\n\nThe global cryptocurrency market cap was trading modestly higher, rising up to $1.33 trillion-mark, as it rose marginally in the last 24 hours. However, the total trading volumes increased more than 6 per cent to $40.46 billion.\n\nIn the last 24 hours, both BTC and ETH remained steady, while altcoins saw a rise of 5-10 per cent. This was accompanied by a decline in BTC dominance. Bitcoin is currently positioned between important support at $34,000 and resistance at $36,000, while Ethereum still has to clear a significant resistance level around $2,000, said CoinDCX Research Team.\n\n\"The market capitalization of altcoins, excluding Bitcoin and Ethereum, reached nearly $400 billion, marking a positive sign for the crypto space. It's worth noting that tomorrow, on November 8, 2023, Fed Chair Powell will deliver a speech, which could potentially introduce some market volatility,\" he said.\n\nImage: Crypto-chart-price\n\nTech View by WazirX Trade Desk\n\nThe Graph(GRT) is an indexing protocol, catering to data querying needs in networks such as Ethereum and IPFS. It plays a pivotal role in numerous applications within the DeFi sector and the larger Web3 ecosystem. Currently, GRT extends its support to the indexing of data from Ethereum, IPFS, and POA, with plans to include additional networks in the near future.\n\nImage: Chart-Graph\n\nOn the weekly time-frame, the GRT/USDT chart had been traversing within an ascending triangle pattern. The trend has bounced back from the bottom and is fast approaching the upper trendline with twice its average trading volumes. We could expect the momentum to continue into the coming weeks. The next resistance is expected at 0.17 USDT and an immediate support is expected at 0.12 USDT.\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQSXMtbHNrRDdVQTFCYXZVZ3JMUFF6S3pRb2hlX3dGb2RZbzRUb1R4T0tISk9zWGhYQVFrMloxQVBvUG8tY0JjVHZ0RmNtQmhUTXJVd0ZXOXV2WHZ5TnItTWpMemNMajNxdGVVclRaNkg0QXZ2V3dyLU5KajZ6ZTM5adIBhgFBVV95cUxPdWFIN0JCTFVZSUM3YVZpN0hqY1gxZ3pfU3NlbjdEbWQtOGpGVHlqX1pxcmlEd0I3Ynl5U1VJbzRqY01wQVJKaW9paTFWUFZQa28tMHdidHJIb3hneXc3YlBEaGpwOThKdTJ6bnBVU0dqZnE2M3hsQ0dNeTJhbGZYTF8zeHRhZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum break away from S&P 500, Gold - AMBCrypto News",
        "content": "S&P 500 trended above BTC and ETH briefly in the past week.\n\nBTC and ETH maintained their prices above $35,000 and $1,800.\n\nDuring the past week, cryptocurrencies such as Bitcoin [BTC] and Ethereum [ETH] moved independently of the S&P 500 and Gold. Has this trend persisted into the new week, or has there been a change?\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nS&P 500 trends above Bitcoin and Ethereum\n\nIn the past week, the S&P 500 experienced a significant increase, causing it to outperform Bitcoin and Ethereum. According to Santiment’s trend analysis, the S&P 500 gained over 6% in value within just four days.\n\n? The #SP500 had a big week after #Bitcoin & #Ethereum have cooled down. With the sectors now each having their 'time in the sun', this next week will indicate whether #crypto is still tied to #equities, or whether assets can prepare for a #bullrun. https://t.co/R9moWBoqCx pic.twitter.com/FNddr1T8PM — Santiment (@santimentfeed) November 4, 2023\n\nAs a result of this surge, stock prices surpassed the value of cryptocurrencies like BTC and ETH. It also seemed like these cryptocurrencies were stabilizing after a period of strong price growth.\n\nThe recent upswing in the S&P 500 could be attributed to the latest Federal Open Market Committee (FOMC) report. Notably, the report announced that the Federal Reserve would maintain its current interest rate for the second consecutive month.\n\nThis decision has sparked speculation that the Fed may have completed its interest rate hikes. Consequently, this led to a notable increase in stock prices observed during the past week.\n\nBTC and ETH prices catch up with stock prices\n\nAs per a trend chart analyzed by AMBCrypto, Bitcoin and Ethereum had moved ahead of the S&P 500 in terms of their price trends. Despite the stock market being closed for the weekend, BTC and ETH had surpassed their previous positions.\n\nIt remained uncertain whether stock prices will resume their upward trajectory when the market reopens, but cryptocurrency prices continued to rise during this period.\n\nBitcoin and Ethereum maintain uptrends\n\nOn 4 November, the daily timeframe chart indicated that Bitcoin had closed the trading session with a notable price increase of over 1%. At the time of writing, it was still trading with a slight price rise, exceeding $35,000.\n\nDespite occasional declines, Bitcoin managed to maintain its price within the $35,000 range. This was a key factor that contributed to its upward trend compared to the S&P 500.\n\nHow much are 1,10,100 ETHs worth today?\n\nIn addition, an examination of Ethereum’s daily timeframe chart revealed an even more impressive performance. As of press time, Ethereum was trading with a substantial price increase of over 2%, surpassing the $1,800 mark.\n\nThe chart also indicated that Ethereum had been consistently on an upward trend for several consecutive days."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPSUxPQlRPNEFCZGxpR1FOSVl1T0lIcm9mWWt1TmlPQVYxUU91TEEycWhlR1BRcFdkYUZRSWhDVU5id3l1YTBiR1RZMHVSby1XWHJFRWpYZWtnbGlvUkNKdmdrTWZCcFNScVdWY0xwTjY3NTA2cW9JbXo5aksxNjJjRkN4a3B3c2ZFbElnLTRjV281M0J0M3duSWhXN0dIczNnQnhiMHc2aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "DeFi Protocol Aave Pauses Multiple Markets After ‘Issue On A Certain Feature’ - Unchained",
        "content": "Aave V2 has paused its markets on Ethereum and frozen certain assets on Avalanche, Polygon, Arbitrum and Optimism after reports of an issue with a feature on the protocol.\n\nAave, a decentralized finance (DeFi) lending protocol, has paused its markets on multiple chains after a report of an issue with the protocol.\n\nIn an X update on Saturday, the Aave team said that its community of developers had validated a “report of an issue on a certain feature of the Aave protocol,” and the community-elected group of individuals called Aave Guardian had taken prevention measures to mitigate risks.\n\n– Pause the Aave V2 Ethereum Market\n\n– Pause certain assets on Aave V2 on Avalanche\n\n– Freeze certain assets on Aave V3 on Polygon, Arbitrum, Optimism — Aave Labs (@aave) November 4, 2023\n\nAave Guardian paused Aave V2 on Ethereum and paused certain assets on Avalanche, while freezing certain assets on Aave V3 on Polygon, Arbitrum and Optimism.\n\nDuring this pause, users will be able to manage existing positions and withdraw assets but won’t be able to initiate new positions, borrow or deposit funds.\n\nThe team noted that no funds were at risk and a governance proposal to restore the normal operations of the protocol will be submitted shortly, with a more detailed postmortem of the issue at hand to come.\n\n“Yesterday, on a Saturday morning, the Aave community received a report of a niche issue regarding the protocol. Within hours measures were taken to mitigate the risk, resolve a patch, review and deploy the first proposal. Incident management at the best,” wrote Aave founder Stani Kulechov in an X post.\n\nAccording to a post on Aave’s governance forum, the paused chains were identified as the targets of the attack vector. The team said it does not believe it would be appropriate to disclose details surrounding the reported vulnerability given that multiple forks of Aave have been created, but any efforts to exploit would be mitigated by disabling the stable rate borrowing mode.\n\n🚨🚨 🚨 On 11-04 17:38:35 UTC, Aave Guardian has taken necessary protection measurements to pause AaveV2 protocol (and all Aave pools are safe): https://t.co/3xJzfiejig Given the protocol is “forked” by multiple third parties and the exact details are not disclosed yet, it is… pic.twitter.com/OkO1EZv6pW — PeckShield Inc. (@peckshield) November 4, 2023\n\nAt the time of writing, Aave’s native token AAVE appeared to be unaffected by news of the vulnerability and was trading at around $89, down just 0.33% over the last 24 hours."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQc3JzeDh4eFoxZ0RaWnVoQVB6aDNtMnh5SnJvTmFkSXFKcnVfVkYzU19RX3NSblpYNnV2SElLMVVCZlRTZ3ZYdF9lMnNwcW96UlYwRHMxN3hFNWwzUDY1eXZ4UC02aVVCUGFsaXVZTjFwZEZ6bVNRb1R6d0xRcm5RQ3FCcUdrY1ktVFAzWUdOeFowaUViRURVcHg5MnBxdE1LNTBTcjVyODVQUE9MTFRqZ2xqYnlGR2tEemFQWnpoRFNSNS1GbHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bing Ventures Presents Ethereum 2030, Devconnect’s Premier Event #BingVentures - Media OutReach",
        "content": "Yajin (Andy) Zhou, CEO of Blocksec\n\nAzeem Khan, Head of Impact at Gitcoin\n\nJack He, Co-founder at Aspecta\n\nBertuğ Oymak, Co-Founder and CEO of Utilify\n\nDougie DeLuca, Investor at Figment Capital\n\nFatih Taşdemir, Co-Founder of Koin Bülteni\n\nVolkan KORKMAZ, CEO and Co-Founder at Altcointurk\n\nLuca (Moss) Mossini, BD at Avantgarde & Enzyme Finance\n\nSeraphim Czecker, Head of Taking Risk\n\nVaruni Trivedi, Editor in Chief at Voice of Crypto\n\nAnıl Öz, Chief Technology Officer at DATS Project\n\nArif Kalem, Brand Ambassador of Turkey at BingX\n\nÖzge ERDEMİR, Web3 Advisor, Business Developer\n\nSima Baktas, Web3 Attorney at GlobalB Law / Co-Founder of CryptoFemale\n\nDaria Krasnova, Managing Editor at BeInCrypto\n\nThe issuer is solely responsible for the content of this announcement."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNR3FzcDgwTTJ6cUJkejBxalYzNlAzQktydzE0eFJtdFNwa0VTb3dGRmdWSkwxVkRraVd1S1JCZlZfTjdFM3RUYjVrZmpLOVg0NktWNVkzQU8wVGlHbkNZem9oSHo2Z0FYRDV0OURfYTgxd2poRlBCcFRvRHk4Qm0yTlJkamlHem9uNms0YTktRS1fRl8yX3ctLUhZa3NlZkN5VWprTUhONNIBrAFBVV95cUxQamQweXFod0RfWldMNHZ5TTFnYXduaC1SM3FjamdoaVQwS1h3enhncmRITS1mLWtvWC13MHhqTEk4RDhBcEFLcDZlSXktOWpSWGttTjdRU3hXckNDSFVCa0lHTFFDeW9adFNuTHVMWkJZNmk3N21iY25YR1hnVWJUWEIzUnZwUHh6WXpaVEdWbmZZZmNOV0hLdkxNTWZNLW5xcU1JQVlGY1VTLWhZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Aave Reacts to Ethereum Issue: V2 Operations Halted, Asset Frozen on V3 - Crypto News Flash",
        "content": "Decentralized Finance platform Aave shared on its website that it has halted V2 operations after receiving reports of vulnerabilities in certain features.\n\nCertain assets on Aave V2 on Avalanche, and some on Aave V3 on Polygon, Arbitrum, and Optimism have been frozen.\n\nDecentralized Finance (DeFi) protocol Aave announced on November 4 that a report was received on the Aave bug bounty program concerning a vulnerability that affects the Aave v2 operations. Interestingly, the company has not yet disclosed much detail surrounding the vulnerability. For now, it is reported that the vulnerability was not exploited. It was simply a bug report and temporal actions were taken to seal the loophole.\n\nToday we received a report of an issue on a certain feature of the Aave Protocol. After validation by community developers, the guardian has taken the following temporary prevention measure (no funds are at risk).\n\nMore on the Report\n\nThe brief announcement discloses that there was coordination with the Aave Guardian, after which it was agreed that protection measures be taken to stop the attack vector. As a result of this, its V2 Ethereum Market has been halted. In addition, certain assets on its V2 on Avalanche have been paused. In addition, certain assets on Aave V3 on the likes of Polygon, Arbitrum, and Optimism have been frozen. It is also important to note that the unaffected markets include the Aave V3 markets on Ethereum, Base, and Metis, as well as the V2 markets on Polygon and Avalanche. This implies that no funds are currently at risk on any of the markets according to the announcement. For now, a governance proposal will be submitted shortly to ensure that the issue is resolved, and operations are back to normal.\n\nA governance proposal to restore the normal operation of the protocols will be submitted shortly. A detailed postmortem will be released once the issue is fully resolved.\n\nThe team has further clarified that users who are either supplying or borrowing from frozen assets can go on to withdraw or repay positions. However, until the issue is resolved, they cannot supply and borrow more.\n\nPrevious Attack on Aave and Yearn Finance\n\nIn April, PeckShield reported that hackers had attacked Aave and Yearn finance and stolen $10 million. On top of that, cryptos including BUSD, USDC, TUSD, USDT, and DAI were retrieved. Aave was strongly subjected to criticism as some users threatened to remove funds from the platform. Founder Marc Zeller quickly observed how the attack was concentrated on Version 1 of the protocol. It was reported that the attackers were more focused on breaking into old protocols. Yearn Finance appeared to be one of the victims.\n\nWe are aware of an issue that seems isolated to the iearn legacy protocol launched in 2020 and the liquidity pool. Yearn v2 vaults seem not to be impacted. Yearn contributors are investigating.\n\nIn a single weekend in July, a total of $70 million was reported to have been stolen from various DeFi platforms including Curve Finance. Platforms affected also included lending protocol Alchemix, yield platform Pendle, and synthetic asset tool Metronome.\n\nRegardless of the current development, the Aave token is up by 7 percent in the last seven days, and 0.63 percent in the last 24 hours. The asset is currently trading at $91.34.\n\nRecommended for you:"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPcGRiOFZITF9rX3lYazVadGlTVkV6eEtZT25sUGptTnptSW02Skw1T1VfQ05jLV9pc3lBWHhsWEhFRW5yS3RtUFJtVWQyZDZaQ0xORzBQNEJycGE3bmFrOXdFSDFJblUtZ2RMMDhCdjRxX242c0hZZE8xYnB0RW82cUdnTXV6THNmWWVqSHptcDVfWFFMYTlN0gGcAUFVX3lxTE5ac2g0MU5CMGNvcTNRU0IyMEpsekhxdUZ0ZXh4R2dIN2Zxam41eThDSnY3TlQ1eXFwZjZnaWlWUlhoWkg0NTRHTWZUTTZseWVMTXBuTGtvT2ZjdU54TS1aeFlVUW5SS041SjdNQ01RS1FPQUczOWw4RHdDNkUwV0VIX1RfWTZOcGgzVWlKdHhsR2M5d25feWpWWWlpUg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Can LHV Bank’s Founder Regain Access to His $470 Million ETH Fortune? - CryptoPotato",
        "content": "In a recent revelation, a dormant Ethereum wallet holding $470 million worth of ETH has been linked to Rain Lõhmus, the founder of Estonia-based LHV Bank.\n\nHowever, Lõhmus has lost the private keys to this wallet, and he’s now seeking the help of the crypto community to regain access.\n\nLHV Bank Founder Rain Lõhmus Identified As Wallet Owner\n\nThe story began in February when Coinbase director Conor Grogan first drew attention to an Ethereum wallet that had remained untouched since the blockchain’s inception in 2014. This wallet contained 250,000 ETH, a sum that, at the time of writing, exceeds $470 million in value.\n\nFast forward to November 6, and Coinbase director Conor Grogan provided an update, officially linking the wallet address, 0x2B6…0Ffb9, to Rain Lõhmus. This connection was established based on an article by ERR News in which Lõhmus openly admitted that he had lost the password to the wallet.\n\nOne mystery solved: This address (which now holds $450M of crypto) belongs to Rain Lohmus, founder of LHV Bank Unfortunately he lost his keys and can’t access these 100s of millions. If you can help him recover them somehow, he’s willing to split them with you https://t.co/wYLAU9gKzb pic.twitter.com/0A1nIjFSyn — Conor (@jconorgrogan) November 6, 2023\n\nGrogan, through a post on X, shared this revelation with the crypto community, stating, “One mystery solved.” This address, which now holds $450M of crypto, belongs to Rain Lõhmus, founder of LHV Bank. Unfortunately, he misplaced his private keys and could not access the substantial sum.\n\nAccording to the ERR News report, Lõhmus acknowledged owning a wallet containing 250,000 ETH, but he hadn’t put much effort into recovering it. In the interview, Lõhmus expressed his willingness to entertain offers from individuals who could help him regain access to his lost crypto fortune.\n\nThe Dormant Ethereum Wallet\n\nAs Grogan highlighted in a previous post on February 26, 2023, the 0x2B6…0Ffb9 address had held Lõhmus’ investments since the early days of Ethereum without a single transaction. During Ethereum’s ICO days, Lõhmus invested around $75,000, growing more than 5,000 times in value. Additionally, he received nearly $6.5 million worth of altcoins through airdrops.\n\nOne of the most mysterious addresses in all of crypto:\n\n-Bought $75k worth of ETH at the ICO in ’14\n\n-Completely untouched wallet; has never made a single transaction\n\n-Wallet now worth $400M+, a 5333x\n\n-Received $6.5M in airdrops just by hodling (a 87x on initial investment alone) pic.twitter.com/wBpw9pQcAB — Conor (@jconorgrogan) February 26, 2023\n\nAt the peak of Ether’s value on November 10, 2021, which reached nearly $4,900, Lõhmus’s stash was valued at $1.22 billion. Even today, Lõhmus’s wallet boasts a gain of 628,757%. According to Etherscan data, his wallet stands among the top 25 accounts in terms of ETH balance.\n\nFounded in 1999, LHV Bank is a subsidiary of AS LHV Group, a publicly listed company on the Nasdaq Tallinn Stock Exchange. The bank is currently the third-largest financial institution in Estonia, further highlighting Lõhmus’s significant presence in the financial world."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQWlZHTkt1R1NNVTFPaXBuNXVVMTdPbUNTcjZVTTZjUEhacl9nTDItY01CWVBBdTRLaFF3YlY3RGtyQ1cxaFJlX3AtY3NWZTVVWGNsaGtybjFzQkFDSEFzNHFjemhnYjd5RWVIZHdKX1VtYlJkbGxJcndTLWF2cWcxMzRoZXFMMFNSRXA0N0pwLXFDSE83ZWgxQkJPSm4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "LHV founder Rain Lõhmus’ gains and loses $474m from Ethereum wallet - Leaprate Forex Trading News",
        "content": "On Tuesday, Connor Grogan, Coinbase director and digital detective, discovered a $474m Ethereum treasure chest belonging to Estonia’s LHV bank founder, Rain Lõhmus’. Grogan announced the discovery on X (formerly Twitter), detailing Lõhmus’ willingness to split the wealth with whoever can find his keys to unlock the hoard.\n\nThe account, which was originally filled with ETH, purchased during Ethereum’s Initial Coin Offering in 2014, first registered at $75,000. Now sitting at $474m, Lõhmus’ lost wallet represents an investment that has grown approximately 6,300 times. However, without a key, Lõhmus unfortunately cannot retrieve this astronomical wealth.\n\nIn today’s session, Ethereum sits at $1,906.80, ETH/USD. Despite the current standings, Ether’s 17% return falls short compared to Bitcoin’s substantial 27% gain over the last 30 days. Not only does this create uncertainty with regard to Consensys, a private blockchain company and key play in Ethereum’s virtual ecosystem, but it also reiterates the distrust investors and former employees feel toward Ethereum and Consensys.\n\nDon’t miss out the latest news, subscribe to LeapRate’s newsletter\n\nAccording to 27 shareholders of Consensys AG, co-founder Joseph Lubin stripped the Swiss company and its shareholders of major assets, thus violating a no-dilution promise he had previously made in 2015. With the help of JPMorgan, Lubin allegedly transferred core assets to a US entity, stripping its Swiss shareholders of assets and equity. Lubin is a co-founder of the Ethereum blockchain."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFAxRXpnSzI5TW5Ga0p0WVJWaE5DdkFSYXFqRlMtWHVCNE9QMUNVeUQ1Q1o2amFyTWh4dF85bzNqYnphcmxqTEdYSktmZHVxRW5JdDh2WGtabGZVVEQyUTBPdHYxaEhOOUQ5WXo0MzB0cWlQcXNIQVdhbGFB0gF_QVVfeXFMTU81em1BMjFJYk5nWFNwSko4NWxua3ltQW1feV9ja3BWSUpRNmNlQ3BDTEdybHBPeUhNQ29EVGs3ZWN6TEFkQXJQTlVSV21ITmJVMXVPN0ZnQ1BDNTl5M1FOdnZmX0ZKTTlXZzhCZlhsWnYxR1dqZ2Nac3hIZlV5OA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 13:01:38 GMT",
        "title": "Did Ethereum Founder Vitalik Buterin Short Ethereum? Unraveling A 70,000 ETH Sale - NewsBTC",
        "content": "A video has surfaced on social media where Ethereum founder Vitalik Buterin revealed he sold 70,000 ETH tokens during its price all-time high.\n\nButerin Acknowledges Shorting Ethereum\n\nCrypto community member, MetaMan X, published a video post on X (formerly Twitter), disclosing a conversation where Ethereum Founder, Vitalik Buterin admitted that he had sold about 70,000 ETH tokens, essentially shorting the cryptocurrency during a major all-time high.\n\nRelated Reading\n\nIn the podcast with American hedge fund director, Eric Ross Weinstein, Buterin spoke on the price of Ethereum and Bitcoin in 2017. During Ethereum’s previous all-time high in 2017, when the price of ETH rose as high as $1,600 and Bitcoin’s price was up $20,000, Buterin voiced doubts about whether the significant price surge truly aligned with the crypto market’s modest achievements over the years.\n\n“The crypto space has reached half a trillion dollars, does it deserve it?” Buterin stated.\n\nWhen asked if he had shorted Ethereum during the all-time high, Buterin stated that he had convinced the Ethereum Foundation to sell a considerable amount of ETH tokens, and the result of the decision made a huge impact on the cryptocurrency later.\n\n“I did get the Ethereum Foundation to sell 70,000 ETH like basically at the top, and that’s doubled our runway now, so it was one good decision that had a lot of impact,” Buterin said.\n\nETH price at $1,886 | Source: ETHUSD on Tradingview.com\n\nCommunity Worries Over Buterin’s ETH Sell-Offs\n\nMany crypto community members have raised concerns about the multiple ETH transactions said to be conducted by Ethereum’s founder. Recently, Buterin was spotted making a transfer of 100 ETH, worth about $181,000 to Coinbase, one of the world’s largest crypto exchanges.\n\nThe motive behind the transaction has sparked curiosity among Ethereum investors and the crypto community. Earlier in August, Buterin was also reported moving 600 ETH worth $1 million to Coinbase.\n\nRelated Reading\n\nBitcoin And Ethereum: Crypto Pundit Says Expect A Repeat Of Massive 2019 Rally 10 months ago\n\nHowever, the Ethereum Founder had publicly clarified in October that he had not sold any ETH tokens for personal gain since 2018. He also stated that most ETH transactions were not him selling, but rather the recipients of his charitable donations selling the ETH tokens.\n\nThe founder has also been caught in controversy over the weekend when Ethereum whistleblower Steven Nerayoff alleged that Buterin was involved in some sort of fraud involving ETH.\n\nNerayoff says Ethereum is linked to corrupt SEC officials to carry out this fraud which he says is on a larger scale than what happened with FTX. For reference, FTX founder Sam Bankman-Fried has been found guilty of fraud charges after the exchange filed for bankruptcy in 2022 with a $9 billion hold in its balance sheet.\n\nFeatured image from Crypto News, chart from Tradingview.com"
    }
]