[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE8wZ0ZHYzM4VGdtZlVoOUVQY0lvaW1MaGNiR2E3RG5jbkozU2FVOWxQYWVtMHZ0dmt5cG9BVDQ0cW9CN3p1SnRKUk4zY3J3UndUMThmcmZoWDkxUXZCX010c0drcFQyNFY5M2F1UkpINXNhdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 17:14:10 GMT",
        "title": "Nocturne brings private accounts to Ethereum - Blockworks",
        "content": "Nocturne, a protocol that enables private accounts on Ethereum, has launched its first version on mainnet.\n\nThe protocol is designed so that users are able to deposit or receive funds privately on what Vitalik Buterin calls stealth addresses.\n\nThis means that users can generate a secret spending and viewing key, which can then be used to create multiple meta-addresses that can be used to interact with other accounts.\n\nThese addresses are held within Nocturne smart contracts and are intended to be used to trade what the company refers to as ‘hot assets,’ or crypto assets that are not designed to be held.\n\nAccording to Nocturne, its smart accounts will be compatible with DeFi protocols that “represent state via output tokens.” This means that it will only be compatible with tokens that are made valuable from a previous input — or tokens where a user must deposit collateral in order to mint the token.\n\nSuch tokens could include Uniswap liquidity tokens, Aave’s aTokens, and Compound’s cTokens.\n\nThere are plans to later extend smart account compatibility to arbitrary protocols with the help of zero-knowledge technology, which can prove ownership of assets without revealing the details of the assets owned themselves, Nocturne notes.\n\nLuke Tchang, CEO and co-founder of Nocturne, noted in a press release reviewed by Blockworks that the company is moving away from simply being a ‘privacy tool.’\n\n“Privacy should be embedded at the account layer and the v1 launch is the first step in making this possible,” Tchang said. “Our goal is to ensure that everyone, from individual users to large institutions, can transact securely without exposing their financial history to the world.”\n\nUsers who wish to access Nocturne v1 can do so through a private vault user interface. The current capabilities of the interface are limited to deposits, transfer of tokens to burner addresses, and private swapping and staking, the company said.\n\nFuture versions of the protocol include the migration of a ‘proof-of-innocence’ protocol that can prove transactions are verified without revealing any information about the user’s identity and further usability and functionality of Nocturne wallets by enabling compatibility with arbitrary smart contracts.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5tZTRCdm5hZDNoMU5TZDVEU1dHdy1yQWJyVndmMkMwRjM3Q2RKMUNpQVIzaTRrMWgwanpMSTdqLUduVDNEcHhjNHo2eVJGbGN5bm0yejZCd1lqOUN3Ni1RUkF2TUJpaWh0SDlQNEZCQlNpeGJlQ1V6Vw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction - Forecast for 2021, 2022, 2025 & 2030 - Forex Crunch",
        "content": "Ethereum Price Prediction\n\nThe price of Ethereum has seen huge boosts over the last couple of years. Just one year ago, one Ethereum was worth less than $400. Today, Ethereum has a market value of over $2,500, even crossing the $4,000 mark only a few months ago. And the trend is that the Ethereum stock price will continue to rise on average.\n\nThis article focuses on our Ethereum price prediction. We arrived at reliable conclusions through a study of the history of Ethereum’s price over the years, a fundamental analysis of its price trajectory, and a collation of expert opinions.\n\nOur Ethereum forecast looks into the future to help investors make smart investment decisions. By looking at the Ethereum price chart, we are able to determine the price of Ethereum within the coming decade.\n\nEthereum Price Prediction 2021\n\nBitcoin may be the godfather of cryptocurrencies, but Ethereum is that young prodigy who has high potentials of outdoing and outclassing its master. So much is the faith experts have in Ethereum that Billy Bambrough, a senior contributor on crypto and blockchain at Forbes, believes that “Bitcoin Could Be Left In The Dust By Ethereum In 2021″\u009d.\n\nThe price of Ethereum currently sits at just over $2,400 per Ether. This is a little over half of Ethereum’s highest ever price. The recent bear market saw prices crash all across the cryptocurrency market, and Ethereum was no exception. However, Ethereum has been recovering steadily over the last two weeks and prices are looking up once again.\n\nWith these points in mind, found below are our Ethereum forecasts for a variety of upcoming timeframes:\n\nOne Month – The past few days have seen Ethereum consolidate after a bullish push. Once this area has been surpassed, expect to see Ethereum head towards the $4000 level over the next month.\n\n– The past few days have seen Ethereum consolidate after a bullish push. Once this area has been surpassed, expect to see Ethereum head towards the $4000 level over the next month. Three Months – It’s likely that Ethereum will head towards May’s highs over the next three months, which could prove to be a solid resistance level. We predict that these levels will be broken, seeing Ethereum head towards the $4800 level.\n\n– It’s likely that Ethereum will head towards May’s highs over the next three months, which could prove to be a solid resistance level. We predict that these levels will be broken, seeing Ethereum head towards the $4800 level. Start of 2022 – As this will be new territory for Ethereum, the sky is really the limit for this crypto. We believe that a valuation of $5000 per coin is likely by the beginning of 2022, providing a solid base for further momentum.\n\nEthereum Price History – the Story of 2021 So Far\n\nEthereum started the year with a modest price tag of $770 on January 1, 2021. By the end of January 2021, the price of Ethereum had nearly doubled and was at $1,400. This was great for investors, and despite occasional dips, the price of Ethereum continued to rise on aggregate.\n\nSometime around the middle of February, Ethereum reached an all-time high value of nearly $2,000. One week later, it dropped to around $1,500. On April 1, Ethereum finally broke the $2,000 mark, starting the day on a price tag of $2,100.\n\nThe price of Ethereum continued to experience a steady rise for most of April. By the middle of April, Ethereum had reached another milestone. On April 1, two weeks after breaking past $2,000 for the first time, Ethereum broke past $2,500. This set a new ATH.\n\nEthereum first broke past the $3,000 threshold on May 2, 2021. This was during the last bull run that saw prices soar all across the cryptocurrency market. Ethereum went as high as $4,000 per coin during this same period and reached an all-time high of over $4,300 on May 12, 2021. The onset of the bear market brought the price of Ethereum crashing down.\n\nHowever, the market has been recovering lately, as has the price of Ethereum. This keeps us optimistic that our $3,000 Ethereum forecast is most likely to become a reality. And this is most likely going to happen before the end of August.\n\nEthereum Price Forecast\n\nTaking a look at the growth trajectory of Ethereum so far in 2021, it is not hard to see why we envision sustained increments in the price of Ethereum. The current Ethereum price is only a shadow of its price peaks, meaning Ethereum can become much more valuable with time.\n\nMany experts share this sentiment. Billy Bambrough of Forbes believes that Ethereum will someday become more valuable than Bitcoin. This might seem far-fetched to the casual observer, but many experts believe this to be a possibility.\n\nAccording to a Finder panel, Ethereum will end the year as a better investment than Bitcoin. Returns on investment in Ethereum are expected to exceed those on Bitcoin by 35% in 2021. This panel predicts the price of Ethereum to hover around $17,000 by the end of 2021.\n\nWe are inclined to agree with the panel’s optimism, although our research and analysis predicts that Ethereum will be valued at around $5000 by the end of 2021. It’s unlikely that Ethereum will not experience some struggles over the upcoming months, as rumours surrounding crypto regulation and taxation begin to heat up.\n\nHowever, the signs do seem to point towards some great gains for Ethereum over the next year. The uptake of Ethereum’s technology over 2022 could see the coin push past the $5000 level and head higher. Furthermore, as more companies adopt smart contracts and utilise Ethereum’s platform, the valuation will increase more – and our analysis leads us to believe that Ethereum could be valued at over $8000 by the end of 2022.\n\nEthereum Price Prediction Long Term Outlook\n\nWe expect Ethereum to break through the $4,000 threshold again within the next three months. A $5,000 Ether price tag is also very realistic within this period. The end of the year often sees a rise in general cryptocurrency prices and this year will be no different.\n\nEthereum remains Bitcoin’s closest competitor in the cryptocurrency market. The Ethereum blockchain utility token offers value that even Bitcoin doesn’t. For example, the Ethereum blockchain is an open-source platform, as opposed to the bitcoin blockchain. The implication of this is its benefit for developers.\n\nDevelopers can deploy immutable and permanent decentralised applications on the Ethereum blockchain. Users can also interact with these applications. This means applications like games and NFT marketplaces can be programmed on the Ethereum blockchain. Combine these with the fact that Ethereum also has smart contract functionality and you can see why a $5,000 price for Ethereum is well within reach in the next three months.\n\nLet us visualize further in the future and discuss Ethereum price estimates for 2022. As is to be expected, every year sees its fair share of bull and bear runs. The coming year will not be an exception. While the price of Ethereum in 2022 will see inevitable ups and downs, there will be an aggregate increase in value. We predict unprecedented growth in the value of Ethereum in 2022. There are two reasons for this.\n\nGas Fees and Blockchain Transition\n\nFirst is the increasing popularity of cryptocurrencies in general. The last year has seen a surge in both the number of cryptocurrencies on the market and the value of most of these cryptocurrencies. Some cryptocurrencies have experienced double, triple, and even quadruple-digit growth in market value.\n\nThe second and more important reason for the unprecedented growth we foresee in Ethereum’s market value is the coming of Ethereum 2.0. Because of the high gas fees that currently plague the Ethereum network, Ethereum’s founders are working hard to release a new version of Ethereum. This version is set to be released in 2022.\n\nEthereum 2.0 will mark the transition of the Ethereum blockchain from a Proof of Work mechanism to a Proof of Stake mechanism. This means significantly lesser gas fees, more token utility, and invariably, a surge in Ethereum’s market value.\n\nCombining the above points, our Ethereum price prediction 2025 puts the crypto’s value at $15,000. The next four years should see Ethereum’s platform rise in popularity, as the use case for this cryptocurrency is much stronger than others. If more entities adopt Ethereum, there’s every reason to believe this valuation could be met.\n\nLooking further into the future, our Ethereum price prediction 2030 has Ethereum’s value reaching the $50,000 mark. Numerous analysts predict even higher values than this, although we are erring on the side of caution as nobody knows the outcome of the rumoured taxation laws. What we can be sure of is that Ethereum’s price looks set to showcase some serious bullish momentum over the next five to ten years – and beyond!\n\nEthereum Price Chart\n\nEthereum has experienced price swings like every other cryptocurrency in the market. However, unlike many other cryptocurrencies, Ethereum has been able to guarantee investors and speculators an aggregate growth in value, and a proof of it could be if we put a context of an Ethereum 5-year forecast as well.\n\nThe chart below reflects Ethereum price live. This price chart details the movement of Ethereum’s market value over the last year.\n\nEthereum price chart | Image source: CoinCodex\n\nConclusion\n\nAs you may already know, Ethereum has emerged as one of the world’s most profitable cryptocurrencies. It is also arguably the most commercially successful cryptocurrency of the year so far.\n\nWith its price currently sitting at around $2500, Ethereum has managed to gain almost a 300% increase in its market value in less than 8 months. This is laudable, considering that this year brought one of crypto’s worst bear markets.\n\nExperts forecast has shown a progressive increase in the price of Ethereum for the rest of the year, following its recovering pace after a bear run which saw a huge price crash across every cryptocurrency market. Ethereum’s growth will be further bolstered in 2022 when Ethereum 2.0 is released. There is no denying that Ethereum can only get bigger from this point.\n\nFAQs"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBsa29EWG1CUHJiZmtvWW9naVJHNExBWXlXV25XR1ZWc1lvVHgxTlR3VXF4U1NsM2hZN1hRRnB4bWhBaEpMdjJONHJlcEFjbUZHcW1XVXhteHU4NXBuM1ljS0JKU0JQSDBRd1g0ZDhhdFhsT0RpdHNJ0gF_QVVfeXFMTnBtaUdvTjJvcktUcnVwSE00bEx5RGdNVGxIVUxSMTlUMzB5ZEdUX1ZWTTk1SEFZZ2ZEcTR3MlJBYVpZeGJLaVdQNDF3cUUzeHJ5TGd4T0wzU0x1ZXRRVDQySFYyU2RaOFVLWHRhdmxUYlJSWEIzZHJrSjBzTFZZYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "DOGE Go Up: Ethereum and Solana Hit Hard By Sell-Off—But Dogecoin Makes Gains - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe crypto market took a hit Friday morning Eastern Time, with all major digital assets except for Dogecoin (DOGE) down significantly. Ethereum (ETF), XRP, and Solana (SOL) have all seen significant losses in the past day.\n\nAt the time of writing, the original meme coin was trading for $0.08, a 4% increase over the past 24-hour period. And over the week, the asset, which was once Elon Musk's favorite cryptocurrency, has gained more than 10% in value, according to CoinGecko.\n\nIn the past day, $2.7 billion worth of DOGE has changed hands. The only times the meme coin's volume has been higher in 2023 were around the time that Musk changed the Twitter logo to a Shiba Inu in April and a Dogecoin developer teased at a new development in February.\n\nAs of 9.30am ET, it the best-performing top digital currency, CoinGecko data shows.\n\nAD\n\nAD\n\nElsewhere, though, major assets were hit by a sell-off. ETH lost its $2,000 per coin level it hit last week. As of this writing, it has shed more than 4% of its value and was trading for $1,941.\n\nBitcoin, the biggest digital asset by market cap, was still trading above $36,000—only slightly—but had taken a 2% 24-hour hit.\n\nIn the past day, Bitcoin's dominance slid slightly to 51%, impacting overall market sentiment​​. Stablecoins dominated the trading volume in the past 24 hours, accounting for 89% of the total crypto market's trading volume​​.\n\nAnd SOL, which had been on a big run, was down over 9%, trading hands for $56.82 per coin.\n\nAD\n\nAD\n\nXRP was also a big loser—having lost over 5% in the past day, the asset was trading for $0.59 Friday morning.\n\nAnd Avalanche (AVAX), which yesterday surged on news that banking giant J.P. Morgan used the blockchain to tokenize portfolios, lost more than 10% of its value. It was trading for $20.97 by the time this story was published.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNSEY0RTNJMFJFV0I1bkxLcVFKVnBLWm01RnptSDljV3pQTExjbkVIUlVGZUlpMjBEc3oxWWJlN1h1aXI0Rm9jUGNoc05CTzlwVHg5aGUzQVRLWm9RV3NJNHZoWk9ZUXl1bnh1bWtITUVKUmEzLTFqRGMySXgxNEVURlN0Qjd0N1VoQm1Ya1BzWVU2SndBU0c1NlRaTVE2TWJ6amFjbUgwYW5SS2dzdGlhMjlyZGhpQ1ZfaF80ZFBpUlpQLTFsSzgw0gHMAUFVX3lxTE5jVmRQQncyOTZJc3NtZXdRR1Zrcm80a21oZjVmV2pjc04yYVZWYVVkZmNqTHhWQm9PbE5BWHpYX0lfU2R1c2dGdi1uV2tncUpNejFYU3YzcnNlVWJJZk51VUxtNDJLSEJtUVphUWF6N0VGTmNpT2Zpc2NSaFFEUVRLRG91WmJqeHVaQXk5RFdWdGpIb25VeDNETEozejg4TE0yRG9GR3lIQU44S29CSkdTaFNwYmRBaE5Ldjg4WTZNWHBEdGlXUHhuWmF3Ug?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Fidelity Wants to Create an Ether ETF, Joining BlackRock in Doubling Down on Crypto - CoinDesk",
        "content": "Fidelity Wants to Create an Ether ETF, Joining BlackRock in Doubling Down on Crypto\n\nFidelity, BlackRock and other financial firms want to list BTC and ETH ETFs, which could make it easier for investors to invest in crypto.\n\nBy Nick Baker Nov 17, 2023 at 10:46 p.m. UTC\n\nElection 2024 coverage presented by Stand with crypto"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOdHY4aHlHeld6ZmFUeTVVWF9SSnI2S0NPMENvVUlHR0NvdlZNWHdzMDNzcFNENmlEcnRpdUFqY1k0TEh5cmNncHJ2YkV3NEFkWU01X052d0I5SVFCbFg1dlYtNkU0dDdISkMyREdBTWVsLTRGTnFfeXQ2cmJOanJibm96RkJBOFJqR0tQMFBmNi13YWpyUm9IeXdxbV83Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Donate Bitcoin and other Cryptocurrencies - Save the Children",
        "content": "Charity donations: How much cryptocurrency have we raised so far?\n\nHelp us reach our donation goal this holiday season and join our donation leaderboard for Save the Children's HODL Hope Campaign.\n\nSave the Children’s crypto philanthropy journey\n\nSave the Children was the first iNGO (international Non-Governmental Organization) to accept a bitcoin donation in 2013 in response to Typhoon Haiyan which struck Southeast Asia and devastated the Philippines.\n\nAround the world children are being robbed of their futures by a global economy built on inequality and greed. With your continued support, Save the Children believes that blockchain technology and cryptocurrencies can be a force for good and a force for financial inclusion.\n\nWhich cryptocurrencies do Save the Children accept?\n\nSave the Children’s crypto fundraising is powered by The Giving Block and our crypto wallet custodian, Gemini*. We can accept any cryptocurrency currently available on the Gemini Exchange.\n\nWe accept multiple cryptocurrencies, including but not limited to: Bitcoin (BTC), Ethereum (ETH) and USDC. For the latest list of cryptocurrencies, we accept*, please visit our crypto donation page.\n\n*Gemini regularly adds new cryptocurrencies to their platform for trading.\n\nYour crypto donation could be matched!\n\nThere are various automatic crypto matches running for donations to Save the Children. Please visit The Giving Block for the latest information. Please note that Save the Children receives matches only for donations made directly to us.\n\nDonating a cryptocurrency that is not available on our wallet?\n\nYou can also donate Cardano (ADA), Algorand (ALGO), Cosmos (ATOMA), Polkadot (DOT), Flow (FLOW), Solana (SOL), Tether (USDT), and or Stella (XLM) to Save the Children.\n\nDonating NFTs?\n\nWe accept the proceeds from an NFT sale once converted to a cryptocurrency such as ETH.\n\nFor an NFT or other smart contract, you can dynamically generate a unique, static, reusable wallet address for Save the Children with these simple steps:\n\nStep 1: Input a comment in the “Donation notes” field (optional)\n\nStep 2: Select the crypto type\n\nStep 3: Click the CONTINUE button\n\nStep 4: Add your email and/or contact information (optional if you would like an email confirmation)\n\nStep 5: Click the CONTINUE button\n\nStep 6: Copy and paste the dynamic address or QR code that is generated.\n\nWhat is #CryptoGivingTuesday?\n\n#CryptoGivingTuesday is the unofficial start of #BagSeason, the holiday giving season for the crypto community. It takes place annually on the Tuesday after the Thanksgiving holiday.\n\nWhat is #NFTuesday?\n\n#NFTuesday brings together NFT marketplaces, artists, galleries and projects to bring visibility and raise funds for important causes.\n\nIs my cryptocurrency charitable donation tax deductible?\n\nYes, your cryptocurrency donation is tax deductible*. Save the Children offers supporters who want to donate cryptocurrency to charity the ability to donate in a tax-efficient way. The IRS classifies cryptocurrency donations as property, meaning they are not subject to capital gains tax and are tax-deductible. Your contribution is tax-deductible to the fullest extent permitted by law.\n\nFor example, for donors in the United States, the IRS has classified bitcoin as property for tax purposes. This means that when someone donates bitcoin and other cryptocurrencies to a 501(c)(3) nonprofit such as Save the Children, donors do not have to pay capital gains tax and it is tax-deductible if you provide your email address.\n\n*Subject to change. Please consult your tax advisor.\n\nCan I donate anonymously?\n\nYes, you can donate anonymously. However, you will not receive a tax receipt unless you provide your email address."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi9gFBVV95cUxOSTBfX1ZwWTdYdjVyYU5XNEdOVGEweGl6c0Z3bm5pdWFlVVFybENqVEgzeGVnSVhhLVd5SzhZT0VRSWRDengtWXAyX3lQZjc4WEp2V1FsZ0R6Q0NZVDFlZjdvb0h4dXg2amgxa2tqZjM5TUFJUWpCUU1IbC1LVXhZWE5fVEg1ZmRsR3RMYkFxT3pUbl9rdnNmYUVLMG40N3VLTThseDhHbmVtajhDaldBRUsxandZc2NmOWJYdVBtUHRYV3JxYXBxWFVubi05RzJLdmtCcmZPblhRR19RWjY3dG1ubnJIZ2ZnVEgwdlZ2S2ZSLWV4SEHSAfsBQVVfeXFMUGdCTXdYRC0temNCei1iY3hHM1B6MVJldjNzZWc5ZHlVc0stLWxBcENGZ0tncFJtMFdsNnNBNHlkQWhMTTY1ZENuaHc0RnBmNXpiUFNMU0dOblVWak9YQW5vWTZPZEg5QkVMdVUwVHZNMlZPXzBwMzR4amhxSHhyT25neTRJX0g4dlZDOFhxcGU3VHh1TXU0azhfc0hHeEpDVUc4bFZOUktnYkNwNjdqWm90YXpkMG1HNnVwSm5DVGlzTWRlR19oV21iSTJ3c21LbDZkcldDN0xjUFVDRjFWWmhJcWVGMGs4VEs2OXg4UE85T1UxWUl3M2hHQnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC stagnates sub-$36,500 as SEC’s eight-day window closes - FXStreet",
        "content": "Bitcoin price remains under the $36,500 level as the absence of momentum leaves BTC susceptible to a slump.\n\nEthereum price risks at least 5% slump to the $1,864 level if it loses critical support at $1,935.\n\nRipple price risks a 10% drop to the late October lows if the support at $0.5981 gives way.\n\nBitcoin (BTC) price remains steadfast below the $36,500 level as the US Securities and Exchange Commission (SEC) misses its target. Nevertheless, a new development concerning the sane has equally not done anything for BTC, with ETF specialist Erica Balchunas saying the financial regulator wants ETFs to do cash creats.\n\nMeanwhile, both Ethereum (ETH) and Ripple (XRP) are losing ground as profit taking escalates.\n\nAlso Read: SEC allegedly wants spot Bitcoin ETFs to do cash creates, not crypto, after possible meet-up with exchanges\n\nBitcoin price likely to drop\n\nBitcoin (BTC) price remains trapped under the $36,500 level as hope for a spot BTC ETF approval in 2023 wears thin. All indicators show that momentum is waning due to multiple sell-signals in play. This leaves the king of cryptocurrency susceptible to a fall.\n\nUnless sidelined investors enter the fold, Bitcoin price could lose the support offered by the ascending trendline at $35,410. The ensuing selling pressure would then likely plunge BTC to $34,000.\n\nFurther, south, the slump could see Bitcoin price extend below the $32,000 mark before a test of the bullish breaker extending from $30,126 to $31,524. A break and close below the midline of this order block at $30,824 is likely to send BTC to the forecasted $30,000 psychological level.\n\nBTC/USDT 1-day chart\n\nOn the other hand, increased buying pressure could see Bitcoin price confirm its move north above the supply zone extending from $36,276 to $37,301 by decisively closing above the $36,788 level. Past this level, the likely move would be to clear the $37,972 barrier before an extension to the $40,000 psychological level.\n\nAlso Read: Bitcoin price hit $38,000 despite US financial regulator’s decision to delay two BTC ETF decisions\n\nEthereum price losing $1,935 support will be detrimental to ETH holders\n\nEthereum (ETH) price is testing the critical support at $1,935, and losing this level could send the largest altcoin by trading volume to the depths of $1,864, 5% below current levels.\n\nIn a more dire case, the fall could extend toward the $1,800 psychological level with the next support level likely to present itself around the $1,753 mark.\n\nETH/USDT 1-day chart\n\nConversely, if the $1,935 mean threshold and ultimately the order block spanning from $1,864 to $2,004 holds as a support level, Ethereum price could pull north, restoring above the ascending trendline at $2,029.\n\nIn a highly bullish case, the gains could extend to the $2,136 range high, with such a move constituting a 10% climb above current levels.\n\nAlso Read: Ethereum is a commodity, but SEC will not admit it, expert says amid ongoing ETF race\n\nRipple price extends fall with 10% pullback possibly in the cards\n\nRipple (XRP) price could fall 10% below the $0.5981 support level to test the $0.5392 support, as the remittance token continues to extend its losses after breaking out of the symmetrical triangle.\n\nThe Relative Strength Index (RSI) shows momentum is falling as it nosedives south, mirrored by the Awesome Oscillator (AO), whose histogram bars are soaked in red and edging south. This adds credence to the bearish thesis.\n\nXRP/USDT 1-day chart\n\nOn the flip side, a re-entry by sidelined investors and late bloomers could see Ripple price correct, pulling north and potentially restoring above the lower boundary of the triangle at $0.6603. In a highly bullish case, the gains could extrapolate past the $0.0700 psychological level, balancing out the inefficiency represented by the Fair Value Gap (FVG) at $0.7512 with the potential to hit the $0.8000 psychological level.\n\nAlso Read: XRP price fails to show parity with Ripple’s important victory over SEC, 5% pullback seems likely"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9ZUHV0OUdjQmJSR2FGU3hJeVVGZE5qVmhGd0UxalZUWjh3V3lzTFIwdU4yX0pSSElXakVuZnZYSUdOUXRjczc1T0VpVzhxRVNsakZLaW9tMWRkV1NVcHFwcGZ1aG90bFlLRURDTi1UTHA3MXB6VDVNa3N30gF_QVVfeXFMTi0xNFZ0RDNxdzlRV0lnbVQxdmgzejE0ZmhCdFpubUJKOWRoR0xQaU4ycEdjSGxfTFdBQ0VZSzVxVU9ybGpDbi1TVFFJMmZTSHBSelF3WmxlRlo1bVBqNzU2MzN4b0dZbEhxUzdQYi1kYURMT3lLNUdVSjh5UWExbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Surpasses Ethereum in Fees First Time in Years - U.Today",
        "content": "Advertisement\n\nBitcoin has reclaimed its position as the leader in daily cryptocurrency transaction fees, surpassing Ethereum for the first time in three years. According to the most recent data, Bitcoin's daily fees reached $11.63 million. For comparison, Ethereum recorded only $8.44 million over the same period of time.\n\nTaking Ethereum's crown\n\nThree years ago, Ethereum surpassed Bitcoin in terms of transaction fees, a development attributed to its versatile blockchain platform, which enabled a diverse range of decentralized applications (dApps).\n\nThis versatility attracted significant user activity, particularly in the burgeoning field of decentralized finance (DeFi) and non-fungible tokens (NFTs), leading to higher transaction fees on the Ethereum network.\n\nAdvertisement\n\nThis period of dominance positioned Ethereum as a multifaceted platform compared to Bitcoin, which primarily functions as a digital currency.\n\nGame-changer?\n\nRecently, Bitcoin has experienced a sharp increase in average transaction fees. Starting from the beginning of November, fees have escalated significantly, with the fee on Nov. 16 reaching $18.69 per transaction. This surge represents a nearly 1,000% increase from the fee recorded on Nov. 1.\n\nSome experts view this rise in transaction fees as a positive development. They argue that higher fees contribute to the sustainability of the Bitcoin network, especially in the context of diminishing block rewards for miners.\n\nThe recent increase in Bitcoin's transaction fees comes at a critical time for Bitcoin miners, who have faced one of their least profitable years.\n\nThe upcoming Bitcoin halving, scheduled for next spring, will further reduce the block subsidy from 6.25 BTC to 3.125 BTC. In this scenario, higher transaction fees could become a more significant portion of miners' revenue, potentially accounting for 20%-30% of the block reward.\n\nThis shift toward fee revenue is seen as crucial for the long-term sustainability of Bitcoin's mining and transaction verification process.\n\nIt should be noted that Bitcoin's Ordinals inscriptions are now outperforming Ethereum in NFT sales."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOZm5Yb1Vla3duWHRWazRfZU1pQ2hSNjRMVXo3VFI2N0Ztc1pWWTkzZzdjVWxNWUdWYnNEZzVxOUpSYXJSUm1JZl9PdnRfcm5UQ1l1VFlkSDFLbHM1Q0xEa0lMcy1nSjVqY05ITVgwVG55LV9ZTDk2OFBlNU4wdkNISXRjZFBwVGk30gGOAUFVX3lxTE9FVEY4QjZXMS1QNkpzNFI0d0IxWkNVTDZDUkRjbktqSnBETEl0YXpqYlJsdGxwbjljLTFzWXNVX1VYQ0hheW9xVUFXTWhkMUpGYXBNSTQya0h3aFM1OFg0TlRWNkJZYkE1V1Zqa3RpMUpIZ1NVdXNHSlJLbE5ySzQ3UkhKb2hVekFxc2RxZkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction As Health Retracement May Fuel a Rally to $2200 - CoinGape",
        "content": "Ethereum Price Prediction: The altcoins market is experiencing a phase of correction amid resistance faced by Bitcoin at the $38,000 level. Ethereum, the second-largest cryptocurrency by market capitalization, has not been exempt from this trend as It recently underwent a sharp reversal from the $2,136 mark. The coin price witnessed a 10.7% drop in its market value over the past week, bringing it to the current trading price of approximately $1,945. Will this correction be extended further?\n\nAlso Read: Bitcoin (BTC) Topples Ethereum in Transaction Fees After 3 Years\n\nadvertisement\n\nWill ETH Price Revist $1700?\n\nThe $1900 and $1830 are strong support amid the current correction.\n\nThe Ethereum price is prevented from a major downfall until the two trendlines are intact.\n\nThe intraday trading volume in Ether is $12.6 Billion, indicating a 16% gain.\n\nSource- Tradingview\n\nThe Ethereum price showed notable growth in October and early November, rising from $1,522 to a high of $2,137, marking a 41% increase. This bullish recovery was significant as it surged above the crucial daily Exponential Moving Averages (EMA) of 20, 50, 100, and 200, reflecting an early sign of trend reversal.\n\nHowever, after forming a local top at around $2,137, the coin entered a minor correction phase. Currently trading at $1,341, the buyers are trying to sustain above the 32.8% Fibonacci retracement level.\n\nUntil the price is still above the 50% retracement level($1830), the overall bullish trend may still be intact. If the ETH price sustains above the $1,830 mark, it could potentially rebound strongly, and continue its bullish trajectory to $2,240, which corresponds to the resistance level of a rising wedge pattern.\n\nA breakout above this barrier could signify a robust bullish trend ahead.\n\n1 ETH to USD = $2661.663 1.48% (24h) ETH btc\n\nbtc eth\n\neth xrp\n\nxrp bnb\n\nbnb sol\n\nsol ltc\n\nltc polygon\n\npolygon cardano\n\ncardano tron\n\ntron doge\n\ndoge WETH\n\nWETH LUNC\n\nLUNC XMR\n\nXMR LIRA\n\nLIRA BITS\n\nBITS IHINU\n\nIHINU SWEAT\n\nSWEAT PI\n\nPI SATS\n\nSATS ILV\n\nILV BDX\n\nBDX MCOIN USD USD\n\nUSD INR\n\nINR JPY\n\nJPY CNY\n\nCNY GBP\n\nGBP EUR\n\nIs ETH Poised for Further Correction?\n\nThe Ethereum price movement is currently confined within the converging trendlines of a wedge pattern, suggesting a potential for a slow yet steady recovery. However, as the price approaches the upper trendline of the wedge, there may be an increase in selling pressure, particularly around the $2200 mark. Historical trends indicate that retests of this upper trendline often lead to significant corrections, potentially driving the price down to the lower trendline of the wedge, which could mean a correction towards the $1,700 level.\n\nExponential Moving Average (EMA): The 20-day EMA is providing dynamic support to the declining Ethereum price.\n\nMoving Average Convergence Divergence (MACD): A bearish crossover between the MACD line and its signal line suggests a correction sentiment in the market.\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFA3d1F5Q1YxWmRsSEhKelYyOVdfcVFra19sbk1TeXFIWmxKbkR0a2pjU3ZvWkNQZU5vcU1TSkYyeTA1bTNiSDJGZzUzajUteEU3dGdveHVSX2dkZHQ0VnZLdTlGS0hZTWY4REc2RkJQVzlDRHBy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Metadata in Blockchain Transactions Explained - LCX",
        "content": "Examples of Metadata in Blockchain Transactions\n\nMetadata comprises a wide range of information and capabilities, such as timestamps, transaction particulars, smart contract data, digital signatures, gas fees, IPFS links, Oracle information, and nonfungible token (NFT) metadata. These metadata elements empower the blockchain network to store and operate a variety of functions and data.\n\nTimestamps\n\nEach block in a blockchain is accompanied by a timestamp that indicates the exact instant it was appended to the chain. This metadata documents the precise moment a transaction takes place.\n\nTransaction Details\n\nA variety of metadata, including sender and recipient addresses, transaction quantities, and unique transaction IDs, may be appended to each transaction recorded on a blockchain.\n\nSmart Contract Data\n\nMetadata could potentially contain parameters and input data that are essential for the functioning of the contract during the execution of smart contracts on a blockchain.\n\nDigital Signatures\n\nDigital signatures are included in metadata to verify the authenticity of transactions and establish ownership.\n\nGas Fees\n\nMetadata on blockchain platforms such as Ethereum may contain information pertaining to the petrol charges incurred during transaction processing. This information is necessary for miners and validators to effectively prioritize transactions.\n\nInterPlanetary File System Links\n\nIn blockchain metadata, references to IPFS, a decentralized file storage system, are present. In order to gain access to the data stored on the blockchain, users must periodically retrieve a reference to the IPFS file, typically in the form of a hash. This method allows for the storage of substantial files, such as documents, videos, or images that pertain to on-chain assets like NFTs.\n\nOracles\n\nOracles are external services that grant access to real-world data for smart contracts. Information from these oracles may be incorporated into blockchain metadata in order to activate smart contracts.\n\nNonfungible Token Metadata\n\nMetadata, including creators’ names, descriptions, and additional particulars pertaining to the digital or physical assets they symbolize, is frequently included in NFTs.\n\nHow to Add Metadata to a Blockchain Transaction?\n\nIn order to incorporate metadata into a blockchain transaction, a user may utilize a smart contract, which consists of predetermined terms inscribed within it and operates autonomously.\n\nBy employing Ethereum as an illustrative case, we can comprehend the process. Ethereum is renowned for its capability to incorporate metadata into transactions via smart contracts.\n\nCreate a Smart Contract\n\nThe creation of a smart contract is a prerequisite for the addition of metadata. Specific guidelines regarding the location and method of metadata storage are incorporated within this contractual agreement. The metadata may be stored in a defined variable, which is typically a string.\n\nInteracting With the Smart Contract\n\nMetadata must be appended to a blockchain transaction via a transaction transmitted by an individual to the smart contract. Wallet applications for Ethereum or libraries such as web3.js or ethers.js may be utilized for this purpose.\n\nVerifying the Metadata\n\nThe metadata can be verified by any individual through interaction with the smart contract and by accessing the metadata variable subsequent to the transaction’s confirmation and inclusion in the blockchain. Nevertheless, when adding metadata to a blockchain transaction, it is critical to keep in mind that factors including petrol costs, security, and privacy must be assumed.\n\nUse Cases of Blockchain Metadata\n\nMetadata generated by blockchain technology is implemented across numerous sectors, such as healthcare, digital identity, smart contracts, and non-fungible tokens.\n\nSupply Chain Management\n\nUtilizing a blockchain to store product production, transportation, and quality-related metadata can assist organizations in enhancing transparency and traceability. For instance, a food manufacturer may maintain records pertaining to the origin of components, their progression through the supply chain, and assessments of their quality.\n\nEnsuring regulatory compliance, addressing issues such as fraud or recalls, and confirming authenticity are all dependent on this information. Moreover, consumers can utilize this metadata to formulate informed judgments concerning the products they acquire.\n\nDigital Identity and Authentication\n\nMetadata on the blockchain can be utilized to preserve and safeguard credentials and confidential information. Individuals have control over their data and have the ability to grant or deny access to authorized parties; this reduces the likelihood of identity theft and privacy breaches. This technology can be utilized by educational institutions, governments, and businesses to expedite identification verification processes and enhance service security.\n\nSmart Contracts\n\nSmart contracts are an additional field in which blockchain metadata is indispensable. These self-executing contracts determine when and how to carry out a specific condition based on metadata. As an illustration, an insurance smart contract might employ meteorological data as metadata in order to promptly commence disbursements for policyholders who have been adversely affected by inclement weather.\n\nEligibility and interest rates for loans in the financial sector can be determined by loan agreements using metadata-maintained credit ratings and transaction histories. This enables the industry to conduct lending procedures in a more streamlined and automated fashion.\n\nNonfungible Tokens and Digital Assets\n\nNFTs and digital assets frequently employ blockchain data to assign significance and value to digital artifacts, artwork, and assets. Metadata pertains to details such as the characteristics of the digital item, the originator, and the ownership history. This knowledge can significantly benefit provenance tracing, art authentication, and the development of decentralized applications (DApps) that are built upon NFTs.\n\nHealthcare Records and Data Security\n\nIn addition, the healthcare industry is employing blockchain metadata to ensure data integrity and secure the management of patient records. Metadata can be utilized to retain medical histories, patient consent forms, and data access logs, thereby enhancing the confidentiality and security of health information. In addition, it enables communication among diverse healthcare systems and expedites the acquisition of critical medical information by emergency responders.\n\nChallenges Associated With Blockchain Metadata and Way Forward\n\nAddressing obstacles related to blockchain metadata, such as concerns regarding scalability, data security, and Oracle dependability, is imperative for the long-term progress of technology and its extensive implementation.\n\nScalability and storage costs are significant considerations due to the fact that as the scale of blockchain networks increases, they may experience a decline in efficiency and require more resources. The storage of massive amounts of data on the blockchain could place a burden on the network’s architecture and heighten the danger of centralization.\n\nData privacy and security are additional concerns, especially when handling private or sensitive information. Privacy regulations may be in conflict with the transparency of blockchain technology; therefore, implementation and design must be approached with care. In addition, malicious or erroneous data inputs may compromise the dependability of blockchain applications and smart contracts that rely on oracles to retrieve external data.\n\nIt is imperative to tackle these obstacles in order to ensure the ongoing progress and widespread implementation of blockchain technology across diverse sectors. To surmount these challenges in blockchain metadata, a diversified approach is required. To mitigate scalability challenges, developers may consider investigating layer-2 solutions and sharding techniques as a means to offload specific data from the primary chain.\n\nThe utilization of permissioned blockchains and encryption can enhance the privacy and security of sensitive data. An additional layer of security can be applied to Oracle by utilizing multiple data sources for reputation and validation mechanisms. In light of this, blockchain metadata can be rendered more secure and efficient through the implementation of robust security protocols, innovative technology, and meticulous design."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE00Vm01NjRRdmJMRUlSZ2IxYXBkSm9mM3huS1hjdXZGM0xJNEd3UjE1TWZabl80TUZtOTlFb0d1WUdwVjRhLXZycEdtX1l1bTN5VGRqZDlQR2FTLThvTUZUSHhsZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 16:51:13 GMT",
        "title": "SEC delays decision on Hashdex ETH ETF rule change - Blockworks",
        "content": "The US Securities and Exchange Commission has delayed a decision on Hashdex’s proposed ethereum ETF rule change.\n\nThe move, confirmed by a filing dated Nov. 15, comes just days after the regulator similarly delayed Hashdex’s bitcoin ETF proposal.\n\nIf the SEC were to approve the rule change, the ETF would hold future and spot ether contracts.\n\nAccording to the SEC’s filing, the Commission now has until Jan. 1, 2024 to make a decision or “institute proceedings to determine whether to disapprove the proposed rule change.”\n\nThe delay is one of the handful expected this week, including SEC decisions on the Franklin Templeton proposed spot bitcoin ETF. The SEC also postponed a decision on Grayscale proposed ethereum ETF rule change on Nov. 15.\n\nThe Grayscale delay, as noted by Bloomberg analyst James Seyffart, was not “remotely surprising.”\n\nThis isn’t the first round of SEC delays on recent bitcoin or ether spot ETF applications, either. Back in late September, the agency delayed the BlackRock and Valkyrie spot bitcoin ETF decisions.\n\nThroughout the years, the SEC has issued over 30 rejections to a number of filers including the Winklevoss twins. The spot bitcoin race really began heating up in July of this year after BlackRock — the world’s largest asset manager — tossed its hat in the ring. BlackRock has faced a very few number of rejections for their funds, pumping the optimism for eager ETF watchers.\n\nIn October, eagle-eyed viewers noted that the asset management firm seemed to take a step closer to a possible green light from the SEC after the ETF was listed on the Depository Trust and Clearing Corporation’s website. However, a DTCC spokesperson later told Blockworks that the move did not signal a possible approval by the SEC.\n\nBlackRock has also thrown its hat in the ring for a possible spot ether ETF.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOcGYwZzRXWjFVMkRLNl9EM0lHZmx6M0FMYUF2Y09QYnlWQVFHQ2xmQWFOMXRTaUFGVmZlakJiMFlHbmFjWVNpM1BrdmptQXdBVUhEVDVtNVBrUjBqNmttOXktUmpYOHF2ckVDZGNRQWV4TjU4eUVFNTViOFJiMFFRX0pzUTlNX2xSQ0xycDYxYzQ5am5EanNQcg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "3 Things You Should Know Before Staking Crypto For Passive Income - The Motley Fool",
        "content": "Yes, crypto staking is a form of passive income, but it's not as low-risk as you might think.\n\nWhile crypto staking has existed for years, it really only became mainstream with investors during the past year. This coincided with the transformation of Ethereum (ETH 1.78%) into a proof-of-stake blockchain as part of The Merge. Suddenly, people began asking what crypto staking was, and how they could make money from it. As a result, crypto staking went from something only the early blockchain and crypto pioneers were doing to something the average investor on Main Street was doing.\n\nWhat makes crypto staking so unique is that it is both a technical process that involves the inner workings of a blockchain, and a form of financial investment. At times, this duality can be confusing for investors, who may only be thinking of crypto staking as a form of passive income. With that in mind, here are three things to keep in mind before staking your crypto.\n\nA flawed analogy?\n\nThe classic analogy is that crypto staking is much like depositing your funds in a high-yield savings account. You are depositing your cryptocurrency with a blockchain, much like depositing your dollars with a bank. And, in exchange for doing so, you are paid a specified reward rate, usually expressed in terms of an annual percentage yield (APY). For most cryptos, these APYs range from 2% to 10%. For example, on Coinbase Global (COIN 7.69%), you can currently earn 3.35% on your Ethereum holdings.\n\nBut this analogy has several flaws. For one, blockchains are not banks. That means your deposit is not guaranteed by anyone, and certainly not by the Federal Deposit Insurance Corporation. That helps to explain why APYs for some cryptos can be as high as 45% -- think of this as a risk premium for depositing your funds with a potentially unreliable blockchain counterparty.\n\nMoreover, when you stake your crypto, you are paid rewards in the form of the cryptocurrency you deposited, and not in dollars. Thus, when you compare APYs, you need to be thinking in terms of how much crypto your investment is yielding, and not how many dollars it is yielding.\n\nFinally, keep in mind that staking usually requires you to \"lock up\" your crypto for a specified period of time, during which you will not have access to it. This might not seem like a big deal at first, especially if you are a long-term investor, but what if your crypto starts to lose value while it's locked up? When you get your crypto back at the end of the staking period, it may have lost significant value. The math here can be brutal. If your crypto loses even 10% of its value over a 12-month period, and you are earning a 5% APY, it's hard to see how you're going to make a profit on this investment.\n\nDifferent types of staking\n\nConfusing matters further is that there are different types of staking.​​ One form of staking requires you to operate a node on the blockchain network and use your own computer hardware to validate transactions on the blockchain. But this is neither easy nor passive. If you want to become a validator on the Ethereum blockchain, for example, you need to make a minimum investment of 32 ETH (worth almost $64,000 at today's prices) and have the suitable tech hardware to run a blockchain node 24/7.\n\nThat's not what most people are talking about when they talk about crypto staking as a form of passive income. Instead, they are usually talking about staking crypto via a cryptocurrency exchange such as Coinbase. This process is much easier -- it usually only requires a few clicks online, and you're ready to go. As long as you already own the cryptocurrency you want to stake, you just tell the crypto exchange how much you want to stake and for how long, and everything else is done for you.\n\nFor more advanced investors, there's also a form of staking your crypto without the need for a cryptocurrency exchange at all. Instead, you hold funds in your own blockchain wallet and use a third-party staking service. Typically called liquid staking, this process can reduce some of the risks of staking, since you can pull out your crypto at any time. Moreover, the staking rewards can be a bit higher, because there is no intermediary (like a crypto exchange) taking a cut of your rewards.\n\nRegulatory concerns\n\nFinally, there's the pesky little matter of the Securities and Exchange Commission, which has decided that there's something about crypto staking that it does not like. In February, it went after cryptocurrency exchange Kraken for offering staking services to customers. Then, in June, it went after Coinbase. So there's currently a bit of uncertainty about the future of crypto staking.\n\nThe good news, if you want to call it that, is that the SEC is not so much opposed to the concept of staking, as it is to the way staking is pitched to retail investors. If you read the official SEC statement about Kraken, this becomes clear. For example, the SEC said that Kraken did not do a good enough job of explaining potential risks to customers.\n\nCaveat emptor\n\nThat's why I made a big deal about the flawed analogy to a high-yield bank savings account. If you are thinking about crypto staking as just crypto's version of a savings account, then it's easy to see how you might be in for a rude surprise. Unlike with a savings account, you can actually lose money on your staked crypto. So, certainly, before you get involved with crypto staking, make sure you do your due diligence and understand the risks."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNS2ZwaXBGclZNWkFqSkdhdXV4SWszTHdzUzJzYnBvSVh6NF8ySWluVm5oZ0RHS2lyelF0UXpUWm1XVVNTTmxUd01xUlM2MTl4U2dMcXpyLVZjLVdlNmhhT054UWRLZWoxNlllQUNEa3hvYlhLWS0wQWpKSzk2eHVQWDRtdE9Md9IBiwFBVV95cUxOdVdaVlYxMXltNXJNdWVRMFE1UEt3NkJ5WmtfYS1iWS1YLXlOR3pXeTRFOXNJY1VMa0lHNmdKOWVqRldOVXVBb3Q2QjNxY2pvaFJ0cXlabm55MDRHOUIxeEpuczlyNzljNFlVaEJBYVVaUkJTYXM4eEs3a1o0WkQxcnVxNUtQcy1zcVBB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Breaking: Fidelity Investments Files for Ethereum Spot ETF - CoinGape",
        "content": "American investment management firm Fidelity Investments has applied to list its Ethereum spot Exchange Traded Fund (ETF) product with the Securities and Exchange Commission (SEC). With this filing, Fidelity Investments now ranks as the 7th asset manager making a move for the product in the United States.\n\nOther asset managers that have filed to list Ethereum spot ETFs include VanEck, Ark Invest and 21Shares, Hashdex and Nasdaq, Grayscale, Invesco and Galaxy Digital, and BlackRock respectively.\n\nadvertisement\n\nThe Fidelity Ethereum ETF\n\nPer Form 19b-4 lodged with the SEC, the Fidelity Ethereum ETF is dubbed the “Fidelity Ethereum Fund” and is billed to track the performance of Ethereum. The firm said the ETF, if approved, will trade in compliance with the BZX Rule.\n\nThe filing positions Fidelity Investments at the forefront of the crypto ETF revolution, noting that this move is designed to truly safeguard the interest of investors in the United States.\n\n“To this point, approval of a Spot ETH ETP would represent a major win for the protection of U.S. investors in the crypto asset space,” Fidelity said in its filing.\n\nFidelity Investments used the Ethereum ETF to expand the general argument proponents of related products have put forth hinting at the fact that the absence of a regulated avenue to embrace crypto predisposes investors in an undue way.\n\nFidelity Investments is confident in securing approval as it cited an excerpt from the ruling in the Grayscale versus SEC legal brawl. With the SEC denying Grayscale’s request to convert its renowned Bitcoin Trust into a full-fledged Bitcoin Exchange Traded Fund product, the court ruled that the SEC has no basis for the denial as futures tied to BTC had already been approved.\n\nThe verdict ordered a review of the SEC decision and recent reports confirmed that the SEC and Grayscale and in consultation about the product.\n\nFidelity Investments Boosting the ETF Approval Sentiment\n\nFidelity Investments is a big name when it comes to institutional embrace of crypto. The firm is among the top firms with hopes to gain approval for its spot Bitcoin ETF product filed back in June.\n\nAfter the filing, the ETF, dubbed the “Wise Origin Bitcoin Trust” has also been updated to address crucial concerns gleaned from feedback from the markets regulator. With Fidelity’s influence in the market, as it boasts about $4.5 trillion in Assets Under Management (AUM) and ample resources, many believe its application will be sanctioned by the SEC.\n\nBlackRock also holds this influence and the presence of both firms has contributed to projections that the approval odds for a spot Bitcoin ETF by January now sitting at 90%\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1aZFRSM3VicXV0ZlkzeXRvbWx6b1VfZV9NVVdUOEVOekc4UkRkcV9RckRvU2czLXVDRmNNdFQ4N2ltbkxXQ0ktMHlueWZmTHowbERkSzk3MmJkSlNIMkZObXhXUGFfdmpqYks2cXoyQ1A5R2wwTVpVWEhyRk8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "What are forks and how to track them - DLNews",
        "content": "Spend enough time reading about crypto and DeFi and you’ll come across forks, a pretty enigmatic term for those who don’t spend their days digging through Github repositories.\n\nBut fear not — forks are easy to understand.\n\nForking refers to any time a developer copies open-source code and uses it as the base for a new, separate project. In DeFi this most often takes the form of copying the code for an existing protocol and deploying it again, sometimes on a different blockchain, and often with small but significant changes.\n\nSome of the largest DeFi protocols are forks. In 2020, Sushiswap, a fork of decentralised exchange Uniswap, reached a total value locked of over $8 billion at its peak as it challenged the dominance of the protocol whose code it had copied. Uniswap had a TVL of around $10 billion at the time.\n\nBut forking isn’t limited to DeFi protocols. The blockchains that an entire DeFi ecosystem is built on can also be forked.\n\nThe term is also used to describe any time blockchain developers agree to implement an update. When updating, developers must create a fork, as most blockchains cannot be updated without doing so.\n\nAs we’ll explore later, forks can be contentious, and some have created great schisms within blockchain communities.\n\nBut first, let’s explore how to use DeFiLlama to track DeFi protocol forks.\n\nJoin the community to get our latest stories and updates\n\nHow to track forks on DefiLlama\n\nTo navigate to Forks dashboard, click on the DeFi tab on the left of the DefiLlama home page then click on the forks subsection.\n\nAt the top of the dashboard are two charts showing the popularity of different forks. Uniswap v2 is currently the most-forked protocol, accounting for almost 35% of all the forks DefiLlama tracks.\n\nUniswap v2, Compound v2, and Aave v3 are the three most commonly forked DeFi protocols. (DefiLlama)\n\nLower down you’ll find a list of 88 different DeFi protocols and all the forks that use their code.\n\nThe list includes three columns. This first shows the number of forks of a protocol, the second shows the total value locked — or TVL — in that protocol, and the third shows the TVL of all forks of that protocol relative to its own.\n\nThe greater this figure is, the more successful the spinoffs are that used the original protocol’s code.\n\nDefiLlama's list of protocols with active forks. (DefiLlama)\n\nTake Solidly for example, an exchange protocol whose forks have amassed a TVL 105,511% that of the original. Solidly’s launch was marred by bugs, and so bad was its reception that its creator, Andre Cronje, quit the project just three weeks after launch.\n\nBut other developers eyed opportunity where Cronje gave up, and forked the protocol into more successful projects, like Velodrome.\n\nMany forks are near identical copies of existing protocols, just deployed on a different blockchain. However, some use the existing protocol as a starting block to build something completely new.\n\nFor example, Frax Swap is a fork of Uniswap v2, but it is just one part of the larger Frax protocol that also includes an Ether liquid staking protocol and an algorithmic stablecoin.\n\nForking blockchains\n\nForking doesn’t just apply to the code behind DeFi protocols. As blockchains are also just lines of code on computers, they too can be forked.\n\nThe most common reason to fork a blockchain is to implement an upgrade. Blockchains have no centralised point of control, so everyone running nodes on the network must agree to switch to the upgraded version of the blockchain and leave the old one behind. This is sometimes referred to as a blockchain’s social consensus.\n\nEthereum’s Shapella upgrade in April 2023 is a recent example of a blockchain fork. The update changed Ethereum’s underlying code to allow users to withdraw staked Ether from the blockchain’s staking contract.\n\nHowever, while everyone running Ethereum nodes agreed on the Shapella fork and switched over to the new network, this doesn’t always happen.\n\nIn 2016, an incident known as the DAO hack ruptured the Ethereum network, causing it to split into two blockchains: Ethereum and Ethereum Classic.\n\nA hacker stole $60 million worth of Ether — about 14% of all Ether in circulation at that time — from The DAO, an early decentralised autonomous organisation that intended to act as an investor-directed venture capital firm.\n\nAfter much debate, a majority of Ethereum stakeholders chose to fork the blockchain, effectively rolling back Ethereum’s history to before the hack. This rolled back version is the main version of Ethereum used today.\n\nHowever, the decision was controversial — blockchains are meant to be immutable. Those who disagreed with the decision to roll back Ethereum continued to support the original blockchain, which is now known as Ethereum Classic.\n\nEthereum Classic is not the only forked blockchain. Bitcoin also has several forked versions that are still active, including Bitcoin Cash, Bitcoin Satoshi Vision, and Litecoin.\n\nNext steps\n\nRead more about Sushiswap’s vampire attack on incumbent decentralised exchange Uniswap.\n\nExplore the reasons Bitcoin’s many forked networks came into being."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE83WDlVb24zWnZzT2hOQ3NYU2JhLXoyaG1vY0JuMll3YVp0UlFKQ1JjQzN5MUZDN25hTkR4R0lWT2NhSXB2Q3dLNFZ3NlZuN2hKX0VGZm1ieklqM3l4clJtc2RLWF9jR0gwclU4Qmd4VlU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Is Solana (SOL) Worth the Hype? - Bitcoin Market Journal",
        "content": "Crypto investors are buzzing about Solana again, and with good reason: the value of SOL is up over 350% since a year ago:\n\nIt has many of the hallmarks of a good investment: it’s a real project (a leading Layer 1), with real users (about 100K/day), generating real revenue (about $50K/day in fees).\n\nBut is it a good long-term investment?\n\nAt Bitcoin Market Journal, we’re in this for the long haul. And personally, I think Solana is a long shot in the long term. Here’s why.\n\nThere Can Be Only One (or Two)\n\nOur first investing thesis is that while lots of experiments happen in the early stages of a new technology, ultimately only one (or sometimes two) big platforms survive in the long run. (Think PCs and Macs, Androids and iPhones, etc.)\n\nIn the traditional tech world, this is because big players get bigger, mostly through network effects: the bigger you get, the easier for new customers to join you. The smaller companies either get acquired, or driven out of business.\n\nThis is how we end up with Google gobbling up all the search business, OpenAI overtaking AI, and Salesforce forcing out other CRMs.\n\nIn the emergent world of blockchain technology, we are only just starting to understand what the categories even are. But one category is definitely smart contract platforms (a.k.a. Layer 1s), the operating system for crypto.\n\nEthereum (ETH) is, by all measures, the 800-pound gorilla in this space. They have the most users, the most revenue, the most developers. So for a competing Layer-1 like Solana, Ethereum is the one to beat.\n\nFor all the hype, let’s look at how Solana stacks up:\n\nEthereum Solana Daily Active Users 300,000 100,000 Daily Fees $5,000,000 $50,000 Active Developers 200 75\n\nSource: Token Terminal (rounded for readability)\n\nThis is not to say that Solana must beat Ethereum in order to survive. Niche search engines like DuckDuckGo or WolframAlpha (I’m still waiting for WolframBeta) have survived against Google. But their market share is tiny by comparison.\n\nAs long-term investors, we don’t want to pick the projects that will survive; we want to pick the projects that will thrive. The numbers above show you that Solana has traction, but it still has a way to go.\n\nIt’s Not the Technology, It’s the Users\n\nBlockchain nerds get really excited about Solana’s faster throughput (due to its Proof of History consensus algorithm vs. Ethereum’s Proof of Stake), and its developer friendliness (they can use languages like Rust and C, vs. having to learn Ethereum’s Solidity).\n\nThe tech crowd gets really excited about the tech, but no one else does. This is because the market does not really care about technology, the market cares about the users.\n\nIf a company is building a new blockchain application, where would they want to build it?\n\nThe one with a better consensus algorithm, or the one where more users are going to be able to use it?\n\nThe one with an easier programming language, or the one that’s going to generate more revenue and fees?\n\nThe underdog, or the existing leader?\n\nCompanies will generally go with bigger tech platforms, because they’re a safer bet. There’s safety in numbers.\n\nBut what about investors? My experience is that investors also do not really care about the technology, they care about whether they can make money. The technology is only relevant if it’s going to lead to a higher price multiple in the end.\n\nVHS vs. Betamax, MP3 vs. FLAC, QWERTY vs. any other keyboard layout: often the inferior technology wins. In blockchain, especially, the tech is only relevant if it leads to more users.\n\nMore users = more network effects = more value.\n\nYou want to find winning long-term investments? Look for blockchain projects with userbases that are large and growing. (Remember that before this recent price rally, the crypto outlets were bemoaning Solana’s drop in daily users.)\n\nWhere are the Killer Apps?\n\nLayer 1s are like operating systems: to grab those critical users, you’ve got to have some killer apps. For example, VisiCalc put the Apple II on the map, AOL introduced the Internet to the masses, and Siri made the iPhone indispensable.\n\n(In blockchain, we call them decentralized apps or “dapps,” but c’mon, they’re just apps.)\n\nOn Solana, you’ve got the usual assortment of dapps: a DEX (Serum), an AMM (Raydium), wallets (Phantom), borrowing/lending (Solend), NFT marketplaces (Magic Eden). I think of these as copycats of bigger, more popular dapps on Ethereum.\n\nHowever, there are a few dapps that take advantage of Solana tech:\n\nThe decentralized music platform Audius lets artists publish directly to listeners and cut out the middleman, using Solana’s higher throughput and lower transaction fees to handle a large volume of microtransactions.\n\nThe MMO game Star Atlas runs a complex game economy with real-time transactions—all those tiny transactions are easier and faster to process on Solana than Ethereum.\n\nMango Markets offers decentralized spot trading and perpetual futures, which is nothing new, but Solana’s speed and efficiency can allow for higher-frequency trading with lower latency.\n\nSo it’s possible that Solana can carve out a niche around dapps that require high-speed microtransactions. If that’s the case, we’d want to see a lot more of these specific dapps launching over the next year: dapps that you simply couldn’t build on Ethereum.\n\nInvestor Takeaway: So Long, Solana\n\nThe recent price gains are likely due to excitement over Solana’s Breakpoint community conference, and bullish sentiment from influencers like Cathie Wood.\n\nBut it’s unlikely that Solana will unseat Ethereum anytime soon. I don’t see any reason to jump on this bandwagon, especially when prices are triple what they were just a month ago.\n\nBut technology is full of surprises, and the early leaders aren’t always the later leaders. Ethereum may not be the Layer 1 for the long term, and Solana may carve out a profitable niche. But at the moment, ETH is still the one to beat.\n\nSo for now, it’s so long, Solana. But we’ll keep an eye on you.\n\nFor more tips on building wealth with bitcoin and crypto, subscribe to our daily Bitcoin Market Journal newsletter."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxNV2pUSmdraHNvZW1nS0swT3NhS19kbWxwTDZBbUFuWmx2dVoxYXk2WFM4MXM5UzQzRHc5UnFLZjVmcnRTYUdscXNmSlpXRUsyQjhMTFlrVHpqNUYyRWpEaTZuaHU3SnFZaHNmWFFVcjhZdDQwOXF1aTRnNG1nZ24xZ2phXzFIcUhfWlktUHlNTmFMejVsVFdYaVRaUHJBMUJ3QnRyb0hydlJkM3JsbFMtQzh3U2dic0RKMFlsZm5YS3BUV3BwMFBYMFJwNGhodUVPRXZaQ0c5bXdwRXJ3ZEVIRXJ1SXB6dW9SZWxDSEh2aHJYYWtBc05LRklB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Dogecoin Leaves Bitcoin, Ethereum In The Dust After This Space Company Literally Plans To Take It 'To The Moon' - Investing.com UK",
        "content": "Risk Disclosure: Trading in financial instruments and/or cryptocurrencies involves high risks including the risk of losing some, or all, of your investment amount, and may not be suitable for all investors. Prices of cryptocurrencies are extremely volatile and may be affected by external factors such as financial, regulatory or political events. Trading on margin increases the financial risks.\n\nBefore deciding to trade in financial instrument or cryptocurrencies you should be fully informed of the risks and costs associated with trading the financial markets, carefully consider your investment objectives, level of experience, and risk appetite, and seek professional advice where needed.\n\nFusion Media would like to remind you that the data contained in this website is not necessarily real-time nor accurate. The data and prices on the website are not necessarily provided by any market or exchange, but may be provided by market makers, and so prices may not be accurate and may differ from the actual price at any given market, meaning prices are indicative and not appropriate for trading purposes. Fusion Media and any provider of the data contained in this website will not accept liability for any loss or damage as a result of your trading, or your reliance on the information contained within this website.\n\nIt is prohibited to use, store, reproduce, display, modify, transmit or distribute the data contained in this website without the explicit prior written permission of Fusion Media and/or the data provider. All intellectual property rights are reserved by the providers and/or the exchange providing the data contained in this website.\n\nFusion Media may be compensated by the advertisers that appear on the website, based on your interaction with the advertisements or advertisers."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE1paENLcllNUXE0Q3VhWFkwMVIxSlNfR1VUMjhsVktrQWZ4VG02LUMtSnFmYmt0emFMMlhMZWEweS1hOW9Ob0V2S1RPTEJUTFNKeF9QdFdrakE3Z0NaZkgxQWFkdVluWDVKZll4LTByWkxHdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Bitget 2024 Crypto Forecast: Navigating Bitcoin, Ether, and More - BitPinas",
        "content": "Bitget, a prominent cryptocurrency exchange and digital asset trading platform, recently unveiled its forecasts for major cryptocurrencies in 2024. The company anticipates a positive trajectory for Bitcoin, Ether, and XRP, though it warns of potential challenges for DOGE.\n\nBitcoin (BTC)\n\nBitget has stated that the Bitcoin market’s expectations for future upward movement primarily hinge on the following factors:\n\nThe Federal Reserve’s decision to halt interest rate hikes and the timing of rate cuts.\n\nThe approval of Bitcoin ETFs by institutions such as BlackRock.\n\nThe Bitcoin halving.\n\nRegulatory easing to increase market access.\n\n“Currently, data indicates that the Federal Reserve’s rate cut may be delayed until September 2024, and the review results for Bitcoin ETFs are likely to be postponed until 2024. The Bitcoin halving is expected in 2024, and judging from the Litecoin halving hype, it’s generating moderate interest,” Bitget explained.\n\nBitget further noted that a recent court ruling mandates the US SEC to reconsider Grayscale’s Bitcoin Trust conversion to an ETF. The listing of BlackRock’s Bitcoin ETF on the Depository Trust & Clearing Corporation (DTCC) has led to increased market belief that regulatory conditions are improving, increasing the likelihood of approval for Bitcoin ETFs.\n\nIn addition, the firm highlighted that the market has been consolidating at lower levels for a long time, but there is now a demand for a rebound. Bitget stressed that interest rate policies are stabilizing, and the market is expecting an upward breakthrough.\n\nAdvertisement\n\n“Upward targets include $36,000, $38,000, and $42,000, with support at $32,000. However, it’s not ruled out that a new black swan event could cause Bitcoin to return to a range of $25,000 to $32,000 in volatility,” the exchange concluded.\n\nFor more articles on Bitcoin, visit the BitPinas page.\n\nEther (ETH)\n\nBitget highlighted that Bitcoin’s market share has reached a two-year high at 51%, while Ethereum’s on-chain activity is at historic lows with daily Gas fees dropping to single digits. The exchange pointed out that Ethereum’s price has been in a weaker position than Bitcoin, primarily following Bitcoin’s volatility.\n\nHowever, Bitget still expects the Kusama upgrade at the end of the year to improve the development of Layer 2 solutions, which could lead to a price increase for Ethereum in early 2024.\n\nThe exchange noted that key levels to monitor for ETH are $2,400 and $2,800, with support levels around $1,500.\n\nRead: BlackRock’s Ethereum ETF Confirmed, Ether Surge in Price\n\nXRP\n\nAccording to the exchange, the likelihood of an upward trend in Ripple’s price is driven by several positive factors.\n\nNotably, the US SEC dropped all charges against Ripple’s CEO, Brad Garlinghouse, and Executive Chairman, Chris Larsen. This marks their third consecutive legal victory, following the July 2023 ruling that deemed “XRP itself is not a security” and the October federal judge’s decision to dismiss the SEC’s appeal request.\n\n“In terms of contract positions, Binance’s long-to-short ratio is 2.5894, and the long-to-short ratio of account positions is 1.3357, indicating strong bullish sentiment. It’s crucial to monitor whether the price can break through and hold above the 0.5u level. Once it stabilizes, there’s potential to break through the prior resistance zone around 0.54u,” the firm added.\n\nBitget, however, noted that support levels to watch are around the lows from July and September, near 0.46u. If there are no specific news catalysts, the cryptocurrency may remain in a narrow trading range, awaiting potential upward moves in Bitcoin or further developments in the news.\n\nDOGE\n\nAccording to Bitget’s forecast, there is a high probability of Dogecoin price decline before the end of the year, as there are few positive factors influencing the price. In comparison to other cryptocurrencies, Dogecoin has fewer positive news and development catalysts.\n\nHowever, the exchange emphasized that Binance’s long-to-short ratio of 3.2589 and the long-to-short ratio of account positions at 1.0927 suggest a bullish sentiment among traders.\n\nAccordingly, Bitget noted that DOGE has experienced a decrease in both trading volume and price, fully retracing its 2023 gains.\n\n“DOGE has experienced a decrease in both trading volume and price, fully retracing its 2023 gains. Monitoring the critical price support at $0.566 is crucial, as a breach could trigger accumulated selling pressure from earlier levels, potentially resulting in additional declines. Given the sustained long-term downtrend, the probability of an upward trend is relatively low,” the firm stated.\n\nWhat is Bitget?\n\nEstablished in 2018, Bitget is a cryptocurrency exchange platform that enables users to buy, sell, hold, and earn cryptocurrencies. Bitget supports over 500 altcoins, including Bitcoin and Ethereum. It offers a variety of services, including futures trading, copy trading, and smart trading tools.\n\nIn May, the Bitcoin, Beer, and Bitstories, co-presented by Bitget, centered on crypto trading strategies. The panel delved into the present state of the crypto industry, affirming its resilience despite the bear market. Discussion points included factors influencing trading and investment strategies, such as policy impacts, the role of institutions in fund flows, and the significance of risk mitigation.\n\nThis article is published on BitPinas: Crypto Exchange Bitget: 2024 Forecast for BTC, ETH, DOGE, XRP\n\nDisclaimer:"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQT05zbUp2cE1TOVBTa09fYlQteHBxa0hKZ0pDSFd4SFg0ejFVRlhUSVJ3OUlnNlBySDNOWVdIbGtubkNKcmpBbkh0d19vbkVKa1JjSjZnMElJZHBCZXdZbl93clVVZTlyOXlTaDFaWC1LQ0JiTVlSMzRUMDMyRVB4UzBuWGVjeWhLOHlkVUs4dnhic3A2R3Z2b2JUZWRLZzUyeDBV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "BlackRock Officially Files For Spot Ethereum ETF. Here’s How ETH Price Reacts - Times Tabloid",
        "content": "BlackRock, the world’s largest asset manager, has filed for a spot Ethereum exchange-traded fund (ETF). This highly anticipated filing is seen as a significant validation of Ethereum’s potential and could pave the way for broader institutional adoption of the second-largest cryptocurrency.\n\nBlackRock’s Ethereum ETF Filing\n\nFollowing BlackRock’s recent registration of the iShares Ethereum Trust in Delaware, the filing for a spot Ethereum ETF with the U.S. Securities and Exchange Commission (SEC) marks a crucial milestone.\n\nIt signifies BlackRock’s intention to launch an ETF that tracks the performance of Ethereum, providing investors with a regulated and accessible way to gain exposure to the cryptocurrency.\n\nRead Also: Fake BlackRock XRP ETF Filing Takes a New Turn\n\nMarket Impact and ETH Price Rally\n\nThe news of BlackRock’s spot Ethereum ETF filing has already had a profound impact on Ethereum’s price. Within hours of the announcement, the cryptocurrency added over $200 to its market value.\n\nThis surge is not surprising, given BlackRock’s immense influence in the financial world. The listing is termed a significant vote of confidence for Ethereum. It also has the potential to bring more institutional investors into the crypto space.\n\nBlackRock’s proposed spot Ethereum ETF is expected to mirror its spot Bitcoin ETF, which was filed with the SEC in June 2023. The ETF will be physically backed by Ethereum, meaning that BlackRock will hold the underlying cryptocurrency in custody.\n\nWe are on twitter, follow us to connect with us :- @TimesTabloid1 — TimesTabloid (@TimesTabloid1) July 15, 2023\n\nRead Also: BlackRock’s iShares Spot Bitcoin ETF Relisted on DTCC, BTC Bullish Trend Returns\n\nRegulatory Considerations and Future Prospects\n\nWhile BlackRock’s spot Ethereum ETF filing is a significant step forward, regulatory challenges may still arise. The SEC’s scrutiny and potential intervention, as seen in previous cryptocurrency-related filings, could impact the approval process.\n\nHowever, the SEC’s unsuccessful intervention in Voyager Digital’s bankruptcy proceedings suggests that BlackRock may be able to proceed with its ETF plans.\n\nAs the market continues to evolve, the impact of BlackRock’s spot Ethereum ETF filing on the ETH price and market dynamics will be closely monitored. The entry of a major player like BlackRock has the potential to shape the future of Ethereum and the broader cryptocurrency industry.\n\nFollow us on Twitter, Facebook, Telegram, and Google News"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOS0cwc1JkLUtHeUNIb1hlbjBRdVJyMTNZWTViLUZSdmtIdFBYQ0o3cW11ekVhRnNObWh5ZG8xUEN1MDBTblNwV2JvOW1hQThNTngxRGlmYUdjZ0taUjVSYzBySENEVTBSMlRkTnFIVm5kaFh5NjRBVGQ4N1BwTEtBOWhpcG5Gbk5oYVlWM0duLVhncjZMNXFxTW1YSmRxMGk3WkdpS3lPai1GQ2Z0Z1NYNk11Q2pUR0p4cFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 14:02:53 GMT",
        "title": "Ethereum Forecasted to Reach $5.8K by 2025; InQubeta’s Bullish Forecast Explained - NewsBTC",
        "content": "InQubeta (QUBE) and Ethereum (ETH) are two of the best coins to invest in right now as both projects are projected to enjoy exponential growth in the coming years. Financial firm Finder recently released projections that had ETH prices reaching $5,824 by 2025. The forecast also anticipates prices will reach $14,411 by 2030.\n\nQUBE predictions are even more impressive with some projections expecting prices to grow as much as 100x by 2025 as the new DeFi project opens up access to artificial intelligence (AI) investments with its crowdfunding approach.\n\nEarly InQubeta investors have already earned 130% returns on their capital and they will be up a total of 440% by the time tokens launch on exchanges. Newcomers to its presale can still earn 90% returns on their investment before the event ends.\n\nBest coins to invest in: InQubeta (QUBE) poised to lead altcoins in growth\n\nInQubeta’s blockchain is hosted on the Ethereum network and it enjoys its transparency, security, and functionality. This allows AI companies fundraising on the platform to mint investment opportunities into non-fungible tokens that are sold on its NFT marketplace.\n\nInQubeta’s link to AI and its small token supply at 1.5 billion gives it comparable growth potential to where Bitcoin (BTC) was a decade ago as it helps to advance artificial intelligence by directing capital to companies in the space. Investments in AI have risen exponentially in the past several years and more than $1.5 trillion is anticipated to be poured into the technology by 2030.\n\nAI is on course to shake up the world and it will open new opportunities for investors to earn huge returns on their investments. Governments worldwide are already passing regulations to help limit the disruption the technology causes as it becomes apparent it will be the next major revolution.\n\nMany would say the AI revolution is already moving full steam ahead as some of the most complex AI concepts like autonomous cars and humanoid robots are now a reality. Thanks to InQubeta, investors who don’t have access to mainstream investment avenues can now be part of the AI revolution.\n\nDecentralized finance meets artificial intelligence\n\nSmart contracts, ERC20 coins, and fractionalization come together to create an inventive investment process on the InQubeta network. Stocks don’t exist here, but ERC20 coins (non-fungible tokens) perform the same duties.\n\nThese tokens are made by startups looking for capital and sold on the NFT marketplace to those looking to invest in AI. Some tokens give other rewards like exclusive access to items developed.\n\nInvestment opportunities can be purchased with QUBE on the NFT marketplace and any tokens bought can be resold whenever.\n\nInvesting in InQubeta\n\nQUBE is currently priced at $0.0161 but could reach a dollar by 2025 if its market share reaches $1.5 billion. That’s not some unsurmountable milestone in the cryptocurrency space given the fact that meme coins with no real value or purpose like Dogecoin (DOGE) have raised over $9 billion despite the many issues plaguing their networks.\n\nEthereum (ETH) fails to keep up with Bitcoin\n\nEthereum price charts have historically mimicked BTC charts, but the second most popular crypto hasn’t been able to keep up with its older sibling during its current bull run. Still, ETH prices have risen 34% in the past 30 days and Finder’s projections have prices reaching $5,800 by 2024.\n\nWhile its anticipated growth won’t keep up with QUBE, it will allow investors to almost triple their investment in a few years.\n\nSummary\n\nInQubeta and Ethereum are two of the best coins to invest in right now thanks to their impressive projections. QUBE is expected to see more growth than ETH, thanks to how undervalued tokens currently are, the project’s creative way of advancing AI, and the $1.5 trillion projected to be guided into the space by 2030.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of NewsBTC. NewsBTC does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOdWVmUWxKZHloWHJtR0NDOUwtMlIzVHN0WHQzNE5XbVZDc1R5cm1IN09xRlplQUdnc2hkLVQtbERnajlZMVNuSk81cC1LZGJOQ1loeFZybmNGMmp4VVFEOHctRGlMWmlyWDF3N3lfc3dYRkJBMllhdGdRRDMwcDFua1VMbXFKSGd1Z2tKSzNOb21tYW9V?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Foundation’s Wallet Activity Sparks Market Speculation - Crypto Economy",
        "content": "The Ethereum Foundation, the non-profit organization behind the development of the Ethereum blockchain ecosystem, has been making headlines recently due to significant activity in its wallet. The foundation’s wallet, known as EthDev, has been observed making substantial transactions, leading to speculation about the potential impact on the Ethereum (ETH) market.\n\nRecent blockchain data reveals that the Ethereum Foundation has executed a substantial transaction of Ethereum (ETH). The transaction, which involved the transfer of 1,200 ETH, equivalent to $2.36 million, was directed to the grant provider’s wallet. This information was brought to light by Lookonchain, a firm specializing in on-chain analytics.\n\nThe Ethereum Foundation wallet transferred 1,200 $ETH ($2.36M) to the Grant Provider wallet and 75 $ETH ($148K) to the wallet \"0x180c\" 2 hours ago.https://t.co/124yqXLQ3e pic.twitter.com/WTJuh3T4Qt — Lookonchain (@lookonchain) November 17, 2023\n\nThe Ethereum Foundation Has Been Making Significant Transactions\n\nOver the last month, the designated crypto wallet known as “Grant Provider” has conducted a significant transaction. It has exchanged more than 1,700 ETH, which is equivalent to $2.7 million in USDC, presumably for the purpose of liquidation.\n\nIn addition to the aforementioned transactions, the Ethereum Foundation has been observed conducting other transfers. Specifically, it has moved 75 ETH, valued at $148,000, to the “0x180c” wallet in the recent hours. This information is also provided by Lookonchain.\n\nThe Ethereum Foundation’s recent wallet activity has once again stirred market speculation. While the foundation’s actions are not necessarily indicative of broader market trends, they do provide insight into the strategies of one of the most influential entities in the Ethereum ecosystem.\n\nAs the Ethereum Foundation continues to support Ethereum and related technologies, its wallet activity will undoubtedly remain a topic of interest among market observers. The foundation’s decisions to buy or sell ETH could have significant implications for the Ethereum market, making its wallet activity a key indicator to watch.\n\nThe Ethereum Foundation’s wallet activity serves as a reminder of the dynamic and unpredictable nature of the crypto market. As the foundation continues to navigate this landscape, its actions will undoubtedly continue to attract attention and speculation."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQdEJvbzliTnZsbW10R2xfbXE4N21xS1FVeXFldHhpSWRjS3FuU3RObWFDWkZoSEp3SDVKSFlTZG5CM254NXNSU0xGbmw0d1podjFkMFJ2QWpfeVpQSFROLXJUX2lqSWNtREJlSmZVNThaU1N0S2dyWi0xYl9MVnQ0YTJZbEwtM0lNQnVXSnZxVDA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Fidelity Files for Spot Ethereum ETF as ETH Adoption Surges - Captain Altcoin",
        "content": "Home » Journal Fidelity Files for Spot Ethereum ETF as ETH Adoption Surges Journal Fidelity Files for Spot Ethereum ETF as ETH Adoption Surges Petar Jovanović\n\nTwo financial giants have filed applications this week seeking regulatory approval to launch Ethereum exchange-traded funds (ETFs) in the United States.\n\nFirst came the news yesterday that BlackRock, the world’s largest asset manager with nearly $10 trillion in assets under management, filed an S-1 registration with the Securities and Exchange Commission (SEC) for a spot Ethereum ETF.\n\nAnd now today, Fidelity Investments, another Wall Street behemoth managing over $4.5 trillion in client assets, has announced it too has submitted an application for a Fidelity Spot Ethereum Trust ETF.\n\nJUST IN: $4.5 trillion asset manager Fidelity files for Spot Ethereum ETF. — Watcher.Guru (@WatcherGuru) November 17, 2023\n\nIf approved, both the BlackRock and Fidelity ETFs would give institutional investors and financial advisors mainstream investment vehicles to gain exposure to Ethereum’s price movements, bypassing the complexities and security concerns of directly purchasing and holding the cryptocurrency.\n\nThe filings are seen as bullish signals for the future of cryptocurrency as an established asset class. As Wall Street heavyweights move to launch Ethereum investment products, billions if not trillions of new dollars could flow into the second largest cryptocurrency by market cap.\n\nEthereum was trading around $1,959 at the time of Fidelity’s announcement. The prospect of securing SEC approval for the first ever spot ETFs has buoyed investor sentiment and could help accelerate ETH’s climb higher in price.\n\nRegulatory decisions on the BlackRock and Fidelity ETF applications are pending, but many crypto proponents believe early 2024 could be the period the SEC finally embraces spot Bitcoin and Ethereum investment vehicles. That would unleash a new tide of mainstream adoption and help further legitimize the crypto sector.\n\nJoin and Get 10k Tokens FREE! Sponsored Visit Meme Arcade by FOFAR Now Early access bonuses with 10k $BACON for joining now\n\nEngaging community with games and crypto incentives\n\nIntegrated platform with GameFi and NFT functionalities\n\nSimple interface that’s easy for new users to explore crypto gaming"
    }
]