[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQLTNialN3NDZROGo4Q2R4T1VQcFNkZmVKQk1wN0l3VWdqemdnWmpTTnRIQ3JVSGdwZWxjWjczYVJUajdpMllJSkZ2MUJMOW1Ga1ZzOUlDSUo3X3o5SnJVZDNmaVhtS3ljMU5XSUtLbkViWWY2M2djSjlRNHFCZFB1TS1aZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum, and EigenLayer – A Play in Three Acts - CryptoSlate",
        "content": "The following is a guest post from John deVadoss, the Co-founder of InterWork Alliance.\n\nAct One: From a Crisis, A New Institution Emerges\n\nOn July 30, 2008, the United States Housing and Economic Recovery Act, intended to address the subprime mortgage crisis (which had precipitated the then ongoing Global Financial Crisis), was formally signed. Two weeks later, on Monday, August 18, 2008, the domain bitcoin.org was registered.\n\nBy November 2008, Quantitative Easing was in action, and the United States Federal Reserve had started buying mortgage-backed securities. In January 2009, the code for Bitcoin was released as open-source, and by March 2009, the Federal Reserve held close to two trillion US dollars of bank debt, mortgage-backed securities, and Treasury notes.\n\nSuppose the goal was to beta-test digital currency at scale towards disintermediating secondary and tertiary financial institutions by directly linking citizens and a central bank. In that case, Bitcoin has been a spectacular success, heralding the upcoming era of CBDCs. If the goal were to make the common man conversant with digital currencies and their usage, Bitcoin would have succeeded remarkably.\n\nA revolutionary breakthrough when it was released, Bitcoin is many things to many people: a virtual currency, a new kind of money, a store of value, and the promise of freedom. But, more than anything, Bitcoin is a new monetary institution for the digital age. Bitcoin has demonstrated that digital monetary institutions are the future; it has done its job by moving the goalposts from why to when.\n\nSome see in Bitcoin and its pseudonymous creator(s), a Robin Hood-type legend, a Zorro-like hero, or a populist protagonist standing up against the system. It is not for me to deconstruct the thematic illusions, but as the old adage goes, the truth is bound to make you smile when it arrives.\n\nAct Two: The Rise of a Monolith and its Discontents\n\nBitcoin begat Ethereum, a 21st-century application platform to rival any of Silicon Valley’s so-called enterprise-grade, global-scale platforms. And the Ethereum team did it all in the open, on with a crew of mostly volunteer developers spanning time zones and political and geo-political boundaries, long before working from home was a thing, shepherded by the genius of their founders and core developers.\n\nWhy Ethereum? Contrary to popular perception, Bitcoin is more than an application; it is more than the collection of technical capabilities that comprise the network and certainly more than a token. It is an institution, a self-governing institution. But it is not a platform. Bitcoin, when it was released, had a level of scripting extensibility, but it was not yet ready to enable developers to build new instances on top of it.\n\nEthereum, with its vision of being the world’s computer, set out to create the definitive decentralized platform abstraction, a blockchain with built-in Turing-complete programming support, allowing developers to write smart contracts and to create decentralized protocols, services, and applications. And by any measure, the Ethereum project has been stunningly successful.\n\nProgrammable money, fiat-backed stablecoins, and the digitization of real-world assets are but some of how Ethereum has reshaped the world of monetary policy. Lending/borrowing platforms, prediction markets, and insurance are some of the financial domains in which Ethereum has helped rewrite the rules for historically highly intermediated products.\n\nAs a result of its extraordinary success, scaling has turned out to be a critical issue for the Ethereum project; it is worth noting that its scalability issues result from the project’s prioritization of decentralization and security over scale. Scaling enhancements are anticipated to address network congestion and reduce transaction costs; Ethereum’s gas fee problem has been a recurring theme.\n\nThere are two primary ways to scale the Ethereum network: on-chain and off-chain. On-chain refers to enhancements to the base layer and modifications to the network. Off-chain refers to the use of a separate network(s) (so-called Layer 2) to process transactions; Layer 2 networks may choose to emphasize scale over decentralization and security as they can benefit from the base network’s strengths in these areas.\n\nNow, here is where things became very interesting. The so-called “on-chain” proponents appear to be reluctant to let go, while the “off-chain” exponents appear to be eager to innovate. This is the classic saga of a maturing platform: how much loose coupling? How much composability? And on the other side, how much to enshrine on-chain before it becomes a net detractor for innovation?\n\nFor obvious reasons, Ethereum does not want to end up primarily as a reconciliation ledger for other Layer 2 networks and roll-ups, but at the same time, a monolithic approach imposes limits on a platform and its ecosystem and impacts a platform’s ability to continue to grow its developer base. Things came to a head when Ethereum did its Merge update to Proof of Stake from Proof of Work.\n\nTrust is now a facet of staking and not mining anymore; was the value now more in the tokens and with the stakers? Or did it still lie in the underlying capabilities? And for how long? Could they be swapped out with newer, more innovative capabilities? And this leads to Act Three.\n\nAct Three: A New Economic Platform Advances\n\nEthereum begets EigenLayer, a first-of-a-kind economic platform.\n\nIn retrospect, it may appear linear, but it was genius, a first-class paradigm shift. The world may not be different with a change of paradigm, but the developer now works in a different world as they say, with a new mental model. We will look back and see a distinct transformation between decentralized applications in the Pre-EigenLayer era and those in the Post-EigenLayer era.\n\nAnd it was the Merge, with the shift to PoS that enabled EigenLayer to reframe the decentralized application model; PoW has no notion of negative incentives, but with PoS, while validators may earn rewards, their stake may also be slashed for misbehavior. With the advent of PoS, EigenLayer is able to programmatically bootstrap and scale Ethereum’s trust model to guarantee economic security for a host of new protocols and services.\n\nDevelopers can secure their services without the need to create their validators, or to launch tokens, etc. The promise of loose coupling can now be extended to economic abstractions by creating markets for decentralized trust. A fascinating three-act play thus far, it remains to be seen what act four portends.\n\nJohn deVadoss is a co-founder of the InterWork Alliance, and he serves as on the Governing Board of the Global Blockchain Business Council."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOVmFNSThMd2ZpamUzS2dNNy1Sd3ZXekFOZG1mWm8tY1Rnb1dNM1c0S0xPMmlTNnVUUXM2dm00aHBGcElVbVhDcDFrX1BzZUJZNzdNbGdvT1BVNlR4dUg5U005WURjQ1NEV1FkVGdROEszRXJMRjR0MXlMT3IzQ19wZkxsTjVJbXJuREZMLWhUQnpDRzNLT3hLV2ZSYV9SSHpSRjZOZ1A2ZTlUWHFZNF9FbHcwMy1aUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Exclusive: NY financial regulator approves Paxos expansion to Solana, allowing for its first stablecoin issuance beyond Ethereum - Fortune",
        "content": "The leading stablecoin issuer Paxos has received regulatory approval to expand its products to the Solana blockchain, which it plans to launch on Jan. 17, 2024.\n\nWith peers including Circle and Tether vying for critical market share, the expansion is a major step for Paxos, which touts its relationship with the New York Department of Financial Services (DFS).\n\n“Paxos is the most regulated stablecoin issuer in the world,” Walter Hessert, head of strategy at the firm, told Fortune in an interview. “We are the only company that has been issuing regulated stablecoins at scale—period.”\n\nStablecoin wars\n\nCofounded by financial veteran Charles Cascarilla, Paxos became the first crypto firm to receive a trust charter under the new digital asset regulatory regime implemented by DFS in 2015. To this day, DFS remains the sole U.S. financial regulator to implement a comprehensive framework for crypto, which has attracted a number of leading companies, including Coinbase and Gemini.\n\nPaxos received DFS approval to issue its first stablecoin in 2018, which it called Paxos Standard, rebranding the token to USDP in 2021. Stablecoins are a type of crypto token pegged to an underlying asset—in this case, the U.S. dollar. Unlike the other leading USD-pegged stablecoins Tether and Circle’s USD Coin, Paxos only issues USDP on Ethereum owing to restrictions from DFS.\n\nPaxos has argued that its commitment to working directly with DFS on issuance, rather than operating outside the framework of a financial regulator, sets it apart from competitors. While Tether is often critiqued for its offshore, opaque operations, Circle also presents itself as following U.S. regulatory standards, although it does not issue USDC under DFS supervision. As a result, Circle offers USDC across more than a dozen blockchains, including Tron, which has come under fire in recent months for facilitating illicit finance.\n\n“From a growth perspective, you’d like to issue across every single chain,” Hessert said. “Circle and other players can issue on to other protocols, but no one knows who’s overseeing it—or what their process is.”\n\nHe argued that Paxos’s approach helps gain trust with its partners, including major financial players like MercadoLibre, PayPal, and Mastercard, that customer protections are in place.\n\nEven so, Paxos has had its missteps. One of its first stablecoins, BUSD, was issued in partnership with leading crypto exchange Binance. After reports surfaced that Binance was creating a synthetic version of the stablecoin with questionable reserves, DFS ordered Paxos to stop issuing the token. As Fortune later reported, over 95% of Paxos’s revenue came from that partnership.\n\nHello, Solana\n\nPaxos received a “non-objection” from DFS to expand USDP from Ethereum to Solana, after what a spokesperson described as an “extensive and exhaustive review,” although the firm declined to specify how long the process took.\n\nWhile Hessert declined to say what type of information DFS required for the Solana expansion, citing the confidential supervisory process, he said it involved an internal risk framework built by Paxos to assess the blockchain and its processes, including its compliance protocols.\n\nFirst launched in early 2020 with the promise of increasing transaction speeds and reducing costs compared with Ethereum, Solana became one of the most popular blockchains before taking a major hit last year owing to its association with Sam Bankman-Fried. While its native token, SOL, is still far off from its all-time high of about $260, it has gained substantial traction over the past month.\n\nHessert said Solana’s speed and cost relative to Ethereum will make it an attractive option for Paxos’s partners, who aim to implement stablecoin in use cases from cross-border remittances to payments for goods and services.\n\n“We’re actually going to start to see this new wave of adoption be enabled in ways that we haven’t seen in stablecoins yet,” he told Fortune.\n\nFor now, Paxos’s highest-profile project is its new stablecoin PYUSD, issued in partnership with PayPal. Hessert said he imagines that firms like PayPal will want to expand to Solana. Paxos’s first Solana-based offering will be USDP, which has a market cap of just $370 million, compared with nearly $25 billion for USDC and nearly $94 billion for Tether.\n\nA spokesperson for PayPal declined to comment.\n\nHessert said Paxos hopes to gain approval to issue stablecoins across other layer-1 and layer-2 blockchains, although he declined to provide specific examples."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9UTlJJSTJPQ3lRSkpCNVFMVXZzUHVyajFyZzJqU1RmZy02NmVyc3FqWk56ZnVMelhOak13RFhGelhyNWFEeVdYLXFWWjRadHA4LThKRzQ0T1BJUGkyanp3Ym1UNlJzU0dtcUFFay0yOHBQVHUtZFNKQ2Vn0gF_QVVfeXFMT3R3dE4zVlY5LXdPTUl3NnhENHJ3ZEFvSzZZWldfaDBGdnEwMkk4RTlJUmpBT1NRSUNycU1tQXQ5VWRoWEdNVWxJOVZxTWhwZ0dwTWNYbVJXZTUydnV2dVZUZksyRTE4R3hLcU9wZXlORmV4bC1OdXVYaHB3YlpSWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price About To Bloom As ETHE Discount Rapidly Close: ETH To $3,500? - Bitcoinist",
        "content": "Ethereum (ETH) prices have been languishing below the $2,500 mark despite the strong performance of other cryptocurrencies like Solana (SOL) and Cardano (ADA).\n\nTaking to X on December 22, the CEO of Lumida Wealth, Ram Ahluwalia, has offered a theory on why ETH prices are likely to recover and reverse losses, possibly outperforming the world’s most liquid coin, Bitcoin (BTC).\n\nETHE Discount Rapidly Closing\n\nTo illustrate, the CEO pointed to the ETHE chart, whose discount has been steadily closing over the past few trading months. Ahluwalia observed a 4% gain on December 22, further reducing the discount.\n\nBased on the CEO’s analysis, this development suggests that institutional investors, most of whom chose to buy the regulated ETHE product by Grayscale to gain exposure in a regulated manner to ETH, are now opting to buy ETH on the spot market, not through a derivatives product.\n\nThis shift from ETHE to ETH spot, Ahluwalia added, could be explained by the “cheapest-to-deliver” contract theory. In the derivatives market, this theory states that a derivatives product like ETHE is the cheapest way for institutional investors to gain exposure to the underlying asset, in this case, ETH.\n\nThis is because the derivative in question, ETHE, is a futures contract that tracks the price of ETH via a regulated exchange, in this case CME.\n\nWill Capital Flow To Spot Ethereum And Lift ETH To $3,500?\n\nTherefore, based on this theory, the CEO continued that it is likely that as the ETHE discount closes, marginal flows will go to the ETH spot to capture the staking yield. For this reason, institutions are not likely to pour more funds into ETHE since “big gains” are done.\n\nAs a proof-of-stake (POS) project, users can stake ETH, helping secure the network, and as compensation, Ethereum distributes a yield of around 4.3% to validators. These operators must lock at least 32 ETH to validate a block of transactions and earn block fees. Since they have to stake, they also earn a yield.\n\nAs of December 22, there were over 28.6 million ETH staked, with the reward rate or yield at 4.32%, according to Staking Rewards. Considering how staked amount and yield are correlated, the more users choose to stake physical ETH, the lower the reward rate, or yield, is.\n\nThis dynamic will now come into play as ETHE discounts close and institutions or big players rotate funds into ETH via the spot market, possibly lifting prices.\n\nLooking at the ETH price action in the daily chart, buyers have the upper hand. However, a comprehensive close above $2,400 could lift ETH to $2,500 and later to $2,500 in a buy trend continuation pattern.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPbVpJU01aMklxc2xHUzI4ckJUdGpnVHJtLTRra3FZelZXczlTQlBCOTFySXZ2Ti1zNmhtSTVDSTFZeTlRSDNOZlZyWEdzQUJabU1sSU1Cem1JZHpROTVLRG45eEhuUkg4OHBFTEFvNDdLSDNTWUUza0lfZDVpZTBHaXdJbHVwcEpIVUdNLW1pcHNoa0REdzBzckU1Um5FR050WUJBY3o1cDNUbEtHLTYxd1U2aEtIZGQ0cUHSAb8BQVVfeXFMUHlUODh1WXNCMjlkeHZmbDlqdVFZQmxDYWN1am5ueVZlMjg1UHFVMWJEVEtFa2x4NU11M2pmdVRmMzNILTRObnAyTkV1ZXhoR2hQcnJLMlNMX3NqTVp6UEM1S1BJUmFWbUZLczNsVWQ0T3hJUmV1Mi1qcHVtTzFLeExHNU1GdS05c3hqdkYwYS1ZOU5GWF9kYjZQTk9ZZUlzZzRHTEdteTk0Y3U2UUpxbU1mM295YnN5Q2lndHNROVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum price could crumble under rising selling pressure - FXStreet",
        "content": "The dates are subject to change if any unexpected bugs are discovered by developers. In the recent All Core Developers Consensus (ACDC) call, devs agreed to reconvene to discuss progress in the next meeting on January 4.\n\nBased on on-chain data from Santiment, Ethereum supply on exchanges as a percentage of Ether’s total supply climbed from 8.07% to 8.16%. The increase in ETH tokens on the exchange platform is significant in comparison to the past three months, seen in the chart below. Mounting selling pressure could push ETH price lower.\n\nEthereum supply on exchanges noted a considerable increase between December 21 and Saturday. As ETH reserves in exchange wallets climb, there is more Ether available to sell, typically increasing the selling pressure on the altcoin .\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNRHBJei13dThNTno0SE9zUzNPbEhiZm9heF95R3Rkazl2T29QckZud0ZodGdCeXFTbHNSOGYwa1AzdUMxXzRoMUxfZ19NMkVxa2xDd2h0bWl1QjV4RWtaQTVxUmNrRk12dVY1cTlHWUFXdWtiTkFFeEFDLWlERXFHQzZTaWdsTGlMRmRzalp0Y2RnMzlXYzZZZ0VHSEI3WU5xZXRKZjF2dFlHZEZPUG9LbEQxbHFQMGNNRzg5c2xpWjJXSF8zVzh0ODRVY2l4VkRWa2kyZGIzcHrSAd4BQVVfeXFMTmlPWXkwZ0tsbjZva3V0S2IxSFBVbVFlTHJHTmMyUXRXNVZ5RFZ4SXNIcXFwOEtydV9nQ2NJV1htR2Q4RHFHSTQxakZ3TGI0R3M4Y21Od1BzOFFsdnJIT29fNXd1dWZCTHk2QWE3elFxSkZ6aV9IUVo3cDdtUExzYnNUaXhVRDJxWDdERnhoWFZqQTZzLTNXYzdTTVRyQmdiOERIUVVVVHNCeFViSzJ0SUVPdnhROVhSTGZoanZnbXMwaWt2aTl5WnNLZUZLajc2WkkxaVBBZW5LMlB6a3FR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum, Shiba Inu and One Altcoin That’s Exploded Over 250% in Two Months Flashing Bullish Signals: Santiment - The Daily Hodl",
        "content": "Cryptocurrency analytics platform Santiment is naming three digital assets that it says possess long-term bullish prospects.\n\nSantiment says that Ethereum (ETH), Shiba Inu (SHIB) and the artificial intelligence-focused crypto project Fetch.ai (FET) are witnessing a reduction of the supply held on exchanges by their top 10 holders.\n\nAccording to Santiment, the moving of the three crypto assets by the respective top 10 holders from exchanges is a “bullish long-term signal”.\n\nThe crypto analytics platform says that in the case of Fetch.ai, the top 10 largest wallets have reduced their FET holdings on exchanges by 26.1% in the last three months. The top 10 holders of Ethereum and Shiba Inu, on the other hand, have cut their holdings on exchanges by 4.3% and 2.7%, respectively, over the past 90 days.\n\nEthereum is trading at $2,306 at time of writing, while Shiba Inu is changing hands at $0.0000106. Fetch.ai is priced at $0.729 at time of writing, up by 259% from its October 23rd price of $0.203.\n\nEarlier this week, Santiment said that the supply of Ethereum on exchanges had reached a new low since the official launch of the second-largest crypto asset by market cap.\n\n“As Ethereum’s market value hangs just above $2,170, the largest exchange wallets continue to move coins into smaller wallets or off exchanges entirely. 240,000 ETH has been collectively moved from these wallets in 24 hours, a 2.99% drop in coins held.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNaUUxeTN1LV9BbVc2MjBjOE55UkJkYUJFUVBwdWI2eTVweDNVblZLdzV1Z0N0RHpLZThtUVNQRkZEdE1DYmQwTlh4T0FVQmhXN05JYmdqSGhmczBXRHROUGlibDBqYXk0S1I2ZGJkYkY2dVNQRjZuaHExNDVZRVRZc3prR01Fb21kQWI40gGQAUFVX3lxTE8yRTZLcjVSUXUyMmxMMGVRVnMwNUxZR1dsa2FMN194MGkza0Q1ZVk2VlZOaUtNa1Y0d1d4ME5UTjFxNkxlOGRoVURaUGNTYkVCMDlWbDludEZJSEI3ZVVBams1RWR6YnVTczBGc0U1MGhSc2hXYVRWZlpITFh5dTl5U0FZZ3ltWGRBYk82V0k1cA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum’s Dencun upgrade set for launch in 2024, details here - AMBCrypto News",
        "content": "Ethereum developers target January for the first testnet deployment.\n\nProgress made on the network increased, gas usage surged.\n\nEthereum [ETH] developers intensify testing for the upcoming Dencun upgrade, a significant milestone anticipated next year, introducing increased data storage capacity through the implementation of a process termed “proto-danksharding.”\n\nMore updates and upgrades\n\nIn a biweekly call on 21st December, developers revealed their target date of 17th January for the Goerli test network to undergo the Dencun upgrade, to enhance layer 2 rollup efficiency and expand blockchain scalability.\n\nTim Beiko, protocol support lead at the Ethereum Foundation, noted the possibility of cancellation in the event of major issues before the set date.\n\nLast 2023 AllCoreDevs call about to kick off ? Agenda: https://t.co/jVzStnpnmZ\n\nStream: https://t.co/pT6x13i7nD Will recap here later today https://t.co/YDWpJbtOma — timbeiko.eth ☀️ (@TimBeiko) December 21, 2023\n\nMoreover, the Dencun upgrade, initially slated for Q4 2023, was rescheduled to 2024 due to the intricate engineering aspects. Developers outlined a tentative timeline for Dencun testing, intending to run through Sepolia on 31st January.\n\nNew folks, new forks\n\nAdditionally, the Goerli Shadow Fork took place with a network configuration involving 300 nodes distributed across North America, Europe, India, and Australia.\n\nThe fork proceeded smoothly, and post-Dencun, the network achieved a 99% participation rate. The term “participation rate” refers to the percentage of nodes that successfully adopted the changes introduced by the fork.\n\nOnce stability was established, teams initiated a network spamming exercise with blobs, aiming for an average of 4 per block, but the network stabilized around 3 as planned.\n\nThe introduction of blobs increased the network’s bandwidth usage by approximately 200 kbps, shifting from an average of 700 to 900 kbps.\n\nNotably, 95% of blobs propagated in less than 2 seconds, with an average propagation time below 500 milliseconds.\n\nHow is ETH doing?\n\nThe news is likely to boost confidence within the Ethereum community. Moreover, it could potentially attract more users and projects to leverage the upgraded platform.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nAt press time, ETH was trading at $2,315.75 and its price had grown by 4.15% in the last 24 hours. The overall interest in the network remained high during this period.\n\nThis was shown by the consistent gas usage on the Ethereum network. Coupled with that, the overall NFT trades occurring on the Ethereum network had also grown."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQeG9oUlpidWFtNkJHQ3VybXZxZHQtR00yQWpEZXViZExLaTJ0MlFScWFpYlM5SXdDQ2U2aHZXZWFYYTlBTmFhUzZMZUZuQ1Z2cmR3Qzh6V2FVTnpRX2s5OHNoTUllem9nSHRoZG0wSVVCZzVfYlNkX0tnZkE0S0NMVXlLNDBWOVN4QnlkSWZmQ3lwaVVQcnNnQzhoSG1SLWRwakp3RHZpYjFrNllxT1lEZWVKYVdZeWFTc2RsLXdKUVhCQWo0NEZEbnBpZmg5T3JZQUVxWjFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Hashnote e Lido danno il via ad una soluzione di crypto staking liquido su Ethereum per gli utenti istituzionali - The Cryptonomist",
        "content": "Hashnote, a Miami-based technology company focused on institutional investments, has just launched the stETH Fund: a regulated fund that allows for compliant and transparent participation in Ethereum’s liquid staking by leveraging the renowned Lido platform.\n\nHasnote acts as a gateway between clients who are looking for security in the investment world and a fund manager regulated by the CFTC.\n\nThe birth of this particular product reflects the increasingly growing demand from users who want to enter the crypto world, particularly in the liquid staking of Ethereum, without having the necessary skills to face the challenges of decentralized finance.\n\nIn the meantime, other investment solutions in Lido and other more complex LSD platforms are also emerging, mainly dedicated to more experienced individuals.\n\nLet’s see all the details below.\n\nHashnote launches stETH Fund and opens up to investments in liquid staking of Ethereum based on Lido\n\nYesterday, the on-chain financial technology company Hashnote officially launched the stETH Fund investment product which allows investing in liquid Ethereum staking through a regulated fund that relies on the LSD Lido Finance platform.\n\nThe goal of Hashnote is to merge the transparency of the blockchain world with its ability to comply with the requirements of US market supervisory bodies such as CFTC, offering a crypto investment solution primarily to institutional clients.\n\nThe Miami technology company has noticed how liquid staking on Ethereum has been growing steadily for several months, able to incorporate about 24% of the total ETH supply on the market, and has decided to strongly focus in this direction with a regulated fund.\n\nstETH Fund is built on the decentralized liquid staking middleware open-source Lido, which represents the undisputed leader in this niche sector.\n\nFor investors who rely on this product, there are multiple advantages:\n\nReliability: the product has been designed to meet the highest standards required by institutional investors;\n\nthe product has been designed to meet the highest standards required by institutional investors; Compliance: Hasnote is regulated by the Commodity Futures Trading Commission (CFTC) as a CPO and its funds are registered with the Cayman Islands Monetary Authority (CIMA) as mutual funds. Furthermore, the offered structure is compliant in terms of KYC/AML, providing a compliance front also for the verification of the participants’ identity;\n\nHasnote is regulated by the Commodity Futures Trading Commission (CFTC) as a CPO and its funds are registered with the Cayman Islands Monetary Authority (CIMA) as mutual funds. Furthermore, the offered structure is compliant in terms of KYC/AML, providing a compliance front also for the verification of the participants’ identity; Safety: Hashnote Smart Contract Vault is managed by MPC (multi-party computation) wallets and is impervious to cyber attacks. The whitelist of client/wallet addresses is maintained and enforced by the proprietary smart contract of Hashnote. The smart contract code is audited by third parties;\n\nHashnote Smart Contract Vault is managed by MPC (multi-party computation) wallets and is impervious to cyber attacks. The whitelist of client/wallet addresses is maintained and enforced by the proprietary smart contract of Hashnote. The smart contract code is audited by third parties; Maximized earnings: the investment in stETH Fund is characterized by maximizing the yield obtained on Lido. This allows for liquidity while staking Ethereum;\n\nthe investment in stETH Fund is characterized by maximizing the yield obtained on Lido. This allows for liquidity while staking Ethereum; Easy to use: the reference interface is easy to use, intuitive, and allows effortless monitoring.\n\nAmong the other features of the regulated fund of Hashnote that invests in liquid Ethereum staking supported by Lido, we see the possibility of a T+0 refund, made possible by the breadth of the portfolio managed by the provider and a redemption with zero slippage in the unstaking process.\n\nIn addition, stETH Fund does not have any financial leverage, making it a less risky product compared to other similar derivatives.\n\nFinally, we must mention the minimal risk of the DeFi protocol Lido, the automation of compounding rewards, the diversification of node operators staking on Ethereum, and a smooth and efficient operation.\n\nThe state of the crypto LSD market on Ethereum: increasingly innovative investment options\n\nSince the “Shapella” update went live on Ethereum, opening up the possibility for chain users to unstake previously locked ETH, liquid staking platforms like Lido have started to see increasingly growing numbers.\n\nCurrently, all LSD applications hold a total of over 12.03 million ETH locked on the beacon chain, corresponding to approximately 26.827 billion dollars.\n\nThis data corresponds to almost 42% of all Ether staked in Ethereum 2.0 contracts.\n\nLido in particular is the undisputed leader in liquid staking and accounts for about 76% of this market niche, in addition to holding the record for the DeFi protocol with the highest TVL of 20.37 billion dollars.\n\nFollowing are names that boast a significant percentage of ETH in this context, such as, for example, RocketPool (8.77%), Binance Staked ETH (6.46%), Frax Ether (2.56%), Coinbase Wrapped Staked ETH (1.62%), Mantle Staked ETH (1.26%), and StakeWise (0.79%).\n\nThe success of this type of platforms is due to several reasons.\n\nFirst of all, liquid staking offers a convenient solution for those who intend to hold ETH but also want to simultaneously earn a yield and use parallel liquidity for crypto exchanges.\n\nSecondly, the ways in which the liquid tokens of these protocols, such as stETH, wstETH, frxETH, and many others, are integrating with other DeFi dapps offer significant advantages to stakers who can sometimes benefit from double yield.\n\nFinally, there is also a “convenience” speech since many LSD projects have announced or hinted that they will reward their users who have used Ethereum’s liquid staking with an airdrop.\n\nIn this regard, a few weeks ago the layer-2 Blast, which integrates the “native yield” formula and relies on Lido and MakerDAO, reached a TVL of over 920 million dollars, demonstrating all the interest in this sector.\n\nThere are also many other smaller platforms that have still managed to cover a good percentage of all the ether locked in LSDs: among these we find EigenLayer, Swell, Kelp, Morpho, Diva Staking, EtherFi, Mev Staking and many others.\n\nThe Twitter user “Olimpio Crypto” has created a collection of all these dapps that still do not have a native token and will probably launch it through an airdrop."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPM1V6RVJZem43OW9TTklGeGRhMUFfYlgxUVE1aVdsR2FSd2JJZ2lLVFdaVlBxSGJya2Y5dnV2Um1pQVJOX1M0WUoyRzhWNWRmdVN2TkxLeEVGU2V6UUxmbVlCN2FrWkJzMDRBTkNqT0FzRElxbkxDMFVyeW5rTWRYVlBhT1dmdS1J0gGOAUFVX3lxTFA0cUVNZTVEaVFTejhyMmZla2w2MGJnQnFRNTNWWElKY1J4UmwwbEZXejlab1pwWV85LWp2V0hxLXpzR0U3dkFKcHpMMTFTeVROZU42c3ZXZXZMc3Z4eUl5Nl9ucVlXTnJXeHk2eEp3NzI5TzhMLUYtLVRqLVJPeFJJZmtIcEpfRXhmQUFCOXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "'Narrative Shift Away From ETH': Investor Justin Bons on Non-EVM L1s - U.Today",
        "content": "Advertisement\n\nIn Q4, 2023, the cryptocurrency segment is going through \"awesome\" processes as mainstream narratives are moving toward truly scalable L1s, a seasoned cryptocurrency expert says. Did EVM L2s fail to deliver on their promises?\n\nSOL, AVAX, NEAR, EGLD: Justin Bons indicates \"narrative shift\" and L2s' failure\n\nThe blockchain sphere is witnessing a major \"narrative shift\" nowadays. Instead of Ethereum (ETH), all eyes are on its L1 competitors, Cyber Capital CIO Justin Bons says in a recent X post.\n\nScalable first-layer blockchains like Solana (SOL), Avalanche (AVAX), Near Protocol (NEAR) and MultiverseX (formerly Elrond, EGLD) are beneficiaries of this shift.\n\nAdvertisement\n\nThis process is validating Ethereum's (ETH) strategy to bet on Layer 2 solutions (rollups) as a core scaling instrument, Bons concluded.\n\nAs a result of this shift, the \"blockchain trilemma\" may have finally been solved. As covered by U.Today previously, in his earliest statements, Bons appreciated the scaling opportunities of Tezos (XTZ) and The Open Network (TON).\n\nThe Cyber Capital CIO is an adamant critic of the current state of Bitcoin (BTC), Ethereum (ETH) and its L2s as well as XRP.\n\nNew Solana (SOL) summer catalyzed by retro airdrops?\n\nAccording to his views, these assets lack security and decentralization. Also, he stressed that a blockchain should make its L1 scalable instead of relying on rollups and sidechains.\n\nSolana (SOL) as a dangerous Ethereum (ETH) competitor is yet again in the spotlight for analysts in December 2023. As the blockchain exceeded Ethereum (ETH) in DEX trading and NFT sales, experts recall its 2021 rally to three-digit zones.\n\nAt the same time, the interest in Solana (SOL) is triggered by the activity of retroactive airdrop farmers. Inspired by Jito Network's (JTO) generous rewards, they are completing tasks to be eligible for Jupiter, Orca and other potential airdrop campaigns expected in Q1, 2024."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9IcldoY2otUkNwQ3BnRkRpeEo0TWhJbnNDNG1wSVcxRXozWFIyXzNQSzcwLUR2YzJ4RnRKSk1nQ25oX2hqUlhSZUxENUlDQlk5YlJfM015TkxucURMOWc3N003aHR6alczT2stRFBZZU8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin leaves the rest of the crypto market behind - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Fintech myFT Digest -- delivered directly to your inbox.\n\nHello and welcome to the final edition this year of the FT Cryptofinance newsletter. This week, we’re looking at the digital coin that bitcoin is threatening to leave behind. We’ll be back on January 13th.\n\nOne common — and not always unfair — criticism made by crypto enthusiasts is that the wider world conflates bitcoin and cryptocurrencies.\n\nIf the subject comes up over Christmas, chances are family and friends will use the two interchangeably. In their minds bitcoin IS the crypto market. Yet people working around it, or even have more than a passing interest, know there is much more going on.\n\nRight now, bitcoin is in a happier place than it has been for 18 months, supported by speculation that the SEC will approve a bitcoin exchange traded fund after Christmas. But the rest of the market doesn’t quite have that same warm fuzzy feeling.\n\nA large chunk of “the rest” is ether, the second largest cryptocurrency on the market, because of the blockchain it represents, ethereum.\n\nEthereum has always been a more ambitious project than the bitcoin blockchain, which is a database for transactions. It can hold assets and lets programmers code functions for buying and selling into smart contracts. That means it is the foundation for so much of the industry’s non-bitcoin activity ranging from decentralised finance (DeFi) projects and NFTs to gaming.\n\nHistorically, these markets have given ethereum a unique position of strength over competing blockchains: if one sector of the industry explodes, so should ether.\n\nBut while ether has climbed a respectable 93 per cent this year, it has underperformed bitcoin (up 162 per cent), Solana (up over 550 per cent), and Cardano (up 154 per cent).\n\n“This year ether has been totally outshined by the excitement related to bitcoin,” said CK Zheng, co-founder and chief investment officer at crypto hedge fund ZK Squared Capital.\n\nFor ether, the problem is that these cutting-edge crypto projects, like decentralised finance, NFTs and gaming — the ethereum network’s bread and butter — still haven’t shaken off their past.\n\nProjects like DeFi crypto exchange Uniswap have yet to generate any mainstream buzz, crypto-inspired games like Axie Infinity are today synonymous with North Korean hacking exploits, and NFTs have only recently made headlines for blinding party goers in Hong Kong.\n\nAs far as the non-bitcoin crypto market is concerned, the coins that have performed best this year are the ones exploring the links between crypto and artificial intelligence.\n\n“The demand for AI investments has found its way into crypto,” said Ram Ahluwalia, chief executive at investment adviser at Lumida Wealth Management. “Crypto tokens linked to AI have emerged as one of the strongest crypto investing themes,” he added.\n\nWhether there are overlaps between crypto and AI is a theme for another day. For now, they are the kingfishers catching the sunlight. “It’s not surprising to see the far superior returns of AI-related tokens compared to other tokens,” added Zheng, adding that these tokens will be “the most exciting theme going into 2024.”\n\nBut ethereum’s lacklustre year behind bitcoin is not all down to being superseded by the latest tech hype cycle. US regulators are still pursuing cases that could end up defining ether and other crypto tokens as securities.\n\nAnd ethereum also has to face up to its own disappointments. In September last year the network underwent a supposedly revolutionary surgery with the “Merge”. It was a technical operation, blending one ethereum blockchain with another, but came with big promises.\n\nBefore the Merge, if the ethereum network were a country, it would have ranked in the world’s top 35 by energy consumption, surpassing nations like Belgium and Finland.\n\nThe Merge virtually eliminated the network’s carbon footprint, and when I dedicated 2,500 words to ethereum’s supposed revolution, everyone I spoke to told me it was the removal of the biggest obstacle to mainstream adoption. Ether would even come on to the radars of ESG-conscious investors.\n\nIn fact, the anticipation for a record-setting future was so intense that YouTube’s former head of gaming Ryan Wyatt told me that crypto could soon focus on “onboarding the next billion users.”\n\nBut the price of ether fell in the months after the Merge, and while it has recovered, those billion users haven’t materialised.\n\n“If the expectation was that the Merge would boost investments from ESG-minded investors I think that expectation would be premature,” said Alex de Vries, co-founder of Digiconomist, a website that tracks the environmental impact of the crypto industry.\n\nInstead, ether is at risk of being eclipsed by bitcoin. At the time of the Merge, bitcoin’s market capitalisation represented roughly 40 per cent of the entire crypto market and ethereum’s share was 18 per cent, according to industry data aggregator CoinMarketCap.\n\nToday ethereum accounts for 17 per cent while bitcoin’s share has expanded to 52 per cent.\n\nIf conversations with family and friends this Christmas do veer down the cryptocurrency road, good luck in explaining it. And even better luck in explaining how it’s not all about bitcoin.\n\nWhat’s your take on ether’s future? As always, email me your thoughts at scott.chipolina@ft.com.\n\nWeekly highlights\n\nEarlier this week failed crypto exchange FTX settled with its debtors after its collapse in November last year. The agreement, subject to the approvals of the US bankruptcy court and Supreme Court of The Bahamas, will pool the assets of the FTX debtors and exchange’s Bahamian unit to ensure customers receive “substantially identical relative distributions.”\n\nETF speculation heated up yet again this week when BlackRock — the largest asset manager in the world — disclosed in a fresh filing with the Securities and Exchange Commission that its proposed fund would only allow new shares to be created with cash, instead of bitcoin. The move, while hardly groundbreaking, was taken as yet another sign that the Wall Street giant is making headway with the regulator.\n\nSoundbite of the week: A big freeze from the BVI\n\nRemember Kyle Davies and Su Zhu, founders of collapsed crypto hedge fund Three Arrows Capital? Sadly the courts won’t leave them alone to continue painting and surfing.\n\nA court in the British Virgin Islands this week issued a worldwide freezing order hitting over $1bn of their assets. The order also goes after Kelly Chen, Davies’s wife, representing the latest effort by the liquidators to return assets to creditors of the collapsed business.\n\nThe order turns up the heat on the disgraced founders by closing as many possible avenues available to access funds. Zhu was imprisoned in Singapore in September for four months for failing to co-operate with investigations into Three Arrows’ failure; the whereabouts of Davies remains unknown.\n\n“The order is specifically designed to prevent the founders and Ms Kelly Chen from disposing of or otherwise dealing with assets in any way that might frustrate eventual enforcement by the liquidators.”\n\nData Mining: Tether’s Christmas naughty list\n\nLast month Tether, the company behind the largest stablecoin, signed up the US Department of Justice, Federal Bureau of Investigation and the US Secret Service to help prevent illicit use of its USDT token.\n\nUnsurprisingly the number of blacklisted Tether wallets has shot higher. Total numbers of banned wallets are up 20 per cent to 1,236 so far this month, according to CCData.\n\nFT Cryptofinance is edited by Philip Stafford. Please send any thoughts and feedback to cryptofinance@ft.com."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxOMlZ0dC1iUmp6S21XemVhV2EwdlpQbER1bERnZzBEdDFuV1VjMEVjOEpkTGJUaHRtQ1VqY0ZGaVhJbFpVUV93M09kX19JOHp3Nkp5QWhLUEtmZGhuN2JUN1NrMHFfdW1EaUc0dWRsRlNQc3ZleXZXbjlMX1BBNVdCRmcyd2I4OFpQMG1OelJ1M0NrZ3NTNHJSWW1FLXA3SlFzT1BIb0FMU3c3Rl84MlN4QWUzZHlRTTA1VjFXMmVUV1RSSVRqaTBJMTVlV2l5VjBvMG9TczFxdVNaV21iUHFr0gHkAUFVX3lxTE5YU1dOWXFTSENlV3YzM0FjMmJ6YXB2ZzItUU5PaHhJU3ltR05PWGJuOElQeklBX0g2U2VYejJVNEVXUnVoTUNhTnFVamJWREw1TFFyVWF4UDFEbWd1ZjVBT3BtU1lBS25GcUhFcUFpNFFEMDBPYzVmYXMwZnpZUG43Z1gwOU5DaGZyN1pjSWxtNTI5UXRqSEhONllOMWZHc2FsQVRNdjRSbklqQkVpNnlPbElXLVdWZUJyNVdhRUE5a2ZjdlJMSUZqalF1a2o2OGIyWW1McHdOSFZHNXNscGktTncyYQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Ethereum could surpass $4,000 in 2024, propelled by Bitcoin spot ETF and sharding - FXStreet",
        "content": "Ethereum price rallied by over 85% in 2023 – a similar increase in 2024 places the target above $4,000.\n\nSpot Bitcoin ETF approval will be a key catalyst for a price rally and also set a precedent for ETH ETF approvals in Q2 and Q3 2024.\n\nEthereum mainnet is expected to undergo the sharding upgrades, starting with Dencun, which will introduce proto-danksharding.\n\nInvestors and traders alike are anticipating ETH price to rise in order to book profits before Q2 2024.\n\nEthereum price increased considerably in 2023, recovering about a third of the crash from December 2021 to May 2022. However, the remaining two-thirds of this crash is expected to be recovered in 2024 owing to multiple factors.\n\nETH investors have a lot to look forward to throughout the year as events such as spot Bitcoin ETF approval, Dencun (sharding) update, and spot Ethereum ETF decision will be taking place, which are expected to be bullish catalysts. However, the lack of institutional investors' interest might act as a barrier to this growth and keep ETH from reaching $4,000.\n\n2024 Fundamental outlook: Ethereum price to witness growth from spot Bitcoin ETF approval\n\n2024 is expected to kick off the bull run that the crypto market has been waiting for since June 2022. Ethereum price, along with the rest of the market, is set to witness bullishness owing to one single factor – the approval of spot Bitcoin exchange-traded funds (ETFs).\n\nOver a dozen investment fund managers, including the likes of BlackRock, ARK Invest, and Fidelity, have applied for ETFs. The initial outcome was not positive as the Securities and Exchange Commission (SEC) exhibited skepticism, but following Grayscale's win, sentiment changed.\n\nThe court ruled in favor of the asset manager in the lawsuit filed against the SEC for rejecting the request to turn the Grayscale Bitcoin Trust (GBTC) into an ETF. This imbued confidence in the market, and the deadline for the final decision is expected to arrive by January 10, 2024.\n\nBitcoin spot ETF update\n\nAs Bitcoin price rallies, Ethereum will fulfill its role as the \"Silver to BTC's Gold\" and likely push other altcoins to rally as well.\n\nFurthermore, this approval will also set a precedent for Ethereum spot ETFs, which asset managers are already eyeing. VanEck, ARK Invest, and BlackRock, among three others, have already applied for a spot ETH ETF. Grayscale, too, filed to convert its Ethereum Trust (ETHE) into a spot ETF.\n\nAccording to Bloomberg ETF analyst Eric Balchunas, these applications have strong odds of approval, too, since they would be similar in design and structure to spot Bitcoin ETFs. However, their final deadline is between May and August 2024, giving investors time before they can get their hands on the investment products.\n\nEthereum spot ETF filings\n\nThat said, following the spot BTC ETF approval, ETH ETFs will see much less friction in acquiring a green light from the SEC. This will be the driving factor for the continuation of the Ethereum price rise in Q2 2024.\n\nThe Surge after the Merge\n\nDuring a recent Ethereum Community Conference in Paris, Ethereum founder Vitalik Buterin discussed the future of the blockchain. Referencing the Merge, Buterin stated that the chain is only 55% complete and has a long way to go.\n\nThe next four stages, as noted by Buterin, will be The Surge, the Verge, the Purge, and the Splurge. The first of these four – The Surge – will introduce sharding on Ethereum.\n\nSharding is a key scalability solution for Ethereum that aims to improve the network's capacity to process transactions and execute smart contracts. This is done by splitting the network into smaller, more manageable chains called shards.\n\nEthereum Sharding structure\n\nThese shards are individual components of the Ethereum network itself. Each shard operates as an independent blockchain with its own set of smart contracts. These chains can process transactions and execute smart contracts independently, reducing congestion on the Ethereum mainnet.\n\nThe main goals of Ethereum developers with the sharding update are as follows:\n\nScalability: As the Ethereum network continues to grow, it faces significant limitations in transaction throughput and processing capacity. Sharding introduces a parallel processing approach, allowing multiple transactions and smart contracts to be processed simultaneously across different shards. Crosslinking: Shards communicate with each other through crosslinks, which are references to the state of one shard included in another shard's block. Crosslinking helps maintain consistency and integrity across the entire Ethereum network. Increased opportunities for validators: Validators participate in the consensus process by proposing and validating blocks on individual shards. Validators are chosen to propose blocks based on the amount of cryptocurrency they lock up as collateral in the Ethereum 2.0 Proof-of-Stake system.\n\nIn the sharding update, the beacon chain will play a crucial role as well. The beacon chain was the first Ethereum 2.0 upgrade, which acts as a separate blockchain that coordinates the overall network and manages the consensus algorithm (Proof-of-Stake). This chain will be used to coordinate communication between the shards.\n\nThe process of implementing sharding will begin with the Dencun upgrade. Set to be executed in Q1 2024, the upgrade will bring proto-danksharding to the network. Proto-danksharding will act as the scaffolding for future scalability upgrades, including danksharding, which is a crucial part of the Surge.\n\nDencun upgrade will also optimize the Ethereum gas fees, which has been a prevailing issue for users. Throughout 2023, Ethereum layer-2 chain’s fee per transaction has averaged $0.02 to $0.21, whereas Ethereum mainnet transaction fees have averaged $4.86.\n\nEthereum and layer-2 chains’ gas fees\n\nAs these updates are set to arrive in Q1 and Q2, with many of them expected to be deployed by May-June, they will likely act as the bullish catalyst of the second half of 2024.\n\n2024 Technical Outlook: Ethereum price could see $4,000\n\nEthereum price over the past year had a good run, rising by more than 85%. While Q1 proved to be a good quarter for the altcoin, the growth halted, and ETH largely consolidated throughout Q2 and Q3, struggling to breach the $2,000 mark.\n\nHowever, in Q4, Ethereum price began rallying again, mostly owing to expectations surrounding the spot Bitcoin ETF approval, which also led to many investment funds filing for spot ETH ETFs. During this duration, ETH shot up by 51% to end the year at around $2,200, which is the present trading price.\n\nThus, if throughout 2023 ETH rose by over 85% despite the bearish market conditions, a similar rally or even a larger one can be expected out of a bullish year in which ETF approvals are expected, network developments are implemented, and Bitcoin halving will take place.\n\nETH/USD 1-week chart\n\nIf ETH repeats 2023’s performance in 2024, the target for next year will be at over $4,000. The price indicators also suggest a bullish outcome despite the slight correction in the past few weeks. The Relative Strength Index (RSI) has just exited overbought, coinciding with the pullback witnessed over the last week, whilst the Moving Average Convergence Divergence (MACD) is rising above the zero line, showing the uptrend is accompanied by strong bullish momentum.\n\nAlthough the receding green bars do suggest that the bullishness is waning at the moment, some pullback before bullish momentum regains strength is common in longer timeframes, and this can be observed during the past bull runs as well.\n\nFurthermore, ETH has observed the 50, 100 and 200-day Exponential Moving Averages (EMAs) as support, which is a bullish indication since the last time this happened was in July 2020. At that time, ETH ended up scoring a 1,577% rally from $288 to $3,928, a feat that will not be replicated in 2024.\n\nNevertheless, despite the bullish indications, one should remember that the recent rally has caused the Ethereum price to be overbought on RSI, and investors might attempt to book profits in the first half of 2024 again. This falls in line with historical movement where ETH lived in the overbought zone (RSI above 70.0) for about six months before initiating short-term corrections in June 2021.\n\nEthereum RSI and MACD\n\nThe prospect of investors selling their holdings to realize profits is also evident from the on-chain metrics, which suggest investors may book profits if the Ethereum price shoots up. Nevertheless, ETH would still be expected to remain above the $2,500 mark until Q2, after the corrections, the ETF hype subsides, and the market moves on to the Ethereum network upgrades.\n\nProfit-taking will bring corrections, but traders remain bullish\n\nOn-chain metrics can be used to analyze investors' behavior and make predictions about future price activity. One of the most important on-chain metrics is the Market Value to Realized Value (MVRV) ratio. This metric is an indicator used to assess the average profit/loss of investors who purchase an asset. It can provide clues as to when investors might begin taking profits and selling their holdings, leading to pullbacks in price.\n\nThe quarterly and yearly MVRV ratios are the most useful for long-term analysis. The 90-day MVRV ratio measures the average profit/loss of investors who purchased an asset in the past three months, and the 365-day MVRV ratio measures the same over the last year.\n\nFor Ethereum, the 90-day MVRV sits at 15.25%, which indicates that investors who purchased ETH in Q4 2023 are sitting at 15.25% profit. Similarly, the 365-day MVRV ratio is presently at 24.18%, suggesting that those who purchased throughout 2023 are, on average, witnessing 24.18% profits.\n\nInterestingly, considering both the timeframes, it is evident that these investors are likely to be tempted to sell their holdings soon to realize profits. This could most certainly trigger a sell-off. As seen in the chart, when MVRV hits 9% to 34% on the yearly time frame and 7.8% to 31% on the quarterly time frame, ETH has undergone considerable corrections. Hence, this area is termed a danger zone.\n\nEthereum MVRV ratio\n\nApart from investors, the traders are also seemingly bullish. This inference is derived from the funding rates, which show an increasing trend. Such a trend suggests that long positions are gaining dominance, indicating a prevailing bullish market sentiment.\n\nAs can be observed on the chart below, the last time funding rates plunged into negative, i.e., short traders gained dominance, was back in March 2023. Since then, the rates have largely been positive, which means people are betting on a rise. This is solely being done with the intention of selling for profits.\n\nEthereum funding rate\n\nSo, considering these conditions, the bull run that starts due to spot Bitcoin ETF hype, followed by the sharding update, will likely urge investors to sell and realize profits. However, long-term holders will refrain and wait until the bull run flips and ETH begins witnessing a downtrend.\n\nWatch out for institutions\n\nOne key factor that might act as a headwind to Ethereum price reaching the target of $4,000 is the lack of institutional interest ETH has been witnessing. Year to date, the crypto asset only managed to rake in $19 million, which is far lower than Solana's $146 million worth of inflows and astronomically less than Bitcoin's $1.7 billion.\n\nEthereum's year-to-date institutional flows\n\nIf this trend continues in 2024 as well, ETH might struggle to capitalize on the rest of the bullish cues since institutions are expected to drive the next bull run, and lack of interest from them may not play in Ethereum's favor.\n\nSummary\n\nTo summarize the outlook for Ethereum in 2024, the best advice is to sit on holdings, wait and gain. A bullish year for the broader crypto market and a bullish year for ETH investors is the forecast. But that does not mean the Silver to Bitcoin's Gold is completely immune to bearish outcomes.\n\nWhile an increase to $4,000 is possible, it is not a certainty since regulatory changes and unprecedented crashes plague the crypto market. Furthermore, considering the performance in 2023, ETH has not necessarily been the favorite asset of institutional investors. This lack of interest, if noted in 2024 as well, could act as an opposing force on ETH's potential growth.\n\nThus, it is advised always to do your own research and make the most ETH-ducated decision."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPS0kzN19fUFM3U0N2U2pVOEdTMkhyLXpLOVB0OTRXWEpNeU5SMFBqdGR5bTdpb3JpTVVZOEZ3aU4xX2Vqcy1hSkRvVFRSZHpwSkxab25aZ1dDcmpoMXotTnhMRDY2OERRaDNmNEVpQjFjUUJsMTlMbHo0akI5bTZXa0VTaXZLNi10b2hKQXZXSkhzSnNiUE5sSk9sWVJBTUc4Z0VkcEdIYWlmb0xDQ0NHV09RWnhWSG44Yi1Ib19mUlJFZGhfanBoRFhhQThoQXNy0gHWAUFVX3lxTE5CVFdzWXZEY1hSTnJUenVkOGhkZHZjZVJBUmFPcVFjTzF1SURhTFIwNUhsMXB6N1dINGpia3h4YktWOUs4Tjh0V2FMdEt2Mk04Qk1lUFhwOTgxUmo5SGdvdE1hT3l4NkRaUU45NlhES1JQV0VjZ0Jnd0ZMV09uSEFub1RxeDkxS0xwXzNFUTluM0J3WHQzS0w3bklxRTZpeGRIMjB3bmdCYUpHTVZIVGlmWll1enVjVnBrSlF2OGw1N1Q5cWpFWnpZZmJsd1JUSXNPOHo5R2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "New Lows Incoming for Bitcoin, Ethereum and Altcoins, Warns Analyst Who Nailed the 2022 Crypto Collapse - The Daily Hodl",
        "content": "A widely followed crypto trader is warning that Bitcoin (BTC) and other altcoins could soon make an abrupt trend reversal toward new lows.\n\nPseudonymous trader and crypto bear Capo tells his 781,400 followers on the social media platform X that Bitcoin could soon revisit the low $30,000s and bring a sudden market correction to alts after they rally one more time.\n\n“As posted on TG (Telegram) a few days ago, BTC is probably forming a local top here at $40,000-$45,000. ETH could reach $2,500s, and some alts could have the last pumps. After this, a full reversal to new lows is likely over the next few weeks…\n\nI believe new lows are still to come before the real bull market begins.”\n\nThe trader elaborates on his reasoning in a thread about why “we might still see new lows over the coming months.”\n\n“Let’s start with BTC on HTF (high timeframe). We have seen a bullish trend during 2023. Many think that this is the start of a new bull market, but in my opinion, this is a corrective move. Now the price is at a major resistance zone. Confirmations are on the chart.”\n\nHe uses the Elliott Wave theory, which attempts to forecast price movements based on crowd psychology that is manifested in waves. The Elliott Wave theory suggests that price impulses happen in five waves after three-wave “ABC” corrections.\n\n“BTC EW (Elliott Wave) perspective: the bearish trend during 2022 was an impulsive move that broke the 2020-2021 bull market trend. Now, the move from the $16,000 low looks like a corrective move (wave B/X). This move tends to be followed by another impulsive move (wave C/Y).”\n\nLooking at Ethereum, the trader predicts that ETH could decline as low as $550 after facing resistance at around the $2,600 level.\n\n“[ETH] has broken a key level and the next major resistance is $2,500-$2,600. It has a lot of liquidity below that should be taken eventually. The bearish confirmation would be a clean break below $2,000-$2,100.”\n\nHe suggests other altcoins are surging from an inflow of money from Bitcoin sales, which he says often indicates a market correction is coming soon.\n\n“Money is flowing from BTC to altcoins. This usually happens during the last phases of a bullish trend. Some altcoins could pump more, but the trend is overextended and reaching to an end. When OTHERS (altcoins index) reaches the green zone, we should see a strong correction.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQWElaQ1FZa2pYNTdubFBTLVZ4a3c1b2NfLUJ0clJzcDZpempUbnpSU3I2R3lJYXR3cGFyakVFN2c3ODFDZFRVUzhTQlRpbWNwZklyVzRpM0l2Tmd0eDBUUVBaRkVZdFF4R0ZIdFdCazlqN1FMT2xIMkpLcVlqdlZHUFRR0gGHAUFVX3lxTFBOb09DZEZPLTJ0aU5FOWMySkZQemVxLVpqWk1IdWJmU2hZNlg4SmZFakRuUUdIWHRIeVZKY2x5YXYybGw0NGtjMjc1NWcwaVlsdExoYjJEaTJCOF91ZlJRM0FQUWRrblBoX2owS2JVV0tPRG5TbGE4dExYYUVsRnBSWE9MRVFuTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Ethereum: Why a price move to $2.5K is a good prediction - AMBCrypto News",
        "content": "ETH accumulation has been increasing, suggesting a move toward $2,500.\n\nMarket participants are not convinced that the coin is about to jump.\n\nAccording to AMBCrypto’s evaluation of Santiment, active addresses on the Ethereum [ETH] blockchain have been rising. As of 18th December, the 24-hour active addresses was 395,000.\n\nBut at press time, the metric has climbed to 512,000. Active addresses measure daily interaction and speculation around a token.\n\nTherefore, the increase suggests that there are more market participants involved in ETH transfers. Like the active addresses, Ethereum’s on-chain volume also increased.\n\nAt the time of writing, the volume was 13.02 billion. The rise in active users and volume implies a surge in network activity on the blockchain\n\nETH’ season to switch states\n\nAlso, this could be a bullish sign for ETH’s price. For a while, ETH has come under intense criticism for its inability to replicate Bitcoin’s [BTC] form. Likewise, ETH has also been unable to outperform many other altcoins.\n\nHowever, this does not mean that ETH will not have its season.\n\nOne reason for this assertion is the number of new ETH wallets created. Based on Glassnode’s data, new addresses on Ethereum have been growing.\n\nThis indicates a surge in traction which could translate to a positive move for the price action. On a Year-To-Date (YTD) basis, ETH’s value has increased by 84.11%.\n\nHowever, the cryptocurrency has been stuck between the $2,000 and $2,300 levels for some time. A look at the ETH/USD daily chart showed that a bullish thesis could soon be validated.\n\nThis was because of the Exponential Moving Average (EMA). At press time, the 20-day EMA (blue) had crossed over the 50-day EMA (yellow).\n\nThis position is bullish and could be termed a buy/long trend. So, traders may need to desist from opening short positions.\n\nBut the Awesome Oscillator (AO) revealed that ETH’s bullish season may not happen in a few days. At the same time, it may not be far away.\n\n$2,500 or nothing\n\nAt the time of writing, the AO had formed red bars. However, the red bars were decreasing in height, suggesting a weak bearish momentum.\n\nAlso, the increase in the Accumulation/Distribution (A/D) indicator means a move to $2,500 could be possible in the short to mid-term.\n\nIn the meantime, market participants are not all bullish on ETH. This was indicated by the Weighted Sentiment.\n\nAt press time, the Weighted Sentiment was -1.736. This negative reading is a confirmation of the bearish bias most market players have.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nConsidering ETH’s circulation, on-chain data showed that it decreased to 242,000. This decrease implies that the number of ETH engaged in transactions has reduced compared to the hike on the 20th of December.\n\nPrice-wise, the drop in circulation suggests low selling pressure for ETH. So, it may be unlikely to see a nosedive in ETH’s value soon."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQY3N5eV90Q3l6c2x1ZV94b2pJLWEwQWtRR3JKWC1sX1pOWFVvU1hZcG9IdzJVOER2a3EzOVdpb2l3TEdxNE9zUm5vUEtJM0k2c2pYa25md2VLUURqRnZyZVZYeXZIMmZVMHR3WURVTmZKRk5ULTJCbkVvV2tiRkl3NzlHdS1hWGZlYTRiaEx1MNIBlAFBVV95cUxORFZiYTZQNVpzRFN5Ymt3RThxNDUzbGhZTkN5TE5nZDVDUFNuTllhdHVsLWl2NlVYX3N3WFVEaFRuT0RhdHZPeEptTmZWeU8ySG9PWjNuQmw5dHFOa01KdlluMWRYQ2FteHo1Yng4djZBWUJja2thb1kyaTA0WlZkUF9XbkRVRDB3aS03T1dLUTBVM0xw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin's Mom's Token METIS Skyrockets 36% in Epic Ethereum Rally - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a noteworthy development, Metis token, associated with MetisDAO and led by Natalia Ameline, mother of Ethereum founder Vitalik Buterin , has experienced a significant 36% surge in the past 24 hours, reaching the $39 per token mark during the ongoing Ethereum rally.\n\nAdvertisement\n\nCoinMarketCap's recent layer-2 sector token ranking places Metis in eighth place, with a capitalization of $168.55 million. The token has demonstrated superior performance in the last 24 hours and an impressive 106% increase in the last 30 days, positioning itself as a standout performer in the Metis ecosystem.\n\nMETIS to USD by CoinMarketCap\n\nThe surge in the Metis price can be attributed to the announcement of the creation of a $100 million initiative aimed at supporting the growth of the Metis ecosystem.\n\nScheduled for distribution in the first quarter of 2024, the fund will facilitate sequencer mining, retroactive funding and the development of new projects, fostering a community-driven approach managed by the MetisDAO Foundation and token holders.\n\nWhat is Metis?\n\nMetis stands out in the layer-2 landscape due to its efficient use of Optimistic Rollups, facilitating quick and cost-effective transactions on the Ethereum blockchain by consolidating multiple transactions into a single batch."
    }
]