[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTE5PaERSUUhpZlZrcmpEQk02VmZ4QzFRb0xOTU9tX0RqWnZYRjZtSVlYY2VjMGZZMV8yWHhzcW5GUXFqWHpoTzhBc09GYUJ3a3JXSVlwUHQ5eXJGMmgydldjbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Three privacy-focused Ethereum L2s arising in 2024 - Blockworks",
        "content": "Several crypto startups are looking to develop the first-ever privacy-centric Ethereum L2.\n\nOn Ethereum today, transactions and other smart contract executions are all publicly visible. Transparency is a core principle of blockchain technology, meant to allow verification of systems and instill confidence, but it can also be a double-edged sword.\n\n\n\nWhile transparency ensures accountability, it also means that the details of these transactions and contracts are exposed to everyone, including malicious actors and hackers who can analyze transaction patterns, identify vulnerabilities in smart contract code, and exploit these weaknesses for nefarious purposes.\n\nPrivacy solutions offer dapp developers the opportunity to build applications that shore up these shortcomings without compromising security.\n\nIn the process, these privacy-first applications must endeavor to prevent harmful actors from concealing their identities, while protecting the rights of law-abiding citizens. In short, to avoid the fate of crypto mixer Tornado Cash, which allegedly was used to launder over $455 million stolen by sanctioned North Korean hackers.\n\nRead More: Tornado Cash Developer’s Arrest Sparks Protest in Amsterdam\n\nHere are a few teams that are hoping to build a functioning privacy-centric L2:\n\nAztec\n\nAztec is a privacy layer of Ethereum. It’s referred to as a hybrid solution using zkSNARKs and its very own programming language, Noir, to offer private transfers, meaning that the network is designed to validate transactions without revealing any sensitive information about them, such as the amount and parties involved.\n\nUnlike other zero-knowledge (zk) rollups on Ethereum, Aztec combines private and public execution in one single zk rollup. Meaning that a user’s own device is responsible for encrypting the transactions before it is processed by the blockchain.\n\nIts primary focus, for now, is to design a platform for engineers to write private smart contracts without requiring in-depth mathematical knowledge of zk proofs. It recently revealed a new testing environment, Aztec Sandbox, for interested developers and plans for a testnet launch early next year.\n\nFhenix\n\nEncryption start-up Fhenix hopes to bring fully homomorphic encryption (FHE) to smart contracts.\n\nUnlike privacy startups that use zero-knowledge technology, where data must be moved off-chain and decrypted in order for a prover to verify its accuracy, FHE encryption performs computations directly on encrypted data.\n\nBy keeping data on chain, the network will have the capability to process computations that come from various sources, such as an on-chain poker game or a sealed-bid auction contract.\n\nFhenix launched a developer testnet in July and plans for a full-scale testnet launch of its FHE rollup in early 2024.\n\nCOTI\n\nCOTI is a privacy L2 building on Ethereum. Unlike Aztec, which uses zkSNARKS and Fhenix with FHE, COTI V2 will use so-called Garbled Circuits to enable private transactions.\n\nGarbled Circuits enable two different parties to evaluate information, even if they distrust one another. The parties can each submit their ‘garbled’ or encrypted inputs, computations are conducted on these inputs and an outcome is obtained.\n\nCOTI will launch a developer testnet V2 in Q2 of 2024, and its mainnet launch will come soon after.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTFBhZzJSWmZPRjg2dUZQVkV2OEZSa1BMRWZwQ3NBcF80VDlDVnM4MHpFYnlLYjhaRWFsazAzZGpjRW5NdVlUblZ5NnR2UlpRUlE5bjBaZGt6RmdiOW00QkZJNExtN21sQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Gas Fee Concept Explained - LCX",
        "content": "Why Do We Need Gas in the Ethereum Ecosystem?\n\nGas’s primary function is to reduce ETH’s volatility. ETH is publicly tradeable and listed on exchanges. As a result, it is directly subject to market volatility. Petrol is not listed on any exchange, so it is not directly affected by market volatility. An Ethereum smart contract requires more computational power than a straightforward transfer. In order to avoid instability, the fee must be meticulously designed.\n\nHow Is the Gas Price Determined?\n\nGas price is determined by two factors: the gas limit and the price of gas. The sender’s gas limit is the utmost amount of gas they are willing to pay for the transaction. The cost of gas is determined by market supply and demand. The final gas price for the transaction is calculated by multiplying the two prices.\n\nGas Limit * Gas Price = Gas Fee\n\nGas Limit: Gas Limit is the maximum quantity of ETH that the sender is willing to spend on the transaction. Typically, when discussing Gas in Ethereum, one is referring to Gas Limit. Sending ETH requires the shipper to set Gas Limit. If there is insufficient Gas Limit to complete the transfer, the transfer will be cancelled and the shipper will receive a Gas refund. Alternatively, if the sender specifies an excessive Gas Limit, any excess Gas will be returned to the sender.\n\nGas Price: Gas Price indicates the cost of Gas in Gwei. For instance, 1 Gas equals 10 Gwei. It is primarily determined by supply and demand in the market. Gas Price is multiplied by Gas Limit to ascertain the cost of gas.\n\nWhat Are the Factors Affecting Gas Fees?\n\nUnderstanding the dynamics of gas fees involves recognizing the factors that influence their fluctuations:\n\nNetwork Congestion: Ethereum’s popularity has led to network congestion during peak usage times. As more transactions compete for limited block space, gas fees tend to increase.\n\nGas Price: Users can set their preferred gas price. A higher gas price increases the likelihood of a transaction being processed promptly, but it also incurs higher costs.\n\nTransaction Complexity: The computational resources required to execute a transaction or smart contract influence its gas fee. More complex operations demand more gas.\n\nGas Limit: Each Ethereum transaction has a gas limit, which represents the maximum amount of gas a user is willing to spend. If a transaction’s computational requirements exceed the gas limit, the transaction will fail, and the user will still be charged.\n\nExternal Events: Market fluctuations, platform upgrades, and major smart contract executions can impact gas fees.\n\nWhat Are the Strategies to Optimize Gas Fees?\n\nNavigating the Ethereum gas fee landscape requires a strategic approach. Consider these tips to optimize your transactions:\n\nGas Estimators: Various online tools and wallets provide gas estimators that recommend a suitable gas price based on network conditions. These estimators help you strike a balance between prompt execution and cost efficiency.\n\nOff-Peak Usage: Initiate transactions during periods of lower network activity. Gas fees tend to be lower during off-peak times.\n\nLayer 2 Solutions: Layer 2 scaling solutions, such as Optimistic Rollups and zk-Rollups, aim to alleviate Ethereum’s scalability issues by processing transactions off-chain and settling them on-chain. These solutions can significantly reduce gas fees and transaction times.\n\nBatch Transactions: Some wallets and platforms allow users to bundle multiple transactions into a single batch. This approach can save on gas costs, as multiple transactions are processed in a single block.\n\nGas Tokens: Gas tokens are tokens that can be minted when gas prices are low and burned (destroyed) when gas prices are high. This mechanism enables users to hedge against future gas price increases.\n\nSmart Contract Efficiency: Developers can optimize smart contracts to minimize gas consumption. This includes techniques like reducing unnecessary storage operations and using more efficient algorithms.\n\nConclusion\n\nEthereum gas fees are an integral aspect of the network’s functionality. While they can present challenges, they are also a testament to Ethereum’s popularity and utility. By understanding the factors that influence gas fees and implementing optimization strategies, users can navigate the Ethereum ecosystem more effectively and make the most of its innovative applications."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPMV9mZTVHRkNyTTI4ZFhkRmZSME9vX2sybkQ3SE9FV2FRUFdLQV91bWNQZGhmeWF2YndIZWVSM2NrdHdXVU9rTWtFc3p5X1FneGpkekpYN2kza3lWRDRqVml4TE5JZVFzM1RoS0xhZ0wteW9mUnM4eDFnNEROSTVsdHM5U2VNd09uTjdWNUtWSWtwNE52cFBocnpua2o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Anatoly Yakovenko jokes ‘Solana is Ethereum’ in ironic social media exchange - CryptoSlate",
        "content": "In a recent exchange on social media, Solana creator Anatoly Yakovenko, made a remark that was misinterpreted in our previous coverage.\n\nIn a Dec. 25 tweet, Yakovenko playfully suggested that Solana could be considered an Ethereum layer-2 (L2) solution through its Wormhole eigenlayer. This statement was part of a tongue-in-cheek response to a tweet listing various L2 solutions like Arbitrum, Aztec, and Polygon. He quipped:\n\n“Solana is ethereum! Solana is an ethereum L2 through the wormhole eigenlayer. Once danksharding is scaled up no one is going to stop you from submitting all the Solana blocks into some data validating bridge contract on ethereum.”\n\nThis playful assertion was meant to ironically juxtapose Solana, a distinct and independent blockchain, with Ethereum’s layer-2 solutions. The mention of a Wormhole eigenlayer and the speculative reference to submitting Solana blocks to Ethereum were part of this jest.\n\nOur initial report, however, presented it seriously and failed to recognize its ironic nature, and thus our coverage suggested that he meant it in earnest. We sincerely apologize for the error and for any confusion caused by our failure to recognize the ironic intent behind it.\n\nOn the rise\n\nYakovenko’s jesting aside, Solana is poised to close the year on a high note. December was a particularly active month for the blockchain, showcasing one of the quickest price recoveries in the final quarter. The total value locked (TVL) on Solana more than doubled, escalating from $671.62 million at the beginning of the month to $1.529 billion by December 26th.\n\nHowever, when denominated in SOL, the increase was more modest, from 11.35 million SOL to 12.56 million SOL in the same period. This discrepancy reflects the significant rise in SOL price, which climbed from $59.2 to $121.4, affecting the USD valuation of the TVL.\n\nNotably, Solana overtook XRP in market cap, becoming the fifth-largest cryptocurrency with a market cap of $34.8 billion as of December 20, 2023, following an 11% increase in Solana’s value, which outpaced the broader market’s 3% gain. The SOL/ETH ratio, comparing Solana’s value to Ethereum’s, also shows recovery, highlighting Solana’s competitive stance.\n\nThe SOL/ETH ratio, a metric comparing the value of Solana (SOL) to Ethereum (ETH), is a critical measure of Solana’s competitive position. This ratio has experienced significant fluctuations, with the most recent data showing a recovery in Solana’s standing against Ethereum.\n\nSolana’s blockchain technology, known for its high performance and scalability, is designed to support decentralized applications (dApps) and decentralized finance (DeFi) use cases. The platform’s success is attributed to its unique consensus algorithm, “Proof of History,” which enables high transaction speeds and low fees, making it a popular choice among developers for dApps and DeFi projects.\n\nMentioned in this article"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPVkpGWFhKcGl6ZEIwanVvVURUZWVpaTU0UldCREFCNVlDR2FQX0gta1oyUmJEMFRmR2VCZWVKaUk4a21uNHFfcEVpcmFUREF0Q2ZhM1gyYjFIMndIT0YwRWpkd1JUd2lHd2hobHkxcTJoOFVkbkwxZTloWHRDWkcyUzY0MVFEMGV4cTNURC05ejE2WkpSckdSMVo3aTF3NEVQd1NuZWVtUG1kZTlPQ3fSAbMBQVVfeXFMTVFWZk82QURwTTdReFM4WDE0cTh6Y1lZWkZQSUlIWEE3WmRKUF9ac3BtWmpRVzg3UkZNM05kVC13eThWbktadFdUalgzbWY4TS1oRktxckxZTmNYb2I2cWwxc2x6dXI3aTN3TUZ0c1phVHQtM2JTZ0FubUNhaUIzYzFFNnY5dEdCRlMxc0dheDR5bzdTdnlLNWp5LUFPcWliT3VfMVJnaUpvYkxZT3NZVDRONkk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "ETH Could Hit $15K in 2024, But These Ethereum-Related Tokens Will Outperform: Analyst - CryptoPotato",
        "content": "On Dec. 26, crypto YouTuber Lark Davis said, “Ethereum is going to make a lot of new millionaires in 2024.”\n\nHowever, he added that those with a lot of ETH, purchased at much lower prices and staked, will do well in the next bull market. But those getting into the market now, with the asset trading over $2,000, are not going to make it big unless they have a lot to invest.\n\nThe big returns will be made trading Ethereum layer-2 assets, he said.\n\nEthereum Will Make Millionaires In 2024, BUT Not How You Think pic.twitter.com/00YCLPyGCl — Lark Davis (@TheCryptoLark) December 25, 2023\n\nEthereum to $15,000\n\nLark highlighted a number of current and upcoming layer-2 listings, such as zkSync, Starknet, Linea, Scroll, Blast, Manta, and Celestia. “New listings can make money, especially in the short term,” he said.\n\nNewly launched tokens often exhibit pump-and-dump patterns as airdrop hunters offload them quickly. However, there have been several that have begun up trending soon after when they get listed on larger exchanges.\n\nFor the Ethereum hodlers, things could still be good in 2024. He compared gains for ETH from previous cycles and made a prediction for the next bull cycle in 2024 and 2025.\n\nNow that the asset has broken out from its resistance zone at $2,150, “it’s going to do big things.”\n\nIf Ethereum makes similar gains to the last cycle high, or even slightly less, “that will get us up to around $15,000 per coin.”\n\nThis is on a hypothetical 200% gain from the previous high, which was around $4,880 in November 2021.\n\nFor those buying now, there is a potential 500-600% gain, he said, which is a “relatively low-risk bet for crypto.”\n\nEthereum is very strong fundamentally despite the lack of love recently from the crypto community.\n\nETH Price Outlook\n\nCrypto markets are in retreat this Wednesday in Asia. As a result, ETH prices dropped 2% on the day in a fall to $2,223 at the time of writing.\n\nMoreover, the asset has now declined 6.8% from its 2023 high of $2,385 on Dec. 9. There is solid support at the $2,150 area where it could be heading next as markets continue to cool.\n\nThere is little doubt that the asset will perform well in the next bull cycle, but at the moment, the Ethereum engines are spluttering a little."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxPTEF1VXlpNHhqQS12d0t1WlMzSnRUUG1WRkJveERBRU1ydDlGQ3B4Z3ZDNk5TN1o1QmZpcXBYWTEtamt4cElOd0ZYM2RZekxNd3QtT2d6eFZhOU5OMnpHQkpTN01kanhZMjltTWQ5MEg4dHdPU2hpUm5EMjNHNnBqTDNCcWZ1RGp5eG5scjA5WG9ubjNyZFVLeUo2WHJVTWl2TG4zOVBTZlN5OUEtaU1Xd3c4ZHBZYTNpanEyemhuS2lfNHNQRkNCQkhERzNFN0dzSHfSAdcBQVVfeXFMUGRQT092S0NOR2syZGlweFFUN1NpZ2pBQlI4Y0hyZ1dNYkM0amxGdlFCM0dwUDNrMG8yZVZKMXpiMFg2b0g0T1g3SFctYTdlNjlfTW1BcTB5S0RZeGw0c3I2MFEzNU93YUdUUExGNFdHQVNDaVBFS3IyTU8xNEMtMlpsb19FTnM3SWtKbnVZckJLMVN5SGxucWNENVNBWnFjbG1zSktEWE92NWZQSmZydzBzRHgyYUtNZVNCTGliVTl5RGUzQ21OQks4bFpnTlhTaEZQVk95dFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Macro Guru Raoul Pal Predicts Ethereum Will Massively Outperform Bitcoin, Says ETH’s ‘Big Surprise’ Coming - The Daily Hodl",
        "content": "Former Goldman Sachs executive Raoul Pal believes that Ethereum (ETH) is poised to outperform Bitcoin (BTC) over the coming weeks and months as investors move their capital within the crypto markets to generate more gains.\n\nPal tells the 21,300 subscribers of his YouTube channel that Ethereum will “massively outperform” Bitcoin just like how lower-rated junk bonds tend to surpass the higher-rated treasuries when investors rotate their capital.\n\nAccording to Pal, the potential approval of a spot Bitcoin exchange-traded fund (ETF) will positively impact Ethereum as he expects market participants to reinvest their BTC gains in ETH.\n\n“So ETH is just doing what it’s supposed to be doing. But it’s not giving us the big surprise. I think that surprise comes the moment the ETF is out in Bitcoin and people will focus on the ETH ETF. And it’ll bring the ETH ecosystem alive.\n\nThis year, it’s been a story of Solana which I’ve been long all year, and Bitcoin. That barbell has been the best trade in the world. Or, in fact, just saying SOL has been the best trade in the world bar none. But ETH, it will play catch-up, it will do well.”\n\nTurning to Bitcoin, Pal says that the flagship crypto asset’s price action going forward is likely to mirror its 2015 bull market price action when Bitcoin witnessed a massive burst to the upside without a major correction.\n\n“I think this cycle we’re in now looks more like that 2015, 2016, 2017 than it did 2019-2021. [In] 2019, [Bitcoin] came out of the gates really, really fast then corrected, then we had Covid-19, which we’re not going to repeat.\n\nI know many people are expecting ‘Oh, we’re going to get a 50% collapse and you buy that one.’ It’s not going to happen.\n\nOf course, you’ll get corrections. I think they’re most likely more sideways, give or take a 20% to 30% range, because that’s the world we live in in crypto.\n\nBut we should keep going into the end of 2025 if we’re just repeating the same old cycle, which I think we are.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Bruce Rolff"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQNmtub0JJbEpicHFaX3VENGRxNFVzMXpWc2diY2FCNTUtQ2NzSUhjTzkwTXRsbElKUm5EVGY1SFQwc1pNbmVUZDAwd3A4Smc3QW5BUzJ6elRuWVdlR3FoUGVFMkVGT3h5c0Q5RTFUZ29sYjNJUm1oZXp4N3N2QUVFV0xIYUJNcjNLMDhUcENpNDNxNm5BSmdwMjhEY3lTcmNfZG5BSnlwR2xCeU9ydzUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Continues to Consolidate - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE94Z1ZDS3JlclpGLTRFU2hwbElKUFhQN29BTWhfS1VqbTFzV2t6dDVPMlltbXFvTUxnZEVteS1DdWZoU2FreXk0Qm9kN1FoRVZYWFdwWWdjek9yX25MYzdJ0gFkQVVfeXFMT0FGQXlLTUVMY0ZUeVRtMlpBQXllcGhIT3RnTzU1bzU2Y01COGVPVWdMVjdtZHo1TE9BMWcxR3JJRXFxRFFJVGJNd3E5eFI2U0RFZHFhZ3V1OFJxRXdZc0o2UkxFNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Solana Is Ethereum, Co-Founder Says - U.Today",
        "content": "Advertisement\n\nSolana's co-founder Anatoly Yakovenko recently made a bold assertion about the future of blockchain interoperability and the role of Solana in the wider Ethereum ecosystem.\n\nIn a series of posts on the X social media platform, Yakovenko described Solana as an Ethereum Layer 2 (L2) solution through the Wormhole EigenLayer.\n\nThis would be possible because of advancements in \"danksharding,\" a scaling solution for Ethereum, suggesting a future where Solana blocks could be submitted into a data-validating bridge contract on Ethereum.\n\nExploring interoperability\n\nYakovenko's comments sparked a discussion about the technicalities and implications of such an integration.\n\nAdvertisement\n\nHe clarified that Solana would only mint the wrapped version in its state after Ethereum achieves full finality, addressing concerns about potential reorganizations (reorgs) of the blockchain.\n\nThe concept of \"social consensus\" was emphasized, which suggests flexibility in how Solana and Ethereum might interact.\n\nThis flexibility could allow users to fork off into their own layer-1 1 (L1) blockchain, using a snapshot root. Yakovenko's stance indicates a broader view of what defines a layer-2 solution, challenging traditional boundaries and proposing a more fluid and interconnected blockchain ecosystem.\n\nSolana's market resurgence\n\nAs reported by U.Today, Solana has recently marked a significant achievement by surpassing Ethereum in a key trading metric: perpetual futures trading volume.\n\nSolana's lead in both perpetual futures and spot trading volumes, coupled with a soaring market capitalization, positions it as a formidable competitor in the crypto space, even challenging Ethereum's dominance in the Decentralized Exchange (DEX) and decentralized finance (DeFi) sectors.\n\nThe interest in the Solana ecosystem mostly stems from the meme coin frenzy that was fueled by the rise of the Bonk (BONK) token."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPU052OG9sa20wc0FDNWlaQUtkazhveG9ETldJbXFNR2dtd2c4OVJkSmZkWHZQd0RfeTZpLVAzaFNuTjJMLXl0TERpVE5GRG0xS2lwWDVFOHlxQk9vdVN5Q1lMZmNad0UwcDRFRmhGc2lYZWhpdTFfZFRsT1hzRk1YZUJtRm9VSERaRmlucUtVbzFxQ3NneGthT3NXZmZpOGR1SEhaYXNmT2RRb1VZc2ZyQmZMNTR3UXlIckowbDR5c0pnQdIBxwFBVV95cUxPZk1VeGpYQlZ6eVRMdnVMb2NreGtrcV8wYWJKOGNsdEFlX1lmYWZqMDg4TjZTbDFJMnJiQldadjhUS1dNd0dWdldkUTh1TUl6NkpWV2JkOVg2Sk51UkVreVd5Z08ySEdxOVl5MFV4S1Y0azhRc3Q2ZzZiS016M3p1VHNvNlF4U1RFaVk4RlRMc1NudHBTQ253LXZVOGZ0M0UwRFBrbWg4M2t1cTJ4RG5RTkJNeHNodW1LTElVWU0yazBQWWVxWTVZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Ethereum price eyes $2,500 mark as Solana market takes a breather - FXStreet",
        "content": "Ethereum price looks poised for a continuation of the uptrend, with several technical indicators favoring the upside.\n\nMeanwhile, Solana price is likely to face a correction after a multi-month period of SOL being massively overbought.\n\nETH could rise almost 7% to hit $2,500 amid rising momentum and a possible pending buy signal.\n\nA break and close below the critical support at $2,147 would invalidate the bullish thesis.\n\nEthereum (ETH) price looks poised for a shine after a prolonged contention against its peer in the Layer 1 space, Solana (SOL). This brings to mind previous reports where Solana founder Anatoly Yakovenko said he envisions a future where SOL and Ether co-exist, urging that the whole narrative of one ecosystem kills the other be binned.\n\nAlso Read: Crypto hack: Ethereum, Solana DeFi trading platform Thunder exploited for $239,000\n\nEther displays upside potential as Solana price shows weakness\n\nEthereum (ETH) price has spent the better part of December consolidating between the critical support at $ 2,147 and the $2,380 resistance level. Based on technicals such as the Relative Strength Index (RSI), the largest cryptocurrency may be poised to shine, at least for the short term.\n\nMeanwhile, the SOL market is exhibiting weakness, as the technical indicators hint at a possible dip in the Solana price. It comes after a prolonged period of SOL being massively overbought, indicated by the presence of the RSI above the 70 level since October 18, when the markets turned bullish. This preceded a correction.\n\nSOL/USDT 1-day chart, ETH/USDT 1-day chart\n\nEthereum price outlook with ETH shining at Solana’s expense\n\nAfter Solana price’s epic surge across the fourth quarter, the SOL market is taking a breather, with capital flowing into Ether. With this, Ethereum price looks ready to shine at the expense of Solana.\n\nThe RSI is northbound, suggesting rising momentum. The Awesome Oscillators (AO) indicator remains in the positive territory, adding credence to the bullish thesis. Increased buying pressure above current levels, therefore, could see Ethereum price rise, potentially flipping the $2,380 resistance level to a support before testing the $2,403 range high.\n\nIn a highly bullish case, the gains could extend for Ethereum price to tag the forecasted $2,500 psychological level, in a move that would constitute a 7% climb above current levels.\n\nETH/USDT 1-day chart\n\nOn the other hand, if the $2,380 roadblock holds as resistance, the ensuing rejection could see Ethereum price lose the critical support at $2,147, below which the bullish outlook would be invalidated. In the dire case, Ether market value could descend to test the supply barrier that now acts as a bullish breaker between $2,049 and $2,107.\n\nA break and close below the midline at $2,075 would confirm the continuation of the downtrend, with Ethereum price likely to spiral towards the $2,049 support, levels last tested in November."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPcDJUa2k0SGtzZzJycWlLZmowdFVzY0tKUl9QbC1zMl94dDZUMTI4c3lLRF9FMjRCU2JfQW04ZncwQnBxMWFEcGI5akw1WjFpU3NyZXVNWmZnZmg4WmZ3MWcyN0lpNzRjZ3EtU29rSzY1VDAzSWdCTE0tSl9MUlJLTkprY1ZGSk9wM2ZyNjhkaEIyWU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin’s Three Solutions for Ethereum’s PoS - Crypto Times",
        "content": "The proof-of-stake consensus mechanism at the core of Ethereum, according to co-founder Vitalik Buterin, may face systemic complexity. To address this, he has three solutions.\n\n“A PoS simplification proposal: make a design that only requires 8192 signatures per slot (even with SSF), making the consensus implementation considerably simpler and lighter,” he wrote in a post on X.\n\nThe primary problem is that to keep the network functioning properly, validators that maintain it must create a large number of digital signatures using encryption.\n\nThe network already has a lot of work to handle from this, but as additional validators join, the number of signatures will rise, adding to the system’s workload. Subsequent updates are expected to raise the required signatures even more dramatically.\n\nOn December 27, Buterin wrote a post to the Ethereum Research forum outlining three approaches to avoid this. The shared goal is to reduce the number of signatures needed for each Ethereum blockchain space to 8,192.\n\nThe first solution is centered on decentralized staking pools. This would need raising the minimum amount of ether needed to run a validator to force people running validators to collaborate and pool their resources.\n\nVitalik’s second solution is to have two layers of stakeholders, one with stricter criteria and the other with more lax ones would be the second strategy. During the block finalization process, the two levels would be used in distinct ways.\n\nThe third option would be to have a rotating group of participants, in which case a different group of validators is chosen at random for each slot. Although Buterin pointed out that it would increase complexity, this would divide out the workload and lower the overall number of signatures."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPa2UxQmtKaW5JNHlvTThscFlPOEZndnVETFFoRkp6bkRBVjZnS2FGanVEZW8wTWdhaFJfRkcwMXRHT1k3WGdYR0tWUmIzTlYyOTdBWVc1ZWlPcGJYbDhlNDU1MGNBTEJkX3BsYk1oUWdJb0tGTzN4LVR0SE82VHJRSg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "SEC Delays Ethereum ETF Decision To May 2024: Bitcoin ETFs Anticipated In January - TronWeekly",
        "content": "The United States Securities and Exchange Commission (SEC) has decided to postpone its decision on several Ethereum (ETH) exchange-traded funds (ETFs) until May 2024. This move follows the agency’s decision to delay the consideration of the Hashdex Nasdaq Ethereum ETF and the Grayscale Ethereum Futures ETF.\n\nSEC’s Ethereum ETF Postponement\n\nThe Hashdex Ether ETF is designed to encompass both spot Ether and futures contracts in its portfolio. Meanwhile, the Grayscale Ethereum Futures ETF is being regarded as a strategic move, often described as a “trojan horse,” aimed at pressuring the SEC into approving Grayscale’s conversion of its Ethereum Trust to a spot Ethereum ETF.\n\nBloomberg ETF analyst James Seyffart expressed his views on the matter in a tweet on November 15, stating that if the SEC were to approve Grayscale’s ETH futures ETF application, it could pave the way for the approval of its spot Ether ETF application. Conversely, a denial could lead to Grayscale arguing that the SEC is treating Bitcoin and Ether futures ETFs differently under the Securities Act of 1933.\n\nWatch [the SEC] try to either approve and argue why this is different from spot. Or Deny and argue why 1933 act products are meaningfully different from 1940 act products. Both are bad for SEC [in my opinion]. Genius move.\n\nAccording to the filing, the SEC has initiated proceedings to gather additional public input on whether these ETFs should be listed, further contributing to the delay. Additionally, the decision on the VanEck spot Ethereum ETF and the spot Ethereum ETF proposed by Cathie Wood’s ARK Invest and 21Shares has also been postponed.\n\nBitcoin ETFs: January 2024 Anticipation\n\nDespite these delays and uncertainties surrounding Ethereum ETFs, analysts are still optimistic about the approval of Bitcoin (BTC) spot ETFs by early 2024. Bloomberg ETF analysts James Seyffart and Eric Balchunas anticipate that the SEC will greenlight a spot Bitcoin ETF in January 2024.\n\nThis positive outlook persists despite last-minute amendments being hastily added by applicants to their proposals. Seyffart pointed out that BlackRock’s recent spot Bitcoin ETF update, accepting the SEC’s cash redemption system, signifies a trend among applicants adopting a cash-only model.\n\nWill be interesting to see who updates their documents after this. SEC might not be comfortable with a Prime Execution Agent (a 3rd party buying and selling bitcoin on behalf of the ETF) purchasing the #Bitcoin in the cash model . This is how BlackRock's is planned at moment: https://t.co/pGWUNp7Lw3 pic.twitter.com/2D60KX7OUI — James Seyffart (@JSeyff) December 21, 2023\n\nNotable entities like ARK, Bitwise, and Valkyrie have already embraced this approach, while others like Grayscale and WisdomTree continue to include in-kind or cash options in their filings.\n\nIn December, finance lawyer Scott Johnsson predicted a broader industry shift towards the adoption of a cash creation and redemption model for ETFs, emphasizing the changing landscape and regulatory preferences within the cryptocurrency market.\n\nRelated Reading | Bitcoin’s Future Threats: Bitmex Co-Founder Arthur Hayes Issues Warning"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPOUlBMmI1dVZPSkVCdmFBblRXam9YeEk2dkg3bjVXbWExQlVOM0VTLVp2QmhsSTJLREZNdC16cl9RbDhWXzNlaFpNc2MwTHVtS3BBMzlCNXRseDhPYy0xOEgwQU5YSXJjbkxMUGJJUmhLdzhEdFZ4UGk3TTViQTJXQXpqSWQ0R1k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Trump’s Ethereum wallet moves $2.4M in crypto to Coinbase - CryptoSlate",
        "content": "An Ethereum wallet thought to belong to former U.S. President Donald Trump recently moved millions in crypto earned from sales of non-fungible tokens, according to reports from Arkham Intelligence on Dec. 27.\n\nArkham noted that Trump’s wallet began to send his ETH holdings to Coinbase three weeks ago and has moved 1,075 ETH, worth $2.4 million, to the exchange. Arkham added that Trump’s wallet previously held $4 million at its peak.\n\nLive Arkham data shows that Trump currently holds $1.39 million of ETH. He additionally holds $644,000 in MATIC and small amounts of other cryptocurrency tokens for a total of $2.22 million. Arkham’s data additionally indicates that the wallet did not initiate any transfers to exchanges before December.\n\nThough Arkham suggested that Trump is selling the recently transferred holdings, the attached transaction log only shows deposits to Coinbase. The log does not explicitly show that he has sold or converted the funds to another asset.\n\nFunds likely linked to NFT sales\n\nThe crypto wallet in question is believed to belong to Trump based on Arkham Intelligence’s findings. Arkham asserted in August that the wallet belonged to Trump based on information in a financial statement released that month.\n\nForbes India separately reported on Trump’s financial disclosure at the time. The wallet’s balance appears to originate at least in part from Trump’s NFT sales.\n\nSales of the Trump-themed NFTs are conducted through a firm called NFT International LLC. The company claims it does not operate under Trump. However, Trump has been highly involved in promoting the NFTs and has hosted various events for those who purchase the collectibles. He has seemingly collected royalties and revenue from the sales, as explained above.\n\nThe company has so far released three series of NFTs. The latest batch of NFTs attempted to capitalize on Trump’s recent arrest by featuring his mugshot photo. High-quantity purchases included a physical card with pieces of Trump’s suit.\n\nMentioned in this article"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNYlEwd0I0STZDZUFyMmhZTWhxNE5IYXpVanJYWHdHYjlSbHZnWDNQMFc3Tmg1aThSS282R0tlWnJjaEFqQ2RFS2FnbFVFMThObWdaR0ZSVjEzZ2tjdWhLNFhCZ0tiZjVpTzZJRGZfQ0Fhcm1rbmVVQWQ2OWNCcmV5RTljZ0V4NTQwNnZxMFFJYlFiTkt6eE5kbTZCMGd1TlNkNllTRkQydFhSWU1jdzlNcng0MGxjQWVCR210c1kwVi0xVU5oWldn0gHMAUFVX3lxTFAzTHlhLXA0R095WC1wRlA4cy1fQ3hQMWdGMm0xa0RVVnBaeVJqV3VrZ0ZMcGFDYlRsMHQ4YTZMcWJmZnNMYlFxa2dZS0hfaEdDQnhOcWk2d0tTOTRHa2pCRHdMR1ZsSXI4LUxhVHBrdDlYQzlvRjJJTGViOUVUZkJjV3Vqa2k4SmhRZ3hYejlmaVRyazZpNWZkbDhvWGt5Rm4zMjlnV2h6T1RfY2JZamlQTkgzYjcyY25hVFBlTXpKRjg3YjU5RXh5cTg1UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Tether Mints $8,000,000,000 in USDT on Ethereum (ETH) and Tron (TRX) Within Three Months: On-Chain Data - The Daily Hodl",
        "content": "The stablecoin issuer Tether has minted $8 billion worth of USDT on Ethereum (ETH) and Tron (TRX) in the past three months, according to the crypto tracker Lookonchain.\n\nLookonchain notes the Tether treasury just minted $1 billion in USDT on Ethereum on Monday.\n\nTether CEO Paolo Ardoino says the recent minting was an “inventory replenish” on the Ethereum Network.\n\n“Note this is an authorized but not issued transaction, meaning that this amount will be used as inventory for next period issuance requests and chain swaps.”\n\nUSDT is the largest stablecoin by market cap and aims to maintain a 1:1 peg to the US dollar.\n\nEarlier this month, Ardoino announced in a letter to lawmakers that Tether was onboarding federal law enforcement agencies like the United States Secret Service (USSS) and the Federal Bureau of Investigation (FBI) as a means of combating crime.\n\n“Tether continues to play a critical role in assisting law enforcement. As recently highlighted by the U.S. Department of Justice (DOJ), our work has helped thwart bad actors and aid victims’ recovery.\n\nTether recently onboarded the United States Secret Service into our platform and is in the process of doing the same with the Federal Bureau of Investigation (FBI). These strategic relationships reinforce our commitment to supporting law enforcement in combating nefarious activities and contributing to the recovery of victims’ funds.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPS3ZaTE9IcVRqME9IendNWFkzVDA4Rnd6ZWctSmZEWVd3NURmWGhHMjNmenl2VERuM2pSTGdLVFNON2VFaEhRZHA1YmdUQ1hIMEdiUHNRMElGamdTMlV5RVpIdy1INGpfaWhzSlY5bEJBVGVrYl9lYUp2Z0FnVTZEczlmSWdkQ2N2OVAxTVRERkVsdzR2MU95YWVUNWVpQUtPRWRxZWw5X3nSAa4BQVVfeXFMT282a0ZnYXA4R0w3YXFHOGkyWE9JdmxBdUM0ZXVEZmduNVVaR3pidWl1bGRhZ0VyZ2NOdGY3RlJXVEV3NG1kWjZ2S2d6eUN3N2RsajZHVURXemtwc05mMmlxYkNxa2pmUXJYYlZiS21aRHlOWmtCZXloclJvendmZ3BwYVl6MGFicUd2RlRROGVsTWVjR2RXQ3RxbzdQcFdGTmw4WkxDbEk2Wm0xMFZ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "$170 Million of Solana (SOL), Bitcoin (BTC) and Ethereum (ETH) Liquidated Amid Crypto Flash-Crash - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a sudden market shake-up, over $170 million worth of Solan, Bitcoin and Ethereum were liquidated, as depicted by the latest crypto liquidation data. This flash-crash event has rattled the crypto sphere, occurring just a week before the New Year — a time when such volatility is not typically unexpected.\n\nAdvertisement\n\nThe end-of-year period often sees a shift in market behavior. Retail investors are known to cash out for the holidays, and larger investors close their positions to avoid unpredictable swings during times of reduced liquidity. The liquidation data reflects this trend, showing a substantial number of positions being wiped out in the face of rapid price movements.\n\nOrder books tend to thin out during the holiday season, with reduced trading volumes and some market makers stepping back, increasing the potential for volatility spikes. This environment can lead to quick and severe market movements, as currently evidenced on the crypto market.\n\nAdvertisement\n\nDespite this, the overall market still exhibits signs of an uptrend. The $170 million in liquidations, while significant, is not indicative of a market downturn but rather a typical response to the year-end climate. It is a pattern familiar to seasoned crypto enthusiasts, where the combination of profit-taking and risk aversion can momentarily disrupt the market.\n\nHistorically, as the New Year begins and normal trading volumes resume, the market stabilizes. The situation usually improves by mid-January, once institutional and individual investors return to their desks to reengage with the market.\n\nLooking at the broader picture, the uptrend trajectory remains intact. The recent liquidations, although impactful, are unlikely to derail the general market direction. The crypto ecosystem is known for its resilience, and the current liquidation wave is just another test of this attribute."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOc1MzR3QtNDF6NENTb3lZUzNXRzltT25WeFVnbzliRDYzSjV2TENnMmlBcVBKNWdnRTZ2S0VsUGJjckpEb1NlRFZfd3JqeXpnckRuZXk3TjBJeWV6Zi1hOUJlbjFERXEzdnBwSVlOdUJ5WnJkS0FBaDZadDgzRGsweVFVcWI3ODQ1aEtLa0tNc1daMjNpZ1ZhX19lV0dmLTBjU0lSbUVSanFtY3duWlFpRnl1c1pNc0tsdGEyMjNpTGZYN0pa0gHKAUFVX3lxTE5VZjZ1M3JmZEo1MjZRRWJHcVRCM0Rya1BaSUk0TU5pUHVWUTJMMDZEOTJYRV9SX3NITjl2MUNoN0liSTdseGdZVWpkU21iWW9IZXpORjRKbXhkdVJuZmVBZHUyUWtZdkxzRDN6VXprZWlpaThiUTRfbUY1eFItUVl3ZjNneFZBc2tOMGhzOVk5a1MxalU0ZVBLYTJTZGY5eEtjVWl0Zm9DSGVja0dTVmMxWVJfcjk4M21hWnc1c25reklwaDVpTXREZVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Incoming Ethereum ‘God Candle’ Will Catch Many off Guard, Says Crypto Analyst – Here’s His Outlook - The Daily Hodl",
        "content": "A closely followed crypto trader believes that Ethereum (ETH) is gearing up for a sudden massive move to the upside that will take many by surprise.\n\nPseudonymous crypto analyst Inmortal tells his 203,700 followers on the social media platform X that Ethereum could soon approach the $3,000 level, a more than 34% increase from its current value.\n\n“Ethereum god candle will catch many people off guard.\n\n‘ETH is dead.’\n\n‘ETH is broken.’\n\nDo you think this market gives a s**t about that? Human greed has no limits.”\n\nThe trader shares a chart comparing ETH’s current price pattern to a similar historic Bitcoin (BTC) price pattern, suggesting that ETH is about to go on a massive rally, flipping a key resistance level at around $2,400 into support.\n\nHe also predicts that Ethereum will soon soar out of a descending triangle against Bitcoin (ETH/BTC) and hit 0.069 BTC ($2,926) next month.\n\n“Do it.”\n\nETH/BTC is trading for 0.05251 BTC ($2,228) at time of writing.\n\nNext up, the trader gives a bullish outlook on ETH competitor Solana, sharing a chart where he predicts SOL will increase to about $500, a more than 350% increase from its current value, by early 2025.\n\nSolana is trading for $111 at time of writing, down 6.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOWnZfc1JyV3B3RDRWbGZJajFGaW1CZE9xMjRhM21IbmR6UDlub1psODhycFNPU0Y4MFo1LTVFMzFhbHJEOXZLSm55Q0lyTkJkTDJwOFdBRnliVW9aaS1GT3YwTFJXMXVlX3B6MjI5YjRPbmRLeVhjTkhfWkRUSkF4TTBvZkZDbWcxaUZscGl4WlZGcXFqbC1DejRIZGFRbW8tdDhDTm9WZkJrTGJieWxQdzJfWkVObXRLb1RfT1l1YjFfTUxENVRGMGlsSHAtd9IB0wFBVV95cUxPNkVhWkItY1VyQUM1WWJWcGIxRE1IVFR4bzg0QXI3bXhLLVM0dlNlMldHWlQxUUZ1dlY0MWVlM0otTU4ydTd0R0x1YkNIb0FHYVhjM0dJaG03OHRlME9RclJ3YjY1bzhKRFFZUzJHRG95QVRDV1JZQTF1N3lFVXlhNEF3SHZsZ1NTQ2k5WGQ0akQwS0Nia09vLWxsaGFsUWxsd3daVjA3T2hpV05saEx0ZDhWUDBMNFhmRl9hUklqU3d3YS03bzIwX3V4TGNxcGNwaWlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "New Whales Suddenly Accumulate Chainlink (LINK) and One Additional Ethereum-Based Altcoin: Lookonchain - The Daily Hodl",
        "content": "Deep-pocketed investors are suddenly scooping up massive amounts of Chainlink (LINK) and one other Ethereum (ETH)-based altcoin, according to on-chain data.\n\nThe blockchain data tracker Lookonchain noticed that newly created crypto whale wallets were accumulating two digital assets Wednesday using the top global crypto exchange Binance.\n\nOne crypto whale scooped up more than $4 million worth of decentralized finance (DeFi) protocol Maker (MKR), according to Lookonchain.\n\n“Fresh whale wallets are accumulating MKR and LINK today.\n\n0xE68E withdrew 3,150 MKR ($4.55M) from Binance [Wednesday].”\n\nMaker is trading for $1,489 at time of writing, up 4.8% in the last 24 hours.\n\nLookonchain says another whale is accumulating large amounts of decentralized oracle provider Chainlink, having loaded up more than $2 million worth of LINK Wednesday, on top of the nearly $5.8 million the whale bought 10 days prior.\n\n“0x8eAD withdrew 136,146 LINK($2.05M) from Binance [Wednesday] and has withdrawn 384,006 LINK ($5.79M) from Binance in the past 10 days.”\n\nChainlink is trading for $16.40 at time of writing, up 9.4% in the last 24 hours.\n\nLookonchain also noticed that one crypto whale made enormous profits trading decentralized finance (DeFi) lending protocol Aave (AAVE).\n\n“In 3.6 years, this early AAVE buyer turned $500,000 into $13 million, making $12.5M (25x)! He sold 30,000 AAVE($3.01M) via Cumberland to take profits [Tuesday] and has 100,000 AAVE($10M) left. He spent 500,000 USDC to buy 12.5M LEND at $0.04 on May 6, 2020 (migrated to 12,500 AAVE).”\n\nAave is trading for $109.50 at time of writing, up 6.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Tithi Luadthong"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPSEhDSVJ3cWtYbGpEcS1NanMyWHZQelBNc1M5MXU4YWdtVWhWbldRZ1I4SWh6RC1PQk90YVI5NExfWkVSYzdwellTbDd3a280czJpZ21CZmFtWUstY3ZsLTdpZ00ydFYxeWhmcV9qQ1NmeWV5UXZjcEdhY2NwTTZ4TU10Q0c5Z2V0dTc3V2pOV1EtbS1wRTdLaGxwUXZRb0RrNlY4bzRNTnhXdW9MRUNodmlZT250a2hicG5fczN1RXp3bGRfTEhja1p6bk9NdUlSSVl4U25sTzDSAd4BQVVfeXFMTVhxWVFPd0h4WmxVNWFvdm5vNVQxUUJHU0F2TFM5LWMxTEtsQlJ4TzZ4RGdwaWJqWDBoYXNwYVcyTU0yLWJmMHlIa3d1WllzMGVVRW5FbFBpQndHSHJJWFBaYzRZRFJ2S1pXblhjVXdiWFBfRXlZR0NaUkxaT25qYXBrdURFY3NQRVZ4QWRmSHMtanE3aGRLOWh3ZmwwWmc5T001WXNBQjVkcHFVMV9iTDhaaWhsT0RrMFlzMnN6TlRCZnZvTVJvd3dTT1VPX0ozRXdmSmlJdE9ZTkJsVVNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Top Analyst Unveils Massive Price Target for Surging Ethereum Rival, Calls Altcoin This Cycle’s Darling Chain - The Daily Hodl",
        "content": "A trader who accurately called the bottom of Bitcoin’s (BTC) 2018 bear market thinks that the uptrend of one Ethereum (ETH) challenger that has massively outperformed the broader crypto markets this year is far from over.\n\nPseudonymous analyst Bluntz tells his 233,400 followers on the social media platform X that the people who are calling for the end of Solana’s (SOL) big rally this year will most likely miss out on the altcoin’s surge to a fresh all-time high (ATH).\n\nAccording to Bluntz, Solana has a lot more gas left in the tank as he predicts that SOL could still print gains of more than 257% from current levels.\n\n“SOL is still 113% away from ATH. Why is everyone so hell-bent on calling tops? What the f**k is wrong with y’all?\n\nJust buy dips all the way to $400.\n\nNot a single person is ever going to remember the guy who may or may not have been successful in shorting a 10% move down, but they will remember the chads who long all the way to inevitable all-time highs.\n\nDon’t overthink it, SOL is this cycle’s darling chain, embrace it.”\n\nAt time of writing, SOL is worth $112, up more than 1,000% from this year’s opening price of $9.99.\n\nLooking at the low time frame charts of Solana, the trader thinks that the altcoin is poised for another leg up against both the US dollar and Bitcoin (SOL/BTC).\n\n“Nice little 12% dip there on SOL in a monster uptrend with a few more legs to go in my opinion on the BTC pair and USD pair. Don’t fight the trend.”\n\nBluntz uses the Elliott Wave theory in his technical analysis in an attempt to predict future price action by following crowd psychology that tends to manifest in waves. According to the theory, a bullish asset witnesses a five-wave uptrend to be followed by an ABC correction before the next leg up.\n\nLooking at the analyst’s SOL/USD pair, he seems to suggest that the pair is in a position to rally once more after completing an ABC correction. For the SOL/BTC pair, he appears to predict that it could rise above 0.0034 BTC, worth $144.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxPT2h6clhBT2tBaVVfUjM1LURRQllSbmpSSWd4YktfZDRudHJoLW1oNTZTampmaElKbWJhckxEVC1IalB2YmJHV1NmcDYxdUdiRjdCVExNaHpqLUluZEVINVM3NDJ5MG1RdFhFbmlBZm1CSVRVT0hQc01xZnp6WmFxa1IyTjBqUUptU0k3aGhybGlCYWVZY2tlUFNaaTVma1VDT1FEN3RBV1dUVkZyVzhFZTcxWENlZjVzdFoyR1lOVGxQV2E2RHU2cENR0gHPAUFVX3lxTE9KVnFBTnNXaUFDbUxnWElkTXdsY2lGUGRLR1k3SnExYktLTmkwc2w4cUE2b3FHS1pmT0lNdm01cFd5T1dJMy1tSGQ5dmNXYlVncVhaQ0RiS0prc09UZGVFZWEwa2NvUDBHSTh2eVcxUkh6d2Q2aDAtd1EyZG92M1h4dmlXQ2R5VTRCaEVCLWNUZExaSHdLbDZ3Wkl5Tl8wdWhQNzNSN0RjTV9Gcy1NS0pPNnJVN2xWTWJLNUdaeVdjRlhMSHlmNGgxaUM0T0pOQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Coinbase’s Ethereum Layer-2 Solution’s Total Value Locked Hits New All-Time High, Reaches $742,000,000 - The Daily Hodl",
        "content": "The total value locked (TVL) in Base, Coinbase’s Ethereum (ETH) layer-2 scaling solution, has hit a new all-time high, reaching nearly $750 million.\n\nNew data from layer-2 blockchain tracker L2Beat reveals that the TVL of Base is hovering at $742 million at time of writing, a new record high and an exponential rise since July 30th when it was sitting at just $2.19 million.\n\nTVL refers to the amount of capital deposited within a protocol’s smart contracts and is often used to gauge the health of a crypto ecosystem.\n\nAccording to the data, the top five digital assets with the most total value locked over Base include ETH itself, stablecoins USDC and DAI, liquid staking token Rocket Pool ETH (rETH), and Wrapped Lido Staked Ethereum (wstETH).\n\nOther notable virtual currencies on the list include the decentralized exchange (DEX) platform SushiSwap (SUSHI), decentralized finance (DeFi) protocol and stablecoin DEX Curve Finance (CRV) and crypto lending protocol Yearn Finance (YFI).\n\nBase, which went live for developers in July and the wider public in August, was built in collaboration with layer-2 scaling solution Optimism (OP) and currently has no plans to issue its own native asset.\n\nFurthermore, data from Dune Analytics show that the number of Base users has been on a slow climb up since the protocol’s public launch on August 9th. Back then, the total number of Base users sat at 452,386. Today, there are 3.16 million users on Base.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE54ZXFPRGtMMFlBa2d3Z2xydVJsOUY4ZndiYlhXTG51UXo1aWNvTTd2bU1KLUhhX1RmT0dRSzRXSkJ6akZVaG14LURLd0EyNGxBZ3lxeVhUOHNRUm1ialdtSXJybVpJVFloOUVuX0NfdHdsa0NhbjlLTl9RZm0wa2M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Crypto: 'Solana Is Ethereum,' Says SOL Founder - Cointribune EN",
        "content": "Wed 27 Dec 2023 ▪ 3 min read ▪ by Ariela R.\n\nAnatoly Yakovenko, co-founder of SOL, highlights a new era of collaboration between Solana and Ethereum. According to him, Solana is Ethereum. This intriguing vision paves the way for crypto interoperability.\n\nSolana is ethereum! Solana is an ethereum L2 through the wormhole eigenlayer. Once danksharding is scaled up no one is going to stop you from submitting all the solana blocks into some data validating bridge contract on ethereum — toly 🇺🇸 (@aeyakovenko) December 26, 2023 Anatoly Yakovenko is convinced: Solana is Ethereum\n\n“Solana is Ethereum”: What Does the Founder of the SOL Blockchain Mean?\n\nCrypto analysts have always considered Solana as the “Ethereum Killer”. But recent statements by Yakovenko are changing the narrative.\n\nIn a recent post on his X account, Yakovenko is expanding the horizon of the crypto blockchain by suggesting that Solana can be more than a mere competitor to Ethereum. Specifically, the co-founder of the SOL crypto platform explores the notion of Solana as a layer 2 for Ethereum.\n\nIn his comments on platform X, Yakovenko explains that this symbiosis is possible through the “native wormhole layer.” Danksharding, Ethereum’s scalability upgrade, then becomes the key to this collaboration. It will improve scalability, thereby paving the way for unexpected cooperation between two crypto blockchain giants.\n\nDanksharding: The Path to Crypto Interoperability\n\nAccording to Yakovenko, Danksharding appears to be the key that unlocks the potential for interoperability between the two crypto platforms. He maintains that the extension of danksharding will facilitate the integration of SOL blocks within a validation relay contract on the Ethereum crypto blockchain. This underscores a collaborative approach to bridging protocol and consensus differences.\n\nThe different consensus mechanisms between Solana and Ethereum raise questions about the stability of this crypto alliance. Some users wonder about the possible reorganization of Solana as a layer 2 if Ethereum adopts a different approach. In this regard, Yakovenko assures that users can withdraw their crypto ETH tokens from the bridge. The agreement from both sides remains essential, however.\n\nHowever, he acknowledges that mutual agreement is necessary for seamless integration. He thus highlights the challenges that remain despite the innovative vision of crypto interoperability between Solana and Ethereum.\n\nYakovenko’s bold statement marks a turning point in Solana’s perception towards Ethereum. This exploration of crypto interoperability, fueled by Danksharding, promises a collaborative future in the complex universe of blockchain.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPTmxsOTZsTGpjenN5Q05FcnhYOE91MkIyOFBjeDdhWTNNaUpTN1c5TjdzZzE4amZWNjJiN0JFMmtkS2VLY1hVNXZTNjR2Y2JLRVdobnNEa2IxY1hJaGZxcVYxZmtSZ29wTk4xRGhERUZ3MGM5Y1FHUHBoQ1VrX1ZNYmZ5SEJNbFBXdG9ybFhmcmdCaDR2cFM1cVZpZkFlb21YQmFZSHZrT1_SAa4BQVVfeXFMTUxrNEJHNFNKbGJYSlRnWVd6N3BCMklwNDRxUG5VRHRjakE5LWs4ZTNhYXpHVGwtNG1SRnJHbFROZGE5VjVEZHk5MGc0ODhRRXJleUpqVmZucGpMMTMwaVNxNDhEWEhSNmt1eG9zNlZvVEFBNEZ3eTdlVzB1MG03M0lsOWdmWXdWdnlDbGp4eDVUcjNpWUktWndPSWRBSlB6V2dJUEpjM0E5US1oem1B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Tron Founder Justin Sun Sparks Concerns With $13.8 Million Ethereum Withdrawal From Binance - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a recent development that has sent shockwaves through the cryptocurrency community, Justin Sun, the founder of Tron, has raised eyebrows with a significant withdrawal of $13.8 million worth of Ethereum (ETH) from Binance. The transaction was highlighted by PeckShieldAlert, a prominent blockchain security company, in a tweet that raised suspicions surrounding the withdrawal.\n\nAdvertisement\n\nThe tweet mentioned that the address 0x9FCc...19Fe had initiated a withdrawal of 6,166 ETH (equivalent to approximately $13.8 million) from Binance. The mention of \"Suspicious Justin Sun related\" has triggered concerns and speculation within the crypto space, leading many to question the motives behind such a substantial withdrawal.\n\nAs of the latest data , the current price of Ethereum stands at $2,239, reflecting a 1.55% decrease in the last 24 hours. However, the cryptocurrency has witnessed a more significant surge of 7.22% over the past 30 days. Interestingly, despite recent market fluctuations, Ethereum's trading volume has surged by over 14.89% in the last 24 hours, reaching a total of $9,184,315,852.\n\nAdvertisement\n\nJustin Sun's cryptic moves\n\nThis development comes on the heels of Justin Sun's earlier notable withdrawals, where he pulled out massive amounts of Shiba Inu (SHIB) tokens from Binance. The first withdrawal involved a staggering 500 billion SHIB tokens, followed by another withdrawal of approximately 77 billion SHIB tokens. These transactions had already raised eyebrows within the crypto community, prompting discussions about Sun's strategic moves on the market.\n\nAdding to the intrigue, on May 11, Justin Sun announced his decision to actively engage in trading meme coins and promising projects through his public address. The declaration indicated a shift in Sun's investment strategy, opting for more speculative and meme-driven digital assets.\n\nThe latest Ethereum withdrawal only adds to the growing concerns and speculations surrounding Justin Sun's cryptocurrency activities. The crypto community is now closely monitoring further statements or actions from Sun that may shed light on his motives and intentions behind these significant transactions."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQY0lJMXB3ckFEbkhRQ3pkVkduQV9lOXB3ZmNxMXBqelh3X3RCb25nNm9ZVjFTdlhLc2VXVXNIamxGcWlxY0VZMzlWVkJFM0lQM3g4bTQwdld2QndXejcwRWtNMkgxSUV3UmNRT3FDSnc4VXlkV2t0blptYUlZaFN4LUVTb1paakc1SXB4OXphd0x3Ujc0elVXVjNvVXBVdkdNQmt4LWZtb0lNOGxwWXVzV9IBtgFBVV95cUxNLU9Pa21wRXpqRGdabnBvQXpmVmRjVmR1Tld6Mk5ORzVsVDVpb29LTzYzcWhVUEZrSW9zUllFY0NPWVE0eUJ0S2U1RW15LTlZU0FBS2oza1B6bVg0UlM5S2pUNmo1bDkwN2E5RXUzMnk3TGhVOERtam15Z0tNcEFNSE9KOTUzSk9ub05RbzBoVXZrODJTVXdqbWhBX1loQ2dvdWRxMGdLTG9zNy1YMEc4YXIxNnNEUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Crypto Wallet Linked to Donald Trump Sent $2.4M in Ether to Coinbase - CoinDesk",
        "content": "Arkham tracks the wallet on its platform and it holds $2.2 million worth of various tokens as of Thursday. It tied the wallet to Trump in August based on public financial disclosures, which mentioned the same amounts of token holdings as found in a wallet holding the largest royalties derived from the Trump NFT sale."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPWTJaMlpjd0ttSGttYV9aXzVLSlh1YzVqVTR6enJiOTFaclo5ako3NzVJUWc3LTd1d2Vfb2RrbkdYNV9xRVZVY0xUMUZxcWYzY1o1dTJBQ2M0R2plZVF1ZmRUeWRtaWpHb1B4MGZUaDlKVm5kWEdWWlBOMUVDYXh4d1A0d2NlWlA5S29N0gGQAUFVX3lxTE1kOW1aUHZfbUJGaFV6TUc1cmgydFMxWHFyVUNDOGZQeTYyZTc0WW1YN19Da3NBeGoyazNNM214VFg3LV8wV0pSemYxUEJabHdDcExRUnRwN0hRM3p3Q01KS3dsQnZVWTRQVnpmU094TGZ0ODE2ME9NakZGTlROWDJTZnBHWHJ2bjlwS3NESW53eQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Exits Correction Trend With 6% Jump, Is $2600 Within Reach? - CoinGape",
        "content": "Despite the ongoing uncertainty in the crypto market, the second largest cryptocurrency Ethereum (ETH) has managed to sustain above the $2150 level. This level coincides closely with the 23.6% Fibonacci retracement level indicating the overall trend of this asset remains bullish. With an intraday gain of 5.3%, the ETH price has just offered a breakout above the resistance trendline which traced the correction trend indicating an early signal of uptrend continuation.\n\nAlso Read: Ethereum Ain’t Dead: Here’s Why Ethereum Can Outperform Bitcoin in Q1 2024\n\nadvertisement\n\nIs ETH Price Ready to Surpass $2500\n\nThe ETH price breakout from the overhead trendline should release the build-up momentum\n\nThe coin buyers may face potential supply pressure at $2400, followed by $2665\n\nThe intraday trading volume in Ether is $12.8 Billion, indicating a 30% gain.\n\nAfter witnessing steady growth from mid-October to early December, the Ethereum price shifted its projection sideways in line with the current market uncertainty. This last three weeks’ consolidation gives a view of price sustainability at higher levels and a short breather per buyers to recuperate the rest of the time.\n\nInterestingly, the ETH price was actively rebounding from two converging trendlines which acted as a dynamic resistance and support. Today, the Ethereum price witnessed a significant inflow, which led to a decisive breakout from the upper trendline in the 4-hour time frame chart.\n\nShould this candle close above the breached level, the buyers would obtain an early signal of uptrend continuation. With sustained buying the ETH price should surpass the last swing high resistance of $2400 to obtain a better confirmation and entry opportunity.\n\nAs per the Fibonacci extension tool, the post-correction rally can chase a potential target of $2665 aligned with the 0.618 FIB level\n\nKey Level to Watch\n\nWhile the current market outlook for Ethereum seems strongly bullish, the coin buyers may face renewed supply pressure at the $2400 mark. In case this resistance triggers another correction, the coin holders can rely on an ascending trendline that has been offering dynamic support to the ETH price for nearly two months. The coin price rebounded several times from the support project the buyers continued to accumulate at market dips, which is a strong signal of an established uptrend. On the contrary, a breakdown below this support would trigger a significant correction in ETH price\n\nBollinger Band: The flattish upper boundary of the Bollinger Band indicator offers an additional layer of resistance at $2400\n\nVortex Indicator: A bullish crossover between the VI+ and VI- slope signals a recovery trend in active.\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE5JNHZQUk81RzcyOGVTbWpsRGdPQy00SXBuN0N1bVA1NlZUN2owcHBpanlHRl83YU9hdklaRGU1bkVkVjdxTGZVd1dVUU80YUs3a2NReU1DSkNFY0hTd0k3SkQwNkh5VVFJRF94a3ZxenlKRTTSAXhBVV95cUxNek5DOWQ0RmJZTU9SaGFCc1lHYmxxSmlYbUxYOGVWRlVuTl9PZ3lETlJCWVZWa25VU29pYUdLM1FqMkFaYzRlaVdfdlNVazlNX1YtNGx1bEg2WGlRcTNYc2RuTlF5RWZEQUpBazNVcHg1REtwVFJQY3o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin shows Ethereum who’s boss – Here’s how - AMBCrypto News",
        "content": "Bitcoin collected $93 million in fees in the last seven days, 38% more than Ethereum.\n\nThe price of Bitcoin was 5.59% higher than the average price at which all coins were bought.\n\nBitcoin [BTC] became the number one-ranked network in transaction fees collected over the last week, giving proponents of its ‘transaction settlement layer’ narrative something to cheer for.\n\nBitcoin miners rake in the moolah\n\nAccording to AMBCrypto’s analysis of Token Terminal data, the first-generation blockchain collected $93 million in fees in the last seven days, significantly higher than Ethereum’s [ETH] tally in the same period.\n\nThe spike in fee revenue boosted miners’ overall earnings, which are made up of transaction fees and set block rewards.\n\nThe average daily miner revenue has increased from $25 million in October to more than $40 million in December, AMBCrypto discovered using Glassnode’s data.\n\nBitcoin’s prominence as a transaction settlement network was also evidenced by the jump in average fees paid for each transaction.\n\nAccording to Glassnode, the mean fees climbed exponentially over the last month. Users had to spend as much as $37 on average to get their transactions validated on the 17th of December.\n\nThis, for a blockchain that barely saw average fees cross over $2 in 2022.\n\nOrdinals craze boosts Bitcoin’s prospects\n\nThe spike in fees was a consequence of the growing demand for Ordinals inscriptions. The total number of inscriptions on the chain topped the 50 million mark as of this writing, AMBCrypto’s examination of a Dune dashboard revealed.\n\nOrdinals took the blockchain world by storm in 2023. Pioneered by Bitcoin in early 2023, other EVM and non-EVM chains have mimicked the technology and launched their own Inscriptions.\n\nThe dominant use case has been creating NFTs on-chain, which has significantly boosted Bitcoin’s NFT activity.\n\nAs per CryptoSlam, Bitcoin has been the dominant chain for NFT trades over the last month, with cumulative sales worth more than $797 million.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nBitcoin fell back to the $42,000 region at press time, as a few profit-hungry traders exited the market. As per CoinMarketCap, the coin lost 1.34% of its value in the last 24 hours.\n\nShivam Thakral, CEO of Indian cryptocurrency exchange BuyUcoin, stated in a quote shared with AMBCrypto,"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOYUZ0cXkxRjJLTkVibFRoVFE1OFRoaGNoMUVKSV9SUGhfY1M4SnRnaVQ4LU9vSTg1dVgxM0N6Qkg1N1kwQzBqbXdzVjJIN0JqSkw2SkREY3pncFp4RnVxMlQ3MzN2V1JTMVp3a2IyM2oyZjFtOXl2bVRVWkVwR2NWc1JtY2xuRG5majBSTVJZVkw1WHZyNm51ZnRNSGo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "The best crypto books of 2023 - Fortune",
        "content": "In 2015, New York Times reporter Nathaniel Popper published Digital Gold, an early account of Bitcoin that holds up as one of the best books on crypto. Since then, there have been a flood of other titles as publishers rushed to cash in on a subject defined by easy riches, outrageous characters, and a mind-boggling array of scams.\n\nThis past year brought a new glut of books. Unlike the ones published during crypto boom years, which pulse with a mix of greed and adulation, most of the 2023 titles came wrapped in a thick sheen of scorn—and understandably so given the spectacular frauds, epitomized by Sam Bankman-Fried’s FTX, that defined the industry’s most recent bust.\n\nHere are Fortune Crypto’s picks for the three best crypto titles of the year: two of them monuments to crimes, and one a reminder that the broader blockchain industry is not only alive and well but becoming part of the mainstream financial system.\n\nGoing Infinite: The Rise and Fall of a New Tycoon\n\nBy Michael Lewis\n\nStar business writer Michael Lewis—whose bestsellers include Moneyball and The Big Short—enjoyed an unprecedented level of access to boy king Sam Bankman-Fried right up until his $32 billion empire unraveled in the space of a week.\n\nThe published version of Going Infinite is not what Lewis had intended to write, and, indeed, the first version of his manuscript cast Bankman-Fried as a sympathetic figure poised to change the world through the nebulous philosophy of effective altruism. The final text reflects how Lewis had to adapt his story upon learning that the young mogul’s tale was all a web of lies.\n\nThis abrupt pivot results in the last chapters of the book becoming an intellectual scramble as the author can’t quite forsake his onetime protagonist. But that doesn’t matter much given the incredible amount of mind-blowing detail Lewis is able to reveal about Bankman-Fried, his family, and the bizarre, hypocritical lifestyle he forged while walking the highest corridors of power in Washington, D.C., and raising money from everyone from Tom Brady to Sequoia Capital. Going Infinite will join Digital Gold as one of the all-time best crypto books.\n\nNumber Go Up: Inside Crypto’s Wild Rise and Staggering Fall\n\nBy Zeke Faux\n\nAs the title suggests, there is nothing subtle about this book. Bloomberg journalist Zeke Faux takes the reader on an up-close tour of the very worst people in crypto—from the grifter/rapper wannabe Razzlekhan to the Bond-like villains slinging billions of dollars of digital assets in murky cross-border business dealings.\n\nNumber Go Up is often uproariously funny, most notably when Faux risks his kids’ college savings to temporarily purchase a Bored Ape NFT in order to attend a cringe-inducing party of crypto geeks. But the book is also a sober look at the darker side of crypto. In particular, Faux shows how the unregulated stablecoin Tether has helped to power a sinister industry called pig-butchering that relies on slave labor to text lonely people and dupe them into sending money to offshore criminal gangs. While the people behind Tether are unquestionably shady, Faux’s drive to expose them sometimes takes on a monomaniacal quality, and his campaign to show the entirety of crypto is a scam feels more like advocacy than reporting. Still, this is a relatively minor quibble with an otherwise excellent book.\n\nEthereum for Business: A Plain-English Guide\n\nBy Paul Brody\n\nEven as scams and scandals dominated news coverage of crypto for most of 2023, the industry continued to plod forward and—to the likely disappointment of its many haters—even flourish. This book by Paul Brody, Ernst & Young’s global blockchain leader, explains why that’s the case.\n\nEthereum for Business shows how a growing number of real-world enterprises—from banks to shipping agencies—are using the power of distributed-ledger technology to improve security and efficiency in everything from payments to supply chains.\n\nThe book is not a narrative yarn like the others on this list, but is instead a practical overview of an emerging field in crypto and business, focusing on Ethereum—the second-most-valuable blockchain and one that popularized the use of autonomous smart contracts. It will be helpful reading for anyone interested in how technology is changing business and benefits from Brody’s clear, straightforward writing style."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNam5TXzAwUG1zbjRSeXF2SkpmU3FsUzlFS0dyQ3p3TUFOZHRwa1lNaFhydkp1b1h3c1NkU2RmNm9tU1lpYTdqaENfU05DckNjaWp3aUgxVFEydXlTTTVIS1hkYm1WbGFodVo1Q0dOT1d1czhVQk9NX2xKUXkwVmhmTU9zOXdybXRfdHVMVGlmdU1wUVNFQUdQX0VIdWxVWTVVNHJ6dWlZVkhDa3A4MDNwZURfSURJcHU3TVlySS1UVWd4UXF4aEtsVnJMNVY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Airdrop hunters plough $345m into fledgling blockchain to get new token - DLNews",
        "content": "Manta Pacific's TVL spiked 1,250% in December.\n\nIt is now the seventh biggest layer 2 blockchain network on Ethereum.\n\nOther layer 2s are also ratcheting up airdrops.\n\nCrypto airdrop hunters have deposited $345 million into Manta Pacific, Manta Network’s Ethereum layer 2 blockchain, since December 14.\n\nWhy the sudden interest?\n\nBecause of an airdrop expected in early 2024.\n\nAirdrop hunters have deposited Ether and stablecoins into the blockchain to obtain rewards scheduled for distribution in January.\n\nManta Pacific’s TVL has skyrocketed 1,250% in December. This spike has made Manta Pacific the seventh largest Ethereum layer 2 blockchain per total value locked, according to data from Ethereum layer 2 tracking portal L2Beat.\n\nTVL is a metric that tracks how much crypto is locked up in a DeFi protocol’s smart contracts, or in all DeFi protocols running on a given blockchain.\n\nPromising signs\n\nFor Kenny Li, co-founder of blockchain developer p0x Labs and Manta Network contributor, the TVL growth is encouraging.\n\n“These early promising signs mean that a new contender is emerging from DeFi to challenge the likes of zkSync and Base,” Li told DL News.\n\nJoin the community to get our latest stories and updates\n\nBase and zkSync are also Ethereum layer 2 blockchains.\n\nSmart contracts\n\nThe smart contract that holds these deposits is not verified on Ethereum blockchain explorer Etherscan, so it’s difficult for independent security experts to determine its safety.\n\nManta’s team says the contract has been reviewed by security experts.\n\n“The contracts have been audited by Veridise,” Li said.\n\n“At the moment, the audit is unverified on Etherscan as the contract is not open-sourced but we plan on having these verified in the future.”\n\nFor risk-tolerant crypto degens, the unverified contract has not proved to be an issue as they’ve run up nine-figure dollar deposits.\n\nInvestors were driven to deposit these funds as part of Manta’s New Paradigm campaign.\n\nIt promises five layers of rewards for early investors, including an airdrop of 50 million Manta tokens. Manta isn’t trading yet, so those 50 million tokens do not yet have market value.\n\nGetting a STONE token\n\nThis TVL growth is most likely driven by the promised airdrop because the project’s canonical bridge has attracted only $28 million in deposits since its creation three months ago.\n\nManta airdrop hopefuls receive a token called STONE in exchange for their locked Ether deposits in the blockchain.\n\nSTONE is a so-called yield-bearing token, according to Manta’s documentation. Airdrop hunters will be able to redeem STONE for Manta tokens in January.\n\nAs a yield-bearing token, airdrop hunters can use STONE to earn points on protocols within Manta Pacific that support the token. By doing so, investors can farm more STONE tokens and potentially increase their promised Manta token airdrop.\n\nDepositors also earn NFTs, which can be sold on Element, a multichain NFT marketplace.\n\nParticipants are also hunting for NFT combinations that will yield even bigger airdrop rewards, a process that requires them to acquire six different NFTs from the campaign that can be combined to get a premium NFT that offers greater rewards.\n\n$1 billion in investments\n\nManta is only the latest in a growing trend of projects enticing significant early backing with the promise of rewards early next year.\n\nBlast, a planned Ethereum layer 2 blockchain project, managed to attract about $650 million in barely a week after it was announced in November. The project now sits on top of over $1 billion in investments.\n\nLike Blast, Manta Pacific is also invite-only with prospective new entrants requiring invite codes from existing investors.\n\nManta Network did not immediately return requests for comment.\n\nThis article has been updated to include comments from Manta Network core contributor Kenny Li.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNZnZsallrcUtEaDFTb2lTYWowM3ZxcnEwSXdOd04tNHN3WjhkbUk2bXJ1T2VjOVZIXzJ5UjVkMzVVNFB3ZWRkMHU0V0JaNFNFZ1pnNldWd2ZJWjRhMTBOMDRMNDQtZG41bWZDeVJ2dVpDT2E2T2hHRXA0MTJsbzQwRzljaVRTRnhCNk5YVURRVEtVNTRsSlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Three new token projects ride $1bn EigenLayer hype - DLNews",
        "content": "Three liquid restaking projects have launched new tokens in the past two weeks.\n\nTheir debuts come amid a surge of interest in EigenLayer, the first staking protocol on Ethereum.\n\nProponents say they could kick off a new bull market or lead to the next high-profile crash.\n\nLiquid restaking tokens that will allow crypto investors to leverage Ether for greater yields are riding excitement sparked by EigenLayer, a six-month-old protocol that surged to more than $1 billion in user deposits last week.\n\nTheir rise could kick off another speculative frenzy, or another Terra-style crash, according to people in the industry who spoke to DL News.\n\nThree tokens have launched in the past two weeks, and one company announced a fundraise led by prominent crypto-focused venture capital firms.\n\nThis flurry of news comes amid EigenLayer’s decision to raise its cap on user deposits. That’s because the current crop of liquid restaking providers all intend to build on top of EigenLayer, the first protocol to enable restaking on Ethereum.\n\n“The protocols are taking the first steps into this new staking realm,” Pedro Verdades, co-founder of liquid restaking provider InceptionLRT, told DL News. “We will see more and more of this over the coming weeks and months.”\n\nEarlier this month, Kelp DAO launched a liquid restaking token, rsETH. As of Tuesday, users had deposited more than $125 million worth of crypto, according to data from DefiLlama.\n\nKelp DAO deposits topped $100 million a week after its launch.\n\nOn December 18, liquid restaking provider Renzo launched its own liquid restaking token, ezETH, and Rio, a competitor, announced a seed round led by venture capital firms Polychain Capital, Blockchain Capital, and Breyer Capital. Rio did not disclose the amount of the round.\n\nOn December 20, users began claiming a governance token, RSTK, from Restake Finance, another liquid restaking provider.\n\nJoin the community to get our latest stories and updates\n\nThose three join Ether.Fi, which launched its restaking token, eETH, in November.\n\nSince an upgrade in 2022, Ethereum relies on a process called staking to verify and order transactions. To stake, users must lock up their Ether in exchange for an annual yield. Liquid staking providers such as Lido address the opportunity cost of locking up Ether by providing receipt tokens — staked Ether — that can be used in lieu of Ether across the DeFi ecosystem.\n\nBiggest business in DeFi\n\nLiquid staking is now the biggest business in DeFi, with more than $32 billion in user deposits, according to Defi Llama.\n\nRestaking allows users to stake their staked Ether — not to secure Ethereum, but to secure protocols that would otherwise have to run on their own networks, such as the bridges that allow users to transfer tokens between otherwise incompatible blockchains.\n\nIn exchange for staked Ether, protocols using EigenLayer pay restakers, boosting the relatively risk-free yields they can earn from old-fashioned staking.\n\nLike liquid staking providers, liquid restaking providers address the opportunity cost of locking up staked Ether by providing receipt tokens.\n\nProponents say this will dramatically reduce the cost of certain protocols, such as bridges, other blockchains, oracles, and other technology critical to the crypto ecosystem.\n\n“This is the most groundbreaking evolution since Ethereum,” Verdades said. “In a few years, this will be a $20 billion to $25 billion industry and we’re [frontrunning] it!”\n\nRisks\n\nStill, others say it’s a business model that could cause systemic risk if providers aren’t careful.\n\nThat’s because liquid restaking is a leveraged play that allows users to effectively place bets on the various protocols that use EigenLayer, some of which may be poorly run.\n\nAs the market matures, observers predict liquid restaking tokens will integrate with the broader DeFi ecosystem and be used as collateral to borrow other crypto, mint stablecoins, and more.\n\nThose layers of leverage are potential points of failure, according to Lucas Kozinski, a founding contributor to Renzo. Liquid restaking providers will have to carefully manage which EigenLayer-based businesses they support and the yields they promise users.\n\n“You have to think about risk management, similar to collateral assets on a lending protocol,” Kozinski said.\n\nGabe Tramble, co-founder of crypto research firm Shoal Research, agrees.\n\nIn a report on liquid restaking published this week, Tramble and a co-author detail some of the issues of the emerging sector.\n\n“I do see significant risk though of rehypothecation,” he told DL News, referring to the practice in which a financial institution users customer collateral for its own purposes. “[It’s] something to keep an eye on.”"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNNnZpVENfM013V1pLaGpRYWJTc2xsUGxCZUF3TU03cFdjckdhakdXWlVoa3BCRmxiUnFUeG9hRjdfMWhrVDJnVVJuZmlZRmlCUzVRQ0xHNFQwc0hKMGdaNnBfRDh3WF9PM2U3aHlyenBNVmstSktFcnpJV3VZMXNRc2pwMGVaeVVsdFpfdnF4MNIBlAFBVV95cUxOOWF2Y3BaZVFfeW5ja1RQQ3FFcm5PQXhJdlQ1eUR6LUxpQlNfVnl2RUNPOEdrMDltbHpzOFliemZRaFZmMEpLVlpyNGVzb0hCNGtkVGRvdk5IbDNJWDM0Q0xxZnhZaXNLd2t1SGN4OEFPVE1DZlF5MThBMnpFRkxCMHViQWRyQzNKeURib2cydUx6M19L?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Crypto Price Prediction For December 26th: ETH, HNT, ROSE - CoinGape",
        "content": "Crypto Price Prediction: On Tuesday, the crypto market witnessed a sudden selling pressure prolonging a correction trend in several altcoins. Despite this pullback, the overall market dynamic remains in buyers’ favor, providing a new entry opportunity in coins like Ethereum(ETH), Oasis network(ROSE), and Helium(HNT).\n\nCurrently, the global cryptocurrency market capitalization stands at $1.66 trillion, marking a slight decline of 0.31% since yesterday. In contrast, the total trading volume in the crypto sphere has witnessed a substantial increase of 23.61% in the last 24 hours, totaling $74.32 billion.\n\nadvertisement\n\nAlso Read: Analysts Predict BTC Rally To Continue As Bitcoin Funding Rates Reset\n\nEthereum(ETH) Price Takes A Strategic Pause Before Next Leap\n\nIn December, the Ethereum(ETH) coin predominantly fluctuated within a defined range, oscillating between $2400 and $2133. While this lateral movement in the daily chart signifies market indecision, it came after an 8-week rally indicating the buyers are taking a breather.\n\nThis pause in momentum, hovering above the 23.6% Fibonacci retracement level, suggests a healthy market correction, potentially setting the stage for a renewed upward trajectory. Notably, Intotheblock, a prominent on-chain data provider, highlighted that Ethereum’s long-term holder base expanded significantly, exceeding 70% in December.\n\nThis shift underscores a strengthening investor confidence and long-term commitment to Ethereum. Currently, the ETH price is trading at $2141, experiencing a minor intraday setback of 1.34%.\n\nThe Ethereum price is primed for a potential breakout above the $2400 resistance, which could pave the way for reaching higher targets at $2675 and $2957.\n\nHelium(HNT) Price Offers Pullback Opportunity\n\nHelium (HNT) coin demonstrated remarkable performance in the first three weeks of December, surging 236% from a monthly low of $2.7 to a high of $9.65. Despite the overall market uncertainty, HNT experienced a 23.57% retracement, now trading around $7.31.\n\nAccording to Fibonacci retracement analysis, if the Helium price sustains above either the 38.2% or 50% levels, which correspond to $6.55 and $5.5 respectively, it maintains its bullish stance. A rebound from these levels would suggest a replenishment of bullish momentum, potentially leading to the HNT price surpassing the $10 mark.\n\nMoreover, the midline of the Bollinger Bands provides additional support, reinforcing the likelihood of a recovery\n\nOasis Network(ROSE) Price Gives Key Resistance Breakout to Chase $0.167\n\nIn line with general bullish sentiment and the formation of a bullish reversal pattern, the ROSE token price has shown an aggressive rally initiated from the 4th week of October. In the last 10 weeks, the coin price has surged from $0.0396 to the current trading price of $0.14, registering a remarkable 264% growth.\n\nIn light of an increasing volume, the ROSE price has breached some crucial resistance like $0.085, $0.116, and most recently $0.137. If the Coin buyers managed to close today’s daily candle above this breached resistance, the buyers would obtain another stepping stone for higher levels.\n\nThe post-breakout rally will surge the price another 15% to hit the next resistance level at $0.167.\n\nThe Momentum Indicator RSI at 80% reflects a strong bullish momentum and a slight hint of overbought assets.\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPN1hXTWZzNUk5VS1EZ3c4TTJDUF9HNjUyYTgtTmI4Y0IwYmxEeVJ6RjBKamVXaEhjcDU5MDN0NGZFOTRLdk1RVC1rX2tpZEdKbEJRcW01N3hvcXNzMUcwd25nZG1nSHJLcnhWZnhaV01jN3g2Wnh4UnBpdXdCMmptRDBPVi1hN2l0SUNqOHdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Ethereum’s cutting-edge smart contract framework unveiled - CryptoNewsZ",
        "content": "Cryptocurrencies have made their presence almost worldwide, prompting investors and traders worldwide to invest in them and gain substantial ROI. However, it is crucial to note that these fascinating cryptocurrencies are highly risky due to unprecedented price volatility, causing investors to incur many losses. Ethereum, a prominent cryptocurrency and decentralized blockchain, continues gaining traction and prominence in the sector despite the various potential challenges.\n\nIt is crucial to note that Ethereum is recognized as a cutting-edge smart contract, the up-to-date innovation on which our article is based, and resonates with all Ethereum investors and fanatics. Apart from delving into this innovation, it is crucial to understand existing security issues on the Ethereum network. So, let’s comprehensively unravel Ethereum’s innovations and security issues below.\n\nSecurity Challenges on Ethereum\n\nBeosin’s discoveries, such as the substantial losses in quarter three. Blockchain security firm Beosin’s recent findings, outlined in the “Global Web3 Security Report,” highlight the precarious state of security on the Ethereum network. These revelations shed light on the prevalent vulnerabilities affecting the blockchain.\n\nKey statistics on losses due to rug pulls and phishing schemes. Beosin’s report exposes the financial toll inflicted on crypto investors during quarter three, with a staggering $282.96 million lost to rug pulls. This alarming figure emphasizes the urgent need for heightened security measures within the Ethereum ecosystem.\n\nPointing out Ethereum’s susceptibility to security incidents. Quarter three also witnessed the proliferation of phishing schemes, resulting in losses amounting to $66.15 million. Ethereum’s susceptibility to such schemes highlights the growing menace of fraudulent activities plaguing the network.\n\nBeosin’s comprehensive report concludes that Ethereum faced the highest losses and incidents overall. This designation accentuates the critical need for proactive security measures to safeguard users against the persistent security threats looming over the Ethereum blockchain.\n\nIssues with the Solidity Compiler\n\nChaals Nevile, who is a technical program director at the Enterprise Ethereum Alliance (EEA), has reportedly highlighted specific issues about the Ethereum network’s security, specifically in the Solidity compiler. Simply put, according to Nevile, the emergence of new bugs while dealing with old bugs as the compiler evolves is a critical issue.\n\nThe European Economic Area, or the EEA, set up the “Eth Trust Security Levels Working Group’ in November 2020 in light of the issues to be addressed. This group played a pivotal role in releasing the “EthTrust Security Levels Specification v1” in August 2022, offering a comprehensive framework for developers and organizations navigating the intricacies of Solidity, Ethereum’s primary programming language.\n\nEthTrust Security Levels Specification v1\n\nAdvertisement\n\nRelease of the v1 Specification: The EEA released the EthTrust Security Levels v1 Specification in November 2020. This release did not take time to resonate with developers, organizations, and customers due to the structured framework it provided. It paved the way for them to deal with the challenges using Solidity, Ethereum’s key programming language.\n\nFramework purpose: How it serves as a framework for reviewing smart contracts. The v1 Specification serves as a key framework for users evaluating smart contract programmed code set down in Solidity. Simply put, the framework helps users evaluate the code prudently and utilize smart contracts more effectively.\n\nOngoing security focus: Recognition that the framework is designed to accommodate ongoing security developments. Recognizing the dynamic nature of the Ethereum network, Chaals Nevile emphasizes the adaptability of the EthTrust Security Levels Specification. While v1 covers bugs up to 2022, it remains designed to accommodate ongoing and emerging security developments, reflecting the commitment to maintaining the highest security standards.\n\nRelease of EthTrust Security Levels Specification v2\n\nAs reported by Nevile, the EEA, which is not fully satisfied with the release and effectiveness of Eth Trust Security Levels Specification v1, announced the release of v2 for enhanced performance. Hopefully, EthTrust Security Levels Specification v2 works like a charm to get on top of various issues, for example, addressing newly detected bugs in the Solidity compiler, ironing out rounding errors, read-only reentrancy attacks, etc.\n\nCase Study: The DAO Hack\n\nThe DAO Hack of 2016 is recognized as a notable event in Ethereum’s history, catalyzed by the notorious reentrancy vulnerability. This classic case, outlined by Lewellen, highlighted the exploitable nature of reentrancy, resulting in a staggering loss of $3.64 million in ETH. The incident spurred heightened awareness and a paradigm shift in the Ethereum ecosystem’s security approach.\n\nIndustry Adoption of EthTrust Standards\n\nOpenZeppelin’s use: How OpenZeppelin utilizes EthTrust Security Levels v1 for pre-audit assessments. OpenZeppelin, aware of the critical importance of security, actively employs the EthTrust Security Levels v1 framework to fortify its defenses against vulnerabilities. Acting as a pre-audit assessment tool, this framework ensures meticulous checks during the audit process, offering clients invaluable insights into potential security lapses.\n\nClient feedback: Positive feedback from a client who found value in implementing EthTrust requirements. An anonymous OpenZeppelin client disclosed to Crypto News the transformative impact of EthTrust. The client shared how previous security audits faltered due to unclear guidance, emphasizing newfound confidence after implementing EthTrust requirements. This endorsement underscores EthTrust’s efficacy in fortifying Ethereum projects.\n\nAwareness challenges: Chaals Nevile acknowledges the uphill battle of gaining recognition for the EthTrust standard despite positive feedback. Overcoming these challenges is crucial, especially in introducing the framework to developers and organizations. Notably, EthTrust’s applicability to newer Ethereum projects emphasizes its potential impact in enhancing security protocols, particularly in the context of Ethereum casino sites. Raising awareness about the EthTrust standard becomes imperative for its broader adoption and ensuring a secure environment, especially within the dynamic sphere of Ethereum casino gambling.\n\nConcerns and Future Developments\n\nJohn Wingate’s concerns about the dynamic nature of industry standards. John Wingate, CEO of BankSocial, expresses concerns about the ever-evolving landscape of industry standards. He highlights the perpetual changes in languages, including the depreciation of methods, variables, data types, and object types. The dynamic nature challenges consistency and adherence to the best practices within the blockchain space.\n\nConfirmation that version 3 is already in progress. In response to industry dynamics, Chaals Nevile reveals that EthTrust is actively evolving, with version 3 of the specification already underway. Recognizing the need for regular updates, Nevile aims to ensure EthTrust remains relevant and effective in addressing emerging security challenges.\n\nAdvertisement\n\nImportance of testing: Emphasizing the need for repeatable, automated testing for decentralized applications. John Wingate emphasizes the significance of repeatable, automated testing as the paramount method to guarantee decentralized applications adhere to best practices. Automated testing is a crucial tool in fortifying the resilience of decentralized systems against potential security exploits.\n\nConclusion\n\nConsidering the complexity of Ethereum’s security, the discourse around EthTrust emerges as a beacon for fortification. From exposing vulnerabilities like reentrancy to deploying the EthTrust Security Levels v1 framework, the Ethereum community is actively fortifying its defenses. While positive feedback underscores EthTrust’s efficacy, challenges in industry adoption persist. Chaals Nevile’s assurance of version 3’s progress signals a commitment to staying ahead in the security paradigm. John Wingate’s advocacy for automated testing reinforces the imperative of proactive measures. As Ethereum evolves, the collaborative efforts of industry players and evolving standards promise a resilient and secure future for decentralized applications."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxNM0tYZmVUbDgycVZJdEhPMG91QVdFSkpaM0N3eGM5OVR1S1FJLVNEcjRPbVhveVEtbXZkOGVVNHNyYlRGaS1YME5YbXhFZ0V6aElwTEwwN2ZTQ3Q5Q1dlc1cxa2ZZNlM3M2ZjYktMOHZUSjJ3SGpvRFNhcXZqMlplUFBGdTAtQUdvRnA1aS1OSnFyLWFuMGtJRHVrbzNLTWVRYWpKMGNQNV85RzZrUkpscEZqcHJGam1lLTNpRXJ6Z2hsLUViWEhITEt3eTdZV0FoM1E3TzJR0gHbAUFVX3lxTFBKbmRWQWxXclREcGlPUDEwVFZLaVdmemFiVE1QRUVmTm1SNEtNY0N5TjdHLU9HdmZIdURoR2xBOHgzbEVwYi1ZTmt2TFBlRWVRLXE4RWNkRjl5cGdaVnRvUFRVdmJCR0hBVXpSUDhNUlNSNGgyeFJsUjk0YjRJRHg4MWh4X0VkUDBNTWYwWUQ2ZmlwcnQtOVJrNzliVjQ3LUNBeVlINmxzSTRkLWp1SGs4Y2xEWnd2cDRjY3liaTRweHpjLVBuNnJUT2kyWUZHeUczdUJHLWdKV2FIZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Crypto hack: Ethereum, Solana DeFi trading platform Thunder exploited for $239,000 - FXStreet",
        "content": "Thunder team confirmed the exploit on X, stating that 86 ETH and 439 SOL were lost in the attack.\n\nThe hacker stated that they held user data regarding private keys and that they intended to delete it.\n\nThe Thunder team stated no keys or wallets are stored by the protocol, hence making the threat irrelevant.\n\nThe team also assured affected users that their funds would be refunded and that they would be given 0% fees.\n\nThe crypto market witnessed another hack before the year ended as trading platform Thunder confirmed an exploit on December 27. The DeFi protocol running on Ethereum, Solana, and other chains has been threatened by the exploiter of potentially deleting users’ private keys’ data, although the team denied the possibility, reassuring the safety of assets.\n\nCrypto trading protocol Thunder hacked\n\nCrypto trading protocol Thunder took to X, formerly Twitter, to confirm a suspected exploit on December 27. The team addressed the suspicious withdrawals that began early in the morning and put a halt to the same in the next nine minutes.\n\nThe hacker still managed to steal 86.5 ETH and 439 SOL, collectively worth over $239,000. According to Thunder, the exploiter managed to gain access to a MongoDB connection URL, which they used to pull session tokens and execute withdrawals on behalf of users.\n\nWhile the team behind the protocol stated that 114 out of the 14,000 wallets on the platform were affected, the exploiter noted that they held the user data concerning private keys and intended to delete them.\n\nThunder exploiter’s threat\n\nThis threat was discredited by the Thunder team, which stated,\n\n“No private keys nor wallets were compromised…We do not store any private keys, so the attacker does not have access to any wallets. Desktop wallets were not affected. Less than 1% of wallets on our platform were affected as a result of this attack.\n\nFurthermore, the team stated that they are already communicating with the Federal Bureau of Investigation (FBI) and are willing to negotiate with the exploiter, failure of which would lead to them taking legal action.\n\nWe have taken the following actions:\n\n- Our legal team and the FBI have been contacted.\n\n- We are now undergoing a full, technical audit.\n\n- We are working on adding 2FA immediately for withdrawals.\n\n- We are adding additional security regarding session issuing.\n\n- We know which… — Thunder (@ThunderTerminal) December 27, 2023\n\nLastly, users were reassured of the safety of their assets, and the ones affected were notified with the team claiming that the lost funds would be refunded in full and the users would be given 0% fees and $100,000 in credits.\n\nThe Thunder exploit could be the last exploit of 2023, which has already seen the theft of more than $2 billion worth of assets, with the largest attack witnessed by blockchain security consultancy firm Mixin Network, resulting in the loss of over $200 million worth of digital assets."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE9VekpEQXM4LWJZaHRRRVZBWTVIWVZ5dkp4N0prUWZVR0czWHd4S1dSd0ZRZG1GQzFjNTFUWTJ2WW9pQTdHNXI1NHI0MVVGaE52MmtEdmNFVHJFQlBjcE9FekM2V1lzZnNrakZYYlJfOHlkVXQ0ZkHSAXtBVV95cUxPTEx5VV9Yc2NzR3c2R3NkNEJaUU01dEdJanZCNjlJanQ4eDdpNjE0aDNCSHFlVkk0ajFOdmx6RGdFZE5mWDJNTE5wOW94NGpudHFQMlBpX0hFczZJcEw1TXBUZFBGcnI3VkNXZnNVYU1QME1oQzhGeFdHR0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Justin Sun Withdraws $14 Million In Ethereum - Here's Why It Matters - Bitcoinist",
        "content": "This week, something interesting happened in the world of cryptocurrency. Justin Sun, the person who started Tron, took out a huge amount of Ethereum (ETH), about $13.8 million, from Binance, a major crypto exchange.\n\nA company that keeps tabs of blockchain transactions, PeckShieldAlert, said it looked suspicious and linked to Sun. This got a lot of people in the crypto community talking and wondering what was going on.\n\nJustin Sun Pullout Causes ETH To Drop\n\nWhat made it more puzzling was that right when Sun took out the money, the price of Ethereum went down a bit. But, surprisingly, more people started trading Ethereum, and the trading volume increased by over 15%.\n\nThis made everyone even more curious, especially because Sun is known for doing bold things in the crypto world.\n\nSo, basically, Sun did something unexpected by taking out a lot of Ethereum, and it got everyone talking and guessing about why he did it. The crypto world can be kind of unpredictable, and this was one of those moments that made people wonder what might happen next.\n\nNo stranger to headlines, Sun has previously withdrawn massive amounts of Shiba Inu (SHIB) tokens from Binance, raising eyebrows with a staggering 500 billion SHIB move followed by another 77 billion SHIB withdrawal."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPd01lMGl3YmRSX1lDWDZ0MFFuVFpORlVkU1drMno4cjdUMkZhbUdYcmxfUnNhOHVPVjJpbGFIWHpyVWZJR1NqVWZ5ejBvSE9nWVFMVEswWDctS1Q5b281MzBXaXVTWjJOMUJoVHc5Ymc2eDdIQU80N3M1dkhGcW5kb3ZoUl9KLThoRFRGaWItdkJONU5oemVTd0w2eGNUYlR6N0hOdDhJeVNQUzhZSm5lMy1CZ2JoVWlIY2RCcklKLTAtQ0ZiX1ZRU0dES3JjRXBORTJlMUxCTlBRazd10gHjAUFVX3lxTFB6c096VkFEaXE5UmdURlVDT2JLSXo3aHV4NmNPRncySjgwSTZ1RFlabTNLZm54c2JuaXRwcERBcm5ydzZncUp1cy1FUTYxc2EydXBWdFdFTlVHWHdTRGlqWUV1WG1zTWRNTEU4bnA1bjl5bEF0UnZzeWw2SlVJeWo3RlhKWml5czA4QlpPbHAzWFl6RV9LM21YT0FkWFhRSVVkTnYzQS1iM3puQmJKT2QySHktOVhBajl0RmdVUVBVajI1NzZ5eDNwODduWkcydjFoZ2FwNVpWcXZnVWpkd2VONzBR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "How to buy Retik Finance (RETIK)? Is it such a big project? Experts answer - The Financial Express",
        "content": "Within the world of cryptocurrency, a project’s presale phases frequently represent important turning points, exhibiting not only the project’s advancement but also providing hints about its possible size and market impact.Retik Finance (RETIK) has entered its third presale stage after the successful completion of stages 1 and 2. Many people are interested in learning more about Retik Finance because of its ambitious vision and recent fundraising success.\n\nComprehending the Development of the Retik Project Retik Finance’s presale journey represents a step-by-step development. Usually acting as the first phase of launch, stage 1 draws in early backers and enthusiasts. Stage 2 sees a rise in attention, which frequently signifies a project’s increasing confidence and interest. Retik Finance is entering a maturing phase as it moves into stage 3, which is characterized by increased reach and expectations.But does this mean that Retik Finance is a project of huge significance to the crypto world? Crypto veterans have a unanimous opinion on this.\n\nExpert Views on the Scope of Retik’s Project Experts in the field have been keeping a careful eye on Retik Finance’s progress, recognizing both its gradual advancement and the significance of reaching the third presale stage. Renowned cryptocurrency analysts claim that Retik’s credibility and investor faith in the project’s potential and vision are reinforced by the successful completion of prior stages.Insiders in the cryptocurrency space generally agree that Retik Finance is a project that has a lot of potential based on how far along it has come through the presale stages. The project’s roadmap, in addition to its investor appeal and ecosystem rich in utility, positions it as more than just another crypto buzz; rather, it represents a potentially significant player in the cryptocurrency space.\n\nAlso Read New GST return filing rules to help streamline process, increase transparency, better traceability by govt, say experts NPS Top Performing Fund Managers: Equity funds with up to 39% returns under Tier 1 scheme in one year Crowdstrike outage calls for deeper reflection on building business resilience Mutibagger PSUs REC, PFC rise 2% after UBS initiates coverage with ‘Buy’\n\nHow to Buy RETIK in the Presale\n\nAfter learning about the project, are you interested in acquiring RETIK tokens during the Retik Finance presale? This guide will walk you through the steps to purchase RETIK tokens based on your preference, whether it’s with Ethereum (ETH), USDT (ERC20), or through a Credit/Debit Card.\n\nBuying with Ethereum (ETH)\n\n1. Start by visiting the Retik Finance website: https://retik.com.\n\n2. Click on “Connect Wallet.”\n\n3. Connect your wallet to the Ethereum (ERC20) network.\n\n4. Select the ETH button.\n\n5. Enter the desired amount of ETH you wish to swap for RETIK Tokens. Make sure to leave sufficient ETH in your wallet to cover gas fees. It’s advisable not to purchase more than 0.98 ETH if you have 1 ETH in your wallet, leaving 0.02 ETH for gas.\n\n6. Click “Buy Now.”\n\n7. Confirm the transaction within your connected wallet.\n\n8. Your RETIK tokens will appear in “Your Holdings.” Important Note: Gas fees on the Ethereum network can vary between $10 to $25 worth of ETH. Ensure you have enough ETH in your wallet to cover these fees, with a buffer to complete transactions smoothly.\n\nBuying with USDT (ERC20)\n\n1. Make sure you have ETH (for gas) and USDT on the Ethereum network (ERC20).\n\n2. Go to the Retik Finance website: https://retik.com.\n\n3. Click on “Connect Wallet.”\n\n4. Connect your wallet on the Ethereum (ERC20) network.\n\n5. Select the USDT (ERC20) button.\n\n6. Enter the desired amount of USDT you wish to swap for RETIK Tokens. Remember that ETH is required for gas fees.\n\n7. Click “Buy Now.”\n\n8. A prompt screen will ask you to approve the use of USDT on Retik’s website. Approve the maximum amount or the specific amount of USDT you intend to use.\n\n9. Click “Approve.”\n\n10. After a successful approval transaction, you’ll receive a prompt to confirm the transaction within your connected wallet.\n\n11. Confirm the transaction in your wallet.\n\n12. Your RETIK tokens will be visible in “Your Holdings.” Important Note: When purchasing with USDT, you’ll need to complete two transactions: one to approve the use of USDT and another to complete the purchase. Make sure to complete both transactions. Gas fees on the Ethereum network can fluctuate between $10 to $25 worth of ETH, so ensure you have enough to cover fees comfortably.\n\nBuying with Credit/Debit Card\n\nIf you prefer to use a Credit/Debit Card to buy RETIK tokens, you can do so by first purchasing Ethereum (ETH) through popular crypto exchanges like Binance, Kucoin, Gemini, OKX, or websites like Moonpay.\n\nMoonpay Guide:\n\n1. Visit [MoonPay](https://moonpay.io/).\n\n2. This platform allows you to purchase ETH that will be sent to your wallet. You can use this ETH to buy RETIK.\n\n3. Follow the on-screen steps provided by MoonPay.\n\n4. It’s recommended to purchase a minimum of $50 worth of ETH to cover all expenses, including gas fees when buying RETIK.\n\n5. Once you have acquired ETH, you can proceed to purchase RETIK using the same wallet.\n\nAlso Read Yellow Card seeks exchange license after Nigeria lifts crypto ban\n\nConclusion\n\nThe third presale stage for Retik Finance signifies a significant turning point marked by a surge in investor participation and a substantial influx of capital. The project’s impressive journey saw it swiftly complete the initial two phases, generating $1.7 million in token sales.Reaching this juncture serves as a clear indicator to experts that Retik Finance has resonated with investors due to its innovative attributes, promising utilities, and forward-looking vision for the future of decentralized finance (DeFi).In unanimous agreement, experts are advising, “Don’t miss the opportunity to buy $RETIK tokens during presale stage 3. It’s not just a substantial project; it stands as the most prominent project in the current crypto landscape.”\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOSG5IWVo0WjhtUEkwNEs0ZzI3WGc3aGJwRGlROVFwV2ZWOUItbEtqcDMxdGd0VW1pb195VjZ5cEJNNHR1dGVITGZIU3Zva3hUWTRwSExVUTAyNi13SUdWVWgtZGdGMnhxWWZkcnV6RmFxc1d0RDdoNmtSWWZPcGsyRzJIQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Rainbow chart predicts ETH price for Jan 1, 2024 - Finbold - Finance in Bold",
        "content": "Despite facing challenges in surpassing the psychological barrier of $2,500, Ethereum (ETH) might witness a similar outlook by the end of the year. This is suggested by BlockchainCenter’s Ethereum rainbow price chart, reflecting momentum in the broader cryptocurrency market.\n\nIn particular, specific cryptocurrency traders and investors leverage Ethereum’s rainbow chart to analyze the historical trends of the second-largest cryptocurrency by market capitalization. They examine its relationship with various moving averages (MAs) and identify patterns that can inform more informed investment decisions.\n\nThe chart indicates that Ethereum is presently situated in the ‘Still Cheap’ phase, represented by the light green color. It fluctuates within the range of $1,597 to $2,306, residing below the ‘Hold’ yellow zone spanning $2,302 to $3,342, based on information observed by Finbold on December 27.\n\nEthereum rainbow price chart. Source: BlockchainCenter\n\nProjection for January 1, 2024\n\nAs for the start of the following year, no significant fluctuations in price are expected, as Ethereum is treading the fine line between the ‘Still Cheap’ and ‘Hold’ territories, which both present a buying opportunity for investors.\n\nHowever, an alternative Ethereum Rainbow Chart tool created by CoinCodex projects that, under identical circumstances, the asset price could linger at approximately $3,033 per token should ETH stay within the ‘HODL’ zone in January 2024.\n\nEthereum rainbow price chart. Source: CoinCodex.com\n\nEthereum price analysis\n\nAt the time of press, Ethereum is being traded at $2,247.29; this reflects a 0.40% increase for the day, coupled with an upside of 1.75% over the past week and a 9.83% gain on its monthly chart.\n\nETH 30-day price chart. Source: Finbold\n\nConcurrently, technical indicators for Ethereum, sourced from TradingView, reflect bullish sentiments. A summary of the indicators indicates a ‘buy’ rating at 11, with moving averages signaling a ‘buy’ at 9. Oscillators tend toward a ‘neutral’ rating of 8.\n\nEthereum technical analysis. Source: TradingView\n\nThe trajectory of ETH within either of the two rainbow chart patterns will hinge on ongoing developments within the Ethereum network, coupled with the overall sentiment in the broader cryptocurrency and macroeconomic context.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPd2xLYnJlMy1xWGFoS2tCS0lZWGtSSXFBUEtMRlRDaGVrUThZeXhwTDcyendTa3FBT2xPeFF3TkFJUWxLQmNjbm16N2FUc1VIUDdXZHhyY0hGdGtNY1AtM1hoendtZWRkNHN1WmozcFc1NG1yZnhoUElLUWh6VGF2VmgxcDJMMWRqRFlxQzJMejBaVGVyd3RlUVlWZ1dkRE16ZkJUZFdtVWI1bW44WHNRQlVQb2VUNW93OHhv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Anatoly Yakovenko Says 'Solana Is Ethereum' In Layer-2 Scalability Debate - News 4 Social English",
        "content": "Anatoly Yakovenko says 'Solana is Ethereum' in layer-2 scalability debate h3>\n\nSolana creator Anatoly Yakovenko recently referred to Solana as an Ethereum layer-2 solution through its Wormhole eigenlayer in a post on X.\n\nIn the exchange, Yakovenko positioned the blockchain as an Ethereum layer-2 while responding to a tweet listing various other L2 solutions, including Arbitrum, Aztec, and Polygon, among others. He wrote:\n\n“Solana is ethereum! Solana is an ethereum L2 through the wormhole eigenlayer. Once danksharding is scaled up no one is going to stop you from submitting all the solana blocks into some data validating bridge contract on ethereum.”\n\nAccording to Yakovenko, the integration of Solana with Ethereum is facilitated by the Wormhole eigenlayer, which would eventually allow the potential for Solana blocks to be submitted into a data-validating bridge contract on Ethereum after key scalability upgrades.\n\nOn the rise\n\nFollowing a challenging start to 2023, Solana ended the year with a significant upturn. December was a particularly active month for the blockchain, showcasing one of the quickest price recoveries in the final quarter. The total value locked (TVL) on Solana impressively more than doubled, escalating from $671.62 million at the beginning of the month to $1.529 billion by December 26th.\n\nHowever, when denominated in SOL, the increase was more modest, from 11.35 million SOL to 12.56 million SOL in the same period. This discrepancy reflects the significant rise in SOL price, which climbed from $59.2 to $121.4, affecting the USD valuation of the TVL.\n\nNotably, Solana overtook XRP in market cap, becoming the fifth-largest cryptocurrency with a market cap of $34.8 billion as of December 20, 2023, following an 11% increase in Solana’s value, which outpaced the broader market’s 3% gain. The SOL/ETH ratio, comparing Solana’s value to Ethereum’s, also shows recovery, highlighting Solana’s competitive stance.\n\nThe SOL/ETH ratio, a metric comparing the value of Solana (SOL) to Ethereum (ETH), is a critical measure of Solana’s competitive position. This ratio has experienced significant fluctuations, with the most recent data showing a recovery in Solana’s standing against Ethereum.\n\nSolana’s blockchain technology, known for its high performance and scalability, is designed to support decentralized applications (dApps) and decentralized finance (DeFi) use cases. The platform’s success is attributed to its unique consensus algorithm, “Proof of History,” which enables high transaction speeds and low fees, making it a popular choice among developers for dApps and DeFi projects.\n\nThe post Anatoly Yakovenko says ‘Solana is Ethereum’ in layer-2 scalability debate appeared first on CryptoSlate.\n\nCheck More Latest Cryptocurrency News Click Here– Latest Cryptocurrency News\n\nCheck More Business News Click Here– Latest Business News"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE9GVm1MRzZJXzRLNU9FdERZZUpPOUIwTnBkN25jVWFnZnhkUllRYkFKR0M3ME9WZHdUUDVUWDN0ZC04dUdFM3ZyOWRsbVBsTU9DMzlYRjh1djZrQkh6UllNYVN2VWZ5ZzA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Bake DeFiChain Quiz Answers - Followchain",
        "content": "Bake (formerly CakeDefi) is a safe, transparent, and easy way to get returns on your crypto investments.\n\nYou can also buy Bitcoin and Ethereum or swap them for other popular coins.\n\nUse Decentralized Finance services like staking or liquidity mining and earn high yields.\n\nTake Bake’s Learn & Earn crypto quizzes and earn crypto for free.\n\nSign up now to start earning rewards: bake.io/?ref=5043333 or use “5043333” as the referral code.\n\nIn this guide, you’ll learn the Bake (CakeDefi) DeFiChain quiz answers for the “Learn & Earn” rewards feature to earn $1 DFI.\n\nBake DeFiChain Quiz Answers\n\nQuestion: How can DeFiChain be described in one sentence?\n\nAnswer: (A) DeFiChain is a blockchain dedicated to Native Decentralized Finance for Bitcoin.\n\nQuestion: What is Decentralized Finance?\n\nAnswer: (B) Decentralized Finance are all types of financial applications without the need of a third party intermediary like a bank.\n\nQuestion: What are the benefits of #NativeDeFi?\n\nAnswer: (C) Native DeFi is more secure than non-Native DeFi because the consensus happens directly on the native blockchain layer, instead of getting compiled and running through a virtual machine like on Ethereum.\n\nQuestion: What are the main ways to earn incredibly high yields with DeFiChain?\n\nAnswer: (B) Staking and Liquidity Mining offer great and easy ways for anyone to earn block rewards up to 26.44% yearly returns.\n\nQuestion: What is DeFiChain’s Decentralized Exchange?\n\nAnswer: (D) DeFiChain’s decentralized exchange is the cornerstone of most decentralized financial applications in the DeFiChain ecosystem, enabling trading, liquidity mining, and more.\n\nFurther reading\n\nBake Bitcoin Quiz Answers\n\nCoinbase The Graph Quiz Answers\n\nCoinbase Mina Quiz Answers"
    }
]