[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQMC1VMzBWLXkxRjJIVnFBVlF5emdMMGNIYXVHcUtpLWRJWlpTVFN0UXp2U054SktBVWgzZlY1LTFldjYybllDMVlSSlNPNE5FZzdXZ0NEMUF1bnpkQlJHWHM5VmNtNld3NGZuMU9jQnV6NVJEdGJtN1RtQ1k4elFQdjJNSEHSAYwBQVVfeXFMUEZ4Q3FJQzVIQjlqSTVKR09ZZ0lwYV84TDUxQjNSWW8zaWlVa2lKMkhoSGVWODFyb2xNcVNkV2dud2ZzeWJqZXNpdHkyLUxCRFZkSFNSb1VjanowN0xDeEJrY0x0Q0UwczJTa3FjUjRkRUZXQzBKR25NbjJKRHpYbEpyS18zM0xNMFBjQTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "SEC Delays Grayscale Ethereum ETF, Confirms Receipt of BlackRock ETH Fund - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Security and Exchange Commission today said that it will need more than 45 days to evaluate a rule change that would allow Grayscale to convert its Ethereum trust into an Ethereum spot ETF. The new deadline is January 25, 2024.\n\nThe news comes as the regulatory body received notice from investing giant BlackRock that its pending Bitcoin spot ETF has already drawn $100,000 in seed funding from an undisclosed investor.\n\nFor Grayscale, the decision comes two weeks after the SEC delayed a separate request from the crypto asset manager to evaluate its proposal for an Ethereum futures ETF. That application was submitted in September.\n\nThe reason given in both cases was the same.\n\nAD\n\nAD\n\n\"The commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein,\" reads the SEC's official notice today.\n\nThat is, word for word, the same explanation the SEC provided last month.\n\nAs for BlackRock, its amended Form S-1 registration for its iShares Bitcoin Trust includes disclosure of a \"seed capital investor\" that's affiliated with BlackRock. The unnamed investor purchased 4,000 shares at a per-share price of $25 on October 27, for total proceeds of $100,000."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNc0YyZWtjLXNSWC02Uk1KM1BobEdWSGV3VDJQdGlzNEZNdWJuUHRJaWRvS1dGNnUxWDZhcm9GQjlWRE9fcjFLbUR0OGVPdVllY2VTYUo5VEVZQXdGWlY1UUxlQmhDR1NFeEdfZ1FxVzhyQXZpRUNVVlVxOURZZUlrZ1lqN29uQdIBiwFBVV95cUxPaU4zQUx1bC1NNXc2aEVERkx0UlZDbkhCXzM3dzY4XzRPTldDb3BZMWd1akNFWExTWnc3UWpJMDBUXzB3a1hyb1NhTjZmdTdibDQwYS1aQnpOS0NFT3JydXVxdFZFdl9mZHMyTmVxRHl2VnNpYWU2TFFhZHd5cjMtMnJ0WUhiUkI3a2xF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum decouples from Bitcoin: Examining the causes - AMBCrypto English",
        "content": "The decoupling was most likely due to an increase in spot ETH ETF launches.\n\nA lower BTC-ETH correlation made a case for portfolio diversification.\n\nBitcoin’s [BTC] correlation with Ethereum [ETH] dropped to multi-year lows, signaling a major divergence in the growth trajectories of the two blue-chip cryptocurrencies.\n\nBased on a 60-day rolling window, the correlation dipped to 75% in November, according to crypto market data provider Kaiko. This was a marked departure from the all-time highs (ATH) of 97% seen during the end of 2022.\n\nEthereum weakens its relationship with Bitcoin\n\nAMBCrypto spotted a vertical drop in the relationship since November. While there was no telling evidence, the decoupling seemed to be caused by an increase in spot ETH exchange-traded fund (ETF) launches.\n\nThe broader market bullishness was led by excitement over likely approvals of a dozen-odd spot Bitcoin ETF applications. This led to the start of the mid-October rally and by the time the month ended, BTC had accumulated gains of 26%.\n\nHowever, ETH was slow to match this pace, finishing October with 17% gains.\n\nHowever, the announcement of spot ETH ETFs by TradFi giants such as BlackRock and Fidelity turned it around for ETH in November. The second-largest crypto bounced above the crucial barrier of $2,000 for the first time since May 2022.\n\nTo put it simply, ETH reacted more to developments in its own ecosystem rather than a trickle-down effect.\n\nIt is important to understand that both assets function very differently from each other.\n\nNotably, Ethereum is used as a platform for the development of decentralized applications (dApps) and smart contracts. Meanwhile, Bitcoin is primarily used as a store of value and a means of payment.\n\nWhat is the takeaway for investors?\n\nAs per a 21 April report by Coinbase, the lower BTC-ETH correlation makes a case for portfolio diversification, as holding both assets can result in higher returns.\n\nSmart investors spread their investments across different cryptos, reducing their exposure to any one category.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nAs for institutional investors, the trend could impact their trading strategies like cross-hedging. For the curious, cross-hedging is a practice of managing risk by investing in two assets that have similar price movements but are not perfectly correlated.\n\nHaving said that, traders and investors should not take these as investment advice, and instead perform their due diligence."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQQ2daZnFFcE51dTh1VlRZWDJSdHVQZ0kwQmRPWDY0SG5TMmpwdkVuTHpnSU5heENVUFAzb2R4MTZrOEl4OW9TVExLZ3pBVlNjNmZ0SUNBOWJ0TkJXcDZFU3hodUdFZW0yT0dEemVCWHg5cUhxaFFtNGNJWjlhN0poUHFLcGRSUG1TQWp0Ti1SM2PSAZYBQVVfeXFMT3FUUElNNG1CbGdpbGZEcUF5cnlaUHpnbmM1M1hDbkpGb0dHZFQwY2FxaGl1VmdSN21xdGc4bW5Da1hXLVNyNUNaYzBqcm56dVNlc01qSDlaM1BEV1dsZ3oxbk5TVzMxTlhhS0otMXZES1BXWUs0Z3ZDZXhrcndrQWZWZ1RxTWVrZmRVclp4RWx3cmN6Q2hB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum's 'Censorship' Problem Is Getting Worse - CoinDesk",
        "content": "A turning point came last year when the U.S. government sanctioned Tornado Cash – a \"privacy mixing\" program on Ethereum that helped people transact without leaving a trace. The Treasury Department's Office of Foreign Assets Control (OFAC) said the program was used by terrorists and other U.S.-sanctioned entities, so it added Tornado's Ethereum-based computer code to the same blacklist as Iran, North Korea and Hamas. In response, some blockchain advocates were defiant; they balked at OFAC's attempt at \"censorship\" and gloated that Ethereum would be immune to it as a result of its decentralized construction."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOYnQwVHpoYnB3M0NORzliUDhiVE44OW1lQjdsc3VwVFRUUWxXQ2JweGVoZno2dDVuck9sMXJtWTRmaGtaY1NyaXJCZExVWjNRWVF5cW5xYzBsZVFrOFNVam1oQmJRSF91b3k3VUFVeGc0NzJqUlhrUFBBS1lhd25MSDd2TTJJTGcwWjFENEZSQmY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Societe Generale becomes first bank giant to issue a stablecoin on Ethereum - Crypto Briefing",
        "content": "EURCV is an ERC20 token backed by and redeemable for fiat currency.\n\nShare this article\n\nSociete Generale FORGE, a subsidiary of the 159-year-old French banking group Societe Generale, is launching EUR CoinVertible (EURCV) a stablecoin tied to the Euro issued on the Ethereum blockchain, according to a new post by crypto exchange Bitstamp.\n\n📢 NEW! We're the first exchange to list $EURCV! EUR CoinVertible is Societe Generale-FORGE's innovative stablecoin, aiming for stability and safety in the volatile world of digital assets. 🌐 You can start trading it on Bitstamp today. Dive in for more details:… pic.twitter.com/Lt98ysjfeo — Bitstamp (@Bitstamp) December 6, 2023\n\nEURCV is an ERC20 token, designed to provide a low volatility cryptocurrency that maintains a stable value equivalent to the Euro. The stablecoin is backed by cash deposits and cash equivalents denominated in EUR.\n\nSociete Generale states that robust legal structures are in place to ensure the segregation and availability of reserve assets to token holders.\n\nCrypto exchange Bitstamp is opening order books for the EURCV/USDT and EURCV/EUR trading pairs. Flowdesk, a crypto market maker, has been selected to provide liquidity and active market-making for EURCV on Bitstamp and other exchanges.\n\n“We are thrilled to partner with SG-FORGE as a designated market maker, a pivotal role in realizing our shared vision of a tokenized financial future. Looking ahead as we approach 2024, we envision a transformative impact where compliant blockchain-based operations by institutions will drastically increase in volume,” said Guilhem Chaumont, CEO of Flowdesk.\n\nInitially, EURCV deposits and withdrawals will only be enabled for investors whitelisted by Societe Generale. The bank states that its existing KYC and AML compliance procedures will apply to onboarding digital token holders.\n\nWhile not the first Euro stablecoin, EURCV is the first to have the backing of a major regulated European bank. A state-owned bank in Brazil called the Brazilian National Social Development Bank issued a stablecoin backed 1-for-1 by the Brazilian real in 2018. Circle and Tether have also launched similar euro-pegged tokens aimed at retail investors.\n\nThe EURCV launch comes soon after Societe Generale’s first bond issuance on the public blockchain Ethereum. The €100 million digital green bond was fully subscribed to by institutional asset managers AXA and Generali."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQTTFaQ09KNHN3RGNRYld4VkRKZHYzemszUWt6dHZWQmM3SjFidlpMWlFldlhrakgtMURSVndzQmNhRl9YNXNGZVR2ZFctbVlyX00yeTA1ZGFFNjRlSGVMMmRIRlFHREV6VFRxVFRpMHVlZmtWMjZKQjQwQ09yNTAtZm8zZGdfcXY0dlBCNVBlZmpSbXhpS1VJ0gGcAUFVX3lxTFBKTDBUd1B1Y25jbkpXS0w1c1NFelJxTGN6U3pTdm5CejdxNTM1NDBmN0hzT2JHcTRQRnB0UDA3WlR5S1p3Vk00ZWxrT3AxY2xMMFNxOEFrZVJTOU5CN0ItT0ZESUNiQ01KdHBJal9SeHVBT2FGZnhTSHZuNFMyZ1Z1YmFGYjB2SEJzYkVHclZaTmdZcTRTOVZDc00xVw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum: Veteran Trader Peter Brandt Presents Three Narratives for ETH Price - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nVeteran trader Peter Brandt comments on Ethereum price action as the market embarks on a fresh crypto rally.\n\nAdvertisement\n\nBitcoin, the largest cryptocurrency by market capitalization, surged to $44,000 for the first time since April 2022. Ethereum, the coin linked to the Ethereum blockchain network, also soared in response to the bullish impulse, touching highs of $2,312 in today's trading session.\n\nIn a new tweet, Brandt asks his 705,100 followers if Ethereum will emerge from the shadows anytime soon. He says that at least three narratives are possible, about which he launched a poll for his followers to participate in.\n\nVisual for reference pic.twitter.com/16YP1sZMQL — Peter Brandt (@PeterLBrandt) December 6, 2023\n\nBrandt's three narratives include a classic wedge that targets the $900 price for ETH. The second narrative is a running wedge pattern, which, if verified, has a price target of $3,300.\n\nAdvertisement\n\nThe famed trader's third narrative is \"Morphology ahead,\" which could imply that the Ethereum price action is still brewing and in the process of taking a particular form or structure. Brandt provides a visual representation of these price patterns.\n\nThe first option, the classic wedge, received 24% of votes in favor. The amount of 60.7% of respondents voted for the more likely option of a running wedge with a target of $3,300 given the current market standing. A total of 15.3% of the respondents voted for the 'Morphology ahead' option.\n\nTypically, a wedge pattern can indicate either bullish or bearish price reversals. A rising wedge (which indicates a bearish reversal) or a descending wedge (which indicates a bullish reversal) are the two types of wedge patterns.\n\nAt the time of writing, ETH had gained 2.16% in the previous 24 hours and was trading at $2,264.\n\nIn ETF-related news, the Securities and Exchange Commission (SEC) has announced that it will take more than 45 days to review a rule change that would allow Grayscale to transform its Ethereum trust into an Ethereum spot ETF. The new deadline has been set for Jan. 25, 2024."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOSDB6TkFrbjBoX1ptbHRqU20xSjhnWHg1U1RJc29qNWNxSU1GZ3lrYjdFNkFnU01TMFZLWWZmeGFzaEU5ck9rTy1PUlQ3S0wxNzE3WXpTamZObkhnQVA3OU5vY01KSXlTOU5vaEZjam5tMHlTZHBPVkVRWlZfNjFJSTRiWUVWc3Z0b1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Spike Amid 'Panic Buying', ChatGPT-Drafted Legislation Unanimously Passed In Brazil - Top Headlines Today While US Was Sleeping - Yahoo Finance",
        "content": "US Markets\n\nCrypto\n\nUS Politics\n\nWorld Economy\n\nTech\n\nElectric Vehicle\n\nStory continues\n\nConsumer\n\nCommunication\n\nIndustrial\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nThis article Bitcoin, Ethereum, Dogecoin Spike Amid 'Panic Buying', ChatGPT-Drafted Legislation Unanimously Passed In Brazil - Top Headlines Today While US Was Sleeping originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPT25JMTRxLS0tV1FoSnR6SHFMZU9zTmhXSlRIaXN6cTNIUmVFb2xrd2hYMmhXekFjWXFKODREWHdKNnZiaW05ZC05XzNKSnRkSW9GUmIyOUpwWVF3Sklrb3ZfdUJpcnU2RXpvNWY3NGQ4Vy15LUtVZVl5RENhbkE3OEFxRHpWTnJ0cTA2dFpLZVpTYmNqc25SRzYzOVMzcXdaaHFBN1RwYjRPT25WcmdMaXZmaEFmc0hIcUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Virtual Machine Chain Inscriptions Gain Traction, Dominating Polygon Transactions - Unchained",
        "content": "While Bitcoin Ordinals are making headlines, inscriptions on Ethereum Virtual Machine blockchains have gained traction in recent weeks, according to a Dragonfly data analyst.\n\nWhile Bitcoin inscriptions continue to gain headlines and spur debates, inscriptions on Ethereum Virtual Machine (EVM) chains have gained traction in the past month, particularly on the Polygon network, according to an X thread from Hildobby, a data analyst at crypto-native venture capital firm Dragonfly.\n\nGas fees spent on inscriptions peaked at about $800,000 two weeks ago before retreating, but inscriptions have remained stronger on Polygon, representing 72% of overall transactions on the chain in the past week. Hildobby attributes much of this activity to the Polygon-focused inscription marketplace POLS Market.\n\n“Polygon seems to be where most inscriptions are thanks to @PolsMarket whose inscription “pols” has seen the most minters with ~100k addresses,” Hildobby wrote.\n\n1/ Inscriptions have gained traction on EVM chains over the past month, most notably on Polygon where they account for 20% of gas spent & 72% of transactions 📝 more below pic.twitter.com/1s78sUqyik — hildobby (@hildobby_) December 6, 2023\n\nInscriptions on EVM chains work by storing small amounts of metadata in the call data for a blockchain transaction. Similarly to Bitcoin Ordinals, EVM inscriptions essentially form smart contract-based non-fungible tokens (NFTs). And, like Ordinals, EVM inscriptions have raised concerns, including about whether the technology is scalable.\n\nBut Hildobby noted that he isn’t advocating for EVM chain inscriptions, tweeting, “FYI: Inscriptions go against every EVM design decisions, with gas costs being the only benefit, at the expense of indexing, non-compatibility, integration challenges.”"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxNM3c1RktxSVRpcjhMajNCS0kzNUNNOS1KdWdhNW93b1did2RmVmo5U1ZQTEhxSmwwemxjTlgxVThxS1djMmVnaEt4OHdGbm9GRVhMS1hINVd6eThlRG1tQ2UtMnBzVlR2NnV5cU1hY0hnbmlneXNZOHFUdVJOMl9iMTBld2x6N1dLTmphNjJ1VWdzeUNGOG16Vjl0Q3lQbml6NURmVW5HWVVtVkdoQVhabE9KbnZoVE9CMmZPUDF2UkJleld1V3V5QlBWM191MGU4eWdsWTJRMlJTOUZ5UGpTMHZXRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "'Family Guy's Latest Episode Shows Meg's Therapist Only Accepts Bitcoin, Ethereum, Dogecoin - Benzinga",
        "content": "The latest episode of ‘Family Guy', the animated sitcom, features a mention of Bitcoin BTC/USD, Ethereum ETH/USD, and Dogecoin DOGE/USD.\n\nWhat Happened: Season 22, episode 8 shows Meg Griffin receiving therapy, only to be told by her therapist that payment must be in either Bitcoin, Dogecoin, or Ethereum.\n\nThe episode portrays the therapist in a state of panic, both accepting and refusing Ethereum and urging immediate payment due to the volatile market with the line. “Not Ethereum—Wait, wait, no, I don’t… I don’t anymore. Wait… yes I do. But you have to send it right now. No, send it again. No. Why did you do that?”\n\nThe therapist also mocks cryptocurrency investing by saying, “Forget real estate. Invest in money you can’t even see.”\n\nWatch the full video here.\n\nSee More: Dogecoin HODLERs Are Beating Shiba Inu With 57% Landing In Profits, IntoTheBlock Data Reveals\n\nWhy It Matters: This isn’t the first time ‘Family Guy’ has brought up Bitcoin. A past episode showed Peter Griffin suggesting Bitcoin as a solution to their financial problems. Lois says, “Peter, every day our savings get smaller and smaller. We’ve really got to figure out a better way to budget for this family,” to which Peter responds with the word \"Bitcoins.\"\n\nThis comes as BTC, ETH, and DOGE surged on Tuesday evening, marking the first significant rally since early April 2022. This surge comes as falling interest rates and increasing expectations for introducing a spot Bitcoin ETF in the U.S. market.\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOUG5XZnVWalcxVGlhNjdXZ0RLc3RUTVp0eHlJRUU2Q2RVUHVVSV9RLUpqdU1GNmpjNUpSS3l1Y1NtR3ZCWnh4R0dRYmtiR24zOGl0T1dWYkEwcDN6Q3ludVJZb0pHd1FRaVdQNUdzaWJCdmd3enAxb2VieUhtc25MVmtLanRCd3dCbXRvT1N3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "SEC Postpones Ruling on Grayscale Ethereum ETF - Crypto Times",
        "content": "The U.S. Securities and Exchange Commission (SEC) has delayed its verdict on Grayscale’s proposal for a spot in the Ethereum exchange-traded fund (ETF). The SEC now targets January 25, 2024, to finalize its decision. This development comes after an appellate court directed the SEC to reevaluate Grayscale’s Bitcoin ETF proposal earlier in October.\n\nsec delays grayscale etf\n\nThis postponement by the SEC indicates a comprehensive and cautious approach in assessing the proposal, which could allow the listing and trading of Grayscale Ethereum Trust shares on the NYSE Arca.This extended timeframe underscores the complexities and potential repercussions of the decision on the burgeoning cryptocurrency market.\n\nGrayscale’s approval of this Ethereum ETF is poised to be a watershed moment for the cryptocurrency industry. An affirmative decision would pave the way for broader institutional participation and mainstream acceptance of Ethereum.\n\nConversely, a negative outcome could significantly affect market confidence and investor sentiment. As the new deadline approaches, the anticipation within the crypto community and among investors is palpable, with all eyes on the SEC’s eventual decision and its implications for the future of digital assets."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1iQmtQalotc2g0SGlua0s5TE1LSUFxSmlWSWpoSmN5QXNTZ3VoeXU2LUlBMGdFNWJGa2R3eHh5VDBYLXhGdm5sN2lhVHB2R1dLc1dZVHNhYmhOQzVSQkVJLVA2dDYtRkE0VUVUSmVhdmRjLXA3WDZKaXJXVG4wOTTSAYQBQVVfeXFMUEFkMXVva19sdndqb3IxN2JLUlZrcVVKMUNUSHpnbkZyZElWODBqSWRKUC1VY09DdUJCZkJacXVvTUwzdGlhbGlXeTNxR01sR0I3S0RWbFNhWjB4OHIyN1hyUWpzUmpJN0hYejUtSUNDaVJLTjh3Q1p2V052ZHBjQmFySHlh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Will Ethereum’s price prediction piggyback on Bitcoin’s rise? - AMBCrypto English",
        "content": "Ethereum’s price saw an 18-month high at press time.\n\nWith the recent price uptick, ETH’s price has become more prone to fluctuations.\n\nSharing a statistically significant correlation with the leading coin Bitcoin [BTC], whose price has rallied above $40,000, Ethereum’s [ETH] price has climbed to an 18-month high.\n\nOn the 4th of December, BTC briefly traded above the $42,000 price mark for the first time since April 2022.\n\nThis positive sentiment undoubtedly spilled over into the ETH market, as the altcoin exchanged hands at a high of $2,250 on the same day, a price level it last recorded in May 2022.\n\nNew highs, new troubles\n\nApart from its price rally, ETH’s Open Interest has also risen significantly in the past few days. By the 4th of December, this had grown to over $4.5 billion, representing its highest level since February 2023.\n\nRising Open Interest alongside rising prices suggested that new money was coming into the market, fueling the bullish momentum. This signaled that the upward trend was likely to continue.\n\nHowever, with price volatility making a gradual comeback, the rally might be short-lived, as traders increasingly occupied leveraged positions.\n\nETH’s Bollinger Bands indicator (BB), assessed on a daily chart, confirmed the possibility of significant price swings soon. At press time, the altcoin’s price traded above the upper band of this indicator.\n\nLikewise, the gap between the upper and lower bands of the BB indicator has widened consistently since the 30th of November.\n\nA gradual widening of these bands typically indicated an increase in market volatility. The coin’s Bollinger Bandwidth, which has grown since then, confirmed the rising volatility.\n\nDue to the recent price surge, ETH’s estimated leverage ratio has risen. This indicated that, at press time, traders were borrowing more money to trade the leading crypto asset.\n\nETH’s climbing leverage ratio is often seen as a bullish signal. Notably, it suggests that traders are confident that the coin’s price will continue to rise.\n\nHowever, it is also risky, as traders with high leverage are more vulnerable to liquidations if the market moves against them.\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nAMBCrypto found that ETH’s funding rates have been only positive since the October rally, meaning that traders have continuously opened trade positions in expectation of a price rally.\n\nHowever, with the market approaching an overheated region, a drawback might result in the liquidation of some of these positions."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOWEVMQWd1NnR1OVhOQU41U2d4Z2xpampTSG1ucWN0ZTdnQXZyVG1rQVllSjJkLUpTZGlLVExwN1BxQUNoTmRTTFppcE5vVEg2cFpPTlRrZkFtYU0wV3FYZkhjXzlYdFFDdWpNMWJvN3IwQnBIeEpmejV4UGNGYlJGVW1LTkliZlHSAYwBQVVfeXFMTURsQV9UUzUzRnNadkR2WmJoZGNIcVBmbHBGOGtTVUlsa2JENzlPWjNTV3FQYmUyaENldHFabUJtREIzZWw1SWhFWUZDWHZXNFhuNThsSVo1NXRXVEVBNmFrTkZhMk9VeEpIUG9IQkd4WUdZMDRWTVFKY0EteU1XekN4TjY0Q1cwVWg5cXk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) on Verge of Massive Surge, Unusual Market Data Shows - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum's (ETH) market indicators are presenting a rare confluence of bullish signals, suggesting the second-largest cryptocurrency by market capitalization may be poised for a significant price surge. There are three key data points that might become a foundation for a new rally.\n\nInstitutional pivot: ETH Futures gain traction\n\nThe first sign comes from the futures market, where ETH's performance on the Chicago Mercantile Exchange (CME) is turning heads. Ethereum futures are now trading at a 5% premium compared to Bitcoin's basis, a notable shift in institutional focus.\n\nInteresting to see the futures basis for ETH on CME is now trading at a 5% premium to the basis for BTC and open interest for ETH on CME is now starting to pick up after lagging BTC.\n\n\n\nEarly signs of tradfi starting to rotate into the ETH ETF trade? pic.twitter.com/o12EXjWsmZ — Will (@WClementeIII) December 4, 2023\n\nMoreover, open interest in ETH on the CME has seen an uptick, starting to outpace BTC after a period of lagging. This shift could indicate growing interest from traditional finance (TradFi) investors in Ethereum, potentially as a reaction to the burgeoning ETF market for ETH.\n\nAdvertisement\n\nBullish technical outlook on ETH charts\n\nThe provided price chart offers a bullish technical outlook for Ethereum. A closer analysis reveals a strong uptrend, with ETH's price action forming higher highs and higher lows – a classic indicator of bullish momentum. The moving averages have aligned in a way that typically precedes bullish conditions: the 50-day moving average is well above the 200-day moving average, and the price is currently trading above both, confirming a \"golden cross\" formation. This technical pattern often attracts further buying from momentum traders, reinforcing the positive trend.\n\nDeFi as catalyst amid BTC's potential correction\n\nLastly, the potential for a correction in Bitcoin's (BTC) price may drive investors toward Ethereum, particularly as the decentralized finance (DeFi) sector gains more traction. Ethereum is the foundational platform for DeFi applications, and as this industry grows, ETH is likely to benefit from increased utility and demand. This, combined with a possible redistribution of capital from Bitcoin to Ethereum, could provide the necessary fuel for Ethereum's price growth."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNSU1YTHBBSEpQbGppWnhobUlCeWdmbFl1ZjhKby1uYlpneDZ0S0ZVODg2eGlnX2RzN083d002ejZ3WkhZMk1pMzBMaDAwMjc4Y0tqc3FJYVpyVzlMSk1yanhrMWlSaFRHdGdLQTJKUEdfVWpsbW53S0ZFOGhETkRGenQxcHRqY1FXanNqMlZyY21ia0NFeFpjQVV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "NFT Trading Activity on Ethereum Surges, Reaching a Six-Month High - Unchained",
        "content": "NFTs are not dead, these are instead experiencing a resurgence in trading volume following a two-year low.\n\nNon-fungible tokens (NFTs) on the Ethereum blockchain are resurging, hitting their highest trading activity across all marketplaces in six months, following a recent two-year low.\n\nTotal NFT trading volume for the week ending on Monday, Dec. 4 exceeded 105,000 ETH, a more than 250% increase since the week ending on Oct. 9, Nansen data shows. A local trough in early October saw the lowest recorded level since July 2021, right before the first explosion in NFT trading.\n\nThese trends may be indicating an end to NFT winter.\n\nData\n\nfrom CoinGecko shows CryptoPunks, one of the earliest major NFT collections, have experienced an almost 45% jump in floor price over the past 30 days to 57.24 ETH. That figure remains well shy of its all-time high of 125 ETH, however.\n\nThe boom since October suggests that the “market basically agrees that NFTs bottomed,” blockchain analytics firm Parsec CEO Will Sheehan wrote to Unchained on Telegram. “The Punks rally was equivalent to a BTC rally for the NFT market. Now you see pockets of net buying in NFTs, Pudgies the most notable, but in general liquidity and attention in NFTs has inflected,” said Sheehan.\n\nThe surge in NFT trading coincides with ETH rising to around $2,200, a price point that hasn’t been seen since May 2022. “Much of the spike in NFT trading volume has to do with the price movement of ETH,” wrote Cameron Thompson, community manager and editor for NFT gallery Tonic, in an email to Unchained. “ETH’s 20% increase in the past month has not only driven the buying and selling of NFTs, but has also reinforced positive sentiments around tokenized collectibles — sentiments that have not been felt among the Web3 community in many months.”\n\nThe majority of NFT trading volume these days takes place on Blur, the leading marketplace tailored for high-frequency traders, which launched in October 2022, with former market leader OpenSea coming in second.\n\nRenewed Interest and General Appeal Outside the Crypto Ecosystem\n\nCarlos Mercado, a data scientist at blockchain analytics firm Flipside Crypto, expressed two noteworthy reasons for the increased trading volumes for NFTs. The first is renewed interest in “meme” NFTs, like Pixelmon and Milady. “These often serve as proxies for leveraged ETH, so as ETH rises the store of value narrative rises,” Mercado wrote to Unchained via Telegram. In the past 30 days, the floor prices of Pixelmon and Milady have increased 210% and 48%, respectively, per CoinGecko.\n\nThe second, wrote Mercado, is the “noticeable success (led by Nouns & Pudgy Penguins) in breaking out of crypto into the broader culture.” In September, Pudgy Penguins debuted its toy collection across 2,000 Walmart stores in the United States. OpenSea’s Pudgy Penguins page showed that in the past 30 days, volume increased 114% to 15,770 ETH, while its number of sales jumped 58% to 2,267 and floor price grew 83% to 9.7 ETH.\n\nData from blockchain analytics firm Nansen shows that Blur’s lending smart contract holds the most Pudgy Penguins, with 477 NFTs, a roughly 9% increase in the past 24 hours. The second biggest holder of Pudgy Penguins is a smart contract associated with Flooring Protocol, which fractionalizes NFTs to lower barriers to entry for new participants.\n\nPseudonymous Blur co-founder Pacman did not return a request for comment as of press time."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQTEFzVlBFaFo3VlJPT2IxSTdkS1JXRFRnNXFLeHdkR2U4WkZLT0NwWFFQLTg0SFFSMVN2SDczTUp1SnU3OGE1dWw1VDExOHRuM2FBX1pFajBuTGR5Ri1ESThyLUpibEhMNHdLSE14UEJEWVY5cHl1MlFKc2ZjQzlGVlFsaFRha1B2UnNsb0VDMWJBZ0l0R3pmMXk0eS1HUjh0SHBaSFU2WXFjWmhqSElMd2dPRUJaQU5GOEHSAb8BQVVfeXFMTTlXT1UxRnlZZ2ljaElSTEZId3ctZVRMcS1rbEM4eGl2Yk9xM09KTDhtVTlmWXJBUmpKVGp2dnJMY1hxbVVrV3RaeGlDTWxFMVBweWhPM1pMS3lCT2FnUjFkNkJ0T0VETzgxX1RDRXE4Mm1zQmRyd3JfWXZLcVk0bjd1ZjZlLXFDM190Yml3Z1FTV2g3V2ZBcEpJd0NBRnhrTENITzJpbWpvcXFCY1I5dVMyOXN6c193RW1rQXJxaW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Societe Generale-Backed Euro Stablecoin EURCV Starts Trading on Bitstamp - CoinDesk",
        "content": "The listing on Luxembourg-based Bitstamp extends its access to retail traders and marks the first occasion a euro stablecoin issued by a fully regulated bank is available on a cryptocurrency exchange. The stablecoin market is dominated by crypto-native firms like Tether, developer of developers of USDT, and Circle, with USDC, both of which are pegged to the U.S. dollar."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQQ3NoazFEMFp5N1JDNjY5Rm1OOWdkYkh0ZUVEek5CVjZpeDB4UDJVRHgwWE0xNVh1ZVVZV1c2SlBIT2tfUXA1MEpsYzVWbGdGN3JGNjBQSmxwb3UxQXBfWWRQcG92TjF6aVMyd1JWZHVVRDBFcmJ1ZTRLd0NVSDg0V2xDT1JwMkVYbmtkVy1hcWFENUVl0gGcAUFVX3lxTFBOWENVeTZSMmR6RGplTzBFOFRsdXJKQ08wSnMzQjZqREtWODdPbmJ0N1BudTM0TXREZUdZZjNWVkpqc0NNTlI3eV8zOF82bGdHUndHQ0N4M1pDdDY4ZVBfM1dNWXpKWE00UDd3RU9WSlVjVXJvTGRtbVZPWjdmc3N3MExOcFF0NHh0cmwwMVhCX2xXZ2I0czZmaEhJaA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "FaZe Clan Founder Banks Says Ethereum Is 'Large Percentage' of His Net Worth - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt’s no secret that prominent gaming influencer FaZe Banks loves crypto. Now, he’s buying more.\n\nRichard \"FaZe Banks\" Bengtson is the CEO and co-founder of esports organization and lifestyle brand FaZe Clan. The gamer took to Instagram this week to report his latest crypto purchases and double down on his pro-crypto stance amidst a broader gaming industry where crypto remains a controversial topic.\n\n“Don’t be my typical normie homie and call me asking for plays a year from now when the mainstream media and your mom [are] talking about crypto again,” Banks urged his 2.8 million Instagram followers Tuesday along with a note of Ethereum’s price reaching $2,300, a yearly high.\n\n“Expose yourself now,” Banks continued in a post evangelizing crypto and arguing that potential buyers should look at Bitcoin, Ethereum, and Solana.\n\nAD\n\nAD\n\n“BTC is the safest, ETH is about as safe with slightly more upside in my opinion. My personal favorite. A large percentage of my net worth is in Ethereum,” Banks wrote, adding that in his view, Solana is the “riskiest” of the three cryptocurrencies.\n\n“My money is definitely where my mouth is on this one. Buy it and leave it alone. Chill,” he added.\n\nLike many financial assets and purchases, though, it’s important to note that buying or trading cryptocurrencies comes with risk—and fans should be careful not to take financial advice from influencers or celebrities they follow online. It's often not clear what an influencers motivations may be in promoting a cryptocurrency, NFT project, or any financial asset.\n\nBanks also claimed that he recently spent $200,000 on four altcoins: Prime, Pepe, Mog, and Clouds, the last of which has not yet been officially released.\n\nAD\n\nAD\n\nPrime is the sci-fi NFT card game Parallel’s official token, Pepe is a frog-inspired meme coin which recently rose to a $666 million market cap, and Mog is a meme coin that’s been swirling on Twitter among fans who have paired it with memes of people and animals wearing a specific pair of colorfully-tinted glasses. Clouds is an upcoming token from the Endless Clouds crypto startup that is developing the Treeverse gaming platform.\n\n“These are the first real plays I’ve made since the big market crash,” Banks said, who over the summer also hopped onto the “SocialFi” trend and made over $70,000 by signing up for Friend.tech.\n\nBanks did not immediately respond to Decrypt’s request for comment on his latest crypto purchases.\n\nIt’s worth noting that FaZe Clan’s newly-appointed CEO has been in crypto for years now. Back in 2021, Banks was accused of allegedly pumping and dumping an altcoin he promoted, BankSocial.\n\nAnd a quick glimpse at a wallet connected to Banks called “Banksfucks” currently holds some NFTs from Azuki’s collections, two Bored Apes, four Mutant Ape NFTs, a staggering 72 Otherdeed NFTs for Yuga Labs’ Otherside metaverse game, two Clone X NFTs, and one Doodles NFT, among others. He has also recently boasted of CryptoPunks holdings.\n\nWhile Banks is a crypto and NFT enthusiast, not everyone in FaZe Clan shares this view. The org’s only current female member, Kalei Renay, previously told Decrypt in an interview at TwitchCon that she isn’t a fan of NFTs.\n\n“As a community, everybody hates NFTs,” FaZe Kalei said of gamers. “It’s your money, do whatever, but I don’t care for NFTs. I don’t do crypto, I don’t do any of that. I stay so far away from it.”\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5VRmpEQ2lHSGZ3WnR2WnZVdWRZQzkzVkVXQlFoQ2s5SzFKY09CX2Ewd2hXSXBxRHg0aVV2eTl5dDhhYXh3bHNLa3dTTHZWRzRqQXNUNGxqd1hjcWJpMEtCc0Z2RDBMZTFXeUlHdU1mY05lNERDNHZXMNIBfkFVX3lxTE1zbEhuMFJMbTNUVFlpdGdHQnJZT0pYZkpwMDNlX2EtRVhaWUZvY01CUGV1MDhqcDZsemVzVjBWdDFvYnpvOGx2anZveHFiT2JRemZXYTdOTlhGNTBibVlhNXl1VkFZcXh3bXRWdnlWaEVna2NveVBFWDdkbGdYZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Keeps Gaining Ground Against Ethereum (ETH) - U.Today",
        "content": "Advertisement\n\nBitcoin (BTC) has continued to strengthen its position against Ethereum (ETH), with the ETH/BTC ratio falling to a new low of 0.052, levels not seen since June 2022. This comes amid the flagship cryptocurrency's massive rally.\n\nBTC clears the $44,000\n\nBitcoin's recent surge has not only bolstered its standing against Ethereum but has also seen it break past the $44,000 mark on the Bitstamp exchange.\n\nThis rally has caught many by surprise and led to a precarious situation for bearish investors. According to data provided by CoinGlass, $159.61 million worth of short positions has been liquidated over the past 24 hours.\n\nAdvertisement\n\nA short squeeze, where investors who have bet against the price of an asset are forced to buy back into the market to cover their positions as prices rise, could be on the horizon.\n\nThis phenomenon could propel Bitcoin's price even higher as demand from these covering positions adds to the buying pressure.\n\nBitcoin's dominance keeps climbing\n\nBitcoin has outshone other digital assets, recording superior performance on a 24-hour basis. Ethereum saw a modest 1.9% increase. Meanwhile, Bitcoin's price jumped by 4.0%. This has pushed its market dominance to an impressive 51.3%.\n\nThis outperformance is reflective of the market's current confidence in the crypto king, which is enjoying the spotlight because of the ETF hype."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxON0ZtaGxBQVpJT08yaHd5ZnBYTXpST1RiTFMyN2hGalJweU5FZVFJdTAxbUJGZFptVndhU2tZMklQV19fcWU3TWlrYXhxUVhYaXZvUHFHMWVTaGpwN1ByN05NdDduWkp2SmRoZXZ4eG43ZFFtMDdkQW95OXViSVJCTFBtNHBsdEhwQXB2VW5aeEk3YmdESTJBNExBOGQyVWEyQ2xEXzE3SzdFSjJUVnB0RDgyb0Vvbnd3YmdrMWZRYlB0LUFyZ0tpVHZ6dGhWTHVMVG0yRnJWSERLR0Zh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Falls But Remains Above This Key Level; FTX Token, Gnosis Among Top Losers - Benzinga",
        "content": "Bitcoin BTC/USD moved higher, with the cryptocurrency prices trading above the $41,800 level on Tuesday.\n\nEthereum ETH/USD, meanwhile, recorded losses, but remained above the key $2,200 mark this morning.\n\nCasper CSPR/USD was the top gainer over the prior 24 hours, while FTX Token FTT/USD turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap rose to $1.54 trillion, recording a 24-hour gain of 0.2%. BTC was trading higher by 0.7% at $41,890 while ETH fell by around 1% to $2,203 on Tuesday.\n\nHere are the top ten crypto gainers and losers over the past 24 hours:\n\nGainers\n\nCasper CSPR/USD\n\nPrice: $0.04489\n\n24-hour gain: 27.4%\n\nStacks STX/USD\n\nPrice: $1.15\n\n24-hour gain: 24.2%\n\nConflux CFX/USD\n\nPrice: $0.2116\n\n24-hour gain: 23.3%\n\nORDI ORDI/USD\n\nPrice: $49.88\n\n24-hour gain: 21%\n\nKuCoin Token KCS/USD\n\nPrice: $9.45\n\n24-hour gain: 14.4%\n\nLosers\n\nFTX Token FTT/USD\n\nPrice: $4.30\n\n24-hour drop: 12.3%\n\nGnosis GNO/USD\n\nPrice: $195.71\n\n24-hour drop: 5.6%\n\nTHORChain RUNE/USD\n\nPrice: $6.28\n\n24-hour drop: 4.9%\n\nRender RNDR/USD\n\nPrice: $3.52\n\n24-hour drop: 4.8%\n\ndYdX (ethDYDX) ETHDYDX/USD\n\nPrice: $3.04\n\n24-hour drop: 4.2%\n\nRead This Next: Top 5 Tech Stocks That Could Lead To Your Biggest Gains In December"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxNVXdxM1AwQnhoM0ptUl9yY09Tbm5wOEZVVDBSRjNEakpNZmhQbmlHQU1XdS1ucVcxQU5VbmNCcXFOT1Y5RXp6X3hUTzdEZGYwendGaHVpcE9LdHBoRDBQWFZ6YUljUkR1WUEzUzVkYlJ0X283X0pxU3RDbGZmOHk1RGZMeEFUdm9LQ0kwN3gybnZuQnlVMUlENm5iMlJUNVZvcVUwM3dlMXZGcjNaNC1EcHJUTGlMTDBrVnhXSHM5UzZFSHpZNVVvU1Q0Q3c2WDdZelVjQUktZVpZNnctSHpOWUxxQ1FXVzNVdjJjRjBUMVVoOHJGLTh30gH8AUFVX3lxTE0tRXVEcjVhZ1hlMWdXeG1ZRmg5aWwwZDRRblFkazR0elNzYUtSTklHUFRpRW9aM0FWdmJtWm1qZm5xX0prYTFUMVdRcFVxanNtcXozVEhoZWFFV0RhbFpNeWF6UjYtMWZBZkNOOFpYZkNhRXdOWnBkZUswcTJMT1ZfSjdOdTMtbHRQZFJpOE54NGg4N25JTzVueG1ETFdlbW5oUVA2VzJZeThiVUxIb05qYjh0V0Jkc0xOc01LVFBZWXRMOVhya2x4ckFHUXN1aEtCZVVzWF9YeDFLVjZZU3MzV2pObkNMa2pLXy1UZ24xV290UEx5Z2VhZEh2Yg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC headstrong as Spot ETF talks reach technical stage - FXStreet",
        "content": "Bitcoin price could flip $43,860 into a support floor, bringing the $50,000 psychological level into view.\n\nEthereum price could climb 7% to the $2,500 level as bulls show determination.\n\nRipple price could extend 10% north as bulls make a comeback in the XRP market.\n\nBitcoin (BTC) price remains steadfast on the higher timeframe, amid news that spot BTC exchange-traded funds (ETF) discussions are now at the technical stage of approval. Specifically, talks with Spot BTC ETF issuers have advanced to key technical details, with Reuters indicating that it could signal a shift toward a potential approval.\n\nAlso Read: This is the level to beat as Bitcoin eyes $50,000 next\n\nBitcoin price could overcome $43,860\n\nBitcoin (BTC) price is confronting the $43,860 critical support, marking the midline of a weekly supply zone extending from $40,698 to $46,999. A decisive candlestick close above this mean threshold on the weekly timeframe would confirm the continuation of the primary trend, flipping the supply barrier into a bullish breaker and using it as the springboard for a race to the $50,000 psychological level.\n\nThe Relative Strength Index (RSI) remains northbound despite BTC being overbought, indicating momentum continues to rise. Meanwhile, the histogram bars of the Awesome Oscillator (AO) remain in positive territory, flashing green to show that bulls are leading the BTC market. These bolster the case to the upside.\n\nBTC/USDT 1-week chart\n\nOn the flipside, if the supply zone holds as a resistance level, Bitcoin price could face a rejection, deflecting south to lose the support offered by the $40,000 psychological level. In a worse case, the fall could extend to the $30,000 psychological level, with a weekly candlestick close below this level invalidating the bullish thesis.\n\nAlso Read: Bitcoin price hits $44,000 as Coinbase CEO speculates BTC could be key to extending Western civilization\n\nEthereum price could climb 7%\n\nEthereum (ETH) price action remains bullish since mid-October, consolidating within an ascending parallel channel. This is a bullish technical formation, promising more growth as long as the asset’s price remains within its confines.\n\nWith both the RSI and AO indicators supporting the bullish outlook, Ethereum price could rise 7% to the $2,500 level last tested in May 2022.\n\nETH/USDT 1-day chart\n\nConversely, should profit-taking kick in, Ethereum price could fail to realize the $2,500 target. The ensuing selling pressure could see ETH dwindle to lose the $2,147 support.\n\nEthereum price could then extend a leg down, converting the midline of the April 18 supply zone extending from $2,049 to $2,107 from a resistance area into a support area by breaking and closing below its midline at $2,075. A daily candlestick close below this level would not only invalidate the bullish thesis but also confirm the continuation of the downtrend.\n\nAlso Read: Ethereum Price Prediction: ETH attempts to flip $2,300 into support"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOM3NXTWZHNmVNbGtOYXE3aXpuYkdxQlRIN2ZpeWVBdlhxRVBHWjlITWdWOFI3emJkVnpjclA3c1RPVXB2WTlSeU1hSEVNVWFpWlpVMzZ0N0trS1AzSm04cXRBd1VINE9SOVo3UEdTNDZtNkFLWjlUTHd6T3BGMTBuSmktTG5QY3U2TVEwb3puNlp0UjZhbkxpRVhXR0dOZ3k5a0RXZ3RGSTE0eWpXNFFQVmpmc0UyUXNkRlN2U0xR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "OKX Ventures Joins Ethereum Climate Platform As a Launch Partner to Advance Sustainability in Web3 - OKX",
        "content": "SINGAPORE, December 6, 2023 -- OKX Ventures, the investment arm of leading crypto exchange and Web3 technology company OKX , today announced that it has joined the Ethereum Climate Platform (ECP) as a launch partner, underscoring its commitment to sustainability and decarbonization in the Web3 ecosystem.\n\nThe ECP is an innovative platform created after the transformative Ethereum Merge, leveraging the best of Web3 and traditional climate finance, technology, structures, and services. The platform is designed to galvanize climate solutions with Web3 innovation and address Ethereum's carbon emissions since its launch in 2015.\n\nOKX Ventures, with the support of the OKX Web3 team, joined a coalition of companies dedicated to expediting decarbonization and amplifying climate action through the deployment of cutting-edge technology and the cultivation of digital environmental assets. These are instrumental in reducing greenhouse gas emissions and fostering enduring environmental and societal benefits. OKX’s rigorous approach to “proof of reserves” demonstrates a commitment to the unique properties of blockchains as a tool to track and validate critical metrics, a principle that is also essential for effective climate investment.\n\nFacilitated by Consensys and climate tech firm Allinfra, other launch partners of the ECP include industry leaders like Microsoft, Polygon and NEAR Foundation.\n\nOKX Ventures Partner Jeff Ren said: \"As an active member of The Nature Conservancy, I'm thrilled that the OKX Ventures and OKX Web3 teams are collaborating with the Ethereum Climate Platform. This partnership underscores our shared commitment to integrating social responsibility and environmental stewardship into Web3 systems globally. We embrace this opportunity and responsibility to pioneer sustainable blockchain innovation to create lasting value for both people and the planet.\"\n\nECP Executive Director Anna Lerner said: \"Through this partnership, the OKX Ventures and Web3 teams are demonstrating their leadership in sustainable innovation across Web3. Its partnership with the Ethereum Climate Platform and support of Gitcoin demonstrate a dedication to ESG principles, open-source collaboration and community support. This partnership also signals a new era of eco-conscious blockchain advancement.\"\n\nOKX Ventures' participation in the ECP sets a new standard for environmentally conscious blockchain advancement in the Web3 space. It is also an important step toward its vision of an open, equitable and sustainable future of Web3."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQaW1TYzJmdUtfVGkxSVo2RTlha3BSbW52ZGtyUVVjWTcwR3FnNFNqOXEwQk0xQ0k5Rk5rU0Z6MnU3elJoU0tnQklDZmowSkVfRUhKMXdWNG1zTmt2blpibmtqSzBGM2NOT25JVkFqYzlvTE42VlhLNWZDbnpfT2ZyaDZmSVFUSmI5Z0dhTTVIaUgzVnpYd1B2ZVYxUHdtcVk4TmtFWlR4VjViUjhy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Binance looks to boost FDUSD adoption with fee-free trading for Ethereum, XRP, others - CryptoSlate",
        "content": "Binance has expanded its free trading options for the spot and margin trading pairs of the First Digital USD (FDUSD) stablecoin pairing with six digital assets, including BNB, Dogecoin, Chainlink, Ethereum, Solana, and XRP, according to a Dec. 5 statement.\n\nBinance users will see zero maker and taker fees for these pairs starting Dec. 8 for an undisclosed period. The exchange explained that the free trading option would exclude these pairs from BNB fee discounts, rebates, and other adjustments.\n\nHowever, the firm stated that it “reserves the right to disqualify trades deemed to be wash trades or illegally bulk account registrations, as well as trades that display attributes of self-dealing or market manipulation.”\n\nBinance is actively pushing FDUSD.\n\nThe free transaction promotion is part of Binance’s ongoing efforts to encourage its users to use the FDUSD stablecoin.\n\nLast week, the crypto platform said it would phase out support for Binance USD (BUSD) by Dec. 15. Binance urged users to convert their BUSD holdings into the new stablecoin before the end of the year, saying it would end BUSD withdrawals by Dec. 31 and that BUSD balances would be automatically converted to FDUSD.\n\nBinance’s decision relates to the BUSD stablecoin’s regulatory issues. Earlier in the year, the BUSD issuer, Paxos, suspended the stablecoin issuance following scrutiny from U.S. regulators. At the time, the company received a Wells Notice from the U.S. Securities and Exchange Commission (SEC), which classified the stablecoin as a security.\n\nWhile Binance and Paxos have vehemently rejected this classification, the crypto community promptly deserted the stablecoin, with its circulating supply dropping to less than $2 billion as of press time, according to CryptoSlate’s data.\n\nConcurrently, Binance has been heavily pushing FDUSD as a viable alternative, introducing new products for the digital asset and incentivizing its use. However, FDUSD’s circulating supply remains less than 1 billion and is only available on less than five crypto exchanges.\n\nMentioned in this article"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPYV9nczBLaktGdVpBcmpMWTI0V3EwLW1yczNCRVFuY1llVWFfRHFKTHJud0V2V0lSbTBhc2RQdjRlSDBQTVhTLWs1SFlUckxHQ1g0cHg5QXRPSy03YTBhbjNLaUxFdS1Nd0NPYi1venV1WkJ2MVp2dy1rOVB6ejZkX0RhZGU3NGFaSjRfYy1QVUc1bVQyQWhXUktJWjdyMGtXd0dnOUhtcmQ5SExocVJoNV9DbGtzVzdLSG8zbU5hbHZFelNObGRwWlEza3k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Crypto Analysts & JP Morgan Bullish on Bitcoin Mining - Ethereum-Based Bitcoin Minetrix Nears $5 Million In ICO - CryptoPotato",
        "content": "With Bitcoin mining stocks surging, analysts and even legacy banks like JPMorgan Chase are increasingly bullish on the sector’s prospects.\n\nMeanwhile, the Ethereum-based project Bitcoin Minetrix (BTCMTX) is nearing $5 million in its ongoing initial coin offering (ICO), thanks to the buzz around its innovative Stake-to-Mine model.\n\nThe Bitcoin Mining Sector – A Brief Overview\n\nBitcoin mining is the process of using specialized computers to solve complex math problems that validate transactions on the Bitcoin blockchain.\n\nIn return, miners earn BTC as a reward – providing an incentive to continue mining.\n\nDuring Bitcoin’s early days, mining was possible on regular home computers.\n\nHowever, as the Bitcoin network has grown, mining has become increasingly competitive, spurring an arms race in mining hardware development.\n\nThe introduction of ASIC mining rigs has enabled industrial-scale Bitcoin mining operations, helping the mining sector balloon to a multi-billion dollar industry dominated by large firms.\n\nAlthough the sector’s energy consumption has raised environmental concerns, recent innovations have begun to focus on boosting efficiency in a greener way.\n\nMoreover, these concerns have led to the exploration of alternative energy sources like solar, wind, and hydroelectric power in BTC mining operations.\n\nAccording to a report from Industry Research Co., the entire crypto-mining market was valued at $4.2 billion in 2022 and is expected to reach $4.7 billion by 2028.\n\nAnalysts & JPMorgan Bullish on Bitcoin Mining Stocks\n\nSeveral analysts, and even huge financial institutions like JPMorgan, are growing increasingly optimistic about the prospects of companies that operate in the crypto mining space.\n\nCleanSpark ($CLSK), in particular, has attracted bullish praise recently.\n\nIn a recent research note, JPMorgan called CleanSpark its “top pick” among mining stocks, citing its “scale, growth potential, power costs & relative value.”\n\nOn Twitter, crypto analyst UltraXBT expressed confidence in CleanSpark at current levels, claiming it’s a “$25 stock that is currently identifying as a $4.50 stock.”\n\nMeanwhile, ThoughtfulTrade on Twitter noted that a Bitcoin breakout above $46,000 could spur the price of mining stocks like CleanSpark to soar even higher.\n\nWith BTC mining profitability improving due to the crypto market’s recovery, firms like CleanSpark that leverage low-cost power stand to capitalize.\n\nMoreover, the upbeat outlook from JPMorgan and analysts reflects the growing optimism around the Bitcoin mining space in general.\n\nBitcoin Minetrix Platform Introduces Innovative Stake-to-Mine Model & Raises $4.8 Million\n\nWhile Bitcoin mining stocks like CleanSpark offer indirect exposure to crypto prices, a new altcoin project called Bitcoin Minetrix (BTCMTX) aims to reinvent mining rewards through staking.\n\nThe Ethereum-based Stake-to-Mine protocol allows users to earn regular BTC rewards by staking BTCMTX tokens rather than purchasing expensive hardware.\n\nBitcoin Minetrix’s protocol works by distributing “mining credits” to those who stake BTCMTX, which can be exchanged for cloud mining power.\n\nIn turn, this democratizes access to BTC mining by lowering the barriers to entry – meaning anyone can get involved.\n\nThe Stake-to-Mine mechanism also enables considerable staking yields, with current APYs exceeding 120%.\n\nUltimately, by reinventing mining rewards and making hash power more accessible, Bitcoin Minetrix has the potential to transform the crypto-mining space.\n\nOn the back of strong interest surrounding its unique value proposition, Bitcoin Minetrix’s team recently launched a presale for BTCMTX.\n\nThe presale aims to raise funds to develop and scale the Stake-to-Mine platform further.\n\nMore than $4.8 million has already been raised from eager investors, with BTCMTX tokens available to buy for $0.012 each.\n\nOnce the presale concludes, Bitcoin Minetrix’s team plans to list BTCMTX on leading centralized exchanges, enabling seamless trading for speculative investors.\n\nWith strong presale momentum and backing from high-profile names like VoskCoin, BTCMTX seems poised to make a splash when public trading begins.\n\nVisit Bitcoin Minetrix Presale\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOX1J2MkpHSXcyb1hxZzNqWDBTbXdsMTZUOU9QTktIb0xsQmFtUnMwY2c1OEV3QXBRZVQtXzlUVmp2MFVKa19JWjg0QUxaRVUyWnZEVHlIVl9mOTJXaVJZZEcwVkhkSW1TQ3ptZjRHWjFNaU5YTW5VNGxKbkpPenZ3WW9pOUlaWHFhNkR5c1g1aXNiUzZuYUdyUk9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Dogecoin (DOGE), Ethereum (ETH), and Pullix (PLX), Which Has The Best Utility? - CryptoPotato",
        "content": "The crypto market is heating up as altcoins are taking turns to pump. Dogecoin (DOGE), Ethereum (ETH), and Pullix (PLX) are currently being discussed as the next big cryptocurrencies to experience a surge in value. While the former two have been around for a while, Pullix is a new player set to change the trading game. But which among these three alts has the best utility for investors and traders?\n\nPLX Token: Integrating Utility with Pullix’s Trading Innovation\n\nPullix is building a decentralized trading exchange that promises to tackle the common issues experienced by traders, such as high fees, lack of transparency, and slow transaction speeds. The platform will utilize blockchain technology to provide all traders with a secure and decentralized environment.\n\nBlockchain technology enables Pullix to have a transparent and auditable trading system, eliminating the need for middlemen and reducing transaction fees. It also allows users to trade anonymously across all markets, providing traders maximum security and privacy.\n\nPullix directly links its native cryptocurrency to the trading platform’s performance and offers tangible benefits to its users. For example, PLX token holders receive regular passive income payments, access to exclusive rewards, and other benefits depending on the staked amount.\n\nThe token burn mechanism for Pullix’s PLX token aims to stabilize and potentially increase the token’s value. This is achieved by allocating a portion of the platform’s daily profits to purchase and permanently remove (burn) 50% of these tokens from circulation, thereby reducing the total supply.\n\nThe remaining 50% rewards users for staking their PLX, incentivizing long-term holding and active participation in the Pullix ecosystem. This deflationary approach is designed to align the platform’s interests with those of its users and investors.\n\nThis innovative approach makes the PLX token not just a medium of exchange but a key player in the Pullix ecosystem. As Pullix’s trading platform gains popularity, the value of PLX is expected to increase, making it an attractive investment for traders.\n\nAnd with Pullix at the start of its journey, investors can get in early and reap the benefits as the platform gains momentum. Someare already recognizing this opportunity and snapping up PLX tokens for $0.04 before the price rises in subsequent stages.\n\nEthereum (ETH): The Backbone of Decentralized Applications\n\nEthereum (ETH) has surged from $1,500 to $2,245 in under a month as investors continue to show confidence in the second-largest cryptocurrency. The $2,100 price mark has acted as resistance since May 2022, and traders expect a huge pump once this level is breached.\n\nEthereum is the cryptocurrency with the most utility in the market. It is not only a store of value but also the foundation for various decentralized applications (DApps). There are lending platforms, games, and even decentralized exchanges built on the Ethereum blockchain.\n\nEthereum faces competition from the likes of Solana and Radix, which offer lower fees and faster speeds. The upcoming EIP-4844 procotol upgrade is expected to solve the scalability issue, helping Ethereum maintain its dominance as the number one platform for DApps.\n\nInstitutional investors are now taking notice of Ethereum, with spot Ethereum ETF applications sent to the SEC for approval. Should these be approved, we could see an influx of institutional funds into the market, leading Ethereum to the coveted $10,000 price point.\n\nDogecoin (DOGE)’s Potential New Use Case\n\nDogecoin (DOGE) took the crypto world by storm in early 2021 as Elon Musk — the world’s richest man — tweeted favorably about the memecoin. While Dogecoin has no real utility, it has a strong community, making it a popular choice for sending low-cost transactions.\n\nHowever, Dogecoin may soon have another use case — as an accepted currency on X (Twitter) for tipping. Elon Musk still has the Dogecoin logo in his Twitter bio and hinted that this integration could be coming soon.\n\nAstrobotic’s Peregrine Mission One is set to carry a physical Dogecoin token to the moon, marking a symbolic journey for Dogecoin. This move could garner more attention from mainstream media and potentially lead to retail investors flocking to buy Dogecoin as FOMO sets in.\n\nThe Dogecoin chart shows that there have been numerous attempts to break the $0.10 – $0.11 resistance area. A successful close above this level can open up room for further upsides, potentially seeing Dogecoin reach $0.20 during Q1 of 2024.\n\nFor more information about Pullix, visit the links below:\n\nSite: https://pullix.io/\n\nTwitter: https://x.com/pullixmarkets\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPLWlMY0llMEdIdUdtUVoxaWxCbXBnbGhXWFNuVkNhOGVGT2o1MVRuWEZvczQ5ZW0yLVFBN05kMmpVYzFUekZHQUtIbWhCTklCMEc0TUtDNnhBMmlZdng4UFJiWDJkcWd3eWhYbHpfTTlXb21KSFpEcTVid1hwYUlZWVdHQ1NHUGhoUTJYRExDcTc5RE5QQUYyOUlIOTgxREd1T0JtQzRyTFBIanpRNVI3ZExWQXlwbnhGbU9ENzF30gHDAUFVX3lxTE51VWRuT0JiLUhydlE4Y0VIS25yZFEyc2VJVVN5SzlsejMta3Rrb1V6Qjl6RWl3U0xLaHQ3d2x4WkNCNHFNZDJrNmloZ3hhMERJdDBuNmJ6aGJvVkNFYWtmYWQwN1p2bXI3SkhPNVZqY1ZfdUdzdWpQaE1LNllfVGtpc1hXTFRnYWRLVW9PYW9PNzI1YzJnZTJ0WHZqanM0bjFlOVBOcGVDb25fWUZRbmRLM1c0YVM4R1RxRkV5UW9hWTUxdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Trader Predicts Massive Solana (SOL) Rally to New All-Time High of $360 – Here’s His Timeline - The Daily Hodl",
        "content": "A popular crypto analyst thinks Ethereum (ETH) competitor Solana (SOL) could skyrocket to new all-time highs within the next year.\n\nThe pseudonymous trader known as Inmortal shares a chart with his 202,700 followers on the social media platform X that projects SOL surging to $360 by the beginning of 2025.\n\nInmortal’s chart predicts the sixth-ranked crypto asset by market cap will jump up to around $100 near the end of this year and then realize most of its gains in the second half of 2024.\n\nSOL is trading at $60.81 and is down more than 3% in the past 24 hours. The Ethereum competitor’s all-time high is around $260, which it hit in November 2021, according to CoinGecko.\n\nLooking at the peer-to-peer payments network Litecoin (LTC), Inmortal predicts the crypto asset could jump to around $90 by early 2024.\n\nLTC is trading at $72.38 at time of writing.\n\nIn terms of Bitcoin (BTC), the analyst says there could be a BTC price dip this week. Inmortal notes that $38,000 is the level where he wants to go long on the top crypto asset.\n\nBTC is trading at $41,894 at time of writing, its highest level since April 2022. The top crypto is up more than 6% in the past 24 hours and nearly 20% in the past month.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxQMEE4a0VLQVNZWEQyLUUwY1R6dTdpai1wSXJwdGVZSkxEdG1TUUJqVzU5Zm1PZlk4aHFYdDhYamJ1ZWlHR3lSMkR2QW1mY0dILV8taEhPdWEyNFFHYzFjNVAtQlZCeGQtR0tIc2REYnNNOUhvQTN5WXNZUUlCOG5FMlFtSlMwZTRjTVhNQ3dadmJ5R3RodHBBRy1TU3hWdXlaUmg5UDZtR2JfNU1zMWQzQkNlMUdNYnRhX1ZBX1NtZktHRWQtRlphaTlyclJZalBsczIyWWdtVkU4NnpzczBuLUw4Ny1FenQ1QUFuNlpJRHpqT1Q1ZWhhYktn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "OKX Ventures Joins Ethereum Climate Platform As a Launch Partner to Advance Sustainability in Web3 - Thailand Business News",
        "content": "SINGAPORE, Dec. 6, 2023 /PRNewswire/ — OKX Ventures, the investment arm of leading crypto exchange and Web3 technology company OKX , today announced that it has joined the Ethereum Climate Platform (ECP) as a launch partner, underscoring its commitment to sustainability and decarbonization in the Web3 ecosystem.\n\nThe ECP is an innovative platform created after the transformative Ethereum Merge, leveraging the best of Web3 and traditional climate finance, technology, structures, and services. The platform is designed to galvanize climate solutions with Web3 innovation and address Ethereum’s carbon emissions since its launch in 2015.\n\nOKX Ventures, with the support of the OKX Web3 team, joined a coalition of companies dedicated to expediting decarbonization and amplifying climate action through the deployment of cutting-edge technology and the cultivation of digital environmental assets. These are instrumental in reducing greenhouse gas emissions and fostering enduring environmental and societal benefits. OKX’s rigorous approach to “proof of reserves” demonstrates a commitment to the unique properties of blockchains as a tool to track and validate critical metrics, a principle that is also essential for effective climate investment.\n\nFacilitated by Consensys and climate tech firm Allinfra, other launch partners of the ECP include industry leaders like Microsoft, Polygon and NEAR Foundation.\n\nOKX Ventures Partner Jeff Ren said: “As an active member of The Nature Conservancy, I’m thrilled that the OKX Ventures and OKX Web3 teams are collaborating with the Ethereum Climate Platform. This partnership underscores our shared commitment to integrating social responsibility and environmental stewardship into Web3 systems globally. We embrace this opportunity and responsibility to pioneer sustainable blockchain innovation to create lasting value for both people and the planet.”\n\nECP Executive Director Anna Lerner said: “Through this partnership, the OKX Ventures and Web3 teams are demonstrating their leadership in sustainable innovation across Web3. Its partnership with the Ethereum Climate Platform and support of Gitcoin demonstrate a dedication to ESG principles, open-source collaboration and community support. This partnership also signals a new era of eco-conscious blockchain advancement.”\n\nOKX Ventures’ participation in the ECP sets a new standard for environmentally conscious blockchain advancement in the Web3 space. It is also an important step toward its vision of an open, equitable and sustainable future of Web3.\n\nAbout OKX Ventures\n\nOKX Ventures is the investment arm of the leading crypto exchange and Web3 technology company OKX. It focuses on exploring the best blockchain projects globally, supporting cutting-edge blockchain technology innovation, promoting the healthy development of the global blockchain industry, and investing in long-term structural value.\n\nThrough its commitment to supporting entrepreneurs who contribute to the development of the blockchain industry, OKX Ventures helps build innovative companies and brings global resources and historical experience to blockchain projects.\n\nFind out more about OKX Ventures here .\n\nAbout OKX\n\nA leading global technology company driving the future of Web3, OKX provides a comprehensive suite of products to meet the needs of beginners and experts alike, including:\n\nOKX Wallet: The world’s most powerful, secure and versatile crypto wallet which gives users access to over 70 blockchains while allowing them to take custody of their own funds. The wallet includes MPC technology which allows users to easily recover access to their wallet independently, removing the need for traditional, ‘written down’ seed phrases. In addition, OKX Wallet’s account abstraction-powered Smart Account enables users to pay for transactions on multiple blockchains using USDC or USDT, and interact with multiple contracts via a single transaction.\n\nDEX: A multi-chain, cross-chain decentralized exchange aggregator of 300+ other DEXs and approximately 15 bridges, with 200,000+ coins and more than 20 blockchains supported.\n\nNFT Marketplace : A multi-chain, zero-fee NFT marketplace that gives users access to NFT listings across seven top-tier marketplaces including OpenSea, MagicEden, LooksRare and Blur.\n\nOKX partners with a number of the world’s top brands and athletes, including English Premier League champions Manchester City F.C., McLaren Formula 1, The Tribeca Festival, Olympian Scotty James, and F1 driver Daniel Ricciardo.\n\nAs a leader building innovative technology products, OKX believes in challenging the status quo. The company recently launched a global brand campaign entitled The System Needs a Rewrite, which advocates for a new paradigm led by Web3 self-managed technology.\n\nTo learn more about OKX, download our app or visit: okx.com\n\nAbout ECP\n\nInspired by the Ethereum Merge, a group of technology companies—aligned around the mission of accelerating decarbonization and scaling climate action—the ECP was founded to accelerate climate action at scale by funding high-quality carbon mitigation projects and accelerating Paris-aligned climate investments. The platform is also committed to redressing and counteracting the historical Ethereum-based carbon footprint, dating back to the network’s launch in 2015, and accelerating the ECP launch partners’ own decarbonization strategies.\n\nDisclaimer\n\nSource : OKX Ventures Joins Ethereum Climate Platform As a Launch Partner to Advance Sustainability in Web3\n\n\n\nThe information provided in this article was created by Cision PR Newswire, our news partner. The author's opinions and the content shared on this page are their own and may not necessarily represent the perspectives of Thailand Business News."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE5fYW9BcU4zc3VJd0NBdzQzcWVNOUJDTjM0V0VlTkxyY3cxR2hoenhvaGx6ODdjWEt0TXVvemxZYjFiYXJURWFIY3NaUm9KYkpPUXZPdlFFNGd3WTFaRE1KeEsyZFF6QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ether vs Ethereum: The Key Behind Crypto Development - INDODAX",
        "content": "In discussions about the world of crypto assets, the role of Ether (ETH) and blockchain platform, Ethereum is very important and needs to be understood. Ethereum is a decentralized computing platform that executes computer programs known as smart contracts.\n\nIt has a native crypto asset called Ether (ETH), which is the crypto asset with the second largest market capitalization after Bitcoin. However, Ether is a crypto asset and a “gas fee,” enabling various decentralized transactions and applications or Decentralized Applications (dApps) to operate within the Ethereum ecosystem.\n\nAs a blockchain platform, Ethereum is known to have created the foundation for major innovation in the crypto world. By understanding the differences and relationships between Ether and Ethereum, we can avoid any misunderstandings that may arise. This means that Ether is not just a digital coin but also a key element that drives the economy on the Ethereum blockchain.\n\nSo, to understand what Ether (ETH) is, its role in the Ethereum ecosystem, the relationship between the two, and the latest trends and future projections for Ether, see the complete review below!\n\nWhat is Ether (ETH)?\n\nIt is important to know that the Ethereum blockchain is one of the oldest and most widely used blockchain networks. Ether, which functions as a gas fee, has become one of the leading cryptocurrencies after Bitcoin in terms of market value.\n\nAs explained at the beginning of this article, Ether is a native coin or native asset used in the Ethereum blockchain to facilitate transactions throughout its ecosystem. Every transaction in the Ethereum ecosystem requires payment of a computing fee (gas fee) to the miners who carry out the transaction computation. This payment is made using Ether.\n\nThese gas fees increase with the computational complexity required. For example, the shipping costs of ERC-20 tokens are higher than sending ETH because sending ERC-20 tokens uses interaction and computing on smart contracts while sending ETH does not involve such a process.\n\nETH has various uses as a digital asset and for carrying out various transactions in the Ethereum blockchain ecosystem. Please note that Ethereum has become one of the most widely used blockchain platforms for building dApps, along with its ability to support more programs than Bitcoin.\n\nAs a crypto asset, ETH has an important role as gas fees are paid to run computations on various applications developed on the Ethereum platform. This makes ETH one of the second largest crypto assets after Bitcoin when viewed from market value.\n\nWhen it was first traded, the value of one Ethereum coin was around $2.83 or around IDR 41,035. However, in June 2021, the price of ETH jumped to $2,578 per coin, or the equivalent of IDR 36,822,218. ETH’s highest price peak occurred in November 2021, reaching $4,620. However, in December 2022, the price of Ethereum will decrease to $1,225 per coin, or the equivalent of IDR 19,264,748.\n\nSo, if you are interested in buying ETH, you can purchase through a trusted crypto buying and selling application, namely INDODAX. As a platform, INDODAX has been officially registered as a Physical Crypto Asset Trader under the Commodity Futures Trading Supervisory Agency (BAPPEBTI) so that security is guaranteed. You can download the INDODAX application to buy ETH.\n\nThe Role of Ether in the Ethereum Ecosystem\n\nIt is important to understand that Ether (ETH) is important in the Ethereum ecosystem and is used for various purposes on the network. One of Ether’s main roles in the Ethereum ecosystem is as a digital asset.\n\nInitially, Ether was created as a digital asset for use on the Ethereum network. Most transactions and smart contracts are carried out using Ether. In this case, users can send and receive Ether within the Ethereum ecosystem.\n\nEther’s other main role is to pay transaction fees. Every time someone sends Ether or performs a function within a smart contract, they have to pay a transaction fee. These fees are known as “gas,” which is necessary to ensure that the Ethereum network runs efficiently and prevents network abuse.\n\nThe gas is a unit of measurement for measuring how much computing power is needed to complete a task on the Ethereum network. Smart contract transactions/execution require gas, and transaction fees are calculated based on the amount of gas used.\n\nOn the other hand, Ether also plays an important role in maintaining network security. Miners who process transactions and secure the network will receive rewards in the form of Ether for their efforts. This also provides incentives for miners to maintain network reliability and security.\n\nApart from that, Ether is also used as a store of value in the network’s decision-making process to create tokens and to run smart contracts on the Ethereum network. For example, ERC-20 and ERC-721 tokens are often created using Ether as “gas” to carry out smart contracts.\n\nEthereum Ecosystem: Beyond Ether\n\nAs previously explained, smart contract technology on Ethereum drives new innovations in financial transactions. The following are several examples of smart contract implementation that are currently underway including:\n\n1. Stablecoins\n\nCrypto asset prices are often very volatile. Stablecoins , which utilizes smart contract technology, also solves this problem. The value of stablecoins is held to the value of non-digital assets, such as the rupiah and US dollar, to maintain their stability.\n\nSome well-known stablecoins maintain stability by guaranteeing a 1:1 rate with the original currency and being convertible to that currency. For example, Rupiah Token (IDRT), a crypto asset on the Ethereum blockchain, has a value equivalent to the rupiah. IDRT creates a digital representation of rupiah by generating tokens in proportion to the amount of rupiah deposited by the user and sending them to the user’s Ethereum wallet.\n\nApart from IDRT, another example of a stablecoin, namely USD Coin (USDC), is designed to have the same value as the US dollar. The existence of stablecoins makes it easier for users to transfer value to various places around the world in a short time. Stablecoins also provide the stability needed in the crypto ecosystem and connect traditional financial infrastructure with the blockchain world.\n\n2. Borrow and Borrow on Ethereum\n\nSmart contract technology on the Ethereum blockchain also enables the development of crypto asset lending and lending applications. For example, AAVE and Compound are decentralized lending and lending Apps (dApps) based in the Ethereum ecosystem.\n\nWith AAVE and Compound, users can deposit crypto assets to earn interest or borrow other crypto assets. Using these two applications requires an Ethereum wallet and a certain amount of funds in the form of ETH or ERC-20 tokens. With AAVE and Compound, anyone can be involved in asset lending and lending activities without relying on banks or traditional financial institutions.\n\n3. Decentralized Exchanges (DEXs)\n\nDecentralized Exchanges (DEXs) are applications that facilitate token exchange using smart contract technology. One example of a very popular DEX built on Ethereum is Uniswap and Sushiswap.\n\nThrough DEXs, users can exchange ETH for ERC-20 tokens or vice versa and exchange between ERC-20 tokens. As long as it follows the ERC-20 token standard, various types of tokens can be exchanged using DEXs.\n\nThe Connection Between the Two\n\nEther (ETH) and Ethereum are interrelated concepts, but they have different roles in the Ethereum blockchain ecosystem. Ethereum is a blockchain platform allowing developers to create and run dApps. On the other hand, Ether is a crypto asset used on the Ethereum network.\n\nRemember that Ethereum is designed to support smart contracts, programming codes that can execute certain tasks when specified conditions are met. Ether is used as “gas” to carry out these operations, including executing smart contracts.\n\nOn the other hand, Ether is also used as an incentive for miners (or validators in the context of Ethereum 2.0), which helps keep the network decentralized and secure. Miners will receive Ether in exchange for adding blocks to the blockchain.\n\nEther is also used as a digital asset to carry out transactions within the Ethereum network. Every time someone sends Ether, it automatically reflects a transfer of value within the Ethereum ecosystem. Meanwhile, when someone runs or interacts with smart contracts, he must pay transaction fees in the form of Ether. This helps prevent network abuse and ensures that people who use network resources pay for that use.\n\nEthereum and Ether complement each other. Ether itself is essential to maintaining the functionality of the Ethereum network. Without Ether, executing transactions, implementing smart contracts, or ensuring network security would be impossible. The existence of Ether itself supports the Ethereum ecosystem by providing incentives for developers to create decentralized applications and for miners (validators) to keep the network safe and decentralized.\n\nHistory and Evolution\n\nThe history of Ether and Ethereum is known to have reflected a long journey towards the development of blockchain technology and the growth of the crypto ecosystem as a whole. Referring to its history, Ethereum was first proposed by Vitalik Buterin in 2013. It was an evolution of the idea to expand Bitcoin’s functionality by enabling smart contracts.\n\nThe funding for Ethereum development was obtained through an initial public offering (ICO) in 2014, where Ether (ETH) was first sold to investors. Furthermore, Ethereum was launched on July 30, 2015, with the launch of the first block, or “Genesis Block.”\n\nAs time passes, Ethereum 2.0 aims to move away from consensus Proof-of-Work (PoW) to Proof-of-Stake (PoS), which began to be developed to increase network scalability and efficiency. The first phases of Ethereum 2.0 are launched, and the transition towards PoS begins.\n\nFurthermore, the launch of Ethereum as a new blockchain platform and raising funds through ICOs is known to have played an important role in forming the modern crypto ecosystem. One of the important events that shaped their role in the crypto industry was when an attack occurred on Decentralized Autonomous Organization(DAO). In 2016, an attack on the DAO on Ethereum led to a massive theft of Ether.\n\nTo overcome the consequences of the DAO attack, the Ethereum community decided to carry out a hard fork, then created Ethereum (ETH) and Ethereum Classic (ETC) as two separate blockchain chains. Ultimately, efforts to improve network performance and security through Ethereum 2.0 and the transition to PoS are important steps in Ethereum’s evolution.\n\nThe Importance of Maintaining Both\n\nIt should be emphasized that Ether is the driving force in the Ethereum ecosystem. By maintaining its sustainability, Ether continues to support the execution of transactions and smart contracts on the network. This is important for maintaining blockchain functionality and allowing various decentralized applications to run. Apart from that, Ether also plays an important role in maintaining the resilience of the Ethereum network. Through incentives for miners (or validators in Ethereum 2.0), Ether ensures that the network remains secure, distributed, and resistant to attacks.\n\nFurthermore, Ethereum powered by Ether also plays a key role in driving innovation in Decentralized Finance(DeFi). Ether’s sustainability supports liquidity, collateral, and smart contract functionality that is the foundation for various DeFi projects, from loans to exchanges to other protocols.\n\nEthereum, which can run smart contracts, is known to have paved the way for various use cases, including finance, logistics, digital identity, and many others. Therefore, maintaining Ether is key to ensuring that innovation continues to develop in various sectors. On the other hand, Ethereum has also become the main platform for DeFi projects. The growth of DeFi is also one of the main factors driving wider crypto adoption, as it provides a decentralized alternative to traditional financial services.\n\nTherefore, it can be concluded that Ether and Ethereum play an important role in forming and maintaining the crypto ecosystem. Ether’s sustainability supports transactions, network security, and innovation within Ethereum, while Ethereum, as a platform, continues to drive the growth and broader adoption of blockchain technology. Both are interdependent and play an important role in driving the evolution of the global crypto ecosystem.\n\nRecent Trends and Future Projections\n\nThe latest trends in Ether and Ethereum can be seen from the development of Ethereum 2.0 and PoS. Development of Ethereum 2.0 itself continues, with a focus on implementing PoS to increase network efficiency and sustainability. Additionally, the DeFi sector continues to be a major trend within the Ethereum ecosystem, with the growth of projects such as lending protocols, decentralized exchanges, and liquidity mining.\n\nThen, there are also Layer-2 scalability solutions, such as Optimistic Rollups and zk-Rollups, which gained popularity to address Ethereum’s scalability challenges, enabling faster transactions and lower fees. Meanwhile, regarding future projections for Ether and Ethereum, with the continued development of Ethereum 2.0, future projections involve a swap from PoW to PoS, which is expected to increase network speed and efficiency.\n\nOn the other hand, the DeFi sector is also expected to continue to develop with more innovations, such as introducing more complex financial products, growing lending and borrowing protocols, and cross-chain solutions to increase interoperability. Ultimately, if Ethereum 2.0 successfully addresses scalability and transaction cost issues, then Ethereum will have the potential to play a role in revitalizing the global financial system, opening the door to greater financial inclusion and decentralized financial solutions.\n\nIntegrating blockchain and smart contracts on Ethereum could also bring major benefits to various industries, from supply chains to insurance, with the potential to reduce bureaucracy and increase efficiency.\n\nBuy Ethereum on INDODAX\n\nSo, now you understand what Ether (ETH) is, its role in the Ethereum ecosystem, the relationship between the two, and the latest trends and future projections for Ether.\n\nNext, if you want to buy Ethereum (ETH), you can do it at INDODAX. The following is a guide to buying Ethereum on INDODAX that you need to know:\n\nFirst, log in to your INDODAX account.\n\nThen, make a deposit (if the balance is still empty).\n\nContinue by visiting the INDODAX market, then search for Ethereum on the INDODAX market.\n\nNext, look for the trade column and enter the desired Ethereum price and balance amount. You can use the Instant method or the Limit method.\n\nAlternatively, you can immediately place a sell order at the price you determine after you have Ethereum. Make sure that the price is profitable.\n\nConclusion\n\nIn conclusion, Ether functions as a digital asset within the Ethereum network, allowing transactions and payment of network operational fees (gas). In addition, Ether also provides incentives for miners (or validators) to keep the network secure via PoW or PoS.\n\nMeanwhile, Ethereum provides a platform for running smart contracts that allow the creation and execution of programming code without third-party intermediation. Ethereum is the basis for a growing DeFi ecosystem and various dApps that create decentralized alternatives to traditional financial services.\n\nUnderstanding Ether and Ethereum is important to understand the functionality and usability of the crypto ecosystem. A deep understanding of Ether and Ethereum is necessary to participate effectively in the crypto ecosystem and recognize the transformational potential they can bring to various sectors and industries in the future."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOdVJLWkRoNC13QUExRUV6a1pPR3dmU2pWMnVjR3FrNkxMbkNJWVlXUlFPMVRBX2o4RzFZazFGcTBIR3ZEUU1tbndoWjRVY1BlWjRhclZsbEdaRkxRWEtoLU10SjRJQU5DT0NHb05QVEJISHk0azFneDBiaWllZDNfY21NWDJJSzZrb0RzZ2x3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "How to buy Bitcoin and Ethereum in the UK - Luxury Lifestyle Magazine",
        "content": "Cryptocurrency has become hot property in the UK over recent years, with everyone from seasoned professionals to complete amateurs seeking to dip their toes into the waters of trading. Despite their market’s characteristic volatility, they have become seen as a means to an end by those looking to build their wealth and diversify their investment portfolios, and it is in fact because of their dramatic price swings that they have become so highly sought-after. In the early days of cryptocurrencies, the world’s flagship digital asset, Bitcoin, made numerous overnight millionaires during its meteoric rise from obscurity to prominence, and since then, we’ve seen plenty of other investors build millions by trading Bitcoin, Ethereum’s Ether, and other popular.\n\nWhilst these days it couldn’t be easier to convert 1 ETH to USD or Bitcoin to British pounds sterling, as the acceptance of cryptocurrencies as a means of payment becomes more widespread, it’s becoming more appealing than ever to retain crypto fortunes in their original format. It’s now possible to pay for high-end hotels and holidays, luxury cars and even homes using crypto wallets, which is a sign that cryptocurrency is well and truly here to stay.\n\nIf you’re keen to begin your trading journey and start amassing some digital coins with the hopes of building long-term wealth, then here’s how you can buy Bitcoin, Ether and other alt coins of note in the UK.\n\nIs it legal to buy Bitcoin and Ether in the UK?\n\nThe good news is that although some countries do have restrictions on buying cryptocurrencies, in the UK, it’s perfectly legal to purchase Bitcoin, Ethereum, and other comparable digital coins, and there’s a well-defined regulatory framework in place. This does mean that like all other income, cryptocurrencies are legally considered to be taxable assets, which means holders must report their assets and pay their dues to His Majesty’s Revenue and Customs (HMRC) each year to ensure full compliance.\n\nCryptocurrency has become hot property in the UK over recent years, with everyone from seasoned professionals to complete amateurs seeking to dip their toes into the waters of trading\n\nCryptocurrencies aren’t, however, recognised as legal tender in the UK in the way that the British pound is.\n\nWhy you need a crypto wallet\n\nOne of the crucial measures to put in place before you delve into investing in Bitcoin and Ethereum is to ensure you have an account set up with a crypto exchange, and a secure crypto wallet ready to go. When starting out, there’s nothing wrong with leaving small amounts as holdings on your account, once you start to amass larger amounts of tokens you’ll want to ensure you have somewhere safe to store them. A cold crypto wallet will give you more control over your funds and full autonomy when it comes to controlling them by safeguarding the private keys needed to access it and to authorise transactions.\n\nHow to buy Bitcoin and Ether in the UK\n\nOne of the easiest ways to purchase cryptocurrencies in the UK is via a crypto exchange, but with such a wide variety to choose from, it’s wise to shop around first. Exchanges operate without formal regulation, but registration is required by the Financial Conduct Authority (FCA), so be sure to choose an exchange that plays by the rules as there are still some that don’t.\n\nIt’s worth noting that not all exchanges will offer all cryptocurrencies, so check that yours has Bitcoin and Ether available to purchase before signing up. You’ll also want to ensure that there’s substantial daily trading volume in these to make your own trading transactions easier, and be sure to take any fees into account, as these can affect your returns.\n\nAnother option is to go with a broker like Kraken, which offers a user-friendly interface and makes the trading process simpler, which is great if you’re just starting out. Some also offer the chance to try out some moves via a dummy account before you start making real time trades, which can be a handy way to learn the ropes and gain a thorough understanding of how the market works before risking real capital.\n\nOne of the easiest ways to purchase cryptocurrencies in the UK is via a crypto exchange, but with such a wide variety to choose from, it’s wise to shop around first\n\nIf, however, you’re keen to keep your accumulated crypto funds in a cold crypto wallet, which is offline, brokers do not always allow this, so it’s something to bear in mind when deciding whether to go with a broker or an exchange.\n\nPlacing your first order\n\nThere are various ways to fund your brokerage or exchange account so that you can start buying crypto. One of the easiest ways is by linking your bank account, but you can also make payments via debit or credit card. You’ll need to submit an identification document before you’re able to trade, which can mean that you’re not able to make your first purchase immediately, but verification rarely takes more than a couple of days.\n\nOnce you’re ready to go, you can place an order for Bitcoin or Ether by entering the desired amount in pounds, and you’ll then be able to see how much of your desired asset you can get for your money – which will often be fractional shares of large cryptocurrencies like these if you’re starting small. Next, all you need to do is click the ‘buy’ button and you’re off the starting block, and ready to begin your investing journey.\n\nDisclaimer: Investing money carries risk, do so at your own risk and we advise people to never invest more money than they can afford to lose and to seek professional advice before doing so."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE4weXo4ZmZiS2NvdVNWNXRyYlV4Z1R6dWUzdXZjUGFWYjVaVGMzaVQ4QkR2V2Q5UVlOT2tTMW9YTHlYbnBaOUk2WDdBdGhtdVZuZDVwLVlMc3hoSVI0eFNUZzM3MDNIVWc4aGsyam5oc3hwU0hSUEQwd9IBfkFVX3lxTE5BVnp6MXVfaktpTHNVNXo4US12TTNqb1hyU2xzR3NoNlJTQ3o2QjBwUGNjellGdEVQZldEbExBVk90dXFBZTdwSlo5czVuSGQ3LW9sZkFBdUZqX0NWdmhIUk84OEpjclk1SGpsYVlLcW5EcmM3b0xYWFBucHgtdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Bloomberg Experts Forecast Timeline For Spot Ethereum ETF Approval - NewsBTC",
        "content": "The journey towards the approval of an Ethereum ETF in the United States has seen a new development yesterday as the US Securities and Exchange Commission (SEC) has announced a delay in the decision for Grayscale’s Ethereum trust conversion into a spot Exchange Traded Fund (ETF). The SEC has stated the need for an extended period to evaluate the proposed rule change, pushing the new deadline Grayscale to January 25, 2024.\n\nIn its reasoning, the SEC has reiterated, “The commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein.” Notably, the delay comes at a time where the US agency is working with now 13 spot Bitcoin ETF applicants on presumably the final amendments before a January 10 approval.\n\nTimeline For A Spot Ethereum ETF Approval\n\nDespite the latest delay, the crypto community remains optimistic about the future of spot Ethereum ETFs. Bloomberg ETF analyst James Seyffart has suggested that delays are par for the course, tweeting, “Update: As expected Grayscale’s Ethereum trust filing just got delayed. It was due by 12/6/23 so this is completely normal.”\n\nSeyffart also shared a table of all seven spot Ethereum ETF applicants: VanEck, 21Shares & ARK, Hashdex, Grayscale, Invesco & Galaxy, BlackRock, Fidelity and their deadlines. He further hinted at potential approvals by mid-2024, responding to criticisms from Adam Back, CEO of Blockstream, with “Unfortunately I think you’re gonna be really upset by June of next year.”\n\nIn response to queries about the probability of an Ethereum ETF approval following a Bitcoin ETF, Eric Balchunas of Bloomberg has indicated that the first filers, Ark and VanEck, have strong odds of approval by their final deadline on May 23, 2024, as they are expected to use the same mechanics as spot Bitcoin ETFs, and due to the fact that Ether futures have already received the green light from the US SEC.\n\nRelated Reading\n\nQueried about for the odd of a spot Ethereum ETF approval, he remarked, “Not formally yet, but final deadline for the first filers Ark and VanEck is May 23rd so strong odds they approved by then given they’d be using same design as btc etfs and ether futures were Ok’d.”\n\nThe Next Deadlines\n\nThe table by Seyffart shows that the next Ethereum ETF deadlines are from December 23 to 26 for VanEck, Ark Invest and Invesco & Galaxy, followed by Hashdex on January 1. Since a spot Bitcoin ETF is very unlikely to be approved by then, delays by the SEC are more than likely for this batch of filings.\n\nRelated Reading\n\nBoth iShares by BlackRock and the Fidelity Ethereum Fund have their next deadlines on January 25 and January 21, 2024 respectively. These dates are crucial as they could involve either an extension, a request for more information, or a final decision.\n\nBut things only get really tense towards the final deadlines for all Ethereum ETF filers, as outlined by both Bloomberg ETF experts. With VanEck poised for May 23, 2024, and ARK Invest for May 24, 2024 and other notable filers like Hashdex Nasdaq Ethereum ETF and Grayscale’s Ethereum Trust Conversion (ETHE) scheduled for decisions by May 30, 2024, and June 18, 2024, respectively, the timeline for potential approvals is taking shape.\n\nAt press time, ETH traded at $2,271.\n\nFeatured image from Shutterstock, chart from TradingView.com"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQZ2sySzZUX3g1aVFseWVMUmVsSUVZcUJiZWM1RTEwdDUyRmlEWHQxdjNQN2twZzJpWlNnQ1dfdTZITWgxbFBpSGFuRGtRMjdXb0pMTndWWVhEREk2TWd1V1JZVV93SUs5NkVVN1BFdjBvbXlDcnVrUW4wQ2szQzBmdm01X2xxTVhvN2tNMFlLam91UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Rumors of Ethereum sell-off by 3 institutional giants gain traction - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) reached its yearly high of $2,310 per token on December 6. Amidst this surge, institutional giants deposited 19,822 ETH ($45.2 million) to cryptocurrency exchanges.\n\nNotably, Galaxy Digital, Celsius, and FTX have signaled their intention to sell a relevant part of their stacks. SpotOnChain gathered this data from known crypto wallet addresses of these giant institutional investors.\n\nMoreover, Celsius and FTX have been constantly selling Ethereum and other tokens in 2023. Both companies filed for bankruptcy during the cryptocurrency bear market, which demanded these liquidations.\n\nHowever, Galaxy Digital is still operational under Mike Novogratz’s leadership. Novogratz became known for his support of the collapsed Terra (LUNA) and a remarkable LUNA body tattoo.\n\nInstitutional Giants’ ETH activity\n\nGalaxy Digital made three separate transactions, depositing 9,179 ETH to Binance at an average rate of $2,278, resulting in $20.9 million moved. Despite this sizable transfer, Galaxy Digital’s wallets continue to hold 10,038 ETH, valued at approximately $22.8 million.\n\nGalaxy Digital on-chain portfolio. Source: SpotOnChain\n\nCelsius Network’s activity was also notable, as it transferred 7,500 ETH at $2,273 each to a Coinbase intermediate address identified as 0xc45, cumulating $17.05 million.\n\nSince November 14, Celsius has moved a total of 44,769 ETH, tallying up to $94.7 million. Of this total, 37,269 ETH have already reached platforms, including Coinbase, FalconX, and OKX, averaging a transfer price of $2,084, amounting to $77.6 million.\n\nFinally, FTX, shifting 3,143 ETH to Coinbase priced at $2,294 each, accounted for $7.21 million of the collective outflow. Cumulatively, FTX and associated entity Alameda Research have moved assets worth $573 million to exchanges since October 24, 2023, including 28,427 ETH with a value of $54.3 million.\n\nThese movements from key giant institutional investors to crypto exchanges may imply a readiness to sell. Essentially, this could potentially exert downward pressure on Ethereum‘s market value.\n\nInterestingly, the timing coinciding with Ethereum’s one-year high suggests that these institutions are seeking to capitalize on the recent price spike."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNYWpRYzNMWUpHU2JuN2V6cmprUllXa0E3bUdVX2l0cTdIWlpQbnhOajhBZ0hWdGwzckdFcXF2RG5LWTdIVTJjek44N1B1NzIzME9PeVM5emNGak5lcmdsQkRvSndvNktydmk0OGNWRmNQY1VLdTBmS2hsY053MTRzdFEwSnE2NDNwckdzejZRVFVjNDJ1WGlMQnBCUVZzTEphOUppRGJVYlF6d09ZN2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Brazil’s Biggest Bank Unleashes Crypto: Offers Bitcoin and Ethereum Trading to Millions - Blockonomi",
        "content": "Itaú Unibanco, the largest private bank in Brazil, has launched its crypto trading service to provide its clients with additional trading options, as reported by Reuters on December 4,\n\nGuto Antunes, Head of Digital Assets at Itaú, said that Bitcoin and Ethereum will be the initial offerings. The bank also plans to add more crypto assets in the future in compliance with the country’s regulatory requirements.\n\nKeypoints\n\nItaú Unibanco, Brazil’s largest private bank, has launched a crypto trading service for Bitcoin and Ethereum. More assets may be added later.\n\nAs a custodian, Itaú will hold and safekeep customers’ crypto assets. Customers can’t yet deposit/withdraw to external wallets.\n\nItaú has partnered with other major Brazilian banks on a central bank digital currency initiative called Drex.\n\nCrypto adoption is surging across Latin America, with Brazil as a top global crypto market. This is attracting companies like OKX to expand locally.\n\nBanks globally are exploring tokenization to improve efficiencies. JPMorgan’s JPM Coin processes $1 billion in bank transactions daily, with expectations to reach $10 billion soon.\n\nBrazil Is A Massive Crypto Market\n\nAs a custodian agency, Itaú Unibanco provides the holding and safekeeping of customers’ crypto assets, in addition to offering exposures to crypto trading. Antunes alternatively noted that customers can’t deposit and withdraw assets to an external wallet at the initial phase.\n\n“The most important thing is that when you keep your money in the bank account, you will have the guarantee of Itau’s balance sheet as security for the amounts invested,” Antunes added.\n\nItaú Unibanco has reportedly joined forces with other major institutions like BTG Pactual and Santander Brasil, to facilitate the national digital currency initiative Drex. Established in 2020 and officially launched in 2023, Drex is Brazilian central bank’s project to explore the feasibility of central bank digital currency (CBCD).\n\nOther banks in Brazil like BTG Pactual and Nubank previously introduced their trading platforms that allow customers to diversify their portfolio. Nubank now offers 14 crypto options on its Nubank Cripto platform. The bank had also issued its own token Nucoin to foster loyalty programs and streamline client’s access to digital assets.\n\nLike Nubank, BTG Pactual launched its crypto trading platform Mynt in late 2022. The bank initially focuses on Bitcoin and Ethereum with future plans to release additional options for customers.\n\nCrypto adoption is one of the largest trends in Latin America, with Brazil leading the wave. As a top global crypto market, the country has attracted a number of industry figures to expand their local operations, including OKX.\n\nIn November, the crypto firm announced the launch of its crypto exchange integrated with Web3 wallet with exclusive focus on the Brazilian market. There may be more developments coming from the market.\n\nBanks Gear Toward Tokenization\n\nTokenization has become a hot trend among financial and banking institutions. Tokenization can streamline various financial processes, such as payments, settlements, and trade finance.\n\nBanks can potentially reduce the need for intermediaries, minimize transaction times, and enhance overall operational efficiency. The transparency of blockchain technology also contributes to reducing fraud and errors.\n\nJPMorgan announced last week its bank-backed token JPM Coin would be ready for interbank transactions. The blockchain token recently debuted on Partior, a multi-bank system backed by JPMorgan, DBS Bank, Temasek and Standard Chartered. Partior aims to enable quick multi-currency transactions across its members.\n\nAlthough the Singapore-based project is already operational, details about its inner workings and usage numbers remain unclear. According to Ledger Insights, DBS Bank is active on the platform, but other banks have yet to adopt it.\n\nJPMorgan secured a major position, surpassing other US-based banks that still need permission to deploy this solution. This came after the bank received a no-objection letter from the US Office of the Comptroller of the Currency for Partior’s use case in May.\n\nThe inclusion of JPM Coin in Partior could potentially boost usage, given the scale and significance of JPMorgan’s blockchain token, which has a near-ubiquitous presence in banking markets. In October, Takis Georgakopoulos, JPMorgan’s Global Head of Payments, announced that the token was facilitating transactions worth $1 billion per day.\n\nIn November, Umar Farooq, JPMorgan’s Head of Global Financial Institutions Payments, expressed expectations of these numbers soaring. He claimed that the network could achieve $10 billion in daily transactions within the next year or two."
    }
]