[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE4yWmp5X2lnYnd0eUhmWGhYRGl5Q1lGc3RvcUlXcTBYR0VUSzFNTmZZWkFnRU1aTXNVc1ZBd1RhUkpYSlRLTF9LSWlvbkUyano0RTdpSUtHZkR4UTZzZXNjT2VVb1B2cHZxa1VOMmxfNTYteFhEN3fSAfcBQVVfeXFMTTdFLURGZjNPelpKSlV3QXg1c0pjZ1RUNGxFR1N2YXIyMTlWU0RLV24xTGh6U0d5ZHhjTWU4WGFVazNkZ3p6REFCYk5EZkNoSXRIaVpiUmFjWFNBc0RDNlBqQU85cllLZWh0YmFNYy1LQ0JtcHVOMndGaFBOYmRhMFRaRjJVR1UxT3M0ZXRMWmlLeE9adVFYRzZZcGY0SFd0TFVRV2lKemJLblhaTnkyWWhHQmRtYlhfbUxUSHRzX0U5U1RleFRUSTJOcUZubWlsWGdkc2ZZcXFNSm45X3EzZ1dQOGNXRTl2SXhaWHIxeENDU3B3aTRybw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Nov 2023 08:00:00 GMT",
        "title": "Here’s what ChatGPT expects from Ethereum for 2024 - AMBCrypto English",
        "content": "Disclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion.\n\nThe last seven days witnessed some significant developments amid the ongoing bull run.\n\nOn 15 November, asset management giant Blackrock’s spot Ethereum [ETH] exchange-traded fund (ETF) application officially made its way to the U.S. Securities and Exchange Commission’s (SEC) desk.\n\nThe same day, the SEC notified that it had delayed its decision to approve the rule change requested by Grayscale Investments to convert its Ethereum fund to Futures Ether ETF. The SEC now has until 1 January 2024 to make a decision. It was in September that the asset manager had filed for the change.\n\nThe anticipation around ETFs has certainly led to a wild price rally on the charts. It has, however, led many to question how far such developments could adversely affect the decentralized model of the underlying blockchain technology of the crypto market. This is the reason why AMBCrypto too has looked at what’s in the future for Ethereum.\n\nHow it began and subsequently split\n\nA child of Vitalik Buterin, the Ethereum blockchain network was first explored in a whitepaper in 2014. His colleagues on the project included Gavin Wood, Charles Hoskinson, Anthony Di Iorio, and Joseph Lubin.\n\nSubsequently, the team founded a Swiss non-profit foundation, the Ethereum Foundation (Stiftung Ethereum). The project was launched in 2015.\n\nEthereum was created with the goal of being scalable, programmable, secure, and decentralized. It natively supports smart contracts, a key component of decentralized apps. Smart contracts, in tandem with blockchain technology, enable a large number of decentralized finance (DeFi) applications.\n\nUsers can also generate and exchange non-fungible tokens (NFTs), which are tokens that can be linked to specific digital assets such as photos. Furthermore, several other cryptocurrencies use the ERC-20 token standard on top of the Ethereum blockchain and have used it for initial coin offerings.\n\nOnly a year after its launch, the project split into Ethereum and Ethereum Classic [ETC].\n\nWhat happened was that in 2016, a group of network participants gained majority control of the Ethereum blockchain to steal ether worth more than $50 million which had been raised for a project. Most of the Ethereum community opted to reverse the theft by invalidating the existing Ethereum blockchain and approving a blockchain with a revised history—Ethereum.\n\nHowever, a fraction of the community chose to maintain the original version of the Ethereum blockchain. The unaltered version of the blockchain permanently split to become Ethereum Classic.\n\nThe event came to be known as the Hard Fork.\n\nThe Merge and the Shapella\n\nEthereum initially employed the proof-of-work (PoW) consensus mechanism. It required energy-intensive computing referred to as mining to validate blocks.\n\nOwing to criticism around the mechanism’s environmental impact, the project transitioned to proof-of-stake (PoS) consensus mechanism in September 2022. The event came to be known as the Merge.\n\nIt is critical at this juncture that we understand what both these mechanisms are and how they differ.\n\nA consensus mechanism consists of the rules and protocols that govern how a blockchain network reaches an agreement on its state. The two most popular mechanisms are PoW and PoS.\n\nPoW requires the utilization of computational power by miners to solve challenging mathematical riddles and validate transactions. The first miner who solves the challenge receives fresh coins and transaction fees. Although it is though to be more secure and decentralized, it also uses a significant amount of energy and resources.\n\nInstead of requiring miners to solve problems, PoS requires validators to stake some of their coins as collateral. The network then chooses a validator at random to construct a new block depending on stake size and other parameters. The validator is compensated with transaction fees rather than fresh currencies.\n\nPoS is considered more scalable and energy-efficient than PoW.\n\nAt press time, a total of 28,195,445 ETH tokens were staked, valued at $55.6 billion.\n\nETH is the second-largest cryptocurrency in the world, with a market cap above $233 billion.\n\nA recent CoinGecko report put Ethereum as the top Layer-1 (L1) blockchain. Its total value locked (TVL) stood at $23.0 billion in October 2023.\n\nIn 2023, it reached its yearly peak TVL of $31.5 billion in April. This was shortly after the Merge.\n\nAt this point, we decided it’s a good time to solicit ChatGPT, the pioneering AI bot, for critical advice on these developments.\n\nChatGPT has proven to be valuable for traders and analysts. I spoke to ChatGPT about these development while touching a bit on ETH’s price.\n\nAt first, ChatGPT wasn’t able to provide any details. So I decided to educate and jailbreak it.\n\nWe then asked it about the impact of the Merge on Ethereum’s price.\n\nThe bot told me that the Merge catalyzed a surge in demand and confidence. Its response was not a departure from real-time data.\n\nIn April 2023, Ethereum’s Shanghai hard fork, also referred to as Shapella, got finalized. The upgrade allowed users to unstake their ETH tokens for the first time since December 2020.\n\nNotably, the Shapella is a combination of the Shanghai and Capella upgrade. The Shanghai upgrade takes place on the execution level, while Capella takes place on the consensus level.\n\nThe upgrade was the most significant development of the second-largest blockchain since the Merge.\n\nIs Ethereum a commodity or a security?\n\nSimilar to most cryptocurrencies, there has been a lot of debate over the fact whether Ethereum is a commodity or a security.\n\nIn a critical Uniswap court case, the judge ruled in August that ETH is a commodity. The SEC has shied away from doing so even if it hasn’t gone after ether like other tokens.\n\nRecently, Bloomberg analyst James Seyffart underlined the SEC’s unsaid stance over the issue.\n\nEven if SEC won’t explicitly claim ETH to be a commodity in the way that they do for Bitcoin. They have implicitly accepted its commodity status for years. Huge shoutout to @SGJohnsson who has been critical in forming some of my views on this topic. https://t.co/vLq2abeJNO — James Seyffart (@JSeyff) November 16, 2023\n\nHowever, we should also take note of any non-explicit classification so far. The stance of regulatory bodies has also evolved with years, with courts intervening time and again.\n\nI asked ChatGPT about Ethereum’s future performance\n\nEthereum has slowly emerged as one of the most prominent blockchain networks. As ideated, it supports a large number of L2 blockchains. The TVL of Ethereum-based L2 networks recently surged to an all-time high, surpassing $13.8 billion\n\n? The Total Value Locked (TVL) in all #Ethereum Layer 2 networks has surged to an all-time high, surpassing $13.8 billion. ? @Arbitrum takes the lead with TVL of $7.5 billion.https://t.co/5mn1kjq991 pic.twitter.com/Vr4GOgVPGX — GN Crypto ?? (@GNcrypto_news) November 16, 2023\n\nThanks to the recent bull run, ETH has been trading around the $2,000-mark for the past few days. At press time, ETH was exchanging hands at $1,986.50.\n\nWhile Ethereum’s Relative Strength Index (RSI) rested below the neutral 50-mark, its Money Flow Index (MFI) rested above it. It seemed that the bears and bulls are engaged in a tug of war in regard to ETH.\n\nWe then asked ChatGPT to predict Ethereum’s price towards the end of the first quarter in 2024.\n\nIt forecasted ETH’s price to git $7,000 by the end of Q1 2024. In essence, it expected ETH to surge more than 3x during the next five months — an extraordinary expectation, to be frank.\n\nNext, we asked it what it thinks of ETH’s price by the end of the next year.\n\nThe bot told me that it predicted ETH to reach $10,000 by the end of 2024. It expected the cryptocurrency to rise 5x over the next year.\n\nWhile it is a very high expectation, we shouldn’t outright dismiss it. We are yet to see the wider implications of the ETFs on the crypto market. It is quite possible it might lead to wider adoption, leading to a surge in token prices.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nConclusion\n\nFollowing the encounter with ChatGPT, I must admit that it may be a good idea to leverage its capabilities. As technology develops, so does its potential to revolutionize the cryptocurrency ecosystem.\n\nBesides, there has been a slow rate in the network growth of several crypto projects recently. But with ChatGPT available, crypto education and adoption could improve.\n\nMore importantly, you may want to take its “classic” response a little seriously.\n\nAs far as Ethereum’s price analysis and prediction are concerned, ChatGPT turned out to be a reliable ally. You only need to interact with it enough and it will guide you to the moon.\n\nWhile ChatGPT predicts ETH to hit the price of $10K by the end of 2024, its on-chart metrics don’t suggest a bull run."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNdzhyVGROUGtkbEZtVmdkTnJwcklsbHJfRHJUeVRNMGhfU3g3ejVBaFZZSWFtbWpGY0twVGs5bjlTZWp4Wk9KMFZBV2ZVU2h1emd4TVdzWTRlbzg5d0VEY002TUVhTE9HYzNLRktsRTZwVGh4UDEyLUktY1lsTFZOVGRMbWk0ZERLMF82MVZubzhkX1o4bzNVMm0tcXRzTmd6OEdhWVJlNDFSOHVfNGNYODRR0gG3AUFVX3lxTE5EZjFFaFFOWTFsZ3I4M3FZRzVFWVAyRUVpOElJMzMyUUVURFlRYWZDVDdqYUZTNEJteE1uRXJQdHRWYXhVXzBscFpvQjZZc19pT0NYb1ZQZnlsYnYtSVZkY0JqYS05QkpLRGhXSmgzZlZiYWlKRkdsTXBoQmJmUDV5LVNQdW5RRnlSQ1ViNFQ1R3hRWDVOeThtcGpZNDlpZTJvN2NqdTRPcHB6a2J6dzFzem9oQzAycw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Nov 2023 08:00:00 GMT",
        "title": "Ethereum price dilemma or buy signal before 60% rally - FXStreet",
        "content": "Ethereum price consolidates on the weekly chart inside an ascending triangle.\n\nA successful breakout from this setup forecasts a 43% upswing to $2,943.\n\nBut ETH could rally ahead and tag the MRI’s resistance level of $3,186.\n\nEthereum (ETH) price shows a tightening of the multi-month consolidation. A breakout from this sideways movement could trigger a volatile move to the upside.\n\nAlso read: Ethereum is a commodity, but SEC will not admit it, expert says amid ongoing ETF race\n\nEthereum price edges closer to breakout\n\nEthereum price has set up three higher lows and three roughly equal highs since June 2022. Connecting these swing points using trend lines, reveals an ascending triangle setup. A decisive weekly candlestick close above the triangle’s horizontal resistance level at $2,000 will signal a breakout.\n\nIn such a case, this technical formation forecasts a 43% rally to $2,943, obtained by measuring the distance between the first swing high and swing low to the breakout point of $2,000.\n\nCurrently, Ethereum price sits above the Momentum Reversal Indicator’s (MRI) resistance level of $1,936 and below the ascending triangle’s horizontal resistance level. From the looks of it, ETH seems to have flipped the $1,936 hurdle into a support floor.\n\nIf Bitcoin price does not crash wildly in the upcoming weeks, Ethereum price is set to break out and kickstart an upswing to $2,943. But this move is likely to face resistance around the $2,539 hurdle, which served as a critical support level in March 2022.\n\nWhile $2,943 is the theoretical target, ETH could rise higher and tag the next MRI resistance level of $3,186. This move would constitute a 60% gain.\n\nAlso read: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC unfazed as the SEC engages exchanges for spot ETFs\n\nETH/USDT 1-week chart\n\nOn the other hand, if Ethereum price fails to stay above the $1,936 support level, it could trigger a correction down to the $1,795 support floor, where buyers could give the breakout another go.\n\nBut if this attempt fails and Ethereum price produces a weekly candlestick close below $1,547, it will create a lower low and invalidate the bullish thesis. In such a case, ETH could slide as low as $1,309.\n\nAlso read: BlackRock’s spot Ethereum ETF filing fails to catalyze ETH price sustained rally"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQdEJ5R05UaFhTVG1VTE9XQTlWSU95SEFNOUstNU1NY2FWTmtlWnhwYk5ydFlvRFlZM2t0anN4UGVJYVZDQWVwdXN0TEVwUVIxSi1ub1VRMnNqY3YtdzdlUXhrWWc3S1Fhazh3UlhFeUtYZDRDZW1qOFpGalFfN0REMGszMi1CT0E5NkF3b1pfeUQ5Q0xzcU41cThiNkg5azhfRWNQVnpLNzhUQzBlS1F3dXlpSzFRYmRRa01RZzBfQ2Z4cm840gHKAUFVX3lxTE9ydzBjU3RNemxqbUYzU3hmQTdVaVYtM09uQU04N1E4Q19KQ0oxMWR4MldOSzg5czIxcjdzRThrbFU5RXdud18xa0U1QzJLTlRzUFRtYkFPWU80R3dlWGZXUXhTX0xsbU1UX2VRbXRqUlljdE0wY2FoTUxqM1hJVEdwNVFPdmRONTc3cTdVdWxuS294OWhpcDBWeWlBcEhmOHVpeFR4SjNheFBVMC1mWGcxXzdBenVrTzgxOEM5cXZ1N0Y4NjdENlU1X0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Nov 2023 08:00:00 GMT",
        "title": "Crypto Whales Sell Off Ethereum (ETH)-Based Altcoin Before Massive 40% Correction: On-Chain Data - The Daily Hodl",
        "content": "Crypto whales sold off millions of dollars worth of yearn.finance on Saturday prior to YFI sharply correcting by over 40%, according to on-chain data.\n\nSpotted by blockchain-tracking firm Lookonchain, one wallet deposited the better part of $5.8 million worth of YFI to crypto exchanges, likely to be sold off on the open market.\n\n“Why did YFI suddenly plummet more than 40%?\n\nWallet ‘0x48f9’ transferred 446 YFI ($5.8 million) out, most of which was deposited to exchanges…\n\nAnd a whale was very lucky and sold 96 YFI for 636 ETH ($1.23 million) at a price of $12,893 before YFI plummeted.”\n\nBased on Lookonchain’s chart, YFI dropped to a low of $8,971 as the whales unloaded their holdings. The native asset of the yield-farming protocol has since bounced and is trading for $9,408 at time of writing, up over 2% in the last 24 hours.\n\nLookonchain also spotted a wallet associated with the investment fund behind the decentralized exchange (DEX) aggregator 1inch (1INCH) selling the recent rallies in Uniswap to offload its UNI tokens for $2.13 million.\n\nAccording to Lookonchain, the 1Inch Investment Fund sold its UNI tokens at a loss,\n\n“The 1inch Team Investment Fund wallet sold all 416,924 UNI for 2.13 million USDC at a price of $5.11…\n\n1inch spent 2 million USDC to buy 299,849 UNI at $6.67 on Feb 10, then provided liquidity on Uniswap.\n\nIt seems 1inch dumped all UNI at a loss!”\n\nAt time of writing, UNI is trading for $5.09, nearly the same price as when the 1inch Investment Fund sold its holdings.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOZm5Yb1Vla3duWHRWazRfZU1pQ2hSNjRMVXo3VFI2N0Ztc1pWWTkzZzdjVWxNWUdWYnNEZzVxOUpSYXJSUm1JZl9PdnRfcm5UQ1l1VFlkSDFLbHM1Q0xEa0lMcy1nSjVqY05ITVgwVG55LV9ZTDk2OFBlNU4wdkNISXRjZFBwVGk30gGOAUFVX3lxTE9FVEY4QjZXMS1QNkpzNFI0d0IxWkNVTDZDUkRjbktqSnBETEl0YXpqYlJsdGxwbjljLTFzWXNVX1VYQ0hheW9xVUFXTWhkMUpGYXBNSTQya0h3aFM1OFg0TlRWNkJZYkE1V1Zqa3RpMUpIZ1NVdXNHSlJLbE5ySzQ3UkhKb2hVekFxc2RxZkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction As Health Retracement May Fuel a Rally to $2200 - CoinGape",
        "content": "Ethereum Price Prediction: The altcoins market is experiencing a phase of correction amid resistance faced by Bitcoin at the $38,000 level. Ethereum, the second-largest cryptocurrency by market capitalization, has not been exempt from this trend as It recently underwent a sharp reversal from the $2,136 mark. The coin price witnessed a 10.7% drop in its market value over the past week, bringing it to the current trading price of approximately $1,945. Will this correction be extended further?\n\nAlso Read: Bitcoin (BTC) Topples Ethereum in Transaction Fees After 3 Years\n\nadvertisement\n\nWill ETH Price Revist $1700?\n\nThe $1900 and $1830 are strong support amid the current correction.\n\nThe Ethereum price is prevented from a major downfall until the two trendlines are intact.\n\nThe intraday trading volume in Ether is $12.6 Billion, indicating a 16% gain.\n\nSource- Tradingview\n\nThe Ethereum price showed notable growth in October and early November, rising from $1,522 to a high of $2,137, marking a 41% increase. This bullish recovery was significant as it surged above the crucial daily Exponential Moving Averages (EMA) of 20, 50, 100, and 200, reflecting an early sign of trend reversal.\n\nHowever, after forming a local top at around $2,137, the coin entered a minor correction phase. Currently trading at $1,341, the buyers are trying to sustain above the 32.8% Fibonacci retracement level.\n\nUntil the price is still above the 50% retracement level($1830), the overall bullish trend may still be intact. If the ETH price sustains above the $1,830 mark, it could potentially rebound strongly, and continue its bullish trajectory to $2,240, which corresponds to the resistance level of a rising wedge pattern.\n\nA breakout above this barrier could signify a robust bullish trend ahead.\n\n1 ETH to USD = $2661.663 1.48% (24h) ETH btc\n\nbtc eth\n\neth xrp\n\nxrp bnb\n\nbnb sol\n\nsol ltc\n\nltc polygon\n\npolygon cardano\n\ncardano tron\n\ntron doge\n\ndoge WETH\n\nWETH LUNC\n\nLUNC XMR\n\nXMR LIRA\n\nLIRA BITS\n\nBITS IHINU\n\nIHINU SWEAT\n\nSWEAT PI\n\nPI SATS\n\nSATS ILV\n\nILV BDX\n\nBDX MCOIN USD USD\n\nUSD INR\n\nINR JPY\n\nJPY CNY\n\nCNY GBP\n\nGBP EUR\n\nIs ETH Poised for Further Correction?\n\nThe Ethereum price movement is currently confined within the converging trendlines of a wedge pattern, suggesting a potential for a slow yet steady recovery. However, as the price approaches the upper trendline of the wedge, there may be an increase in selling pressure, particularly around the $2200 mark. Historical trends indicate that retests of this upper trendline often lead to significant corrections, potentially driving the price down to the lower trendline of the wedge, which could mean a correction towards the $1,700 level.\n\nExponential Moving Average (EMA): The 20-day EMA is providing dynamic support to the declining Ethereum price.\n\nMoving Average Convergence Divergence (MACD): A bearish crossover between the MACD line and its signal line suggests a correction sentiment in the market.\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQYm84WVVXeTlfcDZ1T0FrRnVQYjQ0M0JVcUVqUkpUX3hwZW12aWdwQjhFd2dia1NuNlMtRHNNQzBVNi1MdjJwT1YtaGFIaWlveEl1Slg0UjFZTVJqeWlrbW1ZTkI1aUs4Ul83cHk0ZXBpUHpoVVMxZDk1N2xnSjJ5WNIBhgFBVV95cUxOd2pKVjdBUG1oeVAxYmJuTGhmQkVZVm1ZM2l4dDREOFRLRm5EM0xwZzFCSDBVNENuQU9UeGc0OTE0dTR5UDJYVFg5ZktwUWFPZXIxWW1IbWMtRU5nUGZ1ZlFaNTBVZkUwc0dFRXZCTU1lUjYxRjhqVmJ3cEU3WG5DRFdCX3VJUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Nov 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Bullish Whales Coming Back With Enormous Longs - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nA recent flurry of activity by ETH whales has injected both curiosity and anticipation into the market. According to on-chain analytics from Lookonchain, one such whale has repositioned their holdings in a notable manner, selling 12,048 ETH worth approximately $23.4 million to repay debt, after initially acquiring it from Binance when ETH was trading around $1,768​​.\n\nAdvertisement\n\nThis whale, along with others, has utilized ETH as collateral on DeFi lending platforms such as Aave and Compound to borrow stablecoins, with the intention of purchasing even more ETH. This suggests a strategic vote of confidence in ETH's price appreciation potential. Additionally, the withdrawal of a hefty sum of 21,076 ETH, valued at $41.23 million, from Bitfinex by two new wallets indicates a trend of whales moving their funds to cold storage for long-term holding. This behavior typically results in decreased liquidity on exchanges and can potentially buoy the market price​​.\n\nIn a significant transaction, the aforementioned whale placed 7,324 ETH, equating to $14.3 million, as collateral on Compound to borrow $9 million USDT, which was subsequently transferred to Binance. This sequence of transactions is likely aimed at purchasing additional ETH, thus expanding the whale's position in the currency. Such actions reflect a bullish outlook, with these major players positioning themselves to benefit from anticipated price increases and potentially exerting upward pressure on ETH's value​​.\n\nAdvertisement\n\nThe strategic moves by ETH whales underscore a sustained bullish sentiment and a long-term investment perspective. With ETH maintaining support above the $1,970 mark, these investors are seizing opportunities to accumulate more of the cryptocurrency. However, the market remains vigilant, as extensive selling by these whales could prompt a market pullback if they choose to realize profits."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOcGYwZzRXWjFVMkRLNl9EM0lHZmx6M0FMYUF2Y09QYnlWQVFHQ2xmQWFOMXRTaUFGVmZlakJiMFlHbmFjWVNpM1BrdmptQXdBVUhEVDVtNVBrUjBqNmttOXktUmpYOHF2ckVDZGNRQWV4TjU4eUVFNTViOFJiMFFRX0pzUTlNX2xSQ0xycDYxYzQ5am5EanNQcg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "3 Things You Should Know Before Staking Crypto For Passive Income - The Motley Fool",
        "content": "Yes, crypto staking is a form of passive income, but it's not as low-risk as you might think.\n\nWhile crypto staking has existed for years, it really only became mainstream with investors during the past year. This coincided with the transformation of Ethereum (ETH 1.78%) into a proof-of-stake blockchain as part of The Merge. Suddenly, people began asking what crypto staking was, and how they could make money from it. As a result, crypto staking went from something only the early blockchain and crypto pioneers were doing to something the average investor on Main Street was doing.\n\nWhat makes crypto staking so unique is that it is both a technical process that involves the inner workings of a blockchain, and a form of financial investment. At times, this duality can be confusing for investors, who may only be thinking of crypto staking as a form of passive income. With that in mind, here are three things to keep in mind before staking your crypto.\n\nA flawed analogy?\n\nThe classic analogy is that crypto staking is much like depositing your funds in a high-yield savings account. You are depositing your cryptocurrency with a blockchain, much like depositing your dollars with a bank. And, in exchange for doing so, you are paid a specified reward rate, usually expressed in terms of an annual percentage yield (APY). For most cryptos, these APYs range from 2% to 10%. For example, on Coinbase Global (COIN 7.69%), you can currently earn 3.35% on your Ethereum holdings.\n\nBut this analogy has several flaws. For one, blockchains are not banks. That means your deposit is not guaranteed by anyone, and certainly not by the Federal Deposit Insurance Corporation. That helps to explain why APYs for some cryptos can be as high as 45% -- think of this as a risk premium for depositing your funds with a potentially unreliable blockchain counterparty.\n\nMoreover, when you stake your crypto, you are paid rewards in the form of the cryptocurrency you deposited, and not in dollars. Thus, when you compare APYs, you need to be thinking in terms of how much crypto your investment is yielding, and not how many dollars it is yielding.\n\nFinally, keep in mind that staking usually requires you to \"lock up\" your crypto for a specified period of time, during which you will not have access to it. This might not seem like a big deal at first, especially if you are a long-term investor, but what if your crypto starts to lose value while it's locked up? When you get your crypto back at the end of the staking period, it may have lost significant value. The math here can be brutal. If your crypto loses even 10% of its value over a 12-month period, and you are earning a 5% APY, it's hard to see how you're going to make a profit on this investment.\n\nDifferent types of staking\n\nConfusing matters further is that there are different types of staking.​​ One form of staking requires you to operate a node on the blockchain network and use your own computer hardware to validate transactions on the blockchain. But this is neither easy nor passive. If you want to become a validator on the Ethereum blockchain, for example, you need to make a minimum investment of 32 ETH (worth almost $64,000 at today's prices) and have the suitable tech hardware to run a blockchain node 24/7.\n\nThat's not what most people are talking about when they talk about crypto staking as a form of passive income. Instead, they are usually talking about staking crypto via a cryptocurrency exchange such as Coinbase. This process is much easier -- it usually only requires a few clicks online, and you're ready to go. As long as you already own the cryptocurrency you want to stake, you just tell the crypto exchange how much you want to stake and for how long, and everything else is done for you.\n\nFor more advanced investors, there's also a form of staking your crypto without the need for a cryptocurrency exchange at all. Instead, you hold funds in your own blockchain wallet and use a third-party staking service. Typically called liquid staking, this process can reduce some of the risks of staking, since you can pull out your crypto at any time. Moreover, the staking rewards can be a bit higher, because there is no intermediary (like a crypto exchange) taking a cut of your rewards.\n\nRegulatory concerns\n\nFinally, there's the pesky little matter of the Securities and Exchange Commission, which has decided that there's something about crypto staking that it does not like. In February, it went after cryptocurrency exchange Kraken for offering staking services to customers. Then, in June, it went after Coinbase. So there's currently a bit of uncertainty about the future of crypto staking.\n\nThe good news, if you want to call it that, is that the SEC is not so much opposed to the concept of staking, as it is to the way staking is pitched to retail investors. If you read the official SEC statement about Kraken, this becomes clear. For example, the SEC said that Kraken did not do a good enough job of explaining potential risks to customers.\n\nCaveat emptor\n\nThat's why I made a big deal about the flawed analogy to a high-yield bank savings account. If you are thinking about crypto staking as just crypto's version of a savings account, then it's easy to see how you might be in for a rude surprise. Unlike with a savings account, you can actually lose money on your staked crypto. So, certainly, before you get involved with crypto staking, make sure you do your due diligence and understand the risks."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1aZFRSM3VicXV0ZlkzeXRvbWx6b1VfZV9NVVdUOEVOekc4UkRkcV9RckRvU2czLXVDRmNNdFQ4N2ltbkxXQ0ktMHlueWZmTHowbERkSzk3MmJkSlNIMkZObXhXUGFfdmpqYks2cXoyQ1A5R2wwTVpVWEhyRk8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "What are forks and how to track them - DLNews",
        "content": "Spend enough time reading about crypto and DeFi and you’ll come across forks, a pretty enigmatic term for those who don’t spend their days digging through Github repositories.\n\nBut fear not — forks are easy to understand.\n\nForking refers to any time a developer copies open-source code and uses it as the base for a new, separate project. In DeFi this most often takes the form of copying the code for an existing protocol and deploying it again, sometimes on a different blockchain, and often with small but significant changes.\n\nSome of the largest DeFi protocols are forks. In 2020, Sushiswap, a fork of decentralised exchange Uniswap, reached a total value locked of over $8 billion at its peak as it challenged the dominance of the protocol whose code it had copied. Uniswap had a TVL of around $10 billion at the time.\n\nBut forking isn’t limited to DeFi protocols. The blockchains that an entire DeFi ecosystem is built on can also be forked.\n\nThe term is also used to describe any time blockchain developers agree to implement an update. When updating, developers must create a fork, as most blockchains cannot be updated without doing so.\n\nAs we’ll explore later, forks can be contentious, and some have created great schisms within blockchain communities.\n\nBut first, let’s explore how to use DeFiLlama to track DeFi protocol forks.\n\nJoin the community to get our latest stories and updates\n\nHow to track forks on DefiLlama\n\nTo navigate to Forks dashboard, click on the DeFi tab on the left of the DefiLlama home page then click on the forks subsection.\n\nAt the top of the dashboard are two charts showing the popularity of different forks. Uniswap v2 is currently the most-forked protocol, accounting for almost 35% of all the forks DefiLlama tracks.\n\nUniswap v2, Compound v2, and Aave v3 are the three most commonly forked DeFi protocols. (DefiLlama)\n\nLower down you’ll find a list of 88 different DeFi protocols and all the forks that use their code.\n\nThe list includes three columns. This first shows the number of forks of a protocol, the second shows the total value locked — or TVL — in that protocol, and the third shows the TVL of all forks of that protocol relative to its own.\n\nThe greater this figure is, the more successful the spinoffs are that used the original protocol’s code.\n\nDefiLlama's list of protocols with active forks. (DefiLlama)\n\nTake Solidly for example, an exchange protocol whose forks have amassed a TVL 105,511% that of the original. Solidly’s launch was marred by bugs, and so bad was its reception that its creator, Andre Cronje, quit the project just three weeks after launch.\n\nBut other developers eyed opportunity where Cronje gave up, and forked the protocol into more successful projects, like Velodrome.\n\nMany forks are near identical copies of existing protocols, just deployed on a different blockchain. However, some use the existing protocol as a starting block to build something completely new.\n\nFor example, Frax Swap is a fork of Uniswap v2, but it is just one part of the larger Frax protocol that also includes an Ether liquid staking protocol and an algorithmic stablecoin.\n\nForking blockchains\n\nForking doesn’t just apply to the code behind DeFi protocols. As blockchains are also just lines of code on computers, they too can be forked.\n\nThe most common reason to fork a blockchain is to implement an upgrade. Blockchains have no centralised point of control, so everyone running nodes on the network must agree to switch to the upgraded version of the blockchain and leave the old one behind. This is sometimes referred to as a blockchain’s social consensus.\n\nEthereum’s Shapella upgrade in April 2023 is a recent example of a blockchain fork. The update changed Ethereum’s underlying code to allow users to withdraw staked Ether from the blockchain’s staking contract.\n\nHowever, while everyone running Ethereum nodes agreed on the Shapella fork and switched over to the new network, this doesn’t always happen.\n\nIn 2016, an incident known as the DAO hack ruptured the Ethereum network, causing it to split into two blockchains: Ethereum and Ethereum Classic.\n\nA hacker stole $60 million worth of Ether — about 14% of all Ether in circulation at that time — from The DAO, an early decentralised autonomous organisation that intended to act as an investor-directed venture capital firm.\n\nAfter much debate, a majority of Ethereum stakeholders chose to fork the blockchain, effectively rolling back Ethereum’s history to before the hack. This rolled back version is the main version of Ethereum used today.\n\nHowever, the decision was controversial — blockchains are meant to be immutable. Those who disagreed with the decision to roll back Ethereum continued to support the original blockchain, which is now known as Ethereum Classic.\n\nEthereum Classic is not the only forked blockchain. Bitcoin also has several forked versions that are still active, including Bitcoin Cash, Bitcoin Satoshi Vision, and Litecoin.\n\nNext steps\n\nRead more about Sushiswap’s vampire attack on incumbent decentralised exchange Uniswap.\n\nExplore the reasons Bitcoin’s many forked networks came into being."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNS2ZwaXBGclZNWkFqSkdhdXV4SWszTHdzUzJzYnBvSVh6NF8ySWluVm5oZ0RHS2lyelF0UXpUWm1XVVNTTmxUd01xUlM2MTl4U2dMcXpyLVZjLVdlNmhhT054UWRLZWoxNlllQUNEa3hvYlhLWS0wQWpKSzk2eHVQWDRtdE9Md9IBiwFBVV95cUxOdVdaVlYxMXltNXJNdWVRMFE1UEt3NkJ5WmtfYS1iWS1YLXlOR3pXeTRFOXNJY1VMa0lHNmdKOWVqRldOVXVBb3Q2QjNxY2pvaFJ0cXlabm55MDRHOUIxeEpuczlyNzljNFlVaEJBYVVaUkJTYXM4eEs3a1o0WkQxcnVxNUtQcy1zcVBB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Breaking: Fidelity Investments Files for Ethereum Spot ETF - CoinGape",
        "content": "American investment management firm Fidelity Investments has applied to list its Ethereum spot Exchange Traded Fund (ETF) product with the Securities and Exchange Commission (SEC). With this filing, Fidelity Investments now ranks as the 7th asset manager making a move for the product in the United States.\n\nOther asset managers that have filed to list Ethereum spot ETFs include VanEck, Ark Invest and 21Shares, Hashdex and Nasdaq, Grayscale, Invesco and Galaxy Digital, and BlackRock respectively.\n\nadvertisement\n\nThe Fidelity Ethereum ETF\n\nPer Form 19b-4 lodged with the SEC, the Fidelity Ethereum ETF is dubbed the “Fidelity Ethereum Fund” and is billed to track the performance of Ethereum. The firm said the ETF, if approved, will trade in compliance with the BZX Rule.\n\nThe filing positions Fidelity Investments at the forefront of the crypto ETF revolution, noting that this move is designed to truly safeguard the interest of investors in the United States.\n\n“To this point, approval of a Spot ETH ETP would represent a major win for the protection of U.S. investors in the crypto asset space,” Fidelity said in its filing.\n\nFidelity Investments used the Ethereum ETF to expand the general argument proponents of related products have put forth hinting at the fact that the absence of a regulated avenue to embrace crypto predisposes investors in an undue way.\n\nFidelity Investments is confident in securing approval as it cited an excerpt from the ruling in the Grayscale versus SEC legal brawl. With the SEC denying Grayscale’s request to convert its renowned Bitcoin Trust into a full-fledged Bitcoin Exchange Traded Fund product, the court ruled that the SEC has no basis for the denial as futures tied to BTC had already been approved.\n\nThe verdict ordered a review of the SEC decision and recent reports confirmed that the SEC and Grayscale and in consultation about the product.\n\nFidelity Investments Boosting the ETF Approval Sentiment\n\nFidelity Investments is a big name when it comes to institutional embrace of crypto. The firm is among the top firms with hopes to gain approval for its spot Bitcoin ETF product filed back in June.\n\nAfter the filing, the ETF, dubbed the “Wise Origin Bitcoin Trust” has also been updated to address crucial concerns gleaned from feedback from the markets regulator. With Fidelity’s influence in the market, as it boasts about $4.5 trillion in Assets Under Management (AUM) and ample resources, many believe its application will be sanctioned by the SEC.\n\nBlackRock also holds this influence and the presence of both firms has contributed to projections that the approval odds for a spot Bitcoin ETF by January now sitting at 90%\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]