[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiT0FVX3lxTE9WZVFlcVFJVWZ6NGVPSjREYTdXTFFQQ3kteGN3S1JKdWZvNnhodXk4WGQ0YmhMRi02cmRYek91OFBKWkg0R1UxcVdXeUVHUXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "What Is Ethereum (ETH)? - The Motley Fool",
        "content": "Ethereum is a blockchain supported by a decentralized network of computers all over the world. Established in 2015, Ethereum introduced the idea of smart contracts, which are bits of code written into the blockchain that can support various types of applications or even new cryptocurrencies. The native token of Ethereum is ether (ETH 1.09%), which is used to pay for certain activities on the network. Read on to learn what Ethereum is, what you can do with the Ethereum technology, whether ether is a good investment, and the difference between Ethereum and Bitcoin (BTC 1.98%).\n\nImage source: Getty Images.\n\nWhat is Ethereum? What is Ethereum? The basic idea of Ethereum is that it’s a platform that can execute and verify application code without the need for a central authority. It does this through an implementation of blockchain technology run across a decentralized network. Blockchain is a concept used to secure data on a network. Basically, it ensures nobody changes the data on the network without authorization from the majority of people using it. A decentralized network means there’s no single point of authority, like a corporation or government, that can make changes to the data on the network. Ethereum uses a proof-of-stake model to secure the blockchain. Network members must stake Ethereum’s native cryptocurrency, ether, to verify blocks written to the Ethereum blockchain. Ether is also used to pay for work done on the blockchain. Some merchants and service providers will accept ether as payment.\n\nWhat can it do? What can Ethereum do? Ethereum and the concepts pioneered in its development form the backbone of many advancements in blockchain technology. Using smart contracts, which are bits of code written to the blockchain, has allowed people to build all sorts of applications, including: Stablecoins. A stablecoin is a cryptocurrency that maintains its value relative to a fiat currency like the U.S. dollar. There are several mechanisms you can use to maintain that value that smart contracts can enforce.\n\nA stablecoin is a cryptocurrency that maintains its value relative to a fiat currency like the U.S. dollar. There are several mechanisms you can use to maintain that value that smart contracts can enforce. Lending applications. You can write a smart contract that enforces the terms of a loan -- interest rate, term, how the loan is paid back, etc. This can make it easier for people to get a loan and for individuals to loan money directly and collect more interest.\n\nYou can write a smart contract that enforces the terms of a loan -- interest rate, term, how the loan is paid back, etc. This can make it easier for people to get a loan and for individuals to loan money directly and collect more interest. Decentralized exchanges. You can directly exchange one token built on Ethereum for any other Ethereum-based token with minimal fees.\n\nYou can directly exchange one token built on Ethereum for any other Ethereum-based token with minimal fees. Non-fungible tokens (NFTs). You can create a unique token that can’t be replicated, called a non-fungible token, or NFT. The token can represent anything from a piece of art or a deed to a house. There are dozens of other ways to apply smart contracts and blockchain technology. Is it a good investment? Is Ethereum a good investment? If you’re interested in investing in cryptocurrencies, Ethereum’s native currency, ether, is a good choice. Ethereum is the clear market leader in blockchain applications. Most new developments in decentralized finance or other uses for blockchain are built on the Ethereum network. That inherently gives ether value since it’s needed to keep the network running and verifying the blockchain as well as paying for transactions on the blockchain. The shift to a proof-of-stake system from a proof-of-work system makes it more sustainable from an energy-use perspective. That opens the door for it to make advancements in processing speed, which can make smart contracts more broadly applicable. Ethereum has strong staying power (in the crypto world), so it’s much more unlikely to provide the boom-or-bust results of other smaller currencies.\n\nRelated investing topics\n\nEthereum vs. Bitcoin Ethereum vs. Bitcoin Ether and Bitcoin are the two largest cryptocurrencies by market capitalization. The currencies have a lot in common, but Ethereum builds on the underlying blockchain technology pioneered by Bitcoin’s creator. The idea behind Bitcoin was to create a permissionless, decentralized digital currency. Its creator wanted a way to make payments that weren’t backed by a central government or agency. As a result, Bitcoin is used as a store of value and a medium of exchange. Ethereum had a much broader idea. The blockchain is used for all sorts of decentralized applications. While ether is used to pay for transactions on the blockchain, you can also have other cryptocurrencies built on top of the Ethereum blockchain. Ethereum and Bitcoin also use different protocols to secure their blockchains. Bitcoin uses a proof-of-work system. Under this system, every computer on the network is working to solve a complex math problem to write the next block to the blockchain. Once a computer solves the problem, the other members of the network verify the solution (which takes much less work), and a new block attaches to the chain. Ethereum used the same system until September 2022. It now uses a proof-of-stake system that requires network members to hold ether to validate the next block in the blockchain. Validators are financially incentivized to verify correct data because they risk losing their stake if they’re a bad actor. Transaction speeds are usually faster on the Ethereum network. Transaction costs can vary more widely on Ethereum based on how many people are actively trying to write new data to the blockchain, i.e., transaction volume. Both have their use cases where they excel, and either ether or Bitcoin could be a viable investment choice for someone interested in buying and holding crypto."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPTUhYbXI3UHFMYW8wOV9RVjZDQnZTcXRXR0xXaERnenR1UWdWRXF4cjdoZ0J4YkFuVmFHMEN2V2lidTloajVaVUtYdDhWMldtQ1NZdk5QU0pBRkM4Zk1aMnVGV2JKN3AwUlUtWjJNejcteUFlM0s0NjlST1lvVnR6N0ZablTSAYoBQVVfeXFMTmZWanM3TExhRGFXYjNnZ3Fyd2FOMERSeFlmdEhWTlpuZnRYMkZka1I3c2ZETEtjSW01MWxXa3J5VGk2V2hJNVlCLWtBOWt5WEdMMlZSU28xN0tiSVgxSXRFY2pKOE8xMGloNl9aMnBIeFRiOVdSTG80QUlaMWlmNjFTLWdjcEpaTEtB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "What Ethereum’s future holds as whales make a splash - AMBCrypto English",
        "content": "Ethereum whales held around 38% of the total supply at press time.\n\nETH’s supply has continued to decline.\n\nThroughout the year, Ethereum [ETH] whales have consistently made strategic moves, and recent reports indicated a noteworthy increase in their holdings.\n\nEthereum whales gather more supply\n\nAccording to IntoTheBlock, the percentage of Ethereum supply held by large investors, known as whales, has increased over the year. The data showed a growth from 32% in January to around 35%.\n\nFurther examination of whale holdings on Santiment also showed an increase.\n\nInitial observations of the chart showed a clear upward trend in the past few months. In August, the percentage of whale holdings stood at about 34%, but as of this writing, it was over 38%.\n\nAn important question thus arises: How has this surge in holdings affected the overall supply of Ethereum on exchanges?\n\nEthereum: Supply on Exchanges continues to decline\n\nThe Ethereum supply on exchanges has exhibited minimal fluctuation in the recent period. However, it has shown a significant decrease over the last six months.\n\nChart analysis showed a decline of nearly 1 million units between August and the present. As of this writing, the exchange supply was around 10.51 million.\n\nConnecting the dots between the trends in exchange supply and the holdings of Ethereum whales, one might infer that the accumulation by large investors has influenced the overall supply.\n\nThe reduction in supply on exchanges implied a decrease in liquidity, which could exert a positive influence on the price trend.\n\nETH uptrend comes to a halt\n\nAMBCrypto’s examination of Ethereum’s daily price trend showed a consistent accumulation by whales across various price ranges. Preceding this recent report, the chart indicated a continuous increase in the value of ETH over the past six days.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nThe uptrends resulted in around an 11% increase in value. However, at the time of this writing, there was a slight decline of almost 2%. Despite the decline, it has managed to maintain a stable price of around $2,200.\n\nIt’s noteworthy that if the percentage of supply held by these whales begins to diminish, it could signify capitulation. This is a crucial consideration, as a substantial release of volume onto exchanges might adversely impact the price trend."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQQ2daZnFFcE51dTh1VlRZWDJSdHVQZ0kwQmRPWDY0SG5TMmpwdkVuTHpnSU5heENVUFAzb2R4MTZrOEl4OW9TVExLZ3pBVlNjNmZ0SUNBOWJ0TkJXcDZFU3hodUdFZW0yT0dEemVCWHg5cUhxaFFtNGNJWjlhN0poUHFLcGRSUG1TQWp0Ti1SM2PSAZYBQVVfeXFMT3FUUElNNG1CbGdpbGZEcUF5cnlaUHpnbmM1M1hDbkpGb0dHZFQwY2FxaGl1VmdSN21xdGc4bW5Da1hXLVNyNUNaYzBqcm56dVNlc01qSDlaM1BEV1dsZ3oxbk5TVzMxTlhhS0otMXZES1BXWUs0Z3ZDZXhrcndrQWZWZ1RxTWVrZmRVclp4RWx3cmN6Q2hB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum's 'Censorship' Problem Is Getting Worse - CoinDesk",
        "content": "A turning point came last year when the U.S. government sanctioned Tornado Cash – a \"privacy mixing\" program on Ethereum that helped people transact without leaving a trace. The Treasury Department's Office of Foreign Assets Control (OFAC) said the program was used by terrorists and other U.S.-sanctioned entities, so it added Tornado's Ethereum-based computer code to the same blacklist as Iran, North Korea and Hamas. In response, some blockchain advocates were defiant; they balked at OFAC's attempt at \"censorship\" and gloated that Ethereum would be immune to it as a result of its decentralized construction."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5wVGJfdzRPVDFsdEpIVXRsbHM5bU5RMGlWczBOckxCOFBlUXBMem1TWjF5YlV3cmdiZmhUNVE3aEdFVkV2N1ZMT0o2TlNlUTBHQW5oZDlaUGdScUxqLVFUbHhuY2dJMkxKUnMzT0ItLUs2Z3lseHl3bVVpQXlKQdIBgwFBVV95cUxPdWV3djNoeklENkxEczBmT0tFUkZDZ19ScVZ4cXByMlB5a285enpVM3Z3clJ3Q3pmazhiSGQtWmplRUFhMU84LXFTeEdObll1SlY4NnN6Ri1xdXR6ajZXdmoyYm5VcU9tSjZ3NThpa1VXbE5uQ0J3UHE2ZzJWcnBHazh3RQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price to Surge Massively, Suggests This ETH Chart - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe ETH/BTC pair from Binance offers a glimpse into Ethereum's current market position – a position that, while seemingly bearish, may hold the seeds for a future rally against the digital gold that is about to enter a consolidation phase.\n\nAdvertisement\n\nThe chart presents a downtrend with Ethereum losing ground to Bitcoin, reflected by the downward slope of the 50-day (blue line) and 200-day (black line) moving averages. This suggests that, in the short to medium term, Ethereum has been underperforming compared to the original cryptocurrency, Bitcoin.\n\nThis underperformance can be linked to a subdued period for key Ethereum market drivers, such as decentralized finance (DeFi) and non-fungible tokens (NFTs). With these sectors facing a downturn, Ethereum's price has not had the catalysts that could propel it forward, especially in comparison to Bitcoin, which often acts as a \"safe haven\" within the crypto market during times of uncertainty.\n\nAdvertisement\n\nHowever, the development activity within Ethereum's ecosystem tells a different story. Despite the lack of immediate market drivers, the consistent work being done on the platform could be laying the groundwork for a strong rebound.\n\nFor traders, the ETH/BTC chart is a vital tool for tracking market sentiment and volatility. A declining ETH/BTC ratio could indicate a period of risk-off sentiment where investors flock to Bitcoin's relative safety. Conversely, a rising ratio might signal a risk-on environment where traders are more willing to bet on Ethereum's growth prospects, which might also hint at the potential surge of altcoins in general.\n\nGiven the current chart trends, investors and traders may look for signs of stabilization or reversal in the ETH/BTC ratio as indicators of Ethereum's resurgence. Such a turnaround could be precipitated by a revival in the DeFi and NFT markets or by new developments and upgrades within the network."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOYnQwVHpoYnB3M0NORzliUDhiVE44OW1lQjdsc3VwVFRUUWxXQ2JweGVoZno2dDVuck9sMXJtWTRmaGtaY1NyaXJCZExVWjNRWVF5cW5xYzBsZVFrOFNVam1oQmJRSF91b3k3VUFVeGc0NzJqUlhrUFBBS1lhd25MSDd2TTJJTGcwWjFENEZSQmY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Societe Generale becomes first bank giant to issue a stablecoin on Ethereum - Crypto Briefing",
        "content": "EURCV is an ERC20 token backed by and redeemable for fiat currency.\n\nShare this article\n\nSociete Generale FORGE, a subsidiary of the 159-year-old French banking group Societe Generale, is launching EUR CoinVertible (EURCV) a stablecoin tied to the Euro issued on the Ethereum blockchain, according to a new post by crypto exchange Bitstamp.\n\n📢 NEW! We're the first exchange to list $EURCV! EUR CoinVertible is Societe Generale-FORGE's innovative stablecoin, aiming for stability and safety in the volatile world of digital assets. 🌐 You can start trading it on Bitstamp today. Dive in for more details:… pic.twitter.com/Lt98ysjfeo — Bitstamp (@Bitstamp) December 6, 2023\n\nEURCV is an ERC20 token, designed to provide a low volatility cryptocurrency that maintains a stable value equivalent to the Euro. The stablecoin is backed by cash deposits and cash equivalents denominated in EUR.\n\nSociete Generale states that robust legal structures are in place to ensure the segregation and availability of reserve assets to token holders.\n\nCrypto exchange Bitstamp is opening order books for the EURCV/USDT and EURCV/EUR trading pairs. Flowdesk, a crypto market maker, has been selected to provide liquidity and active market-making for EURCV on Bitstamp and other exchanges.\n\n“We are thrilled to partner with SG-FORGE as a designated market maker, a pivotal role in realizing our shared vision of a tokenized financial future. Looking ahead as we approach 2024, we envision a transformative impact where compliant blockchain-based operations by institutions will drastically increase in volume,” said Guilhem Chaumont, CEO of Flowdesk.\n\nInitially, EURCV deposits and withdrawals will only be enabled for investors whitelisted by Societe Generale. The bank states that its existing KYC and AML compliance procedures will apply to onboarding digital token holders.\n\nWhile not the first Euro stablecoin, EURCV is the first to have the backing of a major regulated European bank. A state-owned bank in Brazil called the Brazilian National Social Development Bank issued a stablecoin backed 1-for-1 by the Brazilian real in 2018. Circle and Tether have also launched similar euro-pegged tokens aimed at retail investors.\n\nThe EURCV launch comes soon after Societe Generale’s first bond issuance on the public blockchain Ethereum. The €100 million digital green bond was fully subscribed to by institutional asset managers AXA and Generali."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOXzlFYk80Z2ZTR1BlbkhUdTl0aHMzN3lWbnJHUlpJYUY4bUtTdlFtSzZ6YTBsWjRSX3FGYXIzREJSbWQtVVZ5WDRvOVhlOUxBMnQ3M2FZUE1CUC16c3gtbVh4dUk3RkR5U0U5OG5PVXYzOGZPZVBiRWc0bnhhMkRabW12RkJaNGtVM3J3X3VjSXVGRjZfVXExRTZBc2RhcVF0QjRpMVVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin transaction fees surge, rivaling Ethereum daily gas fee totals - CryptoSlate",
        "content": "Quick Take\n\nBitcoin transaction fees have witnessed a significant uptick recently, echoing patterns seen last month during the Inscription frenzy.\n\nThis time, however, the catalyst appears to be an increase in transactions awaiting confirmation in the Bitcoin network’s mempool. The volume of coins in transactions held in the mempool reached 88,000 BTC.\n\nFurthermore, a detailed examination of transactions waiting in the mempool reveals that most fall under the 50+ sat/vByte fee cohort. High-priority transactions reach up to 337 sat/vByte, which converts to approximately $20.\n\nThis is paralleled by a surge in Bitcoin fees to roughly $12.5 million. This places Bitcoin fees hot on the heels of Ethereum, which currently tops the chart at $15 million.\n\nName 1 Day Fees 7 Day Avg. Fees Ethereum $15,005,897.28 $11,950,187.83 Bitcoin $12,573,926.34 $6,358,238.65\n\nSource: Cryptofees.info\n\nThis data reflects the intricate dynamics linking transaction volumes, waiting times, and fee structures in the Bitcoin network and their effect on overall transaction costs."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNZHRuOFpMclB6dlN5MzZHZ3U0QklBdGN0bmV3dzBvYl83VXFiaEhGeW9qWmFubHg0NXZic2Y5Qm9QMGNkbk9XcjRIczZuVkdPYjV1OVgweXhFRHVCSkptZnFPUHlfeGwwRDhaN0ZKdkxUOVkxUVBUWGItN3N4MDVVdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: After A 10% Surge, Experts Predict Bull Run For Eth - TronWeekly",
        "content": "In a notable development, the price of Ethereum (ETH) has experienced a substantial surge, surpassing the $2,250 resistance level. Experts are now anticipating a bullish trend for ETH, projecting a potential ascent towards the $2,500 mark.\n\nEthereum’s Positive Momentum Persists\n\nMaintaining its positive trajectory akin to Bitcoin, Ethereum has sustained its upward movement above the $2,120 threshold. The cryptocurrency extended its rally, breaching key resistance levels at $2,200 and $2,250, prompting a surge in activity from bullish investors and propelling the price beyond $2,300.\n\nAlthough a new multi-month high was established at approximately $2,316, the current market scenario sees a correction in gains. The price has dipped below the $2,300 level and is currently undergoing a test of the 23.6% Fibonacci retracement level, measured from the $2,188 swing low to the $2,316 high.\n\nNotably, Ethereum is presently trading above $2,250 and the 100-hourly Simple Moving Average. Additionally, an observable bullish trend line is taking shape, offering support around the $2,250 mark on the hourly chart of ETH/USD.\n\nEthereum Price Prediction: After A 10% Surge, Experts Predict Bull Run For Eth 3\n\nFacing resistance in the vicinity of the $2,320 zone, Ethereum’s immediate hurdle is the $2,350 level. A decisive breakthrough above this resistance could propel the price towards the $2,420 level, with subsequent resistances standing at $2,450. Further gains have the potential to trigger a surge towards the $2,500 level.\n\nHowever, should Ethereum encounter difficulty in surpassing the $2,320 resistance, a downside correction may ensue. Initial support on the downside is identified near the $2,265 level, followed by key support at $2,250 and the aforementioned bullish trend line. The latter coincides with the 50% Fibonacci retracement level of the recent upward move.\n\nIn the event of a more pronounced decline, Ethereum’s primary support lies around $2,200, corresponding to the 100-hourly Simple Moving Average. A breach below $2,200 raises the possibility of an extended decline, with the key support level at $2,120. Falling below this level could expose Ethereum to a potential move towards the $2,080 range in the near term."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPT25JMTRxLS0tV1FoSnR6SHFMZU9zTmhXSlRIaXN6cTNIUmVFb2xrd2hYMmhXekFjWXFKODREWHdKNnZiaW05ZC05XzNKSnRkSW9GUmIyOUpwWVF3Sklrb3ZfdUJpcnU2RXpvNWY3NGQ4Vy15LUtVZVl5RENhbkE3OEFxRHpWTnJ0cTA2dFpLZVpTYmNqc25SRzYzOVMzcXdaaHFBN1RwYjRPT25WcmdMaXZmaEFmc0hIcUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Virtual Machine Chain Inscriptions Gain Traction, Dominating Polygon Transactions - Unchained",
        "content": "While Bitcoin Ordinals are making headlines, inscriptions on Ethereum Virtual Machine blockchains have gained traction in recent weeks, according to a Dragonfly data analyst.\n\nWhile Bitcoin inscriptions continue to gain headlines and spur debates, inscriptions on Ethereum Virtual Machine (EVM) chains have gained traction in the past month, particularly on the Polygon network, according to an X thread from Hildobby, a data analyst at crypto-native venture capital firm Dragonfly.\n\nGas fees spent on inscriptions peaked at about $800,000 two weeks ago before retreating, but inscriptions have remained stronger on Polygon, representing 72% of overall transactions on the chain in the past week. Hildobby attributes much of this activity to the Polygon-focused inscription marketplace POLS Market.\n\n“Polygon seems to be where most inscriptions are thanks to @PolsMarket whose inscription “pols” has seen the most minters with ~100k addresses,” Hildobby wrote.\n\n1/ Inscriptions have gained traction on EVM chains over the past month, most notably on Polygon where they account for 20% of gas spent & 72% of transactions 📝 more below pic.twitter.com/1s78sUqyik — hildobby (@hildobby_) December 6, 2023\n\nInscriptions on EVM chains work by storing small amounts of metadata in the call data for a blockchain transaction. Similarly to Bitcoin Ordinals, EVM inscriptions essentially form smart contract-based non-fungible tokens (NFTs). And, like Ordinals, EVM inscriptions have raised concerns, including about whether the technology is scalable.\n\nBut Hildobby noted that he isn’t advocating for EVM chain inscriptions, tweeting, “FYI: Inscriptions go against every EVM design decisions, with gas costs being the only benefit, at the expense of indexing, non-compatibility, integration challenges.”"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxNM3c1RktxSVRpcjhMajNCS0kzNUNNOS1KdWdhNW93b1did2RmVmo5U1ZQTEhxSmwwemxjTlgxVThxS1djMmVnaEt4OHdGbm9GRVhMS1hINVd6eThlRG1tQ2UtMnBzVlR2NnV5cU1hY0hnbmlneXNZOHFUdVJOMl9iMTBld2x6N1dLTmphNjJ1VWdzeUNGOG16Vjl0Q3lQbml6NURmVW5HWVVtVkdoQVhabE9KbnZoVE9CMmZPUDF2UkJleld1V3V5QlBWM191MGU4eWdsWTJRMlJTOUZ5UGpTMHZXRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "'Family Guy's Latest Episode Shows Meg's Therapist Only Accepts Bitcoin, Ethereum, Dogecoin - Benzinga",
        "content": "The latest episode of ‘Family Guy', the animated sitcom, features a mention of Bitcoin BTC/USD, Ethereum ETH/USD, and Dogecoin DOGE/USD.\n\nWhat Happened: Season 22, episode 8 shows Meg Griffin receiving therapy, only to be told by her therapist that payment must be in either Bitcoin, Dogecoin, or Ethereum.\n\nThe episode portrays the therapist in a state of panic, both accepting and refusing Ethereum and urging immediate payment due to the volatile market with the line. “Not Ethereum—Wait, wait, no, I don’t… I don’t anymore. Wait… yes I do. But you have to send it right now. No, send it again. No. Why did you do that?”\n\nThe therapist also mocks cryptocurrency investing by saying, “Forget real estate. Invest in money you can’t even see.”\n\nWatch the full video here.\n\nSee More: Dogecoin HODLERs Are Beating Shiba Inu With 57% Landing In Profits, IntoTheBlock Data Reveals\n\nWhy It Matters: This isn’t the first time ‘Family Guy’ has brought up Bitcoin. A past episode showed Peter Griffin suggesting Bitcoin as a solution to their financial problems. Lois says, “Peter, every day our savings get smaller and smaller. We’ve really got to figure out a better way to budget for this family,” to which Peter responds with the word \"Bitcoins.\"\n\nThis comes as BTC, ETH, and DOGE surged on Tuesday evening, marking the first significant rally since early April 2022. This surge comes as falling interest rates and increasing expectations for introducing a spot Bitcoin ETF in the U.S. market.\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOYTJhcnA0czBrZ2ppdDlhdjVOR2pvLVlLZTVTNnN6UXhaMWRhRkNFX2s4bzNpeU95Z05YY21QQjBpcktCNHRvZHFtczdUaTNacGk2NGhSUGhuSV9uSFJXRDRxaEw3S0RReVppNkhrdk5CV3YyNHUzQklnS3ZDQ0dWZ09YYmQtelFISC1PN3FEeEJfblZyYzE3ekZlaXBqeFZPcDJqNnV6WEdueUlCaTNlUThuS0ljVHZQ0gG-AUFVX3lxTE1vb1pMMnBzWFVFYzE0MkJmZ3pidDlmMDV4VHNwZ1NsTFF2bTY1SUdzZHZZUEptYkwwMkxsVG5Zcm9aNVhGbS1Yd3E1OTZ0WnZ4dGN5T3BmSjlNYjNOZ2RtS3NVRGREaTBOWUVEcHc4anI5a25iZ3k3U29jblJmSk9Fc0laSE9VeVNSLVN2N2p4NVJqYUl0RWdPRE4xZ0JfME5lbm1NUkgxWVpTZnhkSk01c2gtNFZ4S3UxdWxsTkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Analyst Says Ethereum Rival Solana Primed To Go ‘Much Much Higher’ – But There’s a Catch - The Daily Hodl",
        "content": "A closely followed crypto analyst says that Ethereum (ETH) rival Solana (SOL) is gearing up to continue its rally to the upside.\n\nPseudonymous crypto strategist Altcoin Sherpa tells his 200,700 followers on the social media platform X that he believes the smart contract platform will go much higher in the future, however, he warns traders of an upcoming dip after FTX’s supply of SOL floods the market.\n\n“SOL: I still think that we go a bit lower. FTX supply coming here eventually and I think this move up is to bait some buyers. Would just be patient on Solana. Note: I think that this one is going to go much much higher in the future.”\n\nAccording to Altcoin Sherpa, investors should remain patient with Solana as the incoming cache of SOL tokens from bankrupt crypto exchange FTX will add to its supply. However, the trader notes that during the last month, SOL has been consolidating.\n\n“Although I think that you should still stay a bit patient given FTX supply is coming onto the market sometime (who knows when), Solana has also consolidated for a month in an overall macro healthy BTC (Bitcoin) upswing. In my opinion, this means you should at least be exposed now if you want in on this one.\n\nRecommend you do a swing trade on this one and have entries from here all the way down to sub-$50. It also works great as an investment too, where you just hold this for six months+ and let it ride. High percentage chance it’s decently higher later.”\n\nSolana is trading for $66.36 at time of writing, a 4.7% increase during the last day and an increase of over 550% from its price of $9.97 at the start of 2023.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Sergey Nivens/WhiteBarbie"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQQ3NoazFEMFp5N1JDNjY5Rm1OOWdkYkh0ZUVEek5CVjZpeDB4UDJVRHgwWE0xNVh1ZVVZV1c2SlBIT2tfUXA1MEpsYzVWbGdGN3JGNjBQSmxwb3UxQXBfWWRQcG92TjF6aVMyd1JWZHVVRDBFcmJ1ZTRLd0NVSDg0V2xDT1JwMkVYbmtkVy1hcWFENUVl0gGcAUFVX3lxTFBOWENVeTZSMmR6RGplTzBFOFRsdXJKQ08wSnMzQjZqREtWODdPbmJ0N1BudTM0TXREZUdZZjNWVkpqc0NNTlI3eV8zOF82bGdHUndHQ0N4M1pDdDY4ZVBfM1dNWXpKWE00UDd3RU9WSlVjVXJvTGRtbVZPWjdmc3N3MExOcFF0NHh0cmwwMVhCX2xXZ2I0czZmaEhJaA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "FaZe Clan Founder Banks Says Ethereum Is 'Large Percentage' of His Net Worth - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt’s no secret that prominent gaming influencer FaZe Banks loves crypto. Now, he’s buying more.\n\nRichard \"FaZe Banks\" Bengtson is the CEO and co-founder of esports organization and lifestyle brand FaZe Clan. The gamer took to Instagram this week to report his latest crypto purchases and double down on his pro-crypto stance amidst a broader gaming industry where crypto remains a controversial topic.\n\n“Don’t be my typical normie homie and call me asking for plays a year from now when the mainstream media and your mom [are] talking about crypto again,” Banks urged his 2.8 million Instagram followers Tuesday along with a note of Ethereum’s price reaching $2,300, a yearly high.\n\n“Expose yourself now,” Banks continued in a post evangelizing crypto and arguing that potential buyers should look at Bitcoin, Ethereum, and Solana.\n\nAD\n\nAD\n\n“BTC is the safest, ETH is about as safe with slightly more upside in my opinion. My personal favorite. A large percentage of my net worth is in Ethereum,” Banks wrote, adding that in his view, Solana is the “riskiest” of the three cryptocurrencies.\n\n“My money is definitely where my mouth is on this one. Buy it and leave it alone. Chill,” he added.\n\nLike many financial assets and purchases, though, it’s important to note that buying or trading cryptocurrencies comes with risk—and fans should be careful not to take financial advice from influencers or celebrities they follow online. It's often not clear what an influencers motivations may be in promoting a cryptocurrency, NFT project, or any financial asset.\n\nBanks also claimed that he recently spent $200,000 on four altcoins: Prime, Pepe, Mog, and Clouds, the last of which has not yet been officially released.\n\nAD\n\nAD\n\nPrime is the sci-fi NFT card game Parallel’s official token, Pepe is a frog-inspired meme coin which recently rose to a $666 million market cap, and Mog is a meme coin that’s been swirling on Twitter among fans who have paired it with memes of people and animals wearing a specific pair of colorfully-tinted glasses. Clouds is an upcoming token from the Endless Clouds crypto startup that is developing the Treeverse gaming platform.\n\n“These are the first real plays I’ve made since the big market crash,” Banks said, who over the summer also hopped onto the “SocialFi” trend and made over $70,000 by signing up for Friend.tech.\n\nBanks did not immediately respond to Decrypt’s request for comment on his latest crypto purchases.\n\nIt’s worth noting that FaZe Clan’s newly-appointed CEO has been in crypto for years now. Back in 2021, Banks was accused of allegedly pumping and dumping an altcoin he promoted, BankSocial.\n\nAnd a quick glimpse at a wallet connected to Banks called “Banksfucks” currently holds some NFTs from Azuki’s collections, two Bored Apes, four Mutant Ape NFTs, a staggering 72 Otherdeed NFTs for Yuga Labs’ Otherside metaverse game, two Clone X NFTs, and one Doodles NFT, among others. He has also recently boasted of CryptoPunks holdings.\n\nWhile Banks is a crypto and NFT enthusiast, not everyone in FaZe Clan shares this view. The org’s only current female member, Kalei Renay, previously told Decrypt in an interview at TwitchCon that she isn’t a fan of NFTs.\n\n“As a community, everybody hates NFTs,” FaZe Kalei said of gamers. “It’s your money, do whatever, but I don’t care for NFTs. I don’t do crypto, I don’t do any of that. I stay so far away from it.”\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNc0YyZWtjLXNSWC02Uk1KM1BobEdWSGV3VDJQdGlzNEZNdWJuUHRJaWRvS1dGNnUxWDZhcm9GQjlWRE9fcjFLbUR0OGVPdVllY2VTYUo5VEVZQXdGWlY1UUxlQmhDR1NFeEdfZ1FxVzhyQXZpRUNVVlVxOURZZUlrZ1lqN29uQdIBiwFBVV95cUxPaU4zQUx1bC1NNXc2aEVERkx0UlZDbkhCXzM3dzY4XzRPTldDb3BZMWd1akNFWExTWnc3UWpJMDBUXzB3a1hyb1NhTjZmdTdibDQwYS1aQnpOS0NFT3JydXVxdFZFdl9mZHMyTmVxRHl2VnNpYWU2TFFhZHd5cjMtMnJ0WUhiUkI3a2xF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum decouples from Bitcoin: Examining the causes - AMBCrypto English",
        "content": "The decoupling was most likely due to an increase in spot ETH ETF launches.\n\nA lower BTC-ETH correlation made a case for portfolio diversification.\n\nBitcoin’s [BTC] correlation with Ethereum [ETH] dropped to multi-year lows, signaling a major divergence in the growth trajectories of the two blue-chip cryptocurrencies.\n\nBased on a 60-day rolling window, the correlation dipped to 75% in November, according to crypto market data provider Kaiko. This was a marked departure from the all-time highs (ATH) of 97% seen during the end of 2022.\n\nEthereum weakens its relationship with Bitcoin\n\nAMBCrypto spotted a vertical drop in the relationship since November. While there was no telling evidence, the decoupling seemed to be caused by an increase in spot ETH exchange-traded fund (ETF) launches.\n\nThe broader market bullishness was led by excitement over likely approvals of a dozen-odd spot Bitcoin ETF applications. This led to the start of the mid-October rally and by the time the month ended, BTC had accumulated gains of 26%.\n\nHowever, ETH was slow to match this pace, finishing October with 17% gains.\n\nHowever, the announcement of spot ETH ETFs by TradFi giants such as BlackRock and Fidelity turned it around for ETH in November. The second-largest crypto bounced above the crucial barrier of $2,000 for the first time since May 2022.\n\nTo put it simply, ETH reacted more to developments in its own ecosystem rather than a trickle-down effect.\n\nIt is important to understand that both assets function very differently from each other.\n\nNotably, Ethereum is used as a platform for the development of decentralized applications (dApps) and smart contracts. Meanwhile, Bitcoin is primarily used as a store of value and a means of payment.\n\nWhat is the takeaway for investors?\n\nAs per a 21 April report by Coinbase, the lower BTC-ETH correlation makes a case for portfolio diversification, as holding both assets can result in higher returns.\n\nSmart investors spread their investments across different cryptos, reducing their exposure to any one category.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nAs for institutional investors, the trend could impact their trading strategies like cross-hedging. For the curious, cross-hedging is a practice of managing risk by investing in two assets that have similar price movements but are not perfectly correlated.\n\nHaving said that, traders and investors should not take these as investment advice, and instead perform their due diligence."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQTTFaQ09KNHN3RGNRYld4VkRKZHYzemszUWt6dHZWQmM3SjFidlpMWlFldlhrakgtMURSVndzQmNhRl9YNXNGZVR2ZFctbVlyX00yeTA1ZGFFNjRlSGVMMmRIRlFHREV6VFRxVFRpMHVlZmtWMjZKQjQwQ09yNTAtZm8zZGdfcXY0dlBCNVBlZmpSbXhpS1VJ0gGcAUFVX3lxTFBKTDBUd1B1Y25jbkpXS0w1c1NFelJxTGN6U3pTdm5CejdxNTM1NDBmN0hzT2JHcTRQRnB0UDA3WlR5S1p3Vk00ZWxrT3AxY2xMMFNxOEFrZVJTOU5CN0ItT0ZESUNiQ01KdHBJal9SeHVBT2FGZnhTSHZuNFMyZ1Z1YmFGYjB2SEJzYkVHclZaTmdZcTRTOVZDc00xVw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum: Veteran Trader Peter Brandt Presents Three Narratives for ETH Price - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nVeteran trader Peter Brandt comments on Ethereum price action as the market embarks on a fresh crypto rally.\n\nAdvertisement\n\nBitcoin, the largest cryptocurrency by market capitalization, surged to $44,000 for the first time since April 2022. Ethereum, the coin linked to the Ethereum blockchain network, also soared in response to the bullish impulse, touching highs of $2,312 in today's trading session.\n\nIn a new tweet, Brandt asks his 705,100 followers if Ethereum will emerge from the shadows anytime soon. He says that at least three narratives are possible, about which he launched a poll for his followers to participate in.\n\nVisual for reference pic.twitter.com/16YP1sZMQL — Peter Brandt (@PeterLBrandt) December 6, 2023\n\nBrandt's three narratives include a classic wedge that targets the $900 price for ETH. The second narrative is a running wedge pattern, which, if verified, has a price target of $3,300.\n\nAdvertisement\n\nThe famed trader's third narrative is \"Morphology ahead,\" which could imply that the Ethereum price action is still brewing and in the process of taking a particular form or structure. Brandt provides a visual representation of these price patterns.\n\nThe first option, the classic wedge, received 24% of votes in favor. The amount of 60.7% of respondents voted for the more likely option of a running wedge with a target of $3,300 given the current market standing. A total of 15.3% of the respondents voted for the 'Morphology ahead' option.\n\nTypically, a wedge pattern can indicate either bullish or bearish price reversals. A rising wedge (which indicates a bearish reversal) or a descending wedge (which indicates a bullish reversal) are the two types of wedge patterns.\n\nAt the time of writing, ETH had gained 2.16% in the previous 24 hours and was trading at $2,264.\n\nIn ETF-related news, the Securities and Exchange Commission (SEC) has announced that it will take more than 45 days to review a rule change that would allow Grayscale to transform its Ethereum trust into an Ethereum spot ETF. The new deadline has been set for Jan. 25, 2024."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNRjcxc0NTT2FTQjhKUzFFdkRPbzdzU3ZLN1hMWkJVekpPZHp2dFZwbW16YTFqYkNEWW9NMU5rQlZHa3ladzFFaVkxbWw3Mlk2dmxnOFNjZEJZaDJ1Y0JBbUp5X19KRW1hZ0dGOExqMHhjZHFDX3FCcHJaeTd1d2ZSTXp6blRxVGpnVVd3SklyUlBKYWNWRmgyTFIwb2Rpa0Q0ckQxcFBBRUMwWlBMV1ctczFjVVBDRFZoakZ2LUZIZEh2QXVLZTZRbkJ2OElpZ3ZYRlHSAdcBQVVfeXFMT1ZHeFhaay1PeG9aQ1R4aHlHV0tUSnVhSHp0dklUV0EwYXV0XzlCd19FbDNCSmxVR0I0aE9ILVZyYm8ybWM5cHJ1Um1DckNBU01rTVJONlFUWFdoQ0Rxd0lreEdWOVZlVDRKN1NuNk5Ma0VfMy1MdGpfUEZaOTJ0cHlzYTVCemF1RE94RlJDTVNQZjVzYl9WZnh1QzdJRUJWR3dPeDFFRVB2VmdxNjFTU2J3bnVIbTE4d1FBeXdEOGVadXdGY1VBU3FjNHhxYnZ1UXVsQ190WTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Galaxy-Backed Gyroscope's 'All-Weather' Decentralized Stablecoin Goes Live on Ethereum Mainnet - CoinDesk",
        "content": "Stablecoins, in spite of their name, have been known to veer from their price anchors. In March, Circle's USDC , the second-largest stablecoin, temporarily depegged due to the collapse of banking partner Silicon Valley Bank (SVB). This in turn led Maker's DAI to drop, as a large part of that stablecoin's reserve assets were in USDC. Last year, the dramatic collapse of Terra's algorithmic stablecoin UST marked the beginning of the crypto winter. Overall, large-cap fiat-backed stablecoins de-pegged from their price anchor more than 600 times this year, according to a Moody's Analytics report from early November."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1iQmtQalotc2g0SGlua0s5TE1LSUFxSmlWSWpoSmN5QXNTZ3VoeXU2LUlBMGdFNWJGa2R3eHh5VDBYLXhGdm5sN2lhVHB2R1dLc1dZVHNhYmhOQzVSQkVJLVA2dDYtRkE0VUVUSmVhdmRjLXA3WDZKaXJXVG4wOTTSAYQBQVVfeXFMUEFkMXVva19sdndqb3IxN2JLUlZrcVVKMUNUSHpnbkZyZElWODBqSWRKUC1VY09DdUJCZkJacXVvTUwzdGlhbGlXeTNxR01sR0I3S0RWbFNhWjB4OHIyN1hyUWpzUmpJN0hYejUtSUNDaVJLTjh3Q1p2V052ZHBjQmFySHlh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Will Ethereum’s price prediction piggyback on Bitcoin’s rise? - AMBCrypto English",
        "content": "Ethereum’s price saw an 18-month high at press time.\n\nWith the recent price uptick, ETH’s price has become more prone to fluctuations.\n\nSharing a statistically significant correlation with the leading coin Bitcoin [BTC], whose price has rallied above $40,000, Ethereum’s [ETH] price has climbed to an 18-month high.\n\nOn the 4th of December, BTC briefly traded above the $42,000 price mark for the first time since April 2022.\n\nThis positive sentiment undoubtedly spilled over into the ETH market, as the altcoin exchanged hands at a high of $2,250 on the same day, a price level it last recorded in May 2022.\n\nNew highs, new troubles\n\nApart from its price rally, ETH’s Open Interest has also risen significantly in the past few days. By the 4th of December, this had grown to over $4.5 billion, representing its highest level since February 2023.\n\nRising Open Interest alongside rising prices suggested that new money was coming into the market, fueling the bullish momentum. This signaled that the upward trend was likely to continue.\n\nHowever, with price volatility making a gradual comeback, the rally might be short-lived, as traders increasingly occupied leveraged positions.\n\nETH’s Bollinger Bands indicator (BB), assessed on a daily chart, confirmed the possibility of significant price swings soon. At press time, the altcoin’s price traded above the upper band of this indicator.\n\nLikewise, the gap between the upper and lower bands of the BB indicator has widened consistently since the 30th of November.\n\nA gradual widening of these bands typically indicated an increase in market volatility. The coin’s Bollinger Bandwidth, which has grown since then, confirmed the rising volatility.\n\nDue to the recent price surge, ETH’s estimated leverage ratio has risen. This indicated that, at press time, traders were borrowing more money to trade the leading crypto asset.\n\nETH’s climbing leverage ratio is often seen as a bullish signal. Notably, it suggests that traders are confident that the coin’s price will continue to rise.\n\nHowever, it is also risky, as traders with high leverage are more vulnerable to liquidations if the market moves against them.\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nAMBCrypto found that ETH’s funding rates have been only positive since the October rally, meaning that traders have continuously opened trade positions in expectation of a price rally.\n\nHowever, with the market approaching an overheated region, a drawback might result in the liquidation of some of these positions."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQTEFzVlBFaFo3VlJPT2IxSTdkS1JXRFRnNXFLeHdkR2U4WkZLT0NwWFFQLTg0SFFSMVN2SDczTUp1SnU3OGE1dWw1VDExOHRuM2FBX1pFajBuTGR5Ri1ESThyLUpibEhMNHdLSE14UEJEWVY5cHl1MlFKc2ZjQzlGVlFsaFRha1B2UnNsb0VDMWJBZ0l0R3pmMXk0eS1HUjh0SHBaSFU2WXFjWmhqSElMd2dPRUJaQU5GOEHSAb8BQVVfeXFMTTlXT1UxRnlZZ2ljaElSTEZId3ctZVRMcS1rbEM4eGl2Yk9xM09KTDhtVTlmWXJBUmpKVGp2dnJMY1hxbVVrV3RaeGlDTWxFMVBweWhPM1pMS3lCT2FnUjFkNkJ0T0VETzgxX1RDRXE4Mm1zQmRyd3JfWXZLcVk0bjd1ZjZlLXFDM190Yml3Z1FTV2g3V2ZBcEpJd0NBRnhrTENITzJpbWpvcXFCY1I5dVMyOXN6c193RW1rQXJxaW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Societe Generale-Backed Euro Stablecoin EURCV Starts Trading on Bitstamp - CoinDesk",
        "content": "The listing on Luxembourg-based Bitstamp extends its access to retail traders and marks the first occasion a euro stablecoin issued by a fully regulated bank is available on a cryptocurrency exchange. The stablecoin market is dominated by crypto-native firms like Tether, developer of developers of USDT, and Circle, with USDC, both of which are pegged to the U.S. dollar."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNSFhrWEZLeHpQd19ZMTJsempDajByOUgtVGxzU0RJeUNnZDdsMG9aUmdCc2NQV0pHcEowbkpiNVhhc25LN0VxNXpvdmw4SllnRGp1V2N6My15dXhwUjlNUHJ5anVRcl94bTFGY1N0b0RnQTVnN0RFN2pib2dieVhUdXp1dTl0ajVSRU8zWNIBkgFBVV95cUxQY3RSeWwzNzRpUjNTenhNakFPNmYzZTRvMU05cG1SM0lDeWVFMjFxbXBycGc0VE5LZ2UyZHJNTzhKNWFxQXlTaTVtNGNxTzB5NzQ0STRQYjNpaUhCcWc0UUQwWFV4SXFqc2hWcERCSWFQbE1xNmdIVlF0NF96RXVHU1BXY1Y2T0lNX2IzdFJwTGZTZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Experiences a Massive Surge in Gas Fees: Here’s Why - CryptoPotato",
        "content": "Ethereum median gas price has surged to 55.3 Gwei this month, almost doubling in a month and reaching its highest point since mid-May this year.\n\nEthereum is trading at 2,230, up 10% over the last week and 81.3% over the last year, remaining the second most popular crypto after Bitcoin.\n\nEthereum Gas Fees Increase\n\nAs revealed by an analysis on Dune, Ethereum gas fees have surged over the last month. In October 2023, Ethereum experienced a notable reduction in gas fees, reaching a new low. The decline was attributed to decreased activity in decentralized finance (DeFi), non-fungible tokens (NFTs), and various Telegram bots.\n\nMajor gas spenders, including industry giants like Binance and Coinbase and Layer-2 networks such as Arbitrum, Optimism, and Base, reduced their spending by 30% in mid-October.\n\nHowever, on December 1, the introduction of the Buterin Cards NFT collection triggered a 13% increase in gas fees on the Ethereum network. Transactions associated with this collection accumulated fees totaling 318.31 ETH in the past 24 hours, equivalent to $665,670.\n\nNotably, within three hours, transactions linked to the Buterin Cards NFT project contributed to over 13% of the total Ethereum network gas fees, surpassing fees from the Uniswap universal router address and Tether’s public address, according to data from Etherscan.\n\nEthereum Gas Fees Have Been Fluctuating\n\nA substantial decrease in Ethereum gas fees occurred following the network’s transition to a proof-of-stake (PoS) consensus mechanism implemented through Ethereum 2.0.\n\nIt shifted away from the energy-intensive proof-of-work (PoW) model, introducing staking and resulting in a noteworthy 99.9% reduction in energy consumption.\n\nEthereum’s gas fees have consistently mirrored the demand on the network throughout its history. Notably, during the Initial Coin Offering (ICO) boom in 2017 and the decentralized finance (DeFi) explosion in 2020, Ethereum experienced unprecedented congestion. The heightened demand during these periods resulted in a significant surge in gas fees, forcing users to pay sometimes exorbitant amounts to guarantee fast processing of their transactions."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOM3NXTWZHNmVNbGtOYXE3aXpuYkdxQlRIN2ZpeWVBdlhxRVBHWjlITWdWOFI3emJkVnpjclA3c1RPVXB2WTlSeU1hSEVNVWFpWlpVMzZ0N0trS1AzSm04cXRBd1VINE9SOVo3UEdTNDZtNkFLWjlUTHd6T3BGMTBuSmktTG5QY3U2TVEwb3puNlp0UjZhbkxpRVhXR0dOZ3k5a0RXZ3RGSTE0eWpXNFFQVmpmc0UyUXNkRlN2U0xR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "OKX Ventures Joins Ethereum Climate Platform As a Launch Partner to Advance Sustainability in Web3 - OKX",
        "content": "SINGAPORE, December 6, 2023 -- OKX Ventures, the investment arm of leading crypto exchange and Web3 technology company OKX , today announced that it has joined the Ethereum Climate Platform (ECP) as a launch partner, underscoring its commitment to sustainability and decarbonization in the Web3 ecosystem.\n\nThe ECP is an innovative platform created after the transformative Ethereum Merge, leveraging the best of Web3 and traditional climate finance, technology, structures, and services. The platform is designed to galvanize climate solutions with Web3 innovation and address Ethereum's carbon emissions since its launch in 2015.\n\nOKX Ventures, with the support of the OKX Web3 team, joined a coalition of companies dedicated to expediting decarbonization and amplifying climate action through the deployment of cutting-edge technology and the cultivation of digital environmental assets. These are instrumental in reducing greenhouse gas emissions and fostering enduring environmental and societal benefits. OKX’s rigorous approach to “proof of reserves” demonstrates a commitment to the unique properties of blockchains as a tool to track and validate critical metrics, a principle that is also essential for effective climate investment.\n\nFacilitated by Consensys and climate tech firm Allinfra, other launch partners of the ECP include industry leaders like Microsoft, Polygon and NEAR Foundation.\n\nOKX Ventures Partner Jeff Ren said: \"As an active member of The Nature Conservancy, I'm thrilled that the OKX Ventures and OKX Web3 teams are collaborating with the Ethereum Climate Platform. This partnership underscores our shared commitment to integrating social responsibility and environmental stewardship into Web3 systems globally. We embrace this opportunity and responsibility to pioneer sustainable blockchain innovation to create lasting value for both people and the planet.\"\n\nECP Executive Director Anna Lerner said: \"Through this partnership, the OKX Ventures and Web3 teams are demonstrating their leadership in sustainable innovation across Web3. Its partnership with the Ethereum Climate Platform and support of Gitcoin demonstrate a dedication to ESG principles, open-source collaboration and community support. This partnership also signals a new era of eco-conscious blockchain advancement.\"\n\nOKX Ventures' participation in the ECP sets a new standard for environmentally conscious blockchain advancement in the Web3 space. It is also an important step toward its vision of an open, equitable and sustainable future of Web3."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQNlFEY1RIb2RodnNFaTVHZmJVM1hNR29GVGYzQVpDZGdiY0V5RER0amhyYWFuTTBOM1kzTVVBSWZFSnlUUDd1QXlYdTAwYVBJSVcxNUZNLUtwVVVPeEtIU0ZzRXZPWERJZElBeFFERUY0cTdYOVBMR00zQkxYOV96VXpEdk5BNUM0LTYtRlJuZDJtUnR3QnNjLXh1a0ZzOWI0MTJadjFKVUNmRjRwMW1HSE9UMVNGUS1nZWRJYnBiZTJVSWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Etherium Price Forecast – What Will Happen to the Price of Ethereum in the Long Term? - Dubai Chronicle",
        "content": "ETHERIUM is one of the most valuable cryptocurrencies on the market, but its price can fluctuate drastically based on demand and supply; other cryptocurrencies’ prices, as well as events happening within the crypto ecosystem may all play a part.\n\nEven with these factors in play, investors still have reason for optimism in Ethereum. Some analysts predict that it could even return to its former heights over time; although this might take longer due to regulatory hurdles. Meanwhile, however, the Ethereum team has been hard at work improving the platform and creating new features; as well as making great strides forward with smart contracts — which should become key selling points of this coin in future.\n\nMany individuals and big companies alike are becoming interested in cryptocurrency technology, with JPMorgan Chase & Co embracing blockchain as evidenced by its creation of its own token on Ethereum blockchain for instantaneous bank-to-bank transactions. This shows an interest among more large firms to embrace it.\n\nNumerous projects rely on Ethereum blockchain, so as the price of Ethereum increases it will have a ripple-through effect to other projects built upon it. This phenomenon is known as the Ethereum effect and it can help attract investors by stimulating other projects built on this cryptocurrency. Furthermore, the Ethereum foundation is working on innovations which make blockchain technology safer and accessible to more users.\n\nAs more and more people utilize the Ethereum blockchain, its popularity will only continue to increase. Its promise as a platform for building decentralized applications is undeniable; furthermore, the Ethereum team are constantly improving the functionality of this decentralized ledger which should have an overall positive effect on ether prices over time.\n\nEven with these positive trends, investors should remain mindful of cryptocurrencies’ risks before engaging. It is wise to conduct your own research prior to investing and never commit more money than you can afford to lose.\n\nLong term, most experts hold an optimistic view on Ethereum prices. They anticipate its value increasing to $2500 by the end o 2023 and $4000 by 2030 and $5000 by 2032 due to its solid foundation, established reputation, and planned updates; furthermore it stands an excellent chance of becoming a triple point asset: store of value, payment vehicle and form of wealth creation."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOX1J2MkpHSXcyb1hxZzNqWDBTbXdsMTZUOU9QTktIb0xsQmFtUnMwY2c1OEV3QXBRZVQtXzlUVmp2MFVKa19JWjg0QUxaRVUyWnZEVHlIVl9mOTJXaVJZZEcwVkhkSW1TQ3ptZjRHWjFNaU5YTW5VNGxKbkpPenZ3WW9pOUlaWHFhNkR5c1g1aXNiUzZuYUdyUk9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Dogecoin (DOGE), Ethereum (ETH), and Pullix (PLX), Which Has The Best Utility? - CryptoPotato",
        "content": "The crypto market is heating up as altcoins are taking turns to pump. Dogecoin (DOGE), Ethereum (ETH), and Pullix (PLX) are currently being discussed as the next big cryptocurrencies to experience a surge in value. While the former two have been around for a while, Pullix is a new player set to change the trading game. But which among these three alts has the best utility for investors and traders?\n\nPLX Token: Integrating Utility with Pullix’s Trading Innovation\n\nPullix is building a decentralized trading exchange that promises to tackle the common issues experienced by traders, such as high fees, lack of transparency, and slow transaction speeds. The platform will utilize blockchain technology to provide all traders with a secure and decentralized environment.\n\nBlockchain technology enables Pullix to have a transparent and auditable trading system, eliminating the need for middlemen and reducing transaction fees. It also allows users to trade anonymously across all markets, providing traders maximum security and privacy.\n\nPullix directly links its native cryptocurrency to the trading platform’s performance and offers tangible benefits to its users. For example, PLX token holders receive regular passive income payments, access to exclusive rewards, and other benefits depending on the staked amount.\n\nThe token burn mechanism for Pullix’s PLX token aims to stabilize and potentially increase the token’s value. This is achieved by allocating a portion of the platform’s daily profits to purchase and permanently remove (burn) 50% of these tokens from circulation, thereby reducing the total supply.\n\nThe remaining 50% rewards users for staking their PLX, incentivizing long-term holding and active participation in the Pullix ecosystem. This deflationary approach is designed to align the platform’s interests with those of its users and investors.\n\nThis innovative approach makes the PLX token not just a medium of exchange but a key player in the Pullix ecosystem. As Pullix’s trading platform gains popularity, the value of PLX is expected to increase, making it an attractive investment for traders.\n\nAnd with Pullix at the start of its journey, investors can get in early and reap the benefits as the platform gains momentum. Someare already recognizing this opportunity and snapping up PLX tokens for $0.04 before the price rises in subsequent stages.\n\nEthereum (ETH): The Backbone of Decentralized Applications\n\nEthereum (ETH) has surged from $1,500 to $2,245 in under a month as investors continue to show confidence in the second-largest cryptocurrency. The $2,100 price mark has acted as resistance since May 2022, and traders expect a huge pump once this level is breached.\n\nEthereum is the cryptocurrency with the most utility in the market. It is not only a store of value but also the foundation for various decentralized applications (DApps). There are lending platforms, games, and even decentralized exchanges built on the Ethereum blockchain.\n\nEthereum faces competition from the likes of Solana and Radix, which offer lower fees and faster speeds. The upcoming EIP-4844 procotol upgrade is expected to solve the scalability issue, helping Ethereum maintain its dominance as the number one platform for DApps.\n\nInstitutional investors are now taking notice of Ethereum, with spot Ethereum ETF applications sent to the SEC for approval. Should these be approved, we could see an influx of institutional funds into the market, leading Ethereum to the coveted $10,000 price point.\n\nDogecoin (DOGE)’s Potential New Use Case\n\nDogecoin (DOGE) took the crypto world by storm in early 2021 as Elon Musk — the world’s richest man — tweeted favorably about the memecoin. While Dogecoin has no real utility, it has a strong community, making it a popular choice for sending low-cost transactions.\n\nHowever, Dogecoin may soon have another use case — as an accepted currency on X (Twitter) for tipping. Elon Musk still has the Dogecoin logo in his Twitter bio and hinted that this integration could be coming soon.\n\nAstrobotic’s Peregrine Mission One is set to carry a physical Dogecoin token to the moon, marking a symbolic journey for Dogecoin. This move could garner more attention from mainstream media and potentially lead to retail investors flocking to buy Dogecoin as FOMO sets in.\n\nThe Dogecoin chart shows that there have been numerous attempts to break the $0.10 – $0.11 resistance area. A successful close above this level can open up room for further upsides, potentially seeing Dogecoin reach $0.20 during Q1 of 2024.\n\nFor more information about Pullix, visit the links below:\n\nSite: https://pullix.io/\n\nTwitter: https://x.com/pullixmarkets\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNRkJjM1puVFRKLW5kOXpRa205YWlCUFliQkVIUGlMbXFHbm91VmVNQWJFbFVabFdSQTkzTTNsam5pOG1mZlBMXzhOYzBSSmtZQzMxajZ5MGQ1ZXpvdGxJTS1BU1pHQVhrb3FYMmttU1kycWp1MjUyRWJTcURXLTlJNUloMF81R0VtcjhiNzkwdUE3emFHOUhudUdqeno5TzB1YWVjQW1CMEpIb2xBV0tiSXJDZEVJSGxyUjd0TV82bkMwNXplWms5TTk4NmFJQTBhQ0NB0gHYAUFVX3lxTE9sMGhvUk1sN3hiYnpvbG1LamRVQkozOC1VUFY1QjBnZWJjbS1va0laSldFa01tM3UyQ0hjUmdVLWZGQjQ3eUpkWnEyaEkzLS0wN0FrdXhQYWpMRGlmTzdDMUcxWTMzUm9tcUJGVVRCZzBuVkgxelVEMzhCRFVNVV9oN19MVnFDdVNQYTM1V2RfdVJxOVpyUFluQ2p4S3RmQWRYS0ZZdjFiNTd4ZnZ1RGhwRVlzc1FaVWI2V0t2VGZrVEhxcWRaaHY1ZG9uVlU4aU1LUnhpdmtnTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "‘Don’t Rule Out a $25,000 Liquidity Sweep’ – Trader Predicts Massive Correction for Bitcoin if History Repeats - The Daily Hodl",
        "content": "Widely followed crypto analyst Justin Bennett is issuing a warning about Bitcoin (BTC) amid the flagship crypto asset’s massive 2023 rally.\n\nNoting that Bitcoin capitulated twice around each of its last two halving cycles – in 2015 and 2016 and then in 2019 and 2020 – Bennett says that a correction of around 43% from its current level should not be ruled out.\n\nBased on Bennett’s chart, he is suggesting that Bitcoin could reach up to around $50,000 before reversing course.\n\n“It’s been a hell of a run from BTC, and it may very well continue without a significant correction in the short term.\n\nBut the last two bear markets ended with a second capitulation.\n\nWill this time be different?\n\nMaybe, but don’t rule out a $25,000 liquidity sweep.”\n\nBitcoin is trading at $44,146 at time of writing while its next halving cycle is slated for April 2024.\n\nBennett says he’s still not convinced that the crypto markets are in a bullish phase. According to the crypto analyst, there are several reasons for his lack of conviction.\n\n“Fact is, the macro landscape is VERY different this time than the start of any other crypto bull market.\n\nNot to mention the big-name stocks that have driven this recent push are trading at steep long-term premiums vs. discounts as with other cycle starts.”\n\nIn the case of Ethereum (ETH), Bennett says that he sees no reason to abandon his bearish thesis for the second-largest crypto asset by market cap. In his bearish scenario, Bennett projects ETH could fall by around 67% from its current level.\n\nEthereum is trading at $2,267 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxQMEE4a0VLQVNZWEQyLUUwY1R6dTdpai1wSXJwdGVZSkxEdG1TUUJqVzU5Zm1PZlk4aHFYdDhYamJ1ZWlHR3lSMkR2QW1mY0dILV8taEhPdWEyNFFHYzFjNVAtQlZCeGQtR0tIc2REYnNNOUhvQTN5WXNZUUlCOG5FMlFtSlMwZTRjTVhNQ3dadmJ5R3RodHBBRy1TU3hWdXlaUmg5UDZtR2JfNU1zMWQzQkNlMUdNYnRhX1ZBX1NtZktHRWQtRlphaTlyclJZalBsczIyWWdtVkU4NnpzczBuLUw4Ny1FenQ1QUFuNlpJRHpqT1Q1ZWhhYktn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "OKX Ventures Joins Ethereum Climate Platform As a Launch Partner to Advance Sustainability in Web3 - Thailand Business News",
        "content": "SINGAPORE, Dec. 6, 2023 /PRNewswire/ — OKX Ventures, the investment arm of leading crypto exchange and Web3 technology company OKX , today announced that it has joined the Ethereum Climate Platform (ECP) as a launch partner, underscoring its commitment to sustainability and decarbonization in the Web3 ecosystem.\n\nThe ECP is an innovative platform created after the transformative Ethereum Merge, leveraging the best of Web3 and traditional climate finance, technology, structures, and services. The platform is designed to galvanize climate solutions with Web3 innovation and address Ethereum’s carbon emissions since its launch in 2015.\n\nOKX Ventures, with the support of the OKX Web3 team, joined a coalition of companies dedicated to expediting decarbonization and amplifying climate action through the deployment of cutting-edge technology and the cultivation of digital environmental assets. These are instrumental in reducing greenhouse gas emissions and fostering enduring environmental and societal benefits. OKX’s rigorous approach to “proof of reserves” demonstrates a commitment to the unique properties of blockchains as a tool to track and validate critical metrics, a principle that is also essential for effective climate investment.\n\nFacilitated by Consensys and climate tech firm Allinfra, other launch partners of the ECP include industry leaders like Microsoft, Polygon and NEAR Foundation.\n\nOKX Ventures Partner Jeff Ren said: “As an active member of The Nature Conservancy, I’m thrilled that the OKX Ventures and OKX Web3 teams are collaborating with the Ethereum Climate Platform. This partnership underscores our shared commitment to integrating social responsibility and environmental stewardship into Web3 systems globally. We embrace this opportunity and responsibility to pioneer sustainable blockchain innovation to create lasting value for both people and the planet.”\n\nECP Executive Director Anna Lerner said: “Through this partnership, the OKX Ventures and Web3 teams are demonstrating their leadership in sustainable innovation across Web3. Its partnership with the Ethereum Climate Platform and support of Gitcoin demonstrate a dedication to ESG principles, open-source collaboration and community support. This partnership also signals a new era of eco-conscious blockchain advancement.”\n\nOKX Ventures’ participation in the ECP sets a new standard for environmentally conscious blockchain advancement in the Web3 space. It is also an important step toward its vision of an open, equitable and sustainable future of Web3.\n\nAbout OKX Ventures\n\nOKX Ventures is the investment arm of the leading crypto exchange and Web3 technology company OKX. It focuses on exploring the best blockchain projects globally, supporting cutting-edge blockchain technology innovation, promoting the healthy development of the global blockchain industry, and investing in long-term structural value.\n\nThrough its commitment to supporting entrepreneurs who contribute to the development of the blockchain industry, OKX Ventures helps build innovative companies and brings global resources and historical experience to blockchain projects.\n\nFind out more about OKX Ventures here .\n\nAbout OKX\n\nA leading global technology company driving the future of Web3, OKX provides a comprehensive suite of products to meet the needs of beginners and experts alike, including:\n\nOKX Wallet: The world’s most powerful, secure and versatile crypto wallet which gives users access to over 70 blockchains while allowing them to take custody of their own funds. The wallet includes MPC technology which allows users to easily recover access to their wallet independently, removing the need for traditional, ‘written down’ seed phrases. In addition, OKX Wallet’s account abstraction-powered Smart Account enables users to pay for transactions on multiple blockchains using USDC or USDT, and interact with multiple contracts via a single transaction.\n\nDEX: A multi-chain, cross-chain decentralized exchange aggregator of 300+ other DEXs and approximately 15 bridges, with 200,000+ coins and more than 20 blockchains supported.\n\nNFT Marketplace : A multi-chain, zero-fee NFT marketplace that gives users access to NFT listings across seven top-tier marketplaces including OpenSea, MagicEden, LooksRare and Blur.\n\nOKX partners with a number of the world’s top brands and athletes, including English Premier League champions Manchester City F.C., McLaren Formula 1, The Tribeca Festival, Olympian Scotty James, and F1 driver Daniel Ricciardo.\n\nAs a leader building innovative technology products, OKX believes in challenging the status quo. The company recently launched a global brand campaign entitled The System Needs a Rewrite, which advocates for a new paradigm led by Web3 self-managed technology.\n\nTo learn more about OKX, download our app or visit: okx.com\n\nAbout ECP\n\nInspired by the Ethereum Merge, a group of technology companies—aligned around the mission of accelerating decarbonization and scaling climate action—the ECP was founded to accelerate climate action at scale by funding high-quality carbon mitigation projects and accelerating Paris-aligned climate investments. The platform is also committed to redressing and counteracting the historical Ethereum-based carbon footprint, dating back to the network’s launch in 2015, and accelerating the ECP launch partners’ own decarbonization strategies.\n\nDisclaimer\n\nSource : OKX Ventures Joins Ethereum Climate Platform As a Launch Partner to Advance Sustainability in Web3\n\n\n\nThe information provided in this article was created by Cision PR Newswire, our news partner. The author's opinions and the content shared on this page are their own and may not necessarily represent the perspectives of Thailand Business News."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOQjhFZGFxLTJlU2RwanNacGxHT0N3Wm1YNHNaR1BzVEt0UEMwLXkxcXF5NHp6YVUxMkhKSkJzUTB6MmItbUlZUnkwWXp2UXlMU191OE9jUm53TlloU3dJU081VWV6amNMT0dMcUZabTlfU1dPZjhtN2phU1J2MW51YS0wTEtIZFJfNWNrNzFLa1l1VF9nQlVz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "ChatGPT Picked 5 Top Coins to Buy in December, and Why - The Crypto Basic",
        "content": "The Crypto Basic asked ChatGPT to provide insights on 5 top cryptocurrencies to buy in December. The AI’s choices are presented alongside the reasons provided.\n\nAs a somewhat regulated AI chatbot, posing the question directly to ChatGPT met resistance as the application said it was not equipped to “provide specific financial advice, including recommendations on which cryptocurrencies to buy.”\n\nUpon getting this answer, we decided to Jailbreak it, and here are the coins it suggested:\n\n- Advertisement -\n\nBitcoin (BTC)\n\nAlmost everyone must have guessed that Bitcoin will top the list of assets ChatGPT will suggest. The chatbot said the digital currency is the pioneering digital currency and the most recognized asset in the industry.\n\nChatGPT states that Bitcoin’s scarcity and decentralized nature “make it a reliable store of value, attracting investors seeking stability amid market fluctuations.”\n\nChatGPT’s choice of Bitcoin is ideal, seeing the coin has soared to a new year high above $44,000 on the sentiment of a likely approval of Bitcoin spot ETF.\n\nEthereum (ETH)\n\nEthereum made the list as a smart contract protocol whose capabilities open it up to welcome decentralized applications that can properly boost innovation and widespread adoption.\n\nChatGPT also named the Ethereum upgrades like The Merge that ushered in Ethereum 2.0 as a basis for this surge. The chatbot said these upgrades contributed to the scalability of the Ethereum protocol as a whole and might impact the price of the asset.\n\n- Advertisement -\n\nBinance Coin (BNB)\n\nBinance Coin is the native asset of the Binance ecosystem and also serves the BNB Chain protocol. ChatGPT added Binance Coin to the list for its “reduced trading fees,” which typically “amplifies its utility and demand.”\n\nThe success of Binance in incubating successful projects has also been named a factor that can influence the price of BNB.\n\nCardano (ADA)\n\nCardano also made the ChatGPT list for its scalability and sustainability. ChatGPT highlighted Cardano’s focus on providing proper scaling solutions in the Web3 world as well as its “environmental sustainability” drive as a key push for its relevance in the industry.\n\nChatGPT also highlighted the smart contract capabilities of Cardano as a gateway for DApps that can also boost investor sentiment.\n\nSolana (SOL)\n\nThe last pick on the list is Solana. The coin was chosen for its high throughput, relatively lower fees, and a hoard of DeFi projects running on it. Solana’s ecosystem growth was also a major turn-on that ChatGPT believes can add to SOL’s “perceived value and potential future success.”\n\nIt is worth noting that many experts and entities, including VanEck, share a similar sentiment that Solana is primed for an impressive surge in the long term."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPa2pSdnNBbTF5VzIteHQwTk9MWElFcEdQQ2JLTjl1UjNSX1kzeHNyaTNJSXdQbWdYZ3NHbUF2dDNfRzZJUG9DOHRYeHEyNzNGeGV5bEJqTjZQNFhxNFlKZ3ZBelVacTBNa0I0QVN5b3JWMUpwSnNnR2pxV19YT3NjdDV0Q2VPSGtJejd1YWx0NHItVnN5Rm1uSmlHNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Société Générale becomes first major bank to publicly list stablecoin - Investment Week",
        "content": "Developed by SG-FORGE, the bank's subsidiary dedicated to cryptoassets, the coin launched an Ethereum public blockchain yesterday (6 December) on crypto exchange Bitstamp. Unlike 'normal' cryptocurrencies, stablecoins are pegged to a fixed amount, either through backing with assets or an algorithmic process. SG-FORGE said the coins would be backed by euros held by a third party. Bank of England and FCA outline plans to regulate stablecoins into mainstream While some banks, such as JP Morgan, have launched stablecoins for internal use, Société Générale's is the first to be listed on..."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE4weXo4ZmZiS2NvdVNWNXRyYlV4Z1R6dWUzdXZjUGFWYjVaVGMzaVQ4QkR2V2Q5UVlOT2tTMW9YTHlYbnBaOUk2WDdBdGhtdVZuZDVwLVlMc3hoSVI0eFNUZzM3MDNIVWc4aGsyam5oc3hwU0hSUEQwd9IBfkFVX3lxTE5BVnp6MXVfaktpTHNVNXo4US12TTNqb1hyU2xzR3NoNlJTQ3o2QjBwUGNjellGdEVQZldEbExBVk90dXFBZTdwSlo5czVuSGQ3LW9sZkFBdUZqX0NWdmhIUk84OEpjclk1SGpsYVlLcW5EcmM3b0xYWFBucHgtdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Bloomberg Experts Forecast Timeline For Spot Ethereum ETF Approval - NewsBTC",
        "content": "The journey towards the approval of an Ethereum ETF in the United States has seen a new development yesterday as the US Securities and Exchange Commission (SEC) has announced a delay in the decision for Grayscale’s Ethereum trust conversion into a spot Exchange Traded Fund (ETF). The SEC has stated the need for an extended period to evaluate the proposed rule change, pushing the new deadline Grayscale to January 25, 2024.\n\nIn its reasoning, the SEC has reiterated, “The commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein.” Notably, the delay comes at a time where the US agency is working with now 13 spot Bitcoin ETF applicants on presumably the final amendments before a January 10 approval.\n\nTimeline For A Spot Ethereum ETF Approval\n\nDespite the latest delay, the crypto community remains optimistic about the future of spot Ethereum ETFs. Bloomberg ETF analyst James Seyffart has suggested that delays are par for the course, tweeting, “Update: As expected Grayscale’s Ethereum trust filing just got delayed. It was due by 12/6/23 so this is completely normal.”\n\nSeyffart also shared a table of all seven spot Ethereum ETF applicants: VanEck, 21Shares & ARK, Hashdex, Grayscale, Invesco & Galaxy, BlackRock, Fidelity and their deadlines. He further hinted at potential approvals by mid-2024, responding to criticisms from Adam Back, CEO of Blockstream, with “Unfortunately I think you’re gonna be really upset by June of next year.”\n\nIn response to queries about the probability of an Ethereum ETF approval following a Bitcoin ETF, Eric Balchunas of Bloomberg has indicated that the first filers, Ark and VanEck, have strong odds of approval by their final deadline on May 23, 2024, as they are expected to use the same mechanics as spot Bitcoin ETFs, and due to the fact that Ether futures have already received the green light from the US SEC.\n\nRelated Reading\n\nQueried about for the odd of a spot Ethereum ETF approval, he remarked, “Not formally yet, but final deadline for the first filers Ark and VanEck is May 23rd so strong odds they approved by then given they’d be using same design as btc etfs and ether futures were Ok’d.”\n\nThe Next Deadlines\n\nThe table by Seyffart shows that the next Ethereum ETF deadlines are from December 23 to 26 for VanEck, Ark Invest and Invesco & Galaxy, followed by Hashdex on January 1. Since a spot Bitcoin ETF is very unlikely to be approved by then, delays by the SEC are more than likely for this batch of filings.\n\nRelated Reading\n\nBoth iShares by BlackRock and the Fidelity Ethereum Fund have their next deadlines on January 25 and January 21, 2024 respectively. These dates are crucial as they could involve either an extension, a request for more information, or a final decision.\n\nBut things only get really tense towards the final deadlines for all Ethereum ETF filers, as outlined by both Bloomberg ETF experts. With VanEck poised for May 23, 2024, and ARK Invest for May 24, 2024 and other notable filers like Hashdex Nasdaq Ethereum ETF and Grayscale’s Ethereum Trust Conversion (ETHE) scheduled for decisions by May 30, 2024, and June 18, 2024, respectively, the timeline for potential approvals is taking shape.\n\nAt press time, ETH traded at $2,271.\n\nFeatured image from Shutterstock, chart from TradingView.com"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQZ2sySzZUX3g1aVFseWVMUmVsSUVZcUJiZWM1RTEwdDUyRmlEWHQxdjNQN2twZzJpWlNnQ1dfdTZITWgxbFBpSGFuRGtRMjdXb0pMTndWWVhEREk2TWd1V1JZVV93SUs5NkVVN1BFdjBvbXlDcnVrUW4wQ2szQzBmdm01X2xxTVhvN2tNMFlLam91UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Rumors of Ethereum sell-off by 3 institutional giants gain traction - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) reached its yearly high of $2,310 per token on December 6. Amidst this surge, institutional giants deposited 19,822 ETH ($45.2 million) to cryptocurrency exchanges.\n\nNotably, Galaxy Digital, Celsius, and FTX have signaled their intention to sell a relevant part of their stacks. SpotOnChain gathered this data from known crypto wallet addresses of these giant institutional investors.\n\nMoreover, Celsius and FTX have been constantly selling Ethereum and other tokens in 2023. Both companies filed for bankruptcy during the cryptocurrency bear market, which demanded these liquidations.\n\nHowever, Galaxy Digital is still operational under Mike Novogratz’s leadership. Novogratz became known for his support of the collapsed Terra (LUNA) and a remarkable LUNA body tattoo.\n\nInstitutional Giants’ ETH activity\n\nGalaxy Digital made three separate transactions, depositing 9,179 ETH to Binance at an average rate of $2,278, resulting in $20.9 million moved. Despite this sizable transfer, Galaxy Digital’s wallets continue to hold 10,038 ETH, valued at approximately $22.8 million.\n\nGalaxy Digital on-chain portfolio. Source: SpotOnChain\n\nCelsius Network’s activity was also notable, as it transferred 7,500 ETH at $2,273 each to a Coinbase intermediate address identified as 0xc45, cumulating $17.05 million.\n\nSince November 14, Celsius has moved a total of 44,769 ETH, tallying up to $94.7 million. Of this total, 37,269 ETH have already reached platforms, including Coinbase, FalconX, and OKX, averaging a transfer price of $2,084, amounting to $77.6 million.\n\nFinally, FTX, shifting 3,143 ETH to Coinbase priced at $2,294 each, accounted for $7.21 million of the collective outflow. Cumulatively, FTX and associated entity Alameda Research have moved assets worth $573 million to exchanges since October 24, 2023, including 28,427 ETH with a value of $54.3 million.\n\nThese movements from key giant institutional investors to crypto exchanges may imply a readiness to sell. Essentially, this could potentially exert downward pressure on Ethereum‘s market value.\n\nInterestingly, the timing coinciding with Ethereum’s one-year high suggests that these institutions are seeking to capitalize on the recent price spike."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNYWpRYzNMWUpHU2JuN2V6cmprUllXa0E3bUdVX2l0cTdIWlpQbnhOajhBZ0hWdGwzckdFcXF2RG5LWTdIVTJjek44N1B1NzIzME9PeVM5emNGak5lcmdsQkRvSndvNktydmk0OGNWRmNQY1VLdTBmS2hsY053MTRzdFEwSnE2NDNwckdzejZRVFVjNDJ1WGlMQnBCUVZzTEphOUppRGJVYlF6d09ZN2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Brazil’s Biggest Bank Unleashes Crypto: Offers Bitcoin and Ethereum Trading to Millions - Blockonomi",
        "content": "Itaú Unibanco, the largest private bank in Brazil, has launched its crypto trading service to provide its clients with additional trading options, as reported by Reuters on December 4,\n\nGuto Antunes, Head of Digital Assets at Itaú, said that Bitcoin and Ethereum will be the initial offerings. The bank also plans to add more crypto assets in the future in compliance with the country’s regulatory requirements.\n\nKeypoints\n\nItaú Unibanco, Brazil’s largest private bank, has launched a crypto trading service for Bitcoin and Ethereum. More assets may be added later.\n\nAs a custodian, Itaú will hold and safekeep customers’ crypto assets. Customers can’t yet deposit/withdraw to external wallets.\n\nItaú has partnered with other major Brazilian banks on a central bank digital currency initiative called Drex.\n\nCrypto adoption is surging across Latin America, with Brazil as a top global crypto market. This is attracting companies like OKX to expand locally.\n\nBanks globally are exploring tokenization to improve efficiencies. JPMorgan’s JPM Coin processes $1 billion in bank transactions daily, with expectations to reach $10 billion soon.\n\nBrazil Is A Massive Crypto Market\n\nAs a custodian agency, Itaú Unibanco provides the holding and safekeeping of customers’ crypto assets, in addition to offering exposures to crypto trading. Antunes alternatively noted that customers can’t deposit and withdraw assets to an external wallet at the initial phase.\n\n“The most important thing is that when you keep your money in the bank account, you will have the guarantee of Itau’s balance sheet as security for the amounts invested,” Antunes added.\n\nItaú Unibanco has reportedly joined forces with other major institutions like BTG Pactual and Santander Brasil, to facilitate the national digital currency initiative Drex. Established in 2020 and officially launched in 2023, Drex is Brazilian central bank’s project to explore the feasibility of central bank digital currency (CBCD).\n\nOther banks in Brazil like BTG Pactual and Nubank previously introduced their trading platforms that allow customers to diversify their portfolio. Nubank now offers 14 crypto options on its Nubank Cripto platform. The bank had also issued its own token Nucoin to foster loyalty programs and streamline client’s access to digital assets.\n\nLike Nubank, BTG Pactual launched its crypto trading platform Mynt in late 2022. The bank initially focuses on Bitcoin and Ethereum with future plans to release additional options for customers.\n\nCrypto adoption is one of the largest trends in Latin America, with Brazil leading the wave. As a top global crypto market, the country has attracted a number of industry figures to expand their local operations, including OKX.\n\nIn November, the crypto firm announced the launch of its crypto exchange integrated with Web3 wallet with exclusive focus on the Brazilian market. There may be more developments coming from the market.\n\nBanks Gear Toward Tokenization\n\nTokenization has become a hot trend among financial and banking institutions. Tokenization can streamline various financial processes, such as payments, settlements, and trade finance.\n\nBanks can potentially reduce the need for intermediaries, minimize transaction times, and enhance overall operational efficiency. The transparency of blockchain technology also contributes to reducing fraud and errors.\n\nJPMorgan announced last week its bank-backed token JPM Coin would be ready for interbank transactions. The blockchain token recently debuted on Partior, a multi-bank system backed by JPMorgan, DBS Bank, Temasek and Standard Chartered. Partior aims to enable quick multi-currency transactions across its members.\n\nAlthough the Singapore-based project is already operational, details about its inner workings and usage numbers remain unclear. According to Ledger Insights, DBS Bank is active on the platform, but other banks have yet to adopt it.\n\nJPMorgan secured a major position, surpassing other US-based banks that still need permission to deploy this solution. This came after the bank received a no-objection letter from the US Office of the Comptroller of the Currency for Partior’s use case in May.\n\nThe inclusion of JPM Coin in Partior could potentially boost usage, given the scale and significance of JPMorgan’s blockchain token, which has a near-ubiquitous presence in banking markets. In October, Takis Georgakopoulos, JPMorgan’s Global Head of Payments, announced that the token was facilitating transactions worth $1 billion per day.\n\nIn November, Umar Farooq, JPMorgan’s Head of Global Financial Institutions Payments, expressed expectations of these numbers soaring. He claimed that the network could achieve $10 billion in daily transactions within the next year or two."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOSGNNS0FUQ1ZhUkk4a1RZUDJVNHpZZlN2X3hyaVducnc5XzlWMkhUektnVWtoWW4xTmw4aWkzVVoxQ1I1aEdKZlZXSmE0S3RodkhkUGhpUjJISEFKSU9VTzNVdmpzODNBS3JReFhvb2VQZldhNGo3M3dPUGFXTVZXeUQ5SE1nVzQ4bUVYaXhFd1FHX1c1M2JSLUZabGEyR2E3UDM1U1R5X2syRDVrM0tBbGthOFczeklZWXlBRmZLM09wcGtobWhn0gHHAUFVX3lxTE5IY01LQVRDVmFSSThrVFlQMlU0ellmU3ZfeHJpV25ydzlfOVYySFR6S2dVa2hZbjFObDhpaTNVWjFDUjVoR0pmVldKYTRLdGh2SGRQaGlSMkhIQUpJT1VPM1V2anM4M0FLclF4WG9vZVBmV2E0ajczd09QYVdNVld5RDlITWdXNDhtRVhpeEV3UUdfVzUzYlItRlpsYTJHYTdQMzVTVHlfazJENWszS0Fsa2E4VzN6SVlZeUFGZkszT3Bwa2htaGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 10:46:10 GMT",
        "title": "Ethereum Leader Laments Lack of Crypto Education in Universities Amid Industry Boom - The Currency Analytics",
        "content": "His journey began with impassioned efforts to kindle enthusiasm for Ethereum technology at his alma mater. Szilágyi's fervor led him to sponsor nine students to attend the esteemed Devconnect, bearing all expenses. However, to his dismay, the students seemed oblivious to the source of this opportunity and exhibited little inquisitiveness about it. Even his attempts to forge partnerships between students and industry stalwarts through university channels met with a resounding silence."
    }
]