[
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQUl91TVJ6dVZuVHdUcEJyd3lWekkyOHozVmZuR3pQaVZVa1dUaFoyVFotV3d0VzhUVXhfNUNZRms5eWdoYm1UUjVlMHM2THE1Q3dvSldyODhLX1RnRTZ5MEItUUxQWjAtdXpTRzFvZWtwRWgxMTJ1eUNGVHlZWlRCWWJWQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Ex-Ethereum engineers launch Hyperbridge - Techpoint Africa",
        "content": "Key takeaways:\n\nFounders of Polytope Labs, Seun Lanlege and David Salami, have launched Hyperbridge, a protocol for safe cross-chain transactions.\n\nBuilt to make Africans builders of blockchain technology, Polytope Labs has gotten funding and research grants of up to $130,000.\n\nHyperbridge, which is its first product, is a blockchain network that the founders claim uses a first-of-its-kind infrastructure design.\n\nAfrica has largely been on the consuming end of crypto and blockchain technology for a long time. While crypto evangelists across the world say Africa has the most use cases for blockchain, Africa has not played a major role in the building of critical blockchain infrastructures — the hard stuff, if you may.\n\nThis is the reason why Seun Lanlege, who used to work with the team that built the Ethereum network and Polkadot network and David Salami built Polytope Labs.\n\nIn a conversation with Techpoint Africa, Lanlege said \"Polytope Labs is an opportunity for Nigerians to build lasting technological infrastructure. If we're going to be using this technology, we should also be building it.\"\n\nAdvertisement\n\nHowever, building blockchain infrastructures is hard.\n\nAnd this is not just because of the complex-looking mathematical equations Lanlege has on his board during blockchain community meets ups or his cryptography and blockchain discussions at the University of London, UK, building blockchain products needs expertise, the kind Salami and Lanlege are hoping to nurture at Polytope Labs.\n\nThey also want to build products and have successfully built Hyperbridge.\n\nWhat is Hyperbridge?\n\nHyperbridge is a cross-chain protocol that allows the exchange of information across blockchains.\n\nNormally, blockchains exist in silos. Ethereum network does not communicate with the Bitcoin Network, while Polkadot does not communicate with Solana. This poses a challenge when you need to send information across these networks.\n\nLet the best of tech news come to you\n\nJoin 30,000 subscribers who receive Techpoint Digest, a fun week-daily 5-minute roundup of happenings in African and global tech, directly in your inbox, hours before everyone else. Digest Subscription Email First Name JOIN FREE Give it a try, you can unsubscribe anytime. Privacy Policy.\n\nA familiar example is sending money across different banks in Nigeria. Imagine every bank had its own currency and do not accept currencies from other banks.\n\nIf your supermarket uses Access Bank and you have a First Bank account, there'll be no way for you to pay because Access Bank does not take transfers from any other bank.\n\nBlockchains are designed this way for security reasons, and Hyperbridge wants to solve this problem.\n\nLanlege pointed out that while Hyperbridge isn't a first when it comes to cross-chain solutions, the design architecture is the first in the world.\n\n\"What we've built is a blockchain that does the cryptography verification on behalf of other blockchains. It is connected to all the chains and does all the verification that needs to happen so that secure messages can be passed between each chain.\"\n\nHe said that existing solutions have led to hacks due to security flaws that emerge because of, how expensive cross-chain protocols are difficult to run.\n\nOther cross-chain solutions include Polkadot, which is described as the blockchain of blockchains by the developer and former Ethereum Co-founder Gavin Wood and Cosmos with the vision of becoming the \"Internet blockchains.\"\n\nInterestingly, Polytope Labs has received up to $130,000 in funding and research grants from the likes of Web3 Foundation and Polkadot.\n\nHowever, Hyperbridge is just the beginning of Polytope Labs' blockchain creations, while Lanlege admits that the space is still growing, he believes Africa can be builders and not just consumers."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOZVBPLVJ6T1JuaGMzc3JBeF92dUJHNWpwazRGMkVaRXpRcWFQM2VHeG51eFROdUV2ZWFEN3JpV2EzYXVCbC1pSWRlaFRrUnBHYzN0SUJwbU1yOUtacXhUZUpvRENTaTBGcFBFOEs0cXkzMklrNzRDSEk0QU0xczZZemhBc3VkZ054UnZrcXpJUEtkVlo4V2txMHUwenVhWmRFUjVzMzhRcHZMUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Launchnodes Goes Big on Impact Staking and Takes Solo Staking Next Level - Brave New Coin Insights",
        "content": "Launchnodes Goes Big on Impact Staking and Takes Solo Staking Next Level\n\nLaunchnodes, is a UK-based firm that enables enterprises and individuals to solo-stake Ethereum on public clouds and bare metal. In this article, we investigate what this means and what Launchnodes does and intends to do in the space of solo staking.\n\nLaunchnodes is the only Ethereum-focused solo staking provider in the world today. Now, the team behind Launchnodes is betting big on impact staking, believing that solo staking isn’t just about decentralization and staking returns – it’s also a way to fund long-term social impact.\n\nThe innovative use cases introduced by the company are exactly what the blockchain industry needs to prove it’s a real-world tool for solving problems, not just a space for crypto enthusiasts to get rich.\n\nStaking beats all records\n\nThe current Ethereum staking scene is nothing short of explosive. With over $43 billion worth of ETH staked, the network is not just the largest TVL player on the market, but also one with most number of participants. Whilst solo staking requires 32ETH, protocols like Lido and crypto exchanges open the floodgates to much wider audience, allowing you to stake 0.01 ETH or 35000 ETH.\n\nLaunchnodes’ clients on the other hand, require a minimum 32ETH to run their own nodes, but the process is simplified for them by not having to run or pay for a beacon node or an Execution layer node (although they help their business customers run all the nodes not just validators). Hence, you can either solo stake cheaply or stake below 32ETH with other providers. You get to choose your pattern based on your economic and technical preference.\n\nStaking attracts users for multiple reasons. The primary factor is the earnings that each validator node owner or a below 32ETH staker receives over the time of having funds locked. These earnings are transparent and are derived from the automated work that validator nodes perform on the Ethereum blockchain of updating the blockchain and securing the network.\n\nUnlike DeFi protocols that at times deliver unfathomable returns, staking is less lucrative, but stable with the core risk being the price of ETH. That being said, solo staking remains to be the gold standard of staking, delivering most of the returns, without having to share your returns with any provider.\n\nStaking and solo staking specifically, helps to decentralise the network, with each node representing a unit of capital supporting the network.\n\nTaking solo staking up a notch\n\nOk, so a yield through staking is old news. Can Ethereum staking be more than a financial outcome similar to a savings account?\n\nHow can Ethereum staking be utilised further? Launchnodes thinks that Ethereum staking represents a new way to fund social impact which they call impact staking. Essentially a donor only gives away the staking returns for a period of time 12/24 months and at the end gets their original capital back.\n\nLaunchnodes initially used staking returns to fund tablets in refugee camps for Save the Children. Then, working as an implementation partner worked with UNICEF/GIGA to use staking returns to fund internet connectivity in schools.\n\nYes, the principal remains untouched, whilst all the returns that the node generates are used to fuel social impact, crucially internet connectivity is something that spews out data, ie how long the line is up for, bandwidth etc, Launchnodes believes that funding these data-rich contexts is a crucial part of impact staking rather than simply connecting money into building a school. This is what impact staking is all about and it may just be the new model for philanthropic endeavours. As the capital gets returned.\n\nPersistence is key\n\nHaving proof of concept confirmed and executed, the team at Launchnodes pushed to get the idea to the masses. According to the team, it wasn’t a straightforward and easy ride. Introducing the notion of staking to leading non-profit organisations involves integrating Ethereum into the real world and foremost, coming up with a governance solution that these organisations can work with.\n\nAnd now, the broader Ethereum ecosystem is starting to pay attention. Launchnodes secured a grant from Lido staking protocol. Lido has $15 billion worth of ETH under management. Once implemented, any Lido user will be able to channel a share of staking returns to a good cause directly within the protocol. This is good news for those wanting funding in the social impact space, as well as for Lido and the Ethereum ecosystem.\n\nLast but not least, Launchnodes has just rolled out a validator node product in partnership with GiveDirectly. Here, the idea is simple. You get a discount on spinning up a validator node, point your execution layer yield to GiveDirectly donations, and retain the consensus layer returns. This way, anyone who wants to be an integral part of the network by running a validator node through solo staking, can now also donate a share of the staking rewards to social impact.\n\nSince its launch in 2009, GiveDirectly has delivered $700+ million to over 1.5 million people living in poverty, and this partnership sets out to use the benefits of solo staking to maximise donations even further.\n\nThe next stage\n\nAs per its original goal, Launchnodes is fully devoted to enabling enterprises and individuals to solo stake Ethereum. The major downside to solo staking is that spinning up your own nodes is not a function of a few clicks, says Jaydeep Korde, the company’s CEO. This stops many Ethereum holders from reaping the maximum returns that solo staking offers. Even with the hand-holding service that the company offers, Jaydeep believes that there is still room for improvement. It is something that they are tackling right now, with a soon-to-be-released solo staking UI, aimed at simplifying the process of launching validator nodes to a few clicks whilst still keeping the nodes on your infrastructure – and not a Launchnodes run platform.\n\nWhether Launchnodes succeeds, we are yet to find out. However, if blockchains are going to change the world, use cases like impact staking leave us hopeful to see the future unravell.\n\nPhoto by rc.xyz NFT gallery"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNaVdJYjE4cjJSaTBMOTFTb215ZkdoMFo5OUI2b2Q2STZyeWhzdEJib1N2VFkwbDNKVUtZZjdrUXdpdXI4WjhKdVkxX2lsRlV3U25LNjhHdmlrOXBuTjlHcFdYSlNPbEU5UzNmQzBheG1NNVE2cFpSZTg3VXdwVVM2MUZ6RDlOM2xJLTI0b0hjM21zS1I5dmJhMzgtNlFySkg4MmtZdFNkMEViYkpYSEZ5NdIBtgFBVV95cUxNNDREVUs1d3lScjkyRFA4U2ZLSXJxbk42ZHFFVHR5cURvenQyeF96NldHYTlTMjdDTm42blNNWjduRkdyLW5QaGw4TG9WUlM3eDJyVi1KRlhELUpRWXYwbzFTaGFsWUV5c3ZaR1VVTU9TZDhsdjVranlxTDFaNFdNR3N1WF8yc1dGTHdCbzNvb3VLTkg1TTRkOE5zUmpQWEZESmRFTlZNQm01UlVWaHRyeG9seTBGUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Near Foundation and Polygon Labs Collaborate to Build ZK Solution - CoinDesk",
        "content": "“We are proud to collaborate with Near on this exciting research initiative to further drive the development and adoption of ZK technology,” said Sandeep Nailwal, co-founder of Polygon. The zkWASM prover maximizes developer customizability, which means projects will be able to select from a number of provers when building with Polygon Chain Development Kit (CDK), whether that’s launching or migrating an EVM chain, or building a WASM chain for closer Ethereum alignment and access to liquidity.”"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxNcHVXRFh3UFprdjhsRl92ZjdRYVVKckR4R181Z3FRdzg1X29qUU5ZZ3BPN0VyOFBFb19fcVBQNERvMGNaem1Uc3F1SEFZVktfR2RINzZpRzNQWGpZdFQ0ZmxGelU3a29MTmwtOHJteUk3Um9xVzNPYXNJSGZrck96S1JIbWxhMERaUWJpSXFSaDdsTUtiXzBydGxwMURPY2JhS3dBbDRjcFdBa0dRMmZJQjRRTUdpRHNpRlB6VU51WkFidzBzbVBET2hLRlpXdlVDOHlfUTFaa1RoYmdfNlUtZmllUXR1dEJYQURlOTN6UTXSAfYBQVVfeXFMUHg0dXlhRjBlTFFJU3p0RUpGRzVJMWtNaXkzNUJoNG5xa2FhdG9EVXk3WGhPdTQ4V0pqNmVjNG84MXI5NXpUSlJLc3hnYVNadk1DZEhmWFg4R0VYSl94VFduLXRTbW53SG9ZRjNOaFYtaWUtamxCa29mUmFIVGJsX25RM3l1dzNuNEs3S0lWNTUwUDJBTEtlN2t3VkZtTHRZek1mM1dOUG9mclBiUllOdDR6MU1CS3JCdW0wZXZFVUlFZUhHaGoyWFFuQUpxbExFTm1vZkpmcVk5Q1NmVkpXYTl0TE9XUHJsYnp5ZDliVFJDUFhxMGV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Polygon partners with Near Protocol to bring increased scalability and decentralization to Ethereum - FXStreet",
        "content": "Polygon announced a collaboration with Near Protocol, which could help to bridge the gap between Wasm chains and the Ethereum ecosystem.\n\nNEAR Foundation will be joining Polygon Labs as a core contributor to Polygon CDK (Chain Development Kit).\n\nEven though Near Protocol’s NEARCON conference began on Tuesday, the sell-the-news effect is visible for NEAR price.\n\nSince the advent of Ethereum, the EVM (Ethereum Virtual Machine) has been the standard for Protocols to run on Ethereum; however, Wasm chains are now being onboarded as a means of upgrading from EVMs. To make the same happen, Polygon and Near Protocol are joining hands to bridge that gap.\n\nPolygon and Near Protocol announce partnership\n\nPolygon and Near Protocol announced on Wednesday that the two companies were jointly developing a zkWasm prover. The zero-knowledge (zk) prover for the Wasm blockchains will bridge the gap between Wasm-based chains and the Ethereum ecosystem.\n\nWasm, also known as WebAssembly, is a framework that is used for running complex programs in a browser. The reason it is considered to be a viable replacement for EVM is because it offers higher flexibility and interoperability, supports more languages, and offers a broader toolset than Ethereum Virtual Machine.\n\nSpeaking about the collaboration, Polygon founder Sandeep Nailwal stated,\n\n“The zkWasm prover maximizes developer customizability, which means projects will be able to select from a number of provers when building with Polygon CDK, whether that’s launching or migrating an EVM chain, or building a Wasm chain for closer Ethereum alignment and access to liquidity.\n\nIn addition to wider ecosystem development, this partnership would bring NEAR Protocol closer to Ethereum, enabling Wasm chains to tap Ethereum liquidity. Given that NEAR Foundation has also joined Polygon Labs as a core contributor to Polygon CDK (Chain Development Kit), the potential for its growth is high.\n\nNEAR price rise halts but not for long\n\nNEAR price grabbed the crypto market’s attention after it rallied by more than 65% in over two weeks. The increase could be credited to broader market bullishness, as well as the anticipation for Near Protocol’s developer conference, NEARCON, that began on November 7.\n\nAs the conference turned out to be a sell-the-news event, NEAR price fell by more than 11.6% in the span of less than 48 hours, trading at $1.44. The altcoin is hovering around the $1.45 line at the time of writing, and bouncing off it would give the cryptocurrency a shot at recovery.\n\nThe Relative Strength Index (RSI) falling back down from the overbought zone suggests the trend has changed. However, given that the lingering broader market bullishness is not likely to end until December, the price could bounce back to reattempt the failed breach of $1.63.\n\nNEAR/USD 1-day chart\n\nNevertheless, if the NEAR price fails to close above it and eventually falls through this support level, it could see a bearish change of events. Not only would the bullish thesis be invalidated, but NEAR would fall toward $1.17."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5rbG1SdjVHSGVwVVdVaVh1RWFWUkd5U1BVNFVCZWJHWXpGLS1DeGlESy1XaktGZFJqTGdCTl9oUFctZEg1N1NhTVdRM25Bai0wcUc4Y0dVT2RKa3VmakFMbHhzWkpBcHpDaXVJc2pWR3jSAXZBVV95cUxQa3dKT1NxU2xkNG13RTFJeTkxZnZnSGtMM0pWNUFuTVpnMWotQlBkaFNLQlF0STU1Mm16RWpaMGdkRU41UTViamlwQUZTaHFiNGZ3TnZwTmpXcE5CVGFlVGlOMlBQeEd3bTNDcVZZeGUzS1lmZDJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Can spot Bitcoin ETFs push Hong Kong to the crypto throne? - Forkast News",
        "content": "In this issue\n\nBitcoin ETFs: Hong Kong has entered the chat Bitcoin Ordinals flip Ethereum NFTs IPO comes full circle\n\nFrom the Editor’s Desk Dear Reader, The verdict is in. Sam Bankman-Fried, founder and former chief executive officer of failed cryptocurrency exchange FTX, has been found guilty in what U.S. government prosecutors labeled one of the biggest financial fraud cases in history. As Bankman-Fried awaits a likely decades-long sentence for his part in FTX’s collapse — a truly catastrophic implosion that contributed in large part to the digital asset market’s travails over the past year — the industry is now looking forward. And nowhere, arguably, is more forward-looking than Hong Kong when it comes to the digital economy. The special administrative zone was again in the news this week as Hong Kong Securities and Futures Commission (SFC) head Julia Leung gave her first international media interview since taking office in January. Leung said that the regulator is happy to try any innovative digital asset proposal that “boosts efficiency and customer experience.” Significantly, that willingness to engage with digital assets includes the much-heralded spot Bitcoin exchange-traded fund (ETF). The financial instrument — which allows investors to trade Bitcoin on a traditional exchange at any time throughout the day — is expected to bring much-needed institutional cash into the industry. That’s particularly so in the U.S., where spot Bitcoin ETFs from the likes of investment giant BlackRock are reportedly just around the corner. With the U.S. spot Bitcoin ETF buzz causing a recent surge in the price of Bitcoin to over the US$35,000 mark, a ripple of fresh excitement has spread throughout the wider crypto market. But Leung also advised caution. She added the caveat to her comments about a spot Bitcoin ETF that the regulator would only consider products that meet the jurisdiction’s strict requirements on customer protection. Amid all the talk over a luxurious penthouse lifestyle for FTX executives in the Bahamas — where Bankman-Fried is also known to have cozied up to local officials — it is easy to forget that the exchange began life in Hong Kong. Added to that, the city has also just been through its own huge crypto scandal, with customers of the JPEX exchange losing out on over US$200 million in investments. Particularly as Beijing continues to clamp down on crypto in the Chinese mainland, Leung is right to advise caution. Hong Kong is seen as a so-called “sandbox” for crypto innovation, an area where experiments — regulatory and otherwise — can be conducted with a degree of separation from the wider Chinese market. Should the marriage between innovation and effective regulation work out as planned, Hong Kong has every chance of achieving what is now a key aim for the region — restoring its international reputation as a cutting edge financial center by becoming a global hub for the digital asset industry. Until the next time, Angie Lau,\n\nFounder and Editor-in-Chief\n\nForkast.News\n\n1. Bitcoin ETFs: Hong Kong has entered the chat\n\nAs fund managers vie to launch Bitcoin spot ETFs in major markets, the financial world watches, poised for a transformative shift in the digital asset landscape. Image: Canva\n\nThe Hong Kong Securities and Futures Commission (SFC) is considering the approval of ETFs investing directly in cryptocurrencies, with regulations to mitigate new risks.\n\nTwo Bitcoin futures ETFs and one Ethereum futures fund have already been approved by the SFC, signaling a cautious advancement into institutionally accessible crypto-based financial products.\n\nAccording to Bloomberg, SFC Chief Executive Julia Leung emphasized the need for a “comprehensive regulatory framework” following a significant fraud case involving the Hong Kong Exchange JPEX, which saw HK$1.6 billion (US$204 million) in customer funds misappropriated.\n\nThe SFC is refining its cryptocurrency regulations and developing new rules for stablecoins and asset tokenization, while the Hong Kong Monetary Authority (HKMA) is aiding banks in handling tokenized assets.\n\nIn the U.S., the Securities and Exchange Commission (SEC) has been wary of approving Bitcoin ETFs, citing potential market manipulation and the need for secure handling of customer assets.\n\nBlackRock and Fidelity Investments are among several major investment giants that have applied to set up a spot Bitcoin ETF in the U.S., with Grayscale Investments looking to convert its Bitcoin trust into a spot ETF.\n\nForkast.Insights | What does it mean? The spot Bitcoin ETF remains the news of the week, regardless of location. The crypto industry views the arrival of this financial instrument in the U.S. as the silver bullet needed to steady the listing ship of the crypto market, down some US$2 trillion over the past 18 months after the collapse of FTX, among a host of other digital asset firms. But spot Bitcoin ETFs already exist in Europe, where they have been met with a muted reception. Bitcoin futures ETFs also already exist. But beyond an initial bump in the price of Bitcoin when ProShares first introduced a Bitcoin futures ETF in the U.S. in October 2021, they too have failed to pull up many trees. But, the optimism is there. Bitcoin is up over 30% since mid-October just on the suggestion that a spot Bitcoin ETF in the U.S. is imminent. Some analysts argue that the past month’s price pump goes to show that the market had yet to price in the existence of a spot Bitcoin ETF. The rise in prices across crypto is just a way of factoring in the potential inflow of institutional cash this particular financial instrument is expected to bring. But others, including former Wall Street banker Norbert Gehrker, believe that the improvements to the user experience for investors enabled by the creation of a spot Bitcoin ETF in the U.S. is enough to potentially attract further large scale inflows of money into the industry. In a note to Forkast, Gehrke used the example of the first gold ETF. Introduced in 2004, it pulled in US$5 billion in the first 15 months and US$10 billion over the first 10 years, dramatically changing the gold market. Expectations are similar in the Bitcoin market. We could soon see multiple jurisdictions look to get in on the action in the near future, particularly if — as expected — the SEC makes an approval early in the new year.\n\n2. Bitcoin Ordinals flip Ethereum NFTs\n\nCredit\n\nBitcoin’s ecosystem of inscribed blockchain artifacts, Ordinals, BRC20s, and infinite future iterations, overtook Ethereum’s ecosystem of NFTs in sales volume this week for the first time.\n\nBitcoin Ordinals and BRC20s saw over US$17.9 million in sales Tuesday, beating the combined sales volume of the next four blockchains.\n\nThe Bitcoin ecosystem has traded for over US$57.6 million in November, reflecting a return to pre-summer levels of trading.\n\n$SATS BRC-20s are the top-selling NFT collection in the past seven days across blockchains, with US$25.2 million in sales.\n\nForkast.Insights | What does it mean? A true milestone moment for Bitcoin happened this week. Not just for blockchain collectibles, artifacts, or NFTs. Instead, it’s a milestone for the Bitcoin blockchain itself, which is seeing its utility beyond payments legitimized. Sales volume for Ordinals, an iteration of NFTs on the Bitcoin network, has been on the rise. The blockchain’s BRC20s, a fungible token standard powered by Ordinals, are really seeing an increase in sales. Seven of the top 10 collections on CryptoSlam are represented by BRC20s. These bundles of fungible tokens are being sold at a rate that we’ve not seen before, and Binance’s recent integration of ORDI tokens suggests there’s much more in store for this genesis of decentralized finance (DeFi) on the Bitcoin blockchain. It’s fair to say that Bitcoin “flipping” Ethereum is a controversial statement. Most on the Ethereum side don’t accept it. Comparing BRC20s to NFTs is not apples to apples. But comparing non-fungible bundles of BRC20s to tokenized houses, profile pictures, cars, and fantasy sports assets shouldn’t require an apples to apples comparison.\n\n\n\nThe NFT ecosystem is young, and as it matures, clever technologists will find all kinds of ways to shoehorn strange use cases into NFTs. Last month, it was Pokemon cards stored in Brinks vaults, this month it’s BRC20s, and next year it just might be your entire bank account.\n\n3. IPO comes full circle\n\nCircle gears up for an exhilarating return to the IPO arena, riding the wave of regulatory shifts and market optimism. Image: Circle/Canva\n\nCircle Internet Financial Ltd., the company behind USDC, the world’s second-largest stablecoin, is contemplating an initial public offering (IPO) in early 2024, Bloomberg reported Wednesday, citing unnamed sources.\n\nThe sources reportedly said Circle is in talks with advisers over the potential listing, although the outcome and valuation remain uncertain.\n\nCircle canceled a previous attempt to go public via a SPAC merger. The company was valued at US$9 billion in 2022.\n\nDespite the aborted merger with Concord Acquisition Corp., Circle has attracted significant investment from heavyweights like Goldman Sachs and BlackRock.\n\nThe stablecoin issuer faced a scare earlier this year due to its US$3.3 billion exposure to the defunct Silicon Valley Bank."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiUEFVX3lxTFBqdEFCSUxTb0p4MFpNUEQ3bTNITkRyQURqcEp4bXV2NUVkemhCMGh1UDZROWtva21XWExuUWJXS0pQUTlvTkp0Q3dQa2VtNHBT?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "ERC-4337 Explained - LCX",
        "content": "The adoption of cryptocurrencies and blockchain technology has experienced a meteoric rise. But despite that, attracting users’ attention and assisting them in utilizing crypto and blockchain applications is a formidable obstacle. The introduction of ERC-4337’s fundamentals intends to address this challenge.\n\nThe lack of interoperability between centralized and decentralized systems, as well as the complexity of smart contracts and comprehensive working modules, have been the primary obstacles to crypto and blockchain adoption. By implementing account abstraction via ERC-4337 and EIP-4337, Ethereum intends to increase the accessibility of every facet of the crypto world. This blog provides a comprehensive overview of ERC-4337 and how it facilitates account abstraction.\n\nWhat Is ERC-4337?\n\nVitalik Buterin, co-founder of Ethereum, and other developers proposed ERC-4337 in 2021 to establish account abstraction. It was deployed on the Ethereum mainnet in March 2023 and is anticipated to usher in wallet designs that are user-friendly.\n\nAccount abstraction in Ethereum seeks to combine the characteristics of the protocol’s two existing account types: Externally owned accounts (EOA) and smart contract accounts. The result is a singular contract account that can simultaneously transact with tokens and create contracts. This modification enables innovative wallet designs, including social recovery, customization, and upgradeability.\n\nERC-4337 can also be understood as bringing smart contract functionality to a singular wallet account. This simplifies the configuration of services such as multi-factor authentication and automatic payments.\n\nBackground and Origins of ERC-4337\n\nBeginners can gain a thorough comprehension of ERC-4337’s objectives by examining its historical context. How did the idea of account abstraction originate? EIP-86 was the first attempt at account abstraction; it aimed to enable smart contracts for initiating and authorizing transactions. EIP-2938, which was proposed in 2020, was the next stage in the move toward account abstraction. It focused on creating a new type of top-level account using address-specific smart contracts. EIP-3074, a 2020 EIP for account abstraction, intended to create smart contracts that could execute themselves. Additionally, EIP-196 emphasized enhancing the effectiveness and safety of smart contracts.\n\nAll these account abstraction attempts never became Ethereum Requests for Comment and instead remained EIPs or proposals. All account abstraction enhancement proposals were rejected because they required alterations to the Ethereum consensus layer. EIP-4337 was effectively transformed into ERC-4337 by providing account abstraction for consensus layer protocols without modification. It enabled the addition of a higher infrastructure layer on top of the existing backend. ERC-4337 is applicable for account abstraction across EVM-compatible ecosystems."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE1PTHZ2SjNqOHJnQ1oxMFNWbE10OVNhVHd6MWkxN2FWT1NtYUM4MHBYZTloaHJWdlZ4VkxCcXlNV1pjd1BiaVJpdE90aTl3SlVJTnloaF9hMlNiWVNLUUdDanJR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Top 10 DeFi Platforms in 2024 - Bitcoin Market Journal",
        "content": "As we move into 2024, finance will be about decentralization.\n\nDecentralized Finance (DeFi) is one of the biggest and most exciting trends in the blockchain industry, with many believing it will overtake traditional finance in the coming years. This growing financial sector relies on the promise of robust, decentralized support networks that promote innovation (both financial and technical) that could fundamentally disrupt how we think of money exchange.\n\nAt the forefront of this movement is the collection of DeFi platforms that support crypto and blockchain projects, facilitate transactions across blockchains, and serve as a trading hub of sorts for investors around the world.\n\nWith that said, we must understand that DeFi platforms hold both peril and promise. In this guide, we’ll cover the top 10 DeFi platforms for 2024, looking at both the potential risks and rewards.\n\nBeyond TVL: How We Rank DeFi Platforms\n\nWhen our analysts assess DeFi platforms, they use criteria that articulate the “trust factor” of these platforms, such as year of launch, community following, and Total Value Locked (TVL) in supported protocols.\n\nEven though DeFi is a young industry, we’re looking for platforms that have stood the test of time (relatively speaking), typically with a large user base and significant value.\n\nTotal value locked is like money “locked” in traditional mutual funds or CDs. This metric does matter, representing the sum of funds available to a DeFi platform, like a bank’s lending and borrowing capacity. But many DeFi projects quickly attract a lot of capital and then promptly flame out as users leave the service, rendering TVL a less-than-useful metric. This is slightly different from other analysts. Most DeFi rankings look exclusively at Total Value Locked, which can be misleading. The DeFi industry has nearly $44 billion locked in apps.\n\nSo, TVL is just one part of the picture. We also look for longevity and the long-term ability to sustain a strong community of users — in the same way that we would look at a bank’s history and customer happiness, not just its size.\n\nAave, formerly known as ETHLend, is an Ethereum-powered, decentralized peer-to-peer marketplace for borrowing and lending digital assets. The peer-to-peer lending platform enables borrowers and lenders to agree on the loan terms executed using smart contracts.\n\nWhile Aave doesn’t have the largest TVL (Lido takes that award), it does have the greatest transaction volume and the longest history of any platform in our list, giving it the edge over other platforms.\n\nYear Launched: 2017\n\nBlockchain: Ethereum\n\nServices: Borrowing and Lending\n\nTotal Value Locked: $5,490,000,000\n\nCommunity Following: 549,500\n\nBMJ Score: 4.5\n\nCheck out BMJ’s Aave Investor Scorecard here.\n\nLido was launched parallel to the Ethereum 2.0 Beacon Chain as a liquid staking solution for Ethereum and other PoS chains. The protocol offers non-custodial staking services, allowing users to stake their tokens without locking assets or maintaining staking infrastructure.\n\nSince Ethereum has switched to Proof-of-Stake Lido has exploded. It’s huge TVL lands it very near the top of our ratings.\n\nYear Launched: 2020\n\nBlockchain: Ethereum\n\nServices: Liquid staking\n\nTotal Value Locked: $16,360,000,000\n\nCommunity Following: 269,000\n\nBMJ Score: 4.0\n\nUniswap is a decentralized exchange on the Ethereum network that enables users to trade ERC20 tokens autonomously and swiftly. It does so through an algorithm that matches trades based on supply and demand in a liquidity pool, removing middlemen and intermediaries.\n\nUniswap is one of the earliest DeFi platforms and has a huge user base, giving it a very strong showing in our ratings.\n\nYear Launched: 2018\n\nBlockchain: Ethereum\n\nServices: Token Exchange/Lending\n\nTotal Value Locked: $3,310,000,000\n\nCommunity Following: 4,500,000\n\nBMJ Score: 4.0\n\nCheck out BMJ’s Uniswap Investor Scorecard here and Risk scorecard here.\n\nThe Ethereum-powered MakerDAO is a decentralized Collateralized Debt Position (CDP) platform that supports the stablecoin DAI, which aims to maintain its value one-to-one with the US dollar. Users can open a Collateralized Debt Position (CDP) by locking up ether (ETH) or other Ethereum assets as collateral to receive DAI as a debt against the locked-up assets. The platform uses the MKR token for interest payments, and the DAI and MKR paid are burned once the CPD is closed out.\n\nWith its focus on borrowing and lending, along with a connection to DAI and a long history, Maker ranks very highly.\n\nYear Launched: 2018\n\nBlockchain: Ethereum\n\nServices: Borrowing and Lending/Stablecoin\n\nTotal Value Locked: $4,950,000,000\n\nCommunity Following: 261,000\n\nBMJ Score: 3.5\n\nCheck out BMJ’s Maker Investor Scorecard here.\n\nPancakeSwap is a popular decentralized exchange providing token trading alongside features like staking and liquidity pools. The DEX is based on the BNB Chain, formerly the Binance Smart Chain.\n\nWhile PancakeSwap is relatively new, it has a huge following. Its prominent place in the Binance ecosystem makes it a good choice for Binance users.\n\nYear Launched: 2020\n\nBlockchain: BNB Chain\n\nServices: Trading, Staking, Yield Farming\n\nTotal Value Locked: $1,100,000,000\n\nCommunity Following: 2,000,000\n\nBMJ Score: 3.5\n\nCheck out BMJ’s PancakeSwap Investor Scorecard here.\n\nCurve finance is a decentralized exchange protocol where users can swap and trade Ethereum-based assets. It also focuses on providing liquidity to the markets using a market-making algorithm that automatically buys and sells assets while profiting from the bid and ask price spreads, incentivizing users to add their funds to the overall pool and earn interest.\n\nCurve is another relatively new addition to the DeFi ecosystem. It’s large TVL helps lift it in our rankings.\n\nYear Launched: 2020\n\nBlockchain: Ethereum\n\nServices: Borrowing and Lending/Decentralized Exchange\n\nTotal Value Locked: $2,401,000,000\n\nCommunity Following: 354,600\n\nBMJ Score: 3.0\n\nCheck out BMJ’s Curve Investor Scorecard here.\n\nThe first-ever official lending platform on TRON, JustLend enables users to borrow and lend their assets and earn interest on deposits. The overall supply and demand of TRON assets decide the interest rates on fund pools.\n\nWhile JustLend is focused on the Tron ecosystem, this hasn’t kept it from amassing nearly $6 billion in TVL. While the community following is small it is a great choice for anyone focused on the Tron ecosystem.\n\nYear Launched: 2020\n\nBlockchain: TRON\n\nServices: Borrowing and Lending\n\nTotal Value Locked: $5,795,000,000\n\nCommunity Following: 58,600\n\nBMJ Score: 3.0\n\nCompound Finance is an Ethereum-based, open-source money market protocol that enables users to borrow or lend against collateral. Anyone can participate in Compound’s liquidity pool and start to earn interest on their digital asset holdings. The interest rates adjust according to the supply and demand on the platform. Compound supports DAI, ETH, and USDC, among other digital assets.\n\nCompound remains a popular choice for borrowing and lending, but is overshadowed by larger competitors Maker and Curve.\n\nYear Launched: 2018\n\nBlockchain: Ethereum\n\nServices: Borrowing and Lending/Stablecoin\n\nTotal Value Locked: $2,070,000,000\n\nCommunity Following: 850,000\n\nBMJ Score: 2.5\n\nCheck out BMJ’s Compound Investor Scorecard here and Risk scorecard here.\n\nConvex Finance is a DeFi protocol built on Curve finance. Convex protocol maximizes yields by streamlining the boosting experience. Curve LP (liquidity pool) providers can claim boosted CRV (Curve DAO Token) and earn trading fees without locking CRV. Users receive a token called cvxCRV when they deposit a certain amount of CRV tokens into Convex.\n\nMoreover, users can choose to stake cvxCRV tokens and receive CVX tokens as staking rewards along with a part of CRV rewards from Curve through Convex.\n\nConvex is a smaller service due to its ties with Curve. If you’re a frequent Curve user then Convex could be a good choice for you, but its niche status led us to rank it somewhat lower.\n\nYear Launched: 2019\n\nBlockchain: Ethereum\n\nServices: Assets\n\nTotal Value Locked: $1,710,000,000\n\nCommunity Following: 54,800\n\nBMJ Score: 1.5\n\nPopularly known as the “DeFi Smart Layer,” InstaDApp is a DeFi app based on the Ethereum network. It is designed to provide a single, easy-to-use access point to interact with multiple DeFi protocols. Instead of using 2-3 separate apps for lending, borrowing, or staking across protocols, InstaDApp allows users to do everything in one place.\n\nWhile InstaDapp is a great service it hasn’t really caught on as users seem to prefer interacting directly with their lending, borrowing and staking apps rather than using a third-party service.\n\nYear Launched: 2019\n\nBlockchain: Ethereum\n\nServices: DeFi Token, DeFi Smart Accounts\n\nTotal Value Locked: $1,970,000,000\n\nCommunity Following: 47,700\n\nBMJ Score: 1.5\n\nWhat Is Decentralized Finance?\n\nDecentralized finance (DeFi) refers to websites that offer “decentralized” financial tools and services such as investing, borrowing, lending, trading, tokenized real estate, and insurance.\n\nDeFi is a counterpart to traditional finance services, typically centralized through a bank or similar institution. Whereas conventional finance will rely on these institutions to facilitate transactions between parties, DeFi decentralizes these transactions as peer-to-peer through blockchain technology.\n\nThere’s a lot of potential in the DeFi space, and the data from the last three years validate this.\n\nThe Total Value Locked (TVL) in DeFi protocols was under $1 billion in January 2020. Spurred by frenetic activity in the crypto markets during the COVID lockdowns, it surged to $248 billion by November 2021 – a phenomenal 350x rise in 22 months.\n\nBy 2022, the crypto bull run had run its course, and a crypto winter hit the market hard. Although DeFi was also affected (TVL had dropped to just around $42 billion), the numbers remain significantly higher than in 2020.\n\nBut, even as centralized platforms like FTX have collapsed, the allure of DeFi remains strong. TVL surpassed $50 billion in Q1 2023, indicating sustained interest in decentralized crypto platforms.\n\nLiquid staking projects, in particular, have thrived in the past year. With a current TVL of $17.67 billion, this market sector has returned almost 300% over the past 12 months. Over the next decade, the DeFi market is expected to surpass $232.2 billion, with a CAGR of at least 42.6%.\n\nHow Do I Get Involved with DeFi Platforms?\n\nThere are various ways to get involved with DeFi platforms:\n\nEarning Yield : One way to earn “interest” on your crypto assets is by depositing them in DeFi platforms such as Aave or Compound , which will pay you an Annual Percentage Yield. (See our current list of Best DeFi Rates .)\n\n: One way to earn “interest” on your crypto assets is by depositing them in DeFi platforms such as or , which will pay you an Annual Percentage Yield. (See our current list of .) Liquidity Mining : This allows users to earn yield for providing liquidity (capital) to a liquidity pool on a DEX (Decentralized Exchange). Users may also be rewarded in the DEX’s in-house token, which may increase in value, like owning “stock” in the company. (See our list of Top Dex Aggregators .)\n\n: This allows users to earn yield for providing liquidity (capital) to a liquidity pool on a DEX (Decentralized Exchange). Users may also be rewarded in the DEX’s in-house token, which may increase in value, like owning “stock” in the company. (See our list of .) Trading on DEXs: Decentralized exchanges let people directly trade with each other, unlike centralized exchanges. You can often trade smaller coins on DEXes you won’t find in centralized exchanges.\n\nThe sustained interest in DeFi projects is encouraging for crypto investors. With the constant innovation and evolution of these decentralized financial services and the addition of new protocols, the DeFi space remains one of the most exciting areas to watch.\n\nInvestor Takeaway\n\nDeFi isn’t just randomly buying crypto and YOLO’ing for the best. It’s seeing opportunities in new markets and technologies and supporting well-managed organizations doing the same.\n\nAs the federal government argues over regulations and new designations for these assets, the role of DeFi in organizing and facilitating investments will just grow.\n\nThe platforms covered here are major players in the game. However, investors must do their due diligence and understand their expectations and needs before deciding on investing in any of them.\n\nThe fundamentals are here, and the future looks bright for DeFi.\n\nWant to get more insight on DeFi? Subscribe to Bitcoin Market Journal and get investing tips delivered straight to your inbox."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOV2EwRHhzYTRFRm9meXJyNzdiMFhIbWkxV1NvTWdjY3l2cl9ha29qdDIxWEltUUJ4WTZLTVpqM281REtFXzktcFlpY0ZTMVJwUHRvZWtVMUhQYV94WXV2Yjd3elNhdEtMd2s0N3RfVXNVLWhhVEVCN2wyTXY4QngtTGtTYXJsdE96Tkc4eHpHSUVHaURMc1NRWVRpYW9SSjVhbEYtZXUxRURXbmdnWUpkMXFiUUFYODcxazBn0gHAAUFVX3lxTE8yZ08zUUF3eHVraEhvbXVHeUxVakZnZTh3WlBEWm5lckh0Vk9qaHZXV0ZQRVdEOVd6LWI5YktWNlBpTnh0ckhWUWxCb200VHFCaWtpVW1sbTZIMmwxek53cXZldGJfQlJUWWViTlFEQ2dCdVBXeEtHSXhaTDltVlVPd3ZiSkV2YmZLZWZqZEhLNUh4aUtRVFZiV3RWYXJpelU4ZGtCbDc1RDJ6T0JrcXU3NTJfZWRHc014NG1WWngweg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Zircuit, New ZK Rollup Backed by Pioneering Layer Two Research, Launches Public Testnet - The Daily Hodl",
        "content": "November 9, 2023 – Grand Cayman, Cayman Islands\n\nZircuit – a new zero-knowledge rollup backed by pioneering layer two research – today announced the launch of its public testnet.\n\nZircuit is fully EVM-compatible, supports existing Ethereum DApps and wallets and allows any DApp on Ethereum to deploy on Zircuit with minimal changes.\n\nTo celebrate the launch, Zircuit will be hosting a multi-day event during Devconnect that begins on Monday, November 13, 2023.\n\nOver the last one and a half years, the Zircuit team has been pioneering various research initiatives such as rollup security tooling, rollup compression and scaling cryptography.\n\nThis work led to grants awarded by the Ethereum Foundation for layer two research.\n\nZircuit’s upcoming testnet synthesizes the team’s research advances and new technology to create an evolved layer two environment for developers.\n\nHarnessing these research advancements, Zircuit uses a hybrid approach that combines the latest zero-knowledge proofs with optimistic infrastructure.\n\nMore efficient proof generation results in reduced fees and the development of new compression algorithms increases transaction speeds and saves users gas.\n\nThis state-of-the-art integration allows developers to move popular DApps directly over to Zircuit without making costly changes.\n\nZircuit provides the perfect place for developers to battle-test their DApps before launching on Ethereum mainnet.\n\nBy having security at the sequencer level, Zircuit will block any malicious transactions while still allowing developers to see an attempt to hack.\n\nTransactions on Zircuit are cheap, and setup on Zircuit takes minutes, making it a quick, low-risk solution for developers who want to experiment.\n\nThe unique combination of rollup and ZK technology in Zircuit provides a streamlined experience for end users as well.\n\nEthereum applications can seamlessly deploy onto Zircuit without learning a new programming language or framework, which makes it so Zircuit can easily stay up to date when popular Ethereum applications have updates.\n\nThis compatibility gives users the ability to enjoy the new features, speed and cost benefits of these DApps without having to learn anything extra.\n\nDr. Jan Gorzny, head of layer two scaling at Zircuit, said,\n\n“Our research on rollups led us to create a [layer two] scaling solution that is breaking new ground and paving the way for a new generation of rollups. It’s taking the existing technology further and easing use for both developers and DApp users.”\n\nZircuit invites developers and projects from across the Web 3.0 ecosystem to participate in its testnet.\n\nProjects will receive assistance and incentives such as onboarding, readiness support and developer workshops.\n\nDuring Devconnect, Zircuit is hosting a four-day event where attendees will have the chance to learn more about the testnet launch, engage with the Zircuit team and mingle with fellow members of the Web 3.0 community.\n\nTickets are available here.\n\nTo learn more about Zircuit, visit the website or read the developer docs here.\n\nAbout Zircuit\n\nZircuit is a fully EVM-compatible zero-knowledge rollup powering the limitless potential of Web 3.0.\n\nBacked by pioneering layer two research, the network’s unique hybrid architecture combines optimistic infrastructure with zero-knowledge proofs to give developers the best of both worlds.\n\nWith cutting-edge performance and security at the sequencer level, users can explore new frontiers with faster transactions, reduced fees and complete peace of mind.\n\nTo learn more, visit the links below.\n\nWebsite | Twitter | Discord\n\nContact\n\nJessica Graber, PR strategist at Zircuit"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQQnV0bVM2eUllV1VqUnV4R20zS3pFdTFTeU1EQVhwb2tNZHNMcDI3VmhLUFNkWk1VeExHQmlBT3RkVmRVNlJjTkxrWllQMVFsRkx2SVJocHBnaEM4UHZDN0pQVkNGSENYNWo1a3hoN2t4U0U3OFdNME1IZEFoSjlUdDAtbzR1Q05iOFFaT3JqdThKV25sMDFtWjA1VGVwSGRJeWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "A16z Crypto Leads $4.2M Seed Round for Web3 Infrastructure Startup Pimlico - NFT News and Insights from the Industry - NFTgators",
        "content": "Quick take:\n\nPimlico has raised $4.2 million in a seed round led by A16z crypto.\n\nThe Web3 startup hopes to provide the infrastructure required for the next generation of smart contracts leveraging the ERC-4337 standard.\n\nThe platform’s early adopters include the self-custody wallet, Daimo and Patch Wallet, which allows users to receive payments using their social handles.\n\nPimlico has announced a $4.2 million seed round led by A16z Crypto. The UK-based Web3 infrastructure startup hopes to provide the infrastructure required to power the next generation of Ethereum smart accounts leveraging the ERC-4337 standard.\n\nThe ERC-4337 standard is a modular Ethereum standard created with the new generation of crypto wallets in mind. The standard was co-authored by ERC-4337 standard, co-authored by Vitalik Buterin, Yoav Weiss, Dror Tirosh and Pimlico co-founder and CEO Kristof Gazso.\n\nWith the new standard, “smart accounts introduce completely customizable logic, unlocking capabilities such as gas sponsorship, gas payments with ERC-20 tokens, better account recovery, spending thresholds, FaceID or passkey verification, among many other use-cases we expect from our accounts,” Gazso wrote in a blog post on Tuesday.\n\nThis fundraising also comes on the heels of the company’s launch of permissionless.js, its library of tools dedicated to helping developers build wallets and decentralised apps using smart accounts.\n\nThe company has already signed up two early adopters to its platform. Daimo is a crypto self-custody wallet created to address one of crypto’s main use cases P2P payments. On the other hand, Patch Wallet allows users to receive payments using social handles and email addresses without creating a crypto wallet beforehand.\n\nThe process of creating a cryptocurrency wallet has been one of the biggest barriers to entry into Web3 for non-crypto native users.\n\nPimlico plans to use the capital to accelerate the development of its platform as it seeks to “redefine smart accounts and the way people transact on-chain.”\n\n“We’re proud to be working with a16z — they have established themselves as one of the most long-term oriented investors in the web3 space and we have thoroughly enjoyed working with them both during their Crypto Startup School and after,” Gazso wrote, adding “This investment is going to further accelerate our plans of building the most world-class team to make web3 more usable.”\n\nStay up to date:\n\nSubscribe to our newsletter using this link – we won’t spam!"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiTkFVX3lxTE5VdFpFQkVMbzd3S0U4aUczVE9kdldTaXNHYjNnelVXcGd4NG1EZEpzRGl2U2FPckQwaWlFNkUtLVB5dDRBaldJYlVBR2F1QdIBU0FVX3lxTE9XYnpNeFlEbkl5NVR2eXVTWE1uM0ZRV0hvWE03bkV6SDY3ZnplTDJYS2RDS1Rta3Rud3pfc2VtVnJuem9SZGtmUTlFMnJ6OWtIb2pZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 13:31:21 GMT",
        "title": "Top Crypto DEX Aggregators for 2024 - CoinGape",
        "content": "Editorial Note: The Coingape Marketing Editor Team provided a neutral viewpoint when creating the content. Though we receive commission for sponsored additions, this has no bearing on our assessments of the subject.\n\nThe advent of decentralized exchanges gave birth to DEX aggregators. Currently, the trading value of DEX aggregator is over $2.03 billion. These aggregating platforms bring forth a seamless trading process. It ensures liquidity and offers users an enormous range of tokens and assets. By taking advantage of evolved algorithms and smart contracts technology, these DEXs enable quick transactions across multiple platforms. What makes our list unique? While searching for the best DEX aggregators, we found various influential factors that helped us shortlist the below-mentioned list. The first item on our list was to understand how efficient the aggregator is, followed by fees, MEV (Maximum Extraction Value) protection , and another important factor. Here, you will find everything that is essential for a DEX aggregator.\n\nNeeti Neeti has been crafting engaging and informative content over seven years in the crypto and blockchain industry. With her extensive experience and a versatile writing style, she has helped many blockchain enthusiasts across borders understand the niche elaboratively. Whether delving into the depths of technology, exploring the intricacies of human psychology, or unravelling the mysteries of the natural world, she thrives to remain steadfast in the pursuit of excellence.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNZER6RzJGREhESW9uV2RUczVuSGJ4b09rSlB5eUk5eU9ubXJUWGZFb25Zc2VIOVJwRDRfLUFwXzZRS3d6OWlncTl3OWJXLXNhcG9rRklCUWpVaFRXblZ2dm11Z3ZRbWFQYm5NcHNXRUNiYmRtdzBnNG1Rbjl1QTdkLWh5TjBOSGJD0gGOAUFVX3lxTE9uSEZrbDJzeXgxVHJZelcxeUhqSVJlWm5JNE80TnRGc3FhaXBQQU90bUh2UzNsXy14NlVSSURuWXBXQlZyc3lVYXh2cElsQ2xNMzc2d0tBT3JDTkstZEF5ZTJ1VTNONUJTdGx0aFhBOE56bGREQkgxQUtlZk5VUEIxRjVIdm02U29fVXlFd0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "What Polygon’s partnership with Near Protocol means for you - AMBCrypto News",
        "content": "The new zkWasm solution would enable Near Protocol to access Ethereum’s big liquidity pool.\n\nPolygon developers will have the option to build using the programming language of their choice.\n\nEthereum [ETH] scaling solution Polygon Labs [MATIC] announced a partnership with layer-1 blockchain Near Protocol [NEAR] in a bid to boost cross-chain interoperability.\n\nAs per details shared in a blog post, the two entities joined hands to develop zkWasm, a zero-knowledge (ZK) protocol for WebAssembly (Wasm) blockchains. The aim was to bridge the gap between Wasm blockchains and Ethereum ecosystem.\n\nLet’s understand the tech of it all\n\nIt’s well known that Ethereum pioneered the development of decentralized applications (dApps) through Ethereum Virtual Machine (EVM) – the standard on which all protocols on Ethereum run.\n\nOwing to the popularity and apparent interoperability benefits, many other blockhains like the BNB Chain [BNB], Avalanche [AVAX], and Polygon, became EVM-compatible.\n\nWhile thousands of dApps have reaped the benefits of EVM, the solution began to show its limitations in recent years.\n\nOne of the foremost was the lack of popular language options available to developers apart from Solidity. It was a time-consuming and difficult process for anyone who wished to use a different language to work in this ecosystem.\n\nThe Wasm technology has been viewed as the main competitor to the EVM. Wasm expands the family of languages available to smart contract developers to include Rust, C/C++, and C#.\n\nThe high-performance framework has been used for running complex programs in web browsers, including Google and Mozilla.\n\nA new feat in cross-chain interoperability\n\nInterestingly, Near Protocol allows developers to employ the Wasm technology to build dApps. The new zkWasm solution therefore intended to act as the bridge, enabling Near to access Ethereum’s big liquidity pool.\n\nMoreover, the collaboration would give additional options for Polygon developers. Polygon co-founder Sandeep Nailwal, while responding to the news of the partnership, said on X (formerly Twitter),\n\n“Polygon Ecosystem gets Wasm appchains, perhaps even with Near mainnet codebase, where devs can build a sharded smart contracts platform where app devs can build smart contracts using any programming language of their choice like C++, Rust, and many others.”\n\nFurthermore, developers would have the flexibility either to launch an EVM chain, or build a WASM chain for closer Ethereum alignment and access to liquidity.\n\nAccording to an official X post by Near Protocol, the product was under development as of press time and slated to launch next year.\n\nThe partnership was just one of many initiatives undertaken by Web3 companies to strengthen cross-chain interoperability. The hot trend could pave the way for creation of powerful new products and services that leverage the benefits of multiple networks simultaneously.\n\nMATIC reacts positively\n\nThe news of the deal increased demand for Polygon’s native coin, MATIC. The cryptocurrency jumped 8.39% to $0.82 at press time, the highest since mid-July, according to CoinMarketCap.\n\nThe thirteenth-largest crypto by market cap benefitted from the prevailing bullish sentiments in the market. Since the 19th of October, MATIC has increased by more than 60%, making it one of the top performing altcoins.\n\nNotably, whale accumulation has assisted the growth significantly. According to on-chain analytics firm Santiment, wallets holding between 100,000- 10 million MATICs added 42.88 million coins in the last two weeks.\n\nAdditionally, 161 whale transactions worth more than $100,000 were recorded on 8 November, the highest since July.\n\nRead Polygon’s [MATIC] Price Prediction 2023-24\n\nOn the other hand, NEAR saw a comparatively subdued response. The coin was exchanging hands at $1.5 at press time, with gains of just 2.28%.\n\nHaving said that, the broader market bullishness turned the fortunes for NEAR as well. The coin enjoyed monthly gains of nearly 39% at the time of writing."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9iRjdaRklpZlUtM3ZFUU1tbFh6V05xUjBNZndjQlZSUXlZSk5HV1h1enlPVFV3bjBwbjM1LW4zeU4yMGNYeHl3QUd3bmRteklfanlaREdCU0pLeE1EQ3huTnlicGNRdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "NEAR Foundation launches NEAR DA to offer secure, cost-effective data availability for ETH rollups and Ethereum developers - CIO News",
        "content": "NEAR moves into the modular blockchain landscape with the lowest-cost DA offering in the Web3 market today.\n\nNovember 8th, 2023, at 2:30 p.m. Lisbon time, NEARCON: The NEAR Foundation today announced the rollout of the NEAR Data Availability (NEAR DA) layer, a groundbreaking innovation that offers robust, cost-efficient data availability for developers building Ethereum rollups.\n\nLaunched with Madara by StarkNet, Caldera, Fluent, Vistara, Dymension RollApps, and Movement Labs as its first users, NEAR DA’s entry into the data availability landscape builds upon the NEAR Protocol’s 3+ years as an established, secure, and reliable blockchain with 100% uptime. NEAR provides all the guarantees of a scalable layer-one network that is also more cost-effective than other DA solutions; for instance, posting rollup data on NEAR would be 8,000 times cheaper than posting on Ethereum.\n\nDesigned to scale Ethereum cheaply and reliably, NEAR DA offers immediate benefits to Web3 founders exploring the modular blockchain development landscape. The new layer supports Ethereum L2s that want to continue building on ETH without the high cost of posting data. It will also support high-quality projects looking to launch an app chain or an L2.\n\nThe negligible, predictable gas fees and cost-effectiveness of NEAR DA let developers build more accessible applications for their end-users. As of September 2023, posting 100kB of calldata on Ethereum L1 for optimistic rollups would cost roughly $26.22, while posting the same amount of data on NEAR Protocol would cost $0.0033. Projects can pass those benefits along to their user base while still remaining integrated with the broader Ethereum ecosystem.\n\nIllia Polosukhin, co-founder of NEAR Protocol, said: “Offering a data availability layer to Ethereum rollups highlights the versatility of NEAR’s tech while also helping founders from across Web3 deliver great products that bring us closer to mainstream adoption of the Open Web. NEAR’s L1 has been live with 100% uptime for more than three years, so it can offer true reliability to projects looking for a secure DA while also being cost-effective. NEAR provides great solutions to developers no matter which stack they’re building on, and now that includes the Ethereum modular blockchain landscape.”\n\nBy opening up its blockchain for data availability, NEAR Protocol is expanding its offerings to deliver a modular blockchain development framework that lets Web3 developers and founders continue building on Ethereum while leveraging NEAR’s state-of-the-art technology for one part of the stack, depending on their requirements. NEAR DA expands the capabilities of NEAR’s Open Web Stack, a common entry point where developers and users alike can easily build, browse, and discover Web3 products and platforms. This includes FastAuth onboarding to an account in seconds with zero crypto or seed phrases required, as well as the ability to create decentralized frontends from a library of thousands of components.\n\nDevelopers and founders building on Ethereum rollups interested in using NEAR DA can visit near.org/data-availability to get started.\n\nAlso read: Global AI Solutions, created in India, Aravind Raghunathan Joins Yavar.ai as CTO\n\nDo Follow: CIO News LinkedIn Account | CIO News Facebook | CIO News Youtube | CIO News Twitter\n\nAbout us:\n\nCIO News, a proprietary of Mercadeo, produces award-winning content and resources for IT leaders across any industry through print articles and recorded video interviews on topics in the technology sector such as Digital Transformation, Artificial Intelligence (AI), Machine Learning (ML), Cloud, Robotics, Cyber-security, Data, Analytics, SOC, SASE, among other technology topics."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMi9wJBVV95cUxNLXJtTV93YmJDVFhaQjEyUll1akxxS28wQmhNUGpmMl9aNkQ4dDZodnF0NWhnTzVoNUp6Zkw0NXhXUzhwcWFkX1A4Vm9OcHV3aGkwZjNiR0tXZlQ5c3pDWVNDTC1PXy1RWE0xeUhzRWZVeHEtLVFSYXVXZ2Y4aVMwT0EzOFoxck5sdzlLSnVfMThlOGZHcVh6aWNidUY0XzF6N20tekxfbEVmaHVUWmlsbFB0ZGg5a2pNdF9td0JtcV9COE1QeFVlTEsyMjVZTjFPVGJOUVNjc1VfQzZTWDJURHdzeHpVTlBZYnpzWHU1dXVqdmdsUTlqb0RScFVMWjcyWmVvdVYwN3UtWERpT0E1WkhFNDkwbTVPV1lZRmFkSHZfb05Od2FyZldXNms3cmd6cG16bnJnQlNPTzRQaTA5U2x4a0QwNDdhUGwwS1RXSWh3Z2xlNHhNVnJJSUZQTGxwSkZtOGwwSFBBNTVncDJvUXZsOEU3T1HSAYQDQVVfeXFMTjU4S1NUckRzTmpmckhibGlFNG5aZzZ2ZVpNZWxRS1ItT2pzek1lU0V2b3dHd1o3cTNybUNRWUxoOUJFbXl2QTZvS3FZUmRSX05HWDc1Wm9rR0d5UzlnbjFYR1NFelc5aUFVdUltRmNGYV9uN1B2Z05vM2JZSFVwNEFSRTNOcF9VT1l0RE9jOFhfRF9FdktEblN2bnRfRmVoV003a2RzQzZfdDQzVlBNME1CcnNQWkc3RkVBOWtrVVdUaV9BbGpKaWZxMUV4SzlMZTUyR05xSExaRV9NeF9XcDl2cmZlQ1M3MTMzWDhJa2d2QUdjLXZEZ0JDTHRoODhnSHN1X0pWWlV3aFpRcXZ3Ry02Q3hkN0R4dUFoSEw2SlVDb1hVVU15TjBhXzd4dmZkeG9JMzlnUDB3U3ZrWUR1SlRGOFk2WUlGSzNHZE4zclJ1aW84QUhjTU1DRlgyV2ZMdG9aN0xOb2o1VG9lZlBxRTNoV3I2ZXFBM1U4emdLeVBsMmp0bA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Can these New Coins 1000x in the Crypto Bull Run? Analysis of High Growth Potential Coins and New Cryptocurrencies with Shiba Inu, Pepe Coin, Dogecoin, Bitcoin, Ethereum, and New Trending Crypto Presale ApeMax - Analytics Insight",
        "content": "As the crypto market pulsates with the energy of a potential bull run, speculations are rife about which new coins buyers are seeking out ahead of the upcoming year. While Bitcoin and Ethereum have historically set the stage for massive gains, newcomers like Shiba Inu and Pepe Coin have carved out their own success stories. In this dynamic arena, ApeMax emerges as a trending crypto presale with the potential to join the ranks of the trending new cryptocurrencies."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOeUY3UjJDZ3l4T1pXQWI5QjNxTzdweDdMQ1V1dGJ6ejBfQ2xFMU4yeXFYbW93NGNrSTMzQ1I2eExuTk83Y0V5M0ttSUVPTGV4el9MYTJpRENYVDd3RUNWVzhFLVVNa0R3bXdFQVRXMnpxS0tRQWtoWUJad3diQWRfSTJESDJZVVpUa3RIYUxWZ205cGpqQmljdTFGbzLSAaIBQVVfeXFMUFNhQ05rZ2pMZ3VKRnZsZUlEMEI0ZF8zbHpyU1dCS3oycDZJbmlFTXNQNFVIaXd4cnlsYWF1N2NJal9ZVFRSSnpSdmExMEhtYlR6X0d5Ynd1Qm05ZWpqX3A2M19zbzZzUjFTb0x4bzJRVHFTTTc5cmJrR0Q3djZBMk9qMmw5UmloQ1hkNVpzT2s3MjViOFNxWEpCeUh2LUN3dWx3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "SOL Price Analysis: Ethereum Rival Solana Eyes $50 This Week! - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nStory Highlights The SOL price trend sustains above the $40 mark, teasing a trend continuation to the $50 mark.\n\nSolana coin price trend shows a remarkable channel breakout, with a 145% jump in the last two months.\n\nThe $50 breakout rally in the SOL price can reach the $58.90 mark.\n\nAs Bitcoin resurfaces above $35K again, the altcoins market gets increased momentum and results in a new bullish surge. Riding on the market recovery trend, the SOL coin price trend shows the channel breakout rally bouncing above the $40 mark.\n\nIncreasing the likelihood of a price jump to the $50 mark, the Solana price prediction maintains a bullish end result for 2023.\n\nWith a rounding bottom reversal from $17.76, the SOL price maintains a bullish journey. Following the channel breakout, as the overall market recovery gains momentum, the Ethereum rival continues to grow.\n\nCrossing the 1.618 Fibonacci level at the $40 mark, the bullish trend in Solana shows a successful post-retest reversal. Accounting for a 346% year-to-date jump makes SOL tokens a high-performance investment in 2023.\n\nCurrently, the SOL price trades at $43.18 as the bounce back from $40 continues to form higher highs. Following the overnight jump of 1.87%, the intraday candle teases a Doji candle formation.\n\nTechnical Indicators:\n\nRSI: The daily RSI line sustains a sideways trend in the overbought zone but warns of declining buying pressure.\n\nMACD indicator: The MACD and signal lines struggle to maintain a bullish gap teasing a crossover event. Moreover, the declining trend in positive histograms reflects a decline in trend momentum.\n\nWill the SOL Price Cross $50?\n\nWith a boost in trading volume, the uptrend in SOL price teases jump to the $50 mark. However, the higher price rejections in the recent candles and the lack of momentum warn of a reversal.\n\nConsidering the uptrend regains momentum, the bullish trend can surpass the 2.272 Fibonacci level at the psychological mark of $50. In such a case, the Solana market value can reach the $58.90 mark.\n\nOn the flip side, a downside reversal under the $40 mark can result in a drop to $35."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPZXVHVGtoS1AtQXF4Ty11anZXUGtVaS0zTC1CUDRQRGxtQm5TbnhXazBweUVLRlZpaExySTkwU0xVYllDN0NKOS1jYzdQSHNaQUVhWlRfNXdzU0hrLU1RWnhhT2JnTjk2bnA0YVpleEFwc1NYeXQxTGdqUWhIUnhhMzBBU2FEc2ljV3kyMXcyNXE4eFVnVklJZ2RkUTl4aXViY0dtN19EZGVvSFU4QzZ4UGUwVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "BlackRock registers for iShares Ethereum Trust in Delaware, market reacts positively - Gizmo Times",
        "content": "Continuing its foray into digital asset services, BlackRock, a $9 trillion asset management giant, has officially registered an Ethereum Trust in Delaware. The firm, renowned as one of the world’s largest asset management entities, had earlier made headlines by filing for a Bitcoin ETF with the SEC. The subsequent registration of BlackRock’s iShare Bitcoin Trust came just a week before the groundbreaking ETF filing.\n\nBlackRock, maintaining its status as a major player in the digital asset industry, created a buzz with its initial announcement of the Spot Bitcoin ETF filing. If approved, this ETF would be a pioneering move in the United States. The firm’s recent exploration of digital asset options includes the registration of an Ethereum Trust in Delaware, confirming earlier speculations. Bloomberg analyst Eric Balchunas labeled this move as the “first step towards filing for a spot Ether ETF.”\n\nThe anticipation of BlackRock filing for a spot Ether ETF has long intrigued industry observers. Such a filing, once realized, would not only validate the firm’s position in the market but also underscore its confidence in the long-term potential and impact of digital assets.\n\nFollowing the Bitcoin ETF filing, BlackRock has consistently expressed optimism about the asset’s potential. Despite the SEC acting as a hurdle to the first approval of such offerings in the U.S., many anticipate a change, with approval predicted to materialize sometime this year.\n\nhttps://twitter.com/WatcherGuru/status/1722633082803732553\n\nThe iShares Ethereum Trust has just been registered in Delaware. For context, BlackRock's iShares Bitcoin Trust was registered in a similar manner 7 days before they filed the ETF application with the SEC. Details below. [announcement: I’m moving to @SynopticCom soon] pic.twitter.com/IYafIaxMzA — Summers (@SummersThings) November 9, 2023"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE94VnhyWjZtcjdDNWlBa1dTREFyY1JnalIwd2NrUlJkbG1vZm1uWUZIbjBDUG9ST19fYVJtUjFSdUo3RXBHYWpOaWhkd0tGbEpfcFBQdUtrOE1FV2h10gFgQVVfeXFMTmV2MFFMYTZyUW1QbTB3cEFNbDlJS0lDVDNiOFA0ZTI2cnFyVVF6WFd5WFhBNGQ3UGMyR0lrS2V0bzROdFBLdklZRTRQVjdTREVnaFZpcm12eWh2cUVtRXl1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "What Is Gnosis Safe? - CoinCodex",
        "content": "Safe (formerly known as Gnosis Safe) is one of the most compelling wallet options for users of Ethereum and similar blockchain networks. In this article, we’ll explain what the Safe wallet is and how it can provide additional security to the crypto holdings of organizations and individuals.\n\nWhat is Safe (Gnosis Safe)?\n\nSafe (formerly known as Gnosis Safe) is a smart contract based multi-signature wallet available on a variety of blockchain networks. Before a transaction can be made with the Safe wallet, a minimum number of users must approve the transaction first. For example, a Safe wallet controlled by 5 key holders can be set up to require a minimum of 3 signatures to approve a transaction.\n\nSafe is a very popular option among crypto businesses as well as DAOs (decentralized autonomous organizations). According to data by the project, Safe accounts have handled around 20 million transactions so far and currently secure $45 billion worth of crypto assets.\n\nThe wallet can be used with ETH or tokens that adhere to the ERC-20 standard, and supports a wide variety of Ethereum-compatible blockchains. Some example of blockchains that Safe can be used on include:\n\nThe two types of accounts on Ethereum\n\nTo understand what makes Safe different from an Ethereum wallet such as MetaMask on a fundamental level, we need to understand the two types of accounts on Ethereum.\n\nExternally Owned Account (EOA)\n\nIn Ethereum, an Externally Owned Account or EOA is an account that is controlled by a private key. An EOA can initiate transactions and pay gas fees, but has no code associated with it. When you use a wallet such as MetaMask to generate an Ethereum account, it’s an EOA.\n\nContract account\n\nA contract account is an account that exists as a smart contract, and is controlled with code instead of a private key. Contract accounts can send transactions, but only when “prompted” to do so by a transaction from an EOA. Contract accounts can execute arbitrary logic, which means they can be used to implement a multi-signature scheme or other utilities. When you create a wallet with Safe, it’s an example of a contract account.\n\nContract accounts will likely become the default in the future\n\nCurrently, the Ethereum protocol considers EOAs as the default type of account. However, Ethereum developers are currently working on introducing account abstraction, which would make contract accounts the default type of account. This change is poised to make Ethereum much more user-friendly as it would mean users wouldn’t necessarily need to use private keys to interact with Ethereum.\n\nThis is of course a very surface-level explanation of how accounts work in the context of Ethereum. If you want to learn more about this subject and the ongoing efforts to introduce account transaction into the Ethereum protocol, we recommend you read this helpful article published by MetaMask.\n\nWhat can a Safe wallet do?\n\nAs a smart contract wallet, Safe can be used to setup a multi-sig wallet on a variety of EVM-compatible blockchain platforms.\n\nIn addition to specifying the number of signatures required to approve a transaction from the wallet, a Safe wallet can also include spending limits and organizational hierarchies. Wallets created through Safe can also be used to schedule transactions or send transactions in batches.\n\nWhen it comes to multi-sig wallets such as Safe, we usually associate them with crypto businesses or DAOs where transactions using the organization’s crypto holdings must be approved by multiple individuals.\n\nHowever, it’s also possible to use a multi-sig wallet as an individual to enhance the security of your crypto holdings. For example, you could setup a 2-of-3 multi-sig wallet for yourself, which would require 2 private keys to approve a transaction.\n\nIn this way, you could split your private key backup in three separate locations, mitigating the risk of losing a backup or having it stolen. Even if one of the backups was stolen, that wouldn’t be enough to actually steal your crypto since at least one more private key would be required to approve any transaction. If you combine a multi-sig wallet with highly durable metal crypto wallet backups, you can achieve a very high degree of security.\n\nIn order to create a Safe wallet, you can go to the interface at app.safe.global, select “Create new Account” and follow the provided instructions. Please keep in mind that you’ll need to connect an existing Ethereum wallet you control in order to pay the network fees associated with creating a wallet with Safe.\n\nAfer your Safe account is set up, you’ll be able confirm and execute transactions by using a hardware crypto wallet, or use a software Ethereum wallet such as MetaMask, Rainbow or Coinbase Wallet.\n\nThe bottom line\n\nSafe is a great option for cryptocurrency businesses, DAOs or individuals that are looking to protect their crypto with a more sophisticated setup. However, if you’re just looking for a simple Ethereum wallet and don’t want to deal with the added complexity of a multi-sig wallet, Safe is probably not the best choice for you.\n\nFor most users, an Ethereum wallet such as MetaMask or Coinbase wallet will be a more convenient option. Check out our MetaMask vs. Coinbase Wallet article to learn more."
    }
]