[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQNGhIWktCTG9SWGJORXFka2EyWmRtUmdKVDdfU2dtRGxadjE2SGMxSUV0X1U1QTBDS0lGdkpXeXR2MUxCOXdlcjdsZWNOTHAtSG1DamhMVHQxU1hTYlJObldCR1g4Nm5JNjVYLVRNSGlQSlNQalN5OHRFcjVSZklBMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Ethereum faces a moment of truth with latest crypto rally - Fortune",
        "content": "In early December, the sudden popularity of a new species of NFT called Buterin Cards led Ethereum gas fees—the cost to carry out a transaction on the blockchain—to briefly soar to around $10. Even though the fees soon fell back to around $1, the episode was an unpleasant reminder of earlier crypto booms when Ethereum became practically unusable just as it was soaring in popularity. This famously occurred with the arrival of an early NFT package known as Crypto Kitties in 2017, and with the massive speculative frenzy of the 2021 crypto bubble.\n\nDuring those earlier episodes, Ethereum boosters begged for understanding since the blockchain, which was the first to popularize smart contracts, was still a new technology. The crypto world was largely understanding since growing pains for a project of this scale are inevitable, and due to the specific challenge of the “blockchain trilemma”—an axiom that says it is easy to build for two of the three qualities of speed, security, and decentralization but not all three. As we appear to be entering a new crypto bull market, though, it’s not clear if people will be as patient.\n\nThe frustration around gas fees is partly a financial one—no one likes to pay more than they expect. But it’s also rooted in a philosophical disconnect: The promise of Ethereum is that it’s supposed to be a cheaper and safer technology than the conventional financial system. The reality for many people who first try Ethereum, however, is that the proposed gas cost exceeds the cost of the underlying transaction.\n\nI asked Paul Brody, an Ernst & Young executive who has written a well-reviewed book titled Ethereum for Business, to see if he is concerned that the blockchain’s ongoing gas headaches might mean it is running out of time to prove it is ready for primetime. He told me he is not, pointing to the flourishing layer-2 ecosystem, which lets users carry out the bulk of transactions on auxiliary blockchains like Optimism at a fraction of the cost. Those transactions are then bundled up and stamped on the main Ethereum blockchain, providing the same immutable record.\n\nLayer-2 technology has indeed grown by leaps and bounds since 2021, spurred in part by Ethereum’s successful switch to a proof-of-stake model for its blockchain, and costs on the side chains are far lower. But as I pointed to Brody, the experience of using a layer-2 chain is still clumsy and complicated, and off-putting to nontechnical people.\n\nBrody acknowledged that the L2 experience remains “absolutely horrible” but says this is only a temporary situation, and that it won’t be long until it becomes abstracted away with better designs. Meanwhile, he added that Ethereum remains the dominant smart contract for companies by an order of magnitude, and that this growth will only continue—a refutation of claims by Solana and other rivals that tout their lower gas costs as proof they can replace Ethereum.\n\nFor now, Brody appears right that Ethereum remains in the pole position when it comes to being the world’s go-to smart contract platform. That said, if the next crypto boom is once again defined by eye-popping Ethereum fees, patience will begin to run out.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nThe SEC asked a Washington, D.C., court to incorporate admissions included in Binance's recent settlement with the DOJ, claiming they strengthen its ongoing case. (Bloomberg)\n\nPudgy Penguins, a rare recent NFT success story that includes the sale of stuffed characters in Walmart, announced it will soon launch an interactive digital world. (CoinDesk)\n\nIn a possible sign of an effort to be more conciliatory with regulators, Tether says it is freezing the wallets of individuals sanctioned by U.S. financial crimes watchdog OFAC. (The Block)\n\nThe departure of one-time fixtures of the crypto world like Sam Bankman-Fried and Changpeng Zhao has led some to see a \"power vacuum at the top of the crypto industry.\" (NYT)\n\nBitcoin briefly fell 7% before clawing back some of those losses to sit around $42,000, a likely sign of traders taking profit in an overheated market. (Bloomberg)\n\nMEME O’ THE MOMENT\n\nComplaining about the price of gas:"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNSnlKVGRjSW9xeHpfM1Fac0FwN01VWGxCUVU4dE1TZkdrUWlBOFpkdkp0TmdER3kyS1EzUTNUZ0Yzb2Vyenh6RkJsYkZUcUo0V3BaZk9ENmtiRGc0OGZySnFNSERFX3BSQ2dOTWx5RWY5Z1ViSmNaSmM0ekNuWHJtbGxSVF95LXN3R3UzN0I0b0JRMVNRc1J3SXNtMmlEdWlUdm14ZHUyQWxMd2hkZzYwVndJcjdTbXp4SEdZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Ethereum ETF: How BlackRock's Proposal Affects Crypto's Outlook - U.S News & World Report Money",
        "content": "At $9.4 trillion in assets under management, U.S. investment behemoth BlackRock Inc. (ticker: BLK) is the largest money manager in the world.\n\nJust about all of that money percolates in traditional financial market channels, like stock, bonds, funds, currencies, derivatives, real estate and commodities. For years, nary a word was spoken (to the masses, at least) about BlackRock steering mountains of cash into cryptocurrencies.\n\n\n\nBut if you look closely, hints have been dropped about the investment firm's rising interest in crypto in the past few years.\n\nA case in point: In November 2020, Rick Rieder, BlackRock's chief investment officer of global fixed income, said Bitcoin had the potential to \"take the place of gold to a large extent.\" BlackRock CEO Larry Fink has also weighed in on crypto, noting that original crypto Bitcoin (BTC) was resonating with the public and may one day create its own global market. In December 2020, BlackRock left another crypto clue, advertising for a vice president of blockchain who would ostensibly drive \"strategies designed to drive demand for the firm's offerings.\"\n\nBlackRock's Bid for a Spot Ethereum ETF\n\nSponsored Crypto Exchanges 1 Gemini Account Minimum $0 Fee 0.2% Maker Fee / 0.4% Taker Fee Gemini is well-suited for crypto traders of any skill level and available in all 50 states. Sign up and trade to get $10 in bitcoin. Open An Account 2 Kraken Account Minimum $10 Fee 0% to 0.4% Easy, Fast, Secure Crypto Trading of 200+ Cryptocurrencies. Made for Beginners and Experts Alike. Open An Account View Disclosure 3 Coinbase Account Minimum $0 Fee 0% - 3.99% Get up to $200 in crypto. Open An Account View Disclosure\n\nBlackRock announced in November 2023 that it filed for a spot Ethereum (ETH) exchange-traded fund, and with that action the company's cryptocurrency vision has begun to crystalize. After all, it wouldn't roll out a new crypto ETF if it didn't believe in the market where it operates, would it?\n\nBlackRock is not the only horse in the race for the first spot Ethereum ETF, however. Asset manager Grayscale Investments, which recently won a landmark legal victory against the U.S. Securities and Exchange Commission (SEC) in its bid to move a spot Bitcoin ETF into fruition, is also pursuing a spot Ethereum ETF. On Dec. 5, the SEC gave itself an extension to reach a decision or extend the deadline for the ETH ETF until January 2024.\n\nBlackRock filed for its iShares Ethereum Trust to be listed on the Nasdaq and proposes to turn it into a spot ETF. Days later, Fidelity put in its own application for a spot Ethereum ETF, and at least five other top investment houses are now also in the running.\n\nThe SEC has yet to give the nod to either a spot Bitcoin or a spot Ethereum ETF, which would directly own Bitcoin and Ether rather than futures tied to the cryptos. There are several popular ETFs already in existence linked to cryptocurrency futures.\n\nSpot Bitcoin ETF Appears Poised for Approval\n\nBlackRock's spot Bitcoin ETF application is also in the works, as are talks between the SEC, Grayscale, Fidelity and others that have filed spot Bitcoin ETFs and progressed into a discussion of technical details, an indication that they may soon be approved, according to a Dec. 7 Reuters report.\n\nWhat's not as clear is what these high-profile entries into the market mean for cryptocurrency investors, prices, and public policy risk and regulation oversight.\n\nIndustry investment experts say that it should mean a shot in the arm for crypto in the short term – and maybe a lot more.\n\n\"Companies like BlackRock recognize the potential for market growth and the opportunity to profit from it,\" says Adam Berker, senior legal counsel at global payments platform Mercuryo. \"Consequently, they aim to be the first to penetrate the market and secure an advantage. Moreover, they already possess the necessary infrastructure, funds and investors to succeed and influence the further development of the crypto industry, given their heavy weight in the financial industry.\"\n\nEven more significantly, BlackRock's Ethereum ETF move could be seen as a new phase in the crypto industry's evolution. \"Large institutional investment funds are entering the market, prepared to invest their clients' money and influence the market's direction,\" Berker says.\n\n\"The foray of institutional giants like BlackRock into the crypto market signifies the mainstreaming of cryptocurrencies as an asset class,\" says Nic Puckrin, CEO and co-founder of Coin Bureau, a cryptocurrency education platform. \"This strategic interest from large capital allocators signals a positive endorsement of the crypto industry, highlighting its growing acceptance and recognizing its potential for traditional hedge funds and investors.\"\n\n\n\nHow Would a Spot Ethereum ETF Impact Markets?\n\nWho benefits the most and who absorbs the largest risk regarding BlackRock's proposal for a spot Ethereum ETF? While nothing is guaranteed in the often-volatile cryptocurrency market, here's an \"impact\" list:\n\nImplications for the Cryptocurrency Market\n\nCrypto industry experts say BlackRock's potential introduction of a spot Ethereum ETF should drive the market forward significantly. BlackRock and Fidelity applying for spot crypto ETFs, as opposed to crypto futures ETFs, sends a message to the financial world that cryptocurrencies as an investment vehicle have matured to the point that established institutions feel comfortable diving in.\n\nIf a BlackRock or Fidelity spot crypto ETF rolls out, the floodgates could open, allowing billions of dollars of new capital to have access to this uncorrelated asset class. So, in short, prices could go up.\n\nEffect on Cryptocurrency Risk\n\nWhile it's no secret that cryptocurrency is volatile, having the BlackRock brand and other big names in the crypto market should provide some price stability, experts say, as the relatively small pool of crypto owners expands to give access to more people.\n\nIn the case of a U.S. spot Bitcoin ETF, for example, Galaxy Research estimates that the addressable market size would be roughly $14 trillion in the first year after its launch, reaching $39 trillion by its third year. That's a lot more crypto investors having a much bigger hand in the direction of assets.\n\nImpact on Cryptocurrency Prices\n\nCrypto experts generally view the BlackRock ETF play as a positive one across the board, price-wise.\n\n\"We can expect major cryptocurrency prices to spike in the short term,\" says Habeeb Syed, an associate attorney at Sutter Law PC, which regularly services blockchain clients. \"Medium to long term, expect sustained increases in BTC and ETH with the normal consequential rises in other crypto as the market sees an influx of value based on the two major cryptocurrencies.\"\n\nThat rise has already started, as Bitcoin's price popped above $44,000 late last week, and retreated just below $42,000 as of the morning of Dec. 11.\n\nOther professional cryptocurrency trackers concur, noting the \"trust\" issue leans toward the market with a BlackRock presence.\n\n\"Although we don't like to speculate on price action, we do believe that the crypto ETFs will have a positive impact on the industry and market overall,\" says Nathan Leung, a crypto educator and lead content creator at Cryptonauts, a YouTube platform that covers blockchain and cryptocurrencies.\n\nA stable level of trust from retail investors is extremely important because they are the key to mass adoption, Leung notes.\n\n\"Everyone has heard of crypto at this point, including your aunt and grandmother at family gatherings,\" he says. \"But their perception of crypto varies, and the sentiment is mostly negative surrounding our industry. An ETF approval would boost the level of trust immensely, having a domino effect on the rest of the market.\"\n\nWhat Risk Is BlackRock Taking With a Spot Ethereum ETF?\n\nThe biggest risk BlackRock faces is their ETF investors thinking they can stomach a 50% drawdown but then getting squeamish and pulling out at the bottom, causing negative sentiment toward BlackRock and the asset class as a whole, experts say.\n\nHowever, BlackRock entering the fold may mark a level of maturity for the industry, limiting future drawdowns to normal percentages akin to real estate investment trusts and small-cap stocks.\n\nWhat a Spot Ethereum ETF Means for the Second-Largest Crypto\n\nOften languishing in the shadow of Bitcoin, Ethereum could find its time to shine, but there are caveats.\n\n\"Ethereum is just the next big thing after Bitcoin and one of the assets in the space least likely to be classified as a security given its decentralized nature and active and widespread use,\" Syed says. \"If you're putting in the time and money to start an ETF, you don't want those efforts wiped out by a surprise SEC ruling.\"\n\nYet, with a green light from regulators, Ethereum could significantly benefit from its Fidelity or BlackRock ETF connection.\n\n\"Ethereum, the second-largest and most widely recognized cryptocurrency following Bitcoin, presents a valuable platform for BlackRock to enter this market,\" Berker says. \"Beyond its recognition, Ethereum provides substantial liquidity.\"\n\nThat means investment funds can purchase Ether in advance to establish a liquid reserve. \"When they decide to act, this reserve guarantees a robust market for transactions, offering an advantage over other altcoins,\" Berker notes.\n\nImpact of Spot Crypto ETFs on Everyday Investors\n\nBig moves from big investment firms have a ripple effect on Main Street investors, and BlackRock's new Ethereum ETF should be no different.\n\nAs with any investment, retail investors should keep a cool head if a spot Bitcoin or Ethereum ETF goes live. \"While the news about ETF approval will positively affect the development of the crypto market, it is also vital to consider the progression and continuity of such news,\" Berker says.\n\nMany investors will understandably assume that after a spot ETF has been approved, the price will be going up. But that's not necessarily the case."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1SVVJ2eVhWY1BPSnRzMUpFZ3ZBLUF0MTl0YlVMTkI2anRiR3R4RzQtQjFoNkJYZVA1bjROQVlfdkwxaU5rdTUwMnowYmlhWEFxR21PaGk4N0lIMjdrcmIwRTNLaEZNOG4ta1l3MjJFN0hIT3o5Tmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Dec 2023 08:00:00 GMT",
        "title": "Web3 Watch: Solana and Bitcoin top Ethereum in NFT sales - Blockworks",
        "content": "This week’s Web3 watch begins with a significant shift in the NFT marketplace. Ethereum, traditionally the frontrunner in NFT trading, has seen a downturn in sales volume, facing competition from two emerging players.\n\nThe Bitcoin network witnessed a surge in digital art collectible trading, primarily driven by ongoing interest in ordinal inscriptions. Ordinals allow users to mint NFT-like assets directly on the Bitcoin blockchain. The past month has seen a 500% increase in sales volume for this asset class, eclipsing Ethereum’s figures over the same timeframe.\n\nThe popularity of Bitcoin’s cheap-to-mint ordinal inscriptions has led to a significant increase in demand on the network. This trend reflects a broader shift in the digital collectibles market, where novel and cost-effective methods of NFT creation and trading are gaining traction.\n\nRead more: Sotheby’s announces its first Bitcoin Ordinals sale\n\nThe Solana blockchain has also stepped into the spotlight, recording higher NFT trading volumes than Ethereum on Friday. This increase in Solana’s trading volume is the culmination of a banner week for the network.\n\n“Something that’s obviously interesting and different in the ordinals space versus every other popular blockchain is that your NFTs are actually stored on-chain versus in smart contracts-enabled ecosystems, [where] they’re stored on some decentralized server like IPFS,” Sarah Satoshi, the head of business development at ordinals marketplace Gamma.io, said. “I think that’s one of the factors that attracts a lot of people.”\n\nLiquid staking protocol Jito executed an airdrop on Thursday, distributing $165 million worth of its native token to users. The following day, Solana saw a spike in its NFT sales, processing nearly $15 million in transactions.\n\nThere was a marked increase in activity on Tensor, a Solana-based NFT market, which may have been fueled by speculations of another potential airdrop.\n\nOn Friday, “Tensorians,” a Solana-based NFT collection, topped the sales volume charts according to CryptoSlam. The collection’s sales volume rose over 100% in the past week.\n\nPudgy Penguins takes up the Webkinz model\n\nThe NFT collection Pudgy Penguins debuted an online open-world game called Pudgy World Alpha at Art Basel Miami.\n\nThe game lets players control avatar lookalikes of the penguins, but users don’t need to own an NFT to play.\n\nPudgy World builds on the NFT collection’s partnership bringing toy versions of Pudgy Penguins to Walmart stores. Each toy comes with a QR code that claims a Pudgy Penguin character inside of Pudgy World.\n\nEvery toy corresponds to a Pudgy Penguins NFT, and holders receive licensing royalties on their corresponding toys, the project said in a press statement.\n\nOne interesting stat:\n\nInterest in Bitcoin ordinals dramatically increased the blockchain’s mempool to an all-time high. Mempools collect all unconfirmed transactions waiting to be validated and added to a blockchain. When too many transactions are added, it becomes congested, leading to slower processing times and higher fees for prioritizing transactions.\n\nAlso of note:\n\nRecordpool released the Jackson 5’s first ever studio recording as a digital collectible on Web3 music marketplace anotherblock.\n\nThe digital art arm of Sotheby’s is auctioning off its first set of ordinal inscriptions.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1sVThQalAxaDhhNW1jWG5XbTBoblZWTGl2X0pPREpod01RdklDRW5mcFl5Rm51SE5fSVdPU29GN1JHSlphOGs1N2JPVkRPMGpFcVZDb2R0bmZEZExleS13cHI3NzhYSTJrQnNBeXRXVk92Z0ppTkhBTUtXaEI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Dec 2023 08:00:00 GMT",
        "title": "Ethereum could witness a price dip as whales take profit - crypto.news",
        "content": "Ethereum (ETH) faces possible sell pressure, one crypto analyst says, citing how it surpassed the $2,300 mark. Whales have been actively taking profit, and this could trigger a massive sell pressure on the world’s second-largest crypto.\n\nEthereum price volatility\n\nThe price of Ethereum has been positively impacted by the recent bullish momentum in the global crypto markets, fueled by Bitcoin’s (BTC) surge above the $43,000 price region.\n\nETH maintains a distinctive market position attributed to its extensive developer community, widespread adoption, and pivotal role in decentralized finance (defi) and various blockchain applications.\n\nDespite the current positive momentum, there are apprehensions regarding the potential influence of selling pressure from whales on the cryptocurrency’s price.\n\nAccording to crypto analyst Ali Martinez, whales immediately took profits after Ethereum hit $2,300.\n\nThe impact of significant holders selling could potentially drive down the price of ETH in the coming weeks. In a bearish scenario, the cryptocurrency might retest the $1,555 support level, and sustained selling pressure could push ETH as low as $1,460 within the next two months, the analyst predicts.\n\nDespite these concerns, the overall market sentiment remains cautiously optimistic, leaving room for potential further growth in the cryptocurrency’s price.\n\nAs #Ethereum surpassed $2,300, $ETH whales began to book profits. This surge in selling pressure might soon start to impact the #ETH price. pic.twitter.com/sdrvT2vcCe — Ali (@ali_charts) December 10, 2023\n\nAlthough Ether’s market capitalization of $282 billion lags behind Bitcoin’s $857 billion, both networks generate comparable protocol revenues.\n\nIn the last seven days, the Bitcoin network accrued $61 million in fees, while Ethereum accumulated $61.5 million.\n\nIn addition to institutional interest, the price surge is fueled by expectations of an ETF approval from the SEC. Despite the optimistic momentum, there are apprehensions, that the upswing in selling pressure might have repercussions on the ETH price in the coming days.\n\nYou might also like: Ethereum scaling startup Versace Labs secured another $2.3m in seed round\n\nEthereum’s surging network fees\n\nThe rise in Ethereum’s network fees is intricately tied to the expansion of its DeFi ecosystem and the widespread adoption of non-fungible tokens (NFTs).\n\nIncreased defi and NFT activities have driven up network fees, with more individuals engaging in intricate transactions, leading to prolonged periods of elevated fees.\n\nThe creation, transfer, and trading of NFTs involve smart contract executions that consume gas, and the associated costs can fluctuate based on network congestion and gas prices. While Ethereum’s high gas fees pose challenges for NFT creators and collectors, emerging solutions like Layer 2 scaling and gas optimization provide optimism for a more cost-effective and accessible NFT ecosystem.\n\nThe surge in DeFi and NFT activity on the Ethereum network since 2020 has resulted in extensive transaction activity, contributing to the persistently high gas fees.\n\nCurrently, the average gas fee for minting an NFT on Ethereum is around $100, subject to variations based on network congestion, gas prices, and smart contract complexity.\n\nAt the time of writing, Ethereum is trading at $2,348.23, according to Data from CoinGecko."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9kbE45Q19iZEdLVHMyTUsyWFdTQWVpT1E2NlNiSkJaZUp0UHNrX1VuaW5sRFhNSU5TdF9lUFpTU1o5QjQzQnRiQTNudFdXUXB3enJucUg5T2gzR3ZNSG96TUs4VmgtenNsS0hGQklxb1Z4U09KcW930gF_QVVfeXFMUGxUZ0otM0ZiSEdUc1ZsbWRWNFpHbXdRdW1BbUt1RzNzZ3lhNGdxM1JFRzJzUllmeENhT2IybmxWb2NPWVR2QWkyWHJobEJ0dEZ5VEk1WUJGaDQ0alk1T0l3QTZNN2VsQjZFY19aS09DQzZ1Q0JlbmJlNXdIVFlDaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Dip 7% as Crypto Markets Cool - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin fell below $41,000 and Ethereum below $2,200 on Monday as crypto markets took a dive after having rallied for the better part of two months.\n\nBitcoin is currently trading at $40,758, down 7% in the past day. This is after the market already saw $330 million in crypto futures contracts liquidated on Monday morning as BTC fell below $43,000. Total liquidations have now reached $516 million, according to CoinGlass.\n\nStill, the 1-day dip is relative. It's still 5% higher than it was at the start of the month, when BTC was changing hands for $38,688. The same can be said of Ethereum, which has lost 7% since yesterday and is currently trading for $2,185. That's 7% higher than what it started the month at, according to CoinGecko.\n\nThe global crypto market capitalization, which has hovered around $1 trillion for the better part of the year, now sits at $1.6 trillion—down 6% since yesterday.\n\nAD\n\nAD\n\nElsewhere in the market, alts were taking a beating. ORDI (ORDI), which last week saw explosive growth and set an all-time high of $68.37, has slumped 14% in the past day. The token, easily the most popular BRC-20 token built on Bitcoin’s Ordinals protocol, is now trading for $45.11.\n\nPepecoin (PEPE), which last week jumped 26% during a spike in meme coin activity, has also cooled off. As of this writing, it has fallen 13% in the last day and is trading for $0.00000138.\n\nEven as the some of the largest digital assets by market cap take a hit, there's been good news for some alts.\n\nA new report from digital asset manager CoinShares finds that institutional investors have been especially keen on Solana (SOL) and Avalanche (AVAX). Exchange-traded products meant to track the two coins saw $5 million worth of deposits last week. And while most of the gaming token category went red on Monday, Immutable (IMX) saw a 10% gain.\n\nAD\n\nAD\n\nMeanwhile, Binance USD (BUSD)—a dollar-pegged stablecoin—lost its peg for a while on Monday. As of this writing, BUSD had dropped as low as $0.97, according to CoinGecko. Even though it's a defunct stablecoin, there are still roughly 1.4 billion of the tokens in circulation.\n\nOne possible reason for the price turbulence: Most BUSD margin trading and futures contracts were automatically closed today, according to a Binance blog post.\n\nBUSD has been on a steady decline since the SEC sent a Wells Notice to New York-based firm Paxos, which used to handle minting and redemptions of BUSD on behalf of crypto exchange Binance. In the aftermath, Paxos and Binance said that users could continue to redeem their tokens until February 2024.\n\nThe exchange said BUSD tokens that aren't redeemed before Binance stops support will automatically be converted to FDUSD, a stablecoin issued by FD121 Ltd.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNblpsTkhjcDA5MlczNDNZb0xGU2YtWFB2dmkyc1ozSmoySEgtR0pFVU82eXJ4RkFGRXRLSi1jSGx6ZjQxQmE5c3FPS3hhb1AwdUNxbzVzLWRubEVtRHZNVEhIVG50QmJfTGJuUVZKOE1JWlZIaWxjTXQ2MmV4c0Z5MzByb9IBiAFBVV95cUxPOVk4NFp2S2RsSjV5Y2lqVGVIUzVMVFZ4WDdsa2d3QUVicFNZUF9udFVJOHU2RDhxZy1vSlJZZElqUEE0aE9PM0xURGZveWhCaUhOMm5TNDRFNUxhWDNoRE9GZDZsc1RtVGxiM3FMcXA0OHE0UEI3a0cyMHpDRmNxcVEwRXVPUkJ2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Enjin completes Ethereum to Polkadot NFT migration - Blockchain Gamer",
        "content": "Longstanding blockchain gaming platform Enjin has completed its migration from Ethereum to its new Polkadot-based Enjin Blockchain, which is specifically designed for NFTs.\n\nLaunched in 2017, over 200 million NFTs have been minted on Enjin’s Ethereum-based platform and users can now migrate all these assets using Enjin’s migration tools. In addition, Enjin is providing free transactions on its new blockchain for the next three months.\n\nMore generally, Enjin’s decision to move to Polkadot enables its ecosystem to take advantage of features including a throughput up to 5,000 transactions per second, enforced on-chain royalties and transaction fees priced around $0.005. In addition, game developers will be able to deploy their own game chains while interoperating with the main Enjin chain.\n\n“Enjin’s migration from its legacy solutions exemplifies the community’s dedication to progress in its pursuit of mass-market success,” said Rene Stefancic, chief operating officer of Atlas, which is the company developing out the technology.\n\n“Only through continuous innovation, superior technology, and, most importantly, an unwavering commitment to user experience, can web3 tap into the three billion-strong global gamer market.”\n\nYou can find out more about Enjin by reading its whitepaper."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE9leGVHWlJPRU80cGpFU0JJbXh2UDZsZW9QV20yaktTVWw2WU5fSlNfUk0zNDlMYVJtSHZUYTNQUDVtRG5ielZuSlVuc1BwSzFEUms5SThxU3hmU0lKckNQNEptekRrbHhZdjFyUVl30gFzQVVfeXFMTzZzTXNGQlNEYjJNMEZueGhackltWUpsNXNCWUxjbVNyYldkbFRFYzVSZ3FVRC1mNWhfenBfX3kyMXl5TDY3WUFUb1ZMMkZ5dUgzS3N5ZXlFWjU5ZHp1b2R6c2hLZUxrTWxfN0x5ckJzallzYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Dec 2023 14:37:21 GMT",
        "title": "Ethereum (ETH) Price Analysis for December 10 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe week is about to end more bearish than bullish, according to CoinMarketCap.\n\nAdvertisement\n\nTop coins by CoinMarketCap\n\nETH/USD\n\nThe price of Ethereum (ETH) has declined by 0.78% since yesterday. Over the last week, the price has risen by 8.26%.\n\nImage by TradingView\n\nOn the hourly chart, the rate of ETH might have found a local support level at $2,324. If the upward move continues, there is a possibility of a test of the $2,350 zone by the end of the day.\n\nImage by TradingView\n\nA worse picture is on the daily frame, as the price keeps falling after a false breakout of the resistance at $2,392. If buyers cannot seize the initiative shortly, a correction to the area of $2,300 is the more likely scenario for the next few days.\n\nImage by TradingView\n\nThe situation is neither bullish nor bearish on the weekly chart as the rate of ETH is far from support or resistance levels.\n\nHowever, if growth continues to $2,500, traders may expect a breakout followed by a blast to the $2,600-$2,700 area.\n\nEthereum is trading at $2,343 at press time."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNZXJPd2otV3RCRDlyMGkyTE5YMmRSYnh0ZzFPY0NhODVYa3FwNjBBZWY3T2ZQYWJpZVM3MTc5Qi1yTEF3cWEyOGt5OVo1U3F0VHlyZTYyRHBLVUl1RUR6dmxRakI0NTBLOUdXbGN0THkxMnBnazMweTJYdjlyZlphbGtrLUltNEozM1otUE9RV2VrZ01QVFF3U3lGcEdiSVpkUzgyVEsxTnAtVTjSAbABQVVfeXFMTm5pb1ZEbXVJNDlpeFlXcWtJSTlwcTI0dkxEX0ZEc0YzMXk1Vkp5dTFNYW1xaVhPaW9fYmtIR19fNDFvTW16UlBqWFlhUTdySzNuaUo0ZV9iLWJSMzBUdk1HRWtGUGl3MDdCcV9RaVNRcDk0MjNGdmV1Y0dvallTNldkX2FXQTFVaHN2amNwMG1WLXRmTjJLMHJxbFVqblJFOEZRQUdMZGczU2tsamJMb2o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Important Binance Announcement Affecting Bitcoin (Bitcoin) and Ethereum (ETH) Traders - CryptoPotato",
        "content": "TL;DR\n\nBinance Withdraws Ruble Pairs: Binance is ending support for several P2P trading pairs with the Russian ruble, including BTC/RUB and ETH/RUB, effective January 31, 2024, following its exit from the Russian market. Transition Options for Users: Russian users can switch to CommEX for continued ruble trading or use Binance’s options for withdrawing or converting rubles before the deadline. New Listings and Margin Trading: Binance added new tokens like PIVX and trading pairs to its Margin Trading program, allowing leveraged trades with higher profit and risk potential.\n\nBinance to Exit Russia\n\nThe world’s largest cryptocurrency exchange by market capitalization – Binance – announced it will no longer support certain P2P trading pairs tied to Russia’s national currency – the ruble.\n\nThose pairs include BTC/RUB, ETH/RUB, USDT/RUB, BNB/RUB, FDUSD/RUB, BUSD/RUB, and RUB/RUB, as the amendments are scheduled to take effect from January 31, 2024.\n\nBinance’s move follows the previous decision to exit the Russian market by selling the entirety of its local business to the crypto platform CommEX.\n\n“Therefore, users can continue P2P trading with Russian ruble (RUB) free of charge on the CommEX platform,” the exchange explained.\n\nThose willing to jump on board need to register with a CommEX account and connect it to the corresponding Binance one. Alternatively, clients have the option to withdraw their Russian rubles via Binance’s fiat partners before January 31, 2024, convert RUB into digital assets, or trade RUB for crypto on the Binance Spot market.\n\nBinance’s Latest Listing\n\nBesides removing certain trading pairs, the leading marketplace has expanded some its offerings with more tokens.\n\nLast week, it added PIVX (PIVX) as a new borrowable digital asset on Cross Margin and Isolated Margin. It also included ADA/FDUSD and DOGE/FDUSD, among other trading pairs, in its Isolated Margin program.\n\nBinance Margin Trading allows eligible clients access to funds from the exchange for use in leveraged trades. Thus, traders can deal with greater sums and adjust their positions appropriately.\n\nIt is worth mentioning that margin trading could bring greater profits in the case of successful trades. Nonetheless, it could lead to more significant losses if the market moves in the opposite direction."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi8wFBVV95cUxNaEMyWERtLVlNNkhQR1JadzlRQW9zVnFiSFdWOUVKa2dZRm9SMG1XVEltNHVZZ3k3Zkw4dEYtSDB2MWd4ekhlNU1xbzk2V1VGZ3dVMVpIZE42VDlpRkc0MEtmY0k4UmdONE1lVzdCWEMxTWpQdkhwNjJYZE9mT1NBNVkwcWtCdFV2VzY4elo4dUdVQUVPYjJMd21QbHh3dnhpUWpXdWRlbUpXN3BaZmdiWk9GT0ZCbmVwSFppM0JCaEdPdW1UTzFxeDg4UzZnWWhIZjVLWFY0VDZQOFlaejFTUUtMbXROaWhCcU5qQmhlVXdkWE3SAfgBQVVfeXFMUGF1NnhIZEg5aUs4WnV6dWpDazJwVUlNSlZZRkljVXZwSlY1cVo1bEQxZ1dveGxZd09IWmV4S3pZNUg5UUt0bkNpM3lOWGwyU0ZfR0hyeng3RXFMWDBXcnpEZDk3ZjRIUUpZQWExREFPWG92VWhPNjhEZmdWTUFrcjNCVzlIeUZISlBjRjZJb0E0bkJyNXV6OWtnbm95THd5OXRTUElhNVdHWU1rN0FRb2ZfbGNKdWNlNThQZllZLVF4Tml5QkIxd3pLamZrTDlwV3lHaXh2RndDNjUtSUh2UGNMamU4Zl84bGVYc1BtTm5Vc2JUUDNzR2Y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Tailwinds abound for BTC as Google suggests ETF readiness - FXStreet",
        "content": "Bitcoin price could lose critical support at $40,000 as RSI confirms BTC is ripe for selling.\n\nEthereum price clings firm to the uptrend and records a healthy pullback as $2,147 support continues to hold.\n\nRipple price risks an extended 7% fall to the $0.5773 support level as XRP bulls show weakness.\n\nBitcoin (BTC) price remains bullish despite the catastrophic setback recorded during the early trading hours of the Asian session. While several other narratives support the big-picture bullish outlook, spot exchange-traded funds (ETFs) have a role to play in it.\n\nAs traders and investors continue to anticipate the US Securities and Exchange Commission (SEC) giving approvals for the product launches between January 5 and 10, even Google has taken a hint. An official announcement reveals that \"advertisers offering Cryptocurrency Coin Trust targeting the United States [will be allowed] to advertise those products and services\" beginning January 29, 2024. Notably, this is the same month that spot Bitcoin exchange-traded funds (ETFs) are expected to gain approval in the US.\n\nBitcoin price delivers a healthy retest\n\nBitcoin (BTC) price folding back to record an intra-day low of $40,400 was a healthy retest as the $40,000 psychological level continues to hold as support. If the level holds, then it could precipitate the idea that new all-time highs are in the cards.\n\nMeanwhile, the upside potential remains strong for Bitcoin price as BTC is still not ripe for selling until the Relative Strength Index (RSI) crosses below the 70 level. With the Awesome Oscillator (AO) showing large volumes of green histogram bars, the bulls still maintain a strong presence in the market though. The RSI could simply hold above 70.\n\nIncreased buying pressure above current levels could see Bitcoin price overcome the weekly supply zone extending from $40,698 to $46,999. A weekly candlestick close above the $43,860 mean threshold would confirm the continuation of the primary trend.\n\nSuch a move would set the tone for Bitcoin price to flip the supply zone into a bullish breaker, confirmed by a move above the $48,725 resistance level.In a highly bullish case, Bitcoin price could extend to tag the $66,098 resistance level into a support floor.\n\nBTC/USDT 1-week chart\n\nConversely, if the weekly supply zone defends as a resistance order block, Bitcoin price could pull south, losing the support at $40,000. A decisive weekly candlestick close below this level would put BTC on the cliff, potentially rolling over to the $30,000 psychological level.\n\nAlso Read: Bitcoin braces for volatility-filled week with November CPI data release, Fed decision\n\nEthereum price sell-off threatens upside potential\n\nEthereum (ETH) price also crashed alongside Bitcoin, losing almost 9% in market value. However, the move remains a healthy pullback as the $2,147 support level did not break. As long as ETH remains above the $2,000 psychological level, the upside potential remains alive.\n\nIncreased buying pressure could see Ethereum price clear the $2,403 range high even as it continues to consolidate within the confines of an ascending parallel channel.\n\nETH/USDT 1-day chart\n\nOn the flipside, increased seller momentum could plunge Ethereum price out of the bullish chart pattern, confirmed by a break and close below critical $2,147 support. ETH might then confirm the continuation of the fall by breaking and closing below the midline of the supply zone turned bullish breaker at $2,075. The move could clear the path for the largest altcoin by market capitalization to spiral to the $2,000 psychological level.\n\nAlso Read: Ethereum leads altcoins north as Bitcoin halts amid bull trap fears"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPcVdlVDdFbWpyMVN1X1RTeFN3VjI0Z0pqaWR5bFZSd01nVkktUXdyLVIycWwycVBVY0puY05CeWcwdW9xRTBUYmtoTUVuRWwxUi1SVU1PSnNIVUJxTVpIZXZ5RDM0M2JnYkdZZ1BxcDIyVDlmRC1OOXN4VE9saGZUdVgwUy1zMnRHVUJaNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Solana Experiences Price Correction – Ethereum Next Price Target Set, While Pullix Introduces a Token-Burn Mechanism - The Cryptonomist",
        "content": "SPONSORED POST*\n\nEthereum (ETH) could reach a new all-time high of $5,000 however analysts project that this can only happen in 2025. Solana (SOL), on the other hand, has retraced in value following its recent upswing and now trades at $59. For the time being, another crypto that’s gained significant attention is Pullix (PLX), which can completely change the TradFi space with an innovative approach.\n\nSolana (SOL) Experiences Price Correction Despite 333.5% Growth\n\nSolana (SOL) recently saw a major price correction as it moved down in value to $59. The cryptocurrency began the year strong, where Solana grew from $8 to a peak value of $61.29 before correcting. The recent retrace from the October high is not too significant.\n\nWith its impressive market cap of $25,296,290,926 and a trading volume of $1,675,035,225, the Solana network has showcased no signs of slowing down, and the total price increase this year is still at 333.5%. According to the latest Solana price prediction, it can reach as high as $65.18 by the time the year ends.\n\nEthereum (ETH) to Spike As High as $5,000 by 2025\n\nEthereum (ETH) has broken past the $2,000 price barrier and is now heading towards even more gains. This cryptocurrency has showcased impressive resilience following the market crash that occurred in 2022, and it has made a 70% price increase during 2023 so far, making Ethereum one of the highest-growing altcoins.\n\nAnalysts are now bullish on the future of Ethereum, with some of them pointing towards a price increase between $4,800 and $5,000. One such analyst is using the TradingView handle FieryTrading.\n\nAccording to the analyst, the Ethereum price prediction of $5,000 will become a reality by 2025. Based on the data, the crypto is showcasing a very decent long-term trade.\n\nPullix (PLX) to Introduce a Token-Burning Mechanism\n\nWhile Solana is down, and Ethereum’s growth is still far out into 2025, Pullix (PLX) has picked up the most significant attention.\n\nThis will be the world’s first community-backed exchange that will provide users with seamless access to all assets, not just cryptocurrency, 24/7. Alongside this, any holder of the PLX crypto will get access to the platform’s daily profits.\n\nWith PLX, users can gain access to cashback, distribution of rewards and additional promotional offers. The ecosystem will also include a token-burning mechanism at the end of each month in order to maintain the stability of the value of the cryptocurrency as much as possible. By implementing its blockchain infrastructure, all of the transactions, trades, and interactions are also completely encrypted. Anyone can stake the crypto or stake other cryptocurrencies, such as BTC, ETH, or DOGE, in order to engage in the multi-currency staking process completely.\n\nCrypto can also be used as collateral and trade OTC derivatives without KYC. This opens up the market to far more people who would otherwise not be able to access it, solving a key issue in the industry. Now, the project is undergoing its initial presale period, where it trades at just $0.04. According to analysts, the PLX cryptocurrency has the potential to climb 100x following its listing on major exchanges at launch.\n\nFor more information regarding Pullix’s presale see links below:\n\nVisit Pullix\n\nJoin The Pullix Communities\n\n*This article was paid for Cryptonomist did not write the article or test the platform."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMisAJBVV95cUxPNXpaNk9nSUlocG5nNUV2cHBSbXFxU2ZCSmJ3SW4xcEVscGFfRkRnd1V5TWhGRHEtelhDZGlXVmswS2U3ZDNnTHAxNE5UMjg2QURGNnZRZ2dIRW5pSFR6SDhFeV8xM1BHRGNueldCVmhnUzc1aGZRSG1UVFE4X0VQMHJWRmdZbUh3dUJJRmh3M1JFMUlUZ0NxZmFFTk5IaDhEVXBraG9aRm4xaVp1OURVdVJoOEItQnZzR3Vtc3JyblJkRk9mdTBpVTMxVE9kZ1U5ZWlsa2xMUVlkRDZROHpSS3Z2THRYOEU5WXlpRW44YTVSd0ZrcEdyZUpYRGtTZWFONU9wZlotcFRXRWtjUVVDSml2bU1wa2JBRnFvT2RGcmc3ZmJKVUJkeFpGWTloeE8z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Ether Capital Announces Leadership Transition: Brian Mosoff to Step Down as CEO, Som Seif Appointed as Interim CEO, Update on Corporate Treasury and NCIB - Business Wire",
        "content": "TORONTO--(BUSINESS WIRE)--Ether Capital Corporation (“Ether Capital” or “the Company”) (NEO: ETHC), a company dedicated to providing access to the Ethereum ecosystem, today announced a transition in its executive leadership. Brian Mosoff, who has served as the CEO for over five years, will be stepping down from his role, effective January 1, 2024, and Som Seif, Executive Chairman of the Board and founder of Ether Capital, will assume the role of Interim CEO. Brian will continue to contribute to the Company's strategic direction as a member of the board of directors.\n\nSom Seif co-founded Ether Capital in 2018 with the aim of making it a leading access point in the capital markets for Ethereum and its wider ecosystem. With Som at the helm as Interim CEO, Ether Capital plans to initiate a strategic review to determine the best path forward for the Company’s development. Som's extensive experience and leadership have been a cornerstone of the Company's development and success. Under his leadership, Ether Capital will continue to focus on maximizing operational efficiency and yield generation as it undertakes its strategic review. Jillian Friedman will continue as Chief Operating Officer and interim Chief Financial Officer.\n\nThe Board of Directors would like to express their gratitude to Brian for his contributions to Ether Capital. Mr. Seif said, “The Company's achievements in building intellectual property around custody and staking infrastructure is a testament to its innovative approach in a volatile industry.”\n\nThe Company continues its commitment to its Normal Course Issuer Bid (NCIB) program and has purchased 670,000 shares since the start of the program in June 2023 for a cost of $1,272,200. The outstanding share count is 33,533,620 and the shareholder’s equity per share is $4.25. The price of Ether has increased by approximately 82% year to date, with the value of the company’s Ether treasury at $148.7 million. All figures are as at the market close of December 8, 2023.\n\nAbout Ether Capital Corporation\n\nThe Company’s mission is to be the premier access point in the public markets for investment in Ethereum’s native token, Ether. The Company generates yield on its Ether treasury through staking, a process that allows Ether holders to participate in securing the Ethereum network and earn rewards in the form of additional Ether tokens.\n\nThe Company’s strategy is to hold and stake Ether, build intellectual property related to staking and Ethereum infrastructure in general, and supplement staking income with consulting and sub-advisory mandates in the digital asset sector. For more information, please visit http://ethcap.co.\n\nForward-Looking Information\n\nThis press release contains “forward-looking information” within the meaning of applicable Canadian securities legislation. The Company cautions the reader not to place undue reliance upon any such forward-looking statements, which speak only as of the date they are made. Generally, but not always, forward-looking information can be identified by the use of forward-looking terminology such as “plans,” “expects” or “does not expect,” “is expected,” “budget,” “scheduled,” “estimates,” “forecasts,” “intends,” “on pace,” “anticipates,” or “does not anticipate,” “believes,” “will help position” and similar expressions or state that certain actions, events or results “may,” “could,” “would,” “should,” “might,” or “will” be taken, occur or be achieved.\n\nForward-looking statements are based on information available to management at the time they are made, management’s current plans, estimates, assumptions, judgments and expectations, including in relation to the proposed strategic review by the Board of Directors. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking information. Such risks and uncertainties include, but are not limited to the risk factors discussed in the Company’s Annual Information Form dated March 31, 2023, the Risk Factors section in its most recently filed Management Discussion and Analysis and its other filings available online at www.sedarplus.com. Although the forward-looking information contained in this press release is based on assumptions that the Company believes to be reasonable at the date such statements are made, there can be no assurance that the forward-looking information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such forward-looking information, including as a result of any strategic review undertaken by the Board of Directors. In addition, the Company cautions the reader that information provided in this press release is provided to give context to the nature of some of the Company’s future plans and may not be appropriate for other purposes. Accordingly, readers should not place undue reliance on forward-looking information. The Company does not undertake to update or revise any forward-looking information, except in accordance with applicable securities laws."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE1PdzlaUFhZMlNCN3JScWt5NXg2TFkwaVhvci1XY1JfM1RSS1F6RU9fTmg2Z0dFempEMTZwSjdwcmx4TjRMYUVYcDZBRC1sN2JBQWhKTHA4ZHJadVdKZGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Dec 2023 08:00:00 GMT",
        "title": "What Are Blockchain Confirmations and Why Do They Matter? - CoinCentral",
        "content": "A blockchain confirmation is a representation of a new block being accepted by a blockchain network. When any transaction is first broadcast to the blockchain it starts with zero confirmations. This number then increases as the information is added to the first block, confirmed, given a permanent place, and followed by more blocks.\n\nA confirmation is considered to have occurred once a miner has verified a block of transactions and added the new block to the blockchain. On average, cryptocurrency exchanges require a minimum of three confirmations until a transaction is accepted. Coinbase, for example, does not consider a Bitcoin transaction as final until it has received at least three confirmations.\n\nAll public blockchains make use of blockchain confirmations. These are important since they can help you understand how confident you can be when making a transaction.\n\nBlockchain confirmations are vital since they are a way of verifying and legitimizing information that will then become immutable. If a transaction is deemed fraudulent, it will be rejected from the blockchain: zero blockchain confirmations means zero transactions.\n\nTthe larger the transaction, the more blockchain confirmations are required. This is because the more confirmations there are, the harder the transaction is to reverse. For a transaction of $1 million, it’s not uncommon to wait for at least 60 confirmations. The amount of blockchain confirmations required to verify a transaction varies by blockchain. Let’s take a look at Bitcoin and Ethereum here.\n\nBitcoin Confirmations\n\nYou probably already know that Bitcoin’s blockchain creates a new block about every 10 minutes through the mining process. This block then verifies and records new transactions and appends them to the Bitcoin blockchain. This means that a transaction is unconfirmed until the new block is generated. Therefore, if you’re sending or receiving Bitcoin, it’s essential to wait until you see that the transaction has been confirmed.\n\nOne confirmation usually takes up to 10 minutes. However, since one confirmation is not enough to be confident about the validity of the transaction, users have to wait for each new block to be created and verify the information. Depending on the amount being sent, this may take anywhere between 30 to 600 minutes. Ten hours is a long time to wait for a transaction confirmation!\n\nSome Bitcoin services are instant and require only the first confirmation, however, the majority ask for more, with some companies requiring at least six Bitcoin blockchain confirmations before accepting the transaction.\n\nWhat Is the Bitcoin Mempool?\n\nThe Bitcoin mempool is the sea of unconfirmed Bitcoin transactions on the Bitcoin network. As explained above, once a transaction is uploaded to the blockchain, it is not confirmed immediately but is released into the mempool of transactions, which are considered in-motion.\n\nAll nodes on the Bitcoin network are connected to the mempool, and that includes the miners who collate transactions from the mempool into a block. The miner who first solves the mathematical equation and adds the block to the blockchain is the first to confirm the block. Therefore, the first to receive the miner reward of 12.5 BTC.\n\nThis is fairly straightforward, however, some transactions are picked out of the mempool faster than others. Why? Because miners also earn a bonus percentage of transaction fees (called the Bitcoin mining fee).\n\nMiners will pick out the transactions with the higher fees first to earn a higher bonus. It also explains why not paying transaction fees can lead to your transaction getting stuck. In fact, as more people join the Bitcoin network, this bottleneck is one of the greatest challenges to the Bitcoin community.\n\nHow to Speed Up Blockchain Confirmation Times\n\nThe higher the fee you pay, the more likely your transaction will be confirmed in a timely manner (there is a 60 percent chance that it will take 10 minutes or less). However, if your transaction remains unconfirmed, the recommended wait time is 72 hours before sending it again.\n\nIf you want to avoid paying fees, however, you can check to see how many unconfirmed transactions there are at a given moment and calculate how long it will take.\n\nEthereum Blockchain Confirmations\n\nWhen it comes to Ethereum blockchain confirmations, the agreed-upon number seems to be undecided. According to the Ethereum white paper, 7 confirmations should be enough to confirm the transaction (about 2 minutes).\n\nHowever, Ethereum miners must check the parameters of the last 250 blocks. So, if you want to err on the side of caution like the miners, you should wait for 250 confirmations. This sounds like a lot, but in practice is only about an hour.\n\nCoinbase requires 50 ethereum confirmations before considering a transaction complete. It should also be noted that the Ethereum blockchain faces significant scalability issues as well. Ethereum is working to scale quickly to take on more users, and through Proof of Stake, confirmations should be even quicker.\n\nEtherscan and Ether Gas\n\nEthereum doesn’t have a mempool for pending transactions; it’s simply called the transaction pool. The pool contains all the transactions submitted that haven’t yet been assigned to a block.\n\nThere are multiple methods for speeding up your transaction and deciding on the best gas price when sending your Ethereum transaction. You can try ETH Gas Station to see an overview of gas usage, and you can see how many transactions are pending by using Etherscan.\n\nEtherscan is particularly popular since you can order transactions by gas price (simply click on the GasPrice column). You’ll then see more or less the same list that miners see and, if you select a gas price that is within the first couple of pages, you should enjoy short confirmation times.\n\nFinal Thoughts: Wrapping up Bitcoin Confirmations\n\nBlockchain confirmations are essential for securing your transactions. The best way of ensuring a faster confirmation is by paying a higher fee. As all blockchains begin scaling up to prepare for even more users, it will be interesting to see how that affects the prices we pay and the times we wait."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNTko1bEhRTV9YWWhKakgxZE1LTE1qaUZTZXJWYWx3NzRZNTRuSmFmUmtYV3p3aWNXMnI2MnF3X3RXWUdzWDBVTjJIVC1kcl9ObF9mR0JzSEF6YXVpZXhFbXZBaWVrUjQwR1FHZS1EZlJhU1pwQzNhNVlDRlJHOG4zRHBCUldKaGRzeWJWNFpQUzk3MVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum prices cool off, traders bullish on this altcoin - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nAfter a euphoric week, leading cryptocurrencies Bitcoin (BTC) and Ethereum (ETH) ended Sunday in the red, and selling continued to this week’s open. Currently, Bitcoin is trading at $42.1K, down 4.07% today, while Ethereum is at $2.23K, down 4.87%.\n\nHowever, traders continue to rally behind Bitcoin ETF Token as its presale surges toward $3.5 million.\n\nMarket overconfidence corrected, but analysts fear another flush\n\nWarning signs of a steep correction have been everywhere over the past few days. Many analysts urged market participants to proceed cautiously, but some believe another flush is imminent even after the recent correction.\n\nCoinMarketCap’s Crypto Fear and Greed Index entered the “extreme greed” zone, indicating that the market may be overbought. This represents a high-risk time for new buyers to enter the market, as a selloff is necessary to restore balance.\n\nMeanwhile, crypto funding rates recently reached a local high. This indicates significantly more long orders than short orders in the market, causing bulls to pay a premium to rebalance.\n\nHigh funding rates are often followed by a “flush,” where futures positions are forcibly closed, causing prices to cascade in the opposite direction.\n\nYou might also like: Will Bitcoin ETFs follow gold ETFs’ path to success?\n\nThis was highlighted by the analyst Mister Crypto, who suggested that Bitcoin’s high funding rates were “signaling a top.”\n\nIn the analysis, Mister Crypto noted that Bitcoin’s price retraced by 20% each time its funding rates reached their recent levels.\n\nGiven Bitcoin has pulled back less than 5% so far, this could indicate a much deeper correction is imminent.\n\nMeanwhile, prominent X commentator MrChief predicts that the market will “pullback enough to stop out early buyers & get bears super excited then reverse back up.”\n\nHowever, other analysts believe the crypto market may be poised for a longer-term pullback. One is RektCapital, who referenced earlier market cycles’ price action to suggest that “the Bitcoin Pre-Halving top may be very close.”\n\nThat said, the Bitcoin halving is just 137 days away and spot Bitcoin ETFs are on the cusp of approval by the Securities and Exchange Commission (SEC). As such, the market looks poised for a solid mid-term trajectory.\n\nEven so, market participants seeking growth appear to be considering Bitcoin ETF Token whose presale is in progress.\n\nBitcoin ETF Token presale raises $3.4 million in 1 month\n\nBitcoin ETF Token has raised almost $3.5 million in one month. The project features multiple use cases, rewarding holders as the SEC approves spot Bitcoin ETFs.\n\nThe project features a deflationary mechanism. 25% of its supply is reserved to be burned across five Bitcoin ETF milestones.\n\nAdditionally, there is a 5% burn tax on transactions, reducing by 1% at each target.\n\nThese scarcity-focused features, combined with the anticipated $1 trillion in liquidity entering the crypto market from the Bitcoin ETFs, could support Bitcoin ETF Token.\n\nYou might also like: Bitcoin breaks above $40k, Bitcoin ETF Token raises nearly $2.5m\n\nFurther supporting this is the project’s current early stage and low market cap at launch of just $12.39 million.\n\nBitcoin ETF Token also has a staking mechanism, offering a 79% APY. Even so, this will decrease as more tokens are staked, incentivizing buyers to get in early to maximize their gains.\n\nThe project also offers a Bitcoin ETF Alerts service. This is a news feed that pulls latest Bitcoin updates from around the web into one place. The feature aims to foster a more active and engaged community.\n\nVisit Bitcoin ETF Token Presale"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxOZks2c0taOFVwWmZkTEVTaWpOcUtxdjJ4N2tJNGxPVXNlQ2d6djBka0pHRldEanpCT3lxdmxZNlFLTTdXLXRWS3c2R1QyUEJtT1QzMnlna0FvbDl3WUtHNlFZblJYdnJwb3B0bENOQ2JsVHhRWV9HT2o4Mmg0Zl9jRXBhNEFDRFRyeGdEUTRkT3gwYjR0QjloUzFtazBKZnFCZTJPeWNUSi1ETU84dmx2WUNoYlVUTmdVemJXbEtIRHFoTjIzQTRRSm5tZETSAdIBQVVfeXFMT202dEI0Sk5UY1pOWlctVEtGSkRGaTlZWC1GbDF0ek44Z2Y5NXRkNktXWjYxajROVU5jeXFYRldsaFZGS1lzYTZwMDRGQWZxcERreDJJYTk3SWd2eWFiWTc2SUg3ZE44aDNDUmdDR0p0bERLaUp1ZHNXYUx0WTFqajdZQ3Y2d0RiSHpxbTh4MmhjN0Etbm5rbTJwQ3JFTFZnLTY2T3dvRWRiV29wYnZoQVZHT1NrQUNsTGt6VkprWGlqdXZiQVctWTRzVFhXYWFkZ3RB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Dec 2023 08:00:00 GMT",
        "title": "Altcoin bull cycle 2023 picks by analyst: Ethereum, ChainLink, Arbitrum, Optimism - FXStreet",
        "content": "Bitcoin price is likely to rally to $48,000, as market participants keep up with the updates on Bitcoin Spot ETF applications.\n\nAltcoins like Ethereum, Chainlink, Arbitrum and Optimism are likely to gain from BTC’s price rally.\n\nEthereum price is likely to rally alongside Bitcoin as ETH holders await Spot Ethereum ETF approval by the US SEC.\n\nCrypto analyst Michaël van de Poppe picked four altcoins for the ongoing bull run, in his recent video on YouTube. The analyst believes these altcoins could outperform other assets and yield gains for traders, alongside Bitcoin price rally to $48,000.\n\nAlso read: Ethereum derivatives data points at bullish start for ETH in 2024\n\nBitcoin dominance peaks, drives gains in altcoins\n\nBitcoin dominance is at 50.2%, according to data from CoinGecko. At the current level, alongside Bitcoin price rally, altcoins like Ethereum (ETH), Chainlink (LINK), Arbitrum (ARB) and Optimism (OP) are likely to yield gains for holders.\n\nPoppe explains that Bitcoin is currently in a stage where the asset is rallying and there is a likelihood of a potential top. There is hype surrounding the speculation of approval of Spot Bitcoin ETFs and capital is likely to flow into altcoins. Volatility is likely to go away from Bitcoin and drive gains in altcoins like Ethereum.\n\nETH holders are awaiting an approval of Spot Ethereum ETF and this could fuel gains in the asset. Ethereum price could correct in response to a correction in BTC, however Poppe has set a target of $3,000 for ETH price this cycle.\n\nWith Bitcoin dominance peaking out, altcoins like ChainLink, Arbitrum and Optimism are likely to rally. Just as seen in 2019 and 2020, ChainLink price rallies after weeks of sideways price action. LINK is therefore on the brink of multiple bullish breakouts.\n\nPoppe identified a massive bullish divergence in Arbitrum and Optimism and notes that these two altcoins are finalizing their accumulation stage, gearing up for a breakout. At the time of writing, Bitcoin price is close to the $44,000 level, ARB and OP are trading at $1.1327 and $2.1510, on Binance, respectively."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOdUd0ejdRMnJhQ214YUV3Ulp5THlRYTRtMEdCQmxPQzVYc2lHZllWRUFuY2JtMlIzd096STMxek56dkgtSm1MYS1wanBvMWp0ekN3aHRSX2VJQS12RndRUVpiQ0NMNGNhbGxNSDJuUlpjOGZXNlZvOTM4ZWlNUEMwQVNaXzFLR0t4eHpDc0ZVbTFPZlNLeElHMUE2bzhrVGZYLVZOWFdpd3Z2bFdnQ193UNIBtgFBVV95cUxOa0IzbjA4TksycUlmZTFhZXk3Zkl4bzNvZ3QyNkxuT1AxWVU2NGRHQWV5RGxVVXVlSlVDY3dMZUplMnN0aVFEZ0ZnUzJRcU9tNjVYbEVJcl9tU3JORldwaHB3R3Y4WnljZGdwSURKdVkwWS1pMFRaSk15NW9qRmp2Tm5GcTZMOFhZRTdxaXZWaHNYU3lTREZGbjd3WHJrVmFyXzhqM0pfckpiT3dpRDNueG5vdkZoZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Decentralized Exchange Uniswap Expands to Bitcoin Sidechain Rootstock - CoinDesk",
        "content": "This year has seen various elements of blockchain networks more commonly associated with Ethereum and others find their way to Bitcoin, not least the Ordinals protocol, which brought non-fungible tokens (NFTs) to the world's largest blockchain. There are also attempts to bring Ethereum-style smart contracts to Bitcoin."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9Oak56Q29ET1NKTXpTVlZsZ3U0Y1NMREtZT1pFWlVfT1hCeTlONEg2d2JaREF6SmY4engwdWoyMnJQc3lpTUc2WVlyLVNvNUVjajZpdllUWUR3VFZQeTV2dHF1WnB0RjdPZDZPTzY4VWU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Brief Insight into ERC-1400 Token Standard - LCX",
        "content": "Understanding ERC-1400: A Versatile Security Token Standard\n\nThis token standard is an Ethereum-based protocol designed specifically for security tokens. It builds upon the foundation of existing Ethereum token standards like ERC-20 and ERC-721, combining their best features to create a robust framework for security token issuance and management. The features of ERC-1400 are:\n\nComposability\n\nOne of the standout features is its composability. It allows security token developers to combine various modules and features to create customized tokens that meet specific regulatory and business requirements. This flexibility makes it easier to adapt the standard to different jurisdictions and industries.\n\nCompliance Features\n\nERC-1400 prioritizes compliance with securities regulations, a critical aspect of security tokens. It incorporates features that enable token issuers to enforce compliance rules, such as investor accreditation and transfer restrictions. This ensures that security tokens are issued and traded in accordance with legal requirements.\n\nInteroperability\n\nInteroperability is another key strength of ERC-1400. It is designed to work seamlessly with other Ethereum-based standards, such as ERC-20 and ERC-721. This interoperability facilitates the integration of security tokens into existing blockchain ecosystems, exchanges, and wallets, making them more accessible and liquid.\n\nGranular Control\n\nToken issuers using this token standard have granular control over their security tokens. They can define different classes of tokens, each with its own set of rules and properties. This level of control enables token issuers to manage various aspects, including voting rights, dividend distribution, and transfer restrictions.\n\nBenefits of ERC-1400 Token Standard\n\nThe adoption of this token standard offers a multitude of benefits for token issuers, investors, and the broader blockchain ecosystem.\n\nRegulatory Compliance\n\nIn an era where regulatory scrutiny is increasing, it provides a clear path to compliance. Token issuers can configure their security tokens to adhere to specific regulatory requirements, ensuring that they are issued and traded legally.\n\nEnhanced Security\n\nSecurity is paramount in the world of security tokens. It incorporates security features that protect tokens from unauthorized access and fraud. This includes the ability to freeze or revoke tokens in case of security breaches.\n\nIncreased Liquidity\n\nThe interoperability of ERC-1400 tokens allows for easy integration with existing exchanges and wallets. This leads to increased liquidity, making it easier for investors to buy and sell security tokens.\n\nToken Customization\n\nERC-1400’s composability feature enables token issuers to tailor security tokens to their specific needs. Whether it’s defining different token classes or creating unique transfer restrictions, this customization empowers issuers to align their tokens with their business objectives.\n\nReduced Costs\n\nBy automating compliance and streamlining the issuance process, ERC-1400 can significantly reduce administrative and legal costs associated with security token offerings (STOs).\n\nConclusion\n\nIn summary, the ERC-1400 token standard stands as a promising development in the world of blockchain-based securities. Its composability, compliance features, interoperability, granular control, and the many benefits it offers make it a valuable tool for token issuers and investors looking to navigate the world of security tokens. As blockchain technology continues to reshape the financial industry, ERC-1400 is poised to be a key driver of innovation and change, ultimately leading to a more accessible and compliant global securities market."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE91ZVM5RTJsdHN6QnFGck1JRDg5SjJrQklNc3FCYTF2UWN4SWpqZlp2Rk1vTTNRS3NJUWFGRW0tUUFxUlAyYUN0Qi1fOVFKdklTZEZ5N29uQm1vZHNVWUNYVHB6UzBlbnpZeW16Smk4WWVOV0NLRHQwal8xQ2tDT3M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Enjin Migrates 200 Million NFTs from Ethereum & Jumpnet to Enjin Blockchain - Castle Crypto",
        "content": "The largest NFT migration in history took place today (December 11th, 2023), as 200 million NFTs made the transition from Ethereum to the Enjin Blockchain.\n\nThis is one of the most highly anticipated and cathartic moments for all of those early OGs that minted hundreds or thousands of NFTs on Ethereum from 3-4 years ago!\n\nA snapshot was taken on December 8th, 2023:\n\nSnapshot. Taken. ✨\n\n\n\nA snapshot of 200M NFTs has just been taken on Ethereum and JumpNet.\n\n\n\nThe NFTs of the two biggest ERC-1155 smart contracts will migrate to Enjin Blockchain.\n\n\n\nLearn more: https://t.co/1hb0C2Frlt\n\n\n\nOnce migrated, you’ll be able to:\n\n\n\n⛽️ Trade your NFTs for free… pic.twitter.com/3IK8OyCPnM — Enjin (@enjin) December 8, 2023\n\nThere are still many questions to be answered, such as what benefits Enjin MFT holders could get, as well as further utility from some of the early Enjin gaming weapons like Timeripper or the Epochrome Sword.\n\nHow to Claim Your Enjin NFT Assets from Ethereum and Jumpnet on Enjin Blockchain with Enjin Wallet\n\nFollow this guide on the Enjin official website.\n\nOpen the Enjin Wallet, and navigate to the NFT tab. From here, you will find a button allowing you to claim assets to a single address or a number of addresses.\n\nSingapore – December 11, 2023\n\nIn a landmark development, Enjin has executed the largest NFT migration away from Ethereum to date, transferring an astonishing 200 million NFTs to the Enjin Blockchain.\n\nThis shift includes assets from thousands of creators, notably including tech giant Microsoft, highlighting the tech industry’s growing demand for blockchain efficiency and scalability.\n\nEffective immediately, NFT holders can seamlessly claim their assets on the Enjin Blockchain using the Enjin Wallet with a simple “Claim” click.\n\nPost-migration benefits include Enjin’s network-wide fuel tanks, providing free transactions across the ecosystem for the next three months. Additionally, enforced on-chain royalties ensure fair compensation for creators, and a powerful API and development platform will simplify token integration into mainstream games.\n\nSay goodbye to transaction fees on Enjin, with network-wide Fuel Tanks! ⛽️\n\n\n\nAll transactions on the Enjin Blockchain will be subsidized for 3 months!* 💜\n\n\n\nNetwork-wide Fuel Tanks are now LIVE! 🔴\n\n\n\nHere’s all you need to know 👇: pic.twitter.com/Vhy3pcbuuV — Enjin (@enjin) December 1, 2023\n\n“Enjin’s migration from its legacy solutions exemplifies the community’s dedication to progress in its pursuit of mass-market success,” said Rene Stefancic, Chief Operating Officer of Atlas, Enjin Contributor. “Only through continuous innovation, superior technology, and, most importantly, an unwavering commitment to user experience, can Web3 tap into the three billion-strong global gamer market.”\n\nEnjin’s decision to launch a blockchain dedicated to NFTs, after six years of building on Ethereum, marks a significant milestone in the quest for scalability and affordability in Web3 gaming. Looking ahead, Enjin aims to empower games and applications to launch their own Layer 1 chains, which would be fully interoperable within the broader Enjin Blockchain ecosystem.\n\nEnjin’s infrastructure is specifically designed to enable games to scale effectively, catering to mass market demands and bypassing the limitations of legacy blockchain infrastructure.\n\nA specialized NFT-centric fork of the Polkadot Network, Enjin Blockchain addresses scalability issues by offering low transaction fees of just $0.005. This, combined with a throughput of 5,000 transactions per second and the capability to mint up to 2,000 NFTs in a single transaction, sets a new standard in NFT usability.\n\n“Enjin’s NFT migration follows and completes its token migration,” added Oscar Franklin Tan, Chief Financial Officer and Chief Legal Officer of Atlas, Enjin Contributor. “This was one of the most complex, unprecedented blockchain migrations in history, involving both fungible and non-fungible tokens from Ethereum, Polkadot and Enjin Blockchain. Strong support from migrating holders secures the new Enjin Blockchain and expands governance.”\n\nAbout Enjin\n\nSince 2017, Enjin has been the world’s first end-to-end Web3 game development platform and ecosystem, centered around Enjin Blockchain and supported by a seamless app layer consisting of a wallet, marketplace, API, and advanced developer tools.\n\nAs a scalable, affordable, and feature-rich ecosystem, Enjin’s technology has seen wide application in blockchain games, apps, enterprise initiatives, and innovative marketing campaigns. The Enjin ecosystem is fueled by Enjin Coin (ENJ), the native token of the Enjin Blockchain. To date, over 200 million NFTs have already been created using Enjin’s tools.\n\nMedia Contacts\n\nRene Stefancic\n\nChief Operating Officer\n\nOscar Franklin Tan\n\nChief Financial Officer and Chief Legal Officer\n\nAtlas Development Services, a core contributor to Enjin Blockchain\n\npress@enjin.io\n\nsimonket@enjin.io\n\nwww.enjin.io"
    }
]