[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOeTBkazRzMmZ2Ylh5UUlpZVpKNlFwR0dCRndkN2cxOTJabTlMRGdqNGtrSXJ3ZlVWblFsUVNOd2RJV3BaeXZwWnhUbHZNcWhjWUo0YTZ1U3RtazE3aDFpTFZmbGF1MjZCVFZtbTc5NnVuOTFlQUtySnRoYWJyRzhybkExWFg4QkxxV2VtdnppYU1zcWVNcEJNaGpJZU1FdVBRdWUxUHN3aktvSkxTaDA00gG0AUFVX3lxTE95ZkdaUVhJZnA5U245SXdIS0JvUWZGcVpNUEd6SjZ0N3lEYzV5emVGallEd3FMRVh1aTFISk03WFBjejRzU0Z4Sm1oNEpvbUxxMUdBZG5lU1lfRnJyZ1doYUNZOVFtTVFxX2t4UC1LbDZQSjhyamZtSnNvMmQ1bnNEX1gwdDlhU0RuNjF0c0tObV9PN2N4NkhJdDFEQUVRWkdNb1NEaW92ck5ackMtdDE1WVBaeQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "New Ethereum Layer 2 Blast Attracts $30M Hours After Bridge Goes Live - CoinDesk",
        "content": "Users have to wait until the launch of the mainnet in February before they can withdraw any funds from the network or participate in on-chain activities. As such, Blast is invite-only as of Tuesday, requiring a code from invited users to gain access. Besides, the BLAST points can be redeemed starting in May."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxONzRiWHUyeGtBME9aZDdGZElHQ0dlUWhPNE9oR3ctel9OcTdFU2ZJR0Z5N21CdWFpU3RhRUNRWmdlRkdiTnJXczJXNmZSeW5MbFA1TWQ0MkRIZkc3VGQxcS1HdVFiVnZQemo2TVJtbVJUU1N2dTU5MlRrMlY5OVdJR21sRzFNVGhMYWZ1S3Zud1ExODVKaEZVbXdidFd5b3l4azhxYjFZWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin’s Daily Transaction Fees Surpass Ethereum’s for First Time Since 2020 - Unchained",
        "content": "On-chain fees for Bitcoin transactions have surpassed those on Ethereum for the first time in three years.\n\nOptimism surrounding a potential spot Bitcoin ETF approval and the rising popularity of Bitcoin ordinals inscriptions has led to a rise in transaction fees on the network, which surpassed fees on Ethereum for the first time since 2020.\n\nAccording to data from Crypto Fees, Bitcoin transaction fees reached a daily high of $11.6 million, outpacing the $5.6 million in daily transaction fees recorded by Ethereum over the same period.\n\nHowever, on a weekly basis Ethereum transaction fees stands at around $8.3 million, while Bitcoin averaged $7 million in fees.\n\nRead more: BlackRock CEO Larry Fink Calls Bitcoin an ‘International Asset’ that Could ‘Revolutionize Finance’\n\nStill, the shift in daily metrics potentially implies a change in current market dynamics, especially when taking into account the factor at which Bitcoin fees have risen over the last few weeks.\n\nIn the last 24 hours, Bitcoin generated $11M in transaction fees. That is twice what Ethereum did, and up 20X from the amount it was generating two weeks ago. All it took was a little magic from the @TaprootWizards pic.twitter.com/zp6OOh0gUB — Mippo 🟪 (@MikeIppolito_) November 19, 2023\n\n“It gets even better when you look under the hood. Transaction fees (which need to grow for the network to be sustainable) are now 25% of miner revenue. That’s the highest it’s been in a long, long time,” said Michael Ippolito, co-founder of Blockworks, on X.\n\nRead more: Bitcoin Is Finishing Out 2023 as More Valuable Than the Rest of the Entire Crypto Ecosystem\n\nWhile some market participants attribute the surge in Bitcoin network activity to the price action surrounding a potential spot Bitcoin ETF approval on the horizon, others, including Ippolito, believe that a renewed interest in ordinal inscriptions was responsible for most of the activity.\n\nBREAKING: Ordinals inscriptions made up 57% of Bitcoin transactions in the past 24 hours driving up fees to a 5 month high of 205 sat/vB. Ordinals are the #1 use case on Bitcoin right now. pic.twitter.com/lVvNZIG2uV — Leonidas (@LeonidasNFT) November 9, 2023\n\nCongested mempools and high levels of transaction fees are usually a deterrent to user growth, but surprisingly, on-chain data shows that this hasn’t been the case this time around.\n\nData from IntoTheBlock shows that the Bitcoin adoption rate reached a yearly high of 67.62% last week."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNN1FvSTYzOFExajd4VHVZWW11R19qUE1vd3psd3dNVEZEXzNYQi1abkFIcDJoYzJPRnZBOHVhblNybEVveWxwTFgzaDN3VFdiX3BaNHdUZ3lFWnp2Q0NVODdsa2lzbUNlcHlpUTVVR3ZzaURLd0RYYWVRUU0wTU4zMk85Zkdkbzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Big Bank Embraces Crypto: Santander To Offer Bitcoin and Ethereum Trading - Yahoo Finance",
        "content": "Big Bank Embraces Crypto: Santander To Offer Bitcoin and Ethereum Trading\n\nSantander Private Banking International has announced it will now offer its high-net-worth clients in Switzerland the ability to trade and invest in Bitcoin and Ethereum.\n\nThe Spain-based financial services giant, which caters to over 210,000 wealthy clients worldwide, revealed in an internal memo seen by CoinDesk that the new crypto trading and custody services are being provided upon request to clients with accounts in Switzerland through their relationship managers.\n\nSantander said the crypto assets will be kept in a regulated custody model, with the bank storing private keys in a secure environment. Over the next few months, additional digital currencies that meet Santander's screening criteria will be added.\n\n\"As holding of crypto as an alternative asset class continues to expand, we expect that our clients prefer to rely on their existing financial institutions to be responsible for their assets,\" said John Whelan Head of Crypto Assets at Santander.\n\nHe also noted Switzerland's crypto regulations are among the most advanced globally, providing clarity for clients.\n\nSantander, which has been in business for over 160 years and counts 166 million customers, has taken a proactive stance on crypto. While risks exist, the bank seems to recognize the growing importance of digital assets in banking."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQT202WklabExRS0FCcUtYS2RoNTFQNWNhb3NVNVBMUzlfYlZPQlpkeHlleDhGaDZWWm14LUYyQ3NUM0QxXzRTeW1teFhsbGU4YkkyYlY5b3h6Z1htWG9MeEtiWEhoR2FfejQ3M0FiN1o0TUNycWhqMGEtbWhmRVFkVWtDbGNsQjR4aVlFejJaNG1uNE5x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Blur Founder Unveils Ethereum Layer 2 Network Blast - Crypto Times",
        "content": "The newly launched Ethereum Layer 2 network, Blast has attracted significant attention on the announcement day with it recording nearly a $30 million inflow of bridged funds within hours.\n\nDespite not being able to withdraw bridged funds until the mainnet launch in February 2024, users are bridging funds to Blast with its TVL now reaching approximately $40 million, as per data from Etherscan.\n\nBlast is an optimistic rollup and it claims to be the first layer 2 network offering native yield on ETH and stablecoins including USDC, USDT, and DAI. It participates in ETH staking and gives back yields to users with additional rewards. It also introduces auto-rebasing stablecoin USDB to reward users with stablecoin yields.\n\nIntroducing Blast: The only Ethereum L2 with native yield for ETH and stablecoins.\n\n\n\nWe’ve raised $20m from @Paradigm and @StandardCrypto to build the L2 that helps you earn more.\n\n\n\nDetails on how to get early access at the end of the thread👇 pic.twitter.com/AYYmK8YFx4 — Blast (@Blast_L2) November 20, 2023\n\nThe novel L2 is currently live in the early access phase which can only be accessed via an invite code. Users who join through early access will be rewarded with Blast Points which they could redeem in May 2024.\n\nIt has notably raised $20 million in funding from prominent DeFi players including VC firms Paradigm and Standard Crypto alongside a number of individuals such as Hasu, Hsaka, Foobar, The Block CEO Larry Cermak, and many others.\n\nBlast is built by Pacman, the pseudonymous developer and co-founder of NFT marketplace Blur, who said in a post that he will oversee the development of both projects. He shared plans to launch new NFT applications for Blur using Blast’s tech and infrastructure.\n\nI will oversee the development of both @BLUR_io and @BLAST_L2. This is not a task I take on lightly. Doing so requires having incredibly effective staff at each. I’m grateful for the builders at Blur and Blast for making everything possible. — Pacman | Blur + Blast (@PacmanBlur) November 21, 2023"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQei1jOEFnUXhSVUd6cUh4cy1iNTdxVnRfeEFGMTZFd2Jtai1JazBZTDVhR0JSTzlMS09hal80X202UkpCSV9JWVd1YmZtdnF5NWtiTm1ubVc5aV9aaWtSSndleS1HVzRSdUx5Tlk5MGRlSDFGdGVpMnRFdGt1ZXJjTmc2dGZpZWhBYUxZdU93N3NQNnVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Cloudflare Blocks Abusive Content on its Ethereum Gateway - TorrentFreak",
        "content": "Cloudflare is a content-neutral Internet infrastructure service. The company aims not to interfere with the traffic of its clients and users but, in some cases, it has to take action. This means responding to DMCA subpoenas and takedown requests for hosted content, for example. In addition, Cloudflare now reports it has blocked access to 'abusive' content on its Ethereum gateway.\n\nOne of Cloudflare’s main aims is to make the Internet more secure while respecting the privacy of its users.\n\nThis laudable goal is broadly respected but in common with other internet services, abuse of Cloudflare’s services can lead to conflicting situations.\n\nThe California-based company previously terminated service to controversial sites including the Daily Stormer and Kiwi Farms. These actions were taken voluntarily, with Cloudflare citing an immediate threat to human life as the reason for the Kiwi Farms intervention.\n\nDomain Blocking\n\nIn addition to these rare events, the Internet infrastructure company is also subject to court orders from around the globe. In some cases, these orders require the company to block access to piracy-related domain names.\n\nCloudflare mentions these blocking orders in its latest transparency report which covers the second half of 2022. The report doesn’t mention the number of court orders or blocked domains, but it confirms that Cloudflare complies with legitimate legal rulings.\n\n“If we determine that the order is valid and requires Cloudflare action, we may limit blocking of access to the content to those areas where it violates local law, a practice known as ‘geo-blocking’,” Cloudflare writes.\n\nDNS Blocking\n\nDNS blocking orders apply locally and shouldn’t affect people in other countries. However, things got more complicated recently when an Italian court required Cloudflare to restrict access to three torrent sites through its public DNS resolver 1.1.1.1.\n\nCloudflare fiercely objected to the order but ultimately lost the legal battle. That left the company with no other option than to take action. But, instead of blocking content through its global DNS resolver, it geo-blocked the domains for Italians.\n\n“To the extent that those websites used Cloudflare services, Cloudflare took steps following the issuance of the order to disable access to those websites for users in Italy or from Cloudflare equipment in Italy.\n\n“Cloudflare took action to geoblock all three domains that were addressed by the court’s order and were using our service at the time the orders were issued via Cloudflare’s pass-through CDN and security services,” the company added.\n\nIPFS and Ethereum Restrictions\n\nIn its most recent transparency report, Cloudflare further notes that it has implemented access restrictions on its public Ethereum gateway. The company doesn’t store any content on the Ethereum network, nor can it remove any. However, it can block access through its service.\n\nIf Cloudflare receives valid abuse reports or copyright infringement complaints, it will take appropriate action. The same applies to the gateway for the decentralized IPFS network.\n\nIn its previous transparency report, Cloudflare already mentioned more than 1,000 IPFS actions a figure that increased slightly in the second half of last year. At the same time, Cloudflare also restricted access to 99 ‘items’ on the Ethereum network.\n\nSince these are ‘gateway’ related restrictions there’s no impact on the content hosted on IPFS or Ethereum. Instead, it will only make it impossible to access content through Cloudflare’s service.\n\nIt’s not clear how many of these restrictions are abuse or copyright-related, as not much context is provided. The Ethereum actions are, at least in part, a response to the U.S. Department of Treasury’s sanctions against the cryptocurrency tumbler Tornado Cash.\n\n“Those sanctions raise significant legal questions about the extent to which particular computer software, rather than individuals or entities that use that software, can be subject to sanctions,” Cloudflare writes.\n\n“Nonetheless, to comply with legal requirements, Cloudflare has taken steps to disable access through the Cloudflare-operated Ethereum Gateway to the digital currency addresses identified in the designation.”\n\nDMCA Notices and Subpoenas\n\nThere are more obvious copyright responses as well. While Cloudflare generally doesn’t block content in response to DMCA notices for customers that use its CDN services, it does remove infringing content permanently hosted on its servers.\n\nThese hosting services have expanded over the years and the same is true for the volume of valid DMCA notices received, up from 18 to 972 in the span of a year, as shown below. That’s still a fairly modest number for a company with millions of customers.\n\nFinally, Cloudflare reports that the number of civil subpoenas, including those issued under the DMCA, has decreased. Rightsholders including the Motion Picture Association (MPA) typically use these requests to obtain identifying information about Cloudflare customers.\n\nIn the second half of last year, the company received 20 civil subpoenas which targeted 57 domain names. That’s the lowest number since Cloudflare first disclosed this statistic five years ago, signaling a downward trend.\n\n—\n\nA copy of Cloudflare’s latest Transparency Report is available here (pdf)"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9WazFRdGR3R2dLa0tleWh1SDZPY2IwaV92anBEZnFPVWlJRlFaaXRkS3lsR05aeXpGQ3kxbkk5YWRwWWZ3Q25IcEpYZ0Z4RE5UWGliVUpmdGZmZnoxcE90eHVlMzJUa1ZFMHE1SWYycFlpLVQ2NE9PLQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Weekly Highlights: Bitcoin & Ethereum Hold Strong, Altcoins Shine - TronWeekly",
        "content": "The cryptocurrency market wraps up a dynamic week, with Bitcoin and Ethereum holding steady after a significant drop in inflation. Despite the resilience of the market leaders, the spotlight was on altcoins, particularly Kaspa (KSP), Render (RNDR), and NEAR Protocol (NEAR), showcasing notable gains and hinting at potential growth in the near future.\n\nAltcoins Take Center Stage\n\nKaspa (KSP) emerged as the week’s star performer, experiencing an impressive 64% surge, reaching a peak of $0.1519. As of the latest data, KSP is trading at $0.1379, maintaining robust performance despite a slight 2.80% decrease in the last 24 hours.\n\nRender (RNDR) followed closely behind, boasting a 50% gain over the week. Currently trading at $3.58, RNDR displays a marginal 3.46% increase in price, accompanied by a 42.49% decrease in trading volume in the last 24 hours.\n\nNEAR Protocol (NEAR) captured attention with a weekly increase exceeding 30%, now trading at $2.18. NEAR’s impressive performance includes a 20% price increase and an 88.84% surge in trading volume within the last 24 hours.\n\nOther notable altcoins, including Avalanche (AVAX), Immutable (IMX), and Mantle (MNT), also reported gains in their weekly charts. AVAX showed a 24% increase, IMX rose by 22%, and MNT exhibited a 10% uptick, according to data from CoinMarketCap.\n\nBitcoin & Ethereum Weekly Review\n\nBitcoin and Ethereum remained stable after a notable drop in inflation from a 40-year high last June, currently standing at 3.2%, slightly above the Fed’s target, according to the CPI report. Bitcoin (BTC) is in a consolidation phase, trading just below its annual peak at approximately $38,000 earlier this year.\n\nBitcoin’s recent surge marks its most robust four-week performance since January, witnessing a remarkable 42% increase from just under $17,000 to nearly $24,000. Bitcoin’s price dominance has returned, albeit temporarily, with the potential for quick rebounds if market sentiment shifts.\n\nSantiment’s analysis revealed fluctuations in Bitcoin wallets during the recent surge. Numerous new smaller wallets with less than 1 BTC flooded the network, while the 1-100 tier flattened out, and the 100+ tier may be experiencing profit-taking.\n\n🐟🐬🐳 #Bitcoin's wallets have fluctuated during this major market-wide surge. Tons of new smaller wallets with less than 1 $BTC have flooded the network. Meanwhile, the 1-100 tier has flattened out, and 100+ tier may be in the midst of some profit taking. https://t.co/va51CcexC1 pic.twitter.com/PNZtA9ir2U — Santiment (@santimentfeed) November 17, 2023\n\nAccording to Santiment, Bitcoin’s NVT ratio has significantly improved, signaling a healthy circulation of unique BTC relative to current market cap levels. IntoTheBlock reported a yearly high in the new adoption rate of Bitcoin, reaching 67.62%, indicating a surge in new market participants.\n\n📊 #Bitcoin's NVT (Network Value to Transaction) ratio has improved significantly, one of @santimentfeed's primary alpha #crypto market signals for traders. The metric indicates whether the amount of unique $BTC circulating is healthy relative to current market cap levels. 👍 pic.twitter.com/gu4CDDxMt9 — Santiment (@santimentfeed) November 16, 2023\n\nMeanwhile, Ethereum’s fees rose as ETH surpassed $2,000 last week, but transactions remain relatively cheap compared to previous levels. Santiment highlighted Ethereum’s 38% market value surge in the past four weeks, driven by high network growth and an increase in addresses across different tiers.\n\nAs of the latest data from CoinMarketCap, Bitcoin is trading at $37,159.19, showing a 1.23% increase over the past seven days and a 2.36% increase in the past 24 hours. Ethereum (ETH) is trading at $2,023.05, displaying a 0.70% decrease in the past 24 hours and a 4.58% gain over the past seven days.\n\nRelated Reading | Bucking Bearish Trends: Bitcoin’s Unconventional Moonlit Path To A Resilient Bull Cycle"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPUml6cDM1UmJLckFEUXA5eHZHSnRGaGpDaVFpMk5Wb2dBbTg1YTN1WmozMFR1T2ViX2Uzcm54LXktbDJtRzNyVjctcFVNc0NyNm93R1hmczVkSVk0bjhkNDhZT1hTSVFRb195ZU1DTkgydS1IdEdKS3djVlVkUTA5NkY3Vmx6MnBrSkJjTkozVldPWThOeEtpcms5aTJxNWsyZW9mbnpFR0dveDlWR1lZTlhnc3k5TG53WHN4TWJWVmRxV2tkaE11UzduZFZrcEVuakNrc1NBVElpQdIB3wFBVV95cUxNdVEtZTZ2VXNwelBKa0owaUFYTlhoeGRadUVFdEVDQjlaMWN0SG40S0NXQzJMZHhyVGpNYVhUcW9SeFJUWkg3NUxpVTkwTmpFS0UwZ21YYmg5N3VLMlpTU3F2VWl6SkNCc2RvQ1lXdjl4MW5lMmZXYTRjNm45YzVibkExaXZiOHJDZkh2Wmd1NHhNVjRIUlRBTkVLT2ZUX0c0VmVrX0ZCdUQ0VE1tRFZRY29NTmJDV3duYU5rbXBJQlpaT0dvN2ZTOXFyQ095YnJ0TGJXWTNzMU92aWN3X1Vv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Crypto Analyst Calls for Ethereum To Massively Underperform Against Bitcoin, Says Now Is Not the Time for ETH - The Daily Hodl",
        "content": "A closely followed crypto strategist warns that Ethereum (ETH) will continue to lag behind the flagship digital asset Bitcoin (BTC).\n\nTrader Credible Crypto tells his 353,200 followers on the social media platform X that the Ethereum versus Bitcoin pair (ETH/BTC) is still in a macro downtrend.\n\nAccording to the analyst, the ETH/BTC rally spurred by news that investment giant BlackRock filed for a spot market Ethereum exchange-traded fund (ETF) quickly faded, indicating the pair’s weakness.\n\n“ETH/BTC has almost fully retraced the ‘ETF pump’ from last week. Even that narrative was a bit flawed in my opinion because yeah an ETH ETF may be coming but a BTC one is coming first.\n\nSo why would ETH outperform now?\n\nBeen calling for this move down for literally months, and we are over 50% lower since then with more downside coming.\n\nI will be the biggest ETH bull when the time is right but that time isn’t now. Embrace the BTC run that is coming and when the time is right, we can embrace the ETH run that will follow.”\n\nLooking at the trader’s chart, he seems to predict that ETH/BTC will fall down to the green box which covers the range between 0.03 BTC and 0.036 BTC ($1,121 and $1,345).\n\nAt time of writing, ETH/BTC is trading for 0.054 BTC ($2,018).\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNWGxqN1I5cFBhMmtvQkNzUlp6T2F5R1lRTG9KS0Iza2xTdXBtcm1qYVUyOXJWdl9WZ0hHcHlNbFQxYmNmQUFHOXpycVZNQnJOVUd1SzBZdHBSZXhYZlgyckMzZ19GdEl6RWlZWVZiejJJd2NqQUdJRExLUGlZQjEtN05ZOVBUdFhwWjVPc1FoNW5QUEVleDZ3cG9mMjBxV1QtR1hweXRsMGJaMXpxRWY5bnZFUFctN180M250U29QWHJDYjBkYzl5RTdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Cardano Founder Debunks “Pathological Liar” Claims As New Evidence from Ethereum Days Emerges - The Crypto Basic",
        "content": "Cardano founder Charles Hoskinson sought to clear the air after new evidence emerged about his past involvement with the Ethereum Foundation.\n\nCardano’s founder, Charles Hoskinson, has often been haunted by the experience he had in his early days in the blockchain ecosystem, especially while working on Ethereum.\n\nIn the latest development, the Cardano founder was compelled to speak in a 22-minute livestream in which he dispelled the rumors and provided clarity to listeners.\n\n- Advertisement -\n\nAt the heart of the current matter was a video and documentation shared by Steven Nerayoff. Nerayoff was an early Ethereum advisor who had access to essential communication within the team. In the documentation being sold as an NFT, Nerayoff shared previously private information on a troubling period in Ethereum’s history.\n\nAt the time, the Ethereum team wanted to restructure the project and called on Nerayoff for advice, leading to a lengthy call between the advisor and Ethereum’s co-founder, Vitalik Buterin. With or without Vitalik’s permission, Nerayoff recorded the call, which he now wants to monetize as an NFT.\n\nETHEREUM RESCUE & RESTRUCTURE PLAN:\n\nIn late 2014 Ethereum was in trouble. Vitalik Buterin asked Steven Nerayoff to do a full diagnostic assessment and recommendations on how to save Ethereum and restructure it for long term success. Over the early months of 2015 Steven and… pic.twitter.com/o7H0dwMhiy — Steven Nerayoff (@StevenNerayoff) November 16, 2023\n\nNotably, Charles Hoskinson was among the major subjects of the call. A transcript of the call shows that Charles was mentioned 69 times, with Nerayoff speaking favorably of the entrepreneur’s involvement with Ethereum.\n\n- Advertisement -\n\nNew Evidence Clarifies Charles Hoskinson’s Reputation with Ethereum\n\nSteven Nerayoff’s latest reveal suggests that Charles Hoskinson was a valuable member of the Ethereum Foundation. During the conversation with Vitalik Buterin, Nerayoff spoke highly favorably of Charles Hoskinson and urged the team to bring him back into the ranks, given his experience and strengths.\n\nReviewing this part of the conversation, Charles Hoskinson said in the recent livestream, “He [Nerayoff] was trying really hard to bring me back into the fold. At this juncture, I was already deep in the thick of things, starting Input Output [Cardano’s engineering arm].”\n\nAccording to Charles Hoskinson, Nerayoff’s documentation and call with Vitalik dispel three main accusations that were leveled against him by naysayers. The allegations include that ‘Charles is a pathological liar, never contributed to the crypto space, and constantly overstated his role in Ethereum’s early development.’\n\nThe Cardano founder, alluding to recent reports by crypto journalist Laura Shin, added that half-baked stories have helped foster those lies. However, such lies hold no water compared to Nerayoff’s independently released information.\n\nMeanwhile, Hoskinson reiterated his long-term commitment to building out Cardano and his reputation in the crypto space. He noted that he has been in cryptocurrency for over 10 years and has had no “class action lawsuit, legal issues.”\n\nAdditionally, the entrepreneur has sustained an impressive track record, having ‘built a $12 billion dollar valued blockchain, collaborated on over 200 academic research papers, and written a lot of code.’\n\n“You can disagree with the economic value of these things. [Yet] You can’t disagree with the fact that I’m here and I’ve been building things,” Charles Hoskinson added.\n\nNotably, Cardano (ADA) has consistently ranked among the top ten cryptocurrencies by market capitalization in recent years. At the same time, the blockchain has seen increased DeFi TVL in the past few months, underlining its continued growth."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE11cy1FR3c0SnE1R1h3bHVGbzJfN21kMjM4TVJ6b05OM0M2RkJFTkNZNUJRNG4zck1PMWxSS2Z1amV4eHFDM1NwYkV4Q2FZM3ZWWmZJRWNyY2NLLU0yV05NSmF0OVVvSlBYUHA3MkhqWFc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 14:08:11 GMT",
        "title": "A spicy salvo launched in the monolithic vs modular debate - Blockworks",
        "content": "As blockchains scale, the cost of transactions and blockspace falls. The 2022-2023 bear market has been characterized by a continuous build out of infrastructure, to lay the groundwork for future growth.\n\nYet arguments about the best way to scale abound, they often fall into one of two camps.\n\nOne is “modular,” with its standard-bearers Ethereum and Cosmos. The other is “monolithic” which has come to be dominated in the crypto zeitgeist by Solana — although they prefer the term “integrated.”\n\nAn essay published Friday by pseudonymous Ethereum advocate Polynya critiquing monolithic blockchains, while not mentioning it by name, has been interpreted by many as a veiled critique of Solana.\n\nThe critique comes against a backdrop of swelling interest in the network spurred by a significant price surge in Solana’s native crypto asset (SOL), which is up 140% in the past month with a market cap approaching $25 billion​​​​.\n\nWhile often praised for its high transaction speed and low fees, Solana has faced criticism in the past for network instability, including outright outages, and high hardware requirements to operate validating nodes​​.\n\nResponding to perceived shortcomings, Anatoly Yakovenko, co-founder of Solana, has acknowledged some network flaws, but contends the Solana community has worked diligently to mitigate them.\n\nYakovenko views these challenges as part of the network’s growth, likening them to historical issues faced by other major networks like Ethereum and Bitcoin.\n\nPlans include the mid-2024 launch of Firedancer, the first independent validator client software for Solana (Ethereum has 5), which is expected to increase throughput to as much as a million transactions per second (TPS) in the future.\n\nYakovenko, responding to Polynya’s specific critique, argued the natural growth in computing power coupled with falling costs as hardware becomes commoditized will handle Solana’s needs with aplomb.\n\nLoading Tweet..\n\nPolynya’s essay also advocates for advanced technologies like validity proofs and data availability sampling to address scaling demands, predicting “every single monolithic blockchain seeking scale will upgrade to tech like validity proofs and data availability sampling or be risk [obsolescence].”\n\nSolana developer Mert Mumtaz, CEO at Helius and co-host of Blockworks’ Lightspeed podcast, responded that Solana could embrace both vertical and horizontal scaling.\n\nLoading Tweet..\n\nPolynya further lamented the crypto industry’s disproportionate focus on infrastructure over user onboarding — and a dearth of applications with product-market fit — which Mumtaz derided as the pot calling the kettle black.\n\nLoading Tweet..\n\nIn response to criticism, Polynya published an addendum post on Sunday in which they acknowledge the tone of the original essay was a bit harsh, but noted “content only gets attention in crypto if it’s provocative.”\n\nMonolithic chains that integrate modular components, such as validity proofs and data availability sampling, would be a welcome change, Polynya argues, suggesting they would no longer be “monolithic” because “per my definition you no longer need all nodes to naïvely reprocess all transactions to verify integrity.”\n\nEndgame\n\nUltimately, this dispute revolves around the question of what is the modus operandi of using a blockchain?\n\n“The whole point of a public blockchain is lost if you are not resistant for the worst-case scenarios,” Polynya wrote. “[10,000 nodes] is not enough, and we should strive to have 100,000 nodes in different types of places across the world. We need nodes at homes, schools, government offices — in large cities, in villages, in Chile, in Papua New Guinea, and eventually in space.”\n\nSolana currently has between 2,000 and 3,000 nodes.\n\n“It’s perfectly fine to have a monolithic blockchain today, the technology to push past its crippling limitations did not exist 5 years ago,” Polynya concludes, with the caveat that the industry will “inevitably converge” on a design using validity proofs and data availability sampling.\n\n“This is the only currently known way for the blockchain world to achieve our endgame of global scale, all verified on our mobile phones.”\n\nPolynya further warns against continued “Ponzifying” of dapps. “As an industry, collectively, we must invest in consolidating our existing applications which have product-market fit, before traditional incumbents catch up and take away market share,” they said in Sunday’s denouement.\n\nUpdated, Nov. 20, 2023 at 9:52 am ET, with additional context.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPTnhvS0lGU3pOaG5kMElqLWdocGhUb2lJa19xS1RxYnJqVEdaUHhaNnBiUVk4NGx4Z2dRZ2Q2WFBDb21zU0ZPS1E2enNNZ3paQ3Q2RklkanJkVXlHWXZhVzNvVC1kaThXMFI2cmI2VjU2LUxqVl9Ub1F5QUlRXzZ5a0VaWVB2RFpkOFVpMDM3MklLZC1PNnpZNHB3UmlQTnFNWWs4TldmeGtoWVh0Ukc5MG8xN0sxZXN4TGlPUE5sUdIBxAFBVV95cUxOUHJON29Xa3lla2pRUjVlZ1J3dGhNdm1Jc2Rod1hzMWhLWmZJcFpUVGY5RFE3QVBKQWhiaHlpZzFtWjNYYmlJb25hMHZydThZc2pOUURxY1YxN09FOTdqTERxUFVlY1pvN0VNRlM2R2Eyb3ROQUNkb1VqMmoyZkJBYmk1ejZ6UzhwS1hQR09xcXNHRFVmdFZocmw1SHNJU3ZYUUFPc3I1MUFNRWtneVpyei1vMGtCcmhyMUxENWF5RHRUb2xr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Santander Private Bank Introduces Bitcoin, Ethereum Trading for Clients in Switzerland - CoinDesk",
        "content": "“The Swiss regulation related to digital assets is one of the first and most advanced in the world, since it provides clarity and a comprehensive regulatory environment for our clients,” said John Whelan, head of crypto and digital assets at Santander, in an email. “As holding of crypto as an alternative asset class continues to expand, we expect that our clients prefer to rely on their existing financial institutions to be responsible for their assets.”"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPQjR1Y2o4YWl4NWFYTnNHZUxNLVdnOGwtT3RLUklCSXpIYU9RaGpXNUFiYVBoemFyaUh5VEdtLTFyYmk2VngwdF9HVFBJSDlQY1MtU2NNUTZKT053NFA3eWhxc21mNXpXZUhpTTE2SVhBVjlJU1JtTVA2UThkVlc3Njk2b05kSlZiNzVIcndiX1NSM1Y5RkY3bnJMTGRMdldYdlFEazNYcUI2WW5NeTFjeEMydXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Cathie Wood Makes Bold $600K Bitcoin Price Bet, Ethereum at Around $2K, Everlodge to Explode? - CryptoPotato",
        "content": "Cathie Wood of Ark Invest predicted that Bitcoin (BTC) could surge to $600,000, and enthusiasts began accumulating this crypto.\n\nEthereum (ETH) also climbed above the $2,000 price range for the first time since April amid renewed interest. Everlodge (ELDG) is also making waves as it entered Stage 7 of its presale. To see how far each crypto can climb, we will be going over them individually.\n\nJoin the Everlodge presale and get a chance to win a luxury holiday to the Maldives\n\nBitcoin (BTC) to Spike to $600,000 According to Ark Invest CEO\n\nCathie Wood, CEO of Ark Invest, made a bold prediction that Bitcoin (BTC) can see a major price upswing to $600,000.\n\nWood discussed the potential of Bitcoin and the broader digital currency market, putting attention to an upcoming launch of new digital asset ETFs. This will take place through Ark Invest in collaboration with 21Shares. Moreover, Wood went over the anticipated approval of a spot Bitcoin ETF by the U.S. Securities and Exchange Commission (SEC).\n\nDuring the past week, the BTC crypto saw an upswing from $35,266.34 to $37,903.66. Now, the cryptocurrency corrected to around $37,100.\n\nEthereum (ETH) to Break Above $3,200 in Q1 2024\n\nEthereum (ETH) has climbed above the $2,000 price barrier during the week. At the time of this writing, the cryptocurrency is trading at slightly above $2,000.\n\nThere has been an increased euphoria surrounding the crypto, especially after the filing of the first Ethereum spot exchange-traded fund by global leading asset manager BlackRock.\n\nAs for the recent price performance, Ethereum saw an increase of 25% in the past 30 days. The crypto went up in value from $1,913.93 to a maximum point of $2,128.61.\n\nEverlodge (ELDG) to Democratize the Real Estate Market\n\nAside from Bitcoin and Ethereum, another crypto to watch is Everlodge. This is an upcoming real estate marketplace that is being developed to enable anyone globally the opportunity to access the otherwise illiquid market. The platform will make it accessible through fractional NFT ownership.\n\nEach property will get digitized and then split into smaller pieces worth just $100 each. This way, enthusiasts will be able to diversify their holdings whilst also retaining benefits.\n\nAs the property increases in value, the NFT could climb as well. Moreover, they can get rental income from properties, depending on their ownership percentage. ELDG is the native crypto, and it can be staked for passive income.\n\nDuring Stage 7 of the preamble that just started, the crypto trades at $0.025.\n\nFind out more about the Everlodge (ELDG) Presale\n\nWebsite: https://www.everlodge.io/\n\nTelegram: https://t.me/everlodge"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNMVBNSVhBTEhBNEt1a3hfTkRHcmlQazdCTjNVczdYOERpVHEwR0NOTTdQQXAyY1BQUUNyMnFYdEtEcHo5R0VmVVVEOW5ObTVXM2FBNVlsOXNsMDVTZVMwZWN5eUxnZmJzS2U3RHpTSUFHT0x1c1lZTF9jNWhmdWRKOG1FcFpmVTdIWDF3cTZYRjJhZjB3a1pMRUZGVkJQSzBKTGlPX0tidTlpSDduZE1tV1JMYXAxTWo4NVFJcmtMRzBYS0RMYndN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Crypto trading volumes soar, BlackRock files to launch spot Ethereum ETF, while Tether goes Bitcoin mining - City A.M.",
        "content": "Crypto trading volumes soar, BlackRock files to launch spot Ethereum ETF, while Tether goes Bitcoin mining\n\nData from CryptoCompare shows that the price of Bitcoin started last week with a sharp move downwards, dropping from around $37,000 to a low near $35,000, before recovering to now trade at $37,100 per coin.\n\nEthereum’s Ether, the second-largest cryptocurrency by market capitalisation, moved steadily upward throughout the past week, going from around $1,940 per coin to a peak near $2,050 before a small correction over the weekend brought ether down to $2,020 a token.\n\nEthereum’s price kept rising as BlackRock – the world’s largest asset manager – filed an application with the US Securities and Exchange Commission (SEC) for a spot Ether exchange-traded fund (ETF), the iShares Ethereum Trust.\n\nThe fund would aim to “reflect generally the performance of the price of Ether”, and would have Coinbase as the custodian for the ETH held by the fund. Ethereum’s price started climbing after BlackRock registered the iShares Ethereum trust with Delaware’s Division of Corporations a week ago.\n\nBlackRock has filed the S-1 prospectus for its Spot Ethereum ETF with the SEC, earlier this morning.\n\nThe filing, among other things, appoints Coinbase as the Custodian for the underlying ETH.\n\n\n\nThere appears to be no mention on whether the Trust will actively be staking the ETH… — Tree News (@News_Of_Alpha) November 16, 2023\n\nWhile the spot ETH ETF filing helped the price of Ether rise, a fake XRP ETF filing sparked a trading frenzy that saw the price of the cryptocurrency rise as much as 13% throughout the week, before BlackRock denied any involvement. XRP’s price then erased its gains, leading to over $7 million in liquidations.\n\nThe fake XRP ETF filing also appeared on Delaware’s website, and Delaware’s Department of Justice could now be looking into the fraudulent filing. It’s unclear how it ended up on the website.\n\nMeanwhile the cryptocurrency arm of the Chicago Board Options Exchange, Cboe Digital, is set to introduce margined Bitcoin and Ether futures contracts on January 11, following their their receipt of approval from the Commodity Futures Trading Commission (CFTC) in June.\n\nThe move will position Cboe Digital as the first regulated U.S. platform to provide both spot and leveraged derivatives on a single platform. Margined futures enable traders to utilize leverage to trade beyond their collateral, a feature not available with regular futures.\n\nCrypto market volume soars amid South Korean trading frenzy\n\nIn the last two months, the volume of the digital asset market has experienced a significant rise, largely driven by trading activity in Asia, particularly South Korea. According to CCData, South Korean exchanges have more than doubled their market share, increasing from 5.2% in January to 12.9% in November. The total trading volume also saw growth in October and November.\n\nThe firm’s recent Exchange Review report details that Upbit, a centralized exchange, witnessed a substantial increase in market share in October, accounting for 9.16% of the trading volume on these platforms.\n\nThis is the highest market share that the Korean cryptocurrency exchange has achieved since its inception, with local traders reportedly focusing on altcoins.\n\nMeanwhile cryptocurrency exchange giant OKX has started offering derivatives trading off of its platform, eliminating the counterparty risk of holding assets on an exchange, at a time in which it’s also introducing its own layer-2 blockchain called X1.\n\nPoloniex, a well-established cryptocurrency exchange, suffered a major security breach after hackers stole over $100 million worth of digital assets from its hot wallets and used some of the funds to pump the price of TRX, a cryptocurrency created by Poloniex investor Justin Sun.\n\nTether to spend $500 million on Bitcoin mining expansion\n\nLeading stablecoin issuer Tether has started venturing into the Bitcoin mining industry with a significant investment, aiming to become a global leader in the sector. Tether’s incoming CEO Paolo Ardoino has revealed the firm is investing $500 million over the next six months to strengthen its position in the sector.\n\nArdoino has revealed that Tether is establishing Bitcoin mining operations in Uruguay, Paraguay, and El Salvador. Each of these locations will have a power capacity ranging from 40 to 70 megawatts. The company’s objective is to increase its portion of the Bitcoin hashrate, which is the computational power that underpins the network, to 1%.\n\nMeanwhile, global banking giant JPMorgan has launched a new programmable payment option for its institutional clients using its proprietary blockchain platform JPM Coin.\n\nThe latest feature provides institutional clients with the ability to establish treasury operations that are programmable and operate in real-time, laying the groundwork for cutting-edge digital business models, according to JPMorgan.\n\nFrancisco Memoria is a content creator at CryptoCompare who’s in love with technology and focuses on helping people see the value digital currencies have. His work has been published in numerous reputable industry publications. Francisco holds various cryptocurrencies.\n\nFeatured image via Unsplash."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQT2xueUFwSFJBLW03RkpPa2hFOGI4bW4tX19uazNjOWNjNEVLN09hSHFadjNYXzBoMUdxN0RJSnZnMGp3T0dXZlBzMVJVTDFUUEtaMVpDVThwdERQMy00aHNPNERqelBrTGVGR18yazVvWWxlUFA0RlI5NC0wZlNnZVdTc2dyc3ZWZU96SnFmQXQ1SHpfa0NBN2R3TU5Oc0J1T3RqamxJc1NkTjAwa3Fr0gG0AUFVX3lxTE1KeXZ1c0hudWNxcnV2TFllRXowMVQ3YWI1VTdJNU5fN056bVlCY3VHbk5OVkdpR2FSVW55MU1CbXlLT3JndHZRUGNKeTdJRmRVSGZOV1JLZW5SUV9YZk9rWHBhZFJlSlVRWWZnT1loS0RLUHdJOTZvUGxxa1RGVGhKSENKV0VwYU9mX2t4VEllckVhcUNDc2ZnbXRfTHN2ZVJOcVVHTGVsd0F1U2ZBcmlGY3ZmQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Change of Heart: Santander Launches BTC, ETH Services to High-Net-Worth Clients (Report) - CryptoPotato",
        "content": "The global division of Spanish financial institution Banco Santander – Santander Private Banking International – has reportedly introduced a new feature that enables customers with Swiss accounts to engage in the investment and trading of Bitcoin (BTC) and Ethereum (ETH).\n\nGiven Banco Santander’s extensive history of more than 160 years and its broad customer base of 166 million individuals, the private banking division, which attends to 210,000 affluent clients and oversees assets and deposits amounting to around $315 billion, holds significant influence.\n\nHence, the decision to permit high-net-worth clients associated with Santander Private Banking International to engage in BTC and ETH trading is noteworthy and has notable implications for the industry.\n\nSantander’s Historic Move\n\nAlthough Santander’s initial launch of cryptocurrency trading services is said to be limited to BTC and ETH, the banking giant plans to expand its offerings to include other cryptocurrencies once they meet the specified screening criteria, as per information obtained from an internal communication leak reported by Coindesk.\n\nThe report states that Santander initiated the provision of BTC and ETH trading services in response to client requests via relationship managers.\n\nThe bank intends to safeguard the private cryptographic keys of the tradable assets within a regulated custody framework.\n\nJohn Whelan, head of crypto and digital assets at Santander, reportedly said in an email,\n\n“The Swiss regulation related to digital assets is one of the first and most advanced in the world since it provides clarity and a comprehensive regulatory environment for our clients. As holding of crypto as an alternative asset class continues to expand, we expect that our clients prefer to rely on their existing financial institutions to be responsible for their assets.”\n\nSantander is yet to officially confirm the development.\n\nTryst With Crypto\n\nThe latest development comes almost a year after Santander announced its intention to restrict UK customers from making real-time payments to cryptocurrency exchanges, citing a commitment to shielding its customers from potential scams.\n\nIt had then cited witnessing “a large increase in UK customers becoming victims of cryptocurrency fraud” behind the decision. The financial giant also expressed intention to further “protect customers” by blocking all faster payments they identify to cryptocurrency exchanges from Santander accounts, a move that was expected to be implemented during 2023\n\nHowever, by June 2023, the bank had shifted its stance and initiated an educational series for its customers focused on digital assets.\n\nWhat makes this change noteworthy is its alignment with a growing interest from institutional entities in crypto assets. Many traditional institutions have joined the trend of embracing Bitcoin ETFs to offer their clients an indirect exposure to cryptocurrency."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxQZ19kWHE4QWFxWFZlcmRSNTVTNmlfQzRYYTNua2ViY3k0RkNtYzQtM3I0ekxMa05ub2Y0cEFCQ0kzUDgwYkFLU3JRaXRjd2JEbkNZOFlkanQ3T0xSSkRRd2dDUnZ1LUdWVXVBbTB4Tk1zanR5ZFpVQTdtVm1QWWpxUUg1S0NYS2F5RmhfQjI4VmM0ay1KVnMtd2R3UThCSjlsVW9jUTQ3UGlQc1RWaGdkdlF4c2VBbmwteDVmX2M3dEp6M1RGLXBMcW1kb2VRVVNhUXNhVGVIQ01rSjRtVU9VYVZIZU9uSHhSLTAwYnNIdmhJOWdoTld4NtIB_gFBVV95cUxNXzVnS2ZuWjVSRVRtbGRFY0xkYnVpZVg2RGNVZ1hCaUEwYTJYdVZUU3YtU3JRVWR1UV9BNGpiMjVsVTlPLVpYaWl5OENXRGlzTjhiYnVPay01Uk5kdXJZMS0xT1pBdi1aeWxHempuZmtMVGNtNXlhQXVZMElUdklNY25UZmVfSVZmcWxYVGd5cnJjYzhsUTZMZ3lfY1dXdGRjbGNxZXRMMVJ2U0NQOFc1dmRHUnlURHVGdEk5Sjk2Nkh5ZU81TklxNFk0SGNPZFBhVElVMU1nREVHUGc4eGdua3VpRXpjSkFQNnFocGhuank0X0xZR2RVVXphcVY4UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Climbs Above $37,000, Ethereum Rises Above $2,000 - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, managed to rise above the $37,000 mark, riding high on the news of the Argentine presidential election win of Bitcoin-friendly Javier Milei. Ethereum (ETH), on the other hand, cashed in on a boost caused due to Fidelity seeking Ethereum exchange-traded fund (ETF) and climbed above the $2,000 mark. Other popular altcoins — including the likes of Solana (SOL), Ripple (XRP), Litecoin (LTC), and Dogecoin (DOGE) — landed in the reds across the board.\n\nThe global crypto market cap stood at $1.41 trillion at the time of writing, registering a 24-hour gain of 1.75 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $37,175.82, registering a 24-hour jump of 1.80 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 32.59 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,002.90, marking a 24-hour gain of 2.46 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.75 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour jump of 2.23 percent, as per CoinMarketCap data, currently priced at $0.08023 As per WazirX, Dogecoin price in India stood at Rs 7.07.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour jump of 0.92 percent. At the time of writing, it was trading at $70.38. LTC price in India stood at Rs 6,152.23.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.6239, seeing a 24-hour gain of 2.69 percent. As per WazirX, Ripple price stood at Rs 54.85.\n\nSolana (SOL) Price Today\n\nSolana price stood at $59.85, marking a 24-hour jump of 3.40 percent. As per WazirX, SOL price in India stood at Rs 5,340.\n\nTop Crypto Gainers Today (November 20)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nSynthetix (SNX)\n\nPrice: $3.50\n\n24-hour gain: 21.19 percent\n\nNear Protocol (NEAR)\n\nPrice: $2.01\n\n24-hour gain: 15.88 percent\n\nArweave (AR)\n\nPrice: $9.04\n\n24-hour gain: 13.90 percent\n\nImmutable (IMX)\n\nPrice: $1.31\n\n24-hour gain: 13.60 percent\n\nGala (GALA)\n\nPrice: $0.02531\n\n24-hour gain: 10.58 percent\n\nTop Crypto Losers Today (November 20)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nCelestia (TIA)\n\nPrice: $6.57\n\n24-hour loss: 6.71 percent\n\nRender (RNDR)\n\nPrice: $3.27\n\n24-hour loss: 4.52 percent\n\nXDC Network (XDC)\n\nPrice: $0.05247\n\n24-hour loss: 1.80 percent\n\nUNUS SED LEO (LEO)\n\nPrice: $4.05\n\n24-hour loss: 0.57 percent\n\nORDI (ORDI)\n\nPrice: $22.71\n\n24-hour loss: 0.55 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin is presently trading above the $37,300 level, following the victory of pro-Bitcoin candidate Javier Milei in the Argentinian Presidency elections. To maintain this positive momentum, Bitcoin will need to clear the resistance at the $37,800 mark or risk finding support around $36,500. Meanwhile, the Altcoin Near Procol (NEAR) has marked a substantial 17 percent price increase over the past week, thanks to its partnership with the South Korean platform Zep for metaverse game development. Ethereum, on the other hand, is trading around the $2,000 threshold.”\n\nParth Chaturvedi, Investments Lead, CoinSwitch Ventures, said, “The crypto market started gaining momentum on Sunday, as a pro-Bitcoin candidate — Javier Milei — won the elections in Argentina. On this account, BTC (+2.2 percent) observed a steep rise before correcting near $37,200 levels. Analysts predict support to range between $33,000 to $34,500 with resistance at $38,000. On the institution adoption front, Fidelity has become the latest financial firm that is seeking to create an ETH ETF. Joining its rival BlackRock and 5 other companies, the entry of such financial giants in embracing crypto provides positive signals for the sector.”\n\nRajagopal Menon, Vice President, WazirX, said, “Dogecoin soared dramatically following a groundbreaking partnership with SpaceX, propelling its value to unprecedented heights. Simultaneously, Bitcoin faces market fluctuations, prompting reflection and comparisons to its 2021 performance. Tether strategically invests $500 million in Bitcoin mining, signalling a deliberate expansion and diversification within the stablecoin sector.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin is trading cautiously on the upside at $37,100 and a notable threshold at $38,000. Support levels at $35,835, $35,235 and $34,522 highlight potential stabilization points in the downtrend. Technical indicators present a mixed but slightly bullish scenario with RSI at 51 indicating a balanced sentiment. The 50-day EMA at $36,400 supports a short-term bullish trend. Chart analysis reveals a slight ascending channel, indicating a potential continuation of the bullish momentum. Overall, while favouring bullish trends above $36,400, the market remains cautious, with immediate resistance and support key for short-term moves and potential moves in the coming days.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The overall crypto market cap crossed the 1.4-trillion dollar mark with BTC and ETH leading the effort. ETH breached the $2,000 mark per piece due to the euphoria around the Blackrock spot Ethereum ETF application. BTC crossed the $37,000 mark over the weekend and the market is expected to ride the ETF wave in the coming weeks owing to the favourable macroeconomic conditions.”\n\nCoinDCX Research Team told ABP Live, “Over the weekend, both BTC and ETH showed strength, each gaining more than 2.5 percent. This unexpected resilience during the usually quiet weekends might be because of the positive news about Javier Milei, a supporter of Bitcoin, winning the presidential election in Argentina. He sees Bitcoin as a way to return money to the private sector. Looking at the technical side, BTC has consistently bounced back from an important incline trendline support and the 20EMA Daily. Currently, it's trading a bit above $37,300, aiming for the next resistance at $38,000. As for ETH, it's sitting around the Support and resistance flip level of $2,011. Breaking through this could push the price to a major resistance level at $2,130, with ETH keeping above the 20-EMA Daily.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOTVYzdDhBeEx4TGhYNTRXdWhPbjBFanNvSnBCTzVqNmUtNlp6a0dZNWMzd1NzQW5NaXhMN3JXeE1PUWptNkdZcXc0MUJzUG5LenM4OTU5N3pENW1PRXQxWGN1VWd5WGtfc2tnSVkwQUppb2dPMk5NbmRaLUN5VVZMeU1nNGxlVy1GWnczNXJadUbSAZYBQVVfeXFMT2dWRGJ2eHJFc25rZlNmcUxsZlVYdnliZWdRcFNOOUxMRFJhaHBrdDg1YnpNZERKcUh4ckxDUDFtWUZkYm01S0JaYmQxM0Y0eDVhWW5qTzlxWDhnakdxRWF1WG54aDN0cTg0Xy1Obkw0X3VlcWR5cnJmUjVtem8yWVN1eVNHZm02eGF6d1gtLWNCMmVYSllB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Here’s Why ETH Price Recovery Could Extend to $2200 - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nStory Highlights A rising wedge pattern leads to the current recovery trend in ETH.\n\nThe ETH price may rise 12% before hitting significant resistance at $2250\n\nA bullish breakout from the resistance trendline of the wedge pattern should intensify the buying momentum.\n\nThe leading cryptocurrency Bitcoin struggling to surpass the $38,000 mark and delayed approval from the U.S. SEC for some Bitcoin spot ETF has led to a correction in ETH price after hitting a monthly barrier of $2137. Within a fortnight, the coin price has plunged 6% to currently trade at the $2008 mark.\n\nHowever, this correction could be a minor pullback before the Ethereum price takes the next recovery leap, indicating the ETH price prediction has a bullish outlook for the near future\n\nHealthy Retracement Keeps Ethereum Recovery Intact\n\nSource- Tradingview\n\nThe ongoing correction in the Ethereum price can be followed using a downsloping resistance trendline of the 4-hour time frame chart. The coin price reverted several times from the overhead trendline reflecting the market sentiment of selling on a bullish bounce.\n\nUntil this trendline is intact, the ETH price may prolong its ongoing downward trend. However, as per the Fibonacci retracement tool, this pullback is still above the 50% retracement level, which is considered healthy for bullish momentum and carries a long-term recovery.\n\nThus, the market participants bullish on Ethereum should wait for a breakout above the resistance trendline to get better confirmation of trend continuation. The post breakout would surge the prices 12% higher to hit the upper resistant trendline of the long-coming wedge pattern around $2200-$2500.\n\nTechnical indicators:\n\nMACD indicator: A bearish crossover between the MACD and signal lines projects as a correction trend in action.\n\nEMA: the 20-day EMA slope is offering strong pullback support to the ETH price\n\nIs ETH Price Ready to Hit $2500?\n\nA look at the Daily time frame Chart shows the Ethereum price has been carrying a steady uptrend under the influence of a rising wedge pattern. As the anticipated rate is likely to reach the upper resistance of the pattern, the coin price may witness an intense surge in selling pressure around the $2250 mark.\n\nThe historical data shows a retest to the upper trendline has often resulted in a significant correction within the wedge pattern. Thus, for better confirmation of a bullish trend, the buyers must surpass this overhead trendline.\n\nUnder ideal conditions, the wedge pattern breakout could lead the ETH price rally to $3400."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQRmZZbTV6MDgxR01pTHE4b0J4S2dWYXBOSTcxckJXNlNKRzBFZ2g5QXdLVVpxeDdyUktqVS1xY0wwa0JRV3hlMFVUZjZ5ODhIY09BazlfWS1ycEZYcFNLTUU2ZEE4YUN5YWtTa3dxZTVSZkQxV3phWmtuVk5GRW5VTlM5ZDZLU1JoTG1mSV9RSUZVdDg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Blast is an Ethereum L2 with native yield for ETH and stablecoins - Get Invite for Blast Airdrop - Gizmo Times",
        "content": "So, a new chain has emerged, and this time, it comes with backing from the big names including Paradigm and Standard Crypto. It’s called Blast, and they say, “Blast is the first L2 that incorporates native yield. Your balance on Blast compounds automatically.”\n\nBlast yield comes from ETH staking and RWA protocols. The yield from these decentralized protocols is passed back to Blast users automatically. The default interest rate on other L2s is 0%. On Blast, it’s 4% for ETH and 5% for stablecoins.\n\nHere’s how Blast works.\n\nAuto Rebasing\n\nUsers transact in ETH. Dapps are built around ETH. Blast was designed from the ground up so that ETH itself is natively rebasing on the L2.\n\nL1 Staking\n\nBlast only became possible this year following Ethereum’s Shanghai upgrade. ETH yield from L1 staking, initially Lido, is automatically transferred to users via rebasing ETH on the L2.\n\nT-Bill Yield\n\nUsers who bridge stablecoins receive USDB, Blast’s auto-rebasing stablecoin. The yield for USDB comes from MakerDAO’s on-chain T-Bill protocol. USDB can be redeemed for USDC when bridging back to Ethereum.\n\nBlast contributors have raised $20m from Paradigm, Standard Crypto, eGirl Capital, Primitive Ventures, Andrew Kang, Hasu, Foobar, Blurr, Will Price, Hsaka, Santiago Santos, Larry Cermak, Manifold, Jeff Lo, and other crypto-natives.\n\nA quick comparison done on the website of Blast shows that it is better than Optimism and Arbitrum in terms of giving native yields, and it shares all the gas revenues with the developers on the chain, and there are substantial incentives to devs compared to what the devs on the other two chains get.\n\nRight now, users can bridge their funds to Blast, get an early entry into the Airdrop leaderboard, and invite friends to make a team that deposits at least 5 ETH in total, so that they qualify for the squad reward where the entire squad is rewarded with points. The Blast Community Airdrop is split between Early Access Members (50%) and Developers (50%). The ETH that you deposit right now is available for withdrawal in February 2024 when Blast Mainnet gets launched, and the actual distribution of Blast airdrop is going to happen in May 2024.\n\nIf you need invite codes for Blast, you can tweet reply to me @thecaptaingates and I will try to share a few as and when I get them from the squad. Make sure you RT the post that mentions Blast."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1rMXBoNzY3a0h6dUlrVmVHcVFQSXVja3J6RzN3Vld0S1VPbzQ2UEM4TGRUbFJJaUdsVHZlQmFES18xM2pEWTQzV2dOWjdMS3lLc0ZEcXdlczM4SzcxdGpfcnZIZjV6WXN0NHo2Rm14NG1SVmJIOGfSAXtBVV95cUxNR3p6ME9yWFZUN1hxVUgxU241RkZ1cTdJY0tFajJxNWNLMjdMcW1wRnU1aVVGd09mb3lzeDdzUFJmT0pMVjVJUnk4ZlNEMDJTcVlTZkltTUpnQzhsWnV4c0QzZE9fdWtLb0xiOU9JZmdWSlg0NXBQUUVBTXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Blast secures $20 million for Ethereum L2 - NameCoinNews",
        "content": "L2s currently offer a 0% interest rate to their holders. Meaning, it is definite for them to lose the value of their holdings, for they depreciate over time. However, Blast is on a mission to change this by offering 3-4% on ETH through the staking mechanism. Leading ventures like Paradigm and Standard Crypto have invested $20 million to back the process. Others who have invested their financial interests in Blast are Andrew Kang, jez – known as izabel_eth on X, and Larry Cermak, to mention a few.\n\nBlast has chosen Ethereum as it sports its own version of risk-free interest. It is similar to the one that the US economy has, wherein the Federal Bank leverages the interest rate to keep inflation under check. Investors can only access these through T-Bills. Citizens must beat these interest rates to avoid losing money.\n\nUsers of Blast have a chance of earning 3–4% from Ethereum staking. The balance in their wallet compounds annually, in addition to the rolled-out rewards.\n\nSimply put, the balance of a user depreciates with other platforms. The same is not the case with Blast, where users have a chance to accumulate staking and Blast rewards. Blast participates in ETH staking to pass the yield back to the users and dApps of L2. Every single ETH counts to automatically grow in the future. All a user has to do is keep it in their wallet.\n\nNot just ETH, but stablecoins are also eligible for annual accumulation. Yields are different, though, with ETH registering a yield of 4% and stablecoins doing the same at a slightly higher yield of 5%. Built by ‘Pacman | Blur.io’, the EVM-compatible optimistic rollup supports stablecoins including, but not limited to, USDC, DAI, and USDT. Users receive yield only in the form of USDB. That is the auto-rebasing stablecoin.\n\nBlast has further announced early access to its functionality. Early Access is invite-only, said Blast in the announcement before stating that those who are found eligible to participate will be rewarded with Blast Points. Members will have points that are higher than others. All they have to do is Quote Tweet the thread, explaining why they are excited about Blast. The team will select 20 random Quote Tweets and DM them the invites.\n\nThe development occurred several months prior to the Mainnet launch of Blast. Blast is scheduled to go live on Mainnet in February 2024, per the roadmap. In May 2024, the redemption feature will be activated, allowing members to exchange their Blast Points for items they choose.\n\nA mention of ETH in the announcement has done a small job of boosting its trading value. At the time of articulating this piece, the token’s value slipped by 0.24% to $2,014.00.\n\nThe stage is set for users to express their excitement and stand a chance to win invite-only access to Blast. This will reward them with additional points on top of the standard percentage."
    }
]