[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiT0FVX3lxTE9WZVFlcVFJVWZ6NGVPSjREYTdXTFFQQ3kteGN3S1JKdWZvNnhodXk4WGQ0YmhMRi02cmRYek91OFBKWkg0R1UxcVdXeUVHUXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "What Is Ethereum (ETH)? - The Motley Fool",
        "content": "Ethereum is a blockchain supported by a decentralized network of computers all over the world. Established in 2015, Ethereum introduced the idea of smart contracts, which are bits of code written into the blockchain that can support various types of applications or even new cryptocurrencies. The native token of Ethereum is ether (ETH 1.09%), which is used to pay for certain activities on the network. Read on to learn what Ethereum is, what you can do with the Ethereum technology, whether ether is a good investment, and the difference between Ethereum and Bitcoin (BTC 1.98%).\n\nImage source: Getty Images.\n\nWhat is Ethereum? What is Ethereum? The basic idea of Ethereum is that it’s a platform that can execute and verify application code without the need for a central authority. It does this through an implementation of blockchain technology run across a decentralized network. Blockchain is a concept used to secure data on a network. Basically, it ensures nobody changes the data on the network without authorization from the majority of people using it. A decentralized network means there’s no single point of authority, like a corporation or government, that can make changes to the data on the network. Ethereum uses a proof-of-stake model to secure the blockchain. Network members must stake Ethereum’s native cryptocurrency, ether, to verify blocks written to the Ethereum blockchain. Ether is also used to pay for work done on the blockchain. Some merchants and service providers will accept ether as payment.\n\nWhat can it do? What can Ethereum do? Ethereum and the concepts pioneered in its development form the backbone of many advancements in blockchain technology. Using smart contracts, which are bits of code written to the blockchain, has allowed people to build all sorts of applications, including: Stablecoins. A stablecoin is a cryptocurrency that maintains its value relative to a fiat currency like the U.S. dollar. There are several mechanisms you can use to maintain that value that smart contracts can enforce.\n\nA stablecoin is a cryptocurrency that maintains its value relative to a fiat currency like the U.S. dollar. There are several mechanisms you can use to maintain that value that smart contracts can enforce. Lending applications. You can write a smart contract that enforces the terms of a loan -- interest rate, term, how the loan is paid back, etc. This can make it easier for people to get a loan and for individuals to loan money directly and collect more interest.\n\nYou can write a smart contract that enforces the terms of a loan -- interest rate, term, how the loan is paid back, etc. This can make it easier for people to get a loan and for individuals to loan money directly and collect more interest. Decentralized exchanges. You can directly exchange one token built on Ethereum for any other Ethereum-based token with minimal fees.\n\nYou can directly exchange one token built on Ethereum for any other Ethereum-based token with minimal fees. Non-fungible tokens (NFTs). You can create a unique token that can’t be replicated, called a non-fungible token, or NFT. The token can represent anything from a piece of art or a deed to a house. There are dozens of other ways to apply smart contracts and blockchain technology. Is it a good investment? Is Ethereum a good investment? If you’re interested in investing in cryptocurrencies, Ethereum’s native currency, ether, is a good choice. Ethereum is the clear market leader in blockchain applications. Most new developments in decentralized finance or other uses for blockchain are built on the Ethereum network. That inherently gives ether value since it’s needed to keep the network running and verifying the blockchain as well as paying for transactions on the blockchain. The shift to a proof-of-stake system from a proof-of-work system makes it more sustainable from an energy-use perspective. That opens the door for it to make advancements in processing speed, which can make smart contracts more broadly applicable. Ethereum has strong staying power (in the crypto world), so it’s much more unlikely to provide the boom-or-bust results of other smaller currencies.\n\nRelated investing topics\n\nEthereum vs. Bitcoin Ethereum vs. Bitcoin Ether and Bitcoin are the two largest cryptocurrencies by market capitalization. The currencies have a lot in common, but Ethereum builds on the underlying blockchain technology pioneered by Bitcoin’s creator. The idea behind Bitcoin was to create a permissionless, decentralized digital currency. Its creator wanted a way to make payments that weren’t backed by a central government or agency. As a result, Bitcoin is used as a store of value and a medium of exchange. Ethereum had a much broader idea. The blockchain is used for all sorts of decentralized applications. While ether is used to pay for transactions on the blockchain, you can also have other cryptocurrencies built on top of the Ethereum blockchain. Ethereum and Bitcoin also use different protocols to secure their blockchains. Bitcoin uses a proof-of-work system. Under this system, every computer on the network is working to solve a complex math problem to write the next block to the blockchain. Once a computer solves the problem, the other members of the network verify the solution (which takes much less work), and a new block attaches to the chain. Ethereum used the same system until September 2022. It now uses a proof-of-stake system that requires network members to hold ether to validate the next block in the blockchain. Validators are financially incentivized to verify correct data because they risk losing their stake if they’re a bad actor. Transaction speeds are usually faster on the Ethereum network. Transaction costs can vary more widely on Ethereum based on how many people are actively trying to write new data to the blockchain, i.e., transaction volume. Both have their use cases where they excel, and either ether or Bitcoin could be a viable investment choice for someone interested in buying and holding crypto."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPTUhYbXI3UHFMYW8wOV9RVjZDQnZTcXRXR0xXaERnenR1UWdWRXF4cjdoZ0J4YkFuVmFHMEN2V2lidTloajVaVUtYdDhWMldtQ1NZdk5QU0pBRkM4Zk1aMnVGV2JKN3AwUlUtWjJNejcteUFlM0s0NjlST1lvVnR6N0ZablTSAYoBQVVfeXFMTmZWanM3TExhRGFXYjNnZ3Fyd2FOMERSeFlmdEhWTlpuZnRYMkZka1I3c2ZETEtjSW01MWxXa3J5VGk2V2hJNVlCLWtBOWt5WEdMMlZSU28xN0tiSVgxSXRFY2pKOE8xMGloNl9aMnBIeFRiOVdSTG80QUlaMWlmNjFTLWdjcEpaTEtB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "What Ethereum’s future holds as whales make a splash - AMBCrypto English",
        "content": "Ethereum whales held around 38% of the total supply at press time.\n\nETH’s supply has continued to decline.\n\nThroughout the year, Ethereum [ETH] whales have consistently made strategic moves, and recent reports indicated a noteworthy increase in their holdings.\n\nEthereum whales gather more supply\n\nAccording to IntoTheBlock, the percentage of Ethereum supply held by large investors, known as whales, has increased over the year. The data showed a growth from 32% in January to around 35%.\n\nFurther examination of whale holdings on Santiment also showed an increase.\n\nInitial observations of the chart showed a clear upward trend in the past few months. In August, the percentage of whale holdings stood at about 34%, but as of this writing, it was over 38%.\n\nAn important question thus arises: How has this surge in holdings affected the overall supply of Ethereum on exchanges?\n\nEthereum: Supply on Exchanges continues to decline\n\nThe Ethereum supply on exchanges has exhibited minimal fluctuation in the recent period. However, it has shown a significant decrease over the last six months.\n\nChart analysis showed a decline of nearly 1 million units between August and the present. As of this writing, the exchange supply was around 10.51 million.\n\nConnecting the dots between the trends in exchange supply and the holdings of Ethereum whales, one might infer that the accumulation by large investors has influenced the overall supply.\n\nThe reduction in supply on exchanges implied a decrease in liquidity, which could exert a positive influence on the price trend.\n\nETH uptrend comes to a halt\n\nAMBCrypto’s examination of Ethereum’s daily price trend showed a consistent accumulation by whales across various price ranges. Preceding this recent report, the chart indicated a continuous increase in the value of ETH over the past six days.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nThe uptrends resulted in around an 11% increase in value. However, at the time of this writing, there was a slight decline of almost 2%. Despite the decline, it has managed to maintain a stable price of around $2,200.\n\nIt’s noteworthy that if the percentage of supply held by these whales begins to diminish, it could signify capitulation. This is a crucial consideration, as a substantial release of volume onto exchanges might adversely impact the price trend."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5wVGJfdzRPVDFsdEpIVXRsbHM5bU5RMGlWczBOckxCOFBlUXBMem1TWjF5YlV3cmdiZmhUNVE3aEdFVkV2N1ZMT0o2TlNlUTBHQW5oZDlaUGdScUxqLVFUbHhuY2dJMkxKUnMzT0ItLUs2Z3lseHl3bVVpQXlKQdIBgwFBVV95cUxPdWV3djNoeklENkxEczBmT0tFUkZDZ19ScVZ4cXByMlB5a285enpVM3Z3clJ3Q3pmazhiSGQtWmplRUFhMU84LXFTeEdObll1SlY4NnN6Ri1xdXR6ajZXdmoyYm5VcU9tSjZ3NThpa1VXbE5uQ0J3UHE2ZzJWcnBHazh3RQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price to Surge Massively, Suggests This ETH Chart - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe ETH/BTC pair from Binance offers a glimpse into Ethereum's current market position – a position that, while seemingly bearish, may hold the seeds for a future rally against the digital gold that is about to enter a consolidation phase.\n\nAdvertisement\n\nThe chart presents a downtrend with Ethereum losing ground to Bitcoin, reflected by the downward slope of the 50-day (blue line) and 200-day (black line) moving averages. This suggests that, in the short to medium term, Ethereum has been underperforming compared to the original cryptocurrency, Bitcoin.\n\nThis underperformance can be linked to a subdued period for key Ethereum market drivers, such as decentralized finance (DeFi) and non-fungible tokens (NFTs). With these sectors facing a downturn, Ethereum's price has not had the catalysts that could propel it forward, especially in comparison to Bitcoin, which often acts as a \"safe haven\" within the crypto market during times of uncertainty.\n\nAdvertisement\n\nHowever, the development activity within Ethereum's ecosystem tells a different story. Despite the lack of immediate market drivers, the consistent work being done on the platform could be laying the groundwork for a strong rebound.\n\nFor traders, the ETH/BTC chart is a vital tool for tracking market sentiment and volatility. A declining ETH/BTC ratio could indicate a period of risk-off sentiment where investors flock to Bitcoin's relative safety. Conversely, a rising ratio might signal a risk-on environment where traders are more willing to bet on Ethereum's growth prospects, which might also hint at the potential surge of altcoins in general.\n\nGiven the current chart trends, investors and traders may look for signs of stabilization or reversal in the ETH/BTC ratio as indicators of Ethereum's resurgence. Such a turnaround could be precipitated by a revival in the DeFi and NFT markets or by new developments and upgrades within the network."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQSTdCdllnWUE0d290OVM5R0RDUmhHLWhvMVNqSWtRM3NYSHVEVjdQbU5sbEY4Nm51dUNrQWxBRnNPUkxqNWZsSFMtaVlGeTB2anp1UTU3NUJRRGdxbXJMU01tZEF5Vk1lMFBCcmV6YXZqbDZIR3FuM0ZpZFl2dGhWbktWQUXSAYwBQVVfeXFMTm9MM0plUjVTQjNLbWp4b0JtQWx0bmtQMWxqZTRjMC1lZDRTa2NKZU4tZ3ViSFFSWk9uVDdYa0dBV1E5VUloMk5MYjVKcjRzRUxUcnB0SWQ1VzVmS3B0QldEUXctRTYwTkprV0RCbnIteV9ZaUtXRDlGY2l4TTlUWnM1MEdiM1FyODZoM28?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Layer-2 Starknet Reveals STRK Token Airdrop - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe airdrops keep coming.\n\nThe team behind Starknet, a layer-2 Ethereum scaling network, plans to allocate over 1.8 billion STRK tokens to community members and stakeholders, according to an announcement made Friday by the Starknet Foundation.\n\nThe Starknet Foundation did not give a timeline for the airdrops, stating only that the first phase of the giveaway will begin “soon.”\n\nSome 900 million STRK tokens have been allocated to “reward past and future contributions by users and community members.” What exact criteria will dictate which Starknet users will receive those tokens, and how many, has not yet been announced.\n\nAD\n\nAD\n\nNow that the news is out, we might as well tell you more! Starknet is about each of you. Every user, builder and member of our community – existing and future – is a critical piece to building our network into the future of decentralisation for generations to come. The success… — Starknet Foundation (@StarknetFndn) December 8, 2023\n\nA further 900 million STRK will go towards user rebates, the Starknet Foundation said. Planning for that initiative is still underway, but it appears it will recoup the cost of some amount of network transaction fees for Starknet users.\n\nBeyond those 1.8 billion tokens, the blockchain’s overseers also intend to distribute an additional 50 million STRK tokens to incentivize decentralized finance (DeFi) activity on Starknet. These tokens will be directly, indirectly, and retroactively distributed to Starknet DeFi users, according to the Starknet Foundation.\n\nStarknet community members were quick to celebrate the announcement, hailing it as a major boon for the blockchain.\n\nAD\n\nAD\n\n$Stark is about the community, 1.8B tokens for the community, 50M token for Defi chads.. multipliers incoming..! — BMS (@bloomstarbms) December 8, 2023\n\nAnd they have good reason to be in high spirits: similar airdrops made by other blockchain projects have flooded crypto users with hundreds of millions of dollars worth of free tokens in recent weeks.\n\nOn Thursday, a similar airdrop by Solana-based DeFi platform Jito put $225 million worth of freshly minted JTO tokens in the hands of users and community members. Late last month, an airdrop for DeFi oracles network Pyth gave away $77 million worth of PYTH tokens.\n\nAirdrops have become an increasingly popular way for crypto projects—and recently, DeFi projects in particular—to attract a larger user base and encourage loyalty among existing community members.\n\nStarknet, which uses zero-knowledge rollups to make on-chain Ethereum transactions faster and cheaper, has already seen tremendous growth this year. This spring, the network’s total value locked (TVL) increased ten-fold, from $1.45 million to over $10 million. Since then Starknet’s TVL has tripled again, to $33.84 million at writing, according to DeFi Llama.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE1KMjZUVlRNZk5RZVJfWVJvajE4bGNaMTBtUUFvYlZBa2RLbkx3TUh6em9vOVQ1SjhQc2NTM0FRcFF3QlBmT255ZjByRzF0NnRqUHo4dFZJbVQwWGxSd1ZaR3pzNDJIaUJLTE1IMzUycWVIZ0QzaUNxaHpQUXNoQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Crypto & Blockchain Quests - Global X",
        "content": "This piece is part of a series that dives deeper into the most prevalent themes of this year’s iteration of our flagship research piece, Charting Disruption. The Crypto & Blockchain Quests section focuses on alternative currencies and stores of value, Ethereum’s infrastructure, and applications of blockchain technology.\n\nInnovations in blockchain technology have given rise to a burgeoning ecosystem of applications and use cases that have the potential to improve the financial independence of global populations, drive exponential efficiency gains across business and industry, and bring the form factor of value into the digital age. Central to these innovations are the software developers who build the infrastructure, creator tools, and user-facing applications that endow blockchain networks with utility.\n\nThrough cycles past, strong market activity has incentivized software developers to enter the digital asset industry, a significant percentage of whom become full-time contributors to blockchain development. Encouragingly, these developers have continually remained committed to the industry even when the cyclical hype triggered by rising asset prices retreats. It is during these periods of more sober public sentiment surrounding blockchain technology that today’s most valuable products have been built. The most recent market cycle seems to be no different, with infrastructure development over the past year providing a robust foundation that may give rise to new use cases, driving the next wave of blockchain adoption.\n\nKey Takeaways\n\nThe role of cryptoassets as credible, location-agnostic mediums of exchange and stores of value can provide a critical lifeline for populations struggling with social, economic, and political instability.\n\nBenefitting from infrastructure upgrades of the Layer 1 (L1) blockchain with “The Merge” and a growing network of Layer 2 (L2) scaling solutions, Ethereum is laying the foundation needed if it is to achieve its goal of becoming a globally adopted value settlement layer.\n\nThe diversity of applications on blockchain networks is continually growing and ranges today from decentralized finance (DeFi), to asset tokenization, to a host of non-financial use cases such as social media and resource sharing.\n\nUnlocking Digital Assets: Alternative Currencies & Stores of Value\n\nThe role of cryptoassets as location-agnostic stores of value and mediums of exchange is perhaps the most prominent application of digital assets today. These use cases can provide a critical lifeline to those without access to a stable national currency or a viable means of storing and growing wealth.\n\nGrowing from a $1B industry in 2017 to a $120B industry today, stablecoins have emerged as an efficient vehicle for short-term preservation of purchasing power for many global populations, especially those struggling with hyperinflationary conditions and systematic currency debasement.1 Though still a nascent industry, stablecoins are regularly involved in trillions of dollars of global value transfer annually, rivaling payments giants such as Visa.\n\nBitcoin, on the other hand, has solidified its role as a powerful hedge against currency debasement and global uncertainty. Supported by assurances that the total supply of bitcoin will never exceed 21 million tokens and that the network will never be controlled by a central authority, bitcoin’s value proposition as a credibly scarce and neutral asset has continued to gain traction globally.\n\nEthereum’s Blueprint: Exploring Infrastructure Upgrades\n\nEthereum’s transition from proof-of-work to proof-of-stake-—“The Merge”— represented a broad overhaul of Ethereum’s infrastructure. The outcome of The Merge was a 99.9% reduction of Ethereum’s energy consumption and a simultaneous slashing of network expenses to 0. Today, Ethereum’s minimal environmental footprint and sustainably profitable operations put the network in a position to achieve its goal of becoming a global settlement layer.\n\nUpgrades to the canonical Ethereum blockchain (L1) were also supported by innovations in “Layer 2” (L2) networks aimed at scaling Ethereum and reducing transaction costs to support the viability of a wider range of consumer applications. Since 2021, over 30 L2 scaling networks have been launched on Ethereum, including optimistic and zero-knowledge (zk) rollups. To date, L2s have increased Ethereum’s transactional throughput by 5x and reduced average transaction costs by orders of magnitude.2 These myriad benefits have catalyzed a migration of blockchain activity away from L1 and on to L2s which now host the majority of Ethereum’s transaction execution.\n\nBlockchain Trends: Applications of the Technology\n\nDriven by drastic improvements in blockchain infrastructure and user experience, the diversity of blockchain applications is quickly expanding. Decentralized finance (DeFi) protocols that enable activities such as asset exchange, yield generation, and lending have garnered the greatest mind share and adoption to date, with billions of dollars of capital regularly processed by the most popular applications. Further, asset tokenization has made significant strides in progressing from a promising concept to one that is being applied to investment fund management, real estate, stablecoins, and more.\n\nA growing cohort of non-financial applications are being developed as well. These include novel experiments to extend the efficiencies of the sharing economy to areas such as data storage and internet hot spots, crowdsourcing initiatives to incentivize activities such as real-time 3D mapping, and a new social media paradigm whereby content creators are empowered to own their content as well as their entire social graph.\n\nConclusion\n\nFrontier technological movements challenge societal notions of what is and is not possible. Eventually, the most successful of these movements distinguish themselves by progressing beyond a conceptual phase and into phases of active experimentation and implementation. With significant advancements in blockchain scalability and security over the past few years, blockchains have emerged as increasingly viable solutions for a wide range of applications, with multinational businesses, governments, and a growing global user base taking note and actively experimenting with the technology. As innovation continues, the expectation is that blockchain capabilities will become increasingly relevant to a growing swath of use cases and will eventually become fully integrated into everyday activities."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNRjcxc0NTT2FTQjhKUzFFdkRPbzdzU3ZLN1hMWkJVekpPZHp2dFZwbW16YTFqYkNEWW9NMU5rQlZHa3ladzFFaVkxbWw3Mlk2dmxnOFNjZEJZaDJ1Y0JBbUp5X19KRW1hZ0dGOExqMHhjZHFDX3FCcHJaeTd1d2ZSTXp6blRxVGpnVVd3SklyUlBKYWNWRmgyTFIwb2Rpa0Q0ckQxcFBBRUMwWlBMV1ctczFjVVBDRFZoakZ2LUZIZEh2QXVLZTZRbkJ2OElpZ3ZYRlHSAdcBQVVfeXFMT1ZHeFhaay1PeG9aQ1R4aHlHV0tUSnVhSHp0dklUV0EwYXV0XzlCd19FbDNCSmxVR0I0aE9ILVZyYm8ybWM5cHJ1Um1DckNBU01rTVJONlFUWFdoQ0Rxd0lreEdWOVZlVDRKN1NuNk5Ma0VfMy1MdGpfUEZaOTJ0cHlzYTVCemF1RE94RlJDTVNQZjVzYl9WZnh1QzdJRUJWR3dPeDFFRVB2VmdxNjFTU2J3bnVIbTE4d1FBeXdEOGVadXdGY1VBU3FjNHhxYnZ1UXVsQ190WTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Galaxy-Backed Gyroscope's 'All-Weather' Decentralized Stablecoin Goes Live on Ethereum Mainnet - CoinDesk",
        "content": "Stablecoins, in spite of their name, have been known to veer from their price anchors. In March, Circle's USDC , the second-largest stablecoin, temporarily depegged due to the collapse of banking partner Silicon Valley Bank (SVB). This in turn led Maker's DAI to drop, as a large part of that stablecoin's reserve assets were in USDC. Last year, the dramatic collapse of Terra's algorithmic stablecoin UST marked the beginning of the crypto winter. Overall, large-cap fiat-backed stablecoins de-pegged from their price anchor more than 600 times this year, according to a Moody's Analytics report from early November."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNZHRuOFpMclB6dlN5MzZHZ3U0QklBdGN0bmV3dzBvYl83VXFiaEhGeW9qWmFubHg0NXZic2Y5Qm9QMGNkbk9XcjRIczZuVkdPYjV1OVgweXhFRHVCSkptZnFPUHlfeGwwRDhaN0ZKdkxUOVkxUVBUWGItN3N4MDVVdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: After A 10% Surge, Experts Predict Bull Run For Eth - TronWeekly",
        "content": "In a notable development, the price of Ethereum (ETH) has experienced a substantial surge, surpassing the $2,250 resistance level. Experts are now anticipating a bullish trend for ETH, projecting a potential ascent towards the $2,500 mark.\n\nEthereum’s Positive Momentum Persists\n\nMaintaining its positive trajectory akin to Bitcoin, Ethereum has sustained its upward movement above the $2,120 threshold. The cryptocurrency extended its rally, breaching key resistance levels at $2,200 and $2,250, prompting a surge in activity from bullish investors and propelling the price beyond $2,300.\n\nAlthough a new multi-month high was established at approximately $2,316, the current market scenario sees a correction in gains. The price has dipped below the $2,300 level and is currently undergoing a test of the 23.6% Fibonacci retracement level, measured from the $2,188 swing low to the $2,316 high.\n\nNotably, Ethereum is presently trading above $2,250 and the 100-hourly Simple Moving Average. Additionally, an observable bullish trend line is taking shape, offering support around the $2,250 mark on the hourly chart of ETH/USD.\n\nEthereum Price Prediction: After A 10% Surge, Experts Predict Bull Run For Eth 3\n\nFacing resistance in the vicinity of the $2,320 zone, Ethereum’s immediate hurdle is the $2,350 level. A decisive breakthrough above this resistance could propel the price towards the $2,420 level, with subsequent resistances standing at $2,450. Further gains have the potential to trigger a surge towards the $2,500 level.\n\nHowever, should Ethereum encounter difficulty in surpassing the $2,320 resistance, a downside correction may ensue. Initial support on the downside is identified near the $2,265 level, followed by key support at $2,250 and the aforementioned bullish trend line. The latter coincides with the 50% Fibonacci retracement level of the recent upward move.\n\nIn the event of a more pronounced decline, Ethereum’s primary support lies around $2,200, corresponding to the 100-hourly Simple Moving Average. A breach below $2,200 raises the possibility of an extended decline, with the key support level at $2,120. Falling below this level could expose Ethereum to a potential move towards the $2,080 range in the near term."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQd0ZuY3BsR0pfSTQ1TTZsZDhlNm52SWFnd2ppUFRQdHF0OF8zbVFMNmpfbUFvaGJWaERPS0VzWFJYMFV3cXdNODRSWGpPX2RDckFCWFRVVEJ3bDlJZkgxcHZqRFZncDN5R1dlSG1VYmlnc3lvUnZWLTFxMEIzSGx2Yk1fRWlZOWZBZW5UbkxBVFV0SlZzM0F5RW9JTnphMy1HLUprSDdoVm5NTVJyVUMwcVRZaURXaFZJa3BnWlVWbGdJRHdpM0RGV0lkaERYTnNvZFZhctIB2gFBVV95cUxNOERNUzNMekNwdnlRdDEyVnNzQU5ZZjdmWWlrN2lhT09HR1dPVE1IUFV0ZG8xb1NTbXFuMW1FSVRUS25JY1g0NFRWV21zZHAyNkpTM2t1YlRXM1k4UWxJUGk3QUxHZERvZGlkX0hXUUhPcC1MdnBaUE1saE00OWtuSUJieUE0NHBFWTViQzZwUlhOYWRwekNzYmRGYTdoZWpyX1ZXc2hPYUhyVUhSVnY4SXFoLWlhNHh2el9tQlFPWFpCODlkVkF1QWExdnpqYVVvNXJoVzFJVnpaUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Top Analyst Says Ethereum on Cusp of ‘Inevitable Rage Pump,’ Updates Outlook on Bitcoin and One New Altcoin - The Daily Hodl",
        "content": "A widely followed analyst and trader believes that Ethereum (ETH) is gearing up for a big burst to the upside.\n\nThe analyst pseudonymously known as Bluntz tells his 230,700 followers on the X social media platform that Ethereum has officially entered bull territory after leaving its multi-month accumulation range.\n\nAccording to the analyst, Ethereum will leave behind traders who are fixated on ETH’s performance against Bitcoin (ETH/BTC).\n\n“ETH has well and truly broken out of a year and a half range now.\n\nJust waiting for the inevitable rage pump that catches everyone out while they’re too busy shi**ing on ETH/BTC.”\n\nWhen paired against the US dollar, Ethereum is trading at $2,373 at time of writing, up by around 93% so far this year. When paired against Bitcoin, Ethereum is trading at 0.05462 BTC at time of writing, down by around 23% year to date.\n\nLooking at Bitcoin, Bluntz says that the flagship crypto asset will likely extend the rally that kicked off at around the $36,000 level. According to the analyst, Bitcoin looks poised for another move up while other traders are waiting for a deep corrective move.\n\n“All I see is people taking profit and warning of impending 10-15% pullbacks.\n\nYou all are not ready for how far this leg from $36,000 extends.”\n\nBluntz is a popular practitioner of the Elliott Wave theory, a technical analysis method that attempts to predict future price action by following crowd psychology that tends to manifest in waves. According to the theory, a bullish asset witnesses a five-wave rally with each wave having its own five sub-waves.\n\nLooking at the trader’s chart, he seems to predict that Bitcoin will rise to as high as $53,000 before ending the five-wave surge.\n\nBitcoin is trading at $43,435 at time of writing.\n\nNext up is the layer-1 smart contract blockchain Sui (SUI). According to Bluntz, Sui is gearing up to break out of its accumulation phase.\n\n“SUI is another new coin that looks ready for the markup phase.\n\nHad an 80% decline after initial listing pump and now some very nice accumulation.”\n\nSui is trading at $0.681 at time of writing, slightly above Bluntz’s accumulation range.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNSFhrWEZLeHpQd19ZMTJsempDajByOUgtVGxzU0RJeUNnZDdsMG9aUmdCc2NQV0pHcEowbkpiNVhhc25LN0VxNXpvdmw4SllnRGp1V2N6My15dXhwUjlNUHJ5anVRcl94bTFGY1N0b0RnQTVnN0RFN2pib2dieVhUdXp1dTl0ajVSRU8zWNIBkgFBVV95cUxQY3RSeWwzNzRpUjNTenhNakFPNmYzZTRvMU05cG1SM0lDeWVFMjFxbXBycGc0VE5LZ2UyZHJNTzhKNWFxQXlTaTVtNGNxTzB5NzQ0STRQYjNpaUhCcWc0UUQwWFV4SXFqc2hWcERCSWFQbE1xNmdIVlF0NF96RXVHU1BXY1Y2T0lNX2IzdFJwTGZTZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Experiences a Massive Surge in Gas Fees: Here’s Why - CryptoPotato",
        "content": "Ethereum median gas price has surged to 55.3 Gwei this month, almost doubling in a month and reaching its highest point since mid-May this year.\n\nEthereum is trading at 2,230, up 10% over the last week and 81.3% over the last year, remaining the second most popular crypto after Bitcoin.\n\nEthereum Gas Fees Increase\n\nAs revealed by an analysis on Dune, Ethereum gas fees have surged over the last month. In October 2023, Ethereum experienced a notable reduction in gas fees, reaching a new low. The decline was attributed to decreased activity in decentralized finance (DeFi), non-fungible tokens (NFTs), and various Telegram bots.\n\nMajor gas spenders, including industry giants like Binance and Coinbase and Layer-2 networks such as Arbitrum, Optimism, and Base, reduced their spending by 30% in mid-October.\n\nHowever, on December 1, the introduction of the Buterin Cards NFT collection triggered a 13% increase in gas fees on the Ethereum network. Transactions associated with this collection accumulated fees totaling 318.31 ETH in the past 24 hours, equivalent to $665,670.\n\nNotably, within three hours, transactions linked to the Buterin Cards NFT project contributed to over 13% of the total Ethereum network gas fees, surpassing fees from the Uniswap universal router address and Tether’s public address, according to data from Etherscan.\n\nEthereum Gas Fees Have Been Fluctuating\n\nA substantial decrease in Ethereum gas fees occurred following the network’s transition to a proof-of-stake (PoS) consensus mechanism implemented through Ethereum 2.0.\n\nIt shifted away from the energy-intensive proof-of-work (PoW) model, introducing staking and resulting in a noteworthy 99.9% reduction in energy consumption.\n\nEthereum’s gas fees have consistently mirrored the demand on the network throughout its history. Notably, during the Initial Coin Offering (ICO) boom in 2017 and the decentralized finance (DeFi) explosion in 2020, Ethereum experienced unprecedented congestion. The heightened demand during these periods resulted in a significant surge in gas fees, forcing users to pay sometimes exorbitant amounts to guarantee fast processing of their transactions."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBMTGRqVXlQNEdBWDJQSUFwSzhCRmRKRFNuMkJUbnFNZHR4ZlBmclBpWmgtZmQ3WmhGTTVGMXk4bkUtSlpocGVscEhxeXUyUjI1YjZjM0N5ZDRBUTNGWlo1bTVsc0ZKeWJuZW5v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Starknet Foundation teases STRK token airdrop - Blockworks",
        "content": "Starknet, a zk-proof-based Ethereum layer-2, is taking a significant step towards decentralizing its network and fostering community engagement.\n\nThe Starknet Foundation outlined its plan to distribute over 1.8 billion STRK tokens through various initiatives aimed at driving adoption and growth on its blockchain platform.\n\nThe token, which is not currently transferable or tradable, was first deployed on Ethereum in November 2022, and ever since speculation has been rife that the network would eventually conduct an aggressive program of community incentives and a retroactive airdrop targeting active Starknet users.\n\nAn X thread on Friday from the Starknet Foundation brought the contours of this eventual distribution into clearer relief.\n\nAt the heart of the initiative is a “provisions committee,” entrusted with the responsibility of allocating 900 million STRK tokens. This committee’s goal is to ensure a “fair, decentralized and transparent distribution of STRK over multiple programs and phases,” according to the Foundation.\n\nIts objective is to distribute ownership of the network’s native token and to reward past and future contributions.\n\nHow exactly this will be done remains to be seen, and a Starkware spokesperson declined to comment further.\n\nThe Starknet Foundation, incorporated in the Cayman Islands, is independent of Starkware Industries, which is headquartered in Netanya, Israel, but its seven person board includes both Starkware co-founders Eli Ben-Sasson and Uri Kolodny.\n\nThe company was valued at $8 billion following its 2022 Series D fundraise.\n\nIn addition to rewarding contributions, the Starknet Foundation aims to reward users for their transactions on the Starknet network, such as offering rebates for transaction fees.\n\nStarknet fees are denominated in ether, and the network posts zero-knowledge proofs of execution of transaction batches to Ethereum mainnet — a security and scaling mechanism.\n\nRead more: So your layer-2 is ‘secured by Ethereum’ — what does that mean?\n\nThe Starknet Foundation is also exploring ways to incentivize activity in the decentralized finance (DeFi) sector, working with an initial allocation of 50 million STRK tokens. A six-member “DeFi Committee,” currently concluding its research phase, will soon start implementing strategies to enhance liquidity, trading volume and overall growth of DeFi protocols on Starknet.\n\nRead more: Starkware’s new appchain attracts DeFi derivatives dex with CeFi liquidity\n\nStarknet teased that further details on its incentive mechanism aimed at developers and decentralized applications (dapps) on the Starknet network would be forthcoming next week.\n\nSince the token currently has no secondary market, it’s challenging to ascribe a value to the planned distribution, but layer-2 peers Polygon, Optimism and Arbitrum currently boast fully-diluted markets caps of between $8 billion and $11 billion.\n\nThe total supply of STRK tokens is 10 billion, of which 5 billion were allocated to the Starknet Foundation.\n\nThe airdrop is one of many anticipated in 2024 related to Ethereum layer-2 networks, such as LayerZero and zkSync.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNT25IUm5YU1JzcnI3WmtKMkdCY2lfejRVNTRJbGl2VVcwMjJFMTByaVpFbXlJQzBadG0yUDlsNWowOWg3TTBldVVRQklnTkd2Z19LYURoWEgyUjZFUUhjUW5MVmdIV0xEVjdneExxZ0drUkJ4UWhGdUhJSXZ4Zk4tczlxOEZuZU3SAY8BQVVfeXFMUG5oQjZjYzdWV19EeDg3X24tM25wSFpJWVRQN2kwRC1qTklqdjZfaGhuTTlrWkcyVElKX3RNVURabVNtdnZnR3NaZXFuSlpGaXZDdGdDZEJxQ3gydWtGUXJ3SlVZUm4xT0l5RHd0NXQtUmNVY05hbkc2Yl9ZV0NvUExydWVxQW5UOHZBTG9ORlU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "SOL Surges 13% as Solana NFTs Overtake Ethereum, BONK Up 26% - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSolana’s upward momentum continued unabated into Friday, with SOL posting double-digit gains and Solana’s leading meme coin BONK extending its skyrocketing surge to another all-time high. Amid the price action, Solana NFTs are also seeing substantially more trading volume—even higher than on Ethereum.\n\nSOL popped as high as $73.85 early Friday, marking a new 19-month peak for Solana’s native cryptocurrency. While still far from its all-time high of nearly $260 in November 2021, SOL has seen a dramatic rebound from falling to almost $8 in late 2022. As of this writing, Solana sits at just above $73, marking a 13% jump in the last 24 hours per CoinGecko.\n\nMeanwhile, BONK—the top meme coin on Solana—has continued its rocket ship ride up the charts in recent weeks, setting a new all-time high price of $0.00001314 early Friday.\n\nEven down to $0.00001230 as of this writing, BONK has posted a 24% gain in the past 24 hours, and has tripled in price over the past seven days. During the last month, BONK is up a whopping 982%, flinging the token into the top 100 cryptocurrencies by market cap for the first time. BONK now has a market cap of $747 million.\n\nAD\n\nAD\n\nMeanwhile, the recipients of Thursday’s Jito airdrop are sitting even prettier. The Solana DeFi platform’s new JTO token was handed out to thousands of early users, with the airdrop valued at $225 million in total as of late Thursday. But now the price has jumped 72% over the past day to $3.35 per token.\n\nBuzz around Solana extends to its NFT collections, too.\n\nProjects like Mad Lads and Tensorians have seen dramatic price increases in recent weeks, multiplying several times in price. And now, collective Solana NFT trading volume has topped that of Ethereum, typically the leading chain for volume and having the most valuable projects.\n\nSolana NFTs racked up $14.8 million worth of trades over the past 24 hours, per data from CryptoSlam, compared to about $13.9 million worth on Ethereum. It’s due to a sizable boost in Solana trades, which have seen their volume grow about 92% in the past day.\n\nAD\n\nAD\n\nTensorians, which is tied to the Tensor NFT marketplace, is the top traded project during that span with over $4 million worth of sales.\n\nTensor, which rose to prominence earlier this year, is currently dominating on Solana with nearly 76% market share over the past 24 hours per data from Tiexo. Magic Eden, the multi-chain marketplace that previously owned the Solana space, has about 16% share during that span.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOXzlFYk80Z2ZTR1BlbkhUdTl0aHMzN3lWbnJHUlpJYUY4bUtTdlFtSzZ6YTBsWjRSX3FGYXIzREJSbWQtVVZ5WDRvOVhlOUxBMnQ3M2FZUE1CUC16c3gtbVh4dUk3RkR5U0U5OG5PVXYzOGZPZVBiRWc0bnhhMkRabW12RkJaNGtVM3J3X3VjSXVGRjZfVXExRTZBc2RhcVF0QjRpMVVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin transaction fees surge, rivaling Ethereum daily gas fee totals - CryptoSlate",
        "content": "Quick Take\n\nBitcoin transaction fees have witnessed a significant uptick recently, echoing patterns seen last month during the Inscription frenzy.\n\nThis time, however, the catalyst appears to be an increase in transactions awaiting confirmation in the Bitcoin network’s mempool. The volume of coins in transactions held in the mempool reached 88,000 BTC.\n\nFurthermore, a detailed examination of transactions waiting in the mempool reveals that most fall under the 50+ sat/vByte fee cohort. High-priority transactions reach up to 337 sat/vByte, which converts to approximately $20.\n\nThis is paralleled by a surge in Bitcoin fees to roughly $12.5 million. This places Bitcoin fees hot on the heels of Ethereum, which currently tops the chart at $15 million.\n\nName 1 Day Fees 7 Day Avg. Fees Ethereum $15,005,897.28 $11,950,187.83 Bitcoin $12,573,926.34 $6,358,238.65\n\nSource: Cryptofees.info\n\nThis data reflects the intricate dynamics linking transaction volumes, waiting times, and fee structures in the Bitcoin network and their effect on overall transaction costs."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOYTJhcnA0czBrZ2ppdDlhdjVOR2pvLVlLZTVTNnN6UXhaMWRhRkNFX2s4bzNpeU95Z05YY21QQjBpcktCNHRvZHFtczdUaTNacGk2NGhSUGhuSV9uSFJXRDRxaEw3S0RReVppNkhrdk5CV3YyNHUzQklnS3ZDQ0dWZ09YYmQtelFISC1PN3FEeEJfblZyYzE3ekZlaXBqeFZPcDJqNnV6WEdueUlCaTNlUThuS0ljVHZQ0gG-AUFVX3lxTE1vb1pMMnBzWFVFYzE0MkJmZ3pidDlmMDV4VHNwZ1NsTFF2bTY1SUdzZHZZUEptYkwwMkxsVG5Zcm9aNVhGbS1Yd3E1OTZ0WnZ4dGN5T3BmSjlNYjNOZ2RtS3NVRGREaTBOWUVEcHc4anI5a25iZ3k3U29jblJmSk9Fc0laSE9VeVNSLVN2N2p4NVJqYUl0RWdPRE4xZ0JfME5lbm1NUkgxWVpTZnhkSk01c2gtNFZ4S3UxdWxsTkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Analyst Says Ethereum Rival Solana Primed To Go ‘Much Much Higher’ – But There’s a Catch - The Daily Hodl",
        "content": "A closely followed crypto analyst says that Ethereum (ETH) rival Solana (SOL) is gearing up to continue its rally to the upside.\n\nPseudonymous crypto strategist Altcoin Sherpa tells his 200,700 followers on the social media platform X that he believes the smart contract platform will go much higher in the future, however, he warns traders of an upcoming dip after FTX’s supply of SOL floods the market.\n\n“SOL: I still think that we go a bit lower. FTX supply coming here eventually and I think this move up is to bait some buyers. Would just be patient on Solana. Note: I think that this one is going to go much much higher in the future.”\n\nAccording to Altcoin Sherpa, investors should remain patient with Solana as the incoming cache of SOL tokens from bankrupt crypto exchange FTX will add to its supply. However, the trader notes that during the last month, SOL has been consolidating.\n\n“Although I think that you should still stay a bit patient given FTX supply is coming onto the market sometime (who knows when), Solana has also consolidated for a month in an overall macro healthy BTC (Bitcoin) upswing. In my opinion, this means you should at least be exposed now if you want in on this one.\n\nRecommend you do a swing trade on this one and have entries from here all the way down to sub-$50. It also works great as an investment too, where you just hold this for six months+ and let it ride. High percentage chance it’s decently higher later.”\n\nSolana is trading for $66.36 at time of writing, a 4.7% increase during the last day and an increase of over 550% from its price of $9.97 at the start of 2023.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Sergey Nivens/WhiteBarbie"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPWG52TmhuRWFRYkRKY0h0ZzhOQXEtUE9kVUgwSm9JVzh5MTdfVnpuVkxsLUJFQlIxOTNxbjJuYmU5eTE0c2p2TWlYNXNQN1JxNWxWLURUMkd5UUNmQmdFc1llUVB5ZlpqVnVTR0xqUDhPTDBKeFk0Y3U1dWE0T1kweWtRRHItak5pdnNCSk0tMjh3dDFKTWJzbjAwQUEzamxpQkVoUFFpUi1vOFBxRy1ra2JtTUcxMzB3S3R6dXlpdUxZYzdRMHpqR2NBTGZmYUHSAdQBQVVfeXFMTXREd2pVZThvZ1BzLWxJVDI1ZzBGMl9ITlFvMVhWMExkblN0WFpUQTBiUnh6V09zcnMycWhuM1JPdGlCYmMzeTRWUHVSSkNlSHc3dkJ2Z3h0cDFja01iVEF5VWo0OFFhRXBnMFV2VEFVM1J1RlhVOGFYQjRUTm1JTTJmRGF0UklkNWJidTdsbTdLX05tNkV6clc0MFU2UjdmdVo0TkRWal9fYl9jZE9hZ2FPcGhyb01aeDMwenZjZlFPejRUbXM2Tl9NM2lWTldvamhpNXY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Whales Move Over $880,000,000 in Bitcoin, Ethereum, Solana, XRP and Dogecoin – Here’s Where the Crypto’s Going - The Daily Hodl",
        "content": "Deep-pocketed crypto investors are suddenly moving hundreds of millions of dollars worth of Bitcoin (BTC), Ethereum (ETH), and other altcoins.\n\nAccording to new data from whale-surveying platform Whale Alert, high-net-worth traders have shifted about $644 million worth of the top digital asset by market cap to and from exchange platforms and crypto wallets.\n\nThe Bitcoin transactions on Whale Alert’s radar include:\n\nBitcoin is trading for $43,865 at time of writing, a fractional increase on the day.\n\nThe other transactions noticed by Whale Alert include top smart contract platform ETH, its biggest rival Solana (SOL), the popular meme asset Dogecoin (DOGE), and XRP, the virtual currency associated with payments platform Ripple Labs.\n\nThe altcoin transactions on Whale Alert’s radar include:\n\nEthereum is trading for $2,354 at time of writing while DOGE, SOL, and XRP are moving for $0.098, $72.87, and $0.664, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNbFZNTFA4Q0h3eTl4RHAtNjl6bkJnSld1QW42M1p2ak92dkpmdm40ZTRGVDJSRENJaFkzQUx4T2dKWGNNZm9OVXVaeklLbFc5cmxVUEktdFJQSU1MeG54YWZQQjkxWU5fYThBTEczU0xqaWdPVE5iZVd4a3NBYndXNmdwOHdSVzBDb3R5T1pQLVk4SU9OY0VNaVVfNEY2QkpXcFdBaUs5OVRmeDI4bF9YVVEtMGQ3QWhlLUZTekZLVGVPR1QxT2s3bmF30gHPAUFVX3lxTE9mQ0otVGREcEVxaUVtdDhpYnRheHJzU1ZFMzZqUmtldzFkUUFVcWFRZVFKTlFqYW9sQmYwSGtsVWNkQ3c4RTllOUdYanlkbTJ2R2g4eE1udjlsLTkwMUNqYnBVdk5ybWJMS3llTzlqOU0tR185QUJ3VEVNdkZfODJnX3dVcWdkOE11YWNmRVpDQjhZbkFZc1loLTlka01MYUlfVGVHRjR5cnJkUTZmU3Z2bUVoSW9YWHBoWUVSNzY5WnZFeWNpeUc0cUYzbUs3VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Altcoins Could Surge in Price After Bitcoin and Ethereum Rallies This Week: Glassnode Co-Founders - The Daily Hodl",
        "content": "The co-founders of the crypto analytics firm Glassnode believe that altcoins are about to go on a rally as Bitcoin (BTC) and Ethereum (ETH) soar.\n\nGlassnode co-founders Jan Happel and Yann Allemann, who share the Negentropic handle on the social media platform X, say that the total altcoin market cap is already rising, indicating bullishness for alts.\n\n“How much longer will altcoins trail behind before making their move? The Bitcoin narrative continues to steer the ship, but a closer look reveals the total altcoin market cap playing catch-up. With Ethereum and BTC leading the way, we are potentially on the brink of an altcoin surge.”\n\nThe founders also predict increased volatility for Bitcoin’s price but a rally continuation. They say that the crypto king could dip to the $40,000 level while remaining in an overall uptrend.\n\n“BTC’s bullish momentum: navigating the uncharted journey to $46,000.\n\nDespite the four-hour timeframe indicating BTC is overbought BTC’s upward trend may persist, intensifying investor FOMO (fear of missing out) across the board.\n\nTechnically, BTC navigates uncharted territory towards $46,000. Expect volatile moves between $40,000-$46,000. The 20-day EMA (exponential moving average) provides a safety net for potential pullbacks, making shorting risky. Current patterns hint at a climb towards $45,000.\n\nConclusion: stay alert, but optimistic. Yet the BTC’s momentum suggests more upside.”\n\nBitcoin is trading for $43,424 at time of writing, down slightly in the last 24 hours.\n\nThe two also use the Elliott Wave theory to suggest that the total market cap for cryptocurrencies could soar to an all-time high (ATH) of $4.4 trillion during the current bull cycle, surpassing the previous ATH of about $3 trillion.\n\nThe Elliott Wave theory attempts to forecast price movements based on crowd psychology which tends to manifest in waves. Traditionally, the Elliott Wave theory suggests that price impulses happen in five waves after three-wave “ABC” corrections.\n\n“Third time a charm? When crypto starts its move, it goes vertical by the end of the move! The journey has just begun. And RSI (relative strength index) is in the ‘extremely bullish’ zone. Are you strapped up for this move? Extreme euphoria may likely be seen by the end of the rally.”\n\nAt time of writing, the total crypto market cap stands at $1.69 trillion.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTFBLTEZwTTRVeG5kaTRMbmY0Ri1wc2dVZTY5enJiQ2ZqV0ljR2lSYmpjNjJydHVZcTRsOTh5TUdhejJZaDdSdEJHZ2I5aVJTOUtkempyUkxRM2ZtRWp4ckNLcmZia9IBaEFVX3lxTE1xQXpSZmtzenpMUzBKbWtaY2cxb0VPSEdTdHJLT1J4b2RkWHhCR3pPYmw1WUU3X2R6aHRwNHZqMHlvdjQwcEtZbkZMMjNxUnFlajFDTmtZTVpDR2s5SzFsbmVuMU42TjFp?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Is the altcoin season finally here? - AMBCrypto English",
        "content": "The Altcoin volume is up to 67%.\n\nBitcoin and Ethereum still command over 70% of the general market.\n\nLately, there has been a rise in the trading volume of altcoin. How does this increase in volume compare to the trading volumes of Bitcoin [BTC] and Ethereum [ETH]? Additionally, what is the current market share of BTC and ETH in comparison to these altcoins?\n\nAltcoin volume soars to 67%\n\nRecent data from Kaiko indicates a noticeable uptrend in the market share of the altcoin trading volume since October. This implies a significant growth in the trade of these assets over the past few months.\n\nAs of this writing, the volume reached around 67%, as per the data. In contrast, during the same period, Bitcoin and Ethereum experienced increases of 28% and 11%, respectively.\n\nIs #altcoin season approaching? Altcoin market share of volume has soared since October, hitting 67% last week. pic.twitter.com/cWEmpZ4key — Kaiko (@KaikoData) December 6, 2023\n\nAnalyzing the 24-hour trading volume\n\nAs per CoinMarketCap data, the total trading volume in the last 24 hours was around $68.3 billion as of this writing.\n\nNotably, this volume has experienced a reduction of over 20% as of now. Further examination showed a significant impact on the total market volume from the Bitcoin and Ethereum trading activities within the same timeframe.\n\nAccording to Santiment’s data at the time of writing, the BTC volume was over $28 billion at press time. Analysis of the chart also showed that its volume was over $38 billion in the previous trading session.\n\nAdditionally, the ETH volume stood at over $11.6 billion, a decrease from over $12.7 billion in the last trading session.\n\nCombining the trading volumes of BTC and ETH as of now yields a total of almost $40 billion. This analysis indicates that more than half of the total trading volume is attributed to these two assets.\n\nBitcoin and Ethereum continue to exert dominance\n\nThe recent surge in the prices of Bitcoin and Ethereum has resulted in an augmented dominance of these two cryptocurrencies in the market, overshadowing the altcoin share.\n\nAccording to data from CoinMarketCap, as of this writing, BTC had more than 53% of the total crypto market cap.\n\nAdditionally, ETH accounted for over 17% of the market share. This implies that the combined market share of BTC and ETH surpasses 70%, leaving altcoins to constitute the remaining 30% of the market.\n\nRead Ethereum (ETH) Price Prediction 2023-24\n\nAs of this writing, ETH was trading at around $2,200, having experienced a loss of over 2% in value on 6th December.\n\nUnfortunately, the current trading session has not seen a recovery from this decline. Similarly, BTC was trading at around $43,200 as of this writing, sharing the same fate as Ethereum."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQNlFEY1RIb2RodnNFaTVHZmJVM1hNR29GVGYzQVpDZGdiY0V5RER0amhyYWFuTTBOM1kzTVVBSWZFSnlUUDd1QXlYdTAwYVBJSVcxNUZNLUtwVVVPeEtIU0ZzRXZPWERJZElBeFFERUY0cTdYOVBMR00zQkxYOV96VXpEdk5BNUM0LTYtRlJuZDJtUnR3QnNjLXh1a0ZzOWI0MTJadjFKVUNmRjRwMW1HSE9UMVNGUS1nZWRJYnBiZTJVSWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Etherium Price Forecast – What Will Happen to the Price of Ethereum in the Long Term? - Dubai Chronicle",
        "content": "ETHERIUM is one of the most valuable cryptocurrencies on the market, but its price can fluctuate drastically based on demand and supply; other cryptocurrencies’ prices, as well as events happening within the crypto ecosystem may all play a part.\n\nEven with these factors in play, investors still have reason for optimism in Ethereum. Some analysts predict that it could even return to its former heights over time; although this might take longer due to regulatory hurdles. Meanwhile, however, the Ethereum team has been hard at work improving the platform and creating new features; as well as making great strides forward with smart contracts — which should become key selling points of this coin in future.\n\nMany individuals and big companies alike are becoming interested in cryptocurrency technology, with JPMorgan Chase & Co embracing blockchain as evidenced by its creation of its own token on Ethereum blockchain for instantaneous bank-to-bank transactions. This shows an interest among more large firms to embrace it.\n\nNumerous projects rely on Ethereum blockchain, so as the price of Ethereum increases it will have a ripple-through effect to other projects built upon it. This phenomenon is known as the Ethereum effect and it can help attract investors by stimulating other projects built on this cryptocurrency. Furthermore, the Ethereum foundation is working on innovations which make blockchain technology safer and accessible to more users.\n\nAs more and more people utilize the Ethereum blockchain, its popularity will only continue to increase. Its promise as a platform for building decentralized applications is undeniable; furthermore, the Ethereum team are constantly improving the functionality of this decentralized ledger which should have an overall positive effect on ether prices over time.\n\nEven with these positive trends, investors should remain mindful of cryptocurrencies’ risks before engaging. It is wise to conduct your own research prior to investing and never commit more money than you can afford to lose.\n\nLong term, most experts hold an optimistic view on Ethereum prices. They anticipate its value increasing to $2500 by the end o 2023 and $4000 by 2030 and $5000 by 2032 due to its solid foundation, established reputation, and planned updates; furthermore it stands an excellent chance of becoming a triple point asset: store of value, payment vehicle and form of wealth creation."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOd2xXSWgxdjd2aUZmaEtVTjM3QklwUU1paUV2VTE2eHpkQUs3ZmY5TnZrVF93MFRzSENjQ2FvTHJxMml3VTdOek56ZHRLNVpRUmViRHRCX2pFX2RuZDhqV1VBSkxMRUtUU2k0UE5ISnAtak9tMnRlb19UcWhncnJucTVsdnBqZV9HRGViUm9ydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Crypto: Ethereum Catches up with Bitcoin, Altcoin season? - Cointribune EN",
        "content": "Fri 08 Dec 2023 ▪ 4 min read ▪ by Evans S.\n\nBitcoin has long played the role of the undisputed leader, paving the way for its crypto brethren. But, as in any good epic tale, a challenger arises: Ethereum. As we approach the end of 2023, we might be witnessing the dawn of a new era, where the altcoin is no longer content to follow but aims to compete. Is it the season of altcoins? In this financial ballet, Ethereum sketches a daring dance to catch up with the Bitcoin giant. Let’s analyze this captivating plot together.\n\nCrypto ETH: The Phoenix of Altcoins?\n\nYesterday, a remarkable event occurred: Ethereum’s cryptocurrency reached a new annual high of $2,312, demonstrating resilience worthy of a phoenix.\n\nWith a 10.28% progression in one week, Ether is no longer the timid younger sibling following in its elder’s footsteps. Against a still-dominating Bitcoin, this crypto seems to whisper a promise: “Nothing is played out yet.” This meteoric rise, although impressive, asks a burning question: how high can Ether go in this frenzied race?\n\nETH, like a maestro, has masterfully directed its dance around a graphical triangle, signaling a bullish target of $2,780. This geometric figure is not just a crypto trader’s whim; it is a strategy, a meticulously planned plot.\n\nThe Ichimoku indicators, with their colorful curves, seem to play a harmonious melody, supporting this ascent. But beware, every story has its twists. If ETH falls below its protective cloud, this dream of $2,780 may vanish, reminding us that falls are always possible.\n\nETH: The New Hero?\n\nSo, are we witnessing the emergence of a new hero in this crypto saga? Ethereum, with its current configuration, seems to have all the trumps to hit its target. But in this world where caution is queen, keep in mind that the cryptocurrency market is as unpredictable as a stormy ocean.\n\nThe question remains: Can Ethereum, strengthened by its ascent, truly reach $2,780 before the end of the year, and in this odyssey, can it redefine the rules of the game established by Bitcoin?\n\nIn conclusion, Ethereum’s rise is more than just a market fluctuation; it is a true digital odyssey, redefining the dynamics of power in the world of cryptocurrency. While Bitcoin continues to dominate, Ether, with its recent performance, prompts deep reflection on the future of altcoins. Is it a mere resurgence, or are we witnessing the dawn of an era where altcoins, led by Ethereum, play a leading role? The future, albeit encrypted, looks thrilling. In a world where surprise is the only constant, one thing is certain: the crypto realm will continue to mesmerize, astonish, and perhaps, overturn established titans.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPcDZKa3Q5SC1XUTVuMzZOWHd1Z1pidGZHNF9KQk5aMFdXTm9iMWpsWU9DSmlnc1loaU9tcjVoY3NEcVdQRHNDWVg1ZmpPcS1qSVROUVBRd3Nab3FFVGtqSlBlUUk3MHF3SHVHRlJoOGRiaDRXRk1nNnVicWlLZnItMUJLM041ODE2WGZscEZGNVYzdi11?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "VanEck predicts $40B inflow into Bitcoin ETFs and $100k BTC in 2024 - CryptoSlate",
        "content": "Global investment management firm VanEck‘s 2024 predictions for crypto suggest a transformative year ahead for the sector, highlighting pivotal events and trends set to redefine the digital asset landscape from economic fluctuations to groundbreaking technological advancements.\n\nThe forecasts are based on analysis beyond just the crypto sector, looking at economic trends, technological developments, and regulatory dynamics. From the anticipated U.S. recession’s intertwining with the launch of spot Bitcoin ETFs, aiming to bolster Bitcoin’s resilience above $30,000, to the fourth Bitcoin halving poised to elevate its market value, these predictions spotlight pivotal moments in crypto’s journey.\n\nFurther, VanEck’s outlook predicts Ethereum to retain its position beneath Bitcoin’s market dominance while simultaneously outshining major tech stocks and facing competition from other smart contract platforms. The NFT market, which will be fueled by both Ethereum and Bitcoin in 2024, is expected to scale new heights, reshaping the landscape of digital collectibles. Meanwhile, the stablecoin realm, particularly with USDC, anticipates unprecedented growth.\n\nThe predictions also highlight the potential shift in exchange supremacy, with Binance’s leading spot trading position challenged by emergent rivals. Additionally, DEXs are projected to claim a significant slice of the spot trading market. A breakthrough is anticipated for blockchain-based gaming, with a game surpassing one million daily active users, marking a milestone in mainstream acceptance.\n\nRobbie Ferguson, Co-Founder and President of Immutable, told CryptoSlate,\n\n“Recognition from VanEck, one of the world’s top 10 ETF issuers, is exceptional validation of the work we’ve been doing for web3 games since we built the first decentralized game on any blockchain in 2017[…] This endorsement further validates our platform strategy, and relentless focus on an exceptional end player experience.”\n\nFurthermore, Solana’s ascent to a top-three blockchain position, along with the rise of DePi networks like Hivemapper and Helium, anticipates broad diversification within the blockchain ecosystem.\n\nFinally, a pivotal area highlighted by VanEck is the integration of Know Your Customer (KYC) protocols in decentralized finance (DeFi), expected to usher in a new era of institutional participation. This, along with new corporate accounting treatments for crypto holdings, signals a shift towards mainstream and institutional adoption of cryptocurrencies.\n\nVanEck predicts spot Bitcoin ETF will be approved in Q1.\n\nIn 2024, VanEck predicts the U.S. economy to enter a recession amidst slowing economic momentum and cooling inflation. This downturn, marked by 19 months of consecutive decline in leading indicators, weak commodity markets, and increasing corporate bankruptcies, sets a challenging backdrop. Yet, in this economic landscape, the debut of the first U.S. spot Bitcoin ETFs will be approved in Q1.\n\nVanEck forecasts that these ETFs will attract substantial investment, drawing a parallel with the early success of the SPDR Gold Shares (GLD) ETF launched in 2004. The GLD ETF experienced rapid inflows, capturing a notable fraction of the gold market within its first quarter. Applying these metrics to Bitcoin, adjusted for the current era’s higher money supply, the prediction is a striking initial influx of around $1B, potentially reaching $2.4B within a quarter for Bitcoin ETFs.\n\nThis significant capital flow into Bitcoin ETFs reflects a deeper shift in the financial landscape. With the U.S. Federal Reserve’s M2 money supply considerably higher than during the GLD launch, the potential for Bitcoin ETF inflows is magnified, leading to an estimated $40.4B over the first two years. This surge is partly driven by a predicted preference for Bitcoin as a form of ‘hard money’ amidst concerns over sovereign debt levels and inflation, positioning it as an alternative to gold among investors.\n\nFurthermore, the expected lower transaction costs of these ETFs, compared to current retail trading fees, suggest a potential for broader market adoption. Such cost efficiencies historically have catalyzed the widespread acceptance of new technologies and could similarly propel Bitcoin ETFs into the financial mainstream. Despite the looming recession and potential market volatility, these developments indicate a robust demand for Bitcoin, potentially sustaining its price above $30k in the early phase of 2024.\n\nImpact of the Bitcoin halving and new Bitcoin ATH.\n\nVanEck predicts that the fourth Bitcoin halving event, scheduled for April, will unfold smoothly without major disruptions. This halving is likely to lead to the disconnection of unprofitable miners, shifting the landscape towards those with more efficient, low-cost power solutions. Despite the initial adjustment period, where the market might experience some consolidation, Bitcoin’s value is projected to rise. VanEck predicts that following the halving, Bitcoin’s price could surpass the $48k mark, aligning with the technical pattern observed in April 2022. This uptrend is expected despite some miners potentially underperforming compared to Bitcoin’s price, with low-cost miners like CLSK and RIOT predicted to outshine others. The post-halving period might also see significant growth for at least one publicly traded miner.\n\nThe second half of 2024 could bring even more dramatic developments for Bitcoin. Amid a backdrop of global political shifts and an increase in global voting participation, Bitcoin is anticipated to scale new heights. This period of heightened political activity and potential changes in regulatory landscapes, particularly following a significant U.S. presidential election, sets the stage for Bitcoin to potentially achieve an all-time high. VanEck speculates that by Nov. 2024, Bitcoin could hit a new peak in value, potentially reaching $100k by the year’s end. This scenario, marked by a departure from certain regulatory stances, could lead to a landmark moment for Bitcoin and its perception in the global financial system.\n\nThe Flippening won’t happen, but DeFi will rise.\n\nEthereum is set to make significant strides but will not surpass Bitcoin in market dominance. Ethereum’s performance is expected to outshine even the largest tech stocks, but it will not achieve the long-speculated “flippening” to overtake Bitcoin. Bitcoin’s clearer regulatory status and its appeal due to its energy-intensive mining process are anticipated to draw increased interest from state-backed entities in regions such as Latin America, the Middle East, and Asia. Notably, Argentina might join the ranks of countries like El Salvador and the UAE in state-level Bitcoin mining support, focusing on utilizing stranded methane and gas resources.\n\nSimultaneously, Ethereum’s Layer 2 solutions are poised for substantial growth following the implementation of EIP-4844, which promises to enhance scalability and reduce transaction fees. This upgrade is expected to catalyze a consolidation within the Ethereum network, with two to three Layer 2 chains emerging as dominant players. These leading chains could potentially surpass Ethereum in monthly decentralized exchange (DEX) volume and total value locked (TVL). This shift is likely due to the reduced transaction costs enabling more efficient trading and arbitrage opportunities. By the fourth quarter of 2024, these Ethereum Layer 2 chains collectively might double Ethereum’s current DEX volume and exponentially increase transaction numbers, signaling a significant evolution in Ethereum’s ecosystem.\n\nIn total, VanEck made 15 predictions for crypto in 2024, listed below:\n\nU.S. Recession Arrival and Debut of Spot Bitcoin ETFs Uneventful Fourth Bitcoin Halving Bitcoin’s All-Time High in Q4 of 2024 Ethereum’s Market Position Behind Bitcoin in 2024 Dominance of ETH Layer 2s Post-EIP-4844 NFT Activity Peaks to New Heights Binance Relinquishes Top Position in Spot Trading Stablecoin Market Cap Hits Record High with USDC Market Share Recovery Decentralized Exchanges Attain Record Spot Trading Market Share Bitcoin Yield Opportunities Driven by Remittances and Smart Contract Platforms Emergence of a Leading Blockchain Game Solana Outperforms Ethereum with Resurging DeFi TVL Meaningful Adoption of DePin Networks Corporate Crypto Holdings Boosted by New Accounting Standards DeFi’s Reconciliation with KYC Regulations\n\nThe full report from VanEck is available on the firm’s website.\n\n13.15 GMT: Updated to include comment from Immutable.\n\nMentioned in this article"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNVVpNOGNvMFhXLVVCNno3U1dZNThubjJOcS1wdTF4Sm1WUk5PRGRLYURBWWZqdnFkald0T1BuRnZxcmZuUWZNdzFGLVVlb3dLVUpXMnRZb1QtbFgxbWN5RWsxYy0tbmhubzMzdTFMLXFJdzc3OFNGTExBR3QtT0pfbURGa08tUjAxSFBZXzgyMjNtVS1rZzN3bV9GbWJkNGVQa1htNk5n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Cardano’s Snek And Solana’s Bonk Explode – Is A New Ethereum Chain Meme Coin Next - CryptoPotato",
        "content": "The meme coin market has seen an uptick in the past week, with Cardano’s Snek (SNEK) and Solana’s Bonk (BONK) experiencing immense gains.\n\nThese meme-inspired coins on different blockchains have rallied impressively, attracting retail investors seeking the next Dogecoin or Shiba Inu.\n\nWith meme coin momentum showing no signs of slowing down, some experts wonder if a new Ethereum-based token may be next to ride the hype.\n\nSNEK Surges After Investor FOMO Boosts Forgotten Meme Coin\n\nIt’s been an excellent week for SNEK holders, with the coin’s price rising almost 170% since last Friday.\n\nSNEK is now trading for $0.00079, its highest value since June.\n\nAccording to CoinMarketCap, over $3.5 million worth of SNEK exchanged hands in the past 24 hours – a 49% increase from the previous day.\n\nThis highlights the renewed interest and hype surrounding the token in recent days.\n\nThe Cardano-based meme coin had gone quiet for months after its initial price surge when it launched earlier this year, but fresh waves of investor demand have now pushed its market cap back over $54 million.\n\nMuch of this newfound momentum comes from the current bullish sentiment in the broader crypto market.\n\nWith Bitcoin and Ethereum rallying powerfully, speculative coins like SNEK tend to benefit from the spillover hype.\n\nAlthough its fundamentals may still be lacking, SNEK’s price action hints that further upside could be ahead.\n\nBONK Price Explodes Over 5,500%, Hitting All-Time High\n\nThe BONK meme coin on Solana has seen ever more parabolic price action than Cardano’s SNEK this past week.\n\nAfter trading sideways for most of the year following January’s spike, BONK has suddenly caught fire and rocketed over 5,500% since the start of November.\n\nBONK recently hit an all-time high of $0.000012, with the token now boasting a market cap of $710 million.\n\nThis makes BONK the third-largest meme coin globally, flipping Pepe (PEPE) coin.\n\nMuch like SNEK, BONK has benefited from the return of speculation to the crypto sector in the past three months.\n\nThanks to the market’s strength, the entire Solana ecosystem has seen renewed developer and investor interest.\n\nAs the SOL token began to rally, it brought visibility and liquidity to projects built on the network, positively affecting BONK.\n\nMajor exchange listings have also played a key role in BONK’s trajectory, with the buzz around the token showing no signs of abating.\n\nCould an Ethereum-Based Meme Coin Could Explode Next?\n\nWith meme coin mania hitting networks like Cardano and Solana, attention now turns to whether an Ethereum-based project could be next to benefit from the speculative wave.\n\nEthereum has lagged behind Bitcoin’s powerful rally in recent months, yet the ETH/BTC pair surged almost 8% yesterday.\n\nThis shows capital flowing back into Ethereum and is beginning to benefit existing meme coins like Pepe (PEPE), which is up by 9% since yesterday.\n\nMoreover, some investors now believe Ethereum’s strength could provide scope for a relatively unknown project to break out in a similar fashion to SNEK or BONK.\n\nTwo potential candidates include Meme Kombat (MK) and Wall Street Memes (WSM).\n\nMeme Kombat features an AI-powered battle arena where users can place bets on the outcomes of hilarious fights between meme coin mascots.\n\nAlongside the battle arena, Meme Kombat has a staking protocol where investors can lock up the native MK token and earn yields of 318% annually.\n\nIn terms of coins already listed on exchanges, Wall Street Memes is a meme coin inspired by the values of those who took down the short sellers during GameStop’s short squeeze in 2021.\n\nWSM has already climbed the ranks of the top meme coins on CoinMarketCap, with room to grow as its FDV is still under $50 million.\n\n$WSM is currently listed on Uniswap and OKX, and $MK is available to buy at memekombat.io.\n\nBoth MK and WSM feature the viral potential that could help them attract a surge of interest from internet communities if Ethereum continues gaining ground.\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOUDVoRkJETjlhYlozZ3c2MGVYOTN2NzJDZUxLSVRvRTFqYUtMbzVqRFNrWE1SMUJIb1dmWndsQkVwaEZsZGlxS1lpRWprN2tNaEVrejJqaHVkajFwdWhQTjAtRURrTmYydU9tRXJrZng5TDZJaWlVcV84RGJEVS1LajFoV0xabk93ZFpZb3hzR0xCQkkxaVFkbFpZUVZyTF8x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Early Ethereum whale moves $90m to Kraken; Arweave holders eyeing Pullix presale - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nRecently, a dormant Ethereum whale moved coins worth approximately $90 million to Kraken, a crypto exchange, after five years, prompting discussions among analysts and crypto enthusiasts.\n\nAt the same time, Arweave holders are actively exploring Pullix as the project approaches its token presale.\n\nEthereum remains bullish\n\nIn crypto, whale movements negatively impact prices, especially if coins are moved to an exchange.\n\nRecently, a whale deposited 39,260 ETH to Kraken. This address had previously received 47,260 ETH, valued at just over $11 million at that time, from a single transaction in 2017.\n\nIf the whale sells, the address could realize $90 million in the current market conditions.\n\nArweave holders explore Pullix presale\n\nEarly Arweave holders understand the importance of early-stage investment.\n\nFor perspective, AR prices reached an all-time high of $90.94 in November 2021, a 200,000% increase from its all-time low of $0.4 in May 2020.\n\nDespite prices declining in 2022, AR is trading at around $8. Early investors are still in profit.\n\nSome Arweave holders are exploring opportunities and are considering Pullix.\n\nPullix features\n\nPullix offers a hybrid crypto exchange, combining decentralized finance (defi) with online over-the-counter (OTC) retail trading potential.\n\nPLX is the platform’s utility and governance token. Traders can access rewards and benefits through this token.\n\nThe platform supports PLX with up to 30% of its revenue, mitigating volatility risks.\n\nYou might also like: Analyst bullish on Ethereum as XRP momentum builds\n\nPullix also offers traders and early-stage investors profit-sharing opportunities, including PLX exposure.\n\nStaking PLX and providing liquidity could provide potential returns of up to 18% on fixed investments and even higher on other incentives.\n\nPLX has a total capped supply of 200 million, 60% of which is allocated for presale at an initial rate of $0.04 in stage 1.\n\nFor more information about the Pullix presale, visit details below:\n\nWebsite: https://pullix.io/\n\nX: https://twitter.com/pullixmarkets\n\nTelegram: https://t.me/pullixmarkets"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNRkJjM1puVFRKLW5kOXpRa205YWlCUFliQkVIUGlMbXFHbm91VmVNQWJFbFVabFdSQTkzTTNsam5pOG1mZlBMXzhOYzBSSmtZQzMxajZ5MGQ1ZXpvdGxJTS1BU1pHQVhrb3FYMmttU1kycWp1MjUyRWJTcURXLTlJNUloMF81R0VtcjhiNzkwdUE3emFHOUhudUdqeno5TzB1YWVjQW1CMEpIb2xBV0tiSXJDZEVJSGxyUjd0TV82bkMwNXplWms5TTk4NmFJQTBhQ0NB0gHYAUFVX3lxTE9sMGhvUk1sN3hiYnpvbG1LamRVQkozOC1VUFY1QjBnZWJjbS1va0laSldFa01tM3UyQ0hjUmdVLWZGQjQ3eUpkWnEyaEkzLS0wN0FrdXhQYWpMRGlmTzdDMUcxWTMzUm9tcUJGVVRCZzBuVkgxelVEMzhCRFVNVV9oN19MVnFDdVNQYTM1V2RfdVJxOVpyUFluQ2p4S3RmQWRYS0ZZdjFiNTd4ZnZ1RGhwRVlzc1FaVWI2V0t2VGZrVEhxcWRaaHY1ZG9uVlU4aU1LUnhpdmtnTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "‘Don’t Rule Out a $25,000 Liquidity Sweep’ – Trader Predicts Massive Correction for Bitcoin if History Repeats - The Daily Hodl",
        "content": "Widely followed crypto analyst Justin Bennett is issuing a warning about Bitcoin (BTC) amid the flagship crypto asset’s massive 2023 rally.\n\nNoting that Bitcoin capitulated twice around each of its last two halving cycles – in 2015 and 2016 and then in 2019 and 2020 – Bennett says that a correction of around 43% from its current level should not be ruled out.\n\nBased on Bennett’s chart, he is suggesting that Bitcoin could reach up to around $50,000 before reversing course.\n\n“It’s been a hell of a run from BTC, and it may very well continue without a significant correction in the short term.\n\nBut the last two bear markets ended with a second capitulation.\n\nWill this time be different?\n\nMaybe, but don’t rule out a $25,000 liquidity sweep.”\n\nBitcoin is trading at $44,146 at time of writing while its next halving cycle is slated for April 2024.\n\nBennett says he’s still not convinced that the crypto markets are in a bullish phase. According to the crypto analyst, there are several reasons for his lack of conviction.\n\n“Fact is, the macro landscape is VERY different this time than the start of any other crypto bull market.\n\nNot to mention the big-name stocks that have driven this recent push are trading at steep long-term premiums vs. discounts as with other cycle starts.”\n\nIn the case of Ethereum (ETH), Bennett says that he sees no reason to abandon his bearish thesis for the second-largest crypto asset by market cap. In his bearish scenario, Bennett projects ETH could fall by around 67% from its current level.\n\nEthereum is trading at $2,267 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQUWhxM2VrRzdqSzhhOFN6eGJSZ2ZaaEkxb1pYQUdnNmYwVVVkYUpTeVZ3LTE2WThYMGl0N3FSbkVQQXJIMU5neFY0Nm0tdE8tM05fSm9XekhUbVktVkUwQzJSTldoczFMRmxFa2xLdUtuNFVMZWdhVk1WSzc5a3VNb2hQclfSAYoBQVVfeXFMT2dSYnFmN2kwRHlBYXJXM243ekNZSHN4TVlGclpGUktmVkFVZzRjaHhRTzRXS1k5TzM4aWNFN1lRbjQ3UkNrdnJYT3pfaWw1d0dXZmVVYkJLWnE5aHVUZ0wyS0xYc21MSXloMGNJQUg0Z0ZKTzZDVUpiRElCMEJaNGhDYi1oWGpQUEtR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Crypto Price Analysis Dec-8: ETH, XRP, ADA, SOL, and BONK - CryptoPotato",
        "content": "This week, we take a closer look at Ethereum, Ripple, Cardano, Solana, and BONK.\n\nEthereum (ETH)\n\nETH’s price booked a 12% increase this past week after it was finally able to escape the ascending triangle that has been forming since 2022.\n\nThe breakout above $2,150 started this rally, which may not see any significant pullback until $2,500. That is the current target for this move. If buyers remain aggressive, they could aim to take Ethereum to $3,000 after that.\n\nLooking ahead, the momentum is bullish, and ETH is showing signs it may recover some of the ground lost to Bitcoin in the past few weeks.\n\nRipple (XRP)\n\nXRP is also bullish and managed to book a 5% increase this week. However, the resistance at 68 cents is still to be broken before this cryptocurrency can aim for higher levels.\n\nThe support at 57 cents held well, and considering that buyers are dominating the market right now, XRP could continue to perform in the coming week.\n\nLooking ahead, this cryptocurrency could break the current resistance and aim to reach the previous high from July when XRP got close to $1.\n\nCardano (ADA)\n\nADA bulls woke up this week with an impressive 28% price increase. This spectacular performance obliterated the resistance at 46 cents, and now buyers are looking at much higher levels.\n\nThe most important resistance on the chart right now is found at 60 cents. Sellers may attempt to stop this rally around 50 cents, but that is unlikely to last, considering market sentiment.\n\nLooking ahead, if ADA manages to maintain this momentum, then going to 60 cents becomes likely.\n\nSolana (SOL)\n\nThis week, Solana broke the resistance at $67 and booked a 16% price increase. This allowed buyers to take it to $72 today.\n\nIf bulls remain strong, then the previous resistance at $67 can turn into support, and Solana can move higher still and towards $80 next.\n\nLooking ahead, this cryptocurrency continues to show strength and this latest breakout confirms that bulls are very much still in control.\n\nBONK\n\nThe surprise of the past two months is BONK, the biggest meme token on the Solana network. The price has not stopped pumping since late October and booked an eye-popping 187% increase this week alone.\n\nWith such a performance, it is almost impossible to guess where BONK will top or decide to correct. After a 70x increase from its all-time low, this Solana token could continue to rally, considering the market sentiment.\n\nLooking ahead, it seems meme tokens are back in the spotlight, and BONK holders are having the time of their life."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOQjhFZGFxLTJlU2RwanNacGxHT0N3Wm1YNHNaR1BzVEt0UEMwLXkxcXF5NHp6YVUxMkhKSkJzUTB6MmItbUlZUnkwWXp2UXlMU191OE9jUm53TlloU3dJU081VWV6amNMT0dMcUZabTlfU1dPZjhtN2phU1J2MW51YS0wTEtIZFJfNWNrNzFLa1l1VF9nQlVz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "ChatGPT Picked 5 Top Coins to Buy in December, and Why - The Crypto Basic",
        "content": "The Crypto Basic asked ChatGPT to provide insights on 5 top cryptocurrencies to buy in December. The AI’s choices are presented alongside the reasons provided.\n\nAs a somewhat regulated AI chatbot, posing the question directly to ChatGPT met resistance as the application said it was not equipped to “provide specific financial advice, including recommendations on which cryptocurrencies to buy.”\n\nUpon getting this answer, we decided to Jailbreak it, and here are the coins it suggested:\n\n- Advertisement -\n\nBitcoin (BTC)\n\nAlmost everyone must have guessed that Bitcoin will top the list of assets ChatGPT will suggest. The chatbot said the digital currency is the pioneering digital currency and the most recognized asset in the industry.\n\nChatGPT states that Bitcoin’s scarcity and decentralized nature “make it a reliable store of value, attracting investors seeking stability amid market fluctuations.”\n\nChatGPT’s choice of Bitcoin is ideal, seeing the coin has soared to a new year high above $44,000 on the sentiment of a likely approval of Bitcoin spot ETF.\n\nEthereum (ETH)\n\nEthereum made the list as a smart contract protocol whose capabilities open it up to welcome decentralized applications that can properly boost innovation and widespread adoption.\n\nChatGPT also named the Ethereum upgrades like The Merge that ushered in Ethereum 2.0 as a basis for this surge. The chatbot said these upgrades contributed to the scalability of the Ethereum protocol as a whole and might impact the price of the asset.\n\n- Advertisement -\n\nBinance Coin (BNB)\n\nBinance Coin is the native asset of the Binance ecosystem and also serves the BNB Chain protocol. ChatGPT added Binance Coin to the list for its “reduced trading fees,” which typically “amplifies its utility and demand.”\n\nThe success of Binance in incubating successful projects has also been named a factor that can influence the price of BNB.\n\nCardano (ADA)\n\nCardano also made the ChatGPT list for its scalability and sustainability. ChatGPT highlighted Cardano’s focus on providing proper scaling solutions in the Web3 world as well as its “environmental sustainability” drive as a key push for its relevance in the industry.\n\nChatGPT also highlighted the smart contract capabilities of Cardano as a gateway for DApps that can also boost investor sentiment.\n\nSolana (SOL)\n\nThe last pick on the list is Solana. The coin was chosen for its high throughput, relatively lower fees, and a hoard of DeFi projects running on it. Solana’s ecosystem growth was also a major turn-on that ChatGPT believes can add to SOL’s “perceived value and potential future success.”\n\nIt is worth noting that many experts and entities, including VanEck, share a similar sentiment that Solana is primed for an impressive surge in the long term."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNNjhaNm1ZU3dUdzJPejBLREhCbTJQZGdoeDQyUDhFeVNXcUwzU1BsVzJ4WFB1V1Q1VWh1NzFBS1BCd0NTQVZQaGc2UlVLcUZVNjVkWHYwWDFGNmE0TF9UOFlhQmFEVjhyRElsSjNuRnYyeDdPZWtSLTZJam1BUl9fYmhJUW04eXItYTBUUkh0ZXAySFXSAZgBQVVfeXFMUFgtQS1aMnFQSXg1b3JiZlItSDBxRl85TDFMcTlWTWxUOXV6LVJnNUg5ZEl4ZGZnUVFUbUdpaExyV2h3cE1FMXROd0ExanJ0andjNm5JQ0hrR1J2dzRKLVBUZUZuT2t6ajc2Vk80WVBRSjNtUjQwVEx3eFRpZjNzaEEzTV82eWpqblhMZlltOXNMM3dfbThoMng?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "What You Need to Know About Robinhood’s New Crypto App in Europe - CryptoPotato",
        "content": "In a strategic move, the popular online brokerage platform Robinhood has announced the launch of its cryptocurrency trading feature in Europe. The platform has intentions to expand its range of tokens and introduce additional features, such as cryptocurrency transfers, staking, and educational rewards, in the year 2024.\n\nThis development follows Robinhood’s recent expansion plans beyond the United States.\n\nRobinhood Launches Crypto Trading App\n\nRobinhood’s latest crypto product is designed to allow European customers with the ability to buy, sell, and hold more than 25 tokens. Among the featured cryptocurrencies are popular names like Bitcoin, Ethereum, XRP, Cardano, Solana, and Polkadot. The platform aims to broaden its token selection further, with plans to introduce additional cryptocurrencies and enable features like token transfer and staking by 2024.\n\nThe Robinhood Crypto app will only be available to individuals in Europe aged 18 and above, effective from December 7th. It is now accessible on both iOS and Android devices.\n\nThe newly introduced crypto application imposes no trading fees, and users will also get a percentage of their monthly trading volume back in Bitcoin. The app will display the spread, including the rebate received from sell and trade orders, and will also offer comprehensive pricing to eliminate customer concerns related to concealed fees, ensuring they receive the maximum value in crypto for their Euros.\n\nIn an official statement, Johann Kerbrat, GM of Robinhood Crypto said,\n\n“We believe crypto is the financial framework for tomorrow and that it plays a significant role in our mission to democratize finance for all. For this reason, we’re thrilled to expand crypto trading to customers throughout the EU, enabling them to buy and sell their favorite tokens safely and securely.”\n\nWhy EU?\n\nRobinhood has been cautious about its cryptocurrency operations. In June, the company took proactive measures to voluntarily restrict the trading and holding of specific tokens for its US clientele, coinciding with a period when the government was adopting a more hostile stance toward major trading platforms like Binance and Coinbase.\n\nIn contrast to the regulatory scrutiny faced by crypto firms in the US, the European Union has taken a proactive approach by proposing the Markets in Crypto-Assets (MiCA) regulation to ensure the traceability of cryptocurrencies for anti-money laundering purposes and to shield merchants from fluctuations in the market.\n\nWhile addressing the motive behind choosing Europe, Kerbrat said\n\n“The EU has developed one of the world’s most comprehensive policies for crypto asset regulation, which is why we chose the region to anchor Robinhood Crypto’s international expansion plans.”"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPa2pSdnNBbTF5VzIteHQwTk9MWElFcEdQQ2JLTjl1UjNSX1kzeHNyaTNJSXdQbWdYZ3NHbUF2dDNfRzZJUG9DOHRYeHEyNzNGeGV5bEJqTjZQNFhxNFlKZ3ZBelVacTBNa0I0QVN5b3JWMUpwSnNnR2pxV19YT3NjdDV0Q2VPSGtJejd1YWx0NHItVnN5Rm1uSmlHNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Dec 2023 08:00:00 GMT",
        "title": "Société Générale becomes first major bank to publicly list stablecoin - Investment Week",
        "content": "Developed by SG-FORGE, the bank's subsidiary dedicated to cryptoassets, the coin launched an Ethereum public blockchain yesterday (6 December) on crypto exchange Bitstamp. Unlike 'normal' cryptocurrencies, stablecoins are pegged to a fixed amount, either through backing with assets or an algorithmic process. SG-FORGE said the coins would be backed by euros held by a third party. Bank of England and FCA outline plans to regulate stablecoins into mainstream While some banks, such as JP Morgan, have launched stablecoins for internal use, Société Générale's is the first to be listed on..."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE9mUlZoQ0RaS1gzSmJfSEcwdWF6eWltb3ZuYU5HS21QZE9qUmlqU0pha19qS2tfRURfWDJrOVp3MFJ6TjdTNHh0YlVkTWpyaGxPVGlIbkNUVXZyV2xKelN0WmQyNzhBS3hGQWlGSE1ySHpqZWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Solana Handles 70% of Ethereum DEX Volume as SOL Blows Past $70 - Coinfomania",
        "content": "The Solana DeFi ecosystem has witnessed tremendous growth in the past few weeks. Some of the biggest beneficiaries are decentralized exchanges on the network, which are seeing record-breaking volumes.\n\nNotably, the rapid rise in volume has also seen Solana edge closer to major competitor Ethereum. In the 24 hours before press time, Solana-based DEXes handled $1.01 billion in trading volume, or around 70% of Ethereum’s volume over the same period. The much older network settled $1.434 billion, maintaining its edge as the largest blockchain network for DEX trading.\n\nSurging DEX volume on Solana is primarily attributable to a proliferation of ecosystem projects launching their tokens via airdrops, thus increasing liquidity. Blockchain oracle service provider Pyth Network recently completed its airdrop, with Jito (JIT) following up with an airdrop on Thursday.\n\nAcross the Solana ecosystem, the leading destinations for users include liquid staking protocols, Marinade Finance and Jito, which control a sizeable portion of the total value locked on the network. Lending protocols, Margin and Solend, are not far off, contributing a combined $350 million of TVL.\n\nMeanwhile, the growth in Solana’s DeFi ecosystem may also be linked to the network’s inherently lower transaction fees and faster transaction speeds when compared to Ethereum. In comparison, Ethereum has struggled to keep up with increased demand, resulting in high costs and slow transaction times.\n\nSOL Surges Past $70\n\nIncreased capital and user engagement with the Solana ecosystem have affected the price of its native coin, SOL. In the past 24 hours, SOL has surged past $70, reaching its highest level since May 2022.\n\nAt the time of filing this report, SOL was trading at $72, representing a 12.79% increase in the last 24 hours and an 18.32% surge in the past seven days. The token has surged 62% in the past month and 423% since the beginning of the year."
    }
]