[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBPeEZTS1ZIUmpsY0ctWXhiY2VuMHBXUDc2QVVrOXFYMFQydWVCOGVPMUhfaTduR3dEZ2l1clJmT0xBWWpWR2NJS1IwZEpBZC1FbVlZeUx1TXNrMTFMaWprRWxmdi0xNzk0VzFaVlpaY0fSAXZBVV95cUxPZW9UaFNza1BtS3h3R2lLSXdEQzQyTlA1WnZxWW5CRjRLaGI1SkRpUDBKSDVfbS1PaEVnZTlCRTc4LVpZRUNBc0gyNFZnVHNCcFBfTUJISFQ5UmhXRVQzdnJEcmZUQ0oxd1REMF9LNTM3a0N1QkZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Is Ethereum once again the victim of its own success? - Forkast News",
        "content": "Ever since Ethereum’s shift to a proof-of-stake (PoS) consensus mechanism, an increasing number of users are getting in on the staking action to reap the rewards that come with it. Institutions are also paying attention, given the decrease in network risk and volatility following “The Merge.” This has led to concerns about how much ETH is getting locked into staking contracts, potentially interfering with liquidity on the network.\n\nDevelopers are already proposing possible solutions to limit the rate of staking, which benefits overall network health but has now limited the opportunities for users to earn a yield from the network. Coupled with an ongoing DeFi winter, there just aren’t as many lucrative returns opportunities in this space as there once were. Truth is, without profitable and reliable alternatives, ETH holders are going to continue to be drawn to staking as the best means of generating return on their assets.\n\nThe rise of Ethereum staking\n\nIt’s been about a year since Ethereum successfully completed the Merge, in which the blockchain switched from a proof-of-work (PoW) consensus mechanism, like Bitcoin, to a PoS one. This was done to significantly improve the efficiency of the Ethereum network and allowed users to earn a passive income by staking their ETH to secure the network. Ethereum 2.0 was born.\n\nOverall, this has been seen as a positive move for the Ethereum network. A significant number of users have staked their assets already, to the tune of 20% of all circulating Ether. In theory, this sounds great, as the idea is that a diverse array of users are both helping to ensure the security of the blockchain and are being rightly rewarded for doing so. The reality, however, is a bit different.\n\nThe rise of large staking providers have made it easier for virtually anyone to get involved, but this is causing the amount of ETH that is staked to continue to quickly rise. At the current trajectory, the amount of ETH locked up could balloon up to as much as 50% by May 2024 and even approach 100% by December next year, according to projections in an Ethereum Improvement Proposal co-authored by Ethereum co-founder Tim Beiko. While actually seeing the entire supply of Ethereum get locked up won’t happen, this situation could still cause a significant liquidity crunch that limits the functionality of the blockchain ecosystem, decentralized apps, and services built on top of it.\n\nThis fiasco has led to Ethereum developers approving a new proposal that would control the rate at which new validators could stake ETH. Known as EIP-7514, this change will modify the “churn limit” function to give it a maximum value that will regulate how many validators are able to join or exit the network within a given timeframe. The proposal is already being included in the Cancun-Deneb upgrade that was slated for this October but will likely now be delayed until early next year.\n\nWhile EIP-7514 will help to buy some time, it doesn’t actually address the underlying problem. Namely, the fact that Ethereum staking, as is, incentivizes locking up funds over keeping them liquid. It’s true that users don’t have to stake Ethereum directly but can turn to other yield-bearing services. However, in the wake of FTX and other recent disasters, the entire DeFi market has seen an almost 80% contraction over the last year. This means there are fewer and less useful places for asset holders to earn yield.\n\nWhat alternatives need to offer\n\nUsers need a safe and lucrative alternative that has advantages to staking, even if the returns aren’t quite at the level provided by staking. These could come in the form of yield-generating accounts that allow for returns on the Ethereum stored inside them, but don’t have days or weeks-long limits on when funds are accessible. Because no staking is actually done, users stay in full control of their own assets.\n\nBetter still, accounts such as these could be significantly more user-friendly than the confusing, alienating process of Ethereum staking, holders would simply need to deposit their funds and sit on them. They could remove them at any time, and overall liquidity on the network is not affected. Users also wouldn’t rely on the health of DeFi as a whole, and will generate returns regardless of what the market is doing.\n\nAnother essential aspect of these offerings is that they can also be “ring-fenced,” meaning the assets are never intermingled with other user’s funds or company activities and aren’t exposed to broader systemic risk. Assets that are used for growth opportunities are separate from those that are just being held as savings. This is important for keeping users safe, as even if the service itself should collapse, all held funds will be completely intact.\n\nImplementing a service where anyone can grow savings without the need to lock up ETH is the ultimate key to solving the ongoing staking issue that is plaguing Ethereum. Protocol changes are helpful, but what is essential is changing the incentive that users have for earning yield on their assets. By providing growth opportunities that don’t involve actual staking, these accounts can be simpler, safer and healthier for the whole ecosystem than centralized alternatives. The solution is obvious; now it’s time to bring something like this to Ethereum holders worldwide."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5fd09jR2ktNzhLSlZnSklVd0lpeEdYYWYwcE9UZU4wUzQzT1doNGRGeTdKcTFFODBBYUhVZm9YaW1SRHl6MzczTVRQZGJEV1hFc3kwNmlVY0JtM1lxenJPdGVuVUtjSmhpN2Z2UXVKYlk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Ethereum research explores zk-based privacy for mainnet - Blockworks",
        "content": "New research into the Ethereum blockchain looks at ways to use zk-SKNARKs (zero-knowledge succinct non-interactive argument of knowledge) to enable private transactions using Solidity, the primary programming language on Ethereum.\n\nThis research is primarily focused on being able to enable privacy-enhancing functionality that is traditionally reserved for layer-2 networks built on top of the Ethereum application layer.\n\nAccording to Mirror Tang, co-founder of Salus Security and author of the research paper, enabling ZK functionality within Solidity may remove the need for layer-2 blockchains, such as zero-knowledge rollups.\n\n“A lot of DeFi activity remains on Ethereum L-1, and less so on L-2s,” Tang told Blockworks. “If we can use computational optimization to enable ZK technology on Solidity, we would be able to reduce gas fees on Ethereum itself significantly.”\n\nThis may allow transaction activity to be concentrated on Ethereum rather than its disparate L-2 ecosystems, Tang explained.\n\nThere are existing technical barriers to introducing zk-SNARKs to Ethereum, however.\n\nFor example, Solidity is currently single-threaded in nature, meaning that it executes one transaction at a time. It will be important, therefore, to find ways to introduce multithreading to Ethereum.\n\nFurther, to enable zk-SNARKs to operate effectively and securely on the network, it will be necessary to ensure it is auditable.\n\nBy nature, ZK technology relies on provers to send accurate proofs to third-party verifiers without revealing the information of the statement, meaning there would be additional storage requirements at the verification stage.\n\nAbsent these barriers, Tang’s research indicates Zk-SNARKs on Solidity could enhance privacy and improve MEV resistance by enabling private transactions and voting on existing Ethereum projects. Fast-tracking the verification process would enhance the performance of the blockchain as a whole.\n\nThis research, if pursued, would be entirely open-source, enabling further development and contribution by the Solidity community, Tang said.\n\nHe hopes that his research will be noticed by venture capitalists in the crypto community so that his team can continue working towards making its findings a reality.\n\nInterview with Tang was conducted in Mandarin. Quotes in this article have been translated from Mandarin to English.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPXy1LTkhvSElwS3FraTVvMURRM0ctSzdLSk9heWlkLWVFOGZuVi1DUV9tTC1ybktsRUlzeGphclFlMGNqQm5HdElGbUF1X0F3T1Jtdl9PYV9ySHhUM3N4OGpuamVFdE41NV9fMjVlbUUtRnVtRXFlZkxpakxMYWlsZGtlZVVyT0w4ckNWZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Solana Overtakes Ethereum By Active Users After 70% Spike - Yahoo Finance",
        "content": "The number of daily active users on Solana overtook the Ethereum mainnet on Nov. 11 following a sharp uptick in activity.\n\nAccording to data to Artemix, Solana hosted 356,300 unique users on Saturday, surpassing Ethereum’s nearly 330,000 by 10%. The milestone was driven by a sharp uptick in activity on Solana, with the network hosting only 208,000 active addresses on Nov. 7.\n\nFor comparison, Ethereum consistently hosted between 290,000 and 350,000 users daily over the majority of the past three months, with two brief spikes above 400,000 and a surge to more than 1M wallets.\n\nSolana Overtakes Ethereum By Active Users After 70% Spike\n\nThe milestone is the latest sign of Solana’s recovery following last year’s brutal bear and the fallout from the collapse of its major investor, FTX.\n\nThe price of SOL plummeted more than 96% from its November 2021 all-time high of $250 to less than $10 in January, according to CoinGecko. Active addresses on the network shrank 85% from 1.28M in May 2022 to around 200,000 this September, according to The Block.\n\nBut Solana refused to stay down, with the network outperforming the broader markets amid the recent cryptocurrency rally as evidenced by the recent surge in active addresses.\n\nThe price of SOL is up 145% in four weeks, beating out many rival digital assets by at least double. The total value locked in Solana-based DeFi protocols is up 62% over the same period, according to DeFi Llama, while NFT sales volume grew 35% in the past 30 days, according to Crypto Slam.\n\nThe move followed progress towards Solana's firedancer upgrade in the form of a testnet, and dissipating expectations that the FTX bankruptcy estate would soon offload large sums of SOL on the markets.\n\nEthereum’s Layer 2s\n\nWhile some analysts have been quick to pronounce that Solana has flipped Ethereum by active users in response to the recent uptick in activity. However, the Ethereum ecosystem has expanded beyond its base-layer, with the majority of activity now taking place on Layer 2.\n\nAccording to data from Token Terminal, more than 800,000 users were active on the top seven Layer 2 networks over the past day combined. Coupled with the Ethereum mainnet, the data suggests more than 1M wallets were active across the Ethereum ecosystem. However, said data does not account for users operating the same wallet across multiple networks.\n\nAccording to L2beat, Layer 2 networks are driving 80% of activity in Ethereum’s broader ecosystem, which is driving roughly 60 transactions per second.\n\nTo continue reading this as well as other DeFi and Web3 news, visit us at thedefiant.io"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOVGYzbFd5X0k2NkQzck05TlBENkI1aUpQOThUblhuZG9OaFlLSV9aeWNidEQwVnJQSXhEYjh6MU5JS3hWblcxQ25LNWNyVFlHdndRdE5TeWVPQThTNmhHcU5Rdnp0WGx5c3hlNmNoZDFvNktvY25FN2hUdlMya0lMb18xMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "The Rise of Zero-Knowledge Rollups in Ethereum Scaling - hackernoon.com",
        "content": "Zero-knowledge rollups are gaining momentum as the ultimate Ethereum scaling solution.\n\nThis year alone, no less than four major projects based on ZK rollups were launched, and four more are in the works. The technology has proven to be exceptionally fitting for the crypto space, and given the growing enthusiasm from venture capitalists, the ZK trend is here to stay.\n\n\n\n\n\nThis is a comprehensive overview of the current zk rollup landscape and its most prominent projects: zkSync, Starknet, Polygon zkEVM, Linea, and Scroll.\n\n\n\n\n\nBut first: What are zk rollups, and why is everyone so excited about them?\n\nWhat are ZK rollups?\n\nThe ZK FOMO has a good reason behind it.\n\n\n\n\n\nThis method allows executing smart contract computations off the blockchain, rolling them up in batches, and then submitting these batches back to the main chain using zero-knowledge proofs to show that the computations happened within the rules of the EVM. Simply put, zk-rollups allow to outsource computation, all while leveraging the main chain’s decentralization and security.\n\n\n\n\n\nUnlike their closest competitor, optimistic rollups, zk rollups offer quicker transaction finality time and better user privacy. Optimistic roll-ups take an “optimistic” stance, assuming that all layer-2 transactions are valid unless proven otherwise by an honest network validator. If the optimistic rollup batch faces no challenges during the dispute period, the transaction data is successfully added to the Ethereum main chain.\n\n\n\n\n\nIn contrast, ZK rollups count on cryptography: after all, math is always more reliable than humans. However, this comes with its own set of complications, such as high computation costs, as well as a more complex cryptographic and engineering network. Fortunately, the former can be solved with special hardware, such as FPGA or ASIC, and the latter – with quality engineering education, like the one provided by RareSkills.\n\n\n\n\n\nYet, there is another hurdle associated with ZK rollups.\n\nEVM-compatibility vs performance\n\nEthereum was not designed to be ZK-friendly, and there are many parts of its protocol that take a large amount of computation to generate validity proofs. This means that building a functional zkEVM – a replica of the Ethereum Virtual Machine that uses zk-rollups – implies a major trade-off: EVM compatibility vs performance. There is a balance between these two qualities, and different zk rollup-based projects are trying different ways to find the perfect one.\n\n\n\n\n\nVitalik Buterin formulated this dichotomy in 2022, drafting a chart with five types of protocols using zk-proofs, from the most compatible to the most performant.\n\n\n\n\n\nEach approach has its pros and cons, and several major projects are exploring them now.\n\nzkSync Era\n\nAccording to Vitalik’s framework, this protocol corresponds to Type 4: high-language-equivalent.\n\nDeveloped by Matter Labs, zkSync Era went live in March 2023. Its current TPS (transaction per second) stands at 4.75, down from this summer’s 9.9. However, according to the protocol’s documentation, it can offer up to 2,000 TPS at peak load.\n\n\n\n\n\nZkSync uses its LLVM compiler to translate code from Solidity, Vyper, and Yul. A compiler adds a step in the coding process and increases the risks of bugs, but in exchange for this inconvenience, zkSync offers other perks. Not only does its custom VM generate zk-proofs fast, but it also implements native account abstraction, which allows programmable authorizations, enabling a greater diversity of wallet and protocol design.\n\n\n\n\n\nZkSync is among the most developed projects, coming with a Hardhat plugin, Web3 API parity, and a well-functioning L2-L1 messaging infrastructure.\n\n\n\n\n\nThe most popular zk rollup, zkZync Era, processes 22 million monthly transactions (source: L2Beat), ranking second only to Polygon PoS with its 75 million monthly transactions.\n\n\n\n\n\nStarknet\n\nStarknet is a zk-rollup using a slightly different version of the cryptographic proof system. Unlike other popular protocols built on zk-SNARKs (zero-knowledge succinct non-interactive argument of knowledge), it uses zk-STARKS (zero-knowledge scalable transparent argument of knowledge). The main difference between the two is that the former uses elliptic curve pairings, while the latter relies on transparent post-quantum algebraic proofs, which generally makes zk-STARKs more efficient but also more computationally demanding. Zk-SNARKS are also being criticized for the trusted setup they require for the initial creation of keys. If the secret used to create the keys is not destroyed, this may introduce a security threat.\n\n\n\n\n\nZK-STARKs were discovered several years after ak-SNARKs, which were already used in the Zcash protocol. Hence, zk-SNARKs are considered more developed as a technology, with extensive developer libraries and numerous projects working on them. Starknet is a notable exception, adopting STARKs as a base for its protocol. The project also puts emphasis on Layer-3 development, providing a set of tools that can help build customizable “App Chains.”\n\nStarknet Alpha went live in November 2022 and has since developed an important ecosystem, handling 13 million monthly transactions.\n\n\n\n\n\nWith Warp, a compiler from Solidity to its language Cairo, Starknet can also be considered as a Type 4 zkEVM.\n\nPolygon zkEVM\n\nThe famous Ethereum sidechain joined the zk race by releasing in March its own version of zkEVM as a separate blockchain (so far in Beta). It will be a part of Polygon 2.0, an ambitious vision of a network of zk-powered layer-2 chains unified via a novel cross-chain protocol.\n\n\n\n\n\nZkProver, Polygon zkEVM’s main component, follows the state machine model, which uses both STARK and SNARK methods. STARK is used to prove the transactions, and then a SNARK circuit is used to verify it, de facto submitting to Ethereum a proof of a proof. To achieve full compatibility, the Polygon team has come up with the concept of micro opcodes, or instructions that EVM will use to manipulate inputs.\n\n\n\n\n\nCurrently, Polygon zkEVM is a Type 3 (almost EVM-equivalent), which will turn into Type 2 (fully EVM-equivalent) when all pre-compiled contracts are supported. It processes 1.1 million monthly transactions.\n\nLinea\n\nThis zk-proof solution was developed by none other than Consensys, the Godfather of all things Ethereum. Released in March 2023, Linea (Type 3 aiming for Type 2) strikes its own balance of speed and EVM compatibility.\n\n\n\n\n\nLinea uses lattice-based cryptography, known to be quantum-resistant, to efficiently generate zero-knowledge proofs, making for a faster prover time.\n\n\n\n\n\nLinea aims for a full equivalence with Ethereum. It is able to execute an unaltered, native bytecode in accordance with the EVM specifications, thus reducing the risk of bugs and hacks. Developers can deploy and verify any smart contract with Truffle, Hardhat, or Foundry exactly as if they were building on Layer 1. Linea’s developer-friendliness is enhanced by the native integrations of Consensys tools, such as MetaMask and Infura.\n\n\n\n\n\nWith Alpha mainnet launched in August, Linea now handles 3.5 million monthly transactions.\n\nScroll\n\nThe most recent protocol to go live, Scroll, launched its mainnet in October 2023.\n\nThe project aims at fully mapping the Ethereum opcode to the zkEVM, which would allow Ethereum native smart contracts to be fully executed without modifying the bytecode. Currently, Scroll is still a Type 3 but aims to become Type 2.\n\n\n\n\n\nLaunched with a centralized sequencer and a centralized central approver, Scroll intends to decentralize over time.\n\n\n\n\n\nSeveral other projects based on zk-proof are still in the works. This includes Taiko, a rare Type 1 (fully Ethereum-equivalent) rollup, as well as projects based on the Polygon’s codebase, such as Immutable zkEVM, Canto, and Astar zkEVM."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPVXRBaXZ1SFEwbWZqaHU5YXhTVWxZWXJ4blE5WGYza0F4TGh1YTVxS3NKUU9EdGRRUjd2c1RKb2pwVDJLZ2stSUtua28ydFhjTHUyLW5pMURYT0NHMktSS29ZZmFyeXB6Sl9CN3JPaVNPRkI4Q2hROFI5dVJ4ZzJQYkxOaUJ5WGQ4NThlb2lkTnVfYjcxUk00WWRCc3NmeWpLczB4RTRTSDMtOVRt0gGyAUFVX3lxTFA1NWJ1eVljVHBWZ1VyZGkxWUpKdjh5QnhXWnFjazVBQzd3aV9CeG02WDI1VGtpTF9TRlVjSTQ2MklTUXJfLTdhd2VrMFFtOXlrWFB5UXZESUlfVkhVM0lmaWktcndta1VSdzVrT1VYRGRodWxnemZCc0ZhYURHNUp1ZURXVzJmMkk0X2I4N2hyU2JvX2ZTQ3Y1OVBaLXpZVUFMcHo0bUJKNTZzcXYzSEVfdWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Ethereum feature abused to steal $60 million from 99K victims - BleepingComputer",
        "content": "Malicious actors have been abusing Ethereum's 'Create2' function to bypass wallet security alerts and poison cryptocurrency addresses, which led to stealing $60,000,000 worth of cryptocurrency from 99,000 people in six months.\n\nThis is reported by Web3 anti-scam specialists at 'Scam Sniffer,' who observed several cases of in-the-wild exploitation of the function, in some cases losses incurred by one individual reaching up to $1.6 million.\n\nLegitimate function\n\nCreate2 is an opcode in Ethereum, introduced in the 'Constantinople' upgrade, that allows creating smart contracts on the blockchain.\n\nUnlike the original Create opcode, which generated new addresses based on the creator's address and nonce, Create2 allows calculating addresses before the deployment of the contract.\n\nIt's a powerful tool for Ethereum developers, enabling advanced and flexible contract interactions, parameter-based contract address pre-calculation, deployment flexibility, suitability for off-chain transactions and certain dApps.\n\nCreate2 introduced significant benefits, but several security implications and new attack vectors also came along with them.\n\nCreate2 opcode abuse\n\nScam Sniffer's report explains that Create2 can be abused to generate fresh contract addresses with no history of malicious/reported transactions, hence bypassing wallet security alerts.\n\nWhen a victim signs a malicious transaction, the attacker deploys a contract at the pre-calculated address and transfers the victim's assets to it, a non-reversible process.\n\nIn a recent case analysts observed, a victim lost $927,000 worth of GMX after they were tricked into signing a transfer contract that sent the assets to a pre-computed address.\n\nThe smart contract used in the attack (Scam Sniffer)\n\nThe second type of Create2 abuse is generating addresses similar to legitimate ones owned by the recipient, thus tricking users into sending assets to the threat actors, thinking they're sending it to a known address.\n\nThe scheme, which is named 'address poisoning,' involves generating a large number of addresses and then picking those that match their specific phishing needs each time to trick their targets.\n\nSince August 2023, Scam Sniffer has recorded 11 victims losing nearly $3 million, with one of them transferring $1.6 million to an address resembling one they had sent money to recently.\n\nMost of these attacks went under the radar, silently siphoning millions, but some have caught the attention of the community.\n\nAt the beginning of the year, MetaMask warned about scammers using freshly-generated addresses that match those used by the victim in recent transactions.\n\nIn the scam, the threat actor may also send the victim a small amount in crypto to register the address in the wallet's history, thus increasing the chances of the victim making the payment.\n\nIn early August 2023, a Binance operator mistakenly sent $20 million to scammers who employed the 'address poisoning' trick but noticed the error quickly and froze the recipient's address.\n\nNotably, using lookalike cryptocurrency addresses is a trick seen in clipboard-hijacking malware tools, like the Laplas Clipper, highlighting the method's effectiveness.\n\nWhen performing cryptocurrency transactions, it is always recommended to check the recipient's address thoroughly, and not just the first and last three-four characters, before approving it."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9rQVBzZExCZGhLTkNnQ2FReFY1Wno5SndKeUJ0ZVhnVjRWeHN6ZThLZG5saWctVDJrMFh5S3hNdEdYOG5xM0Q0X1RjaUs1LVhwQ0NYSF9fUVpZSzZtSVh6S2xlNkRnMnFqdjBtTzE2QmktSWhjaEREb2RPMF9qUdIBhgFBVV95cUxOQWt5d2VKdnJKR3lRZXZOcDVFWXU3eVUxdVA1WTctdkpUTFJHOEFseHI1eVY1c2lJLXlCeGZyYnpfNllKdE9WUjBQV1Q5X2FsUU5qclozNFg0SzhuM0QxU2ZqclMtQkFIckpvNVpuVUJzT0NDWUNHTXpaX1J3VTM5SVBKc3BUZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Solana Rally Cools as Bitcoin and Ethereum Hold Steady and These Alts Surge - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter a stunning climb last week, Solana (SOL) has cooled its rally and is now down over the past 24 hours.\n\nSolana, the seventh biggest cryptocurrency by market cap, is down nearly 5% in the past day, trading hands for $55.39, CoinGecko data shows.\n\nLast week, the Ethereum-competitor had experienced a surge in price unlike any other coin or token over a month period. Its price notably soared past $50 for the first time since May 2022. The boom was likely down to a short squeeze caused by short sellers exiting their positions and renewed interest from institutions, experts said.\n\nBut despite the cool off today, Solana is up nearly 40% over the last seven days.\n\nAD\n\nAD\n\nBitcoin, the biggest cryptocurrency by market cap, is down 1% today Monday morning Eastern Time and is trading for $36,839. While the second-biggest digital asset Ethereum (ETH) is up nearly 2% and trading for $2,096.\n\nLast week Ethereum got a big boost past $2,000 for the first time in some months on the news that BlackRock had filed an application to list an iShares Ethereum Trust.\n\nMeanwhile, a number of Solana's altcoin rivals are experiencing gains today.\n\nLeading the charge out of the major coins and tokens is decentralized storage provider Filecoin's native token FIL, which is up nearly 10% in 24 hours and priced in at $5.33, according to CoinGecko. Over the past seven days, it has shot up in value by 23%.\n\nAD\n\nAD\n\nProtocol Labs, the company behind Filecoin, is this week hosting a its LabWeek23 event in Istanbul, which might explain the sudden surge.\n\nOf other major players in the crypto market, Polygon (MATIC) is also up significantly today: the 13th biggest digital asset by market cap has surged more than 6% in the past day and is now trading for $0.88.\n\nAnd Cosmos (ATOM), a project which aims to create an \"Internet of Blockchains\" by improving interoperability, has also shot up by more than 9%; it's right now priced at $9.90.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOdHJmQ0w1T3ZGUkRtYzdHQ21oTHpkQzhVS1dGVEtqNHQ2TXpPYzdIUFFqakIxdll4cWh3aDJPVUNmS2lxLWRCbWR6TnE2WjVWcFVsakFKS2x4ZTBUX2JVRGo0NzQ1cWk1aEllTnZaUC1hQThRSnl2Si1LYmJCUVJubHV5Mk5Ya3RLMDNV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Fund Inflows Hit 2022 High on ETF Listing Request - Crypto Briefing",
        "content": "Crypto funds surpassed $1 billion in inflows this year.\n\nShare this article\n\nFund inflows into Ethereum investment products hit their highest level since August 2022 last week, according to digital asset manager CoinShares. The spike comes as investors anticipate the potential approval of a physically-backed Ethereum exchange-traded fund (ETF) in the US.\n\n“Ethereum, saw its largest inflows since August 2022 of US$49m, with the last 2 weeks signifying a real turnaround in sentiment, likely related to the recent spot-based ETF listing request,” said James Butterfill, Head of Research at CoinShares.\n\nThe asset manager said the flows indicate a distinct turnaround in investor sentiment, likely fueled by BlackRock’s move to file for an Ethereum spot ETF last week.\n\nOverall, digital asset funds saw $293 million in inflows last week across crypto products, marking the seventh consecutive week of inflows. Bitcoin products attracted $240 million, bringing their year-to-date inflows to over $1 billion.\n\nExchange-traded product (ETP) trading volumes have also increased, making up nearly 20% of total Bitcoin volumes on trusted exchanges and suggesting more ETP investor participation compared to the 2020 and 2021 rallies.\n\nThe streak of inflows has pushed total assets under management in crypto investment products to $44.3 billion, a 99% increase since the start of 2023.\n\nBlockchain equity ETFs also saw their highest inflows since July 2022 at $14 million. Their year-to-date flows have now turned positive at $11 million after substantial outflows for most of 2022.\n\nETH is up 1.7% over the past 24 hours, according to CoinGecko."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQNnZYRXFlaWxSNW9PcldJNWlqSHRpOWxldmlLOHhndy1FSEFrZUJkdWN5TmIyd1dHUnFLWXR4UW52dDVUNVlaRjlhWW5JMVhRTUczRTlObERUdEFRUVc2dy1aX2tpb2pTNUlabkNmNXcwZUx6TEZ5ZE04UWdRNWVyaQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "What Is the Ethereum Cancun Upgrade? - Binance Academy",
        "content": "Key Takeaways\n\nThe Ethereum Cancun upgrade aims to enhance scalability, security, and efficiency within the Ethereum network, introducing the concept of proto-danksharding.\n\nDanksharding represents the final phase of the Ethereum 2.0 (Serenity) upgrade that enhances data management and transaction processing.\n\nThe Ethereum Cancun upgrade is designed to bring faster transaction processing times, reduced transaction costs, and optimized data management. Potential risks include impacts on existing smart contracts and the integration of new data storage techniques.\n\nThe Ethereum Cancun upgrade was initially planned to go live in October 2023 but was later delayed to the first half of 2024. It went live on the Ethereum mainnet on March 13, 2024.\n\nIntroduction\n\nEthereum's transition to Proof of Stake (PoS) and the introduction of sharding are vital components of its Ethereum 2.0 upgrade. PoS reduces energy consumption by replacing miners with validators, who are selected to create new blocks based on the amount of ETH they stake.\n\nMeanwhile, sharding increases transaction speed by partitioning the Ethereum network into smaller pieces (shards), with each capable of independently processing transactions and smart contracts. The shift from PoW to PoS enables secure and efficient sharding by randomly assigning validators to specific shards, preventing manipulation and enhancing performance.\n\nThe Ethereum Cancun upgrade represents an important advancement in the Ethereum blockchain, aimed at fortifying the network's scalability, security, and overall efficiency. This upgrade introduces the concept of proto-danksharding, an important step toward optimizing data management and enhancing transaction affordability within the Ethereum ecosystem.\n\nBy leveraging innovative data storage techniques, the Ethereum Cancun upgrade is poised to revolutionize the way the network processes transactions, paving the way for a more accessible and seamless user experience.\n\nUnderstanding the Ethereum Cancun Upgrade\n\nThe Ethereum Cancun upgrade (also known as the “Cancun-Deneb” upgrade) is a concerted effort by Ethereum to bolster its infrastructure and address unresolved issues after the Shanghai upgrade.\n\nThe Cancun upgrade is based on four Ethereum Improvement Proposals (EIPs): EIP-4844, EIP-1153, EIP-4788, and EIP-6780. Together, the implementation of these EIPs can provide many benefits, including improved scalability, enhanced data storage and availability, and reduced transaction costs.\n\nWith a primary focus on optimizing the execution layer (Layer 1), the Cancun upgrade prepares the network for the future implementation of full data sharding, a vital component in Ethereum's long-term development strategy.\n\nSharding refers to splitting a blockchain database into smaller portions, called shards, for higher efficiency, and the Cancun upgrade introduces a specific type of sharding known as proto-danksharding (discussed below).\n\nThe goal of the Cancun upgrade is to increase the network’s transactions per second (TPS), aligning with Ethereum's roadmap's \"Surge\" phase, aiming to scale performance to 100,000+ TPS.\n\nThe Cancun upgrade – along with the subsequent Deneb upgrade – represents a significant milestone in Ethereum's journey towards establishing itself as a leading decentralized finance platform.\n\nDanksharding and Proto-Danksharding\n\nDanksharding and proto-danksharding are different iterations of the sharding technology developed for Ethereum. Named after Ethereum researcher Dankrad Feist, danksharding is a type of sharding that serves as the final phase of the Ethereum 2.0 (Serenity) upgrade. It concentrates on optimizing data availability for rollups within the Ethereum network.\n\nTechnically speaking, danksharding is a design that introduces the concept of a merged market fee. While traditional sharding has different blocks and block proposers for each shard, there is only one block proposer in danksharding. In simple terms, danksharding can enhance transaction processing and streamline data storage by simplifying the sharding architecture and prioritizing data management.\n\nIn the context of the upgrade, proto-danksharding (introduced by EIP-4844) serves as a prototype of danksharding. It’s a temporary solution that can significantly reduce gas fees associated with rollups before the complete implementation of the danksharding framework.\n\nBlob-carrying transactions\n\nBlob-carrying transactions were introduced along with proto-danksharding (EIP-4844) to help reduce gas fees. Blob-carrying transactions allow the temporary storage and retrieval of off-chain data, meaning extra data can be added to Ethereum transactions in a more cost-effective way.\n\nBenefits of the Ethereum Cancun Upgrade\n\nAs we’ve discussed, the Ethereum Cancun upgrade can provide a range of benefits, including faster transaction processing, reduced transaction costs, optimized data management, and improved cross-chain communication. By introducing the concept of blob-carrying transactions, the upgrade aims to streamline data processing and enhance overall network efficiency.\n\n1. Better scalability: Proto-danksharding introduces temporary data storage capacity, allowing Layer 2 rollups (and the network as a whole) to process more transactions per second.\n\n2. Reduced transaction costs: Blob-carrying transactions allow extra data to be added to Ethereum transactions in a more cost-effective way.\n\n3. Optimized data management: EIP-1153 can optimize block space and reduce on-chain data storage costs.\n\n4. Better cross-chain communication: EIP-4788 aims to improve interoperability between different blockchain networks by exposing the Beacon chain to execution layers.\n\n5. Improved security: EIP-6780 can reduce the risk of smart contract termination by disempowering the SELFDESTRUCT code, enhancing the security of user data and funds.\n\nPotential Risks of the Ethereum Cancun Upgrade\n\nThere might be risks related to the potential impact of the upgrade on existing smart contracts and the intricacies of integrating new data storage techniques. These require extensive testing and careful consideration during the implementation phase to ensure a smooth transition for all stakeholders involved.\n\nThe Ethereum Cancun-Deneb upgrade was initially planned to go live in October 2023 but was later delayed to the first half of 2024. It went live on the Ethereum mainnet on March 13, 2024 (at epoch 269,568). Node operators and stakers must upgrade their software to releases listed in the official announcement.\n\nClosing Thoughts\n\nThe Ethereum Cancun-Deneb (Dencun) upgrade marks a significant leap forward in Ethereum's quest for improved scalability, efficiency, and user experience. By introducing proto-danksharding and laying the groundwork for future advancements, the Ethereum Cancun Upgrade will likely enhance the realm of decentralized finance and blockchain technology.\n\nFurther Reading\n\n\n\nDisclaimer: This content is presented to you on an “as is” basis for general information and educational purposes only, without representation or warranty of any kind. It should not be construed as financial, legal or other professional advice, nor is it intended to recommend the purchase of any specific product or service. You should seek your own advice from appropriate professional advisors. Where the article is contributed by a third party contributor, please note that those views expressed belong to the third party contributor, and do not necessarily reflect those of Binance Academy. Please read our full disclaimer here for further details. Digital asset prices can be volatile. The value of your investment may go down or up and you may not get back the amount invested. You are solely responsible for your investment decisions and Binance Academy is not liable for any losses you may incur. This material should not be construed as financial, legal or other professional advice. For more information, see our Terms of Use and Risk Warning."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNM1JoYXdNYTl4R1ZaV3IxdFFkV0huS050eWZwVUVlTmxIa0x4RVVSaV9xS05DTkk3bmg3WVNBZENZbTg5VHl2cUZJX2JmRjh3YmplRlg1a1FWejcyN2R0RldhNXlQYjlxekRuZFNyNU5CRENJSUo0OTlmNVhrbHhVZmlFNlNEeFF2YnRyb2U5UERWM0JfTnRXN2ZLM2tTVzdERXNtZVhITnlhZ1FqbjFJTlBEOUJBVHoxQWJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Solana Hits New Annual High At $58 — Analyst Predicts 'Ethereum Killer' Could Skyrocket To $1,000 - Nasdaq",
        "content": "Solana (CRYPTO: SOL), once called an ‘Ethereum (CRYPTO: ETH) killer' has experienced a remarkable surge in price, surging by 40% in the past week and reaching a new high for the year 2023 at approximately $58.\n\nWhat Happened: Crypto analyst Jacob Canfield has conducted a comprehensive analysis suggesting that Solana could be on the verge of an unprecedented market surge. Canfield suggests that Solana could potentially increase its market dominance to the range of 12-15%.\n\nCanfield’s analysis is based on several indicators. He highlights the Solana Dominance (SOL.D) chart, noting that even at its peak market cap, it didn’t surpass 3%. With the current trends and the breakout of SOLBTC from its weekly resistance, Canfield envisions a scenario where Solana could enter a parabolic rally phase.\n\nIn my opinion, I think that @Solana is going to continue to be one of the biggest movers during this current bull market cycle and I'm going to lay out some ideas for you.It's possible that with the Ethereum ETF news that some of these ideas don't play out, but it's worth… pic.twitter.com/oii8vWs0W9\n\n— Jacob Canfield (@JacobCanfield) November 9, 2023\n\nCanfield suggests that if Solana continues to trend against Bitcoin (CRYPTO: BTC), it could easily reach a price of $1,000 per coin and claim the second spot behind Bitcoin. \"Solana could triple or quadruple it's all time high market dominance around 12-15% and if it continues to trend against Bitcoin, could easily see a $1,000 per coin and take the #2 spot behind Bitcoin,\" the analyst said.\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nWhy It Matters: Solana’s gains have been fueled by various factors, including the broader uptrend in the cryptocurrency market and the excitement surrounding Bitcoin ETFs, as well as an increasing appetite for risk among investors.\n\nInterestingly, Solana’s upward trajectory coincides with the daily selling of 250,000 to 750,000 SOL tokens by the FTX bankruptcy estate over the past two weeks. These sales follow the approval by the Delaware Bankruptcy Court in September 2023 to sell 55.75 million SOL tokens.\n\nImage Via Shutterstock\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOZVB3QzNPZXBjVGhZZ1c3eWRpYjdEVUJfcUlZVk4wdk1qUEhzbzRqTlo5V0kyazg0dU5FRWxpM3ZDNk5YYTVCYzV5Y3duLUpaeHhSNS1TZjA4Yl9XYXg1Ulo2elB5cE00R184Uld5Z3VOUjVsUWVpYTA3NnF3N0txVUFlOEVxVnRhcG1WSEszdEo1QV82OFV0RHVRNkczVDhvY2J3bnpFbnlCbFZlWkJxRER0NEpwOVVtNnFRdC1xQlQtZ1NBLS1aeXRCajd4ZkVZYUZrYdIB2gFBVV95cUxOTTBMZnNicjdWd080Tzl5MGhLZjJhMzJySWRfVlRIZXRrX0JpSy1odzhCLXZRaE9hX1M5NExTZ3dZUm1kNWVtTzVEQzJpakJvYnFNY0twalJEbjR4U2JyTVBTMXo5WlNudU5DbHZsNC0teHl3eHNvNWR3WENKZE1DMVQ1ZGN4YlJ2bU5fVzVwX2owTDBMVlBwLVhGNjFpT2o4V2dIbGlhQjBILUVPc3ZMMExRZ2o2ZW9xc0RkLUtfRTBIU1ZFMHdTOFdaSG5CUVY2UU1Ud3o2bUpDdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Former Goldman Sachs Executive Says Ethereum Is About To Outperform Bitcoin As Crypto Enters Late Spring - The Daily Hodl",
        "content": "Macro guru Raoul Pal says that the top smart contract platform Ethereum (ETH) is set to outperform Bitcoin (BTC) as the crypto markets enter into a new “spring” phase.\n\nThe former Goldman Sachs executive tells his one million followers on the social media platform X that based on the Tom Demark Sequential indicator, ETH is setting up to outrun BTC.\n\nThe Demark Sequential aims to identify points of trend exhaustion or price reversal.\n\n“That is the weekly DeMark 9 count for the ETH/BTC cross. ETH most likely outperforms from here as per usual at this stage in late Crypto Spring.”\n\nPal goes on to say that Ethereum-based exchange-traded funds (ETFs) will be the “holy grail” for asset managers, at least until some form of competition emerges.\n\n“An ETH ETF is the holy grail for asset managers as they can capture the yield and only give price performance to the ETF holders. It is a super profitable business until it gets competed away eventually.”\n\nHowever, one prominent crypto analyst has a stance that contradicts Pal’s assessment of Ethereum outperforming Bitcoin.\n\nRecently, crypto strategist Benjamin Cowen issued an alert, saying that Bitcoin Dominance (BTC.D) – which tracks the percentage of the total market cap that belongs to Bitcoin – will continue to be bullish, meaning that altcoins, including ETH, will lag behind BTC.\n\n“My crypto portfolio for the last couple of years has been predominantly just Bitcoin because I suspect that it will outperform most of the rest of the market – not all of the market, but most of the rest of the market – and that’s why the dominance has gone higher.”\n\nEthereum is trading for $2,080 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxONFpHVThiUm9jdTlVVkRJc09ZbmY4NkJYajR5ZFJDX3Z6Y2NKQzlaZUJvOW4xUFN6ZHl3eGVUOWRvb0NLZW9IRnFlZWg3b3J5U0Vsa3dzR1JIZVIyTzBtZk5EZjByLXJic0t1UmhQNXJsZVBQTXRyUlN6dTdKNHROX2dZYnZmYnZZODlYaV9nMHIyZXJDVEJfN2x30gGfAUFVX3lxTE9oQkdoY3FPMElCVERwQm9SN2ZHN1VkS3JLNFBkb3BxT0ZvYU9odHpQTnRqVGx4eUZ3bzd6ZkltajlnVVA5UnRZV0E0Y0JKelE3ei05dnpPU0Z4X2pPN3JZTkZvSTByM0FkMUNxczgzMjNfNU9NUDBjNENYa1ZkSmVXbEhPcGRIOXRmQkZYdmpKUllfTGdSMFVMYUlLTDEtSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Wallet Drainer Steals $60M in Six Months - CoinDesk",
        "content": "The wallet drainers are misusing Create2, a piece of code that is used by the likes of Uniswap to predict the address of a contract before it is deployed on the Ethereum network."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5FR2V1YzBlempMQThNS0JiY28xYTZ1SUtyb0lCTmNlaWwwMVlNWnNXdkhBaEEtUnB4VnJqU0JxUk9sU2lmYjFDQWtwVmsyMkFIakF4dGYzdEUzdDFrN0VVRHV6RnA2clMzbXlTVzBYdUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "BlackRock's Ethereum Spot ETF: What Does It Mean for Investors? - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQemFVNmJ5YWpFQWR4dUJIMlR1QjBuZTFRT29TSm0wek9HZFNaaGcwZDQydXYteGYtaWRKR0M2Q3dzU1BhaGplWDNjTlk3OW5aRUE5aU02ZXoxY1BGamNROFI2RHdmTGIyejZSM1ZDVW5VRXpmWG5JdU1Wa2NiVnllZnNVUm50TE1HalHSAY8BQVVfeXFMT3VieW9qektoQUVJd2RTcEZWUDZYSm1XeDRpLWJjRk14eEVIWUVuUGRIX2xVRHlMNXp6OW9MbHBPS01vclNiLWE5cWVxbXN5M0JSbTh6VktESnBicW9CRHgtaW9TOWxxM0VTQXppWlFpWWZXa2hIUnZKeUUwWDNtcE14YUctWlNVbWl2Qm42NHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Institutional and Whale Demand for Bitcoin and Ethereum Skyrockets - U.Today",
        "content": "Advertisement\n\nBitcoin, Ethereum and Polygon are experiencing a remarkable surge in large-scale transactions, also known as \"whale transactions.\"\n\nNotably, Bitcoin has seen an 80% increase in transactions valued over $100,000.\n\nSimilarly, Ethereum's large transactions have soared by 170%, while Polygon has witnessed an unprecedented rise of over 3,800% compared to their respective volumes just 30 days ago.\n\nLarge transactions\n\nData from the past week highlights the scale of this uptick in high-value transactions. Bitcoin recorded 16,410 transactions in the last 24 hours, peaking at 22,570 transactions on Nov. 9. The lowest was 12,810 transactions on Nov. 5.\n\nAdvertisement\n\nIn terms of transaction volume, Bitcoin saw $24.4 billion in the last 24 hours, with a high of $39.02 billion and a low of $18.1 billion within the same week. Ethereum's large transaction count stood at 3,560 in the last 24 hours, reaching a seven-day high of 7,590 transactions and a low of 3,040.\n\nIts transaction volume echoed this trend, with $2.91 billion in the last 24 hours, peaking at $6.59 billion and a low of $2.47 billion.\n\nFor Polygon, the number of large transactions reached a seven-day high of 209 transactions, the same as its count in the last 24 hours, with a low of 34 transactions. The transaction volume mirrored this surge, with the last 24 hours seeing $194.42 million, a seven-day high of $357.59 million and a low of $28.81 million.\n\nRenewed institutional demand\n\nThe significant increase in whale transactions across these cryptocurrencies is largely attributed to renewed institutional interest. The crypto market is abuzz with anticipation for the launch of spot Bitcoin ETFs by January 2024, a development that is expected to further fuel institutional demand.\n\nAdditionally, BlackRock's plans to introduce a spot Ethereum ETF have added to this excitement. Institutional demand plays a crucial role in the crypto market, as it not only brings substantial capital but also lends credibility and stability to the digital currency ecosystem.\n\nThe entry of large financial players and the creation of more accessible investment vehicles like ETFs are seen as key drivers for long-term growth and mainstream acceptance of cryptocurrencies."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOaE4wZ1N5ck1uaS1QOTRMQzZEVDRvS1Z4Tkw4VjVvQ2tKSVR5UU16MXdqcEZGLWJtMkxtVHVpbGNWejNvaEltR1NBQXc1aTNTVlZTVks0WHBjRXUxN3l6cjd5bXFFdUxhUjVPTVZtQXJDVElJLUZxdVI2RGh5YXl4YkN2UVNwbkJtalIxTHEtSEdObTVDYWV6TEhYT29DZTjSAacBQVVfeXFMTjBtekZNazVEVkFzdjFra3hHVVRrQ1BNa3dmMnlpX09FSzJDNVRhaC1SbS0wUjBIR0NzNUNKTGo2V0Q5OGJPRGlPemZGNVlIdTBYYl94SnM1b3RBTHk3TUNMT0gxZEFwUm1jbmhxaEtyYXMzMXhYOW9vTE9mdUFJdE9ZNzhMQUg3NmNmZ2lqZnNiVUEtSEc5Y2NaUFBRREcxQzVocDRpVzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Former Polygon Labs President Ryan Wyatt Joins Ethereum Layer-2 Optimism - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFour months after departing Polygon Labs, Ryan Wyatt is joining the team supporting a totally different Ethereum scaling network: Optimism.\n\nOn Monday, the former Polygon Labs president was announced as the Chief Growth Officer for Optimism Unlimited, a newly created subsidiary of the Optimism Foundation. Wyatt will build a team to support adoption and development on Optimism across a variety of functions, including business development, marketing, partnerships, and beyond.\n\nAhead of the announcement, Wyatt described Optimism to Decrypt as having the “best team in all of crypto.”\n\n“They've really shown what they can do in the last 12 months, particularly, from both the tech perspective as well as people buying into Optimism and the ethos,” he continued. “I just think there's an opportunity to really ramp up the non-technical efforts of the Optimism Collective. That's what I'm good at and that's what I like doing.”\n\nAD\n\nAD\n\nWyatt was with Polygon Labs from February 2022 until this past July, when the company announced that he was stepping down. Marc Boiron, previously Polygon Labs’ Chief Legal Officer, stepped into a new CEO role to lead the firm as Wyatt departed. Wyatt said at the time that he planned to stay in the crypto industry.\n\nAsked why he wanted to leave Polygon Labs and take on a new challenge elsewhere in the space, Wyatt told Decrypt that his move was “less about leaving Polygon” and more about taking on a new challenge to grow a decentralized network that’s still relatively young.\n\n“There's really a special moment in time where you get to build out a team, build out a community, stand it up, and then turn the keys over to the world. And that is a moment in time that's happening now,” he said. “I want, on a personal level, to be really impactful during that time, and I think there's a huge opportunity to do it at Optimism.”\n\nJing Wang, co-founder of Optimism, told Decrypt that current adoption on the network has been supported by a two-person business development team. She believes that Wyatt’s addition, and his plans to ramp up those efforts, will make a considerable impact.\n\nAD\n\nAD\n\n“I think Ryan can 100x adoption for us,” said Wang. “That's what I'm most excited about.”\n\nAt Polygon Labs, Wyatt was credited with helping to court a number of prominent brands to build on the Ethereum scaling network, including Starbucks, Nike, and Reddit. Decrypt named Polygon its 2022 project of the year based in part on the significant mainstream brand adoption that took place during that span.\n\nAsked if he will approach business development and brand adoption for Optimism like he did with Polygon, Wyatt said that some of the same tactics will come into play. However, he said that given Optimism’s focus on decentralization, he plans to help encourage growth across communities rather than assemble a large, central team to try and drive adoption.\n\n“Optimism is so focused and so far ahead on the decentralization front,” he said. “And so there's a unique opportunity to leverage and rally around the community to be able to amplify our efforts.”\n\nOptimism’s OP Stack tech is already driving other networks, most notably Base, the Ethereum layer-2 network incubated by Coinbase and launched earlier this year. Base, which houses the buzzy social app Friend.tech and other applications, shows the kind of path forward that Wyatt hopes to see more broadly, with the OP Stack standing up various scaling networks.\n\n“You have Ethereum here; we want the bedrock of all the blockchains to be built on Optimism,” said Wyatt. “And that's where I think it's going, and that's where it's certainly going fast\n\nWyatt comes from a gaming and esports background, and led YouTube Gaming for several years before joining Polygon Labs. Before that, he was an esports commentator and industry executive. Wyatt said that gaming will be a significant focus for him at Optimism as he tries to drive forward adoption around digital item ownership.\n\n“I truly believe that digital ownership in a certain subset of games is going to be really important,” said Wyatt, affirming previous comments during his time at Polygon Labs. “Gaming will be very important for Optimism, and we're going to do a bunch of cool shit in gaming.”\n\nAD\n\nAD\n\n“That’s why it’s called the OP Stack,” added Wang, citing the gaming term “OP” or “overpowered.”"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPQVlsUUJwZ0RqQkZUSE14QWZyNWlQWG5rRm91a0I4WHRIeGtTMUppTHRZbnFOV29KQUN4UUNkR21ETEdtX29SWWdVNVhtd29pb2FiM2ROWVAtdW8zZGFUZWlWdnNGNDBwaHBqS0ZrNFRsMzdDS190NWZGVjNoWnh4bGVHbmc1cHFMcHRiSXlDekJ4T1NlYTR1TDVpRjk5NmZSOU41ZTZiNHI1OGdZdzhjN1pReHRYRTFUTEszdjB6M0hzSzAwRmpxa2ZyMW15TzZIdGRldWdqU1_SAd4BQVVfeXFMUGZzQ1VTWTh3NUV0Vnd4bGFJZmF2UjJmczJ3N1ZraUs1cFN5bkt0VDJIQTJtU3haT0h5YXQ5MjlWUGt0WjItelV6WExkVmtuUWpBc0d0V0tBdWJTX0NuYTZaVTZ6VzRLZnBvd2t3aFBEVThHYnRHMVZpaTNpb1AwRlZTXzh6SVNXNUp2cG9aNnVHcEZrZEw1Tm1DN3dHMEhWc2FCQzBvbDZ4YTlubGowV0RLY3lOcW5NUTQ4NWpYdW1ENm9Kbk5zUXQyRlgzUmZSOHRodXFLelk4eFNHQVpB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Top Trader Predicts Rallies for Ethereum and One Artificial-Intelligence Coin, Says Altcoins Have Ways To Go - The Daily Hodl",
        "content": "A trader who nailed the top of the 2021 Bitcoin (BTC) bull market believes rallies are in sight for Ethereum (ETH) and one additional altcoin.\n\nPseudonymous analyst Pentoshi tells his 711,700 followers on the social media platform X that Ethereum looks poised to take out a resistance level that has held for over a year.\n\n“A few thoughts on ETH here.\n\nIt didn’t come this high to not take out the yearly highs at the very least.\n\nMight let some shorts build up first in that area tho to build liquidations\n\nIf BTC ETF (exchange-traded fund) is approved, good chance ETH rallies harder seeing as it’s next.”\n\nLooking at the trader’s chart, Ethereum’s long-term resistance level appears to be at $2,144. At time of writing, Ethereum is worth $2,038.\n\nAnother altcoin on the trader’s radar is the artificial intelligence (AI)-focused Fetch.ai (FET). According to Pentoshi, FET will likely skyrocket once it takes out resistance at $0.49.\n\n“If it reclaims $0.49, this going to $0.69 in my opinion.”\n\nAt time of writing, FET is worth $0.413.\n\nPentoshi is also keeping a close watch on TOTAL 3, which tracks the total market cap of crypto excluding Bitcoin and Ethereum. According to the trader, TOTAL 3 looks bullish and still has more room to move to the upside before hitting a resistance level, suggesting that altcoins could see more rallies in the coming weeks.\n\n“Still a ways to go next few weeks overall. Sharp pullbacks are gifts.”\n\nAt time of writing, TOTAL 3 is trading at $406.356 billion.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nFeatured Image: Shutterstock/monkographic"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQdWdFa1Z6NEZQN1RXY1hFZ1Z5cWJaVUo1TFhmVkd6VmF0dUpqLUxnS1ZaT3ZkZUVfa0dBN2hxTEo5VEtfa21oZmdNcUZqMnpYTmJfM2ZpRThMYlQ1QWVVc2ZzalZzRDhwSVFrWUYycVg0VzVSSFhCbFpVM3lhSXI2bU5iTFVNdUtBaWlPa3VuNkVRYnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Tokenum Unveils Innovative Gasless Platform for the Ethereum Blockchain - A Game-Changer for the World of Cryptocurrency - Yahoo Finance",
        "content": "Tokenum\n\nTOKYO, JAPAN, Nov. 13, 2023 (GLOBE NEWSWIRE) --\n\nTokenum, a pioneering cryptocurrency platform, is proud to introduce its groundbreaking \"gasless technology.\" This revolutionary innovation simplifies cryptocurrency transactions and token offerings on the Ethereum blockchain, ushering in a new era of user-friendly accessibility.\n\nThe platform has already embarked on alpha testing, with an accelerated beta version scheduled for release within a week.\n\nRevolutionary Technology\n\nTokenum's gasless technology marks a significant advancement in the cryptocurrency landscape for several compelling reasons.\n\n1) Innovative Gas-free Transactions\n\nIn traditional banking, transaction fees are paid using the same currency that is being transacted. However, in the world of cryptocurrency, fees are often paid in another, blockchain-specific digital currencies. Such fees are referred to as \"gas.\" Tokenum's gasless technology eliminates the need for users to grapple with this complex concept, making cryptocurrency more accessible to a broader audience.\n\n2) Supercharged Token Sales\n\nNew cryptocurrency projects face various challenges, including scheduling, legal compliance, compatible wallets, and sale regulations. Additionally, for users to participate in project sales, users must first acquire specific coins to cover blockchain gas fees. Tokenum's gasless technology simplifies this process, making it easier for crypto projects to attract users and maximize revenue from each sale.\n\n3) NFT Industry Transformation\n\nTokenum's gasless technology presents an opportunity to reshape the NFT industry. NFT creators and owners can now prepay for NFT transfers, removing the burden of gas payments for users. This opens the door to entirely new audiences and streamlines the process, making it as effortless as managing digital art on Instagram or Pinterest.\n\n4) Removal of Entry Barriers for New Ecosystems\n\nTokenum also benefits new blockchains by allowing users to leverage the tokens they already have, eliminating the need to acquire blockchain-specialized coins for different networks and ecosystems. This significantly simplifies the sophisticated process of navigating and using new blockchains, platforms, or even metaverses.\n\nAll Gas No Brakes and Light-Years Ahead\n\nOne of the most notable aspects of Tokenum is its current full-fledged operational status. While other industry players, such as Circle Inc., Auros, 0xGasless, Open Zeppelin, and more, are still in the developmental stages, Tokenum is live and fully functional on the Ethereum network. The platform's future plans include expanding its support to encompass additional networks.\n\nStory continues\n\nThe AI-Powered CEO Behind Tokenum\n\nTokenum's powerful technology is spearheaded by a distinctive team, represented by Takeshi Tokenai, an AI-powered CEO. Notably, Takeshi was formally appointed as the leader on July 1, 2021, making him the world's first AI CEO. Conversely, Tokenum's technological prowess is underpinned by the collective expertise of its international team, boasting two decades of experience in the realms of cybersecurity, high technology, and blockchain. When asked to share their comments on the matter, Takeshi Tokenai's only statement was: \"Tokenum is here to take the crypto world by storm.\"\n\nWhat Lies Ahead\n\nIn summary, Tokenum's gasless technology is reshaping the cryptocurrency landscape by simplifying transactions, facilitating token sales, and supporting the growth of new blockchains. Now the project is already integrated with CyberWallet, the one of the most secure wallets at the market, and HyperID, the single identity solution. Together, they creates seamless entrance to any web3 project, space or activity for any user, regardless of their crypto skills. Tokenum is poised to become a major player in the future of cryptocurrency.\n\nCurrently, the company is offering giveaways and opportunities on its X channel (formerly Twitter), as well as on Zealy and QuestN, prominent crypto-community platforms. In the cryptocurrency world, such initiatives often signal preparations for rapid expansion and the potential launch of their own token.\n\nFor further updates and insights, please visit Tokenum's official website: https://tokenum.net\n\n\n\nJoin the conversation on Tokenum's X channel (formerly Twitter) by following @tokenum\n\n\n\n\n\n\n\nFor more information, press inquiries, or collaboration opportunities, please contact:\n\nTakeshi Tokenai at info (at) tokenum.net\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, or intended as investment advice, financial advice, or trading advice. It is strongly recommended that you practice due diligence (including consultation with a professional financial advisor) before investing in or trading securities and cryptocurrency.\n\nCONTACT: Takeshi Tokenai info at tokenum.net\n\n\n\n"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNQlJVM2JMQXZZM3pFQTZGUUZVd19uTjZhRWt3SlE4MmFLUG9zLWZub1BvVUJpczN0bXNPemFXeDV3elhQX1RYLUJXNE5pZ0lOR3ZxQ01vdHpqQm5ReDh5eW9DWWlLWjQ0dmJ3VnFycVpfcWJMZjZCbHlzVFotOEhVV1c4UnEtckN5T2NqTTBKYXZfT3NE0gGcAUFVX3lxTE8zbVVVX0w5MHFSdVczZVA4aWlDOXBZRmg2bTFuVjlNeU9uclF5RUdFS2w2dUtCU0dLdzYxekN0UDVQbm90TE5Dem1tX2wzOXpqREVGc0RuS2YxNGJNbGJpaWM2Qm5XX2hCS2ZuR1BUSHdtQTd1dTNIR1RTaUR0cVZjSExlYmFzVmgzQTJ1bUJyN0lfQXlOOWJpMUlybw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Why WNBA Star Jewell Loyd Relies on Crypto—And Why Bitcoin and Ethereum Are Her 'Anchors' - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nNobody in the WNBA can put the ball in the basket quite like Jewell Loyd, whose 939 points scored for the Seattle Storm this past year set the league’s single-season scoring record. That surpassed Diana Taurasi’s previous record of 860 points scored in 2006.\n\nOff the court, Loyd has become the face of crypto-savvy athlete investors for Coinbase, which has been the exclusive cryptocurrency partner of the NBA and WNBA since 2021.\n\nThe 30-year-old Chicagoland native bought her first Bitcoin in 2013 while playing collegiately at Notre Dame. Loyd and her brother, former pro basketball player Jarryd Loyd, entered the crypto market together after growing up with parents who stressed the importance of financial literacy.\n\n“I was one of the first people to come out and publicly say I’m investing in crypto and taking some of my salary in that,” Loyd told Decrypt. “Right after that, any team we played always had one person who came up to me like ‘Yo, why'd you do this? What is this?’\"\n\nAD\n\nAD\n\nImage: Klutch Sports Group\n\n“That was my time to educate,” she continued, “which was cool because I wasn’t the kid in school that everyone asked how they figured a question out. I was the one always asking questions. So to have that reversed was kinda cool.”\n\nCoinbase creates crypto educational content in partnership with the WNBA, and introduced an in-person crypto crash course to rookies at the 2022 WNBA Draft. Loyd converts a portion of her WNBA salary into cryptocurrency through the Coinbase app, with Bitcoin and Ethereum comprising her majority holdings.\n\n“To me, those are like the anchors,” she said of Bitcoin and Ethereum, the leading cryptocurrencies. “A basketball analogy is that you always need a good center. And those two are good centers for me.\"\n\nAfter making her fifth All-Star team this past season, Loyd signed a two-year, $463,000 contract extension with the Storm to remain where she’s won two WNBA titles (2018, 2020) since Seattle drafted her with the first-overall pick in 2015.\n\nAD\n\nAD\n\nWith salaries not nearly as lucrative as their male NBA counterparts, many WNBA players play overseas during offseasons for added income. Crypto’s decentralized nature has been useful to Loyd as she’s played for professional teams based in Turkey, China, South Korea, and Spain.\n\n“[Coinbase] has been one of my personal favorite partnerships with the WNBA, because obviously I’m invested in it—but it also lets women get ahead in the financial world,” Loyd said. “I’m very lucky to play overseas and live overseas, but sending money and using money overseas is very hard. Having a [faster] and more inexpensive way to transfer money overseas and back and forth makes sense.”\n\nCoinbase gave out $120,000 in Bitcoin to players on the New York Liberty and Las Vegas Aces as part of its sponsorship of the WNBA Commissioner's Cup midseason tournament in August. The league has also offered NFTs to fans though Coinbase, such as a digital collectible to commemorate Loyd’s Storm teammate Sue Bird for those who attended Bird’s jersey retirement ceremony at Seattle’s Climate Pledge Arena in June.\n\nLoyd said that Crypto’s biggest assist has come during her continued efforts to aid Rwanda, where Loyd and her brother send computers and money to support locals.\n\n“We’re always trying to figure out ways to send money to help our cause, and without using crypto, it would have been so much harder,” she told Decrypt. “When they need it right away, it gets there. It’s more efficient and we see more change that way with the community we’re working with.”\n\n“Working in Rwanda, they’re so talented. They just don’t always have the resources,” Loyd added. “I’m very passionate about giving to the next generation of kids and athletes. Anyone who wants to learn, I’m willing to help them.”\n\nEdited by Andrew Hayward\n\nAD\n\nAD"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxPRkhOWDFWdzc1bDVyWTZ5UDNsNV93ekRDU003VzAxNlJWNkhFbEtpdzBSX2xBZEx0a0Uzc0JIZjJ5V0RVSFlWZ19aOHpVamlpZDE3MWtFbEhwaVZuSGZuSnlpU0duT21EUG9TVTR6enJnWWZXeGhUSWNKWW5fVHlSVTE5TkVWRmVfOVh6ZzVNOTgxRE16THlCY1NCU2NoYVRlT0Nhd1FMdEFNX1BwYWlWNnE0MlNwa3NpYk5wVDNkcTBsTTk0QWRtX1ZlTWp1b1BCU1otc1RPdHdEY1pTWDhVMUVNNTHSAeoBQVVfeXFMUDVrOEhDQUNpYzF4eVNOdHVoWXZKVlpMYlJfTlI5TS1KMExVM2gyTHN0dmJ1N3I2V0ZnaHZ6WXlXaVp1Rm14aGNLQ0FVaXlwNXI1SDcyTlZ2VDFhQl9VMTV3RXNOVnU5SmhjalBlSEl1c2ZVUS00UUlsV00zU1BVZjgzMWdvMkQ5eEdNS3BBa3lldU1fVWR2bkhBTkJWcF9yMW1yeU9adjVjNnNoNkRSdTlsYm95dU9pTjdPZDR0YzhNWWtlVnlvSEdQV1IzZFV6WG1BbC1QWjgtLXdHUjc0eU1HbEYyX21wVkNR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "SOL becomes institutional investors' choice over Ethereum as Solana price sustains above $50 - FXStreet",
        "content": "Solana price has been one of the biggest attention grabber over the past couple of days owing to its unexpected 25% rally in a single day right before the weekend. While a specific reason cannot be deduced for the rise, the potential lies in the fact that SOL is now becoming one of the most preferred institutional assets.\n\nSolana sees institutional interest\n\nSolana is already one of the biggest cryptocurrencies in terms of gains, and the institutions seem to be observing this keenly, too. Consequently, cryptocurrency has become the most in-demand asset when it comes to institutional investors, surpassing even Ethereum.\n\nThe CoinShares weekly institutional investors’ report highlights that for the week ending November 10, SOL observed inflows worth $12.4 million, which added to the monthly inflows of $23.1 million, bringing the year-to-date inflows to $121 million.\n\nEthereum and others, on the other hand, are far below SOL when it comes to year-to-date flows, although Ethereum is making slight progress this past month, as noted by the $62 million inflows since November began.\n\nSolana institutional investment\n\nThis will prove to be highly helpful for SOL in noting a boost in its value but also push the price and value of the Grayscale Solana Trust, also known as GSOL. The Grayscale investment product, following the rally in Solana price, has exploded, with the investment vehicle trading at a premium of 378% since the beginning of October.\n\nGSOL 3-day chart\n\nWhile investment product value is not considered to be an accurate measure of demand, it does highlight the rate of improvement.\n\nSolana price reverses after rally\n\nSolana price trading at $52.41 has noted a near 7% decline on the 3-day chart, with SOL noting an 18.02% decline from the intra-day trading highs of the token. The most likely outcome right now for the altcoin is slow declines followed by a reversal in the cryptocurrency’s price.\n\nSOL could see a gradual decline over the next couple of days, bringing the altcoin to test the support line at $46.42. While the drawdown may not be significant, losing this support would prove to be harmful as it would extend the 24-hour losses towards the $40 level.\n\nAlthough no clear signals of a price reversal are visible, the consistent rally has overheated the market, which would need some cooldown. This might result in further decline.\n\nSOL/USD 3-day chart\n\nHowever, if Solana price bounces off the $46.42 support line and climbs back to breach the $59.03 resistance level, it would invalidate the bearish thesis and send SOL towards tagging the new highs beyond $60.\n\n\n\n"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOdGsyZXhXQTlBWlVaZEVnMVppU3g5SUpUbXNJdXNoemNsRmJVYVZUREZzV1VlaU1tQ0NQd2NjcFlYUktqczBEZkNONUUwcGxEcWZYY3VOVmQtTXl1R3NKY09aZUVacldmVGxUME0zZFU3RXhzV1FfQUNSZjl6QnpneEY2TWMybEdtNGpaWHg1VjZlcDA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Cryptos surge as BlackRock Ethereum ETF plan is confirmed - Nasdaq",
        "content": "Bitcoin (BTC) has again been making headlines and capturing the attention of crypto enthusiasts and traders. The popular digital currency has recently surged to levels not seen in almost eighteen months.\n\nSince taking out the $32,000 level of resistance near the end of October, the price of one bitcoin has surged to $38,000. The last time the bitcoin price traded near this level was over a year ago, in May 2022.\n\nBitcoin and another leading, popular digital currency, Ethereum (ETH), have also been in the headlines for reasons other than price surges. The world's largest asset manager, BlackRock, recently filed for an Ether exchange-traded fund. This move created further optimism that the crypto markets could see greater access, more significant institutional involvement, and liquidity.\n\nSo, as the price leading cryptocurrency’s trade higher in part due to the potential of a regulated exchange-traded product tied to the spot price of Ethereum, it’s worth looking closer at some individual stocks tied to digital currency and also noting where the U.S. Securities and Exchange Commission (SEC) stands with regards to approving a Bitcoin ETF.\n\nBlackRock takes steps toward launching Ethereum ETF\n\nBlackRock has officially confirmed its plans for a spot Ethereum exchange-traded fund (ETF) through a filing with the SEC. The filing, submitted by Nasdaq on behalf of BlackRock, proposes an ETF named the \"iShares Ethereum Trust.\" This move signifies BlackRock's intention to expand its ETF offerings beyond Bitcoin, marking a significant step in its cryptocurrency investment strategy.\n\nThe filing comes after BlackRock registered the corporate entity \"iShares Ethereum Trust\" in Delaware, hinting at the imminent submission of a spot Ether ETF filing. Several financial firms, including BlackRock, have shown interest in cryptocurrency-backed ETFs, with at least five firms vying for SEC approval for a spot Ethereum ETF, according to Bloomberg’s James Seyffart.\n\nSpeculation grows about the SEC approving a spot Bitcoin ETF\n\nSpeculation is growing about the SEC approving a spot Bitcoin ETF. Analysts have estimated a January approval at the earliest, emphasizing the SEC's cautious stance. Recent speculation suggests potential decisions on applications from BlackRock and Fidelity, but the SEC extended the timeline for the ARK 21Shares Bitcoin ETF to Jan. 10.\n\nSo, as speculation grows and the price for several popular digital currencies surges, here’s a list of four crypto-related stocks that could see rapid price appreciation should breaking news occur.\n\nFour crypto-related stocks to keep an eye on\n\nMarathon Digital (NASDAQ: MARA)\n\nMara is a Las Vegas-based digital asset technology company. The company specializes in blockchain-based mining and produces digital assets such as Bitcoin. Shares of the crypto company have skyrocketed this year, up about 180%. However, the stock has failed to join the latest crypto uptrend and, over the previous three months, fell almost 36%.\n\nMicroStrategy (NASDAQ: MSTR)\n\nMicroStrategy is a global provider of enterprise analytics software and services. MicroStrategy is actively involved with Bitcoin, holding and acquiring the cryptocurrency as part of its strategic investment strategy. As of November 1, 2023, MicroStrategy possesses 158,400 bitcoins, acquired at an average purchase price of $29,609.65 per bitcoin, resulting in a total investment of $4.69 billion.\n\nCoinbase Global (NASDAQ: COIN)\n\nCoinbase Global is a major cryptocurrency exchange offering tools for trading over 200 cryptocurrencies. COIN shares have performed exceptionally on the year by any standard, up almost 163% and recently rallying double-digits off key support in the $70s. However, analysts are not bullish on the stock, with a consensus Hold rating and a price target of $75.64, predicting almost 19% downside.\n\nRiot Platforms (NASDAQ: RIOT)\n\nRiot is a U.S. blockchain technology company that strives to be the premier provider of Bitcoin mining services in North America. The company offers cryptocurrency mining hardware, hosting services, and proprietary software. Shares of RIOT have impressed this year, to say the least, up 205%. However, the stock has failed to catch a bid off the recent sector headlines and has fallen almost 32% over the previous three months.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE4tYTFGWWJhQ2NSZk9wM1BZdjRWRVFYZEI1Qmp6R0MtenVaLU00MmZER1ZCT3N2V2xCVWIxY3hDTGVVUl9Ra0ZMRS05dENBU3ZudkZ5VWNwMTJwYXR2UGtjTXR2cmUxTFQ0ZTVGXzNUT1U0bGMtSFJ2bE5B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Surges To $2,132 As Blackrock's Move Sparks Enthusiasm - TronWeekly",
        "content": "Ethereum has hit a high of $2,132, riding a wave of enthusiasm driven by the news of Blackrock’s recent submission of an ETF for SEC review, as per Santiment X post. This surge reflects the growing optimism surrounding the second-largest cryptocurrency in the market.\n\n📊 #Ethereum has reached as high as $2,132 as optimism surrounding the #2 asset in #crypto surged with #Blackrock's new submitted #ETF for the #SEC's review. Our latest insight looks at $ETH's #onchain health and its chances to continue its growth. 👇 https://t.co/8sBC9d1lWT pic.twitter.com/2PruVIM4Ve — Santiment (@santimentfeed) November 11, 2023\n\nEthereum dominates discussions in the crypto sphere, marking the highest increase in conversation compared to its usual trends. The spike in interest correlates with Blackrock’s confirmation of an official filing for a Spot Ethereum ETF with Nasdaq, now awaiting SEC approval.\n\nThis revelation has infused a moderate level of euphoria among traders, propelling ETH’s price to the cusp of a 1.5-year high. The crypto community, both traders and influencers, is ablaze with bullish sentiments regarding the potential impact of these ETFs on the crypto sector.\n\nThe industry also speculates that Blackrock’s move may signal positive indications for their earlier Bitcoin ETF filing in June. However, the certainty of these ETFs remains a subject of debate, albeit Ethereum’s significant lead in social volume reinforces its current prominence.\n\nConversely, deeper insights into Ethereum’s network health via Santiment’s metrics reveal a mixed picture. While some utility metrics show strength with rising transaction volume and circulation, signals of concern emerge. The surge in whale transactions, simultaneous with substantial dumping by key stakeholders in the $100K-$1M tier, raises alarms of profit-taking.\n\nEthereum Surges to $2,132 as Blackrock's Move Sparks Enthusiasm 6\n\nMoreover, the spike in Ethereum’s social dominance amid price surges indicates elements of FOMO and greed, adding complexity to the overall outlook.\n\nEthereum Surges to $2,132 as Blackrock's Move Sparks Enthusiasm 7\n\nThe community, while excited about the ETF potential, is cautioned against the uncertainty of its confirmation. The fervor might simmer down, giving way to impatience in the coming weeks or months.\n\nThe future of Ethereum’s growth remains subject to the intricate interplay between market dynamics, investor behavior, and regulatory decisions.\n\nEthereum Price Analysis\n\nThe present value of Ethereum stands at $2,064.29, accompanied by a trading volume of $13.86 billion within the last 24 hours. Its market capitalization is estimated at $248.26 billion, contributing to a market dominance of 17.48%. Notably, there was a decrease of -1.69% in the ETH price over the past day.\n\nSource: CoinMarketcap\n\nAs per Coincodex’s current forecast, Ethereum’s value is anticipated to climb by 5.14%, aiming for $2,165.91 by November 15, 2023. Coincodex technical analysis indicates a prevailing bullish sentiment, corroborated by a Fear & Greed Index reading of 70, indicating a state of “Greed.” In the previous 30 days, Ethereum has experienced 23/30 (77%) days of positive growth, showcasing an 8.11% price fluctuation.\n\nEthereum’s price consolidates above $2,035 within an ascending triangle pattern formed by connecting swing highs and lows. Traders eye a breakout from the horizontal trendline. The pattern suggests a target of $4,736, derived from a 134% triangle height. Positive RSI and bullish AO hint at sustained momentum and market strength.\n\nSource: Tradingview.com\n\nNote: The details on this page about markets and instruments are like a sneak peek – just info, not a nudge to buy or sell. Before diving into investments, dive into your own research pool.\n\nRelated Reading | Celsius Bankruptcy Plan Faces Skepticism, Regulatory Hurdles"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBxTmdzQmREY1RnM0VTZTFPM1FvLWNIclI0SVhSRmpERWE2NWRMcEJYMDhfVDlqRmV4bE9GZGoxcDBhZ0hiRnNUUks0WDlvRkMzWS1fSlNxdDJ1aGJKZ3htNlp4M0FPLXNNdWhZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "BlackRock Ethereum ETF Confirmed, Ether Surges in Price - BitPinas",
        "content": "BlackRock intends to launch an Ethereum ETF, with Coinbase as the custodian of ether and an unnamed third party holding its cash.\n\nFollowing the news of the Ether ETF, ETH surged by 10% to nearly $2,100, reaching a 7-month high.\n\nSeveral other companies, including VanEck, Ark Invest and 21Shares, Hashdex, Invesco and Galaxy Digital, and Grayscale, have filed for or launched Ethereum ETFs.\n\nThrough a recent filing on Nasdaq, it was revealed that BlackRock, an American multinational investment management corporation, is planning to create an exchange-traded fund (ETF) that will hold Ethereum’s ether. Following the news, ETH’s value significantly increased.\n\nAt the time this article is published, Ether’s price pushed above $2,000.\n\nRead more cryptocurrency news:\n\nBlackRock ETH ETF\n\nAs per the stock exchange’s Nasdaq filing, BlackRock is pursuing listing its product on the platform. Moreover, it also states that the U.S.-based cryptocurrency exchange Coinbase would act as the custodian of the ether held by the product, while an unnamed third party would hold its cash.\n\nFollowing this, CoinDesk noted that BlackRock also has a market surveillance agreement with Coinbase which appears to be essential for obtaining approval for such ETFs from the U.S. Securities and Exchange Commission (US SEC).\n\nAdvertisement\n\nAccordingly, it seems that the filing tried to address possible objections from the US SEC to the surveillance-sharing agreement by stating that BlackRock believes the prices of CME Group’s ether futures closely match spot ETH prices.\n\nThe filing asserted that either CME surveillance can detect spot-market fraud that affects both futures ETFs and spot exchange-traded products, or that surveillance cannot do so for either type of product.\n\n“Having approved ETH futures ETFs in part based on such surveillance, the Commission has clearly determined that CME surveillance can detect spot-market fraud that would affect spot ETPs, and the Sponsor thus believes that it must also approve spot ETH ETPs on that basis,” the statement reads.\n\nPreviously, the corporate entity, iShares Ethereum Trust, BlackRock’s ETF Division, has recently been registered in the state of Delaware. However, it must be noted that offering ETFs still requires registration and approval from US regulators.\n\nThe U.S. SEC is currently reviewing 12 spot bitcoin (BTC) ETF applications, including the previous BTC ETF application from BlackRock. The SEC has until November 17 to approve all of these applications if it intends to do so this year. If the SEC cannot approve all of the applications by this deadline, the ETH ETF plan will have to wait until next year to be approved.\n\nEther Price Surge\n\nFollowing the news about the Ether ETF, the price of the crypto surged 10% to nearly $2,100. This increase has led ETH to reach its 7-month High.\n\nCurrently, CoinGecko data shows that ETH is currently valued at $2,105.99 and was up by 9.1% for the last 24 hours.\n\nOther ETH ETF Filings\n\nAccording to Bloomberg Intelligence analyst James Seyffart, there are currently five other ETH ETF filings.\n\nVanEck\n\nThe VanEck Ethereum Strategy ETF (EFUT), launched on October 2, 2023, is an exchange-traded fund that seeks capital appreciation by investing in ether futures contracts. The fund is actively managed and provides exposure to ether-linked investments through an accessible exchange-traded vehicle. The fund does not invest in ether or other digital assets directly.\n\nArkInvest and 21Shares\n\nArk Invest and 21Shares have partnered to launch a new suite of digital asset exchange-traded funds (ETFs). The suite comprises five ETF products that will be listed on the Chicago Board Options Exchange and are scheduled to begin trading the following week. The companies will use on-chain signals and their crypto-native expertise to provide long-term capital appreciation by investing in BTC and ETH futures contracts.\n\nHashdex\n\nAccording to its website, the Hashdex Nasdaq Ethereum ETF (HETH.BH) is a fully physically backed ETF that seeks to track the investment results of the Nasdaq Ether Reference Price™ Index (NQETH™), a basket composed entirely of Ethereum. Moreover, it stated that the fund is listed on the Bermuda Stock Exchange and is only available to institutional investors.\n\nInvesco and Galaxy\n\nAs per a report, Invesco and Galaxy Digital have filed for a spot Ethereum ETF with the US SEC on September 29, 2023. The Invesco Galaxy Ethereum ETF is noted to “reflect the performance of the spot price of ether” by storing units of the crypto with an unnamed custodian.\n\nGrayscale\n\nIn addition to their BTC ETF, Grayscale also filed an application to convert Grayscale Ethereum Trust (ETHE) to a spot ETH ETF.\n\nWhat are ETFs?\n\nExchange-traded funds (ETFs) are investment funds that are listed and traded on stock exchanges, just like individual stocks. ETFs are designed to track the performance of a specific market index, commodity, bond, or basket of assets.\n\nIn the web3 space, the current available crypto as an ETF is only Bitcoin following Grayscale’s successful appeal to the SEC to convert its Bitcoin Trust into an ETF.\n\nThis article is published on BitPinas: BlackRock’s Ethereum ETF Confirmed, Ether Surge in Price\n\nDisclaimer:"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOZy1UdmlVVUxuSWhrS0tSUTlCZ0dwRFBULWhOVS1pUUh3MmU3cXZGaVlBZ1YtMjd4OFViZVlPQlo2bURLdVBPeGN1bGhrNURqSGZPSFpPUVZhVjBtTkVma3hDbHczWnVWdHVyTGJjMTlnYTBLeEpzaGF4LURmZDhpc05SVDRZX241ZVB1NC1jb1lIZkItV3ZyWW5fRkZ4aWRIYmVMaWZnV1JjRTNNNkVRQUlnOF9mUUXSAbwBQVVfeXFMUGlHb3FaXzFqdXRYRFQ0ZEhSalZsYXV1YjdQMmduZEpJNjBTVGRRT2dOYVRBanFmUHNjVDBISGZiWEl3R0FFN1FuTGlPQUE0enNsV1kxbzVpeS1yWVBoYzR3OTVoNWpaWVpBNGRZNkU2ZUxUbllvNWdxYXlaOE1iNWM3UHEwR0NjWGlvMV9MZnZtbFBKQS1JVF9BYmxNVzlqcVJYcFJoQzAycE5RNWpxSktWT2VzUXl6dThPRTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Showing Bearish Signal As Miners Unload $175,000,000 in BTC: Crypto Strategist - The Daily Hodl",
        "content": "A closely followed crypto analyst is issuing a warning, saying Bitcoin (BTC) just flashed a signal suggesting that a sell-off event may be imminent.\n\nCrypto strategist Ali Martinez warns that Bitcoin’s Tom Demark (TD) Sequential indicator is pointing to a possible corrective move.\n\nThe TD Sequential indicator traces a series of price points to signal possible trend reversals.\n\nSays Martinez,\n\n“Bitcoin: the TD Sequential is flashing sell signals on BTC weekly and three-day charts! Remember, the last time TD showed buy signals in both timeframes was in early September, kickstarting the recent bull run.”\n\nLooking at the activities of Bitcoin miners, Martinez says that the investor cohort has been using the recent rally to unload thousands of BTC.\n\n“Since Bitcoin surged past $34,000 in late October, BTC miners have been selling.\n\nOver 5,000 BTC, worth approximately $175 million, have been offloaded since then.”\n\nAt time of writing, Bitcoin is trading for $37,026.\n\nAs for Ethereum (ETH), Martinez notes that the coin’s recent rally kicked off without inflows from deep-pocketed investors.\n\n“Ethereum has reclaimed the $2,000 threshold, and intriguingly, this is all happening before whales have even started buying.”\n\nAt time of writing, Ethereum is trading for $2,042.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPaDFTY1VKb3pLbFN3blM3bElUcENQeHdORWMzelhuZ3BCWjRHZFlNd3BTV2dQdXBqTU85T0JUcUkwNnBxQklKWlY0WEIwdlpyRFhONnZ5ZEo4cEh1QTNWTnA5VkdsSmNkaUVqOXBkR1VXVkNOWWlmRTg2TGxhVjdJUWMtOXUxMlNhbEktYg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Daily Crypto Price Analysis: BTC, ETH, SUI, LUNA, and FTT - Blockchain Reporter",
        "content": "Cryptocurrency markets, known for their inherent volatility, provide a captivating landscape for investors who closely monitor price movements to make informed decisions. In this comprehensive analysis, we delve into the recent trends of five prominent cryptocurrencies: Bitcoin (BTC), Ethereum (ETH), Sui (SUI), Terra (LUNA), and FTX Token (FTT). Each coin’s performance over the last 24 hours is scrutinized to identify noteworthy trends and potential opportunities for investors.\n\nBitcoin (BTC) Price Analysis\n\nBitcoin, the pioneer cryptocurrency, has experienced a recent uptick in its price. As of the latest data, the current price stands at $37,022, reflecting a 0.18% decrease in the last 24 hours. Over the past week, Bitcoin has shown resilience, registering a notable 6.02% gain. Bitcoin’s price continues its upward momentum, breaking through the upper limits of an ascending parallel channel. This bullish trend suggests the potential for further gains, with $40,000 now within reach.\n\nIf the bulls maintain their buying pressure, the BTC price might surpass the range high at $37,972. In an exceptionally bullish scenario, the cryptocurrency could achieve the coveted $40,000 mark, representing a substantial increase from its current levels. Investors are closely monitoring these developments, anticipating the potential for continued positive momentum in the market.\n\nEthereum (ETH) Price Analysis\n\nEthereum has witnessed a mixed trend in the last 24 hours. Currently priced at $2,058, ETH has experienced a slight surge of 0.16% during this period. Moreover, over the past week, Ethereum has demonstrated strength with an impressive 9.40% increase. ETH is currently grappling with a significant hurdle at the $2,139 resistance level, a formidable barrier that could signal a shift to the territory last tested in May 2022.\n\nA successful breach and close above the $2,139 resistance level would pave the way for further Ethereum price gains, starting with the clearance of the range high at $2,141. On the other hand, the Relative Strength Index (RSI) indicates that ETH is heavily overbought, and its southward deviation suggests a waning momentum. These factors pose potential threats to the upside momentum of Ethereum’s price.\n\nSui (SUI) Price Analysis\n\nSui has shown significant growth in the last 24 hours. With a current price of $0.6442, SUI has surged by 7.48%. Based on our latest price analysis, our SUI price prediction anticipates a potential decrease, with the expected value reaching $0.713 in the following week. However, technical indicators suggest a prevailing bullish sentiment, complemented by a Fear & Greed Index reading of 70 (Greed).\n\nNotably, SUI crypto has seen 19 out of the last 30 days (63%) marked as green, showcasing a 12.01% price volatility during this period. Considering these factors, our price forecast suggests that the current market conditions present a favorable opportunity to consider buying SUI. Investors and enthusiasts are likely to keep a close eye on this emerging coin as it establishes its presence in the market.\n\nTerra (LUNA) Price Analysis\n\nTerra has experienced substantial gains in the recent 7-day period. Priced at $0.8036, LUNA has seen a 0.64% increase in the last 24 hours and a remarkable 73.3% in the last week. Should the bulls succeed in surpassing the resistance threshold of $0.8752, LUNA is poised to recover momentum and position itself for a forthcoming challenge of its higher resistance level at $0.8429. Sustaining the price at this level will lay the groundwork for a potential endeavor to test the resistance at $0.900 in the upcoming week.\n\nConversely, in the event of a market trend reversal, the LUNA price may lose its upward momentum, prompting a descent to examine the support level at $0.6207 in the near term. Furthermore, if bearish forces persist, a more substantial decline could unfold, leading to a test of the lower support level at $0.5462 within this month. Traders are advised to closely monitor these key levels for strategic decision-making in the dynamic market.\n\nFTX Token (FTT) Price Analysis\n\nFTX Token, the native utility token of the FTX exchange, has exhibited remarkable growth in the last week. Priced at $3.505, FTT has dipped by 10.3% in the last 24 hours and an impressive surge by 210.10% in the last 7 days. While the FTT token’s upward trajectory persists, it encounters resistance at $4.3648, which may lead to a subsequent period of sideways trading. The commencement of November brought a bearish tone with the legal issues surrounding Sam Bankman-Fried (SBF), causing a dip in prices.\n\nAlthough the market initially suffered a breakdown below its support level, momentum was restored, allowing the price to reclaim its position. During a brief period, the MACD exhibited a consistent flatline, followed by a significant surge in momentum, indicative of substantial price action for the FTT token. Additionally, the chart reveals a rising green histogram, signaling the likelihood of continued value appreciation in the upcoming days.\n\nConclusion\n\nThe cryptocurrency market continues to be dynamic, with each coin showcasing unique price movements. Investors and enthusiasts must remain vigilant, considering both short-term fluctuations and long-term trends. As the market evolves, staying informed about the factors influencing each cryptocurrency’s performance is crucial for making well-informed investment decisions."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMioAJBVV95cUxOemVEMnBnX1d4Yk5yckdMandadVY5WjBaMmp2UkNnU2RWczNydF9DVTZQandtRWVQR0lmN1NoUUYyN3VsUWhrMTBrZkx1a2l6WVhxZ3dxOE1pbEpFM0FyaWtkQ3lUaXRka1FwR0lPSmZXcXRJYTVOcFlzU1RQc2kwVjRMUjRvTExDdXFVWEV5akhhQ0NQZ3E4Y0Y1XzZzWWE1QzhKaERhVmdLNlNSVk1KOXY0TlM2Wk5CWVRXYkQwcV80TGMzcG9PcUptSlNSMGdvZFZ3SzZmS0lYN2NyQWpnZVN2NVJOMTlNejJIRkpDOUxEeHlIcE50a09wamJHN20zNGZENUc2M2Npa1QxQkx1NGVWSldKV3lxeTVjT0s3cUXSAa4CQVVfeXFMTWU5cS1VRTBROFRhQl9FWXRZa1lDUWxtLW51bjlYVTFvSEZrSE5YY2poMm1jU1VrREFYSU5feFE2UnJDZHRORnRQMUdZdnpCclBLU0FRZENmVjNXNHE3cGwwWnpUYU9ybWhLRmloem1JNk5IMEdISDRfZnhqemc5amszdzJMaG01QXVPNHRxc2lDcmFVNzYxaXprdTg2TzNZWTJ1SUVhUmRKOXg3cGVkQzFxSmR2OXUtTlplOFlkNVVQWnNNREpWTTRmMDRuMzd1UlNVRmRxbFB5TW5fdXVxOTFGSVAwWnlXdzdLRS1DTjBKcHl1N0lHMW9yOVFoZFhacXhjNUZBMUNlWW01WlRBeXF4Zk04ajEzTHZ4Y0JmS3V6U1N3NXVkT01nekQ4Tmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Had You Invested $100 in Ethereum in 2016, Here’s Your Current Worth; Which Cryptocurrencies Are Next in Line for Investment? (ETH, NUGX) - Analytics Insight",
        "content": "With such a high ROI, Ethereum (ETH) is undoubtedly among the top crypto coins to invest in currently. Its many use cases and increasing whale demand might help push it well above $2,000 by the end of 2023. Hence, it is a good crypto to buy today."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1vcm1ncGQwQWdfRzdLYVNzWHc5U2dEM0lvRnZ1ZjJlOXhqWnZ4UVVPYUZYWmxjajY2eU4tODdUemM3R2VGUXIwNWVNMDh6dVVoQm1xX1pHa09sVW5YVVp3NmRwdHZ4T3BkNEJzZ0NLY0pEbnFuamc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Daily Analysis: BTC, ETH, SUI, LUNA, FTX - Blockchain Reporter",
        "content": "Markets are on bull activity today, with the global market cap sitting 0.41% above its previous 24-hour mark, as the total cap stands at $1.41T as of press time. The fear and greed index is at 77, as greed still dominates. The global trading volume is 24% down in 24 hours, at $51.8B as of press time.\n\nBitcoin price analysis\n\nBitcoin (BTC) has started on minor bull activity, as Bitcoin price stood at $37.1K as of press time after recording a daily decrease of 0.14% and a weekly rise of 5.9%. As a result of the Bitcoin price, the token’s trade volume dropped by 40% during the same period and is presently at $12.9B.\n\nThe Bollinger bands are converging, showing dropping volatility levels on Bitcoin Price. The Relative Strength Index (RSI) is above the average line in the overbought region, showing bull dominance on Bitcoin price.\n\nBTC 1-day chart | Source: TradingView\n\nEthereum price analysis\n\nEthereum (ETH) has started on minor bear activity, as Ethereum price stood at $2054 after recording a daily decrease of 0.12%, as the weekly rise now stands at 9.3%. ETH’s trade volume dropped by 32% during the same period and is presently at $9.1B.\n\nThe Bollinger bands are diverging, showing high volatility levels on Ethereum Price as the Relative Strength Index (RSI) is above the average line in the overbought region, showing bull dominance on Ethereum price despite today’s dip.\n\nETH 1-day chart | Source: TradingView\n\nSUI price analysis\n\nSui (SUI) has started on bull activity, as SUI price stood at $0.5891 after recording a daily increase of 1.3%, as the weekly rise now stands at 17%. SUI’s trade volume dropped by 29% during the same period and is presently at $172M.\n\nThe Bollinger bands are diverging, showing high volatility levels on Sui Price as the Relative Strength Index (RSI) is above the average line close to the overbought region, showing bull dominance on Sui price.\n\nSUI 1-day chart | Source: TradingView\n\nTerra price analysis\n\nTerra (LUNA) has also started on bear activity, as Terra price stood at $0.069 after recording a daily decrease of 5%, as the weekly rise now stands at 53%. LUNA’s trade volume dropped by 65% during the same period and is presently at $299M.\n\nThe Bollinger bands are diverging, showing high volatility levels on Luna Price as the Relative Strength Index (RSI) is above the average line close the overbought region, showing bull dominance on Luna price despite the price drop today.\n\nLUNA 1-day chart | Source: TradingView\n\nFTX Token price analysis\n\nFTX Token (FTT) has started on bear activity, as FTT price stood at $3.4 after recording a daily decrease of 21%, as the weekly rise now stands at 202%. FTX’s trade volume dropped by 36% during the same period and is presently at $533M.\n\nThe Bollinger bands are diverging, showing high volatility levels on FTT Price as the Relative Strength Index (RSI) is above the average line in the overbought region, showing bull dominance on FTT price despite today’s price drop."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOUU1HZW9xcWdtZzE1U2hmNTRhWGdyVkhDSDdJakFUT2t0NF9xQlVtNUhGS19BajFtVGxPNHUxWUJlN1E0bnFnMGx5b19oRHo2MXBzSl81WUFvQ3BTVFdUaXJiM1ZCSndmY1VENmJ1dUVDcjBWaGVuMDJ1ZWk0QTM5dGJZeU80eHNCOHd0YllMaFQ5Rko3YWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Analyst says ETH could spike to $3,100 if key resistance breaks - CoinJournal",
        "content": "Ethereum is looking to break above a key resistance level at $2,150.\n\nCrypto analyst Michael van de Poppe says ETH price could jump to between $3,100 and $3,600 if a breakout happens.\n\nCatalyst for the market include a spot Bitcoin ETF approval and developments on Ether spot ETF applications.\n\nEthereum (ETH) traded to highs of $2,136 last week, before giving up some of the gains over the weekend to touch $2,016.\n\nThe top altcoin has however seen an uptick on Monday, rising to change hands around $2,120 as buyers looked for a first green candle in three days.\n\nVarious market observers see a potential approval for a spot Bitcoin ETF as a catalyst that could catapult both BTC and ETH. While many experts opine that the most likely period for approval is early January, there’s a window for the SEC to greenlight the first spot Bitcoin ETF for the US market.\n\nThis window is open until November 17.\n\nReminder: There is currently a window open this week for an early approval of the $BTC etf through the 17th. in addition last week blackrock filed for a spot $ETH etf If the BTC etf is approved, expect both to fly pic.twitter.com/DbWWa68UAj — Pentoshi 🐧 euroPeng 🇪🇺 (@Pentosh1) November 13, 2023\n\nAnalyst on what next for ETH if resistance breaks\n\nFor one top analyst, ETH/USD faces a major hurdle near $2,150 – break this and the price of the world’s second largest cryptocurrency by market cap could surge to the next supply zone around $3,100. Above this would be the key resistance at $3,600.\n\nThe prediction thus forecasts a 44%-67% price jump for Ethereum if bulls break higher.\n\nAccording to Michael van de Poppe, the highlighted resistance at $2,150 is comparable to the massive wall that rebuffed numerous bullish attempts for Bitcoin (BTC) at $30,000. Sharing his prediction with more than 672k followers on X, the founder and CEO of crypto trading group MN Trading wrote:\n\n“Ethereum faces the final resistance. Breaking above $2,150 marks the end of the bear market, as this level is comparable to the $30,000 barrier of Bitcoin. If it breaks, then we’re likely seeing a run towards $3,100-3,600.”\n\nVan de Poppe shared a price chart for Ethereum showing an ascending triangle pattern, which in technical analysis, signals a potential bullish breakout. The chart marks the two anticipated primary resistance zones as shown below.\n\n#Ethereum faces the final resistance. Breaking above $2,150 marks the end of the bear market, as this level is comparable to the $30,000 barrier of #Bitcoin. If it breaks, then we're likely seeing a run towards $3,100-3,600. pic.twitter.com/i91ULBRtLz — Michaël van de Poppe (@CryptoMichNL) November 13, 2023\n\nEther was trading around $2,093 on Monday evening, 2.4% up in the past 24 hours. The cryptocurrency’s value shows an 11% and 35% surge in the past week and 30 days respectively."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiS0FVX3lxTFBOeHRUeHFQUnVvMFRsbWNYbzhJRlRKWThqS0xBNXJyX1duUjB3dTgxR1pNcHk1c0FxM1lvUTBoQW9FNVNQWGlCYmMxMNIBQkFVX3lxTE9VY3Qxclc0ZlNzS3NxM3hBTHYzdjRQX0FnN1lzcG9weTVBZ2RmTFhrc2RUTWpEUW5LYUlKbXRpdlRDdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Transaction Fees Soar, Ethereum Follows In Bitcoin Traces - VOI English",
        "content": "JAKARTA - Transaction fees for bitcoin (BTC) and ethereum (ETH) have seen a significant increase in recent weeks. This shows the high activity of crypto transfers on onchain networks, which also has an impact on other operating costs such as exchange, bridging, and NFT.\n\nReporting from Bloomberg, the average cost for bitcoin transactions peaked at 15 US dollars (Rp234,825) per transfer on November 9, 2023, a sharp increase from US$3.5 (Rp54,795) on October 22, 2023. Similarly, the average cost for Ethereum transactions jumped by 219% in the same time range, up from US$2.08 (Rp32,564) to US$6.64 (Rp103,824) per transaction.\n\nEthereum transaction fees (ETH) on November 12, 2023. The average fee reached a maximum of 10.52 US dollars (Rp164,556) on November 9, 2023. Crypto transaction fees are a reward paid by the sender to the miner or validator who processes and confirms transactions on the blockchain.\n\nThe transaction fee is determined by demand and supply in the market, as well as the complexity and size of the transaction. The more transactions occur on the network, the higher the cost that must be paid by the sender to ensure their transactions are prioritized.\n\nHigh transaction fees show that crypto networks are experiencing congestion or capacity constraints, which can reduce their efficiency and scalability. In addition, high transaction fees can also reduce crypto appeal as a cheap and fast means of payment, especially for low-value transactions.\n\nThe Impact Of High Transaction Fees\n\nThe high transaction fee does not only apply to crypto transfers, but also for other types of operations carried out on blockchain, such as being involved with smart contracts, decentralized exchange platforms (dex), decentralized financial solutions (DeFi), and non-fungible tokens (NFT).\n\nFor example, exchanging ETH-based assets on a dex platform can cost from 27.77 US dollars (Rp 434.118) to 28.50 US dollars (Rp 445,388) per transaction. Meanwhile, the cost of making NFT transactions fluctuates between 46.93 US dollars (Rp 733,636) to 48.16 US dollars (Rp 752,304).\n\nIt also has an impact on increasing costs for transferring assets across different chains via bridging, which is estimated to be around $8.93 (Rp139,485) to $9.17 (Rp143,307) per transaction. Bridging is a process that allows crypto assets to move from one blockchain to another, for example from ethereum to smart chain binance.\n\nFrom October 22, 2023 to November 11, 2023, ethereum has processed an average of around 1,071,448 transactions daily. This number is still lower than the record high of around 1.4 million transactions per day achieved in May 2021, when NFT and DeFi activities were booming.\n\nWhile ethereum is still the second largest blockchain after bitcoin by market cap, high transaction fees show that ethereum faces challenges in competing with other blockchains offering lower transaction fees, such as solana, avalanche, and polygons.\n\nThis blockchain-blockchain uses a different consensus mechanism from ethereum, which currently uses proof-of-work (PoW) which requires a lot of computing power and energy. Ethereum has made a transition to proof-of-stake (PoS), which is expected to increase its efficiency and scalability, as well as lower transaction costs.\n\nMeanwhile, bitcoin, which also uses PoW, still leads ethereum in terms of market cap, daily trading volume, and transaction fees within 24 hours collected by miners.\n\nThe English, Chinese, Japanese, Arabic, and French versions are automatically generated by the AI. So there may still be inaccuracies in translating, please always see Indonesian as our main language. (system supported by DigitalSiber.id)"
    }
]