[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1nTDZEeWduMWdMWWxjRkttQnpxbXBEQzZpcTRBWFgxMGZCVzVRa2NvcG9mb0VUNWhlVWROOGtBWk82aFpQbmlzZ3M0dlVscEFHTjRjQW1jMGxOb2RlQS1Fa2tfdmI4cW5XQlUzdDBRZGVCRThRNHBMQTdB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum gets a BlackRock boost, but the real test lies ahead - Fortune",
        "content": "Happy Friday. The week is ending on a high note for Ethereum, which is back in the news after financial giant BlackRock filed to launch an ETF backed by Ether, the blockchain’s native currency. This led the price to jump 10%, back over the $2,000 mark, for the first time in months as investors bet that BlackRock’s entry will attract billions of dollars in new capital.\n\nThis development brings renewed attention to the world’s second-largest cryptocurrency, which has largely been overshadowed by Bitcoin and even Solana during the long-awaited rally of the last two months. But while Ethereum boosters are rightfully enjoying the price surge, the return of the spotlight has also raised some familiar concerns.\n\nThese include griping about Ethereum’s transactions costs, known as gas fees, which have soared along with the burst of activity on the blockchain that has come with more trading. For long-time crypto watchers, this will bring back unpleasant memories of 2017 and 2021 when hype over Ethereum’s smart contract promise led to a surge in price—followed by the blockchain slowing to a crawl, which in turn forced those who wanted to transact to pay outrageous fees.\n\nEthereum’s momentous shift last year to a proof-of-stake system was supposed to alleviate the price and congestion issues, along with so-called layer-2 solutions—sub-layers on the network that process transactions in batches and then record them on the main blockchain.\n\nThe trouble is that while the layer-2 systems do indeed lower costs dramatically, they add complexity and make the Ethereum user experience—already an ordeal for those who aren’t crypto diehards—even more of a headache. They are also less secure. This has led some to gripe that Ethereum should have devoted its energy to making its main network cheaper and efficient rather than outsourcing the task to other projects.\n\nFinally, the switch to proof of stake has also raised concerns over centralization as a relatively small amount of validators are now responsible for maintaining the network—a fact that Bitcoin purists, never gracious at the best of times, have lampooned mercilessly as part of the crypto world’s eternal infighting.\n\nNone of this means that Ethereum is facing major trouble—the network is the leading smart contract for a reason, with by far the most users and a robust and dedicated developer community. But as a new crypto bull market emerges, it will be harder for the platform to blame familiar headaches on growing pains. Ethereum is now almost a decade old, and the time has come for it to show it can deliver on its enormous potential.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nChainlink's LINK token is up 175% since January as the oracle provider has branched out from pure crypto pricing to tie-ups with the TradFi sector. (Fortune)\n\nThe notorious \"Cryptoqueen\" who oversaw legal and compliance for Ponzi-like OneCoin pled guilty in the $4 billion fraud. (WSJ)\n\nEconomist Nouriel Roubini, a.k.a Dr. Doom, has long been a fierce critic of Bitcoin and crypto, but in a surprise move is launching his own stablecoin. (The Defiant)\n\nIn a first-of-its-kind crypto bankruptcy exit, a restructuring plan will give Celsius customers 37 cents on the dollar and shares in a new company dedicated to staking and mining. (WSJ)\n\nBitcoin brushed $38,000 on Thursday, the highest the token has traded in 18 months. (Fortune)\n\nMEME O’ THE MOMENT\n\nTFW you learn one-third of Ethereum nodes are 20 miles from CIA headquarters:"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOaFdMYjVycjhMUHdhVGlkUS10T19rdnRwbnQzVGNaaDBzLWZjVndidlU3OEs0MWRlUi0zNUZ6SV8zNUhNR05rUE9PWFpXYzYwR2dlV21iWGhhXzI5YzBaY0ZxSG9vY1J0S3NXWHd0MHNPaUVjMzlKeXEwU2pGMmpqeUFkdVZqdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Crypto Is Back From the Dead Thanks to BlackRock and Gary Gensler - New York Magazine",
        "content": "Is bitcoin back? Photo-Illustration: Intelligencer\n\nFor the entirety of crypto’s existence, a large part of digital currency’s appeal was how strange it all was. From its 2008 inception, bitcoin was this new kind of anti-government money, perfect for someone to buy drugs with online anonymously, even as it was susceptible to getting lost or thrown out on garbage day. There were the copycat fads — the “initial coin offering” bubble of 2017, the shitcoin mania of 2021 — as well as the truly weird and dumb stuff, like the NFTs of monkeys that were, briefly, fodder for the art world. Whatever your opinion of all these things, they made many people very, very rich — at least for a little while, on paper. This year, though, has been different. After last year’s market collapse and last week’s conviction of crypto-fraud kingpin Sam Bankman-Fried, what’s weird about it all isn’t some new trend or some new offense to good taste. On Thursday, crypto had one of its best days in 18 months, and it has everything to do with abandoning its rebel origins and getting approval from Wall Street giants and government regulators.\n\nA single bitcoin rose briefly to nearly $38,000 on Thursday, the highest that it’s been since the early days of the total market collapse triggered by the vaporization of two of the world’s largest cryptocurrencies, terraUSD and luna, in early 2022. Why did it rise from the dead all of a sudden? Crypto investors have a big new story to tell — and since the price of bitcoin isn’t tied to a physical asset, like oil, or the economic might of a country, like the U.S. dollar, it lives and dies by how persuasive its story is on any given day. This time, the narrative seems to be about crypto growing up and getting a haircut, a suit, and a real job — on Wall Street. Specifically, the Securities and Exchange Commission appeared to be getting closer to green-lighting an exchange-traded fund from investment behemoth BlackRock that would allow investors to buy bitcoin as easily as they buy the S&P 500. (An ETF trades just like a stock but can represent an index or commodity or a nearly endless variety of other financial bets.) And it wasn’t just bitcoin. Ethereum, the world’s second-most-popular crypto, was also reaching highs not seen since April, topping $2,000 per token, after BlackRock registered a corporate entity in Delaware for an ethereum ETF.\n\nBitcoin is at $37,000 and no one is talking about it. Nobody is saying anything!\n\n\n\nHas anyone checked the price?\n\n\n\nWhy is no one tweeting about crypto?\n\n\n\nHello?\n\n\n\nBitcoin is up a lot!\n\n\n\nDoesn’t anyone see it? — Zack Voell (@zackvoell) November 9, 2023\n\nFor Wall Street to finally start trading ETFs of bitcoin or ethereum would truly begin a new era in the world of cryptocurrencies. ETFs are part of the finance industry’s lifeblood, and an industry unto itself that, as of last year, was worth $6.5 trillion. At its core, a crypto ETF would make it easier for financial institutions (your pensions, mutual funds, hedge funds, and the like), and the average 401(k) holder, to easily trade and profit from the digital currencies without having to worry about encryption keys, or getting hacked, or anything like that. (At least, not directly. If BlackRock got its bitcoin hacked, though, that would be very bad.) Bitcoin ETFs have largely been a pipe dream for the last ten years, since the Winklevoss twins first tried to get government approval for one. (The SEC rejected it four years later.) What changed recently was a lawsuit from Grayscale, a company owned by Barry Silbert’s Digital Currency Group, a big (if currently troubled) player in the crypto space. In August, an appeals court ruled that the SEC had arbitrarily denied Grayscale’s application for its own ETF, which would have used many of the same market-surveillance and safety protocols that other funds used. Last month, the SEC said it wouldn’t appeal the decision, making the appearance of an ETF all but assured. “This was fully expected in my eyes and was just a matter of when, not if,” Bloomberg Intelligence analyst James Seyffart said. “But BlackRock’s name is obviously huge and just seeing this registration in Delaware sent ether prices skyrocketing.”\n\nAll this appears to fly in the face of what made crypto so … crypto-y. This was, after all, the money that was most closely associated with Occupy Wall Street and that Jamie Dimon has called a “fraud.” The spike in prices is of the kind that would typically come from secret, anonymous Telegram “pump” groups that would disappear just as soon as they made their profits. That its value is getting pumped because regulators are now okay with it and the likes of BlackRock, which manages over $10 trillion in assets, are getting in on it, is deeply weird and hilarious — not only because it’s the opposite of what it symbolized for so long, but because … what’s the difference? For most people who own a bitcoin, what matters is that the price is going to go higher (a.k.a. “number go up”), not any of the high-flying rhetoric about its ability make each holder a sovereign wealth fund unto themselves. Maybe this is why Gary Gensler, the SEC chair and chief antagonist of the crypto markets, came out recently and suggested that FTX could soon get relaunched as a crypto exchange, now that Bankman-Fried is no longer a threat. After his remarks, the price of FTX’s digital currency, long assumed to be dead by most investors, spiked by 90 percent — one of its best days ever."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPelZ3eWk2a3pJSE1BOWY1aHY2RU1mWEU1VUp2dGgxaERES0xGeHpYQXBGZ1lkVnpLNTU2SDk2MVFRTFFvMWZuV0h2YVh4TnY4RlBMYjFMM1B5UEpoQTRBMW1tNTRvWEFsVVd4Sk5wQlBiRF9qRGhfaWhLX2J6MkZJc1Fnb0ZZa0ZHLXVDUjRQWFc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Solana Is on a Tear. So Why Do Ethereum NFTs Remain Top Dog? - Unchained",
        "content": "SOL more than doubled in the last month. But here’s why Ethereum NFTs continue to outperform Solana NFTs by a mile.\n\nSolana is ripping. Not only has general crypto market sentiment turned more positive, which has boosted assets beyond just bitcoin, but Solana also just completed another one of its attention-grabbing conferences, Breakpoint. That’s all led to SOL more than doubling in the past month.\n\nDespite developer interest in Solana, the jump in its token price, and the fact that the speedy chain is known for NFT activity, as of yet, the leading blockchain for NFTs remains Ethereum.\n\nRead more: NFT Trading Activity on Ethereum Surges, Reaching a Six-Month High\n\nAccording to data from CryptoSlam, in the past 30 days, Ethereum led the NFT market in sales volume with $245 million in sales. Ethereum’s activity underscores its dominance, with a vast number of transactions totaling 745,175 and engaging 70,423 buyers.\n\nComparatively, Solana, which stands fourth in the ranking, reported $30.1 million in sales, just 12% of Ethereum’s volume, even after considering the fact that SOL has outperformed ETH by 127% in the last 30 days.\n\nWith Solana struggling to grab market share in the NFT ecosystem, Hildebert Mouiliere, aka Hildobby, a data scientist at VC firm Dragonfly, told Unchained that “a lot of things that appear on [Solana] are just copying what happened on Ethereum, which isn’t very innovative.”\n\nSolana is also battling the fact that Ethereum’s longer history makes it a hub for many types of activity beyond just NFTs. “I think Ethereum has become a center of liquidity for a lot of things,” said gmoney, NFT collector and founder of 9dcc. “And not just NFTs, but also certain tranches of DeFi and what have you. And so I think that’s going to be hard to displace even though there are narratives that build up around other chains.”\n\nHowever, Solana could still become a contender if it builds on the particular advantages of its technology over Ethereum. “I hope that we see in the future some teams actually using what this tech can do to leverage what is lower fees and higher frequency transaction,” said Hildobby.\n\nRead more: Anatoly Yakovenko on Solana’s Astounding Recovery and Its Future Plans\n\nOver a year has passed since marketplaces like Magic Eden sparked a seismic shift in the NFT industry by making creator royalties optional—a move that continues to influence market dynamics.\n\nHildobby noted the complex nature of enforcing such payments and suggested that creators may need to consider additional incentives to encourage voluntary compliance. “It’s impossible to enforce those things,” he said.\n\nAs for where the market could go, Hildobby said he’s looking to the rise of NFT derivatives and lending platforms, which could diversify NFTs as financial instruments. “The vast majority of volume now is around lending, which allows for those high prices to now land at a much discounted rate,” Hildobby explained, emphasizing the potential for these platforms to broaden market participation.\n\nLearn more: What Are NFT dApps?\n\nGmoney also thinks future innovation in NFTs will come in their financialization and bringing real world assets on chain. As an example, he said, “the sneaker resell market is huge,” noting that with NFTs, “you can give them access to credit that they otherwise wouldn’t have.” Once that is a proven application, he said that could show the potential for NFTs to unlock value in other collectors’ items such as watches and handbags. “To me, one of the most interesting things is obviously, definitely the real world asset side of things, because I just think that you need to see the melding of those two worlds at some point, and I think that starts to happen over the next three to five years.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQN1VrcXliLS03bTlVd3Rya09OWDNZY05PeFFiRzFFcGIzVFZCbHV3Q3VNdEFOT05jWkhYUGw1YVAzVzh4UzJOZF9yc19BdE9LQ1JxZ3JBZS1EZXZuYXp4RHhmNmJULVdkMnk4Z2FaOVl3bmtFcVA3X2FfTnNweDRVQm9nd2d3dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum hits 52-week high: analyzing the surge beyond $2,000 - crypto.news",
        "content": "Ethereum’s latest surge to over $2,098 signals a bullish market trend. What’s driving the price, and how far will ETH go?\n\nEthereum (ETH), the second-largest digital asset by market capitalization, experienced a noteworthy surge on Nov. 9, reaching its 52-week high of $2,137.\n\nAs of this writing, Ethereum is well above the $2000 mark, trading at approximately $2,098, marking a nearly 10% increase within a 24-hour period​​.\n\nOverall, since the beginning of the year, Ethereum has seen an impressive uptick, increasing by more than 75% year to date (YTD)​​. However, despite these gains, Ethereum is still considerably below its all-time high of $4,891 in November 2021​​.\n\nLet’s delve deeper into Ethereum’s recent price action, explore the underlying factors driving this surge, and provide insights into where Ethereum could be headed in the coming days.\n\nWhy the ETH price is up\n\nThe recent surge in Ethereum’s price can be attributed to a combination of factors. One of the significant triggers for Ethereum’s price increase on Nov. 9 was BlackRock‘s registration of an iShares Ethereum Trust in Delaware.\n\n🚨BREAKING: The iShares Ethereum Trust has just been registered in Delaware.\n\n\n\nBlackRock did the same thing before filing for a $BTC spot ETF. $ETH spot ETF incoming?\n\n\n\nh/t: @SummersThings pic.twitter.com/e4kxAZrcOG — Miles Deutscher (@milesdeutscher) November 9, 2023\n\nIndustry observers believe that Blackrock is preparing to launch a spot Ethereum exchange-traded fund (ETF) following the potential approval of its spot Bitcoin ETF proposal.\n\nYou might also like: Understanding Bitcoin’s recent market dynamics and price predictions\n\nBlackrock applied for a spot Bitcoin ETF on June 15, 2023, and is now awaiting a verdict from the SEC.\n\nBloomberg Intelligence analysts have indicated that the U.S. Securities and Exchange Commission (SEC) might soon decide on the approval of 12 Bitcoin ETFs filed by major Wall Street firms, which has contributed to the bullish sentiment in the crypto market​​.\n\nNew Research note from me today. We still believe 90% chance by Jan 10 for spot #Bitcoin ETF approvals. But if it comes earlier we are entering a window where a wave of approval orders for all the current applicants *COULD* occur pic.twitter.com/u6dBva1ytD — James Seyffart (@JSeyff) November 8, 2023\n\nThis window for all 12 ends by 11/17. But theoretically SEC could make a decision on the first 9 on this list at any point from now until Jan 10, 2024.\n\n\n\nI've added a column for those that have provided amended S-1's/prospectuses (ive been repeatedly asked about this on here) pic.twitter.com/OlGajPkhZA — James Seyffart (@JSeyff) November 8, 2023\n\nETH on-chain metrics\n\nETH on-chain volume\n\nOn-chain volume refers to the total value of transactions conducted on the Ethereum blockchain. In September 2023, Ethereum’s on-chain volume was around 1.5 billion, which has increased to 2.62 billion as of Nov. 10.\n\nETH on chain volume | Source: The Block\n\nThis metric is crucial as it indicates the level of activity and usage of the Ethereum network. A higher on-chain volume often suggests increased adoption and utilization of the network for transactions.\n\nGenerally, a higher on-chain volume can signify heightened investor and user interest in Ethereum, which can positively influence its price. As more transactions occur, it implies a robust demand for ETH, potentially leading to a rise in its value.\n\nETH deposited to the Beacon Chain\n\nThis refers to the amount of ETH staked in the Ethereum 2.0 Beacon Chain and the number of validators participating in the network. The staked ETH in the Beacon Chain increased from 786,000 in August 2023 to 885,000 as of Nov. 10.\n\nDeposited ETH on the Beacon Chain | Source: The Block\n\nDepositing ETH into the Beacon Chain for staking is vital for the security and operation of the Ethereum 2.0 network. More staked ETH and validators mean a more secure and decentralized network.\n\nAn increase in staked ETH and validators can boost confidence in Ethereum’s long-term stability and demonstrate a commitment from stakeholders to the network’s success, which can be a bullish signal for investors.\n\nEthereum (ETH) price prediction\n\nWhile exploring Ethereum price predictions, it’s crucial to acknowledge the inherent uncertainties in such forecasts. These predictions are speculative and subject to market volatility.\n\nAn ETH price prediction for Nov. 25 projects a value of $2,199.93, showing a 5.17% increase. For December 2024, the ETH prediction is around $3,555.88.\n\nAn ambitious ETH price analysis suggests Ethereum might reach $4,487.64 in 2023 and potentially $6,809.84 by 2025.\n\nRemember, cryptocurrency investments are risky, and market predictions can be inaccurate. Never invest more than you can afford to lose, and consider seeking professional financial advice. Stay informed and cautious, especially in the volatile crypto market."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPOWtQdFFoQUctUXd4NGtIZ1IySEdOM0xwMGpmQnA4QXBucU41eTVQUU1pY1Q3ZkVGSWxvcElwUFcySzZYeF9mVHZsRWdmOU14WlpvaTlpZ011RlJTRVc5eUhuZDhSV01xMG03RDc3Sk80YmxtczIwRHl0SVc4QjRialBNNzlCVHhQZk1GZkxmS2N5NVNqTVg1aGEzYTBIMTBOTlhucEhFakNfNER0eERKNGUtZ2todktJaXNhRGFpblBLVmtn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Arthur Hayes predicts Bitcoin to hit $1 million, Ethereum $100,000 - Investing.com",
        "content": "Arthur Hayes, the co-founder of BitMEX, has expressed a highly optimistic outlook for and , predicting that Bitcoin will eventually reach $1 million and Ethereum will surge to $100,000. His bullish stance comes at a time when both cryptocurrencies are experiencing a bear market, with Ethereum trading at $2,097 and Bitcoin at $37,083 as of today.\n\nHayes attributes his predictions to the ongoing debasement of global currencies. He believes that this economic backdrop will elevate Bitcoin and Ethereum to the status of crypto's reserve assets, setting them apart from other cryptocurrencies which he views as less significant.\n\nOn Friday, Hayes reiterated his confidence in the two leading cryptocurrencies, foreseeing a 4,669% increase in Ethereum's value. He also maintained his belief in Bitcoin's potential to hit the $1 million mark. This came after a week where Bitcoin saw an increase of seven percent in its value to $37,112.53, and Ethereum rose twelve percent to $2,058.51.\n\nHayes also sees potential in layer-one blockchains like despite their struggles during the current market downturn. He suggests they could offer significant returns but questions their ability to outdo Ethereum in areas like active developers, DApp activity, or Total Value Locked (TVL). He described these alternatives as overhyped and unlikely to surpass Ethereum's dominance.\n\nIn addition to his forecasts for Bitcoin and Ethereum, Hayes predicts a value surge in decentralized applications (DApps) and their associated tokens. While acknowledging the increased risks involved, he hints at the substantial returns they could yield for investors willing to navigate the volatile crypto landscape.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA5QlR4S25jVFk4ZXRGUE1RWGc1eERiN1R4WFZKQURoU1hJUHdZQ3BDdEFaYkt0ZXRMSXBTdExFQ01lcUFVaWtBWDVsVVNBdEN4dFZwa2lOZHprY0haYVRyX1N3MGFXN0hiQThwTlZQQ3pJbFBNMXhBeHB0NkPSAYQBQVVfeXFMTlg0RnZ2cDU1Q2JYT0RzTEY5UUlseDNSVTBMazZ3RHpEd2J0cExSbmpnUjNvUUxNV0dpUGtLVGpCdHBkZW1RN0w5VjhrRHYxSWo4T3VrdHNXY1hRQl92UDljcTJKRVFrOWFWMHdscmNfdUJSNzM1ZmQxRmZiQU1TbWJpY05s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Here We Go Again: Pet Rock JPEGs on Bitcoin, Ethereum Sell for Over $100K - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThis week, half-giddy, half-cautious optimism spread across crypto circles as Bitcoin surged past $37,000 for the first time in 18 months on excitement regarding the approval a spot Bitcoin ETF, and Ethereum pumped past $2,100 on similar news of a pending ETH ETF application from BlackRock.\n\nThere’s clearly an emergent hope within crypto that the bottom—finally—is in. But to those who protest that it could never be a true bull market without obscenely expensive, seemingly pointless JPEGs trading hands: there’s now reason to rejoice on that front as well.\n\nOn Friday, two separate on-chain images of illustrated rocks—one hosted on Ethereum as an NFT, the other inscribed on Bitcoin as an Ordinal—sold for six-figure respective sums on secondary markets.\n\nAn NFT from the EtherRocks collection, EtherRock #95, traded hands this morning for 100 ETH, or just over $209,000. Just hours prior, an Ordinal from the visually identical Bitcoin Rock collection sold for 2.99 BTC, worth just over $111,000 at writing.\n\nAD\n\nAD\n\nThe JPEGs do not come with any affiliated memberships or perks, or anything that doesn’t meet the eye. They are, quite simply, lightly illustrated images of nearly indistinguishable gray boulders that don’t even feature backgrounds.\n\nBitcoin Rock #75 has sold for 3btc on the secondary market. Congratulations to @Scobra9000 on the sale. A warm welcome to @GrantWSchneider, already a legendary collector in the ordinals community, who has now taken it to the highest level. pic.twitter.com/wkqkk8Kbn9 — BITCOIN ROCKS ◉ (@ordrocks) November 10, 2023\n\nDumb as rocks?\n\nEtherRocks first launched in 2017 to little fanfare. Only during the height of the NFT bull run, in late 2021, did the 100-piece collection catch fire—largely as a means to poke fun at the absurdity of value and the crypto market. Individual EtherRocks regularly sold at the time for hundreds of thousands of dollars a piece; one sold for the equivalent of $1.3 million.\n\nAD\n\nAD\n\n“Monetary value of art is all an illusion,” an EtherRocks buyer wrote at the time. “The pet rocks present the perfect shock value, it’s so stupid that it’s perfect. Fate loves irony.”\n\nIn January, an apparently unaffiliated Ordinals user inscribed a set of 100 images almost identical to the EtherRocks onto small denominations of Bitcoin, creating a new collection: Bitcoin Rocks. While that Ordinals collection has not enjoyed the same success as its Ethereum predecessor, it has generated five-figure secondary market sales in recent months.\n\nIn the context of recent market trends, though, Friday’s sales appear to be hitting differently. Numerous Twitter users saw the news as a harbinger of the return of the type of obscenity, absurdity, and flagrant financial foolishness that defined the previous crypto bull run.\n\nLol that scam again.\n\nWe're so back — Dr.M₳ryJ⚡I buy Shitcoins,I hold ₿itcoin ❤₳d₳ᴺᶠᵀ𓊽 (@mary_el83) November 10, 2023\n\nMembers of the crypto community appear divided about whether that’s a good thing or a bad thing.\n\nThis space never fails to amaze me — sugarspicysauce (@sugarspicysauce) November 10, 2023\n\nBut despite the return of bull market antics, crypto activity is nowhere close to the levels enjoyed when EtherRocks were last ascendent. Though Bitcoin Ordinals trading did indeed hit a six-month high earlier this week, and NFT trading volume posted its best numbers since August, those numbers still pale in comparison to the type of volume witnessed during the 2021/2022 NFT bull run.\n\nLast week’s apparently encouraging NFT figures, for example, marked a 93% decrease in trading volume from the market’s peak in April 2022. But these pricey digital rock purchases point to at least a desire for the same kind of frothy, frenzied excitement that defined that earlier era.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQSDFhZm1KRi1Yd3JaanBkMlpSeC0za0J0eGtnS0NNY1dRMktUdDV0TS0tNmxLbVpmdjc1eTdIeEt3ZFZwLVYxdmNaVjU0bnlGWlFGQ1RlU2VmQjBuOVFLbXRYaWtic3BTRWtoUUhCakNzMDA0ajdwUlU5M08zaU9xVmln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Coinbase rolls out on-chain credential verification using the Ethereum Attestation Service - CryptoSlate",
        "content": "Coinbase announced a feature on Nov. 9 that allows users to attest their account and country credentials on-chain and access additional benefits.\n\nCoinbase’s help pages indicate that issued verifications are meant to serve as a “trusted badge” that grants access to on-chain apps and benefits. Coinbase said that verification will initially provide users with a badge in Base’s Guild — the membership program for its second-layer network, Base — plus access to a private Discord channel.\n\nCoinbase added that verification will soon provide access to gasless (i.e., feeless) transactions, plus access to other participating apps on the Base network. Those upcoming apps include three DeFi platforms: Index Coop, Perennial, and Volmex.\n\nCommunity data from Dune Analytics suggests that Coinbase has issued over 9,700 attestations to more than 6,200 unique recipients since late October.\n\nCoinbase explains participation requirements\n\nThe remainder of the help page provides more details. It notes that verifications can be tied to any self-custodial Ethereum (EVM) wallet address but cannot be transferred to other addresses. A separate section notes that the verification can be associated with up to three addresses, including MetaMask and Coinbase Wallet addresses.\n\nCoinbase said that attesting one’s country of residence is optional but noted that gaining access to certain apps may be necessary. It also assured users that their information will not be published on-chain without their consent.\n\nTo verify an account on-chain, users must have a Coinbase account that is not subject to buying, selling, and trading restrictions, Coinbase said.\n\nCoinbase added that it ultimately aims to allow third parties to issue verifications using the service and expand the ways in which users can be verified.\n\nVerifications are issued through the Ethereum Attestation Service (EAS), an Ethereum community project also used by other projects, including Optimism.\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxQT25oTkVRcVhBN0x5MWZmMnVfdDk5WWZTenFqMnVWMnc5b2NER2dBRWZBUDNTTEZRT08tVDFlOTZMS0xzVnlQUTk4VGZESi1tS3Z0aU1hSlJsaFphTE04WmQ4ZjByQ2V0MFh5d3lpY0ZNbjF1VU1EZkZhdmtWWkdSS2NkWnlwWUFkWFQybE9fVmhSZGVqYUtsOUZlOWJwcmJxZE9DQzcwX3JTMzYxSERnUlF0elZmZEdBdTg1ZnpDdHNoMnNqT2ZKUzRMXzRMazd2M1FRLTVxci1oUm1NNkt0eEhYUnFreUJtbVEyWVo2RHfSAfYBQVVfeXFMUEY5TWx1ODhuTGlHaHJMM1RXMlZ3d0NYZW1aenMzdk1lWWZNYkp0Qm5uSGN4QXp3M2hPdlVpWVZPQ1oxWFpkd29hbjM1Tm4tcXplMko3ZUFDN0tKMU1qR1VVR0dlSjQ4aHgyamdoWGlmcm85dDhVVmhEUGp5aXg0aUlJeG9NUnJURTduQTNva29kdUc1OGh0eS1oT0hKMDhZc0cxcEJmQUIxdk5iNmZ2blFnUHJPbmk3ODh1MHpfUnlmSUZpQnV6ZGp1bmt5T0VLZDJjd0VMbkhURHRtTElvUGk4V2UzaUExclAweG1EWGJxN0Z0dGtB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Eighteen-months ascending triangle pattern appraises $4,000 target for ETH - FXStreet",
        "content": "Ethereum price has been consolidating along an ascending trendline for the past eighteen months, with the $2,035 level holding as resistance.\n\nThe overall price action has formed an ascending triangle pattern, which forecasts a $4,736 price target for ETH.\n\nThe bullish thesis will be invalidated once the altcoin breaks and closes below the ascending trendline at the $1,500 psychological level.\n\nEthereum (ETH) price is bullish on lower and higher timeframes alike, as token holders ride the wave of what already seems to be the making of a bull market. On the higher timeframe, however, the target objective for the largest altcoin by market capitalization looks overly ambitious, but not impossible as community members turn faces toward the exchange-traded fund (ETF) narrative and the much-anticipated Bitcoin (BTC) halving, together with their combined effect on asset prices.\n\nAlso Read: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC rages on, $40,000 may not be hopium after all\n\nEthereum price 18-month ascending triangle forecasts $4,736 target\n\nEthereum (ETH) price consolidating above an ascending triangle, combined with the effect of the formation of multiple local tops around the$2,035 level has led to the formation of an ascending triangle pattern.\n\nSuch a technical formation is created when the asset’s price lead to the formation of a horizontal line connecting the swing highs, while a rising trendline trails it from below connecting the swing lows. Together, the trendlines form a triangle, with traders watching for breakouts from the horizontal trendline. The target objective for such a technical formation is determined by measuring the height of the triangle and superimposing it at the breakout point.\n\nFor Ethereum price, the height of the triangle is around 134%, from $865 to $2,035 on the weekly timeframe. Superimposing this percentage difference on the weekly chart puts a target objective of $4,736.\n\nThe Relative Strength Index (RSI) spurs optimism, moving north to signify rising momentum while its position at 64 shows there is still more room to the north. Effectively, the Awesome Oscillators (AO) histogram bars are also flashing green to show the bulls maintain a strong presence in the ETH market.\n\nETH/USDT 1-week chart\n\nOn the flip side, profit-taking could nullify the projection by sending Ethereum price south, potentially losing the support offered by the ascending trendline at the $1,500 psychological level. This would invalid the bullish thesis."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBwZldCTVgzT3JWSGZESG81UDZTZW9jeUlZQlhvcWpkY0tKcmxRTmd2N1BRWERBOXBRb2pRV3ktYnVta1lQc3c0cWgyUmp5V01DMklYb0NqRVZubGwxS0gzMWJqSEZQZG42am80X0UydlNpVmdkUE1Ya2wtMNIBgAFBVV95cUxPbGlzUElyYUFzeG5SZUt0dHhSQ2NINXh0RDdCUW00TVp5MkRaeUZoa3pBWGR6Z1lBT240ZXZzblZmTnk3YnEwVm5SNnR3NmIwdzlLVWJET1RDMVlMSFhjMnF5YVBVOFBhV3pIdy1iSnUxQUpza1c1b0FoWmVzVzdXMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum ETF Race: Grayscale Trust's Discount Drops to 16% - U.Today",
        "content": "Advertisement\n\nGrayscale's Ethereum Trust (ETHE) has seen its discount narrow significantly, dropping to 16%. This marks a substantial change from its nearly 30% discount a month ago and close to 60% earlier this year.\n\nNate Geraci, an industry analyst, suggests that this trend could be interpreted as a gauge of market expectations regarding the approval of a spot ether ETF.\n\nCurrently, ETHE stands at an impressive $6 billion in assets under management (AUM).\n\nGrayscale's new conversion effort\n\nAs reported by U.Today, Grayscale, the leading crypto asset manager, has applied to the Securities and Exchange Commission (SEC) to convert its ETHE into a spot Ethereum ETF.\n\nAdvertisement\n\nETHE, launched in early 2019, has become the foremost Ether investment vehicle globally, accounting for 2.5% of the chief altcoin's total circulating supply.\n\nThis followed Grayscale's recent legal victory against the formidable regulator. A federal appeals court has ruled in their favor regarding their Bitcoin trust's ETF conversion application, thus adding momentum to their Ethereum efforts.\n\nConverting the trust into a spot ETF would be a significant development for the company and the crypto market. ETFs are well-known and widely used investment vehicles that are familiar to both retail and institutional investors. This familiarity could attract a broader investor base to Ether. This would enhance liquidity and potentially stabilize the market. Additionally, ETFs generally offer lower fees and greater transparency compared to trusts, making them more appealing to cost-conscious investors.\n\nBlackRock's Ethereum ETF plan\n\nIn parallel, BlackRock, the world's largest asset manager, has revealed its intention to bet big on Ethereum. Recently, the financial titan registered the iShares Ethereum Trust and partnered with Nasdaq, intending to list and trade shares of this trust.\n\nFollowing this announcement, Ethereum's price experienced a surge, reaching a high of nearly $2,150.\n\nBlackRock is also attempting to launch a spot Bitcoin ETF. Analysts believe that the SEC is very likely to greenlight such a product in the near future.\n\nLarry Fink, CEO of BlackRock, has notably shifted from skepticism to becoming a vocal crypto proponent."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMigwJBVV95cUxPaFhXTkRxcmpqbHBTOW5JSjYyWVotUjExYXI2STFvSDMzNTgwU0dkdDNkNmhwOS1GYjk3a0RCdnNvMWFhVkhXOTNfT1g2TG0xQ3g2UnJPTDExMEwwRUFfQjZGRVl6ZUF1c0Q4VG9XUDYyNjMtVTZiUUFhNzAyQVRoWTFSSUltaEp0eUxnZWRjUldzSHhNaUxOcjZFWWlvTlNZQnVnMHQxVzFMcTExZWxYcDhNXzE1Zlh4Y2tQWGdSNkNYOW9BNUZkWlpDamg3UC15WGRraHBpaW5TZkFUaWVDRVlQWTZQMXFzVk9PcGp1WDlFMGN4S1pHOTh4eHh4X21DeG1z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "NEAR Foundation and Eigen Labs partner to enable faster, cheaper Web3 transactions for Ethereum rollups via EigenLayer - PR Newswire",
        "content": "The fast finality layer will solve communication and latency issues for L2 builders while also improving usability and security\n\nLISBON, Portugal, Nov. 10, 2023 /PRNewswire/ -- NEARCON: The NEAR Foundation and Eigen Labs today announced a collaboration to build a fast finality solution that will soon power faster, less expensive transactions for Ethereum rollups, including cross-rollup transactions––a first of its kind in Web3.\n\nNEAR Foundation and Eigen Labs partner to enable faster, cheaper Web3 transactions for Ethereum rollups via EigenLayer\n\nThe NEAR Foundation and Eigen Labs teams are working together to build the first-ever \"fast finality layer\" for Ethereum rollups, which enables transactions to be processed within 3-4 seconds––rather than minutes, hours, or even days––and 4000x cheaper than the current options. This will also enable secure, low-latency cross rollup communication and solve one of the biggest challenges for founders and developers using rollups today.\n\nThis advancement will reduce liquidity fragmentation between Layer-2s through increased efficiency while also allowing them to make individual decisions around the sequencers they use to process those transactions, either on-chain or off-chain. The fast finality layer retains all Ethereum security guarantees while adding both NEAR and EigenLayer guarantees, making it an attractive option for any team building on Ethereum L2s.\n\nIllia Polosukhin, co-founder of NEAR Protocol, said: \"NEAR Foundation is proud to partner with such an excellent team as Eigen Labs to offer a fast finality layer for ETH rollups. The fast finality layer showcases the strengths of NEAR's technology while making the Open Web more usable, which has always been the core goal for NEAR. It will also help defragment liquidity for Ethereum rollups and make all of Web3 more interoperable as a result.\"\n\nSreeram Kannan, founder of Eigen Labs, said: \"We are thrilled to partner with the highly innovative team behind the NEAR protocol. This is a mutually beneficial partnership that will leverage both NEAR and EigenLayer's technologies to make it easier, faster, and cheaper for developers to build on Ethereum.\"\n\nFor EigenLayer, this collaboration will provide fast settlement for cross-rollup transactions and showcases adoption of restaking across the Ethereum ecosystem and beyond. For NEAR, the collaboration will also extend to transitioning the NEAR-Ethereum Rainbow Bridge to an actively validated service (AVS). This will create a better bridging experience between NEAR and Ethereum. Transactions will reach finality faster, with stronger security guarantees and decentralization.\n\nBowen Wang, Director of Protocol at Pagoda, the NEAR ecosystem team building the fast finality layer, said: \"Pagoda is proud to work with Eigen Labs, a world-class team, to cobuild the fast finality layer. This solution improves the composability with Ethereum L2s and reduces liquidity fragmentation within the rollup ecosystem.\"\n\nA testnet is expected to launch in Q1 2024, and more details will be shared around that time. For the latest news from NEAR Foundation or EigenLayer, please check our websites, follow us on social, or join our communities:\n\nNEAR Foundation website: https://near.foundation/\n\nNEAR Foundation X/Twitter: @nearprotocol\n\nNEAR Foundation Telegram: @cryptonear\n\nEigenLayer website: https://www.eigenlayer.xyz/\n\nEigenLayer X/Twitter: @eigenlayer\n\nEigenLayer Telegram: @eigenlayer\n\nAbout NEAR Foundation\n\nThe NEAR Foundation is a Switzerland-based non-profit foundation whose mission is to enable community driven innovation to benefit people around the world. One of its core areas of focus is the NEAR ecosystem, which includes a fully operational decentralized Blockchain-based platform for building decentralized applications.\n\nNF carries out its mission, primarily through the allocation of support and resources to other nodes in the near ecosystem, rather than via direct intervention or operations.\n\nNF's ultimate goal is to minimize its own scope and footprint by continuing to divide functions and resources to the ecosystem; and support the development of decentralized infrastructure necessary for those ecosystem functions to operate in a self-sufficient manner. For more information visit the website , follow us on social, or join our communities:\n\nNEAR Foundation X/Twitter: @nearprotocol\n\nNEAR Foundation Telegram: @cryptonear\n\nAbout Eigen Labs\n\nEigenLayer provides developers with access to the Ethereum staked capital base and decentralized validator set. Access to this trust network can make previously impossible mechanism designs possible.\n\nMedia contacts:\n\nGeorgia Hanias\n\nNEAR Foundation\n\n[email protected]\n\n+44 (0) 7812211403\n\nSOURCE NEAR Foundation"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQR0swZzg2MVoxcnREeE0wbVU4Y2hwdFJGZlJINVlGTVZ4Zkc4SWxvY1AzYWpPM2RHOFBXWko5R0Z4a0V2N1hIZDdJV1gxQXk1TlY3WHlremEzR0hfeGdaUlZ2X3lYWWduaFNZdG1meHRUVGlXZU1DeW02TUdVS2hjM1BNX3duVUpOQ29GVG1WYUVkYy1xaEhPMHd1a3lDOHkwMTRhYkZDa3NoaDIyZzgtTGs5NHJkU3Vtc3BiR1djLV80dUhsN2RN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Peter Brandt Predicts Bitcoin to Hit $43,289, Also Identifies Rising Wedge on Ethereum Chart - The Crypto Basic",
        "content": "Bitcoin (BTC) is on track to clinch a $43,289 price amid the formation of a pennant, as disclosed by veteran analyst Peter Brandt, who also called attention to a bearish rising wedge for Ethereum (ETH).\n\nBrandt made these disclosures in two separate analyses of the two largest crypto assets in the market. In a recent Bitcoin analysis, the analyst highlighted the formation of a pennant pattern on the BTC daily chart amid the ongoing uptrend.\n\nBitcoin Forms Bullish Pennant\n\nA pennant during an uptrend is a bullish continuation pattern. It features converging trendlines forming a small symmetrical triangle, preceded by a flagpole, which reflects the previous price surge. This pattern suggests a brief consolidation before the previous upward trend is likely to resume.\n\n- Advertisement -\n\nThe flagpole of the current pennant formed when Bitcoin staged a rally from the $26,555 low on Oct. 12. The rally saw BTC appreciate to $35,280 on Oct. 24, marking a massive 33% increase in less than two weeks. Although Bitcoin has retained its upward trajectory, the momentum has reduced, leading to the formation of the pennant.\n\nWhen a pennant forms, analysts view it as a brief pause to the rally, preceding a continuation of the bull run. According to Brandt, to gauge the extent of the next price rally, market participants should measure the height of the previous price rally that formed the initial flag pole, from the lowest to the highest point into the pennant.\n\nAccording to him, they can then project this same appreciation rate for the next surge, starting from the last small reaction inside the flag. Using this technique, Brandt projects that Bitcoin could appreciate $43,289 in the following price run after breaking out from the flag.\n\nEthereum Forms a Rising Wedge\n\nWhile Bitcoin could see a potential rally, Ethereum finds itself in a bearish pattern. Notably, ETH recently formed a rising wedge on the weekly timeframe, as highlighted by Brandt in a recent post on X.\n\nMarket watchers typically consider a rising wedge a bearish reversal pattern. It forms converging upward-sloping trendlines, indicating a tightening range between highs and lows. The pattern signals that the upward momentum is weakening and that a potential trend reversal to the downside may occur.\n\n- Advertisement -\n\nNotably, the rising wedge formation began in June 2022 when ETH slumped to a low of $881 following the Terra collapse in May. The asset registered a comeback, eventually recovering its lost value. However, amid the recent uptrend, a slowdown has resulted in the formation of the wedge.\n\n“It will be interesting to see if this market can expand beyond this pETH of pie,” Brandt said on X, calling attention to the bearish structure.\n\nPeter Brandt’s statement appears to be a play on words, referring to a portion of the Ethereum price chart within the rising wedge pattern. Brandt’s words suggest that the analyst is watching to see if Ethereum’s price can break out of the pattern and surpass the upper boundary of the wedge.\n\nMeanwhile, Ethereum seems to be seeing gains in the short term, while Bitcoin is currently down. ETH is up 7.12% over the past 24 hours, currently trading for $2,080. However, BTC is changing hands at $37,100, with a 1.50% decline within the same timeframe."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxOVWN6ZExrX2l4Q1dGNktzczdFUGdmMjFhWW14MzBza2RoZ2FMWnYxM3RNbW1qcV9ZbGZJOHY5eFQyVkRFbTQxWlE2MUw0c2toOXhOcjJBTnJsODVyeFNKUXFYTmNCWHZKSFBadDJ1cllNQzlmSWg0eHJGb0RNNEZuX2U0VUN0NVlmcDA2TFdycWo5Qlo1bjdtOUZwTnZURlRkN1M1UXZ6eExlVl9ZWG1mNVJvWjdtYjJvSExvSlQyaDI5VEdVWmhpenRzN2_SAdIBQVVfeXFMTWFUaEtmb0JLcFNqQWNkLUR2TFZDRkVXRG1ReGZFNHVVMGo3LWNIWHlWMEVpbkZ5RTNyT2Ixc3lzbVBoS2MtWHkzcnZCN2pLaGJPUFIyeDR2dVZ2UFJOdmVVOGJNNTYyVVUyamdHMWRNeDZkYmhpYUVfQVNQb3dIaDRYS3hLNlJkTnlwbkFrWTEyblNiS2RwZFF1dWl3bndkcGtxVU1hT0RPTnVBZzB2S0kxemFrN255dmdiT2V1Zk5UR2VYX1h4RFRLZXMyYkRfajJ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Arthur Hayes Says Ethereum Could Explode by Over 4,600%, Doubles Down on $1 Million Bitcoin Prediction - The Daily Hodl",
        "content": "BitMEX co-founder Arthur Hayes is doubling down on his massively bullish Bitcoin (BTC) predictions while forecasting that Ethereum (ETH) could hit a six-figure price.\n\nHayes says that the time to turn bullish on crypto is “now” while unveiling a target of $100,000 for Ethereum – an increase of about 4,669% from the current level.\n\nThe BitMEX founder also reiterates his prediction that Bitcoin will hit $1 million.\n\nIn a new blog post, Hayes further says that as currencies debase across the globe, the “smartest trade” would be “going long crypto.” According to the BitMEX founder, Bitcoin and Ethereum are “crypto’s reserve assets” while “everything else is a sh*tcoin.”\n\nBesides Bitcoin and Ethereum, Hayes says there are other opportunities that exist in the crypto space offering the potential of higher returns at a greater risk.\n\n“Then, we get to other layer-one blockchains that claim to be an improvement on Ether. Solana is an example. These all got beaten up real bad during the bear market. As such, they will levitate off extreme lows and provide great returns for intrepid investors. But, they are still all overhyped, me-too, pieces of sh*t that won’t overtake Ethereum in terms of active developers, decentralized applications (DApps) activity, or Total Value Locked.\n\nFinally, all manner of DApps and their respective tokens will pump. This is the most fun, because down here is where you get the 10,000x returns. Of course, you’re also more likely to get rugged, but where there is no risk there is no return.”\n\nEthereum is trading at $2,097 at time of writing while Bitcoin is worth $37,083.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQclRQeVdiT3V5U3M2ZzVrTmZoY0k3c0pQY0x3bmN2UFF4SWMybHgwclVicFYzeUJmc1E4UWl1M1lQV1dMZjI5a3Qtb1YxOTI5UENLcUlNSGp0a2ZnRFJ2Z3czS0xyX3hkWGE4RmdhaGdubWlnVkVDYUl1VllPVld2S2dZaGkyeEFYRC1vOU96Q1czQ3hj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin price will continue dwarfing Ethereum, analyst says - crypto.news",
        "content": "Into The Cryptoverse CEO Benjamin Cowen recently discussed Ethereum’s (ETH) performance in relation to Bitcoin’s (BTC) dominance as the flagship digital asset.\n\nIn a recent YouTube video, Cowen suggests a continued rise in Bitcoin dominance (BTC.D), indicating that Ethereum may lag behind and show smaller gains compared to BTC.\n\nCowen explains that his crypto portfolio has predominantly held more Bitcoin because he anticipates that BTC will outperform numerous assets, though not all.\n\nAdditionally, Cowen notes that Ethereum against Bitcoin (ETH/BTC) is encountering substantial resistance after falling below the trendline and attempting a retest.\n\nYou might also like: Bitcoin and Ethereum outperform traditional assets in 2023\n\nA BTC rally would result in the breakdown of Ether-Bitcoin, he explained. He pointed out how the ETH/BTC pair finally broke the wedge to the downside, highlighting that it’s akin to what happened in the last cycle.\n\nAs he connects the dots, the Ether-Bitcoin pair is potentially backtesting the trendline that served as support in October 2022, March 2023, June 2023, and September 2023. Since the ETH/BTC pair is now testing from beneath the wedge in November 2023, it could offer a significant resistance level.\n\nHowever, Cowen cautions that even if ETH/BTC manages to move above the trendline, the pair will encounter several resistance levels to the upside. These levels must be successfully flipped as support to convincingly reverse the downtrend.\n\nHe further explained, stating that, there are numerous resistance levels. Whether one opts to depict them horizontally or analyze them differently, ETH/BTC still faces a significant challenge. It must have to overcome these resistance levels to indicate a meaningful reversal.\n\nAt the time of writing, ETH/BTC is valued at 0.05578 BTC, equivalent to $2,068.80 on Tradingview. Meanwhile, BTC/USDT is valued at $37,112, according to Coingecko.\n\nETF expectations\n\nThe recent surge in Bitcoin and Ethereum has significantly influenced the cryptocurrency market.\n\nBitcoin has reached $37,000, marking highs not seen since May 2022. This may be driven by the ongoing expectation that U.S. regulators approve a spot Bitcoin exchange-traded fund (ETF).\n\nSimultaneously, Ethereum has rallied close to $2,100, reclaiming the $2,000 level for the first time since mid-July. The rise in digital assets, especially XRP, may also be attributed to Bitcoin surpassing $35,000.\n\nAdditionally, news about BlackRock planning to file for an ETH-based ETF may have also fueled Ethereum’s upward momentum.\n\nFollowing the anticipation of the ETF approval, which has propelled cryptocurrency prices and related stocks, This rally could be part of a broader uptrend in the crypto sector, recognized as a significant $17.7 trillion opportunity by market strategists.\n\nHowever, altcoins like XRP, DOGE, UNI, and XLM have experienced declines, possibly due to a pause in capital rotation towards smaller tokens.\n\nFed chair Jerome Powell recently delivered a policy address to the Economic Club of New York, providing insights into the current state of the US economy and monetary policy.\n\nThis statement is significant given the critical juncture of the U.S. economy, marked by improving inflation figures alongside surging Treasury yields, creating conflicting signals about the direction of monetary policy.\n\nInterpreted as a signal, Powell’s statement suggests that the Fed might persist with its tightening cycle, contrary to recent market expectations of a more dovish approach."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxQamFPQ1Z4S0pFTFFieXdCaUE0cDVrM3pmSnlaUVpCLWpWWGNzVWFILUgtckxaVFRfZldhUWt3TGNSenVOVEduVy13VmpvT244bmFVMWVsdWxSZnNGMnY2RnJoc0NoODJ3WU5adlRhb1VLSkJnNUtDNy1tcEFrdk5JSjg5QS03QnBZUUYyNkFXLV9vTHAzcWNlQ2dfVkJhN1RETkhKT3NhOU5PUmpIWlAxa3V0QW55S3UzZFFoX2NpeHd4OXJFY2pXbGRUc1BSVFRRYlJxb2FSdWkxcVRDNkdZRy1nV2VaZ29xdnfSAe8BQVVfeXFMTXo0MWZUWnE0VTI4Y3d0Vk1oQTdwTHFpVWVPaThHOERiLW5Nei1WRHlvaHZ0SkQ4cWdFb2NrbGZjbTFaUGxBLXF4Um05MnhUM3hBbjBxTHp4MHpLa3kwNlEyLWR3Q3VnZy0tSjQxZWZkRGgxU0RlZllOY1pia013alNkN2NidHg5UDhXZ2RHMlVCN1RLZjBlTnNvMF9ZYkpFNHZPUWdCdUJHNmRSWGhEOS1iaC0ybWZLTGhVaUktVnFvRGNQV2Y3Rk10UGlmUFl5YW5PYkhUcEV4SXJIZXhLUTNqbzFJN0VMWnNsS19HZ0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC rages on, $40,000 may not be hopium after all - FXStreet",
        "content": "Bitcoin (BTC) price is trading with a bullish bias on Friday, bringing the broader market with it, save for Ethereum (ETH) and Ripple (XRP) prices. Both ecosystems are choosing to pursue narratives on their own respective paths.\n\nFor ETH, the spot Ether exchange-traded funds (ETF) narrative is driving its price action, while the XRP market is navigating the waves of regulatory pressure with the ongoing tussle with the US Securities & Exchange Commission (SEC).\n\nAlso Read: BTC rallies to $37,900, fuels bullish outlook among Bitcoin traders\n\nBitcoin, altcoins, stablecoins FAQs What is Bitcoin? Bitcoin is the largest cryptocurrency by market capitalization, a virtual currency designed to serve as money. This form of payment cannot be controlled by any one person, group, or entity, which eliminates the need for third-party participation during financial transactions. What are altcoins? Altcoins are any cryptocurrency apart from Bitcoin, but some also regard Ethereum as a non-altcoin because it is from these two cryptocurrencies that forking happens. If this is true, then Litecoin is the first altcoin, forked from the Bitcoin protocol and, therefore, an “improved” version of it. What are stablecoins? Stablecoins are cryptocurrencies designed to have a stable price, with their value backed by a reserve of the asset it represents. To achieve this, the value of any one stablecoin is pegged to a commodity or financial instrument, such as the US Dollar (USD), with its supply regulated by an algorithm or demand. The main goal of stablecoins is to provide an on/off-ramp for investors willing to trade and invest in cryptocurrencies. Stablecoins also allow investors to store value since cryptocurrencies, in general, are subject to volatility. What is Bitcoin Dominance? Bitcoin dominance is the ratio of Bitcoin's market capitalization to the total market capitalization of all cryptocurrencies combined. It provides a clear picture of Bitcoin’s interest among investors. A high BTC dominance typically happens before and during a bull run, in which investors resort to investing in relatively stable and high market capitalization cryptocurrency like Bitcoin. A drop in BTC dominance usually means that investors are moving their capital and/or profits to altcoins in a quest for higher returns, which usually triggers an explosion of altcoin rallies.\n\nBitcoin price eyes $40,000 with BTC bulls still in play\n\nBitcoin (BTC) price remains on a bullish streak, with the latest breakout sending the king of cryptocurrency out from above the boundaries of an ascending parallel channel. Depending on how the bulls play their hand, BTC could realize more gains as $40,000 is now in sight.\n\nIncreased buying pressure from the bulls could see Bitcoin price extend to clear the range high at $37,972. In a highly bullish case, the gains could extend to the desirable $40,000, with the move constituting a 7% climb above current levels.\n\nThe Relative Strength Index (RSI) remains northbound despite BTC being massively overbought, hinting at a possible continuation of the trend as momentum continues to rise. Bulls have a strong presence in the BTC market, indicated by the position of the Awesome Oscillator (AO) and the Moving Average Convergence Divergence (MACD) in positive territory, which adds credence to the bullish thesis.\n\nBTC/USDT 1-day chart\n\nConversely, increased selling pressure could pull Bitcoin price back into the fold of the ascending channel with the possibility of losing support due to the midline of the channel at $35,500. A break and close below the lower boundary of said channel could see Bitcoin price spiral to the $31,190 level, where the bullish outlook would be invalidated.\n\nNotably, the MACD crossing below the signal line while both bands are above the midline is a warning sign, suggesting a possible sell signal as longs close their positions.\n\nAlso Reads: Bitcoin Weekly Forecast: BTC crashes ahead of ETF approval window, but bull run is not under threat\n\nEthereum price confronts $2,139\n\nEthereum (ETH) price is confronting the $2,139 resistance level, a formidable barrier that could mark the transition of ETH to the side of the fence last tested in May 2022, prior to the collapse of the Terra (UST) ecosystem. The AO is in positive territory with its histogram bars flashing green to show the bulls are in the front row seats.\n\nA break and close above the $2,139 resistance level would set the Ethereum price on a path to more gains, starting with clearing the range high at $2,141.\n\nETH/USDT 1-day chart\n\nOn the flipside, the RSI position above 70 shows ETH is massively overbought. Its deviation south shows momentum is already falling. Both of these stances threaten the upside potential for Ethereum price.\n\nIf seller momentum increases, Ethereum price could fall back into the supply zone, which extends from $1,861 to $2,004. A break and close below its midline at $1,935 would confirm the continuation of the downtrend.\n\nAlso Read: Ethereum price breaks past $2,000 as BlackRock hints at filing for spot Ether ETF\n\nRipple price could slump further after losing $0.66\n\nRipple (XRP) price could shed more ground after losing critical support at $0.66. The RSI is showing that momentum is falling fast. The RSI has already called two sell signals, first crossing the signal line to the downside and second slipping below the 70 level. The overall bullish outlook will be invalidated once the price breaks and closes below $0.59.\n\nXRP/USDT 1-day chart\n\nConversely, if sidelined investors join the party, Ripple price could pull north, restoring optimism above $0.66. However, to confirm the continuation of the uptrend, XRP must break and close above $0.79.\n\nAlso Read: XRP price extends losses as Ripple CEO Garlinghouse calls Gensler's SEC a “political liability”"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1vM190Nml1T1BSa05nLVBBUWhERFlXU3pENGM4YzF4YUJNV05ITXlHUVhaZ3dkZXdJV3Z2Q1B0S0RjNnhHNmc1aFVNVURWa0IwZUlORFM4NkU1SzRzRm1mZjltVW1oTmhJVG5WMWs5U3ZoVGktTXd4WFRmeVBpM2M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "USD price of Ethereum (ETH) at annual highs - The Cryptonomist",
        "content": "Since Bitcoin’s price rose above 32,000 in late October, it has continuously set new annual records. Ethereum (ETH), on the other hand, has not.\n\nYesterday it suddenly woke up, and in a single day it rose from 1,900 USD to over 2,100 USD, coming close to a new annual record.\n\nTo be fair, the highest price Ethereum has touched in this 20203 remains that of 16 April, when it also surpassed 2,140 USD, while yesterday it stopped just above 2,130 USD, but today it looks like it could surpass even these levels and perhaps set a new annual high.\n\nThe reasons for the boom in the price of Ethereum (ETH) in USD\n\nThe reason for the boom this time is very easy to identify.\n\nIn fact, yesterday news came out that BlackRock had registered an Ethereum Trust in Delaware, and at that point the price of ETH started to rise.\n\nJUST IN: 🇺🇸 $9 trillion asset manager BlackRock registers Ethereum Trust in Delaware. — Watcher.Guru (@WatcherGuru) November 9, 2023\n\nActually even before that news was made public the price of ETH had already risen from under $1,920 to over $1,940, but that was a minor movement. Instead as soon as the news was made public it sprang to nearly $2,050 within half an hour.\n\nThe speculation at that point was that BlackRock was preparing to file an application with the SEC to issue an ETF on spot ETH as well, and that confirmation came a few hours later.\n\nJUST IN: $9 trillion asset manager BlackRock officially files for Spot Ethereum ETF with Nasdaq. — Watcher.Guru (@WatcherGuru) November 9, 2023\n\nAt that point the price went back up, rising from $2,040 to $2,130 within an hour and a half.\n\nThe missed annual record\n\nIn theory yesterday there would have been every reason for Ethereum‘s price to set a new annual record.\n\nInstead, although it really came very close, it failed to break April’s $2,140.\n\nIt is possible that this is because that 2,140 USD has become a real resistance, since everyone who has bought ETH in 2023 is in profit at that figure.\n\nIn other words, it is possible that many of those who bought ETH this year with the specific purpose of speculating on it are selling at that figure in order to monetize gains over the medium/short term.\n\nIt should not be forgotten that it was since July 15 that the price of ETH had been steadily below 2,000 USD, and at that point for short-term speculators to sell at a figure above 2,100 USD is an opportunity to be taken advantage of.\n\nFuture trend\n\nIf the price of Ethereum were to react to the news of BlackRock’s ETF in a similar way to that of Bitcoin we could expect a period of stagnation, or even a retracement, followed in a while by renewed growth to new annual highs.\n\nHowever, in recent months Ethereum’s price trend has diverged somewhat from Bitcoin’s, so it is hard to imagine that it could really replicate such a similar trend.\n\nOn the contrary, the fact that after surpassing 2,130 USD yesterday the price of ETH then fell all the way below 2,100 USD, but only to rise again above 2,130 USD, makes one believe that today it might have the strength for one last leap even above 2,140 USD, so as to make new yearly highs already immediately.\n\nMoreover, since yesterday all crypto markets have been in positive territory, and the decidedly positive mood these days could help. However, one should not make the mistake of believing that it will only go up from here on, because a retracement is always possible.\n\nThe comparison with Bitcoin\n\nThere is also another decidedly interesting fact.\n\nYesterday, before the ETH boom, it was Bitcoin that had made a small boom, with the price rising in a very short time from about $35,000 to almost $38,000. Later the ETH boom took some interest away from BTC, so that its price dropped to around $36,000.\n\nPrior to the ETH boom there had been new highs in the ratio of BTC to ETH even since May 2021, about two and a half years ago.\n\nIn fact, yesterday the ratio of Bitcoin’s market capitalization to that of Ethereum had risen to 3.07 times, and between 2 and 3 in November it was as high as 3.15 times.\n\nThe previous record for the past two and a half years was in June last year, after the implosion of Terra/Luna and the failure of Celsius, also at 3.15.\n\nSuffice it to say that in September last year, when there was the Merge of Ethereum with the move to Proof-of-Stake, it had also fallen below 1.9 times.\n\nMoreover, even as recently as early October this year it was below 2.6 times, but starting on 4 October it began to surge until it hit new records for the past two and a half years in early November.\n\nYesterday, however, it suddenly fell to 2.8, undoing in this respect all the gains made in the second half of October.\n\nIn other words, the news of BlackRock’s ETF rebalanced the balance of power between Ethereum and Bitcoin."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE5hbmFrTXVVUHd5TjhDdFNnRFZTVmZmQnB4c3RQM1pYRHlKbUVyWXdPdkZUTkFmTVdIczk2WDlwNHNtMEtPZU9wMklreVB1MDFKQ0NkN3lqX0lXX0JsclE4RHVqSmQxWWFI0gFuQVVfeXFMTUlJOEd6SEp1QVNtOFVDSWZIaEZrdGxlamFRNkx4eWpJMmhhMld4RzFkdFRwMk1GSnM3MC0tODVFSVJmaWFST2lyTmNEdWtVcEdYUFdaVnh6RERIZkU4bUNWM3ZzZnBpYnYtRzVUWHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Micro Wallets Hit 100K: Santiment - U.Today",
        "content": "Advertisement\n\nEthereum's micro addresses holding less than 0.1 ETH have surpassed the 100,000 wallet mark for the first time, according to data from Santiment.\n\nThis milestone highlights the growing adoption and diversification of Ethereum holdings, even as larger wallet categories, including those holding between 0.1-10 ETH and over 10,000 ETH, also see an uptick in numbers.\n\nOwnership distribution\n\nWhales, or large holders of Ethereum, currently account for a 32.94% concentration, holding about 40.83 million ETH, according to data provided by IntoTheBlock.\n\nSmaller investors boast combined holdings that account for 12.48% of the market, equivalent to 15.47 million ETH.\n\nAdvertisement\n\nThe recent trends in Ethereum's address holdings indicate a growing interest from small-scale investors (as evidenced by the increase in the smallest wallet categories).\n\nIn contrast, larger wallet categories are experiencing a decrease, suggesting a strategic redistribution or liquidity-seeking behavior\n\nThe BlackRock ETF hype\n\nAdding to the excitement in the Ethereum market is the news that asset management behemoth BlackRock plans to launch an Ethereum exchange-traded fund.\n\nThis move is widely speculated as a precursor to filing for an Ethereum-based exchange-traded fund (ETF). Following BlackRock's registration of the iShares Ethereum Trust, the price of Ethereum soared above the $2,000 level, marking its highest level since April.\n\nThis development echoes a similar pattern observed earlier in the year when BlackRock registered a Bitcoin trust, followed by a proposal for a spot Bitcoin ETF."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNV0JINU5FeEN4R1FMLWh3NnpKd0FsYUxjOGdrSDJDbDVUS3BfRlY4OFJjUFZBR193eTdENG5kLUMxdDFyUm5DVzhOa1hLeE94U1lzakRuYXpFaVhuRTJUbk1EOWVsb0x3dDJSR3ZwQjdfU2JkczNhUEttR19xV1RiXzlfenUyeGpJOGEyb3cwdE40N2luOXVYdEVWOVpsc3lB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Expert Says XRP Community Was Right About ETHGate Allegation - The Crypto Basic",
        "content": "Crypto media analyst Joshua Jake has thrown his weight behind XRP community members, stating that they were correct in their allegations about Ethereum.\n\nIn an X post yesterday, Jake said XRP community members were right about the ETHGate scandal. Surprisingly, he emphasized that the ETH Gate scandal could be bigger than FTX’s.\n\nNotably, “ETH Gate” is a theory alleging that Ethereum officials established close relationships with insiders of top government agencies, especially the SEC, to provide a favorable regulatory environment for the cryptocurrency.\n\n- Advertisement -\n\nETHGate Echoes Feds Controversial Formation\n\nAccording to Jake, the ETH Gate scandal echoes the controversial formation of the United States Federal Reserve in 1910. At the forefront of the scandal is the relationship between former SEC officials – Jay Clayton and Bill Hinman – and Ethereum, Jake said.\n\nThe crypto analyst said evidence suggests that Consensys, a blockchain company owned by Ethereum co-founder Joseph Lubin, lobbied the SEC for the “ETH free pass speech.”\n\nRecall that Hinman, in his infamous speech in June 2018, declared BTC and ETH as non-securities. Jake pointed out that the Hinman speech spotlights regulatory favoritism, emphasizing that other crypto projects faced massive crackdowns for conducting an initial coin offering (ICO) similar to Ethereum.\n\nSEC Bias Could Undermine Its Credibility in Crypto Regulation\n\nThe analyst highlighted Ripple as one of the recipients of the SEC’s crackdown. He stated that the Ripple lawsuit sheds light on the potential conflicts at the SEC, indicating the regulator’s contrasting treatment of ETH and XRP.\n\n“Why the disparity? Ethereum gets a regulatory nod while Ripple faces a lawsuit,” Jake remarked.\n\n? 4/5 Why the disparity? Ethereum gets a regulatory nod while Ripple faces a lawsuit. It's a tangled web of interests with SEC officials linked to Ethereum's allies. This bias has significant implications for the SEC's role and credibility in crypto regulation. pic.twitter.com/uWAd0RDJHV — Joshua Jake (@itzjoshuajake) November 8, 2023\n\n- Advertisement -\n\nFurthermore, Jake added that the SEC’s bias could undermine its credibility in regulating the crypto industry.\n\nPro-XRP Lawyer Reacts\n\nReacting, pro-XRP lawyer Bill Morgan said the expert contrasted SEC’s regulatory favoritism to Ethereum with its enforcement actions against Ripple.\n\nAttorney Morgan raised a pertinent question, asking how long the market would take to correct the distortion created by the SEC enforcement action.\n\nYou contrast the regulatory favouritism shown to Ethereum with the harsh treatment the SEC directed at other ICOs and its (arbitrary) or ill-motivated decision to sue Ripple. Whether it was an intention to create a monopoly for Ethereum or give it a big head start (the Ripple… https://t.co/NQ6hVK8BJO — bill morgan (@Belisarius2020) November 9, 2023\n\nSEC Actions Helped ETH Secure Second Spot\n\nHe emphasized that the distortion helped Ethereum to secure the second spot in the global crypto ranking over better competitors.\n\nNotably, before Hinman gave the infamous speech, both ETH and XRP were in a tight contest over which crypto asset would rank as the second-largest crypto by market cap.\n\nAt press time, ETH is ranked second, with a market cap of $252.43 billion. However, XRP stands as the third-largest crypto asset with a valuation of $86.53 billion.\n\nEthereum Corruption Is Bigger Than FTX\n\nMeanwhile, Jake’s remark comes hours after Steven Nerayoff, a prominent crypto adviser, alleged that Ethereum’s corruption is 1000x bigger than the ones committed by FTX founder Sam Bankman Fried (SBF).\n\nThe crypto adviser alleged that Ethereum co-founders Joseph Lubin and Vitalik Buterin had secret dealings with corrupt government officials, including SEC chair Gary Gensler and former chairman Jay Clayton.\n\nEthereum is the fraudulent elephant in the room in plain sight 1000x bigger than SBF. Joe Lubin & Vitalik Buterin have been the front with corrupt officials at the highest levels of federal agencies such as Clayton, Gensler & many others. Cover this now. — Steven Nerayoff (@StevenNerayoff) November 2, 2023"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQbUF5Z0pQSHlvNC1Cc1RkdS1mRVdzdUZBNDJLNF9ZVXFZaGdnTlktUVNjRlJLZmdkZUh2a0p5RVhXMlZKSjFrMGNrX0dTcUdocjc3bVRGWGQzNFBfcjlEN1Nqekxtb1U2c3NfWTVCNG05RkZhNzVTWk5hbFFPdU4wSXlNVTE4QURSeHpWQ1NRaVlEYUNXRG15cWRfamw5TWdXakc0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "BlackRock files for spot Ethereum ETF on Nasdaq as ETH exceeds $2,100 - CryptoTvplus",
        "content": "Asset management giant BlackRock moves forward with plans to launch an exchange-traded fund (ETF) for Ethereum. In a filing with the Nasdaq stock exchange on Thursday, BlackRock stated its proposal for an “iShares Ethereum Trust.” BlackRock plans an ETF that allows investors to invest in Ethereum through the stock market.\n\nFollowing the news of BlackRock’s application, Ethereum’s price skyrocketed more than 9%. According to CoinGecko, Ethereum has not experienced a threshold like this since April. The last time ETH was this high was in May 2022. This followed a crash that started in November 2021. ETH’s price is now up more than 30% for the month and 85% over the past year.\n\nBlackRock’s filing for an Ethereum Spot ETF follows a registration for an Ethereum trust in Delaware. Analysts say this could indicate plans to seek regulatory approval for the ETF\n\nAn Ethereum spot ETF would allow retail investors to gain access to a highly liquid cryptocurrency market. Moreover, it would allow for potential billions of dollars of new investment if it’s approved.\n\nBlackRock plans to offer an ETF with the ticker “ETH” that tracks the price of Ethereum held by a trust sponsored by iShares.\n\nIn June 2023, BlackRock applied for a Bitcoin Spot ETF with the SEC. The application included an investment management partnership with Coinbase, a major cryptocurrency exchange. BlackRock hoped to offer exposure to Bitcoin without the need to buy or hold it directly. However, the SEC has not yet approved the ETF.\n\nIt’s unclear when BlackRock will formally apply to the SEC for approval of the ETF, seeing that the SEC previously rejected proposals for spot Bitcoin ETFs, citing manipulation concerns.\n\nWhile the SEC has rejected applications for Bitcoin spot ETFs, it has approved Bitcoin futures ETFs. It also recently allowed Ethereum futures ETFs to trade. This could indicate a more welcoming stance toward crypto ETFs.\n\nRead also: CEO of NYM discusses how NYM Mixnet will transform online privacy"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiUkFVX3lxTE5YTjFMUkd4SzJaZEhlNEpuem9oRjFkWVI5UDZuU0Y1b0dpUHBVQUxtUUlEZFJNOUpMNW45b2RfY0NZX0JGMURKbkU3RjBLY2tfUFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "What is OmiseGO? A comprehensive beginners guide - CoinCentral",
        "content": "OmiseGo is an Ethereum L2 launched in 2017 and founded by Omise, a venture-backed payment services company operating in Thailand, Japan, Singapore, and Indonesia.\n\nOmiseGO (OMG) is a white-label eWallet, smart contract platform and ERC-20 token (the Ethereum code standard). OMG uses a proof-of-stake (PoS) algorithm and has a total supply of 140,245,398 with a current circulating supply of 140,245,398 OMG– yes that’s right, OMG currently has all of its hard cap in circulation, and no new tokens are planned to be issued. OMG was designed to function as a decentralized bank, exchange, and asset-backed blockchain gateway. OMG’s ultimate goal is to be a “preeminent high-value exchange and settlement platform”. Think of a decentralized Ripple + universal remittance bridge to interconnect fragmented payment processors, legacy rails, and decentralized blockchains.\n\nThis means helping the unbanked get banking services (through their open-wallet infrastructure) and facilitating unprecedented interchangeability between the many siloed legacy rails (ACH, VISA, Paypal) and decentralized blockchains (like Ethereum). This could even potentially include more obscure assets like airline miles or loyalty points.\n\nOMG is based on ERC-20 which defines recognized smart contract code functions across the Ethereum ecosystem\n\nThe OmiseGO Team\n\nIn a November 2023 tweet, the OMG account claimed the original team has “moved on” leaving the token to be completely governed by the token holders.\n\n$OMG token is listed on over 130 exchanges and has over 700K holders. The original team has moved on, making it possible for OMG to become the only L2 that is 100% governed by the token holders. — OMG (@omgnetworkhq) November 14, 2023\n\nThe original OmiseGo team was described as “Fintech Rockstars” by Forbes in a now-deleted profile.\n\nOmise contributed $100,000 in funding to the Ethereum foundation’s DEVGRANTS which is a program to help new Ethereum-focused projects, develop the code bases and implement community evangelism. This indicates their commitment to the Ethereum ecosystem as a whole.\n\nThe original OMG Advisory board is notable, including Ethereum consensus-algorithm braniacs such as Vitalik Buterin, Gavin Wood (Polkadot), Jae Kwon (Cosmos), and more.\n\nFinal Thoughts: Is OMG Network Still Relevant?\n\nWith so many new Layer-2s storming the scene since OMG’s launch in 2017, OMG Network appears to have faded into the background music. However, it’s still a project worth keeping an eye on– its entire token issuance is currently circulating in markets, and governance is in the hands of the tokenholders.\n\nOMG holders earn tokens for validating transactions via a Proof of Stake (PoS) model\n\nThe OMG wallet application will also hold OMG tokens, which are a critical part of confirming blocks as valid and adding them to the blockchain. Keeping X amount of OMG tokens “buys” you the right to confirm blocks.\n\nEvery transaction on the OMG blockchain will require a transaction fee, that transaction fee will be distributed among OMG holders as a “stake”. The more coins held in the wallet the more fees you will receive proportionally.\n\nOmiseGo is the first implementation of Plasma, an Ethereum scaling solution co-developed by Joseph Poon (Lightning Network co-founder) and Vitalik Buterin\n\nA big challenge that faces not only OMG but all digital currencies is the number of transactions the network can handle. As seen with Bitcoin congestion, this is a critical issue of today. OmiseGo hopes to solve this issue with Plasma.\n\nPartnership with McDonald’s and the Thai Government\n\nA partnership with McDonald’s could potentially bring any entity (regardless of their market) much more growth and usage. In this case, they’re helping McDonald’s take in money more efficiently and inexpensively.\n\nThe Thailand Finance Ministry launched a national e-payment master plan to promote electronic payments. In addition, they rolled out Omise’s FacePay technology which allows payments using facial recognition. Omise and Vitalik Buterin had a meeting with the Central Bank of Thailand which indicates interest in their work.\n\nStrategic Alliances include investments from the Krungsri Bank of Ayudhya and SMBC\n\nThe Bank of Ayudhya made a 30 million dollar strategic investment in OmiseGO. They are a part of Japan’s largest financial group, Mitsubishi UFJ (MUFG), and hold $2.4 trillion of assets. Sumitomo Mitsui Banking Corporation (SMBC), another investor, is the second largest bank in Japan. Finally, Credit Saison, the third largest credit card company in Japan, is also partnering with OmiseGO.\n\nThe payment processing industry is siloed, fragmented and extremely centralized, creating security and counterparty risks for everyone. Omise, the creator of OmiseGo is a well-embedded payment processor in Asian markets which encompasses a massive market of users.\n\nOmise’s early ties to the Ethereum network and decentralization with their DEVGRANT donations and close ties with developers. OMG’s Software Development Kit (SDK) bundled with Omise’s suite of financial services is a robust and powerful combination of tools. Current and future OMG blockchain developers can move faster with less friction without having to reinvent the blockchain and remittance wheel.\n\nFinally, OmiseGo has backing from leading financial institutions and advisors like Vitalik Buterin among many other talented individuals."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE9Xblc2b0V3WlNfR2M5elp6Y3QzSFUwZGNLVUJ4ZXJ0Znd4SU1lY0p6YmNZOHhva01NcWJJVG1ETFU3ZzVtUmk1c0tZOXJ2TlMzQkFGRENiY3FFU0dIMVAtYzNYbFNRWDFhWkhOdkVR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 21:03:15 GMT",
        "title": "Coinbase launches KYC service on Base - Blockworks",
        "content": "Coinbase launched its Verifications platform Thursday, bringing know-your-customer policies on-chain.\n\nThe exchange said launching identity verification on the chain protocol level increases security and transparency, providing a solution to common challenges associated with typical KYC methods.\n\n“Built on the [Ethereum Attestation Service’s] open standard, our verifications are public and composable,” Coinbase Cloud, the company’s blockchain infrastructure arm, wrote on X.\n\nEthereum Attestation Service is a base layer where users can make declarations and add virtual signatures to information.\n\n“EAS enables anyone to make attestations on chain or off chain about anything,” the service’s website reads. “You simply register a schema (or use an existing one) about any topic and make attestations referencing that schema.”\n\nCoinbase Verifications, built on Coinbase’s layer-2 Base, already has about 9,300 attestations from users, according to data from analytics firm Dune. The service is expected to help particularly with Sybil attacks, which is when hackers use a single node to create many fake identities.\n\nThe service is the next step toward “using open source, public good infrastructure to enable the next billion users to come on-chain,” said Jesse Pollak, the creator of Base.\n\nThe move marks Coinbase’s entry into the decentralized identity game. Proof of Humanity, a verification protocol where users can submit social and video proof of their identities, emerged as a leader in the space when it launched on Ethereum-built application Kleros in 2021.\n\nRead more from our opinion section: Made by humans but governed by code?\n\n“In our digital interactions, we cannot know who is sitting on the other side of the screen,” the Kleros team said at time of launch. This enables AI manipulation through impersonation and the spread of misinformation by bad actors.\n\nCoinbase’s announcement comes as Coinbase shares begin to par gains after an explosive week. The stock was trading down a little less than 1% Friday after gaining as much as 6% during Thursday’s trading session.\n\nStill, Coinbase (COIN) remains up close to 7% over the past five trading days and is in the green more than 175% since the start of the year.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQeDFsdm1lVmlLTjFBQ3dBQjEtbzF0SjFraE42aVpqekRBU1VYUXpOV1c0WW1XYlJtNkVTRlJqY21mb3ZsMERYQ0M5b1FwajdMY2FNZ1BYa0w1eWNta0JwMi16UWFOUmFtWDViWGNmREZqQ1VOSGJjS2pob3BKVzJaal8wZEp5WGdwa0xNeDJiWE43Z0YxaFZCbGdNSjlVb2dBeDdJSVBmb0FuNnZoMXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Solana Price Could Reach $1,000, Analyst Explains Why - TradingView",
        "content": "Crypto analyst Jacob Canfield has laid out a comprehensive analysis, suggesting Solana (SOL) could be on the brink of an unprecedented market surge. “In my opinion, I think that Solana is going to continue to be one of the biggest movers during this current bull market cycle,” Canfield states, proposing that Solana could potentially escalate its market dominance to the 12-15% range.\n\nCan Solana Hit $1,000?\n\nCanfield bases his analysis on several indicators. He highlights the Solana Dominance (SOL.D) chart, noting that at the peak market cap, it didn’t even crack 3%. Given the current trends and the breakout of SOLBTC from its weekly resistance, Canfield envisions a scenario where Solana could enter a parabolic rally phase, which is further supported by the SOLETH chart showing a similar pattern. “SOLETH – Also currently broke out of a weekly resistance and looks to be forming a parabolic rally against it.”\n\nNewsBTC\n\nA significant factor in Canfield’s analysis is the current state of Ethereum Dominance (ETH.D). He notes that ETH.D is breaking down from a long-term trendline and losing the 200 weekly moving average, now sitting at 17%. “If Solana continues to trend against Ethereum and it continues to break down to 2019-2020 levels, we could see SOL as the big winner this cycle,” Canfield explains.\n\nHowever, Canfield does not disregard the potential ramifications of recent news regarding an Ethereum ETF. “This may not play out with the current ETF announcement news as it will bring more attention,” he acknowledges, indicating that an approved Ethereum ETF could shift investor focus and capital back to Ethereum, potentially tempering Solana’s ascent.\n\nDespite potential headwinds from the Ethereum sector, Canfield emphasizes Solana’s robust partnerships with corporate giants like Google, Circle, and Amazon, positing that these collaborations could significantly drive adoption and enhance Solana’s visibility in this cycle of the crypto market.\n\nFurthermore, Canfield’s analysis extends beyond charts and partnerships. He delves into the Solana ecosystem, spotlighting projects that are paving the way for its expansion. From decentralized finance protocols and automated market makers to NFT storage solutions and governance tokens for gaming platforms, Canfield points to a breadth of innovation within Solana that parallels, and in some aspects, seeks to outdo Ethereum’s ecosystem.\n\nIn light of the FTX debacle, Canfield remarks on the psychological impact on Solana’s market sentiment, noting that with Sam Bankman-Fried’s legal troubles, there is an opportunity for Solana to redefine itself. “There’s a bit of PTSD around the ecosystem, but it’s time to become its own entity and forge its own future,” he asserts, suggesting that Solana’s future will be shaped by those who are deeply integrated into its ecosystem, from developers to traders and influencers.\n\nHis conclusion: “Solana could triple or quadruple it’s all time high market dominance around 12-15% and if it continues to trend against Bitcoin, could easily see a $1,000 per coin and take the #2 spot behind Bitcoin.” When asked about the potential of Ethereum, Canfield emphasized, “No reason to not have allocations to both. It’s like trying to bet on Microsoft or Google. Tesla or Ford: Just buy both.”\n\nShort-Term SOL Price Outlook\n\nOn the shorter-term horizon, analyst Rekt Capital brings attention to Solana’s price movements in a recent post on X. “Solana continues to outperform in the market. In 2021, SOL upside deviated to $53 and then $61 before retracing to the bottom of the purple box,” he noted, referring to a specific zone on the price chart that has historically acted as both resistance and support.\n\nNewsBTC\n\nIn the Rekt Capital chart, SOL is currently breaking out above the zone. However, if history repeats itself and the zone once again acts as strong resistance, the SOL price could suffer a severe pullback. Using the green arrow in the chart, Rekt Capital paints a scenario in which SOL initially falls back towards $30 before the price rises again towards $42."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxQejNIa3hBTWUzTktxWGNxUHhuMkdleXp1d0YxSVh0ZGJ2S1R1eHZocmNkbC1QMW12aG9UblEteGpudzNQRkFfbHhmODdDVlAycUFvYzdJWGtTaHozNlhqcFlsTFdsQUJXb0VXTmdDcFFxSDNFWFhMZHpVSk5wR2lZOVZ5S2dnNFRZU0RRSVBtbU1mcTZkVFRQVEtvdVVoa1Rmb1NfV2ZYcElCSjd5RG5UV2RER3RHakFENVZkNXhULVhWeXlSMDdqcjln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Pundit Says Assets Like XRP With no Ties to China’s CCP Will Benefit Most in Coming Bull Run - The Crypto Basic",
        "content": "A crypto pundit has expressed his bullish outlook on XRP and other protocols that he claims have no ties to the Chinese Communist Party (CCP), China’s ruling party, as he positions them to benefit most from the upcoming bull run.\n\nIn a recent post, influential crypto commentator BoringSleuth hinted at a strategic advantage for cryptocurrencies not entangled with the Chinese Communist Party (CCP) in the upcoming bull market.\n\nAccording to him, protocols avoiding association with the CCP would thrive in the coming market cycles. BoringSleuth singled out Constellation (DAG) as a prime example. He also pointed to XRP as another well-positioned asset.\n\nThe protocols that weren’t in bed with the CCP will be the benefactors of future bull cycles. A protocol like $DAG, who works with the DOD is one example of a well positioned protocol. $XRP is another. — TruthLabs ? (@BoringSleuth) November 11, 2023\n\n- Advertisement -\n\nIt bears mentioning that Constellation boasts ties with the U.S. Air Force in a Department of Defense (DoD) partnership that started in 2019. Details of the partnership came to light in August 2021, with the Phase II of the collaboration announced to have been completed in May this year.\n\nXRP Boasts Robust Potential\n\nFurthermore, BoringSleuth’s endorsement of XRP stems from the robust potential the asset holds. The mention of XRP’s detachment with China also prompts a closer look at the ongoing rivalry between the XRP and Ethereum communities.\n\nAs both assets vie for market dominance, their supporters have continuously engaged in heated debates. Last August, Ethereum founder Vitalik Buterin said XRP lost its right to protection when Ripple executives threw Ethereum under the bus in claims that the project is “Chinese-controlled” during the SEC’s lawsuit.\n\nNonetheless, amid XRP’s victory in the lawsuit, BoringSleuth’s nod to the asset suggests a belief in its resilience and potential to capitalize on the forthcoming bullish trends. The XRP community has also repeatedly propagated claims of Ethereum’s ties to China.\n\n- Advertisement -\n\nClaims of Ethereum Ties to China\n\nSeveral pundits have jumped on this narrative, and BoringSleuth is one of them. Although his recent post does not specifically highlight this, he had previously taken to X to express his concerns.\n\nButerin has also claimed that XRP is centralized, yet people still consider it a crypto asset. Last month, BoringSleuth accused Buterin of securing funding from CCP-affiliated entities in the project’s early days.\n\nThe post unfolded a narrative wherein over 66% of ETH tokens prior to the Merge allegedly entered into wallets associated with China-backed entities, including the Ethereum Foundation.\n\nThe allegations extended to Ethereum’s pre-sale and ICO backers, claiming they received funds through Wanxiang Blockchain, an entity with connections to China. The Crypto Basic spotlighted these claims in June, as disclosed by Fox Business journalist Eleanor Terrett.\n\nBoringSleuth contended that these entities, purportedly responsible for financing a significant portion of the crypto ecosystem, have manipulated and controlled various aspects of the industry.\n\nHe also questioned the decentralization of Ethereum 2.0’s Proof of Stake model, asserting that the system has never been genuinely decentralized.\n\nHe argued that blockchain has lost its identity. According to him, those who fear loss of power, wealth and influence have hijacked the crypto scene. He alleged that these entities used corruption and theft to gain control over the crypto landscape."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFBjRUE0ZDAwT2tKUS1vcUs4d0xxQ25qSTZGV1kxSDhicEpMVlFOY1BaeDU3TU9qUFFEOThHSTd4dUxmUnlOc0Y5SFRaS2FsY1dmQkRYNXpxVzFpbDRUOWlTTjhTMFV2YjFtNUU1eHBPbklrOTjSAXhBVV95cUxOSFpEdGtTZVhWeFJFelIzZmp0NW4ycmpkMnNLRUNUOUh2YXdEeUJlUE9hTjlNRjJXTDNjY2E2QlZ3NEVaLS1aNWR4dVpUMEJoRzZZcFllN0pRV2U0SUU2S3AyUHp1R2dVQ2diYkRzNVU1bUNUdWFHMjE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Send Crypto to Gmail Account: New ZK Tech Revealed - U.Today",
        "content": "Advertisement\n\nYet another eccentric cryptocurrency application on zero-knowledge proofs (ZKPs) addresses the Web2-Web3 synergy in an entirely novel way. With Bonsai Pay, every Google account can be turned into a non-custodial crypto wallet almost seamlessly.\n\nSending Ether to Gmail account becomes possible with ZK proofs\n\nBonsai Pay by RISC Zero, an open source ZK-powered payments platform designed to allow every Gmail user to receive Ethereum (ETH) payments, has landed to the Sepolia Ethereum testnet. It is a new-gen way to replace sophisticated Ethereum (ETH) wallet addresses with familiar email contacts.\n\nAs per the team's statement, any active Google account is compatible with the service and requires zero additional setup to start receiving ETH funds.\n\nAdvertisement\n\nTechnically, cryptocurrency is transferred via an escrow contract created on the Ethereum (ETH) network. Recipients can retrieve assets from this escrow just by logging into Gmail and generating a zero-knowledge proof.\n\nJSON-based identity tokens and OpenID Connect Protocol are technologies the new product is backed by. Its core codebase is written in the Rust programming language.\n\nAlso, it leverages the protocol's own virtual machine dubbed RISC Zero zkVM. Moreover, this instrument can be used by third-party developers via API keys.\n\nZK-powered projects on fire as Ethereum's L2s recovering\n\nThe live demo of the protocol has been launched on top of Sepolia: The team invites all developers to stress-test it and share feedback on GitHub.\n\nZK-proof is a cryptographic method by which the prover can prove to the verifier that this or that statement is true, while avoiding disclosing any information beyond the mere fact of the statement's truth.\n\nZK-proofs are used in many of the top-tier L2 protocols on top of the Ethereum (ETH) mainnet. Three of them, Polygon zkEVM, zkSync Era and Scroll, showed double-digit increases in TVL over the last 24 hours."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNLUJUQlQzclpJeW9GVVZFZ0k2Z2VvUURLZ1VNemF2YVN3cWNkODlQZUtxRnRpT3hJZWFiNkk3WWd6ZXZ4MUgtY3l1VUdmSEQwVTVUb05xWVdQMXRyQmY5SkJtZGpQeHdqeUUxWXJoNVc3VDlnRkc4UUxBYkhVU3pLVGZpYWhySnoyQ3g1YjJMbk52U1JzWm9oUnBWamhPN1FRQllSZ1lGVmFWZEZwN0VEOUNTOVFRVUhCekRINHZ1Rk11bzBVYVHSAcsBQVVfeXFMTUFRaGJlcmVUbmhvM3IxempiVVZSXzQ4NGZOd1hoZzZBWHFNSGhIQVlPQ01Pek5lRVhwQXJIbmFDSENuQjdnQUlYY2ZVNGItOTE4eEdnTkVmRS1ObWc0cXNWS2pVcWV2M09WNm5sdXdVNmE4ZC1PWVdfaEEwZWI4cXl4aC1kRFc0SGNyaUFPU2tWOGJ6SWdLcDBNbzlndmwwQzJ3MDV4WTdqNkVKU3pZYWMtZmUwNUp6ZTBnTWFRTzNhUE50SklDSV9IQ0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "BlackRock's Ethereum ETF confirmation sparks market surge: What investors need to know - Web3Cafe",
        "content": "BlackRock, a leading global asset management firm with assets totaling $9 trillion, has officially confirmed its intentions to launch an Ethereum exchange-traded fund (ETF). The move signifies a strategic expansion beyond Bitcoin, reflecting the growing interest in cryptocurrency-backed investment products.\n\nThe confirmation comes through the submission of a 19b-4 form to the United States Securities and Exchange Commission (SEC) on 9 November. The filing, made by Nasdaq on behalf of BlackRock, outlines the proposed ETF named the ‘iShares Ethereum Trust.’ This marks a significant step in BlackRock's pursuit of diversifying its ETF offerings.\n\nadvertisement\n\nIndustry interest in cryptocurrency ETFs\n\nBlackRock's move follows a broader trend of financial institutions expressing interest in cryptocurrency-backed ETFs. Notably, five firms, including VanEck, ARK 21Shares, Invesco, Grayscale, and Hashdex, are vying for SEC approval for their respective spot Ethereum ETFs. The competition underscores the growing mainstream acceptance of cryptocurrencies as investment assets.\n\nWow. BlackRock appears to be making initial steps for a spot Ethereum ETF now too.#Bitcoin ETF must be a done deal if they're already moving forward with ETH\n\n\n\nThe free market will decide between credibly finite Bitcoin backed by PoW and sometimes deflationary PoS ETH 🍿 — Stack Hodler (@stackhodler) November 9, 2023\n\nMarket reaction and Ethereum's surge\n\nThe news of BlackRock's Ethereum ETF plans had an immediate impact on the market. Ethereum's native cryptocurrency, Ether (ETH), experienced an 8.9 percent surge, reaching $2080. This surge has contributed to ETH regaining market dominance against Bitcoin, marking a shift in recent market dynamics.\n\nadvertisement\n\nMarket dominance dynamics\n\nEther's market dominance, currently standing at 17 percent, has increased by 1.3 percentage points since the news broke. This indicates a positive market sentiment surrounding BlackRock's foray into the Ethereum ETF space.\n\nThe development highlights Ethereum's resilience and attractiveness as an investment option, especially in comparison to Bitcoin.\n\nAlso Read How To Change Your Aadhaar Card Photo Online: All The Steps\n\nBlackRock's official confirmation of its Ethereum ETF plans signals a pivotal moment in the evolution of cryptocurrency investment products. The market's positive response underscores the increasing recognition of Ethereum's value.\n\nAs the cryptocurrency landscape continues to evolve, the introduction of diversified ETF options is likely to play a crucial role in shaping investor preferences."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE0zSTlORWktVVhRRjY4eVhYbDdvdGVNbEVwdGk1blN4Nm9paTVURXI1Mnh0V1lWRWUyTEQ2Y0hRRS01T0lkWHdEOXNkRG91TTJ0RGdGN3EtWnhuNWR3MHUzNFJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Is Chainlink a good investment in 2024? Detailed Analysis - CoinGape",
        "content": "Chainlink, a decentralized blockchain oracle network built on Ethereum, has started to make headlines as the cryptocurrency has recently seen an impressive rise in its value along with healthy technicals.\n\nAs a result, Chainlink, which aims to facilitate tamper-proof data transfer from off-chain sources to on-chain smart contracts, saw its native cryptocurrency LINK price surge by 30% in the past 7 days.\n\nadvertisement\n\nBut investors are hoping that LINK, which has an all-time high of $52.88, at least cross the $50 mark once again in 2024. Currently, the LINK crypto coin is trading at around $18 apiece.\n\nChainlink Overview\n\nChainlink was created in 2017 by Sergey Nazarov and Steve Ellis, with the smart contract network formally launched in 2019.\n\nThe network acts as a bridge between blockchain and off-chain environments.\n\nChainlink’s coin LINK is an Ethereum token, compatible with the ERC-20 token standard. The maximum supply of LINK tokens is 1,000,000,000.\n\nChainlink Historical Data\n\nIn 2017, at the time of Chainlik’s launch, crypto markets were stagnant. At the time of its initial coin offering (ICO), Chainlink price was $0.11. A total of 350 million LINK tokens were sold at the time of its ICO.\n\nIn the following years, the coin witnessed a consistent rise in its price. It recorded its all-time high of $52.88 on 9 May 2021, on the back of an impressive rally in the overall cryptocurrency space. But soon, it went downhill like other cryptocurrencies. Chainlink now appears to be making a slow and steady recovery. The coin has already crossed the $10 mark and was trading very close to the $12 mark, showing marginally bullish sentiment.\n\nWill Chainlink Reach $50?\n\nChainlink is currently hovering around the $18 mark. For it to reach $50, it will need to grow close to 3X. If the anticipation of upcoming bull market comes to reality, Chainlink could further increase in value and eventually reach $50.\n\nBesides, there is also a possibility that network upgrades and staking improvements increase Chainlink adoption, causing its price to rise. However, at present, it appears to be a distant future. What will happen next? Only time could tell.\n\nConclusion\n\nChainlink has clearly started to make its recovery. There is massive room for growth in the coming times as the token is down from its all-time high. Coupled with Chainlink’s continuous efforts to form key partnerships and improvements in the tech stack, the present price rise could continue in the coming times."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxObFRpTlU4WF91UFdlTVR3NDBERkRQU2N1c09Va0hyUE1oNEZ5aFVIX0E2bl82eVJ4N3Y4U0swRlV2MlJkR244VnptYjNDZTdMNEp3S1F4cDFRVlJMclhpNVNFVXJOZzRRYWpUUVV3a0xQNXJmTl9hYXMybmZZaVNyMXpVUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "What’s next for Ethereum price as ETH soars 10% in one day? - Finbold - Finance in Bold",
        "content": "As a highly bullish week for many assets in the cryptocurrency market draws to its end, Ethereum (ETH) has stood out as one of the sector’s best performers, making more significant strides than others and leaving the psychologically important $2,000 price resistance level behind.\n\nIndeed, Ethereum’s high network growth, particularly that of micro addresses with less than 0.1 ETH, has pushed its market value by 10% in a single day and more than 30% over four weeks, according to the data shared by crypto and blockchain analytics platform Santiment in an X post on November 10.\n\nSpecifically, these micro Ethereum wallets have recently surpassed the number of 100,000 for the first time in history, and the 0.1-10 ETH and 10K+ ETH tiers have witnessed growth as well in the past two weeks, leading Ethereum to the highest price since May 2022, as the crypto platform’s chart indicates.\n\nEthereum network and price growth. Source: Santiment\n\nOther bullish indicators\n\nAt the same time, crypto trading expert Ali Martinez pointed out an interesting fact that Ethereum reclaiming the $2,000 threshold was taking place before +10K ETH whales had even started buying the second-largest cryptocurrency by market capitalization, as illustrated by the Glassnode chart he shared on X.\n\nEthereum mega-whale addresses. Source: Ali Martinez\n\nAdditionally, crypto expert Trader Tardigrade earlier highlighted Ethereum’s breaking out of the 200-day resistance trendline, while its moving average convergence divergence (MACD) and signal line both turned into position values, and the MACD histogram showed an increase in the upside momentum.\n\nEthereum breakout. Source: Trader Tardigrade\n\nEthereum price analysis\n\nMeanwhile, Ethereum was at press time changing hands at the price of $2,105.62, recording a significant increase of 10.49% on its daily chart, which has added up to the 17.88% gain accumulated across the previous week and the even higher advance of 33.65% over the past month.\n\nEthereum 30-day price chart. Source: Finbold\n\nAll things considered, ETH might be on a strong bullish trend that could actually see it reach a price between $3,000 and $10,000 in 2024, earlier predicted by the artificial intelligence (AI) tool ChatGPT based on the asset’s expanding institutional adoption, as Finbold reported on November 4.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQTVhoV2dMMFZ6NERJZkhLU1RrNm1PcGlVa0pINEwyelZ6ZEEwZ3VJaTJIcXBHVjhYeFNsZms0Y2ZKMmNQOE55SUEzQ1ZVX3Fad2NYNVFodHVYNjR1QWhEXzFMY2VuT1JSLUZhMEVUaWh5dUdablgyTDFkbHhMaTcybXQ4Yml6Zm50bng0OUR1VFFHTEpodU5MSHQ5UUp6Y1FabnZyaGtEN29QUGFVYlMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "A Forbes Report Says XRP, Bitcoin, and Ethereum Are Close to a Potential 300% Price Rally - Times Tabloid",
        "content": "A recent Forbes report titled, “Imminent $3 Trillion ‘Watershed Moment’—300% Crypto Price ‘Panic’ Could Be About To Blow Up Bitcoin, Ethereum And XRP”, has drawn attention to a potentially seismic shift on the horizon for the cryptocurrency market, with XRP poised at the epicenter of this transformative event.\n\nIn a compelling analysis, Billy Bambrough, a senior Forbes contributor, foresees a forthcoming watershed moment, estimating a staggering $3 trillion impact on the crypto market.\n\nThis surge, he suggests, could catapult Bitcoin to unprecedented heights, sending ripples of market panic and significantly influencing major cryptocurrencies, including XRP and Ethereum.\n\nRead Also: Forbes: Bitcoin, Ethereum and XRP Surge Is Set To Ignite Massive $300 Billion Price Earthquake\n\nBitcoin’s Role and Market Dynamics\n\nBambrough attributes the recent surge in digital assets, particularly XRP, to Bitcoin rallying beyond $35,000. Although many in the community did not agree with this belief, Bambrough feels the surge injected a substantial $300 billion into the overall market valuation. Intriguingly, analysts contend that this notable shift might not have been fully factored into current market prices.\n\nProjections indicate a potential explosion in Bitcoin’s price over the coming years, aiming for $150,000 by 2025, potentially signifying a $3 trillion market cap. The optimism surrounding this projection stems from expectations of a surge in Bitcoin spot exchange-traded funds (ETFs).\n\nCatalysts Fueling Bitcoin (BTC) Surge\n\nBernstein analyst Gautam Chhugani, who shares a dispassionate view of Bitcoin as a commodity, hints at a significant shift, especially considering the imminent approval of SEC-regulated ETFs by major asset managers like BlackRock and Fidelity.\n\nChhugani emphasizes the crucial role of timing, stating, “A good idea is only as good as its timing.” BlackRock, the world’s largest asset manager, set the stage for a rush into the Bitcoin market when it filed an application for a Bitcoin spot ETF with the U.S. Securities and Exchange Commission (SEC) in June.\n\nWe are on twitter, follow us to connect with us :- @TimesTabloid1 — TimesTabloid (@TimesTabloid1) July 15, 2023\n\nIn August, the market experienced a notable surge following a legal development involving Grayscale, a prominent crypto asset manager. A court upheld Grayscale’s challenge to the SEC’s denial of its bid to transform the Grayscale Bitcoin Trust (GBTC) into a fully-fledged Bitcoin spot ETF. The court’s decision compelled the SEC to review the application, injecting fresh optimism into the market.\n\nRead Also: Forbes Predicts Inflow of $8 Trillion into XRP, Bitcoin, and Ethereum. Here’s the Key Factor\n\nChhugani predicts that the approval of U.S. SEC-regulated ETFs could be a watershed moment for the cryptocurrency space. He anticipates SEC approval to materialize by late 2023 or the first quarter of 2024.\n\nThis is similar to a prediction of ETF approval by a notable analyst. This projection also aligns with the growing institutional interest in Bitcoin and the increasing mainstream acceptance of cryptocurrencies as viable investment options.\n\nFollow us on Twitter, Facebook, Telegram, and Google News"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPZWw3ZjZqMU5YMU45Mk1FUjZqcHZVSEZYZUxLTzQ3Tzg3SUkyUUE2N2ducTk4NFR0Z1U4Vk9ELUZ1ZmxCNWlobXhXVWI1WHFlY2NVOWRWWlRNdHg0VEUtWEZTLXRMdkVRN2paTHoxUExLbjlFbGYwTWpreEJzQTFMVFBta0U2Wll3ejRZRzRsMHNiSzF4SlBOSWxjUjdWMUJzX2ZleWd6ONIBrAFBVV95cUxPdmhVemxkSmpsRDhDYUtua2JsS1l4NmlEV3M2VEtGRFhDZjR1NGZnU29KYzhiVE54WkZrOFlWU1A4cWtFU3BvSkQtX0xaTGVpTkwyWnVyOUVCVlZHdDBtWGJpSUxkeTFPTjZSeUF3LUh1UkE2eUY3MEplejAtWk81MXBOc0tQT0NBUlgzZGIxN3gwVjlpN0N2RHJNeTBWWDRxMzE2X2hFb093aVBh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Will Blackrock Explore ETFs for Chainlink, Solana, and Dogecoin? Expert Answers - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nCryptocurrency analyst Lark Davis hinted at a potential boom for Ethereum with the registration of BlackRock’s IShares Ethereum Trust in Delaware. Expressing confidence in this prediction, Davis speculated that BlackRock wouldn’t undertake such a move unless they were pretty sure about obtaining approval for a Bitcoin spot ETF.\n\nHe playfully suggested that beyond Ethereum, BlackRock might eventually explore ETFs for other cryptocurrencies like Chainlink, Solana, and even Dogecoin. While BlackRock isn’t the first to file for a spot in Ethereum ETF, joining others like Invesco and Hashdex, Davis sees this as a sign of institutional interest aligning for a significant influx of institutional money.\n\nHighlighting potential numbers, Davis discussed the current Ethereum holdings on exchanges, which amount to about 14 million ETH or $28 billion at the current price. He estimated that if Ethereum attracts half the inflows that Bitcoin does into ETF products, it could result in up to half of the available coins being acquired in the first year alone.\n\nReferencing Galaxy Digital’s estimates for a Bitcoin ETF, Davis halved the numbers for Ethereum, projecting $7 billion in the first year, $14 billion in the second, and $20 billion in the third. He said that such inflows, coupled with increasing demand, could lead to a situation where every Ethereum is bought up within three years.\n\nBeyond BlackRock’s potential move, Davis touched on other bullish catalysts for Ethereum. These include the monthly MACD nearing a bullish cross, with Ethereum catching up to Bitcoin’s trend. Additionally, he noted that 28.3 million ETH is currently staked, creating an over 2-year exit queue and restricting immediate dumping on the market. Davis also pointed out that Ethereum’s deflationary nature, EIP-4844 reducing gas fees on layer twos, and the ongoing migration to layer twos would further drive Ethereum’s growth."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiSkFVX3lxTFBwM3pNTlRkakdtLThWZ0Jkdnc5d0JSTUJPRS1XS293aVFpN2hwZkFRcjFWVXZoLTFuOVpaVVRKSzJnYjMtbThFNndR0gFCQVVfeXFMUFBmYXdMMWhQZTJfeXVWMENIand5V192enFZT0Jxb1ZLbDQzS2YteGZFNi1yYl9RTG0ybU9DRVJFRzR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Bank Nomura Offers Ethereum Investment For Institutional Investors, ETH Price Soars - VOI.ID",
        "content": "JAKARTA - Japan's largest investment bank, Nomura Holdings, launched an Ethereum-based investment fund for institutional investors through its digital asset subsidiary, the Laser Digital Asset Management, according to a press release released on November 9.\n\nThe fund, called \"Laser Digital Ethereum Adoption Fund SP\", is the second digital adoption solution investment fund introduced by the Digital Laser after launching the Laser Digital Bitcoin Adoption Fund last September.\n\nThe new fund will focus on the long-term spot position on Ethereum, reported by CryptoSlate. The fund is expected to increase yields through innovative strategies involving ETH staking owned by the fund. The fund is managed as a separate portfolio in the Laser Digital Funds SPC, a separate portfolio company listed in the Cayman Islands.\n\nLaser Digital has partnered with Komainu as a store for the assets of the fund. The company also acts as a store of assets for the Bitcoin Digital Laser fund. Komainu is a company regulated by the UK Financial Behavior Authority and the Virtual Asset Regulatory Authority in Dubai.\n\nSebastian Guglietta, head of the Laser Digital Asset Management and former Chief Scientist Officer Nomura, said his company sees Ethereum as a technology catalyst that will digitize the economy. He added that in the long term, exposure to Ethereum is very important to capture the structural technology trend of the web economy 3.\n\nMeanwhile, Total King, head of the Laser Digital Asset Management distribution, said that the fund would simplify investment in digital assets and provide a safe way for institutional investors to gain exposure in the industry because it is fully regulated.\n\nLaunching CryptoPolitan, Steven Ashley, co-founder and executive chairman at Laser Digital, said that the funds offer added value to investors interested in the technology underlying the Web3 ecosystem, such as smart contracts, decentralized finance (DeFi), and non-fungible tokens (NFT).\n\nHe also said that Ethereum has an important role as a building block for this digital infrastructure, and is therefore of interest to their institutional clients. The launch of Ethereum funds by Nomura Laser Digital shows that there is growing interest from traditional financial institutions to integrate digital assets into their investment portfolios.\n\nAt the time of writing, the price of ETH has increased by 9.9% in the last 24 hours. Now ETH is trading at IDR 32.8 million based on Coingecko data reports.\n\nThe English, Chinese, Japanese, Arabic, and French versions are automatically generated by the AI. So there may still be inaccuracies in translating, please always see Indonesian as our main language. (system supported by DigitalSiber.id)"
    }
]