[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9ib1VFamxQNEZGdjF2V3BTOHdMYno5N0prYzJTbmRSZ01XZV9BazZSdnRzUjRJbjExd2lWQU11UlpCZWg0SFptY2xhclFaX3JWZ1c5TEp4U0ZZendDSDlST1Bna25HQlNwVFdka28tN0kzYXl6cy1tR2VFTnNPZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "SEC Acknowledges Ethereum ETF Filing by Fidelity - Crypto Briefing",
        "content": "SEC is evaluating a proposed Ethereum ETF from the $4.5 trillion money manager.\n\nShare this article\n\nThe US Securities and Exchange Commission (SEC) has acknowledged receipt of an application by asset management giant Fidelity to list a spot Ethereum exchange-traded fund (ETF), according to today’s SEC filing.\n\nThe filing from Cboe BZX Exchange proposes listing and trading shares of the Fidelity Ethereum Fund, structured as a commodity-based trust that would hold ether. The trust aims to track the performance of the Fidelity Ethereum Index, less expenses and liabilities.\n\nHas been long known that Fidelity entered the spot ETF race but this filing *essentially* starts the ~240+ day clock for their spot #Ethereum ETF. Just another step in the process. Will have definitive deadline dates in the coming weeks https://t.co/0C6NKcxNNz pic.twitter.com/gdW9ZQDgs9 — James Seyffart (@JSeyff) November 30, 2023\n\nThe SEC has several Ethereum ETF applications under review that it must approve or deny, including filings by major financial firms BlackRock, ARK Invest, VanEck, Hashdex, Invesco, and Galaxy Digital Holdings.\n\nFidelity Digital Assets Services would serve as the regulated custodian for the trust’s ETH holdings. The filing argues that the CME Ether futures market is of significant size for surveillance-sharing purposes to meet SEC listing standards that aim to prevent fraud and manipulation.\n\nThe SEC has yet to approve a spot Bitcoin or ETH ETF in the US. However, the agency is reportedly preparing to allow simultaneous listings of spot-based Bitcoin ETFs in January. The Fidelity filing aims to make the case that an ether spot ETF should also receive approval.\n\nThe proposal starts a 45-day clock for the SEC to approve, deny, or extend the deadline. The SEC is now seeking public comments on the proposed rule change to list the Fidelity Ethereum Fund ETF.\n\nETH is trading flat -0.1% over the last 24 hours, according to Coingecko."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE55NGtDcDVfSlE1a3AzR05kbGR5eGhpcXZ6NlRDRzdNU19wTTBHai1pT1pYQmNUc0hPSEVCTVlSV29Yc0c1eElvZjdGMjZELWw0dTFLMEZyQm01ZHBWNlpJS2VPTmllNFpGcl9wTnoxYUV6dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Optimism execs are optimistic for Ethereum’s future amid its ongoing scaling battle - TechCrunch",
        "content": "As the layer-1 blockchain Ethereum continues to grow and evolve, layer-2 blockchains like Optimism are working to alleviate issues of scaling, speed and costs.\n\n“We’ve been working on the same thing since 2017,” Jing Wang, Optimism’s CEO and co-founder, said on TechCrunch’s Chain Reaction podcast. “We’ve all been trying to solve the same problem for a long time.”\n\nThe mission to scale Ethereum is ongoing, said Ryan Wyatt, chief growth officer at Optimism. Before joining Optimism, Wyatt was the president of Polygon Labs, the entity building the layer-2 blockchain Polygon.\n\nAs it stands, using and transacting with Ethereum is still relatively clunky, slow and more expensive. That’s why layer-2 (L2) blockchains like Optimism exist: to focus on scaling and speed, while also lowering costs for users. It helps users interact with Ethereum’s chain for about 10x cheaper through its own network and also provides developers the ability to build decentralized applications (dApps) in a faster, scalable way.\n\n“Just as Amazon is a serverless back end for web2 applications, Optimism is a decentralized serverless back end for web3 applications,” Wang said. “We wanted to scale Ethereum because I think Ethereum stays the most close to the original decentralization values and we wanted to give it a go staying close to those same values.”\n\nBut with scaling also comes the importance of growth. “There’s a lot of facets to it, and I think one missing piece is how we continue to work with developers across the ecosystem,” even if they’re not a part of the Optimism family, Wyatt said.\n\nUsually when you think of scaling, you think of hiring big teams. But although Optimism wants to grow bigger, the ecosystem has to self-govern, and the best way to do that is to have developers across the space contribute.\n\nOptimism wants developers to build dApps using its technology, therefore pushing users to the network. “There’s a ton of similarities to blockchain infrastructure in the developer ecosystem,” Wyatt said. “For me, it seems incredibly similar.”\n\nFor some, blockchains are like religious ecosystems, where there’s only one way or the highway. “It’s one chain versus the second chain,” Wang said. “Optimism’s Superchain vision is trying to get us closer to a world where the chains are closer to containers for compute … and all these chains interoperate together in what we call the Superchain.”\n\nThe goal is to help users forget which chain developers are building on, because it ultimately won’t matter. “Ideally in the future, there’s applications that are so massive that they’re probably running 100 concurrent chains. But for now, the amount of demand within the industry doesn’t necessitate that, so we have something that looks closer to one application per chain.”\n\nBut when it comes to success stories, it “should really be about the developers that are building on top of this infrastructure,” Wyatt said. “So the day that we get away from talking about L2s, I think is going to be a big day because now the story will be about the great apps and experiences that are being built on top of the infrastructure.”\n\nThis story was inspired by an episode of TechCrunch’s podcast Chain Reaction. Subscribe to Chain Reaction on Apple Podcasts, Spotify or your favorite pod platform to hear more stories and tips from the entrepreneurs building today’s most innovative companies.\n\nConnect with us:"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQV1gyTzZLZUw1RTFwLW5fbXhuenNnS2lpaHl6aklhejJxelhIZkNqS0NvOGdfX2NzbTZCTE1HOHpHbHZJaWNqcVBvRHlpZ05KQVhsT25QT1I1bTJGblJIOEw1d3pObVllRjBzS2FmcnotQ0s4czFFYy1YMjlzVUVqWVRYX1dINkpDMHFZdkFVVEtEeEpPVkZSRElpSFVaRkpxOS16T2xlRG5aV0I1V3BBcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Safeguarding Your Bitcoin & Ethereum: Exploring Multi-Sig Wallets for Enhanced Security - hackernoon.com",
        "content": "Storing crypto on an exchange or a hardware wallet is risky. Instead, you should use a multi-sig setup.\n\n\n\nI used to store mycrypto in hardware wallets like Ledger, but for large amounts, it is still risky. If somebody steals your ledger or its seed phrase, you are doomed. If a fire or earthquake destroys them, you are doomed. I used to keep two copies of seed phrases in different locations for this latter risk. But that poses another risk - what if somebody steals from my second location when I am not present, and I do not know until it’s too late?\n\n\n\n\n\nThe solution is to use a multi-signature wallet, which is a setup in which a threshold of devices must be confirmed to execute a transaction. I put this off for way too long but finally got around to it.\n\n\n\n\n\nBitcoin Multisig\n\nFor Bitcoin, there are two main providers I’d suggest - Casa or Unchained Capital . Both are self-custody, meaning you are the holders of the keys. No FTX-like risk here. Both have also raised much in venture capital and have great customer experiences. I actually spoke to Unchained Capital four years ago when they were just getting started and raising their first round of seed capital. Now, they have raised $100M+.\n\nCasa vs Unchained\n\nCasa costs $250 a year (they also offer more expensive services, which I won’t go into here), while Unchained Capital offers a free tier of service. However, the latter requires KYC while the former does not.\n\nHow It Works\n\nFor Casa, there is an app. You control two of the keys; Casa controls the third. You need 2 of 3 keys to send funds out. Your mobile serves as one key, and a hardware device like a ledger as the other. For the key that Casa controls, you answer security questions that you’d re-enter if you want Casa to sign for you in the future. You would use this if one of your two keys was compromised. Casa would sign after a seven-day buffer. It is highly recommended you write down your answer to the security questions and put it somewhere safe.\n\n\n\n\n\nYou also have the option to use two hardware devices instead of the mobile.\n\n\n\n\n\nUnchained Capital is mostly similar, but they only offer the two hardware wallet solutions, no mobile. Also, while they are free, they charge a $20 co-signature fee if you need to rely on their third key. Since they KYC, they don’t require security questions; hence you don’t need to worry about writing it down and storing it safely somewhere; instead, they can verify via a method like video call when you need them to sign. They have a 72-hour buffer period before signing.\n\nWhile KYC has this convenience, a downside is that if Unchained’s data gets compromised, your identity and crypto holdings will be revealed. To be clear, your crypto would still be safe in such a scenario because you control two of the keys. Alternatively, the downside of Casa with no KYC is that you are responsible for storing the answers to your security questions safely.\n\nFinally, for a higher fee, you can do more complex options like 5 keys and white glove service with either Casa or Unchained.\n\nOne mobile & one hardware wallet or two hardware wallets?\n\nOne Mobile & One Hardware Wallet:\n\nWith mobile, it’s almost always on you, so if somebody steals your hardware wallet, you’ll still have your phone with you, which some may argue adds a degree of safety.\n\nIf you choose to keep one of the hardware wallets in your residence, you can conveniently transact anytime using it and your mobile device. Alternatively, if you choose to keep your hardware wallet separate from your primary residence, you’d need to go there to transact, which is less convenient but arguably even safer.\n\nFinally, if a natural disaster destroys your hardware wallet and phone, you can get back your mobile key from a cloud backup (more later), and use this with Casa’s key to recover your balance.\n\n\n\nTwo Hardware Wallets:\n\nWhile mobile can be convenient, the two-hardware wallet solution is a great option, too, and even more secure for those who don’t expect to transact much if kept in different locations.\n\nIf kept in different locations, you’ll need to bring your first hardware wallet to your second location whenever you need to transact.\n\nSee here by Unchained for different setup ideas for two hardware wallets. The maximum security setup would involve four locations that each have one of your two hardware wallets and two seed phrases. Very secure, but at the cost of inconvenience. A middle ground solution is keeping each pair of hardware wallet + seed phrase in two locations.\n\nIs mobile safe?\n\nYes. The mobile private key is literally on your device in a secure enclave that can’t be accessed by anyone, not even your mobile device manufacturer. This means that even if somebody stole your Casa login credentials and logged in on their phone, they still can’t sign because they need your exact mobile device.\n\nWhat if I change or lose phones?\n\nIt is backed up to iCloud for iPhone and Google Drive for Android and can be re-established on a new phone.\n\nRisk Scenarios:\n\nSomebody steals your two keys: If a thief somehow manages to steal two of your keys (whether it’s two hardware or one mobile and one hardware) and get through the security needed to use those devices, they’d still need to know your login to your multisig provider (Casa or Unchained). This is because signing a transaction requires two private keys, but also the three public keys (note: public key is different from your address; your address is derived from your public key through hashing). The three public keys are accessed automatically through your multisig provider when you log in to transact. Multisig provider goes down: You can send funds out using open-source software like Electrum or Spectrum. This process is called Sovereign Recovery. For Casa, you’d basically export your mobile private key and seed phrase and re-establish your wallet on Electrum or Spectrum using your hardware device, mobile, and the Casa public key. For Unchained, you’d do the same using your two hardware wallets. Both Casa and Unchained provide detailed instructions on their website if this is ever needed.\n\nEthereum Multisig\n\nFor Ethereum, Casa offers an ETH vault that basically uses Safe (rebranded from Gnosis Safe) under the hood and comes for free if you use their BTC vault. However, it does not allow altcoins beyond USDC and Tether yet. Unchained is Bitcoin only by philosophy (something that Bitcoin maxis appreciate) so it does not offer ETH multisig.\n\n\n\n\n\nAlternatively, you can use Safe directly, as it’s free to use, and you can hold any altcoin. It is the dominant DIY open-source multisig solution on Ethereum used by all decentralized orgs. They recently raised $100M on a $1B valuation. I got to be familiar with using it, as my most recent startup nestwallet.xyz was built on the Safe protocol.\n\n\n\n\n\nThe main difference to note between using Casa and Safe directly is that with Safe, you are responsible for safeguarding all your signer devices and their seed phrases, whereas with Casa, you can rely on them to hold one key (Casa key), while the mobile key will be held on your phone and accessed through their app without requiring you to write down a seed phrase (this mobile private key and seed phrase can be exported out, but you’d only do so for Sovereign Recovery).\n\n\n\n\n\nFor Safe, you can set it up however you want, like 2/3 signers, 3/5, 2/2, etc. Safe also has a mobile app that can serve as a key, but as I mentioned above, you’ll have to write down the seed phrase for it in a secure location if you choose to use it. The other signers can be hardware wallets, hot wallets (like Metamask), or a combination. The most important thing is to keep the seed phrases in separate geographic locations.\n\nLet me know what you think\n\nHopefully, this was helpful as you think about safeguarding your own crypto. It’s a question I’ve thought a lot about, and it is important to have a solution that is immune to all the major risks - theft of a single device, natural disaster, or an exchange going down (a la FTX or the multitude of others).\n\n\n\n\n\nUse this as a starting point, but I recommend doing your own research and choosing the setup that best fits your needs. Feel free to reach out to me directly if you have questions, and I’ll do my best to answer them.\n\nAlso published here."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQZl9FdnFRYXBENjJibTE0cnZtUW15NXU3aUo5eml2TmJCX0V2UFFZeUloM0hHMWtycGtvRTFTUXBvMlUyeTVnX01qVDE0UDcxa0xoVmg5Y3JVNDUwVVduN2h3VTlrbVZkVFRtRU9YYUtjR0NOeGhEcEFuSU43Tl95YmNhc1BQUl9BMjBTX0pB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "SEC opens comment period for Fidelity’s proposed Ethereum ETF - CryptoSlate",
        "content": "The U.S. Securities and Exchange Commission (SEC) began to accept comments on Fidelity’s proposed spot Ethereum ETF through a Nov. 30 filing.\n\nThat filing indicates that the securities agency is now soliciting comments on a proposed rule change from Cboe BZX. If approved, that rule change will allow the exchange to list and trade Fidelity’s Ethereum Fund shares.\n\nThe SEC’s request for comments resembles similar filings regarding other spot crypto ETF proposals. It asks for comments about surveillance, custodianship, and market manipulation, among other matters. Notably, the filing highlights a surveillance sharing agreement that Coinbase and Cboe BZX established in June, a critical component also found in many other pending spot crypto ETF proposals.\n\nThe filing also acknowledges a lack of existing U.S.-regulated and U.S. exchange-traded investments that provide exposure to ETH, whereas European markets already offer regulated investments that provide exposure to spot crypto assets.\n\nDecision likely by March 2024\n\nThe filing sets a timeline for the SEC to approve, disapprove, or start proceedings to determine whether to disapprove the proposed rule change. These comments are considered in the final decision-making process. The SEC is required to reach a decision within 45 days of the current notice’s publication in the federal register; however, the SEC can extend the decision period by up to 90 days and then further by 60 days if necessary.\n\nThough exact deadlines may differ, Bloomberg ETF analyst James Seyffart estimated that the SEC’s next decision deadline for Fidelity will be Jan. 21, 2024, and its final decision will be March 8, 2024. He added that he will have knowledge of “definitive deadlines in the coming weeks.”\n\nFidelity initially filed for its spot Ethereum ETF on Nov. 17, days after its competitor BlackRock filed for an equivalent fund on Nov. 15. Both firms also filed for spot Bitcoin ETFs this summer starting in mid-June.\n\nSeveral other asset managers, including Ark Invest, VanEck, and Grayscale, also have pending spot crypto ETF proposals.\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOLTJJY1RiQjdrX2xNSmlHOW1tTzFPMlV1T2R5enFKSUdaS1ZEOHhrZC1NZXlhazhTVHhyLW50X3pDc2tIa3M4Ulp4RGZsMUs3VWI5WkFYX1VnREVqa1poZ1hEcVVvOWpNZllXQ3VIbU5oN1B1RmtJMjlfbnJvWDAyTUZSUTlCbnMwU3lpRmd2RdIBlAFBVV95cUxOSWRWZzdaeTBTMloyRnNZbE4zeW1TVWtyaHFOaEQxZDZBbnhyQUF1dzBNOXZFMXRBaFFzeXQ5VWY4TzZYeEZNVDdEV210M2JxbnA1Q3hrbnJBeUxMa0YxaEhWTE1Nbzg5cjVuVlZoTW1sWjh4MzNTWVRJNmREQ3NzM0JIR0lzcHYzQUFzby1Ick84XzlI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Ethereum network witnesses an exodus as validators exit – Why? - AMBCrypto English",
        "content": "The Ethereum network has seen a surge in daily validator exit since the beginning of October.\n\nThis may be due to the recent uptick in Ether’s value.\n\nEthereum’s [ETH] staking pool has experienced a shift since the beginning of October, with an increasing number of validators opting to withdraw their staked ETH, Glassnode found in a new report.\n\nAccording to the on-chain data provider, since the beginning of October, an average count of 1018 validators have exited the proof-of-stake (PoS) network daily.\n\nThis trend coincides with the recent upswing in the altcoin’s price in the last month, suggesting that validators are capitalizing on the opportunity to capture gains on their previously staked ETH.\n\nValidator exit has network-wide impacts\n\nTo serve as a validator on the Ethereum network, a minimum amount of 32 ETH is to be staked. Since the October rally began, there has been a steady decline in the number of unique addresses holding this amount of ETH.\n\nAt press time, 125,189 addresses held at least 32 ETH, having declined by 1% since the 1st of October.\n\nGlassnode found further that most exits recorded in the last eight weeks have been voluntary. Validators are deemed to have exited the network voluntarily when they independently decide to exit the ETH 2.0 staking pool.\n\nThis differs from slashing events that account for validators being removed from the network for violating protocol rules. In the last two weeks, only two of such events were recorded, Glassnode said.\n\nIn addition, due to a rise in the daily number of exiting validators on the network, there has been a corresponding fall in ETH issuance. This refers to the total amount of new ETH coins added to its current supply.\n\nAccording to the report:\n\n“As the growth rate of validators slows and declines, the daily ETH issuance has experienced a corresponding slowdown. Over the last 7-days, the growth rate of ETH issuance has slowed by up to 0.5% per day. Notably, the rate of issuance has decreased for the first time in recent days.”\n\nHow much are 1,10,100 ETHs worth today?\n\nRegarding the entity types that have facilitated the most withdrawals since the beginning of October, Glassnode found that centralized exchanges have been responsible."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNTzVHQVpvR3dnSXlVVmk2SDIzbVh6NDB2MHZETTFLdkJBd2hSNHR3b3gyMkpteGFGRkd6V2p3TTk0UlhqUld0NmdHRW91WVpnTXVNb3dyb05OTkhLQTdNN096bEVVMDFkNnJKR3JRSDdUWWpBT1RPSlV0bEVCMldSLXpMbTNMdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Vitalik is the public intellectual the tech world needs right now - Fortune",
        "content": "Vitalik Buterin is best known for creating the world’s second-most-valuable blockchain, Ethereum, when he was just 19 years old. In the past few years, though, Buterin’s influence has expanded well beyond the world of crypto and into the broader realm of ideas where the young polymath—who taught himself Mandarin while traveling the world—offers important treatises on technology and the future.\n\nThe latest example is a 10,000-word essay Buterin published this week titled “My techno-optimism.” It’s a response to the much-discussed “manifesto” with a similar title by the influential venture capitalist Marc Andreessen. Buterin’s piece endorses many elements of the manifesto, including an affirmation that technology has delivered marvelous benefits to humanity, and that fear and overzealous regulation have limited progress in fields like biotech. But while he endorses a foot-on-the-gas approach, especially to solve the climate change crisis, Buterin also calls for a more cautious approach when it comes to AI.\n\nWhile the Ethereum creator has long been a leading thinker in computer science, he has also become one in the governance of technology and society. Here is Buterin on the crack-up at OpenAI and the problem of putting guardrails on technology by means of small councils of elite decision-makers:\n\n“[It was] a well-intentioned effort to balance the need to make a profit to satisfy investors who provide the initial capital with the desire to have a check-and-balance to push against moves that risk OpenAI blowing up the world. In practice, however, their recent attempt to fire Sam Altman makes the structure seem like an abject failure: It centralized power in an undemocratic and unaccountable board of five people, who made key decisions based on secret information and refused to give any details on their reasoning until employees threatened to quit en masse.”\n\nDrawing on his experience in trying to build decentralized communities in the Ethereum realm, Buterin provides new and important insights into how to think about AI—including how to avoid the very real possibility that humans end up as pets to machine overlords. He is, of course, hardly the only one with big ideas about the future of technology. But what makes Buterin stand apart is his deep capacity for empathy and lack of ego.\n\nUnlike Andreessen and Balaji Srinivasan—another tech genius whose ideas carry a lot of weight in the debate over technology—Buterin doesn’t have contempt for those who disagree with him, and he doesn’t frame the debate in the shrill us-versus-them tone of the venture capital elite.\n\n“I believe that these [technologies] are deeply good, and that expanding humanity’s reach even further to the planets and stars is deeply good, because I believe humanity is deeply good,” he writes. In a troubled moment where too many people are consumed with fear and negativity, it is welcome to read a tech genius who relies on empathetic persuasion. If you want a shorter and more approachable window into Buterin’s worldview, you can also check out this new Fortune Q&A, which includes the moral case for supporting Ukraine and the fascinating sci-fi realm of the popular book and film The Three Body Problem. Have a great weekend.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nBitcoin bulls are predicting the currency, which is up around 130% in 2023, will end the year at $40,000 even as it has struggled to maintain a consistent foothold above $38,000. (Bloomberg)\n\nRep. Tom Emmer (R-Minn.), a GOP House leader, warned about a legal framework for stablecoins based around CBDCs that he says could “swallow up” crypto in a “surveillance security state.” (Fortune)\n\nPolygon secretly gave preferential status to Draft Kings in the form of millions of dollars’ worth of subsidies to a validator run by the sports betting site—an effort that is now kaput. (CoinDesk)\n\nA new survey of the Bitcoin mining industry raises concerns about its use of water, which it claims is about equal to the annual consumption of Washington, D.C. (The Verge)\n\nAmid a broader reckoning in the VC industry, Tiger Global slashed valuations in its venture fund, including markdowns of 94% to OpenSea and 64% to Bored Ape Yacht Club. (Bloomberg)\n\nMEME O’ THE MOMENT\n\nOne version of the future:"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQNGhSZzNhVVBiWHI3UC1xUW15UnpBSDVpQnFBR21EMHIxOUpjNEdrMlp5UEVWMGI2bnFBU2VDNjJxUEZaVDNDOXpfQ3FEN2xtWGtJc2pVQkVFaEVna0FQYmVfY2hhTHFWV2d3aWJaVjRxOGtNeUJIcmpzV1V0dkczRHZEeFNHLWRQQXZzT2g0S09KUmJYVVVocw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Supply is Deflationary, Here Are the Two Main Reasons - Cointribune EN",
        "content": "Thu 30 Nov 2023 ▪ 4 min read ▪ by Fitah\n\nA major transformation is shaking up Ethereum: validators are leaving the ship, slowing the issuance of new tokens. Coupled with a rise in network activity, this is making the global supply of the cryptocurrency ETH deflationary. Let’s decrypt it!\n\n“Exodus” of Validators on Ethereum\n\nWhile the price of Ethereum cryptocurrency is stalled around $2000, a significant change is taking place on the network. Indeed, the supply of ETH is undergoing a major shift, becoming deflationary once again.\n\nGlassnode\n\nThis deflation results from two key factors. First, there is the slowdown in the number of validators in the staking pools. Then, there is the increase in daily Ethereum cryptocurrency fees burned via EIP1559, fueled by an intensification of network activity\n\nThe growing number of validators leaving the pool since October indeed slows down the growth of the network. This leads to a decrease in the issuance of new ETH crypto tokens. According to Glassnode’s analysis, the number of participant exits has seen a notable increase. This has gone from an average of 309 per day in October to an impressive average of 1018 validators per day since early November. This trend aligns with the recent rise in crypto prices.\n\nGlassnode\n\nThe massive exits of participants, mostly voluntary, are particularly concentrated among the CEXs such as Kraken and Coinbase. A modest increase in exits at the liquid staking provider, Lido, is also highlighted.\n\nIncreased Activity and Pressure on ETH\n\nAccording to Glassnode’s analysis, the network is also experiencing a significant increase in transaction demand, particularly for token transfers and stablecoins. This increased pressure on the network leads to a rise in gas fees, generating a notable growth in Ethereum fees burned via EIP 1559.\n\nGlassnode\n\nIn October, the daily amount of Ethereum burned reached 899 ETH, a figure that has climbed to 5,368 ETH in less than a month. These figures reflect a spike in activity, pushing Ethereum to new heights of demand and transactions.\n\nThis double pressure translates into a critical situation: ETH is once again becoming a deflationary resource. The reduction in the number of validators leads to a slowdown in the issuance of ETH. While the explosion in network activity exerts upward pressure on gas fees.\n\nThe combined effect of these two factors shows that Ethereum is responding to market changes. This creates a situation where the supply of ETH is once again shrinking, moving towards deflation.\n\nHow will this new dynamic influence the choices of investors in the weeks to come?\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE1NVnVnVW1uN3czaE1FWFp2cFZoNmVpSW1KTDZ4R2JENHNaWng5eXJaLXFKdUhlM040ckJNc3o4MjFfNndTYXBNZF9xa1RyVlZFUEx3STlPZC1tUEtfc2ViQ2lwTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Blast from the past: 3 years on from the launch of ETH staking - Blockworks",
        "content": "Yeeting ETH into the void is nothing new for Ethereans.\n\nBy the time the Beacon Chain officially launched on Dec. 1, 2020, the staking contract — referred to as “ETH 2.0” back then — had already seen around 880,000 ETH in deposits.\n\nSo perhaps it’s no surprise that multisig-with-a-plan project Blast now sports $650 million in staked ether and stablecoins under its control.\n\nBlast’s explicit promise is that deposited tokens will earn an on-chain yield, plus rewards of unknown value. Ether staking yield comes via Lido’s stETH tokens, while stablecoins are converted to dai deposited in Maker, or savings dai (sDAI).\n\nOn Thursday it emerged that the Blast deposit interface set its slippage tolerance to an inordinately high 10%, resulting in one user losing about $100,000 in value. The Blast team says they’ve fixed it.\n\nBut, sandwich attack surprises aside, most depositors at least know that all assets will be locked until the proposed optimistic rollup launches in February.\n\nDepositors to the Beacon Chain, too, knew that their ether would be locked up for at least a couple of years — though it wasn’t clear when exactly The Merge and subsequent enabling of staking withdrawals would happen when many aped in.\n\nUltimately it took until April 2023, by which time about 18 million ETH (about $33 billion at the time) were deposited.\n\nIn the interim, there was a rapid growth in liquid staking, with Lido becoming the dominant player in early 2022, and already nearing a third of all staked ether by May 2022. It has remained between 29% and 33% ever since, keeping the project at the center of a debate about centralizing market forces on Ethereum.\n\nThe total percentage staked through Lido currently stands at 32.28%, and Blast — which uses Lido exclusively — isn’t helping.\n\nHow much of a problem that is, depends on who you ask.\n\nSome will analogize the concentration of ether stake to the preponderance of the Go Ethereum (Geth) execution client for Ethereum node operators. A great deal of social coordination was needed to bring down the market share of Prysm on the consensus layer, which reduces risks to the network as a whole. Geth is currently at 84%.\n\nClient diversity is widely seen as one of Ethereum’s strengths, a hallmark of its resilience through decentralization, which is unmatched in crypto. Indeed, decentralization and resilience are often seen as synonymous.\n\nLoading Tweet..\n\nThat’s why some are concerned about the Blast-fueled tick up in Lido’s stake share.\n\nBut for others, it’s a feature, not a bug. Blur and Blast investor Izebel.eth stated the “3 line pitch” for Blast is that “[Ethereum] would be better if everyone used stETH…so we use the bridge as a forcing function.”\n\nLoading Tweet..\n\nOf course, the “bridge” is not really a bridge, while it can only be crossed one way. And forcing people into a harmful position isn’t doing them any favors.\n\nLoading Tweet..\n\nIt’s generally good advice to be wary of promises from backers that something can “reshape the fabric of society.” That’s not just “ambitious” — it’s hubris.\n\nNone of the more academic discussions ultimately matter, though, when you have gamification as your selling point. And, maybe there are bigger fish to fry.\n\nIn any case, Lido has more TVL — approaching $20 billion — than any other DeFi protocol by a country mile. And Blast is bigger than Base — in third place behind Arbitrum and Optimism according to L2Beat — while now hiring software engineers, much to the amusement of crypto Twitter.\n\nPlenty of folks in this industry idolize the free market; so if that’s your modus operandi, then the market has spoken, for now.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQUmp0U1l5UmNrLUM1U2hZMWt1SjJGc1pmZm9wSWhMYVhmV29HeU1jQklTSGh0N3NCWThmMUM3NzJ4aTJabjd3dVJqck9NcDZOMFZUU1lQMm9GelBvTEk3cDhOaUNrc2RyQmhrMWVXWUYtSURUYzhvUlVnUjVnQW04OFU0Y29sSXlWcEFF0gGQAUFVX3lxTE1mZ211SkkyTlVXM0g2TFFYU1dHOTcyVmRHMW5xblgtRWpYQUJpS0ZfNHhEZnU4LTlCNmhzZHJTRmZ5R3N0bWZVZ3U1X19pSllZVld1elRTWm9yaVZ3VFhkcGJiVHc3bXIyOEMwdzBrVjdCS3BjYkhjZlJYN2xiNExjcWU3SF9fSTAyZWdxX2lBUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Legendary Trader Raoul Pal Makes Rare Ethereum vs. Solana Comparison - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nLegendary crypto trader and investor Raoul Pal has waded into the supremacy debate between the two prominent proof-of-stake (PoS) Layer-1 networks Ethereum (ETH) and Solana (SOL). According to Pal, the use of Solana comes with a whole different feel that makes it a top contender as a relatively more user-friendly option.\n\nAdvertisement\n\nHe said once someone starts using Solana, it \"feels super fast, slick, inviting and easy for the user.\" The accolade on Solana underscores the general perception most industry leaders have of the top coin, especially as it has been able to pull off a major comeback in its price action post-FTX implosion.\n\nOnce you play around in the $SOL ecosystem, it feels super fast, slick, inviting and easy for the user.\n\n\n\nThe best comparison is SOL is Apple and ETH is Android.\n\n\n\nBoth win. Huge. — Raoul Pal (@RaoulGMI) November 29, 2023\n\nRaoul Pal is known for his commentary in the industry with a basis rooted deep in on-chain analytics; however, choosing to comment on the combat between Ethereum and Solana on pure fundamentals is considered a rare move.\n\nAdvertisement\n\nIn his analysis, Pal compares Ethereum to the Apple of the blockchain world while he considers Ethereum to be the Android. The connotations are clear as Solana wins the fight for performance based on its speed, while Ethereum's massive hoard of hosted decentralized applications (dApps) makes its Android comparison a well-suited description.\n\nSolana and Ethereum have thriving ecosystems\n\nAlmost everything Ethereum can do, Solana can do as well. It appears that Raoul Pal has broad use of some of Solana's applications, as he attested to the ingenious designs of Phantom Wallet, the most popular unhosted Solana wallet. This he confirmed when an X user asked to know what his feedback is for Phantom Wallet and in his response, he said:\n\nAbsolutely love it. Super easy.\n\nSolana has impressed its holders in a remarkable way, with Raoul Pal confirming he has been bullish all year. The coin soared to its 2023 high earlier this month as it wiggles away from the impacts of the continuous sell-off from FTX, the bankrupt exchange that sought ways to free up funds to pay its investors and creditors."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOeWxYT1BEb0ZnTGV5Q2J4MzdLNXUwZHpFWWc4NDNyZ3ZReVNST2dvS3lqSHZlMVh5UzVsSngxSHZrUlZ5OGtMaUhHa3BQZkQtUjRudHh0N29oR3JKUVA0X1c4U0lldFk2UkhOMkNrX3Roa0NZMTRjNU1BUF9tSHI0cTczVTREaGM4UzNTSGJGQ2hITXNE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Outperformed Bitcoin in November –Will it Happen Again? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPRHBES1c1M0pldUVFcjN6dWFlOHEtLXEwUGMyM2Z5U3paNm9XWkl1bk9fN09tSjdQbVlrRGtJcDVFb1BwQjVHQi0tQ09sdHF3YzlGTUVHYjltSDR2b2pESXZxbmR2Q041Tk5RM2pxY1VfRzNGb1pHcE9hQmxqWXdlOHV1bHBBcHNwWlFvU2ZXZTVQOXFZZnJuR3JzaFdqNUxHY3R6cjBPTmx5MWJ5RHRQTVFKenNyVTdNNjBtaVd6RGtLOXdvZ1FIN2pKNjZYVUp0NUo1Z21n0gHbAUFVX3lxTE11amJQMzBFYWk3S1UzNS1fRjRKWkZHZUJpd2JWMzROemJmdlRVMjhVS1NrRzdnSFJFdk94TTFWRXdoc0d0Um9BNS03UzdzWG1zdXBvYW5GRUdIUlFnQVM1UVVQaDlLek1zY204cndFdl9IQ01ZZTdUUWhzRzJfb2FoZ2ItOVVFQUlFMVFFOHAyTlhFTlVSM0lRSDREX2puc05ldlFMUGh1T0ZjTmdZTlJXZnk4WS1TZ2RPekZUQTB3azBBTzZWYmxyYVZ2UzJzVmtVbW9qWmtfWE52VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH top-down analysis hints upside is capped at $2,500 - FXStreet",
        "content": "Ethereum price trades in a clear consolidative trend on the weekly time frame between $1,933 and $2,141 barriers.\n\nThe daily chart for ETH shows a sweep of Monday’s high is likely to be followed by a sweep of Monday’s low at $1,985.\n\nIf Bitcoin price undergoes a steep double-digit correction, Ether could also slide to $1,933 and $1,829 support levels.\n\nEthereum (ETH) price shows an ongoing consolidation with no directional bias. But a closer look at the daily chart shows that a potential correction might ensue, especially if Ether is influenced by Bitcoin (BTC).\n\nEthereum price prediction thesis and short-term bias\n\nAccording to Exchange-Traded Fund (ETF) analysts, Bitcoin spot ETF is likely to be approved in January 2024. This development has caused FOMO among market participants, making the overall market outlook resoundingly bullish. Interestingly, this is one of the main drivers of the 2023 bull rally.\n\nRead more: Week Ahead: Bitcoin’s bull trend in question as spot ETF momentum fades\n\nBut as the holiday season begins to kick in, liquidity in the market will diminish. Hence, cryptocurrency prices are likely to face manipulation. Additionally, Bitcoin price has already started to slow down its rally and has flashed multiple sell signals.\n\nIf Bitcoin price faces a minor correction, altcoins will shed double digits easily due to the nature of the connection between the two. Likewise, the Ethereum price will also see a correction to key support levels.\n\nRead more: Bitcoin Weekly Forecast: ETF delay and weekly swing failure could crash BTC to $30,000\n\nThis top-down Ethereum price analysis takes a look at ETH from weekly and daily time frames and forecasts buy-the-dip levels.\n\nEthereum price at critical levels on the weekly chart\n\nEthereum price has been in a multi-month consolidative trend that has produced an ascending triangle setup. While the technical formation is inherently bullish, it is only after a successful breakout. So far, ETH has not produced any discernible breakouts, just failed attempts.\n\nThe ascending triangle setup contains equal highs and higher lows, connected via trend lines. This setup shows that investors are becoming increasingly bullish and buying dips at an increasing rate.\n\nA breakout above the $2,000 psychological level was the first sign of a bullish move, but there has been a lot of back-and-forth around this level. To be precise, ETH is hovering between the second quarter high at $2,141 and weekly support at $1,933. This has been happening for the fourth consecutive week.\n\nWith Bitcoin’s trend weakening and signaling a potential double-digit correction, Ethereum price might also catalyze a downside move to flush early longs. In such a case, ETH might eye a retest of the monthly open at $1,814 and a sweep of the monthly low at $1,782. This move would constitute a 9% to 12% move.\n\nETH/USDT 1-week chart\n\nETH bulls likely to take a backseat soon\n\nThe daily chart for Ethereum price shows more nuanced key levels, some of which coincide with the ones seen on the weekly.\n\nFor starters, this week’s Monday range extends from $2,071 to $1,985. While the Monday high was swept on November 28, investors can expect a sweep of the Monday low in the coming days.\n\nA quick move to the downside with the intention of sweeping Monday’s range could lead to a steep correction, especially if it is backed by BTC bears. In that case, investors need to take a look at the 40% Ethereum price rally witnessed between October 12 and November 10. This upswing created a local top at $2,138, and the midpoint of this move rests at $1,829, which coincides closely with the monthly open at $1,814 and monthly close of $1,782.\n\nAll in all, the $1,750 to $1,850 range seems like a good place to buy the dip if it ever comes to that.\n\nETH/USDT 1-day chart\n\nWhile the short-term bearish or correction outlook is logical, it is completely contingent on Bitcoin’s sell signals. If BTC lures shorts via a minor correction and proceeds to blast through $40,000, it would obliterate short sellers and cause a massive liquidation event that could sustain a move beyond $40,000.\n\nIn such a case, Ethereum price could overcome the $2,232 hurdle and eye a retest of the weekly resistance level at $2,521."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxONlFIR2ttMFNKb25qc1g3MWJJSXdnQ2xfTU5PUEh6dDZZRURnR1pLemVEc3dGenlEanhJN3BlSk5zN1FXTnI1Y3d1c090LVJ5NEhvZXBNRWV6NFdVTXdIYW9Vb0xoWlUxTVMtWU5ZaEVmSUcxaXlVRFlacklEOGREZUxKMWlHNHNwSFpzTk9abHRKVDVEMjlDb2RTOUtYQVYtRC1HNHBvT3BuUjNOZkRGQjViOGxJVkp0cXdsbmoxRGhtXzA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "The Fabricant’s Fifth Anniversary: Ethereum, Revamped Collection, AI and More - WWD",
        "content": "For its fifth anniversary, The Fabricant makes no bones about its visions of grandeur. In addition to celebrating the occasion with a revamped Deep collection, with artificial intelligence reimagining one of its earliest offerings, it is expanding the digital fashion platform with new integrations.\n\nThese moves matter, executives told WWD in an exclusive interview, because they represent the company’s next step in its evolution — and its ambitions to advance virtual fashion as a whole. The plan, they said, was to finally turn digital fashion into a mainstream movement.\n\nThe work has already begun. It starts with opening up availability for virtual fashion. For Kerry Murphy, cofounder and chief executive officer, and chief technology officer Marco Marchesi, that translates to expanding The Fabricant’s platform to Ethereum, one of the crypto world’s top decentralized blockchain networks, as a way to become a multichain platform. Meanwhile, it is also integrating with Crossmint, which builds tools that make it easier for businesses to build NFTs at scale.\n\nMetaverse skeptics could criticize moves like this, given the tech’s downturn as a cultural phenomenon. But blockchain evangelists beg to differ, and corporate America as well as global brands seem to agree. Not only have fashion brands continued to invest in virtual technology and metaverse initiatives, but Crossmint — a popular NFT partner for some of the world’s most recognizable companies — recently inked another notable deal with Coinbase.\n\nYou May Also Like\n\nThe original “CopyCopyCopy” look from the 2018 collection. Courtesy image\n\nIn an August social media share, the company announced that “the world’s coming on-chain. @coinbase is integrating @crossmint to help Coca-Cola, Atari, and other major companies onboard the world to Web3.” That follows the June launch of its NFT “wallet-as-a-service” to help companies put simplified, interoperable blockchain technologies into their existing products. The same month, rapper Snoop Dogg released a “dynamic” NFT collection, which evolves alongside his tour. He used Crossmint, which can work with fiat currency, as the NFT payment processor.\n\n“Crossmint is the perfect partner to really remove the friction between payments and experience that you get with NFTs,” said Marchesi. “That’s the name of the company itself, ‘Crossmint,’ so they really don’t care anymore what currency you’re using at other servers. And that’s what we need for our community, for our users.”\n\nWith the Ethereum play, The Fabricant’s digital fashions — its own or those of its brand partners — are poised to become more available to a greater number of consumers.\n\nLinking to Ethereum is something of a homecoming for the company. “We sold the world’s first digital fashion couture NFT on Ethereum, back in 2019,” explained Murphy, referring to a high-profile collaboration between The Fabricant and artist Johanna Jaskowska, CryptoKitties and Dapper Labs that resulted in a digital blockchain dress called “Iridescence.” The NFT was hailed as the world’s first virtual-only haute couture dress and sold for close to $10,000.\n\nThe project was more about making a statement about digital fashion, said the CEO, and at the time, it prompted the press to wonder why anybody would pay such a high price for clothing that didn’t actually exist. But soon enough, COVID-19 changed the equation, with people living more of their lives online amid widespread lockdowns. “We became one of the most relevant companies in the fashion industry, and we had all the physical fashion brands calling us up asking, ‘What is this digital fashion about?’” he added.\n\nAs he reflected on his company’s five-year journey, it’s clear that it was quite a whirlwind studded with major figures in gaming, from establishment giant Atari to Web3 hit Star Atlas, and notable names in fashion spanning Rtfkt, the digital sneaker start-up-turned-Nike business, to Virgil Abloh. The Fabricant has been at the heart of millions of dollars in NFT transactions and other investments and not just for partners. In 2021, it scored $14 million in series A funding, which was perhaps fortunate timing. The following year saw a cryptomarket crash that took the shine off of cryptocurrencies and, to some degree, NFTs.\n\nMurphy was quick to note that The Fabricant is not a crypto company, but it does work with the same underlying blockchain technology, so it felt the ripples. “[We] had to really detach ourselves from the narrative of crypto NFT and metaverse, and really focus on digital fashion,” he said, describing it as a highly successful shift.\n\nNow the company is ready to move forward and, once again, timing may be on its side, given recent advancements in artificial intelligence, brands’ growing digital sophistication and greater consumer understanding of virtual experiences. Case in point: The revamped version of Amber Jae Slooten’s Deep collection, as reimagined using generative AI. The original was never available “on chain” before, but the collection totaling seven items will drop on Dec. 14 as part of The Fabricant’s Ethereum expansion.\n\n“Machine” from the 2018 Deep collection. Courtesy image\n\n“Machine” as reimagined by AI in the 2023 Deep collection. Courtesy image\n\nAs for the future, Marchesi pointed to new experiences in development, such as augmented reality dressing. It remains a holy grail in digital fashion, and The Fabricant partnered with Snap Inc. to enable it and, by doing so, it joined myriad players from Google to DressX pursuing the same thing. The key is to not let the technology or complexity get in the way. The CTO sees it as “part of our vision, [which] is about, everyone should be able to wear digital fashion in any context with any device.” The Fabricant quietly launched AR try-on as a beta feature of its platform, as it has been a work in progress, but it’s ready to call more attention to it now.\n\nAnother area of interest is using virtual fashion and realistic AI models for photo shoots. The company wouldn’t disclose details on that on the record, but it is actively exploring this.\n\nThere’s more happening on the fashion front, including some sort of upcoming collaboration with a notable luxury brand, though neither Murphy nor Marchesi could offer details at press time. But coming on the heels of this slew of updates, exploratory projects and efforts in development, it’s unlikely to be a rank-and-file debut.\n\nWhether any of it succeeds in drawing mainstream interest remains to be seen. But one thing seems quite clear — The Fabricant’s swirl of activity in the last five years might be nothing compared to what the next five brings."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE5zLVoyQTNkMTQ0b3VQeGIzczlNUDJyUHFfVDNLcWRLM2ZBNXRNa2JsdWJaRDNBS2h0WGtJSGx3a2FRcnA5VWhLeDVDSGxrQ1U0TXM4MTVMZEhxSkVNVFhxN2twUGlqV2JUS05IZDNn0gFzQVVfeXFMTXdkT1FXZmRob0NsazdDWGRSZUhDWDM1S0tackVQbUNUWmpzQjM0MHBDTnlwSmt4c0gwUFYyU3ZJNlJEcko1OWJSajRnR2xoUWNBYXF5NFEySzk1TTNkQWpURVYwSGYwV3FRMVFBb1JXU1lrRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Ethereum ETF: SEC Kicks Off Clock for Fidelity - U.Today",
        "content": "Advertisement\n\nThe U.S. Securities and Exchange Commission (SEC) has officially acknowledged Fidelity Investments' filing for a spot Ethereum exchange-traded fund (ETF). This follows Fidelity's application on Nov. 17.\n\nThe filing kicks off a public comment period, during which interested parties can voice their views on the viability of such a product. The SEC is supposed to announce its decision after 240 days.\n\nFidelity's Ethereum gambit\n\nEarlier this month Fidelity Investments filed for a spot Ethereum ETF, extending its crypto investment offerings beyond its earlier Bitcoin ETF application.\n\nThe application stressed the importance of such a product for U.S. investors, suggesting that a regulated Ethereum ETF would provide safer investment options compared to the current alternatives.\n\nAdvertisement\n\nThis move gained further relevance against the backdrop of a recent court ruling questioning the SEC’s stance on rejecting spot crypto ETFs while allowing futures-based ETFs.\n\nHigh approval odds\n\nAnalysts James Seyffart and Eric Balchunas have expressed optimism about the approval odds for Ethereum ETFs, citing a recent surge in similar applications and the SEC's evolving approach to crypto-based financial products.\n\nThey estimate a 75% chance of Ethereum futures ETFs being approved, particularly in light of the SEC's prior approval of Bitcoin futures ETFs.\n\nHowever, the market's response to existing Ethereum futures ETFs, which debuted in early October, was underwhelming. These ETFs recorded a total trading volume of around $1.7 million in their initial hours, a sharp contrast to the successful launch of the first futures-based Bitcoin ETFs."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNUXItaGFwcGdXd2pCYXppV1ZDRkRYWWVGSVJwNGlEQmZzcW15YU9rZEJCRWstNFlOaXJ0NEQ2N0ZudWN2Sl9mN1BrU1Y2eTVtVzlKQ2U2UHotUHEtMDRrZFhlcFoyenhwWU1KaThUOFNQaC11a2lDcmVLQjNJaEdGUTV30gGHAUFVX3lxTE1HNUlySS15UkpadFNzSjNFQndWS1N3T1pCUThaTjBDcnhCd2I1d3AwdGlodUJvTndObjk5OVJ0ZUkwNXNPUjFURElnOExtNW5GVjF2Y2RnRTNkamdwNzVpTm1pOG1DS0gyOEZNQ2o4Ri0yVEtZc2pmRGJqbnpxdk8xZGxwTVNhcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Ethereum L2 Starknet Unveils Epic Airdrop, But There's a Catch - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum-based Layer-2 scaling protocol Starknet has sparked a frenzy in the community after confirming the long-speculated prospects of an airdrop. Taking to its official X account, the Starknet Foundation said it is making plans to distribute its native token, \"STRK\" to some of its community members on the condition that they must have contributed at one point or the other to its overall development.\n\nAdvertisement\n\nWhile the Starknet Foundation announcement resounded through the community, it had to sound a note of warning to enable community members to manage their expectations the right way. The outfit said tech teams typically develop a lot of products, many of which may not see the light of day - its way of insinuating that there is a small margin of probability that the STRK token may not be launched.\n\nWe have seen that a preview of an iteration of a possible provisions portal has been shared on social media. As noted a year ago in the original announcement of the STRK token, the Starknet Foundation is developing plans to distribute the token to certain users/contributors for… Advertisement December 1, 2023\n\nWith the excitement brooding since the protocol’s mainnet upgrade and since the rumor started making the rounds, Starknet said there are no actions that its community members will make now that will change the criteria as the screenshots to determine eligible recipients had already been taken.\n\nAs a matter of emphasis, it said further criteria or information that might be necessary for the STRK airdrop will be shared when ready.\n\nCrypto airdrops: A major trend\n\nAirdrops in the crypto ecosystem are not uncommon in the digital currency ecosystem and, in particular, among Layer-2 networks. Airdrops from Blur, Arbitrum and Optimism are among the biggest the industry has seen in recent times.\n\nWhile the Starknet airdrops frenzy is relatively new to the broader community, the most anticipated for now is that of XRP Ledger (XRPL)-based L2, Evernode (EVERS). Per recent statistics shared by the protocol earlier today, there are lots of community members vying to get their own share of EVERS as the protocol sets a legacy as one of the pioneering L2 protocols on XRPL."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOcTFQVDQ4OFdKNU0ydmZvTmJ3WTJGLXBCNS1RejV6dmRyOUJUMmhNLVNsS3VHYUs5NENGeGtGVE1kYUZBbDh0YWRMNlZEWVZFZURpMkwwNlhnWF9ieHRNQXRoOHJpXzQ1dEU4NG1ZVlJPVHdIMU5KT1lqMlVkSnBuclQ1RDQ5dkJ6Y01ab3FVUmFQUdIBlwFBVV95cUxPR0tJdW9vX0dzbkpnN1g4a2JKZTJfWm1iUTFPdGJzTldfcDF5Q0w3NmJNQ0FyUVlvb2oxZjhjZ2h4ZUxwMUc5YXptMG4yMzE0LTRBMk0tNkZFRld2NEtzM01lTzVoR1p4ZzhMUGw1c2ozQ1VKV21ET2lmd19nZ3E1Z2h5Szg0bmtWLTFVOWtXWG43ZWYzdkpZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Is ETH Ready For New ATH In 2024? - CoinGape",
        "content": "Ethereum Price Prediction: Ethereum (ETH) price stayed relatively unchanged on Thursday despite the trading volume dropping by 20% to $8.5 billion. Intriguingly, the altcoin’s market cap is holding up above $245 billion, according to market data by CoinMarketCap.\n\nThis has been a week of consolidation with Ethereum price sitting above the $2,000 level. Recovery has become an uphill battle leaving Ether to wobble between support at $2,020 and a short-term resistance at $2,070.\n\nadvertisement\n\nEthereum Price Prediction: How Far Is Ethereum From Breakout?\n\nThe Moving Average Convergence Divergence (MACD) indicator upholds the mundane sideways trading Ethereum has displayed since Monday. Its downside is protected by the 100 Exponential Moving Average (EMA) (blue) at $2,020 and the ascending trendline.\n\nEthereum price tends to react bullishly every time it has retraced to touch the trendline. Therefore, in case of dips towards the $2,000 mark, bulls could seize the opportunity to buy into ETH while speculating on the next breakout first to $2,200, and later to the subsequent levels at $2,500 and $3,000.\n\nTraders should exercise caution and restraint as long as Ethereum is trading below the short-term resistance at $2,040, as highlighted by the 50 EMA (red). The action above this level and the next resistance between $2,058 and $2,070 would serve as a breakout signal, paving the way for a bigger move to $2,200.\n\nThe momentum indicator will confirm the uptrend’s continuation with the blue MACD line flipping above the red signal line.\n\nA triangle pattern forming on the four-hour chart could nurture a bigger breakout towards $3,000 if validated. Bulls must focus on breaking above resistance at $2,120 to activate the triangle breakout. Most traders would consider going long on Ethereum slightly above the triangle.\n\nRecommended for you: Dogecoin Price Could Blast Through $0.12 Resistance If This Technical Pattern Plays Out\n\nA glimpse of the daily chart assures traders of support at $2,015 but based on the current technical, as depicted by the sell signal from the MACD, ETH might drop again before making another significant recovery attempt.\n\nHowever, backing the bullish outlook in ETH is the position of all three moving averages; the 50-day EMA, the 100-day EMA, and the 200-day EMA. If the MAs uphold the ongoing uptrend, the path with the least resistance is likely to stick to the upside.\n\nEthereum DeFi TVL Shoots To $26 Billion\n\nThe dollar value of all ETH locked in staking protocols and other decentralized finance (DeFi) networks is increasing rapidly. According to data by Defi Llama, the total value locked (TVL) currently stands at $26 billion from approximately $19.4 billion in mid-October.\n\nThe growth in TVL underscores the long-term bullish outlook investors have for Ethereum price. They are willing to lock up their Ether for longer periods, expecting that the uptrend will continue into 2023. A high TVL value significantly reduces the selling pressure.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNZTV3NXVNS2VBZzVhQXNDdExvZ0RhaTB2eVh5ckR1emx2WU1xZnduUTZ4eE4yVDdWYTNLNjI3ZGhVRjhKQ2JYcklfbGg3Rk44Qm9kTGYtdEZOU3hybG5LMWxYdmRLbU4zZDdUdkdfZnJCM2VEVWplcC1ia3pDLVhHaG9GRW5rdDZ3WEF6QnpXSXZBNnZfdm9BaTN30gGfAUFVX3lxTE1zNWVwaGRyU2VBUDJTdXo2MDVwdTVoQWZITk1kSUl3Q1lmelRVQlM4T09heFdNLTNmZTVlcWNFWU9MTmdmekFGUG9pY0ZhNnYxMnZKam04OV9oTlVGT0lEV3MyWW5YaV9YeTgxcVpWNEdDYVN6eFkwdnpvbGFZNUJqRVJOeXlmcWd2bkI3aFQ0b2d4UEd5WXNIRDRNOVJNbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Celo’s L2 Quest: Evaluating Tech Providers for Ethereum Boost - Crypto News Flash",
        "content": "The lead developer of the Celo blockchain has published a “Framework for selecting an L2 stack” amidst intense competition.\n\nThe community voted to move to a more dominant and fast-growing Ethereum ecosystem with the community now set to choose a a technology provider for its new layer-2 network.\n\nThe Celo blockchain is moving forward with plans to migrate to a dominant and fast-growing Ethereum ecosystem. Ahead of the upcoming migration, the blockchain’s primary developer, cLabs, has published a proposed framework for selecting a layer two technology provider. The guideline dubbed “a “Framework for selecting an L2 stack” seeks to facilitate the selection of a layer-2 technology provider.\n\nCompetition is high between layer-2 technology providers like Optimism, Polygon, and Matter Labs, fighting to integrate with the Celo blockchain for greater adoption and success of the two networks.\n\nRelated: Breaking: Celo Blockchain Set to Join Ethereum Ecosystem with Transition to Layer-2 Technology\n\nThe team is now calling on the community to participate in discussions to help build and incorporate the common consensus of the whole community. The team adds;\n\nNote that we are selecting codebases and sub-components here, so we feel it is less useful to directly compare metrics like TVL, transaction count, users, except as indicators of what a closer collaboration and/or shared bridge between the two ecosystems could look like in future. This exercise is not to select a “best L2 stack”: it’s to figure out which is the best fit for the specific technical and non-technical needs of the Celo L2 project.\n\nThe team has indicated that it’s looking to deliver CEL2 as soon as possible, minimizing implementation risk. It further notes it will “favor projects that have been audited and deployed and proven in production, vs. projects whose designs are subject to ongoing change or whose implementations are not yet proven.”\n\nIt further highlights that some of the technical considerations will be Ethereum compatibility, security, maintaining comparably low gas fees, preserving single block finality, preserving token-based gas currencies, and the opportunity to inherit new features.\n\nFollowing the announcement, the network’s native token CELO has posted positive results, adding nearly 2 percent in the last 24 hours. At the time of press, the altcoin is trading at $0.535166. This year, the token has added around 41 percent. This and other upcoming upgrades will play a huge role in seeing the token go back to its all-time high of $9.83 reached nearly two years ago.\n\nAs CNF recently reported, Polygon and Celo joined forces to spotlight blockchain-based projects making significant positive impacts worldwide. Rebecca Rettig, Chief Legal and Policy Officer at Polygon Labs and Advisor at Electric Capital voices immense gratitude and optimism for the future as Polygon and Celo collaborate. The collaboration aims to broadcast testimonials from Celo ecosystem founders detailing the profound changes their blockchain initiatives have brought to the global stage.\n\nRead More: Transforming Tech for Good: Celo and Polygon Collaborate in Billion Dollar Market\n\nRecommended for you:"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOWjdrdS1CTXRjZnNWUTc5Wk10blczZGY0dVFaNE5pdVVmdkFGZk9mdkMxOGV6NGN4VGdPNXVBMDhYbWxVTlBjT08tMlJxdzV2dHFXZG5Fc09hOVVvRWs3QUxReDZtMkdDMmN3RXZOOU55NXh1RFBtaHYyME1TT1ZKSTZuT1JkbXdFT3haU0dDZ0w0bzdlU09QSkU0ODdvdmhPTENlRjZVMktwZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "A complete guide to fast and secure bridge from BNB to Ethereum (ETH) - The Cryptonomist",
        "content": "The bridging of BNB BEP-20 tokens to the Ethereum network (ETH) opens up new avenues for users seeking increased liquidity, accessibility to DeFi applications, enhanced security, and improved interoperability.\n\nThis guide illustrates a simplified process for bridging tokens from Binance Smart Chain (BSC) to Ethereum (ETH) in four simple steps.\n\nThe advantages of BNB to ETH bridge\n\nIncreased liquidity:\n\nThe migration of ERC-20 tokens to the Ethereum blockchain significantly amplifies liquidity, mitigating price volatility associated with smaller markets. A larger liquidity pool ensures smoother token transactions, offering users greater trading flexibility.\n\nGreater accessibility:\n\nWith the transition of BEP-20 tokens to the Ethereum blockchain, users have access to a wider range of applications and services in the DeFi. These include lending protocols, staking, and trading, creating opportunities that may not be available on the BNB Chain, thus diversifying user engagement in the decentralized finance ecosystem.\n\nSafety:\n\nThe use of the robust network security of Ethereum ensures greater decentralization and security of user funds. The Ethereum blockchain, renowned for its resilience, becomes a reliable foundation for safeguarding assets during the bridging process.\n\nInteroperability:\n\nThe bridging of BEP-20 tokens to the Ethereum blockchain promotes greater interoperability between the two networks. Users can transfer tokens seamlessly, facilitating a smoother experience across the different functionalities offered by Binance Smart Chain and Ethereum.\n\nHow to transfer BNB to ETH in 4 easy steps\n\nPhase 1 – Connect the wallet\n\nVisit the Binance bridge (with attached login) and connect your wallet, which supports a range of options. Choose the wallet containing the tokens to be connected.\n\nPhase 2 – Select chains and tokens\n\nChoose the source chain (BNB) and the destination blockchain (Ethereum). Select the specific token from the dropdown menu or paste the contract address if it is not listed.\n\nPhase 3 – Setting gas rates\n\nSelect the desired amount of gas for bridge tokens, which affects transaction speed and costs. The recommended settings are standard or high to achieve optimal bridging results.\n\nStep 4 – Confirm the transaction and obtain the tokens\n\nExamine the details of the transaction, including wallets, gas fees, and tokens. Confirm the transaction and wait for processing. Once completed, the tokens have been successfully transferred to Ethereum.\n\nHow to calculate gas fees?\n\nTo calculate gas fees for a transaction from BNB to Ethereum, determine the gas price and gas limit.\n\nMultiply the gas price by the gas limit to obtain the total gas fee. Gas prices can fluctuate, so it is good to adjust accordingly for timely processing.\n\nMinimize costs by adopting a low-price gas strategy, comparing rates from various bridge services and considering factors such as reputation and security. Balance cost effectiveness with reliability to achieve an optimal bridge.\n\nConclusions\n\nA blockchain bridge facilitates the seamless movement of assets between blockchains, allowing users to leverage different ecosystems. Decentralized and centralized bridges offer different features, ensuring flexibility in asset transfers.\n\nThe transfer of BEP-20 tokens from Binance Smart Chain to Ethereum unlocks a series of advantages, including increased liquidity, accessibility to DeFi, enhanced security, and interoperability. Users can seamlessly navigate both ecosystems, maximizing the potential benefits offered by each blockchain."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPWHdjQ2xUTXFtUGVjRXFWcTFmRXFtdXJTdHZqeU9manR6VjdHQWpGblVsSWZ5V0dGZXpPS01kbEhJZVdOWWFseXY5QzA0czhEVk1GZEFSMVN3WWZLUVFvZEhra0hGNnhXZnNXSUhQQmpzVExlOVloN2dsSjR5bGxmNE1wUGxkUFVONjBDd0ItWXp4Vmc0bFNxeUh5Wk84d1ZHTU9KWmtFMFFjN1BUT3pB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH): Time to Take Profit? Whales Cashing Out By U.Today - Investing.com",
        "content": "U.Today - market dynamics are often a tale of whose trades can signal shifts in market sentiment. Recently, a whale transaction caught the eye of many, as 3,150 ETH, valued at approximately $6.37 million, were sold at an average price of around $2,023, netting a substantial profit from an earlier purchase of 2,762 ETH at $1,825 each. This move has prompted discussion among traders: is it time to take profits on Ethereum?\n\nThe chart reveals a critical juncture in price action. After a period of bullish momentum, is now testing local resistance levels, creating a moment of decision for investors. The current resistance, formed near the $2,050 mark, is a crucial threshold that has previously prompted sell-offs, suggesting that traders are eyeing this level to secure gains.\n\nConversely, the support levels paint a picture of potential bounce-back zones. The first significant support is visible near the $1,950 level, aligning with the 50-day moving average. This moving average has historically acted as a dynamic support, propelling prices upward upon contact. A break below this, however, could see Ethereum's price target the next support at approximately $1,850, where previous demand coalesced to halt bearish runs.\n\nThe probability of a price reversal hinges on the to these critical technical levels. A convincing break above the current resistance could invalidate the bearish thesis, potentially leading to a continuation of the upward trend. However, recent whale activity suggests that some large holders are starting to realize profits, potentially adding to the selling pressure at this price threshold.\n\nVolume trends also provide insight, with a notable decrease in trading volume suggesting that the current price level may be unsustainable in the short term. Combined with the whale's cashout, it could signal a broader sentiment shift among investors, leading to increased volatility and a possible price correction.\n\nThis article was originally published on U.Today"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxObkk5M096Z09SQVNBOGZCZUVEaUZJSHFzUGZMOVZXMUtER0cyT3o1SjZUTEN6WFRaYVJEdno0empFSWFqQ3FCakpRenFNYkEzbzFseVZCSUFzU2lHc3EwM3dic1ctZzh4RFBJZGJmdTZsakFlalRERkxONnEwblFNa3dCRGlVd25VcDJzYmpGTjc5VlNPek8xWWtn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Crypto saw lots of chaos, charges and price changes in November - TechCrunch",
        "content": "Welcome back to Chain Reaction.\n\nTo get a roundup of TechCrunch’s biggest and most important crypto stories delivered to your inbox every Thursday at 12 p.m. PT, subscribe here.\n\nLast week we didn’t publish a Chain Reaction newsletter, thanks to Thanksgiving. But we’re back at it this week and saying goodbye to November after a long, eventful month filled with lawsuits, price changes and the typical crypto chaos.\n\nLet’s get into it.\n\nWhat’s happening in web3\n\nThe latest pod\n\nFor this week’s episode, Jacquelyn interviewed Optimism’s CEO and co-founder Jing Wang and chief growth officer Ryan Wyatt.\n\nOptimism is an Ethereum-focused layer-2 blockchain that focuses on scaling and speed, while also lowering costs for users. It helps users interact with Ethereum for about 10x cheaper through its blockchain and provides developers the ability to build decentralized applications (dApps) in a faster, scalable way.\n\nBefore taking on this new role at Optimism, Ryan had a little bit of a break, but was the president of Polygon Labs (he came on the podcast at the beginning of the year to talk about it) and before that, he was YouTube’s head of Gaming.\n\nJing co-founded Optimism in 2018. Before that she founded Plasma Group, a research firm focused on addressing challenges related to scaling Ethereum. She also previously managed blockchain projects at companies like Zcash and Nasdaq.\n\nWe discussed how layer-2 blockchains like Optimism are trying to solve scalability issues on Ethereum and where Jing and Ryan see growth opportunities right now.\n\nWe also talked about:\n\nBase building with Optimism’s tech\n\nCompetition between Ethereum and other blockchains\n\nLong-term adoption\n\nWeb3 gaming\n\nSubscribe to Chain Reaction on Apple Podcasts, Spotify or your favorite pod platform to keep up with the latest episodes, and please leave us a review if you like what you hear!\n\nFollow the money\n\nAcctual raised $3.85 million to help crypto companies better manage their bills Web3 education platform Open Campus got a $3.15 million investment from Binance Labs Wind.app raised over $3 million to make DeFi accessible to average consumers Decentralized perpetual exchange MYX raised $5 million in a seed round at $50 million valuation Blockchain-built fitness and wellness app Coral got a $3 million investment from TealLink\n\nThis list was compiled with information from Messari as well as TechCrunch’s own reporting.\n\nWhat else we’re writing\n\nWant to branch out from the world of web3? Here are some articles on TechCrunch that caught our attention this week.\n\nFollow me on Twitter @Jacqmelinek for breaking crypto news, memes and more."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxNTnBKUXE0RnVSekNoTUs4VWVac0F4MDd1UTNDN0s1elRyR1dYaFJVMUZlNEZEUkxtVGwxaXNmbG5uSC1HdDJJLXEzMm9JaG0zSjI5Mkl6ZHYxRDhmVkRQVER6SUJIM2NFMXRlREE3YkwyVUpjOFZ6dlRTZTUwQkpSZ3hwTV9GWGt6Z0hFRnROMzZOZ0dEYl92dTlZLTdVWmZjVlEyRlM5TXpGblB3NW11Qm1DcGpqYXQ5cnlsV3g1c1FkN2FLT0ZFRkdPSEhaQlE5eUE1TXFKeHZhdDRHMFV0b3VGWXBMQVh2YUFTai1n0gHzAUFVX3lxTFBpeTRKQncteGxBSlZSc2dmYVdDM1V6WkY0MFowRTFtM0lYSExkX2c0YUgxNG83UnplM1BodDBOVTJkUVdpdm5wODFvdDdLS01CN2FFd2lGYlNFMldqaEZvTFRtYWd2ZFk2ZjVPMUE0dnZMTmp4bjNBRFlDcTJjeHRsckc2SERpU0JoR0ExZ2xIVVpRa1RzMjRTUk56ZGlEbGw1Rm93c29TNmF3VEVlMlVkbzktanRVVFQ5bUltTExwWkFObWZjLUpOYV90ZnFEQVpQVWhKOE1Oc01yVk45OHhwYWthbUR2UWxubElGUGwxejVVRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Charles Hoskinson and XRP community in loggerheads again, debate on Ethereum’s free pass resurfaces - FXStreet",
        "content": "Charles Hoskinson has addressed the rumors of Joseph Lubin of ConsenSys bribing the SEC to go after XRP.\n\nHoskinson finds himself in a similar situation as Brad Garlinghouse, as the SEC considers ADA an “investment contract” in its lawsuit.\n\nThe Cardano founder has asked the XRP community to present evidence of the bribery allegations and dispels the rumors.\n\nCharles Hoskinson, the founder of Cardano, engaged in a debate with the XRP community over the rumors of ConsenSys founder, Joseph Lubin, bribing the US financial regulator. The rumors seem unfounded and the XRP community has failed to present evidence supporting the claims.\n\nAlso read: LUNC ranks among trending tokens alongside Dollar pegged stablecoin USTC, eyes recovery\n\nCharles Hoskinson addresses rumors surrounding Ripple lawsuit\n\nCharles Hoskinson, the founder of Cardano is one of the co-founders of Ethereum. Hoskinson has been embroiled in a debate with the XRP community over alleged rumors of ConsenSys founder Joseph Lubin bribing the US Securities and Exchange Commission (SEC) to give Ethereum a “free pass” and go after Ripple. Here free pass meant Ethereum was allowed to conduct business as usual while Ripple was hit by a lawsuit.\n\nIt is important to note that Hoskinson currently finds himself in a similar situation to Brad Garlinghouse, the CEO of Ripple, in 2020. The US SEC slammed Ripple with a lawsuit, alleging the unregistered sale of securities, here securities meaning XRP. The SEC has listed Cardano as an investment contract in its lawsuit against Kraken, a cryptocurrency exchange. It is therefore clear that the regulator considered Cardano an investment contract.\n\nHoskinson commented on the rumors stating that the XRP community needs to present evidence to back its claims, or else he finds it a “grand conspiracy.”\n\nFor the argument that Joe bribed the SEC to go after XRP that is the conclusion. That is the entire point of calling it a grand conspiracy. The free pass has nothing to do with the case against Ripple. They are unrelated events. Two years now and you haven't provided any evidence… — Charles Hoskinson (@IOHK_Charles) November 30, 2023\n\nJoseph Lubin is involved here as ConsenSys is software production studio that offers clients enterprise Ethereum solutions. The tight relationship between ConsenSys and Ethereum gave rise to the rumors, however, no evidence of bribery has been presented so far."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPdGFsVmNUMjVZQzZHX1Z5eldIYnNIMWNTMl9YUkxSaGxSSmFoYjNpVVl2eHZUQWhvaGhpUGFLOGk2aHJLWnZ5OVg5S2FqMy15bGNOcnZ6OV9JWjZvYzFuTFNMRUhJYnlPVlhIZXRWUlJOSTB2am5kNUlFNmJhdTNDZ1l3U2tVTEhRc3ZjUEFBMnU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Decline in ETH/BTC ratio shows Bitcoin’s rising market dominance - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE5ycXVDRDh4LTJ0eFRDVXpwSnNvSldpYWp2azJwM1JYd3BkMldhRUN1TE95Z0JqNlp1R09aSFJZUUFmQzAwWVN6cTdEcEE4ckMxZllqdFNNLVVVTGVvTnh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Top 10 ERC Token Standards You Need to Know - Securities.io",
        "content": "Learning about the top 10 ERC token standards can help you succeed. The Ethereum ecosystem is the largest and most popular blockchain community in the world. Ethereum has always been a strong contender in the market due to its pioneering efforts and proprietary technology.\n\nWhen you review the rise of this mighty crypto community, you can't help but realize the prominent role that token standards have had on its journey. Token standards can be seen as one of the most influential developments in the industry.\n\nPrior to token standards, you had multiple developers working on projects that may or may not be able to communicate and interact with other protocols. The introduction of standards to the crypto market, as any, helped to drive innovation and has led to a constant expansion of the most popular networks. Here are the top 10 ERC-20 token standards in use today.\n\nERC\n\nERC (Ethereum Request for Comment) is a set of guidelines to ensure interoperability between new and old dApps and platforms. The original goal of the project was to streamline the creation of digital assets in-house. However, it quickly became popular for regular users and startups to expedite token creation.\n\nThe ERC token standardization movement has seen considerable growth alongside the rising number of formats available. Each of these token standards serves a unique purpose that makes it ideal for its tasks. From compliance to scalability, there's a token standard to meet your needs.\n\n1. ERC-20\n\nThe first token standard to hit the market was the ERC-20 standard. This standard emerged in the middle of 2017 after Vitalik Buterin and the rest of the Ethereum team realized that people wanted a simplistic way to launch tokens. The results of making the ERC-20 token available to everyone were immediate.\n\nThe ERC-20 standard has helped thousands of startups and developers create tokens and platforms that seamlessly merge with the Ethereum community. Notably, the standard is still widely used today, even though the competition has increased and new standards offer more specialized functions.\n\nThe ERC-20 token standard is a capable solution enabling developers to create fungible and non-fungible assets. This standard is capable of tokenizing real-world assets as well. This flexibility and its role as the first and most popular standard has made ERC-20 the top option in the market today for many. It's mostly found in stablecoins, governance tokens, and project launches such as ICOs.\n\n2. ERC-721\n\nThe ERC-721 token format was created to serve the growing NFT community. NFTs are digital assets that can represent individual assets. As such, they are best used for gaming, collectibles, and tokenization. The ERC-721 standard was made famous by the collectible game CryptoKitties.\n\nERC-721 was first proposed by William Entriken, Dieter Shirley, Jacob Evans, and Nastassia Sachs in January 2018. The standard differs from its predecessor in some key ways. For one, it leverages an API for tokens built directly into smart contracts. This structure adds more functionality, such as the ability to approve third-party transfers. All of these factors make ERC-721 a smart option for game and collectible developers.\n\n3. ERC-1155\n\nThe continued expansion of the Ethereum ecosystem led to the eventual creation of the ERC-115 protocol. This token standard was first introduced by Enjin CEO Witek Radomski. The goal of this standard was to make a more inclusive option for developers. As such, it combines many of the features of the previous two standards.\n\nThis token standard leverages a robust interface that enables developers to fulfill deployment requirements and correct any issues that arise from one location. ERC-1155 can represent all types of digital assets, including non, semi, and fully fungible assets. Today, the token serves a crucial role as a go-to option for NFT game developers. It's also used in ICOs, digital ID systems, and gaming applications.\n\nERC-115 provides added functionality without reducing security. Developers have found that this standard is a bit more programmable than its predecessors and can scale more efficiently. Consequently, many developers have turned to ERC-1155 to solve their issues and launch their platforms.\n\n4. ERC-777\n\nThe ERC-777 protocol improves token management services for developers. The system allows creators to add more specifications on how and to whom their tokens can be transferred. This added logic makes it better suited to certain applications, such as dealing with regulated tokens and fixed assets.\n\nThe ERC-777 protocol has many benefits that make it stand out against the other options. For one, it supports unique options such as automatic swaps and send-and-receive hooks. Additionally, all ERC-777 tokens are backward compatible with ERC-20 token standards, adding to their interoperability and ease of use.\n\n5. ERC-1400\n\nThe rise of security tokens led to the creation of the ERC-14000 tokens standard. This standard emerged as a viable way to help solve some of the regulatory issues that ICOs had encountered the years prior. Security tokens are unique in that they have all regulatory compliance tasks built directly into their core coding.\n\nThis structure means that these tokens can be used to tokenize regulated assets such as real estate. The system enables developers to meet all regulatory criteria without exception. Additionally, since all the security token requirements are baked into the token itself, the asset remains compliant throughout its life cycle.\n\nERC-1400 is a popular token standard that is in use across a variety of industries. Today, you can find developments in tokenizing equity, property, debt, and much more using this standard. This standard has also found a home in the art sector where its features can help to demonstrate ownership and validate projects.\n\n6. ERC-4337\n\nOne of the safest ways to use crypto is via a multi-sig wallet. These wallets require multiple people to sign off to transfer. The same concept now goes for tokens. The ERC-4337 standard supports multi-signature wallets on Ethereum. This structure makes it easier to solve complex ownership issues and create more innovative structures around assets.\n\nERC-4337 tokens are a great way to ensure that all parties approve of the token's actions. Additionally, these tokens have found some use in governance mechanisms. Here they can ensure that only after the signers approve changes do the upgrades occur. ERC-4337 offers security, scalability, and transparency to the market.\n\n7. ERC-512\n\nNFT technology is often seen as the best option for representing digital assets. However, many people overlook its use as an identifying token. Decentralized identity management systems are on the rise, and for good reasons. They lower costs, increase efficiency, and provide high security.\n\nThanks to this token standard, implementing these digital ID systems is now easier than ever. This standard was built from the ground up to handle verification tasks such as verifying claims and credentials. Additionally, the standard is the first to support ID management systems. These systems help to protect your ID and the systems they operate within.\n\n8. ERC-6551\n\nThe ERC-6551 tokens standard was created to help reduce gas prices for transaction-intensive Dapps. The Ethereum gas price concerns have been an issue for years. The network has implemented many updates to lower these fees, but many still desire a token standard that makes this process easy.\n\nThe ERC-6551 tokens standard helps resource-intensive dApps and blockchain networks remain responsive. To accomplish this task, the protocol enables the batch processing of transactions. This feature lowers the gas prices significantly for these dApps. It also reduces network congestion.\n\n9. ERC-4626\n\nThe ERC-4626 tokens standard is the evolution of the space. This next-generation standard improves the communication between network nodes and smart contracts significantly. These tokens are designed to reduce complexity by integrating self-describing smart contracts.\n\nThese smart contracts make it easier to build complex dApps from scratch. They enable creators to offer more features and track their assets with more clarity. Additionally, their versatile nature makes them a smart option for many of the tasks that traditional ERC-20 tokens would handle.\n\n10. ERC-998\n\nThe latest trend in the NFT race is composable tokens. These are NFTs that can be created on top of each other. They are often used in gaming scenarios where users can customize their avatars or other items. This feature enables developers to create and manage complex token structures across vast networks.\n\nCurrently, the ERC-998 tokens standard is used to create collectible and gaming tokens that can be upgraded via other token add-ons. They are often used in DAOs to improve transparency. Lastly, the standard provides a reliable and effective way to tokenize real-world assets quickly.\n\nTop 10 erc-20 token standards – Just the tip of the Iceberg\n\nIt's exciting to see how the Ethereum community has continued to keep up with the changing market by expanding these token standards. Today, developers have more tools and options to consider when creating. Understanding the different token types and their purpose can help you create better dApps that cost you and the user less. As such, the Ethereum token standard movement can be seen as a pioneering force in the market that will remain a strong contender for the foreseeable future.\n\nYou can learn more about exciting blockchain projects here."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9IZVd0LVMxNnNQcFJPQ01UbXNxWFpaZEtJNUVZZDdqUVRFNmxGWk5POXVEV3hha2RzTE01Smx6S192Sk5JemVtMUk5MlN3d2hsNjd6QVREMGVzY2xNNDRwcGUxY05qUU80amo4bzBGY0JkYWZQ0gF8QVVfeXFMT2ZDUnV3YWxGYWdXSUprVDdwSzhYMUZBcS1WMTZPNnVFZ0NGZnJYc2tCSEtyRTJHMm9PVDlaTUFlczRSUEg3RExXTk02S2UzNy1lSzlBUC1hV1hqOThrOVhjdzZ1alJId21kcC1GUDlsS3FlWk1RbHRvNjFLRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Aragon Expands DAO Ecosystem with Deployment on Arbitrum - AlexaBlockchain",
        "content": "Aragon, a pioneer in DAO technology, has deployed its modular Aragon OSx DAO framework and no-code Aragon App on Arbitrum, Ethereum’s leading Layer 2 (L2) solution. This integration unlocks new possibilities for DAOs by providing them access to a thriving ecosystem of protocols, applications, and assets.\n\nArbitrum, known for its rollup technology, has established itself as the industry’s most popular L2 solution with over $7 billion total value locked and 55% of the L2 market share. By choosing to launch on Arbitrum, DAOs stand to benefit from several advantages that can potentially revolutionize their operations.\n\nReduced Gas Costs and Increased Voter Turnout\n\nOne of the most immediate benefits of operating on Arbitrum is the substantial reduction in gas costs. Ethereum’s high gas fees have long been a concern for DAOs, as they can significantly erode resources. By transitioning to Arbitrum, DAOs can conserve valuable resources while simultaneously incentivizing increased voter turnout, as lower transaction costs make participation more accessible to a wider audience.\n\nSimplified Custom DAO Deployment\n\nBuilding custom DAOs on Arbitrum is made remarkably straightforward, thanks to the platform’s full Ethereum Virtual Machine (EVM) equivalence. This feature streamlines the deployment of custom integrations and allows developers to harness Ethereum’s extensive developer ecosystem to tailor DAOs to their specific needs.\n\nEnhanced Security and Speed\n\nArbitrum’s close association with Ethereum ensures that DAOs launching on this L2 solution inherit the robust security features for which Ethereum is renowned. This not only guarantees a safer experience for users but also provides a seamless transition for DAOs seeking to establish themselves in the broader Ethereum ecosystem.\n\nFurthermore, Arbitrum offers faster transaction speeds, significantly reducing the time required for DAO administration and governance activities. This acceleration in transaction processing can contribute to more efficient decision-making and overall DAO operations.\n\nIvan Fartunov, Head of Ecosystem at Aragon, said: “Arbitrum is by far the most adopted rollup in the EVM ecosystem, both in terms of Total Value Locked (TVL) and protocols launched on the network. In addition to being home to impactful multichain projects like Stargate, Arbitrum has spurred many exciting native projects like GMX, Tenderize, and Plutus. We are excited to join such a vibrant ecosystem.”\n\nAragon’s commitment to accessibility is evident in its no-code solutions, which have already facilitated the launch of over 7,000 DAOs across Ethereum Layer 1 (L1) and L2 networks. Now, with Aragon available on Arbitrum, communities can create a DAO in under 10 minutes and manage their assets transparently through a user-friendly app.\n\nThe secure and modular design of Aragon OSx opens doors for protocols deployed on Arbitrum to customize their governance with plugins, including multichain governance and optimistic dual governance. This flexibility enhances the potential use cases for DAOs and underscores the growing synergy between Aragon and Arbitrum in their mission to bring more participants into the Ethereum ecosystem.\n\nRead Also: Introducing Dark Fusion: The Future of Smart Contracts and Tokens on Bitcoin"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxQeE9pWWFQS0RHZ01tV3hXa3BONU9yMENfR2h5alg1QXhaT2Q3LVpBdGp3dFNEWFFhVGVObnNYOTZlZS1vMEpEX3ptcENCZm9qdHp1QVk3ZEVtY0VzczdxQUp6bW0wdld6cHRaMDdRb1VNSEZjd0U3S0otWkhMNHZ6V1h3cWkzUjR3b3dqT3pFajNFZUlsMEJXVXBxd0NrWkRycW5zeE1IVmdXbnJrTHhoY0lKcTZlRVJ1SFM3YTNvWkVMVTlMbnJYeFdTY2k1MXd2OWFRR2FWaDQ0Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Will XRP Make You Rich? Here’s What XRP Price Looked Like 5 Years Ago When ETH was $102, and Cardano $0.0328 - The Crypto Basic",
        "content": "Recently, XRP community members looked back into history to compare XRP’s price through their years of holding on to the digital asset with respect to the performance of other competing crypto projects.\n\nPer statistics from authoritative sources, XRP appears to be the worst-performing cryptocurrency when compared to others ranking in the top ten, like Bitcoin (BTC), Ethereum (ETH), and Cardano (ADA).\n\nXRP Price Five Years Ago\n\nToday, five years ago, data from prominent market tracker CoinMarketCap shows XRP traded at a low of $0.3625 and a high of $0.381. At that time, it had a market cap of $14.61 billion, with a 24-hour trading volume of around $512 million.\n\n- Advertisement -\n\nThroughout November 2018, the highest point XRP reached was $0.5605, while its lowest was $0.325, per CoinMarketCap statistics.\n\nXRP’s lowest value five years ago, when compared to its price of $0.6 today, suggests the token has again only 86.45% all the way from 2018 to 2023. On the high side, with $0.5605, XRP has seen only 8.12% in five years.\n\nBitcoin Price Five Years Ago\n\nMeanwhile, on November 30, 2018, BTC traded at a low of $3,942.82 with a valuation of $69.9 billion and a trading volume exceeding $6 billion. The firstborn crypto’s lowest value for November 2018 was $3,585.06, which translates to a 957% gain when factored against today’s price of $37,902.\n\nEmphatically, Bitcoin’s value five years ago compared to today implies BTC investors have reaped more than ten times more profit than XRP investors.\n\nETH and Cardano Price\n\nSimilarly, Ethereum exchanged hands at a low of $111.74 today five years ago, with a market cap exceeding $11,7 billion. In the same month, ETH bottomed at $102.45 and has grown 1887.71% since then to $2,036 today.\n\n- Advertisement -\n\nIn other words, investors who bought ETH’s dip in November 2018 have seen 21 times more profit than those who bought XRP’s dip the same month. Likewise, Cardano sold at a discount of $0.0328 in November 2018. However, ADA’s value has risen 1,053.05% since then to $.378.\n\nCrypto Community Reacts\n\nA crypto enthusiast with X username “@Ianbins” put XRP’s five-year value alongside rivalry tokens with a satirical comment.\n\n“Buy XRP, they said; it will make you rich, they said,” he mocked, given that XRP’s current value is not much different from November 2018.\n\nMeanwhile, Bill Morgan, a lawyer known for his pro-XRP stance, remarked:\n\n“Wow. I never realized XRP’s price performance was this poor compared to other major coins and not only compared to Bitcoin and Ethereum.”\n\nWow. I never realised XRP’s price performance was this poor compared to other major coins and not only compared to Bitcoin and Ethereum. It has of course been under the cloud of a SEC investigation and then lawsuit that entire period but you would think it would have caught up… https://t.co/Eyflqp0JZq — bill morgan (@Belisarius2020) November 29, 2023\n\nNotably, the XRP Army has argued the multi-year regulatory battle against XRP had hindered its performance. Following the court ruling in July, XRP reached $0.93 but has since lost those gains.\n\nNonetheless, it remains to be seen how XRP will perform in the coming years with the U.S. regulatory fight out of the way."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxONmlNeFgxMzhjd25fVnYzOEo4MGtxUFVocEZSbF9wTEhJWVpUbElvRXJKTWtRZllGTF93dHREeVdwdkF1b1pfMW8zTTFyZ3pUZXJnQ3dsVWQzY2d1akRBV3UxeTVESGZNSGZFTzM5OVZzQ28weHl6UXJQVlF1eHVrMnVYSnIxZHQzWTBDMXBKTks3LVdtdlhUZkxWTlo2cHpVLTd3OEpYcnRkMkd2ZVRTTjJLOENxQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "How to make cryptocurrency bridges from the BSC network to ETH or vice versa - The Cryptonomist",
        "content": "In this article we will see how to perform a cryptocurrency bridge from the Binance Smart Chain (BSC) cryptographic network to the Ethereum Mainnet (ETH), or vice versa.\n\nThe bridge represents a cross-chain transfer of digital currencies between different blockchains that, by their nature, cannot overlap and must travel on different roads.\n\nTo carry out this type of operation, we can rely on both non-custodial solutions and custodial ones.\n\nThe former maintain the component of decentralization, typical of those who want to operate in complete privacy and in a trustless mode, while the latter represent a valid alternative for those who handle large amounts of capital and prefer to enjoy greater protection in terms of cybersecurity.\n\nLet’s see below all the details.\n\nCrypto bridges from BSC network to ETH or vice versa: the best protocols\n\nOne of the most popular solutions for bridging cryptocurrencies from the Binance Smart Chain (BSC) to the Ethereum Mainnet (ETH), or vice versa, is to use decentralized interoperability applications.\n\nWith this specific genre of protocols, crypto such as BNB, USDT, and USDC can be easily transferred between the two networks, which due to their nature normally cannot communicate.\n\nTo use them, it is essential to have a non-custodial crypto wallet, such as Metamask or Trustwallet, and be familiar with the practices and operations typical of web3 and DeFi.\n\nAmong the most quoted and reliable applications in the specific case of the BSC to ETH bridge, we find: Stargate, Meson, Symbiosis, Orbiter Finance, and Layerswap.\n\nAll of them represent a quick and economical option that with a few minutes of waiting and a handful of dollars, will allow your tokens to teleport between blockchains.\n\nFurthermore, the liquidity on them is sufficient to guarantee the perfect functioning of operations. Stargate is by far the most popular platform in this regard, to the point of recording a volume of over 220 million dollars in the bridges of the last 30 days involving the BSC.\n\nIt is estimated that the entire cryptographic network during the same period supported a total volume of 349 million dollars across all existing applications\n\nIts dominance is largely due to speculation about an alleged LayerZero airdrop that could be released specifically to Stargate users.\n\nNow let’s see practically how to perform a bridge from BSC to ETH, using the platform just mentioned as a reference.\n\nThe mechanism is identical in any other solution, with the only difference that some cryptos may be available for transfers on one platform rather than another.\n\nOnce we have entered the official Stargate website, we go to the “transfer” section, select the type of currency we want to transfer, and select the sender and recipient networks.\n\nLet’s enter the total number of tokens to be bridged and click on the “transfer” button.\n\nAs in the following example, after a few minutes the USDT sent from BSC will be visible on ETH and can be used immediately within this ecosystem.\n\nObviously, like any operation on blockchain, this one also incurs commission costs, which in the case of the bridge from BSC to ETH can reach a few dollars, while from ETH to BSC it could sometimes exceed even more than 20 dollars (it depends a lot on the gas cost on Ethereum).\n\n\n\nThere are actually applications like Sushiswap, which have implemented the so-called “cross-chain swap”, which allow you to simultaneously execute a swap between two tokens while they are being transferred from one chain to another.\n\nWithdrawal of crypto from exchanges as a secure custodial solution for cryptocurrency bridging\n\nAnother method to bridge cryptocurrencies between the BSC and ETH networks is to use centralized exchanges as a support base to deposit funds from one network and withdraw them from the other. This is not a true bridge, but it still represents a very valid alternative solution.\n\nIf, for example, you have some USDT on the BSC on the Metamask wallet and you want to transfer them to ETH, you could make a BEP-20 deposit on an exchange like Binance and then withdraw the same USDT as ERC-20 on Ethereum to the same starting address.\n\nBy doing so, you give up the factors of decentralization and privacy to enjoy some advantages such as increased security.\n\nUsually those who use this bridging option do so because they handle significant volumes and do not want to expose themselves to the risks of third-party non-custodial platform smart contracts.\n\nDecentralized bridges are indeed the most vulnerable web3 environment to cyber attacks par excellence, where the funds of many users have been compromised in recent years.\n\nConsidering that in this niche, in just over 3 years hackers managed to steal about 2.75 billion dollars, which is a little over a third of all thefts that occurred in the entire crypto world.\n\nIn this regard, just a few days ago the Heco Bridge managed by the famous Justin Sun, was hacked for 86.6 million dollars\n\nTransferring your cryptocurrency to CEX minimizes counterparty risk in this type of protocol, relying solely on the reliability of the exchange in question.\n\nIt is also worth noting how this option can solve the potential “problem” of high gas fees on Ethereum in the case of the bridge from ETH to BSC, significantly reducing commission costs compared to interoperability applications.\n\nThe best exchanges to carry out this type of operation are Binance, Bybit, Okx, Crypto.com, Bitget, Kraken, Kucoin.\n\nBefore making the first deposit, make sure that the platform you are using supports the tokens you want to transfer and the networks you want to rely on."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPalBkbGdFZC1DcFlTWlVWd2xiMWRsSThEN3EyQ0J5N3p4XzBtMDUtMmFleXhsclQzd054OU1nWjFjTVhxSzdrLWxqcnNEM1VZR1UzS083aHpoQVZ3bXlCOE1CeEVNNFVrYjNzOXJtN21HUzZfbmJJc3JLZ3pUMkI5QzRBaXptX0FMV19JM1JSdS14bm5CYUJlelN2M05mWGFzVmRUNGJ0c2ZJMHJjY1VPWUFsUDgtNzRld1RnSlU5M3pwM2lGb3kzYlljS2FZdk1lVjBKUUJ4N1huZ9IB3wFBVV95cUxNdlhMczdUOElUSTJ2dnYwWUhManQ0MGhudUhzaElSRnA0eTdKQ3dOQmsyWDZMdkluY0RVTkJ3OW83ekJudDM5RnZQdUgyVGJSaGUwRGplQkJaLWxRd1ZvV19FUUxBV0RPOHp5MUpHWDhQYUxURHRTUGRCNDVVdHEwWl9WZzcyMXhmZzgtM2QyVFNnS0R2S1dxTjVKMTQtWFVfcWkxV21FMHB5ZUJNY3lzUlZrd3FsaXNZOWJXS1FUVG5yUGk5TG9CZDE0UTF3R3BuRHZmU3gyanZYNmEtSDRR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin Ethereum Ripple: Only major events will work for BTC - FXStreet",
        "content": "Bitcoin price continues to slowly gain, heeding only major events as $40,000 comes in sight.\n\nEthereum price defends the $2,029 support level, but the real danger lies around $1,935.\n\nRipple price must defend the 50-day SMA at $0.5898 or risk a 10% drop to $0.5497.\n\nBitcoin (BTC) price remains shy of $40,000, steadily edging toward this big target as the rally runs on fumes. There is no bullish fundamental to drive the market, save for speculation around spot BTC exchange-traded funds (ETFs). As it turns out, a positive development in this macroeconomy may be the only tune that Bitcoin dances to.\n\nAlso Read: Bitcoin Spot ETF applications see amendments, holders await January batch approval\n\nBitcoin price remains shy of $40,000\n\nBitcoin (BTC) price remains below the $40,000 mark, unresponsive to the show of confidence demonstrated by MicroStrategy, which has just expanded its portfolio with more than half a billion dollars worth of BTC.\n\nMicroStrategy has acquired an additional 16,130 BTC for ~$593.3 million at an average price of $36,785 per #bitcoin. As of 11/29/23, @MicroStrategy now hodls 174,530 $BTC acquired for ~$5.28 billion at an average price of $30,252 per bitcoin. $MSTR https://t.co/hSEZyzGBsr — Michael Saylor⚡️ (@saylor) November 30, 2023\n\nNevertheless, Bitcoin price remains broadly in an uptrend and could head higher as the Relative Strength Index (RSI) suggests bulls still have control. Its position at 60 points to a strong momentum, bolstered by the trajectory of the Simple Moving Averages (SMAs) that show upward is the path with the least resistance. Also, the Awesome Oscillator (AO) is still in positive territory, adding credence to the bullish thesis.\n\nIf the bulls can add to their buying power, Bitcoin price could extend past the $38,000 psychological level before overcoming the range high of $38,450 and tag the $40,000 psychological level.\n\nBTC/USDT 1-day chart\n\nOn the other hand, if sellers overpower the bulls, Bitcoin price could drop toward the $35,935 support level or even test the 50-day SMA at $34,317. Failure of this buyer congestion level to hold could see BTC descend to the $32,000 level.\n\nAlso Read: Bitcoin hit $38,000 three times in one week\n\nEthereum price defends $2,029 support level\n\nEthereum (ETH) price is holding above the $2,029 support level and must defend this position lest it tumble back into the supply zone turned bullish breaker. According to experts, its upside potential is capped at $2,500.\n\nIf the bulls can up their game, the largest altcoin by market capitalization could extend northward, breaking past $2,100 to tag the $2,136 range high.\n\nIn a highly bullish case, the gains could clear the aforementioned local top before tagging the $2,143 range high. Such a move would constitute a 5% climb above current levels.\n\nETH/USDT 1-day chart\n\nConversely, if selling pressure increases, Ethereum price could lose $2,029 support, falling deep into the midline at $1,935. A break and close below this level would confirm the continuation of the downtrend, with ETH likely to test the confluence between the 50-day SMA and the lower boundary of the order block at $1,862.\n\nAlso Read: Ethereum Price Prediction: ETH top-down analysis hints upside is capped at $2,500\n\nRipple price is at an inflection point\n\nRipple (XRP) price is at a crossroads, torn between heading north to breach the critical supply barrier and tagging $0.7000 or moving south. In the latter event, BTC could lose the 50-day SMA at $0.6040 before falling below the $0.5773 support level.\n\nA bullish catalyst could send Ripple price north to the supply zone stretching from $0.6572 to $0.7161.\n\nXRP/USDT 1-day chart\n\nOn the flipside, enhanced seller momentum could send Ripple price south, potentially going as low as the 200-day SMA at $0.5549. In a worse case,, the 100-day SMA at $0.5497 might be tested. Such a move would constitute a 10% fall below current levels.\n\nAlso Read: XRP price stuck under $0.65 despite Bitcoin hitting $38,000 three times in one week"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOSEFkeVRjUk1DY3RaaWRCMW9leWozNkRROWY5Y0JvejdBc2VodkZhdU12Mk1maFczWERSZXVBQjFULTdpdzRrTkdSa3JwLVhlMDRhRGg2SV9TeEwtbnNmVFYyaDNHalNlQU5nTHREVmFJdHFmOFNDMnJkb21qOHY1SEMzTG9xLVEx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "The Best Crypto Investment: GameStop Memes Beats BNB and Ethereum ROIs with a $4 Million Presale Surge - Tekedia",
        "content": "When we talk about the dynamism of the cryptocurrency world, we are in for a great ride on the excitement of potential gains and the ever-evolving market dynamics that make investors’ choices harder and harder. So, today, we will explore the strategies and impacts of three amazing digital assets: Binance Coin (BNB), Ethereum (ETH), and the current innovator, GameStop Memes (GMS).\n\nIn this article, we will shed light on whether these three currencies will be a successful investment in the world of cryptocurrencies in 2024, especially after the $4 million presale of GameStop Memes.\n\nBNB Sees Surge in Popularity\n\nIn the first corner of our crypto battlefront, we have Binance Coin (BNB), the native cryptocurrency of the world-renowned Binance exchange. BNB has been a prominent player in the crypto space, known for its utility and versatility. Originally launched as an ERC-20 token on the Ethereum blockchain, BNB transitioned to Binance’s native blockchain, Binance Chain, through a coin swap.\n\nBinance Coin’s primary function is to fuel transactions and interactions within the Binance ecosystem. Users can utilise BNB to pay for trading fees, transaction fees, and even goods and services from merchants that accept them. This utility has solidified BNB’s position in the crypto market and continues to evolve.\n\nOne of the key factors driving Binance Coin’s popularity is its participation in various Initial Coin Offerings (ICOs) and token sales on the Binance Launchpad. This has allowed investors to access promising projects at an early stage, potentially reaping significant rewards, which means it is likely to be a good investment in 2024.\n\nEthereum: An Uncertain Investment in 2024?\n\nIn the opposite corner, Ethereum (ETH) stands out for its groundbreaking approach to blockchain technology. While Bitcoin primarily focuses on digital currency, Ethereum takes a broader perspective.\n\nLaunched by Vitalik Buterin in 2015, Ethereum introduced the concept of smart contracts, enabling developers to create decentralised applications (DApps) and customise blockchain solutions. This innovation opened doors to a wide range of applications beyond traditional finance.\n\nHowever, Ethereum has grappled with scalability issues. Its current infrastructure struggles to handle a high volume of transactions efficiently. This has resulted in high gas fees and slower transaction processing times, limiting its potential; therefore, Ethereum may not be a good investment in 2024.\n\nGameStop Memes’ Disruptive Entry to Crypto\n\nNow, let’s shine the spotlight on the disruptor of the hour, GameStop Memes (GMS). Inspired by the GameStop saga that made headlines, GMS takes the meme culture to new heights by turning popular internet memes into tradable assets.\n\nGameStop Memes’ strength lies in its community-driven ethos. It thrives on the collective enthusiasm of its users, who come together to celebrate and invest in their favourite memes. While it may not possess the technological sophistication of Ethereum or the dominance of Binance Coin, it introduces an element of fun and community spirit to the crypto space.\n\nMoreover, GameStop Memes made a significant mark by amassing an impressive $4 million during its presale, signifying growing interest and support for this meme-inspired cryptocurrency. While its long-term impact on the crypto market remains uncertain, it undeniably injects excitement and unpredictability into the scene.\n\nWe’ve explored the strengths and strategies of Binance Coin, Ethereum, and GameStop Memes in this crypto battle. Binance Coin excels in utility and participation in token sales, Ethereum pioneer’s innovation with its smart contracts, and GameStop Memes adds a playful twist to the world of crypto.\n\nSo far, the GameStop Memes method seems effective and distinct after achieving $4 million in presale.\n\nInvest in GSM while it’s still in presale!\n\nWebsite: https://GameStopmemes.com/\n\nTwitter: https://twitter.com/GameStopopMemes\n\nTelegram: https://t.me/GameStopopMemes\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    }
]