[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQMDdpaHZCUXNFSjlaM3VhV25LUURYUjhZdkwxYVRxT3VzUFFETkRjUmplczVkSzUyVHd4UXRJMVVBZ3BYcWVDZm9aUC1TNzN5RjFodXZ0YnFKc1ZFalJZT0l0STAzRmo3Q3dZVTU4UWlRRm9OZDgyUDVweUg3X0d2WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "2 Stocks to Watch as Ethereum Shows Promise for 2024 - Yahoo Finance",
        "content": "While Bitcoin (BTC) has had a great 2023, so has Ethereum (ETH), the second-most traded and recognizable crypto coin in the world. Ethereum is known for its uses as a blockchain-powered, open-ended decentralized software platform and has risen 89.4% in value as of date in 2023.\n\nThe crypto behemoth has paved its path to winning over new customers by making a significant update this year, known as the Shanghai Upgrade. Under this upgrade, ETH shifted its blockchain validation system from proof-of-work to proof-of-stake and marked one of the most significant developments in the relatively short history of cryptocurrency.\n\nIn the proof-of-stake system, miners of Ethereum will rely on Ether holders, who will act as validators, thus lending more assurance to the system. In essence, proof-of-stake allows holders of Ether to lock up their funds as collateral to validate transactions and create new blocks, reducing the need for extensive computation and energy consumption.\n\nPowered by this development and what promises to be a significant 2024 for cryptocurrency, analysts around the world have turned bullish on it. There is a consensus that ETH might outperform BTC in 2024 with regard to growth rate and will gain more market share based on its proposals to reduce transaction costs and boost the number of transactions per second. In fact, its planned upgrade, called EIP-4844, might ensure that transaction costs could fall to as low as $0.01.\n\nPer Bitwise Asset Management, the world's largest crypto index fund manager, ETH revenues could double from 2023, up to $5 billion in 2024. Also, a state of fast-rising interest rates has not proven conducive to the crypto market. However, with markets widely betting on rate hikes having come to an end and the first rate cut as early as first-quarter 2024, the crisis for crypto may have been averted.\n\nEthereum has already started to make good of the state of the market, and it might be prudent to keep a watch on stocks exposed to this open-source, decentralized blockchain platform. Here is a selection of two stocks that we believe should be tracked. These currently carry a Zacks Rank #2 (Buy) or 3 (Hold). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nAccenture plc ACN: This global system integrator that provides consulting, technology and other services markets Ethereum-based blockchain solutions to businesses to make it easier to process payments.\n\nAccenture’s expected earnings growth rate for the current year is 4.6%. The Zacks Consensus Estimate for its current-year earnings has improved by 0.1% over the past 60 days. ACN currently carries a Zacks Rank #2.\n\nStory continues\n\nCME Group Inc. CME: This company operates as one of the world's largest futures exchange, offers a wide range of derivatives contracts and provides various solutions to invest in cryptocurrencies like Ethereum.\n\nCME Group’s expected earnings growth rate for the current year is 14.7%. The Zacks Consensus Estimate for its current-year earnings has improved by 0.6% over the past 60 days. CME currently carries a Zacks Rank #3.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nAccenture PLC (ACN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQazN0S2VZQ1NPOTlNWHpPYkV2T0tiOW9NZmNfUHJNOXQzNGVuMzRsYVgyRDMxa18zMWhIQXh0a21tUTZqWng1YnRtamVLdktQMWFoNUpKVjZNam9lZU1aV3ZJQm5yd1lyc0hqU2c3U0NQaHJVNWhvSjVDQmEtaWJlcXp4UFZMZ2MyLThwMG16eHVTY3M1X2k4dDlQX0E1MFgwYVkzaDhzelBRS2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum community approves first-ever compliant tokenization standard, ERC-3643 - Crypto Briefing",
        "content": "The new token standard allows anonymous credentials to ensure only eligible users can access tokens.\n\nShare this article\n\nThe Ethereum community has approved the ERC-3643 standard. This standard is the first-ever designed specifically for compliant tokenization. This new standard improves upon the widely used ERC-20 standard, particularly in securities activities. It enhances ERC-20 tokens with controlled advanced functions and compliance modules.\n\nJoachim Lebrum, Chair of the Technology Working Group ERC-3643 Association, stated that:\n\n“The ERC3643 standard is a groundbreaking step towards integrating advanced blockchain solutions into the enterprise sector, and this validation sends echoes across the ecosystem that ERC3643 is the superior standard for such use cases.”\n\nERC-3643 is a permissioned token standard for tokenizing securities, real-world assets (RWAs), payment systems, and loyalty programs. The standard uses a self-sovereign identity (SSI) framework to verify users’ token eligibility dynamically. This feature ensures compliance through anonymous but verifiable credentials.\n\nThe new ERC-3643 standard sets out to revolutionize how companies leverage blockchain technology. It provides them with a secure, compliant framework to tokenize various assets. Ethereum’s official recognition of this standard demonstrates its goals to address users’ diverse needs. It also establishes a benchmark for institutions implementing this framework in tokenization projects.\n\nCompanies now have an approved standard to actively deploy to bring real-world assets onto blockchains while integrating the necessary compliance controls and permissions.\n\nLooking ahead to 2024, experts predict the momentum behind asset tokenization will accelerate. HSBC’s research group forecasts the market for tokenized assets will swell to trillions of dollars by 2030. Governments and significant investment funds are demonstrating growing interest in this area. The next wave of tokenization will likely see bonds, equities, and other mainstream financial assets transitioning to blockchain-based models."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPczVSMy1pX3pNNzJVZGNkSXN0LWlaTDVBTDBMN25PaHpSUEtxSk1Ud1pXRnpEbWlfaV8zNExKallaYkI0cWJmejllLTF1cUJmUGp2dF9VSXdTWWhPdlJ1RVBKTlVDMW5sWXd0ZTJVREY1QUNaTDk0OUJwdTdkRzBVZkxCY3JjalFnU1ZSLW5wX0tWYlZzWnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Name Service now fully decentralized as DAO takes control - CryptoSlate",
        "content": "Ethereum Name Service (ENS) has achieved decentralized governance, according to a message from the project’s creator on Dec. 14.\n\nENS is a naming system for the Ethereum blockchain that adds human-readable names to various resources, including crypto wallets and websites. Until now, the project’s root node was managed by members of the Ethereum community.\n\nNick Johnson, ENS founder, endorsed the change in ownership. He wrote on X:\n\n“[This is] truly the end of an era. Here’s the message I just sent to the ENS root keyholders, requesting the transfer of the last of their powers to the DAO.”\n\nJohnson’s attached email stated that the Decentralized Autonomous Organization (DAO) of ENS, which is a governance group formed and controlled by ENS token holders, voted unanimously to acquire control of the project’s root node.\n\nHe said that, in response to those voting results, he created a transaction to execute two actions that transfer root control to the DAO address (wallet.ensdao.eth). He wrote that this transaction transfers all remaining multisig responsibilities to the DAO, thereby “retiring the multisig entirely.” It is unclear whether the other multisig owners have approved the transaction.\n\nIndividuals who previously managed ENS’ multisig include Chainlink’s Sergey Nazarov, Metamask’s Dan Finlay, MyCrypto’s Taylor Monahan, Colony’s Aron Fischer, the Ethereum Foundation’s Jason Carver and Martin Swende, and Johnson himself. Johnson addressed those individuals in his message, writing: “Thank you so much … for your service to ENS over the years.”\n\nENS governance will be more open\n\nENS’ DAO is a governance group comprising token holders that vote on decisions and issues related to the project by staking tokens.\n\nAccording to the latest proposal, the DAO already has several ownership responsibilities but did not have control over the core ENS root name until now.\n\nThe DAO will gain specific capabilities by controlling the ENS root. The ownership change will allow the DAO to create, manage, and permanently lock top-level domains apart from the permanent and unchangeable .eth domain. It will also allow the DAO to update reverse resolutions that map addresses back to a name. The DAO may also introduce primary domain names on layer-2 networks.\n\nA snapshot indicates that voting concluded on Dec. 15, 2023. Virtually 100% of the staked tokens, or 1.9 million ENS, were staked in favor of DAO ownership. Johnson was one of the largest voters, staking 155,000 ENS in favor. Less than 17 ENS tokens were staked against the plan or were used to abstain.\n\nMentioned in this article"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE1DTThDVXZtaFVHenZ6Zzl0VldWQkRqNjBpV1VkZjZTV0ZlODE2eDZ0aWRLVzdyMVM0ZXJWZzZmaU5aQjl3LWhiY0xVS2g3NVVtdDNSaDAtRFh4cmdyQlVvOFB0T0NYd9IBa0FVX3lxTE1uWmEycC1DOEJ4RVFnQy1zNnNfZDNBcU5ST2FtQTZfS2dmakJMS2g4WTBXVEhfTHBKcEdNdjloZmE4cU4yS1NLYkpvTk9PcHNfcnd0R0xkVW1FLXJfSjBUWVZHWGQ5bENMMEc0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Sells Trillions Of Tokens | Bitcoinist.com - Bitcoinist",
        "content": "Ethereum founder, Vitalik Buterin has undertaken a large-scale transaction involving trillions of meme tokens, leaving the broader cryptocurrency space curious about the motives behind the founder’s decision.\n\nEthereum Founder Executes Massive Memecoin Sales\n\nEthereum inventor and founder, Vitalik Buterin has made new headlines as reports surface of his substantial memecoin sales. According to blockchain security company, PeckShield Alerts, a Vitalik labeled wallet address was seen swapping 100,000,000,000,111.111 DOBE tokens worth approximately $22,900 for 10.44 Ethereum tokens (ETH). Additionally, the wallet also initiated another sale of 1,858,140,000,000 DOJO tokens worth $6800 for 3.12 ETH.\n\nThe motivation behind the sell-offs remains unknown however the large-scale memecoin transaction has adequately caught the attention of cryptocurrency investors and the market as a whole.\n\nThe substantial meme coin sale follows a recent loss experienced by Buterin earlier this week. The Ethereum founder’s publicly known crypto wallets became short of $29 million between December 15 and 21.\n\nThe loss was reported by blockchain analytics service, Arkham Intelligence. According to the analytics platform, the reason for the loss was due to crypto market fluctuations which saw Buterin’s wallets losing 5% of the total value of its assets.\n\nETH price chart at $2,300 | Source: ETHUSD on Tradingview.com\n\nButerin Crypto Sell-Offs\n\nIn addition to Buterin’s recent large-scale meme coin sell-off, there have been many other crypto sales executed by the ETH founder. Earlier this year, Buterin sold about 9.9 billion CULT tokens worth $332,420 at the time of the sales. The Ethereum founder subsequently revealed reasons for the sell-off, stating that the cryptocurrency held no cultural or moral value.\n\nLater in October, rumors surfaced about Buterin allegedly selling off his ETH holdings after the Ethereum founder sold about 500,000 USDC worth approximately $14.93 million at the time, to the Gemini exchange. Buterin clarified the sell-off allegations stating that the transactions were made to charitable organizations and other initiatives.\n\nMore times than not, large-scale crypto transactions from prominent leaders in the crypto space tend to capture the attention of investors as these sales could lead to a shift in the market. However, Buterin has also revealed that he has never sold Ethereum tokens (ETH) for his gain since 2018.\n\nThe Ethereum founder is known for making multiple ETH donations to charity organizations and COVID-related causes. Buterin is also known for purchasing and constantly dumping meme coins, causing the value of these tokens to plummet in several cases.\n\nFeatured image from Newsway, chart from Tradingview.com"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPQ04xN2N6MzdZbnZTRzhFSWtIdDJpdTljVmVWV3FkVHoyLVA1RWF2dWF5UWdFMEdHdmY5YW1wa19wNEV1SlRJdk1qNDgtRUFWVjBxUVhqdlMtTmI1QzZ1Zk52WHdGOVhERUpOMnp6V3lCV2RqU0tjLVd2czVHWjdwb1pPbnZwUdIBiwFBVV95cUxNTmplSzJwMWExUFhFM1VZelhGdm5EUjN2NEdMQUZGemlMS0dPUndZc3oydjh6MzM5VHJMOHdQUHJ1VzQ5RTNlcmhPaHhHRGZraS1PRnRybHh3UmxmOWdLNDFJQ2tBR0pLQTVlUFBhVHJEN1p1ckZuajNXOWFCSVRhTWFQVnM1M19PYlFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Peter Brandt Stirs Debate with Harsh Critique of Ethereum - CoinGape",
        "content": "In the ongoing debate of Bitcoin versus Ethereum, renowned market trader Peter Brandt has expressed significant doubts about Ethereum’s future, contrasting sharply with other market experts. Brandt, known for his blunt analysis, questioned Ethereum’s long-term viability, particularly in comparison to Bitcoin.\n\nPeter Brandt Predicts Dim Future for Ethereum\n\nBrandt, a respected figure in market trading circles, has openly criticized Ethereum, challenging the popular notion that it might soon outpace Bitcoin. He raised a fundamental question regarding investors’ preference for Ethereum over Bitcoin, which he sees as a superior store of value. His comments come amidst bullish forecasts from other market experts and institutions, including JPMorgan. These predictions often highlight Ethereum’s potential growth, especially with its upcoming EIP-4844 upgrade, also known as Protodanksharding.\n\nadvertisement\n\nHowever, Brandt’s skepticism about Ethereum is rooted in its structural and functional aspects. He specifically pointed out the high transaction fees, or ‘gas fees,’ associated with Ethereum, labelling the digital currency as inefficient. These fees, in his view, severely detract from Ethereum’s value as an investment asset. Furthermore, he controversially suggested that Ethereum might lose its relevance entirely within the next decade.\n\nEthereum’s Fate Tied to Key Price Level\n\nBrandt’s stance starkly contrasts with other leading analysts like Raoul Pal, who have a more favorable outlook on Ethereum. Despite differing opinions, Brandt acknowledged his respect for these analysts but did not waver from his critical perspective.\n\nIn his analysis, Brandt emphasized the importance of the ETH/BTC price chart. He pointed out that Ethereum’s future could hinge on its performance relative to Bitcoin, specifically if it manages to maintain above the 0.04803 level. Should this level hold, Brandt conceded that the “imminent funeral” for Ethereum could be postponed, albeit temporarily.\n\nThis isn’t the first time Brandt has expressed skepticism about Ethereum. In previous statements, he has questioned its decentralization and even referred to it as a “piece of crap” cryptocurrency. His consistent critique of Ethereum has been a topic of discussion in trading circles, influencing perceptions among investors.\n\nRead Also: Ethereum Price Prediction As Bull Trap Puts $ETH At Risk of 12% Drop\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQd1NmOU1sNGxTeHpaTTBiTWxqX2pRMjB3RGI1dmtzdFF6MTI4eDUtVkFrWXVNZ2F3Q2liVGQwRkZHU2V5NUprdVZ6MFFoNExocjRQaXFWQncxV3d2Ujh6bF9acHZtVm1Xc3VqSXp0S0FzTkVFMEJkYnFHT3l4dUxsZG1HT2hlVVRXZDctZjk0dVFIcThOSXhuRC14OGFBZDhmRU5n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum: Vitalik Buterin Explores Direct L1-L2 Integration via ZK-EVM - Cointribune EN",
        "content": "Fri 15 Dec 2023 ▪ 3 min read ▪ by Ariela R.\n\nVitalik Buterin, co-founder of Ethereum, explores the nuances of Layer-2 solutions in a visionary article. He particularly emphasizes the current dependency of L2 solutions on the main EVM. He also discusses the possibility of directly integrating native ZK-EVM on Ethereum’s Layer 1 (L1). The details!\n\nVitalik published an article discussing the current L2 EVM solution heavily relies on the mainnet EVM, and whether it would be possible in the future for the built-in ZK-EVM on L1 to be directly used by Rollups. He also described several possible implementation versions, explored… — Wu Blockchain (@WuBlockchain) December 13, 2023 Vitalik Buterin explores new approaches to boost the performance of the Ethereum blockchain\n\nVitalik wants to redefine Ethereum L2 with ZK-EVM\n\nAbout a month ago, we discussed the impact of backdoors on Ethereum rollups. Now, Vitalik is questioning the current dependency of L2 solutions on Ethereum’s main EVM.\n\nIn an article published on December 13, Vitalik Buterin indeed proposes a bold reflection aimed at transcending the existing limits of Layer-2 solutions. Currently, these solutions are tightly dependent on the Ethereum Virtual Machine (EVM) of the main network. However, Buterin envisions a transition towards a more direct integration with a native ZK-EVM.\n\nThis proposal raises fundamental questions on:\n\nthe current design of Layer-2 solutions,\n\nthe challenges inherent to such a pronounced dependency.\n\nExploring these implications offers insight into potential changes in how Layer-2 protocols interact with the Ethereum blockchain. This paves the way for more flexible and efficient solutions!\n\nThe envisioned versions of ZK-EVM\n\nThe potential evolution towards a dedicated ZK-EVM presents significant strategic and technical implications. In his article, Buterin precisely explores the reasons behind these choices. Also, he offers an in-depth perspective on how this technology could revolutionize the way smart contracts are executed on the Ethereum blockchain.\n\nThe multi-client philosophy in the context of EVM verification emerges as a central element of Vitalik Buterin’s discussions. He explores the advantages and disadvantages of multi-client systems, classifying them as “open” and “closed”. The crucial question is whether a multi-client system can provide a more resilient and decentralized solution.\n\nVitalik’s innovative ideas thus pave the way for a more transparent and robust Ethereum ecosystem. By inviting the crypto community to embrace innovation, direct ZK-EVM integration foretells a promising future for Ethereum’s blockchain technology.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxOQXpvdm05MHRHSnV1NEp4dy14T25NSVc3ZHI3Y2IxM2l1R3V5Um9DSnMxWWV4RzlHeW5PMUNabjRoWkx0VGN6eFJuaWhkWURqY0JTMXlUcGNRSWZFRGJmM2ZFbkRhSmx3U20wUHh0SjZoYzJWLXhtWEZxUUpmMzdaNURmX1IwOU5idVFBQ0lWRzc0RmhMZnF0V0k4a0xrbU9vNzF0eDRpU2ZJUmFpdE1pc0VCd3hIOTJJLWY3RkxYWDc3RzNnbVY3b1VWQ1ZnOUEtU3fSAdcBQVVfeXFMUDU0bmd5TDdfMWhicGxkMVZYLW5nSU5GcnV3b0FRbEZ2OUtaelo2Mm0tenJSM0RfUTFTVG51cG1Yc2d0SnRhaDMtR2QtSjB6dVZQdmdQbEtIcWhxbXpmR1BfbU14S2U3VEExbkFFTlBxR0V2OW1lc1NIeTAxTWtZcjhoa3R4cHE3bGg4MzVENlBlU1o0RnRDU0RaR1hzOTVTYXBKckFWWjY4MmRwdlhRemlNaWJrWVM1RVAzTDFyUWZvdnZIcEhXeWFOUGZZaEpiNVY0UnZDbnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Trader Says Top-10 Blue-Chip Altcoin on the Cusp of a Breakout, Updates Outlook on Bitcoin and Ethereum - The Daily Hodl",
        "content": "Crypto trader and analyst Ali Martinez is saying that a top-10 altcoin by market cap is potentially forming a bullish pattern and that it could appreciate by double-digit percentage points.\n\nMartinez tells his 35,500 followers on the X social media platform that Binance Coin (BNB) could be forming an inverted head and shoulders pattern, which is typically a bullish signal.\n\nAccording to Martinez, if Binance Coin manages a “sustained close above the neckline at $261,” the fourth-largest crypto asset by market cap could surge by nearly 20% towards the $310 price.\n\nBNB is trading at $251 at time of writing, up by around 10% over the past two weeks.\n\nTurning to Bitcoin (BTC), Martinez says that the flagship crypto asset’s recent fall in price to around $40,300 presented an opportunity for whales to accumulate. Citing data from blockchain analytics firm Glassnode, Martinez says that the number of entities holding 1,000 Bitcoin or more has increased since the price dip.\n\nBitcoin is trading for $42,897 at time of writing.\n\nTurning to Ethereum (ETH), Martinez says that approximately 5.58 million addresses purchased 39.87 million Ethereum at prices ranging between $1,934 and $2,160.\n\n“From an on-chain perspective, this is ETH’s most critical support level. For traders, this could be the ideal reloading point to aim for new highs.”\n\nEthereum is trading at $2,287 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxPa2dNSHFOSU42bE1EVG1ZVUpvWWE0ZUxYQ0pCQjhkX3VlNDRCRlZPVnFPXzBhQVV3WmZhdDI3a2dRdk40ZW44SlpCeWxjcmtUTC1Fc2hVS3UzS0JuZ3RGaHlpdnVSeHlSSVVCZ3Y5WktJZUdOcnAzb3QwaDlkWU5ibjJhTUhURDlFRlMyTnJNWUNXMFB3a3Y4RnFKcjdjaXM5NWtnaUpEaldwY0RvbjZOQmczbFNvYlhabmlrZUpNV2F1X1hzeVNLSEV5V1lzY1B6aWlGUVgxUlBnbUVhc1HSAeMBQVVfeXFMTXBLMkV3c3Y4ZUxmN0JiUUxOSzZDdy05Qk5rbGpGMEFUWWFUaHRwLXVxYVNscmU4cGVzTWFNMy1LQ0EzNnB4WjQwN05kLUZ0RURBLUZFNXVvX3FLQUNBTVh4QnJUM0JVZkE5cTk2OGtfd0dLVGowUDFqa185TGYtdEFFdlRhT1JZTmZQNjBNYm14Y1Zoa0RxbmtyTlJTVXpLbE9UOV9jYnFGanVzcHBIQXoxZXUzSF90Xy1nNE5EenllRS02UERXdTBUX2xxYi1jbkx1WWFJZVpsa1dtMjN5bnBUMVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum price likely to outperform BTC says JP Morgan report, but short-outlook remains flat despite ETF hype - FXStreet",
        "content": "Invesco Digital’s Ethereum spot ETF’s approval is delayed.\n\nEthereum price is likely to hover between the $2,030 and $2,539 levels for the next few weeks.\n\nOn-chain metrics note a decline in user activity, which could add headwinds to the uptrend.\n\nEthereum (ETH) price is likely to overshadow Bitcoin price performance in 2024 said JP Morgan analysts in a recent note. Ether traded in the $2,400 region after nearly three weeks of consolidation but this uptrend seems to have lost momentum as Bitcoin price takes a hit this week. Despite the Bitcoin ETF approval hype, ETH continues to remain largely neutral as other altcoins outperform Ether. In the near future, ETH is likely to slip into sideways movement due to a few reasons: a slump in on-chain activity, a delay in ETF approval from the US Securities and Exchange Commission (SEC), a fast-approaching holiday season, and a lack of momentum to push Bitcoin price higher.\n\nAlso read: Ethereum revenue could double to $5 billion and fee may fall to $0.01 in 2024: Bitwise prediction\n\nSEC delays Ethereum ETF\n\nAs noted by Bloomberg Analyst James Seyffart, the Commission has decided to delay the Invesco Galaxy Ethereum ETF. The analyst adds that “this was early but completely expected.”\n\nUpdate: SEC delayed @InvescoUS / @galaxyhq Ethereum ETF application -- This was early but completely expected. (Wasn't due until Dec 23rd I think) pic.twitter.com/jFCjnND3Rf — James Seyffart (@JSeyff) December 13, 2023\n\nInvesco and Galaxy Digital filed for an Ether spot ETF in September, but like Bitcoin’s ETFs, Ether’s is likely to be delayed before the SEC gives a decision. Additionally, the Commission remains unclear on its stance as to whether Ether is a security or a commodity, which makes the approval of an Ethereum ETF highly speculative.\n\nRead more: Hashdex tips spot Bitcoin ETF s to trade by Q2, followed by Ethereum\n\nEthereum price remains neutral-to-bullish\n\nEthereum price action between June 2022 and November 2023, created an ascending triangle setup. This technical formation is a bullish pattern in which the asset price creates higher lows and equal highs. In Ether’s case, three distinctive higher lows and three equal highs formed.\n\nConnecting the equal highs shows a horizontal resistance level at $2,030. This level was broken on November 20, indicating the upside potential of the pattern was activated. The ascending triangle setup forecasts a 43% upswing to the $2,943 level, obtained by measuring the distance of the widest part of the triangle and extrapolating it higher.\n\nEthereum price’s breakout was succeeded by a 16% rally to a local top at $2,403. Since then, ETH has dropped 6.3% and currently trades at $2,252. Going forward, the smart contract token is likely going to move sideways between the ascending triangle’s base at $2,030 and the weekly resistance level at $2,539.\n\nA decisive flip of the $2,539 will open the path for Ethereum price to continue rising to its theoretical target of $2,943 or the $3,000 psychological level.\n\nETH/USDT 1-week chart\n\nEthereum’s Social Dominance metric has been trending lower since September 30, showing a decline in interest for ETH among investors.\n\nETH Social Dominance\n\nAccording to data from Santiment, On-chain Volumes saw a spike on November 10 but has been steadily slumping since then. The same can be said about Whale Transaction Count, which has also seen a decline.\n\nETH On-chain Volume, WTC\n\nWhile this is bearish in the short term, the Active Addresses have been in an uptrend since mid-September. Network Growth has also remained consistent, which shows that the investors are being patient about the mid-to-long term outlook.\n\nETH Active Addresses, Network Growth\n\nA decisive breakout above $2,539 could signal a bullish outlook for ETH. In such a case, the Ethereum price could eye a retest of the $3,000 psychological level.\n\nOn the other hand, a breakdown of the $2,030 support level could trigger a 15% crash in Ethereum price to $1,727."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOVU8tcmlDaGJLOEJvbVI5ZEhqcEFweWhJb0x2NjJHeGNXR3ZLR3hsTEJJbmMzVVN0RUEtdzdxczZuT2dsMmc0NThsallIRzhkekRuVUk0X0tqYVZ3RkMzSEl3ejgzcGNmZXgxbEg2bzBZWW0tQjBfZmdqSF94Q2w0OUVvcU5IajkycVFhNzFDdXpoZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Bitget Wallet Partners with Linea for Ethereum Layer 2 - Brave New Coin Insights",
        "content": "Bitget Wallet Partners with Linea for Ethereum Layer 2\n\nBitget Wallet (formerly BitKeep), a leading global Web3 trading wallet, has announced a collaboration with the Ethereum Layer 2 network, Linea, to jointly advance the development and growth of the Linea ecosystem.\n\nBitget Wallet has integrated with the Linea mainnet, providing wallet connectivity and support for the Linea mainnet and ecosystem projects. Wallet users can now easily connect to the Linea mainnet via their mobile app and browser extension, manage their assets on the Linea ecosystem, engage in multi-chain swaps for Linea mainnet tokens and view real-time candlestick data, and interact with projects on the Linea ecosystem.\n\n“The partnership with Bitget Wallet is a great step for Linea, enhancing user interaction with our zkEVM Layer 2 solution. This collaboration simplifies asset management and ecosystem engagement for the network, aligning with our goal to make web3 more accessible and efficient. We’re excited about this collaboration and the positive impact it will have in the Linea ecosystem.” – Declan Fox, Product Lead\n\nDeveloped by Consensys, Linea is a developer-friendly Ethereum Layer 2 network built on zero-knowledge proof technology that aims to provide efficient scaling solutions to enhance Ethereum’s performance and usability.\n\nAs part of this collaboration, Bitget Wallet has launched an extension of Linea’s DeFi Voyage Wave 9 through its own event on its Task2Get platform, signaling the commencement of the second phase of Bitget Wallet’s Task2Get initiative. By exploring the Linea ecosystem within the wallet and completing tasks like token swaps and DApp interactions, users can earn Task2Get NFT rewards distributed by Bitget Wallet and share in a total prize pool of US$10,000. The event runs from December 14th to December 28th. Task2Get NFT holders will qualify for additional airdrops from this campaign as well, including tokens from partnered projects and more.\n\nTask2Get, a Web3 exploration incentive platform introduced by Bitget Wallet, rewards users for participating in various on-chain interaction tasks, offering an effective way for users to both learn and earn from various ecosystems, while also providing growth opportunities for these projects.\n\n“As active participants in the Web3 ecosystem, we not only curate and showcase promising mainnets and projects for users to better interact and claim future airdrops, but also launch various incentivised task events in collaboration with these parties,” Alvin Kan, Chief Operating Officer of Bitget Wallet states. “This will allow users to explore and interact with decentralised ecosystems while earning rewards at the same time.”\n\nBesides offering an easy-to-use user interface and comprehensive interaction guides, Task2Get also provides convenient access to interaction records and interaction reminders. Users can also stand to earn exclusive NFTs for completing various tasks, which will qualify them for rewards such as vouchers and even airdrops in the future.\n\nAs one of the top global-leading Web3 trading wallets, Bitget Wallet provides reliable and powerful services for over 12 million users worldwide. Bitget Wallet’s mobile app is also ranked fourth in global downloads in recent months. Leveraging its vast user base and strong market influence, it has built up a robust growth and exposure platform for Web3 mainnets and projects through its Task2Get incentive. With the continuous deepening of collaboration between Bitget Wallet and Linea, it is predicted that Task2Get will be a key driver in fostering further innovations and market growth, cultivating sustained user engagement and active interaction in the ecosystem.\n\nLearn More At Bitget Academy\n\nExploring the Linea Mainnet with Bitget Wallet\n\nPreviously known as ConsenSys zkEVM, Linea is an innovative Layer 2 (L2) solution, presenting new opportunities for developers to craft dApps more efficiently. Learn how to add the Linea Mainnet to the Bitget Wallet App.\n\nThe Future of Cryptocurrency: How to Safely Store Your Crypto: A Beginner’s Guide to your Web3 Wallet\n\nBitget Wallet is a secure and user-friendly wallet that allows you to store, send, and receive cryptocurrencies. Discover the importance of safely storing your crypto with our beginner’s guide to Bitget Wallet.​\n\nBitKeep Upgrades to Bitget Wallet: A Letter From the Team\n\nIn March 2023, Bitget acquired a controlling stake in BitKeep through a successful US$30 million capital raise to form Bitget Wallet. Learn more about the new Web3 wallet features.\n\nAbout Bitget Wallet (Web3 Trading Wallet)\n\nFormerly known as BitKeep, Bitget Wallet stands as Asia’s largest and global frontrunner among all-in-one Web3 trading wallets. We offer a comprehensive range of on-chain products and DeFi services to our users, including wallet functionality, Swap feature, NFT trading, DApp browsing, MPC Wallet and more.\n\nWith a 5-year legacy, Bitget Wallet has garnered acclaim from over 12 million users worldwide and has secured partnerships with prominent industry leaders including Bitcoin, Ethereum, TRON, BNB Chain, Solana, Base, and others. This success stems from our commitment to consistently delivering secure and convenient products and services.\n\nIn March 2023, Bitget, a leading cryptocurrency exchange made a substantial US$30 million investment in BitKeep, acquiring a controlling stake. Following this strategic move, BitKeep underwent a transformative and strategic brand evolution in August, officially rebranding itself as Bitget Wallet.\n\nFor more information, visit: Website | Twitter | Telegram | LinkedIn | Discord | Bitget Wallet\n\nFor media inquiries, please contact: [email protected]"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQU1o2RjJBU0J2dF9KVTdLVV9iT21xUUpFVjNmUU9SWk5RU0JsUXAzSTItVlR0T21DNVNyVjc4SDNiaXZqZ2ZJVzBVVEFUZlhybjNxcWJONk9iRDRQdEhpbG9PUlhfV3c5VlUwekVmWkU4a1FNNDY4VGIwR2twaTI4dmpn0gGHAUFVX3lxTFAxMnkxcXpNdmVrZGVjS2JLd1p1d2tjN1ZGVzhJdlc3bmNIZWJ6bjZSLXdIeXJ6SlBKWUJwMmo2RGtfaWZCNTVybXZPS1doMzVKcDZpVzB4U1M0bllYRzBZeUF3NjdJdG5DMFZLTTBQT1dkUkFMWm5WSkJXeW9HSXduZVlaV0dhVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction As Post-Correction Rally Sees 15% Jump Ahead - CoinGape",
        "content": "Ethereum Price Prediction: The cryptocurrency market witnessed a surge in volatility as the digital assets Bitcoin and Ethereum entered into a minor correction. This pullback has plunged the ETH price from a recent top of $2400 to $2238, registering a 7.4% loss. However, this retracement lies within the range of a rising channel pattern and projects the recovery is intact.\n\nAlso Read: Peter Brandt Stirs Debate with Harsh Critique of Ethereum\n\nadvertisement\n\nChannel Pattern Hints Next Jump Above $2500\n\nA channel pattern leads the current recovery trend in the ETH price\n\nUntil the pattern’s lower trendline is intact, the coin holders can enjoy the bull rally\n\nThe intraday trading volume in Ether is $10.2 Billion, indicating a 78% gain.\n\nSince mid-October, Ethereum (ETH) has shown a robust recovery, beginning with a rebound from the $1522 support level. This rally is best understood through the lens of a channel pattern, characterized by two ascending trendlines that have been providing dynamic resistance and support to the price movements.\n\nOn December 13th, the Ethereum price marked its latest recovery from the lower trendline of this pattern, evidenced by a morning star candle formation. This reversal propelled the price to its current level of $2243, signaling the onset of a new bull cycle within the confines of the channel pattern.\n\nIf the ETH price continues to adhere to the trajectory set by this channel pattern, we could see a 12-15% surge, potentially reaching the upper trendline in the region of $2500 to $2600. As long as these two trendlines remain intact, Ethereum is likely to maintain its upward trajectory, albeit with minor pullbacks along the way.\n\nHowever, a breakout above the channel’s resistance could significantly amplify buying momentum, potentially leading to a more substantial recovery. In such a scenario, initial targets could be set at $2730, with a further potential rise to $3260, marking key milestones in Ether’s bullish journey\n\nCan ETH Price Fall Back to $2000\n\nWhile the current market outlook for Ethereum price seems strongly bullish, the rising channel pattern in a strong rally can commonly lead to a decisive breakdown from the lower trendline. This breakdown would likely intensify the selling pressure and trigger a significant correction in ETH price. Thus, under the influence of this pattern, the Ethereum coin may revisit $2000 coin again\n\nBollinger band: Despite the current retracement in the upper boundary of the Bollinger band indicator , indicates the recovery momentum is active.\n\nRelative Strength Index: A lower high formation in the daily RSI slope reflects the weakening of buyers’ strength in the market.\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPMUFmQnh5V01pSzA5WGVlT1podHFwQkhkUFNldEJiNjZGSEN3QTFjdEFuSXJVS0FxR01KQUlWNXNWbEdTbHZRMlRjaVNfZXBzVlBCSnY1bGVlX0dFazRELXpSbllsSC1FRDJDQkJqNlpOcmNlbHBvU251czh2RlFTcjhJa1p1cVMyempkMll5TXdUX09CWXczVWs1azNLeWlzQzN3WjF0UUFzNkdlLVJkQTE5TXlreDg4Rk5rM0c5NWV6eG0tVzlXVmF3ZUVYMEk1eFZUeVVB0gHbAUFVX3lxTE9vczhfNDNwWm9QZHYzaEhwVTN1LWFqc2pQWlpxdDBCQjhLRFFkVVE1eGVyMjF1YkFVcVRIV0RqdmxpYnBmRTNnY1puenRSSVVTTDdVZU40SWFRX3lnNWlmWFBYTmlNYVMwempVczRhejI5TG81Z29wMm51WjFuR3FVN2VUcVM3Z2EtV240SHpDWlJGRjR6cXQwb0ttN3dBaDFhbXlTc2JWNnNVbXdHQzF3RUU5MTZQR0w1RUlodWM4NFFTdzRlTzNlanFQTXpFY3h5UmVlT2dXNWdjYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Top Crypto Analyst Says Two Altcoins Primed To Explode by Over 80%, Updates Outlook on Bitcoin and Ethereum - The Daily Hodl",
        "content": "A trader who accurately called Bitcoin’s (BTC) 2018 price floor is predicting massive moves to the upside for two top 50 altcoins.\n\nStarting with Solana (SOL), the analyst and trader pseudonymously known as Bluntz tells his 232,000 followers on the social media platform X that the sixth-largest crypto asset by market cap will surge in value against Bitcoin (SOL/BTC).\n\nAccording to the analyst, the bullish SOL/BTC chart indicates that Solana will likely soar against the US dollar.\n\nThis was another banger SOL/BTC picolow call. Since the original post, it has rallied impulsively from the low in five waves and has now done yet another ABC down. SOL/BTC is about to full send in my opinion.\n\nI have no idea where USD pair goes in terms of levels, but I genuinely think it will be $140+.”\n\nSolana is trading at $73.65 at time of writing and would need to appreciate by over 90% to hit the target of at least $140.\n\nTurning to the governance token of the decentralized finance (DeFi) lending protocol Aave (AAVE), Bluntz says that the 50th-largest altcoin by market cap looks poised for a big breakout rally.\n\n“Monster three-day candle on AAVE. Legit gearing up to gigasend.\n\nPlenty of juice in the tank in my opinion, shouldn’t be aiming for anything less than $200 in my opinion.”\n\nAAVE is trading at $108.13 at time of writing and would need to go up by 85% to reach a target of $200.\n\nOn Bitcoin and Ethereum (ETH), Bluntz says he’s now bullish on the two crypto assets after initially expressing reservations. Initially, the pseudonymous crypto analyst had warned of a possible downward move for Bitcoin and Ethereum after the two leading crypto assets pulled back from their ascending channel highs.\n\n“Overnight price action made me do a 180 on this take. Sh*t looks bullish as f**k again.”\n\nBitcoin is trading at $42,113 at time of writing while Ethereum is worth $2,244.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9ydk1RVW9WdFhBWVgtYUc4aG82ZlZJWXJ2M3VtTldoMFdNWEtKVDVtX09zWWhDTWtmX2RDemgxSVN2RVpnYTk0ZDVzS0M1Y1FfZl8wWlk1bkNHV0hzQU1NU0NnOVJERHV3b1dyVXBFNHFSR0NBemhVZ0N1MTjSAYIBQVVfeXFMT2oteTNOR3c4TWQybGlxNUladVdvdElKdGNCZFNWeWFiTWstdS13X0lhaktlUlJ0SmkxdFhJb0YtVW4tZU9udGFtUXJ3NVpxQXJtZkVKaWhEQkdGSEhRZGI2XzM2MVdUMnRDRkFkRHZGaDQ4UzJjR0RvZDdEdmhTYTBmQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Whale Resurfaces, Initiates Major Sell-Off - CoinGape",
        "content": "After a year of dormancy, a significant Ethereum whale has reemerged, creating ripples in the cryptocurrency market, with Lookonchain reporting this unexpected move. The whale, silent for over twelve months, initiated a substantial selling spree, offloading 18,865 ETH for a staggering 42 million DAI through four newly created wallets. This activity translates to an average selling price of $2,229 per ETH.\n\nThe market has been abuzz with speculation and analysis following this development. The revived whale’s actions have led to the sale of a considerable amount of Ethereum, amounting to a current value of $12.5 million, with 5,588 ETH remaining in their possession. This event has caught the attention of both investors and analysts, given the significant amount of cryptocurrency involved and its potential impact on the market.\n\nadvertisement\n\nContrasting Whale Behaviors\n\nThis selling trend by a dormant whale contrasts sharply with the behaviours observed in other segments of the Ethereum whale community. Crypto analyst Ali highlighted a contrasting scenario where several of the largest Ethereum whales have been actively accumulating ETH.\n\nETH/USD price chart\n\nOver the past week, these whales have reportedly added over 100,000 ETH, valued at approximately $230 million, to their holdings. This divergence in strategies underscores the varied approaches and sentiments prevalent among significant investors in the Ethereum ecosystem.\n\nEthereum’s Current Market Position\n\nAmidst these developments, Ethereum’s market performance remains a focal point. At the time of reporting, ETH experienced a slight upturn, with a 1.12% increase over the last 24 hours, bringing its value to $2,255.\n\nIntoTheBlock data suggests that Ethereum is trading in a crucial zone, with significant support and resistance levels identified. The $2,332 and $2,403 price points are key barriers in ETH’s potential ascent towards the $3,000 mark, while support is around $2,127.\n\nMoreover, Ethereum’s transaction fees continue to play a critical role in its market dynamics. The past week saw approximately 35,000 ETH burned, continuing a trend of negative net issuance that started in early November. These factors collectively contribute to the ever-changing landscape of Ethereum’s market as investors and analysts closely watch these developments unfold.\n\nRead Also: XRP Ledger (XRPL) Hosts Phase 2 of Palau Stablecoin Project\n\nKelvin Munene Murithi Kelvin is a distinguished writer with expertise in crypto and finance, holding a Bachelor's degree in Actuarial Science. Known for his incisive analysis and insightful content, he possesses a strong command of English and excels in conducting thorough research and delivering timely cryptocurrency market updates.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNSGNTSmJKUUtvQVlqMGpEY2xrcTJkZ0EyUU9VQzJDR3ptQTllY1JKd09mbVRWUkcxbTBSQkFoa1JIU0JnVlZ0RG5hLUFtUjV3am0zV1FHaThESjRxU3NhYnB0SnJpdVF0TnNXdUk0dXZkb0dSSzhHSUh6dENwRXlNbWh5MC11MUNJNTlsaW1YUVk3d9IBlwFBVV95cUxOY25sM2VCWTV1WFhkSTUtMXBqaXJwaDc2V05xdy02MXVZVEN5RHl1RUpBVm5HVUVmMXpLS0tlb3c2ako1NnlKYlcySFJWZlNTZHBfNmVYVWVEaURPbGluNlRQWVZZT21rMmFpTzFDTzFvdXI3MW15UDZ5M3o4cUVZZ0pLN3V3WUZMUldmSmNObjE4SE5CbF9v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin vs Ethereum – Can one’s price outdo the other’s prediction in 2023? - AMBCrypto News",
        "content": "The ETH/BTC chart has been in a long-term downtrend.\n\nIn comparison, the strength of Bitcoin was clear and is likely to continue.\n\nSince October, Bitcoin [BTC] has rallied by an impressive 57.5% as of press time. In the same period, Ethereum [ETH] gains measured 48.34%. The difference is not much, but ETH has been underperforming for close to a year now.\n\nThis means that during times when Bitcoin runs higher, Ethereum doesn’t achieve equivalent or higher gains. During periods of a downturn, Ethereum prices suffer more than Bitcoin’s.\n\nIs this trend likely to reverse?\n\nTechnical analysis of the ETH/BTC chart underlined gloom\n\nThe ETH/BTC chart on the one-day timeframe highlighted the downtrend that has been present since early June. The inference was that ETH just wasn’t able to keep up in terms of performance. And the story doesn’t end there.\n\nThe zone of resistance highlighted at the 0.055 region represented a key resistance zone that ETH bulls will need to breach to reverse their fortunes. However, the market structure was bearish.\n\nThe 61.8% Fibonacci retracement level was tested on 10th November. It was followed by a rapid reversal.\n\nA move below the 0.051 mark would signal that ETH/BTC was headed much further lower. If that happens, traders and investors could exit the ETH market if a higher timeframe bearish market structure break occurs.\n\nAssuming Bitcoin climbs above the $45k key resistance but ETH/BTC falls, participants could look to shift their funds to BTC to ride the trend higher.\n\nAssessing sell pressure on ETH and BTC\n\nA sign that sell pressure is imminent on an asset is if we spot large inflows to exchanges. If that happens, the exchange reserve for the asset would shoot skyward. In the case of both Bitcoin and Ethereum, this has not yet occurred.\n\nThe BTC exchange reserve has consistently trended lower since June. Despite the downtrend, there was a noticeable spike from 5th December to 12th December. Just after this spike, Bitcoin prices tumbled from $43.7k to $41.2k.\n\nThe Ethereum reserves saw less volatility. It, too, was in a downtrend and has been since February 2023.\n\nEthereum saw a small spike in the reserve between 11th-13th December, but the increase came during and after the price drop. This suggested that some holders panicked due to what they perceived as a shift in trend, while BTC’s inflows preceded the fall.\n\nThe inference was Bitcoin reserves and flow could be a more accurate gauge of the next price direction than Ethereum.\n\nHowever, this was based only on the recent spike, and is not a practical finding with a large sample size. Nevertheless it is something to look out for.\n\nWhat is the sentiment of BTC and ETH like?\n\nA look at the social volume for both crypto assets revealed that, as expected, Bitcoin’s social volume was far higher than Ethereum’s. Even so, their trends were pretty similar. This could be because of their price performances being closely interrelated.\n\nWhen Bitcoin rallies, so does Ethereum, but just not as much.\n\nThe MVRV ratio for Bitcoin and Ethereum also showed similar trends, but their magnitudes were vastly different. At press time, BTC stood at 41.17% while ETH was at 26.45%.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nBoth values were at their respective six-month highs despite the recent dip in prices. The conclusion was that both assets were overvalued, with Bitcoin holders being at a greater profit, and hence, the happier.\n\nIt remains to be seen if these holders choose to realize their profits en masse and cause a large wave of selling."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPNl9UQXh1V0Q5bHhNWDFNTFhOTEYwd3p2M0p3bmx5NGxlNzdvczNvczd0R1RGTkp4bzdrYzJjSEh5WVYyLVdDRHNHMmhyeF9KbVRuVW5ZQ0dRSGtINnJhTnR4T0kzQmlTSWx0UktzNW9lWjcwenVvZ0tkRjdpckJqZ1dRc3B3OWhRVFRMcm92MTFUUGFYazhSVjJkRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Cyber.Fund Relaunches with $100M to Boost Tech Innovation - Crypto Times",
        "content": "Konstantin Lomashuk and Vasiliy Shapovalov, two of the first investors in Ethereum, are reviving their interest in emerging technologies by “re-launching” an investment firm called cyber.Fund, which will use the founders’ capital of $100 million.\n\nCyber.Fund stated in a post to X on Thursday that “this new $100 million fund will serve current portfolio companies as well as service new projects and teams.”\n\nPost counties, “Its mission is to accelerate the transition to an open cybernetic economy by backing entrepreneurs innovating in blockchain, AI, robotics and adjacent technologies.”\n\nVasiliy Shapovalov and Konstantin Lomashuk, the founders of Cyber.Fund, both claim to have made Ethereum investments in 2014.\n\nWhen asked why now, Lomashuk explained that the drive is to advance these more recent technologies’ development. “We believe that we can accelerate the technologies by investing capital,” stated Lomashuk.\n\nA representative for the $100 million investment firm stated via email that the founders of cyber.Funds are the only source of funding.\n\nWhile new funds have continued to pour into cryptocurrency and blockchain businesses over the past year, the pace of investment has significantly decreased from the peak of the bull market.\n\nIn the meantime, interest in initiatives like ChatGPT has contributed to a surge in artificial intelligence investment.\n\n“Our aim is to create a more open, efficient and sustainable economy,” cyber.Fund stated in the post.\n\n“We believe that by working to accelerate the growth, adoption and eventual decentralization of the these technologies, the world will enter a new age of unprecedented prosperity.”"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPaUd6RG5HS2FSTm5yLUR0SWlaQWZFemtsc2RfT3VHcEowVkRVbFJ0QWZPeUhKMjhZbG0yaHQ1NzE0ZlRkb3lCZmVmMG13NmFPV2RfNHp1eGRYaG1yMmlMaHVFRVRLeDQ3ampibEFXUl9oNVZrcmk0WmJfODBJbm5aODl1alZyYi1aNGh5NXl1ejZmRDVPaUEzN0ZOOGg1VjR3ZkU4aFhnNTlhODNGMW91NDJMd9IBuAFBVV95cUxNLTVkLXUwZENqd2FRTS1wRmJBbWdzX3BZMjFOVHFERmE5dnd3eF9BRXhUX1BDWEdycFdPRUNBcWp2LWhTTXRRZWVHLW5rUElHMkRnZmQxbGlINFlrcmhnYzVxUXQ2eTRiMWVKZVNoT1NJM01KVGZIMmsyNmxHMkE1VnNuaVRDRUpJSUQyWkNXQzNzbGxDcnh1X2dOY0JHR1RDLUItdXB6Y0lCcWQxN2VnVFFSZ09rVzVD?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Polygon Stops Work on 'Edge,' Used to Build Dogechain, as Focus Turns to ZK - CoinDesk",
        "content": "It was pitched as a way of adding support for Ethereum-style smart contracts, which in turn could facilitate new DeFi protocols as well as NFTs; the original Dogecoin blockchain lacked smart-contract support, since it was a fork of Litecoin, which in turn was an early clone of Bitcoin, the original blockchain launched in 2009 – several years before Ethereum came along, ushering in the new era of smart contracts."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOSGk1SnVLM2p1OTU4XzEtMEJ6b1hUVGRLZWU4Rm94aFNmQnhVNTVTTXk3c0dVSkV4cXlSSTFPZXBseFE4dHBDc3QxanU2OEhMSmlZMlpKc0RsbVY1S2U3WDNRNWdBZU9GN1VhbHQ1QUdqSjBkaGUxcGFsYWJQbXVOdlppRFJhR1NJR0hZLVE2NWwtbHFPU1d2THFIRkFXLTMtcWtYanZCVWU5dDlFa3pNZEtXUE9jekNBOHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) and Solana (SOL) Pave the Way for Pullix (PLX): A Trifecta of Crypto Success - TechCabal",
        "content": "The blockchain cryptocurrency industry has evolved substantially since the launch of Bitcoin in 2009. Ethereum (ETH) and Solana (SOL) are two top altcoins that have contributed to the industry’s growth.\n\nWhile Ethereum was the first to implement smart contracts, Solana expanded the possibilities by increasing scalability. Both have contributed to the emergence of Pullix (PLX), the new trifecta of crypto success. Let’s find out why Pullix is now referred to as one of the best cryptocurrencies to invest in right now.\n\nEthereum Introduces a New Phase in Crypto\n\nEthereum (ETH) is widely considered as the blockchain industry’s backbone. This is because the Ethereum network was the first to provide smart contracts and decentralized apps. The infrastructure has extended throughout the bitcoin industry.\n\nThe Ethereum network’s popularity has propelled it to the top altcoins in the market today. Ethereum (ETH) is the project that led to the idea of a decentralized future since it created the framework for the launch of many projects.\n\nSolana’s Scalability Increased the Possibilities\n\nWhile Ethereum introduced smart contracts, scalability remained a long-standing issue. In 2017, the Solana network was launched as a game changer. While Ethereum can only handle 8-18 transactions per second (TPS), the Solana network has the potential to handle 65,000 TPS.\n\nThis scalability caused the Solana coin to gain traction. It also led to a massive expansion of the network. The growth of the network has established the Solana coin as one of the top altcoins in the cryptocurrency market today.\n\nThe Emergence of Pullix (PLX)\n\nPullix is now being referred to as a trifecta of crypto success as it combines both concepts introduced by Ethereum and Solana. As an exchange, it combines the decentralization of Ethereum with the great scalability of Solana.\n\nPullix has thus unveiled an exchange platform that exceeds the competitors. As a result, the exchange functions in a safe and decentralized environment. Furthermore, it promotes a transparent trading system that eliminates intermediaries and lowers transaction fees.\n\nThe exchange’s great scalability has enabled it to enter new markets. Users will be able to trade more than just cryptos on Pullix. Users will be able to trade assets from the stock, FX, commodities, and exchange-traded fund (ETF) markets.\n\nPullix has linked its DeFi cryptocurrency, PLX, to the trading platform in order to bring additional incentives to customers. PLX token holders will receive regular passive income transfers via providing liquidity.\n\nDue to these amazing features, there has been great interest in the platform’s DeFi cryptocurrency, PLX. Over the last few days, almost a million PLX tokens have been snapped up. Fortunately, PLX is still available at a great price of $0.042 per token before its projected rally.\n\nFinal Thoughts\n\nThe combination of successful two models has made Pullix one of the best cryptocurrencies to invest in at the moment. This is the reason why it is referred to as a trifecta of crypto success. Now is a great time to join the project before its projected rally of 100x.\n\nFor more information regarding the Pullix Presale see links below:\n\nVisit Pullix\n\nJoin The Pullix Communities\n\nKeywords: top altcoins, best cryptocurrencies to invest in, DeFi cryptocurrency, altcoins, Ethereum, Ethereum (ETH), Ethereum network, Solana, Solana network, Solana coin\n\nMeta Title: Crypto Trifecta: Ethereum (ETH) and Solana (SOL) Forge the Path for Pullix (PLX) Success\n\nMeta Description: Find out how Ethereum (ETH) and Solana (SOL) have paved the way for the success of Pullix (PLX).\n\nShare this article"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQZFlfNjk5cmdqT1lkbm5WRFBvTVdvZzVHNUJwbEN3UTRXOW4tNXdGQm9IMFQxbFVKSk9RMDZTWEV5MVZ6dlptQkZYYllmY3o4cU83TXFZY0c1VHpBTUxzd0wwdVFFMWotOFQzQm1qVkJNQkJQOFRDTUZhcVdNTnpQNUZVaExvWTJJUGNfTnlDUGczcG9lS2o1Y2lRWWI5VjA5ZGpfTUFFREIwcGJhc1JKNlpVWlMxeHhK?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "3 Transformative Cryptos Changing The World: Ethereum (ETH), Everlodge (EDLG), Toncoin (TON) - TechCabal",
        "content": "Cryptocurrency was originally created to transform how we make payments. Now, innovative new projects like Ethereum, Everlodge, and Toncoin are taking things one step further. Each project offers an innovative new solution, and as a result could be extremely profitable for early investors. Here’s why investors should consider each for their portfolios.\n\nEthereum Continues To Pioneer DeFi Developments\n\nEthereum is the largest blockchain in the world. Over 1,500 active decentralized apps have been built on the network, with a total value locked (TVL) of over $1 billion. Many analysts believe that Ethereum is now more important than Bitcoin, and could play a more important role in the future of decentralized finance.\n\nEthereum recently experienced its largest price increase of 2023, rising to over $2,350. It has since declined to $2,232, though Ethereum’s value has still increased by 8.65% in the last month. With huge plans for 2024, including a potential spot ETF, experts believe that Ethereum’s value could surge over the next year. Predictions range from $3,000 to $4,000+, though most experts agree that Ethereum’s value will rise.\n\nToncoin Blockchain Slows Following New Protocol Release\n\nToncoin was created to provide seamless DeFi transactions, offering speeds of over 100,000 transactions per second. However, a recent issue with Toncoins transaction processing has cast a shadow of doubt around the project.\n\nLast Tuesday, a new protocol inspired by Bitcoin Ordinals caused a spike in activity on the Toncoin network. This caused the blockchain’s speed to crash to less than 1 transaction per second on Thursday, during which over 2.5 million transactions were pending.\n\nDue to congestion Tonkeeper, a popular Toncoin wallet, had to suspend its services. Later reports suggest that network usage increased by 61 times in just 30 minutes, causing issues for Toncoin. Since this setback, Toncoin’s value has fallen by 8% to $2.17, and Toncoin’s daily trading volume has fallen to $50 million.\n\nCould Everlodge Revolutionize A Trillion Dollar Market?\n\nWhile most crypto projects focus on finance or the blockchain, Everlodge applies DeFi technology to an entirely new market– travel properties. As a pioneer in this industry, Everlodge is expected to gain significant traction throughout 2024 as thousands of investors discover a new way to build their property portfolios.\n\nEverlodge looks to disrupt the travel property market by minting properties as NFTs. This is designed to streamline the buying and selling process. Once minted, NFTs are fractionalized so investors can buy a percentage of the property instead of the entire property outright. For example, a holiday home in the U.K. worth $1 million could be split into 5 fractions, after which 5 individuals can own a 20% share in the property.\n\n<blockquote class=”twitter-tweet”><p lang=”en” dir=”ltr”>We're thrilled to announce that our website just got a makeover! 💻<br><br>Check out the fresh look and discover the NEW features we've added. It's all about making your experience even better!<br><br>Plus, remember that our Presale is still ON. <br><br>Explore now: <a href=”https://t.co/SIYWBylwQD”>https://t.co/SIYWBylwQD</a><a href=”https://twitter.com/hashtag/RWA?src=hash&ref_src=twsrc%5Etfw”>#RWA</a> <a href=”https://t.co/aTuT8x7z36″>pic.twitter.com/aTuT8x7z36</a></p>— Everlodge (@EverlodgeHQ) <a href=”https://twitter.com/EverlodgeHQ/status/1716543605576241503?ref_src=twsrc%5Etfw“>October 23, 2023</a></blockquote> <script async src=”https://platform.twitter.com/widgets.js” charset=”utf-8″></script>\n\nThis unique application reduces how much an investor needs to get started, and removes traditional barriers to entry, such as location. Properties available on Everlodge will include luxury villas, hotels, and holiday homes, with plans to add more property types in the future.\n\nEverlodge is currently in stage 8 of its presale, having sold out at record rates during its previous seven rounds. Its native token, ELDG, is currently available for just $0.027, and will offer numerous benefits to holders once Everlodge officially launches.\n\nInvestors who buy ELDG tokens during the Everlodge presale will automatically be granted access to the Everlodge private members club, which will offer lucrative rewards such as free stays at properties within the Everlodge ecosystem.\n\nVisit Everlodge\n\nShare this article"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOVHZacFlVWmxONURKdWVia0hVNGFhSFVyMGFuRnZsX0NWTU1zellZRHk2NXJ0Z2s3MURkYXpsUnM2eVpMUnRjVzB4V0piLUh5ZnhUQTdOYkpYUjU0empxUE85WWNZbldaZXpjNnV2QmplbzZOZ1Jlc2QtclBlM0xoZ25EZWwxU0wxcEJFbWpPU3VjbGxMZnU5aV9lbTJOMUU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Ethereum price prediction as 3 out of 4 ETH holders are in profit; Time to buy? - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) is the largest and most used decentralized finance (DeFi) and Web3 layer-1 blockchain infrastructure. Its native token, ETH, is also the second-largest cryptocurrency by market cap, with $270 billion at the time of publication.\n\nNotably, Ethereum’s price is up 85% in the last year, now trading at $2,249 per token. This surge has rewarded ETH holders, who are now 76% in profit, according to data by IntoTheBlock on December 16.\n\nIn particular, the percentage of Ethereum investors in profit is the same as long-term holders, who have kept their positions for over a year. Both data sets are achieved by looking at all active addresses in the network from the received and spent transactions.\n\nHowever, 23% of all Ethereum wallets are holding a losing ETH position, while 1% acquired the token at current prices. At the same time, 21% of Ethereum holders have held their position for between one and 12 months, while 3% just recently bought ETH.\n\nEthereum (ETH) holders data. Source: IntoTheBlock\n\nIs it time to buy ETH with 76% of Ethereum holders in profit?\n\nIt is important to understand that the higher the number of Ethereum holders in profit, the higher the likelihood of a sell-off, as they might want to realize the, so far, unrealized profit. Therefore, buying ETH right now could mean becoming the profitable exit liquidity for 76% of all Ethereum holders.\n\nMeanwhile, only 46% of the tokens are concentrated in the hands of addresses holding at least 0.1% of its supply. The low concentration of whales and institutional investors lowers the risk of huge coordinated sell-offs. Balancing the previous analysis.\n\nCryptocurrency traders controversially believe we are experiencing either a bull rally in a bear market or a bull market already. Understanding the current status of cryptocurrencies is essential to make a profitable decision of buying or not buying ETH.\n\nMoreover, further developments and DeFi ecosystem growth for Ethereum could generate more demand for its token. An increased demand would drive ETH prices up, while a reduced demand would create an opposite outcome.\n\nAll things considered, the decision to buy ETH is personal, and investors must be aware of the risks. Essentially, having a good risk management start is necessary while investing in such a volatile and experimental market.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]