[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQbWo3aEJoVktYbElqREJZcWVBQ3IteE95RDctb0dOek5QdEYtUTZHaUFCMEtXSnpoN3k5SkhJVm5VUzVsdkNBQTVYVUctQ0l4R25wU0NTTVExLVZhbWZDTTRiVVBxb2FxOGdLUW41V2tWeU5kNVZqV1BMNEJmdGlhbVRHdkpxRnZLaTdIY2NCR0tTNnFoUndjUmhaLVlITWNKemE2aGpvbUwtZTjSAbABQVVfeXFMT1U5WVhETTN5cmJyR0VqNnRXREhFSmlSQ1I0U0NnUS1pVTdLdnNvYVA2UVFVWVVsU3FwWmxLdkhYVFdjTnRiYmpOS212R0REUTdpVk1Bb0ZMeHI0YmJaSlpNLU1fWUNmRHhldms5VDUySm9odnlZLVRRRFdvNnpBOU55Wk9xb3UtVlkydm1HcHdPRWY1Znl5dEwxZXdtQVRYVXp6Y182NVhkWEtvcUpSTF8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Lido DAO Democratized ETH Staking, Then Dominated It - CoinDesk",
        "content": "But Lido has gradually become a victim of its own success, with the DAO attracting criticism as it has grown to dominate Ethereum's staking landscape. Lido currently commands 32% of all ether staked. This puts it just below a critical 33% threshold; if a single entity controls this much staked ETH, it could, theoretically, influence certain elements of how the chain operates."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOeFAzckNNT3d5ZG9nNGdRUU5Cc0txakVrUU5yUm5ySHlIcV9JOHhzLXFzT3JXYmpCQ3RsRGVUVDdIbDdZeUUyWk5LNnRISFBwSXpIX1RaMUdNZGxwNFdUcTBMenIzZ3dtMmtqSy1GWmJEcmd4SW82azlWdm1kXzVkQUNVT3E1cjdZSTR5WF9MVUlaMGEweG4xNzVfWGx2dEJ4TVd4dUxXdHFYZC1XdEEwc3BSMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin primed to outpace Ethereum during bull market for first time next cycle - CryptoSlate",
        "content": "Quick Take\n\nThe year 2023 has marked a shift in the Ethereum to Bitcoin ratio. Despite Ethereum’s substantial dollar value growth of 88%, it has significantly underperformed compared to Bitcoin, being down by 25% against the lead digital asset. The ratio currently sits at a precarious 0.053, teetering near year-to-date lows.\n\nThis trend invites speculation as to whether the crypto landscape may soon witness a further dip in Ethereum’s performance. The BTC-ETH Dominance metric, an oscillator that tracks the macro outperformance trends between Bitcoin and Ethereum, provides some relevant insights. It gauges the Bitcoin Market Cap’s dominance over the combined market cap of Bitcoin and Ethereum, normalized around a long-term mean using a 0.765 factor.\n\nHigher values and uptrends point towards Bitcoin outperforming Ethereum, while lower values and downtrends signal Ethereum’s superior performance. Currently, we are technically in an era of Ethereum dominance, with the metric at -0.016, which is the lowest level since Ethereum dominance began in May 2021. Traditionally, Ethereum tends to outperform Bitcoin during bull markets, raising the question: Could this be the first bull market where Bitcoin outpaces Ethereum?"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOZDA4V0pmMC1IN01iRjlvNGo5dXpwcTM5cmJjZzJobWN6MmhxRHRiRFRlaVpISXBvejItYjdzNjh2T0F1ZGhndFRBN2FtZy1nZ2dsQWU0VWxkNzhUSHlPY0EyNXRDem5YeGg2OEpKMmVwd01QRnYwOXFoX0JnRWdMMWpEVFg1ZzdwSUxPWkpIUlRMR3BYRmfSAZ4BQVVfeXFMTkNhblA3aVo1eWVqOE9ib0s5VEdtNWhERG5sNjFMLU9walktNDZfVVE5ZWh1RDNQXzAyUFl5ejh2VDQwUDMzYzlha2ZtZ1ZSMFBIdy14bHBHQ3Mza1kzbDl1QTVwZm55YzRST3pZS3hfUUFrdkxCMS1aYTNmY1VZSWxWLTA0NWZjcVl4V1NaQ3BTUHpic0dsVjc1U28wS0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Ethereum, Dogecoin and Bitcoin Cash Are Benefiting From BTC's Rally - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin's surge may be getting the headlines, but a number of altcoins like Dogecoin (DOGE) and Shiba Inu (SHIB) are also experiencing big gains.\n\nDogecoin, the biggest meme coin in existence and the 10th largest digital asset by market cap, was last week's biggest gainer and is still gaining today: over the past 24 hours, it's closing in on a 5% gain and is trading hands for $0.08.\n\nMeme coin Shiba Inu has also seen sizable gains, having risen nearly 6% in the past day. The Dogecoin competitor and meme coin is the 19th biggest cryptocurrency by market and is right now trading for $0.00000888.\n\nMeme coins—volatile cryptocurrencies based on Internet memes—last week got a boost after a number of new tokens sprung into existence following the deaths of legendary investor Charlie Munger and divisive diplomat Henry Kissinger. But the meme coins have already seen their moment pass. MUNGER has done less than $1,000 in volume in the past 24 hours and the Kissinger token has seen none of the tokens change hand at all since yesterday.\n\nAD\n\nAD\n\nEthereum, the second biggest digital currency by market cap, is also up, having gained more than 2% in the past day. It is currently priced at $2,208 per coin.\n\nAll eyes are on Bitcoin, though, which has continued to hit highs not seen since the biggest coin in existence crashed in May 2022.\n\nRenewed interest has flooded the market as investors are optimistic that the Securities and Exchange Commission will approve a spot Bitcoin exchange-traded product after 10 years.\n\nThe asset has surged by over 12% in the past week but is still well below its November 2021 all-time high of $69,044; it is currently priced at $41,256 per coin.\n\nAD\n\nAD\n\nMeanwhile, Bitcoin spin-off Bitcoin Cash (BCH) has been one of the best performers of the top 20. Its price has risen 7.5% in the past 24 hours. At the time of writing, BCH is is trading for $244.28, according to CoinGecko.\n\nOver the last seven days, the altcoin, which aimed to be a faster and cheaper version of Bitcoin, is up 8.5%.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNRExwcjlPX2hldXQ1ZngtcHhycWpxdTRiTkxod0QxTE5NWGJSMnZjRHVfZ3hrdWUza21lam1kVG8zRmhKcVZtWFNKQ0tYZGlqNWI3N1hPZlNkNmtKai1YdkhKdTBLZjBfaXRaWmFybHBqLUtHQ0RsZ0YycEpmZGFyTHllWFZsU05PWUdKbU5fR183ZTJMSFZhUTNBZzFwOUJQVjNBX0hsVzV3cUxtLXRFNDkwR2YtZHI1d0VUNHY1UHJQdHfSAcgBQVVfeXFMTmkycVlDbWJHZmtVNzhSMEFhVWI4Q09QVW1KR3lHYWZKWldNLXZYbHZVbzVTTDFYaGR2eExMTjNLVTRXRFdfNUtUaldhVFBEbVA1RnJZYjZKdjN6a1pwcUxZOW4xLVpJQXdhbExhdlFRcV85QzJDQ2dPeWVEcXVNSFd2WkZGQjNlMHpYUzFJYTBVdVF4eTloaE1SeFI5cUt6Q3VNT3FuVVNsVU5oeXlwLWpYSE5BeVFnRWdtcGpjNG1nUFh0LTBkdkQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH attempts to flip $2,300 into support - FXStreet",
        "content": "Ethereum price is on a tear, consolidating within a bullish technical formation that promises more gains if sustained.\n\nETH could rise 5% to convert the $2,300 resistance level into a support floor before continuing its upward trajectory.\n\nThe bullish thesis will be invalidated upon a daily candlestick close below the $2,143 support level.\n\nEthereum (ETH) price has been consolidating within an ascending parallel channel since the broader market turned bullish around October 18, pushing north with key drivers including speculation of spot Ether exchange-traded funds (ETFs) launching in the market.\n\nAlso Read: Ethereum price breaks past $2,000 as BlackRock hints at filing for spot Ether ETF\n\nEthereum price eyes 5% rise above the $2,300 support\n\nEthereum (ETH) price is trading with a bullish bias, sustained by an ascending parallel channel. This technical formation promises and delivers more gains for the asset as long as it remains within its confines. However, based on the current outlook, the largest cryptocurrency by trading volume looks ready for a breakout after one attempt already.\n\nTechnical indicators show that Ethereum price still has some upside potential, with the Relative Strength Index (RSI) inclined north at 69 to show momentum is still rising. Its position below 70 is good, suggesting ETH is still not overbought nor ripe for a correction.\n\nSimilarly, the Awesome Oscillator (AO) remains in positive territory with green histogram bars. This points to a strong presence of bulls in the Ether market and could bode well for Ethereum price, depending on how the bulls play their hands.\n\nIncreased buying pressure above current levels could see Ethereum price breakout above the upper boundary of the chart pattern, confirmed by a flip of the $2,300 resistance level into a support level. This would set the tone for Ether to continue its upward trajectory.\n\nETH/USDT 1-day chart\n\nOn-chain metrics support Ethereum price bullish outlook\n\nMultiple on-chain metrics support the bullish thesis for Ethereum price, including the dwindling deposit transactions and the volume of exchange inflows. As a spike in deposit transactions would indicate a rise in short-term selling pressure, the absence thereof shows investors do not have the intention to sell.\n\nThis outlook is corroborated by dwindling exchange inflows, suggesting investors are not moving their ETH holdings to exchanges. There is no effective intention to sell in the near future.\n\nETH Santiment: Deposit transactions, exchange inflows\n\nFurther, the Tether (USDT) stablecoin market capitalization is rising, suggesting fresh capital inflow into the Ether market, interpreted as the intention to buy. The ensuing buying pressure could inspire a prolonged uptrend for Ethereum price.\n\nETH Santiment: USDT market capitalization\n\nConversely, if selling pressure increases, possibly as investors start booking early profits after such a striking climb, Ethereum price could pull south. In such a directional bias, ETH could lose the confluence support between the midline of the channel and the horizontal line at $2,143. A break and close below this level would invalidate the bullish thesis.\n\nFurther south, Ethereum price could extend the fall, potentially going as low as the $2,029 support before a foray into the supply zone turned bullish breaker. A decisive candlestick close below the midline of this zone at $1,935 would confirm the continuation of the downtrend."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNcHR4dFl0cTZFaUlLQTdaVWpPY1lPT2o3OGNmWEI4VUNWUHUxS3pqTWhqQTktcXg1Z3dyaXpDckRWWWlzYnY4djhqM3dlZVhOOGQ3M2ZnQndPdWJIUm9BYUdrc2FpalZHMWsxdmVyRkQtQ2FRQ0J1ZlJ3azhSSFZ1SFBn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Why Has Bitcoin Rallied More Than Ether in 2023? - Unchained",
        "content": "BTC crossed $42,000 for the first time since April 2022 amid rising market optimism that a spot bitcoin ETF would receive approval.\n\nBitcoin and ether once rose and fell in near lockstep, but no more.\n\nThough the prices of the two largest cryptocurrencies by market value have both climbed in 2023, they have taken somewhat different paths, with BTC skyrocketing 145% year-to-date and ether jumping a still strong but lesser 85%.\n\nOn Monday, bitcoin cracked the $42,000 threshold for the first time since early April 2022 when the Terra ecosystem started to collapse, while ether rose above $2,200 for the first time since May 2022, according to Coinmarketcap data. BTC was recently trading at about $41,950, roughly flat over the past 24 hours.\n\nRead more: 12 Charts That Tell the Story of Crypto in 2023\n\nIn its newsletter on Monday, Kaiko Research, which tracks crypto market data, attributed the gap in no small part to rising optimism that the Securities and Exchange Commission (SEC) would approve applications for long elusive spot bitcoin ETFs.\n\nKaiko noted that BTC volatility has declined significantly since the summer not long after BlackRock, the world’s largest asset manager, and other financial powerhouses submitted their spot bitcoin ETF applications. The firm used the Sharpe Ratio, a measure of compensation that investors receive for taking on more risk where a higher ratio equals a better risk-adjusted return. BTC outperformed most traditional assets, including gold, and Ethereum.\n\nRead more: Spot Bitcoin ETFs Record $4.6 Billion First Day Trading Volume\n\n“The difference in risk-adjusted returns can largely be chalked up to BTC’s superior price performance this year. The ratio was about 0.072 at the start of the year and is now 0.053,” Kaiko research analyst Riyad Carey told Unchained in an email. “ETH has likely had a softer rally because the main catalyst/narrative – a potential spot BTC ETF – directly relates to BTC.”\n\nBitcoin, which has a market capitalization of $812 billion compared to the $267 billion for Ethereum, is often hailed as “digital gold” and viewed as a hedge against inflation and economic uncertainty. As a result, bitcoin’s price has tended to be more sensitive to global economic factors and policy changes such as Federal Reserve Chair Jerome Powell’s comments last week that another interest rate hike wasn’t currently in discussion – a favorable sign for the asset.\n\nSpot ETF Applications Favor BTC\n\nThirteen companies have filed spot bitcoin ETF applications, including Grayscale, which hopes to turn its bitcoin trust into an ETF. The SEC’s thinking on the Grayscale situation remains unclear and could delay that potential product’s approval, although in an interview with Unchained, Bloomberg analyst James Seyffart reiterated his belief that he expects the SEC to approve the applications en masse between Jan. 8 and 10.\n\nThe SEC is currently considering seven applications for spot Ethereum ETFs. While a BlackRock application last month caused ETH to have a stronger rally than BTC, there’s general sentiment that bitcoin has an easier road to approval. This is partly because bitcoin is older, has a larger market capitalization and has a more straightforward use case. Ethereum, in contrast, is a more complex platform for decentralized applications (dapps).\n\nOn Monday, BlackRock and Bitwise filed amendments to their applications, a further indication of progress, Seyffart wrote.\n\nMeanwhile, another measure of crypto market optimism continued to point upward as inflows to digital asset investment products rose for a 10th consecutive week, according to research group CoinShares. The rise underscores institutional investors’ interest in the asset.\n\nCoinShares data showed that bitcoin had $133 million in inflows last week, bringing its year-to-date total to $1.68 billion. But the group also found that Ethereum had just $31 million of inflows over the same period, bringing its net flows into the positive for the first time this year.\n\nIn an email to Unchained, Markus Levin, co-founder of XYO Network, echoed Carey’s comments. “Bitcoin has outperformed Ethereum in large part because many are anticipating that these spot BTC ETFs will likely get approved fairly soon,” Levin wrote. “An ETH ETF might also be on the horizon, though it’s less definitive than the Bitcoin ETFs. As a result, I think we’re seeing a lot of capital getting allocated to Bitcoin and this, in turn, is having an outsize impact on momentum.”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOa3JtZzlleWpIbVkyTG5nZnFvYi1tT1FzU1lpSjhLZEtQOUdLR3Jjc1F6UG1xWV9VY0l6M2kxb0VHUVgzUmpSTWhYR1ZvWklmNEhUMkYta3k5Q0pRcFprZmhET1ROTWhuOFFXMElTSkRObTA4MWRueVJtclh2TjVYVnVjMlN1eDR2V3VYZ2VMbTVVUFZuZG03bmw4VXAwaDU5QTc2TURLb2lPUFRzNEp4Y0hVaWdSMk5vZG44azNEUVNZZ9IBxwFBVV95cUxNMU1Vc0JVZFo0bjVfdU9uMHVrSGNuNGN5ZElOd1lZMHR0TVVmUWNEbUt0VmhNdlNSbWRTN3NwN1E0dEhIcGMtSEhyS01sazZDemZVMGUxbVJFS2dMNVdSMC1HS3lEdHBZajNnR3BSYlNsZ1p3c2hDdFB3SXRxSEk5eFQtbzhVU0lQWU1GMDFCMlQ3OFVETFdUV0VhS2lWU1pmQ21kQlBFYnNpU1ltQW5XZkZsR1piYkJHRC0xQW1fODBZYkFSNzBv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Crypto Strategist Unveils Bitcoin (BTC) Path to $83,000, Gives Short-Term Ethereum Price Target - The Daily Hodl",
        "content": "A closely followed crypto strategist is laying out a roadmap for Bitcoin (BTC) to hit his long-term target of $83,000.\n\nPseudonymous analyst Rager tells his 199,900 followers on the social media platform X that Bitcoin could rally close to $50,000 by next month.\n\nRager predicts the big move up will be followed by a steep correction down to the $30,000 level as BTC approaches its 2024 halving.\n\nThe halving, which slashes BTC miners’ rewards in half, is slated for April 2024.\n\nAccording to Rager, Bitcoin will continue its uptrend after the halving en route to a new all-time high of $83,000 by 2025.\n\n“$48,000 by mid-January, followed by a pullback to mid/low $30,000. Rally post-halving, new high in late 2024.\n\nPeak-high price in early/mid 2025. Q3 2025 ends bull market.”\n\nAt time of writing, BTC is trading for $41,433, up over 11% in the past week.\n\nLooking at the top smart contract platform Ethereum (ETH), Rager thinks that the leading altcoin is poised to move higher toward his upside target of $2,500.\n\n“ETH slowly gaining strength over time\n\nEventually, price likely heads up toward $2,500 as a nice target.\n\nNice move this weekend but not always a fan of weekend pumps.”\n\nAt time of writing, Ethereum is worth $2,252, up over 4% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOYnVzWnZ4UkFWT0NQbF9idExGYVV4ZU9rbWIzdWhvWko0a19KTDZxOXVvY2NSaDB3ZGxTSkpHT2FCS1dnRFVzYmN3ZV8xd0toRkZJRmJKVUZpaFpnbFFrX2duMFhadHBvUlNjR2QtR01SR0hnc2otRjIzM3hUSUdkUmxKR3bSAYoBQVVfeXFMT3FzVWlOYTJvaGtpcHRYWlBGVTM1UDc1ZXhRRHdYVUVMOWJ1bnNNeEV4cjRZbXZEcW16ckZieTlVUm4xMTBjdGxKQ3VjTDF2MURWaEdKQTZta3lxZWRqbnhreFpYeU85eU91bkh3VzhiRi1qOTBjbzFoRVJTZThRMFBEYnAtV29mdDdB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Breaks Critical Resistance Level: $3,000 Ahead? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) has recently displayed remarkable bullish behavior as the price broke through a critical resistance level. The latest charts illustrate an ascending trajectory that has left many investors and analysts contemplating the possibility of the ETH/USD chart reaching the coveted $3,000 mark in the near future.\n\nAdvertisement\n\nExamining the daily chart for Ethereum, we see a series of higher lows and higher highs, which is the go-to indication of a bull market. The price has now surpassed the dynamic resistance provided by the 50-day and 100-day moving averages.\n\nETH/USD chart by TradingView\n\nHowever, despite the recent uptick, the volume behind the movement is descending, suggesting a lack of strong momentum. This pattern often precedes a consolidation phase, where the price stabilizes before making a definitive move. Investors should watch for a possible consolidation, which could confirm the sustainability of the recent breakout.\n\nAdding to the market dynamics, the rise of Layer 2 solutions (L2s) has been gradually increasing Ethereum network fees. While L2s are designed to enhance scalability and reduce costs on the Ethereum network, the transition period could lead to a slow but steady climb in fees. This rise could potentially lead to a stalemate situation in network activity if users begin to balk at higher costs, influencing the ETH price as the network's utility comes under scrutiny.\n\nAdvertisement\n\nOn the technical front, the relative strength index (RSI) is approaching overbought territory, yet another sign that the market could be due for a pause. A retraction or sideways movement would allow the RSI to reset, providing a healthier foundation for future growth.\n\nThe confluence of these technical indicators and the fundamental backdrop of rising network fees due to the adoption of L2s presents a complex picture for Ethereum. While the current price action looks promising for a test of $3,000, the underlying volume and network fee trends suggest that a period of consolidation or even a minor pullback might be on the horizon before any further significant upward movements are observed."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE84QWtoRm44WjEyMTJBZEJOM0ZwS1Z0UnBOTzlxSWUwUGUtRGJUU0VwSF80dXkxZHpQOW5Odzc5c1FnUUlZZmlYMFc2RG9fQTc0WHBxMVRiTjZ5U1Rzc2pLVWpWTDZwckpmMHlaRlA1V0ZGZURrNkV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "AXA IM buys digital green bond using SocGen FORGE’s Ethereum stablecoin - Ledger Insights",
        "content": "Today AXA Investment Managers (AXA IM) said it purchased a €5 million tokenized green bond issued by Societe Generale using the CoinVertible for settlement. That’s a stablecoin issued by Societe Generale FORGE. The transaction on the public Ethereum blockchain is part of a new joint experiment. In July AXA IM was a judge in SocGen Forge’s tokenization hackathon.\n\nCoinVertible isn’t designed as an average stablecoin, but instead for institutional usage. As in this case, there’s a need for trusted on-chain settlement assets.\n\n“The aim of this initiative, carried out in collaboration with Societe Generale – FORGE, was to enable us to experiment the use of a stablecoin as a settlement asset to purchase a digital bond,” said Laurence Arnold, Head of Innovation and Strategic Initiatives. “Our ultimate objective is to optimise our existing processes by adopting the most advanced technologies, so we can offer the best possible services to our clients.”\n\nSocGen’s first digital green bond\n\nMeanwhile, the digital bond reports the carbon footprint of the security token issuance infrastructure on chain. Societe Generale issued a €10 million bond, with AXA IM taking half and Generali Investments the balance. It’s a three year, senior preferred unsecured bond.\n\nDespite the stablecoin’s launch in April, this is the first real use of it. The original stablecoin had zero transactions and was burned in October and updated to a new contract to support instant settlement. AXA IM’s purchase of the stablecoin and transfer in exchange for the bond took place on Friday. SocGen Forge holds €10 million of the stablecoin, with another €500,000 issued to an unknown wallet last week.\n\nSince Friday there have also been some small transactions involving the Bitstamp exchange.\n\nAXA IM previously participated in the European Investment Bank Ethereum bond that was issued on Ethereum via SocGen FORGE’s infrastructure. In March the French regulator AMF granted AXA IM its digital asset license. SocGen FORGE received its first license in September 2022 and an expanded version this July.\n\nUpdate: added details re bond amount and Generali"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPdXotOHNNLUpQUVJFSjcxTVZvbmJfS3B6Yi16eEZ3Q0g0T2stdXNlMHRJSnE0WXhpSi1vT2Z3STlmVGxwMmF1aWRlYnZZS1VmbXFaWXRZMUhGaDZPM2o2YXJwS0N3ZzJ2UlBTWXVVV0FQX1NIRlJUYl9mZG5vZVlpNldyMUw0dkljNEZfZTBaT01uQTJhTVAyV21BVllCd0QxV1FUUnVlT05EbFFxbWpKM29lTVFjQTJTb2ZkQUZ6SkxoWVFZMEVRbUhwOWROdjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Analyst Says Ethereum Price Will Hit $28K Following BlackRock ETF Approval as BTC ETF Token Presale Passes $2M - CryptoPotato",
        "content": "Ethereum will skyrocket in price should BlackRock’s Ethereum spot ETF gain the SEC’s approval, according to analysts. This will result in more than 10x growth based on its current price.\n\nMeanwhile, the Bitcoin ETF Token presale recently hit $2m as analysts provide 10-100x price predictions.\n\nUnprecedented Institutional Captial Anticipated as Key Price Driver\n\nEthereum’s price experienced a notable spike in November when the world’s largest asset manager, BlackRock, doubled down on its crypto efforts, filing for an Ethereum exchange-traded fund.\n\nIf approved, the ETF would be listed on Nasdaq, opening the door to a broad new audience previously deterred from buying ETH for technical, security, or liquidity reasons.\n\nThis would propel cryptocurrency to a legitimate investment opportunity, even for traditional investors. As such, it is no surprise that Ethereum’s price is rising in anticipation, currently at $2.09K, up 15% in the last month.\n\nYet, some analysts are significantly bullish on where Ethereum could be headed in the upcoming market cycle.\n\nIn a breakdown on TheStreet, prominent analyst Austin Arnold said, “The largest asset manager in the world, BlackRock, is now backing both Bitcoin and Ethereum,” suggesting this is of monumental importance for the assets’ future.\n\nHe then considered BlackRock’s assets under management (AUM), how much it may allocate to the ETH ETF, and how this could impact the asset’s market cap.\n\nArnold then discussed a bull case following the ETF approval, contemplating Ethereum could climb to highs of $41,000. However, he stated, “I do not see Ethereum getting that far.”\n\nInstead, the analyst sees a more realistic prediction being $28,000, or $10,000.\n\n“Whether it’s $28,000, $45,000, $10,000, I’d be happy with anything, but I’m a long-term holder,” Arnold concluded.\n\nOne of the factors that he highlighted was the difference in Bitcoin’s and Ethereum’s structure, tokenomics, and utility. He explained, “One’s digital gold, it’s aiming to be a store of value. While Ethereum is like digital oil, used to power a global, decentralized supercomputer, build apps. Just like a car needs gasoline to be able to run, Ethereum is the gas that makes the system work.”\n\nThe analyst also referenced Ethereum’s burn mechanism, which makes the token deflationary by destroying a small part of each transaction fee. Coupled with the incoming ETF liquidity inflows, Arnold believes this could significantly bolster its price.\n\nHowever, he understands there is a ceiling to how far it can go in the next market cycle. “$10,000 ETH is the most realistic scenario,” he said.\n\nThis represents less than a 5x gain from its current price. While this is a significant return for those with large portfolios, it is unlikely to render sufficient returns for those with limited financial resources.\n\nOne alternative with a lot of upside potential is Bitcoin ETF Token, a new trending presale that has raised over $2.1 million in three weeks amid the BlackRock hype.\n\nStake-to-Earn Bitcoin ETF Token ICO Hits $2M Milestone\n\nBitcoin ETF Token is a compelling new project that rewards holders in line with key Bitcoin ETF milestones.\n\nThe project has allocated 25% of its total supply to be burned as Bitcoin ETFs reach five main targets, creating a sense of scarcity and fear of missing out (FOMO) when the hype is highest.\n\nIt also features a 5% burn tax on transactions, reducing by 1% at each milestone. This incentivizes people to hold longer and ensures explosive price action following the project’s IEO.\n\nThese factors make Bitcoin ETF Token deflationary, introducing the scarcity principle into the project, which has been a key driver for Bitcoin’s parabolic price action since its launch in 2009.\n\nAnother exciting factor is its staking mechanism, rewarding its community and incentivizing users to lock up their tokens, further limiting the available supply.\n\nHolders can garner a 118% staking APY, but they must be quick because this decreases as more users stake their tokens.\n\nThe project has experienced significant success lately, with top analysts providing massively bullish predictions. Jacob Bury speculates it will 10x after its launch, while Crypto Boy believes it could 100x.\n\nVisit Bitcoin ETF Token Presale\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nThe project in the above article is not related to Bitcoin or to a Bitcoin ETF. It’s a completely different token.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPLTU5SDJtRnVfRllYUUNSQVREQjNrZ0s4d0tUZzFFWTVuX2JGRlIyUWpmSnRfNHdUTFprX2I1Z3NKSlh1dWlpMjdvNHJQRFpJOVFjNTRuLVdkY0hYWmNJVUd1WjBuZWJ1QlQ3aEpLbDlRQ2dTbVNXanp2VG5pRFk5a3pPbXNNQmRmVjlfV3lXOXdSdzRYU2tabXJ1UHJ3UUdweThfTEh5U0tNQmdUY0NoeDRpZmFGbmk4Q0RFbk0tTVlJVTVOQjNUekljN1IxOFVWejJhQ1Z30gHbAUFVX3lxTFBLMlNjNzc2alRVX0lkbkdYOXdqUHNKRTg0M0dKbGF2S2Y5X0preUFibklRbHZFbldHN1ozUlk5aFRiVmY0Z0dKT0dIelU0RGdMV2liNTE5OHJQT2s0RE82YlluZ1hqMHNBbmZLNmZZbm9uMTFFLThBaFREbHRaNHdRSUg0V2YzenZCaWNid19MYkFxYVBzS0lNTEtXb1hxc3BGRTlQSGhKY01Ca0M3bjBCS1RyeVcxanQxZWNnWUUweHhWMGxucjFiY19ZanBnNHNnNDdBRzlNbm9sbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Tokenization of RWAs Gets Push in Europe as AXA, Generali Buys SocGen's Green Bonds on Ethereum - CoinDesk",
        "content": "The issuance underscores traditional financial (TradFi) institutions' growing appetite for using blockchain-based technologies, including tokenization and stablecoins. Last month, JPMorgan and Apollo made headlines by demonstrating with a handful of crypto firms how asset managers could tokenize funds on the blockchain. Tokenization means placing assets like bonds, credit or real estate to blockchains in the form of a token."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxOQVN4dVZ0R0dTbGxkM05NbFNmTS1NWmRYemI5WnEyWkI2RG5SQnkyOFNfWHJzT2ZPdGZHVmpqSW42RUR6dXFEQUViaUlacTdKc19hOEduRWRxTHp5Z3dKRUZGWmo0U3pxTFd5cnRxUG9BakItanJZYWZLNkp0amVwNXZ5UGd6UmhyTUtnaFBhUXNVX3h5cTFPM0FGUnhYOW1ORE5obnNKTU1DX0pMVmpKQkEtN0FXYWhGYWJSSGNMbmZwRktzT3J0MnR4YUxuMDc50gHWAUFVX3lxTFBKYWgzNUE5X2ZXS3lLenFIRjRrNkhGMUt6YzQtWklJQ3lvX2RhSXlDandjZUFrMVJJdXpTZVNsMC1ZLUR0TktWRVNsNEZBdFZyNFU2cnJwMlYtb0ZhWEtCSEJXRmluUE55Y1hoR0p3QVBIUUd2S19TTVdXY2hQelBEMVlJYkJleUo4b015bkNZZTU4MWctaVR1SVhNNERwZHFYdXpvaWJDTm1yQ2JZbVVVbTZaQUJ4QVB6bVEtXy02c1gzbWc5QWR4T0VrSk1qZXNsbVliNGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Dec 2023 08:00:00 GMT",
        "title": "Breakout Rallies in Sight for Ethereum (ETH) and Chainlink (LINK), According to Analyst – Here’s His Forecast - The Daily Hodl",
        "content": "A closely followed crypto strategist believes that Ethereum (ETH) and Chainlink (LINK) are poised to witness more moves to the upside.\n\nPseudonymous analyst Inmortal tells his 202,500 followers on the social media platform X that Ethereum has broken out of a triangle formation on the four-hour chart.\n\nAccording to Inmortal, the breakout will likely stick this time around.\n\n“ETH is ready to do the thing.\n\nThis time for real.”\n\nAt time of writing, Ethereum is trading for $2,162, up 3.63% in the last 24 hours.\n\nLooking at the decentralized oracle network Chainlink, the analyst thinks that LINK has broken out of an ascending triangle pattern and looks primed to hit his target at $17.00.\n\n“We Gucci. Keep pushing.”\n\nAt time of writing, LINK is worth $15.92, up over 6% in the past day.\n\nAs for Bitcoin (BTC), Inmortal says that the crypto king has managed to sustain a strong uptrend in the past one and a half month after printing consecutive bullish higher-low setups.\n\n“Short this is not a good idea. All shorts opened in the last 45 days are either stopped out, liquidated or underwater. In the meantime, the market continues to make higher lows.”\n\nAt time of writing, Bitcoin is trading for $39,558, up over 2% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOekFtSEZtNWJGSzRISjEyZ014WkxwaGQ3X0dkS21BRXdxN24yV1ZTeGFBcVRqY2tkem1RQUE5T0dYa2lxcGxqS1QxTFg3ZWZnRUxlR2tYcmh6NVpOOFJfbW1Ub2kzcEtLTzhJZEEtRzRLRFpfR3ZkUTBickRJYnotZDcxWXFXZko5c2IyMWJqMXNXMHBZYWFnckxaQWtDbGhOb29Da0hWNExycGp6UjI5RjB4UU5DUFhVWmM0V05GUdIBxAFBVV95cUxOUHczVkg4ZHotNWVYdXNXa1k2QmlOQ2tBa3pBdHZBWW14b0dCRUJoVzdrTU9tdkxwaGhFTFVJOVh2UUQwWnp5QjY3WldjRnF5MS1SVUFrcWpVcGU4Mmw4UUdRTE0tVXEzc09FTG93cndhd1ZrcjdYREt5QXJtQVlpSUF6UnRmX2dROGdtNHNPZDd0SE5pYWpUd2NteTFWWDJUd0s5NGVoaEhndnNFQUJVeVoyVVU3TG1uNTE0ZDZTTTBSOTB1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Hayden Adams: From Ethereum Idealist to Business Realist at Uniswap - CoinDesk",
        "content": "Uniswap Labs has accrued something in the order of $1.5 million in trading fees since flipping that switch on this October, which will help fund ongoing development efforts. This is separate from the protocol fee, which can be turned on in an independent vote among holders of UNI — a protocol token distributed in 2020 in one of the earliest experiments in distributed governance — the could accrue to holders of UNI, but which governance has never voted to turn on."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPUGNhYjQ0THg2MEJkVVM1UkxGYV8tTWxvZnN5WGdOV0t4eTBwVmt1RXpfSGFrcW5VTHJJZUlRR1lCVkgtS09CUEZjajNjdHd2NWhDalVUbHN3Yl9GWkhWX2lwMHNHbk11MHBRdTlMT0YwQUJLR0JHUmY0VlpZanNuR09kdzJWLXFxcFFCSndyVTBnaENtUC16YXpMam4zWnlYZU1paHRBd05IZXh3ZEHSAbMBQVVfeXFMT3M5eGQxbFVxMVNyNXBrcV9qZGRjOXRleWhCWDlOc2tscTd6R3dNaG0wcTkwSDZLM29majQxa0NFSDBNS1JwN2s4VTN4dnJmN1pSN1Y5RjQyTVdJQ0dGak0wYnJBeXF4bndMbXFxMVRDZDJNVURxS1pUd3h3VWo5TUdORWhjTVVRUjBIamRCV255eTJQY25Pb2tUSi1vVnEzdGFlaVlUZW5WNHUtUmVZc0h5bWs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Institutional Traders Split Between Bitcoin, Ether: Bybit Research - CoinDesk",
        "content": "During the first three quarters of 2023, institutional traders nearly doubled their holdings of bitcoin (BTC). As of Setpember, half their assets were denominated in the largest cryptocurrency, driven by positive market sentiment and anticipation of the Securities and Exchange Commission (SEC) approving a spot BTC exchange-traded fund (ETF) in the U.S. Their stance contrasts with the lower BTC holdings of retail traders, possibly due to their higher leverage levels, Bybit's research shows."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPX2pLWWdsWmprVzVQVTVLTGtFclJHcm5DWngyNG9yR3NEdV9IOFR0eGtaSVlqRlMyZjljUnNROU4xSjJRUVZkS2xqOHU1ZW51ODh0aGlFcTlXa1dRU3RlVWw2Y0cxWVhjNUhSU2g3bGx0RjVwUmNVV2d0MlpoUnBNRUNLS1hlNFJrbWVxLdIBlAFBVV95cUxNNFJVUU43cTBJNnpETUVSMWQ2aXcxazN1U0xBdWpOeF95WXRRbE13NmxqRXRENTQxc293SHRqSlYyUGs1WE1oWUhTRGVJbG13eWtOZ202aXBybjlQY0lHOExDbjA5bVJDTkNYbkk4YV95c1VpZEc1LVpQRktwN25uVGVOTkxsa3V5TEFaT1F0TXNOMTM0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Notorious B.I.G. Immortalized in Ethereum Metaverse Game The Sandbox - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThere’s now a Notorious B.I.G. experience in The Sandbox metaverse, thanks to a collaboration between the game, the late rapper’s label Warner Music Group, and his estate, the metaverse platform announced Monday.\n\nThe Brooklyn, New York-inspired area in The Sandbox pays homage to the late rapper, born Christoper Wallace, who rose to fame in the 1990s before his death in 1997. The Sandbox B.I.G. experience, dubbed “Breakin’ B.I.G.,” allows players to meet the rapper’s non-playable avatar likeness in a “2D, arcade-style world” and navigate various quests as an up-and-coming rap star, according to the announcement.\n\nQuests include tasks like helping out around the virtual Brooklyn community and confronting B.I.G.’s rivals in The Sandbox, to name a few.\n\n“No artist represents the style of the 90s more than Biggie,” said Notorious B.I.G. Estate Chief Strategy Officer Elliot Osagie, in a statement.\n\nAD\n\nAD\n\n🎤 @thenotoriousbig enters The Sandbox! 👑 Celebrate the rap legend with 1,500 unique avatars. Join the allowlist for The Big Poppa Collection - inspired by Biggie's iconic style and legacy 💎 Starts Dec 5 pic.twitter.com/DhUu2B7TlI — The Sandbox (@TheSandboxGame) December 4, 2023\n\n“By bringing the appeal of the 90s style side-scrolling game, starring Biggie's music, to an innovative Web3 platform, we are ensuring that the world he built will continue to be enjoyed by day-one fans and discovered by today’s new generation of fans in fresh innovative ways that remain authentic to Biggie's brand and goals as an artist,” Osagie added.\n\nIn addition to the B.I.G. Sandbox experience, a new NFT avatar collection will be released as well as an update to Warner Music Group’s social hub, per the announcement.\n\n“I’m excited for our players to explore a rich Brooklyn environment with an arcade-inspired feel unlike anything we’ve done before,” The Sandbox COO and Co-Founder Sebastien Borget said in a statement. “Fans will interact with Biggie in entirely new ways as they immerse themselves in a throwback 90s adventure.”\n\nAD\n\nAD\n\nNotorious B.I.G.’s likeness joins celebrities like Elvis Presley, Snoop Dogg, Paris Hilton, Deadmau5, and Steve Aoki, all of whom have either built experiences or added their likenesses to the voxel-style game. Last year, Biggie’s estate released NFTs inspired by the iconic rapper and previously announced another Biggie-inspired metaverse world called The Brook.\n\nWhile The Sandbox has also launched collaborations with big brands spanning from Gucci to McDonalds, Warner Music has continued its push into blockchain integrations this year. Warner has planned branded character skins with Ready Player Me and is also working with Polygon Labs to launch a blockchain music accelerator.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNMGVUN0FJUnNYaGo2Tm5Dcl8yOW5xLWVMaDZGTUIwMmRRZjlSdmRsN0JXRnZweTN6VU1XNUVxUll3eFpCV3l6UzZIbGNEeENKZkFUQm9ob0UzTDhKaXQ5WDFjSzE0S1JycXpsREhwZG9zUjM3QzdQV2dBNWRmclBqdmZObGVDbXMtVVBIUGNNdlR4QWNUemx6S2t30gGfAUFVX3lxTFA5cXJHdGhVdHhoRjk0X1g1WXBWdGQ5bFZrcmRibzZUOW5hNzl4N3g3OGI2VmgxeE9VOWR3X3VJNFc1dGg0UFRHZER0Y3dNOVNSSHhnUmxlTEpmQmJPTTJXUDhIRmR5ZDhWRG9UZThodWd2aFFKZEpEV2F0TWtoQVZyeDdGd2JWR2s3QVJpb0tLYm40VDRYNmNyNWdUUG1QQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Dec 2023 08:00:00 GMT",
        "title": "Cardano Not Listed in Top of Chains More Decentralized Than Ethereum: Here's Why - U.Today",
        "content": "The quest to quantify blockchain decentralization has led to various metrics, with the Nakamoto Coefficient being one of the prominent measures. However, in the recent listings of blockchains by their degree of decentralization, Cardano was notably absent from the top ranks, a position that has sparked curiosity and debate within the crypto community.\n\nAdvertisement\n\nCardano is often distinguished from Ethereum Virtual Machine (EVM)-based chains due to its unique network structure and operational mechanics. Unlike Ethereum, which runs on the EVM, allowing for interoperability and similar structures across various networks, Cardano employs a different approach with its Ouroboros consensus algorithm.\n\nOuroboros is a proof-of-stake (PoS) protocol, but it diverges from the standard PoS mechanisms. It is designed to achieve consensus in a more energy-efficient and scalable way. This dedication to a scientific philosophy in its protocol development sets Cardano apart, which may contribute to why it is often considered separately from other EVM-compatible chains.\n\nAdvertisement\n\nThe distinctiveness of Cardano's architecture is complemented by its layered structure. The settlement layer (Cardano SL) and the computation layer (Cardano CL) operate independently, which differentiates its operational functions from those of other blockchains where these layers are typically intertwined.\n\nCardano's network also emphasizes a community-driven approach to governance and development. The project's catalyst funds and the Voltaire phase, which aims to introduce a fully decentralized decision-making process, are testaments to its commitment to a high degree of decentralization, albeit not necessarily captured by the Nakamoto Coefficient.\n\nFurthermore, Cardano's method of staking and block production involves a randomized process for electing slot leaders, which is different from Ethereum's process. This adds another layer of complexity when comparing the two networks based on the number of entities that can collectively shut down or control the network, as the Nakamoto Coefficient attempts to measure."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQeWJncVdXaDFUZ2ZuLXhQMS1JdGRDNHQ3RXY0N0tRYVRrT1l2blRWY2hsRUpKWHRhYUtGcWYxNXF0TW5kcjU5ZXBFTGlsdjJtZk5rcmItR2RrOFZsMG5PUFFfWUNIXzRnUGV0MkQ3TVdTc21QUFBnVlVkVE42Znc1U2sydFY2ODBwSEZjNjJNU080eDd5U3lKeUlJbEpGOUtVdmRZVUgzR2FPZmRYNTc3YkpOYUc5d9IBuwFBVV95cUxPQ1FPa0xLY0w4dG9MQXBOT3IwNUdWaXJDbVg1ay12MHdyaFJzNC1DOFh5Q2R4bmtHTDRDNklLdFpZSFVvNWZSZndBMEVyTDIyUTdTWUZjSkQxV3VQeHkySWxxUHNhMmNaSmlFcmNJQVZqODVxVnRBZVFONElWQ3JlYkFBS0R6QXpZeGw1dW5WMGN2MmozUXVFejZtYUtqTnJpNW5aOVBzak9XcVhqcXVOQ0hzVTF0NlNpS3pB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Mantle Releases Liquid Staking Protocol, Expanding Beyond Layer-2 Operator - CoinDesk",
        "content": "Mantle LSP was deployed on Ethereum, and this will be the second core product of the Mantle ecosystem, according to a press release seen by CoinDesk. The main Mantle Network, launched in July, currently has more than $220 million of deposits known as total value locked or TVL, according to L2 Beat."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNUzF5N2RFVUV6dkg1NUVlQmZTZ0NCSkRiblJCSEkzS2UxTkRFSVZrcV9EV2Y2bzB1S3JmekQwODRtOGZBclZxTGhNRmc5ZjlGOWljWkVESWRQSEpLZ3VFc09lUnNXcmo2U2tHT0F4Mzhua1hGNkttWHVhU1YtdTY1UzRSSTc2Mms4NXJqaDV2X01Rd0XSAZgBQVVfeXFMTmJFZU5rWXp0NXVxNk8yck5sbHMwZ0V3VDdoRFRVYkJVOEV0ODZwamMyNU9zdXdmMTAwTGtuZURtLWtiX1U1a2ZzTFI4aDIwc2ZtbFhFdWJISTZnUzBvNS1ELWRTQ01hVzhveVRsTWdRaVpVZmt4YWVibG5LTnV6SDVJdlJxY2drS1M0amRtaVRrZUJSNXg1VzE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Dec 2023 08:00:00 GMT",
        "title": "Can Ethereum Price Recovery Surpass $3000 By Year End? - CoinGape",
        "content": "For the major period of November, the Ethereum (ETH) coin witnessed high volatility leading to a sideways trend between the $2,143 and $1,910 price levels. However, this consolidation came after a significant rally indicating the buyers could have an opportunity to recuperate the bullish momentum after the further rally. Thus, a recent breakout from the range barrier sets the ETH price to further rally.\n\nAlso Read: Bitcoin & Ethereum Options Data Indicates Roadblock Ahead\n\nadvertisement\n\nWill ETH Price Hit $3000?\n\nA bullish breakout from the wedge pattern would set a directional uptrend\n\nThe rising price could face intense supply around $2250.\n\nThe intraday trading volume in Ether is $10.2 Billion, indicating a 78% gain.\n\nCoinciding with the Bitcoin price ascent over the $38,000 mark, a renewed sense of optimism has begun to permeate the crypto market. Responding to this positive shift, the ETH price rebounded from the psychologically significant $2,000 mark, registering a 7.8% weekly increase to its current trading price of $2,153.\n\nDuring this rally, the Ethereum price surpassed the immediate resistance of $2,133, suggesting that buyers are poised to drive the price even higher. Despite a modest intraday loss of 0.5%, a retest of this breached resistance could confirm its role as a new support level, underpinning the buyer’s ability to sustain higher price levels.\n\nHowever, with only a 3.5% increase, the ETH price is approaching a significant resistance level formed by the wedge pattern. Historical trends indicate that this trendline has often led to increased selling pressure and notable price declines.\n\nTherefore, a conclusive breakout above this barrier is crucial for confirming a more robust uptrend. Should the Ethereum price successfully navigate this challenge, its price could potentially soar by 50%, reaching around $3,400.\n\nBTC vs ETH Performance\n\nLong-term comparative analysis between Bitcoin and Ethereum reveals that both cryptocurrencies gained considerable momentum since mid-October. However, the Bitcoin price has demonstrated a more substantial recovery, characterized by a consistent pattern of higher highs and lows. On the other hand, the ETH price has faced some challenges, particularly noticeable supply pressure around the $2,200 mark.\n\nBollinger band: The uptick in the Bollinger band indicator reflects that buyers are aggressive and ready to buy ETH at a higher price.\n\nMoving Average Convergence Divergence: a bullish crossover between the MACD (blue) and signal(orange) line, accentuates a recovery sentiment return in this asset.\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE5tMEhzUlVXZk9ibEsyd0RZZC1MNlZCeUlVZnZvUXFlbXFIakVkcUU4WGJWanE5YkRsUlNKVVN2YkdCZmRqOWhZTTdhQjFZd3ZrRXN5YWlfbVhiaVl1SWVZU1h6Umt3RmVlcHMzbU5B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Mantle offers ‘mETH’ to the masses, as a ‘lighter weight Lido’ - Blockworks",
        "content": "After nine months in development, Ethereum layer-2 network Mantle has launched its second core product, Mantle Liquid Staking Protocol (LSP).\n\nThis new protocol, deployed on Mantle and Ethereum mainnet, introduces a non-custodial and permissionless ether liquid staking solution, Mantle Staked Ether (mETH).\n\nMETH acts as a value-accumulating receipt token within the Mantle LSP, very similar to Lido’s staked ether (stETH). Mantle aims to achieve the highest sustainable core yield by exploring maximal extractable value. It also shares yield from the Mantle treasury, according to a statement released Monday.\n\nThe idea for mETH came from Mantle “alchemist” Jordi Alexander, chief information officer at Selini Capital.\n\n“We’ve just created a lighter weight, more modern Lido,” Alexander told Blockworks. He champions the idea of offering a native staking yield on an Ethereum layer-2. The premise is “we should do all of DeFi, but first start by having the 5% yield,” he explained.\n\nThis is the same promise of the planned Blast layer-2, which has attracted deposits of ether (ETH) and stablecoins now topping $750 million over the past two weeks.\n\nBlast, despite its rapid growth and ambitious plans, faces scrutiny over its security model and the centralization concerns related to its reliance on Lido.\n\nRead more: Did Lido fly too close to the sun? Inside the centralization debate\n\n“Kudos to the Blast team because it’s the same idea that I had but just a very different implementation,” said Alexander, who has been advising Mantle since March and serves on investment and treasury committees.\n\n“I was pretty excited [when Blast launched] because they’re educating the market on this idea” of having native staking yield available for DeFi on a layer-2, he said.\n\nThe Mantle LSP development process represents a more traditional, structured approach with a focus on security and integration within its ecosystem.\n\nThe team decided to build a solution from scratch, but also talked to Lido about the idea of white labeling their infrastructure.\n\n“We talked to everybody — we literally went through every single [liquid staking team] out there — including Lido of course — we had multiple chats with them to decide [if] there [is] a way that we can take the easy way out,” Alexander said, adding “we decided to go the hard route, and it’s taken many months to do it properly and get all the audits and everything.”\n\nThe various components of the Mantle LSP have been audited by Hexens, MixBytes, Secure3 and Verilog, and the contract upgradeability is the responsibility of the Mantle Security Council, a 6 of 12 multisig, which is also used for maintenance of the Mantle Network itself.\n\n“If you trust Mantle, it’s the same security,” Alexander said.\n\nUnlike Blast, Mantle LSP doesn’t force anyone to stake or bridge. METH will work just fine on Ethereum mainnet and Alexander stressed that it is an independent product from the Mantle Network.\n\n“There’s some people that just want to stay on [Ethereum] mainnet and we do want to cater to them as well,” but, he adds, “I expect that most of it eventually will get incentivized to move because we’ll make it really juicy to ship it over.”\n\nThese incentives can be seen as a vampire attack on Lido, which Alexander says should appeal to members of the Ethereum community concerned over excessive Lido centralization.\n\nWhat’s cooking in “the mETH lab”?\n\nThe Mantle team has a number of ideas in the works to expand upon the LSP’s use within its network, which will be proposed to holders of the MNT governance token in the coming weeks.\n\nMNT is also used to pay transaction fees on the Mantle Network.\n\nAlexander originally considered mETH as a good candidate for the Mantle gas token — “like a self-replenishing gas,” he said — but ultimately Mantle’s mainnet launch schedule led to the introduction of MNT.\n\nThe team might consider a dual gas token model, make use of account abstraction to reduce user friction, or outline other new utilities for MNT.\n\n“I think we’re going to have it be sort of like ATOM where you get airdrops and it’s kind of like a launch pool token,” Alexander said, referring to the native asset of the Cosmos Hub.\n\nHe agrees with the critique that Ethereum has too many layer-2 networks proliferating, suggesting that most lack a creative new idea.\n\n“Is there something unique or some imagination that’s gone into it instead of just deploying a tenth version of Aave and just doing the same USDT pair or whatever?” he asked rhetorically.\n\nAnd as for the name and its natural association with illicit drugs?\n\n“We’re going to try to just lean into it. I’m going to launch an unofficial meme contest on my Twitter.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE41QkVuQlRMZDFRUTZIbXVJWkFVMm5iV0djcV9XaEJ3cWVWYWF3SjBpdVpoTTg5cHE0S1IzYmR6ZVlfS3BTMHZ3T3hzTl9DY2I4Q1JfLV9BUkxKemZLekV3VHN0eWw1Z1dKYTEwaXJveWM4WHZ2N2hta1ptY9IBgAFBVV95cUxPN2FOWnc4YW1HZkJQR2RKVEFQTnhCbjA5aVRxOTNQbFc4NHFIQVhIRlNDdmdPTHlQeG44WHBSX3lRVS00c3pKUmZ3VlFKemZsVl9WTko1ZENLUWFTV3d3al9MVlVXVjUxOWthRXY3cGc0cndIeVBWX3ZaZDZFTFB3Tg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Dec 2023 08:00:00 GMT",
        "title": "Solana Founder Warns Against “ETH Killer” Narrative - CoinGape",
        "content": "Solana founder Anatoly Yakovenko made a post on the X app warning the public about sparking a cold war between Ethereum (ETH) and other protocols including Solana (SOL) which are generally referred to as ‘ETH Killer”\n\nSOL and ETH Can Co-Exist\n\nIn Yakovenko’s opinion, pushing such narratives against Ethereum is lame as it harms the ecosystem. He suggested that protocols could coexist without challenges or threats of killing each other.\n\nadvertisement\n\n“Pareto efficient technologies can have overlapping features and will compete, but that’s all ok. I don’t see a future where solana thrives and somehow eth dies,” the Solana co-founder said.\n\nDon’t bring back last cycle “eth killer” bs. It’s lame. Pareto efficient technologies can have overlapping features and will compete, but that’s all ok. I don’t see a future where solana thrives and somehow eth dies. I am such a techno optimist that I am certain that… — toly 🇺🇸 (@aeyakovenko) December 2, 2023\n\nFurthermore, Anatoly expressed positivity in a future where “Danksharding,” a technology that allows blockchain technology to add cheaper blocks, will have enough bandwidth that accommodate all of Solana’s data. To put it in perspective, danksharding is an Ethereum rollup scaling method where transactional throughput is expanded through the provision of additional storage space for roll-up transactions.\n\nYakovenko’s statement on Ethereum underscores the fact that SOL and ETH can coexist and even overlap without any inconveniences.\n\nSolana Founder Douses ETH Rivalry Push\n\nDespite the growing industry eulogy for Solana, Yakovenko has warned the community members against instigating unhealthy rivalry with the Ethereum protocol.\n\nThis was when MakerDAO Co-founder and CEO Rune Christensen announced plans to fork the protocol’s NewChain on the Solana blockchain, away from Ethereum. The news sparked some reactions from Solana proponents who saw the transition as a battle of the best.\n\nYakovenko immediately pointed out that it was a general win for open source. “I really hope that people in the Solana community don’t use this as some cudgel to attack Ethereum,” he said at the time.\n\nIn October, one Ethereum community member identified as jebus.eth tried to take a jab at Solana by referring to it as a “Coallition of poors and wealthy ppl who don’t understand where value actually comes from or how to create it, just that the things I want should be cheap.”\n\nHowever, the Solana co-founder was quick to respond to him, emphasizing the fact that his protocol is a pursuit of an entirely stateless digital realm, where unhindered communication and transactions flow freely among the people, liberated from the control of capitalist middlemen and government surveillance.\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxON0duaWJic05YYVdjVnJSejdKNUZKa0wteE44bHZiNXR2TG13SF9vTWJ1N095Y19rMERDLXY0RG1EVE9OdE9UQjVZS2xsM2dMazVTTE5ILXhEbDV5U2tIRXRob3QxRVdiRGZkMHlkbE5veklkOVRhRThTNjJBZEZKTDE5OElqeXNjd3YxVWJjTDJJa1lFcHdUQzR5aE9PNVhmTF9FNzY5N0ZHZDU4d2N2am5Va0tMZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Mantle introduces mETH liquid staking protocol, expanding its Ethereum-based DeFi ecosystem - CryptoSlate",
        "content": "Mantle, the DAO-led web3 ecosystem, today unveiled its Mantle Liquid Staking Protocol (LSP) as a key addition to the Mantle Ecosystem, offering users a novel way to engage with Ethereum’s proof-of-stake (PoS) validator network, according to a statement shared with CryptoSlate.\n\nThe Mantle LSP is a permissionless and non-custodial Ethereum (ETH) liquid staking protocol, functioning on Ethereum L1 and governed by Mantle. It stands as the second core product of the Mantle Ecosystem, following the Mantle Network L2. Mantle posits that the introduction of Mantle Staked Ether (mETH), a value-accumulating receipt token, is a pivotal step in their protocol.\n\nMantle detailed that the genesis of Mantle LSP began with a proposal in a Mantle forum on July 14, 2023. Following the acceptance of the Mantle Governance Proposal MIP-25, the staking of Mantle Treasury ETH was sanctioned, leading to the phased deployment of Mantle LSP. This process culminated in the protocol’s full operational launch on Dec. 4, transitioning it into a Permissionless Mode.\n\nMantle LSP distinguishes itself by offering instant and sustainable rewards. Users staking ETH receive mETH, a token embodying their staked value and accumulated rewards, while also unlocking additional yield opportunities within the Mantle Ecosystem. Mantle states that the ETH to mETH exchange rate is deterministically calculated, thus mitigating the impact of stake size on slippage. Furthermore, mETH is available for trade on various exchanges, with its pricing governed by market dynamics.\n\nMantle emphasizes that their protocol underscores a commitment to user experience, security, and yield optimization. Mantle states its LSP features a streamlined architecture, focusing on the ETH to mETH conversion process on L1, and avoids complexities associated with other PoS tokens and chains. The protocol’s design incorporates robust risk management strategies, including non-custodial core smart contracts and off-chain services that impose strict risk limits. Additionally, Mantle LSP’s security framework involves dividing responsibilities among various roles, ensuring the safeguarding of staked ETH within smart contract addresses.\n\nWith the launch of Mantle LSP, Mantle intends to enhance its DeFi offerings by exploring the adoption of mETH across various applications within its ecosystem and beyond. This expansion aims to bolster the utility and efficiency of mETH, contributing significantly to Mantle’s growth in the DeFi space.\n\nThe broader Mantle ecosystem, anchored in Ethereum technology, now includes the Mantle Network, an Ethereum layer 2 (L2) solution, Mantle Governance, a decentralized autonomous organization (DAO), and Mantle Treasury, one of the largest on-chain treasuries. The ecosystem is facilitated by the Mantle token (MNT), which serves as a product and governance token.\n\nMentioned in this article"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE94anY4VDRadHdjbjEzMFBObC1GVHlMS1pBNlBEZVlTbEFXTkRMdFU5eWZPd1ZYZWFuaHQtaWZuNHdTVFdFc0w4dnl6NVFLMjlpbkJIZF9ub3NVMWlSZ2czUDVOZUNVQmdMejJIYWt1X3k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Dec 2023 08:00:00 GMT",
        "title": "Top cryptos to watch this week: BTC, ETH, TIA - crypto.news",
        "content": "This week, the global cryptocurrency market cap soared 5% to $1.49 trillion, marking its highest point since the Terra-induced collapse of last May. Several assets — Bitcoin (BTC), Ethereum (ETH) and Celestia (TIA) — registered impressive gains.\n\nBitcoin nears $40,000\n\nBitcoin has been on a rampage since breaking out of the consolidation in early October. The premier crypto has continued to register impressive bullish closes, and this week was no different. With a 5.41% increase over the past seven days, Bitcoin is on track to record its seventh consecutive bullish week.\n\nBTC price – Dec. 3 | Source: Trading View\n\nThis streak of bullish closes began in mid-October when the asset changed hands at the $27,000 territory. Amid increased optimism from sustained ETF discussions, Bitcoin has extended the wins to seven straight weeks.\n\nThis week was less challenging than most, as BTC only registered two days of mild intraday declines. These declines came up on Nov. 27 (0.56%) and Nov. 30 (0.37%). Other days recorded bullish gains, but Dec. 1 stood out, as BTC surged 2.54%, marking its highest intraday gain for the week.\n\nThis Dec. 1 rally brought BTC the closest to the $39,000 territory in 17 months. The asset spiked to $38,983 but witnessed bearish resistance. BTC showed resilience, closing Dec. 1 at $38,688 to have another go at $39,000 the following day.\n\nThis second push was successful, helping Bitcoin reclaim $39,000 for the first time since the Terra implosion of last May. Bitcoin has built on this rally, changing hands at $39,489 at the reporting time, with the $40,000 price threshold its next target.\n\nYou might also like: Hong Kong, Singapore attract increasing crypto VC funding\n\nEthereum hits 17-month high\n\nBitcoin’s uptrend favorably impacted Ethereum’s price, as both assets maintained their close correlation this week. Ethereum started the week with mixed signals, dropping 1.71% on Nov. 27, but rising 0.99% the next day. Nov. 29 also brought another decline, with a 0.90% slide.\n\nETH price – Dec. 3 | Source: Trading View\n\nHowever, Ethereum’s bullish story began on Nov. 30 despite BTC’s 0.37% drop. ETH rallied 1.12% that day, extending this bullish run to the new month. The asset gained 1.72% on Dec. 1, with its largest intraday gain amounting to a 3.75% surge on Dec. 2.\n\nThe Dec. 2 rally was Ethereum’s major boost this week, as the asset leveraged it to hit a 17-month high of $2,184. Despite facing a roadblock at this new yearly peak, the bulls retained their hold, keeping Ethereum above $2,100 at the close of day. Currently trading for $2,164, ETH is up 4.97% this week.\n\nCelestia clinches new ATH in 60% weekly gain\n\nCelestia was not left out in the market-wide uptrend this week. While Bitcoin and Ethereum flashed mixed signals at the start of the week, TIA went full-on bullish, surging 8.17% on Nov. 27 and 6.06% on Nov. 28. The following day was not very favorable, leading to a 3.53% decline.\n\nTIA price – Dec. 3 | Source: Trading View\n\nHowever, these drops did nothing to negate the ongoing uptrend. Celestia rallied by a massive 42% from Nov. 30 to Dec. 2, recording three consecutive days of bullish momentum. Amid this momentum, TIA began recording new all-time highs on Dec. 2. The asset’s latest ATH was $9.31 today.\n\nCelestia’s massive uptrend put it among the top gainers over the past seven days. The asset is up 61% this week, securing third among the largest gainers. Celestia is facing a 0.48% drop today, but the asset has held up well above $8.5, currently changing hands at $8.81."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPS3FFaFFJRnJIVEFQOHJveGF5YXlzQzY0LThnTThSdDZUZUtLd1RmTVlYdjBUbVZBM2cwa0k2UzNtUEN2cUkzVkJ2WTd1Vk5oaDZOU2ZnbVp1LUltbDMtOXNKdnFLOElUOUM4b09HVXhXRDUyUWtMWXlxbGdYUFJKajN1c0NvZUtHRWFkVEdpNHFqMmhYN0RhZkZmOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Spain detains aristocrat who allegedly recruited Ethereum developer Virgil Griffith to help North Korea - DLNews",
        "content": "Spanish officials detained Alejandro Cao de Benos, a Spanish aristocrat.\n\nHe allegedly enlisted Ethereum researcher Virgil Griffith to help North Korea evade sanctions.\n\nSpanish officials detained on Thursday a pro-North Korea political activist aristocrat accused of aiding North Korea in circumventing international sanctions through crypto, according to a statement by the Spanish police.\n\nAlejandro Cao de Benos, the founder of advocacy group Korea Friendship Association, was indicted last year by US authorities for allegedly recruiting Ethereum researcher Virgil Griffith to unlawfully provide crypto services to North Korea.\n\n“Such accusations are totally false. There is not a single piece of evidence that proves that I hired or solicited the services of Virgil Griffith,” Cao de Benos said in a public statement posted Sunday on X.\n\nThe police said investigation for his location began in mid-October, when the agents received a tipoff from Interpol indicating that Cao de Benos could be in Spain.\n\nCao de Benos was released after a one-day detention.\n\n“It is a disgrace that the US empire abuses Interpol and Spain to carry out what is purely political persecution,” he said.\n\nEthereum researcher Virgil Griffith\n\nGriffith, a former Ethereum Foundation researcher, was arrested in 2019 after a trip to North Korea to allegedly consult the regime on how to use crypto to evade international sanctions.\n\nHis keynote speech at the Pyongyang conference allegedly contained information on how to bypass sanctions, according to the US Department of Justice.\n\nJoin the community to get our latest stories and updates\n\nBut Griffith’s advocates and his legal team have argued that the presentation did no more than recapitulate widely available information, which could be readily accessed online.\n\nGriffith’s lawyer said that the trip was “the culmination of Virgil’s unique and unfortunate curiosity and obsession with North Korea.”\n\nHe received a 63-month prison sentence last year after pleading guilty to a charge of conspiring to violate the International Emergency Economic Powers Act. The act forbids US citizens from exporting goods, services, or technology to North Korea without a licence from the Treasury’s Office of Foreign Assets Control.\n\nHis lawyer told the Wall Street Journal that Griffith was “sincerely remorseful.”\n\nChristopher Emms dodges the bullet\n\nBritish national Christopher Emms was also charged last year, alongside Cao de Benos, with the conspiracy to help North Korea access crypto. He had attended the same conference as Griffith.\n\nIn June, Emms said he received political asylum in Russia.\n\nAppearing on Russian state media RT yesterday, Emms called Cao de Benos’ detention “politically motivated” and said the “US government doesn’t like when someone stands up to them.”\n\nEmms told Blockworks last year that Cao de Benos contacted him through LinkedIn and invited him to the conference in Pyongyang.\n\n“I did the typical crypto bro thing: I googled it. I checked the Foreign Office website as a UK citizen. I checked the UN website and I didn’t see that speaking at a conference in North Korea was breaking any laws,” Emms said.\n\nThe North Korea trip was “incredibly naive,” Emms said, but “the way we [the crypto industry] approached things was so different than we would right now. There was a lack of clarity on so many things.”\n\nCrypto: North Korea’s ‘treasure sword’\n\nNorth Korea calls crypto its “treasure sword,” according to David Maxwell, senior fellow at the think tank Foundation for the Defense of Democracies, who spoke with DL News in April.\n\nNorth Korea’s crypto arm known as Lazarus Group has stolen at least $3.4 billion in crypto since emerging in 2007, according to calculations by DL News.\n\n“All the money [the North Korean hackers] cash out goes to fund their missile programme,” Erin Plante, vice-president of investigations at Chainalysis, told DL News in April. A report by Recorded Future last week said that North Korea loots enough crypto to fund almost half of its military budget.\n\nLast year, Lazarus hacked a record a $625 million in crypto, raiding the web3 game Axie Infinity.\n\nThat attack, said Plante, was “a turning-point event where suddenly the US National Security Council cared and wanted to hear about it.”"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQVVNPR3Bsd1pxajRGbmVaZ0hzRlFpZ2k0ZmZEd1oxTDV3Y0c4NHRtVTRhRXd3WXFUS1gzc29wM2dEVFpER25WQjhvUXRwVUJiQ3JkNVVCQnhKeFdHSG1XWWJpVG95XzFFWkR6NXFOaWsyZnZqWkdhWUZ3cUt5Z2EtT29EWVRNTV96NTdRVGtoZW1SeEI4UEhrYThxSFpFR2xtYXkycFhFTWhLRFl4Q0ZYMUFlMnZuaGRa?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "How a Photographer Missed Out on $8 Million for This Portrait of a Crypto Billionaire - PetaPixel",
        "content": "Being a freelance photographer is not easy. Chasing invoices, dealing with late payments, the list goes on, but very few have ever missed out on a payment of $8 million that was rightfully theirs.\n\nBut that’s what happened to photographer Andrew Miller after he took a portrait of Vitalik Buterin, who co-founded the cryptocurrency Ethereum and went on to become the world’s youngest crypto billionaire.\n\nLong before Russian-Canadian programmer Buterin made the Forbes rich list, Miller, a self-confessed gamer geek, had taken a keen interest in the enigmatic programmer and approached him with a portrait idea around the same time Buterin was launching Ethereum. Buterin agreed, but back then he was cash-strapped so one of his investors came up with the idea of paying Miller in the upcoming Ethereum currency.\n\nMiller paid for the shoot at his own expense — which included dinner, a photo assistant, and a makeup artist — and agreed to be paid in the initial coin offering so long as it was the equivalent of the $1,200 CAD ($886) that Miller deemed to be the value of his photo shoot.\n\nThis is Where it Gets Interesting\n\nMiller tells PetaPixel that he was supposed to have been paid for the copyright of the photo during the initial coin offering when the price of Etherum was $0.31, meaning the photographer ought to have received somewhere between 3,225 and 3,600 Ether. Today, 3,600 Ether is worth nearly $8 million (10.8 million CAD).\n\n“I said if they started using it commercially they could pay me in Ether at the initial coin offering amount. They agreed in principle and would investigate how to get the coins to me through their execution of the offering. It was still a new process for them and theoretical,” Miller says.\n\n“I met them in Vancouver two weeks later at the 2014 Coinfest and hung around for lunch and other gatherings. I queried them on how payment would play out and Anthony [an investor] set me up with a Bitcoin wallet to demonstrate how one would send coins back and forth,” he continues.\n\n“It was always my understanding that I would receive Ether at the initial coin offering. I just thought that in the end, they didn’t use the image commercially. Everything was not traditionally public and the Ethereum website was sparse for photos.”\n\nSuffice it to say, Miller never received the cryptocurrency and after losing contact with Buterin, he was oblivious that his photo had been disseminated commercially. It was being used in news articles, memes, fan art, and even being sold as knock-off NFTs with zero credit given to Miller.\n\nDespite numerous attempts to reach Buterin, Miller has not heard from the Ethereum co-founder and now says he is “trapped in a situation where there is no response from Vitalik or the Ethereum organization.”\n\n“My portraits appear to have been instrumental in shaping the positive perception of Vitalik and contributed in some small part to Ethereum’s rise,” Miller writes in an article for DIY Photography.\n\n“Today, I am battling to gain attribution and recognition after the portraits became famous, leaving my name unspoken. The history of what I did for Vitalik was untold, and anyone looking back can see its value given the timing and what transpired afterwards. Any joy I took in seeing my photos fulfilling the role I originally intended was quelled when I learned that they had been used commercially by the Ethereum co-founders, who never fulfilled their end of the negotiation.”\n\nMiller stresses he has never issued an invoice, largely because if he does, Canadian law requires him to declare it as income immediately and pay income and sales tax on it regardless whether he’s received the payment or not.\n\nPetaPixel has reached out to Vitalik Buterin and Ethereum for comment but did not hear back ahead of publication.\n\nMore of Miller’s work can be found on his website and Instagram.\n\nImage credits: Photographs by Andrew Miller."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNNnpUMUNWRW1XY1VZQ3ZUS2JjUTVYU1d6bWltUlMyR3RYLW41WlBMNWkwQW9HZWVTbzc0aEpGSWhadWV6RnhpTE9NUlRoY0xGMmMwMFhCUlRiVTNGcDhFYXBfT29CRjVUZlprNVk3MDdTd004NEFablRIUlVvQV9ZaUZSOE5DSGlBcjh0dGJ4ZFkyaDNGcHo5Mk9zcFRibEJydzlmeEZlZG45UEtzT1V1ZmE4UVhSSW45UEh4VUJGSTBDQdIBxwFBVV95cUxOX0VERXo1LXNyQzVIVEhUcXo4U1Nxc3FQS2hTY045M1JNcnhLZ0VfUmRweGh6V2VpNllLQlEzZkVyS1E2U2VsUTNtUGtNbW1UZk1WTjFLbkhYR25zYUtnTmliTVV6Z2g2eVc4SjNidVVyMnZuc0kyazhiS3FOTzRtNGRMa2lZTzNvVlJNQm9YaE43WXNURndKQUdHbDFtYkNlakhMTFRnOVhoNmxYSGw3T05mSXhlSjNqNXMxSHVUVkI0dnRfZ1JV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Institutions Continue Heavy Allocation to Crypto As Bitcoin (BTC) Hits $42,000 Mark: CoinShares - The Daily Hodl",
        "content": "Digital assets manager CoinShares finds that blue–chip investors continue to allocate to Bitcoin (BTC) and crypto investment products as markets surge.\n\nIn its latest fund flows report, CoinShares says that institutions poured asset $176 million into crypto markets last week, reaching a 10-week total of $1.76 billion.\n\n“Digital asset investment products saw inflows totaling $176 million last week, marking the 10th consecutive week of inflows, totaling $1.76 billion, or 4% of assets under management (AUM). This run of inflows is now the largest since October 2021, which saw the launch of the futures-based ETF (exchange-traded fund) in the US.”\n\nAccording to CoinShares, the US, Germany, and Canada saw the most activity while BTC and the top smart contract platform Ethereum (ETH) were the two digital assets that saw the most inflows.\n\n“Regionally, the focus was Canada, Germany and the US, which saw inflows of $79 million, $57 million and $54 million, respectively. Minor outflows were seen from Hong Kong totaling $15 million…\n\nBitcoin was the main beneficiary, seeing $133 million inflows, although short, Bitcoin, after a 3-week run of outflows, saw inflows of $3.6 million last week.\n\nEthereum saw a further $31 million inflows last week, bringing this 5-week run to $134 million, and for the first time this year, net flows are now positive at $10 million, following a long bout of negative sentiment.”\n\nBitcoin is trading for $41,394 at time of writing, a 4.30% raise on the day while Ethereum is moving for $2,095.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE43QzVuVldfczBWOU9YUHBzcHFiLV94ZGJieTFORmpYNl95NWw3V2FIQW1wc21ZRzZESGxsQXlIRWJZWFV2bUZXTE5MeVdqd2J3WTZPR2lNbEVSOU5XdGZGWFZPajRzUnNRS0I5MHF2YUk5RVBfWXFOb2pmeHJxOGfSAYQBQVVfeXFMUFE3VUtNRW9GcEdZRi1IS0xsMUpRU2hfUFdZREpqejZNUmJXZi05YVhLZ0llc0taZmIwQ0Uwa25DOVE2cG9nQVF6Uk9LWTU0YkFsU0dKbmNpc1M1enVaMzdFMVVVLUtfZ3BrZnhfWjVCQmZsMDRUZVh4R2huY3F4R0FMZkR6?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Metaverse Game Immortalizes Rapper 'The Notorious B.I.G.' - Bitcoinist",
        "content": "In partnership with Warner Music Group and the late rapper’s estate, the Ethereum metaverse has formally embraced the legacy of Notorious B.I.G. with the opening of an exciting new experience.\n\nHip-hop enthusiasts will soon be able to play a unique video game experience thanks to the release of The Sandbox, a decentralized virtual gaming universe from Animoca Brands and Warner Music Group.\n\nThe Notorious B.I.G. Metaverse Legacy: 1990s Nostalgia, Interactive Adventures\n\n“Breakin’ B.I.G.” immerses players in a neighborhood where The Notorious B.I.G. is the dominant figure, paying homage to the side-scrolling video games of the 1990s.\n\nIn addition to the ethereum metaverse game, WMG intends to provide a set of avatars that users can access through The Sandbox. It’s the rapper’s most recent effort at a postmortem metaverse endeavor.\n\nPlayers can take part in a wide range of missions, such as assisting the online Brooklyn community or going up against avatars that stand in for B.I.G.’s competitors. This interactive element encourages participation and makes it easier for players to follow an engaging story.\n\nImage: Warner Music Group\n\nThe Notorious B.I.G. is considered to be one of the most revered hip-hop singers of all time, and Sebastien Borget, COO and co-founder of The Sandbox, expresses gratitude to be a part of his enduring legacy. They express gratitude for their collaboration with Warner Music Group with this statement.\n\nEthereum market cap currently at $265 billion on the daily chart: TradingView.com\n\n“I’m excited for our players to explore a rich Brooklyn environment with an arcade-inspired feel, unlike anything we’ve done before. Fans will interact with Biggie in entirely new ways as they immerse themselves in a throwback ‘90s adventure,” Borget said.\n\nEthereum And The Metaverse: Icons Join Biggie Smalls In Voxel Universe\n\nThe voxel-style ethereum metaverse game features the likenesses of luminaries including Steve Aoki, Elvis Presley, Snoop Dogg, Paris Hilton, and Notorious B.I.G. All of these individuals have either created experiences or contributed their likenesses to the game.\n\nThe estate of Biggie previously revealed The Brook, another Biggie-themed metaverse realm, and last year produced NFTs inspired by the legendary artist.\n\nImage: Animoca Brands\n\nWMG and Sueco announced a collaboration to develop The Sandbox’s first music-themed environment in 2022. The experience, “Split Personalities,” was one of the top three most popular on the platform that year. The Sandbox signed its first contract with a major music label with that arrangement.\n\nOne of the decentralized virtual worlds that has been driving the recent increase in demand for virtual real estate is The Sandbox. It has partnerships with major brands like Warner Music Group, Ubisoft, Tony Hawk, Gucci Vault, The Walking Dead, Snoop Dogg, Adidas, The Smurfs, and Atari, to mention a few.\n\nFeatured image from Michael Lavine"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxONVcxVHZPTnBpbEVFRlpMUWZKaFZHV1dpek9wNFRENWxCWkVGa0pQMHpKaURrVU93eFJQRXlYQkhMemtxVnZMdDJSYVQ2dDM1UzVDdGxoTkJYdXh1NDRnTWdqMXBjMDRGSlN3YmlKUktUMHBPcmY2aWZTMlNob0RucmZ1dmxTLVdtc3BIel9XNUhlb2x4RjlHcnh4R3ZReW1QYU1MZEM0YndiUXZueUFv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Cardano Founder Says Vitalik Buterin Has 18% Chance of a Prison Sentence - The Crypto Basic",
        "content": "Charles Hoskinson, the founder of the Cardano blockchain, has recently expressed that Vitalik Buterin, one of the founders of Ethereum, has an 18% chance of becoming a prisoner.\n\nHoskinson’s latest negative remark towards the Ethereum figure follows Buterin’s repeated appearance on a ranking of the most influential figures in the crypto community.\n\nVitalik Buterin’s 18% Chance Prison Sentence\n\nIn a recent tweet, CoinDesk disclosed that Vitalik Buterin has emerged four times since 2014 as the Most Influential crypto personality in its ranking. Buterin has appeared more times than other prominent personalities, such as Do Kwon of Terra Luna, Sam Bankman-Fried of FTX, Changpeng Zhao (CZ) of Binance, Gary Gensler of the U.S. SEC, Brian Armstrong of Coinbase, and Jack Dorsey of Twitter (now X).\n\n- Advertisement -\n\nBalaji Srinivasan, former Chief Technology Officer of Coinbase and the pseudonymous founder of Bitcoin, Satoshi Nakamoto, made three appearances on CoinDesk’s ranking. Aside from the two, all other crypto-based personalities have made just two appearances.\n\nGiven Vitalik Buterin’s repeated emergence, CoinDesk posted a question seeking opinions from the crypto community on whether Buterin would make the fifth appearance in the 2023 ranking.\n\nCharles Hoskinson weighed in on the conversation. However, instead of commenting on Vitalik Buterin’s influential status, he tilted the discussion in another direction. In particular, Hoskinson remarked:\n\n\n\n“Appearing on Coindesk’s most influential list carries an 18 percent chance of a prison sentence,” teasing it as some ‘fun fact.’\n\nFast Fact: appearing on Coindesk's most influential list carries an 18 percent chance of a prison sentence https://t.co/SdAOqcPOPQ — Charles Hoskinson (@IOHK_Charles) December 3, 2023\n\nNotably, the foundation of Hoskinson’s “18% chance of prison” is that of the 16 crypto personalities in the CoinDesk ranking, three have had devastating legal encounters with prison sentences in sight.\n\n- Advertisement -\n\nThree of 16 is 18.75%. Therefore, Hoskinson argued that each individual on CoinDesk’s personality rankings has an 18% chance of facing a prison sentence.\n\nCrypto Community Reacts\n\nMeanwhile, some crypto community members argued Hoskinson appears jealous because he has failed to feature in the ranks of the most influential crypto personalities. Crypto Youtuber Lex Blazer remarked:\n\n“I know CoinDesk is biased against you, but damn, not even once? How many blockchain features has Cardano pioneered at scale?”\n\nOthers contended that the Cardano founder was intentionally refusing to acknowledge that “Vitalik is the greatest of all time (GOAT).”\n\nIt is worth mentioning that Hoskinson and the Ethereum community have been at loggerheads, which all stemmed from Hoskinson’s removal from the Ethereum cycle years ago."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBUakx3THViSzVWV1o2c0EzY1JmZlNXYUZXSWVUa2dfc2lHeDlMdVpHcGVQdXNORndDemwtUW91RHpBa2RuRWNnZjdlUEZtaVBYcExTaWpqM1Q0QdIBX0FVX3lxTE9ObHE1bkNYdkVyTUxaUmp5cTFwd2w1ZXhDRWI5VzBIWDNVM0dOTklmWTNOWFROelhMdlgxNGFqVVloVlIyRXFqdjlyek9CcW9wMGlxbkRaWU82Um1Ic21R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Blur Captures 80% of Total NFT Trading Volume - NFT Plazas",
        "content": "Blur Captures 80% of Total NFT Trading Volume\n\nIn the ever-changing NFT realm, the Blur marketplace is surging ahead, claiming a whopping 80% of the total trading volume of non-fungible collectibles.\n\nDespite OpenSea once being the dominant player, the marketplace’s share has dwindled to 17%. Blur has been overriding OpenSea since February, which has led to Blur dominating nearly 80% of the Ethereum-based NFT landscape.\n\nWhile other marketplaces like LooksRare and X2Y2 exist in the NFT ecosystem, they garner just a minimal portion of the market’s monthly trading volume, especially when compared to the key influencers Blur and OpenSea, which continue to command the lion’s share of NFT trades.\n\nA Wider Look into NFT Market Growth\n\nNovember signified a remarkable milestone for NFTs, garnering $605 million in Ethereum trading — an increase of more than 100% when compares to the previous month. This momentum is continuing into December, with trading surpassing $90 million and Blur’s marketplace contributing approximately $70 million of this amount.\n\nAlongside Ethereum, Solana-based marketplaces also witnessed an increase in trading activity last month and into December. On November 30, the total trading volume on Solana markets hit $9.3 million — an amount not garnered since April last year. Notably, the majority of these transactions were made on the Tensor marketplace, with daily Solana-based trades reaching around $5 million.\n\nAcross numerous blockchains (Ethereum, Solana, etc.), NFT projects such as Pudgy Penguins, Milady Makers and Mad Lads are spearheading this current NFT market upswing. And the excitement doesn’t end there: ongoing developments in the NFT realm will continue to present intriguing journeys for both NFT novices and established players alike.\n\nWant more? Connect with NFT Plazas Join the Weekly Newsletter\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram *All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPR1p2U1d4RVdReFpsOTZBVVd4X0xQdzNyUVNWeEMzN0l4WjRILVBqRHF0YTduYzZoYXBzMzNOYWlRTEZyWmJ0WS1uRWFjVVVpdWVtajRPNUUyMVU3djA5Q1A4d0EwTkJfMFZRbEg4RWMzU2pTendfdGtSblRZN25jbWpPUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "What Is Sharding and How Does It Work? - Binance Academy",
        "content": "TL;DR\n\nSharding' splits a blockchain into smaller 'shards' to address the issue of scalability associated with Layer 1 networks.\n\nSharding improves transaction speeds, minimizes processing and storage costs, and enhances network performance.\n\nSharding comes with its potential drawbacks, such as network security concerns and complexity of cross-shard transactions.\n\nIntroduction\n\nBlockchain technology has introduced unprecedented potential in decentralization, transparency, and security. But it faces a significant challenge: scalability. Scalability is one point of the \"blockchain trilemma,\" which also includes security and decentralization. Achieving all three simultaneously is a persisting issue in the blockchain realm. This is where strategic solutions like \"sharding\" come into play.\n\nWhat Is Sharding?\n\nSharding is a concept borrowed from traditional database management. It refers to the process of splitting a larger database into smaller, more manageable parts, called shards. Its application in blockchain aims to improve scalability, whilst maintaining the principle of decentralization. In essence, sharding occurs when a blockchain network is divided into smaller parts known as shards, each capable of parallelly processing transactions and smart contracts.\n\nHow Does Sharding Work?\n\nUnderstanding how sharding is executed within a blockchain network requires a comprehension of how blockchain data is usually stored and processed. There are various ways data can be processed. We are going to look into sequential and parallel processing.\n\nTypically, each blockchain node is responsible for handling all of the transaction volume within the network. This type of data processing is commonly referred to as sequential processing. This implies that every node must maintain and store all critical information, such as account balances and transaction history. In essence, each node must process all network operations, data, and transactions.\n\nThough such a model bolsters the security of the blockchain by recording every transaction across all nodes, it dramatically slows down the processing of data. This is where parallel processing of data comes into play as it allows for multiple operations to be executed concurrently.\n\nSharding can be a potent solution to this predicament as it divides or 'partitions' the transactional workload across the blockchain network. This means that not all nodes need to manage or process the entirety of the blockchain's load.\n\nInstead, sharding segregates the workload through horizontal partitioning. In this process, the data is divided into horizontal subsets, with each shard acting as an independent database capable of processing transactions separately from the others.\n\nHorizontal vs. vertical partitioning\n\nHorizontal partitioning and vertical partitioning are two key approaches to database scaling. While both are designed to manage large data sets more effectively, they work in fundamentally different ways. Sharding is a common method of implementing horizontal partitioning.\n\nIn horizontal partitioning, the data is divided into rows and spread across different nodes (or databases), each containing a subset of the data. Each row in a table is a unique entity, so separating them doesn't lead to any loss of data integrity. A prominent example of horizontal partitioning in use is in the distribution of blockchain networks, such as Ethereum and Bitcoin.\n\nIn vertical partitioning, the data is divided into columns, rather than rows. Each partition in vertical partitioning contains a subset of data for each entity, or the entire dataset, but only for a certain set of attributes. For instance, consider a customer table with columns like Name, Status, Description, and Photo. In a vertical partitioning scenario, the 'Name' and 'Status' might be kept in one table, and 'Description' and 'Photo' in another.\n\nWhy is horizontal partitioning preferred?\n\nHorizontal partitioning is generally favored over vertical partitioning in blockchain networks for three key reasons: scalability, decentralization, and security.\n\nScalability: Sharding provides a solution by breaking the data into smaller, more manageable 'shards'. Each shard can operate independently, enabling more transactions to be processed simultaneously, improving network speed and efficiency. Whereas with vertical partitioning, distributing the columns across different databases might require more complexity in retrieving a complete transaction or block information and could limit the scalability.\n\nDecentralization: In keeping with the core ethos of blockchain, horizontal partitioning supports decentralization. When nodes only have to process a portion of the total data (a shard), it allows for more nodes to participate in the network since the computational and storage burdens are reduced. Vertical partitioning, comparatively, would restrict this as each node would need access to all partitions (all columns of data) to understand and verify the complete block data.\n\nSecurity and Data Integrity: Horizontal partitioning maintains data integrity because each shard (or partition) contains complete transaction data, ensuring that each node has a full, accurate copy of its portion of the blockchain. In vertical partitioning, you'd essentially be splitting up a block's data across different nodes, making it challenging to ensure data integrity and security, a paramount aspect of blockchain networks.\n\nWhat Are the Benefits of Sharding?\n\nLet’s delve into the potential benefits that sharding brings to blockchain technology:\n\nIncreased Transaction Speed: Sharding facilitates parallel processing of transactions. Instead of processing transactions one by one in a sequential manner, sharding allows transactions to be processed simultaneously but on different shards. Each shard works independently, thereby increasing transaction speed significantly. This not only expedites transaction speed, but it also means that the whole network can handle more users, promoting mass adoption.\n\nAn example of an existing blockchain network using shards to address scalability is Ziliqa. Ziliqa’s sharding mechanism allows it to achieve thousands of transactions per second.\n\nMinimized Processing and Storage Costs: The conventional blockchain design obliges every node to store all transactions, intensifying the demands on hardware as the blockchain grows. But with sharding, each node is responsible for processing and storing just a fraction of the entire network's data—this decreases the resources necessary for a node to participate in the network.\n\nAs such, more participants can join as validators, enhancing network decentralization without incurring prohibitive costs. It mitigates problems where only entities with high-end, expensive computing resources could realistically participate in the process, thus maintaining the democratized nature of blockchain networks.\n\nImproved Network Performance: Sharding can help to improve overall network performance and capacity. In the traditional blockchains, as more nodes participate in the network, the performance paradoxically decreases due to the need for increased data communication and synchronization between nodes.\n\nHowever, sharding transforms this scenario. Since each shard works separately and concurrently, the system can process more transactions and computations. When a new node joins, it can be added to a shard instead of the entire network, thus enhancing the network's capacity to scale. Efficiency is improved, leading to smoother transactions and a better user experience.\n\nRemember, future advancements and improvements in sharding technology may create other advantages, or strengthen these existing ones, enhancing the blockchain ecosystem continually.\n\nWhat Are the Limitations of Sharding?\n\nWhile sharding offers several potential benefits that could help blockchain networks become more efficient, the process also introduces a unique set of challenges. Some potential vulnerabilities introduced by sharding include:\n\nSingle Shard Takeover Attacks: In a sharding environment, the computational power to take over a single shard is dramatically less than the power required to take over the entire network. This makes these individual shards more vulnerable to a \"one-percent attack\" or \"shard takeover\" - whereby an attacker with a small amount of resources compared to the whole network can potentially take over an individual shard.\n\nCross-shard Transactions: Transactions happening across different shards (cross-shard) present a unique challenge. Cross-shard transactions are complex and could potentially lead to double-spending if not carefully managed. If one shard doesn't accurately track the state of the other shard during a transaction, users may exploit this to \"double spend\".\n\nData Availability Problems: Sharding makes maintaining the entire network state an intricate effort. If certain shards aren’t available when required (because the nodes maintaining those shards are offline), it could lead to data availability issues, disrupting the entire network.\n\nNetwork Security: Sharding requires the implementation of a robust protocol that balances the load between shards. If not correctly done, this could lead to uneven distribution of data or imbalance of resources, resulting in potential network instability.\n\nNode Synchronization: Node synchronization can cause network delays due to the time it takes to share and update information across different nodes. Furthermore, if a node with slower processing capabilities or network connection lags behind, it could slow down the entire synchronization process, reducing the overall performance of the blockchain network.\n\nIs Sharding Implemented on Ethereum?\n\nEthereum has plans to implement sharding as part of their Ethereum 2.0 upgrade. Ethereum 2.0, also known as Eth2 or Serenity, is an upgrade to the Ethereum blockchain that aims to enhance the speed, efficiency, and scalability of the network, allowing it to process more transactions and ease congestion.\n\nAs of now, the upgrade is being implemented in phases, with the final phase (Phase 2) including the full implementation of sharding. Ethereum developers hope that these enhancements will address some of the current challenges associated with scalability and transaction cost that the network is facing.\n\nHowever, it's important to note that implementing sharding comes with its own set of challenges, particularly in maintaining the security and decentralization of the network. Therefore, Ethereum developers are putting careful thought and extensive testing into this transition to ensure the upgrade's success when fully implemented.\n\nClosing Thoughts\n\nOverall, sharding represents a noteworthy advance towards solving the blockchain trilemma. While it introduces new complexities and possible drawbacks, its potential for increasing scalability without compromising decentralization holds immense promise for the future of blockchain networks.\n\nIt’s no wonder that various blockchains are exploring sharding as a potential solution. Ethereum is integrating sharding as part of the Ethereum 2.0 upgrade to address scalability issues. This implementation is expected to take place through The Cancun upgrade, a critical component of the overall enhancement plan. Nevertheless, like any other evolving technology, success will depend on ongoing research, development, and rigorous testing of sharding implementations.\n\nFurther Reading\n\nDisclaimer: This content is presented to you on an “as is” basis for general information and educational purposes only, without representation or warranty of any kind. It should not be construed as financial, legal or other professional advice, nor is it intended to recommend the purchase of any specific product or service. You should seek your own advice from appropriate professional advisors. Where the article is contributed by a third party contributor, please note that those views expressed belong to the third party contributor, and do not necessarily reflect those of Binance Academy. Please read our full disclaimer here for further details. Digital asset prices can be volatile. The value of your investment may go down or up and you may not get back the amount invested. You are solely responsible for your investment decisions and Binance Academy is not liable for any losses you may incur. This material should not be construed as financial, legal or other professional advice. For more information, see our Terms of Use and Risk Warning."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFA0V2ptTHJ2WE9Odm95NDYtUUI3T1pxTlhaOFczVjRHOFdGYmpEVVVhci1xekJBcDlYck5Xdkt4aHJNYzJlRWVWSDFKZUt2bDMwaVhnMkRlQlhWSkltMXNJTXFsSlpnNmJxS1JlRC1Bc2V3OFB5S2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Daily Analysis: BTC, ETH, KAS, STX, LUNA - Blockchain Reporter",
        "content": "Markets are on bull activity today, with the global market cap sitting 2.8% above its previous 24-hour mark, as the total cap stands at $1.52T as of press time. The fear and greed index is 75, as greed now dominates. The global trading volume is 12% up in 24 hours, at $49.4B as of press time.\n\nBitcoin price analysis\n\nBitcoin (BTC) has started on bull activity, as the Bitcoin price stood at $41.5K as of press time after recording a daily increase of 5.8% and a weekly rise of 11.13%. As a result of the Bitcoin price, the token’s trade volume jumped by 61% during the same period and is presently at $25.5B.\n\nThe Bollinger bands are diverging, showing high volatility levels on the Bitcoin price. The Relative Strength Index (RSI) is above the average in the overbought region, showing bull dominance on the Bitcoin price.\n\nBTC 1-day chart | Source: Tradingview\n\nEthereum price analysis\n\nEthereum (ETH) has also started on bull activity, as the Ethereum price stood at $2251 as of press time after recording a daily increase of 4% and a weekly rise of 9.8%. As a result of the Ethereum price, the token’s trade volume jumped by 18% during the same period and is presently at $11.5B.\n\nThe Bollinger bands are diverging, showing high volatility levels on the Ethereum price. The Relative Strength Index (RSI) is above the average in the overbought region, showing bull dominance on the Ethereum price.\n\nETH 1-day chart | Source: Tradingview\n\nKapsa price analysis\n\nKaspa (KAS) has also begun on bull activity, as the Kaspa price stood at $0.149 as of press time after recording a daily increase of 5.7% and a weekly rise of 14%. As a result of the Kaspa price, the token’s trade volume jumped by 32% during the same period and is presently at $59.5M.\n\nThe Bollinger bands are converging, showing low volatility levels on the Kaspa price. The Relative Strength Index (RSI) is above the average, close to the overbought region, showing bull activity on the Kaspa price despite today’s drop.\n\nKAS 1-day chart | Source: Tradingview\n\nStacks price analysis\n\nStacks (STX) has also begun on bull activity, as the Stacks price stood at $0.828 as of press time after recording a daily increase of 0.39% and a weekly rise of 23%. As a result of the Stacks price, the token’s trade volume jumped by 6% during the same period and is presently at $133.3M.\n\nThe Bollinger bands are diverging, showing high volatility levels on the Stacks price. The Relative Strength Index (RSI) is above the average, close to the overbought region, showing bull activity on the Stacks price despite today’s drop.\n\nSTX 1-day chart | Source: Tradingview\n\nTerra price analysis\n\nTerra (LUNA) has also begun on bull activity, as the LUNA price stood at $1.17 as of press time after recording a daily increase of 40% and a weekly rise of 36%. As a result of the Terra price, the token’s trade volume jumped by 310% during the same period and is presently at $570.3M.\n\nThe Bollinger bands are diverging, showing high volatility levels on the Terra price. The Relative Strength Index (RSI) is above the average in the overbought region, showing bull activity on the Terra price."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFBmNTlPVEw5Zml6eGVIRXBnVHBOX2EyX1owT255NVl5YVFaNGJPY3laTUxjdkQ3RTUzWmlCbDV5MjIwWDFWWDF5TVFsVFJKLWZTbzBIQUIxbGtZekhhYU1fcU51Ump1QngzdGYzTDdoNmtWM1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Dec 2023 08:00:00 GMT",
        "title": "Solana Founder Warns Against Calling SOL, the Ethereum Killer - Coinfomania",
        "content": "Anatoly Yakovenko, the co-founder of Solana Labs, has taken to X (formerly Twitter) his disapproval of the popular description of the Solana network as an “Ethereum killer.” In his words, he doesn’t “see a future where Solana thrives and somehow ETH dies.”\n\nDon’t bring back last cycle “eth killer” bs. It’s lame. Pareto efficient technologies can have overlapping features and will compete, but that’s all ok. I don’t see a future where solana thrives and somehow eth dies. I am such a techno optimist that I am certain that… — toly ???????? (@aeyakovenko) December 2, 2023\n\nSolana Lauded as an ETH Killer\n\nThe layer-1 Solana network was created to offer smart contract capabilities like the Ethereum network. However, it supersedes the Ethereum mainnet regarding speed and energy efficiency thanks to its use of a proof-of-stake (PoS) consensus mechanism.\n\nAt the time, the Ethereum blockchain implemented the energy-consuming proof-of-work (PoW) consensus mechanism. The network also processed only about 30 transactions per second, compared to Solana’s record of 50,000 to 65,000 transactions per second.\n\nDue to its inherent features, the Solana network has been lauded as an ETH killer since its official launch in 2020. The term has also been used to describe some popular blockchains such as Cardano, Tezos, Avalanche, and Polygon.\n\nSolana has also introduced toolsets to onboard developers from the Ethereum network into its ecosystem. In July, Solana Labs launched Solang, a compiler enabling developers familiar with Ethereum’s programming language (Solidity) to write smart contracts on the Solana mainnet.\n\nDescribing the expression as “lame,” Yakovenko argued that even though Solana and Ethereum have similarities, the latter will not be overshadowed by the initial.\n\nSolana Ranks Among Best Performing Cryptocurrencies\n\nAmong the top 10 cryptocurrencies, Solana’s SOL emerged as the best performer. Maintaining its ranking as the sixth-largest crypto by market capitalization, SOL has soared by over 220% in the last three months alone. These metrics supersede crypto assets such as Bitcoin (BTC) and Ether (ETH).\n\nGoing from as low as $17.9 to as high as $65.2, market experts suggest that the cryptocurrency will likely surpass the $70 price mark as active addresses increase. Presently, SOL trades at $63.8, representing 2.7% in the past 24 hours.\n\nSource: CoinStats"
    }
]