[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPZlRKRTBNbWE4OEF4YU9qSVVlNDJIVjN4Q2cwanJncXZzU1dzUi0ySnhFVGJ4MGpzaWdWclV6QURWeWtUZlVENDc5MGxySV92dkxuZnhMRWJ6b2JsQ0VCTFJHa0pSZmltY2tEX01UMzJpbnBZeVlnc2h5REJFSm4wU2hpTm5sVzNDX3l1N0RWVEpqQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Ethereum will outperform bitcoin next year and recapture market share in crypto, JPMorgan says - Yahoo Finance",
        "content": ": A photo illustration of the digital Cryptocurrency, Ethereum, is seen on September 13 2018 in Hong Kong, Hong Kong. Yu Chun Christopher Wong/S3studio/Getty Images\n\nJPMorgan analysts expect ethereum to outperform bitcoin next year.\n\nA proposed network upgrade could serve as a catalyst for market share gains, they added.\n\nMeanwhile, JPMorgan is also less bullish on bitcoin's price than others on Wall Street are.\n\nA potential network upgrade for ethereum could be bullish for the crypto next year, according to JPMorgan analysts.\n\nIn their crypto outlook for 2024, they see ethereum beating bitcoin and gaining market share.\n\n\"While we are cautious on overall crypto markets into 2024, we are looking for ethereum to outperform bitcoin and other cryptocurrencies next year helped by the forthcoming EIP-4844 upgrade or Protodanksharding,\" they wrote on Wednesday.\n\n\"Protodanksharding\" is essentially a proposal to reduce transaction costs and boost the number of transactions per second.\n\nThose changes could serve as a catalyst for ethereum to recoup its share of the crypto market by improving network activity.\n\n\"We believe that next year ethereum will re-assert itself and recapture market share within the crypto ecosystem,\" analysts wrote.\n\nEtherum has ridden the wave of the crypto comeback this year, up almost 90% since January. The currency now sits at $2,270. But its gains have lagged behind bitcoin, which has rocketed by around 154%.\n\nThe rally has largely been buttressed by optimism that a spot bitcoin ETF will get regulatory approval soon. But JPMorgan analysts are more skeptical about the bullish bets on bitcoin.\n\nCrypto optimists believe a spot ETF approval would improve liquidity and lower the barrier of entry for more investors to invest in bitcoin without owning the currency. JPMorgan, however, thinks it's not so much new capital that would flow into the crypto as much as it is re-shuffled money from other crypto assets.\n\nAlso fueling the hype in bitcoin is the halving event scheduled for April next year, which tends to reduce the supply of the currency and lift prices. But the more bearish take by JPMorgan analysts is that the quadrennial event has been \"well factored\" into the current price, and the currency won't rally post-halving.\n\n\"We instead look for around 20% drop in the hash rate post halving as miners in higher cost locations or with less efficient hardware would be forced to exit the market,\" they wrote. \"This scenario would be more consistent with around $35k bitcoin price post halving.\"\n\nRead the original article on Business Insider"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPYmNEV0wtUUhteUxwbW41MkQ1eGYtdGUyNTEyaXJDaFdsSXdsbnV4bHZrczg3bW1PUk0wbUlPcld6U0RHQjl2amI4Qzl2Z0ZYUl9OQVozeXdIYTJVMlRidWpQLUlkSklUTnpOdVNzY2FWWm1iNzFPUmZKNnE2Q3ozV3JIbXJUQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "JPMorgan says ETF optimism is overhyped, and Ether could overshadow Bitcoin in 2024 - Fortune",
        "content": "While many investors have rejoiced at Bitcoin’s recent price upswings, others are betting that crypto’s second fiddle, Ether, will actually be the big winner of 2024.\n\nWhile loud voices on Crypto Twitter have predicted the start of another bull run with Bitcoin’s recent resurgence, JPMorgan analysts just wrote in a new report that the coin is overbought.\n\nThe report took aim at one of the biggest drivers of Bitcoin’s recent rosy performance: the possibility that the Securities and Exchange Commission will approve several spot Bitcoin ETFs in early January.\n\nSome have predicted that the approval of spot ETFs from TradFi firms like BlackRock and Fidelity will drive billions of dollars of inflows to Bitcoin, but JPMorgan said this optimism is misplaced.\n\nThe bank pointed to weak demand for existing spot Bitcoin ETFs in Europe and Canada as evidence that the investment vehicle could fail to garner significant traction in the U.S. Instead of bringing in fresh capital, spot ETFs are likely to instead draw from capital already invested in Bitcoin-backed vehicles such as the Grayscale Bitcoin Trust (GBTC), Bitcoin futures ETFs, or Bitcoin mining companies.\n\nIf the Grayscale Bitcoin Trust, the world’s largest Bitcoin fund, in particular, is allowed to become a spot ETF, existing investors could take profits and remove as much as $2.7 billion from the exchange-traded fund. That could severely dent prices, the report said.\n\n‘Recapture market share’\n\nThe report also claims that the upcoming Bitcoin halving, which will cut the mining reward in half, has already been priced in and will not give the coin the boost some expect.\n\nOn the other hand, the JPMorgan report said Ether could outperform Bitcoin in 2024 owing in part to an upcoming upgrade to the underlying Ethereum blockchain dubbed EIP-4844 or proto-danksharding. The update is meant to increase throughput and decrease gas fees charged to those who execute transactions on the network.\n\n“We believe that next year Ethereum will reassert itself and recapture market share within the crypto ecosystem,” the analysts wrote.\n\nAs crypto prices have fallen over the past several months, funding dollars have dried up, and some VCs have cut the valuations of some of their biggest crypto bets by double digits. JPMorgan said it’s seen a “reinvigoration” of VC funding this quarter, although it still looks preliminary.\n\nStill, analysts think a revival in venture capital activity in the crypto industry could make a meaningful difference. “To the extent this improvement continues into the first quarter of 2024,” the report continued, “that would represent a significant development that would herald in our opinion the end of the Crypto Winter.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQazN0S2VZQ1NPOTlNWHpPYkV2T0tiOW9NZmNfUHJNOXQzNGVuMzRsYVgyRDMxa18zMWhIQXh0a21tUTZqWng1YnRtamVLdktQMWFoNUpKVjZNam9lZU1aV3ZJQm5yd1lyc0hqU2c3U0NQaHJVNWhvSjVDQmEtaWJlcXp4UFZMZ2MyLThwMG16eHVTY3M1X2k4dDlQX0E1MFgwYVkzaDhzelBRS2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum community approves first-ever compliant tokenization standard, ERC-3643 - Crypto Briefing",
        "content": "The new token standard allows anonymous credentials to ensure only eligible users can access tokens.\n\nShare this article\n\nThe Ethereum community has approved the ERC-3643 standard. This standard is the first-ever designed specifically for compliant tokenization. This new standard improves upon the widely used ERC-20 standard, particularly in securities activities. It enhances ERC-20 tokens with controlled advanced functions and compliance modules.\n\nJoachim Lebrum, Chair of the Technology Working Group ERC-3643 Association, stated that:\n\n“The ERC3643 standard is a groundbreaking step towards integrating advanced blockchain solutions into the enterprise sector, and this validation sends echoes across the ecosystem that ERC3643 is the superior standard for such use cases.”\n\nERC-3643 is a permissioned token standard for tokenizing securities, real-world assets (RWAs), payment systems, and loyalty programs. The standard uses a self-sovereign identity (SSI) framework to verify users’ token eligibility dynamically. This feature ensures compliance through anonymous but verifiable credentials.\n\nThe new ERC-3643 standard sets out to revolutionize how companies leverage blockchain technology. It provides them with a secure, compliant framework to tokenize various assets. Ethereum’s official recognition of this standard demonstrates its goals to address users’ diverse needs. It also establishes a benchmark for institutions implementing this framework in tokenization projects.\n\nCompanies now have an approved standard to actively deploy to bring real-world assets onto blockchains while integrating the necessary compliance controls and permissions.\n\nLooking ahead to 2024, experts predict the momentum behind asset tokenization will accelerate. HSBC’s research group forecasts the market for tokenized assets will swell to trillions of dollars by 2030. Governments and significant investment funds are demonstrating growing interest in this area. The next wave of tokenization will likely see bonds, equities, and other mainstream financial assets transitioning to blockchain-based models."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNSTloZVgwckE2cWtqMUNDUzdBdXp3RmJObTA5R0djUnY5RWhtYUlaYUtuNkN3Q0x2YzFrckFNdVhabmwxMERmaUNLeHdlS05FNWpIYVpoUk5JV19OcG44cC1XZmV6eFhISndRU0lGR2o2LUdZa211YVBURGE2d0daaUFlQ0RRMWJoRUtENEw1bTBHZEN4TF9n0gGfAUFVX3lxTE40dUpZTmJhZnBGWnV3V1RyWjh1bnU3M1gzaDBiaU5PWXVQSW1RZGpBRUxfWlVRanVNMjYzeTRFWnctTzRCcUlvMVVXeV9SZllOSUlkQWdzSzlhZ3huN3R5b05hVE5SYS11S0FzU0E3MmZ1WWRHNVlKZlByclE1M0xYa0FrcTFqbktDTFlHM0htR1V2b0tfNmRwY0ZSblE5MA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "JP Morgan: Ethereum to Outperform Bitcoin in 2024, Halving ‘Priced In’ - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nJP Morgan has poured cold water on hopes of a crypto bull run next year, with the bank’s analysts taking a “cautious” stance in their 2024 crypto outlook.\n\nAnalysts led by Nikolaos Panigirtzoglou said in a newly published report that the Bitcoin halving is “largely priced in,” since the halving event and its effect on the Bitcoin supply are “predictable and in our opinion are well factored into the current bitcoin price.”\n\nThe team argued that based on the current Bitcoin hash rate and mining difficulty, that the production cost for miners would rise from around $22,000 at present to around $44,000 post-halving.\n\nBitcoin’s current price of around $42,000 is consistent with a 5% drop in the post-halving hash rate, which “seems too low,” with the team anticipating a 20% drop in the hash rate and miners with higher overheads exiting the market.\n\nAD\n\nAD\n\nSince the 2020 halving brought Bitcoin's price to a 1:1 ratio with miners’ production cost, and the current Bitcoin price is around twice the production cost, it implies that the 2024 halving is largely priced in, the report suggested.\n\nEthereum could “outperform” Bitcoin in 2024, the report said, pointing to the EIP-4844 “Protodanksharding” upgrade as a potential catalyst, but raised concerns about centralization of staking on the Ethereum network.\n\nThe report cautioned that it is “too early to be getting excited” about a revival of DeFi and NFT activity, while pointing to the “encouraging” rise of new DeFi chains including Aptos, SUI and Pulsechain, and the “renewed interest” in NFTs prompted by the emergence of Bitcoin Ordinals.\n\nA Bitcoin ETF flop?\n\nJP Morgan analysts also expressed skepticism that the long-anticipated approval of a spot Bitcoin ETF would bring fresh capital to the market.\n\nAD\n\nAD\n\nThe report cited both the lack of interest from investors in already-approved spot ETFs in Canada and Europe, and the likelihood that capital would move into spot Bitcoin ETFs from existing Bitcoin products, such as the Grayscale Bitcoin Trust (GBTC), Bitcoin futures ETFs and Bitcoin mining companies.\n\nThe report argued that as much as $2.7 billion could exit GBTC following its conversion to a spot Bitcoin ETF, as investors take profit. Were those funds to exit the market rather than moving into other Bitcoin instruments, it would put “severe downward pressure” on the price of Bitcoin, analysts said.\n\nJP Morgan and crypto\n\nThe JP Morgan report comes just a week after the firms’ CEO, Jamie Dimon, took aim at crypto in a Senate Banking Committee hearing, saying that he would “close it down” if he were the U.S. government.\n\nDimon claimed that, “The true use case for it [crypto] is criminals, drug traffickers, money laundering, tax avoidance,” adding that, “I’ve always been opposed to crypto, Bitcoin, etcetera.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQMGFDdFZOazdHZHJJaFdMVW5WMEpVdTZfVlJxYjBrNUw3eVJnaDdTczhCZTZiVUdCSnZhazF3NzRHOC1wSXZMTG1PbHhVeTVYTzFaUXJIQTZaUW1WSGJFYi1qUDRwSWxMQjlrRXBfRHBEMDFwZTBONFZfS2U5enI0b0w0R2JIVXB0ekZVN0RZOU40NDA5b3JxNm9xSjZGLUE5TzVjNXB0VjlZS3ZRVVdwaHp6TjllZ9IBuwFBVV95cUxOZ3N1RlRZbEJ0YVRaZzRBenQ5RlBWdlM1UUw0QlZ6M2pMWUtNNDBpZ3o0V1B0SXU3LUtQcS1vc2NPTE9sNlE0M1F5SFpPVFpRNDJ0WGVERDdsMURvdDVScTJVZVRmRUVYMnhiNFNKQzNrLWdJMENvLXg1dHB3cUR6aFdsNFFpblU2VlNteEdCQm5HWjRzYi1sNUlxUm5haWFRSEJFUkNudXI2MmtjRW8xeTNBSFVXcDZwQW5v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Early Ethereum Backers Cyber.Fund to Invest $100M in 'Cybernetic Economy' - CoinDesk",
        "content": "\"Cyber.Fund is driven by the belief in blockchain as the foundational layer for a new economy – one that is programmable, trustless, and decentralized,\" co-founder Konstantin Lomashuk said. “The cybernetic economy represents a new era of innovation and collective growth, and we at cyber.Fund are fully prepared to be at the forefront of this transformation.”"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE1SdzdzbkdsbXJDRkUxRFNxU1M2N0JOZlZMYmJzdHpIY0hVMXZCd1pXM0NyeFo3VVpybHhweUFYbnpGcDYtcVp5Z0FNcGlYZlJEVjJadFBFZm5QT0RIV3M0MkNOSGg2Z3pE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Cronos broadens scaling roadmap from Cosmos to Ethereum - Blockworks",
        "content": "The network of Ethereum layer-2 rollups using zkSync’s ZK Stack got a new addition Thursday, with the launch of the Cronos zkEVM testnet.\n\nBlockchain developer Cronos Labs is developing its third blockchain, which is the first to use ZK Stack hyperchain to reach a live testnet.\n\nThe first chain in the Cronos ecosystem was a Cosmos appchain developed in partnership with the Crypto.com exchange and launched in 2021. Cronos then followed up with an EVM-compatible chain, also built using the Cosmos SDK in 2022. This new effort augments, but does not replace, the prior two chains.\n\nCronos’ zkEVM is the result of a collaborative effort involving Cronos Labs, Matter Labs (the team behind zkSync), and several engineering teams from stakeholders Crypto.com and dapp developers on the existing chains.\n\nThe zkEVM testnet is built on top of the Ethereum Sepolia testnet and leverages zkSync’s new open-source prover, Boojum, a STARK-based zero-knowledge proof system, notable for its low hardware requirements and low fees in the layer-2 rollup space.\n\nRead more: Polygon Zero and Matter Labs square off over open-source norms\n\nLaunching a native Ethereum chain was motivated by frustrations with bridging across EVM chains and between Cosmos and Ethereum, according to Ken Timsit, managing director at Cronos.\n\n“When we started building Cronos as an EVM chain, we were, of course, already convinced that the Ethereum developer ecosystem has richness and robustness that has no comparison when it comes to building DeFi and NFT applications,” Timsit told Blockworks.\n\nGood relations with Matter Labs and a desire to contribute to the open source development of the ZK Stack led them to take the next step.\n\nHyperchains share components of the ZK Stack, including a shared native bridge to the Ethereum mainnet and zkSync’s trustless bridging mechanism, in which assets remain secured by Ethereum.\n\nIt will also benefit from zkSync’s native account abstraction, which allows transactions fee payment in various cryptocurrencies, such as Cronos’ token (CRO).\n\n“When you look at legacy chains, it’s very hard to migrate Ethereum assets, for example, to account abstraction enabled wallets,” Timsit said. “And so for us, starting by default with account abstraction is a way to take advantage of what this technology offers, better than what we can do on a chain which already has an ecosystem of wallets and tokens.”\n\nCronos’ zkEVM is expected to progress to mainnet in the second quarter of 2024.\n\nGrowing hyperchains\n\nA handful of other hyperchains are in development using the ZK Stack, notably GRVT, (pronounced “gravity”) a derivatives exchange, and Tradable, which is working on bringing private credit on-chain.\n\nTradable intends to have an institutional focused hyperchain, eventually forming a decentralized chain alongside other institutional partners, according to Omar Azhar, Matter Labs head of business development.\n\n“I think what you might start seeing is app specific chains and then ecosystem specific chains,” Azhar told Blockworks.\n\nMatter Labs sees the zkSync hyperchain as strictly a better option than app-specific chains in Cosmos, such as Cronos’ earlier efforts, said Marco Cora, senior vice president of business and operations. That’s because Cosmos chains generally must provide for their own validator set and security, and lack native token bridges to Ethereum.\n\n“If you are an appchain developer, why are you taking on these two extra projects that you shouldn’t really focus on: building the bridge and bootstrapping the security?” Cora told Blockworks.\n\nThe ZK Stack competes with other well-funded networks building zkEVM chains, including Polygon, whose Chain Development Kit (CDK) shares many of the same goals, and StarkWare’s Starknet, the progenitor of STARK prover technology which both Polygon and zkSync have iterated upon.\n\nHyperchains can also serve the purpose of private blockchain frameworks such as Hyperledger or Corda, Cora said, but with all the benefits of Ethereum.\n\n“They are technically highly scalable, but they practically don’t scale. When you speak with most enterprises, they tell you this is way too expensive for what it is for me,” he said.\n\nAside from cost considerations, there’s the social coordination problem.\n\n“If you’re Goldman Sachs, you don’t want to join the Morgan Stanley Chain just because it’s the Morgan Stanley Chain. If you’re Fidelity, you don’t want to join the BlackRock Chain just because it’s the BlackRock Chain and so on and so forth,” Cora said.\n\n“But if the sponsor of the chain…forced himself to create a zero knowledge proof and to hand this proof to a third party — which is Ethereum — they now can claim a much higher degree of credible neutrality,” he added. “Now, this party cannot mess with the system.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxNVGROSGVGZ0lVclZWREhtTmRMeVN3OVJ6SEJZTlhkQUxPcjN6ZENfS2U3akUxQTFKZmJuS2N5VmNEb3pmYU4zUjhIMWMxZnNUVXV4eEJERG1ZOGJRYjZoWVVMU1RId19HZkNVWHFXQkpaV3VoQ3ZKOGZSSzRFdGt6M0ViY0x0OEo1UzY5MVV5SFNHc1JfRW9CQnF1RkxPenNUb0pwN2ZtSVRYX3J3VE1MUjctaTlRVDZsb0hmUnVJVlAtaXlJR2s2NjlCNDlueGlsZVpQUmIyNHZSenNEMWhZeTBoc29CaHVQ0gHuAUFVX3lxTE0teWFxaFk2OGNBbkcxZlVoRmR1UE1ydFRSTTJ1eG5pMWpJbnhIVl9xV25MVkVNMTJSTnJsXzZfRF9BVDVZcEhUZEI5U0FGX2R1dWRPR2owUWJKM2lqSE5QVnVQUU1lekV3Y2YtWGg2RDJaUVdXRG9oYTFWTWh0OGZwTDE4dHFOV1N6Q2hsMTZlY0tNUi1UdEM0a2EtYTJfSDZKODJvTEt3VjByS0NwYXBveXZ5NTR2UDJIM1RaQmlmVUg5YUJONklSZFdubVNjRlgxdjFSMFUwT0NXVTllazRkVFlsS3pMRDZBMnNXTXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Ethereum revenue could double to $5 billion and fee may fall to $0.01 in 2024: Bitwise prediction - FXStreet",
        "content": "Bitwise, the world's largest crypto index fund manager, noted in its prediction for 2024 that Ethereum is poised to witness a doubling in its revenue.\n\nFurthermore, the EIP-4844 upgrade is expected to reduce the average transaction cost on Ethereum by 90%.\n\nEthereum price is maintaining a bullish macro outlook, marking a 53% rise in the past two months.\n\nWhile 2024 is expected to be Bitcoin's year in more ways than one, it will also bear a significant impact on Ethereum price and network. But in its own way, the home of Decentralized Finance (DeFi) is predicted to make an impact on the market by likely improving the overall operations and financials of the network.\n\nEthereum revenue to double in 2024\n\nBitwise Asset Management, the world's largest crypto index fund manager, published its predictions for 2024. Two of these ten predictions are focused on Ethereum, making it the most in-demand network despite the rise of layer-2 chains and competitive layer-1 chains.\n\nBitwise noted that Ethereum revenue will probably double to $5 billion over the next year. Per the report, the network reported $2.3 billion in fees, i.e., revenue, which is almost half the revenue of 2022's $4.1 billion. Bitwise, in regard to this prediction noted,\n\n\"Ethereum functions like a global supercomputer, hosting thousands of crypto applications that people use every day. And in order to use those applications, you have to pay a fee using the Ethereum crypto asset. That's cash flow.\"\n\nEthereum network revenue\n\nAnother crucial prediction for 2024, the asset manager made, was that the average transaction costs on Ethereum will fall to $0.01. This prediction falls in line with the expected network upgrade going by the name of EIP-4844.\n\nThe primary goal of the proposal is to reduce the average transaction cost by 90% in order to make the network more accessible to mainstream users. According to Bitwise's report, with fees going down, Ethereum will radically increase the types of activities individuals can feasibly participate in on the network. Major product ideas like micropayments, social media, and large-scale gaming would become possible.\n\nWhether these pan out in 2024 is up to the conditions of the market at that time and the impact they would have on Ethereum price.\n\nEthereum price remains bullish\n\nEthereum price in the short-term timeframe might have noted some correction, but when it comes to the macro outlook, ETH is still bullish. The 53% increase observed in the past two months is expected to continue into 2024, potentially bringing the price to $2,500.\n\nThe Moving Average Convergence Divergence (MACD) is exhibiting bullish signal on the 3-day chart. This bullishness might exhaust or demand some correction following the spot Bitcoin ETF approval rally.\n\nHowever, at the moment, ETH is expected to recover and flip the $2,296 resistance into support to push the price to $2,421.\n\nETH/USD 1-day chart\n\nIf this breach fails, the altcoin could retrace to $2,142 and losing this support line would invalidate the bullish thesis, likely pushing ETH down to $2,000."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE1DTThDVXZtaFVHenZ6Zzl0VldWQkRqNjBpV1VkZjZTV0ZlODE2eDZ0aWRLVzdyMVM0ZXJWZzZmaU5aQjl3LWhiY0xVS2g3NVVtdDNSaDAtRFh4cmdyQlVvOFB0T0NYd9IBa0FVX3lxTE1uWmEycC1DOEJ4RVFnQy1zNnNfZDNBcU5ST2FtQTZfS2dmakJMS2g4WTBXVEhfTHBKcEdNdjloZmE4cU4yS1NLYkpvTk9PcHNfcnd0R0xkVW1FLXJfSjBUWVZHWGQ5bENMMEc0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Sells Trillions Of Tokens | Bitcoinist.com - Bitcoinist",
        "content": "Ethereum founder, Vitalik Buterin has undertaken a large-scale transaction involving trillions of meme tokens, leaving the broader cryptocurrency space curious about the motives behind the founder’s decision.\n\nEthereum Founder Executes Massive Memecoin Sales\n\nEthereum inventor and founder, Vitalik Buterin has made new headlines as reports surface of his substantial memecoin sales. According to blockchain security company, PeckShield Alerts, a Vitalik labeled wallet address was seen swapping 100,000,000,000,111.111 DOBE tokens worth approximately $22,900 for 10.44 Ethereum tokens (ETH). Additionally, the wallet also initiated another sale of 1,858,140,000,000 DOJO tokens worth $6800 for 3.12 ETH.\n\nThe motivation behind the sell-offs remains unknown however the large-scale memecoin transaction has adequately caught the attention of cryptocurrency investors and the market as a whole.\n\nThe substantial meme coin sale follows a recent loss experienced by Buterin earlier this week. The Ethereum founder’s publicly known crypto wallets became short of $29 million between December 15 and 21.\n\nThe loss was reported by blockchain analytics service, Arkham Intelligence. According to the analytics platform, the reason for the loss was due to crypto market fluctuations which saw Buterin’s wallets losing 5% of the total value of its assets.\n\nETH price chart at $2,300 | Source: ETHUSD on Tradingview.com\n\nButerin Crypto Sell-Offs\n\nIn addition to Buterin’s recent large-scale meme coin sell-off, there have been many other crypto sales executed by the ETH founder. Earlier this year, Buterin sold about 9.9 billion CULT tokens worth $332,420 at the time of the sales. The Ethereum founder subsequently revealed reasons for the sell-off, stating that the cryptocurrency held no cultural or moral value.\n\nLater in October, rumors surfaced about Buterin allegedly selling off his ETH holdings after the Ethereum founder sold about 500,000 USDC worth approximately $14.93 million at the time, to the Gemini exchange. Buterin clarified the sell-off allegations stating that the transactions were made to charitable organizations and other initiatives.\n\nMore times than not, large-scale crypto transactions from prominent leaders in the crypto space tend to capture the attention of investors as these sales could lead to a shift in the market. However, Buterin has also revealed that he has never sold Ethereum tokens (ETH) for his gain since 2018.\n\nThe Ethereum founder is known for making multiple ETH donations to charity organizations and COVID-related causes. Buterin is also known for purchasing and constantly dumping meme coins, causing the value of these tokens to plummet in several cases.\n\nFeatured image from Newsway, chart from Tradingview.com"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPdXlXNkJSWWlCRmlJNnFTRXNJdWZKa3pCaDBFc1l2cXZNMzNJY3hPLUMyNUJLSzNUaTlKb1E2bEZuNWNXWldibjU5RzJsQ3liM3hmMXp0ajFOZ2M5NXlNQkRpVHZ3MHl6NWNxYldudUhyS3NRSS1FeUJXaUdsTnFZSWU5cF92b3Q2alBEMnVSRG1mT291WTlhbnhXRFc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Proposes ‘Enshrined zkEVM’ For Ethereum Scalability - Crypto Times",
        "content": "Ethereum co-founder and developer Vitalik Buterin has proposed a new concept of ‘enshrined zkEVM’ for addressing Ethereum scalability.\n\nIn his latest blogpost, the Ethereum core developer said that a zero-knowledge EVM (Ethereum Virtual Machine) could efficiently be implemented directly on Ethereum layer 2 networks, which use both optimistic and zero-knowledge (zk) rollups.\n\nVitalik describes that the current layer 2 protocols on Ethereum heavily rely on EVM execution and verification with a large set of codebases.\n\nIf the codebase of these layer 2 protocols contains any bugs, it puts the whole network at risk of being hacked.\n\nHe further said that these layer 2 projects mostly provide the functionality already available on Ethereum, and in addition, Ethereum governance could implement changes to the network.\n\nWhile Ethereum’s light clients are getting more powerful, it is expected that ZK-SNARKs will be fully operational on EVM for data verification and transaction executions over the next few years. Vitalik believes that at that time, Ethereum will eventually have a built-in zkEVM, so it could also be available for rollups as well.\n\nAccording to Vitalik, the proposed zkEVM needs to have certain key properties so that it can efficiently address scalability.\n\nIt requires compatibility –with Ethereum’s multi-client system including data availability and proof verification for different clients– , upgradability, and support for all EVM-based infrastructures.\n\n“The most important property […] is speed,” said Vitalik, adding\n\n“While it is possible to design an in-protocol ZK-EVM feature that is asynchronous, returning an answer for each claim only after a delay of N slots.\n\nthe problem becomes much easier if we can reliably guarantee that a proof can be generated within a few seconds, so whatever happens in each block is self-contained.”\n\nVitalik has also delved into many technical aspects of an ideal zkEVM, which are largely inherited by current layer 2 networks.\n\nHowever, the implementation of zkEVM on Ethereum does not replace the need for layer 2 networks, as “layer 2 projects would still be responsible for many important functions,” such as high-speed confirmations and MEV mitigations, while maintaining a user and developer-friendly environment infrastructure."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQRm02QUE2Mjd0NVptUThOemFkVkJ4ZzFZZ25YZVJFX0RKNjRXbFRoRnVnY1hOc3A2UVFsdkVtU1FlYzlOcEMtckgxejZOWnc3Vl9FSTFuUHd6anZEUVdNLUtMc0MzTlhkSzRyLTZkdlhqbjRYanpnWXc5WklYUG4tM1d5NNIBiAFBVV95cUxOUHBMcGZSYldLWF8tWHR2Qm9kT2xObGNJNGxURGJXQjhjX1FFRllreURvWGg3UjNZMWVlYWRnY3RCQmNKU3RQM2RMbVNVdGw3ZVFGUjZoUFFZbFduZTRHZUF1MXpvQ1dGZjQ5bkJNU2I2UmVwVGN6SjdfR1dNT2l5a29rYTZfWTdN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price to Reach $2,500 on This Date, But Here's Catch - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum's price trajectory has been the subject of intense scrutiny and speculation, especially as it shows numerous reversal signs. Chart analysis suggests that the middle of January 2024 could be when Ethereum potentially hits the coveted $2,500 price mark. However, like any projection on the volatile market, this comes with significant caveats.\n\nAdvertisement\n\nA study of Ethereum's price performance, as depicted in the recent ETH/USDT chart, shows a robust uptrend with high momentum. This is corroborated by the Relative Strength Index (RSI), which, although retreating from overbought territory, remains strong, indicating sustained buying interest. The moving averages (MAs) — key indicators of long-term trends — demonstrate a bullish crossover, with shorter-term MAs traversing above longer-term ones, signaling ongoing upward momentum.\n\nSpecifically, the separation between the 50-day and 200-day moving averages is widening, a classic confirmation of a strong trend. However, this separation could also precede a long-term correction, particularly if it continues to expand without price consolidation. Additionally, descending volume accompanying recent price spikes raises concerns. Robust volume is a hallmark of sustainable price movements, and without it, the likelihood of a retracement increases.\n\nAdvertisement\n\nGiven these factors, mid-January 2024 stands out as a pivotal moment for Ethereum. Should the current momentum persist, and if volume picks up to validate the trend, reaching $2,500 is possible. This projection assumes that the current support levels hold firm and that buyer interest continues unabated.\n\nHowever, investors should heed the warning signs. The descending volume is the primary indicator to watch after as it may bring some issues and cause a drop of momentum in the future. Moreover, the potential for a long-term correction looms if the market perceives the price has outpaced fundamentals."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQMDdpaHZCUXNFSjlaM3VhV25LUURYUjhZdkwxYVRxT3VzUFFETkRjUmplczVkSzUyVHd4UXRJMVVBZ3BYcWVDZm9aUC1TNzN5RjFodXZ0YnFKc1ZFalJZT0l0STAzRmo3Q3dZVTU4UWlRRm9OZDgyUDVweUg3X0d2WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "2 Stocks to Watch as Ethereum Shows Promise for 2024 - Yahoo Finance",
        "content": "While Bitcoin (BTC) has had a great 2023, so has Ethereum (ETH), the second-most traded and recognizable crypto coin in the world. Ethereum is known for its uses as a blockchain-powered, open-ended decentralized software platform and has risen 89.4% in value as of date in 2023.\n\nThe crypto behemoth has paved its path to winning over new customers by making a significant update this year, known as the Shanghai Upgrade. Under this upgrade, ETH shifted its blockchain validation system from proof-of-work to proof-of-stake and marked one of the most significant developments in the relatively short history of cryptocurrency.\n\nIn the proof-of-stake system, miners of Ethereum will rely on Ether holders, who will act as validators, thus lending more assurance to the system. In essence, proof-of-stake allows holders of Ether to lock up their funds as collateral to validate transactions and create new blocks, reducing the need for extensive computation and energy consumption.\n\nPowered by this development and what promises to be a significant 2024 for cryptocurrency, analysts around the world have turned bullish on it. There is a consensus that ETH might outperform BTC in 2024 with regard to growth rate and will gain more market share based on its proposals to reduce transaction costs and boost the number of transactions per second. In fact, its planned upgrade, called EIP-4844, might ensure that transaction costs could fall to as low as $0.01.\n\nPer Bitwise Asset Management, the world's largest crypto index fund manager, ETH revenues could double from 2023, up to $5 billion in 2024. Also, a state of fast-rising interest rates has not proven conducive to the crypto market. However, with markets widely betting on rate hikes having come to an end and the first rate cut as early as first-quarter 2024, the crisis for crypto may have been averted.\n\nEthereum has already started to make good of the state of the market, and it might be prudent to keep a watch on stocks exposed to this open-source, decentralized blockchain platform. Here is a selection of two stocks that we believe should be tracked. These currently carry a Zacks Rank #2 (Buy) or 3 (Hold). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nAccenture plc ACN: This global system integrator that provides consulting, technology and other services markets Ethereum-based blockchain solutions to businesses to make it easier to process payments.\n\nAccenture’s expected earnings growth rate for the current year is 4.6%. The Zacks Consensus Estimate for its current-year earnings has improved by 0.1% over the past 60 days. ACN currently carries a Zacks Rank #2.\n\nStory continues\n\nCME Group Inc. CME: This company operates as one of the world's largest futures exchange, offers a wide range of derivatives contracts and provides various solutions to invest in cryptocurrencies like Ethereum.\n\nCME Group’s expected earnings growth rate for the current year is 14.7%. The Zacks Consensus Estimate for its current-year earnings has improved by 0.6% over the past 60 days. CME currently carries a Zacks Rank #3.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nAccenture PLC (ACN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQVFh1aHBTMVVkaFJkaUxvNloxQzVWb05RRGtwcUxDN1IwZURIZGdkZzRsUmxnVW5QSDNkQ1BLT0JaQ29IVlNXUU9XWjZyaUp1NE0tYTJyeHZOWGR0YktZUEZHZWFFYVlkX1dGUjVJUFRhaThkT19SQ2RWZDVkVEJrbVNCdzJlQUt2YnFaZ0ZB0gGWAUFVX3lxTE05NGpFaFlBLXczLUJXQ0s0R3M0bGFfc05sandVdEh6LVNtdExNM0VZWFhfNkIwdUdfal9pNGd1X1A3Y2dkcTE1QjBab25uYVZZaXVJUnZXZ0ZrYS1Qd1Bva3k3NENnNjlEbDN3RUtNUVcwQ2V3Q2h2VTNvOWJIVEdUMGNFdFhiQTFIa3A1R0xkWHF4cWdzQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Native Bitcoin Staking on Ethereum and Solana Could Soon Be a Reality - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThere are a few essential truths that govern accepted thinking about blockchain networks. One such truth is that, without compromises like wrapped tokens and blockchain bridges, proof-of-stake networks like Ethereum and proof-of-work networks like Bitcoin are tantamount to water and oil: They just don’t mix.\n\nNow, a new startup led by a Stanford professor and a former Dolby engineer is attempting to disprove that. Babylon, a project that seeks to allow users to stake Bitcoin (BTC) to validate nodes on a variety of proof-of-stake networks including Ethereum, Solana, and Polygon, is already well on its way to achieving its improbable-sounding goal.\n\nThe company just raised an $18 million funding round co-led by Polychain Capital and Hack VC, with participation from funds including Framework Ventures, Polygon Ventures, OKX Ventures, and Castle Island Ventures. It is also in ongoing conversations with multiple blockchain networks about integrating its services, including Polygon, a Polygon Labs spokesperson confirmed to Decrypt.\n\nHow could it be possible, even theoretically, for someone to stake BTC—actual BTC, not a wrapped token that utilizes a blockchain bridge—on a proof-of-stake network? Proof-of-stake networks like Ethereum utilize smart contracts to govern the staking process, which rewards users who deposit a certain amount of ETH with rewards accrued over time.\n\nAD\n\nAD\n\nIn return, these ETH deposits are used to validate transactions on the Ethereum network. The entire staking process represents an intricate web of if/then conditions executed automatically by a smart contract.\n\nSmart contracts, however, are not natively supported on the Bitcoin blockchain—but Babylon says it’s found a workaround.\n\nThe solution relies in part on Bitcoin’s “time lock” mechanism, which allows users to deposit a certain amount of BTC for a certain period, then withdraw it after that period without depending on a third party. But Babylon also had to find a way to get around the pesky smart contract problem.\n\n“The biggest challenge for staking is that the stake is a collateral,” David Tse, an engineering professor at Stanford who co-founded Babylon, told Decrypt. “In other words, I have to be able to slash the Bitcoin when the validator on the proof-of-stake chain is doing something bad.”\n\nAD\n\nAD\n\nTypically, a smart contract would either release collateralized funds to a staker if all conditions were met, or burn (or slash) those funds if they hadn’t been. Tse says his team has been able to replicate that process on the Bitcoin network without smart contracts.\n\n“We came up with a way to use the existing Bitcoin scripting language to effect the slashing,” Tse said. “That is the main innovation of the project.”\n\nIf Tse and his team have in fact gotten this right—he says they still have a bit of final tweaking to do on the technology—then the potential upside is enormous.\n\nProof-of-stake blockchains of all sorts could tap into the $838 billion worth of incredibly secure Bitcoin already in circulation to validate their transactions. That innovation would be an all-but-certain path to deflation for any proof-of-stake network, that would no longer have to issue so many new tokens in order to incentivize validation.\n\n“The Cosmos hub is paying about 10%—inflating the token 10%—to pay for Cosmos’ security,” Tse said, giving an example. “By bringing in Bitcoin, it can potentially lower the cost of security quite a bit, because Bitcoin is a much larger supply of capital.”\n\nBabylon won’t be able to provide its technology to any given proof-of-stake blockchain ecosystem until that blockchain’s governance gives consent. So, at the moment, the company’s vision is still theoretical.\n\nBut Babylon is, as mentioned above, currently in serious conversations with major proof-of-stake blockchains like Polygon—and also has already received the blessing of industry leaders including Polygon co-founder Sandeep Nailwal.\n\n“Babylon's vision aligns with our commitment to fostering decentralized ecosystems by offering diverse options for communities to seamlessly choose from,” Nailwal said in a statement. “We are enthusiastic about the positive impact this collaboration will bring to the wider blockchain community.”\n\nAD\n\nAD\n\nIf (or when) proof-of-stake networks like Polygon begin adopting Babylon’s novel technology, they may create new parameters for what it means to stake BTC on their chain as opposed to the network’s native token.\n\nEthereum, for example, may not require the minimum amount of BTC needed to stake on the network to equal 32 ETH, the system’s current requirement. It might also elect to offer a lower rewards return rate for BTC stakers.\n\nEven if proof-of-stake networks that eventually work with Babylon opt to make such choices, though, the demand for receiving any sort of passive, guaranteed return on Bitcoin will likely be immensely attractive to BTC holders around the world.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNMzUyc0xfOFpjTTdhRmFTMVlGVnA5UmdWeFVuTW1YN0JoMW0xUk9DTnFfUnRaZ1dRdjBKdlBiOWRLZmxPZEJYZlc5SHFwWnpiWWtSTEJvd3pfTHBGVkpES012eVlqemFTNzJPSUNXRkxDSkp4RzJGdktXU1dTVXh0YVlJakNSU25nRVhvSElqSkJEbnlQVlHSAZ4BQVVfeXFMTlBENV9MVWs4YWttOWw4cXVaVENEdUNWYlhDZDVDQ2JtSjZVb1NmZVZYZ1hNb3liT1dRaWY4anZhMUdsbjRxSWFNeXZKUV85MXpCT05EcmNhbjR2N1FXUDV5Sl9Wa1lGSzdXd0pZeDlYcVlFX1EyaWpGbV9DdWhsZ1NELUpYRkQ2c3dvUGV3aGlOa29vNEQ3ajVsaHBRWnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Casio Drops Virtual G-Shock Watches as Ethereum NFTs—With Exclusive Perks - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nJapanese electronics company Casio has launched an exclusive collection of digital art collectibles featuring its iconic G-Shock brand of watches, with a fresh set of incentives tied to the Ethereum NFTs.\n\nThe limited-edition set of 2,000 NFT art pieces in a pair of futuristic “Virtual G-Shock” designs went on sale at 10pm ET Thursday. This marks Casio's second foray into the NFT space following September’s debut of free G-Shock Creator Pass NFTs on Ethereum scaling network Polygon.\n\nOwners of the Ethereum NFTs will gain access to exclusive behind-the-scenes experiences with Casio, including a tour of the G-Shock Endurance Test Laboratory in Tokyo that showcases the durability testing the brand is known for. Collectors will also attend a roundtable discussion with designers to learn about the creative process behind the virtual G-Shock models.\n\nFurthermore, owners will receive behind-the-scenes design materials tied to the Virtual G-Shock watches, along with the first right to buy the next wave of Virtual G-Shock NFTs. Additionally, Casio has hinted at future opportunities for NFT holders to collaborate on creating new digital Casio products.\n\nAD\n\nAD\n\n“These special incentives for collectors show our passion for innovation in both the digital and physical realms,” said Oh Takahashi, Casio’s Senior General Manager of Timepieces. “We aim to deepen our engagement with the G-Shock community, bringing them into the heart of our innovation process.\"\n\nTwo Virtual G-Shock designs are available: The VGA-001 with its “balloon concept” and the VGA-002 with a “leaf spring concept.” Both imagine fantastical designs that wouldn’t be possible with traditional physical materials.\n\nThere are 1,000 editions of each available for 0.1 ETH, or nearly $230 as of this writing. Owners of the earlier Polygon passes were given advance opportunity to purchase the Ethereum NFTs.\n\nAD\n\nAD\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Andrew Hayward."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPQ04xN2N6MzdZbnZTRzhFSWtIdDJpdTljVmVWV3FkVHoyLVA1RWF2dWF5UWdFMEdHdmY5YW1wa19wNEV1SlRJdk1qNDgtRUFWVjBxUVhqdlMtTmI1QzZ1Zk52WHdGOVhERUpOMnp6V3lCV2RqU0tjLVd2czVHWjdwb1pPbnZwUdIBiwFBVV95cUxNTmplSzJwMWExUFhFM1VZelhGdm5EUjN2NEdMQUZGemlMS0dPUndZc3oydjh6MzM5VHJMOHdQUHJ1VzQ5RTNlcmhPaHhHRGZraS1PRnRybHh3UmxmOWdLNDFJQ2tBR0pLQTVlUFBhVHJEN1p1ckZuajNXOWFCSVRhTWFQVnM1M19PYlFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Peter Brandt Stirs Debate with Harsh Critique of Ethereum - CoinGape",
        "content": "In the ongoing debate of Bitcoin versus Ethereum, renowned market trader Peter Brandt has expressed significant doubts about Ethereum’s future, contrasting sharply with other market experts. Brandt, known for his blunt analysis, questioned Ethereum’s long-term viability, particularly in comparison to Bitcoin.\n\nPeter Brandt Predicts Dim Future for Ethereum\n\nBrandt, a respected figure in market trading circles, has openly criticized Ethereum, challenging the popular notion that it might soon outpace Bitcoin. He raised a fundamental question regarding investors’ preference for Ethereum over Bitcoin, which he sees as a superior store of value. His comments come amidst bullish forecasts from other market experts and institutions, including JPMorgan. These predictions often highlight Ethereum’s potential growth, especially with its upcoming EIP-4844 upgrade, also known as Protodanksharding.\n\nadvertisement\n\nHowever, Brandt’s skepticism about Ethereum is rooted in its structural and functional aspects. He specifically pointed out the high transaction fees, or ‘gas fees,’ associated with Ethereum, labelling the digital currency as inefficient. These fees, in his view, severely detract from Ethereum’s value as an investment asset. Furthermore, he controversially suggested that Ethereum might lose its relevance entirely within the next decade.\n\nEthereum’s Fate Tied to Key Price Level\n\nBrandt’s stance starkly contrasts with other leading analysts like Raoul Pal, who have a more favorable outlook on Ethereum. Despite differing opinions, Brandt acknowledged his respect for these analysts but did not waver from his critical perspective.\n\nIn his analysis, Brandt emphasized the importance of the ETH/BTC price chart. He pointed out that Ethereum’s future could hinge on its performance relative to Bitcoin, specifically if it manages to maintain above the 0.04803 level. Should this level hold, Brandt conceded that the “imminent funeral” for Ethereum could be postponed, albeit temporarily.\n\nThis isn’t the first time Brandt has expressed skepticism about Ethereum. In previous statements, he has questioned its decentralization and even referred to it as a “piece of crap” cryptocurrency. His consistent critique of Ethereum has been a topic of discussion in trading circles, influencing perceptions among investors.\n\nRead Also: Ethereum Price Prediction As Bull Trap Puts $ETH At Risk of 12% Drop\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPT0RLZTFsekRFajVINlA2SjFYeVp6MlJsMFhSVWZRTUxyNzMzTXVMZ2NzbS1hSlRwdDhBaTdmeGRnNkxBWHoyUlpRMUVQRVhRSFVWVnE3UjEweVFXc1JtN21vYXMxMFI3ajZnLXNiUHZ0dG9ZZDZJQk9rVm4zLS1xb3hGZVZyUDJvQVRNdHRR0gGTAUFVX3lxTE5kcElpc1JEYnNCejQxdjFMMmhzTWoydERsc1RFVGxtUmxKWU9OUUhoMjhrdVhoZkZNSEltQ1BuaWQ2M3NiQ2h4THYxSFVlbTdScGFTZElZaTJHYWtnLWtZQlVqSFM3WVN2TlhRZlc3Q2ZrS2tzbFFlUU1lYkk2blozcG1OSDhPcUR4cnBycHk0VTNPcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Crypto for Advisors: ETH Staking in 2024 - CoinDesk",
        "content": "Furthermore, the creation of interest rate swaps (the largest derivative markets in the world) could allow users to swap fixed and floating liabilities, making fixed-rate products possible – as we see with mortgages in traditional markets. Introducing interest rate swaps in DeFi would not only unlock fixed-rate products, but could open up a floodgate of new participants ranging from sophisticated speculators to institutions and retail investors."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNYWFaSlg4VGIwM0JWd0Q0d2dMMGhRSFYtdi1YUENPQWVvOU1BX2FtbFR4ZXhGSy1URGQtLUE2aERwR0czTXgxMFBWVTQtTk14X0IyeEJReVNDdG5Ub0FRVFZMOWhMUmRxRnEtTzJWYUd0X0NyS0xaa3dsdm5FOWRZQTV6RGJCSTlMcEsyX25mODRXd2daMEVSXzhZazRkZzFSZElVVTBRUTVPUdIBrwFBVV95cUxQdWtFVUZ3QnlFX3dBanJ6UHFyOEI4TWx1S01nbTZzZ3g0VTdhQmhvQUZRaF9Mb3pBd3RkYmNUN1c5WUxwVVFWdHJxRHlJUmxjX0R5ZkNuUXhDZl85OEtPcWlNeXlXbUJhaUlrQ1RNRmdCQUJSb1J4eTNUTXhINERhOU1wa0I4dkdOU2c4dVhXNldVV1JGaFRZekQwVGt4ekNjejdabzVBdXowb0szM3Zz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin Proposes ‘Enshrined zkEVM’ to Address Ethereum’s Layer-2 Challenges - CryptoPotato",
        "content": "Vitalik Buterin, Ethereum’s co-founder, has proposed a new concept: the “enshrined Zero-Knowledge Ethereum Virtual Machine (zkEVM).”\n\nThis initiative aims to enhance the efficiency and security of Ethereum’s Layer-2 protocols, particularly optimistic and ZK rollups, which are crucial for the network’s scalability.\n\nVitalik Buterin’s zkEVM Layer-2 Solution\n\nIn a recent blog post, Vitalik Buterin highlighted the evolving strength of Ethereum’s “light clients.” They are set to improve, soon being able to use zero-knowledge cryptography for verifying transactions on the primary chain.\n\nThis development, Buterin notes, will effectively integrate a zkEVM into Ethereum, leading him to propose its potential use for rollup protocols as well.\n\nEthereum’s Layer-2 protocols are crucial for the blockchain’s scalability but rely heavily on EVM verification. The current method has a large and potentially vulnerable codebase, which creates several challenges.\n\nzkEVMs, designed to replicate the Layer-1 EVM, struggle to keep up with updates in the Ethereum protocol, leading to duplicated efforts and increased security risks.\n\nA post on benefits and challenges of enshrined ZK-EVMs at layer 1:https://t.co/bRTKdtaFRL There’s different options and the tradeoffs get complex! — vitalik.eth (@VitalikButerin) December 13, 2023\n\nAddressing these issues, Buterin suggests embedding a zkEVM directly into the Ethereum blockchain. This internal zkEVM would take on the task of verifying Layer-1 Ethereum blocks, offering a more efficient and secure approach.\n\nButerin envisions the proposed zkEVM’s main focus on verifying Ethereum blocks by processing inputs like a pre-state root, a block, and a post-state root. This ensures the integrity of the post-state root as a true outcome of block execution.\n\nAccording to Buterin, Implementing the zkEVM presents several design challenges and trade-offs. It requires compatibility and adaptability to support various proving systems, reflecting Ethereum’s multi-client environment.\n\nIt’s also essential to provide data availability to satisfy different clients while ensuring auditability and upgradeability for easy inspection and quick issue resolution without hard forks. The system must also support innovations in ‘Almost-EVMs,’ permitting Layer-2 solutions to extend and innovate upon standard EVM functionalities.\n\nButerin also advocates for an open system, where proofs are verified externally, for its flexibility and compatibility with Ethereum’s core values despite its higher complexity.\n\nSpeed is also a critical aspect of zkEVM implementations. The objective is to reduce the proof generation time, enabling near-instantaneous processing using technological advancements in parallelization and hardware acceleration.\n\nPotential Impact on Layer-2 Projects\n\nButerin’s proposal could significantly impact existing Layer-2 projects like Polygon, Matter Labs, and Scroll, which have invested heavily in aligning with Ethereum’s earlier roadmap.\n\nButerin, who has for years pushed Ethereum down a “rollup-centric” roadmap, has assured that Layer-2 networks will continue to play an essential role, responsible for functions like fast pre-confirmations, MEV mitigation strategies, extensions to the EVM, and user and developer conveniences.\n\nHe notes that these teams are crucial in attracting users to their ecosystems and are compensated through capturing MEV and congestion fees within their networks. This relationship is expected to continue under the new plan."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQcWE5Y2UzQ3pjWmNtbFZTY0NyREZTdWNfei1GazRJaURSak9INTJWalFwc0hVX2ljLVVDYmtSUnQ4SlhudThDM3ZtVXRYbVk5cWlmVXcwbXFuSTRsLUdueWtqOHd0TFA1bTl3NHNyUXA2eEtNYUVFZmcwaF8tLXZkcXFNaG5nb0JrTGMxSmRjYUxXV2RYUG50MUUydHhJSFpmckZ4ZjIzLXZTdkZwbVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Welcome $19.7 Billion Inflow; Implication for Price - The Crypto Basic",
        "content": "Bitcoin (BTC) and Ethereum (ETH) have welcomed massive capital inflows, a move that can greatly impact the prices of both coins.\n\nAccording to insights shared by top market analyst, Ali Martinez, a total of $19.7 billion flowed into Bitcoin and Ethereum today. He posited that the last time this enormous capital entered the market was in December 2020, a period when the price of Bitcoin grew astronomically from $18,000 to $65,000 respectively.\n\nBitcoin and Ethereum are bullish at the moment. While Bitcoin is priced at $42,455.71, up 2.64% in 24 hours with a market cap of $830,279,319,394, Ethereum has grown 3.83% to $2,268.96 atop a market valuation of $272,882,507,263. With volatility high for both coins, trading volumes are considerably elevated.\n\n- Advertisement -\n\nDynamic Shift in Capital Inflows\n\nThe chart shared by the analyst showcased the interesting twist in the coins’ flow balance. According to the chart, as of December 11, 2020, when the price of BTC was $18,079.31, the coin’s positive 30-day Capital inflows came in at $22,244,699,464.21, while the Negative 30-day Capital Outflows stayed unchanged at $0.\n\nThe data at the time also showed that the BTC and Ethereum Net Position Change was $19,598,379,734.19, while the stablecoin Net Position Change was pegged at $2,646,319,730.02.\n\nShortly after the market recorded these figures, the price of Bitcoin rallied to the all-time high of $69,000, represented by the dark lines on the chart displayed by the analyst.\n\nAt the moment, similar statistics are visible with the Positive 30-day Capital Inflow coming in slightly higher at $22,343,091,198.64. Should history choose to repeat itself and BTC decide to trail a similar path as the 2020 cycle, achieving many of the conservative price targets above $100,000 by some market experts may be feasible.\n\nBitcoin ETF Catalyst\n\nThis data insight comes at a time when the broader digital currency ecosystem is getting set for the emergence of a spot Bitcoin Exchange Traded Fund (ETF) product.\n\n- Advertisement -\n\nWhile the United States Securities and Exchange Commission (SEC) has not given a green light to the numerous applications on its desk, the hype is high considering the positive communication between the regulator and some of the applicants.\n\nShould the SEC approve the product, it might usher in billions in capital into the market, a move that will also impact price surge."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE1fRVhpQ1NzWlJ4WXV4LWo0akZIbFNSZC1mT3dvQmp2ZEM2NXBYbWMzLTlCUEpCenZwNmY3M3hZNUJ5TTB2RDFqZkFrQlhtUG9YaUlHdkdHcnAtSndaU0JqTnBfWDlERFA0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Ether Price: Will Ethereum (ETH) Go Back Up? - CoinGape",
        "content": "This week has seen significant volatility in the Ethereum price (ETH), the second-largest cryptocurrency in the world by market value. For the first time in the previous week, the decline caused the coin’s price to drop below $2,300, and it has since been trending down.\n\nEven though the overall crypto market is beginning to recover a little, it is still unclear what caused the collapse. Given that investors are closely monitoring economic indicators, there are several potential explanations for this decline. Let’s dive deep into the possible causes of the latest sell-off in the cryptocurrency market and explore how Ethereum’s price can make a recovery.\n\nadvertisement\n\nCrypto Market Fall: An Overview\n\nFor the majority of cryptocurrencies, 2024 got off to a good start. Most cryptocurrency tokens started recording from December 2023 and continued their price rally in the first month of this year. Nonetheless, in comparison to their all-time highs, cryptocurrency prices are still trading at bargain.\n\nMoreover, the first half of 2023 has seen a wild ride in the price of cryptocurrencies. However, the last part of the latter half of the 2023 showed a promising signs for an upcoming bull market in 2024. But the question, will cryptocurrencies soar to new heights and fully overcome their losses in 2024?, remains on the back of the mind for all crypto investors.\n\nWhy is the Ethereum Price Falling?\n\nBefore going to the questions raised above, the majority of crypto enthusiasts want to know the reason behind the fall in Ethereum’s price. This question becomes the talk of the town. Moving forward to the exact reason, several crypto-specific as well as other factors led to the decline in Ethereum’s price.\n\nThe entire crypto market is in red as of January 2024. Contrary to what investors believed, the Bitcoin price dropped by 20% after Bitcoin ETF approval. The market price trend movements of Bitcoin always have a direct impact on the price movements of altcoins, including Ethereum.\n\nAdding to the ongoing bear price trends in the market, Celsius moved massive ETH holdings to exchanges, further causing the Ethereum price to drop. Around $35 million worth of ETH was moved from Celsius staking wallets to crypto exchange platforms like Coinbase and FalconX. This is also one of the major reasons behind the ongoing price drop of Ethereum.\n\nWill Ethereum Price Make A Recovery?\n\n“Will Ethereum recover?” is a question that is currently making waves. There are numerous expert views present on the topic. But no one has the exact idea about the same. However, it depends on several factors.\n\nThe precise course of Ethereum’s recovery is still difficult to predict, though, since different projections point to both possible ups and downs in the near future. The comeback of Ethereum is dependent on a number of factors, including general economic conditions, technological developments, and market patterns. After the fall in the price of Ethereum, a lot of analysts are still positive about the cryptocurrencies long-term prospects.\n\nWhat Factors Can Drive Ethereum’s Price Up?\n\nAs we all know, Ethereum is a utility token. So, Ethereum’s price is affected by a mix of general and crypto-specific factors in addition to the price of Bitcoin and other macroeconomic variables.\n\nHowever, the price of Ethereum is largely determined by supply and demand. Since ETH is now a deflationary utility token, its price may rise in the coming months due to growing scarcity and rising demand.\n\nEther Price Prediction: Will Ethereum Reach $10,000?\n\nEthereum is well-known in the cryptocurrency world and is one of the top platforms for smart contracts and decentralized apps. Investors are curious as to whether Ethereum can ever hit the incredible $10,000 price threshold.\n\nTherefore, although it is appealing to think that Ethereum might hit $10,000 in 2024, a realistic study indicates that this is a very unlikely possibility. The necessary price increase, the market capitalization at the moment, and the aftermath of the previous bear market provide formidable obstacles for Ethereum to clear in a short amount of time. Investors should use caution when making price projections and take into account the market’s inherent volatility and unpredictability.\n\nIf we look at the price of Ethereum over the previous five years, it has gone through significant fluctuations. The ups and downs include the record bull run of 2017 and the bear market that followed in 2018. By going through the data, you can find out that the cryptocurrency has the potential to appreciate in value significantly, as evidenced by its recent surge in 2021. However, there is always a chance that Ethereum will hit $10,000 at some point in the future, and it is very difficult to believe that this will happen within the next six months or in 2024.\n\nConclusion\n\nThe Ethereum bull run clearly shows that the price of ETH is maintaining above-significant support levels and breaking through important resistance zones. However, how the market responds to these technical indications will determine the course of future price movements. Will Ethereum recover and reach $10,000? might have a positive response if it manages to breach the resistance encompassed by the YTD high. Investors must, however, keep a careful eye on these levels because they are a guide, not a magic bullet."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQU1o2RjJBU0J2dF9KVTdLVV9iT21xUUpFVjNmUU9SWk5RU0JsUXAzSTItVlR0T21DNVNyVjc4SDNiaXZqZ2ZJVzBVVEFUZlhybjNxcWJONk9iRDRQdEhpbG9PUlhfV3c5VlUwekVmWkU4a1FNNDY4VGIwR2twaTI4dmpn0gGHAUFVX3lxTFAxMnkxcXpNdmVrZGVjS2JLd1p1d2tjN1ZGVzhJdlc3bmNIZWJ6bjZSLXdIeXJ6SlBKWUJwMmo2RGtfaWZCNTVybXZPS1doMzVKcDZpVzB4U1M0bllYRzBZeUF3NjdJdG5DMFZLTTBQT1dkUkFMWm5WSkJXeW9HSXduZVlaV0dhVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction As Post-Correction Rally Sees 15% Jump Ahead - CoinGape",
        "content": "Ethereum Price Prediction: The cryptocurrency market witnessed a surge in volatility as the digital assets Bitcoin and Ethereum entered into a minor correction. This pullback has plunged the ETH price from a recent top of $2400 to $2238, registering a 7.4% loss. However, this retracement lies within the range of a rising channel pattern and projects the recovery is intact.\n\nAlso Read: Peter Brandt Stirs Debate with Harsh Critique of Ethereum\n\nadvertisement\n\nChannel Pattern Hints Next Jump Above $2500\n\nA channel pattern leads the current recovery trend in the ETH price\n\nUntil the pattern’s lower trendline is intact, the coin holders can enjoy the bull rally\n\nThe intraday trading volume in Ether is $10.2 Billion, indicating a 78% gain.\n\nSince mid-October, Ethereum (ETH) has shown a robust recovery, beginning with a rebound from the $1522 support level. This rally is best understood through the lens of a channel pattern, characterized by two ascending trendlines that have been providing dynamic resistance and support to the price movements.\n\nOn December 13th, the Ethereum price marked its latest recovery from the lower trendline of this pattern, evidenced by a morning star candle formation. This reversal propelled the price to its current level of $2243, signaling the onset of a new bull cycle within the confines of the channel pattern.\n\nIf the ETH price continues to adhere to the trajectory set by this channel pattern, we could see a 12-15% surge, potentially reaching the upper trendline in the region of $2500 to $2600. As long as these two trendlines remain intact, Ethereum is likely to maintain its upward trajectory, albeit with minor pullbacks along the way.\n\nHowever, a breakout above the channel’s resistance could significantly amplify buying momentum, potentially leading to a more substantial recovery. In such a scenario, initial targets could be set at $2730, with a further potential rise to $3260, marking key milestones in Ether’s bullish journey\n\nCan ETH Price Fall Back to $2000\n\nWhile the current market outlook for Ethereum price seems strongly bullish, the rising channel pattern in a strong rally can commonly lead to a decisive breakdown from the lower trendline. This breakdown would likely intensify the selling pressure and trigger a significant correction in ETH price. Thus, under the influence of this pattern, the Ethereum coin may revisit $2000 coin again\n\nBollinger band: Despite the current retracement in the upper boundary of the Bollinger band indicator , indicates the recovery momentum is active.\n\nRelative Strength Index: A lower high formation in the daily RSI slope reflects the weakening of buyers’ strength in the market.\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQd1NmOU1sNGxTeHpaTTBiTWxqX2pRMjB3RGI1dmtzdFF6MTI4eDUtVkFrWXVNZ2F3Q2liVGQwRkZHU2V5NUprdVZ6MFFoNExocjRQaXFWQncxV3d2Ujh6bF9acHZtVm1Xc3VqSXp0S0FzTkVFMEJkYnFHT3l4dUxsZG1HT2hlVVRXZDctZjk0dVFIcThOSXhuRC14OGFBZDhmRU5n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum: Vitalik Buterin Explores Direct L1-L2 Integration via ZK-EVM - Cointribune EN",
        "content": "Fri 15 Dec 2023 ▪ 3 min read ▪ by Ariela R.\n\nVitalik Buterin, co-founder of Ethereum, explores the nuances of Layer-2 solutions in a visionary article. He particularly emphasizes the current dependency of L2 solutions on the main EVM. He also discusses the possibility of directly integrating native ZK-EVM on Ethereum’s Layer 1 (L1). The details!\n\nVitalik published an article discussing the current L2 EVM solution heavily relies on the mainnet EVM, and whether it would be possible in the future for the built-in ZK-EVM on L1 to be directly used by Rollups. He also described several possible implementation versions, explored… — Wu Blockchain (@WuBlockchain) December 13, 2023 Vitalik Buterin explores new approaches to boost the performance of the Ethereum blockchain\n\nVitalik wants to redefine Ethereum L2 with ZK-EVM\n\nAbout a month ago, we discussed the impact of backdoors on Ethereum rollups. Now, Vitalik is questioning the current dependency of L2 solutions on Ethereum’s main EVM.\n\nIn an article published on December 13, Vitalik Buterin indeed proposes a bold reflection aimed at transcending the existing limits of Layer-2 solutions. Currently, these solutions are tightly dependent on the Ethereum Virtual Machine (EVM) of the main network. However, Buterin envisions a transition towards a more direct integration with a native ZK-EVM.\n\nThis proposal raises fundamental questions on:\n\nthe current design of Layer-2 solutions,\n\nthe challenges inherent to such a pronounced dependency.\n\nExploring these implications offers insight into potential changes in how Layer-2 protocols interact with the Ethereum blockchain. This paves the way for more flexible and efficient solutions!\n\nThe envisioned versions of ZK-EVM\n\nThe potential evolution towards a dedicated ZK-EVM presents significant strategic and technical implications. In his article, Buterin precisely explores the reasons behind these choices. Also, he offers an in-depth perspective on how this technology could revolutionize the way smart contracts are executed on the Ethereum blockchain.\n\nThe multi-client philosophy in the context of EVM verification emerges as a central element of Vitalik Buterin’s discussions. He explores the advantages and disadvantages of multi-client systems, classifying them as “open” and “closed”. The crucial question is whether a multi-client system can provide a more resilient and decentralized solution.\n\nVitalik’s innovative ideas thus pave the way for a more transparent and robust Ethereum ecosystem. By inviting the crypto community to embrace innovation, direct ZK-EVM integration foretells a promising future for Ethereum’s blockchain technology.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiWEFVX3lxTE96QV94Qjltdzd4WnVuY0gzcjZmQkx5R2R2QnFxaERLTEIwenczSTRzVDJKV1BGYTdDRHhaM1hRekszVXR0c0pKMGlfbkNKSm52bVJOSE1BYjPSAV5BVV95cUxOc1IxQWE3bUNKOGFJcktNeEdCRWRILWM1N2FaUjd6T05UQkRmZFl4NjAxeXlLenkwNlZCZzBHYjIzQ3drTjExN2RxX25udXRGRGdSYkg4MWdlb19BTUx3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Collect Ethereum and Reap Rainbow Wallet Rewards - NFT Plazas",
        "content": "Collect Ethereum and Reap Rainbow Wallet Rewards\n\nIn the dynamic world of cryptocurrencies, Rainbow is emerging as a unique wallet that not only simplifies crypto journeys but also rewards individuals for their on-chain activities regarding Ethereum.\n\nBy introducing a reward system that celebrates individuality and engagement in the Ethereum ecosystem, Rainbow innovates the way users interact with crypto. The process is straightforward: garner Ethereum and earn Rainbow Points to open rewards. Yes, it really is that simple.\n\nWelcome to Rainbow Points — the first step towards including our community in the future success of Rainbow Every Ethereum user has been dropped points today 🌈 Claim your points and start earning more by doing the things you already do onchain pic.twitter.com/UsUOOGxC0b — Rainbow (@rainbowdotme) December 12, 2023\n\nDelving into Rainbow’s Rewarding Experience\n\nThe beauty of Rainbow is its inclusivity. Users that have Ethereum with any wallet will already have points waiting for them. To receive them, users must download the Rainbow Extension from their browsers or the Rainbow Mobile app for on-the-go access.\n\nRainbow’s point system rewards numerous activities:\n\nSwapping assets : Earn points by using Rainbow’s swap feature.\n\nBridging assets : Points are awarded for utilizing Rainbow’s cross-chain bridge.\n\nReferring new users : Invite friends to join Rainbow and earn more points.\n\nCollecting and holding : Accumulate points by holding assets.\n\nMinting in app : Engage in app-based minting and trading.\n\nPartner rewards : Look out for upcoming partner-based rewards.\n\nInterested? Then keep in mind that users who are dedicated to using the platform or own Rainbow NFTs are eligible for extra points. And those that switch from MetaMask to Rainbow — especially using MetaMask’s swap feature — can earn up to 150,000 additional points.\n\nTo keep in the loop with Rainbow, the platform keeps its community updated through its social media channels, where it announces point drops based on on-chain activity. It distributes points every Tuesday at 4.20 pm (ET), ensuring a regular influx of rewards for active users.\n\nRainbow Points are just the beginning. This innovative approach to rewarding users is set to expand, bringing more fun and engagement to the Rainbow community. As more points are accumulated, more exciting opportunities and experiences are unlocked. So, start earning while enjoying the vast possibilities of Ethereum.\n\nWant more? Connect with NFT Plazas\n\nJoin the Weekly Newsletter\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram\n\n*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNeWNJd1hURzVyN1dILUx2Z2FZTWlGNUNDZk5jTmRvSUlzN2YxUzUxVThzYl9fWU8tUTVtc3AwVExnbGZ0UmsyQVhXdG5mb2pYNHVQUFhqYjhtVWVqSVNCSnRkcGhKWU1NZVd3T21LQ05vTFAxZ3VnMmhmcHAwYk9ELUtzSENRQm5Hd2FIZGZmMXYwYm5wdkJRdmE2R2MyQWg0RWdsZzJUWTJPUHFpMmxRMVdsMkRzZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Ghost Chain? Cardano Beats Bitcoin and Ethereum as It Leads in Chain Activity - The Crypto Basic",
        "content": "Cardano is constantly beating the “ghost chain” claims, recently outperforming all other networks, including Bitcoin and Ethereum, to top the list of blockchains in chain activity.\n\nData from crypto-focused research and analytical resource Messari confirms this feat. According to Messari, Cardano currently leads in terms of chain activity over the past 24 hours. Notably, the metric employed by the platform to gauge a network’s chain activity is its on-chain transaction volume.\n\nThis metric shows that Cardano beats every other mainstream blockchain network by an impressive margin. Interestingly, Cardano’s 24-hour on-chain transaction volume currently stands at $23.56 billion. Notably, this represents all the transaction volume recorded yesterday.\n\n- Advertisement -\n\nBefore now, Cardano’s on-chain transaction volume averaged $9 billion every day throughout November. However, the network started witnessing an uptick in December, surging to a high of $11.32 billion on Dec. 2. This uptick persisted, with Cardano recording $29.86 billion on Dec. 9.\n\nDespite witnessing a drop in the days that followed, Cardano has maintained an intraday on-chain volume above the $18 billion mark. The recent $23.56 billion was recorded due to a new upsurge in this metric.\n\nMeanwhile, per Messari data, Bitcoin, the leading blockchain network, comes second on the list, with $13.09 billion in on-chain transaction volume, nearly half of Cardano’s figure. Ethereum, the largest smart contracts network, secures third with just $5.06 billion in transaction volume.\n\nLitecoin sees a volume of $1.51 billion, while the XRP Ledger’s volume only stands at $777 million. Other blockchain networks on the top ten list include Dogecoin, Tron, Bitcoin Cash, Verge, and Stellar.\n\nWhy Does This Matter?\n\nIt bears mentioning that on-chain volume is different from trading volume. Trading volume refers to the total number of shares, contracts, or assets traded on a specific market, especially on exchanges, during a given period. It is typically a measure of market activity and liquidity.\n\n- Advertisement -\n\nOn the other hand, on-chain transaction volume involves the total number of transactions that occur on a blockchain. It includes all transactions, whether they involve trading, transfers, or other interactions within the network. On-chain transaction volume provides insights into the level of activity and usage of a blockchain.\n\nA high on-chain transaction volume indicates active use of a blockchain for various purposes, such as transfers, smart contract executions, and dApp interactions. This metric helps to evaluate the health and sustainability of a blockchain network, showcasing its utility beyond speculative trading.\n\nAmid the increased on-chain transaction volume, ADA, Cardano’s native token, has witnessed an impressive price surge. ADA recently surged to a 19-month high of $0.68 today before facing opposition. Currently changing hands at $0.6349, the altcoin is up 42% over the past week."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNYlRmbGNvd29tTC1GemgteFpoYTE3QUZ3eDBsSGRfNVVodFNZOThsMVUwaElodWJwTDEydmVLNFR1Q1gzaG5WUTc1RTJkLTI4dXFSSmRKN1dhY1ZzSkVJRkl0MG9hbkhWWVF2S1JhZ09yNXBnX01qc3FRb2I3SWJ6RWx3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Smart Gas (VSG) launches on Ethereum Chain. Embark on the Revolution of Layer 2 Smart Chain with $VSG - Yahoo Finance",
        "content": "Vitalik Smart Gas\n\nCalifornia City, CA, Dec. 14, 2023 (GLOBE NEWSWIRE) -- VSG proudly announces the launch of Vitalik Smart Gas (VSG) , a pioneering gas token designed exclusively for the revolutionary Vitalik Smart Chain (VSC) – Layer 2 (L2). This momentous launch signifies a significant stride forward in the evolution of blockchain technology, presenting an unparalleled opportunity for early adopters to immerse themselves in the ground-breaking VSC L2 ecosystem.\n\n\n\n\n\n\n\nAs trailblazers at the forefront of the development stage of this cutting-edge chain, VSG extends a distinct invitation to individuals, investors, and enthusiasts to participate in the foundational phase of an L2 chain token. This launch heralds a unique chance to carve a definitive position in the imminent evolution of blockchain technology.\n\n\"Today marks a watershed moment in the blockchain landscape as we introduce Vitalik Smart Gas (VSG), the dedicated gas token for the ground-breaking Vitalik Smart Chain (VSC) L2,\" stated Whittaker, the community developer. \"With this launch, we invite forward-thinking individuals to seize the opportunity and become catalysts in the transformation of decentralized systems.\"\n\nVitalik Smart Gas (VSG) launch highlights:\n\nIntroduction of VSG, the gas token designed exclusively for the VSC L2 ecosystem.\n\n\n\nA pivotal moment to engage and contribute at the genesis of an L2 chain token.\n\n\n\nOpportunity for investors and enthusiasts to secure their position in the future of blockchain innovation.\n\n\n\nParticipation in the VSG launch signifies more than an investment opportunity; it represents involvement in a community-driven ecosystem committed to scalability, efficiency, and technological advancement.\n\nFor detailed information regarding VSG and how to engage with the VSC L2 ecosystem, please visit the official resources:\n\nWebsite: https://vsgofficial.com/\n\nTelegram: https://t.me/vsgportal\n\nTwitter: https://x.com/VITALIKL2CHAIN\n\n\n\n\n\nJoin us as we embark on this transformative journey with the Vitalik Smart Chain (VSC) L2 and its dedicated gas token, Vitalik Smart Gas (VSG) .\n\nFor media inquiries or additional information, please contact\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, or intended as investment advice, financial advice, or trading advice. It is strongly recommended that you practice due diligence (including consultation with a professional financial advisor) before investing in or trading securities and cryptocurrency.\n\n\n\n\n\n\n\nCONTACT: Aditya Roy VITALIK SMART GAS contact at vsgofficial.com\n\nStory continues\n\n\n\n"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxPa2dNSHFOSU42bE1EVG1ZVUpvWWE0ZUxYQ0pCQjhkX3VlNDRCRlZPVnFPXzBhQVV3WmZhdDI3a2dRdk40ZW44SlpCeWxjcmtUTC1Fc2hVS3UzS0JuZ3RGaHlpdnVSeHlSSVVCZ3Y5WktJZUdOcnAzb3QwaDlkWU5ibjJhTUhURDlFRlMyTnJNWUNXMFB3a3Y4RnFKcjdjaXM5NWtnaUpEaldwY0RvbjZOQmczbFNvYlhabmlrZUpNV2F1X1hzeVNLSEV5V1lzY1B6aWlGUVgxUlBnbUVhc1HSAeMBQVVfeXFMTXBLMkV3c3Y4ZUxmN0JiUUxOSzZDdy05Qk5rbGpGMEFUWWFUaHRwLXVxYVNscmU4cGVzTWFNMy1LQ0EzNnB4WjQwN05kLUZ0RURBLUZFNXVvX3FLQUNBTVh4QnJUM0JVZkE5cTk2OGtfd0dLVGowUDFqa185TGYtdEFFdlRhT1JZTmZQNjBNYm14Y1Zoa0RxbmtyTlJTVXpLbE9UOV9jYnFGanVzcHBIQXoxZXUzSF90Xy1nNE5EenllRS02UERXdTBUX2xxYi1jbkx1WWFJZVpsa1dtMjN5bnBUMVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum price likely to outperform BTC says JP Morgan report, but short-outlook remains flat despite ETF hype - FXStreet",
        "content": "Invesco Digital’s Ethereum spot ETF’s approval is delayed.\n\nEthereum price is likely to hover between the $2,030 and $2,539 levels for the next few weeks.\n\nOn-chain metrics note a decline in user activity, which could add headwinds to the uptrend.\n\nEthereum (ETH) price is likely to overshadow Bitcoin price performance in 2024 said JP Morgan analysts in a recent note. Ether traded in the $2,400 region after nearly three weeks of consolidation but this uptrend seems to have lost momentum as Bitcoin price takes a hit this week. Despite the Bitcoin ETF approval hype, ETH continues to remain largely neutral as other altcoins outperform Ether. In the near future, ETH is likely to slip into sideways movement due to a few reasons: a slump in on-chain activity, a delay in ETF approval from the US Securities and Exchange Commission (SEC), a fast-approaching holiday season, and a lack of momentum to push Bitcoin price higher.\n\nAlso read: Ethereum revenue could double to $5 billion and fee may fall to $0.01 in 2024: Bitwise prediction\n\nSEC delays Ethereum ETF\n\nAs noted by Bloomberg Analyst James Seyffart, the Commission has decided to delay the Invesco Galaxy Ethereum ETF. The analyst adds that “this was early but completely expected.”\n\nUpdate: SEC delayed @InvescoUS / @galaxyhq Ethereum ETF application -- This was early but completely expected. (Wasn't due until Dec 23rd I think) pic.twitter.com/jFCjnND3Rf — James Seyffart (@JSeyff) December 13, 2023\n\nInvesco and Galaxy Digital filed for an Ether spot ETF in September, but like Bitcoin’s ETFs, Ether’s is likely to be delayed before the SEC gives a decision. Additionally, the Commission remains unclear on its stance as to whether Ether is a security or a commodity, which makes the approval of an Ethereum ETF highly speculative.\n\nRead more: Hashdex tips spot Bitcoin ETF s to trade by Q2, followed by Ethereum\n\nEthereum price remains neutral-to-bullish\n\nEthereum price action between June 2022 and November 2023, created an ascending triangle setup. This technical formation is a bullish pattern in which the asset price creates higher lows and equal highs. In Ether’s case, three distinctive higher lows and three equal highs formed.\n\nConnecting the equal highs shows a horizontal resistance level at $2,030. This level was broken on November 20, indicating the upside potential of the pattern was activated. The ascending triangle setup forecasts a 43% upswing to the $2,943 level, obtained by measuring the distance of the widest part of the triangle and extrapolating it higher.\n\nEthereum price’s breakout was succeeded by a 16% rally to a local top at $2,403. Since then, ETH has dropped 6.3% and currently trades at $2,252. Going forward, the smart contract token is likely going to move sideways between the ascending triangle’s base at $2,030 and the weekly resistance level at $2,539.\n\nA decisive flip of the $2,539 will open the path for Ethereum price to continue rising to its theoretical target of $2,943 or the $3,000 psychological level.\n\nETH/USDT 1-week chart\n\nEthereum’s Social Dominance metric has been trending lower since September 30, showing a decline in interest for ETH among investors.\n\nETH Social Dominance\n\nAccording to data from Santiment, On-chain Volumes saw a spike on November 10 but has been steadily slumping since then. The same can be said about Whale Transaction Count, which has also seen a decline.\n\nETH On-chain Volume, WTC\n\nWhile this is bearish in the short term, the Active Addresses have been in an uptrend since mid-September. Network Growth has also remained consistent, which shows that the investors are being patient about the mid-to-long term outlook.\n\nETH Active Addresses, Network Growth\n\nA decisive breakout above $2,539 could signal a bullish outlook for ETH. In such a case, the Ethereum price could eye a retest of the $3,000 psychological level.\n\nOn the other hand, a breakdown of the $2,030 support level could trigger a 15% crash in Ethereum price to $1,727."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNSGNTSmJKUUtvQVlqMGpEY2xrcTJkZ0EyUU9VQzJDR3ptQTllY1JKd09mbVRWUkcxbTBSQkFoa1JIU0JnVlZ0RG5hLUFtUjV3am0zV1FHaThESjRxU3NhYnB0SnJpdVF0TnNXdUk0dXZkb0dSSzhHSUh6dENwRXlNbWh5MC11MUNJNTlsaW1YUVk3d9IBlwFBVV95cUxOY25sM2VCWTV1WFhkSTUtMXBqaXJwaDc2V05xdy02MXVZVEN5RHl1RUpBVm5HVUVmMXpLS0tlb3c2ako1NnlKYlcySFJWZlNTZHBfNmVYVWVEaURPbGluNlRQWVZZT21rMmFpTzFDTzFvdXI3MW15UDZ5M3o4cUVZZ0pLN3V3WUZMUldmSmNObjE4SE5CbF9v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin vs Ethereum – Can one’s price outdo the other’s prediction in 2023? - AMBCrypto News",
        "content": "The ETH/BTC chart has been in a long-term downtrend.\n\nIn comparison, the strength of Bitcoin was clear and is likely to continue.\n\nSince October, Bitcoin [BTC] has rallied by an impressive 57.5% as of press time. In the same period, Ethereum [ETH] gains measured 48.34%. The difference is not much, but ETH has been underperforming for close to a year now.\n\nThis means that during times when Bitcoin runs higher, Ethereum doesn’t achieve equivalent or higher gains. During periods of a downturn, Ethereum prices suffer more than Bitcoin’s.\n\nIs this trend likely to reverse?\n\nTechnical analysis of the ETH/BTC chart underlined gloom\n\nThe ETH/BTC chart on the one-day timeframe highlighted the downtrend that has been present since early June. The inference was that ETH just wasn’t able to keep up in terms of performance. And the story doesn’t end there.\n\nThe zone of resistance highlighted at the 0.055 region represented a key resistance zone that ETH bulls will need to breach to reverse their fortunes. However, the market structure was bearish.\n\nThe 61.8% Fibonacci retracement level was tested on 10th November. It was followed by a rapid reversal.\n\nA move below the 0.051 mark would signal that ETH/BTC was headed much further lower. If that happens, traders and investors could exit the ETH market if a higher timeframe bearish market structure break occurs.\n\nAssuming Bitcoin climbs above the $45k key resistance but ETH/BTC falls, participants could look to shift their funds to BTC to ride the trend higher.\n\nAssessing sell pressure on ETH and BTC\n\nA sign that sell pressure is imminent on an asset is if we spot large inflows to exchanges. If that happens, the exchange reserve for the asset would shoot skyward. In the case of both Bitcoin and Ethereum, this has not yet occurred.\n\nThe BTC exchange reserve has consistently trended lower since June. Despite the downtrend, there was a noticeable spike from 5th December to 12th December. Just after this spike, Bitcoin prices tumbled from $43.7k to $41.2k.\n\nThe Ethereum reserves saw less volatility. It, too, was in a downtrend and has been since February 2023.\n\nEthereum saw a small spike in the reserve between 11th-13th December, but the increase came during and after the price drop. This suggested that some holders panicked due to what they perceived as a shift in trend, while BTC’s inflows preceded the fall.\n\nThe inference was Bitcoin reserves and flow could be a more accurate gauge of the next price direction than Ethereum.\n\nHowever, this was based only on the recent spike, and is not a practical finding with a large sample size. Nevertheless it is something to look out for.\n\nWhat is the sentiment of BTC and ETH like?\n\nA look at the social volume for both crypto assets revealed that, as expected, Bitcoin’s social volume was far higher than Ethereum’s. Even so, their trends were pretty similar. This could be because of their price performances being closely interrelated.\n\nWhen Bitcoin rallies, so does Ethereum, but just not as much.\n\nThe MVRV ratio for Bitcoin and Ethereum also showed similar trends, but their magnitudes were vastly different. At press time, BTC stood at 41.17% while ETH was at 26.45%.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nBoth values were at their respective six-month highs despite the recent dip in prices. The conclusion was that both assets were overvalued, with Bitcoin holders being at a greater profit, and hence, the happier.\n\nIt remains to be seen if these holders choose to realize their profits en masse and cause a large wave of selling."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQengzd255dVBtTWdLdkQzdnFZYVJhUHYzR2FmWHpCMjMxMVZMd2tTRU5nWFZWUllpcVZiTWk1bWRnRXFwdlZOb1B5c3dUVnRjLXNHYmVPZFdPS0Y5MlRQRDFYajVSd1lWbnB4aUdBUEhGN2dsUlBpcWFlbHhzQ3cxWkQ4dGJ1S1BjcWh2RjRmWHJyNnd4N1l4YzFFNG9rcXNJT1BFOFNmVEFmYTk2b0VnVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Reversal: You Don't Want to Miss It By U.Today - Investing.com",
        "content": "U.Today - is experiencing a crucial moment, facing the most significant pullback since the beginning of the bull run. This retracement is crucial for traders, with many keeping a close eye on the potential for a reversal at around the trendline support level on the . However, caution is advised, as the likelihood of a dramatic turnaround seems dim. The current market conditions and network challenges pose significant hurdles for Ethereum's immediate prospects.\n\nEthereum's price chart illustrates this recent downturn. After a period of consistent gains, ETH has encountered resistance, leading to a pullback that is stoking a mix of apprehension and anticipation among traders. The sharp decline in price from its recent highs has left investors questioning the durability of the bull run and whether Ethereum can muster the strength to pivot back to its former upward trajectory.\n\nA closer look at the price action shows has not yet exhibited the full magnitude of a reversal. One of the critical factors influencing Ethereum's performance is the support, or lack thereof, for the decentralized finance (DeFi) ecosystem built on its blockchain.\n\nUnfortunately, the network has been plagued with unstable conditions, manifesting in the form of enormous transaction fees. These issues have dampened enthusiasm for DeFi projects, traditionally one of the primary catalysts for Ethereum's demand and, consequently, its price.\n\nThe market's response to challenges has been tepid. Without robust support for the DeFi sector, Ethereum's potential for a swift recovery seems compromised. The high gas fees have notably deterred smaller investors and projects, which has a knock-on effect on the entire Ethereum-based DeFi landscape. This setback comes at a time when competition from other blockchains with lower fees and faster transactions is intensifying. However, Layer-2 networks on Ethereum might change this in favor of the second-biggest blockchain in the industry.\n\nThis article was originally published on U.Today"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPU05MeGQxQk9GTm9vM3I0NVBVYXhON2RqRGg1WmhaN1JnMGVyY050LW9RU1gxWTdRZmRRQ1dLcXMwSUg3cXRnVW5QYW1SUE1tVmJudV9tXzBZczB6aC1BclZ6QkxpMG9kTzRwNUJlaUpsTWtOdlktLVZYM2w1Z3pDOVhPOFVocDcwcEpNM2JsdlpNdFVMbzVaNDI0cTdKVEpqNmJVbVVuYk5qdEpjU2ZWdWktMlRicTJFVzBrNDA0bWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "JP Morgan Says Upcoming Bitcoin Halving is Priced In and ETH Will Likely Outperform BTC - Bitcoinsensus",
        "content": "JPMorgan Analysts Share Key Predictions and Observations for 2024 Crypto Landscape\n\nJPMorgan anticipates Ethereum’s resurgence in 2024, driven by the EIP-4844 upgrade, which is expected to enhance network activity.\n\nBitcoin’s positive factors for 2024, including the halving, are considered already priced in, according to JPMorgan analysts.\n\nDespite decentralized finance’s struggles, JPMorgan expresses cautious optimism regarding improved venture capital funding in Q4 2023, potentially signaling the end of the crypto winter.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nJPMorgan analysts, led by Nikolaos Panigirtzoglou, are foreseeing a robust comeback for Ethereum in the upcoming year. As Panigirtzoglou states, “We believe that next year Ethereum will re-assert itself and recapture market share within the crypto ecosystem.”\n\nThis optimism is grounded in the anticipated EIP-4844 upgrade, or Protodanksharding, scheduled for the first half of 2024. According to Panigirtzoglou, “The main catalyst is the EIP-4844 upgrade or Protodanksharding, which is expected to take place during the first half of 2024. We believe that this upgrade will likely prove a bigger step towards improving Ethereum network activity, thus helping Ethereum to outperform.” Analysts are bullish on Ethereum’s potential, given the technological advancements this upgrade promises.\n\nBitcoin Halving Already Priced In, Says JP Morgan\n\nJPMorgan analysts, including Nikolaos Panigirtzoglou, assert through a recent post that Bitcoin’s positive factors in 2024 are already accounted for in its current price. According to Panigirtzoglou, “And given the current ratio of the bitcoin price to production cost is around x2.0 at the moment, this would imply that the 2024 bitcoin halving event is largely in the price.”\n\nThis analysis is based on the existing bitcoin price to production cost ratio, approximately x2.0, suggesting that the impact of the 2024 halving is already reflected in the market. The discussion revolves around why JPMorgan holds the view that the upcoming halving is less likely to significantly influence Bitcoin’s market dynamics. Despite potential positive developments, the analysts maintain a cautious stance on crypto markets.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nJPMorgan Deems DeFi’s Progress ‘Biggest Disappointment,’ Cautious Optimism in VC Funding\n\nJPMorgan expresses disappointment in the decentralized finance (DeFi) sector’s struggle to penetrate traditional finance, hindering the broader crypto ecosystem’s transition. Despite this setback, there’s cautious optimism, as Panigirtzoglou mentions, “While venture capital funding in the crypto space in the fourth quarter of this year has improved compared to a rather subdued rest of the year, the improvement appears ‘rather tentative.'”\n\nThe disappointment stems from DeFi’s inability to make significant inroads into traditional finance. The examination of challenges includes the slow evolution of tokenization and the absence of regulatory frameworks. Despite these hurdles, there is a cautious outlook on the improved venture capital funding observed in Q4 2023. Analysts suggest that the persistence of this positive trend into Q1 2024 could signal the end of the crypto winter.\n\nEnhance Your Crypto Trading Skills With Our Legends’ Trading Masterclass\n\nEmpower your crypto trading skills with our Legends Masterclass. Sign up now and take advantage of our limited-time discount offer! Join the class today."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPNl9UQXh1V0Q5bHhNWDFNTFhOTEYwd3p2M0p3bmx5NGxlNzdvczNvczd0R1RGTkp4bzdrYzJjSEh5WVYyLVdDRHNHMmhyeF9KbVRuVW5ZQ0dRSGtINnJhTnR4T0kzQmlTSWx0UktzNW9lWjcwenVvZ0tkRjdpckJqZ1dRc3B3OWhRVFRMcm92MTFUUGFYazhSVjJkRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Cyber.Fund Relaunches with $100M to Boost Tech Innovation - Crypto Times",
        "content": "Konstantin Lomashuk and Vasiliy Shapovalov, two of the first investors in Ethereum, are reviving their interest in emerging technologies by “re-launching” an investment firm called cyber.Fund, which will use the founders’ capital of $100 million.\n\nCyber.Fund stated in a post to X on Thursday that “this new $100 million fund will serve current portfolio companies as well as service new projects and teams.”\n\nPost counties, “Its mission is to accelerate the transition to an open cybernetic economy by backing entrepreneurs innovating in blockchain, AI, robotics and adjacent technologies.”\n\nVasiliy Shapovalov and Konstantin Lomashuk, the founders of Cyber.Fund, both claim to have made Ethereum investments in 2014.\n\nWhen asked why now, Lomashuk explained that the drive is to advance these more recent technologies’ development. “We believe that we can accelerate the technologies by investing capital,” stated Lomashuk.\n\nA representative for the $100 million investment firm stated via email that the founders of cyber.Funds are the only source of funding.\n\nWhile new funds have continued to pour into cryptocurrency and blockchain businesses over the past year, the pace of investment has significantly decreased from the peak of the bull market.\n\nIn the meantime, interest in initiatives like ChatGPT has contributed to a surge in artificial intelligence investment.\n\n“Our aim is to create a more open, efficient and sustainable economy,” cyber.Fund stated in the post.\n\n“We believe that by working to accelerate the growth, adoption and eventual decentralization of the these technologies, the world will enter a new age of unprecedented prosperity.”"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPaUd6RG5HS2FSTm5yLUR0SWlaQWZFemtsc2RfT3VHcEowVkRVbFJ0QWZPeUhKMjhZbG0yaHQ1NzE0ZlRkb3lCZmVmMG13NmFPV2RfNHp1eGRYaG1yMmlMaHVFRVRLeDQ3ampibEFXUl9oNVZrcmk0WmJfODBJbm5aODl1alZyYi1aNGh5NXl1ejZmRDVPaUEzN0ZOOGg1VjR3ZkU4aFhnNTlhODNGMW91NDJMd9IBuAFBVV95cUxNLTVkLXUwZENqd2FRTS1wRmJBbWdzX3BZMjFOVHFERmE5dnd3eF9BRXhUX1BDWEdycFdPRUNBcWp2LWhTTXRRZWVHLW5rUElHMkRnZmQxbGlINFlrcmhnYzVxUXQ2eTRiMWVKZVNoT1NJM01KVGZIMmsyNmxHMkE1VnNuaVRDRUpJSUQyWkNXQzNzbGxDcnh1X2dOY0JHR1RDLUItdXB6Y0lCcWQxN2VnVFFSZ09rVzVD?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Polygon Stops Work on 'Edge,' Used to Build Dogechain, as Focus Turns to ZK - CoinDesk",
        "content": "It was pitched as a way of adding support for Ethereum-style smart contracts, which in turn could facilitate new DeFi protocols as well as NFTs; the original Dogecoin blockchain lacked smart-contract support, since it was a fork of Litecoin, which in turn was an early clone of Bitcoin, the original blockchain launched in 2009 – several years before Ethereum came along, ushering in the new era of smart contracts."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOVGpGaW1OdDZSaUl6SHh3WG96Rzc3a2p5cmZPcjJVaHpGTHlVUXpJZDF1VVBWQ3U4X0ZWV3p0MXl2bHNzWWlwRDhxNE9iVHBvMXFSc1F6azJSNHhNbVRidjJTeEpZeEt5a0tJaUtFNVdzWHFpUF9lZFlqRTBqR055akJFNTVDeUVvZUxlY251c0RVV2hlOVYycjY1MkFCT2x1cDB1d9IBqgFBVV95cUxQdUxzR2xTY2JvTzF0dTRIYWJOckhoNERHX1RZTUJFbEllSkNNQzV6emhTZTlNRTgzNFhuRC15ZmFUdEhzY3RqY0ZZWUlsMElPZFpjNmF6QU9jNU82NmtrNGZtcVNwY2hrTlhoUTdRQkFWYjRXUzk0QzREbV9HLTJ1d0dHSHJ6NTNLcWVwUzV1bS1jTm5CaDN1V1ZJUmtETDNxNHJEX0kwQkNTZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Cronos Labs Unveils Public zkEVM Chain Testnet to Foster Mainstream Adoption - CryptoPotato",
        "content": "Cronos Labs, the web3 start-up accelerator behind the Cronos ecosystem, has launched a zero-knowledge Ethereum Virtual Machine (zkEVM) testnet blockchain network on top of the Ethereum Sepolia testnet.\n\nAccording to an announcement shared with CryptoPotato, the Cronos zkEVM Chain testnet is launched in an alliance between Cronos Labs, Matter Labs, engineering teams from digital asset exchange Crypto.com, and decentralized finance (DeFi) platforms VVS Finance, Veno Finance, and Fulcrom Finance.\n\nCronos Labs Launches zkEVM Chain Testnet\n\nThe Cronos zkEVM testnet is a hyperchain using the ZK Scalable Transparent Argument of Knowledge (STARK) modular framework. As it is on top of the Sepolia faucet, the chain is secured by the Ethereum testnet from a final settlement and data availability standpoint.\n\nCronos Labs claims the new chain is the first public testnet utilizing the ZK Stack framework. As a hyperchain, the zkEVM testnet runs alongside a common settlement on the Ethereum mainnet. By 2024, the network will adopt a shared native bridge to the Ethereum mainnet, enabling users to send tokens and messages while enjoying the latter’s security.\n\nKen Timsit, Managing Director of Cronos Labs, said: “The Cronos zkEVM testnet represents an opportunity for Cronos Labs and our partners, including VVS, Fulcrom, and Veno, to experiment with ZK layer 2 technology in order to prepare the next phase of growth starting in 2024. Other Cronos apps are warmly invited to join the testnet.”\n\nCronos’ zkEVM Testnet to Use TCRO\n\nThe new network uses a Boojum STARK-based ZK-proof system, which runs on general processing units (GPUs) while reducing fees. The zkEVM chain also uses TCRO, a testnet version of CRO, the native cryptocurrency of the Cronos ecosystem, to pay transaction fees. Cronos Labs said fee payments can be made in other cryptocurrencies due to the native account abstraction implemented at the protocol level.\n\n“When we introduced the ZK Stack, we opened up the door for anyone wanting to build on top of Ethereum to do so by deploying hyperchains. Whether you’re building a specialized Rollup or a general purpose one, hyperchains allow you to tap into Ethereum’s extensive userbase base and liquidity while preserving its robust security and decentralization”, said Marco Cora, senior vice president of business and operations at Matter Labs, the firm behind Ethereum-based layer-2 scaling solution zkSync.\n\nAs the latest sister chain in the Cronos network, the zkEVM testnet will ease the movement of liquidity between the ecosystem and Ethereum."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPa2FzelVnX3JPSVUyWFFLODZRTmxYV1Z0ZkZqVHFOVWpfbU9tVWNUZUxzaEZaS2VLMGRYUktuT2lTUWJybWhQeWN0Z2hDQ1JtNW1vQnNrRlpKS1E3cm1WMktDOXQycFpwcDJlRlp0TF95TjVPTmZWTDVwTm5hWnNtRzAxcHBMMThJWDZwRXRRUk9wSmtJWlFxT0NuWEw3aWhfcDdlb1BfLTFORkxkUUxESjJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Rainbow Wallet's 'Fox Hunt' Targets MetaMask Users, Teases Potential Airdrop on Ethereum - PlayToEarn",
        "content": "Rainbow Wallet, a non-custodial wallet, has launched a Rainbow Points rewards program. Aimed squarely at MetaMask's users, the firm also suggests a future Ethereum airdrop. This marks a watershed moment in the competition among Ethereum wallets.\n\nDubbed the \"first step towards including our community in the future success of Rainbow,\" the program distributes points to Ethereum users based on their on-chain activity. These include factors like wallet balance and, notably, rewards for shifting from the widely-used MetaMask wallet. Those who possessed at least one Rainbow NFT as of Monday are eligible for extra points.\n\nThis mirrors the tactics employed by Blur, a leading NFT platform, which successfully diverted market share from its competitor, OpenSea. By awarding points leading to its own token airdrop, Blur has given out hundreds of millions of dollars in tokens since its inception this year.\n\nKnown as a \"vampire attack,\" this strategy lures users from an established service to a newer one through more lucrative rewards. In this case, Rainbow is targeting MetaMask, the current market leader in Ethereum wallets. Rainbow's announcement promises up to 150,000 extra points for those who import their MetaMask wallets, emphasizing rewards for \"True Believers,\" Rainbow's most loyal users.\n\nIn a playful twist, Rainbow's tweet thread rebrands this move as a \"fox hunt,\" in a nod to MetaMask's fox mascot.\n\nHowever, Rainbow has yet to confirm if the points program is a precursor to a token airdrop. Elsewhere, MetaMask's token launch, hinted at in early 2022, remains unrealized.\n\nAirdrops are a staple in the DeFi world, offering free crypto tokens to wallet holders or early project contributors. These airdrops vary in distribution criteria, often rewarding active network participants.\n\nWith that, Rainbow is set to challenge MetaMask's dominance and reshape the Ethereum wallet ecosystem. This could alter how users engage with blockchain tech and DeFi, signaling a new phase in wallet competition."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOSGk1SnVLM2p1OTU4XzEtMEJ6b1hUVGRLZWU4Rm94aFNmQnhVNTVTTXk3c0dVSkV4cXlSSTFPZXBseFE4dHBDc3QxanU2OEhMSmlZMlpKc0RsbVY1S2U3WDNRNWdBZU9GN1VhbHQ1QUdqSjBkaGUxcGFsYWJQbXVOdlppRFJhR1NJR0hZLVE2NWwtbHFPU1d2THFIRkFXLTMtcWtYanZCVWU5dDlFa3pNZEtXUE9jekNBOHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) and Solana (SOL) Pave the Way for Pullix (PLX): A Trifecta of Crypto Success - TechCabal",
        "content": "The blockchain cryptocurrency industry has evolved substantially since the launch of Bitcoin in 2009. Ethereum (ETH) and Solana (SOL) are two top altcoins that have contributed to the industry’s growth.\n\nWhile Ethereum was the first to implement smart contracts, Solana expanded the possibilities by increasing scalability. Both have contributed to the emergence of Pullix (PLX), the new trifecta of crypto success. Let’s find out why Pullix is now referred to as one of the best cryptocurrencies to invest in right now.\n\nEthereum Introduces a New Phase in Crypto\n\nEthereum (ETH) is widely considered as the blockchain industry’s backbone. This is because the Ethereum network was the first to provide smart contracts and decentralized apps. The infrastructure has extended throughout the bitcoin industry.\n\nThe Ethereum network’s popularity has propelled it to the top altcoins in the market today. Ethereum (ETH) is the project that led to the idea of a decentralized future since it created the framework for the launch of many projects.\n\nSolana’s Scalability Increased the Possibilities\n\nWhile Ethereum introduced smart contracts, scalability remained a long-standing issue. In 2017, the Solana network was launched as a game changer. While Ethereum can only handle 8-18 transactions per second (TPS), the Solana network has the potential to handle 65,000 TPS.\n\nThis scalability caused the Solana coin to gain traction. It also led to a massive expansion of the network. The growth of the network has established the Solana coin as one of the top altcoins in the cryptocurrency market today.\n\nThe Emergence of Pullix (PLX)\n\nPullix is now being referred to as a trifecta of crypto success as it combines both concepts introduced by Ethereum and Solana. As an exchange, it combines the decentralization of Ethereum with the great scalability of Solana.\n\nPullix has thus unveiled an exchange platform that exceeds the competitors. As a result, the exchange functions in a safe and decentralized environment. Furthermore, it promotes a transparent trading system that eliminates intermediaries and lowers transaction fees.\n\nThe exchange’s great scalability has enabled it to enter new markets. Users will be able to trade more than just cryptos on Pullix. Users will be able to trade assets from the stock, FX, commodities, and exchange-traded fund (ETF) markets.\n\nPullix has linked its DeFi cryptocurrency, PLX, to the trading platform in order to bring additional incentives to customers. PLX token holders will receive regular passive income transfers via providing liquidity.\n\nDue to these amazing features, there has been great interest in the platform’s DeFi cryptocurrency, PLX. Over the last few days, almost a million PLX tokens have been snapped up. Fortunately, PLX is still available at a great price of $0.042 per token before its projected rally.\n\nFinal Thoughts\n\nThe combination of successful two models has made Pullix one of the best cryptocurrencies to invest in at the moment. This is the reason why it is referred to as a trifecta of crypto success. Now is a great time to join the project before its projected rally of 100x.\n\nFor more information regarding the Pullix Presale see links below:\n\nVisit Pullix\n\nJoin The Pullix Communities\n\nKeywords: top altcoins, best cryptocurrencies to invest in, DeFi cryptocurrency, altcoins, Ethereum, Ethereum (ETH), Ethereum network, Solana, Solana network, Solana coin\n\nMeta Title: Crypto Trifecta: Ethereum (ETH) and Solana (SOL) Forge the Path for Pullix (PLX) Success\n\nMeta Description: Find out how Ethereum (ETH) and Solana (SOL) have paved the way for the success of Pullix (PLX).\n\nShare this article"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQY3VPTDU5RDdNN2hSbVFGeDdRX3NGbl8tT1NUOWxYZ0dYZjMtTDF6US1heGk4a0lqTE1oV0lNYnFRalJzT0FkV3FVS1YwRnVhcFFMRTZJMi13ajRYMlNxb00wTU5xR1d4ejhqdjNybWxvakZIS3hXOEUtZWp4T0RaYjQtTmZfX1AwUDlZN2hqLWhtekw4YlNIbVh2ckJmOVFHVmlsN0hFcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "BTC and ETH on the Brink of Historic Price Surge Amid $19.7 Billion Flows - Blockchain Reporter",
        "content": "In a stunning turn of events, the cryptocurrency market is predicted to be on the verge of a historic price surge as over $19.7 billion floods into the two major players, Bitcoin (BTC) and Ethereum (ETH). The news comes as renowned crypto analyst Ali took to X (formerly Twitter) to share the staggering capital inflow figures, drawing parallels to a similar scenario in December 2020 that preceded Bitcoin’s remarkable surge from $18,000 to $65,000.\n\nAli’s tweet sent shockwaves through the crypto community, with enthusiasts and investors eagerly anticipating a potential repeat of the 2020 bull run. The crypto market, known for its volatility, has been the subject of intense speculation and scrutiny in recent weeks, and the influx of such substantial capital has only added fuel to the speculative fire.\n\nOver $19.7 billion are flowing into #Bitcoin and #Ethereum today! This is around the same capital inflow we saw back in December 2020 before $BTC surged from $18,000 to $65,000! pic.twitter.com/pBALVN0C2c — Ali (@ali_charts) December 14, 2023\n\nBitcoin and Ethereum on the Cusp\n\nAt the time of writing, Bitcoin is trading at $42,907, marking an impressive 4.16% increase in the last 24 hours. This surge is part of a broader uptrend, as Bitcoin has experienced a staggering 140.95% increase in value over the past year. Ethereum, the second-largest cryptocurrency, is also experiencing positive momentum with a current price of $2,285, reflecting a notable 5.00% increase in the last 24 hours and a substantial 72.82% increase in value over the past year.\n\nThese numbers are particularly noteworthy, considering the challenges and uncertainties that have characterized the global economic landscape during this period. The current state of the cryptocurrency market prompts questions about the driving forces behind this influx of capital and the potential implications for both Bitcoin and Ethereum. Market analysts are speculating on a variety of factors, including institutional interest, macroeconomic conditions, and the growing adoption of cryptocurrencies as a mainstream investment.\n\nInstitutional investors, often seen as key players in influencing the market, have shown an increased appetite for digital assets. The idea of cryptocurrencies as a hedge against inflation and economic uncertainties has gained traction, attracting significant investments from institutional players seeking diversification and new avenues for growth.\n\nThe macroeconomic landscape, marked by central bank policies and geopolitical tensions, has created an environment where traditional financial instruments may not be as attractive. Cryptocurrencies, with their decentralized nature and limited supply, are becoming increasingly appealing to investors looking for alternative assets.\n\nMoreover, the surge in interest and investment in decentralized finance (DeFi) platforms built on the Ethereum blockchain has contributed to the overall positive sentiment around Ethereum. As the second-largest cryptocurrency, Ethereum is often viewed as a key player in the broader crypto market, and its performance is closely watched by investors and analysts alike.\n\nWhile the recent capital inflow and price surge are generating excitement, caution remains a prevalent sentiment. The crypto market’s volatility is a double-edged sword, capable of delivering substantial gains but also posing significant risks. As investors eagerly watch the charts, the coming days and weeks will undoubtedly provide more insight into whether the crypto market is on the brink of another historic surge or if a correction is in the cards."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQZFlfNjk5cmdqT1lkbm5WRFBvTVdvZzVHNUJwbEN3UTRXOW4tNXdGQm9IMFQxbFVKSk9RMDZTWEV5MVZ6dlptQkZYYllmY3o4cU83TXFZY0c1VHpBTUxzd0wwdVFFMWotOFQzQm1qVkJNQkJQOFRDTUZhcVdNTnpQNUZVaExvWTJJUGNfTnlDUGczcG9lS2o1Y2lRWWI5VjA5ZGpfTUFFREIwcGJhc1JKNlpVWlMxeHhK?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "3 Transformative Cryptos Changing The World: Ethereum (ETH), Everlodge (EDLG), Toncoin (TON) - TechCabal",
        "content": "Cryptocurrency was originally created to transform how we make payments. Now, innovative new projects like Ethereum, Everlodge, and Toncoin are taking things one step further. Each project offers an innovative new solution, and as a result could be extremely profitable for early investors. Here’s why investors should consider each for their portfolios.\n\nEthereum Continues To Pioneer DeFi Developments\n\nEthereum is the largest blockchain in the world. Over 1,500 active decentralized apps have been built on the network, with a total value locked (TVL) of over $1 billion. Many analysts believe that Ethereum is now more important than Bitcoin, and could play a more important role in the future of decentralized finance.\n\nEthereum recently experienced its largest price increase of 2023, rising to over $2,350. It has since declined to $2,232, though Ethereum’s value has still increased by 8.65% in the last month. With huge plans for 2024, including a potential spot ETF, experts believe that Ethereum’s value could surge over the next year. Predictions range from $3,000 to $4,000+, though most experts agree that Ethereum’s value will rise.\n\nToncoin Blockchain Slows Following New Protocol Release\n\nToncoin was created to provide seamless DeFi transactions, offering speeds of over 100,000 transactions per second. However, a recent issue with Toncoins transaction processing has cast a shadow of doubt around the project.\n\nLast Tuesday, a new protocol inspired by Bitcoin Ordinals caused a spike in activity on the Toncoin network. This caused the blockchain’s speed to crash to less than 1 transaction per second on Thursday, during which over 2.5 million transactions were pending.\n\nDue to congestion Tonkeeper, a popular Toncoin wallet, had to suspend its services. Later reports suggest that network usage increased by 61 times in just 30 minutes, causing issues for Toncoin. Since this setback, Toncoin’s value has fallen by 8% to $2.17, and Toncoin’s daily trading volume has fallen to $50 million.\n\nCould Everlodge Revolutionize A Trillion Dollar Market?\n\nWhile most crypto projects focus on finance or the blockchain, Everlodge applies DeFi technology to an entirely new market– travel properties. As a pioneer in this industry, Everlodge is expected to gain significant traction throughout 2024 as thousands of investors discover a new way to build their property portfolios.\n\nEverlodge looks to disrupt the travel property market by minting properties as NFTs. This is designed to streamline the buying and selling process. Once minted, NFTs are fractionalized so investors can buy a percentage of the property instead of the entire property outright. For example, a holiday home in the U.K. worth $1 million could be split into 5 fractions, after which 5 individuals can own a 20% share in the property.\n\n<blockquote class=”twitter-tweet”><p lang=”en” dir=”ltr”>We're thrilled to announce that our website just got a makeover! 💻<br><br>Check out the fresh look and discover the NEW features we've added. It's all about making your experience even better!<br><br>Plus, remember that our Presale is still ON. <br><br>Explore now: <a href=”https://t.co/SIYWBylwQD”>https://t.co/SIYWBylwQD</a><a href=”https://twitter.com/hashtag/RWA?src=hash&ref_src=twsrc%5Etfw”>#RWA</a> <a href=”https://t.co/aTuT8x7z36″>pic.twitter.com/aTuT8x7z36</a></p>— Everlodge (@EverlodgeHQ) <a href=”https://twitter.com/EverlodgeHQ/status/1716543605576241503?ref_src=twsrc%5Etfw“>October 23, 2023</a></blockquote> <script async src=”https://platform.twitter.com/widgets.js” charset=”utf-8″></script>\n\nThis unique application reduces how much an investor needs to get started, and removes traditional barriers to entry, such as location. Properties available on Everlodge will include luxury villas, hotels, and holiday homes, with plans to add more property types in the future.\n\nEverlodge is currently in stage 8 of its presale, having sold out at record rates during its previous seven rounds. Its native token, ELDG, is currently available for just $0.027, and will offer numerous benefits to holders once Everlodge officially launches.\n\nInvestors who buy ELDG tokens during the Everlodge presale will automatically be granted access to the Everlodge private members club, which will offer lucrative rewards such as free stays at properties within the Everlodge ecosystem.\n\nVisit Everlodge\n\nShare this article"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMimwJBVV95cUxPODlsVmRTdjgxSk1UX3BWNHBWcUJVUVVtb21peTF0V2YyTmlUVkxQSWtKQUQ3S2J5eUVkMGVIcXJZV1RjTkkyTTBsS0lrWXVyd0xnM29YeDNBRm5xbUhWUWM5UnpoT2ZjVWJmcjBTZll5VWxJVml1RFl3enE3dzZ1Q21GZGM1a3FoOUpYa0NxSkktNVZqR2ZxRWd1a1ZjNlBHakkwcFJPQWFhOGN4cXFHR0NBaTZLQkR1blNqZlhFQTk0OGR1VHhFWUNGbW5LWU9JWGduZGMtTTRtcEEzd25BbUlrWk4wc1l0aTFjQnk3S1RiY19oVVp2bGVwRVVMY05UNlhHV2dicXg4T0xoZ19xV2RrNXRqRUJCVlMw0gGoAkFVX3lxTE1tMWw4MEt0VG5LOFlaanVsTHR1bTd4bmhYeGttVlMxcWxIdEd3QVVNUUdPd0F2OEYyZ1pmeVpNZEZ4MXFJSk1SamF6SzdFM3U2eHdOQU13QTd6LXRKZTNFbUJzOFBPbFphcGcwcl9HcUtMa09XR1VhUkE2UjBfY3lCcVQ4Wk9lMzVPUWVmdlFDOU42bHUtcktSQ0RMdmwwcUVrWWFnZ1I4djhiU1BRTWhNUWFrNGFvMmYwTUJhNGczRDhpRGV4MDJpOFN1cnhTRVJaWXdYeDZ0bzJvdWowS2ZBTmJ5NEI1QVNrT1ZaaHZpZ1FUREoxSUM2cWpWaTEyUXdGdXlUOUtaa3ZtN2pUdWJVaFlQakMtUzUtbU5Hc3pLUmNkYUViQjhw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Top 5 Altcoins to Watch for the Next Bull Run | Best Altcoins to Buy Now? Discussing Polkadot, Solana, Ethereum, Cardano, and ApeMax - Analytics Insight",
        "content": "As the crypto community undergoes renewed bullish momentum, ApeMax's presale has continued to grow as 2024 approaches. However, as a return of optimism can be seen in the crypto space, exactly when and whether or not a sustained bull run will occur is still a matter of debate and can only be observed after the fact. Moreover, all coins, including new altcoins, can be volatile and they are ultimately subject to the supply and demand forces of the market."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOcmVYTWlNbWx6NVpqMjVLUHhQVm5PZ2Z2X2FTamwwV0w4N3FJZlpVb3ZBWWZHU3lSak90d25zWUtUVUpLRlg2VmFsNWFFWWxjUVU3RV9qeWtrNllMb3lFY1I3NnRRTC1wWUROeTNFN25Uc24wMUlkMndfb2hjRVZfU2Vnc3M3MFFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Rainbow Points Frenzy Positions Wallet As MetaMask Killer - Blockonomi",
        "content": "Cryptocurrency wallet Rainbow made waves this week with the launch of its new rewards initiative called “Rainbow Points.” On December 12th, Rainbow announced that they had taken a snapshot of all Ethereum blockchain activity and allocated points to Ethereum users based on factors like their wallet balances and usage of decentralized apps and services.\n\nKeypoints\n\nRainbow wallet launched a rewards program called “Rainbow Points” for Ethereum users based on their on-chain activity\n\nUsers can earn more points by importing MetaMask wallets into Rainbow, holding Rainbow NFTs, using Rainbow for swaps/transfers, and referring friends\n\nThis is seen as a “vampire attack” on MetaMask to lure users away, with Rainbow calling it a “fox hunt” against MetaMask\n\nSpeculation that Rainbow points may lead to a future token airdrop, similar to Blur and other platforms\n\nOver 400,000 wallets are now showing on Rainbow’s leaderboard after the points announcement\n\nWhile all active Ethereum wallets received a baseline level of 100 points, Rainbow offered additional incentives targeted specifically at MetaMask users. MetaMask is currently the most widely used wallet and gateway to decentralized apps, but Rainbow is positioning itself as a challenger by trying to attract MetaMask’s loyal user base.\n\nImporting MetaMask wallets into Rainbow earns users up to 150,000 bonus points. Even more points go to those who have actively used MetaMask’s built-in token swapping feature over the past year, with the amount correlated to their swap volume.\n\nRainbow Points resemble similar rewards programs from other crypto startups looking to gain market share from rivals. When NFT marketplace Blur introduced points that later converted into the platform’s native BLUR token, it helped drive tremendous user growth and siphon activity away from OpenSea. Rainbow appears to be taking notes from this strategy.\n\nWelcome to Rainbow Points — the first step towards including our community in the future success of Rainbow Every Ethereum user has been dropped points today ???? Claim your points and start earning more by doing the things you already do onchain pic.twitter.com/UsUOOGxC0b — Rainbow (@rainbowdotme) December 12, 2023\n\nWhile comparisons to a “vampire attack” were made on crypto Twitter, Rainbow cheekily framed it as a “fox hunt,” calling out MetaMask’s popular fox logo. Rainbow even taunted MetaMask by stating, “Are you a MetaMask user looking to enjoy, not suffer through, Ethereum?”\n\nThe insinuation is that features like an easy onboarding experience, multi-chain accessibility, integrated swapping, and NFT support make Rainbow a preferable choice over the incumbent MetaMask. Rainbow also appealed to users frustrated over MetaMask’s lack of a native token or loyalty rewards to date.\n\nSome speculate that Rainbow Points may ultimately convert into a forthcoming token reward. This would follow the lead of other crypto startups like Blur which dropped a valuable native asset on early supporters.\n\nWhile Rainbow has not confirmed any potential token plans yet, it did state that the points program “is the first step towards including our community in the future success of Rainbow.”\n\nThe points initiative and anti-MetaMask messaging clearly struck a chord. Within 24 hours, over 400,000 wallets were appearing on Rainbow’s public leaderboard of top point holders. Crypto users on Twitter shared stories of downloading Rainbow only to discover crypto tokens or NFTs they never realized they owned.\n\nThe frenzied response suggests Rainbow successfully incentivized new users to try its wallet app. But experts warn users should still exercise caution with any new service that requires entering a private key or seed phrase. As more Web3 users try out Rainbow for the points potential, MetaMask may need to consider countermeasures like finally launching its long-rumored token."
    }
]