[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBlZjl0bXJDMFI1WkU5UEdLaDZQdC1ZZWROX29GQ2hXTWpTZnZHZlYwcEZrcWFyeHdrVllmREhjMjlJdGFyWUFyODZ1Q0w5bHpGdm5qZV80eVhJZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "What Is Polygon? • Layer-2 Ethereum Scaling - Benzinga",
        "content": "Want to invest in Polygon? eToro makes it easy to buy MATIC with a simple trading platform and low fees!\n\nThe Ethereum ecosystem is the largest and most vibrant of smart contracts compatible Layer 1 blockchain. However, high transaction fees on the Ethereum network have alienated investors from this product. High gas fees on the Ethereum network have led to the development of rival blockchains — such as Cardano, Solana, Avalanche — sometimes referred to as ETH killers. Although these blockchains are often faster and cheaper than Ethereum, they lack the security and the network effect of Ethereum's massive user base.\n\nLayer 2 solutions are applications created to help scale a blockchain. Examples of Layer 2 solutions are the Bitcoin Lightning network, Arbitrum and Polygon Crypto. These Layer 2 solutions process transactions off the mainnet, or Layer 1, and post them back in groups using rollups. Layer 2 solutions help increase transaction speed and reduce gas fees while still providing the security and decentralization of the mainnet. Layer 2 solutions are also often referred to as sidechains.\n\nOverview of Polygon\n\nPolygon is a Layer 2 scaling solution for the Ethereum blockchain. Polygon acts as a faster blockchain running concurrently alongside the Ethereum blockchain that uses multiple sidechains. These sidechains operate using the following methods to help improve scalability methods.\n\nZK-Rollups: ZK-rollups process multiple transfers off the Ethereum mainnet. These transfers are then bundled into a single transaction and posted to the mainnet. This process reduces the volume of transactions and the amount of data being processed on the Ethereum mainnet, enabling cheaper and faster transactions.\n\nPlasma chains: Plasma chains are blockchains that run alongside the Ethereum mainnet. The two blockchains can communicate with each other and allow assets to travel between them. Plasma chains have a consensus mechanism that creates blocks, and the root of each plasma chain block is published to the Ethereum mainnet. These roots are little pieces of information that can be used to prove the contents of those blocks.\n\nOptimistic rollups: Optimistic rollups are similar to ZK-rollups, except that they assume transactions are valid by default. They only run computations in the event the integrity of a transaction is challenged.\n\nThe MATIC token is Polygon’s native cryptocurrency. MATIC, an ERC-20 token, is used for staking, fees and governance.\n\nWhy Do People Use Polygon?\n\nPeople use Polygon because of its fast transaction speeds and low gas fees. Gas fees on Polygon are often just a couple of cents, far lower than those charged on Ethereum. People also use Polygon because the network benefits from the strong security of the Ethereum blockchain, and it can benefit someone who wishes to be a contributor to the blockchain technology.\n\nPolygon History\n\nPolygon was launched in October 2017 as the Matic Network. Polygon was co-founded in Mumbai, India, by developers Anurag Arjun, Jaynti Kanani and Sandeep Nailwal. Kanani was a former data scientist at Housing.com before helping found Polygon and serving as the company’s CEO. Nailwal was the previous chief technology officer (CTO) of Welspun Group. He also worked as a consultant at Deloitte and started another company known as ScopeWeaver. Arjun worked as a project manager at IRIS Business, SNL Financial and Dexter Consultancy. Matic was rebranded as Polygon in February 2021 to reflect its wide array of scaling solutions.\n\nWhere To Buy MATIC\n\nMATIC can be purchased from most centralized exchanges such as Voyager, Crypto.com and Binance. MATIC can also be purchased from decentralized exchanges such as Uniswap and MetaMask Swap. Polygon uses a proof-of-stake consensus mechanism. If you already own MATIC, you can earn more of it by staking and buy cryptocurrency to diversify your portfolio along with the Polygons you already hold.\n\nPolygon vs. Other Blockchains\n\nThe Polygon blockchain fundamentally differs from other blockchains such as Bitcoin and Solana because it relies heavily on another blockchain for its security. Polygon is in effect a part of the greater Ethereum ecosystem.\n\nArbitrum is another Ethereum Layer 2 scaling solution. Arbitrum is slightly more decentralized because it is secured by Ethereum’s large network of miners. Polygon, on the other hand, is secured by MATIC staking, which is a smaller pool of capital when compared to the miners who secure the Ethereum network. Polygon is slightly cheaper to use and has faster withdrawal times when transitioning your assets back onto the Ethereum Network.\n\nHow to Store MATIC Safely\n\nIf you wish to purchase a large sum of MATIC tokens, it is crucial to take the proper precautions to store your cryptocurrencies safely. The best place to store your MATIC tokens is on the hardware wallet Ledger.\n\nLedger is a hardware cryptocurrency wallet that stores access to your cryptocurrencies on an external device. Ledger wallets are not connected to the internet. This feature is beneficial because hot wallets that are connected to the internet are much more likely to be exposed to scams, hacks and private key leaks. Ledger wallets are currently priced at around $60 to $250 depending on the model you choose.\n\nShould You Use Polygon?\n\nPolygon is a scaling solution for the growing cryptographer that aims to improve the speed and reduce the cost of using the Ethereum blockchain. The company not only helps bring new cost-conscious users into the Ethereum ecosystem, but it also retains existing users. Many Ethereum projects are in the process of deploying on Polygon, and the Polygon Labs ecosystem is only expected to grow and add scaling solutions over time. However, the Ethereum 2.0 upgrade risks rendering Ethereum’s Layer 2 solutions less valuable as the mainnet scalability improves.\n\nFrequently Asked Questions"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPTmt4Y2Z3dlZvbS15RlJRSGJZWHZtbW9KY3d1eVBaWmgtWmx2eG4yajFoU2JzODBDMnVPZDZYYmRodXNzWVJRNTBRZFJMSktHbTJHSjZOQjFnaEhyMzc4U1VkNDh4VUVHNDZ5S1RxRThyYlpWbFVnS0tRWGc1aFF0LWRLQUJwY2QxbHg0dWJMc245cVhPbG85YXcyd3ZtbkN6NGdXVzVFVWFJWjZuaVJVYmFneUxWcjFCQ1VKQ1NoeEhKcE5mUFY3eHppNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Analysis: ETF Sponsors Acquire $6.84B ETH Amid Market Dip –What Next? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxQU0Fvc0tZTUZ6cFlHUHZqZVhwQ3l4U2xHemxmX1VDZ0Nyak5ld2FVc2l1enB1eTNqWW1sR05iLW5GSVZITGtPMVlnM1ZmRWFlNzJfOHJqam9CZ2RUTjNqZEV6LThyQXlqQ21vc1ZQM0dHaERleGRZclppeHdwV2VKQnhRVUVPOVhreUxBQWQ1Rm1RUzhaWUdwZ0FzY3lBN3hRLUVMX2kyeEhMSkR1ZHhyZFg1ck1PMGE4bjVaMnd6Nk4xUnFsU1NZY2hn0gHPAUFVX3lxTE5IeS1UUzlKVU1RaHkwcDExR3hySzBsbU9vQ3hKTUp0MVJYY3BTam5HclQ5b1FEVHVlaGRtNEhWN3NkeWl4ZWNFRE9ta2RzSHBfQ3d4LUxlRkxONWowcEFzMjJLel9fUmRNTjUyX2Njamd4a1ZpOFRhcGdPNHJIWFYtN0hUTmZBbUdLdzNybE44XzNEcGloTFMzUEx2TGFqVFlHaGh3V1F5QXA1cDRzbzNHa2tDaEI5eTYwTFRjTVFvS1VFRmxoTHg1Ri1XbFFOaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Metis, Ethereum Layer-2 Network, Creates $100M Fund as Decentralized Sequencer Launch Nears - CoinDesk",
        "content": "“The MEDF will progressively evolve into a community-driven fund. It will be managed by the MetisDAO Foundation and Metis token holders, who will decide on grant allocation and project deployment on the Metis network,” the Metis team wrote in a press release. “Further down the project roadmap, Metis hopes the fund will become self-sustaining and ensure constant growth of the Metis ecosystem.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxONmJCdGRON29sSHNHSHNJVnFfWkxZNm9xdVJPYnh2bnhnWHJvWndLUUxhWnRMVlZGSmdRVEhjVUNyQnZLQ09hWUJiVXVDc19sYUd1eWxCai1JRk1lVTZUaFpmZ0VrUU1UTzhNZ0trWXhfTVNsM0xZd0EwQVduSDRxS1NtODJSaUlFUXZQcVJxVmxLd2pBYy1TUW9vcTlwRTFWai1pVUNSWkxjeU9lTUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Community Approves ERC-3643 as Standard for Real-World Asset Tokenization - TOKENPOST",
        "content": "Ethereum Community Approves ERC-3643 as Standard for Real-World Asset Tokenization\n\nThe Ethereum community's endorsement of ERC-3643 as a standard for compliant tokenization of real-world assets demonstrates the growing importance of decentralized finance.\n\nThe Ethereum community has officially signed off on the ERC-3643 Ethereum Improvement Proposal (EIP), establishing it as a recognized standard for compliant tokenization of real-world assets (RWAs). The proposal reached its final status, meaning it has been formally reviewed, discussed, and agreed upon within the Ethereum community.\n\nAccording to a press release by ERC-3643, the process is similar to how ERC-20 and other popular standards were established.\n\nDecentralized Identity Verification and Compliance in ERC-3643\n\nERC-3643 is a standard for securities tokenization, RWAs, payment systems, and loyalty programs. It verifies users' eligibility for a token via a self-sovereign identity (SSI) framework, providing anonymous yet verifiable credentials, as explained by the association behind the proposal.\n\nThe approved standard, proposed in 2021, builds on top of ERC-20 and incorporates two distinct permission layers to enhance security and compliance, as per Cointelegraph.\n\nThe first layer of ERC-3643 focuses on the identity and eligibility of the transaction's receiver, utilizing ERC-734/-735 standards to verify the presence of necessary claims on the identity. Trusted claim issuers then authenticate these claims.\n\nIn the second layer, global restrictions on the token itself are implemented. This includes limits on daily token volume and the maximum number of token holders, ensuring controlled and regulated token circulation.\n\nProjected Growth and Interest in Asset Tokenization\n\nAsset tokenization involves converting the value of a physical or digital asset into a digital token on a blockchain or distributed ledger. This innovation brings several advantages, including increased liquidity, faster settlements, transparency, and accessibility to various markets. Real-world applications range from enabling fractional trading of real estate, art, and financial assets to intellectual property.\n\nManagement consulting firm Roland Berger estimates that asset tokenization will grow to a market worth $10 trillion by 2030, a significant rise from the current value of around $300 billion. These numbers highlight the immense potential of asset tokenization in transforming the financial landscape.\n\nNumerous traditional and crypto-native firms are exploring asset tokenization as one of the main trends in finance. Notable companies such as JPMorgan, Goldman Sachs, and Societe Generale are actively considering the adoption of this technology.\n\nPhoto: Traxer/Unsplash\n\nTokenPost | [email protected]"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNUGpSbExreGNSY1piNVlzdmZuaE5NUGFWbElVV2ZUZjRNdzNucGtiSm9HcngzaWs2dHFENkRKYndXNEJaM0hZWURPOWxOa2dyQ0JXVVpJVXJVaFRKcnFHUFVHMzhjVVpHdTVrYTF5TmpLMUc2S0JDRDI5RkF5TWpaVURQbTB2Ni1DLXZqOGw5ZnA5VTdTSmJfUmZKQndKcmxsNEROczRfakhONFVuR2szZmNJeHozeFF6TUgxRXdNVjVBWTNCZ2pKdtIBzgFBVV95cUxOSWtpZzhTTG8wVmhGbmdJekQ2VjI5TV91Q0x0VlpRN3NUSVRTSWJobjc4YU1TU2RhMWtKZWxXQUhabWxmTm9qbHN6d21pZVVZd1U0NHcybk9DNk1lenkwcGNCS21hNU01Z2RCOWpPTVloQjNfTXR2U3NmYnpYeWt5ZGJMZ25YaTduVmcyMFVfOWhEQzJWRXpPdlJOX1lpN3FFT1YwZlpQdnhia21JRDlnMDVrekYxaGxoVVZlejZ0Qjd2cXBiSnowMDBzWlFoQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Whale Dormant for One Year Begins Selling Off Its Coins As ETH Loses Steam: Lookonchain - The Daily Hodl",
        "content": "New data reveals that a deep-pocketed Ethereum (ETH) investor has woken up from a year of dormancy and is selling off its crypto assets as the top altcoin loses momentum.\n\nAccording to blockchain data tracker Lookonchain, the crypto whale has woken up from a 12-month slumber and is selling its stash of ETH over decentralized exchange platforms (DEX).\n\n“A whale that has been dormant for one year is dumping ETH on DEX! So far, 18,865 ETH has been sold for four million DAI through four new wallets, the average selling price is $2,229. And currently has 5,588 ETH ($12.5 million) left.”\n\nEthereum is trading for $2,214 at time of writing, down about 6% from its 2023 high of $2,359.\n\nLookonchain then brings its attention toward the amount of decentralized oracle provider Chainlink (LINK) deposited into Binance, the top crypto exchange platform by volume. According to the data, noncirculating supply wallets deposited 8.3 million LINK, worth $119 million at time of writing, into Binance.\n\n“The wallets [have] deposited LINK to Binance every three months since Aug 26, 2022.\n\nInterestingly, most of the time, the deposit is at the bottom of the price and the price rises after that.”\n\nChainlink is trading for $14.08 at time of writing.\n\nConcluding its analysis with Solana-based (SOL) memecoin Bonk (BONK), Lookonchain says that while one savvy trader lost $46,000 on November 1st, on December 15th, the same entity made a staggering $4.4 million from trading the dog-themed meme asset.\n\n“This trader owns two wallets. In the past year, the trader withdrew 334.5 billion BONK ($218,000) [from crypto exchange] MEXC and bought 32.18 billion BONK ($41,000) from DEX.\n\nAnd deposited 204.2 billion BONK ($80,000) to MEXC, leaving 172.5 billion BONK (worth $132,000 on Nov 1st). On Nov 1st, he still lost $46,000, but today he made $4.4 million.”\n\nBONK is trading for $0.0000205 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Animedigitalart"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOMk0xdHB1dUdza2c1OHd6OTVTMUhnV0VuaWxrbl8wUmVLZlZNNHc2aDRvaFJVUFl5VXhrUHlVc0pFOG9ZNXpmeDZ0b3dwY3JzMHlYOFF6bWpNMTBmMGV6THFYS2RLZEE5SjJOU1VlUXJxUXV1ZGhJQ0pqbzJOUlZSd0F0SDdNQdIBiwFBVV95cUxPcTZGcUxrNktQblpUSWdwaElNMlpnTTBIaFM1RjBMWV93U01hS1lMSUJfbHQyQ2xCeG11ekF1a0lGcC14ZW4zb2cwb3BkNVI5Slg3cklIdHlQWlg0aEI0T1E0X3lOaHF3RzhubmNnQXM5N2NRQ2J4ZEQ0bFoyckROemVzSXQtQnIzQ1g0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "5 Cryptocurrency Predictions for 2024: Charting the Future of Digital Assets - Investing Haven",
        "content": "As we head into the 2024, several compelling trends emerge in crypto, shaping the future of digital assets. In this article, we look at 5 cryptocurrency predictions that could define the crypto space in 2024 and 2025. From our crypto charts, we derive 5 trends that will shape the future of digital assets, beyond our XRP forecast 2024 and $10 XRP forecast.\n\nIn recent years, we published our cryptocurrency forecast, each and every year right before year-end. If anything, it can be said that most, if not all, of our cryptocurrency predictions came true. Only our 2022 cryptocurrency predictions were somehow postponed, but eventually were achieved in 2023 or are close to be achieved in 2024.\n\nCrypto Prediction #1. Bitcoin’s Ascension to All-Time Highs\n\nBitcoin, the pioneer of cryptocurrencies, along with Ethereum, is poised for a remarkable journey in 2024. We explained our viewpoint, in great detail, in the following articles, cryptocurrency predictions published a while ago but highly accurate based on the current path of Bitcoin:\n\nA Bitcoin Price Forecast For 2024\n\nHow High Can Bitcoin Go In 2024?\n\nWill Bitcoin go to $100,000 in 2024, 2025 or 2026?\n\nOur compass is the seven-year rising channel etched on its weekly chart, guiding us towards the anticipation of Bitcoin revisiting its previous all-time highs. As the market dynamics continue to evolve, Bitcoin’s resilience remains a cornerstone, offering investors a reliable pathway in the crypto universe.\n\nCrypto Prediction #2. Game-Fi Resurgence\n\nIn the ‘beaten down’ area of blockchain gaming, Game-Fi is set to reclaim the spotlight. Axie Infinity, a trailblazer in the sector, serves as our North Star, pointing to a resurgence of interest and activity.\n\nThe vast majority of investors will look at the chart of Axie Infinity, with a lot of disinterest, and run for the hills because it’s not hot. Over here, at InvestingHaven, we get unusually excited from Axie Infinity, simply because we see the bullish reversal that is clearly, visibly, certainly going to resolve to the upside. We believe that AXS will move to 40 USD, it will start in 2024 and might be complete late 2024 or in 2025. We stay focused on the future direction of this chart, not the current ‘lack of momentum’. In fact, we see momentum coming, it makes us unusually excited.\n\nAs blockchain gaming ecosystems mature, expect Game-Fi to captivate audiences anew, presenting exciting opportunities for both gamers and investors. For those that want to spot the best opportunities in Game-Fi, we recommend following our crypto investing research service because we will not feature the best Game-Fi tokens in the public domain.\n\nCrypto Prediction #3. Real-World Applications, Tokenization and NFTs in Focus\n\nThe crypto sphere is on the cusp of integrating with the tangible world. Real-life applications, whether in tokenizing physical assets or expanding the horizons of non-fungible tokens (NFTs), are becoming a reality. 2024 could witness a transformative phase where blockchain technology steps out of the digital realm and makes a tangible impact on the real world.\n\nCrypto Prediction #4. Micro Caps’ Meteoric Rise\n\nThe crypto market isn’t just about the giants; hidden gems in the form of small and micro-cap coins are poised for a spectacular ascent. A multitude of charts reveals bullish reversals, quietly biding their time for the opportune moment to explode. Throughout 2024, keep an eye on these underdogs, as they have the potential to surge a hundredfold, rewriting the narrative of crypto investments.\n\nOne of the illustrations of what we are saying is the token shown below. We are, on purpose, not showing the symbol, simply to avoid a misunderstanding (some readers might take it as a ‘buy recommendation’ which it isn’t). We use this chart as an illustration of the tremendous upside potential in some, not all, micro caps and nano caps.\n\nCase in point: the token shown below had a market cap of 1.5m in October, it went up 20x in a matter of 3 weeks, after which it retraced. We are 100% sure that many more micro caps and nano caps will follow the same path. Note that the token shown below has another 20x upside potential.\n\nCrypto Prediction #5. Meme Token Surprises, Beyond the Expected Names\n\nMeme tokens, often characterized by unpredictability, are set to surprise. However, the stars of this show might not be the familiar names. Buckle up for an unpredictable ride, as a select few meme tokens, hitherto under the radar, could undergo a staggering tenfold increase. In the crypto world, expect the unexpected.\n\nOur top meme pick was featured in our latest premium crypto alert, with very specific entry and exit areas, along with a strategy to multiple the tokens over a period of 2 years without doing anything. We recommend signing up to find out which meme token we are talking about, and read our strategy: Crypto – Time For Some Partial Exits And Free Tokens.\n\nConclusion\n\nAs we step into 2024, the cryptocurrency space promises excitement, innovation, and unforeseen opportunities. While the future is inherently uncertain, these five predictions offer a glimpse into the potential trajectories that digital assets might traverse. Whether you’re a seasoned investor or a curious enthusiast, navigating the crypto landscape requires adaptability and a keen eye for emerging trends.\n\nSign up to get top token tips which we will not feature in the public space >>"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQZUhkSG1lR3lRX0VvVTRnVnVFZHRaUDQ4TDZmOHlWTklOUTdiRDhLVFIxUEVwSXVHQXRtdzk0Zzl5OWlrS1ZUYXdudWs3S2Q1bkZzQXRPZVVTLXlFZkkySjBCWUhoRks3S2hxQ1BId0RuNFhkdWVLOUpIV2FOSWx6VFpqbm1URl9ybFNHaFM0V3hBU2RQYnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Solana: il momento dell'Ethereum-killer è arrivato - The Cryptonomist",
        "content": "In the last few days, Solana has surpassed Ethereum.\n\nHowever, this is not a general overtaking, so much so that for example, in terms of market capitalization, ETH’s is still almost ten times higher than SOL’s.\n\nThe overtaking, instead, occurred in a specific context, and as far as a single parameter is concerned.\n\nDecentralized Exchanges: Solana vs Ethereum\n\nAccording to DefiLlama data, daily trading volumes on Solana DEX have reached those of Ethereum DEX.\n\nOn the contrary, on Friday for the first time in history, the daily trading volume on DEX on Solana exceeded that of DEX on Ethereum.\n\nBREAKING: @solana FLIPS @ethereum IN 24H DEX VOLUME FOR THE FIRST TIME IN HISTORY pic.twitter.com/fmcYjnlyeq — DEGEN NEWS 🗞️ (@DegenerateNews) December 16, 2023\n\nNote that these are relatively small volumes, around one billion dollars. For example, the daily trading volumes of ETH on centralized exchanges exceed 8 billion dollars, while those of SOL are less than 2 billion.\n\nFurthermore, it should be noted that the data related to DEX does not only concern the exchange of ETH and SOL cryptocurrencies, but also all the other tokens present on the Ethereum and Solana blockchains.\n\nIn particular, the recent boom in trading on Solana’s DEX is mainly due to the boom of the Bonk token.\n\nThe incredible hype about Bonk\n\nTaking into consideration the overall trading volumes of Bonk on both DEX and decentralized exchanges, the all-time peak occurred precisely between December 15th and 16th.\n\nBonk is a token on Solana launched in December of last year, and had never exceeded $200 million in daily trading volume until December 8th.\n\nActually, to tell the truth, if we exclude the initial weeks, afterwards it didn’t even exceed 10 million until the end of October.\n\nStarting from the end of October, with the awakening of the crypto markets, both trading volumes and price have skyrocketed.\n\nOn December 13th, volumes had risen to $350 million, and the following day they had already skyrocketed to $680 million.\n\nThe peak on December 15/16 first saw a surpass of 3 billion dollars, and then a decline to 2.6 billion. These numbers alone are able to justify the surpass of daily trading volume on the Solana DEX compared to the Ethereum DEX.\n\nThe return to normality\n\nIn fact, yesterday the trading volume of Bonk tokens dropped to 1.1 billion dollars, and the daily trading volume on DEXs on Ethereum has returned higher than that on Solana.\n\nSince Bonk is a token that “awakens” before Christmas, this trend is destined to quickly fade away, and yesterday’s decline seems likely to persist today.\n\nTherefore, it was an exceptional circumstance not specifically related to Solana but to a token issued on the Solana blockchain, and therefore exchangeable on Solana DEXs and not on Ethereum ones.\n\nFor example, considering other parameters such as TVL, Ethereum continues to dominate undisputedly, with 55% of the entire DeFi TVL DeFi.\n\nAlthough it is slightly down compared to the 56% at the beginning of the month, it is still more than the sum of the TVL of all the other chains put together.\n\nIn addition, Solana is not even on the podium from this point of view, because compared to 28 billion dollars of TVL on Ethereum, 8 billion on Tron, and 3 billion on BCS, Solana is only in fifth place with just over one billion.\n\nThe same market capitalization of Bonk is just over one billion dollars, and this indicates that there are not many BONK tokens locked on DEX.\n\nSolana is challenging Ethereum\n\nDespite this, it can still be said that SOlana is somehow challenging Ethereum.\n\nWhile Ethereum in general seems untouchable at the moment, there are niches where Solana or other chains can perform better.\n\nIn particular, they perform better where it is more important for fees to be contained. For example, on DEXs it can be a problem if the average transaction fees are around $10, as is the case with current transactions on Ethereum.\n\nSolana allows for faster transactions and significantly lower costs, so it’s no wonder that tokens like Bonk, which are not appealing to large investors, are now being issued on blockchains like Solana and traded there, perhaps on DEX platforms.\n\nMoreover, Bonk has only recently been added to the main centralized exchanges, while until just a few days ago it could practically only be traded on DEX.\n\nNote that the trading volume of Bonk in the last 24 hours on all exchanges has dropped below 700 million dollars, so the phenomenon mentioned above seems to have run its course."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQVnltcTZ2aUF6TTdOSG00djdhdXhBLWdaX1hfSzljNmhnQmhRWjg0OERibjhObHBVY2t6SDlWODJZT3VNNGliMTBPRjNTX2FSYlV0aXJwRkZHU3VTbDdtMkoweFg5bDFIMjFPdXFKcE01dXZnRk13aU0zLUhiWUZoVUZNNGgyZnhDMDZxblQ1SkQtUTlNeEVuOVNLaW1JRDQyYkI0MTVySdIBrAFBVV95cUxNTUpUY21oV0RBXzBqaVRaT0ozOS10czZiWDZ6akVvV0czTlpVS3lrUXdKZmw4eWsweV9DMTVzZXBJNlhoYmdvbnNRWmhmMWRWOGVQX3pWZUxHN2VWT0JXU2RNUzBOdHlYdm9JS3VfckJXeFVSRWNaV1JVYi1FSGNoVlZod21TN19VRjlEbGV3N0x4VURVUWx1MEx5SVFHRHdVZWlpSE54UjF2bG56?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "How High Will Ethereum Go in 2024: Watch These ETH Price Predictions by Experts - CryptoPotato",
        "content": "TL;DR\n\nETH’s Recent Gains and Positive Outlook: Ethereum’s ETH has rebounded in 2023, reaching around $2,400, with some analysts forecasting a rise to $5,000 by 2025 due to a bullish trend.\n\nEthereum’s ETH has rebounded in 2023, reaching around $2,400, with some analysts forecasting a rise to $5,000 by 2025 due to a bullish trend. High Expectations and Upgrades: Experts predict ETH could reach up to $8,000 by 2026, bolstered by upcoming Ethereum upgrades, with short-term predictions around $3,400-$3,800.\n\nExperts predict ETH could reach up to $8,000 by 2026, bolstered by upcoming Ethereum upgrades, with short-term predictions around $3,400-$3,800. Some Bearish Perspectives: Despite optimism, some, like trader Peter Brandt, are skeptical about Ethereum’s long-term prospects, questioning its functionality and future as a listed asset.\n\nCan Ethereum Be the Best Performer Next Year?\n\nThroughout 2023, the native cryptocurrency of Ethereum – Ether (ETH) – managed to recover most of the losses incurred during the devastating 2022, reaching almost $2,400 (per CoinGecko’s data) a few days ago. However, that valuation is still at the foothills of the all-time high of over $4,800 registered in November 2021.\n\nSome analysts believe the recent uptrend could continue next year, with ETH rising to a new peak in the following months. According to FieryTrading, the asset has been in a bullish mode for the past year and a half, suggesting a further surge in the near future:\n\n“As seen on the chart, ETH has been trading inside a bullish triangle pattern for over 1.5 years. In my eyes, a break out from this pattern might result in big gains for ETH since it will burst through an area full of short-trade stop-losses, which will be forced to buy back their positions.”\n\nThe analyst predicted that Ether could jump to the coveted level of $5,000 by the end of 2024 or the beginning of 2025.\n\nNikolaos Panigirtzoglou – Managing Director at JPMorgan – also gave his two cents, highlighting Ethereum’s upcoming “Protodanksharding” (EIP-4844) upgrade. He claimed it could help the ecosystem thrive and push ETH’s price toward $8,000 by 2026, while Ethereum could outperform Bitcoin in 2024.\n\nThe popular X (Twitter) user Michaël van de Poppe is another person who forecasted success for ETH next year. In his view, the asset might correct to approximately $1,900 but remains poised to soar to $3,400-$3,800 by the first quarter of 2024.\n\nOne Bearish Outlook\n\nIt is worth noting that some prominent figures are not so bullish on Ethereum. One example is the renowned trader Peter Brandt, who maintained that the token is “not comparable to BTC as a store of value.”\n\nHe also spoke against the functionality of Ethereum and its gas prices, forecasting that it could “not even be a listed asset in 10 years.”"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOVEpnX3drTEY5ZUN3clZ6RmtRNGdQc0U5RkJjMTFMTy1TWHlrOW9MLTBEX19USXl3b01DNDRiV3RvRS1pSVdIdzlwdGJBd1d5YndEcjdKZzRfTXpsWlFPUnpzMDVabWNBWU1PSDVjWFMxUGN3XzZNeWl5bVhhdTBtcjBFSGV2SlotVzZqOG5jV0lwRWlDUmlZNlAxWkZjeTBNT2VkOUM4T2pqc0d1YUJQNjJWdldZOXJHMHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Former Ethereum Developer Says 70% of ETH Supply Was Distributed During Pre-Mine - The Crypto Basic",
        "content": "Ethereum insider Lane Rettig makes strong allegations about ETH ICO, claiming that 70% of all ETH in existence was distributed in the pre-mine.\n\nLane Rettig, a former Ethereum core developer, recently caused a stir among crypto investors following his recent accusations against the team behind Ethereum.\n\n70% of ETH Supply Was Distributed During Pre-Mine\n\nIn a video making the rounds, Rettig alleged that 70% of ETH supply was distributed during the pre-mine several years back. Notably, he pointed out the figure has recently dropped to about 60%.\n\n- Advertisement -\n\n“I don’t know the right numbers, 10%, 15%, 20%, you can draw the line wherever you want. 80%, 70%, 60%, it is just too much by almost an order of magnitude,” he added.\n\n????BOMBSHELL ALERT????\n\nLane Rettig, former ethereum core developer, on the Ewasm team at the Ethereum Foundation\n\n?ETHGATE Is THE Financial Scandal of the Century\n\nBIGGER Than Enron. BIGGER than FTX. BIGGER than Madoff. BIGGER than MF Global. BIGGER than Theranos.??… pic.twitter.com/7CRARuWCKJ — Digital Asset Investor.XRP (@digitalassetbuy) December 16, 2023\n\nNo One Knows ETH Biggest Holders’ Identity\n\nAside from Ethereum co-founder Vitalik Buterin’s ETH holdings, Rettig noted that nobody knows the true identity of the biggest ETH holders. However, he noted that a very small number of people fall under the category of biggest ETH holders.\n\n“I’ve heard rumors that are totally anecdotal like a very small number of individuals, like one or two people single handedly bought up large percentages of pre-mine ETH because they were able to participate pseudonymously,” Rettig was quoted as saying.\n\nIt is worth mentioning that the crypto community has been asking major questions about the transparency of ETH’s Initial Coin Offering (ICO).\n\n- Advertisement -\n\nLast year, a video surfaced showing Ethereum co-founder Joseph Lubin advising early Ethereum investors to disguise themselves during ETH ICO by creating multiple pseudonymous identities. The rationale behind this advice was to avoid scaring the public.\n\nNotably, Rettig, who was among Ethereum’s core developers, explained that he left the Ethereum Foundation mainly because of the incidents that occurred during the ETH pre-mine.\n\nAfter working with the Ethereum Foundation for a year and six months, Rettig claimed he realized that he was “pumping Joe Lubin’s bag,” a major shift from what he wanted in his career.\n\nNot New\n\nRettig is not the first ex-Ethereum Foundation employee to make strong allegations about the ETH ICO. Recall that former Ethereum advisor Steven Nerayoff has leveled fraudulent allegations against the ETH team.\n\nAs reported earlier, Nerayoff alleged that both Buterin and Lubin sabotaged crypto and engaged in a fraudulent initial coin offering. He also claimed that the corruption that happened at Ethereum during ETH ICO was 1,000 times bigger than the FTX fraud."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOLTMxMnhnRkpueHAyZGxzd3JWb21YRGFlNlhPVUJ6NEF2ODloaE5RdzNIRi1veHJxYlZrcnJ5dkZBZnRiRXBzVDJfRmdzdkF1UlNrX2toajZkelJuZ1o1dldNZXFRU0lqRWhQc2NIcTF4R0s3bXJwMmtnUE1ya2NDVVprT0pFZXc4X29iLUlMMC00U2Z5TGVYNFIyeGk2X25f0gGoAUFVX3lxTE1UWFByNGlMellvNW9YOVBnS2dmcTBwU2xHUFcyU25QRHJLYVRUb3drSzNOR1dRUnBwN2x6dTNySlE5Y3VvTUdRaEthLXFMd0tRYmplNHNWbnJnNGZlTWg5VHBDOGk4Y2VPMWowZHdzLTczNUtGZF9Pb200UVZrSERKMkxBclRPY3Jqd0VJbnVyQWQ5ZTl2UWtVYW5YUTBJaG9kNUcycXltUg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Ubisoft's 'Champions Tactics' Ethereum NFTs Generate Millions After Free Mint - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nUbisoft’s upcoming battler game Champions Tactics: Grimoria Chronicles sold out of its free Warlords NFTs within minutes—and has seen over $2 million in sales within a couple hours of its public mint, per CryptoSlam data.\n\nAfter a limited presale for select fans, the pixelated profile picture-style Warlords minted out in less than 20 minutes during the collection’s free public mint that occurred at 4pm ET Monday.\n\nThe NFTs are now trading on secondary marketplaces like OpenSea for roughly $600 each, or about 0.27 ETH, at time of writing. Only 7% of the 9,999 NFTs are currently listed for sale—a stat that suggests most collectors plan to hang onto their Warlords so they can use them to unlock the game’s next free mint for its in-game characters.\n\nWhile the Warlords NFTs were free to mint, buyers did have to pay Ethereum gas fees for their transactions, which can fluctuate wildly from tens to hundreds of dollars depending on network traffic. Champions Tactics will use the Oasys blockchain for its other crypto integrations, which promises a gas-free gaming experience.\n\nAD\n\nAD\n\nPrologue completed.\n\nStay tuned for reveal... pic.twitter.com/iP08QG7poH — Champions Tactics (@ChampionsVerse) December 18, 2023\n\nGamers who missed out on the Warlords mint and don’t want to drop $600 in Ethereum to play the game aren’t out of options, though. According to the game’s website, Ubisoft will offer a free Champions figure drop at a later date, with more details yet to be revealed.\n\nChampions Tactics is expected to release sometime in 2024.\n\nEdited by Andrew Hayward\n\nAD\n\nAD"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxONEJCVkhsOUloWjJON015aHlvMGl3a2tsRHUwU21WRXRUcWk0UmNrQ0V5am5ESlp3ODVLVTR4cUpieDVUd0tCbUdYRVJCTEtHd0ZxZVI5eE5uMGNfQTlpelVBcFAzOXBDaUpZWlBFbVBlTmU1SV83YXpScHZ5bWUzbm9wcW4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "AGII Goes Multichain: Launches AI Tools For Ethereum (ETH) - Yahoo Finance",
        "content": "New York, New York--(Newsfile Corp. - December 18, 2023) - AGII, a prominent Web3 AI platform backed by KaJ Labs, is pleased to announce the launch of its AI tools on the Ethereum (ETH) blockchain. This strategic move extends AGII's innovative solutions, including content generation, coding support, and NFT creation, to Ethereum users.\n\n\"We're excited to bring AGII's AI capabilities to the Ethereum network, delivering practical solutions to a wider audience,\" said J.King Kasr, CEO at KaJ Labs.\n\n\n\n\n\nAGII\n\n\n\nTo view an enhanced version of this graphic, please visit:\n\nhttps://images.newsfilecorp.com/files/8833/191346_30.jpg\n\nThis expansion reinforces AGII's commitment to providing user-friendly AI tools in the Web3 era. In collaboration with KaJ Labs, AGII aims to bridge the gap between AI capabilities and the Ethereum community, fostering seamless integration for developers and users.\n\nThis joint initiative reflects the shared vision of AGII and KaJ Labs to contribute to the evolution of the Web3 landscape, ensuring decentralized technologies are accessible on a global scale.\n\nAbout AGII:\n\nAGII is a leading AI platform in the Web3 space, providing practical solutions for content generation, coding, and NFT creation.\n\nAbout KaJ Labs:\n\nKaJ Labs is a decentralized research organization dedicated to AI and blockchain technology, supporting innovative projects globally.\n\nMedia Contact:\n\nDorothy Marley\n\nKaJ Labs\n\n+1 707-622-6168\n\nmedia@kajlabs.com\n\nVisit us on social media:\n\nhttps://www.instagram.com/kajlabs/\n\nhttps://twitter.com/kajlabs\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/191346"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTFBWMjExd1Y1bHJPMXlzd2Y3RjA1WVpFMElwWml2R25pa3VqeFhWSFhyRkhUclp6b0FsN3A3WEcwb2dLbGhVM0N3VUdzaTVmNXpJelNNVE44YVJWVWN20gFiQVVfeXFMTmhfTWNkTnpuUTlfVzNYcEVUMWx5MlcxdU9UcXFjUnJMbkFrQTV6N0pNdnM4M0N1bzFQdE9ZeWpmRWtvUHRwVUZEbFZWSW5TZGI0Rmp3cFc1RC1wUzJaZWpCakE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "The Sandbox Embraces Polygon – Lower Fees, Endless Creativity - NFT Plazas",
        "content": "The Sandbox Embraces Polygon – Lower Fees, Endless Creativity\n\nThe Sandbox, a renowned virtual gaming universe, has recently revealed a critical development shift: transitioning its digital marketplace from Ethereum to Polygon.\n\nBy now being powered by the Polygon blockchain, the Metaverse‘s marketplace offers reduced fees for minting assets. Anyone can craft and sell their virtual creations while earning royalties from resales, with minting on Workspace and its improved UX/UI making this process effortless.\n\nFurther highlighting its dedication to becoming more affordable and seamless, the platform is committing itself to covering up to 10 transaction costs per user every month.\n\nWhat’s more, as an additional celebration of the chain switch, The Sandbox Marketplace is unveiling over 100 new digital artworks. Each artistic endeavor — designed by 30 artists who are part of The Sandbox’s Creator Fund program — boasts a unique style like no other, comprising fantasy characters, futuristic designs, legendary creatures, and more.\n\n📣 Introducing The Sandbox Marketplace on @0xPolygon! 📣 Anyone can now mint ASSETs with greatly reduced fees! 💰 Monetize your creations – Put your work up for sale and even get royalties for every ASSET resold on the Marketplace. 📤 Mint ASSETs with ease – Upload to… pic.twitter.com/yhpOP8lACv — The Sandbox (@TheSandboxGame) December 14, 2023\n\nOther New Notable Gains\n\nAlong with the transition to Polygon, various improvements were made to the platform. The browsing and search features have been upgraded, making it easier for users to discover new digital assets. One significant enhancement is the capability of users to mint NFTs using CATALYST tokens, thereby enabling a broader range of creators to design unique virtual collectibles on the platform.\n\nFurthermore, The Sandbox acknowledges that not all creators are in possession of CATALYST tokens. To address this issue, it has begun free distributions for these creators, which include all LAND owners. Moreover, LAND owners who participate in subsequent activities are promised an extra allocation of tokens.\n\nNotably, all existing digital assets created on the Ethereum network can remain on The Sandbox. However, there’s also the provision to transfer these assets to Polygon in the near future. Thus, creators can continue to expand their digital landscapes unabated.\n\nThe Sandbox’s blockchain move offers several benefits for both users and creators. Lower transaction costs, upgraded platform functionality, and fresh opportunities underline. For aspiring creators, artists, and users, there are many exciting advancements to look forward to in this ever-evolving virtual world.\n\nWant more? Connect with NFT Plazas\n\nJoin the Weekly Newsletter\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram\n\n*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMi8gFBVV95cUxOZU5nT0FXVVktQUkyWHZQVnd2N01PWHJmOUg0eXBiblVqanJvMFpwbkxPeWZiU1RsSGNLMkhEd0NRdWtOdmQ4cl9lNU8zNWxFTGhpM0h3cGxGZ1JfNVlieTdQMnYtRzgtOU5KelVpWXNDblJ5bU1xc0VvZURTTUdhcVRtbHpHYV95bk1TOGxqQ0dtY01IZS1kMTg5M25IYjdVX2d3WEtGVnRQZ25uX2NJR3FxSU9hVlZaLTVxZGcxaGxzZDZxZGNXNWNnOVlfWXBxSUZxOVVJNXc3bWlQV29tekxYMUNNUl9pZzllblQ3Y3ROZ9IB9wFBVV95cUxQdjcwU0dOa1lfVTNWcHl3bm56QUQ1bDd6dE9ISTgydnlDSDE1aXluWmlJME5ZYUNYeTVzc3o3T0JLY2dkM3JDUVprd19kSWVBdkV2TmZOLXJqOTZoazlzaDhBVF9nVnIzZ3dVbVVjb1hkWVJpMExJczlVWU9adjE2WmlYd2JJNlhQOWdFRTFyU2RHc0NRTVhuOEU1MjlkQVV5VnZiMTNUZENlYU0tWmdiYlhsS2ZyWVNKZjVXUUV3ZklfNExENjg1RXFiY3llQjF6aHhPOUc2bEx3X0hhS2lFdHB0WVdvekN5eTJpXzUxVl9XcGRDM18w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC defends $40,000 as spot ETF marketing wars heat up - FXStreet",
        "content": "Bitcoin price could rise 10% to the three-day supply zone if the $40,000 psychological level holds as support.\n\nEthereum price defending the critical support at $2,147 could precipitate a 7% climb to $2,293.\n\nRipple price could scale a recovery, with 12% gains in the cards for XRP as downward support grows.\n\nBitcoin (BTC) price has shown weakness over the past few days, in what has been presented as a cool-off following weeks of being overbought. The lull extended to Ethereum (ETH) price as well as Ripple (XRP) price as markets ready for the final weeks of 2023.\n\nAlso Read: Bitcoin cool-off prepares markets for crypto’s final two weeks of 2023\n\nBitcoin price could push north amid intensifying spot ETF wars\n\nBitcoin (BTC) price is attempting a recovery, coming on the back of intensifying spot exchange-traded funds (ETFs) wars. It comes after reports that Bitwise and BlackRock continue to fuel Bitcoin ETF approval hopes amid ongoing meetings with the US Securities and Exchange Commission.\n\nMarketing wars are already heating up — we don’t even have approvals yet https://t.co/VDWqQs6tn3 — James Seyffart (@JSeyff) December 18, 2023\n\nWith the $40,000 psychological level holding as support, Bitcoin price could push north to confront the three-day supply zone stretching between $44,074 and $47,488. A three-day candlestick close above the mean threshold (midline) of this order block would confirm the continuation of the uptrend. Such a move would constitute a 10% move north above current levels.\n\nIncreased buying pressure, enough to flip the supply zone into a bullish breaker above the $48,000 level, would set the tone for Bitcoin price to test the $50,000 psychological level. In a highly bullish thesis, the king of cryptocurrency could extend even higher to reclaim the November 2021 highs above $69,000.\n\nTechnical indicators support the bullish outlook, with the Relative Strength Index (RSI) deviating away from a southbound movement after being subdued. This, coupled with the Awesome Oscillators (AO) and the Moving Average Convergence Divergence (MACD) which are still in the positive territory, show that the bulls maintain a presence in the BTC market, thereby accentuating the bullish outlook.\n\nBTC/USDT 3-day chart\n\nOn the flipside, if he supply zone holds as a resistance block, Bitcoin price could extend the fall. A three-day candlestick close below $37,800 would invalidate the overall bullish outlook.\n\nAlso Read: Bitcoin price dips below $41,000 on Monday amidst BTC transaction fee surge\n\nEthereum price defends the $2,147 support\n\nEthereum is defending the critical support at $2,147, a line of defense that if held, could precipitate a 7% climb to $2,293.\n\nLike in the case of BTC, the RSI is also showing strength as more bulls flock the scene, with both the AO and MACD holding in the positive territory. Should this sustain, Ethereum price could soon fall back into the cover of the ascending parallel channel, within which the uptrend would be restored.\n\nETH/USDT 3-day chart\n\nOn the flip side, enhanced seller momentum could see Ethereum price extend the fall, testing the mid-April supply zone that now acts as a bullish breaker. A break and close below its midline at $2,075 on the three-day timeframe would confirm the extension of the fall.\n\nIncreased selling pressure could see Ethereum price test the $1,935 support. A decisive candlestick close below this level would invalidate the bullish outlook.\n\nAlso Read: Ethereum price likely to outperform BTC says JP Morgan report, but short-outlook remains flat despite ETF hype\n\nRipple price could recover amid mounting support\n\nRipple (XRP) price could pivot around the confluence between the 50-day Simple Moving Average (SMA) and the horizontal line at $0.5573 to scale a recovery rally after an 18% rejection from the November 6 supply zone extending from $0.6447 to $0.6885 on the three-day timeframe.\n\nA decisive move above the midline of this order block at $0.6678 would confirm the uptrend, setting the pace for XRP price to confront the $0.7333.\n\nShattering the aforementioned barricade would send Ripple price into the July supply zone stretching from $0.7322 to $0.7990. To confirm the continuation of the trend, the price must record a three-day candlestick close above its midline at $0.7667.\n\nXRP/USDT 3-day chart\n\nOn the other hand, the RSI remains subdued to the downside, pointing to falling momentum. If the sellers have their say, Ripple price could extend the fall, invalidating the bullish thesis by closing below the $0.5773 support.\n\nIn the dire case, the fall could extend for Ripple price to flip the 100-day SMA into a support at $0.5306. Worse, an extended move south could see XRP price test the support floor at $0.4595.\n\nAlso Read: XRP price risks 7% fall as Ripple lawyer names ‘the single biggest threat to crypto in the US’\n\n(this article was corrected on December 18 at 20:53 GMT to say, in the third paragraph of the Bitcoin Technical Analysis section, that if the buying pressure increases, not selling pressure.)"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNUXdLd2FIWXp2X2FFbHd1aFkxS2t5dnhWd1RIa0dEN0lyVUNob29VckVLSkFVczdxNUs1M2loSHB3ak9NUW1jdzdSSlJCbHJLVVI4cTMzX2xVLXNMdHFzNVNJSzJhZms3NV9YaTJ3Tm1RYkpZTVhrRTdFYlNaR1hNTGtkTlAxNm9USEVEbElaUWtzNHhyd0NRWlpOX3lobXA5V1IzaWNLS3cyZldkNENSTkNRQ08xaFhxVFZFQnA5U19BaUVobGFSbFNJaVA2MG4yNlVr0gHYAUFVX3lxTFBuYUQxeFBhWHhPQzR0UzlUMVY1S3RwZ1Zma0pZSnVMSTU5djFhOU9LNjRNMUotZ0tmVVdGVEhWMVZXNWYxS3dFWk1FN0RDaGkzalIwanctcXRnUFphZEc1ck01akQwcC1KSXUxbW5hRHk4Y2VHRFZvSkJ5ZkhSb0RGMlBYaTMtQ1FEMUhZTnc5WEJkZXRnbmtHYWhhY2N4TEV1X1AtWjFDV0Q0RTRyWnFnZDNFakpVcjFvZHVSMUhXWjFrX05BeERMTU9za0JMdk03d0NHUkg2cQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Veteran Trader Peter Brandt Issues Ethereum Alert, Says ETH Could Crash by up to 70% – Here Are His Targets - The Daily Hodl",
        "content": "A widely followed crypto analyst is issuing a warning about the second-largest digital asset by market cap.\n\nVeteran trader Peter Brandt warns his 707,300 followers on the social media platform X that top altcoin Ethereum (ETH) could soon see an epic crash that sends it below $700.\n\n“Classical chart patterns in price charts are not sacred – they fail to perform according to the textbooks all the time.\n\nBut, if the rising wedge in Ethereum complies with the script, the target is $1,000, then $650.\n\nI shorted ETH on Friday — I have a protective B/E stop.”\n\nWhen questioned by a follower if the pattern Brandt characterized as a rising wedge was not interpreted as an ascending triangle, a typically more bullish technical analysis pattern, Brandt offers further insight into his technical analysis process.\n\n“1. I did consider (and still might consider) the ascending triangle interpretation.\n\n2. When in doubt on a pattern I look at [the] closing price line chart – in this case, a wedge.\n\n3. Too many on Twitter are calling this an ascending triangle – my contrarian tendencies.\n\n4. Super low risk shorting set up.”\n\nWith ETH currently worth $2,156 at time of writing, a fall to $650 would represent a nearly 70% decline for the leading smart contract platform.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/CYB3RUSS"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNTW9fWXFtdFEzbU5IU1dxbkYtTHdKNzVtUE9iaWVtWG9vYzBUaTJSSkVLVk9iQ242QmlPUzYzNVFUMjdvVFE2V0hLV3VpLThVS2thR3ZnTEZHRlFQYjNuSzRlcDM4cm8tMlVhNlljS3owZEx4ejRvYzRReU1NYUZNXzducVNSc2czR0x6TEN3UTlEaGNJVTBKbWFid0FrelBWdG5vQlpXYUpuams?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "How Index Coop is Capitalizing on ETH's Price Momentum - CoinDesk",
        "content": "Why the on-chain structured product market is so small is something we looked at in our white paper. We also recently published an article where we asked six experts in our space this exact question. Several of these experts cited the lack of access to these products, especially in the U.S. where ambiguous and antagonistic regulatory efforts are shutting down many on-chain providers. Many structured products are also not as cost-effective as they should be, especially since most of them are on Ethereum mainnet where transaction costs can be prohibitive for smaller users who may want to dollar cost average in."
    }
]