[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE53UEp6bm81V1l6VXRZUjFOcE9ZbXBMS2ZNakRmVndUOTNPWG1mRXNzNi1pQjNFUmpOczlWNXZfSmVBUGRPSGJibzNCd1F5UmFSVTNwUF9ROVAzSEJwb1NMY0QyWVZzME41cnFr0gFwQVVfeXFMT3FZai1LcjRSVE0wM09yZzA1NkFiTnZDYTl2MEw5VTE2eEFFS3RQSnVja2l4Y1pscV9hZmYwRFIxbHZKaVNEbjBLc1ROMEhGWE5jSF9xM2U4TnlZOTFDTnpGTFAxTE5lSUxob0pVSnVFeg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 03:01:54 GMT",
        "title": "Ethereum Insider Ready For Battle: ETH Founders' Fraud Proof Coming In 4-5 Days | Bitcoinist.com - Bitcoinist",
        "content": "Steven Nerayoff, one of the earliest advisors for Ethereum, has had various debates and discussions concerning Ethereum in the past few weeks. The former lawyer for the crypto firm has never wavered from his position that Vitalik Buterin and Joseph Lubin, the co-founders of Ethereum, engaged in fraudulent activity during the early days of the network and that the SEC was corrupt in its dealings with Ethereum.\n\nWhile speaking in a Space hosted on social media platform X, Nerayoff revealed he has recorded proof that could heavily implicate Ethereum co-founder Vitalik Buterin.\n\nFormer Ethereum Advisor Claims to Have Proof of Fraud\n\nNerayoff has always asserted that the extent of fraud in the Ethereum ecosystem’s early days surpasses the scale of the FTX scandal, which led to the exchange’s bankruptcy. This saga has continued in this high-stakes battle over the transparency and decentralization of one of crypto’s largest ecosystems.\n\nNerayoff had been initially talking with other speakers on the podcast about the SEC’s plan to ultimately decide who and what becomes a security in the crypto industry before switching topics to the ETHGate scandal.\n\nAccording to Nerayoff, the Ethereum Foundation had run into troubles in 2015 as it actually looked like it was going under. Buterin reportedly ran to Nerayoff for help to save and restructure the foundation, as he had created the utility token and ICO for ETH.\n\nNerayoff mentioned this conversation with Vitalik ran up to three hours, and he had it recorded, and it is ready to be released as a free NFT and a transcript in the next four to five days.\n\n“So he asked me to restructure the entire Ethereum Foundation to save it and I’ve got the whole thing recorded. I’m going to drop it. We’re doing it as an NFT. It’s free, but everybody can have it,” he said.\n\nThe Ethereum former advisor also talked about how the SEC basically gave a free pass to Ethereum amidst the ETH Gate scandal. The SEC had initially considered ETH’s utility token as a security before former director Will Hinman gave a speech noting that BTC and ETH were decentralized and not securities. On the other hand, the SEC went after Ripple and XRP on claims of centralization.\n\nHowever, Nerayoff is of the notion that ETH was centralized when the speech was made, and neither Joe Lubin nor Vitalik Buterin could boast of its decentralization at that point. Furthermore, Nerayoff noted that there was internal documentation at that point that indicated that the network hadn’t met the requirements in order for it to be decentralized.\n\nThis internal documentation was reportedly only accessible by Nerayoff, prompting regulators to go after him on charges of extortion. Prosecutors have since dropped these charges, but Nerayoff claims it was all a setup. He also claimed the SEC, FBI, and the DOJ fabricated the evidence, and it was all done in a bid to take him out.\n\nNerayoff’s accusations have been explosive and threaten to shake investor confidence in Ethereum. Many members of the XRP community have also questioned the SEC’s inconsistencies.\n\nNerayoff failed to go into details of his conversation with Buterin, and he said he wasn’t going to mention which particular laws were broken. Still, he did insinuate that it contained proof that Ethereum’s early founders themselves did not believe the network was decentralized during its launch.\n\nThe release of Nerayoff’s recording could spur legal action against Buterin and other ETH founders. When asked if his recorded evidence could lead to criminal charges for Buterin and Lubin, Nerayoff said that’s up to the SEC and the DOJ.\n\nETH bulls still holding price steady above $2,000 | Source: ETHUSD on Tradingview.com\n\nFeatured image from Cryptopolitan, chart from Tradingview.com"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQNnZYRXFlaWxSNW9PcldJNWlqSHRpOWxldmlLOHhndy1FSEFrZUJkdWN5TmIyd1dHUnFLWXR4UW52dDVUNVlaRjlhWW5JMVhRTUczRTlObERUdEFRUVc2dy1aX2tpb2pTNUlabkNmNXcwZUx6TEZ5ZE04UWdRNWVyaQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "What Is the Ethereum Cancun Upgrade? - Binance Academy",
        "content": "Key Takeaways\n\nThe Ethereum Cancun upgrade aims to enhance scalability, security, and efficiency within the Ethereum network, introducing the concept of proto-danksharding.\n\nDanksharding represents the final phase of the Ethereum 2.0 (Serenity) upgrade that enhances data management and transaction processing.\n\nThe Ethereum Cancun upgrade is designed to bring faster transaction processing times, reduced transaction costs, and optimized data management. Potential risks include impacts on existing smart contracts and the integration of new data storage techniques.\n\nThe Ethereum Cancun upgrade was initially planned to go live in October 2023 but was later delayed to the first half of 2024. It went live on the Ethereum mainnet on March 13, 2024.\n\nIntroduction\n\nEthereum's transition to Proof of Stake (PoS) and the introduction of sharding are vital components of its Ethereum 2.0 upgrade. PoS reduces energy consumption by replacing miners with validators, who are selected to create new blocks based on the amount of ETH they stake.\n\nMeanwhile, sharding increases transaction speed by partitioning the Ethereum network into smaller pieces (shards), with each capable of independently processing transactions and smart contracts. The shift from PoW to PoS enables secure and efficient sharding by randomly assigning validators to specific shards, preventing manipulation and enhancing performance.\n\nThe Ethereum Cancun upgrade represents an important advancement in the Ethereum blockchain, aimed at fortifying the network's scalability, security, and overall efficiency. This upgrade introduces the concept of proto-danksharding, an important step toward optimizing data management and enhancing transaction affordability within the Ethereum ecosystem.\n\nBy leveraging innovative data storage techniques, the Ethereum Cancun upgrade is poised to revolutionize the way the network processes transactions, paving the way for a more accessible and seamless user experience.\n\nUnderstanding the Ethereum Cancun Upgrade\n\nThe Ethereum Cancun upgrade (also known as the “Cancun-Deneb” upgrade) is a concerted effort by Ethereum to bolster its infrastructure and address unresolved issues after the Shanghai upgrade.\n\nThe Cancun upgrade is based on four Ethereum Improvement Proposals (EIPs): EIP-4844, EIP-1153, EIP-4788, and EIP-6780. Together, the implementation of these EIPs can provide many benefits, including improved scalability, enhanced data storage and availability, and reduced transaction costs.\n\nWith a primary focus on optimizing the execution layer (Layer 1), the Cancun upgrade prepares the network for the future implementation of full data sharding, a vital component in Ethereum's long-term development strategy.\n\nSharding refers to splitting a blockchain database into smaller portions, called shards, for higher efficiency, and the Cancun upgrade introduces a specific type of sharding known as proto-danksharding (discussed below).\n\nThe goal of the Cancun upgrade is to increase the network’s transactions per second (TPS), aligning with Ethereum's roadmap's \"Surge\" phase, aiming to scale performance to 100,000+ TPS.\n\nThe Cancun upgrade – along with the subsequent Deneb upgrade – represents a significant milestone in Ethereum's journey towards establishing itself as a leading decentralized finance platform.\n\nDanksharding and Proto-Danksharding\n\nDanksharding and proto-danksharding are different iterations of the sharding technology developed for Ethereum. Named after Ethereum researcher Dankrad Feist, danksharding is a type of sharding that serves as the final phase of the Ethereum 2.0 (Serenity) upgrade. It concentrates on optimizing data availability for rollups within the Ethereum network.\n\nTechnically speaking, danksharding is a design that introduces the concept of a merged market fee. While traditional sharding has different blocks and block proposers for each shard, there is only one block proposer in danksharding. In simple terms, danksharding can enhance transaction processing and streamline data storage by simplifying the sharding architecture and prioritizing data management.\n\nIn the context of the upgrade, proto-danksharding (introduced by EIP-4844) serves as a prototype of danksharding. It’s a temporary solution that can significantly reduce gas fees associated with rollups before the complete implementation of the danksharding framework.\n\nBlob-carrying transactions\n\nBlob-carrying transactions were introduced along with proto-danksharding (EIP-4844) to help reduce gas fees. Blob-carrying transactions allow the temporary storage and retrieval of off-chain data, meaning extra data can be added to Ethereum transactions in a more cost-effective way.\n\nBenefits of the Ethereum Cancun Upgrade\n\nAs we’ve discussed, the Ethereum Cancun upgrade can provide a range of benefits, including faster transaction processing, reduced transaction costs, optimized data management, and improved cross-chain communication. By introducing the concept of blob-carrying transactions, the upgrade aims to streamline data processing and enhance overall network efficiency.\n\n1. Better scalability: Proto-danksharding introduces temporary data storage capacity, allowing Layer 2 rollups (and the network as a whole) to process more transactions per second.\n\n2. Reduced transaction costs: Blob-carrying transactions allow extra data to be added to Ethereum transactions in a more cost-effective way.\n\n3. Optimized data management: EIP-1153 can optimize block space and reduce on-chain data storage costs.\n\n4. Better cross-chain communication: EIP-4788 aims to improve interoperability between different blockchain networks by exposing the Beacon chain to execution layers.\n\n5. Improved security: EIP-6780 can reduce the risk of smart contract termination by disempowering the SELFDESTRUCT code, enhancing the security of user data and funds.\n\nPotential Risks of the Ethereum Cancun Upgrade\n\nThere might be risks related to the potential impact of the upgrade on existing smart contracts and the intricacies of integrating new data storage techniques. These require extensive testing and careful consideration during the implementation phase to ensure a smooth transition for all stakeholders involved.\n\nThe Ethereum Cancun-Deneb upgrade was initially planned to go live in October 2023 but was later delayed to the first half of 2024. It went live on the Ethereum mainnet on March 13, 2024 (at epoch 269,568). Node operators and stakers must upgrade their software to releases listed in the official announcement.\n\nClosing Thoughts\n\nThe Ethereum Cancun-Deneb (Dencun) upgrade marks a significant leap forward in Ethereum's quest for improved scalability, efficiency, and user experience. By introducing proto-danksharding and laying the groundwork for future advancements, the Ethereum Cancun Upgrade will likely enhance the realm of decentralized finance and blockchain technology.\n\nFurther Reading\n\n\n\nDisclaimer: This content is presented to you on an “as is” basis for general information and educational purposes only, without representation or warranty of any kind. It should not be construed as financial, legal or other professional advice, nor is it intended to recommend the purchase of any specific product or service. You should seek your own advice from appropriate professional advisors. Where the article is contributed by a third party contributor, please note that those views expressed belong to the third party contributor, and do not necessarily reflect those of Binance Academy. Please read our full disclaimer here for further details. Digital asset prices can be volatile. The value of your investment may go down or up and you may not get back the amount invested. You are solely responsible for your investment decisions and Binance Academy is not liable for any losses you may incur. This material should not be construed as financial, legal or other professional advice. For more information, see our Terms of Use and Risk Warning."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOZVB3QzNPZXBjVGhZZ1c3eWRpYjdEVUJfcUlZVk4wdk1qUEhzbzRqTlo5V0kyazg0dU5FRWxpM3ZDNk5YYTVCYzV5Y3duLUpaeHhSNS1TZjA4Yl9XYXg1Ulo2elB5cE00R184Uld5Z3VOUjVsUWVpYTA3NnF3N0txVUFlOEVxVnRhcG1WSEszdEo1QV82OFV0RHVRNkczVDhvY2J3bnpFbnlCbFZlWkJxRER0NEpwOVVtNnFRdC1xQlQtZ1NBLS1aeXRCajd4ZkVZYUZrYdIB2gFBVV95cUxOTTBMZnNicjdWd080Tzl5MGhLZjJhMzJySWRfVlRIZXRrX0JpSy1odzhCLXZRaE9hX1M5NExTZ3dZUm1kNWVtTzVEQzJpakJvYnFNY0twalJEbjR4U2JyTVBTMXo5WlNudU5DbHZsNC0teHl3eHNvNWR3WENKZE1DMVQ1ZGN4YlJ2bU5fVzVwX2owTDBMVlBwLVhGNjFpT2o4V2dIbGlhQjBILUVPc3ZMMExRZ2o2ZW9xc0RkLUtfRTBIU1ZFMHdTOFdaSG5CUVY2UU1Ud3o2bUpDdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Former Goldman Sachs Executive Says Ethereum Is About To Outperform Bitcoin As Crypto Enters Late Spring - The Daily Hodl",
        "content": "Macro guru Raoul Pal says that the top smart contract platform Ethereum (ETH) is set to outperform Bitcoin (BTC) as the crypto markets enter into a new “spring” phase.\n\nThe former Goldman Sachs executive tells his one million followers on the social media platform X that based on the Tom Demark Sequential indicator, ETH is setting up to outrun BTC.\n\nThe Demark Sequential aims to identify points of trend exhaustion or price reversal.\n\n“That is the weekly DeMark 9 count for the ETH/BTC cross. ETH most likely outperforms from here as per usual at this stage in late Crypto Spring.”\n\nPal goes on to say that Ethereum-based exchange-traded funds (ETFs) will be the “holy grail” for asset managers, at least until some form of competition emerges.\n\n“An ETH ETF is the holy grail for asset managers as they can capture the yield and only give price performance to the ETF holders. It is a super profitable business until it gets competed away eventually.”\n\nHowever, one prominent crypto analyst has a stance that contradicts Pal’s assessment of Ethereum outperforming Bitcoin.\n\nRecently, crypto strategist Benjamin Cowen issued an alert, saying that Bitcoin Dominance (BTC.D) – which tracks the percentage of the total market cap that belongs to Bitcoin – will continue to be bullish, meaning that altcoins, including ETH, will lag behind BTC.\n\n“My crypto portfolio for the last couple of years has been predominantly just Bitcoin because I suspect that it will outperform most of the rest of the market – not all of the market, but most of the rest of the market – and that’s why the dominance has gone higher.”\n\nEthereum is trading for $2,080 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQclRQeVdiT3V5U3M2ZzVrTmZoY0k3c0pQY0x3bmN2UFF4SWMybHgwclVicFYzeUJmc1E4UWl1M1lQV1dMZjI5a3Qtb1YxOTI5UENLcUlNSGp0a2ZnRFJ2Z3czS0xyX3hkWGE4RmdhaGdubWlnVkVDYUl1VllPVld2S2dZaGkyeEFYRC1vOU96Q1czQ3hj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin price will continue dwarfing Ethereum, analyst says - crypto.news",
        "content": "Into The Cryptoverse CEO Benjamin Cowen recently discussed Ethereum’s (ETH) performance in relation to Bitcoin’s (BTC) dominance as the flagship digital asset.\n\nIn a recent YouTube video, Cowen suggests a continued rise in Bitcoin dominance (BTC.D), indicating that Ethereum may lag behind and show smaller gains compared to BTC.\n\nCowen explains that his crypto portfolio has predominantly held more Bitcoin because he anticipates that BTC will outperform numerous assets, though not all.\n\nAdditionally, Cowen notes that Ethereum against Bitcoin (ETH/BTC) is encountering substantial resistance after falling below the trendline and attempting a retest.\n\nYou might also like: Bitcoin and Ethereum outperform traditional assets in 2023\n\nA BTC rally would result in the breakdown of Ether-Bitcoin, he explained. He pointed out how the ETH/BTC pair finally broke the wedge to the downside, highlighting that it’s akin to what happened in the last cycle.\n\nAs he connects the dots, the Ether-Bitcoin pair is potentially backtesting the trendline that served as support in October 2022, March 2023, June 2023, and September 2023. Since the ETH/BTC pair is now testing from beneath the wedge in November 2023, it could offer a significant resistance level.\n\nHowever, Cowen cautions that even if ETH/BTC manages to move above the trendline, the pair will encounter several resistance levels to the upside. These levels must be successfully flipped as support to convincingly reverse the downtrend.\n\nHe further explained, stating that, there are numerous resistance levels. Whether one opts to depict them horizontally or analyze them differently, ETH/BTC still faces a significant challenge. It must have to overcome these resistance levels to indicate a meaningful reversal.\n\nAt the time of writing, ETH/BTC is valued at 0.05578 BTC, equivalent to $2,068.80 on Tradingview. Meanwhile, BTC/USDT is valued at $37,112, according to Coingecko.\n\nETF expectations\n\nThe recent surge in Bitcoin and Ethereum has significantly influenced the cryptocurrency market.\n\nBitcoin has reached $37,000, marking highs not seen since May 2022. This may be driven by the ongoing expectation that U.S. regulators approve a spot Bitcoin exchange-traded fund (ETF).\n\nSimultaneously, Ethereum has rallied close to $2,100, reclaiming the $2,000 level for the first time since mid-July. The rise in digital assets, especially XRP, may also be attributed to Bitcoin surpassing $35,000.\n\nAdditionally, news about BlackRock planning to file for an ETH-based ETF may have also fueled Ethereum’s upward momentum.\n\nFollowing the anticipation of the ETF approval, which has propelled cryptocurrency prices and related stocks, This rally could be part of a broader uptrend in the crypto sector, recognized as a significant $17.7 trillion opportunity by market strategists.\n\nHowever, altcoins like XRP, DOGE, UNI, and XLM have experienced declines, possibly due to a pause in capital rotation towards smaller tokens.\n\nFed chair Jerome Powell recently delivered a policy address to the Economic Club of New York, providing insights into the current state of the US economy and monetary policy.\n\nThis statement is significant given the critical juncture of the U.S. economy, marked by improving inflation figures alongside surging Treasury yields, creating conflicting signals about the direction of monetary policy.\n\nInterpreted as a signal, Powell’s statement suggests that the Fed might persist with its tightening cycle, contrary to recent market expectations of a more dovish approach."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPOWtQdFFoQUctUXd4NGtIZ1IySEdOM0xwMGpmQnA4QXBucU41eTVQUU1pY1Q3ZkVGSWxvcElwUFcySzZYeF9mVHZsRWdmOU14WlpvaTlpZ011RlJTRVc5eUhuZDhSV01xMG03RDc3Sk80YmxtczIwRHl0SVc4QjRialBNNzlCVHhQZk1GZkxmS2N5NVNqTVg1aGEzYTBIMTBOTlhucEhFakNfNER0eERKNGUtZ2todktJaXNhRGFpblBLVmtn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Arthur Hayes predicts Bitcoin to hit $1 million, Ethereum $100,000 - Investing.com",
        "content": "Arthur Hayes, the co-founder of BitMEX, has expressed a highly optimistic outlook for and , predicting that Bitcoin will eventually reach $1 million and Ethereum will surge to $100,000. His bullish stance comes at a time when both cryptocurrencies are experiencing a bear market, with Ethereum trading at $2,097 and Bitcoin at $37,083 as of today.\n\nHayes attributes his predictions to the ongoing debasement of global currencies. He believes that this economic backdrop will elevate Bitcoin and Ethereum to the status of crypto's reserve assets, setting them apart from other cryptocurrencies which he views as less significant.\n\nOn Friday, Hayes reiterated his confidence in the two leading cryptocurrencies, foreseeing a 4,669% increase in Ethereum's value. He also maintained his belief in Bitcoin's potential to hit the $1 million mark. This came after a week where Bitcoin saw an increase of seven percent in its value to $37,112.53, and Ethereum rose twelve percent to $2,058.51.\n\nHayes also sees potential in layer-one blockchains like despite their struggles during the current market downturn. He suggests they could offer significant returns but questions their ability to outdo Ethereum in areas like active developers, DApp activity, or Total Value Locked (TVL). He described these alternatives as overhyped and unlikely to surpass Ethereum's dominance.\n\nIn addition to his forecasts for Bitcoin and Ethereum, Hayes predicts a value surge in decentralized applications (DApps) and their associated tokens. While acknowledging the increased risks involved, he hints at the substantial returns they could yield for investors willing to navigate the volatile crypto landscape.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxQT25oTkVRcVhBN0x5MWZmMnVfdDk5WWZTenFqMnVWMnc5b2NER2dBRWZBUDNTTEZRT08tVDFlOTZMS0xzVnlQUTk4VGZESi1tS3Z0aU1hSlJsaFphTE04WmQ4ZjByQ2V0MFh5d3lpY0ZNbjF1VU1EZkZhdmtWWkdSS2NkWnlwWUFkWFQybE9fVmhSZGVqYUtsOUZlOWJwcmJxZE9DQzcwX3JTMzYxSERnUlF0elZmZEdBdTg1ZnpDdHNoMnNqT2ZKUzRMXzRMazd2M1FRLTVxci1oUm1NNkt0eEhYUnFreUJtbVEyWVo2RHfSAfYBQVVfeXFMUEY5TWx1ODhuTGlHaHJMM1RXMlZ3d0NYZW1aenMzdk1lWWZNYkp0Qm5uSGN4QXp3M2hPdlVpWVZPQ1oxWFpkd29hbjM1Tm4tcXplMko3ZUFDN0tKMU1qR1VVR0dlSjQ4aHgyamdoWGlmcm85dDhVVmhEUGp5aXg0aUlJeG9NUnJURTduQTNva29kdUc1OGh0eS1oT0hKMDhZc0cxcEJmQUIxdk5iNmZ2blFnUHJPbmk3ODh1MHpfUnlmSUZpQnV6ZGp1bmt5T0VLZDJjd0VMbkhURHRtTElvUGk4V2UzaUExclAweG1EWGJxN0Z0dGtB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Eighteen-months ascending triangle pattern appraises $4,000 target for ETH - FXStreet",
        "content": "Ethereum price has been consolidating along an ascending trendline for the past eighteen months, with the $2,035 level holding as resistance.\n\nThe overall price action has formed an ascending triangle pattern, which forecasts a $4,736 price target for ETH.\n\nThe bullish thesis will be invalidated once the altcoin breaks and closes below the ascending trendline at the $1,500 psychological level.\n\nEthereum (ETH) price is bullish on lower and higher timeframes alike, as token holders ride the wave of what already seems to be the making of a bull market. On the higher timeframe, however, the target objective for the largest altcoin by market capitalization looks overly ambitious, but not impossible as community members turn faces toward the exchange-traded fund (ETF) narrative and the much-anticipated Bitcoin (BTC) halving, together with their combined effect on asset prices.\n\nAlso Read: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC rages on, $40,000 may not be hopium after all\n\nEthereum price 18-month ascending triangle forecasts $4,736 target\n\nEthereum (ETH) price consolidating above an ascending triangle, combined with the effect of the formation of multiple local tops around the$2,035 level has led to the formation of an ascending triangle pattern.\n\nSuch a technical formation is created when the asset’s price lead to the formation of a horizontal line connecting the swing highs, while a rising trendline trails it from below connecting the swing lows. Together, the trendlines form a triangle, with traders watching for breakouts from the horizontal trendline. The target objective for such a technical formation is determined by measuring the height of the triangle and superimposing it at the breakout point.\n\nFor Ethereum price, the height of the triangle is around 134%, from $865 to $2,035 on the weekly timeframe. Superimposing this percentage difference on the weekly chart puts a target objective of $4,736.\n\nThe Relative Strength Index (RSI) spurs optimism, moving north to signify rising momentum while its position at 64 shows there is still more room to the north. Effectively, the Awesome Oscillators (AO) histogram bars are also flashing green to show the bulls maintain a strong presence in the ETH market.\n\nETH/USDT 1-week chart\n\nOn the flip side, profit-taking could nullify the projection by sending Ethereum price south, potentially losing the support offered by the ascending trendline at the $1,500 psychological level. This would invalid the bullish thesis."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQemFVNmJ5YWpFQWR4dUJIMlR1QjBuZTFRT29TSm0wek9HZFNaaGcwZDQydXYteGYtaWRKR0M2Q3dzU1BhaGplWDNjTlk3OW5aRUE5aU02ZXoxY1BGamNROFI2RHdmTGIyejZSM1ZDVW5VRXpmWG5JdU1Wa2NiVnllZnNVUm50TE1HalHSAY8BQVVfeXFMT3VieW9qektoQUVJd2RTcEZWUDZYSm1XeDRpLWJjRk14eEVIWUVuUGRIX2xVRHlMNXp6OW9MbHBPS01vclNiLWE5cWVxbXN5M0JSbTh6VktESnBicW9CRHgtaW9TOWxxM0VTQXppWlFpWWZXa2hIUnZKeUUwWDNtcE14YUctWlNVbWl2Qm42NHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Institutional and Whale Demand for Bitcoin and Ethereum Skyrockets - U.Today",
        "content": "Advertisement\n\nBitcoin, Ethereum and Polygon are experiencing a remarkable surge in large-scale transactions, also known as \"whale transactions.\"\n\nNotably, Bitcoin has seen an 80% increase in transactions valued over $100,000.\n\nSimilarly, Ethereum's large transactions have soared by 170%, while Polygon has witnessed an unprecedented rise of over 3,800% compared to their respective volumes just 30 days ago.\n\nLarge transactions\n\nData from the past week highlights the scale of this uptick in high-value transactions. Bitcoin recorded 16,410 transactions in the last 24 hours, peaking at 22,570 transactions on Nov. 9. The lowest was 12,810 transactions on Nov. 5.\n\nAdvertisement\n\nIn terms of transaction volume, Bitcoin saw $24.4 billion in the last 24 hours, with a high of $39.02 billion and a low of $18.1 billion within the same week. Ethereum's large transaction count stood at 3,560 in the last 24 hours, reaching a seven-day high of 7,590 transactions and a low of 3,040.\n\nIts transaction volume echoed this trend, with $2.91 billion in the last 24 hours, peaking at $6.59 billion and a low of $2.47 billion.\n\nFor Polygon, the number of large transactions reached a seven-day high of 209 transactions, the same as its count in the last 24 hours, with a low of 34 transactions. The transaction volume mirrored this surge, with the last 24 hours seeing $194.42 million, a seven-day high of $357.59 million and a low of $28.81 million.\n\nRenewed institutional demand\n\nThe significant increase in whale transactions across these cryptocurrencies is largely attributed to renewed institutional interest. The crypto market is abuzz with anticipation for the launch of spot Bitcoin ETFs by January 2024, a development that is expected to further fuel institutional demand.\n\nAdditionally, BlackRock's plans to introduce a spot Ethereum ETF have added to this excitement. Institutional demand plays a crucial role in the crypto market, as it not only brings substantial capital but also lends credibility and stability to the digital currency ecosystem.\n\nThe entry of large financial players and the creation of more accessible investment vehicles like ETFs are seen as key drivers for long-term growth and mainstream acceptance of cryptocurrencies."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNQlJVM2JMQXZZM3pFQTZGUUZVd19uTjZhRWt3SlE4MmFLUG9zLWZub1BvVUJpczN0bXNPemFXeDV3elhQX1RYLUJXNE5pZ0lOR3ZxQ01vdHpqQm5ReDh5eW9DWWlLWjQ0dmJ3VnFycVpfcWJMZjZCbHlzVFotOEhVV1c4UnEtckN5T2NqTTBKYXZfT3NE0gGcAUFVX3lxTE8zbVVVX0w5MHFSdVczZVA4aWlDOXBZRmg2bTFuVjlNeU9uclF5RUdFS2w2dUtCU0dLdzYxekN0UDVQbm90TE5Dem1tX2wzOXpqREVGc0RuS2YxNGJNbGJpaWM2Qm5XX2hCS2ZuR1BUSHdtQTd1dTNIR1RTaUR0cVZjSExlYmFzVmgzQTJ1bUJyN0lfQXlOOWJpMUlybw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Why WNBA Star Jewell Loyd Relies on Crypto—And Why Bitcoin and Ethereum Are Her 'Anchors' - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nNobody in the WNBA can put the ball in the basket quite like Jewell Loyd, whose 939 points scored for the Seattle Storm this past year set the league’s single-season scoring record. That surpassed Diana Taurasi’s previous record of 860 points scored in 2006.\n\nOff the court, Loyd has become the face of crypto-savvy athlete investors for Coinbase, which has been the exclusive cryptocurrency partner of the NBA and WNBA since 2021.\n\nThe 30-year-old Chicagoland native bought her first Bitcoin in 2013 while playing collegiately at Notre Dame. Loyd and her brother, former pro basketball player Jarryd Loyd, entered the crypto market together after growing up with parents who stressed the importance of financial literacy.\n\n“I was one of the first people to come out and publicly say I’m investing in crypto and taking some of my salary in that,” Loyd told Decrypt. “Right after that, any team we played always had one person who came up to me like ‘Yo, why'd you do this? What is this?’\"\n\nAD\n\nAD\n\nImage: Klutch Sports Group\n\n“That was my time to educate,” she continued, “which was cool because I wasn’t the kid in school that everyone asked how they figured a question out. I was the one always asking questions. So to have that reversed was kinda cool.”\n\nCoinbase creates crypto educational content in partnership with the WNBA, and introduced an in-person crypto crash course to rookies at the 2022 WNBA Draft. Loyd converts a portion of her WNBA salary into cryptocurrency through the Coinbase app, with Bitcoin and Ethereum comprising her majority holdings.\n\n“To me, those are like the anchors,” she said of Bitcoin and Ethereum, the leading cryptocurrencies. “A basketball analogy is that you always need a good center. And those two are good centers for me.\"\n\nAfter making her fifth All-Star team this past season, Loyd signed a two-year, $463,000 contract extension with the Storm to remain where she’s won two WNBA titles (2018, 2020) since Seattle drafted her with the first-overall pick in 2015.\n\nAD\n\nAD\n\nWith salaries not nearly as lucrative as their male NBA counterparts, many WNBA players play overseas during offseasons for added income. Crypto’s decentralized nature has been useful to Loyd as she’s played for professional teams based in Turkey, China, South Korea, and Spain.\n\n“[Coinbase] has been one of my personal favorite partnerships with the WNBA, because obviously I’m invested in it—but it also lets women get ahead in the financial world,” Loyd said. “I’m very lucky to play overseas and live overseas, but sending money and using money overseas is very hard. Having a [faster] and more inexpensive way to transfer money overseas and back and forth makes sense.”\n\nCoinbase gave out $120,000 in Bitcoin to players on the New York Liberty and Las Vegas Aces as part of its sponsorship of the WNBA Commissioner's Cup midseason tournament in August. The league has also offered NFTs to fans though Coinbase, such as a digital collectible to commemorate Loyd’s Storm teammate Sue Bird for those who attended Bird’s jersey retirement ceremony at Seattle’s Climate Pledge Arena in June.\n\nLoyd said that Crypto’s biggest assist has come during her continued efforts to aid Rwanda, where Loyd and her brother send computers and money to support locals.\n\n“We’re always trying to figure out ways to send money to help our cause, and without using crypto, it would have been so much harder,” she told Decrypt. “When they need it right away, it gets there. It’s more efficient and we see more change that way with the community we’re working with.”\n\n“Working in Rwanda, they’re so talented. They just don’t always have the resources,” Loyd added. “I’m very passionate about giving to the next generation of kids and athletes. Anyone who wants to learn, I’m willing to help them.”\n\nEdited by Andrew Hayward\n\nAD\n\nAD"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE4tYTFGWWJhQ2NSZk9wM1BZdjRWRVFYZEI1Qmp6R0MtenVaLU00MmZER1ZCT3N2V2xCVWIxY3hDTGVVUl9Ra0ZMRS05dENBU3ZudkZ5VWNwMTJwYXR2UGtjTXR2cmUxTFQ0ZTVGXzNUT1U0bGMtSFJ2bE5B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Surges To $2,132 As Blackrock's Move Sparks Enthusiasm - TronWeekly",
        "content": "Ethereum has hit a high of $2,132, riding a wave of enthusiasm driven by the news of Blackrock’s recent submission of an ETF for SEC review, as per Santiment X post. This surge reflects the growing optimism surrounding the second-largest cryptocurrency in the market.\n\n📊 #Ethereum has reached as high as $2,132 as optimism surrounding the #2 asset in #crypto surged with #Blackrock's new submitted #ETF for the #SEC's review. Our latest insight looks at $ETH's #onchain health and its chances to continue its growth. 👇 https://t.co/8sBC9d1lWT pic.twitter.com/2PruVIM4Ve — Santiment (@santimentfeed) November 11, 2023\n\nEthereum dominates discussions in the crypto sphere, marking the highest increase in conversation compared to its usual trends. The spike in interest correlates with Blackrock’s confirmation of an official filing for a Spot Ethereum ETF with Nasdaq, now awaiting SEC approval.\n\nThis revelation has infused a moderate level of euphoria among traders, propelling ETH’s price to the cusp of a 1.5-year high. The crypto community, both traders and influencers, is ablaze with bullish sentiments regarding the potential impact of these ETFs on the crypto sector.\n\nThe industry also speculates that Blackrock’s move may signal positive indications for their earlier Bitcoin ETF filing in June. However, the certainty of these ETFs remains a subject of debate, albeit Ethereum’s significant lead in social volume reinforces its current prominence.\n\nConversely, deeper insights into Ethereum’s network health via Santiment’s metrics reveal a mixed picture. While some utility metrics show strength with rising transaction volume and circulation, signals of concern emerge. The surge in whale transactions, simultaneous with substantial dumping by key stakeholders in the $100K-$1M tier, raises alarms of profit-taking.\n\nEthereum Surges to $2,132 as Blackrock's Move Sparks Enthusiasm 6\n\nMoreover, the spike in Ethereum’s social dominance amid price surges indicates elements of FOMO and greed, adding complexity to the overall outlook.\n\nEthereum Surges to $2,132 as Blackrock's Move Sparks Enthusiasm 7\n\nThe community, while excited about the ETF potential, is cautioned against the uncertainty of its confirmation. The fervor might simmer down, giving way to impatience in the coming weeks or months.\n\nThe future of Ethereum’s growth remains subject to the intricate interplay between market dynamics, investor behavior, and regulatory decisions.\n\nEthereum Price Analysis\n\nThe present value of Ethereum stands at $2,064.29, accompanied by a trading volume of $13.86 billion within the last 24 hours. Its market capitalization is estimated at $248.26 billion, contributing to a market dominance of 17.48%. Notably, there was a decrease of -1.69% in the ETH price over the past day.\n\nSource: CoinMarketcap\n\nAs per Coincodex’s current forecast, Ethereum’s value is anticipated to climb by 5.14%, aiming for $2,165.91 by November 15, 2023. Coincodex technical analysis indicates a prevailing bullish sentiment, corroborated by a Fear & Greed Index reading of 70, indicating a state of “Greed.” In the previous 30 days, Ethereum has experienced 23/30 (77%) days of positive growth, showcasing an 8.11% price fluctuation.\n\nEthereum’s price consolidates above $2,035 within an ascending triangle pattern formed by connecting swing highs and lows. Traders eye a breakout from the horizontal trendline. The pattern suggests a target of $4,736, derived from a 134% triangle height. Positive RSI and bullish AO hint at sustained momentum and market strength.\n\nSource: Tradingview.com\n\nNote: The details on this page about markets and instruments are like a sneak peek – just info, not a nudge to buy or sell. Before diving into investments, dive into your own research pool.\n\nRelated Reading | Celsius Bankruptcy Plan Faces Skepticism, Regulatory Hurdles"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBxTmdzQmREY1RnM0VTZTFPM1FvLWNIclI0SVhSRmpERWE2NWRMcEJYMDhfVDlqRmV4bE9GZGoxcDBhZ0hiRnNUUks0WDlvRkMzWS1fSlNxdDJ1aGJKZ3htNlp4M0FPLXNNdWhZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "BlackRock Ethereum ETF Confirmed, Ether Surges in Price - BitPinas",
        "content": "BlackRock intends to launch an Ethereum ETF, with Coinbase as the custodian of ether and an unnamed third party holding its cash.\n\nFollowing the news of the Ether ETF, ETH surged by 10% to nearly $2,100, reaching a 7-month high.\n\nSeveral other companies, including VanEck, Ark Invest and 21Shares, Hashdex, Invesco and Galaxy Digital, and Grayscale, have filed for or launched Ethereum ETFs.\n\nThrough a recent filing on Nasdaq, it was revealed that BlackRock, an American multinational investment management corporation, is planning to create an exchange-traded fund (ETF) that will hold Ethereum’s ether. Following the news, ETH’s value significantly increased.\n\nAt the time this article is published, Ether’s price pushed above $2,000.\n\nRead more cryptocurrency news:\n\nBlackRock ETH ETF\n\nAs per the stock exchange’s Nasdaq filing, BlackRock is pursuing listing its product on the platform. Moreover, it also states that the U.S.-based cryptocurrency exchange Coinbase would act as the custodian of the ether held by the product, while an unnamed third party would hold its cash.\n\nFollowing this, CoinDesk noted that BlackRock also has a market surveillance agreement with Coinbase which appears to be essential for obtaining approval for such ETFs from the U.S. Securities and Exchange Commission (US SEC).\n\nAdvertisement\n\nAccordingly, it seems that the filing tried to address possible objections from the US SEC to the surveillance-sharing agreement by stating that BlackRock believes the prices of CME Group’s ether futures closely match spot ETH prices.\n\nThe filing asserted that either CME surveillance can detect spot-market fraud that affects both futures ETFs and spot exchange-traded products, or that surveillance cannot do so for either type of product.\n\n“Having approved ETH futures ETFs in part based on such surveillance, the Commission has clearly determined that CME surveillance can detect spot-market fraud that would affect spot ETPs, and the Sponsor thus believes that it must also approve spot ETH ETPs on that basis,” the statement reads.\n\nPreviously, the corporate entity, iShares Ethereum Trust, BlackRock’s ETF Division, has recently been registered in the state of Delaware. However, it must be noted that offering ETFs still requires registration and approval from US regulators.\n\nThe U.S. SEC is currently reviewing 12 spot bitcoin (BTC) ETF applications, including the previous BTC ETF application from BlackRock. The SEC has until November 17 to approve all of these applications if it intends to do so this year. If the SEC cannot approve all of the applications by this deadline, the ETH ETF plan will have to wait until next year to be approved.\n\nEther Price Surge\n\nFollowing the news about the Ether ETF, the price of the crypto surged 10% to nearly $2,100. This increase has led ETH to reach its 7-month High.\n\nCurrently, CoinGecko data shows that ETH is currently valued at $2,105.99 and was up by 9.1% for the last 24 hours.\n\nOther ETH ETF Filings\n\nAccording to Bloomberg Intelligence analyst James Seyffart, there are currently five other ETH ETF filings.\n\nVanEck\n\nThe VanEck Ethereum Strategy ETF (EFUT), launched on October 2, 2023, is an exchange-traded fund that seeks capital appreciation by investing in ether futures contracts. The fund is actively managed and provides exposure to ether-linked investments through an accessible exchange-traded vehicle. The fund does not invest in ether or other digital assets directly.\n\nArkInvest and 21Shares\n\nArk Invest and 21Shares have partnered to launch a new suite of digital asset exchange-traded funds (ETFs). The suite comprises five ETF products that will be listed on the Chicago Board Options Exchange and are scheduled to begin trading the following week. The companies will use on-chain signals and their crypto-native expertise to provide long-term capital appreciation by investing in BTC and ETH futures contracts.\n\nHashdex\n\nAccording to its website, the Hashdex Nasdaq Ethereum ETF (HETH.BH) is a fully physically backed ETF that seeks to track the investment results of the Nasdaq Ether Reference Price™ Index (NQETH™), a basket composed entirely of Ethereum. Moreover, it stated that the fund is listed on the Bermuda Stock Exchange and is only available to institutional investors.\n\nInvesco and Galaxy\n\nAs per a report, Invesco and Galaxy Digital have filed for a spot Ethereum ETF with the US SEC on September 29, 2023. The Invesco Galaxy Ethereum ETF is noted to “reflect the performance of the spot price of ether” by storing units of the crypto with an unnamed custodian.\n\nGrayscale\n\nIn addition to their BTC ETF, Grayscale also filed an application to convert Grayscale Ethereum Trust (ETHE) to a spot ETH ETF.\n\nWhat are ETFs?\n\nExchange-traded funds (ETFs) are investment funds that are listed and traded on stock exchanges, just like individual stocks. ETFs are designed to track the performance of a specific market index, commodity, bond, or basket of assets.\n\nIn the web3 space, the current available crypto as an ETF is only Bitcoin following Grayscale’s successful appeal to the SEC to convert its Bitcoin Trust into an ETF.\n\nThis article is published on BitPinas: BlackRock’s Ethereum ETF Confirmed, Ether Surge in Price\n\nDisclaimer:"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxQejNIa3hBTWUzTktxWGNxUHhuMkdleXp1d0YxSVh0ZGJ2S1R1eHZocmNkbC1QMW12aG9UblEteGpudzNQRkFfbHhmODdDVlAycUFvYzdJWGtTaHozNlhqcFlsTFdsQUJXb0VXTmdDcFFxSDNFWFhMZHpVSk5wR2lZOVZ5S2dnNFRZU0RRSVBtbU1mcTZkVFRQVEtvdVVoa1Rmb1NfV2ZYcElCSjd5RG5UV2RER3RHakFENVZkNXhULVhWeXlSMDdqcjln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Pundit Says Assets Like XRP With no Ties to China’s CCP Will Benefit Most in Coming Bull Run - The Crypto Basic",
        "content": "A crypto pundit has expressed his bullish outlook on XRP and other protocols that he claims have no ties to the Chinese Communist Party (CCP), China’s ruling party, as he positions them to benefit most from the upcoming bull run.\n\nIn a recent post, influential crypto commentator BoringSleuth hinted at a strategic advantage for cryptocurrencies not entangled with the Chinese Communist Party (CCP) in the upcoming bull market.\n\nAccording to him, protocols avoiding association with the CCP would thrive in the coming market cycles. BoringSleuth singled out Constellation (DAG) as a prime example. He also pointed to XRP as another well-positioned asset.\n\nThe protocols that weren’t in bed with the CCP will be the benefactors of future bull cycles. A protocol like $DAG, who works with the DOD is one example of a well positioned protocol. $XRP is another. — TruthLabs ? (@BoringSleuth) November 11, 2023\n\n- Advertisement -\n\nIt bears mentioning that Constellation boasts ties with the U.S. Air Force in a Department of Defense (DoD) partnership that started in 2019. Details of the partnership came to light in August 2021, with the Phase II of the collaboration announced to have been completed in May this year.\n\nXRP Boasts Robust Potential\n\nFurthermore, BoringSleuth’s endorsement of XRP stems from the robust potential the asset holds. The mention of XRP’s detachment with China also prompts a closer look at the ongoing rivalry between the XRP and Ethereum communities.\n\nAs both assets vie for market dominance, their supporters have continuously engaged in heated debates. Last August, Ethereum founder Vitalik Buterin said XRP lost its right to protection when Ripple executives threw Ethereum under the bus in claims that the project is “Chinese-controlled” during the SEC’s lawsuit.\n\nNonetheless, amid XRP’s victory in the lawsuit, BoringSleuth’s nod to the asset suggests a belief in its resilience and potential to capitalize on the forthcoming bullish trends. The XRP community has also repeatedly propagated claims of Ethereum’s ties to China.\n\n- Advertisement -\n\nClaims of Ethereum Ties to China\n\nSeveral pundits have jumped on this narrative, and BoringSleuth is one of them. Although his recent post does not specifically highlight this, he had previously taken to X to express his concerns.\n\nButerin has also claimed that XRP is centralized, yet people still consider it a crypto asset. Last month, BoringSleuth accused Buterin of securing funding from CCP-affiliated entities in the project’s early days.\n\nThe post unfolded a narrative wherein over 66% of ETH tokens prior to the Merge allegedly entered into wallets associated with China-backed entities, including the Ethereum Foundation.\n\nThe allegations extended to Ethereum’s pre-sale and ICO backers, claiming they received funds through Wanxiang Blockchain, an entity with connections to China. The Crypto Basic spotlighted these claims in June, as disclosed by Fox Business journalist Eleanor Terrett.\n\nBoringSleuth contended that these entities, purportedly responsible for financing a significant portion of the crypto ecosystem, have manipulated and controlled various aspects of the industry.\n\nHe also questioned the decentralization of Ethereum 2.0’s Proof of Stake model, asserting that the system has never been genuinely decentralized.\n\nHe argued that blockchain has lost its identity. According to him, those who fear loss of power, wealth and influence have hijacked the crypto scene. He alleged that these entities used corruption and theft to gain control over the crypto landscape."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPQVlsUUJwZ0RqQkZUSE14QWZyNWlQWG5rRm91a0I4WHRIeGtTMUppTHRZbnFOV29KQUN4UUNkR21ETEdtX29SWWdVNVhtd29pb2FiM2ROWVAtdW8zZGFUZWlWdnNGNDBwaHBqS0ZrNFRsMzdDS190NWZGVjNoWnh4bGVHbmc1cHFMcHRiSXlDekJ4T1NlYTR1TDVpRjk5NmZSOU41ZTZiNHI1OGdZdzhjN1pReHRYRTFUTEszdjB6M0hzSzAwRmpxa2ZyMW15TzZIdGRldWdqU1_SAd4BQVVfeXFMUGZzQ1VTWTh3NUV0Vnd4bGFJZmF2UjJmczJ3N1ZraUs1cFN5bkt0VDJIQTJtU3haT0h5YXQ5MjlWUGt0WjItelV6WExkVmtuUWpBc0d0V0tBdWJTX0NuYTZaVTZ6VzRLZnBvd2t3aFBEVThHYnRHMVZpaTNpb1AwRlZTXzh6SVNXNUp2cG9aNnVHcEZrZEw1Tm1DN3dHMEhWc2FCQzBvbDZ4YTlubGowV0RLY3lOcW5NUTQ4NWpYdW1ENm9Kbk5zUXQyRlgzUmZSOHRodXFLelk4eFNHQVpB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Top Trader Predicts Rallies for Ethereum and One Artificial-Intelligence Coin, Says Altcoins Have Ways To Go - The Daily Hodl",
        "content": "A trader who nailed the top of the 2021 Bitcoin (BTC) bull market believes rallies are in sight for Ethereum (ETH) and one additional altcoin.\n\nPseudonymous analyst Pentoshi tells his 711,700 followers on the social media platform X that Ethereum looks poised to take out a resistance level that has held for over a year.\n\n“A few thoughts on ETH here.\n\nIt didn’t come this high to not take out the yearly highs at the very least.\n\nMight let some shorts build up first in that area tho to build liquidations\n\nIf BTC ETF (exchange-traded fund) is approved, good chance ETH rallies harder seeing as it’s next.”\n\nLooking at the trader’s chart, Ethereum’s long-term resistance level appears to be at $2,144. At time of writing, Ethereum is worth $2,038.\n\nAnother altcoin on the trader’s radar is the artificial intelligence (AI)-focused Fetch.ai (FET). According to Pentoshi, FET will likely skyrocket once it takes out resistance at $0.49.\n\n“If it reclaims $0.49, this going to $0.69 in my opinion.”\n\nAt time of writing, FET is worth $0.413.\n\nPentoshi is also keeping a close watch on TOTAL 3, which tracks the total market cap of crypto excluding Bitcoin and Ethereum. According to the trader, TOTAL 3 looks bullish and still has more room to move to the upside before hitting a resistance level, suggesting that altcoins could see more rallies in the coming weeks.\n\n“Still a ways to go next few weeks overall. Sharp pullbacks are gifts.”\n\nAt time of writing, TOTAL 3 is trading at $406.356 billion.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nFeatured Image: Shutterstock/monkographic"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMioAJBVV95cUxOemVEMnBnX1d4Yk5yckdMandadVY5WjBaMmp2UkNnU2RWczNydF9DVTZQandtRWVQR0lmN1NoUUYyN3VsUWhrMTBrZkx1a2l6WVhxZ3dxOE1pbEpFM0FyaWtkQ3lUaXRka1FwR0lPSmZXcXRJYTVOcFlzU1RQc2kwVjRMUjRvTExDdXFVWEV5akhhQ0NQZ3E4Y0Y1XzZzWWE1QzhKaERhVmdLNlNSVk1KOXY0TlM2Wk5CWVRXYkQwcV80TGMzcG9PcUptSlNSMGdvZFZ3SzZmS0lYN2NyQWpnZVN2NVJOMTlNejJIRkpDOUxEeHlIcE50a09wamJHN20zNGZENUc2M2Npa1QxQkx1NGVWSldKV3lxeTVjT0s3cUXSAa4CQVVfeXFMTWU5cS1VRTBROFRhQl9FWXRZa1lDUWxtLW51bjlYVTFvSEZrSE5YY2poMm1jU1VrREFYSU5feFE2UnJDZHRORnRQMUdZdnpCclBLU0FRZENmVjNXNHE3cGwwWnpUYU9ybWhLRmloem1JNk5IMEdISDRfZnhqemc5amszdzJMaG01QXVPNHRxc2lDcmFVNzYxaXprdTg2TzNZWTJ1SUVhUmRKOXg3cGVkQzFxSmR2OXUtTlplOFlkNVVQWnNNREpWTTRmMDRuMzd1UlNVRmRxbFB5TW5fdXVxOTFGSVAwWnlXdzdLRS1DTjBKcHl1N0lHMW9yOVFoZFhacXhjNUZBMUNlWW01WlRBeXF4Zk04ajEzTHZ4Y0JmS3V6U1N3NXVkT01nekQ4Tmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Had You Invested $100 in Ethereum in 2016, Here’s Your Current Worth; Which Cryptocurrencies Are Next in Line for Investment? (ETH, NUGX) - Analytics Insight",
        "content": "With such a high ROI, Ethereum (ETH) is undoubtedly among the top crypto coins to invest in currently. Its many use cases and increasing whale demand might help push it well above $2,000 by the end of 2023. Hence, it is a good crypto to buy today."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFBjRUE0ZDAwT2tKUS1vcUs4d0xxQ25qSTZGV1kxSDhicEpMVlFOY1BaeDU3TU9qUFFEOThHSTd4dUxmUnlOc0Y5SFRaS2FsY1dmQkRYNXpxVzFpbDRUOWlTTjhTMFV2YjFtNUU1eHBPbklrOTjSAXhBVV95cUxOSFpEdGtTZVhWeFJFelIzZmp0NW4ycmpkMnNLRUNUOUh2YXdEeUJlUE9hTjlNRjJXTDNjY2E2QlZ3NEVaLS1aNWR4dVpUMEJoRzZZcFllN0pRV2U0SUU2S3AyUHp1R2dVQ2diYkRzNVU1bUNUdWFHMjE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Send Crypto to Gmail Account: New ZK Tech Revealed - U.Today",
        "content": "Advertisement\n\nYet another eccentric cryptocurrency application on zero-knowledge proofs (ZKPs) addresses the Web2-Web3 synergy in an entirely novel way. With Bonsai Pay, every Google account can be turned into a non-custodial crypto wallet almost seamlessly.\n\nSending Ether to Gmail account becomes possible with ZK proofs\n\nBonsai Pay by RISC Zero, an open source ZK-powered payments platform designed to allow every Gmail user to receive Ethereum (ETH) payments, has landed to the Sepolia Ethereum testnet. It is a new-gen way to replace sophisticated Ethereum (ETH) wallet addresses with familiar email contacts.\n\nAs per the team's statement, any active Google account is compatible with the service and requires zero additional setup to start receiving ETH funds.\n\nAdvertisement\n\nTechnically, cryptocurrency is transferred via an escrow contract created on the Ethereum (ETH) network. Recipients can retrieve assets from this escrow just by logging into Gmail and generating a zero-knowledge proof.\n\nJSON-based identity tokens and OpenID Connect Protocol are technologies the new product is backed by. Its core codebase is written in the Rust programming language.\n\nAlso, it leverages the protocol's own virtual machine dubbed RISC Zero zkVM. Moreover, this instrument can be used by third-party developers via API keys.\n\nZK-powered projects on fire as Ethereum's L2s recovering\n\nThe live demo of the protocol has been launched on top of Sepolia: The team invites all developers to stress-test it and share feedback on GitHub.\n\nZK-proof is a cryptographic method by which the prover can prove to the verifier that this or that statement is true, while avoiding disclosing any information beyond the mere fact of the statement's truth.\n\nZK-proofs are used in many of the top-tier L2 protocols on top of the Ethereum (ETH) mainnet. Three of them, Polygon zkEVM, zkSync Era and Scroll, showed double-digit increases in TVL over the last 24 hours."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxOVWN6ZExrX2l4Q1dGNktzczdFUGdmMjFhWW14MzBza2RoZ2FMWnYxM3RNbW1qcV9ZbGZJOHY5eFQyVkRFbTQxWlE2MUw0c2toOXhOcjJBTnJsODVyeFNKUXFYTmNCWHZKSFBadDJ1cllNQzlmSWg0eHJGb0RNNEZuX2U0VUN0NVlmcDA2TFdycWo5Qlo1bjdtOUZwTnZURlRkN1M1UXZ6eExlVl9ZWG1mNVJvWjdtYjJvSExvSlQyaDI5VEdVWmhpenRzN2_SAdIBQVVfeXFMTWFUaEtmb0JLcFNqQWNkLUR2TFZDRkVXRG1ReGZFNHVVMGo3LWNIWHlWMEVpbkZ5RTNyT2Ixc3lzbVBoS2MtWHkzcnZCN2pLaGJPUFIyeDR2dVZ2UFJOdmVVOGJNNTYyVVUyamdHMWRNeDZkYmhpYUVfQVNQb3dIaDRYS3hLNlJkTnlwbkFrWTEyblNiS2RwZFF1dWl3bndkcGtxVU1hT0RPTnVBZzB2S0kxemFrN255dmdiT2V1Zk5UR2VYX1h4RFRLZXMyYkRfajJ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Arthur Hayes Says Ethereum Could Explode by Over 4,600%, Doubles Down on $1 Million Bitcoin Prediction - The Daily Hodl",
        "content": "BitMEX co-founder Arthur Hayes is doubling down on his massively bullish Bitcoin (BTC) predictions while forecasting that Ethereum (ETH) could hit a six-figure price.\n\nHayes says that the time to turn bullish on crypto is “now” while unveiling a target of $100,000 for Ethereum – an increase of about 4,669% from the current level.\n\nThe BitMEX founder also reiterates his prediction that Bitcoin will hit $1 million.\n\nIn a new blog post, Hayes further says that as currencies debase across the globe, the “smartest trade” would be “going long crypto.” According to the BitMEX founder, Bitcoin and Ethereum are “crypto’s reserve assets” while “everything else is a sh*tcoin.”\n\nBesides Bitcoin and Ethereum, Hayes says there are other opportunities that exist in the crypto space offering the potential of higher returns at a greater risk.\n\n“Then, we get to other layer-one blockchains that claim to be an improvement on Ether. Solana is an example. These all got beaten up real bad during the bear market. As such, they will levitate off extreme lows and provide great returns for intrepid investors. But, they are still all overhyped, me-too, pieces of sh*t that won’t overtake Ethereum in terms of active developers, decentralized applications (DApps) activity, or Total Value Locked.\n\nFinally, all manner of DApps and their respective tokens will pump. This is the most fun, because down here is where you get the 10,000x returns. Of course, you’re also more likely to get rugged, but where there is no risk there is no return.”\n\nEthereum is trading at $2,097 at time of writing while Bitcoin is worth $37,083.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOZy1UdmlVVUxuSWhrS0tSUTlCZ0dwRFBULWhOVS1pUUh3MmU3cXZGaVlBZ1YtMjd4OFViZVlPQlo2bURLdVBPeGN1bGhrNURqSGZPSFpPUVZhVjBtTkVma3hDbHczWnVWdHVyTGJjMTlnYTBLeEpzaGF4LURmZDhpc05SVDRZX241ZVB1NC1jb1lIZkItV3ZyWW5fRkZ4aWRIYmVMaWZnV1JjRTNNNkVRQUlnOF9mUUXSAbwBQVVfeXFMUGlHb3FaXzFqdXRYRFQ0ZEhSalZsYXV1YjdQMmduZEpJNjBTVGRRT2dOYVRBanFmUHNjVDBISGZiWEl3R0FFN1FuTGlPQUE0enNsV1kxbzVpeS1yWVBoYzR3OTVoNWpaWVpBNGRZNkU2ZUxUbllvNWdxYXlaOE1iNWM3UHEwR0NjWGlvMV9MZnZtbFBKQS1JVF9BYmxNVzlqcVJYcFJoQzAycE5RNWpxSktWT2VzUXl6dThPRTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Showing Bearish Signal As Miners Unload $175,000,000 in BTC: Crypto Strategist - The Daily Hodl",
        "content": "A closely followed crypto analyst is issuing a warning, saying Bitcoin (BTC) just flashed a signal suggesting that a sell-off event may be imminent.\n\nCrypto strategist Ali Martinez warns that Bitcoin’s Tom Demark (TD) Sequential indicator is pointing to a possible corrective move.\n\nThe TD Sequential indicator traces a series of price points to signal possible trend reversals.\n\nSays Martinez,\n\n“Bitcoin: the TD Sequential is flashing sell signals on BTC weekly and three-day charts! Remember, the last time TD showed buy signals in both timeframes was in early September, kickstarting the recent bull run.”\n\nLooking at the activities of Bitcoin miners, Martinez says that the investor cohort has been using the recent rally to unload thousands of BTC.\n\n“Since Bitcoin surged past $34,000 in late October, BTC miners have been selling.\n\nOver 5,000 BTC, worth approximately $175 million, have been offloaded since then.”\n\nAt time of writing, Bitcoin is trading for $37,026.\n\nAs for Ethereum (ETH), Martinez notes that the coin’s recent rally kicked off without inflows from deep-pocketed investors.\n\n“Ethereum has reclaimed the $2,000 threshold, and intriguingly, this is all happening before whales have even started buying.”\n\nAt time of writing, Ethereum is trading for $2,042.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1vcm1ncGQwQWdfRzdLYVNzWHc5U2dEM0lvRnZ1ZjJlOXhqWnZ4UVVPYUZYWmxjajY2eU4tODdUemM3R2VGUXIwNWVNMDh6dVVoQm1xX1pHa09sVW5YVVp3NmRwdHZ4T3BkNEJzZ0NLY0pEbnFuamc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Daily Analysis: BTC, ETH, SUI, LUNA, FTX - Blockchain Reporter",
        "content": "Markets are on bull activity today, with the global market cap sitting 0.41% above its previous 24-hour mark, as the total cap stands at $1.41T as of press time. The fear and greed index is at 77, as greed still dominates. The global trading volume is 24% down in 24 hours, at $51.8B as of press time.\n\nBitcoin price analysis\n\nBitcoin (BTC) has started on minor bull activity, as Bitcoin price stood at $37.1K as of press time after recording a daily decrease of 0.14% and a weekly rise of 5.9%. As a result of the Bitcoin price, the token’s trade volume dropped by 40% during the same period and is presently at $12.9B.\n\nThe Bollinger bands are converging, showing dropping volatility levels on Bitcoin Price. The Relative Strength Index (RSI) is above the average line in the overbought region, showing bull dominance on Bitcoin price.\n\nBTC 1-day chart | Source: TradingView\n\nEthereum price analysis\n\nEthereum (ETH) has started on minor bear activity, as Ethereum price stood at $2054 after recording a daily decrease of 0.12%, as the weekly rise now stands at 9.3%. ETH’s trade volume dropped by 32% during the same period and is presently at $9.1B.\n\nThe Bollinger bands are diverging, showing high volatility levels on Ethereum Price as the Relative Strength Index (RSI) is above the average line in the overbought region, showing bull dominance on Ethereum price despite today’s dip.\n\nETH 1-day chart | Source: TradingView\n\nSUI price analysis\n\nSui (SUI) has started on bull activity, as SUI price stood at $0.5891 after recording a daily increase of 1.3%, as the weekly rise now stands at 17%. SUI’s trade volume dropped by 29% during the same period and is presently at $172M.\n\nThe Bollinger bands are diverging, showing high volatility levels on Sui Price as the Relative Strength Index (RSI) is above the average line close to the overbought region, showing bull dominance on Sui price.\n\nSUI 1-day chart | Source: TradingView\n\nTerra price analysis\n\nTerra (LUNA) has also started on bear activity, as Terra price stood at $0.069 after recording a daily decrease of 5%, as the weekly rise now stands at 53%. LUNA’s trade volume dropped by 65% during the same period and is presently at $299M.\n\nThe Bollinger bands are diverging, showing high volatility levels on Luna Price as the Relative Strength Index (RSI) is above the average line close the overbought region, showing bull dominance on Luna price despite the price drop today.\n\nLUNA 1-day chart | Source: TradingView\n\nFTX Token price analysis\n\nFTX Token (FTT) has started on bear activity, as FTT price stood at $3.4 after recording a daily decrease of 21%, as the weekly rise now stands at 202%. FTX’s trade volume dropped by 36% during the same period and is presently at $533M.\n\nThe Bollinger bands are diverging, showing high volatility levels on FTT Price as the Relative Strength Index (RSI) is above the average line in the overbought region, showing bull dominance on FTT price despite today’s price drop."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPZWw3ZjZqMU5YMU45Mk1FUjZqcHZVSEZYZUxLTzQ3Tzg3SUkyUUE2N2ducTk4NFR0Z1U4Vk9ELUZ1ZmxCNWlobXhXVWI1WHFlY2NVOWRWWlRNdHg0VEUtWEZTLXRMdkVRN2paTHoxUExLbjlFbGYwTWpreEJzQTFMVFBta0U2Wll3ejRZRzRsMHNiSzF4SlBOSWxjUjdWMUJzX2ZleWd6ONIBrAFBVV95cUxPdmhVemxkSmpsRDhDYUtua2JsS1l4NmlEV3M2VEtGRFhDZjR1NGZnU29KYzhiVE54WkZrOFlWU1A4cWtFU3BvSkQtX0xaTGVpTkwyWnVyOUVCVlZHdDBtWGJpSUxkeTFPTjZSeUF3LUh1UkE2eUY3MEplejAtWk81MXBOc0tQT0NBUlgzZGIxN3gwVjlpN0N2RHJNeTBWWDRxMzE2X2hFb093aVBh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Will Blackrock Explore ETFs for Chainlink, Solana, and Dogecoin? Expert Answers - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nCryptocurrency analyst Lark Davis hinted at a potential boom for Ethereum with the registration of BlackRock’s IShares Ethereum Trust in Delaware. Expressing confidence in this prediction, Davis speculated that BlackRock wouldn’t undertake such a move unless they were pretty sure about obtaining approval for a Bitcoin spot ETF.\n\nHe playfully suggested that beyond Ethereum, BlackRock might eventually explore ETFs for other cryptocurrencies like Chainlink, Solana, and even Dogecoin. While BlackRock isn’t the first to file for a spot in Ethereum ETF, joining others like Invesco and Hashdex, Davis sees this as a sign of institutional interest aligning for a significant influx of institutional money.\n\nHighlighting potential numbers, Davis discussed the current Ethereum holdings on exchanges, which amount to about 14 million ETH or $28 billion at the current price. He estimated that if Ethereum attracts half the inflows that Bitcoin does into ETF products, it could result in up to half of the available coins being acquired in the first year alone.\n\nReferencing Galaxy Digital’s estimates for a Bitcoin ETF, Davis halved the numbers for Ethereum, projecting $7 billion in the first year, $14 billion in the second, and $20 billion in the third. He said that such inflows, coupled with increasing demand, could lead to a situation where every Ethereum is bought up within three years.\n\nBeyond BlackRock’s potential move, Davis touched on other bullish catalysts for Ethereum. These include the monthly MACD nearing a bullish cross, with Ethereum catching up to Bitcoin’s trend. Additionally, he noted that 28.3 million ETH is currently staked, creating an over 2-year exit queue and restricting immediate dumping on the market. Davis also pointed out that Ethereum’s deflationary nature, EIP-4844 reducing gas fees on layer twos, and the ongoing migration to layer twos would further drive Ethereum’s growth."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiSkFVX3lxTFBwM3pNTlRkakdtLThWZ0Jkdnc5d0JSTUJPRS1XS293aVFpN2hwZkFRcjFWVXZoLTFuOVpaVVRKSzJnYjMtbThFNndR0gFCQVVfeXFMUFBmYXdMMWhQZTJfeXVWMENIand5V192enFZT0Jxb1ZLbDQzS2YteGZFNi1yYl9RTG0ybU9DRVJFRzR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Bank Nomura Offers Ethereum Investment For Institutional Investors, ETH Price Soars - VOI.ID",
        "content": "JAKARTA - Japan's largest investment bank, Nomura Holdings, launched an Ethereum-based investment fund for institutional investors through its digital asset subsidiary, the Laser Digital Asset Management, according to a press release released on November 9.\n\nThe fund, called \"Laser Digital Ethereum Adoption Fund SP\", is the second digital adoption solution investment fund introduced by the Digital Laser after launching the Laser Digital Bitcoin Adoption Fund last September.\n\nThe new fund will focus on the long-term spot position on Ethereum, reported by CryptoSlate. The fund is expected to increase yields through innovative strategies involving ETH staking owned by the fund. The fund is managed as a separate portfolio in the Laser Digital Funds SPC, a separate portfolio company listed in the Cayman Islands.\n\nLaser Digital has partnered with Komainu as a store for the assets of the fund. The company also acts as a store of assets for the Bitcoin Digital Laser fund. Komainu is a company regulated by the UK Financial Behavior Authority and the Virtual Asset Regulatory Authority in Dubai.\n\nSebastian Guglietta, head of the Laser Digital Asset Management and former Chief Scientist Officer Nomura, said his company sees Ethereum as a technology catalyst that will digitize the economy. He added that in the long term, exposure to Ethereum is very important to capture the structural technology trend of the web economy 3.\n\nMeanwhile, Total King, head of the Laser Digital Asset Management distribution, said that the fund would simplify investment in digital assets and provide a safe way for institutional investors to gain exposure in the industry because it is fully regulated.\n\nLaunching CryptoPolitan, Steven Ashley, co-founder and executive chairman at Laser Digital, said that the funds offer added value to investors interested in the technology underlying the Web3 ecosystem, such as smart contracts, decentralized finance (DeFi), and non-fungible tokens (NFT).\n\nHe also said that Ethereum has an important role as a building block for this digital infrastructure, and is therefore of interest to their institutional clients. The launch of Ethereum funds by Nomura Laser Digital shows that there is growing interest from traditional financial institutions to integrate digital assets into their investment portfolios.\n\nAt the time of writing, the price of ETH has increased by 9.9% in the last 24 hours. Now ETH is trading at IDR 32.8 million based on Coingecko data reports.\n\nThe English, Chinese, Japanese, Arabic, and French versions are automatically generated by the AI. So there may still be inaccuracies in translating, please always see Indonesian as our main language. (system supported by DigitalSiber.id)"
    }
]