[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQSkN1cTQ3WVppdWNUZXpRUERrenU1MzAxUXVzbFdwZ3drNlZyS2JtbUhZeUliMHZrM1V2Ump0ME0zLTJCdjE2aG5PNGRLWXB4a05aMDZEOXZNXzFlVG1abWE0ajZXVVh4clNoZ1lRZTJid3piaXZfRzFxNEo0eGFZUXdzNUxETmlwUHphZl84TzhjeXhuQ1J0VWZ0aDBEWGw4SWFCcy1CckpjaHpGaDFvOEJZbXBmZ9IBuwFBVV95cUxNWW8telo2dnpIVU9FQjUxaTZid19OYTcweUpmQWFLR2Q4bnFORTFBQXN0UUlVeDMtRUVwUmNKN05wZTNCby1Oby1KWlpUY09rLWItMXpHeXdwSjEtZVhjLXdPbzFXMnhNc1J1V201OHB4UjBvbExjVXRQak1BZFFfNjh2Vl82RTE4YXplZWNmTXNkREpua2lQSFBQcDI1MF9vcVpjNjBobmZCOHB3UkNtM0VwZ0ltMXVOMlJV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "No More Than 50% Chance of Spot Ether ETF Approval By May, JPMorgan Says - CoinDesk",
        "content": "No More Than 50% Chance of Spot Ether ETF Approval By May, JPMorgan Says\n\nLawsuits against crypto exchanges offering staking services for proof-of-stake blockchains, including Ethereum, make approval of a spot ether ETF more challenging until these cases are resolved, the investment bank said.\n\nBy Will Canny Jan 19, 2024 at 10:37 a.m. UTC\n\nElection 2024 coverage presented by Stand with crypto"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQV255UXdJRFFLcEI5aks5S2hYcEJjdGhaeHF0VFpUaVNLYmpIN3pqa1RnT3Ewb1JQWm5EcDZQeFE5UkpQNk9OTUdLYVZvcVNnaGtHVDJqTzQ1SnlwZGdZZ1NfbTlaRjhnQ2ZLV0lVQ3JidF9GVXpnRXFOT3gtalZNZGtBV04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "SEC delays Fidelity’s Ethereum ETF decision - Yahoo Finance",
        "content": "Fidelity’s quest to launch a spot Ethereum exchange-traded fund (ETF) has hit a regulatory roadblock as the U.S. Securities and Exchange Commission (SEC) extended its decision window.\n\nFidelity’s Wise Origin Ethereum Trust, if approved, is a fund that would track the performance of Ether, the second-largest cryptocurrency by market capitalization. It would allow investors to gain exposure to digital assets without directly owning them.\n\nAccording to James Seyffart, an ETF analyst at Bloomberg, the SEC may choose to approve a batch of spot Ethereum ETFs as it did with Bitcoin. Seyffart pointed to May 23 as the next key date, the deadline for the regulator’s decision on VanEck’s Ethereum ETF application.\n\nThe SEC approved 11 spot Bitcoin ETFs last week, allowing such funds to be traded for the first time in the U.S. Before the approvals, the SEC rejected all spot Bitcoin ETF applications.\n\nEther price outshined Bitcoin’s price following the approvals surging past US$2,600 for the first time since May 2022, CoinGecko data shows. Ether has since fallen, losing 7% over the past week to US$2,436 at 12:30 p.m. ET. Bitcoin dropped 6.4% in the same period to trade at US$40,642.\n\nFidelity’s Bitcoin ETF, one the funds that received the SEC’s green light last week, crossed the US$1 billion today, becoming the second to do so, The Block reported."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQQ0Vya2J2YWJJUHJ5eDF0RlhEWVBnM004a1ZnSmFmd042a25HSDVTUmNvSU91VWVkMjVsZ1FTMk1IQjFNempTNnVYaGFjM3ljRGtnR1N5bi1GdkF1ek96UEJMeTRIZFBGNXl4R3F2VHhXVzFTVkx6WEZGMTRRalIwOEo2ZFVPZDRNNlVLVm51c3FrUm5wamQtTVd2X0ZiOW1BMndibHFjb9IBrAFBVV95cUxQak5BcVp2RDY4YV80N0NCWnlVY3dIWGpFMFFiWDVQZDVKSmFhemNmSkRWRmQwdlJrR2NiQzg5dFhmQkNRM2tsaE1SaUVlb0dMX0UwMzZ4NlYxNGVzN2haay16eXJ2SnJFdldhVFhEWmNtMzBCM0NDOHRCRmRQV0xjd3JzbGtRNVFOWGlHdWhwb2pBaEV2WGlHTHdmT2NRdFB5NURXYzI0RzF4dFBt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Why Experts Foresee Solana (SOL) Outshining Ethereum (ETH) By 500% In the Next Bull Run - ZyCrypto",
        "content": "Advertisement\n\nThe co-founders of leading crypto analytics firm Glassnode, Jan Happel and Yann Allemann, foresee Solana (SOL) outperforming Ethereum (ETH) by a staggering 500% in the next bull run.\n\nThe duo who operate under the X account “Negentropic” recently shared their optimistic outlook on Solana’s potential ascent. Notably, their perspective was inspired by a recent interview featuring macroeconomist Henrik Zeberg and Global Macroinvestor CEO Raoul Pal, where the discussion centered around the potential for a remarkable rally in the SOL/ETH chart.\n\nNotably, the interview host asked Pal and Zeberg about their crypto preferences for a $10,000 investment over a 12-month period, specifically focusing on Ethereum and Solana in terms of risk-adjusted returns.\n\nPal and Zeberg, examining Solana’s recent performance trend, expressed strong confidence in its significant momentum. They anticipated Solana maintaining its upward trajectory, surpassing Ethereum, as indicated by the SOL/ETH chart.\n\nThat said, Glassnode’s co-founders delved into Pal and Zeberg’s analysis to answer the intriguing question of how much Solana could potentially outperform Ethereum. According to insights from Glassnode’s analytics, the current SOL/ETH ratio stands at around 0.14, and the co-founders anticipate a substantial increase in the ratio.\n\nAdvertisement\n\n“We all watched Zebergand and Paul talking about SOL-ETH ratio. They both agreed it looks BULLISH. But – just how much could the ratio rally? This chart suggests, that the SOL/ETH ratio could rise to ~0.76 from current level of ~0.14. In other words, SOL may outperform ETH by 4-5X into the Crypto top.” Negentropic remarked.\n\nContrary to an isolated rally for SOL, the market experts also anticipated a significant bullish rally for Ethereum.\n\nThat said, following a remarkable surge last month that propelled it to reach an impressive $126, SOL has experienced a subsequent retracement attributed to profit-taking by investors and the broader market downturn, particularly influenced by Bitcoin’s performance after the spot BTF approval.\n\nHowever, despite this setback, bullish sentiments surrounding Solana remain notably high. In a Friday tweet, analyst “Crypto Simon” noted that the SOL/USDT price chart is signalling a potential breakout from its descending channel, suggesting a shift towards an upward trend. He further highlighted a high probability of a bullish movement originating from the support level around $98, with SOL poised to target resistance levels near $128.\n\nAt press time of the latest update, Solana was trading at $89.31, reflecting a 6.36 % decline over the past 24 hours. Ethereum, on the other hand, was trading at $2,438 after experiencing a similar 3.8% decrease during the same timeframe. Despite this decline, Solana’s one-year trajectory remains notably robust at 340.43%, surging from around $20. In contrast, Ethereum’s one-year trajectory is comparatively lower at 60.72%, indicating growth from $1,500."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPb0pfX0ZjUEtlNHdFMGk3aFJISk96cUFpU20zdHI0Y1gzRXhpekNNZkN4dk9pM2FjcG9QaUp0UkEyUnQ3X0x0UE9FbE5XWVB0aExuWTBjdl83VUpXelVZNFNBX2FrSDRyZkk1SW9lZXVicTdReHBMR25sUWhVYUhlVVVMVm1ZYWEwYmpVWERHVkhkWFF4Mzc1Q1RR0gGiAUFVX3lxTE1ZODVtSUZOZ3NTeU5zdXpsaVg3RjZRZk1iUng4OWZoV01HenduSUNZdGdTUWVXLXdESjg1SVdHUnBfSHhwRFhFeEJFeFpvbXk2NUpGd2FqbExFVHlWdV9ldjBoTDRXcmJfaVJFRWt0OHFjVU5QWkVCUnpHVFJfNGRiSDl0NHlPSlR3c2liV3BqX29oMDUzUHlWMVlzRUFFSVAwdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "This Week in Coins: Despite ETF Hype, Bitcoin and Ethereum Plunge Hard - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nLittle over a week since the launch of spot Bitcoin exchange-traded funds (ETF), and the crypto markets are suffering.\n\nOver the past week, Bitcoin (BTC) has shed more than 10% of its value, according to CoinGecko. The biggest digital coin by market cap is now priced at $41,002.\n\nLast week, it was closing in on $49,000.\n\nAD\n\nAD\n\nThe long-awaited Bitcoin ETFs have been a roaring success—with BlackRock's iShares ETF collecting over $1 billion in assets under management.\n\nSo, why the dip in price? It probably has something to do with investors cashing out their gains from the initial ETF hype.\n\nSome analysts said that ETF approval had already been \"priced in.\" This likely means that traders and investors were unlikely to continue buying after the approval was made official.\n\nThe rest of the crypto market has been hit hard over the past week, too. Solana (SOL) has shed over 7% of its value in the past week and is priced at $92.38.\n\nWhile Avalanche (AVAX) is down by more than 14%, trading hands for $32.82. Both assets had done very well in December as they attracted institutional investor interest.\n\nAD\n\nAD\n\nMeanwhile, Ethereum (ETH), the second-biggest digital coin, has lost 8% of its value in the past week. It's now priced at $2,466.\n\nFollowing the U.S. Securities and Exchange Commission's approval of 10 spot BTC ETFs, the crypto sphere is now awaiting spot ETH ETFs to drop.\n\nWall Street's top regulator on Thursday pushed back its deadline for a decision on Fidelity's proposed spot Ethereum ETF to March 5, leading to a price dip in the asset.\n\nThe entire crypto market now stands at $1.7 trillion, having dropped by 2.8% in the last 24 hours."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPbFZlbWNjckxYd2tUaXZncUQtVnV0Sy1JaTE0WXUyRUZrQUhvLWpFRnRrdlZScXZnbWJORE0yVWRkQ1lvWkZpdXphNUJudFVEdVVua3pXcUdsXzNpSk5sclZhLUREZ2RZX2VZNktucGU5S3dicTlDQjExdlhDQXlHdkR2X0VDeGc5d1hmdU9KRlJYQVcwdXVQTXJ0UVh4dWxjU2RMOEFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "SEC delays Fidelity’s Ethereum spot ETF, but decisions are still expected in May - CryptoSlate",
        "content": "The U.S. Securities and Exchange Commission (SEC) said on Jan. 18 that it has delayed its decision on Fidelity’s proposed spot Ethereum ETF.\n\nMore specifically, the decision concerns a proposed rule change that would allow Cboe BZX to list and trade shares of Fidelity’s planned fund.\n\nThe SEC noted that the proposed rule change was originally filed on Nov. 17, 2023 and published for comment in the federal register on Dec. 6, 2023.\n\nThe SEC said today that, based on those dates, it was previously required to approve, reject, or institute proceedings determining whether to disapprove the proposed rule change by Jan. 20. However, it has now chosen to use a provision that allows it to extend that deadline by 45 days to March 5, 2024.\n\nIt is likely that the SEC will choose to institute proceedings around Fidelity in March, as it done for certain other pending funds.\n\nSEC expected to decide on ETH ETFs in May\n\nBloomberg ETF analyst James Seyffart said today that the Fidelity delay was “completely expected” and asserted that late May deadlines “really matter.”\n\nThat May deadline appears to be related to the fact that the SEC must either approve or reject VanEck’s competing spot Ethereum ETF proposal by May 23.\n\nAs the SEC has already instituted proceedings on VanEck’s application, it cannot delay its decision any further. And because the SEC generally approves similar ETFs together, it will likely decide on all pending spot Ethereum ETFs in late May, even though other applications have later deadlines.\n\nIt should also be noted that Fidelity, VanEck, and several other applicants succeeded in gaining approval for spot Bitcoin ETFs on Jan. 10. The success of those Bitcoin ETFs does not guarantee that Ethereum ETF proposals will also gain approval.\n\nPublic expectations are divided: one prediction market on Polymarket currently reports 54% odds in favor of spot Ethereum ETF approvals.\n\nEthereum Market Data At the time of press 12:26 am UTC on Jan. 19, 2024, Ethereum is ranked #2 by market cap and the price is down 2.47% over the past 24 hours. Ethereum has a market capitalization of $295.94 billion with a 24-hour trading volume of $11.91 billion. Learn more about Ethereum › Ethereum $2,462.54 -2.47% Crypto Market Summary At the time of press 12:26 am UTC on Jan. 19, 2024, the total crypto market is valued at at $1.63 trillion with a 24-hour volume of $63.06 billion. Bitcoin dominance is currently at 49.61%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPd2M0MlY2Y3hBUjJLNnJuS1BIMjloVktUdW1mdjB4UVlmbEFLaS1xcERjRG1vTGtmU3ZxSjVPT2tzYk1lczZYc0R6QnNDNjAxOEg1ajlzSjdENmhkckJ1Z0xmLWExT2VjZHhKOUg2UnpnN1NLblZXYUFESWlDbm5QRU1WaExkbUpSc2Z5QW1aWkV2RGpfR0tCM3dRTURaR1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "DeFi investors sent $370m from Ethereum to other chains. Here’s where most of it went - DLNews",
        "content": "What you'll learn Most of the $370 million liquidity outflow from Ethereum via Wormhole in the last month has gone to Sui and Solana.\n\nOutflows are possibly driven by memecoin and airdrop speculation.\n\nSui’s TVL has spiked 10-fold since October.\n\nSui and Solana have sucked a lot of liquidity from Ethereum over the past month.\n\nThat’s according to data from crypto bridge protocol Wormhole that shows $370 million in liquidity has moved from Ethereum to other blockchains, with almost 90% going to Sui and Solana.\n\nWormhole’s operations head Dan Reecer told DL News that part of the appeal can be explained by Sui’s incentive programme within its ecosystem that is “driving a lot of DeFi activity.”\n\nAs for Solana’s popularity, he said it may be “related to people looking to earn points on different apps after seeing the recent community rewards from apps like Jito.”\n\nSui and Solana dominate Ethereum bridge withdrawals via Wormhole (Wormholescan)\n\nLiquidity rotation\n\nCrypto liquidity rotators are known for keeping in touch with the latest “meta,” or trend, to position themselves for possible rewards. They do so by quickly shifting liquidity to avenues likely to offer rewards for user deposits.\n\nOne of the recent metas is “points” — a system for acknowledging user participation in DeFi protocols that may qualify them for future airdrops.\n\nNFT marketplace giant Blur popularised the points airdrop system and used it to great effect in capturing significant market share from OpenSea, the previous dominant player.\n\nNow, the trend has spread across platforms, protocols, and blockchains, becoming even more commonplace on Solana.\n\nJoin the community to get our latest stories and updates\n\nSeveral Solana DeFi protocols including Kamino, MarginFi, Parcl, and Solend, have announced points systems of their own.\n\nSui TVL has surged 10-fold in the last three months\n\nSui announced a $50 million incentive programme in October. Such programmes are used to attract interest from developers and investors by funding grants for the former and user rewards for the latter.\n\nSince the programme’s announcement, Sui’s total value locked, a measure of investor deposits, has risen 10-fold to $320 million, DefiLlama data shows.\n\nSolend, Solana’s biggest DeFi lending app with $160 million in deposits, may further boost Sui’s total value following its expansion to Sui.\n\nDespite the significant transfer of liquidity from Ethereum to both Solana and Sui, their combined TVL of $1.65 billion still falls far short of Ethereum’s $32.6 billion.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNQzQ3ekF5YVBMOFY1clRsX3JIZGFnMEdpUXJGN2FpMWRLNW8tZm1wb2d5eDNUc0RRTnlORndwQjNsbVlaYWRsTFR0RzZvX2s4eDhxbUY5NkhIU003eDMxcmhmb29GLVlOVWx1SWtRUmFtaUVsVWxObkpUMV9aLTZLVVhn0gGHAUFVX3lxTE9KRHp2WTV5akZCNHVqSVRGc0pxQXFOTFMtYVpYZmRCRHNJQ2xsWXVCUnprUDNqdlRyeFVkZFVfTmVXZjBEYks1czExOXozZk45d29Qa1h3WmwtdVVmZVFKeTNUZmVoM0FzRko5dER2ejZlQlV3VTYybks5UXRjQktEcFkzTmhIUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF to Bring Max Pain for BTC Dominance, Trader Says - U.Today",
        "content": "Top analyst and crypto commentator who goes by @hedge__x on X (formerly Twitter) is sure that Ethereum (ETH) has all chances to outshine Bitcoin (BTC) in the coming bull run.\n\nAdvertisement\n\n\"Max pain for Bitcoin Dominance\": Trader skeptical about Bitcoin (BTC)\n\nBitcoin (BTC), the largest cryptocurrency, is going to set a new all-time high in this cycle. However, even over $100,000 per BTC, it will be disappointing for many Bitcoiners, @hedge__x shared on Jan. 19 on his X.\n\nCorn is going higher this cycle but many will be disappointed at $100k peak.\n\n\n\nETH has much more upside potential w many more future catalyst including ETF.\n\n\n\nMax pain for BTC.D. Max gain for Total2. — Hedgex.eth (@hedge__x) January 19, 2024\n\nBy contrast, Ethereum (ETH) has way more impressive upside potential compared to the orange coin. Among other catalysts, Ethereum (ETH) has possible ETF approval ahead. This might be an amazing catalyst for the next ETH rally.\n\nIt should be noted that Ethereum (ETH) is getting closer to EIP-4844 or Proto-Danksharding upgrade activation. It is set to change the game in L2s and make them more resource-efficient.\n\nAs such, the analyst is positive about the potential of Total2, an indicator of cumulative cryptocurrency markets capitalization excluding Bitcoin (BTC).\n\nThe Bitcoin Dominance (BTC.D) indicator is due to go through \"maximum pain,\" the trader concluded.\n\nLegal status of Ether is crucial for ETH ETF approval\n\nIn January 2024, Bitcoin Dominance (BTC.D) is losing momentum. After registering a local high over 55% on Jan. 9, it lost 7.5% (4.6 points) in less than 10 days.\n\nEthereum ETF is one of the most anticipated events for the cryptocurrency segment in 2024. The community and experts are moderately optimistic about its potential approval.\n\nHowever, the court processes between the U.S. SEC and crypto exchanges over illegal securities offering might affect the timeline of the ETH ETF approval.\n\nTogether with other large-cap altcoins, Ether is one of the tokens the SEC claimed to be unregistered securities."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOdktqZklPeUR4b1VyLWl0WjQ2amNiUlZKU1hOcVVVUV9sa0NGQzRQaFJFWGh4NXh3bjZkdzMzTGJBM29pTmpqbWNvRXkzWE40MWRJYWxwbHdkWXhncEM2T2hrdkFTNmp4SzU2ZUxrQjVCYlluV1J1Z1JtdGE5SU1QWVNBV3UzUWVBWU1FZXlocnV4blFKd0Y1bzNpYTZsQUxNVkV3ZmNycUJIQjh0eE04eE5qV0VXZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Weekly Price Forecast – Ethereum Continues to Consolidate - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQakd5a1F3Rnd6Sngxc1lmeGgyMHhydm1JTzlOMjA0TWVJUnVvUmE0dWpvdnBrSzh6V0VoajVNRXdkaXJMVVJER0ZjWkxkdko1ejhENTVrTUpyTWdMZ3hhSldjTHlZdU5CbHdpVVQ5T3A1T3llMUVJZ1cycGdHeWQ4OXFOTzJqdnplcjBBd1RXNUNOczdma0J4dzYxVWVtOGlIdGZRTEV0UTA4T081U2x2ZWFIemZ0YUt4andZdW1GVUxfOE53QW4zOEo5ONIB0AFBVV95cUxQbUhkTlBqNFVuZG9HOFV6VXNweGMzbU1sbk5SNVhiXzhwZVprUmRmeDY2c0tlaDVmSmNsNWt4RVZrU0Z0YTlvVnJxM0NobjQwUjllQ0JxX2hUSFNMakNEazlfTGRYRGFxanZUWnNrOTJnUmhnMWJoUE82ak1lQmszdmJUcHR2WUZYRWFvWUo1QkxiMFJhaUNJTHpxM0hFdWkzY25MMnhjWEJVVklBVjI4TEFIWFU0cGpaMUllWEhBbGJELTFXaW53Mml2WVk5bjJJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum and XRP Sitting at ‘High-Risk’ Profit Levels, Warns Crypto Analytics Firm Santiment - The Daily Hodl",
        "content": "Crypto analytics firm Santiment says that three of the largest crypto networks by market cap now have more than 80% of their existing supplies in profit.\n\nThe Total Supply in Profit metric measures what percentage of coins are currently in profit compared to the last time they moved, and sometimes correlates with price trends.\n\nAccording to Santiment, Bitcoin (BTC), Ethereum (ETH) and XRP have 83%, 84% and 81% of their supplies in profit, surpassing their average that range between 55% and 75% and placing these coins in high-risk profit territory.\n\nSantiment says the assets last hit this level in March 2022.\n\n“Bitcoin (83%), Ethereum (84%), and XRP Ledger (81%) have their respective supplies in historically high risk profit levels compared to their averages that hover in the 55%-75% range dating back to 2018.”\n\nSantiment says cryptocurrency prices can still go up because of positive developments in the industry, including the approval of a spot Bitcoin exchange-traded fund (ETF) in the US, but the firm says a lower percentage of the supplies in profit would be a bullish indicator for the crypto assets.\n\n“Crypto can absolutely still climb due to more exposure from ETFs and other positive news. But ideally, a great signal to watch that would imply continued long-term growth would be a breach below 75% of their supplies in profit once again.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQNzhCa0M0c3haT3VCeXB0eHUyUHlhbjAzWjRtS21sbTFPbTB3bHRNbXU4VmJDazNMZkJuR3FhVDctWXlxU2xrbk1ob1NIN0NDdmF0cDlRdVZKVF90QVZYaUtXOEI5elJ3QTFDVTQwdHc5XzNjUDZ3aXBjblhwMHNDZE9KZHVsSGVwa1N1MTFGcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Ethereum outpaces Bitcoin post-ETF launch as ETH/BTC ratio skyrockets - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNNGZwX0MydE5yOWNrbXVsUzh4UDRZTXFaR3ZETkluLWFidFByOHMzd3IzN1VrUlRGaTBZZzBzV010YWlMRjgtUWJOZkZZMjNuRktVSEs0SDh3TkVkZko1dU9TOVh2NVNldTk4NnBMX20wYTR4LThQaW5iYTlxcmZHNTBXRERNdDRTZVBISkU5cjlBb3RHZFNya3YwWGxzT2llZzFkZXU4WnZTaGo5Tm1TeNIBtgFBVV95cUxPSUpXTU1JcG5IMFMzY0FpdTJqTWRKMW5wQldXcXUzOGY0UkxscFVieFo5WFdsLWZHamJjblVpR2k0dm5SY203U2VDdk0xRnREMmV4dXIybV9QY0tMT1Y3RnU1ejFIZWEzQlNvLVNxajZoSHhqcjdsOUxidWZ5Q1B1NDcwa29jUXU0YWhTeDBBZ1cwbzgtdWZ2TlRNNWw4akY5TGI3eEdhRXdzT1V2WmFldmRZQkl6dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Shiba Inu (SHIB) Rapidly Breaks Down, Ethereum (ETH) Loses Traction, While Solana (SOL) Presents Hidden Opportunity - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nShiba Inu has experienced a significant breakdown from its recent consolidation phase. The chart depicts a clear downward trajectory as SHIB failed to maintain its position within the ascending triangle pattern it had formed over the past few months.\n\nThe breakdown was signaled as SHIB prices breached the key support level at $0.000009, which had previously acted as a reliable floor for the price during consolidation phases. Following this, SHIB prices tumbled further, slicing through subsequent support near $0.0000087. This price action marked a decisive shift in market sentiment from accumulation to distribution.\n\nThe next support level to watch is at $0.0000082, where SHIB may find a temporary reprieve from the selling pressure. If this level fails to hold, the next critical support lies at $0.0000076, which could serve as the last line of defense before a more significant drop.\n\nFor a reversal to occur and for SHIB to regain its upward momentum, it would need to reclaim previous support levels and transform them back into supports. This would require a substantial influx of buying pressure, potentially sparked by positive developments within the Shiba Inu ecosystem or broader cryptocurrency market rallies.\n\nAdvertisement\n\nThe first sign of a possible reversal would be a return above $0.0000087, followed by a sustained move above the $0.000009 price level. A breakout above these levels, accompanied by increasing volume, could indicate that the downtrend is losing steam and that bulls are regaining control.\n\nSolana paints reversal pattern\n\nSolana has been developing a subtle yet potentially pivotal chart pattern. The asset has been tracing a slow and steady ascending channel, a formation that suggests a controlled and consistent uptrend. This pattern, characterized by higher lows and higher highs contained within two parallel trendlines, speaks to potential for continued growth.\n\nThe significance of this pattern lies in the momentum it could provide for SOL. Should the price action remain strong within the upper half of the channel, and particularly if it challenges the upper trendline, we could see Solana break through and embark on a more aggressive rally.\n\nSuch a bullish scenario would likely be supported by increased trading volume and positive developments within the Solana ecosystem, such as new project launches or updates that enhance network performance.\n\nThe immediate local resistance stands at around $55, and a confident push beyond this could confirm bullish sentiment. Inversely, if Solana's price dips below the channel's lower boundary, around $48, it could indicate that a bearish narrative is taking hold.\n\nEthereum momentum decreasing\n\nEthereum is exhibiting signs of waning momentum, as observed in recent price movements. The asset, which has long been considered the backbone of the decentralized finance sector, is facing a pivotal moment that could determine its trajectory for the coming weeks.\n\nThe provided chart illustrates Ethereum's struggle to maintain its grasp on the market. The price has been on a downward trend, edging closer to the local 26-day Exponential Moving Average. This level, currently near $2,465, is critical; if Ethereum fails to hold this line, we might see it descend to test the more significant 50 EMA, which stands around the $2,300 mark.\n\nThe 26 EMA serves as a short-term sentiment gauge, and its breach could signal a lack of immediate bullish support. Should this level fail to act as a springboard for price recovery, Ethereum's next stop could indeed be the 50 EMA. A breach below this longer-term moving average could potentially open the gates for a test of lower support levels, highlighting the need for investors to brace for more volatility.\n\nMarket participants are now recalibrating their expectations, understanding that the road to sustainable gains is a long-term journey."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPOUVYX3Y0bmlDSG15X2hOZDdRWGx0cTlTY0QzUDJDM0pqMTJKYkJtbEdUUEF4VGk2LTh3MVBvRTdtYVo5S2VqWWVZWmh5YkpNQzhYbVNnc3V0TEpZcm40ZXBnSmlTY0dTamFReGRfRkNaUDZEQ1dKSHhqZHJjYlIwazN0Q0ZEOTFPbnVV0gGQAUFVX3lxTE9EdmJicXgzMlNpemEwU3FtNVVKTzUxUGM5S3FzUGN0dEktVERaZnRYVXdCcnpOTzNIY0lxdG1IR0ZZdFdPXzdzdXF1WnlMMWY0ODFsUklYR21RaGN5QlY3andCUUNkVnktSkZkSlFDdFpkOU5KQUM5OHlWQ0pIVzNzSGVvcXBqWHlIdUVTQUFXSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's Dencun Upgrade: Two Key Dates to Watch as Testing Advances - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nChristine Kim, vice president of research at Galaxy, shared a quick recap of the latest Ethereum developers' call.\n\nAdvertisement\n\nGoing forward into the Dencun testing timeline, two key dates might be critical to watch ahead of mainnet activation.\n\nThe Cancun/Deneb upgrade on the Sepolia and Holesky testnets has been scheduled for activation on Jan. 30 and Feb. 7, respectively. In this regard, Ethereum core developer Tim Beiko says to expect an announcement with client releases in the coming week.\n\nQuick update from ACD call today:\n\n- Cancun/Deneb upgrade on Sepolia and Holesky testnets remain scheduled for activation on Jan 30 and Feb 7, respectively.\n\n- Client releases for both upgrades will be bundled and shared in a blog post next Tues.\n\n- Full writeup from today's call… — Christine Kim (@christine_dkim) January 18, 2024\n\nThe much-anticipated Dencun upgrade follows last year's Shapella upgrade. According to ETH developers, it will first be deployed to the Goerli testnet, then, if no major issues are found, to Sepolia and Holesky. Once Dencun is running smoothly on all three testnets, mainnet activation will be scheduled.\n\nDuring the week, the Dencun network upgrade was activated on the Goerli testnet. The upgrade included several changes, most notably the introduction of ephemeral data blobs with EIP-4844, also known as \"protodanksharding,\" which will help slash L2 transaction fees.\n\nEthereum developer Tim Beiko recounts the events that led to Goerli not finalizing immediately after the Dencun upgrade was initiated. Due to Goerli having an open validator set, there was an expected but significant drop in validator participation at the fork.\n\nIn addition to this, a client bug on the network with Prysm set the historical root value to 0 instead of copying over the last historical root when Deneb was activated.\n\nOnce the bug showed up on Goerli, its cause was found, a fix was made and a release was put out shortly after.\n\nWith more validators coming online and one client team upgrading some nodes that had been missed, the Goerli network eventually finalized.\n\nWith this significant milestone reached, Ethereum developers are now proceeding to fork the Sepolia and Holesky testnets before the mainnet launch.\n\nThe much-anticipated Dencun upgrade combines changes to both Ethereum's consensus and execution layers. The list of protocol changes includes: EIP-1153: Transient storage opcodes; EIP-4788: Beacon block root in the EVM; EIP-4844: Shard Blob Transactions; EIP-5656: MCOPY (memory copying instruction); EIP-6780: SELFDESTRUCT only in the same transaction; EIP-7044: Perpetually Valid Signed Voluntary Exits; EIP-7045: Increase Max Attestation Inclusion Slot; EIP-7514: Add Max Epoch Churn Limit and EIP-7516: BLOBBASEFEE opcode."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNTkZFTk1IUjI2X01WRmZBWnF2YkxaZnA0UW5OcVZOYlJwd0hrck9Ca1JvRDBVQmQwV2kzeGZPa1VWbFNmT3otNXJaS0JVTHFnbDV2SktSSUF3elgtdW5zR3ltLWZtQkZFeUxqd05MQkFnU0MzN1Z1eGRRcTllcmRGa2J3ZXBMXy1fZkJsZElDemN4X1dmamFEQy1ZUnTSAaIBQVVfeXFMTTloM21hcXVoT2dsaUo4YmV1LTA2YngtbmducDRnZk1Uc0Yxd2tTSGxOQVh4MjNpQUl4YnlmOERJSUhkeHFHVlp4NXZnSzZqOWhMc21sMXR3dmNoRjlHb0Rha2dySVhueEhiVkRNOWlaMGloUjhzR3pZSnBibWJXYm1kMl90a21KVFRMNE9pV2ZzMjhPak5veU5WNVl1ejFIRk1n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Bull Market Over for ETH Following Drop to $2.4K? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has been on the rise over the last few months, breaking through resistance levels one by one. Yet, the cryptocurrency might have reached a potential turning point.\n\nTechnical Analysis\n\nBy TradingRage\n\nEthereum Price Analysis: The Daily Chart\n\nOn the daily chart, the market has been acting very bullish since breaking the 200-day moving average to the upside. It has been making consistently higher highs and lows, with the Relative Strength Index showing values above 50% the whole time.\n\nYet, the $2,700 resistance level decisively rejected the price to the downside last week. The market is currently consolidating below the mentioned level. Meanwhile, considering the availability of several support levels, investors can still be optimistic about the short-term trend.\n\nThe 4-Hour Chart\n\nThe 4-hour chat paints a more clear picture of the recent price action. The cryptocurrency has been forming a falling wedge pattern since failing to break above the $2,700 resistance area.\n\nA bullish breakout from the wedge can result in a retest of the $2,700 level, while a breakdown would be catastrophic, as the price could drop toward the $2,100 level in no time.\n\nSentiment Analysis\n\nBy TradingRage\n\nEthereum Funding Rates\n\nWhile Ethereum’s price has been gaining momentum on the upside, market participants have become more optimistic that ETH will eventually make a new all-time high this year. Yet, too much optimism might be a worrying factor.\n\nThis chart presents the funding rates, one of the key metrics for futures market sentiment evaluation. Positive values indicate that buyers are more aggressive on aggregate, while negative values demonstrate that short sellers are executing their orders more aggressively.\n\nAnalyzing the chart, it is evident that the funding rates have been very positive for a while, showing values comparable to what was previously seen during the $69K all-time high range. As a result, the probability of a long liquidation cascade is very high at the moment. These potential liquidations could lead to a significant drop in the coming weeks."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQbERjVFRISVoxZkVRQ19ZMkJMd2ZtbFpGaGoxNlBkZ2lVQXBuUVhhckxaVG1ZcmZBMy1TZE5kd3J6STNBZFp5cm5uRHQ4Z1VSOWxPelVsVXJRTUtlOThMbjhEU09sQWtPYUxMN3FTbFlDZVpDZkE3UGhpSXotZkFCOTd5a0FZUklpc05Vc2xn0gGWAUFVX3lxTE9heksydHotYVRIYUw4MUI2QVBEYkpscGprOTdUSHV3U2htVDJJVkxrZGYzclpyc2FyaFROMUlTVnEzVlA3emhTUW12M1luRnJyZ1VYRUNpN05pQktQd1RLbTZOQ3pKZjlHYUFNZVlIQ1dWX2JoM19NcGs3X2F4ZkY0cVdhN1h4RWdRSkRXZDgtT0dnV0ZsQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Ronin Gaming Wallet Now Supports Ethereum, Polygon, and BNB Chain - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Ronin blockchain’s official crypto wallet just got a massive upgrade.\n\nSky Mavis, maker of the play-to-earn NFT game Axie Infinity and the developers behind the Ronin gaming sidechain for Ethereum, have added multichain support to the Ronin wallet mobile app for iOS and Android devices.\n\nThe Ethereum mainnet, the Ethereum sidechain Polygon, and Binance’s BNB Chain will now be accessible in the latest update, according to an image in the announcement.\n\nThe new version of the app that began its phased rollout out this week includes an in-app web browser, a new visual design that offers more details on specific token activities and NFT information, and support for multi-party computation (MPC), among others.\n\nAD\n\nAD\n\n1/ Today, the Ronin Wallet evolves. Stronger security. New blockchains. A sleeker, more intuitive design. Check your preferred app store for the latest Ronin Wallet update now to feel the future of gaming at your fingertips 🧵👇 pic.twitter.com/XEYbytlfVD — Ronin (@Ronin_Network) January 19, 2024\n\nRonin Wallet’s MPC addition is an optional security feature that allows crypto traders to essentially “divide” their wallet’s login info on the backend, requiring two or more pieces of the login instead of a single private key.\n\nThe MPC feature, when combined with a social login, can be used across multiple Ronin-based games like Axie Infinity and Pixels without having to effectively create multiple wallets, according to the blog post.\n\nLate last year, the social farming MMORPG Pixels saw a substantial spike in activity when it migrated to Ronin. A month later, the Ronin wallet added support for Binance Pay, which allows users to swap cryptocurrencies for Axie Infinity tokens like AXS and SLP.\n\nAD\n\nAD\n\nWith other wallets from the likes of Magic Eden, Sequence, and Immutable also coming to the fore, competition is heating up among gaming wallets as crypto companies add more features to gain—and retain—users.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxPeWwwNkpsclprdnB3SGNLQ2N2NkVZTDZTOS14cV96SWh2VzFwbkRyTHc0SW1qSTRKd24zb3pwRmxZRW5sMGtXc3RGRDdiUDNGZU0wV2JOdFBpWjJIMGZXMEZfWEstR1BIV2ZSRnpTTlR2U1Nvd1padk1tTlVwVlllVF9XbUFHVG9FM3FBQzFtUTRTZUVQSDlTYV9CZjVSWGhBblRKems3VVUwZ01KNzB4RmVtZ2RDb3gtVjdrb181UjdjRjhaeHczXy15M2tJYlJON1ljSXY2emJoanJKZzhkNdIB5gFBVV95cUxNLVF3OTNlc1A1YUJpVTdnczhqblBsaHNpdFdHdUdlamczd1dsMVU2ZFphdUZHRHgzUXBET2RwUFM4NzJoMUhMTEJ3MlJ5V1pUNjkxaVA5cEZmcGRmQXdyRWczZUgzWWFRRDB4X2czaUkxSWt4WUFyaDhQZmU2WW92UE13TTNzMjlMSXNCcExCSWozbG9Sdnc5NExmTy1jUmM4YmVlTzNzbWNnOHM3YnFuRWpQMDIxZXp2SzRNS1JrQ2RSSDFEY0d0ZWkwdnpqdEl0RTdjTlkwVWNpemdqdW82blJhdC1Bdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "SEC lives up to the expectations as it delays spot ETH ETF; Ethereum price makes no move - FXStreet",
        "content": "The Securities and Exchange Commission (SEC) delayed its decision on Fidelity’s spot Ethereum ETF, per a filing.\n\nDespite the spot Bitcoin ETF approval setting a precedent, the SEC stated that it needs time to consider the issues raised following evaluation.\n\nThis was expected of the regulator, given its response in the past, and the next deadline is now on March 8.\n\nEthereum price remained stationary around $2,450, unaffected by the decision, but is losing the strength to reclaim $2,500.\n\nThe crypto market faced a long battle with the Securities and Exchange Commission (SEC) when it attempted to secure a spot in Bitcoin ETF, which finally came to fruition when the court interfered. Now, it seems like Ethereum is set to witness the same ordeal as the SEC is taking two steps back after rejecting the spot ETH ETF application.\n\nSEC says no to Ethereum ETF\n\nAfter a long, drawn-out battle for the approval of the spot Bitcoin ETF, it was expected that Ethereum or other assets might not have to deal with the SEC in this regard. The reason was that spot BTC ETF, backed by the court, likely established a precedent for exchange-traded products (ETP) of such kind, but by the looks of it, this did not happen.\n\nThe SEC, in a filing today, delayed its decision on Fidelity’s spot Ethereum ETF application. The regulatory body took an early decision as the deadline for the same was set on January 21. The final deadline for the SEC is on March 8, though this will likely get extended, too, given the present scenario.\n\nThere is a chance the SEC might not obstruct the process this time, given its brush with the law last year. i.e., Grayscale’s lawsuit against the regulator. Furthermore, just like the last time, there is not just one applicant as seven major asset management firms have applied to issue their spot ETH ETF.\n\nThis includes the likes of BlackRock, ARK & 21Shares, and Grayscale too, which is attempting to convert the Grayscale Ethereum Trust (ETHE) into a spot ETF. Grayscale was the biggest catalyst in making Bitcoin ETF a reality, giving Ethereum ETFs a strong backup.\n\nSpot Ethereum ETF applicants\n\nEthereum price sees nothing\n\nEthereum price did not react exorbitantly as the altcoin remained mostly undisturbed and unaffected by the SEC’s decision. This can be seen in the chart below, where the second-generation cryptocurrency is keeping above the $2,450 support line.\n\nThis shows that the market had been expecting something like this to happen, hence the lack of bearishness at present. However, even if there is no bearishness, it does not translate to an abundance of bullishness either. The price indicators Relative Strength Index (RSI) and the Moving Average Convergence Divergence (MACD) are both showing receding bullishness in the market.\n\nThe most harm this could do to Ethereum would likely be a correction to $2,356, where a bounce-off would revive the rally.\n\nETH/USD 1-day chart\n\nHowever, a rally to $2,600 and beyond would invalidate the bearish thesis and set a new multi-month high for the Ethereum price."
    }
]