[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE80QzNocHZFLWttYlV6Rk1qVHpSNUJDZDItcGJIcTRnNUZhZF9QNUNhQzJkYWhzeUs1WjMxYnh2U3VWRnRYcVBrWU91T1JEbFFRck5EN3hHMXB3a1NUR3QtS2FuZWtFU213cm50N1o2RnFqSmlOWno5Z0ZPZXhaZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "What Is the Ethereum Roadmap: Upgrades in 2024 and Beyond - Ledger",
        "content": "What Is the Ethereum Roadmap: Upgrades in 2024 and Beyond\n\nBy Gaurav Roy\n\nBeginner\n\nSHARE\n\nKEY TAKEAWAYS: — The Ethereum network ensures constant progress through its roadmap, allowing it to improve the protocol while addressing new challenges and developments in crypto.\n\n\n\n— After the Merge and Shanghai upgrade, the Ethereum roadmap has been updated to make the network scalable, resilient, and more secure.\n\n\n\n— The next upgrade Ethereum will undergo is the Prague/Electra upgrade, which is not yet scheduled.\n\nAs the pioneering network for smart contracts, Ethereum has enabled an entire ecosystem to come to life. It is home to the majority of today’s decentralized applications (dApps) and powers an entire sector of decentralized financial services that host tens of billions of dollars.\n\nSince its founding in 2015, Ethereum price has grown tremendously, winning the support of individuals, communities, and businesses across the globe. Still, the network has some growing to do before it can gain the acceptance of a mainstream audience.\n\nIndeed, for Ethereum to become accessible, affordable, and resilient enough to be adopted by the masses, there are several challenges that it must still overcome. And mapping out those challenges, and how the network might solve them, is precisely why the Ethereum roadmap exists.\n\nBut what exactly are the challenges facing Ethereum? And how will its planned upgrades help to prepare it for mass adoption? Let’s explore what the future holds for the world’s second-largest cryptocurrency.\n\nWhat Is the Ethereum Roadmap For?\n\nFor all of Ethereum’s success as a global coordination platform, it has some shortcomings. Most notably, the network suffers from slow transaction speeds and high fees during times of high congestion.\n\nThis is arguably Ethereum’s biggest roadblock when it comes to onboarding more users. After all, if Ethereum actually reached something close to mainstream adoption in its current state, it would likely be unreasonably slow and expensive. This is, generally speaking, what people mean when they talk about the scalability of a blockchain. It’s the idea that the network needs to be able to scale up and accommodate many more users while still functioning well.\n\nOf course, tackling Ethereum’s scalability challenges brings about what is known as the blockchain trilemma. This phrase was coined by Ethereum co-founder, Vitalik Buterin, and refers to the concept that, while there are three key elements in a blockchain – decentralization, scalability, and security – you can only optimize for two of them. In other words, you can have a fully decentralized and highly secure blockchain, but it won’t be scalable. And so on and so on.\n\nAs a result of this, Ethereum has to remain highly adaptable as it continues to address its challenges while pursuing an optimal balance of decentralization, scalability, and security. Not to mention that, with the hyper-innovative, constantly changing nature of crypto, Ethereum has to be able to integrate new features, assets, and applications as they appear.\n\nThere needs to be a way to keep track of all the upgrades that Ethereum needs, which is why the roadmap exists. It’s essentially a list of all the specific changes necessary to make the network cheaper and easier to use, more secure, and futureproof.\n\nHow Are Ethereum Upgrades Decided On?\n\nAs a decentralized network and open-source network, Ethereum is not controlled by a single entity. The upgrades proposed in the roadmap generally come from Ethereum researchers and developers, but essentially anyone can offer suggestions to upgrade the protocol.\n\nBasically, any interested person can propose a change by creating an Ethereum Improvement Proposal (EIP), which outlines the technical specifications for the proposed changes. The community of Ethereum developers and researchers then reviews, debates, and potentially implements the EIP. It’s important to note that EIPs generally grow out of discussions on major Ethereum forums or the EthR&D Discord that then mature into specific ideas for improvements.\n\nAnother key point about the roadmap is that it is subject to change. The points on the roadmap can evolve as new information, ideas, and technologies become available.\n\nFor example, the roadmap previously laid out plans to scale the network through sharding, a method that involves splitting up the blockchain so subsets of validators handle only a portion of the total data. This is no longer a part of the roadmap now as danksharding, which integrates ‘blobs’ of data into Ethereum blocks, has replaced the earlier proposed sharding approach.\n\nWhat Changes Are Coming to Ethereum?\n\nScalability\n\nAs previously mentioned, scalability is a major issue for Ethereum to address. Thus, the Ethereum roadmap features several planned upgrades to that end.\n\nDanksharding\n\nDanksharding is the current plan for making Ethereum transactions much cheaper and faster and it revolves around Layer 2 solutions, specifically blockchain rollups.\n\nTo sum up, Danksharding will enable the Ethereum network to process the bundled transactions that come from layer two roll ups without having to store all of their data permanently.\n\nSingle-Slot Finality\n\nCurrently, it takes about 15 minutes for an Ethereum block to finalize. The introduction of single-slot finality (SSF) aims to make the block validation process more efficient. Under the SSF mechanism, blocks can be proposed and finalized in the same slot, significantly decreasing the time it takes to finalize a block.\n\nVerkle Trees\n\nA blend of the two concepts “Vector commitment” and “Merkle Trees,” Verkle trees serve as a data structure to upgrade nodes. Notably, Verkle Trees make it possible for Ethereum to use stateless clients. These stateless clients ultimately help scalability as they only need a tiny amount of storage space to be able to verify new blocks.\n\nUser Experience\n\nAs crypto gains mainstream adoption, blockchains must offer better UX design and customer experience to appeal to the non-technical masses. This is the key to bringing the technology to more users and advancing the next generation of decentralized applications.\n\nThis need for an improved user experience is partly being addressed by a group of upgrades, collectively referred to as account abstraction. This class of upgrades will support smart contracts natively on Ethereum. Currently, smart contract interactions can only happen through externally owned accounts (EOAs).\n\nAccount abstraction will bring about many exciting features natively to Ethereum, such as the ability to batch transactions together, recover your account if you lose the keys, or have someone else pay for your gas.\n\nSecurity\n\nEvery day, attackers try to find new ways to exploit the Ethereum network and its users. Ethereum is exploring the following features to provide top-notch security and keep attackers at bay.\n\nProposer-Builder Separation (PBS)\n\nPBS splits the block-building and block-proposal tasks among different validators. For each slot, block builders create blocks and present them to the block proposer, who can then choose the most profitable block without seeing its contents. The proposer also has to pay a fee to the block builder before sending the block to its peers. This arrangement prevents transaction censorship, establishes a fairer consensus mechanism, and facilitates the Danksharding upgrade.\n\nClever Cryptography\n\nThe proof-of-stake (PoS) based consensus mechanism currently makes the list of upcoming block proposers public, making it possible to map their IP addresses. This makes them vulnerable to attacks such as a DOS attack. Clever cryptography here makes sure the identity of the current block proposer is not made public and protects them.\n\nWhere are we on the Ethereum Roadmap so far?\n\nOver the last nine years, Ethereum has gone through several upgrades to enhance its network, with the last two major upgrades being the Merge and Shanghai.\n\nWhat Was the Merge?\n\nActivated on Sept. 15, 2022, the Merge was a way to complete Ethereum’s shift from the energy-intensive Proof-of-Work (PoW) consensus mechanism to the more efficient Proof-of-Stake (PoS), where validators are randomly selected based on the total amount and duration of their ETH staking.\n\nIn December 2020, developers launched the Beacon Chain as a basic PoS-based version running parallel to the regular Ethereum mainnet. They used it to test reconfigurations and new features safely.\n\nJust under two years later in September 2022, the integration of both the Beacon Chain and the mainnet marked Ethereum’s official adoption of the PoS consensus mechanism across its ecosystem.\n\nWhat was the Shanghai Upgrade?\n\nAfter the Merge, the Ethereum Shanghai Upgrade, also known as the Shapella upgrade, was a major step in finalizing Ethereum’s move from PoW to PoS. While this planned hard fork of the protocol opened the door to new developments, it also unlocked the ability to withdraw staked ETH from the Beacon Chain.\n\nUp until the Shanghai upgrade, those who staked their ETH on the Beacon Chain were unable to withdraw their locked-up ETH and the rewards earned in the process. However, following the Shanghai upgrade on April 12, 2023, validators could finally access their ETH holdings and cash out their rewards.\n\nWhat was the Dencun Upgrade?\n\nThe Dencun Upgrade, one of the major upgrades, went live on March 13th. It’s designed to reduce costs for layer-2 transactions and enhance data availability on Ethereum. Notably, this upgrade introduces “proto-danksharding”, the first step to scaling the network through danksharding.\n\nProto-danksharding, or EIP-4844, introduced data “blobs”—an acronym for ‘Binary Large Objects.’ These data blobs can be sent and attached to blocks, aiming to minimize the data stored permanently on Ethereum.\n\nCurrently, layer-2 scaling solution rollups post their transactions in CALLDATA, which is costly because their data remains on the chain indefinitely. In contrast, the data in blobs are automatically deleted after a fixed period, reducing data storage costs and thus lowering transaction fees for users.\n\nWhat’s next on the Ethereum Roadmap?\n\nNow, the Ethereum network is preparing for more upgrades to advance its capabilities. Here’s what’s next in line for the blockchain:\n\nPrague/Electra Upgrade\n\nOnce implemented, the Dencun upgrade will allow developers to focus on the next update, the Prague/Electra upgrade (Pralectra). Interestingly, there is still a debate among core Ethereum devs about what Pralectra will entail.\n\nOn one hand, it could look like several smaller EIPs focused on adding new features to the network. For example, one of the major proposals for this upgrade is EIP-6110, which would improve Ethereum’s security and stability by changing the way that the network processes its validators’ deposits.\n\nOtherwise, Pralectra could end up being a major protocol upgrade that would add Verkle Trees to the blockchain’s execution layer. As previously mentioned, Verkle Trees are an important milestone in the overall Ethereum roadmap, important for increasing its scalability.\n\nWhile the specific items that Prague/Electra will center on are still being decided, this upgrade will undoubtedly make further improvements to the network’s performance, security, and usability.\n\nThe Future of Ethereum\n\nOver the past decade, cryptocurrency has emerged as a revolutionary answer to the traditional financial world by offering a decentralized, permissionless, and secure alternative to traditional banking systems. In the same spirit, Ethereum has brought forth a wave of innovation in global decentralization. With its advanced technology, growing ecosystem, and constant evolution, the future of the pioneering smart contract chain is bright indeed.\n\nAnd it’s a future that you can be a part of! By getting yourself a Ledger Ethereum wallet, you unlock all that the Ethereum ecosystem has to offer, all while enjoying the power and security of self-custody.\n\nSo what are you waiting for? Take your place at the forefront of the Ethereum evolution and explore the bleeding edge of innovation in the decentralized world."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPbnU1OXBFeFR4V2lyelR3eWkzNnA5UG1xRzJ0X1BCWlNBOVZHamEtMXVGYWRNbl82UWdmc0FDU0k2QVBIRXlXcjg0UGFoUUpqaHZOdkJaRmEyaHFzNTRjQWVRc0swZEYxOVlKTmhLcV9ERVZwSUp4TGNWdTRUWWxDSTQ2MGZKS0tzSVZPc3RlSVFkUG1lbWJOT3RJY3NOd203TFJQRjVqb3BNb3dISl9r0gG0AUFVX3lxTFBHU1c4TE9Ody04Z2UyUVhFV3FUQmZabExIWHcxd3Rfcl96ZnI1UlJrYVhBc1NPMHRDTk92UnpTcDdocG92RFVZMWh3NDhHM0VoSm9nVFpiVF93NXNGSmxBd3FuU0NOT2VZOVJUeHNYQTNmQTJfMmU4SnVGQXdRN3FlRHNFcTF6VEFKOU9xa3dVZkU1Z1JnS0dDNHM2OXVvVzFDWVM2b3pLTFNicGk5VDJscGk5ZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Layer 2 Blockchains Become Cheaper After Ethereum's Dencun Upgrade - CoinDesk",
        "content": "According to blockchain analyst Marcov’s Dune-based tracker, the average cost of transactions on scaling solution Optimism has dropped to nearly 4 cents, down significantly from the recent average of around $1.4. The average fee on Coinbase’s layer 2 solution Base fell to 3 cents from roughly $1.50, while Arbitrum’s declined to 40 cents. The average fee on zkSync and Zora also fell."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxONkVEcGhET3VxNnVjRDBIMm50MFVjak16cHA5MHB5SWxmTGM5b1BzSEx3TlJySEliZ1BZZVE4Mkg2WWljVE9vcjFFTE4zX2JUbXA3azZ2WHFNM3UzVXBuUEc2QVpYWHR6UmZoZllfUTJ5UmoyS1F5ZXA1VGUxM1hJbUZEQm12UHhta3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin ETFs have been a runaway hit. Will we see an Ethereum ETF before long? - Fortune",
        "content": "Barely two months since their approval, spot Bitcoin ETFs have proved massively popular, with over $11.8 billion flowing into the so-called “Newborn Nine,” including a record $1 billion on Tuesday.\n\nLargely as a result, Bitcoin’s price has shot up almost 60% this year, reaching an all-time high near $72,000, and Ether has climbed at roughly the same rate, to around $4,000. Part of the latter’s gains may be attributed to anticipation over the Securities and Exchange Commission’s final deadline to respond to the first spot Ether ETF application, issued by VanEck, on May 23.\n\nGiven the success of the new Bitcoin investment vehicles, how might the SEC rule on similar products tied to crypto’s second-biggest blockchain, and what should markets expect? Well, it depends whom you ask.\n\n‘A pretty vanilla approval’\n\nIn theory, an approval “should be easy,” Bitwise CIO Matt Hougan told Fortune, as SEC Chair Gary Gensler approved spot Bitcoin ETFs after the existence of Bitcoin futures ETFs, and the latter already exist for Ether.\n\n“You’ll see a pretty vanilla approval, and if it’s a denial, it would need to be some new reason that people can’t think of,” Vance Spencer, co-founder of Framework Ventures, told Fortune.\n\nBoth Spencer and Aurielle Barthere, a research analyst at Nansen, pointed out that big names could help soothe regulators’ concerns as they did with Bitcoin. Someone like BlackRock CEO Larry Fink could help sway Gensler by citing his near-perfect ETF track record. “This is a very powerful man,” added Spencer.\n\nSEC seeking public comments on various spot ether ETF filings…\n\n\n\nReally comes down to this:\n\n\n\nShould approval of spot btc ETFs = approval of spot eth ETFs?\n\n\n\nGiven SEC allowed eth futures ETFs, I say yes.\n\n\n\nBut clearly key differences b/w btc & eth (which SEC circling in on here). pic.twitter.com/tSPezL1n3U — Nate Geraci (@NateGeraci) March 6, 2024\n\nBut while hopefuls point to the approval of spot Bitcoin ETFs on Jan. 11 as precedent, others are convinced Ether’s path could be more arduous: After all, it did take the SEC nearly a decade to come around on the spot Bitcoin vehicles.\n\nFor starters, some of the issuers, including Ark and Franklin Templeton, have contemplated staking Ether in their applications, which would be “a significant complication,” Hougan noted.\n\nStaking involves locking Ether tokens into the blockchain to help validate transactions and earn additional yields, part of a proof-of-stake mechanism. The latest reward rate is 4.17%, according to Staking Rewards. When a validator stakes tokens, it signifies a commitment to the network’s security. But Gensler voiced concern last March that digital assets using staking protocols could be considered securities under federal law.\n\nAnd then there’s concern ETF inflows would put more staked tokens in the hands of just a few providers. S&P Global analyst Andrew O’Neill told Bloomberg last month this “could become large enough to change validator concentrations” in the network, exposing it to operational risks associated with centralization, such as outages from a single point of failure or market manipulation.\n\nBTW, Ethereum is fundamentally incompatible with an ETF.\n\n\n\nProof of Stake Txn validation & coins held with a centralised custodian doesn't work.\n\n\n\nCoinbase would control the entire network.\n\n\n\nThe only reason to approve an ETH ETF is if the SEC wanted to destroy Ethereum 🤷 — Thomas | heyapollo.com (@thomas_fahrer) February 18, 2024\n\nBut Hougan dismisses these fears: “I don’t think it’s a big deal.” Indeed, staked Ether only represents a quarter of total coins, and while Bitcoin spot ETFs are booming, their assets under management are a drop in the ocean compared to the currency’s market cap.\n\nMatteo Greco, a crypto analyst at Fineqia International, adds that the same argument could be applied to the 11 publicly traded U.S. Bitcoin miners that dominate the network’s hashrate. He ultimately sees some level of centralization as a trade-off for the market reaching mainstream popularity: “You can’t maintain full decentralization and reach billions of people.”\n\n‘A major roadblock’\n\nAnd then there’s the question of Ether’s legal status. While declaring more than a dozen other popular coins to be securities, the SEC has so far flip-flopped on Ether. In 2018, Gensler was filmed telling hedge funds it’s not a security, but then avoided taking a position at a congressional hearing last year. That ambiguity could be “a major roadblock” that adds “complexity” to the process, notes Jag Kooner, head of derivatives at Bitfinex.\n\nAnother potential obstacle could be the relative youth of the Ether futures ETF—October 2023 vs. April 2021—compared with those for Bitcoin. Ether is also less liquid, Greco adds, and its market cap is only about one-third of Bitcoin’s. More liquidity generally means less of a spread and more consumer protections—if a futures market lacks liquidity, it could create a significant divergence between spot and futures prices.\n\nLastly, there is political pressure. Gensler may want to align with the anti-crypto stances of some elected officials—or those seeking election—instead of “rolling over,” noted Jake Chervinsky, chief legal counsel at Variant Fund. And on Friday, in a letter from Sens. Jack Reed (D-R.I.) and Laphonza Butler (D-Calif.) to Gensler, they called on the SEC to halt the approval of additional crypto ETFs, expressing concerns over smaller cryptocurrencies being susceptible to “pump-and-dump” schemes that could pose “enormous risks” for retail investors.\n\nIt brings me no joy to be an ETH ETF bear. I’ve been working for Ethereum in one sense or another for 5+ years. I want the ETF to be approved. It should be.\n\n\n\nBut I’m calling it like I see it, and I see an SEC that:\n\n\n\n(1) dislikes crypto as a concept, sees no value in the… — Jake Chervinsky (@jchervinsky) March 11, 2024\n\nWhen will we know—and what’s next?\n\nSpencer predicts there’s a 60% to 70% chance of a May approval. Nansen’s Barthere agrees, adding it’s “rather likely,” citing the token’s absence from recent SEC lawsuits against top exchanges Binance and Coinbase.\n\nBut while Hougan took a more cautious approach, he did say it’s 75% likely to happen by year’s end.\n\nChervinsky, on the other hand, says 2024 isn’t likely for such an approval. The SEC doesn’t appear to be working out the necessary details, and if the agency stays mostly quiet in the buildup to May 23, “that silence will speak volumes,” he adds.\n\nIf approved, many experts predict Ether could shatter its all-time-high of $4,878, reached in November 2021, just as Bitcoin skyrocketed after the spot ETFs got a green light. But, Hougan notes, it’s less likely inflows to Ether-based products will match their Bitcoin brethren.\n\n“Many traditional investors just want exposure to crypto,” he said, “and it will take some time to differentiate between the different public blockchains.”"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNNTFvc2hxMExVTG5nSU03MHlTRUVTY3Q4ZnhkNnAwX1RYZXlvdlN4U0xLbVBZWEdUZERLV1M2ekljTHZzakkwM3BFVGxLVGRCQjFxZDhjLUhwejZ1a21RZENwY2FMODUtUjhlOENsaEg1OG80WE5Ya0dmWk81aHAxdjNlTzFoVHE4dWZ0TEh5dUxaUEJmeGpuNURtY000RmtSNi12N0hvaWg3VXIwTV9MNHZNXzlLZEpBNkx5MjBkWjFPNk0weDBlVXZmYkQ1R3FvcF9j0gHYAUFVX3lxTE5DMTJaSDdhcHk0Y1VGakJyTU9zejNRMTdPZDBWc0p2MjFYSWh0QmNsUjZsTVREX3hMZDZLY2xfcGdVQnhXQ2JITGxyZXZ2TzY3bGZaUGpzLVdPTE5CSlh4VVJ6bzczbzZwcGRKM0k4OE5IR1hlM29ScXhKdjBFaTVYR1dxYjVwZmVQWEFSLTZlVEpPd0hnLVNETEJVd3FWT1BVRE9Mb2RhYWJ0ZFJTVE5sVnZWSnotMDRTaEQtcUhLRjVoVE5Bc1M5UHBkeVVzUk9IZGFnQ293bA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Ethereum could drop to $3,600 – Here’s why - FXStreet",
        "content": "Over $1 billion worth of Ethereum hit exchanges in March 2024, ahead of the Dencun upgrade.\n\nWhales have consistently taken profits on their Ether holdings, to the tune of $7.36 billion in March.\n\nETH price could correct to $3,622 as technical indicators turn bearish and signal decline in Ethereum is likely.\n\nEthereum (ETH) price is at a risk of decline, according to technical indicators and on-chain metrics. A large volume of Ether hit exchanges in March, and ETH holders realized over $7 billion in profits. The altcoin is trading sideways, with Ethereum price at $3,922 at the time of writing.\n\nAlso read: Base and Optimism become cheaper than Solana as Ethereum Dencun upgrade empowers L2 chains\n\nEthereum price at risk of decline: On-chain perspective\n\nCrypto exchanges have noted Ether token inflows worth $1.02 billion in March 2024. The mass inflow of Ethereum is accompanied by profit-taking activities of large wallet investors. The chart below shows the inflow spikes throughout March.\n\nSupply on exchanges and Ethereum exchange flow. Source: Santiment\n\nData from crypto intelligence tracker Santiment reveals that there have been spikes in whale transactions valued at $100,000 and more. Whales have likely realized gains consistently in Ethereum’s uptrend, as shown in the Santiment chart below.\n\nWhale transactions valued at $100,000 and higher, Network Realized Profit/Loss. Source: Santiment\n\nOn-chain metrics signal there is likely an increase in selling pressure on ETH and Ethereum price could crumble if holders continue realizing gains in the coming weeks and months.\n\nEthereum price could nosedive to $3,600: Technical analysis\n\nEthereum price hit its 2024 peak of $4,093.92, on March 13, following the successful rollout of the Dencun upgrade. As Ethereum rallied towards its new year-to-date high, ETH holders kept up their profit-taking. Technical indicators reveal there is a potential for a correction in Ethereum price if demand from traders fails to push ETH price higher.\n\nA nearly 8% correction is likely in Ethereum, ETH price could nosedive to $3,600, the midpoint of the Fair Value Gap (FVG) identified on the ETH/USDT weekly price chart. Once Ethereum sweeps support at $3,600, the altcoin could make its way back to the range high at $4,093.92.\n\nThere is a bearish divergence in the Relative Strength Index (RSI) on the 1-day chart, and there are red bars on the Awesome Oscillator (AO). The technical indicators signal Ethereum is likely at the risk of decline, facing a potential correction.\n\n\n\nETH/USDT 1-day chart\n\nIf Ethereum price fails to bounce off the $3,600 level, the altcoin could drop to support at the lower boundary of the Fair Value Gap at $3,522. Such a move would imply over 10% correction in Ethereum.\n\n(This story was corrected on March 14 at 14:37 GMT to say, in the first bullet point, that over $1 billion worth of Ethereum hit the exchanges in March, not over $1 million.)"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPenVrNlJVc3FiNHM5M1pZZlZYSWJoQkpkcC03NUFTR2Q5SWNIMEdvVTZzUURhcndOeTlRVjBWOHpsdTRqc1p0VldLTnFoU2dJRExhSGxIaFVuZjY0THpyVTJVLThqeFJFWDdmcjhzdkNsa3cxMVRSX21xaWJ0NVJuVXNNRHh1cFRkLTZSSnh4YjNNLURTV2xFUWttVWJHRzRxRjYxYXFUOXpYQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Dencun Day One: Ethereum Layer 2 Networks See Drastic Drop in Transaction Fees - Unchained",
        "content": "Some Ethereum layer 2 networks have seen their median transaction fees decline by as much as 99% after the Dencun upgrade went live. These are some of the biggest winners.\n\nEthereum Layer 2 networks were the biggest beneficiaries of the upgrade\n\nThe much anticipated Dencun upgrade has led to a significant reduction in transaction fees on Ethereum layer 2 networks, with the effects of the immediate scalability already taking shape across the ecosystem.\n\nThe Dencun upgrade went live early on Wednesday after it activated on the Ethereum mainnet at epoch height 269568. The upgrade introduced the highly anticipated proto-danksharding functionality via EIP-4844, which integrates off-chain “data-blobs” that decrease the costs associated with storing transaction data.\n\nEthereum Layer 2 networks, which are designed to provide a faster, cheaper route to executing transactions on the underlying blockchain, were the biggest beneficiaries of the upgrade. Data from a Dune dashboard created by “@Marcov” shows that popular layer 2 networks such as Optimism, Base, Arbitrum, Zora and zksync have seen massive declines in their average transaction fees.\n\nAt the time of writing, median transaction fees had dropped to $0.05 on Optimism, $0.064 on Base, $0.5 on Arbitrum and $0.16 on zkSync Era. So far, Optimism and chains based on Optimism’s tech stack such as Base, have seen the biggest reductions in fees.\n\nWe love to see it. OP Chains have the most affordable decentralized L2 transaction fees after 4844, bringing us that much closer to the reality of seamless end-user experiences. ✨In Blobs We Trust✨ pic.twitter.com/WOovhcZelk — Optimism (@Optimism) March 14, 2024\n\nafter 2 years of hard work, blobs are now live on @base before: $0.31\n\nafter: $0.00 (but actually $0.0005) wallets need to update to handle these cost reductions! pic.twitter.com/solIX9D4HM — Jesse Pollak (jesse.xyz) 🛡️ (@jessepollak) March 14, 2024\n\nStarknet, another Ethereum Layer 2 solution, posted a screenshot of the change in its transaction fees on X showing that a single gas transaction had declined 99% since the Dencun upgrade synchronized.\n\n“Dencun is both the most complex fork we’ve shipped since the Merge, and tied for ‘most total EIPs in a fork’ with Byzantium. There were more teams than ever involved in the process, and it somehow all worked out smoothly,” said the Ethereum Foundation’s Tim Beiko on X."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTFBnT1plLVMyRFBsQUtFb0Ntdmd4SnFHanp2RWpUeHpreWVDbmMtenN6cGZDVngwUlprSG4wd2RTU3haeUhCQ2xwa1M0ZlEzLTdCcWFXUno1UC05WTZJcG00UzJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Blobs, MSTR and more: This is Ethereum’s broadband moment - Blockworks",
        "content": "The internet turned 35 earlier this week, and it seems only fitting that Ethereum would undergo arguably its largest upgrade ever just one day later.\n\nEthereum’s Dencun hard fork went off mostly without a hitch on Wednesday. Its arrival delivered a bevy of nine improvement proposals, with the blob-centric EIP-4844 being by far the most memeable.\n\nFor more than a decade after Tim Bernes-Lee (himself a dabbler in NFTs) first conceived the World Wide Web, internet users languished inside a slow, cumbersome internet plagued by bandwidth bottlenecks.\n\nDial-up modems could only handle up to about 50 kilobytes per second. The platforms we now take for granted — YouTube, Spotify, Twitch and TikTok — were as unfeasible back then as high-frequency trading on many layer-1 DEXs are today.\n\nThe arrival of broadband in the early 2000s immediately 10x’d consumer-grade internet to 512 kb/sec. Impossible ideas could now be realized into billion-dollar dot-com powerhouses, radically overhauling the dynamics of our culture and turning us all terminally online.\n\nNow, two decades later, TV is all but dead, replaced by a gamut of streaming services. AR headsets backed by hyper-fast wireless blend our physical worlds with the same digital space that Bernes-Lee laid out in his 1989 paper outlining the web.\n\nWhat broadband did for the internet, blobs are now doing for Ethereum.\n\nBlobs give the raft of layer-2s their own space through which to post transactions to the Ethereum mainnet without clogging up the blockspace intended for other users.\n\nThey have their own fee market, which means regular folk and their protocols of choice won’t have to compete with rollups and sidechains for blockspace — leading to lower fees for all involved.\n\nDencun and its blobs have already massively reduced fees for the layer-2s that have adopted the new rules. For example, Optimism and Base fees are down to a fraction of an American penny per transaction compared to nearly $1 before the fork.\n\nYouTube debuted in 2005, a half-decade after the rollout of the first consumer-grade broadband services. Justin.tv, the precursor to Twitch, came two years later.\n\nIt could be that layer-2 fees rise over time as more layer-2s compete for blobspace. The true impact of Ethereum’s successful push toward a cohesive and holistic multi-chain ecosystem, powered by “blobband,” probably won’t be felt for years to come.\n\nBut the groundwork has now been laid. Welcome to Ethereum’s blobband era.\n\n— David Canellis\n\nData Digest\n\n🙃 Solana has flipped Ethereum layer-2 Arbitrum for total value locked (TVL) to become the fourth largest DeFi ecosystem — a first since November 2021.\n\n🌊 A quarter of a billion dollars was liquidated on centralized exchanges over the past 24 hours, 60% longs.\n\n🤪 Memecoin mania puts Solana number-one for DEX volume over the past day — $1.45 billion to BSC’s $1.14 billion\n\n😴 All quiet on the crypto front as BTC hovers around $73,000 as ETH sits just below $4,000.\n\n✋No budge in the benchmarks: S&P and the Dow were flat during the pre-market trade. That’s no surprise, considering the VIX’s drop to 14 from its long-term average of 20.\n\n✅ Good news: A bull market with a high VIX tends to spell “bubble trouble” — so lower volatility with higher prices may be a boon for traders.\n\nIs the SEC in the crypto market’s rear-view mirror?\n\nThe crypto pump is upon us.\n\nSOL is up 18% this week and almost 50% over the month. Binance’s BNB and Filecoin are each up more than 80% over the past 30 days. Wormhole’s Portal Bridge has facilitated more than $113 million in transfers from Ethereum to alt chains like Solana, Sui, and Arbitrum over the past week.\n\nHas the market forgotten that in the eyes of the SEC, they are all securities? Probably. Or maybe traders are just confident that Coinbase and Binance will emerge victorious in their legal battles with the regulator.\n\nIn June 2023, the SEC filed back-to-back lawsuits against Coinbase and Binance for allegedly selling unregistered securities, among other things. The regulator named 13 cryptocurrencies available on Coinbase and ten that trade on Binance securities — despite none of these issuers being named co-defendants in the cases.\n\nThe SEC has also not filed any individual lawsuits against these alleged security token issuers, opting to take a different approach than it did in 2020 when it sued Ripple over its XRP token — a suit that ultimately did not play out in the regulator’s favor.\n\nBoth cases are still playing out in the legal system, and you might remember the SEC was notably absent from the Department of Justice’s historic $4.3 billion settlement with Binance back in November.\n\nBut if you look at token prices, you’d think the SEC had dropped the cases.\n\nCoinbase and Binance are both waiting for rulings in their motions to dismiss their respective cases. If the suits are not fully dismissed, the exchanges will move on to the discovery process.\n\n— Casey Wagner\n\nCan’t stop, won’t stop?\n\nAfter offering an oversubscribed round where MicroStrategy (MSTR) raised nearly $800 million in senior convertible notes — mind you, they initially sought to raise $600 million before upsizing to $700 million last week — the company has proposed another $500 million in convertible notes.\n\nMSTR could, all-in-all, raise around $1.3 billion from its convertible notes offerings to fund its bitcoin purchases.\n\nWhile this represents a new approach to the same tactic we’ve seen from MSTR in the past, Michael Saylor’s firm might have found a way to ensure that the stock remains more attractive than the bevy of bitcoin ETFs on the market today.\n\nBy the numbers: MSTR has about $48 million in cash on hand as of December, but it has roughly $15 billion worth of bitcoin at current prices.\n\nIt’s fair to note that while the company may spend that cash on hand, MicroStrategy appears to largely plan to add to its BTC hoard. The stock was around before the bitcoin ETFs, and so far, it looks like it won’t only stick around, but may even outperform.\n\nCompare IBIT and MSTR, for example. MSTR is outperforming BlackRock’s ETF even as the two go head-to-head over who holds the most bitcoin.\n\nMSTR’s bitcoin buying spree has proven to be a win-win for them: Wall Street’s happy and, more importantly, the crypto crowd goes bonkers when the company announces a new buy. And, trust me, the company is always announcing new buys. This year alone, MSTR has bought nearly 16,000 bitcoin.\n\nAdding to that, when bitcoin’s price rockets, so does the company’s stock. The company, at the end of 2023, was trading around $680. Now, the stock is getting close to $2,000 — up 200% in the last three months alone.\n\nSuffice to say, Saylor and MSTR keep hodling. The company isn’t afraid to hit the buy button — even if it means raising some debt to do so — and the most recent debt offerings show that the company’s appetite remains ravenous.\n\n— Katherine Ross\n\nThe Works\n\nWelcome to The Works 👋 Your daily slice of crypto (and not-so-crypto) from around the Web. 🕸️\n\n💸 Bakkt against the wall? The publicly-traded crypto company once owned by finance giant Intercontinental Exchange is facing an existential dilemma after receiving a notice from NYSE about its sub-$1 share price.\n\nBakkt’s been below a buck since the end of February, but it’s pledging to “cure” the problem. Stay tuned.\n\n🧠 The crypto team at Franklin Templeton thinks “meme coins have a strong relationship with their native networks.” The top response on X? “[w]e need a memecoin ETF” — something we’re sure Gary Gensler would love.\n\n🐕Speaking of memecoins: X owner Elon Musk, visiting Tesla’s Berlin manufacturing plant, was asked when people can buy a car with dogecoin.\n\nMusk’s response, according to a video from X user @dogeofficialceo: “At some point, I think we should enable that.” He then talked up how people can buy merch with the dog-themed memecoin.\n\n🌱 A bitcoin ETF proposed last December would load up on 20% carbon credits, per a new regulatory filing.\n\n🤬 The CEO of Palantir, Alex Karp, is a bit, uh, steaming mad about short sellers.\n\n😕 Today’s why-is-this-a-crypto headline: “What the Kate Middleton story tells us about bitcoin”\n\nThe short answer, per the FT’s Bryce Elder: “[a]bsolutely nothing.” Okie doke.\n\n🚚 BitKey, Jack Dorsey’s bitcoin hardware wallet play, is (finally?) enroute to people’s mailboxes. Get excited.\n\n⚖️ Finders keepers: Australia’s finance regulator lost a legal fight against the Finder Wallet Pty Ltd, with a court saying the firm did not offer an unlicensed financial service.\n\n🔬 Researchers over at the Bank of International Settlements dug into DeFi borrower behavior in a new study.\n\n🤔Summing it up: Investor and AngelList co-founder Naval Ravikant believes that crypto is “adversarial venture capital.” Makes you think.\n\n— Michael McSweeney\n\nThe Morning Riff\n\nTranslation: We’re so back (source)\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQQlVXdjktVndCWm1Zc1RRYUlSTUhLa0U0bEpqVmZyZXdSUmc1dUZYVDNoTFZIMjRuOUt4bFcyZS16a01kcHJXY3htUEtjRUxOVnRfQ3JRWEtaeVVTZGVDZk5Kc01UV2F0VF92bUhJR1JQVU53WC1FLVNOTkpYaHVxNWhtZU4yeWJrWDNuX2VPUDdRbUxKQ3Ricmc4WHc2MTVTWW5pcg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Ether Slips from Highs as Investors Lock in Profits After Upgrade—Key Levels to Watch - Investopedia",
        "content": "Key Takeaways Ether was down more than 5% in early trading Friday morning as investors locked in profits following Ethereum's Dencun upgrade.\n\nInvestors are hoping the SEC will approve a spot Ether ETF application filed by BlackRock on May 23, though Bloomberg ETF analysts estimate the chances of an approval by that date at just 30%.\n\nThe Ether price may find support at the key 38.2% and 50% Fibonacci levels around $3,365 and $3,135.\n\n\n\nEther (ETH), the native coin of the Ethereum blockchain and second largest cryptocurrency by market capitalization, traded more than 5% lower early Friday morning, days after the network successfully completed its highly anticipated Dencun upgrade, indicating investors may have already factored in the news.\n\nThe enhancement, which aims to improve the Ethereum ecosystem’s cost-effectiveness, added to bullish sentiment surrounding Ether, helping propel the cryptocurrency through the $4,000 level earlier this week. “Dencun will change how Ethereum developers build smart contracts, leading to more secure and user-friendly applications,\" Richard Meissner, co-founder of Safe, told Cointelegraph in an email.\n\nIn addition to the Dencun upgrade, Ether has ridden tailwinds of ongoing record flows into spot Bitcoin exchange-traded funds (ETFs) and growing expectations that the cryptocurrency could soon have its own spot ETF. Investors are hoping that the U.S. Securities and Exchange Commission (SEC) will approve an Ether ETF application filed by asset manager BlackRock on May 23, though Bloomberg ETF analysts estimate the chances of an approval by that date at just 30%.\n\nThese recent bullish factors may already be baked into the cake. On Tuesday, Ether put options, a financial instrument that protects holdings in the cryptocurrency from potential price downturns, traded at a premium to Ether call options expiring over the next 30 and 60 days. Singapore-based digital assets trading firm QCP Capital said this shift in sentiment, combined with high levels of leverage in the market, may lead to a correction, but that it expects dips to be short-lived.\n\nEther started its current bull run in late October last year, with the uptrend gaining further momentum when the 50-day moving average crossed above the 200-day moving average just over a month later to form a bullish golden cross chart pattern. Gains accelerated throughout February and early March before the price ran into resistance earlier this week just above the closely watched $4,000 level. Amid ongoing selling pressure, monitor key Fibonacci retracement levels as potential areas of support. Currently, the 38.2% Fib level sits around $3,365, while the 50% Fib level lines up with the $3,135 region.\n\nEther was at $3,665 at around 6:30 a.m. ET.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info.\n\nAs of the date this article was written, the author does not own any of the above securities.\n\n"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxPWW5xUlVsckd2LXZBZVBydU9sNFJfWGs4YUVra0FVQVJsbzNaNzBBTTdkYnVCampRUElVYVMwY1BhRDRWdEZtMTdmSnBtd1VnOGtrQzdrQVlNYXFRSkFxdWJVR1VlT0psTnJOV0RGeWhwaXpka0tYV2ZiOTN6VHZZbjgybzNwU1dTN1liRm1VWWNlbW5zOG9QVkdMLXNLdkVEY2NIWlJfelhCek81cjRLeG1hbWJzMUFyb0d0MW9qVU9fZno4amJYZjFSZk50bHBBUWpCSXlMRWlYWU14UWhIUXF0cHPSAeoBQVVfeXFMTjZ1NGFtUkNhcDFLM2NwVVdtbXQ3YWFKTVZ4V080bjZIcHJhNTljNW9WdXFYc0JlVXlsYkRZSFp6YS1jdWFyZ2VNTDZWcm1VelpWY2lfelpKZWR5VU1OZllmSGduYmdDU3p3M2RZNjRIaEk4b1oybHREOVd1UkRLSzhBaHZNUExhQWstanZGMVRLZl95UEljOExtVzZ6MVVPc2YwTG8ySTFQelRpa1EwNTZvZ1A5aU04d3RjaUtNNERNbnprekZQOUtXak5EOHdRQ21hT1J2ZlYxVURLdzlBaFJmQWtGTHVQajd3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Has Ethereum defeated Solana in the scaling war? - FXStreet",
        "content": "Ethereum Dencun upgrade introduced proto danksharding, reducing transaction costs for Layer 2 chains like Base and Optimism.\n\nCritics argue that Layer 2 fees could increase in upcoming weeks and months as chains compete for blob space.\n\nEthereum Layer 2 tokens see price nosedive on Thursday, while ETH price trades sideways below $4,000.\n\nEthereum Layer 2 chains are competing with Solana for scalability after transaction costs were significantly lowered by Ether’s Dencun upgrade. While the successful rollout of the hard fork on the Ethereum mainnet has reduced fees for chains like Optimism and Base relative to Solana, critics argue that this may change with competition among Layer 2 chains.\n\nLayer 2 tokens noted a correction in their prices on Thursday.\n\nAlso read: Ethereum Layer 2 locks nearly $40 billion in assets as Dencun upgrade looms\n\nEthereum Layer 2 versus Solana, the scaling war rages on\n\nEthereum’s Layer 2 scaling solutions like Polygon, Base, Optimism, Arbitrum, among others, are competing with Solana for “scalability.” There is no clear winner since the altcoin’s Dencun upgrade has slashed transaction costs for Layer 2 chain users.\n\nData from Dune analytics shows the average transaction cost in USD for the top Layer 2 chains. The cost is down to $0.057 for Optimism, $0.054 for Base and $0.005 for Zora, among others.\n\nLayer 2- Average Transaction Fee in USD. Source: Dune Analytics\n\nThe implementation of proto danksharding, or EIP 4844, has introduced blobs to reduce the cost for Layer 2 chains, at least by one order of magnitude. At the time of writing, Optimism (OP) and Base are cheaper than Solana. However, critics argue that Layer 2 fees could climb in the coming weeks and months.\n\nThe crypto analyst behind the X handle @QwQiao of AllianceDAO, argues that Layer 2 fees could go up as the chains compete with each other for blob space. Data from Chainspect reveals that Solana ranks high in Transaction Per Second (TPS) compared to Ethereum and its Layer 2 chains. This is an important metric since TPS represents the ability of a blockchain network to handle transactional load. The higher the TPS, the more transactions the network can process in a given time frame, boosting its real-world utility.\n\nTPS for Solana and top Ethereum Layer 2 chains. Source: Chainspect\n\nSolana may still be far ahead of Ethereum and its Layer 2 chains in terms of scaling, since TPS is an important metric to determine the scaling prowess of a chain.\n\nEthereum trades sideways, L2 token prices nosedive\n\nEthereum is trading sideways below the $4,000 level and Layer 2 tokens Immutable (IMX), Optimism (OP), Mantle (MNT), Arbitrum (ARB), Starknet (STRK), and Manta Network (MANTA) noted up to 7% decline in their prices on the daily timeframe.\n\nEthereum Layer 2 prices. Source: CoinGecko\n\nLayer 2 token prices have dropped since the successful completion of the Dencun upgrade. This is likely a “sell the news” dip, where anticipation of fee reduction and higher utility of Layer 2 chains drove prices higher prior to the event, traders likely engaged in rapid profit-taking and “sell the news” behavior following the upgrade."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQNzl0UG1RSV9rUm45dFU5dUhqeDZpWVBDalltWThmbFc3WXRmY0hQaWFqY0ZPSERkV29MNGlFMFJORFg5ejV3WUZQdTRMN2xfZTM2RV9vWGlFMjdYdjR6Wl9wN3F6c295ZWNObXEtY1B2Y2lLUVhkMWdka0RnYWRmd0l1dGJnc1FLY3V0RFFRM0RZbFFxV2dRd0hfa0FDa2RNUmt2Mm83cnTSAa4BQVVfeXFMUGp2XzNFNFZyaEg1TUJlWHhaOTFQN2tQVmpYdEtyTXdaLVdNMjFyalJORE5aMHQ4TWE2XzBIOXhaNmRLMDkyTlNvN1kzQ1ZXNk9FTkI0YjBZZ2FMa3U4cGJVU2ZvTDV2Tkp4Ym0wQl9kVXR4UEV1WDFGUWFWUFJ3RmRzaElBcWJTSkZkLXVVZEVzUmtfTHVJTEY4ZTBwdTc5RzJCYUc2ZGk0TUxSYnJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Crypto for Advisors: The Investment Case of Bitcoin vs. Ether - CoinDesk",
        "content": "Finally, we may see an ETH ETF as early as May this year. May 23 is the final deadline for the SEC to decide on the VanEck and ARK 21Shares applications. As a sign of growing confidence in an ETF approval, Grayscale's closed-end Ethereum Trust (ETHE) with $11.6 billion in assets is currently trading at an 8.17% discount. This time last year, ETHE was trading at a 59% discount to NAV. Senior Bloomberg ETF analysts Eric Balchunas and James Seyffart put the odds of a May 23 approval at only 35% but in my view, the market is giving the ETF little odds of approval by May. On a recent episode of my podcast DeFi Decoded , Seyffart said that even if the May deadline fails to yield approval, an ETH ETF is still a matter of when not if."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMihwJBVV95cUxNTjlQejROV1pRY0lWa3pWdlRjVERKd0dUOG1fU2lQZXAzSGxJbFFodTlTcU5fRHY2aWN2Ym16enpsclZfSlZKMlFSZjR2eGVTUVNDQkpTbndsd3FoblhyLW1HM3dSUXdsX1NOS3Z5WEoyR3JMTVU4SWdVblNPR2NPWnJBaVpUWGxuSnZmZ1lyUU9pdDhjV2ZOOXRFcXY3NzZzNjBXU2EyUGRQbzFTeVh4R2tfV2tLM3RBbE5iek1lOEd6bkFfSTBtaV8ycXp2SmVfNENITTJULTY1Ni0tU2tIdkNxYWYteU52YWtqWkNpRXJtVU1YNTB5dzdUeTliMWZqTUVfdG0xSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Use AWS Nitro Enclaves to build Cubist CubeSigner, a secure and highly reliable key management platform for Ethereum validators and beyond - AWS Blog",
        "content": "Validators are the fundamental building blocks of proof-of-stake (PoS) blockchain protocols like Ethereum. They maintain the history of the chain and run the consensus protocol that makes it possible to implement complex decentralized applications—from decentralized finance applications to NFT collectibles. To join the protocol, validators provide assets as collateral, which ensures they behave correctly in driving consensus. Unfortunately, because the protocol doesn’t distinguish between malicious validators and honest mistakes, operational mistakes and bugs in validator client software have and continue to put assets at risk. This results in small economic penalties in the best case scenario and total loss of funds in the worst case.\n\nIn this post, we describe the high-level architecture of a secure key management platform designed to protect Ethereum validator operators from insider threats, validator compromise, operational mistakes, and client bugs. We cover the following topics:\n\nThe challenges of running Ethereum validators and the associated security and slashing risks.\n\nThe idea of tackling these challenges using a remote key management solution and the underlying goals a key manager must be built around to meaningfully reduce risk.\n\nThe high-level design of Cubist’s CubeSigner, a secure key management platform built on top of AWS Nitro Enclaves. CubeSigner supports staking and other applications, from end-user wallets to trading to key management for teams and operations.\n\nOperational traps and pitfalls when running Ethereum validators\n\nThe Ethereum PoS protocol is a consensus protocol run across hundreds of thousands of validators. Every few seconds, validators run Ethereum transactions and, if the results of running these transactions agree with state changes proposed by a randomly chosen validator, they add these transactions to the blockchain and attest to this by signing validation messages. To incentivize validators to honestly report the state of the chain, the protocol requires them to put 32 ETH at stake. If validators behave as expected, (for example, by not manipulating transactions or lying about the state of the chain), they earn a reward on their staked assets. If they don’t, they lose some of this stake.\n\nIf validators are caught manipulating the state of the chain, they are penalized for putting the network’s safety at risk through slashing. Getting slashed means losing a significant amount of stake and being ejected from the protocol. To a lesser degree, validators are also punished if they go offline or sign very slowly, because this puts the protocol’s availability at risk.\n\nUnfortunately, validator mistakes are indistinguishable from malicious behavior. If a validator provides two conflicting reports on the state of the blockchain, it’s impossible to tell if the conflict resulted from intentional misbehavior or a bug in the validator software. As a result, operators who make security, correctness, or performance mistakes can suffer direct financial loss due to slashing. There are serious challenges in preventing each kind of mistake:\n\nSecurity – A single validator staking key typically protects 32 ETH (at the time of writing, roughly $80,000 USD). However, these valuable validator staking keys can’t be kept in cold storage because they must sign validation messages every few minutes. As a consequence, node operators have to protect hot keys from system breaches. This is especially hard considering the complex environment of open source validator clients, the operational requirements to keep nodes alive 24/7, and the potential of insider threat vectors like rogue operators and social engineering. Our goal – Create a key manager that prevents attackers or malicious insiders from stealing or misusing secret signing keys.\n\n– A single validator staking key typically protects 32 ETH (at the time of writing, roughly $80,000 USD). However, these valuable validator staking keys can’t be kept in cold storage because they must sign validation messages every few minutes. As a consequence, node operators have to protect hot keys from system breaches. This is especially hard considering the complex environment of open source validator clients, the operational requirements to keep nodes alive 24/7, and the potential of insider threat vectors like rogue operators and social engineering. Correctness – Validators that sign two different, conflicting messages are deemed dishonest and are slashed, even if the conflicting signatures were a genuine mistake. In the past, honest operators have been slashed because of buggy validator client software, errors migrating validators across machines, and mistakes updating validator software. Our goal – Create a key manager that protects operators from slashing and ensures correct behavior according to the Beacon chain protocol specifications.\n\n– Validators that sign two different, conflicting messages are deemed dishonest and are slashed, even if the conflicting signatures were a genuine mistake. In the past, honest operators have been slashed because of buggy validator client software, errors migrating validators across machines, and mistakes updating validator software. Availability – Validators that don’t sign or sign too slowly (for example, don’t respond with the 12-second slot time) get reduced financial rewards or don’t get paid at all. As a result, node operators design their solutions to be highly available and reliable, and to respond with low latency (typically setting an upper bound of 500 milliseconds for signing). Our goal – Create a key manager that helps operators achieve these latency, reliability, and availability goals.\n\n– Validators that don’t sign or sign too slowly (for example, don’t respond with the 12-second slot time) get reduced financial rewards or don’t get paid at all. As a result, node operators design their solutions to be highly available and reliable, and to respond with low latency (typically setting an upper bound of 500 milliseconds for signing).\n\nRemote signing reduces risk due to bugs and operational mistakes\n\nTo participate in the Ethereum PoS Beacon chain, node operators use a validator client like Lighthouse or Prysm. The validator client contains any number of validator key pairs. Each pair corresponds to a validator: the public key is the validator’s identity, and the secret key is what the validator client uses to sign messages on behalf of the validator. The validator client then broadcasts these signed messages to the Beacon chain network, essentially asserting the validator’s view of the state of the chain.\n\nValidator clients can store validator keys on their machines and sign locally, or they can use a remote signer. A remote signer stores keys remotely and exposes a signing API to the validator client. At each epoch, the validator client makes a signing request to the remote signer, and the signer sends back a signed validation message. Although network latency makes remote signing slower than local signing due to the additional network round trip, operators use remote signers for many reasons, including:\n\nSecurity – By using a remote signer, the validator keys can be isolated from: The validator client – This interfaces with the untrusted world—other Beacon chain nodes—and runs untrusted Ethereum Virtual Machine (EVM) code. Insider threats – These include the operators keeping the nodes up and running, who don’t need access to the validator secret keys to do their jobs.\n\n– By using a remote signer, the validator keys can be isolated from: Correctness – Using a remote signer makes it possible to implement a reference monitor—by coupling the signer with an anti-slashing database—that ensures that a key never signs messages that could result in slashing\n\n– Using a remote signer makes it possible to implement a reference monitor—by coupling the signer with an anti-slashing database—that ensures that a key never signs messages that could result in slashing Availability – Using a remote signer that handles all validator keys makes it possible for node operators to automatically scale the validator clients and spin up new ones when they crash\n\nThe remote signer must be designed with these properties in mind—simply using an off-the-shelf signer like Web3Signer doesn’t give you these properties. For example, the remote signer must restrict who has access to keys—this means restricting access to only authorized users (and validator clients) and sealing the keys to the signer itself—and what they can do with the keys. Otherwise, a breach or insider threat can turn into key theft. The remote signer must itself be highly available and fault-tolerant, and it must use a global, highly available, anti-slashing database; otherwise, signer or OS updates, machine failures, or network interruptions could result in slashing events. Finally, although the remote signer doesn’t need to be as fast as local (unsafe) signing, the latency of the remote signer does matter: if it’s too slow (typically anything over a second), the validator will be late signing messages and lose the operator money.\n\nIn the following sections, we explain in detail how we achieved the goal of security, correctness, and availability by implementing our Nitro Enclaves-based CubeSigner remote signing solution.\n\nCubist CubeSigner – Architecture overview\n\nTo address the correctness, security, and performance and reliability challenges from the previous section, we built CubeSigner, a new remote signing service that builds on AWS Key Management Service (AWS KMS), Amazon DynamoDB, and Nitro Enclaves.\n\nAt a high level, to process a validation message from a validator client, the signer completes the following steps:\n\nAccept the validation message via an HTTP interface based on Amazon API Gateway. Checks if that message is slashable using a signing history stored in DynamoDB. Signs the message—as long as it’s non-slashable—using keys secured by AWS KMS and Nitro Enclaves.\n\nThe following diagram illustrates the solution architecture.\n\nIn the following sections, we walk through these three steps in detail.\n\nAuthenticated, high-level signing API\n\nThe signer needs to expose an API that validator clients like Lighthouse and Prysm can use out of the box. Unlike the AWS KMS API, which exposes a simple but low-level signing endpoint, this API must handle high-level validator messages specific to the Ethereum Beacon chain. This high-level API is essential because it can enforce an anti-slashing policy on validator messages based on their contents. If the API instead ingested and signed raw hashes of messages, it would have no way to determine whether a given message was slashable.\n\nIn addition to preventing slashing, this high-level API also needs to ensure that validation requests are from authenticated validator clients—otherwise, compromising a single client would mean compromising all validator clients and all keys. CubeSigner goes a step further, using authentication with fine-grained scopes. A scope restricts an authenticated session so that it can only perform certain actions (for example, validation). By only giving validator clients the validation scope, node operators can prevent those validators from, for example, signing exit messages and exiting the validation protocol. This stops operators from accidentally exiting their validators, and protects them from attackers trying to exit on their behalf (costing rewards).\n\nCubeSigner uses API Gateway with AWS Lambda authorizers to implement a custom authorization scheme that determines the caller’s identity. Each authorized signing request is then sent to CubeSigner’s Amazon Elastic Compute Cloud (Amazon EC2) instances, which first check that the authorized scopes allow the request. Then, the signer computes the message signing root hash, applies the anti-slashing policy to ensure that signing the message (hash) won’t result in a slashable offense, and signs it, returning the signature back to the validator client. Next, we discuss anti-slashing and signing itself.\n\nAnti-slashing\n\nCubeSigner implements anti-slashing in the second tier—the policy engine. After authorizing a signing request, CubeSigner applies several policies, including built-in anti-slashing for Ethereum. The anti-slashing policy follows EIP-3076 and ensures that a validator never signs messages that would disagree with the chain history that the validator has already committed to, which means that the policy requires a saving state. CubeSigner enforces this policy using DynamoDB as its database. It atomically and conditionally records the messages it signs for every validator key, ensuring, for example, that the signer only produces a single signature for any particular slot number.\n\nDynamoDB is a fully managed, serverless, key-value NoSQL database designed to run high-performance applications at any scale. DynamoDB offers built-in security, continuous backups, automated multi-Region replication, in-memory caching, and data import and export tools. Availability and consistent performance are particularly critical when running blockchain validators because downtime, latencies, or data inconsistencies can directly result in financial losses. Given these requirements, DynamoDB is well suited because of its consistent single-digit millisecond performance and up to 99.999% availability. For additional information on DynamoDB performance, costs, and scalability features, refer to Amazon DynamoDB features.\n\nSafe signing\n\nThe third tier is the low-level signer itself—the CubeSigner virtual hardware security module (vHSM). This tier builds on AWS KMS to sign validation messages in HSMs, where keys are safe from attackers.\n\nHSMs and AWS KMS\n\nIn security-sensitive business areas such as banking or domain certificate management, it’s common to outsource key management-related tasks (for example, key storage or signing) to HSMs. HSMs consist of purpose-built hardware that ties cryptographic secrets to physical hardware, which makes them very tough to steal. Key extractions attacks on standard HSMs, for example, require a laboratory with an electron microscope—otherwise, the HSM self-destruct circuit triggers, because it detects someone trying to steal keying material.\n\nUsing HSMs on their own is relatively difficult, however. Accessing them from within applications written in high-level languages typically requires a vendor-specific SDK, and the application itself needs to adhere to the PKCS11 API standard. AWS provides an accessible, HSM-based key management service called AWS KMS. AWS KMS is a fully managed service that lets you create and control cryptographic keys protected by HSMs classified at the FIPS 140-2 Security Level 3. Furthermore, it is accessible via the standard AWS SDK (for example, aws-sdk-kms for Rust).\n\nWhy not use AWS KMS on its own\n\nUsing AWS KMS alone is not enough to build a secure key manager for validators. The first problem is mechanical: Ethereum validators must sign using the Boneh-Lynn-Shacham (BLS) signature scheme, but HSMs don’t yet support BLS because of regulatory challenges aligning with the National Institute of Standards and Technology (NIST). HSMs primarily focus on providing cryptographic signature schemes that are more ubiquitous outside the blockchain industry, namely RSA and Elliptic Curve Digital Signature Algorithm (ECDSA). Extending support for newer signature schemes usually requires low-level firmware upgrades of the HSM itself.\n\nEven if HSMs could produce BLS signatures, we would encounter a second set of problems: latency and throughput. Ethereum node operators run hundreds to thousands of validators, all of which must sign in under roughly a second (accounting for the actual cryptographic operation and network round trip). Most HSMs aren’t optimized for batching public key cryptography operations (for example, the compound latencies in KMS for sending 100s of ECDSA signing operations would exceed the one second limit). Furthermore, HSMs are typically throughput limited (per default, AWS KMS can process 300 elliptic curve asymmetric operations per second). By combining AWS KMS HSMs with Nitro Enclaves, you can implement a vHSM that overcomes these problems while preserving security guarantees.\n\nNitro Enclaves are separate, hardened, and highly constrained virtual machines. The AWS Nitro System, which is a combination of dedicated hardware and lightweight hypervisor, provides features such as strong isolation, hardware generated entropy via the Nitro Security Module, and cryptographic attestation—allowing you to verify the enclave’s identity and that only authorized code is running in the enclave.\n\nHow CubeSigner uses Nitro Enclaves with AWS KMS\n\nThe CubeSigner vHSM implements core signature schemes like BLS in software and runs this code in Nitro Enclaves. This lets it support arbitrary signature schemes and sign orders of magnitude faster than an HSM.\n\nThe vHSM encrypts all signing keys using an AWS KMS-based key wrapping key; whenever it gets a request to sign a transaction, it pulls the encrypted signing key and the key wrapping key into the enclave, decrypts the signing key, signs the transaction, and returns it to the user. Signing in the vHSM is fast enough for validating without penalty (for example, is well under the 500ms target even accounting for network latency). This is because:\n\nSigning a message requires a single signing key decryption, and HSMs are well-optimized for symmetric cryptographic operations. AWS KMS, for example, by default runs up to 50,000 combined symmetric encrypt/decrypt operations per second.\n\nNitro Enclaves can do asymmetric cryptographic operations (for example, produce the signature) at native speeds.\n\nCubeSigner stores all encrypted signing keys—in our example, BLS validator keys, but in general keys for any signature scheme—in DynamoDB. This allows us to replicate keys, back up keys, and use DynamoDB for scale and performance.\n\nThe key wrapping keys are stored and managed using AWS KMS, with one key wrapping key per node operator. This key is sealed to the vHSM in the enclave and made inaccessible to the AWS root user, which means that no one can use or extract the key wrapping key. Sealing a KMS key to an enclave is an extremely powerful primitive. It guarantees that the vHSM is the only component that can decrypt the operator’s signing keys, which makes it possible for us to implement hardware abstractions like the HSM in software.\n\nBecause only the code in the enclave can access secret keys, keeping keys safe reduces to keeping enclave code safe. To this end, that code is has the following features:\n\nWritten in Rust – We wrote the singer in Rust because it gives us low-level control over how the code handles secrets, so we can avoid leaking secrets in memory or through side channels. Rust also makes it straightforward to use verification techniques for proving the safety of the code running in the enclave.\n\n– We wrote the singer in Rust because it gives us low-level control over how the code handles secrets, so we can avoid leaking secrets in memory or through side channels. Rust also makes it straightforward to use verification techniques for proving the safety of the code running in the enclave. Minimal – We keep dependencies in check with cargo vet, and using Rust protects us from massive runtime systems (for example, the JVM), complex just-in-time compilers (as in JavaScript engines), and their resulting huge supply chains.\n\n– We keep dependencies in check with cargo vet, and using Rust protects us from massive runtime systems (for example, the JVM), complex just-in-time compilers (as in JavaScript engines), and their resulting huge supply chains. Least privileged – The interface to the code running in the enclave is its attack surface. Our vHSM implements a tiny, well-typed interface using the vsock communication channel—unlike other signers, which simply proxy arbitrary network requests across the enclave boundary.\n\n– The interface to the code running in the enclave is its attack surface. Our vHSM implements a tiny, well-typed interface using the vsock communication channel—unlike other signers, which simply proxy arbitrary network requests across the enclave boundary. Confined – The only outbound channel from the vHSM is to AWS KMS, following a secure communication flow. For more information, refer to How AWS Nitro Enclaves uses AWS KMS. Even here, however, the signer assumes that the channel may be compromised and uses the ephemeral private and public key associated with the particular enclave to encrypt the AWS KMS result with the public key stored in the attestation document. This way, the AWS KMS result can only be decrypted and read inside the enclave where the AWS KMS decrypt call originated in the first place.\n\nConclusion\n\nIn this post, we covered the operational traps and pitfalls of running Ethereum validator nodes and, in particular, the security, correctness, and availability challenges node operators have to balance daily. Remote signing, in contrast to managing keys locally on the node, can address these challenges—but the design of the remote signer matters. To this end, we detailed the design of CubeSigner, a remote signing solution based on Nitro Enclaves, and showed how CubeSigner not only addresses the security and correctness (slashing) challenges operators face, but also how it makes it straightforward to eliminate operational costs and run highly available validator clusters.\n\nWe encourage you to sign up for a Cubist CubeSigner sandbox account, start up your Ethereum validator using an AWS Blockchain Node Runners template, and run your own Ethereum validator node.\n\nAbout the Authors\n\nFraser Brown is a co-founder and the CTO of Cubist. She is also an Assistant Professor at Carnegie Mellon University’s School of Computer Science. Her research focuses on security and program correctness, from verifying (parts of) production systems to automatically finding exploitable bugs in real codebases; for example, her tools have found many zero-day bountied bugs and CVEs in the popular Chrome and Firefox browsers.\n\nDeian Stefan is a co-founder and Chief Scientist of Cubist. He is also an Associate Professor of Computer Science and Engineering at UC San Diego. His research lies at the intersection of security and programming languages with a particular focus on building secure systems that are deployed in production. He was a co-founder of Intrinsic, a runtime security startup acquired by VMware in 2019.\n\nDavid-Paul Dornseifer is a Blockchain Development Architect at AWS. He focuses on helping customers design, develop and scale end-to-end blockchain solutions. His primary focus is on digital asset custody and key management solutions."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPVXA5U0ZaekFlSlN4MzEyclFXZEYxdjg4Q1FlbDdrQVRxbWppZVZKTnozRG11ckRyMlpNb3dpOEFCcy1Ldm5fVmVMUng1bVF6dkxQYWE2WUpRRVJCLWRWN3ZRa3FvME5TZVc0aFlzWkdFQVZBUEpiNVo1MWRfNlpwMFozcXVjQkl6b2Rmam1tZDU1UHl4VEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Over $2 million in Ethereum stolen in sophisticated phishing scheme - CryptoSlate",
        "content": "A recent phishing attack has left a crypto investor reeling from a loss of 501 ETH, valued at approximately $2 million, staked through liquid restaking protocol Ether.Fi.\n\nOn-chain data reveals that the theft occurred earlier today and involved two transactions. In one transaction, 426 ETH were siphoned, followed by another 75 ETH in a subsequent transaction. At the time of the attack, these stolen assets were valued at roughly $1.6 million and $276,000, respectively.\n\nAs a result of the theft, the wallet’s net worth plummeted by over 99.93%, leaving them with only $1,453.\n\nScam Sniffer, a Web3 security platform, identified the attack as utilizing an “IncreaseAllowance” transaction, a signature commonly associated with phishing schemes that enable attackers to access funds without the victim’s authorization.\n\nOver $100 million lost to phishing scams\n\nThis incident occurs amidst a surge in phishing scams targeting the industry this year.\n\nAccording to data provided by Scam Sniffer, $104 million was defrauded from approximately 97,000 crypto users in the initial months of this year due to phishing attacks. In January, losses amounted to $57.7 million, followed by $46.8 million in February.\n\nA breakdown of the attacks shows that Ethereum users bore the brunt, losing $78 million in assets, including ETH and ERC20 tokens.\n\nThe primary method employed by cybercriminals involved duping victims into signing malicious phishing signatures, such as “Uniswap Permit2” and “increaseAllowance,” which enabled the malicious players to gain unauthorized access to their victims’ funds.\n\n“Most of the thefts of all ERC20 tokens were due to assets being stolen as a result of signing phishing signatures such as Permit, IncreaseAllowance, and Uniswap Permit2,” Scam Sniffer explained.\n\nScam Sniffer revealed that most victims fell prey to deceptive comments on social media platforms, particularly X (formerly Twitter). The attackers often masquerade as legitimate crypto organizations to lure unsuspecting individuals to phishing sites where their digital assets are stolen."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTFBWMldnbjdiZlpRalcycTVWSXNJMTViQm5LTHpNMTY0eGRqbUtjenJESXJzT0VLSFJOczktR2EySF9vQWlFbmh6dmVycHBKWm92Xy1zMmxHUEE3RnJnR3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Dencun upgrade sparks divergent opinions from crypto execs - crypto.news",
        "content": "While Ethereum developers inch closer to shipping Dencun, some experts are unconvinced the upgrade will deliver on its promises.\n\nDays before Dencun is scheduled to deploy on Ethereum’s mainnet, two industry veterans offered differing opinions regarding the impact of this much-anticipated upgrade amid skyrocketing Ether (ETH) prices.\n\nThe hype and crypto market euphoria pushed ETH to another two-year high, as the crypto crossed $4,000 for the first time since late 2021, at the peak of the previous bull cycle.\n\nYou might also like: Ethereum hits $4k amid bullish surge, market awaits Dencun upgrade boost\n\nCore DAO, Wormhole experts on Ethereum’s upgrade\n\nEthereum developers have said that Dencun will implement expanded data availability for layer-2 solutions like Arbitrum and Optimism, allowing for improved transaction capacity at lower gas fees.\n\nCore DAO initial contributor Rich Rines said in a statement received by crypto.news that the focus on Ethereum L2 may harbor unexpected issues around liquidity and on-chain fragmentation.\n\nWhile this should enable higher TPS on the network as a whole, questions remain whether this is a long-term fix. Over-reliance on Layer 2s could lead to fractured ecosystems and liquidity, as activity trends away from the base layer. Additionally, Layer 2s may involve more trust assumptions and can have sub-optimal influence on the base layer if transactions and fees are increasingly taken off the base chain. Rich Rines, Core DAO initial contributor\n\nRines noted that observers must closely monitor Dencun’s progress after deployment, which is expected by March 13 barring unforeseen delays. The Core DAO contributor also said questions may arise about whether the upgrade’s objective was the correct goal in the first place.\n\nOn the other hand, Wormhole Foundation co-founder and CCO Robinson Burkey views Dencun optimistically and expects the upgrade to herald a massive increase in cross-chain asset transfers.\n\nThe Dencun upgrade is undeniably a positive development for the crypto space. This upgrade will really enhance Ethereum’s scalability and security, which bodes well for defi and overall interoperability. This will result in cheaper and easier asset movement and more affordable transactions on Ethereum. Robinson Burkey, Wormhole Foundation co-founder and CCO,\n\nBurkey opined that the Dencun upgrade will bolster defi usage, accessibility, and dynamism as cheaper fees should incentivize greater on-chain participation in crypto’s largest decentralized ecosystem."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPd2JCWTFsNGR3aVgtaUJITEticnFJR1FoMVQ5WGl5b3JtTzRSaGdPb2tTSzV5YmRLR1RlOXFicEY5Ui05X0hQc1RPOVI3ejBpVzZ0Nm9TWEVPd0dmN1hvb0k4VkJrY1Fzdnd3QWJSQmZhckhNUTgxelBDVl9yUG1nV2hFcTYyd2d0bTBTNGMteVFVWUNHaWliNWJR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Ethereum’s Dencun upgrade lowers layer 2 fees by as much as 98% - DLNews",
        "content": "Ethereum's Dencun upgrade cuts layer 2 fees by up to 98%.\n\nInitial adoption of the \"blobs\" transaction format under the Dencun upgrade is progressing, with key layer 2s starting to integrate this cost-saving feature.\n\nThe long-term effects of Dencun on the Ethereum mainnet's congestion and transaction fees remain uncertain, despite immediate benefits for layer 2s.\n\nEthereum’s Dencun upgrade went live yesterday, lowering fees on top layer 2 networks by as much as 98%.\n\nDencun is a series of nine different Ethereum Improvement Proposals, or EIPs. The most important is EIP-4844, which dramatically cuts the costs of interacting on layer 2 networks.\n\nAlthough it went live yesterday at 1:55 pm London time, it took some time for layer 2s to integrate Dencun, and some still have yet to implement it.\n\n“Layer 2 operators are tasked with updating their systems to accommodate the new data posting method introduced by the upgrade” Marianna Angelou, an analyst with digital asset risk-management firm Metrika, told DL News.\n\nIn the hours following the highly anticipated upgrade, only two layer 2 networks, ZkSync and Starknet, adopted the new data posting method, which uses “blobs.”\n\nBlobs present a novel transaction format for Ethereum, distinguishing between everyday user transactions on Ethereum’s main network and those initiated by layer 2 networks.\n\nThis concept can be likened to a highway system, where layer 2 networks enjoy the advantage of a dedicated lane, while the rest of the users navigate the shared main highway.\n\nAs activity increases on this digital highway, meaning more transactions occur on Ethereum, congestion can build up, leading to higher gas, or transaction, fees. Layer 2 networks, however, remain unaffected by that congestion, thanks to their exclusive access to a private lane.\n\nJoin the community to get our latest stories and updates\n\nOther top layer 2 networks such as Base, Optimism, and Arbitrum have enabled blobs on their chains as of today.\n\nThe median transaction costs for layer 2 networks Base, Optimism, Arbitrum, and ZkSync are now only $0.026, $0.027, $0.051, and $0.108.\n\nThat comes out to a reduction in transaction costs of 96%, 95%, 95%, and 65%, respectively.\n\nThe median transaction cost in USD for seven layer 2s (growthepie)\n\nThe largest reduction in cost belongs to Starknet. Just before it enabled blobs, the median transaction cost was about $1.35, and now, the median transaction cost is $0.0196 — a 98% decrease.\n\n“It’s going to make it easier and cheaper for developers to build applications that were previously too costly due to high operational expenses,” Angelou said.\n\nOne such example of this is with Overtime Markets, a sports-betting protocol on Optimism. Its founder said that if gas prices remain as low as they are after Dencun, Overtime Markets will have three times as many markets for users to bet on.\n\nBut some argue it may still be too early to make any assumptions. Some layer 2s, like Blast, have yet to enable blobs, and as more layer 2s start to use blobs, the fees could increase.\n\nAlthough blobs provide layer 2s with a dedicated lane for posting transactions, that lane could also become congested over time. As the number of layer 2s using blobs increases, they may find themselves competing for access to the same exclusive lane.\n\nWhat about the Ethereum mainnet?\n\nWhile transaction fees on layer 2s dropped significantly, transaction fees on Ethereum mainnet remain elevated.\n\nAlthough the upgrade was designed to lower transaction fees on layer 2s, it may help lower fees on Ethereum mainnet, as well.\n\n“By eliminating the need for L2s to compete for mainnet block space, we expect this upgrade to reduce demand pressures on the mainnet in the short term” Angelou said.\n\nNow that layer 2s have their own dedicated lane for transactions, it will naturally free up more room on the Ethereum mainnet.\n\nLayer 2s accounted for about 13% of transactions on Ethereum mainnet in the last 30 days.\n\nPrice history for Ether over the last 30 days\n\nIn the 30 days leading up to the upgrade, Ether rallied 44%, but since the upgrade went live, Ether is down 5.08%, falling to $3,776.\n\nGot a tip about DeFi? Reach out at ryan@dlnews.com."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNQWJjUGY4NVBWUjNsVUxkdzNNN3lQald4V3REcGNZSTRiOWNqdVFmTFUwbW00SG1udUZzNWM0ZU9GRGxLQWJBN25WWndfemlydkN0YldhdG5SU19PelJteTM1X0V6Qmh0b3RmNmhlbzNSc1dqTDR6b196XzJaX0xxSHFSaFNNZ0No0gGQAUFVX3lxTE82QUtETkI2Q245SjVVaERMMjFIa2ljMHNaTFJxR3pXME9pVVJGM3FFZDhheXMxTW9jbk9VaGZjLVp3TlVmM1dXdE01S2xfYkJOMjQwOHpsa2Q0SnhnN0NtejZxSGZad3UzQ2VqRnl6QWtDQnlLRXE3S1NYRk5MTUN6M1FQOWYyNXlMNFNDVkdINg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Upland Reveals 'Share and Build' Airdrop Drive Ahead of Ethereum Token Launch - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nUpland, a crypto game built around real-world locations, announced Friday that it has launched the first wave of its \"Share and Build\" airdrop series. It's aimed at rewarding community members and newcomers alike for engaging with the Upland platform before its Ethereum token goes live.\n\nThe first chapter will let users earn Sparklet tokens—Upland's existing in-game utility token used to construct buildings and create content—through social media activities and in-app missions over a three-week period.\n\nUsers can connect their Twitter (aka X) accounts and earn points by engaging with Upland and Sparklet content on the social media platform. Those points will then be converted to Sparklet tokens within the Upland game. The Twitter-centric airdrop farming campaign recalls similar pushes around the Portal and BlockGames tokens.\n\nLast November, the EOS-based Upland announced that it planned to launch an Ethereum token that’s tied to its in-game Sparklet token. That whitepaper describing Upland’s plans was put to a community vote, with 87% of users voting in approval of the proposal.\n\nAD\n\nAD\n\nThe token tradability event (TTE) will follow the airdrop campaign, letting users convert their in-game Sparklet currency into a tradeable Ethereum token.\n\n\"We're excited to launch the 'Share and Build' airdrop series as we are getting ready for the Sparklet event. This initiative aligns perfectly with our vision of fostering a thriving Web3 ecosystem and rewarding passionate players,\" said Dirk Lueth, co-founder and co-CEO of Upland, in a release.\n\nThis first wave of the airdrop campaign offers 10 different reward levels, with users' engagement levels and social stats on Twitter determining their point multipliers. Users of select, as-yet-unrevealed Upland partners will also receive \"point boosts\" to help them earn more.\n\nAdditionally, by completing each forthcoming airdrop chapter, participants will be rewarded a distinct Block Explorer NFT that serves as a game piece within Upland. Collecting five such rewards unlocks an exclusive NFT for use within the Upland game.\n\nAD\n\nAD\n\nUpland began life in 2019 as a property-trading game, with digital versions of real life properties tokenized and sold within the game. It has since expanded into a more robust metaverse experience with vehicles, events, and other gameplay opportunities. Upland raised $7 million in a Series A extension round last November.\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Andrew Hayward."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNSFFUQmhYZkpVbmY5SE5LY3hqTF9FT3ltY0p3SXlIS0x0bHpaOWZZRXRUTUtJRUQ1SzNpeVZfZTJaV1JYMGQ5TFRldWJ1Yjgxd0VXaUphU0hYaTZfNzc0MWxkTHFNelFZcG82Mm1keDNhUjFIUFd0aG9EU0NScW54TDFqSlRYMXJuNnFmSjRVNndfdFVxMHlPY0JxLUlDYzRxWkJIai1FcVl3T05Ea2RMV3RJMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Bee Movie Script Buzzing on Ethereum; Robinhood Benefits From ‘Monster’ Crypto Cycle - CoinDesk",
        "content": "A movie script on Ethereum and new insights on meme coins. You're watching coin desk daily. I'm your host, Jen Sasi. Developers had some fun and uploaded the script of Jerry Seinfeld's B movie on Ethereum as gas fees plunged after the latest upgrade, Ethereum D kon upgrade has significantly reduced data fees allowing for the scripts to be posted at a much lower cost than it would have been before developer Dan Clark posted on paradigm quote. I didn't get the first blob but as far as I can tell, I did get the first B movie on main net and quote. The transaction costs only about $14. Blobs are a cheap way to temporarily carry data about transactions that are now possible after Wednesday's upgrade. A report from Bernstein says that Robinhood will benefit from the monster crypto cycle. The research and brokerage firm initiated coverage of Robin Hood with an outperform rating and $30 price target. The broker expects the total crypto market cap to reach $7.5 trillion by 2025 versus 2.6 trillion today, noting that this means Robin Hood crypto revenue should grow ninefold. Bernstein expects Bitcoin's market cap to grow to $3 trillion and ether is to increase to 1.8 trillion by 2025. And according to Franklin Templeton's digital assets team meme coins exhibit a strong correlation between their price surges and the growth of user wallets on the underlying blockchains. Despite lacking inherent value propositions, the traditional finance giant added in a report that such tokens may provide investors with opportunities to make quick price profits and have gained virality in the past year due to their unique nature. The report found active addresses on various Blockchain networks grew in tandem with a surge in meme coin trading activity on those specific chains. That's it for coin desk daily, get more updates on coindesk.com and we'll see you next time."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxNTzBwYzlDcXZEam16dG1RUVRjbjA5UFRHR0drT3dVU0c0TXVhVEFkZzZRbEFlMmYzc04tUXNNdFFRS3FUU2N5RHg5enFYTk5NOWlJVTd6cnpBRjBrSGVXdzEzUXVtdUo5dW1hVFZoV3g2RlU4a1ZEbHloNHgtbUJxOFZDcjNZWmxhUUZSekhWUGJsVnpTVng2NEo0ekhuQWFIbnVoREhQdVFRajhidHRMUUlEM28xVnVIY3VTdUVLZXZEOXc2N1lCdlBNTkIwa2hkX0g2SUJn0gHbAUFVX3lxTE5xU0ZqTkdKeThub2xxSnpWNTNHSHVoYlpTTG9YUEZpbEdJcVl5SW5Dd1NtdVFsVjlVcldIclFrYTJLZERTeG5XaFdRNkZjczNubGtBLS12bGRsaXpPMTQ1R1h1aV9WWlgzQWFjZWFURXVJX3hlRUlOQ3NjTER5TzBWMjltdGNaQWstMWNFSi0tdVFQaGlZendaWmREMDNENl9IeU9yakFqS0ozclh4NDl0bmhYSm82UUtES3NjdGt4Sm9Xc2pzZmVVRDByZU02Zm5zOFNLWWRmWXZtYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Developers Upload Script of Jerry Seinfeld’s ‘Bee Movie’ on Ethereum as Gas Fees Plunge After Dencun - CoinDesk",
        "content": "“I didn’t get the first blob, but as far as I can tell, I DID get the first BEE MOVIE on mainnet,” posted Paradigm developer Dan Cline on Wednesday, shortly after the new blobs feature went live. The transaction cost only about $14."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOWFpGLTI5Q0lfSV9qMkJ5eXJ4d3lLRVJYalVqdnp3MzN1eFFnZTByS2lUVVhUM0JvNW9abHlCS1AxMDlQUVVyQUd6dTNBUU44cmJ1ZVlGT2RfbHR2WlFpSno1OE1EaFhEeEY5Z1pGamZtNWo3UW5PWU1CWHlqRG16MHFLeG5uTmNEekFkTkFDVlBWVjRLcUZQTUppb1hYdXlBdG9zeVgzQlg5Mk9TUmNlZGlLd9IBuAFBVV95cUxORE10ZEdLS0djNVJrbmdwek43cE5NdnZGLUhhaGN1U2FGcGtsV0ZSWmk4bUpJcEtvOURKbmM1VG9kSFdlcFpDYzBRd3NabW45YjEzVGx5aXpNNlBmWHVCN3JLYUlSX0ljQURUanE2dHFVRkJFZXBGYWVDSFpEdVhTcDBqNHJPMFZTMWszc3MwYWR4bG1JMXhFNldqY2V6MDUwTmo3WXJFdTd5VW53NmhrTk5BbGpYbVpU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Here’s How Low ETH Can Go if $3.5K Fails to Hold Selling Pressure (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum has recently breached a significant resistance level, crossing the psychological milestone of $4K and achieving a new high for the year.\n\nHowever, this breakthrough was met with resistance, leading to a noticeable correction. The question that arises now is whether this correction is merely a temporary setback or the beginning of a broader reversal in the bullish trend.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA thorough analysis of the daily chart indicates a prevailing bullish sentiment surrounding Ethereum, evident in a strong and sudden upward surge that surpassed the critical resistance at $4K. This surge reflects heightened interest from market participants in Ethereum, resulting in increased volatility.\n\nHowever, after briefly surpassing the crucial $4K resistance level, the price encountered intensified selling pressure, likely due to profit-taking among participants, leading to a significant decline toward the substantial support zone of around $3.5K. It seems likely that the market will find support in this region and initiate a fresh rally.\n\nHowever, in the event of a continued corrective retracement, Ethereum’s price is expected to find support around key levels within the Fibonacci retracement, specifically between the 0.5 ($3,181) and 0.618 ($2,966) levels.\n\nThe 4-Hour Chart\n\nFurther examination of the 4-hour chart confirms the presence of buyers in the Ethereum market, propelling the price to its highest level since April 2022. This surge, accompanied by increased market volatility, demonstrates significant buying interest aimed at surpassing the previous all-time high of $4.8K.\n\nHowever, following the breakthrough above the critical $4K resistance level, the price faced rejection, leading to a sharp decline aiming for the key support zones around $3.5K and $3.3K. Additionally, an expanding bearish divergence between the price and the RSI indicator suggests the potential for a notable market correction.\n\nNevertheless, it is important to recognize that healthy bullish markets often experience periods of consolidation correction, allowing the asset to rest and rebuild demand. Therefore, it seems likely that the price will find support in the medium term, continuing its overall upward trend.\n\nOn-chain Analysis\n\nBy Shayan\n\nEthereum’s price has surged rapidly in recent weeks, briefly surpassing its previous all-time high of $4,000. This surge has attracted numerous speculators to the market, driving up buying pressure and instilling confidence among investors.\n\nThe accompanying chart illustrates the open interest, a valuable metric for assessing sentiment in the futures market. Open interest quantifies the number of outstanding perpetual futures contracts across various crypto exchanges.\n\nIt’s evident that the open interest has soared alongside the recent bullish trend, reaching unprecedented levels. This surge indicates the intensity of both long and short positions in the perpetual futures market, resulting in an overheated environment.\n\nWhile elevated open interest is typical in a robust bull market, it can also contribute to heightened volatility and unexpected market corrections. As such, it’s prudent for investors to carefully manage their risk in the short term."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOLUxnUUg0ZklTem5meXd0bndvcjFHVUxBdXRDV081enVaMFNKMWtKcnZ5VElqNmNaLUZZR0tfOC1NYU03OEhkc0dzZ1FrV05nUEVlTk16WU9aVi1VajFUS242NkVnV0Facl82em9PSkpkWmJhdEZoTUliMUJDdnpZc1daakY0cVpPMmJxc00zMjZVMjY0OHpSakZoVHLSAaIBQVVfeXFMTjRpNHlseVZsNjl3QVI5c1ZpNzM2anpDRmpmZGpHbnVJQnkzUWZMT2ZvTXMxZG5zdXBoZWI1TUVSblFtWlBESjdCV1R5dmx0dHNQQ0pHeml2cS0zajlGYWFDNTVGZ0ljRFRHVC14ZW9GY1pPMnZuZ2x2ZEp0VHZvRXVicGh1TmU1bG56OHdnZ2dxWU92SU8tNUs5dXhMOUFEdlRB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Drops 7.8% A Day After Dencun Upgrade, What’s the Next Support? - CoinGape",
        "content": "Following the successful implementation of the Dencun upgrade, Ethereum has encountered significant selling pressure. As of the latest update, the Ethereum (ETH) price has declined by 7.8%, trading at $3,669 with a market capitalization of nearly $450 billion. Additionally, Ethereum’s daily trading volume has surged by 45% to $32.29 billion\n\nEthereum (ETH) Price Levels to Watch Ahead\n\nThe Ethereum price faced resistance at the $4,000 level and initiated a downward correction, mirroring Bitcoin’s movement. ETH dipped below crucial support levels at $3,920 and $3,850, signaling a short-term bearish trend.\n\nadvertisement\n\nIt briefly dropped below the $3,680 support area, reaching a low of $3,625 before consolidating losses. Currently, a significant bearish trend line is forming with resistance around $3,850. The primary resistance levels are near $3,850 and the trend line, close to the 50% Fibonacci retracement level from the recent swing high at $4,083 to the low of $3,625.\n\nIf the Ethereum (ETH) price surpasses the $3,880 resistance, it may regain bullish momentum, aiming for the $4,000 level. Conversely, failure to break above $3,850 could lead to further downside movement. Initial support is at $3,680, followed by a major support zone near $3,600, with a potential downside target at $3,500. A decisive break below $3,500 might trigger a decline toward $3,350.\n\nPopular crypto analyst CrediBULL Crypto explained that the range of $3600-$3700 for Ethereum is likely to attract significant buying interest in the short term.\n\nFurthermore, blockchain analytics firm Elliptic uncovered a substantial transaction involving $12 million worth of Ether by the Lazarus Group. This transfer was facilitated through Tornado Cash, a cryptocurrency mixer. Despite being subject to sanctions, the North Korean hacker organization has resumed its use of this platform.\n\nThe funds are traced back to a cyber-attack on HTX and the Heco Bridge in November, orchestrated by the Lazarus group. This attack resulted in significant losses amounting to $100 million for the affected platforms.\n\nETH Gas Fee Drops Under $10\n\nAccording to Santiment, an on-chain data provider, the current scenario of Ethereum surpassing a $4,000 market value differs from October and November 2021. Today, the network’s transaction costs are significantly lower, standing at less than 1/6th of the previous levels. With gas fees averaging $9.35, this improvement can be attributed in part to the enhancements in network fees following the transition to Ethereum 2.0.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNZFFkYlBRUE94UlZxb2JWdzJTTkZVeS1EV3pqSVlsZXFWdVdMTk1qUVZxNGxoa1cxV3gtYTduU0NHcVBFZl9waEZsZ0F1LUgxakx5VDlJTXI3OUF3RUZRX081anZmNmpYT0w5ZUNjN0kzV3lKdmFkX3hoNEpNYWpEckRMYzZ4S3lpN1p5QjNJUnczX1NObWfSAZsBQVVfeXFMT2NIa0NmdFZhbFoxTlhsS0ZwUE5PWnFfN0xHeHVrN1BhejI5RDZUX0dpb3JMYXd6U1RTZlh1UDFRMVhvNHhtU2ZTSDN1ZFZNWHFuazBfQ3d2a3g5ZldGMkZ4OTZERnoxYkpaNVVYM3U3dlpfRjdNMnd0WGc2T1BySG1kamxyai1wRk45UDJlbmtSeFR6Z0FTSk9QUUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Here’s Why VanEck Thinks Ethereum ETFs Could Outpace Bitcoin Funds - CryptoPotato",
        "content": "American investment management firm VanEck thinks spot Ethereum exchange-traded funds (ETFs) could become bigger than similar Bitcoin products after the United States Securities and Exchange Commission (SEC) eventually approves them in the coming months.\n\nIn a recent interview, Pranav Kanade, portfolio manager of VanEck, one of the issuers of the spot Bitcoin ETFs launched in January, said Ethereum ETFs could attract more demand as they have a market size as big, if not bigger, than Bitcoin ETFs.\n\nEthereum ETFs Could Surpass Bitcoin ETFs\n\nKanade’s belief contrasts with some crypto community members, who think Ethereum ETFs will not make much sense as the products may not allow staking reward distribution. Recall that Ethereum transitioned into a Proof-of-Stake protocol in 2022. Ether (ETH) holders can earn diverse yields by staking their assets on the blockchain.\n\nMarket analysts believe crypto investors should buy and stake their own ETH rather than invest in the ETFs. However, Kanade insists otherwise.\n\n“The world of investors who are looking for cash producing assets is massive and ETH obviously generates fees that goes to the token holders. Even if you don’t have an ETF that can offer staking as a part of it, it’s still a cash producing asset, so I think ETH could make more sense as an asset to more people than Bitcoin does,” he stated.\n\nWhile the VanEck portfolio manager thinks Ethereum ETFs could surpass Bitcoin funds, he sees such a feat as a huge task, considering the inflows exceeding $11 billion that the spot Bitcoin ETFs have seen within two months of their launch.\n\nOdds of SEC Ethereum ETF Approval at 50%\n\nIn addition to Kanade’s controversial belief that Ethereum ETFs will outpace Bitcoin funds, he placed the odds of the SEC approving the former at 50%, contrary to Bloomberg analysts’ 30% prediction.\n\nConsidering that the SEC was legally forced to approve the spot Bitcoin ETFs, courtesy of the Grayscale court ruling, it seems unlikely that the agency is eager to greenlight similar products for Ethereum.\n\nNevertheless, agency commissioner Hester Pierce, popularly known as Crypto Mom, believes the regulator would not need a lawsuit or court order to approve pending applications for Ethereum ETFs.\n\nMeanwhile, VanEck recently reduced the management fee for its Bitcoin ETF, HODL, from 0.2% to 0% to lure more investors to the product. The current fee will stay until March 2025 or until HODL amasses $1.5 billion in assets under management."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQR3hTbEpiaTNPcC15TWZmV0VTdFVNaHotTk41d0Etb1FmMlJ0WFNMWjhscmRnX042dkt6azdnYnRzbC0tcjgwZVA4TjZkdmplM001aV82U1Q2Q1pCNUVPSUtnT2VqLUdTQXZ3d1F2Q0ZsZG1MZFM4X0JGbWlfbWFxMmp6bDVKVW9vcnFBZEJ6eUQ4RTBpVkZHeDVQMzhLYldqUGtTUG9QV3loVFZTaTJ4MDkyM3Q?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Layer-2s See Massive Drop in Transaction Fees After Dencun Upgrade - The Crypto Basic",
        "content": "The recently launched Dencun upgrade live up to expectations as Ethereum L2 networks, like Optimism and Base, record massive plunge in transaction fees.\n\nFollowing the implementation of the Dencun upgrade, Layer-2 (L2) scaling solutions on Ethereum have recorded a significant decrease in their average transaction fees.\n\nDencun Upgrade Rolls Out\n\nRecall that the highly anticipated Dencun upgrade went live on the Ethereum mainnet yesterday, March 13, at precisely 13:55 (UTC).\n\n- Advertisement -\n\nDencun, which represents the most significant upgrade on Ethereum since the “Merge,” introduced a mechanism to reduce transaction costs on L2 networks.\n\nWith Dencun implemented on the Ethereum mainnet, L2 networks found a new way to store data, dubbed Binary Large Objects (blobs).\n\nThe blob feature allows L2 networks to store data off-chain, which becomes inaccessible after three weeks, rather than the expensive “call data” solution that stores data permanently.\n\nL2 Networks Transaction Fees Drop\n\nSince the Dencun upgrade went live yesterday, it has been living up to expectations as top L2 networks, like Base, Optimism, and zkSync, have seen a sharp drop in their transaction fees.\n\nRecent data from Marcov’s Dune-based tracker highlight the significant drop in transaction fees across major Ethereum-based L2 networks.\n\n- Advertisement -\n\nFor instance, the average transaction fee on Optimism, which stood at around $2.44 an hour before Dencun launched, has plunged to $0.068 at press time. Similarly, the average cost of transaction on Coinbase’s Layer-2 Base has also plummeted to $0.196 from $1.212 within the same timeframe.\n\nAdditionally, zkSync’s average fee has dropped to $0.162 from a daily high of $0.546, while Zora network’s transaction cost also fell from $0.752 to $0.003.\n\nIt bears mentioning that the reduced transaction fee trend is dominant across L2 networks that have implemented blobs.\n\nThe average transaction costs on L2 networks that are yet to implement the upgrade have remained the same. For instance, Arbitrum falls within this category, as its average transaction cost has fluctuated between $0.65 to $0.84 over the past 24 hours.\n\nHowever, the high fee on Arbitrum would soon be a thing of the past, as the team behind the network plans to integrate with Dencun improvements today.\n\nBlobs are finally on Ethereum, here's an update on Arbitrum support! 1⃣ Tomorrow, all Arbitrum rollup chains can start to see lower fees as a result of Dencun x ArbOS Atlas upgrade. 2⃣ March 18th there will be additional fee reductions for Arbitrum One, as per ArbOS Atlas. — Arbitrum (💙,🧡) (@arbitrum) March 13, 2024"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOeWNCTlRzb3NrdXVpNEY1Y3hIY1ExcUlaelhGNUNFRDFZRnQ3TXZqTWNKc3NSOUdFQ2ZoUDlIVW02SUxJdVBjTnRJeUJSa3c5QzJyREN4SFVYQllXWjB2S0ZXU2kzRHR0QlJPaDZDbUo2aUhEei1IWlFTUUk0MWhhWnNnUkluZkEtdGtoaDJYU0xtM2M2Zkl0MjJuck5rQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Magic Eden (MAGIC) Launches Retroactive NFT Rewards for Ethereum Users - Blockchain News",
        "content": "Magic Eden (MAGIC) Launches Retroactive NFT Rewards for Ethereum Users Luisa Crawford Magic Eden introduces a cross-chain rewards program, offering Diamonds to Ethereum users for past activities.\n\nMagic Eden, a prominent player in the NFT marketplace, has unveiled a significant cross-chain rewards program. This initiative targets 'Ethereum OGs', enabling them to claim rewards for their NFT-related activities dating back to 2017. The program allocates 'Diamonds', a form of reward points, to users based on several criteria, including transaction volume, the timing of transactions, and the platforms where these transactions occurred. Additional weight is given for royalties.\n\nThe announcement came via a series of tweets from Magic Eden's official Twitter account. In the final tweet of the thread, Magic Eden cautioned users against potential impersonators and emphasized that no links had been shared within the thread, ensuring users only follow official sources for participation in the rewards program.\n\nEngagement with the Ethereum Community\n\nMagic Eden's campaign to reward past activities signals a strategic outreach to one of the most robust communities in the crypto space. By recognizing the contributions and engagement of Ethereum users within the NFT ecosystem, Magic Eden aims to foster stronger ties and encourage the transition of these users to its platform.\n\nBeware of Impersonators\n\nIn the nascent world of cryptocurrencies and NFTs, the threat from impersonators and scammers is ever-present. Magic Eden's explicit warning highlights the importance of vigilance within the community. Users are advised to only interact with verified channels and official websites when participating in such programs.\n\nConnecting Wallets and Claiming Rewards\n\nTo partake in the rewards program, users are instructed to connect their Ethereum wallets to the Magic Eden platform. The process for claiming 'Diamonds' is streamlined to encourage participation, though the exact mechanics and the value of these rewards in terms of real-world utility or monetary equivalence have not been disclosed.\n\nCommunity Reactions\n\nThe response from the community has been mixed. Some users have expressed dissatisfaction with the perceived value of the rewards in relation to their past contributions. Others have queried about technical aspects of the program, such as connecting wallets from different chains.\n\nMagic Eden's introduction of a retroactive rewards program underscores the evolving landscape of user incentives in the blockchain space. As NFT platforms continue to innovate in their pursuit of user acquisition and retention, the impact of such programs on user loyalty and platform growth remains to be seen.\n\nConclusion\n\nMagic Eden's initiative demonstrates an effort to bridge communities and reward user loyalty. However, the success of this program will depend on the perceived value of 'Diamonds' and the platform's ability to engage the Ethereum community effectively. As the NFT marketplace evolves, such innovative approaches to community engagement may set new precedents for the industry.\n\nImage source: Shutterstock"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOTDBoeHJ3RldXN2tfZGxzMjdhWk1xWVNEZlcyU29BaUFxSGdMVnRXenBCcmItU256UWpvRk8zWkdFd1o3YzVNQWpydkZ0T2lGMmd0SGFzVlZjN1Fua3paQ0hkd1gzNHZhTGl0S1d3VHI5M0RYYkVDZF8tN2tPYmQyTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Upland unveils “Share and Build” Airdrop ahead of $SPARKLET token launch on Ethereum - The Cryptonomist",
        "content": "Upland has announced its Airdrop “Share and Build” program in anticipation of the launch of its token on Ethereum. The cryptocurrency game is gearing up for the debut of the Sparklet token and is offering rewards to users through game missions and social media interactions.\n\nLet’s see below all the details.\n\nUpland Airdrop Strategy: Launching the Ethereum Token\n\nAs anticipated, Upland, a game of cryptocurrencies based on real-world locations around the world, announced on Friday the launch of the first phase of the “Share and Build” airdrop series.\n\nThe goal is to reward both existing community members and new users who engage with the Upland platform before the launch of its token on Ethereum.\n\nThe first chapter of the series will allow users to earn Sparklet tokens, used within the game to build buildings and create content, by participating in activities on social media and missions within the application for a period of three weeks.\n\nLast November, Upland, based on EOS, announced plans to launch an Ethereum token linked to the Sparklet game token.\n\nThe whitepaper detailing these plans has been submitted to the community vote, with 87% of users voting in favor of the proposal.\n\nThe token commercialization event (TTE) will follow the airdrop campaign, allowing users to convert the in-game Sparklet currency into a tradable Ethereum token.\n\nAirdrop and NFT: expanding the gaming experience in the metaverse\n\nDirk Lueth, co-founder and co-CEO of Upland, stated the following:\n\n“We are excited to launch the ‘Share and Build’ airdrop series as we prepare for the Sparklet event. This initiative aligns perfectly with our vision to promote a thriving Web3 ecosystem and reward passionate players.”\n\nThe first phase of the launch campaign offers 10 different reward levels, with user engagement levels and social statistics on Twitter determining their point multipliers.\n\nFurthermore, selected Upland partner users will receive “point boosts” to increase their earnings.\n\nIn addition, each completed chapter of the airdrop will guarantee participants a unique NFT Block Explorer, which will serve as a gaming element within Upland.\n\nBy accumulating five of these awards, you will gain access to an exclusive NFT to use in the world of Upland.\n\nWe remind you that Upland originated in 2019 as a property trading game, with digital versions of real assets tokenized and sold within the game.\n\nOver time, it has evolved into a solid metaverse, offering vehicles, events, and other gaming opportunities. Last November, Upland raised $7 million in a Series A extension round.\n\nRevenues for Upland players in 2023 and more\n\nUpland has generated approximately $13.5 million in revenue for players in 2023, establishing itself as a growing digital economy and an economic hub in the Web3.\n\nRevenues are withdrawn in USD via PayPal in collaboration with Tilia, a payment solution offered by Second Life, another Metaverse platform. Additionally, players can withdraw their funds using Upland’s native UPX.\n\nThe co-CEO and co-founder of Upland, Dirk Lueth, shared this information in a press release with NFTgators, stating:\n\n“The platform has over 3 million registered users with active participation, turning Upland into an immersive digital economy.”\n\nPlaying and selling virtual properties on Upland has allowed uplanders to make millions in profits, while the platform has formed partnerships with entities such as FIFA, UNICEF Brazil, and Susan G. Komen.\n\nUpland emerges as a symbol of the power of GamiFi, true ownership, and engaging digital economy.\n\nFurthermore, Upland has announced progress in the ecosystem of user-generated content (UGC), open to all individuals.\n\nThe platform offers players the opportunity to verify the size of the property and the potential to adapt to different structures, welcoming valuable user feedback.\n\nThe video of the roadmap for the first quarter of 2024, published on January 10, 2024, reveals that Upland will focus on automotive transportation, car races, Sparklet, and renewed seasons."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNanhMMGZfZGt4MXo0bnJNdi1SS0VuUEo0Z0hqdUtLVF9kWnZDRUdTaFd5TGpUQXV0U3JYTnh6aTNaZ2VHMUpIUnF6M3g0dUtLV21EQzJycGY4MXVUSnREeVZETWZveVhNa2kwUFRxSE01UHpWU1JNdDFhRTU3elFpMEE3VTlVbkJ5RHVHY1pKbENoTW5DNzg5dkJqMG94WE1qbjZZMFVwNDBqOWvSAbABQVVfeXFMTzdnVXc1SFN1bmFqSXBSWlM3bFc1R2dZTFkwdzFsUUhVZDVIcE96QW9IcW05bGNTc0RqeENyUllRM0IzYk5hZ3NIUTFnRU1EQlVBeUVTWG5fQVdJWFJyTkFaQU9MYzNmYjF3N2ZTdC1HaVNBelNGVmxIV1pCVkg0SUdCQlUxTG1QVkJ4akRCMWhvUFBLQS1ZVDJ2WHQ2a1Q4M19wTVhaOXItUEdqRDYxNXY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction As ETH Dives Below $4,000, Time To Sell Or Buy The Dip? - CoinGape",
        "content": "Ethereum price prediction threatens a major tailspin after the successful mainnet launch of the Dencun Upgrade. The second-largest cryptocurrency briefly climbed to $4,087, testing its recent highs ($4,087) on Wednesday before sliding below the previous day’s open of $4,008.\n\nTrading at $3,955 on Wednesday, ETH price has sustained a 2.5% drop in the last 24 hours. Its trading volume is down 20% in the same period, hinting at declining interest among traders.\n\nadvertisement\n\nWith a market cap of $477 billion, Ethereum comfortably sits in the second position below Bitcoin’s $1.4 trillion cap.\n\nEthereum Price Prediction: What’s Next After Dencun Upgrade\n\nEthereum finalized the Dencun upgrade on the mainnet following three successful testnet launches. The landmark upgrade goes beyond introducing new features, it stands out for reducing fees on layer 2 protocols like Arbitrum — and is expected to spur growth.\n\nAs reported, “blobs” another key feature of the upgrade, brings to life a new locale to store data on the blockchain. This special space is isolated from standard transactions, attracting lower costs.\n\nThe Dencun upgrade, is the biggest protocol improvement in a year, with Ethereum expected to significantly change the scaling landscape where layer 2 protocols will benefit the most.\n\nLayer 2 networks are preparing to incorporate “blobs” in their operations — a move likely to spark a pricing war. Arbitrum announced on X that it was ready to jump on the new data storage space in less than 24 hours.\n\nThe blobs have arrived on Ethereum! 🐡 The Dencun upgrade has successfully launched on Ethereum mainnet making it one of the biggest upgrades to support Layer 2’s in scaling Ethereum. Now with the Ethereum mainnet upgrade complete, we expect the ArbOS Atlas upgrade to be… — Arbitrum (💙,🧡) (@arbitrum) March 13, 2024\n\nContrary to expectations, the Dencun upgrade was not a significant market mover. If anything, sell-side pressure quickly erased the move to the recent highs around $4,093.\n\nBased on the four-hour chart, Ethereum price has flipped below the important $4,000 level as well as the 20-day Exponential Moving Average (EMA).\n\nA neutral and downward-slopping Relative Strength Index (RSI) backs the correction as ETH searches for fresh liquidity.\n\nSeveral four-hour candle closes below $4,000 might accelerate the pullback. With the next major support at the 50-day EMA, investors should prepare for instability below $3,900.\n\nFor investors looking to capitalize on the retracement to maximize returns in the bull market, there is no need to fret as Ethereum price will stay bullish as long as it holds above the Ichimoku cloud levels.\n\nThe black line on the chart backs the uptrend as long as it is respected as support. In that case, a carefully executed dollar-cost average strategy would give traders many opportunities to buy the dip thus eventually contributing to new momentum above $4,000.\n\nA good place to start buying ETH is the short-term support at $3,950. However, if the decline continues below $3,900, the 50-day EMA (the line in red on the chart) might ignite a new bullish fire toward all-time highs.\n\nEthereum might run into considerable congestion in the range between $3,963 and $4,083. About 1.64 million wallets bought ETH at an average cost of $4,027, implying that they may want to sell at their respective breakeven levels, damping the uptrend.\n\nThe IOMAP model developed by IntoTheBlock points to robust support between $3,605 and $3,725. With approximately 835k addresses buying 4.11 million Ether in the range at an average price of $3,679, traders have a rough idea of how far down they can DCA if ETH price continues to fall.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxONE5paDVvdm5scDQwamJObGEtd2dZU19TQWh6YU9hOTQtVmY2UFhZaWswa200MGtVQ0lna0lnbW9wVEZjd3dNNGt5ZGJ6NF9JaTdEaDRQUzlqMmxJR05iMGZRblVXRFA0b2JjcVpqV05GRGJIUm9odktIdjU2RTl2WFl5SVJWcGdFbEpyZmw0aTNqNWZ1NTZQUjZJd3ZKUHhleGhhakk1LUlZX1FENm1pSzBxQlpvZE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Announces Ethereum's Upcoming Milestones: Verkle Trees and History Expiry - Blockchain.News",
        "content": "Vitalik Buterin Announces Ethereum's Upcoming Milestones: Verkle Trees and History Expiry Rebeca Moen Ethereum's network takes a major leap in scalability with the completion of the \"Basic rollup scaling\" milestone, paving the way for verkle trees and history expiry.\n\nThe Ethereum network has reached a critical milestone in its scalability roadmap with the successful implementation of \"Basic rollup scaling,\" according to an post by Vitalik Buterin on Warpcast. This development is a key component in Ethereum's transition to a more scalable and efficient blockchain, which is essential for its long-term success and adoption.\n\nWhat Comes Next?\n\nFollowing this milestone, the Ethereum development community is setting its sights on the integration of verkle trees and history expiry. Verkle trees are an evolution of Merkle trees that will enable more efficient and compact proofs, reducing the amount of data validators need to store. History expiry is a concept that will allow old transaction data to be removed, thereby reducing the \"state bloat\" and making it easier for users to run full nodes.\n\nIntroducing \"Basic Rollup Scaling\"\n\nRollups are solutions that execute transactions outside the main Ethereum chain (Layer 1) and post transaction data back to it. This \"Basic rollup scaling\" is the foundation that allows for increased throughput on the network while maintaining security by leveraging the main chain for data availability and consensus.\n\nThe Promise of Verkle Trees\n\nLooking ahead, the Ethereum development team is focusing on the integration of verkle trees. Verkle trees are a proposed upgrade to the existing Merkle trees, which are data structures that enable the secure and efficient verification of content in a blockchain. Verkle trees will optimize storage and computational efficiency, significantly reducing the size of proofs and making it easier to run an Ethereum node.\n\nUnderstanding History Expiry\n\nAnother forthcoming feature is history expiry, a mechanism that will allow the Ethereum network to shed older historical data, thus preventing excessive growth of blockchain data size. This will alleviate the burden on nodes, ensuring that the requirement for storage space does not become a barrier for validators and full node operators, which in turn contributes to the decentralization and robustness of the network.\n\nCommunity Reactions and Expectations\n\nThe announcement received a positive response from the Ethereum community, with many expressing excitement and support for the progress. Vitalik's update on Warpcast garnered 1728 reactions and various comments from key players in the Ethereum ecosystem. Brian, from @br1an.eth, extended an invitation to discuss the update on the @unlonely platform, indicating a strong interest in the implications of this development.\n\nThe Future of Layer 2 Scaling Solutions\n\nQuestions about the timeline for Layer 2 solutions adopting new features like blobs, a form of data storage that could further reduce fees, were raised by community members such as Hugo Montenegro (@hmheck). The anticipation for more affordable transaction costs was palpable, with users like Pacheco (@pachec0) expressing concerns over the current fee structure.\n\nConclusion\n\nThe Ethereum network's latest accomplishment in achieving the \"Basic rollup scaling\" milestone has generated enthusiasm among stakeholders and users alike. As the community looks forward to the implementation of verkle trees and history expiry, the path towards a more scalable and user-friendly Ethereum continues to unfold.\n\nImage source: Shutterstock"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQbmlXMWtkbHBCeDh4T29nYmpoYTg1dUdEOW5OTXA4YXpGUTJ0dnBReTFHM3RLWTh0bUYwSzREMTlOenhBVng2c2RxbFVIeXRNTmppcW5fWHpsRWdtY1JjQnRZV0JCYWl3ZVFyZm41OW04U3hnSWJUTzFCRTdpbFhVbjB0Vi1uTnVzZi1z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Ethereum will become the backbone of a new financial system - City A.M.",
        "content": "Ethereum will become the backbone of a new financial system\n\nLooking back, the rise of blockchains and Ethereum as the foundation of the new financial system will seem equally inevitable. Last week, Ethereum developers launched the new Dencun upgrade. It significantly reduces the cost of transactions on so-called ‘Layer 2s.’\n\nEach day, Coinrule will run through the state of the digital assets market for Blockbeat, your home for news, analysis, opinion and commentary on blockchain and digital assets.\n\nWhen cars first started to appear in the 19th century, they were a truly ridiculous sight. Clunky, noisy and big, it was hard to imagine for most contemporaries that these machines would ever be good for anything. Worst of all? There just was not much use for them. After all, most roads were not in a state to support cars. Fast forward 100 years and the picture had changed.\n\nLooking back, the rise of blockchains and Ethereum as the foundation of the new financial system will seem equally inevitable. Last week, Ethereum developers launched the new Dencun upgrade. It significantly reduces the cost of transactions on so-called ‘Layer 2s.’ While the upgrade itself was a major milestone, it also shows that the Ethereum roadmap is progressing towards scalability, security and decentralisation. In the public perception of many, blockchains may live somewhere between memecoin gambling and vaporware. This is similar to how cars were seen before the advent of infrastructure designed to support them. But some of the best computer scientists and cryptographers in the world are busy building these roads.\n\nThe endgame for blockchains seems to be a so-called modular approach: different Layer 2s with their own setups provide varying degrees of speed and decentralisation. Corporations might gather around ‘permissioned’ Layer 2s where participants have to go through KYC. Specific applications that require large throughput might use their own Layer 3, a so-called ‘app-chain.’ Ethereum’s Market Cap of close to $500 billion provides substantial economic security for this ecosystem. It will also be built around Ethereum’s ethos of credible neutrality and permissionless-ness at Layer 1. Eventually, the ability to have finance ‘natively’ built into the digital world will allow use-cases that we cannot even imagine today. From machine-to-machine payments, a more equitable global financial system and hundred times lower cost of trade finance and cross-border payments, the transition to blockchain-based finance will happen slowly, then suddenly.\n\nThe main challenge on the way is to ensure that all these blockchain ‘modules’ keep the main benefits of the system. These are the shared liquidity that enables financial use-cases on a large scale. It is also the composability that allows programmers to connect with applications across all platforms. But as Dencun’s successful launch shows once again, Ethereum is quietly executing on its roadmap."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPWk9BbWYwSEJmNXpZMHp1eTdlN0NEaFVQelhVZnhIQTI5RGpIeUZiUWJhSE43bGNOMnZ2WkttT1U3OUJTM3RWZEE2Q01jRWxfdDBERVpKYnd0R21VY01hNW5ZbXpSelBITzhpVkxhNzc1VHBrVFhEbzlVT1JjNGhBMDRjcVBXb0dSNVo0cjFXMFNOODFnU05fckRB0gGfAUFVX3lxTE9JdlhkV0Y4dmRiNWhNNjlLWVRNQ3ZSSGVTbklHXzJGVEVPLUxqZVNUcHkzNkhmMnJfVkJzUmItVVhBN0JoM1d2X2FkeVktQTdvbWNfYm9odGdiUzJPZ0F3WDlza0FfcUpqcldyQ08ya0g2Wk82bFJJY2pBSkFncDF5M2pKWDFKZ00wLXI4Uk00TnpHU2xIV3hDekxuX21rVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF: Will SEC Reject BlackRock, Grayscale & Other Applications? - CoinGape",
        "content": "Rhode Island Senator Jack Reed and California Senator Laphonza Butler have penned a compelling letter to Gary Gensler, Chair of the U.S. Securities and Exchange Commission (SEC). In the letter they urged meticulous scrutiny and caution in the approval process for crypto ETFs. This has led to uncertainty over approval of Spot Ethereum ETF applications by Grayscale, BlackRockBlackRock, VanEck, and Franklin Templeton.\n\nWill SEC Reject Spot Ethereum ETF Applications?\n\nIn advocating for a cautious approach, the senators argue against the blanket approval of cryptocurrency ETPs, citing concerns over market integrity and investor protection. They call for strict limitations on the precedential application of such approvals. Moreover, they asserted that markets for other cryptocurrencies lack the trading volumes and integrity to support associated ETPs.\n\nadvertisement\n\nThe senators emphasized, “Finally, we believe the SEC should strictly limit the precedential application of these approvals.” Hence, the chances of SEC approving Spot Ether ETFs in May have lowered significantly. Furthermore, the letter also warned against the risks posed by thinly traded cryptocurrencies and those susceptible to fraudulent schemes.\n\nIn addition, Senators Reed and Butler expressed skepticism regarding the suitability of these assets for ETPs, citing potential risks to retail investors. They underscored the SEC’s discretion in approving such products, urging restraint in the face of heightened risks. The letter concluded, “Retail investors would face enormous risks from ETPs referencing thinly traded cryptocurrencies or cryptocurrencies whose prices are especially susceptible to pump-and-dump or other fraudulent schemes.”\n\nEarlier, Bloomberg ETF expert Eric Balchunas significantly lowered the likelihood of a Spot Ethereum ETF approval in May, from 60–70% to 30%. This decline in optimism coincided with dissatisfaction in the market regarding the SEC’s handling of Ethereum ETF applications.\n\nMoreover, the SEC’s lack of engagement and silence on the matter has left the market uncertain about its eventual decision. Hence, if the regulator agency decides to adhere to the request made by the U.S. senators, it could possibly reject the Spot Ethereum ETF applications by giants like BlackRock, Grayscale and others. In addition, the possibility of XRP, SHIB, or TRX ETFs might also be ruled out.\n\nAlso Read: Spot Bitcoin ETF: Cetera Approves IBIT BTCO, FBTC, EZBC For Trading\n\nScrutiny Over Bitcoin ETFs\n\nSenators Reed and Butler also highlighted the need for clarity in terminology, emphasizing that the Bitcoin ETF offerings should be referred to as Exchange-Traded Products (ETPs) rather than ETFs. They stressed the importance of ensuring investors receive complete and accurate information about crypto ETPs. Moreover, these U.s. senators called for close examination of broker-dealers’ communications to mitigate the risk of misinformation.\n\nFurthermore, the senators underscored the regulatory obligation to safeguard investors’ interests. They pressured the SEC to “examine brokers and advisers that recommend cryptocurrency ETPs to ensure they are, in fact, acting in the best interests of their clients, as required by SEC rules.” Moreover, they emphasize the importance of scrutinizing advisers recommending cryptocurrency ETPs to ascertain compliance with SEC regulations.\n\nAnother critical aspect highlighted in the letter pertains to naming conventions used in SEC filings and investor documents. Senators Reed and Butler call for measures to ensure that Bitcoin ETFs do not utilize inappropriate or confusing naming conventions, thereby enhancing transparency and clarity for investors.\n\nThey stated, “Ensure that bitcoin ETPs do not use inappropriate and confusing naming conventions in SEC filings and other investor documents.” The crypto industry is bracing for further challenges as Spot Bitcoin ETFs are now expected to be in the SEC’s radar. Meanwhile, the hype for May approval of Spot Ethereum ETFs has faded owing to the uncertainties.\n\nAlso Read: Bitcoin ETF Inflow Drops 80% To $133M As BTC Price Retreats\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNejdGTllzR3p5MjBLdjZ4RHZhVkF6c2QyeWdpVXpNb01MQkFVSE5uZkp0NndTR0FEY1dUbTAzbmpvdWQtSnExMGhVbmxIWjU3SEpQcGZ4SUZTS1Yxa2w0YTcyYWpaQS0tRV85QUlsNnItc3VxSmhuOFFISFlRWExLc0R1a21XVzVMaklIY25lcEE4ZWtJR2lUOXkwRE5rek5rT2kxYmRjYUtIdG5RRUE3ODlrYUFBOFVsbmxwUVM4My12RFBFV0VTYVV6c2ttWjg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Dencun brings the forecast on the price of Ethereum $ETH to $5,000 - The Cryptonomist",
        "content": "Finally, the Dencun update has arrived, traders and analysts are in excitement with the predictions and all signals indicate a significant surge in the price of Ethereum.\n\nThe culmination of EIP-4844, nicknamed “protodanksharding”, promises to revolutionize the Ethereum ecosystem by drastically reducing transaction costs on layer 2.\n\nAlthough this data alone sets the stage for a bullish trajectory, it is the data on derivatives that provides further validation of the imminent rally in Ethereum prices.\n\nThe Dencun update of Ethereum brings positive price forecasts\n\nThe derivatives markets are in full swing, with Ethereum futures experiencing an unprecedented surge in open interest (OI), reaching a record high of 14 billion dollars.\n\nThe main exchanges like Binance, Bybit, and OKX have recorded significant jumps, indicating a widespread bullish sentiment among traders.\n\nIn particular, institutional investors are also joining the fray, as evidenced by the 5-6% increase in ETH OI on platforms such as CME and Deribit.\n\nAt the same time, the OI of options on Ethereum has reached new highs, reaching 14.77 billion dollars, with call options dominating the landscape at 65.87%.\n\nThe data from Deribit reveals a put-call ratio of 0.65, with options traders positioning themselves favorably after the Dencun update.\n\nNoteworthy are the staggering volumes of call options, with traders betting heavily on the rise of Ethereum.\n\nCall options for strike prices of 4500 and 5000 dollars before March 29 have attracted significant attention, highlighting the bullish prospects of the market.\n\nEven analysts are echoing this optimism, and forecasts of an ETH price exceeding the $5000 threshold are gaining ground.\n\nAli Martinez, an important cryptocurrency analyst, highlights a massive influx of about 83 billion dollars in the cryptocurrency market, with Bitcoin and Ethereum leading the way.\n\nInstitutional interest in Ethereum\n\nThis influx of capital, combined with the upcoming launch of an Ethereum ETF, signals a growing institutional interest in Ethereum, pushing its price higher despite the declining odds of ETF approval.\n\nMichael van de Poppe, esteemed trader and analyst, states that it is only a matter of time before Ethereum embarks on its next upward trajectory.\n\nAdvise traders to monitor the chart of the ETH/BTC pair to confirm another altcoin rally while the price of Bitcoin stabilizes.\n\nVan de Poppe identifies a critical resistance level near $4550, suggesting that a breakthrough could propel Ethereum towards the coveted $5000 threshold.\n\nRight in the midst of this fervor, the price of Ethereum has already started its ascent, recording a gain of 1% in the last 24 hours.\n\nCurrently trading at $4,056, Ethereum’s price trajectory reflects growing investor confidence, with a 24-hour trading volume seeing a significant 20% increase.\n\nThese indicators suggest a renewed interest from traders and investors, laying the foundation for Ethereum to rise to $5,000 after the Dencun update.\n\nIn conclusion, Ethereum’s journey towards $5000 seems imminent, fueled by a convergence of bullish fundamentals and solid derivative data.\n\nThe Dencun update promises to unlock new possibilities for Ethereum, making it more scalable and cost-effective, thus attracting both retail and institutional investors.\n\nAs analysts and traders prepare for the next Ethereum rally, all eyes are on the charts, waiting for the prophecy of Ethereum reaching $5000 to come true."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOdVFLSHpLNW9MREdhNDdjNTdMd0g2S3NuYldENUctc0JwaExFWG5RRGJiMmFpLUs2WTJSQzMzUWJrNDFUc1FUX3I3WDFrQWMtdGlIcW4yZG5GR3k4UENYSWJfSE1TSnRfZi1Vd0w5bTFQRm9GdklraFRzOXA2S1FBREhPRdIBiAFBVV95cUxNZzJpcDhEbDFJRm1JcjlCbFF4M011dkVNWGNnSlh0d2RJcTJ0dGh4SUd1b0s4TExIeFhBdzU4SDM5Sm5xVnVBTW4xV1JlalotdldDZGViU3JrbjZkOGcyNEhOaXdGWEdjR1hTSlpTYlRncVFOVTQwUkNRTkxBUzdhV1A3V3N3UWpY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "These Firms Are Behind Frequent Ethereum (ETH) Price Dump - CoinGape",
        "content": "The recent fluctuations in Ethereum’s price have drawn attention to the involvement of major players like FTX and Alameda Research. In the past days, data from Spot on Chain shows these entities have been actively moving significant amounts of Ethereum, totaling 6,500 ETH valued at $24.57 million, to Coinbase. Interestingly, these transactions have been closely followed by notable drops in Ethereum’s market value, indicating a potential correlation between the movements of FTX and Alameda Research and Ethereum’s price dynamics.\n\nadvertisement\n\nAnalysis of Recent Transactions and Price Impact\n\nFTX and Alameda Research have been busy in the Ethereum market, executing multiple transactions in recent days. These transactions involve significant amounts of Ethereum being deposited to Coinbase, along with movements of other assets totaling $6.26 million.\n\nNotably, the market has reacted swiftly to these transactions, with Ethereum experiencing notable price drops following the majority of these movements. Graphical representations of these price movements highlight the correlation between the transactions executed by FTX and Alameda Research and the subsequent dips in Ethereum’s market value, suggesting a potential causal relationship between the two.\n\nAlso Read: NFPrompt Suffers Major Hack: FBI Steps In To Ensure User Safety\n\nTechnical Analysis and Outlook\n\nTurning to technical analysis, Ethereum’s current price trend reveals the formation of a significant bearish trend line, with resistance observed around $3,850. Key resistance levels are identified near $3,850 and the trend line, closely aligned with the 50% Fibonacci retracement level from recent swing highs to lows. Potential scenarios for Ethereum’s price movement hinge on breaking these resistance levels.\n\nA successful breach above $3,880 could signal a resurgence in bullish momentum, potentially pushing Ethereum towards the $4,000 mark. Conversely, failure to overcome $3,850 might lead to further downside movement. Initial support is expected around $3,680, followed by a major support zone near $3,600. A decisive break below $3,500 could trigger a deeper decline towards $3,350, warranting close monitoring of key support and resistance levels in the days ahead.\n\nAlso Read: Digital Chamber CEO Advocates Bitcoin As “Inflation Proof” Amid Hot CPI & PPI\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQeHc4dWN1ZkZaTTIweE9FektCMndJVzRjX3RNeVR4eFI0WGk2UkF4SXlFV0o3SXdGbldWNklDbDJEVlNMSEYtTF9HRUNVVzJYR2xSblZnRk8wa1p5MUxENjdkYlhkVGZPSGszMldnN2N4SGg4eUtmU1AzUlNTOTk5c1pXVVRyVTVVN25lbTJCR3UyaFRFNU5Hc3VnS3NPZl94WXdRVFVZT05LUUVCUTVUbUtwWS1LRGpHNFcybkdTYXEwckRV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Price Takes Hit, But This Support Could Spark Fresh Increase - TradingView",
        "content": "Ethereum price is declining from the $4,080 zone. ETH is now approaching a major support at $3,500 where the bulls might take a stand.\n\nEthereum started a downside correction from the $3,080 zone.\n\nThe price is trading below $3,800 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance at $3,850 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could resume its increase if it clears the $3,850 resistance zone.\n\nEthereum Price Dips\n\nEthereum price failed to stay above the $4,000 resistance zone and started a downside correction, like Bitcoin. ETH declined below the $3,920 and $3,850 support levels to enter a short-term bearish zone.\n\nIt even spiked below the $3,680 support zone. A low was formed at $3,625 and the price is now consolidating losses. It seems like there is a key bearish trend line forming with resistance at $3,850 on the hourly chart of ETH/USD.\n\nEthereum price is now trading below $3,800 and the 100-hourly Simple Moving Average. On the upside, immediate resistance is near the $3,740 level or the 23.6% Fib retracement level of the recent decline from the $4,083 swing high to the $3,625 low.\n\nThe first major resistance is near the $3,850 level and the trend line. It is close to the 50% Fib retracement level of the recent decline from the $4,083 swing high to the $3,625 low.\n\nNewsBTC\n\nSource: ETHUSD on TradingView.com\n\nThe next major resistance is near $3,880, above which the price might gain bullish momentum. In the stated case, Ether could rally toward the $4,000 level. If there is a move above the $4,000 resistance, Ethereum could even rise toward the $4,080 resistance. Any more gains might call for a test of $4,150.\n\nMore Losses In ETH?\n\nIf Ethereum fails to clear the $3,850 resistance, it could continue to move down. Initial support on the downside is near the $3,680 level.\n\nThe first major support is near the $3,600 zone. The next key support could be the $3,500 zone. A clear move below the $3,500 support might send the price toward $3,350. Any more losses might send the price toward the $3,250 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $3,600\n\nMajor Resistance Level – $3,850"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOLTlMYXpMdTVpMG1naXdQbjc4UGN0bjJwNjRzUzhhbFVfR3cteVl4dEhpSE5NdGdpdzQxOFBYV1U5cGVwbVoyT1pqMVNOczk1Z2lpTDlUbEhUOVowMmc2cnFBdWE1Y3RkcThrSXFvTFMzODlyUXFWaHd0dW5wNkR2LVM1TTVxREhZ0gGOAUFVX3lxTE8zcnpjS05TSzdwU3JRdHlFYmpCZ1Q3TThBRVFYYmRzN084cW5fd0RoUjY1aFZQRl9ndHZLVEcxT21BZFFBT2pYQmdWWFZWeTBCSGtRR2VEcW5qLWhSazRtUUF2bXItZkdpVUJTQ1ZGT1VYQzRIa1AweV9xSUZRdGoyb1Vud1RaVjZ2alFrWHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Ethereum’s Dencun killing L2 fees by 92%: Will Optimism, ARB pump now? - AMBCrypto News",
        "content": "Ethereum’s Dencun upgrade went live on the 13th of March.\n\nThere has since been a notable decline in transaction fees on L2 networks.\n\nLeading layer 2 networks (L2s) have witnessed a significant drop in transaction fees in the past 24 hours.\n\nThis is a result of the successful deployment of the Dencun upgrade and the activation of EIP-4844 on the Ethereum [ETH] mainnet.\n\nThe Dencun hard fork, which is the biggest upgrade to the Ethereum network since the Merge in September 2022, went live at 1:55 pm UTC on the 13th of March.\n\nAs reported previously, the Dencun upgrade aims to enhance Ethereum’s scalability and, notably, to decrease the transaction fees of L2 solution providers.\n\nThe average transaction fees on L2s like Optimism [OP], Arbitrum [ARB], Base, and zkSync have dropped significantly by 92%, 23%, 94%, and 33%, respectively, since the implementation of the Dencun hard fork.\n\nAMBCrypto sourced this data via a Dune Analytics dashboard compiled by Marcov.\n\nETH remains in good hands\n\nETH exchanged hands at $3,988 at press time, per CoinMarketCap’s data.\n\nIts statistically positive correlation with Bitcoin [BTC], whose value has climbed by over 10% in the last week, caused the altcoin to witness a 5% price uptick during the same period.\n\nA 2% increase in its supply on cryptocurrency exchanges over the past week indicated a rise in profit-taking activity.\n\nHowever, a look at its performance on a daily chart revealed that market sentiment remains markedly bullish.\n\nFor example, reading from ETH’s Moving Average Convergence Divergence (MACD) indicator which tracks market trends, showed the MACD line (blue) significantly above the trend (orange) and zero lines.\n\nWhen these lines are positioned in this manner, it indicates strong bullish momentum in the market.\n\nIt suggests that the short-term moving average is above the long-term moving average, and there is potential for continued price growth.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nFurther, the altcoin’s Chaikin Money Flow (CMF) was 0.26 as of this writing. In an uptrend and above zero, ETH’s CMF showed that liquidity inflow into the market remained high.\n\nRegarding the demand for the leading altcoin, its Relative Strength Index (RSI) and Money Flow (MFI) were 76.57 and 65.54 at press time. These values showed that coin accumulation exceeded sell-offs."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNUGZpWGtlLTlidjBEajRhRHgxWGhWeThDSFZDVkdwSFcxdEwwZHAyRGg3bDh5cGxnNEVGVWxkY29aMHBHWjFUYVZfTUpSdGxBWTVxNFVQQjU4WlkwRkVzZlNYa3JqN0V6empEWTI2dmpOWEZlVTMxbkt5Z1kwakhaWDZfVmhSZGhIc1ZSbENTNUpwT0lhSmItRWR0a3UwNGtOQlFVNTNxV2xNeFFLdHIxOHFqdzZYUVdiM1JnRzVYQ3Z2N2Z5S09DY3ppZGJMT3NvVUHSAdcBQVVfeXFMTmE3OTlUQjdqNkpjeHl3RF9LWG1ubU05Tk5wdTk4d0FmN2RhamQ2MndZS3B5c2hjVkZxcE9jLWh5Tm9sdWVULV9Db3FBUDVfZnlDMmdRZFl1Z3MzMXRzV3p2bHNDdDBiVlpLeDcycWMwWEFRSG9fQ1B3TlJ2WmFWczVRQjI3TDA0Ni1JaXZVOERPd0F2Wi1ZWlgtWlhiS3dIUUlGcl8wdWk2a0dCclJpLTJkcUZDVl9UYnlUZ281blhQdGFxTjktQTVmRlZkRmhSYmJCcm1qbG8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Top Crypto Trader Turns Bullish on Worldcoin (WLD) and Two of Ethereum’s Biggest Rivals – Here’s His Outlook - The Daily Hodl",
        "content": "A closely followed crypto trader is flipping bullish on Sam Altman’s identity-focused crypto project Worldcoin (WLD).\n\nPseudonymous trader The Flow Horse tells his 200,300 followers on the social media platform X that artificial intelligence (AI)-related Worldcoin appears like it could flip the $10 level into support.\n\nHe suggests that Worldcoin could also get a boost from the upcoming GTC conference hosted by Nvidia (NVDA), the leading provider of chips specially designed to train and run AI applications, which could increase interest in projects involved in the AI world.\n\n“Six days until the NVDA conference [March 18 through 21] and WLD looks like this holding $10.”\n\nWorldcoin is trading for $9.50 at time of writing, down nearly 7% in the last 24 hours.\n\nNext up, the trader believes that Ethereum (ETH) competitor Solana (SOL) could soar more than 22% from its current value.\n\n“Once SOL clears up $150-$160 zone, I think blue skies up until $200.”\n\nSolana is trading for $163.81 at time of writing, up 10.5% in the last 24 hours.\n\nLastly, the trader thinks ETH competitor Avalanche (AVAX) has more upside potential after breaking the $50 level and experiencing high trading volume.\n\n“Bought AVAX a little early before the drop. Unfortunately, I was out when we had the dip so couldn’t add.”\n\nAVAX is trading for $54.24 at time of writing, up more than 29% in the last week.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMi8wFBVV95cUxPaFJ3UGN0ZGVXRGFNeDRPanhYVXB0Ump5YVRSdFJQUTU4d1JuLWQwT0xjUHJHallYMi1iRDZXdURzemRfY2ZtMTRVLUFtMFRQWFg2X2pGRmg5SGg1bWNyZzB6RTNwX2RzMkNIQVJPWS04TDlUOFZlS2NUZTBHUmVySlBOeHFRRmVoZ3JRRjZ2TVQ2TlpnU1hoTVhJTlJ0QTNaWWJsWGdYMGpFOHhYWHp4UGkzVk1TRnpQSjVRQS1ubko0N3NGd2FSbmNHRTJIN1lJdTlna0l5U0loeGg2dEtyY3ZjOTBIZmZIZWpUV0w0Nks1bDDSAfgBQVVfeXFMTU0ybkJYLVF4czRtYkcwMWFuWVMwUFZxYUV3bnlhR0FRSkNIeWNhMUNGa3h0RWh3M3RtTUV1MzRRVHNsZXRxQmpLZzc5TVI4U3ZDTFRaYjY2cDFGTnU0QzNJSzBhZVp1eUNud0lwTmMxZHJfNU5FemREVi0xWWRsWHpNVXRDZDhFcWJyaTBJTk1YQWl6aTZhdll3SWNSRjVxUkdyVHEzSUhFeWVHeVVOd0pKRHpudmJjTDBQTWNyNWpocXNUOTI1c0VheEFvVElwTDQ3OGRPQmc0b2JqdXVvc09Wc2Jtak9EV213UVZsM3VQRzFHcWZrTTU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Ethereum ETF could be in danger as pressure over SEC mounts - FXStreet",
        "content": "Two US senators said more crypto ETFs shouldn’t be approved. .\n\nSpot Ether ETF's bullish view may fade if the SEC pays attention to the concerns raised in the senators' letters.\n\nSEC and institutional brokers yet to comment on the senators’ letter.\n\nCrypto ETFs could slow down on their success after democrat senators Jack Reed and Laphonza Butler sent a detailed letter to the US Security and Exchange Commission (SEC) chairman, Gary Gensler, asking him not to give any further approval.\n\nCrypto ETFs approval is a wrong move, senators say\n\nCrypto ETFs tracking the price of Bitcoin (BTC) debuted in the US in January, a move that sparked a bull run in the crypto market. The SEC's Bitcoin ETF approval allowed several reputable investment institutions, including BlackRock, Fidelity, and Ark21Shares, among many others, to give customers access to the most popular digital asset.\n\nLess than two months after their launch, these ETFs have been one of the main catalysts for Bitcoin's price, sending it to a fresh all-time high of $73,600 on Thursday.\n\nHowever, Jack Reed and Laphonza Butler said the SEC made the wrong move by greenlighting crypto ETFs. In a letter dated March 11, they stated several reasons why crypto ETFs pose a threat to the financial well-being of retail investors.\n\nFurthermore, they accused brokers of violating fair disclosure rules by intentionally obscuring important information and employing \"naming and marketing that appear to obfuscate important characteristics about these investments.\"\n\nAlso read: Cetera proclaims ‘prudent embrace’ of spot BTC ETF usage, expert says more to come\n\nSpot Ether ETFs approval has slim chances\n\nThis letter comes at a time when eight spot Ether (ETH) ETFs from reputable firms like BlackRock, Franklin Templeton, VanEck, etc., await a decision from the SEC later in May.\n\nIn a post on X, ETF analyst Eric Balchunas stated the success of Bitcoin ETF is upsetting high-ranking Democrats, leading to a pessimistic view of a spot ETH ETF approval chances.\n\nThe senators also mentioned that the SEC should slow down in approving any other crypto ETFs.\"While the bitcoin market has displayed serious weakness, it is nonetheless far more established and scrutinized than the market for any other cryptocurrency,\" they said.\n\nReed and Butler expressed concerns that ETPs representing cryptocurrencies with low trading volume will expose retail investors to high risks.\n\nThe market has yet to respond to this news as institutional brokers or the SEC haven't commented on the letter as of the time of writing.\n\nRead more: Ethereum price trades above $4,000 while anti-Ether political campaigns downplay spot ETH ETF"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOaUNpX3JGclZYZk9yS3I4QkxSc3NwOFhSeGp3WkQ1TV9rMWhUVGIyY2Q0WFJqcUF4VFFNeEhkS1hnMlUteElFQnZwSTlNeWw0em0xUnFEZDVWb0c0dHZjSlgtcGlZUDB2ZGttRUFNSFYyZy1TdHlMV1YwQUFLU2VFMG52dlpUWnlkbXlBY3FTM1QtNGPSAZsBQVVfeXFMUDR6bFR5OU50RTEzelRGNFVxNkdiMnNFcHlZaWR2N3VBWjZYZkVIZHVCamtuclg0T0p5b2J2N1Z0UWlvSmF3S1Qwd3lYSHVFOGoxUWZRRjNYa08xcmoyVnY1aVFZSE5vRzctRlhIOHBvYkNabEtOMUszV0M5Q3VRUkFiVkUtY2FnTlJVRHRMeHdpcE5xSEVsTy1xTG8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "SuperRare Expands Beyond Ethereum NFTs Into Bitcoin Ordinals Artwork - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum NFT marketplace SuperRare is making the jump to Bitcoin with the launch of a new collection of Ordinals inscriptions by the artist Killer Acid, the platform announced Thursday.\n\nSan Diego-based SuperRare is a platform for art creators and collectors backed by the Ethereum blockchain. It specializes in single-edition, 1-of-1 digital works and is one of the longest-running platforms in the NFT world.\n\nSuperRare partnered with Bitcoin Ordinals marketplace Gamma to bring inscriptions to the platform. While SuperRare did not specify the size of the collection coming April 11, 2024, “No Brainers” will continue that trend on Bitcoin and only feature 1-of-1 inscriptions, meaning each piece of art in the collection will be unique, with each Ordinals inscription having a unique image.\n\nKiller Acid is the brainchild of artist Rob Corradetti, whose work often trades in psychedelic themes. Artwork from \"No Brainers\" has yet to be revealed as of this writing; the image above is derived from an Ethereum NFT piece that Killer Acid minted on SuperRare in 2022 called \"Crypto Art.\"\n\nAD\n\nAD\n\n\"When I first discovered Ordinals last year, it was still in its infancy—all of the setups were manual and required trust. Initially, this turned me off,” Zack Yanger, SVP of SuperRare Labs, told Decrypt in an email.\n\nYanger said that towards the end of 2023, he took time to dive further into the Ordinals ecosystem and came to understand that there has been “cutting-edge development” in the space since the protocol launched at the start of last year. Substantial infrastructure has been built in the Ordinals space since then.\n\n“At SuperRare, we are always looking for new ways to support our artists in creative ways. After receiving significant inbound interest from our artist community, we’re excited to begin experimenting with Ordinals,\" Yanger said.\n\nAD\n\nAD\n\nWhile Ethereum remains the number one network for NFTs based on trading volume, Bitcoin is heating up as another key place to mint digital artwork and collectibles thanks to the Ordinals protocol launched last year. In fact, Ordinals trading is starting to shake up the market share standings, recently pushing cross-chain marketplace Magic Eden to the top of the list.\n\n“It’s time to bring more artists home to Bitcoin,” Bitcoin NFT marketplace Gamma co-founder Nick Sainato told Decrypt.\n\n“Building in the programmable Bitcoin ecosystem since 2021, it’s been truly exciting watching the unprecedented market and mindshare that has been ushered in by Ordinals over the past year,” he added. “Supporting SuperRare’s entry into Bitcoin has been an honor, as one of the early teams who laid the groundwork for digital assets and established much of the appreciation for fine art on-chain.”\n\nLast year, SuperRare entered the NFT royalties debate, with SuperRare co-founder Jonathan Perkins saying the platform will continue to pay artists a share of secondary market sales after many rival platforms stopped enforcing them.\n\n“We took a fairly controversial move at the time to include artist royalties. What we said is that if we can help artists make any money through royalties, why not try, at least? So we played some part in establishing some kind of a standard, at least for the art side,” Perkins told Decrypt during NFT Paris 2023. \"Royalties are not going away on SuperRare.”\n\nEdited by Andrew Hayward"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPOGtrejB0WGgzcV9pbTZBVFFZdXM4bjVWRXR6YjExSEZ1bHY4U3h4WjVNbHdrQndlV3dnT2tIOG0ySnRxZzhYWDZialhKajl2eDdoLTVkOS1HTURPYloxQlRnbElNbzRTUFh3UExucXhKS2lCTHN5LW5rU2YyMGdXYUtBTk04SFAxUFE0NXZmdnMyWXVqOXM4dUNld0ZMMWZlcG1iVXdrS1HSAa4BQVVfeXFMT01LM3k3SHZub0FmT0l0cFM4SjdfQ1FoUTlhNGFFWGNPYjZQeTdKd1FtQ1NjSzlSR0NmckFrUTBPaWxadm1iZlBiamY2Z213LTNxOWF0cWY4bDc0eTJwSWdPbV9SM21EamkyZDVCNXpldjAyZWoyOVh5c1BucGpqaEs1V05JcHZLczRvYWVfTEY4UU11eThFcUlZbXBCLUF3aFdmTTBnd3RDdWNlUWJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Crypto Prices Today March 14: Bitcoin Nears $73,000, Ethereum Dips As SOL, PEPE & WIF Soar - CoinGape",
        "content": "The top crypto prices today registered a mixed action as the Bitcoin (BTC) price neared the $73,000 level again after attaining an all-time high at $73,641.04. In contrast, the Ethereum price fell below the $4,000 mark. Meanwhile, other top altcoins, such as XRP and Cardano (ADA) dipped as Solana (SOL) rallied.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price sustained above the $72,000 mark. The Bitcoin price was up by 1%, reaching $72,906.33 at the time of writing on Thursday, March 14. On the other hand, it’s trading volume dipped by 21.49% to $48.03 billion in the last 24 hours. Meanwhile, the crypto boasted a market cap of $1.43 trillion.\n\nadvertisement\n\nIn the altcoin arena, the Ethereum price dropped by 2.12% to $3,957.90 at press time with a market valuation of $475.46 billion. Whilst, ETH saw its trading volume decline by 16.45%, reaching $21.88 billion. Meanwhile, the Binance Coin (BNB) price was up by 13.72%, reaching $611.68. Moreover, its 24-hour trade volume gained by 53.08% to $6.17 billion.\n\nThe Solana price neared the $170 level. The Solana price surged by 12.62%, settling at $168.68. In addition, SOL witnessed a 16.99% hike in trade volume to $6.63 billion in the last 24 hours. Whilst, the XRP price dropped below the $0.68 mark. The XRP price recorded a slump of 2.80%, reaching $0.6759. Moreover, XRP’s trading volume plummeted by 34.01% to $2.39 billion.\n\nMeanwhile, the Cardano price tumbled by 0.39% to $0.7482 today. Whilst, ADA recorded a 6.60% plunge in its 24-hour trading volume, settling at $874.63 million. As the top crypto prices witnessed volatility, popular meme coins were also affected. The Dogecoin price was up by 4.89% to $0.1805 while its rival, Shiba Inu price rose by 0.65% in value and traded at $0.00003316.\n\nAlso Read: Meme Coin Rise Historical Data Reignites Fears of Crypto Bubble Burst\n\nTop Crypto Prices Today Are\n\nPepe Coin Surges 12\n\nThe Pepe Coin (PEPE) crypto, a popular meme coin, soared over 12% today. At press time, the Pepe Coin price was up by 12.35% to $0.00001015 with a market valuation of $4.26 billion. In addition, its 24-hour trade volume spiked 71.05% to $2.30 billion.\n\nDogwifhat Soars 23%\n\nDogwifhat (WIF), a Solana-based dog-themed meme coin, recorded an impressive surge of over 23% and ranked the top crypto gainer today. The WIF price soared by 23.41% to $2.86 at the time of reporting. Moreover, its trade volume surged by 37.11% to $371.45 million. Furthermore, the Dogwifhat crypto recorded a high of $4.50 amid the rally recently.\n\nAlso Read: Binance Responds to Nigerian Ban Amidst Rising Crypto Adoption\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQZi1sOU9ycmhhT0xPTFFPXzNMTGRqQktEY0wyem1BTElpQ0pQem01ajNxd3hkc053dU54Um5ZV0lPTFB2RUNKc0JWMnRJcmgzTTJqeGxFVzRESlloc2RrV0YzM3laRGRzVUNHNU56VW5EOTk3Y01Ua21NSWxrX1JPT2RFUXB5ODTSAYwBQVVfeXFMTlBwbkRQZzZQT0ozX1d0d1BVZGZjYmg0QjJXbzNJc0Jyc216T1FQM1hJX0owTFJqQTJsRUJFODlVdEs0UmpnOUcwY0pPNnBzOXM5NlFmbnNrMnd3NEkySFcxdV84dURwbE5WNmhyU3dkdnJNUHZlTWZIWlNacHBuRVNRelpVVV82QjBENzI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "BNB Chain set for new upgrade, follows Ethereum’s footsteps - AMBCrypto News",
        "content": "The blockchain mentioned that the upgrade would bring blobs but in a different manner.\n\nBNB Chain registered an increase in fees generated but development activity dropped.\n\nOn the same day Ethereum [ETH] finalized the Dencun upgrade, BNB Chain announced that it was towing a similar path.\n\nAccording to BNB Chain, it intends to work on a new upgrade tagged the “BEP 633” over the next few months.\n\nThe BEP 633 is similar to Ethereum’s EIP-4844, which has significantly reduced transaction costs on Layer-2 (L2) projects. Like the EIP-4844, BEP 633 brings blobs into the conversation.\n\nSacrifices for the cheaper route\n\nFor the uninitiated, a blob is a highly scalable type of cloud storage that compresses large data. It also eases the network verification process.\n\nBNB Chain, in its disclosure, noted that the blobs would be useful for opBNB, the L2 of its ecosystem.\n\nThe decentralized smart contract network explained,\n\n“The temporary attribute of blobs ensures they don’t indefinitely consume network space, leading to lower storage costs and, consequently, cheaper gas fees for users.”\n\nThis upgrade would mark the project’s third major one over the last year. In 2023, AMBCrypto reported how the chain introduced Greenfield, which focused on data storage and management.\n\nopBNB also came into play around the same period.\n\nHowever, BNB Chain highlighted the difference between EIP-4844 and BEP 633. Based on its, communiqué, blobs would be managed by the Binance Smart Chain (BSC).\n\nIt also mentioned that BSC would be in charge of the gas price mechanism and fee burn.\n\nWhen BNB Chain completes this upgrade, there is a chance that its fees and revenue might decline. At press time, Artemis’ data showed that fees on the network have been jumping over the last 90 days.\n\nAttention, not development, returns to the network\n\nAt press time, fees generated by the blockchain hit $1.3 million, indicating high network activity. Despite the increase in activity on the network, BNB Chain has struggled to maintain consistency in development activity. According to AMBCrypto’s analysis of Santiment data, BNB’s development activity peaked on the 26th of January. A few days later, the metric was flat. It was a similar situation on the 3rd of March as the metric jumped. At press time, the development activity was flat again, indicating that code commits on the network had been fizzling. However, there was one metric that put BNB in a good light, and that was Social Dominance.\n\nSocial Dominance shows the share of discussions about a project in the media. Thus, the surge meant that BNB Chain had gotten a lot of attention lately.\n\nRealistic or not, here’s BNB’s market cap in ETH’s terms\n\nHowever, there could be changes in the development activity as the chain rolls out the schedule for the BEP 633 upgrade.\n\nFrom the information AMBCrypto got, the Testnet will take place in April while the Mainnet will be concluded by June."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNUDBGYTMxbXhzX2VVc1k3cEFIclJNbmdramVrZTMxVmZxM0wtVnpib1JtX3VuV0tTd1J3Q3lKOW9kMjRxSkhyWmhpNWdCdU16Tl9aZkFhZjV2Z21QdGYzMzN1SHUtNnU4dUNEbUpWM2NTbEh1UjFOUk4xQ19KX0pnZHQxQ3NpR3h50gGOAUFVX3lxTFBwX1ZrTzFnbzNZdWV3OU9GVXcydWFwVUtFRkVpNi1VQkJFN0R0M0tTUFBIWUFQUG1NYXZWQ3NvZ1VYdWthbzBWWXdPR1lDelA1N0szRUo0eml5TU5tV3lmQW9CbmFMRVlCYVBtNzFsM0lXWUY4aDNsUE95ZzZxTC01TXNLRU9rejR0eVRFYnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "If you hold Bitcoin, Ethereum, XRP, the market crash means this… - AMBCrypto News",
        "content": "The past 24 hours have seen a decline in the general cryptocurrency market.\n\nBTC, ETH, and XRP prices may witness further decline in the short term.\n\nAs the crypto market overheats, the values of many leading assets have declined over the past 24 hours. Due to this, the global cryptocurrency market capitalization plummeted by 7% during the same period, according to Coingecko’s data.\n\nAt the time of writing, the global cryptocurrency market cap was $2.7 trillion.\n\nLong liquidations in the Bitcoin market\n\nLeading coin Bitcoin [BTC] has seen its price decline by almost 10% in the past 24 hours. During Asian trading hours of 15th March, the price of the coin dropped to a low of $67,000, marking a 7% decline, before a brief rebound to $68,500.\n\nAccording to CoinMarketCap’s data, the number one coin exchanged hands at $67,742 as of this writing, registering an 8% price decline in the past 24 hours.\n\nHowever, during the same period, the coin’s trading volume rallied by 55%, thereby creating a bearish price/volume divergence. This indicated a heightened selling pressure amid the high market activity.\n\nThis divergence between an asset’s price and its trading volume is common when many investors sell off their holdings, potentially due to negative sentiment or concerns about future price movements.\n\nDue to the sharp fall in Bitcoin’s price, long liquidations in the coin’s futures market surged. According to Coinglass’ data, over $90 million in long positions have been erased over the last 12 hours.\n\nA position is deemed to have been liquidated when it is forcefully closed due to insufficient funds to maintain it. Long liquidations occur when the value of an asset suddenly drops, and traders who have open positions in favor of a price rally are forced to exit their positions.\n\nHowever, despite this decline, the coin’s futures open interest continued to climb. In the last 24 hours, this increased by 2%. Per Coinglass data, BTC’s futures open interest was $37.25 billion at press time.\n\nLikewise, its funding rates observed across crypto exchanges remained positive. The rise in open interest and the positive funding rates showed that despite the current price decline, investors have chosen to remain steadfast in their conviction that Bitcoin’s price would still initiate a rally.\n\nThe bears are looking to regain control of the Ethereum market\n\nDue to its statistically positive correlation with Bitcoin, Ethereum [ETH] has also suffered a decline in its value in the last 24 hours. Exchanging hands at $3,708 at press time, the coin’s price has dropped by 7% during that period.\n\nAn assessment of ETH’s price performance on a daily chart showed a steady uptick in coin sell-offs.\n\nFor example, readings from the coin’s Moving Average Convergence Divergence (MACD) indicator showed that its signal line (orange) successfully crossed above the MACD line (blue) on 14th March.\n\nWhen an asset’s signal line intersects its MACD line in an uptrend, it’s typically considered a bearish signal. This is because the signal line is a 9-day Exponential Moving Average (EMA) of the MACD line itself. It acts as a trigger for buy and sell signals. When it crosses above the MACD line, it suggests a potential shift towards a bearish trend.\n\nTypically, traders interpret this bearish crossover as a signal to sell or a warning sign of a potential downturn in the market.\n\nFurther, suggesting the decline in demand for ETH amongst spot market participants, its Relative Strength Index (RSI) was in a downtrend. Although it remained above the center line at press time, its position indicated a decline in ETH accumulation.\n\nConfirming the steady fall in ETH demand, its on-balance volume (OBV), which measures the coin’s buying and selling pressure, was down by 0.3% in the past 24 hours. When an asset’s OBV line falls, it indicates that the selling volume is increasing, suggesting downward price movement.\n\nAn assessment of ETH’s exchange activity in the past 24 hours confirmed the increase in profit-taking activity. According to CryptoQuant’s data, the coin’s exchange reserve was up by 1% during that period.\n\nAs of this writing, 14 million ETH worth around $52 billion were held across cryptocurrency exchanges.\n\nXRP hints at further downside\n\nRipple’s XRP saw its value drop by 6% in the past 24 hours. Per CoinMarketCap data, the sixth largest crypto asset by market capitalization exchanged hands at $0.63 at the time of writing.\n\nAMBCrypto’s assessment of the token’s volatility markers on a daily chart suggested the possibility of a further decline due to the significantly volatile nature of the market.\n\nFor example, a widening gap at press time separated the upper and lower bands of XRP’s Bollinger Bands (BB) indicator. Typically, a widening gap suggests that price movements are becoming more volatile.\n\nWith a negative weighted sentiment of -0.073, the possibility of a price swing to the downside remained strong.\n\nRealistic or not, here’s XRP market cap in BTC’s terms\n\nAlso confirming the highly volatile nature of XRP’s market is its Average True Range (ATR), which measures market volatility by calculating the average range between high and low prices over a specified number of periods.\n\nXRP’s ATR increased by 25% in the last 24 hours. When this indicator rises in this manner, it signals an uptick in market volatility."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNQXJ1bU1JTDdDamJIeXIxendYRHFEZzlQRFZVckczb1Bjc21DYlp5UFJiakFGckltTGZkb052akpKRVpZdVlJdmhNbEhsd2JOMWVtNFluc0o2bHpmeF9lNk0yeVV2Tjc1UEw4NDhyNE9uR0lwVWI0Q182QlVXSXJIdU55eV82eFRzTHdBaDJwQkgzMVJNLVlRdC1MeUtwczNUZEJtNV9USm1UejNCMlHSAbMBQVVfeXFMT0tUTExhTU1SUHJURFI1SF9zRm93UjV2cFlWaXFyRldpTXprSVhoTzAwXy1odzU1WUpzMVhEU2ZxdzNwLWxLZzliMDRTc2dTQXlLQU1OQWRnb3RGZEx4ZW1iQk9YN3pJa0twRjdVUkFGWHliWndtS2dLWnpqUDRXMzdDaWh0cFJUZ0NnNEtCMkVGa3g4LXk2azRQeGYyX3lHbDYwZl95OVJQc0NqTndDR2h3MFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Crypto Prices Today March 15: Bitcoin Crashes To $67K, Ethereum Dips 7%, SOL Rallies As XRP & PEPE Plunge - CoinGape",
        "content": "The top crypto prices today registered a crash as the Bitcoin (BTC) price neared the $67,000 level again after attaining an all-time high at $73,641.04. In contrast, the Ethereum price fell below to the $3,600 mark. Meanwhile, other top altcoins, such as XRP and Cardano (ADA) dipped massively as Solana (SOL) surged.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price lost over 7% today. The Bitcoin price crashed by 7.56%, reaching $67,348.89 at the time of writing on Friday, March 15. On the other hand, it’s trading volume spiked 50.70% to $72.34 billion in the last 24 hours. Meanwhile, the crypto boasted a market cap of $1.32 trillion.\n\nadvertisement\n\nLooking at altcoin, the Ethereum price plunged by 7.41% to $3,664.32 at press time with a market valuation of $441.24 billion. Whilst, ETH saw its trading volume surge by 38.67%, reaching $30.31 billion. Meanwhile, the Binance Coin (BNB) price was down by 5.09%, reaching $581.82. Moreover, its 24-hour trade volume dipped by 21.32% to $4.85 billion.\n\nThe Solana price defied the bearish trend and neared the $180 level. The Solana price surged by 5.61%, settling at $177.81. In addition, SOL witnessed a 64.42% hike in trade volume to $10.91 billion in the last 24 hours. Whilst, the XRP price dropped below the $0.64 mark. The XRP price recorded a slump of 6.11%, reaching $0.6346. On the contrary, XRP’s trading volume soared 69.57% to $4.05 billion.\n\nMeanwhile, the Cardano price tumbled by 4.25% to $0.7167 today. Whilst, ADA recorded a 110.66% spike in its 24-hour trading volume, settling at $1.84 billion. As the top crypto prices bearish downturn, popular meme coins were also affected. The Dogecoin price was down by 8.70% to $0.1547 while its rival, Shiba Inu price plunged by 8.83% in value and traded at $0.00002997.\n\nAlso Read: Bitcoin (BTC) and Crypto Market Tank 7%, Expect Volatility Before FOMC\n\nTop Crypto Prices Today Are\n\nPepe Coin Plummets 10%\n\nThe Pepe Coin (PEPE) crypto, a hyped meme coin, tumbled over 10% today. At press time, the Pepe Coin price was down by 10.02% to $0.000009116 with a market valuation of $3.83 billion. In contrast, its 24-hour trade volume soared 22.33% to $2.82 billion.\n\nDogwifhat Rallies 13%\n\nDogwifhat (WIF), a Solana-based dog-faced meme crypto, recorded an impressive rally of over 13% and ranked the top crypto gainer for two consecutive days. The WIF price soared by 23.41% to $2.86 at the time of reporting. Moreover, its trade volume surged by 13.68% to $3.25. Furthermore, the Dogwifhat crypto recorded a high of $3.49 amid the rally recently.\n\nAlso Read: Tron Founder Justin Sun Fuels Ether Fi with Massive $480M ETH Deposit\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOOTd3S2JmenMtbjBqbnM3MWxNUm5TWGpLNkM5VmZ0RmM1TEJZMXUxNFNLalV0dFUzY3kwa3djMGcwQXdMWTVkSEo5WlBpRlJEZGktNXplQWY5UEpnTmVSSkRaVE44TnlWZjdJRGZnWk1zanJDNUZrTUlJYmh5N0xkUVZjUnJ3QnpGcXgtbHVKY2ZLY0lDaWd4WjF2VTdFX3BkdWZFWm0xQnAzaXRBZjJVTmdYQ29xcGpDTFBlZ1ZkV29kUTB5NDJab0VYeVJYdUQ3ZmpCNNIB2wFBVV95cUxQTmprTHRXYUdURDRzY0V6X1h5R21fQXBKSm41NnFBQ2JJRG1xLXNQZGlnYTU4bWFhN0kyM0pTY0lFX2JRX2RvSGdaNnZJMmxLSTcwSWJCa0FMS0dydVVhUkZrZmZHajYxTXBQUGNpQ013WC1Zajd1Qkpvajdqb25SVTR4dFFJQ003ano2c0RDbkZTYXZ6MmdOUjNiOXhSVmx3c3ZFMTQ5ejQ2eTY1bjFmMjhSWHZOS3NfTFNwRi0zdGV3TUMtWnVqRmVPRUJaek5iYV9HV0tLa3FESVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Dencun upgrade gets launched on the blockchain’s mainnet - The Financial Express",
        "content": "On March 13, 2024, the Dencun upgrade was finally deployed on the Ethereum mainnet. From what it’s understood, the Dencun development will result in transaction charges’ minimisation related to layer-2 networks, along with improvements in Ethereum’s aggregate growth potential.\n\nReportedly, the Dencun upgrade name was coined by merging Ethereum consensus layer’s Deneb upgrade, which implies the way a consensus is reached between network members over the blockchain’s state, and Ethereum execution layer’s Cancun upgrade, which helps with handling of transactions on the mentioned layer. Official data has shown that the Dencun hard fork encompasses nine separate Ethereum Improvement Proposals (EIPs). As of March 14, 2024 (4.25 pm, Indian Standard Time), at the time of writing, Ethereum was trading close to the $4,000 mark, having an approximately $476 billion worth market capitalisation and around $21 billion worth 24-hour trading volume, as stated by CoinMarketCap, a crypto price-tracking website.\n\nAlso Read Oracle adds generative AI features to finance, supply chain software\n\nThe Dencun upgrade happened almost a year post the Shanghai upgrade in April 2023, which allowed the unstaking of the Ether (ETH) token by its holders for the first time and resulted in Ethereum network clocking over 500,000 validators.\n\nAlso Read Pakistan: Who is the new ISI chief, Lt Gen Muhammad Asim Malik? GoM on GST Rationalisation on Sep 25: To discuss tax slabs, rate changes; next GST meet in October Across the aisle by P Chidambaram: Manipur- Dark side of the moon? Kolkata Metro Update: 262 Blue line services to run on September 17 for Vishwakarma Puja\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOelptcGVMWUhzNHI0WFFhcjJVRE56QUpNNjd5eGgzeVloSUFEUGI2UFo5TFpyejE1RFk4UktyZm1VT0dKUE10OXpieWhQdTRzeGJSbGpHTGhVU00xS194dlM5OURWdWVWWndMaEZkclJCOHJRRXRtanNONDdKY3ppSGF3TmdmTWVhd0RjVW1kVWdBenh4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "What Are Wrapped Tokens And How Do They Work? - DisruptionBanking",
        "content": "The wrapped token market has witnessed substantial growth in the last three years, with Wrapped Bitcoin (wBTC) alone worth a significant $10.58 billion – a sum worth the budget of three small African countries put together.\n\nAt time of writing, wBTC had seen a price increase of 1.7% in a single day, with its price hovering around $68,443.00. This shows that more people are wrapping their digital assets to use them in new ways in the DeFi space. Combined, the market cap for wrapped tokens today stands at $12.1 Billion.\n\nAs the market cap indicates, wrapped tokens like wBTC are gaining traction. Consequently, crypto thought leaders have expressed enthusiasm for the potential of wrapped tokens to revolutionise the DeFi landscape.\n\nBinance, for instance, highlighted the cross-chain functionality that wrapping brings to tokens, allowing for a token pegged to the value of the original asset.\n\nWrapping brings cross-chain functionality to your tokens.\n\n\n\nWhen wrapping a token, you’re provided with a token pegged to the value of the token you wrapped.\n\n\n\nLearn why this is useful below ⬇️ https://t.co/KoT90K7bU4 — Binance (@binance) March 4, 2023\n\nBut what exactly are wrapped tokens, and how do they work?\n\nWrapped Tokens: What They Are And How They Work?\n\nWrapped tokens are like digital vouchers representing another asset from a different blockchain. They’re crucial for allowing different blockchain networks to “talk” to each other, like how an interpreter helps people who speak different languages communicate. They could be cryptocurrencies, stablecoins, or NFTs.\n\n🔶 How do Wrapped Tokens work?\n\n\n\nA key step in creating wrapped tokens involves 'locking' a specific amount of a native blockchain's coin into a smart contract.\n\n\n\n– This process serves to generate the corresponding wrapped token.\n\n\n\nTypically, a DAO or a trusted entity monitors this… pic.twitter.com/RhG7xkPCNN — Stroom (@StroomNetwork) January 23, 2024\n\nPut simply, wrapped Bitcoin (wBTC) – which is the first and most prominent wrapped token – is like a copy of Bitcoin that is tradable on Ethereum’s Blockchain (ECR-20). So, for every wBTC, there’s a real Bitcoin saved somewhere safe (pegged at a 1:1 ratio) through a network of automatically monitored merchants and custodians.\n\nSource: Gate.io\n\nThis setup makes sure that wBTC always has the same value as Bitcoin. It’s like having a voucher that you can swap for a real item at any time. This way, people can use Bitcoin on Ethereum’s network, which normally wouldn’t accept it, without needing anyone to oversee the process.\n\nThe Need For Wrapped Tokens In The Crypto Ecosystem\n\nInteroperability is the answer.\n\nImagine you have a ticket for a bus, but you need to take a train. You can’t use the same ticket, right?\n\nWrapped tokens solve this by “wrapping” a token (like a bus ticket) into a new form (a train ticket) so it can be used on another blockchain, increasing the places where you can use your digital assets and helping everyone join the DeFi movement.\n\n3/ @WrappedBTC makes interoperability possible 🌐\n\n\n\nBy enabling use of #bitcoin on the Ethereum network, $wBTC lets $BTC holders engage in:\n\n• Lending\n\n• Yield farming\n\n• Margin trading\n\n• & other aspects of the growing DeFi ecosystem — Okcoin (@Okcoin) September 9, 2021\n\nIn other words, these tokens act as a bridge, allowing assets from one blockchain to be used on another. This not only makes blockchains more versatile but also increases liquidity, with which assets can be traded easily. This is especially important in Decentralised Finance (DeFi), where wrapped tokens help create a more fluid and dynamic financial environment.\n\nYet, wrapped tokens didn’t just appear out of nowhere; certain entities created them to solve a specific problem at some point in the history of cryptocurrency.\n\nThe Creation of Wrapped Tokens\n\nThe first significant wrapped token was wrapped Bitcoin (wBTC), an ERC-20 version of Bitcoin, created by BitGo, Kyber, and Ren in 2019.\n\nWhat these innovators hoped to achieve was the need for assets to traverse the blockchain divide, and they acted to bridge the gap. As key players and organisations, they set the stage for a more interconnected blockchain world.\n\nAfter this, over the years, the crypto space has witnessed the birth of more wrapped tokens, like wETH (wrapped ETHER), wBNB (wrapped BNB), wSOL (wrapped Solana), and many others.\n\nThe Genesis of these Versed Tokens\n\nThe concept of wrapped tokens took shape around October 2018, with wBTC launching on January 31, 2019, from a collaboration between Kyber Network and BitGo. This marked a pivotal moment in blockchain history, as it allowed Bitcoin holders to ‘wrap’ their coins and use them in Ethereum’s vibrant DeFi ecosystem.\n\nWrapped Tokens vs Regular Tokens\n\nWrapped and normal tokens are clearly distinct from each other – especially in terms of interoperaberability.\n\nWrapped tokens can be used on multiple blockchains. They’re like a passport that lets a token travel and be accepted in different crypto countries.\n\nRegular tokens usually stick to their own blockchain. It’s like having money that can only be spent in the country where it was made.\n\nPurpose:\n\nWrapped tokens are ceated to represent another asset on a different blockchain, allowing that asset to be used in new ways.\n\nRegular tokens serve various purposes on their native blockchain, like voting, paying fees, or buying services.\n\nCreation Process:\n\nWrapped tokens are made through a process called “wrapping,” which involves locking up the original asset and issuing a new token on a different blockchain.\n\nRegular tokens are directly issued on their native blockchain without needing to be wrapped.\n\nMarket Participation:\n\nWrapped tokens enable participation in decentralised finance (DeFi) on blockchains where the original asset couldn’t normally operate.\n\nWith regular tokens, participation is limited to their native blockchain ecosystem.\n\nSecurity and Trust:\n\nWrapped tokens require trust in the custodian or smart contract that holds the original asset.\n\nWith regular tokens, security and trust are based on the underlying blockchain’s protocol.\n\nWrapped tokens provide seamless interoperability between blockchains thanks to Ethereum, but what do wrapped tokens like Zcash mean for crypto investors? https://t.co/NWnrasw4Cb — Cointelegraph (@Cointelegraph) October 26, 2019\n\nControversies and Challenges\n\nWrapped tokens aren’t without their drama. They’ve faced criticism for potential security holes and for giving too much control to the few custodians who hold the keys to the wrapping process. These risks must be carefully managed to maintain the integrity of wrapped tokens.\n\nWrapped tokens are poised to play a transformative role in the future of blockchain technology and DeFi. They offer a glimpse into a world where the barriers between different cryptocurrencies are dissolved, paving the way for a more fluid and interconnected digital economy.\n\nAs we look to the future, these digital chameleons will likely play a pivotal role in the evolution of blockchain technology and finance.\n\nAuthor: Ayanfe Fakunle\n\nThe editorial team at #DisruptionBanking has taken all precautions to ensure that no persons or organisations have been adversely affected or offered any sort of financial advice in this article. This article is most definitely not financial advice."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxQbWMtM0Y5QV9sUURhS01vNDVhMlIzWmdjSE9BUzJDYmF5OFRXM1QwNFcyUEJYY2hHc3dIYjhkWVItcUw4Sl9tRlVpUXJyZTFtaEJDUFlPSmMyZXJCZFJDRzNFT082bkNhRlNXSU5EWWhhSlBwTFdUbnJFeExhTGh2RmE1TjVSaDFXZzdxNHcxb29SVGFqby1aYl9KN0NfUnRZMXRiSlBORDJqUzl5elJsNUM0MXp0elRkTGIwUDllQ09LQnhwRGpqUmhRYWo3M0hZaGhBTk9YUEhoelJva3dtZkVwTzVWNkJzazVfaC0yUF_SAfYBQVVfeXFMT29lZkZYN1RFQUhyUVFNTGhpU3dJT2tpdDhKa1ExNy16U05qMHZ1aDNVMXU4UFdpai1leWRQYnRfcWNROTZfY2x4OURPeFc0WDg3QlVJSDVEbXVBaXJ2MmdSWDluVFdPQXBFdlM5LVVqbWhDWEd4QUlLdllsR0pJTlYxdld2aTBWLUhPRjJtS3g4R18wb3owV3JGTm1pODhyenNTQXFGYXduRUNLR1JZTjY2NUVNcGgwUGduN280NDB3Tmo1VFEzWUpfU3FwVkw3dXhVejJDQUJISHlWZFJycEt1V2RudF90c2tWVUdYU3B6RmxZY3Bn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Crosses $73,000, Ethereum Dips Below $4,000 - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, managed to rise above the $73,000 mark early Thursday, as the BTC exchange-traded funds keep fuelling excitement among investors. Ethereum (ETH), which was on a roll due to the Dencun Upgrade, dropped below the $4,000 mark after the upgrade went live last night. It remains to be seen how ETH manages to recover. Other popular altcoins — including the likes of Dogecoin (DOGE), Ripple (XRP), Solana (SOL), and Litecoin (LTC) — saw a mix of minor dips and gains across the board. Memecoin dogwifhat (WIF) became the biggest gainer, with a 24-hour jump of over 32 percent. NEAR Protocol (NEAR), on the other hand, turned out to be the biggest loser, with a 24-hour dip of over 7 percent.\n\nThe global crypto market cap stood at $2.77 trillion at the time of writing, registering a 24-hour gain of 1.43 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $73,505.47, registering a 24-hour gain of 2.02 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 63.10 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $3,991.25, marking a 24-hour dip of 1.08 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 3.45 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour gain of 9.84 percent, as per CoinMarketCap data, currently priced at $0.1712. As per WazirX, Dogecoin price in India stood at Rs 15.95.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour dip of 2.07 percent. At the time of writing, it was trading at $96.01. LTC price in India stood at Rs 8,349.99.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.6836, seeing a 24-hour dip of 1.67 percent. As per WazirX, Ripple price stood at Rs 59.38.\n\nSolana (SOL) Price Today\n\nSolana price stood at $166.45, marking a 24-hour gain of 11.55 percent. As per WazirX, SOL price in India stood at Rs 14,300.\n\nTop Crypto Gainers Today (March 14)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\ndogwifhat (WIF)\n\nPrice: $2.91\n\n24-hour gain: 32.03 percent\n\nJupiter (JUP)\n\nPrice: $0.9458\n\n24-hour gain: 17.36 percent\n\nBonk (BONK)\n\nPrice: $0.00003442\n\n24-hour gain: 17 percent\n\nPancakeswap (CAKE)\n\nPrice: $4.93\n\n24-hour gain: 15.51 percent\n\nPepe (PEPE)\n\nPrice: $0.00001017\n\n24-hour gain: 15.43 percent\n\nTop Crypto Losers Today (March 14)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nNEAR Protocol (NEAR)\n\nPrice: $7.84\n\n24-hour loss: 7.11 percent\n\nToncoin (TON)\n\nPrice: $4.09\n\n24-hour loss: 6.62 percent\n\nSei (SEI)\n\nPrice: $0.8787\n\n24-hour loss: 6.08 percent\n\nBittensor (TAO)\n\nPrice: $639.42\n\n24-hour loss: 5.80 percent\n\nWEMIX (WEMIX)\n\nPrice: $3.28\n\n24-hour loss: 4.95 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin has skyrocketed to $73,000, registering a 47% surge over the last month and 199% increase over the past year. This upward momentum is credited to the growing interest in Bitcoin spot ETFs and the impending Bitcoin halving event, which historically triggers significant price movements. There has been a steady increase in mainstream acceptance and investments from both retail and institutional investors following the approval of Bitcoin spot ETFs. Now that Bitcoin has breached the $73,000 threshold, the market eyes at the $76,000 level. BlackRock's Bitcoin ETF has rapidly outpaced MicroStrategy in accumulating Bitcoins, accumulating nearly 204,000 BTC within just two months of its launch, indicating a surge in demand. Blackrock's Bitcoin holdings now stand at over $14.76 billion in assets under management.”\n\nCoinSwitch Markets Desk noted, “The global crypto market cap has reached $2.77 trillion, marking a 1.69% increase from yesterday. With another day of BTC hitting all-time highs, the fear and greed index has now moved into the extreme greed category, meaning a correction is due and sooner or later the bears are going to have a good day at the market. However, with bulls having full control of the market currently, top altcoins namely BNB and SOL have been competing for the fourth largest crypto after BTC, ETH and USDT. Yesterday the ETH Dencun upgrade went live, which will have a positive impact on layer 2 gas fee transactions. Though MATIC reached its highest price in more than a year - similar price action was not visible in OP and ARB.”\n\nRajagopal Menon, Vice President, WazirX, said, “Bitcoin (BTC) continues its upward trajectory, hitting new all-time highs amid rapid buy-ups after each dip. However, analysts suggest a cooling phase may be on the horizon as BTC has nearly doubled in price since late January without significant pullbacks. Negative bearish divergence on the 4-hour chart's relative strength index (RSI) hints at potential lower prices. Meme coins' soaring values indicate a possible pullback, with BTC trading around $73,192, up 1.40% in the last 24 hours.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “On March 13, Bitcoin jumped to around $73,000, supported by a solid base with a pivot point at $70,013 and resistance levels between $73,824 and $79,904. Key support levels at $67,154, $64,861 and $62,192 offer a safety net against potential downside. Technical indicators, including the relative strength index (RSI) of 71 and the 50-day exponential moving average (EMA) at 68,547, indicate strong buying interest, reinforced by bullish candlestick patterns. A break above $72,000 could sustain the bullish trend, while a break below could prompt a re-evaluation. However, caution is advised if the price drops below $72,000, potentially signalling a shift in trend despite the current optimism.”\n\nShivam Thakral, CEO of BuyUcoin, said, “Bitcoin continues to rally after a week of record spot ETF net inflows of $1.1 billion. MicroStrategy which recently bought $821.7 million worth of bitcoin, is now raising $500 million more to buy additional Bitcoin.This price action reflects strong institutional buying and new ATHs don't take much time unlike earlier. $74,000 is the next price level to watch before it eventually hits 100,000.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE1ndWQ1RHNiS0hhMjAzNXlsazlFTXFIU2xjSldLbWd6Vjk3emVaYmNHdDJsTjI3YnhIMUIwYzNlQVB0Qmd1eHdUNGxrd1JvcVFROXdzbWdZdzQtTkNnUUx1Z1VjVdIBZ0FVX3lxTE8wQW95ZzBZQUZVYktXa3dUNXFUZnc2WkFiTVBvMF9weVVLeVp3MzRMV1NwcTBmQmtjTFRRLUllRXdXby1iLXRucGkxa2lXWGRGeXp6M1AzMmJmMVZGeGI2bTNXNi0xSEU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Staking Explained: Is ETH Staking Worth It? - CoinCodex",
        "content": "Yes, Ethereum staking is worth it for most holders. Staking earns you rewards and contributes to the security and functionality of the Ethereum network. If you want to stake ETH as a solo staker you need 32 ETH, which is a high bar for most holders. However, liquid staking solutions allow users to stake much smaller amounts and generate virtually the same rewards.\n\nIn September 2022, the Ethereum blockchain received its biggest upgrade to date. The Merge upgrade moved Ethereum from Proof-of-Work over to Proof-of-Stake. The transition to Proof-of-Stake has made the Ethereum much more environmentally friendly and also laid the foundation for future upgrades, which will significantly improve the scalability of the network.\n\nWith the introduction of Proof-of-Stake on Ethereum, ETH holders now have the opportunity to stake their coins and earn staking rewards in the form of additional ETH. In this article, we’ll explain Ethereum staking and present the different options ETH holders have when it comes to earning staking rewards.\n\nKey highlights: The Ethereum network transitioned to a Proof-of-Stake consensus mechanism in September of 2021.\n\nThis means that ETH holders can now stake their ETH to provide additional security to the network and earn rewards.\n\nIf you want to run your own validator, you need 32 ETH.\n\nIf you don't have 32 ETH, you can still earn staking rewards. You can use liquid staking protocols such as Lido or stake your ETH with the help of a crypto exchange.\n\nWhat is Ethereum staking?\n\nEthereum now uses a Proof-of-Stake consensus mechanism, in which validators stake ETH in exchange for participating in the consensus process. Validators are rewarded for adding new blocks to the Ethereum blockchain and for checking that blocks proposed by other validators follow the protocol’s rules.\n\nValidators who are reliable and act in the best interests of the network receive ETH as a reward. At the time of writing, validators on Ethereum are earning an APR (annual percentage rate) of about 4%. If you’re investing in Ethereum and don’t plan to sell in the short term, staking ETH is certainly worth considering to passively grow your ETH holdings.\n\nThe rewards earned by each validator depend on the total number of validators that are active on the Ethereum network, as well as network activity (more activity means more potential income from transaction fees).\n\nThe catch is that validators who are not reliable or are found to be breaking the rules are punished by having a portion or the entirety of their ETH stake taken away.\n\nShould I stake my Ethereum?\n\nThere's little reason not to stake Ethereum if you plan on holding ETH for an extended period of time. While the rewards for staking are not enormous, they can still add up over time and increase your holdings. At the time of writing, ETH is trading at $3,700. With an expected APR of 3.5% for staking, a single ETH would generate 0.035 ETH in rewards over 1 year ($129.5 at current market rates).\n\nIt's worth noting that Ethereum staking does have certain drawbacks. For one, you cannot withdraw your ETH immediately. This can be detrimental if you decide you'd like to sell ETH quickly, as you will typically have to wait a couple of hours up to a couple of days for your ETH to be unstaked (also known as a \"cooldown period\"). The cooldown period is different between different protocols and platforms.\n\nAnother potential drawback, which impacts liquid staking protocols exclusively, is the fact that the token you receive in exchange for your staked ETH (for example, stETH on Lido), can drop in value relative to Ethereum. This means that if you want to convert your stETH back to ETH to claim rewards and unstake ETH, you might be selling at a loss. However, this rarely occurs and is only really a concern during periods of extreme bearish activity.\n\nstETH (a liquid staking ETH derivative by Lido) is, for all intents and purposes, pegged to the value of ETH.\n\nWho can stake ETH?\n\nIn order to launch your own validator, you need to have 32 ETH. At the time of writing, this translates to about $57,000, so it’s definitely not accessible to everyone from a financial perspective.\n\nHowever, the good news is that there are still ways to earn staking rewards with your ETH, even if you don’t have the 32 ETH required to launch your own validator. We’ll discuss the different ways to stake ETH a bit further in the article below.\n\nInitially, staked ETH coins could not be withdrawn. However, this was changed with the Shapella upgrade in April of 2023, which gave users the ability to withdraw their staked coins.\n\nWhere to stake ETH?\n\nThere are four distinct options for ETH holders who want to stake their ETH and earn staking rewards.\n\nSolo staking\n\nStaking as a service\n\nStaking pools\n\nStaking through crypto exchanges\n\nHowever, solo staking and staking as a service are limited to those that have at least 32 ETH.\n\nDo you have 32 ETH to stake?\n\nIf you have 32 or more ETH to stake, you can access solo staking or staking as a service solution. Of course, you can also use other ways of staking ETH that are also available to users who have less than 32 ETH to stake.\n\nSolo staking\n\nSolo staking involves launching your own Ethereum validator and maintaining it yourself. Each validator you run requires a stake of 32 ETH.\n\nWhen you’re solo staking, you’re directly participating in the consensus process of the Ethereum blockchain and contribute to the network’s decentralization. In addition, you remain in full control of your private keys and receive full staking rewards directly from the Ethereum protocol. This is why the Ethereum Foundation describes solo staking as the “gold standard” for Ethereum staking.\n\nWhile solo staking certainly has a lot of benefits, it is the least accessible way to stake ETH for the average person. The most obvious barrier to entry is that you need at least 32 ETH, which is simply out of reach for most Ethereum investors. Operating a validator also requires some technical expertise, and you need to ensure that your validator stays online continuously to avoid inactivity penalties.\n\nStaking as a service\n\nThere are various staking as a service providers that offer to manage one or more Ethereum validators on your behalf. When using these services, you’re required to provide ETH (32 ETH per validator). In most cases, you get to keep control of your private keys, which is a plus.\n\nOf course, staking as a service providers need some form of compensation for operating validator nodes on your behalf. So, while your validators will be earning ETH staking rewards directly from the Ethereum protocol, you will have to pay a fee to the service provider to keep your validators up and running.\n\nSo, staking as a service can be a good option if you have the sufficient amount of ETH to have your own validators but don’t want to deal with the technical aspects of setting up a node and keeping it operational.\n\nOverall, your returns will be slightly lower than what you’d get with solo staking, as you’ll have to pay a fee to the provider. Some examples of staking as a service providers are BloxStaking and Abyss Finance.\n\nDo you have less than 32 ETH to stake?\n\nIf you don't have 32 ETH to stake, you can't engage in solo staking, but there are other options available to you.\n\nStaking pools\n\nStaking pools take ETH deposits from multiple users and pool them together to launch Ethereum validators. This makes it possible for anyone to stake their ETH, even if they don’t have 32 ETH themselves.\n\nStaking pools are a very popular way of staking Ethereum, and many of them offer liquid staking, which is a very handy feature. Here are two examples of the top two Ethereum staking pools available today.\n\nLido\n\nLido is a liquid staking solution that supports multiple blockchains, including Ethereum. Lido is the most popular way to stake Ethereum. At the time of writing, over 30% of all ETH was staked through Lido.\n\nAfter staking your ETH through Lido, you will receive an equivalent amount of stETH tokens, which represent your staked ETH and any accrued rewards. These stETH tokens can be used in DeFi protocols or even sold if you need liquidity.\n\nHowever, you should keep in mind that the stETH to ETH exchange rate is usually skewed in favor of ETH, so you will likely receive a bit less than 1 ETH for each stETH you sell. Of course, you are also able to redeem your stETH for staked ETH on a 1:1 basis.\n\nRocket Pool\n\nRocket Pool is also a liquid staking solution that allows users to stake smaller amounts of ETH. The minimum amount of ETH that can be staked through Rocket Pool is 0.01 ETH, which makes the service highly accessible.\n\nWhen you stake ETH through Rocket Pool, your staked coins and accrued rewards are represented with rETH tokens. Similarly to stETH, you can use rETH in any way you please. rETH holders can redeem their tokens for ETH on a 1:1 basis.\n\nOverall, staking pools are a good option for anyone who’s looking to earn Ethereum staking rewards but has less than 32 ETH to stake.\n\nCrypto exchanges\n\nMany cryptocurrency exchanges offer Ethereum staking services to their users. For example, you can stake your Ethereum on Binance, which is a solid option since you will be able to retain liquidity thanks to BETH, a token that represents ETH staked through Binance.\n\nWhen staking through an exchange, you deposit ETH to the exchange. The exchange then pools together ETH from multiple users to deploy Ethereum validators. The rewards earned by these validators are then distributed to the users who staked their ETH, but the exchange will typically take a cut from the rewards as a fee for the service they provide.\n\nStaking through exchanges is probably the most convenient way to earn Ethereum staking rewards, but it also requires the most trust. When you deposit your ETH to a centralized crypto exchange, you have to trust that they will manage your funds responsibly. In addition, there could be a negative impact to the decentralization of Ethereum if exchanges control a large number of validators.\n\nComparison of Ethereum staking methods\n\nNow that we’ve briefly explained each different Ethereum staking method, let’s do a quick comparison of their pros and cons.\n\nMinimum amount Pros Cons Solo staking 32 ETH Full control over staking setup\n\nReceive full rewards\n\nContributes most to decentralization High barrier to entry\n\nRequires technical knowledge Staking as a service 32 ETH Much simpler than solo staking\n\nKeep control of keys required to withdraw or transfer staked ETH Service providers take a fee\n\nHigh barrier to entry Staking pools Small (0.01 ETH or less) You can stake smaller amounts of ETH\n\nMany staking pools offer liquidity tokens\n\nNon-custodial options available Smart contract risks\n\nLiquidity token price fluctuations Crypto exchanges Small (0.01 ETH or less) Very convenient way of staking ETH\n\nMany exchanges offer liquid staking options Requires trust in the exchange\n\nExchange takes a cut of the rewards\n\nCentralization risks\n\nEthereum \"restaking\"\n\nRecently, the concept of Ethereum \"restaking\" has started to gain traction in the crypto community. Through protocols such as EigenLayer, users who own staked ETH can choose to \"restake\" their coins to help provide security to applications that function on top of the Ethereum network. Essentially, this means that staked ETH can be used to validate networks and services other than the Ethereum mainnet, allowing users to earn additional rewards on top of the standard ETH staking yield.\n\nCurrently, the most popular Ethereum restaking protocol is EigenLayer, which supports restaking both for ETH as well as liquid staking tokens such as stETH and rETH. Please keep in mind that restaking is a relatively new concept and doesn't have a long track record in real-world conditions. If you're using a protocol such as EigenLayer to restake your ETH, you could be taking on substantially more risk than if you just kept your coins staked normally.\n\nThe bottom line—ETH staking is a good choice for long-term holders\n\nEthereum staking is worth it if you’re an ETH holder and plan to hold your coins over the long term. This is already the position of many ETH holders, as Ethereum is widely perceived as one of the best cryptocurrencies to hold for the long term. Before deciding whether staking is right for you, make sure to check the current ETH staking rewards to see what kind of APR to expect.\n\nIf you’re also interested in cryptocurrencies other than Ethereum, check out our list of the best cryptocurrencies to buy right now."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNc09VcHdxbXI5VjhhVktldjZKRFpKTlZEeTN0dXVsUWQtazBMQlZNdmpZRDk5eHo2U2hjekN6aE9YSEoyaGo2SVE3ZlFoakx6cWV3d0ZGWmp3ZDFvMUZYc1ZocUNMSnk1VC12aGZxS29VZDhkc191Znk4VEY2RkFGYmZaQVpRSVhqMExjZ1BsREJxWnBrQXNkdk1sd9IBoAFBVV95cUxORTY3SFR2czFyb3NNZDE5aXdoSk9hR2tzbHZjRTJyTjYyUUZ4UHVrM1ZXcmtSTEUwYm1NVXRiZ1V5ZXBzdDZpaFlmbDg2bHFmbXpaQnM0Q1VYUk9oaTVrTFdhMmo2Znk5WnNaVDBGa012WjNGb1B4cnZ6VXh3clQyNEpndVk0Q0FNMXhpNE1YcExzanRaT1plNm9LRm5YX1JE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 10:52:17 GMT",
        "title": "Euphoria Or False Dawn? Why The Ethereum $4,000 Party Might End Soon - NewsBTC",
        "content": "Ethereum (ETH) experienced a euphoric surge in interest as bullish sentiment enveloped the crypto sector. The recent approval of the Bitcoin ETF served as a catalyst, propelling Ethereum’s price to new heights. However, as the thrilling ride continues, concerns are emerging regarding the sustainability of this upward trajectory.\n\nRelated Reading\n\nIncreased Demand For Put Options Fuels Market Correction Jitters\n\nInvestors are flexing their risk management muscles as they flock towards put options, seeking to protect their gains from potential losses. The mounting demand for these safeguards indicates a shift in sentiment towards a more cautious and bearish outlook for Ethereum. With significant leverage in the market, speculators are wary of a potential correction that could dampen the party atmosphere.\n\nDencun Upgrade Looms: Anxiety Surrounds Ethereum’s Future\n\nAll eyes are on the upcoming Dencun upgrade, set to revolutionize the Ethereum ecosystem. However, the anxiety surrounding this crucial development is palpable. Past upgrades, such as the ill-fated Merge update, which aimed to transition Ethereum to a Proof of Stake network, resulted in a massive correction. As anticipation builds, the market braces itself for the impact this upgrade could have on Ethereum’s price and sentiment.\n\nInflux Of Funds Bolsters Market, Ethereum ETF Remains A Wild Card\n\nAmidst the uncertainties, the crypto market experiences an awe-inspiring influx of approximately $83 billion, with Bitcoin and Ethereum accounting for a staggering $75 billion of that total.\n\nThis considerable investment, as revealed by popular crypto analyst Ali Martinez, signifies growing interest and confidence in digital assets. The influx of funds further bolsters the market, while the uncertain approval of an Ethereum ETF continues to be a wild card that could reshape Ethereum’s future.\n\nEther market cap currently at $477 billion. Chart: TradingView.com\n\nEthereum’s Price Soars, Traders Eyeing New Milestones\n\nAs the rollercoaster ride continues, Ethereum’s price skyrockets, surpassing $4,000 and igniting the imagination of traders. The sentiment surrounding the Dencun hard fork upgrade is a driving force behind this surge.\n\nWith expectations set high, traders are eagerly eyeing a monumental milestone of $5,000 post-upgrade. The reduction in transaction fees promised by the upgrade further fuels optimism among ETH enthusiasts.\n\nNavigating Uncertainty: A Balancing Act For Ethereum’s Future\n\nIn the midst of this thrilling ride, Ethereum finds itself caught in a delicate balancing act. The uncertainty surrounding the approval of Ethereum ETF applications adds an additional layer of complexity to the market dynamics.\n\nWhile the odds may have dropped, the impact of an ETF approval, as highlighted by Ali Martinez, cannot be underestimated. It could potentially propel Ethereum’s adoption and trigger a surge in price.\n\nSource: Santiment\n\nMeanwhile, new addresses were still becoming interested in Ether. Alongside that, the overall count of holders who were amassing ETH had also increased."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPSUd5T2VUUWdiMXY4U2VkY1h2N3laZTBtVkRuWUpMRjJ1TmJCNnQtMURjclVzUGM2dTBKa0RXVVVBdnZfdkhjN0trNi1TQTdOWEMxTXBLMWdlckFqckZEQ1lONzlXQllBSDRZS3FDWnU5NHNva1otdWlVNjI1SlRWUjJHUE1HWThmbTczY19tLUgxSWpVNElmOTF3cE10ekdYTlZpcFQ4d2NxZ19B0gGyAUFVX3lxTE11WTk2aDJ0WHBoU1NrcDlvZmViRnpQWWtQZjgwOTd1ZEdRaUxnY0h1YXpfb3AxekhRRFp6c1BwRDFEVUhSOUhfZGkxLTNwelBsMkx1NEZRMXJFeFhscjBSOTBOR014VTk5RzhhcmY1UExGN3dveVhBaWtyZU51TEJtYXBkUnU5YzJnSlQzRnRJZ3RzQ2JyMTN2S0paYnFld08xVmZKaENZd1BsbTVKd1dMZUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Grayscale Submits Revised Application For Ethereum Spot ETF – What’s New? - NewsBTC",
        "content": "Asset management firm Grayscale Investments has updated its application for an Ethereum spot ETF (exchange-traded fund) with the United States Securities and Exchange Commission (SEC).\n\nEthereum Spot ETF Case Just As Solid As Bitcoin’s, Grayscale Argues\n\nAccording to a recent post on X by Craig Salm, Grayscale’s chief legal officer, the asset management firm has revised its 19b-4 form for an Ether spot ETF. Salm claimed that this move was “important” in an effort for Grayscale to list and trade shares of its Ether Trust on the New York Stock Exchange (NYSE) Arca.\n\nThe chief legal officer stated in his post that investors “want and deserve access” to Ethereum via a spot exchange-traded product, likening the situation to the Bitcoin ETF story. “We believe the case is just as strong as it was for spot Bitcoin ETFs,” Salm said.\n\nRelated Reading\n\nThe asset manager is amongst the numerous firms looking to issue the first Ethereum spot ETF in the United States, having filed an application with the SEC on October 10, 2023. However, these ETF applications have faced delays multiple times, with the most recent coming against BlackRock’s filing on March 4, 2024.\n\nAs a result, the likelihood of the SEC approving an Ethereum spot ETF has taken a nosedive in recent weeks. Once-optimistic Bloomberg ETF expert Balchunas even revealed in his latest analysis that the ETH funds now have only a 35% chance of approval.\n\nSEC Chairman Faces Pressure Over Crypto Approval\n\nTwo US senators of the Democrat party, Sens. Laphonza Butler of California and Jack Reed of Rhode Island, have urged the SEC chairman to avoid approving crypto investment products. In a letter dated March 11, the lawmakers, who are also members of the Senate Banking Committee, asked the Commission to limit future crypto ETF applications.\n\nThe success of the BTC spot products clearly ruffling some feathers on the Hill. @SenatorJackReed and @Senlaphonza write to the @SECGov urging:\n\n-no further ETPs for other tokens\n\n-make life difficult (i.e. examinations/reviews) for brokers and advisers that recommend BTC ETPs pic.twitter.com/enxdumC02N — Alexander Grieve (@AlexanderGrieve) March 14, 2024\n\nFollowing the approval of 11 Bitcoin spot ETFs in January, the attention of the crypto public has somewhat turned to whether the SEC will do the same for the Ethereum versions. However, this latest letter from the senate seems to further hurt the chances of an ETH ETF approval.\n\nRelated Reading\n\nAltcoins Fall: Will Ethereum And Solana Bulls Surpass Expectations? 6 months ago\n\nA part of the letter read:\n\nRetail investors would face enormous risks from ETPs referencing thinly traded cryptocurrencies or cryptocurrencies whose prices are especially susceptible to pump-and-dump or other fraudulent schemes,” they said. “The Commission is under no obligation to approve such products, and given the risk, it should not do so.\n\nAs of this writing, the price of the Ethereum token stands at $3,731, reflecting a 1.2% increase in the past day.\n\nEthereum price on a deep correction on the daily timeframe | Source: ETHUSDT chart on TradingView\n\nFeatured image from The Economic Times, chart from TradingView"
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOdGNuNmhmbVU5bTNoc2lTZWZ2bnhKT19pRjdxbEM0X3IxQkU0bzRtcmJ6b3RtdjlxOUlkdnpzS1dmVDJ3aEJ6eDlNb1Fua21DM0lFa1hpYVRwZS1rSnFLb1FtaDl0cXFiVDh4a1RlcGNnREtwd2hCWTF6Z01WN21BZV8zVlc3QmttdDV4dTcwTTh1SEh3LWhFNl9mbW9SRzVuX0hCeV9SZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Vitalik Buterin's net worth revealed - Finbold - Finance in Bold",
        "content": "Vitalik Buterin, the co-founder of Ethereum and one of the most vocal advocates of cryptocurrency, has a significant portfolio comprised mainly of ETH tokens. In fact, during the bull market in 2021, he became the world’s youngest crypto billionaire. In the meanwhile, the price of ETH dropped significantly, but Vitalik Buterin’s wealth is still substantial. So, how much is Vitalik Buterin’s net worth today?\n\nVitalik Buterin and Ethereum\n\nTo better understand Vitalik Buterin’s net worth, we first have to delve deeper into his relationship with the world’s second most popular blockchain and cryptocurrency.\n\nVitalik Buterin, the creator of Ethereum.\n\nVitalik Buterin is the inventor and co-founder of Ethereum, a decentralized blockchain with an integrated smart contract functionality. Buterin first elaborated on the concept in a white paper in 2013, arguing that Bitcoin (back then, the sole relevant blockchain) lacked application development via an integrated scripting language.\n\nEthereum is a decentralized blockchain platform enabling smart contracts and supporting decentralized applications (DApps). It utilizes its crypto tokens called Ether (Bitcoin ( is a decentralized blockchain platform enabling smart contracts and supporting decentralized applications (DApps). It utilizes its crypto tokens called ETH ) to execute transactions and run smart contracts. Unlike BTC ), which emerged as an alternative currency, Ethereum primarily aims to support fully decentralized contracts and apps to simulate a global virtual computer.\n\nRecommended video: Vitalik Buterin explains Ethereum\n\nSource: Ethereum YouTube\n\nThe idea failed to take off initially, but the Ethereum white paper circulated, the interest grew, and it finally caught up at a Bitcoin conference in January 2014, where it was described as a global processing machine operating on a decentralized network with virtually limitless applications. Ultimately, the project was crowdfunded and launched on 30 July 2015.\n\nFun fact: Vitalik Buterin’s inspiration for decentralized money came from his Vitalik Buterin’s inspiration for decentralized money came from his World of Warcraft gaming experience. He stated that Blizzard removed the damage component from his beloved warlock’s Siphon Life spell one day. He cried himself to sleep, and on that day, he realized “what horrors centralized services can bring” and soon decided to quit.\n\nVitalik Buterin’s ETH portfolio\n\nIn 2014, before it was publicly launched, Ethereum conducted a pre-sale where people could acquire Ether by paying with Bitcoin. ETH’s initial token supply was over 72 million tokens, with 16.53% allocated to Vitalik Buterin and its other seven co-founders.\n\nThis initial batch of ETH is the source of most of his crypto portfolio and the most significant driver of Vitalik Buterin’s net worth. As of August 1, 2024, Vitalik Buterin holds 245,178 ETH tokens. As the current price of each token is $3,188.82, this makes Vitalik Buterin’s ETH portfolio total value equal to $781.83 million. In other words, Buterin’s total value in held Ether is a little over $780 million.\n\nVitalik Buterin claims he never held more than 0.9% of total supply of Ether, and that was at the end of 2015. According to Arkham Intelligence, as of December 2023, the inventor of Ethereum held 0.2% of total ETH supply.\n\nI never personally held more than ~0.9% of all ETH, and my net worth never came close to $1b. Also, I'm pretty sure there are no criminal laws against pre-mining. — vitalik.eth (@VitalikButerin) October 10, 2018\n\nSince nearly all of it comes from Ether, Vitalik Buterin’s net worth is highly dependent on the current price of the crypto coin. In November 2021, near ETH’s peak price, the native token went over the $4,635 mark, making Buterin’s net worth about $1.46 billion. Similarly, his future net worth will fluctuate according to the performance of his crypto invention.\n\nButerin’s portfolio includes a number of other crypto tokens, but their combined worth amounts to a fraction of his ETH wealth and does not change the total net worth by much. Significant sums include 869,509 Kyber Network Crystal (KNC) worth approximately $0.5 million, another 248,273 tokens or $0.85 million worth of WETH (WETH), about 250 trillion of Doge-Inu (DINU) worth $85,12, and small amounts sums of THE, USDC, INDSHIB, DOJO, and other tokens.\n\nButerin proposes radical innovations to boost Ethereum speed Although Ethereum has made significant advances over the years, it keeps lagging behind some of its competition – literally. Newer blockchains like Solana can generate blocks in 0.4 seconds, beating Ethereum’s 12 seconds many times over.\n\n\n\nTo address this, Buterin has proposed radical new solutions, including the “single-slot finality (SSF)” and “based pre-confirmations” that would provide guaranteed inclusion of the transaction in the next block for an additional fee. Buterin has emphasized the need to balance network speed and integrity, but if successful, the changes could transform the crypto industry, likely increasing Vitalik Buterin’s net worth in the process.\n\nVitalik Buterin’s non-crypto assets\n\nButerin was one of the earliest investors in StarkWare, an Israeli software tech company focused on cryptography, more precisely, zero-knowledge proof technology that focuses on blockchain scalability of the Ethereum platform. In May 2022, it was evaluated at $8 billion.\n\nAs there are few reliable sources and zero public data on Buterin’s assets, it is impossible to know for sure how much his non-crypto portfolio adds to his total net worth. Therefore, we will not take it into account when calculating Vitalik Buterin’s net worth in this article.\n\nAbout Vitalik Buterin\n\nBorn in Russia in 1994 and raised in Canada, the father of Ethereum showed exceptional skill in arithmetics and coding since his earliest years. He was the person to envisage how Ethereum should look and work and outlined the draft of its design in 2014, and the blockchain went live in 2015.\n\nRecommended video: Vitalik Buterin On Creating One Of The World’s Largest Cryptocurrencies\n\nSource: Business Insider YouTube\n\nAs such, Ethereum expanded the capabilities of a blockchain from mere financial assets to a range of diverse functionalities in finance, gaming, decentralized finance (DeFi), and more. He has built a legacy of innovative thinking and decentralization advocacy, winning respect within the crypto and wider technology community.\n\nVitalik Buterin’s net worth: the bottom line\n\nThe single asset that makes Vitalik Buterin wealthy is his stake in Ethereum, or the number of ETH tokens he holds and their combined value. At the moment, it is about $781.83 million, but the sum fluctuated wildly, going as high as $1.6 billion in November 2021 and as low as less than $300 million in June 2022.\n\nAs it is, Vitalik seems dedicated to tying his net worth to his pet project, binding his financial fate to the success of the Ethereum blockchain and the associated cryptocurrency. We can only wait and see how it goes in time, but it does mean one thing: the great crypto inventor truly cares about the project, inspiring and reassuring many crypto investors willing to bet on their share of ETH.\n\nFAQs about Vitalik Buterin net worth\n\nHow much is Vitalik Buterin's net worth? The vast majority (almost 99%) of Vitalik Buterin’s net worth comes from the value of ETH. His 245,178 ETH tokens are valued at $781.83 million as of August 1, 2024.\n\nWho is the largest owner of Ethereum? The single largest owner of Ethereum is Vitalik Buterin, with 245,178 ETH held in his crypto wallet as of August 1, 2024.\n\nDoes Vitalik Buterin own crypto other than ETH? Yes, Vitalik Buterin owns other tokens, such as WETH, STRK, KNC, and SDOG. However, almost 99% of his crypto portfolio’s worth is derived from Ethereum.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxObjBrdEFFWl91Y2ZkMmctQzZkZk9qc1NLXzV3QmVMRllETnE3amllQ2F6NWMzTEx3a0d2ZFhJTXNud0RkQ3MxbFJoMWMzb2FGcU0tdlFlSlhGTEJEeUVWZW8yWHZPV0p3MnNCelhDOUJmUExuaVpfUDhuLTljNWczWU9JamNNdkEzSHZpQ1pRMDk1eEo1LVo4M1Vkc9IBoAFBVV95cUxPaUNwTVpSLS1HQ1p0LW9vWUdUcXM1S2VraGo3RHg5SVlJZmxqZGJpeEJYYWZKbnRWR1ltQkVXTlRpZ3FMTkgwUk5QdkJLU3ZUbkhwaklzYy1yQVlGX0RqMElmeXpPV2JiQUhBbTlpcm56VVlTQk1DOUpWdnpJSlVsZGRKZ2pWaVZlZUZaT2JJUWdCeklEM2pwWnV5NUhYalFh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Crypto Market Crash Today: Is This a Buying Opportunity? - Coinpedia Fintech News",
        "content": "Mustafa has been writing about Blockchain and crypto since many years. He has previous trading experience and has been working in the Fintech industry since 2017.\n\nStory Highlights Bitcoin price fell to $66,690 due to uncertainty around US Fed rate cuts and options expiry.\n\nJerome Powell's testimony suggests Fed rate cuts depend on economic data.\n\nOver $3 billion in Bitcoin and Ethereum options expired on March 15th.\n\nBitcoin, the leading digital currency, experienced a sudden drop, falling to $66,690 within a single day. This decline dragged its market value down to $1.30 trillion, while its trading volume surged to $78.6 billion, making it a rough ride for investors.\n\nThe global cryptocurrency market cap mirrored Bitcoin’s fall, dropping over 7% to $2.55 trillion. Ethereum (ETH) took the biggest hit, losing over 9% of its value, along with other major players like BNB, XRP, and Litecoin (LTC). Even beloved meme coins, Dogecoin (DOGE) and Shiba Inu (SHIB), suffered a significant drop of more than 14%.\n\nWhat next?\n\nFederal Reserve’s Influence\n\nToday’s downturn is attributed to the possibility of a Fed rate cut. Federal Reserve Chair Jerome Powell’s recent testimony to Congress hinted at potential rate cuts, depending on new economic data such as inflation and job figures.\n\nContrary to previous expectations, signs of increasing inflation and a recovering US economy suggest a delay in rate cuts until the year-end. This uncertainty has led to market volatility, with the US dollar index rising and global stock markets faltering.\n\nAdditionally, data from the CME FedWatch now suggests a 54% probability of a 25-bps rate cut in June and 47% odds of a similar cut in July.\n\nAlso Read: Kiyosaki Prefers Bitcoin to Gold and Silver for Its Unchanging Supply\n\nOptions Expiry: A Boost for Crypto\n\nThe expiration of options contracts on Friday injected life into the crypto market, with over $3 billion worth of Bitcoin and Ethereum options expiring on March 15th. Despite BTC briefly dropping to $66,770, it managed to stay above the maximum pain threshold, offering potential buying opportunities amid the downturn.\n\nSimilarly, the expiration of ETH options, valued at $1.24 billion, saw traders maintaining a bullish stance, with ETH bouncing back from a 24-hour low to trade at $3,748.\n\nWall Street’s Response\n\nThe US Spot Bitcoin ETF sector experienced a significant decline in inflows, dropping by 80.6% to $133 million on Thursday. This drop, the largest observed in eight trading days, coincided with a downturn in Wall Street sentiment following recent economic data releases.\n\nInvestors responded by withdrawing holdings from Grayscale’s GBTC, possibly influenced by market signals like the pre-halving market peak and declines in gold and equity markets. GBTC recorded an outflow of $257.1 million on Thursday, underscoring the prevailing market sentiment.\n\nRead More: Bitcoin ETF Market Heats Up as Blackrock IBIT Surpasses 200,000 BTC\n\nIt’s Been a Rocky Journey\n\nA recent liquidity flush in the crypto market resulted in a substantial loss of over $821 million in market value. Despite this, more than 247.8K traders liquidated their positions within 24 hours. Notably, the largest single liquidation order involved a BTC-USDT swap valued at $13.30 million on the OKX exchange.\n\nWhile Bitcoin and Ethereum bore the brunt of these liquidations, totaling over $279 million and $137 million respectively, some analysts view this as an opportunity to buy in at a lower price, anticipating a potential market rebound."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE1DXzhnWFJvRE5QSHlxbTdfUVZwWW5XbEhrc1VmMnRxM09yaGpSZTVLTFE1WDVXN1NTb01qMTZ0X1J6d3hPT3dpVk1RLVpwMGxQWjhvZjhPbHltXzJVemdJZk02bklnWUhfeFdXQnhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Ethereum’s L2s Sees Over 50% Fees Reduction Following Dencun Upgrade - Coinfomania",
        "content": "Ethereum-based project, OMG Network (formerly known as OmiseGo) announced today that it has finally launched to mainnet its solution that scales Ethereum to thousands of transactions per second while simultaneously reducing transaction fees to one-third of the usual amount.\n\nOMG Network V1 Mainnet Beta, which has been in the works for three years employs the More Viable Plasma (MoreVP) specification to increase the processing capacity of Ethereum. The solution batches several transactions in a single block while charging a one-time fee.\n\nCommenting on the development, Vansa Chatkavanij, OMG Network CEO discussed how blockchain finally unlocked permissionless transactions for global ecommerce on the internet, with the Ethereum network already providing the security infrastructure for such transactions.\n\nChatkavanij added that the OMG platform will facilitate true global ecommerce, adopting the security of Ethereum while also allowing for transactions that are done at a fraction of the cost.\n\nAlongside the mainnet rollout, OMG Network also released a block explorer and a demo web wallet which allows users to enter the network.\n\nBitfinex launches USDT on OMG Network\n\nFollowing the rollout of OMG Network V1 Mainnet Beta, cryptocurrency trading platform, Bitfinex has integrated its Tether (USDT) stablecoin on the OMG network to reduce transaction times, make payments faster and also lower transaction fees.\n\nThe new integration builds on the recent usage of Ethereum and especially USDT for token exchange and will allow traders to take move their assets more quickly in the event of increased market volatility such as that witnessed in March.\n\nPaulo Arduino, Bitfinex CTO said in a release,\n\nBy migrating USDt value transfers to the OMG Network, we save costs, drive performance improvements, and relieve pressure on the root chain. This is good for Bitfinex, our users, and the entire Ethereum ecosystem.\n\nMeanwhile, news of OMG Network launching its Ethereum scalability solution follows a recent listing of the project’s token on leading cryptocurrency exchange, Coinbase, a period that saw the coin gain 25% within 24 hours."
    }
]