[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPZlBKVmNpM1pjTlEwV3NPZEZMcmZGWEJ2U2RsbHZ1ZDRLdENaMlpoUHFyekhycDdEMWhHazZwUUxvVlRHb0NCY3hGaFZrWjF4X2ZxT2lKajg3V0o5ZFBVeDZhbHJwa1RkQy1OdkpmNmZoTDVScDFhMXZ3RFVxdXZJaElZNTlaNmFRaF9zdU9JVFN5bXBVejhNMndMdVZRN2FwSWw5YXdfNXJ1UFdqa2lpcmdFY2VIM3ZPOVJFQmV6VG14aUV0R2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF Approval Expected in May, Standard Chartered Predicts - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPMExjMXA3N3BXQmNrdVBtTFRsZU84bjEtRGdSNzZGZXZlXzhzREVoTkEta1c2WVdWMXpGbjByR2ZyRWhkMGVnZmVILThvaW1sWGhFakFUZC1XVWFhRi1MaWR1RlYxWHpYQmdXczl1c2RWNHhmUFdxak44ZmoxVk1seg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "3 Cryptos to Buy Before the Coming Ethereum Upgrade - Yahoo Finance",
        "content": "Ethereum’s (ETH-USD) dominance as the leading smart contract and Web 3.0 platform is facing its most significant test yet. The upcoming Deneb/Cancun upgrade could once again revolutionize interest in this token. However, it’s also an upgrade that comes with some element of risk. Thus, it’s wise to align your portfolio to benefit from any potential impact of this upgrade, and do so in a way that limits your downside exposure.\n\nThe main feature of this upgrade is called proto-danksharding. In plain English, this scaling solution should make Ethereum layer 2 rollups much faster and cheaper to use. For those unaware, rollups move computation and data storage off the main Ethereum chain. However, these computations still retain the underlying security and decentralization Ethereum provides.\n\nProto-danksharding allows large blobs of transaction data to be stored briefly on the main chain, just long enough for validation, before getting passed along to rollups. This eliminates the need for expensive calldata that has previously congested the Ethereum network.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nWhile the upgrade could be a huge boost for many Web 3.0 projects built on smart contracts or reliant on transaction speeds, Web 3.0 assets remain highly speculative. As such, I only recommend allocating a small portion of your crypto portfolio to chase the upside in these tokens.\n\nWith that said, here are three cryptos to buy ahead of this major upgrade.\n\nEthereum (ETH-USD)\n\nCrypto currency etherium. ethereum coin on exchange charts. e-currency Ethereum. Ethereum price predictions\n\nSource: viktoryabov / Shutterstock.com\n\nAs the dominant smart contract and Web 3.0 ecosystem, Ethereum has the most to gain from its ambitious Deneb/Cancun upgrade. While the upgrade aims to solve Ethereum’s nagging fee issues, Vitalik Buterin has hinted that base gas costs may still rise, keeping prices high for end users. However, developers could have a field day with greatly-improved layer-2 efficiency. This might just be enough to retain developers into Ethereum’s orbit, rather than losing talent to rival chains like Solana (SOL-USD) or Avalanche (AVAX-USD).\n\nI remain adamantly bullish on Ethereum heading into the upgrade event. As a deflationary cryptocurrency, growing demand for Ethereum tokens fueled by Web3 apps should drive prices higher. And with Ethereum hosting most smart contract-based platforms, demand is likely to increase over time. Deneb/Cancun will be a definitive test of Ethereum’s technical prowess and its ability to meet user needs.\n\nBeyond the upgrade, there are some promising emergent use cases that could propel Ethereum adoption. Decentralized finance (DeFi) retains strong activity, decentralized autonomous organizations (DAOs) are on the rise, non-fungible tokens (NFTs) are transforming digital ownership and asset provenance, and even central banks are experimenting with the prospect of central bank digital currencies (CBDCs) on Ethereum. As both a crypto asset and a decentralized network powering Web3, Ethereum remains a top long-term buy.\n\nStory continues\n\nOptimism (OP-USD)\n\nCrypto coins on a phone screen showing stats for various cryptocurrencies.. Cryptos to Buy Before the Market Swing. rising meme cryptos. altcoins\n\nSource: Chinnapong / Shutterstock\n\nAs a leading layer-2 scaling solution utilizing optimistic rollups for Ethereum, Optimism (OP-USD) checks all the boxes as a top Deneb/Cancun speculative buy. The project aims to provide faster and cheaper transactions for Ethereum dApps like decentralized exchanges, gaming platforms, and social networks.\n\nImportantly, Optimism is EVM-compatible, meaning developers can deploy existing smart contracts on Optimism with minimal effort. While the network is currently live, supporting prominent apps like Uniswap (UNI-USD), Synthetix (SNX-USD), and Chainlink (LINK-USD), wider usage has been hampered by throughput constraints. This could change in a big way once Optimism leverages proto-danksharding and blobs to enhance its rollups.\n\nOptimism offers an encouraging early sign of its upgrade readiness. Its team recently implemented the Ecotone hard fork on the Optimism Goerli test network. This hard fork trial enabled batch submission via EIP-4844 blobs, verifying that Optimism will hit the ground running with blob support on mainnet post-upgrade.\n\nWith strong fundamentals and a 25% market share of total value locked in layer-2 platforms at over $5.4 billion, Optimism looks poised to capitalize on the greater efficiency unlocked by Deneb/Cancun. As rollup activity expands, Optimism could be one of the biggest beneficiaries of Ethereum’s push to scale.\n\n0xGasless (0XGAS-USD)\n\nA close-up shot of the concept for a cryptocurrency exchange page. Cryptos to Sell Before a Recession\n\nSource: PixieMe / Shutterstock.com\n\n0xGasless (0XGAS-USD) is a Web 3.0 project focused squarely on expanding Ethereum’s addressable market by eliminating gas fees. It’s a great choice for investors seeking outsized upside from higher Ethereum transaction volumes after the upgrade.\n\nAt the core of 0xGasless’ offering is support for ERC-4337 and account abstraction. This is a standard that replaces traditional externally owned accounts (EOAs) with smart contract wallets. These wallets feature built-in logic for transaction validation, authorization, and, crucially – gas payment. This shields users from managing seed phrases, paying volatile gas fees directly and losing funds to theft or mistakes.\n\n0xGasless also offers intriguing functionality that could hasten mainstream adoption. For example, users can deploy ERC-4337 smart contract wallets on the user-friendly Telegram platform. Additionally, a custom paymaster service enables gas fee payment using any ERC-20 token.\n\nProjects like 0xGasless building on account abstraction and user experience have asymmetric upside. The road to mass adoption starts by allowing users to easily access Ethereum applications without crypto’s usual harsh learning curve.\n\nOn Low-Capitalization and Low-Volume Cryptocurrencies: InvestorPlace does not regularly publish commentary about cryptocurrencies that have a market capitalization less than $100 million or trade with volume less than $100,000 each day. That’s because these “penny cryptos” are frequently the playground for scam artists and market manipulators. When we do publish commentary on a low-volume crypto that may be affected by our commentary, we ask that InvestorPlace.com’s writers disclose this fact and warn readers of the risks.\n\nRead More: How to Avoid Popular Cryptocurrency Scams\n\nOn the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nThe post 3 Cryptos to Buy Before the Coming Ethereum Upgrade appeared first on InvestorPlace."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNdkljdFBWYkMzUG1ES1Byd1lvUXdFeHAtTUEzOG5MSWJJYjRlWXRDbW9tUkg1TzFrWUI2ZU0xZVBXNTZfdnJONUc3VTZMeEJBOXd0MXUwY21CQlVxYzZNd09VYUdXQ2NLQjNVUTE4NlNxTmlFMGdEMFFEdGVUUlEtUnBVOF9kaVdYc1hkdWpGb3VEekxyRE9QbQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ethereum developer interest hit new all-time highs in 2023 despite a bear market - TechCrunch",
        "content": "The global web3 developer space grew in 2023, according to a new report, regardless of the ongoing bear crypto market and regulatory headwinds in the U.S.\n\nIt was especially a home run for Ethereum, one of the most well-known layer-1 blockchains. The blockchain saw software developer kit (SDK) installs increase 31% year over year to 106.4 million downloads in 2023, up from 81.4 million in 2022, according to Alchemy’s Web3 Development Report for 2023.\n\nThe total Ethereum SDK installs have increased consecutively over the past five years, the report said. The number included SDK packages like ethers, web3, hardhat, truffle, foundry, eth, alchemy-sdk, viem, userops and wagmi. In 2022, there was an overall increase in developer activity. A separate report by Electric Capital found that the number of monthly active crypto developers declined 25% last year.\n\n“It’s been great to see confirmation of the cliché that bear markets are for building,” Jason Windawi, protocol specialist at Alchemy, told TechCrunch+. “During the depths [of the downturn] it was easy to wonder if that’s true; we knew it was, but it’s good to have this data to show that.”\n\nThe global market capitalization of the crypto market rose 113.75% from roughly $800 billion at the beginning of 2023 to $1.71 trillion by the end of the year, according to CoinMarketCap data. The two biggest cryptocurrencies, Bitcoin and Ether, increased 166% and 90.75%, respectively, during the same time frame.\n\nEthereum is where the liquidity is and where a lot of developers start their journey, Windawi said. But it would be “foolish to count out other chains.”\n\nThe report also showed “clear growth” across layer-1 blockchain Solana. Solana’s total transfer volumes for decentralized exchanges, NFTs and USDC on the blockchain topped Ethereum in the fourth quarter of 2023, while memecoin hype brought its DEX volume over $9 billion. As for developers, Solana’s 2023 Hyperdrive hackathon had over 900 projects, an increase of 63% from its Riptide hackathon in 2022, the report stated.\n\nThere was also growth for Ethereum Virtual Machines (EVMs), which are basically computers that are focused on powering that blockchain. Some EVM-compatible blockchains like layer-1 blockchains Avalanche and BNB chain have their own networks that can deploy developers’ codes onto Ethereum. There’s also layer-2 blockchains built on top of Ethereum — like Polygon, Optimism and Arbitrum — that focus mainly on scaling the blockchain.\n\nThere were over 240 million smart contracts created by Ethereum-focused layer-2 blockchains, with 158.34 million created on Polygon alone, the report found.\n\nWhile the issue of scaling Ethereum isn’t fully solved, there have been huge strides toward it. “It’s been a major roadblock to scaling, and it’s been addressed aggressively [in the past] and will be more this year, too,” Windawi said.\n\nAnd as the data showed, it’s not just limited to Ethereum. “We’re seeing exciting projects using a lot of different stacks in compelling ways,” Windawi said. “Where developers are using tools and what kind of libraries they’re downloading doesn’t necessarily mean that’s where they end up [long term] or what they’re building.”\n\nA major theme for developers last year was also “account abstraction,” or ERC-4337, which was introduced in the third quarter to improve the crypto experience. To date, about 1.8 million deployments for account abstractions have transpired with over 53% happening in the fourth quarter of 2023, introducing new features like sponsoring blockchain gas fees for users or simplifying login steps, according to the report.\n\nMany people have argued that crypto’s onboarding process, or even using web3 dApps day in and day out, is not a friendly experience. Sometimes a person will have to pass through a handful of applications and approve even more transactions just to get one objective done.\n\nBut in order to make it simple, developers have to “get complex first” through the back end, to make the front end look as simple as possible, Windawi said. “Account abstraction is real; it’s coming and we’re excited to be a part of that.”\n\nNote: The report used the following sources for data collection: Alchemy’s data, Dune’s verified smart contracts, npmjs.com (SDK installations and metadata) and Coingeck for token prices."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNby1uN3dfdnMtRmhQVUpST3hZSS01WGE5dktCcEgxYXN1azdPYUZicWp2UFhqWlItV2tMQnl6RWlWVGJRRnBUWk5STHZ1RUY5LVRoTTZZWUZEM1RRdlNlTjE0Um8taC1JOTdYYzJnOXR1OWJQMlkxSlAyQkpRVTBjbUJNYmw2SFp6LWJWVGpmNlZFc0JkVXhTYW8yQ1YxNDBkRzEzV3o0cnlwWndiclBZN0ZJQi00NHhOUkVrTmlR0gHDAUFVX3lxTE9fMTNoUzM0NEFHaVluR01DM1Vzc2Y1am1lT1JCN0c2NTNLNThzSzg4eXY1MENJUjZGSjhyeGNubHR0Um5RRW1mUmstNmd2VXM4c294QXpJblNwQkMxdzdxQU1xY1VjMGVzMlhtTndmN0tSWUJNNy1TbUxMelNRR3BIcDAxMGFzcllZM2tyRkplT3Y5MXBFc2trRWJEbzRHbm55cVF4SUNXcnY5eGRIR2pFRkREbklxU08zYjVoLXdYUEU2dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Inside the 'Private Mempools' Where Ethereum Traders Hide From Front-Running Bots - CoinDesk",
        "content": "The thousands of validators that run Ethereum behind the scenes scoop those mempool transactions into blocks – usually with help from third-party \"block builders\" who organize them according to certain criteria, including how much they pay to validators in fees. Once they're added to a block, the transactions are officially written to the blockchain, where they are cemented permanently."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxQeWN2QUlUUkJkcHpFbzlVUGVzTUdvU3ZlWTloSU9XZjFPdEliZkszNXppWmNtZXllekQzaWt5YWJaX3NVYUlHdlMwZkF1Y3ZKQTJoSk51bEtxVkR2TzctNTl5YndJUDh1OHZoc1NJZVcxdS1oV1N0UEwtczExNDJKc2c0VkQ4eHVVN2tQV0JacHMzdmtqcU9LQzMtejNXNzA0cVJJaDlSSUY2MURUWFA3RU4wZ1QzN2hBdFZDRU10d3pKWW1uN2plX3BB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Ethereum could surge 70% if its own ETF gets approved in May, Standard Chartered says - Markets Insider",
        "content": "Ethereum could reach $4,000 ahead of a likely spot ETF approval in May, Standard Chartered wrote.\n\nThe SEC will probably handle the funds' approval similarly to how the bitcoin spot ETF was approached.\n\nBut unlike bitcoin, ethereum is less at risk of price downside after the ETFs' launch.\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Go to newsletter preferences Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAdvertisement\n\nEthereum's price could hit $4,000 before late May, if the token is able to secure its own spot exchange traded fund, Standard Chartered said on Tuesday.\n\nHead of FX Research Geoff Kendrick wrote in a note that this will likely happen, marking a 70% price upside from ethereum's current value.\n\n\"We expect pending applications for ETH US spot ETFs to be approved on 23 May, the final deadline for the first of the ETFs under consideration — the equivalent date to 10 January for BTC ETFs,\" he said.\n\nKendrick forecasts that the process will look similar to how the Securities and Exchange Commission handled the recent bitcoin spot ETF applications, which eventually led to the launch of 11 funds after months of regulatory pushback.\n\nAdvertisement\n\nIn theory, ethereum should follow bitcoin's performance in the run-up to the ETFs' approval. Originally, SEC delays first caused bitcoin to flatline, before Grayscale's court victory against the regulator sent the apex token rallying at the end of 2023.\n\nEthereum has already risen around 19% since Blackrock filed for an ETF on November 16. But that's a modest gain compared to what Kendrick says could happen in May, the final deadline date for VanEck and Ark21Shares' applications.\n\nStill, to reach the $4,000 price target, some conditions will have to be met.\n\nExpectations for the approval will have to be low, as happened ahead of the bitcoin ETF launch, Kendrick said. Market-side implications for an approval will also have to miss the mark — though some may worry that the SEC's stance that ethereum should be treated as a security could get in the way, the commission has already lost that argument in court, Kendrick outlined.\n\nAdvertisement\n\nFinally, a number of ETFs must be approved at the May deadline for ethereum to enjoy a boost.\n\nWhile the crypto's pre-ETF price action should resemble that of bitcoin, it's a different story once the funds are active.\n\nThough bitcoin jumped to an intra-day high of $49,000 on the ETFs' approval, it has since slid 6.7%. The surprising downside stems from massive outflows from Grayscale's fund, which previously functioned as a bitcoin trust.\n\nBut the Grayscale Ethereum Trust accounts for a much smaller market cap of the crypto than the bitcoin fund did.\n\nAdvertisement\n\n\"Grayscale ETH Trust's current market cap of USD 6bn is 2.2% of total ETH market cap, whereas the comparable share for BTC was 3.1% at the time of the ETF approval,\" Kendrick wrote.\n\nAnd while the failed crypto exchange FTX led the Grayscale bitcoin selloff, its holdings in the Ethereum Trust amount to just 0.05% of the token's market cap."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOVDMyOHhUX1BPQlJQT0hPNkJvQzlHLUE5bUZJc2pUd2MwUnBQajhaN3k1d3c1eW1LU0VycUIxRzFOMHZER285S0ZrY3BKMnIxaUljTzNNU0tNZVhhY2NjMUpHaG5RMTVlQ2tBUjF6cGdsb0tIa19oWEU0Ym0wSmVKNDVNT3hKUS1ic3dIeEJQVU5XZHZzejVROExqN3NPWHZncnNYaVV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Spot Ethereum ETFs Likely to Be Approved on May 23: Standard Chartered Bank - Unchained",
        "content": "The bank’s report also predicted ETH could hit $4,000 in the lead-up to an approval.\n\nStandard Chartered Bank is eyeing May 23 as the date for the Securities and Exchange Commission to approve spot Ethereum exchange-traded funds, according to a report shared with the bank’s clients and reviewed by Unchained.\n\nThe Block first reported the news.\n\nThe SEC is likely to take a strategy similar to the one it took for approving spot Bitcoin exchange-traded funds, according to the report. If approved, Ethereum ETFs would be the second domino to fall after the long-awaited approval of Bitcoin ETFs on Jan. 10, and be a boon for an industry that has undergone a prolonged bearish period.\n\nRead more: SEC Delays Decision on BlackRock’s Spot Ethereum ETF\n\nUnder a section of the report entitled “History doesn’t repeat itself, but it often rhymes,” Geoffrey Kendrick, head of Standard Chartered Bank’s crypto research, wrote that he expects “pending applications for ETH U.S. spot ETFs to be approved on May 23, the final deadline for the first of the ETFs under consideration — the equivalent date to Jan. 10 for BTC ETFs.”\n\nKendrick noted that if Ether follows how Bitcoin performed in the lead-up to its ETF approval, its price could hit $4,000 by late May. Ether is currently trading at around $2,370, according to CoinGecko.\n\n“We don’t comment on individual filings,” said an SEC spokesperson when asked for comment. “Broadly speaking, if the Commission declares a registration statement effective, that is reflected on EDGAR. Any Commission 19b-4 orders will be posted on our website and then published in the Federal Register.”\n\nStill, the SEC postponing decisions on two ETH ETFs (BlackRock and Fidelity) on Jan. 24 follows the same pattern as its deliberative process when it came to Bitcoin ETFs.\n\nThe market doesn’t seem to agree with Kendrick, however, with a wide range of opinions about whether Ethereum ETFs will even be approved at all.\n\n“Based on market commentary, we believe approval expectations are relatively low, likely below 50%,” wrote Kendrick. Yet, he believes the market is wrong in this case."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNdVlvaWYxTWl5TEJJNlpWV3lHMXdnaVRRNkhqTS1oUi1iMmZyMkJmSG10dXRwcFQ2VTRLbXROdWRXQ2RFNVMxZ3N2TVFnRzRNeko2bW1ZRWlsaDVSVGNlU1pwbVBaeDg5c0NTdEEyTjdXYjNFWVpkOElmQ1NFbVZpMzFwc9IBiwFBVV95cUxPaUc5RXpheEJsbzFFWkdXQlhtUFhROEFvNVo3NFhvRjIwa2FXUjQ0SUV1SkJNM1pyWUg0ZUkyeVVmWVh6NjVWb244SFhDUmg4MVVBNTdFUGhSZ0hfZlZwaEZWb2thekhSdFVTNWtQdDY4R21fX0lQVl9UeFBncjdhTmhnY0wxQmdyT2kw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Could Nearly Double in Price on ETF Approval in May: Standard Chartered - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nExchange-traded funds (ETFs) giving investors exposure to Ethereum (ETH) will be approved in May, British multinational bank Standard Chartered has projected.\n\nIn a Tuesday report, the bank said that it was likely that the U.S. Securities and Exchange Commission would give spot ETH ETFs the green light by the final deadline of May 23.\n\nAnd when the funds start trading, Standard Chartered expects the value of ETH will go as high as $4,000. ETH is currently priced at $2,372, according to CoinGecko, and hit an all-time high of $4,878 in November 2021.\n\nA number of high-profile firms including Wall Street titan BlackRock have proposed their own spot ETH ETFs. Such ETFs—sought in earnest now that Bitcoin spot ETFs are available in the U.S.—would allow investors to gain exposure to the second-biggest digital asset without the need to buy and store it themselves.\n\nAD\n\nAD\n\nStandard Chartered said that the investment vehicles were likely to get the approval stamp from the regulator because the SEC has not said ETH is a security. Meanwhile, the SEC has come down hard on crypto companies selling what it deems to be unregistered securities.\n\nThe Commodities and Futures Trading Commission (CFTC) has said ETH is a commodity—an asset that can be bought and sold, unlike a security—for years.\n\nThe SEC approved 10 Bitcoin ETFs on January 10 after a decade of denials. The BTC investment vehicles then started trading the next day and have since been a success.\n\nStandard Chartered said last year that BTC would hit $100,000 per coin by the end of 2024. In today’s report, Geoffrey Kendrick, head of Standard Chartered Bank's forex and digital assets research, added that this price range “still looks achievable.”\n\nAD\n\nAD\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBvbzB4aTJfN2llRklZUlJKZFQySWFQMXJRYmpWdEJNS2VnazZCRWlZUHlrNVA0ZWVYTk16b09zMHVuS2VRVi1KTkhiLXpEVU44VkU2NGY3TjdNSmlqekRNVVhnVDFKOFpkWWQ1SzhDaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "What Can I Buy With Ethereum? 15 Things You Can Buy with ETH - CryptoWallet.com",
        "content": "In the ever-evolving landscape of cryptocurrency, Ethereum has risen as a trailblazing force, captivating the imagination of millions worldwide. Its unique smart contract capabilities have revolutionized industries and changed the way we perceive transactions. But Ethereum is not just a speculative asset; it’s a gateway to a world of exciting possibilities. So, what exactly can you buy with this magical digital currency?\n\nIf you are asking the question “What can I buy with Ethereum” then you might know how challenging it is to find merchants that accept Ethereum directly. Let’s look at what Ethereum is and how to buy things with Ethereum. We’ll also explore a crypto card that enables users to spend and shop with Ethereum anywhere.\n\nCryptoWallet.com card allows you to buy ANYTHING with your crypto holdings. You can spend 800+ cryptos including Ethereum directly from your wallet. Our crypto card offers the lowest transaction fees in the market, and you can earn cashback of up to 3% on card purchases.\n\nHow Do You Use Ethereum to Buy Things?\n\nOnce you’re holding Ethereum, you might wonder how to spend it easily and securely. There are a range of ways, but here are the most popular:\n\nCompanies that accept Ethereum payments\n\nOver the years, an increasing number of companies have started accepting Ethereum as a form of payment for their products and services. It’s worth checking if your favourite retailer accepts crypto, as this can change over time.\n\nOver the years, an increasing number of companies have started accepting Ethereum as a form of payment for their products and services. It’s worth checking if your favourite retailer accepts crypto, as this can change over time. Crypto Card: Spend Ethereum directly from your ETH wallet\n\nOne of the easiest ways to use Ethereum for purchases is through a crypto debit card. This is a card that is linked to your Ethereum wallet and allows you to spend your digital assets like regular fiat currency at any merchant that accepts card payments. With the CryptoWallet.com crypto card, your Ethereum is seamlessly converted into cash at the time of the transaction, making it an ideal option for both online and in-store purchases.\n\nOne of the easiest ways to use Ethereum for purchases is through a crypto debit card. This is a card that is linked to your Ethereum wallet and allows you to spend your digital assets like regular fiat currency at any merchant that accepts card payments. With the CryptoWallet.com crypto card, your Ethereum is seamlessly converted into cash at the time of the transaction, making it an ideal option for both online and in-store purchases. Buy a gift card using Ethereum\n\nMany online platforms now offer gift cards for popular retailers, restaurants, and entertainment services, all of which can be purchased using Ethereum.\n\nRead More: How to Spend Ethereum?\n\nWhat Can You Buy with Ethereum?\n\nYou can use Ethereum for many purposes, such as trading on a crypto exchange, storing it in a wallet, or buying goods and services. If you’re looking to spend your Ethereum online or in stores, here are 15 things you can buy with Ethereum today:\n\nPhones and computers\n\nYou can buy a wide range of phones, tablets, laptops, desktops, and accessories with Ethereum. Many forward-thinking tech websites accept cryptocurrencies like Ethereum. For example, Digitec, a popular tech retailer, accepts Ethereum, Bitcoin, and several other cryptocurrencies. Newegg, an American retailer of consumer electronics, offers a range of computers, laptops, and parts and has accepted cryptocurrencies for years.\n\nCrypto\n\nYou can cash in on big crypto presales with your ether. Ethereum is a popular blockchain for new and exciting projects. As a result, there are many crypto presales that you can buy into using your ether. Keep an eye out for promising projects and, remember, always DYOR—Do Your Own Research.\n\nReal Estate (crypto emporium)\n\nCrypto Real Estate is a dedicated platform for buying and selling houses with crypto. The marketplace boasts luxury properties from around the globe, and it accepts a wide range of cryptos. You can also buy real estate on the luxury crypto marketplace, Crypto Emporium.\n\nCars\n\nSome car dealerships and platforms now accept Ethereum as a form of payment for vehicles. AutoCoinCars is a great platform to find car dealers and buy that Lambo.\n\nLuxury items\n\nMany luxury retailers have embraced cryptocurrency payments. You can use Ethereum to buy high-end watches, jewelry, fashion items, and other luxury goods. Crypto Emporium is a hugely popular marketplace for luxury items. Jura Watches also accepts ether for buying luxury, high-end watches.\n\nNFTs\n\nNon-fungible tokens (NFTs) have taken the art and collectibles world by storm. The Ethereum network is home to some of the most exciting collections, and you can use platforms like OpenSea to browse, buy, and sell NFTs.\n\nArtwork\n\nIf you’re looking for something more physical, you can also invest in the art market and purchase a beautiful piece of art to hang on your wall.\n\nEntertainment systems\n\nSome electronic stores and online retailers offer entertainment systems and gadgets that can be purchased with Ethereum. BitCrypto Market offers a range of home entertainment systems and gaming consoles.\n\nFlights\n\nA pioneer in the crypto travel market, CheapAir allows you to use Ethereum to book flights to your favourite destinations. Travala.com is also a popular platform for booking holidays and package deals.\n\nVPN\n\nFor some, crypto adds an extra element of privacy to their lives. For these privacy-focused individuals, VPNs, which protect your online privacy, can be purchased using Ethereum. NordVPN is a major VPN provider and accepts ether. You can also use decentralized VPNs built on the Ethereum network, like the Hopr Network.\n\nHome goods\n\nOnce you’ve bought your dream house using crypto, it’s time to decorate it. Overstock is a hugely popular platform that sells excess stock and handmade goods. Since 2017, they’ve accepted Ethereum alongside a range of other popular cryptocurrencies.\n\nDomain names\n\nIf you’ve got the next big idea in your head, you’ll want to act fast and snap up that domain name before someone else grabs it. Namecheap is a popular domain registrar that offers a wide range of services, including hosting, email accounts, and SSL certificates. Since 2013, they’ve accepted Bitcoin, but in recent years they’ve expanded their payment methods to include Ethereum.\n\nFood\n\nSatisfy your cravings by ordering from restaurants that accept Ethereum through food delivery platforms. Menufy operates in thousands of US cities, and you can use Ether (ETH) at the checkout to order your favourite meals. If you’re based in Europe, Takeaway.com accepts Ethereum in some of the countries it operates in. You’ll have to check to see if it’s accepted in your location\n\nIf you’re looking for something spicy, some Chipotle locations in the US also accept Ethereum as payment. They’ve even gone as far as to release a special offer for the Ethereum merge. The Proof of Steak involved a 99.95% discount and was so popular that it sold out early.\n\nSubscriptions\n\nYou can also pay for subscriptions to streaming platforms, online courses, and other services using Ethereum. For example, the hugely popular streaming and gaming platform Twitch allows users to pay their subscription fee with ether and other popular cryptocurrencies.\n\nGift cards\n\nGift cards have become a very popular choice for crypto holders. It’s an easy way to buy gifts for a range of places for the loved ones in your life or even for yourself! We’ll cover some of the gift cards you can buy using Ethereum.\n\nWhat Can I Do With Ethereum?\n\nYou can use Ethereum for many purposes, such as trading for other cryptocurrencies on a crypto exchange, storing it in a wallet long-term in the hopes prices will rise, or selling it for fiat money on an online exchange. You can also use it for peer-to-peer transactions between other Ethereum holders or pay for goods and services online and in stores. You can also buy gift cards or use a crypto debit card to spend your Ethereum easily.\n\nPopular gift cards you can buy with Ethereum\n\nGift cards are a great way to spend your ether. You can easily buy gift cards from the many crypto gift card websites like Bitrefill and eGifter. Here are just some of the gift cards you can buy:\n\nAmazon\n\nUberEats\n\nUber\n\nGoogle Play\n\nSony PlayStation\n\nXbox\n\nAirbnb\n\nDomino’s\n\nHotels.com\n\nWhy Should I Buy Things with Ethereum?\n\nEthereum has become the world’s second-largest digital currency due to a wide range of factors, and one of these is its suitability for day-to-day and large transactions. Here are just some compelling reasons to use Ethereum for purchases.\n\nSpeedy Transactions\n\nBank transactions can sometimes take days to clear. With Ethereum, your transaction can clear within 15 seconds to 5 minutes. It’s a great option for time-sensitive purchases.\n\nLower Fees Than Traditional Banking\n\nTraditional banking transactions, especially international ones, often come with hefty fees. Ethereum transactions typically have lower fees, making it a cost-effective option, particularly for cross-border payments. You will need to pay for gas fees (Ethereum transaction fees), however, since the Ethereum merge, these have been quite low.\n\nPrivacy\n\nEthereum can be a much more private option than using a bank. You don’t need to provide bank details or enter in your card details online. Instead, you just need your private key and the wallet address of the recipient. ​​This adds an extra layer of security and anonymity to your transactions.\n\nIs Buying Things with Ethereum Safe & Legal?\n\nUsing Ethereum for purchases is generally safe and legal, provided you follow standard security measures and adhere to the laws and regulations of your country. Some countries have very specific laws when it comes to digital currencies. In others, cryptocurrency is prohibited. Always research your country’s regulations. It’s also essential to use reputable platforms and merchants that accept Ethereum to avoid any potential scams or fraudulent transactions.\n\nThis Card Lets You Spend Ethereum Anywhere\n\nThe CryptoWallet.com crypto card launching in Q4 2023 allows you to spend ETH directly on anything you like, with the lowest crypto card fees on the market. We’re also offering the largest selection of cryptos in the world, 800 supported tokens compared to just 15 on average for competitors!\n\nYou can also use our platform to spend ETH directly from a virtual IBAN on anything, just like you would fiat currency. Open an account here.\n\nBuy with Ethereum: FAQs\n\nNow that we’ve covered what you can buy with Ethereum, here are some frequently asked questions regarding making purchases with Ethereum."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOSEtwSzZ4dzlOclBrVVpTWjJSbTl4dnVuS3R6ZlJzbEZGX0tmd080TWFOSVBaUEZkLXZRZXZ1dXNJUU5RcEUwZGVhSWZYNG9kbUNmazZRY09keVE0MzNkQ1NnSklhd0xTc2ZyUl8tYTluOGg1TkpCME1MNDYzWjFsc1pKZEcteERIYkw0Ym5jN2dObm4yem5HMmZZRGdFZ004ZFh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "It’s now free to connect a real domain to Ethereum Name Service - Domain Name Wire",
        "content": "Smart contract enables Gasless DNSSEC to import domains to use on ENS.\n\nEthereum Name Service (ENS) has implemented “Gasless DNSSEC”, making it easier to use real domain names with ENS.\n\nENS is a blockchain-based system that acts as a web3 username. You might be familiar with names ending in .eth. These are ENS’s original implementation that is akin to domain names for wallet address. Instead of remembering a long wallet address, people could use a .eth name instead. It’s similar to how DNS-based domain names replace IP addresses.\n\nPeople could use real domain names in place of .eth domains for a while, but setting it up (or making changes) could be costly because of Ethereum gas fees that could be as high as 0.5 ETH.\n\nNow, a new smart contract eliminates the need for a large amount of DNSSEC proof needed to be saved to the Ethereum blockchain. Essentially, it will allow DNS records to be verified via an off-chain gateway and eliminate the gas fee.\n\nThis means you can use your real domain names in the ENS ecosystem for free.\n\nDomain name owners will need to enable DNSSEC and add a TXT record, but will no longer have to pay gas fees."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPUGxDaTd2UFRCSFgwNjFLR2Q3NWlRbmdfTERaSjFNMGxYeElaVVVKRmJDOUZvOThQclpWVkY0X3VWR01Oem1TUGI3RXlhdFduVEo4SWRnT01PajJJVl8wUE83dk94RlpNUWpWdDRZWlpSazl2WE9CcldFcktaRVBsYWRpNkZCRDBkb1dzekhFU3owQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "TD Cowen expects spot Ethereum ETF no earlier than 2025 or 2026 - CryptoSlate",
        "content": "TD Cowen’s Washington Research Group predicted that spot Ethereum ETFs will not gain approval this year, according to Kitco on Jan. 29.\n\nThe U.S. Securities and Exchange Commission (SEC) must soon decide on proposed rule changes that would allow spot Ethereum ETFs to be listed and traded on securities exchanges. TD Cowen argued that approval is unlikely, stating:\n\n“[The SEC] can eventually reject the rule change, which either will lead to a new application or litigation … Either will take another year or two to play out.”\n\nIn that event, any possible spot Ethereum ETF approval is unlikely to occur until late 2025 or early 2026, the research group said.\n\nThe SEC must reach a decision on VanEck’s spot Ethereum ETF application by May 23 but is not required to approve the fund. The securities agency is expected to reach a decision on similar applications at the same time.\n\nOther sources are divided on whether a May approval is likely. One Polymarket prediction market suggests 47% odds of approval, while one JP Morgan executive has suggested a 50% chance of approval. Bloomberg ETF analyst James Seyffart is slightly more optimistic and has predicted a 60% chance of approval.\n\nPolitical factors are at play\n\nTD Cowen said that its low approval expectations are based on partisan attitudes toward cryptocurrency. The research group wrote:\n\n“This is a political call. We believe there is no upside for SEC Chair Gary Gensler to approve a spot Ethereum ETF given how upset progressive Democrats were over the agency’s approval of a spot bitcoin ETF earlier this month.”\n\nTD Cowen noted that SEC Chair Gary Gensler, a Democrat, needs support from progressives in order to advance his agenda or potentially obtain a different government position in the event that U.S. President Joe Biden wins a second term. It suggested that approving a spot ETF would involve a “needless fight” and that Gensler is likely in “no hurry” to approve such a fund.\n\nDemocrats broadly opposed the earlier approval of spot Bitcoin ETFs, as TD Cowen observed. Within the SEC, two Democratic commissioners voted against the approval of a spot Bitcoin ETF while two Republicans voted in favor of approval. Gensler voted in favor of approval in spite of his Democratic party membership and his broader concerns about cryptocurrency.\n\nOutside of the SEC, Democratic Senator Elizabeth Warren expressed complaints about the decision to approve a spot Bitcoin ETF on Jan. 12.\n\nMentioned in this article"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPb3FkQl9KS1Z6RnV0ak9vODV3amJXaHFPUmN1MXRxTlFLcjhlVXlrUmJoRTZBd3lqQVlHWVY1LWNlRnRkcTcwaF9abUhrSURDazhYVU0tbk90azE0LTNEMGU0VERfZ0hLYWI1UmxSWk9UVXVxaXB4RUdMNFBMdjY1b09PQ1FvNmRHNm5yMVJVYmRWOWJoRy1MS2xZekRSRy1s0gGmAUFVX3lxTE14bVFnOTFsV1VDMFhQeXN1Nm5hc2xNQTJvWmF5c2ZGR3RKRHVud3Foa2J4WUhpbGVNcDQ1N0NxQjMzSVB1TGppN3NoUXFJUXF4UnNTLXZJTkR4S3IwRzNlQmF4V1IydTdHM3Q0MUtwbGFQZzA5YXhQQm1GYUtHejdrUW1wUVRmajEwOV9kWFNVWU95UmUzUGdGbW9sdlQ1V2Q5RWFtRGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Standard Chartered Predicts Ethereum (ETH) Price Will Hit $4,000 Following ETF Approval - U.Today",
        "content": "Advertisement\n\nStandard Chartered has forecasted that the U.S. Securities and Exchange Commission (SEC) is poised to approve exchange-traded funds (ETFs) for Ethereum in May, Bloomberg reports.\n\nThis anticipated approval is expected to significantly impact Ethereum's market value, with predictions suggesting a surge to $4,000 by May 23, the final deadline for ETF applications from VanEck and Ark 21Shares.\n\nNot so fast?\n\nDespite the optimistic outlook from Standard Chartered, the SEC's impending decision on Ethereum ETFs is met with varying opinions from analysts.\n\nLegal experts Jake Chervinsky and Scott Johnsson have voiced skepticism over a guaranteed positive outcome.\n\nAdvertisement\n\nChervinsky stressed the erroneous assumption that the SEC's past decisions on Bitcoin ETFs will automatically translate to Ethereum.\n\nJohnsson pointed to potential regulatory hurdles, arguing that the SEC might demand consistent correlation across a 2.5-year sample period.\n\nThis diverging viewpoint is echoed in the industry, with JPMorgan offering a cautious 50% chance of approval due to legal uncertainties, while Bloomberg Intelligence's Eric Balchunas predicts a more optimistic 70% chance of approval.\n\nEthereum's price performance\n\nThe current trading price of Ethereum stands at approximately $2,372.37 with a market cap nearing $285 billion.\n\nDespite these robust figures, the Ethereum Fear and Greed Index indicates a neutral market sentiment, with a current score of 54.\n\nThis underscores the cautious optimism among investors as they await the SEC's decision and its potential impact on Ethereum's value."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPWVNJNjR4SklvWDJCSUY4Q2hrOXJxV0JjM3ZIeWRIQ1YyTHpwNl9FbWxDdWZfQV9XdThWV2NCb0QtMl9iUVpJY29PUVRKUHhySXpmQkFuWmE5RTRja2x3QjUzU2FtaGZXb3E0UHV0UzVIUmdkTmtRenZfUWs2OTV3SmctS1MtR3NKbnFZRHg3T21lay1GQUdjWFhjck5JVXRvR2p1TFZHdzBrcTFPOEdqUVE2ZUxQYk1pS1HSAb8BQVVfeXFMTlpBa25WRjM0MGZuMDVvbHNCa3dYdGYyUG5OcHRtaVJHZ25CdlFucmMtR29FX0ZUZ0NUcndiNy1Lc2dhWDJpaTZsS2QzZlVZSFNJUHhCVFpXdDJtWXRyV1pfQ1NzSWd5aGhtRTFpa0J4QXVncV9hLWV1OVNhMVYySnV2a0ZGLVlrdjR0RGVCbnR4anQ0YmxzNkhqdlRDQ3dpcVBVajh6YllDYUgwMkpzd3d0WC1mUW9iN183b1NWOEU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's 'Dencun' Upgrade Goes Live on Second Testnet, With Just One Remaining - CoinDesk",
        "content": "Ethereum's 'Dencun' Upgrade Goes Live on Second Testnet, With Just One Remaining\n\nNext week, on Feb. 7, Dencun will go live on its final Ethereum testnet, Holesky. After that, developers will ink in a date to activate Dencun on the main blockchain.\n\nBy Margaux Nijkerk Jan 31, 2024 at 1:11 p.m. UTC\n\nElection 2024 coverage presented by Stand with crypto"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQNEVwaHpxenpxWjJTX0VqQUpJdXRXTWR6cEdDOU9JMXZOWnc3OXBiRm1TX3NaNFhwTkItSG9FTzVsRzRsSjV5NDhtemFFUUJPZWhTUDNEaHVfb280YlV2eDMxQ0xEd0Z4bGo4TUx4UTJtYjY4TmJlNk9BX1YteW95SC1vUdIBiwFBVV95cUxOTkdwRThqSUY5MVdibDNIYXlESHFBQll2NnhIZkJrMU1EV0lFcTl2WGlxUFp0cjFSYjRDTFQ5Vk1NYWRUaTlzU0RwelRZTTVlZ1dKc2l0czU5RmpOeG9PT1VDeU5oR2RWMDM3WlphNGR1RnBveFZJUDJFSlYxc1lnTjJzdVBFRkZlWDlF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Doesn’t Want to Be the Face of Crypto - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIf Ethereum co-founder Vitalik Buterin ever aspired to be the face of the cryptocurrency space, he doesn't want be that anymore.\n\nButerin published a blog post Wednesday in which he meditated on the \"end of his childhood\" as a young pioneer in crypto, marking a transition in the industry. Buterin also mapped out his vision for the future growth of Ethereum and decentralization.\n\nButerin founded Ethereum in 2013 at the age of 19, quickly becoming a leading voice in the booming crypto industry. Now approaching 30, he writes, \"if that was ever my role, it is no longer.\" Buterin sees new, even younger innovators taking leading roles across crypto and related technologies like synthetic biology.\n\n\"I am now in some different kind of role, and it is time for the next generation to take up the mantle that used to be mine,\" Buterin reflected.\n\nAD\n\nAD\n\n\"One of my most striking memories from my last two years was speaking at hackathons, visiting hacker houses, and doing Zuzalu in Montenegro, and seeing people a full decade younger than myself taking on leading roles, as organizers or as developers, in all kinds of projects,\" he wrote.\n\nZuzalu is a gathering of about 200 high-ranking names in crypto, pharmaceuticals, politics, and academia who spent two months abandoning their respective lives and identities to become the first citizens of a new civilization—one founded among the resort hotels and Airbnbs of Lustica Bay, Montenegro, and tasked with envisioning what they consider to be a new future for humanity. It's a \"pop-up city community” conceived by Buterin.\n\nHe also shared that the majority of his decisions concerning Ethereum were made as a response to other people's pressures and requests.\n\n\"When I met Vladimir Putin in 2017, I did not try to arrange the meeting; rather, someone else suggested it, and I pretty much said 'ok sure',\" he writes. \"Now, five years later, I finally realized that (i) I had been complicit in legitimizing a genocidal dictator, and (ii) within the crypto space too, I no longer had the luxury of sitting back and letting mystical 'other people' run the show.\"\n\nAD\n\nAD\n\nThe Ethereum founder argued the crypto community should \"create an entire decentralized tech stack\" to \"compete with centralized tech companies at every level,\" spanning finance, identity, communications and more. He provided a chart outlining this vision for a parallel structure, from stablecoins to replace banks to encrypted messaging replacing big tech messaging platforms.\n\nButerin also focused heavily on the human element enabling decentralization, analyzing the differing motivations between token speculators, builders, intellectuals and end users. \"There is an opportunity to improve understanding between the four groups,\" Buterin wrote, noting financial incentives are not everything.\n\nBy visiting crypto communities worldwide from Argentina to Taiwan, Buterin highlighted the diversity of needs and ideals driving adoption—from inflation troubles to academic curiosity. \"If places like Silicon Valley are frontiers, filled with abstract far-mode thinking about a better future, places like Argentina are frontlines, filled with an active drive to meet challenges that need to be handled today,\" he wrote.\n\nAs the \"characters\" of crypto's early years exit, Buterin concluded decentralization itself persists by creating new communities: \"Continuing to stay active and doing what we can to create the new is a task for each one of us.”\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Stacy Elliott."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQaG91TXFqUXA4UEludVFwYkoxS0JUeWx4WHRFTzBDUlM0UnotWmt4TWRkWk5PZEtoaEF5UHhvQWZwYlQ1SS1sTHpLQTBpU042TEszMl8tWEgtRVplSURKZXRsMWVsd3ZuRnFzVkcyV0N2NkVhLUd3RWRKYlBFaWhDT0llMk1HUEpOTEFVcnkzaXJiZ3k1Zzh5UGthZ2QyXzBQU3k0ejA1MNIBrwFBVV95cUxQMzE1M2g3Znl1MDl1QzU4UTdnVUNVUU5kUnJWYmZnTjI1TTFJb2xodUFPUlVZSG1iQjdQbWVESWhLbmdvUEZveS1PNW1hcWRUNWtHa21odHhqcjBHOFFfR2k5ZlBNdHM4ZkxDVUFqV1M3R3NvYmtWWVhWNWZjdkhOanNBZE1WRUlrandXRHFKMGdxdnJCUUtQUzJsU3M2VHUyMWxQbGZQaThvaFdjRFdz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Solana's Jupiter Hits $1.2 Billion in Daily Volume, Outpacing Uniswap on Ethereum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nJupiter’s massive JUP token airdrop claim began Wednesday, and volume on the Solana decentralized exchange (DEX) aggregator soared to new heights in the process.\n\nAccording to data from both CoinGecko and Jupiter itself, the platform has racked up more than $1.2 billion worth of daily trading volume over the past 24 hours. That makes it top among all crypto DEXes, beating typical leader Uniswap V3 on Ethereum with $854 million (per CoinGecko). Note that the tally does not include Uniswap volume on other chains.\n\nJupiter’s 24-hour rolling tally also appears to be an all-time record for the protocol, which has recently seen surging demand. Another data source, DeFi Llama, shows that Jupiter’s single calendar-day volume record is just above $1 billion on December 14, 2023.\n\nToday’s traders won’t get anything from the initial JUP airdrop, which serves up 1 billion tokens for earlier Jupiter users to claim. Jupiter took a snapshot of eligible wallets in November and said that about 955,000 wallets could claim tokens during the drop.\n\nAD\n\nAD\n\nBut there’s reason to be optimistic: Jupiter has allocated another 3 billion tokens, 30% of the total token supply, for future airdrops to reward newer users. The timing for the next airdrop has not yet been announced, however, and amid the buzz of claim day and the sizable drops landing in Solana wallets, traders are eager to start racking up activity on the platform.\n\nJupiter opened up the claim at 10 a.m. ET and the coin started with a market price of about $0.42, according to data from Birdeye. JUP quickly popped over 70% to a price above $0.72, as Decrypt reported earlier, but it has since calmed to a current price below $0.67.\n\nEven with the sinking price late Wednesday, JUP commands a market cap of about $914 million based on the current circulating supply, and the token has generated over $500 million in trading volume in less than nine hours.\n\nAccording to a Dune dashboard that tracks public blockchain data, eligible wallets have already claimed about 566 million JUP tokens out of the initial 1 billion JUP airdrop allocation. Nearly 392,000 unique wallet addresses have claimed tokens so far, as of this writing.\n\nAD\n\nAD\n\nSOL itself has fallen about 6% on the day to the current price of around $97, according to CoinGecko, after bouncing up and down since the JUP drop.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNNUdGanZ5eUZkR3NFRWZxaE1OMVJxZm5lY25CMkZxWUJ2emwwY3FnM29TcHE1SFlHMUgyZzViWG9mNWgycDR1MV9Lc0VQT2xuZlhuWkhXQmpCYXpIV1c2N0UyeUZvUVFhY3N5bkNuVEdDWTY4SEZEbzlVbElCY3RnWVlsaDRvTTdScUJqSXBSc0hsTjB5TllJQjBzSGxoUk4wSTBnT2QtWFlKMnVGUnZfdUFzd3hBQmlqRVlFdFhHdW1DU3fSAcgBQVVfeXFMTUJqaENDUnozSVluaXdLMWtpOFktMlI4T0FWWVVlX2tXd3ZqOW5kUXNtQ2NLMXY0X3NLQ1d2cndoNjJEVEQ2NXJUSm1WUlRWTHRCbm42X3VVSFNTV3NNa09PODh2VVZEdUo1aUxHZmZmSzlhQkxzYko2eFZDUHZhUzAyNXpSOGpnOFY5b192ZDl5MHZVd2NsU3dGdi14SUpETlZzMU5yYUFrUk0xZFJjMDdaUnk0RS1IelFOblVuNWphem1ONjFfZVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Ether Could Hit $4,000 With Likely Spot ETH ETF Approval in May: Standard Chartered - CoinDesk",
        "content": "The market currently underestimates the odds of an approval, according to the report, but the bank sees \"no fundamental reason\" for the SEC to treat ETH differently than bitcoin. It highlighted that ETH futures are also listed on the regulated Chicago Mercantile Exchange (CME) and the SEC did not include ETH among the 67 cryptocurrencies the agency claims to be securities during its legal fight against Ripple."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE1YRVNfNnB0OGFkTGFzY0stQ3I0YUZwTVZPOVd4MG55eGtrcmhwTEljNWNHNXZqS3VCSlBJT0lsREt3ZV9IUG1JQ3pIV19YLXNPWFNPOVU0cWNuRTN0NE81ejFvLWRhWHdMdWVELVI3d9IBd0FVX3lxTFAydmpZZC1TWXRObW54QWdvWmc3dl9oUGRqTHFmYnowT2pPNTZma1Z3VWRLTHRjYXhSREZBa2JNRlZEcVlTVXlzeEpZN19CYk9GR3RuTFgwVHN0MmFvc2ZaXzdWeWg5Vmd4V1NCMFJRUFZNUldhY2Vz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Proto-Danksharding Ahoy! Ethereum Upgrade Clears Another Hurdle - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA highly anticipated upgrade to the Ethereum network, called Dencun, crossed a major hurdle, becoming active on the Sepolia testnet on Tuesday. The development follows activation on the Goerli testnet earlier this month.\n\nWelcome data blobs! The Dencun upgrade is live on the Sepolia testnet ✅ All Nethermind nodes are progressing well! pic.twitter.com/usVqLIegyA — Nethermind (@NethermindEth) January 30, 2024\n\nDencun introduces \"proto-danksharding\" to the number one proof-of-stake blockchain. Proto-danksharding is designed to reduce transaction costs for layer-2 blockchains, making data availability cheaper while also addressing scalability issues. This latest upgrade lays the groundwork for full “danksharding,” which takes cost reductions and performance gains even further.\n\nAD\n\nAD\n\nDencun, after full implementation, will allow the Ethereum network to more cheaply handle more than 100,000 transactions per second.\n\nThe last of three testnet deployments, called Holesky, is scheduled to implement Dencun on February 7. After this test is completed, a date for Dencun’s activation on the main Ethereum blockchain will be set.\n\n“Danksharding is how Ethereum becomes a truly scalable blockchain, but there are several protocol upgrades required to get there,” an Ethereum developer wrote on the official Ethereum website. “Proto-Danksharding is an intermediate step along the way.”\n\nThe Dencun upgrade also introduces ‘blobs,’ which are intended to reduce rollup cost on the Ethereum mainnet by first compressing transaction data off-chain, decreasing the storage and processing load.\n\nAD\n\nAD\n\nData temporarily stored in blobs is only needed for a short time to verify transactions and can be safely deleted to avoid overloading the network. Cryptographic commitments ensure that any alterations in the data are still detectable, allowing for secure and efficient data handling.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOUXFxVmxVSk9tV0Z0Z1o3eVFDTmtrYnBnTDE5YlVpRklNbTI3TTZNRTgxcXdsNmIxTGFEb0VDNVVyZ0xhMERYNkVjY3Y1NFM4VkdXcl9rY21halNMMFNGVGpUY0ZTa2ZXV05pLTRVaEZBbFNkNXltSlJkQU4xdU9XNWM0M01tWFlaTUdUdHVHcjlPU3k4bU8zejhySUJZYTBhMmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "ChainGPT Bridges to Ethereum, Unleashing AI Across Blockchains - Crypto Times",
        "content": "ChainGPT Community reached the most important decision which requires unification to bridge their natives token as $CGPT, through Ethereum blockchain towards multi-chains for future of AI infrastructure.\n\nThis chain expansion from the BSC network is a breadth that will embrace new extensions in unifying AI communities whereby ChainGPT can be poured over other audiences.\n\nWith a winning DAO proposal called “Bridge $CGPT to the Ethereum Network”, there are token transfers between the Euro Corpus and ICN that are done with no hassles.\n\nA Bi-directional Bridge that is enabled by ChainPort and provides quick listings on the principal exchanges such as Uniswap, KuCoin, and BitGet will also add to accessibility works with liquidity.\n\nThe presence of a strong Ethereum development community, ample DeFi liquidity depths, and set protocols provide an explosive space for the ChainGPT expansion. This leap itself serves $CGPT as the platform of choice for unveiling capabilities that AI can contribute to different blockchain ecosystems.\n\nThis is only an initial step for CH1AINGPT’s multi-chain journey. The team looks ahead, as it continues to delve into deeper plans for ongoing growth and extension onto other blockchains that ensure $CGPT remains the leading catalyst in AI space."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNZmh4Wmc5QTFid3haaDZLb0JoT2gtMU9HVkUtWkQ3OVoyRjFJS1ZjZnhkajJtRDdQdG81UGhtWmFVSHlzNWhmSzBJNFNIZWdGZEhnMkZLWWp5eXhYUTFJNVotd2xEaTBZNDV0b1BaS3JPODZlSkItZTV4UkVjS2gybTItTk9qUE5tNEUwWTMxb3NVdHNEWmF5a2Z2Ml9Oa0pvdk0xVDBvaTN3MEJJOTlkdjIwZWZ1M1psOWpDazJvVDBuS0V5cmpDN1dtaULSAdIBQVVfeXFMT1kzX2hkMVZXQkVMUWdYXzZtemhleFg1c2RPRlh5MFh1Zksyd0FDal9DaEh0RVdSMHZxeEJyMFRwdTJvYmc5cXFTUjd2cy1lV2kxMUIzOFhONWRSZGROLS15ZkkySUZVa3A1SFpMb0dCeU1PUElRRzBUbDhIb1dLOGUtZ1d6RnU1eXhWRUpiRkVIU2xHekRGV3RqNzdxYU1vcVdodW5IczM1QU42WUZTTlV1dUZVeHdiRm5uVUJuYmlLdzVJa0plSDJYTExOTmhqUFF3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Palantir Co-Founder Says One Type of Buyer Could Be Very Important for Bitcoin, Ethereum and Solana - The Daily Hodl",
        "content": "The co-founder of software giant Palantir Technologies thinks one type of buyer could introduce a new wave of demand for the crypto markets going forward.\n\nJoe Lonsdale says in a new interview with CNBC that artificial intelligence (AI) agents could rely on crypto as it expands across society.\n\n“There’s not going to be a whole new financial story driving [crypto] from the side of buyers necessarily, although there’s one type of buyer that could be very important here. AI agents are going to start doing a lot of things in our economy, and for AI agents to coordinate with incentive systems, they’re probably going to use crypto.”\n\nLonsdale, who also works as a founding partner at the venture capital fund 8VC, says those AI agents will probably use Bitcoin (BTC), Ethereum (ETH) and Solana (SOL), and he thinks the price of those three crypto assets are correlated.\n\nThe Palantir co-founder also says crypto prices could soar if the US government continues spending money at prolific rates and inflation kicks back up in 2025 or 2026.\n\nDavid Marcus, the former president of PayPal and ex-Facebook vice-president, echoes Lonsdale’s insight on BTC and AI. Marcus says he sees Bitcoin becoming the currency of choice for AI agents looking to trade information.\n\n“There’s a very good chance Bitcoin sats will become the 24/7 default neutral, native value exchange asset for AI agents. Agents will net settle in real time on Lightning between them. When fiat payouts need to happen, sats will get converted for a tiny fee.”\n\nBitcoin is trading at $43,571 at time of writing. The top-ranked crypto asset is up about 3% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiVEFVX3lxTE80LXVyT2Q4MFVFVHhRZG1MY18xT1I5S0VLTmFUaDNqYzJxczJJYkl3Y0dHTkNicE1KX1AtMDVQZUlEV0pDekZOeWhUX2FRM3FOS25Haw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "What Is DAI? - Ledger",
        "content": "What Is DAI?\n\nBy Mohammad Musharraf\n\nBeginner\n\nSHARE\n\nKEY TAKEAWAYS: — DAI, created by the Maker Protocol, was the first collateral-backed stablecoin to adopt and implement a decentralized model.\n\n\n\n— While most stablecoins are backed by fiat currencies or commodities and managed by centralized entities, DAI is backed by crypto and managed by a decentralized organization (DAO).\n\n\n\n— DAI is a popular stablecoin used for countless apps and services within the crypto ecosystem.\n\nUnless you’re new to the cryptocurrency market, you’ve likely come across stablecoins before. Put simply they are cryptocurrency assets, the value of which is pegged to existing real-world assets such as fiat currencies or commodities. Like traditional cryptocurrencies, they operate on blockchain networks and thus benefit from cross-border settlement capabilities and fast transaction speeds. However, their purpose differs significantly from cryptocurrencies such as Bitcoin or Ether. Traditional crypto assets are perfect for long-term storage. On a long-term basis, Bitcoin isn’t just stable, but appreciating. However, its volatility in the short-term makes Bitcoin, and other similar currencies, much less suited for making everyday payments.\n\nIn this case, stablecoins offer a much more appropriate medium of exchange. They are a great way to unlock blockchain-based payments for institutional and day-to-day retail purposes. For example, you could use them to pay grocery bills at your local store or buy a specific service.\n\nStablecoins operate as fiat on-chain, allowing you to spend and receive funds in a similar way to cash. They are crucial for the crypto market, offering not just a medium of exchange, but also a way for crypto traders to hedge against volatility, and a stable currency to charge for crypto services.\n\nThere are various types of stablecoins available: fiat-backed, commodity-backed, crypto-backed, and algorithmic. Each approach maintains the value of their respective assets slightly differently.\n\nDAI, from the open-source Maker platform, is among the top three stablecoins at the time of writing, with a market cap of over $5.3 billion.\n\nBut what is DAI and how does it work? Let’s explore DAI, its history, and how it differs from other stablecoins you might know.\n\nWhat is DAI?\n\nDAI is a hybrid, multi-collateral-backed stablecoin managed by MakerDAO. It operates on the Ethereum network as an ERC-20 token. Using Ethereum smart contracts, DAI aims to function in a trustless, permissionless, and decentralized manner. While it was created as one of the Maker Protocol’s native tokens, it’s now extremely popular for countless dapps outside the Maker ecosystem too.\n\nSo how did that come about exactly?\n\nHistory of DAI\n\nIn 2014, Rune Christensen formed the Maker Foundation and launched the open-source Maker Protocol. The goal was to build a decentralized, crypto-collateralized credit system for lending and borrowing without traditional intermediaries. However, the protocol needed a stable, non-volatile digital currency for loan payouts and other transactions. Thus DAI was born; with it launching in December 2017. The stablecoin borrows its name from a Chinese letter, meaning ‘to lend or provide capital for a loan.’\n\nAlthough it was created and issued by the Maker Foundation, it transferred full control to MakerDAO, a Decentralized Autonomous Organization now overseeing the ecosystem’s distributed and community-led governance. This is just one example of how DAI has become one of the most decentralized stablecoins in existence so far.\n\nTo understand its role in the crypto ecosystem, let’s dive into its use cases.\n\nWhat are the uses of DAI?\n\nDAI is a widely adopted stablecoin, supporting over 400 wallets and dApps. As such, it has a wide range of use cases. However, some of the common use cases for DAI include:\n\nTo avoid the impact of market fluctuations\n\nCryptocurrencies like BTC, ETH, SOL, etc., are driven by market dynamics like supply and demand. Meaning, that their prices fluctuate heavily: going up and down several points even daily at times. Conversely, DAI maintains a stable price which lends itself to multiple use cases.\n\nAs an alternative medium of fiat currency\n\nBanks usually offer low to negative interest rates for savings deposits. That, alongside inflation, means storing fiat currencies in the bank can cost you more than you’d think. If you use a non-custodial wallet to manage your DAI, you can rest assured that it will not cost you to store your funds. Plus, no one can revoke your access to them: only you control your wallet. Thus, DAI is an alternative to fiat currencies: its value is stable, just like the assets in your bank, but it lives on the blockchain which is much more secure and permissionless.\n\nEveryday payments: in dApps and DeFi platforms and the physical world\n\nAs an ERC-20 token, DAI is interoperable with countless applications, protocols, and blockchain platforms. This gives you a simple way to spend fiat on-chain. Since it can operate on any EVM chain, that also means you can use it to pay for everyday items, using a chain with much cheaper gas fees than the Ethereum mainnet. This makes it accessible and convenient for everyday purchases such as in-game items and online purchases, but also physical world purchases, such as buying a croissant or coffee in your local café.\n\nTaking Profits: As a Crypto Trader, Artist, or Service Provider\n\nStablecoins play a vital role in the crypto landscape, offering a reliable way for participants to take profits. For example, crypto traders often use them to take profits during market volatility. Similarly, crypto artists and service providers also periodically swap their earnings to stablecoins, ensuring their hard work isn’t hostage to crypto volatility. In short, stablecoins such as DAI offer users a way to realize profits without off-ramping. To clarify, that means profits made on-chain don’t necessarily need to go through the bank or even leave the network. A creator or trader can take profits without the burden of making transfers on and off-chain.\n\nHow does DAI work?\n\nDAI is overcollateralized, which means the collateral’s value is greater than the issued DAI’s value. This protects lenders against the fluctuations of the crypto market. As a stablecoin, DAI aims to maintain a stable 1:1 value with the USD. It has mostly achieved this goal so far, except for minor fluctuations. To achieve this stability, DAI employs a few methods:\n\nVault & Keeper Accounts\n\nIssuing and destroying DAI relies on Vault and keeper accounts. To explain, vault accounts are for depositing your collateral. Once you fill your vault account with ETH or another supported asset, you will receive newly issued DAI. Then when you want to repay the loan, you receive your collateral back and the DAI you were issued is destroyed. This process is controlled by a smart contract, meaning there are no middlemen needed.\n\nIf the value of a vault account falls below the issued value, it is liquidated. To handle this process, DAI uses keeper accounts. In short, the keeper accounts provide liquidity to pay off undercollateralized vault accounts. This keeps the circulation of DAI steady.\n\nStability Fee\n\nThe stability fee works much like interest on a loan and it’s charged only when returning your DAI for your collateral, whether that’s ETH or BAT. The rate of this fee is determined when your DAI is issued, and it fluctuates depending on the current supply and demand. If there is more supply than demand, the stability fees increase and vice versa. This helps alleviate the selling pressure to keep the coin’s price stable.\n\nDAI Savings Rate (DSR)\n\nThe final mechanism to keep DAI stable is its DAI savings rate (DSR). It essentially operates much like a bank’s savings account, but unlike a bank, these contracts operate without the need for a centralized entity. If you lock your DAI in a DSR contract, you automatically earn consistent interest.\n\nFor example, if you put 100 DAI into a DSR contract for a year and the DSR is 3.3%, you will receive an additional 3.3 DAI in your account when you unlock your collateral.\n\nThe rate itself is controlled by MakerDAO, the decentralized autonomous organization that governs the coin. Then the interest is funded by the stability fee.\n\nIs DAI backed by fiat currency?\n\nUnlike Tether’s USDT and Circle’s USDC, DAI is not backed by fiat currencies. Instead, it’s backed by various stablecoins and cryptocurrencies. USD Coin (USDC) and Pax Dollar (USDP) account for the biggest share in DAI’s backing, followed by ETH, Wrapped Bitcoin (WBTC), Basic Attention Token (BAT), Compound (COMP) and TrueUSD (TUSD).\n\nUsing multiple assets for collateralization also boosts diversification, which is a better practice from a stability and risk management perspective. Then, since many of the assets DAI is backed by tend to be volatile, DAI is always overcollateralized. This is to avoid the impact of fluctuations in these underlying asset’s values.\n\nAdvantages of DAI\n\nAs a versatile stablecoin, DAI has several benefits, ranging from stability to low entry barriers and robust security. From a practical perspective, however, its advantages can be seen in two broad categories.\n\nStability & Security\n\nDAI is one of the most stable stablecoins, thanks to its multi-collateral and hybrid algorithmic nature. It doesn’t merely rely upon backing reserves but also has codified systems to maintain the value.\n\nBesides low-cost remittances, people in unstable or weak economies can use DAI to safely store their capital in a USD-equivalent currency, without needing an overseas bank account. This helps preserve their purchasing power against hyperinflation or devaluation.\n\nMoreover, since you can store DAI in secure, encrypted crypto wallets, your funds are much less prone to theft, etc. This is particularly true when using hardware wallets that provide top-notch security against hacks and frauds.\n\nInteroperability & Accessibility\n\nDAI is an ERC-20 token that works with any Ethereum-based dApp, wallet, protocol, or platform. This level of interoperability is pretty much unforeseen in the crypto or stablecoin space, which makes DAI unique.\n\nIts broad compatibility also makes DAI very accessible for a variety of use cases, boosting innovation and user interactions across sectors. DAI also fosters financial inclusion in this manner, as people worldwide can use this stablecoin for their financial needs and goals.\n\nThey no longer have to rely on value-sucking intermediaries or, for that matter, wear their shoes off trying to get an account with the local bank.\n\nDisadvantages of DAI\n\nGiven DAI’s multi-collateral-backed nature, it must rely on the stable and efficient functioning of all the assets supporting its value. Even one of them collapsing drastically can affect DAI’s stability and 1:1 value with USD. Although DAI is a robust stablecoin overall, there are some downsides to the way it operates. Let’s explore how.\n\nIt’s Backed partially by volatile Crypto\n\nDAI is backed by cryptocurrencies that are subject to market fluctuations, such as ETH, BAT, and WBTC. This means DAI relies on the strength of the market. If ETH and WBTC drop significantly in price, it will diminish the value of DAI’s backing, thus depreciating the price of the coin; potentially leading it to depeg.\n\nTo safeguard against these risks, DAI has a pretty robust hybrid, algorithmic model: its stability mechanisms aim to minimize the impact of these possible crashes, such as over-collateralization and its stability fee. Plus, its diversification aims to soften the blow should any of its collateralized coins fail.\n\nIt’s also backed by centralized Stablecoins\n\nA great portion of DAI’s backing is in USDC, a centralized stablecoin. USDC is one of the most popular stablecoins to date, but unlike DAI, it is managed and issued by the centralized entity Circle. This means you’re trusting Circle not to go bankrupt or mismanage funds. Believe it or not, USDC actually has a back door that allows Circle to freeze accounts and retrieve stolen funds. Although this is useful to combat on-chain crimes, it also means DAI relies on Circle to act effectively and in good faith. If Circle mismanages USDC, it will also impact the price of DAI.\n\nCounterparty Risk\n\nSince DAI is largely backed by USDC, it’s important to note that USDC is backed by reserves in Circle’s control. Circle keeps its reserves in centralized financial institutions, a.k.a. banks. This introduces counterparty risk as if one or more of those banks fail, USDC’s price is impacted. Unfortunately, anytime USDC depegs, DAI depegs along with it. In fact, that’s exactly what happened in March 2023 when Silicon Valley Bank failed. USDC kept $3.3 Billion in SVB, thus both USDC and DAI depegged by 13% under $1.\n\nFinal thoughts on DAI\n\nDAI is among the earliest and most popular stablecoins. It has established a robust market record through various ups and downs, adapting to meet various demands and needs. Today, it’s one of the three most popular stablecoins, and the only one aiming to become truly decentralized. If you’re into DeFi, this may be the stablecoin for you, as it doesn’t have a centralized issuing body, and is not subject to the same centralization risks as some of its competitors. Plus, anyone can initiate the process to issue DAI: it aims to be truly permissionless, and you’re able to collateralize it with countless supported assets—not just ETH. Plus, as an ERC-20 token, it’s easy to secure and manage with compatible crypto wallets.\n\nSo what are you waiting for? Dive into the wonderful world of stablecoins from the safety of the Ledger Ecosystem. Using a Ledger hardware wallet device you can protect and manage DAI with a dedicated DAI Wallet to take part in multiple crypto apps and services—and all with the benefit of self-custody. Because if not self-custody, then why crypto?"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxON01waU5iUWdNVzBxVXRiRHpkcjhWWGdRTkdUcV85MDd5T1hwZEU5dG9jWXY1TDdsUHVJcTRMVzhnSHZWQnJnaUxlSGNwWE5QMFc3M01idmp5SW9MOF81bjNIdGVWbWdDbUk4ZjRRbXVCMTBuV0RJRWRTa2prOUFhNjlpTlFfdmxZVTZldEFQMEcxMUp6dGpkOXcxalhyZHRpUWFhamNna01ua1gxNkFUWHV3Zzh4REgyS1dKNk5rUTNqeVRGT3VUSHkySzdGbFRnU0tnSGY3M0FqanR4Zmk2aFZR0gHnAUFVX3lxTFBWSVgyeFI5d2ZRaUZMaXB2X2FzdnJQaWNkTVlpZkVEUnNmZXJrTWFPVFJnaWNpbzRCa21wa0pqV0Q0akNZLWRKR2VrYUZXRGtVNWtPUUlVSnNIOURCb1JfTXhPTmpSV09XWWxfWjd0bEoweDVzeUk0Z3I3X2JkcURWX0V5MW94Mlc4cS1kUU1reVJYd2piUzlzRHpFR2dsR0x1UXdlajBNNm81UE9TeFhYbEE3Z3RfUU8xWEdldHRZLVUwbUF4Zk93cTNUMkRxakFEUDd3UXI0R0NfeVFEQi01MFhuS0FDUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "List of 6 Ethereum alternatives currently at just $2 or less - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nAs the cryptocurrency market continues to evolve, investors and enthusiasts are constantly seeking alternatives to Ethereum, the second-largest cryptocurrency by market capitalisation. Ethereum's dominance in the decentralised finance (DeFi) and smart contract space has spurred the development of numerous projects aiming to offer similar functionalities at a fraction of the cost. In this comprehensive article, we delve into six Ethereum alternatives currently priced at $2 or less: Retik Finance, AltLayer, Pyth Network, Xai, Ondo, and Stellar.Retik Finance emerges as a disruptive force in the realm of decentralised finance, offering a comprehensive ecosystem of financial products and services built on blockchain technology. At its core lies Retik Pay, a revolutionary crypto-payment processor designed to streamline online transactions for merchants and consumers alike. Retik Pay revolutionises the traditional payment landscape by offering merchants the ability to accept cryptocurrency payments with minimal transaction fees, thereby enhancing their profit margins and expanding their customer base globally. The platform's seamless integration of various cryptocurrencies ensures compatibility with a wide range of digital assets, catering to the diverse needs of users across the globe. Furthermore, Retik Finance's native token, $RETIK, serves as the backbone of the ecosystem, facilitating transactions, governance mechanisms, and incentives for users. With a total supply of 1 billion tokens, $RETIK plays a pivotal role in driving user engagement and fostering a thriving community within the Retik Finance ecosystem. The platform's success is evident in its rapid growth and adoption. Retik Finance has successfully sold out six presale stages, with the seventh stage currently 86.71% complete within just two days of its commencement. This remarkable momentum underscores the increasing recognition and adoption of Retik Finance within the crypto community. Moreover, experts project significant growth potential for Retik Finance, with forecasts suggesting a surge of over 5000% in 2024. With its Certik audit certification, presence on CoinMarketCap and CoinGecko, and successful presale stages, Retik Finance stands poised to redefine decentralised finance in the years to come. As the platform continues to innovate and expand its offerings, it is well-positioned to emerge as a leading Ethereum alternative in terms of utility and adoption.AltLayer distinguishes itself in the cryptocurrency landscape with its innovative Restaked Rollups, offering a decentralised protocol aimed at scaling Ethereum and other blockchains. This solution targets critical challenges like security, decentralisation, interoperability, and transaction finality, setting it apart from existing scaling solutions. The recent surge in ALT's price is attributed to its listing on major exchanges such as Bitget and Binance, boosting exposure and liquidity. With a market cap around $300 million, AltLayer shows significant growth potential in the current bull market. Moreover, AltLayer's bounce from oversold levels on the Relative Strength Index (RSI) suggests a short-term trend reversal, bolstering investor confidence in its potential. As interest in scaling solutions grows, AltLayer is poised to carve out a prominent position in the rollups space. Exchange listings, technological potential, and oversold conditions have fueled AltLayer’s recent price surge. With ongoing development and the potential to emerge as a leading Ethereum alternative trading below $2 at $0.34 and is up 9% in the last 24 hours, while experts foresee significant growth ahead.Pyth Network has emerged as a significant player in the cryptocurrency market, offering a price aggregator oracle that furnishes valuable market insights and enables seamless token distributions. Since its inception in November 2023, Pyth Network has swiftly gained momentum, achieving a notable market value of $540 million. Currently trading at $0.4033, Pyth Network showcases robust potential for growth, with forecasts projecting a rise to $2.89 by 2025. However, investors should exercise caution when considering these predictions, given the inherent volatility of cryptocurrencies and the unpredictable nature of market dynamics. The trajectory of Pyth Network's success hinges on the adoption of its data feeds and the overall progress of the crypto finance sector. With its distinctive features and expanding influence, Pyth Network remains an appealing Ethereum alternative for investors seeking exposure to the burgeoning Oracle market. Amid the ever-fluctuating crypto landscape, Pyth Network (PYTH) stands apart with its unique attributes and promising price predictions. However, prudent consideration is advised due to the volatile nature of cryptocurrencies. The future success of Pyth Network (PYTH) is intrinsically linked to the adoption of its data feeds and the ongoing evolution of the crypto finance sector. Positioned as an Ethereum alternative priced below $2, PYTH holds promise for investors looking to diversify their portfolios.Xai revolutionises the gaming industry by enabling average players to own and trade in-game items without the need for crypto wallets. With its solid utility and practical application for millions of gamers worldwide, Xai transcends traditional speculative digital currencies, offering tangible value to its user base. Trading below $2 at $0.737, Xai exhibits bullish growth potential in the coming weeks, driven by its innovative approach and widespread adoption within the gaming niche of the low-cap crypto market. However, the inherent volatility of the crypto market introduces some uncertainty, necessitating careful consideration of risk factors by potential investors. As Xai continues to attract regular gamers and accelerate its growth trajectory, the project is poised to make significant inroads in the gaming industry, further solidifying its position as a viable Ethereum alternative for investors seeking exposure to innovative blockchain solutions.Ondo Finance emerges as a trending DeFi protocol, offering a native token and expanding its presence in the Asia-Pacific region. With its focus on digitising real assets and fostering financial inclusion, Ondo Finance demonstrates considerable growth potential in the evolving digital finance sector. Trading below $2 at $0.2149, Ondo Finance is supported by strong technical fundamentals and price predictions suggesting an increase to $0.53 this year and $0.61 the next. However, regulatory developments and market volatility pose potential challenges to Ondo's price trajectory, highlighting the importance of risk management for investors. As Ondo Finance continues to execute its vision and gain traction in key markets, the project is poised to play a significant role in shaping the future of decentralised finance. With its emphasis on innovation and accessibility, Ondo Finance represents a compelling Ethereum alternative for investors seeking exposure to emerging DeFi opportunities.Stellar (XLM) is on the brink of a transformative shift with the imminent launch of its Protocol 20 upgrade, heralding the integration of smart contracts into its mainnet. The announcement of the validator vote scheduled for January 30, 2024, has injected fresh momentum into XLM's market performance, propelling its price upward in the past 24 hours. The Stellar Development Foundation (SDF) has been diligently advancing towards this milestone, marking a significant leap forward in Stellar's evolution. Denelle Dixon, CEO and Executive Director at SDF, underscores the profound impact of Soroban smart contracts, framing them as the bedrock of a more inclusive future for the Stellar ecosystem. As anticipation builds within the XLM community, Stellar emerges as a compelling alternative to Ethereum, particularly given its affordability, with prices currently below $2 at $0.1139 as of writing, making it an attractive option for investors seeking exposure to smart contract functionality without the hefty price tag associated with other platforms. With Protocol 20 poised for implementation, Stellar stands at the precipice of broader adoption and enhanced utility, positioning itself as a formidable contender in the ever-expanding landscape of blockchain technology. As the countdown to the pivotal vote continues, enthusiasm abounds, signalling a promising trajectory for Stellar and its community of supporters.In conclusion, Retik Finance, AltLayer, Pyth Network, Xai, Ondo, and Stellar stand out as six promising Ethereum alternatives currently priced at $2 or less. Each project offers unique value propositions and innovative solutions to address various challenges in the cryptocurrency landscape. As investors navigate the dynamic crypto market, careful consideration of each project's fundamentals, market dynamics, and growth potential is essential to making informed investment decisions. While opportunities for substantial returns exist, investors should exercise caution and conduct thorough due diligence to mitigate risks and maximise returns in this evolving ecosystem of Ethereum alternatives."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOWlBJLXJVdVZ5LWIwdVZ5elNDUmp3M2FGWm1kUWRBODhjOGpJeWVydFNUbm4zaXpqbEgwVU9fTEZ1Vjh6SXBwM3JtNEtIR28wZnotT2p0X0R2LUFUbGdmVW9ZUWVCZG44N0ZmMUhJNXpvRGhIVk9jWUtCa3k5TUsxUzBDOU04bXNSZXF4WklaWFpROExESzZINWVrQnY4UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Synonym Finance joins $22bn DeFi money market with Ethereum, Arbitrum, and Optimism launch - DLNews",
        "content": "Synonym Financ’s raison d’etre is to bring together disparate crypto liquidity across distinct blockchains.\n\nDeFi lending is worth $22 billion and is DeFi’s biggest sub-market, followed by decentralised exchanges.\n\nFounder says the project won’t bridge to any “subpar networks.\"\n\nThe founder also addressed the risk of hacks and potential airdrops.\n\nDeFi lending is a $22 billion market — almost half of DeFi’s total market size — but much of that liquidity is siloed in protocols native to different blockchains.\n\nSynonym Finance launched on Tuesday and aims to solve just that.\n\nWhile the end goal is universal DeFi money market liquidity, the cross-chain protocol says it will only link to “high-quality ecosystems.”\n\n“We are launching on Ethereum, Arbitrum, and Optimism — all extremely high-quality ecosystems,” Synonym Finance’s pseudonymous founder, 0xbeachball, told DL News.\n\n0xbeachball has previously contributed to LayerZero Labs, developers of the eponymous DeFi interoperability protocol and crypto lending app Notional Finance.\n\n“Our thresholds for inclusion in our markets are extremely high — we won’t be connecting to subpar networks.” — 0xbeachball, Synonym Finance co-founder\n\nEthereum, Arbitrum, and Optimism’s lending market size is $11.9 billion, more than half of the DeFi lending market. The bulk of that sum is on Ethereum.\n\nThose three blockchains are also EVM networks. EVM stands for “Ethereum virtual machine” and describes a class of blockchains that use a smart contract logic similar to Ethereum’s.\n\n0xbeachball, however, added that support for Solana is in the works.\n\nJoin the community to get our latest stories and updates\n\nThis would let users secure loans with collateral on EVM chains and deliver USDC liquidity into DeFi protocols on Solana.\n\nWhile cross-chain lending is relatively new to DeFi, Synonym Finance isn’t alone.\n\nLending giants like Aave and Compound have already launched new versions allowing cross-chain lending — borrowing crypto on one blockchain for collateral posted on a different network.\n\nUSDC gets the nod\n\nFor Synonym Finance, USDC liquidity migration is crucial to its focus on unifying DeFi liquidity. The protocol plans to achieve this goal via a bridged version of USDC called CCTP-enabled USDC.\n\nThe CCTP bridge lets users transfer tokens, in this case, USDC, across blockchains.\n\nThe USDC being sent is natively burned on the sender blockchain with an equivalent amount of USDC natively minted on the receiver blockchain.\n\n“We’re planning to support blue chip assets and stablecoins like USDC moving forward that can provide higher quality assurances on stability and liquidity depth,” 0xbeachball said.\n\nSecurity concerns\n\nWhile the bulk of developer activity has gone multi-chain, user engagement last year was still mostly transactions on a single chain, according to a recent report by crypto intelligence firm Flipside Crypto.\n\nUsers who did cross-chain transactions mostly did so to position themselves for airdrop opportunities.\n\nBut while protocols like Synonym Finance are pushing users to do more cross-chain activity, the security risks of a mult-chain world are high.\n\nSome of the industry’s largest hacks have occurred via exploits on different crypto bridges.\n\nIn 2022, for instance, Chainalysis reported that $2 billion had been lost to cross-chain bridge exploits. Heco Bridge was robbed of $86 million in 2023.\n\nCross-chain money market operations put even greater focus on transaction ordering, dynamic pricing, and interest rate re-balancing, which are essential for preventing bad debt on DeFi lending positions.\n\nCrypto collateral is volatile, and price swings affect supply and demand.\n\nTrading bots also target this volatility in search of arbitrage opportunities that can be exploited for profits through specially ordered transactions on the blockchain.\n\n0xbeachball said current cross-chain lending protocol designs have failed to address these issues, but Synonym Finance has a solution.\n\n“We’re built on a hub and spoke model with a hub that lives on Arbitrum,” 0xbeachball said. “All rate pairs, rebalancing, and ordering takes place on the hub and is subsequently communicated to the spokes.”\n\nSince all operations occur on a single hub, coordination across the entire system is easier, 0xbeachball said.\n\nNo airdrop\n\nConcerning airdrops, 0xbeachball said the project won’t take the well-worn route of bootstrapping user engagement via any airdrop rewards.\n\nThe protocol will pursue liquidity by encouraging users to lock their deposits on the protocol to earn yield.\n\n“For us, early system liquidity and clear proof of the utility Synonym provides is better served by users that are engaged from day,” one0xbeachball said.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxQN1YtOHV6VzNUTExaYzdtMV9rVmtkOHpDNWs0YWp0TlhGREh6N1B4YU5RYWF0WE9kOVpGbm5va0ZBTEZVZnZrRE00a2lqal9JdTRWYkZDcXdfemVKRjF3VENBSTE5SDBuWkttNmduSnd0X2ZXcXFrN3FJRUlnNHRpa01lN0Z2UkVGcFZKdU43WXFfRkgxeFZtSGtadTJWcjZRd0NwVGNyLWJCU0Q5SVpac29kRUtjRXdLSmNHVXZELXNZS3cwT3FjTWNVUjBrb2ZWeHFKdGhHQVM5bmY5NlQwOVFwUTBVVjdnOGfSAe8BQVVfeXFMUDF2dW9GWE8wblNOa25TOElwcE9reDA3eFREVzM1M0VZWnFwTW8wRzZZOWZLTWJsdUdfNVVJSml3amhrMDE1X1Z2UGtGSGZKRG1VdnE3OWRZVlA4Z0FELVFZbGNEWHJLN21hRG82ZThpbC11eENMZUc1dllFbksxb19XNUV5Ylo2MVZLNUR3NlJyYTF4aGFmd1Z1R0pRMjdxNGszNUs4VE1URmR0ZVZCemhDNVhhc2tPa3lkQ3l4M2pMZWdYREk2NmJ0X1VxZDFsZXY0dmpNNmwxODE2VmVoajl4VFVLNWRTUE41cDB3VGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC pumps as FOMC meeting keeps rates unchanged - FXStreet",
        "content": "Bitcoin price could rally 10% if it overcomes $43,750 barrier.\n\nEthereum price likely to revisit $2,200 as the recovery rally hits the wall.\n\nRipple price eyes a 7% fall to bottom out near $0.4746 as community digests executive’s hack.\n\nBitcoin (BTC) price fell after the Federal Open Market Committee (FOMC) meeting, and Ethereum (ETH) and Ripple (XRP) prices failed to inspire confidence as the broader altcoin community bled on Wednesday.\n\nAlso Read: As monthly close draws near, significance of $43,750 grows\n\nBitcoin price confronts $43,750\n\nBitcoin (BTC) price has failed to break past the immediate barricade at $43,750 despite the Fed keeping rates unchanged, in line with expectations. Based on the minutes, there may be no rate cuts until such a time when the Fed has greater confidence that inflation is moving toward its 2% target.\n\nComing into the event, however, Bitcoin price ticked up nearly 3% with technical indicators favoring the upside. The Relative Strength Index (RSI) is above the 50 mean level, while the histogram bars of the Awesome Oscillator (AO) and Moving Average Convergence Divergence (MACD) are flashing green. These show growing momentum in favor of bulls.\n\nIncreased buying pressure could see Bitcoin price flip the $43,750 hurdle into support and then extend above it to $48,000. In a highly bullish case, BTC could make its way to the $50,000 psychological level, 15% above current levels.\n\nBTC/USDT 1-day chart\n\nConversely, a rejection from $43,750 could see Bitcoin price retract to the $40,726 support. An extended fall could send BTC to $37,800, below which there would be a cliff all the way to the $30,000 psychological level.\n\nAlso Read: Bitcoin price likely to support these altcoin narratives this week\n\nEthereum price could fall to $2,200\n\nEthereum (ETH) price is stuck below the ascending parallel channel, with the potential to fall as momentum is fading. The RSI, is below the 50 midline, while both the AO and MACD remain in negative territory, bolstering the case for the bears.\n\nA rejection from the lower boundary of the channel could see Ethereum price fall past the $2,200 level and the 100-day SMA at $2,177 to test the supply zone that now acts as a bullish breaker between $2,059 and $2,118. Breaking below its midline at $2,091 would confirm the continuation of the pullback’s potential for going as low as the $2,000 psychological level. To invalidate the bullish thesis, the price must record a candlestick close below $1,935.\n\nETH/USDT 1-day chart\n\nHowever, if more bulls show resolve, Ethereum price could venture into the supply zone, flipping $2,388 into support. In a highly bullish case, the gains could send ETH past $2,717 range high to record a higher high above $2,800.\n\nAlso Read: Ethereum Price Prediction: $2,500 in sight as bullish metrics steer ETH back into the channel\n\nRipple price dips after hacking incident\n\nRipple (XRP) price has dipped into the daily Fair Value Gap (FVG) between $0.4927 and $0.5111. Breaking and closing below its midline at $0.5040 could see XRP price extend the fall to the support floor at $0.4746.\n\nXRP/USDT 1-day chart\n\nNevertheless, enhanced buyer activity among bulls could send Ripple price north past multiple obstacles to overcome resistance due to the falling trendline. This would bring the $0.7000 psychological level in sight.\n\nAlso Read: Ripple executive’s XRP accounts get compromised in $112.5 million hack"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxObGN6LVY2RDAtRWFSSWdqbm5teG8wWFM1YVc0YmE4TTdOTzNveDBCUUxYVE9fNlhMUExURmpIOEE5R1I0c2FibDB2TGw2MkIxOVVGTU01VmVZUVR5VnRKa1dNekhoOGdvcjhwMFFxbFBuSkpZLTdsN01VY25aTWpFMm8xVnRwb2NPREVXcGxKc2xHSGpSYlM0bnNNbUlMcWJsWXIyM2VqREIzVGwwakdIc05PSFXSAbwBQVVfeXFMT19wbmNYRTNVYVVPVEg0OUtYMmpaVy1WNzBPbDRUUjQxYUhoT1pXeU4tSU1paEI2WmNxQlE5S2VTbHVGcEhYeDhfMTZIVmZhV1NfUVhpUlBJbm5TdWpibmpqQkU0cTdqZm83djdPbzQyenlVU1p3UlY1QXM0NDVDazFYWlowcjIyVjJvTlRhV1lXc19HOWs4c0VpTVR6UmdKcFo3TDhjWThsUWdFT01GT1ozMWpNa04wSzNFRlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Gaming Token Ronin Price Spikes to Two-Year High After $246K ‘Axie Infinity’ NFT Sale - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nRON, the native token of the Ethereum-based Ronin Network, continued its recent ascent Wednesday as it popped to a nearly two-year high price of $2.89, according to data from CoinGecko. It’s up 5% on the day and 57% over the past 30 days.\n\nRonin, an Ethereum sidechain designed for crypto games, has seen a recent rise in users and increased momentum tied in part to the success of Pixels, a social farming game that migrated from fellow Ethereum scaler Polygon last fall. The game’s play-to-airdrop campaign, which will reward top players with PIXEL tokens, helped fuel a surge in Ronin users.\n\nHowever, the latest RON pump came after a couple of notable events in the world of Axie Infinity, the NFT-based monster-battling game developer Sky Mavis originally built Ronin to support back in 2021.\n\nOn Tuesday, Sky Mavis launched its seventh in-game competitive season in Axie Infinity Origins. Dubbed “Epic Era,” Season 7 will serve up 18,900 AXS and over 13.7 million SLP in reward tokens, collectively valued at about $175,000 as of this writing.\n\nAD\n\nAD\n\nThis axie just sold for 105 ETH ($245,843.85) 🤯 King Durendal has a new owner. Congrats @irfreak! Durendal is one of 3 Agamogenesis axies. Agamogenesis axies are genetically engineered axies researched and developed by MEO Corporation. They feature never-before-seen body… pic.twitter.com/5wbpRn1ltd — Jihoz.ron 🦌 (@Jihoz_Axie) January 31, 2024\n\nThen, early Wednesday, a rare NFT monster from Axie Infinity sold for 105 Ethereum, or nearly $246,000 worth at the time of sale. Axie Infinity co-founder Jeff Zirlin tweeted that the particular Agamogenesis Axie NFTs originally sold for 6 ETH in 2018, back when that sum would’ve been worth approximately $3,300.\n\nAxie Infinity saw skyrocketing success in 2021, generating billions of dollars’ worth of NFT trading volume as the game attracted millions of active players.\n\nHowever, the game’s play-to-earn economy began struggling in early 2022 and the Ronin network’s bridge to Ethereum was hacked for $622 million. Sky Mavis eventually repaid affected Ronin users and has since continued to evolve the Axie ecosystem, gradually onboarding more third-party game studios to the network.\n\nAD\n\nAD\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNS3JnYWRVaFB5b2NTNF9IeWg5T0ExSVE3NW9PZmU5djMxQ01LanJHVEpQalNySU5PYTJHc2Y2NWVPaENqVWNtZUpMbmY3b3dVLU9penVLVGNweEx1OS1UTXR1b0p2U1N2c0txS19ZZlRtbHNQSXpmM2pWWURtaVEwVkhnQlVuS0otZV81OHN1T1FCbGc1ZlBFcEJMSXlKTE5pY3lCTGlxenNaeXpHU0FaMg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Shiba Inu Explains How to Bridge BONE from Ethereum Mainnet to Shibarium - The Crypto Basic",
        "content": "The official Shiba Inu X account has demonstrated how to bridge BONE tokens from the Ethereum mainnet to the Shibarium layer-2 network.\n\nRecently, the Shiba Inu team released a quick guide showing community members how they could bridge their Bone ShibaSwap (BONE) tokens between Ethereum and Shibarium. They carried out the demonstration through a short video posted on the official X account.\n\nHow to bridge Bone from Ethereum Mainnet to Shibarium: a quick and simple guide! pic.twitter.com/vT7CDjswUO — Shib (@Shibtoken) January 30, 2024\n\n- Advertisement -\n\nBridging BONE from Ethereum to Shiba Inu’s Shibarium\n\nPer the video, the foremost requirement is owning some BONE tokens in Web3 wallets such as MetaMask. With this first requirement checked, the next step is navigating to the secure Shiba Inu bridge portal at https://shibarium.shib.io/bridge through a web browser.\n\nUpon reaching the authentic portal, users should link their wallets to the Shibarium bridge site. The “Connect” button is in the site’s upper right-hand corner. Upon successful connection, the balances within one’s wallet become accessible through the Shibarium bridge portal.\n\nAccordingly, users can input the desired amount of BONE tokens they wish to transfer from Ethereum to Shibarium and then click the “Transfer” button. Upon clicking, a brief notice appears, informing users about what is possible and what is not through the Shibarium bridge portal.\n\nSpecifically, it states that users cannot delegate or stake on the Shibarium Network. However, such functionality is accessible via the Ethereum Mainnet. On the other hand, transferring funds between the Shiba Inu blockchain and Ethereum is feasible.\n\nSignificantly, after initiating the transfer from Ethereum to Shibarium, users will be prompted to authorize the transaction through their wallet.\n\n- Advertisement -\n\nMoreover, the video demonstration indicates that two transactions are involved in the deposit process. Consequently, the estimated time for the bridging process to complete is 20 minutes.\n\nUpon successful completion, users interested in viewing the network on the MetaMask wallet can navigate to chain.shibrpc.com and add MetaMask.\n\nShib Army Reacts\n\nThe Shiba Inu community members appreciated the SHIB team’s effort in the demonstration. A France-based Shiba Inu enthusiast acknowledged bridging their token through the outlined process."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQWmF4WUhBMV9SOGZZcmdwZDZSYkdOYWUyUnpqSlVRaUJaSDBMdUwtRE4xS2EyenpUS1VGWU5yV004WkI1ZWd4MkVZWl9MLUI0dVRyLUgwNnpIYjJDSTlxQkF1anF5dEdNQy10SnhNTU0ycWctY0xXakNGYUFJZ0FJNFFkNl9XZnVTV0NEYXM5eEtyaVExOVFuOUtkLS1WMlZsaFNN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH): Towards approval of Spot ETFs and potential jump to $4,000 - Cointribune EN",
        "content": "Wed 31 Jan 2024 ▪ 4 min read ▪ by Luc Jose A.\n\nAccording to recent analyses by Standard Chartered, the Securities and Exchange Commission (SEC) of the United States could be on the verge of approving a spot-traded fund (ETF) for Ethereum as early as May. This prospect, long sought after by investors and market players in the crypto space, could not only further validate Ethereum as an institutional investment asset but could also propel its price to unprecedented heights.\n\nToward a regulatory revolution?\n\nStandard Chartered Bank anticipates an imminent approval of the spot-based Ethereum (ETH) ETFs by the Securities and Exchange Commission (SEC) of the United States, a move that could propel the price of ETH to $4,000.\n\nAccording to Geoff Kendrick, head of forex and crypto research at Standard Chartered, the SEC is likely to follow a similar process to that used for Bitcoin spot ETFs, starting with initial rejections and eventually granting approval at the first final deadline, scheduled for May 23. This anticipation is based on the belief that the SEC has no fundamental reason to treat ETH differently from Bitcoin, especially given that ETH is also listed as a regulated futures contract on the Chicago Mercantile Exchange.\n\nImplications and optimism about the price of Ethereum\n\nThe expected approval of the Ethereum spot ETFs is seen as a major catalyst for the price of ETH, with a projection of nearly a 70% increase from current levels. This outlook is even more plausible considering that ETH could experience less selling pressure post-approval compared to BTC, notably because of the relatively smaller market share of the Grayscale Ethereum Fund (ETHE) compared to that of the Grayscale Bitcoin Fund (GBTC). The bank also highlights that, contrary to BTC, ETH has not been categorized as a security in the SEC’s lawsuits against crypto companies, thus strengthening the argument for its approval. In addition, the presence of ETH on regulated platforms and its exclusion from the list of 67 cryptocurrencies considered securities by the SEC in its case against Ripple add to its favorable case.\n\nBeyond the impact on price, the approval of an Ethereum ETF could significantly accelerate the adoption of Ethereum as a foundation for decentralized finance (DeFi) applications and other blockchain innovations. By providing a regulated and secure path for institutional investment, an Ethereum ETF would broaden the pool of potential investors, including those who have hitherto been reluctant to engage directly with the crypto space due to security concerns, volatility, or transaction complexity. This new wave of investment could provide the necessary funds to further develop Ethereum’s infrastructure, thus supporting innovation and growth in the DeFi ecosystem.\n\nIn conclusion, while the approval of an Ethereum ETF represents an exciting opportunity for the future of Ethereum and for the broader adoption of cryptos, it comes with a complex set of regulatory and financial challenges. How these challenges will be addressed will determine not only the success of the Ethereum ETF but also the extent to which Ethereum can realize its potential as a pillar of decentralized finance and blockchain innovation.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE93WXgxeEZEV3pqMFFTcXZrc3FaaWxHRzFqeDMxY3A0THRDT2Q2ajg1c1hUUFlHSjdKTGx3a1hLM05LVVVuYmFuSE9yT0FOQzBTR295WDFSX0RFRV90dVUzaVJFcUNzd9IBa0FVX3lxTE1VR1ZsbC1BNUtfbDg3NWdsbkJvMXpPTzNwaE1nME52RHAxOFNNYllVVzJvOWlFb0pkTVE3Smt4ODlGX3R0cGQ3V2VDc0VzYWZYSHpLRzFOSy05WVdLSUNHSkZsaHhMVU9iaDlr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Jupiter Volume Surpasses Uniswap: Is Solana Taking Over Ethereum As King Of DeFi? | Bitcoinist.com - Bitcoinist",
        "content": "Data from CoinGeko shows that Solana-based decentralized exchange (DEX) Jupiter recently surpassed Ethereum’s foremost DEX Uniswap in an important metric. This has created a narrative that the SOL network might indeed be ready to take over Ethereum’s position as the King of Decentralized Finance (DeFi).\n\nJupiter Surpasses Uniswap In Trading Volume\n\nAccording to CoinGeko, Jupiter has recorded over $510 million in trading volume in the last 24 hours, surpassing Ethereum’s Uniswap V3 and V2, which recorded $455 and $76 million respectively. Jupiter’s recent dominance is believed to be partly due to the recent WEN airdrop that occurred on its launchpad.\n\nThis airdrop caused a splurge of new money into the Solana ecosystem and Jupiter in particular. While that may be the case, it also highlights a new trend that looks to be developing in the crypto ecosystem. This is in reference to the fact that the Solana network has been going toe-to-toe with Ethereum as of late.\n\nData from DeFiLlama shows that beyond Jupiter’s dominance, SOL is actually matching Ethereum’s numbers. In the last 24 hours, Solana recorded a trading volume of $704 million to Ethereum’s $741 million.\n\nIn December 2023, Solana surpassed Ethereum in 7-day DEX volume for the first time in history. Data from the Block shows that Solana also outperformed Ethereum in terms of non-fungible token (NFT) trading volume during that same period.\n\nSOL price at $97 | Source: SOL price at $97 | Source: SOLUSD on Tradingview.com\n\nSolana To Overtake Ethereum?\n\nEthereum has long been known as the network housing the foremost decentralized applications (dApps) and has continued to dominate the DeFi landscape. However, that could change soon enough if Solana’s runs become constant. This is more interesting, considering that Solana has always been referred to as the “Ethereum killer.”\n\nThe SOL network is already known to have an edge over Ethereum, considering that the former is faster and more cost-effective than the latter. Ethereum’s gas fees have also continued to pose major concerns for users, and this cannot be sustained if mainstream adoption of DEXs is to be achieved.\n\nMoreover, it has become evident that more liquidity is flowing into Solana, something that could entice more DeFi users into the ecosystem. It is worth mentioning that the WEN airdrop was just the tip of the iceberg, as the JUP, Jupiter’s native token, airdrop is set to take place on January 31.\n\nThe highly-anticipated airdrop is expected to drive considerable attention and trading activity towards Jupiter and Solana. For one, those eligible for the airdrop are likely to diversify their funds across the SOL ecosystem. Meanwhile, those who missed out on this airdrop are likely to look farm other DeFi projects on Solana in hopes that they will be eligible once these projects in question roll out their native tokens.\n\nFeatured image from Quora, chart from Tradingview.com"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQT0tWRk9NeF9QaDJCZXJQcktpa2JXRHFCQlBsWjd2WFczXy1kTjl2ZF9WcEpuWnd3NWZ3TE9ZWmZHQU9PNXRaOGNOUGRGZS1mLVExTzd0MHl0R2pIM0x2eU1POThna09KVHBBd3VkOXZWczRWQUlETEFYTnl0SFlEbm5KQ2plWUNLNnFJR2ZZMWY5bVNNUHk0UHVjNkJBMmFtcG0wTw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "MIM Loses Peg After $6.5 Million Exploit on Abracadabra Ethereum Cauldrons - Unchained",
        "content": "The Magic Internet Money (MIM) stablecoin lost its U.S. dollar-peg after an exploit on cross-chain protocol Abracadabra.money’s cauldrons on Ethereum.\n\nThe Magic Internet Money (MIM) stablecoin lost its U.S. dollar-peg after an exploit on cross-chain protocol Abracadabra.money’s cauldrons on Ethereum.\n\nDecentralized crypto lending platform Abracadabra.money was hit by an exploit on Tuesday, resulting in a $6.5 million loss to the protocol.\n\nThe exploit was flagged by blockchain security firm PeckShield, which noted that the attacker funded the exploit with 1 ETH from Tornado Cash.\n\nMagic Internet Money (MIM), the stablecoin tied to the protocol flash crashed to $0.76 after the exploit. At the time of writing, the stablecoin was still trading below its U.S. dollar-peg at around $0.98.\n\nThe attacker managed to trick certain Abracadabra’s isolated lending pools on Ethereum, called “cauldrons,” and used a nested series of smart contracts to loop the Abracadabra Degenbox’s “borrow” and “repay” functions, according to analysis from Arkham.\n\nThe hacker swapped $7M of MIM for a total of $6.3M in ETH, incurring around 10% slippage when they dumped it on Curve. They’re now holding the ETH in two addresses: 0x40d5FFA20fC0dF6bE4D9991938dAa54E6919c714 ($4.15M ETH)\n\n0xbD12D6054827ae3fc6D23B1aCf47736691b52Fd3 ($2.16M ETH) pic.twitter.com/s3ovPoWZBX — Arkham (@ArkhamIntel) January 30, 2024\n\nMeanwhile blockchain security firm CertiK noted on X that early indications pointed to a “rounding error” being the root cause of the exploit.\n\nThe MIM team acknowledged the exploit and said the protocol’s decentralized autonomous organization (DAO) was attempting to stabilize the price of the stablecoin of MIM through a buyback and burn program, likely explaining why MIM is now trading closer to its peg.\n\nAround 10 hours later, however, the team issued an update urging users to revoke all approvals to the smart contract to prevent a loss of funds.\n\nhttps://twitter.com/MIM__Spcll/status/1752444391061430403\n\nMIM has lost its peg before, fluctuating to a low of $0.95 after the collapse of FTX in November 2022, given that FTX’s native token FTT was the largest collateral token backing the stablecoin. MIM also destabilized after the collapse of the Terra ecosystem earlier that year."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOYVgzRlNud2FEelFQWS03MS1kcnpCdURZbm9tS04zbDZEZ3lwZTVmUGV3R3U1UHVOUjd4ajVpbS0ydXotSjlINzMwOG9sT2ctQkhNT1NkVEY1ekd6WUFQd2JXcmFTR0hzN21wa05QTkZOQ3B6MzB1TmtIeVZIWmQyYjg5MldJb2tIM243Rk44d29DSGxneVQ3RGdTQ2tYT1NjOXBIX0c0WkI3QU1ickJUaWZtQVlId9IBuwFBVV95cUxPZjYtUk5VZkIzUDNROTZOY3BNX1J2TzF4ZDNlcUxUMUxwdHJjUnM4YUloSl95M1RNc3B4aGJpODd6U29YZVI0SERScHJnS1pDQk8tLTBETl9nYmFrUzlxSWI2V2ZnVEdlN3BJQkdFMGpRTUFDRlpBeDM0N1Q0dHJxZ1JEQmY4ZU94Zmg3SUg3S1pQQTNDVElLRGxqOUo4cHdzd1VxRDktSS1Lcm80X2ZIdU1xQm9WU2lOVEJv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Dogecoin (DOGE) Breakout Occurs, What's Next? Solana (SOL) Stays Dominant, Will Ethereum (ETH) Survive Unseen Stalemate? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nDogecoin, the cryptocurrency that started as a joke but became a favorite of the masses, including Elon Musk, has recently experienced a significant breakout.\n\nAfter a period of consolidation, DOGE has broken past a critical resistance level, stirring excitement among traders and investors. The coin is currently sitting above the $0.088 mark, which previously acted as substantial resistance. If DOGE manages to maintain its position above this level, it could solidify this area as new support.\n\nA break above the $0.095 resistance could signal a continued bullish trend, potentially leading Dogecoin to test the psychological barrier of $0.10. If the momentum is sustained and market sentiment remains positive, DOGE could attempt to reach higher highs, possibly moving toward the $0.105 to $0.11 range last seen during its peak periods of trading activity.\n\nImmediate support for DOGE is now at $0.088 which, if held, could act as a springboard for further climbs. However, should Dogecoin fail to maintain this level, it might fall back to its previous support near $0.078, where buyers have historically shown interest.\n\nAdvertisement\n\nA scenario where DOGE's breakout continues would likely involve increased adoption news or a resurgence of interest in meme coins, potentially sparked by social media or celebrity endorsements. Such catalysts could drive demand and push DOGE past the $0.095 level, cementing its breakout status.\n\nConversely, if the breakout fails to sustain, perhaps due to broader market bearishness or fading interest, DOGE could slide back below $0.088. This would retest the resilience of the $0.078 support. A drop below this level could lead to a bearish phase, with DOGE potentially seeking lower ground.\n\nSolana shows strength\n\nDuring this market cycle, Solana has established itself as a leader. With its stable and easily scalable performance, it outpaces giants like Bitcoin and Ethereum, as the majority of DeFi volume went to the \"Ethereum killer.\"\n\nAs the DeFi ecosystem on Solana flourishes, it is becoming a hub for innovation, blending meme culture with decentralized applications. The network's efficiency and scalability are attracting a wide array of developers.\n\nThe cryptocurrency that has been on a strong upward trajectory. Currently, Solana is testing a resistance level at approximately $100, a significant psychological and technical barrier. A convincing break above this level could signal continued bullish momentum, potentially leading to testing the next resistance zone around $108, which coincides with recent highs.\n\nOn the downside, the 50-day moving average, sitting near $93.23, is providing dynamic support. This level has been defended multiple times, indicating its importance to traders. If Solana can maintain its footing above this moving average, it would reinforce the asset's stability and could serve as a springboard for further gains.\n\nThe next crucial test for Solana will be sustaining above $100. Should it consolidate above this level, it would not be unrealistic to envision a push toward $108, or even higher, as the market reassesses Solana's value proposition in the context of a rapidly evolving DeFi and NFT landscape.\n\nFundamental Ethereum problems\n\nAs it struggles to gain momentum, Ethereum's scalability suffering and the diminishing traction of meme coins on its network are at the forefront of the bearish case for the second-biggest cryptocurrency on the market.\n\nThe network's inability to handle high transaction volumes without exorbitant fees has led to the sentiment that Ethereum is becoming \"unusable\" for the day-to-day transactions that meme coins require.\n\nFrom a technical standpoint, Ethereum's price analysis paints a picture of uncertainty. The asset has been struggling to maintain momentum above crucial support levels. Currently, Ethereum is wavering around the $2,250 mark, with immediate support near the $2,150 level. A break below this support could see a decline toward the $2,000 psychological barrier, which would represent a significant bearish development.\n\nLayer-2 solutions like Optimism and Arbitrum have emerged as potential stopgaps, offering faster and cheaper transactions. However, their adoption has been less than stellar, with many viewing these platforms as temporary fixes rather than a comprehensive solution to Ethereum's underlying scalability problems."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPalZIM3NuUVp1aktmb0ZDTnRpX2pFdFZ2WUpVVERBUHZTdWJhclNLcjhWYVE4ZHlzSkFXMXc0Wk82MHY4dk56cmEtQU8wY29IcmZXZ0I4cklsRjZhb2ZlOFRQcGNkcE9IbDRULTZlM3U3SlhSOEJSZU40WmZMUHhCWDBmS2h6SnRETUdLRUVGWll2ZDY0ZzRidmQ1UWttbjNPdlVzd1NxbjhuUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Vitalik tweet inspires memetokens about meowing like a cat - DLNews",
        "content": "A series of tweets featuring Vitalik Buterin about Chinese-language pop songs has inspired the creation of cat-themed memetokens.\n\nMeanwhile, dog-themed Floki has responded to a warning from a Hong Kong regulator about its staking programme.\n\nThe UAE has sent Digital Dirhams to China using mBridge.\n\nEthereum co-founder Vitalik Buterin’s banter on X has once again inspired a series of memecoins, this time themed around cats.\n\nOn January 30, he compared memecoin holders to a line from the Taiwanese pop song “Learn to Meow” by Pan Wenfeng and Cheney.F.\n\nThe chorus line, “we learn to meow together, together meow meow meow meow meow,” has resonated with crypto creators, leading to the creation of tokens with names like “we learn to meow together” and “Vitalik learns to meow.”\n\nOne token, “喵喵喵喵喵” (“meow, meow, meow, meow, meow”) has shot up almost 1,000% since its creation on January 30, with over $14 million in trading volume, according to CoinMarketCap.\n\nButerin’s post was a response to another tweet that compared Ethereum holders to lyrics to another Taiwanese song, “A little happiness” by superstar Hebe Tien.\n\nIts reference in turn was a playful dig at Buterin: there’s a video online of him singing the song in Chinese at a KTV karaoke bar.\n\nTron founder Justin Sun also piled on, tweeting: “Whoever issues Meow Meow Coin will immediately get it listed on Poloniex”.\n\nThis isn’t the first time Buterin’s tweets have inspired memetokens.\n\nJoin the community to get our latest stories and updates\n\nIn 2022, his response to a tweet by Sam Bankman-Fried during the FTX collapse led to the creation of the DIE token.\n\nFloki response to Hong Kong regulator warning fails to address high APY claims\n\nFloki has blocked Hong Kong users from tapping into its staking programme after the city’s top securities regulator placed it on its list of suspicious investment products.\n\nThe anonymous team behind the memetoken announced a trove of new measures designed to address concerns raised by the Securities and Futures Commission.\n\n“We regret that the SFC takes such an extreme measure,” the Floki team wrote in a Medium post, adding that it’s “taken steps to mitigate concerns in jurisdictions where the regulatory framework does not specifically cover or cater for the staking programmes.”\n\nThis is the latest development in the spat between the SFC and Floki, which saw the project halt its planned advertisement campaign in Hong Kong in December, according to the blog post.\n\nThe SFC first issued its warning on Friday, last week.\n\nFloki offered high annualised return targets of 30% to over 100%, and was unable to “demonstrate to the SFC’s satisfaction how the high annualised return targets could be achieved,” the regulator said.\n\nThe team behind the project, Floki DAO, responded to the warning on Monday, stating it was “a law-abiding project that strives to be legally compliant.”\n\nFloki also offered an explanation of how its staking product, giving two main reasons why its annual percentage yields, or APYs, were so high.\n\nFirstly, it’s because Floki is not funded by venture capitalists, like many similar projects, the team said.\n\n“Instead, the majority of the TokenFi token’s supply was allocated to users who stake Floki — in line with Floki’s ethos as the people’s cryptocurrency,” Floki said, saying that this ensured that “rewards are concentrated in the hands of believers in the Floki ecosystem rather than VCs.”\n\nSecondly it said “rewards are volatile and subject to market forces” beyond the control of the team, which means APYs could be as high as stated.\n\n“We do not believe there is any confusion amongst users as to how the staking program works,” Floki said, saying its stakers “are being rewarded in the utility token of a promising protocol, which the market currently has a strong interest in, and this is reflected in the current APY of the staking programme — which could go up or down depending on fluctuations in the TokenFi market cap.”\n\nFloki has gotten into trouble with regulators before. In 2022, the UK’s Advertising Standards Authority banned a London Underground campaign featuring the slogan “Missed Doge. Get Floki.”\n\nThe ASA deemed the advertisement irresponsible for exploiting fear of missing out, trivialising cryptocurrency investment, and taking advantage of consumer inexperience.\n\nDigital dirham makes first cross-border transaction using mBridge\n\nThe United Arab Emirates and China completed their first cross-border transaction using the digital dirham, the country’s central bank digital currency.\n\nThe UAE Central Bank sent $136 million to China via mBridge, a platform launched in 2021 by China, Hong Kong, Thailand, and the UAE.\n\nmBridge makes it possible to make cross border payments using local digital currency and without using the US dollar.\n\nGot a story about crypto and blockchain in Asia? Contact me at callan@dlnews.com.\n\nThis story was updated to highlight that the “喵喵喵喵喵” token was created on January 31, GMT, not January 30."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNYTZJYnBZVEZmYUxIY0JlRTFrNEZ2aWx6SEktWWYtM2Jyd2VfVmN3UmNwRy1Pa3pVc0gwQmpLb21fWndxdTMzVFVZMkVoS2FVUVNtaUkyd0xTMDlwX0xmMEJxcFZtTm1DMlV0NlhqUlpOR0FhcEMwbWljUWIxd3k2YWR6dXB5MlhnS0VjZnA1ZThFLXI1N1Z2NzkyRFg1VGZQV014QURNUUVnZGJKUUxTV2tuV1RBQVp2bEo2Z2tnVdIBxAFBVV95cUxNc3czU0RZWThmdWRCR2pobEk0Zk9VdEN5N19DbzdGQ1pZdzN6dXc5cVF5OXVGZy1BRHhrLWstckEtc1JlVUNpTUliSVlFTENseFJ2WmtiRFN3TWNQZXNqWWIzdkh3RHF4bG5XNFZIYXB6VHNjUEIxa0NRZnJycDNXSEphcjdqcFA2dWJsd05ZZWp1TUtfWjFfNWF0eWZ1S3p2LVJFSkFMZ3l5WjdsUUVVNWZOaDdyVWV6YjhNZEs5SEhEaHI4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "The Protocol: Bitcoin NFT Debacle, Vitalik's 30th, Farcaster Frames, 'Private Mempools' - CoinDesk",
        "content": "BLOCKCHAIN BOARDS: \"Trust the humans\" might be the new mantra for Ethereum's top layer-2 projects. As our Margaux Nijkerk reported this week , that principle stands at the core of a new trend in the blockchain industry, where overseers of various networks are establishing groups of people to help steer protocol changes and ensure security. The goal of these \"protocol councils,” sometimes called “security councils,” is to nudge the nascent networks toward increasing decentralization, by gradually removing them from under the control of their original developers. Before cutting the cord completely, where the networks essentially run automatically, or subject to some sort of democratic process, the thinking is that a panel of well-meaning humans can serve as the ultimate guardians – able to step in quickly when emergencies arise, or providing the final sign-off on major protocol changes. Polygon, the Ethereum layer-2 network, has a 13-person \"Protocol Council.\" Arbitrum, another major Ethereum-focused layer-2, has a \" Security Council ,\" while Optimism also has a \"Security Council.\" A member of the Polygon council, Mehdi Zerouali, who is the director of Sigma Prime, a blockchain security firm, told CoinDesk that “This is a necessary evil.\""
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQbkllWUp4OWRJOGhUWTBWd1ZqbzBla21SbFVyZDVrQ29od1FqcWRVZ3dRNlFQSWlQaVR5MU4tbjhTeTJpYWpUemhHYTFKVnFMa0VQTE1ocFZvOS1NSm9rTVpfTWFQUFdZUGwwRGZZTmd3SC1TTGZlMW9uQ093NVl5OVZDQ1BubXJEQ2lhTFpqcUQ0TV95Vlhn0gGaAUFVX3lxTFBPbkRlXzUtWkpQMEdRblhJRmtiUEJJMGJuZmZqbEpUZ0RyOVppNWxrQlp4dDg3d0tMejJfcUhnQm4xWWJwRlBTb2pBUzRkelE3bnRwdFliaVI5T0VGbEswekZXY045bU96RE53Qm5xODB1aHF3ZUdYZGRPcERIdkZKTGhZOGFuenNEZkI5V0xldVJDRGtycmdCa2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Montenegro's Crypto Dream Is Hanging In The Balance - Radio Free Europe / Radio Liberty",
        "content": "In May 2023, not far from the seaside resort town of Tivat on the Montenegrin Adriatic peninsula of Lustica, a conference on new technologies and blockchain was held that attracted little media attention at the time.\n\nSome of the country's most senior officials were there, including then-Prime Minister Dritan Abazovic and Milojko Spajic, who would take over the premier's post in October 2023. Also in attendance was Vitalik Buterin, the founder of Ethereum, the second-biggest cryptocurrency (by market capitalization) after Bitcoin.\n\nPodgorica made it clear that Buterin was more than welcome. A few months after the crypto confab, Buterin was granted Montenegrin citizenship. The government was optimistic that Buterin would \"contribute to the development of the blockchain industry and the Montenegrin economy.\" Wooing Buterin was also part of a broader government plan to turn Montenegro into a new crypto paradise.\n\nCould Montenegro really become a cryptocurrency haven? That could largely hinge on whether legislation being debated now in the Montenegrin parliament to regulate the electronic money market is eventually adopted by parliament. There have been concerns, in and outside Montenegro, about the European Commission's 2023 report on the country's progress toward accession to the EU, which noted disapprovingly the unregulated nature of the cryptocurrency market in Montenegro.\n\nThe lack of such laws in Montenegro hasn't stopped transactions from being conducted on crypto exchanges and purchases being made with cryptocurrencies, including for real estate. Cryptomining attempts have also been reported in Montenegro, along with the first cryptocurrency ATM being installed in an Adriatic resort town.\n\nIt also hasn't stopped crypto-schemers and backers from flocking to Montenegro, which has a small but well-connected community, according to Novak Svrkota, a crypto analyst, in comments to RFE/RL's Balkan Service.\n\n\n\n\"We came up with the idea of creating a crypto paradise in Montenegro. The crypto community is looking for a small country that is open and could pass crypto-friendly laws because the current laws in some countries are quite restrictive,\" explained Svrkota, who was a member of the government's short-lived Blockchain Directorate, a failed attempt to set rules for the crypto market in Montenegro.\n\nIn December 2023, Podgorica tried to woo another cybercurrency heavyweight. Spajic met with the leader of JAN3, a company that is focused on expanding Bitcoin. Also attending the meeting was Crown Prince Filip Karadordevic, the English-born son of the last Yugoslav king and a big Bitcoin booster.\n\nEarly Inroads\n\nSpajic first expressed Montenegro's eagerness to enter the burgeoning business of cryptocurrency in 2021, when he was serving as finance minister in the cabinet of Zdravko Krivokapic.\n\nTo that end, in November 2021, the Directorate for Cryptocurrencies and Blockchain was established. Among other goals, it was tasked with establishing the legal framework for regulating the mining and use of cryptocurrencies and blockchain, the technology underpinning all cryptocurrencies, and many other products like NFTs (Non Fungible Tokens). However, political infighting doomed the effort, and the directorate was ingloriously ditched in August 2022.\n\nThat setback didn't appear to dampen the enthusiasm. One of the benefits the cryptocurrency industry could bestow on the country, a report of the meeting said, was how \"Bitcoin can help Montenegro tap into its hydroelectric potential.\"\n\nHydropower has been tapped around the globe to feed the hundreds of computers wired up to the cryptocurrency mining business. In Montenegro, the hope was that its ample waterways could be harnessed to supply the electricity demanded by cryptocurrency activities.\n\nIn April 2023, the Montenegrin Central Bank signed an agreement with Ripple, a provider of crypto and blockchain solutions, to jointly develop a pilot program for the launch of the first digital currency -- backed by the bank -- in the tiny Adriatic nation of around 600,000 people.\n\n\"The introduction of a digital currency or a national stablecoin, i.e., a stable currency, is another step toward the digitization of financial services and the expansion of the space for the availability of financial services to citizens,\" the Central Bank of Montenegro announced at the time.\n\nThe Kwon Affair\n\nThe biggest obstacle to Montenegro's crypto dream has been the arrest of South Korean Hyeong Do Kwon, the so-called king of cryptocurrencies. On March 23, 2023, when Kwon was traveling to Montenegro, he was apprehended by police at Podgorica's airport for traveling on a forged passport.\n\nThe founder of Terraform Labs, Kwon is wanted in South Korea in connection with a $40 billion crash of the firm's cryptocurrency that crushed retail investors around the world.\n\nAlong with Kwon, another individual linked to the cryptocurrency crash, whose name was not released by Montenegrin authorities, was arrested at the time.\n\nKwon and the other man had been hiding in Serbia but moved to Montenegro after South Korean investigators tracked their whereabouts and asked Serbian authorities to detain them, officials said. The two were arrested while trying to depart for Dubai using fake Costa Rican passports, the Montenegrin Interior Ministry said at the time.\n\nTo this date, Kwon's fate still remains unresolved, with him still detained at a prison facility in Podgorica. He is awaiting an extradition ruling amid international warrants for fraud.\n\nThe opposition in Montenegro has seized on the case, potentially threatening any further advancement of the country's cryptocurrency plans.\n\nPressed by political foes, Spajic finally admitted in late December 2023 to having met Kwon but said he wasn't aware of the arrest warrants out for him. That admission didn't douse the political flames. During campaigning for Montenegro's 2023 general elections, former Prime Minister Dritan Abazovic tried to tar Spajic by accusing him of secretive business dealings with Kwon.\n\nThat accusation took on extra gravitas when a senior interior minister added what appeared to be damning details.\n\n\"The laptop [belonging to Kwon] also contains evidence of joint business between Spajic and Kwon. It may be a legal business with one of the most wanted fugitives, but it is the subject of an investigation,\" said Adzic.\n\nSoon afterward, prosecutors launched a probe into any ties between the two, but the investigation came up empty.\n\nMining In Montenegro\n\nEfforts to create new virtual coins via so-called mining have continued off and on in Montenegro, although it has not been profitable for years, according to experts who spoke to RFE/RL's Balkan Service. Cryptominers use high-powered computers to solve complex mathematical problems in order to verify transactions on the network. As a reward for their work, they receive cryptocurrency tokens.\n\nEarlier this month, a citizen of Serbia tried to smuggle cryptocurrency mining hardware worth several thousand euros into Montenegro but was caught by customs officials and border police. His current fate remains unclear.\n\nThe first case of cryptocurrency mining uncovered by police in Montenegro was reported in 2020, when police arrested two individuals and seized 250 computers in the basement of a building in Podgorica. The arrests were not linked to the mining but to the illegal use of electricity in the mining, which is a very energy-intensive process requiring specialized hardware.\n\nIT expert Boris Radovic said that cryptocurrency mining -- once a profitable business -- is now largely a loss maker, due to the huge amount of time and energy needed.\n\n\"I had personal experience with mining. After five months of 'work,' four virtual coins of one cryptocurrency were mined -- worth about 800 euros. As I did not convert them into real money in time, they lost their value. Now they are worth about 120 euros, which can barely compensate for the price of electricity that was used while they were being mined,\" Radovic explained to RFE/RL.\n\nLegal Gray Area\n\nJust exactly how widespread cryptocurrencies are in Montenegro is difficult to gauge, according to Svrkota; however, they appear to be favored by those who want to hide their transactional tracks.\n\n\"Cryptocurrency is used for purchases of real estate, especially luxury villas on the coast, where developers often get part of their earnings in digital money,\" Svrkota explained. \"It is often used by people from countries like Ukraine and Russia, which are under sanctions, to avoid complications that come with interacting with the banking system.\"\n\nA virtual currency ATM was even spotted at a private club in Tivat, a picturesque Adriatic coastal town in the southwest of the tiny Balkan country, late last year. The club's owner, Yong Hon Kong, a Malaysian citizen, told police he had legally acquired and imported the device but had never put it into service for technical reasons.\n\nAt the time, officials said the crypto ATM was an illegal device.\n\n\"There is no legal basis to carry out that trade. Everything related to trade through that device is illegal,\" said then-Finance Minister Aleksandar Damjanovic.\n\nA lawyer for Kong told RFE/RL that the device remains on the premises of the club and that no legal action has been taken against his client.\n\nRegular Montenegrins can also try their luck, Svrkota said, by registering to trade on global cryptocurrency exchanges.\n\nOne of them is Marija from Podgorica, who told RFE/RL that seven years ago she invested by buying a small amount of Bitcoin, the most famous digital currency.\n\n\"It was out of curiosity to try my luck without any expectation of making money. It was interesting to watch the amount in the digital wallet grow every day. At the moment when the value of bitcoin reached 10 times its value, I sold and used the money to pay for an exotic honeymoon trip and an exotic wedding trip for me and my husband,\" said Marija, who requested her last name not be used.\n\nAlthough she turned a profit, Marija said she no longer trades in cryptocurrencies.\n\nRadovic, the IT expert, said he has made and lost money trading in cryptocurrencies.\n\n\"You never know if something will rise or fall to nothing. Fluctuations in the crypto world are far greater than in the classic stock market,\" Radovic noted.\n\nWhile individuals may be making (or losing) money on cryptocurrency in Montenegro, none of it is going into the coffers of the state thanks to the lack of legislation regulating it.\n\n\"The state loses because it does not have control over money flows and there are no tax benefits. Regulation would bring some security to companies and people who deal with it, as well as an incentive to develop businesses. And it would give the banking sector a free hand in providing services for exchanging cryptocurrencies or investing,\" Svrkota said.\n\nThe Finance Ministry told RFE/RL that preparations have begun on drafting a law that will regulate crypto assets in accordance with Markets in Crypto-Assets Regulation (MICA), hailed as a landmark framework created by the European Commission that focuses on maintaining financial stability. It entered into force in June 2023.\n\nThe Finance Ministry cautioned that it was unable to give any time lines on the adoption of any regulatory legislation. And the Central Bank states that they are working on national standards that would be harmonized with MICA.\n\nIn the meantime, Montenegro's Central Bank has cautioned potential investors of the risks associated with cryptocurrency trading."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFB1UVBGcWxpMEFtdWNCZFY4SGFYbktIQnYtWjJydGpSbTl6cTYtNXRfdDl0cDJBVW9JVlpJYVUyVE9xaTJrLW41WjJwOUtfT3gzXzk5ZDF2VVpxc2tJVnI2Z2dWejVoa3NKWHU0ckpiM3FHT016VGdQcUVKSdIBgAFBVV95cUxNZXF6eTlQdU5Yc0Jrazc5ekRJXzFaZmdIendzLTN0VmZ1MS1fX2RBb3Y4Y0FmSGxnQ2lqTGdMS2toeUtJLXNtNW9UUkhtS0U3TlF0cjJlQTFJVjZPQ2xxTVlGYW5MLVlfdVEwZ29GdWx3SmNPeldWR0ZlanJGdXYwSA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Will Ethereum’s ‘GDP’ have a positive impact on ETH? - AMBCrypto News",
        "content": "Ethereum outperformed its competitors in terms of network GDP.\n\nThe price movement of Ethereum showed a positive trend as it geared up for a new upgrade.\n\nEthereum [ETH] witnessed large amounts of volatility in terms of price movement over the last few months.\n\nHowever, the fundamentals around the network remained sound, suggesting a positive future for ETH ahead.\n\nAs Layer 1 networks mature, the use cases being built \"on top\" of them continue to evolve. At the same time, onchain data providers such as @tokenterminal continue to give the market an increasingly clear view of how these systems are being used today — and how they may be used… pic.twitter.com/H206k6SEL4 — Michael Nadeau (@JustDeauIt) January 29, 2024\n\nOutperforming its competition\n\nAccording to Token Terminal, Ethereum’s “GDP” holds significant promise.\n\nThe evaluation method employed involves comparing Ethereum’s valuation to other layer 1 networks through a “GDP” analysis.\n\nThis method measures and predicts the economic potential, or GDP, of the network by treating it like a country.\n\nNotably, Ethereum’s “GDP” over the past 365 days, as per Token Terminal’s data, stood at $2.7 billion.\n\nAt press time, Ethereum led its competitors in both “GDP” and Total Value Locked ($28 billion), showcasing dominance that is anticipated to grow further as the network scales through layer 2 solutions.\n\nThe above news is positive for the trajectory of the network, as it shows promise for further growth.\n\nHowever, only time will tell whether Ethereum can capitalize on its GDP dominance, and whether the price of ETH will experience growth as a result.\n\nState of ETH\n\nAt press time, ETH was trading at $2,315.37, and its price had grown by 2.2% in the last 24 hours.\n\nThe price movement of ETH showcased by ETH over the last three months showed multiple higher highs and higher lows, establishing a bullish trend.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe total number of addresses holding ETH had also grown during this period, along with a spike in network growth. A surging network growth suggests that new addresses were showing interest in ETH.\n\nThe combination of these factors, coupled with the upcoming Dencun upgrade, suggested that the bulls may stand to gain from ETH in the short term."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPNkh2ZnA0cGFycDhfcnB5TnJ3Nm9mRkpLT2hlOF84OVBtVXZaR3E3dXk2RFUta3ljN2JiZlZsdGNSSXBTbi1PcDBUUHczOTJ3LVJZTzhMdXZtY04wdjU3UXE3R2R4MUpZSDJyY0ZhUktjZ0RIaGFfX0xmajlJY2lSQ1pQcXhaTHo5dW9rUF9fam01dGfSAZgBQVVfeXFMTVBUQi03MVZleU9tVGduU2RVZTJGRjJETlBBVDA2dzdpYS1fc214WTEzUy15X1ZlUWNkNDRtY0pCcTBESUpZaTU3eUNSZWhfVElzdC1LaElSbVZBSXFTNkxsUjlUOWlEbWJwa1BEeUR4RlhKY0lwVjNxZkpscGRHM0lRNWV2bmkwMGsyb255S3llcl8tQ0lMbnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Crypto Prices Today: Bitcoin, Pepe Coin, XRP Crash As Ethereum Rallies - CoinGape",
        "content": "The crypto prices today registered a bearish turn as Bitcoin (BTC) extended below $43,000 while major altcoins recorded significant losses as well. However, Ethereum (ETH), the second-largest crypto by market cap, witnessed a noteworthy upswing today. Whilst, the XRP price was hit massively as it plunged below $0.52.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price tumbled below the $43,000 mark today due to recent bearish turn. The Bitcoin price slumped 1.21%, settling at $42,930.19 at the time of writing on Wednesday, January 31. On the other hand, it’s trading volume boosted by 1.92% to $22.84 billion in the last 24 hours. Meanwhile, the crypto boasted a market cap of $842.03 billion\n\nadvertisement\n\nLooking at altcoins, the Ethereum price was up by 1.34% to $2,340.43 at press time with market valuation of $281.25 billion. Furthermore, ETH recorded a 10.90% hike in its trade volume, reaching $10.39 billion. In addition, the Binance Coin (BNB) price dipped 1.28% in value, reaching $306.82, while its 24-hour trade volume dropped by 8.74% to $765.24 million.\n\nOn the other hand, the Solana price tumbled by 1.54%, reaching $100.28. However, SOL soared by 25.91% in trade volume to $3.49 billion in the last 24 hours. Furthermore, the XRP price crashed significant. The XRP price witnessed a plunge of 4.90%, reaching $0.5103. On the contrary, XRP’s trading volume skyrocketed by 94.10% to $1.76 billion.\n\nMeanwhile, the Cardano price slipped by 3.49% to $0.5111. Moreover, it recorded a 10.15% slump in its 24-hour trading volume, settling at $456.43 million. Meanwhile, in the meme coin market, the Dogecoin price dropped by 1.71% to $0.08008 while its competitor, Shiba Inu, registered a 1.86% dump and traded at $0.000009112\n\nAlso Read: Ethereum ETF Approval Could Boost ETH to $4K: Standard Chartered\n\nTop Crypto Prices Today Are\n\nPepe Coin Crashes Hard\n\nThe Pepe Coin (PEPE), one of the trending meme coins, crashed significantly. The Pepe Coin price was down by 7% to $0.0000009831 with a market valuation of $412.11 million. In contrast, its 24-hour trade volume surged by 31.88% to $76.32 million.\n\nRender: The Top Crypto Gainer Today\n\nThe Render (RNDR) crypto, launched in 2017 by Jules Urbach, registered a massive profit on Wednesday. At press time, the Render price was up by 7.18% to $4.66, making RNDR the top gainer in the market today. Moreover, its trade volume spiked by a staggering 103.38% to $215.44 million.\n\nPyth Network Gains Over 6%\n\nThe Solana Ecosystem’s Pyth Network (PYTH) witnessed a notable uptick today. The PYTH price increased by 6.51% to $0.4214 at the time of reporting. In addition, its trade volume soared by a whopping 95.03% to $99.24 million. Moreover, Pyth Network recorded a high of $0.446 amid the rally today.\n\nAlso Read: Breaking: US SEC Chooses to Dismiss Lawsuit Against Debt Box\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPWExvN3NSaE5haktnS29TYlktTk5YOTVGUXcyVVVEbnJ1SXF2aHZEb0hra2pXcDJHQXZBOEJ5ZTlEMDVnS3Q0cVBnSlF0cU1GS0t0ZnByeUhVUkllNklWSDAycEJlQTlaZGZaMmxacEFiRTV0bmFiT1hkdzZBZzlFUFJPNDR5Z3l3dHMtbGo5c0QxdHhwXzM0SW8tRkxPUW5sOV9rbG5nTWU5Q3JBRkVUMFkzT0lqTnR2dURWMThRX0x0T0tuQjJTNUN0RnI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin su crypto e intelligenza artificiale: le idee del co-fondatore di Ethereum - The Cryptonomist",
        "content": "Yesterday, the renowned co-founder of Ethereum, Vitalik Buterin, published a lengthy post on his blog regarding the relationship between cryptocurrencies and artificial intelligence.\n\nThe promise and challenges of crypto + AI applications:https://t.co/ds9mLnshLU — vitalik.eth (@VitalikButerin) January 30, 2024\n\nIn particular, he tried to answer a question that he claims to receive often, namely what are the intersections between crypto and AI that he considers most fruitful.\n\nThe intersection between crypto and artificial intelligence (AI), according to Vitalik Buterin\n\nAccording to Buterin, blockchain and artificial intelligence are becoming increasingly powerful, with a growing number of use cases at the intersection of the two areas.\n\nVitalik, however, also points out that some of these use cases make much more sense and are much more robust than others, while others are less interesting or less solid.\n\nHe states that he believes that the most promising and easiest to implement are those in which the underlying mechanism continues to be designed more or less as before, but the individual actors become AI, allowing the mechanism to operate effectively on a much smaller scale.\n\nInstead, he believes that the most difficult applications to manage correctly are those that attempt to use blockchain and crypto techniques to create a “singleton”, that is, a single decentralized and reliable artificial intelligence.\n\nActually, he says he still considers these latest applications promising, both in terms of functionality and improving AI security, but they suffer from greater risks of failure and require more caution.\n\nThe projects between crypto and artificial intelligence mentioned by Vitalik Buterin\n\nThe most mentioned crypto project in this article is Worldcoin, whose team Buterin thanks for the collaboration in writing the post together with Modulus Labs, Xinyuan Sun, Martin Koeppelmann, and Illia Polosukhin.\n\nWorldcoin is indeed a project somehow connected to ChatGPT, although it is not a project directly based on artificial intelligence.\n\nWorldcoin is a project carried out by the Worldcoin Foundation, which is a special non-profit company based in the Cayman Islands.\n\nThe most well-known co-founder of the project is Sam Altman, co-founder and CEO of OpenAI, the company behind ChatGPT.\n\nSpeaking specifically about artificial intelligence, Buterin states that he believes the project that has done the most to reduce black-box attacks by limiting who or what can query an AI model is Worldcoin.\n\nIn fact, the project extensively uses artificial intelligence models at the protocol level, to convert iris scans into short “iris codes” that are easy to compare for similarity, and to verify that the object being scanned is indeed a human being.\n\nIn addition, it does not allow anyone to simply access the artificial intelligence model, but it uses reliable hardware to ensure that the model only accepts digitally signed inputs from enabled cameras.\n\nBut then he also adds that it is not guaranteed that this approach will work, because it is possible to launch attacks against biometric AI using physical patches or jewelry on the face.\n\nIt also mentions other crypto projects somehow related to AI, but without going into detail.\n\nCrypto-AI applications\n\nButerin has identified four categories in which there are potential overlaps between AI and blockchain.\n\nThe first, considered the most feasible one, is that of applications where artificial intelligence acts as a player in a game. For example, these are the applications where the ultimate source of incentives comes from a protocol with human input, such as prediction markets.\n\nThe second one, with high potential but high risks, is that of applications in which artificial intelligence acts as a game interface.\n\nFor example, these are applications where artificial intelligence is used to help users understand the crypto world around them, such as those that can help identify scams.\n\nThe third one is that of applications in which artificial intelligence establishes and controls the rules of the game, for example to help DAOs make subjective decisions.\n\nFinally, the last one is related to the use of artificial intelligence to establish the objective of the game, namely long-term strategies that involve the use of blockchains as infrastructure to build better artificial intelligence models.\n\nConcrete applications\n\nFrom Buterin’s reasoning, specific concrete applications of the blockchain in relation to activities carried out by artificial intelligence do not emerge.\n\nWhat emerges are development potentials, and projects that are trying to do something about it. For example, Worldcoin uses the blockchain only to issue a token.\n\nIn fact, not by chance, it also invites developers to proceed with caution in this direction, precisely because these are new developments not without risks.\n\nThis is effectively a pioneering field of blockchain usage, also because the artificial intelligence sector itself is still in a pioneering phase.\n\nIn addition, the use of AI in the crypto field also generates challenges, such as potential overloads and contradictory machine learning.\n\nThe volume of operations that an AI model typically performs is enormous, to the point that it would be a problem to bring them all onto the blockchain.\n\nIn addition, it is often impossible to accurately understand all the steps of reasoning carried out by an artificial intelligence, making it difficult or even impossible to predict all the outcomes with precision.\n\nIn short, we are still far from being able to have widespread use of artificial intelligence in the crypto world, even though the potential is there."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQNmFBQ2Z2WUZSM0I5UVFPQllLVGNXRC12ZFJhYXM2US1DSDlRaXlrMGVsbkYxRS1PQVB1bzBFRE5VNVlsMndkZDNlVG1lWEp6ZWc1U2pDa1lRbm14VU41cXlQYXNkVEkzWlVZSzRvbS1jVVVMSExTV0JlOWFSWm1VbnJUc2xFT1YxUnpLZmFUVTZ3c2FwaGV4YVhhbHJhMTA4MVh0VzB30gGrAUFVX3lxTE9JdzJ2N2VNLUpfaUhyREZJRmdab3lPVmM5M0VhV0t4Y1pQLW9tY21qcW5GZm0tbHU3Sk1BWEV4SDNzbmZ4M3NRYVgySVgySms1MkFMT2lReXM3aDdQMlV2QWIycldENWdCVHJZYmtFbFJrRDd2ZU5ILWhSOEhYMEQ3cmkzRkxoN0JNT1dMcGpKMmFESno0b2FNeW83SUJIRFhwbkFZeVFVd04tSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "US SEC to Approve Ethereum ETF in May, Standard Chartered Predicts - Gadgets 360",
        "content": "The US Securities and Exchange Commission is likely to allow exchange-traded funds to hold the cryptocurrency Ethereum in May, Standard Chartered predicts.\n\nMay 23 is the last date by which the agency must consider ETF applications from VanEck and Ark 21Shares, the bank said in a research report Tuesday. The asset managers will be the first to come up against the final deadline.\n\nStandard Chartered expects the SEC to rule on the applications on the final date, as it did on January 10, when it approved 10 Bitcoin ETFs. Ethereum has key similarities to Bitcoin's legal and financial status that suggests it will follow a similar approval pattern, according to Geoff Kendrick, the head of FX Research, West, and Digital Assets Research at Standard Chartered.\n\nLast June, the SEC left Bitcoin and Ether off a list of 67 tokens it considered to be securities. In addition, Ether — like Bitcoin — also has futures traded on the Chicago Mercantile Exchange — a key surveillance tool. At about $285 billion (roughly Rs. 23,66,701 crore), Ether is the second-largest cryptocurrency in market value after Bitcoin.\n\nKendrick expects Ether's price to rise to $4,000 (roughly Rs. 3,32,168) by the projected May 23 approval date, assuming that it follows a trading pattern similar to Bitcoin through the ETF approval process. Ether traded at about $2,370 (roughly Rs. 1,96,809) on Tuesday.\n\nThat price prediction, however, is based on multiple assumptions being true, including general market sentiment for approval remaining low, implied-volatility being wrong, and the SEC approving multiple applications on the same day.\n\nEther is expected to avoid much of the selloffs that Bitcoin experienced post-ETF approval, Standard Chartered said. Bitcoin fell as much as 20 percent following the ETF approval as investors, including FTX, sold billions in holdings of the Grayscale Bitcoin Trust (GBTC). The fund was converted from a trust that holders couldn't make redemptions. Grayscale's existing Ethereum trust holds a smaller portion of the total market capitalization of Ether, compared with the Bitcoin held in GBTC.\n\n“These factors should make ETH less vulnerable than BTC to a post-approval selloff,” Kendrick wrote.\n\n© 2024 Bloomberg LP\n\nAffiliate links may be automatically generated - see our ethics statement for details."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQVEJ0ek9wamxIcklGUG5wUTBQeE8ySVNoSjN3d1ljVmUydHBrcWtfRmZTVDlkT3F5MjZLVW9HTm5jZXoyV1NNbTMyTHk3Sk11aHJQcnNNR1dtYXlzR2pNTEVuZTdEbktjQV9iTlpCYl8ySnFqdXpkNjVaMkNaSldZQlVFbXoxc0NJVm9lS2lBM2NnWXZJTU1tZTU0TlVaT1BjX2hkbjVR0gGzAUFVX3lxTE9EeFAtblZjaGx3c1lLNWpPakxJcE5LT082eWRkQWRVV2ZPUjU0RkNuWklvaFh4S050STJQaDNQSlkwbFByNzVILTlzZ3Zsb0x5OTFFdGlLU19MLW91aEFwY1Jhci1xWEpLdk0xSk1aWXZxWFdyRTl4TVJWejliRWRIb09IN3p4TVBzR0hHWmQtXy1WdmJJNzdhamJHeHpFNncwajVLLWctREk2aXVMTEtiREF3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "ETH Price Analysis: Breaks Above US$2,300, Eyes US$2,400 Next - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1VMWZ3YzVqMWw1N05yMkNsWV9PRDdURDBPNF9zbl8yTE1SQTA5M0U0ZEJEUmFBWXRqcC1LNVc4U0VaSl8yX1dSQ2hUdEg4MXhoOHp3WmFtcmlWLUlvU1JmeVV2a0R1ZzBRN0g1M2FRWEFGOGFHbDdtb1I2QjRrX1XSAYQBQVVfeXFMUGhSUWpCQVBiTVNpUHpwbTBDWEpCbzl4LWJtaXRRVXBUWFEtNUFURlJwQUFHemhnTmhPUldkWjdPbE1BN1AwMkc1eFJITHNtZ0FmeXAzdURveU1la2JBRkFfR05oWlZ0X1lqVEl0Q0dJR3BVejJHVld0S1A2ZWp2ZG1QbmEz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Celebrates Birthday: \"My Childhood Is Over\" - Bitcoinist",
        "content": "Today, on his 30th birthday, Ethereum co-founder Vitalik Buterin shared a moving post reflecting on the last couple of years of his life and the evolving crypto space that made him re-evaluate his role within the community.\n\nThe End Of An Era For Vitalik Buterin\n\nVitalik Buterin, who just three years ago was making all the headlines as the youngest billionaire at 27, reflected on his post about the role he used to have as a young developer in the crypto space. He recalled spending the last two years speaking with a new generation that has taken leading roles within the crypto space to organize and develop it further, the same way he did a decade ago.\n\nThis experience has made the Ethereum founder realize his progression into a more established position in the crypto community, as he explained:\n\nBut watching all of these people go further than I did, younger than I did, made me clearly realize that if that was ever my role, it is no longer. I am now in some different kind of role, and it is time for the next generation to take up the mantle that used to be mine.\n\nIn the post, Buterin explored his journey to reach and embrace this new role, citing that “A person’s identity is always tied to their role in the broader world that they are operating in, and over a decade, not only does a person change but so does the world around them.”\n\nButerin’s previous mathematic and economic-driven thinking changed after realizing that he spent the first five years of his crypto life looking for what “was impossible” and not modeling the variables that truly made a difference “between existing flawed systems succeeding or failing” in practice.\n\nThough still present in his life, this once pivotal part of his identity doesn’t take as big of a role in his writing or thinking.\n\nThe Ethereum co-founder shares he’s never been a high-agency person, and throughout his life, most of his decisions have not been driven by “conviction.” Instead, “Most of my decisions in Ethereum involved responding to other people’s pressures and requests,” as he explained.\n\nButerin recalled several significant events in the world and the crypto space, such as the war in Ukraine and the FTX collapse, as the catalyst for the change of view on his role. Convulsions, as he calls them, like the fall of FTX founder Sam Bankman-Fried, made him realize that most of the people he had looked up to and used as guidance in the crypto space back in 2014 were no more.\n\nAs he explained, it also made him understand that his passive participation within the community was a luxury he no longer had.\n\nThese two events, as different as they are in the type and the scale of their tragedy, both burned into my mind a similar lesson: that I actually have responsibilities in this world, and I need to be intentional about how I operate. Doing nothing, or living on autopilot and letting myself simply become part of the plans of others, is not an automatically safe, or even blameless, course of action. I was one of the mystical other people, and it was up to me to play the part. (…) And so I decided to become careful in which of others’ plans I go along with, and more high-agency in what plans I craft myself.\n\nHappy birthday to @VitalikButerin!\n\nIt's been awesome to know you these 30 years!!\n\nThank you for being the amazing human that you are –\n\nfor your bright ideas,\n\nyour passion and leadership,\n\nyour innocence and kindness,\n\nyour joyful silliness!\n\n🥳❤️\n\nP.S. Two more years to the big… pic.twitter.com/E0MtJfglnw — dima.eth (@dimabuterin) January 31, 2024\n\nThe Birth Of A New Crypto Space\n\nVitalik Buterin addressed his view on the changes the crypto space has undergone since its birth in 2008. In the last fifteen years, “the broader public discourse as a whole seems to have to a large extent moved beyond caring about money and banks,” he said, later wondering if the “original ‘story’ of crypto” is falling further behind the times.\n\nButerin addressed this concern by proposing two “sensible responses to this conundrum.” He believes the ecosystem would benefit from, first, “reminding people that money and finance still do matter,” and second, “extending beyond finance, and use our technology to build a more holistic version of an alternative, more free and open and democratic tech stack.”\n\nButerin emphasized crypto’s advantage over other industries as “one of the few tech industries that is genuinely highly decentralized, with developers spread out all over the globe.” This advantage offers the opportunity to help solve sustainably the ever-present problem that many people still face in accessing money and finance around the globe.\n\nRather than just focusing on money, or being an “internet of value”, I argued that the Ethereum community should expand its horizons.\n\nAccording to Buterin, a more trustworthy, democratic, and decentralized tech stack would help evolve the crypto space to properly address the concerns and needs of the 21st century, allowing crypto to be part of a broader technology-driven story instead of “just a finance story.”\n\nVitalik Buterin concluded his birthday post by reflecting on the ever-changing nature of the world and the ‘rebirth’ of his role in the crypto space:\n\nFor me, 2023 has been a year of watching many things, large and small, fade into the distance of time. The world is rapidly changing, the frameworks I am forced to use to try to make sense of the world are changing, and the role I play in affecting the world is changing. There is death, a truly inevitable type of death that will continue to be with us even after the blight of human biological aging and mortality is purged from our civilization, but there is also birth and rebirth. And continuing to stay active and doing what we can to create the new is a task for each one of us.\n\nAs of this writing, Ethereum trades at $2,300.\n\nETH is trading at $2,309.66 in the hourly chart. Source: ETHUSDT on TradingView.com\n\nFeatured image from Flickr.com, Chart from Tradingview.com"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOdDQ0MFdodDg4VDdPQjBOR1lKOTdpMXRYaFNTWlpxOW9EZWM5WlFNY3NjVTgwNXdoY2JLak45RFF4TWNKdzF6dG9mWkFzbW9nR201bVR5R3p0UjY2TTZfa1haYVlTYXc0NjQzcFJiOEdZaWVxNkJFZmUtNmhtY2NBWjR5dFpnXzRTM0JKNUV2SUdMOWd4VFFv0gGcAUFVX3lxTFB5VDRjZGVjZTdiQkRoV2c2aG14NW5FVFFmbmZOWVUzQTdoRTZoU2dPb0tyQUtLOEgzMFd1QVJmQlhLRF9saDU2S1NnOHN5RW9CTHA5bEFNN0JLeVBTcG4tTlJhcWxqRE9ZY1c5eW0tamVMUWxQZmpEQWRuQjZSRHJ1aVBJN0NMZEgtY2F0OHE1R0l3UjJsdXpWTGkwUg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ethereum founder Vitalik Buterin is optimistic about the future of blockchain and AI but warns there are pitfalls both industries must avoid in their blossoming relationship - Blockhead",
        "content": "As revolutionary as Web3 might be, artificial intelligence (AI) has been unapologetically stealing its thunder. And rightly so. The likes of ChatGPT have seamlessly placed the next-gen text right into the palms of your everyday user. None of that wallet creation, gas fees, and general rabbit hole venturing that comes with stepping into Web3.\n\nWhile AI technology dates back to the 1950s, recent advancements have enabled AI to demonstrate its purpose to even the most tech-phobic user. Once seen as a dystopian dream, AI has proven to be a capable, efficient, and innovative disrupter of industries.\n\nBut are AI and cryptocurrency mutually exclusive? Ethereum founder Vitalik Buterin says no. In a lengthy blog post, Buterin dissects the intersection between the two disruptive technologies.\n\nPlayer in the Game\n\nAI has the capability of sharpening human decisions and actions. Buterin argues that AI-driven arbitrage bots in decentralized exchanges can exploit opportunities more efficiently than humans.\n\nTiming the market has long been a next-to-near-impossible task for your average trader. As Buterin highlights, market participants are often \"irrational\" and people with the \"right knowledge\" are not willing to \"take the time and bet unless a lot of money is involved.\"\n\nIntroducing AIOmen, Buterin says AI is already being used to predict the market. These AI bots are cost-effective too, working for less than $1 per hour whilst being armed with an encyclopedic knowledge database.\n\n\"If you make a market, and put up a liquidity subsidy of $50, humans will not care enough to bid, but thousands of AIs will easily swarm all over the question and make the best guess they can,\" Buterin explains.\n\nHe further added that once \"prediction markets\" are perfected, the technology can be used for a broad range of questions including investigating whether certain dApps are scams and the validity of wallets and accounts.\n\nInterface to the Game\n\nSecurity is crucial to digital assets but yet is an area the industry struggles with. Buterin highlights a couple of mechanisms already deployed by the industry including Metamask's scam detection feature and Rabby's wallet simulation feature.\n\nHe suggests that these security tools \"could be super-charged with AI,\" offering a \"much richer human-friendly explanation of what kind of dapp you are participating in.\" AI can help the user understand what exactly they are signing and whether the project is genuine.\n\nHowever, he also warns that \"pure AI interfaces are probably too risky at the moment as it increases the risk of other kinds of errors.\" For example, scammers would also have access to the same AI assistants the users have and thus could manipulate it by bypassing scam detection.\n\nRules of the game\n\nStarting with a disclaimer that this application of AI is the \"most risky,\" Buterin warns that \"we need to tread the most carefully\" when implementing AI in rule-making.\n\nButerin explains that there is already excitement about AI judges in the real world, and blockchain developers are looking to implement these features into the likes of smart contracts and DAOs.\n\nNew monster post: my own current perspective on the recent debates around techno-optimism, AI risks, and ways to avoid extreme centralization in the 21st century.https://t.co/6lN2fLBUUL pic.twitter.com/h5aIyFNCoh — vitalik.eth (@VitalikButerin) November 27, 2023\n\nHe warns that such machine learning is going to present a tough challenge because: \"if an AI model that plays a key role in a mechanism is closed, you can't verify its inner workings, and so it's no better than a centralized application. If the AI model is open, then an attacker can download and simulate it locally, and design heavily optimized attacks to trick the model, which they can then replay on the live network.\"\n\nButerin believes that zero-knowledge proofs and cryptography cannot solve this issue either. AI is already computationally-intensive so Buterin questions whether pushing AI inside cryptographic black boxes is even viable. Additionally, optimizing attacks against AI models is achievable without in-depth knowledge about the model's internal workings but if too much is hidden, \"you risk making it too easy for whoever chooses the training data to corrupt the model with poisoning attacks.\"\n\nObjective of the Game\n\nAI utility can extend beyond blockchains. Buterin points towards NEAR, which aims to become \"a fully sovereign operating system that is equipped with a personal AI assistant that optimizes for users’ needs without revealing private information about the user’s data or assets,\" according to NEAR co-founder, Illia Polosukhin.\n\nButerin says that \"trustworthy black-box AIs\" can be used to iron out system bias or cheating, working towards a democratic governance for systemically-important AIs. \"Cryptographic and blockchain-based techniques could be a path toward doing that,\" he writes.\n\nDecentralized AI that has a natural kill switch would also address concerns that bad actors are using AI for malicious behavior.\n\nConclusions\n\nOverall, Buterin is optimistic about the relationship between blockchain and AI. In particular, Buterin believes that individual players becoming AIs while allowing mechanisms to operate on a micro-scale is the most promising.\n\nThe biggest challenge is using blockchains and cryptographic techniques to create a single decentralized trusted AI. \"These applications have promise, both for functionality and for improving AI safety in a way that avoids the centralization risks associated with more mainstream approaches to that problem,\" Buterin warns, adding that there are many ways these underlying assumptions can fail.\n\nElsewhere"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPOXZrT3ZEMlh4SDM0dmJLOTJ2LVB4WXVweW43M1VpNXdZbE9kbHc5UmNPYkJQMWoyTDRXd2ZCLUlUdFVlckVGa2Y5TUQ5TDM1d0pXU1ZCWk5jT1d1akI1U09MQ1BacGs0VTF0cENJajRHVUhsSEJLaDktUnA2M0hqd3NRZGhldm1fNFVHdNIBkgFBVV95cUxPbkxpb0NSa0pob2FKNUoyMzNHeXE1aEF2VTdiRVRiR2xQc2FKX0JsdnRabUpUQlA5bWhuWFFVX3hPVFlNLUo4cnJ1N3plNkdtMmlDRWJiQjBVdDlaUUkyUnh6REU4U0prVm95MVpjejlmbG9uX01CNUdHUk1EOUNWUkNCbUt2NU5XZzBieGxDTGQ4UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ethereum’s Vitalik Buterin Spooks Memecoin World With This Post - CoinGape",
        "content": "Vitalik Buterin, the nerdy Ethereum co-founder has been seen on X trolling the memecoin ecosystem, although his post was a response to an earlier statement made by an X user identified as fi.\n\nMemecoins Features in Vitalik-Led Banter\n\nEarlier on today, Buterin made a post stating that non-censoring builders be like “I will give up my solo journey unconditionally for you, and I will not be afraid of sacrifice if I am strong for you,” as translated by Google. In return, the X user took a jab at Ethereum holders noting that,\n\nadvertisement\n\n“It turns out that you are the luck I want to keep the most. It turns out that we and love were once so close.”\n\nThis statement somewhat connotes forced love for the Ethereum protocol as an innovation hub. The banter continued and this time around, it was directed at memecoin holders. Buterin trolled memecoin holders citing that they sound like “Let’s meow together, meow meow meow meow,” per a Google translation of the post shared in Chinese.\n\nThis statement led to a reaction from crypto community members on X with many elongating the tease as is customary of the playful memecoin world.\n\nmemecoin holders be like 我们一起学猫叫，一起喵喵喵喵喵 — vitalik.eth (@VitalikButerin) January 30, 2024\n\nNotably, Charles Hoskinson’s Cardano had similarly been trolled by community members of other blockchains. While the Ethereum co-founder’s post was more light-hearted, the banter involving Hoskinson is more intense.\n\nIn one of such encounters, Hoskinson was quick to respond to the critics of the Cardano’s chain. To make his argument, the founder of the Layer-1 protocol touted the scalability of the network, closely comparing it to Bitcoin.\n\nMeme Tokens Gaining Traction\n\nMarkedly, this banter comes amidst a growing positive momentum in the memecoin landscape.\n\nMany of the tokens have been seeing significant gains in price. A few days ago, canine-themed memecoin Dogecoin (DOGE) registered an 11% price gain. DOGE moved from a 24-hour low of $0.07899 to a price of $0.08818. At the time of this writing, the memecoin is trading at $0.08136.\n\nShiba Inu is equally performing well with a slight price jump, although the positive sentiment is largely attributed to the potential milestones on Shibarium. Myro also markedly recently moved to the position of the third largest memecoin on the Solana network by market capitalization after hitting a new all-time high. The coin soared as high as $0.2607 with extreme growth rates recorded.\n\nSeveral other memecoins have experienced similar upshoots in their prices as well as their user engagement. The community traction from these memecoins underscores why prominent leaders in the industry are having fun with the concept.\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMigwJBVV95cUxQVVVGZG8xaXo5YTJfc1V0NWU5eF9Pekc4eHlaMEo2WU41ZVdQSmFwby0tSFNDM3N0V0NSU2lSRlEzSnBzQ0Vvc3RzVHUwdmhyRG13Ri1VTEZYTXpKT2lXbmNaMXhFS3NnRml3RnpJT2xBeVlVaEZGNTVVWmpET0JXZG12bklRVFhuNlFQNndmQzFHZnFmakZBdjk0ckw3ejdMaUl1VzEteTVhX1VUQ2EteVFQWGR1RjdWMExSYmtESWwta1RNcjBoSThHcVVuTkY1VDBxRUVlVURrQ3phcE9aZ0ZodG5nSHhna2lkSkUyS0pTbUxSYzAxR2w5MVpKV25UVTFF0gGDAkFVX3lxTFBVVUZkbzFpejlhMl9zVXQ1ZTl4X096Rzh4eVowSjZZTjVlV1BKYXBvLS1IU0Mzc3RXQ1JTaVJGUTNKcHNDRW9zdHNUdTB2aHJEbXdGLVVMRlhNekpPaVduY1oxeEVLc2dGaXdGeklPbEF5WVVoRkY1NVVaakRPQldkbXZuSVFUWG42UVA2d2ZDMUdmcWZqRkF2OTRyTDd6N0xpSXVXMS15NWFfVVRDYS15UVBYZHVGN1YwTFJia0RJbC1rVE1yMGhJOEdxVW5ORjVUMHFFRWVVRGtDemFwT1pnRmh0bmdIeGdraWRKRTJLSlNtTFJjMDFHbDkxWkpXblRVMUU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "10 Best Altcoins to Buy Now For February 2024: ApeMax, Ethereum, Sei, Sui, Manta Network, Skale Network, Celestia, Solana, Polygon, and Chainlink - - Disrupt Africa",
        "content": "As January 2024 draws to a close, the crypto market has experienced significant fluctuations. Notably, Bitcoin (BTC), the leading digital currency, has seen a notable decline, dipping to $39,000. This decrease has had a widespread impact on the broader altcoin market. As February 2024 approaches, crypto enthusiasts are shifting their focus to the best altcoins to buy.\n\nThis article, drawing on insights from various Web3 news sources and official altcoin project websites, focuses on the best altcoins to buy now for February 2024, particularly highlighting the innovative ApeMax, alongside other prominent tokens such as Ethereum, Sei, and Solana.\n\nBest Altcoins to Buy Now For February 2024\n\nApeMax (APEMAX) – Young meme coin popular for “Boost-to-Earn” feature\n\nEthereum (ETH) – Second largest crypto by market cap\n\nSei (SEI) – Offers a layer 1 blockchain solution tailored for trading\n\nSui (SUI) – Permissionless layer 1 blockchain\n\nManta Network (MANTA) – Addresses scalability and privacy in Web3\n\nSkale Network (SKL) – Aims to resolve Ethereum’s scalability issues\n\nCelestia (TIA) – Offers a novel blockchain architecture focusing on modularity\n\nSolana (SOL) – Known for impressive transaction speeds and low costs\n\nPolygon (MATIC) – “Ethereum’s internet of blockchains”\n\nChainlink (LINK) – Serves as a crucial link between blockchain contracts and real-world data\n\nApeMax (APEMAX)\n\nLeading the pack is ApeMax, a young meme coin in the crypto space with a unique “Boost-to-Earn” feature. Currently in its presale phase, ApeMax allows eligible buyers to possibly earn rewards by “boosting” entities of their choice.\n\nThe presale has already stirred considerable interest from the crypto community. ApeMax offers Early Bird Discount Loot Boxes for a limited time, adding an appeal to the project. ApeMax’s presale will conclude on February 21st and is set to be listed on Uniswap on February 22nd.\n\nEthereum (ETH)\n\nKnown for its flexibility in powering smart contracts and decentralized applications (DApps), Ethereum’s robust technology continues to be a cornerstone in the blockchain space.\n\nSei (SEI)\n\nSei offers a layer 1 blockchain solution tailored for trading. Its unique transaction ordering and block processing system set it apart, making it a go-to for exchanges looking for efficiency and speed.\n\nSui (SUI)\n\nSui, a permissionless layer 1 blockchain, is designed to be user and developer-friendly, supporting a wide range of applications. Sui’s emphasis on speed and low-cost operations makes it an attractive option for app developers.\n\nManta Network (MANTA)\n\nAddressing scalability and privacy in Web3, Manta Network offers a dual blockchain approach. It combines a low-fee scaling solution on Ethereum with a privacy-centric identity chain on Polkadot.\n\nSkale Network (SKL)\n\nSkale Network aims to resolve Ethereum’s scalability issues by providing parallel side chains for faster and cost-efficient transactions. SKL has a zero gas fee and security features.\n\nCelestia (TIA)\n\nCelestia offers a novel blockchain architecture focusing on modularity to tackle scalability and security challenges. This benefits Web3 applications facing growing demands on existing blockchain infrastructures.\n\nSolana (SOL)\n\nKnown for its impressive transaction speeds and low costs, Solana is a standout choice for handling thousands of transactions per second. Its hybrid consensus mechanism combines PoS and proof-of-history (PoH).\n\nPolygon (MATIC)\n\nPolygon operates both as a cryptocurrency and a platform, enabling blockchain networks to connect and scale. Polygon is referred to as “Ethereum’s internet of blockchains”.\n\nChainlink (LINK)\n\nChainlink stands out as a decentralized oracle service that bridges the gap between smart contracts and real-world data, enhancing the functionality and reliability of blockchain applications.\n\nHow to Assess Altcoins Before Buying Them\n\nTo identify exciting new tokens, crypto enthusiasts can:\n\nCheck the Project’s Website. This provides direct information about the altcoin.\n\nRead the White Paper. Understand the fundamentals through the white paper, like ApeMax’s, which is available on its official website .\n\nEvaluate Market Metrics. Using coin aggregators like CoinMarketCap or CoinGecko can be useful in assessing market cap, trading volume, and supply metrics.\n\nFinal Thoughts on the Best Altcoins to Buy Now for February 2024\n\nDespite the market’s volatility, the excitement of crypto enthusiasts suggests a growing interest in altcoins. This article has put a spotlight on the best altcoins to buy now for February 2024, including ApeMax and other prominent coins like Ethereum, Solana, Celestia, and more.\n\nHowever, prospective buyers should be aware of the inherent risks and always conduct thorough research. Engaging in crypto may not be suitable for everyone. For those interested in ApeMax, note that it is not available for purchase in certain regions, including the U.S. and Canada. Visit the official ApeMax website for up-to-date information before purchasing tokens."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPU3RlY3lMU1M1b0dsQTRpUEpnbF9oZDkwcmYxMnBGNHdscjlUb3E4Tm4ySzRnamlvQTR6RjlKZlBhaU1XMlVkQklqLXdnQTJLLXhyYWRLTWd1MmNwQWM2Y1k3WGx1MmRjZ0RBSjc3c0c1S1A2VXZqbVNQbUtna0FIRkZRNUd0WGgzUTlHck1HQ18tTUJHdGI1czVqdElHaVJJZk55U0o3TDAyRURZWFpVQVhqeDd0bVZyUENTNE05dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Could Hit $4,000 as Standard Chartered Foresees Spot ETH ETF Approval by May - Crypto News Australia",
        "content": "Standard Chartered Bank tells clients it expects Ethereum spot ETFs to be approved on May 23, and that ETH price could pump to US$4000 in lead up.\n\nFirst ETFs are expected to exclude staking rewards and simply track Ethereum’s spot price.\n\nOptimism not widely shared—others believe approval is unlikely this year and possibly not until 2026.\n\nEthereum is set to pump as it mirrors Bitcoin’s price action in the run up to the approval of its own spot ETFs—that’s the message contained in a report Standard Chartered Bank sent to its clients on Tuesday.\n\nThe bank suggested the price of ETH could hit US$4000 before the launch of Ethereum spot ETFs, which it expects will be approved on May 23 when the final deadline for a decision rolls around.\n\nHistory Doesn’t Repeat, But It Often Rhymes\n\nIn the report, Standard Chartered’s Head of Forex and Digital Assets Research, Geoffrey Kendrick, wrote in a section titled “History doesn’t repeat itself, but it often rhymes” that he expects the SEC’s approval process for Ethereum spot ETFs to be similar to that used for Bitcoin ETFs:\n\nWe expect pending applications for ETH U.S. spot ETFs to be approved on May 23, the final deadline for the first of the ETFs under consideration — the equivalent date to Jan. 10 for BTC ETFs Geoffrey Kendrick, Head of Standard Chartered Bank’s Forex and Digital Assets Research Geoffrey Kendrick, Head of Standard Chartered Bank’s Forex and Digital Assets Research\n\nKendrick also speculated that if Ethereum’s price action mirrors that of Bitcoin in the lead up to the approval of BTC spot ETFs, ETH could hit the US$4000 mark:\n\nAdvertisement\n\nIf ETH prices perform similarly to how BTC prices performed in the lead-up to BTC ETF approval, ETH could trade as high as $4,000 by then. Geoffrey Kendrick, Head of Standard Chartered Bank’s Forex and Digital Assets Research Geoffrey Kendrick, Head of Standard Chartered Bank’s Forex and Digital Assets Research\n\nAt the time of writing Ethereum was changing hands at US$2337, as per CoinGecko.\n\nStandard Chartered has a history of bullishness around crypto, predicting in 2023 that Bitcoin could reach US$120,000 by the end of 2024 and ETH could reach US$4,000. The bank also puts ETH’s long term ‘structural’ valuation at a whopping US$26,000 – $35,000.\n\nThere’s also the potential for the price of ETH to plummet after the launch of spot ETFs, as we saw with Bitcoin. However Kendrick thinks this is less of an issue for ETH as Grayscale Ethereum Trust holds much less of the overall supply of ETH than was held in its Bitcoin trust product—which was the source of much of the sell pressure following the launch of the spot ETFs.\n\nFirst Wave Of ETFs Expected To Exclude Staking Rewards\n\nKendrick said he expects the first round of Ethereum spot ETFs approvals will only follow the spot price of ETH. That is, they will not include staking rewards — although he expects these to come later, noting these products are already available in Europe:\n\nBoth types exist in Europe; AETH [21Shares Ethereum Staking ETP] is the largest ETF that includes staking yield rewards. However, given that AETH has higher fees than ETH, staking rewards are offset by fees. Geoffrey Kendrick, Head of Standard Chartered Bank’s Forex and Digital Assets Research Geoffrey Kendrick, Head of Standard Chartered Bank’s Forex and Digital Assets Research\n\nMarket Not Confident Approval Imminent\n\nStandard Chartered’s confidence in the imminent approval of Ethereum spot ETFs is not shared by the market more broadly — in the report Kendrick notes that “based on market commentary, we believe approval expectations are relatively low, likely below 50%.”\n\nIn fact, recent communications from some other financial institutions have predicted no approval this year at all. A note to clients from investment bank TD Cowen released Monday put the estimated approval timeframe somewhere in 2025 or 2026. Jaret Seiberg, the leader of the bank’s Washington Research Group, cited political issues as the cause of the delay:"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMi_AFBVV95cUxPdWhLSjRWQlBuc2poMFpwNDUwUXk4NzM0S3F0WEZubDZZeFMwa3MwUlF6bXR5Rkctc0xLZ3V1aklMYTgzeHFlejlIVkhnLVpnTzg2RVM3MlM3NHZNOEFCeGJ5RzNnWFgyUmtYVXBxNVlna0JhenhtQXJqeTZVVmV2S080YjI2MGpDeVNyc3V1LWRoczhxZVF0VWtVY3ZTUUoxUXhNMmpWd2t0XzRtWWhJX2ZVdUtsMHcyNndpYi11akhobEJCLXE5TXgzSmZzYVgxaFJ6VllLdUdydEtfaVdrU1pDXzdDT1NyX19yRUMwWGhmc29LTFpaTFQ0ZU_SAYICQVVfeXFMUGN6em9BSGtCQXdSSUYzYUF4QkFQV0x2bDFoTVV1bHQ1ajZBV2ZlNm5kSnc0NGd6TGNwaHhEbFVacWdiVVVpeXRQMFJhNUdnZFRiTlY1MTdlbjZZOWM1RDdKTWN5TmVjV3V4Qm9NSVFjdmM0bklLNXNlSTF5NGR4Ui15amhaY244LURia1FXNEpkclJ4dmhtV2xNM2tQR0pObm9vX1RQUXp2LWVnM3Raa3VrdHhuXzZ5YnZJdWZtNEZhNUhVMTZ1YjRzQjVXcG1wUkJOOUk1N2dMQTRkVGtxcVhCQXBuMkhWR0J1OG1QTUFxUUlhckk1THhGY2hLbGZSbkln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Dips Below $43,000 Once Again As Top Coins Land In Reds - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, dipped below the $43,000 mark early Wednesday. Ethereum (ETH) managed to rise above the $2,300 mark with a minor gain. Other top coins, including the likes of — Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — landed in the reds across the board. The Render (RNDR) token emerged to be the biggest gainer of the lot, with a 24-hour jump of nearly 8 percent. BLUR, on the other hand, became the biggest loser, with a 24-hour dip of over 7 percent.\n\nThe global crypto market cap stood at $1.65 trillion at the time of writing, registering a 24-hour dip of 0.86 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $42,911.16, registering a 24-hour dip of 1.46 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 37.77 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,343.84, marking a 24-hour gain of 1.74 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.07 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour dip of 2.01 percent, as per CoinMarketCap data, currently priced at $0.08017. As per WazirX, Dogecoin price in India stood at Rs 7.01.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour dip of 0.32 percent. At the time of writing, it was trading at $67.96. LTC price in India stood at Rs 5,950.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5103, seeing a 24-hour loss of 5.07 percent. As per WazirX, Ripple price stood at Rs 44.67.\n\nSolana (SOL) Price Today\n\nSolana price stood at $101.15, marking a 24-hour dip of 1.52 percent. As per WazirX, SOL price in India stood at Rs 8,799.16.\n\nTop Crypto Gainers Today (January 31)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nRender (RNDR)\n\nPrice: $4.67\n\n24-hour gain: 7.90 percent\n\nChainlink (LINK)\n\nPrice: $15.89\n\n24-hour gain: 6.13 percent\n\nPyth Network (PYTH)\n\nPrice: $0.4182\n\n24-hour gain: 5.59 percent\n\nRonin (RON)\n\nPrice: $2.72\n\n24-hour gain: 4.87 percent\n\nNeo (NEO)\n\nPrice: $11.67\n\n24-hour gain: 4.58 percent\n\nTop Crypto Losers Today (January 31)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nBlur (BLUR)\n\nPrice: $0.6251\n\n24-hour loss: 7.21 percent\n\nBonk (BONK)\n\nPrice: $0.00001115\n\n24-hour loss: 7.18 percent\n\nManta Network (MANTA)\n\nPrice: $3.36\n\n24-hour loss: 7.03 percent\n\nInternet Computer (ICP)\n\nPrice: $11.68\n\n24-hour loss: 6.16 percent\n\nHelium (HNT)\n\nPrice: $7.48\n\n24-hour loss: 5.67 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin surpassed $43,000 yesterday and is currently stabilising at $42,000. The market's attention is on the Federal Reserve's interest rate decision today, widely expected to remain unchanged. Should Bitcoin maintain its current price level until the month's end, it will achieve its fifth consecutive monthly increase, marking the longest streak. This is likely to continue until Bitcoin halving takes place.”\n\nCoinSwitch Markets Desk noted, “Even as Bitcoin found some resistance near the $43.8k mark, the overall market structure still remains bullish in shorter time frames as well with the immediate strong support lying at $42.3k. All eyes will be on Federal Reserve today as Fed is expected to keep rates unchanged in their interest rate decision meeting today. Interestingly, markets are giving it a 44 percent chance that the Fed will start cutting rates from the next meeting. If the Fed Chair indicates otherwise in his speech, we can say another red day.”\n\nRajagopal Menon, Vice President, WazirX, said, “In terms of momentum, the MACD Level (12, 26) at -164 signals a ‘Buy.’ The Stochastic RSI Fast (3, 3, 14, 14) at 92 and William's Percentage at -20 both indicate a ‘Neutral’ position. The market has slipped into a ‘Neutral’ sentiment after a week of ‘Greed’ with the price of Bitcoin rising. However, the Fed’s interest rate decision might alter that. The market is on edge awaiting the SEC's interest rate verdict, causing uncertainty about Bitcoin's next support level, contrary to Q4 2023 expectations of a rate cut. Ethereum remains optimistic, poised for a potential ETF approval in May. Altcoins like Litecoin and Astar faced recent declines amid market fluctuations. Despite the current downturn, an impending alt season is anticipated post-Bitcoin halving.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The crypto market is in a wait-and-watch mode as the Fed meeting on the first interest rate decision of 2024 is underway. A decision to cut the interest rate will boost market liquidity and spark economic activity across sectors, there are some reports that the Fed may keep the rates unchanged. It is important to note that interest rates are at a high level due to continuous hikes in 2023 to tame inflation. Bitcoin is well-positioned to start another growth cycle owing to positive macroeconomic factors.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin rose more than 10% to surpass $43,000 and Ethereum neared $2,500, fueling discussions about price predictions. Grayscale's reduction in bitcoin sales and the performance of the US stock market fueled the rally. Despite the optimism, the upcoming US Federal Reserve meeting and January jobs numbers are emerging, weighing on forecasts. Bitcoin's $43,000 recapture boosted its market cap by 2% to $1.66 trillion in 24 hours. Whales piled up more BTC despite a temporary drop to $38,000, giving Bitcoin its fifth consecutive monthly gain. Google's approval of Bitcoin ETF ads marks cryptocurrency mainstreaming, albeit with risks. Ethereum's cautious rally to $2,346.5 with resistance at $2,477.2 and support at $2,240.6 suggests neutral to slightly bullish sentiment. In particular, vigilance is recommended near key points.”\n\nCoinDCX Research Team told ABP Live, “In the last 24 hours, the crypto market has witnessed positive momentum, with ETH standing out by outperforming BTC. This surge in ETH is attributed to the smooth implementation of the Ethereum Dencun Upgrade on Sepolia. As of now, ETH is positioned slightly below the crucial range resistance level at $2380. The fact that it has reclaimed the 20EMA Daily is a positive indicator. Breaking above this range is pivotal for signalling a potential upward move. On the other hand, BTC has maintained stability, hovering around $43,000. It remains above both the 20 and 50 EMA Daily. For a substantial upside move, BTC needs to overcome the key resistance level at $44,500.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9YWnpYVU1jX1NfZWlXaHdnSWFhTm1kQk1XRFF3U080Wjh5cmhab2ROZkotUXBfQlg1MU9YZm9SQTh6bzFLUUdCdUt1UmlqTEJoaUZSZ0ZOYk5sNFBpeWFlOXFlV0dHM0hoSG1hT0NjRGxtQ2dtUWRWQldKcHjSAYABQVVfeXFMTWVKeE1aZk84QjBJOHlVeUppSHc2ZDBnX01HemdBRHllVnJJelNMUFl3dG1TaVpMN1hGQ2ljY3p0b0JkWnFJVFJfaEZCLUpocnlCNHJuY25JTGFnakxneG1xZFlOd1NHenpfOW9nbExWb3dNVExud1BQRHJNeGJnSzI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction – ETH Price Estimated to Reach $ 2,509.48 By Feb 04, 2024 - CoinCodex",
        "content": "Disclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision.\n\nEthereum is up 3.29% today against the US Dollar\n\nETH/BTC increased by 2.36% today\n\nEthereum is currently trading 5.06% below our prediction on Feb 04, 2024\n\nEthereum gained 3.22% in the last month and is up 51.67% since 1 year ago\n\nEthereum price $ 2,382.46 Ethereum prediction $ 2,509.48 (8.16%) Sentiment Bullish Fear & Greed index 61 (Greed) Key support levels $ 2,271.54, $ 2,220.91, $ 2,192.35 Key resistance levels $ 2,350.74, $ 2,379.30, $ 2,429.94\n\nETH price is expected to rise by 8.16% in the next 5 days according to our Ethereum price prediction\n\nEthereum price today is trading at $ 2,382.46 after gaining 3.29% in the last 24 hours. The coin outperformed the cryptocurrency market, as the total crypto market cap increased by 4.21% in the same time period. ETH performed well against BTC today and recorded a 2.36% gain against the world’s largest cryptocurrency.\n\nAccording to our Ethereum price prediction, ETH is expected to reach a price of $ 2,509.48 by Feb 04, 2024. This would represent a 8.16% price increase for ETH in the next 5 days.\n\nETH Price Prediction Chart\n\nBuy/Sell Ethereum\n\nWhat has been going on with Ethereum in the last 30 days\n\nEthereum has been displaying a positive trend recently, as the coin gained 3.22% in the last 30-days. The medium-term trend for Ethereum has been bullish, with ETH increasing by 29.73% in the last 3 months. The long-term picture for Ethereum has been positive, as ETH is currently displaying a 51.67% 1-year price change. On this day last year, ETH was trading at $ 1,570.83.\n\nEthereum reached its all-time high price on Nov 10, 2021, when the price of ETH peaked at $ 4,867.17. The current ETH cycle high is $ 2,714.13, while the cycle low is at $ 897.01. ETH has been displaying low volatility recently – the 1-month volatility of the coin is at 5.39. Ethereum recorded 14 green days in the last 30 days.\n\nEthereum technical analysis for today - Jan 30, 2024\n\nThe sentiment in the Ethereum markets is currently Bullish, and the Fear & Greed index is reading Greed. The most important support levels to watch are $ 2,271.54, $ 2,220.91 and $ 2,192.35, while $ 2,350.74, $ 2,379.30 and $ 2,429.94 are the key resistance levels.\n\nBullish sentiment for Ethereum\n\n25 indicators are currently signaling a bullish prediction for Ethereum, while 3 indicators are showing a bearish forecast. With 89% of indicators favoring a positive prediction. This results in an overall Bullish sentiment for Ethereum.\n\nCrypto market is currently experiencing Greed\n\nCurrently, the Fear & Greed index is at 61 (Greed), which signals that investors have a positive outlook on the market. The Fear & Greed index is a measure of sentiment among cryptocurrency investors. A “Greed” reading suggests that investors are currently optimistic about the cryptocurrency market, but can also be an indication that the market is overvalued. A “Fear” reading, on the other hand, signals that investors are currently hesitant about the cryptocurrency market, which potentially represents a buying opportunity.\n\nEthereum moving averages & oscillators\n\nLet’s take a look at what some of the most important technical indicators are signaling. We’ll be going through key moving averages and oscillators that will allow us to get a better idea of how Ethereum is positioned in the market right now.\n\nPeriod Daily Simple Daily Exponential Weekly Simple Weekly Exponential MA3 $ 2,355.65 (BUY) $ 2,358.10 (BUY) - - MA5 $ 2,282.69 (BUY) $ 2,351.69 (BUY) - - MA10 $ 2,265.78 (BUY) $ 2,316.78 (BUY) - - MA21 $ 2,395.29 (SELL) $ 2,236.08 (BUY) $ 2,947.29 (SELL) $ 2,051.33 (BUY) MA50 $ 2,310.44 (BUY) $ 2,081.14 (BUY) $ 2,595.06 (SELL) $ 1,911.87 (BUY) MA100 $ 2,159.32 (BUY) $ 1,950.33 (BUY) $ 1,573.39 (BUY) $ 1,882.45 (BUY) MA200 $ 1,952.52 (BUY) $ 1,857.82 (BUY) $ 2,072.32 (BUY) $ 1,662.01 (BUY)\n\nPeriod Value Action RSI (14) 47.84 NEUTRAL Stoch RSI (14) 21.95 NEUTRAL Stochastic Fast (14) 33.56 NEUTRAL Commodity Channel Index (20) -66.67 NEUTRAL Average Directional Index (14) 15.86 NEUTRAL Awesome Oscillator (5, 34) -111.08 NEUTRAL Momentum (10) -172.19 NEUTRAL MACD (12, 26) -24.02 NEUTRAL Williams Percent Range (14) -66.44 NEUTRAL Ultimate Oscillator (7, 14, 28) 53.51 NEUTRAL VWMA (10) 2,298.69 BUY Hull Moving Average (9) 2,231.98 BUY Ichimoku Cloud B/L (9, 26, 52, 26) 2,441.17 NEUTRAL\n\nThe Relative Strength Index (RSI 14) is a widely used indicator that helps inform investors whether an asset is currently overbought or oversold. The RSI 14 for Ethereum is at 47.84, suggesting that ETH is currently neutral.\n\nThe 50-day Simple Moving Average (SMA 50) takes into account the closing price of Ethereum over the last 50 days. Currently, Ethereum is trading below the SMA 50 trendline, which is a bearish signal.\n\nMeanwhile, the 200-day Simple Moving Average (SMA 200) is a long-term trendline that’s calculated by taking an average of the ETH closing price for the last 200 days. ETH is now trading below the SMA 200, signaling that the market is currently bearish.\n\nThe bottom line about this Ethereum prediction\n\nAfter considering the above factors, we can conclude that the current forecast for Ethereum price prediction is Bullish. ETH would have to increase by 8.16% to hit our $ 2,509.48 target within the next five days. Moving forward, it will be important to monitor the ETH market sentiment, the key support and resistance levels, and other metrics. However, we have to keep in mind that the cryptocurrency markets are unpredictable, and even the largest crypto assets display a lot of price volatility. For long-term Ethereum price predictions click here.\n\nDisclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE84QTBnaGQ1cXJkakJyQUd6M0ozZHVDMWI5UDlWYnNIMlpDeDZVQ2dwdUp1dXRXcnEya3l4emg1Vjlkd2lHR0dsMFFPR082X3BNdFV2S1VoSDBnd1ZsX1hEaE50cF9mV0JmbmdpalltTlprdldF0gF6QVVfeXFMTmd3M190XzFfRXh4Nzdrb3lqdnNOWGkyUWoyWmhEMFIxdWw0cGlsZllzSXJlbGdxZ1puUjhOc1hISGtncGg1T29jMkZMd0gzT29paHN5MGlEbXVPNmtSUWJ2SEkwU3k0U09TUGplbkhNWmI3b1JVY3lxMUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 09:03:46 GMT",
        "title": "Why Solana Beats Ethereum In This Bull Cycle: Crypto Expert - NewsBTC",
        "content": "In a recent analysis, Andrew Kang, co-founder and partner of Mechanism Capital, provided a comprehensive analysis of the cryptocurrency market, focusing on the comparative strengths of Solana (SOL) over Ethereum (ETH) in the current bull cycle. Kang shared his insights via X, the platform formerly known as Twitter.\n\nCentral to Kang’s argument is the idea that in the current market, Solana presents a more favorable trading option than Ethereum. He states, “The definition of insanity is repeatedly trying to long ETHBTC when longing SOLBTC (or SOLETH) is the much better trade in a bullish environment.” This succinctly captures his perspective on the shifting dynamics between these major cryptocurrencies.\n\nWhy Solana Is The Superior Trade Than Ethereum\n\nKang offers a retrospective view of Ethereum’s journey, noting, “Over the first 6-7 years of ETH’s life, there was a lot of uncertainty and lack of education around ETH. There were a lot of Bitcoin holders to be converted to Ethereum holders.” He recognizes Ethereum’s early volatility and its eventual emergence as a stable trading asset.\n\nRelated Reading\n\nHowever, he suggests that this relative stability has now become a double-edged sword: “ETH also became a ‘safe’ risk-on asset that traders could get into in size. That’s what made it a great cross to trade. But over time, people’s allocation to eth vs btc started to harden and the amount of people left to convert whittled away.”\n\nAddressing Ethereum’s advancements in technology, Kang points out a paradox. He states, “While these [Layer 2 solutions and Modular technology] might seem like good things, it is these characteristics/innovations that weighs heavy on ETH during risk on periods where ETH previously outperformed.” He suggests that these developments, though innovative, have introduced new complexities that impact Ethereum’s performance in bull markets.\n\n“Yes, you may have some conversion from BTC to ETH during risk on periods (much less so these days), but in this era ETH faces much more rotational pressure from those going from ETH as their base asset to these very L2s, modularity coins, SOL, those capitulating ETHBTC longs, and other shitcoins that it is supposed to benefit from,” Kang claimed.\n\nRelated Reading\n\nRising Stars: Report Highlights 5 Solana Projects Set For Success In 2024 8 months ago\n\nIn contrast, the crypto expert highlights Solana’s advantages, asserting, “Not only does SOL not face these same issues but it also has crossed the chasm in becoming a blue-chip Layer 1.” He emphasizes Solana’s resilience and its appeal to conservative investors who previously focused mainly on Bitcoin and Ethereum.\n\nKang further elucidates, “Conservative giants that previously were comfortable with BTC and ETH have SOL as an easy, safe next step. It is this transition phase of becoming a new major or base asset that you want to ride. A young fast horse, not a horse encumbered by the troubles of age, baggage and Jared Gray.”\n\nSignificantly, Kang notes a major shift in market dynamics, stating, “There was a secular shift in the collapse of ETHBTC volatility in 2023.” He posits that this shift has redefined the comparative advantage in favor of Solana. Concluding his analysis, Kang confidently asserts, “Even if that ever changes, SOLBTC will be the superior trade.”\n\nAt press time, SOL was just 30% short of a new all-time high against ETH.\n\nFeatured image from securities.io, chart from TradingView.com"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE1vNy1nSVQ5eWwzdmxZdHQ0YzJ1bXZkU3VvOW12Qm84WkUwQWxSUVBtYmdFMkpOWVVTd1RhMVhrMVRrUnFUbjJ6WFQ0NWRvYWNua3VNNldxWmNXY3BHNExoM0RlOXZ4VVRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "What is the Ethereum Dencun Upgrade? - BSC News",
        "content": "ETH\n\nRecently deployed on the Sepolia test network, the Ethereum Dencun upgrade is a crucial step towards the anticipated \"proto-danksharding\" feature.\n\nEthereum, a pioneer in blockchain technology, is set for a transformation by deploying the Dencun upgrade on the Sepolia test network. This marks a crucial step toward the anticipated \"proto-dank sharding\" feature, offering a glimpse into Ethereum's future.\n\nBut what exactly is the Dencun upgrade, and how does it promise to enhance the Ethereum network? Let’s find out.\n\n‍\n\nEvolution of Ethereum Since 2023\n\nIn order to understand Dencun, let's take a look back at Ethereum's journey. The Shanghai upgrade, implemented on April 12, 2023, brought significant optimizations to the Ethereum Virtual Machine (EVM) and introduced various protocol enhancements.\n\nThis upgrade aimed to boost gas efficiency, reduce transaction costs, and enhance the overall user experience – a pivotal stride toward Ethereum's scalability and sustainability.\n\nThe Anticipated Dencun Upgrade: A Game-Changer\n\nNow, all eyes are on the Cancun-Deneb (Dencun) Upgrade, representing the next phase in Ethereum's evolution. Comprising enhancements to both the execution layer (Cancun) and the consensus layer (Deneb) of the Ethereum network, Dencun promises substantial changes to scalability, security, and usability.\n\n‍\n\nEthereum Cancun-Deneb (Dencun) Upgrade Highlights\n\nCancun: Enhancing Scalability\n\nThe Cancun upgrade, focusing on the execution layer, introduces several Ethereum Improvement Proposals (EIPs) aimed at enhancing scalability and optimizing gas efficiency. Notable among them is EIP-1234, adjusting the block reward and delaying the \"difficulty bomb\" to ensure a smooth transition to Ethereum 2.0.\n\nDeneb: Improving Consensus and Security\n\nThe Deneb upgrade targets the consensus layer, aiming to enhance security and consensus mechanisms. Key among the EIPs is EIP-2322, upgrading the Ethereum Proof-of-Stake (PoS) consensus algorithm for increased robustness and efficiency.\n\nFinalized EIPs for Implementation\n\nSeveral finalized EIPs will be implemented, including:\n\nEIP-1559: Introducing a new fee structure to improve user experience and reduce transaction fees.\n\nEIP-2929: Enhancing security by increasing the cost of certain operations to deter potential attacks.\n\nEIP-2537: Proposing a new Ethereum-specific opcode for more efficient contract verification of elliptic curve signatures.\n\n‍\n\nExpected Benefits of Dencun Upgrade\n\nThe Ethereum Cancun-Deneb Upgrade holds deep promise for the ecosystem:\n\nIncreased Security\n\nImplementing EIPs such as 4788, 6780, and 7514, Dencun addresses security concerns at both the user application and consensus levels. Measures include incorporating the parent beacon block root into the execution layer, optimizing opcode functionalities, and introducing a temporary solution for validator bloat.\n\nImproved Staking Experience\n\nOn the consensus layer, EIP-7044 and EIP-7045 aim to enhance the staking user experience and block confirmation times. The validity of voluntary exits in delegated staking will be perpetual, and validators will have more time to submit attestations, contributing to faster confirmation times.\n\nEnhanced Cost Efficiency\n\nIntroducing EIP-5656 and EIP-1153, the Cancun upgrade adds new opcodes to benefit dApp developers. These opcodes improve gas cost optimization, making smart contracts more efficient with zero trade-offs and introducing transient storage for communication within complex transactions.\n\n‍\n\nProto-Danksharding: Scaling Ethereum Further\n\nA significant advancement in Dencun is the introduction of danksharding and proto-danksharding, aimed at scaling the Ethereum blockchain and improving its efficiency. Danksharding involves dividing the Ethereum blockchain into smaller \"blobs,\" enabling parallel processing for enhanced scalability.\n\nProto-danksharding, or EIP-4844, builds upon this concept, expanding storage capacity for more efficient data processing and reduced gas fees for layer-2 solutions.\n\n‍\n\nDencun Upgrade Timeline\n\nInitially planned for late 2023, deployment and consensus issues pushed the Dencun upgrade to 2024. The public testnet timeline is as follows:\n\nGoerli: Jan. 17\n\nSepolia: Jan. 30\n\nHolesky: Feb. 7\n\nThe Sepolia testnet has ended, and developers are encouraged to move to Holesky for future workloads. The mainnet launch is expected in early or mid-March, with flexibility depending on the smooth progression of implementations."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOZDFKdVpaVVEtd2RFWEkta2prbjZEZ2J5c3F6WW5ZczZxclBNY1ZXUjB2SWZab005ZExUUWwzaWNVMDJsZWhaZzl0bm55TlVoVzhMaEZ1WWY0WGFTd3ZvUkFQRGhYS2d3VC1ITTQ3SU5BbkFvTnE4U1Q0bUhoZTdoSjg1cTloaV9ILUUwWDdZbnVoQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Analysis: Strong Selloffs Looms as CME Gap Remains Open - Coinfomania",
        "content": "The CME Bitcoin Gap (also known as the CMG gap) is the difference between the closing price of CME Bitcoin futures contracts on Friday and the opening price on Sunday. It is a crucial indicator for many Bitcoin traders, and a great tool for improving profitability.\n\nGenerally, you can also improve your cryptocurrency trading efficiency by learning to use gaps as an indicator. It is essential to start with the basics when learning about CME gaps. This includes getting to know what gaps are and their types.\n\nWhat Are Gaps?\n\nA gap is created when the price of an asset opens above or below the previous day’s close with no recorded price movement in between. In simple terms, the space created on the price chart as a result of the above scenario is the Gap.\n\nOne of the responsible factors for this kind of move is news. Most times when the market is closed and positive or negative news drops, price movements are not recorded, creating a gap. Most times, these gaps show the end or beginning of a market trend.\n\nThere are different types of gaps. These are Common gaps, Breakaway gaps, Runaway gaps, and Exhaustion gaps.\n\nCommon gaps\n\nAs the name implies, these gaps happen often and are quickly filled. There are no notable occurrences that may trigger this sort of gap as they are often triggered by normal market force. Common gaps are also known as area gaps or trading gaps.\n\nBreakaway gaps\n\nBreakaway gaps occur when prices break an established chart pattern. It normally appears out of chart patterns like; a triangle, head and shoulder, cup and handle, a wedge.\n\nRunaway gaps\n\nThe runaway gap happens when the price movement skips a laid-out price point. Runaway gaps are triggered by intense investor interest and happen often when there is an exchange in the ownership of an asset.\n\nExhaustion gaps\n\nThis sort of gap is marked by a space lower in price after a fast rise in the price of an asset through several weeks. This gap shows or signals the end of an upward trend.\n\nWith a basic knowledge of gaps, let’s talk about the Chicago Mercantile Exchange (CME).\n\nAn Introduction to the CME\n\nThe Chicago Mercantile Exchange (CME) is the world’s largest derivatives trading exchange. CME offers futures and options contracts on any imaginable asset. These assets range from agricultural products to different commodities, cryptocurrencies, stocks, energy, and even forex.\n\nThe CME began offering Bitcoin futures on December 18,2017. In terms of volume, CME is the largest U.S. regulated trading venue for trading Bitcoin futures contracts, making it a key price discovery machine for investors.\n\nUnderstanding Bitcoin Futures Contracts\n\nIn its simplest form, Bitcoin futures contracts are derivatives that allow a buyer and seller to determine the future price at which an asset will be exchanged.\n\nFor instance, an investor can choose to enter a contract to buy Bitcoin at $40,000 by the end of the month, even though the current market price is $50,000. The buyer pays a small premium to open this contract and reserves the right to make or not make the purchase if the price of Bitcoin drops to $40,000 on the said date. If the price of Bitcoin fails to hit the strike price on the expiry date, then the contract expires and the contract buyer only loses the small amount paid as premium.\n\nBitcoin futures contracts are ideal as they allow investors to profit from an increase or decrease in the price of Bitcoin, without holding the underlying bitcoin. It also provides a sort of hedge for long-term investors, as they can get exposure to price action without selling their long-term holdings.\n\nBitcoin CME Gap Explained\n\nYou can trade cryptocurrencies from any unrestricted area around the clock. However, traditional assets do not trade 24/7 around the clock. For most traditional exchanges, there is a set time to open and close and CME also follows this normal rule.\n\nWhat time is CME Gap?\n\nCME trading hours close every week on Friday at 5:45 PM Eastern Standard Time (EST) or (10:45 PM London Time). The exchange resumes trading on Sunday at 6:00 PM EST (11:00 PM London Time).\n\nSince CME Bitcoin futures contracts stops trading on Friday to reopen on Sunday, there is always a price difference when it reopens. The price difference is the Bitcoin CME gap.\n\n(Source: TradingView)\n\nTo illustrate this, take Binance for example. You can trade on Binance at any you want; it does not have a fixed time to open or close. CME, on the other hand, has a fixed time to open or close.\n\nWhen CME closes, the price of Bitcoin continues to appreciate or depreciate. Due to the close of the market, the price movement is not recorded on the price chart, so when CME opens on Sunday the price continues with the same price as the spot market creating a gap on the price chart, which needs to be filled.\n\nHow Does The Bitcoin CME Gap Affect BTC Price?\n\nAs explained above, when CME’s Bitcoin futures contracts close every week, a gap is created. These gaps often fill in the sense that the spot price of BTC will go back to the CME closing price.\n\nSo let’s imagine CME closed at $50,200 and opens at $53,000. There is a gap of $2,800 in between that was not recorded on the price chart. So when CME resumes, depending on the type of gap, there is the likelihood of prices reverting to the close to filling that gap.\n\nBitcoin CME gaps typically occur over the weekend or during public holidays.\n\nHow to Make Money with the Bitcoin CME Gap\n\nCME’s Bitcoin prices may close at a high price and open at a low. When this sort of situation happens, the spot price will usually rise to fill the CME gap that was created. However, if the opening price after a weekend is higher than the closing price on Friday, then there’s a high chance that the spot price will correct within 24 hours after the market reopens.\n\nUsing this information, you can make decisions that will make your trading more profitable.\n\nFor example, let’s assume that a common gap appears on a price chart and BTC CME closed at $46,000 and opens at $43,700. It’s easy to predict what will happen as you’ve recognized what kind of gap it is and you know that prices will likely pump to fill the gap.\n\nWhen there is a breakaway gap, you know that the end of a price pattern is close, and depending on the pattern, you can foresee what will transpire later on and make your trading decisions accordingly.\n\nHow accurate are the CME Bitcoin Gaps?\n\nHistorically, the percentage of CME gaps that get filled is between 60-80%. Hence, using it as an indicator provides you with a degree of accuracy. A review of previous events could shade more light on this claim.\n\nCME Bitcoin Gap: Example 1\n\nThe image above shows a common gap. On Dec 31, 2020, CME’s Bitcoin futures closed at a $29,410 price. However, the spot price of Bitcoin went up to around $33,050 when CME opened on Jan, 3.\n\nSo, although CME reopened at around $33k after the celebration, it is almost impossible not to notice on the first chart that as soon as the market reopened, the current Bitcoin CME gap filled within 12 hours; the price dipped to the point it closed on December 31.\n\nCME Bitcoin Gap: Example 2\n\nAnother small common gap is seen in the image above. This gap was created from Friday, March 12 through Sunday, March 14. Trading closed at $57,515 and opened at $58,695 to match the increase in spot BTC price during the weekend.\n\nA small gap worth $1050 was filled the following day.\n\nIt is worth noting that CME Bitcoin gaps are not created equal as some gaps are wider than others. Also, while most Bitcoin CME gaps historically fill up within 24 hours, some take several days, and may not fill at all. For instance, there were Bitcoin CME Gaps created in 2020 when the asset was still trading around $10,000. There are also historical gaps between $8000-$24,000 which may never get filed,\n\nWhy do CME Gaps get filled?\n\nCME Gaps get filled because of the consensus effect. Since most Bitcoin traders assume that the gap will get filled, they place trades with the gap in mind. This affects the general market price movement and ensures that the CME gaps get filled as predicted. It is worth noting that this stance may change as Bitcoin continues to mature as an asset class.\n\nRelated: What Causes Cryptocurrency to Rise and Fall\n\nConclusion\n\nIn this article, we have seen what gaps are and their different types. We also discussed the responsible factors for the Bitcoin CME gap. Various charts were also shown to visualize the CME gap meaning and how traders can profit from it.\n\nIn the concluding part of the article, we discussed the reason why CME gaps provide up to 60-80% accuracy by providing different examples, showing how they formed and how they filled. As an exercise, you can try pulling up the spot Bitcoin price over the weekend and compare it with CME Bitcoin opening and closing prices.\n\nIn summary, the CME Bitcoin gap is another interesting indicator for every trader to consider."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPaEROVEwwSjBPT1RIVHREMmtXQURQUVZsbUtGM1lIYS1IbzhpZGdTSFRjbDV5SUdERTREREREXzhDV2hwUVJ1QjR3SkhHSG9WRVZFZ2NuX19FREhSTFphbW83RFUwRnFXOEs1ZEdnSnhvNTBjb1FQdVh5bkpQZDlRX0wzWXpyMTFISU1hZlFld2tWbW10S3Fud2hBcnhWejF6Qzc5SEZ4a1Q0UHlD?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Founder Vitalik Sees Bright Future in Crypto-AI Synergy But Issues Warning - Coinfomania",
        "content": "Let’s start with the basics. When you’re looking at the crypto market, especially in times where a bull run seems imminent, the key isn’t just to follow the hype but to make strategic moves. And if you’re reading this, you’re probably already thinking about how to catch that next moonshot. Here’s where crypto presales sometimes … Read more"
    }
]