[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQd095X01xVE11SFJCRjVmSjFwczh3c0tNa3A0SEg2US1KWHdtUElYOUdFZ3FVa2x2N2ZtTVhDZnQyNXV2eC11WmFFMXBIcVZvU2tMcDJZOGNOdFhSTzJheGxlNmxGYUwtWEpNdS1RbS1VMDk4QVhmbkRMMWFhUjdkcGlIb3lPSkdrWnZlcVpOeW9vc3hURzQ3eVhKVmlyY1JlS2JIM0JUM3Fwb2RQVzEyelZlX2g3YzNlNXpZY29oVGx0SUdQaGpGREJPTXRxUW05bXVxZWhFQ0R0UDNqUGcxQjY2TkFBN0I1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "EY launches OpsChain Contract Manager solution to support secure private business agreements on public Ethereum - EY",
        "content": "Facilitates the fulfilment of complex, multi-party business agreements, supporting confidentiality and helping improve time efficiency and cost reduction\n\nUtilizes public blockchain's security and accessibility with data privacy through zero-knowledge proofs (ZKPs), enhancing contract integrity and mitigating value leakage\n\nAddresses the enterprise challenge of managing multi-party contracts across siloed systems, internally and with business partners\n\nThe EY organization today announces the launch of EY OpsChain Contract Manager (OCM), a transformative blockchain-enabled solution for contract management. EY OCM helps enterprises to execute complex business agreements, supporting confidentiality, helping improve time efficiency, and achieving cost reduction, with automatic adherence to the agreed terms.\n\nLaunched at the annual EY Global Blockchain Summit, EY OCM helps address the enterprise challenge of managing business agreements that run across internal and external operational and technology siloes. EY OCM synchronizes data across business partners and uniformly enforces key business terms such as standardized pricing, volume discounts, rebates and strike prices.\n\nEnterprises often struggle to fully implement and capture value from their business agreements. Spend gets fragmented across internal enterprise barriers, making it hard to track and qualify for agreed-upon discounts and rebates. Smart contracts enable aggregation of spend across systems and even external business partners and then consistently applies contract terms.\n\nDriven by this value proposition, Zion Market Research predicts that the global smart contracts market will grow to an estimated US $1 billion by 2030 with a compound annual growth rate (CAGR) of roughly 24% between 2023 and 2030.\n\nThe solution runs on the Ethereum public blockchain, enabling truly decentralized operation in a trust-worthy environment. This helps avoid giving a strategic advantage to either a buyer or a seller and assists in eliminating the high costs of setting up and running a private network, as well as the risks that come from sharing sensitive business information with a centralized industry portal. The system maintains enterprise privacy using Zero Knowledge Circuits.\n\nThe EY OCM solution can be easily used in existing enterprise systems through a standardized API. Most business contract types can be supported including volume purchase agreements, standardized rate cards, volume discounts, rebates, and price models that depend on market data feeds. The first test users of the solution are implementing complex Power Purchasing Agreements (PPAs) that include market prices, strike prices with minimum and maximum purchase criteria.\n\nPaul Brody, EY Global Blockchain Leader, says:\n\n“We’ve identified from past client work that contract automation can improve accuracy while cutting cycle times by more than 90%, and overall contract administration costs by nearly 40%. With our zero-knowledge privacy technology, we have industrialized this capability, and we can now get these benefits at a fraction of the up-front cost. Deploying on a public blockchain is not only cheaper, but also much more scalable, helping enable many-to-many integrations on an open platform with no one company having an unfair advantage by controlling the network.”\n\nFor more information about EY Blockchain, visit: https://www.ey.com/en_gl/services/blockchain.\n\n-ends-\n\nAbout EY\n\nEY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.\n\nEnabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.\n\n\n\nWorking across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.\n\nEY refers to the global organization, and may refer to one or more, of the member firms of Ernst & Young Global Limited, each of which is a separate legal entity. Ernst & Young Global Limited, a UK company limited by guarantee, does not provide services to clients. Information about how EY collects and uses personal data and a description of the rights individuals have under data protection legislation are available via ey.com/privacy. EY member firms do not practice law where prohibited by local laws. For more information about our organization, please visit ey.com.\n\nThis news release has been issued by EYGM Limited, a member of the global EY organization that also does not provide any services to clients."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOZ09zdzk2UVZEOGJOTXMzY1N1X1AzOGs2R1pzRkFqR0VWeVBTOUNGY21Cd2d5Q1hPRFkzQU5BOHZYemZZaEYzT2t1aWZUYjNJYW9HeDBjSko2UG1JQnpNWVZYOGliYTdDcUlBaDZ4RWp5ZjVXa21OWlhIN2N6ak0yeGtPY3lKZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Cathie Wood's Bullish Ethereum (ETH) Prediction: How Much $1,000 And $10,000 Invested Could Be Worth - Yahoo Finance",
        "content": "Cathie Wood's Bullish Ethereum (ETH) Prediction: How Much $1,000 And $10,000 Invested Could Be Worth\n\nWhile Bitcoin has made headlines in 2024 with the approval of spot exchange-traded funds (ETFs) and the upcoming halving, Ethereum (ETH) is potentially positioned to make waves in the coming months and years, according to Ark Invest CEO Cathie Wood.\n\nArk Invest held its Big Ideas event, an annual opportunity to review high-level market trends and potentially disruptive technologies. At one of these events, Wood asserted that Ethereum could reach a market capitalization of $20 trillion by 2032.\n\nDon't Miss:\n\nDogecoin millionaires are increasing — Investors with $1M+ in DOGE revealed\n\nAbout 22% of the adult population in the U.S. own a share of Bitcoin, how much would $10 get you today?\n\nThe current market cap of ETH is around $400 billion and has approached $500 billion in 2024. The market cap of the S&P 500 is around $40 trillion to 45 trillion. If ETH were to amass a market capitalization of $20 trillion, the price per token would be around $166,000.\n\nThe Ark Invest CEO believes the mainstream adoption of ETH as a financial tool will be the main catalyst for this price prediction. Ethereum is a way for people to access decentralized finance applications. The applications allow anyone to interact with different financial actions, such as trading, lending, borrowing and staking, without going through a centralized intermediary. If these applications are adopted on a large scale, the demand for ETH — and its price — could increase.\n\nTalks of spot Ethereum ETFs are ongoing. Releasing the ETFs could have an impact similar to that of spot Bitcoin ETFs, which brought in huge amounts of inflows and propelled the price of Bitcoin higher.\n\nTrending: If you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\nBut potential ETF sponsors must face several regulatory hurdles, particularly related to the Security and Exchange Commission's (SEC) classification of ETH as a security rather than a commodity as BTC was classified. Despite this, some are still confident that ETH ETFs could come as soon as this year, which could positively affect the price of Ethereum.\n\nWood is known for making extraordinary predictions about tokens well into the future. For example, at Bitcoin Investor Day in March, she predicted that Bitcoin would reach a high of $3.8 million by 2030. While these predictions may have some merit, they are largely speculative and may be influenced by Ark's entanglement with the assets. The company was one of several that released a spot Bitcoin ETF (ARKB) and also offers an Ethereum futures ETF (ARKZ). So, Wood could be giving these predictions as a way to increase engagement with her firm's products.\n\nStory continues\n\nIf ETH reaches $166,000 per token by 2030, it would create huge gains. Specifically, an investment of $1,000 would be worth $54,330. An investment of $10,000 would be worth $543,300. These huge profits may not come to fruition, but according to Wood, it is a possibility.\n\nRead Next:\n\ncrypto digital assets\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Cathie Wood's Bullish Ethereum (ETH) Prediction: How Much $1,000 And $10,000 Invested Could Be Worth originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxQeTFUdXRTQllXYlRKM1ZpR3NCMHBuOGdEX3lGQ0N1TURBcHFaODJoRnh0QS1kbUdCbm12QXRFc0tDX0JwbDVYSGNuWDNuMkYzRVM1aWNPYWhTVTZ1UlgzWDBkWGRiYVlzOG0ycTNlM2Rwc1N4dk9NejhISGJBZEdSeEtZbGJDTURXZFRKcnlGZWdPSmZzelhuZXlEdFhKcEhFbDdBX0hZckE4WWRDZWNXYm1JT2VrWWJlMVRURjNpZzdwaEh3S1NPZFVhQkgySlRUZ3lpTXhXOGVKYVNSRE1LUzNqdGJMUEtVaUo1RjFXMXHSAfYBQVVfeXFMTkNhanpfWHpJajA3SUM3MWh1VEZTenlFaVhtYTZEVkZicHBsLVlsMXBScEowdnVheDNLUWFmcUpQOUtXRVRCeWJ0dUlVdXFQNnNPLTI3VWRKNkd5RUlYUzJzLVB5VEJQUl9zSmxzdFFvOHBVNmFqdnQya2JWVmpMVWo3a1I5T0M4QlFzQkRYX2swZE9nVS0teExaNFJiV0RzTWdOcmQtMG1Ld1RTcEpsTTZRbjF0dlpzNkEyZUZycUZLbHZmNUN4OTBUNDA1WGd1eVFwQU1tM2ZKZ0pzZk5WZ0xDOGlOZEJILU94QVFNTnQwSWw4Ti13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "‘It Can Be Said With Confidence the SEC Is Investigating Ethereum’: Consensys’ Bill Hughes Talks Crypto Law - CoinDesk",
        "content": "I think they are. It’s hard because the policy space is pretty confusing. The subject matter is pretty confusing. Many people they need to talk to just don't care one way or another. I mean, I'm biased, I'm on the board of Blockchain Association, but it does a really good job of keeping its membership informed, educating them about the Hill and and coming up with smart plans on how to pursue what we view as productive policy ends. Crypto lobbyists aren't some monolith. But there are people who are very effective both because they know the Hill and because they understand fundamentally what the technology is, what it can do and how we can figure out how public policy can be brought to bear to address some of the risks."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTE52VEZDOUxoQjdDOHFmakx3b293UHU3QW44VjA5ZjRCMjRtdlVRWWkwVWpGRDNlUzBrbmpOVHRXdDVCOHl6OXoxd1NybjdVcEdMMzcwYnJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "BlobScriptions: A New Type of Inscription on Ethereum - Unchained",
        "content": "BlobScriptions made waves in the Ethereum community as a new type of inscription, similar to Ordinal inscriptions on Bitcoin.\n\nEthereum blockchain underwent the Dencun upgrade in March 2024, introducing a concept called Blobs. Blobs are a novel data storage concept intended to lower transaction costs on layer 2 scaling solutions. While the concept was intended primarily to lower costs, some creators used blobs to develop “BlobScriptions.”\n\nRead on to learn what BlobScriptions are, how they work, and their similarities to Bitcoin inscriptions.\n\nWhat Are BlobScriptions?\n\nBlobScriptions are Ethscriptions that use EIP-4844 blobs to store additional data. Blobs, or binary large objects, were introduced to the network in the latest Ethereum network upgrade in March as a cost-effective solution for storing data on-chain. However, their ‘misuse’ is now dubbed BlobScriptions.\n\nTom Lehman and Michael Hirsch developed the concept by launching BlobScriptions.io, a platform enabling anyone to inscribe data onto a blob.\n\nTheir proposal, ESIP-8, was to use blobs to store data within the Etherscriptions Protocol, enabling data storage and allowing users to access blob data alongside other blockchain data currently utilized by the protocol.\n\nLehman said the idea was a means of democratizing blobs, making them available for everyone. For a fee of about $20, anyone, potentially including bots, can submit a BlobScription since blobs have made data storage on Ethereum 10x to 100x cheaper.\n\nHow Do BlobScriptions Work?\n\nBlobScriptions function similarly to Bitcoin inscriptions, allowing users to store various data types on Ethereum’s blobs, including images, text, and even tokens. Blobs are unique because they don’t interact with smart contracts, and nodes only need to store them for up to 18 days, making them cost-effective.\n\nWhen sharing data using blobs, one requires the content itself and the content type. Initially, data URIs were used to achieve this, but to make BlobScriptions cheaper; its creators implemented CBOR, which natively supports binary data.\n\nOnce the BlobScription payload is prepared, it needs to be split into one or more blobs, each consisting of 32-byte segments. These blobs are then sent as transactions to the Ethereum blockchain.\n\nThe Ethscriptions indexer, Ethereum RPC, and the Beacon API are then used to retrieve blobs. Using their versioned hashes, the blobs can be associated with individual transactions.\n\nAfter retrieving a transaction’s blobs, they can be decoded and concatenated into a single binary value using Viem’s “fromBlobs” method. This decoded data includes the content and content type, forming an “Ethscription Attachment,” also called a BlobScription. The indexer can then serve the attachment content via its API.\n\nRegarding the concern about blobs being removed from storage after 18 days, Ethscriptions indexers and other decentralized data stores retain the data, ensuring that as long as someone has it, the BlobScriptions can still be used.\n\nHow to Create a BlobScription on Ethereum\n\nTo create a BlobScription on Ethereum, follow these steps:\n\nStep 1: Visit the BlobScription Website\n\nYou need to first visit the BlobScription website to begin the process. Click on “Create a burner for me.” This creates a new wallet and imports the private key to a Web3 wallet like MetaMask.\n\nAfter importing, double-check if the displayed address matches your own.\n\nStep 2: Enter the Initial Owner\n\nThe next step requires you to specify the individual or entity credited with creating the BlobScription on the blockchain.\n\nStep 3: Choose a File\n\nYou will then select the data you want to store on the Ethereum blockchain via the BlobScription.\n\nStep 4: Create BlobScription\n\nClick the “Create BlobScription” button to finalize the process, and you have successfully created your first BlobScription!\n\nBlobScriptions vs. Bitcoin Inscriptions: Similarities & Differences\n\nNow, let’s look at the similarities and differences between BlobScriptions and Bitcoin Ordinal inscriptions.\n\nHere are some of the aspects in which they are similar:\n\nData storage purpose: BlobScriptions and Ordinal inscriptions allow users to embed data directly onto the blockchain. This data could include text, images, or any other digital content.\n\nImmutable storage: Once data on BlobSriptions and Ordinal inscriptions is embedded, it becomes part of the blockchain’s immutable ledger. Hence, the data cannot be altered or deleted.\n\nStill, BlobScriptions and Bitcoin Ordinal inscriptions have several differences, as outlined in the tale below.\n\nFeature BlobScriptions Bitcoin Inscriptions Blockchain Ethereum Bitcoin Data storage On Ethereum’s blobs On the Bitcoin blockchain Introduced After Dencun upgrade in March 2024 After Taproot upgrade Transaction type Data is inscribed onto blobs Data is attached to individual satoshis (sats) Cost Cost-effective as blob transactions have lower fees compared to calldata transactions Bitcoin Inscription fees depend on the size of the data being inscribed Permanence Data is temporary on Ethereum’s main network and may be preserved by external indexers Data remains on the Bitcoin blockchain indefinitely\n\nFinal Word\n\nMany Ethereum enthusiasts anticipate that the hype and use of BlobScriptions will be short-lived.\n\nAccording to Jim McDonald, co-founder of Ethereum staking provider Attestant, there’s an expectation that the pricing of blobs for layer 2 solutions will become more reasonable for their intended purpose over time. This could render Ethereum too costly for those seeking to utilize it merely as a “graffiti wall.”\n\nHowever, if BlobScriptions continue to gain traction or remain stable, the price of layer 2 solutions, significantly reduced by the March software upgrade, might increase more rapidly than anticipated. This could necessitate the development of new tools, and additional upgrades could be needed to lower the prices."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPYlphX1pjbmVjSWdrMGx4UFRwYkZHWENiWlhiS0psUDZ0NlR1TTVMS3ptSjg1SmhnakNWYjZoeERwUWRUWmh5czh3cDdrQWNqM0V0aWhHd19xV1pnYWpjbkw5Y25QbzJ4VW0zMkR2MVBnMl8wWktReDJlY0x5LXZpU1l4NWpDRHZ4VWlacFBmX3dRb3JoZmFuLTVUQXVUbWs0TkpZekRmb19TVjM50gGyAUFVX3lxTFBnd0l4RGU3OHhJZFI4SzJnLXFfNVFHQXVmbTN0RFhtN0NNdUxoVUtZQVduMzZXS2doZXF1SGRDOGVWOXZUWU1qMEl0aGtPMUxqRXlwTUpNdXBjNXBEWlJlT1VJSkUxaUhFcVRjdXRmQks0dGhsSlNiTWlFdVcweE1aNWlzcm45cFdQN1pwTkJ1OXRBMzlfS2VGT19KVFJNMkNsWE5leGRKV2FzcDYwcUJsUEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Cramer's Lightning Round: Instead of Marathon Digital, buy Ethereum or Bitcoin - CNBC",
        "content": "Stock Chart Icon Stock chart icon Exxon Mobil's year-to-date stock performance.\n\nExxon Mobil : \"Parabolic move, my friend. We don't like parabolic moves, that's a very good example.\"\n\nStock Chart Icon Stock chart icon Marathon Digital's year-to-date stock performance.\n\nMarathon Digital : \"If you want to own Marathon Digital, just go buy either Ethereum or buy Bitcoin, ok. Let's not fool around.\"\n\nStock Chart Icon Stock chart icon NuScale Power's year-to-date stock performance.\n\nNuScale Power : \"When it comes to data centers, I am inclined to say that no power company is going to make money off of it. Better to buy Vertiv or Eaton. That's the way to do it.\"\n\nwatch now"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPNjZGZHppUW96MC1BN0Y2Y1JNdmFRX2h6aGdNdm1Kd3RuRmNla3R6ZkxMbXJzREVXMWtaZjNzTlVHc1U4X1Mzalo4ME4zMUZONTgzemdHV3lSeERDdmlndGd4cHdFc0NaMTZxQjZiVDd3RUFUMl8yYnp3clRzTkM3aDROQ2x5UzBUN0RBQm03bGNmRndJQ0N1cNIBngFBVV95cUxNaVFwb2JQb1p0MkRXUWQyX3ZMQXh6eEFKM2ZGczdYSlkzQThLU2NHVFZfamN0ZjZEQXFOU1k1V3BGOHBoSmRZbDQxV3JyRFo5V05WWlA0Z2hiWDRjLU94MDc5V253S0VvdnIyZlBmX0pXY0YzQ1RjMV9rM19fRG9hNGs5X1F0WGhGLUNLRWdiaUlTbWFkQU9jTHZoNmwxUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "How fast can Ethereum recover from its latest dip? Key indicators say… - AMBCrypto English",
        "content": "Ethereum’s social activity has risen in the past 24 hours.\n\nHowever, bearish sentiments continue to climb.\n\nLeading altcoin Ethereum [ETH] has seen a spike in social activity following reports from multiple issuers in Hong Kong that their applications for spot bitcoin and ether exchange-traded funds (ETFs) have been approved, according to Santiment.\n\n?️ As #crypto prices have been on the decline, #Ethereum is seeing the fastest rise in discussion rate. The new #ETF has caused more interest in the #2 market cap asset, even though #shorts are rising rapidly. Also, keep an eye on #Beam's rise in interest. https://t.co/0bfF7HR4lw pic.twitter.com/j6zyJqpiMT — Santiment (@santimentfeed) April 16, 2024\n\nOn 15th April, in a series of announcements, China Asset Management, Harvest Global Investments, Bosera Capital, and other applicants confirmed that the Hong Kong Securities and Futures Commission (SFC) had approved them to list spot BTC and ETH ETFs in the region.\n\nThis resulted in a rally in ETH’s discussion rate on social media platforms.\n\nETH reacts but negatively\n\nDespite the spike in ETH’s social activity, its price has failed to see any significant price reaction. Exchanging hands at $3,086 at press time, the altcoin’s value has declined by 5% in the past 24 hours, per CoinMarketCap’s data.\n\nOn-chain data provider Santiment also noted that the period under review has been marked by a spike in ETH shorts positioned open. According to its post on X, this had grown by 54%, signaling the rise in bearish sentiment.\n\nAlthough ETH rose briefly to trade above $3,200 after the announcement of the series of ETF approvals granted by the Hong Kong regulator, bearish sentiments quickly overshadowed these gains.\n\nKey indicators assessed on a 1-day chart revealed the possibility of a further price dip in the short term. For example, the dots that make up the coin’s Parabolic Stop and Reverse (SAR) indicator rested above its price at press time.\n\nThe Parabolic SAR indicator is used to identify potential trend direction and reversals. When its dotted lines lie above an asset’s price, the market is deemed to be in a downtrend.\n\nMany traders interpret this as the time to exit long positions or initiate short positions.\n\nFurther, readings from the coin’s Moving Average Convergence Divergence (MACD) indicator confirmed the growth in bearish sentiments in ETH’s market.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAt press time, the coin’s MACD line rested under its signal line and below the zero line.\n\nWhen an asset’s MACD line crosses below its signal line, the short-term moving average is below the longer-term moving average. Traders interpret this to mean that the downward momentum is stronger in the short term."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNWW9yYWN6Q0k3S190Mm05Yk1tdUdjYVAyUkNLdWpRTENZTDNycUo4VDZVb1NwVTI4ak9VWURYdmRKRjBoNjdFdGhIemx1SWItVnhXX3NMa211TnE0ZGNvVGRQeVJjaFUyWHc1cHE4Y2prcEFPb3U3MlplZUJQNjVieWtuaXRub21Ldlk2eFA1cHNTWFJ4YXFzOHZXZjFSazVVaHhadm5lOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Top 4 accounting firm turns to Ethereum for blockchain-based business contracts - CryptoSlate",
        "content": "Big Four accounting firm Ernst & Young (EY) unveiled its new service for managing enterprise contracts via blockchain technology called OpsChain Contract Manager (OCM) on April 17.\n\nThe tool is designed to manage complex, multi-party business agreements with enhanced security and privacy via blockchain technology. The service is currently running on the Polygon proof-of-stake (PoS) blockchain and is slated for a future upgrade to the Ethereum mainnet.\n\nOCM\n\nOCM is designed to facilitate the secure handling of business contracts on a public blockchain, ensuring privacy by utilizing zero-knowledge proofs to maintain contract integrity and confidentiality while also improving time efficiency and reducing costs.\n\nIt integrates with existing enterprise systems through a standardized API and supports various contract types, including volume purchase agreements and price models dependent on market data feeds.\n\nWhile the service is currently promoted as operating on Ethereum, it actually utilizes Polygon PoS to capitalize on the lower transaction fees that are attractive to EY’s industrial user base, based on a report by the Block.\n\nPaul Brody, the head of EY’s blockchain division since 2016, said Nightfall — the technology behind the service — originated on Ethereum and has been tested on its test network. The forthcoming update will transition Nightfall to Ethereum’s mainnet and might include a Layer-3 upgrade to improve scalability and functionality.\n\nBenefits of public blockchains\n\nBrody also commented on the operational advantages of the OCM, noting that contract automation can significantly reduce cycle times and administration costs.\n\nHe emphasized the scalability and neutrality benefits of deploying on a public blockchain, which prevents any single party from controlling the network. Brody also noted that the future of corporate blockchain applications is increasingly leaning towards public blockchains, as they provide superior privacy and transparency compared to private blockchains.\n\nThe development comes in the wake of increased blockchain adoption by major financial players. Notably, BlackRock recently launched a tokenized fund on Ethereum, marking a significant step toward institutional engagement with blockchain technologies.\n\nWith the introduction of OpsChain Contract Manager, EY aims to improve how enterprises manage contracts, enhancing process efficiency and transparency through blockchain technology. The initiative positions EY as a pioneer in integrating blockchain into conventional business practices, setting a benchmark for the industry’s movement toward embracing this technology in routine operations."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNTlV3NzJPUGpySWNiaHFoM0JKSTU0aVpBVlRtT1piaXRFT0ZXcVJYbXpnNEltTk5LR2R4cW1BaTVwTTBIM3dfbU9EQ2c5UlNBcnpFc2gybGF5WHF0NGJxWlJCUzZCM0xBYzdVRGEtLXd2MzdnalN0SnRRclNhVnVpWVlIRnFaTzZncWY2UjFvYUFGQVJfY05wbVJaWTVRUTZLX19uaHJuNVJIUVRMWXFuSnlRRDFpSy00T25V0gHAAUFVX3lxTE4zd2RiMHp3ZXJOWDcydk16d0xRWEQ5NzZoZTdnQU81WkVWUW1tTzRrNWlVNjdQaVRNN1lndWY1YXl3S1J1cWVPUVF5YTFJRnVmRE5GTW16RGpZSC12dHZDaWgyT0ZkTktMN29pcGVlYVdHbnFPVWpfalZmTlE1ekk4amxNMmlBUVRzV3BXSGtORmtISXRXbW5MNm1iN3dIWHVOa3RlbnJIdXlmSjZBeFNKSy1zdm8zektweFJyNmJ5UA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Crypto Whale Loses $4,500,000 Attempting To Leverage Long Ethereum (ETH) Twice: Lookonchain - The Daily Hodl",
        "content": "A crypto whale recently lost more than $4.5 million attempting to long Ethereum (ETH) twice, according to the digital asset tracker Lookonchain.\n\nLookonchain notes the whale lost $500,000 on their first attempt to long the top smart contract platform, then lost a lot more on their second try.\n\n“This whale sold all 10,701 ETH ($33 million) on Binance to repay debt two hours ago, losing more than $4 million again!\n\nHe went long ETH by depositing ETH on Compound and borrowing USDT to buy more ETH.”\n\nCompound (COMP) is a decentralized lending platform.\n\nLookonchain notes that other whales are accumulating Ethereum. One withdrew 10,000 ETH worth $31.5 million from Binance on Monday and staked it into the decentralized finance (DeFi) project Pendle (PENDLE) and Renzo, a liquid restaking token for EigenLayer. EigenLayer is a restaking protocol built on ETH.\n\nThe other whale withdrew 5,282 ETH worth $48.2 million from the crypto exchanges Binance and OKX on Monday.\n\nETH is trading at $3,093 at time of writing. The second-ranked crypto asset by market cap is down nearly 12% in the past week and more than 14% in the past month.\n\nEthereum is also more than 36% down from its all-time high of $4,878, which it set back in November 2021, according to CoinGecko.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNWVl6N2JsU2dyRWpCMlo4Z1JDTVk0OFlXUFE3WTlUbXNDaDlTeDhKTUZuOE9GMnB3aHBJYkYzZ2dmQXpFRHVwZ3puZmtfWGVvOEJYM2FEakg2Z1MzYzdPNHczTFk3cXZyWUdDbkRtVHgtcG9pd09iVUFiSkJtZHBsbFJycV8ySndGaExVZS1TemVNZ9IBmgFBVV95cUxQeERlS3hnV2tCekF2SVJiQ0h4eER4VkVwSVNWc281bV9jcTJBa1VwZjdlWmJKYVgtdHd2Z2lfMUdWRTN5M1RHR0Y5dHA3VkpCVVVsOGRwbDdxMVlsOTJkdllncjZNSXhmQkJzaUw1WjRydElXbTdtcFBMaU1mVk5wd2pKSVM3NHd3bkFTQll6dTdCVzlkb29DSzJR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Peter Thiel-Backed Ethereum Layer-2 Launches Liquidity Program - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nLayer N, an Ethereum layer-2 network backed by Peter Thiel's Founders Fund, has launched a new liquidity program for apps built on its StateNet architecture.\n\nLayer N first came out of stealth in September 2023, when it announced it had closed a $5 million funding round backed by Founders Fund. Now Layer N says its new liquidity program marks a milestone in efforts to introduce sustainable and robust liquidity into the DeFi space, targeting protocols at their nascent stages to aid in their market entry.\n\nDigital finance firm Amber Group will be the first participant in this program, contributing a significant $20 million to help empower partners within the Layer N ecosystem. This collaboration underscores the program's intent to furnish developers with the necessary tools and funds to innovate and rival traditional financial institutions.\n\nDima Romanov, CEO and co-founder of Layer N, hailed the launch as a pivotal moment for the company and the broader DeFi landscape.\n\nAD\n\nAD\n\n\"By providing seamless access to liquidity and equipping developers with essential resources, we are setting the stage for a new era of innovation and growth in the DeFi sector,\" he said in a press release.\n\nSteven Shi, investment partner at Amber Group, said he regards Layer N as the premier architecture for DeFi applications because it is \"merging top-tier crypto infrastructure with high-performance capabilities without compromising Ethereum's security or fragmenting liquidity.\"\n\nHe emphasized Amber Group's commitment to supporting Layer N in fostering liquidity and expanding the ecosystem.\n\nThiel's Founders Fund has had a busy 2024. The fund participated in a $280 million Series D round for Neuralink, an Elon Musk-backed startup that's focused on brain hacking.\n\nAD\n\nAD\n\n“Excited to support Neuralink’s next chapter of helping human patients in need,” Scott Nolan, partner at Founders Fund, subsequently posted to Twitter at the time. “The team has been working for seven years to make this possible, pulling off technical breakthroughs that feel like science fiction.”\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Stacy Elliott."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPejl0Y21LRENFaG9XQmloS3hqTDBTci1rSUJUb1ZCazhpaXhtWDZlRGN5dnBDZks5Z3hCcHBQU3RscE1hT0hMTFRYMGhLa2FnY1RqMElmV0dua19uV19oUUJaYVlJRTJXLVZ5S0c5X2p5SXdXRDZ3aVFmaXdpRk1lLUlLUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin vs. Ethereum vs. Dogecoin: Top cryptocurrencies compared - Yahoo Finance",
        "content": "After a rough 2022 and much of 2023, cryptocurrencies are booming again. Some of the most popular digital currencies include Bitcoin, Ethereum and (perhaps surprisingly) Dogecoin.\n\nWhile cryptocurrencies typically have a few things in common, what are the differences between these three popular cryptos? Quite a lot actually, and here are some of the biggest distinctions.\n\nWhat cryptocurrencies have in common\n\nCryptocurrencies are built using what’s called blockchain technology, which uses a distributed ledger to produce, track and manage a digital currency. Think of it like a running digital receipt of all the transactions in the currency, including a list of who owns what and how much.\n\nThis “receipt” is being constantly verified by a decentralized network of computers, helping to prevent fraud and ensuring the proper functioning and accounting of the currency.\n\nThe idea is to eliminate the role of a traditional central bank in the creation, distribution and transfer of currency.\n\nCryptocurrency is “mined” by powerful computers called miners that perform complex math calculations to create coins. They also earn coins by processing transactions of the currency.\n\nThousands of cryptocurrencies exist, and literally any number could be created using similar blockchain technology. Cryptocurrencies allow the user to move money semi-anonymously, though the FBI and IRS are getting better at tracking transactions and freezing accounts.\n\nKey differences among Bitcoin, Ethereum and Dogecoin\n\nWhen you first start learning about crypto, three names come up constantly: Bitcoin, Ethereum and Dogecoin. People invest in each coin for different reasons, and it’s a mistake to lump the three most popular cryptocurrencies together into a single homogenous group.\n\nThe table below sums up some key differences among Bitcoin, Ethereum and Dogecoin.\n\nBitcoin Ethereum Dogecoin Symbol BTC ETH DOGE Year developed 2009 2015 2013 Initial purpose Created to be used as a currency or store of value Created to sell processing power of the decentralized network Created as a joke spoof of Bitcoin and the doge meme Approximate market capitalization* $1.3 trillion $388.8 billion $23.5 billion Number of coins* 19.68 million 120 million 143.9 billion Maximum number of coins 21 million Unlimited, but issuance is fixed Unlimited, but yearly issuance limited to 5 billion coins\n\nPurpose of the cryptocurrency\n\nEach of these three cryptocurrencies was created for a different purpose. Notably, Dogecoin was a satire on the rising popularity of Bitcoin and the doge meme featuring a charismatic Shiba Inu. Meanwhile, Bitcoin and Ethereum were created for more quixotic and serious purposes, including laying the foundation and framework for the entire cryptocurrency ecosystem and facilitating transactions.\n\nStory continues\n\nMarket capitalization\n\nThe market capitalization of each consists of the total extant coins multiplied by the current trading price, and there’s a wide divergence. Bitcoin is the largest, with Ethereum trailing a distant second and Dogecoin among the top 10, according to CoinMarketCap. Traders cluster around the most popular cryptocurrencies and volume drops significantly below the top 20.\n\nWhile these currencies may be among the most popular for traders, Bitcoin is the one that’s emerged among the mainstream. It’s becoming easier to access Bitcoin, with multiple ways to purchase or store the currency including the recent approval of a Bitcoin ETF, which lets investors get exposure to the cryptocurrency inside a traditional brokerage account. Of course, traders can also turn to popular apps to buy many cryptocurrencies, too.\n\nCoin issuance\n\nIt’s also useful to note how many coins can be issued in each cryptocurrency. Many traders have flocked to Bitcoin because of its hard limit on issuance, just 21 million. If money continues to flow into Bitcoin and demand rises, this fixed limit virtually ensures that the price will rise over time. While that may be good for traders, the volatility makes Bitcoin harder to use as a currency.\n\nIn contrast, Ethereum’s issuance is unlimited, but it has a fixed issuance schedule, which may slow the production of new coins. Meanwhile, the production of Dogecoin is unlimited, which is part of the joke. That unlimited issuance didn’t seem to stifle the currency from skyrocketing in 2021, rising from about a half-penny a coin on Jan. 1 to more than $0.60 in May. However, the coin trended downward through the course of 2021 and well into 2022.\n\nBottom line\n\nIf you’re considering trading cryptocurrencies, it’s valuable to understand that they’re not all created equal. Some features such as Bitcoin’s limited issuance may make a currency more attractive than others, at least over a longer period of time. But in the short term cryptocurrency is driven by sentiment, so even something created as a joke and with unlimited issuance may rally hard if a swell of interest sweeps in. “Much wow,” as a famous doge meme might say.\n\n— Bankrate’s Rachel Christian contributed to an update of this story."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQQm5iaFZwUWhRLWVjbHFxWFdvWXFqMk45RGdkVmJWb05yRHRubWtTWjM2bThabjlOVnZLaUYtM1BZcVYzQjNHM3pBUEZNelVRREx5YXM1Ym5EMEI2dENCd0JRcXBibTVSV2JfQTQtSHhIdVVEazg1Rm5tUU1yVndZZDF5RHJxQdIBiwFBVV95cUxPRy1SMmJ6QmpTMlBLWWttSktyVTk1b0VSejlUWVg5MWZqODRQT05vaDJKemNiZnFxM1Z2Z2EwS3hpbkVyVnBLb0t1QUdFQ0MwTHE0NVo5QkZYYm5oV3Vod2lOQ1F0TmdnelkzbmZ6MEhRbC1TM0Z1VmNuWm1XaDZsdnMxaUJpbWY5aFh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Why Ethereum is at a real risk of falling below $3,000 - AMBCrypto English",
        "content": "ETH was down more than 16% over the week.\n\nSelling pressure was dominant, with no signs of whale accumulation.\n\nThe world’s second-largest cryptocurrency, Ethereum [ETH], was witnessing intense sell-offs and seemed to be in danger of sinking below $3,000.\n\nAccording to CoinMarketCap, the leading digital asset dipped 5.43% in the last 24 hours, and more than 16% over the week, owing to a mix of crypto-specific, macroeconomic, and geopolitical triggers.\n\nThe On Balance Volume (OBV) indicator, that measures buying and selling pressure, was falling faster than ETH’s price. This meant that there was a higher likelihood of further downsides in the days to come.\n\nWatch out for these levels\n\nIn a downtrend, strong support levels become an area of keen interest for market traders.\n\nProminent on-chain analyst Ali Martinez flagged the zone between $2,000 and $2,400 as “critical” for nearly 9.37 million addresses bought 53 million ETH at these price levels.\n\nThis suggested that if the slide continues, Ether may hit a bottom at the aforementioned level and then bounce.\n\nWhat are ETH whales up to?\n\nWhile discussions on corrections and rebounds happen, whales were quietly snapping up ETH at lowered prices.\n\nAccording to on-chain tracking platform Lookonchain, two whales were seen accumulating a combined amount of more than 15,000 ETH coins Monday, worth nearly $70 million at prevailing market prices.\n\nInterestingly, one of the whales staked their share of the withdrawn amount, around 10,000 ETH, into decentralized finance (DeFi) protocols like Pendle Finance and Renzo.\n\nAMBCrypto took a bird’s eye of the ETH market using Santiment, and noticed a drop in large whale transactions in the last few days.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nMoreover, holdings of major whale cohorts dipped significantly during this time, suggesting that most investors were transferring their ETH to the aforementioned protocols.\n\nMeanwhile, the Ethereum Fear and Greed Index flashed a neutral market signal, implying a balance between bullish and bearish sentiments."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQUjN0RVd2ZC11RG5GblgzeC15X3NVeDQwbXZfMGF6QXJBdmNma1FPTWs5dTQ1UXgzLTFBaU9CSnk0SU5rck8tWDVKNEZXd2JJNE11Q3k1SWV3RDY3ejYwNHVtbzl0QXNFWHE0dElMbXA0aDRBcFJrTG5iWm1SV3pFcnluSlhMRHVWN0x0NkM4THByRVHSAZsBQVVfeXFMUHdGbzN4cUJZS0tkbTQxc3RJS2RWVEdsQWNrUW1MR3VicG9PSGJHaklaSG9ZYjNoYm1oWWdFMnBKeVBkYV8tZk9VWG1SOUpiVnhnRGdxS2hhZG11eDA4V25ZMWQ4QUcxQmlWSU1vOThQTUhqd09yd3ZvMTFhR0RFWHItcmJLbFJ3RFI3YWs4Ni16V3pibDFMdzlhaEU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum ETFs in Hong Kong Could Lead to 'More Progressive' Policies in China: OSL - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAt the start of the week, spot Bitcoin and Ethereum ETFs were conditionally approved in Hong Kong. Alongside this news, digital assets platform OSL announced it will be a “sub-custodian partner” for both the China Asset Management, also known as ChinaAMC (HK), and Harvest Global Investment ETFs.\n\nLooking forward, OSL's CEO believes that these ETFs could lead to a wave of “more progressive” regulation in China and potentially cause a ripple effect across the region.\n\n“[It] is likely to set a precedent for other financial markets in Asia,” Patrick Pan, Chairman of the Board and CEO of OSL, told Decrypt. “For China, this development in Hong Kong solidifies Hong Kong’s place as a unique financial center for innovations and may influence future regulatory considerations and market openness towards crypto, potentially leading to more progressive policies aligned with global standards.”\n\nChina has a long and rocky history with cryptocurrencies—effectively banning crypto multiple times.\n\nAD\n\nAD\n\n“Presently, there are rigorous regulatory controls over cryptocurrency transactions, expressly prohibiting the operation of cryptocurrency exchanges within its territory,” Thomas Zhu, the ChinaAMC (HK) head of digital assets and head of family office business, told Decrypt.\n\nBut with Hong Kong's status as a Special Administrative Region controlled by China—which has been called a ‘testing ground’ for China—its financial decisions may set the table for future movements on mainland China.\n\nLooking at the wider continent, both firms see the approval of spot ETFs as a catalyst for regulatory evolution.\n\n“It may prompt regulators to accelerate their own frameworks to accommodate such products, which may lead to a broader acceptance and deeper integration of cryptocurrency into the Asian financial landscape,” Zhu said, “potentially setting the stage for a new era of digital asset trading and investment in the region.”\n\nAD\n\nAD\n\nHowever, crypto-friendly countries like Japan, South Korea, and Singapore could be the first to be influenced, Zhu suggested.\n\nThe United States approved spot Bitcoin ETFs in January—11 years after the first application for a U.S. Bitcoin ETF was filed. This is a stark contrast to Hong Kong’s process, which OSL said has only taken four months.\n\n“In the U.S., where the legal framework and regulatory landscape have been highly fragmented—and at times, vulnerable to highly polarized political cycles—the journey for spot crypto ETF products has been far more arduous.” Pan told Decrypt. “Hong Kong’s framework has managed to prove once again that it can be mobilized quickly to innovate, while ensuring robust investor protection, setting a benchmark for crypto-related financial products in Asia.”\n\nDespite this, the U.S. still beat Hong Kong to the punch. That means Hong Kong regulators and potential ETF issuers have been able to study the impact that spot crypto funds might have on the market. One primary lesson: ETFs significantly drive demand. The firms that spoke to Decrypt think it will be no different this time around.\n\n“We anticipate a similar uplift in Hong Kong,” Pan said. “Given the structured and familiar investment mechanism of these ETFs, akin to those in traditional finance, they are likely to facilitate education and adoption among local investors. This positions the Hong Kong market to potentially experience substantial growth, tapping into a deep well of enthusiasm and capital.”\n\nWith Hong Kong’s population a fraction of the size of the U.S., its impact on the wider crypto ecosystem is likely to be less pronounced than January’s spot ETF approvals. But the ripple effect it could have on China and the rest of Asia may dwarf anything the U.S. could muster.\n\nEdited by Stacy Elliott and Andrew Hayward"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxOR2xSY3lfX3QzZkozU2VqMEVvSGlXbEhuQzRjTlVrX0RUbEFCNVBYX0MzZnFDUURoZ3pWZU9aNEJXYUVLZnQ0eW5GOG1TMVdaVWMxT0ZyMVFIVUdzVm1zeFRsQTl4bTg0VWpDSWc4dS1JZkFSUmZncHYxcHNRTV9yajh0Yi1JQmJSbGVTOTNkTXdKbzJqcTVDT25rbkJwNzUzbTREdHR5UG5UV0RzUUFtRnZGVFd5TEJNZGlwTEc1OUNzc0k5T1JSOFRIZDR1T054c0JsV2RZWl_SAd4BQVVfeXFMUEZtamFmaXhnMVdLOWg2OTVqUzZ4eS0zUEFhMk01RDNMR0NaeGZQMDBOSV9HQXRTUGZoamZudVNCQ3phd19LZi14djVGVnl0Ynl6QzJoQjdOODk4X1dFRGNWRHVSQjgxNEc4TDJVLUlBZmlEX0k5cVFLWk5Db215M0Z5UFBKUnROTU41ZWJnTkxpWnRBNU5YczhlVi0yMXZGQnI3V2piZDlqLVFaQTltd21VQWE2cTljTlk5czFJeW44d25QNUdETFhUXzQwUWlvS25xUlBCUkp5Z05lMkpB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Primed To Bleed Against Bitcoin for Longer Before Bull Phase Sets In, Says Benjamin Cowen – Here’s Why - The Daily Hodl",
        "content": "Cryptocurrency analyst Benjamin Cowen is expressing bearish sentiment on Ethereum (ETH) relative to Bitcoin (BTC) over the short to medium term.\n\nIn a new video, Cowen tells his 799,000 YouTube subscribers that the Ethereum/Bitcoin (ETH/BTC) pair has further room to fall.\n\n“My base case at this point in time is that Ethereum/Bitcoin bottoms this summer, Ethereum/US dollar bleeds a little bit longer and then at some point later this year or early next year the Federal Reserve will turn the money printer back on. And then you will see a bull phase for the Ethereum/Bitcoin valuation. But I don’t think we’re there yet. I don’t.”\n\nAccording to Cowen, the ETH/BTC pair could fall by up to 38% from the current level as Bitcoin’s dominance level rises.\n\nETH/BTC is trading at 0.04869000 BTC ($3,070) at time of writing.\n\nOn when exactly the ETH/BTC pair could bottom out, Cowen says,\n\n“June, at the earliest, is my guess that Ethereum/Bitcoin bottoms out. June at the earliest. About mid-June…\n\nBut it’s also going to be dependent on monetary policy. If we get to June and the Federal Reserve is still not cutting rates and they’re still not going from quantitative tightening to quantitative easing, then it might go on longer.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPQnVKaDFKeU9OZVp5Z2lQMXZTeDN6TnQ5OGhIUFNNdzBfak5GQ3AwR0hlUDNsaURQRnh6STZ6ME9ualhHOWo1U2FkbXZhaG53M2p4cWRUdFgyWWR1ZVZTMUxtWFJ3LV9fbnR4ZldRMkpnMlhHdW91MjFhczZJNVNzYklVaWw3dXBrcU00?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "The DeFi Report Releases the Ethereum Network’s Q1 Earnings Results - Yahoo Finance",
        "content": "BOSTON, April 18, 2024--(BUSINESS WIRE)--The DeFi Report released the Q1-24 Issue of The Ethereum Investment Framework today in collaboration with Artemis Analytics and invites investors, analysts, web3 natives, and other interested parties to download the document and listen to the quarterly \"earnings call\" via The Signal Podcast on Thursday, April 18.\n\nAll interested parties can download the Q1-24 issue on The DeFi Report website, thedefireport.io, by clicking on The Ethereum Investment Framework link on the homepage. The Q1-24 \"earnings call\" can also be accessed via thedefireport.io on Thursday, April 18 at 2pm EST.\n\nAbout The DeFi Report\n\nThe DeFi Report, headquartered in Greater Boston, provides industry-leading research, market insights, and onchain data informing fundamental analysis of crypto networks and protocols.\n\nAbout The Ethereum Investment Framework\n\nThe Ethereum Investment Framework is a flagship quarterly report distributed to thousands of investors, analysts, asset managers, financial service providers, and web3 natives globally. The report provides comprehensive coverage of Ethereum and its surrounding ecosystem from a data-driven perspective — and is written in a non-technical, approachable way that traditional investors can appreciate.\n\nReaders can expect to gain insights on Ethereum’s value proposition, business model, financials, operating metrics, valuation metrics, historical performance, use cases, correlations, and much more.\n\nAbout Artemis\n\nSince launching in 2022, Artemis has emerged as a premier institutional data platform for digital assets. Delivering insights across 25+ blockchains, Artemis stands out as the definitive data science layer for crypto fundamental information. From sector-specific metrics to real-time developer engagement insights, Artemis ensures that users are equipped with the most comprehensive and customizable digital asset data available. With its wide availability of data ingestion choices, from Excel integrations to Snowflake Data Shares, Artemis is the data platform of choice for global financial institutions and investors.\n\nGiven that large asset management firms have begun issuing tokenized funds on Ethereum and the potential for an ETH ETF in 2024, now is the time for investors and service providers to learn about the Ethereum Network’s potential as a new asset/accounting ledger for global finance.\n\nDownload the Q1-24 issue of The Ethereum Investment Framework here.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240417358783/en/\n\nStory continues\n\nContacts\n\nInvestor & Analyst Contact:\n\ninquiries@thedefireport.io\n\nMedia Contact:\n\nMichael Nadeau\n\ninquiries@thedefireport.io"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxOMjR1enVvTDJPenJhV2dIQms3UjZrQzRrMVFQazZrazZNN05IWnhoWkZlU3NFUWczNU9CVVByRGlGVWt1ekktX3Z2ZVpNMTN5dTAwWlhuWk54REpFdlZRWEMwbWZDMU4zZTZFUGY3UnhNRlBpejRUWnpid1dLcjRDSG81aDdLZ3lCSlRuaWtQVEJGcURGSDcteGZqdHFsUnhkVThBV1gzc0tkaGNrcjRweUZUNVNmMjZqNmphQUJsT2p3c1p1LVNYYzhSZGJ1SC1seDRvbC1OOFh3el9lcEc2ZNIB5gFBVV95cUxQTW1EZkdHakxneTZlOWV1VWw4Z0JXZUc5Vm9TNU8wb0Fod1hVMjJWMVM4bXBRLXBELXVyNW5LTWUzZ2VkYzBZTjFtbU8tY09hXzFxNG9kZWQzbmFDSF81aXNEbjJhNmpwX1gtdm1hbzlHdzI3OEZBWm9xRl9ITnNEVkVOcF91VVZjNXVuRkthZnpMV096czh4OHlUcXNSNDNtLW9OWUQya0hocWoxa0JnUWxjNm5RcTdsRnFYLTh4RjVWV0ptMGJ3eTZOZ19WZWJ0SDhMbUJLWW5yNktOd2JweTQzWlJIdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ethereum moves sideways as Q1 report indicates token burns are making it deflationary - FXStreet",
        "content": "Ethereum validator queue increase shows that restaking boom may be attracting more investors.\n\nEthereum shows deflationary signs as its burn rate outpaces emissions.\n\nEthereum may continue trading sideways as bears seem to be running out of steam.\n\nEthereum (ETH) continued a sideways movement on Wednesday as investors seemed to be waiting for an upward or downward price catalyst. Despite the price stagnancy, the ETH validator queue - possibly fueled by the DeFi restaking boom - rose sharply.\n\nRead more: Ethereum declines as crypto market crash increases bearish sentiment\n\nDaily digest market movers: validator queue, restaking boom, token burns, whale deposits\n\nEthereum's price is yet to show signs of appreciation on Wednesday as the market is moving slowly. Here are key market movers for the number one altcoin:\n\nEthereum's validator queue saw a sharp increase in April, growing more than 150% in the past month to reach 21,551 - its highest level since September 2023 - according to data from Validator Queue. Active validators within the network are also approaching the one million mark, growing from around 902,884 validators on January 1 to 984,375 on April 17.\n\n\n\nThe surge in validator interest can be attributed to the popularity of maximizing yields through Ethereum restaking. Made possible by Eigenlayer, users can earn additional rewards by using their staked ETH tokens to provide security to other protocols like bridges, oracles or rollups. In Q1, total restaked ETH grew by 36%, with over 4.3 million tokens restaked on Eigenlayer, according to CoinGecko. Liquid restaking protocols accounted for 2.28 million restaked ETH.\n\n\n\nETH burn rate is outpacing its emissions as more than 113,000 ETH were taken out of circulation in Q1, according to CoinGecko. The total number of ETH burned in Q1 was about 333,600 ETH compared to an emission of 270,500 ETH. This indicates that token burns are gradually making ETH deflationary despite not having a supply cap.\n\nAlso read: Ethereum recovers from dip as Hong Kong ETH ETF approval sparks whale buying spree\n\nCoinGecko also highlighted the increase in Ethereum Layer 2 adoption in its crypto industry Q1 report. L2s saw more than 900 million transactions in Q1 after the Ethereum Improvement Proposal EIP-4844 implementation in the Dencun upgrade saw gas fees reduced.\n\n\n\nWhile some whales bought the bottom by moving ETH over exchanges in the past week, FUD surrounding the second largest digital asset has been increasing recently following the market dump, according to Santiment. Celsius network deposited 8,091 ETH worth $24.5 million to Coinbase on Wednesday - their largest ETY deposit in three months - according to Spot On Chain. Between November and January, Celsius moved 847,626 worth an average of $1.9 billion to several centralized exchanges.\n\n\n\nAnother whale who bought 96,638 ETH from Coinbase at $1,567 in September seemed to be taking profit as he deposited 5,000 ETH to Kraken on Tuesday, according to Lookonchain.\n\nTechnical analysis: ETH to maintain sideways movement\n\nEthereum has struggled to enter an upward trajectory on Wednesday as it still hovers around the $3,000 support. It has continued a sideways downward-like movement as there's no catalyst to cause a significant price shift yet.\n\nWhile ETH continues filling the liquidity void formed on Saturday, a short-term Bitcoin halving effect could cause it to move upward briefly to cover the previous liquidity void of April 12. However, ETH faces a key resistance of $3,406 formed on April 7.\n\nETH/USDT 1-hour chart\n\nAs stated previously, ETH may continue trading within the range of $2,852 and $3,301 in the next few days, except if major factors prevail. These factors include the Iran-Israel conflict, Bitcoin dominance, and the Securities & Exchange Commission's (SEC) decision on an ETH approval.\n\nRead more: Ethereum price stagnates as EIP-3074 brings smart contract functionalities to wallets\n\nAnother factor to note is that ETH long liquidations have slowed down compared to the past two days. Long liquidations in the past 24 hours are at $29.3 million. This indicates that bear traders may be running out of steam; hence, a further price decline below the range given above isn't expected.\n\nETH is trading at $2,989 at the time of writing."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNZXQ1RFF1V2RUTkI5YndpRXVaMDFKQW1XS09xV0tkYW9WZjJFQ0phdnlnSFVPLW5SRmxtVEhVSzlGZmpLdGxJOGk1eWNtNnU0STNLNHVrNThZeFVISHNnWWlTUklaTEgyZTl0WUdiRi1CRkl1VEtrV1NMQ3FUMFZNcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) Dominance Hits 52.86%, Ethereum (ETH) Tests $3,000 Support, and Furrever Token (FURR) Secures $800,000 in Presale Phase - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, April 17, 2024 (GLOBE NEWSWIRE) -- In a turbulent weekend for the financial markets, cryptocurrencies felt the strain of geopolitical tensions, with Bitcoin (BTC), Ethereum (ETH), and Furrever Token ( FURR ) each navigating the upheaval in distinctive ways. Bitcoin showed resilience despite significant losses, Ethereum struggled to maintain key support levels amidst declining prices, and Furrever Token capitalized on the volatile market environment, boosting its presale figures significantly as investors looked for promising opportunities in the lead-up to the Bitcoin halving.\n\nDespite a Dip Over the Weekend, Bitcoin's (BTC) Market Dominance Reaches a New High Since April 2021\n\nThis past weekend saw a downturn in asset values as traders adjusted their portfolios in response to conflicts in the Middle East. By late Saturday, it appeared that most assets had reached their lowest points.\n\nOver the weekend, while the stock market was closed and unable to react to the escalation involving an Iranian drone targeting Israel, the cryptocurrency market was active and responsive.\n\nThe general trend saw a decrease in asset prices as traders reevaluated their positions and reduced exposure to higher-risk investments. Bitcoin, despite being the least affected among major cryptocurrencies, dropped from a high of over $70,000 on Friday to just above $63,000 by the end of Saturday, marking an 11.6% decrease.\n\nBitcoin's resilience was notable compared to other cryptocurrencies. Coinglass reported that long liquidations on centralized exchanges totaled over $757 million on Saturday, with Bitcoin accounting for $261 million of those liquidations.\n\nCryptocurrencies like Bitcoin are considered less risky compared to more speculative ones such as Dogecoin, which experienced nearly a 30% drop from its peak on Friday to its trough on Saturday.\n\nThere was a modest recovery across most assets after hitting what seemed to be a floor late on Saturday. Theoretically, Bitcoin could have seen a surge during this turmoil, as it is often considered a \"safe haven,\" akin to gold. Recently, gold has seen significant gains due to the Middle East conflict, potentially benefiting Bitcoin, frequently dubbed \"digital gold.\"\n\nHowever, with the stock market closed, cryptocurrencies like Bitcoin had to absorb the full impact of the market's reaction. Despite these challenges, Bitcoin still emerged as a top performer.\n\nOver the weekend, Bitcoin's market dominance—its market cap's proportion relative to the total cryptocurrency market cap—rose to 52.86% on Sunday, marking the highest point since April 2021.\n\nStory continues\n\nThis increase in dominance comes after a low in February when Bitcoin's dominance fell to 43% due to a surge in altcoins, representing the smallest share since March 2023. This reversal underscores Bitcoin's renewed strength in the market, achieving its most substantial market share in three years.\n\nEthereum (ETH) Remains Above the $3,000 Support Level\n\nEthereum (ETH) has recently faced challenges as its price has seen a decline of 21% between April 9 and April 14, reaching a 50-day low. Despite recovering some losses, Ether continues to struggle, especially after failing to break through the $3,200 resistance on April 14. Currently trading at $3,066, Ether has experienced a daily decrease of 1.46%. This ongoing instability raises concerns about the sustainability of its $3,000 support level.\n\nIn the derivatives market, there is a notable shift in sentiment among professional traders, indicating a decrease in risk appetite. This sentiment is reflected in the ETH options market, where the delta skew metric has reached its highest bearish level in over two months, suggesting a growing demand for downside protection.\n\nAmidst this market uncertainty, there is cautious optimism regarding the approval of a spot Ether ETF in May, although analysts remain mixed due to the conflicting signals from on-chain and derivatives data. Senior Bloomberg ETF analyst Eric Balchunas pointed out the low likelihood of ETF approval given the lack of critical feedback from the SEC during recent meetings.\n\nComparatively, Ether's downturn has been more pronounced than other major cryptocurrencies like Binance Coin (BNB) and Tron (TRX), but less so than that of Solana (SOL). It should be noted that Ethereum's network total value locked (TVL) has surged to its highest in 13 months on April 15, reaching 16.4 million ETH, which is a 14.8% increase month-over-month.\n\nDespite these challenges, the anticipation of a decision on the spot Ether ETF in May could still provide a positive impact on Ether's price and on-chain activity. However, the increasing risk aversion among professional traders, as evidenced on April 16, suggests that the potential for further price corrections below $2,900 should not be overlooked.\n\nFurrever Token (FURR)’s Presale Raises Over $800,000 as Bitcoin Halving Approaches\n\nFurrever Token (FURR) is distinguishing itself as a strong contender, demonstrated by an impressive presale that has already exceeded $800,000. As the crypto community braces for the Bitcoin halving, FURR is strategically positioned to capitalize on the increased interest and investment that typically accompany this event.\n\nOffering a compelling entry at just $0.000564 per token, Furrever Token has attracted a wide array of investors, drawn by the potential for significant returns. This vibrant investment interest is bolstered by FURR's dynamic community, which includes over 4,100 active members on its Telegram channel, providing robust support and fostering lively discussions that enhance the token’s market presence.\n\nAs the market anticipates the Bitcoin halving, Furrever Token is not just riding the wave but actively preparing to leverage this period of heightened activity. The team behind FURR is pushing forward with strategic partnerships and innovative features aimed at boosting the token's adoption and enhancing its value. These efforts are designed to align FURR’s trajectory with the broader market dynamics expected post-halving, ensuring that the token remains appealing to both new and existing investors.\n\nWith its strong presale performance, active community engagement, and strategic market initiatives, Furrever Token is poised for significant growth. As it continues to navigate the evolving cryptocurrency landscape, FURR stands out as a promising investment opportunity, ready to benefit from the upcoming market momentum and deliver substantial returns to its holders.\n\nFor further information or any assistance regarding Furrever Token, reach out only through the official channel at support(at)furrevertoken.com to avoid potential scams.\n\nSecure the Most Exclusive Presale Opportunity of 2024 Today!\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support(at)furrevertoken.com\n\n\n\n"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNV2ozbnhwRkJhLVRNOTR4TjRNWjk5WmhHZXNOMzRXSk43dE5CZGRjSXE0YkJqd05KNEtzV3RTU1VlZjN4NEozNnoyRGpBT3BBaWR5ZGRlZ29JWDNTN3JUcVEyZWF2MVR4WnpGZkYxOVBKV2dTeEZSTDFlckplbFo4bDlMWm9XR21GVmFTT21ZS0RiM1NnRF9md2p1cmllZFJzVHBRVGt4d2g1WGtydEFFaG9SUFBnRWhickJ5djM2RkV2VknSAcgBQVVfeXFMT0VIMnVSMTRhcWloMWNQOU5ydWZYdmhzTXN0LXhRTkpGNzlLck1kc0FGTDRkWHNZQ2NwaGVsYm9QNFZMQmo5Zy14V0ZEaXRVS19uZmN2UlpGd3lST0U1UTZnYWl6cV9sWHdfYUlRczFnRVhVR0dvckJHdlBaZXItVVFPa1A3VVc4YUpDS2F0SEw5ZjFUYV9qYzgzX3F6Sm5CQ0pSZEJtV1BIbndGVU9vbTR0Y1N2eHp6TzVkbzNYaGRSeXp1aENZMjc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Ethereum shows firm support at key level as its correlation with US indices increase - FXStreet",
        "content": "Ethereum's correlation with the traditional market is now higher than Bitcoin's.\n\nEthereum restakers may be responsible for its strong support just below the $3,000 level.\n\nEthereum could trade sideways for weeks until the SEC's spot Ethereum ETF decision.\n\nEthereum's (ETH) price continued a sideways movement on Thursday as the market still awaits a trigger. Ethereum isn't alone in this horizontal trend; several major index funds have also traded sideways, underscoring ETH's positive correlation with the traditional financial market.\n\nRead more: Ethereum moves sideways as Q1 report indicates token burns are making it deflationary\n\nDaily digest market movers: traditional market correlation, whale activity, fragile long side\n\nEthereum has maintained a sideways price movement for the third consecutive day. Here are ETH's key market movers:\n\nDespite the recent launch of spot Bitcoin (BTC) ETFs in the US, Ethereum's correlation to the traditional market has soared above that of BTC, according to data from The Block. Compared to BTC, Ethereum showed a high correlation to indices like the Nasdaq 100, S&P 500 and Dow Jones Industrial Average. This can be seen in Ethereum's recent price action, which has traded horizontally in tandem with these indices.\n\n\n\nWhile ETH's price stagnates, whales are making moves behind the scenes. A participant in its initial coin offering (ICO) came online to sell 2,000 ETH for 6 million USDC at $2,997, according to Spot On Chain. The whale bought 33,213 ETH at $0.31 during the Ethereum Genesis ICO. Since then, the whale has sold 5,110 ETH and still holds about 29,700 ETH across three wallets.\n\n\n\nAnother whale, who spent 10 million USDT to buy 3,279 ETH at $3,050 on Wednesday, withdrew 21,474 ETH — worth $64.7 million — from Binance on Thursday, according to Lookonchain. The whale has bought 107,931 ETH from decentralized exchanges and Binance since April 8.\n\nAlso read: Ethereum declines as crypto market crash increases bearish sentiment\n\nOptions indicators also show that \"the long side of Ethereum is more fragile and have limited ability to lead the market,\" according to Greekslive.\n\nTechnical analysis: ETH sideways movement may continue for weeks\n\nEthereum bears attempted to shift its price below the $2,900 key level on Wednesday, but it quickly rebounded to the $3,000 support level on Thursday.\n\nETH has maintained trading around the range of $2,900 and $3,300 since the market crash of April 12. Despite bulls showing weak hands, bears haven't been able to break below the range.\n\nThe scarcity of ETH driven by the increased attractiveness of Ethereum restaking and anticipation of the Bitcoin halving may be what's sustaining its price to stay within the range.\n\nRead more: Ethereum recovers from dip as Hong Kong ETH ETF approval sparks whale buying spree\n\nETH/USDT 4-hour chart\n\nAs stated in a previous analysis, ETH may continue the sideways movement. Minor market triggers may see it posting tiny gains but not above or below the $3,300 and $2,852 range identified previously.\n\nThe sideways movement may prevail for weeks until days leading to the Securities & Exchange Commission's decision on a spot Ethereum ETF. This thesis would be invalidated if the Bitcoin halving triggers an unlikely rally.\n\nEthereum is trading at $3,062, up 1.7% on the day."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE93MHU4TFk2a2dMamhiTHBOWHoyS0pQYkhLbjBvWFRCMXl1RkNMYTZQSkRWcWJnQ3h1UDBHZ1FHYzBJU1hiTnBScE84OTlnSHJ6bldYX2RlRHdmOXdnZkxwQXI1eDVRTlRORFFNN1pxZWE3S1VLWHRhNVJsSHF0QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "VanEck enables staking on ethereum ETP - ETF Stream",
        "content": "VanEck has enabled staking on its ethereum exchange-traded product (ETP) to generate additional income.\n\nThe group said investors in the $143m VanEck Ethereum ETN (VETH) will be able to earn up to 5% in staking rewards.\n\nStaking is the process of depositing crypto assets on the blockchain to validate transactions, generating a premium that is returned to investors.\n\nValidators are more likely to be selected based on the amount of cryptocurrency they hold and are willing to sell as collateral.\n\nVanEck added some of the staking rewards may be reduced due to staking service provider fees.\n\nVETH launched in March 2021 and has a total expense ratio (TER) of 1%.\n\nMartijn Roezemuller, CEO of VanEck Europe, said: “Following ethereum's switch from the so-called proof-of-work (PoW) to the so-called proof-of-stake (PoS) consensus mechanism, it was clear to us that we would follow the developments in the second most important cryptocurrency.\n\n“By changing the consensus mechanism, ethereum consumes significantly less computing power and electricity. Staking can now be considered a key aspect of securing and maintaining the integrity of this blockchain network.”\n\nThe move follows CoinShares, which enabled staking on the $197m CoinShares Physical Staked Ethereum ETP (ETHE) in February."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOZnZxUGNFZTRKcUo4MEJpRnpNeGN3b3BfYTB5T3ExcXh4QzhZYmEzdTR0VTRxTXRhYWlNMDZTX00wRTNJRV80NHVOUnIxMWtTZ1Exd2RDdi1iWDJ5bjVDVlUzd0Roa0pSWm4wdERUNWpPaHVUaFl2WlVIMEdwcjhMaXNoZmptZU0y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Furrever Token Foreseen to Deliver ROI Comparable to Bitcoin (BTC) and Ethereum (ETH)'s Success in 2024 - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, April 17, 2024 (GLOBE NEWSWIRE) -- The markets have been bleeding out over the past couple of days, with both Bitcoin (BTC) and Ethereum (ETH) experiencing a 2% dip in their prices. However, amidst this downturn, Furrever Token (FURR) has emerged as a bright spot, surpassing the significant milestone of $800,000 during its sixth presale stage. This contrast highlights the dynamic nature of the cryptocurrency landscape, where while some major players face temporary setbacks, newer projects like FURR demonstrate resilience and potential for growth.\n\nBitcoin Faces Geopolitical Headwinds Amidst Price Volatility: Dipped 3.4% Since Yesterday\n\nBitcoin's recent attempt at recovery was abruptly halted yesterday afternoon following renewed geopolitical risks, causing the digital asset to turn downwards once again. The largest cryptocurrency witnessed a 3.4% decline, retracing its gains from the previous day and closing around the $63,400 mark. Today, Bitcoin briefly dipped to the $61,000 range before bouncing back to the $63,000 zone with the opening of the European session. Amidst continued volatile movements in the Bitcoin market, significant liquidations persist in futures crypto trading, with $274 million worth of positions closed in the past 24 hours, 200 million of which were long positions, indicating investors' maintained optimism despite the downward trend.\n\nExternally-driven news dominates the Bitcoin market, with a brief upward movement towards $66,000 seen after the Hong Kong news yesterday, but this positive development was short-lived. However, investors are keeping a close eye on the upcoming halving event scheduled for April 20th, anticipating its potential impact on Bitcoin's supply dynamics and market sentiment.\n\nEthereum Faces Crucial Support Levels Amid Market Turmoil\n\nAmidst a widespread selloff in the cryptocurrency market, Ethereum (ETH) faces scrutiny as its price dips by 2% to approximately $3,059, according to coinmarketcap.com. With attention turning to critical support levels, renowned crypto analyst Ali Martinez highlights a pivotal zone between $2,000 and $2,430, where 9.37 million addresses collectively hold nearly 53 million ETH. Martinez's analysis underscores the significance of this range in determining Ethereum's price direction amidst market volatility.\n\nDespite the downturn, optimism persists within the crypto community, buoyed by recent regulatory approvals such as Hong Kong's green light for Bitcoin and Ethereum ETFs. Moreover, the anticipation surrounding the upcoming Bitcoin Halving event adds intrigue, although concerns over short-term volatility linger. As investors navigate uncertain terrain, Martinez's insights offer valuable guidance, emphasizing the importance of monitoring market dynamics and expert analyses.\n\nAmidst the price dip, Ethereum's one-day trading volume remains near the flatline at $22.42 billion, with the ETH price down 7.48% over the last 24 hours and nearly 16% over the last seven days. The Ethereum Futures Open Interest has also declined by 6.01% to $10.91 billion, indicating ongoing market turbulence.\n\n\n\n\n\nFurrever Token (FURR): Riding the Wave of Market Downturn with Resilience\n\nDespite the broader market downturn, Furrever Token (FURR) stands out as a beacon of resilience, navigating the choppy waters of the crypto landscape with unwavering momentum. Surpassing the significant milestone of $800,000 during its sixth presale stage, FURR demonstrates a remarkable ability to thrive amidst market volatility. This success can be attributed to the project's unique value proposition, centered around infusing the crypto space with an irresistible dose of cuteness. By leveraging the universal appeal of adorable cat imagery, FURR offers users a one-of-a-kind experience that transcends traditional use cases, capturing hearts and garnering enthusiastic support from its growing community.\n\nAt the heart of FURR's appeal lies its commitment to creating a whimsical and heart-warming crypto ecosystem. From cute cat-themed stickers and emojis to captivating visuals, every aspect of the project is meticulously designed to evoke joy and foster a sense of camaraderie among users. This emphasis on community building extends beyond mere aesthetics, as FURR actively cultivates a warm and inclusive environment where members can connect, share experiences, and revel in the shared love for all things adorable.\n\nCentral to FURR's success is the active engagement of both its team and community members. With a shared vision and a passion for spreading happiness through crypto, the FURR community is united in its pursuit of creating a more enjoyable and fulfilling experience for all participants. Whether through lively discussions on social media channels or collaborative efforts to support the project's growth, every member plays a vital role in shaping the future of Furrever Token.\n\nAs of now, FURR is trading at a price of $0.00048 and holds the potential for up to 15X returns, offering investors an enticing opportunity to capitalize on its unique value proposition and strong community engagement.\n\nIs Furrever Token (FURR) Legit?\n\nFurrever Token (FURR) boasts legitimacy with an audited smart contract, a planned PancakeSwap launch, and no buy/sell tax. Team token lock-up and community-driven governance further enhance credibility. With nearly 4,000 Telegram members, support@furrevertoken.com is the sole trusted email address for communications, safeguarding against potential scams.\n\n\n\nSecure the Most Exclusive Presale Opportunity of 2024 Today!\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQN2FIeHl2WjAxVmtxVVdhOWxrUHp3bUMxc2FTOGhTUWx6VnVQUTg1bU5PQmd0blF4bHJDMC1IWU8yTTQ5c0RsVEwyS01xQXBjNlVsX3BzNHpVNGo2d0R1UmpmMHJ6Wk1QdzhJUDJob29Xb3I0aTFHWDY1b3FqNTRnTmFKU0szUW9tVVk1WkJYQU03U21GU19DdjJ4LVQ3MTdWU0l1YmF6UnRfOW5yQnpHaQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong’s Bitcoin, Ethereum ETFs projected to hit $1 billion in assets within two years - CryptoSlate",
        "content": "Bloomberg analysts have revised previous inflow predictions for Hong Kong’s newly approved Bitcoin and Ethereum exchange-traded funds (ETFs) to $1 billion within the first two years.\n\nBloomberg senior ETF analyst Eric Balchunas had previously estimated the funds to garner roughly $500 million in inflows over a similar period due to doubts over Chinese investor eligibility and a lack of maturity in the Hong Kong ETF market.\n\nChinese investors exposure\n\nEric Balchunas, Bloomberg’s senior ETF analyst, highlighted the challenge faced by Chinese investors seeking exposure to newly approved ETFs in Hong Kong.\n\nCiting a research note from colleague Rebecca Sin, Balchunas emphasized that China’s ban on the underlying assets related to these ETFs complicates accessibility for interested investors within the jurisdiction.\n\nChina has long upheld strict regulations on the burgeoning crypto sector. The country initially banned cryptocurrencies in 2013 and extended the restrictions to mining in 2021.\n\nMoreover, Sin’s analysis noted that retail Chinese investors might attempt to bypass this restriction by leveraging the $50,000 remittance quota to invest in these ETFs.\n\nHowever, the feasibility of this investment route remains uncertain due to its limited functionality and the potential regulatory hurdles that might emerge for institutional investors.\n\nAUM to hit $1 billion\n\nWhile these restrictions pose a significant challenge for the Hong Kong-listed crypto ETFs, analysts still foresee them attracting substantial interest and predict they will hit $1 billion in assets under management (AUM) within the first two years.\n\nBalchunas explained that the $1 billion milestone relies on significant enhancements in Hong Kong’s financial infrastructure and ecosystem.\n\nPresently, Bitcoin ETFs in the Asia-Pacific region command $250 million in AUM, distributed across five ETFs, three based in Hong Kong and two in Australia. The largest fund, the CSOP Bitcoin Futures ETF listed in Hong Kong, boasts $121 million in AUM.\n\nAmong the three firms poised to introduce spot ETFs, Bosera and Harvest collectively manage $50 million across nine ETFs. In contrast, ChinaAMC, with 15 ETFs and $3.6 billion AUM, is a significant player expected to have a considerable impact upon launching its spot crypto ETFs.\n\nMentioned in this article"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNcHZhYlZKOXVjMTNMdktIRG90MklwRE5tOFU2LUtDLXF5SGM2TkpoeEQ2dzNZaVJtOHVGNTZfWkFiaGdZc1dsb2RqWEd2a0Q3SW9wVnZuTHd0LXhZb2ZMOXQtanRkTzNHU2hPMk9CZUpPN0xxdjg5MDZsdHRKZDhhaEZVUnVRdThMSEpoVXE0SGdKMnJFdVVJb1JiQU44T1RKNGVvVlNySjJuYmlGSkVkUXhoMk03UVRPM2tJ0gHAAUFVX3lxTE1McEtJMzlPTHpIT0hkOVRBanZrb0RfRTBaMGpaZ3dUa1E3c1hhSFRIcTg4YnhqTGNNYkp2UGxJdG9ZZzJpNkJ2dHQ4SlpnRFlyTGpGaEpNa25QZkE5UjVZWjl4a3p2QW5MamxlTVJUVXFLaDNFQlpSb2t2VXRzX2ZfLWF1N3g1b19fVUl6WmdpWHFSNnVkNWhKU3dzX2hxUjJ1UXNka3l6bFdzTkd1b0Y5SVUwX1B5MTVxRE5MZWhiSw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Whale Who Bought Ethereum at 2022 Bottom Sends 5,000 ETH to Kraken: Lookonchain - The Daily Hodl",
        "content": "A crypto whale that bought $151.42 million in Ethereum (ETH) near its market cycle bottom in September 2022 appears to be taking some profits, according to the digital asset tracker Lookonchain.\n\nLookonchain notes that the whale withdrew 96,638 ETH from Coinbase at an average price of $1,567 between September 3rd and Sept 7th, 2022.\n\nIn early March, the trader deposited 15,000 ETH worth around $57.3 million to Kraken, and on Tuesday, they sent another 5,000 ETH worth $15.4 million to the exchange.\n\nThe whale still holds 76,638 ETH worth roughly $230.5 million. Between realized and unrealized gains, the trader has profited nearly $152 million on their initial $151.42 million ETH investment.\n\nETH is trading at $3,005 at time of writing. The second-ranked crypto asset by market cap is down nearly 15% in the past week.\n\nLookonchain also notes that Tron (TRX) founder Justin Sun withdrew 196 million of the top stablecoin USDT from the crypto exchange HTX and deposited it into Binance on Tuesday.\n\nIn February, Sun revealed publicly that his HTX account held 28,613 Bitcoin (BTC) worth about $1.62 billion at the time.\n\nHTX is the rebranded name of Huobi, the Seychelles-based trading giant that Sun says he’s an “advisor” for.\n\nIt remains unclear whether Sun has an actual ownership stake in HTX, though he’s reportedly used hundreds of millions of dollars of his fortune to back the exchange.\n\nSun said he revealed his BTC holdings in response to critics accusing him of not being an active user of HTX.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQdHNObkFWN0RGN2F5Wm5TeFZwX19pTTQwWmdtR19JSjdhNXdyZlNXcVVLTC0zX3NwVlJHcW1sdGozcWZnbHBfd29tZUFmYUZEVGRCZy1hbm9vVUVyWkZISFZGdzczQXprZUdlVndPYnJENHB3UHI3T3FhT3BMX1RMZ090LTJkYk9CR1dxakFfeEl3U2ktQTdBNjVSSXItUHhacHpXN1dESmMzcWMzTzFBNU9KODNqV1k3M2NyQnZ4RGN1T0d5VzJj0gHMAUFVX3lxTE85OU5VdFdmUGdUcWh2NV9DOHlUeW1Kd1FKWHRjTHdEMF9wcFcybTB1Y2c5OHhINFp1RTc0Y2NET1FnQ3Z2RkpmWXdEc2ctVHhXeS1BMDZyWldMWkN5c2pEaGpVUXg2bEFZQllzR3I1MThUdkd4UXJ0ZDdVcGJLVVZVSE41MFpoOVpTcTk2dWZnRlYxdGhBN1c4UFB6UU9yaEdnWkNmdjB3aUZGMlU0VElzYVdSeFRqRVVBQVNGRVI4NVNVN2NKby16OWFZNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Former Goldman Sachs Executive Says 80% of His Crypto Portfolio Allocated to One Ethereum Rival - The Daily Hodl",
        "content": "Macro guru and ex-Goldman Sachs executive Raoul Pal is revealing that he’s heavily invested in one Ethereum (ETH) competitor.\n\nPal says in an appearance on the Bankless YouTube channel that the native token of the layer-1 blockchain Solana (SOL) comprises about four-fifths of his crypto holdings while the rest is in memecoins, digital collectibles and in a digital assets-focused investment vehicle.\n\n“I am 80% SOL. All of my ETH is now NFTs (non-fungible tokens), I have been buying high-end art NFTs.\n\nI then have a bunch of the portfolio in the fund of hedge funds in Exponential Age Asset Management.\n\nAnd I have 1% in stupid s**t like dogwifhat, Dogecoin and Bonk. Got all of those. But that’s 1%… just to be clear I’ve got like in all of memecoins and everything else, 1% of my portfolio. I am 80% Solana.”\n\nOn what convinced him to bet heavily on Solana, the former Goldman Sachs executive says,\n\n“The chart that was a standout in 2022 was the Solana/Ethereum chart. And that was the chart that got me buying Solana and then going all in. Much like I went into Ethereum all in about September 2020. I just did it earlier in Solana.”\n\nSolana is trading at $133 at time of writing, up by over 1,240% from the 2022 closing price of about $9.89.\n\nOver the same period, Ethereum has increased by around 155% from the 2022 closing price of around $1,200 to the current $3,062.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBaSm04UmFNQWZkMmNMbnVVNUV2QWJGbHh2em42a3pYa3A1VkZ5dDIyN3owdmNDdElsUDczbFgzeVo0UVk2bm90RHhoLWxYcDJvR0F2TTR3MUVQYVBobENGanhzLU45LUJhYUU4RWFJYzN6VUdiaVpUMDJvUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Why Are Ethereum Investors Flocking to BlockDAG? - NFTevening.com",
        "content": "Cryptocurrency investment is shifting focus from traditional stalwarts like Ethereum to newer, high-potential projects like BlockDAG. The appeal of BlockDAG is undeniable, with the project recently accumulating $17.9 million from its presale and an additional $2.1 million from miner sales. As debates intensify within the Ethereum community about its future issuance policies, BlockDAG is seizing the spotlight with promises of a 30,000x ROI, courtesy of its groundbreaking mineable network and a keynote video teaser on the Moon.\n\nEthereum’s Present Challenges\n\nCurrently, Ethereum is facing internal contention regarding its issuance curve as it transitions to the Electra upgrade. The community is divided over proposals aimed at reducing token issuance to support solo stakers, with notable figures like Eric Conner and Ahmad Bitar vocal in their opposition. They argue that such changes might compromise Ethereum’s role as a decentralized currency, spotlighting the ongoing struggles to balance evolution with core values.\n\nBlockDAG’s Impressive Presale and Promising Roadmap\n\nBlockDAG is making waves in the crypto presale scene with over $17.9 million already secured in its latest funding rounds, alongside significant earnings from miner sales. The platform’s forthcoming keynote, featuring an innovative display of BDAG on the moon, is set to captivate a global audience. Additionally, promises of enhanced market liquidity, potential listings on major exchanges such as KuCoin and CoinEx, and an initial listing price of $0.05 reflecting a nearly 4900% increase from initial offerings; underscore its ambitious growth plans.\n\nBlockDAG leverages a novel approach to blockchain technology at its core, offering developers a dynamic environment to build, deploy, and monetize their applications efficiently. The platform facilitates various blockchain functions, from crafting smart contracts with popular development tools to running applications on a test network before a full-scale launch. Opportunities for developers to generate income through various channels, including transaction fees and token sales, position BlockDAG as a vibrant ecosystem for blockchain innovation.\n\nFurthermore, BlockDAG’s adoption of Directed Acyclic Graph (DAG) technology ensures that scalability and performance are maintained as the network grows, supporting a diverse array of business applications and fostering ongoing innovation and community engagement.\n\nConcluding Thoughts\n\nAs the crypto community continues its search for the next ample investment opportunity after Ethereum’s monumental success, BlockDAG presents a strong case with its potential for a 30,000x return on investment. Facing internal debates and growing concerns within the Ethereum community, BlockDAG emerges as a more attractive option for discerning investors. With substantial presale revenue of $17.9 million and a supportive community excited by its innovative solutions, BlockDAG is well-positioned to transform the investment landscape following the keynote video teaser over the moon a feature not dared by any crypto before.\n\nThis emerging platform promises significant returns and boasts a robust technological foundation and an ambitious roadmap, making it an appealing prospect for early investors. Discover BlockDAG by visiting their website and considering the investment opportunities available in what could be the next breakthrough in the crypto sector.\n\nBuy BlockDAG Now\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE44NnZBUXgtSTNycGRkT1IyUlkwT1I3SG9zNTczcjJXQ2ZjWmFjS1IzWUMwZGNpS3l2b21aZWdPRUdPTWhMd1huNmVPbUNTWmRKNjdwYmRnUy1zQkdNc09HMWdnei1kVmM0Ym9UV2ItQVA1SExzdzlrMHln0gF_QVVfeXFMTzZMV2ZxQXVqb0tzenFmVnFLbmVCLXV5VmF1ZHJRQUJIU0lnWXdmVzVSekVGamhPMmpWTllMUWVzRkE0bUFmN0wxYW9EUmNRclFkZXlXY2Y2Wk14MHMxeXZsYmNvUS1kS2xqX0JCcllqaDRoWHRHVFBSNzctQWx2NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "'Ethereum Wins Big' With New US Stablecoin Draft Bill: Expert - Bitcoinist",
        "content": "The introduction of a new draft bill aimed at regulating stablecoins in the United States has ignited a firestorm of debate within the cryptocurrency sector. This legislative development, while still in its formative stages, is positioned to significantly alter the operational landscape for digital currencies, particularly Ethereum and its associated stablecoins.\n\nA Big Win For Ethereum?\n\nRyan Berckmans, a prominent member of the Ethereum community and an investor with extensive experience, provided an enthusiastic analysis of the draft bill. He shared his thoughts via X, a popular social media platform, where he described the bill as “extremely bullish” for Ethereum.\n\nAccording to Berckmans, the draft bill’s most significant feature is its broad legitimization of stablecoins on public chains, particularly Ethereum, where a significant majority of stablecoins are minted. “My initial read is that the bill is extremely bullish and legitimizes Ethereum like never before. The bill broadly legitimizes stablecoins on public chains in America, where 59% of all stablecoins are minted on Ethereum, rising to 93% when excluding centralized platforms like Tron,” he stated.\n\nHe further elaborated that the legislation “opens floodgates for US banks to obtain stablecoin licenses and for certain private companies to issue up to $10 billion in stablecoins without a license.” This provision could potentially transform the banking sector’s approach to digital currencies, integrating them more deeply into the financial mainstream and broadening their use across a range of economic activities.\n\nFurther elaborating on the positives, Berckmans was pleased with the bill’s approach to assets not pegged to the USD, such as on-chain euros and gold. The bill, according to his interpretation, does not impose regulatory measures on these assets, which could maintain a free and globalized market for them and enhance their appeal as alternative reserve currencies or investment assets.\n\nHowever, Berckmans also identified several areas of concern within the draft bill. Notably, the bill imposes strict regulations on unlicensed USD-pegged stablecoins, potentially prohibiting their issuance to US persons residing in the United States. This could impact popular decentralized stablecoins like DAI. Additionally, he criticized the bill’s definition of “algorithmic payment stablecoin” for being overly broad, which could encompass a range of decentralized stablecoins that use algorithms to maintain their peg to the dollar or other assets.\n\n🚨New stablecoin bill draft🚨 My initial read is that the bill is extremely bullish and legitimizes Ethereum. Disclaimer: I'm not a lawyer or regulatory expert. I read through chunks of the new bill[1] and analyzed it with GPT4. Analyze it yourself[2] TL;DR\n\n– Ethereum wins big… — Ryan Berckmans ryanb.eth (@ryanberckmans) April 17, 2024\n\nConcerns And Criticisms\n\nContrasting sharply with Berckmans’ optimistic perspective, Jake Chervinsky, Chief Legal Officer at Variant Fund and a former CLO of the Blockchain Association, provided a much more critical viewpoint. Chervinsky expressed his concerns via X, stating, “The bill published today is deeply flawed: it appears to ban nearly everything except a narrow band of centralized, custodial stablecoins.”\n\nStablecoin legislation should be a top priority for everyone who cares about crypto policy. But the bill published today is deeply flawed: it appears to ban nearly everything except a narrow band of centralized, custodial stablecoins. This would be far worse than status quo. — Jake Chervinsky (@jchervinsky) April 17, 2024\n\nChervinsky also pointed out that the draft bill seems to contravene several principles he advocated for in his testimony to Congress last year. According to him, a focus on custodial stablecoins should be paramount, but the bill instead appears to create anti-competitive regulatory moats that could hinder further development in the space.\n\nDespite these divergent views, Berckmans remained hopeful about the broader implications of the bill. He envisioned a scenario where the restrictions on USD-pegged stablecoins could inadvertently boost the market for non-USD stablecoins, allowing them to flourish and diversify the stablecoin market significantly. He speculated that in the future, the dominance of USD-pegged stablecoins could decrease, making way for a more balanced stablecoin ecosystem.\n\nAs the cryptocurrency community continues to analyze and debate the draft bill, it is clear that the final version of the legislation will be critical in shaping the future of stablecoins and blockchain technology in the United States and possibly globally.\n\nAt press time, ETH traded at $2,984.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPcFBfTlpnTENsRWlfME9GTlAweGdCcWhLRXpWbXI0T2NteXdvZUxFc2UtUHFma0Q5MXRiWlhnMFozVVRNMEVkSHFhS0luanpLbmlKWTZZWVN3Sjk0a1FLdTlFM0x3Vlktc3poYTdhVE5Vb0o4TFlXQWZoUEZJZWJlU2dDU3dQbDNja1lvWlBZbjRLQmxGeHNTcXJGWk9NdTd2X292ZEdzQzJ5dWIxVjd4LW10ZVlnemxmak5iSlVxUdIBxwFBVV95cUxOV2RGcW1XM1lDelplWURFeS1JMkttTVAwWi1Pelo1MnA0RmpPaFdHLW5JU1lyZE9HYll5Ul9FNWZRX0l5ajloaTZDV1J6MmdsbEtoRzM5QWUyMldMajJsR09OVzduVjE3MTg0RE1MVnItT3cxOVNRLVh6N243aHFpdnhWc0k2XzJXWHllanpWTmNCRUZPNlNhMW9VMS01cWhMLUlBMDlnRmxMX001Nk1iSlRicjNkUzdPSDFWajVIbFVfV3RIWFJR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Eyes All-Time High: Changelly Analysis Predicts Surge After Bitcoin Halving - Crypto News Flash",
        "content": "Despite Hong Kong’s ETF approval, Ethereum sees increased liquidations and bearish sentiment, with shorts rising by 54%.\n\nEthereum faces price volatility due to geopolitical tensions and regulatory concerns, dipping below $3,000 briefly this week.\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, faced significant price volatility this week, briefly dipping below the $3,000 mark. This downturn followed a combination of geopolitical tensions and market sentiments surrounding regulatory developments.\n\nTensions between Iran and Israel contributed to market jitters, suppressing the positive impact of Hong Kong’s approval of a spot Ethereum Exchange-Traded Fund (ETF) as previously reported by Crypto News Flash. Investors exercised caution across the cryptocurrency landscape, with Bitcoin and other altcoins also experiencing losses. Notably, Ethereum saw a 20% decrease in risk reversals on Tuesday, indicating heightened nervousness among investors.\n\nData from Santiment revealed a surge in Ethereum liquidations, totaling over $81.9 million within 24 hours. Long positions accounted for the majority of liquidations, totaling $67.4 million. The largest liquidation, valued at $6 million, stemmed from an ETH-USD swap. Moreover, discussions surrounding Ethereum intensified after the Hong Kong ETF was approved, making it the most trending token among traders. However, bearish sentiment persisted, as evidenced by a 54% rise in ETH shorts.\n\nEthereum Foundation’s Issuance Reduction Proposal\n\nDespite recent developments, the Ethereum Foundation’s proposal to reduce ETH issuance garnered attention. Glassnode’s report highlighted ongoing criticism of the proposal despite clarifications emphasizing its aim to maintain Ethereum’s status as a form of currency and balance governance power within the network.\n\nGlassnode also addressed the rise of restaking and liquid restaking tokens, impacting Ethereum’s inflation rate and holders. These tokens, offering significantly high yields, facilitate a wealth transfer from non-staked ETH holders to staked counterparts. Consequently, there is a potential shift in the “real yield” and the role of money within the Ethereum ecosystem, potentially favoring projects issuing derivative tokens.\n\nAccording to a recent analysis conducted by Changelly, a prominent cryptocurrency data provider, Ethereum could experience a notable surge in price following the Bitcoin halving. Changelly predicts that on April 21, 2024, just one day after the halving event, Ethereum could reach a price of $3,171.61. This forecast has sparked optimism among Ethereum investors, who eagerly anticipate the potential for significant gains.\n\nChangelly’s analysis extends beyond the immediate aftermath of the Bitcoin halving, offering a bullish long-term outlook for Ethereum. By June 2025, Changelly suggests that Ethereum could surpass its previous all-time high and reach an impressive price of $4,964.07. Such a milestone would mark a new record for the cryptocurrency, signaling continued growth and potential for further appreciation.\n\nEthereum Struggles to Break Key Resistance\n\nETH’s price trajectory has been marked by challenges in surmounting key resistance levels, particularly the $3,200 mark. The cryptocurrency remains below this critical threshold, along with the 100-hourly Simple Moving Average, signaling persistent bearish pressure. Additionally, a notable bearish trend line has formed with resistance at $3,120 on the hourly chart of ETH/USD, sourced via Kraken.\n\n\n\nFollowing a brief period of consolidation, Ethereum experienced a minor recovery attempt, briefly surpassing the $3,000 resistance zone. However, this upward momentum was stifled as bears asserted control near the $3,280 resistance zone, resulting in a subsequent downturn. The price retraced below the 23.6% Fibonacci retracement level of the upward move from the $2,536 swing low to the $3,278 high, underscoring the prevailing bearish sentiment.\n\nRecommended for you:\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9fNEpsZFd3dUR4Z19ScTVtNHZXUXlsZmtweFowcHlmVlJ6Tjhfc1JDVU9CS0M3NDlBN0l3SjZzU2pQbHBheEFkV0hBSy1oWlJ0RnJZRUJZcnBlWDF2amltcEJfcFdRaU1BS292TUVhcmZjWEZnLW51RU5R0gF_QVVfeXFMTnFOcWNoR09rRUdNVlZGVjBjTWoxTUJyeTdXRWc4elhFVm0zSWw2eEFJdl9kVTVXUjJGNUV2RlhxSy1qQUp1WWNreVdRRlVXQkNiYW1iWEtvRldkUi1lSkFHSzAydVNVWWp6eHlJdm1NQ0IxUEFhUmdRY21lTDczZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ancient Ethereum Whale's 5,000 ETH Sell-off stirs market - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to on-chain analytics firm Lookonchain, an Ethereum whale who accumulated a substantial amount of ETH at the market bottom in September 2022 has made a notable deposit of 5,000 ETH to popular cryptocurrency exchange Kraken.\n\nAdvertisement\n\nBack in September 2022, when the Ethereum network transitioned to a proof-of-stake consensus, the whale took advantage of the opportunity to buy ETH at what was considered the market bottom. The timing seemed right as the price of Ethereum was nearly $1,567 per ETH, totaling a value of $151.42 million for the bulk purchase.\n\nAccording to Lookonchain, the ETH whale withdrew 96,638 ETH worth $151.42 million at the time from Coinbase at $1,567 from Sept. 3 to Sept. 7, 2022.\n\nThe whale that bought $ETH at the bottom in Sept 2022 appears to be selling $ETH at a profit again.\n\n\n\nHe deposited 5K $ETH to #Kraken 56 minutes ago.\n\n\n\nHe withdrew 96,638 $ETH($151.42M at the time) from #Coinbase at $1,567 from Sept 3 to Sept 7, 2022.\n\n\n\nAnd he currently has 76,638… pic.twitter.com/5FR0TXRGF5 — Lookonchain (@lookonchain) April 16, 2024\n\nFast forward to now, and the same whale has transferred 5,000 ETH to Kraken, presumably to sell it at a profit. When whales deposit their tokens into exchanges, it typically suggests a potential sale, while withdrawals signal an intent to buy.\n\nAt the time of the deposit, the price of Ethereum had risen, indicating a significant profit margin for the investor. The whale still has 76,638 ETH worth $233.56 million remaining, for a total profit of more than $153.7 million.\n\nThe whale's action indicates that the perfect combination of timing and market sentiment can lead to significant returns. The wrong timing might lead to ultimate losses, which was the scenario of another ETH whale who saw significant losses as the ETH price dipped.\n\nEthereum saw selling pressure at the start of the week after reaching highs of $3,281 on April 15. The drop persisted, with Ethereum falling for two consecutive days before slightly rebounding. At the time of writing, ETH was up 0.43% in the last 24 hours to $3,058.\n\nAs reported, an ETH whale sold their 10,701 ETH stash worth $33 million, losing more than $4 million for the second time after going long on ETH. The first time, they lost almost $500,000."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNVU9TcWFBZHJmbVBPVnZfY0lVWEhESkVFZGtNYlN4NEp0TEZRX2l0R0g5ZVpDN3RtSkFvM1lfM0tSYVFGeFdWV1QwLXpQWnZnVXo2VjV6MnExX1ZNdkRoY2pJRks5V2ViMUZsMDQwOVZZenpFQlRaQ3BCMGZlUzNkX0xjZG9aWU1vSkZPMWRSUWxDMmZ4SEFFeGJmdU1ESF9aTXB1b1FqLXVid9IBrwFBVV95cUxNLTR3SGFaY3ZuUUpCNkN2V0Q3dU93UmJicEhfenRVQWR1VENNTlpMR1FNVEdOSjdxN1FuN2dVOU1PNUVyOFRMRWRtVnlCbFpLR1NhMFpoM2VVQ3luZmQ5cEQxcl9ILUI1NDBwajZCUnhkY3VDYU9QNFk0LTh5bG9tNXdHZGtvM3YtRmcySll3ZGpIVEU3bmxvQVgwVkM3cFBrV3RNNFRNM3lOTUIxTDU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Worldcoin, Sam Altman's Crypto Project, Is Building a Layer-2 Chain - CoinDesk",
        "content": "World Chain will be based on the OP Stack, a blockchain-building framework that has become a popular choice among bootstrappers and was used by Coinbase to build its Base network. Like other layer-2 \"rollups,\" the chain will bundle up transactions from users and pass them down to Ethereum where they get cemented permanently. The setup will allow World Chain to offer users cheaper fees than they'd get by transacting directly on Ethereum."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOMUV2YnZsQVVyc3BvQzY0cHh5T0N5NU9EWThlUFJpLTItWHZyXzhWQklJYnpGdjgxZU1KSS0wQk4xb0tVZHR1RVFMQkx5OF94YXNkOHNMRG9JYXg5MkNham1TdkxZYnF0dDBia3JiX2JKY1B3c19QVEJVcG5sZlE3N2c5cno4NnBYMmdiOTR4Szk3Qlk3aG5qUThNdnJqSUlIamJpbzE2TXA5ZFhsNm5KM2p4RU9leDZfTFVxSG5rY9IBxAFBVV95cUxQS1hhWERfT2JOQVRJLXNSamNiU2psTDVXSGlkaVN5d3p6SGpSamdiOHlfc0hnaUVWZFVRa0hQMmRQcHJabk53YmY2Zmpabl9ZZUFrSDZCb3FMSEM4QkdXMG0yd2RmZi1ubGJXODlNUEZSZnVEOGEzWnRfRlBGNmVrbWVYU2Vid0RuMVRxZ0c4ZEN6NHlIX1RDUXhNLWZKcFRlNE5qRWd2TU5HeEJzbXF6dkRzZlNjR1dfd0M5WFpsOGMwbmhm?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Binance and Coinbase Add Support for New Ethereum Altcoin Project Focused on Rollup Tech - The Daily Hodl",
        "content": "Two leading crypto exchanges are adding support for a newly launched Ethereum (ETH)-based altcoin project.\n\nIn an announcement via the social media platform X, top US crypto exchange Coinbase says it’s adding Omni Network (OMNI) to its trading platform.\n\nThe Omni Network aims to integrate Ethereum’s rollup ecosystem into a single, unified network.\n\nSays Coinbase,\n\n“Trading will begin later [April 17th] if liquidity conditions are met. Once sufficient supply of this asset is established trading on our OMNI-USD trading pairs will launch in phases.”\n\nThe altcoin comes with Coinbase’s “experimental label,” a designation the exchange established for riskier, lower liquidity tokens.\n\nMeanwhile, top global crypto exchange Binance previously announced it was adding OMNI to Binance Launchpool, which lets users stake coins to farm new assets, ahead of listing the token for spot trading on April 17th.\n\nBinance is attaching a seed tag to OMNI, which the exchange applies to lower-liquidity projects that may exhibit higher volatility compared to other listed tokens. Binance requires users who own assets with seed tags to pass quizzes every 90 days to ensure they’re aware of the risks before trading the tokens.\n\nSays OMNI project developers,\n\n“Omni is an Ethereum-native interoperability protocol that establishes low latency communications between all Ethereum rollups. Omni offers a secure, performant, and globally compatible architecture that presents Ethereum as a single, unified operating system to both users and developers.”\n\nOMNI is trading for $31.15 at time of writing, after fluctuating between a high of $53.81 and a low of $29.91.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTFBWZXJLMGpCQmdRS2Z4eDJOZGxrcGdtM1hmbGdzOThQWmZ4WGhRSU0zVlhjZkFnajE1dE5JVldfX0MxWnlqTHFYQWxCM2tlUHFCeHdodTI1dExKME94OEVueTFGT2g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Worldcoin to debut Ethereum layer 2 \"World Chain\" this summer - Crypto Briefing",
        "content": "World Chain aims to offer verified humans priority access and free gas on Ethereum's L2.\n\nShare this article\n\nWorldcoin, the brainchild of OpenAI CEO Sam Altman, unveiled today its latest development: World Chain, an Ethereum layer 2 (L2) network powered by Optimism’s OP Stack. With this new blockchain, Worldcoin’s vision is to build an open and collaborative network “by humanity” and “for humanity.”\n\nIntroducing World Chain, a new blockchain designed for humans ⚪️ pic.twitter.com/qNb7S3vqut — Worldcoin (@worldcoin) April 17, 2024\n\nAccording to Worldcoin’s blog announcement, the new blockchain is designed to prioritize humans over bots, offering verified individuals priority blockspace and a gas allowance for everyday transactions.\n\nWorld Chain aims to provide developers with access to millions of real users globally, focusing on practical applications in daily life, the team noted. The integration with the Worldcoin protocol is set to spur growth and utilize World ID’s Proof of Personhood to ensure security and scalability within the Ethereum ecosystem.\n\nThe network will be permissionless, and open-source, and is planned to be governed independently by the community. World Chain’s anticipated launch is later this summer.\n\nIn just nine months, Worldcoin has achieved impressive adoption with over 10 million users across 160 countries creating World IDs and wallets, facilitating a staggering 75 million transactions, the team shared. This rapid expansion is driving the Worldcoin team to push the boundaries of blockchain technology, focusing on efficiency, user experience, and utility enhancements.\n\nAccording to the team, World Chain is being built to enhance capacity, allowing for the continued growth of its user base and providing a more efficient transaction experience.\n\nBy reducing congestion, World Chain aims to make transactions faster and less expensive. With World ID, users can prove they’re a real person, anonymously, which can get them priority for their transactions and even some free gas. This makes it easier for new people to join without worrying about high fees.\n\nFor developers, World Chain represents a new frontier to engage with on-chain users at scale, offering a suite of decentralized financial and identity applications that cater to everyday needs, the team highlighted. This ecosystem combines the power of Worldcoin ID for secure identity verification with the functionality of Worldcoin, stablecoins, and various financial services.\n\nWorldcoin said it will continue to contribute to Ethereum’s network and collaborate with the broader Superchain ecosystem to advance shared goals in scaling, security, and interoperability.\n\nOptimism also shared its excitement about the introduction of World Chain. Notably, Coinbase’s L2 network, Base, also leverages the OP Stack, highlighting the growing adoption of this innovative scaling solution.\n\n🔴 The Optimism ecosystem continues to grow: @worldcoin announces World Chain will be built on the Superchain. Another L2 choosing the OP Stack:\n\n🧑‍🤝‍🧑 10M+ users joining the Superchain\n\n📈 Revenue contribution to the @Optimism Collective\n\n✨ Collaborative ecosystem development — Optimism (@Optimism) April 17, 2024"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxQX3BFTm02VWNLTXU4QVI2aGYzYzZnZ0RmU0FMN0tBR0VQU1BNNTExdW8xUmZ5V0Y2cEtjMHhZQXVxdDIyX1BuaHB5LW1vcXRlUzBLZGNocXhKZ2NJY01XeV96S25mQm91eW5aS0pkWHNRR2RqM2p0WkRJbW5YVlFzdFhDeGpUNUZoSGpmTjRReUhya091aGpJR29Uam1TeEl0NWVhSi1ncC1DeklieGI1SXJqcHNYMm9vWm5uMVgwRzM4SEhBWm5POVNjMi1wQkJuQXpZM1JEWnpiOVB3eUdtZ0Z1UFJidw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Jim Cramer Recommends Buying Ethereum Or Bitcoin Instead Of This Stock: 'Let's Not Fool Around' - Markets Insider",
        "content": "On CNBC’s \"Mad Money Lightning Round,\" Jim Cramer recommended buying either Ethereum (CRYPTO: ETH) or buy Bitcoin (CRYPTO: BTC), in case you want to own Marathon Digital Holdings, Inc. (NASDAQ:MARA). \"Let’s not fool around,\" he added.\n\nOn April 10, JPMorgan analyst Reginald Smith maintained Marathon Digital with an Underweight and raised the price target from $16 to $16.50.\n\nWhen asked about Exxon Mobil Corporation (NYSE:XOM), he said, \"Parabolic move, my friend. We don’t like parabolic moves, that’s a very good example.\"\n\nOn April 15, Exxon Mobil awarded a large contract to TechnipFMC plc (NYSE:FTI) for its Guyana’s Stabroek Block. TechnipFMC will supply subsea production systems for the Whiptail project.\n\n\"When it comes to data centers, I am inclined to say that no power company is going to make money off of it. Better to buy Vertiv (NYSE:VRT) or Eaton (NYSE:ETN).\"\n\n\"That’s the way to do it,\" the \"Mad Money\" host said when asked about NuScale Power Corporation (NYSE:SMR).\n\nOn March 14, NuScale Power reported fourth-quarter FY23 sales growth of 35.3% year-on-year to $4.60 million, missing the analyst consensus estimate of $9.975 million.\n\nPrice Action:\n\nExxon Mobil shares fell 0.1% to settle at $118.63 on Wednesday.\n\nMarathon Digital shares gained 0.2% to close at $14.63 on Wednesday.\n\nNuScale Power shares fell 0.8% to settle at $4.93 during Wednesday’s session.\n\nRead Next: Investor Sentiment Decreases Further, S&P 500 Falls For Fourth Straight Session\n\nImage: Canva"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQdkVSQS15M0lGbi1nVVduMVJyb1lKZ19FOC1ScEVDQlVxVGNDd0tPWkM3c2lDRVRDTldXVWQ1a2pMOXEyZWsyMVhOS3hhbDQzVVJMRFNQUGhCX3E0bGdoN3NJbmRCZEhLanFNT0RybjFNU0hLdDZNUUd4VjNpMW0tR195SkpLM2hSWEpGcTYtU0R4MENSLTVCZGRlMjFTc3JmYWxHcThJTU9ObWRrTFhpNWhCR0Jka2tWQ28taDhPM080TzlEYUVPWUJnVjVfbHJsNlhQbEY4cW5OeUNUVkhiOVhqU0MxeE52?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Macro Guru Raoul Pal Says 80% Of His Crypto Investment Is In This Ethereum Rival: 'And I Have 1% In Stupid S**t Like Dogwifhat, Dogecoin And Bonk' - Benzinga",
        "content": "In a surprising shift within the cryptocurrency investment landscape, former Goldman Sachs executive and macro guru Raoul Pal has revealed a substantial reallocation of his digital asset portfolio, favoring Solana SOL/USD over other cryptocurrencies, including Ethereum ETH/USD.\n\nWhat Happened: Pal, during a conversation on the Bankless YouTube channel, disclosed that roughly 80% of his crypto investments are now in Solana, The Daily Hodl reported on Wednesday.\n\nThe macroeconomic expert has replaced his Ethereum holdings with high-end art NFTs and has also invested in Exponential Age Asset Management, a digital assets-focused fund. \"I am 80% SOL. All of my ETH is now NFTs (non-fungible tokens), I have been buying high-end art NFTs.\n\n“And I have 1% in stupid s**t like dogwifhat, Dogecoin and Bonk. Got all of those. But that's 1%… just to be clear I've got like in all of memecoins and everything else, 1% of my portfolio. I am 80% Solana.\"\n\nHe justified his heavy investment in Solana by referring to the Solana/Ethereum chart’s performance in 2022, which led him to go “all in” on Solana, paralleling his earlier decision to invest heavily in Ethereum in September 2020.\n\nSee Also: Will Bitcoin Slump To $20K Amid Increasing Middle East Tensions? Peter Schiff Doesn’t Rule Out Possibilit\n\nWhy It Matters: Pal’s strategic shift to Solana comes at a time when the cryptocurrency is making significant updates to address network issues. on Monday, Solana launched a mainnet beta update to manage network congestion, which was partly due to the high demand for Solana block space from soaring meme coin transactions.\n\nMoreover, the cryptocurrency market has seen a growing interest in meme coins, as highlighted by researcher TradeTheFlow. His thesis suggests that meme coins reflect a societal shift towards high-risk, high-reward investment strategies and are not just a passing trend.\n\nAdditionally, the Ethereum ecosystem has faced skepticism from some market participants. A Bitcoin trader and advocate, Fred Krueger, expressed a pessimistic outlook for Ethereum, indicating that it might be losing its market position.\n\nRead Next: Crypto Markets Tumble Following Iran’s Drone Attack Against Israel, Investor Warns Of Continued Selloff\n\nImage via Shutterstock"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQUTJYSGNmYXEwQkhIWE81QXYyaHVlelJBQ2VOY2xWY2FmenRJdUJsQjNOU21VcGViZTdBWUN4aGU5NXZEeTlvbkR1RTlGaWIxclZQN1pmZ2FMX0Z2SHhMOHhLenhhYnVRWXRXaFctRWV6NUNHTFFZaGVxdDU4MG9DWnBrWGF5Tmdma3lSWEtyT0ZRUjRDZ2lNMkg0TzZFTHc1QUdOcVRscVJiM2hWYktvRXJHUDg5d3dBVDltVzFMbHEtOUQ1NjFZZFh5My1Sb2NOVVZwMnQ3S2hlS1NsSXRYWEd2eHRFakxG?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Jim Cramer Says Just Go Buy Ethereum Or Bitcoin Instead Of Marathon Digital: 'Let's Not Fool Around' - Benzinga",
        "content": "In a recent episode of “Mad Money,” host Jim Cramer advised against investing in Marathon Digital Holdings Inc. MARA and instead recommended Bitcoin BTC/USD or Ethereum ETH/USD.\n\nWhat Happened: Cramer, in his “Lightning Round” segment, discouraged viewers from purchasing Marathon Digital, a company involved in Bitcoin mining, reported CNBC. He suggested that investors consider Bitcoin or Ethereum as alternatives.\n\n\"If you want to own Marathon Digital, just go buy either Ethereum or buy Bitcoin, ok. Let's not fool around,\" Cramer said.\n\nMarathon Digital’s stock has experienced a tumultuous period, with its value dropping by over 20% in the past month. This decline is attributed to the overall volatility in the cryptocurrency market.\n\nSee Also: NFLX, AMC,UAL, WISA, TSLA: Top Trending Stocks Today\n\nWhy It Matters: Cramer’s advice aligns with the current state of the crypto market. On Tuesday, cryptocurrency analyst Ali Martinez highlighted the importance of Bitcoin’s $62,000 support level. Failure to maintain this level could shift focus to the next significant demand area, approximately $51,500. Conversely, a climb back above $66,250 could significantly boost the chances of a resurgence in the market.\n\nDespite concerns about the crypto market, Wall Street experts remain confident in the bull market‘s continuation. They cite a robust U.S. economy and the potential of artificial intelligence (AI) as key drivers.\n\nOn the broader market front, Cramer has also outlined potential factors that could lead to further market decline, advising investors to be cautious about their buying and selling decisions. His recent advice regarding Marathon Digital is in line with his cautious approach to the current market conditions.\n\nPrice Action: While Marathon Digital Holdings closed at $14.63 on Wednesday, marking a modest 0.21% increase, the stock has experienced a significant decline of 36.20% year to date. In contrast, Bitcoin is currently trading at $61,562, showing a 0.48% increase in the last 24 hours and a notable 39.37% gain year to date. Ethereum, on the other hand, is trading at $3,000, with a 0.61% increase in the past 24 hours and a solid 27.54% gain year to date, according to data from Benzinga Pro.\n\nRead Next: Macro Guru Raoul Pal Says 80% Of His Crypto Investment Is In This Ethereum Rival: ‘And I Have 1% In Stupid S**t Like Dogwifhat, Dogecoin And Bonk’\n\nImage Via Shutterstock"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9ITkM3V2lQRGJieV9nYWExRHdZRkVLUDNwQjJXYkl6YWxNelhXb0E2Vlg0NzAzZGhBbHg0d1pZdHE4Z2RaQ0JNc1pWUUxTWWJ3dlJWNlB2QXp4ODVOX2h0VDRFUVl5blBDTE01ZmVQNm9HQTBHM05J0gF_QVVfeXFMUFZZcHYtWVNmeGVvZ05HNWQ1b0RjZmhNdW9JRWVlQk42dnBmTm1XeGs3bWZFLVNXU3ZJQzM4QXZfMV8wQ01NLWpqMnBHM1VGRE1FU3JlcVJHV2k5TTNVWmFVMlNkN2hSQVprQ1ZCei1MSGstNGxWX3AzOUQ5YVpqNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "'Guy Explaining' Nightclub Meme to Be Sold as Ethereum NFT - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA popular meme photo of a guy at a club yelling into a girl's ear—about something that she doesn't appear to be into—is going up for auction as an Ethereum NFT on Foundation.\n\n“Milk Edinburgh” received its name from the nightclub where it was taken—Milk, in Edinburgh Scotland. The picture was originally shared around the internet with a watermark of the club's moniker on it, which is why the name stuck, and it’s since been widely used as an example of a “guy explaining” or “mansplaining.”\n\nThe photograph was originally taken in 2018 by David Wilkinson—who along with the help of pseudonymous Feisty DAO member Cryptopathic—is now offering the original artwork for sale as an NFT.\n\nA member of Feisty DAO was able to get ahold of Wilkinson, and found out that he had actually minted the image as an NFT back in 2021 but it had never sold; Cryptopathic and FeistyDAO offered to step in and host the auction for him free of cost.\n\nAD\n\nAD\n\nThe next meme to be auctioned is \"Nightclub Meme\" by David Wilkinson. The reserve will start at 15 ETH, for a 3 day auction beginning at 10am BST on Monday the 22nd of April. pic.twitter.com/40gkrIUbFg — path.eth 🛡️ (@Cryptopathic) April 17, 2024\n\nThis isn’t the first time that they’ve connected with the creator of a meme to sell it as an NFT. He helped the owners of the dog depicted in the Dogwifhat (WIF) meme coin auction off their pet’s photo for $4.1 million in a similar auction. Previously, they helped the owners of Kabuso—the dog used for the logo of crypto’s first dog-themed meme coin, Dogecoin (DOGE), sell NFTs.\n\nPath told Decrypt that their motivation behind all of this is to onboard more creators into crypto, and show them that NFTs are a beneficial way to monetize their work.\n\n“Many of these creators are approached by predatory teams that are looking to take huge cuts, or hugely underpay the artist—making it seem that this space is just as bad or worse than the rest of the art industry,” he said. “With our model, we are happy to benefit purely from PR, and really show people how easy it is to take control of their work in this way.”\n\nAD\n\nAD\n\nThe meme will go up for auction on Monday, April 22 on Foundation at 5am ET. The NFT will have a reserve price of 15 ETH, or about $45,000 at present.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE9Sc09XUkpNZ1F3aG1pOXhudmlzNU1VVGlMeEswX2gySkdHOTNyYVRzN1RJenR0VFRLQWg2a1lSX3IyWUhybE9uU0F2eW4xZ0JMSHJmcTRIUHNLSmczcVgzaGdqU2xWSHI0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "What is Ethereum's Pectra upgrade? Bringing smart contract functionality to wallets - OKX",
        "content": "What if managing your Ethereum wallet could be as easy and secure as sending an email? The Ethereum network has introduced a big change that aims to deliver this kind of simplicity to users, called the Pectra hard fork. The update is expected to make transactions safer, bring added stability to the network, and introduce a host of new features.\n\nEIP-3074 is a key part of the Pectra upgrade. It'll change how transactions are handled, making the network more accessible and bring smart contract functionality to wallets. How will these modifications affect the blockchain community? Read on as we explore the Pectra hard fork and what it means for users of the Ethereum network.\n\nTL;DR\n\nPioneering change: The Ethereum Pectra hard fork aims to change how people use their wallets and make the network more efficient.\n\nEIP-3074 introduction: The proposal allows regular digital wallets to use smart contracts, enabling you to make more complicated transactions that are also safer.\n\nStreamlined transactions: Grouped transactions and paying fees to third parties aim to make usability easier.\n\nSocial recovery feature: The update introduces a new way to regain lost funds, using trusted contacts instead of traditional seed phrases.\n\nCommunity impact: Greater simplicity and safety from Ethereum and its wallets can help increase people's trust in and use of decentralized applications.\n\nWhat is the Ethereum Pectra hard fork?\n\nThe upcoming Ethereum Pectra hard fork is a major milestone in Ethereum's history. It aims to improve wallet capabilities and the overall efficiency of the network. The update, which introduces numerous Ethereum Improvement Proposals (EIPs) — and notably EIP-3074 — is scheduled for launch in late 2024 or early 2025.\n\nThis proposal is designed to change the way Ethereum handles transactions by allowing digital wallets to use smart contracts. EIP-3074 includes capabilities such as grouped transactions, which let users sign a transaction once regardless of how many tasks it contains. The proposal also allows for endorsed transactions, which enable someone other than the asset owner to pay for transaction fees.\n\nThese improvements are intended to simplify a user's interactions with the Ethereum network, greatly enhancing the overall experience by removing transaction complexities and expenses. Meanwhile, EIP-3074 comes with a new \"social recovery\" feature. The feature lets you regain access to your assets without needing the usual seed phrases.\n\nImpressive, but it doesn't end there. These latest upgrades are part of a wider plan to future-proof the Ethereum network and strengthen its status as one of the leading platforms for decentralized applications (DApps) and smart contracts.\n\nWhat are the security implications of EIP-3074?\n\nWhile EIP-3074 helps to make Ethereum more secure and easier to use, it's important to be aware of some security implications brought by the proposal's introduction. For example, the AUTH and AUTHCALL opcodes allow for more flexible transaction management but do introduce potential new vulnerabilities.\n\nSecurity benefits\n\nFormal audits and verification : EIP-3074 went through security audits to ensure safety. Audits are essential for finding and fixing vulnerabilities before they're exploited.\n\nEnhanced user control and recovery: With EIP-3074, you can use digital signatures to give control of your Ethereum accounts to a smart contract. This makes it easier to get your assets back or manage them without risking the safety of your private keys.\n\nSecurity risks\n\nPotential for misuse of invoker contracts : One of the main risks associated with EIP-3074 is the potential misuse of invoker contracts. If these contracts aren't implemented securely, they could be exploited to perform unauthorized transactions or access funds without the user's consent.\n\nNeed for trusted invokers : Building on the point above, transactions made with EIP-3074 need invoker contracts that can be trusted. Developers should use measures like whitelists to allow only confirmed safe entities to be involved in transactions.\n\nComplexity in transaction authorization: Using more complex ways to approve transactions can make new and old contracts easy to attack. Greater complexity occurs because the AUTH opcode changes who's seen as the \"sender\" in transactions. Vulnerabilities can arise if this process isn't managed carefully, putting users at risk of attack.\n\nMitigation strategies\n\nComprehensive auditing: Regular checks of the EIP-3074 implementation and the invoker contracts are important to protect users. These checks can help identify and fix vulnerabilities before they're exploited.\n\nStrict validation of commits: To avoid issues like unauthorized access or replay attacks, commits must include ways to make sure each transaction is authorized correctly and can't be misused. One way to do this is by using unique identifiers or nonces.\n\nHow does the social recovery feature work with EIP-3074?\n\nThe social recovery feature brought by EIP-3074 is one of the most noteworthy updates coming to the network. Let's explore how it works in more depth.\n\nDigital signature for asset control : First, you give control of your assets to a special contract by using a secure digital signature. This step is important because it lets the contract manage the assets, but you can still get them back if needed.\n\nInvoker contract : When the assets move to the new contract, that contract will handle all future actions for you. This setup lowers the chance of losing access to your assets if you forget your private keys.\n\nOperational codes - AUTH and AUTHCALL :\n\nAUTH : This code checks that your digital signature and transaction details match your original instructions.\n\nAUTHCALL : After checking, this command lets the contract send crypto. It also allows others to know you've sent assets, so people can see the link between you and the contract's actions.\n\nSecurity and asset recovery : The digital signature contains a unique code that guarantees you can retrieve your assets if you lose or forget your seed phrase, making it an invaluable feature.\n\nEnhanced security measures: Despite the new features, there are risks of dangerous invoker contracts. To protect against losing assets without permission, the update includes ways to use invoker contracts that have been officially checked and reviewed.\n\nHow will EIP-3074 affect transaction processes on Ethereum?\n\nEIP-3074 will alter the processes involved in Ethereum transactions by adding new features that bring welcome simplicity.\n\nBatch transactions : EIP-3074 lets you combine multiple transactions into a single one. This should make transactions more efficient and may lower fees by distributing costs across multiple actions within the same transaction.\n\nSponsored transactions : Sponsored transactions are a new feature with EIP-3074. Here, a third party can pay the transaction fees instead of the asset holder. This could incentivize the use of DApps as asset holders no longer need to pay gas fees.\n\nSmart contract-like capabilities in EOAs: Now, regular user accounts can do some of the same things as smart contracts. They can give permission to smart contracts to perform actions autonomously.\n\nAlongside reducing the complexity of transactions made through the Ethereum network, the Pectra hard fork also introduces new ways for developers to make disruptive and easy-to-use apps.\n\nWhat other EIPs are included in the Pectra upgrade?\n\nVarious other proposals are set to be introduced as part of the Pectra hard fork, each bringing additional functionality to the network.\n\nEIP-7610 : This proposal is designed to make the system more secure by only letting addresses with storage space create smart contracts. In theory, this change will make it easier to upgrade the system in the future, especially via Verkle trees.\n\nEIP-7523 : EIP-7523 focuses on making the Ethereum network more efficient. With the proposal, empty accounts will be removed from the Ethereum state. This helps reduce the state's size, making the network faster and easier to use.\n\nEIP-7251 (Maxeb) : This addition aims to make the network more scalable by simplifying the management of validators. This is achieved by increasing the maximum effective balance for validators from 32 ETH to 2,048 ETH. Doing so reduces the need to manage multiple validators, which reduces complexity.\n\nEIP-2537 : The EIP-2537 update brings new pre-built functions to the BLS12-381 curve. These functions help make cryptography processes more efficient. Better cryptography means better security and verification on the network.\n\nEIP-3074, 5806, and 7377 : Account abstraction EIPs make it easier to process transactions. EIP-3074 adds new commands (AUTH and AUTHCALL) that allow for transaction contracts to be verified and executed autonomously once certain permissions are set. This helps with complicated tasks like combining multiple transactions into one or having someone else pay for a transaction.\n\nEIP-5920 (PAY opcode): EIP-5920 provides an easier way to share ETH by sending tokens directly without activating the receiver's contract code.\n\nEach EIP contributes to the broader goal of making Ethereum more scalable, secure, and user-friendly, laying the groundwork for future advancements in the blockchain space.\n\nWhat comes after the Pectra hard fork?\n\nFurther updates are planned following Pectra's release in late 2024 or early 2025, most notably the addition of Verkle trees.\n\nAfter Pectra, Ethereum is planning more updates. One important step is adding Verkle trees, which upgrade Ethereum nodes to validate blocks without needing to store large amounts of state data. This upgrade is a significant step towards 'statelessness' for the network. A stateless client doesn't need to store a full state database to validate incoming blocks.\n\nVerkle tress and progress towards statelessness complements Ethereum's wider ambitions to improve scalability through advanced technologies like sharding, which aims to increase the number of transactions the network can process at once. This scalability solution has been a major focus following the network's move to Proof of Stake with the 'Merge' event.\n\nThe final word\n\nThe upcoming Ethereum Pectra hard fork promises to permanently alter how users make transactions on the network and manage their wallets. Efficiency, safety, and uprated features are all key benefits set to be brought about by the development and the arrival of the EIP-3074 proposal.\n\nAlthough this next phase of evolution for the network isn't without its challenges — notably, concerns over potential security vulnerabilities — it marks fresh change for Ethereum and added competitiveness for the network."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOVk1FcGROdEFxeGhJQl9kQk02dzBIZk9aZXVFaDV0a2VBempvOU1hLVhsS3Vrc1c0YXNnMW4tQnBOXzRFZkM0U1BmaW85d3psbm9tSUFReTRKblMzWmhJdmxoMXFpeWJPTDNQb3BTVFpPeXZJMXhaWGEtNXBCTXByTUtRR0Zjai0tZHZuemd30gGTAUFVX3lxTE5BSHBjRkNjZGlhWHhrc1h4QU5xNkFIbkwxWFVnVkFzLUdvNXdPOEpndW53Z2ktSDB1Z2xnUDRqdHI3VnRKdjQ5S0s1Ni1YOExycjRiZnJROHoyTWJtRFpzX0E2NE9qN2xZQmFfWm5oTWNTOFhnR0l3SWctVFNjN2FSNFhwNmRHY214U2NhdktwZ1R5WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ethereum and Bitcoin Investors Are Destroyed, But It Could Be Positive - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAfter a tough weekend that saw Bitcoin dip to around $61,500 and Ethereum to $2,890, the chatter has been mostly dark. Yet, this surge of FUD among traders may not be as bad as it sounds.\n\nAdvertisement\n\nAs markets start to bounce back, going against the crowd's doomsday predictions, there is a lesson to be learned. When everyone is selling in a panic, it often sets the stage for a turnaround. This is where we are now – at a potential tipping point where the pessimism has gone so far that it might just flip the other way.\n\nAccording to sentiment analysis, negative tendencies on the market could indicate a coming rebound, as the markets have a history of moving contrary to the crowd's fears. The expectation is that this trend could hold up until the hype and excitement (FOMO) surrounding the halving event take center stage again, just as they did a few weeks ago.\n\nAdvertisement\n\nOn the price chart, Bitcoin and Ethereum have crucial levels to watch. For Bitcoin, the resistance to beat is around $67,000. If it manages to rise above this, it might signal a larger recovery. Ethereum faces resistance near $3,500 and has support at $2,700. If it holds above support and breaks past resistance, it could be a sign of a more sustained upswing.\n\nWhile the current sentiment is in the dumps, history has shown that such sentiment extremes can precede market recoveries. The collective mood swings of investors, from fear to greed and back again, are part of the crypto industry.\n\nJust as panic can spread quickly, so too can a recovery start – often when it is least expected. Keep an eye on those critical price levels."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxON00wYVRzRkdzU1BPZUdaajloX1RIc3ZSQVBJWDFBMmhHUF9Wc0UzRnJIa3F3a3hDdUJOQjNhQ1VVcGx2SWx6S053OE1YRUhRdUR5ZTBiXzNDSng3Smd2bTBqbWgtYVFDeTNuSzNab01aZjZ3SEtPWmk5OFlzSkVDQXZBSV9FZ9IBiwFBVV95cUxOc2RiRUt0UGpmRU1KaDdHUXV1eXhUVmh1SWQ4M3U0ZXJhNXBSQUszTFJRYWVPV2piZlpXZHVSUjZyWUZhMFVGZFhJSGp5czhxVjhZbHJ0WWktOE5jbWluSjZBbUdJQU1BS0E0d2JQLWxKaEtjcnFMLVY3QmhGa2M3aW5kOUlyY2JPbl9j?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Is Ethereum turning bullish? This indicator is the key - AMBCrypto News",
        "content": "Ethereum’s Taker Buy Sell Ratio attempts to breach the center line in an uptrend.\n\nHowever, bearish sentiments continue to grow.\n\nEthereum’s [ETH] Taker Buy Sell Ratio is poised to cross above its center line, signaling a rise in bullish sentiment amid recent market troubles, data from CryptoQuant has shown.\n\nThe Taker Buy Sell Ratio is a metric that measures the ratio between the buy volume and sell volume in an asset’s futures market.\n\nA value greater than 1 indicates more buy volume than sell volume, while a value less than 1 indicates more sell volume than buy volume.\n\nAt press time, ETH’s Taker Buy Sell Ratio was 0.96, per CryptoQuant’s data.\n\nThe bears remain in control\n\nDespite the spike in ETH’s Taker Buy Sell Ratio, an assessment of the coin’s spot and futures markets revealed that bearish sentiments remain significant.\n\nFor example, ETH’s Futures Open Interest has fallen to its lowest since the 28th of February, according to Coinglass data. It peaked at $15 billion on the 9th of April and has since declined.\n\nAt $11 billion as of this writing, ETH’s Open Interest has plummeted 27% in the last seven days.\n\nAn asset’s Open Interest measures the value of its Futures contracts that are yet to be closed.\n\nWhen it declines this way, it suggests that market participants are closing their positions and exiting the market without opening new ones.\n\nDuring the last week, ETH’s funding rates briefly turned negative on 14th April, when a significant number of market participants opened trades against the coin’s price.\n\nThis marked the first time ETH would record a negative Funding Rate since the bull market rally began in October 2023.\n\nIn its spot market, key technical indicators observed on a daily chart hinted at the possibility of a decline below $3000 if bearish sentiments linger.\n\nETH’s Awesome Oscillator, which measures market momentum, posted downward-facing red histogram bars at press time. This trend has been present since 13th April.\n\nDownward-facing Red bars on an asset’s Awesome Oscillator are often interpreted as a bearish sign, suggesting a hike in selling pressure.\n\nLikewise, readings from ETH’s Parabolic Stop and Reverse (SAR) showed the dots that make up the indicator resting above the coin’s price.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe Parabolic SAR indicator is used to identify potential trend direction and reversals.\n\nThe market trend is considered bearish when its dotted lines are placed above an asset’s price."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNcVY1WGxyQVZYYVJ6VXhTVXItWHdYRGpnYW1EazhLVXRIOXRUX0FMV0sxd3VhRm9vTzY2REhvSFQxdDlCQk53TW9SbFBUTmtXN2EwN3Z2RHFsVDFXU2FnV3NXQjZLUUNiYWVBRnFSa0JzdVU3aHVMd0VQLW43TFJPOEJRWEtLQ1RFU1RobGEtd1lCZEZ4elhV0gGcAUFVX3lxTFA1eFNtVC13dXp1VDZobjF4ZXN3LXpyNVl6RjAxVm1QalJscFhUQWt2Z2ZDUWZodTk5UmtpOTdCdFQ2eVU4ZGJ1Y3JfUFhjTXN1N1pzM2JZQXZoRmU4MmxRakVERlRQWjR0QjhGMGk3Uno3TW5yQ1E0ZWdiQjUzd0pGOWZjVWZhS2xNRm1UNGZHdjd0Rm5qODZQejFUbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong Bitcoin & Ethereum ETF To Attract Only $1B AUM: Bloomberg Analyst - CoinGape",
        "content": "Bloomberg analyst Eric Balchunas, in collaboration with analyst Rebecca Sin, has adjusted estimates for the potential assets under management (AUM) of Bitcoin and Ethereum Exchange-traded Funds (ETFs) in Hong Kong. The AUM expectation for the Hong Kong Bitcoin and Ethereum ETFs has been lowered to $1 billion.\n\nHong Kong Bitcoin & Ethereum ETFs Might Face China’s Regulatory Scrutiny\n\nBalchunas shared insights indicating that mainland China investors may not be eligible to purchase these ETFs due to restrictions on virtual asset investments. Consequently, the analysts have revised the AUM target down from $25 billion to $1 billion for the first two years.\n\nadvertisement\n\nDespite the lowered projection, Balchunas still considers the $1 billion estimate for the Hong Kong Bitcoin and Ethereum ETFs as healthy. However, he emphasized that it falls significantly short of the previously speculated $25 billion mark. In addition, he noted that the speed of attaining this revised target largely hinges on improvements in infrastructure.\n\nMoreover, Balchunas also noted that although mainland China investors face restrictions, there are alternative routes available for investment. However, these methods utilize less utilized channels that could potentially face regulatory scrutiny.\n\nEarlier, the analyst also noted that the inflows of Hong Kong Bitcoin and Ethereum ETFs would be lower than expected. The biggest restriction was the size of the Hong Kong crypto market being relatively smaller than that of the U.S. In addition, the restraints on the Mainland China investors adds to the challenges.\n\nAlso Read: Top Analyst Sees Bitcoin (BTC) Hitting $650K Amid Hong Kong’s Bet\n\nHong Kong SFC Offers Greenlight\n\nEarlier, on Monday, April 14, the Hong Kong Securities and Futures Commission (SFC officially sanctioned the trading of Spot Bitcoin ETFs and Ethereum ETFs, marking a significant milestone. Moreover, Hong Kong now stands as the first jurisdiction to introduce a Spot Ethereum ETF, while similar discussions are underway with the US SEC.\n\nDiverse financial institutions such as China Asset Management, Bosera Capital, and HashKey Capital Limited have received the green light from the Hong Kong SFC to launch Bitcoin and Ethereum ETFs. This breakthrough empowers investors to invest in Bitcoin and Ethereum by obtaining shares in these ETFs.\n\nAlso Read: Bitcoin ETF Outflows Cross $58 Million, GBTC Outflows Slow Down\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNcVRPNGhUa0xLbnE3c0taVWxNQzR6blYwYm54M0RqTllmSlU1OTBKUzYzejFuZXNRc1NScTNhRVJZcktJNDNvYmpVVWlrTS1GNVA1TlBPT0RBNW5vWThIeUhieXh2M2NVWVZQNzQ3R2xENXdmZDFNNEFYVTdvZWpCdzZxTmtSb2JfQlAyRDNCRnI0c0dC?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Introducing Scroll Sessions: Native zkEVM Layer 2 for Ethereum - Blockchain.News",
        "content": "Introducing Scroll Sessions: Native zkEVM Layer 2 for Ethereum Luisa Crawford Scroll has unveiled Scroll Sessions, a groundbreaking native zkEVM Layer 2 solution for Ethereum that aims to enhance scalability and reduce transaction costs. This article provides an overview of Scroll Sessions and its potential impact on the Ethereum ecosystem.\n\nScroll, a prominent player in the blockchain space, has recently announced the launch of Scroll Sessions, a native zkEVM Layer 2 solution designed specifically for the Ethereum network. This innovative technology aims to address the scalability and high transaction costs associated with the Ethereum blockchain.\n\nWith the rapid growth of decentralized applications (dApps) and the increasing popularity of the Ethereum network, scalability has become a pressing issue. The current limitations of Ethereum's Layer 1 infrastructure have resulted in congestion and skyrocketing gas fees, hindering the seamless user experience and adoption of dApps.\n\nScroll Sessions introduces a unique approach to scalability by leveraging zero-knowledge proofs (zkSNARKs) technology. By incorporating zkEVM, a native Layer 2 solution, Scroll aims to significantly enhance Ethereum's throughput, allowing for faster and more cost-effective transactions.\n\nThe integration of zkEVM enables the execution of Ethereum smart contracts off-chain, while maintaining the same level of security and trust as the Layer 1 Ethereum network. This off-chain execution reduces the computational burden on Ethereum's mainnet, resulting in improved scalability and reduced gas fees for users.\n\nOne of the key advantages of Scroll Sessions is its compatibility with existing Ethereum smart contracts. Developers can seamlessly migrate their contracts to Scroll Sessions without the need for any modifications, ensuring a smooth transition to the Layer 2 solution.\n\nIn addition to enhanced scalability, Scroll Sessions also offers privacy features through zkSNARKs technology. This allows users to maintain the confidentiality of their transactions and data, further enhancing the overall security of the platform.\n\nThe introduction of Scroll Sessions has garnered significant attention within the blockchain community, as it has the potential to address the scalability challenges faced by Ethereum. By providing a seamless and cost-effective Layer 2 solution, Scroll aims to unlock the full potential of the Ethereum ecosystem, enabling greater adoption of dApps and facilitating a more efficient blockchain experience.\n\nAs the development of Layer 2 solutions continues to gain momentum, Scroll's native zkEVM Layer 2 technology holds great promise for the future of Ethereum. With its focus on scalability, cost-effectiveness, and privacy, Scroll Sessions could pave the way for a more scalable and inclusive blockchain ecosystem.\n\nImage source: Shutterstock"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOU2QwTXVUUlZYOEpSdGZqdUFzNmhhNGZPS211Q0xSM25FY3pHRnhDd2ZqVTNKTzZoS1YzdWMtcFMtXzBvcER0Tk8zS19ueUk5TDRrenl0WHEyWU5vS0d5UFZqRHUzbFNFTjZmREN2dHJNak1PSERiUndyOS1QRVNYeE5zaE84ME9GUXhoZjRmaFo0d243UWJiV01wZnZEcU9USGVZSGhnNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Blockchain: the queue of validators is sharply increasing - The Cryptonomist",
        "content": "The queue of Ethereum Blockchain validators is sharply increasing, reaching the highest levels since September 2023. Currently, the waiting list of validator nodes has risen above 21,391.\n\nEthereum Blockchain: the number of validators reaches 21,391\n\nAccording to data from ValidatorQueue, it seems that the Ethereum blockchain validator queue rose to 21,391 yesterday. Nothing to do with the 7,045 validators waiting reported last February.\n\nThis means that the number of users queuing up to register as validators of the network continues to increase, which will be possible by staking their ETH.\n\nNot only, this current level of expectation to become a validator node of the Ethereum Blockchain, is the highest level since September 2023.\n\n​​https://twitter.com/esatoshiclub/status/1780280839688933491\n\n“The Ethereum validator queue reaches its highest level since September 2023. This surge aligns with the increasing interest in restaking, which allows participants to earn additional returns.”\n\nAt the time of writing, the number of active nodes on the network is 984,546, just shy of a million.\n\nEthereum Blockchain: the queue of validators is increasing rapidly due to restaking\n\nIn addition to staking, what has become known is that the motivation behind this surge of interest in becoming a validator of the Ethereum blockchain, is also restaking.\n\nRestaking allows users to stake the same ETH on both Ethereum and other protocols.\n\nPlatforms like EigenLayer leverage Ethereum’s validators and tokens, allowing smaller and newer blockchains to benefit from its security and trust system.\n\nJust in its latest update from a week ago, EigenLayer was launched on the Ethereum mainnet, along with its data availability layer EigenDA.\n\nActually, this launch opens up the possibility for platform restakers to start earning additional returns on their staked ETH, something that did not happen before.\n\nCoinbase Cloud and Google Cloud are among the first operators of the protocol, which on Friday announced six actively validated services that will be guaranteed by EigenLayer’s restaking.\n\nThe opportunities of restaking and the price of ETH\n\nAt the beginning of April, the new earning opportunities in the Ethereum restaking sector were explored, increasingly targeted by crypto airdrop hunters.\n\nSpecifically, Renzo and Etherfi’s airdrops (2nd round) have been analyzed, both besieged by ether stakers in the last month, with a significant influx of capital coming in.\n\nDespite this restaking movement, the price of the crypto ETH is down -12% in the last seven days. At the time of writing, ETH is worth $3,085.\n\nThis trend follows closely that of the market leader, Bitcoin (BTC), which also dropped by -8% in the last week.\n\nNot only that, despite the long wait for Ethereum blockchain validators, the volume of ETH exchange has dropped by -22% in the last 24 hours."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE92VUFObnJTODVkdU9nOFpTQS1QVGpDWkdnNFZmVmpqZFlxSFNfd0lrTXBSV3BIbkswd0xaY0FiZnRqUUl3UGZidWRscWhBMF84SHltaGhuUHVvMnN3cnlDcEduX19oV3BoZFI2RjdDOTV4a0lBemxmUW5vOHlxdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Could Drop To $2,000 Level: Here’s Why - Watcher Guru",
        "content": "Ethereum is on the verge of a significant price decline, according to a recent technical analysis by Alan Santana, a well-known crypto analyst. Santana forecasts that Ethereum will reach a price of $2,000 within a few days or weeks, advising investors to brace for the impending decline.\n\nThe analyst points out that Ethereum has been drooping for six weeks straight, yet many investors are still waiting for new highs. Santana presents a compelling five-step sequence that draws parallels between the current market situation and the events that unfolded in November 2021.\n\nAlso read: Can Ethereum (ETH) Hit All-Time High After Bitcoin Halving?\n\nFrom All-Time High to Bearish Momentum\n\nIn early November 2021, Ethereum reached a new all-time high (ATH) but immediately turned red, signaling a potential reversal. Santana emphasizes that while the market is at its most bullish when hitting a new ATH, it also opens up the highest bearish potential.\n\nHe notes that the best time to sell is when prices are trading high and near resistance, as waiting for full confirmation from the market often leads to missed opportunities.\n\nFast forward to early March 2024, Ethereum once again produced a peak, reaching a multi-year high before turning red and starting to drop with bearish momentum growing last week. This pattern closely resembles the events that followed the November 2021 ATH.\n\nAlso read: Can Solana (SOL) Hit $200 After Bitcoin Halving?\n\nEthereum EMA10 Breakdown Confirms Top Is In\n\nFollowing the November 2021 ATH, Ethereum dropped below the 10-week exponential moving average (EMA10) as it turned red. The break and close below EMA10 confirmed that the top was in, and a new bearish wave had begun, leading to the “first drop.” Similarly, last week, on April 8, 2024, Ethereum moved below the EMA10 on the weekly timeframe, confirming that the top is once again in.\n\nFollowing the top confirmation, Santana now anticipates the “first drop,” which could lead to a target range of approximately $2,222 to $2,400. A dead-cat bounce, a temporary recovery in a declining trend, may follow this drop, ultimately leading to a lower low and a bearish impulse.\n\nAlso read: Shiba Inu (SHIB) & Dogecoin (DOGE) Price Prediction This Week\n\nThe analyst suggests that the major flush could reach $2,000, around the 200-week moving average (MA200), which is considered a significant support level. While the price could potentially go lower, Santana identifies this as the key support area to watch."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOUlV5bVdKbTV3dGRWX3pjaVNiUng4c3ZBQzBCM3EzQlBNWVJ4SHh3NGtFY2tHcENocU43QVlFelJZV0piMWZ0eHhtNWtLVjl2TWQ2VW16UGV0d2thQU9zVDVKdC1GZGhGQ25mRlAyRW5keDFSRFpEZXo0a252NWFTalk5YXBGSU9iUU1RbnNsbmt2LW96YUF2Ul9kczB3RVYzd1U1Uy1mMk1tNi1lZnMxVEd4MG1JM3B3SG55ckxNdnM0Ykdm0gHKAUFVX3lxTE96SVVYbV9oRjd3SzhkcVhZdktkd3JnTTNzeUxiamsyWDJpOG5iSlBaY3VFM2g0RzlpNXdDSGFheVprTWUzQmJyd295UmxTWDN2eG42S1BsRkNRQkpOSnBqRTlONWg5XzhONmc4YVlENFl3UnZIUm9ucHgtSW42b0kybGxXMnZ3ZUVDMVZ6bk5Qa3BJNnFsSkE5b3BUeXA5YWJqbGZFSE1EOFZsVzdtbUE0VV8yLUpjaUt0ZnJPSWtaN2V1LUdtZl81N3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Coinbase's Former Executive Nana Murugesan Named President of Ethereum Scaling Firm - Finance Magnates",
        "content": "Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights\n\nRelive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more!"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOemlFTjNmU0V5NS1POURtNm8tbUhRQWFTZGItZXNyOHF6Z1hkcUJFYlZJT2hKNEplU0lPbndwdDI3YmlKcG9PdG1lZzdXeHRNeUhzS0dWd0R4MVdMRkdTWHExZFNtSU5aOUtZSTM0S1hDVzFFVHBLdjJVTG1OTGdsdFIzVEZraE96MldRQ25PaDBldmFXa2haZF9XMF90Q3hXS1V2SjhvU19PREV3ajJNUnhTS1pnODRLMUVoY2FVTDDSAcYBQVVfeXFMTl9sOW9OTzM2cGNwWDVMMzFSNVcxQnU3V3A2R3h1UFlSRlNsT1g2c3ZCVDl6clhfbDFvSEVmOERaU1BMUk9vUXFROVllVXJOVXlmNG9VWXBfbEc1Y05Wc2h4blZOXzNVWUtyTHY2MzhUTHl5Q1NzMWJqWHhZcDJSSzFkTkQxZ3N6NEhyVEhwNjR0Q1FycmJXNU5ualN3VWJGSDJJb1psbDhPYkRYRHF2SkVJN3BoWFlaLVVCU2dXc0FTSGNCeTh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Lido DAO announces new phase on Ethereum with Simple DVT module - FXStreet",
        "content": "Lido DAO voted on the deployment of the Simple DVT module nearly six months ago, it is ready for mainnet as of April 17.\n\nSimple DVT helps to make Lido’s technology accessible to more users.\n\nLDO price is down nearly 3% in the past day.\n\nLido DAO (LDO) announced that the Simple Distributed Validator Technology (DVT) is now officially ready for mainnet deployment. Lido DAO voted on this module nearly six months and laid the groundwork to diversify their node operators with the help of users that stake their assets with Lido.\n\nLDO price lost nearly 3% of its value on Wednesday.\n\nLido DAO plans to bring Simple DVT to stakers, diversify node operators\n\nLido DAO, a Decentralized Autonomous Organization that decides on the key upgrades and key parameters of liquid staking protocols, is ready to release the Simple DVT module on its mainnet. The clusters labeled Obol Cohort 1 are ready to accept Ethereum (ETH) deposits.\n\nThe Ethereum staking protocol’s goal was to diversify the Node Operator set with the participation of community and solo stakers within its ecosystem. The new depositable Ether will flow into the Simple DVT Module, and once it reaches capacity, it will go to the Curated Module.\n\nLido announced in its official blog that the third Obol testnet run in preparation for bringing Simple DVT to the mainnet, surpassed all minimum performance benchmarks.\n\nLido’s post says that the mainnet onboarding of 12 clusters is underway and the performance metrics are currently above the benchmarks.\n\nLDO price failed to keep up with the developments in the Lido ecosystem. LDO price shaved off 3% of its value in the past day and the token is down nearly 28% on the weekly timeframe. At the time of writing, LDO price is $1.947."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNLXJnczBKMnRXT2dUQ19obXJZQm1QTWJqbFdSeXBKTmtLN1V3TzU0dVd4RjdJTjFrWDdmWEh3ZW8wend1QnRfQ19nY1F3WXdfaHJLa2Z3T1NjUHhlcXNOdzkxdDFmX0NreTN0dUxwbTYzLTNGbE9JYk5CbHQ3ZGhrVkVjb0l3WER1aDg00gGQAUFVX3lxTFBGdHpZN2R5NmMxRnJ3SVd5ZkVMZm9Mbm1waDdWcm1Xd2tDYWtEVjg1QVFiaW5Vb0lGekJlZmc1SFV4ZGRzb2pGeDZrYWtBOXVLQmR5Y2dlS1VsSjVrTHY2Ri1rX1Z5US1STzE2WTc1eGxfd0lVOVE2eWJ2eElXTnI1RDhEb1JyUTVDQWFKOTJxdg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "APE to $1? As Ethereum NFTs fall to Bitcoin, here is the impact - AMBCrypto News",
        "content": "Ethereum loses more ground on Bitcoin in NFT volume.\n\nApecoin continues to decline.\n\nEthereum [ETH] remains prominent in the NFT conversation; however, recent data indicates a reduction in its dominance.\n\nApeCoin [APE], the ecosystem token associated with Bored Ape Yacht Club (BAYC) – an Ethereum-based NFT collection – has experienced a decline in relevance, mirroring the recent downturn in BAYC’s floor price.\n\nEthereum NFT volume continues to slide down\n\nNFTs were primarily associated with Ethereum in the past, given the multitude of projects hosted on the platform. However, the emergence of alternative platforms has disrupted this monopoly.\n\nIn recent months, Bitcoin has emerged as an unexpected competitor in the NFT space despite operating differently.\n\nAnalysis of NFT volume on Crypto Slam revealed that Bitcoin has surpassed Ethereum in volume over the last 30 days.\n\nSpecifically, the NFT volume on the Bitcoin network was over $455.59 million, whereas it amounted to $291.15 million on Ethereum.\n\nData indicated that Bitcoin collections occupy the top three spots in volume. In contrast, popular ETH collections like Bored Ape Yacht Club (BAYC) only rank sixth.\n\nA look at how BAYC has trended\n\nAn analysis of the overall price trend of Bored Ape Yacht Club (BAYC) on NFT Price Floor showed a significant decline in the BAYC floor price over the past few months.\n\nParticularly, in April, there has been a noticeable drop in the floor price.\n\nAt the time of writing, the floor price was around 10.89 ETH. The floor price represents the lowest price for the Ethereum-based NFT collection, and the chart indicates a decline of over 67% over the past year.\n\nThe decline in BAYC and other Yuga collections has also impacted ApeCoin, bringing it close to its lowest price.\n\nAPE close to ATL\n\nThe analysis of ApeCoin indicates a negative trend for the de facto ecosystem coin of Ethereum-based collections. Examination of the Relative Strength Index (RSI) showed an oversold condition.\n\nRealistic or not, here’s APE market cap in BTC’s terms\n\nAt the time of writing, the RSI was below 30, signaling a strong bear trend and an oversold state. Additionally, APE was trading around $1.15, reflecting a more than 4% decline.\n\nFurther analysis showed that APE’s all-time low was around $1.01, suggesting a further drop could bring the price to this region."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQWF9wQUQycFI0TDRVMVJMX3BCNWVmd0VQaEhNOTZRLUQyZHBTLWJLRmtHeWdIdlhpUzVPRnNPNGNLVk1NMkd5d0owOTVfWEVwSFBXOUs2aHl5NzJibjV2MGdqVy1YU0tRQzFnUjlQaF9IZTY3cnJCNExuVzdwc1hMcmVKcy1wMXdT0gGQAUFVX3lxTE84Q2tNajgyTjZHbUhaaVBjSGRlQjItZUlDR2FkWkh5VUFrWUU1a2dpR1M5c0xEQnZBdTFRTURpaWsyemdXaVM4bW9SaTVMMm43M2RGTjZCaEotSWdsZmdrZFpkX0lQdG9IZ3pyaEozWFZ1NjBMbmEwM21rUGJadmRyaGlwQm0xUlgxZERHSW9NZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "'Ragnarok Online' Franchise Coming to Ethereum Gaming Network Ronin - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe classic Ragnarok Online gaming franchise is coming to Ethereum thanks to a partnership between developer Gravity and Ronin, a sidechain gaming network. Gravity will launch Ragnarok: Monster World, a strategy game based in the Ragnarok Online universe, on Ronin.\n\nRagnarok Online, an iconic massively multiplayer online role-playing game (MMORPG) that has amassed over 167 million downloads globally since its 2002 launch in South Korea, is making its blockchain debut with Ragnarok: Monster World.\n\nDeveloped by Web3 studio ZERO X AND, the game combines tower defense and monster collection elements. The game was first announced in December.\n\n\"Ragnarok holds a special place in the hearts of our core audience in South East Asia, including many of our own team members who grew up as avid fans,\" said Trung Nguyen, CEO and co-founder of Sky Mavis, the studio behind the Ronin network. \"We are committed to bringing IP that will transcend gaming culture through our bleeding edge technology and can't wait to see the ‘Ronin Effect’ on Monster World.\"\n\nAD\n\nAD\n\nScheduled to launch on Ronin in Q3 2024, Ragnarok: Monster World will allow players to tame and collect Ragmons, the game's unique monsters, and then train them and engage in player-vs-player (PvP) battles to earn rewards. Future updates will introduce additional features, as well as benefits tied to community participation.\n\n\"We're thrilled to collaborate with the team behind Axie Infinity, who has spearheaded a new paradigm for play-to-earn and NFTs,\" said Seokjun Kim, founder of ZERO X AND, in a press release. \"By leveraging the skills of our team members experienced in Web2 alongside Sky Mavis' Web3 expertise, we aim to cultivate a stronger gaming and blockchain community.\"\n\nBREAKING: RAGNAROK: MONSTER WORLD IS COMING TO RONIN Today is a glorious day. Welcome to the family, @ragmonnft ⚔️ Ragnarok is more than a game: it’s one of the most iconic gaming universes in the world. It’s a billion-dollar transmedia IP that has amassed over 68 million… pic.twitter.com/jcAoDAaVyg — Ronin (@Ronin_Network) April 17, 2024\n\nRonin was launched alongside Sky Mavis’ Axie Infinity game, and has since expanded to onboard games from third-party studios. The network recently saw a jump in activity around the debut of Pixels, a crypto farming game, plus it supports other games such as Apeiron and The Machines Arena.\n\nAD\n\nAD\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Andrew Hayward."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE0yb1JxTllQUkFUNWtoX2NtQ1VXT05DTmllUHlrV2FsQ2dnR2E4VHpJX1lUbTFFczBlNlRfSHZ0OTVvc2V6UzJteF9XbG5qYmNfLUpfQUFxRmgxVmpCUUdnRUZQalU5bUFONFRidHFIY1VZSWFZRXF6SGx2MXY0WWvSAYQBQVVfeXFMTzZZLTBuUnh5djJFa3FzdU5TdnZrZGhoaUswSmNIa1QyUElObG9BczhwRkVNMzRsYnNaWlNqdWpRQTJBQjRzbmpGVzRHUkxOOE5icU9HQ2VoZWRod3hEVm5lVFJtRV8tTHR1NUdteDZNV01MZ0ExbnFYTURNZTYyeWZEUXBU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price: ICO Whale Dumps ETH, A Further Dip Ahead? - CoinGape",
        "content": "The Ethereum price faces turbulence as it witnesses a decline of nearly 4% amid the broader crypto market fluctuations. Meanwhile, the recent dip in the ETH price has fuelled discussions in the crypto market, with investors speculating over the potential price movements in the coming days.\n\nNotably, the recent whale activities, especially from an ICO whale, have heightened speculations about Ethereum’s future trajectory, adding to investor concerns.\n\nadvertisement\n\nWhale Activities Sparks Concerns Over Ethereum Price\n\nThe Ethereum price has witnessed a notable decline over the last few days, especially after the U.S. SEC potentially delayed approving the Ethereum ETF approval. In addition, the investigation by the U.S. SEC over Ethereum’s security status has further dampened the investors’ sentiment.\n\nMeanwhile, amid the topsy-turvy scenario in the market, Spot On Chain, an on-chain data provider, revealed significant activity from an Ethereum ICO participant. This participant sold 2,000 ETH for 6 million USDC at $2,997, indicating a sizable offload of Ethereum assets.\n\nNotably, the whale, who initially acquired 33,213 ETH during Ethereum’s Genesis ICO in 2015, has already deposited 5,110 ETH to Kraken or sold via DEX at approximately $2,545. However, despite this sell-off, the whale still holds approximately 29.7K ETH, valued at $89.4 million, across three wallets, primarily within staking platforms.\n\nIn addition, Whale Alert reported additional Ethereum transactions suggestive of potential whale dumps. An unknown wallet transferred 10,806 ETH, worth $32.13 million, to the Coinbase exchange, while another whale moved 10,726 ETH, valued at around $31.90 million, to the same exchange.\n\nThese sizable transfers to the leading crypto exchange have intensified concerns among investors regarding increased volatility in Ethereum’s price trajectory. However, amid these worries, analysts are cautiously optimistic about a potential market resurgence, driven by anticipation surrounding the upcoming Bitcoin Halving event.\n\nAlso Read: Cardano’s Charles Hoskinson Believes RFK Jr Is The Best Presidential Candidate\n\nPrice Performance & Market Sentiment\n\nIn a noteworthy development, the recent approval of Bitcoin and Ethereum ETFs in Hong Kong has injected optimism into the market. This regulatory milestone has uplifted sentiment among market participants, offering a glimmer of hope amid the current market turbulence.\n\nWhile uncertainties loom over Ethereum’s short-term performance due to whale activities, the broader crypto market remains buoyed by positive developments such as regulatory approvals and anticipation of significant events like the Bitcoin Halving. It’s worth noting that several analysts have also warned about potential short-term volatility during the Halving event.\n\nMeanwhile, as of writing, the Ethereum price traded at $2,978.31, down 3.45% from yesterday, while its trading volume over the last 24 hours rose 10.77% to $18.58 billion. Notably, the Ethereum price has plunged over 16% over the last seven days, while noting a monthly decline of around 18%.\n\nAlso Read: Bitcoin’s L2 Merlin Chain Unleashes Half of MERL Airdrop Tokens at TGE\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNSVowTUdvYVFyZHdqM0FQZ1NKa2VOMm5VX09keDhSbk9PQklwYy1FczFReXh0ald5ZEZ3YzdXMlNYWU9HSzdXMmo0YTBOc09Sd2F3RGxVeFA4THR6R1kzTUdJZlJpTmw5NHUtMms1eFdkblVrODZKYUVIc3pHSlVwZkZQMXBldGxB0gGOAUFVX3lxTE5NcU5sdEtRMThFOFRPWUpxckJpY054YVA4ODZhR3FZYzZuNDM3YXdQemlYSFF3c3BIT1FoTUZhSS1abkVkYlgyN2tvSzdQYzNFd2VsM2Z5NDBoRFlsZS1qRlhaRVhfR2pCamlaeFEyME5IdHlHNWdVU3NiVTgwSnU0M2IzaGRPUkcwbU1nM3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "After $3K, can Ethereum’s price fall to $2000 next? - AMBCrypto News",
        "content": "ETH has corrected as much as 17% over the week, and could fall further below $2,400.\n\nThe market sentiment for ETH was neutral as of this writing.\n\nEthereum [ETH] dipped below $3,000 in the last 24 hours, following a 3.24% fall in its price, according to CoinMarketCap.\n\nThe second-largest cryptocurrency has corrected as much as 17% over the week, as bulls struggled to overcome the downward volatility in the broader market.\n\nHowever, market participants seem to be reacting differently to the ongoing slump, with some profit-taking on their investments while others accumulating ETH at lowered prices.\n\nTo buy or to sell?\n\nAccording to on-chain tracking data platform Lookonchain, a whale known for dip-buying, purchased 3,279 ETH, worth $9.75 million at prevailing prices, on Wednesday.\n\nThe influential investor has been doubling on their ETH investments lately, and held a whopping 86,457 ETH tokens as of the 17th of April.\n\nTo the contrary, a whale who was an active participant in the initial coin offering (ICO) in 2o15, sold 2,000 ETH at a selling price of $2,997, data from Spot On Chain showed.\n\nThe whale received 33,213 ETH as part of the ICO, at a price of $0.31. The latest sale, therefore, multiplied their returns by orders of magnitude.\n\nHow did the broader market react?\n\nTo better understand the market reaction to ETH’s slump, AMBCrypto examined Santiment’s whale metrics.\n\nNotably, the two whale cohorts — 1,000 to 10,000 and 100,000–1 million — increased in number over the week, suggesting that they were accumulating.\n\nHowever, the wallets holding between 10,000–100,000 ETH dropped in the same time, a sign of sell-offs.\n\nThe aforementioned indicators strengthened the “mixed” reaction narrative made earlier in the article.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nGauging ETH’s next moves\n\nThe Ethereum Fear and Greed Index alluded to the deductions made above to some extent. According to the last update, the market sentiment for ETH was neutral, with no clear bias towards buying and selling.\n\nAMBCrypto previously reported that ETH was at the risk of falling further to the $2,000 — $2,400 level."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNb3p5RmV0M0dyU0J2aFBuNGZtSmtTaENhVlBocG1EaTk0RDE1dmhNcDZoTnVWMkFRWXlMNFdUNTBhVlhhRVdvOFpmOThoMkJIaHRrT2JCcHBGaE1JTG1uc0JMRVU3TFF1cmtfRFQ1UUFEUnM0Z3p6ckxnZVk4NHlkYmNvQnFoaWlXVDFhRFJMNDJfcVVDNUJ0TEdfT0NQa2ZKdGZ3OEZjNjRFNG9GSkE0NC1qbi1iTnN2emR1Z1lkOGRNYjTSAcgBQVVfeXFMTU9vMERuU1JoZjl4bWpOSi1uNTNkVjBLcWVLTjdrZmlVUzFDc25UbHhGYVAyYlJSeXNfcnV1TzY5SUpvM2VETjl6LVVPVFh2cGNuVnpDcDJLTEJrel9ZeHdYRW9aN2FfSnl4ZE9qYVBZZEZWOURMMXJIbVR4ZDQ0Y2xOOU1NMUtzYnFJdTNOeEk4UlFJSmxFclB2cHpnOGdPRnJYdTZtZ3ljbWw4MmpGZU1qMWNwYWF1cFVDYVlRVzd1Sm1xYVF0QnU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Forget Ethereum: BlockDAG’s 30,000x Potential Draws Crowds with Its Video Trailer on The Moon - Crypto News Flash",
        "content": "Once an obscure investment, cryptocurrencies like Ethereum have turned ordinary backers into billionaires. Today, Investors are shifting their focus from Ethereum to BlockDAG, attracted by its potential for astronomical returns. BlockDAG’s presale events have already generated impressive numbers, with $17.8 Million raised from presale activities and an additional $2.1 million from miner sales. As Ethereum faces internal debates over its issuance curve, BlockDAG captures the investment community’s attention, promising a 30,000x return on investment through its innovative mineable network.\n\nEthereum’s Current Climate\n\nThe recent debates over Ethereum’s issuance curve have the community in an uproar. As Ethereum moves into its next upgrade phase, Electra, proposals to decrease issuance to preserve solo staker viability are hotly contested. Figures like Eric Conner and Ahmad Bitar oppose these changes, fearing they undermine Ethereum’s established role as a digital currency by responding excessively to unfounded centralisation worries. This division presents a crucial moment for Ethereum, reflecting broader uncertainties in the crypto market.\n\nThe community is divided amid the discussions around Ethereum’s proposed issuance curve adjustments. Proposals for reducing issuance to benefit solo stalkers face strong opposition from prominent developers who argue that these changes could undermine Ethereum’s utility as a decentralised currency. This controversy highlights the challenges of evolving a principal cryptocurrency while maintaining its foundational principles and community trust.\n\nBlockDAG To The Moon Over $17.8 Million In Presale\n\nBlockDAG stands out in the bustling crypto presale market, having already raised over $17.8 Million in presale and $2.1 Million in miner sales. Its upcoming keynote promises an exhilarating revelation with BDAG on the moon, sparking widespread excitement. The current Keynote video denotes a 100 Million market liquidity promise, prospects of Top exchange listings like KuCoin, CoinEx, Gate.io, and Bitget plus a $0.05 listing price a jump of over 4900% from its earlier batch, BlockDAG’s roadmap is impressively ambitious.\n\nAt the heart of BlockDAG’s appeal is its innovative approach to blockchain technology. According to their latest technical whitepaper, BlockDAG enables developers to build, deploy, and earn efficiently.\n\nThe platform supports many blockchain activities, from creating smart contracts using popular development tools to deploying applications on a testnet before launching them on the mainnet. Furthermore, the potential for developers to earn through transaction fees, subscriptions, and token sales makes BlockDAG an enticing ecosystem for blockchain innovators.\n\nMoreover, BlockDAG utilises Directed Acyclic Graph (DAG) technology, ensuring scalability and performance remain robust as the network expands. This technical foundation facilitates many business models and encourages continuous innovation and community engagement.\n\nThe End\n\nAs the crypto community seeks the next lucrative investment following Ethereum’s historic rise, BlockDAG offers a compelling case with its potential 30,000x ROI. As Ethereum contends with internal conflicts and the crypto community’s growing concerns, BlockDAG positions itself as the preferred alternative for savvy investors. With over $17.8 million in presale revenue and a vibrant community rallying around its innovative offerings, BlockDAG is poised to redefine the investment landscape.\n\nThis burgeoning platform offers a significant ROI and showcases a robust roadmap and technological prowess, promising a lucrative future for early adopters. Join the movement by visiting BlockDAG’s website and exploring investment opportunities in what could be the next breakthrough in the crypto space.\n\nJoin BlockDAG Presale Now:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNRHlMWlBQZko1aXU3NkJjQk9yQll1Q3daaWUtQm50cEZBUDVzV1lPNHc3elUtZkJ4RFY2MXNFNDBjX2ZlTV9UZ3ZRaXJ3TVlYWlZHeGFGc2pHMlh0X090X1AyQVpsb1Q5Vm11OU9Ca0ZRam5HdVZGY1k0VU85c0pLcmIwd0xBZ3AtRFcwTkVMSGkyRGR5NFBLOGkyWTJqNmxzdWlHd25iSThoUUw1X2N5bTY2R3pDZnlpNHBWTkIwRURCMGQ1cWRXaHFHTFBqRnIzUE5oRkFXa0c5bzDSAeABQVVfeXFMTmgxZFdCS3lfTU96UWozdW9HT092X1lONUxrZTVCOEliVkNMVU5DNGJxQUxQVjBTcXU4a2VoNk1uZll4TnJvQkNCb3RyRk9BNGVZel9JRmNtWlppRExPVWdMdTlBX29kc0VIVnhLdjJ0Y1RuY2s2YzhIaTJQRm90SjBFb016M2N1cUM4cmtXMm5JMmRzS0k2d2dJR1l2ekE0UDV3WnNQMDBQU3pWaEFRaXZmbXVQN0EyLXhISzVfWW16TWkzOG1lYk9UdHk0S2RDSEdTUEg0aFlBNFBocGJwTF8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Bitcoin, Ethereum & Chainlink — American Wrap 18 April - FXStreet",
        "content": "Chainlink $LINK a cryptocurrency and technology platform that enables non-blockchain enterprises to securely connect with blockchain platforms. It’s acting as a bridge between the real world and the crypto universe to facilitate the connection between the two. In today’s article, we’ll dive into the daily cycle taking place and explore the potential path based on the Elliott Wave Theory.\n\nBitcoin (BTC) price is borderline strong and weak with the brunt of the weakness being felt by altcoins. Regarding strength, it continues to close above the $60,000 threshold for seven weeks in a row.\n\nEthereum's (ETH) price continued a sideways movement on Thursday as the market still awaits a trigger. Ethereum isn't alone in this horizontal trend; several major index funds have also traded sideways, underscoring ETH's positive correlation with the traditional financial market.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPeXpPRDNmS29YUmpjVk5aT2lnNk9tYnNyNGRzU1YyQTRFcXNoY1ZMaTRaVmlVNlZWU1FJRFFMUll1SlRFQjVoOFhYOWJfclFfYXJoTlJ5Q0xJSmpickgySm9mY09VSVN5XzVrS1I0THlyZkxPeS14aUQ0VmhsU0VueGRPbGVYNUJWdHVJcUxkM3JYSFJzRjlaelpTT0NrRWU1YU5DNGVoVmZyM1Q3NjB2XzIwTVFaVDFvTkU3WUpqc3lFekl2ZlB2bG9TQlFWa3JwazBZeFU4bw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "MetaWin Announces Innovative TOKENIZED Tesla Cybertruck Contest on Ethereum's Base Layer 2 Blockchain - CryptoSlate",
        "content": "Chainwire MetaWin Announces Innovative TOKENIZED Tesla Cybertruck Contest on Ethereum’s Base Layer 2 Blockchain MetaWin launches the first tokenized Tesla Cybertruck NFT on Ethereum's Base Layer 2, offering a unique contest for blockchain enthusiasts. Chainwire · · 2 min read\n\nDisclaimer: This is a sponsored press release. Readers should conduct their own research prior to taking any actions related to the content mentioned in this article. Learn more ›\n\nLondon, UK, April 17th, 2024, Chainwire — In a pioneering move within the industry, MetaWin in collaboration with law firm BCLP, has successfully tokenized a Tesla Cybertruck, transforming it into a digital asset wrapped in a legally binding contract and minted as a Non-Fungible Token (NFT). This NFT, which represents full ownership rights to The Cybertruck, has been launched on the Ethereum Base Layer 2 blockchain operated by cryptocurrency giant Coinbase.\n\nThis contest marks a significant milestone as the world’s first tokenized vehicle asset, offering participants an opportunity to win a Cybertruck through a transparent, on-chain process. Entry into the competition is free and easily accessible via a Web3 wallet, with significantly reduced gas prices on the Base Layer 2 blockchain compared to Ethereum’s Main Net.\n\nRebecca Hanwell, Operations Manager at MetaWin, highlighted, “By leveraging the Ethereum Base Layer 2 blockchain, we not only minimize transaction costs but also ensure complete transparency and immediate transfer of ownership for every aspect of this contest – from entry registration to prize allocation.”\n\nParticipants can enhance their chances of winning by acquiring MetaWin NFTs directly from the platform. Each purchase includes complimentary entries, seamlessly registered on-chain at the time of purchase. At the conclusion of the competition, the winner can choose to have the Cybertruck delivered or opt for an alternative prize of $125,000 in USDC/T, if delivery is not feasible.\n\nThe Tesla Cybertruck, renowned for its unique design and celebrity endorsements, serves as an extraordinary prize. It remains under the stewardship of MetaWin, with its VIN number detailed in the NFT contract.\n\nRebecca Hanwell further noted, “The Cybertruck not only represents an exceptional vehicle but also embodies the technological innovation driving our vision at MetaWin. Hosting this contest on the blockchain ensures that every step of the process is as revolutionary as the prize itself.”\n\nThe competition is now open for entries, with the drawing scheduled for June 1, 2024. The winner will receive their prize promptly upon the contest’s conclusion, showcasing the efficiency and potential of blockchain technology in modernising traditional asset ownership. For more information and to participate in this extraordinary contest, visit MetaWin.com.\n\nAbout Metawin\n\nMetaWin is the premier platform for on-chain prize competitions and instant win games, offering a diverse range of entertaining challenges for users to enjoy. By harnessing cutting-edge blockchain technology, MetaWin provides a transparent, fair, and secure gaming environment, making it the go-to destination for blockchain enthusiasts and gamers alike.\n\nFollow us on social media:\n\nX| Instagram\n\nJoin our community:\n\nTelegram | Discord\n\nContact\n\nPR Team\n\nMetawin\n\n[email protected]\n\nShare"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQTDduRzJWM1pzVVhiblo5UlRHeFkyc2FyWFkwQVcweEFYTEVfT2lsYzNkcUtOWnVEc1ZKR2dpM2tLbUo1VUd3dVFsc29BT2hlUGVRa3ZRMEUwbl9DbGtnMDR6Yi1zM0NJS3ZKakpMaWJ2M2I3SFJvZThWMlJsRklaQ1dn0gGHAUFVX3lxTE1qb3llcVpaVDBuczRSVW9GVG9sNDN3clZ6dEMyenNieHpWMTJMb3BtcG8zRklnYlJWemhreDA4a0NmOHVCOEVkT0ljMFEtLS1fR1FSc2Q1bTlxaTA3YWR4NGUtOUt1UkhVRzYyZGhCV2MyeXVQOURFcU56TUctempUS01HS0RTYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "5,000 Ethereum transfer amid ETF buzz: What happens now? - AMBCrypto News",
        "content": "Ethereum whale sends 5,000 ETH to an exchange.\n\nSpot ETF approval is yet to impact the ETH price trend.\n\nAn Ethereum [ETH] whale recently transferred around $15 million worth of assets to an exchange. This action occurred shortly after news emerged of ETF approvals in Hong Kong.\n\nHas the whale’s transfer affected the price, and has the ETF approval also influenced the price?\n\nEthereum whale takes profit\n\nData from Lookonchain reveals that an Ethereum whale recently moved 5,000 ETH to the Kraken exchange, valuing over $15.4 million at the time of transfer.\n\nFurther analysis showed that the same whale withdrew 96,638 ETH from Coinbase back in September 2022. At this time, ETH was valued at around $1,567, bringing the value of the withdrawal to over $151.4 million.\n\nThis suggests that the recent transfer was likely made to realize profits, given ETH’s surge to over $3,000. Presently, the whale wallet holds 76,638 ETH, now valued at over $233.5 million.\n\nEthereum continues decline\n\nAn analysis of the Ethereum daily timeframe chart reveals a recent lack of profitability. Over the past three days, ETH has experienced a consistent downward trend following a 4% increase on the 14th of April.\n\nDespite these declines, it has retained the initial 4% gain from the beginning of the week.\n\nAs of the time of writing, ETH was trading at around $3,080, marking a decrease of less than 1%.\n\nFurthermore, these declines have intensified ETH’s bearish trend, evident from its Relative Strength Index (RSI) hovering around 40 and its Moving Average Convergence Divergence (MACD) indicating a trend below zero.\n\nThese metrics collectively indicate a strong bearish momentum for ETH, despite earlier positive news from Hong Kong earlier in the week.\n\nAs of press time, Ethereum’s netflow data indicated a trend of increased ETH leaving exchanges.\n\nHowever, by the end of trading on the 16th of April, there was a positive netflow, with 10,230 ETH flowing into exchanges. Nevertheless, as of press time, over 27,000 ETH outflows have been recorded.\n\nETF approval yet to impact the ETH price trend\n\nMultiple reports have stated that Hong Kong recently approved several spot Ethereum ETF proposals alongside spot Bitcoin ETF proposals.\n\nSurprisingly, the approval hasn’t stirred any notable reaction in the Ethereum price. This lack of response could be attributed to the absence of an official statement from the SEC regarding the approval.\n\nInvestors should be cautious about celebrating prematurely, considering the past occurrence of fake news regarding spot BTC ETF approvals.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nEven upon official confirmation, the impact on the market might be insignificant due to lower trading volumes.\n\nDifferent from the substantial ETF volumes witnessed in the United States for BTC, the volume anticipated from the Hong Kong market might not suffice to drive significant market movements."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQZEVESlZfLVp2Q2MzX29sV0d3clpBOXpIamliSnR0a0d5aGV0T1FVTHZJMDhQZUF2ek9tMzR1S3hYOWhFVWlLVjE0T0tqV1VfV2ZJcWt3VG1fWnIzQ3JuTTNyZ25JdUp3VVMzT0VyaWdJdGdsQ3lzR1JXREhhcmdlX2JqS0I1Y1FUaVp6Y3J3cnRnZ2xPQl9TcQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "You Might Be Surprised By the 2 Cryptos That Billionaire Mark Cuban Is Buying for His Portfolio - The Motley Fool",
        "content": "The search is on for cryptocurrencies with real-world utility.\n\nFor many investors, billionaire Mark Cuban may be best known as one of the investors on the popular ABC program Shark Tank. But for crypto enthusiasts, Cuban is best known as a champion of Bitcoin, Ethereum, and Dogecoin during the previous crypto bull market rally.\n\nSo what is Cuban buying during the recent crypto bull market? The names might surprise you. He's expanding beyond just the two big cryptocurrencies -- Bitcoin and Ethereum -- in search of utility coins that promise to deliver real-world use cases. Let's take a closer look at what he's adding to his portfolio.\n\nPolygon\n\nPolygon (MATIC -1.70%) is a Layer-2 scaling solution for Ethereum, helping it to run cheaper, faster, and more efficiently. You can think of Polygon as a secondary blockchain that sits on top of the core Ethereum blockchain. By doing so, it can mitigate some of the pricing and congestion issues typically faced by Ethereum users.\n\nThat's a clear example of utility, and it's easy to see why Cuban is all aboard the Polygon train. After Ethereum co-founder Vitalik Buterin laid out the blockchain's strategic roadmap for 2024, he made it a point to highlight the growing role played by Layer-2 scaling solutions. Right now, the future growth story for Ethereum is all about enabling these Layer-2 scaling solutions to do even more. So if Polygon can hitch its growth to that of Ethereum, it should be good news for investors.\n\nThe bad news, though, is that the Layer-2 blockchain niche has become especially crowded during the past 12 months. As a result, Polygon hasn't seen the types of price gains initially expected by investors. Around the time of Ethereum blockchain update knowns as The Merge in 2022, Polygon was trading near the $1 mark. But in the 18 months since, Polygon has dropped below $1 . It is currently trading for less than $0.70, and is down more than 30% for the year. Nonetheless, with a $6.6 billion market cap, it remains one of the top 20 most valuable cryptocurrencies in the world.\n\nInjective\n\nInjective (INJ 2.71%) is a Layer-1 blockchain that was purpose-built for decentralized finance (DeFi). In theory, core DeFi activities -- such as being able to create new DeFi lending protocols, or swapping tokens on decentralized exchanges -- should be faster, cheaper, and easier on Injective than on rival blockchains. In terms of utility, Injective is the blockchain you use if you want to build new financial applications or participate in DeFi.\n\nAnd, indeed, as measured by one important metric, total value locked (TVL), Injective is gaining ground in the DeFi world. In February, Injective set a record with more than $110 million in TVL, suggesting that more and more crypto users are embracing Injective as an on-ramp to DeFi. Right now, there are more than 100 projects on the Injective blockchain, and a reported 150,000 community members.\n\nBut, as with Polygon, the results just haven't been there this year for Injective. After soaring in price from $1.25 in January 2023 to over $50 in March 2024, Injective is now down about 35% year to date. With a $2.4 billion market cap, though, Injective still ranks as a top 50 crypto in terms of valuation.\n\nThe ongoing search for utility in crypto\n\nDuring a January AMA (\"Ask Me Anything\") on X (formerly known as Twitter), Cuban shared an important insight about investing in crypto: \"I hate the speculation but love when there is utility.\" Like many longtime crypto investors, he's seen the extreme volatility in the crypto market, and has warned against believing too much in the hype and speculation surrounding certain coins.\n\nTo mitigate some of that risk, one option is to focus on utility. If you don't understand what a crypto does, or what purpose it serves, it might just be that there is no purpose. If that's the case, then you probably shouldn't be adding it to your portfolio. Trying to chase a speculative meme coin may be fun, but it will rarely be profitable. There's no guarantee that you will be profitable with utility coins either, but understanding the core use cases of a crypto can help you make smarter long-term investment decisions."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPSm1wbmtqWmpfc2R6WE44OWotNXJDTkpnNmZKRkw5OWV1ZHM2dUM1bnRaazJHVlZjSFpCeE10VXFFc2dlYzBKUEhYTmZLdEVaMHhJa2F2MnRfZ2Fzd2IyMVlzeV84bnA5TTFyUUVycGJwU3VNZUZ1TExjSVNvVi1VTUV5M2RIX1dCdFhGS3VVRHhfQjBZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Pepe vs Shiba Inu: Which Ethereum Memecoin To Buy Before Halving? - CoinGape",
        "content": "As the crypto community prepares for the fourth Bitcoin halving on February 20, 2024, the question of which Ethereum-based meme coin—Pepe Coin or Shiba Inu—to invest in becomes a significant topic of discussion. Both tokens share some common traits such and dedicated community and meme-inspired origins, yet their market performance and technical indicators set them apart in terms of their potential as an investment before the halving. In this article we share insights to empower you in making investment decisions, between PEPE and Shiba Inu.\n\nPEPE vs Shiba Inu: Price Market Performance\n\nPepe and Shiba Inu are two popular digital currencies that have attracted a lot of interest in the cryptocurrency market. Despite their similarities as memecoins, they exhibit differences in their price market performance and metrics.\n\nadvertisement\n\nAccording to CoinMarketCap data, SHIB boasts of a market cap of $13.23 billion, earning its position as the 12th largest cryptocurrency by market cap. In contracts, PEPE has a market capitalization of $2.23 billion, securing the 47th position, among the top 50 cryptocurrencies. This shows that Shiba Inu has a significantly greater market presence than PEPE.\n\nPEPE saw a 4.21% rise in price daily and a 24.87% increase weekly, yet encountered a significant 31.33% decline in the past month. On the other hand, Shiba Inu experienced a less significant daily gain of 2.87% and a monthly decline of 10%. SHIB’s weekly decrease was also 18.86%. This implies that although PEPE has faced substantial short-term fluctuations, its long-term results have been more inconsistent.\n\nWhen it comes to daily and weekly performance, Pepe coin experienced an increase of 4.21% in its value over the last week, and a 31.33% drop in the past month. On the other hand, Shiba Inu tokens recorded a slight gain of 2.87%, although it experienced losses of 18.86% and 10% over the past week and month respectively. This implies that although PEPE has faced substantial short-term fluctuations, its long-term results have been more inconsistent.\n\nIn terms of volume, both tokens have been actively traded in the market. PEPE had a trading volume of $722.3 million over a 24-hour period, whereas Shiba Inu’s volume was higher at $846.18 million. PEPE has a volume-to-market cap ratio of 32.53%, showing a greater level of trading compared to its market cap. SHIB’s ratio sits at 6.43%, indicating decreased trading activity in relation to its market cap.\n\nPEPE achieved its all-time high of $0.00001074 just slightly over a month ago, on March 14, 2024, but has since dropped in value by 50.68% to its current price of $0.000005293. On the other hand, Shiba Inu price reached its all-time high of $0.00008845 two years ago, in October 2021, and likewise, it has witnessed a dropped of approximately 74.67% to record $0.00002246.\n\nPEPE vs Shiba Inu: Price Forecast\n\nIn comparing the technical analysis of Pepe Coin and Shiba Inu, we observe distinct trends and patterns in terms of moving averages, oscillators, MACD, RSI, and Fibonacci support and resistance levels.\n\nBeginning with the moving averages, both Pepe Coin and Shiba Inu are showing decreasing patterns in their short-term signals. The 10-day exponential moving average (EMA) for Pepe Coin is 0.000005928279, while the simple moving average (SMA) is 0.000006150416. Shiba Inu has a 10-day EMA of 0.00002415 and an SMA of 0.00002476. Both sets of data indicate a bearish signal since the current prices fall below the short-term averages. In addition, the 100-day and 200-day EMAs and SMAs suggest a possible change in trend, with Pepe Coin displaying a more robust buy signal than Shiba Inu.\n\nRegarding oscillators, both cryptocurrencies present a neutral outlook. The Relative Strength Index (RSI) of PEPE stands at 40.21, while Shiba Inu’s RSI rests at 39.99. This shows that both coins are not experiencing any overbought or oversold conditions.\n\nLooking at MACD analysis, both the Ethereum meme coins indicate ‘sell’. SHIB exhibits a MACD level of -0.00000126, while PEPE’s MACD level is at -0.000000471995. This indicates a potential downward trend coming soon for both coins.\n\nWith regards to Fibonacci levels, should the price of Pepe Coin drop, it will find a strong support level at 0.000007435425, and Shiba Inu will find its support level 0.00002964 should its price drop. Both cryptocurrencies have various levels of support and resistance, but Pepe Coin is closer to its support levels, indicating potential price volatility. Shiba Inu, on the other hand, seems to have more distant support levels, which could imply greater stability in its price movements.\n\nWhich Ethereum Meme Coin Should you Buy?\n\nPepe Coin and Shiba Inu both provide distinct investment opportunities, but they appeal to varying levels of risk tolerance. Pepe Coin’s potential for future expansion makes it an appealing option for individuals looking for greater returns despite the increased risk involved. The market presence and stability of the Shiba Inu coin could attract investors looking for a safer and more consistent choice. In the end, choosing between Pepe Coin and Shiba Inu will be determined by personal investment objectives and willingness to take risks as the halving event nears."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPS1F5ajZmSV9QVHo0dWRkSUdIbmN5YVk4S0E0TkIzNllva0MwMEtvSVdQSHFteFNmVURfN191SEZCekZnSnhVWjRBWURkbVVDV1dLbjZCbHRnX0VLaEZUd2lBXzNkd2JIbURBSldYc05oaWN4SE90R1lodjEwWTAybGw5cG0ySV9iVHFv0gGQAUFVX3lxTE1aY254c2lqQ0RibEl0UVB1c3RwOEJ0dWx0UWtmRElvSDZheF9nRTVQUXZ0LXNaZWlqZmFqY1B4X2FPTEZsaV9CZ2U1clJtWVVORWlIVkxCVFZTWEM5WXhQWDNoLWU5dWpaZlZqdG5uSUJIOVo4Y0Z6d3F0MkJfdTMxLXhCNUZ1V1RDOUs3am85Rg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Solana vs Ethereum again: ‘Small blocker argument’ returns - AMBCrypto News",
        "content": "Ethereum’s disregard of L1s raises questions once again.\n\nLayer 2 security concerns challenge Ethereum’s decentralization commitment.\n\nAmidst the ongoing crypto bloodbath, Ethereum [ETH], the leading altcoin, mirrors Bitcoin’s [BTC] downward trajectory, with its daily and weekly charts awash in red.\n\nWhile it records a modest 3% dip in one day, the past week has seen more significant losses, with double-digit declines exceeding 16%.\n\nHowever, amidst these volatile swings, an unexpected question arises: Does Ethereum’s architecture hold the top spot?\n\nConcerns surrounding ETH’s architecture?\n\nIn a recent article, David Hoffman, co-owner at Bankless, highlighting the lasting impact of the Bitcoin block size wars on today’s crypto community said,\n\n“A lot of people’s arguments about how you should build crypto or what crypto should look like can be characterized as like a big blocker or a small blocker argument.”\n\nInterestingly, outlining the modern-day scenario he added,\n\n“Solana is the big blocker and Ethereum is the small blocker.”\n\nThis underscores the ongoing debate wherein Solana [SOL] advocates for L1 scalability, aiming for instant, free transactions. While Ethereum prioritizes L1 decentralization, emphasizing L2 scaling.\n\nFurthermore, delving into the concept of block complexity, comparing blockchains with and without a virtual machine, Hoffman said,\n\n“All chains before Ethereum were missing this key element, and instead tried to add functionality as individual op-codes, rather than a fully expressive virtual machine.”\n\nAdditionally, reiterating the importance of finding a balance between scalability and decentralization, Vitalik Buterin, in his 2019 article noted,\n\n“Keep layer 1 simple, make up for it on layer 2″ is NOT a universal answer to blockchain scalability and functionality problems.”\n\nButerin said this because this approach fails to consider that L1 blockchains themselves must have a sufficient level of scalability and functionality for this ‘building on top’ to be possible”.\n\nWhat’s more to it?\n\nNeedless to say, this has resulted in ETH becoming less affordable for individual users but more suitable for entities like chains, exchanges, and funds.\n\nRemarking on the same, @RyanSAdams highlighted,\n\n“’Ethereum is too expensive’ is a really bad take.”\n\nAdditionally, comparing Ethereum L2 solutions with the Cosmos chains, Sam Hart noted,\n\n“Cosmos isn’t a technology or an ecosystem, it’s the choice to build a sovereign application that seeks to interoperate with others.”\n\nIn fact, recent allegations of top Layer 2 solutions potentially mishandling user funds have raised doubts about Ethereum’s commitment to decentralization, echoing concerns voiced by Justin Bons,\n\n“ETH gives decentralization lip service, but actions speak louder than words.”\n\nAll this brings forth a question: Does Ethereum’s architecture need a revamp?"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNc2J1Q3pjSEVGSE9MZG9tNXRhMjJlY19xTUFuTzN1QUY3bGlucDlNc0YydVlpU3JDV2YyNnZfSUhEcjRsRnZYSjQtVGUzRUQ4Zm1VTmdERHkyMThmcWljajlzMEdEeUlTeGxpVGJ3YlY2dk8teTlhWXV2Rmt3M292WFlmaDZfUDdNUXpSeGVlQTVhUdIBlwFBVV95cUxOZ2c3aGtzSkJUTnpNUXJLVkIwOUxhWGNENENxSHpNaWR1a2I0elFuaXhwMGI4cXpGWkx0WmNzNWJKM0p0c2FEUW1NaWhac2hZMklPV2hRMWwtTkNCODNyUnNQaEdjLUtVNkZpX29uamhLN0lja1h1dGpNR2I0T1VYTXJ2ckUzUHdieENXd2Y4M2JKUFRaUEhV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "‘Dogecoin purer than Ethereum:’ Elon Musk, execs react to Top 10 move - AMBCrypto News",
        "content": "DOGE surges 4% with Elon Musk tweet amid memecoin frenzy.\n\nDeFi regulations could boost DOGE, paving the path to ETF eligibility.\n\nIn light of the recent crypto bloodbath stirring the crypto market, Dogecoin [DOGE] was amongst a few altcoins that spiked a little amidst the market crash.\n\nThe dog-themed cryptocurrency saw a slight uptick of over 4% in its price following a recent tweet from Elon Musk.\n\nThe memecoin craze\n\nRecently, Musk humorously compared mainstream media to characters from “Monty Python’s Life of Brian,” who have been struggling to report on Dogecoin’s rise amongst the top cryptocurrencies.\n\nThis playful portrayal highlighted the nature of Dogecoin’s success and the influence of social media culture on financial markets.\n\nAs the market turns on the path to recovery, social media is abuzz with memecoin mania, as highlighted by @ApeCryptos in his recent X post,\n\n“U Can’t Stop #Meme Coins.”\n\nShedding light on the regulatory actions against DeFi projects, Will Clemente, co-founder of Reflexivity Research in conversation with Laura Shin, host of “Unchained” podcast, saw this as a potential benefit for meme coins.\n\nHe said,\n\n“I think the one that has the highest likelihood could actually be Dogecoin because it’s a commodity right? I mean I would argue that it’s a much purer commodity profile than like Ethereum.”\n\nClemente believes that if DeFi projects face shutdowns or regulatory hurdles, investors might turn to meme coins as an alternative investment option.\n\nAdditionally, he outlines that the regulatory environment could pave the way for meme coins to gain traction and potentially become eligible for inclusion in cryptocurrency ETFs.\n\nWhat lies ahead for DOGE?\n\nNotably, Even though DOGE has seen losses recently, there are still many holders who refuse to waver.\n\nOn-chain data reveals a notable 18% decline in value over the past week, yet Dogecoin’s long-term investors stand strong while navigating the market with resilience.\n\nMoreover, insights from IntoTheBlock reveal that a staggering 81% of DOGE wallet addresses are still basking in profitability, even amid the recent downward spiral.\n\nEchoing similar sentiments, Crypto Daily Trade Signals, added,\n\n“#Dogecoin will do this soon $1 #Doge coming faster than you think!!”\n\nErgo, despite DOGE currently treading water in its consolidation phase, its potential to shift market sentiments from bearish to bullish remains positive."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxObVV3czJsZWF4T3BYbWlZLXp0bEJpUXZFWEVMYTR1bUpSYXJQLXh2SmdGaml2VzJ6UXc2akdWUklPY2pMLTVsWFNGZnU1OHpkUWlPdUlESUJqNXRBOGlIdVBDdGthYTFMaXdqREFKVU8wYm0tRER6cmdTRGtacFJRU3EwMGNxZDFwMTdqdHBfRXdEY3UwSlHSAZsBQVVfeXFMTlByREF3cVBnd0Z6R2hGNWNxQ2NGdmhVRTBuc3J4WUZ0bFdJczBqYnh0ZV93NVBGampwOWJNTVloSW5vQ0R2ckpUUVpIZmZnX3RmUFc3cjFXSzdMUUxVdmRyd2Q2cmE3bHJFeENycUd4VEZLS1FLNjBBQ082ZE9CN21BWlo0U21RaGFTRU1mMGpLd2QwemV1SEEyUUU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "‘Ethereum L2s can steal user funds right now’ – Are the allegations true? - AMBCrypto News",
        "content": "Exec claims Ethereum L2s can “steal user funds.”\n\nIndustry figures propose multi-signatories to eliminate single points of failure.\n\nIn a surprising disclosure, it has been revealed that the safety of user funds in Ethereum [ETH] L2s is not guaranteed.\n\nAccording to founder and CIO of crypto-focused Cyber Capital, Justin Bons, L2s like Arbitrum [ARB], Optimism [OP], Base, Blast, Starknet [STRK], and ZkSync can all “steal user funds.”\n\n“Arbitrum, Optimism, Base, Blast, Starknet & ZkSync all have admin keys! All of the top L2s can steal all user funds right now.”\n\nThis is even more disturbing because, according to VanEck analysis, the space is projected to reach a $1T value by 2030.\n\nThe exec compared the current state of L2s to legacy banking and took a swipe at Ethereum for being a “lip service” to decentralization.\n\n“If this is considered safe, then we might as well go back to legacy banking. ETH gives decentralization lip service, but actions speak louder than word”\n\nReaction to safety concerns in Ethereum L2s\n\nSolana [SOL] co-founder Anatoly Yakovenko suggested a “multi-sig” shared sequencer as a solution to the “single admin key.” He stated,\n\n“Each one should volunteer a tribute to be a member of the multi-sig for the shared sequencer.”\n\nMulti-sig means having multiple signatories to increase decentralization, transparency, and eliminate the risk of a “single admin key.”\n\nRaj Gokal, another Solana co-founder, called for an expedited solution,\n\n“Hope this gets fixed soon…”\n\nHowever, the founder and CEO of Helius Labs, a Solana developer platform, vouched for Ethereum [ETH] L2s and preferred them over Binance [BNB], Cardano [ADA], or Ripple [XRP].\n\nHe reiterated,\n\n“Fine, I’ll say something positive about L2s: I’d be much happier if they were in the top 10 instead of Cardano, XRP, and BNB.”\n\nAsked whether Solana should consider some L2s as well, the Helius Labs’ exec quipped,\n\n“Could make sense in some cases.”\n\nA recent AMBcrypto analysis established increased transactions within L2s post-Dencun upgrade, which could tip ETH’s value.\n\nHowever, ETH faced key headwinds, including the SEC’s silence on spot ETFs and ongoing Middle East tensions. At the time of writing, it was barely holding above $3K."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPRzZQOFRlS0N3MTFkYVBPNWt4YlF2Wi1GMktzYnFjQnpyOHlVbGg0SWdOUEE2WFU2LVlRVW4ySGt1WXFsb1RRRlk5WFdYeUFqTUhGMFBlbWNwZjJEOWctNnJxTEdUamZuTEFsTFEyaExIX1AzdUZST19RaVo0WkVfOXRtMFRTemJtWVdiM2hXa2lXMDBpOEpyTUxnMHpFLXo1YWdF0gGoAUFVX3lxTFAtam1Ick9VWEstS01UVVEyVzl1ejJNakYwOVAzRlVYRlgxQjNtRG9TT1k3UjNKNzhEbG1YZWdpT0wwNlFKRkxINGRXdmpBZk4yTm1DUF9GcFdmYTlWRGp1M3NqeGg3cW12TWtHSkQtSkl5ei1pRmhsbXBJNHpKNjI2SWV0UHhfM05kd21hX3hCZWJMbWh2ZXIxQjVJa2JCOVlhZTNsbXRoUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Crypto Prices Today April 17: Bitcoin At $64K, Ethereum Above $3100, SOL & XRP Recover - CoinGape",
        "content": "The top crypto prices today registered a rebound as the Bitcoin (BTC) price traded below the $64,000 level. In addition, the Ethereum (ETH) price soared past the $3,100 mark. Meanwhile, other top altcoins, such as Cardano (ADA), Solana (SOL) and XRP rebounded notably.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price was up by 2.99% reaching $64,209.56 at the time of writing on Wednesday, April 17. On the other hand, it’s trading volume slumped 8.94% to $40.08 billion in the last 24 hours. Whilst, the crypto held a market capitalization of $1.26 trillion.\n\nadvertisement\n\nIn the altcoin arena, the Ethereum price gained 3.04% to $3,115.86 at press time with a market valuation of $374.12 billion. Whilst, ETH saw its trading volume plummet by 21.31%, reaching $17.64 billion. Meanwhile, the Binance Coin (BNB) price was up by 1.51%, reaching $546.11. On the contrary, its 24-hour trade slipped 16.93% to $1.26 billion.\n\nThe Solana price sustained above the $140 mark today. The Solana price surged by 7.76%, settling at $142.59. In addition, SOL witnessed a 13.46% slump in trade volume to $4.94 billion in the last 24 hours. Whilst, the XRP price hit the $0.50 mark again. The XRP price recorded a gain of 3.69%, reaching $0.5001. On the other hand, XRP’s trading volume plummeted 29.14% to $1.71 billion.\n\nMeanwhile, the Cardano price was up by 2.25% to $0.4636 today. Whilst, ADA recorded a decline of 31.53% in its 24-hour trading volume, settling at $484.74 million. As the top crypto prices recovered from losses, the popular meme coins followed suit. The Dogecoin price rose 3.45% to $0.158 while its rival, Shiba Inu price rallied by 8.21% and traded at $0.00002283.\n\nAlso Read: Bitcoin Price Drops as Powell Signals Delay in Interest Rate Cuts\n\nTop Crypto Prices Today Are\n\nPepe Coin (PEPE)\n\nThe Pepe Coin (PEPE) crypto, a Solana meme coin, rebounded significantly today. At press time, the Pepe Coin price was up by 12.10% to $0.000005416 with a market valuation of $2.28 billion. In contrast, the 24-hour trade volume for PEPE slumped by 17.97% to $732.55 million.\n\nCelestia Soars 11%\n\nCelestia (TIA), a trending crypto, registered an phenomenal rally of nearly 11% and ranked the top crypto gainer today. The Celestia price was up by 10.98% to $10.99 at the time of reporting. Moreover, its trade volume spiked 21.22% and stood at $292.78 million. Furthermore, the TIA crypto attained a high of $11.56 amid the rally today.\n\nAlso Read: Solana Mining Protocol Ore Pauses Operations Due To Congestion\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQMW9weS1wNTNzdllCb1Nrd18zazhJRl9vRldiMkxuUXRnbGlzZnUweWpXWldYYVkzTzZmWWVZM2tCOE9DV2dUV3BZRHI5WFhab1VlWFZFam1MOEZYTURDRVlBcnliQ285T0JTQ2lTUHZTZ25tSkFsTEtiREIzNVZDSnBQekUwamRKRmczaGx6bFc2NWRQbmtlWTB4aFR2RklwUXd3aGZGVW9wRklaOTlqWE1YMkTSAbwBQVVfeXFMTkROMTIzSG0ydzAxTmRnLTU3NWU0Zm5ic2M4SE5fdEVadjZnWTdLQjBhMGs2UzlBT25XZ0ZvOE9nVWM5cFlsSTNBSENtSWZCb0pDcVVjd28yZ3lwcE1LdktVdmxWZFhSWjJ0aHQtQTJlWDQxYUFYZGd1Ny1RYmVKcFNRcm1XZnFDMHhVdHVzUjM4dk5CeEFjTlctSGpDNWRQWnhnRTVpS19rVm56SEt3TjRmOFFQc2tmNmNyQzc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Worldcoin (WLD) Makes Waves: World Chain Set to Debut as Ethereum Layer 2 Solution - Crypto News Flash",
        "content": "Worldcoin is launching World Chain as a Layer 2 solution on Ethereum to enhance transaction efficiency and cater to a growing user base.\n\nIncorporates Proof of Personhood for secure and private user verification, offering incentives like WLD tokens for verified identities.\n\nWorldcoin is poised to unveil its Ethereum-based Layer-2 solution, known as World Chain, this summer. Created by Worldcoin Foundation, this platform is designed to prioritize real human users over bots by offering them priority in block space allocation and complimentary gas allowances. This innovation not only bolsters the Worldcoin ecosystem but significantly enhances transaction speed, cost-effectiveness, and reliability for its users.\n\nAs I shared in my recent tweet, Worldcoin, envisioned by OpenAI CEO Sam Altman, is gearing up for the summer launch of World Chain. This platform is set to enhance scalability within the Superchain ecosystem and will operate under the security framework provided by its role as an Ethereum Layer 2 solution.\n\n#Worldcoin, the brainchild of# OpenAI CEO Sam Altman, is gearing up to unveil World Chain this summer! 🌍🔗 This innovative project is set to be safeguarded by #Ethereum as an L2 solution and designed for scalability within the Superchain ecosystem. It's going to be… pic.twitter.com/9lZ7cw4JZ8 — Marcel Knobloch aka Collin Brown (@CollinBrownXRP) April 17, 2024\n\nThis initiative emphasizes Worldcoin’s commitment to open-source development and its ambition for community-led governance in the future.\n\nEnhancing User Experience with World ID\n\nAccording to a recent YouTube video from CNF, World Chain will further integrate with World ID’s Proof of Personhood, which uses iris scans to verify individual identities, subsequently rewarding verified users with WLD tokens. Amidst increasing regulatory scrutiny, Worldcoin is also enhancing privacy protections. These enhancements include more robust personal data management options and the implementation of zero-knowledge proofs to ensure network integrity without compromising privacy.\n\nScaling and Interoperability Advancements\n\nAs highlighted in a recent TradingView post, World Chain is engineered to expand capacity and streamline transactions, reducing congestion and lowering transaction costs. The integration of World ID allows users to anonymously prove their identity, securing priority processing and even complimentary gas.\n\nIn alignment with a recent CNF post, Worldcoin has introduced an “unverify” function aimed at giving users greater control over their personal data. This feature, which was developed in response to heightened regulatory scrutiny, allows users to manage their data privacy proactively. Despite these changes, Worldcoin (WLD) has managed to maintain a stable market position.\n\nFurthermore, the blockchain community, including the Optimism team, has expressed enthusiasm for the introduction of World Chain. Notably, Coinbase’s Layer 2 network, Base, also utilizes the OP Stack, underscoring the growing acceptance and implementation of these advanced scaling solutions within the broader blockchain ecosystem.\n\nThe project’s success could serve as a pivotal moment for Ethereum’s Layer 2 solutions and their role in broader blockchain adoption. Current trading data shows Worldcoin (WLD) at $4.83, marking a 3.73% decrease over the past day and a 27.30% drop over the last week, reflecting the volatile nature of cryptocurrency markets.\n\nNo coins selected\n\nRecommended for you:\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQNm8yNGQ2Rko3ZkNDMmc2aDFmN190OVhXcmRsTU16aW5Iek95cTFadlN2c0N5VWNka05vZ2VWZjFkaHJ2c3BocUF4UFA2b0hJRWo5Ul9FUWhoMHhvbGZodHNiV3hra2l1dDJFU182OFJQdVNkaTBxWFpGUWxlUEw0UUk2TWZGb3dzQ1VVM3h0RE56Y3ltcE5taktyR1JYVFFLMkJHaHlGaEdaTDZZMGp0RTVPQlZ0UE9UQkVNVVU1dTZORVlHelHSAdMBQVVfeXFMTS1xemJkVUpJaFNFNHN1blNtMzNoT0VjRGozeHZDbm9OVWZ0d3JvVXNVNTBBclhid2dVTnJfZmV4VE5BS0IxeFVlUVRlSEtTTHl0eEM4d185dW9wV280UU9CTFRNazBZS2NXRTFDS3RUV0gyV0llajZmcVNzcnVZWmtYVlhuX25xWjN0VlpRclllaGJBaTJfTDZzRTVHVlNNOWx5T1J3VFdlbVVod25SZGFxaG8tRC1MTy1uWnhhYS0yLWFMdGIzUDNHbFdvM19SNEJrcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Loses Crucial Support at $3K – How Low Can ETH Go? - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNVmRUUU1uS0NudTJIb0hlUlI1QUdJMV84bTd1dVpYLV8tek5COTRkcGFTanpBSllqUHI4MkFoZ2tpWEc3YWVObjlWV0NHeUFMVF9pMHU3MDN1QUZkeFdCRDJybW0zY2lQd011Y1N1VmpnS0lkSWd0Vko5elFVNDJMNDlvaWlDWUxLWk95bdIBkgFBVV95cUxQdjhGdXk0U1RILWVGZGdvcF9nX0dGS1c5akVSRUhJelE5bl9MZzJVN0NDT3hSZldMQlNKRVM3d2x2c3RaQ2NRQzFDSG55NDBpbWdQRkxjNGI2Sk8zOWtEZ1dSWU5ESW54TTBwUnNDTDlYWkY5cU85SEdvZGNkcnQ0dFRCRGRJLXhLcU5JX0pqc3VkZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Breaking: Worldcoin (WLD) To Launch World Chain As L2 on Ethereum - CoinGape",
        "content": "Sam Altman’s Worldcoin is looking to launch its Layer-2 blockchain dubbed World Chain, to improve its efficiency as it continues to onboards new users.\n\nWorld Chain to Improve Worldcoin Efficiency\n\nThe upcoming project was announced by Tools for Humanity, the core developer behind the Worldcoin project. According to the company, World Chain will be secured by the Ethereum network and only “verified” humans will be allowed to “enjoy priority blockspace over bots and some free gas.”\n\nadvertisement\n\nWith this new blockchain, developers can reach millions of real users around the world, with applications that are focused on utility for everyday life. Markedly, the team behind the tool is working to officially release it this summer.\n\nPer a published statement, World Chain is designed to “increase capacity so new people can continue to join at scale, and existing users can enjoy faster, cheaper, and more reliable transactions.”\n\nFor this blockchain to accelerate growth and leverage World ID’s Proof of Personhood, World Chain will have deep integration with the Worldcoin project that is currently under Altman’s watch. Noteworthy, the popular Worldcoin project assigns World IDs to people who must have proven that they are human through an iris scan called Orb verification.\n\nPeople who sign up for this service are given cryptocurrency in the form of WLD tokens. The official website of the project shows that over 5 million people have signed up for Worldcoin. The Worldcoin project was launched to help the internet tell humans apart from non-human actors.\n\nWorldcoin Addresses Global Regulatory Concerns\n\nThe launch of the L2 on Ethereum comes as the company faces global regulatory challenges. Last month, the global digital identity and cryptocurrency initiative had to address its legal standing and compliance. Worldcoin went as far as shedding light on its operational, regulatory, and compliance status in different service regions.\n\nDue to this mounting global pressure, the company announced the implementation of additional privacy features. The new package revolves around Personal Custody and introduces a new Unverify World ID option. Also, the feature leverages cutting-edge technology like zero-knowledge proofs (ZKPs).\n\nThis will give users greater control over their personal information while maintaining the integrity of the network. Noteworthy, this is one strategy that demonstrates Worldcoin’s commitment to ensuring users’ privacy.\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQMjI5YWFwbXVGdmg3eWhmZ2MwTVJ1enBPN3E5NjNTUElzdk9YakRYUUt3OUV0ZmJ1Smo1LS1pM24zZVQ1T0tvOWlvdWZwM1IxRzg0dzRBd1g4RnZxdjJ3WmphNTF3c0R1TmVZcHp4Mksza21Ia1A0Z1hzcG9obkFIMktfaU9jVnowRDZLYnRESk5XeTlkcHFnRUNCZUpTWUhfYlFoOXBHaGVaT1FqVlJJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum, Solana, and Other Notable Blockchains Endorse a Massive Airdrop - Cointribune EN",
        "content": "Thu 18 Apr 2024 ▪ 3 min read ▪ by Mikaia A.\n\nThe Saga team is weaving a bold plan to dazzle cryptocurrency enthusiasts. Indeed, they are gearing up to launch an airdrop campaign, promising an abundance of eponymous tokens and NFTs. But that’s not all. Heavyweights such as Ethereum, Avalanche, and Polygon stand ready to applaud this generous venture. Stay tuned to not miss out on the bounty this benefactor is about to unleash.\n\nSaga launches a massive crypto airdrop campaign: Power-Level Over 9000!\n\nBeware, do not be fooled by appearances. This Saga in question should not be confused with Solana’s Saga smartphone, that technological gem whose value on eBay surpasses that of the iPhone 15 Pro. No, it is rather a layer 1 blockchain, bringing a ray of hope to the dark universe of cryptocurrencies. Get ready, the Saga saga is just beginning.\n\nThe spotlight is on Saga, the layer 1 blockchain shaking up the gaming world. Their latest announcement? An airdrop campaign so massive that they’ve named it: Power-Level Over 9000! A subtle nod to “Dragon Ball Z,” which now stands as a symbol of the phenomenal magnitude of this initiative, according to Decrypt.\n\nIn partnership with over 100 projects and games, Saga promises epic rewards to those who stake their precious SAGA cryptos. The winners will receive batches of tokens and NFTs to be distributed in the coming months, according to the announcement.\n\n« At Saga, we are immensely proud to promote collaboration and unity within the Web3 gaming community. With partners from various ecosystems, including Ethereum, Solana, Cosmos, Polygon, and Avalance, our airdrop campaign serves as a testament to our unwavering commitment to bringing together the Web3 gaming community. »\n\nEach airdrop is a treasure in itself, offering a variety of prizes from several partner crypto projects. Gaming heavyweights such as Avalanche’s Shrapnel, Ethereum’s The Sandbox, and Ethereum’s Wilder World are already on the list, with more expected to be revealed in the coming days.\n\nA network in full boil\n\nSaga, a layer 1 network, is ushering in a universe where developers deploy their own chains, dubbed “chainlets”. This innovative concept supports an internal dynamic of support among chainlets within the Saga ecosystem.\n\nRenowned for its prolific airdrop campaigns, Saga has set records with 13.4 billion dollars staked on Binance to get SAGA cryptos. Its recent listing on the largest crypto exchange, coupled with its mainnet launch, marks a major milestone for the platform.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOUVFwbG81Rkd0c0dIaVRDRFZiVVpySGxFb3JrOHI1Q2FOb1dGRDI0NG5OanBVYVI3cnYyTE9ObUxsV0pVTjNXbFBNRWFpY3Q5U1dDeW9YVVdGM0JnQkg3eUVCNmxnX3ZhU3hwaFFSMjRnSzE1RXFNT1pUMGxRbi1Rdk4xRTFVUExwMGdYZGI5UWJUaUpmQTc4R3owVlhOd3FsNURvSUpNSTRwQdIBrwFBVV95cUxNck5PdHVZazYzbWtIeWh4M0Jpc2NpSV9nNFZhLVBZWUhXREZaM3ltTVMzRFBGNXNlUU95bHBDWUZELU4wYllpMEFQcTQtRE51eU9OdDFBMlpRTVRFbGw0ZTdRTkJVQ0VYTWR6d3JCTnh1REllWVpRd2U1bVJhaS1JQ2IwRDdrS2Z1TWNHVnpCUmVidk9qaFc4Y3RVSEhhZUhzOXhvZWE2Tnh2SnFNX0E4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum in Eye of Storm? - Action Forex",
        "content": "Market picture\n\nThe crypto market avoided sharp moves on Tuesday, showing low volatility over the 24 hours and remaining near $2.3 trillion. The Crypto Fear and Greed Index added 2 points to 67 (greed) by Wednesday.\n\nBitcoin’s share of the entire crypto market capitalisation exceeded 54%, maintaining its upward trend since December 2022. This is the clear impact of the Bitcoin-ETF, but we also note the diminishing enthusiasm for altcoins.\n\nThe technical picture for Bitcoin is rather worrying, as we saw no rebound after the price drop on Friday and Saturday. On the contrary, the market seems to be getting used to current prices in anticipation of a halving.\n\nSimilarly, Ethereum sold off powerfully at the end of last week from the 50-day MA. Now, the second largest cryptocurrency holds near the psychologically significant $3000 level.\n\nThe pattern of cryptocurrency behaviour this week indicates that we are more likely to be in the eye of the storm, i.e. a temporary lull between violent gusts of wind. If this prediction is correct, Bitcoin could fall towards $52-55K, and Ethereum – to $2500.\n\nNews background\n\nThe crypto market is “halfway to bitcoin euphoria,” according to CryptoQuant. New bitcoin miners, who have held their assets for less than 155 days, hold up to 9% of the circulating BTC volume and continue to build up inventories in anticipation of rising prices. The imbalance between BTC supply and demand will increase over the next six months, potentially driving prices higher.\n\nHong Kong-listed cryptocurrency ETFs will be “lucky” if they manage to raise $500 million in aggregate, Bloomberg said. The agency called Matrixport’s projected $25bn “insane”.\n\nAccording to CoinGecko, there are more than 2.52 million crypto assets in existence today, which is 5.7 times the number at the end of 2021. The pace of new coins accelerated in 2024 when 0.54 million tokens have already been created, which means an average of 5,300 pieces launched per day.\n\nBlockchain team The Open Network (TON) has announced the launch of the Memelandia hub for meme coin developers. The project is part of The Open League’s programme, which was created to support new meme coins and raise awareness of them."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOVGhhdjNXMXp5ekZPX0E0ZzA3QUFRS0RlVURId0tvUTFtcTlFNzNlYmx1bWNnNnpLMzNKdHJWankxbXJoSUNRS2hEV05CZS1GclFPVHl0RXEySUg3Y1pES21lcEh0NUIzZFBTOGowRHNXakRpY2VfMmVPMDNUUDl4WnBMVWc0akhpRWlGbVVPNnBSa1VYQzk1THVOX2VVLTFPUTBQT0ktUW3SAa4BQVVfeXFMUDNXaExSUjF2R2J5emRIclZ5bUU5c2dYX1R4MFdHTHI1RDYzT3RuREpoTkpfUHdjX19GNnVFaUlCbW85Q21SRWJhbnJRUXhPMVVtOWpocU1hdE4taHprQkR1Vjk5aURzYTZfNkJvejFWYTI3aHc4RHloVGxfTDcwejFmWVlSRzFMX2R2S0dCUEc2QmFESzhJbFV3LWVGc1VuRUZsbERpTzkyODFBNlhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Eprex Review 2024: Legit Crypto Platform? - Fact-Checked! - mid-day.com",
        "content": "Ethereum Eprex is a trading platform designed to cater to all trading needs and help traders experience seamless trading.\n\nEthereum Eprex is a new trading bot that is said to have changed the outlook of crypto trading and helped traders conduct trading effectively and efficiently. Traders have also found the platform to be simple and safe to use and it is said to help them identify the right trading opportunities. The creator of this trading platform also claims that it provides an easy way for novice traders to step into crypto trading. The platform also provides a personalization option, where traders can select the cryptocurrencies they want to invest in and set the parameters according to their trading goals.\n\nADVERTISEMENT\n\nVisit Ethereum Eprex\n\nMany questions arise, such as why Ethereum Eprex has become one of the most popular trading bots in such a limited time, how it has helped traders identify the right opportunities and make huge profits, and if it is safe to use as claimed by the creator.\n\nSo, in this Ethereum Eprex review, we will delve deeper and reveal whether these claims are valid and answer all these important questions. For this, we will take a look at the features of this trading bot, how it works, how to register on this platform, and figure out whether it is worth a shot.\n\nSo, keep reading to learn more about the Ethereum Eprex trading system.\n\nEthereum Eprex - Quick Facts Overview\n\nTrading Platform Ethereum Eprex Platform Type Web-based platform Version AI Version Registration Fee None Verification Required Yes Minimum Deposit $250 Assets Supported Stocks, CDFs, Forex, and various cryptocurrencies Payout Time 24 hours Deposit Method Supports different deposit and withdrawal options Customer Support 24/7 Official Website Click Here\n\nWhat Is Ethereum Eprex?\n\nEthereum Eprex is a trading platform designed to cater to all trading needs and help traders experience seamless trading. This platform is designed using advanced technologies such as advanced algorithms, artificial intelligence, and analytics. With the help of these technologies, this platform enables traders to get real-time data and other valuable insights into the market and helps them make informed decisions.\n\nTraders can also customize their trading prospects according to their trading requirements and goals. They can set parameters such as entry and exit points, stop-loss, and take-profit orders. The Ethereum Eprex platform is integrated with top-grade resources, such as brokerage services where various deposit and withdrawal methods are available, and offers traders 24/7 customer support.\n\nLet’s look into more prospects of this trading platform in the coming sections of this review.\n\nStart Trading With Ethereum Eprex For Free\n\nEthereum Eprex Key Features\n\nThe creator of the Ethereum Eprex platform claims that several technologies and tools have been used to enhance the functionality and working of this platform. So, here we will look at the main features of this trading bot.\n\nIntegrated With Advanced Technologies\n\nThe Ethereum Eprex platform has been integrated with the latest and advanced technologies such as artificial intelligence, algorithms, and analytics. Using these technologies, trading boundaries are expanded and upgraded to enhance the overall trading experience.\n\nThe Ethereum Eprex platform has been integrated with the latest and advanced technologies such as artificial intelligence, algorithms, and analytics. Using these technologies, trading boundaries are expanded and upgraded to enhance the overall trading experience. Generates Precise Trading Signals\n\nUsing advanced technologies, the Ethereum Eprex trading platform gives traders insights into the current market conditions. It also generates accurate trade signals using mathematical algorithms based on market performance. From this, traders can identify the right time to buy or sell a crypto.\n\nUsing advanced technologies, the Ethereum Eprex trading platform gives traders insights into the current market conditions. It also generates accurate trade signals using mathematical algorithms based on market performance. From this, traders can identify the right time to buy or sell a crypto. Customization\n\nUsing the Ethereum Eprex trading system, traders can set the trading parameters according to their trading goals and experience. They can get a complete personalized experience through this platform. All the important parameters such as entry and exit points, take-profit and stop-loss, and others can be set through this system.\n\nUsing the Ethereum Eprex trading system, traders can set the trading parameters according to their trading goals and experience. They can get a complete personalized experience through this platform. All the important parameters such as entry and exit points, take-profit and stop-loss, and others can be set through this system. Manage Portfolio\n\nAnother advantage of Ethereum Eprex is that traders trade in different cryptocurrencies and other assets from this single platform. They can manage the collection of crypto assets through this system. This provides an opportunity for traders to efficiently control their inventory and analyze the performance of each currency or stock.\n\nAnother advantage of Ethereum Eprex is that traders trade in different cryptocurrencies and other assets from this single platform. They can manage the collection of crypto assets through this system. This provides an opportunity for traders to efficiently control their inventory and analyze the performance of each currency or stock. User-friendly Interface\n\nThe important aspect of any system or platform is that it should have an intuitive and user-friendly interface. This can enable the users to navigate the platform without difficulties. It allows Ethereum Eprex users, experts, and novice traders to get a seamless experience.\n\nThe important aspect of any system or platform is that it should have an intuitive and user-friendly interface. This can enable the users to navigate the platform without difficulties. It allows Ethereum Eprex users, experts, and novice traders to get a seamless experience. Safe And Secure Trading Experience\n\nThe Ethereum Eprex platform follows all the safety and security protocols and offers safe transactions. The system is also integrated with two-factor authentication and the latest encryption technology, and stores every data securely. Every trader has autonomy over their invested money and assets.\n\nTry Ethereum Eprex For Free\n\nHow Does Ethereum Eprex Trading System Work?\n\nHow does Ethereum Eprex work? This is a popular question among many people looking for the perfect platform that not only helps them achieve immense profits but also offers them a safe and secure trading environment. So, let’s look at how this platform works.\n\nThis system collects real-time market data from authentic sources. Traders can view the in-depth data presented in the form of charts, histograms, and other data flow diagrams. All the information, such as prices, trading volumes, and other crucial metric data is given. Traders can also track the performance of their assets and the total asset value in the current scenario using the portfolio system. Traders can improve their decision-making by analyzing all the valuable market insights.\n\nEthereum Eprex has a risk-management system that can help traders identify potential risks and give accurate predictions about how a particular asset or currency will perform in a year or a month.\n\nWith the help of such a system, traders can grab profitable opportunities and minimize any risks. They can also personalize the different aspects by setting up the parameters such as entry and exit trading, and other similar ones. Traders can shift between automatic and manual trading options according to their needs. Even beginners can step into trading through this platform, with the help of the free demo mode, which can give you first-hand experience in trading without having to make any real investments.\n\nThereby, the Ethereum Eprex platform offers a seamless trading experience.\n\nHow To Register On Ethereum Eprex?\n\nThere are only 3 simple steps to follow to register on Ethereum Eprex. Let’s go through the steps involved.\n\nStep 1 - Free Registration\n\nThe first step is to register yourself on the Ethereum Eprex platform. You can visit the official page, click on Register, and fill out the registration form. Basic details such as name, date of birth, phone number, email address, and other details should be filled out.\n\nWhen you submit the form, your details will be verified by the Ethereum Eprex verification team. After your details have been found authentic, they will send a confirmation email. Thus, your profile registration is completed and you don’t need to pay any registration charges.\n\nStep 2 - Invest\n\nTo start trading on the Ethereum Eprex platform, you need to invest an initial capital of $250. The initial investment can be increased according to your trading experience and goals. There is no need to pay any deposit charges or any maintenance fee. You will have full autonomy over their investment and the assets they have invested.\n\nStep 3 - Start Trading\n\nOnce you complete the initial investment, you can start trading through the Ethereum Eprex system. You can set the parameters such as entry and exit points, pricing, and other factors. The platform also gives you valuable insights into the market performance and you can identify potential opportunities.\n\nRegister On Ethereum Eprex For Free\n\nEthereum Eprex - Pros and Cons\n\nHere we will look at the potential advantages and disadvantages of the Ethereum Eprex trading system. Noted below are some of the pros and cons of using this platform.\n\nPros:\n\nNo registration charges or maintenance fees\n\nUser-friendly and intuitive interface\n\nSimple to use trading system\n\nCustomization options are available\n\nIntegrated with the latest and advanced technologies\n\nGenerates accurate trade signals\n\nFree demo mode\n\nSupports different assets and cryptocurrencies\n\nSimple portfolio management\n\n24/7 customer support\n\nCons:\n\nA few countries such as the United States, Cyprus, France, Iran, and Israel have strict trading laws and as a result, the Ethereum Eprex trading platform cannot be accessed in these countries.\n\nEthereum Eprex: Minimum Cost and other deposits\n\nEthereum Eprex is a free trading system. You do not have to pay any registration fees or make any sort of payment such as maintenance fees. To start trading through this platform, you should make an initial deposit of $250 after you complete the registration process. You can increase the initial deposit as per your trading goals and expertise. The platform supports various payment and withdrawal methods. You have overall control over your assets and the money invested and it can be withdrawn at any time.\n\nEthereum Eprex: Cryptocurrencies\n\nThe Ethereum Eprex platform supports a wide range of cryptocurrencies and other assets such as forex, CDFs, stocks, and others. Mentioned below are the crypto assets supported by this platform.\n\nBitcoin (BTC)\n\nBinance Coin (BNC)\n\nEthereum (ETH)\n\nEthereum Classic (ETC)\n\nDash (DASH)\n\nCardano (ADA)\n\nRipple (XRP)\n\nDogecoin (DOGE)\n\nMontero (XMR)\n\nLitecoin (LTC)\n\nYou can view the full list of cryptocurrencies and assets supported on this platform on the official website.\n\nTry Ethereum Eprex For Free\n\nEthereum Eprex: Customer Support\n\nThe Ethereum Eprex customer support is available 24/7. Experts lead the team, and they can help resolve any issue, at any point of the day. You can contact them to resolve any technical issues or clear any of the platform-related doubts, and they will be available to solve any of the issues that you are facing. Ethereum Eprex users have said that the team has resolved issues such as glitches and transaction issues, and cleared doubts in just a couple of minutes.\n\nIs Ethereum Eprex a Legit Platform?\n\nSeveral factors of the Ethereum Eprex trading system prove that it is a legitimate platform. The most crucial aspect is that using this platform does not cost a penny. Users do not have to pay any registration or maintenance fee, and no hidden charges are levied. In addition to this, all the safety measures are integrated into this platform to ensure that no foul play takes place. This is especially true when it comes to transactions, the latest encryption technology has been used to prevent any money leakage. All users are verified by the Ethereum Eprex verification team before they start using the platform.\n\nThe creator of this platform aims to give traders a simple and hassle-free trading experience. For this, the latest technologies such as artificial intelligence, algorithms, and analytics are integrated into this platform, which not only gives you real-time market performance but also helps to manage all the risks and reduce losses. The Ethereum Eprex technology has a high user success rate and has been receiving positive feedback from its users. So, these factors prove that Ethereum Eprex is a legitimate trading platform.\n\nEthereum Eprex Review - Final Verdict\n\nIn this Ethereum Eprex review, we have covered all the important aspects of the trading platform and we can conclude that it is a safe and genuine trading platform. With the help of top-notch technologies, the system can help traders in their every move. The latest technologies that have been integrated with this platform give a seamless trading experience to the users. Traders who have used the platform have said that the accurate market performance and access to real-time data have helped them make the right decisions and consistent profits. This system also provides a safe and secure trading environment for all its users and both novice and experienced traders can benefit from this platform. This is a free-trading platform and does not charge any registration fee, maintenance fee, or transaction fees. Users have also said that it is a safe and secure platform that guarantees to protect user data.\n\nEvaluating all the information, the Ethereum Eprex trading bot does seem to be worth a shot.\n\nTrade With Ethereum Eprex For Free\n\nEthereum Eprex - FAQs\n\n1. Is there a registration fee for Ethereum Eprex?\n\nNo, Ethereum Eprex is a free trading platform. Users do not have to pay any registration or any other fee to use the platform.\n\n2. I have no prior experience in trading. Is the Ethereum Eprex platform perfect to jumpstart my trading career?\n\nThe Ethereum Eprex trading platform is perfect for both novice and experienced traders. Novice traders can start by using the free demo mode to get familiarized with the trading.\n\n3. Is there an age limit for using Ethereum Eprex?\n\nIndividuals who are above 18 years of age can use the Ethereum Eprex trading platform. Individuals under 18 years of age are restricted from using this platform.\n\n4. I am currently residing in Singapore. Is the Ethereum Eprex system legal in this country?\n\nYes, the Ethereum Eprex trading system is available in most of the countries. However, due to some trading restrictions, it cannot be used in some countries such as the United States, Iran, Israel, Cyprus, and France.\n\n5. Can I access my Ethereum Eprex account on my mobile phone?\n\nYes, Ethereum Eprex is a web-based system supported on different devices such as mobile phones, desktops, and laptops.\n\nVisit Ethereum Eprex For Free\n\n“Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions.”"
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPMEcyY1hEQ1dxcV9Hc09RcERhemdrN2x5ZlcyakJpZ0JteTlpcEhuT3RDbmpwbE9kV0lzYkQyWnhuQmlFVVpHQUpCOUdCa3RycFJfNzJMVXZGN2MxWHJ6RDFteXZsSDNPSDlOc1g2bERfRUN5eDVSdHg2TDd1bHFGNWlwdHZXMVVX0gGOAUFVX3lxTFBnaFpIYVVxVnBnVmhTclpaSlFZQXJaUmJWaHFhcS1BSFF4b3FCNXNDWEo3eDZ6VjVpRWFtU3UyakF3Ym13RlRuRlc3LTMyVi1TYk9VZVRxY0NLRVB6MHpZOV9zVXZWY21vaXR3OTFDUVBqU1J4Vk5sS01rRks0bkU2ZmlNTmJvVXBRS0I0TXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Worldcoin becomes part of Ethereum L2: Will WLD rally again? - AMBCrypto News",
        "content": "Worldcoin to get its L2.\n\nWLD has remained in the $4.7 price zone despite the latest announcement.\n\nWorldcoin [WLD] has a knack for the dramatic, and this trend continued with its recent announcement.\n\nFollowing the controversy surrounding iris scanning, the platform has announced plans to launch its Layer 2 (L2) solution. Did this latest announcement move the price of WLD in any way?\n\nWorldcoin’s Layer 2\n\nIn its announcement on the 17th of April, Worldcoin revealed the launch of what it termed the “World Chain.” This new platform is described as a Layer 2 solution built on the network.\n\nNotably, the World Chain will be secured by Ethereum [ETH]. The announcement also mentioned the presence of bots on the platform, with some deemed necessary.\n\nTo address potential network congestion caused by unnecessary bots, Worldcoin plans to leverage World ID to distinguish between bots and human users.\n\nAdditionally, the post highlighted the prominent role of WLD, Worldcoin’s native token, which will be utilized for gas fees alongside ETH.\n\nDid Worldcoin react?\n\nThe latest announcement from Worldcoin introduced a new utility for WLD, yet it failed to prevent the observed decline.\n\nAnalysis of the daily timeframe chart reveals that WLD concluded the day with a negative performance despite the announcement.\n\nBy the end of the trading session on the 17th of April, WLD experienced a decline of over 6%, trading around $4.7.\n\nAt the time of writing, it fluctuated between gains and losses, exhibiting a less than 1% increase while still trading around $4.7.\n\nThe long Moving Average (blue line) currently acts as support around $4. Still, a breach below it could initiate a more significant decline.\n\nFurthermore, the Relative Strength Index (RSI) confirmed a bear trend, with the RSI below 40, indicating a strong bearish sentiment.\n\nThis trend suggested that WLD had its trajectory, and the recent announcement failed to generate any positive impact.\n\nActive addresses show reduced activity\n\nBesides the price movement, analysis of the 24-hour and 30-day active addresses metrics indicated a lack of excitement surrounding Worldcoin.\n\nRead Worldcoin’s [WLD] Price Prediction 2024-23\n\nAccording to Santiment, the 24-hour active addresses metric shows no significant change between the 17th of April to press time, with a slight decline observed.\n\nAt the time of this writing, there are 321 active addresses. Additionally, the 30-day active addresses metric reveals significant declines over the past few weeks, with only 6,483 active addresses at the time of writing."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMi_gFBVV95cUxPUHJuU0I2ZnQ1UGI1ZlNJUHYwOGVEMnRXQnItaVNob3N1OXB5M0M5Ymkzc0hKVDEwd2wweHBzdms5TkNpSXBRU2RSc1VwVmN5dEVhZTUya2c4cmc5V3BHcURlWUlLclhfTkR0Um4wVDhVQ3FxeUtUWlcweC1lcE5HLWk4NFM2TzlYdThxQlFfTGd0N1NjU0VsbEN3UFZ3M2NaeElzd1JrT3JNNVktVjFzNC1GRFhxVTFzYmZydHBFLW1vUC01b3psTmRLT0pZWTNma0RzRFZmQzJ0R2FUcDBtQld1TGZ5dlZnbXllQ1FWV3dLYXZpVEU1QzM4S3FzQdIBiwJBVV95cUxQOWp4cXU4bWxZNjY2YW9TN09VdTBOWUFqVDRQR3VvMGN3c0doUFhrREhtX05xUFNnVElnVlpzYzhia293Z0hFTkE5amRTVVhqemlTUGtEMlBlTVBuS2FQbkNZSjRDVUxQOThVUUhGc0JrY1JCaU9pMnA0OWJuc2huMVlSYWxlSm5YYURZWGFlRVpoUm9WaHZRd1VOZGpxa2FJZVJrSTQtU1F0Znd6ckhLTDFyelQ5WkRCNTVZMjR5V3ZJX0tTV3liMVM4TFFNQUZJUWsyaW0zQ1VaN3VqQVRQWUQ3dXB6WWprU2QybGFOc2o3LWo5OEdZSXdYNi11eUdGQWNjWDhoMUl4VEU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin Holds Above $63K, Ethereum Drops Toward $3K, Other Altcoins Show Mixed Signals Before Halving Event - Analytics Insight",
        "content": "The SEC just declared war on crypto.\n\nUniswap is the LARGEST decentralized exchange (DEX) in existence.\n\nHas over $2 trillion in total volume since its launch in 2018.\n\nRanked #1 in most metrics including over $6.1B in TVL.\n\nToday Uniswap Labs received a Wells Notice from the… pic.twitter.com/D5G7EWUFD7\n\n— Altcoin Daily (@AltcoinDailyio) April 10, 2024"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNTmxfemhKd1UtR0luZkxIRm14OWs4Z0R6eTlhQ1AyZXRoTS1KQWVWRGR2eWt1d3N6andVUUFJRklBazZMV2Jpdy10dkNsUW9pZTloVVlPNDdRTXRNRzc2eVM4Z21MVXZOd3hQVUs2VGFBU3pBMFZTQ2hwMThmWTllT2o0R09JbGM4R0ZMTTlYdW1qcld4MEktS0FkVS1CWF9jOE9RUlVWbnZ1eWpPei1tSk9CS3JZT3kxQ3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "ETHEREUM PRICE ANALYSIS & PREDICTION (April 17) – ETH Continues Selling, Negotiating $3k For Next Big Move - NullTX",
        "content": "Ethereum resumed selling pressure this week after experiencing a little retracement last. While on the verge of breaking down a key price level, it has posted roughly 7% loss in the past week.\n\nRejecting $4,100 and $3,700 in the past weeks, Ethereum has found it difficult to push above the $3,300 level in the recent bounce as it lost momentum again due to the latest decline.\n\nTaking that bounce as a retracement of last week’s drop, the price is now on the verge of dropping off the important $3,000 level. A successful bridge from there could drive the price back to $2,852 – the current holding support.\n\nTechnically, that holding support recently acted as a sub-level to the crucial $2700 level that flipped as resistance during February’s surge. Once the crucial level is retested (probably as this week’s low) in this leg down, we can expect a quick price recovery in no time.\n\nHowever, it is important to note that ETH may extend bearishness below this key retest level if the weekly supply continues to outweigh demand. The $2,500 – $2,400 zone would be an oversold area to watch for a major buyback.\n\nAs of now, there are no signs of the bulls. A reversal pattern above the mentioned holding support could bring them back into the market. But as it stands, the bears are taking charge.\n\nETH’s Key Level To Watch\n\nWhile the bulls are in disbelief of the recent price movement, they may suffer more losses if the price slides through the vital $3,000 support level. Breaking the $2,850 support will activate more drops.\n\nThe $3,202 level now stands as immediate resistance. If the price recovers above $3,300, the resistance levels to watch above it are $3,450 and $3,723.\n\nKey Resistance Levels: $3,202, $3,450, $3,723\n\nKey Support Levels: $3,000, $2,852, $2,712\n\nSpot Price: $3,042\n\nTrend: Bearish\n\nVolatility: High\n\nDisclosure: This is not trading or investment advice. Always do your research before buying any cryptocurrency or investing in any services.\n\nFollow us on Twitter @nulltxnews to stay updated with the latest Crypto, NFT, AI, Cybersecurity, Distributed Computing, and Metaverse news !\n\nImage Source: fellowneko/ 123RF // Image Effects by Colorcinch"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQTTgyZEpaeUdJdzctV1AtU3hEN3hzOEtoTHhCbldUVlZPNGNhRDZtTXUtYjM0eXB0SU1PQm1YMG5vYUQ0aDdyM3pSWnVGdjR0SDU0QlI2bHlHV1ZkWS1ZaV83OWI3aVozTVJaT1QxVEJaRXUwVTVWTzg0blZVWFFpakw3eWJnRHRYdUJGSENWbWFDdV93RWtPMG1KV2RhT0Uydkl5QzgzVDRWb2_SAbABQVVfeXFMTzdyVXEtdWQ0TzlqaFkwRGxNR3BzRmxPZVFnLW9NampvdUNtNkRoQ2xsYXJ6ZHhrbWl4bHh4RFdTdkVyaDB5OE14b01Qc3RDZWZYMG5tcUVBcHk1LUI1Vnhmb0tReFhqNklUVG00U2lKMkowdXNJUTFxWi1yUkdJSExBbE5DZFRfbFEzLW9vOGhDZmZMVmkyUXBianVwVkg2TUhXUEQxQWthNnJMNVpHcVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Apr 2024 07:00:00 GMT",
        "title": "Should You Hold or Sell Ethereum? Expert Insights Ahead of the SEC’s ETF Decision - Coinpedia Fintech News",
        "content": "Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain.\n\nShould You Hold or Sell Ethereum? Expert Insights Ahead of the SEC’s ETF Decision\n\n\n\nAs the deadline for the SEC’s decision on spot Ethereum ETFs approaches, investors are questioning whether to hold or sell their Ethereum holdings. Experts weigh in on the potential impact of the expected rejection and its implications for the broader cryptocurrency market.\n\nExperts and their Insights\n\nAnalysts anticipate that the SEC will likely reject spot Ethereum ETF applications by the end of May. Bloomberg ETF analyst Eric Balchunas has revised his approval estimate from 70% to 25%, signaling a bearish sentiment.\n\nSimilarly, decentralized prediction markets suggest bleak probabilities of approval, with figures as low as 18%.\n\nLark Davis’s Perspective\n\nRenowned crypto investor Lark Davis believes that the market has already priced in the anticipated rejection. He states, “At this stage, I think the rejection is priced in. No one is expecting an approval right now.”\n\nDavis emphasizes that while there may be short-term volatility after the announcement, the overall impact on Ethereum’s price is likely minimal.\n\nDavis references the efficient-market hypothesis, asserting that current asset prices reflect available information. He notes that an unexpected approval would significantly impact Ethereum’s price more, signaling new demand vectors.\n\nAssessing the Impact on Bitcoin and the Broader Market\n\nBitcoin and Ethereum often move in tandem, with a correlation of about 62% as of April 11. Given their substantial market capitalizations, any significant movement in either cryptocurrency can influence the entire crypto ecosystem.\n\nWhile experts anticipate a rejection, they believe it won’t significantly affect Ethereum’s price or the broader market. Davis argues that Ethereum’s performance without an ETF has been robust, citing a 45% year-to-date increase.\n\nAlso Read : Ethereum Price Prediction : Analyst Lark Davis Predicts ETH Price Will Hit $15K This Bull Run, Here’s Why\n\nLong-Term Outlook and ETF Approval\n\nDespite the expected rejection, experts foresee eventual approval over the long term. Comparing Ethereum’s utility to Bitcoin’s, analysts highlight Ethereum’s focus on decentralized applications and technological innovation.\n\nWhile the approval timeline remains uncertain, analysts believe it won’t occur in May. Nevertheless, they anticipate no significant price decrease in Ethereum post-rejection.\n\nAs the SEC’s decision on spot Ethereum ETFs looms, investors grapple with whether to sell or hold their Ethereum holdings. Expert opinions suggest that while the rejection may cause short-term volatility, Ethereum’s long-term prospects remain bullish, irrespective of the outcome."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOV2FjVlo2aG5KekJQdHd3eXhqT0tDSW9kc2kzVDR3eEpkVGFVZkswSWRONW5oVkFDWEhmdFg5RkFsTzdmMWJlYUVKSEpwTFRCZXJkZTVWUzBxOGJHVTROTzZjVjdUUkJJam02V0FtQkZISTFxZW5TU01YTWNHeTBLTUpvX3RNT2NVNEttTm9TUGdFUXdGclFJSVlKNF84TjlQZDZNRWp1UmNkRVVQMjB6dTBSTXBoLU1meU8ybTNGQlFZYUlaOGg4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction : Analyst Lark Davis Predicts ETH Price Will Hit $15K This Bull Run, Here's Why - Coinpedia Fintech News",
        "content": "Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain.\n\nEthereum Price Prediction : Analyst Lark Davis Predicts ETH Price Will Hit $15K This Bull Run, Here’s Why\n\ncrypto analyst Lark Davis forecasted Ethereum price soaring to an astounding $15,000 this crypto cycle.\n\nHis prediction is backed by compelling catalysts that could propel the leading smart contract platform to new heights.\n\nCoinbase Base Chain Onboarding Surge\n\nThe first reason Davis highlights is that Coinbase’s Base Chain as a pivotal catalyst driving Ethereum’s price surge. With Coinbase’s imminent launch of Base Chain and its smart wallet, the platform is set to onboard its vast user base of 120 million customers, creating an unprecedented surge in Ethereum demand.\n\nAs users flock to Base Chain, Ethereum stands to benefit immensely, with every transaction requiring ETH as fuel, potentially leading to substantial price appreciation.\n\nLayer Two Narrative and Ethereum’s Dominance\n\nBeyond the Coinbase hype, Ethereum’s position as a leader in layer two scaling solutions further strengthens its bullish case. Davis emphasizes Ethereum’s integral role in the broader layer two narrative, with projects like Arbitrum and ZK Sync gaining traction.\n\nAs users embrace layer two solutions for scalability and cost-effectiveness, Ethereum’s dominance in the smart contract space solidifies, driving investor confidence and adoption.\n\nEthereum Staking and Wealth Creation\n\nAnother key catalyst highlighted by Davis is Ethereum’s staking ecosystem, which promises substantial returns and wealth creation opportunities. With the launch of the Ethereum 2.0 beacon chain and the upcoming integration of staking protocols like Igen, Ethereum holders are incentivized to lock up their ETH, further reducing circulating supply and driving up prices.\n\nAdditionally, Ethereum’s thriving DeFi ecosystem and burgeoning NFT market contribute to the platform’s overall economic activity, reinforcing its status as a blue-chip asset in the crypto space.\n\nAlso Check Out : Crypto Expert Lark Davis Reveals 9 Altcoins Set for 9x Growth in 2024\n\nThe ETF Potential\n\nDavis underscores the significance of an Ethereum ETF approval, despite the expected denial of BlackRock’s application in May. While initial rejections may dampen short-term sentiment, Davis remains bullish on the eventual approval of an Ethereum ETF, citing BlackRock’s track record and legal precedents.\n\nOnce approved, an Ethereum ETF could unleash a flood of institutional capital into the market, driving prices to unprecedented levels.\n\nIn Conclusion\n\nWith a confluence of bullish catalysts on the horizon, Ethereum’s journey to $15,000 appears increasingly plausible. Davis’s forecast sheds light on the fundamental drivers behind Ethereum’s potential surge, offering investors valuable insights into the platform’s long-term growth prospects."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPaGNDTVN0a0w1dHNjR3R6cXBaZ1FDMVJaRGlCMlRGdVpsMVdEN1otYktoSlNNY3lmQXlOSHE1LUNwX3dHQm1SUUhvS0FKRG8zbDVyRGFIQ29YQkxwc19ReGRmZXhaNlowLVdhMDU1MnBhQnFwcEdZZTBVV0Nlb3IzaGREc1BPaU5xa01vWkMwMC1yTVFEcnNJMDY0TG1ZMlNxd1J6N9IBqgFBVV95cUxOZXktem1IZTkyWEYtQjQzLWJYQ3ZYbTVFZ3ROVkY1MnRISGRLRWZtTUk1T3dDdzE0UlIwdGctTGkybzJicWZxblNueVA0YnJrOW9iODdnTzRLOWN2RzdLOHE0UkJrYm0tSnFtSzJ2NFZNUGc1akoxajM3TEpGYUtuQmdKb2wzdFI0ZzBaYUJqMTdZY2p0ek1SVzVzRW8tTXFhVjltZXNWaWJkQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ethereum To Plunge To $2,500 This Month? What’s Next For ETH And ENA? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nEthereum To Plunge To $2,500 This Month? What’s Next For ETH And ENA?\n\nWith only 395 Blocks remaining for the next Bitcoin Halving, the cryptocurrency industry continues to display a significant correction in valuation. Top tokens continue to hover close to their important levels, indicating increasing selling pressure in the crypto space.\n\nThe Ethereum blockchain continues to bleed with the leader of altcoins, ETH price, losing over 15% in its portfolio during this time. Moreover, the blockchain’s latest token, the Ethena (ENA) price has displayed a similar trend by following in the footsteps of its leader.\n\nEthereum (ETH):\n\nAfter displaying a correction of 12.65% and witnessing a bearish price sentiment for over a week, the ETH coin price has recorded an uptrend of approximately 3% within the past day, indicating a decline in the selling pressure within the cryptocurrency space.\n\nTradingView: ETH/USDT\n\nThe Ethereum token has recently formed a symmetric triangle pattern and is trading within it. Moreover, the ETH coin is hovering close to its resistance level of $3,149 and its support trend line of the triangle, highlighting uncertainty in the future price action for the altcoin leader.\n\nThe EMA 50-day shows a bearish convergence in the 1D time frame. On the other hand, the technical indicator, MACD, shows a constant red histogram with its averages showing a constant decline in the chart.\n\nIf the bulls regain momentum, the price will break out of its resistance trend line and attempt to test its upper level of $3,697. Conversely, a bearish sentiment could result in the price falling to test its low of $2,800 in the coming time.\n\nRead More : Ethereum Price Could Drop to $2.5K Soon! Is This a Good Buying Opportunity?\n\nEthena (ENA):\n\nThe Ethena token gained significant attention from the market following its launch, resulting in the ENA price recording a high of $1.523. Following this, the bulls lost momentum and recorded a correction of approximately 25% in valuation. Since then, the price has been displaying a neutral trend in the chart.\n\nTradingView: ENA/USDT\n\nThe Moving Average Convergence Divergence (MACD) displays a rising green histogram, indicating an increase in the buying pressure within the crypto industry. Furthermore, the averages show a bullish convergence, suggesting a positive price action for the altcoin in the coming time.\n\nIf the market breaks out of its resistance level at $1.070, the bulls will regain momentum and prepare to test its upper resistance level of $1.280. However, if the bulls fail to gain momentum, the ENA price will plunge toward its low of $0.875 this month.\n\nAlso Check Out : Ethereum Hovers Around $3,000 Following $300 Million Selloff! Will Bulls Lose Their Defense?"
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPdzBkcVdXRS1hLUdheHlWVFhnNHFPYm1UUmxQb3J5UV9EQldzWlJnb3gxbHo1QW14bzZXSGlmV0RLSUc4eU1NVDk4MDZVZVlmMVY4VWRhME1yQUVnZHVwTVd3c0FtWXBzeExlaVhMbm9OWXRPQkFfY2JoVDZSNl9kckNQWTkxRzVLZkVRem85NVhYZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Meet World Chain, Worldcoin’s (WLD) New Layer-2 Ethereum Blockchain - Coinfomania",
        "content": "Worldcoin, a pioneering biometric digital identity project utilizing iris scanning, has announced a strategic partnership with Alchemy, a prominent Web3 development platform.\n\nThis collaboration aims to fortify the infrastructure of the World Chain ecosystem, facilitating a more robust framework for developers. The announcement was made on June 26, marking a significant development in the integration of biometric technology within blockchain applications.\n\nThe partnership provides World Chain developers immediate access to Alchemy’s extensive suite of Web3 development tools.\n\nThis suite includes core and data APIs, indexing solutions, and a sophisticated account abstraction infrastructure, which enhances the safety and security of self-custodial wallets.\n\nAlchemy’s integration will also extend to incorporating World ID, Worldcoin’s digital ID technology, offering millions of developers worldwide an opportunity to engage with this cutting-edge technology.\n\nWorld Chain was initially introduced in April 2024 as a part of a larger initiative by Tools for Humanity, spearheaded by OpenAI CEO Sam Altman.\n\nSource: Worldcoin\n\nAlex Blania, who is centrally involved in the development and promotion of the Worldcoin project, plays a crucial role in the ongoing development of this blockchain network.\n\nDesigned explicitly with human-centric principles, World Chain intends to operate alongside other major blockchain ecosystems such as Optimism, Coinbase, and the broader Ethereum network, collectively known as the Superchain.\n\nThis blockchain is particularly tailored to prioritize human interactions over automated processes. By leveraging verified World IDs, World Chain offers holders priority block space and a free gas allowance for regular transactions, thereby reducing the prevalence of bots.\n\nThis design not only secures the network against automated interferences but also ensures that developers have clearer access to real users, enhancing the overall user experience and reliability of blockchain applications.\n\nStrategic Partnership Bolsters World Chain’s Ambitions\n\nSteven Smith, the head of protocol at Tools for Humanity, emphasized the importance of this partnership with Alchemy.\n\nHe noted that Alchemy has demonstrated proven expertise in ensuring guaranteed uptime and reliability for major enterprises, a crucial element as World Chain aims to establish itself as the first human-centered blockchain and the largest entry point for human participation in the blockchain space.\n\nJust in: Worldcoin is partnering with @AlchemyPlatform to bring World Chain to life ⚪️ pic.twitter.com/ECKikbkXby — Worldcoin (@worldcoin) June 26, 2024\n\nThe partnership is expected to make significant strides toward achieving Tools for Humanity’s goal of bringing a billion users into the blockchain ecosystem.\n\nIt aims to increase opportunities for developers to create applications that are not only effective but also intuitively align with human needs and experiences in digital spaces.\n\nWorldcoin Expands Operations Globally\n\nIn addition to its technological strides, Worldcoin is expanding its operational footprint globally. As part of its expansion efforts, Worldcoin has initiated its European operations by launching World ID orb verifications in six locations across two European cities.\n\nThis move marks the project’s initial steps into Europe following successful implementations in various Latin American countries and represents a critical phase in Worldcoin’s strategy to broaden its global influence.\n\nDespite these positive strides, Worldcoin has experienced a minor setback in market dynamics. Over the past 24 hours, there has been a slight decline in open interest by 0.85%, bringing its current valuation to $107.9 million.\n\nSource: Worldcoin\n\nFurthermore, the price of Worldcoin’s token (WLD) has seen a decrease of 1.22% during the same period, with its price currently standing at $2.83 and a trading volume of $193.8 million.\n\nThis partnership between Worldcoin and Alchemy represents a transformative step in making blockchain technology more accessible and tailored to human needs, potentially leading to widespread adoption and innovation in the blockchain sector.\n\nAs World Chain continues to develop, it holds the promise of becoming a pivotal platform in the evolution of blockchain technology, focused on enhancing user engagement and security."
    }
]