[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOLVB3Y04tZm01WHN1TGM1SEVOa2taOWFNbmtBZDFtU1FTNEdocXJLNDMtZWtzTVY4WXZvaWZtR0xMVlRGUjZpWmlmNC1qUk5PTk9NZkstb2k4ZUVOcVBZQ09FSDloZi15MWxWX3hBTmFuTU1VSUJSSkhlU3VuSDhvaTQ3WWlqVXJ1WDhmSHNyeW5WVkxFVGFYZlJFOEZ2N1dpdlpMU05GV29LanVKQkh2YldvQWdOSDlUb0lURVNtVXROWDQ0Z21qUVhNZjh3cVXSAdQBQVVfeXFMTmh0SG9sT2tCSno5c08tU1hmdWUtdUc2VmpubzZEOFdvSTBiTU5nRnljaG9mNzltaW5HTXRMSHUzMEFpcGFOUmd4SGtka3djQWlZaEkyT1RiWFdDaTQ2TU9mT0pUNFE5MThaSzhsc1JlNW5XUU9ZSUVmRmVvR0hrWDhpakFMa0xIS25kRW11b1Y1eTRaUWlZcEhwMWdMbGxSNTJYcEpDUmlsNHVHT3BadkdpZ0lQMzVDTHZNV0dkYXVtcFktei1nb3I1eURhMjg4dnF4b2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Ethereum: Long Term Bullish Pattern Ironically Has To Retrace In Order To Be Super Bullish - Investing Haven",
        "content": "Ethereum’s recent price movements present a paradox that might confuse the average investor. As Ethereum’s price dips, it could, counterintuitively, signal a highly bullish future.\n\nUnderstanding this dynamic requires a deep dive into the technical patterns that are currently forming on Ethereum’s long-term charts. Chart analysis is one of our forecasting methods with which we try to predict ETH prices in 2024 & 2025.\n\nThe Current State of Ethereum\n\nLately, Ethereum has experienced a downward trend that has left many investors feeling uncertain. This decline is not just a reflection of market sentiment but also a pivotal development in the broader technical narrative of Ethereum’s chart.\n\nThe price action, which can seem disheartening at first glance, might actually be setting the stage for a major bullish pattern: the cup and handle.\n\nETH – Why a Move Lower is Bullish\n\nThe concept might seem contradictory at first — how can a decrease in price be a good thing for investors? The answer lies in the pattern itself. A cup and handle formation is recognized in technical analysis as a bullish continuation pattern that often leads to a breakout.\n\nFor Ethereum, this pattern begins with a “cup” formation, which the cryptocurrency has been crafting through its recent highs and lows.\n\nThe “handle” part of the pattern, which Ethereum is potentially beginning to form now, typically involves a slight downward or sideways movement in price following the cup. This movement is crucial as it consolidates earlier gains and builds a base for the next upward surge. For the pattern to be validated and for the bullish implications to be activated, Ethereum must not fall below a critical support level — in this case, $2,250.\n\nETH – The Importance of the $2,250 Support Level\n\nThis support level is more than just a number. It represents a key psychological and technical threshold that must hold for the cup and handle pattern to complete correctly. If Ethereum’s price respects this support level during its current retrace, it will likely solidify the handle portion of the pattern and set the stage for a significant bullish breakout.\n\nStrategic Considerations for Ethereum Investors\n\nFor those looking to capitalize on Ethereum’s potential, here are some conditions and strategies to consider:\n\nMonitor the $2,250 Support Level: This is the line in the sand for the bullish scenario to remain intact. A sustained movement below this price could invalidate the bullish setup and necessitate a reassessment of your investment approach. Understand the Pattern’s Timeframe: The cup and handle formation is a longer-term pattern. Patience is required, as the development and completion of this pattern can span several months. Prepare for Volatility: The path to higher prices is rarely smooth. Prepare for potential volatility as Ethereum tests these crucial levels. Consider the Broader Market Context: While Ethereum’s individual price movements are crucial, the broader market context, including regulatory news and macroeconomic factors, can also significantly impact price action. Set Clear Investment Goals: Whether you’re looking for short-term gains or long-term growth, understanding your own investment goals and risk tolerance is crucial. This clarity will guide your decisions amidst market uncertainty.\n\nConclusion\n\nIronically, Ethereum’s recent price retracement might be exactly what is needed to propel its price to new heights. By respecting the critical support level and forming a complete cup and handle pattern, Ethereum is not just performing a technical maneuver but is also setting the stage for a potential major bullish trend in the future. For savvy investors, this period is not just about weathering the storm but recognizing the opportunities that such patterns may present."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOcE5EUFdaVGVoSU9xbUhucDhHQXhUeFdGbXF2VEtEb2xIX09tSlZnSTBkLVN5Q2pFMjdYX2ZNVUxKdlVoQ2lJdEd3YmN3ZXhvbUVrcUVRTHduZVVXZWthOVlJT0hNOFRrN2YyWXRSYlR6Y1B1ZmNDTjlaWkZFbnlTMnBMbDhxTnBzaTFWQVlqR2FKcFczTXdUc3dSYWo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum has burnt $12.7bn since the London hard fork. But that may be slowing down - DLNews",
        "content": "It's been 1,000 days since Ethereum first started burning transaction fees.\n\nBut the mechanism, which offsets new tokens issued on the network, is slowing down.\n\nMore efficient transactions, an explosion of activity on layer 2 networks, and the recent Dencun upgrade have all helped reduce the amount of Ether the network burns.\n\nWith the implementation of an upgrade known as EIP-1559 as part of the London hard fork in August 2021, Ethereum became the first blockchain to start burning a portion of the fees users spend on transactions.\n\nThat was 1,000 days ago.\n\nThe move, the blockchain’s faithful hoped, would help counterbalance the issuance of new Ether tokens on the network, creating a more sustainable monetary policy.\n\nAnd it worked. Over the following 1,000 days, Ethereum users have burnt some 4.3 million Ether, worth over $12.7 billion just by using the network.\n\nWhen Etherum slashed Ether emissions by switching to a proof-of-stake consensus mechanism in September 2022, the network became deflationary — meaning more Ether was, on average, burned by the network than new Ether was issued.\n\nBut in recent months the rate at which Ethereum is burning tokens is slowing.\n\nA combination of more efficient transactions, an explosion of activity on layer 2 networks, and the recent Dencun upgrade have all helped reduce transaction fees — and thus the amount of Ether the network burns.\n\nThe lower fees are great for users. But if Ethereum can’t attract enough activity to offset the drop, it could easily lose its deflationary status, potentially throwing its economic model into question.\n\nJoin the community to get our latest stories and updates\n\nWhy is the burn slowing?\n\nWhen Ethereum users transact on the network they must pay a fee denominated in Ether.\n\nThis fee is made up of two parts: a so-called base fee charged by the network, and a priority fee, paid to block builders as an incentive to get the transaction processed faster. Ethereum burns base fees, and gives priority fees to those processing transactions.\n\nWhen activity on Ethereum increases, the network automatically raises the base fee users must pay.\n\nThe average base fee on Ethereum must stay above 23 gwei these days to ensure the network burns enough Ether from transaction fees to keep it deflationary. Gwei is a measurement for small amounts of Ether.\n\nOver the past 1,000 days, gas fees have averaged 41 gwei. If this trend continues, Ethereum’s supply is set to shrink by 0.76% over the coming year.\n\nBut there’s reason to believe it might not.\n\nEthereum’s March 13 Dencun upgrade introduced a new feature that cut the fees Ethereum layer 2s needed to pay to submit transactions to the main Ethereum network by as much as 98%.\n\nSince Dencun, Ethereum’s transaction fees have fallen from an average of 58 gwei on March 13, to just 7 gwei on May 2.\n\nAdditionally, more users are making the jump from Ethereum to layer 2 networks — separate blockchains built on top of Ethereum that rely on it for security.\n\nAfter hitting an all-time high of over 11 million weekly transactions in 2021, transactions on Ethereum have slowly declined to around 8 million per week at the end of March.\n\nAt the same time, weekly transactions on Arbitrum and Optimism, the two biggest layer 2s, have soared to a combined 18.5 million.\n\nWith fewer users transacting on Ethereum, the demand for transactions — and thus fees paid on the network — is falling.\n\nIncreasing gas efficiency\n\nCode improvements that reduce the amount of data smart contracts on Ethereum need to handle, should also reduce fees in the coming months.\n\nFor example, decentralised exchange Uniswap, the most frequently used Ethereum DeFi protocol which users have spent over $1.4 billion in fees transacting on, has included several optimisations for its upcoming Uniswap v4 version.\n\nV4 is expected to improve gas efficiency between swaps and liquidity operations, as well as reduce the cost of creating new liquidity pools by 99%.\n\nFuture versions of other top Ethereum protocols will likely also optimise for transaction fees.\n\nTim Craig is a DeFi Correspondent at DL News. Got a tip? Email him at tim@dlnews.com."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPQm93S2pWVnVNTXhKMnZVQVF0bzZaNXFka2NybE5xbURnMGxIWHQ5V19wblRvMFJQb0JiTU9rU0xQdUpubTlPU1h6eW9jNXFOMmdMNVZ0SVBvSGNweVFrMTY4ODJNcWdsV0dPNEdPeW9lZm9WbVZIWEJ2Z1pSWHJTQzlrOWI0dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "SEC will classify ETH as security and reject spot Ethereum ETFs, says Michael Saylor - Crypto Briefing",
        "content": "Bitcoin stands alone in institutional acceptance, with Ethereum and others facing SEC scrutiny.\n\nShare this article\n\nMichael Saylor believes that the US Securities and Exchange Commission (SEC) will label Ethereum as a security this summer and consequently deny all spot Ethereum ETF applications. He also claimed that other major cryptos like Binance Coin (BNB), Solana (SOL), Ripple (XRP), and Cardano (ADA) will likely face similar security classifications from the SEC.\n\n“Ethereum is deemed to be a crypto asset security, not a commodity. After that, you’re gonna see that Ethereum, BNB, Solana, Ripple, Cardano, everything down the stack is just crypto-asset securities unregistered,” said Saylor during today’s presentation at the MicroStrategy World 2024 conference.\n\n“None of them will ever be wrapped by a spot ETF. None of them will be accepted by Wall Street. None of them will be accepted by mainstream institutional investors as crypto assets,” he added.\n\nIn contrast, Saylor highlighted Bitcoin’s unique position as the only crypto asset with full institutional acceptance, describing it as the “one universal” institutional-grade crypto asset without any contenders.\n\nMicroStrategy’s founder is known as a vocal Bitcoin proponent; he exclusively focuses on Bitcoin investment and building Bitcoin infrastructure.\n\nSaylor’s comments come a day after MicroStrategy unveiled MicroStrategy Orange, a Bitcoin-based decentralized identity solution. Earlier this week, the company also announced last month’s acquisition of 122 BTC.\n\nMounting skepticism\n\nSaylor is not the only person who is skeptical about the near-term approval of spot Ethereum ETFs. Justin Sun, the founder of TRON Foundation, previously voiced concerns about Ethereum ETF’s regulatory hurdles. He believes the SEC will not approve spot Ethereum ETFs this month.\n\nThe SEC is set to make decisions on filings by VanEck and ARK on May 23 and May 24, respectively. Recent discussions surrounding the SEC’s approval process for spot Bitcoin funds have been notably shallow compared to prior discussions preceding the SEC’s approval of spot Bitcoin funds, with SEC staff reportedly not engaging in detailed conversations about the proposed Ethereum ETFs.\n\nThis lack of interaction heightens frustration and raises the chances of either a rejection or a postponement of decisions.\n\nA definitive classification for Ethereum could clarify how companies interact with the asset. It could also influence the SEC’s approval of products like spot ETFs and the willingness of companies to engage with Ethereum.\n\nHowever, not everyone shares this doubt. BlackRock CEO Larry Fink said on the Fox Business show “The Claman Countdown” that a spot Ethereum ETF could still be possible even if the SEC classifies ETH as a security."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPcEswQ2R2WUJxc2ZSQjFCVHVDbm5HcW1VYl9WQ3JyajkwWC1lR1hDdF9tTjVmUFZpTVYzaUtSWHpiXzBzQWFnVzBIZVA2dUFELVNiTUtjeUQ2UURfZU5ZbG5CUUxVYlJHOFEyOW9wMmNrTUV2aWxNbF9KcC0xd1owMnhSSWd4RHBqak5JU0dwRFRweUttNnpxRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, and Dogecoin Make a Massive Recovery on Friday - The Motley Fool",
        "content": "A bad jobs report was good for crypto today.\n\nAfter a week of lower trends, Bitcoin (BTC -3.41%), Ethereum (ETH -2.30%), and Dogecoin (DOGE -7.20%) jumped in trading on Friday morning.\n\nAs of 3 p.m. ET, Bitcoin was up 4.1% versus yesterday's stock market close, Ethereum had risen 2.6%, and Dogecoin was up 5.6%. And they all moved based on the same piece of information.\n\nUnemployment data and crypto\n\nCrypto values jumped the moment the U.S. Labor Department released April 2024 jobs data. The U.S. added 175,000 jobs last month and the unemployment rate rose slightly to 3.9%.\n\nEconomists were expecting 235,000 new jobs and an unemployment rate of 3.8%.\n\nThere can be revisions to initial data, but the market will often react solely to the headline report. And that's exactly what happened with the crypto market's reaction only seconds after the report was released.\n\nDoes unemployment really impact crypto?\n\nThe question is really about what this news has to do with cryptocurrencies. Many market participants think a worsening economy means the Federal Reserve will lower rates more quickly. Current expectations are for a September rate cut, but there may be no rate cuts this year if inflation remains high.\n\nIt's a balance to keep rates higher if the economy weakens because lower rates can be a catalyst for more economic activity.\n\nI also question whether or not rates really have much of an impact on cryptocurrencies at all. Outside of more speculation, lower rates don't have any fundamental impact on the crypto market in most instances.\n\nHigher rates are bad for the crypto meme\n\nWhile Bitcoin has solidified its position as a form of digital gold and Ethereum is commonly known as a more utility blockchain with many scaling solutions, Dogecoin could be the most sharply impacted if rates stay where they are and the economy gets worse.\n\nDogecoin is a meme coin with no real utility and that meme position will be tough to hold if people have fewer funds to spend on speculative assets. I think that explains the reaction today.\n\nThis is part of the normal volatility of the crypto market, but it also highlights that eventually, the meme that started in 2020 may not hold much water.\n\nCaution in crypto today\n\nThe crypto market has been on a tear in 2024 despite higher interest rates and signs the economy is getting weaker. And there was also the tailwind from the approval of Bitcoin exchange-traded funds (ETFs) in the U.S.\n\nBut some of the market's tailwinds may be subsiding and that won't be good for valuations long term unless there's a significant increase in the utility of cryptocurrencies. Bitcoin is getting more expensive after the most recent halving and Ethereum hasn't proven to be very cost-effective either.\n\nDogecoin has very little utility and has been focused on its meme status, which can come and go.\n\nI think a day like this is a time to take some chips off the table in crypto as the market telegraphs there are weaker fundamentals for the economy ahead. Like it or not, the economy and the Fed are still the biggest drivers of crypto long term."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPUUphcmNVUm1OSl9XNW9tMDM3Mi1sbkQxbG02WVZRejRqemdRN1QzVDBoWXNSd3F6SWhCM2NubVp6aXU2UlJIdVJoMFF1bTBWN1RxWXBKNnp3cUJJckM4RWFyTjJOekRUWi14dkRHMVd6S004b0NMdlR6V0VHLU44VERicFhlRlFhU2VjVkVKQjBtWDFGMU8xTjRPMXFpa3FlNzJYOFlTYl9Kam5xWWlVQ0xOU3o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Whales Move 36,000 as Recovery Begins – Will It Claim Previous Highs? - The Tech Report",
        "content": "Why Trust Tech Report Tech Report is one of the oldest hardware, news, and tech review sites on the internet. We write helpful technology guides, unbiased product reviews, and report on the latest tech and crypto news. We maintain editorial independence and consider content quality and factual accuracy to be non-negotiable.\n\nEthereum is now on the path to recovery after a retracement on the weekly timeframe. ETH touched the $3,000 price level today, indicating buyers’ return.\n\nWhale activity has increased again amid the price recovery, with more than 36,000 ETH tokens moved. Will this affect Ether prices?\n\nEthereum Whale Movement Influencing Ether’s Price\n\nAccording to the on-chain analytics platform Whale Alert, 36,763 ETH has been moved in the past day.\n\nA whale address transferred 25,772 ETH to Coinbase Institutional, a major crypto exchange, and another whale acquired 10,990 ETH from Coinbase within the same period.\n\nThese transactions coincide with Ethereum’s fluctuating prices, which has sparked mixed sentiments among market participants.\n\nMeanwhile, Ethereum’s price has increased slightly today, trading at $2,980 as of 5:37 AM EST, with a 1.4% 24-hour increase. The monthly charts suggest the token has entered a consolidation phase, marked by high fluctuation around the $3,000 price level.\n\nEthereum Spot ETF Decision Likely to Affect its Price\n\nThe uncertainty surrounding the spot Ethereum ETF approval by the U.S. Security and Exchange Commission (SEC) is a major factor affecting Ethereum’s price.\n\nWhile enthusiasts are keen on approval, MicroStrategy’s CEO, Michael Saylor, is critical of an Ethereum ETF. According to Saylor, Ethereum is a security. Hence, the SEC would never approve an ETF for the altcoin.\n\nThis assertion by Saylor comes just 20 days away from the final ETH ETF deadline of May 23. The SEC will either approve or reject a request for an Ethereum ETF on that date.\n\nAlso, Saylor believes that other altcoins such as BNB, SOL, Cardano, and XRP will be classified as unregistered securities. He noted that Bitcoin stands alone in attracting institutional acceptance, and there is no second-best token.\n\nWhile opinions are divided on an Ethereum ETF approval, a positive response will likely attract more investors. If the ETFs are approved, Ethereum will likely record a massive rally.\n\nHowever, nothing is certain yet, and a decline is imminent for Ether should the SEC decline the spot ETH ETF approval.\n\nWhat Next for Ethereum?\n\nETH has formed a red candle on the daily chart after rallying to $3,000 earlier today. The sellers have continued to mount pressure, forcing a decline at the $3032.8 resistance level.\n\nHowever, ETH has found support at the $2938.2 price level, which is critical to preventing further decline.\n\nThe Parabolic SAR indicator has moved above the candles, a bearish signal of further decline. This confirms the bearish signal displayed by the RSI, which sits at 39.08, approaching the oversold region.\n\nGiven the upcoming spot ETF decision and the current mixed market sentiment, Ethereum’s price is at a critical conjecture. It could remain consolidatory in the coming days until a decision is reached, which will either propel it upwards or trigger a downturn.\n\nDisclaimer: The opinions expressed in this article do not constitute financial advice. We encourage readers to conduct their own research and determine their own risk tolerance before making any financial decisions. Cryptocurrency is a highly volatile, high-risk asset class.\n\n🔎Looking for the next 10X crypto?\n\nCheck out the best crypto presales to invest now"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPbG1Jak9aTktjMUdickIxM0lLVkkyVW1wSWpNVC1QTF80Smszb2JjLWtlYVRWdVN1cWtRQ21qdnEtTW5QUnFOWXp6UklsdUo5aEJYWGoyOHk2UXJTOWR5eXJSOFBsU0pqanY3cFZZUUtGRkZXWnJRejNUbHR1SGYySS1ZY1FfZXlSNkZ4ZlNOcUpmVFd4NUVHZVVGY9IBowFBVV95cUxNeW1WeElzalkxRWlnOXU4Y3lMZTBWaFlhTHlxZC1EdTl1SVN4eWpGb1NBNDZiNmRxbVlxWlBoNEZvd20yeGNFUjZoZFA3RzVDb1VocjZfU0VDVWNfUjBIMU04SzhTM0lUTlFyM0xHV19YRkRmeEZRMnVyRmtBbjdyMjVVTFR2Ni1LRTJPX2lEU0V5bmRlQjFBQkFpcTVxTVVfc0c0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Rebound as Interest Rates Remain Unchanged in US - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum have rebounded after starting yesterday morning nearly 10% lower than they were on Tuesday.\n\nAt the time of writing, the Bitcoin price is around $57,700 after having made a 0.5% recovery in the past 24 hours. And the Ethereum price, after climbing 2.3% in the past day, is now trading for just below $3,000, according to CoinGecko data.\n\nBut the damage has still been done. Per CoinGlass, the past 24 hours saw another $193 million worth of crypto futures contracts liquidated, adding to the $300 million worth of liquidations seen earlier this week.\n\nEconomist and trader Alex Krüger explained that this current cycle feels so different for traders because it's largely been driven by interest in spot Bitcoin ETFs, which only just started trading in January this year.\n\nAD\n\nAD\n\n\"There has been barely any new retail coming into crypto,\" he wrote on Twitter. \"It's been mostly ETF buyers and previous cycle participants redeploying and going out the risk curve.\"\n\nAnalysts mostly attributed crashing crypto prices to fear in the market over certainty among investors that the Federal Open Markets Committee—which sets monetary policy and controls U.S. federal interest rates—would not lower rates. Then the Fed did exactly what the majority of investors thought it'd do by keeping interest rates unchanged, and crypto assets traded sideways.\n\nSome thoughts on the current crypto cycle #1 The crypto cycle has been almost entirely driven by the bitcoin ETF. #2 ETH has been a major disappointment, but it has performed well overall for stakers and airdrop farmers. #3 Solana established itself as the chain of choice for… — Alex Krüger (@krugermacro) May 1, 2024\n\nDuring a press conference yesterday, Federal Reserve Chair Jerome Powell told reporters that the fight to get inflation to 2% has been difficult, but added that he thought it was “unlikely that the next policy rate move will be a hike.”\n\nAD\n\nAD\n\n“I’d say it’s unlikely,” he said, but warned that it was “likely to take longer for us to gain confidence that we are on a sustainable path to 2% inflation.”\n\nBut even President Joe Biden has been optimistic that the Fed will still lower rates this year. \"I do stand by my prediction that before the year is out, there'll be a rate cut,\" he said during a press conference in Japan last month. \"This may delay it a month or so, I'm not sure of that.\"\n\nHe was referring to the hotter-than-expected March inflation report that had just been released at the time."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNUGxpd3J0WGpKZjd0emZnMmJ0WWpRdFFjaEJzbHFnd3FrLVZQTS1qNFhxdlRLLUQ1T2JCX21mVWRiVEsxd2ZNbjJnUk9aaEwyaEZNRy1uSXBFR3k3QWVIRGZweEE3Yi1KV1NBWkFLV0Iyd0pFV2RmWVBNV2ZySDRSWEk4aERFZzlSeEVEeFUxbktlUG9QdThiSUxCZ0M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum Whales Invest another $18M as ETH Price Dips Below $3k - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA1UnRFNnZ2eWpudzhwTVRoekZ5eWxiNlJKRGpBSGpyOW5UalhuMDR0TjJCZktONXRqU0t0M1BVOVZKa0JsYkd0emNDcXY1NmpVRFVRZUVzT2dFRzBDZXJYOFV2anFtelF2SFhxcjl1QVNNUHhDRjhDcjRwMXk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Feels Good Man: $BRETT Leads the Memecoin Charge on Coinbase Ethereum Layer 2 (L2) Blockchain Base - Yahoo Finance",
        "content": "Based Brett\n\nThe top memecoin and top ten coin overall on Base increases approaches $500 million in market cap, forecast for the rest of the year is even more bullish\n\nDUBAI, May 02, 2024 (GLOBE NEWSWIRE) -- Popular memecoin $BRETT continues to gather momentum in 2024 as the most popular memecoin and top ten most popular overall on Coinbase Ethereum Layer 2 (L2) blockchain Base, and now approaches $500 million in market cap. With continued community support and positive secondary indicators like crypto ETF approvals, futures trading for flagship memecoin Dogecoin on Coinbase Derivatives, and the anticipation of Bitcoin pricing eventually reaching 100,000 USD, $BRETT’s growth picture remains bullish.\n\n\n\n“We are seeing in real time how memes are not just an easy and funny way to share information on the internet, but to create almost immediate wealth by harnessing the power of these memes,” said $BRETT trader Crash. “This is the culmination of the grassroots financial movement of the past decade, from Bitcoin to r/WallStreetBets to now $BRETT, allowing people to escape the economic drudgery of living in The Matrix.”\n\nBase is Coinbase’s L2 built on OP Stack in collaboration with Optimism. Coinbase recently released new smart wallet technology built on Base, with $BRETT quickly becoming the most popular memecoin available for purchase there. Coinbase continues to be ambitious in its promotion of Base and the memecoins sold there, with plans to onboard over 1 billion users to the chain. Community response memecoins like $BRETT are also an easy way to boost early liquidity for the developers of new platforms on Base.\n\n\n\n\n\n\n\n$BRETT is one of the original characters of the Boy’s Club written by Matt Furie, the creator of the famous cartoon that has also inspired the popular Pepe meme and popular $PEPE memecoin. $BRETT involves a fixed total supply of 1 billion tokens, with a 6% transaction tax distributed to liquidity pools and burned tokens, aiming to reduce the overall supply and potentially increase the value over time.\n\n$BRETT continues to hold strong amid recent sideways market movement for memecoins. Even while most memecoins are down 50 percent, $BRETT has seen only about a 30 percent decrease.\n\nTo learn more, check out BRETT at:\n\nTg: https://t.me/basedbrett\n\nX: https://twitter.com/basedbrett\n\nWebsite: https://www.basedbrett.com/\n\nAbout $BRETT\n\nCheck out BRETT at:\n\nTg: https://t.me/basedbrett\n\nX: https://twitter.com/basedbrett\n\nWebsite: https://www.basedbrett.com/\n\n\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency & securities.\n\nStory continues\n\nCONTACT: Xenia von Wedel president TransformGroup 415-340-2792 brett (at) transformgroup.com\n\n\n\n"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNRXJic3hhOHV6TjRpOExmMFZTTHFiNTg4cmdZVmtyV1NSU1UtRHJXbGJBdUpXV0lwWWN6RTZoV1ZtNjg3U2NmekVnUjdTTGxiWG9oZ2RpYUV1UkZSWDROeFBfTzRXcmdwSk9tOEVKUzU3a1JUTEVid0liNXFyM1hCaW42YzZ4TzkxX3NIdnFfOFdFTjF5dVZUSlhhRWpRb2RzeEJTWG1tME43Y3NYREdfZFZvV21sN1dRcDZDcWpGaUUyZ00wV2w2MlRtRFN5VVhRU3lj0gHYAUFVX3lxTE5HaHRQQzNxLU5HMHhlNFMyRGg4NDNyUTBnNHdfc3QxQlpDMjI0WWZwQUkzV3lJN1FyS3pGZkpfWU93X0p3ektqa3RYR2JtM3UwV3cxdzNrY0ZUM3dHMzhKMmwzUDlOb01JcXVnLXlQcElLdHZRenVPZzl0Z3RHcFBMLTRuX1c3anE0bmtjenhOODQ2akttbE5NdkNyZDRlRGNuZXhQU0h5RmxETzFBQkw1bDhKaGhKeUJaa2wwVEVhZUwzanNwdmtFYkdGZkx5V2JMVGxkS1gxbQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Here’s Why One Crypto Analyst Doesn’t Think an Ethereum ETF Will Get Approval Despite ‘Altcoin Bull Market’ - The Daily Hodl",
        "content": "One widely followed crypto analyst is warning Ethereum (ETH) traders that an ETH exchange-traded fund (ETF) approval from the U.S. Securities and Exchanges Commission (SEC) is unlikely to happen soon.\n\nCrypto trader Michaël van de Poppe tells his 715,800 followers on the social media platform X that traders may have to wait a little longer for an ETH ETF.\n\n“The Ethereum ETF is likely not going to be approved in May.\n\nHowever, the markets are undervaluing a potential approval in August, as Ethereum is still getting sold off.\n\nI think the chances of an approval in August is positive, through which I expect Ethereum to outperform.”\n\nAccording to Van de Poppe, the current turbulence of the crypto markets presents an opportunity for crypto investors.\n\n“You wanted to buy Bitcoin at <$60,000.\n\nYou wanted to buy Chainlink at <$15.\n\nYou wanted to buy any altcoin in a correction.\n\nHowever, now, emotions kicked in and sentiment expects another drop, while the opportunity is here.\n\nMaybe you don’t feel you want to, but this is the time.”\n\nAccording to Van de Poppe, he favors trading newer altcoins over the “old” ones.\n\n“Old coins continue to provide bad returns as Polygon (MATIC) is on a cycle low.\n\nIt’s in the area of interest, but you should wonder whether it is going to generate a lot of returns or whether a new coin is going to yield higher upward returns.\n\nTo me: I stick to new coins.”\n\nMATIC is currently down 20% in the last month.\n\nThe analyst concludes by noting the most recent Federal Open Market Committee (FOMC) data is helping fuel today’s Bitcoin (BTC) rally and a wider altcoin bull run.\n\n“Terrible economic data -> DXY (US dollar index) down, additionally the case for quarterly earnings and rate cuts will increase and therefore risk-on assets rally.\n\nBitcoin back to $61,600.\n\nFOMC was the low for the markets and the altcoin bull market has started.”\n\nBTC is worth $61,702 at time of writing, up 4% on the day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/KumaSora/LongQuattro"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxPYjNxZzB5ZkZGV0pfbDYwWVlnZEJ3bi12c29PS0ltamdvV3oyUHJpNXpqLVJjWnhIZjRLMXFKLXBXWW14ZnVhNFJlLTNqNkdXVXZoU3VsTzRuYm9uRXVMSWVzR3c1UjVid2dVV0xKTnJQVGh3RHNscW5EZmdHUTZFRU82TzZ1cVFBMkU1LUlGaU5DMXJfS012REdDV2xSc3J4TTFLQ3BQczZUWHJtbkVXUFJDMmhuZU80bEdwUlBNZVVDR1ZMUms5eElTdVpWbERpOTFBNWtGQWhZZmNmbUJwTdIB5gFBVV95cUxQV1NUZWRrSzhTMVFDZnQ3LWVzU0VaV0ZvZFhHdVExUk53UWU4N3JXQXoweEYyUUdmNldVUWFSVkpJSU9BVzZqeWU2NVFpTng1b3hNdzBXYlpnaUVqVVJjV1VFUXpRc05SbHhBblA4b0ZiMkl5c2gyZzJLbkduTXZuUTd3c3hQb0Y3aTc1THEtVTF4eG1KbHpSZ1c3WFhPdkhtdFpCRUo1SkU4S0lfc191QmdxUXp6X1FsZF84djJZNkF6WWloTEdldnNvUXJqSDlEOGhJWUNLQVFUR3UtOURQQnhDbmJVdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Ethereum to break out of bearish move, ETH ETFs unlikely in 2024 - FXStreet",
        "content": "Ethereum would likely sustain trading inside key range despite recent sharp movements outside it.\n\nHong Kong spot Bitcoin and Ethereum ETFs recorded a second day of very low trading volume on Thursday.\n\nBloomberg analyst James Seyffart doesn't see spot Ethereum ETFs happening until 2025.\n\nEthereum (ETH) is beginning to show signs of recovery on Thursday despite a second consecutive day of poor performance in Hong Kong's spot Ethereum ETFs. Bloomberg analyst James Seyffart has also shared that a spot Ethereum ETF may not happen in the US in 2024.\n\nRead more: Ethereum attempts comeback after Fed decision not to tamper with rates\n\nDaily digest market movers: Spot Ethereum ETFs unlikely in 2024\n\nEthereum ETFs are trending again following recent developments. Here are the latest market movers for the top altcoin:\n\nHong Kong's spot Bitcoin and Ethereum ETFs recorded another day of underwhelming performance, as their total trading volume was approximately $8.75 million. The three Ethereum ETFs managed a trading volume of about $600,000.\n\n\n\nThe low volume may be attributed to the recent crypto market dip, as investors are exercising caution. This aligns with the current ratio of the Ethereum Fear and Greed Index, which has declined significantly, dropping to 40 at the time of writing. While that signifies a neutral state, a further drop could quickly turn on the fear alert, signifying a potential bearish trend.\n\n\n\nThe low volume may be attributed to the recent crypto market dip, as investors are exercising caution. This aligns with the current ratio of the Ethereum Fear and Greed Index, which has declined significantly, dropping to 40 at the time of writing. While that signifies a neutral state, a further drop could quickly turn on the fear alert, signifying a potential bearish trend. In an interview with Altcoin Daily, Bloomberg analyst James Seyffart shared that the odds of an Ethereum ETF happening in 2024 is low, adding that an approval in 2025 looks more likely. He pointed out that a SEC approval of spot ETH ETFs in May is highly unlikely, considering there have been no positive signs.\n\n\n\n\"Our official stat is 25%. We're gonna have to lower that in the future as we are not seeing any movements,\" he said. The SEC must decide on Van Ecks' spot Ethereum ETF application on May 23.\n\nAlso read: Ethereum dips below key level as Hong Kong ETFs underperform\n\nHowever, he doesn't expect the SEC to deny ETH ETFs by going nuclear and calling them security, as it would invite a plethora of lawsuits. Instead, he expects the regulator to come up with a word salad—like leaning on weak correlations—as a reason for denial. Seyffart also noted that the outcome of the US presidential election may play a role in the final decision on ETH ETFs.\n\nETH technical analysis: Ethereum to rise within key range\n\nAfter the recent downturn that saw its price reaching $2,816 on Wednesday, Ethereum is looking likely to recover earlier losses as it's currently trading close to $3,000. While many have turned bearish following recent price movements, ETH may not sustain any decline outside the $2,852 to $3,300 range for too long.\n\nRead more: Ethereum erases weekend gains as yearlong SEC investigation comes to light\n\nETH/USDT 1-hour chart\n\nWe can also see this from the decline in Ethereum long liquidations, which sat around $34 million in the past 24 hours. Ethereum open interest (OI) has also risen slightly by 2% on Thursday, indicating traders are beginning to open positions again.\n\nAs a result, ETH's potential to decline further is unlikely. If ETH breaks past $3,029, it may rise further to cover the liquidity void of April 30.\n\nThis thesis would be invalidated if an upcoming macro event disrupts market dynamics."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQYVE4bjNXWlo3T1lWSEJIT29lNlpROTZULW1IMmU2TXdCTUZkdWR3N2pONUpmbWpxYWhicFlNQ0RNYlg2c1VLVGlsYkQ4a2RlSVNPcXVPZlhxWDlsdWd5SG9nSnNGc0VTSHpUNy1QZjJDZE5nUFZVc2RaOHJXMHdPcFdIeldPRFli0gGOAUFVX3lxTE13cjIyeEFhbjZGUmlfeTlvNVVWVm5WV2pTcjBDLUJVbG9QYjRoUkplOXRaRkZwNkpVWTVLS2pYREZGRlJRQTQyNzZXdk1IaXdVMjRJLU1IR3lQRzVjcUl5M0x0b3pWZEpJX3FaT0p1SGJTQmllREJkaVdtOVVDelhYSmlaN0NJSjZpY2ttT0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Takes Hit as Major Holder Allegedly Cashes Out - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe cryptocurrency market witnessed a significant downturn this week as Ethereum (ETH) faced a substantial drop of over 9.6% since the week began, marking its lowest values since mid-February. Currently priced at $2,950 per ETH, Tuesday saw the bulk of this decline, culminating in a weekly low of $2,817.\n\nAdvertisement\n\nETH to USD by CoinMarketCap\n\nAmid this turbulence, attention has been drawn to a suspected Ethereum Foundation address, \"0xd7,\" which reportedly sold 100 ETH for 291,267 DAI via the Cow Protocol today.\n\nThis transaction was followed by a transfer of the acquired DAI to another Ethereum Foundation address, \"0x9e.\" Notably, this suspected Ethereum Foundation address has been consistently exchanging ETH for DAI through the Cow Protocol in recent times.\n\nAdvertisement\n\nHow solid is that foundation?\n\nThe Ethereum Foundation is a nonprofit organization dedicated to the advancement of Ethereum and related technologies. According to reports from Arkham, the known accounts of the Foundation currently boast 310,867 ETH, valued at $915.15 million.\n\nExcluding exchanges and select projects, the foundation stands as one of the largest altcoin holders, with assets estimated to exceed $1 billion, encompassing holdings in WETH.E worth $91.87 million, along with 329,239 DAI — some of which arrived in foundation addresses today.\n\nThe revelation of one of the foundation's key holders offloading a portion of their ETH holdings has sparked speculation regarding its potential impact on Ethereum's future trajectory. The implications of such actions on the price of main altcoin remain uncertain, leaving investors and enthusiasts with unanswered questions."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOTTVHcnZPVTUzLXM2S2I1QlR6eTB1X25TUlAtSDMwX1BnTV93cG1Uc3MwU3NORHlCWlZ4SERSTGxtaUNjX0hpZTU1YXZJdThabldLdm13LVJVQ1RpbU5BVWRtZ1pHVGltOU9KQ2MtSUswN2Y5TkxJOVdYREwxVEtmZDhIV2ZOWGtSaWRYOFlxRkRJdjZ5c01z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Surged Today - The Motley Fool",
        "content": "Risk assets across the board got a boost from the Fed, with these three tokens seeing market-beating upside.\n\nThe cryptocurrency sector is getting a nice boost today from yesterday's commentary from Federal Reserve Chairman Jerome Powell. The market received a jolt from Powell's commentary in a press release; he suggested the direction of the next Fed move will most likely be lower. The market had previously priced in some chance of an interest rate hike, which appears to be off the table, at least for now.\n\nWith a more accommodative monetary policy environment likely ahead, risk assets across the curve saw a big boost over the past 24 hours. Of course, the further out on the risk curve investors go, the more protracted this move can be. For top cryptos Bitcoin (BTC -3.28%), Ethereum (ETH -2.30%), and Dogecoin (DOGE -7.20%), it's meant a 24-hour move of 3.8%, 2.2%, and 4%, respectively, as of 4 p.m. ET Thursday.\n\nAdditionally, there are some token-specific factors at play with these three tokens that investors appear to be pricing in today. Let's dive into what's moving these closely watched digital assets.\n\nThe rally continues\n\nSince hitting a new all-time high right around the time of its most recent halving, Bitcoin's rally has faltered. Expectations for a potential continuation of this fall had taken hold because of economic factors that could affect the world's largest cryptocurrency.\n\nBut with interest rate hikes seemingly off the table, analysts have grown increasingly bullish on Bitcoin over the near and medium term. Lower interest rates should bring the U.S. dollar down, inflating the price of various commodities and goods that act as stores of value. For those who buy into this thesis for Bitcoin, that's a great thing. Indeed, yesterday's press conference likely had the greatest impact on Bitcoin for this very reason.\n\nEthereum's status as a commodity or store of value of sorts is also debatable. In second position in terms of market capitalization in this sector, Ethereum should benefit from a similar trend of capital flowing into cryptocurrencies that Bitcoin investors have benefited from. That's because the market is still expecting the Securities and Exchange Commission to approve spot Ethereum ETFs at some point (though some suggest it's possible the SEC could still deem this asset a security), which should improve the supply and demand dynamics around this token. As Ethereum has shifted to a proof-of-stake protocol and taken on some deflationary measures for its token, there's a strong bull case building in the market that the same drivers that took Bitcoin on its run to record highs could be in play for Ethereum this year.\n\nDogecoin remains among the most speculative crypto assets out there, meaning it's a top choice for traders and investors looking to play short-term price swings in the market. It's no surprise that Dogecoin has seen a more pronounced move than its larger peers, for this reason alone. However, large liquidation data tied to a previous decline in these three tokens in recent days could also play a part in today's rally. Investors appear to have been looking for any reason to load up on risk and put capital to work on this dip. This recent macro catalyst appears to have provided the needed push.\n\nIs this rally poised to continue?\n\nToday's move needs to be put into context. Bitcoin declined to a low of around $58,000 per token yesterday, and while it's moving toward the $60,000 mark at the time of writing, that's still well off its all-time high of around $73,000 hit earlier this year. So, there's certainly both upside and downside potential in the near term, as this token did gap up quite quickly in short order.\n\nOther cryptocurrencies like Ethereum and Dogecoin tend to follow Bitcoin's lead, so I'd say this is the token most investors should be focused on right now. I'm of the view that if a number of bullish catalysts materialize in the coming days, it's entirely possible Bitcoin could make another run at a new high, and Ethereum and Dogecoin could follow. It's just a question of whether this specific macro catalyst can be amplified by some additional news. Right now, there's not much on my radar, so I'm going to sit out this recent pop."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQZGc1d01uaVJkWk1ySHJsRTA3LU10S1RoQmlyd3I2T2hXd09JMjNNVUZ2ckRkdEktMVBZQjIxczdlRlNKT3JRVnB5WGt3SzVMaW9NcElBOEJqYTBobGN4R0NuX1VBalh4UHY1UlNNTkx0WXk0bDlNVXY1dGtqZkU2QmlldVVkZExXV1Q0bWozOUE2aERD0gGaAUFVX3lxTE5pNGF0MHUtZlVmZ255T2haWTNLWmRSQmlESWhGODM0R18wQnprSmtiZGI4RjFqVkw2TDNzVjQydFhGM1JzOThoMWN4RUt0MkR3cnhkeEpvN3F6QlRTcEJ2d3FMU2MwSll6M3JQSHB3Yk5NaTJ5Tk5sTWszZmdmTUVRb2R4bmZYQzZYMEVSRVFyS21nanFIa2RzTHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Dormant Ethereum Whale Awakens After 8.8 Years, Here's How Much ETH They Hold - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nProminent cryptocurrency tracker Whale Alert has published a post on the X platform about a recently awakened crypto whale. This wallet contains millions worth of Ethereum.\n\nThis premined whale had spent almost nine years in dormancy – this means since 2015, the year that followed the end of the Ethereum initial coin offering (ICO).\n\nThe reactivated wallet contains almost 2,000 ETH worth $5,876,786.\n\n💤 A dormant pre-mine address containing 1,969 #ETH (5,876,786 USD) has just been activated after 8.8 years!https://t.co/MzyVVkMhIc — Whale Alert (@whale_alert) May 2, 2024\n\nEthereum Foundation dumps ICO ETH\n\nPrior to this awakening, an ancient wallet that belongs to the Ethereum Foundation was reactivated after nine years. The wallet transferred a massive 2,000 ETH evaluated at approximately $6.5 million. This money put into it during the period of the Ethereum ICO was moved to a new blockchain address.\n\nAdvertisement\n\nIn the past, the market has reacted negatively when the Ethereum Foundation has released large amounts of Ethereum. This is not the only sale made by this prominent entity observed by market participants this week. Earlier today, it was reported that another wallet linked to the foundation sold 100 ETH for 291,267 DAI via the Cow Protocol.\n\nEthereum whale activity soars high\n\nThis awakening of an ancient whale took place after the overall activity of Ethereum whales demonstrated the largest growth in addresses over the past year. Approximately 139,560 new ETH wallets were created on a single day – April 29, according to cryptocurrency trader and analyst Ali Martinez.\n\nEarlier this week, the second-largest cryptocurrency saw a tremendous decline of 12.16%, falling from $3,243 to the $2,960 zone. It was followed by a small rebound of 3.87%. This discount provided a great opportunity to buy the dip, and traders immediately took advantage of this, setting up almost 140,000 new wallets, expanding the network.\n\nProminent crypto analyst Michael van de Poppe has just tweeted that he expects Ethereum may go down to the $2,500 zone “for the most optimal play.” However, he does not believe that crypto markets are likely to be in for such a heavy correction. “Most of the downside is already in,” he added."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQbUx2b3RSd3V1TGZCa3puV293TEFwa2hPbTJtajVQaGlCMXhFQUpSOVVkV3FiNnFGek92eGRyUlhDT09KQmEzSVNvWUVnY1NUbVAzZHJFNVN1NzN3bkVYMXdxQ29vTl91VlozNThYaktuLU1Qc1NkLVRQZktaRXlOeXFrUTZLaHcydXR2bl9TX0M1MTTSAZgBQVVfeXFMUFJadEhWLUxlVk5WUnlWcWlDcktHX0RZUGNIaU5aODBvMDBHLV9ieU01MzlMYlZRWTdsaUpGbU5OTlYwTDU5SHlkSHVNaHJmaklVTk5GQUcweTJkRloyS1BScnFtSXUtSkM2YVhmNHZnY2R6QmV5a0l6aFV3REtCN2FGTWlPUEd5WTA4S0l2YXBNbjhKdTVNV18?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Ethereum Price: Whales Move 36K ETH As Price Regains Momentum, What’s Next? - CoinGape",
        "content": "Despite a weekly pullback in Ethereum’s price trajectory, the world’s second-largest crypto by global market cap has once again sparked substantial investor attention. Today, on May 3, Ethereum’s price not only regained an upward momentum but also surpassed the significant $3K mark, a positive development that has reinvigorated the market, instilling a sense of optimism among investors.\n\nThis upward trend, coupled with a considerable spike in whale activity, has ignited a flurry of interest surrounding the token’s future price movements. Nearly 36,000 ETH was shifted over the past day, with whales dumping and buying and buying the so-called ‘eternal Solana rival’ token in hand.\n\nadvertisement\n\nETH Whale Activity: A Closer Look\n\nInsights from on-chain analysis platforms reveal that a total of 36,762 ETH was moved in the past day. Notably, whale 0xf83c… made a significant move by transferring 25,772 ETH to Coinbase Institutional, a prominent player in the crypto industry. In contrast, whale 0x0b4… acquired 10,990 ETH from Coinbase during the same period, showcasing contrasting strategies.\n\nThese transactions, coming in tandem with Ethereum’s recent turbulent price action, have ignited mixed sentiments within the broader crypto market. While one whale continued to buy the token amid a broader market dip, the other whale dumped colossal amounts of the same token, underscoring a bearish sentiment amid ETH’s status as a security saga.\n\nNonetheless, the price trajectory’s upward movement at press time skewed the scale more toward the optimistic side.\n\nAlso Read: Jack Dorsey’s Block Boosts Its Bitcoin Bet With 10% Gain Reinvestment\n\nETH Price Jumps\n\nAs of writing, Ethereum’s price jumped 3.08% in the past 24 hours and currently sits at $3.001. The token witnesses a high price flux movement at the $3K mark, with its monthly charts illustrating a consolidatory phase.\n\nCrypto market enthusiasts continue to extensively eye the token for further price action shifts as the security lawsuit and a post-BTC halving rally remain poised to impact the token’s market dynamics.\n\nIt’s worth noting that XRP, a Ripple Labs-backed token, has been on a sluggish price trajectory ever since it entered a legal tussle with the U.S. SEC. On the other hand, a post-halving rally usually pushes a parabolic uptrend in altcoins as well, historical data suggests, although it’s not always a guarantee of future price movements.\n\nAlso Read: Michael Saylor Attacks Ethereum Calling It A Security, Disapproves spot ETF\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxPVjFGY3ZCeGFzT2ZSVWxnVnJoTHByUVZyd2I2SFJYSGM2Mng4Z1pUVThDTFFPWkVGaDVXQURJMjk3UWhreWZDQy14VWRpWFdOWWFwM01kQlcwZzYyc09PT1pVamdyU0dUWWl2bEZIamdqSFFlV1F4a2x6UV9oMUxCd2tVYWpSajlRT2RNMEdURHpjNl9tX180Y0xZYng4aEktSG5hMlZibUNHQW9qbW8yNWxUR1QwZ1pnZUJRSnFoeFRybWxqamxlbnFBdGJmQ1o5RDB0WEd4YlJGblFLczFqNDRvdHR4bzNlMFFLdFVMVk1lMkhsWmo2Yjh30gH_AUFVX3lxTE8tbmlhT0d3MUFOQWg2Y28wZVI1RmI3SVY5SjRPUXlTUkJrLVhKMFhQYmFQQXRJM0VET1lUUjdnd19GS1p4MEstVEFuVld1Ul9temN5Y0UwR01WdTY2Z3d2b1FGMzJfakZTemlVUG0yTkYya1RYaFBPaUFmTnY4XzNuTmpsUFM3cWNXOFVidGdPODlyQ2REUG93S3BEakxYY01XMFh5M0hTeGJheG1hZTEwTlF1cjdPcDNKM3FBaUt6czZhWEJIQ0YwUGw0MW9PM0sweGprN2hzaDYzY05WT2d2R19VanNtSU9QSlA3WTV3eENyZGVYVDZoWFZWcU82dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Altcoins to pump once BTC bottoms out, slow grind up for now - FXStreet",
        "content": "Bitcoin price reclaiming above $59,200 would hint that BTC has already bottomed out, setting the tone for a run north.\n\nEthereum price holding above $2,900 keeps a bullish reversal pattern viable despite falling momentum.\n\nRipple price coils up for a move north as XRP bulls defend $0.5000\n\nBitcoin (BTC) price slipped below $60,000 on Wednesday as markets tried to front-run the Federal Open Market Committee (FOMC) meeting.\n\nIn the mid-April meeting, the Fed alleged new uncertainty concerning whether it could cut rates later this year because of inflation data from the previous quarter. This had markets anticipate a rate hike, causing Bitcoin price to dump, going as low as the $56K range.\n\nIn a surprising twist on Wednesday, however, the Fed decided to keep rates unchanged, with the improved sentiment sending BTC back into the $58,000 range.\n\nThe sentiment has extended to Ethereum (ETH) and Ripple (XRP) prices as they continue to hold above key support levels.\n\nAlso Read: Relief wave on altcoins likely as Bitcoin price shows a $5,000 range\n\nKey level to watch as Bitcoin price slowly grinds up\n\nBitcoin price drop on Wednesday saw it draw close to testing the Bull Market Support Band at $55,831. However, dovish news from the FOMC may have turned around fortunes as the BTC price is slowly grinding up. If the bulls can manage to haul BTC back above the $59,200 level, it could solidify the recovery, effectively meaning that BTC has bottomed out at $56,552.\n\nIn the meantime, Bitcoin price remains in the woods amid falling momentum and growing bearish sentiment, as shown by the Relative Strength Index (RSI) and the Awesome Oscillator (AO) momentum indicators.\n\nIf the Bull Market Support band fails to hold as support, Bitcoin price could extend the fall toward the $52,000 threshold, or in a dire case, test the $50,000 psychological level.\n\nBTC/USDT 1-week chart\n\nConversely, with the RSI holding well above the mean level of 50, and the AO still in positive territory, all hope is not lost for BTC bulls. And while a flip of $59,200 into support would solidify a recovery rally, the bearish thesis will only be invalidated once BTC breaks and closes above $72,000.\n\nAlso Read: Bitcoin price reclaims $59K as Fed leaves rates unchanged\n\nEthereum price still flirts with 25% upside potential\n\nEthereum price is consolidating within a falling wedge pattern. This bullish pattern will be executed after a decisive breakout above the upper trendline in the one-day timeframe.\n\nThe target objective for this pattern is a 25% move toward $4,250, determined by measuring the height of the wedge and superimposing it at the expected breakout point. The descending wedge pattern remains viable, given that the Ethereum price continues to hold above $2,900 in the 12-hour timeframe.\n\nETH/USDT 12-hour chart\n\nOn the other hand, with the lower highs of the RSI, the bears could have their way, sending Ethereum price below the $2,900 buyer congestion level. Such a move would not only negate the bullish reversal pattern but also encourage more sell orders.\n\nTraders looking to open long positions for ETH should wait for the RSI to reclaim above 50 mean level, a move that could be accompanied by a bounce of Ethereum price above the lower boundary of the pattern. A 12-hour candlestick close above $3,212 would provide a good entry.\n\nAlso Read: Ethereum attempts recovery from dip amid unchanged interest rates and accusations leveled at SEC Chair\n\nRipple price defends against further downside\n\nRipple price could pivot around $0.4952, marked by the 50% Fibonacci placeholder, as XRP bulls show commitment to defend the $0.5000 threshold. The RSI has managed to record higher lows in the one-day timeframe, which points to growing bullish momentum.\n\nIncreased buying pressure could see the XRP price bounce with the prospect of reclaiming the $0.5715 peak of the range. In a highly bullish case, the gains could be seen in the rippling price foray above $0.6000, which is almost 17% above current levels.\n\nXRP/USDT 1-day chart\n\nOn the flip side, if the 50% Fibonacci placeholder fails to hold as a support, the Ripple price could drop. A candlestick close below $0.4782 would produce a lower low, hinting at a possible trend reversal.\n\nSpooked holders would then pull the trigger, sending Ripple price below the $0.4500, or in a dire case, roll over to $0.4188. This would mean a fall of nearly 20% below current levels.\n\nAlso Read: XRP sustains above $0.50 as traders digest news of Ripple XRP Ledger entry in the Japanese market."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQVUJFVUFEUmVwWUJCUE5BVTJSOHRvZkg0RjdnTUhoZzJ2amd1dkc4RTlOTGFzQVJiVVRMSjJNTldad1VFa0o4YVhwZWQ3Qms3SVZ2aE9XWWJ4R3JEWlFPUENmRnpHd2E1ZVZ3U1hzQjk4SVhPQkJxcTRVcDZzTldHczhqY0p5cnlKOHlFbUM4cWdKa1dDb0lPVVp3TG04eG5WWEJpUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Ethereum: The rush of crypto investors continues despite the price drop - Cointribune EN",
        "content": "Fri 03 May 2024 ▪ 3 min read ▪ by Fenelon L.\n\nAs the price of Ethereum continues its decline, dipping below the $3,000 mark, investors’ interest in the second-largest crypto remains strong. What are the factors that attract investors to ETH despite the price drop?\n\nEthereum falls, but investors keep flowing in\n\nDespite a 3% loss in 24 hours and a drop below $3,000, the Ethereum network exhibits an unprecedented dynamic. According to Santiment, the 28th and 29th of April saw the creation of 266.6 million new wallets, setting a record since October 2022.\n\nThis massive influx of new users reflects a strong confidence in the long-term potential of ETH, beyond short-term volatility. “The expansion of the network is a key indicator of crypto adoption,” emphasizes John Smith, an analyst at Santiment.\n\nAn in-depth analysis of Santiment data shows that retail investors have particularly taken advantage of the price correction to enter the market. Addresses holding between 0 and 0.1 ETH have increased significantly, while those with more than 1 ETH have scaled back their positions.\n\nThis trend indicates a keen interest from individuals in ETH, whose capital inflows could support a short-term rebound. Many of these new investors are likely attracted by the returns of ETH staking.\n\nStaking, an attractive yield in bearish times\n\nThe rise of staking on Ethereum entices more and more investors who seek to stake their ETH to generate attractive returns. According to Glassnode data, the total ETH staked has reached 44.24 million, representing 36% of the circulating supply.\n\nMeanwhile, the ETH supply on exchanges continues to decline, to 12.79 million tokens, about 10% of the total. “Many prefer to stake their ETH to earn returns rather than leave them lying dormant on exchanges,” analyzes Wilson.\n\nThe Ethereum is going through a rough patch, but its network has never seemed as robust. The massive arrival of new users enticed by the yields of staking heralds a bright future for ETH, despite market fluctuations.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQOVZkelNTNXpDT2JjSTZuYnk2OF85QngzeXBQMXBfWnB0OEJ2Nlp0S2pwMlZOaWphYU9BQTVBYUtHSkZ1NVRITFRsVFhLbUhuTHV3MktVVW9sM0JCaVl5WnpBVkVUZFhsc0hxM2ExMDRDaVlZOEgzUnM1UmRrNWRGcl9pZFpoN3RrYmZPMEwxTVFaa1BreXZr0gGcAUFVX3lxTE9HYnNVenNJR0dmdTd4QlczV1g0ZlhCczBnaFZuS19oYXNyQlh3c2xHTFZ3dTh3VUpZWnBsNjEzSGgwT2FyS1hsYzJHNUtwTVMxS0c1WENfdXBfWDFwLS1uS0FwM2V3M3JkLXlneHFWMExYQmlQamFnRnJzUGpBaHdzQzFPWGVsTEFoalJEcXh2V2xHbDFGVXZ1WXh5TA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum: Exchange inflows spikes - FXStreet",
        "content": "During significant pullbacks in cryptocurrencies, there is often a fear of further weakness in specific coins, leading to increased transactions from private wallets to exchanges. This trend is particularly evident when inflows to exchanges spike, a sign that pessimism may be reaching late stages in the current market cycle. For example, with Ethereum, we're seeing exactly this pattern: as the price declines, exchange flows have notably increased on the spot market, indicating that traders are concerned about potential further drops.\n\nThis scenario, however, could signal a potential turning point. Market sentiment often shifts from pessimism to optimism and vice versa, and when sentiment reaches an extreme, it's wise to be on the lookout for a possible reversal. Currently, it seems Ethereum might stabilize in the coming days or perhaps into next week.\n\nHowever, it's interesting to note the contrast with Bitcoin. Exchange inflows for Bitcoin haven't reached the same extremes, suggesting that investors may have more confidence in Bitcoin’s long-term stability compared to altcoins. This disparity could indicate that investors believe the altcoin season might be over, preferring to hold Bitcoin for the longer term.\n\nGet Full Access To Our Premium Elliott Wave Analysis For 14 Days. Click here."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPSzZGV0RQVVIwT3RlVFEyT2djS1l3NmsyNDFoRm5ra1FFVEowcTFBWWFfc0JvZXByRUNDSTZ6Y19HcFlMNEdFM2dEZjMyU2V3dW5lZ0ZJT29Tdl9ubjdSWHduMnBHUklZZFBmaDY2d2V6WEFkRHlQYno2d1kyYU41UEFjT3F1MVl6RTZmb2QzOHd5RE94WlFfYmU2enh5SE9pTk5QRA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum Records 267K New Wallets, the Highest in Nearly 2 Years - The Crypto Basic",
        "content": "Despite the ongoing price dip, Ethereum sees record wallet growth with 267K new addresses on April 28 and 29, the highest since October 2022.\n\nEthereum has witnessed a significant spike in new wallets hosted on the network, marking a notable resurgence in interest amidst a general market downturn.\n\nAccording to data shared by Santiment, a blockchain analytics firm, nearly 267,000 new Ethereum wallets were set up on April 28 and 29. This is the largest two-day increase observed since early October 2022, suggesting a robust expansion of the Ethereum network. This growth occurs in contrast to Ethereum’s recent price dip.\n\n📈 #Ethereum saw a milestone as April came to an end. 266.6K new wallets were created on April 28th and 29th, the highest 2-day stretch of network growth since October 8th and 9th, 2022. It is a strong that $ETH continues expanding despite dipping prices. https://t.co/SN6xqc3JXV pic.twitter.com/KDcjhY30y5 — Santiment (@santimentfeed) May 1, 2024\n\n- Advertisement -\n\nDespite the economic uncertainties and fluctuating market conditions, Ethereum continues to attract a diverse array of users. This surge in new wallets could potentially be linked to ongoing developments, such as improvements in scalability and security through its continued upgrades.\n\nAnother analysis by CoinMarketCap reveals an uneven spread of Ethereum across different addresses. The vast majority of Ethereum addresses, approximately 97.49%, hold between $0 and $1,000 worth of the cryptocurrency.\n\nOnly a small fraction, 2.40%, hold between $1,000 and $100,000, with the remaining 0.10% of addresses holding over $100,000 in Ethereum. This data indicates that while a few hold large amounts of Ethereum, most users possess relatively small balances.\n\nWhale Movements and Influence\n\nDespite their limited numbers, Ethereum whales control a substantial portion of the total holdings. According to data from Clank, a whale tracking platform, whales hold about 40.75% of Ethereum’s total circulating supply. These large holders play a role in Ethereum’s market dynamics, capable of influencing price movements significantly.\n\n- Advertisement -\n\nClank’s data further shows that the average holdings of these whales amount to 9,839,698 ETH, valued at $3.66 million. This sizable influence is also evident in the “Whale of the Day” transaction within Binance, where an internal transfer of over $45 million worth of Ethereum occurred.\n\nHolding Patterns Among Ethereum Investors\n\nThe holding time for Ethereum varies significantly among different addresses. According to the latest data, a large majority, 74.43%, are long-term holders, which reflects a strong confidence in the potential future value of Ethereum.\n\nMedium-term holders, or “Cruisers,” make up 21.31%, while only a small percentage, 4.26%, are classified as “Traders” who hold their positions for shorter durations.\n\nDespite a price decline of 3.80% over the last week, Ethereum is still performing relatively well compared to the broader cryptocurrency market, which saw an average decline of 8.80%. As of today, the price of ETH stands at $2,992, with a total market capitalization of $355.6 billion."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPNG9sbjBOcTJzbkdwYVQtaVJFS1N6Um83LTFyOVRGMWhnbWNiaG95N2ZFUVA3bjBfTVl4SmdIM0JrTk4wNGpoejJ4d1QxR3M4eDdhc2EteXZMOEVCZ2Jpd0oyRXhpVTZTX19tU1lrVzdGSENjMmFnS3lJNUlHQ0VNeUNVd1haYU1KSFV0VnlJMXZuSjJNWDBvVmlVb09qR1FRQVktV3NkclRpUE05NUtlTEZkc2tsU1hF0gG-AUFVX3lxTE56LVpBX2M2SUkwYkRGN0tjbmRBWUprNzZ2RmxDY0FUNFdsRFVXay0tUkYwbmU4RHVMcVFuQkNSdnRmX3dMWWpvMmtDT1AzYW9ydDBMdjVuYnBTc1pOMXFFVFNNc2lhMWFkeDZTaDdsb3QyMXpYRVBYdUFEcmp6WGxfb3FnczhlMF9qeGlWeUJUUC1VNE5OTElJRGg0SDNiNTJra2RabmZLc3pJcXdVaFE0NUowS3I0VXlHRFo3QWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Bitcoin’s downtrend, Solana and Ethereum form double bottom - FXStreet",
        "content": "Market picture\n\nCrypto market capitalisation rose 3.3% in 24 hours to $2.22 trillion. Local capitalisation bottomed near $2.10 trillion, confirming a sequence of declining local lows (2.3 in March, 2.25 in April) and highs (2.76 in mid-March, 2.67 in early April and 2.46 in late April).\n\n\n\nEthereum and Solana are adding from the area of the April lows and forming a double bottom. This is a positive but not too reliable signal, as Bitcoin has been in a downtrend throughout April.\n\n\n\nAfter the halving, it is logical to expect miners to increase sales from inventory, to invest in new capacity or to lock in profits. Also, the hype around spot Bitcoin ETFs is going away, which reinforces selling by speculators.\n\n\n\nAssuming Bitcoin stays within the global growth cycle starting in 2023, we should expect further price declines in the coming weeks. The nearest likely target looks to be the $51-52K area, where growth was paused in February and where the 200-day MA will be pulled up by the end of the month.\n\nNews background\n\nSoSoValue notes that outflows for $563.8 million from spot bitcoin-ETFs on 1st May reached their highest since product approval. Bloomberg noted the formation of IBIT and FBTC price discounts relative to net asset value (NAV).\n\n\n\nBlackRock believes that financial institutions, including pension, endowment, and sovereign wealth funds, will enter the ETF market in the coming months.\n\n\n\nVanEck calculated that the aggregate value of Bitcoin in the wallets of governments and companies is $175bn. That’s about 15% of the total BTC capitalisation.\n\n\n\nBitfinex said that Bitcoin options traders are preparing for a summer lull in the market. Summer is usually a period of low volatility in the crypto market. Cube.Exchange, on the other hand, pointed to the likelihood of increased price fluctuations in the summer against a background of low liquidity.\n\n\n\nToncoin (TON) resumed growth after a correction amid an investment from venture capital firm Pantera Capital with over $5bn in assets under management. ‘We believe TON has the potential to bring crypto to the masses as it is widely used in the Telegram ecosystem’, Pantera noted.\n\n\n\nOn 2nd May, TON developers announced the platform’s integration with the on-chain analytics service Arkham Intelligence. On 1st May, integration with the cross-chain platform Layerswap was implemented, which, according to its representative, will make it possible ‘to send USDC from any network and receive USDT on the TON blockchain’."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPVWRqa2hNRHlnVUtMSzEzNXRGU1RpWG1EMXotMWc1RW1pZUpGRWV3SXVrZFQ0RjUzbUVORTBlSzNJcTMwVWdndVlSN2lYUDJHTjdQQ1BDTGI3OUMzTHd6ajFDVmhkMHNwZ3NGZ01CNlZ5dEhpNGcxODhFZElSZURvRHRkOVliTXA5dHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Ethereum Witnesses Its Biggest Network Growth; THORChain and KangaMoon Dominate the Altcoin Space - The Cryptonomist",
        "content": "SPONSORED POST*\n\nEthereum (ETH) is witnessing extraordinary network growth, representing a landmark development. Simultaneously, altcoins such as THORChain (RUNE) or KangaMoon (KANG) are gaining ground within the crypto industry. Many analysts claim that KANG, now in Stage 5 of its presale, is the next $1 altcoin in 2024.\n\nEthereum (ETH): Outstanding Network Growth\n\nEthereum (ETH) has recently made headlines in the crypto market. According to crypto analyst Ali Martinez, this altcoin has witnessed its biggest network growth in the past 12 months. Notably, Glassnode shows that around 139,560 new ETH addresses were created on April 29.\n\nEthereum’s price movement saw a jump of 62% in the past year alone, with a market cap of $356B. Moreover, the Ethereum crypto is now trading above its 100—and 200-day EMAs, while nine technical indicators are flashing green. Because of this, experts predict that Ethereum will soar to $3,775 before Q2 of 2024 ends.\n\nTHORChain (RUNE): Over $10B in Trading Volume\n\nMeanwhile, THORChain (RUNE) has also made some waves in this space. For instance, THORChain announced that March 2024 was the first month with over $10B in trading volume. This milestone is significant as it shows the level of attention that this altcoin is getting.\n\nThe THORChain price surged 280% on the YTD chart, and its market cap rose to $1.65B. Furthermore, the THORChain coin is trading above its 100—and 200-day EMAs. As its RSI sits at 60, experts remain bullish. They foresee RUNE reaching a value of $6 within Q2 of 2024, making it one of the altcoins to watch.\n\nKangaMoon (KANG): An Upcoming Member of the Top 10 Altcoins\n\nKangaMoon (KANG) is rapidly gaining popularity as an altcoin. Many traders are drawn to it thanks to its stellar presale performance. For example, KangaMoon has obtained over $6M, with projections of it reaching $7M before May 2024 ends. Additionally, 20,000 registered community members and 6,000 holders of this altcoin.\n\nThe Play-to-Earn (P2E) gaming industry is expected to hit $885M in 2028, which presents a good opportunity for KangaMoon. Because of this, it will create a P2E game where gamers will use the KANG token as an in-game currency. In other words, gamers can use this altcoin to buy in-game items, access challenges for extra tokens, and more.\n\nKangaMoon also focuses on its community. For example, KangaMoon is now awarding its most active community members free KANG before the presale ends. Thus, traders rush to like and share KangaMoon’s social media posts to earn this altcoin for free.\n\nKANG is now in Stage 5 of its presale and is worth just $0.0196 – a 290% pump from its starting price of $0.005. However, experts are bullish about KANG since it is so early in its development. They forecast a pump to $1 once a Tier-1 CEX lists KANG in Q2 of 2024. With this price prediction, KANG emerges as one of the best altcoins to buy.\n\nWill KangaMoon Provide Faster Returns Than Ethereum and THORChain?\n\nAt a low $19.6M market cap, KangaMoon might bring faster returns than Ethereum or THORChain. This is because it needs less new money flow to increase prices. As a result, KangaMoon could become one of the top 10 altcoins in 2024. To learn more, follow the links below and obtain a 10% bonus on every purchase.\n\nDiscover the Exciting Opportunities of the KangaMoon (KANG) Presale Today!\n\nWebsite: https://Kangamoon.com/\n\nJoin Our Telegram Community: https://t.me/Kangamoonofficial\n\n*This article was paid for. Cryptonomist did not write the article or test the platform."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOOVNLQzhuZlg1ellQOUUtTGtJZ1M4d3VEdXpsUmxJMTJzQVp6Yi1GSE5qWFJrNEJtOXdQeUFrUjFJN3JwWUVYYk9PT09yOEVnZ190NV9nT3REX3I2R3VlaW5BUG9GSXQtZ2s2SC10S2R0WTBFVHdJbzdMRFA5N0VPc3FUR0tIVk9USGFxNNIBkgFBVV95cUxQSEZUMnhrWXVqTjNYOUdvMGdqUG1EYXdqTDBMODA5Yl83NHlMVWlQNnQ0bnB0U0M2SmV2TlhJeW9TcUJ6MFRuaE1fdW9lVFhIaGNSdWFVYXJhOWV1M0pZeHlDZmU1Ukc1TzVfSmFoNlhHajdPMzZzMHN6MDdTc1Y3eFJzd2FGaV9nd0lhUjlPUFdydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum a ‘major disappointment’ – Expert delivers harsh verdict! - AMBCrypto News",
        "content": "Analysts predict peak cycle for Bitcoin and Ethereum amid regulatory uncertainty.\n\nRegulatory debates and SEC allegations intensify negative sentiment toward Ethereum.\n\nAs Bitcoin [BTC], the leading cryptocurrency, dips below the $60,000 threshold, analysts suggest that BTC may have reached its peak for this cycle.\n\nEthereum [ETH] seems to be mirroring the movements of Bitcoin, as both cryptocurrencies are currently experiencing a downward trend.\n\nCommenting on the uniqueness of this crypto cycle, crypto veteran Alex Krüger said,\n\n“The crypto cycle has been almost entirely driven by the bitcoin ETF.”\n\nHe further added,\n\n“ETH has been a major disappointment, but it has performed well overall for stakers and airdrop farmers.”\n\nWhy is Ethereum losing its limelight?\n\nUndoubtedly, Bitcoin achieved remarkable performance by reaching new record highs in this cycle. However, Ethereum’s position has declined, falling below Solana in terms of product-market fit and retail trader popularity.\n\nThis raises a question: Can Ethereum’s price plummet to $2500 within the next 7 days?\n\nWell, to answer this, AMBcrytpo analyzed the liquidation levels for ETH.\n\nAccording to the analysis, the Ethereum market has a cluster of liquidation levels between $2640 and $2750, attracting traders due to high liquidity. Additionally, this price range aligns with a bullish order block observed at the range highs, further reinforcing its significance.\n\nThis underlines that Ethereum’s price is expected to decline to this liquidity pocket before a potential reversal.\n\nThe concerns surround ETH’s classification as a security\n\nMoreover, the ongoing debate surrounding whether ETH is a security has intensified negative investor sentiment toward Ethereum.\n\nAmidst these metrics, a new development also took place wherein Rep. Patrick McHenry, the chairman of the House Financial Services Committee noted,\n\n“New court filings indicate that @SECGov Chair Gary Gensler knowingly misled Congress when pressed on the classification of #ETH at a @FinancialCmte hearing to conduct oversight of his agency.”\n\nThis highlights the increasing uncertainty surrounding Ethereum’s regulatory status and its impact on investor sentiment.\n\nEchoing similar sentiments, @TheDustyBC, a content creator, took to X (Formerly Twitter) and said,\n\n“Ethereum not being kind on the feelings today.”\n\nWay forward\n\nHowever, now with the hawkish stance at the Federal Open Market Committee (FOMC) meeting on the 1st of May. And, the Hong Kong ETFs being a major disappointment, the execs are still waiting for the tables to turn. Needless to say, Krüger claims,"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQQlFIZWpxeVZISl94X3IxeFU1M2lpaUhyOGN3a0lLRDNRbTVGaU5NY2Qybi1JUVlRX1VWU1ZTeTdKYS1YRjNPVHFYRWVGUFJkM3FTZW1KODhuXzZmMmlmNElQYnRnVXVScUhfRllxcEhuUlFieWJfLVdLQzQxSWhEczViblpTSHZweHY4U185aWxxNDJRUnNoNUJCTmV5N1hXNnpBVlBoYl_SAa4BQVVfeXFMT0pLOXNYN0FleEx1MVV3TzU0QXRFV3RVcDRXVmI5VWpHcVM3aWNkY1VXVDJMU1Q4ellsVGxVX1MtQllHc0tjVnVvMUhHZ0IwbjhsUThxQ0xueUI3ZnF2OE5ldkZFYS1yNWNNOWpSaV9xb2JyZlZrS0xSWUVMYlByOE1hN0xoYmtEc1ViNUgxQkQ1VVd5RlFnNWQ3M3FjVTNKTTBHbnpRWE5yeTVwNVln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 2: Bitcoin At $57K, Ethereum Continues Decline, Solana Recovers - CoinGape",
        "content": "The top crypto prices today witnessed continued declines as the Bitcoin (BTC) price plunged to the $57,000 level. In addition, the Ethereum (ETH) price geared up for a dip below the $2,900 mark, losing hold on a crucial level. However, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) rebounded significantly, defying the bearish turn.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price plunged by 4.43% reaching $57,419.91 at the time of writing on Thursday, May 2. On the other hand, it’s trading volume soared 30.72% to $49.54 billion in the last 24 hours. Whilst, the crypto’s market capitalization slipped to $1.13 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price lost 2.86% to $2,912.84 at press time with a market valuation of $355.33 billion. Whilst, ETH saw its trading volume surge 12.01%, reaching $20.16 billion.\n\n3. Solana Price\n\nThe Solana price rebounded and inched closer to the the $130 mark today. The Solana price gained 2.75%, settling at $129.31. In addition, SOL witnessed a 19.65% surge in trade volume to $4.16 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price surged past the $0.51 level. The XRP price recorded a gain of 1.75%, reaching $0.5113. On the other hand, XRP’s trading volume spiked 30.32% to $1.78 billion.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price was up 0.66% to $0.4445 today. Whilst, ADA recorded a hike of 28.11% in its 24-hour trading volume, settling at $533.30 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price slipped 5.41% to $0.125 while its rival, Shiba Inu price was down by 1.98% and traded at $0.00002168.\n\nAlso Read: Crypto Market Recovery? US Treasury Announces $125M Refunding, Buyback Plan\n\nTop Crypto Gainers Today\n\nAxelar (AXL): The Axelar crypto surged 8.11% and traded at $1.17.\n\nThe Axelar crypto surged 8.11% and traded at $1.17. Polkadot (DOT): The DOT crypto price rallied 5.22% to $6.86.\n\nThe DOT crypto price rallied 5.22% to $6.86. EOS (EOS): The EOS crypto price was up 3.33% and was valued at $0.7813.\n\nThe EOS crypto price was up 3.33% and was valued at $0.7813. Optimism (OP): The TRX crypto price rose 2.97% to $2.66.\n\nTop Crypto Losers Today\n\nHelium (HNT): The HNT price plummeted 7.84% to $4.95.\n\nThe HNT price plummeted 7.84% to $4.95. Toncoin (TON): The Toncoin price plunged 6.60% to $4.72.\n\nThe Toncoin price plunged 6.60% to $4.72. Cronos (CRO): The CRO crypto slumped 6.28% to $0.1233.\n\nThe CRO crypto slumped 6.28% to $0.1233. Sei (SEI): The Sei price witnessed a dip of $0.5098 to 6.02%.\n\nDespite the bearish turn, Solana, Dogwifhat, and Pepe made it to the top gainers list today. However, millions worth of crypto liquidations were noted in the past 24 hours, which could have expedited the latest crash for BTC and ETH. According to Coinglass, Bitcoin alone witnessed $145.55 million liquidations in the last 24 hours. Out of this, $109.13 million has been attributed to longs.\n\nAlso Read: 3 Trending Altcoins To Buy Making You Rich In 2024 Bull Run\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPb0FISlhmbkJkQ2FiVDJPZ2NSRFVXVDlxLVBJamhtNDNKd0l6MXJ2eHdNR2R1dkNBbkNDOVpUaHl5TmhUNUFTTkRzNUEtSzMwQ0MtRGRoMlJGTE1LeHF5ZWRVYmVjSTdTa1FONkNEYl9aY2k2b0NHRk9PMDhIUnJGZ3pvRXpwOVB5dEViX3lhemU3UdIBlwFBVV95cUxPTmQ0SklpTlNDTFZ0SF9UdFRqdi1RU0MxeG1zYjhmckVKcFd0QTB1WXZQYmlrT1I5UjNDSFpCUzk5czJmOE9JU1BqSWl1Smo1ck5BcUh6amZRUEJKclo2QkhNVWxrdUViSjZNU3ZxcHF1RDV5NU9NSE51d3NQZXZQXzhwLVQ4emY0TlJLUE5LX2V2c1dpUUdN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum face $2.3 billion Options Expiry – What comes after? - AMBCrypto News",
        "content": "BTC and ETH traded below their maximum pain points, suggesting that traders might face severe losses\n\nImplied Volatility dropped, implying a lack of bullish expectations going forward\n\nBitcoin [BTC] and Ethereum [ETH] options contracts worth about $2.3 billion are set to expire on Friday, 3 May. According to Deribit Exchange, the Bitcoin options are valued at $1.35 billion. ETH contracts, on the other hand, are worth $990 million. The value of these contracts seems to be lower than the figure AMBCrypto reported last week – $9.3 billion.\n\nThe decline could be attributed to the price action of both cryptocurrencies. For most of the week, BTC and ETH recorded severe declines before recent appreciation. As a result, traders have been cautious about opening more positions.\n\nAt the time of writing, Bitcoin’s put/call ratio (PCR) was 0.50. This ratio gauges the overall market mood. A PCR higher than 1 suggests that traders are buying more puts than calls— A sign of bearish sentiment.\n\nAnarchy looms as traders gear up for results\n\nHowever, if the PCR is lower than 0.70, it implies more calls than puts, meaning that the broader sentiment is bullish. Simply put, the reading suggests that traders expect Bitcoin to end the week stronger than how it started.\n\nFor Bitcoin, the maximum pain point was $61,000 on the charts. This means that if Bitcoin drops to this price, most options traders will suffer intense losses.\n\nIn Ethereum’s case, its PCR was 0.37, implying that there were more bullish bets than bearish ones. The maximum pain point for ETH was $3,000. As such, traders might need to hope that the altcoin trades above this level before the day ends.\n\nAt press time, both Bitcoin and Ethereum were valued at levels below the max pain point. If this remains the case by the time the contracts expire, the day could be a “red one” for many traders.\n\nThere are a few reasons why BTC and ETH might end the week on a bearish note. Greeks.live, the notable Options trading handle on X, explained,\n\n“The Hong Kong ETF listing failed to bring much incremental volume, the US BTC ETF continued to flow out, the weakness of the market led to weakening market confidence. The current point of sustained sideways trading is unlikely, no rebound is bound to be a downward relay, the giant whale on the lack of confidence in the market.”\n\nVolatility falls: Will BTC and ETH follow?\n\nIn addition, AMBCrypto looked at Bitcoin’s Implied Volatility (IV). The IV shows the level of confidence in the market, and if it would be a good idea to buy call/put options going forward.\n\nIf the IV increases, market participants are uncertain where the next prices might move. However, if the metric declines, it means traders are unwilling to pay an additional fee to safeguard their existing positions.\n\nGiven the price of Bitcoin and ETH, the IV declined, suggesting that traders have been uncertain that their bullish bets would pay off.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-2024\n\nShould this sentiment play out, ETH’s price might slip below $2,900 again. For BTC, it might start trading at a lower value than $59,000 again."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNSW5ROUJIMDRPUjlhcy1YakxWdDBXVzJESjVCcjh3azdKemJlQk9hTFJiekxESTFHdTgzdlcwcHVybEl2ZG9lN0l1Y3FRTjBHR08tVmdWdDJ1dTFjYktNdDEyREZzVVI1VjRqdmVyWm1aZHB4ZEhpNk1JZzJBRTFkNGxYZHhzb2hoWkFackZpdmJqWTdheUl6QtIBngFBVV95cUxOekdqQUZvWDRER1ktdXZ6bHYwTDJ6N1ZiUmtnRnhMZFNNenVJbVdEZGN1MHhzMnctZmxqZGxfYnA1dHdhdDhVUVhDR0JnLTZ2bEtsQ29MWDJpRnM3d0tVSHRwb2VaRlQ3c0xsV3hLQ0JQcDJKOERpVXB4Nk1DQUFSNFhCOHNqVXhva0JheWR0WkJ3OHVXSFhLSnppQjNSZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Dormant Ethereum holder moves $5.8M in ETH – More profit-taking now? - AMBCrypto News",
        "content": "Stash was received during ETH’s ICO at 31 cents per token\n\nInvestor would lock a humongous 950719% in profits if they decide to sell\n\nIn what was a development that caught the eye of the broader cryptocurrency market, an Ethereum [ETH] holder woke up after nearly 9 years of dormancy to transfer their entire holdings to another wallet on Thursday.\n\nOld ETH on the move\n\nAccording to on-chain data tracking platform Lookonchain, an early investor who received 1,969 ETH during Ethereum’s initial coin offering (ICO) was seen moving 1,960 ETH. The transferred supply was worth $5.8 million at prevailing market prices. The participant received the ETH at 31 cents per token as part of the ICO.\n\nThe purpose of the transfer was yet to be ascertained, at the time of writing. However, there could be several explanations behind the move, with the most dominant narrative being realization of profits. At current prices, the investor would lock a humongous 950719% in profits.\n\nOther factors could be diversifying their portfolios for other tokens.\n\nNot the first time\n\nSimilar instances of reactivation of old ETH received during Genesis were seen earlier in the year. On 24 March, for instance, a participant moved the entirety of their 2,000 ETH received during the ICO. Before that, a wallet transferred 1,732 ETH to crypto-exchange Kraken on 2o February.\n\nAMBCrypto investigated further using Santiment data and spotted sharp spikes in the movement of ETH that were inactive for more than five years. In nearly all the instances, the movement of dormant coins was followed by a price drop. This finding lends weight to the profit-taking theory discussed earlier.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nHow’s the sentiment around ETH?\n\nAt press time, ETH was wiggling in the range around $3,000, according to CoinMarketCap. The second-largest cryptocurrency seemed to be recovering from a rough last month during which it plummeted by nearly 10%.\n\nOver the last 24 hours, sentiment around the coin in the Futures market shifted dramatically too. The number of traders shorting ETH increased vis à vis those longing it, as per AMBCrypto’s analysis of Coinglass data."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOWkE3SzNNdWpZeDI0ci12N2gyZXhYQmJ5SmlUdHZvSDhrR0hYcW1GLUxfb2NkODA1ZS1zTms0aDRSMzhLZEQxbnBVZ1NNZUNfVUpNREFIZXZDLWhXVTVqdmRjeEtCU3BVUFR4eUl6NDlSbzFpVl9NM2ZsRFZwZXJEQ1RYa1VxdHNiUTQ4ejI5dTFHbXA1RDB2UjEtOHZKU1puZ0pF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "BNB Outperforms Ethereum: What It Means for Meme Coins – Pepe, Raboo? - Techpoint Africa",
        "content": "The markets are tumultuous and difficult to read. Old guard tokens like Ethereum (ETH) are outperformed by utility coins like BNB, while meme coins are the rising crypto stars, outperforming nearly anything else. Pepe and Raboo are both on the receiving end of BNB’s stellar performance, and investors would do well to consider meme coins over and above utility coins like BNB.\n\nBNB (BNB): The Utility Coin That Keeps On Giving\n\nBull market, bear market, flat market, who cares when BNB is around? The beauty of BNB is that it is the utility token of the largest crypto exchange, and no matter what the market conditions, it is in use. Whether you are investing or divesting, when trading on Binance, chances are BNB is involved, and this is why BNB is the fourth-largest coin by market cap.\n\nBNB has gone from a ‘mere’ utility coin into a bona fide store of value. With a market cap of over $80 billion, BNB is a giant and has outperformed Ethereum by a factor of three in the last year alone.\n\nPepe Coin (PEPE): The King of The Memes (for now).\n\nOne of the top rising crypto of the year is Pepe Coin. Dismissed as just another meme coin, Pepe Coin silenced its critics with a breathtaking 400% return in year-to-date figures – and that is after the market recovered after the March spike in prices! Pepe Coin is nobody’s fool, and if Ethereum is outpaced by utility coins like BNB, then it stands no chance against the juggernaut gains meme coins like Pepe Coin and its cohorts can deliver, and have continually delivered, to the cryptosphere.\n\nThe future of Pepe Coin looks as bright as can be now that the crypto market is seeing the goodwill and purchasing power meme coins have on offer. Pepe Coin is hardly alone in this, and the rising crypto stars are almost all meme coins.\n\nRaboo (RABT): Capturing Hearts as a Rising Crypto and Meme Coin\n\nRaboo is not just any cryptocurrency; it’s a new meme-fi AI crypto carving out its niche as a rising crypto and one of the most engaging meme coins on the market. What’s the allure of meme coins, you ask? They’re fun, relatable, and resonate with a digital audience that loves to blend humor with investments.\n\nRaboo takes this a step further by integrating cutting-edge AI to keep the memes fresh and the community laughing and earning. As it continues to gain traction, highlighted by a smashing $1 million in presale funding, Raboo proves that investing can be both enjoyable and profitable. It’s not just about numbers; it’s about being part of a community that celebrates creativity and innovation in the crypto world.\n\nConclusion:\n\nRegarding investments, one can either be stuck in the mud and stick with the lumbering giants like Ethereum, or one can get on board with the fast and agile rising crypto tokens like BNB, Pepe Coin, And Raboo. Nobody is investing to lose money, and the massive returns on utility and meme coins far outpace the bigger names. Raboo (RABT) is available in presale at $0.0042 and Pepe Coin and BNB are available to trade on the markets.\n\nYou can participate in the Raboo presale here."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPREZDY09yeHJzcy12aE1ybmVxNTdyalFLbDFtaGJobXJ2WXk3bllhNmZMcUdqSjBxZ081NV9QR19FOGFuM0Z4Yy1NZlo5LTZRbzdqRUlVNXRuZ29BQW82d2xmNm1LOHhvaVRleGdnZHZCSUFuNHNfYTlNSVowTGVoZFRybmg3czhEODNIYVNaeXBXd1p0QkNheVgzQWtVNVIzcnQ1NE16ZV_SAa4BQVVfeXFMUHZiWUhJak9QWjhvQlVSNEEwOW1INzlaa0NvUXdFdm1xQjNTSVdVdzNtS1BQVG1WSUNOZFBxWktyWm9DQm1jaTRGd1MwRHFyWnlrUnItaXNFdVAwYWc2Ym9kNnBaTEx1bkZHN0tXNEdWcDU2VjNZSnFPSS13N3h6U2ZpeDdVNzFQT2lVSzRhYTktY1FqMTBPRTdROUg0ME9PQkJLR01jcUk2MFhPVmZ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 3: Bitcoin Nears $60K As Ethereum & Other Altcoins Recover - CoinGape",
        "content": "The top crypto prices today registered a rebound as the Bitcoin (BTC) price surged past the $59,000 level. In addition, the Ethereum (ETH) price attained the $3,000 mark, losing hold on a crucial level. Moreover, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) also recovered significantly.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price surged by 4% reaching $59,539.94 at the time of writing on Friday, May 3. On the other hand, it’s trading volume plummeted 39.14% to $30.11 billion in the last 24 hours. Whilst, the crypto’s market capitalization soared to $1.17 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price gained 3.07% to $3,001.36 at press time with a market valuation of $360.38 billion. Whilst, ETH saw its trading volume plunge 38.14%, reaching $12.47 billion.\n\n3. Solana Price\n\nThe Solana price recovered significantly and approached the the $140 mark today. The Solana price rallied 8.33%, settling at $139.84. In contrast, SOL witnessed a 20.36% drop in trade volume to $3.31 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price traded above the $0.52 level. The XRP price recorded a gain of 1.7m81%, reaching $0.5209. On the other hand, XRP’s trading volume slumped 43.68% to $1 billion.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price was up 2.82% to $0.4566 today. Whilst, ADA recorded a decline of 37.77% in its 24-hour trading volume, settling at $331.69 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price surged 7.35% to $0.1336 while its rival, Shiba Inu price was rallied 6.37% and traded at $0.00002315.\n\nAlso Read: Jack Dorsey’s Block Boosts Its Bitcoin Bet With 10% Gain Reinvestment\n\nTop Crypto Gainers Today\n\nArweave (AR): The Arweave crypto surged 20.94% and traded at $34.15.\n\nThe Arweave crypto surged 20.94% and traded at $34.15. Bonk (BONK): The Bonk crypto price rallied 16.85% to $0.00002588.\n\nThe Bonk crypto price rallied 16.85% to $0.00002588. Pepe (PEPE): The Pepe crypto price was up 15.77% and was valued at $0.000007916.\n\nThe Pepe crypto price was up 15.77% and was valued at $0.000007916. Toncoin (TON): The TON crypto price rose 13.64% to $5.38.\n\nTop Crypto Losers Today\n\nCosmos (ATM): The Cosmos price lost 1.66%% to $8.58.\n\nThe Cosmos price lost 1.66%% to $8.58. Gnosis (GNO): The GNO price dipped 0.67% to $304.84.\n\nThe GNO price dipped 0.67% to $304.84. Kaspa (KAS): The Kaspa crypto dropped 0.36% to $0.1074.\n\nDue to the recent rebound, only the above-mentioned three cryptocurrencies made it to the top crypto losers list. Meanwhile, the gainers list included Ondo, Immutable, Dogwifhat, and Jupiter among others.\n\nAlso Read: Tether Implements Chainalysis Surveillance to Tackle Illicit Crypto Activities\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNSUc3cTdTTnNvcVFpM1YyU0FPY2lPSFpyWFpEUE1pNHVDM2xJa2RVTjZMUmhOMmluUmVtb3hEREsxNmcyWjQzN2g2c3lZWmhXNjVvaGUxOTdNZDZ2Q2ZJYlRUQUM3Vk1BdzJOUzdLYVJZQkJ5dVZxbTI3THEzUnY2QURnbUN4S3Q2QkdndtIBkgFBVV95cUxQZmtLMngwZ01WQWdLNTNfOXY5VlpZdXc2c2lLZkU5eElqY3pLcWR6aXJ6UDdDNF9VVU0wUm40aG5qY1FOLXItOGpILVhVWElPREpyZExES1J0NzhzeWdHbkRjTjRaSFRiMXR1NXczUVU1NnY5SVd5VTlReWpZajlxbWFFbzExZzZKczlwaEczQkQ3QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum dips, but demand rises: What’s driving investors to ETH? - AMBCrypto News",
        "content": "ETH saw the biggest 2-day stretch of network expansion since October 2022.\n\nThe addresses holding between 0 and 0.1 units of ETH increased significantly.\n\nEthereum [ETH] continued to fall freely, sinking below $3,000 in the last 24 hours following a 3% drop, data from CoinMarketCap showed. The second-largest cryptocurrency was trading at $2,914 at press time, reflecting a 13.34% discount over the month.\n\nThe negative price action, however, did not appear to limit demand for the asset.\n\nUnfazed users continue to snap ETH\n\nAccording to on-chain analytics firm Santiment, Ethereum saw a sharp increase in new users joining the network. About 266.6k new wallets were created on the 28th of April and 29th, the biggest 2-day stretch of network expansion since October 2022.\n\nNetwork expansion is one of the primary measures for determining if a cryptocurrency is gaining or losing traction. The onboarding of new users indicated confidence in ETH’s long-term potential, ignoring short-term blips.\n\nRetail users enter ETH market\n\nOn further scrutiny, it came to light that retail users were jumping on the bandwagon. The addresses holding between 0 and 0.1 units of ETH increased significantly while the prices plunged, as per AMBCrypto’s analysis of Santiment’s data.\n\nInterestingly, the cohorts holding more than 1 ETH were selling off, as evident in the drop in their ETH reserves.\n\nThe aforementioned findings suggested that retail interest was strong for ETH and healthy inflows from this segment could contribute to a relief rally in the days ahead.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIs staking the driving force?\n\nMany of these retail customers buying ETH might be lured by the yields offered by ETH staking services.\n\nThe total ETH staked soared to 44.24 million as of this writing, forming 36% of ETH’s total circulating supply, AMBCrypto noted using Glassnode data.\n\nAt the same time, the supply of ETH on exchanges continued to shrink, falling to 12.79 million as of this writing, about 10% of total ETH coins in circulation."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQZnNyWGZkYnd1R2dySmtZMDRfUHllWEd5N3JRa2ZuaFJyaEsta2RlUUVlTDBJbmxjSVdxRnd0SXRONUs5ZTAzZ3BzNEtmWFgwWWtKeHJpelV1cEpLUHU0SGR5REZ2b1lEdUFZVXBfQVgzUVJ6dUx1dUt2eGhTSnVVWkJzYjFSSlXSAYwBQVVfeXFMTXpMaFpyU0JJWmxkbGl3UzFQLXI4TEJwblpEVUNoU3k0Sy1ZTFduUDNabE05WUIzX0RlTUxGNExmdTNJSFlnQVViZW04cVUxSFhLcFNWWEZlOVpRb1NsWm1RS195Ump4dTN1bFNXUFgtNEpoZEN6ci0xSUp0SEtjVDJKMnRObTd2Qm51SWg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Ethereum’s next price target – ETH can climb to $3,300 ONLY if… - AMBCrypto News",
        "content": "Ethereum’s price appreciated by more than 2.5% in the last 24 hours\n\nMost metrics and market indicators looked bullish on ETH’s charts\n\nAs market sentiment changed over the last few hours, Ethereum [ETH] benefited from the same as its daily chart turned green. However, the latest uptick might just be the beginning of a massive rally, especially since the king of altcoins’ price is now moving inside a bullish pattern.\n\nEthereum’s bullish move\n\nThe last 7 days weren’t in the investors’ best interests as ETH’s price dropped by over 5%. However, as the market trend changed, ETH also managed to push its price up by more than 2.5% in 24 hours. According to CoinMarketCap, at the time of writing, ETH was trading at $2,988.30 with a market capitalization of over $358 billion.\n\nInterestingly, things might get even better for ETH in the coming days. World of Charts, a popular crypto-analyst, recently shared a tweet highlighting that the ETH/BTC pair was moving inside a falling edge pattern. A successful breakout from the pattern could result in ETH hitting new highs in the coming months.\n\nTherefore, AMBCrypto checked ETH’s metrics to see whether it would manage a breakout. Our analysis of Santiment’s data revealed that ETH’s network growth hiked over the last few days. Simply put, more addresses were created to transfer the token as its active withdrawal rate climbed last week.\n\nAdditionally, Ethereum’s supply held by top addresses also rose slightly, suggesting that buying pressure on the token was high.\n\nOn the contrary, its MVRV ratio remained low. At press time, ETH’s MVRV ratio had a value of -6.22%.\n\nEthereum’s weekly target\n\nSince most metrics seemed bullish, AMBCrypto then checked ETH’s daily chart to see whether a further uptrend was inevitable.\n\nWe found that ETH’s Chaikin Money Flow (CMF) registered a sharp uptick from the neutral level. The Money Flow Index (MFI) also went north. Both of these indicators suggest that the chances of a sustained bull rally are high.\n\nOn the other hand, the MACD supported the sellers as it flashed a bearish crossover on the charts.\n\nWe then analyzed Hyblock Capital’s data to find out the possible targets ETH might hit this week if the bull rally lasts. In order for ETH to sustain the rally, it will be crucial for the token to go above $3,100, as liquidations would rise sharply.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nA hike in liquidations could result in a price correction. A successful breakout above that level could allow ETH to climb to $3,300 by the end of this week if everything falls into place."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQS1FSVndaV2VPY1d1REZzSnRFNHZwM280YUpYQmxmUjhjWWdKcmtSN3UzMlo3cjNLdzRyNW5zQ0hrSzZkNFpiZHFPVl9sZUdpaEtaSndCVUtkXzdSaWZhX0VNcTZFdXVMU0RnYml1dFZ0bDhQdTh0aTJvbzlWQXNaUF8tVXU4TjJhRlowQTBJMW1OX3VwYWpiWUxPUzTSAaIBQVVfeXFMTzFJUnU3Tl84R0ZUYi05ZDhCT0JVVndpbFhaWVdfckF4emZ3TEJVek1Uc0RqOFV5bVpHQ0hMcXlSZ0VfTHJuT3FGQk5xSHhMcmFQQ2dDNFRpNFJKTWdWbXZPem5ZRDc4VTlGWFdYZmhXckkxcU9VTzVsT1dMLUtvMV9aRDh0T043VlVXQzlEVUF5cE1SaDRpRDJKSzgtZGp1QW5n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Michael Saylor Attacks Ethereum Calling It A Security, Disapproves spot ETF - CoinGape",
        "content": "MicroStrategy executive chairman Michael Saylor has made a bold statement against Ethereum stating that the world’s largest altcoin is a crypto asset security and not a commodity. His comments regarding ETH came on Thursday, May 2, while speaking at the MicroStrategy World 2024 conference.\n\nMichael Saylor Attacks ETH\n\nIn addition to attacking Ethereum and calling it a security, Michael Saylor added that there’s a very high likelihood that the U.S. Securities and Exchange Commission (SEC) would never approve a spot Ethereum ETF. His comments come just 20 days ahead of the final deadline of May 23, for the SEC to either approve/deny the spot Ethereum ETf applications.\n\nadvertisement\n\nHe went on to forecast that other cryptocurrencies further down the hierarchy would also be classified as unregistered securities, including BNB, Solana (SOL), XRP, and Cardano (ADA).\n\nSaylor emphasized:\n\n“None of them will be included in a spot ETF, none of them will ever gain acceptance on Wall Street…”\n\nHe firmly asserted that Bitcoin (BTC) stands alone in achieving full institutional acceptance. He labeled BTC as the “singular universal” crypto asset suitable for institutional-grade investments, stating that “there won’t be another one.”\n\nMicroStrategy’s founder is renowned for his unwavering focus on Bitcoin. Saylor’s remarks come shortly after MicroStrategy announced the addition of $1.65 billion worth of BTC to its corporate reserves in the first quarter.\n\nTwo days before, MicroStrategy also unveiled its Bitcoin-based decentralized identity (DID) product MicroStrategy Orange. Along with holding a large stash of BTc on its balance sheet, the company has also been making strong efforts in order to boost the Bitcoin ecosystem.\n\nFuture of Ethereum ETFs in the United States\n\nWhile some of the top financial players like BlackRock and Fidelity have been pushing for a spot Ethereum ETF, market analysts have toned down their expectations of approval recently. One of the major concerns has been the recent comments from the SEC that seek to treat it as a security.\n\nHowever, some of the top crypto industry firms are willing to defend Ethereum at all costs. Last week, ConsenSys slapped a lawsuit on U.S. SEC, and wants to declare it as a non-security.\n\nAs the SEC’s investigations into Ethereum unfold, it’s evident that spot Ethereum ETFs may face obstacles in the near future, potentially leading to further legal battles.\n\nSpot market Ethereum ETFs would offer Wall Street firms and investors a means to gain indirect exposure to ETH, bypassing the need to navigate crypto exchanges or manage digital wallets. Earlier this week, Hong Kong became the first jurisdiction to approve a spot Ethereum ETF.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOYkxwbzJVNWdFTXpJVkk0ZEdyTTlhR18wMjg3VHgzckJTMzJRMTg2VGxuc21wYWNEeDlOYS1teW9DVlFERlNJUFFybDI0bl9QaFQzdFFGekZLZnEyLWVYaWtqM1dXT1dmcnJiRzBlRHJWSk5TVW1fRHRGdHRMT0hyc2NhZkl0eU1uNk13U21FNF9ud3VDUEHSAZsBQVVfeXFMTXVQbENUbnQ2Tm9vb09DWEEydmtEVno5cGF2aWU4dFlmTFF1QmQwMDBBY3djSlVBajZWbDZBNzZlSmcwZXd3TE1WakV5b0V5NGY3VXRRLWNGV1dhbURtcmR5ZC1PY2liNDJKWkUxeTkxLWpZRWNvSklYeTc1bUprS0l1cnF6MHVqZ2ZDZlM5MWFwazNIclFMY2phREk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Shiba Inu: ShibaSwap to operate on Ethereum, Solana: Impact on SHIB? - AMBCrypto News",
        "content": "ShibaSwap’s 24-hour trading volume more than doubled.\n\nEcosystem tokens like SHIB and BONE saw impressive spikes in the last 24 hours.\n\nIn a major feat for the Shiba Inu [SHIB] ecosystem, decentralized exchange (DEX) ShibaSwap went live on the layer-2 (L2) blockchain Shibarium, ushering in a new multichain era.\n\nThe update was provided by Shiba Inu marketing lead Lucie via an X post dated the 1st of May. With the integration, Shibaswap would operate on both the Ethereum [ETH] and Shibarium networks.\n\nThe ecosystem’s primary token SHIB was trading at $0.00002245 as of this writing, up 6.4% in the last 24 hours, data from CoinMarketCap showed.\n\nBone ShibaSwap [BONE], ShibaSwap’s governance token, also got a 5.76% hike in the 24-hour period.\n\nBig boost for ShibaSwap\n\nSince its launch in July 2021, ShibaSwap has been functioning on the Ethereum blockchain as a DEX, offering services like staking, liquidity pools, and yield farming.\n\nThe platform has handled trades worth more than $17 billion as of this writing, AMBCrypto noted using DeFiLlama data. In the last 24 hours, the trading volume more than doubled to $2.55 million.\n\nShibarium was due for a hard fork on the 2nd of May, in a bid to make the network faster and more cost-effective.\n\nThe improved network performance could provide just the right ecosystem for ShibaSwap to grow further.\n\nWhat’s in there for SHIB?\n\nUtility projects like ShibaSwap and Shibarium were planned steps by the Shiba Inu ecosystem to rise above the meme coin status and add utility to native tokens.\n\nThe news of Shibarum’s integration not only caused SHIB to spike, but resulted in a dramatic increase in the new addresses created on the network, AMBCrypto noted using Santiment data.\n\nRead Shiba Inu’s [SHIB] Price Prediction 2024-25\n\nThe daily active addresses also spiked 11% on the 1st of May. The positive commentary around the coin also increased, as evidenced by the weighted sentiment indicator.\n\nLike the broader market, the second-largest meme coin had a rough April, losing more than 12% throughout the month."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPY19XRDI5R1BBYjFLM2YwNndYUWdyRG1WanBQbUxTYjZyQUNJVUZxY2NSaExWTDlIdnRuakpiREpjZHZuV3gzTVZncGF5VUFXSFJPQjdKTTJnQzFDVllUQkNuQjFtZEpVZDZvTmxGMXdib1dQRVVyZk4zaXp5b0xxLV9rcG5heVnSAYwBQVVfeXFMTTNzT1VXbG5zRXlUS0ZpQy1hcnNWNU1qY0daYzVpWXpMWWdWVEZmYXVDeERhQm42cnZ1b1A2a3RMTTEzTkZDajJ5Z19WMGNZcXBEbmhVSGxmSUhHWmdpdVpPMTBXSGszODdLWHBaSTF3elpzSVlTNEVOdXpjOEVwSFdxWXhOV0RHNnlUOGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Will Ethereum fall below $2500 in May? Taking a closer look - AMBCrypto News",
        "content": "ETH briefly broke support and traded at a low of $2852 on the 1st of May.\n\nIts Futures Open Interest declined considerably since the 10th of April.\n\nEthereum [ETH] recently crossed below its 20-day simple moving average (SMA), putting it at risk of a further decline in the short term.\n\nWhen an asset’s price falls below its 20-day SMA, it suggests that the short-term trend for the asset is downward.\n\nMarket participants often view this as a sign that sellers are in control and that the asset’s price will likely continue declining.\n\nReadings from ETH’s price movement on a 1-day chart showed that its price fell below its 20-day SMA on the 30th of April.\n\nAs coin selloffs intensified, ETH broke support and closed the trading session on the 1st of May at a low of $2850.\n\nBulls are nowhere to be found\n\nAlthough the coin’s price retraced in the last 24 hours to exchange hands at $2,913 at the time of press, bullish pressure remains too weak to sustain any significant rally in the short term.\n\nAMBCrypto found that on the 1st of May, ETH’s MACD line (blue) intersected its signal line (orange) in a downtrend when the coin’s fell broke below support.\n\nThis intersection is a bearish sign. Both lines below the zero line, when it occurred, confirmed the existing downtrend and signaled the possibility of a further decline in ETH’s price.\n\nAlso confirming the strength of the current market downtrend, ETH’s Aroon Down Line (blue) was 92.86% as of this writing.\n\nThis indicator identifies an asset’s trend strength and potential trend reversal points in its price movement.\n\nWhen the Aroon Down line is close to 100, it indicates that the downtrend is strong and that the most recent low was reached relatively recently.\n\nFurther, ETH’s key momentum indicators pointed to a significant decline in demand for the altcoin. Its Relative Strength Index (RSI) was 36.46, while its Money Flow Index (MFI) was 33.96.\n\nThe values of these indicators showed that market participants favored ETH distribution over the accumulation of newer coins.\n\nAMBCrypto’s assessment of ETH’s network activity using a 30-day average confirmed the decline in demand for the altcoin in the last month.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAccording to Santiment’s data, the daily count of addresses involved in at least one ETH trade in the last month has dropped by 7%.\n\nSimilarly, the number of new addresses created to ETH has decreased in the last month. On-chain data showed that this has fallen by 10% in the past 30 days."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxORHo1S2NuNjZFVDZ6TEVzZEtjOHNTN3EyUTdHOC16UkZXQVpFc0RpRnJManpMbUZEVjYtSUlvbXpuWEZUVnVHdDF4RFNWZXBpVnhibG43WGRIbEMxejJnbDdLMjZ3MHNUMEJHM2ppNVFOYnEtdWlTYlI4ejl4a0dnZjNkbXVEZzJVQkQ3OHd2Qms3TnRqR2d5QkdOd3VBSWdoSHctX21RZU84UdIBsgFBVV95cUxOOTk5X1VEUWJjNmMxZWwtNEFrcmxTc05mVjBodzYtSXJIUmpnLTlzYVB0akkteGZxYnNieE9IT04zNmlJSGg4VzdmR1VPUXBrUFlFN0lXdTg2VTFyajFTYW96QTdFOVZqTUJrSF9zUHBFUDRvQ01oYVRLa0ZlUkdObk5uYjNFWUJmRW9JdXB1S2VXam5BZzhNdjJSQVhublNwYUFOcVZYZjFleG9DMlZEUGFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum resurge as interest rate remains unchanged in US - Nairametrics",
        "content": "Bitcoin and Ethereum have resurged in price following a rough week caused by speculation over an important Federal Reserve meeting and its outcome as regards interest rates in the United States.\n\nAccording to Decrypt, Bitcoin price at the time of writing this report was around $57,700 after having made a 0.5% recovery in the past 24 hours. And the Ethereum price, after climbing 2.3% in the past day, is now trading for just below $3,000,\n\nNotwithstanding, the damage to the crypto market has already been done as the past 24 hours witnessed another $193 million worth of crypto futures contracts liquidated, adding to the $300 million worth of liquidations seen earlier this week.\n\nEconomist, Trader, and Crypto Analyst Alex Kruger explained the complexities of this current cycle and how it feels different for traders because it’s largely been driven by interest in spot Bitcoin ETFs, which only just started trading in January this year.\n\n“There has been barely any new retail coming into crypto,” he wrote on Twitter. “It’s been mostly ETF buyers and previous cycle participants redeploying and going out the risk curve.”\n\nAnalysts explained the crash in crypto prices to be caused by fear in the market by investors over certainty among investors that the Federal Open Markets Committee would not lower interest rates. Then the Feds proved them right by leaving interest rates unchanged affecting crypto prices.\n\nDuring a press conference yesterday, Federal Reserve Chair Jerome Powell told reporters that the fight to get inflation to 2% has been difficult, and he seriously doubts the next decision on the policy rate will hike it.\n\nPresident Joe Biden reassured the American populace in a press conference in Japan that he is confident that there would be a rate cut before the year is out.\n\nWhat To Know\n\nBitcoin hit its highest price of $65,000 last month on the significant halving weekend and has steadily declined ever since.\n\nBitcoin has fallen below its $60,000 and one of the major reasons is a recent disinterest in the crypto asset by investors due to its inability to profit from the tension in the Middle East.\n\nRecommended reading: Ethereum surges 8%, highest ever increase in over a month"
    }
]