[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPVW9FaHd6dkt2OE9XLXNTbU95SHIybHdZUkZ4Ul8ta2ExLXNZODVmMHJBbHVCOGQ0MVljTFZwOFg5VmRocDZMelVoc1BOTmhsVHZ0czFXSGgwYndSWGR5Q1BWVWZocXFvUGQ3YUt0QVRRMkpDR3M2SmE4Skl2N1RoTGZ0dHBtZmVuajhMMDI1dEYtbmVHYzZlTlYwaFVIV1BLVG1KeHQxdUhJZHlJdzVQMWQ0T09uRVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Rallies 5% To $3,300: Are ETFs Coming This Week? - Benzinga",
        "content": "Ethereum ETH/USD is back above $3,300, fueled by a wider market rally and hopes of an imminent ETF launch.\n\nWhat Happened: Ethereum is currently trading around $3,360, a 5.5% increase over the past 24 hours.\n\nNate Geraci, an ETF analyst and president of The ETF Store, stated that there’s no valid reason for any further delay in the launch of the eight spot ETH ETFs beyond this week. This prediction aligns with an unnamed source close to the proceedings who also anticipates the ETFs to launch by the end of the week per a CoinTelegraph report.\n\nSeveral issuers, including VanEck and 21Shares, have revised registrations in the past week, hoping to secure the SEC’s final approval to list spot Ethereum ETFs. Analysts believe the launch of these ETFs could significantly influence ETH’s price in the coming months.\n\nTom Dunleavy, managing partner at crypto investment firm MV Global, told CoinTelegraph the funds could attract up to $10 billion in new inflows following their launch and potentially propel Ethereum to a new all-time high by the end of the year.\n\nAlso Read: Long-Inactive Bitcoin Wallet Unleashes $60M Amid Market Rebound, Stands To Profit 497X On Sale\n\nWhy It Matters: The anticipation of the ETFs comes amid a record inflow of over $17.8 billion year-to-date (YTD) into digital asset investment products per the latest CoinShares report. Bitcoin BTC/USD and Ethereum saw inflows of $1.347 billion and $72 million, respectively.\n\nCrypto analyst Michaël van de Poppe presented a bullish outlook for Ethereum, describing the asset as having a “tremendously low valuation.” He pointed out a significant gap between the ecosystem's fundamental growth and the sentiment surrounding its price levels. This suggests that the launch of the ETH ETFs could bridge this gap and drive Ethereum prices to new heights.\n\nThese topics are expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nWhat’s Next: Attendees of Benzinga’s upcoming Future of Digital Assets event on Nov. 19 will explore the influence of Ethereum as an institutional asset class.\n\nRead Next:\n\nThis content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nImage: Shutterstock"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNcDJlaTY1cHFMdzdvYlJEdkFMU3lZMElUbWp3WVpjTmtndGE2QVFTU29aeDR2bmZBVVlpRVhiY2piWHdMa2hlNVBodGNrWHNJZFhBNHpCOThJWWN6eU9wdDRiZldUclFTRnhBSm4ycWpxQ1p2UlA4dWFNazdta0oyX01Jcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "What Is The Ethereum Foundation? - DisruptionBanking",
        "content": "The Ethereum Foundation is a pivotal entity in the cryptocurrency sector. Founded in 2014, this Swiss-based non-profit organization has been the backbone of the Ethereum blockchain, spearheading its development and ensuring its sustainability. Ethereum, often described as the world’s programmable blockchain, owes much of its success and innovation to the efforts of the Foundation.\n\nEthereum Foundation: Company or Charity?\n\nOne common question is whether the Ethereum Foundation operates as a company or a charity or is the same organization as Ethereum.\n\nThe Ethereum Foundation (EF), also dubbed “Stiftung Ethereum,’’ established in 2014 in Zug, Switzerland, is not quite a company and not exactly what you’ll call a charity in the conventional sense, at least. Technically, it’s a non-profit organization that functions similarly to a charity, with a central mission: to shepherd the development and widespread adoption of Ethereum — the second-largest blockchain platform after Bitcoin — and the technologies surrounding it. However, its role extends beyond traditional charitable activities.\n\nMission and Goals: A Public Good for All\n\nThe EF’s mission is to secure a prosperous, decentralized, and enduring future for the Ethereum ecosystem.\n\nIf the Ethereum Foundation can be viewed as a public good entity that focused on harbouring & nurturing an early community of missionaries…\n\n\n\n… then L2s can also be viewed as the new business development & partnership arm of Ethereum that brings in the next generation of Web2… — Patrick McCorry (💙,🧡) (@stonecoldpat0) June 19, 2024\n\nIt’s not about leading or controlling Ethereum but nurturing its growth and supporting benevolent actors within the ecosystem. The EF’s goals are to maintain Ethereum as a public good — directed by none and useful for all. This includes funding research and development, supporting infrastructure, and fostering community growth.\n\nSignificance and Key Contributions of the EF to the Ethereum Ecosystem\n\nsell 70,000 ETH, totaling, approximately, $100 million for the foundation. The Ethereum Foundation has helped ETH grow. Without the Ethereum\n\nFoundation, ETH would be less successful. It was gifted ETH and it used it in order to fund\n\nventures to help promote itself and ETH. — John E Deaton (@JohnEDeaton1) January 6, 2021\n\nThe influence of the EF on the cryptocurrency environment is substantial. It dedicates resources to essential projects, benefiting developers and researchers devoted to enhancing Ethereum’s capabilities. The EF nurtures the ecosystem and champions positive contributors through grants, research endeavors, and programs like the Ethereum Fellowship, which focuses on untapped talent and areas ripe for blockchain innovation. It’s one part of a much larger ecosystem that serves as a catalyst for innovation within the Ethereum ecosystem.\n\nThe EF’s support extends to a broad scope of projects, including solutions for scalability, community building, security, privacy, and more. Here’s a breakdown:\n\nAcademic Grants:\n\nThe Ethereum Foundation endorses scholarly grants aimed at advancing research related to Ethereum. In its 2023 initiative, the foundation supported 43 projects spanning 20 nations, covering fields including cryptography, economics, security, and consensus mechanisms. These grants have helped advance knowledge, foster collaboration, and drive innovation within the Ethereum community.\n\n📣 The first ZK Grants Round is now open!\n\n\n\nThe Ethereum Foundation, in collaboration with Aztec, Polygon, Scroll, Taiko, and zkSync, contributed $150K each to the shared prize pool, totaling $900K.\n\n\n\nApply before March 18th! 👇https://t.co/u1lGRfc4CV — Ethereum Foundation (@ethereum) February 21, 2024\n\nCommunity Engagement:\n\nThe Ethereum Foundation actively engages with the community through platforms like GitHub and Discord.\n\nTheir efforts have increased contributions, with GitHub contributors rising by 57% and Discord community members nearly doubling.\n\nDevcon Conferences:\n\nDevcon, organized by the Ethereum Foundation since 2014, has become a premier event for enthusiasts, developers, and researchers. These conferences foster collaboration, knowledge sharing, and the birth of new ideas that drive Ethereum’s evolution.\n\nwhat to expect as a Scholar: financial support, pre-Devcon community & programming, an amazing week at Devcon in Bangkok, and a post-Devcon learnings.https://t.co/FAwBYd90PM — Deva the Devcon Unicorn (@EFDevcon) July 5, 2024\n\nEcosystem Support Program (ESP):\n\nAs an extension of the Ethereum Grant Program, ESP provides financial and non-financial support to projects within the Ethereum ecosystem.\n\nBy nurturing promising initiatives, ESP has contributed to the growth of decentralized applications, tools, and services in the past and present day.\n\nFellowship Program:\n\nThe Ethereum Foundation Fellowship Program aims to address gaps in representation across cultures, nationalities, and economic classes. It identifies and supports unique and talented individuals, breaking down barriers to entry for underrepresented people and communities in the Web3 space.\n\nEthereum for the Next Billion: Today, @AyaMiyagotchi unveils the new EF Fellowship Program, and discusses the Foundation's role and a vision for #Ethereum's long-term sustainability in a decentralized world.\n\n\n\nRead more: https://t.co/BNnAdH7erH — Ethereum Foundation (@ethereum) May 7, 2021\n\nImpacts and Achievements\n\nThrough all the key contributions of the Ethereum Foundation highlighted above, the Ethereum ecosystem now boasts of many achievements and giant strides, with tens of crypto projects successfully executed and DeFi startups birthed under their belt. To list a few:\n\nDecentralized Finance (DeFi):\n\nEthereum birthed DeFi, a movement that transformed traditional financial services. Notable platforms include:\n\nUniswap, launched in November 2018, introduced automated market-making (AMM) and liquidity pools, enabling decentralized token swaps. Aave, founded in January 2020, pioneered flash loans and became a leading lending protocol. MakerDAO, established in December 2017, its DAI stablecoin provided stability in a volatile market.\n\nEthereum’s Robust DeFi. Source: The Block\n\nBy July 2024, DeFi protocols collectively held over $100 billion in Total Value Locked (TVL).\n\nNFT Renaissance:\n\nEthereum’s smart contracts remodeled NFTs for the crypto industry. The Ethereum Foundation established NFT standards (ERC-721 and ERC-1155) that shaped the NFT ecosystem.\n\nScaling Solutions:\n\nOptimistic Rollups , introduced in 2022, enhance scalability by batching transactions off-chain and submitting proofs on-chain.\n\n, introduced in 2022, enhance scalability by batching transactions off-chain and submitting proofs on-chain. Zero-knowledge Rollups (zk-Rollups), deployed in 2023, further reduce fees and improve user experience.\n\nEth2 Beacon Chain:\n\nProof-of-Stake (PoS) Transition: The Beacon Chain shipped on December 1, 2020, and formalized PoS as Ethereum’s consensus mechanism with The Merge, aka the “Shanghai Upgrade,” on September 15, 2022. During this event, Ethereum successfully switched from “Proof of Work” (PoW) to another system known as “Proof of Stake” (PoS). This change was a huge accomplishment because it significantly decreased the network’s energy, making the platform much more environmentally friendly. This marked the beginning of a new, more sustainable phase for Ethereum.\n\nThese contributions demonstrate the Ethereum Foundation’s commitment to advancing the ecosystem, which continues to grow in leaps and bounds to date.\n\nThe Names Behind the Ethereum Foundation\n\nAt the heart of the Ethereum Foundation is Vitalik Buterin, a prodigy in the crypto world. Alongside Vitalik, other key figures include Aya Miyaguchi, the Executive Director, and a team of dedicated developers and researchers who work tirelessly behind the scenes.\n\nVitalik Buterin\n\nEthereum co-founder Vitalik Buterin has significantly influenced the blockchain space, contributing to high-level roadmaps and technological advancements, including the Ethereum Improvement Proposal (EIP) 7702. His work has earned him recognition, such as a spot-on Forbes’ 30 Under 30 list in 2016.\n\nEthereum's co-founder, VitalikButerin, clarifies his recent ETH transactions. They're not personal sales, but donations to support charitable causes. His unwavering commitment to Ethereum's future shines through!\n\n\n\n#Ethereum #CryptoPhilanthropy pic.twitter.com/x4u6xXpNAH — Hamid (@HaMidOwAiSi3) October 18, 2023\n\nGavin Wood\n\nGavin Wood, co-founder of Ethereum and creator of Polkadot, invented Solidity and defined the Ethereum Virtual Machine (EVM) in 2014. He served as the Ethereum Foundation’s first CTO.\n\nDr. Gavin Wood appreciation tweet.\n\n\n\n✅ Co-founder of Ethereum with Vitalik\n\n\n\n✅ Proposed & helped develop Solidity language\n\n\n\n✅ Released the Yellow Paper defining Ethereum Virtual Machine\n\n\n\n✅ Founded Polkadot & the Web3 Foundation\n\n\n\n✅ Donated $5.8 million in crypto to Ukraine pic.twitter.com/2ci4S407i2 — Hamza ⚡ Marmooz (@marmooznet) March 18, 2022\n\nMing Chan\n\nMing Chan, as the Executive Director of the Ethereum Foundation from 2015 to 2018, significantly improved the Foundation’s efficiency and reduced costs through reorganization. She also fostered relationships with academic groups like IC3.\n\nLittle known fact, #Ethereum owes it's existence to @mingchan88, for keeping the Foundation afloat long enough to pass Swiss regulations and gain access to its genesis Ether. Without her, high chance the EF would have gone bankrupt before Ethereum's 1st birthday. https://t.co/x4G4b6N0TO — Péter Szilágyi (karalabe.eth) (@peter_szilagyi) December 2, 2020\n\nAya Miyaguchi\n\nAya Miyaguchi, the current Executive Director of the Ethereum Foundation, leads its support for the Ethereum ecosystem through research, development, and education. She aims to preserve Ethereum’s open-source, inclusive, and permissionless nature.\n\nApart from Vitalik Buterin, Aya Miyaguchi, and co, there are several other key figures in the Ethereum Foundation and the Ethereum ecosystem, by extension, including the likes of Joe Lubin and Charles Hoskinson (both co-founders of Ethereum), Jeffrey Wilcke (as part of the Technical Steering Group), Patrick Storchenegger, and Jeremy Wood.\n\nMay 16, 2019\n\nAya Miyaguchi, Executive Director, Ethereum FoundationShe is on the @EMPOWR_us list of EEA members who may have communicated with Bill Hinman.(List Below)\n\nAn entire discussion on how they are using Ethereum to fund the foundation. pic.twitter.com/gegnKLlXBh — Digital Asset Investor (@digitalassetbuy) April 26, 2022\n\nThese individuals have made significant contributions to the Ethereum Foundation and the broader Ethereum ecosystem. Their collective efforts have helped shape Ethereum into the powerful and versatile platform it is today.\n\nThe Ethereum Foundation is a unique entity that blends the characteristics of a non-profit with the dynamism of a tech company. Under the leadership of visionaries like Vitalik Buterin and Aya Miyaguchi, it has made significant strides in advancing the Ethereum ecosystem. With ongoing projects and a clear vision for the future, the Foundation’s role in the crypto world is set to grow even more influential.\n\nAuthor: Ayanfe Fakunle\n\nThe editorial team at #DisruptionBanking has taken all precautions to ensure that no persons or organisations have been adversely affected or offered any sort of financial advice in this article. This article is most definitely not financial advice."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPVTMtcmRZczMxX3VrRkNLTEMtSXJ6TDhEcm9GM0JZMGVUSGtPWWRvbXdnSDZwR3pVR3ZPdW0zbWl5Tjd1Q3FVOUVzdzBpdnJSRGxTajU2Z1ZuNVZlYTN1eGZ1ZHMyVHktTG9YMzNvRDdFNk8xbFVJVEJjTjlMc21PREFseUpPOEIwRGZOODRPYzBTcVBCZHplVVNoM2d3VEpZbGVnN1J3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Could Outperform Bitcoin with Upcoming ETF Launch: Kaiko - Crypto Times",
        "content": "A new report from Kaiko suggests that Ethereum (ETH) might perform better than Bitcoin (BTC) once Ethereum exchange-traded funds (ETFs) launch in the United States.\n\nThe report focuses on the ETH to BTC Price Ratio, a key metric that measures the amount of Bitcoin required to purchase one Ethereum.\n\nRight now, this ratio stands at 0.05, marking an increase from the 0.045 before the Securities and Exchange Commission (SEC) approved spot Ether ETFs. This increase hints that Ethereum is getting stronger compared to Bitcoin.\n\nThe report also points out Ethereum’s low market depth. Market depth tells how easy it is to buy or sell an asset without causing big price changes. Low market depth means that large trades could cause bigger price swings, potentially helping Ethereum’s price to rise.\n\nAnother important factor is the Ethereum Exchange Reserve, which tracks how much Ether is available to buy on exchanges. According to the report, this reserve is at its lowest in years, which could mean a supply shortage is coming. As institutional investors try to fill their new Ethereum ETFs, this low supply could push prices much higher.\n\nAdditionally, the launch of spot Ethereum ETFs is generating considerable anticipation in the cryptocurrency space. According to Bloomberg’s analyst James Seyffart, the SEC has requested applicants to submit amended S-1 forms by July 16, potentially setting the stage for a July 23 launch date."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNbHNBY3A5ckdYWkFxRHFUSXZnZ3dUdUVxdWNseGhHbUsyVU1ST2p4X0FSaWhoYkhTZDhaZWE5NEJydld6QUIxTnZWczM5YVlMOTRMcGZ4UGRfbHN4Tm9oXzl3SDZLd0ptNk1jS1QyQXpWajd3YUVING15TWlYd19DSDFUTkw2OG5JWEhNVE5TTjZQQUhJV2o1aHdYd3lRekZFZUJ3QlNTNmg2aWhM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Bit Digital ‘thrilled’ by Ethereum ETFs but highlights their lack of staking features - CryptoSlate",
        "content": "Bit Digital expressed optimism around spot Ethereum (ETH) ETFs’ upcoming launch but drew attention to the funds’ lack of staking on July 16.\n\nThe company said it is “thrilled for the increased normalization and adoption” around Ethereum and the technology’s potential to reshape the financial system. Bit Digital also asserted that the ETFs could be a significant price catalyst for ETH in future months.\n\nHowever, Bit Digital drew attention to the funds’ limitations, noting:\n\n“It is important to note that the ETH ETFs won’t be able to stake and benefit from ETH’s full potential.”\n\nBit Digital referred to its website, which identifies the firm as the only publicly traded Bitcoin miner that stakes Ethereum. The company spends BTC mining rewards on ETH, which it stakes. It then redeploys ETH staking rewards to add sustainable Bitcoin miners, concluding the cycle.\n\nBit Digital also states that it is among the largest ETH holders of any Nasdaq-listed company, holding over 29,000 ETH ($100.4 million).\n\nThe company said its BTBT shares provide “exposure to the smart contract economy.”\n\nETF applicants dropped staking\n\nSeveral spot ETH ETF applicants attempted to accommodate ETH staking to their proposals around February. They intended to treat staking rewards as income for the fund.\n\nHowever, applicants removed staking plans from their applications to reportedly meet the SEC’s expected approval requirements around May. Spot ETH ETFs have since gained initial approval without allowances for staking.\n\nBloomberg ETF analyst Eric Balchans believes the SEC will grant issuers permission to launch the funds on July 22, allowing the funds to begin trading on July 23.\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE15czVoaEczNUxIM0g3Y1pwVmhGN0tnTlRkTEVpaWlZdGY3WkZoRGhyaFo1eHhtZ0FESTNrMy01aU1GY19ZdlpTaXdXaDFlSlp3OXdIMERGV3U3SUJ6azI5NU9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs to launch July 23, Bloomberg analyst says - Crypto Briefing",
        "content": "Ethereum ETFs to coincide with Bitcoin Conference, potentially boosting market attention.\n\nKey Takeaways Ethereum ETFs are scheduled to begin trading on July 23, as reported by Bloomberg analyst.\n\nBitwise CIO projects $15 billion in inflows for Ethereum ETFs by the end of 2025.\n\nShare this article\n\nThe starting date for spot Ethereum exchange-traded fund (ETF) trading in the US is July 23rd, according to Bloomberg ETF analyst Eric Balchunas. He shared on X that the SEC is answering issuers today, asking them to return their final S-1 forms on Wednesday, July 17th.\n\n“And then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided no unforeseeable last min issues of course,” he added.\n\nUpdate: Nate's instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided no unforeseeable last min issues of course! https://t.co/D21FD9Qf94 — Eric Balchunas (@EricBalchunas) July 15, 2024\n\nThe Ethereum ETF issuers filed their S-1 forms on July 8th but most of them left the fees out of their forms. According to Balchunas, this is likely a strategy from the asset managers to check how competitive the funds’ fees are, especially BlackRock’s.\n\nNotably, the S-1 form is an initial registration required by the US Securities and Exchange Commission (SEC) before a security can be publicly traded.\n\nAs highlighted by Balchunas’ fellow ETF analyst James Seyffart, this could mean that the Ethereum ETFs will start trading the same week as the Bitcoin Conference, set to happen in Nashville.\n\nThe launch of the spot Ethereum ETFs is a key step for crypto adoption by mainstream investors, as it solidifies the altcoin as a sound asset among institutional investors. An estimate by Bitwise CIO predicts that these investment instruments will capture $15 billion in inflows until the end of 2025, as reported by Crypto Briefing.\n\nMoreover, the Ethereum ETFs open the door for the approval of exchange-traded funds indexed to other crypto. VanEck and 21Shares both filed their form for the approval of the first spot Solana ETFs in the US on the last week of June."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPQVp0d1BXVWNJcmtJclBYUTRhbGlMTlBwakt0a2lTdFJQTGhtNGhWZjJYVGljUzB4LURtREpfdWxGSUpXbmJvRFJaMmpYOGFlUUtnLWJ0ZHA3T1k3QjVQQUZZc2lqbUcwNjc5dlo1UHJ1em4zMTlDUGZ2WFNNSVFFOVFGQzl6UFpvbDlwdE9ORUd0T0NfZU9NMHFPRVN4eHlIalowZGtQX3JybkF1S2hB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Moves Toward $4K on Imminent ETF Launch Hopes - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQWE1kUmk3MXN2ZENoanRIYkJfdXhmRGRsSUpYWk9XUFh2MnJ3ak82cGllQXRzMGRPX1F4NE5fTmFfZVhZckx0eTJJSGNWWW5aaDFlQnJicDJVVHhBUFQ5YnV5NGd0MDl1alMybS0yUlVsWWE5UThGbTl2SXBGNUFWbnRrVW9fWTNvMEhnbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "SEC Issues Final Instructions for Ethereum ETFs, Targeting July 23 Launch - Yahoo Finance",
        "content": "SEC Issues Final Instructions for Ethereum ETFs, Targeting July 23 Launch\n\nThe United States Securities and Exchange Commission (SEC) has reportedly requested the final submissions of Form S-1 from asset managers by July 16, according to Bloomberg analyst Eric Balchunas, the SEC. These final submissions must detail the fees issuers plan to charge for their crypto funds. As the market anticipates the launch of these Ether ETFs, Ethereum (ETH) has seen a surge in the past 24 hours, gaining 3.69%. It is currently trading at $3,458.\n\nThis move follows the SEC’s approval on May 23 of issuers' 19-b forms, which proposed rule changes to permit crypto-based investment vehicles. Now, asset managers require approval for their initial securities registration S-1 forms. The SEC is reportedly targeting to launch the new ETFs on July 23.\n\nSeveral leading financial institutions, including BlackRock, Grayscale, Fidelity, ARK 21Shares, Invesco Galaxy, VanEck, Hashdex, and Franklin Templeton, are in the race to secure approval and launch their Ether ETFs. Addressing regulatory concerns, some issuers have decided to exclude staking from their Ether ETF plans. This decision aligns with the SEC’s focus on ensuring these new investment products meet regulatory standards.\n\nFees for these Ether ETFs will vary among the different issuers. Invesco and Galaxy have set their management fees at 0.25%, which is slightly higher than those of VanEck and Franklin Templeton, who have disclosed fees of 0.20% and 0.19%, respectively. These fees are notably lower than the 2.50% management fees currently charged by Grayscale’s Ethereum Trust. Although Grayscale has announced plans to launch a new spot Ether ETF, it has yet to disclose the associated fees."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNcVJPRVJkUVdXejRDcHNGRmlFbGRZRnJKM3NtOWRfNnRfeGhRYnRGaS1UcEZsRDBNZ3lWS3QyRGdnd1pVbWhxT3NnNkc0d2VqOGZHb29GeGlfMGNySnFqQTlwLWpKdzNmVGhKZE5jR2ZXSTE5d3pYenlhMloyU3c1dNIBhgFBVV95cUxPSW02ZTFTWTEzTTFqc1Y5QmRPUlhWSV85ZUpSV3U5TXIyc3BGdkdkYUxabUx2YnFwS21wQ1FkdnRvTzBnNnlUa1ZqZGQ3VTM5aGp1dUs3eWNMeXY5bDhtQkNvWWozM2RtS2laZnZUdmlFbEV2TUNxcVMtZFl5TV9wVE50d19kdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin: There's Too Much Investment - U.Today",
        "content": "In an unexpected manner, Vitalik Buterin has criticized overextended investment practices, particularly investments in infrastructure that does not really need it. However, his line of thought could be a double-edged sword.\n\nAdvertisement\n\nAccording to Buterin's viewpoint, a lot of investors are lured to high-risk high-reward situations (the casino) but attempt to rationalize their bets by funding infrastructure that indirectly gains from these speculative endeavors.\n\nAlthough this may be true for some market segments, it is important to think about the arguments' wider implications. Vitalik's perspective may be criticized for being a little limited. Infrastructure spending frequently results in more significant technological breakthroughs and innovation, even when it is not directly tied to speculative markets.\n\nFor example, beyond the original speculative investment blockchain infrastructure, improvements can benefit a wide range of applications. These can include developments in supply chain logistics, public governance systems and even decentralized finance. Furthermore, a lot of interest and money are frequently brought into the market by so-called casino investments, which supply the money needed for new ventures and start-ups.\n\nAdvertisement\n\nThis capital inflow may result in innovations that would not have been feasible in an environment where investment was more cautious. The delicate balance between risk and innovation should not be overlooked as writing off high-risk investments could stifle the boldness and creativity that propel the sector forward. Buterin's criticism is not wholly without merit, though.\n\nInstances of excessive speculation resulting in bubbles that can have disastrous consequences when they burst have been observed on the cryptocurrency market on multiple occasions. This volatility has the potential to erode investor confidence in the technology and result in sizable losses. For the ecosystem to remain healthy over time, it is crucial that investments are made carefully and sustainably."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9tVllSV0VaRmVDMklOU3E3UDNXTWIzbWZmQWw0TThZanoxUnlmTlNKYW5kNUZOYncyYUJsMmVxQk1iNlFranluaDNuODNQVDluQk5KQ2NoSDdEOGJSX2xRX3RGOFdvd3JxZWtNX2RFQnFQcjNBYXFKZG9IYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum surges 5% to $3,300 ahead of key ETF decision - Crypto Briefing",
        "content": "ETF expert Nate Geraci predicts that the SEC will approve trading of spot Ethereum ETFs this week.\n\nKey Takeaways Ethereum's price surpasses $3,300 as the market awaits the SEC's trading approval of spot Ethereum ETFs.\n\nAnalysts and industry leaders believe the imminent approval will boost Ethereum investment.\n\nShare this article\n\nThe price of Ethereum has rallied 5% to over $3,300 ahead of the key spot Ethereum exchange-traded fund (ETF) decision, according to data from TradingView.\n\nThe US Securities and Exchange Commission (SEC) is expected to greenlight the launch of several spot Ethereum ETFs by the end of this month. While the specific date remains speculative, ETF experts estimate that approval will come the week of July 15.\n\nNate Geraci, the president of the ETF Store, reiterated his prediction that the SEC will approve the S-1 filings this week after weeks of delays following initial listing acceptance in May. He believes there’s no reason for further delay because issuers are ready for launch and recent filings require minimal changes.\n\n“Welcome to spot [ETH] ETF approval week. I’m calling it. Don’t know anything specific, just can’t come up [without] good reason for any further delay at this point. Issuers ready for launch,” Geraci stated in a Sunday post.\n\nBloomberg ETF analysts Eric Balchunas and James Seyffart previously predicted the spot Ethereum ETFs could be approved and begin trading as soon as mid-July.\n\nSeyffart noted that Ethereum ETF issuers have been filing their final S-1 registration statements, which is the last regulatory hurdle before approval. Balchunas said the SEC’s minimal feedback on these latest filings suggests they are close to being satisfied with the applications.\n\nMatt Hougan, the Chief Investment Officer at Bitwise, confirmed that minimal amendments suggest imminent approval.\n\nThe approval of a spot Ethereum ETF is anticipated to have a major impact on the Ethereum market and the broader crypto industry. It could drive remarkable inflows of institutional and retail capital into Ethereum, potentially mirroring the success of spot Bitcoin ETFs.\n\nIn a recent report, Hougan suggested that spot Ethereum ETFs could attract $15 billion in net inflows by the end of 2025."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQSFAtUElOT1Ridms2OThnZVhkLW02Y0FQR3lfMnB2QjJpaEtCdGNUc0o4M2IxaWFDUHZPN0ZpS09aaHZySHlqQ1pkam0yYk1iT1IzaDE2SUFwNnRza2lhaHNaQ2p4NUo4cGdKZDhxODV0TEw4MDNNMHgydXUtdDRZZGFPQXV5ZEFaWGVxSWpFYkdmSjA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Bloomberg analyst confirms Ethereum ETFs set to launch next week - CryptoSlate",
        "content": "The Securities and Exchange Commission (SEC) is anticipated to approve the spot Ethereum exchange-traded funds (ETFs) next week, with trading expected to begin on July 23, Bloomberg senior ETF analyst Eric Balchunas reported on July 15, citing industry sources.\n\nThe development follows recent communications between the SEC and ETF issuers, signaling a potential green light for the much-anticipated financial products.\n\nBalchunas revealed via social media that the SEC has instructed issuers to submit their final S-1 forms, including necessary fees, by July 17. The SEC is expected to request effectiveness after the close of business on July 22, paving the way for a Tuesday trading launch for the Ethereum ETFs.\n\nHowever, Balchunas added:\n\n“This is provided no unforeseeable last min issues of course!”\n\nThe news comes amid growing anticipation in the crypto community, with ETF Store President Nate Geraci, predicting this week as the likely approval period for spot Ethereum ETFs. He tweeted earlier in the day:\n\n“Welcome to spot eth ETF approval week… I’m calling it. Don’t know anything specific, just can’t come up w/ good reason for any further delay at this point. Issuers ready for launch.”\n\nThe timing of the SEC’s expected approval coincides with the largest Bitcoin conference of the year, adding to the excitement within the crypto sector.\n\nThe introduction of spot ETH ETFs is seen as a significant milestone for the crypto industry as it will provide investors with a new avenue to gain exposure to Ethereum through a regulated financial product.\n\nFollowing the launch, market observers anticipate substantial investment flows and the potential introduction of additional cryptocurrency-based financial products, including those based on Solana and other digital assets.\n\nBalchunas suggested that this marks the start of crypto ETFs, with other tokens set to follow in the footsteps of Bitcoin and Ethereum, starting with Solana. He said:\n\n“Keep in mind after launch there’s flows and then add’l eth products I’m sure, then Solana, and then… it’s prob never going to end. The dam has broken.”\n\nAs of press time, Ethereum was up 5.23% over the last 24 hours and trading at $3418, based on CryptoSlate data.\n\nEthereum Market Data At the time of press 12:27 am UTC on Jul. 16, 2024, Ethereum is ranked #2 by market cap and the price is up 6.94% over the past 24 hours. Ethereum has a market capitalization of $419.56 billion with a 24-hour trading volume of $18.13 billion. Learn more about Ethereum › Ethereum $3,489.98 6.94% Crypto Market Summary At the time of press 12:27 am UTC on Jul. 16, 2024, the total crypto market is valued at at $2.37 trillion with a 24-hour volume of $84.72 billion. Bitcoin dominance is currently at 53.80%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQOXNmUE55am56YURlZ21uWU93eldMRGNLY0NzSlZ6X2R5emV1TXBMRFY3UDlRSkJVNU1nOVIyRHZwcDJfQ0hfVnFkaDB5eXBhcDhXTTBQVDkzSEdTNXhSUW5HOTlXTThnU0liNUQwMHVxOHo0U3F6UDhfUFpLaWMyT0VPQTFBQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "'Ethereum Killer' Solana Could Soar To $174, Says Popular Crypto Analyst After Identifying This Bullish Pattern - Yahoo Finance",
        "content": "'Ethereum Killer' Solana Could Soar To $174, Says Popular Crypto Analyst After Identifying This Bullish Pattern\n\nInfluential cryptocurrency analyst Ali Martinez predicts a bullish run for Solana (CRYPTO: SOL), often touted as an ‘Ethereum (CRYPTO: ETH) killer,' amid growing market optimism around the digital asset.\n\nWhat Happened: On Monday, Martinez posted his optimistic prediction for Solana on X, formerly Twitter. He noted the formation of a “W” pattern in Solana’s chart, which prompted him to forecast a rise to $174.\n\n\n\n\n\n#Solana appears to be forming a W pattern, which suggests $SOL will surge toward $174! pic.twitter.com/OxXODWi1yA — Ali (@ali_charts) July 15, 2024\n\nAlso called a double bottom pattern in technical analysis, the “W” pattern typically occurs at the end of an extended bearish trend and signals a bullish reversal.\n\nSOL was last seen at around $174 more than six weeks ago in May. If Martinez’s prognosis comes true, it would mean a 13% bounce from its prevailing price.\n\nSee Also: Want to trade futures? Discover why 25 million chose this Chicago Bulls sponsor.\n\nWhy It Matters: Solana’s bullish market sentiment was supported by noted analysts in the cryptocurrency space. Syncracy Capital's Daniel Cheung predicted that the coin could reach 50% of Ethereum’s (CRYPTO: ETH) market valuation, while another trader, Eugene Ng Ah Sio, expressed confidence that it would become the market’s favorite.\n\nEarlier, VanEck and 21Shares filed S-1 registration forms with the SEC for a Solana ETF, marking a significant step towards opening up the world’s third-largest speculative cryptocurrency to mainstream investors.\n\nRead Next:\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\n1 in 4 Americans own a share of Bitcoin according to NASDAQ, how many people got started through this free crypto faucet?\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article 'Ethereum Killer' Solana Could Soar To $174, Says Popular Crypto Analyst After Identifying This Bullish Pattern originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxNa1pXS0tUY0I4LVVTOHZBbS0wMXJOYTJPVGJqeWdnZDVzZnBsU05oUjRDeTJqNnowVW8yajhYMU1GV2c2cGxndzBrNVV1ZXoxTFBibld4OXdHSjZZazBOejhva1ZKYlNxaFpTMTE4b1dXTkJZb0R2Wk1DcU80ZnRSVkk2QjJlSUdGUzJQR3U5eGx3OUFNdndFeWxHSTBGZUlVOTByXzkwSWtNOVRJZHc3UDYzWThQSGc0cVJXV3dQTkEtTnN3R0lranBwWGotRjV3T2cxa25RSkMyZmhFMi02YWpmTlZWY1JkOXNoLVBn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Spot ETFs Likely To Start Trading By July 23 Provided 'No Unforeseeable Last Min Issues' Occur - Markets Insider",
        "content": "The SEC has provisionally sanctioned at least three Ethereum (CRYPTO: ETH)-based exchange-traded funds. The trading for which could begin as early as July 23.\n\nWhat Happened: A Reuters report on Monday revealed the latest development, citing industry sources. The approval hinges on the applicants submitting final offering documents to regulators by the end of this week. All eight ETFs applications are expected to launch simultaneously.\n\nSee Also: Benzinga Bulls And Bears: Apple, Nvidia, Palantir, MicroStrategy And Shiba Inu’s Ambitious Trillion-Dollar Vision\n\nAmong the eight asset managers whose applications are likely to be approved by the SEC next Monday afternoon are BlackRock, VanEck, and Franklin Templeton. Trading in the products is expected to begin the next day, the report added.\n\nAdditionally, Bloomberg ETF analyst Eric Balchunas revealed that the SEC got back to applicants, asking them to submit final S-1 documents, including the information on fees, by Wednesday this week. He too anticipated a July 23 launch provided “no unforeseeable last min issues” occur.\n\nUpdate: Nate's instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided no unforeseeable last min issues of course! https://t.co/D21FD9Qf94 — Eric Balchunas (@EricBalchunas) July 15, 2024\n\nWhy It Matters: Following the launch of U.S. spot Bitcoin (CRYPTO: BTC) ETFs in January, the Ether products would mark another major win for the cryptocurrency industry’s push to mainstream digital assets.\n\nCryptocurrency exchange Gemini anticipates a bright future for Ethereum with the imminent launch of spot ETFs in the United States. Gemini’s research report suggests a surge of investor interest, estimating net inflows of up to $5 billion within the first six months of trading. This influx of capital could push Ethereum's value in U.S.-based spot ETFs to $13-$15 billion by the end of the year.\n\nPrice Action: At the time of writing, Ethereum was exchanging hands at $3,473.37, following a 5.95% spike in the last 24 hours, according to data from Benzinga Pro.\n\nPhoto Courtesy: Shutterstock.com\n\nRead Next:\n\nDogecoin Up 8% But One Indicator Shows It Could Explode 75% Higher Still\n\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQX2dpMnRpYW5sZlNFc3V6LWE4QlRBSmF0MmdDYVNjYkpTc1NJRHg4Ykl0ZWF1d3dRT1NRZ2poaWMwb3VHUndzbWZkZEFyMVFueTRDZ2toclhWVEpVMXVLd0RuSUNGOFdBa2RsOUFtSkFka2loRFctZ2xvdDRuY24ybEN3YXBjeTDSAYwBQVVfeXFMTlJLVmxwQmUzQnNlRVRUVHhCLTNKMzVUWWFwaTFoOFlBX3lkZVpjVWFPOU5yejUtQmczLTVVbEdMTlY4VktmTmlBYWJSMGZkMTJXTVBEOFJ2VkU3S3hJSUIyT05YSTZpUVl3ZjcwcEZPTENtR0dpQUh4ZTA3b0xKdzFXYU5fbWxyaTdZQnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval Might Change Crypto Market in Unusual Ways - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSince May, the crypto ecosystem has been anticipating the approval of S-1 registration for the spot Ethereum ETF. While top market experts have exhausted their projections regarding the timeline on which the product will launch, ETFStore President Nate Geraci said he sees no reason why the product would not go live this week.\n\nAdvertisement\n\nWelcome to spot eth ETF approval week…\n\n\n\nI’m calling it.\n\n\n\nDon’t know anything specific, just can’t come up w/ good reason for any further delay at this point.\n\n\n\nIssuers ready for launch. — Nate Geraci (@NateGeraci) July 14, 2024\n\nAs it stands, prospective Ethereum ETF issuers have come to terms to satisfy the United States Securities and Exchange Commission (SEC) by making amendments to their respective S-1 registration forms. With compromises already being recorded since spot Bitcoin ETF approval days, the market is not expecting any further delays.\n\nHowever, the concerns of many lie in what will become of the industry should the Ethereum ETF start trading. The conversation rests on its immediate impact on the market in terms of price gains.\n\nWhen the SEC approved 19b-4 filings in May, the update fueled a massive spike in the price of the coin, with a ripple effect on Bitcoin and altcoins more broadly. This rally, though short-lived, might get replayed when Ethereum ETF products start trading.\n\nThe bullish sentiment in price is already creeping in. At the time of writing, the price of Ethereum and trading volume are up 4.14% and 34.43% to $3,334.51 and $13,196,383,402, respectively.\n\nBesides price impact, the launch of the Ethereum ETF effectively lifted limitations for other altcoins gunning for similar product acceptance on Wall Street. Already, there are active applications for a Solana ETF from VanEck ⁠⁠⁠⁠⁠⁠⁠, and 21Shares has already broken the push for the product with a Bitcoin and Ethereum duopoly.\n\nThe Ethereum ETF trading and potential capital injection might confirm what crypto proponents have been projecting for a while now: fact that there is a subtle demand for mainstream, regulated crypto products."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQc29nak9sREwzTkNIck9fU2NFQmVZVUhYVHA0WTdVT0NlRWZqS1RjUmhHMDBzcHNmMzRaMXdIaUM3MEVVTWUxYnQ2UDZucWl4eEY5aGlxakpjVHNIcDBPbFRoNG9TQzQ5WFpNUDg1UUZBX2F6Nnl5SU8wS3VjdzhUdnFqYlVrWHphMm93REFPVFZQV2w1TnNFa1hyb0FLWkRQYlJOWlFIRXB2U3d4X09NOFcxa1A3YWdHdXpJazR30gHDAUFVX3lxTFBWTGdWT1kxaDlfZlFieFFQUHNzOFdDR3BCRHdRYnJPRDJsVVRvTmZCc3J6MVMyTm5hMmUtTWUyWF9lVl9IZXRzX0NrZlg5bVNvbjlIamk3UTFiOWloNW1XSE1zYzAwUGlyNjh6ODItWTFmQU1EaElyUVcyWXlIUm52QUx0R2RqX2dXQi1tcTFZejg5clBobkQtUHRNX0U1VkVlaTBtcElqWkJXTnBNSlRZZEtfOFd6Sm53aERoUkVMcGZqMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Primed To Outperform Bitcoin Following Launch of Spot ETH ETFs: Kaiko Analytics - The Daily Hodl",
        "content": "Ethereum is likely gearing up to outrun Bitcoin (BTC) after the launch of spot ETH exchange-traded funds (ETFs), according to analytics firm Kaiko.\n\nIn a new report, Kaiko says the “mood in crypto markets is much changed” since May when the U.S. Securities and Exchange Commission (SEC) approved spot Ethereum ETFs.\n\n“The mood in crypto markets is much changed from May, when the SEC approved spot ETH ETFs. Nearly two months on the new products have yet to begin trading, and ETH has fallen nearly 20% in the intervening period. That pullback doesn’t tell the whole story though, under the hood things appear to be primed for spot ETF launches.\n\nThe ETH to BTC, which measures the relative performance of the two assets, remains elevated around 0.05. This is significantly higher than pre-approval levels of near 0.045. A stronger ratio suggests ETH could continue to outperform relative to BTC following ETF launches.”\n\nAccording to Bloomberg ETF expert Eric Balchunas, the ETH ETF will launch on July 23rd.\n\nWhile the analytics firm notes the possibility that ETH could keep running higher against BTC, widely followed crypto analyst Benjamin Cowen says that the ETF launch won’t give Ethereum the boost that the market expects.\n\nIn a recent video update, Cowen said that Fed monetary policy is a larger driver of the price of ETH than the ETF and previous bullish narratives about Ethereum in the last several years.\n\n“I ultimately don’t think the spot ETF for ETH will necessarily keep the ETH/Bitcoin valuation from staying at relatively low levels… There’s been so many narratives that have been given out over the last few years as to why the ETH/Bitcoin valuation would never go to even the current levels that it’s at… In 2022 when ETH/Bitcoin was at .08 BTC, if you had told them that it was going to go down into the mid-.04s BTC by 2024 they would have laughed at you…\n\nWe have these narratives about the transition from proof-of-work to proof-of-stake on this deflationary mechanism theoretically causing the Ethereum/Bitcoin valuation to ‘hold up well’ and that didn’t play out. And so it sort of gave us a glimpse into the idea that, hey, maybe this is more about monetary policy than it is about anything else.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE4waHc3ZzQxWDdYbFZUQlpfamtxYTlJSFBvM0FiTGV3a01tV0JtWDY3Y0ZTTFR0VzZSVU4wTTlVV1g4V3M1bU5ndEl0NWFPWWxOcm4tVWJfLXBudHVFVC1WZ2dkTGc2MWQzVTRDdVBTNmlJQdIBd0FVX3lxTFBVOWRpTFZTekRWT042SUpRRk4tenFTemtWVWRZYmtXcXNaRk90T0oyTmxmakp1OGZ0aERieEU0N0ZSazJMd25sRUV0cVRRSXNqeFozbU14X2hWMG14NGk5VTdXSzA2azdXRUFXc28wNmhOdUxmOTQ4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Launch Date Announced by Top Analyst - U.Today",
        "content": "According to Eric Balchunas, Bloomberg's senior ETF analyst, Ethereum exchange-traded funds are set to be launched on July 23.\n\nAdvertisement\n\nProspective issuers have been asked to re-submit their final S-1 forms on Wednesday by the U.S. Securities and Exchange Commission.\n\nNotably, the launch of Ether ETFs will take place right in the middle of the Bitcoin 2024 Conference.\n\nIt is worth noting that the launch of these products could still be delayed due to last-minute issuers.\n\nAdvertisement\n\nEarlier today, Nate Geraci, president of the ETF Store, said that he could not come up with a \"good reason\" for the SEC to further delay the launch of these products, adding that issues are ready.\n\nAs reported by U.Today, the SEC approved 19b-4 filings for various spot Ethereum ETFs back in May in what appeared to be a major U-turn. Just days before the approval, these products were widely expected to be rejected by the SEC.\n\nHowever, there is still a lot of uncertainty regarding the level of demand that these products will manage to attract.\n\nFor instance, banking giant JPMorgan has predicted that these products will severely underperform compared to Bitcoin ETFs. However, crypto-native firms of the likes of Gemini expect Ethereum ETFs to be moderately successful.\n\nNotably, Coinbase researchers have forecasted that the launch of Ether ETFs could be either bullish or bearish for crypto markets depending on the amount of inflows.\n\nRegardless of how successful these products are going to be, the launch of the first spot altcoin ETFs would mark a historic shift.\n\nIn the meantime, VanEck and 21Shares have already submitted Solana ETF applications. However, analysts believe that their approval is unlikely to happen this year."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOOEV2UGo5YW9jYlQtUGtZdWJwS2RiM0laZ0pzN19jNEJTeC1xcG40VE1Vbmwyb2pfLVRTM2QtUjJ3UFY0ZUN4dk1fZnp5N0VRWE5jdXJzbkVZcjZQZlhtY0dGVi1FSm1UOHBMSUxjOWpiaFZtcWh3MW1zWFJoRWJlVHMzTWFRU1RoaXBHV0xzZU91QnhMc1A2WUItdF9MX3FCaE51Q1lJTUVEeDltU0RtRE1sVVMzOEpQMC1XTVJSNm1LVEpwMnAtdzJNZHRlbEdCNW5tVXdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "The increase in the price of Ethereum and some predictions for ETFs: what does it mean for the market? - The Cryptonomist",
        "content": "The price of Ethereum recently surpassed $3,300 as investors anticipate some predictions regarding the imminent approval of exchange-traded funds (ETF) based on ETH, expected this week.\n\nLet’s see all the details below.\n\nGrowth forecasts for the price of Ethereum after the launch of ETFs\n\nAs anticipated, Ethereum has marked a new peak of $3,331 this week, driven by the growing expectations regarding ETH ETFs.\n\nNate Geraci, ETF expert, stated that there is no reason for further delays in the approval of spot ETFs on Ethereum, expected by the end of the week.\n\nAccording to Geraci, several companies, including VanEck and 21Shares, have updated their filings in the hope of obtaining final approval from the SEC to launch ETFs on Ether.\n\nThese funds are seen as a crucial catalyst for the price of ETH in the coming months. In particular with forecasts of a significant influx of capital, potentially up to 10 billion dollars.\n\nTom Dunleavy, managing partner of MV Global, has predicted that this new form of investment could lead Ether to reach new all-time highs by the end of the year.\n\nContrary to common perception, Dunleavy believes that ETFs on Ethereum may represent a more attractive opportunity for traditional investors compared to those on Bitcoin. This is due to the clarity of the narrative and the robustness of Ethereum’s technology.\n\n“Ethereum has cash flows. It can be described as a tech stock, the app store of cryptocurrencies, or an Internet bond. This is a much easier sell for financial advisors compared to digital gold.”\n\nAccording to the data from TradingView, Ethereum has grown by 16% compared to the previous week, rising from $2,909 to $3,331.\n\nThis increase reflects not only the confidence of investors in the potential of ETH ETFs, but also a renewed focus on criptovalute in a broader market context.\n\nThe future of Ethereum now seems tied to the decision on the listing of ETFs, with analysts estimating a significant impact on prices and a potential to rebalance the gap accumulated compared to Bitcoin in the last 18 months.\n\nThe sale of Bitcoin by the German government shakes the market: Ethereum shows resilience\n\nThe recent announcement by the German government to liquidate 5,000 Bitcoin, equal to 90% of its reserves, has triggered a significant drop in the price of Bitcoin, falling below $57,000.\n\nThis happens despite Bitcoin’s attempt to reclaim the $60,000 threshold, demonstrating the difficulties in maintaining this level. In contrast, Ethereum has maintained a remarkable stability, highlighting its resilience in the face of market turbulence.\n\nThis difference in performance between Bitcoin and Ethereum has captured the attention of analysts and investors. Specifically, considering it a crucial testing ground for Ethereum’s ability to withstand market fluctuations.\n\nIf Ethereum continues to remain stable, it could indicate a reduced dependence on Bitcoin’s price fluctuations, representing an important step forward for the bull sector of cryptocurrencies.\n\nIn the context of this Bitcoin sell-off, the cryptocurrency community is awaiting the approval of an ETF on Ethereum.\n\nWhile some analysts remain optimistic about the trajectory of Ethereum’s price, technical analyses offer a mixed picture.\n\nVarious cryptocurrency experts predict that Ethereum could reach $5,000 soon, identifying key support and resistance levels crucial for its future price movements.\n\nThe experts have identified a significant support zone for Ethereum between $2,800 and $3,300, considered essential to maintain a bull perspective.\n\nIf Ethereum continues to be traded in this range, it could be on the right track to reach $5,000.\n\nDespite the positive forecasts, the market shows mixed signals. According to CoinCodex, the price of Ether should increase by 3.68% by August 13, 2024.\n\nHowever, the fear and greed index reflects a negative sentiment, with Ethereum having recorded only 50% of green days in the last month."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNVmZ6TUNpeGNWNlpxaEt4SzI3akJKTndhLTZYZ2dNYlJROTd0bHNNX0RJMzktNE1JV3hSSUtyZndNenRKTkNGZTlkMVhZSjUyVFJmc3V4WWxiejdpcGZmNUpGSDNtajRHYkRTNTlqLTRyVDNwd2tTZXRSOFAzRVpLQlI4WkxDVEpjNjUzRlJGRE8zZk9ra3lZYzdQX0ViSVJBMm14eU52OWFDU1JwTGNiQlpSWGJhVjF5SHkwedIBwgFBVV95cUxQc3hWRDFCTTJOWnZVcGt2ekxUN1dzbTZQQWg0NXZvVGFJRHN5TTVLVmFkanY5UXdCU1BpZ1B0MHgzbFdJTFV5ck9XQ0E5MzlxYXNPVnNJcHRhbHdxUzNBZmNfRk9tX3AzOVI2bXNmdFRvc1lfTmdtUlRNdHhLVnhKTVBkRTQ5NEtXMHNMUHZoUklUQnh6blk0TFQ3a2FPd0V0YWotN2lMUGVBNk9xUnBGQkU2RW1yQVRKcmFTOExXZlQydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum set for new all-time high: Peter Brandt, Bitwise - FXStreet",
        "content": "Ethereum ETFs will push ETH to a new all-time high above $5,000, says Bitwise.\n\nCiti predicts ETH ETFs will attract around $5 billion in net inflows within six months of launch.\n\nPeter Brandt suggests ETH could rally 60% if it makes a key move.\n\nEthereum (ETH) is up nearly 2% on Tuesday following predictions from Bitwise chief investment officer (CIO) Matt Hougan that ETH ETFs could help push ETH to a new all-time high above $5,000. Other predictions from Citi Bank and trader Peter Brandt also align with Hougan's position.\n\nDaily digest market movers: Ethereum ETFs deciding factor for new all-time high\n\nBitwise CIO Matt Hougan predicted that inflows across Ethereum ETFs will boost ETH's price to a new all-time high above $5,000.\n\n\"By year-end, I'm confident the new highs will be in. And if flows are stronger than many market commentators expect, the price could be much higher still,\" said Hougan in a recent memo to investors.\n\nHougan believes ETH ETFs will have a bigger impact on ETH's price than Bitcoin (BTC) ETFs had on BTC due to the new demand that ETFs bring to commodities without altering their fundamentals. BTC has seen a 110% rise since October, when Bloomberg announced the SEC would likely approve Bitcoin ETFs.\n\nBitcoin’s Returns since January 2023\n\nHe compared Bitcoin's previous 1.7% inflation rate to Ethereum's, which has hovered from negative to 0% in the past year. ETH has maintained such a deflationary status since the implementation of Ethereum Improvement Proposal 1559 (EIP-1559), which reduces the amount of ETH in circulation upon every transaction on the Mainnet.\n\n\"Significant new demand meets 0% new supply? I like that math. And if activity on Ethereum ticks up, so does the amount of ETH being consumed. That's another lever of organic demand working in investors' favor,\" stated Hougan.\n\nHougan also highlighted how the lower economic cost of Ethereum's consensus mechanism reduces the selling pressure on ETH, unlike that of Bitcoin miners, who have to sell a portion of their holdings to cover up costs.\n\nLastly, he mentioned how increased staking and ETH usage in DeFi protocols have already removed over 40% of ETH off the market.\n\nHougan believes these factors, combined with his earlier predictions of ETH ETFs raking in $15 billion in the first 18 months of launch, primes Ethereum for a new all-time high.\n\nMeanwhile, banking giant Citi predicted in a research report last week that Ethereum ETFs could see up to 30%-35% of the flows seen in Bitcoin ETFs. That would give an equivalent of about $4.7 billion to $5.4 billion of net inflows, noted Citi analysts.\n\nThe Securities & Exchange Commission (SEC) will likely greenlight ETH ETFs for trading next Tuesday. This follows updates from Bloomberg analyst Eric Balchunas and Reuters, which claimed sources told them the regulator asked issuers to submit their final S-1 drafts this week in preparation for a Tuesday, July 23 launch.\n\nETH technical analysis: Could Ethereum rally 60% to $5,627?\n\nEthereum is trading around $3,460 on Tuesday, up over 2% on the day. In the past 24 hours, ETH witnessed over $45 million in liquidations, with shorts leading the line at $25.36 million and longs at $19.92 million in liquidations.\n\nETH's options open interest has risen 13% in the past 24 hours to $6.66 billion. Open interest is the total amount of unsettled contracts in a derivatives market. An increase in options OI combined with price growth indicates a potential for more upside in a market. As a result option traders could be expecting higher ETH price and are reacting accordingly.\n\nThis aligns with a recent prediction from popular trader and analyst Peter Brandt.\n\nBrandt predicted that ETH could see a new all-time high soon after finding support at around $2,800, the lower boundary of a four-month plus rectangle, \"which was a retest of the Feb completion of a horn bottom.\" If ETH can complete a move to the rectangle's upside of $4,093, Brandt suggests that it could set a new all-time high at $5,627.\n\nETH/USDT Weekly chart\n\nIn the short term, if ETH rises above $3,502, over $34.8 million worth of short positions will be liquidated from the market."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBFMlc5M0RlNlF4ZS1neWxEUVcxNktQUGxnQkdpaEhwUWdDMG9PS2ZYTmhoWlg2R0tYLXNtYmM4cUVCTkRrTjk2em9mTXlQZXJiTlZRQU53UFNwdFJxblEyQVctaGRwcXZYdGlrWEVQeVZSdkZfTm1MeNIBfkFVX3lxTE0wei1sWTV0azZGV0JMckRNbTUtdWV1VDkxcXRzNURnZW8ycTNucHhXaXV6d2FlZXVJdGV0QjZTZlhwU295WmowcExoOWtuTnAyZjRVQThrRm91b1Q4WERvTzdQMlVIOTFqbk5qVVpBcWtfQ3Z5eVVmR2xzbm5GQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Bull Run Sustained, Bad News: Speculators Are In - Bitcoinist",
        "content": "Like Bitcoin and top altcoins, including Solana, Ethereum is holding steady. At the time of writing, it is trading above the local support at $3,300 and floating higher, targeting $3,700.\n\nSpeculators Flowing To ETH As Bulls Set Sight On $3,700\n\nThe leg up is fueled by multiple market-related factors, mainly the anticipated launch of spot Ethereum ETFs in the next few days. As seen from the daily chart, news of the United States Securities and Exchange Commission (SEC) fast-tracking the approval of 19b-4 forms sparked a wave of demand from May 20.\n\nHowever, speculators are permeating the scene even as prices remain steady and uptrend. CryptoQuant data shows that the estimated leverage ratio has risen in the past few trading days.\n\nWith this reading ticking higher, the ETH scene receives more leveraged traders keen more on profiting from price volatility rather than benefiting from what ETH as a digital asset presents.\n\nAccording to CryptoQuant, the estimated leverage ratio stood at 0.347 on July 16 before rising to 0.354 on July 17. The expansion suggests that traders are increasingly borrowing funds on perpetual trading platforms like Binance and OKX, hoping to make a killing if ETH bulls push prices above $3,700.\n\nAs prices rally, the estimated leverage ratio will likely climb even higher. The local top is at 0.358, as recorded on July 14. The all-time leverage ratio was at 0.392, registered in early July 2024.\n\nEyes On Spot Ethereum ETFs: Will It Be A Success?\n\nEthereum traders are confident that prices will rise, even breaching all-time highs, once spot ETH ETFs are launched. The latest reports show that the derivative product will launch early next week, allowing institutional investors to gain exposure.\n\nThe United States SEC has given the green light to three issuers to launch. However, it is expected that all spot Ethereum ETF applicants whose 19b-4 forms have been approved will be permitted to launch simultaneously.\n\nConfidence is high that spot Ethereum ETFs will follow the success of their spot Bitcoin ETFs. According to SosoValue, all spot Bitcoin ETF issuers manage over $53 billion of BTC as of July 18.\n\nEven so, though highly anticipated and likely to positively impact prices, the product will see a different level of demand than when spot Bitcoin ETFs launched.\n\nAnalysts pin this to Ethereum’s lower market cap and the United States SEC’s decision not to allow spot ETF issuers to stake ETH. By staking, issuers would receive rewards on behalf of their clients.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFB1NkdKU3JWTENIbFYyTkN1T1RiU0ZrUnZGa3NxYjI0aW8xSHN1OHBBX3plcmtlVl9GeTY0Y2l0Mk03ekxaTDRMTGphY0ZtdDRBWEtLZU1nbDFiWk8xZzJ3a2VXdXVHY0VuZEdsankwNVQ0N3o2Z0NSQUlB0gGCAUFVX3lxTE9ydnNpME5wNmhBRWtPc1pROGJucVpiOUhkd0Fmc0hJZXNndlA1VUcxdWNKLXcwRUpDcEJucUZ6eHZndGVrbGM4TFpTYXF5SU5kd3VzbzFsQWdMbGhNWS03VjhocFdxOVJrcFBDaEgwQ3JLSTFMLXRoSHF0N3RfdjYydmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs to Start Trading Next Week as SEC Gathers Final Drafts, Sources Say - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Securities and Exchange Commission (SEC) is telling asset managers to submit final versions of registration statements for spot Ethereum ETFs by Wednesday, with the products’ launches slated for July 23, two sources familiar with the SEC’s process confirmed to Decrypt.\n\nThe approval process for spot Ethereum ETFs has been notably slow since the regulator’s abrupt approval of spot Ethereum ETFs in May. Allowing investors to gain exposure to Ethereum through a traditional brokerage account, anticipation has increased steadily since.\n\nThe SEC’s recent communications with asset managers were first reported Monday by Bloomberg ETF Analyst Eric Balchunas, who wrote on Twitter (aka X) that the finalized registration statements should also include each fund’s respective management fees.\n\n“Hearing [the] SEC [has] finally gotten back to issuers today, asking them to [...] request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH,” he wrote, adding that the timeline could change due to “unforeseeable last min[ute] issues.”\n\nAD\n\nAD\n\nThe details were confirmed to Decrypt by two separate sources, one of whom affirmed receiving similar communications from the agency.\n\nWhile the SEC approved key filings for spot Ethereum ETFs in May, the regulator has yet to green light individual s-1 filings from eight asset managers, including BlackRock, Fidelity, and Grayscale. Previously, SEC Chair Gary Gensler said that the approval process is dependent on ETF hopefuls providing investors full disclosures—but that it was still “going smoothly.”\n\nFollowing the approval of spot Bitcoin ETFs in January, which have seen around $15.8 billion in inflows so far this year, the launch of spot Ethereum ETFs could be a relatively big moment for crypto’s second-largest coin by market capitalization. Per K33 Research, spot Ethereum ETFs could draw up to $4 billion in inflows within their first five months.\n\nStill, as the approval process has played out, Ethereum’s price has faded from a peak in May of around $4,000. The asset’s price has climbed 15% over the past week to around $3,400, yet it plunged as low as $2,900 earlier this month.\n\nAD\n\nAD\n\nAdditional reporting by Liz Napolitano. Edited by Ryan Ozawa."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOSklYZmpsZmFnZDdHYXR3VjZ4R3dGZWxsd3AxelprWDJiSzdXY1g4SWM3cmFyUGdST0RESjBsT214WjFIRlYyT3RBdjBRb0dac2YtVW1ZVHhwbHdfa2otQWZLMHQweXhzOVNfZW9hVGR2SmxWVWI3ZjJRMEJEeUd6R285T2pKT2hGZ05Ga1MxbGE1Nm9DX2h5WWdCZFJzT2RkNG9qaE5fZHhlYjFBcmF5Z2lXUjQ4alJ0N3dscm93?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Eyes $4k Rebound ahead of July 23 - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQZWZrcHJMUHhTanZiZE56anlFbW4wYm1hdzRBRVZlN2JNOFFkMXNNUWdVOW5qMTFVVTQxenZrdEdYMWtkQldSOGc5cFlqRmFfaUtrTzFtbmFDODFoSDJpd0NyOFhZQ2ZDWnRaR1Jna2pMRTh4blB6c1JLLUI4QUI0VWNmVS1ocEtjS2ZGckplaFN4UF9zM3dHcHhuLUtOZ3FGb0Nha1JIUmZ2cDlNN0pJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Breaking: Bloomberg Analyst Announces Ethereum ETF Potential Launch Date - Crypto Times",
        "content": "A recent tweet shared by Bloomberg’s analyst James Seyffart on July 15th suggests that the U.S. Securities and Exchange Commission (SEC) may be close to approving spot Ethereum Exchange-Traded Funds (ETFs).\n\nAccording to Seyffart, the SEC has requested that ETF issuers submit their final S-1 registration statements by Wednesday, with an effective date set for the following Monday.\n\nLooks like launch date for the #Ethereum ETFs will be next week on Tuesday July 23rd https://t.co/fm8RW6AvTJ — James Seyffart (@JSeyff) July 15, 2024\n\nThis timeline points to a possible launch date of Tuesday, July 23. The timing also coincides with The Bitcoin Conference in Nashville, an event expected to draw significant attention to the cryptocurrency sector.\n\nThe approval process for spot Ethereum ETFs has involved several stages. Previously, the SEC asked for updates on the necessary 19b-4 forms, which are crucial for trading new ETFs on stock exchanges. These forms are essential for implementing the ETFs, especially considering the regulator’s review cycle has undergone multiple changes and extensions in recent months.\n\nIf approved, spot Ethereum ETFs would follow a similar introduction of spot Bitcoin ETFs in the U.S. market. This progression indicates a growing acceptance of cryptocurrency-based investment products by regulatory bodies, despite previous concerns about market manipulation and investor protection.\n\nEthereum, as the second-largest crypto by market capitalization, has long been viewed as a strong candidate for ETF approval.\n\nWhile the cryptocurrency space remains optimistic about the potential approval, it’s important to note that last-minute changes or delays are still possible. The SEC’s decision will likely have significant implications for both the cryptocurrency market and traditional finance sectors."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNOHVxT1RlV3dDZXZWRElOX2VrSWdwQTdCcFFGSmc1R3N5SDgtWnNYWlVIQ0pIQy1vcmxnakhDWkZZV196c0hoXzhsaGdxMGJjOHVLcVl6N2FqYlk4MTdmczlXOEpCTGFWLUxaZVBSUGtESlNvSlRlLTZfMFlpbnRoZlBlUWxXc213bDFVRzFIdkNuX3lpeDdiWWdTaFBBR211OWRaby1LUFZucDZ1cEhHUkc1ZWVtOWZsZnhybVZDYkhUS0JaVEFoYXRoVEtkT3Y2dElVa0cwdTbSAd4BQVVfeXFMTzB2eEdzdkRpcmd6M1JzemU0RTdhejZpd0pMenNDQmZOT2U2OEtnOUJGQ3R5d1VSRXJEWFhySk9qTWpQY2wyQ25SS2lESWdsYmhSSHh4UUpPZU5uWnpvWVJPcUxaeVdMUlhDZEtEVEFDVXNPRHZZQmJkX2lMLU9QQ0JGcTUtVWp3LUlKT0ZVWHdXX0ZaX3FpVEd0eHlFLUwwcVFNLTRoVmVseFQyWkJJLWd6VFg5SGpBdEdla0xpS1l5ZWVkaE1Xem1BMy16TVZjYWFWdG5ycVZYZk5NNUp3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs to launch next Tuesday. Here’s why ETH's price could be set to explode - FXStreet",
        "content": "SEC preparing Ethereum ETFs to launch next week Tuesday after asking issuers to return final S-1s, says Bloomberg analyst.\n\nEthereum investment products raked in $72 million in inflows, its highest level since March.\n\nEthereum could set a new yearly high in the coming weeks after ETH ETF approval.\n\nEthereum is up more than 7% on Monday following updates from Bloomberg analysts that the Securities & Exchange Commission (SEC) would potentially greenlight spot ETH ETFs to launch next week Tuesday. The increased inflows across global Ethereum investment products also align with the new development, as traditional investors seem to be preparing for a potential rally ahead of the launch.\n\nDaily digest market movers: Why ETH ETFs could perform well\n\nIn an X post on Monday, Bloomberg analyst Eric Balchunas said that the SEC plans to launch Ethereum ETFs on July 23 (next Tuesday) after responding to issuers today. Balchunas highlighted that the SEC asked issuers to submit their final S-1s with fees included on Wednesday before the launch can take place.\n\nThis may be highly bullish for the entire crypto market, considering the Bitcoin conference will be taking place next week, and US presidential candidate Donald Trump is listed among the speakers.\n\nUpdate: Nate's instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided no unforeseeable last min issues of course! https://t.co/D21FD9Qf94 — Eric Balchunas (@EricBalchunas) July 15, 2024\n\nReuters also reported that three industry sources confirmed that the SEC gave \"preliminary approval\" to at least three issuers to launch their spot ETH ETF products next Tuesday, provided they submit their updated S-1s before the week runs out.\n\nEight issuers, including Grayscale, Fidelity, BlackRock, 21Shares, VanEck, Bitwise, Franklin Templeton and Invesco, will potentially launch their spot ETH ETFs on the same day.\n\nThe SEC approved issuers' ETH ETF 19b-4 filings last week but needs to greenlight their S-1 registration statements before the products can begin trading. Issuers submitted their updated S-1s with the SEC last week after the agency made light comments on them.\n\nMeanwhile, traditional investors are turning bullish on Ethereum as the ETH ETF launch draws closer. This is evidenced in the recent weekly performance of global Ethereum ETFs, which witnessed inflows of about $72 million, its highest level since the market rally in March, according to data from CoinShares.\n\nWhile some analysts have predicted that ETH ETFs may underperform, the recent growth across international Ethereum ETFs suggests otherwise. Additionally, most bullish investors speculate that ETH's low circulating supply due to locked ETH in staking protocols would allow the ETF inflows to spark a significant surge in ETH's price.\n\nEthereum CME open interest (OI) has also been growing faster than other derivatives exchanges, indicating a growing appetite among US investors for the largest altcoin.\n\nETH technical analysis: Ethereum could see a new yearly high\n\nEthereum is trading around $3,430 on Monday, up over 7% on the day. ETH's rise follows a general recovery across the crypto market after crypto investors reacted positively to presidential candidate Donald Trump's escape from gunshots during a rally in Pennsylvania.\n\nAs a result, over $23.31 million worth of ETH short positions were liquidated whereas long liquidations significantly reduced to $3.86 million in the past 24 hours.\n\nETH's Long/Short Ratio, at 1.04, also shows the shift in market sentiment. The Long/Short Ratio estimates the total number of longs versus shorts in the market. A ratio above 1 suggests bulls are in control, and vice versa if it is below 1.\n\nETH/USDT 4-hour chart\n\nThe recent change in market sentiment, combined with the potential approval of spot ETH ETFs on Tuesday, could propel ETH above the $3,974 to $4,093 resistance to set a new yearly high. On the downside, the $3,200 price level could serve as key support.\n\nIn the long term, trader @CryptoYoddha predicted that Ethereum could reach $13,654 in 2025 as its consolidation over the past few weeks suggests potential for higher growth.\n\nETH All-time chart"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFA0ZENWMzF2MXJSVVFNVHA4SDdGaHVObVJnSF9hOEVGVDc5Sk1IcnJkVkRYc2JtYUU5elk5WlU2S1p5YWw5NEwzZ0VMRzU0bENEYUZncV9hS3FsWjZtaXYzandjRTdPajBZMzRzQXltRXVRaXRRRkNWNg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Hits Record $3.3K Amid ETF Hype - TipRanks",
        "content": "In a whirlwind week for Ethereum (ETH-USD), the cryptocurrency soared past the $3,300 mark, buoyed by growing anticipation surrounding the imminent approval of spot Ethereum exchange-traded funds (ETFs). According to Cointelegraph, analysts like Nate Geraci are betting big on this development, predicting that the SEC could greenlight up to eight ETH ETFs by week’s end.\n\nETF Approval Imminent\n\nNate Geraci, known for his sharp analysis at The ETF Store, is feeling positive about the chance of spot ETH ETFs launching this week. According to Cointelegraph, Geraci and insiders close to the process believe there aren’t many hurdles left, hinting that ETF approvals could happen smoothly.\n\nEthereum’s Meteoric Rise\n\nEthereum’s price shooting past $3,300 shows how confident the market is about ETFs. Experts like Tom Dunleavy from MV Global predict a flood of money from big investors once these ETFs kick in. Dunleavy, speaking to Cointelegraph, described Ethereum’s appeal as a tech stock of the crypto world, simpler for regular investors to grasp compared to Bitcoin.\n\nEthereum’s Recent Developments\n\nWhile ETFs are in the spotlight, Ethereum’s basic setup is making big improvements. According to Cryptoquant, Ethereum developers are talking about projects like Pectra and PeerDAS. These projects aim to make Ethereum faster and safer, which is crucial for its long-term success.\n\nWhat Lies Ahead for ETH?\n\nWith ETH now trading around $3,357 and climbing, all eyes are on what’s next for Ethereum. The big focus is on two things: how regulators will decide on ETFs and what new tech updates are in the pipeline. Analysts and investors are glued to these details, expecting them to shape how Ethereum performs in the months ahead. Additionally, if these spot ETH ETFs get the green light, it could turbocharge Ethereum’s price even more."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxORVp3R2cySnFfUnN3S0hKb3oxUVlmbG1SSXhFd3FheFFwS3R2ZWdvRTZ2VXRmeURaZDNNVW5YNEpsWkhEdXhRUWRoNFBEVVpXMXFlWlNHMW8tWVZfeno4MWJUSnFjN24ySE1sSW9CZUtTVm1uVDN2bnVvdjFlc3VxaEw4bkNJQVFLQjY4YzlR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval: A Turning Point for The Crypto Market - Watcher Guru",
        "content": "Ethereum ETF approval will reshape the crypto landscape from its base. This change could be an essential milestone for digital assets.\n\nThe anticipation is, of course, building by the day, as Ethereum ETF approval will have a major impact on the broader market. This makes Ethereum ETF a focal point for investors and analysts.\n\nAlso Read: Top 3 Cryptocurrencies That Could Hit ATH Post Ethereum ETF\n\nExploring the Impact of Ethereum ETF Approval\n\nAnticipation Builds for Imminent Launch\n\nThe crypto community is buzzing with excitement about the possible launch of spot Ethereum EFTs. Industry leaders, including Nate Geraci (president of ETF Store), expressed optimism about the U.S. Securities and Exchange Commission (SEC) finally giving the green light.\n\nWelcome to spot eth ETF approval week…\n\n\n\nI’m calling it.\n\n\n\nDon’t know anything specific, just can’t come up w/ good reason for any further delay at this point.\n\n\n\nIssuers ready for launch. — Nate Geraci (@NateGeraci) July 14, 2024\n\nAs you can see above, in a recent post, Geraci stated:\n\n“Welcome to spot ETH ETF approval week. I’m calling it. Don’t know anything specific, just can’t come up with a good reason for any further delay at this point. Issuers are ready for launch.”\n\nBloomberg analysts Eric Balchunas and James Seyffart also have the same opinion. They suggest that these ETFs could debut in mid-July.\n\nThe SEC is well-known for giving minimal feedback on final registration statements. This can be interpreted as a positive and can suggest that the application is nearing approval. Furthermore, the SEC has made minimal changes to the latest filings.\n\nWhat Will the Market Response Be?\n\nThe anticipation about a possible Ethereum ETF approval has already boosted its price. ETH is currently trading at $3.342, with an enormous jump from $2.909 just a week ago.\n\nThe technical analysis of the charts shows a bullish trend, with Ethereum trading above $3.280 and the 100-hourly Simple Moving Average.\n\nAlso Read: Ethereum ETF Inflows Could Hit $10B, Sending Ether to New ATH\n\nPotential Ripple Effects on the Crypto Ecosystem\n\nInstitutional Interest and Investment Inflows\n\nSpot Ethereum ETFs, as mentioned previously, have generated quite a bit of excitement for investors and financial advisors.\n\nBitwise Asset Management projects that these ETFs could attract $15 billion in net inflows until the year 2025 ends.\n\nIf this is true, this influx would explore Ethereum’s value and validate its current price revival.\n\nPaving the Way for Other Altcoin ETFs\n\nThe approval of Ethereum ETFs might put its foot in the door for other altcoins that want a similar product acceptance on Wall Street, and here are some of them:\n\nActive applications for a Solana ETF from VanExck\n\n21Shares has expanded beyond the Bitcoin-Ethereum duopoly\n\nAs a result, we could expect a more diverse range of crypto investment products in the future.\n\nAlso Read: VanEck Officially Files S-1 for Spot Ethereum ETF\n\nThe approval and the following trading of Ethereum ETFs could be an excellent marker of the growing demand for more mainstream and regulated crypto products.\n\nIt remains to be seen if the SEC’s decision will boost ETH ETFs to a new level. We’re eagerly awaiting their conclusion."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQWU5SR3hEYUlHYi1zeXdCR0FFRmlyZDZucGhvUF9Xc0N0WUhXWm42TmhkQUx2Rm5Wd25iYm5tM1FNSXhKTEFuOHpya1NCczBJbkRSRWFQU2JPTVBfWkFFRHB5aGY1TnE5UWVGeFZtUDJ4eDA3M2FTc0VOTlp4amxySVBfUUdXb21iNGFMU3Z3aHRMTGvSAZgBQVVfeXFMTU1xYXlkVXlUU3lwOFBCQWxiNGh2UEthak5hWUM4dUNSYU4wbk0zQ1dEeGdBamJMSFE0OFhqQUp5YkhybE1kSnFzWGZxck4yVmhxOUFaZUNWem5qLUk3MUtfQUExYlQ4cEFrcm1FMmp4TVFONnJsRnNIb0llWWVoWWRNcnNINmtIWUlWZE9kX0pUZnhKNnRlMUM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Legendary Trader Peter Brandt Issues Extra-Bullish Ethereum Price Outlook - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nVeteran trader Peter Brandt, regarded by many as a legendary figure on the financial markets since the 1970s, has sparked a wave of optimism in the Ethereum (ETH) community with his latest analysis. Brandt, known for his expertise in technical analysis, identified bullish chart patterns suggesting a potential price surge for the leading altcoin.\n\nAdvertisement\n\nThus, Brandt pointed to a \"four-month rectangle\" on the Ethereum price chart. This technical indicator suggests a period of consolidation, where the price has been trading within a defined range. In his view, this consolidation could be a precursor to a breakout, potentially propelling the price of ETH up north.\n\nFurther bolstering his bullish outlook, Brandt identified a bullish \"horn bottom\" pattern. Explained simply, a horn bottom is a reversal pattern where the price dips down twice but fails to break a key support level, forming a hornlike shape. This pattern is often seen as a sign of accumulating buying pressure and a potential price increase.\n\nAdvertisement\n\nA perspective on $ETH\n\nSupport was found at lower boundary of 4+ month rectangle, which was a retest of the Feb completion of a horn bottom\n\nTarget, pending upside completion, is 5600+ pic.twitter.com/EThcM61KpW — Peter Brandt (@PeterLBrandt) July 15, 2024\n\nTo illustrate his analysis, Brandt reportedly shared a price chart highlighting the identified patterns and his target price for ETH. This target sits comfortably above $5,600, a significant jump from current levels.\n\nBrandt's bullish call coincides with exciting developments surrounding a potential Ethereum ETF. Industry experts suggest the SEC might grant preliminary approval to several proposals by next Tuesday, July 23.\n\nAn ETF would allow investors to gain exposure to Ethereum through a traditional investment vehicle, potentially attracting new capital and boosting the price."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNbjlGbTNseEpyMlNGSEd1OEk3QU9rdE1nUlNVejNTcU5jRExTVkpaYjNWbC1Ob0l3ci1UUEtDbDhubFNraGR6NlR1bVI5T05OYTN0VlFQVXJDZzFjODBFSTZzVjUxeDBuUE9yVHF0TGZfUFdibjM3cXVvdWU1MFJrdXJvV01DVGNhLVdBRDFQZlhlRE5qN2xDOG5pVHdYdWlEc3RDeHMxM3ZhSW1vNzZFc9IBtgFBVV95cUxNSk5aSWdwTkoxQUxSNHBPV01ESV9URnpoaU5zOUR4UHV2aFFuOU5wMVBXOGxpUXpWaVp1S2Vfd09KMGZUVUdTOWJOTGE5TVE2M1ZKNTI2dnA4cDdIS3hSX1JQenBhZC1CNWdyTjdoanVaY3ZIT1RwM25hYV9XeWwxUExqcFJmWV92RWVlMVpFN1BXanQyRHFjQUZrQThxY0xpX0EtbWlIRzNYN2ZjOExySnNPOXpMUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Retakes $3.3K As Analyst Sees No Good Reason For ETH ETFs Not To Launch This Week - ZyCrypto",
        "content": "Advertisement\n\nThe price of Ethereum’s Ether (ETH) has rallied back above $3,300 as the long-awaited spot ETF exchange-traded funds (ETF) move closer to reality in the United States. One popular analyst anticipates that the ETH-based products could debut as soon as this week.\n\nAs of press time, Ether is trading for $3,375, up 13.6% from a price of $2,905 in the last week, according to CoinGecko data.\n\nPath To The Spot ETH ETF\n\nThe U.S. Securities and Exchange Commission (SEC) is expected to soon greenlight the launch of a handful of Ethereum-based exchange-traded funds (ETF) that can directly hold ETH.\n\nNate Geraci, president of the ETF Store, believes these ETFs will begin trading by the end of this week. In his opinion, there’s no reason for further delays as potential providers are ready for launch and recent filings require few modifications.\n\n“Welcome to spot ETH ETF approval week. Don’t know anything specific, just can’t come up [with] good reason for any further delay at this point,” Geraci posited in a July 15 post on the X (aka Twitter) platform.\n\nAdvertisement\n\nAnticipation for the trading of spot Ethereum ETFs has risen drastically since the SEC’s last-minute approval in May. While the regulator approved eight form 19b-4s, it has yet to green light individual S-1 filings from asset managers, which are required for trading to kick off.\n\nSeveral would-be issuers, including VanEck and 21Shares, submitted amended filings this week in hopes of securing the SEC’s final regulatory blessing to start listing spot Ether ETFs on U.S. exchanges. It’s worth mentioning that applicants edited out the parts of their applications that would have allowed staking the ETH holdings in the fund to appease the regulator.\n\nImplications For Ether\n\nThe race to launch an ether ETF is already heating up. Asset managers Invesco and Galaxy revealed they would charge a 0.25% management fee for their proposed spot ETH ETFs, a little higher than VanEck’s 0.20%.\n\nIndustry pundits foresee the approval of spot ETH ETFs having a huge impact on the Ether market as well as the wider crypto industry.\n\nThese spot ETH ETFs could attract remarkable retail and institutional capital into Ether, potentially mirroring the resounding success of spot Bitcoin ETFs. Bitwise CIO recently suggested the ETFs could draw in well over $15 billion in inflows within the first 18 months after the official launch — which would spark a massive surge in Ether’s spot price.\n\nNotably, other analysts expect Ether to outperform Bitcoin after the rollout of ETH ETFs."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNU3NZZ0FHN0ZUMnlNN0JiRTI0ejJEZGcxMUNmei11NjFwMllzYzRsUU1UT0VnYzhuMjBXV3VKSFp6LWJXaTc5TlIzdGFUVnJsOHdoYkw4RUNSVExDNFM3eXd6VWY0bi1nZUxhbFYtZHJWZkxiMGptODU4UjI3NFpublpRVUJ2N2FBMmhmdXRjNWlJOHZhanE2Wlh5TFNwdTl1cGdMMXBfMTZBaUFhclMwSUtpV2UyLTk0UjktaWM2Nzd4dGNpRTU3UHpYUGM0ZEJhY0EtU05PZUTSAd4BQVVfeXFMT2YzRS1Ia2h5VHF3UzJhbi1RV2VwNXhJajNBXzBkMUtxNGNiYkFYanJ1WGFJT3VOUXNiMTBJQmhFSkNWRFJEdDI0MGtZb0sxSVNfYTFrenFxamROYjk2MlZLX2loNHZOd1p5eldNbUw1UVZoZTNkNEY3SzFfdGcxaThra044UVBvSTNjb2c0MExjYnlkUEp2RmJrUldLLWtVQWI1Tk9NcHdkck5NRFZWSFdQQXpnNzNlRlRMZnQ0WDNDa1RBTXBZbkh6OGJLYllPekhYYVJOQ0dLa0VvY01n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Three Issuers Recieve Preliminary Approval from SEC for Spot Ethereum ETF Launches - Forbes India",
        "content": "\n\n\n\nThe United States Securities and Exchange Commission (SEC) has reportedly granted preliminary approval to at least three of the eight prominent crypto asset companies seeking to launch spot-based Ethereum exchange-traded funds (ETFs). The Ether ETFs are set to begin trading next Tuesday, July 23, marking a significant development in the crypto world and a major step forward in the ongoing efforts to bring Ethereum ETFs to the U.S. market.\n\n\n\nAccording to various reports, the SEC has provided the initial approval for BlackRock, VanEck, and Franklin Templeton. This initial approval sets the stage for the potential launch of the first-ever spot-based Ethereum ETFs in the United States. Fidelity, ARK 21Shares, Grayscale, Bitwise, and Invesco Galaxy are also in line to launch their Ether products soon, further expanding the crypto market.\n\n\n\nUpon final approval, these spot ETFs would provide investors with a regulated and potentially profitable way to gain exposure to Ethereum without directly owning the crypto. Ethereum is the second largest cryptocurrency in the global market after Bitcoin, making it a promising investment option.\n\n\n\nBitwise’s chief compliance officer, Katherine Dowling, noted that they have observed a decrease in the number of issues raised by the SEC during the amended S-1 filing process, implying that the applications are nearing the final steps of the approval process. Bitwise’s chief investment officer, Matt Hougan, also speculated that spot Ethereum ETFs could potentially attract up to ₹1,500 crores within the initial year of trading. SEC’s approval of several Bitcoin futures ETFs in 2021 has seen substantial growth and acceptance since its launch.\n\n\n\nETH is trading around ₹2,83,900, down by 2.56 percent over the last 24 hours. The likely approval of Ethereum ETFs would allow them to be listed on major exchanges, including Nasdaq, the New York Stock Exchange, and the Chicago Board Options Exchange. This move could open up a broader range of investment opportunities, further driving its adoption in the global market.\n\n\n\nHowever, it is crucial to note that preliminary approval does not guarantee final consent. The SEC still needs to make a final decision on whether to approve the ETFs based on public demands and several regulations.\n\n\n\nShashank is the founder of yMedia. He ventured into crypto in 2013 and is an ETH maximalist. Twitter: @bhardwajshash\n\n\n\n"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNM19yay15QjdDRy1mZmQ4YlVOUEJQZ29manZxNmR4b1pGaXB6aE1SN3l2ZEk2TXBNM1BTSU1fVHlNd2d0QlR4dTRmT2FxN3BvNXIzM3kzWTc4QTVwUVFJdklmMFh3aG0xNUVxSERqWjhFM3JnTnR4UUdQSThOQjBnR1NGX1nSAYoBQVVfeXFMUDRjRTlkaWtVbTdpRWltMEdIUkw0QmNRcTU5OXF2TzNHNnFlS3d2ZU5FVlpreGdKQXpfQXBCVzNPdXpyUmlsTUlPNUpka0lNLWh3b2FPUGhvNHhhTzlnNWU2TDBTb0RTZ3dQNlhoSGQ5Y3N4Y3ZQQS01LURrWU8xNDRyUVZ2VkhfbU9R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum climbs 8%: A profitable week for THESE investors - AMBCrypto News",
        "content": "ETH short-term holders see profit.\n\nETH has broken resistance for the first time in weeks.\n\nEthereum [ETH] has been highlighted as one of the standout performers over the past week, with its market capitalization increasing by over 14%.\n\nAdditionally, the seven-day Market Value to Realized Value (MVRV) ratio indicated that buyers who entered the market during this period now hold their investments profitably.\n\nEthereum shows attractive trends\n\nAnalysis of data from Santiment indicated that investors who purchased Ethereum during its recent dip are now seeing substantial returns. The data revealed that ETH and several other assets experienced a significant increase in market capitalization.\n\nSpecifically, ETH’s market cap grew by over 14%, enhancing its value for holders. This increase underscored the profitability for those who bought in at lower prices.\n\nIt also highlights its attractiveness as an investment during volatile market phases.\n\nHow ETH trended\n\nAnalysis of Ethereum on a daily timeframe, as reported by AMBCrypto, showed a marked uptrend on 15th July.\n\nThe price of ETH increased by 8%, moving from approximately $3,246 to close at around $3,485. This surge pushed its price just above its short-moving average (yellow line), which had previously acted as a resistance level.\n\nThe breakthrough above this short-moving average is significant as it indicates Ethereum was able to overcome immediate resistance, suggesting a potential for further gains.\n\nHowever, as of the latest observations, it was trading with a nearly 3% decline at around $3,380.\n\nAlthough it remained slightly above the yellow line, a continued decline could push it back below this pivotal resistance-turned-support level. The ongoing trading activity near this critical juncture will determine its short-term price trajectory.\n\nShort-term holders see profit\n\nThe analysis of Ethereum’s seven-day Market Value to Realized Value (MVRV) ratio indicated that short-term holders are realizing significant profits.\n\nAccording to the data from Santiment, the MVRV ratio was around 5.6% as of this writing. This ratio, however, has seen a decline from over 9% noted on 15th July, coinciding with a downturn in ETH’s price.\n\nDespite this recent decline, the MVRV ratio remained profitable for holders. This indicates that those who invested more recently are still profiting even with the price pullback.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nThe MVRV ratio initially moved into the profit zone around 9th July and continued to rise until the recent drop. This movement suggests a generally bullish sentiment among recent buyers.\n\nHowever, the current downturn warrants monitoring to gauge the potential for sustained profitability or further corrections."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFA4N2VRNDJPbjFGajlOUklVREtaQWhuSWFFWGZ5a0ppZlI2N3FnZkRpR3l0bGNaNnRVZEtfcXdaLW5mT2FFU2NjZlpOUGdNYzlZRjZuMkNlVDBnY09ncGRfUEs5VHF3Xy1LTXNCUWpYSC1NekxKcFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Why Is Ethereum (ETH) Price Soaring Above $3,300? - CoinGape",
        "content": "With a total market value increase of more than 4%, the global cryptocurrency market is witnessing a recovery, and the current Bitcoin price stands at $62,000. Ethereum (ETH) has also kept up with the times. The value of the second top cryptocurrency surpassed $3,300, drawing the interest of both investors and analysts. This rise is not merely a small event, but a substantial uprising driven by several important factors. Let’s examine the factors behind the rising of Ethereum price and what is fueling this excitement.\n\nCurrent Market Performance of Ethereum Price\n\nadvertisement\n\nEthereum price has experienced an upward trajectory, breaking through the $3,300 resistance level with notable momentum. The cryptocurrency has moved from a stable base around $3,150 to new heights. This reflects a robust bullish trend that suggests the potential for further gains.\n\nETH is currently trading at $3,353.64, showing an increase of 5.00% and 15.11%, over the past day and week respectively. Even though the coin declined in value by 5.18% over the past month, it has seen a rise in both market cap and trading volume.\n\nOver the last 24 hours, the market cap reached $403.08billion, while trading volume hit $13.74 million.\n\nKey Factors Driving the Surge of Ethereum Price\n\n1. Technical Momentum\n\nMACD and RSI: The MACD indicator indicates growing momentum in the bullish area. The RSI is well above 50, indicating significant bullish sentiment and persistent buying pressure.\n\nETH is currently trading comfortably above the $3,280 level and the 100-hourly Simple Moving Average. An upward trend line at $3,270 provides strong support. Meanwhile, resistance levels at $3,340 and $3,350 are being tested.\n\n2. Institutional Interests\n\nSpot Ethereum ETFs: The upcoming approval of spot Ethereum ETFs by the SEC is a significant factor in the recent rise of Ethereum. Nate Geraci, ETF Store’s president, has forecasted that the approval could occur very soon. Geraci feels more assured because he has seen that issuers are prepared and there are few reasons for more delays.\n\nIndustry Support: Industry experts and leaders, such as Matt Hougan from Bitwise Asset Management, are also optimistic like Geraci. Hougan points out that slight changes in recent submissions indicate that we are getting closer to the end of the approval process. The authorization of these ETFs could greatly enhance Ethereum’s market visibility, just like how Bitcoin ETFs have already made an impact\n\nMarket Impact: Geraci expects that Ethereum ETFs could achieve similar success as Bitcoin ETFs, possibly becoming the second most successful ETF launch in history. This might result in significant increases in investments in Ethereum, causing its price to rise even more. Market experts Daan Crypto and Michaël van de Poppe foresee a promising price movement after the ETF release, suggesting Ethereum will maintain its positive momentum\n\n3. Market Sentiment:\n\nInvestor Confidence: Investor confidence in Ethereum is high due to the positive outlook on regulatory approval and the possibility of institutional investment. Investor interest remains high as Ethereum’s progress and increasing use in the cryptocurrency sector generate excitement.\n\nPotential Risks and Considerations: Although the present forecast outlook is positive, there are possible dangers. Should Ethereum face difficulties keeping up momentum and struggle to surpass resistance levels, a potential downside correction might take place. Important levels of support to monitor are at $3,270 and $3,220. Breaking below these levels may drive ETH down to $3,150 or possibly even further.\n\nWhat’s Next for Ethereum?\n\nAs Ethereum’s value surpasses $3,300, the main question is if it can maintain its momentum and exceed crucial resistance points. The expected approval of spot Ethereum ETFs is a major factor that could lead to more profits.\n\nNevertheless, investors must stay vigilant and monitor technical indicators and market sentiment to navigate possible downturns.\n\nConclusion\n\nThe Ethereum price surged over $3,300 because of strong technical signals, anticipated regulatory approvals, and positive market sentiment. The potential approval of Ethereum ETFs is a major factor driving the current bullish momentum. Being prepared for any fluctuations in the market is crucial with the ongoing increase in ETH value."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQMGxQMWpQNDMzbFhwMVFMRGtxakJvaE1hZnVHaFhkTDN3TThCRnB0dzN2Z0RLZ3h3MXViRXI2VXNxRUFrbks5M05najNES0V0cldoTVNKdklBZWpkaUNJRndUWUVQYTFRTjBmbzB0cUN3RVdDc202SjlpY3F1a0pSUldrMNIBiAFBVV95cUxNQWtkZTdjWVgwTUpXYkpZSUJoWTlicElBbEdyNHgtWXptYy15ZXo1eXdBQmM1bGNPOVh5UG9JV01Zdnhmd2FTOE0xSTdFVzcxSzVER25BS01EMzdHdE05cWZIdXVhR0hNQTByNjlnRFF3bjJndlN1N0tDbDFLblZCNVlQSUtYUFo3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF on the horizon? What market trends suggest - AMBCrypto News",
        "content": "We could see an ETH approval this week.\n\nThe approval news is based on the confidence of observers in the space.\n\nThe recent prediction of an imminent approval for an Ethereum [ETH] ETF has sparked excitement in the market, resulting in one of Ethereum’s most impressive price runs in weeks.\n\nInterestingly, despite this dynamic activity, social activity surrounding Ethereum has remained relatively calm.\n\nIs an Ethereum ETF imminent?\n\nNate Geraci’s recent speculation about the approval of an Ethereum ETF this week, while not based on specific regulatory indications, highlighted an optimistic outlook fueled by broader industry movements.\n\nHis confidence seemed to be bolstered by the recent actions of several ETF issuers, such as VanEck and 21Shares, who submitted amended registrations in the past week, in the hope of securing the SEC’s approval to list spot Ether ETFs.\n\nThis strategic move by these issuers is part of a trend where institutions are quick to follow up on the positive regulatory momentum created by the approval of a Bitcoin [BTC] ETF.\n\nGeraci’s belief reflected a broader sentiment in the crypto community that the regulatory environment was ripe for another ETF approval.\n\nAll trends look normal\n\nDespite the significant anticipation surrounding the potential approval of an Ethereum ETF, its social metrics have remained relatively stable.\n\nAccording AMBCrypto’s analysis of the Social Dominance via Santiment, its highest point in the last two weeks was about 11%. Thus, of all crypto-related conversations during that period, Ethereum was part of 11%.\n\nAs of this writing, its Social Dominance had slightly decreased to approximately 9.4%, having dropped from just over 10% the previous day.\n\nAdditionally, the Social Volume—an indicator of the total number of mentions or posts about Ethereum across various social platforms—has not shown any significant spikes.\n\nThe press time Social Volume was at around 380.\n\nPrices react to ETF approval news\n\nAMBCrypto’s look at Ethereum on a daily time frame chart highlighted a building momentum in its price.\n\nAfter a significant downturn, ETH has begun to rebound, with a notable uptrend in progress. As of the latest data, it was trading up by approximately $3.7, reaching around $3,360.\n\nThis marked its highest price point in almost two weeks and positioned it near its short moving average (yellow line).\n\nThe yellow line had acted as a resistance level at around $3,400 and $3,500 over the past two weeks.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe potential approval of an Ethereum ETF could be a pivotal factor in ETH breaking through these resistance levels.\n\nIf the ETF is approved, it could significantly boost investor confidence and increase institutional participation, potentially driving the price to reclaim its all-time high (ATH)."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPSWJsUlRqSi00WWYxd1RqQ0NCUElsaHpiNW1mUjhmRzZualNDNFNYWDMxOU9wWGNodTdSTV9ZOGctOU1NOWYzbDhaYXI3X0xqcHdIWnZhcnIwT01TbHdtcjd1Wk5HRERZZm9JVEVibnhDSkY5TUloUjRfaHlzWktLTXgtZUM1bGEzMHBCbnZJaWxsbmdMNGFsWGcxbE5hNURuYUpSdlNYaUFOOHcyRW1qVGdMVTVjbGdtMFg40gHAAUFVX3lxTE1oSkN5aGRlT0JiaVF4bl93RzllOFRqX0c5MXRLWE9oTDFMZ0ZJVkZMRHpzczNKXzdTU0VJWVNoNmF0T094ZkVBRnRHTUNoWXgzVzNSbE1LdWdfMnZBZm12Ty1Ua2phNER6N2hFWDdJVGZIZllhSDFDUElqT2hTUmVaUFZPZU9nU3V2a1ZsREZoX2RMbFpOWkwxTmJRdnpLYmlpeXhaU0pxTGZnMFcwNkxTbk45VjlpZWlFV1lRZEhybw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Targets $4,500 As SEC Gives ETH ETF Preliminary Approvals - CoinGape",
        "content": "Ethereum price increased by 2.3% in the last 24 hours to trade at $3,411 during American trading hours. The price increase of Ethereum comes as the SEC gives “preliminary approval” to at least three of eight spot ETH ETF issuers to begin trading next Tuesday. Will this set center stage for ETH price to soar past $4,000?\n\nEthereum Price Eyes $4,000 As Next Stop Before New Highs\n\nThe ETH price reached a low of $2,811 in the recent market-wide downturn, but since Bitcoin began its recovery, Ethereum’s price has been surging. On the 4-hour chart, Ethereum flashed a double bottom, which finished forming when the asset hit $3,484. What remains to be seen is whether the ETH price will break above this temporary resistance or if the bears will prevail and retest $3,300.\n\nadvertisement\n\nEthereum’s price action is trending above the 21-day, 50-day, and 200-day simple moving averages (SMA), confirming a bullish uptrend.\n\nThe Chaikin money flow (CMF) is at 0.04 and heading upwards, signaling that buying pressure is increasing on the asset. The relative strength index (RSI) has also crossed above the midpoint and is trending at 59.37 and upwards. This indicates that Ethereum’s bullish momentum is rising, and the asset is in an uptrend. Furthermore, the moving average convergence divergence (MACD) just made a bullish cross, confirming the ETH’s price action reversal from bearish to bullish.\n\nEthereum price prediction hints at the possibility of further upside movement for the asset to $4,500 and beyond. However, the ETH price may have to conquer potential resistance points around $3,570 and $3,800. On the flip side, Ethereum may find support around $3,350 if the bears prevail, which coincides with the 21-day and 50-day SMAs.\n\nHow Far will ETH ETFs Push Ethereum Price?\n\nThe main spark for Ethereum price recovery can be attributed to the preliminary approval of the Spot ETH ETFs from three issuers. According to Eric Balchunas, an ETF expert at Bloomberg, trading is expected to begin on July 23. Market analysts speculate the inflows could be more significant.\n\nUpdate: Nate's instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided no unforeseeable last min issues of course! https://t.co/D21FD9Qf94 — Eric Balchunas (@EricBalchunas) July 15, 2024\n\nInterestingly, the ETH ETF trading will begin right before the Bitcoin 2024 conference in Nashville, slated for July 25-27. Market participants speculate that the price of ETH could upstage BTC, forcing the former to be discussed in the latter’s conference.\n\nAccording to Coinalyze, ETH aggregated open interest increased by 1.5% across exchanges, with perpetuals taking the largest share of the inflows.\n\nBottom Line\n\nEthereum price surged past $3,450 as preliminary approvals for ETH ETFs sparked optimism in the market. This positive regulatory development is fueling expectations of a potential parabolic rally. The price of ETH may extend gains to $4,000 and beyond as it eyes new all-time highs.\n\nFrequently Asked Questions (FAQs) 1. What is ETH ETF? An ETH ETF, or Ethereum Exchange-Traded Fund, is a type of investment fund that tracks the price of Ethereum (ETH) and trades on traditional stock exchanges, much like shares of a company. It allows investors to gain exposure to Ethereum's price movements without directly purchasing and holding the cryptocurrency. 2. Which Issuers have been given preliminary apporval of ETH ETF? U.S. Securities and Exchange Commission (SEC) has given ETH ETF preliminary approvals to BlackRock, Franklin Templeton and VanEck. 3. Can ETH hit $4,000? Yes, Ethereum price predictions suggest that ETH will hit $4,000 soon on its way to breaking it ATH.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQeXFhVlE2aURQMTBkcDZuZVZ1aG5wRkMyRmxHeldiLWVOM09wU09fVjhMTFRuNzN4LU54NE9aQUhoZDNmeGktd3lCZnM5SkVoLXdUdDlHckxKX1pQWVYtR0VPZ3IyREh1aFRrY0VsQkllU2NfUmRIemluRWJFZVI0MkpTU2ZEMC1J0gGOAUFVX3lxTE03ZTY0U2xIOVlBOTNTQ3B6c182QkdrejJrNklkajV5QjcydjU1ZnVTaW9lTVFJakM4aTZMYmVlWFR1aHFmekVCYzNoc1RyZHFPaF96MTZZTjJjcmg1UXA4eDZ0YndYbTdBNk85TTMydlFNRy0wdWtyMmVGVlBLX29vSmxyRFFhWWJYMDlDSWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Super Bullish Ethereum Price Prediction by Peter Brandt - CryptoPotato",
        "content": "Ethereum’s price has risen almost 10% in the past seven days. It is currently trading slightly below the important $3,400 mark.\n\nThis uptick is in line with the rest of the market, which is currently experiencing considerable bullish momentum following the correction that took place last week.\n\nThe price has dipped a bit in the past few hours after briefly touching $3.5K on Binance.\n\nThat said, one of the most popular prop traders with 50 years of experience, Peter Brandt, has recently commented on the ETH price, outlining the possibility of a considerable surge.\n\nIn a tweet from earlier today, Brandt shared his “perspective” on ETH, saying that “support was found at the lower boundary of 4+ month rectangle, which was a retest of the Feb completion of a horn bottom.”\n\nNow, a a horn bottom pattern in technical analysis is referred to price action identified by two downward spikes embracing a tiny middle candle, followed by a sharp rally.\n\nHere is Brandt’s chart:\n\nThe interesting bit is that he said that the target for this pattern’s resolution is above $5,600. If it happens, this would mean an increase of around 64% for ETH."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNeFBFVGprbHdyQVoyZzlyUmtWT2JIRFdWRGpGYUdUNV9Mc3hFazI4STVWa0Vjd2ZNb3IxcUdJdlIwUG9rNjJ5TjlteFJyQWRRRnQ4d08ydXhVOGFKNjNndTAzLTVIWXVHNThoX3VSX3JlSEY3bG44Nkd5SXFNbTNOV25yQk1aY3loLVBhLdIBkgFBVV95cUxObVdxSXdjRHM4QUkteXcwbjMyazlLTzh2YkhkeVNCS0F3TDBnaG9hVjRfYmFUWVRzVUwzc2gzOG1zZXN6V1oxV2ZZSC1DWDY5ZmdqRFdIdWkxVHBOSnVrTjE2S1lQdmhJUWNhWFZHTkhqbmxBRUZ1ZXEwWHNLQ0JJTlZ6UnpIdXE4dGc4VjlSck9pdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Declining Volume Sparks Doubts on $3000 Breakout - CoinGape",
        "content": "The Ethereum price analysis showcased a fresh relief rally in the second week of July. The bullish reversal uplifted the asset from monthly support of $2825 to $3196 registering a weekly gain of 13.2%. This recovery followed a market excitement towards the potential approval of spot ETH ETFs in the coming week and eased from broader market supply. Is the correction trend over?\n\nAlso Read: Bitcoin & Altcoins In Focus As Market Eyes Ether ETF, Fed Chair Comment, & Other Events\n\nadvertisement\n\nEthereum Price Analysis: Will Spot ETH ETF Approval Propel ETH to $4000?\n\nThe mid-term trend from the Ethereum price analysis shows a sideways action in the daily chart. The formation of a new lower high at $3974 and recently the same swing low at $2815 projects ETH price entering a consolidation trend to recuperate exhausted bullish momentum.\n\nA recent reversal from the $2815 support has uplifted the asset to $3191 within a week while the market cap jumped to $383.5 Billion. However, the declining volume accompanying the upswing suggests a diminishing interest among market participants to initiate long positions.\n\nThis lack of conviction from buyers suggests an unsustainable recovery and a potential for further correction in ETH. If the coin price reverts from the overhead trendline (downsloping blue line), the sellers could rechallenge the $2815 floor to extend the current correction.\n\nThe potential breakdown could accelerate the supply pressure and push the asset to $2400.\n\nHowever, the potential approval of spot ETH ETF could counter the bearish thesis to change market sentiment.\n\nAlso Read: Ethereum Price To Hit $5,000 As ETH ETF Speculation Ignites Bullish Comeback\n\nNate Geraci, President of the ETF Store, recently tweeted that the SEC’s approach to the spot Ethereum ETF S-1 filings closely mirrors their handling of the 19b-4 filings, marked by significant discretion. Geraci remains optimistic about the approval, anticipated next week, emphasizing that there is no justifiable reason for any delay.\n\nIt appears the SEC is playing the spot eth ETF S-1s similar to the 19b-4s… *Extremely* tight-lipped. Still think approval next week. Absolutely no reason for delay. — Nate Geraci (@NateGeraci) July 12, 2024\n\nThus, the potential approval could intensify the buying momentum and propel the ETH price prediction target above the $4000 mark.\n\nTechnical Indicator\n\nEMAs: The 20-day and 50-day Exponential Moving Averages (EMAs) serve as dynamic resistance levels during a bullish upswing, signaling a strong downward momentum in progress.\n\nRSI: The Relative Strength Index (RSI) reverted to 45% indicating a neutral sentiment among market participants.\n\nFrequently Asked Questions (FAQs) 1. What is the significance of the spot ETH ETF approval? The potential approval of a spot ETH ETF (Exchange-Traded Fund) is significant because it could increase institutional and retail investment in Ethereum. 2. What is a relief rally? A \"relief rally\" refers to a temporary increase in the price of an asset after a period of decline. 3. What is the Relative Strength Index (RSI)? The Relative Strength Index (RSI) is a momentum oscillator that measures the speed and change of price movements on a scale from 0 to 100.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxNQXpONkltelhFR05BeFgxeEJMQUlSb0pibHdxNW9NN0NVN2JmUGVzNVhYcFNCRERrX0piOHpOallTUEtsUTQ4azg3MXByZkdXSnd4UHI5Qk1ILTVRTlQtTkhPMkIyd253WnVURmUxVE1JMl8zb1V5dG5UZ3BIODR2V0pKZ2dwOHIxV1ZFLVA2YUFnUGtGelZoeC1nejcyQ3o4a0JndG1mT0ZSTWtpaGdDOWl1TmJVSmhoZnhVOHVTUjVBM2RqSGo5T2pSdHZmeXhsdWdfRWt3SXBZSlRzVGJyZU5PUFlJR2NwNG4zdlVsTDF0MXlucGhv0gH8AUFVX3lxTE12Tlp4U1hLZkNOWTc3ODdHT3NCRDdCY2hfSF9UUkpSY1dLbU94VXdTeG5LQnFrRG1jdzJMS19McFB2Mm1HMmJXX0RSMTdxVUVaZnhjbm9VbTJidnZ2ckJDT0JCdXVvYnJXVE1iQmNEa2FfcjlSR0tJQllaN1Y3N1MxQkdrSjVfcGdJUVZmSkI0T1ZVYU52TWN5eHJIQ21YSUVhYVdOSzBFbjhBaHU1YXdWUy1Udkt1V05fQ1lOdkp4ZkxlTTRvc3JLbTVMYWQ3Z3p2VDhuZ0RGUl9VbnR4bVEtMjZzVmoySFJ1ZVFyak1BYnFKdVhtalpxeloyVw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "What to expect from Bitcoin, Ethereum and XRP when SEC treats cryptos as securities - FXStreet",
        "content": "The meme coin is primed to extend gains by over 15% and rally to the lower boundary of the Fair Value Gap (FVG) at $0.000183, as seen in the daily chart above. The momentum indicator, the Moving Average Convergence Divergence (MACD), supports the thesis with green histogram bars above the neutral line and the MACD line crossing above the signal line.\n\nFLOKI, a meme coin that ranks in the top 100 assets by market capitalization, extended gains and erased losses from the second week of July. FLOKI trades at $0.000159 at the time of writing.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNT0RkcFhJdk1uTmNhOHR1T1c4RTJuVWhjYm1MdVB1cEtJSlYzekJEWXVvcHV5b19rQ1BtYnNhR0otRGNxQXJqbzdtUUhCREtkZFRiTzRuR0tiNWh6Q3ZxMGI1eDkyTExOYmRFTzdyT0ZQMUY1TVEzb3Z3Q3JDdUI3Nno0SFlNNFpYaFNoTzFzRWYzMFRKMXlFSkd3UDVtSm5mRmlBdGhaalhEWk1kRUw40gG0AUFVX3lxTE9XZlVLQ0RnMVEyY0xIOGdGZTJDNUVCbThkZXFIOWFQZXVuUHRpZlE0Qk5ENnBxS2x3Yk4xbHE0T3FMYXVVcE45Q1JYUVBtR3F3THBCQ25IdExLb1IxdnJsb1RFVHhYQjdpNl9FcFlKUDZxVGVwV2FmMWJVaDBxWGd5R1hHSlBaNmtxZWNkSmdfTWR0amhvYVJpOFUtUmlBMlZUM2t3VHFJS2drV3lpTXU5QWpaRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Performs Fundamental $3,500 Breakthrough, Bitcoin (BTC) to Easily Reach $65,000, Will XRP Finally Break This Major Resistance? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum has secured a move above the $3,500 resistance level and might finally gain enough momentum for a move above $4,000 in the future. Unfortunately, however, the second-biggest asset on the market will have to face a fierce 50 EMA resistance level ahead.\n\nEthereum has demonstrated significant bullish momentum, breaking through significant resistance levels, and is currently trading at $3,358. The way the price is moving indicates that ETH has found strong support, and the bullish trend is further supported by the convergence of important moving averages.\n\nWith the recent surge, ETH has surpassed the 50 EMA at $3,312.70, paving the way for a possible run toward the next major resistance level at $3,467. Ethereum's price has been rising steadily since it hit a low of $3,091, as can be seen in the daily chart. As the RSI is currently at 55, there is still an opportunity for an increase in price before the asset is overbought.\n\nThe bullish outlook is further supported by the rising trading volume, which indicates that investors are becoming more interested and involved compared to last week.\n\nAdvertisement\n\nBitcoin aiming at $65,000?\n\nBitcoin might be on its way to $65,000 as the asset broke above $60,000 as soon as the selling winded down on the market, with large players like the German government running out of BTC to sell and pushing the market down.\n\nRight now, Bitcoin is trading at $62,894, a significant increase of around 3%. A reduction in selling pressure and a change in market sentiment have propelled this upward momentum.\n\nThe bullish view has been strengthened by Bitcoin's ability to breach multiple significant resistance levels as a result of the recent price surge. As it approaches the 50 EMA at $64,027, the daily chart displays Bitcoin comfortably above the 100 EMA at $62,580. The psychological $65,000 mark represents the next big obstacle that needs to be overcome in order to open the door to more gains.\n\nThe positive price action has also been aided by a decrease in selling pressure from major holders like the German government. This bullish narrative is also supported by on-chain data. Large transactions and overall transaction volume have noticeably increased, suggesting increased interest and activity in Bitcoin.\n\nSince more people are participating in the market and making purchases and sales, this increase in activity frequently occurs before significant price movements. But one must exercise caution at all times. Despite the bullish trend at the moment, Bitcoin needs to keep moving forward and convincingly break through the $65,000 barrier. The upward trajectory could be stopped by any large losses or increased pressure to sell.\n\nXRP hits 200 EMA\n\nXRP reached the 200 EMA resistance level after its impressive 18% price surge. The likelihood of the breakthrough is more than real, however, only time will tell how long it will take for us to witness a move above $0.52 on XRP.\n\nXRP has increased by 18% over the past day to trade at $0.5297. With the recent spike, XRP is getting closer to breaking through the crucial 200 EMA resistance level, which is currently at $0.5294. As XRP has always exhibited strength when it breaks through this resistance level, it may indicate a major bullish trend.\n\nThe daily chart indicates that XRP has overcome other significant moving average, such as the 100 EMA at $0.4870 and the 50 EMA at $0.5073. The positive outlook for XRP is influenced by a number of factors. First of all, there has been a general uptrend in market sentiment, with several cryptocurrencies seeing gains.\n\nAdditionally, investor confidence has increased due to recent partnerships and developments involving Ripple, the company that created XRP. But caution is still necessary. The 200 EMA resistance level has historically been difficult to overcome, and if XRP is unable to maintain its current momentum, there is always a chance that prices will retrace.\n\nTo determine the strength of the current uptrend, traders and investors should keep a close eye on volume and price movement. The bullish case for XRP is further supported by on-chain data, which demonstrates a significant increase in transaction volume and activity. Further gains and possibly higher price targets could result from a breakthrough above the $0.52 level, if the buying pressure persists and XRP can sustain its momentum."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPS25NUjV6cFB3MGhDb3JfR3dfTnZLRzR3ek1zQ2NjVEtCemxOZGVpRDhOME0tRlIwdzdpNldSX1gxMWVTV1VFTnJVVHFLZjBxZmRmUUJQdE1FblZuejNZcjFEZzBPLWlaSGMzLVgwdjZpYnlQM2k2MTdfWjFkR21wa3F4Z2RpR2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum ETFs Could Be Approved This Week - Cointribune EN",
        "content": "Tue 16 Jul 2024 ▪ 3 min read ▪ by Eddy S.\n\nThe ETF analyst, Nate Geraci, recently expressed his optimism regarding the imminent approval of Ethereum ETFs. According to him, there is no valid reason for these ETFs not to be launched this week. This statement has sparked significant interest within the crypto community, eagerly awaiting this new milestone for Ethereum.\n\nLaunch of Ethereum ETFs this week?\n\nGeraci, president of The ETF Store, shared his predictions on social media. He states: “Welcome to ETF launch week… I don’t know anything specific, but I don’t see any valid reason for further delay at this point. Issuers are ready for launch.” This statement reflects the growing confidence among industry experts regarding the imminent launch of spot Ethereum ETFs.\n\nThis launch of Ethereum ETFs could have a significant impact on the crypto market. Analysts, including Matt Hougan of Bitwise Asset Management, have pointed out that the minimal changes to recent ETF filings are a positive sign. This indicates that the approval process is on the right track and could materialize very soon.\n\nThe ETH crypto responds positively to this anticipation!\n\nIn the last 24 hours, the price of ETH climbed by 3.24%, reaching $3,347 at the time of writing this article. This increase is largely attributed to the anticipation of the imminent launch of Ethereum ETFs, which could further propel the value of this crypto. Analysts believe that the launch of these ETFs will attract massive institutional investments, thus increasing the demand and value of Ethereum.\n\nAs the launch date approaches, all eyes are on the SEC and the ETF issuers. The crypto community hopes that this week will mark a decisive milestone for Ethereum and open new opportunities for investors.\n\nNate Geraci’s optimism regarding the imminent approval of Ethereum ETFs reflects growing confidence in the crypto sector. If his predictions come true, this could mark a major turning point for Ethereum and the cryptocurrency market as a whole.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNNTlNN19rVTdKbU5oRHlLMzNDVU16V0NpTTNFdWxCZFdYUGhzWlFFTmZEczQ0TzNVZVh4eXVNWlVpak85QWplT0tzLTltaUdObk5lRE1QMUt5UmpiQk8yTGxmNlVvcFlud0lLeXg5RGwzcWc0QWI3UmlYWUJ6YnYzWC1lc3h0OGEzMktiaUdvRmcwR1VOTTI4QWQwam4tb1ZyUi0xeDVkOTBrdFFyXy1CMUJQZUIxZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Spikes 10% in 7 Days: Spot ETF Hopes Spurs Buyers Aiming For $3,700 - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum, more like Bitcoin, is also exploding, looking at price action in the daily chart. The liftoff is primarily due to shifting sentiment among traders. The United States SEC is also increasing expectations that they will approve all spot ETH ETF applications this week. This confidence is fueling the uptrend, confirming the breakout pattern over the weekend. As bulls pour in, prices are tracking higher—a huge development for ETH.\n\nAt press time, Ethereum is outperforming Bitcoin, looking at the performance over the past day and week. For now, ETH is up 1% in 24 hours and an impressive 11% in the past week. Moreover, there is an uptick in trading volume, pointing to interest from traders. For now, the average trading volume in 24 hours rose to over $18 billion. Once the spot ETF goes live in the next few days, it is likely that engagement will rapidly swell, fanning the upside momentum.\n\nThe following Ethereum news developments are trending today:\n\nEyes are on the United States SEC and whether they will accelerate their approval of spot ETFs in the coming days. There is speculation that the regulator will allow these derivatives to trade on July 23. With this product, analysts expect ETH to attract billions, just like spot Bitcoin ETFs did.\n\nETH continues to outperform BTC ahead of the spot ETF launch. This trend could continue in the coming days, cementing the coin’s position in crypto and narrowing its valuation gap with the world’s most valuable coin.\n\nEthereum Price Analysis\n\nETH/USD is firmly in an uptrend, gaining 11% in one week.\n\nWith prices trading above the $3,300, buyers are back in the equation.\n\nAs things stand, Ethereum buyers can choose to ride the uptrend, loading on every attempt lower with immediate targets at $3,700.\n\nNotice that ETH is within a bullish breakout, overcoming the dynamic resistance line set by the 20-day moving average. At the same time, all losses of July 4 and 5 have been reversed.\n\nWith the uptrend defined, traders can look at $3,700 and $3,900 as the immediate targets.\n\nAny unexpected dump below $3,300 cancels out this outlook."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxOYXoyQlkyV3hlSXNZd0ViUUFWOHVtZUJSYmg3R2JJRUJab2VnZHV2OEFKck5NdlA5OS1paWR0d2Z6M25FeEhEOG9qNk94R2E1SFYwTFB3LW5mQnBlOG9vRGo4ZThtQXl0eGZMdWtJZTV6TElvbHBoRWdSYzdEakRDWUV0VnFPdXNyQUpQeHJGLVJMaXN2NXV0M0J2U0ZUa0FKZERlNzNIR1NOT3lnRG5NNXBBcEliM3Bld0ZxQkNPQWZ5Q1IzTWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Surges 5% Ahead Of The Anticipated Spoth Ethereum ETF Decision This Week - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum’s price has surged by 5%, surpassing $3,300 amid the much anticipated SEC’s decision to approve several spot Ethereum ETFs. Analysts expect that the approval could have a significant impact on the market.\n\nNate Geraci, president of the ETF Store, has expressed his confidence in the SEC’s imminent approval of the ETFs. In an X post, Geraci believes that the spot ETH ETF will approved this week, seeing no reason for further delay, and stating that issuers are ready for launch.\n\nHis comments reflect the widespread industry belief that the SEC is prepared to approve these products after several weeks of regulatory review\n\nThis sentiment is shared by Bloomberg analysts Eric Balchunas and James Seyffart, who predict that the ETFs could begin trading as soon as mid-July. The minimal feedback from the SEC on the final registration statements suggests that the applications are close to approval. Matt Hougan of Bitwise Asset Management also noted the quick progress, highlighting the minimal adjustments needed in recent filings.\n\nIn this case, analysts agree that the launch of spot Ethereum ETFs could be a major catalyst for Ethereum’s price in the coming months.\n\nFurthermore, the potential approval of spot Ethereum ETFs has sparked considerable interest among institutional investors and financial advisors. Nate Geraci noted the growing demand for crypto assets, suggesting that Ethereum ETFs could mirror the substantial success seen with Bitcoin ETFs.\n\nHe highlighted Bitcoin ETFs as having the most successful launch in industry history in cumulative terms. Geraci speculated that Ethereum ETFs could similarity achieve significant success, potentially becoming the second most successful ETF launch ever, Bitwise Asset Management forecasts that spot Ethereum ETFs could attract $15 billion in net inflows by the end of 2025.\n\nAs the crypto community eagerly awaits, the SEC’s decision on Ethereum ETFs could represent a pivotal moment for the market, stimulating substantial interest and investment in Ethereum and bolstering its price."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOak5yaldDRTFVOTJOT1duQ2Zxc2VsbEt4QzVEeHRpcHlKMkJraVIzQ2dobURhUjBDcmRLN0RhSjVyWHk1ZEwxTkkzYmxhQWNVT1gteUNUVU5Ib2dtQUJGNzNFTWttb2tXWVhIZHliZGExTXhlb1lkdFRpV0tiNlVhUXNtZE5QdXFDSkJaYzlHMlhRVmo0UXVKZXUzeDNqcGJYbGpjYUlxZ2dkQzNsTFZGYmpKQ1g1dTBDUmVrakM1WEZyV1hzM0l0UE5VdlFKTVBmOTRPdzFR0gHbAUFVX3lxTE5YSklid3FBemtaYzRPRktuUmM0Q0xaSDR2aTloZldHcFJGRC1ZYktOTWZZdldKUGxrV21ZQjJtSUtCT2c2WFpMS2J4Y0F1MFhoMlhoRVotQ0tPRmhjbTZ5dnhFYWZmYXlhX0R5c0VzV0pCQTNXcFVLRzVIbXBXQ200THN1cnliRDlaZURrMkZ4U1RsNmxjbGlSOFQ5a1A2U1E2V3EtSWpqMmV3NkxEay1RV3NVbXp4aU9vY1RvaXZ1U01BUU1wam5zWmxaRklsRGJNRkFoSlZSeEVabw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, Cryptos & Ripple – American Wrap 15 July - FXStreet",
        "content": "Ethereum is up nearly 7% on Monday following updates from Bloomberg analysts that the Securities & Exchange Commission (SEC) would potentially greenlight spot ETH ETFs to launch next week Tuesday. The increased inflows across global Ethereum investment products also align with the new development, as traditional investors seem to be preparing for a potential rally ahead of the launch.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQWUxINm5OQU5FanBFeGs4NVNfSUhpd2I0YUR4dndjbE9UYy1Qb3laVk9fRGNseW90MVpER3lkQlpPX2NlaDRTcFFKaXBiNTV5V2NaMy1LWE9qQVpJUEdlbGNGR1VHNnRZOEVMVzNsaXRYdl9nTlpMam05UE5jZmtFaTlCTEZ1Smk0cEQ3NVhjanMzRFBaY1BfQ2lJWm7SAaIBQVVfeXFMUF9FcmhyYUY0V1F5Ul9RZGlnSGtYcDhtaWRDQk5jd3RUOWJMZEFSVXpyV0JWdW0xU1Rsa1ZRYzUyOVRCWEkzS28xcFoxbmpLbWdjb3VoanNPQVZwMlFTNzFNeWZ4YlcwX2czeTZWM3ZDYTUwRmljSUpGLU5HMVg3RmNJUDZRaVl3Y0dFSnlpeVRuclAyb09zOUxqMzd3cmpycTFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Eyes $3.5K as ETF Launch Anticipation Grows - CryptoPotato",
        "content": "Ethereum has recently seen an uptick in demand near a crucial support level, leading to a notable rebound above the 200-day moving average at $3,134 and reaching the 100-day MA.\n\nThis price action highlights the potential for a bullish reversal if the price recovers above the 100-day MA of $3,342.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA detailed analysis of Ethereum’s daily chart reveals that after a prolonged bearish trend, the cryptocurrency briefly broke below the 200-day moving average at $3,081, introducing significant fear and uncertainty into the market, as this MA is a vital support level for the price.\n\nHowever, Ethereum found strong support at the substantial and decisive support region of $3K, resulting in a notable bullish rebound. The price has now climbed above the 200-day MA and continued surging toward the 100-day MA, indicating a potential bear trap and false breakout.\n\nCurrently, ETH has reached the 100-day MA of $3,142 and is on the verge of reclaiming it. This MA also aligns with the tactical resistance region of $3.3K, making it a robust barrier to buyers. Yet, if it stabilizes above the 100-day MA, this could confirm a bullish revival in the mid-term, with the next target being the $4K yearly high.\n\nThe 4-Hour Chart\n\nOn the 4-hour chart, Ethereum faced rejection near the multi-month descending trendline at $3.5K, entering a sustained and impulsive bearish trend. Upon reaching the decisive and psychological support region at $2.8K, the bearish momentum faded, resulting in the formation of a notable double-bottom pattern.\n\nFollowing this consolidation, an increase in buying activity led to a bullish rebound, breaking above the neckline and subsequently forming a successful pullback to the broken level.\n\nThereafter, the price experienced an impulsive surge, which clearly hinted at a bullish revival in market sentiment. Ethereum is now at a crucial resistance region, encompassing the significant $3.4K psychological mark and the multi-month downtrend line, where selling pressure may increase.\n\nIf Ethereum reclaims this resistance area, the bullish trend could continue toward the $3.7K mark. Conversely, a rejection at this level would likely result in the continuation of the bearish trend, targeting the critical $2.8K support.\n\nSentiment Analysis\n\nBy Shayan\n\nEthereum has recently experienced a bullish rebound, surging significantly toward the critical $3.5K resistance zone. Understanding the potential targets for the bullish trend is essential for predicting future price movements.\n\nThe accompanying chart identifies potential liquidation zones within Ethereum’s price action, offering insights for mid-term strategies by informed traders. Following the recent bearish decline below the $3K threshold, the price has tapped into the liquidity pool below $3K, primarily comprising sell-side liquidity from long positions opened near this mark.\n\nLooking ahead, significant liquidity is observed around the $4K resistance region, primarily consisting of buy-stop orders triggered by aggressive short positions during the previous impulsive bearish trend. In the mid-term, a plausible scenario involves the continuation of the bullish trend to capture liquidity near and above the $4K resistance level. This approach aims to exploit these liquidity zones strategically, potentially supporting further upward momentum in Ethereum’s price."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOVm9nUTNBUXMwMjVOYUxkaGs1R2pTalRsckhGLVZFTW5WV3d5SlotSlIweF92THlQaWxKdjA4UUR3R2ZKN2w5U29aa3VKcGNYRm1qUDRvX0poRXFMVkVKYlhzZmRXUjVhRlVNelNRVWtIWnFVSnJBMDZQWGpmQ2RxQXJfWDZtdHJueXVsNXU0RE9pZmh4LTh3c3pVdUdQX1ZtMlVfclc2QjN6bVZIajJtcWF30gG_AUFVX3lxTE03anJKaWYxdXMzNE8xVXNPeTZ5LUdKeXAyVFFfbG81N281cTFzYmRTRDVrNVdrdnpsdV9rQW1QbVdkMWlZUGZUUmN4NkpJbTZneDlJNHN0dVpJVm90N1I5VHlJdUtzcC1EdXhqaVlDY0ZZVzBzMjFicEZQT2ZaSHJWOUpLMjJTOUFPbkFsZHdvQjh6V212OUc5bFFzZnRGY2cwTXBxa0FNX2d0WXZnQzI3R1JJT1dEVWhQYTM3UmNF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Cardano And Ethereum Price Prediction: Is A Run To $0.6 And $8,000 Possible? - Outlook India",
        "content": "As the first decentralized solution for this market, investors are capitalizing on its first-mover advantages for massive profits. Moreover, ETFSwap (ETFS) is set for beta launch following the completion of team KYC by reputable blockchain security firm SolidProof. Following the team audit, SolidProof has verified project ownership and the identity of each team member, adding more credence to the emerging platform."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNWTdLeFZGbVdyY00xUDZKTHpTMmp5bEw2Nk1Ec1ZzYm9JV25Ha1R3elhDaTI0TjFXckRZSFpDSERNVHJlb2ZrQ09FT05ycHU5ejEyVnVnd1ZzaFowdUpTR2drZFMyb1Vxd0F2SjhUSm95Z19lQTJlc3JiZ2J3U1R3Y2djdGtUeUHSAYwBQVVfeXFMTVlsOVhwdm5MYmVUSlNEYjRoQ3dCY1FqaVNFTUZhdHpkcWI1dnlLWkhyM2JEdTVNNUdpdFd5d1BJWVZlNFdCeFlGWGdlSVd3OHBsUHgyYU1jNDFJdXdOYUZ4Ni1zMTVDVkFVM3RGMlRLOTRBdEZpRlg5ZHlqdS1fWEFwT1U4MnFfSnFtT04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum To Outperform Bitcoin After Spot Ether ETF Launch: Kaiko - CoinGape",
        "content": "Institutional crypto market data provider Kaiko has projected Ethereum to outperform Bitcoin (BTC) after the launch of spot ETFs in the United States. The market anticipates the launch of spot Ethereum products with bulls projecting new market highs amid institutional inflows recorded pre-launch. ETH is down from the approvals of 19b-4 for several issues by the Securities and Exchange Commission (SEC).\n\nEthereum Growth to Surpass Bitcoin\n\nA recent report from Kaiko opines that Ethereum ETFs may push the assets above Bitcoin. The firm cited the Ether-Bitcoin price ratio amid recent fluctuations due to macro and industry factors. The price ratio of the asset relative to Bitcoin stands at 0.05 from 0.045 after the approval of 19b-4 by the SEC. A ratio shows the value of Ethereum is getting bigger than the market leader.\n\nadvertisement\n\n“The ETH to BTC, which measures the relative performance of the two assets, remains elevated around 0.05. This is significantly higher than pre-approval levels of nearly 0.045. A stronger ratio suggests ETH could continue to outperform relative to BTC following ETF launches.”\n\nIn the last two months, ETH price has plummeted 20% initial frenzy with the SEC approval. While a pullback is linked to macro factors, spot Ethereum ETFs are poised to draw in institutional flows to the market. Traditional investors have become attracted to the altcoin leader because of its smart contract functionality and the number of decentralized applications (DApps) in the ecosystem. Last year. Wealth managers picked the asset with the most growth trajectory.\n\nETH Price Hits $3500 Ahead Spot ETF Debut\n\nThis year, spot crypto ETFs have dominated market spaces with billions pouring in from investors. The approval of spot Bitcoin ETFs on Jan 11 opened the gates for renewed market optimism on the heels of a new window for institutional investments. The successes of Bitcoin products drew investors to Ethereum as crypto prices jumped to new highs. The trading of ETH products expected this summer and related optimism led to issuers filing for Solana ETFs.\n\nETH price jumped over 2% in the past 24 hours, with the price currently trading at $3,415. The 24-hour low and high are $3,330 and $3,498, respectively. Furthermore, the trading volume has increased by 50% in the last 24 hours, indicating a rise in interest among traders.\n\nAlso Read: Coinbase v SEC: Coinbase Refines Subpoena For SEC Chair Gensler\n\nDavid Pokima David is a finance news contributor with 4 years of experience in Blockchain Technology and Cryptocurrencies. He is interested in learning about emerging technologies and has an eye for breaking news. Staying updated with trends, David reported in several niches including regulation, partnerships, crypto assets, stocks, NFTs, etc. Away from the financial markets, David goes cycling and horse riding.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOWHBHZHJxWnZmWm4tMzdaTkpFOGxaYnlEQkplZ0lxLU1keU1DbXYxTEgwQ21JNm9TbDVvYTlycXlBUG9KelpXREl5b3k2R1lobEVtT19DY2xFUWNDdTJWb2EwQkxSN2Q5bGxKdXhFMjlHZXlQUGY1aHpIcEZkRlFxZU9PX3cza2ExaXRlZDBHVUlhaHVlcWxGWUFB0gGfAUFVX3lxTE5CLVpHNkhUYzVTdldOTWpGMVZrZWxFMGpKeGUzNDNqVVcwUVJEU2NuOHF2UU1qR2F0emZVeFUtdkI4RlFqYjlMUzl2dU5DSVFobnBPcnZieUZlWnZJd1ExVjNCaVQxVzdYbEI0S3E5b1JQVjYta1c2Mm44N2d3dlNEa2xJS3drbnBTWWswVkl6Qm1TSFdVU25tc2hNdDV2TQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF launch date confirmed? As ETH clears $3400, what happens next - AMBCrypto News",
        "content": "Spot Ethereum ETFs will potentially begin trading next Tuesday.\n\nThe SEC is in the process of gathering final drafts from prospective spot Ethereum ETF issuers.\n\nEthereum [ETH] rose past $3400 earlier today, posting an intraday high of $3,498 on CoinMarketCap before the momentum waned. The leading altcoin was trading at $3,445 at the time of writing – up 3.64% in the last 24 hours.\n\nThough ETH bounced back from its trip below $3,000 last week and was trading 12.8% higher in the last seven days at press time, it remained down 13.2% from its high on the 11th of March.\n\nThe latest gains come hot on the heels of reports of an imminent approval of a U.S. spot Ethereum exchange-traded fund (ETF) next week.\n\nSpot Ethereum ETF Update\n\nETF market commentator Nate Geraci firmly predicted earlier this week that the US Securities and Exchange Commission (SEC) would approve the resubmitted registration statements soon.\n\nIn a Sunday post on X (formerly Twitter), Geraci wrote,\n\n“Welcome to spot [ETH] ETF approval week. I’m calling it. Don’t know anything specific, just can’t come up [without] good reason for any further delay at this point. Issuers ready for launch.”\n\nBloomberg ETF analyst Eric Balchunas seconded Geraci in a separate post, adding that only an unforeseeable last-minute setback could delay the launch. He acknowledged,\n\n“Nate’s instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a Tuesday 7/23 Launch.”\n\nSeparately, a report from Reuters, dating the 15th of July, cited three sources indicating that the SEC would likely greenlight the applications of at least three issuers — BlackRock, VanEck, and Franklin Templeton — to begin trading “next Monday.”\n\nThis final approval milestone will depend on the issuers submitting final documents before the end of the week, according to the sources in the know.\n\nMarket anticipation\n\nThough the specific approval date remains unclear at the moment, excitement has been building up in the market in the last few weeks since the SEC approved applicants’ forms 19b-4 in May.\n\nIn June, the US SEC delivered feedback on the filed S-1 forms, highlighting areas needing review.\n\nLast week, the securities regulator asked the eight asset managers seeking approval for their spot Ethereum ETFs to submit amended S-1 registration statements.\n\nThe approval of a spot Ethereum ETF is expected to significantly impact the Ethereum market and the broader crypto industry.\n\nThe ETF offerings, which are tied to the spot price of Ether, provide investors with a new avenue to gain exposure to the altcoin through a regulated financial product.\n\nMost market analysts have predicted that the Ether ETFs could attract investment flows from institutional investors, potentially replicating the inflow of spot Bitcoin ETFs observed in the first half of the year.\n\nU.S.-spot Bitcoin ETFs have drawn in $16.12 billion in inflows since their launch earlier this year, data from Farside’s Bitcoin ETF flow table shows.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nWorth noting is the fact that the predicted launch date coincides with the week of the 2024 Bitcoin conference at Nashville.\n\nThe conference, set for the 25th to the 27th of July, will feature prominent speakers, including MicroStrategy executive chairman Michael Saylor, ARK founder Cathie Wood, independent U.S. Presidential candidate Robert Kennedy Jr, and Republican U.S. presidential candidate Donald Trump."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1leHdYWjRWQUxYcG9Yb1dVWnBOeDIxdmRRb0ViWm5PZ2w4SUlSWlI2NlUyaU1PSUNrbnJJMWpLOXpESFJyVFljQ3NFbVFUYTJZUExqd0V2Z1dRSkd5TFFYQkpkTGIxNU9nb1VnZEFHbnI5MzJBa3RCQTgydDBiTGfSAYQBQVVfeXFMT2dmZnNiMndNMWJ2dlBiQXo0QUd1MjJ5R2pqTVdSVk1wQzVGVk85bHZOYmZWN3JLRVBVS1dSN3BUNW5vN0tmWmJEemtaT1h1LU1rc3pwdGJ1bkYwUmMtVERHTlFaVzMzbDljMDFpSjBMM1Y1WVh3ODJEN3VneVdhMkZQLTdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "How Solana flipped Ethereum, Bitcoin in NFT Adoption - AMBCrypto News",
        "content": "Despite outshining BTC and ETH, SOL’s number of NFT sellers and buyers dropped.\n\nSOL was up by 4% in the last 24 hours, but a few metrics looked bearish.\n\nSolana [SOL], which nowadays has been in the limelight for its high network activity, has once again made an achievement in the NFT ecosystem.\n\nThe blockchain has managed to outshine top players like Bitcoin [BTC] and Ethereum [ETH] on a key front. In the meantime, its price action has also turned bullish.\n\nSolana’s promising NFT performance\n\nSolanaFloor, a popular X handle that posts updates related to the blockchain’s ecosystem, recently posted a tweet highlighting an interesting development.\n\nAs per the tweet, Solana outshined all other blockchains in terms of daily NFT blockchain user adoption. SOL’s number increased by almost 34% in the last 24 hours. Apart from SOL, Polygon [MATIC] and Ethereum made it to the top three on the same list.\n\nAMBCrypto’s look at DappRadar’s data revealed that Frogana, Retardio Cousins, and SMB Gen2 were the top three NFT collections on Solana over the last 24 hours.\n\nAs per Sanrtiment’s data, SOL’s NFT trade count spiked last week. Its NFT trade volume in USD also increased over the past few days.\n\nAMBCrypto’s analysis of CRYPTOSLAM’s data revealed that Solana also witnessed an increase in its NFT sales volume last week. To be precise, the number grew by 8%.\n\nHowever, not everything looked favorable. For instance, SOL’s number of NFT sellers dropped by 59% last week. A similar declining trend was also noted in terms of SOL’s number of NFT buyers, as the figure dropped by more than 66%.\n\nSOL turns bullish\n\nWhile all this happened, Solana bulls buckled up as its daily chart remained green.\n\nAccording to CoinMarketCap, SOL’s price increased by over 4% in the last 24 hours. At the time of writing, SOL was trading at $146.67 with a market capitalization of over $68 billion, making it the 5th largest crypto.\n\nHowever, SOL might soon lose its bullish momentum. At the time of writing, SOL’s fear and greed index had a reading of 68%, meaning that the market was in a “fear” phase.\n\nWhenever the metric hits this level, it suggests that the chances of a price correction are high.\n\nTherefore, AMBCrypto planned to have a look at SOL’s daily chart to better understand what to expect from the token. As per our analysis, the technical indicator MACD displayed a bullish advantage in the market.\n\nIs your portfolio green? Check out the SOL Profit Calculator\n\nThe Relative Strength Index (RSI) registered an uptick and was headed further up from the neutral mark, indicating a continued price increase.\n\nNonetheless, the Chaikin Money Flow (CMF) went southward, which could restrict SOL’s price from moving up in the coming days.\n\n\n\n\n\n"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNZDNVZG11aTdyZVJnbDVtU2x5UHRvNHQ2dGlQRjFucllEUVdBM3FCVmZvZG94VDhIclA1d2tjRjdSSXdmTS1UYzd3WU94ZlZobnpFYndQZGxhZDNUSmtBNnVWVnpzOC1ZcHZGeEM3cTQyRlhSWjVLWjdQZXlVbmhTM2dpX3BnYmhPN3NOVFhXSmRUd9IBlwFBVV95cUxNeGdmMXNHYkxEdEtadmlhVzFaSjVnVUxTa0Z4a1FOVWdFOExsRXlaajBzWE1tT3VGc3JaNTI2TTR0LXE5eUFnWUNrbnhVbjZZRWxYVS1ibElXYm41T1ZDeUNURGRjZDJWRTczUTZjUUcwWDc5NENZRE1va29yQmNsakZyTXRFVkhISVc1NXhjSGNCTHU5a21n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Breaking: Bloomberg Analyst Announces Spot Ethereum ETF Launch Date - CoinGape",
        "content": "Despite the increased excitement and legal processes, Bloomberg’s ETF analyst James Seyffart has shared fresh information regarding the likely timeframe for the launch of spot Ethereum ETFs in the United States.\n\nThe introduction of these financial products has been highly anticipated and shows a step forward toward furthering the adoption of cryptocurrency investment vehicles among institutional and retail investors.\n\nadvertisement\n\nSpot Ethereum ETF Launch Date Set For Tuesday\n\nThe U.S. Securities and Exchange Commission (SEC) has hinted that the final approval for the spot Ethereum ETFs could be granted as soon as next week. New information presented by Bloomberg’s Eric Balchunas indicates that the issuers have been requested to file their last S-1 registration statements, including associated fees, by Wednesday with a request for effectiveness for the following Monday.\n\nConcurrently, this preparation is in line with a possible launch on Tuesday, July 23, during significant cryptocurrency events such as The Bitcoin Conference in Nashville which Donald Trump is expected to attend. This timing is sensible because the launch is strategic and attempting to coincide with increased consumer focus.\n\nLooks like launch date for the #Ethereum ETFs will be next week on Tuesday July 23rd https://t.co/fm8RW6AvTJ — James Seyffart (@JSeyff) July 15, 2024\n\nThe previous stages included the SEC asking for updates on the appropriate 19b-4 forms, critical in trading new ETFs on stock exchanges. These forms are essential for the actual implementation of the ETFs given that the regulator’s normal review cycle has been through several changes and prolongations in the recent past.\n\nDespite some earlier setbacks, the market is still hopeful for the upcoming decision, primarily because of the positive political changes and the growing institutional interest in cryptocurrencies.\n\nEthereum (ETH) Price\n\nFollowing the announcement, Ethereum price jumped by more than 7% according to the price at the time of writing this article to stand at $3,433. The hype around Ethereum ETFs is clearly reflected in the crypto asset’s market performance with ETH’s price increasing by 14% over the last week, and 77% in the past year as of CoinMarketCap.\n\nThis has been largely due to increased expectation that these ETFs will be approved soon and once approved, they are expected to mobilize a lot of funds. Analyst Michael Van de Pope has moreover suggested that owing to the new ETFs, Ethereum may outperform even Bitcoin in the market.\n\nThe ongoing interest from financial advisors and institutional investors shows the high demand for regulated crypto investment products. Estimations are that these ETFs could attract between 0. 75% and 1% of Ethereum’s circulating supply in new investments within the first five months of its operations, stressing the possibility of great market expansion.\n\nRead Also: Donald Trump Picks Crypto-Friendly Sen J.D Vance as VP Candidate\n\nKelvin Munene Murithi Kelvin is a distinguished writer with expertise in crypto and finance, holding a Bachelor's degree in Actuarial Science. Known for his incisive analysis and insightful content, he possesses a strong command of English and excels in conducting thorough research and delivering timely cryptocurrency market updates.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxObDRSeDRrTTdMMUZfNnphTTZBY29lWDQzMlFQUmxlZ0tjcnRpeHpXNkFwTkM5bEpJTFkwVzJQNVBldldMSmRJbFIwYTJjbkFWaFE2Vy1Vb1g0ckVEczBIREtmeTA1eHJ1Ui1ySGU0cG5ra3BfTXdhQ0N3ZXBCRXY4T2pqU3FaZFZtZ1lF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Clandeno (CLD) Presale & Ethereum (ETH) Both Surge Amid Binance Coin (BNB) Uncertainty - The Cryptonomist",
        "content": "SPONSORED POST*\n\nTL;DR\n\nEthereum (ETH) has retaken critical support levels of $3,000, rising to $3,200 as of press time.\n\nMeanwhile, the uncertainty surrounding Binance Coin (BNB) has led to a very modest gain compared to other big-cap altcoins.\n\nThe modest gains of both Ethereum (ETH) and Binance Coin (BNB) has led investors to reallocate their profits to low-cap gems like Clandeno (CLD), currently in its ICO phase.\n\nClandeno (CLD) is a peer-to-peer (P2P) e-commerce platform that uses blockchain technology to facilitate safe transactions between consumers and sellers. According to experts, it has the potential to skyrocket this summer.\n\nClandeno (CLD) Presale Brings In Millions\n\nClandeno (CLD) was one of the revelations this summer. The decentralized e-commerce platform has amassed $2 million after launching its presale earlier this month, indicating the major traction it has gained with its exciting Web3 take on e-commerce. Clandeno (CLD) is ushering a new era in the trillion-dollar online shopping industry with the launch of its decentralized online marketplace. The project is being widely expected by analysts to be among the biggest gainers of 2024 thanks to its features and innovations. Analyst price predictions peg Clandeno (CLD) to turn in outsized ROIs this summer, outperforming Ethereum (ETH) and Binance Coin (BNB) end-of-year price predictions.\n\nEthereum (ETH) Pumps Strong; Binance Coin (BNB) Slow on the Bounce\n\nEthereum (ETH) had been struggling mightily to start off July, falling all the way to $2,700 in the wake of the Bitcoin (BTC) crash. However, the recent Ethereum (ETH) approval and the recent recovery of Bitcoin (BTC) to $60K catalyzed a pump that pushed Ethereum (ETH) prices to $3,200 as of press time. However, Binance Coin (BNB) failed to show the same robust growth over the past week, recording a modest 5% gain compared to Ethereum (ETH) and Bitcoin (BTC). One of the major concerns for investors is Binance Coin (BNB) issuer Binance’s legal woes, which have contributed to an overall bearish trajectory of Binance Coin (BNB). Currently, Binance Coin (BNB) trades at $538.\n\nClandeno (CLD) Could Deliver Massive Gains for Early Investors\n\nClandeno (CLD) is introducing blockchain technology and combining it with Web3 to create an online marketplace with exciting DeFi and decentralized e-commerce features. Clandeno (CLD) will connect merchants and sellers under one roof and provide the most viable decentralized alternatives to eBay and Amazon. With the trillion-dollar e-commerce industry only set to grow exponentially in the coming years, Clandeno (CLD) Token prices are as low as they ever will be. Don’t sit this presale out!\n\nConclusion\n\nForget Binance Coin (BNB) and Ethereum (ETH) if you wish to make serious and tangible gains worth your investment. To get the most out of your capital, the best opportunity on the board is THE most awaited ICO of July: Clandeno (CLD).\n\nTo find out more about the Clandeno presale, visit their website here"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOOXgzbjZzci01RFZyZHR4a1BzdVVacmQwZFJrMmlzekpkSlJZUEFpVTRoamloMExHTFdrTU01UUdFaUxhV0hab1cwTFJjdWhWeC10elhCaG9sSVBKZWlQZUNMc0pramp0MWhtSDVnNkx2SVdNNUhLcjhGSVFJNEFRMkhEUdIBiAFBVV95cUxPZzdCWVo3Yk1DaVdVMWhxTThFUUpRWnRPRzZReFJUOHFrZHJLTHVxdHBQQmF3a18zQnlaei1ZdGFueTN4RjVqOTFoQ2VoYUhmNndoQVJXMzE3VThlWnNoTlhCQzBFaURXUE9ibjdTZGYtbGF0NzMtQ3A2dkFqemZzSEkxdnNjdklq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "3 Altcoins To Sell Should Ethereum Tag $5,000 Post ETF Approval - CoinGape",
        "content": "Three Ethereum ETF operators received preliminary approvals earlier in the week as Bloomberg analyst Eric Balchunas predicted trading to start next week. The news coincided with a general bullish wave in the cryptocurrency market as Bitcoin jumped above $65,000. As the market recovers following last week’s sell-off, investors may want to pay attention to altcoins to sell if Ethereum rallies to $5,000 after spot ETFs begin trading.\n\n1. Altcoins To Sell – XRP (XRP)\n\nXRP is the native coin for the XRP Ledger, a blockchain designed to help financial institutions streamline cross-border payments using a fast and cost-effective network. Ripple Labs is the company behind XRP and XRPL. It has onboarded multiple banking institutions so far and continues its crusade to onboard more.\n\nadvertisement\n\nThe price of XRP is trading around $0.5457, a 25.7% increase in the last 7 days. XRP price is displaying signs of a breakout that the entire crypto market has long awaited. Since the onset of the Ripple-SEC lawsuit in December 2020, the asset’s price has been suppressed below the $1 cent level.\n\nThe Ripple network saw a surge in adoption following news that the CME Group would launch new daily price reference rates and real-time indices for XRP and ICP beginning July 29, 2024.\n\nConsequently, whales rush to buy the crypto asset, with one big player buying 38 million XRP ($20 million).\n\nThis comes as the Ripple-SEC lawsuit shows signs of ending. Following the recent settlement between Terraform Labs (TFL) and the SEC, Ripple appealed to the court to have its penalty reduced. Subsequently, the penalty was reduced to less than $120 million. Along the same lines, the SEC dropped its investigation into Ethereum, after which 19-4b ETFs were approved. The exact process could unfold for Ripple and XRP.\n\n2. MAGA (TRUMP)\n\nMAGA is among the many Trump altcoins that mushroomed when the former American president announced his bid to vie for the November 2024 elections. The crypto project also markets itself as a charity, donating proceeds of the 1% on-chain tax on buys, sells, and transfers to veterans and Child trafficking prevention services in the United States. As of July 15, MAGA has donated $1.7 million to these causes.\n\nTRUMP is the native token of the MAGA community, and its price jumped nearly 50% from $6.34 to $$8.03 over the weekend after an assassination attempt on Donald Trump. The price of TRUMP had been rising gradually in anticipation of the upcoming Bitcoin 2024 conference in Nashville, in which the former president was slated to deliver a 30-minute speech. Following the attempt on his life, Trump has affirmed that he will still show up to the conference.\n\nAnalysis by Lookonchain and Arkham Intelligence discovered that Gigantic Rebirth’s (GCR) address, tagged “GCR Address 1,” still holds over 936,000 TRUMP tokens and has a profit of over $6.5 million.\n\nAnother address tagged \"GCR: Address 1\" still holds 936,279 $TRUMP($7.23M) and has not sold it, with a profit of more than $6.5M!https://t.co/qGFbpGAuJW pic.twitter.com/16LpqJX61e — Lookonchain (@lookonchain) July 15, 2024\n\nThis indicates that whales are still holding this altcoin. After winning the debate and escaping assassination, his odds of winning the elections may have just gone up, and with them, the price of TRUMP.\n\n3. Altcoins To Sell – Chainlink (LINK)\n\nChainlink is the glue that holds the majority of DeFi protocols together. Developed by Sergey Nazarov, Chainlink is a universal platform for blockchain builders and decentralized financial institutions. The main product of the Chainlink oracle network is the Cross-Chain Interoperability Protocol (CCIP), which allows the secure and reliable transmission of data and its value between different blockchain networks. As an oracle network, Chainlink’s services enable smart contracts to communicate securely with real-world data and services outside the blockchain network. This may impact real-world assets (RWA), DeFi, AI, and even DePIN sectors.\n\nLookonchain just spotted a whale who has secretly accumulated 12.75 million LINK ($167 million) across 93 different wallets in less than one month. Such a massive investment is a bullish signal for the crypto asset.\n\nIt seems that a mysterious whale/institution is accumulating $LINK! We noticed 93 fresh wallets withdrawing 12.75M $LINK($167M) from #Binance since June 24!https://t.co/SkqA1r0F1N pic.twitter.com/AJR4fT36VG — Lookonchain (@lookonchain) July 14, 2024\n\nChainlink price is up 2.5% in the last 24 hours to trade at $14.10. Chainlink price prediction shows strong support around $12.8, which may hold up the price if market conditions turn bearish. However, before that happens LINK is one of the altcoins to sell as you wait for the perfect entry position.\n\nLINK’s relative strength index (RSI) just crossed above the mid-point, confirming a bullish uptrend and increasing buy momentum. The moving average convergence divergence (MACD) indicator also spotted a bullish cross-over, confirming a LINK bullish reversal.\n\nConclusion\n\nWhile Ethereum’s price potentially hitting $5,000 post-ETF approval might seem like an exciting opportunity, it may also signify a good moment to reassess your altcoin holdings. As Ethereum gains momentum, some altcoins might struggle to maintain their value or relevance. XRP, LINK, and MAGA represent some altcoins to sell, allowing you to consolidate gains and potentially reinvest in more promising or stable assets.\n\nFrequently Asked Questions (FAQs) 1. Who are crypto whales? In cryptocurrency, \"whales\" refer to individuals or entities that hold a large amount of a particular cryptocurrency. These holders can significantly influence the market due to the sheer volume of their holdings. 2. What are altcoins? Altcoins, short for \"alternative coins,\" refer to any cryptocurrency other than Bitcoin including Ethereum. 3. Is Ethereum a good buy? Yes, Ethereum is a good buy. Analysts predict the Ethereum price will surpass its all time high when ETH ETFs launch.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQRWlpV05XMG1tWVY0NEZoQWZ5NWV3cERsb09HQVllYVh5ZlppaXVMbWVIWUpndW1mZlJZb1F1bWhGTFRHYkk2aDh2N1BuczJZc0FGT3d0Q3lNalFNUFl4RkIwUTFVd0FqTEI3bzhQTTJ4anZ2ZV9FTDFnaEJuYnVmUFZkT0hpSzRzZEVMbmxB0gGTAUFVX3lxTFBGOTdaeS02WnBnS2p5SHBrZ3dWY0FtSUxITWN6bm9RbXl0dk8yRDlkTjRYdzhmNEIzdUFLNnhpb2FhMHIyUUVXck5yeHNKVWQ1TGtfNE03cThVQTJESHg1NFI0UEl2VlJ3MlRCOE5VOGdoeWMyU2tUVkZJSVRGQjJZOEo5eU54a2VVRzVFTU5iUHBiaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Justin Sun buys Ethereum worth $45M from Binance: What’s his plan? - AMBCrypto News",
        "content": "Justin Sun’s recent 14,436 ETH purchase from Binance continued his strategic investments in Ethereum.\n\nSun’s history of buying ETH has revealed a calculated investment pattern, resulting in over $50M in unrealized profits.\n\nJustin Sun, the founder of Tron [TRX], has reportedly made another significant transaction involving Ethereum [ETH].\n\nAccording to on-chain analytics provider Spot On Chain, Sun allegedly redeemed 14,436 ETH from Binance [BNB].\n\nThe transaction in question involved the withdrawal of 14,436 ETH, worth approximately $45.51 million, from Binance by the wallet 0x43594da5d6a03b2137a04df5685805c676def7cb, which is believed to belong to Justin Sun.\n\nThe transaction ID for this withdrawal is 0x49856fe8819766a4788d92430bdb2281a1903d43d5cc920633c08753441884bf.\n\nMoreover, the withdrawal took place around 22 hours ago, following a deposit of 45 million USDT to Binance three days prior. This makes the purchasing price around $3,117 per ETH.\n\nJustin Sun’s history of buying ETH\n\nSince the 8th of February, Sun has potentially acquired 377,188 ETH at an average price of $3,049. All these transactions were completing by using three separate wallets.\n\nThe aforementioned purchases included 169,604 ETH in February at an average price of $2,870, 192,168 ETH in April and July at an average price of $3,175, and 15,416 ETH in June at an average price of $3,474.\n\nThese acquisitions have led to an unrealized profit for Justin Sun, exceeding $50 million at press time, reflecting a gain of about 4.4%.\n\nMarket reaction\n\nWhen Sun made his recent withdrawal, the price of ETH dipped by approximately 10%, causing significant unrealized losses.\n\nDespite this, Sun has continued to make notable acquisitions. Tron’s co-founder reportedly used another 5 million USDT to buy 1,614 ETH at around $3,097 per ETH.\n\nHis strategy typically involves depositing stablecoins to exchanges before purchasing ETH, indicating his ongoing interest and engagement in the Ethereum market.\n\nAs of press time, ETH was trading at $3,353.33, with a 24-hour trading volume of $12,181,635,567, per AMBCrypto’s look at Coingecko’s data.\n\nThis marked a 4.89% price increase in the last 24 hours and a 15.47% increase over the past seven days."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPYnFMYUVBdm5CekFpLUZxbU5XMHFRMHg2djZJc2ZOYnpaLS0tNzFreEEzZFo5elgwT1dOc3dkUFNyOEF6NUh6TzFJbWk3ak5ISjRtSGpsYmQtbmMxT3IxY0xyRW1jTEstelhCLU92X2cxZldMenBGYlNmSlZWOWpxVE80bmFQenZQWnAyaWY1YmQ1M2VLVzVvQ0ZlMXNhNE53OEt2NENTN0hkOVlCVGt2aG5jaERLSFEzcHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs to begin trading on July 23 after US SEC gives preliminary approval - Nairametrics",
        "content": "The much-awaited spot Ethereum Exchange Traded Funds (ETFs) are set to begin trading by July 23 after the United States Securities and Exchange Commission (SEC) under Gary Gensler gave preliminary approval to some of the proposed issuers of the Ethereum ETF.\n\nThe United States SEC gave preliminary approval to three out of the eight asset managers who are proposing to issue Ethereum ETFs to their clients.\n\nThe three asset managers include Blackrock, VanEck, and Franklin Templeton and the approval hinges on applicants submitting final offering documents to regulators before the end of this week.\n\nAll eight Ethereum ETF issuers are expected to launch simultaneously according to credible sources.\n\nThe other Ethereum Etf issuers Fidelity, ARK 21Shares, Grayscale, Bitwise, and Invesco Galaxy are also expected to receive their preliminary approval from the US SEC ahead of next week’s proposed date of trading.\n\nEric Balchunas, Senior Bloomberg ETF Analyst confirmed the July 23 trading date with a post on X stating that he can confirm that the SEC has asked all issuers to submit their final S-1 fillings on Wednesday ahead of a July 23 launch.\n\n“Update: Nate’s instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided with no unforeseeable last-minute issues of course!” Eric tweeted.\n\nNairametrics earlier reported that Bitwise’s Chief Investment Officer Matt Hougan predicted that the Ethereum ETFs could attract up to $15 billion in net inflows in the first 18 months of trading pulling a similar feat to what Bitcoin ETFs launched in January achieved.\n\nMatt Hougan also expects the S-1 fillings of the issuers to be approved next week on Monday after trading hours. This will prepare it for the launch of trading the next day which is July 23.\n\nIf the S-1 fillings by the issuers are approved the spot Ether ETFs by the issuers are expected to be listed on the Nasdaq, New York Stock Exchange, and Chicago Board Options Exchange.\n\nThe Ethereum ETF is the second crypto asset to have an exchange-traded fund in the United States after Bitcoin ETFs were launched in January.\n\nThere has been speculation about a potential Solana ETF this year after Ethereum ETFs have launched.\n\nWhat to Know\n\nAn S-1 filing is a registration statement that a company files with the Securities and Exchange Commission (SEC) when it wants to go public and issue shares on a stock exchange. The form is also known as the “registration form” because it registers the company with the SEC.\n\nThe United States SEC has completed the first phase of the Ethereum ETF approval which is the approval of the 19b-4 files by the SEC in May."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNMlFYT3BEX2lrdW9BbFpoa256MXcyWXV2aXVOd0h5MEVhQXBUVHp5TjJGdjFjWEhVNXJqbjlXaS1udXA1OTdaWXNBd0d1QU9kMkZ1OENES00tS2JFOFI5bGc3NGJEX3hPNFZmQkM3eG95MmpfQnZiOHpVTzJSTVRtalVYMGhZRmNXenNCc0gwdjhRMzh3TmdHQ1dJb1BxRkY3aDd4c01tM0tzeDduei04LXlCV20zRG95dGhsb1V4eHdEQVVtMVFJYzVuNjJWRTRMVHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Solana 'No Longer In Ethereum's Shadow, SOL Could Outperform ETH,' Says Expert - Benzinga",
        "content": "Solana SOL/USD is well-positioned against Ethereum ETH/USD, according to the analysis of a prominent industry expert.\n\nWhat Happened: According to Coin Bureau CEO and co-founder Nic, Solana is already outperforming Ethereum. Comparing the two blockchains, Solana started the year with fewer tokens but has since overtaken Ethereum since its ecosystem has seen 65% more token listings in the first half of the year.\n\nWill Solana outperform Ethereum?\n\n\n\nHere are 3 charts from the recent CMC H1 report that show how it is already doing so 👇 — Nic (@nicrypto) July 15, 2024\n\nThis leads to more users and more active addresses on Solana, which has the most daily active addresses of any Layer-1 blockchain. Ethereum, in comparison, ranks fourth.\n\nSolana is “the home of NFTs” and leads in unique wallets, buyers and transactions, while Bitcoin and Ethereum lead in terms of volume.\n\nNic points to the meme coin madness driving Solana usage and awareness. \"The higher the returns, the more users they draw. It’s a degen cycle and Solana is top here,\" Nic concludes and thinks, \"Solana is no longer in Ethereum’s shadow.\"\n\nAlso Read: Solana Up 7% And Could Get To 50% Of Ethereum’s Valuation As ‘Most Liquid Election Proxy In Crypto,’ Trader Says\n\nWhy It Matters: Crypto chart analyst Ali Martinez sees bullish short-term price action coming for SOL:\n\n#Solana appears to be forming a W pattern, which suggests $SOL will surge toward $174! pic.twitter.com/OxXODWi1yA — Ali (@ali_charts) July 15, 2024\n\nA ‘W chart pattern' is formed when an asset’s price drops and then rises again before dropping once more and rising for a second time. A double bottom with a W shape signals bullish price momentum.\n\nAnother crypto trader recently confirmed a breakout for Solana, with yet another trader seeing Solana making a new all-time high later followed by a rally in ecosystem-related tokens.\n\nPrice Action: In the past 24 hours, SOL is up 3%, taking its weekly gains to 10.7%.\n\nWhat’s Next: The influence of Bitcoin as an institutional asset class is expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next:\n\nThis content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nImage: Shutterstock"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE45R25KZWtMV0FhTl9BQ25CTGoteS1FRC1fOEJiTWNyVUI5RHZESDlRN0NrUkJvc2VyeDBaSU9MQVhIT3dvMmYzZ3UwZlVUdHFKdGNCWjE4Mmw5d2RxWVEtclF4Y2hlUUx2UGlhWlpiaE03bl9OcDdzcFpmWF_SAYIBQVVfeXFMTWVhS0lLa0FLM3IwVm5kTXdaTTJPeVlXYXVPZXYtNTFVbmFIZlJMOFJQZXhXYk8tVEhVYXhSV1BhUFRhSXd1NXZIRFBiWFI0OVhJUWI2c0dadjFnaHNmUXFrREtYcjhsdkc2MWhxXzY1aFhKWG1Zc29Rck56WmdQTW5WZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Etheruem’s next price target: ETH can cross $3700, IF… - AMBCrypto News",
        "content": "Ethereum has a bearish market structure on the daily chart but still targets the next key resistance zone.\n\nThe volume has been sub-par in recent days, hence a retracement next week is possible.\n\nEthereum [ETH] clambered back above the $3k level, and in an interesting turn of events for the bulls, the $3.1k former resistance zone was flipped to support.\n\nThe balancing act between whale deposits and exchange reserves showed that the recent deposits were minor compared to the outflows of the past two months.\n\nThe Ethereum network’s gas fee reached May’s lows, a sign of reduced network activity. This was not a positive sign and reflected reduced on-chain demand and slow growth.\n\nVolume indicators ambivalent despite the breakout\n\nOn Saturday the 13th of July, Ethereum closed a daily trading session at $3,201, breaking out of the resistance zone in the $3.1k area. Despite this achievement, the market structure and momentum were bearish in the daily timeframe.\n\nMoreover, the CMF showed a reading of -0.05 which signaled notable capital flow out of the market. The OBV was unable to start an uptrend as buying volume stuttered over the past ten days. This meant that the volume was too weak to be taken as a clear signal of bullish strength.\n\nThe daily RSI was at 45 to signal bearish momentum but has crept higher over the past week. As things stand, Ethereum might not be ready for a swift upward move unless more volume enters the market.\n\nLiquidation heatmap’s clues on the next resistance\n\nThe $2.7k-$2.8k zone to the south was an attractive pool of liquidity. It was tested in the first week of July but not wholly swept.\n\nThe subsequent price bounce above $3.1k meant the next liquidity cluster at $3.5k-$3.7k would be the target for bulls.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nThe Open Interest has climbed alongside the prices and the funding rate was positive. The sentiment was strongly bullish, and the spot CVD was recovering too.\n\nIf the trend remained intact, the chances of an ETH move toward $3.6k would become healthier.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE8yU0VRQzZRYTNJTHhnQjVlNnZKeXhEd0xvTFBtY3ROVGlLTmlLOEQ0bl82czktaHBxM0pfNkEycTN5Wk8wemR4RGhBRTlYdnN5dVhhd0FLUFVNelJ4aTR2SGp2dHoyVGZrMzVtMUhZenRlSm_SAXhBVV95cUxPc2RGV2Nuc3ozVHd5VG1JRTJtWHYtVTdISlN0b2NQZzZpeGQ5UGRac01CNy1UV3RQSHNscG5NUUpiYkRkS0ZWQTFxNElFbzQtVVVqMENhNWZrcVpmZFlZRHVxNnJiMzZDbzhXVXNjVVAyb1g0UDF1dW4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 03:20:58 GMT",
        "title": "Ethereum Price Rockets to $3,500 Again: Can Bulls Ignite a Higher Surge? - NewsBTC",
        "content": "Ethereum price gained pace above the $3,350 resistance zone. ETH even tested $3,500 and aims for more upsides in the near term.\n\nEthereum is showing strength and tested the $3,500 level.\n\nThe price is trading above $3,350 and the 100-hourly Simple Moving Average.\n\nThere is a key bullish trend line forming with support at $3,320 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to rise above the $3,500 and $3,550 resistance levels.\n\nEthereum Price Climbs 10%, Bulls In Action\n\nEthereum price started a major increase above the $3,250 resistance zone. ETH even climbed above the $3,350 resistance to move further into a positive zone. Finally, there was a move above the $3,440 resistance, like Bitcoin.\n\nIt tested the $3,500 resistance zone. A high was formed at $3,497 and the price is now consolidating gains. The bulls seem to be active well above the 23.6% Fib retracement level of the upward wave from the $3,085 swing low to the $3,497 high.\n\nEthereum is now trading above $3,400 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support at $3,320 on the hourly chart of ETH/USD.\n\nOn the upside, the price is facing resistance near the $3,480 level. The first major resistance is near the $3,500 level. The next major hurdle is near the $3,550 level. A close above the $3,550 level might send Ether toward the $3,650 resistance.\n\nThe next key resistance is near $3,720. An upside break above the $3,720 resistance might send the price higher toward the $3,880 resistance zone in the coming days.\n\nAre Dips Limited In ETH?\n\nIf Ethereum fails to clear the $3,500 resistance, it could start a downside correction. Initial support on the downside is near $3,400. The first major support sits near the $3,320 zone and the trend line.\n\nA clear move below the $3,320 support might push the price toward $3,270 or the 50% Fib retracement level of the upward wave from the $3,085 swing low to the $3,497 high. Any more losses might send the price toward the $3,220 support level in the near term. The next key support sits at $3,150.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $3,320\n\nMajor Resistance Level – $3,500"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5RZk1GcVZOM3BoWXZXSmUyMC1kdzhYNm8taGZfOHRaMlNWQmYzcGdQbkxCd1BzNXlvak91Qm5EemMxREtfRHBVcWR5ZUdGWTA1RUNzcjVXb3NMcHJ1TnBzdmthVU9VTVIwOUdXUmxKajFSaVo5Z1FV0gF8QVVfeXFMT0hJVXlVdi12YkNPUkd5Q3ppNDFKNDVBZWdYMWNuX1dZYWFkaHBqanpWczFlVHVOd25ScDFyaERzOHZydFNHYmZVX0JOT3N0YS1RQlhrS28wMENuMld3WTZ6YVN2aUVvdFotZUVZdkt0SDlqbHM2cUZOMXZfcg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 21:03:48 GMT",
        "title": "Crypto Analyst Says Ethereum Price Is Headed To $4,000, Here’s Why - NewsBTC",
        "content": "Crypto analyst Linda has made a bullish case for Ethereum (ETH), predicting that the second-largest crypto token by market cap could rise to $4,000. The analyst also explained what could lead to such a price surge.\n\nWhy Ethereum Could Reach $4,000\n\nIn a post shared on TradingView, Linda highlighted the potential approval of the Spot Ethereum ETFs as one factor that could trigger a move to $4,000 for Ethereum. She noted that the sentiment around these funds is positive, with traders waiting for news from the US Securities and Exchange Commission (SEC).\n\nRelated Reading\n\nThese Spot Ethereum ETFs are expected to be approved anytime soon based on predictions made by market experts, including Bloomberg analyst James Seyffart. Similarly to Linda’s prediction, other crypto analysts like Michael van de Poppe have predicted that the Spot Ethereum ETFs will spark a massive rally for Ethereum.\n\nMeanwhile, from a technical perspective, Linda noted that Ethereum’s outlook is bullish and supports the crypto token’s potential rise to $4,000. She claimed that the trigger area for buyers was at $3,200. In line with this, she believes that further final consolidation of the price above the 200-day moving average and a breakout above $3,200 will “become the reason for strengthening,” with a potential price target between $4,000 and $4,800 in sight.\n\nOn local timeframes, Linda also stated that there are “prerequisites for a bullish mood,” especially on the daily timeframe, where the analyst noted that a rebound from strong support is forming. Based on her analysis, Linda claimed that the overall outlook for Ethereum points to a further rise to $4,000.\n\nEthereum’s Chart Identical To Bitcoin’s Before ETF Launch\n\nCrypto analyst Crypto Rover recently mentioned that Ethereum’s chart is identical to Bitcoin’s before the Spot Bitcoin ETFs launched. Based on this, the crypto analyst was suggesting that Ethereum could make a similar run to the one the flagship crypto enjoyed after the Bitcoin ETFs were approved.\n\nIn another X post, the analyst stated that the Spot Ethereum ETFs would be approved, meaning that Ethereum’s price rally could already be on the horizon. ETH’s price surge is expected to happen thanks to the inflows the Spot Ethereum ETFs will record. Crypto research firm K33 predicts these funds could attract as much as $4.8 billion in their first five months of trading.\n\nRelated Reading\n\nWhy Did The Cardano Price Surge 17% Amid The Crypto Market Crash? 2 months ago\n\nCrypto analyst Leon Waidmann also highlighted how these Spot Ethereum ETFs will spark a massive rally for Ethereum, stating that institutional investors will likely take a huge chunk of Ethereum’s dwindling supply once these funds begin trading.\n\nAt the time of writing, Ethereum is trading at around $3,300, up almost 5% in the last 24 hours, according to data from CoinMarketCap.\n\nFeatured image created with Dall.E, chart from Tradingview.com"
    }
]