[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQTk04ZkktSF9VTU80d0w5VmtWRkx6RUt5YWNsSGc2dGVkYm1mbkhUODhWZld0OTNFVHByTlZmQ1hZanRyOEM2TFAwVzVwaG9kaVZqSXF5MmR3ZVBnT0lKZ3RUX2Q4Qmg2V0xhblRpWlJwSlN1dWxQV3pZN0pPRjZKYQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Breaking Down Ethereum's Big Move and Why History Says It Will Do This Next - The Motley Fool",
        "content": "Ethereum is getting an ETF (or several) and it could lead to a major price surge.\n\nIt's been a wild ride for Ethereum (ETH 0.17%) over the last few years. Since launching in 2015, the cryptocurrency has grown by nearly 128,000% thanks to its novel smart contracts and dominance of the decentralized finance (DeFi) economy. Yet, as impressive as the last decade has been, its story might just be getting started.\n\nOn May 23, the Securities and Exchange Commission (SEC) paved the way for approval of a spot Ethereum exchange-traded fund (ETF). When completed, this process essentially opens up the cryptocurrency to a new set of buyers and puts additional demand on its deflationary supply. Here's why the decision is so historic and what it could mean for the world's second-most valuable cryptocurrency.\n\nA landmark decision\n\nJust a few weeks ago, the chances of a spot Ethereum ETF approval looked slim. Many analysts estimated there was only a 25% chance, but on Thursday, May 22, things took a turn for the better as rumors began to swirl that the SEC had had a change of heart.\n\nThe following day, it was officially announced that the SEC would approve all eight 19b-4 applications, paving the way for Ethereum ETF approval. It's not exactly the same thing as full approval, but that final step is almost guaranteed at this point. On the current timeline, the SEC is expected to approve the S-1 applications (the official documents that allow the ETFs to go live) sometime in the mid to late summer.\n\nThe reason an ETF is so significant comes down to its ability to democratize access for investors. With the ETFs, now investors can gain Ethereum exposure by simply buying shares like they would with a stock on a brokerage. Gone are the days of navigating crypto exchanges or managing digital wallets.\n\nIn addition, and perhaps most importantly, the approval of an ETF means institutional investors can join the game. Without an ETF, these investors were hesitant to get in on crypto because of a lack of regulatory guidance and custodial issues. That's why not only Ethereum's, but all of crypto's, ascent over the years has been driven by retail investors.\n\nBut ETFs provide an easy and accessible way for institutions to buy. And that's a great thing because institutional investors are known for their vast resources and deep pockets.\n\nCharting the future trajectory\n\nTo quantify the impact an Ethereum ETF holds, we can look back at Bitcoin's spot ETF journey. In January, Bitcoin became the first cryptocurrency to get a spot ETF, marking a landmark event in the world of crypto adoption and evolution. The 11 initial Bitcoin ETFs were a massive hit and quickly became one of history's most successful ETF launches. In just four months, they attracted more than $38 billion and at one point were buying up 10 times the daily supply of Bitcoin, effectively introducing a supply shock that sent Bitcoin's price to an all-time high.\n\nWhile it's unlikely that Ethereum ETFs will be as popular as Bitcoin ETFs simply because Bitcoin is the most well-known crypto asset, Ethereum still stands to benefit significantly. This is because Ethereum's market cap is smaller than Bitcoin's. In other words, it will take less capital to move Ethereum's price than Bitcoin's.\n\nWe can even speculate just how much Ethereum's price might move (emphasis on speculate). Since the Bitcoin ETFs launched, around $425 billion was added to its market cap. Not all of this was the direct result of the ETFs buying Bitcoin, but we can use it as a proxy to measure the effect of the ETFs.\n\nIf Ethereum ETFs were to be half as successful as the Bitcoin ETFs, then it would add $212 billion to its market cap, or roughly a 45% increase. If this were to occur, Ethereum's price would soar to $5,300, a new all-time high.\n\nThe road ahead\n\nWhile we can only speculate about the exact demand the Ethereum ETFs will generate, one thing is certain: Ethereum is about to be unlocked to a new class of deep-pocketed investors.\n\nThe impact of these ETFs will unfold over time, as institutional investors typically require extensive research and due diligence before making allocations. However, considering the success of Bitcoin ETFs and the recent trend of institutions revealing Bitcoin holdings, it's arguably not a question of if, but when these investments will materialize.\n\nIn the meantime, Ethereum presents a compelling investment opportunity. Despite its current price being around 25% below its all-time high, Ethereum's fundamentals have never been stronger. As we approach full ETF approval, expect increasing demand for the world's second-most valuable cryptocurrency."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOWDBXYTV1RTVWa1pCQ3lybnNiNkVjNkg2dWFfVUhta056cmVZdk9vZVNhUEZ6anMyREIwbnU2bU5QYk56bzJ0WjMxU1hsNGtPa0ViaVoxbUxsMXFpX1M0MmZ2bXE4ckF1Qk5DMC1BZWRPSjJvUjhYYndmZTVuNkJpZ20wTlBCdkk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "BlackRock Amends Spot Ethereum ETF Proposal with SEC, End of June Launch Possible - Yahoo Finance",
        "content": "BlackRock Amends Spot Ethereum ETF Proposal with SEC, End of June Launch Possible\n\nBlackRock has updated its filing with the Securities and Exchange Commission (SEC) for its proposed spot Ethereum exchange-traded fund (ETF). The May 29 amendment to the iShares Ethereum Trust marks a crucial step toward making an ETH-based ETF available to the market, following last week's surprising approval of a similar financial product.\n\nEric Balchunas, a Bloomberg analyst, suggested that other applicants are likely to follow BlackRock's lead. He added that if the SEC provides another round of detailed feedback swiftly, spot Ethereum ETFs could potentially launch as early as next month. “End of June launch a legit possibility, [although] keeping my over/under date as July 4,” Balchunas posted.\n\nBlackRock's proposed ETF, which will trade under the ticker symbol ETHA, clarified that it will not engage in Ethereum staking. This means the returns from the ETF will differ from those that would be obtained by directly purchasing and holding Ethereum.\n\nThis week has been monumental for the cryptocurrency sector. In Washington, D.C., a rare instance of bipartisan support emerged for a crypto regulation bill, culminating in the SEC’s unexpected approval of spot Ethereum ETFs. Joe Lubin, Ethereum co-founder and CEO of Consensys, views these developments as a pivotal shift in the regulatory landscape for cryptocurrencies in the United States.\n\nBlackRock initially filed an S-1 form for its spot Ethereum ETF with the SEC in November, joining other heavyweights like ARK Invest, Fidelity, and VanEck. Crypto custodian Grayscale is also in the race, seeking to convert its Grayscale Ethereum Trust (ETHE) into a spot Ethereum ETF, a move similar to the one that paved the way for spot Bitcoin ETFs."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNX2RJRy1tNWlpUEYxSGlYdE9ySzg3b3dSN1hpekcwakx2Qmt4VU1fTDhpN2RrU2I5TnJKaGJEaHBGUEstZlFhWEVoZmZaNjlkeHJvWFBFdmlycnFPUTlPcFI3eGN4T3JUc1JJVllJbVN0SWhHMDEzWHpTZ3BYLVRmcnNhYTlUdGFlRWNFWWZrQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Likely Protect Ether From the SEC. But What About Staked ETH? - Unchained",
        "content": "The SEC’s approval for Ethereum spot ETFs may help clarify ether’s commodity status, but it still leaves room open for the agency to put staked ether, and staking, in its crosshairs.\n\nFrom the day Ethereum switched to proof of stake, Gary Gensler, the chairman of the SEC, has been hinting that staking could violate securities laws.\n\nThe recent approval to list spot Ethereum ETFs in the US has brought some clarity to the question of whether ether is a security or a commodity, since the issuance order for the funds lists them as “commodity-based trust shares.”\n\nAs Unchained recently reported, the issuance order, which places ether’s status as a commodity, could provide a strategic advantage to any crypto companies caught in legal battles with the U.S. Securities and Exchange Commission (SEC) regarding ether. Yet many of those battles surround staking and staked ether, which the agency is yet to provide any clarity on. From the day Ethereum switched to proof of stake, Gary Gensler, the chairman of the SEC, has been hinting that staking could violate securities laws.\n\n“From the coin’s perspective…that’s another indicia that under the Howey test, the investing public is anticipating profits based on the efforts of others,” he said in an interview with the Wall Street Journal in September 2022, not referring to any one specific cryptocurrency at that time.\n\nThe Significance of the Merge\n\nIn March, Fortune reported the Ethereum Foundation had been under scrutiny by the SEC since Ethereum transitioned to a proof-of-stake model in September 2022. This transition, according to sources familiar with the SEC’s investigation, provided the agency “with a new pretext to attempt to define Ethereum as a security.” Software firm Consensys received a Wells notice from the agency regarding MetaMask staking, which partners with liquid staking providers Lido and RocketPool. Crypto exchanges Kraken and Coinbase were also sued by the agency in relation to its staking services among other allegations.\n\n“The change in Ethereum’s consensus mechanism to proof of stake (and the way in which staking was determined to work, as a result) was certainly a moment in time when the facts surrounding the protocol (or aspects of the protocol) changed,” said Zachary Fallon, a partner at law firm Ketsal, in an email. “And it seems to me that the SEC has viewed this change as potentially material and worth exploring for purposes of its potential oversight.”\n\nRegulatory Uncertainty Remains Around Staked ETH\n\nPrior to the approvals of the spot Ethereum ETFs, the ETF issuers who intended to offer staking were asked to remove that detail from their filings, which means the ether ETF approvals do not put staked ether in the clear in the same way it does for ether’s security status. However, several ETF experts previously told Unchained that it was unlikely that staking would be included in the initial approval of the funds because it was not “the status quo” across all applications.\n\nAnd while the issuance order brings some more clarity to ether’s security status, Sam Enzer, a partner at Cahill Gordon & Reindel, previously told Unchained that the commission could still revisit that determination. An SEC spokesperson declined to comment on the status of ether or staked ether.\n\n“The SEC has, I think, … reserved room to argue that ether staking is securities activity,” said Enzer. “Whether they will press that argument remains to be seen.”\n\nThe Consensys lawsuit against the SEC seems to indicate that the SEC views liquid staking tokens as securities, with passages such as, “[O]n September 21, 2022, Consensys received another letter from the SEC staff advising that the agency was conducting an investigation into certain staking protocols on the Ethereum network.”\n\nElsewhere the lawsuit stated, “The SEC staff also stated its view that Consensys, in connection with its MetaMask Staking program, violates both Sections 5(a) and 5(c) of the Securities Act by engaging in the offer and sale of unregistered securities and violates Section 15(a) of the Exchange Act by acting as an unregistered broker-dealer.” The liquid staking tokens available on MetaMask Staking in the US include tokens from Lido and Rocket Pool.\n\nIs Staked ETH a Security?\n\nAlex More, head of litigation at Carrington, Coleman, Sloman, and Blumenthal, previously told Unchained that it would be tough to argue that a user who is staking is participating in a securities transaction because there is no managerial efforts, they are just protecting the integrity of the network. The challenge is when an entity — decentralized or centralized — aids the user in the staking process, he said. If the entity does something to manage those staked assets then the SEC might have a stronger case that it’s a securities offering, he added.\n\nEnzer agrees with More’s assessment, noting that he doesn’t believe staked ether itself is a security nor is Gensler going to sue someone who holds staked ether. Tokens are not securities, he added.\n\n“I think [Gensler] thinks the Ethereum Foundation is a centralized issuer and the security they are offering is a staking program,” Enzer said. “The staked ether, you could say, is the object of that transaction.”\n\nThe foundation, staking providers and developers of staking protocols could all be in danger of being characterized as operating an investment contract scheme by the SEC, he added.\n\nThe Ethereum Foundation did not respond to a request for comment from Unchained regarding the status of staked ether or regarding the reports of an investigation by the SEC.\n\nWhere the SEC Could Go From Here\n\nThe SEC already won one case in relation to staking. It charged crypto exchange Kraken with failing to register the offer and sale of its staking-as-a-service program. The SEC alleged that Kraken touted benefits derived from the exchange’s efforts on behalf of investors. Kraken settled with the SEC, closing down its staking program in the US and paying $30 million in civil penalties.\n\n“Kraken was his first case against a major exchange, but it wasn’t an attack on the entire exchange’s platforms. It’s one little thing, then he sues Coinbase, Binance, Kraken. Whether he would go after the Ethereum Foundation or Lido or any of these other providers in the ecosystem that relate to staking, I think it depends on what happens as cases are making their way through the courts — if he wins certain rulings in some pending cases,” Enzer said.\n\nIf a case is brought against Uniswap and MetaMask, which have both already received Wells notices, then those could touch on issues that could set a precedent that would be relevant for whether he would want to pursue a case against staking protocols or the Ethereum Foundation, he added."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPanVtV05KNkZKSzdLSGNqb1o3cUxkajRhVnlrLWpVTmRIVjNMbHYtRmR0VjhFV2tDV3RXUUZua3VOenp5OEp5by1lU0ltVHVCN0N0blF4MUVYd1I2OHZhX0E4dHBDY3FOUDdVdXlCSDdBWkRoaHNENHc5UDRiM0UtRTdWVDdMc1FydFdTdkhCNDB0eXRyXzc1bjhGZjdmZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Blackrock updates S-1 filing for Ethereum ETF, marking step toward launch - CryptoSlate",
        "content": "BlackRock amended the S-1 registration statement for its spot Ethereum ETF in a May 29 filing, marking a step toward approval.\n\nThe filing builds on BlackRock’s original registration statement, which was initially filed in November 2023.\n\nBloomberg ETF analyst James Seyffart called the filing a step toward launch after the SEC approved 19b-4 listing rule changes on May 23.\n\nHe said:\n\n“This is almost certainly the engagement we were looking for …”\n\nSeyffart reaffirmed his belief that the S-1 statements could gain approval in the coming weeks, leading to spot Ethereum ETF launches, but admitted that the “norm is months.”\n\nPlaceholder data filled\n\nThe S-1 filing fills several placeholder fields, including details about seed funding.\n\nAccording to the filing, the fund has generated $10 million in proceeds via a seed capital purchase by BlackRock Financial Management of 400,000 shares at $25 per share.\n\nThe sponsor, iShares Delaware Trust Sponsor, may collect up to $500,000 in fees per annum. The latest filing does not calculate a percentage-based sponsor fee.\n\nThe trust will issue and redeem shares only in blocks of 40,000. The fund’s ticker is ETHA.\n\nWilmington Trust, National Association will act as the Delaware trustee. Bank of New York Mellon will act as trust administrator and cash custodian.\n\nIn-kind redemptions considered\n\nThe new S-1 also reintroduces the possibility of in-kind creation and redemptions, which would allow for crypto rather than cash transactions among authorized participants.\n\nIt acknowledges that approval of in-kind transactions is not guaranteed and that timing is uncertain.\n\nBlackRock’s original S-1 statement mentioned the possibility of in-kind creations and redemptions in passing. However, an amendment notice to Nasdaq’s 19b-4 filing in April said that authorized participants would rely solely on cash when creating and redeeming shares in the fund.\n\nThe latest S-1 also explicitly states that BlackRock will not engage in ETH staking, aligning with Nasdaq’s second May 22 19b-4 amendment on behalf of BlackRock.\n\nAll other ETH ETF issuers have also removed the possibility of staking from their applications.\n\nMentioned in this article"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBoMzloaWFlcnZwR09aZ3VadmtrN0tIUEZ5ZTNKWVNDUVl1UHoySkJJZGpKZkRmSXM4SDVTZ0FsTnJGUW1hVWludGNSS3JTdXlNcU1Zd2Q5QWRNSUlFMUtVck9NQllVMzRMZEVBR2JxMUo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "EigenLayer raises the stakes for ethereum - Financial Times",
        "content": "Print this page\n\nThis article is an onsite version of our Cryptofinance newsletter. Premium subscribers can sign up here to get the newsletter delivered every week. Standard subscribers can upgrade to Premium here, or explore all FT newsletters\n\nHello and welcome to the FT Cryptofinance newsletter. This week we’re taking a look at a fast-growing new trend in decentralised finance.\n\nThe excitement over the arrival of stock market funds investing directly in cryptocurrencies this year has obscured the rapid changes taking place in the world of decentralised finance, or DeFi.\n\nThe hottest thing in the market at the moment is the emergence of EigenLayer, a new network that lets holders of the ether cryptocurrency simultaneously lend out the same coin multiple times.\n\nUnderscoring its appeal, its Seattle-based parent company Eigen Labs in February raised $100mn from Andreessen Horowitz’s a16z, one of the most influential crypto venture capitalists.\n\nThe concept behind EigenLayer is “restaking”, a new concept for the crypto market. At present holders of ether can earn interest, in the form of more tokens, if they deposit or “stake” their ether on ethereum, allowing the system to secure and validate transactions on the blockchain.\n\nThey earn a reward for it but that keeps their coins locked up and immobile. EigenLayer takes the staked ether and allows it to be reused in other applications that are also built on ethereum — earning them further yield in the process.\n\nIt may well sound familiar. That’s because, fundamentally, it is rehypothecation, or the practice of lending the same asset over and over again. It’s something global financial regulators have clamped down on since the 2008 collapse of Lehman Brothers, when it emerged that the US bank had used collateral posted by clients to help fund its own trades. It took years for customers to be reunited with their assets.\n\nIn the world of crypto, this vice is turned into a virtue. Other services such as Lido Finance also rehypothecate assets but hand out tokens that represent the value of the staked ether.\n\nThe twist with EigenLayer is that it is trying to extend the security that underpins the ethereum network to other applications that are also being built on ethereum. EigenLayer sits in the middle, connecting people who want to use their staked tokens to lend with new applications that are being built. EigenLayer uses automated algorithms and smart contracts to manage the process.\n\nThe advantage of EigenLayer is that, at least in theory, it solves a major issue for the ethereum network. Every application built on ethereum has to sort out its own security with its own validation, and that makes it a highly inefficient, fragmented and costly system that is difficult to scale. EigenLayer can help the network grow by piggybacking on the complex and effective system that validates it.\n\nFrom a standing start in December there are now just under 5mn ether coins, valued at $18.6bn, locked up in EigenLayer, according to data provider DefiLlama. That makes it the second-largest application in the DeFi market, between longtime players Lido on $36bn and AAVE on $13bn.\n\nBut in a research paper this week, Carol Alexander, professor of finance at the University of Sussex in the UK, argued that restaking was creating a major, new risk in the market.\n\nShe said the $18.6bn figure was “vastly overestimated” because some of the numbers had been counted multiple times. The true figure backing the activity is closer to two-thirds of that, she thinks.\n\nThat matters because, she said, each new application needs to rely on highly leveraged tokens backed by very little in a thin market.\n\nThe EigenLayer system is designed to punish bad actors such as hackers by confiscating a portion of staked tokens or deposits as a penalty. It relies on algorithms that unilaterally decide when malicious activity is happening.\n\nThat leaves the leveraged staking market exposed if there are deliberate attacks to steal funds, if prices are manipulated or if lenders simply have poorly coded algorithms, light borrowing standards or poor risk controls. And all built on an IOU of ether, she says.\n\n“Because the vast majority of staking is on ethereum, any stress events . . . have the potential to spread credit contagion throughout the DeFi ecosystem, and this could precipitate another DeFi winter,” she concluded.\n\nAlready the multiplication of layers is dizzying. Applications such as Renzo restake staked ether tokens on EigenLayer — and mint another token to represent that transaction. Applications such as Renzo “are taking on a very large credit risk”, Alexander warned.\n\nThat could lead to a cascade of liquidations in the market and tokens could depeg from other tokens whose value they are supposed to track, she said.\n\nIt has happened before. The collapse of the terra stablecoin, which triggered the crypto market crash of 2022, began with staked ether tokens in the DeFi market and spread because bigger traders and lenders were interlinked with other markets.\n\nHowever some have argued that introducing layers of applications on top of staked ether is “financialisation” of the ethereum network.\n\nEither it can be a protocol for open innovation, more akin to a commodity, or it can be an investable asset that will deliver a yield for investors, said the head of research at one staking service who declined to be identified.\n\n“It’s not really possible for them to do both. If you optimise ether as the financial asset . . . you’re encouraging the creation of this kind of layers and going further out in the risk curve to maximise yield.”\n\n\n\nYet market demand is potentially pushing ether and ethereum towards it being an investable asset, just when US lawmakers and financial regulators are leaning towards ether being a commodity.\n\nIf the Commodity Futures Trading Commission becomes the main US regulator for crypto as expected, then the agency may find itself going down a very deep rabbit hole when piecing together the aftermath of the next market crash.\n\nWhat’s your take? Email me at philip.stafford@ft.com\n\nWeekly highlights\n\nFormer FTX senior executive Ryan Salame was sentenced to more than seven years in prison after pleading guilty last year to election fraud charges and conspiring to operate an unlicensed money-transmitting business while at Sam Bankman-Fried’s failed cryptocurrency exchange.\n\nBlackRock’s IBIT became the world’s largest bitcoin exchange traded fund even though it only launched in January. Its holdings of just under 300,000 bitcoin pipped those of Grayscale, even though its rival held more than 619,000 at the start of the year.\n\nUsers of Gemini’s Earn lending programme will get nearly $2bn of their crypto that was stuck at Genesis, following the digital asset trader’s bankruptcy in January 2023.\n\nSoundbite of the week:\n\nElon Musk dismissed stories that he had talked to Donald Trump about digital assets. He wrote on his X social media site:\n\n“Pretty sure I’ve never discussed crypto with Trump, although I am generally in favor of things that shift power from government to the people, which crypto can do.”\n\nData mining: the rise of ethena\n\nAmong the signs of soaring optimism in DeFi is the emergence of a stablecoin called ethena. It is pegged to the ether cryptocurrency rather than the US dollar, and offers buyers a yield of 36 per cent. From nothing in January, it is now the world’s fourth-largest stablecoin with nearly $3bn in circulation. Its backers argue that it is fully decentralised — pegged to the price of ether so there are no deposited assets sitting in a bank. Instead it uses derivatives to keep the value in balance. This week it overtook First Digital USD, which has $5.29 in circulation and now sits behind Dai, which has $5.3bn in circulation.\n\nCryptofinance is edited by Laurence Fletcher. To view previous editions of the newsletter click here.\n\nYour comments are welcome."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQOWhLQmpCUVAwc0xPcUtwRXdUd0plLWJkVGF3QUNsaTE1LWlhMWRnTWd1dDkwWmQxYnl0eGhsV1hNbm15RG1hSUpxRjFrYzViZkxJVWpPd1RiNmxrbkQxc2RtR0RmUHFlN0hLT0VCSjVWWFJxcFY3OS1fdUFfYTdNLWZnRDBpUG1sWEQwTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "BlackRock advances with Ethereum-based ETF project - Baseline",
        "content": "BlackRock, a leading name in asset management, recently disclosed updated information about their proposed Ethereum-based exchange-traded fund (ETF). This novel investment product has hit major headlines as it holds potential to diversify traditional investment portfolios.\n\nThis progression in the Ethereum ETF project is seen as a response to the rising demand for digital investments. The approval of BlackRock’s Ethereum ETF could trigger other asset management firms to roll out similar products, similar to the trend seen with Bitcoin ETFs.\n\nThe first acquisition related to the project was made by the ‘Seed Capital Investor’ who bought 400,000 shares at $25 each. These shares, now valued at a staggering $10 million, have significantly enhanced the investor’s financial portfolio. Moreover, the Trust’s net asset value has remained sturdy since this acquisition, reflecting a robust financial strategy.\n\nOnce regulatory approval has been secured, the Ethereum ETF assets can be converted into Ether. Investors can leverage Ether’s volatile market without the hassle of owning or managing the underlying cryptocurrency. The Trust plans to use ‘ETHA’ as the trading handle, subject to requisite approvals.\n\nBlackRock progresses with Ethereum-based ETF\n\nExpectations are high for the Ethereum ETF kick-off as recent approvals by the U.S. Securities and Exchange Commission have fuelled optimism in the crypto sector. This move by the SEC is seen as a validation of digital assets, thereby promoting wider participation in the mushrooming cryptocurrency markets. Furthermore, increasing popularity of Ether ETF could potentially trigger notable shifts in crypto market dynamics.\n\nMeanwhile, BlackRock’s Bitcoin ETF has also been massively successful, becoming the largest public Bitcoin fund worldwide. With nearly $20 billion in managed assets, the fund brought in a net inflow of over $16 billion. Given its promising return rates and accessibility for retail investors, the fund continues to attract those believing in the future of digital currencies. Corporate entities have also shown significant interest, underscoring the mainstream acceptance and adoption of cryptocurrencies.\n\nThe growth and potential of the crypto space is irrefutably confirmed by the success and acceptance of the BlackRock Bitcoin ETF. Edited by Parikshit Mishra, Deputy Managing Editor at the Data & Tokens team, this article offers insights into the trends, developments, and potentials in the world of finance, both decentralized and traditional."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBBZ1ZQMUxSc2FpWVV4aDRXU1J4cHJFcmZlLVdSbWw1TTJWMENaS1laZ0hjTWF3ZjNhQV93MTRnd3dtZlJTeDdSajBHbGJNTmtwODlxYjd5V3MzX2lzSVlFWHB0MFlVYkdmMDZjNkw3bDBEa1RFemtuRVFlWnpRZ3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Ethereum’s Successful Bull-Flag Breakout: Analyst Eyes Short-Term $4,400 to $4,811 Range - TronWeekly",
        "content": "Ethereum (ETH) is currently undergoing a crucial phase, retesting its previous resistance level, which is now acting as support. This development is widely considered a bullish retest, and if this support holds, it could pave the way for ETH to achieve significantly higher price targets. The cryptocurrency garners considerable attention from several market watchers, who are optimistic about its future performance.\n\nAt the time of writing, Ethereum is priced at $3,716.26, with a 24-hour trading volume of $18.69 billion and a market capitalization of $446.46 billion. Despite a minor 1.77% dip in the last 24 hours, the overall sentiment remains overwhelmingly bullish.\n\nEthereum's Successful Bull-Flag Breakout: Analyst Eyes Short-Term $4,400 to $4,811 Range 5\n\nAnalyst Set Short-term $4,800 Target For Ethereum\n\nJAVON MARKS, a well-respected crypto analyst, recently shared his bullish outlook on Ethereum’s price action. The analyst highlighted a recent bull-flag-like breakout in ETH, which has been confirmed and is holding strong. According to the analyst, this bullish pattern and other positive breakout signals set the stage for a return to the $4,811.90 level.\n\nThe analyst emphasizes that this level is not merely a possibility but an eventual certainty. He predicts that a move of roughly 24% to reach this target is imminent, with the current breakout pattern hinting at Ethereum potentially surpassing $5,000 shortly.\n\nAdding to the bullish sentiment, another prominent crypto analyst, Alex Clay, echoed similar optimism regarding Ethereum’s price action. Analyzing Ethereum on a monthly timeframe, Clay pointed out that ETH has broken through the mid-resistance zone and established a firm footing above it.\n\nThe analyst believes that breaking out of the major supply zone is only a matter of time. Clay views the current price levels as the last opportunity to buy Ethereum before it experiences a significant upward surge. Clay has set ambitious price targets. In the short term, he aims for a price of $4,450. His long-term target is $6,975, and Clay envisions Ethereum reaching a price of $9,500 for the extended long-term.\n\nThese predictions from respected analysts underscore a growing consensus that Ethereum is poised for substantial gains. The combination of bullish technical patterns, strong support levels, and optimistic market sentiment suggests that Ethereum could be on the verge of a major rally.\n\nRelated Reading | Dogwifhat (WIF) Price Analysis: Analysts Eye $6.7 Target Amid Bullish Momentum"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxORUNSbXk4YTlPSzM0MDZET0puMjdNUFdsVTNWdHIyU1BEY1Y0aW50QTJuMDRYVFdKdTZFeXV1cnpDXzhZeUR4czhqRWdmMnlpYmVONW5qTFRiY0hyUGZBZV9ZNUhucjliWUE2YkRDOHZoalV1a19XcXNWcG0tN0RtU0hiSUhlRnl1OW1leUU3LV9JZVJVTUg0Zm1nYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin reveals five ways he’d rebuild Ethereum from scratch - DLNews",
        "content": "Ethereum's architect shares thoughts on smart contracts, EVM, and other features.\n\nButerin says Ethereum developers should have shipped Proof of Stake sooner.\n\nEthereum is going mainstream with advent of ETFs.\n\nWhen 620 weary developers emerged after three days of nonstop coding at this year’s ETHBerlin event last week, few expected Vitalik Buterin to be speaking on stage.\n\nThe co-founder and prime architect of Ethereum was a surprise guest.\n\nWhat was even more surprising were some of his reflections on building the industry’s second-largest blockchain. Buterin described some of the regrets he had about the initial design of Ethereum in detail.\n\nFor many in the audience, his discourse not only evoked the halcyon days of the network’s birth in 2014, but it also helped fill in the road map for what comes next for a cryptocurrency now worth $448 billion.\n\nThe US has just approved a spot Ethereum exchange-traded fund, and BlackRock, the world’s largest asset manager, has launched its own tokenised fund on the blockchain.\n\nThe Ethereum network has spawned a sprawling ecosystem of developers and financial applications worth more than $63 billion, and it has become a byword for decentralised finance.\n\nList of things\n\nStill, Buterin, a 30-year-old Canadian-Russian programmer, said he has a list of things he would have done differently. They range from the development of Ethereum’s Virtual Machine to smart contracts to the Proof of Stake consensus mechanism.\n\nAnd he remarked that even as Ethereum goes more mainstream, it’s still misunderstood.\n\nJoin the community to get our latest stories and updates\n\n“Bitcoin has a simple narrative which is digital gold,” Buterin said. “But like with Ethereum, it’s like ‘Whoa, what the heck is Ethereum?’”\n\nETHBerlin04 in numbers 🧮\n\n\n\n- 802 super humans in total\n\n- 627 hackers\n\n- 83 project submissions\n\n- 56 volunteers\n\n- 40 experience hosts\n\n- 33 judges\n\n- 18 mentors\n\n- 15 core team\n\n- 13 speakers\n\n- 20ish dogs — ETHBerlin04 (@ETHBerlin) May 26, 2024\n\nETHBerlin04 in numbers 🧮\n\n\n\n- 802 super humans in total\n\n- 627 hackers\n\n- 83 project submissions\n\n- 56 volunteers\n\n- 40 experience hosts\n\n- 33 judges\n\n- 18 mentors\n\n- 15 core team\n\n- 13 speakers\n\n- 20ish dogs — ETHBerlin04 (@ETHBerlin) May 26, 2024\n\nSeated on comfy couches on stage with ETHBerlin organisers Afri Schoedon and Franziska Heintel, Buterin opened his chat by sharing his fondest memories of the German capital over the years — hacking in the old office with Ethereum co-founders Gavin Wood and Jeffrey Wilcke, launching Devcon Zero, and celebrating the Merge upgrade in 2022.\n\nThen Schoedon popped the question.\n\n“With everything you know and everything you learned over the last 10 years, how would you build Ethereum differently today if you could start from scratch?” Schoeden asked.\n\nVitalik Buterin (centre) discussed Ethereum's vision, then and now, in a discussion at ETHBerlin. Photocredit: Liam Kelly/DL News.\n\nToo many bits, too early\n\nButerin’s first qualm concerns Ethereum’s Virtual Machine, which is key to making the network function as a kind of decentralised mega crypto computer.\n\nHe explained that Ethereum’s original EVM design used 256-bit processing instead of 64- or 32-bit.\n\nIn computer architecture, the size of computing is measured in bits, with larger bits offering better efficiencies and processing more data. But 256 bits is very inefficient for most operations, and can create a lot of bloat on a blockchain, even for simple tasks.\n\nFor a network in its early days, Ethereum didn’t need to optimise for this.\n\n“The original design was way too overfitted for 256-bit,” Buterin told the audience.\n\nOptimise smart contracts\n\nSecond, Buterin said the early Ethereum developers should have focused on making it easier to write smart contracts with fewer lines of code.\n\nThe reason? Added transparency.\n\nWith fewer lines of code, he said, “people can properly see and check what’s going on inside of them.”\n\nVolunteers and developers playing music at a hackathon in Berlin. Photocredit: ETHBerlin.\n\nSwitch to a ‘crappier’ version of staking\n\nInstead of custom-built computers — called miners — running nonstop to secure a blockchain network, Ethereum switched to a different model.\n\nEthereum’s switch from a Proof of Work consensus mechanism — the way nodes in a blockchain like Bitcoin’s agree on the state of transaction data — to Proof of Stake in 2022 should have happened much earlier, Buterin said.\n\n“When we switched to Proof of Stake, we should have been willing to switch to a somewhat crappier version of Proof of Stake earlier on,” he said. “We ended up wasting a lot of cycles on really trying to make Proof of Stake perfect.”\n\nInstead of miners, Ethereum is now secured by validators who have staked 32 Ethereum, worth roughly $124,000, to do the same thing — and be rewarded for it. If they misbehave by validating fraudulent transactions, for example, they are penalised.\n\nIn sum, the switch swapped out raw, energy-intensive computing power with economic incentives.\n\n“We could have saved a huge amount of trees if we had a much simpler proof-of-stake in 2018,” Buterin said.\n\nIssue logs from day one\n\nFrom big-money token transfers to backdoor honey pots, users can follow the money quite easily in crypto. That’s thanks in part to automatic logging.\n\nBut as the industry advances, notably moving from externally owned accounts like MetaMask to smart wallets like Safe, certain aspects of that crucial logging are lost.\n\nNotably, automatic logs for Ether transfers.\n\n“It should have been in there from the beginning,” Buterin said. “It could have been like 30 minutes of coding from myself, Gav and Jeff. Instead, it’s an EIP.”\n\nEthereum Improvement Proposals are formal proposals made by developers to change certain aspects of the Ethereum network.\n\nEIP-7708, which Buterin submitted on May 17, would make this precise change.\n\nAmeen Soleimani, strategic advisor at 0xbow and co-founder of MolochDAO and Reflexer Finance, discussing the Tornado Cash case. Photocredit: Liam Kelly/DL News.\n\nDrop Keccak\n\nButerin also said he would have used SHA-2 for Ethereum’s hash function rather than the current function called Keccak.\n\nTo understand the difference, one must dig into a bit of cryptography lore, specifically about how SHA-3 became a standard. Remember, before crypto became synonymous with celebrity memecoins and nine-figure initial coin offerings, it was about complicated math.\n\nWhen Ethereum was being built, the hash it used was in a “hash function competition” — yes, that’s a thing.\n\nThe National Institute of Standards and Technology organised the competition to create a new hash standard alongside SHA-2.\n\nPrevious standards had been attacked and debunked. But SHA-2 was unscathed and the NIST simply wanted a safe alternative. After all, variety is the spice of life (and apparently cryptography).\n\nKeccak was just one of several contestants that entered the competition. During the competition, the team made some minor changes to its algorithms, eventually leading to them being crowned the winner. In other words: SHA-3.\n\nThe early Ethereum team had, however, already implemented a non-standardised version of Keccak. Essentially, Ethereum is using a pre-SHA-3 iteration.\n\nCo-founder and CPO of ChainSafe Gregory Markou and founder and CEO of Phylax Systems Odysseas Lamtzidis speaking on stage at ETHBerlin. Photocredit: ETHBerlin\n\nBig whoop, right?\n\nWell, this meant that Ethereum developers needed a custom library — collections of reusable code that needn’t be rewritten from scratch — to accommodate both SHA-3 and Keccak.\n\n“We’re not compatible with other systems using SHA-3,” Marius van der Wijden, a core Ethereum developer, told DL News. “We have to support both algorithms in the EVM.”\n\nIt’s essentially been solved. Today, big libraries support both encryption mechanisms.\n\nSo, yeah, big whoop indeed.\n\n“It doesn’t matter in the grand scheme of things, and current development is definitely not impacted by it,” said van der Wijden.\n\nEthereum’s crack team\n\nDespite the list of minor design misses, Buterin said it’s inevitable for any project to have a few.\n\n“I’m just really happy that I feel like our core devs and their execution capacity feels like it just keeps increasing with each passing year,” he said.\n\n“We’re in a position to effectively and safely correct some of these mistakes.”\n\nLiam Kelly is a DeFi Correspondent at DL News. Got a tip? Email at liam@dlnews.com."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE4wMFI3QkhiRk5MZVNtdlNBWl9qcFlxMV9UYS1rVHRzU3duWFNXR0hjWjc0Nk93Y1FLNUdGWENxUWVvVXJpb3FvMGlQQmJQWU5EVDJhRzNmTE5vSG82Tm95TWtlYkRTU29JVUVlWVhKRXpZalVMVk5QaTN30gF_QVVfeXFMTmpIM3hjWUFkcGpjbHVwd09sVmVwSFBfUmJZSnhjT0w2OXlUalBLVHZXU1Mxem94Y2NVLVhFcWwwWXVtWkVqbGhBbUlydklkQ1dSdHZjXzdqODY4WExYNVFveGdxSkRGTXlzdWNvTEZ2ZzdxbEo0dEdkUHhuS1dxVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Buy Ethereum (ETH) While Dollar Is Cheap: Ryan Sean Adams - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe approval of the Ethereum ETF is a huge step for the market and the industry. We should see a substantial surge of capital inflows into the market, along with the appearance of fresh investors. Some venture capitalists like Ryan Sean Adams believe this is the time to grab some Ether before institutions get in.\n\nAdvertisement\n\nThere is just one question left: Who will be Ethereum's MicroStrategy now that the Ethereum ETF has been approved and the regulatory fog has lifted? MicroStrategy's approach to Bitcoin was to purchase BTC using inexpensive dollar debt from the public market. The share price increases and then repeats the process. Both the price of Bitcoin and the market value of MicroStrategy increased dramatically as a result of this strategy.\n\nThe only question now is who will approach Ethereum in a similar manner. Institutional investors that had previously shied away from Ethereum because of regulatory uncertainty will now have more options, thanks to the Ethereum ETF.\n\nAdvertisement\n\nEthereum's price may rise as a result of this capital inflow just as Bitcoin did when it gained institutional support. With its approval the ETF gives the cryptocurrency market legitimacy and lowers the perceived risk for big investors. This indicates that the market is maturing. This is a crucial time, according to venture capitalists like Ryan Sean Adams. They expect an influx of institutional investors eager to learn more about Ethereum. Purchasing ETH now, ahead of this anticipated surge, might be a wise decision.\n\nLarge-scale investments are expected to drive demand and possibly result in a notable price appreciation changing the dynamics of the market. As with MicroStrategy's Bitcoin strategy, the main tactic would be to purchase ETH with dollar debt from the public market at a low cost."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxONG5obHF2blJXNlNkSXhISjdHaHQ1c2EwSGY4LVoxTUtiRm9sSmFzSmM2d3N1LXc4Zk5pcElCRWJhQmtXZHNObDNUVnpZSU9BTnRnM0xaR081WEtUUERZWmRGT250VS0zcGtlV1FINnQ0WHIwSU5kcGZJQ1ViY1g4NnlQQjJYLTlSbG94Y2tpNHRrVy1DRGg4ZW9QRWpTbkt5SDRtQXl1WGt0LWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Solana — why Ethereum's lesser-known rival is steadily rising - Yahoo Finance UK",
        "content": "Solana claims its blockchain platform offers faster transactions for a fraction of the cost compared with ethereum. (NurPhoto via Getty Images)\n\nSolana has long been heralded as the main contender to knock ether (ETH-USD) from its perch as the world’s pre-eminent network for decentralised finance.\n\nThe Swiss-developed “high-performance, permissionless” blockchain was launched in March 2020, by lead designer Anatoly Yakovenko.\n\nIts sol (SOL) token has soared in value by more than 88% since the beginning of this year, now trading at $168.46 (£132.35). However, this is still significantly lower than the token's all-time-high of $260 (£204.27) on 7 November 2021.\n\nApproximately 63% of sol is staked on the solana blockchain — this limits the supply of the token and has acted as a tailwind on the price. The market capitalisation for the blockchain has grown to over $77bn, ranking fifth in terms of cryptocurrency market cap, just behind Binance's BNB (BNB-USD).\n\nRead more: Ether price rallies on spot-ETF launch speculation as solana surges\n\nThis week, PayPal (PYPL) announced that its stablecoin PYUSD would launch on the solana network, nearly a year after debuting on the ethereum blockchain. PayPal senior vice-president of blockchain, Jose Fernandez da Ponte, praised solana's cost and speed efficiencies, stating: \"Ethereum works well enough, but if you’re interested in retail payments as we are, basically you need at least 1,000 transactions per second and you need transaction costs in the pennies, not in the dollars.\"\n\nThe ability of solana to handle large-scale blockchain movements is key to its value proposition. Solana can average 65,000 transactions per second (TPS). When compared with Ethereum’s 30 TPS, it becomes evident that the Swiss-developed blockchain is a major challenger to Vitalik Buterin’s brainchild, Ethereum.\n\nEthereum founder Vitalik Buterin. (John Phillips via Getty Images)\n\nSolana has many key innovations that could see its native SOL flip Binance's BNB token, which is next in line in the market capitalisation rankings. However, Solana is more decentralised than Binance, with over 1,000 validators, compared to only 21 validators on the BNB smart chain (BSC). The lack of decentralisation on the BSC leaves it vulnerable to manipulation or even a blockchain-wide hack, which in the long-term makes institutional players wary of deploying smart contracts on it.\n\nThus, the real target for solana is ethereum and it is expected to continue munching away at large chunks of ethereum’s market share because of its advanced transaction speed, lower transaction costs and attractive programming language.\n\nEase of use for application development accelerates the wider adoption of a blockchain by users and developers, a key factor in long-term success.\n\nStory continues\n\nRead more: Bitcoin price dips ahead of FTX and Mt Gox bankruptcy payouts\n\nThe developers of the solana blockchain have a mechanism for validating transactions called \"proof of history.\" This involves a cryptographic time-stamping mechanism that speeds up the settlement of on-chain (recorded on the main blockchain) transactions. This fundamental innovation in solana’s blockchain validation method, where every block is time-stamped, allows a multitude of transactions to be processed simultaneously.\n\nThe Solana Foundation’s website states that it maintains “a single global state as the network scales and never deals with fragmented layer two systems or sharded chains.” Thus, it does not need a layer two solution as its main blockchain can settle transactions at high speeds and with a fraction of the costs required on the ethereum network.\n\nRead more: What is a spot bitcoin ETF and why has it sparked a crypto rally?\n\nEthereum must rely on layer two solutions to handle large-scale transactions, as its layer one main network, where monetary settlements are recorded, experiences crippling congestion when a large number of transactions need to be verified. Layer two solutions can handle transactions at high speeds and with a fraction of the usual gas-fees, but are settled 'off-chain.' and then validated on the main blockchain network in a singular bundle at a later time.\n\nYahoo Finance asked Austin Federa, head of communications at Solana Labs, to explain why solana’s transaction speeds are faster than ethereums.\n\nHe said: “Solana is a proof of stake blockchain whose architecture unlocks network speeds and transactional capacity comparable to NASDAQ. It leverages proof of history, a decentralised clock before consensus, to timestamp incoming transactions, allow for faster block finalisation and increased transaction throughput.”\n\nFedera described how solana’s 'proof of history' consensus mechanism has a low energy requirement when compared to the 'proof of work' method used to validate bitcoin settlements. He said that: “Solana's consensus mechanism is greener because it doesn't use energy and it allows for the next generation of optimisations in technology improvements to make these networks much faster and scalable.”\n\nThe programming language that solana is based upon is attractive to developers — a key factor in accelerating the rate of blockchain adoption.\n\nIf many decentralised applications are developed for a blockchain, then the proportion of users who flock to the network will appreciate.\n\nRead more: What are bitcoin runes?\n\nFedera described solana as being “built on Rust, one of the most-loved programming languages by developers. It can be used to create smart contracts on solana using a universal coding language that possesses a powerful toolkit of community resources developed by Google (GOOG), Amazon (AMZN), and Facebook (FB). Combining these tools with Rust’s compiler means developers can use less energy thinking about technical errors and spend more time focusing on smart contract logic, so it’s easier to write safe code for DeFi.”\n\nAnother reason why capital is pouring into Solana is because the platform has exploited the growing interest in non-fungible tokens (NFTs). Purchasing these one-of-a-kind digital artefacts on solana is much cheaper than the gas-fees that must be forked out to buy equivalents on the ethereum network.\n\nThe ethereum network has average gas fees of $16 per transaction. On the solana network, the average gas fee is $0.00025 per transaction.\n\nRead more: Crypto live prices\n\nSome critics of ethereum suggest that Vitalik Buterin’s network is hanging on solely because of its first-mover advantage, which has seen it consolidate the majority of all known DeFi applications (dApps). But there are reasons to hesitate before concluding that solana will supersede its older rival.\n\nLast December, Yakovenko, the co-founder of Solana Labs, took to X.com to shoot down any descriptions of the solana network as an \"ethereum killer.\" He doesn’t “see a future where solana thrives and somehow ether dies.”\n\nHe wrote on X.com: \"Don’t bring back last cycle 'eth killer' bs. It’s lame. Pareto-efficient technologies can have overlapping features and will compete, but that’s all ok. I am such a techno-optimist that I am certain that eventually danksharding will have enough bandwidth for all of solana’s data.\"\n\nAlso, hardware costs to run a solana node could see a diminishing number of validators on the network over time, making it less decentralised and at a higher risk of network weaknesses long-term.\n\n* This story is an updated version of the original article published in November 2021.\n\nWatch: What London Stock Exchange debut of Bitcoin ETNs mean for Europe's crypto market\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOYXpPTHpjSWpKcjc4WE0tUU5MMmhrNlZEQnZxQTRlaTRWT0g0QnUwaDBaT1NZYU0ya2ZZRTR1c3psQXAtd3BEbjJ6SjR2bjJfcjBIU0I2Y0RNR24waDZaUUpMbTBQQzRfWkR1UGlVcUlKOFExNTE2OWd1T3JIR2F3bVFqSm94bGkyVy02bTBvLUc0RGtHaWNoUFY5cmN3dGxwV1ltVE5aSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum’s rollup model comes with risks, Vitalik Buterin warns - DLNews",
        "content": "Ethereum's decision to scale through complementary blockchains has created a diverse community, co-founder Vitalik Buterin writes.\n\nBut developers risk echo chambers or monoculture if they don't work to protect this pluralism.\n\nEthereum’s much-debated “rollup-centric road map” was the right call, but comes with its own set of pitfalls, according to the blockchain’s co-founder, Vitalik Buterin.\n\nEthereum has ambitions of serving as a “world computer” — the rails on which a new set of leaderless, user-owned businesses and organisations will run.\n\nBut the blockchain is slow and expensive.\n\nIn their quest to build a blockchain that can serve billions of users reliably and affordably , Ethereum’s team of developers decided the blockchain should expand through many complementary blockchains rather than through improvements to Ethereum itself.\n\nDoubling down on these complementary blockchain s— called layer 2s or rollups, in crypto-speak — was the right call, Buterin argued in his influential blog last week.\n\n“This is powerful, and enables a lot of creativity and independent innovation,” he wrote.\n\nThe rollup model has created a diverse community that is still united by a shared set of values, he said.\n\n“Layer 2s allow subcultures to emerge that are armed with substantial resources, and a feedback loop that forces them to learn and adapt in order to be effective in the real world,” Buterin wrote.\n\nJoin the community to get our latest stories and updates\n\n“In general, every Ethereum layer 2 has a unique ‘soul’: some combination of Ethereum’s culture, together with its own particular twist.”\n\nBut this happy status quo shouldn’t be taken for granted, he said.\n\nCoordination is difficult, with little incentive for competing layer 2 blockchains to collaborate, according to Buterin.\n\nDanger of “monoculture”\n\nLayer 2 blockchains and their communities could “start acting like separate universes, with little cross-pollination between them,” he wrote.\n\nAlternatively, some layer 2 blockchains might come to dominate, snuffing out Ethereum’s pluralistic ethos for a “monoculture.”\n\n“Whether due to shared human biases or shared economic incentives (or too strong of a unified Ethereum culture), everyone ends up looking in similar places for what applications to build and perhaps even what technical choices to make,” he wrote.\n\nButerin suggested layer 2 blockchains coordinate by subsidising the development of shared infrastructure\n\n“There is a lot of value in trying to expand on these ideas, and keep working to make the best of Ethereum’s unique advantage as a pluralistic ecosystem.”\n\nLayer 2s booming\n\nLayer 2 blockchains have boomed in recent years.\n\nAccording to crypto research site L2BEAT, almost 100 layer 2s are active or in development.\n\nExisting layer 2 blockchains have processed almost twice as many transactions as Ethereum itself over the past year, according to data collected by Jack Gorman, a data scientist at venture capital firm Variant Fund.\n\nAleks Gilbert is a DeFi Correspondent at DL News. Got a tip? Email him at aleks@dlnews.com."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQYkkyM2UyQUZleVFVTmdCS0NPbFE3bUxpeDRsWnlGV1ZEaWFJbERKVG9Eak1VOTJGM3FJT19KLVFXYVlzbzVvTnRvdHZYTlhPUEZBYW5OWUxyRDdsTWNKZ2hEaWFLT010eU1iWTlCNHo4MmJqOE9IdXJFRDN3YnRQLVFGR1IyTEwzQklwZTVnZmV0QW9F?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Why Ethereum Classic’s third ‘halving’ puts pressure on miners’ profits - DLNews",
        "content": "The Ethereum Classic halving has cut token rewards paid to miners by about 20%.\n\nThe automatic reduction means miners are less profitable than they used to be.\n\nEthereum Classic — a 2016 fork from the main Ethereum blockchain — just completed its third halving, reducing the tokens paid out to miners on the network by around 20%.\n\nThe reduction on the $4.4 billion blockchain occurred at block 20,000,001, or 12:00 am London time on May 31.\n\nMiners now earn 2.048 ETC for every successful block they mine, compared to 2.56 ETC previously.\n\nInvestors often see the reduction in a token’s supply as a positive — the token should increase in value if the supply decreases while demand stays the same.\n\nSuch events can be double-edged swords, as they also impact the profitability of miners.\n\n“Mining revenue will decrease if price remains at the same level,” Red Luo, a content manager at crypto mining pool operator F2pool, told DL News.\n\nEthereum Classic’s ETC token trades at around $29.70, down 5.8% over the past week.\n\nEthereum Classic's ETC token falls ahead of the network's third halving.\n\nMiners usually turn off their machines when they are no longer profitable, hurting the network’s decentralisation.\n\nJoin the community to get our latest stories and updates\n\nF2pool runs the biggest Ethereum Classic mining pool, with over 44% of the network’s known hashrate.\n\nCan miners stay profitable?\n\nSome Ethereum Classic miners subsist on thin margins.\n\nWith a 20% reduction in rewards, small miners, or those in areas with more expensive electricity, may stop mining because it’s no longer profitable.\n\nThe reduction could also hurt large miners running older, less-efficient mining machines.\n\nStill, according to Luo, the impact should be minimal.\n\n“We find that most popular machines can operate profitably even after the reward reduction,” Luo said, adding that the reduced rewards should not significantly impact the network’s hashrate.\n\nThe hashrate is the number of hashes — or guesses — per second of all mining machines trying to solve equations and process blocks on a blockchain network.\n\nA higher hashrate means more computing power is required to process transactions.\n\nThis makes that blockchain more secure because it would take more miners — and cost more in energy and time — to attack the network.\n\nHow Ethereum Classic works\n\nEthereum Classic is a Proof of Work blockchain. It split from the main Ethereum network after the DAO hack in 2016.\n\nLike Bitcoin, Ethereum Classic requires miners running powerful computers to solve complex equations, which, when solved, allow them to add blocks of transactions to the blockchain.\n\nIn return, successful miners receive token rewards.\n\nSolving these equations is difficult. Many miners choose to team up in so-called mining pools and split the rewards if one of them solves an equation.\n\nAlthough Ethereum Classic is programmed to reduce token rewards by 20%, many in the community still refer to it as a “halving,” because it resembles Bitcoin’s halvings.\n\nBitcoin halvings cut the rewards paid to miners in half about every four years.\n\nEthereum Classic halvings occur every five million blocks, or about every two years.\n\nTim Craig is a DeFi Correspondent at DL News. Got a tip? Email him at tim@dlnews.com."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBXb1hqZXhocUtXeGdiODZiVlUydFVlTFh3c2lqYXJyVWZOSXdjRVR1YkpqNXJWc1RFTFJibUw5OXIyOFFZLXkzU1lUbGo0RjVxOVVOaVUxNnFQbm9kc0M3ZDJOMC02eUszaE13NDAtTFFFNWxXd1ZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum ETFs still off the table for Vanguard – it's not surprising - Crypto Briefing",
        "content": "Vanguard has a history of avoiding trendy investments but for most options, the firm was right.\n\nShare this article\n\nFor Vanguard, crypto assets like Bitcoin and Ethereum are “more of a speculation than an investment,” and chasing speculative assets will never be the fund’s investment philosophy. No doubt Vanguard constantly says no to Bitcoin exchange-traded funds (ETFs). There is no exception for Ethereum ETFs.\n\nEarlier this month, Vanguard reportedly appointed ex-BlackRock ETF head Salim Ramji as its next CEO. The transition, slated for July, sparked speculation that the fund might be close to revising its stance on crypto-related investment products.\n\nHowever, Ramji made it clear that the fund would not file for a Bitcoin ETF and refused to offer any Bitcoin ETF on its brokerage platform.\n\nThe firm’s view was reiterated after the SEC’s approval of spot Ethereum ETFs in the US. On Wednesday, Vanguard confirmed to the public that no spot Ethereum fund would be available for purchase.\n\nCommenting on Vanguard’s recent statement, Bloomberg ETF analyst Eric Balchunas said Vanguard’s stance could be frustrating, but it would be better to accept it and “move on” because it is not a typical asset manager who seeks to maximize revenue.\n\n“They [are] more like a co-op, and they’ve taken in nearly billion a day for over a decade, and so they [are not] envious of other people’s hit ETFs,” Balchunas stated.\n\nThe expert added that Vanguard could be overprotective when it comes to restricting investors from buying crypto ETFs.\n\n“It seems like they [are] playing Nanny role. Their investors are the smartest money on the planet IMO, they are not easily misled children, they can handle having choices,” Balchunas wrote.\n\nWill history be on Vanguard’s side?\n\nOrganizations each have their own implicit and explicit values and norms. For Vanguard, its products need to meet investors’ long-term needs. The fund prioritizes investor protection even if it means sacrificing short-term gains.\n\nLooking back, avoiding trendy investments was Vanguard’s right decision. In the past, the fund refused to chase “hot” options like government-plus funds, tactical-allocation funds, or internet funds, which all crashed and burned.\n\nIts commitment to a sound investment philosophy pays off in nearly all cases. If it still contributes to the firm’s success, an abrupt shift may not be necessary.\n\nIt remains unknown if Vanguard will change its judgment on Bitcoin in the future. Bitcoin may need to prove itself as a true store of value, like gold, to get a place in the fund’s portfolio.\n\nPerhaps there’s a glimmer of hope there."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPMG9YelFLRDM5S2djTXVBbGcyN1N4cDBXbmtEMG42MzU5eHVvanB6QlNqYU5rZmhoMzk5V1V6b2NmQjJIdnZuUEF0WTBETUl0b1h5aWFuY09nTlRmMzJPNG1xd3NYaUZzLTIyTm1fVkxpVWFuMFp2QkxWdnB2VVEwTmdaN0ZVODdTMTloVTY1TTMtQ241dW9RUlpZV1JzQUM1dGQyMnRWTmllYU5OMjQ1Vlp3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Babylon Raises $70M To Bridge Bitcoin And Ethereum - Benzinga",
        "content": "Babylon, a crypto startup co-founded by Stanford University engineering Professor David Tse, has raised $70 million in its latest funding round.\n\nWhat Happened: The round was led by crypto venture capital firm Paradigm and included investments from Polychain and Bullish Capital, the company announced on Thursday, according to a Bloomberg report.\n\nThis follows an $18 million raise in December from investors such as Hack VC and Framework Ventures.\n\nAlthough Babylon did not disclose its current valuation or investment details, a representative confirmed that the funds will be used to expand staff and further research and development.\n\nThis latest investment highlights a renewed interest in Bitcoin-focused projects among venture capitalists.\n\nTraditionally, Ethereum ETH/USD and other blockchains have been favored for software development, particularly in decentralized finance (DeFi) applications.\n\nHowever, the success of Ordinals, a type of nonfungible token (NFT) on the Bitcoin blockchain, has sparked renewed interest in building within the Bitcoin ecosystem.\n\n\"So Bitcoin is kind of really undergoing a renaissance in the sense that now there's a new wave of projects building on Bitcoin,\" Tse said.\n\n\"Historically, Bitcoin was the first blockchain, but over the years the developer community has shifted away from Bitcoin BTC/USD to new chains…Recently, for multiple reasons, there has been a shift of attention back to Bitcoin.\"\n\nThe increased interest also follows the approval and launch of Bitcoin exchange-traded funds (ETFs) in the U.S. earlier this year, as well as the Bitcoin \"halving\" event in April, which reduced the mining rewards by half.\n\nThese developments have contributed to a growing focus on Bitcoin projects.\n\nAlso Read: Robinhood Unveils Crypto Trading API For Advanced US Users\n\nWhy It Matters: Babylon’s primary aim is to enable Bitcoin to be used as a staking asset to secure other blockchains.\n\nStaking, a mechanism used by proof-of-stake blockchains like Ethereum, involves locking up cryptocurrency deposits to validate transactions and secure the network, earning rewards in return.\n\nBitcoin, traditionally a proof-of-work blockchain, uses miners to solve complex puzzles for transaction validation.\n\nBabylon seeks to allow Bitcoin holders to participate in transaction validation on proof-of-stake networks, thereby earning yields on their idle Bitcoin.\n\n\"You can think of our project as analogous to Ethereum's staking, but for Bitcoin,\" Tse explained.\n\nFor Babylon and its investors, making Bitcoin a staking asset presents a significant opportunity, as many Bitcoin holders have long sought ways to generate yield from their assets.\n\nEthereum’s recent transition to a proof-of-stake model, known as the Merge, has increased the appeal of staking as a revenue-generating activity in the digital asset sector.\n\n\"In our mind, in the crypto Web3, a very important value is security,\" said Tse.\n\n\"So it is this security that drives this underlying decentralized world that we're building. And so what we're trying to advocate is that Bitcoin being such a large asset can sort of underwrite the security layer for essentially the entire Web3 ecosystem.\"\n\nStaking remains one of the most lucrative areas in decentralized finance.\n\nAccording to data tracker DefiLlama, Lido Finance and EigenLayer, two of the top three DeFi projects by total value, fall under the staking category.\n\nUsers have collectively sent over $50 billion in cryptocurrencies to these platforms to generate returns.\n\nWhat’s Next: These developments and their implications for the digital asset market will be key topics at Benzinga’s Future of Digital Assets event on Nov. 19.\n\nRead Next: BlackRock Moves Closer To Launching First Spot Ethereum ETF"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPWS0wa2M5N2tHWmYyUzVjMXZOT2RZVTRMdDJBNG9WeU44elItckJ3T2dUcEc4VHlRaTNUVFgtbWxOZFYwZGVMOHlzcWNPUkRZTEFJN1g1QjA0Q2stVFdycGFtZl96UFRqSEl2WUxpbzZPMkJmTlBzSU9tdU1zQzdwNDg5WTVDN28wakstUjZFQ0FqZE1zZWJSREc4aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Ethereum: Charting The Ascendancy Of The Second-Largest Cryptocurrency - FinanceFeeds",
        "content": "With a market capitalization of 468.42 billion USD, Ethereum (ETH) is the second-largest cryptocurrency network, trailing only Bitcoin. Experts suggest Ethereum is poised to maintain its dominance in the crypto world for years to come. What makes Ethereum stand out, and what has fueled its significant growth recently? This article delves into these questions, guided by the insights of experts at Octa, a globally licensed financial broker.\n\nIn the week ending May 26, Ethereum’s price surged nearly 25%, reaching up to 3,900 USD. The 4,000 USD mark, last crossed in March, seems within reach following the US Securities and Exchange Commission’s approval of spot Ethereum exchange-traded funds (ETFs). Long-term prospects for the Ethereum ecosystem look promising, bolstered by growing adoption across various sectors and a strong developer community. Since becoming the second-largest cryptocurrency in 2018, Ethereum has held this position firmly. But what makes it so resilient in the volatile cryptocurrency market?\n\nA New Era of Blockchain Technology\n\nVitalik Buterin, a visionary entrepreneur, and cryptocurrency enthusiast, conceptualized Ethereum. His interest in blockchain technology began in 2011, and by 2013, he proposed Ethereum as a blockchain platform capable of more than just financial transactions. Ethereum was crowdfunded in 2014, raising over 18 million USD in Bitcoin, and the network launched on July 30, 2015. Unlike Bitcoin, which was designed as a decentralized digital currency, Ethereum aimed to expand blockchain technology’s capabilities.\n\nEthereum supports smart contracts, which are self-executing contracts with terms written into code. This feature allowed users to create new cryptocurrencies on Ethereum using the ERC-20 token standard, enabling a wide range of applications. One notable example is Chainlink (LINK), a decentralized Oracle network that allows Ethereum smart contracts to interact with real-world data.\n\nPractical applications of Ethereum include:\n\nDecentralized Finance (DeFi): Ethereum-based applications aim to replicate traditional financial systems using blockchain technology, offering services like lending, borrowing, decentralized exchanges, and stablecoins.\n\nNon-Fungible Tokens (NFTs): Unique digital assets representing ownership of specific items, often used in digital art and gaming.\n\nDecentralized Applications (dApps): Ethereum supports various applications across industries, including gaming, social media, and digital marketplaces.\n\nIdentity and Authentication: Decentralized identity solutions give users control over their personal data.\n\nEthereum’s versatility and the wide range of applications it supports have driven its adoption and growth. The development of DeFi, NFTs, and dApps on the Ethereum blockchain has created a robust ecosystem that attracts developers, investors, and users alike.\n\nEthereum 2.0: A Leap Forward\n\nOn September 15, 2022, Ethereum transitioned to Ethereum 2.0, introducing several significant improvements:\n\nNew Consensus Mechanism: Ethereum 2.0 switched from proof-of-work (PoW) to proof-of-stake (PoS), which is more secure, energy-efficient, and better suited for scaling.\n\nImproved Scalability: Ethereum 2.0 increased scalability by introducing shard chains, allowing the network to handle thousands of transactions per second.\n\nEnhanced Network Efficiency: Shard chains work alongside a central beacon chain to distribute processing loads, improving overall efficiency.\n\nSustainability: The PoS mechanism reduced energy consumption by approximately 99.95%, making Ethereum more eco-friendly.\n\nDespite these advancements, Ethereum 2.0 faces challenges such as accessibility limitations, potential centralization, and untested security aspects. Interested users must own ETH tokens to become validators, requiring significant investment, which may limit accessibility. Additionally, PoS could lead to centralization if larger nodes dominate the validation process.\n\nAccessibility Limitations\n\nBased on the proof-of-stake consensus mechanism, the Ethereum 2.0 blockchain requires users to own the native cryptocurrency before becoming validators. This means that they must purchase ETH tokens using fiat currency or exchange tokens from cryptocurrency exchanges. To become a validator, users need to raise at least 32 ETH, which translates to about 50,000 USD. This high entry cost is unaffordable for most users, potentially limiting the number of validators and reducing the decentralization of the network.\n\nPotential Centralization\n\nThe PoS mechanism relies on delegates chosen to validate transactions, raising concerns about potential centralization. Larger nodes, with more substantial holdings of ETH, could dominate the validation process, controlling the selection of delegates and preventing smaller nodes from participating. This could lead to a concentration of power among a few influential delegates or validators, undermining the decentralized nature of the Ethereum network.\n\nSecurity Concerns\n\nWhile PoS offers many advantages over PoW, it is still relatively new and untested. The low entry cost for becoming a validator could potentially expose the network to personalized attacks against prominent players, decreasing overall security. As the PoS mechanism matures, it will be crucial to identify and address any emerging security challenges to maintain the integrity of the Ethereum network.\n\nContinuous Innovation\n\nEthereum’s commitment to innovation is not limited to the PoS transition. The network is also exploring layer-2 scaling solutions and other upgrades to enhance its performance and user experience. Layer-2 solutions, such as rollups, aim to increase transaction throughput by processing transactions off-chain and then settling them on the main Ethereum chain. These solutions can significantly reduce transaction fees and improve the scalability of the Ethereum network.\n\nLong-Term Outlook\n\nEthereum’s continuous evolution and commitment to innovation make it an attractive platform for developers and investors. As the network grows and new applications emerge, Ethereum’s relevance and influence in the cryptocurrency space are likely to increase. Some experts predict that Ethereum will surpass its current record peak due to the launch of spot ETF products in the US, potentially triggering significant market movements. Investors trading Ethereum CFDs on platforms like Octa may capitalize on these predicted trends.\n\nOcta: A Global Financial Broker\n\nOcta is an international broker offering online trading services worldwide since 2011. With clients in 180 countries and over 42 million trading accounts, Octa provides commission-free access to financial markets and a variety of services to help clients achieve their investment goals. The company offers free educational webinars, articles, and analytical tools, ensuring that clients have the resources they need to make informed investment decisions.\n\nCharitable and Humanitarian Initiatives\n\nOcta is involved in a comprehensive network of charitable and humanitarian initiatives, including the improvement of educational infrastructure and short-notice relief projects supporting local communities. The company is committed to giving back to society and making a positive impact through its various initiatives.\n\nAwards and Recognition\n\nOcta has won over 60 awards since its foundation, including the ‘Best Online Broker Global 2022’ award from World Business Outlook and the ‘Best Global Broker Asia 2022’ award from International Business Magazine. These accolades reflect Octa’s dedication to providing high-quality services and its commitment to excellence in the financial industry.\n\nEthereum’s impressive ascent in the world of cryptocurrencies is a testament to its innovative approach and robust ecosystem. With its versatile blockchain, support for smart contracts, and continuous evolution, Ethereum is well-positioned to maintain its status as a leading cryptocurrency. The transition to Ethereum 2.0 marks a significant milestone, addressing scalability, efficiency, and sustainability challenges while introducing new opportunities for growth and innovation.\n\nAs Ethereum continues to evolve and adapt to the changing landscape of the cryptocurrency market, it remains an attractive platform for developers, investors, and users. The support from financial brokers like Octa, with their comprehensive services and commitment to education and innovation, further strengthens Ethereum’s position in the market.\n\nFor those interested in exploring the potential of Ethereum and other cryptocurrencies, Octa provides the tools and resources needed to navigate this dynamic and rapidly evolving space. With a focus on accessibility, education, and support, Octa empowers clients to make informed investment decisions and capitalize on the opportunities presented by the cryptocurrency market.\n\nEthereum’s journey from its inception to its current status as the second-largest cryptocurrency is a story of innovation, resilience, and continuous growth. As the network transitions to Ethereum 2.0 and explores new frontiers in blockchain technology, it is poised to shape the future of the cryptocurrency market and drive the next wave of digital transformation."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE85b2pPdmphU29UMVNnVHZZSU1zbGR4Wmhsc2VCMDhoVVZjbXF3Z2NOSk1wSnBSMEpuM29zM0NFbDVSeVJGbEE4VDlsYVBNOEhPeUZEMktHVm15ZnJoVi1TY2hqQ0dXTjBUWXJPRHRsM1Zsc19BX2tjMNIBfkFVX3lxTE5kdVhFaHpTaEJOWWh4WXBlMmdMSUdrY05IWHF6cnQ2T1RNMkg4WXVrLUhuUTBYLU5hSUVRazlSSmVXRGV4OFNzSUpCOHhpVllUVE14aFNVeW4yYW1GX052LTRRQlF4aEU4d1B1WUdRak9zWlhJdy05Z0pXMDhtUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Solana (SOL) Dominates Ethereum (ETH): Glassnode Cofounder - U.Today",
        "content": "According to Glassnode cofounder Yann Allemann, capital rotation within the cryptocurrency market has begun .\n\nAdvertisement\n\nAllemann has noted that Solana (SOL) is currently dominating Ethereum (ETH). His assessment comes after the former gained roughly 10% against the latter since May 27.\n\nThe SOL/ETH pair experienced a significant decline following the approval of several spot Ethereum exchange-traded funds (ETFs) by the U.S. Securities and Exchange Commission (SEC) earlier this month. On May 27, the price of Ethereum peaked at $3,973 on the Bitstamp exchange. However, the excitement surrounding the SEC's much-coveted nod quickly dissipated, with ETH shedding 7% in several days. The SEC is yet to approve S-1 registration statements for these ETFs to go live.\n\nAt the same time, Bitcoin's market dominance has collapsed more than 4% since May 6 after breaching the 56% mark.\n\nAdvertisement\n\nOnce a certain cryptocurrency rallies, it tends to cool off, while traders take profits and place bets on other assets. Capital rotation within cryptocurrencies can also take place internally, meaning that the same cryptocurrency gets acquired at different prices.\n\nDespite its recent weakness, Bitcoin is still neck-and-neck with Ethereum on a year-to-date basis. The two cryptocurrencies are up 77.71% and 79.38%, respectively.\n\nSolana ETF?\n\nAfter Bitcoin and Ethereum have benefited from the ETF hype, analysts are now eyeing other potential cryptocurrency contenders.\n\nAs reported by U.Today , CNBC contributor Brian Kelly has predicted that Solana could end up being the next major digital asset to get its own ETF. This view is also shared by American financier Anthony Scaramucci and British bank Standard Chartered .\n\nAt the same time, the Chicago Mercantile Exchange (CME) recently shut down rumors about potentially launching Solana-based futures."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPcHFJUHRfeEpLanlLYWJNNExReUhqMmRURTkyMzNQMFJ5aEx4MTNOVDBQYk5QaXFEWGRVNmpLSDJwMFowNUlHUXZxRmJkeWZQRzBlVDRDZFYtOUZITVhKOXh1RGtYSmd1RzVOLXdVcXliM2lMZFRFQy1SVVN0bVlVTzV2UdIBiAFBVV95cUxOZk56cm1jeUh3RGRiemFxN3FNbWtFX0d6S1Rxb0lnVzlDaWgxU0tTR2ZxcXVGRzJ5bFVYOHpKZEJkRFdMVG52eXB2bHNWVFBwQ0pVUjg1REVmTkNCamI1bjcwVXRpdnB1UURsMnZCbXN2X3loQktkTXJlRGE5TTZGR1BFakVVdmh5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Break $4,100 as Falling Wedge Pattern Plays Out - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH), the world's second-largest cryptocurrency by market capitalization, is poised for a significant price breakout. Crypto analyst Jelle recently indicated that ETH is continuing to follow the falling wedge pattern, as anticipated. He mentioned that there might be a few more days of fluctuations below the current local highs before the next upward movement. Jelle also suggested that potential ETF news in the coming week could propel ETH beyond $4,100, with all-time highs being a possibility.\n\nAdvertisement\n\nAt the time of writing, Ethereum is trading at $3,725, experiencing a slight dip of 1.76% over the last 24 hours. However, the cryptocurrency has shown impressive resilience, boasting a 21.68% increase over the past 30 days. This bullish sentiment is further fueled by recent regulatory developments in the U.S. concerning Ethereum spot exchange-traded funds (ETFs).\n\nEthereum spot ETFs\n\nLast week, the U.S. Securities and Exchange Commission (SEC) approved applications for Ethereum spot ETFs, a landmark decision that could have significant implications for the cryptocurrency market. Analysts suggest that these ETFs could be launched by late June, following crucial updates from major financial entities.\n\nOn May 29, BlackRock, the world's largest asset manager, updated its Form S-1 for the iShares Ethereum Trust (ETHA) with the SEC. This update came nearly a week after the regulator approved its 19b-4 filing, both of which are necessary for the ETF to commence trading. This move has been seen as a positive indicator by market observers and analysts alike.\n\nAdvertisement\n\nBloomberg ETF analyst Eric Balchunas commented on this development in a May 29 X post, stating that this was a good sign. Balchunas elaborated that there would likely be another round to fine tune the SEC comments but maintained that the end of June launch is a legit possibility. He noted that while the approval odds around July 4 are more realistic, earlier approval would be a long shot.\n\nGood sign. Prob see rest roll in soon. Then prob one more round of fine-tune comments from Staff. End of June launch a legit possibility altho keeping my o/u date as July 4th https://t.co/WymshkTvat — Eric Balchunas (@EricBalchunas) May 29, 2024"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNblNpQ01sYnlBbWVLT1F3bjRmeWd0d1dmWVBQSGtucnlIQ2JSeGxqQi1tQ0QxeklZZVBQRnZwbl9ad0VibkYwY0ZONTNNZ3p1T25JbUdnMHhMZnN0aWh1TU5Vcm1CbmpLY0tQWWpSS1NfWFVrXzVDMl9LdTZ1TWNIMTRxM2lSV1pHUHA0dUliZWpzSy1uZVBIVElUSdIBowFBVV95cUxORXVQNC1sX2s0cWdSb0NOYzFreUxveDcyNVBVQlVva1ZqcjI5QUg4aHVoU1lMQVgyb0ZjVEdBSHRJWWJPQm4xUF9ENDRHbzV0aFdORldJdXE1TUFXcWpobEJGS2E5SHdteXBHNzBMSElGcWpjTGIxVkdSbDlMMlRFSl9WTUM1TnVNcE1RNjNFcUNTUGdlYmV3TC1XVVVBaE54V1JN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Bitcoin Startup Babylon Raises $70 Million to Bring BTC Staking to Ethereum and Solana - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA crypto startup seeking to use Bitcoin for native staking on other blockchain networks has secured $70 million in fresh funding to fuel its ambitious goals.\n\nBabylon, which is aiming to do something never accomplished before, secured the cash from lead investor Paradigm, a prominent crypto venture capital firm. Other contributions came from Bullish Capital and Polychain Capital.\n\nThe startup wants to use Bitcoin, the biggest cryptocurrency by market cap, as a resource for staking. Previously, the firm told Decrypt that it’s building infrastructure to use Bitcoin staking to validate nodes on networks such as Ethereum and Solana.\n\n“This funding will accelerate our mission to make Bitcoin the security backbone of proof-of-stake systems,” Babylon founder David Tse said in a statement. “Our team is dedicated to advancing the utility of Bitcoin beyond its traditional roles and enhancing the security of the entire blockchain ecosystem.”\n\nAD\n\nAD\n\nCurrently, Bitcoin runs on a very different system to staking protocols because it uses a system called proof-of-work.\n\nProof-of-work requires lots of computing power—in the form of miners—to process transactions. It’s an expensive and energy intensive process.\n\nBut with proof-of-stake, anyone can participate by “locking up” their assets to power a crypto network. Staking networks include the likes of Ethereum, Solana, and Cardano.\n\nBabylon wants those holding Bitcoin to be able to earn a yield by pledging their coins to staking networks. It’s a bold challenge, but the startup—led by a Stanford professor and a former Dolby engineer—says it has found a way. Last year, it raised $18 million from investors.\n\nAD\n\nAD\n\nIf it does achieve what it wants, those sitting on satoshis (aka the smallest denomination of Bitcoin) will soon be able to earn yield.\n\n“Babylon will be the catalyst that redefines the utility of BTC and paves the way for a new era of Bitcoin-native applications,” said Luke Pearson, General Partner at Polychain Capital, in a release.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNWl9SVC0tcG5yT2Z2cV9GYkhKNzJKeWhBQ05xZ2ZETG5jY1VXUVhoODBLNTVnQ3RyazBhUFRueDlmV0FBV1pFN0hhdlMzaEg1R1hvZzB1RkJwQ2VBV3FYUWtfUFNxR0JQekl2SVc3dTFJbWFMczR4c2pHeFkwX040RjVSdkZ1Nmc0X2duUG1aaWYxUTVSdDBTRzlya1p1UnJtRW5LMXNnc2pUSVRTc05tdGh6OUJVZTFEXzhJcW1KdnJUVlQ4TWc1WWZnR1licGNPazFHMFlRSGVRVVHSAeABQVVfeXFMTVMzdFJJVThVdDlRY1FsZGxEVkJ6emZ3N3NLQUthbTBJQUoxbTB5TFRLbkR0UTR0a1d2X01NWWhDbEZJOEl1b1FfWXhWdkNONzhqdDhIaDNjeHJMY0NIRUNCUDV1SDFZdHA1eDZ5LTh1eDJnVzgxb3hsanhUcEcyNlRpbVd2MDVOOFJMczE3SHBubTctNk9KamhRM1dXSmJmU2FzYnVOUm9RNml4SWdZUjNQTzJHVEtnNVQ0TkhUWF9kaE9kckxTWGZJcE9zdklLWndjX3JxM0NvSG1SbVJZUVI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "This Low-Cap Ethereum-Based Altcoin Is Primed To Explode 150% Over the Coming Months, Says Michaël van de Poppe - The Daily Hodl",
        "content": "A widely followed crypto analyst is suddenly turning bullish on one low-cap Ethereum (ETH)-based altcoin project.\n\nCrypto strategist Michaël van de Poppe tells his 719,400 followers on the social media platform X that Skale Network (SKL), an Ethereum sidechain, could soar 150% from its current value.\n\n“SKL is looking great. Did reject at the first resistance zone, but is on edge of a significant breakout. This breakout is likely heading to $0.20 in the coming months.”\n\nLooking at his chart, the trader is predicting SKL will soon flip the key resistance level of $0.09 into support.\n\nHe also uses Fibonacci extensions to predict the massive breakout price target of $0.20. Fibonacci extensions are used in technical analysis to estimate profit targets and price pullbacks. They are based on Fibonacci ratios.\n\nSKL is trading for $0.080 at time of writing, down nearly 5% in the last 24 hours.\n\nThe Skale Network aims to create a gas-less Ethereum Virtual Machine (EVM)-compatible blockchain for Ethereum scaling. Instead of charging end users transaction fees, SKALE generates fees by charging developers a fee for operating a SKALE chain.\n\nAccording to the project developers, the Skale Network reached 10 million unique active wallets (UAWs) in Q1 2024 and saved users over $3.8 Billion in gas fees.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Yuliia Skliarenko/Fotomay"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPZEpyQ3hLR013bjlJYzQ3QXlrN1prd3VhQVE1VjFtNHNGS1pFdUIyRFRIUzJMRTJRcUxOcElXTzJmS3A1dHh2RnE1cUkwU0ZtbGl3eGZhelhzQ085bWlMdExXYkJiV09QQnhjS1ZVbDNqbEtzQ2ZDMU91czZQNTROWk56MXNDZktJR0xuUHRIRnRHU2NjYlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval is a game changer, believe experts - Economy Middle East",
        "content": "It could be a paradigm shift, not just for Ethereum, but cryptos in general\n\nIndustry insiders believe the approval of Ethereum ETFs could see a slew of othger crypto-based ETFs\n\nLate last week, the US Securities and Exchange Commission (SEC) cleared the way for the approval of spot Ethereum ETFs.\n\nThe SEC approved 19b-4 forms for the ETFs from BlackRock, Fidelity, Grayscale, Bitwise, VanEck, Ark, Invesco Galaxy and Franklin Templeton.\n\nThe approval takes Ethereum-based ETFs one step closer to reality. Once available, traditional investors will be able to buy shares that track the price of the second-biggest cryptocurrency.\n\n“Ethereum (ETH) is currently in the spotlight as the SEC asked applicants for the ETH ETF to update their filings this week, increasing the odds of approval,” says Hao Yang, head of financial products at crypto exchange Bybit. “Although ETH has faced challenges in recent months, this move suggests a potential turnaround for the second-largest cryptocurrency.”\n\nThe surprise approval is sort of a volte-face at the SEC. In fact, virtually everyone was expecting the SEC to decline the applications.\n\n“The green light for Ethereum ETFs is a landmark decision that highlights Ethereum’s status as a non-security,” says Zina Ashour, founder, Women in Crypto Arabia.\n\nRead | Cryptocurrency market set to surpass $5 trillion in 2024: Ripple CEO\n\nShe explains that this distinction is pivotal “as it exempts Ethereum from the strict regulations that govern traditional securities, thereby broadening the avenues for both institutional and retail investment”.\n\nBroader impact\n\nAshour believes the SEC’s move could set a precedent for the classification and regulation of other cryptocurrencies in the future.\n\n“The SEC’s endorsement of Ethereum ETFs marks a significant turning point not only for Ethereum but also for the wider cryptosphere,” says Ashour.\n\nShe argues the approval will drive the entry of institutional investment into Ethereum. The Ethereum ETFs, Ashour explains, will take away the complexity of directly purchasing and storing the crypto. Secondly, they’ll also offer a regulated and familiar path for investors to buy the crypto. This leads Ashour to believe that Ethereum ETFs could potentially have a positive impact on Ethereum’s price.\n\n“Moreover, the Ethereum ETFs could amplify market liquidity by drawing in more participants,” says Ashour. “Enhanced liquidity could stabilize prices and temper volatility, rendering Ethereum a more attractive investment proposition.”\n\nShe also points out that there are over 20,000 altcoins in Ethereum’s ecosystem. “The approval of Ethereum ETFs could indirectly influence these altcoins, potentially sparking increased interest and investment in them,” argues Ashour.\n\nOpen the floodgates\n\nSECs approval of the Ethereum ETF forms follows approval of spot Bitcoin ETFs back in January. These spot Bitcoin ETFs now collectively hold more than 1 million Bitcoin, worth over $70 billion.\n\nRead | Bitcoin ETFs approval: A game-changer for cryptocurrency market\n\nAs the news of the approval made its way into the markets, the price of Bitcoin and Ethereum actually dropped. Experts believe this was the classic case of traders selling the news after buying the rumor, earlier in the week.\n\nWhile the price of both cryptos has gone up since, Yang believes the prices will continue to fluctuate until the ETF decision is finalized.\n\nInterestingly, market analysts believe the approval of Ethereum ETFs could open the door to more crypto-based ETFs. In a note last Friday, Geoffrey Kendrick, Standard Chartered’s head of crypto research and emerging market foreign currencies, speculated that Solana and XRP might soon get their own ETFs.\n\nChanging political winds\n\nThe SEC approval of the Ethereum ETFs is just the first step of a long-winded process. Experts estimate that could take weeks, or even months, before the actual ETFs land on the trading floor.\n\nThe Ethereum ETF approval is being hailed as a symbolic victory for crypto. Looking at the bigger picture, many believe SEC’s change of heart has everything to do with politics in the US.\n\nRead | Economy Middle East Guide: Regulated crypto exchanges\n\n“The broader political landscape also favors a friendlier regulatory environment for crypto, driven by younger voters’ preferences, which could lead to improved crypto-government relations,” says Yang.\n\nA recent survey by Harris Poll bodes well for crypto going forward. It finds that a third (33 percent) of US voters will evaluate a candidate’s position on crypto before voting. An overwhelming majority (77 percent) think a U.S. presidential candidate should know crypto.\n\nReportedly, even Ethereum co-founder Joe Lubin believes the approval of the Ethereum ETFs, and the crypto-friendly political environment in the US is a “game changer”.\n\nFor more technology news, click here."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE51SUJiS181QmxQWWV5VWg5NXRWY1l2bE5VWklOVU9fYnJtTWR0Z25wMnItNW04SmxOeGVCQXRxUHV5RWE3MnlNRnI0OHNMRTNaRFMyWkFJb1phTFhYQ3ZYdlVwMUVkNkdvTzZtZm9jenZPOGFK?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Why Bitcoin (BTC)'s $1.3T Market Cap and Ethereum (ETH)'s Innovations Make Furrever Token a Must-Watch - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, May 31, 2024 (GLOBE NEWSWIRE) -- The cryptocurrency market is in a dynamic phase, with Bitcoin and Ethereum at the forefront of innovation and growth. Bitcoin's market cap has surged to an impressive $1.3 trillion, reinforcing its status as the digital gold standard. Ethereum, meanwhile, continues to drive blockchain advancements with its robust smart contract capabilities and the upcoming Ethereum 2.0 upgrade aimed at improving scalability and reducing transaction costs. Amidst these giants, Furrever Token (FURR) is carving out its own niche, offering unique appeal and significant growth potential.\n\nBitcoin's $1.3T Market Cap: The Digital Gold Standard\n\nBitcoin, the first and most prominent cryptocurrency, has reached a market cap of $1.3 trillion, nearing the value of silver. This milestone reinforces Bitcoin's position as a digital store of value, often likened to gold. Bitcoin's growth is driven by increasing institutional investment, mainstream adoption, and its finite supply of 21 million coins. Its decentralized nature and robust security through proof-of-work consensus make it a reliable asset. As more companies and financial institutions integrate Bitcoin, its influence on the broader cryptocurrency market grows, driving interest and investment in alternative cryptocurrencies.\n\nEthereum's Innovations: The Backbone of Decentralized Finance\n\nEthereum remains a cornerstone of the crypto ecosystem due to its versatile blockchain, which supports a myriad of decentralized applications (dApps) and smart contracts. The recent statements from Vanguard, a $7 trillion company, highlight Ethereum's potential and limitations. Although Vanguard has no immediate plans to support Ethereum ETFs, the blockchain's ongoing upgrades aim to address scalability issues and enhance transaction efficiency. The upcoming Ethereum 2.0 upgrade, transitioning from Proof of Work (PoW) to Proof of Stake (PoS), is expected to significantly improve transaction speeds and reduce fees. This evolution is crucial as Ethereum powers a substantial portion of the DeFi (Decentralized Finance) space, making it indispensable for developers and investors alike.\n\n\n\n\n\nFurrever Token: A Unique and Promising Contender\n\nAmidst the well-established Bitcoin and Ethereum, Furrever Token (FURR) is emerging as a unique player with its charming and engaging approach. Designed to bring a refreshing dose of cuteness and community engagement to the crypto space, Furrever Token stands out with its whimsical approach. The token integrates adorable cat-themed stickers, emojis, and visuals, fostering a warm and friendly community.\n\nStrategic Tokenomics and Growth Potential\n\nFurrever Token's tokenomics are structured to ensure long-term growth. With 9 billion tokens in total, 65% are allocated for presale, 25% for decentralized exchanges (DEXs), and 10% for the team, which will be locked for a year. This strategic allocation aims to provide liquidity while ensuring the team is committed to the project's longevity.\n\nThe presale has already raised over $1.1 million, and with the current price at $0.000648, there is an expectancy of up to 15X returns for early investors. The upcoming launch on PancakeSwap is generating significant excitement and FOMO (Fear of Missing Out), making Furrever Token an attractive investment opportunity.\n\nWhy Furrever Token is a Must-Watch\n\nUnique Appeal: Furrever Token's whimsical approach with cat-themed visuals and community engagement stands out in the crypto market. Strong Community: A growing and active community on platforms like Telegram ensures continuous engagement and organic growth. Significant Growth Potential: With a presale price of $0.000648 and potential for substantial returns, Furrever Token offers an enticing opportunity for investors. Upcoming Launch: The planned launch on PancakeSwap and future exclusive content create a sense of anticipation and excitement.\n\nConclusion\n\nBitcoin's impressive market cap and Ethereum's ongoing innovations underscore the dynamism of the cryptocurrency market. Amid these developments, Furrever Token presents a unique and promising investment opportunity. Its engaging approach, robust community, and potential for high returns make it a must-watch for investors looking to diversify their portfolios. As Bitcoin continues to dominate and Ethereum drives innovation, Furrever Token offers a delightful and potentially lucrative alternative. Visit furrevertoken.com to learn more and invest today.\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nVisit Furrever Token Presale\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support(at)furrevertoken.com\n\n\n\n"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNd3dCZVlRMnA2NFNjSExyTkdldzlWbkRVLUpTck1xVkplckFlWWphVUY3cVpIWjFUbG5QY0ZTcDFvemo3YTRBc1pIdjU5VkRwdTFjOHhZZDhLNzVrMkIzSGdtdlE5bFhZVGtOTXpiQ1RydUhYNHkyYlM2YVBWbVEtNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum Whale Stakes $580M ETH In One Epic Move - TronWeekly",
        "content": "Ethereum whales have once again reinforced their faith in the smart contract network. Onchain data revealed that over half a billion dollars worth of ETH was staked in a single transaction. Etherscan captured the transaction worth a whopping 146 ETH, valued at over $580 million. This is likely the record for the most amount of ETH staked in a single transaction, one market observer noted.\n\nThis colossal move is a testament to the growing trust and interest in Ethereum’s staking mechanism, especially as the upcoming Ethereum 2.0 upgrade is on the horizon.\n\nEthereum Whale Stakes $580M ETH in One Epic Move 3\n\nMoreover, whales, individuals, or entities that hold large amounts of cryptocurrency have been the key players, as their significant stakes highlight the evolving landscape of decentralized finance [DeFi] and the increasing role of Ethereum as a foundational layer for various DeFi applications.\n\nDigging deeper, the amount of 146,110 ETH was staked via Lido, as revealed by the Lido DAO Bot on social media. The whale’s contribution through Lido not only boosts the total value locked [TVL] in the platform but also highlights the growing trend of using liquid staking solutions to maximize returns while retaining flexibility.\n\nIn a decentralized staking solution such as Lido, users can earn staking rewards while maintaining the liquidity of their assets through stETH, a tokenized form of staked ETH. This dual benefit is that it attracts whales, entities, or individuals with substantial holdings, to contribute large amounts to the staking pool.\n\nEthereum Fork In Q1 2025\n\nAs reported by TronWeekly, core developers announced their plan to implement the Pectra upgrade by the first quarter of 2025. This decision emerged from a recent execution layer meeting, marking Pectra as the next pivotal advancement for ETH, following the successful Dencun upgrade of March 2023.\n\nPectra is slated to bring several critical enhancements, led by the integration of the Ethereum Virtual Machine Object Format [EOF]. The EOF will bring forth approximately 11 improvement proposals aimed at refining the ETH Virtual Machine [EVM] code on both Layer 1 and Layer 2 levels. These enhancements are expected to optimize the efficiency and functionality of the EVM, which is the backbone of ETH’s smart contract operations."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPNjZYTU0zVjA0OVFOWFF3Z0d6LUktc1VSQ0o5bndjYUw5eWxPTGZGTGplWkVrUWYxY0Nad1F5OFFRV1cxRW1mUnhoTDhGZlRrcHpVOWEtV0ZQVWJZMWdGUXdvU2prNTdFbkdIRFViWkkzT1BsajRlREgwdWxaU3ZQSUh3R0VvZklDQ0VNRklVU1g4S3M0OXM3UDZkaXlDVHJXODFNbEN30gGrAUFVX3lxTE5OcU9GWlVxWDFIekpWdkQyQy1INkxKek11QjI1MHVnTERWeU1nMDFJdl9tejRiRENmdjgxbWcteEIyLUM4ek9xM3kwWV9rejJkVmlzMF9ncG1BUnZxQ1Q2OVYzd1daSmlERFVPMmxhUmFMeVB2cExuTnU2bXM5VzBwTkZxNjZPNmx6alJza20yY2lla3kxVXRDZ0xZSm04TWk3Rmd1N2ZEMkRrYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Here’s When BlackRock’s Spot Ethereum ETF Could Launch After Updated S-1 Filing - CryptoPotato",
        "content": "BlackRock has submitted a revised registration statement for its proposed spot Ethereum ETF. The updated S-1 filing also included details about the company’s seed capital investor.\n\nNow, analysts suggest that U.S. spot Ether exchange-traded funds (ETFs) could launch by late June.\n\nBlackRock Reveals Seed Capital Investor Information\n\nThe world’s largest asset manager submitted an amended S-1 registration statement nearly a week after the U.S. Securities and Exchange Commission (SEC) approved 19b-4 forms for eight Ethereum ETFs, including its proposed iShares Ethereum Trust. Both filings need approval before the ETF can begin trading.\n\nIn the updated one, BlackRock disclosed information about its seed capital investor, who committed to acquiring $10 million worth of shares on May 21, 2024. The investor ultimately received 400,000 shares priced at $25.00 each. The asset manager also said the shares will be listed and traded under the ticker symbol “ETHA.”\n\nEric Balchunas offered insights on the development, expressing optimism about its significance. He anticipated others to follow soon, likely accompanied by another round of fine-tuned comments from Staff. While Balchunas suggested an end-of-June launch as feasible, he emphasized higher approval odds around July 4, regarding an earlier approval as a “long shot.”\n\nGood sign. Prob see rest roll in soon. Then prob one more round of fine-tune comments from Staff. End of June launch a legit possibility altho keeping my o/u date as July 4th https://t.co/WymshkTvat — Eric Balchunas (@EricBalchunas) May 29, 2024\n\nBloomberg ETF analyst James Seyffart remarked that BlackRock’s updated S-1 is “almost certainly the engagement we were looking for on the S-1s following the 19b-4 approvals. Issuers and SEC are working towards spot Ethereum ETF launches.”\n\nHashdex Withdraws Spot Ethereum ETF proposal\n\nThis development comes the same day as a filing showing Hashdex recently withdrew its proposal for a spot Ether ETF, a day after its competitors, including BlackRock and seven other issuers, received approval for it.\n\nNo information has been provided regarding the reasons for Hashdex’s decision or whether it plans to resubmit its proposal. According to its initial September 2023 filing, Hashdex’s proposal for a spot Ethereum ETF combined spot Ether holdings with Ether futures contracts within the same product to reduce potential manipulation risks.\n\nHashdex also aimed for its spot Ether ETF to reflect daily changes in the Nasdaq Ether Reference Price to address regulatory concerns about market manipulation.\n\nCompetitors like Fidelity, ARK 21Shares, and Franklin Templeton have focused solely on spot-based Ether ETFs, making late amendments such as removing support for ETH staking in response to SEC feedback."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxNZXdjcUZiWUtBZFJIQ1p4b0FfdGZaeFl1Y09lU2V2Z21rS3I0WkxRQlcyTE4zQ09VTGNDa3hPaVNyUS12WWpsTmRIem5ESmpDS0xtUW4yU3VLYjIwYUpSajlNRHFMU3NUQ0JONU1UZDR4Ym8xdlh3S0kyeHJHOVdRNXJtTkFHYkZlemk0RzVWVUFUOURqS25vMnJTXzk5cUxCdlBoVFlQSDZEUEw1bnRjdXJ6VE1nd0gtTE1aNlJjSjlPRzZpLVYxSDBsMWQxYkFSVlJKRVVuNDFtMDVSdmxZWjJ1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Ethereum Under Siege: Most Attacked Blockchain In 2024 Suffers 43% Of May's Crypto Losses - Benzinga",
        "content": "Ethereum ETH/USD was the most targeted blockchain by hackers and fraudsters in May, constituting nearly 43% of the total losses.\n\nWhat Happened: The world's largest network for decentralized apps and services suffered the most individual attacks, totaling 9, in the month, according to a report released by Web3 security firm Immunefi.\n\nThe second on the list was BNB Chain BNB/USD with 4 incidents. Together, Ethereum and BNB Chain accounted for a massive 62% of the total losses across major chains.\n\nAmong the most sensational of Ethereum losses was the $21 million exploit on the Web3 game Gala Games GALA/USD.\n\nOverall, total cryptocurrency losses to hacks and rug pulls dropped 20% this year compared with the same period in 2023. Additionally, losses in May declined 28% month-over-month.\n\nWhy It Matters: Ethereum was the most targeted chain last month, and also during the first quarter.\n\nWith a vast array of decentralized finance projects, the network has been vulnerable to attacks from bad actors. It is the largest DeFi chain, with upwards of $64 billion in deposits as of this writing, according to DeFiLlama.\n\nThe Immunefi report specifically underlined that DeFi projects were the main target of exploiters, representing 100% of all the losses.\n\nPrice Action: At the time of writing, ETH was trading at $3,743.49, marginally down 0.38% in the last 24 hours, according to data from Benzinga Pro.\n\nRead Next: Ripple CEO Brad Garlinghouse Foresees XRP, Solana, Cardano ETFs Amid Bitcoin, Ethereum Approvals\n\nPhoto by DrawKit Illustrations on Unsplash"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQYVNRN2VVM0hlb3NrQ3N4UHh0cXRSU0FJaE5vV1hMSmtLTmFIOENSUkN0eW1tX2I2S2xnVXkyQU1aUXBYQXNPZE1kRS1XbGRvai1hSkY0LXlDMXgyRnYwYmZ0SjhZVUJvRGxuWHVBaDZoaGVIN1ItQ0JQRHhnVURkNDl3dnkzYmU0Zi1YZm9PUHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "BlackRock buys $10 million of Ethereum to launch its ETF - Cointribune EN",
        "content": "Fri 31 May 2024 ▪ 3 min read ▪ by Ariela R.\n\nAs the cryptocurrency market continues to boom, major asset managers are taking a closer look and capitalizing on the situation. Asset management giant BlackRock stands out by launching an Ethereum ETF.\n\nImminent Launch of BlackRock’s Ethereum ETF?\n\nAfter receiving regulatory approval for its Bitcoin ETF earlier this year, BlackRock is now preparing to launch its Ethereum ETF. The filing with the SEC reveals that the manager has already invested $10 million in the initial purchase of Ether.\n\nThis initial investment of 400,000 shares at $25 each sets the net asset value of the Ethereum ETF at $10 million. The fund will trade under the ticker ETHA, with :\n\nthe Bank of New York Mellon as the trustee custodian,\n\nCoinbase holding the underlying Ether.\n\nBloomberg analyst Eric Balchunas estimates that the launch could take place as early as the end of June. He bases this on the update of the S-1 filing submitted by BlackRock.\n\nThe Phenomenal Success of BlackRock’s Bitcoin ETF\n\nThis upcoming launch of the Ethereum ETF follows the success of BlackRock’s Bitcoin ETF. After only a few months of trading, this exchange-traded fund has reached nearly $20 billion in assets under management. It has become the largest Bitcoin fund in the world.\n\nSince its launch in January, BlackRock’s Bitcoin ETF has accumulated over $16 billion in net inflows. Major state pension funds have also invested in this product—a situation that highlights institutional interest in cryptocurrencies!\n\nThe success of BlackRock’s ETFs and the recent approval by the SEC of multiple Ethereum ETFs illustrate the gradual adoption of cryptocurrencies by traditional finance. This trend is expected to continue as institutional investors and regulators’ confidence strengthens.\n\nMore and more asset managers are looking to offer their clients exposure to digital assets such as Bitcoin and Ethereum ETFs. With its flagship products, BlackRock is positioning itself as a leader in this emerging asset class.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQWXA3eXc0Z2xTLURYLVJGc2dPTC1SdVNNd1c1cUk1TzZhR3VaRkpHMEhaS05XQkJrT1J0a0tXM2J3LW93VzRDYkdtcjZ1R3pfeWFZWDFXN3puN05kdy1HTERDOF9QZnh0S0s0dkVwclpCNWV3SHlNd1Z1T05UXzdqdHl3T1ZXWE9Eb2VhLUd3UnTSAZgBQVVfeXFMTlUxc3FSNERoVjRrWnI2LU5acFBPYnhwakRNZXF0ekUzdkpYNXdsVkg2MU5oV3VkbDhoZ21VRGJub194ZjNfWldqcWVXcmhsejdnUnFoaW5HdmxvTVN4a3pNRmpld2NPV25UTUs4N29BLVJSUkN5ZDYtcUh2NFhiQXFWdUtmM3JZVEJQYWxtQzZvU3FOTU1IQjE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Caitlyn Jenner Solana Meme Coin Crashes After Launching Ethereum Token to Support Trump - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCaitlyn Jenner’s recently launched Solana meme coin has dived 66% in price over the past 24 hours after the former Olympian announced a new token on Ethereum—this time with the goal of donating a share of fees to support Donald Trump’s presidential campaign efforts.\n\nEarlier this week, media personality Jenner announced her Solana meme coin JENNER, with many crypto observers initially assuming that her account had been hacked. But that wasn’t the case, and she was actually behind the project in tandem with crypto promoter Sahil Arora. Jenner claims that she didn’t have custody of any of the tokens and that Arora owes her “lots of money” after he went “radio silent.”\n\nJENNER spiked in value and led to a growing wave of celebrity-backed meme coins, including from rapper Iggy Azalea and musician Davido, but Jenner's own token took a dive on Wednesday after she tried to expand upon that initial success.\n\nLate Wednesday, the decathlon gold medal winner launched a new version of the JENNER token on Ethereum, but with some tweaks to the formula. Investors apparently didn’t like this move, with the Solana token's price dropping 58% in the two hours that followed the announcement, and now 66% over the past 24 hours.\n\nAD\n\nAD\n\n$Jenner on $ETH\n\nNO team tokens.\n\nNO Dev tokens.\n\nNO founder tokens.\n\nOfficial contract address here: 0x482702745260Ffd69FC19943f70cFFE2caCd70e9 pic.twitter.com/fwXW4Cb2gS — Caitlyn Jenner (@Caitlyn_Jenner) May 30, 2024\n\nArora, who has since launched other celeb-themed tokens, confirmed to Decrypt that he had no part to play in this new token. “She’s a greedy granny,” he said via Telegram DMs.\n\nAn hour later, Jenner took to Twitter Spaces to announce that her new coin has a 3% tax applied to all transactions which, once a $50 million market cap is achieved, will be donated to support Donald Trump’s presidential campaign via a Super PAC.\n\nWhen $Jenner on $ETH hits $50m market cap we will donate to @realDonaldTrump from the tax revenues! We have to protect crypto! It’s ULTRA MAGA! — Caitlyn Jenner (@Caitlyn_Jenner) May 30, 2024\n\nAD\n\nAD\n\nHer previous Solana token peaked at a $42 million market cap, according to DEX Screener, amid the industry-wide confusion that followed its launch. However, her new Ethereum project topped out at a $4.75 million market cap a few hours after it launched, according to DEX Screener. Now, less than 24 hours later, the token is sitting at a $2.4 million market cap—far off its $50 million Trump inspired goal.\n\nJenner has also slowed down tweeting since the heyday of her Pump.fun token. And when she does post, she’s often met with criticism and abuse, now that the Solana version of JENNER has plunged 81% since its Tuesday peak.\n\n\"Give Solana the love back!” one Twitter user replied.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9KVTNvVUl4Tk1MYVR5SHoyQUZHNDdBaE9wVl9JdW1lQjhTbGlsU2VKZDF5T21QeDY0OS1FSTlERTJWb21YUjB4U3VaTzZ0T2F2ejlDdWY4OTdIbGlTaVp2bXZsdklfYWZCUU9YSW9ncTYtT3lQUG5Lc9IBgAFBVV95cUxOZHR3Zkl6R1FMekJfdjRsa0JpWjVqMU9aNkQycGRiMlpHeW8ybEN0b0NCZ0NpaFMtTVhUWUtGWVlRemRfQmJLa3pqU2p0TDNpSzhBbE9qMXpmZEE2RGxtWjhDbWlUSFBtOWxSTWxxR3FPdlVWNThoeDJuQ0NHV0tLaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Franklin Templeton Reveals Ethereum ETF Fee - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFranklin Templeton has become the first asset manager to reveal the management fee on their proposed Ether spot ETF—and it's virtually non-existent.\n\nPer an updated S-1 filing with the Securities and Exchange Commission (SEC) on Friday, the Franklin Ethereum ETF will only charge customers 0.19% per year for holding Ether in their fund, a much lower rate than those assessed by global competitors that have already gone live.\n\n“The sponsor’s fee is accrued daily at an annualized rate equal to 0.19% of the net asset value of the fund and is payable at least quarterly in arrears in U.S. dollars or in-kind or any combination thereof,” wrote Franklin.\n\nThat’s not all: the fund has also promised to waive all sponsor fees on its first $10 billion for the first six months after the fund goes live.\n\nAD\n\nAD\n\nThe ultra-low fee mimics that of Bitcoin spot ETFs that launched in January, where competing funds crunched each others’ numbers in a vicious fee war days before their products went live. Most now offer fees below 0.3%, with many—like Fidelity and VanEck—offering temporary fee waivers.\n\nFranklin also launched a Bitcoin ETF at the time, but mostly lost the battle to competitors on both volume and assets. This time, the asset manager has wasted no time getting its fee rate out the door, driving its costs close to zero.\n\n“For context, most ether spot ETFs in other countries or in other vehicles are >1%,” wrote Bloomberg ETF analyst Eric Balchunas to Twitter on Friday. “The US ETF market is just special in its hardcore-ness but that’s why the vast majority of new investor cash [is] flowing here.”\n\nAD\n\nAD\n\nAs seen with the Bitcoin ETFs, a 1% discrepancy can make all the difference for customers. For example, the Grayscale Bitcoin Trust (GBTC), which chose to keep a relatively high fee of 1.5% in January, has already lost more than half of its Bitcoin in outflows.\n\nDespite boasting over 600,000 BTC at launch, it has now lost its title of the world’s largest Bitcoin ETF to BlackRock’s much cheaper fund. Meanwhile, more expensive Bitcoin ETFs in Canada and Europe have also seen net outflows, despite rising demand for Bitcoin throughout the year.\n\nIn addition to Franklin, the SEC approved 19-b4 applications for seven other Ether spot ETFs last week. Experts say the funds are likely to go live on national securities exchanges within weeks.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9TcnZHN3p2cVVNTGg0RWI1MjFwUHlKLXBJS1hpVE8wcU0xb2x1R2tYVWJaTDFwQU5xUGJ2bXRKSHRtYlJjOTlac0Q1cEt3cmVhcDlMOHR0TjVkdjJPX3p3ZG1kNjZFY1o1dndJS0x5SS1Ea241V1ZYTEp6SXM4SW_SAYQBQVVfeXFMT25CRlE0ckROS0wxV1RqSHA0c29ZVG5FYzdWNWZCbXR6YzRfS3dWa3ZULWEtSDQwdGhLZkhaalliQ0RmOWlRVmw1NzJTZklJSDdoVFdNMmF0QlF3c2stVVhHbkZHZ2VtQ19jQmlEalJjYmdyQ010Mlk4ZlNzRDk2TVAxVURB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum: Can a retracement to $3.7K propel ETH’s price to $4000? - AMBCrypto News",
        "content": "Etherium to retrace to $3.7k to retest a support zone before a price surge to $4k.\n\nMost metrics hinted at a price correction in the near future.\n\nEthereum [ETH] is retracing to $3.7k, the resistance zone that turned to support before retesting to surge to a target high of $4k. This support zone could lead to a surge towards the target high of $4k.\n\nHowever, the fair value gap below $3.7k might act like a price magnet, pulling the price lower and potentially breaking this support. If the bearish momentum pulls the price past the support zone a retest at the upward trendline support is likely.\n\nAs of writing, CoinMarketCap data shows a 2.24% decrease in price over the last 24 hours and a 2.16% increase over the last 7 days. The overall Ethereum performance is on a bullish move as investors keep eyes on the $3.7k support level.\n\nIs a bullish surge to $4k possible after the retracement?\n\nAMBCrypto analysed Santiment’s Social Volume chart, it showed several periodic spikes in the mid-May, correlating with significant price movements. The retracement to 3.7k aligns with increased social activity indicating a potential price direction.\n\nAMBCrypto further analysed the IntotheBlock In/Oot of the Money chart and it indicated that 61.87% of addresses valued at $11.06 million are in profit while 37.38% of addresses valued at $6.68M are at a loss.\n\nAdditionally, it indicated that 135k addresses are breaking even. It showed that the key prices ranges from $3.3K to 3.6K in profits and $3.9 to $4k in losses.This distribution indicates a significant support and resistance levels based on the holders profitability.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThe Bollinger bands in the daily chart widened, indicating a high volatile market that could steer a slight bearish pressure to the support zone at around $3.7k and break out to surge to $4k target.\n\nThe stochastic RSI (89.69) shows an overbought reading suggesting a short term retracement before continuation of the overall bull run."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxNSVhNcUtTYjRZSTlPNy1aM1A2VWdEQmc4LTBNX3g4UXcwMG9qYTZCb0tsTG0yOHJJUUI3aHk2cXdBRzljX1ZuaklWMzQ5LUI3dHpZYW1JTTlEMGJpN2djSEs0d1g2WFduU2txZjdLNFFwSFJwNFFjZDQ0YkVDN3Eybkxtd2dmRjE4SHRGTW9pQl92WEM3REZvOGNtLUZ0Y3k0Z1FWaXFKWDFVNkdQSi1EZXFWRjNkSVEzcld5S2p5VEN0bGJlQjdLb2tCTXgwOHNrVHQyU1JxYVNXRVQ1VFHSAeMBQVVfeXFMT1lPVzhFTmkyRFFJaWNfTlJhcm5Hd3RCeDdkNUZ3c2NfR3VjTUpZc002VmpRc2dkQ0J5QWdMUWIyMnZJdEFpanVmWkxycWNZRmtFSnhIdkRDX1ViX3VzOWV6bmttUnJEYUF6Mmd0bkxIWkIwdFFGekcyZ2wzeUZRTUdDbTBsSzJUMjhSUXNaYmxpaWZmOFhid25yVVZYd2dNaTNiUDZLNmt4R2lFZzFWUk9vUzlKaHNJMzlKaXRrejIyM1F1VjBzaDJlUlNibWhqUVBuM2Q2TFJRMnJMNzJzTEw2UUU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Facing correction after ETFs led rally - FXStreet",
        "content": "Bitcoin price is unable to overcome the $69,712 to $71,907 area of resistance.\n\nEthereum price will likely pullback into the major support level of $3,360.\n\nRipple price could end the consolidation between $0.463 and $0.572 range.\n\nBitcoin (BTC) price continues to consolidate in a range that offers a buying opportunity, while other major cryptocurrencies, such as Ethereum (ETH) and Ripple (XRP), look set for a potential price correction. ETH and XRP rallied 10% and 5%, respectively, right after the US Securities and Exchange Commission (SEC) approved Ethereum’s spot Exchange Traded fund (ETF).\n\nBitcoin price eyes for a rally\n\nBitcoin price rallied 8% on May 20, but such an impulsive move could lead to a retracement. As seen in the chart below, BTC is currently being rejected by the order block between $69,712 and $71,240, which also harbors the weekly close at $71,280.\n\nSideline investors looking for buying opportunities could do so at the following levels:\n\nThe volume profile high node range that extends from $67,090 to $66,035. The 100-day Exponential Moving Average (EMA) is currently at $62,533, coinciding with the bullish order block range between $62,985 and $61,427.\n\nIf BTC bounces off the $62,533 level, it could rally 10% to the local top formed at $69,712.\n\nThe Relative Strength Index (RSI) and Awesome Oscillator (AO) indicators support the aforementioned bounce, which are firmly present above their respective mean values of 50 and 0, suggesting that the bulls are in control.\n\nBTC/USDT 1-day chart\n\nOn the other hand, if Bitcoin's price closes below $58,271, it would invalidate this bullish thesis by producing a lower low in the higher timeframe, leading BTC to crash an extra 10% and hitting the previous support level of $52,400.\n\nEthereum price wants to move higher\n\nEthereum price broke above the falling wedge pattern and the 50 EMA level at $3,144 on May 20 and rallied 21%. Currently, ETH is being rejected by the bearish order block of March 12, ranging from $3,980 to $4,093.\n\nEthereum price could rally upwards in two ways:\n\nA break out above the daily bearish order block, extending from $3,980 to $4,093, flipping it into a support zone. ETH could pullback into the major support zones of 50-day EMA at $3,558, which roughly coincides with the bullish order block, stretching from $3,393 to $3,119.\n\nIf the conditions mentioned above are to play out, then the Ethereum price could revisit its all-time high (ATH) of $4,868.\n\nETH/USDT 1-day chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $2,864 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 8% crash to the previous support level of $2,600.\n\nRipple price likely to end its consolidation phase\n\nRipple price is currently consolidating between $0.572 and $0.463 after a major 33% fall in mid-April. This 46-day consolidation has seen XRP forming higher lows in the daily time frame, indicating a decrease in selling pressure.\n\nIf Ripple price breaks above the $0.561 —$0.572 range, it could rally 8% to revisit the 61.8% Fibonacci retracement level at $0.621.\n\nXRP/USDT 1-day chart\n\nHowever, if the Ripple price breaks below the range of $0.463, then XRP would crash an additional 10% to its previous support at $0.419."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPa3BDQndMNXBtZnRUXzFhRUdOaWVhX085NW9kcWFrcWFBRllTMXFIQzBzN2NRM2ZRTU9xMXUxNk1yN0V2Z0ZscjFCZ080b19Xa1lScTN3em5FX2E4V0V0ZFdWZkMzeFFBcEszanpMZTZXakd3ZjBRSE1fYmRReU5ocNIBiAFBVV95cUxPZDNJYmdPNExGckRQQ1gtcG9uOHF6MmpJalZmeHJkSEN6VWg5bFhWZ2lndlY3WHVaaWMzeFlyaDJzVnhMWlhJdjNvN0J3MnEzb0VSWXBnbUxON0M1SjNENTV6X0xvamttdUpDT3RfXzRHS2Z2Y0V2S0NKME92dXhLQ2VyMG1FaVJ0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Singapore Bank DBS Says It Isn't an Ethereum Whale - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt would have been awfully bullish for Ethereum if DBS, the largest bank in Singapore, were a whale with $650 million worth of ETH on its balance sheet.\n\nBut that's not the case, according to the bank.\n\n\"In relation to the post, DBS does not have this position on our books,\" a bank spokesperson told Decrypt in an email.\n\nThe post they were referring to is one from blockchain analytics platform Nansen. The firm said on Twitter early Thursday morning that they had linked an Ethereum wallet to the bank.\n\nAD\n\nAD\n\nWe've identified this $650m $ETH Whale holding 173.7k ETH as DBS, the largest bank in Singapore with assets totaling S$739 billion as of 31 Dec'23 This address has made over $200m by holding ETH... 🤯 Track the address on Nansen here: 0x9e927c02c9eadae63f5efb0dd818943c7262fb8e pic.twitter.com/2rkM3cZ6gJ — Nansen 🧭 (@nansen_ai) May 30, 2024\n\n\"We have it under good authority, via several independent sources, that DBS owns the private key of this wallet and these assets are most likely a part of their custody solution,\" Edward Wilson, a Nansen analyst, told Decrypt. \"This may be similar to how we see institutions, both crypto native, like exchanges such as Binance or Coinbase custody funds on behalf of their users and how non-crypto native funds custody digital assets for their clients. The institution may be the custodian and responsible for managing the security of the funds.\"\n\nWhen asked if the wallet is instead one that the bank uses to custody funds on behalf of its crypto clients, the spokesman declined to comment.\n\nIt's not totally implausible that DBS would hold Ethereum—even if only on behalf of its clients. It's got a long track record as a crypto early adopter.\n\nAD\n\nAD\n\nThe Singapore bank has seen its market capitalization grow substantially since the start of the year, from $63 billion to $75 billion at the time of writing. It added support for China's CBDC, the e-CNY, last summer. And in 2020, when many banks were still blocking crypto transactions, the Singapore firm launched its DBS Digital Exchange.\n\nAnd when the exchange proved popular with its clients, the bank added a custody service as well.\n\n\"In 2022, DBS reported an 80% increase in the volume of Bitcoin traded on its DBS Digital Exchange,\" the bank wrote last year. \"Capitalizing on this momentum, the bank expanded its services to include digital asset custody, which resulted in a doubling of the number of Bitcoins under custody.\"\n\nAt the time of writing, DBS's shares are trading for $35.85 Singapore dollars, or approximately $26.55 in U.S. dollars. And Ethereum is currently trading for $3,756.96. That's a 1.5% drop since yesterday, but a 25% gain since last week when the U.S. Securities and Exchange Commission approved Ethereum spot ETFs to trade on exchanges."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxNbEh6V0F1WUhjend5NzUwaTl4UGJiOTZSa2luSEZYZzBRdXQtTFNWbkVBY2EtRVY0ZUpyMi1JWVNwR1RnclFJN0RhY05LV1Y2dnR2WnlJNDh1NmU5ZC03OVZSV3FuZ19oaUtZeUxPM2hRSjJQLVFEQXhrNG5ESGZoNXhmbnZKZEZZR3FCMkc4eDlpbzZQREt1eHZfcnYtbzhKQzB6cmNSa3JQQnppMVA0cUsxRm1rT1g4dEVFZnZKYnJVUEtIWmpsT3lzcTlYaU1vdU02TXdGLTV1RWx6RVl0TkNwZHpWaW5Z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Cathie Wood Of Ark Invest Believes Ethereum ETF Approval Linked To US Politics, Sees Likelihood Of A Solana ETF As Well - Benzinga",
        "content": "ARK Invest CEO Cathie Wood has stated that cryptocurrency has become a significant political issue in U.S. elections, leading to the unexpected approval of key Ethereum ETH/USD ETF filings.\n\nWhat Happened: Wood made this remark at Consensus 2024, as reported by CoinDesk, attributing the sudden approval of Ether ETF filings to the growing importance of cryptocurrency in U.S. election debates.\n\nWood expressed surprise at the approval, stating, “The read was it was not going to be approved. It was absolutely not going to be approved.” She further explained that the sentiment around the Financial Innovation and Technology for the 21st Century Act (FIT21) evolved in the House, leading to its recent bipartisan approval.\n\nWood also pointed out former President Donald Trump’s increasing comfort with Bitcoin and other cryptocurrencies, including his recent decision to accept campaign donations in crypto, as a factor that has drawn attention to the sector.\n\nSee Also: Shiba Inu, Dogwifhat Post Double-Digit Gains As Memecoins Shrug Off Dips In Bitcoin, Ethereum: What’s Goi\n\nWhile Wood suggested that a Solana SOL/USD ETF could be approved, she deemed meme coin-focused funds unlikely, stating that large brokerage firms and investment advisory companies would not accept more than “the majors.”\n\nWhy It Matters: Wood’s comments come in the wake of her earlier predictions about the potential of cryptocurrencies, especially Bitcoin ETF/USD. In April 2024, she raised her Bitcoin prediction by $2.3 million, suggesting that a $1,000 investment could be worth a significant amount by 2030.\n\nDespite Ether’s recent spotlight due to the ETF approvals, Wood maintained her bullish sentiment on Bitcoin, stating, “Bitcoin, hands down. No question about it. It is a global monetary system. It is a technology, and it is a new asset class.”\n\nEarlier this week, she also highlighted how El Salvador’s push for Bitcoin and AI could potentially increase its GDP 10X in five years.\n\nARK 21Shares Bitcoin ETF ARKB attracted inflows of $4 million on May 29, and around $ 3 billion since the ETFs started trading in January, according to SoSo Value.\n\nRead Next: Bitcoin, Ethereum, Dogecoin Edge Lower As Inflation Fears Grip Investors: Less And Less Of King Crypto Available For Masses, An ‘Enormous’ Bull Market Inevitable, Says Analyst\n\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiggJBVV95cUxQMmM1UVpBMlZaNFR2aFFBTjBfQ1dNV2pfRUU3THhMcC1VREJrYUw4ek1naFQ5MzhLUFpJSTYxWUNBRmcyYTNZUFBiTHJOYXdoa3FEYTJFS29TOU5yVkpVN2xjZjR5SVdHT21WUng0cUVNWEJWTTFlcFpZZ2ltOWkwS2M4UnpDQUlEckZabXVndFhwb3pjSVVRdVBEak1YUUh2dUlJYWpMWXhUNjJmcHVEOTBaWDJjUGpkVjVZNmUzZVVDbTFxSDlHZ2l5OFUweUdOWDFadWtkZFdpLTI3WUQyWU83dDAzRHIxTVJWU3RzWDBRdGttaTgyeUlKYXhVQ3d6N0HSAYcCQVVfeXFMT0FZNkFWLVFUdVRMTzZsV0ZvczY0SUM5Q0lZcmxMbEJmejVsSENRTmxlRVdpUV9XT0g1Ykl2VUxNTUtnNGVlaDZJb2tremJTX0NtREYzd2E1Wmp5SkpSNUJmSEpRdjREVTB6OGtJaGllNHI2Y0o3RmVPbVJXdjZDM1FIRjlXclJwWU1lMHg1bVVzN3JzOWJvdHJ4U2VVYnJWQ2Nvb1RlTVF5ZHZhWHhoUmxXemlqT1JlZ0VseFlJRVlFNHFRZm0wb1VvZjMwQ3hvblFLeHlfSFN5NHVPNHF5VEZuby1zcGtnR2pRTEEya2p0VEs2VXZac0psNy1ZdzAtUXNlVTIyaGs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "BlackRock’s Ethereum spot ETFs listed on DTCC: Five cryptos to diversify with and capitalise on this trend - The Economic Times",
        "content": "KangaMoon (KANG) raises over $7.2 Million and reaches 32,000 Users\n\nNear Protocol crypto on the rise as network surpasses $200M in issued USDC\n\nEthereum Classic Price at an uptrend following latest updates\n\n\n\nEthena (ETA) rises 27% – How far can it climb in 2024?\n\n\n\nBlackRock’s spot Ethereum ETF has been listed on top of the Depository Trust and Clearing Corporation (DTCC) with the ticker symbol ETHA.This listing follows the SEC’s approval of a total of eight spot Ethereum Exchange Traded Funds (ETFs). Following this major move for ETFs in the Web3 space, traders have begun to diversify their holdings in order to get the most out of the market. Out of the thousands of available altcoins, five have stood out the most as cryptos that can surge in value immensely, and these include KangaMoon (KANG), NEAR Protocol (NEAR), Ethereum Classic (ETC), Chainlink (LINK) and Ethena (ETA). Let’s take a look at these cryptocurrencies:KangaMoon ( KANG ) will revolutionise the meme coin landscape through the construction of a sustainable ecosystem that fosters significant token utility, one that transcends hype-driven trends. This is achieved through a strategic fusion of Social-Fi elements and Play-to-Earn (P2E) mechanics, which cultivates long-term value beyond just hype.In addition, the token’s blockchain ICO has garnered significant traction, as the project now boasts a user base surpassing 32,000, while the token has experienced a growth of 400%. The presale itself also secured over $7.2 million in funding, which further solidifies investor confidence, as it is projected to break past $8 million by the end of the month. Moreover, KANG’s initial price point was at $0.005 but now trades at $0.025 during the bonus presale stage.Not only does this reflect significant growth but the round also represents a limited-time opportunity to get KANG at a discount before it explodes in value. In addition, KangaMoon has already established its presence on prominent platforms such as CoinMarketCap and CoinGecko, facilitating investor analysis, and will soon get listed on BitMart, a major CEX. As a result, analysts are now projecting a 100x price increase following its launch.NEAR Protocol (NEAR) surpassed $200 million in natively issued USDC , which is a major milestone that can send the ecosystem demand and utility further. This will also have the effect of increasing demand for the NEAR Protocol crypto, which can result in a price uptrend.The on-chart metrics for the crypto are now bullish, as the NEAR Protocol price has found support at $7.70 after briefly passing the $8 price barrier. Now, the RSI and MACD data showcase a positive price momentum, and according to the NEAR Protocol price prediction, it can end Q4 of 2024 at $11.46.Ethereum Classic (ETC) is also experiencing an upswing in trader interest following its most recent integrations. For example, now anyone can mint the Ethereum Classic crypto through the usage of the F2Pool The on-chart metrics for the Ethereum Classic price are bullish, as the weekly price increase was by 20%, further solidifying it as a major contender. Based on the Ethereum Classic price prediction, by Q4 of 2024, the crypto can end the year at $45.71. Chainlink (LINK) expands services in nine different blockchainsChainlink (LINK) is consistently expanding the offering of its ecosystem, as within the past week, it saw 12 integrations of six chainlink services, all across nine different blockchains, including Arbitrum, Base, Ethereum, Linea, Metis, Optimism, Polygon, Scroll and zkSync.The Chainlink crypto has also increased in value as its weekly chart suggests a 10% uptrend, and could soon result in further gains. Based on the Chainlink price chart, it recently surpassed the $17 price barrier, indicating that $20 marks a major resistance point that it now needs to pass in order to reach new heights. According to the Chainlink price prediction however, the crypto can end Q4 of 2024 at $25.08.Ethena (ETA) is also at an uptrend as it experienced a 27% price increase during the past week fueled by ecosystem expansion. The team recently announced that USDe is the first integration, with the new UX layer of DeFi , Infinex. As a result, anyone can now deposit USDe and earn from Ethena while also earning Infinex governance Points (GP). The Ethena crypto could see a major uptrend as a result, further appealing to traders.According to the Ethena price chart, it broke above the $0.90 price barrier, and is closer than before to passing even above $1. According to the Ethena price prediction, it can end Q4 of 2024 at $1.33.With Ethereum ETFs being approved, the race is now on for more cryptocurrencies to get the same treatment. Out of the many cryptocurrencies available, the key ones that stood out the most include NEAR Protocol, Ethereum Classic, Chainlink and Ethena.However, the biggest growth was seen with KangaMoon as it's up 400% on the charts, and it has raised over $7.1 million so far. With a unique blend of Play-to-Earn (P2E) features, Social-Fi elements, and a community-driven approach, it is poised to dominate the charts in 2024 . Discover the Exciting Opportunities of the KangaMoon (KANG) Presale Today! Join the Telegram Community:The above content is non-editorial, and TIL (Times Internet Limited) hereby disclaims any and all warranties, express or implied, relating to the same. TIL does not provide investment advisory services in any manner and the publication of this content does not mean TIL's or Economic Times endorsement. TIL strongly recommends the users to take all steps necessary to ascertain that any information and content provided is correct, updated and verified and/or speak with a qualified investment professional before making any investment decisions."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxOc0ZsZFJ2ZV94bG5QdlMxdHpQbzBCMTZtN09VOEhxcnVRcXZtN3IzWU5KNVJ2VHI4R3UxNWtfajNFM1JTamR4ZGRJLTlvQ2loVHRoNVU0Sk11aWZUVkU3bnRXT1J0SmxVRnhBQ0RFU0pkeTZJT2YxXy1GRmZuMEtUenRsVEIxN1hSeUZ4SVl3a0NrQmRtSlBQdlF2SFBHU1VFOVhDRFBzN090eHZMbExxUjdabHhRck1RNk5iejYzVThtd0tKVERtNUJUNzliQ0xtSFBvZmozakI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum Classic’s Impending Halving and Stellar’s Protocol 21 Upgrade, BlockDAG Takes the With Promising Future - Blockchain Magazine",
        "content": "Ethereum Classic’s Impending Halving and Stellar’s Protocol 21 Upgrade, BlockDAG Takes the With Promising Future\n\nNavigating the ever-evolving landscape of cryptocurrency can be daunting, but the latest developments from Ethereum Classic, Stellar, and BlockDAG are turning heads in the blockchain community. As Ethereum Classic approaches a pivotal halving event and Stellar rolls out significant upgrades with its Protocol 21, BlockDAG is making waves with its groundbreaking smart contracts platform.\n\nThis blog dives deep into these developments, exploring how they are reshaping the investment opportunities in the blockchain sphere and why BlockDAG, with its impressive fundraising and innovative platform, stands out as a top investment choice for 2024. Join us as we unpack the potential impacts of these critical updates and what they mean for crypto enthusiasts and investors alike.\n\nEthereum Classic’s Anticipated Halving\n\nScheduled between May 27 and June 11, Ethereum Classic’s halving event will slash the mining rewards in half, influencing the supply and potentially boosting the cryptocurrency’s value.\n\nLaunched in July 2016 as a divergence from Ethereum due to a security breach, Ethereum Classic remains committed to the Proof-of-Work (PoW) consensus, emphasizing its dedication to decentralization and security, unlike Ethereum’s shift to Proof-of-Stake (PoS).\n\nStellar Enhances Its Network with Protocol 21\n\nStellar has recently upgraded its Testnet to Protocol 21, paving the way for smart contract capabilities, a significant stride toward enhancing its functionalities beyond mere payment transactions. Key forthcoming milestones include stable releases of Stellar Core and Horizon, a Testnet reset on June 11, and a Mainnet upgrade vote on June 18. This move, backed by the network’s validators in February, positions XLM for substantial benefits, especially within the Decentralized Finance (DeFi) sector.\n\nBlockDAG’s Revolutionary Smart Contracts Platform\n\nBlockDAG’s presale is experiencing significant growth, with total contributions now surpassing $37 million. This increase is propelled by robust investor interest and strategic improvements to the platform. One of the key upgrades is the redesigned dashboard, which enhances user interaction through new features like an announcements section and a notification tab, keeping users well-informed about the latest updates.\n\nThe recent enhancements to BlockDAG’s dashboard underscore its commitment to transparency and empowering its users. The updated interface allows investors to monitor their rank, transactions, and referral bonuses effortlessly. This intuitive design keeps investors well-informed and optimizes their potential earnings, making BlockDAG an attractive option for experienced traders and those new to the market.\n\nFurther innovating in the blockchain space, BlockDAG’s low-code, no-code smart contracts platform transforms how blockchain development is approached.\n\nThis platform enables individuals without deep programming skills to easily create and deploy smart contracts using predefined templates for various applications, such as utility tokens, meme tokens, or NFTs. This accessibility is lowering the barriers to entry and fostering wider participation in the blockchain ecosystem.\n\nBlockDAG’s innovative platform is poised to draw diverse developers and innovators, thereby enriching the decentralized nature of the blockchain industry. With the increasing adoption of BlockDAG’s tools, the network’s ecosystem is poised to expand significantly, leading to robust growth and a thriving crypto community.\n\nFinal Tak\n\nThe evolving crypto market continues to offer unique investment opportunities. Ethereum Classic’s halving could shift its market dynamics, enhancing its value. Stellar’s upgrades suggest broadening capabilities, potentially elevating XLM’s status in the DeFi landscape.\n\nMeanwhile, BlockDAG’s innovative platform and significant fundraising underscore its potential for remarkable growth. As these projects advance, they collectively underscore the current blockchain ecosystem’s dynamic nature and investment potential.\n\nJoin BlockDAG Presale Now:"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNVFNEOXduSlJMLVU5UWh3UzNuQmRSNmZiZWtCZjV3LUlQT0pRWTI1SFh0a3BnYkNqLUd1Tldib1V1VmFROUF4SDlwNUg0M3ZpQWZFT3k0eTJ2OGplZFU4Q3FXUUF6VWxlazMzaWFBTEJEWjNyU0NSRll5ZjQ1SENyWUVOOG91cmxocXFpZmp5a244UlXSAZgBQVVfeXFMTy1Vbmd3al9tM1dRWTlfUFJiRjU3U3ZfSVFEMk5RS1p0VU5lbFNsYVQ5STloN1plMVNLdVlrM3hyOEJVakVoUlY0X19nM3FmRjZrclk4N05aZEtSR0dpQXpKb0Nlbl9mWEh6N2gzYUtOUHctb21rbUNTTGZCdWpzTFE3NTBSaVFQMllEZ0lsVWJ6M0F3dFlqNV8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Vanguard Receives Backlash Over Ethereum ETF Ban But There’s A Catch - CoinGape",
        "content": "Vanguard Group, one of the leading investment advisors in the USA, is facing significant backlash for its refusal to allow Spot Ethereum ETFs on its platform. This decision comes despite growing interest in cryptocurrency assets and recent regulatory developments. Earlier, the firm provided a similar stance on Spot Bitcoin ETFs.\n\nVanguard Attracts Criticism For Not Offering Spot Ethereum ETFs\n\nEric Balchunas, Bloomberg’s Senior ETF analyst, expressed his disappointment on social media. In a post on X, he vehemently criticized Vanguard’s stance on Spot Ethereum ETFs. Moreover, he called the move “silly” and suggested that the firm is playing a “Nanny role.”\n\nadvertisement\n\nBalchunas sarcastically argued that Vanguard’s investors are “the smartest money on the planet” and are capable of making informed decisions about their investments. “Crypto was able to shift the stance of some in the highest rungs of government but not Vanguard, who maintains their platform ban for Ether ETFs which are ‘not aligned’ with building a well-balanced, long-term portfolio,” Balchunas wrote on X.\n\nDespite his critique, Balchunas seemed to understand Vanguard’s cautious approach on Ethereum and Bitcoin ETFs but still found it excessive. Moreover, the analyst acknowledged that Vanguard operates differently from other asset managers. He noted that the company functions more like a co-op, focusing less on hunting for revenue.\n\n“They’ve taken in nearly a billion a day for over a decade, and so they’re not envious of other people’s hit ETFs,” he added. The investment advisor’s decision comes shortly after the U.S. Securities and Exchange Commission (SEC) approved the 19b-4 filings from several issuers for Spot Ethereum ETFs.\n\nHowever, these ETFs are not yet available for trading. The SEC still needs to clear the S-1 registration statements from fund issuers. Most expect the launch of these products by July 4, 2024, as predicted by the Bloomberg analyst previously.\n\nIn a statement to Blockworks, a Vanguard spokesperson clarified the company’s position. “While we continuously evaluate our brokerage offering and evaluate new product entries to the market, Spot Ether ETFs will not be available for purchase on the Vanguard platform,” the spokesperson said.\n\nAlso Read: Alike Bitcoin, Vanguard Has A Clear NO For Spot Ethereum ETFs\n\nBloomberg Analyst Hints At A Ray Of Hope\n\nThe firm has consistently distanced itself from the crypto world, labeling it an immature asset class. The spokesperson reiterated, “We believe that cryptocurrency products are not aligned with our [offerings] focused on asset classes such as equities, bonds, and cash, which Vanguard views as the building blocks of a well-balanced, long-term investment portfolio.”\n\nBalchunas highlighted a potential silver lining in the form of Vanguard’s new CEO, Salim Ramji. Ramji, a former BlackRock executive, played a significant role in launching BlackRock’s Bitcoin ETF (IBIT). Moreover, he is believed to have contributed to BlackRock’s ETHA Ethereum ETF as well.\n\nHence, Balchunas speculated that Ramji’s crypto-friendly background could influence Vanguard’s future stance on cryptocurrency products. “The only hope at all is that their new CEO…is clearly into crypto. Will he be able—or even try—to move the needle on this internally or just opt to bury that part of himself? Answer unknown,” Balchunas pondered.\n\nAlso Read: BlackRock Submits a Revised S-1 Form for its Spot Ethereum ETF\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOc05WNC0zOFV3Qk9vT2ZjalNRMjNiZHN6ZWpqWmNIa2h6WVpkd0VnS3RIckV3WExJYTV5eENMYWVFb2taNzB6SksxRTVoUkJBdTRTTEtjeTBjeDhVWk5zSExsbGtNMnV1YWZZTEJub2JvSEpTQTZRV2JheU52QzVnR2RzNDFsVWNaTVFwSldHNmU3WHVZc3JkeVJPaEs5YlkxNGlCZlp3S2hwNTJQaWJ30gG0AUFVX3lxTE4zeHRlUF9uc2VoSUJJX21NQkt3aV85dHhPanc2VURqYjFrYlhYODdUa3hJdXFjNVJELWJWaXFRZ2FBN1RRQi1ub0FKcXFFZkI4ekZva1JOcTNTd2FZQzNKb2h5S2FhdGpEdEpONlFfM0phYTFvSFVCbFNoTF9mX1VlMTBCVk96TlJSVTZ4ckZvZ2FWZk9td2YwTzlaNjI0cEY4clZITll3VmpOVFRYUl9sYzB4YQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Prediction: Why Ethereum Price Could Dive To $3,500? - CoinGape",
        "content": "Ethereum price saw a significant surge following the announcement of the approval for the Ethereum Spot ETF. The ETH to BTC ratio stands at 0.054, indicating Ethereum has experienced a 22% increase. Bitcoin rested support at $67,000 and could drop $65,000. Meanwhile, Ether holds at $3,700 amid heightened volatility.\n\nEthereum Price Analysis: Is a Retrace In-Bound Before a Pump Higher?\n\nETH price is strong against Bitcoin, although the general trend is downward. The ETH/BTC price ratio has been trending below the 50-day and 200-day simple moving averages (SMAs) for the past 482 days. This signifies that Bitcoin was gaining on Ethereum.\n\nadvertisement\n\nHowever, following the approval of the Ethereum Spot ETF, Ethereum gained on Bitcoin. Ether is currently above these two moving average indicators. The action is also in a massive bull flag market structure on the daily timeframe. If the chart pattern plays out, a rally with a 22% magnitude could erupt to hit 0.07 BTC, levels not witnessed since July 2023.\n\nIn an inverse scenario, the Ethereum price may find support around 0.051 BTC and 0.053 BTC. This level is a resistance-turned-support and has been tested three times before.\n\nThe price of Bitcoin is approaching the end of a symmetrical triangle on the 4-hour chart. Symmetrical triangles can break out on any side but usually follow the direction of the preceding trend, up in Bitcoin’s case. Bitcoin price is also trending above the 200-day SMA, which is bullish. Key resistance levels to look for in the case of a bullish breakout would be $71,600, $74,724, and $77,490. Conversely, key support areas would be around $66,200, $65,700, and $62,900.\n\nThis week, Blackrock submitted an S-1 statement for their Spot Ethereum ETF, a move that may result in bullish sentiment for the asset.\n\nOn the other hand, Blackrock’s BTC holding is rapidly closing the gap against that of Grayscale. As of May 15, 2024, Blackrock was just 15,000 BTC shy of closing that gap. That number may be smaller today. In other news, Blackrock’s Bitcoin ETF also became the fastest ETF to reach $20 billion (137 days), defeating JEPI (985 days).\n\n$8.12 Billion BTC And ETH Options Set To Expire Today\n\nOn May 31, 2024, a whopping 69,000 Bitcoin options with a notional value of $4.7 billion are set to expire on Deribit. The put-call ratio is 0.61, which means there’s been a rise in call open interest recently, as everyone prepares for the monthly expiry. The max pain point is $66,000, which could cause some market tension.\n\nAs for Ethereum, there are approximately 354,000 contracts with a notional value of $1.5 billion expiring on the same day. The put-call ratio for Ethereum is 0.59, which suggests a higher concentration of call options, indicating a bullish sentiment among traders. The options expiry could cause a price pullback as traders and investors navigate the situation.\n\nBottom Line\n\nEthereum price surged following the news of the Ethereum Spot ETF approval, with the ETH to BTC price ratio now at 0.054, marking a 22% gain for Ethereum. Despite recent minor declines, Ethereum is showing strength against Bitcoin, breaking above key moving averages and forming a bullish market structure.\n\nIf this pattern continues, Ethereum could see another 22% rally. With BlackRock’s recent filing for a Spot Ethereum ETF and significant BTC and ETH options set to expire, the market is bracing for volatility. The options expiry could lead to price pullbacks, but the overall sentiment appears bullish as investors navigate these developments.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxOZlJSenVvWldHckhSak8zc2lET0VrMk9UNHdvNTlQekpiUlBYMU16Y19TWXBNOXdPZnZyTjRlZkdsVDdaSTFvX190blR4MGV5WGpTOFFkaUk4QlJvRHlVYVBUcmNBN1ZXekVZTFB0azF4a3llZnUtRzFxcm9nLVA5YWlBMFN2RXNvcnFiSFN3Y3dJTzFldzZNN1BGcEQ2SHZZQ3hPUXc3eFVaeDlYa1p0U0Y3ZzJWWDUyVVRPWTBaMkVlVGN6bGRkQ3N4bmExNXZqckFKZVJwNXp6RTE0UXROV9IB5gFBVV95cUxPQVVlMUtTNE1oQ0QtUEZ6NFprS0hLSURmaEV6WDVBSDRYZmVXNDREU1UxRkxDLW1xU3luQ01ZVWE2RktWQ1FHMzJ1VWV3bnBOQWxEQnhuNWZUWGcwa1VFNjJDbVl6TVNlSl9DYms5TjJtLWE0aFFwV2FfdHJHV1FncVA4d3Y0ek5yZEN3VDBrN19Ka3I5Q08wNnJGZmVxSm04bHVDaFQxNGlxY1UtcUpiMXNiT19mMExuMUNKVkVZSUZaMXdjTUVPRjhhVmVVQXdMUWh4QXh5LUlrN291WC1mU0syNldQQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum price lags, investors potentially reallocating capital after BlackRock's updated S-1 filing - FXStreet",
        "content": "Ethereum ETFs will likely begin trading soon after BlackRock filed its updated S-1 application.\n\nVanguard won't offer Ethereum ETFs on its platform.\n\nEthereum investors may be reallocating capital to benefit from the potential larger upside of smaller-cap DeFi tokens.\n\nEthereum (ETH) price shows neutrality despite positive updates of BlackRock's spot ETH ETF updated S-1 application and the Securities & Exchange Commission’s (SEC) engagement with issuers. A key reason for the price lag may be a potential capital reallocation from investors to DeFi tokens in hopes of a larger upside if the launch of spot ETH ETFs spurs a rally.\n\nDaily digest market movers: BlackRock S-1 filing, Vanguard says no to Ethereum\n\nBlackRock filed an updated S-1 for its spot Ethereum ETF on Wednesday, according to updates on the SEC's website. The recent filing comes after the SEC approved 19b-4 applications of eight issuers — including BlackRock's iShares Ethereum Trust — on May 23.\n\nNational exchanges like the NASDAQ or the New York Stock Exchange (NYSE) submit 19b-4 filings to the SEC to seek approval for listing new products on their trading platforms. On the other hand, S-1 refers to the initial registration form detailing how a fund would be managed and how it would track the underlying asset's price.\n\nThe SEC must approve S-1 applications before the ETFs can launch officially.\n\nRead more: Ethereum slightly tilts toward bears, may only see 20% of Bitcoin ETF flows following silver comparison\n\nThe filing revealed the iShares Ethereum Trust's ticker as ETHA and mentioned key details about its seed capital investor.\n\n\"On May 21, 2024, the Seed Capital Investor, an affiliate of the Sponsor, subject to conditions, purchased the Seed Creation Baskets, comprising 400,000 Shares at a per-Share price equal to $25.00,\" said BlackRock in its filing.\n\nAdditionally, BlackRock updated the APs for the ETF, replacing JP Morgan with BMO Capital Markets Corp.\n\nAn AP is a financial institution — often a bank — that provides liquidity to facilitate the creation and redemption of ETF shares.\n\nAccording to Bloomberg analyst James Seyffart, BlackRock's latest filing confirms that the SEC and issuers are working toward spot ETH ETF launches.\n\nAlthough several analysts have expressed that an S-1 approval usually takes months after 19b-4 approvals, Bloomberg analyst Eric Balchunas suggested that spot ETH ETFs may only take weeks.\n\n\"Good sign. Prob see rest roll in soon. Then prob one more round of fine-tune comments from Staff. End of June launch a legit possibility altho keeping my o/u date as July 4,\" said Balchunas.\n\nAlso read: Ethereum may continue outperforming Bitcoin as 'programmable money' may be ETH's new slogan\n\nHe also noted that BlackRock may update its S-1 again as it lacks information on fees and other key data. So far, Van Eck and BlackRock are the only issuers to have submitted updated S-1 filings to the SEC.\n\nThe Block also reported that two sources confirmed that the SEC asked issuers to turn in their updated S-1 filings by Friday after which the SEC will give its first round of comments before further amendments.\n\nMeanwhile, Vanguard has said it won't offer spot ETH ETFs on its brokerage platform, according to Blockworks. \"While we continuously evaluate our brokerage [offering] and evaluate new product entries to the market, spot ether ETFs will not be available for purchase on the Vanguard platform,\" a Vanguard spokesperson told Blockworks. The company also declined to offer Bitcoin ETFs on its platform when it launched.\n\nCrypto was able to shift the stance of some in the highest rungs of government but not Vanguard, who maintains their platform ban for Ether ETFs which are \"not aligned\" with building a well-balanced, long term portfolio. https://t.co/0JjiWzvxBX — Eric Balchunas (@EricBalchunas) May 30, 2024\n\nHowever, many expect the asset manager to eventually soften its stance toward crypto assets, especially after appointing former BlackRock executive Salim Ramji as its new CEO. Salim Ramji was instrumental in BlackRock's foray into digital assets like Bitcoin and Ethereum.\n\nFidelity also listed its spot ETH ETF on DTCC under the ticker FETH, according to PhoenixTrades.\n\nETH technical analysis: Ethereum investors potentially reallocating capital\n\nEthereum traded around $3,776 on Thursday after bouncing from the $3,710 support. ETH's current price action suggests a mix of profit-taking and buying from investors. This is also confirmed by a series of large exchange ETH inflows and outflows, according to Whale Alert. Ethereum liquidation data also aligns with $11.94 million of liquidated long positions and $10.92 million of shorts.\n\nRead more: Week Ahead: Checking the health of Bitcoin’s bull run\n\nConsidering the positive news surrounding ETH ETFs and the potential rally that may occur from their launch, it may seem strange on the surface that some investors are taking profits. However, these investors may be reallocating capital in small portions to DeFi tokens, considering their potential bigger upside during a rally.\n\nETH/USDT 4-hour chart\n\nETH will likely see more price gains as other issuers update their S-1 applications. Hence, it may tackle the $4,093 resistance, which has proven hard to break in the past few days. The $3,605 support may hold strong in case of a decline."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQYkxxMmxaVHdzNTZNeHdQSEtjUjlsMUdRUzgxNVhNWTJuNjdvMXNVSzVnZHExWDVYNi0xX3ZoZG1mZ193Z3BKZjBQbC1xQWp0eE9vaDFQYzZXUjRSeTYyS1dmSExhekZadWlKZjVSNjNMYmxGc1gzSkxWYTVaWTV0RVViaXhvV1Q4S2hqT0t6QTZhdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum: BlackRock Filing Hints at Spot ETH ETF Launch in July - Watcher Guru",
        "content": "BlackRock, the world’s largest asset manager with nearly $10 trillion worth of assets under management, recently updated its S1 filing with the US SEC (Securities and Exchange Commission). The move highlights positive developments towards a spot Ethereum (ETH) ETF launch.\n\nAccording to the updated document, BlackRock will not participate in staking activities. The document states, “Foregoing potential returns from Staking Activities could cause an investment in the Shares to deviate from that which would have been obtained by purchasing and holding ether directly by virtue of giving up staking as a source of return when an investor holds the Shares.“\n\nAlso Read: SEC Approves All Spot Ethereum ETFs\n\nBlackRock’s latest S1 filing update mirrors that of VanEck’s. VanEck and its affiliated parties will also not participate in Ethereum’s staking activities.\n\nWill an Ethereum ETF launch in July?\n\nAccording to Bloomberg ETF expert James Seyffart, the recent S1 filing updates could mean that a spot ETH ETF is just weeks away. Seyffart highlights that developments that take months have happened in one week.\n\nFurthermore, Bloomberg ETF analyst Eric Balchunas, believes that an Ethereum ETF could debut by the end of June or by July 4.\n\nAlso Read: Cryptocurrency: 3 Coins Set To Capitalize On ETH ETF Hype This June\n\nThe launch of a spot ETH ETF could send the crypto market into a frenzy. US crypto investors had long asked for crypto-based spot ETFs. The US SEC made a historic move by approving 11 spot Bitcoin (BTC) ETFs in January. Moreover, the move triggered a market-wide rally, leading to BTC hitting an all-time high of $73,737 in March.\n\nThe US SEC approved all ETH ETFs earlier this month, marking the second crypto-based ETF for the US. Therefore, a similar pattern to the one earlier this year may emerge with the launch of a spot Ethereum ETF."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPaWlQQ3JOWXpPUnc1c0hPSndxSHBZdnZBZUFXZkllMkl5eGE0aGhsRV9PTXl1ZlloNDRPX28yQ1NYNW9hcUNBYktpa3lOSlp0V1RESEJhQzZrbnU0XzJzZE1OUnZHbHZYWjI1OHlfcy15clZMcWp0MEM4Rk93S19PT0VJS1NYYTk5SkdPeXln0gGTAUFVX3lxTE41SUhFWEhKbmZKd2ZhaXhDT3Z5ZmhQdWtaNF9wSVI3WmIyMW5tYWxqUmRiZ3hNUkMwYW92TUtVc2FRa1lBWlM0U3pkME1PcXBvaTJ1c0lpZDc4UmRzdnlfSDg1bWlHTEJFZ2dBcEc5bzdwamlQZ0dPaVpNNGNYOF9IdUlTZ3hHVGhzazlwRUJfOHY1bw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs could ‘grab 20%’ share of BTC ETFs: Analyst predicts - AMBCrypto News",
        "content": "US ETH ETF could attract less capital flows compared to US BTC ETF products\n\nThe analyst based his projection on ETH vs. BTC futures ETFs and Silver vs. Gold.\n\nThe much-awaited launch of US spot Ethereum [ETH] ETF (exchange-traded funds) may struggle to replicate the success of the Bitcoin [BTC] ETF. According to Bloomberg ETF analyst Eric Balchunas, the much-hyped spot ETH ETFs might grab about ‘20%’ of the BTC ETF’s market share.\n\nPart of Balchunas’ analysis read,\n\n“I’d at least divide by 5 when it comes to expectations around the Ether spot ETFs re-flows/volume/media/everything relative to spot bitcoin ETFs. That said, grabbing 20% of what they got would be huge win/successful launch by normal ETF standards.’\n\nEthereum ETF vs. Silver ETF\n\nThe analyst’s 20% of the BTC ETF market share was based on the current market share on the futures market. ETH ETF instruments are already available in various jurisdictions as futures ETF offerings.\n\nBased on the futures market share between BTC and ETH, Balchunas showed that ETH only commanded about 20% on average, a likely scenario that could happen to spot ETFs, too.\n\n“The poor showing of the eth futures is a big part of my calculus. That said, the stronger showings in Europe have me splitting the difference with the final prediction of 20% share.”\n\nAdditionally, the analyst equated BTC to Gold and Ethereum to Silver and made another analysis and assumption Gold vs Silver ETF basis. Per Balchunas, Silver ETF currently has only 15% of Gold ETFs’ market share. He stated,\n\n“Many won’t feel the need to go beyond bitcoin/gold for their crypto/precious metals allocation.”\n\nAs of 28th May, the US spot BTC ETFs had $13.7 billion in total flows. Based on Balchuna’s projection, that could equate to $2.7 billion of ETH ETFs over the same period.\n\nHowever, from a Hong Kong perspective, especially based on the leading ETF funds from Bosera, BTC flows were twice as much as ETH flows for the spot products.\n\nAccording to Farside data, Hong Kong’s Bosera spot BTC ETF saw total inflows of $15.3 million, compared to its ETF product’s $7.5 million. That translates to about 50% of BTC ETF flows for Bosera spot ETH ETF.\n\nHowever, according to CoinMarketCap data, ETH’s $454 billion spot market cap was 34% of BTC’s $1.3 trillion.\n\nThat said, the US spot ETH ETF products could launch in July, with some analysts expecting the ETH price to hit $4.5K before they start trading."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOOWhkQUtubENNREgzMUJ4YmQxZXloeUx3U1U3Q3RtU281Z0xTcFM4OFBuaTlRbnQyQkNTSHFnSUNqSkk2dXJLTmpqRGJTZkRQdEFOdGpJTHVnSEtGRXhlaXhRejMxQkdwM0VOc3prYVczTEUxeHFFTjF0RjllOVpENnRFUlA1dkw1cEVmM3pkdnY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Predicted to Launch In June Amid Updated Filings - Watcher Guru",
        "content": "The recently approved Spot Ethereum ETFs have been predicted to launch in June after updated filings from both BlackRock and Grayscale. Bloomberg analyst Eric Balchunas forecasted the arrival of a crypto-based investment vehicle that will be the second such offering in the United States.\n\nThe US Securities and Exchange Commission (SEC) surprised the entire finance sector with its rather abrupt approval of the ETH ETF. Although they did receive approval in May, the market is awaiting the products to go live, with some expectations arriving as June nears.\n\nAlso Read: XRP, Solana, Cardano ETFs Are Inevitable, Ripple’s CEO Asserts\n\nEthereum ETF Could Go Live in June, Experts Predict\n\nThroughout this year, ETFs have dominated the digital asset sector. The industry’s landmark approval arrived in January, with Spot Bitcoin ETFs launching. The impact was near-immediate, as BTC would reach an all-time high just three months after its debut.\n\nNow, the industry is awaiting whether the second-largest cryptocurrency could experience a similar success story. Subsequently, the recently approved Spto Ethereum ETFs are predicted to go live in June after recent filings. Specifically, Bloomberg’s Balchunas noted when in the month the product could officially launch.\n\nGood sign. Prob see rest roll in soon. Then prob one more round of fine-tune comments from Staff. End of June launch a legit possibility altho keeping my o/u date as July 4th https://t.co/WymshkTvat — Eric Balchunas (@EricBalchunas) May 29, 2024\n\nAlso Read: Goldman Sachs Calls Bitcoin ETF Approval a ‘Psychological Turning Point’\n\nBalchunas forecasted that the ETFs could arrive by the end of the month. However, he also noted that he is maintaining an over/under date of July 4th. Furthermore, he relayed his expectation that there should be “one more round” of comments between issues and the SEC.\n\nThere is a belief that the SEC’s approval was more political than anything else. Moreover, its political motives were to dispel the perception that the agency was ant-crypto. With the Ethereum product being approved, that has been achieved. Therefore, analysts don’t expect any reason for the agency to rush the official launch of the offering."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOV0hKUTU3ZWdyN09mWkxYZXRKb05RdnY5NnJjX09mRjRSRzVZS2VSQ29vbXk5VkFsYVhnMjR4NGx1MTl1dk1lbl9KM3J5VGZiU1NQVjllV20zNUE3bXFzZ1NkYmtVY2VjT3FudnptSS1BdURybHNzVjdOQUZJSFVqb3JBOTdNNm5RaWo4NTRrQ0NjOVBWMFMyTi1zQ0g5VmJwSEJ0V2VQUDNUUWItX1plS0tCTXNhaXgxdTU4MmZzX1V2cjVYbVYweXRSUGZrbWZRMUhabDBybXk5dHVtSnBNWUJoenNGdFF4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Telegram-Associated Notcoin, Sam Altman-Founded Worldcoin Outshine Bitcoin, Ethereum On A Weak Day - Benzinga",
        "content": "Telegram-linked cryptocurrency Notcoin NOT/USD and Sam Altman-founded Wordlcoin WLD/USD raked in major gains on a day when market heavyweights slipped lower.\n\nWhat Happened: NOT accumulated double-digit gains to emerge as the best-performing cryptocurrency in the last 24 hours. The coin, which is backed by top executives from Telegram, has more than doubled in value over the week, according to CoinMarketCap.\n\nNOT logged a trading volume of $928 million in the last 24 hours, with its market cap surpassing $1 billion.\n\nThe rally outstripped the broader market's performance as Bitcoin BTC/USD, Ethereum ETH/USD, and Dogecoin DOGE/USD traded lower as of this writing.\n\nCryptocurrency Gains +/- Price (Recorded at 10:00 p.m. EDT) Notcoin NOT/USD +17.06% $0.01071 Worldcoin WLD/USD +4.75% $4.89\n\nAlongside, biometric-based cryptocurrency, Worldcoin, rose significantly in the last 24 hours, with trading volume more than doubling to $525 million.\n\nWhy It Matters: NOT's exponential growth comes as users hop on to mine the cryptocurrency through the play-to-earn Web3 game hosted on Telegram. The game's cryptocurrency offerings have grabbed the attention of Telegram's massive user base.\n\nMeanwhile, WLD's gains snapped a losing streak, as the project launched by OpenAI Chief Sam Altman, faces opposition over privacy concerns. Worldcoin was asked to shut down operations in Hong Kong recently.\n\nCapital flows to altcoins indicated a healthy market trend in a year where Bitcoin’s market dominance has increased.\n\nIn an X post Wednesday, popular cryptocurrency analyst Michaël van de Poppe noted that Bitcoin was in a consolidation phase, while altcoins are bracing for their breakout.\n\nWhere are we in the cycle?\n\n\n\nWe're at the stage where #Bitcoin consolidates and #Altcoins are waiting for their breakout to come.\n\n\n\nTo me, the trigger is going to be the listing of the Ethereum ETF.\n\n\n\nFrom there, it could be going quite fast in a positive sense. — Michaël van de Poppe (@CryptoMichNL) May 29, 2024\n\nPhoto by stockphoto-graf on Shutterstock\n\nRead Next: BlackRock’s Bitcoin ETF Dominates Market with Nearly $20B in Assets: Report"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNcm5SeFpvZDBIZ3Y2ZEF5dzlTQVZXWnlOS29DVkZvQXdJWjNaUHFiajNKTzhyRjVwOFF5VXVtTzFraXRzVG9KbDFDc3dyT005cHg3RFlnRXJXNXQ2VjVWRHhpN3dra2pYdlZhWGhVUU5Ha0tXSXZjZlo1Y3BnVEZOUDZwNG15N0kxRzhFZ9IBkgFBVV95cUxNbm5WZUVqTzBiN0J0ZWdrS2pQemZPdVRRQzQ3QW5aLWN2RnNQTVNsRnBlOVdtZkJBRXVTLS1jWDZXVFNvNjJqc29QM2RMMEZCRXFKZUNDTFh3c1h5d1hSRi1LbUdVY0liS2JUSVpyQ2lIYjRhaXl3dWlXcnhHV2stNG5VelNzNG1XSzlLQTI2ZDZaQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "BlackRock Submits a Revised S-1 Form for its Spot Ethereum ETF - CoinGape",
        "content": "BlackRock has submitted an updated S-1 filing for its iShares Ethereum Trust, signaling a robust move towards the launch of a spot Ethereum ETF. This follows the Securities Exchange Commission’s (SEC) initial approval of Form 19-b last week.\n\nBlackRock Leads with New Ethereum ETF Filing\n\nThe SEC recently approved spot ether ETFs from major financial entities, including VanEck, Fidelity, and others, with BlackRock‘s iShares Ethereum Trust at the forefront. The amended S-1 document, a crucial step after the initial nod, has garnered attention for its detailed disclosures and BlackRock’s commitment.\n\nadvertisement\n\nThis update is pivotal as it comes amid preparations for a possible launch at the end of June or early July. James Seyffart from Bloomberg views this as a clear indicator of the ongoing collaboration between issuers and the SEC, emphasizing the market’s readiness for these financial products.\n\nErick Balchunas, a senior ETF analyst, also remarked positively on the developments. He noted on social media that the updated filing is a “good sign” for the industry, suggesting a sequence of events leading to the likely introduction of these ETFs in the market soon.\n\nHashdex Retreats from Ethereum ETF Race\n\nBlackRock has not only demonstrated its leadership during the Bitcoin ETF era but is now setting significant benchmarks with Ethereum as well. The recent filing details include information about seed capital investments, which are crucial for the ETF’s initial phase.\n\nOn May 21, 2024, an affiliate of BlackRock, referred to as the Seed Capital Investor, acquired 400,000 shares at a price of $25.00 each. This substantial investment underscores BlackRock’s confidence and readiness to lead in developing Ethereum-based financial products.\n\nThe company has announced that these shares will be listed under the ticker symbol “ETHA,” enhancing the accessibility and transparency for investors interested in cryptocurrency investments. This move is expected to strengthen BlackRock’s position in the market, offering a new avenue for investors to engage with digital assets through a regulated framework.\n\nHashdex recently withdrew its proposal for an Ethereum ETF, a day after its competitors received approval. The reason behind Hashdex’s decision remains undisclosed, highlighting the unpredictable and competitive nature of the ETF landscape.\n\nAlso Read: Solana Congestion Issues Poked As CME Puts Out SOL ETF Hopes\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxONW45RG1qXzkwWFhLYV9iUHFieDUzSm1pTjZ2Ty05dlhoZjEyUzBvY1FjS2RiSlQ5Z1M1Y193X0pKNmFLaHRaMGhqeEdOVmNuam55aWY4TGxoTXdhTlR6aEthVXZROHZXdUd1OWlRUExPOUhGMU1iMXg4cHJOWFkwRnVjZl9GeTVDdFM3eHpuTFk5c2hNTmhDczllaHBwaF9BWThwVVVB0gGrAUFVX3lxTFA4ZFFwanhXREtlUl9CRUk4blVnNTNlcTlOWVRFcHV3STdjZE1pVmF0YW12V3l5YWhOb1FvdGFfWmRobkJadTVTY2lzYTVuSWo1WEJqalJJc1prdmZpc0l5RWZneWxrM1VWbS1EYmdwUjRjREt3dWRhT3F0emNfRzRsUmpwMkVmU29TVndkb2dQRnBmR1REalM3VjlyV2RlWUoyR0RSQ24tVnRGZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Singapore’s Largest Bank Revealed as Ethereum Whale Holding $650M in ETH: Nansen - CryptoPotato",
        "content": "Blockchain analysis firm Nansen has identified DBS Bank, one of Singapore’s largest banking institutions, as a cryptocurrency whale.\n\nAccording to Nansen, a crypto wallet reportedly owned by DBS Bank holds 173,753 Ether (ETH), valued at around $650 million at the current market price.\n\nDBS Sitting on a $200M Profit?\n\nNansen’s analysis states that the address, flagged on May 30, has already generated a paper profit of $200 million from its Ether holdings.\n\nWe’ve identified this $650m $ETH Whale holding 173.7k ETH as DBS, the largest bank in Singapore with assets totaling S$739 billion as of 31 Dec’23 This address has made over $200m by holding ETH… 🤯 Track the address on Nansen here: 0x9e927c02c9eadae63f5efb0dd818943c7262fb8e pic.twitter.com/2rkM3cZ6gJ — Nansen 🧭 (@nansen_ai) May 30, 2024\n\nWhile DBS Bank has not officially confirmed ownership of the ETH, a community member suggested that the assets might belong to its digital exchange, which caters to accredited investors. They speculated that the bank holds the ETH on investors’ behalf rather than it being direct bank assets.\n\nDBS Bank is no stranger to the cryptocurrency sector. It offers various services, including digital asset custody, a trading exchange for security tokens, and a portfolio management app that integrates traditional and crypto assets.\n\nIn 2020, DBS Bank launched a crypto trading and custody service and a platform for conducting security token offerings. At the time, the bank emphasized that it would not hold any assets on the exchange but would provide custody services for investors. “All digital assets are kept at DBS Bank, which is globally recognized for its custodial services,” the bank stated. The services supported major cryptocurrencies, including Bitcoin, Bitcoin Cash, Ethereum Classic, and Ether.\n\nDBS’s Digital Currency Initiatives\n\nSince then, DBS Bank’s crypto sector has witnessed significant growth. In 2022, it reported a four-fold increase in Bitcoin purchases on its digital exchange, doubling total trades between April and June 2022. In 2023, it reported an 80% increase in Bitcoin trading volume, attributing this growth to the market instability following the crypto collapses of 2022.\n\nDBS has broadened its digital currency efforts beyond cryptocurrencies, engaging in government-related Web3 projects in Singapore like Project Guardian. This initiative successfully acquired tokenized Singapore dollars using tokenized Japanese yen.\n\nAdditionally, DBS is involved in Project Orchid for government vouchers and conducted a cross-border e-Chinese yuan transaction test for shipments between Singapore and India.\n\nFurthermore, its Chinese subsidiary, DBS Bank China, introduced an e-CNY merchant solution for businesses to accept payments in the central bank digital currency (CBDC). The bank also provides trading exchanges for security tokens and a portfolio management app catering to traditional and DeFi assets."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQWjVkNFg3OFNEQnpaRzc2OWlVbmxxZ1pxR3lTaFRCLVk4RDVCYXJkSzJqbkFnb2NSaG1aX1NnM1oyYmVGRHdUY1JPT3JJY3AwMkhQano4THFzcElfdUJJb0o5dG5LaFFUTWs0OVVxdWhCVlR3aEV4VTkyZ0N4N1pCby1LSUhSd2tjdXpSQmVXM3RsVVhZNFZ1TFJoQkxyYVFrVFAxLUJnMVYwMFlFSUlOVEZmY21GSGt5MmdqemFfb9IBxAFBVV95cUxNcXZPeVJ2d3diUms0emtCYWhXOVN4YUt1N1dYMGR2bzBSa3FNWGc0dlhLZTlvYk5qdFZKMnB3MmtYbGZrQTh4R2U4NUlXSVFrWWE5Z2lydjJadnRCNUFHcERTRWI0dUNsZ0VLSWpoQ3UwQ0k3aWl1ZUlDZ0hheGZ2YmF4Q3pWaTBDaGVVSkJhc2dMQUlWUXRENTcyaV9KV3BoVV9NR0pYUWlURlpHOU5ELWRRTmdqMWxZcUhMQXA0Z1lyZDRK?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Is ETH Primed to Take Down the $4K Resistance and Chart New All-Time High? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has been gaining bullish momentum recently after experiencing a correction in the last couple of months.\n\nWith the asset approaching its recent high, investors are hoping for new records, but breaking the $4,000 resistance seems tougher than expected.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nIn the daily timeframe, the price blasted through the higher boundary of the large descending channel a while ago. The market has been consolidating since, but there is no sign of a deep correction.\n\nWith the $3,600 area turning into a support level, the market will likely break through the key $4,000 resistance zone. In this case, market participants can be optimistic that a mid-term rally toward the $4,800 all-time high might begin soon.\n\nThe 4-Hour Chart\n\nThe 4-hour chart is also demonstrating some bullish signs. The price has been declining inside a bullish flag pattern this week. However, it seemingly breaks the flag to the upside, a classic bullish continuation signal.\n\nWith the Relative Strength Index also on the verge of rising above 50%, the momentum is also shifting in favor of a bullish move. Therefore, if things do not change drastically, it could only be a matter of time before the price breaks above the $4,000 resistance level.\n\nSentiment Analysis\n\nBy Shayan\n\nOpen Interest\n\nEthereum’s price experienced a rapid impulsive surge last week, nearing the $4K mark. This uptrend has sparked renewed demand and heightened buyer activity as traders chase substantial profits.\n\nThe accompanying chart highlights Ethereum’s open interest, a crucial metric for gauging futures market sentiment. Generally, higher open interest values are associated with bullish sentiment, while extremely high values can lead to increased volatility and potential liquidation cascades.\n\nThe chart reveals a steep rise in open interest alongside the recent bullish run. While this surge in open interest typically signals strong bullish sentiment, it also introduces potential volatility and the risk of sudden, unexpected price movements in either direction. Given the high open interest values and the inherent risks of heightened volatility, it is advisable for investors to manage their risk carefully in the short term."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQMkN2OGNYTXE4S3BMWXA5T1FiSEM3MWU4aUt2R3ZyVUhERG9xaXRKTDNpdTBTSEN6em5rN1FFM0RwME1oMlNkMV9GdzZfMmlqXzQ3R2QyMlk2dTlfT2Y1Yl9DZ1ZRaDNJVmV5M2RyNzRXeTdqNjd5MEZ1LVBfblJVeFZnWHlQeXNKZHYyUV9jblc3UXFxb0FMLVRtcVdjc05oWU5r0gGoAUFVX3lxTE5OWVlOa1h1OHBvUnRYeEZrTHpTU1ZpM3AtMGgwdjlZNHJwd1IxQzVlcEE4SDRGcTFqVXJoVFVJc0oxSnhFQ1dTc2RCYm9tc2tkR0RDXzNldm1hQWViSzVOM1lueHB5dXBXdGU2alJHS2V4MVpvRkVEU2t1V0lZVDJMWHJWa1BMeGxVd2tEeTRDLXRDOWRhc0V6WjVIU1V0TjVoMV9EQ0o0bw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum News: Largest Singapore Bank Bags $200M Profit With Major ETH Investment - CoinGape",
        "content": "The largest bank in Singapore, DBS Bank, has been identified as a significant player in the Ethereum (ETH) market, according to on-chain analytics firm Nansen. The bank holds nearly $650 million worth of ETH reserve. Moreover, it has made a gigantic profit of $200 million during the recent ETH price dally.\n\nDBS Bank Emerges As Ethereum Whale\n\nNansen spotlighted the news in a post on X as they identified the Ethereum whale to be DBS Bank. They highlighted that a blockchain address linked to DBS, holds an impressive 173,753 Ether. Furthermore, the analytics firm underscored that the reserve is valued at approximately $647 million.\n\nadvertisement\n\nThis revelation underscores the bank’s deepening involvement in the crypto investment space. The substantial holdings not only signify the bank’s confidence in Ethereum but also reflect its strategic investment in digital assets. In addition, Nansen highlighted that the DBS-associated address has generated over $200 million in profits from its Ethereum holdings, marking a notable success in the bank’s crypto investment strategy.\n\nMoreover, Singapore’s DBS that boasts an AUM of $546 billion (S$739 billion) has been steadily expanding its footprint in the cryptocurrency sector. The bank offers a comprehensive range of services, including digital asset custody, a trading exchange for security tokens. Furthermore, it has rolled out a portfolio management app that caters to both traditional and crypto assets.\n\nThis diversified approach positions DBS as a forward-thinking institution embracing digital transformation in the financial industry. The recent news of significant accumulation of Ethereum by DBS aligns with broader trends observed in the market as ETH whale accumulation has soared.\n\nIn a post on X, crypto analyst Ali Martinez noted that there has been a “notable increase” in the number of Ether addresses holding over 10,000 ETH. Martinez pointed out that the number of mega whales, defined as entities with holdings exceeding 10,000 ETH, has surged to 10, signaling a major spike. Moreover, this shift from distribution to accumulation indicates growing institutional interest and confidence in Ethereum’s long-term potential.\n\nAlso Read: Ethereum Price Forecast: $5,000 Target Impeding as BlackRock Submits S-1 Statement\n\nSpot Ether ETF S-1 Approval\n\nThe latest Ethereum adoption news came on the heels of the expected Spot Ether ETF S-1 approval. Earlier, on Thursday, May 23, the U.S. Securities and Exchange Commission (SEC) offered a regulatory nod to the 19b-4 filings for eight Ethereum ETFs, including those by BlackRock and VanEck.\n\nFurthermore, BlackRock recently updated its S-1 filing for the iShares Ethereum Trust on Wednesday, May 29. This signals a strong commitment to launch a Spot Ethereum ETF. Moreover, this move is significant as it aligns with the anticipated launch time frame of late June or early July.\n\nBloomberg’s James Seyffart interprets this update as evidence of the ongoing cooperation between ETF issuers and the SEC. It implies that an S-1 approval for these ETFs could be granted soon. Additionally, Bloomberg’s Senior ETF analyst Eric Balchunas also commented positively on this development.\n\nBalchunas shared on social media that the updated filing bodes well for the industry. He also hinted at a sequence of steps that could lead to the imminent introduction of these ETFs into the market. Earlier, the analyst spotlighted Ethereum ETF S-1’s potential approval date of July 4.\n\nAlso Read: Vanguard Receives Backlash Over Ethereum ETF Ban But There’s A Catch\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNamM3ZmNGczVScWhPMDNDR2VLazE3Rzd6QWVUUnlmV25KbjZMelZZdkxPamtKZl9iMGRzMEVpOXlyQWZBR0dhcEZpS3QtclRJeHBYU0cwSzRNazZwd2pkeWtHaWxkU21QNm9IcHBOUjdBZ3hZaVJZSzRmbUlWSlhPYXFqclA5OGJmeTVrMUNUS2VLODJIT3JiNC1LY3JhYjc2S24xXzZ5a3pINl9LLWRuV0ZjWGdlazF2NFNv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "The Bitcoin's smarter brother: an Octa's guide to Ethereum - Media OutReach",
        "content": "Decentralized finance: Ethereum-based applications aim to recreate traditional financial systems with blockchain technology. They provide services such as lending and borrowing cryptocurrencies without intermediaries, decentralised peer-to-peer exchange, and stablecoins (cryptocurrencies that are pegged to another asset to maintain a stable price, for example, USDT.)\n\nEthereum-based applications aim to recreate traditional financial systems with blockchain technology. They provide services such as lending and borrowing cryptocurrencies without intermediaries, decentralised peer-to-peer exchange, and stablecoins (cryptocurrencies that are pegged to another asset to maintain a stable price, for example, USDT.) Non-fungible tokens (NFTs): NFTs are unique digital assets that represent ownership of a specific item or piece of content. They are often used for creating and selling digital art. NFTs are also popular in gaming, where they are used to represent in-game items, characters, and virtual land. Some tokens, including 'Pudgy Penguins' and 'Mutant Ape Yacht Club' collections, even gained worldwide notoriety and were widely discussed in media.\n\nNFTs are unique digital assets that represent ownership of a specific item or piece of content. They are often used for creating and selling digital art. NFTs are also popular in gaming, where they are used to represent in-game items, characters, and virtual land. Some tokens, including 'Pudgy Penguins' and 'Mutant Ape Yacht Club' collections, even gained worldwide notoriety and were widely discussed in media. Decentralised applications (dApps): Ethereum supports a wide range of applications across various industries, including gaming, social media, and digital marketplaces. The most popular dApps include MakerDAO and Brave browser.\n\nEthereum supports a wide range of applications across various industries, including gaming, social media, and digital marketplaces. The most popular dApps include MakerDAO and Brave browser. Identity and authentication: Decentralised identity solutions leverage Ethereum to give users control over their personal data.\n\nNew consensus mechanism. A consensus mechanism is a protocol that ensures that a transaction is reflected in the blockchain as soon as it gets validated. With Ethereum 2.0, the ETH ecosystem switched from the proof-of-work (PoW) to the proof-of-stake (PoS) mechanism. Among other advantages, PoS is more secure, less energy-intensive, and better for implementing new scaling solutions compared to the previous architecture.\n\n\n\nA consensus mechanism is a protocol that ensures that a transaction is reflected in the blockchain as soon as it gets validated. With Ethereum 2.0, the ETH ecosystem switched from the proof-of-work (PoW) to the proof-of-stake (PoS) mechanism. Among other advantages, PoS is more secure, less energy-intensive, and better for implementing new scaling solutions compared to the previous architecture. Significant improvement in scalability and performance. Ethereum 1.0 had scalability limitations, handling about 15 transactions per second. That could lead to network congestion, resulting in high gas (fees required to successfully conduct a transaction or execute a contract) and slow transaction times. Ethereum 2.0 significantly increased scalability through the introduction of shard chains. Sharding divides the network into multiple smaller chains (shards), each capable of processing transactions and smart contracts independently, potentially increasing the network's capacity to handle thousands of transactions per second.\n\n\n\nEthereum 1.0 had scalability limitations, handling about 15 transactions per second. That could lead to network congestion, resulting in high gas (fees required to successfully conduct a transaction or execute a contract) and slow transaction times. Ethereum 2.0 significantly increased scalability through the introduction of shard chains. Sharding divides the network into multiple smaller chains (shards), each capable of processing transactions and smart contracts independently, potentially increasing the network's capacity to handle thousands of transactions per second. Increased overall efficiency of the network structure. While Ethereum 1.0 operates as a single blockchain where all transactions and smart contracts are processed by every node in the network, Ethereum 2.0 implemented shard chains alongside a central beacon chain. The beacon chain coordinates the network and manages validators, while the shard chains process transactions and smart contracts, distributing the load and increasing overall efficiency.\n\n\n\nWhile Ethereum 1.0 operates as a single blockchain where all transactions and smart contracts are processed by every node in the network, Ethereum 2.0 implemented shard chains alongside a central beacon chain. The beacon chain coordinates the network and manages validators, while the shard chains process transactions and smart contracts, distributing the load and increasing overall efficiency. Better security and sustainability. By switching to PoS, the ETH ecosystem reduced energy consumption by approximately 99.95%, making it a more sustainable and eco-friendly network.\n\n\n\nAccessibility limitations. Based on the proof-of-stake consensus mechanism, the Ethereum 2.0 blockchain requires interested users to own the native cryptocurrency before becoming validators, so they must buy ETH tokens using fiat currency or exchanging tokens from cryptocurrency exchanges. Users interested in becoming validators have to raise at least 32 ETH, which translates to about 50,000 USD, which is hardly affordable to most users.\n\nBased on the proof-of-stake consensus mechanism, the Ethereum 2.0 blockchain requires interested users to own the native cryptocurrency before becoming validators, so they must buy ETH tokens using fiat currency or exchanging tokens from cryptocurrency exchanges. Users interested in becoming validators have to raise at least 32 ETH, which translates to about 50,000 USD, which is hardly affordable to most users. Lack of decentralisation. The PoS mechanism can also lead to a lack of decentralisation. Since it relies on delegates chosen to validate transactions, it's always possible for larger nodes to overpower smaller ones. The large nodes could potentially control the process of selecting delegates and prevent smaller ones from participating, eventually making the PoS less decentralised. Some ecosystem users are concerned about the possible centralisation of power in case a small number of influential delegates or validators gain control over the authority to approve and validate transactions.\n\nThe PoS mechanism can also lead to a lack of decentralisation. Since it relies on delegates chosen to validate transactions, it's always possible for larger nodes to overpower smaller ones. The large nodes could potentially control the process of selecting delegates and prevent smaller ones from participating, eventually making the PoS less decentralised. Some ecosystem users are concerned about the possible centralisation of power in case a small number of influential delegates or validators gain control over the authority to approve and validate transactions. Hidden dangers. The PoS mechanism has a lot to offer compared to its predecessor, PoW, but it is still relatively new and untested. No one can tell if any yet-to-be-identified security challenges could arise in the future. With the relatively low entry cost, personalised attacks against eminent players can potentially decrease the blockchain's overall security.\n\n\n\nConclusion\n\nEthereum’s commitment to innovation is not limited to the PoS switch. The network is also exploring layer-2 scaling solutions and other upgrades to enhance its performance and user experience. This continuous evolution makes Ethereum an attractive platform for developers and investors, ensuring its continued relevance and growth.\n\n\n\nSome experts predict ETH will pass its current record peak as a response to the\n\nEthereum’s commitment to innovation is not limited to the PoS switch. The network is also exploring layer-2 scaling solutions and other upgrades to enhance its performance and user experience. This continuous evolution makes Ethereum an attractive platform for developers and investors, ensuring its continued relevance and growth.Some experts predict ETH will pass its current record peak as a response to the launch of spot ETF products in the US. This much-anticipated event is also expected to trigger price changes in the currency exchange market. With that in mind, those trading in Ethereum CFDs on investment platforms such as Octa may be able to capitalise on the predicted market movements.\n\nThe issuer is solely responsible for the content of this announcement.\n\nKUALA LUMPUR, MALAYSIA - Media OutReach Newswire - 31 May 2024 - With the current capitalisation of 468.42 billion USD, Ethereum (ETH) is the second-largest cryptocurrency network by market capitalisation after Bitcoin. As many experts point out, Ethereum is well-positioned to remain a crypto powerhouse for many years to come. What makes this digital asset so unique, and what drove its robust growth over the recent years? In this article, the experts at Octa, a financial broker with globally recognised licences, give a rundown of the ETH's impressive ascent in the world of cryptocurrencies.In the week ending on 26 May, the price of Ethereum (ETH) gained nearly 25%, rising as high as 3,900 USD. The 4,000 USD price mark, crossed last in March, is clearly in sight after the US Securities and Exchange Commission approved the listing and trading of spot Ethereum exchange-traded funds (ETFs). In the long-term perspective, the situation also looks highly promising for the ETH ecosystem as its prospects are buoyed by the growing adoption in various sectors and the strong developer community. Since becoming the second-largest cryptocurrency behind Bitcoin in 2018, ETH has maintained this position. But what makes it so successful in the highly volatile cryptocurrency market?The idea of Ethereum was born in the mind of Vitalik Buterin, a visionary entrepreneur and cryptocurrency enthusiast. He first became engrossed in blockchain technology in 2011 and two years later proposed his own blockchain platform, Ethereum, as a new type of digital environment that can go beyond financial transactions.The Ethereum project was crowdfunded in 2014, raising over 18 million USD in Bitcoin, and the network went live on 30 July 2015. While Bitcoin was created as a decentralised digital currency to serve as an alternative to traditional currencies, ETH aimed to extend the capabilities of blockchain technology.In comparison to Bitcoin, Ethereum offers a more versatile blockchain capable of supporting smart contracts, which are self-executing contracts with the terms directly written into code. The new blockchain allowed for revolutionary possibilities: users could build new cryptocurrencies based on Ethereum by creating an ERC-20 token, which is a technical standard for establishing fungible assets on the Ethereum blockchain. Many altcoins were created based this way, allowing for a wide range of applications. For example, one of the top Ethereum-based altcoins is Chainlink, or LINK—a decentralised Oracle network that allows smart contracts on Ethereum to securely interact with real-world data, APIs, and other external sources.The new versatile framework facilitated the development of various decentralised solutions. The existing practical applications of Ethereum include:On 15 September 2022, Ethereum introduced a new phase in the development and evolution of its blockchain by transitioning to Ethereum 2.0. The upgraded platform boasted the following advantages:The Ethereum ecosystem can expand almost indefinitely with various new applications mushrooming in different sectors. However, in practice, some significant bottlenecks impede this progress. The main concerns that Ethereum 2.0 might have to address include:"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQYVAtYVNfSmp6SzlWbnk3anV0YWl0WUozV3JhcEd5dmZrYjgxZGoyZnR6M19MOVZSTlJQX0V2ZTd5STJ4YmJkUjFRdFlwczBWZFB0SnJtb0I5ZGNNM3FrWDYtN0pNaWFFWDRMdkY1cW85MW1Jdm14clF6TVRtdEpjNGJKbHRkSk1W0gGOAUFVX3lxTFB4VTVsTktiVFJXOXRESk5PTHFfTllKX1FOSlNFUHNzTGFMUXByMV9xSngwYllfS2VzWUxEbUsxUFNxRzk0WHQ1blFXdUY2SFFwUDhFY1JfSjFIYmNhYUVPV3BNYW5uSnF2Y25tMUJ2LUNISjl4SEprSmNRZklwZVVBd0c1ZkZGY1hTbjdnREE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF speculations rise: A June debut on the horizon? - AMBCrypto News",
        "content": "BlackRock leads Ethereum ETF approval by updating Form S-1, marking significant progress.\n\nHashdex and Vanguard have either withdrawn their applications or decided against launching spot Ether ETFs.\n\nJune could see the final approval of Ethereum [ETH] exchange-traded funds (ETFs) as BlackRock becomes the first to update a key filing necessary for launch.\n\nThe United States Securities and Exchange Commission (SEC) issued a directive for various institutions interested in launching their Ethereum ETFs, to update their 19b-4 and S-1 filings.\n\nPreviously, the SEC approved the rule 19b-4 forms for eight Ether ETF applications, including those from BlackRock (BLK), Fidelity (FNF), Grayscale, ARK Invest, VanEck, Invesco Galaxy, and Franklin Templeton.\n\nBlackRock’s bold move\n\nOn the 29th of May, BlackRock finally updated its Form S-1 for its iShares Ethereum Trust (ETHA) with the SEC, nearly a week after the regulator approved its 19b-4 filing.\n\nCommenting on the same, Eric Balchunas, Senior ETF analyst at Bloomberg, noted in his recent post on X,\n\nAdding to the fray was James Seyffart, research analyst at Bloomberg, who said,\n\n“This is almost certainly the engagement we were looking for on the S-1’s following the 19b-4 approvals. Issuers and SEC are working towards spot Ethereum ETF launches.”\n\nHowever, not everyone took a step forward in the ETH ETF approval process. Hashdex, another issuer seeking approval for a spot Ether ETF, withdrew its application shortly after the SEC’s approval.\n\nA similar pattern was observed with Vanguard, as highlighted by Nate Geraci, President of The ETF Store in his latest tweet. He said,\n\n“No surprise, but Vanguard will NOT be offering spot eth ETFs on its brokerage platform…”\n\nWhat’s the price situation?\n\nAmid hopes of Ether spot ETF approval, ETH was trading at $3,769, reflecting a 2.45% decline at the time of writing.\n\nThis was further confirmed by AMBCrypto’s analysis of Santiment data on investor sentiment. The results indicated that negative sentiment was rising while positive sentiment was decreasing.\n\nOptimistic outlook persists\n\nDespite prevailing negative sentiments around Ethereum, Jaret Seiberg from TD Cowen’s Washington Research Group recently noted,\n\n“This (ETH ETF approval) comes about six months faster than we expected…yet this decision was also inevitable once the SEC approved crypto futures ETFs.”\n\nHe added,\n\n“The next step could be an ETF with a ‘basket of crypto tokens’.”\n\nTherefore, as we await the full and final approval of the ETH ETF, it will be interesting to watch the shifts in sentiment within the SEC, especially regarding SEC Chair Gary Gensler, who’s known for his anti-crypto stance."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPWTNLTDVLbmF1eG1xb3dVSTZST3VIdUN5a2xZV29LM2c4THRfT3BLU3lzZ0lNb3RBc2luNmMwRllIVWUzVFdNcnVWZ2ZLejZmRW4yRlRLNVlWb3VlZjVoS0pVNUl3TmF6djZqUlpRWm5ab2N6U2kxOE9QN3Z5alJWM2d6RjNtZTllSnVnZk45ZU40aVZNeVF4aVlwX3d5S1J0QklrU0xSQy1rUm5CMDBoMklKU2NSY1pDSHk1LVo5bjB1NVJqSElUWHNuRUI2aWs5b0hHUnI5MUpyYXA20gHiAUFVX3lxTE5VNWtUUFB6UWZMQlFjLTN2czFDa2RZMm9vLTJvT2hMSjJuc0dOQnVFbVREcUZ1QUJyaFBwNDlaQk9kd2pWeHlJYkM5dGtsaUNrYXJBZmxqTXZVeUFwYng2WjRhZkIyU2lQcmp6NFVmNzl1RGhQclVyeFlpUTlVMnZkZVIyejRtM3JybkxSeERrRmdCVjd5Z29Odk9jWHVxTVdWVW45ejBqb0VySnZhRF9ZWDljWVBuVVRrV0dkOW1acmo5b0o2RlUyZ1RWX2RVSHcwWloxUzBYMUZObE1yVllGd0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval boosts Bitcoin, says Michael Saylor; Raboo Presale soars - The Economic Times",
        "content": "The legitimisation of Bitcoin Exchange Traded Funds (ETFs) has had a positive effect on cryptocurrencies. So, it’s not surprising that an Ethereum ETF approval is towing the same line. It ushered in an influx of new investors, which boosted crypto token prices.Raboo ($RABT), a new kid on the block, is one of the biggest beneficiaries of this boost. Now, in presale, Raboo has raised an astonishing $1.5 million, which has been up 40% since its launch. Industry watchers expect $RABT to make a 100x gain before the end of the presale. That’s why investors are rushing it.Crypto enthusiasts always believed that ETFs would boost crypto adoption. They allow traditional investors to get exposure to the tokens without directly owning them.The SEC took almost a decade to okay the first Bitcoin ETF application. But once approved, it boosted crypto prices. Ethereum ETF applications didn’t take as long, and as expected, they’ve had a positive impact on the market.Crypto prices have soared significantly in response to this development. ETH itself appreciated by 12% and drew near $4,000, which is remarkable. The Ethereum ETF approval is expected to spur the market on, with ETH set to appreciate further.To Michael Saylor, Ethereum ETFs are good news for Bitcoin. According to him, they ‘serve as another line of defense for Bitcoin,’ and would make the blue-chip asset more stable price-wise.Michael Saylor also thinks the development would accelerate institutional adoption of Bitcoin. Going by history, this would further boost crypto prices. Bitcoin has been trading around $70,000 in the last seven days. . It’s a considerable increase when compared with its price action last year. The general feeling is that BTC will appreciate further and hit new all-time highs before the year runs out.Raboo is an enterprising new project primed to make substantial price gains, thanks to the Ethereum ETF approval. It infuses artificial intelligence with meme culture, birthing a dynamic space filled with engaged users. In essence, it provides a platform where crypto meme lovers connect, earn, and prosper.The ecosystem boasts NFTs, AI-generated memes, exclusive merchandise, and other mouth-watering rewards. Even more, the smart contract has been examined by leading crypto audit firm Solidproof. This guarantees security, eradicates worries, and puts investors' minds at ease.These unique offerings put Raboo ahead of the pack. Since it’s still in presale, there’s a decent chance it will appreciate significantly when it launches on exchanges. That’s why experts say it's poised to hit a 100x profit once the presale ends.As Michael Saylor fancies a BTC boom following recent Ethereum ETF approval, Raboo is primed for huge price gains. That’s because it offers several benefits for investors and has significant moon potential. It’s still in presale, and for $0.0042, you can partake in this movement and benefit from the impending 100x price gain.The above content is non-editorial, and TIL (Times Internet Limited) hereby disclaims any and all warranties, express or implied, relating to the same. TIL does not provide investment advisory services in any manner and the publication of this content does not mean TIL's or Economic Times endorsement. TIL strongly recommends the users to take all steps necessary to ascertain that any information and content provided is correct, updated and verified and/or speak with a qualified investment professional before making any investment decisions."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQVmlER3hYbnNOMm9pX1RUR2FMX0FlVksxZ29UZzJ6NER5MjUyOWZTMzhmZlFCcEV0VkMySlgwbU1HNXB6QU9SWlFWWkZJYy1qdm0xWFpOVGVQUl9sQkpPRTNnUTRGVV84UWJtV1g4Y1JXQnZBYzhVRy12LUtCOF9HVTU4SkpqcnhXUjAtdVByOE9yREt50gGaAUFVX3lxTE5UelB3MkJDSDVOd0hUazBlZG1xSm5Fa01FQzhvaGFncjE2U1JtNlZRWTBoVExjOTFLMHdWWE9iLUpRZXB3QzBhbzdmZGlKUGhCMjhWbkJCWk1BNVRYdmY1NWVPU1BiX0RCam4xcTEzZ3hZZHc2eGZJVnEtV1dzOGVFQjB5V0tzLTJabnlnY25sZ2ktWk1xZHdYcnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF staking: Novogratz sees shift in SEC’s stance in 2 years - AMBCrypto News",
        "content": "Novogratz expects US ETH ETF staking in two years.\n\nHowever, regulatory and Ethereum concentration risks still exist for ETH ETF staking.\n\nGalaxy Digital’s Mike Novogratz claimed that staking for US spot Ethereum [ETH] ETFs will eventually happen despite the current SEC’s stance.\n\nIn an interview on the sidelines of the Consensus 2024, Novogratz maintained that ‘you’d rather get a yield than not get a yield.’ When asked when such would happen to the US spot Ethereum ETFs, Novogratz said,\n\n‘’I would argue that within 12-24 months after the ETH ETFs without staking happen, they will change the rules and allow staking.’\n\nBloomberg ETF analyst Eric Balchunas estimated the approval of registration statements (S-1s) and the effective launch of the spot ETH ETF products by June or July. If so, Novogratz’s staking projection would be around mid-2025 or mid-2026.\n\nSEC’s staking stance and risks\n\nThe US SEC has always opposed crypto staking. Last year, Kraken settled with the agency for $30 million and shuttered its US staking operation.\n\nAdditionally, potential US spot Ethereum ETF issuers dropped previous ‘staking provisions’ on the 19b-4s forms before the SEC approved them on 23rd May. That indicated that the ‘staking provisions’ could have been compliance hurdles for the approvals.\n\nBesides, there have been worries that US spot ETH ETF staking could increase the Ethereum network’s centralization risks.\n\nAccording to an S&P Global report, ETH ETF staking could be positive and negative. On the positive side, S&P Global noted,\n\n“The participation of institutional custodians could reduce the current concentration on the Lido decentralized staking platform’\n\nDespite shedding part of its market share on ETH staking, Lido still dominated the market at 28%, followed by Coinbase at 13% and Ether.Fi at 3% amongst the top three leaders.\n\nOn the negative, the S&P Global warned that,\n\n‘It may also introduce new concentration risk, particularly if a single entity is chosen to stake the bulk of ETH included in these ETFs’\n\nHowever, according to a recent Bloomberg report, Hong Kong planned to approve the spot ETH ETF staking.\n\nAlthough there was no official timeline for the plan, market watchers believe it could bolster demand for Hong Kong’s spot ETH ETFs despite their lukewarm debut in late April.\n\nIt remains to be seen whether the US regulator will follow Hong Kong’s lead and make a U-turn on staking and its potential impact on the security of the Ethereum network."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQUmVaaEFwS1FIb1I5UjhrU0cxLVI4NzNlQ3RlSTdhSXRlNGx2WjUtdGhHQkY5LUZuZmczWEF0ZFMwMDF1VG5tNmdaVzF6QUVhMDBEQVFSU014UGlfQzZqbzZmeUhzUEZGTFhJWFZQRjVURFZIVDA1SEZNNVdtTWVsbtIBjgFBVV95cUxNUUt5U05GWmtPVUxMYUMxaFBvc0JjT09McEZZaEI0SWZuVms1NU9aeFQ1MWF1Wi10aTQySndubHRtaHZhMlVPZ2ItcmJKNDBKNzFaVzZrTVlabllkT0hZa0JMSVhkSGpycWU5Qm9CX1V6WEJXSjhJcDdZU1FaWjFmcUdJcjdIc0FQVk96RDB3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs: A Detailed Coverage - Analytics Insight",
        "content": "In all, Ethereum appeared from the start as being bent on doing more than merely enabling the direct exchange of value. It has been attempting to create a global computing network that will extend the applications of blockchain and cryptocurrency.\n\nLast week, it was seen that the SEC green-lightened several issuers' Form 19b-4 filings for spot Ethereum ETFs, which signifies significant progression for such outcomes to list on U.S. exchanges. Like the BTC futures and options spot Bitcoin ETFs that were listed in January, these new products may help bring access to the crypto asset class to a broader investor base. Even though this involves the usage of blockchain technology, Ethereum is a different network with different applications (Plate While Bitcoin at the moment is mostly an object to hold as a new form of money, an embodiment of digital gold, Ethereum is a distributed computing system that hosts a multitude of applications and is often referred to as a decentralized application store. New investors who are keen on this asset might wish to understand that Ethereum works on different fundamentals than many cryptocurrencies and also wish to uncover its competitive stance and the part it plays in the advancement of blockchain-based digital selling."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQcE5Fa09pLWZ0RUJiZW55eER4YVJFTVpGV0E1OFU5dFIwdEoxVzJBNjg0R2VEc1N0SWFCZDBLdk9CS2JrQ3cyZnJtWS05azhTR3hGUU9KeWY0anJsX3V5VVc1aXgxNkljQW1xdjJvSk0zNTc3WGJhTkp2ZmhBdzhwRjR0UzBpNklNcUVxaUluSFBOS1FEN1ZIX1Q3WmJpWGRFbFd5SHE0ZUp0Nms4UXRNT3Z6RGdtQ0UtZm0zQ3E2QUsyTXRTQWd3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Traders Rush to Invest in Ethereum (ETH), DTX Exchange (DTX), and Gala (GALA) as Inflows Hit Market - Techpoint Africa",
        "content": "Investors are getting excited about the crypto market again as it nears the highs again, especially with Ethereum (ETH), DTX Exchange (DTX), and Gala (GALA) drawing a lot of attention. As these coins grow, traders are eager to take advantage of their rising values. This wave of investment shows that people are gaining more confidence in these cryptocurrencies and believe they could bring in big returns, making them popular topics among traders.\n\nETH is trading near its high again and could be ready for the next leg. However, the Gala (GALA) is significantly down from the high; any fundamental changes can change the direction of the price. DTX Exchange is the leading emerging coin revolutionizing the trading and investing landscape.\n\nEthereum (ETH) Sees Inflow as ETF Approved\n\nThe recent approval of an Ethereum ETF (Exchange-Traded Fund) marks a significant milestone in the cryptocurrency market. The approval allows investors to gain exposure to Ethereum without buying the cryptocurrency directly. It is a crucial step towards integrating cryptocurrency into the broader financial system, offering more opportunities for individual and institutional investors to participate in the crypto market.\n\nAfter the approval, ETH surged more than 19% in a day and is now trading at $3,810. Currently, the RSI stands at 66, which is in the upper band, and MACD is also above the middle line, indicating strength.\n\nGala (GALA) Taking Support Near The $0.04 Zone\n\nGala is a crypto created for the Gala Games platform, focusing on blockchain-based gaming. It allows players to truly own their in-game items, giving them the freedom to buy, sell, and trade these assets. Gala's goal is to decentralize the gaming world by putting players in control of their gaming experience and digital belongings. As the platform expands, Gala is gaining popularity among gamers and investors, who are excited about the growing trend of play-to-earn games.\n\nIn the mini bull run that started in early February, Gala moved more than 300%. It showed a significant upmove that benefitted investors. However, in the recent correction, it is down more than 50%, now trading near the $0.045 zone. The immediate support is the $0.04 zone; the price has taken support from this level many times. The next strong support is $0.035 and the upside resistance is $0.05.\n\nDTX Exchange: A Potential Competitor To Traditional Exchanges\n\nDTX Exchange (DTX) is becoming a strong competitor to traditional exchanges and is gaining popularity for trading and investing. People are drawn to DTX because it offers lots of features and benefits. It has over 120,000 financial options, including cryptocurrencies, foreign exchange, stocks, and CFDs. This means traders can find everything they need in one place.\n\nOne big draw of DTX is its decentralized nature. This means users have full control over their money, unlike centralized exchanges, where there's a risk of someone else having control. DTX also attracts traders with its zero-commission policy, which means no extra fees for any trades.\n\nDTX is also known for being accessible and inclusive. It has low fees and welcomes traders of all levels of experience. This makes it appealing, especially for newcomers to the world of cryptocurrency.\n\nRight now, the presale of these tokens is in the second stage, and they're selling for $0.04 each. They've already gathered over $500,000 from investors in just a short time. So, if you're considering investing, now might be the perfect moment because, in the next stage, the price is expected to hit $0.06.\n\nLearn more:\n\nVisit DTX Presale\n\nRead Whitepaper\n\nJoin The DTX Community"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQZW1YWHFFMmFmcnlVYVNvMTZvWjJ4X1Z2LUh1WDFZTFZIcEJObHg3S2hnbkJieWNUQ092WjhKa1JWSzl0UTVFLVJDdVMyanhYOUVWLWhzVkdCN1lLdTctck9VOGIybHdLcl9YbjBGbHNmbWt3d1VHUFBlcnN5Xy1aejV30gGHAUFVX3lxTE53UnhIaXRFTFNCV3lvWEp4bWltMkotNjhYRHdwdUxMd0RUT19TMnlLaC1jRXJ5S1FJN282M2FpMnRndkNnYnVmVnB3ZlE1dlpQdzkyMS05UTdUTmRYRmlSUjgtTHJrR0RoQTFBeHU5dmRIUFVhdVlnODRTWDg4WmpJRHR2QzJuOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Ethereum whales dive into ETH at $3.7K – Will the market follow? - AMBCrypto News",
        "content": "Ethereum’s exchange reserve declined sharply on the 30th of May.\n\nMetrics suggested that ETH was in an overbought position.\n\nEthereum [ETH] enthusiasts got excited last week as the king of altcoins’ price once again exceeded $3.9k. However, ETH couldn’t hold its momentum and soon fell from that level. In the meantime, whales took the opportunity to stockpile more ETH.\n\nInterest in Ethereum is growing\n\nETH had a rollercoaster ride last week as it managed to go above $3.9k on the 27th of May. But bears arrived soon as its value dropped.\n\nIt was interesting to note that the ETH ETF approval couldn’t propel substantial growth for the coin over the last week.\n\nAccording to CoinMarketCap, ETH was down by over 1% in the last seven days. At the time of writing, the token was trading at $3,759.66 with a market capitalization of over $451 billion.\n\nWhile the token’s price volatility remained high, whales made their move.\n\nAli, a popular crypto analyst, recently posted a tweet highlighting that there’s been a notable increase in Ethereum addresses holding more than 10,000 ETH.\n\nThis increase in the number of addresses suggested that whales were moving from a distribution phase to an accumulation phase.\n\nAMBCrypto’s look at Glassnode’s data pointed out yet another metric that suggested a rise in accumulation. Ethereum’s balance on exchanges witnessed a major decline on the 30th of May, indicating high buying pressure.\n\nThe flip side of the story\n\nThough the aforementioned data suggested that investors were buying ETH, AMBCrypto’s look at CryptoQuant’s data revealed a different story.\n\nAs per our analysis, Ethereum’s net deposit on exchanges was high compared to the last seven-day average, hinting at a rise in selling pressure.\n\nOn top of that, ETH’s Coinbase Premium was red. This clearly meant that selling sentiment was dominant among US investors.\n\nA possible reason behind this could be ETH being overbought. Both ETH’s Relative Strength Index (RSI) and stochastic were in overbought positions.\n\nAMBCrypto then analyzed Ethereum’s daily chart to see how this change in buying and selling pressure might impact its price in the coming days.\n\nThe technical indicator MACD displayed the possibility of a bearish crossover. The Money Flow Index (MFI) registered a slight downtick.\n\nAs per Bollinger Bands, ETH’s price was in a highly volatile zone and was still resting well above its 20-day Simple Moving Average (SMA).\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nTherefore, if the price decline continues, then ETH might first plummet to its 20-day SMA before rebounding.\n\nNonetheless, the Chaikin Money Flow (CMF) looked bullish as it went northward. This might allow ETH to break above its resistance at $3.789k sooner than expected.\n\n\n\n\n\n"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNMkxHYnVLcjlmMU5vQUZTa0tnMWNhVzdZMV9yZjVWaGZkX3U4LWlvT013Y3RwaWpyeEktQk9LeTNQV25ydENPQUNDR0xra0tVMlc0UWFPZ01meFRRU3NMRHNHU2xwV0tDaFhDbUstT0xyVU5PVFVZejhiQVZBLXFvd3JDcTg5QdIBiwFBVV95cUxQV3RzSlduc0swQ1oyOEhvYURmckczNE9NSVBVTzh0OVRtY1JMZlZmSGpoSFZJaGVmYXpOT080VjJnbWVpck9wTW1TY2c1RV9kVHozbWoxczUwU0J4WTVCZlJrMXhEcHhGYWY2Y3E4bi1GY2FsUXdvM1VBY0hKSnBmNGhBYkVVX3Z2UGFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Will Ethereum ETF be a ‘distraction’ for Bitcoin? Exec says… - AMBCrypto News",
        "content": "June’s Ethereum ETF approval speculation shifts focus to Bitcoin’s price dynamics.\n\nPompliano and Saylor anticipate wider crypto adoption from an Ethereum ETF approval.\n\nAs the Ethereum [ETH] spot Exchange-traded funds ETF’s final approval looms, speculation arises: Will it impact Bitcoin [BTC] positively or negatively?\n\nWhen the SEC approved the rule 19b-4 forms for eight Ether ETF applications, Bitcoin and several other altcoins, including Ethereum, experienced notable declines on the daily charts.\n\nMarket reacts to BlackRock’s S-1 update\n\nNow, as BlackRock has updated its Form S-1, hinting at the possibility of the ETH ETF getting approved in June, everyone’s attention has shifted to Bitcoin’s price movement.\n\nAccording to CoinMarketCap, Bitcoin decreased by 0.57% at press time, post BlackRock’s progress towards Ether ETF. Additionally, Ethereum experienced a 2.70% drop in the past 24 hours.\n\nRemarking on the impact of ETH ETF approval on Bitcoin, Anthony Pompliano in his recent stream said,\n\n“I actually don’t think that ether’s ETF is going to be a distraction for Bitcoin.”\n\nPompliano further went on to predict broader crypto adoption in traditional finance because of ETH ETF approval. He added,\n\n“We are now going to see more capital flow into the overall crypto ecosystem on Wall Street.”\n\nPompliano isn’t alone\n\nInterestingly, Pompliano isn’t alone in his perspective. MicroStrategy Founder, Michael Saylor, shared similar sentiments in a recent interview where he noted,\n\n“Is this good for Bitcoin or not? It’s good for Bitcoin. In fact, it may be better for Bitcoin because we’re politically much more powerful, supported by the entire crypto industry.”\n\nThis emphasizes Saylor’s view that ETH ETF approval would play a pivotal role in legitimizing the entire crypto asset class.\n\nIt should be noted that despite his recent openness to ETH ETF approval, Saylor has historically been a staunch Bitcoin maximalist and critic of altcoins.\n\nA win-win situation\n\nIt seems evident that the general sentiment towards an ETH ETF approval remains positive in the crypto community and is seen as a win-win opportunity for the whole industry.\n\nPompliano put it best when he said,"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNRjJPSkJRaGR3T1FVNXVuLWRRREM5TzZWdnJyRjdpT1RDN2NYOUpwTDVrLTVqSjJ6NWtPdmRMdmJIY2dpNGZPdnVhNVNGNjZkazV4WENDb1d1aHg5ZEMwc0kxNnhWLVpnQ3NEUHQtLTQ5ak9Zd290aEVNLVp4Nk9TUNIBhgFBVV95cUxQRXVUdHVwdTJETl8tN1l4MndGczNhTnpfWHppWlk3LUhHaGI0ckE1Nm1VLVk3UU5zYUNLaHViVGQ0WVN1M0Z5VDBPYzdEWFlTX3FlWGZPbVdTT1drZTQwQTlNWE0tTm11M0EzT3ZLd1BsQ1BZMGRFMG1ZVFByMU11ckZQQzNxUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Checking Ethereum’s reaction to Circle’s $60M USDC burn - AMBCrypto News",
        "content": "Circle, the company behind USDC, pulled $60 million worth of USDC from circulation on the Ethereum network.\n\nActivity on the Ethereum network declined, the number of NFT trades on the network also fell.\n\nEthereum [ETH] witnessed a massive surge in interest over the last few days due to the hype around the Ethereum ETF.\n\nUSDC gets burned\n\nCircle, a company that issues the USDC stablecoin, permanently removed $60 million worth of USDC from circulation. They did this on the Ethereum blockchain network.\n\nCircle’s burning of USDC on Ethereum presents a double-edged sword for the network. On the positive side, fewer USDC tokens could translate to lower transaction fees and gas costs for all users due to potentially reduced network congestion.\n\nThis would be beneficial for everyone using the Ethereum network.\n\nHowever, there’s a potential downside for DeFi applications on the Ethereum network. These applications rely heavily on USDC for liquidity and stability.\n\nBurning USDC reduces the overall pool of USDC available, potentially making it harder for DeFi applications to function smoothly.\n\nThis could lead to reduced liquidity within these applications and increased volatility in DeFi markets, impacting users who rely on those services.\n\nEven though USDC is being burnt, other stablecoins such as DAI and USDT will not be impacted by Circle’s behavior and users’ interactions with other stablecoins will remain uninterrupted.\n\nState of the network\n\nIn terms of the state of the Ethereum network, it was seen that the number of daily active addresses had declined significantly over the last few weeks.\n\nGas used on the Ethereum network also slightly declined. One of the reasons for the falling activity on the network would be the waning interest in Ethereum NFTs.\n\nAMBCrypto’s analysis of Santiment’s data revealed that the number of NFT trades occurring on the network had plummeted.\n\nPopular NFT collections on the Ethereum network such as BAYC (Bored Ape Yacht Club) and MAYC (Mutant Ape Yacht Club) witnessed a significant decline in the floor price and the volume of NFTs being traded on the network.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nOther networks such as Solana and Bitcoin were leading the way in terms of NFT growth.\n\nIf this trend continues, it could impact the overall Ethereum ecosystem negatively. At press time, ETH was trading at $3,730.06 and its price had declined by 1.83% in the last 24 hours."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPYWZ5NndMWjBtQzR1aFpPVVdpcnBpOTNJTG9pZjV6RHB6d0pKRHlaS0lfaHV1MTNWZm84QUJWbWJNVTh6NmdxY1B0Si1nNDh6c1lMYXZLZngyd2hMZzBZWENqOENCQWo1ajFFUm9TbVlQUlZmNWx4dkw1b1pLbThIdjl2WkZlM21JWElxU1M4bWNSVERiNW9IMzRtMUpCaldqTFJ1cQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Ethereum or Solana? We asked ChatGPT-4o which web3 crypto is a better buy for 2024 - Finbold - Finance in Bold",
        "content": "As the summer of 2024 approaches, investors are closely examining potential opportunities within the cryptocurrency market, particularly focusing on the prominent Web3 cryptocurrencies Ethereum (ETH) and Solana (SOL).\n\nEthereum has recently gained traction with the approval of ETFs, boosting its market presence, while Solana boasts a Total Value Locked (TVL) of $4.795 billion, highlighting its growing ecosystem.\n\nThese digital assets have captured substantial attention due to their robust ecosystems, impressive year-to-date performance, and ongoing development activities. However, the prevailing market conditions have left investors deliberating which of these two cryptocurrencies will yield better returns.\n\nTo address this question, Finbold asked ChatGPT-4o which Web3 crypto, Ethereum or Solana, is poised to be the best performer in summer 2024. We used the following prompt with ChatGPT-4 to get the recommendation:\n\n“Which cryptocurrency, Ethereum (ETH) or Solana (SOL), is better for investment in the summer of 2024, considering each coin’s key attributes such as year-to-date performance, volatility, development activity, community support, market trends, potential for growth, and overall stability? Provide a detailed analysis, comparing both cryptocurrencies based on these attributes to determine the objectively best option for potential short-term gains and long-term value. Justify your answer with relevant data and insights”\n\nChatGPT-4o: Ethereum (ETH) emerges as the better investment option for the summer of 2024\n\nChatGPT-4 identified Ethereum as the superior investment option for summer 2024 primarily due to its more stable market presence, significant development activity, and recent ETF approval, which are likely to drive further institutional interest and long-term growth.\n\nWhile Solana (SOL) shows impressive potential, its higher volatility and shorter track record make it a riskier investment compared to Ethereum.\n\nKey attributes of ETH for summer investment. Source: ChatGPT-4o / Finbold\n\nObjective recommendation for summer investment. Source: ChatGPT-4o / Finbold\n\nEthereum price analysis\n\nETH 7-day price chart. Source: Finbold\n\nBased on a detailed analysis, Ethereum emerges as the superior investment option for both short-term gains and long-term value in summer 2024.\n\nCurrently trading at $3,760.20 with a year-to-date gain of 65%, Ethereum’s recent ETF approval and robust ecosystem position it favorably against Solana, which is trading at $165.60 with a year-to-date gain of 62%.\n\nFor short-term investors, Ethereum’s potential bullish trend makes it a safer choice. For long-term investors, Ethereum’s stability, extensive development activity, and strong community support offer significant growth potential.\n\nHowever, diversifying with a smaller portion in Solana can provide additional exposure to its high growth potential, balancing risk and reward.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQNzdpVGdOUDNQd2FRUVVhSXdPaFRpT3UxQ2ZaS2tPWFFtZHU1cVpzMnh4OTVGVDdGWGM3aHNUQlZKOXFBeTFIc080ZXltTG5QQS1iSUdHMUxrMktpMDZ2VzcxQ1JNZUFVWlVqX0NrMWFYUS1aZVptV05wZG52dVRtc1RRSHJneEd2a3M2WnBYYVF1ckpVUzgwN0Vn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction Post-SEC ETF Approval – Will 5thscape Step Up? - Coinfomania",
        "content": "Sandbox (SAND) has grabbed much attention by charging the existing financial sector’s development through its growth in the crypto gaming category. Analysts are predicting an economic upturn in July 2024 due to the anticipated adoption of the 5thScape project. These markets are also expected to bring the use of Sandbox to a new level in virtual environments, which will excite investors. They should also learn more about the charts before investing and follow every trade cautiously. Now, with 5thScape out front, Sandbox is set to transform the future of the play-to-earn category in crypto games.\n\n5thScape’s Ethereum-based virtual reality (VR) ecosystem is bringing a change into the world of blockchain gaming. Its immersive content and native broad-utility cryptocurrency token “5SCAPE” has crypto investors and entertainment-seekers excited about the future possibilities of the platform. As 5thScape is about to reach its $7 million presale raise in its 6th of 12 presale stage, it is receiving substantial global attention. 5thScape’s brand value is set to outshine the Sandbox platform.\n\nA Look Into 5thScape’s VR Ecosystem\n\nThe 5thScape platform has different types of VR-compatible content including VR games, VR movies, learning videos, VR animations, and more. It lets platform users explore their choice of entertainment options in a new and immersive way. The ERC-20 token “5SCAPE” gives 5thScape’s users unlimited access to its content hub.\n\n>>Click Here To Visit 5thScape Presale Page\n\n5thScape’s team is working on turning it into a “mixed reality” platform by adding augmented reality features.\n\nFurthermore, they plan to enter new categories in their VR content options as well, like medical training, enterprise training, and a marketplace for VR content developers where they can offer their creations. The developers will be able to earn the platform’s “5SCAPE” tokens for their content, which can be exchanged for real money. 5thScape’s team has divided the project’s launch into 4 phases. Each quarter of 2024 has something new for the platform users and investors of “5SCAPE tokens”.\n\nSince we are now in the 3rd quarter of the year, we can expect the project to surprise us with many new announcements. 5thScape recently made an announcement on their X handle (@5th_scape) about a new feature – a leaderboard for investors of the 5SCAPE token. Its spin-the-wheel feature to get an extra discount on the token’s purchase is a piece of thrilling news for new investors.\n\nVR Blockchain-Gaming: A Revolution by 5thScape\n\nThe platform’s latest gaming launch – the “Cage of Conquest” MMA fighter VR game has helped it get attention in the online gaming community. Its other gaming titles, “Thrust Hunter,” “Epic Cricket Arena,” “Archery Master,” and “Immersive Kickoff”, are currently in the pipeline and will be slowly rolled out. Gamers can use the “5SCAPE” token as a digital currency within the VR games available on the platform to get in-game content and exclusive upgrades. These upgrades and contents can make their gaming experience better.\n\nThis is one of the reasons why regular gamers who are not active cryptocurrency investors have chosen to become one so that they can enjoy the VR gaming experience of 5thScape. Investing $500 or more in 5thScape’s presale stage can give you lifetime free access to its gaming zone. There are more bonus rewards on investments made in multiples of $500.\n\nFuture of 5SCAPE & VR Technology’s Growth Momentum\n\nExpert crypto investors consider 5thScape’s presale as the perfect opportunity to make an investment in the future of immersive entertainment. VR technology’s user adoption is growing fast. While currently, only 1 in 5 Americans have access to VR accessories, the ratio will soon increase as VR headsets become easier to purchase. The 5thScape project itself has launched two important physical VR accessories: the “Ultra HD VR headset” featuring high-resolution visuals and perfect movement tracking and the “SwiftScape VR Gaming Chair” for maximum comfort.\n\nA reputed organization – Grand View Research predicted the CAGR of VR technology to jump to 27.5% in 2030 from 2023. There is no doubt that 5thScape will use its first-mover advantage and its large VR library to grab a large share of this modern technology’s new user base.\n\nBoth Sandbox (SAND) and 5thScape (5SCAPE) projects will give high returns to their current investors in the coming times as VR technology’s usage becomes more common. Those looking for a way to build wealth through the growth of the VR industry should add these two projects to their cryptocurrency watchlist.\n\n5thScape will be a more prominent leader in this space as the Sandbox platform’s virtual universe has become a bit boring for gamers. The VR ecosystem of 5thScape is going to attract a larger audience base due to its variety of content options and secure Ethereum-based blockchain network that promises privacy and transparency with transactions. Get ready for lucrative returns with 5SCAPE once the project gets listed on the famous crypto exchange. The crypto gaming sphere will not be the same once the 5thScape project’s gaming titles are popularized within online gaming communities."
    }
]