[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxNTXNqT2NfWXlCdTZoVjU2SlhLaWMxdUtDWDF5XzM4UE5rVE1Xd0F6bUo0Ri1wZEFnUUp3S3hJUjBPOFJIUllIZ3dxcjZka0tLdlZ2VlV1RVBvTlpPczRraFJPTWktQUVXYlZmRUNCUjg2Vm5XUjdBN0dxZmJiYlRHV1ZsOHlObHpVTTlvVi1WbUxPVFFrVWczMDR6RHVOUUs0VWd5ZnUta3BINWl2MFBmd2JuX2hPdlZMS1hMbmhPUXktMEc1SmlCelVFVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Cryptocurrency Market News: Bitcoin Briefly Slips Below $60K, SEC Drops Ethereum Probe - Investopedia",
        "content": "Key Takeaways The bitcoin price has continued its month of suffering, as the price briefly dipped below $60,000 on Monday.\n\nFormer bitcoin exchange Mt. Gox has announced distribution of funds owed to former customers will begin in early July.\n\nThe Securities and Exchange Commission (SEC) closed its investigation into Ethereum without filing charges against blockchain technology firm Consensys.\n\nCrypto asset manager Hashdex has filed for a combined spot bitcoin-ether ETF.\n\nThis week, analysts will be watching to see if bitcoin can halt its decline while also keeping an eye on Thursday's U.S. presidential debate.\n\nJune hasn't been kind to bitcoin: The price of the cryptocurrency briefly slipped below the $60,000 level Monday after it looked like it could surpass the previous all-time high of more than $73,000 earlier in the month.\n\nThe most recent negative news for bitcoin comes in the form of a coming distribution of bitcoin owed to former customers of defunct bitcoin exchange Mt. Gox, which is estimated to involve as many as 140,000 bitcoin coming onto the market.\n\nThat said, the past week hasn't been all bad news for crypto, as the U.S. Securities and Exchange Commission (SEC) concluded its investigation into Ethereum and blockchain technology firm Consensys without filing any charges. In addition, crypto asset manager Hashdex has filed for a spot crypto exchange-traded fund (ETF) that will focus on diversification.\n\nMt. Gox Repayment Plan Causes Bitcoin Jitters\n\nThe defunct bitcoin exchange Mt. Gox announced it will begin the long-awaited process of returning assets to its customers in July, over a decade after it filed for bankruptcy following multiple hacking incidents. The total amount of bitcoin to be distributed remains uncertain, with estimates ranging from 65,000 to 140,000 bitcoin, potentially valued at up to $9 billion.\n\nWhile some investors worry that the influx of these bitcoins could depress prices, others argue that the potential selling pressure may be overstated, noting that creditors have had years to sell their claims if they needed funds urgently. The announcement of the impending Mt. Gox repayments caused bitcoin's price to briefly dip below $60,000 Monday, continuing its downward trend for the month.\n\n\n\nAccording to data from Farside Investors, spot bitcoin ETFs have now suffered their largest outflows over a two-week period since U.S. spot bitcoin ETFs were approved in January, with investors pulling out a net $1.1 billion from these funds over that timespan.\n\nSEC Closes Ethereum 2.0 Investigation\n\nOn June 18, blockchain technology company Consensys announced that the SEC's enforcement division has concluded its investigation into Ethereum 2.0. Despite the closure, the SEC's stance on whether ether, the native token of the Ethereum blockchain, qualifies as a security remains ambiguous.\n\nAccording to Consensys, the regulator began its investigation into Ethereum last year and the company sued the SEC early this year, claiming that Ether was a commodity and that the SEC lacked jurisdiction to investigate.\n\nWhile the SEC's chair, Gary Gensler, hasn't definitively labeled ether a security, the Commodity Futures Trading Commission (CFTC) considers it a commodity. The investigation's closure could indicate the SEC leans toward treating ether as a commodity, although the SEC's future actions remain uncertain.\n\nAccording to Fortune, Consensys’s legal battle with the SEC will continue despite the recent announcement. The conflict originally stems from the SEC's scrutiny of Consensys-owned crypto wallet MetaMask, particularly its token-swapping capabilities and staking access. The SEC contends that these functions constitute unlicensed brokerage activities involving unregistered crypto asset securities. Consensys indicated that while the closure of the Ethereum 2.0 investigation is a win, it doesn't fully address the broader regulatory issues.\n\nHashdex Files for Combined Bitcoin-Ether ETF\n\nWith spot bitcoin ETFs already trading in the U.S. and spot ether ETFs seemingly right around the corner, the next development could be a combined ETF featuring both leading cryptocurrencies. Hashdex, a crypto asset manager, is spearheading this effort with a recent filing for the Hashdex Nasdaq Crypto Index US ETF.\n\n\n\nIf approved, this ETF would be the first in the U.S. to directly hold both bitcoin and ether. According to Nasdaq's filing with the SEC, the ETF will track the Nasdaq Crypto Index (NCI), which is weighted by market capitalization. Coinbase Custody and BitGo are set to serve as custodians. The ETF aims to provide a passive investment strategy, offering investors exposure to the market's overall performance. Hashdex already has a similar product in Brazil.\n\n\n\nWhile the new ETF initially will focus on bitcoin and ether, the filing leaves room for the inclusion of additional crypto assets in the future, provided they meet regulatory criteria. Bloomberg analyst James Seyffart noted that the final decision from the SEC on Hashdex's application is expected by early March 2025.\n\nWhat To Expect in the Markets This Week\n\nCrypto market analysts will be watching the bitcoin price closely this week, hoping for signs that the bleeding will stop, especially in the context of high bitcoin ETF outflows and the upcoming Mt. Gox distributions.\n\nHowever, some market watchers, such as Custodia Bank founder and CEO Caitlin Long, say the bitcoin price decline isn't something to worry about in the context of the recent halving event. \"It’s normal for a price dip like this to happen after a halving—halvings are incredibly bullish, but bull markets don’t start until typically several months later—for fundamental reasons,\" Long posted on X.\n\nAll eyes will also now turn on Thursday's U.S. presidential debate between Joe Biden and Donald Trump, as conversations about cryptocurrencies find momentum on the campaign trail.\n\nFormer President Trump has changed his stance about bitcoin, now seemingly supporting the cryptocurrency without making any definitive regulatory or policy-related comments for digital assets. Due to the SEC's aggressive enforcement actions during his administration, President Biden, by extension, has not been viewed as crypto-friendly—an image that his campaign is trying to dissociate from him, although there are no specifics on crypto policy from that camp, either."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPLWhJeGNPbFZnR0ZaWC1iWkFkZ3VFNFJZR0l2UkJkc2F5N0JuM2o1OU5qbTh3bUNSS3p5bnUzUlM3WG1yMnFRMWZqUFR3R0V0d3ZWWkhPOXhVbnNSSkd2V21ldUtnT29BejFNTEFGQ1ZRdXlJWXFtWkZ2UVNuYjZoWEc0NU1CT29IYjg40gGQAUFVX3lxTE9JZXJ5TW5VQW9VcHl2SFFyX3hnTVF6MnFtanhFVmRwU1A1UVl1eVB4aWxGdG5seENxYzlfemp5SUFvbmdzM1d2Y1hfeFFhaXRQLVBZd2FCckZUQWxYLWhrb01TMnk2bVEtNlBZLUdsMW9nTmVFV1pobWFfWmgtTENaMnFyY1NaaVdaVFlvSEZGdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval This Week? Nate Geraci Believes It Is Possible - U.Today",
        "content": "In what could be a pivotal development, anticipation is mounting as experts speculate on the imminent approval of spot Ethereum ETFs. For example, Nate Geraci, the president of ETF Store, has sparked discussion on X by suggesting that approval could come next week.\n\nAdvertisement\n\nGeraci's prediction aligns with the sentiments of industry insiders such as Bloomberg's Eric Balchunas, who foresees an ETF debut as early as July 2, strategically timed to coincide with the U.S. Independence Day holiday.\n\nI’m deciphering this as spot eth ETFs will be approved this week…\n\n\n\nJust me tho. https://t.co/rFrMThytgC Advertisement June 23, 2024\n\nMoreover, former SEC official Jay Clayton echoed the prevailing industry sentiment, reinforcing expectations for imminent approvals.\n\nWhen, not if\n\nThe Ethereum ETF saga unfolds against a backdrop of growing institutional interest in the crypto market, particularly BTC and ETH as two major assets.\n\nCurrently, the SEC is reviewing revised proposals from major asset managers, including VanEck, BlackRock, Grayscale and Invesco Galaxy Digital. These filings, which follow recent updates to their S-1 reports, had also disclosed a management fee in particular.\n\nInterestingly, amid the buzz, Hashdex, a notable player in the ETF arena, has withdrawn its application for a spot Ethereum ETF without disclosing reasons or future plans, but presented a mixed Ethereum and Bitcoin solution.\n\nFor now, all eyes remain on the SEC's upcoming decisions, which could mark a significant milestone in the integration of crypto into the TradFi markets. With speculation high and anticipation building, next week promises to be a potential turning point for Ethereum ETFs."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9fcWJQUVhPcFNXY0h1VDhCdi04V3BGMDJ4aTJpa1I0OXZlZG56b2RIWUNvSjZ6UU9JTDIzV21ONDlCaXdDTTdHZjJaYVYwQWpSdEdKVXhOYl9XUVJ3OEJIY3FJYUlVMkdHalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Who Holds The Most Ethereum (ETH) in 2024? - Benzinga",
        "content": "SHORT ANSWER: The Beacon Deposit Contract has emerged as the dominant force, holding a staggering 38% of all ETH.\n\nEthereum, the world's second-largest cryptocurrency by market cap, continues to power decentralized applications and fuel innovation. But who are the whales holding the vast majority of Ethereum? In 2024, the landscape of major ethereum holders might have shifted. This guide dives into the latest data, revealing the key players — from individual investors to institutional giants — who control the most ETH. Join us as we unveil the hidden forces shaping the ethereum ecosystem and explore the potential implications for the future of this dynamic cryptocurrency.\n\nWho Owns the Most Ethereum?\n\nWith the recent ethereum merge transitioning the network from Proof-of-Work (PoW) to Proof-of-Stake (PoS), a new player has emerged as the biggest ethereum (ETH) holder: the Beacon Chain Deposit Contract. This contract allows users to stake their ETH on the Beacon Chain, the foundation of Ethereum 2.0. This shift to PoS likely explains the Beacon Deposit Contract's significant holding, currently sitting at over 46 million ETH, representing a whopping 38% of all ether. This translates to a staggering value of approximately $165 billion at the time of writing. Essentially, users have locked their ETH in the contract to contribute to the security and validation of transactions on the Ethereum network.\n\nTop 10 Ethereum Holders\n\nLet’s explore the top 10 Ethereum holder of current times:\n\n1. Beacon Deposit Contract\n\nThe Ethereum Merge to Proof-of-Stake (PoS) created a powerful new dynamic with the Beacon Deposit Contract. This contract lets users stake their ETH on the Beacon Chain, the core of Ethereum 2.0. This explains the Beacon Deposit Contract's massive holding — over 46 million ETH, a huge 30% of all Ethereum! Worth roughly $165 billion, users essentially locked their ETH to secure and validate ethereum transactions.\n\n2. Wrapped Ether Contract\n\nWrapped ether (WETH) plays a key role in Decentralized Finance (DeFi) applications. Since regular ETH isn't compatible with these platforms, WETH acts as a “wrapped” version that functions as an ERC-20 token. This allows users to seamlessly use their ETH on DeFi apps like Uniswap. Notably, the value of WETH remains identical to regular ETH, offering increased functionality without impacting price. Interestingly, the WETH contract holds a significant amount of ether, currently sitting at over 2.84 million ETH, making it the second-largest holder in the network.\n\n3. Binance 7\n\nBinance, the world's leading cryptocurrency exchange by trading volume, is also a major Ethereum (ETH) holder. Surprisingly, just three of its main ETH addresses (Binance 7, 8, and 28) collectively hold over 3.2 million ETH, making them the network's third-largest holder. These addresses manage exchange functions and bridge ETH between Binance Smart Chain (BSC) and Ethereum. The bridged ETH resides in the “Peg Tokens” address until it's withdrawn back to the Ethereum network.\n\n4. Arbitrum: Bridge\n\nArbitrum, a popular ethereum scaling solution, is emerging as a significant ETH holder. This technology allows users to interact with decentralized applications (dApps) and deploy smart contracts on a faster and cheaper network compared to Ethereum's mainnet. At the heart of Arbitrum lies its bridge contract, currently holding over 1.8 million ETH. This positions the bridge as the network's fourth-largest ETH holder. As Arbitrum gains traction due to its cost efficiency, this holding will likely increase further.\n\n5. Robinhood\n\nRobinhood, the popular trading app known for its commission-free stock trading, also holds a surprising amount of Ethereum. Despite some past controversies, Robinhood is the 5th largest individual holder of Ethereum, with nearly 1.4 million ETH under a single wallet address. This means Robinhood is a major player in the ethereum world, holding a large amount of this cryptocurrency.\n\n6. Kraken\n\nDespite facing SEC charges related to staking options, cryptocurrency exchange Kraken ranks as a major Ethereum holder. Their “Kraken 13\" wallet alone holds over 850,000 ETH, making it the 6th largest individual holder. Given Kraken's high trading volume, they likely hold even more ETH in smaller amounts across other wallets, though these wouldn't be on the top 100 individual address lists.\n\n7. Base: Base Portal\n\nNewcomer Base Portal is making waves in the Ethereum world. This project acts as a bridge, allowing users to move their ethereum (ETH) between different blockchains easily. Interestingly, Base Portal holds a significant amount of ETH, currently ranking as the 7th largest individual holder with over 504,000 ETH. This substantial holding suggests Base Portal might play a vital role in the Ethereum ecosystem, but it's still too early to say for certain.\n\n8. Bitfinex 19\n\nAnother major exchange by volume, Bitfinex, stands at 8th position and holds a significant amount of ETH scattered across five top 100 addresses: Bitfinex 19, MultiSig 3, 20, 15, and 5. These collectively hold around 2 million ETH. Two addresses likely serve trading and exchange functions, while the “MultiSig 3\" address might be their secure cold storage wallet due to its multi-signature nature.\n\n9. Gemini\n\nThe Gemini exchange, founded by the Winklevoss twins, is a major ethereum player. Their single wallet address ranks 9th largest holder, containing over 369,000 ETH. This positions Gemini as one of the top exchanges for holding ether, showcasing their confidence in this cryptocurrency.\n\n10. EthDev\n\nThe nonprofit ethereum Foundation oversees Ethereum's development. ETHDEV, a separate group of developers in cities like London and Berlin, acts as the project's development arm. As Ethereum matured, other organizations like ConsenSys joined the ecosystem to tackle specific areas. This division of labor allows focused development and benefits the entire ethereum network. Interestingly, ETHDEV holds over 309,000 ETH, ranking 10th among the largest ether holders.\n\nThe Largest Holders are Contracts, Not People\n\nThe landscape of major ETH holders has shifted significantly in 2024. The Beacon Deposit Contract, a product of the ethereum merge, has emerged as the dominant force, holding a staggering 38% of all ETH. This reflects users' commitment to securing the network by staking their ETH. Wrapped ethereum (WETH), crucial for DeFi applications, sits at number two with over 2.8 million ETH. Major cryptocurrency exchanges like Binance and Kraken are also major players, holding significant amounts across multiple wallets. Interestingly, newcomer Base Portal and the Winklevoss twins' Gemini exchange showcase the growing involvement of diverse players in the ethereum ecosystem. While the distribution of ETH ownership highlights its decentralized nature, the Beacon Deposit Contract's dominance underscores the critical role users play in securing the ethereum network.\n\nFrequently Asked Questions"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNcEl4c3JmcGNpWTFLQmQxREZDSUdKSGdnM0c3WjAzRXoyX2xndjVEbFpueURxRTZ3Zkpha0lNbVJyNVhKaFM5V3JSQk50VmM0S1NYa3lzLUJTTlBkY1lacnB4OHlhazRzeHRXejlaSDYyaFNFR2hybzRnSVpmc0h5NERfamdKV1NLczZnOHJLQlg5d0lVbzBuZGtnTlF6T1VQYnFvNThQSE45dGZtMU5YSVp6ZEdhSGs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Ethereum: The Emerging Blockchain Powerhouse Transforming the Music Industry The Hype Magazine: Unveiling the Pulse of Urban Culture - From Hip Hop to Hollywood! Explore a Diverse Tapestry of Stories, Interviews, and Impactful Editorials Spanning Fa - The Hype Magazine",
        "content": "Ethereum: The Emerging Blockchain Powerhouse Transforming the Music Industry\n\nMost of us have heard of Bitcoin even if we don’t quite know what it is, but a similar Web3 decentralized platform called Ethereum just made news, and is perhaps more important to music artists and the recording industry as a whole.\n\nThis is because Ethereum is one of the easiest blockchain platforms to use by technology developers, and because of this, has become one of the most popular software platforms involved in new music technology companies such as Infanity. When Ethereum is used to develop software, it can also include the use of cryptocurrency known as ETH, similar to Bitcoin, which is another cryptocurrency.\n\nSo for music technology companies built using Ethereum, such as our company Infanity, someone can buy music and/or other products not just through regular credit card transactions, but also by purchasing with ETH. Since the price of ETH goes up or down more frequently than the US Dollar, a music fan could also buy music at a cheaper rate when ETH goes down. A music fan can also make money because if the price of ETH goes up, the digital collectible you bought could go up, and so you would see a profit when you sell the collectible.\n\nAlso, with blockchain technology, there is also a record of any purchase that can be seen publicly through various channels. So for a music fan or a music artist selling their music on a platform like Infanity using Ethereum, that means you could actually prove you were an early supporter and fan of a new artist, and that an early “edition” could grow in value over time.\n\nThe recent news on Ethereum was that for the time being, the Securities and Exchange Commission will not pursue trying to determine whether Ethereum is a security that would have to be regulated. This means that companies built on Ethereum to sell digital collectibles are still in the clear the same way selling paintings at live auctions are just collectibles and not regulated. Ethereum is here to stay.\n\nWritten By: Renata Lowenbraun"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiqAJBVV95cUxPazN5bFhjdjgtVVF5YjUzc09wbWlMS0tndjJGdVExcXBUTVI3dmJCdW1ET3pHSGFuV0lORlhiXzQxWHotWk5TdW4zSnZucEZDX3FrbDN2QmprN3BsZzNTWWJrcnU4bTI2QUcyeXJMYUh4UHNXOXNIb2todzRDNkVXeGt2dUd3ZjY3cGJ3bDY1NDR6U2IweWo4SXgtdFRVdWVNbGdPeTRJYzlwcXdjWE5yQ29hQmJwWU1sU2Q0VmRaa01iSnVHZ1locjRxdXFvYnRaSXNoM3piSE1kVWRNUGVxOGFBUGhjUlNqV3QtUTJuWWdaTk8yNEF6bEpuaHBPYmFfMThFZDhlbk5FSUpmcXdUaWFaTnJoYUR3UFphUlJzeXp2VFlUUGl0OA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Will Ethereum Spot-ETF Approval Trigger A 30% Ether Price Drop? Bitcoin And Other Crypto-Related Stocks Reacting Negatively in Premarket Amid Fears - Markets Insider",
        "content": "Crypto-related stocks including Coinbase Global (NASDAQ:COIN), MicroStrategy Inc. (NASDAQ:MSTR), Marathon Digital Holdings (NASDAQ:MARA) and others showed subdued reactions to Nate Geraci, president of The ETF Institute, anticipating approvals for spot Ethereum (CRYPTO: ETH) this week. However, analysts are deliberate about how the ETF would impact ETH price.\n\nWhat Happened: The launch of spot Ether exchange-traded funds (ETFs) could potentially lead to a 30% drop in Ether’s price, warns Andrew Kang, founder and partner at Mechanism Capital. Kang suggests that Ether’s price could plummet from its current value of $3,410 to as low as $2,400, CoinTelegraph reported on Monday.\n\nAt the time of writing on Monday, Coinbase was trading at 3.70% lower at $217.50 after closing at $225.86 on Friday, while Robinhood Markets, Inc. (NASDAQ:HOOD) was trading 1.97% lower at $21.85 after it closed at $22.29 on Friday. Similarly, Marathon Digital was 5.15% lower since its close at $19.21 and was trading at $18.22 while MicroStrategy was trading 5.68% lower at $1,399.50 after Friday’s close of $1,483.76. Riot Platforms, Inc (NASDAQ:RIOT) also reacted to the conversation by trading 3.87% lower at $9.180 during pre-market.\n\nKang expressed his skepticism about the potential benefits of an Ether ETF in a recent post. He stated, “How much upside would an ETH ETF Provide? I would argue not much,” predicting a price range of $2,400 to $3,000 post-ETF launch.\n\nKang anticipates that spot Ether ETFs will attract only 15% of the flows that spot Bitcoin (CRYPTO: BTC) ETFs have seen. This is in line with the 10–20% range estimated by Bloomberg ETF analysts Eric Balchunas and James Seyffart.\n\nSee Also: Trump’s Niece Says SCOTUS Desperate To Give Ex-President Campaign Boost With Its Delay Tactics: Proves ‘H\n\nHowever, not everyone agrees with Kang’s predictions. Industry analyst Patrick Scott expects a similar directional movement to how the spot Bitcoin ETFs have performed, but he doesn’t foresee Ether’s price doubling. Meanwhile, asset management firm VanEck projects that spot Ether ETFs could drive Ether to $22,000 by 2030.\n\nKang also raised concerns about Ethereum’s future as a cash flow “machine”, suggesting that Ethereum may resemble an overpriced tech stock. He also noted that the removal of staking from the proposed spot Ether ETFs might deter investors from converting their spot Ether into ETF form.\n\nWhy It Matters: The launch of spot Ether ETFs has been a topic of discussion in the crypto world. Nate Geraci, president of The ETF Institute, had earlier anticipated approvals for spot Ethereum ETFs, potentially shaking up the cryptocurrency market.\n\nIn a post on X, formerly Twitter, Geraci predicted that spot ETH ETFs would be approved, stating, \"I’m deciphering this as spot ETH ETFs will be approved this week…Just me tho.\"\n\nGeraci's views were consistent with his forecast two weeks ago when he stated that he would be shocked if spot ETFs did not receive green signals before the end of the month. \"No reason for delay,\" he had said.\n\nThis also follows a controversial political shift that led to the SEC's approval of spot Ethereum ETFs last month, a narrative that has been called into question after President Joe Biden vetoed a bill aimed at overturning SAB 121.\n\nRead Next: Trump Reportedly Makes Decision On VP Pick, Says Running Mate Will Be At Debate\n\nImage via Shutterstock"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNNVIxbWpSN0wyLXA5eDhtWTQxWjBsM2YzRFAxdlBJLW5vQTVpUzUyS1dlMTdBZTRncjRfRFFBSG5VSWJqbnc0cUU3TXMyLVp0QUZELXd3Q2ZlMXdoSHR0c0J2OC11R1ZtY2JvTXpRMHhiMU9sMEJOOGYwUUpkZkpMV3IzZGI0cEVIbGN0QmFaTEQ0TVAzd0RPZ19XU08tR1hITl9KcDExdnJLdkx3MGJoNXdFSmxxNDF4UXhsRC1RakUxUXhq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Will Ethereum Price Rebound After Crashing to 1-Month Low? Top Experts Weigh - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNZ2ZxbktyX096OEsyeTViOHplMzUzQUtjR1JEa05wRnMwLTBuM21ER1R1ODRsb3BzMUxIT2hkUUNGTVByem5Rdk55eFRQRUZKVjVocGF5MlRZMnh6TGFfbDV1RXVoWHpQOVRxdnlfMUw5WnNkZ2ZYeFdqMmxDUFNCY2J0cXAzVmJjeF9IcXpQRlBRREhXWXRlS2tsMWRXOXZLRHRPWG9IbHdLUFBEbFN0RDhJa0JtSG11VWR5dkRISGNSR3RacHJxZVNXcW1TOEZac0l0LWk2cm0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "The SEC, Ethereum, and the American political landscape with Joe Castelluccio, Partner at Mayer Brown - Mayer Brown",
        "content": "Joe Castelluccio, Mayer Brown partner and co-leader of the firm’s Fintech and Digital Assets groups, spoke with Fintech.TV on June 21 from the New York Stock Exchange. Joe discussed drivers of market appetite for crypto assets, a timeline for spot ether ETFs, recent SEC actions regarding ether’s status, and the digital assets horizon for the second half of 2024.\n\nView the full interview on Fintech.TV."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPdUJIWEdEV0ZRaHNkYlE3MzRZS1Z1TEZCeXhhbUx6Z1NYV29YRjR2VlFQZWFuYk0wT2hxNThjQTBnOE1nd0xlTUcxTlY2NnZoLWlJYV80T2JTYmgwUlktZ3diRDlTSmNyN09aVkwtRURobGU5dGpYa1Yxdjdzb0Zzcl83QldTdnh4WVllSmtBajZPWHNFNWdpS1Q1WGFpcE5UQVJwel9GTWY3RDVobXR5Z1RwUHJCelJZSnBQMHY0MXQ0bFo5V1psSDdxS1_SAdIBQVVfeXFMTVJwdzJQcGt6elNWYjVUaHRXczNOTWFQdUNMbTM3NFFyVHV3MmZsdWh0YjBqeDNZbjFmYUNGVlkxVWxXcmVhY0k4VTRMWi0wdnV5OTEtXzY2eFF1WnNjMEU5NmJUd0hTSmdRX1Rxcmx4aWd3OXZhQTBQNzBOYW8zVGhWZEUxa2JlMDAwc241dXVXNTNJRUxaZ2MxMkZXdUozSWZwb3Y4blZRbWcyOTBTX2JLamZIT1U5X1dWSDUtb05uZjJROFRKYXpreng3a2phQ3NB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Indicator Suggesting Ethereum Winding Up for Move to the Upside, According to Analyst Jason Pizzino - The Daily Hodl",
        "content": "A closely followed crypto analyst says that the top altcoin Ethereum (ETH) may be gearing up for a swing to the upside.\n\nIn a new video update, crypto strategist Jason Pizzino tells his 329,000 YouTube subscribers that one indicator suggests the leading smart contract platform is gearing up for rallies.\n\nAccording to Pizzino, ETH’s average true range (ATR) – an indicator that measures volatility by showing an asset’s trading range over a specified period – is hinting at an approaching breakout.\n\n“Ethereum [is] looking pretty good – putting in lower highs and higher lows at the moment. We have covered the average true range as another signal that the market is winding up for another move to the upside.\n\nSo we’re watching the ranges of the bars contract and they typically go dead for several weeks, maybe even months, but as we get towards the end of the bull market, these periods get shorter and shorter.”\n\nLooking at the trader’s chart, he seems to predict that Ethereum’s ATR will fall as ETH trades within a triangle structure. A triangle is typically seen as a continuation pattern where an asset witnesses price compression before a big move in the direction of the prevailing trend.\n\nPizzino goes on to say that traders should be on the lookout for Ethereum’s ATR as he says ETH may abruptly fly and leave them sidelined.\n\n“And that is where things get very wild – if you’re not in, that can destroy your portfolio because you’re trying to get in and it just takes off without you…\n\nAt the moment for ETH, everything still looks on track and it’s playing ball with the other strong altcoins.”\n\nEthereum is trading for $3,502 at time of writing, a marginal increase during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNQkRjXzBTamRWbWEzYVFyRDdQaU5kSVEycXpDOHdKSUxpYVRZa01SejhCZklJOVU0OExFZF9iUHRGbGRRUjVvdzRnUU16ZUFtUGpqcUtYYWNJN2w0VGU5NFNndHRPSVh0bXhOTWFiZTRHbmVZUWdSMTVnUkc3YmFsSE92QTRONXhIemMyamIwbUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Gas Fees At ‘Rock Bottom’ as Network Activity Soars - Unchained",
        "content": "The average gas fees on the Ethereum mainnet dropped under three gwei as transactions across the layer 1 and layer 2 protocols are at an all-time high.\n\nMedian gas prices on Ethereum have dropped to their lowest level in years despite soaring network activity. Data from Dune compiled by @hildobby shows that mainnet gas prices dropped below three gwei on Friday for the first time since early 2020.\n\nGas prices are the cost to conduct a transaction on Ethereum. In dollar terms, the drop in gas prices equates to performing a swap on Uniswap for $1.06, trading an NFT on Seaport for $1.49 and transferring ETH on chain for $0.23, according to data from GasFees.io. When transacting on a layer 2 network like Base, which incorporates “blob” transactions, fee levels are reduced even further. A Uniswap swap on Base costs $0.0016 in fees, a Seaport trade costs $0.0021 and an ether transfer costs $0.00026.\n\nAccording to Pistachio.fi founder Brian Smocovich, the lower levels of fees on the network are not the result of a slowdown in transaction activity, but rather, the effect of a more efficient fee market.\n\n“Ethereum volume per day is the same if not higher than 6 months ago. L1 [layer 1] fee market is now more efficient because of L2 [layer 2] volume and EIP-4844,” said Smocovich on X.\n\n“The L1 gas market is now more efficient because most volume is on L2s, L2 -> L1 settlement is 100x cheaper than pre-4844, and we have the gas market efficiencies of EIP-1559,” he added.\n\nHe noted that gas is at “rock bottom” while network activity is at an all-time high, citing data from L2Beat which shows that layer 1 and layer 2 protocols recorded an average of 299 transactions per second on June 21.\n\nThe flip side to gas fees sinking is how it impacts the supply dynamics of the network, specifically, Ethereum’s burn rate which is now at a 12-month low.\n\nEIP-1559, introduced via the London hard fork, introduced a base fee tied to usage that would be burned or removed from supply. With a lower amount of fees to burn, ether’s supply has turned slightly inflationary and sits at a growth rate of around 0.56% a year, according to ultrasound.money."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNZ19vQnMtSHc3ZTVodkREbnlfUk5TSXQ5bm9VWFpDZlMtVU1ZZW1ZSGx0UlI5Q0VBUndPY3dvYkZqdGdMNHhTNEhlWVppS1dFMEQwcjhhbmZVZExRLWozVlJ5b2puMUNDV1lqTDduSGhzbmNDU1hibHNDa3AtM0FCRF83MGhlcDk10gGOAUFVX3lxTE9wRURBTGRacVJLMHhVN283a3RrTlh4bXJVZFlGZUVTaklEdmhwQjluVmVGaE91TG5wbEVWNUlrMHJyWDJYMURKWkZkcTJOZ3F0REs5UkVhZ2tCUjhXQmZHTkUwQjhYWmQ2WGFEalVzcy1SVkpfaE1KNDFPZEV2elp5NklnSXVWSFFFZDYwX3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Could Ethereum ETFs lead to ETH’s downfall? Expert weighs in - AMBCrypto News",
        "content": "Spot Ether ETFs may reduce Ethereum’s price to as low as $2,400.\n\nInstitutional interest in Ethereum is less compared to Bitcoin, affecting ETF conversion rates.\n\nAs Ethereum [ETH] trails Bitcoin in performance, its price has seen a 5.1% decrease over the past 24 hours, bringing it to a current valuation of $3,315.\n\nThis recent downturn in price reflects broader market trends and investor sentiment. Despite this fall, analysts foresee a further drop potentially driven by new financial products entering the market.\n\nAndrew Kang of Mechanism Capital speculates that the introduction of spot Ethereum exchange-traded funds (ETFs) could push Ethereum’s price down to as low as $2,400.\n\nETH ETFs to drive down Ethereum’s price?\n\nThe rationale behind Kang’s prediction lies in the comparative lack of institutional interest in Ethereum as opposed to Bitcoin.\n\nThe founder of Mechanism Capital disclosed that the absence of strong incentives for converting spot ETH into ETFs, coupled with unimpressive network cash flows, presents a challenging outlook for Ethereum’s immediate future in the ETF market.\n\nThese factors may contribute to Ethereum’s struggle to maintain its market price in the face of evolving market structures and investor preferences.\n\nAdditionally, the potential influx of ETH into the ETF landscape is estimated to attract about 15% of the flows that Bitcoin ETFs have garnered, based on extrapolations from Bitcoin’s ETF performance.\n\nInitial data indicates that spot Bitcoin ETFs attracted around $5 billion in new funds within six months of their launch.\n\nApplying these figures to Ethereum, it is projected that Ethereum-based ETFs might see approximately $840 million in true inflows during a similar timeframe.\n\nConcerning this, Kang expresses skepticism about the alignment between the crypto community’s expectations and traditional financial (tradfi) allocators’ preferences, indicating that the market may have already “priced in” the effects of the ETF launch.\n\nChallenges in market perception\n\nFurthermore, the conceptual pitch of Ethereum as a decentralized financial settlement layer and a base for Web3 applications carries potential. However, according to Kang, current data suggest that it may be a challenging sell.\n\nParticularly, the reduction in network transaction fees due to decreased activity in decentralized finance and non-fungible tokens has shifted perspectives, possibly likening ETH to overvalued tech stocks in terms of financial metrics.\n\nAdditionally, according to Kang, the recent regulatory green light for Ethereum ETFs was somewhat unexpected, giving issuers limited time to craft and disseminate effective marketing strategies.\n\nHe added that the removal of staking options from the ETF proposals could further dissuade investors from converting their holdings, impacting the anticipated influx of capital into these funds.\n\nConcluding the insight, Kang noted:\n\n“Does that mean ETH will go to zero? Of course not, at some price it will be considered good value and when BTC goes up in the future, it will be dragged up with it to some extent. Before the ETF launch, I expect ETH to trade from $3,000 to $3,800. After the ETF launch my expectation is $2,400 to $3,000. However, If BTC moves to $100k in late Q4/Q1 2025, then that could drag ETH along to ATHs, but with ETHBTC lower. “\n\nAre there bearish signs from ETH?\n\nIn light of Andrew Kang’s pessimistic view on Ethereum, it’s worth examining Ethereum’s fundamentals to validate these concerns.\n\nData from CryptoQuant reveals a worrisome trend in one of Ethereum’s key metrics—there has been a notable increase in Ethereum deposits on exchanges, suggesting a potential rise in selling pressure.\n\nThis indicator aligns with IntoTheBlock’s data, which shows a significant reduction in large ETH transactions (those exceeding $100,000).\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nThese transactions have decreased from over 10,000 late last month to under 4,000 as of today.\n\nDespite these bearish signs, a recent report from AMBCrypto highlights an uptick in Ethereum’s daily active addresses, adding a layer of complexity to the market’s dynamics."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQY1JqdkFYT08xa0FpWHc2VkE1ZVdLVXZjdURpWXBwSWZyQjFPampONldRMGwyMFMwWDVvOWRSb2swYlhfUVY1UU1GYUQyMVhuRzBmSGNUUmtFekZxV2RCNTBxVjNuYjROd0VWS0htWFY2aENrcmxZNC1mR2pXZzIzR3A2UHJHUnFfQXRZRUtMb9IBlAFBVV95cUxPQS0xSV9zQklJek8teG94eld2cHNKaFVDSlVnSmZ0ZnZ2eTRWdG9GRDc3dmFrSC1qMTQ1bktoWUtWdHMtOVp1d1FOTkFHOEdEUkRZUnduNDBBOTRHaDd6QW9IdzExTTA3aW9CejJycU0yaFdmbTRZcm5NZEVMT3lUSTFHUHlNSzdoLTZMVHZzRUw0RERW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Justin Sun Bullish on Potential Ethereum ETF Approval? Data Suggests So - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nThe tounder of the Tron blockchain, crypto billionaire Justin Sun, has acquired yet another large ETH lump as he may be expecting the SEC to grant permission to launch spot Ethereum ETFs at the start of July.\n\nLast year, Sun already bought more than $1.1 billion worth of Ethereum, according to the recently shared analytics data.\n\nJustin Sun scoops up more ETH\n\nAnalytics account on X (formerly known as Twitter) @spotonchain spread the word that more than eight hours ago, the owner of cryptocurrency wallet -0xdbf (@spotonchain believes it to be the founder of Tron Justin Sun) transferred a large amount of Ethereum from Binance. It happened while ETH traded at $3,472. This ETH chunk was valued at $16.07 million at the time the purchase was made.\n\nThe above-mentioned data source shared that over the last three days, the same wallet belonging to the Tron creator bought (at an average price of $3,494) and withdrew from Binance 13,967 ETH worth almost $49 million.\n\nAdvertisement\n\nWallet 0xdbf (likely #JustinSun) withdrew another 4,629 $ETH ($16.07M) from #Binance at $3,472 ~8hrs ago.\n\n\n\nOverall, in the past 3 days, this wallet has withdrawn 13,967 $ETH ($48.8M) from Binance at an avg price of $3,494.\n\n\n\nFollow @spotonchain and set alerts for the wallet now:… https://t.co/ozvNN9KVhL pic.twitter.com/eTbffY7b0H — Spot On Chain (@spotonchain) June 24, 2024\n\nA few days ago, @spotonchain shared with the crypto community that Justin Sun had made a massive Tron-USDT deposit (89.57 million coins) to Binance and spent $32.9 million of that amount buying more Ethereum, which he later withdrew to his wallet.\n\nIn another tweet today, @spotonchain suggested that Sun may be “bullish on the rumored launch of the Ethereum Spot ETF” next week.\n\nEthereum ETF approval expected on July 2\n\nAs reported by U.Today, on Friday, the spot Ethereum ETF emitters updated their S-1 filings to the SEC. Among the details made public, Franklin set its Ethereum ETF fees at 0.19%, while VanEck’s fees were announced to be 0.2%. Besides, BlackRock revealed that it has had $10 million worth of future Ethereum ETF shares bought in advance by a major undisclosed investor.\n\nPrior to this, Consensys spread the word about the securities regulator shutting down its investigation into the mechanisms of Ethereum 2.0, thus rejecting all the rumored U-turns to calling ETH a security. This pivot made the chances of seeing a spot Ethereum ETF approved grow stronger.\n\nThe anticipated date of the SEC announcing its positive decision on this is July 2, according to Bloomberg analysts."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOSzRYQW9IZnktdnJvWEVGT18ySmNvbkNaOFZ4aHBiLWJJTkY1Z0h5TFJXVEd5bkVfM096YlZpSy1aR19KU0FZRmpxNXFSbEF1ZkhCNV80bDA4VnY1RFk5cTRiLWN6a3dRVXlrdVpZdlhURVphMmxlVEo2UFBDVE4zZzBTdThYazJmSTV5dmtOMV9fdkN1TXNZVEVudW8tTzV3cWlVQUtzRW1vdUo2dHU0M9IBtgFBVV95cUxQV1ZKd1pyUjRWa1c3UWVWVWMyTkRTYUx2eTgyazV4cHhmSFZFc1dqWGM5bDVhaENndVJPM053MnczdEFWMG5mNjQwMGtVWm5tbTM5endtUFJ1RkFCR1hFOHNDdWFmQUZOV0dFNFNpZGZLdE5sSkRNd0U1Vlh5SUJhZkstZEhHVnkxWFQ2VEFOT1BLZTlGUmZNc0l2OHNtQUl0czdSdHpzRURnY3NPbF9CZUxuMUhKUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Solana (SOL) Set to Skyrocket to $150 Again, Ethereum (ETH) Huge Gains Ahead? Massive Reversal Pattern Formed, Shiba Inu (SHIB) Stealth 20% Surge - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nSolana could be aiming at the $150 price threshold once again as the price starts showing reversal potential after reaching the 200 EMA. The trend flattening is often one of the first signs of an upcoming price reversal. However, it is important to stay cautious as in the midterm, Solana is still in a downtrend.\n\nThe SOL/ETH chart indicates that Solana has been steadily declining over the last several months, but there may be a shift in store as of late. The price has bounced back somewhat after touching the 200 EMA, which has served as a support level. This suggests that bullish momentum may be developing.\n\nNear the oversold area at about 35 is where the RSI is currently trading. This could mean that buyers are about to intervene and that the selling pressure is lessening. The MACD histogram also exhibits indications of a possible bullish crossover. An increase in purchasing activity is indicated by volume analysis, which may be good news for Solana.\n\nGiven the large uptick in volume bars, it appears that traders are beginning to stockpile SOL at these lower price points. Despite these encouraging indicators, it is critical to recognize the difficulties Solana may encounter while recovering.\n\nAdvertisement\n\nEthereum's reversal potential\n\nEthereum could be forming a ground for a price surge as the second-biggest cryptocurrency enters the falling wedge pattern formation in addition to relying on the 50 EMA. At this technical threshold, Ethereum could easily perform a reversal.\n\nThe falling wedge pattern is usually interpreted as a bullish reversal pattern indicating that an upward movement may be approaching and that the downtrend may be coming to an end. According to Ethereum's recent price action, the pattern's peak, which typically comes before a breakout, is getting closer. The blue line on the chart, the 50 EMA, has served as an important level of support. The fact that Ethereum's price has repeatedly rebounded from this level suggests that there is significant buying interest in this vicinity.\n\nEthereum's chances of a bullish breakout from the falling wedge pattern are greatly increased if it can hold this support. The relative strength index or RSI is currently trading close to 46, suggesting that Ethereum is neither overbought nor oversold.\n\nEthereum has the freedom to rise from this neutral position without being under a lot of selling pressure. Volume analysis indicates that buying activity is gradually increasing, indicating that traders are starting to accumulate Ethereum at these prices. The possibility of a bullish reversal is further supported by the fact that this accumulation phase frequently comes before a notable price movement.\n\nShiba Inu's last hope?\n\nDespite the enormous 25% price drop we saw on Shiba Inu, there is still some hope for a reversal at around $0.000018. However, a quick glance at the trading volume of Shiba Inu clearly shows that it is not the most favorable asset on the market right now.\n\nRecently, Shiba Inu's price dropped by 25%, indicating a significant decline. SHIB is now at a critical support level at $0.000018 due to the drop. This stage may serve as a possible turning point in the event that buyers intervene. Nevertheless, SHIB's trading volume has been comparatively low, suggesting that there isn't currently a lot of buying interest.\n\nOne significant element that could impede a speedy recovery is this low volume. Right now, the relative strength index (RSI) is circling the oversold area. This can suggest that a reversal is imminent and that the selling pressure may have been overdone. Nevertheless, a reversal cannot be ensured by the RSI alone — higher buying volume is required.\n\nResistant moves have been made by the moving averages, especially the 50 EMA. In order to verify a reversal, SHIB must make a significant volume breakout above these moving averages.\n\nEven though the Shiba Inu market is currently difficult, there is some hope because of the support level at $0.000018. We could witness a 20% increase if SHIB can maintain this support and return toward the moving average.\n\nAn important role is also played by the larger cryptocurrency market. SHIB may benefit if Ethereum and Bitcoin begin to rebound."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQMHhnRUsyNFFqdUVzVUNkd29rSEhWR2xyNUlIdnNNampLc01xRlp6blo0REpiYWVZZDNOQlRyWkJkbUdJS0xkRGVkX0ZKTXRWcGtnYUFnOGJicHY1dUh0dWZkUHkwNmFaZUw1a0Ywd3pMTmx6ZzI3ZTM5MFZ6Q0hGemVGZE1pem9XaVc5TkViRWZuVVZGUDFQRldncGNQRW1QcV9QdjlBRkJEZENXRGR0ODZSZlctUlQwNkxPQ0VsMlFnbnhLVkZHb3ZYVE14Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Securities and cryptocurrencies: The SEC drops the Ethereum case, but continues to pursue Ripple - The Cryptonomist",
        "content": "The latest news from the crypto market talks about new developments in the respective cases of the SEC against Ripple and Ethereum in relation to the security token issue.\n\nThe federal agency of the United States has definitively abandoned all investigations on the Ethereum Foundation, determining that ETH does not fall within the definition of security and thus preparing for the asset’s entry into U.S. exchange-traded funds.\n\nIn the meantime, the dispute against Ripple continues, with the SEC requesting a fine of over 100 million dollars, awaiting the resolution of the case at the trial that will determine once and for all if XRP should be considered a financial security or not.\n\nAll the details below.\n\nThe SEC concludes investigations on ETH: everything ready for the launch of spot ETFs\n\nAccording to recent reports from the cryptographic developer Consensys, the SEC is about to drop all investigations into the Ethereum Foundation, first initiated in March 2023 with the intention of classifying ETH as a security token.\n\nAs reported within the post “Ethereum has survived the SEC” and now the insiders of the well-known blockchain of smart contracts will be able to build freely without having to worry about regulatory limitations.\n\nThis very important milestone for the sector comes after Consensys had sued the SEC on April 25, only to renegotiate with the agency on June 7, requesting the case to be closed.\n\nETHEREUM SURVIVES THE SEC.\n\n\n\nToday we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0.\n\n\n\nThis means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nETH no longer considered a financial commodity, after 6 years in which the SEC has repeatedly changed its mind on the matter. Initially, in fact, in 2018 it expressed opposition to this connection, only to return to accuse the issuers of the currency of selling unregistered securities after the chain’s consensus mechanism transitioned from PoW to PoS.\n\nTo tell the truth, even Gary Gensler, chairman of the Commission, has never given a clear and precise definition regarding Ethereum, while he had expressed himself in a much more convinced manner for other cryptographic products such as those offered by Ripple, Cardano, and Dash.\n\nDuring a testimony to Congress last year, he indeed refused to answer the question of whether ETH fell under the definition of security and if it meets the requirements of the Howey Test.\n\nJUST IN: 🇺🇸 SEC Chair Gensler refuses to answer if Ethereum $ETH is a commodity or a security while testifying before congress. pic.twitter.com/IkDTgNrfix — Watcher.Guru (@WatcherGuru) April 18, 2023\n\nNow that the SEC has closed the investigations on Ethereum, we can officially prepare for the listing of the cryptocurrency in the spot ETF markets in the United States.\n\nThe Securities and Exchange Commission had already approved this kind of financial products with underlying ether in May, but the S-1 applications of the registrants were not given the green light.\n\nThe landing of exchange-traded funds for ETH could now be very close: indicatively the listing is expected by the beginning of autumn but it could also arrive in the coming weeks.\n\nThe asset managers like BlackRock, Fidelity, and Bitwise are getting ready by starting to release the first promotional videos of the next investment offering, implying that it is only a matter of time before Ethereum makes an appearance on Wall Street.\n\nUnlike Big Finance, Ethereum doesn't clock out at 4 p.m. pic.twitter.com/0gCJi3wlXp — Bitwise (@BitwiseInvest) June 20, 2024\n\nDespite the victory against the SEC in a historic lawsuit, Consensys warns that the broader web3 sector could still be under the watchful eye of the federal agency.\n\nAs reported in a post from last week:\n\n“The closure of the Ethereum investigation is important, but it is not a cure for the numerous blockchain developers, technology providers, and industry participants who have suffered under the SEC’s illegal and aggressive cryptocurrency enforcement regime.”\n\nThe SEC abandons Ethereum, but continues the case against Ripple: the 100 million dollar fine\n\nOne of the cryptocurrency companies still in the eye of the storm is Ripple, with the SEC motivated to classify XRP as a security despite a court having refuted this connection last year.\n\nAt this moment the Federal Securities and Exchange Commission is asking the company that manages the issuance of the cryptocurrency, for compensation of 102.6 million dollars after reducing the amount from an initial fine set at 2 billion dollars for selling XRP without a license.\n\nRipple refuses to give in to this bullismo, and has recently proposed a fine of 10 million dollars, citing the agreement with Terraform Labs as justification. However, the SEC has countered that such a low fine “would not meet the purposes of civil penalty laws.”\n\nThe regulator has indeed clarified that Terraform Labs has agreed to destroy “the keys to all its securities in crypto assets”, “return a significant amount to investors in those securities”, and remove “two of the board members in command at the time of the violations”.\n\nAs stated by the SEC itself:\n\n“Ripple also confronts the dimension of the sanction of Terraform with the amount of the ‘gross sales’ of that defendant, arguing that the Court should impose the same ratio (1.27%). But this is not an apples-to-apples comparison”\n\nIn the middle of this debate, last week Judge Phyllis Hamilton dismissed at least the 4 compensation claims in separate class actions, while still keeping the main case alive to label Ripple’s token as an unregistered security.\n\nIn particular, Hamilton focused on the fact that Brad Garlinghouse, founder of the accused company, had insistently promoted the currency in 2017 while he himself was proceeding to sell large shares on the market.\n\nThe promotional activity of Ripple which Judge Hamilton may be treating with more weight than Judge Torres could give the expectation. There seems to be some additional evidence of promotional statements before Judge Hamilton. The whole remaining cause of action going forward… https://t.co/Cd1RS4xQgX — bill morgan (@Belisarius2020) June 21, 2024\n\nDespite Judge Annalisa Torres having previously closed the XRP-security case, now everything seems to be back in the spotlight: the ball is now in the court of the trial, which will decide whether to classify Ripple’s digital currency used for cross-border payments as a financial security.\n\nThe SEC is trying to assert itself by instilling fear in the entire digital token industry, in order to “discourage future misconduct in the cryptocurrency sector“.\n\nIn the meantime, while the federal agency limits the expansion of the crypto sector with these attempts at destabilization, more and more famous personalities and US celebrities are illegally promoting tokens linked to their name, which inevitably end up causing their investors to lose money."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPVy1aTEkyQ1BjTjgzRjhfTU9SbHI3QWdSd0V3S1RiLWtfbVpxeGUzaElEc3MzUElIWkdoQ096d01scG8zY1RvWWhVMGt1V3pkWWNmbEpCenY4UGxWSjdQODZ6dnBFOFZYaE1Kb3Y0aEJSd0ZNTWRld3V1aWh2QVFxSTRvbGx0M283NDNuRWFtRUtuV0gzWUJ3T3lGVXZ2bjZ4S3hYUtIBqgFBVV95cUxQV1VUemtRcFNrbUZCdDEtOGNKc0dwSHhHdmtBNlE4Z2otSTJ6N1ZSMWVUV1JDZVRic2oyVXZvSnhJUFBkN1lnQUJTS1Bha0t0c083bUxWV2FSNU5tMnVBZ2l4UnljYVlXNVk5Qk02MVF5ZGZ6RnU0MEZhU1BKV0Zpak5hd013SzBnZHdBdE50bDlNWU90N2g0ME5mbHFXdFMtYTQ1dHp4VmFIUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Ether Traders Buy $4K Calls In Anticipation of Record High - CoinDesk",
        "content": "A call option is a derivative contract that gives the holder the right to buy the underlying asset at a specified price within a predetermined time frame. When traders purchase call options, they do so with the expectation that the price of the underlying asset will rise above the strike price, that is, $4,000 in this case, before the expiry of the option."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQMGRQbkM3c2dMZkpoYnVrcVFqUEpWcVk3RmdrZERINDRZU3M5MnJTSXRDazd2UkFMdU5ORV9wUkhpcG1JbG95WkNGbnFycnJwTmpvaHVPeG44bTBpWDBxdk9fTlUwVHNWWWJrLTdMNm9zeW16Rk5kT0s0V3lWNHVVVVVucG1kOEpWSXJWcjBiay0yU0JraEIxRVFRdU9GZmFFdF84S04yZjhHd3E0V1FBRkRIVWh6UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "The price of Ethereum at $2,400 after the launch of spot ETFs - The Cryptonomist",
        "content": "From the analysis of Andrew Kang, founder of Mechanism Capital, it emerges that after the launch of spot Ethereum ETFs, the price of ETH could drop to $2,400. For Kang, the smart contract crypto does not attract institutional investors in the style of Bitcoin.\n\nETF on Ethereum Spot: after the launch, the price of ETH could drop to $2,400\n\nAccording to the analysis by Andrew Kang, founder of the venture capital firm Mechanism Capital, it seems that after the launch of spot Ethereum ETFs, the price of ETH could drop to as low as $2,400.\n\n“Before the launch of the ETF, I expect ETH to trade between 3,000 and 3,800 dollars. After the launch of the ETF, my expectations are 2,400-3,000 dollars.”\n\nIn practice, Kang wanted to highlight that the position of Ethereum compared to Bitcoin is very different.\n\nIn fact, the founder of Mechanism Capital states that the crypto of smart contracts does not attract institutional investors, as Bitcoin did previously. On the contrary, for Kang, there are few incentives to convert Ether spot into ETF form and the network’s cash flows have not been very impressive.\n\nNot only that, it seems that according to Kang the success of the Bitcoin spot ETF has become an expectation for the Ethereum ETF for crypto natives, and not for TradFi investors.\n\n“Personally, I believe that the expectations of crypto natives are inflated and disconnected from the real preferences of traditional tradfi allocators. It is natural that those within the crypto space have a relatively high mental and purchasing share of Ethereum. In reality, Ethereum is much less appreciated as a key portfolio allocation by many large non-crypto capital groups.”\n\nSpot Ethereum ETF: the forecast on the price of ETH after the launch\n\nAt the time of writing, ETH is worth $3,377. If after the launch of spot Ethereum ETFs, the price were to follow Kang’s predictions and drop to $2,400, it would be a dump of -30%.\n\nNot only that, the founder of Mechanism Capital believes that spot Ethereum ETFs will attract 15% of the flows that spot Bitcoin ETFs have recorded, which is a percentage between 10 and 20% estimated by Bloomberg analysts Eric Balchunas and James Seyffart.\n\nOther analyses then, talk about the ETH/BTC price ratio, which from 0.054 at current prices, could drop to 0.035 in the next 12 months.\n\nHowever, Kang believes that a rally in the price of Bitcoin towards $100,000 in the next six to nine months could “drag” Ether towards a new all-time high.\n\nThe addition of the ProShares request\n\nAmong the latest news on ETF su Ethereum spot, there is talk of the United States Securities and Exchange Commission (SEC) that has added the request from ProShares.\n\nAnd in fact, among the 8 questions already approved in May, it seems that the one from ProShares was missing. Now, given that the process for final approval could end between the end of June and the beginning of July, this ninth question has also been accepted.\n\nThe announcement was made directly by the SEC, with a document revealing that NYSE Arca has proposed a rule change to list and trade shares of the ProShares ETF on Ethereum\n\nNow the crypto world and institutional investors are waiting to see the final approval of the 9 Ethereum spot ETFs, with the SEC expected to approve the S-1 form."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPdFNhNmV0N3A1NC0tNEJEUTJ2d0ZQMXBWSERvX0Z6eDVHdnB1ekNlVjgtbHEzUkRkTXR1YjN3TjlBRUdlLTJNSG5QVkJJLWE4TVlRWUFWRHZhMmZRYVhRRjFxd1E3MzFaRWpxYUNTRUNHUExlNS01SmU1MkFHbEZsUEp0LVpkaVdS0gGOAUFVX3lxTFBidnlKQTNSMmdycFdHWjZiSU9UeHhKMEpRUlRjeEl0dUdZQ2d0VjY1T1FvdjhoR0d2aXhUa2R6SWZXT0JXY01VbVM3OEU0TGczTlkwX1ZxcmtNQ3Uwd1ZiQVljdkhhV2ZJZXE3SFJ4dlhqcDlyeUtXbDY2SU9HLTlUT3hYcU0xclIteGYtUkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum Price Going To Crash Below $3,000 Support? - CoinGape",
        "content": "Ethereum price has faced intense selling pressure in the past couple of weeks despite starting June above $3,800. May was a bullish month for Ether which soared almost touching $4,000, thanks to the Securities and Exchange Commission (SEC) nodding to spot Ethereum ETFs.\n\nThe downturn to $3,300 in the last two weeks can be attributed to the larger macro environment. Investors in the crypto market have not been too amused by the Federal Reserve’s hawkish stance on interest rate cuts.\n\nadvertisement\n\nThis coupled with increased profit taking ahead off the start of the actual trading of the spot ETF has seen Ethereum price dive toward the $3,000 mark.\n\nShould the selling pressure increase this week, ETH price might fall below $3,000. Such a move could lead to cascading price dips as investors are likely to make irrational decisions to protect their capital.\n\nHowever, in an incoming inflation report in the US, the PCE price index could bring some level of relief to the crypto market. Experts are also looking toward the US election likely to be bullish for crypto later in the year.\n\nWhat To Do As Ethereum Price Grinds Toward $3,000\n\nEthereum is seen struggling to defend support at $3,300 during US business hours on Monday. Key indicators like the Relative Strength Index (RSI) validate the downtrend as it falls in the neutral area, getting closer to the oversold region.\n\nThe smart contracts token seems largely disadvantaged based on its position below two key Exponential Moving Averages (EMAs); the 20-day and 50-day.\n\nA potential death cross pattern would further destabilize Ethereum. Its occurrence on the daily chart may trigger traders to consider shorting ETH, thus creating more headwinds for the token.\n\nThe area with the most potential for support lies around $3,000 as highlighted by the 200-day EMA. A dive to this level may result in two actions; the first being an immediate rebound toward $4,000 as liquidity is collected or a continued fall below $3,000.\n\nA previous retest of this support at $3,000 extended the correction to $2,800 following the crypto sell-off in April and early May. A similar move is possible and one that may stretch to $2,500.\n\nNevertheless, the expected start of spot Ethereum ETFs trading on July 2 according to insight from analyst Eric Balchunas could be of immense relief to Ethereum.\n\nETFs will expose Ethereum to new markets among institutional investors who may be pressured to seek exposure to the crypto on traditional stock exchanges. Bitcoin rallied, achieving a new all-time high in March after the SEC approved the spot ETFs in January.\n\nEthereum price prediction shows the potential to gain momentum with increasing demand from the ETF. Therefore, this could be a good time to buy ETH and speculate on a stronger rebound in July and August.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNSVRCYUxLSTV6SkZqc1RQNGNSU3Q2SHlyOHhwNnZOVWNIdV9IZEpsTk1lYm11cWZfWjI4OGdqQmhoZXBhTW9mUFI5eWd6M2NNTWxnOEpWdFczZ3k0ZllUcS0xel9Za3I5Y0V3V09GUUVJa25rb3FkUjQ1dTZicmtuUnFFS3IzOHc0Uk9hRXRKaS1GWEV1SW1fcVU1eTUtZW9jbHpETWpMd0VEQUF3R0JBc3JXbUNVdkdSR3ZmWVpXZ29zUzZUMEphMHV0eHA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Solana Price Analysis: SOL Traders Could Earn 80% Profits from Ethereum ETFs Launch - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOSG5KWXpXYTlDMkN5eUZrY3VDS2Q5bGUxTG5VQnNLLTdPU1dVSkxXX0xUQ3hMeVExa2gwblhRWEtTamVHUUpFb2FHd2taaDRBOFAxZzFQOEpzczlvOUgwTk9ZUmlpU25iT2YzLXFNU05kZFA1M1NVNGVjMjEyZlpCYjQyeVFYa3N0TEU0UjZkOXo0LXdpemNpVmxKdjV4RC1zc1V3Y0R0aEZhLU43RVRTNm9BVkRtcFA2YVh2N0lrYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "July forecasts for the price of Bitcoin and Ethereum: analysis by Ryan Lee of Bitget - The Cryptonomist",
        "content": "According to the latest forecasts, in the month of July, the price performance of Bitcoin (BTC) and Ethereum (ETH) could be strongly influenced by a series of economic and market factors.\n\nRyan Lee from Bitget offers a detailed analysis of the main elements that could determine the trends of these two giants of cryptocurrencies. Let’s see all the details below.\n\nWhat are the price predictions for Bitcoin and Ethereum in the near future?\n\nAs anticipated, Ryan Lee of Bitget has released important forecasts regarding the price trend of the two well-known cryptos Bitcoin and Ethereum. One of the main factors to consider, according to him, is the macroeconomic environment.\n\nRecently, in fact, the net liquidity index of the Federal Reserve (FED) has exceeded 6.5 trillion dollars, releasing 400 billion dollars of liquidity into the market since the end of June.\n\nThis level of liquidity is the highest in the last two years. Furthermore, with the prospect of future interest rate cuts, market liquidity is expected to become even more abundant. Thus favoring a bull trend in the cryptocurrency market.\n\nAnother positive indicator for the cryptocurrency market is the increase in the market cap of stablecoins, which went from 160 to 162 billion dollars in June. This increase indicates a net inflow of capital into the cryptocurrency market.\n\nDespite a contraction of the overall market cap in June, the increase in stablecoins suggests that leverage in the cryptocurrency market is currently low, leaving room for further bull movements in the future.\n\nKey events: Mt. Gox refunds and spot ETFs on ETH\n\nMoving forward, we see two fundamental events that could significantly influence the prices of BTC and ETH in July. First of all, Mt. Gox has announced that it will start reimbursing BTC and BCH at the beginning of July.\n\nThis refund has raised fears of significant selling pressure, as Mt. Gox has moved 7 billion dollars of assets on the chain. A factor that could potentially cause a substantial drop in BTC prices.\n\nD’altro canto, i progressi sull’ETF Spot su ETH potrebbero avere un impatto positivo su Ethereum. Alla fine di maggio, la SEC ha approvato il deposito 19b-4 e recentemente, Fidelity, 21Shares e Grayscale hanno presentato i moduli S-1 dell’ETH Spot ETF alla SEC.\n\nIt is very likely that the ETF ETH will be officially launched on the US capital market in July. Thus leading traditional funds to directly purchase ETH and potentially determining a bull trend for ETH.\n\nIn summary, it is expected that in the month of July the price range of BTC will be between 58,000 and 73,000 dollars, while the price range of ETH will be between 3,100 and 4,500 dollars.\n\nIt is likely that the ETH/BTC exchange rate will continue its upward rebound, supported by the macroeconomic factors and market events described.\n\nThese developments could determine an interesting dynamic for investors and enthusiasts in the cryptocurrency sector.\n\nBitcoin drops to $61,000: brief analysis of the causes of the crash\n\nBitcoin has recently experienced a significant price drop, falling towards the $61,000 level and hitting a new monthly low.\n\nVarious factors have contributed to this decline, including mining activities, Federal Reserve policies, the lack of new inflows, and market indicators.\n\nBTC miners play a crucial role in the recent decline. There has been a significant increase in sales from old wallets, predominantly held by miners, following the recent Bitcoin halving event, which cut daily production from 900 to 450 Bitcoin.\n\nThe Bitcoin miner reserves have dropped to the lowest levels in the last 14 years, with a decrease of 50,000 units since the beginning of the year.\n\nThis month, the miners sold over 30,000 BTC, worth about 2 billion dollars, mainly on the exchanges, directly contributing to the price drop.\n\nFurthermore, the German government has moved 600 million dollars of Bitcoin to the exchanges, selling 200 million dollars in a single day.\n\nWith holdings of approximately 3 billion dollars in Bitcoin, this sudden sell-off, likely induced by financial requirements amid economic pressures, has had a significant impact on the market.\n\nFinally, on Thursday, the spot Bitcoin ETFs listed in the United States recorded the fifth consecutive day of outflows, totaling over 900 million dollars for the week."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNdzhtN1N1TkgxaFBEeXl4MXRJODVzX1hSaWJJY3k3UUNjREVwX2NoQm5hN1RXMlBUUldoZmFhMzMzOGJrWWh4TFN0UkYzQVhaREtkZ2JMZ211MmZDT3JJWElKY1lzUUJ2Nkh4OXNwT0p0a0RoM3RKdW54Z2xxcmhnNnBoV3ZmQdIBiwFBVV95cUxNUEI1bkVCV2x6XzFaQ2diOGZYeXl2Wm9zV1VTTDBrNGdVOWFIU3BLTnl4ZGU5NzBiNTNDbVUyV0t2TVdpUzhISW01VXI2NGtwRl94akRCMF9ycHFuZVdnazgyblVQWk9sdTl3QXZlWWFjazg4NUxHVHhULTVkcjBsd3JDZHhiVk5Jb3M0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Ethereum to $4K? Spot ETF approvals have analysts thinking… - AMBCrypto News",
        "content": "Market enthusiasm around ETH ETFs might not be as strong as most expected, according to analysts\n\nOther market observers believe ETH could cross $4K after ETF launch\n\nDoubts about market demand for U.S spot Ethereum [ETH] ETFs have been compounding, even as analysts maintain a possible launch by early July. In fact, there’s been a debate about whether ETH ETFs can attract demand on a scale similar to that of spot Bitcoin [BTC] ETFs too.\n\nFor perspective, according to Farside Investors’ data, BTC-related products have now hit +$14 billion in net flows and over $50 billion in assets under management (AUM) since their debut in January.\n\nHowever, most analysts believe that ETH ETFs could meet only a fraction of the aforementioned demand. For instance – Quinn Thompson, Founder of crypto hedge fund Lekker Capital, recently reinforced the overall market’s lukewarm outlook.\n\n“The market is fading the positive impact of the upcoming ETH ETF way too hard.”\n\nMixed views on ETH ETFs\n\nJPMorgan analysts are part of the bearish camp too. They recently projected that ETH ETFs could attract about $1 billion to $3 billion in net inflows in the second half of 2024.\n\nAnother bearish figure was shared by Bloomberg ETF analyst Eric Balchunas, who projected that the products could capture only 20% of the BTC ETF market share. His projection was based on the current demand for ETH vs BTC on the Futures market.\n\nOn the contrary, other analysts, like K33 Research’s Vetle Lunde, estimated that demand for ETH ETF products could hit $4 billion in net inflows in the first five months alone.\n\nFor example, Bitwise CIO Matt Hougan is in the bullish camp and views the second half of 2024 as full of ‘tailwinds’ for ETH demand.\n\nA recent Deribit Insights report also painted a bullish future based on recent Options data. It noted,\n\n“Decent clip of ETH Sep 4k Calls bought ($12m premium), and BTC Jun 65k+July75k Calls rolled to increased exposure in Dec 75+90k Calls, showing increased mid-term optimism.”\n\nQCP Capital analysts reiterated the said optimism based on Options data, reiterating that ETH could surge above $4K and retest its record high of $4.8K."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE53TG1qZ29xUkpBeW9LQm5xa1FSVlBoNjBaZ3M4NlVuQjlRR3YtSUZld0MwaUF3eER4Y2QyaTJZbGFjaWlwZE9NQmF5UnNSZ3FTRURYZld0MzF1S2Njd1JvdXM4RFFheFlsZkZ1SVJkb3dIdl85?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Will Ethereum ETF Drive Prices Above $4K? - CoinGape",
        "content": "The cryptocurrency market is filled with excitement and expectation as the possible introduction of U.S. spot Ethereum (ETH) ETFs approaches. Analysts forecast a potential launch in early July, sparking discussions on whether these ETFs can attract as much demand as the hugely successful spot Bitcoin (BTC) ETFs. With Ethereum’s price being closely examined, the important question is whether Ethereum ETF will cause prices to surpass $4K.\n\nThe Bitcoin ETF Benchmark\n\nIn order to understand the importance, let’s examine the performance of Bitcoin ETFs. Since January, BTC-related products have collected approximately $14.5 billion in net flows and have grown their assets under management (AUM) to more than $50 billion, as reported by Farside Investors.\n\nadvertisement\n\nThis significant interest and investment have established a high standard for future cryptocurrency ETFs, including those designed for Ethereum.\n\nSkepticism Surrounding ETH ETFs\n\nIn spite of the excitement, there is a lot of doubt regarding the possible influence of Ethereum ETFs. Numerous analysts think that ETH ETFs could only attract a small portion of the demand that Bitcoin ETFs have seen.\n\nQuinn Thompson, who started the crypto hedge fund Lekker Capital, pointed out that the market is underestimating the positive effects of the forthcoming ETH ETF.\n\nAnalysts at JPMorgan predict that ETH ETFs may see inflows of $1 billion to $3 billion in the latter half of 2024. ETF analyst Eric Balchunas from Bloomberg predicted that Ethereum ETFs could potentially secure 20% of the market share currently dominated by Bitcoin ETFs.\n\nThese forecasts rely on the current demand trends for ETH compared to BTC in the futures market.\n\nBullish Counterarguments\n\nContrary to the bearish outlook, several analysts remain optimistic about the potential demand for Ethereum ETFs. Vetle Lunde from K33 Research estimated that ETH ETF products could see $4 billion in net inflows within the first five months alone.\n\nBitwise CIO Matt Hougan also expressed a bullish perspective, viewing the second half of 2024 as being filled with ‘tailwinds’ that could boost ETH demand.\n\nA recent report from Deribit Insights further bolstered this optimistic view, highlighting increased mid-term optimism based on options data. QCP Capital analysts echoed this sentiment, suggesting that if ETH captures even 10-20% of Bitcoin ETF flows, it could propel the price above $4,000 and possibly towards its all-time high of $4,800.\n\nMarket Sentiment and Predictions\n\nAlthough the outlook is positive, there has been less enthusiasm for Ethereum spot ETFs in the market compared to when Bitcoin ETFs were introduced earlier this year. Entrepreneur Andrew Kang highlighted that the effects of ETH ETFs are not as straightforward, predicting that Ethereum ETF investments will make up approximately 10% to 15% of Bitcoin ETF investments.\n\nKang predicts that ETH’s price may range from $3,000 to $3,800 prior to the ETF debut, but could possibly decrease to $2,400 to $3,000 after the launch, resulting in a substantial decline from its present worth.\n\nYet, there is a positive aspect. By any chance Bitcoins hit the $100,000 milestone by end of this year, or early 2025, it could also both ETH, alongside other altcoins.\n\nOptimism in Institutional Interest\n\nDespite the doubts, there are still optimistic signs on the way. Asset management giants such as BlackRock could utilize Ethereum to tokenize physical assets, thereby increasing the value of ETH.\n\nAdditionally, the SEC has finalized its inquiry into the Ethereum Foundation, potentially confirming ETH as a commodity instead of a security, thus increasing its attractiveness to institutional investors.\n\nCurrent Price Action of Ethereum (ETH)\n\nCurrently, Ethereum is trading at $3,363.36, after dropping in value by 4.15% over the past day, and 5.37% in the past week. However, ETH is experiencing heightened trading activity, with an increase of over 80% in trading volume, over the past 24 hours.\n\nConclusion\n\nThe price direction of ETH will significantly be impacted by the launch of Ethereum ETFs. Although opinions are split on whether these ETFs will have the same level of demand as Bitcoin ETFs, there is still potential for a significant impact. In case the optimistic projects of Ethereum prove accurate, the price of the second largest coin may surpass $4k. Achieving this milestone will be very significant for cryptocurrency. As the date for the launches approaches, both analysts and investors will be watching closely, on the market response, and whether or not Ethereum can meet the high expectations set before it."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNUlpMc3ZaUFlEUW5XTUNaaVJVU0hUd0x5Z3hueldDenUyMWs0NmNfYmhZNDNCMEFPbmo5cWJWRnFWajJpSlRrcHBiT2o4M3MwSHhEa1NyM2F0bGFXNlhLUDdPRnJaMnpGWGdTbXg4MDZ4czFLeTRzdkhVbFVRX1F1eURNdTVUeV9IRGJSTHJFNExWX1lvbE1uVFpwellsUU9CWmlV0gGoAUFVX3lxTFBqam1vQldyenZpY0FSc3UyRTNfdXRpaUdIdUd2OW44VWxySlc4aXZhWUJGLUotWFBxdUVSSFBpUTUzRTFuTnd2TFZpeE5Pdi1TdGJub2tvenoyeEQ4cURITDJwVmFHcXFQZEsxdWNnLVlXdnF3dGcxVUdvV0ItMDY0Y1lZS3JtejNqUnRvNlZwOE9MMEdmaEt5Q1hMbE1oT1NaRDVJb1JOeQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Incoming Ethereum Price Crash: Analyst Flags Warnings of Spot ETH ETF Launch - CryptoPotato",
        "content": "The reaction and market sentiment towards Ethereum spot ETFs is somewhat muted in comparison to when Bitcoin products launched earlier this year.\n\nThese are the findings of crypto entrepreneur and investor Andrew Kang, who published a lengthy analysis of the impact of Ethereum ETFs on X on June 23.\n\nBitcoin ETFs opened the door for many new buyers to make BTC allocations within their portfolios. However, “the impact of ETH ETFs is a lot less clear-cut,” he said.\n\nETH Price Could Tank\n\nKang estimates that the Ethereum ETF flows will be around 10% to 15% of Bitcoin ETF flows, resulting in roughly $500 million to $1.5 billion in true net buying within six months.\n\nIt was reported last week that Fidelity will seed its Ethereum ETF With $4.7 million, so the buying has already begun. In March, Standard Chartered predicted that inflows would reach $45 billion in the first 12 months of Ethereum ETF trading.\n\nNevertheless, Kang offered several reasons why the impact of an Ethereum ETF is expected to be less significant than that of Bitcoin.\n\nEthereum is seen as more of a tech asset rather than a macro asset like BTC. Additionally, there is less institutional interest and buying pressure for it since the its current valuation metrics, such as the price-earnings ratio, make it harder to justify to traditional finance allocators, he said.\n\n“It is natural that those deep in the crypto space have a relatively high mind share and buy-in of Ethereum. In reality, it has much less buy-in as a key portfolio allocation for many large groups of non-crypto native capital.” https://t.co/On2KWjAlLx — Andrew Kang (@Rewkang) June 23, 2024\n\nMoreover, Ethereum’s positioning before any ETFs are launched is different from Bitcoin’s as the asset is already up 4x from its lows while BTC was up 2.75x before its ETF launches, he added.\n\nTherefore, Kang expects ETH to trade between $3,000 and $3,800 before the ETF launch but potentially fall to between $2,400 and $3,000 after the launch. A dump to the lower estimate would wipe 30% off the asset’s current value.\n\nHowever, if BTC increases to $100,000 at the end of this year or early next, it could drag Ethereum and altcoins up with it, he predicted.\n\nKang’s bearish Ethereum stance didn’t end there. He expects a continued downtrend for the ETH/BTC ratio over the next year, ranging between 0.035 and 0.06.\n\nETH Prices Dip Below $3,400\n\nMeanwhile, ETH’s price tumbled in the past 24 hours alongside the broader cryptocurrency market, which remains riddled with uncertainty.\n\nAt the time of this writing, Ethereum is found trading below $3,400, down 3.4% on the day and 5.3% on the week.\n\nThe rest of the market is also declining. Bitcoin dropped below $63K for a 2.5% loss in the last day, while BNB and Solana lost 3% and 6.2%, respectively.\n\nNot All Bearish On Ethereum\n\nThe only bullish prediction was that large asset managers such as BlackRock could use Ethereum to tokenize real-world assets, but “how much value this translates into for ETH and on what timeline is uncertain,” he concluded.\n\nAdditionally, ConsenSys said last week that the US Securities and Exchange Commission was closing its investigation into the Ethereum Foundation.\n\nThis could solidify ETH’s status as a commodity rather than a security, which is also very bullish for the asset and the rest of the altcoins."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOOUZtclI5T1FrWDJuZGhtaGk3ZGE5N2Q2dU5iOEVORklVVE9sUVVXWlVOOENzN0l4YWhZWFBjN1lTSG1OWElsZzE1dzBEUUNsb2Fsd25feDJ4aVozWDFLYVlPR3NuYnNSTTAyVUUxTnV4RzM3Sm1EUUJsNUlxLTdXZGZ4eXZ5TTMwQ2lLbHczOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Crypto derivatives markets: Bitcoin vs. Ethereum - CryptoSlate",
        "content": "Introduction\n\nDerivatives play a crucial role in financial markets, providing essential tools for hedging, speculation, and price discovery. These instruments derive value from underlying assets, allowing market participants to manage risk and gain exposure to asset price movements without directly owning the assets. In the traditional financial market, derivatives are a massive category. The Bank for International Settlements (BIS) reported that the notional amount of over-the-counter (OTC) derivatives reached $667 trillion at the end of last year.\n\nWhile the crypto derivatives market is significantly smaller than that, it has grown substantially in the past couple of years and has become an essential part of the broader market. Crypto derivatives have become indispensable tools for managing the inherent volatility and leveraging investment strategies. Bitcoin (BTC) and Ethereum (ETH) derivatives are the pillars of this relatively young market, despite many other derivatives products based on smaller cryptocurrencies.\n\nThe growing adoption of these derivatives shows their importance in enhancing market liquidity, enabling sophisticated trading strategies, and facilitating price discovery. In this report, CryptoSlate will explore the theoretical and practical differences between BTC and ETH and their respective futures, options, and perpetual futures markets."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNd2RoMVhsa01uQ05YSEdqWE1jWWxTRE9DYTVBUG0xTXNEZEIycW9mMWRhQ1NZMXlPVXFObmtSb3U3NmliSzlRUDlyUVJuSXNudnJTbW9rZlE0TFhwLTlsZXlaMmNaWnpMdmIxdEtHeWNLWlpLd0pHSmNVdWhfSlZJci1meTdTX1BrOUh0SHhtQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Vous devriez surveiller Ethereum maintenant - Cointribune EN",
        "content": "Sun 23 Jun 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nMichaël van de Poppe, renowned crypto analyst, anticipates a significant rise in altcoins, driven by Ethereum’s remarkable resilience. While Bitcoin shows signs of weakness with substantial capital outflows from US-based ETFs, Ethereum demonstrates impressive stability. This dynamic could well herald a major turning point for the altcoin market.\n\nEthereum stands out for its resilience\n\nAs the crypto market undergoes a bearish phase, Ethereum stands out with notable resilience. Recent data shows sustained activity from Ethereum “whales,” which contrasts with the movements around Bitcoin.\n\nA wallet linked to Justin Sun acquired 9,338 Ether, worth over 30 million dollars. A purchase that demonstrates increased confidence in Ethereum’s future performance. In contrast, Bitcoin whales, notably influenced by the German government, continue to liquidate their positions, increasing downward pressure on the market. Similarly, Bitcoin ETFs face massive outflows. Conversely, Ethereum appears to be gaining renewed confidence, potentially setting the stage for a rise in altcoins.\n\nAn imminent rise in altcoins\n\nAccording to Michaël van de Poppe, Ethereum’s resilience could herald a new era for altcoins. The renowned analyst highlights that the ETH/BTC pair, which has recently shown signs of strength, could trigger a significant rise in altcoins after more than two and a half years of a downtrend. Van de Poppe believes that as long as the ETH/BTC pair holds above the key level of 0.05, a trend reversal is possible. This analysis is based on on-chain data revealing increased accumulation of Ethereum by whales, contrasting with Bitcoin liquidations. This technical signal indicates that Ethereum’s crypto price could climb exponentially against the US dollar, driving positive dynamics for the entire altcoin market.\n\nInstitutional interest in cryptos other than Bitcoin continues to grow, as evidenced by the imminent launch of Solana’s exchange-traded product (ETP) in Canada. This trend reflects a diversification of institutional investment portfolios, once largely dominated by Bitcoin, towards alternative cryptos with attractive growth prospects.\n\nBitcoin’s dominance, measured in terms of relative market share, is also poised for a major reversal. This outlook could favor a rotation of investor liquidity towards altcoins and thus amplify their performance. towards altcoins and amplify their performance.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPdE1Ra0hjN3VpU1FOZFc2UEpaZnFEN21rUm9YYU9UYjlyclNMSFBTcjA3aW12MjVwZm1fTDB1SmtSY0JfVjN4ekhRMUZPamVVRGhnMFdsODhpVWdLbGVhYm8tYWhrSEFrVXdWUEMzcFk4dVROUU5RWllTYmdEZl9URDJUeC0zVzBVWVpsYXRIa1l6X1pBZ0HSAZsBQVVfeXFMTmYzbEt2V2tld2cxLUxrYUx2c2gyYnA5UUdrMjQ5enVzSDhyRkh4UWd4bjhxVjVKam1VR0RfbnRUWjlOaUIxNDVmdzlvbzcwNzg2Y1p5N1FlM3dxZ2VJOHdsNHJSOVlPM3NTRjdCWkRzX0RKTjlDalZKZHhrQ09wTG5xalhfTUI2UjNwS3FuYzZDUXk0WGRBMU9ZSzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price: Whale Offloads 10k Coins Amid ETH Price Dip, What’s Next? - CoinGape",
        "content": "Ethereum (ETH), the second-largest cryptocurrency by global market cap, has once again turned heads across the broader crypto market. In the past 24 hours, ETH has exhibited highly turbulent price action, sparking significant interest and activity among major investors, known as whales. According to on-chain data, over 9,000 ETH tokens were transferred to Coinbase in the past four hours, capturing the attention of market participants.\n\nEthereum’s Whale Activity and Market Speculation\n\nThe recent price recovery of Ethereum (ETH) within the last four hours has been particularly noteworthy. On-chain data reveals that a whale, identified as 0xe61, deposited 9,553 ETH, valued at over $33.4 million, into Coinbase. This considerable transaction has led to widespread speculation regarding the future direction of ETH’s price.\n\nadvertisement\n\nGiven the recent dip in Ethereum’s value, some believe the whale might be selling off to mitigate potential losses. Currently, Ethereum’s price stands at $3,489.38, with a 24-hour trading volume of $5.1 billion. This represents a -1.17% price decline over the past 24 hours and a -1.85% decline over the past seven days. With a circulating supply of 120 million ETH, the market cap is valued at $426.7 billion.\n\nAdditionally, Ethereum’s open interest has decreased by 2.5%, reaching a valuation of $11.5 billion. Despite these declines, the ETH price is sustaining above the $3,400 mark. Various factors suggest that a price reversal might be imminent, including a relative strength index of 43.70, indicating increased selling pressure from the bears.\n\nAlso Read: DOGE, SHIB, and BONK Leads Memecoin Recovery, Is The Worst Over Now?\n\nIndicators of a Potential Price Reversal\n\nSeveral indicators point towards a potential price reversal for Ethereum. One of the most significant factors is the increase in active addresses, which has reached a three-month high of 617,170. This surge in activity is a positive sign of growing user engagement and network utilization.\n\nAdditionally, the ETH/BTC trading pair has remained above the crucial 0.05 BTC level, which is an important threshold according to market analyst Michaël van de Poppe. Another major development is the filing of S-1 amendments by prominent financial firms for Spot Ethereum ETFs. Companies such as BlackRock, Fidelity, Grayscale, and VanEck have submitted detailed amendments to the SEC, demonstrating their commitment to launching these funds. The potential approval of these ETFs could bring substantial institutional investment into Ethereum.\n\nBloomberg analyst Eric Balchunas highlighted the competitive pricing of these ETFs, with VanEck’s fee at 0.20%, which could pressure BlackRock to keep their fees under 30bps. These combined factors suggest that Ethereum could be on the verge of a significant price reversal. Investors are advised to closely monitor these developments as they could present substantial opportunities in the near future.\n\nAlso Read: Binance CEO Richard Teng Affirms Binance’s Support To BtcTurk Amid Recent Hack\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPV3lFWVNHS04xcDIzVklCLXJSVVRQYlRtZWVuSUV3YmtVaDllc2lsaElDa0tXLXl2VUtNNzYyaXpRdFNMbHRtMG9aSjE0elVlLWEtZVpiM091dkR5bVpYQ3hrdlhVZlk3eTZvNS1wbVpWRFpWOVVaak5McXp6VXhNYS03ZEo5cm14WkxiWW14VkxpNmhuSks4Mg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Crypto: A 30% Plunge for Ethereum with the Arrival of Spot ETFs - Cointribune EN",
        "content": "Mon 24 Jun 2024 ▪ 4 min read ▪ by Evans S.\n\nThe crypto universe is buzzing with the announcement of the imminent launch of spot Ethereum (ETH) ETFs. One of the most influential players in the sector, Andrew Kang, founder of Mechanism Capital, has recently shared his predictions regarding the impact of this news on the price of Ether. According to him, Ethereum could undergo a drastic drop of 30%, sparking strong reactions and intense speculation among investors.\n\nPredictions for the fall of ETH crypto\n\nAndrew Kang raised the alarm in an article published on June 23, where he predicts a significant decrease in the price of ETH crypto following the launch of spot ETH ETFs.\n\nCurrently, Ether is trading around 3,410 dollars, but Kang anticipates a drop to 2,400 dollars, a fall of about 30%. Unlike Bitcoin, the ETH crypto does not benefit from the same level of institutional interest, which could limit the appeal of ETFs for this asset.\n\nIndeed, the Mechanism Capital expert highlights that the cash flows generated by the Ethereum network have not been impressive recently, and the incentives to convert ETH crypto into ETFs remain weak.\n\nThis prediction contrasts sharply with previous peaks achieved by Ethereum, which flirted with 4,000 dollars last March, during the last Bitcoin historic summit.\n\nComparison with Bitcoin ETFs\n\nOne of the main reasons advanced by Kang to explain this pessimistic prediction is the comparison with spot Bitcoin ETFs.\n\nAccording to him, spot Ether ETFs will attract only 15% of the flows observed for spot Bitcoin ETFs, which is within the 10 to 20% range estimated by Bloomberg ETF analysts.\n\nIn practice, this means that Ethereum ETFs could receive around 840 million dollars in new capital inflows over the same period where Bitcoin ETFs attracted 5 billion dollars.\n\nThis low institutional attraction for Ethereum is exacerbated by a negative perception of its economic fundamentals.\n\nKang asserts that the expectations of crypto natives are often disconnected from the preferences of institutional investors, which reinforces the idea that the Ethereum ETF might not be as popular as some hope.\n\nDivergent perspectives and the future of Ethereum\n\nNot all experts share Kang’s pessimistic view. For example, Patrick Scott, also known as Dynamo DeFi, believes that Ethereum ETFs could follow a trajectory similar to that of Bitcoin ETFs, though he does not predict a doubling of the ETH crypto price.\n\nMoreover, asset management company Van Eck predicts that spot Ether ETFs could help bring Ether to 22,000 dollars by 2030.\n\nDespite these divergent perspectives, it is undeniable that the future of Ethereum will depend on its ability to evolve and strengthen its economic fundamentals.\n\nPresenting Ethereum as a decentralized financial settlement layer and platform for Web3 applications could attract some investors, but current data shows a less promising picture.\n\nThe arrival of spot Ethereum ETFs marks an important turning point for the crypto market. While some experts, like Andrew Kang, predict a 30% drop in the price of Ether, others see these new financial products as an opportunity for Ethereum to strengthen its position in the market. In the meantime, some investors are wondering whether it is better to buy Nvidia shares or bitcoin.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQZ0M0SE1ZMFAyT1VHZlFJUDdwZGpPR3MzZ2VLVFdaSnBsTklIbWNEZ1p6QzJHNEdZN29IWmJCeF9ienhEanBzZ3NFZURRbFhxT0o0eTJnNVJhZlk2eFdUYzhQU0xYeGdTdlZvQTBWV3dEVWJWbXdQNTJsdmlqSllyX1RYZTN4eEQ0MjBraFBOdVhfMW9zWFlPSHVYZHl3SzBjd1JVdkszWTdVUXdvSzEwNTNvOVROTk1MeHVWWGJsb2cyLUxXbEFCUDJNWjBFb3FfRzVxX2J30gHbAUFVX3lxTFBiRVdZQWk5ZV9OWTVxMjdlYS1KRlBYUS10OTJtamd4bHp6am1YTG0tbUhSLUtOYTlPVEkyY1dKcENRa29wUEIwZlQ5UkcwLWlwbWNGRVV4ZlBGcGFwS3RBaFdnSDhvQXNNYV9PelJlcGl1RUd0SFdidDhoWFFPZGxhay1lSXpFd0RVYnItQzdES0lNaHgwX3psR1dRVk5Ub2o5eHZvYk83elN4RWMwdDczdGxpSWwtSmtueFRVNGZRbVFqQlgzZWcxU01mMmxQVncyc3JKYldSVm5NYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin set to retest key levels - FXStreet",
        "content": "Bitcoin price is trading inside a descending wedge, and a breakout above $64,600 signals a bullish move.\n\nEthereum price is approaching its key support at $3,288, the 61.8% Fibonacci retracement level.\n\nRipple price faces resistance at $0.500, its daily resistance level.\n\nBitcoin (BTC) price is consolidating within a descending trendline, with a potential bullish breakout anticipated above $64,600. Meanwhile, Ethereum (ETH) and Ripple (XRP) prices retraced to critical support levels before gearing up for a bullish upswing.\n\nBitcoin price consolidating within a descending wedge\n\nBitcoin price is trading inside a descending channel, drawn from multiple swing highs and lows between early June and mid-June, as shown in the daily chart below.\n\nIf BTC continues to decline, it could find support at $62,451, the 61.8% Fibonacci retracement level from a swing low of $56,552 on May 1 to a swing high of $71,995 on May 21.\n\nIf the $62,451 support holds and BTC breaks above the descending channel, it could rally 7.5% to reach its previous resistance level of $67,147.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator (AO) on the daily chart are below their respective mean levels of 50 and zero. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective mean levels.\n\nThis development would provide additional momentum to the recovery rally.\n\nIf bullish sentiment prevails and the overall cryptocurrency market shows optimism, BTC may extend its rally by 6% from $67,147 to retest its previous resistance level of $71,280.\n\nBTC/USDT 1-day chart\n\nHowever, if Bitcoin price breaks and closes below its daily support level of $60,800, the bullish thesis could be invalidated, leading to a 4% crash to its weekly support level of $58,375.\n\nEthereum price could retest key support level\n\nEthereum's price is declining towards its support level of $3,288, the 61.8% Fibonacci retracement level drawn from a swing low of $2,862 on May 14 to a swing high point of $3,977 on May 27.\n\nIf this support holds, ETH price could rally 13% to tag its previous high of $3,717 on June 9.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator in the daily chart are both below their mean level of 50 and zero. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective mean levels.\n\nIf ETH closes above $3,717, the high of June 9, it could extend an additional rally of 7% to reach its previous resistance level of $3,977.\n\nETH/USDT 1-day chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $3,288 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 13% crash to the previous support level of $2,862.\n\nRipple price set for a downward correction\n\nRipple price faces resistance at $0.499, its daily resistance level, and is currently trading at $0.477.\n\nIf Ripple's price breaks above $0.499, it could rise 7% from $0.499 to $0.532, its previous high from June 5.\n\nThe Relative Strength Index (RSI) in the daily chart is below the 50 mean level, while the Awesome Oscillator (AO) is below its zero line. If bullish momentum persists, both momentum indicators must remain above their respective thresholds of 50 and zero. This would provide further support to the recovery rally.\n\nIf the XRP daily candlestick closes above $0.532, it could extend an additional 9% rally to $0.581, a 50% price retracement level of $0.419 and $0.744 from March 11 to April 13.\n\nXRP/USDT 1-day chart\n\nConversely, if Ripple's daily candlestick closes below $0.450, marking the June 7 low, establishing a lower low on the daily chart would invalidate the bullish outlook. This scenario might lead to a 7% decline in XRP's price towards the April 13 low of $0.419."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPOUtSRi1zSnc2dEVaelN0SjV1TF90NGFOcHRhdkFZVnpPbF8zNExGdi1sRDlpa1ZIMTFic242LVRYbWpacFF5WmQzdUJacHo4X09YQUdJM2V2dzE2REZwVU9GOVpvS2I1VGI1VnVYWi1kZ0JGaExoTkpqdjVaWUNocTZHLUFTenoyZ0s5OTMxaTNzQmc0QnZFeVZKYWpTVnFvOF9pN0JzR0hHWk9NLWpkSmY3VThJNmp5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Binance, Ethereum, Solana and Ripple: The Biggest Crypto News of the Past Week - Cointribune EN",
        "content": "Mon 24 Jun 2024 ▪ 5 min read ▪ by Luc Jose A.\n\nAmid revolutionary announcements, technological evolutions, and regulatory turbulence, the crypto ecosystem continues to prove that it is both a territory of limitless innovations and a field of regulatory and economic battles. Here is a summary of the most impactful news from the past week surrounding Bitcoin, Ethereum, Binance, Solana, and Ripple.\n\nElon Musk says NO to crypto on Twitter!\n\nElon Musk, well-known for his support of Dogecoin, is working on launching a payment service via Twitter called “X Payments.” However, this service will not include cryptos initially. Twitter Payments LLC has obtained its first money transfer license in New Hampshire, signaling advances in integrating a fiat currency payment system. The decision to exclude crypto could be related to the volatility and regulatory risks associated with cryptos. This cautious strategy has sparked mixed reactions in the crypto community, with some seeing it as a step back while others see it as a strategic move that could evolve over time.\n\nTether launches Alloy: A gold-backed stablecoin!\n\nTether, famous for its stablecoin USDT, has launched a new stablecoin called “Alloy.” This stablecoin is backed by physical gold via Tether Gold (XAUt) and is designed to offer the stability of gold while enabling digital transactions. Alloy by Tether is a platform that allows the creation of collateralized synthetic digital assets. Users can mint aUSDT by depositing XAUt via smart contracts and price oracles, offering a new form of stability and flexibility in crypto transactions. This initiative is part of the trend towards the tokenization of real assets, offering an innovative combination of traditional security and blockchain technology.\n\nBNB Chain reduces fees by 90% with Haber\n\nThe BNB Chain network has recently activated the Haber hard fork, resulting in an impressive 90% reduction in transaction fees. This update includes the BEP-336 proposal, inspired by Ethereum’s EIP-4844, introducing blob transactions to optimize data storage and processing. By grouping transactions into attached blobs, verification becomes more efficient, reducing network costs to around $0.0001. This improvement particularly benefits the layer 2 solution, opBNB, and the decentralized storage solution BNB Greenfield. Despite a period of volatility for BNB crypto, the technological innovations of the Haber hard fork could stabilize and strengthen its market position.\n\nStandard Chartered enters crypto trading\n\nStandard Chartered, one of the world’s largest banks, has announced the opening of a spot trading desk for Bitcoin and Ether, marking a significant step in integrating cryptos into the traditional banking sector. Based in London, this desk will allow institutional clients to trade cryptocurrencies directly, enriching their investment portfolios. The bank has worked closely with regulators to ensure compliance and security for this new service. This strategic initiative aligns with the growing trend of financial institutions adopting cryptos, with Standard Chartered aiming to position itself as a leader.\n\nRipple partners with ten governments to develop CBDCs\n\nRipple has recently announced partnerships with ten governments for the development of central bank digital currencies (CBDCs). This strategic initiative aims to use Ripple’s blockchain technology to enhance the security and efficiency of global financial institutions. Among the partner countries are Bhutan, Palau, Montenegro, Georgia, and Colombia, each exploring specific aspects of blockchain technology to modernize their financial systems. For example, Bhutan focuses on cross-border payments, while Palau emphasizes an environmentally friendly digital currency. This collaboration has elicited varied reactions within the crypto community, with some fearing increased surveillance, while others see benefits in terms of transaction speed and security.\n\nThat’s the gist of this week’s highlights. But if you want a more detailed recap and in-depth analyses delivered directly to your inbox, don’t hesitate to subscribe to our weekly newsletter.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQbWVZREM3MUpuOWxlaWNwVlozQXkzdmF1ZHdIdjNTR2VNMjY3VUo1TjZWYmtJeHdjbG5DZmxOd1F0YUpkNFBDVVU3bGIzU0tDbHhhVWNtRTNSc2QtNUR4NGhYYkR6b3Y4V0l2V2ZqeEhFX1gyN3JlVmJCTWFnV0VsZmZYRnVvRTZG0gGOAUFVX3lxTE9ra1laMTl2ZWhseHIxWENlMzVQbUlMQjhLQ3pQNUV4QzZjNU04NU5JNUd0OUxHM2JLOHBEOWdDR2gtRzZ3Y2dSRXI2b1FiMDdaVW53XzVseUF0UGhuYkRzWERkaDg5WXhTWm1OS0wwcm53dExQUE1GNnNFRzhXckNBa1FDZ3V3WWxmRTB4NUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "ETH Price Reversal Soon As Ethereum ETF Coming In Two Weeks - CoinGape",
        "content": "The Ethereum (ETH) Price tanked by an additional 3.72% on Sunday, June 23, amid the broader market correction. However, this would be a good time for bottom fishing as the ETH price reversal could be on the horizon with the spot Ethereum ETFs going live in just two weeks from now.\n\nSpot Ethereum ETF Approval Ahead in Two Weeks?\n\nLast Friday, nearly 8 firms submitted the S-1 amendments to the U.S. Securities and Exchange Commission (SEC) while gearing up for the launch of the spot Ethereum ETF by the end of the first week of July.\n\nadvertisement\n\nNate Geraci, the President of the ETH Store, stated that the next two weeks are going to be crucial for the crypto market. He stated that the approval of the spot Ethereum ETF could have far-reaching implications and holds the potential to put the crypto back on the upward trajectory.\n\nIn his recent tweet on the X platform, Geraci stated: “The biggest thing I am watching for is the fee on the Grayscale’s mini ETH trust”. He believes that this fee could send shockwaves into the spot Bitcoin ETF market, as there’s also a mini BTC trust.\n\n“Buckle up,” says Nate Geraci as he expects some volatility and potential opportunities ahead in the upcoming two weeks. In a major prediction further, Gercai also stated that assets in the spot crypto ETFs would surpass the physical gold ETFs by this time around next year.\n\nEveryone ready for these next two weeks? Spot eth ETFs could *potentially* be approved & trading. Biggest thing I’m watching for is fee on Grayscale mini eth trust. That fee could send shockwaves through spot *btc* ETF landscape as there is also mini btc trust. Buckle up. — Nate Geraci (@NateGeraci) June 24, 2024\n\nETH Price Reversal Soon?\n\nAlong with Bitcoin, Ethereum has been the victim of the selling pressure with its price slipping under $3,400 levels as of press time. However, on-chain indicators suggest that a price reversal could be on the horizon very soon for Ethereum.\n\nAlso Read: Top 5 Reasons Why Ethereum Price Is Poised For A Reversal\n\nDespite the strong Layer-2 activity hitting its all-time highs, the Ethereum gas fee has been lowest in years. This shows that the Ethereum blockchain network is all set to handle higher scalability. Crypto analyst Ali Martinez also stated that the Ethereum active addresses have surged to their highest in three months, thereby reaching a total of 617,170.\n\n#Ethereum just saw its largest spike in active $ETH addresses in three months, reaching a total of 617,170 active #ETH addresses. pic.twitter.com/CSqBOnQhEr — Ali (@ali_charts) June 22, 2024\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQM0xqcFVEXzZsUkJhTmlIcHZ6ajVWYVFQRDdtb1hpVHZjNzNXV2Z4Wm5aX2xuQnhYRmRfRmlBUTE1VWhwSGZxUmFUclJCelpBZUwyVzB3cU9HUDBoeTd0Y3NEajNjS0F2MFA1ZWFWSjVibHBOSEl0X2owc3hTQ21lSC1OUHE4UUptdHFIbnMtVHFUUFUxWURsdWZER3hkcVpGM0pKc09KYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Crypto: Pantera Capital Sees Solana As A Serious Future Rival To Ethereum - Cointribune EN",
        "content": "Sun 23 Jun 2024 ▪ 3 min read ▪ by Mikaia A.\n\nAnalysts from Pantera Capital, Franklin Bi, Cosmo Jiang, and Eric Wallach, have recently presented Solana as a real threat to Ethereum. Thanks to its monolithic architecture, Solana is on the verge of establishing itself as a leading blockchain, capable of capturing a significant share of the market dominated by Ethereum.\n\nSolana: The “Ethereum Killer” Activated\n\nSolana positions itself as a serious “Ethereum Killer”, thanks to a monolithic architecture that recalls the integrated approach of Apple with macOS.\n\nAccording to Pantera Capital, this design gives Solana notable advantages: a seamless user experience, accelerated innovation, and enhanced security.\n\nThese characteristics make Solana particularly attractive to developers, the cornerstone of any blockchain’s success.\n\nThe NFT deposit platform DRiP, for example, benefits from Solana’s capabilities to send millions of NFTs at reduced fees, demonstrating the network’s technological superiority.\n\nPantera also highlights the versatility of Solana, issuer of the SOL crypto, capable of supporting various use cases challenging to implement on modular blockchains like Ethereum.\n\nProjects such as Hivemapper and Phoenix show how Solana’s monolithic architecture allows for the development of innovative applications.\n\nAdditionally, Franklin Templeton had already highlighted Solana’s advanced technology, describing it as ideal for the next waves of crypto adoption.\n\nAs a result, Solana is emerging as a major player ready to reshape the landscape of blockchain and crypto.\n\nGrowth of Solana: The Numbers Speak for Themselves\n\nThe rise of Solana is not limited to technological promises. Solana’s fundamentals show impressive growth, consolidating the bullish argument.\n\nThe number of unique active addresses on the network has increased from 14,000 in October 2020 to nearly 1.34 million recently. At the same time, Solana’s priority fees have exploded, reaching a historic high of over $60 million in March 2024, signaling growing demand.\n\nThe trading volume on Solana’s decentralized platforms and the record number of crypto launches bolster this momentum. Solana has even established itself as the preferred platform for retail crypto investors and meme traders, surpassing Ethereum in NFT volume.\n\nThese indicators show that Solana is not just a theoretical competitor but an expanding player ready to capture a significant share of the crypto market.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9PYl9YYzBQX3J6WU8tVWR6X0I4OElxMlpfWGNZRnF4ZDFNZXhDWTVIeXNDNjBndUZ5Nkp3ZVd1N19Bc2NvaVFJaDU0dWtHY2o5am9CZ1M2NUlnb0ctcXFWSjA4b3QxcFJLQUJ1RllGWm1KcTdMZkZlYTc0Z9IBgAFBVV95cUxQOVA2YWJtd0pvT05yV1I0ZDNuNUF2M2JLVm1qa0ZTS2E4UFN6Mk42cVI4c2VRbTZ0eGVvdVY3d3pKMUhudFZxZnRqMUl0UzZadHJQRDhQT2dzU2YzZWxuLTF3dnNsbjRmM1ZwNjBIWHA5SnpOUUQ0LTg0ZW5LbEcwZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Key signs Solana might be outperforming Ethereum - AMBCrypto News",
        "content": "Solana surpassed Ethereum in terms of DEX volumes.\n\nPrice of SOL declined materially over the last few days.\n\nSolana’s [SOL] performance since the beginning of the year has been extremely positive. Due to this momentum, Solana managed to outperform Ethereum[ETH] in terms of DEX (Decentralized Exchange) volumes.\n\nSolana DEX volumes on the rise\n\nThis DEX volume refers to the total value of cryptocurrency actually transferred between wallets on the Solana network. These transfers happen through swaps on DEXs, which utilize liquidity pools on the network and are all verified by Solana’s validators.\n\nThis DEX volume metric is considered a crucial indicator of a blockchain network’s fundamental value. It reflects actual usage within the network’s ecosystem, as opposed to just speculation on the price of the token.\n\nBy this measure, Solana’s strong DEX volume suggests it is currently outperforming Ethereum in terms of real-world use. This could be a sign of growing adoption and potential for future growth for Solana.\n\nEven though DEX volumes for Solana were on the rise, the overall activity on the network had declined significantly by 10.7% over the past month.\n\nMoreover, the number of code commits on the network had also fallen by 20% signaling a decline in development activity.\n\nEthereum, on the other hand, showed growth on both these fronts. Overall active users on the network grew by 2.2% over the past month and the number of code commits surged by 10% during the same period.\n\nAt press time, SOL was trading at $126.47 and its price had declined by 5.21% in the last 24 hours, due to the recent market correction. Since the 21st of May, the price of SOL has declined materially.\n\nDuring this period, the price of SOL exhibited multiple lower lows and lower highs, indicative of a bearish trend.\n\nThe RSI (Relative Strength Index) for SOL also fell materially over the last few days. It was below the 40 mark, indicating that SOL may be slightly oversold at the time of writing and could see a reversal soon.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe Awesome Oscillator (AO) for SOL had declined indicating weakening buying pressure and potentially increasing selling pressure.\n\nHowever, the volume at which SOL was trading had surged by a significant 212% in the last 24 hours."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPTzFoUjVaTjg4Z1hOVTVHclhyNE9qM1czdVdkMTlRMEk1RV8zOWN4NFJkWWx0NExZT2tUU3o2UHpDVlgwcU5TUXhPN2xyX2VBQnFSZHhNRmV2eUxfUjVsU0JqZWRabk9lYTFzS0cwUGJNZWJtV2VuRFV0aldVdVRncGJNVHlvNjRVMWZCZ0J1VzTSAZYBQVVfeXFMTTllR3h2WENzV3ZoRjhFaG5pdm1BRnA3TTVodHp3Nkx5cmF5MTlFRDFxem42OXdHLVNNdUczb3dub3M0S2Fyb0t2YXdaM0hxVENtRzJkQjBjWWxURkhZb05oMmJiVVA3dlg5S1RTWGkyQkNoVU9qWGsweE5kU0tiTnFFZUduZTNuSDhOQ2FZZlNnT1F5WEFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Institutional Investors Sell Bitcoin, Ethereum Worth $690M, Buys XRP - CoinGape",
        "content": "At a time when institutional investors are bearish on Bitcoin (BTC) and Ethereum (ETH), altcoins such as Solana (SOL) and XRP are seen as better alternatives. CoinShares claims further outflows from digital assets funds globally indicate a “true correction” is underway. Digital asset investment products have recorded $1.2 billion in outflows in two weeks.\n\nHedge funds are expected to exit Bitcoin and remain short on crypto stocks such as MicroStrategy, which could risk further selloff in Bitcoin.\n\nadvertisement\n\nCrypto Assets Saw Second Consecutive Week Of Selloff\n\nThe $1.2 billion outflow from digital asset investment globally reflects pessimism amongst institutional investors for interest rate cuts by the US FED this year. Digital asset investment products recorded $584 million outflow in a week, according to a CoinShares report on June 24.\n\nJames Butterfill, head of research at CoinShares, said “Bitcoin was the primary focus, seeing US$630m in outflows, but recent negative sentiment has not seen investors add to short positions. Multi-asset products saw US$98m inflows, suggest investors seen the weakness in the altcoin market as a buying opportunity.”\n\nThe selloff mostly came from investors in the United States and Canada, accounting for $475 million and $109 million, respectively. They are followed by Germany, Hong Kong, and Sweden. Interestingly, Switzerland and Brazil defied the selloff and saw inflows of $39 million and $48.5 million, respectively.\n\nAlso Read: Crypto Market Crash — Here’s Why Bitcoin, Ethereum, XRP, SHIB Are Falling Today\n\nSolana and XRP Recorded Buying\n\nAltcoins such as Solana, XRP, Litecoin and Polygon saw inflows as Bitcoin, Ethereum and Cardano remained under selling pressure. Bitcoin price fell under $59k, a recording a dip of 5% in the past 24 hours.\n\nSolana recorded $2.7 million in buying by investors in a week. SOL price currently trades at $137.36, up 9% today after buying from the recent dip witnessed by altcoins. The 24-hour low and high are $125.90 and $136.73, respectively.\n\nMeanwhile, XRP saw $0.7 million in investments in a week. XRP price jumped 0.34% in the past 24 hours, with the price currently trading at $0.475. The 24-hour low and high are $0.469 and $0.482, respectively. Furthermore, the trading volume has increased by 5% in the last 24 hours.\n\nAlso Read: Political Memecoins Might Be Biggest Winner In Trump Vs Biden Debate\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQaERlcUstcEdkR3h4YUdXeWcxUEJQSmdqalIwb1B0N19ZbHFIdFFXdDF5Uy0yNkhWYmJVMHJTZ1BUal9QQXRVaXhKRG1SVUlCY0h6dDdnZVdLem1leU03aTlsYWEwQTR2ZGhXLVVKNzBlODRPVmx5VnVIRnk1VkF3cENYNE9NZ1ljelNTODVhRk1fRXFKa1VyZWYydELSAaIBQVVfeXFMTkdNX2t1NndxdmE4b1VWRllLTjJKZkd1anlrbTFXb2Fid0xhSTdKYndOS2NmNXpBbWxrQ19zMDJmckRwQTMtTzYxWTJvbHlYMmlnV2J3S3JicjBZNHdfS3hZVFFCNjhSX2w2RGs4LWhOajRVendIQkxXYVdnNkE0VEM0bVRIRnJKUEl5NVBVc3YyS29tN0NPQk1seEtlSk1CR3NR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Despite Ethereum’s development, this group isn’t interested in ETH right now - AMBCrypto News",
        "content": "Ethereum outperformed all other networks in terms of development activity.\n\nWhale interest in ETH declined significantly in the last few days.\n\nThe recent buzz around ETFs on the Ethereum [ETH] network did not interrupt development activity on the Ethereum network one bit.\n\nDevelopment on the rise\n\nEthereum had one of the highest number of code commits and active developments on its network.\n\nWhat exactly are the devs up to?\n\nIn the recent developers call, Ethereum developers ironed out details for the upcoming Pectra upgrade to the Ethereum system. Pectra is being rigorously tested on special test versions, called Devnets, before going live.\n\nThe next test version, Devnet 1, will introduce two major changes. First, it will implement a more efficient way for validators, the special computers that verify transactions, to work together.\n\nSecond, it will introduce a new system called EIP 7702. This system allows users to grant permission to other programs to control their transactions, similar to giving someone a key to your digital wallet.\n\nHowever, there’s an ongoing debate about how users can take back this permission if needed. Developers are scheduled to meet again to finalize this crucial aspect of EIP 7702.\n\nBeyond the Pectra upgrade, the meeting also covered progress on other Ethereum developments.\n\nFor EOF, a separate upgrade focused on data storage, testing of client implementations will begin after finalizing Pectra changes.\n\nThe EOF team will provide more tests to aid development. Additionally, EOF meetings have shifted to bi-weekly as specifications are finalized.\n\nFor PeerDAS, another independent upgrade enhancing validator communication, the next testnet launch is expected within two weeks. Unlike Pectra, PeerDAS will use finalized Dencun specifications.\n\nThe meeting also included announcements. A new standardized format for writing improvement proposals was suggested to ensure better reviews.\n\nNotably, a new GitHub resource page “eth-clients” was introduced for Ethereum developers.\n\nETH remains stable\n\nAt press time, ETH was trading at $3,494.20, with its price had grown by 0.12% in the last 24 hours. Retail interest in ETH was rising.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nAccumulation by addresses ranging from the 0.001 to 10 cohort collected large amounts of ETH over the last few days. Whales did not show similar interest in ETH and were letting their holdings go.\n\nEven though this selling pressure is being absorbed by retail investors, a reversal in whale sentiment would be required for ETH to see green again."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQRlVzTnlsdl9kY1I0TFhCcFdndUNMTU9ITXZaTkZ4MkE0LUcweUhyOEQ2cDdnMWc2TkhvUUgtQzZuNTM2Yk14andIcXVSWUd2R0x4N195RmhsX0Y4djBWUlFwVm9RRHdRT2RhZzVXdTcteHdyWnhTU3NjZG55TVFBTDUzY0pOdzcxYU42X2o3T1DSAZ4BQVVfeXFMTUNkMUp0bTY0bzNhY21YU3BURXA5SkhNdmRJV0VLU0RtUldtTGFwYXhLWUwteV9vOGhmR3NfTks3TEx5b0FxR016M0VBb2VjcmVZdEVSWHduMkNiODh6cXpjbURNVWRqZlBPNFdmOVh4dzB3STQ2dEhyY3BobnpnVFhMQWFjM2M1b3lTNkxKY09LVUFlbUFuWDRIUG95RlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 24, 2024 - Analytics Insight",
        "content": "Short Term Outlook\n\nIn the short term, Ethereum price is likely to remain volatile due to ongoing macroeconomic uncertainties and market sentiment. Investors should watch for further developments in global financial markets and any significant news regarding Ethereum's technological upgrades.\n\nLong Term Outlook"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQekdLV0xGcllMVkZMdVE3UzQ5TTJSa3cxdHB5MUgxUEpoVU45TjFJLW02MXVSbDU5OWhVSjdYR3NBb051VXJNSHpRZktYdFVzSTRhckRPZGRFTF9oTzN4MHl4MktaVlhTeWdLM3BRNTlFdUtzU2I1MjlVNTBJTnpkWS1BbGFkT1ZpSkHSAY8BQVVfeXFMTzV4UXFhM2dsQXZURExIZE9mSV9yQkZGTUdUMjNhb0N6ckd5NnV6RHhSbkNfQ0Z6M3NoaGwzRFFPWDh3d2JZS3NFS0tNanRyNklLb2xybGdpdHUtRXBBSTdGSHVreHo3SFRCVVp6N1J1cVhNcFVyRGFyOXBaTzNLRmhLYjU0dUZfdmhCTlRaVjg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Ethereum makes efforts to stabilize its price – is it working? - AMBCrypto News",
        "content": "Ethereum saw a record number of daily active addresses.\n\nETH’s support has continued to hold.\n\nEthereum’s [ETH] recent spike in a key on-chain metric is noteworthy, especially considering its recent price trends and its struggle to maintain levels above a critical support line.\n\nHowever, it’s interesting to note that despite this spike, other on-chain metrics have displayed typical patterns.\n\nEthereum sees more active addresses\n\nAMBCrypto’s analysis of Ethereum’s Daily Active Addresses metric from Santiment revealed recent consecutive spikes, indicating a significant increase in network activity.\n\nOn the 21st of June, the number of daily active addresses reached over 617,000, marking the highest level since the 23rd of March.\n\nHowever, this record was surpassed the very next day, on the 22nd of June, setting another high point.\n\nEthereum’s Active Addresses indicated that by the close of trading on 22nd June, the number of daily active addresses exceeded 731,000.\n\nAMBCrypto then took a deeper look at the historical data, which revealed that the last occurrence of such high activity was around ten months ago.\n\nIn September 2023, the number of active addresses surged to over 1 million, marking the highest recorded level up to that point.\n\nThese spikes suggest a heightened level of engagement on the Ethereum network, which could be driven by various factors such as market movements, new developments in the ecosystem, or increased adoption.\n\nHowever, these spikes did not impact the volume.\n\nWhat of Ethereum’s volume?\n\nAMBCrypto’s analysis of Ethereum’s trading volume reveals an interesting contrast to the spikes in daily active addresses. Despite the increase in active addresses, trading volume declined.\n\nBy the end of trading on the 22nd of June, the volume stood at around $9 billion, which might initially seem substantial.\n\nHowever, when compared to the $15 billion recorded in the previous trading session, this represents a significant decrease.\n\nThe discrepancy suggested that while more addresses were active, possibly indicating increased user interactions or transactions on the network, these did not translate into higher trading volumes.\n\nThis pointed to possibly smaller, less value-intensive transactions dominating the activity during the period.\n\nETH’s bear trend weakens\n\nEthereum’s price chart indicated that it was currently striving to maintain its support level.\n\nAMBCrypto’s review of the daily timeframe chart showed that although there has been a decline in its price over the last few days, the support level has effectively held at around $3,400.\n\nAs of the latest data, Ethereum was trading at approximately $3,490, experiencing a slight decline.\n\nThis suggests tentative stability, as it manages to stay above the crucial $3,400 support level, which could be pivotal in determining its short-term price trajectory.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThe analysis of Ethereum’s Moving Average Convergence Divergence (MACD) indicated that it was in a bearish trend at press time.\n\nHowever, the behavior of the MACD lines suggested that this bearish trend was weakening. Should the price increase, this could diminish further, potentially signaling a reversal or at least a slowdown in downward momentum."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPY190VHBKVEZfTG5sT3l6UUdXS2JBOGpsNHIwUXF5NlpSWDU3TzktWW11MEJlMXRjOFJJUTcyV2RpYmpWMnFRX09fX2ZCaS0tN2FBbUpXVGZhMmd4U3cyaW9yNzM0MkdjdVRaLU9JcEx5UWdZalliNkFnaHp3bHBNYUpieFhZN2tuVGpMQmZMOEVPTTdmWkVBQnhHX21XaktodUdyZ09EUklTVkZkdHhoeWg5WmVzTi1wTDdlNFR0Wk1lR2RFRjFEWndKWFNtMzDSAdwBQVVfeXFMTjZWWHBSUDdPUkNNd294Z0N1UF9sRE8xNTg0US1yX00ydzVZZ0JBRWRfcnU0a0lDaVR1cjBXY0tEenJvRVZlampFcXoySjVMeC1VZjNXc2RLMnRxelNoRVBsaDVWYWc5aVFXLTNtdWU1QjdUczc5Z2ZvZ2MyTTJsMTFvOUhndzRpMHBJS3RyZS1jVm14RzRzWFpaTDl6RWRuU2VYcmVWQmZldWxYR1p2Wkg1ZkxISFhqcEEtT09yVTVDaHBxLWFfWFFDSGkwN01HWUo5WWI1RTA1R3cxbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Sees Surge in Activity, Is it Poised for Price Rebound Soon? - Analytics Insight",
        "content": "Ethereum has seen an increase in active addresses, which are now at their highest in three months at 617,170. This increase, as pointed out by crypto analyst Ali Martinez, shows that more users are actively using the network.\n\nAn increase in active addresses is usually associated with higher transaction volumes, which signify improved market sentiment. With more users coming into the Ethereum network, the requirement for ETH may increase, which could positively impact the price of ETH."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOY0RqT2g2Y2pSRjhscXdTeEZzeml5V2hxMUxtM25SbTBvSUFHMk5wWkplTm53Znlfb29YMTdTN0lNUTMzZmRSM0Y3a2tfMmtibWlRbVFwalIxQTVUUTdPbGdzVDNfTkFBelBLZERIcDF1cWl1NjhzdEx5akhQTTJVVEkxRTRGaV92NGdpeHp5dmE3LWE4dXhERTBjQUgxTXVEQUlN0gGoAUFVX3lxTE1od1pteWJEQkY5SUZpRlBtcjBvQkNlT2w0QUdZaHdnQWdCT0R1TFJyc0kwRmVTX25pekY1Z004bHVJc3VIQnJYUTN2R0IyWFpFZ3BGRGFKOXVRYXAxWk8ycUZmUkZtU3MzbG5zOGk0QkFVLUtXUU56aUdOa29NMUpXWm9NVzdSY1RBSEV4UnY1bTlvYXg5ZTFEUmxTSDVDZFRWc1pMdnIyWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Crypto Market Crash: Here’s Why Bitcoin, Ethereum, XRP, SHIB Are Falling Today - CoinGape",
        "content": "Crypto market saw bears gradually taking over bulls, with the market cap tumbling from $2.35 trillion to $2.24 trillion in the last 24 hours. Crypto investors lost $180 billion in net wealth in a week as market sentiment slips to “Neutral” today. The crypto market fear and greed index continues to slide from 76 (extreme greed) last month to 51 (neutral) on June 24.\n\nBitcoin price plunges more than 4% to a 24-hour low of $60,858 amid continued selling pressure and uncertainty. Traders eye BTC price to slip below $61,000, the support level it hit in April and May as well. BTC spot and derivatives traders look extremely bearish due to a focus on U.S. PCE inflation data and monthly options expiry.\n\nadvertisement\n\nEthereum price also tumbled 4% in the last 24 hours, making the monthly drop to over 10%. ETH price is currently trading at $3,366 with a trading volume rising 73% as investors liquidated their holdings.\n\nAltcoins such as Solana, XRP, Toncoin, Dogecoin, Cardano, and Shiba Inu tumbled 3-6% in the last 24 hours. Meme coins and AI coins are witnessing massive selloff, leading to correction in the crypto market. dogwifhat (WIF) leads with a 14% fall in the past 24 hours.\n\nCrypto Market Nears Crash As Traders Brace For Macro Events\n\nCoinglass data indicates the popular cryptocurrencies recorded a liquidation of $170 million today, with $280 million liquidated in the last 12 hours. Over 90k traders were liquidated, with the largest single liquidation order happened on crypto exchange BitMEX after a whale sold XBTUSD valued at $10 million.\n\nOver $100 million in long positions in BTC, ETH, SOL, DOGE, NOT, ORDI, PEOPLE, WIF, PEPE in the last 4 hours due to uncertainty in the market. This has caused the crypto market to bleed today.\n\nA week ago, CoinGape warned about BTC price crash potentially to the $57k level near the month’s end due to key macro events and options expiry. Investors are bracing for both US PCE and monthly options expiry on Friday, expecting a sharp correction before the date as the Fed eyes only single rate cuts this year. Moreover, key macro events such as ISM manufacturing data, Fed Chair Powell speech, the FOMC meeting release, and jobs and unemployment rate data are due in the first week of July.\n\nOver 105K BTC options of notional value $6.72 billion are about to expire on June 28, per the largest derivatives exchange Deribit. With a put-call ratio of 0.52 and the max pain point at $57,000, Bitcoin price is more likely to remain under selling pressure.\n\nAlso Read: Big Capital Rotation Into Altcoins to Begin In Two Weeks, Predicts Analyst\n\nAnalyst Predicts Bitcoin Price Drop To $50K\n\nMarkus Thielen, founder of crypto research company 10x Research, said it’s the time to make tough decisions as BTC price action looks weak amid continuous outflows from spot Bitcoin ETFs. He predicts Bitcoin could crash to $50,000 due to double top pattern formation. The key support level is at $60,000.\n\n#Bitcoin Double Top? Is It Time to Panic? How Low Prices Could Plunge? https://t.co/UOr9cWTisg pic.twitter.com/rtoTDf14E7 — 10x Research (@10x_Research) June 24, 2024\n\nBTC on-chain data and other analysts have also pointed to weaker BTC price action in the coming weeks. The concerns around massive selloffs by dumb money have risen, which could push BTC much lower.\n\nAlso Read: ETH Price Reversal Soon As Ethereum ETF Coming In Two Weeks\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQZmpvR3V6VkN1Q1Bqb3ZqcHB5WmhsenhTWU5TM3hSRzlCMlYwdzdvMWsxVzFFUHd1aExCSjFhSlhiOFFQTXJuaVlWVDR0T1BTRkRCWElNT1laWlJUOGxIYkVreDdSQXg2SHl4NlkzQkpSQ2FpYkZZNWN2VnRKSTVoZlNzaFlWaFA1ZTBuSGNUVEdpWmvSAZgBQVVfeXFMTlIxYzg5aHVzMVBPRDJrcm9rYVhYa2NjOU9NcHN3cU9zZTBJc052dkVGQXZCSHdMVTl2aWpGV0wtTVZPOGpQclFabF9BVFhiM2JYLUp3VUM4bGs4VHBxOVJnT3l6T2xmRjg1eVdCS292XzVVZGpCODA3b1FDZDVyX3ZrTWNuQmgxbk1mc2hFZWdHY3VhWmdLLXg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "New lows for Ethereum gas usage as ETH tumbles below $3400: What now? - AMBCrypto News",
        "content": "Ethereum gas prices declined, but fees paid out to validators rose.\n\nThe price of ETH declined, however, Network Growth surged.\n\nThe recent market drawdown impacted Ethereum [ETH] significantly as ETH’s prices fell below the $3400 level.\n\nLow Ethereum gas, high fees\n\nCoupled with that, the Ethereum gas price declined. Despite the declining gas prices, in terms of fees paid out to validators, Ethereum outperformed other networks such as Solana [SOL] and Tron [TRX] by a large margin.\n\nThe higher validator fees, despite a gas price drop, could indicate continued strong network usage on Ethereum.\n\nEven with lower per-transaction fees, a higher volume of transactions could generate more total fees for validators.\n\nWhile validator fees might be high now, they might not be enough to offset the overall price decline of Ethereum.\n\nAt the time of writing, ETH had fallen by 4.14% in the last 24 hours. One of the reasons for the decline in ETH’s price would be its correlation to BTC which also fell considerably over the last few days.\n\nAccording to AMBCrypto’s analysis of IntoTheBlock’s data, ETH’s correlation to BTC was at high 0.78.\n\nEven with a significant decline in Ethereum’s (ETH) price, a large portion of holders seem to be in it for the long haul. On average, investors are holding onto their ETH for a whopping 2.3 years.\n\nThis long-term view is further supported by the fact that coins being actively traded are still held for an average of 2 months, indicating a reluctance to sell.\n\nThe average holding time of traded coins offers valuable insights into investor confidence.\n\nWhen coins are held for longer periods, it suggests investors believe in the long-term potential of Ethereum and are comfortable holding onto their assets.\n\nConversely, frequent trading activity may indicate a focus on short-term profits and less faith in the future of the market.\n\nOn-chain data\n\nNetwork Growth for ETH surged materially over the last few days.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nSo, many new addresses were interacting with ETH at the time of writing, implying that a large amount of addresses were interested in buying ETH at the current discounted rates.\n\nMoreover, the velocity at which ETH was trading had also grown, suggesting that the frequency at which ETH was being transacted had surged."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQLU8yZ0ZiVkl2WHdmanhXWjFQWTZmd3ZxaGhOYWkwWk5tWGUybWUtZ1dnOUJQS19RakdUWmpHUHF6S0tPV2NTWjc4REE5RVRReDBESjN6Q3pwNXRrYk1zUWZMa0VQUmQtaVdHQ1NyTjUybGZEdWZTM1RGenRsS2pPZ0dOTHFIcEFvNUxoUTlPbHg4LTN1cXR4VldJSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "ETH price prediction as Ethereum records largest spike in active addresses - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) is witnessing increased activity both on its network and from the legal front. Amid these developments, attention is being paid to the valuation of Ethereum as the decentralized finance (DeFi) asset continues to battle key resistance levels.\n\nIn recent developments, the network has experienced a surge in active addresses, according to data provided by crypto analyst Ali Martinez in an X post on June 22.\n\nThe data shows that Ethereum saw its largest spike in active ETH addresses in the past three months, reaching 617,170. This uptick in activity suggests increasing interest and engagement with the Ethereum blockchain, which could affect its price trajectory.\n\nEthereum active daily addresses chart. Source: Santiment/ali_charts\n\nThe increase in active addresses could be interpreted as a sign of growing network usage and confidence in the platform. Historically, such spikes in active addresses have often preceded price rallies, as increased activity can indicate higher transaction volumes and more utility.\n\nIn addition to the increase in active addresses, Ethereum is also witnessing a rise in other metrics. According to data provided by crypto analytics platform CryptoQuant, Ethereum’s Market Value to Realized Value (MVRV) indicator is rising faster than Bitcoin’s (BTC) MVRV.\n\nMVRV is the ratio of a digital asset’s market capitalization relative to its realized capitalization. It is used to assess whether the token is undervalued or overvalued.\n\nEthereum price prediction\n\nThe spike in user activity coincides with a period when Ethereum is largely subdued, aligning with overall crypto market sentiments. In this line, CoinCodex, a platform utilizing AI-driven machine learning algorithms, has offered Ethereum’s price prediction in the short term.\n\nAccording to data retrieved from the platform on June 23, ETH will likely trade at $3,552 by July 1, 2024. The forecast reflects a modest price gain of 1.6%.\n\nEthereum price prediction. Source: CoinCodex\n\nEthereum remains in focus after the Securities and Exchange Commission (SEC) moved to close its “Ethereum 2.0” investigation of ConsenSys. According to ConsenSys, the SEC’s enforcement division notified the blockchain company that it was closing its investigation into Ethereum 2.0. The SEC noted that it “would not bring charges alleging that sales of ETH are securities transactions.”\n\nEthereum price analysis\n\nAs of press time, Ethereum was valued at $3,497, having recorded minimal gains of about 0.05% in the last 24 hours. On the weekly chart, Ethereum is down 2.5%.\n\nEthereum seven-day price chart. Source: Finbold\n\nOverall, over the past seven days, Ethereum has faced significant downward pressure, influenced by regulatory news. The key support level to watch is around $3,495, with major resistance at $3,550. If Ethereum can maintain above $3,495, it might attempt to break through $3,550; failure to hold $3,495 could lead to further declines.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE03TFVnckxiazJQendsT0JDQmpqcGQzdXpMVDNWZnNDUGlWblBTT0pCeWt3X21fZW8temtEUHgwUHpkZEVLR3VGNjZPbmZIU3djOG8tN1JQZW1UZmtrSDlhN1VFQ2UtSFZSXzRDZnhQZGJEYjVOSVpZSg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Can ETH Price Fall Below $1000 - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "While Bitcoin ETFs attracted numerous new investors, making it easier for them to include BTC in their portfolios, the influence of ETH ETFs is much more uncertain, according to Kang.\n\nThis observation comes from crypto entrepreneur and investor Andrew Kang, who shared a detailed analysis of the effect of Ethereum ETFs on X on June 23.\n\nThe response and market sentiment toward Ethereum spot ETFs have been less enthusiastic compared to the excitement seen with the launch of Bitcoin ETFs earlier this year.\n\nThere are 120.14 million ETH in circulation, with a yearly supply decrease of 0.24%, meaning 292,161 ETH were removed from the supply over the past year.\n\nEthereum hit its highest price of $4,867.17 on November 10, 2021, and its lowest price of $0.42 on October 21, 2015. The lowest price since its all-time high was $897.01, and the highest since then was $4,094.18. Currently, the market sentiment for Ethereum is bearish, and the Fear & Greed Index is at 51, indicating neutrality.\n\nToday, Ethereum is priced at $3,332.52 with a daily trading volume of $24.88 billion and a market cap of $400.36 billion, holding 17.73% of the market. Its price has dropped by 5.53% in the last 24 hours.\n\nBitcoin's price has dropped to $61,500, the lowest since early May, and is down over 10% from its recent peak. At the same time, other major cryptocurrencies like Ethereum , XRP , and Solana have seen even steeper declines, causing the total market value to shrink by $200 billion in the past week. The second major crypto ETH is also dropping. Will ETH price fall below $1000? Let's take a look at this Ethereum price prediction article in more detail.\n\nKang predicts that the flow of funds into Ethereum ETFs will be about 10% to 15% of what Bitcoin ETFs experienced, leading to an estimated $500 million to $1.5 billion in net buying within six months.\n\nLast week, it was reported that Fidelity would start its Ethereum ETF with $4.7 million, indicating that the buying has already started. In March, Standard Chartered forecasted that inflows could reach $45 billion in the first year of Ethereum ETF trading.\n\nHowever, Kang explained why the impact of an Ethereum ETF might be less significant than that of Bitcoin. He noted that Ethereum is considered more of a tech asset, unlike Bitcoin, which is viewed as a macro asset. Additionally, there is less institutional interest and buying pressure for Ethereum. Its current valuation metrics, such as the price-earnings ratio, make it a harder sell for traditional finance investors, he said.\n\nThe limited inflows and institutional interest could mean a smaller impact on Ethereum's price compared to Bitcoin, as the expected buying pressure from ETFs will be less intense.\n\nWill Ethereum Price Drop Below $1000?\n\nTo determine whether Ethereum's price will drop below $1000, we need to analyze several key factors influencing its market dynamics. Ethereum's price has increased by 75% in the last year, indicating a strong upward trend. It has outperformed 57% of the top 100 crypto assets over the same period, showcasing its competitive edge in the market. This historical growth reflects solid investor confidence and a robust market position.\n\nFrom a technical perspective, Ethereum is trading above the 200-day simple moving average, a bullish indicator that typically signals continued strength in price action. Despite recent fluctuations, maintaining this position above a crucial moving average suggests that the market sentiment remains relatively positive. This technical strength is a reassuring factor for investors concerned about potential price declines.\n\nEthereum's supply dynamics also play a crucial role in its price stability. The yearly inflation rate is negative at -0.24%, meaning the supply of ETH is decreasing slightly over time. This deflationary characteristic can support higher prices as supply diminishes, adding another layer of price support. With a high market cap and substantial liquidity, Ethereum is less prone to severe price swings compared to smaller, less liquid assets. This stability can act as a buffer against drastic price declines, further reducing the likelihood of the price falling below $1000.\n\nWhile Ethereum has been outperformed by Bitcoin recently, which may attract some investors away from ETH, this doesn’t necessarily imply a price drop below $1000 but rather a potential shift in capital allocation within the crypto market. The fact that Ethereum had only 13 green days out of the last 30 (43%) suggests some short-term bearish sentiment. This could indicate potential short-term volatility, but not necessarily a significant long-term decline.\n\nDespite lower inflows expected from Ethereum ETFs compared to Bitcoin ETFs, the initiation of these financial products still reflects institutional interest. The additional buying pressure from these ETFs, even if modest, can help sustain or increase the current price levels. Analyst Andrew Kang’s prediction of lower ETF inflows compared to Bitcoin and the challenges in Ethereum’s valuation metrics could result in a less pronounced price increase. However, considering Ethereum’s strong performance metrics, negative inflation rate, and high liquidity, a drop below $1000 seems unlikely under normal market conditions.\n\nSo, while short-term fluctuations and bearish sentiment can lead to temporary price drops, Ethereum's strong historical performance, technical indicators, negative inflation rate, and high liquidity provide a solid foundation against a decline below $1000. Therefore, based on the current data and market conditions, it is improbable that Ethereum will drop below $1000 in the near future."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBUVkVLUFpBUXJjTkxFUFdaOWlfdU52ZTRmRXpTcUxjZ3NDQVNCRGM2NWQ4bGxkZW5LRDM3bGNMNEtWNmZIQ21zb1N2QTM3a3IwbUFsdXA4Nkw0LXRJTEgxRldmY3VGbzVXT3dnY0dTTnXSAXZBVV95cUxOTVpnR2VFNWJXRTVDM19lbTFKWWt6M3gyTkpuSW9tN1hVME5jTTAxdXBjLVgtVjNmR2F0TU1rbjNjeF9EeHl0VjQ0a1IwZjZsbmNXWlVreTdlSFN6QkxoVVdIV1VacU1PZ1JjRFpfX09WR2dZcjhR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 04:03:00 GMT",
        "title": "Ethereum Price Trims Gains as Bitcoin Slump Drags Crypto Market - NewsBTC",
        "content": "Ethereum price struggled to climb above the $3,550 resistance and trimmed gains. ETH gained bearish momentum alongside Bitcoin and tested the $3,385 zone.\n\nEthereum is trimming gains from the $3,550 resistance zone.\n\nThe price is trading below $3,500 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $3,465 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could gain bearish momentum if it dips below the $3,385 and $3,350 support levels.\n\nEthereum Price Dips Further\n\nEthereum price struggled to start a fresh increase above the $3,550 zone. ETH followed Bitcoin’s bearish path and the price declined below the $3,500 level. The bears pushed the price below the $3,420 support zone.\n\nA low was formed at $3,388 and the price is now consolidating losses. It is struggling near the 23.6% Fib retracement level of the recent decline from the $3,543 swing high to the $3,388 low. There is also a key bearish trend line forming with resistance near $3,465 on the hourly chart of ETH/USD.\n\nEthereum is now trading below $3,500 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $3,430 level. The first major resistance is near the $3,465 level and the trend line.\n\nThe trend line is near the 50% Fib retracement level of the recent decline from the $3,543 swing high to the $3,388 low. The main resistance sits at $3,520 or $3,550. An upside break above the $3,550 resistance might send the price higher. The next key resistance sits at $3,650, above which the price might gain traction and rise toward the $3,720 level. Any more gains could send Ether toward the $3,880 resistance zone in the coming days.\n\nMore Downsides In ETH?\n\nIf Ethereum fails to clear the $3,465 resistance, it could start another decline. Initial support on the downside is near $3,385. The first major support sits near the $3,350 zone.\n\nA clear move below the $3,350 support might push the price toward $3,220. Any more losses might send the price toward the $3,100 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 zone.\n\nMajor Support Level – $3,350\n\nMajor Resistance Level – $3,465"
    }
]