[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5QbGs1SmhCeGNYVXM5WVNZV3VieUYyUXNPdjA5dUZFSUtRRDVqTFZIQjR2VzJLVk0xdGJ6TnVuODZtc2lveFIzcDJOVzlPdHZMRnhIVnlNZVdITHNfM0d5UnJmSWdVTmZGSzlTcg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Selling Ethereum in 2024: is now the right time? - Crypto Briefing",
        "content": "Share this article\n\nEthereum is a decentralized blockchain that supports smart contracts and far-reaching dApps. If you wish to trade in ETH, you need to analyze the project’s performance, trends, upgrades and updates, and basically any other aspect that could impact its price. This will help you determine the right time to sell or buy ETH. Depending on these factors, you may then decide to hold onto your ETH or convert ETH to USD.\n\nHere, we examine Ethereum in more detail to help you determine whether now is the perfect time to sell your ETH.\n\nWhat Is Unique about Ethereum’s Technology?\n\nThe Ethereum network is an open-source protocol that runs on the Ethereum Virtual Machine. It supports an immense ecosystem of decentralized apps as a pioneer of blockchain smart contracts. Since its inception, Ethereum has been a pacesetter in digital trends such as NFTs, GameFi, Web3, Metaverse, and decentralized finance (DeFi).\n\nThanks to the network’s vast applications, serious concerns have emerged regarding its massive energy consumption, high transaction costs, and scalability. Some investors are already considering selling ETH in preference to its competitors — Solana, Polkadot, Binance Smart Chain, and Cardano. You can read more about some of these crypto projects on the Paybis blog.\n\nEthereum 2.0 Updates and Upgrades\n\nEthereum 2.0 reduces gas fees and increases transaction speed from 30 TPS to 100,000 TPS. The goal is to ensure ETH is more usable with increased adoption to grow and stabilize its price.\n\nThe upgrade also saw Ethereum move from the proof-of-work to the proof-of-stake consensus mechanism. This migration helped the network to reduce its carbon footprint by over 90%.\n\nThe evolution of Ethereum has been long in the pipeline. It started with the launch of the Beacon Chain in 2020, and ever since, we’ve witnessed the Berlin and London upgrades.\n\nOther notable upgrades that followed included Arrow Glacier, Gray Glacier, Bellatrix, and Paris. The last three were collectively referred to as ‘The Merge.’\n\nIn 2023, the Uniswap V4, a new smart contract protocol, was launched. However, Ethereum’s developers also recently rolled out the Shanghai upgrade that would allow ETH validators to unlock staked ETH, making rewards accessible.\n\nHow Has Ethereum Performed in Previous Years?\n\nLooking back at Ethereum’s ICO, we see how affordable the coin was at just $0.31. Up until 2016, the price averaged less than $1. ETH skyrocketed to an all-time high of $1,270 in 2018 but the real bull run came in 2021 when it hit an unprecedented $4,891.\n\nSince then, the crypto market has experienced a bearish market, which saw most crypto projects shed a lot of their value. The crypto asset plunged to $890 on June 18, 2022, but has recovered well to register a 130% price gain from its current price. However, it’s important to note that it still grapples with a 58% decrease from its ATH.\n\nNavigating through the highs and lows, Ethereum faced heightened volatility throughout 2023. Towards the end of October, the entire crypto market received a significant boost fueled by the anticipation of a Bitcoin Exchange-Traded Fund (ETF) approval in the coming months. This optimism propelled the price of ETH upward, breaching the $2,000 mark on November 9th for the first time since July.\n\nWhat Is the Future of Ethereum?\n\nLooking at expertly derived technical charts for Ethereum, there’s a strong indication that the price will pull through the $2,300 resistance point.\n\nOnce Ethereum 2.0 updates and upgrades start fully rolling out, experts have forecast ETH to hit $2,700 in 2024 and $3,000 by 2025.\n\nSeasoned analysts and market veterans exhibit a bullish sentiment toward Ethereum, maintaining an optimistic outlook on its future price trajectory. Some even project that Ethereum could reach an impressive $40,000 by 2030. These forward-looking expectations underscore the confidence in Ethereum’s potential for substantial growth and sustained value over the coming decade.\n\nConclusion\n\nTransformative Ethereum 2.0 updates are poised to enhance the network’s scalability and sustainability. With the current ETH price at $2,500 and a market cap of more than $300 billion, the crypto market continues to showcase Ethereum’s resilience.\n\nAs the crypto landscape evolves, staying informed and adaptable is crucial when considering selling ETH. Consider diversifying your portfolio away from Ethereum, you can exchange ETH for up-and-coming competitors such as Solana, Polkadot, Binance, or the more established Bitcoin."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOUVdtZ1ViZ2ViOE0zOTJWTDVqZjltVkNLa01MRDlfcjk1YUNpLTBWZUt5aHV4RWx5d0VZbHdJUU8wSVFNRFJqSlpXcnFJeTBMWE8zLXpJb0lxSHFXU3ZpNDhseExRRHpIOHZjWTBYN2RyZ2U4RlFfcHlWUnFzZlVjb1p4MmFuOEVyQkcwQW03c2cxZjN1X0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Commodity or Security? No One Knows When it Comes to Ethereum (ETH) - Securities.io",
        "content": "If Bitcoin is the most representative asset of the crypto world, Ethereum has helped the principle of decentralization find its footing in the blockchain world and beyond. Ethereum-powered smart contracts have helped build applications that have eventually led on-chain transactions and communication to become intermediary-free in a trustless and secure fashion.\n\nFrom encouraging a fairer financial system to tokenizing real-life assets and empowering us with an open internet – free from monopolizing entities controlling user data – Ethereum has been at the forefront of making the blockchain-powered world a more democratic, equitable, and innovative space. It is no wonder that Ethereum occupies close to one-fifth of the crypto world's market capitalization.\n\nHowever, despite being one of the most catalyzing assets, Ethereum has been finding itself in regulatory limbo for quite some time now.\n\nClick here to learn what Exchange Traded Fund (ETF) means.\n\nGary Gensler's Interview and the Uncertainty around ETH's status\n\nThe current US President, Joseph R. Biden, nominated Gary Gensler as Chair of the United States Securities and Exchange Commission on February 3, 2021.\n\nIn an interview given on Monday, June 27, 2022, Gensler characterized Bitcoin as a commodity but “refused to lump Ethereum's Ether, the No. 2 cryptocurrency, under the same label.” This reluctance to characterize Ethereum led to confusion regarding whether Ethereum was a commodity or security.\n\nIf it were a security, any sale and purchase with its use would count as capital gain, requiring it to be reported to the IRS, essentially making it unusable for small purchases.\n\nMore importantly, Ethereum's security status would put it under the supervision of the Securities and Exchange Commission and all the restrictions that SEC regulations bring.\n\nWhile this mist of uncertainty and confusion surrounding Ethereum could be far-reaching in its impact since many crypto and blockchain projects are dependent upon it, we shall discuss some of the most crucial concerns that have arisen of late.\n\nETF applications: Will SEC Approve?\n\nWith as many as 11 Bitcoin ETFs recently getting approval, speculations are rife about whether Ether ETFs experience the same outcome. When asked about this, the SEC Chair, Gary Gensler, did not disclose anything decisive. According to press reports that came out after Gensler's Squawk Box interview with CNBC on February 14, “Gensler simply indicated that the process would be handled in precisely the same way as Bitcoin.”\n\nA list of Ether ETF applications has been delayed and postponed by the SEC so far, including that of:\n\nInvesco\n\nGrayscale\n\nFidelity\n\nBlackRock\n\nVanEck\n\nHashdex\n\nFranklin Templeton also filed for spot Ether ETF on February 12. The SEC will come out with its decision on these applications in the days to come. For instance, it would decide on:\n\n\n\nVanEck – May 23rd\n\nARK 21 – May 24th\n\nHashdex – May 30th\n\nFollowing these, by June 18, it would decide on Grayscale's application, leading up to decisions on Invesco's by July 5. Concluding this sequence, by August 3rd and 7th, it would address Fidelity's and Blackrock's applications, respectively.\n\nWhile many ETH ETFs are in the pipeline for approval, experts are of the opinion that introducing the feature of staking can add more value. While advocating for staking as a future add-on, market experts believe that the initial Ethereum ETFs will be of a ‘plain vanilla' structure, where ETFs will track the spot price of Ethereum as a first iteration.\n\nHowever, incorporating staking rewards into these instruments would mean rewarding any ETH holder for bonding their holdings to validators. These validators would subsequently propose and attest to new blocks on the Ethereum blockchain to receive freshly minted ETH and a portion of the block transaction fees. According to an estimate, a fund with a balance of 9,600 ETH could earn an extra 32 ETH on a monthly basis.\n\nThere are several advantages of introducing staking to ETH ETFs. It would enhance the fund's revenue and ensure Ethereum's network security, fostering the active participation of validators to make the network more robust and resilient.\n\nIntegral to Ethereum, the presence of staking rewards to ETH ETFs signifies full ownership of the asset, allowing fund managers to innovate with these staking rewards in compensating their investors. They can opt to provide dividends or increase the net asset value (NAV) of the fund, offering win-win propositions for all stakeholders involved. However, for now, it would be too early to make credible forecasts on the shape Ether ETFs are to take in the future.\n\nMeanwhile, we may discuss the next agenda on our list, which we have termed the curious case of the Prometheum listing.\n\nThe Curious Case of Prometheum's Listing ETH as a Security\n\nPrometheum claims itself as an entity that has been building the Future of Markets. It claims to be providing solutions for ‘digital asset securities investing — bringing together a blockchain-powered platform with the benefits of a securities-regulated marketplace.' It also positions itself as an SEC and FINRA-registered entity that is into building the necessary connection between trad-fi systems and crypto investing. In short, it wants to do crypto differently by offering a platform where one can buy and sell digital asset securities in a securities setting.\n\nWithin this service environment, Prometheum has hit the headlines by announcing, to begin with, custody of ETH as its first digital asset. The move has baffled several crypto industry experts for multiple reasons. Let us look at a few of them.\n\nPrometheum enlisting ETH as a security could prove the claim of the pro-Ethereum lobby that it could be handled in the United States in a way that satisfies the regulatory authorities. Its ETH security service offering would also alter the way the United States authorities have asked businesses so far to come and do crypto business in the US.\n\nSpeculations are already doing the rounds that Prometheum's entry may force the Security and Exchange Commission to declare Ethereum as a security. And if the SEC does so, it could mean Prometheum holds a monopoly over the ETH security trading market.\n\nWhile Prometheum's approach towards ETH may seem innovative and aspirational in a market that is fast-evolving and burgeoning, industry analysts are apprehensive. And they've their reasons for their anxiety.\n\nFounded by Aaron and Benjamin Kaplan, Prometheum had its first regulatory approval in 2021. The Prometheum Ember ATS Inc. received approval to operate its ATS and provide accredited and non-accredited investors with the choice to buy, sell, and manage digital asset securities.\n\nIt hit the news when it went on to have a second and unusual regulatory approval from the Financial Industry Regulatory Authority, FINRA. The approval was to operate as a special-purpose broker-dealer for digital asset securities. Created as a category by the SEC in 2021, no one had managed to attain such approval before Prometheum.\n\nHowever, this dual approval from the SEC and FINRA did not make things more credible for legal experts in the field. While Prometheum claimed that it had found a viable route for crypto trading, the legal experts argued that the platform did not have any assets available for trading.\n\nSome also argued that SEC's approval and Prometheum's trading under its regulatory scheme compelled everyone to see ETH as a security, while it could be a commodity like gold or oil. It is essentially the dilemma that we have been discussing here. However, the Kaplan brothers appeared quite sure of their assessment of cryptocurrencies as securities.\n\nThey also put forth the argument that it is possible for their platform to list cryptocurrencies, like ETH, as securities under the exemption known as Rule 144. Rule 144 is put into use when one decides to facilitate trades in restricted stocks.\n\nNot only legal and regulatory experts but also the entry and manipulation of Prometheum have caused a stir in the US political world, as several Republican lawmakers have already begun pointing fingers at Gary Gensler. According to their allegations, Prometheum is nothing but Gensler's stooge that he has been using to drive his regulatory agenda.\n\nThe claim of the Republicans gained enough steam when Prometheum received an invitation to testify at a congressional hearing about crypto when it had very little experience in the space compared to many of its peers.\n\nAll these claims and counter-claims have added to the confusion and regulatory limbo that Ethereum had already found itself in more than a year ago and counting.\n\nThe third and final stream of confusion flowing around Ethereum is mostly because of its own evolutionary nature, and it has to do with the launch of Ethereum 2.0.\n\nThe Launch of a New Ethereum: What's in Store for the New Projects?\n\nEthereum's transition from a Proof of Work mechanism to a Proof of Stake mechanism was radical in many aspects. Ethereum 1.0, or Ethereum mainnet, which helped many innovative projects develop and flourish, operated on the Proof of Work consensus mechanism, allowing for the mining of ETH tokens.\n\nFrom September 15, 2022 onwards, Ethereum shifted to Proof of Stake, which involved the verification of transactions by staking. Of course, the transition was meant to achieve better results in the areas of network efficiency, security, and scalability.\n\nHowever, the differences between Ethereum 1.0 and Ethereum 2.0 covered more ground than mere performance improvement. It had its impact on the areas of a consensus protocol, blockchain conception, security, speed, energy, scalability, and gas fees.\n\nMany experts believe that the advent of Ethereum 2.0 has been like scoring a self-goal against one's own team. The transition from Ethereum 1.0 to Ethereum 2.0 made it possible for regular users to leverage the rewards that were earlier meant for miners. Now, everyday users can avail the same benefits by holding any ETH liquid-staking derivative.\n\nMany big players in the industry, like Coinbase and Frax, were quick to hop on this bandwagon. They promptly released ETH liquid staking derivatives. These derivatives were as beneficial as a regular ETH and were also a yield-generating asset. Like other derivatives, these ones offered exposure to the price movement of the underlying asset, ETH in this case, while maintaining liquidity and keeping staking benefits available.\n\nIn the long run, these ETH liquid staking tokens proved to be more capital-efficient than regular ETH, thereby offering very little incentive for the average user to hold onto ETH, especially considering that the primary benefit of holding ETH was the potential for price appreciation. However, with the advent of this shift, individuals now had the opportunity to invest in a liquid staking derivative, which not only retained the value proposition of ETH but also enhanced user profits through staking yields.\n\nThe evolution of Ethereum prompted many projects to integrate liquid staking Ether into protocols. Many who could not keep up with the shift had to face the risk of going into oblivion.\n\nEthereum: Dabbling in Status, Unfazed in Value\n\nWith all this confusion and doubt surrounding its status, one thing remains steady, and that is the value that Ethereum brings to the table in the world of decentralization. It continues to be a technology that helps digital money and global payment applications flourish, helping create a sustainable, wholesome economy.\n\nIn this economy, creators can earn online, and the unbanked population can access finance, significantly altering the traditional dynamics of lending and borrowing, making them more people-centric by freeing them from the clutches of intermediaries.\n\nMany real-world assets that were considered to be less liquid could be tokenized and moved across the board more freely. The tokenization of these assets made the system of selling and buying more transparent and traceable. Funds could easily reach where they belonged without requiring cost-bearing, complicated intermediaries to facilitate their movement and take a cut.\n\nWhile Ethereum's value as a tool geared towards development, growth, and prosperity in the Web3 world remains unmatched, its market and investment status need more clarity. While it is necessary to keep an eye on how the Prometheum story unfolds, we must also wait for the SEC's decisions on Ethereum ETFs.\n\nStarting from the end of May to August, one after another, these decisions will become public. Perhaps that will be the time for ETH to come out of the regulatory limbo and emerge as the game-changing asset that it had promised to be!\n\nClick here to learn all about investing in Ethereum (ETH)."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNZFZSdjh3ajRUcTVqSkk5UGdmVzUtTVRwNlphY0ZNX2hYYVdaaTZiYkMtSy1abXNFSk5IOVY2dUsybG9LWHJ0cDBJZklzaEJiVXpDUzVDa3V5eHk1RnFIRDgyLUN1X0w1cnlxSks2ZUMwY3I4VXhpZ0pMRkM1WWtJNjJLbm0yd3pFRDdxTEs5dTVIQ1FUMjlaQl9QWFQ1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Ethereum price approaches $3k amidst spot ETF anticipation, Dencun upgrade - CryptoSlate",
        "content": "The price of Ethereum (ETH) approached $3,000 on Feb. 19 amidst anticipation concerning developments that are expected to occur in the coming months.\n\nAs of 8:35 pm UTC, ETH was priced at $2,937 with a market capitalization of $352.96 billion. That change represents 4.12% growth over 24 hours — significantly greater than Bitcoin’s 0.4% gains over the same period and also greater than the crypto market’s overall 1.2% gains.\n\nLido Staked Ether (STETH) saw comparable gains of 3.88% over 24 hours. Ethereum 2.0 staking tokens as a category saw gains of 5.4%, according to data from CoinGecko.\n\nEthereum was responsible for a relatively small portion of 24-hour liquidations. The asset accounted for $35.48 million of liquidations, including $8.43 million in long liquidations and $27.05 in short liquidations.\n\nGrowth may be due to ETF anticipation, Dencun upgrade\n\nEthereum’s latest gains may be connected to the possibility that the US Securities and Exchange Commission (SEC) will approve a spot Ethereum exchange-traded fund (ETF).\n\nThough no significant regulatory developments around spot Ethereum ETFs occurred today, a relevant report from the brokerage firm Bernstein received widespread coverage. Analysts at the company predicted a 50% chance that a spot Ethereum ETF will be approved by May and a near-certain chance that such a fund will be approved within one year. Combined with other similar predictions in past months, this report may have affected investor sentiment and market activity.\n\nSome backlash has also emerged around Ethereum’s ETF prospects. Apollo co-founder Thomas Fahrer suggested that Coinbase’s leading role as an ETF custodian could compromise Ethereum’s proof-of-stake model by allowing the firm to “control the entire network.”\n\nData from Dune Analytics suggests that Coinbase is currently responsible for about 15% of all ETH staking, while another staking platform, Lido, is responsible for more than 31%. Because it is unknown how much crypto might be held in spot ETH ETFs, it is unclear whether Coinbase could gain dominance by holding funds on behalf of those ETFs. Furthermore, it is unclear whether the SEC will permit staking of ETH held in spot Ethereum ETFs, though some applicants aim to do so.\n\nApart from those ETF prospects, there is also significant anticipation around Ethereum’s Dencun upgrade, which is set to take place on March 13. That upgrade will notably include proto-danksharding, a feature expected to improve ETH transaction costs and scalability.\n\nEthereum Market Data At the time of press 10:39 pm UTC on Feb. 19, 2024, Ethereum is ranked #2 by market cap and the price is up 2.69% over the past 24 hours. Ethereum has a market capitalization of $356.82 billion with a 24-hour trading volume of $15.44 billion. Learn more about Ethereum › Ethereum $2,969.40 2.69% Crypto Market Summary At the time of press 10:39 pm UTC on Feb. 19, 2024, the total crypto market is valued at at $1.99 trillion with a 24-hour volume of $68.83 billion. Bitcoin dominance is currently at 51.35%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBlQXBuLW9rb0VuVWQwU2NqXzFLQmkyc0l3YlNqVjJjdHZmeU9PcmhXaXhXVUlXR3pEMWdIMlJTeTRvU0hSUnJnMHdBckc3S3BpVHdQZ3dQazU2VjdTUmhhdUtkRVNPREN4Yi1OS245SGwwSTNlaDcwZ2tRZkfSAYQBQVVfeXFMUFFySWppdTZIRkFxVmloQlBZbjR4dE9sVDRaR3d3WTFyTFExN0Vqa0lSYkYxdG1udHE3MjF4UnVsMFlmM1RXQ2V2WTluYjU5R3JzYUJxdkVTRzVvNk92dTJseVZBamdqNWRQMHVKYm9JekhXS05oMVQ0MzFZeUFha3htY2pP?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Up 28% This Month as Dencun Upgrade Nears, Scaling Networks Surge - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum has climbed almost 4% since yesterday at a current price of $2,910 and a staggering 28% since the start of the month—and analysts say there's reason to believe ETH could go even higher.\n\nAt the time of writing, there's less than a month left before Ethereum developers bring the much-anticipated Dencun upgrade to Ethereum mainnet. The upgrade will bring \"proto-danksharding\" to the leading proof-of-stake blockchain. It's a technical improvement that promises to reduce data availability costs and address some key scalability challenges. In short, it'll make Ethereum faster and cheaper.\n\nThere's also growing optimism that the U.S. Securities and Exchange Commission could this year approve a spot Etheruem ETF to begin trading. That optimism got a lot more potent after the SEC last month approved 10 different Bitcoin ETFs, which have since seen $3 billion worth of net flows.\n\nOne of the main indicators that traders like where ETH is headed: Options and futures contracts. On-chain analytics platform CryptoQuant shared a post from pseudonymous crypto trader Greatest_Trader that suggests that climbing open interest hints at increased confidence among traders.\n\nAD\n\nAD\n\nWill Ethereum Reach an ATH in 2024? “Notably, the chart reveals a significant surge in open interest, coinciding with #Ethereum's upward price trend, reaching its peak levels since July 2022.” – By @Greatest_Trader Link 👇https://t.co/GWHqi4Q4bA — CryptoQuant.com (@cryptoquant_com) February 19, 2024\n\n\"However, given the impulsive nature of the recent ascent, traders should exercise caution and consider the potential for sudden liquidation events, which could trigger notable short to mid-term price declines,\" they wrote.\n\nSure enough, there's currently $10.6 billion worth of open interest in Ethereum futures contracts, according to CoinGlass.\n\nOpen interest represents the value of open options and futures contracts for a particular asset. That value has climbed by 6% in the past day alone—and it's not that far off the $11 billion worth of open interest traders saw during the last big bull run in November 2021. At the time, ETH was trading above $4,800 per coin.\n\nAD\n\nAD\n\nTrading volume is another market indicator that analysts have been watching.\n\nSo far this year, Ethereum volumes have tended to pick up when there's been big news about Bitcoin—notably the approval and subsequent trading of spot Bitcoin ETFs in January.\n\nOver the three-day period after Bitcoin ETFs began trading in the U.S., Ethereum saw $130 billion worth of trading volume, according to CoinGecko data, clearing $40 billion each of those days. The main driver at the time appeared to be optimism that if the U.S. Securities and Exchange Commission had approved Bitcoin ETFs to trade, then it would be no time before it did the same for pending Ethereum ETFs applications.\n\nMore recently, though, volume has slowed down to around $15-25 billion per day, according to CoinGecko.\n\nThe TOTAL VALUE LOCKED in #ETHEREUM L2s just hit another ALL-TIME HIGH! $26.95 BILLION and counting!📈 2024 is the year of #ETH. We are just getting started.🚀 pic.twitter.com/mN10Fawbms — Leon Waidmann | On-Chain Insights🔍 (@LeonWaidmann) February 19, 2024\n\nBut things are picking up in other ways. Transaction totals processed by layer-2 scaling networks like Arbitrum, Base, and Optimism have seldom been higher than they are right now. L2Beat, an Ethereum scaling network analytics platform, shows tht they collectively reached 92 transactions per second as of yesterday—which is 6.8 times more than what's being transacted on Ethereum mainnet.\n\nAnd all that activity has brought the total value of assets locked on layer-2s to an all-time high of nearly $27 billion, according to L2Beat.\n\nEdited by Andrew Hayward\n\nAD\n\nAD"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNZDlvMVh4dVVzeHNPVVQ5Q0ZYVkdWeFg5am96TW5RUHl0bnBJOS1oVWhJcUV0N292eUh1bER5WVY5X2dIZ2dONGVmQmJ2OVAxaVl0ZnR5LThQelRjQmlwQmVJZUhDa2ZSV3h4M3ZuU0dkUjBMM204b3pqbEdxZ0dWVi0zbUczNHdKX3p6NTRBVThJR09jS25oN0tUbWRxQWUySHZKLW9mc3PSAa4BQVVfeXFMTmV0QktsczhrckxCSmU4WmJiaWhEOThwSTVpUG5uR1pGdGJ2Vk15TUxrcGF1dzdwSFhSbG92OWlZcHQwTE9FaFNJaGJWNFRXZk5Ndno4WXJmTkpIdTJVcXd6QW9tLTFTbnotQU9UV053a3FibUJvX2dib0Z0NEtYSExEY3RqVTc1RTNPNlRySU5VVWxLM2R0S1VwMzNtR1hySnZzcV9YMGZVSUNkR2Nn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Ether Could Be the Next 'Institutional Darling,' Bernstein Says - CoinDesk",
        "content": "A number of traditional finance firms are vying for an ether ETF in the U.S., which is boosting the token's medium-term outlook. Franklin Templeton, Blackrock (BRK) and Fidelity, all of which had bitcoin ETFs approved by the Securities and Exchange Commission, are among firms that have submitted applications for an ether ETF."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNdUZHWWx0M2dXNlpQLVdpUTgwcHhwbm5mU2JnUUVTN0xRcTVwS1ZmZFdHRlhzME9oSlJCQ0F6aWR2eWh2ZXNzWDc5X01oSkwwZnFCcWdRNDFVdTRsNzNoX0pkX0Q5RzBabEZod1pIc0dKSGM4RWY0YWZZOGxKcnZwaGtzbXZVOEl6VGhUTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Targets $3,500 in the Week Ahead - crypto.news",
        "content": "Ethereum price crossed the $2,900 milestone on Feb. 19, but rising volume of trading activity across the ETH spot markets could propel it even further.\n\nWith investors placing bullish bets ahead of Bitcoin ETFs trading hours, is Ethereum price set for the much-anticipated bounce toward $3,500?\n\nEthereum trading volume crosses $25 billion milestone\n\nEthereum price made another giant stride on Feb. 19 as it crossed the $2,900 territory to bring its gains for February 2024 to the 30% mark. Record-breaking inflows from Bitcoin ETFs and institutional entities in recent weeks has been a major driver behind the market rally.\n\nETH witnessed an unusual spurt in the trading activity in UTC morning hours on Feb. 19, likely due to strategic investors looking to place bullish bets ahead of the resumption of Bitcoin ETF trading sessions in the US.\n\nSantiment’s daily trading volume tracks the nominal value of confirmed transactions involving a particular cryptocurrency within a 24 hour period.\n\nThe chart below illustrates an initial drop-off in ETH trading at the close of Bitcoin ETF trading on Friday Feb. 16. But since then, it has been on a remarkable rise.\n\nAt the time of writing around 10:30 hrs GMT on Feb. 19, ETH trading volume has surged to $26.7 billion, the highest since Jan. 11.\n\nEthereum (ETH) Trading Volume vs. Price | Source: Santiment\n\nTypically, rising trading volume is bullish for a number of reasons. Firstly, it signals strong investor interest in the underlying cryptocurrency. But more importantly, heightened market liquidity allows investors to execute trades at favorable prices without scuttling the upward price momentum\n\nBitcoin ETFs acquired over 17,000 BTC in the last trading week between Feb. 12 and Feb. 16. If they continue on the same trajectory, the trading volume on Ethereum and other mega-cap altcoins could rise even further, during the previous week.\n\nInvestors shifted ETH worth $220M into long-term savings in 3 days\n\nThe flow of Ethereum on exchanges since the close of trading on Feb. 16 is another critical metric pointing towards investors’ conviction of another bullish week ahead.\n\nCryptoQuant’s Exchange Reserves metric tracks the total number of coins deposited in exchange-hosted wallets and recognized trading platforms. This serves as a proxy for measuring investors’ tendency to sell in the short-term.\n\nAs depicted in the chart below, investors held opening balances of 14,060,510 ETH as of Feb. 16.\n\nBut interestingly, investors shipped over 80,222 ETH coins into long-term storage and staking contracts in the last 3 days, leaving only 13,980,288 ETH in their trading wallets at press time on Feb. 19.\n\nEthereum (ETH) Exchange Reserves vs. Price | Source: CryptoQuant\n\nA decline in exchange reserves often impacts asset price positively, as it effectively leads to a temporary cut in market supply. Unsurprisingly, a closer look at the chart shows how ETH price has been on an uptrend since the exchange reserves began to drop rapidly in November 2023.\n\nValued at the 5-day Simple Moving Average price of $2,730, investors have shifted approximately $220 million worth of ETH into long-term storage.\n\nReducing the market supply, by such a large margin could further accelerate the rally if the market momentum remains bullish in the week ahead.\n\nForecast: can Ethereum price reach $3,500?\n\nBased on the trading volume and exchange reserves trends analyzed above, there’s an overwhelming bullish sentiment among investors that ETH price could make another leg-up toward $3,500 in the week ahead.\n\nHowever, ETH currently faces a looming sell-wall at the $3,000 psychological resistance.\n\nIntoTheBlock’s global in/out of the money data shows that 4.5 million addresses received 1.7 million ETH inflows at the average price of $3,049. Considering they had been holding at a loss for nearly 3-years a number of them could look to take some profits.\n\nBut if the bull can scale this resistance zone, a breakout toward $3,500 could be on the cards.\n\nEthereum (ETH) Price Forecast, | Source: IntoTheBlock\n\nOn the downside, the bears could regain a foothold in the market if they can force a reversal below $2,000. However, as seen above, the 4 million addresses acquired 3.3 million ETH at a minimum price of $2,640.\n\nTo avoid dipping into losses, those investors could make frantic purchases to cover their positions, and possibly, trigger an instant ETH price rebound."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQNzJjeXMtS0lxODhTS3JRRW5namlxOFlTS3U4dTBQMEhCV1B4ZnhGU2k2b194UFhRX1prRjRhZUkwRDlLbjdLbktmb1ZUOXo2eWhtdUtVMWNBSVNXLS1oeFRHMHVLVWJoVXJfOFhudlMzVzdBYUNxUnQxanBFa3lpdDZNSGtNR3dSQU1hQ1hzb0pEcVNHMVVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Surges Over 16% as Fundamentals Strengthen - Crypto Times",
        "content": "Ethereum (ETH) has surged over 16% in the last week to trade back above $2,900 levels—its highest since March 2021—as fundamental indicators point to the second-largest crypto likely sustaining its outperformance versus market leader Bitcoin.\n\nETH, 24Hrs Price Chart, Source: CoinMarketCap\n\nIn contrast to Ethereum’s double-digit jump, bitcoin (BTC) has risen a more moderate 8.5% over the same period, stalling around $52,000 below current record highs. This broad-based ETH rally reflects strengthening long-term trends, suggesting the flagship cryptocurrency’s supply outlook is more constructive than Bitcoin in the future.\n\nWith the Merge upgrade implementation on a date by Ethereum on September 15, 2022, now being a successful proof-of-stake blockchain, the circulating supply of ether has stopped growing significantly. Therefore, Bitcoin is fixed money, unchanged in quantity, and we will endeavor to do that because it is a halving process.\n\nSpecifically, on the net, Ethereum’s supply has fallen 0.209% year-over-year as 1.05 million ETH has been issued while 1.41 million has been burned or removed from circulation. Meanwhile, according to crypto data service Ultrasound figures, bitcoin’s supply increased by 1.71% over the same period.\n\nThe forthcoming iteration of Ethereum’s Dencun in March intends to enhance the platform’s scalability and capacity to support complex and more sophisticated applications. Moreover, the market anticipates SEC-positive decisions, which will launch the first U.S. spot ETFs tracking ether’s price by the end of this year.\n\nWith more fundamentals becoming Ethereum-centric, traders view limitless possibilities for either to thrive at the expense of Bitcoin, even after mass adoption."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOQzhuTFFrNkdiTFBhWDNLczJIdk8wRzRMYVVOcVpTcGFabmJZYmUzal9CX0R5Y0k2X01ucjF5alNpMnlEQ3F5aldscHVQR01CVmVMN1QxcDlPOHozd1pMRFc1bkJ5Q1Q4WGE4a3l5RW1YaTFfNnZSOFM3a3NjeXhxSklhX2pCMmlxazczbGVJeGxRcEZic09kZ1FuM29CRmczX25N0gGoAUFVX3lxTE1SQVlGdzFlOUVoXzJ2MTZsdVdPb3h5Y2t1VFRMTzBzYUZMdWhKTHNJbEZPbkJkOUMySnJOX1lUcFp3Slk5dmhORGpGMmotTnZDTXl2Q3IxS25uM0I3ZXFfRlN3RkpKQlBwRUhpcnJlODRFSU4teGVpRHhHa0hrNEZxWmV6cDk1R2FGbnVzZE5jZURZaDNrdUdRVzUzcGNWTzdyVkdabFUxLQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Just-In: Ethereum (ETH) Gains Momentum After This Vitalik Buterin’s AI Comment - CoinGape",
        "content": "Ethereum (ETH) price briefly surges over $2,900 on Monday, sparking renewed interest in the community ahead of the upcoming Dencun upgrade. ETH price upswing comes after Ethereum co-founder Vitalik Buterin’s latest post regarding artificial intelligence (AI) and its use cases in crypto.\n\nVitalik Buterin Hints At AI Integration in Ethereum?\n\nEthereum creator Vitalik Buterin has been actively looking at artificial intelligence (AI) recently, talking about its pros and cons. He recently talked about how crypto and AI overlap, pointing out potential use cases and risks.\n\nadvertisement\n\nVitalik Buterin expressed his excitement about artificial intelligence in a blog post on February 19. The use of AI in formal code verification and bug detection is one application about which he is quite enthusiastic. According to him, code problems represent “Ethereum’s biggest technical risk pro” at the moment, and AI will revolutionize bug remediation.\n\n“One application of AI that I am excited about is AI-assisted formal verification of code and bug finding. Right now Ethereum’s biggest technical risk probably is bugs in code, and anything that could significantly change the game on that would be amazing,” said Buterin.\n\nAptos Labs’ Wolfgang Grieskamp commented that the design of the EVM, unfortunately, makes verification very hard, with difficulty in discovering simple control flow because of indirect branching. “Not sure whether AI will help here. Formal verification of Move is easier and works today, AI can further boost it.”\n\nAlso Read: Spot Bitcoin ETF is “a Giant Mistake” – Market Expert Jim Bianco Says\n\nEthereum Verkle Trees\n\nAs Ethereum goes for the Dencun (Deneb and Cancun) upgrade is scheduled to go live on March 13, Vitalik Buterin really looking to Verkle trees. Citing a website maintained by Ethereum Foundation developers, Buterin said it will enable stateless validator clients, allowing staking nodes to run with near-zero hard disk space and sync almost instantly. This will offer a better solo staking user experience.\n\nETH price hit $2,904.71, up 3% in the past 24 hours. The 24-hour low and high are $2,780 and $2,902, respectively. Furthermore, the trading volume has increased by over 30% in the last 24 hours, indicating a rise in interest among traders. Analysts predict Ethereum will easily rally above $3,000.\n\nAlso Read: Goldman Sachs Raises S&P 500 Target to 5,200, Will Bitcoin (BTC) Follow?\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQY01kMEswUXItR2VwTTR4Q2I1TG1DY2lBbF9NNmZ4VmtjLTVnU0tOMllyWERnM2RaOEN4UVZSODE3aGg2b1JSX3dyUFBPbU9ES29HQ25JdmlzYmJNc3hiZm9zRjE2aElhR01sbGxKUjNTX0tTNjVjNEhqTF9VQXlLTkIxemhWcFMwZEtJcUlGSldwaVVnRERtTF9qRmpXbW9tTjJQS9IBqgFBVV95cUxNRXBCX0h4MXBGeDRTM19PdFJqbkNrbU0wY3NIRnpYVlVJbXo1WjItRndSMDg3VERRNXowdF9zLUNKWVExVFRUXzd4NkxROGEyNC16aGd2cEYtbWpMdG5JUWNmVUQwaFFDYWhVdGdSa1pBMUtZNkNoSUdfVnE1YXp0Qk9jdHcyRG1rS2V3dU41MFRKNUQ2a2dBQnBoYUNkdHVvOWdDeFdaYVhiZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Explodes Toward $3K: Two Things to Watch This Week (ETH Price Analysis) - CryptoPotato",
        "content": "Ethereum has recently surged with notable momentum, signaling a bullish uptrend.\n\nThis increase has seen the price reclaim a critical resistance level, reflecting strong buyer confidence and market participant optimism.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA thorough analysis of Ethereum’s daily chart reveals a significant shift in market sentiment, characterized by an impulsive uptrend and heightened bullish momentum.\n\nAccordingly, the price has approached a crucial multi-year resistance zone – the psychological barrier at $2.9K and successfully surpassed it.\n\nThis indicates a prevailing bullish sentiment among market participants, with buyers dominating the market. The trend appears sustainable, with eyes set on surpassing the major yearly swing high at $3.6K. However, it’s worth noting that the only concern is the emergence of an expanded bearish divergence between the price and the RSI indicator, signaling a possible short to mid-term correction or consolidation phase before the next surge.\n\nThe 4-Hour Chart\n\nAnalyzing the 4-hour chart, a significant price reversal can be observed near the multi-month ascending trendline, supported by substantial buying pressure. This upward momentum led to a breakthrough above a crucial prior major swing high, establishing a new higher high. The above underscores the presence of active buyers targeting higher resistance levels.\n\nWith the price reclaiming a significant resistance zone and completing a pullback to the broken level, the trajectory is expected to remain bullish with intermittent downward corrections. However, given prevailing market conditions, periods of heightened volatility may lead to notable price fluctuations.\n\nIn summary, Ethereum’s recent price surge and reclaiming of crucial resistance levels signify strong buyer confidence and a sustainable bullish trend. While short to mid-term corrections are possible, the overall outlook remains positive, with buyers likely to continue driving the market toward higher price targets.\n\nOn-chain Analysis\n\nBy Shayan\n\nAs Ethereum’s price has steadily climbed from the significant support level of $1.5K to surpass $2.8K in recent months, investors are keen to gain insights from futures market sentiment analysis.\n\nThe chart illustrates the open interest metric across all exchanges, representing the total number of open futures contracts, regardless of the trade direction. Higher values signify increased confidence among futures traders in the prevailing trend, while lower values indicate uncertainty. Moreover, heightened open interest often correlates with heightened price volatility, as it amplifies the probability of cascading liquidations.\n\nNotably, the chart reveals a significant surge in open interest, coinciding with Ethereum’s upward price trend, reaching its peak levels since July 2022. This surge indicates sustained confidence among futures traders in Ethereum’s current uptrend.\n\nHowever, given the impulsive nature of the recent ascent, traders should exercise caution and consider the potential for sudden liquidation events, which could trigger notable short to mid-term price declines."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNaEhyOWlDYUs4ODlybzNLMW85bm92RUkyc19COU4ydzJHMklxRGNkNUdhaGZROFNBeVNQOHlYUEV4N2RsX2F4bnZMeUJSbUs2NHROSklhSzhUd3l2cy1KdWFKUWpaemwxWXNfMFRJcFJHcFhUM3dBdlBRZUE4bW1Vc0FHeXhDWktFNUYxaVViandhWWplaW04Tld5QWNsSkZuWVpRUDd4b1hhVkw2WWR1WmRodGdncS1ZeU5xMEdneWdqREE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "AI tokens jump 10% as Vitalik Buterin explains how AI can enhance security and efficiency on Ethereum - CryptoSlate",
        "content": "Digital assets in the artificial intelligence sector continued their recent surge, increasing by 10%, as Ethereum co-founder Vitalik Buterin stated that the technology could help the blockchain network mitigate its “biggest technical risk.”\n\nCryptoSlate’s data show that several tokens in the sector, including SingularityNET’s AGIX, 0x0.ai, Ocean Protocol’s OCEAN, The Graph’s GRT, Fetch.AI’s FET, and others, rose more than 10%, respectively, during the past day, pushing the sector’s market capitalization to $18.06 billion and its trading volume to approximately $2.5 billion.\n\nHow AI can aid Ethereum\n\nAccording to Buterin, AI technology could help blockchain network developers identify bugs and assist with the verification of codes.\n\n“Right now ethereum’s biggest technical risk probably is bugs in code, and anything that could significantly change the game on that would be amazing,” he added.\n\nHis remarks come in the wake of his recent exploration of the synergy between AI and crypto, detailed in a blog post on Jan. 30. Buterin outlined various potential applications of AI within the crypto sphere.\n\nHe pointed out that integrating AI could revolutionize crypto-systems, particularly in scenarios where individual participants are replaced by AI entities, enabling more efficient operation on a micro-scale.\n\nWhile recognizing AI integration’s functionality and safety enhancements, Buterin also urged caution, especially in high-value and high-risk settings.\n\nBeyond Ethereum, other protocols and exchanges like Solana, Polkadot, Binance, and stake.link also explore AI-driven solutions.\n\nHowever, despite the enthusiasm for AI, concerns linger regarding its efficacy in bug detection. Daniel “Haxx” Stenberg of cURL highlighted potential challenges, including the risk of AI-generated false positives complicating bug identification efforts.\n\n“An (AI-generated) security report can take away a developer from fixing a really annoying bug. because a security issue is always more important than other bugs. If the report turned out to be crap, we did not improve security and we missed out time on fixing bugs or developing a new feature,” Stenberg argued.\n\nMentioned in this article"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5GcXBTOGlYd2FNZTRrbW1vTHV2TFZ2ZnRuWDBJaDBac210cUZON0JWQ00yOVhrV0VxdWRDVHVOaHdKeDEtRDBzZS1rM0tQMTJOVHZoSHFzWVFUU1AyekVWdjg5dE15ZE5PVVN3V2t0YVhlRHJkdm9qdGVDeTJjNGvSAYcBQVVfeXFMUEhDTkE4WnB6Rkg1V2dleXh3eUJReXREaHpZQmpMb0Q0T2ppUzlMX0dfLVBVUC1uRFhWMV9fWXdOb1BjU2ZzMUlWWE41dDl3ckd3dm93NjM0bGtVX0V0X2JleEdMSlBtcDBjQjhxS2REbnBTLUF4YUZSdlRqN2FLTzFHN0lPbjlV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Vitalik Buterin: Ethereum Could Benefit From Using AI to Find Bugs in Code - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum co-founder Vitalik Buterin mused that one application of artificial intelligence that he'd like to see is AI-assisted formal verification of code and bug finding.\n\n\"Right now Ethereum's biggest technical risk probably is bugs in code,\" he said on Twitter. \"And anything that could significantly change the game on that would be amazing,\"\n\nUnsurprisingly, the replies to the tweet were full of startups claiming to have built the game-changing tech that Buterin is so excited about.\n\nOne application of AI that I am excited about is AI-assisted formal verification of code and bug finding. Right now ethereum's biggest technical risk probably is bugs in code, and anything that could significantly change the game on that would be amazing. — vitalik.eth (@VitalikButerin) February 19, 2024\n\nAD\n\nAD\n\nThe Ethereum co-founder hasn't always seemed optimistic about the impact AI could have on tech or humanity as a whole. In a November blog post, \"My techno-optimism,\" the Ethereum co-founder laid out his prediction that AI could develop its own \"mind,\" work against humans and become the new apex species.\n\n“This is an extreme claim: as much harm as the worst-case scenario of climate change, or an artificial pandemic or a nuclear war, might cause, there are many islands of civilization that would remain intact to pick up the pieces,” he wrote at the time. “But a superintelligent AI, if it decides to turn against us, may well leave no survivors and end humanity for good. Even Mars may not be safe.”\n\nThere were no AI doomsday predictions in the thoughts he shared Monday morning on Twitter. The shift from doom and gloom to optimism has been ongoing for Buterin.\n\nIn a January blog post, Buterin said AI could become a \"player in the game\" in cryptocurrency markets. It's not at all unprecedented. He pointed out that trading bots have been better than humans at arbitrage—or taking advantage of price discrepancies in the market—for years.\n\nAD\n\nAD\n\n\"But AI arbitrage bots are only the first example of a much bigger category, which I expect will soon start to include many other applications,\" he wrote, before talking about AI-driven prediction markets.\n\nIf Ethereum developers start using AI for code verification and bug detection, they'll be joining a growing segment of the tech industry.\n\nEarlier this month, Microsoft reported colossal revenue in its Q4 2023 revenue—thanks in large part to its multi-year partnership with OpenAI. The company said during its earnings report that AI has been the main driver of its success, whether it's been generative AI models, code analysis, image generation or visual recognition.\n\nQuick note: Microsoft uses a fiscal year—not calendar year—for its earnings. So its 2024 Q2 ended on December 31, 2023.\n\n\"It was a record quarter, driven by the continued strength of the Microsoft Cloud, which surpassed $33 billion in revenue, up 24%,\" said CEO Satya Nadella in Microsoft’s second-quarter earnings conference call. “We’ve moved from talking about AI to applying AI at scale.”"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE43WTI4U25wNm5GS0ZxemE0QXpIOFJIRjBKYk1VMHZLRGN6Vm9kbHdZZWVRTDZwS2pmUmxJQUU4czJ0QlNKS3VIVlpYbHQ3U21JUkJzMk5yU3VZbUpEZ2ZOdTJKUFp5ejg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum lead crypto in $145m liquidation day - crypto.news",
        "content": "Bitcoin and Ethereum led cryptocurrencies in liquidations as over 54,000 traders saw leveraged positions wiped out, and the total market cap neared $2.1 trillion.\n\nCoinGlass reported that over $145 million was liquidated from the crypto market in 24 hours across exchanges. As most traders anticipated lower prices, $91 million of these trades were registered as short positions.\n\nHowever, the total cryptocurrency market cap rose 1.2% per CoinGecko and liquidated the downside bets. A $4 million Bitcoin (BTC) position in a USDT pairing made the single largest liquidation order. The trade was on Binance, crypto’s biggest exchange.\n\nTraders also lost at least $70 million combined between BTC and Ethereum (ETH) across long and short punts.\n\nTop 10 liquidated cryptocurrencies on Feb. 19 | Source: CoinGlass\n\nYou might also like: Bitcoin drives record $2.4b weekly digital asset investment inflows\n\nBitcoin, Ethereum move up\n\nBTC and ETH, the top cryptocurrencies by market cap, have seen price uptrends in the past week. The tokens have gained 3% and 11% in the last seven days amid bullish market sentiment.\n\nBitcoin ETF approvals by the U.S. SEC on Jan. 10 seem to be a main driving force in Bitcoin’s rally as it prices in at $51,800 and holds a market cap of over $1 trillion, making BTC the 10th largest asset in the world. There is also anticipation surrounding the Bitcoin halving, which is expected in April.\n\nSome believe the halving, which slashes new block rewards in half, and BTC acquisitions for spot Bitcoin ETFs will trigger a supply crunch while demand increases. The leading hypothesis suggests this will cause a parabolic run for crypto’s largest asset.\n\nThe Bitcoin halving is set to happen in April 2024. Here's what to expect👇\n\nFirst, let's reflect on the Previous Halving:\n\n➖ In 2020, after the last halving, the block reward dropped to 6.25 BTC\n\n➖ Bitcoin's hash rate dropped by 30% within two weeks.\n\n➖ Bitcoin's miner difficulty… pic.twitter.com/6hIsjAVPKK — IntoTheBlock (@intotheblock) February 16, 2024\n\nEthereum’s current momentum revolves around a technological upgrade dubbed Dencun. Developers have said the modifications will introduce expanded data availability for layer-2 rollups through a blob feature. This will allow L2s to add more data to each block, thus reducing transaction costs and bolstering scalability.\n\nDencun is slated to ship to Ethereum’s mainnet around mid-March following successful testing on three testnets: Goerli, Sepolia, and Holesky."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPck1zVWl3Vk9XQ0J3NVBlTEE0TkptNXJ0OXZyNURGSGp0RkZXYWNWakdQcmVPWjBmdkRRX0kweXVvRjNrclFla3VMOF9yRHR4bjNRcFZ4ZWlnU1E2UGlnWmttNEdIQ05QTHd4MldLZGVZaHhUbC1HSmx6Y0JQZjRvRdIBhgFBVV95cUxNWlZXTW5JQmpLR2xwNVpZdE5WME95X1RHWF9JQ1pFYVFyMVBRN195QzZOTl9UYjg1bFVQWW0tUWRuNFM1MFRUTno3QzRoV29OcUV0RVQ3aTNKSGd0a2g1NFc4bWlWUFAxLWdMUHM3c1ZZODRYcVVRWEdXNUU1cnlrQUlWVjlpdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Whale Buys $155.7 Million in ETH as Price Nears $3,000 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn an unprecedented move, an Ethereum (ETH) whale has made a colossal acquisition of ETH, totaling approximately $155.7 million. This significant activity comes as the price of Ethereum nears the $3,000 mark, a bullish signal for investors and enthusiasts alike. According to a recent tweet by Spot On Chain, a notable cryptocurrency analysis firm, the anonymous whale has executed a series of strategic purchases within the last 24 hours.\n\nAdvertisement\n\nAcquiring a staggering 54,721 ETH, these transactions were meticulously carried out through a combination of withdrawals from Binance, one of the world's leading cryptocurrency exchanges, and swaps on 1inch, a renowned decentralized exchange aggregator. The detailed breakdown of the transactions reveals that the whale withdrew 19,226 ETH, valued at approximately $55.6 million, from Binance.\n\nAdditionally, the investor swapped 10.1 million USDT (Tether) for 3,493 ETH, equivalent to about $65.7 million, through 1inch, at an average price of roughly $2,893 per ETH in the past few hours. This flurry of activity underscores the Ethereum whale's aggressive investment strategy and belief in Ethereum's long-term value.\n\nEthereum approaches $3,000\n\nThis massive accumulation of ETH by the whale has occurred amid a significant uptick in Ethereum's market price and trading volume. The current price of ETH stands at $2,906, marking a 3.69% increase in the last 24 hours and an impressive 16.51% surge in the past week. The 24-hour trading volume for Ethereum has also experienced a substantial boost, witnessing a 53.44% rise to reach $26.65 billion.\n\nThese metrics not only reflect the growing investor confidence in Ethereum but also highlight the cryptocurrency's resilience and potential for future growth. The Ethereum community and broader cryptocurrency market are abuzz with speculation regarding the implications of this whale's actions. Such substantial investments by high-net-worth individuals or entities often signal a bullish outlook on the asset's future price movement.\n\nAnalysts suggest that this could potentially lead to increased institutional interest in Ethereum, further propelling its price upward as it edges closer to the coveted $3,000 milestone. Overall, the market watches with bated breath, anticipating the next wave of developments in this ever-evolving space."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOUVA2YkY5dVp1akh0ZV9kOUUwRmFWa3YtWEdkZko4VnJQaHpiUWxiQ3BtVVBJME1OYzNUWkxXaEVsaWhMdk5JRnZ4clBTUV9TS2JsUGFac29kZmIyN2gzOEFSdWZBRU5SbzFEeEZrZEhBdTRieDRFd0p1RnBQZS1IdThDQdIBiwFBVV95cUxOX1NuNWJkT1NaNlNnRVBxbFVQYjB4d0ozejFBNS1yVnh6bnBNS1ZzT1E0OWpGdHFNRkdmNDNseXVwd2lEaXcxTUE1dS1pbE0zTF96akM4WGJtOV92SFh4bGMxVjhSaVJKR1lKYnhkLS1TSkh5STZYN3gxX1JTNDZWNVJFQ3NvRzJqTERz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Gaming Tokens Ride Bitcoin, Ethereum Boom to All-Time High Prices - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto tokens tied to prominent blockchain games—and the networks that support them—are broadly surging amid the Bitcoin and Ethereum boom, with a number of tokens launched within the last year rising to new all-time high prices over the past day.\n\nThe tokens tied to gaming networks Xai (XAI) and Beam (BEAM) are among those that reached new peak prices, according to data from CoinGecko, along with the tokens of crypto games Heroes of Mavia (MAVIA) and Parallel (PRIME).\n\nXAI, the token from the Arbitrum-based layer-3 gaming network of the same name, spiked to a new peak price of $1.39 overnight before settling slightly to $1.30 as of this writing. At the current price, XAI has a market cap of $359 million, and the token has jumped into the top 200 cryptocurrencies by market cap. It’s up 13% over the past 24 hours and 19% on the week.\n\nThe token just launched in January as Xai rolled out a sizable airdrop to operators of Sentry Nodes, which support the network, as well as owners of certain NFTs tied to the gaming network. The total value of that 125 million XAI airdrop now sits above $162 million.\n\nAD\n\nAD\n\nBEAM, the token of the Beam gaming network built on an Avalanche subnet, is up 10% today to a current price of just above $0.035. It’s down only slightly from an all-time high of nearly $0.036 on Monday morning.\n\nBeam is operated by Merit Circle, a gaming DAO (decentralized autonomous organization), and has also integrated with Immutable zkEVM, an Ethereum scaling network for games. With a market cap of nearly $1.8 billion, BEAM is the 53rd largest cryptocurrency overall by market cap and the second-largest gaming-centric token behind Immutable (IMX).\n\nPRIME, the token of crypto trading card game Parallel, also set an all-time high price of $14.84 late Sunday, though it has dipped nearly 7% since to a current price just above $13. Parallel, GG’s 2023 game of the year, recently launched a new season of in-game content and has been teasing an open beta launch in the near future. It’s currently in closed beta.\n\nAnd MAVIA, the newly launched token of mobile strategy game Heroes of Mavia, pumped Sunday to a new all-time high price of $10.59. It has marked a sharper decline since surging to that peak, however, now down about 14% on the day to about $8.50 as of this writing.\n\nAD\n\nAD\n\nMAVIA debuted less than two weeks ago and has spiked 370% since its initial launch. The Clash of Clans-style crypto game rolled out an extensive roadmap over the weekend, showing off plans for additional NFT staking rewards, an upcoming announcement of a layer-2 scaling network to power the game’s crypto elements, and other bonuses and features ahead.\n\nMavia's February Community Update: Tokenomics, Game Stats, Roadmap and more!https://t.co/6OipmDj4Ta — Heroes of Mavia (@MaviaGame) February 17, 2024\n\nHeroes of Mavia was released on iOS and Android in January and airdropped tokens to 100,000 players and NFT landholders. Developer Skrice Studios now says that it has logged over 2 million downloads for the game, with 278,000 daily active users.\n\nAll four of these tokens initially launched within the last year, including two of them so far in 2024. That’s an important detail as some of the other largest gaming-centric crypto tokens are longer-running coins that set much higher peaks during the bull market runs of 2021 and 2022.\n\nFor example, coins like IMX, The Sandbox (SAND), ApeCoin (APE), and Gala Games (GALA) remain well short of their all-time high prices—and all of those except Immutable are down more than 90% from such peaks. Immutable has risen 74% over the past 30 days, yet it is still down 65% from its all-time high price of $9.52 set in 2021.\n\nThe past day’s gaming token spikes came amid the launch of PIXEL, the long-awaited token of buzzy crypto farming game Pixels on the Ronin Network. PIXEL has pumped 24% since the Monday morning debut to a current price above $0.62, putting its market cap at $821 million.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxPeE1GODQyNmNOcGNuWDQ2bGtEaEpmWDAzSGFMSGtyVS1iX1VGWklISGdBcENEcUtUaDRGTzJpdzlLX3FyekVNS0ktT0tBTFJMYUtXdTBDQ0lfWWNZR3d6SFNpaTJKM05YNVlSME4zRmhXLWtjZjMwX3A4LW5rUjhSX2R0NFliRURlWUhzR0REOFNLV2dKbWkwRFhUX3BjbFc2bWxldVY4eUhGSUppT3hnRzMxVnBHMWlZNEtWOFcxTnNLNXJLOTNVdktTMi1aV2EyUUZhT3FNMXVwaWY0TW440gHkAUFVX3lxTE5LZ1JCVWFQVFYycDd1dlJSaDZ5OTQ3clR4dXpWUE5vNnVLSzROaFNsNEloRDR2X0FjOW1YRzZGay1wY1VuSGRQaDRJVzlRdS1RNjhGQjREVndaaUw1RWgwSEp5VzdVS3N0cEJBVVBOOERYaW95Vjk0YWotQTVFN2N4dEZQbDFUNUUtYnV1eXZ4RUIxa1ljY280aEZySVl1MnJYSjE3WW90MzRxQkVPTTQyU0dNeExEUU9FcGNxQkhZZ3ZWM3hKOUlDZFhYOGR1RDdZU0RRVk1Md1pvb2Jqb2JuSURhbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Ethereum outperforms Bitcoin with double-digit weekly gains and spike in Open Interest - FXStreet",
        "content": "Ethereum left Bitcoin to bite the dust, yielding 16% weekly gains while BTC offered 8% to holders.\n\nEthereum observed a 5% spike in Open Interest against Bitcoin’s 1%.\n\nETH price hit a 52-week high ahead of the Dencun upgrade scheduled for March 2024.\n\nEthereum outperformed the largest cryptocurrency by market capitalization and yielded 16% weekly gains for traders. ETH price hit a peak of $2,931 on Monday as the altcoin rallies towards its $3,000 target.\n\nAdditionally, the second largest cryptoasset by market capitalization has observed an increase in its Open Interest, at 5% on Monday.\n\nAlso read: XRP price steadies above $0.56 ahead of deadline in SEC v. Ripple lawsuit\n\nEthereum beats Bitcoin with massive gains for holders\n\nEthereum and Bitcoin yielded 16% and 8.30% weekly gains for holders. ETH outperformed Bitcoin with nearly twice the weekly gains. Data from Coinglass shows that $20.06 million in short positions were liquidated in the past day while $24.15 million in Bitcoin shorts were liquidated.\n\nEthereum price climbed to $2,931 on Monday, a 52-week high. The upcoming Dencun upgrade scheduled for March 2024 and the anticipation surrounding a Spot Ethereum ETF approval are among the main catalysts for ETH gains.\n\nEthereum price rally to $3,000 likely\n\nEthereum price is $2,908 on Monday. The altcoin is currently in an uptrend and close to its $3,000 target. Ethereum has support at $2,720 and the $2,500 level.\n\nThe green bars on the Awesome Oscillator (AO) and Moving Average Convergence/ Divergence (MACD) suggest that an uptrend is in place for Ethereum price.\n\nETH/USDT 1-day chart\n\nA daily candlestick close below the $2,720 level could invalidate the bullish thesis and result in a decline to support at the $2,500 level before Ethereum price makes a recovery. Experts have predicted a rally to $4,000 prior to the likely approval of Spot Ethereum ETF."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE8wMHo5X2s3WmNkUzNkMHVXTWNBM1ZsY2ZJTEQ1RW5sMXFJWDd5cGNtcUVvaTZMOEg2S0t2TlluTVJTRjFPNGxyYXNiZEhoWXQyRnlReTdNWnVXQk56QlVOeGtwcVY4ckpvVTJJSTdZQlExT1nSAXhBVV95cUxOU1J4RzhfeXNWMklPVU56WEluVUNFUFN1aUhiNnpINHBYOHI0aGdyZEwxNHhTREN5RFBnS2VDdjhBY3pmckZVakFxZGNxd21yTGtNelF1TnBFNzkyN3B2ZVVXeXlfUUl1VmVmazNzbzhSVktzcmM4aUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Feb 2024 08:00:00 GMT",
        "title": "Ethereum ETF in March? Bloomberg Expert Thinks Not - U.Today",
        "content": "Speculations are rife within the crypto community regarding the potential launch of an Ethereum ETF as early as March. Amid the buzz, James Seyffart, a renowned research analyst at Bloomberg Intelligence specializing in ETFs, has cast doubts on the feasibility of such a development.\n\nAdvertisement\n\nTaking to social media, Seyffart dismissed the rumors, asserting a firm stance that there is a negligible likelihood of an Ethereum ETF materializing in the speculated time frame.\n\nDespite the fervent speculation surrounding the matter, Seyffart confidently expressed skepticism, even placing a wager of 4 ETH against the purported likelihood of an imminent Ethereum ETF launch. His public dismissal comes as a response to the increasing traction of rumors within the crypto space, with numerous individuals bringing the speculation to his attention.\n\nAdvertisement\n\nNo — James Seyffart (@JSeyff) February 18, 2024\n\nInterestingly, while Seyffart remains doubtful about a March launch, he declined to extend his skepticism toward a potential Ethereum ETF by the end of 2024.\n\nIndustry push\n\nMeanwhile, recent developments indicate ongoing efforts by financial institutions to secure regulatory approval for Ethereum ETFs. VanEck and ARK/21Shares have submitted revised filings, signaling their persistence in navigating the regulatory hurdles.\n\nAdditionally, Standard Chartered and Franklin Templeton have also made strides in their respective applications for Ethereum ETFs, reflecting growing interest from traditional financial players in offering exposure to cryptocurrencies through regulated investment vehicles.\n\nWhile Seyffart's statement might dampen some spirits, the counterpoint lies in the continued industry push. Revised filings and new applications from established players paint a picture of sustained effort. This suggests that even if a March launch is unlikely, the underlying momentum for an Ethereum ETF remains strong, making its arrival in 2024 a real possibility."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5oWVlLREJWejRQbmFSOW53MWJBbWFPTUpxWnpTRjVKRkMxZUtSM2ZDN3o4SVdtbW9PV1lkMTZ5WlR4c2szd0pRN1FXZ0Y1VDcwbl9QMEcyRDlRX1huaVUxVkJXakxfZFIzR0NmNkhKRXF3dWF2c2lhZ9IBgAFBVV95cUxPQk56YWJ3ZDBlYWlYMG56VVh1Q3JHZUQwTldicV9Dd2d3X2JHTml4YlIxeF8wSlNPWW9iZXVuVExyY011NGdFRjZCNUdHcTFQcXBmcDR4YWJDTWRSQVBQbHZzUHkwQTg2ZXJ2MWF4SFFtN2NtODBwTzhVVE5kNzhEbQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Non-KYC Crypto Exchange FixedFloat Hacked for $26M in Bitcoin, Ethereum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFixedFloat—a cryptocurrency exchange that operates without “know your customer” (KYC) anti-money laundering (AML) measures—was hacked earlier this month, resulting in the loss of more than 400 Bitcoin and over 1,700 Ethereum, worth about $26 million.\n\nBlockchain security firm BlockFence identified the Bitcoin address used in the theft, and on-chain data from a linked Ethereum address revealed multiple high-value transactions to various addresses.\n\nAccording to fellow blockchain analytics firm PeckShield, the stolen funds were moved through the Ethereum mixer eXch shortly after the hack, complicating the traceability of the stolen assets. A small part of the funds were moved to HitBTC and CoinSpot, PeckShield said, labeling the wallet address “FixedFloat drainer.”\n\nAD\n\nAD\n\nFixedFloat told Decrypt that the hack was not carried out by one of its employees and that “it was an external attack caused by vulnerabilities in our security structure.”\n\n“The problem was in our infrastructure, which was compromised due to flaws and insufficient protection,” the company said. “This allowed the attackers to gain access to some of the functions of our service.”\n\nFollowing the hack, FixedFloat initially cited \"minor technical problems\" and moved its systems into “maintenance mode.” This was before the full extent of the hack was disclosed, which led to confusion and concern among users.\n\n“We did not immediately report the hack, as we were already aware of the incident and immediately began putting our service into maintenance mode to ensure security and minimize losses,” the exchange told Decrypt. “At that time, our main focus was on quickly eliminating weaknesses and strengthening overall security, which prevented us from making public statements about what happened.”\n\nAD\n\nAD\n\nIn a subsequent statement, FixedFloat assured customers their funds were safe, clarifying that the financial losses impacted only the service itself and not user-held assets. \"FixedFloat does not perform the functions of a custodial service—that is, it does not store user funds. We will provide more information later,\" the platform tweeted.\n\nHowever, once reports of the hack started to spread through social media, the platform confirmed the incident and opened up about the attack.\n\n\"We confirm that there was indeed a hack and theft of funds,” the official FixedFloat Twitter account wrote in a reply to a tweet. ”We are not ready to make public comments about this matter as we are working to eliminate all possible vulnerabilities, improve security, and investigate.\n\n“Our service will be available again soon,\" it continued.\n\nHello, We confirm that there was indeed a hack and theft of funds. We are not yet ready to make public comments on this matter, as we are working to eliminate all possible vulnerabilities, improve security, and investigate. Our service will be available again soon. We will… — FixedFloat⚡️ (@FixedFloat) February 18, 2024\n\nThe exchange later assured that users’ funds remained safe and the funds stolen affected only the company’s internal operations. If so, it’s likely that the hack was from one of the exchange’s hot wallets.\n\nThe official FixedFloat site remains inoperative at time of writing.\n\nImage: FixedFloat\n\nFixedFloat, which advertises itself as an \"instant, fully automatic cryptocurrency exchange with Lightning Network,\" prioritizes privacy over safety, operating without requiring account registration or identity verification. This lack of KYC measures is appealing to privacy-conscious users, but it poses significant risks for both the platform and its users in the event of a hack, as investigators have limited information to work with.\n\nAD\n\nAD\n\nIncidents like this are less common than they were. A recent report from blockchain forensics firm Chainalysis highlighted a significant decrease in funds stolen from cryptocurrency platforms in 2023. Despite a slight increase in individual hacking incidents, the total value of stolen funds dropped by approximately 54.3% to $1.7 billion, attributed largely to a sharp decline in DeFi hacks.\n\nFixedFloat reported that they are working with law enforcement agencies, blockchain forensics firms, and cryptocurrency exchanges to track down the hackers, who have not yet contacted the exchange. The company said it will honor all its payment obligations as soon as it resumes operations and can be certain that the exchange is once again safe to use.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxQSmJHR2JiTlJnNnpFTDNIaGF2alhsTVdOUnpWZEVmVUhjRG80WU9qeXhadlZFeDF1UC1DWVF3RTVtQ2l5OEZGLUFuS0ZfVjljWWwxLWw0SDNKUklqMGkwVE1wcFozVDB6VHVTeU1sNHFxdWE5VnZqNXgxSTFkcmtFZDViOTRwSFE1TmNiQXlyY1dTeVZSMVFISTVpUUJTanBBc2pEMUdfaWp6eENxQ0VMbkM4clhsWUg0Z3FqTjU4RXhkdzI2M2xEU012UzBxZ0gwc0JIWDRQWG5BelhLaGZYN3RGbzFJblFmNURkTEw2dU8xVWRo0gH6AUFVX3lxTFBJcWRjaWg0aFVYY2ZlX0w5LW5XSVY2WXRYUDJwUDVObkJjUE5Id3p6SnFyV2dMOGxibGdTRTkwOGZ5cnR0ZF9vaE9ZODhwbkhRNGNpeTdnbzJLRWp4ekdwU21fVC0xb3J1U3FOcTkxekMxZWNJZ0UtU0l5YWRZaXUtaXBpRTdFZGVIeHdqbS1abzBzUlBZS0NiSGhVWVBtRll4RGp1cFdEY1pXaXVQWnh3VHFNemNWNGpQMlJPczBYalJjc1RGSHRvdTNPMV9zX2JDMENabkxqSnFjSC1MUmg1Xy1OUDJoeURmUlE0dGdOMzR3UUZDMllkRFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC shows weakness, likely to provoke a cascade of chops - FXStreet",
        "content": "Bitcoin price could drop 10% after a weeklong consolidation with BTC bulls showing exhaustion.\n\nEthereum price is likely to revisit $2,800, a 5% fall that could trigger a cascade of losses.\n\nRipple price eyes $0.6000 as XRP bulls show strength on the heels of SEC lawsuit conclusion.\n\nBitcoin (BTC) price’s bullish breakout appears to be losing steam, with the sentiment spreading across the market and leaving Ethereum (ETH) and altcoins in general susceptible to a crash. Meanwhile, Ripple (XRP) price is an outlier, pushing north on the heels of developments in the legal front.\n\nAlso Read: Bitcoin price likely to drop 10% as US markets commemorate Presidents’ Day\n\nBitcoin likely to correct before next leg up\n\nBitcoin (BTC) price is confronting resistance at $52,768 blockade, a roadblock that has stood for the past week. With the Relative Strength Index (RSI) dejected and moving horizontally, coupled with its position at 79, BTC is overbought, a status that often precipitates a correction.\n\nLikely targets in a southbound directional bias would be the 78.6% and 61.8% Fibonacci levels, at $49,786 and $47,445, respectively. In a dire case, Bitcoin price could roll over to the 50% Fibonacci level at $45,801, 12% below current levels.\n\nThe Spent Output Profit Ratio (SOPR) indicator also suggests a possible correction, having increased above 1 as a 30-day Simple Moving Average (SMA). This is bolstered by fading histogram bars on the Moving Average Convergence Divergence (MACD) indicator.\n\nBTC/USDT 1-day chart\n\nNotably, however, the bulls still have a presence in the BTC market, seen with the status of the MACD in positive territory. If these traders act, Bitcoin price could push north, clearing the $52,768 blockade and potentially record a new range high.\n\nAlso Read: Bitcoin price bullish outlook inspires IntoTheBlock’s 85% forecast of BTC at a new ATH by August\n\nEthereum price likely to revisit $2,800\n\nEthereum (ETH) price has outperformed BTC. However, it appears to be delaying the inevitable as altcoins await the Bitcoin cue. The RSI shows ETH is already overbought, worsened by the SOPR above 1, hinting at possible correction.\n\nA move south could see Ethereum price lose the immediate support at $2,874, potentially extending the fall to the $2,800 base, 5% below current levels. In a dire case, ETH could roll over to the confluence between the midline of the channel and the horizontal line at $2,689. A break and close below this level would invalidate the bullish thesis.\n\nETH/USDT 1-day chart\n\nOn the other hand, a reentry by the bulls could send Ethereum price further north, clearing the $2,944 range high and potentially extend the gains to the $3,000 psychological target, almost 3% above current levels.\n\nAlso Read: Ethereum outperforms Bitcoin with double-digit weekly gains and spike in Open Interest\n\nRipple price eyes $0.6000\n\nRipple (XRP) price remains bullish despite the broader market showing weakness, an optimism inspired by hopes of a conclusion in the legal saga against the US Securities & Exchange Commission (SEC).\n\nWith RSI at 58 and leaning north, Ripple price could increase amid rising momentum and the fact that there is still more room north before ETH is overbought.\n\nEnhanced activity among the bulls could see XRP price shatter the resistance due to the upper boundary of the descending parallel channel bringing the $0.6000 psychological level into focus. A tag of this milestone would constitute a 7% climb above current levels.\n\nXRP/USDT 1-day chart\n\nOn the other hand, a rejection from the channel’s upper boundary could send Ripple price south, first losing support due to the $0.5368 buyer congestion level. An extended fall could see Ripple price test the midline of the channel at $0.5145, or in a dire case, slip to the support floor at $0.4734, 15% below current levels.\n\nAlso Read: XRP price steadies above $0.56 ahead of deadline in SEC v. Ripple lawsuit"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNYmliR2Noa1piVmtoWWwtVmFMbHBaTDBiNkk1UGRoQTcweThXRW9YNWFPOEdmVDZhUnBQWWg4b0VXNmlYclNTaDhYSDZhRl9OQng4cW5OUzRPUDItWG9vSzNLdVh0WWd0WlZXNlNMVWVsQTBPLTkzU0V3MElHUFNWd21hdWF0bTBDS0ZsM05LUzA0NUd5RXgyRnF0dEVicFNxWnVHRm5zTS1OWjhfNmZjSm9ocUZaRjNCZ0JNOENlc3paRDREZTF30gHMAUFVX3lxTE9nbG5QNHNpQkgtZVlBeTRMZlFNM3dNdGVQdFV1R0x5V19QZE94ZFcyVlF1czdJU3NpUUhaeGJocWNGWmlSTVMzalVmZzc1RmJhOEpKZXY1eTF0N0c3TFNsTHp0dE1lcDF0SGxNS3lTTFdsclV4RmRJOGZrMnNteFRlcTB1SURkN05xbWhGV3pDLVlHa3YzZkR4M0xiTHRhTVo0MjdCZngzVkd5cnJpZlprSXRPWDMxT01CWUNJRHNyR0xtSWJySE1DVUhuRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Ether's Fundamental Supply Outlook Better Than Bitcoin's, Analyst Says as ETH Tops $2.9K - CoinDesk",
        "content": "Ether has gained over 16% in seven days to trade above $2,900 for the first time in nearly two years while the bitcoin price rose a more sedate 8.5% to $52,300, CoinDesk data show. The ether-bitcoin ratio has jumped nearly 7% to 0.055. CoinDesk Indices CD20, a measure of the wider crypto market, has rallied 10.7%."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNZC01bnZuUS1SYUZBdi1RcEdzSnU0SXFDRGtoR25Tc1hlcUNYdTh6RFQ2SWJKWXJoemgtMklJQjBCRWQ0X1hlY2UweGxuR1RtODRlR2N5aGFGcklnc2liSzlhaE90cHczOFFTYWh0VVpFNVQwS09zUmpqM1d3UVJHUjZlOVFKUkpoUm5jYU0yUmFYVktw0gGaAUFVX3lxTE5QTWdLTjhPTkx0dXFoTkhOZVBENU1SandJNW1GUTRpQkRFQThyRl9TSFBpZEhHTU5kVFlwemYzX0xQTDVUT1hoZ21fSXpuZHltczRmU2tCY2QzbVRmaHdzb1dVbndpQkhXQXlUbnhVc3VYSEFBX3V4My03MW5pX3pWWmxLSVFMSXRBZGpRa3JjNmVWUHlJYlhpZWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Feb 2024 08:00:00 GMT",
        "title": "Ethereum bulls might help prices, but predictions show… - AMBCrypto News",
        "content": "Ethereum showed strong bullish sentiment on the price charts.\n\nA retest of the range highs would provide an ideal buying opportunity.\n\nEthereum [ETH] saw a minor pullback from $2867 to $2719 from the 15th to the 17th of February.\n\nThis came after the strong breakout past the range highs at $2.6k, a level that the bulls struggled to breach over the past six weeks.\n\nThe steady rise in active addresses in recent weeks suggested that a long-term uptrend was beginning, but that does not rule out retracements.\n\nTwo demand zones were identified- but the data also suggested that a move toward $2900 was imminent.\n\nGauging the state of the market\n\nThe H12 chart of Ethereum showed a clear uptrend in progress. The market structure was firmly bullish. A drop below $2472 would be required to flip the structure bearishly.\n\nThe RSI was at 73 at press time and has been within the overbought territory over the past six days.\n\nThis does not necessitate a deep pullback, but it does show that the prices were likely overextended and might need time to cool down.\n\nMeanwhile, the OBV continued to rally higher as buying volume spurred it northward.\n\nThe steady demand and momentum indicated that it was only a matter of time before Ethereum prices climbed to $3000 and higher. Beyond $3k, the $3250 and $3580 levels were significant resistances.\n\nShort sellers could face liquidations soon\n\nAMBCrypto also analyzed the liquidation levels data from Hyblock.\n\nNotably, the Cumulative Liq Levels Delta remained positive despite the minor pullback over the past couple of days. This showed there were more long liquidation levels.\n\nHow much are 1,10,100 ETHs worth today?\n\nHowever, their liquidation clusters were at $2550 and just below the $2700 mark. Meanwhile, a $179 million short liquidation level was present at $2858 (blue).\n\nHence, a move to the $2850-$2900 region was likely. It could be followed by another move higher, as the long liquidations, while more numerous, were more spread out.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxONWxEcUl1YmxDeVdsMWxzZnlyMWlIcV9Tbm5EbVpVNzRRNGZpUzhTWWQtdFhJMC1jYm5xckp6U3ZydHkyT05qcF8tU3pFUG5oSDRfS3gyOEZUYW5aSDhmdVBLdWo1RVQtN3A1b0Y4QTUxMnhNZnZQOF9NYTZMWnExUjVBNHQ0T0xwT3NuRXhVQm84cWlXM1g5emhWWdIBoAFBVV95cUxQWWJIdVU5dmkzUktrZ0N2UnZtTWMzV0R5WGZyTmNYZEVFQ0M2SG96V1BqUGRSUFU3OU5yZjQzSGplTlk0OGp6VDB3cExiMmNQUEZ1REpKNE5vY0ZJczRGMjVWUEs3OVVfYWVCNlBLbnMyRjc3ZjFpeDZYdFprN3NjT0JiSU1fQWk5dVVaWVlYSHptcXBhOFI0bGtERjVZbFVl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Rally to $4,000 Imminent Amid Massive Whale Accumulation - CoinGape",
        "content": "The world’s second-largest cryptocurrency Ethereum (ETH) has given a strong run-up above $2,900 gaining 4% in the last 24 hours. Since the beginning of 2024, the Ethereum price is up by 24% so far, as the altcoin gears up for a further rally to $4,000.\n\nEthereum Whale Accumulation\n\nThe major reason behind today’s Ethereum price rally is the strong whale accumulation. According to Lookonchain, an Ethereum whale initiated a series of transactions, beginning with the withdrawal of 100 million USDT from the popular exchange Binance. Subsequently, the investor allocated 60 million USDT to purchase 21,353 ETH at an average price of $2,810 per token. Following this purchase, an additional 10,649 ETH, equivalent to $30.68 million, was withdrawn from Binance.\n\nadvertisement\n\nThis recent transaction marks a continuation of the whale’s buying spree in the Ethereum market since February 8th. Over this period, the investor has amassed a total of 52,759 ETH, amounting to approximately $145.4 million, from both centralized exchanges (CEX) and decentralized exchanges (DEX).\n\nThe substantial Ethereum acquisitions by the whale investor underscore growing confidence in the digital asset’s potential amidst a period of market volatility.\n\nEthereum Price Faces Major Resistance At $3,000\n\nThe optimism among Ether bulls is palpable, with many seeing the $3,000 mark as an attainable target. However, historical data suggests that maintaining such a price level is no easy feat.\n\nA notable example is seen three weeks prior to April 3, 2022, when ETH surged by 42%, soaring from $2,520 to $3,580. Yet, this rally was short-lived, as its price plummeted by 46% over the next 40 days.\n\nGiven this precedent, traders are now wary of whether Ether could experience a comparable outcome in the current scenario. Also, everyone is bullish about the possibility of the spot Ethereum ETF approval by May 23 this year. Players like VanEck and Kraken are the recent ones to join the race for these investment products.\n\nThe SEC currently has multiple applications queued up for spot Ethereum ETFs. With the recent approval of spot Bitcoin ETFs and their subsequent positive reception, traditional investment firms have begun showing a keen interest in Ethereum ETFs.\n\nAmerican multinational asset manager BlackRock has also submitted an application for an Ethereum ETF to the SEC. However, the regulator postponed its decision on the offering, stating the need for additional time to carefully consider the application and make an informed decision. As a result, the SEC announced that it would delay its decision on BlackRock’s iShares Ethereum Trust until March 10, 2024.\n\nOn the other hand, market analysts have been also calling for a rally to $4,000 in the wake of the Dencun upgrade next month. Popular crypto analyst Michael van de Poppe said that Ethereum might catch up to the Bitcoin gains in its rally to $4,000. As Bitcoin enters the consolidation phase, the momentum will shift to Ethereum.\n\n#Ethereum is strengthening its momentum. How do I know? It's flat against BTC, while Bitcoin ran from $45,000 to $52,000. The momentum will shift toward Ethereum when Bitcoin consolidates and calms down. Onwards to $3,500-4,000. pic.twitter.com/541qbeRKdk — Michaël van de Poppe (@CryptoMichNL) February 15, 2024\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE5EMlltMUVkQ2VfY0xpNnNnLTJSdXp5RGJBc3pzSVBmaEsxZnp5aWM2X3haNk5fdlFKbl9jWWhDdzJiU05mTGZxbjR5bGw5RG9FZjk3aDZzNDZVcUphcktBVjlVODJfcGZT?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Justin Sun suspected to have purchased $160m in Ethereum - crypto.news",
        "content": "An address suspected of Justin Sun recently acquired $160.7 million in ETH, potentially indicating a bullish drive for Ethereum.\n\nLookonchain said the purchase was made through leading cryptocurrency exchange Binance and various decentralized exchanges (DEXs). The wallet, identified with the partial address “TWGHNc,” has been scrutinized for its large-scale transactions, including a withdrawal of 500 million USDT in Tether from HTX, formally Huobi, on Sunday.\n\nThe same wallet also deposited 50 million USDT into Binance today, with analysts and observers emphasizing that Sun would have the potential capability to withdraw such a large amount from HTX.\n\n1/ In the past 32 hours, someone bought a total of 54,721 $ETH ($154.4M) from #Binance and #DEX.\n\n\n\nWho is this guy? Could be #JustinSun?\n\n\n\nLet’s dig deeper.👇 pic.twitter.com/6yh4GRZnws — Lookonchain (@lookonchain) February 19, 2024\n\nFurther comparisons of transaction patterns have linked the “TWGHNc” wallet to another address, “0x7a95,” noting parallel activities between the two. On Feb. 7, TWGHNc deposited $5.4 million to HTX, followed by a similar amount in ETH withdrawal by 0x7a95 from HTX the next day.\n\nAdditionally, a 50 million USDT deposit to Binance on Feb. 1 by TWGHNc correlated with a subsequent withdrawal of 9,959 ETH from Binance by 0x7a95 on Feb. 12. The high-value transactions from HTX suggest that the wallet could potentially belong to Sun, although it’s speculative.\n\n\n\nIf Sun were accurately identified behind these transactions, it would signal a bullish interest in Ethereum from the TRON founder."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQWFdUb0pzLU5jRE0wMkhxTFIxSEkySktLeWNkRmFOcGNZcUc0UGRaRHExSG9wTlBEZlU1Q3dRbGRhZlNTTjBBUGJwbXJkUXVWaXhBM3lkaG5PTE04NmVIOXZHNWNPbF8zVk9JRURWOS11Z2dwaHg1NXBVN0dkemxJQjNvYldSZmRoRkt1NEJwanZBT2JGMFo4LTFYMNIBoAFBVV95cUxNaWJPMzJRWWxWb0cwZGxUTEY4OVhfRHNSaHF6MkloTzlhVXVRQ29HVWlPWTNMR2VoTjMwLXBzLTI0TW5vU1ZnYmVxcXpFZWJCLTFtdEFUb3lkNExWTlVJZjhhWk80VlBMMkVmZG9rZWUxNDNpMzVPSkJJVHB0Z20zOUFTNzdRSEp5TjBWcXQ5cnZCVWIxRlA1S08weGh2eWlW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Important Binance Announcement Affecting Controversial Ethereum Pairs - CryptoPotato",
        "content": "TL;DR\n\nBinance will discontinue support for specific leveraged token pairs, converting any held by users into USDT.\n\nThe move is part of the company’s ongoing effort to refine its product offerings.\n\nThe world’s largest cryptocurrency exchange – Binance – announced it will cease support for the following leveraged token pairs: BNBUP/USDT, BNBDOWN/USDT, ETHUP/USDT, ETHDOWN/USDT, BTCUP/USDT, and BTCDOWN/USDT by April 3.\n\nTrading and subscription options for the affected tokens will be terminated on February 28. The company did not provide a reason behind its move, reminding that it conducts regular reviews of its product offerings and leaves only those providing users with “the most value and competitive services.”\n\n“If users are still holding the aforementioned tokens after the respective delisting time, Binance will convert these tokens to USDT based on the corresponding net asset value (NAV) at the time of delisting and will distribute the USDT tokens to users’ accounts within 24 hours of delisting,” the exchange clarified.\n\nBinance leveraged token pairs are primarily designed for short-term trading. They represent a basket of perpetual contract positions and allow users to gain leveraged exposure to particular digital assets without complying with margin requirements.\n\nThese tokens, in general, were also very controversial back in the days following their introduction in 2020. There were many traders who failed to understand their exact structure and subsequently lost money because of it. There were even social media groups circulating online of people who wanted to sue Binance because of it.\n\nThis is not the first delisting spree launched by the company since the beginning of the year. Earlier this month, it disclosed that Monero (XMR), Aragon (ANT), Multichain (MULTI), and Vai (VAI) will no longer be available to users starting February 20."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNNUhseGZxQ084S3B4YUJNOXpwejJFQnNlNWtLeGgzWENoNkNIbUFYZGxuNXh6ZVJkeE55TkhZR0JISWZfZTRMTlFUQ0pJLTVWVjF4YjhOakNlYW45Y0NTMmFfaFNNZWFPdk52aWNUSTdGelVsQXlhelpmOWhaSmk1WVFXdjVOUjRBLTY2VTFPT1lWNVVkTnBtelZhZjB0WE13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Music industry eyes DeeStream presale after Ethereum and Avalanche whales join - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\n\n\nThe music industry and crypto whales eye DeeStream’s innovative presale amidst ETH and AVAX developments.\n\nEthereum recently had a small drop in value. Positive sentiment suggests it may climb above $3,000. AVAX is preparing for a token unlock valued at $400 million, which has historically affected the market.\n\nAmid these developments, DeeStream is gaining attention for its innovative approach to decentralized streaming. It provides a platform without content bans and offers lower fees for streamers. The ongoing stage one presale for DeeStream is priced at $0.035, providing an opportunity for early investors to support a new vision in online content consumption. As the cryptocurrency landscape evolves, DeeStream is reformating decentralized streaming, inviting investors to play a role in shaping the future of digital entertainment.\n\nEthereum: navigating a minor pullback\n\nEthereum experienced a minor pullback from $2,867 to $2,719 between Feb. 15 and 17. Despite this, the overall market sentiment remains bullish, with an upward trend in active addresses signaling a potential long-term uptrend. While retracements are expected, key demand zones and market data suggest an imminent move towards $2,900. The H12 chart reveals a firmly bullish market structure, with the Relative Strength Index (RSI) at 73, indicating potential overextension.\n\nDespite short-term fluctuations, Ethereum’s steady demand and momentum point towards a climb beyond $3,000.\n\nAvalanche: unlocking tokens worth $400 million\n\nA significant event is approaching for Avalanche as tokens worth approximately $400 million are set to unlock. Scheduled for Feb. 22, this release is part of the initial Genesis distribution and coincides with the standard issuance period for proof-of-stake tokens in the network.\n\nThe unlock includes 9.54 million Avalanche (AVAX) tokens, valued at $376.61 million, representing 2.6% of AVAX’s circulating supply. Historical data suggests that past unlocks have influenced AVAX’s market value, prompting investors to exercise caution and closely monitor their investments post-release.\n\nMusic industry joins DeeStream presale\n\nDeeStream emerges as an innovative player in the decentralized streaming platform arena, distinguishing itself by championing freedom of expression and avoiding arbitrary content bans. The platform’s commitment to lower streamer fees addresses a common concern in centralized platforms, fostering an environment conducive to creativity.\n\nDeeStream’s decentralized model positions it as an alternative to centralized platforms grappling with challenges. The ongoing stage one presale at $0.035 allows early investors to support a platform prioritizing transparent and secure operations. As the global live-streaming market grows, DeeStream stands as a forward-thinking solution reshaping the landscape of online content consumption.\n\nIn summary, Ethereum and Avalanche navigate market dynamics, while DeeStream offers a fresh perspective in the decentralized streaming space. Investors are urged to stay vigilant in response to AVAX’s upcoming token unlock, and those seeking innovation may find a promising opportunity in DeeStream’s presale.\n\nFind out more about the DeeStream presale by visiting the website here."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPV1B2aF9BYk10ZmQ0endMUndWLVVNMjk0MHJfYzJNMHFHQ3p0LW11QlFaN2FiZmxkd3hxVE5iRlFzX3ZvUFFkTW0zN1FfenpweEpYejBvNVlMeTE4Yjd1dnBJVml6Qk9yUXBVZlZUV2dqSngxanVRcEQ3RWdSVGlLd29NbkJQSFpaLVRnYjJHZUdoR0dPMGxWdkU2NmtKbUVNQk1Ja0xOVGZmdUNjS2pj0gG0AUFVX3lxTFBoMlVBVlY5al85dWVIbU83Vl9lSnlZYWJ4Ym9vMnFaVjRHcmYwVFpjT0FPbTk0MEJ1bUlUaGNSa3NiSTdtQkQ1SlRWSFhBR2l3UEVmOWJMTGhNTUlOa29NdS1RLVVCQ0UzYVBobWtJY1VCSjllTGh0am1takZRNm1mSmVDRDUxWGF6NGRXZVpDU1BULVREa2pQY2hSWVd5ejNyTEprLXB2SmljTUU3VGQxeEFTUg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Elliott Wave analysis: Ethereum is extending higher - FXStreet",
        "content": "Ethereum with ticker ETHUSD is coming nicely higher as expected and it's now even extending the rally on the news that Blackrock Ethereum ETF plan is confirmed in the Nasdaq filing. By current extension above base channel resistance line on the daily chart, seems like it's trading within higher degree wave C or 3 from Elliott wave perspective and it should be completed by a five-wave cycle of the lower degree, where we see room at least up to 3200 - 3500 area.\n\nGet Full Access To Our Premium Elliott Wave Analysis For 14 Days. Click here."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxQUHhJTE9hdkdYMExERVBLTFM5Q1FqSE0zZklFb1dDbTFxZnExNldKZTlzMlBUaXdGSWExLTF5cmtINndFaWFRZjFIWFdCUVFmazRGSVFZcDBrN1k0WUU0cF9PV3ZXa0pSRUJwQU9fX3diamxGemdqTjBhbTROZU5DTDNQc0dfOVJMMm5Wak05ZUhWV2RhbXpHd293TFNjSlJJXy1WUU9PQWtUQjhubjhyd2xyUEtMellJVHM0bjdKVGFpeTQxY3AxVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "The co-founder of Ethereum Vitalik Buterin finds solutions in AI - The Cryptonomist",
        "content": "The co-founder of Ethereum Vitalik Buterin looks at artificial intelligence (AI) as a solution to mitigate technical risks.\n\nThrough code verification and bug detection assisted by artificial intelligence, Buterin seeks to strengthen the Ethereum infrastructure while navigating the complex interaction between innovation and security.\n\nEthereum co-founder Vitalik Buterin finds solutions in AI\n\nThe innovation of Ethereum involves challenges and one of the main concerns of co-founder Vitalik Buterin is the looming specter of technical risks, particularly in the form of bugs within the code. To address this issue, Buterin has turned to artificial intelligence (AI) as a potential solution.\n\nIn a recent post, Buterin highlighted the potential of AI in assisting Ethereum developers in identifying bugs and verifying code.\n\nButerin has expressed enthusiasm for the prospect of formal verification assisted by AI, recognizing it as a breakthrough that could significantly mitigate Ethereum’s main technical risk.\n\nThe application of AI in this context promises to improve the robustness and security of the Ethereum infrastructure.\n\nButerin’s interest in AI goes beyond just bug detection. In a previous blog post, he outlined four ways in which cryptocurrencies and AI intersect, highlighting the potential of AI to revolutionize various aspects of the blockchain ecosystem.\n\nHe emphasized the idea that integrating AI into existing mechanisms could lead to more efficient and scalable operations, especially in scenarios where individual actors are replaced by AI agents.\n\nHowever, this convergence between AI and cryptocurrencies also brings a series of challenges. Buterin acknowledges the intrinsic tension between the principles of open-source development, fundamental for the security of cryptographic systems, and the vulnerabilities introduced by open AI models.\n\nThe susceptibility of AI models to adversarial attacks represents a significant concern, highlighting the need for nuanced approaches to security in this rapidly evolving landscape.\n\nThe symbiosis between AI and Web3\n\nAnalysts have echoed Buterin’s sentiments, predicting a symbiotic relationship between AI and web3, the next iteration of the Internet characterized by decentralized protocols and applications.\n\nSandra Leow, analyst at Nansen, predicts a future where AI agents will play a key role in blockchain ecosystems, citing examples such as verification management applications that leverage zero-knowledge learning technologies.\n\nThe fusion of AI and web3 opens up a myriad of possibilities, from improving security and scalability to enabling new applications and use cases.\n\nBy leveraging AI-based tools for code verification and bug detection, Ethereum and other blockchain platforms can strengthen their defenses against potential threats, thus instilling greater confidence in developers and users.\n\nFurthermore, the emergence of AI agents as active participants in blockchain networks heralds a paradigm shift in the way we interact with decentralized systems.\n\nThese autonomous entities have the potential to simplify various processes, from identity verification to supply chain management, unlocking new efficiencies and opportunities for innovation.\n\nHowever, as with any technological advancement, it is necessary to carefully consider the ethical and social implications of integrating AI into blockchain ecosystems.\n\nIssues such as data privacy, algorithm bias, and the concentration of power in the hands of AI agents require solid governance frameworks and transparent accountability mechanisms.\n\nConclusions\n\nIn conclusion, the combination of artificial intelligence and blockchain technology, as advocated by Vitalik Buterin, is very promising for addressing the technical risks inherent in platforms like Ethereum.\n\nBy leveraging the capabilities of artificial intelligence for code verification and bug detection, Ethereum can strengthen its resilience and security, instilling greater trust in developers and users. However, this convergence also presents unique challenges, including concerns about data privacy, algorithm bias, and concentration of power.\n\nWhen navigating this landscape of transformation, it is essential to find a balance between innovation and ethical considerations, promoting transparent governance frameworks and accountability mechanisms. Ultimately, the synergy between AI and blockchain has the potential to revolutionize various aspects of decentralized systems, unlocking new efficiencies and promoting unprecedented levels of innovation.\n\nWith careful management and a commitment to responsible development, we can harness the full potential of these technologies to create a more inclusive, transparent, and resilient digital future."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQcmJ0V015UHlCYnJtRWlKd1hmcEhoUndXcS1uYU5sdkc1X3BFeVRyS2ZYNC1Ka0JPa0hWcVhGWHNkQ3BCaWVSMXdhZ3NSYlNsdnZob0xLRF8xRjZwUXBGME9qM0pkdVhEdWxDWHdqbllUTUM3V3hGRWF1dFVJVFhFM2NLTlk2RURiVExPWXE2YXRhY0J6bzZV0gGcAUFVX3lxTE9TN2VfOFUwQnFHRklBa3dBRVkwZXFKcko2V3AtNzhTRUVFRkJhYWd2eVp0ZHVkalQtYUJ5Q0gwNDQ4dm9LdGhWcWJROWV5TWdraHdfVV9tX1hadFRTTnMwRVJPaU45MldVa0ItYmloZFdDc2stWEVudmQyNGxaaTdqbWVXbzVkWjhLM3lBSzlTZ1Juam5ZdTlya2I0OA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin VM Enables Quick Transfer of Ethereum dApps to Bitcoin Network - CoinGape",
        "content": "A groundbreaking advancement in cross-blockchain technology has emerged, marking a significant milestone in the integration of Ethereum decentralized applications (dApps) onto the Bitcoin network. The Bitcoin Virtual Machine (BVM) stands as a game-changer, functioning as the counterpart to Ethereum’s Virtual Machine (EVM) but tailored for the Bitcoin network.\n\nBVM facilitates the seamless migration of Solidity smart contracts and dApps from Ethereum to Bitcoin with minimal modifications required. What sets BVM apart is its remarkable efficiency, drastically reducing deployment times. Unlike traditional methods taking months or even years, BVM enables the swift deployment of Ethereum dApps onto the Bitcoin network within mere hours or days.\n\nadvertisement\n\nThe advent of BVM holds immense significance for blockchain interoperability, bridging the gap between Ethereum and Bitcoin ecosystems. This innovation not only accelerates development processes but also fosters a more cohesive and integrated blockchain landscape, propelling the growth and evolution of the entire blockchain ecosystem.\n\nSuccessful Deployment of Ethereum dApps onto Bitcoin Using Bitcoin Virtual Machine\n\nSeveral prominent Ethereum decentralized applications (dApps) and protocols have seamlessly transitioned onto the Bitcoin network through the utilization of the Bitcoin Virtual Machine (BVM). Notable examples include Uniswap, Optimism, and GMX_IO.\n\nThese sophisticated platforms, known for their robust functionalities and widespread adoption within the Ethereum ecosystem, have successfully leveraged BVM to expand their reach and functionality onto the Bitcoin network.\n\nBVM operates as a bridge between Ethereum and Bitcoin, allowing for the interoperability of smart contracts and dApps across these two distinct blockchain networks. It achieves this compatibility by implementing Ethereum’s Solidity programming language and smart contract standards within the Bitcoin environment.\n\nAlso Read: Goldman Sachs Raises S&P 500 Target to 5,200, Will Bitcoin (BTC) Follow?\n\nImplications of Bitcoin Virtual Machine for Blockchain Industry Growth\n\nThe advent of the Bitcoin Virtual Machine (BVM) carries profound implications for the growth and evolution of the blockchain industry. BVM’s ability to facilitate cross-blockchain development opens doors for enhanced interoperability between the Ethereum and Bitcoin ecosystems. This newfound interoperability not only fosters collaboration between the two communities but also encourages the exchange of ideas and innovations, ultimately enriching the entire blockchain landscape.\n\nThe potential for further developments and applications enabled by BVM is immense. As developers continue to explore the capabilities of this technology, we can anticipate a wave of innovation in cross-blockchain development. BVM lays the foundation for the creation of decentralized applications that seamlessly operate across multiple blockchain networks, offering enhanced functionalities and user experiences.\n\nAlso Read: Just-In: Ethereum (ETH) Price Surges After This Vitalik Buterin’s AI Comment\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNVTVxSTVDd085Z2wzR29icUNWNmZsVDR1LWFiMkZtWGJpWTJMYlllTWVqYjBZSmk0cXNKR3ZBbGwwTnBsUzB3YmN6ZFZiV0NsOWlJQ1lqSVFQODJiWkNjeUlwdmJjeEJ5MGs0RmNWOHJtcDF0QkZNRWdaTElRYXZQTXBQWTcwZTZnMk1oUnYwMEYwbnhuRmJ6WVB3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Vitalik pushes for fast adoption of Verkle Trees on Ethereum - CryptoTvplus",
        "content": "Ethereum’s co-founder, Vitalik Buterin, has expressed anticipation for the upcoming Verkle Trees, highlighting their potential to be a game-changer for staking nodes. Vitalik said that he wants to see the full implementation of Verkle trees.\n\n“They will enable stateless validator clients, which can allow staking nodes to run with near-zero hard disk space and sync nearly instantly – far better solo staking UX,” he noted in a tweet. He added that it will make it easier for user-facing light clients.\n\nVerkle Trees are a type of data structure that can be used to efficiently and securely prove the inclusion of a particular value in a set of data.\n\nThey are similar to Merkle Trees, another popular data structure used in blockchain, but with some important differences.\n\nThis allows clients to verify state changes in each block with minimal data. Verkle Trees is a critical step on the path to stateless Ethereum clients, who do not have to store the entire state data to validate incoming blocks.\n\nInstead of using their own local copy of Ethereum’s state to verify blocks, stateless clients use a “witness” to the state data that arrives with the block. A witness is a collection of individual pieces of the state data required to execute a particular set of transactions.\n\nVerkle Trees enable significantly reduced proof sizes for a large amount of data compared to Merkle Trees, making them an important tool for smart contract developers and other blockchain professionals.\n\nVerkle Trees bring several other advantages to Ethereum, including smaller proof sizes for efficient network communication, reduced hardware requirements enhancing decentralization, faster node synchronization for quicker onboarding, potential scalability benefits with higher gas limits, and compatibility with Ethereum’s evolution towards a zk-EVM future, ensuring adaptability.\n\nCurrently, Ethereum validators need fully synced nodes containing all state data for chain validation.\n\nVerkle Trees, part of an Ethereum Improvement Proposal (EIP), introduces self-contained execution units within blocks.\n\nThis innovation allows blocks to be verified without additional information, such as the complete state of the chain.\n\nWhile Verkle Trees are currently in the testnet phase, their anticipated launch on the mainnet is set for 2024."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMisAJBVV95cUxNc0R6b3Z2SjF5elc5bTdsNm5xREptbUozUFZyYkllcnhHWHEydGpyaHBjWWpFY3FpN1JwQnVlUkZDaDJNaXpfdFNUbmhMV0o3QnhaSjB3di1EQjJzeVFPTFliMEFPX3RScXBXWlJzVEdYajNrQXczVWNROWpKUEp6MkZPM0VqRFRteW54TXBjV0l0VklzdklkalhBLTU5VFFhTFRqZkV0dTFPMjFJcG1EZGVZZU00MFVQTTJqZ1plN3VTVVhrVUFSYjV5eDFDRmtmM1lYREdiNXJQek9CVDVFVFVFSTdPTTVFSVl5Mm5IR1VXb2E2NVA2QjRPOEpEN2JCekpzVjRscXBxczBHYnZDNUo3TDlWaDkwYkUzU2dVZFFGT182Xy1MekYzRk13aUk00gG-AkFVX3lxTE5XT0lOQ25TdUtYU202MnNSNE9waElfV1BFM2dLWkdVRjhubTlnRDlZM093cWVmcVcxeTBJQ3pIb0c2SjdpR3E2Q01xQUtsamJBb3BKMTlhNFZzdWFpZTR5bWdlWWc5bjJCR2RvSlNUVkpVeTFCRVRCSXV1bzFYcWVRS2h6bFp0N2NYVHl2YzNqb3Q5MFphSTkzM3ozU2U1Z1RMNnpHX3NkMWVDckxRMXJqNGNXZkNXd0hEZHdFajJHeHpsc2ltbHNLOGhsMXpKek1uNVpERVdNQnBjUndxdmlUQmNfNHpnU0gydVlZbWVjd2VZUnJiWTA2WmlENS1SRmdRR3lhYkJSYmpjd3JScVhBeFg2eG5aUE9EMXhyUUJSUU5mWnR4dGZ4WF9ybFppYnJfWTJpc0l2VHJJMHh6dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "How will the Halving Impact Bitcoin and the Best Altcoins to Buy That Could Explode? Featuring ApeMax, Sei, Solana, Stacks, Ethereum, Mina, and Flow - Analytics Insight",
        "content": "The Bitcoin halving is a programmed event in the Bitcoin blockchain that cuts the mining reward in half. Historically, this event has often led to upward price movements due to the reduced pace at which new bitcoins are generated, leading to a possible supply crunch. However, it is impossible to predict the exact impact the upcoming Bitcoin halving will have and Bitcoin's price remains uncertain."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBMV1ZRQWgwbWl3dXpYYW5COC1BUDlwWHRRQ2hZY0hOU21Ic1FGRVk0NERBbU5TWW5mNUpZWDdaZEZtb1VhX25NMUNiUzgzcDhrUF8za19DVWVEUlhTWUJwOWJjc2l4UWpWZFhCVE1zM1VGX1VnQ1EtN3VfWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Feb 2024 08:00:00 GMT",
        "title": "US SEC May Name Ethereum a Security, Here’s Why - Times Tabloid",
        "content": "In the latest Ethereum news, it appears that the time is now up for the second-largest cryptocurrency which has so far avoided being named a security by regulators. This follows after a Wednesday announcement hinted that Prometheum is planning to launch custodial services for Ether, the Ethereum blockchain’s native coin.\n\nFrom the look of things, Prometheum may have orchestrated the move to force the hands of the US Securities and Exchange Commission (SEC). That is as it pertains to declaring a stance on Ethereum’s legal status, having classified over a dozen other cryptocurrencies as securities.\n\nRead Also: XRP Lawyer Reacts As SEC Confirms Investigating William Hinman\n\nFor what it’s worth, the majority percentage of the crypto industry has been at loggerheads with the SEC for many years. Top crypto firms such as Coinbase and Kraken, for instance, insist that most of the SEC’s rules are outdated. To this end, they have mostly been operating outside the regulatory framework of the agency.\n\nThe agency, on the other hand, has constantly maintained that its rules and regulations are sufficient for the crypto industry. At some point, the agency even filed lawsuits against these same crypto companies.\n\nHowever, the crypto industry was not buying the legal threats as many immediately drew support for Coinbase and others while slandering the SEC’s approach to regulation. They argue that Ether is more like oil or gold — an asset that doesn’t fit the legal definition of a security and so can’t be registered.\n\nPrometheus Backs US SEC\n\nIn all of this, however, it appears that Prometheus may have taken quite the unpopular route. The controversial crypto firm, which was founded by two brothers, Aaron and Benjamin Kaplan, argues that the SEC is well within its rights with the claims that most cryptocurrencies are securities.\n\nTo further prove their point, the Kaplan brothers hint that Prometheum will be able to list different crypto assets as securities under an exemption called Rule 144. This rule, according to the brothers, is normally used to trade restricted stocks.\n\nHowever, the Kaplans believe that by using blockchain data to confirm whether an asset has been in circulation for more than a year, the exemption rule can come into play nicely with ETH. This means that Prometheum may be able to bypass issuers and not work directly with them. That is, ultimately, the firm has the opportunity to choose which assets to list.\n\nAs expected, Prometheum’s submission and SEC-supportive claims have raised curious eyebrows even beyond the crypto industry. Some lawmakers are questioning the authenticity of the firm, which has next to no history to write home about. As a fact, it is being widely pushed that the SEC Chair Gary Gensler may have created the firm to advance his regulatory agenda.\n\nFurther fueling the agenda rumors was a CNBC interview last June. In the interview, Gensler could be seen heaping praise on Prometheum’s exemplary registration. Its registration as a special purpose broker-dealer set a compliance pathway for other firms in the industry to emulate, Gensler noted.\n\nIn the same month, Prometheum was also invited to testify at a crypto congressional hearing. This was despite its seeming inexperience in the industry at the time.\n\nWe are on twitter, follow us to connect with us :- @TimesTabloid1 — TimesTabloid (@TimesTabloid1) July 15, 2023\n\nRead Also: Ripple CTO Asks SEC about the Security Status of Ethereum (ETH) Sales on Exchanges\n\nWhat It Means for The Crypto Industry\n\nBefore now, the constant debate over Prometheum’s proposals has been nothing but theoretical. However, Wednesday’s announcement may have caused a major shift in the outlook of crypto regulation. If Prometheum begins to offer Ether custodial services for institutional clients by late March as announced, that may become the only compliant way to offer assets like Ether for trading.\n\nMeanwhile, Benjamin Kaplan has seized the opportunity to clear the air about the real intentions of the fast-rising firm. He recently disclosed that Prometheum is focused on building the crypto industry, rather than sabotaging it.\n\nFollow us on Twitter, Facebook, Telegram, and Google News"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOV1AxbU5JLWpjWndmbnpKRDB5bThyWFlZRzVVWllYVFNPbmk3blgwbWdWcFFlZWRsQ0Yxd0Rmc2JsMWRMMmlJeGY3OHRsbkp1SFppUURMc1llVFRWY1FoMlo1UkluZHRxREY5MFVkeWtUWUxwbDktSnFCOV9JNlNTd0lhMEdoVGthVGlMeEYxZkdFT0V0eU5YTnNn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Looks to AI to Solve Ethereum’s Biggest Technical Risk - Coinfomania",
        "content": "Let’s start with the basics. When you’re looking at the crypto market, especially in times where a bull run seems imminent, the key isn’t just to follow the hype but to make strategic moves. And if you’re reading this, you’re probably already thinking about how to catch that next moonshot. Here’s where crypto presales sometimes … Read more"
    }
]