[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNeElxRjZSUzBfb3ZpMnpOYlBCc2RPV1hmRVZSbV9CRGxVeHVDaU5QeHk1V0xYckQ4LUg0a2hDaWw1ZGw3N0ZiRWEwek1Ja3hpRHdtV0xpWXVSVFBNUVl4aWxYZzZZbUl4S0dZLVJrNEI1UlNWZWRRbjBaY1RpeVFCWWVRQk1VY2lyOE1nYktnZlRzS1BNMDdFT01uVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Why Ethereum Gas Fees Have Fallen to Their Lowest Level Since 2020 - Unchained",
        "content": "The low price of transacting is a result of the flight of activity away from Ethereum’s base layer to its layer 2 networks, particularly following the Dencun upgrade that occurred in March.\n\nThe average cost of a transaction on Ethereum is at its lowest level since Jan. 2020 (one gwei represents one-billionth of one ether and is the unit of ETH used to measure gas prices). The decline reflects the movement of activity from Ethereum’s base layer to its expansive array of Layer 2 solutions.\n\nMoreover, the release of the Dencun upgrade, which significantly reduced fees for those layer 2 networks, has only intensified this trend of lower transaction costs. Gas prices on Ethereum have decreased about 92% from about 63 gwei on March 12, the day before the upgrade, to around 5 gwei at presstime, data from blockchain explorer Etherscan and analytics investment platform Ycharts shows.\n\nAccording to layer 2 watchdog platform L2Beat, the number of active and upcoming L2 projects collectively stands at 95. Over the past several months, users have significantly increased the amount of crypto assets they’ve bridged over to various layer 2 scaling rollups. And of the L2s, the top ones by total value locked—namely, Arbitrum, Optimism, and Base – have seen a spike in active daily addresses, signs of increasing user activity.\n\nRead More: Vitalik’s New EIP-7702 Draws Early Support; Could Be Included in Ethereum’s Next Hard Fork Upgrade\n\n“We can certainly see a trend upwards on EVM compatible chains of daily active addresses, which means users are going to cheaper alternatives. Looking at bridge data also confirms this, as bridge activity across Layer 2s has increased from ~$170mn per week to ~$300mn per week,” Andrew Van Aken, a data scientist at blockchain analytics firm Artemis, said in a Telegram message to Unchained.\n\nAdditionally, Ethereum has seen over $3 billion in net outflows of ETH over the past three months, per Artemis, with the majority of the flows going to L2s such as Arbitrum, zkSync, Base, Starknet, and Optimism.\n\nThe decrease in Ethereum’s transaction costs is “a reflection of the constant evolution of blockchain. Initially Ethereum served as the universal layer for all apps, from decentralized exchanges, to games, to trading memecoins, wrote Justin, CEO of decentralized perpetual futures platform Vest Exchange, in a Telegram message to Unchained. “However, with the advent of Layer 2 solutions and app chains, builders and users (and MEV bots) are realizing that there are tailored ecosystems for specific use cases. In return, we also see Ethereum to be transitioning moreso as a foundational security layer and for supporting more ‘passive’ protocols such as lending and LSTs.”\n\nEthereum Post-Dencun Upgrade\n\nDencun, the most recent Ethereum hard fork that brought several codebase changes, went live on mainnet on March 13.\n\nWhile the number of transactions has remained stable at just over one million per day, the amount of fees paid by end users of Ethereum has plummeted since Dencun, per Artemis.\n\nWith less overall transaction fees, the amount of ETH burned has gone down as well. According to Ethereum analytics platform Ultra Sound Money, the amount of ETH issued in the past thirty days is more than the amount of ETH burned, one outcome of the Dencun upgrade.\n\n“The new supply of ETH is now growing at the fastest daily rate since the Merge as fees burned plummeted as a consequence of the Dencun upgrade,” analysts at blockchain analytics firm CryptoQuant wrote in a report published on Wednesday.\n\nThe price of ETH reached a multi-year high of $4,000 on the day of Dencun, but has since dropped roughly 25% to around $3,015 at the time of publication, data from CoinGecko shows."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPbTJKWWZLRXI0UDRIaS01RTNMNFMyd0ZPRUFTTXE3ejE0UFZnREhYVGRzSThfaGVOMnJsVVpTNi1RUjhROU5ZMmk2MUNKSDgtaU9DYVpHblc4M2xGZEp5NHVTdm8yX1U4VXlXVXJ0X3FoYnhwNjJCemExbzRISWNlUjNUMXcycEZjbmptOEY2Q2hETmhiU250LUxZWU1vY3M5aC1CdWM1OUxVNVlkbjhuZm5HWUZvR3ZFSThoODZ2cUhXUEtJanEwMzY4UFZTTVHSAeMBQVVfeXFMTUFibzVXYUpLbF9aRWFCc1hCYVhMYmVBR3JnTzBDREdXVEw0OHA2cWg0T3ZlN1NVZU44MXNtaVFicHhwYUdQaWRfM3FFYTFHUXNIT09ydmptZ2ZpXzRIcWVyUi1Xd2Zpc21uZ3NkckVDcG5oc29NdE5aUEJOQWlCXzhuX1hCNTFXcUo0UWxncVRBMWxtTkVsbkVDOWJVbE9kVGZndUYxZWt5WmF5VWVCcnpIM3F3V21xMENpYjc1YmdYbEdfSk9fZlR3WjE1aldTSlhJVl9rd1dRd1NKOGhMaVNqNFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Ethereum, and blockchain technologies, are threatened by Washington regulators - The Dallas Morning News",
        "content": "The Texas “economic miracle” is a well-established fact and the latest data from the Texas Work Commission backs it up: In this year’s first quarter, the state enjoyed the largest increase in nonagricultural employment across the country, posted record-high levels of jobs and logged its 36th consecutive month of positive annual growth.\n\nTexas has built on this momentum and emerged as a decisive leader for so-called Web3 innovation. In other words, that’s the decentralization of blockchain technologies and token-based economics. Blockchain is the mechanism that records digital transactions across computers.\n\nAdvertisement\n\nThis is no accident: Texas legislators have intentionally crafted pro-crypto policies which have, in turn, attracted a robust ecosystem of developers and miners. And the state’s deregulated power market allows for access to inexpensive power complemented by a healthy mix from renewables.\n\nAdvertisement\n\nThese are just some of the reasons we relocated our company, Consensys, from New York to North Texas last year. We were confident that Texas would be the optimal home for our core offerings, built on Ethereum — the world’s second-largest blockchain — and powered by ether, the digital commodity that underpins it.\n\nOpinion Get smart opinions on the topics North Texans care about. SIGN UP Or with: Google Facebook By signing up you agree to our Terms of Service and Privacy Policy\n\nMore precisely, we concluded that Texas’ unique alchemy of business-savvy leaders, encouragement of innovation and stable regulatory environment would allow Consensys to help shepherd the next phase of the internet’s development. The hallmarks of this next phase — transparency, security, and accessibility, all controlled by the user, not any big tech company — are undeniably ground-breaking. That’s why companies around the world are already building software applications to run on Ethereum. And why the biggest asset managers in the world are working on asset tokenization using Ethereum.\n\nYet all this potential is under imminent attack from unelected regulators in Washington. Without legal authority, the Securities and Exchange Commission is in the process of arbitrarily reclassifying ether from a commodity to a security so that it can enforce the sort of registration and other requirements that attach to securities (such as bonds, stocks and other investments) under its jurisdiction.\n\nAdvertisement\n\nBut ether is plainly and logically not a security. On multiple occasions, the SEC itself has affirmed this point — as has its sister agency Commodity Futures Trading Commission — and our entire business model has been built against the backdrop of this clear, prior regulatory consensus.\n\nThe SEC’s regulatory escalation belies fundamental principles of separation of powers, where it is the job of Congress to legislate and assign jurisdiction over blockchains like Ethereum. Texas knows all too well the risks inherent in federal regulatory overreach and the SEC’s proposed power grab in this instance is unlawful, unwarranted and arbitrary. It also directly and materially impacts Texas by dismantling a growing sector that both supports highly-skilled Texas jobs and represents the cutting edge of technology, the way we store our data and the future of our digital interactions.\n\nMore broadly, if the SEC prevails, it spells the end of the Ethereum blockchain in the United States by rendering ether functionally inaccessible and unusable. Software developers in Texas and around the country wishing to create applications that are interoperable with Ethereum would have to register as securities broker-dealers with the SEC itself, a draconian step that would basically outlaw all current software development in the U.S. relating to Ethereum as well as everyday transactions in ether that are essential to on-chain transactions.\n\nAdvertisement\n\nWe hope the state of Texas, no stranger to aggressively fighting federal regulatory overreach, joins us in halting the SEC in its tracks. We took a major step recently by filing litigation against the SEC, asking a federal court to order the SEC to end its unlawful campaign.\n\nAdvertisement\n\nWe urge Texans who value innovation and economic independence to follow suit, support this unfortunate but all-too-necessary effort, and preserve the state’s hard-earned leadership position at the forefront of Web3 innovation.\n\nJoseph Lubin is co-founder of Ethereum and founder and CEO of Consensys.\n\nWe welcome your thoughts in a letter to the editor. See the guidelines and submit your letter here. If you have problems with the form, you can submit via email at letters@dallasnews.com"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOVXE0WlhDMWI0Nmk4M0xVSTZFcVlleUN4c3dBRFFJNzZ3VUI1SGJUc0NpY1A2cVVlNl9MRHFxVUFhOVk0ZjJCVk50a19ZNWxxVHVXQk82aV9ZWk1qOVJsbGdkN2F4N3RYUk41ODg0VXcyUzQzTGt4MW5EZUdIcXFtSFAyUGRiUFNhWUJyTU1ZOWswT09j?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Why the US election will decide the fate of Ethereum ETFs - DLNews",
        "content": "Ethereum spot ETFs will likely be denied on May 23.\n\nProspective issuers probably won’t sue the SEC — even though the strategy worked to get Bitcoin ETFs out.\n\nThe US election may hold the key to an approval.\n\nThe Securities and Exchange Commission will probably deny applications for Ethereum spot exchange-traded funds on May 23.\n\nThe lack of meaningful interaction with prospective issuers, coupled with Ethereum’s ambiguous regulatory status, have made analysts pessimistic about the chances.\n\nNot to mention the SEC’s recent investigation into the Ethereum Foundation.\n\nThat means spot Ethereum ETFs probably won’t see the light until the end of 2025, Bloomberg Intelligence ETF analyst Eric Balchunas told DL News.\n\nFaced with a rejection, prospective ETF issuers — like BlackRock, Fidelity, or Ark Invest — have two options: either sue the SEC like Grayscale did for the Bitcoin spot ETFs, or file again at a later date.\n\nFactoring into the equation is the US election. Should former President Donald Trump win a second term in the White House, the SEC is likely to face a change of leadership. And a new chair could be friendlier towards crypto than Gary Gensler.\n\n“If there’s a new president, you file again,” Balchunas said. “Maybe you get approved. Or you sue. Either way, that will take a whole other year to play out.”\n\nSuing the SEC\n\nThe SEC spent years shooting down Bitcoin spot ETF applications before Grayscale filed a lawsuit against the regulator in protest in 2022.\n\nJoin the community to get our latest stories and updates\n\nIn September, a judge found that the SEC had acted in an “arbitrary and capricious” manner by denying the applications. Four months later, the Bitcoin ETFs were launched.\n\nStill, it’s unlikely that the strategy will be replicated for Ethereum ETFs. For one, Grayscale will probably not bring the fire to the SEC a second time, Balchunas told DL News.\n\nLawsuits are expensive — not just in terms of money, but in attention and bandwidth too. And after suffering massive outflows when its Bitcoin trust was converted into an ETF, it wouldn’t be surprising if Grayscale did not aggressively pursue a conversion of its Ethereum trust.\n\nOther prospective issuers, meanwhile, won’t dare pick up the baton and sue the regulator themselves, Balchunas said.\n\n“None of these other firms want to piss off the SEC,” Balchunas said. “Grayscale was unique in that it wasn’t a big ETF issuer. The rest of these firms have other things going on, and they’re more scared.” “Nobody else will step up,” he added.\n\nElection time\n\nAnd why sue the SEC when the US presidential election, slated this November, may solve the problem?\n\nWith Trump leading in some polls, the odds that a new SEC chair will be appointed are higher than previously expected.\n\n“Trump is not necessarily pro-crypto,” Balchunas said. “Remember his previous SEC chief Jay Clayton didn’t allow that ETF either. So he’s not going to be like, ‘let’s just go crazy.’ But he’ll probably still be better for crypto and spot ETFs.”\n\nAssuming a new chair is appointed in April or May, and filings submitted immediately afterwards, that could bring the deadline for approval or rejection to somewhere around December 2025.\n\nAlternatively, issuers could try to file as soon as the election is over — or even before results are in — to speed up the timeline.\n\nAnd if Joe Biden wins?\n\n“In the past cycles, when they denied spot Bitcoin ETFs, there was usually a cooling off period for like a year where nobody did anything,” Balchunas said. “And then out of the blue someone is like, ‘Oh, the hell with it’ and files again.”\n\n“My guess is that issuers will take the summer, lick their wounds, just be bummed, and then see what happens in the election,” he added.\n\nTom Carreras is a markets correspondent for DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOb2RfdmZRNm83V3pKWnBMLXZzYjhtanZoZWFrSXUzWklxSk1EWjYxZktpdU1IelZWN0k3N2tUMEQ5ZTM5RzcwMUsxa19YbXBLODlyQjY1bW1IclhmQTBSYmE0NTZvWV9SdVVveDI2QmpYR0h5QmlPOVJ6dFdDX0xPLVNJelhHVHE1QWfSAY8BQVVfeXFMUE1CcHZtRUh6RnE3UFdBbmhNdGY2MmZfMEpLNS1iRE5SbVVjbFdXem9vc0lBTGFIQ29lMUl2RGsydGxDdm9ZRnlGeGgyZThqQXlwZzhUaHdvcmhVQXRRNHVIaFFtMFJhLVBoQlY0bk11MVZRdkFraGFXRThiZ2xBdFFBdUMwdFQwenpmY281ZW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF: Grayscale Boss Optimistic Ahead of Major SEC Decision - U.Today",
        "content": "Grayscale CEO Michael Sonnenshein is reportedly \"optimistic\" about Ethereum ETF approval prospects.\n\nAdvertisement\n\nThe head of the latest cryptocurrency asset manager expects the agency to do \"the right thing.\"\n\nAs reported by U.Today , Grayscale recently withdrew its Ethereum futures ETF application after it was delayed in November. According to ETF analyst James Seyffart, it was a Trojan horse filing that was meant to get a 19b-4 order from the SEC.\n\nHowever, according to multiple analysts, Grayscale's withdrawal likely means that it is not going to pursue another lawsuit against the SEC.\n\nAdvertisement\n\nLast August, Grayscale scored a massive victory against the agency, which eventually paved the way for the approval of a slew of Bitcoin ETFs in January.\n\nGrayscale's GBTC recently recorded its first days of inflows after months of non-stop bleeding.\n\nDespite the success of Bitcoin ETFs, the consensus appears to be that the SEC will shoot down several Ethereum ETF applications this March based on the complete lack of engagement with ETF issuers.\n\nRecently, key Ethereum backer Consensys, which is helmed by Ethereum co-founder Joseph Lubin, took the SEC to court over its attempt to label the leading altcoin as a security.\n\nIn late April, Bitcoin and Ethereum ETFs started trading in Hong Kong, but their debut was rather underwhelming."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNeEZRVmlMVGdwYTJnRnZDZ2g2Q3U4ZzlfV2dmeWk4MnA1cTJwOXN4WUlXb1plemhrN3g5ZWpfRFc0cHhEREppM1pDaEFIbDhSSkpBSmFwT19SOXh5R2NKakNDa2dNemZkVmFVeUc1ODcyejdkTHNWcG05VGxBWE9rVGhZWXpfVDVzRUUzOUYxRTJQVjRqVF9RY0dRVWNSMmhOT1J0RW9sSVl1bklTLTBqWG1RZ9IBuAFBVV95cUxPRC1wTDNnZ2s1bl80SDRuTkVSbTBkSldjc3BhZXpqemIyU2hiT0h4STZwcU5wYVkxQV9pOTlLSG1EREx5UG9UNGpKWU51ajZiTjlWT195cEhUaFhjUUhHV1hWTlRQQzhmN3lRbnlDSHJHSEVjSk9VbEt5MXB2UFFTMF9yaF9XR2Fta1JfTHE5cHpZV3pXMFBXU05aa0NmaWFGVzQ1Mk5Lb1ZfeWgzVkNOcUQ1NkIzS3BB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "ETH Reverts to Inflationary Asset Following Fee-Reducing Dencun Upgrade - CoinDesk",
        "content": "A CryptoQuant report reveals that Dencun has made transaction fees on Ethereum on average four times lower than they were before, but this also means that the amount of ETH getting burned has declined to one of the lowest levels since the Merge and supply is growing at the fastest rate since 2022."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxNdkJtY2NKX2pzaFlkVTh1aGlqY2plcndNbWdjbTVRNkl2WFkyN0MzT3ZxeFdVRU1DXzkxdkxVU0FtSU5LUUhyWHFiZGFsWWpBSFA2MWwtR2JHSU5PdDRvRHdBczRKMXhkOFFQYXQxa0FId3V6WVZiWktkM1p1ZXZmVDliejhmRVNpcVRSRWFOdjFVdDRQYmdyaXNuRnA1ZnR0VFhaYkZ4Ny1JV1hHeUgyZElUSHZFRk4tMXcxeTBfZFpQZW5MNDFGa1FIR0tKdmJsVmNWUklJeGdIVnBxbTJaLXFFelTSAeoBQVVfeXFMTjdxZk9IdElPTl9FaVMwSm1EYW15OTdfaU1NMUJFdGtJMGlZMm5uM0VjX1pXTERrX3NwWnBzMjRvNkcybDZQZEdpeFBEdVoxNHY1WlF0NjIxUnBRVUtvN2lKZmxFY0kwZEdFSjg0Vm1mcWdaNVVNODZmWGZaa2psaGtaX0R3SnVmMWhzN3J4RkpYdTV4d3NBYzNCVm5Eb2xVZHM5ekQ3d0V3RWhJLTRLb2dkeGk2R284YS1JUEYxejRseDVxdVk4OS1JeGRTMXhMTkZmdnU1Q25LNHE0Sjl1TGZpY19RVm0yMkVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Ethereum could experience bullish run, ETH ‘ultrasound’ money narrative at risk - FXStreet",
        "content": "Ethereum’s ‘ultrasound’ money narrative is at risk after the Dencun upgrade, said CryptoQuant.\n\nEthereum's EIP-7702 would address concerns raised about the previous EIP-3074.\n\nEthereum's recent price action suggests it may be gathering momentum for a bullish run.\n\nEthereum (ETH) price action on Wednesday shows it could be gathering momentum for a rally as a recent report from CryptoQuant reveals its ultrasound money narrative is at risk. Also, the number one altcoin's co-founder, Vitalik Buterin, and co-authors have published Ethereum Improvement Proposal (EIP) 7702 as an alternative to EIP-3074.\n\nRead more: Ethereum resume sideways move as Grayscale files to withdraw Ethereum futures ETF application with the SEC\n\nDaily digest market movers: Ultrasound money, EIP-7702, Ethereum Foundation\n\nEthereum is set to see interesting updates on its blockchain following recent developments. Here are key market movers for the top altcoin:\n\nA recent report by CryptoQuant highlights that Ethereum is becoming inflationary following the Dencun upgrade in March. After the Merge that saw Ethereum transitioning from a Proof-of-Work (PoW) to a Proof-of-Stake consensus mechanism, the network began burning gas fees at a significant rate that saw a significant reduction in the growth of ETH's circulating supply.\n\nHowever, since the Dencun upgrade, when the introduction of \"blobs\" reduced Ethereum's network activity to boost its scalability and reduce user fees, the amount of gas fees burned has reduced significantly.\n\n\"Before the Dencun upgrade, the higher network activity on Ethereum meant higher fees burned and hence less ether supply. However, after the Dencun upgrade, the total amount of fees burned has decoupled from the network activity,\" noted CryptoQuant. As a result, this puts ETH's 'ultrasound' money narrative at risk since its circulating supply would begin increasing over time.\n\n\"We conclude that, at the current rate of network activity, Ethereum will not be deflationary again, and the narrative of 'ultrasound' money has probably died or would need much higher network activity to come back to life,\" said CryptoQuant.\n\nFurthermore, following several concerns raised about EIP-3074, which was considered for inclusion in the upcoming Pectra upgrade, Ethereum co-founder Vitalik Buterin and co-authors Sam Wilson, Ansgar Dietrichs and Matt Garnett proposed EIP-7702 as an alternative.\n\n3074 = upgrade for normal \"EOA\" wallets to give some smart wallet functionality\n\n4337 = standard for smart contract wallets\n\n\n\n3074 was slated for inclusion, v likely worried the long term implications of\n\n1) compatibility btwn 3074 and 4337 wallets\n\n2) 3074 breaking in a future… — hayden.eth (@haydenzadams) May 7, 2024\n\nEIP-7702 introduces a new transaction type that would allow externally owned accounts (EOAs) to temporarily act as smart contracts during a transaction. Like EIP-3074, the new proposal would enable better ways to abstract gas fees, batch transactions, and improve the user experience. However, it goes further by improving compatibility with the ERC-4337 standard for smart contract wallets — an issue with EIP-3074 — and being more future-proof.\n\nSome crypto community members have speculated that EIP-7702 would replace EIP-3074 in the upcoming Ethereum Pectra upgrade. One X user commented, \"I think it would probably make more sense to include in Pectra than 3074.\"\n\nFireblocks' VP of Technology Arik Galansky also commented on the proposal saying, \"It's a long while since Ethereum introduced changes that are user-oriented rather than scaling-oriented and this one is right on point.\"\n\nA few weeks ago, EIP-3074 sent the AA world into shambles.\n\n\n\nInitially it looked like it's synergetic with ERC-4337, since they do different things. One enables EOA migration, another enables decentralized mempools.\n\n\n\nHowever, the nitty gritty details looked suboptimal: it's hard… — Ivo e/acc (@Ivshti) May 7, 2024\n\nAlso read: Ethereum traders show uncertainty, SEC delays decision on Invesco's ETH ETF application\n\nMeanwhile, the Ethereum Foundation appeared to be dumping ETH again on Wednesday following a transfer of 1,000 ETH worth $3 million to middle multisig address 0xbc9, according to data from Spot On Chain.\n\nThis transfer is the latest action in a larger trend where the Ethereum Foundation has sold 1,766 ETH for 4.81 million DAI stablecoin at ~$2,725 since the beginning of 2024. The ETH sales, done in small batches through the same middle multisig address 0xbc9, often coincide with brief Ethereum price declines, noted Spot On Chain.\n\nETH technical analysis: Ethereum could be gathering momentum for a bullish run\n\nThe market remained quiet on Wednesday as Ethereum continued trading around the $3,000 mark. Despite the calm market, ETH derivatives volume in May has risen higher — close to 60% — than that of Bitcoin, according to QCP.\n\nRead more: Ethereum could see a brief rally despite Michael Saylor's jab at ETH ETFs\n\nThe reason for the increase may be the market pricing in volatility over the Securities & Exchange Commission's (SEC) upcoming decision on Van Ecks' spot ETH ETF application on May 23, noted QCP. This also explains why the market is slightly tilted toward a downward movement as many expect the SEC to deny spot ETH ETF applications.\n\nWhile current price action indicates ETH may continue a horizontal movement in upcoming weeks, historical data suggests the largest altcoin could be gathering momentum for a bullish run. Considering ETH has remained in the $2,852 to $3,300 range for nearly a month, it could attempt a sustained breakout above the upper level of the range if it sees a slight bullish trigger.\n\nETH/USDT 4-hour chart\n\nOnchain data also shows most whales have been accumulating ETH around this range in anticipation of a price rally. A bearish event could see it break below the lower level of the range briefly, presenting a buying opportunity.\n\nEthereum is trading at $3,013 on Wednesday, May 8, down 0.7% on the day."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE1UckVPQmlCLUpXVHN2VnBjbzI1Rlg3SS1wUUhtRmJXRWM3cV9HSWtPTV95dHFNRFNpUU13c2MtWGpWeFY5WmQxbkNrMmY5dE0xaHNoQUt1c3ZLU1M5TTFqTklkZnB6bzIwNWNFOHo3NVBaXzZh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Shiba Inu Eyes $0.001 Amidst Supply Challenges, Ethereum Targets Uptrend with EIP-7702, Furrever Token Rallies Community with $20,000 Competition - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, May 09, 2024 (GLOBE NEWSWIRE) --\n\n\n\nThe cryptocurrency market continues to offer diverse investment opportunities with unique growth potentials. Shiba Inu (SHIB), Ethereum (ETH), and Furrever Token (FURR) each present distinct scenarios, from SHIB's long-term aspirations to hit a significant price milestone, Ethereum's ongoing technological enhancements amid regulatory scrutiny, to Furrever Token's engaging community-driven initiatives. These developments highlight the varying strategies and market dynamics that investors and enthusiasts can navigate.\n\nShiba Inu's Road to $0.001: A Millionaire Maker for the Patient Investor\n\nShiba Inu (SHIB), the cryptocurrency that captured the hearts of many young investors, continues to hold the community's attention despite its fluctuating market performance. Originating as a favorite among retail investors, SHIB has created significant wealth for its early backers, with some even reaching millionaire status. Although the token is currently far from its all-time high of $0.00008616 achieved in October 2021, the undying optimism among its supporters envisions a milestone price of $0.001 per SHIB.\n\nTo become a millionaire at this ambitious target price, an investor would need to hold approximately one billion SHIB tokens, currently valued at about $23,972. This significant number reflects not only the potential high reward but also the substantial risk associated with such an investment in the volatile crypto market.\n\nPredictions on when SHIB might reach the $0.001 mark vary, with forecasts suggesting a timeline between 2033 and 2040. Such a long horizon necessitates patience and enduring confidence in Shiba Inu’s market strategy and broader adoption. The primary challenge facing SHIB is its massive circulating supply of 589 trillion coins, which poses a substantial barrier to significant price increases. Achieving a price of $0.001 with such a vast number of tokens would result in an unrealistically large market capitalization, not seen in current crypto valuations.\n\nIn response to these challenges, the SHIB development team is actively working on new mechanisms to reduce the token supply dramatically. Rumors suggest that these new initiatives could potentially burn trillions of tokens annually, accelerating SHIB’s journey towards the $0.001 goal if successfully implemented. This strategy not only aims to enhance SHIB’s value but also aligns with the community's long-term vision of reducing supply to create scarcity, thereby driving up the token's price.\n\nStory continues\n\nFor those betting on SHIB, the path to becoming a millionaire is intertwined with the token’s ability to overcome its supply challenges and achieve unprecedented growth in the coming years. This journey requires both a belief in the token’s potential and the fortitude to withstand the ups and downs of the crypto market.\n\n\n\n\n\nEthereum Positioned for Uptrend Amid Regulatory Developments and Technical Enhancements\n\nEthereum, a leading cryptocurrency, is showing potential for growth amidst a flurry of technical and regulatory developments. On a recent trading day, Ethereum's price was slightly down by 0.7%, trading around $3,013. However, signals of an upcoming rally are emerging, driven by significant improvements in its blockchain technology and speculative market movements.\n\nThe new Ethereum Improvement Proposal (EIP) 7702, developed by co-founder Vitalik Buterin and his team, is at the forefront of these developments. This proposal aims to innovate how externally owned accounts (EOAs) operate by allowing them to temporarily take on smart contract functionalities. This change is set to enhance the user experience significantly by simplifying gas fee processes, enabling transaction batching, and ensuring greater compatibility with the ERC-4337 smart contract wallet standard. These updates emphasize a shift toward making user-focused enhancements rather than purely technical scaling solutions, reaffirming Ethereum's commitment to its community of users.\n\nMoreover, the market is on edge as it awaits the U.S. Securities & Exchange Commission's (SEC) upcoming decision regarding the Van Ecks' spot ETH ETF application, expected on May 23. This decision is anticipated to cause volatility, with the community and investors closely watching for any potential impact on Ethereum's market position. Although current sentiments tend towards caution, historical trends and recent significant buying activities by large investors, commonly referred to as 'whales', suggest that Ethereum could be on the cusp of a significant upward movement. Should the market receive even slight bullish signals, Ethereum might break through the upper levels of its current price range, presenting a valuable buying opportunity for long-term investors.\n\nFurrever Token Stimulates Market Activity with $20,000 Competition Following Impressive Presale\n\nFurrever Token (FURR) is gaining notable traction within the cryptocurrency sector by not only achieving over $1.1 million during its presale but also by initiating a lucrative buying competition. The newly announced \"Highest Total Buys Competition\" is set to distribute $20,000 worth of FURR among the top ten participants who invest the highest amounts over the course of the event. This competition is designed to further energize the Furrever community and stimulate market transactions for the FURR token.\n\nKicking off today, the 18-day competition promises generous rewards for the most active buyers. The participant with the highest total purchase will be awarded $5,000 in FURR tokens, with the second and third highest buyers receiving $4,000 and $3,000, respectively. Those who place fourth through tenth will each receive $1,000 in FURR tokens. This strategic move not only encourages community participation but also aims to enhance the liquidity and trading activity of the Furrever Token.\n\nPriced attractively at $0.000648 per token, Furrever Token presents an enticing investment opportunity with potential returns of up to 15X. The vibrant community backing the token is evident in its active Telegram group, which houses over 4,000 members. Here, investors and enthusiasts collaborate and exchange ideas, staying informed about the latest developments and strategic directions of the Furrever Token. This level of engagement and the exciting new competition underline the dynamic and promising future of the Furrever Token in the competitive cryptocurrency market.\n\nFor further information or any assistance regarding Furrever Token, reach out only through the official channel at support@furrevertoken.com to avoid potential scams.\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPdnhGWFFBNnRqTXJNYkFEbWdfbUdLd1NmS3VWaGwwX1YzaGNKNVBNM1E4b0NOREh4N3laNDZGQ3RBeGw4a0ZaRDBXeXphSlJ1WWhmckxuSC1KZUYtY1hjakMyUGgyWU1CTEw1ZUxIak1CWDY4OV9mWFBkMU8wOTlFdW1rMjVwWTczYkpzLVRkVXU2eUVGSUNnU25fbWJDNFFXdFF2LU5NaG1CQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Ethereum transaction fees hit record low as Layer-2 networks siphon activity - CryptoSlate",
        "content": "The average transaction fee on Ethereum has reached record lows as more activity moves to the Layer-2 (L2) networks on the chain.\n\nAccording to Ultrasound.money data, the average gas has dropped to 4.81 Gwei — the lowest level since the network completed the Merge event in 2022.\n\nMarket observers attributed this decline to increasing activity on L2 networks following the completion of the Dencun upgrade. The Dencun upgrade significantly reduced fees for L2 networks, making transacting on the base layer less attractive.\n\nNotably, the blockchain analytical platform IntoTheBlock reported:\n\n“An increasing number of transactions are now being settled on Ethereum Layer 2s. Last month, the three largest L2s hit a record 82% transaction share of all Ethereum transactions.”\n\nFurthermore, the number of transactions on Arbitrum has seen strong growth, reaching over 2 million daily transactions on May 8 — a significant rise from the early March average of 1 million.\n\nL2beats data further indicates that Base and Arbitrum averaged 30 and 20 transactions per second, respectively, while Ethereum managed 13 transactions per second during the same period.\n\nETH turns inflationary\n\nMeanwhile, CryptoQuant analysis revealed that ETH has transitioned to an inflationary state post the Dencun upgrade, resulting in diminished gas fees and reducing its burn rate.\n\nIn light of this development, the firm noted:\n\n“Since The Merge, Ethereum appeared to be on track with its ‘ultra-sound’ money narrative, showing a slight reduction in the total ETH supply. However, the post-Dencun upgrade challenges this by reducing transaction fees and the ETH burn rate, leading to an increase in supply.”\n\nCryptoQuant further elaborated that the Dencun upgrade environment has presented a scenario where maintaining deflation would require a substantial increase in network activity, contrasting the current trend of low gas fees and reduced burn rates.\n\nNotably, UltraSound.Money data shows that the daily amount of ETH burned during the past day was 519 ETH, a record low for the network."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPSEhxemRCdEdTVlk0RWRoa0pDZmFTZnA2SmJ3U0VGVHQ0YWQtS2VzNGRNR19uTEdodzNpSjlVeU94SHdtYkpTeXdsOExPMHdZaTdpNGdDQ2s4eTNHcHZ5Ylc2dWdXdFBLcnVqckZMNkhJSVhWV3lUNGc1cjhGOWNyMVJabm5pQVp2eVhzVDRnd0ExUE1McDlXNkJuQjFfTHpWbUtTRmhXMWpWdEtFbXlVd25QaE9YZ9IBuwFBVV95cUxOeXk5UWpPYUNtVXRpUm5kQURWMURXbUxiN1RFUWNScVRoX0FuVlBwSWwyLXVBRHZQeWZaRVRBTHhZNGxKbjV3bnRnek9lQVhXZ2ZGZTJTX3BFS3lTZldHSHd4MXNLb2ZsQ0NhWEpOUFFUZFBwR3FaVkNQUDhJT1U3TDdsalhac2Z1UVhQd2JYOU00djBaY1hWeENuYWRFNHJWV0JWaGJwRGc3T1BOUmRCbHlSOWg4Vk5obWc4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Here’s Why Ethereum (ETH) Has Been Lagging Behind Bitcoin (BTC), According to Glassnode - The Daily Hodl",
        "content": "Market intelligence firm Glassnode says Ethereum (ETH) has been lagging behind Bitcoin (BTC) for one key reason.\n\nIn a new analysis, Glassnode says that Ethereum has not seen the same level of increased capital from new buyers that Bitcoin has in the current market cycle, which drove the crypto king to new all-time highs (ATHs).\n\nThe analysts say that the approval of spot Bitcoin exchange-traded funds (ETFs) was likely a main driver for the increase in short-term holders who bought BTC in the last 155 days.\n\n“In the run-up to Bitcoin’s all-time high on March 14th, there was a noticeable increase in speculative activity. Specifically, capital accumulation has been observed among short-term holders (STHs), with the USD wealth held within coins moved within the last six months approaching $240 billion, near ATHs. However, this trend has not been mirrored for ETH, which has not yet seen price break above the 2021 ATH.\n\nWhilst Bitcoin’s STH-Realized Cap is nearly on par with the last bull run peak, ETH’s STH-Realized Cap has barely lifted off the lows, suggesting a markedly lackluster inflow of new capital. In many ways, this lack of new capital inflows is a reflection of the underperformance of ETH relative to BTC. This is likely in part due to the attention and access brought about by the spot Bitcoin exchange-traded funds.”\n\nThe Realized Cap metric records the price at which each coin moved and aims to gauge how many holders are in profit or at a loss.\n\nThe analysts suggest ETH could see a large capital inflow if the U.S. Securities and Exchange Commission (SEC) approves spot Ethereum ETF applications later this month.\n\n“The market is still awaiting the SEC’s decision for approval of a suite of ETH ETFs expected towards the end of May.”\n\nBitcoin is trading for $61,454 at time of writing, down more than 2.6% in the last 24 hours. Meanwhile, Ethereum is trading for $2,970 at time of writing, down more than 2.7% on the day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPNUVFSDhNZDB5bVloMXB6eldtSGVyWG9NaXpXaTlGZUxaNDRQU2NOb3h0QmhxYzZaU25zaTlIcVB6Z2Y5dTBGVHlCazdQTHZfNE5XeEQ3Z3VSMnNkbDJmQUlMenBUNWRNQVc1amtaSnVNbEJENUxDVURQclpJS09jSzBvd1otZUxHTlpOaGJfNmVvSGpnc2NualZjUEZ2eXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin has a new proposal to make Ethereum wallets easier to use — but obstacles remain - DLNews",
        "content": "New new proposal from Vitalik Buterin could help speed up Account Abstraction adoption.\n\nAccount Abstraction promises to make Ethereum more intuitive and safer to use.\n\nThe update could come as soon as the fourth quarter of 2024.\n\nDeFi on Ethereum is often clunky and unintuitive, with few safeguards for new entrants.\n\nOne highly anticipated improvement is Account Abstraction — a new way for Ethereum wallets to handle transactions.\n\nStill, there’s a hitch.\n\nAccount Abstraction is incompatible with existing wallets, which is slowing its adoption.\n\nA recent proposal from Ethereum co-founder Vitalik Buterin may change that. Called EIP-7702, the proposal creates a route for existing wallets to use Account Abstraction — which was previously difficult to achieve.\n\n“It’s still a very early proposal, so we need to evaluate all the rough edges,” Ethereum core developer Marius van der Wijden told DL News.\n\nEIP-7702 adds a new transaction type that allows existing wallets to emulate the functions of Account Abstraction wallets, Van der Wijden said.\n\nIf successful, the proposal will unlock new transaction types, prevent users from losing access to their funds through email recovery, and even facilitate new use cases for the top smart contract network.\n\nJoin the community to get our latest stories and updates\n\nVan der Wijden said EIP-7702 will probably be included in Ethereum’s next major upgrade — dubbed Pectra — scheduled for the fourth quarter of 2024.\n\nA step closer to adoption\n\nAccount Abstraction has been around for a while.\n\nIn March 2023, a previous update introduced an Ethereum feature called ERC-4337, which allowed developers to start building Account Abstraction wallets.\n\nA lack of support for Account Abstraction, coupled with no easy way for users to switch over to the new wallet type, has slowed adoption.\n\nAt the same time, another proposal, called EIP-3074, introduced a change that would allow those with non-Account Abstraction wallets to delegate their control to smart contracts, allowing users to access Account Abstraction features.\n\nWhile EIP-3074 could aid Account Abstraction adoption, many developers criticised it because it puts users’ funds at increased risk.\n\nThe answer may be Buterin’s EIP-7702 proposal.\n\nEIP-7702 aligns the two previous routes to Account Abstraction — EIP-3074 and ERC-4337 — into “one unified Account Abstraction roadmap,” Alex Jupiter, a senior product manager at MetaMask, told DL News.\n\nThe result is a streamlined way for existing wallets to use all the features of Account Abstraction without the risks of EIP-3074.\n\nNew transaction types\n\nOn the surface, Account Abstraction wallets function the same as existing wallets. But under the hood, they have the ability to use smart contracts to manage funds, allowing for a host of new features that could help increase DeFi adoption.\n\nThe most obvious improvement is the ability to program transactions, allowing blockchains to replicate services banks and other money-transmitting services offer, such as scheduling payments.\n\nPayments provider Visa has previously highlighted the potential of Account Abstraction for automatic payments.\n\nThe ability to sponsor transactions is another appealing feature that Account Abstraction unlocks. Sponsoring transactions means allowing another party — such as a wallet provider, DeFi protocol, or blockchain — to pay for a user’s transaction fees.\n\nProgramming transactions can also help make using DeFi on Ethereum more intuitive.\n\nCurrently, when users want to swap tokens on a decentralised exchange, or send tokens to a different blockchain via a crypto bridge, they must sign multiple transactions at different stages of the process.\n\nWith Account Abstraction, everything can be bundled into a single transaction, allowing for a smoother experience.\n\nLost your private key? Don’t worry\n\nAccount Abstraction should also make using DeFi safer.\n\nWhen a user creates an Ethereum wallet they receive a private key, usually abstracted to a sequence of words called a recovery phrase.\n\nThis key is the only way a user can access their funds. If the key is lost, stolen, or if a user’s wallet is accidentally uninstalled or the wallet account is deleted, the funds it controls could be lost forever.\n\nWith Account Abstraction, it is possible to implement a recovery process in which a user can designate multiple trusted individuals as recovery agents. This can consist of an email address or other forms of identification, such as Google Authenticator for two-factor authentication.\n\nThe process is similar to creating and securing an account in the web2 world, but it is executed through a decentralised network.\n\nTim Craig is a DeFi Correspondent at DL News. Got a tip? Email him at tim@dlnews.com."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPbVZzS1Zha21DY1RjNC04MTFqckdMR2RuWGRmRXY0WHYtc2dISEhQT2EzZFZrRE13V3RMNWtiWGd1UDVQMi1ydnZjVkktM3pVc3N1WHJHOVBMd0lSNjRQbDBZMDc1dFlXVDAxdkRmZ2NvRFl4T01iVXJPUldpQ1pUQU5wclF6aTNDdFh5Y2F2SFNHT1JPU1U4eFFiZmUyd0U0ZllnTG9zTlg0S3h1djNjcHhaYVZiVVlvbEVGZEFabGtuTDlkeGJqdE1GbU5GMEQ30gHWAUFVX3lxTE1yal90Q241Sm5xTHVlT1dkNzZONWVWa1Flb28yRmplZUZLN0dvTXp2R01XVzZnZGIyenhMZExoc05JR1M5RmVSYnRoRzI0UWw5S1JySF9rZ1hyR0ZwTERlZzhkaVQtSzFVUzRkbHU3MEFpS0JJNWpDbmRkQk1FMFZzaExDVi1KcUFGRjhWSHFkZkg0MWUtSWhFZUNaZU9XLV93R3NqWFJZZ1hpZFk3ak9FSy0yZHE4bzZGb2MzNDZOSjV1Vll3azFvR1h2ek56NERRcHhFY2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Sexual Misconduct Allegations Lead Founder of Ethereum Layer-2 Chain 'Eclipse' to Step Back - CoinDesk",
        "content": "\"I'll be temporarily reducing my role as a public face for Eclipse,\" he wrote. \"The senior leaders at Eclipse are well equipped to take on these responsibilities and this will allow these conversations to unfold and the truth to emerge about these allegations.\""
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQazVWWVdEb3JGenNCN09fdWVKU1JTTU11Vm9heUR4TGxQcmRkVGpoVnJfaUQtOE14ckNwOERTeWFGcFp3T3JpY01wRlA3Ykh5bkNyMTR4Q1RGNFdvNnlxY2xfX2RMeGxUcWxnTUVwV1paZmdZZnFPRUdZZXNrWkxDUnBOdFVUSnZKREZjOFl0TkZuMnNlUU40TDM0bFgwTEtLSC1HVVlsSjU5Qm5RT1FhWmR4ek5lTmwtV3hIdjJTOVQyZFNJc3JZU2lzQkpMOVJaeldvNkR4a9IB3AFBVV95cUxQSHBqN2lTRlEySlVmdEUyTWhpLUhFSmE0Z1lyQ3BuNUpCM01DbHVYVVg2RHc4OWRjT3Y4a3l1SzZINW9oY0tzdUhVU1c0LWFpUjFuZHUzRWpUR0g3V3ZORmNwMHRDM042VGw2S0FRalg0ZVBOMTBSYlZOdGo2S2xPaE9PYXRNcXU2VlY4MlJ4UWVmS3MxX1BkLUpxLVY2TnVySUlEb2ZQLVg4eHJJTE1YckwxdDQwR25TMlJQMGw5djdZS3Vyc3M4Vk94Uk1neENRdWwxVi1VaHB2bERX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Analyst Benjamin Cowen Warns Ethereum ‘Still Facing Headwinds,’ Says ETH Will Only Go Up if Bitcoin Does This - The Daily Hodl",
        "content": "The widely followed analyst Benjamin Cowen is saying that Ethereum (ETH) is at risk of facing more downside over the coming months.\n\nIn a new video, Cowen tells his 801,000 YouTube subscribers that monetary policy is likely to negatively affect Ethereum.\n\n“I think that ETH/USD is still facing some headwinds here, especially following the potential rejection of the spot exchange-traded fund (ETF)…\n\n…I think the impact that people are going to feel is just from tighter monetary policy. They’re going to blame it on the spot ETF and they’re going to capitulate potentially into that.”\n\nAccording to Cowen, the Ethereum could go up on one condition.\n\n“If ETH goes up from here, it would only be due to Bitcoin going up a lot more.”\n\nThe widely followed analyst says that the Ethereum/Bitcoin (ETH/BTC) pair, on the other hand, is likely to keep falling under most circumstances based on history.\n\n“So if Ethereum goes up, Ethereum/Bitcoin is probably going to keep going down. If Bitcoin goes sideways, Ethereum/Bitcoin is going to keep going down in my opinion. And if Bitcoin goes down, Ethereum/Bitcoin probably goes down because Bitcoin has been doing all s of things since 2022 began. In eight of 10 quarters, Ethereum/Bitcoin has gone down whether Bitcoin went up, down or sideways. Ethereum/Bitcoin generally went down.”\n\nETH is trading at $3,002 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPOTQ0MWdZUEM5a0I3NGZ5SDFnWV90MlM4TlpyVm5hX2YwVGNfRndXS0wwUHpPV1BzRGxrSWxrbS13R1c5aFZqNm1rRU03OTBobkdsektiNmlVd1c3aS10MkNYSVA5RTdvUGRBU2RqdS1pTUhYYkhlRTV4SVFWSktUWDZ0Z3pETzZrVFp2T3R0ZktsYkpSWHNDMzBB0gGfAUFVX3lxTE1jekRXY0VkRENPZnZLbEY1enVqZGU2dGhYRGg1dTI2UHFCdF9ibjNtSXJGRUZjUi1MU0ZkcWxpeDhpbVdaMW5wRDN6RVRFVENVNjBaQmc1NTltV25aZHMtUEJ5WWJYaXNFbTMxZ3V2Z09YWXZHYUh6c0o1aTVOdmcyMnN4NjA4cFF1dVp3RndIZmYwdmFLV2pWUFlNUDEzNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "This is Why Ethereum is No Longer a Deflationary Network: CryptoQuant - CryptoPotato",
        "content": "Over the years, analysts and developers have touted Ethereum as a deflationary network, presenting the blockchain as ultrasound, aligning with Bitcoin’s sound money principle. However, that seems to have changed with the network’s latest upgrade.\n\nCryptoQuant analysts revealed in the firm’s latest weekly report that Ethereum ceased to be a deflationary network after the Dencun upgrade, implemented in March, which reduced the blockchain’s transaction fees by a substantial amount.\n\nThe Ultrasound Money Narrative\n\nEthereum’s ultrasound money narrative refers to the network as a system that maintains its purchasing power over time and stays resistant to inflation. Compared to Bitcoin, the term suggests that Ethereum has the potential to remain more sound by not just preserving purchasing power but reducing the supply of the network’s token, ether (ETH), over time.\n\nIn the nine years of its existence, Ethereum has implemented several upgrades to sustain the decrease in its inflationary rate or the issuance of new ETH.\n\nThe London upgrade, implemented in August 2021, introduced a mechanism that burned a portion of Ethereum’s gas fees, removing ETH from circulation with every transaction. The upgrade exerted deflationary pressure on ETH supply, making it more valuable and scarce over time.\n\nIn September 2022, developers implemented the Merge, transitioning Ethereum from a proof-of-work to a proof-of-stake network. The blockchain stopped issuing new ETH as block rewards to miners, drastically reducing the issuance and inflation rate of the crypto asset.\n\nThese two upgrades had deflationary effects on Ethereum until Dencun came along.\n\nEthereum is No Longer Deflationary\n\nDencun reduced transaction fees on Ethereum layer-2 chains and introduced danksharding, which allows the storage of additional data in blobs, making the network more efficient and less expensive.\n\nBefore the Dencun upgrade, the amount of fees burned on Ethereum was positively correlated with higher network activity; ETH supply was reduced faster, and more fees were burned due to higher network activity. However, the reduction of network fees has slashed the amount of ETH burned despite high activity.\n\nThe new supply of ETH has become positive again, increasing to its highest daily rate since the Merge, while the amount of fees burned has plummeted significantly. Hence, Ethereum is no longer deflationary.\n\n“We conclude that, at the current rate of network activity, Ethereum will not be deflationary again, the narrative of ‘Ultra sound’ money has probably died or would need much more higher network activity to come back to life,” CryptoQuant stated."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNTjByQnZtTzRiaE1sNGF4c2Z2clI3cmp2bHpxV0oxc0VJVkd3Tmlub1JFVHF3Z0plNkVuOUl2bV85dWtxTGJSMnNnMTVTS0NNeU1EX3pYVFd6Rlp3ZmhMbXhkUkpBYnlvX2dteXpPUWdYN0FqVXVsT05oTXluY3gzWnpHSWxzbV9WX1dzNTVjMHFpWVpF0gGcAUFVX3lxTE96NWFWTWdRamZDaVFETjZYcW9WcDhpMnFzU2k3V0NNWHVhS2ltNXlaM2MzUS1hb1VuSTNROG44QWE1TS14ODNuS1JNREh4aTdNcndJSklLUHJXYWkyNGpwdzdPb3E5UXhvLVQxTkkycWpsdWYtcU1NaVEwTUtwZzR3ck0zUVhKbU1aZ0RKd1pLdmZwVFNSTXJVMC1kbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Tank as Crypto Liquidations Top $150 Million - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe prices of Bitcoin and Ethereum both plunged Friday morning, prompting a fresh wave of long position liquidations that pushed total crypto liquidations above $150 million over the past 24 hours, per CoinGlass.\n\nBitcoin dropped by more than $2,000 in an hour, falling from a price above $63,000 to a daily low of $60,890, according to CoinGecko. It has since rebounded slightly to $61,130 as of this writing, and is down more than 1% on the day.\n\nMeanwhile, Ethereum is down by 2% over the last day, falling from $3,027 to a low of $2,927 alongside Bitcoin's plunge. It's up slightly since to $2,940, but still is down lower than it's been since May 1.\n\nIt's not immediately clear what prompted the price drops for the leading cryptocurrencies. Many other top coins have similarly lost ground this morning, including Solana, which fell back below the $150 mark after reclaiming that price earlier Friday.\n\nAD\n\nAD\n\nMore than $62 million worth of long positions were liquidated over the last hour alone. Over the last day, the total of long and short liquidations was just over $150 million across all major cryptocurrencies. Long positions are bets that the price of the coin in question will increase, while short positions bet against gains.\n\nEditor's note: This story was updated after publication with additional detail.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNWGM2Q1NpQnAtVEk4Qk1lWDdjOVNYbmJORDZvVkZid25UYXVOenhVRkUzcEFtVGxNZy1oVnowdGYyOUdTQ0dZXzhPNFlqNkRFaE02NzdLQTdmbGRTMTRIZkVJOE1HT19fS21Da1lXZVdaY1BhQm1sYWhIU3RzWjVleGt6bWRFU05MbGNCR3FpOW1qUl92VVJTdUtSRTlVaU9HUzk2ZkZQVmQtT1pieUNaeHZ2WWhXdktORTdGMDFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Post-Merge Acceleration: growth of Ethereum supply and impacts of the Dencun update - The Cryptonomist",
        "content": "In the rapidly evolving landscape of cryptocurrencies, Ethereum has taken a significant turn with the growth of its supply reaching the fastest daily rate since the historic transition known as the Merge.\n\nThis acceleration in the growth of supply has been triggered by a significant decrease in the amount of transaction fees burned, a change attributable to the recent Dencun update.\n\nThe Merge and Dencun increase the supply of Ethereum\n\nThe Merge, which took place in September 2022, was a monumental change for Ethereum, transitioning from proof of work (PoW) to proof of stake (PoS).\n\nThis transition not only marked a significant reduction in the network’s energy consumption of over 99%, but also introduced a new mechanism for managing transaction fees and creating new ETH.\n\nWith PoS, the concept of “burning” transaction fees was intended to make Ethereum potentially deflationary, depending on the network’s activity levels.\n\nThe Dencun update, recently implemented, has introduced further adjustments to the Ethereum fee market. This update has inadvertently led to a drastic reduction in the number of transaction fees burned.\n\nInitially, the combustion mechanism was designed to offset the emission of new ETH, thus controlling inflation and, in some cases, aiming to reduce the total supply when more fees were burned than issued.\n\nHowever, after Dencun, the dynamics have changed. The decrease in the burning of fees has led to a net increase in the circulating supply of Ethereum.\n\nThis has sparked debates and discussions within the community and among investors regarding the potential implications for the value of Ethereum and its economic model.\n\nThe mechanics behind the burning of fees involves a system called EIP-1559, implemented in 2021, which introduced a base fee for transactions that is burned, along with a tip to miners, now validators, to prioritize transactions.\n\nThe Dencun update has changed these mechanisms, influencing the way commissions are calculated and thus reducing the overall amount burned.\n\nEconomic implications\n\nThe rationale behind reducing transaction fees is multifaceted. Part of the motivation is to lower transaction costs for users and make the network more attractive and competitive, especially against emerging rivals that offer cheaper and faster transactions. This is crucial in a blockchain ecosystem that is becoming increasingly crowded and competitive.\n\nFrom an economic point of view, the increased rate of ETH supply could have mixed implications. On one hand, if the supply grows too rapidly, it could exert downward pressure on the price of ETH, especially if demand does not keep pace.\n\nOn the other hand, lower transaction fees could lead to increased network usage, potentially increasing demand and offsetting some of the inflationary pressures.\n\nThe market’s response to these changes has been cautiously optimistic. While some investors are concerned about the potential for increased inflation, others are encouraged by the increase in network activity and cost reduction. The full impact of these changes will unfold in the coming months as users and investors adjust to the new fee dynamics.\n\nLooking ahead, the main developers of Ethereum are constantly working on further updates and improvements. The goal remains to improve scalability, security, and sustainability, which are crucial to maintain Ethereum’s position as a leader in the blockchain space.\n\nIn conclusion, while the increase in Ethereum supply after Dencun presents new challenges, it also reflects the dynamic nature of the network and its ability to adapt to changing market conditions.\n\nHow this will affect Ethereum’s market position remains to be seen, but what is clear is that Ethereum continues to be at the forefront of blockchain innovation and evolution."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE83QjhuZGJyTUlSeEZvSjYxTVFRdm9Ybm51dnZwOHNrc0hPVGJPbkx6YzZkVy1ueE8tdDlJVXYxWEdMLU5TWmE2OXBMQU5DMGF1bFg2NjJEWnZkcWlaRDNxU0tsRlNPSmstMlZETXBn0gFzQVVfeXFMT3ZMNExFbWpXakdEVUlWck1GY3g2ZnBxWnpXQkl6LXBOZEhRYUVZdnZuUE1IQkVMclVTZEM0LW9qYWJud0Zua09ZTk9IeTVKcDlMWWwyMHRNMVVzeXhlRVhlVDlyLU9BZEh2VTg4a1BsUHFlYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "This Bull Run Might Skip Ethereum (ETH): Opinion - U.Today",
        "content": "Advertisement\n\nIn an acerbic X post, Ethereum (ETH) veteran, prominent investor, podcaster and crypto educator Ryan Sean Adams describes two alternative midterm forecasts for Ether (ETH) as a crypto coin.\n\nBearish: Inevitable puberty of Ethereum (ETH)\n\nIn a 2024-2025 potential rally, Ethereum (ETH) might be overlooked by investors as it is going through the \"awkward\" phase of \"puberty.\" It looks too slow and expensive compared to its own second-layer solutions of various types, Adams admits.\n\nWhile L2s are necessary for the scaling of such a blockchain and reflect the founder's vision of its progress, it has nothing to do with the interests of its most obvious investors.\n\nAdvertisement\n\nMeme coin champions and dApps users (including retroactive airdrop farmers) are too focused on alternative L2/L3 blockchains, while institutional \"big money\" is on its way to Bitcoin (BTC).\n\nThe approval of Spot Ether ETFs in the U.S. might change the status quo but, as U.Today previously reported, analysts are skeptical of the possibility of this step in the coming months.\n\nAs such, Ethereum (ETH) is getting through the challenges of its \"puberty\" while \"toddler chains\" are looking for shortcuts and, therefore, might look more attractive in the midterm.\n\nBullish: Rock solid monetary economics for \"chain of 1000 chains\"\n\nAt the same time, the arguments of Ethereum (ETH) optimists also look strong as of Q2, 2024. Ethereum (ETH) meets this cycle stronger than in 2020 with viable overhyped L2s and zkEVMs driving innovations and attracting value.\n\nWith its \"rock solid monetary economics\" cemented by ERC 4337 implementation, it remains the only profitable blockchain, and its competitors are not even close to this status.\n\nAlso, despite the growing audience of alternative blockchains, Ethereum (ETH) mainnet remains the root chain for 1,000 blockchains, Adams says.\n\nThese two theses are just \"two perspectives for ETH bulls,\" the author concludes.\n\nEther (ETH) is changing hands at $2,925, being 3% down in the last 24 hours."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNRzhHMVQwY0c4RWJZcHlrdFRqbXExLWgyZkp3b1A3RmZUbEpBcWlLbG9Zck1YRnpXSHNBazZMU2RFcmpGZ19VcGVmd3FuQkZFQ1BBRG5fanZOanlpS1JFTGtJZFIxY0FJblJNbkpReURJSFN5N0pwOEVuUVlpeGNyYmJmUGlMZ2pLWXQ5RTJjckZ4Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Solana could surpass Ethereum in transaction fees - The Cryptonomist",
        "content": "In a turn that could rewrite the current dynamics of the world of cryptocurrencies, Solana seems poised to surpass Ethereum in terms of transaction fees within the next week.\n\nThis event, if it were to occur, would not only strengthen Solana’s positioning in the sector, but could also further solidify its label as an “Ethereum-killer”, despite the technical challenges and network interruptions it has recently faced.\n\nCurrent context between Ethereum and Solana for transaction fees\n\nEthereum, long considered the undisputed leader in decentralized applications and decentralized finance (DeFi), is known for its high transaction fees, especially during network usage peaks.\n\nThis has led many developers and users to seek cheaper and more efficient alternatives, a niche in which Solana has begun to stand out thanks to its promise of speed and significantly lower transaction costs.\n\nSolana has made its way in the field of blockchain with the promise of processing up to 65,000 transactions per second, compared to a capacity of Ethereum which currently revolves around 30 transactions per second.\n\nThis performance is supported by a unique consensus model, known as Proof of History (PoH), which works in tandem with the Proof of Stake (PoS) mechanism to optimize efficiency and reduce costs.\n\nDespite these advanced technical features, Solana has faced numerous network interruptions, raising doubts about its long-term reliability and scalability.\n\nThese technical issues have temporarily hindered its growth and have shaken the confidence of some investors and users. However, recent improvements and updates to the network aim to solve these problems, restoring confidence in the platform.\n\nImpact of reduced transaction fees\n\nIf Solana were to surpass Ethereum in terms of transaction fees, it could attract a significantly larger number of developers and projects.\n\nThis shift would not only increase the volume of transactions on the Solana network, but could also positively influence the value of its native token, SOL.\n\nFurthermore, a reduction in fees could further democratize access to DeFi applications, making them available to a wider audience that may currently be discouraged by high fees on Ethereum.\n\nSurpassing Ethereum will not be an easy task for Solana, given Ethereum’s vast user base and its extremely active developer community.\n\nFurthermore, the upcoming update of Ethereum, known as Ethereum 2.0, aims to solve many of its current issues related to scalability and transaction costs.\n\nHowever, temporary success in terms of lower transaction fees could give Solana the necessary advantage to solidify its position as a credible alternative to Ethereum in the long term.\n\nConclusion\n\nIn conclusion, Solana’s potential superiority over Ethereum in terms of transaction fees represents a significant turning point. If Solana manages to maintain lower transaction costs, it could not only attract a new wave of developers and users, but also consolidate its position as a valid alternative to Ethereum.\n\nThis evolution highlights the continuous innovation in the field of blockchain and the need for existing platforms to adapt in order to remain competitive. However, the success of Solana will depend on its ability to overcome past technical challenges and build a stable and secure network.\n\nIn a market that rewards both innovation and technical robustness, Solana has the opportunity to redefine the cryptocurrency landscape and demonstrate its value as a potential “Ethereum-killer” in the long term."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPbGVyU19sTWV0X0hMUGhHZkY0Unc0bUhVNDBtZnFMWWpkRHdkamtZdXRWSExZb0hZLWdKUUh2LWxia05jYWRwdm5tUHVGTWtVTVZfckF1emdZRWFJMDQyT0pFSjZKSFdNWGZzc2lEcTgwb05kQUtxUmJUTC1QSU9vaTIwTUFyUEx2Sl9OYWxrYUJZVW9feHBCYkE1QmNmMzdaT2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Franklin Templeton expects this network to ‘remain a leader’ on Ethereum - DLNews",
        "content": "Franklin Templeton expects Base to capture a large share of the Ethereum layer 2 market.\n\nBase is a major draw for memecoins and SocialFi projects.\n\nUSDC is the major stablecoin on Base.\n\nOnly Arbitrum at $2.6 billion has a great amount of deposits than Base’s $1.6 billion among all Ethereum layer 2 networks, DefiLlama data shows, and in a note published Thursday, Franklin Templeton said it expects Base to “remain a leader.”\n\nBase is an Ethereum layer 2 blockchain that was started by crypto exchange Coinbase.\n\nFranklin Templeton, a $1.5 trillion asset manager, pointed to “strong support” from Coinbase as a major positive for Base.\n\nBase’s recent growth has been propelled by memecoin trading and interest in so-called SocialFi projects, Franklin Templeton said.\n\n“In recent months, Base has seen a significant rise in activity, primarily driven by Base meme coins trading activity and SocialFi applications such as friend.tech,” the firm’s note stated.\n\nBase’s buzzing activity levels have prompted an increase in transaction fees for Sequencer ― the part of Base’s network responsible for organising, verifying, and transferring transaction bundles to the Ethereum network.\n\nLike other Ethereum layer 2 networks, Base hasn’t “decentralised” its Sequencer yet. All of its revenue now goes to Coinbase, the entity responsible for running the Sequencer.\n\nThe bulk of the spike in activity on Base came in March when memecoin trading reached a fever pitch. Some popular tokens included TOSHI and BRETT, with BRETT reaching a peak of $800 million in market value.\n\nJoin the community to get our latest stories and updates\n\nThe memecoin trading came in the aftermath of Ethereum’s Dencun upgrade that lowered transaction fees on layer 2 networks by as much as 98%.\n\nFranklin Templeton’s report also said that “Base has hit a home run” in the SocialFi niche.\n\n“Currently, Base has [about] 46% for all transactions related to SocialFi,” the report said. “This category is a key vertical for Base adoption and growth.”\n\nBefore memecoins exploded on Base this year, friend.tech, a popular SocialFi project, was the major draw in 2023 for activity on the network.\n\nBase’s growing user adoption has also meant a big increase in stablecoin volume on the network. The market cap for stablecoins on Base has reached $2.8 billion, according to DefiLlama.\n\nCircle’s USDC stablecoin accounts for the bulk of the volume. That’s not common in DeFi where Tether’s USDT is the dominant stablecoin on most blockchains.\n\nCoinbase’s support for free USDC transfers to the Base chain via the exchange’s wallet since December 2023 is a likely reason for the stablecoin’s popularity on the network.\n\nCrypto market movers\n\nBitcoin is down 2.31% in the last 24 hours\n\nEthereum has fallen below $3,000 again, down 3.1% today.\n\nWhat we’re reading\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQOXJ0cGZBSnozTkZaWmU3Y0dzaVdUb1Z4ZjQteDdMbjRqSnVJMm5GbGRtRnlheS1DWXVaNDZHM3AtMnlVcGdyZWF2bk9Vb0VfSDBmb1Y4UjVxTkt2YldTa0VlRWEtMGF0dThMU0c4THBJaUFlTnhtckZXU3dONlFXSHVWbzd0R0JfYnVOStIBlAFBVV95cUxNN3BraHhyLXFvUHQzTjZBT3ROSmxPdENiNllXNHRvVk5OUmNvcW1FeHltWHFzQmlXNHhjNHV5Ym5YaDZFXzBPOXJtZTUtaEhfWFJzV1VfRlVOSG9wc3ZZSVJSSVFzdzMxLXoxUU5mRldCS0JOc0xiM1JWZklnNy01TnBrZU4zR1ZrSTJQcVBFNTVZdTFl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Ethereum Co-Founder Joe Lubin: SEC Wants to Create 'FUD', Push Crypto Offshore - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum co-founder Joe Lubin has argued that the U.S. Securities and Exchange Commission's recent series of enforcement actions directed at crypto firms is \"intended to create FUD\"—that is, \"fear, uncertainty, and doubt\"—in the industry.\n\nSpeaking at the Financial Times Crypto and Digital Assets Summit, Lubin, whose firm Consensys recently revealed that it was sent a Wells Notice by the regulator, called its action \"an attempt to paralyze us, or have us move off-shore.\"\n\nThe regulator had, Lubin claimed, reclassified Ethereum as a security, \"without really telling anybody that that's the case.\" He added that Consensys' filing of a preemptive suit against the SEC is \"about getting clarity from U.S. courts,\" to establish that Ethereum is a commodity, \"as many in the SEC and the CFTC have been stating for years.\"\n\nOver the past year, the SEC has launched a series of enforcement actions targeting crypto firms including Coinbase and Binance. The regulator has also sent Wells Notices warning of impending enforcement action to firms including Consensys (disclosure: which is one of 22 investors in Decrypt), Robinhood and Uniswap Labs.\n\nAD\n\nAD\n\nAs part of those actions, Lubin said, the SEC has claimed that crypto wallets such as MetaMask are acting like broker dealers, which he called \"a preposterous notion,\" questioning whether Consensys or individual users should register the \"piece of software that anybody can download and run on their own\" as such.\n\nThe regulator had also made what Lubin called the \"bizarre\" claim that Consensys is helping firms such as Lido and Rocket Pool issue securities by providing \"access to some decentralized finance protocols on Ethereum.\"\n\nLubin added that the SEC is currently inspecting the GitHubs of software developers who are \"building out the deeper layers of the protocol,\" rather than being engaged in financial matters—an action he called \"chilling for software developers.\"\n\nThe SEC and Ethereum ETFs\n\nHe also pointed to the \"interesting\" timing of the SEC's actions, ahead of the regulator's May 23 deadline for approving or denying applications for a U.S. spot Ethereum ETF. Lubin suggested that the regulator was engaging in a \"flurry of activity designed to enable them to say that their action wasn't capricious,\" in the \"likely event\" that it denies the approval of spot Ethereum ETFs.\n\nAD\n\nAD\n\nThe Consensys founder argued that the SEC \"probably doesn't want to see a wave of innovation\" in the financial landscape resulting from the approval of spot Ethereum ETFs, and the prospect that \"many of the banking industry's customers will move their assets into digital form\" and DeFi applications.\n\n\"That'll be really uncomfortable for certain factions in the U.S. who would prefer to slow it down or shut it down,\" he said.\n\nNevertheless, Lubin remained optimistic at the prospects of a spot Ethereum ETF eventually being approved, pointing to an \"inflection point\" in 2025, \"when the courts force the SEC to approve the spot ETFs.\"\n\nEdited by Andrew Hayward"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNQndLcHFFZEViUHJhOUNWN2hDV2duRmhnVm1kYjFTaUJfcU5pcVJCaGN2Wk1NRlFXY2tzcXI4S0hCUnJSaF81eE9jQ1RBVXJuRGdnVHhoLTRXZnJMTkowOTNhbzRhRkNfWUQ3X3lpTkdITmZINHNBdmtPR0RmQXpwS0ljajloYVZZbEFMZzg4LXczTnZRTEVFbjU3eTdtcEY1U0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Falls Below $3,000 Support Level – Will It Recover Soon? - The Tech Report",
        "content": "Why Trust Tech Report Tech Report is one of the oldest hardware, news, and tech review sites on the internet. We write helpful technology guides, unbiased product reviews, and report on the latest tech and crypto news. We maintain editorial independence and consider content quality and factual accuracy to be non-negotiable.\n\nThe broader crypto market has been on a steady downward trend since May 6, with the price of most assets dropping significantly. Ethereum fell from a high of $3217 to $2936 on May 8, 2024, marking an 8% price decline.\n\nEthereum is hovering around $2,984, down by 1% in the last 24 hours, its trading volume is $10.9 billion.\n\nThe prevailing downtrend has cast doubts and uncertainty about Ethereum’s trajectory in the coming days. Will the bulls return to trigger a rebound? Read on to find out.\n\nEthereum Price Analysis: Bearish Momentum Strengthens, Investors Urged to Exercise Caution\n\nEthereum is currently in a bearish trend, with several technical indicators signaling further downward pressure.\n\nEther has slipped to the lower band of the Bollinger Bands indicator, suggesting oversold conditions and further price declines. This could deter investors and traders from buying in until clearer signals emerge.\n\nThe Moving Average Convergence Divergence (MACD) is below the signal line, indicating a bearish trend continuation. This reinforces Ethereum’s negative sentiment and may prompt cautious behavior among investors.\n\nFurthermore, the SuperTrend indicator displays a sell signal, indicating that sellers are in control and may remain so in the near term.\n\nThe Relative Strength Index (RSI) is 38, signaling that Ethereum is currently oversold. However, this does not necessarily indicate an immediate reversal in price, and investors should exercise caution when considering entry points.\n\nOverall, Ethereum’s technical indicators paint a highly bearish picture, with multiple signals pointing to further downside potential.\n\nInvestors looking to enter the market may wait for the price to break above the previous $3,059 support level, which has now become a resistance. A break above this level will confirm a strong bullish momentum.\n\nHowever, given the unpredictable nature of the crypto market, traders should trade with caution and implement risk management strategies to protect their investments.\n\nGrayscale’s Withdraw ETF Fillings: What It Means for Ethereum Investors?\n\nGrayscale, a major crypto asset manager, has pulled back its filing for an Ethereum futures exchange-traded fund (ETF). These moves surprised analysts like James Seyffart, who called it a “Trojan horse” tactic.\n\nUPDATE This is interesting. @Grayscale just withdrew their 19b-4 filing for an #Ethereum futures ETF. This was essentially a trojan horse filing in my view, in order to create the same circumstances that allowed Grayscale to win the $GBTC lawsuit (approve futures deny spot) pic.twitter.com/Kihj2dlQx1 — James Seyffart (@JSeyff) May 7, 2024\n\nIn the analyst’s words: “In my mind, might as well make the SEC write up an approval or denial for an ETH futures ETF and go from there?” He suggests a discussion between the SEC and Grayscale must have prompted the withdrawal.\n\nNate Geraci, another analyst, said last month that there’s a possibility that the SEC will not approve the ETH ETF. He predicted that if the SEC rejects Grayscale’s Ethereum ETF application, they might take legal action again.\n\nHowever, in a recent X thread, Bloomberg’s senior ETF analyst, Eric Balchunas, sees this withdrawal as a positive sign. He thinks Grayscale might not sue the SEC again.\n\nGrayscale’s latest move could positively affect Ethereum’s price, as it shows its commitment to working with regulators rather than engaging in legal battles.\n\nWhile the price of Ethereum is still down, investors might want to consider this low-cap project, which is trending in the market.\n\nDogeverse ($DOGEVERSE) At Over $13 Million – Ape In Early For Massive Gains\n\nThe Doge-inspired meme coin, Dogeverse, has seen remarkable success since its inception, echoing the enthusiasm once ignited by Dogecoin. Dogeverse aims to unite the crypto meme community and pioneer multichain utility development.\n\nFrom its presale phase, Dogeverse quickly captivated the attention of the meme coin industry, garnering significant interest with its reasonable pricing point. The presale has raised over $13 million and is rapidly winding down as May progresses, reflecting the project’s appeal among investors.\n\nThe presale’s concluding discount price of $0.00031 shows that the project is affordable. Interestingly, this low rate could attract even more investors in its final stages.\n\nWhy DOGEVERSE Looks Promising to Investors and Enthusiasts\n\nDogeverse stands at the forefront of the cryptocurrency market, poised to revolutionize the meme coin landscape with its multichain capabilities. Its allure lies in the adoption of multichain technology facilitated by Wormhole and Portal Bridge technologies.\n\nBy transcending the limitations of a single blockchain, Dogeverse offers unparalleled speed and convenience. The project also empowers users to navigate across chains seamlessly. This strategic move not only enhances user experience but also expands Dogeverse’s potential user base exponentially.\n\nThe decision to commence on Ethereum is a solid foundation for the project’s multichain growth strategy. Ethereum’s widespread adoption and robust security features make it the ideal platform for such an ambitious endeavor.\n\nRaising over $13 million in a matter of weeks, it has captured the attention of both seasoned investors and newcomers. This remarkable achievement attests to the widespread anticipation surrounding Dogeverse.\n\nMoreover, as the Bitcoin Halving concludes, meme coins are poised for exponential growth, making Dogeverse’s arrival timely and strategic.\n\nBy integrating features from top-performing meme coins across various chains, such as DEGEN and BRETT, Dogeverse ensures its relevance and competitiveness in a rapidly evolving market landscape.\n\nSecure a Spot – Buy Dogeverse Today\n\nVisit the website and connect your preferred wallet using the options provided. Choose the network you want to participate in the presale on – options include Ethereum, Solana, BNB Chain, Polygon, Avalanche, or Base. Type the amount of ETH, SOL, BNB, MATIC, AVAX, USDT, or USDC you want to exchange for $DOGEVERSE. After the presale ends, use the same wallet and network you used to buy to claim your $DOGEVERSE tokens\n\nDisclaimer: The opinions expressed in this article do not constitute financial advice. We encourage readers to conduct their own research and determine their own risk tolerance before making any financial decisions. Cryptocurrency is a highly volatile, high-risk asset class.\n\n🔎Looking for the next 10X crypto?\n\nCheck out the best crypto presales to invest now"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE9rbE9tZTlwZ014c2tCY3c2Sk5VanBTY2lCQWFpaUZqWWNUV0haUjhJV3VuRkpMeU9zcUlyX3ZKLWxEUGJiaU03Yml6WVItNUduc0M2TkF0RDc1eGFreGNIXzlxbjAycDhlXzVoTFlwTdIBd0FVX3lxTE5MQU9aUmJQRktSZG1yMFNGOG1sNjV6MUtBY0dHdFJ3ZXJEZkJsWkNMc1pESGhDYzgwV3lad3R6bE0wZlFYTXBGNHZrOHJ6b3hHdjVoT1dkaXdRbXdhekw0VUNQeWNsRFRZMmN2NmEycXNZUDIwOWIw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Will Vitalik Buterin’s Gas Fee Proposal Make Ethereum More Like Solana? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum could use a much better system for charging transaction fees from its users, the network's chief architect Vitalik Buterin argued in a widely circulated essay published Thursday.\n\nButerin's post, which laid out a path toward a more customized and equitable system, immediately garnered reactions from two principal groups: Ethereum users, who expressed their excitement at the prospect of lower fees on the network’s costly mainnet; and Solana users and developers, who noticed that Buterin's proposal sounded an awful lot like the Solana network's own fee model.\n\n“It’s certainly a Solana-esque approach,” Mert Mumtaz, a prominent Solana builder and the co-founder and CEO of infrastructure startup Helius Labs, told Decrypt.\n\nSo just how similar is Buterin’s “multidimensional gas fees” proposal to Solana's \"local fee markets\"?\n\nAD\n\nAD\n\nGas fees refer to the transaction costs that blockchain users pay to the network. This system is in many ways what gives tokens like Ethereum (ETH) and Solana (SOL) their value. You need ETH to pay gas if you want to do just about anything on the Ethereum network, just like you need SOL to do things on Solana. When there's a lot of activity on the network, gas fees go up. And when there's less activity, gas fees go down.\n\nIn some ways, Solana's current gas fee structure and Vitalik's “multidimensional gas fees” proposal stem from the same philosophy: In the name of fairness, different types of on-chain transactions should cost different amounts, depending on demand. But in practice, leaders of both networks appear to have different ideas about how to implement such a philosophy—leading to a potentially significant difference in user experience.\n\nSolana currently operates on a “local fee markets” structure, wherein gas fees are calculated on a per-account basis, project by project. In this system, spikes in gas fees due to network congestion are effectively quarantined to specific projects.\n\nAD\n\nAD\n\nFor example, a spike in gas fees induced by a hot Solana NFT mint should only impact users who are interacting with that project—users elsewhere across the entire Solana network should be unaffected. (There is currently some disagreement within the Solana community about whether local fee markets actually work as effectively as intended, in part due to the hyper-congestion that can occur in crowded mini-gas ecosystems.)\n\nBut Solana’s setup makes a clear contrast to Ethereum—where demand for wildly popular NFTs has previously clogged the entire network, sending gas fees skyrocketing for everyone.\n\nEthereum is in its Solana era https://t.co/hGfLU3zqPP — Alex Kroeger (@alex_kroeger) May 9, 2024\n\ndid he just copy this off solana — willo (@willo_0x) May 9, 2024\n\nEthereum 🤝 Solana — Sam Ragsdale (@samrags_) May 9, 2024\n\nThe “multidimensional gas fees” concept proposed by Vitalik Buterin does seek to make Ethereum transaction costs more equitable. But it doesn't appear to outline a boutique system like Solana’s, in which every individual project on Ethereum would become its own siloed gas ecosystem.\n\nInstead, multidimensional gas on Ethereum would only distinguish between different macro categories of effort required to complete network transactions, Ethereum core developer Marius Van Der Wijden told Decrypt. For example, computation, storage, and calldata might fetch different premiums at a given moment, depending on demand. Different on-chain transactions consist of different ratios of those categories of computing.\n\nPer Buterin, Ethereum’s Dencun upgrade, which went live in March, constituted the debut of such a system by sending layer-2 data, the sort that comes from layer-2 networks like Arbitrum, to “blobs.” Blobs feature different prices and different limits than the rest of an Ethereum block.\n\nAD\n\nAD\n\nAt a macro level, expanding multidimensional gas to differentiate between more computational categories might improve Ethereum’s efficiency, and in Buterin's view, significantly increase scalability of the network’s mainnet.\n\nBut it likely wouldn't insulate Ethereum users from spikes in network volatility induced by trending projects—it’s not that boutique in design.\n\nSo, all that is to say: Solana and Ethereum maximalists, fear not. There will still be plenty of differences to pick apart.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNNmUtVTFDMnNkdDB5WXYxZ1liRjZidnpJYXM2M3RUNDlVdWpSaDVtdHgzV256dTZvVDZ0MkpJQzBuSWJ2MXpfWGJiRkk0OUxlM18zMW5hSzdXMXp3NXBQUll4S0hZS1F3M0NZWU1ZeXA2Ykg4alk4SlRVWHVhOE4yb0FVdHo0cDQyWE1kVk1vM3UwR3BXMGZpZllMUlhhblAyUXF2VjctVi1GRFlkQnhySTREY0Y1c3l0Y24tQlN5Xy1wWXBscktEaFRGMC04Ukt3UlVKQdIB2gFBVV95cUxNZFNSNWRucU9DVjRwUkNlRVMwcXFmRTloUGpEVGxyNWFwVnJSZ1dOaU1rbkkzaWptdWpzVkpfcXRhdzZCcW1jcFJ6UjJHU3FESy1YSlRCbkw0Yjd4elFDSTUyak9sZ1NFNktQT1hHM0RRTG5GS3JCeGppUW0xbFlRcG41SnFtNUNKZDRlNmtmNjZ3b2U0ZFlSWW9tLVFCYjEwVjNPZ1BqYjJSRmRqODZxYWtZc25FazhPa2c5UzNMa3BldlI1OV9BZW5qNUtHelQ4aFlva2hReU5IQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Lucky Crypto Trader Sees Ethereum Memecoin Investment Surge in Value by a Staggering 86,000%: On-Chain Data - The Daily Hodl",
        "content": "New on-chain data reveals that one lucky trader is seeing a more than 86,000% gain on his Ethereum (ETH)-based memecoin investment.\n\nAccording to blockchain tracking firm Lookonchain noticed, one investor bought $6,500 worth of the MAGA (TRUMP) late last year and is now sitting on $5.6 million worth of funds.\n\n“The trader ‘waxl.eth’ turned $6,500 to $5.6 million with TRUMP, a gain of 870x! He spent $6,500 to buy 2.08 million TRUMP via two wallets and sold 1.24 million TRUMP for $902,000, with 832,000 TRUMP ($4.7 million) left.”\n\nThe MAGA memecoin, founded in August 2023 and based on former US President Donald Trump, currently has a market cap of $298.3 million, making it the 234th ranked digital asset. TRUMP is trading for $6.40 at time of writing, up more than 51.9% in the last 24 hours.\n\nThe sudden surge in value comes as Trump reportedly made pro-crypto remarks on May 8th during a dinner event he hosted in Mar-a-Logo for supporters who bought non-fungible tokens (NFTs) from his “Mugshot Edition” collection.\n\nDuring the event, Trump announced that he would be accepting crypto donations towards his presidential campaign.\n\nLookonchain also noticed another trader who is sitting on $4.4 million in profits through buying TRUMP after purchasing hundreds of thousands of the meme asset in December 2023 and January 2024.\n\n“The address tagged ‘GCR: Address 1’ spent 703,460 USDT to buy 936,279 TRUMP at $0.75 from December 8th, 2023 to January 18th, 2024, and now has a floating profit of $4.4 million!”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOM21obXJTTUYxWkZ0dEtjWHk1Tlc3bXRRdnpFZXozT1JvTXRraVIyQ3hwTzB0THEwYy1YbGhJMnZNWWNfQUwwNlZCU185SEpOQVBiMjR3U1JVazhmT0Nyc01xSnhaVGVjc21xMlJEa0JmRmdDcHVycHl4M1pCcnJ6dm1FeXFsN0Q5bUpDQjAwU1BPR1kzMkVCUXlnNDNORGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Proposes EIP-7702: a revolution for Ethereum - The Cryptonomist",
        "content": "Vitalik Buterin, the visionary co-founder of Ethereum, together with co-authors Sam Wilson, Ansgar Dietrichs and Matt Garnett, has recently presented a revolutionary proposal: the EIP-7702.\n\nThis proposal aims to enhance the concept of “account abstraction” on Ethereum, introducing new flexibility and potential to externally owned accounts (EOA), such as regular wallets, allowing them to temporarily take on the functions of a smart contract during a transaction.\n\nWhat is EIP-7702? The proposal by Ethereum co-founder Vitalik Buterin\n\nThe EIP-7702, or Ethereum Improvement Proposal 7702, is a technical proposal that aims to extend the capabilities of externally owned accounts on Ethereum, allowing them to behave like smart contracts.\n\nNormally, EOAs are simple wallets that can send and receive funds, but cannot execute arbitrary code like smart contracts.\n\nHowever, with the introduction of EIP-7702, these accounts will be able to temporarily activate smart contract capabilities to perform complex operations, and then return to their original state once the transaction is completed.\n\nThe need for such innovation stems from the current limitations of EOAs, which cannot directly participate in more complex transactions without the intermediation of a smart contract.\n\nThis not only complicates some operations but also limits the possibilities of automation and customization for Ethereum users. With EIP-7702, users will be able to take advantage of the flexibility of smart contracts while maintaining the simplicity and security of a normal wallet.\n\nThe mechanism proposed in EIP-7702 provides that an EOA can temporarily activate a set of functionalities typical of a smart contract, such as the execution of specific code, at the time of the transaction.\n\nThis process is possible thanks to a modification of the Ethereum Virtual Machine (EVM) that recognizes and treats these “enhanced” EOAs for the necessary duration. Once the transaction has been executed, the account returns to its original EOA state, ensuring security and stability.\n\nI benefits:\n\nGreater Flexibility: Users can customize their transactions tailored to specific needs, without the need to interact with external smart contracts. Gas Efficiency: Reducing the need for intermediary smart contracts can result in a significant reduction in gas costs, essential for large-scale operations. Usability: By maintaining the basic structure of EOAs, users will enjoy a less complicated and more direct user experience.\n\nThe future of Account Abstraction and its economic implications\n\nOne of the most promising aspects of EIP-7702 is its potential ability to transform the economy of smart contracts on Ethereum.\n\nCurrently, the creation and maintenance of smart contracts require significant resources, both in terms of development and execution costs, mainly due to gas consumption.\n\nButerin’s proposal could simplify this process, reducing the need for multiple contracts for operations that a user wants to perform repeatedly, thus lowering overall costs and making blockchain technology more accessible to a wider audience.\n\nThis increased accessibility could have direct repercussions on the adoption rate of Ethereum. With lower entry barriers, more companies and individuals could be incentivized to explore and adopt Ethereum-based solutions.\n\nFurthermore, the adoption of such proposal could stimulate a new wave of innovations in sectors such as gaming, digital art, and digital asset management, where the need for complex and personalized interactions is particularly felt.\n\nThe issue of security is central in the debate on EIP-7702. Increasing the complexity of EOAs could trigger new security risks that must be carefully addressed.\n\nThe Ethereum community will need to work together to develop new security protocols that can adequately protect enhanced accounts against malicious attacks, while at the same time preserving the fluidity and efficiency of transactions.\n\nFurthermore, the introduction of EIP-7702 could require a review of Ethereum’s governance regulations, as the current framework may not be fully equipped to handle the changing dynamics of accounts and their interactions.\n\nActive participation of the community, through improvement proposals and voting, will be essential to ensure that the changes not only enhance the technology, but also reflect the values and needs of Ethereum users.\n\nPossible Implications of Vitalik Buterin’s Choice on EIP-7702 on Ethereum\n\nIf implemented, EIP-7702 could lead to a significant evolution of decentralized applications (DApps) on Ethereum, making the platform even more attractive for developers and end users.\n\nThe ease with which accounts can be adapted for specific functions could also stimulate innovation in areas such as decentralized finance (DeFi) and digital identity.\n\nDespite the numerous advantages, the EIP-7702 presents some challenges, especially regarding security.\n\nThe increase in functionality of EOAs could potentially expose them to new attack vectors. Therefore, it will be essential to implement robust security measures to protect users and maintain the integrity of the Ethereum network.\n\nThe EIP-7702 represents a significant step forward in the attempt to make Ethereum a more accessible and powerful platform. Although there are challenges to overcome, the potential for significant improvements in transaction management and interaction with the blockchain is evident.\n\nOver the next few months, the Ethereum community will have the opportunity to evaluate, discuss, and potentially adopt this proposal, continuing to push the boundaries of what is possible with blockchain technology."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNd0FwWlBVNF9jdkcySFc5QWQ5TnNSYjZTUnlsOHV1aURJWGlYZFo5MlVGbTlLSE5aZl9XZi1ISG5MX0FZdTA5VExiY1VhVnJRakRfSjhYNHU0ZFRpZ1pLTXZEMnpiRnFIa3MyVUhZWl91Q2NnbDNtTXE5cFZuRWQ0S3ZUUU7SAYoBQVVfeXFMTUoyT0lyNUlIMW5GaWpzQXlCYmQwUU1ReDJpLVpXNW5QTlRGNXVvUlZzelRIYmE5OFF6Q0FqRHNIZmVhckU2TWVKaEdYZVdUSGgyZlRYTk5nRm9nOE1MblpiRWF3blhZa2xDY19FREVtdm9mQVRvdTZ1YmZlTThlUE1yTkk3VEZtZUNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Ripple CTO Reveals How He Bought 40,000 ETH During Ethereum ICO - U.Today",
        "content": "Ripple CTO David Schwartz's recent disclosure has sparked widespread intrigue within the cryptocurrency community, shedding new light on his early involvement in Ethereum and the significant gains he accrued. Schwartz revealed that he secured a substantial 40,000 ETH during Ethereum's pre-ICO phase, a move spurred by his acquaintance with Ethereum's founder, Vitalik Buterin.\n\nAdvertisement\n\nSchwartz's entry into Ethereum predates its public pre-ICO, with Buterin extending a personal invitation for him to participate. Motivated by a desire to support Buterin, Schwartz invested 20 BTC without much deliberation, resulting in the acquisition of the substantial ETH holdings.\n\nThe other part of this story was previously known. Many times before, the Ripple CTO has said that he sold this colossal amount of altcoins as soon as the price reached $1 and used it to buy solar panels for his home. While this move may raise eyebrows, Schwartz brushed off concerns, attributing it to a common experience among early crypto adopters, citing missed opportunities such as Bitcoin's meteoric rise.\n\nAdvertisement\n\nI knew Vitalik. He invited me to participate. I wanted to support him, so went in for 20 BTC. I didn't really ask any questions. It got me 40,000 ETH. I thought of it as helping an acquaintance. — David \"JoelKatz\" Schwartz (@JoelKatz) May 10, 2024\n\nThe intertwining histories of Ripple and Ethereum add complexity to the narrative. Buterin's stint at the company, cut short due to visa complications, underscores the connections between the two projects. Yet, tensions have arisen in recent years, exacerbated by Ripple's legal battle with the SEC. Buterin's criticisms of Ripple's actions and their potential implications for Ethereum's regulatory standing have further strained relations.\n\nETH to USD by CoinMarketCap\n\nAs of now, the astronomical rise in Ethereum's value, currently hovering around $3,000 per ETH, places Schwartz's early investment at a staggering $120 million valuation. Even the initial 20 BTC used to purchase ETH is now valued at $1.3 million."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE1pSkxyZ1dmbENPbzdKRmtqX0lkMVI5NjRrN2xMalE0OS03QkZ1T3ZkalVVVWJXeHFsNWlOSmtqb25aZWVGTUxQcVo2ZnFiUndRRXNaN2g5S2NEMWt4LWdDcEtOUkFsd9IBa0FVX3lxTE1YWHM4YVNPalRHcVFmYjFBdzZOQVd1cEZPdUNwWHAxYlVLcmk1RnlDTWxOMWtmUnc1NDVKa3RvNzJnTG9CMk45VS1KTWtBa0dDd1B6RVdiN2ZHb3hhSXR6VzhKZUp0SGZsNWJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Solana Surpasses Ethereum in DEX Volume - U.Today",
        "content": "Advertisement\n\nSolana has managed to top Ethereum in 24-hour daily volume in decentralized exchanges, according to recent data.\n\nThe two popular blockchains recorded $1.3 billion and $1.29 billion, respectively, in DEX trading volume.\n\nBSC comes in third place with $604 million worth of DEX trading volume.\n\nArbitrum and Base are in fourth and fifth places after generating $510 million and $286 million in DEX trading volume, respectively.\n\nAdvertisement\n\nAnother flippening?\n\nIt is also worth noting that Solana’s total fees are now at 50% of Ethereum’s fees over the past few days. For comparison, the ratio was just 1% during the 2021 bull run.\n\nSome analysts expect Solana to flip Ethereum in fees this month, which would be a major development for the cryptocurrency ecosystem. However, it is worth noting that the capital moving to layer-2 solutions is one of the reasons for this changing dynamics.\n\nSolana surges 6%\n\nThe price of the SOL cryptocurrency has surged more than 6% over the past 24 hours, which makes it one of the best-performing altcoins. The token is currently changing hands at $154 on major spot exchanges. Its market cap currently stands at $68 billion.\n\nFor comparison, ETH is currently up a modest 1.23%. Yet, with its valuation of $365 billion, it still dwarfs Solana."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1BMHlYc1NJTHc0aTZuaVpoR2J3U3VNQkZMYi11VEhmTVZSQzA3VWtSZUZxaTRJLW45YThtcWdhNXZkc3BIUjJqRmF2NVY2eGVFUkRiQjZWUUo3ZDVPZ0YzMGxBdzNkOE9sTktnS3ZPeDZlUjRRZ1YxSk9yQdIBgAFBVV95cUxOd3YwWm9VaWNWbmZ1bjdOcnpNLWJMVXZsOG15WXNianMtQ3J3YzFHemJJRzEyM1JmenE2a2ZMcTdkeGVYdnltVFlKVUFfeEp4N2pXNVcxcUotRFpkc05kQWlpY21nSVpOelZIazdzbVE4eG5ieGwzSG00U2x5WG9zZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "‘Cheap’ Solana can flip Ethereum ‘this week’ – Analyst - AMBCrypto News",
        "content": "Solana is quickly catching up to Ethereum on the fees front.\n\nHowever, the Ethereum ecosystem still commands investors’ trust.\n\nThe Solana [SOL] vs. Ethereum [ETH] debate resurfaced again on Crypto Twitter following reports that the former could soon flip the latter on the fees front.\n\nAccording to on-chain analyst Dan Smith, Solana was quickly closing in on Ethereum on transaction fees. Smith claimed that,\n\n“Solana will flip Ethereum in transaction fees + captured MEV this month, maybe even this week”\n\nTransaction fees refer to charges linked to network activity, while MEV means validators’ highest value derived by maximizing block production or ‘confirmation.’\n\nSolana vs Ethereum: fees and other fronts\n\nSmith backed his argument with data, noting that there was about a $300K difference between Solana and Ethereum’s fees.\n\nThe chart showed Solana recorded a significant surge in 2024, closing most of the gap with Ethereum.\n\nAMBCrypto’s evaluation of Artemyz’s data confirmed the trend on the fees front. The data showed that Ethereum network fees had dropped significantly since the end of February.\n\nOn the 7th of May, Ethereum fees hit $2.8 million, while Solana had $1.6 million.\n\nHowever, other market watchers argued that Ethereum transaction volume should include all L2 to capture its “real value.” To which, Dan Smith responded,\n\n“The question is whether or not pushing activity to L2s where ETH, the asset is used as a currency, drives enough value back to the L1 to compensate for the loss of L1 activity”\n\nDespite its network challenges, Solana, on average, has cheaper transaction charges than Ethereum.\n\nReacting to Smith’s projection of SOL eclipsing ETH, crypto analyst Ansem wondered,\n\n“And it is still 100x cheaper to transact on for users, really think about this & explain to me in detail why ETH is still worth 5x more by market cap”\n\nThings are also hitting up on the DEX (Decentralized Exchange) front after Solana’s Jupiter exchange outperformed Ethereum’s Uniswap on the Unique Active Wallets (UAW) front.\n\nLike Ansem, most market watchers underscored SOL as grossly undervalued, especially after last week’s pullback.\n\nNevertheless, Ethereum had a commanding lead on TVL (Total Value Locked) and overall token value on price charts.\n\nSolana had $4 billion in TVL, while Ethereum’s reading stood at $53.3 billion at press time, underscoring that Ethereum had more investors’ trust."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNQXcwTEgxR09XdzU4V0doRDBtUTBWQ1VxUkMzUUNqMnNKU0FBQWM2R21TdWc5U2NiX2VaS3ZVcVc1UmhVTERzWFdoVDUxbGZVX3ZqeEJvMGRUX0hxa1BpMUpqd1prRzVzMlVfWkMyYnhVS0Z1TnpFYW5seHJwMFZHLXhUbGo3NjVKZTgtQlgxcG1LR1lxNlBoU3hVdEhQZlZJQ09LNUcwc1JJUdIBrwFBVV95cUxOVktxMC1BUjNNMVNwSFNSQ3R0WHd3N3VZT3NSSjh5VElyQ2lVS3JhWjg1ZTRGNUtYZkdzRTYxRVFnbDRFR29CUlBZcG5udGQ1aF80NkhZX2diazlncExmdkROdHZCalJodENuMDl3Q1ZpOGtHbTg5bXVuODZNVDkyU20wY0tNSEJNX2UtOTFLcW5tdmtqSlZyRTdMNktYRkFuUGZlUUZyM1lQRVEwZEM0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 10: Bitcoin Crosses $63K, Ethereum Tops $3000 As Market Rebounds - CoinGape",
        "content": "The top crypto prices today recovered notably as the Bitcoin (BTC) price surpassed the $63,000 level. Furthermore, the Ethereum (ETH) extended above the $3,000 mark amid the market rebound. In addition, other top altcoins, such as Solana (SOL) and Cardano (ADA) registered gains while XRP defied the market trend.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price surged 3.21% reaching $63,138.36 at the time of writing on Friday, May 10. On the other hand, it’s trading volume gained 7.15% to $26.07 billion in the last 24 hours. Whilst, the crypto’s market capitalization stood at $1.24 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price was up 1.08% to $3,027.29 at press time with a market valuation of $363.45 billion. Whilst, ETH saw its trading volume fall 2.15%, reaching $11.01 billion.\n\n3. Solana Price\n\nThe Solana price extended higher than the $150 level today. The Solana price rallied 6.29%, settling at $152.96. In contrast, SOL witnessed a 1.20% drop in trade volume to $2.32 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price recorded a slight decline and fell below the $0.52 mark. The XRP price recorded a dip of 0.48%, reaching $0.5184. On the other hand, XRP’s trading volume slumped by 5% to $972.09 million.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price gained 0.99% to $0.4647 today. Whilst, ADA recorded a plunge of 42.49% in its 24-hour trading volume, settling at $299.02 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price soared 2.87% to $0.1514 while its rival, Shiba Inu price rallied 2.17% and traded at $0.00002337.\n\nAlso Read: Top 3 Crypto Presales Likely To Outperform Bitcoin In 2024\n\nTop Crypto Gainers Today\n\nAakash Network (AKT): The AKT price rose 16.35% to $5.68.\n\nThe AKT price rose 16.35% to $5.68. The Graph (GRT): The GRT crypto surged 12.97% and traded at $0.304.\n\nThe GRT crypto surged 12.97% and traded at $0.304. Toncoin (TON): The TON crypto surged 11.58% and traded at $6.58.\n\nThe TON crypto surged 11.58% and traded at $6.58. Dogwifhat (WIF): The WIF crypto price rose 11.17% to $3.21.\n\nTop Crypto Losers Today\n\nCosmos (ATOM): The Cosmos price lost 1.75%% to $9.09.\n\nThe Cosmos price lost 1.75%% to $9.09. Monero (XMR): The Monero price was down 1.34% to $132.03.\n\nThe Monero price was down 1.34% to $132.03. Bitget Token (BGB): The Bitget Token price dipped 0.71% to $1.11.\n\nThe Bitget Token price dipped 0.71% to $1.11. Binance Coin (BNB): The BNB price slipped 0.25% to $594.04.\n\nFantom (FTM), Worldcoin (WLD), and Helium (HNT) also made it to the top crypto gainers list today.\n\nAlso Read: 5 Signs to Look for When the Bull Run is Over\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTFBCQ2UyY2FjZ0xSRVZtQmI0Zk9MRTYzTGdrT2FJRC1EOXlFaXB4eXBGakZTQmZCRFJfbzJSZnJPVGNXSWt5elVYdExSaVNVLW51WVlHRWYwLTFkRVZmMVY2OUhjeG1UTVlNeVVfOVFBQnBhUdIBd0FVX3lxTE5QZExQSU0zNmxXdVZndTVNMklTM050emNZbE5FNmluMnpZS21lRnRycEtNRHBqVHNoRjhXYTVTUUNwYXNmTFMxcmJUR2RXOFAxVERnWTBXWmYyR3VMQWZrTi1sRDlmVkZqVmdVWUZkMkFvLUFMUk1V?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Solves Ethereum's Gas Fee Problem - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThanks to insights from Vitalik Buterin and contributions from experts like Ansgar Dietrichs, Barnabe Monnot and Davide Crapis, we are getting familiar with the concept of \"multidimensional gas.\" Traditionally, Ethereum has used a unit called \"gas\" to measure and price the computational efforts required for transactions and operations. This includes calculations like adding and multiplying, managing data storage, bandwidth and even complex processes like generating cryptographic proofs.\n\nAdvertisement\n\nThe recent proposal involves transitioning from a single-dimensional gas model to a multi-dimensional one, addressing the inefficiencies of treating different types of computational resources as equivalents. The current system, while simple, does not accurately reflect the varying demands different operations place on the network, which can lead to either over or under-utilization of resources.\n\nButerin uses a straightforward diagram to explain that while the gas limit might suggest a block can safely handle a certain amount of computation and data, the reality of what is safe can be quite different. This misalignment could potentially allow for blocks that are either too safe and under-utilized or too risky and overloaded.\n\nWith the introduction of multi-dimensional gas on Ethereum via EIP-4844, the network can now process different types of demands more efficiently. This change has already started to show benefits. Blobs, for example, will allow these rollups to operate much more cheaply, increasing transaction volume threefold without significantly raising block size, thus maintaining network safety.\n\nAdvertisement\n\nThe update also anticipates future enhancements, such as better support for \"stateless clients\" — a new type of Ethereum client that does not need to store a complete copy of the blockchain. These clients rely heavily on proof systems, and the current shift toward multidimensional gas could facilitate a smoother implementation of these systems by allowing the network to handle proofs more efficiently without compromising on security or inflating costs for users.\n\nThis multi-dimensional approach allows Ethereum to fine-tune how it manages different resources, potentially increasing throughput without risking safety. It marks a sophisticated step forward in blockchain technology, promising to make Ethereum more scalable, efficient and ready for future demands."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOLXI5RVRYaEN2REdrb19PYzc5ZWtQY0Vaa29TQ2lGRXY3dWh4Z09iMzl4Mm9wVmJfMFN6ckpoUlhHSUdZSXUtd2ZwQjVSLWFwZDhsNGQ3Uk1QNnVGOXZySFd4ZGhzUkVhYVRNZkUzY2JwYlo4UkxkOFV1bXBlR1lWYWJsdFYzam9XLVF6OdIBkgFBVV95cUxNQ0Q0ME0tZ08xUDBuMVNEZERrMlFSRkpDdElmd2JIakdDQk9TMmdYUnNIZ0djcVdlR3lOcnQyeHJTSHdJWmVfUUpOMmtwWGNCbm1Jc043OHVrM1Zia3lLQnM2QzBjQzAxcnlaX1pYQ2dYTndXRE11R1U1ZnVvSmt6UW9vMm9sV3lNLTZiRzFnVHRMZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Ethereum – Examining whether ETH’s price will fall to $2,700 again - AMBCrypto News",
        "content": "ETH has struggled to initiate an uptrend on the charts\n\nMost market indicators and metrics looked bearish\n\nAt press time, Ethereum’s [ETH] daily and weekly price charts remained green. However, the trend might be short-lived. In fact, as per a recent analysis, there may be chances of ETH dropping to $2.7k before it even begins a bull rally. Hence, AMBCrypto checked ETH’s current state to better understand what to expect in the short-term.\n\nBears v. Bulls for Ethereum\n\nEthereum was somewhat bullish on the charts in the last 24 hours, with its price hiking by just over 1%. According to CoinMarketCap, at the time of writing, ETH was trading at $3,035.04 with a market capitalization of over $364 billion.\n\nHowever, bears might soon step up, with a recent analysis suggesting that ETH might drop to $2.7k. Crypto Tony, a popular crypto-analyst, recently shared this projection, highlighting ETH’s possible future trajectory. As per the tweet, ETH’s price will first reach its support level of $2.7k, before beginning a rally, which might allow it to touch $5.4k.\n\nThe possibility of ETH dropping to $2.7k seems likely since investors’ confidence in the token has fallen dramatically. AMBCrypto’s analysis of Santiment’s data also revealed that ETH’s weighted sentiment was in the negative zone – A sign that bearish sentiment retained its dominance in the market.\n\nApart from that, quite a few other metrics also looked somewhat bearish too.\n\nFor example, ETH’s exchange inflow spiked, reflecting a hike in selling pressure. The fact that investors have been selling ETH was further proven by its supply on exchanges, which increased over the past week.\n\nNotably, while investors sold their holdings, whales went the other route as they kept accumulating – As evidenced by the slight rise in the supply held by top addresses.\n\nFuture targets\n\nAMBCrypto reported previously that the crypto-market was bearish on Ethereum. To see whether that was still the case, we then analyzed ETH’s daily chart. As per our analysis, market indicators continued to remain bearish.\n\nThe token’s price was resting lower than its 20-day Exponential Moving Average (EMA). The Relative Strength Index (RSI) was under the neutral level. Additionally, ETH’s Chaikin Money Flow (CMF) also went south, suggesting that the chances of ETH dropping to $2.7k were high.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThat being said, investors should not worry about ETH’s price trend being all bad since there is a possibility of a trend reversal before $2.7k.\n\nIf ETH manages to test its support near $3k, then the scenario might turn bullish. A drop below that level would result in ETH touching yet another resistance near $2.92k, depending on whether it might rebound if things fall into place."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOZ2ZUNndrZzEyTWljWWxvZU14VTMwLVJzdkZ2QUVRYUVoU1NNTnc4ZjlKSjVOY0w2Tl83dDNfU3ItaVRPUWhmZlI2QWstbE5xZ19mcXNZR0dTZDRLM2MtYTkyV0NHMkJZSjZYVVZhMWdfN3B6YWFRbUcybnNWUjVVR2s0SW5wYWw3T21yLXl3UklySURYVHfSAZsBQVVfeXFMT29UM1ZrRURncEhSZzZKS2hGTjEtSC1ObHdzR2ZYN0NLT3RMejI5V0V0d3FRSlZNaEdjMWxEY2xzTldVa083QjkwUmRqSEVXTE81dG9yVzkxQ2tjdS1KbHlmZWdtWU4wUWZvT0RLQ0wyYVlSSTNRNEFiUDR0OEN2cEhlY05Cb0F0YjJ2d1lpT0x4SWxPcEFRVDNXUWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs: What ‘convinced Grayscale to withdraw?’ Analysts weigh in - AMBCrypto News",
        "content": "Grayscale makes a U-turn on ETH futures ETF application\n\nAnalysts offer divergent views on Grayscale’s move and SEC’s next play.\n\nGrayscale has withdrawn its Ethereum [ETH] futures ETF filing, eliciting mixed signals as analysts struggle to interpret how this could impact the SEC’s next move.\n\nBloomberg ETF analyst James Seyffart called the application a “Trojan horse” that the exchange could use to sue the SEC if it denied its spot ETH ETF application, as it did in the spot Bitcoin [BTC] case.\n\nNow that Grayscale has withdrawn the filing, the analyst noted,\n\n“Maybe the SEC spoke with Grayscale about this… And whatever was said convinced Grayscale to withdraw? (This is a complete guess)”\n\nNo clear read on SEC’s Ethereum ETF approval move\n\nBloomberg ETF analysts have long maintained low odds of May approvals for the spot ETH ETFs in May.\n\nIndeed, the market looks convinced that nothing positive will happen in May. According to prediction markets, Polymarket, May approval bets have dropped below 10%.\n\nAnother Bloomberg analyst, Eric Balchunas, commented that,\n\n“Sounds like saying this is a good sign they’re not gonna pursue a lawsuit this time around?”\n\nHowever, when asked whether Grayscale’s withdrawal of the filing could mean that a May approval was likely, Seyffart was conflicted and answered,\n\n“I *DO NOT* think that’s gonna happen (though odds aren’t zero). So, I *DO* think it was something else. That said — honestly — that’s one of the very few reasons that I’d voluntarily withdraw this if I were Grayscale.”\n\nNate Geraci of ETF Store also couldn’t read Grayscale’s move. However, he pointed out that,\n\n“Only reason I would do this if I were Grayscale is b/c I have “assurances” spot eth ETF will be approved at some point.”\n\nOn her part, Eleanor Terrett, market watcher and FOX Business journalist, noted that muted demand for ETH futures could be the reason for Grayscale’s move.\n\nThere are a handful of ETH futures ETFs in the US per Blockworks ETF tracker.\n\nHowever, Terret noted that other Ethereum futures ETFs were approved in different frameworks,\n\n“The others were approved under the 40 Act, not the 33 Act?”\n\nFor perspective, the Investment Company Act of 1940 (40 Act) and the Securities Act of 1933 (Act 33) are two different ETF approval regimes in the US.\n\nIn a recent interview, SEC’s chair, Gary Gensler, dodged questions on the status and fate of the spot ETH ETF filings with ambiguous answers.\n\nIn the meantime, ETH extended its short-term price range of $2900 — $3300. It has been stuck in the range since mid-April.\n\nThat said, even last week’s over $30 million capital inflows didn’t induce a range breakout. However, this could change after the SEC’s decision on spot ETH ETF applications in late May."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOd2FKd3VvUmhpVWhyZ0RkaVQ0VHQ0VE12TkgwM25XWVoxU3pRWkVNWmNsWjFCakdINlVBU2pLSy1rMFdSYzViUWVTYjFCMWRlbE00SERELThJYy14X0E1al9PaGdGOUd3SU1Cem1jQnVXUFh0Y2xKeGNHZUctRnFKWm1lZ19MN3JPNWFlR0tmb2MycDJYWldDWtIBngFBVV95cUxQMjRsbDNYczJ3bHpyVDdtdGFCR1VJTjF0Rl8xR2ZES3ZwS0N4RWRXN0dFY0c5NGdnTnZ3YTNmb3ZyaE1TNDBEQnhWYTFXN3ZQZDhEVWRmNlRaQWZzMHQ5YkVKVmpVeWJ3NkdxaXktZWw3QV9FMWpCNlNqWDlTWC15VVZCM3UwU1R2Smd0T1NtN0JQT1NscllhTFZyLTJ6QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Solana beats Ethereum in key areas: Are investors turning away from ETH? - AMBCrypto News",
        "content": "Solana outperformed Ethereum in terms of fees paid out to validators.\n\nUsage on the Ethereum network declined, as the price of ETH fell.\n\nThe popularity of the Solana [SOL] network has helped it attract a large number of users, due to which an increase in activity on the network was observed.\n\nGas is paid\n\nDue to the rising activity on the network, the fees paid out to validators on the Solana network had grown.\n\nEthereum [ETH] has long been the dominant player in the smart contract platform space. Solana’s rise in popularity, especially if its fees remain competitive with Ethereum’s, could chip away at Ethereum’s market share.\n\nThis weakens Ethereum’s position as the go-to blockchain for developers and users.\n\nThe state of the Ethereum network has also been dire. Over the last month, the number of daily active addresses on the Ethereum network had declined significantly.\n\nAccording to Token Terminal, the number of daily active users on the network fell by 2.9% in the last 30 days.\n\nMoreover, the average revenue generated by the network also declined significantly by 81.6% during this period.\n\nThe NFT trades on the Ethereum network also declined significantly over the last month.\n\nThe popularity of NFTs from alternative chains such as Bitcoin [BTC] and Solana [SOL] may be grabbing a good chunk of the Ethereum network.\n\nETH failed to fare well in terms of price as well. Since the 8th of April, its price fell considerably, exhibiting multiple lower lows and lower highs, indicative of a bearish trend.\n\nCoupled with that, the CMF (Chaikin Money Flow) for Ethereum fell significantly to -0.21 during this period. This meant that the money flowing into ETH had declined significantly in the last few days.\n\nThe RSI (Relative Strength Index) for Ethereum also declined during this period, implying that momentum was with the bears at the time of writing.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nNew addresses grow\n\nCoupled with that, the velocity of ETH had fallen, indicating a reduced frequency of trades. In contrast to this, the overall network growth of ETH grew significantly.\n\nThis meant that new addresses continued to show interest in the ETH token."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPUjQ0Tl9IUzBvNC1Uam1lSmdPbW9XYlZ4b05SQUJPQ0tjU0Z4ZnNjcnBINzVRbjZfbW1Fa0J5NmxpUXBBeFN4YTI3cndDdDB2VldMQS16VFlDU285aHJXUlNOdjI2VlRhTmQtT1dqWk5rc3NYMll2NDA1Q0lNdUZyRGdZLVl4RUV6ejBv0gGTAUFVX3lxTE1zZkV2b2tlR3FxYllHSHhSNG5CT0xDMkdLbjc5ZWRjMXBmYjNhcDRlelczOVlRRUxVeGRndEllYWN3dzlfOWFUSjItakNoXzNtU18yN2RjdGRNRFJReUxEN0g0RUphUkFaZ0tuNFYwZjlPem5rNl9KdmJ5eXZ0N0dEbTJtRDF4c0h1bm04Z0dubFlMMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "What Is Fantasy Top? The Ethereum Game on Blast Turning Crypto Twitter Into a Fantasy Sport - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWe’ve seen mash-ups of fantasy sports and NFT trading cards, but what about something with more crypto-native subject matter? Enter Fantasy Top.\n\nBuilt on Ethereum layer-2 network Blast, Fantasy Top takes the premise of fantasy football and other fantasy sports games, but swaps out pro athletes for crypto influencers. It’s like Crypto Twitter: The Game, and it’s more than just a surface-level riff on the social media sphere.\n\nFantasy Top has gotten off to an electric start, dominating industry chatter while driving surging trading volume—and becoming one of the most profitable protocols or apps across all of crypto. Curious how to get started? Here’s what you need to know.\n\nWhat is Fantasy Top?\n\nAD\n\nAD\n\nCrypto Twitter often feels like a spectator sport, so it makes sense that someone turned it into a fantasy game. Fantasy Top takes the core premise of fantasy football, soccer, or baseball, and swaps in 120 (and counting) crypto influencers, traders, content creators, and personalities.\n\nEach “hero” in the game is based on a denizen of Crypto Twitter, and they get their own NFT cards minted on Ethereum layer-2 network Blast. You can buy and trade the NFTs, which come in multiple rarity levels and can be upgraded by acquiring multiple copies of a lower-level edition and trading them up. Higher-level cards come with a larger score multiplier.\n\nIn Fantasy Top competitions, you’ll select a lineup of five owned NFT cards and lock it in. Scoring is based on the actual Twitter engagement of your industry “heroes,” amplified by your cards’ particular score multipliers, so there’s strategy involved in both buying up cards for your lineup and picking the best cross-section of crypto tweeters to place highly in a competition.\n\nCards in Fantasy Top. Image: Fantasy Top\n\nRewards thus far include Ethereum (ETH), Blast Gold points that will go towards the network’s upcoming BLAST token drop, and FAN points, which may ultimately lead to future benefits on Fantasy Top—or perhaps an allotment of airdrop tokens.\n\nDo I need NFTs to play Fantasy Top?\n\nYes, Fantasy Top requires NFT cards to play. You’ll need at least five to lock in a lineup for a competition, and at this point, there’s no option to play the game without the NFTs.\n\nAD\n\nAD\n\nFantasy Top sells packs of cards with dynamic pricing based on demand (currently around 0.4 ETH, or nearly $1,200), or you can purchase individual cards from the app’s NFT marketplace.\n\nFantasy Top is played via the website, and like with other fantasy sports, you simply set your lineup and then watch the points roll in. Your leaderboard placement at the end of each competition period determines your rewards.\n\nWhat can I win in Fantasy Top?\n\nWith such significant demand right out the gate, the early rewards are substantial indeed. In the first “main competition,” Fantasy Top served up a total prize pool that included over $150,000 worth of ETH, potentially more than $2 million worth of Blast Gold (based on analyst projections), and other perks to players.\n\nAnd the crypto influencers who've become in-game heroes are seeing sizable benefits, too. A share of the overall pack sales, along with a cut of the marketplace fees, are paid out to the influencers.\n\nLess than a week after Fantasy Top’s mainnet launch on May 1, 2024, the game paid out $1.25 million worth of ETH (in total) to heroes, along with what’s estimated to be at least $25,000 worth of Blast Gold points.\n\nThe future\n\nFantasy Top is early and buzzy, but the team has already teased plans ahead for the future—and it also clearly has some kinks to work out along the way.\n\nOne week after launch, the game has already added leagues, which split players up into Silver and Bronze categories based on their performance thus far. Rewards will apparently vary by league designation, with “rewards increasingly skewed towards the top performers,” according to a tweet.\n\nWhat’s ahead? More in-game heroes, apparently, along with an improved scoring model, a “whole array of sub-competitions,” and other “surprises” to come.\n\nAD\n\nAD\n\nPreventing Bots and shortening the Main Competition 🏁 To safeguard Fantasy participants and uphold a meritocratic environment, we've decided, together with the heroes, to end the competition slightly ahead of schedule, preemptively thwarting any surge in malicious activities.… pic.twitter.com/BKp0rYL6Io — fantasy.top (@fantasy_top_) May 8, 2024\n\nBut as Fantasy Top attempts to grow, it will also need to deal with the immediate problem of users (or external observers) “botting” tweets from the heroes, manipulating the scoring and leading to some early pivots as the team figures out how to handle it all.\n\nSome heroes have complained of being targeted by botters, and Fantasy Top already decided to end its first main competition early due to manipulation concerns. The game is built around social media engagement, so that’s something they’ll have to sort out if Fantasy Top is going to try and parlay this early buzz into a sustainable game model."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9nWVZDd0JhWjBrRzAxcVBGa3dtemY3UllyNXlIYmNDZnBycFNXMGxrMldQYmJPZFJ2NWQxVFQ0OUhTTnF2LTVFRERMMjMxU1o4NGs2YUNRQVF5THJIdWR5OVBoY0tKcFVtcDMwWlZneWhzQW0yNUlOWGV30gF_QVVfeXFMT3lmUExyVG94NUNVSE9HcUxlZnhkZ1FXMGFhZHRjeUNOTU0tb0tRcnpkUGJ2dFNkUDVJYlA0N01zY0hSNllEWUxEcjFhc1Zvb1NVWkExaHktOVlIY3RjUHJzVnBpcjlJXzR2SmNlYnRQVnRrM19xYWd3aGpPWU1XTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Ethereum Is Down 30% From 2024 Highs: Why Is This Analyst Super Bullish? - Bitcoinist",
        "content": "While Ethereum struggles to regain the Q1 2024 momentum, currently tethered close to the psychological $3,000 level, one trader remains bullish.\n\nTaking to X, the analyst posts several reasons to negate concerns by skeptics even with the coin trading 30% from March 2024 highs when prices broke above $4,000. By this take, doubts about future gains could be unfounded as they paint an overly pessimistic outlook for the second most valuable cryptocurrency.\n\nEthereum Is Under Pressure: Here’s Why\n\nEthereum is in a bearish breakout formation at press time following sharp losses in mid-April. Although there are hints of strength, the rejection from $2,800 wasn’t enough to assuage fears.\n\nAs prices range within a $500 zone capped at $2,800 and $3,300, bulls have a chance, though sellers could also press lower, continuing the losses of April.\n\nThere are multiple reasons to support the bearish forecast. Some investors, the analyst observes, are still hesitant to get exposure to ETH because of Bitcoin and its swelling layer-2 ecosystems.\n\nThe launch of the Runes Protocol saw activity flow to Bitcoin, pushing transaction fees on the world’s most valuable network. Trading fees have fallen, as seen on YCharts on May 10.\n\nBeyond this, there are concerns that the United States Securities and Exchange Commission (SEC) might classify ETH as a security, leading to stricter regulations. Moreover, Solana, a modern high-throughput blockchain, is seen as a stiff competitor considering its surge in activity, mostly from meme coin projects.\n\nAnalyst: Here’s Why ETH Will Rise\n\nThough the threat from Solana and other low-fee and scalable platforms, on top of the United States SEC concerns, is real, the analyst is upbeat. Explaining in a bid to dismantle cause for worry, the analyst dismisses the Bitcoin layer-2 ecosystem as “trash.” Though popular, the analyst thinks it will always be inferior to Ethereum’s in functionality and practicality.\n\nBeyond this, the analyst adds that though the United States SEC threat exists, it’s unlikely to be successful. Even if it is, powerful political and economic forces like Wall Street will continue to support Ethereum’s growth.\n\nThus far, Wall Street players like BlackRock have expressed interest in issuing spot Ethereum exchange-traded funds (ETFs), which has boosted confidence.\n\nRelated Reading: XRP Ledger Validator Launched By Japanese Financial Titan: Details\n\nMoreover, the analyst downplayed Solana’s strengths, suggesting its scalability and growth might be exaggerated.\n\nSpecifically, the analyst noted the existence of equally superior layer-2 scaling solutions for the Ethereum-like Base. From a security perspective, Solana also has limited client diversity, negatively impacting the network reliability.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNVklnR085ZERZTXRta1JBaFZwWkdNbnJvbGlaSy1HYzlJQm4wdDV1UXhQV1FJZm55bnhOS09OWmNQN3FCRDFhMVdmby1Jam1hUjhnd1pWQmZOT1dRb2x0T3lMRE1FeUxBeXBhZ3YwNV81YjR5RTBvOENfUDEtSFZ1WkNxUnhRdU1ERm9MeXNFWHDSAZYBQVVfeXFMUHhOOWpNanRIQUdzYXVHN0FFMm9sc3djYTlDZ0h0Z19YVTVaRmFjY01Mb0I4cEp3MUF6aWxpQWUtTlgyQk1EWS1fbjNrYk8zSnpjN3ZsSHZDbFJUeFRZR1ZmNFhPd2J6MzhVaWRzRnJ3dXdDQ0ZVR19vbDhfbWVBMDRaem04THFyYnJFaVJ6UkFMZ2w3a3JR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Are Ethereum and Solana threatening the crypto market’s stability? - AMBCrypto News",
        "content": "Community is bearish on Solana and Ethereum, but experts are still very bullish on SOL.\n\nCrypto markets are still correcting, with most altcoins currently in the red.\n\nThe crypto market is still reeling from a strong case of the corrections, and altcoins are having it worse than all.\n\nAt press time, almost all the altcoins on the top 25 are in the red, having seen a slight decrease on daily charts. Is there a bearish storm on the horizon? Or are we still on for an altseason?\n\nSolana and Ethereum inspire bearish sentiments\n\nTwo top altcoins have stood out among the crowd, seemingly dancing with the bears. Both coins have dropped from the critical support levels of $2,995 and $145.\n\nAt the time of writing, Ethereum [ETH] was worth $2,968 and Solana [SOL] was at $141.\n\nData from CoinGecko says that the community is mostly bearish on both tokens right now.\n\nJust two days ago, Glassnode shared that Ethereum’s performance is much weaker than Bitcoin [BTC], despite the opposite being the case only a month prior.\n\nThis is a stark reversal from its previous position, where it had shown dominance over Bitcoin.\n\nEthereum’s price drop has been massive, with its deepest drawdown reaching 44% over the cycle, which is more than double that of Bitcoin’s 21%.\n\nThis highlights Ethereum’s struggles and underperformance relative to Bitcoin.\n\nThe Short-Term Holder Cost Basis for Ethereum, which typically offers support, shows that current prices are hovering very close to the cost basis of recent buyers.\n\nGlassnode warns that this situation has created a precarious scenario where any further market dip could trigger a sell-off panic.\n\nA silver lining\n\nDespite the gloomy outlook, not all hope is lost. Solana, for instance, seems to have weathered what might have been its last major correction for this market cycle.\n\nAccording to a well-followed crypto analyst known as Inmortal, the only support level Solana needed to defend is $120.\n\nHe is still expecting a rally, with his projections suggesting a climb to a new high of $320 some time later this year.\n\nFurthermore, there are indicators that Solana might soon overtake Ethereum in terms of transaction fees.\n\nDan Smith, a senior research analyst at Blockworks, suggested that Solana could surpass Ethereum in transaction fees and capture maximal extractable value (MEV) as early as this month.\n\nMEV represents the maximum profit that can be extracted from blockchain transactions through means like arbitrage.\n\nOn the 7th of May, Solana’s total economic value was reported at $2.8 million, nearing Ethereum’s $3.1 million. Elite figures like Arthur Hayes are also still highly bullish on SOL.\n\nInterestingly, however, the community seems to be highly bullish on the broader altcoin market, especially AI tokens like Fetch.ai [FET].\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nMeme coins like Pepe [PEPE] and Bonk [BONK] are still seeing new holders every single day, suggesting that investors and traders are still very much expecting a bull run for 2024.\n\nSo, yes, the bears might have managed to snatch control. But it is likely to be temporary."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQdEJUYU5PSlZDSkJwdGVSS3psUF9wLTQ0Z1RvTmItcnZoSVdVWFQxU2Q1Y3A2WkNuS1dhc3A4NHVMMjFCZXZ3ZmQxRFFaS2FyUHM4dWhqODR4b2R3NTBvakFzTldZeEN3bjh2SDd3X1JkUjNGZXoxMFR6RGtVRXRsdGJTcHNPdmNHakpzM2Q0RU0tcVRmbWfSAZsBQVVfeXFMT0l5aWNqZUpRSzZxU3l1WG9yY0k1a2pXRFAyRkxzdnFPTGFzTHFjVXFIVXk3WFNhemU5QUtWNHMxdmlaSXo1ZGJDaVRDbldjTlFOT0V3TkdNMjBWZGhXUE56STRmOVNjR0tXaEcxeldfZFp6cDdNZDd6eWdOTTl0VWFnbjQ2dEhYSk43YUJWbzdwYnQ1TVVLcXBGNHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Bitcoin vs Ethereum: How they have fared since January’s ETF approval - AMBCrypto News",
        "content": "Ethereum has recorded low capital inflows since January compared to Bitcoin.\n\nETH’s long-term holders continue to wait for a new all-time high.\n\nLeading altcoin Ethereum [ETH] has underperformed compared to Bitcoin [BTC] since January, Glassnode found in a new report.\n\nAccording to the on-chain data provider, while BTC, aided in part by the US spot exchange-traded funds (ETF), has seen significant capital inflows since the beginning of the year, ETH has recorded a decline in trading activity.\n\nETH remains in BTC’s shadows\n\nFollowing the approval of spot Bitcoin ETFs on the 10th of January, Glassnode data shows a significant divergence in Net Unrealized Profit/Loss (NUPL) between BTC and ETH.\n\nIn its report, the on-chain analytics firm noted that this suggests that BTC’s investors have captured a larger share of profits compared to their ETH counterparts since then.\n\nThe NUPL metric determines whether an asset’s holders are experiencing unrealized gains or losses. It compares the average purchase price of all tokens held by investors to the current market price.\n\nIf the market price is higher, there is a net-unrealized profit, while if it is lower, there is a net-unrealized loss.\n\nAccording to Glassnode, a significant threshold for the NUPL is when the value exceeds 0.5. This is because it signals that an asset’s unrealized profit is greater than 50% of its total market capitalization.\n\nGlassnode said,\n\n“Amidst the hype and market rally surrounding (the) approval of the spot Bitcoin ETFs, the unrealized profit of Bitcoin holders expanded considerably faster than that of Ethereum investors. As a result, the Bitcoin NUPL metric crossed 0.5 and entered the euphoria phase three months before than equivalent metric for Ethereum.”\n\nFurther, ETH has yet to see a strong inflow of new capital as BTC has since spot ETFs became tradeable in the US.\n\nGlassnode assessed the Short-Term Holders’ Realized Cap for both coins and found that ETH’s remains low.\n\nThis suggests reduced activity from the coin’s short-term investors, whose actions are known to significantly influence an asset’s price performance.\n\nThe report further stated,\n\n“In many ways, this lack of new capital inflows is a reflection of the under-performance of ETH relative to BTC. This is likely in part due to the attention and access brought about by the spot Bitcoin ETFs.”\n\nOn why this might be happening, Glassnode added:\n\n“The market is still awaiting the SEC’s decision for approval of a suite of ETH ETFs expected towards the end of May.”\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nDue to the difference in the performance of the coins, BTC and ETH’s long-term holders (LTHs) have adopted different strategies.\n\nWhile BTC’s LTHs have let go of some of their holdings to book profits following the coin’s rally to a new all-time high, ETH’s LTHs –"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOUWR3NTVuSnRhZUZJZEo3Ylo3WmhRdGZydFJ3aWdLa0ZWcGFfVkJ2RXBLaG5pemxodkJ2LWdGX0hpcnB4aEdPZ29tZ1c2UTB3Y1RaQ0V3MWdaTUpzVjU3dFJxTXM4M2FrTEJQRlNDY3o0c2hxcmpfUzlaeC1HS1BvWE9YZEFrQ25Xek8yYWg2UzR1U2pldWNB0gGkAUFVX3lxTE02ZV9jXzgzR1djU3Z3aV8zRjFjdTJXUnlqRGx5eFFuT2FMeVVDN2FhN1haNFpDR3hkRS10Z2t3THFwaFU3a2Jhblg5T3hDdFoxbkxvQ0toZEZZT2NRaEpRbExOZnB1UlVXVUpseUZ4Wk9HYWU5bWIwRkVIREFLYjAzSF83elNCWDRmemFYSERhRk02c2U0U2NuSHhhMWU1cTRsZWZ1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Dynamics: A Detailed Analysis May 09 - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9WUHBxMUZIUXE5UnJ4M1pXVW1QODNYVjlHMDE3ZXBiRjlWR2VfX2liZnhNSUtzMnlxMGVxUTBQcVFpby1iY2NCQ0ZYa3BKeU5JNklPTDVKWEdsSWQ0anhNRDkyOUVhX2FRY29iTlA1WnZPeTlWOUc4YzJCZERQdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Ethereum Dencun upgrade turns ETH inflationary again - Finbold - Finance in Bold",
        "content": "Ethereum’s (ETH) circulating supply has increased by over 37,000 ETH in the last 30 days following the Dencun upgrade. This resulted in a 0.38% monthly inflation for the leading Web3 network, which has been deflationary since January 2023.\n\nThe Ethereum network activated the Dencun upgrade on March 13, 2024, with the EIP-4844. Dencun significantly reduces transaction costs on Ethereum’s Layer-2 through “proto-danksharding.”\n\nNotably, this enhancement makes Ethereum more efficient and cost-effective for users, marking a major step forward in ETH’s adoption. Conversely, it also diminishes the burned amount of the supply from the gas fees, which had made Ethereum deflationary.\n\nIn particular, the UltraSoundMoney platform shows 37,789.04 ETH added to its circulating supply in the last 30 days. This results from 75,013.39 ETH issued as staking rewards versus 37,224.25 ETH burned.\n\nETH supply change, 30 days. Source: UltraSoundMoney\n\nEthereum: Ultra sound money\n\nThe “ultra sound money” meme surged after “The Merge” upgrade, summed with the fee-burn mechanism the EIP-1559 implemented in 2021.\n\nEssentially, investors expected ETH’s circulating supply to be deflationary if the amount burned in fees surpassed the issued amount. The expectations were fulfilled in the past two years as this mechanism removed over 417,000 ETH from circulation since the Merge, for a 0.21% yearly supply deflation.\n\nETH supply change, 603 days. Source: UltraSoundMoney\n\nDencun upgrade: Is this the death of “Ultra Sound Money”?\n\nOn that note, CryptoQuant analyzed the effects of the Dencun upgrade on Ethereum’s “ultra sound money” attribute. According to the analyst, median transaction fees were positively correlated with network activity before the Dencun upgrade.\n\nHowever, the median transaction fees have gradually diminished since the EIP-4844 implementation.\n\nEthereum: Total Transactions and Median Transaction Fee. Source: CryptoQuant\n\n“Dencun upgrade has decoupled #Ethereum’s transaction fees from network activity, reducing the burn rate even with high activity. This leads to lower user fees but challenges the deflationary mechanism set by The Merge, requiring significantly increased network activity to maintain deflation.” – CryptoQuant"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9tZjJQVklaWGhrSFA2bTllU3U4OC1ySVZBMHp6aUZuSVg0ZGpsSmJkYktOV2tieHMzdmpHRlZ6NzVZbTdXbjJYdzNJUk5sZHh1NG41a2pDakU0bHdQUzdJLWNuTGczc0ZpRkRzU1V3T29SYTZQ0gF6QVVfeXFMTnN2bkoxUGlKeHNUcFZ0RWxXZjZDdXc4SDNlQUJmbUFOUWJGaFNaQWFaUmFqOWtXajFPNmN1VmxmbmYteDlreUI4dW16RngwMTVmMk9hNGxEZmVKSURMdFpsSXFZcVQ1bU1XSVNVOEFFUUxET0dYbEpKM0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 21:01:58 GMT",
        "title": "Crypto Analyst Says Ethereum Price Will Drop To $2,500, Here’s Why - NewsBTC",
        "content": "The Ethereum price has been closing mirroring the performance of Bitcoin recently and since the Bitcoin price has been on a downtrend, the ETH price has followed. However, Ethereum on its own seems to possess more bearish fundamentals compared to Bitcoin, leading crypto analysts to believe that the second-largest cryptocurrency by market cap will fall further from here.\n\nEthereum Poised To Crash Further\n\nA crypto analyst known as Shin Forex took to the TradingView website to share an interesting analysis of the Ethereum price. The analysis, which focused on the ETH/BTC chart, unveiled some concerning developments in the ETH price.\n\nRelated Reading\n\nFundstrat CEO Predicts When Bitcoin Price Will Reach $150,000 And $500,000 4 months ago\n\nThe analyst explained that during this time, the liquidity in Ethereum has been dwindling. Instead of flowing toward altcoins like ETH, it is instead flowing toward Bitcoin. This suggests growing disinterest in Ethereum from investors and as liquidity flows to Bitcoin, Ethereum has nothing propping it up at this time.\n\nFurthermore, the crypto analyst explains that the ETH/BTC pair has now broken below its support of 0.05. Now, this drop below its support level is important given what has happened each time that it broke. Shin Forex points back to the last two market cycles, one in 2016 and one in 2019, of the ETH/BTC breaking below its support.\n\nBoth times that this has happened, a crash in the price has followed, before it can rally again. The crypto analyst does not expect this time to be any different and believes that ETH/BTC will fall below 0.04. If this happens, it will send Ethereum spiraling and the analyst has set a price target of around $2,500 for this.\n\nCan ETH Price Survive The Crash?\n\nIn the short term, the Ethereum price doesn’t look to good, especially as the altcoin is currently trending downward inside its current channel, according to the crypto analyst. However, zooming out to the larger timeframe can help give an inkling of how the ETH price could perform after the crash.\n\nLooking at Shin Forex’s chart of the last two times that a formation like this occurred, it has also set a precedent for money to flow back into Ethereum. In November 2016, the price had crashed but in a few months, there was a massive recovery as ETH/BTC rose to a new all-time high.\n\nSource: TradingView.com\n\nA similar thing happened the next time in 2019, with the crash coming ahead of a market rally, albeit a bit slower at this time. So, if this trend holds, then the ETH crash is inevitable. However, a recovery is expected that will likely kickstart the beginning of another massive rally.\n\nRelated Reading\n\nFor now, bears continue to dominate the Ethereum market and have successfully dragged the price down below $3,000. It is trading at. $2,975 at the time of this writing, with a small 0.36% decline in the last day, according to Coinmarketcap.\n\nETH price falls below $3,000 | Source: ETHUSD on Tradingview.com\n\nFeatured image from Quora, chart from Tradingview.com"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxQZkJuaHBzQUhjSW5vM01RRnRaakVzclJMOE50a1k3MkNTX2M5V2NXNWNGV0M5R3E4MU1nTFZsSklLbkctT05mdXZsVGlkOWpFS1Z2RTEtRndfWXlYYkJ6UUNMdEJ6RXRzdmhwMnFPbm5YWU9ZUWNUWkZOMWYwa0ZNSEoxVUZxTmF1d2tPNmt5dzRpNGpFUndIekx0aTFLSEZSYnhMODFJYnRXNVc4YjV4YzVTS3lvckNSZTBzUllZYl8yTko4dlJsS05HTjkxMzNIalQ5V2EwTG94TFVTZVRCWg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Solana vs. Ethereum: Lower Fees & Rising Altcoins - Crypto Reporter",
        "content": "Solana (SOL) is emerging as a formidable contender to Ethereum (ETH), driven by its lower fees and high-speed transactions. As the crypto space eagerly anticipates a potential shift in dominance, two coins, ENA and ALGT, stand out as promising candidates ready for significant growth.\n\nWith Solana’s rise and the promising prospects of Ehtena (ENA) and Algotech (ALGT), investors are keenly observing the market for opportunities that could potentially reshape the landscape of decentralized finance (DeFi).\n\nSolana closing in on Ethereum: Transaction fee race and network challenges\n\nThe Solana network appears to be gaining ground in transaction fees, potentially signaling a significant development in its rivalry with Ethereum. According to Dan Smith, a senior research analyst at Blockworks, Solana might surpass Ethereum in transaction fees as early as this week. This shift could mark a milestone in Solana’s quest to be dubbed an “Ethereum killer.”\n\nCaptured maximal extractable value (MEV), a measure of profits mainly garnered through arbitrage trading, is also expected to tilt in favor of Solana soon. On May 7, Solana’s total economic value nearly matched Ethereum’s, standing at $2.8 million compared to Ethereum’s $3.1 million.\n\nDespite these strides, Ethereum still leads in daily transaction fees, with over $2.75 million generated in the past 24 hours compared to Solana’s $1.49 million, as per DefiLlama data. Additionally, Solana’s total value locked (TVL) remains relatively small at $3.94 billion, accounting for about 7.4% of Ethereum’s $53 billion TVL.\n\nLaunched in March 2020, Solana promised to address Ethereum’s scalability issues with a claimed throughput of 50,000 transactions per second. Unlike Ethereum’s layer-2 (L2) scaling solutions, Solana adopts a monolithic approach to scalability as a standalone blockchain network.\n\nHowever, Solana’s approach has faced criticism, particularly due to previous outages. In early April, a surge in demand for memecoins led to approximately 75% of Solana transactions failing due to network overload. Additionally, on Feb. 6, block production on Solana halted for about five hours before engineers and validators managed to restart the network, according to Solana’s status page.\n\nEthena surges: AI-Driven Algotech emerges as top cryptocurrency pick\n\nLike Solana, Ethena (ENA) and Algotech are ready to lift off, currently ENA trading at $0.9012, marking a 2.96% rise in the past day and a notable 17.46% increase over the previous seven days. With a market capitalization of $1.37 billion, ENA secures its position among the top 100 cryptocurrencies, according to CoinMarketCap.\n\nAlongside Ethena analysts are favoring Algotech as a superior long-term investment. The company distinguishes itself in the cryptocurrency realm by seamlessly integrating artificial intelligence (AI) into its framework, a unique feature absent in traditional DeFi projects. This integration empowers users with AI-driven trading strategies, minimizing errors, and amplifying market analysis for improved trading outcomes.\n\nAlgotech’s profitability has been showcased, rewarding early investors with significant returns. Participants in the initial presale phase acquired tokens at $0.04, witnessing a doubling of their investment as the token price surged to $0.08 in the current third stage. As the presale progresses to its final fourth stage, it continues to allure new investors with an anticipated 87.5% increase, targeting a listing price of $0.15.\n\nIn addition to its technological innovations, Algotech enhances its appeal through promotional giveaways, featuring high-end Apple products. This initiative not only attracts potential investors but also fosters engagement and incentivizes participation in the Algotech ecosystem.\n\nFor further details about Algotech:\n\nVisit Algotech Presale\n\nJoin The Algotech Community\n\nDisclaimer: The statements, views and opinions expressed in this article are solely those of the content provider and do not necessarily represent those of Crypto Reporter. Crypto Reporter is not responsible for the trustworthiness, quality, accuracy of any materials in this article. This article is provided for educational purposes only. Crypto Reporter is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Do your research and invest at your own risk."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNZF83eFRKUVBmT0x1UllZRHVRWmNSQkVrdzhZdnV6S2o5Z1lPeDN4aDdsYWF3RGhxSkdmUmZuRFN1Q3dCdkdNN2t6LTNpckZIRWJlcWk5OU42bk5sZXRJdGRSVDcwRERBMFF6Z1phcFhONmRTVmVBRmFXaGFjS3d2d0pucw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Can SOL flip ETH? Solana surpasses Ethereum in DEX volume - Finbold - Finance in Bold",
        "content": "In a significant shift within the decentralized exchange (DEX) sector, Solana (SOL) has recently outpaced Ethereum (ETH) in daily trading volumes, sparking discussions about its potential to challenge Ethereum’s long-established dominance in the cryptocurrency market.\n\nAs of May 8, Solana’s 24-hour trading volume reached $1.314 billion, slightly edging out Ethereum’s $1.29 billion. This development not only underscores Solana’s expanding influence in the DeFi sector but also highlights its potential to be a leading market player.\n\nNFT trading surge and market dynamics\n\nOn May 8, the daily count of non-fungible token (NFT) traders on Solana reached a multi-month high, with 123,426 traders engaged, according to CryptoSlam. This marked a 111% increase from the previous day’s count of 58,405 traders.\n\nSolana NFT Sales Volume. Source: CryptoSlam\n\nDespite this vibrant activity, Solana’s NFT market experienced a 16% decline in sales volume on the same day, totaling $3.01 million, down from $3.5 million. This drop coincided with a 7% decrease in Solana’s value between May 7 and 8, with the price standing at $153.3 at press time.\n\nThe fluctuating price potentially makes buying and minting NFTs more accessible but could deter high-value transactions, particularly from investors speculating on price appreciation.\n\nEconomic value and the potential to outpace Ethereum\n\nDan Smith, a senior research analyst at Blockworks, highlighted an emerging shift in economic dynamics. On May 7, he noted that Solana’s total economic value from transactions was nearing that of Ethereum, particularly in terms of transaction fees and Maximum Extractable Value (MEV).\n\nMEV represents potential profits that validators can secure through strategic transaction orders. Solana’s advantage in MEV is bolstered by its lower fees and faster transaction speeds, which enable more frequent and cost-effective arbitrage opportunities compared to Ethereum.\n\nAlright you guys really ran with this one without any evidence but here's the data\n\n\n\nDefining \"total economic value\" (shill me better names) as total transaction fees + captured MEV returned to validators\n\n\n\nYesterday\n\nEthereum: $3,165,772\n\nSolana: $2,803,313 https://t.co/sZAvN0MCUV pic.twitter.com/QqXStScrvk — Dan Smith (@smyyguy) May 7, 2024\n\nOn May 6, the combined figures for Ethereum stood at $3,165, while the exact figure for Solana was not far off, at $2,803. Smith’s analysis suggested that Solana could “flip” Ethereum soon, perhaps within a week. Moreover, Solana’s fees have reached 50% of Ethereum’s over recent days, a sharp increase from just 1% during the 2021 bull run.\n\nHowever, this strategy is not without its drawbacks, as Solana’s network has faced congestion issues, with a high transaction failure rate of about 60%, raising concerns about reliability and consistent execution by validators.\n\nChallenges ahead\n\nDespite these advances, significant challenges remain for Solana. Its total value locked (TVL) as of May 10 was $4.14 billion, substantially lower than Ethereum’s $53 billion.\n\nSolana has also suffered from multiple outages, including a notable incident on February 6 when block production halted for approximately five hours due to overwhelming demand. These reliability issues could undermine confidence in Solana’s long-term stability and operational efficiency.\n\nAs Solana’s MEV extraction capabilities grow, it presents both opportunities and challenges. Increased front-running risks and higher transaction costs could affect traders negatively, while enhanced validator incentives might spur further demand for SOL.\n\nWatching how Solana and Ethereum will adapt and compete in this evolving market remains a critical area for both investors and enthusiasts in the DeFi space.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]