[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFB6SUpaUmM5Rk85QkpoMWo0UThkR0NVWE9XMnBCUE53WVdRNVQ3TFBBUzFGbWZnWG9XZTRrNTZpdzB0TUg0X1VtUDI4cGg5NFdNNTVmQnFnZW1TbDVSbU9NWWZoTVRMd3lN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "SEC closes investigation into Ethereum 2.0, no securities charges against ETH: Consensys - Crypto Briefing",
        "content": "SEC's decision marks a turning point for Ethereum, likely confirming its commodity status.\n\nShare this article\n\nThe US Securities and Exchange Commission (SEC) has wrapped up its investigation into Ethereum 2.0 and will no longer pursue legal action claiming that ETH sales are securities transactions, according to a recent announcement from Consensys.\n\nConsensys said this is a major win for Ethereum developers and businesses. It removes a cloud of uncertainty that could have hampered Ethereum’s growth.\n\nIn March, an update on the Ethereum Foundation’s GitHub repository revealed that the organization was under investigation by an unnamed “state authority.” After the discovery, Fortune reported that the SEC pursued an “energetic legal campaign” to classify Ethereum as a security.\n\nUncertainty intensified after Consensys filed a lawsuit against the SEC in April. Part of the company’s effort was seeking a court ruling that would declare that Ethereum’s native token, Ether (ETH), is not a security.\n\nFOX Business reported in late April that the SEC’s Enforcement Division, headed by Gurbir Grewal, initiated a formal investigation into Ethereum’s status as a security in March 2023. The investigation, known as “Ethereum 2.0“, explores transactions and activities associated with Ethereum dating back to 2018.\n\nAs noted, the SEC’s latest decision comes after Consensys sent a letter to the SEC arguing that the recent approval of spot Ethereum ETFs implies ETH is not a security, and the SEC should close the investigation. The move likely hinged on considering ETH a commodity, much like BTC, and signifies no forthcoming legal challenges.\n\nDespite this progress, Consensys said the quest for definitive regulatory guidelines continues, especially concerning services like MetaMask Swaps and Staking. The team is still seeking broader clarity from the SEC on crypto regulations.\n\nOur fight continues. In our lawsuit, we also seek a declaration that offering the user interface software MetaMask Swaps and Staking does not violate the securities laws. It should not take a lawsuit to provide the much-needed regulatory clarity to allow an industry that serves… — Consensys (@Consensys) June 19, 2024"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE85WGUxVl9GSWdKVGRyTE9maTlYaEVTakJCUHM5Q2doM1JoT0FMUDRBbHpFYUR5ZHNmT0RLd05BS2xZVGtqbHlCQV9PMzEwWHI4alNDZG1abGZnQUtuODBRaUJJdkhaZ1J0dFhqMGJIR1JOTkdOWlpZQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "SEC drops investigation into Ethereum studio Consensys - Blockworks",
        "content": "Ethereum fans can breathe a sigh of relief.\n\nThe US Securities and Exchange Commission (SEC) has formally dropped its investigation into the blockchain’s ecosystem.\n\nEthereum development studio Consensys shared the news on X overnight.\n\n“Today we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0,” the company posted.\n\n“This means that the SEC will not bring charges alleging that sales of ETH are securities transactions.”\n\nLoading Tweet..\n\nIndications of an SEC probe into Ethereum and entities supporting the protocol circulated in March, when Fortune reported the agency was investigating three unnamed related companies for potential securities violations.\n\nConsensys then sued the SEC one month later, alleging regulatory overreach. The suit claimed chairman Gary Gensler sought to grab power over the crypto space, using legal maneuvers that would force ETH into a security definition following its switch to proof of stake in September 2022.\n\nPart of those filings disclosed that Consensys had received a Wells notice from the SEC, indicating the agency’s intent to sue. The Fort Worth firm, which owns popular web3 infrastructure including crypto wallet MetaMask and API provider Infura, was founded by Ethereum co-founder Joe Lubin.\n\nWhile the SEC probe was expected to be dropped following approval of a suite of spot ether ETFs last month, the formal notice puts to bed one of crypto’s primary existential threats, at least for now.\n\nFormer SEC chair Jay Clayton had initially backed SEC Director of Corporation Finance William Hinman’s notion that ether was no longer a security in 2019, as there was no central entity in control of the cryptocurrency at the time. No official statement had been given by the agency, however, and Gensler had seemingly been walking back those thoughts ever since.\n\nOn Wednesday morning, Alexander Grieve, government affairs lead at venture capital firm Paradigm, tweeted a copy of the SEC’s letter to Consensys. It reads:\n\n“We write to provide notice that we have concluded the investigation in the [matter of Ethereum 2.0]…. based on the information we have as of this date, we do not intend to recommend an enforcement action by the Commission against your client, Consensys Software Inc. with respect to this investigation.”\n\nLoading Tweet..\n\nThe letter added that the notice was given under guidelines in the Securities Act which state that it “must in no way be construed as indicating that the party has been exonerated or that no action may ultimately result from the staff’s investigation.”\n\nAll good news for Consensys but other legal threats still loom over crypto. So far, there’s no word of the SEC’s Uniswap probe being dropped, although a lawsuit has not yet been filed.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the Forward Guidance newsletter.\n\nGet alpha directly in your inbox with the 0xResearch newsletter — market highlights, charts, degen trade ideas, governance updates, and more.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOYmVJSlVSYnhFcTJJS2hILU5qWUdqaFUtVU5KU1BQUUViS2IybDhITUtKMlZQcjhoaVA2RlBGbW11Z19lTDg5bXVGZGpQNkl6WXBhVlV3Q2RvU3M0NEp6a2Q4TWVyQ3UxOXE4X0tYWnBJa0RCUmtMZlR0Mk9CNHdXdHpTZTNXUUtZYWROTzdKSUlxa212SWNUX0hxUkxyeUlNXzVzcnh1ZmVyQ1Bzbkow?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Consensys CEO Joseph Lubin Says SEC Closes Ethereum Inquiry - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxORmJUSV9kRWRkQXlDM3BQUllwa3RfMV9IZFBpSF95bmU3Wm9IZm5oT1dYYnBzdHNUVVpEQzVVM24xVlVfTGNFdEdzV2JUcS1CM25TT21KZlU2OW5pRDBuSHFpSk1FTUFBV3FlRE5HcF94NTh5UGhhSjZ5bTV6dXFtSlI1azY1M3lsWXh0UV84X2J6bkRLWG1zUUwxYUdBT0R6WTZHWV9pSdIBrAFBVV95cUxNT1lRRkZKcENCaWYtSml1S1JoUHhuWFlfeUN0bFZWWlIwdzRYajYzdVRsYlhLV3BKNk5pU1daaTVkSVBicncxb3kwclhQeFJER2tURGl1Ui13X1k4a3BsbmNPOHhWdi1jRzB3MkxYaFQ0OVhiT2ZNSnYwd0tNcXpMWmJ6TlF3Y1FhQ1JZbGFxdTlIc0t5al9yZ3RlQnVrTkdaNUlGNTNHRWN0WXJp?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "SEC Is Closing Investigation into Ethereum as a Security - Finance Magnates",
        "content": "Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights\n\nRelive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more!"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQNVJGQ1NwZXd1TXl5WkxOVFdpSEFaMmNDc2loSktxeHk2d0drN0xtZi1Jc3JkZ0otMUk3bWRYOEEtN0p3OWRFZkVURlo4NnpaYklYMENPVy1BNHVFUkhnYksxeE5WWUxHYk4tRzhfSGNCV2FTbk02eFEtLXdYUHRKNVFxaEtLbzRVY29VMzdTSGwzckc4a3VZbUwxMDRYMW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "What Will Allocations Look Like in Combined Bitcoin and Ethereum ETFs? - Unchained",
        "content": "After the first combined ETF was filed today, what will other issuers do regarding the allocation to BTC and ETH?\n\nAs the first combined BTC/ETH ETF was filed, what can we expect from future allocations?\n\nOn Tuesday, as the market eagerly anticipates the full approval of spot Ether ETFs, Nasdaq filed for a combined Bitcoin and Ethereum ETF. This new ETF, managed by Hashdex, will allocate 70.54% to bitcoin and 29.46% to ether. These allocations are based on the relative free float market capitalizations of bitcoin and ether.\n\nBut, is this the only way newly combined ETFs will allocate to bitcoin and ether? And what impact might this have on the market?\n\nRead more: There Are Now 11 Spot Bitcoin ETFs. Here’s the One That’s Best for You\n\nWhy Combined ETFs Matter\n\nThe introduction of combined BTC and ETH ETFs is significant for several reasons. Firstly, these ETFs offer investors diversified exposure to the cryptocurrency market without having to choose between Bitcoin and Ethereum. This diversified approach might attract more inflows, especially from more conservative investors, as it mitigates the risk associated with investing in a single asset. By holding both BTC and ETH, investors can benefit from the possible upside of both leading cryptocurrencies, potentially stabilizing returns compared to single-asset ETFs.\n\nThe structure of combined ETFs could also impact the prices of BTC and ETH. As these ETFs gain popularity, increased demand for the underlying assets could drive up their prices. If there are ETFs that allocate more to one asset or another, it could be positive for that specific asset.\n\nNate Geraci, president of the ETF Store, explains that the success of broad commodity ETFs suggests that combined crypto ETFs could find a larger audience “due to the novel nature of the category.”\n\n“Some investors and advisors will prefer a diversified approach to an emerging asset class like crypto versus attempting to pick winners and losers,” Geraci told Unchained. He believes that once additional crypto assets are available in an ETF wrapper, such as SOL or XRP, we can expect to see various index-based and actively managed strategies.\n\nAllocation Strategies\n\nGeraci believes that, as in the Hashdex ETF, the division should be reflective of their respective market caps. “Ether is currently valued at about one-third the market cap of Bitcoin. I think that’s a reasonable proxy for what spot Ether ETF demand will look like compared to spot Bitcoin ETF demand,” Geraci told Unchained. And despite the lack of staking options in the initial spot Ether ETFs, Geraci believes this won’t significantly deter demand.\n\nHowever, Geraci also expects the emergence of multiple flavors of combined BTC and ETH ETFs, including market cap-weighted and actively managed products. “Market cap-weighted products will hold BTC and ETH in the proportions described above. Actively managed ETF holdings will be dictated by the manager and prevailing market conditions,” he notes, indicating potential variability in allocations based on market dynamics.\n\nScott Johnson, general partner at Van Buren Capital, suggests that combined BTC and ETH ETFs might feature a 50/50 split or follow some type of index-weighted approach. “To the extent these come online in the near term, you might see a 50/50 or some type of index-weighted allocation,” Johnson told Unchained via email.\n\nLooking at other markets, such as Canada, where crypto ETFs have been available for several years, provides valuable insights. For example, the Evolve Cryptocurrencies ETF is weighted on a market capitalization basis and rebalanced monthly. As of the latest data, this ETF allocates 71.90% to Bitcoin and 28.10% to Ethereum.\n\nMeanwhile, CI Financial offers the CI Galaxy Multi-Crypto ETF, an actively managed ETF, and uses a rules-based, momentum-signaling strategy, allocating roughly 50/50 to BTC and ETH.\n\nLearn more: Bitcoin ETFs Explained: What Are They & How Do They Work?"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE00dUZrWGJSR3BBYVhSSHpZT0JUMktKTFdWMExmWm9mNzAwMEEzUEgta0ZVTDVjWFhpaXNlUUh6YXVHVUhqS0NXazNrWlFzelU0cmxCOGRMVnZ5cUo5QjFKZ3AyQXpYdVBITFNxa3lfQW1KdVB0MGhvUHNqWWpaTlU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Ethereum secures ‘major win’ as SEC drops investigation - crypto.news",
        "content": "Ethereum has achieved a “major win” as the SEC closes its investigation into Ethereum 2.0, confirming that sales of ETH are not considered securities transactions.\n\nEthereum, the second-largest crypto by market capitalization, has scored a significant victory as the Enforcement Division of the U.S. Securities and Exchange Commission (SEC) announced the closure of its investigation into Ethereum 2.0, blockchain firm Consensys said in an X post.\n\nETHEREUM SURVIVES THE SEC.\n\n\n\nToday we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0.\n\n\n\nThis means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nThe SEC’s decision means that the agency “will not bring charges alleging that sales of ETH are securities transactions,” Consensys explains.\n\n“The closing of the Ethereum investigation is momentous, but it’s not a cure-all for the many blockchain developers, technology providers, and industry participants who have suffered under SEC’s unlawful and aggressive crypto enforcement regime.” Consensys\n\nYou might also like: Ethereum price teeters on the edge: will the spot ETH ETF approval trigger a massive rally?\n\nThe latest development comes after a Jun. 7 letter to the SEC from Consensys, which requested confirmation that the recent approval of spot Ethereum exchange-traded funds (ETFs), assuming ETH to be a commodity, would result in the closure of the Ethereum 2.0 investigation.\n\nDespite the positive outcome, the battle for regulatory clarity between Consensys and the SEC continues as the blockchain firm is seeking a declaration that offering user interface software such as MetaMask Swaps and Staking doesn’t violate securities laws.\n\nThe closure of the investigation marks a significant step forward for Ethereum and the whole industry, which has been grappling with regulatory uncertainties and enforcement actions lately. Following the news, ETH price soared 3% and is now trading at $3,555, according to data from CoinMarketCap."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPTzEzT2I4ZjJxVUpYeXJmcVJiYXV2eUcxVW1BUzlNd3R2aE4zMWF1ZG5OREZMLS1pT3JpLWVpSk1xVjZ5d2pHazlDNUhhM0NHMEZRb0w1R2hZcEUxYUNzRTYwdGpIR25Ob3ZISXZ1ekV6WVp3M2NfSGJNaXJpU1A1SE03a2dSbEw5dFppd0FraEJHLUp3Tnhxb0x6WDDSAaIBQVVfeXFMTjkzZnJaVWcxU2k5THVFQnh2bGhEYzdSY3dsd1VtOTZGS1hxLW9scFFjcUhyXzRmMzNzc2xCdkJjRkVqbVQ5TXUxeWllOUdEczFocXRRck5fM3dIbVBfRFNFSGlHX0VHc3hMY0RyOVUyNHUwTHNtZHl0VmVWTklPNTdWZ01aUGVuLW1QRlZZYVFWMzlGTG93QzAyR3VacUlWYVJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "SEC Ends Probe Into Consensys, Won't Sue Over Ethereum - CoinDesk",
        "content": "\"The Commission is instructing its staff that in cases where such action appears appropriate, it may advise a person under inquiry that its formal investigation has been terminated. Such action on the part of the staff will be purely discretionary on its part for the reasons mentioned above. Even if such advice is given, however, it must in no way be construed as indicating that the party has been exonerated or that no action may ultimately result from the staff’s investigation of that particular matter,\" the letter said, citing a Wells Notice explainer on the SEC website ."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNcndpVm5nVVZ4Wm9ESENadUVtZHlfZmhLN1JteHE5YjRfM01SdnVVR0ttNVNVUEtLMlpXSWhzTDB3NlpMaXdOcU50aWhBdXRXSzczdEFvUnVQbFdGclFFR1V3SzRPWTN0eW81V1JCUnJ6Q21LTnR2enpsMGZVOE4wazNlMUdYcEdJdU9xZzJlY3k4MkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Consensys: SEC Closes Investigation Into Ethereum - Yahoo Finance",
        "content": "Consensys: SEC Closes Investigation Into Ethereum\n\nLeading Ethereum developer Consensys revealed late Tuesday that the U.S. Securities and Exchange Commission (SEC) has decided to close its investigation into Ethereum 2.0. This announcement marks a pivotal moment for Ethereum developers and the broader crypto industry.\n\nThe decision follows the SEC's approval of Ethereum spot ETFs last month. Consensys had responded to this approval by sending a letter to the SEC, pointing out that the funds were based on ETH being classified as a commodity. The letter sought clarification on how this classification would impact the ongoing investigation.\n\nLaura Brookover, an attorney for Consensys, took to Twitter to share the SEC's notification letter along with the company's full statement. \"Things have changed remarkably fast since we filed our lawsuit against the SEC in late April, culminating in today’s development,\" Brookover wrote. \"After more than a year, the Ethereum investigation is finally over with no charges against anyone.\"\n\nDespite the positive news, the SEC's correspondence included a standard disclaimer, noting that the conclusion of the investigation should not be interpreted as an exoneration or a guarantee that no future action would be taken.\n\nWhile the closing of the Ethereum investigation is a significant victory, Consensys remains critical of the SEC's overall approach to crypto regulation. \"The closing of the Ethereum investigation is momentous, but it’s not a cure-all for the many blockchain developers, technology providers, and industry participants who have suffered under the SEC’s unlawful and aggressive crypto enforcement regime.\""
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPS05iOGpSWW4tRHlkM2VLXzhzMFg4am14MG1kMWpiZGlYN1hBSDZfZjlKWV9XUmJ4eUgxR182eW45X1BDb20xa1NyNkVCNjNVV1p0OFJndElxYUx6ZUk3TE8tcGw0YnhGbF9BUzZuSXVLTlp5bl9WcDNKSUpkOWV6U1BfaFl3RWlXZnRKNGN2bERlSnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "US SEC Closes Ethereum 2.0 Investigation: ConsenSys - Crypto Times",
        "content": "The U.S. Securities and Exchange Commission’s enforcement division has closed its investigation into Ethereum 2.0, which Consensys Software Inc. announced as a major victory.\n\nOn X, Consensys posted relief over the SEC’s decision, stating “This means that the SEC will not bring charges alleging that sales of ETH are securities transactions.”\n\nETHEREUM SURVIVES THE SEC.\n\n\n\nToday we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0.\n\n\n\nThis means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nThe SEC’s decision follows Consensys’ letter dated June 7, seeking clarification after the approval of spot ether exchange-traded funds (ETFs) in May. These approvals, while pending finalization, signaled the SEC’s view that ETH tokens are commodities rather than securities, as per Consensys’ explanation.\n\nConsensys said, “While we are gratified by the SEC’s decision to stand down on Ethereum, there is more work to be done to protect crypto in the United States.”\n\nConsensys sued the SEC in April this year, alleging that the SEC’s Director of the Division of Enforcement, Gurbir Grewal, initiated the Ethereum 2.0 investigation in March 2023 to probe ether transactions.\n\nAlthough SEC Chair Gary Gensler has not directly stated ether’s security status, Commodity Futures Trading Commission Chair Rostin Behnam has classified ether as a commodity.\n\nConsensys has not wavered from its position and continues to argue that its lawsuit also seeks to declare that products such as MetaMask Swaps and Staking user interface software are not in violation of securities laws.\n\nThis is a positive development for Ethereum and the blockchain industry as a whole as it indicates a favorable regulatory environment for decentralized technologies."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBLeU5sVmo0eGJfcnFUNXNESWwwV1kzUjBqUHcwUGIxUzhsRjFFQVBjakRiNTc4YmpVYl9UM2JGZGYxc1BMMFdWUlZQM2c3dE1HRDVXQVhVZGFwb1V4ZEpHQUo4MW5xam1lX2dTZ1lySGJ2dGpm0gF6QVVfeXFMTmpONk8xSVdJNTgtUWhwNEZDc0hhQUhvQk5RcW5BWjVmRThOS21GRUtBV1NadVdkRGdyYXpTRzlRN1hxTTI5M2FwbVVjVDdBc1VFMUthekhfM0cwYlU5UExMUnpTSHVScVVjaGx0MGgxQjVnSzlxbGxkcVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Ethereum's price soars as SEC probe concludes - Forkast News",
        "content": "Ether’s value surged past US$3,500 as the U.S. Securities and Exchange Commission (SEC) wrapped up its investigation on Ethereum.\n\nThe conclusion of the SEC’s investigation, which did not result in any charges related to Ethereum’s sales as securities, has been met with enthusiasm from investors and the Ethereum community.\n\nThis development comes after Consensys, an Ethereum developer, contested the SEC’s regulatory stance, advocating for Ethereum’s classification as a commodity.\n\nConsensys’ legal challenge, initiated in April 2024, sought to limit the SEC’s regulatory reach over Ethereum and to obtain a judicial declaration affirming its commodity status.\n\nThe culmination of this legal battle, combined with public and political support, prompted a favorable outcome from the SEC’s Enforcement Division on June 18.\n\nThe resolution of the SEC’s scrutiny lifts a major uncertainty that had been casting a shadow over Ethereum, potentially impacting its classification and market demand.\n\nThe announcement of the investigation’s end was met with an immediate response in the market, with Ethereum’s trading price climbing to $3,586, according to CoinGecko.\n\nThe SEC approved a series of spot Ether exchange-traded funds (ETFs) last month, paving the way for their trading on the stock market.\n\nAnnounced on May 23, this decision came amidst legislative efforts to define the regulatory roles of the SEC and the Commodity Futures Trading Commission in the crypto industry, with the Financial Innovation and Technology for the 21st Century Act still pending in the Senate."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNd1o1alo1ejhoZmQwMzVNTTZjdEc2THNEOW5GeHk4cFo5RE9uOV9fcVlvTEVJRktieE5UMGhtQ0tjMks4Sy10bThRRVpmcGlUTVdqNmZwem11WW5WY1JKNmJ4Nkt5X1VadmJmVjE1Tkw4ZXhCQnpDT0kwVGZ1eVh6ZG8xTDU4VFJOVnV2ZjFGOThjakswYVNFOFhLVW05d2FnMkFsQ0k2bWQwdjg4V3BJcjhaU0UtaUxqcllRV0RFNXpLbG1HX0RnWXJR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction – SEC’s Ended Investigation Could Spark Bull Run to $5.5K - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNeV9Xa1pVWWNHek1LN0J3ZjFwc1NqdkFHZHJzZTF4T25QYTZMY1VjWUJ0ZUdSR3NxWEhubFcyT01FY2xyQ0pPdkdkMUlfT2JkTHl6dVlKc1VpUjhZVUJJT3VYUlBnVzhBLVFPU1pwR2t5Ymx0NWpsaGRucFJCUk13TldOaU5zellqVWZ4UDgtYVNSbHFaVld1cW1CQ2M4R0ZCb0hXT1E0OFFKcmd4Y2stMG9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Ethereum gets huge win as SEC closes investigation into securities sale allegations - CryptoSlate",
        "content": "The SEC has closed its investigation into Ethereum 2.0, determining that sales of ETH are not securities transactions. The decision comes after a letter from Consensys on June 7, seeking clarity following the May approvals of ETH ETFs, which were based on ETH being classified as a commodity. Consensys stated,\n\n“Today we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0. This means that the SEC will not bring charges alleging that sales of ETH are securities transactions.”\n\nEthereum rose over 4% overnight following the news, pulling the rest of the crypto market with it as many projects positive over the past 24 hours. Bitcoin is the notable exception, down 0.74% according to CryptoSlate data as of press time.\n\nConsensys announced this development as a significant victory for Ethereum developers and the broader industry. The closure of the investigation signifies a pivotal moment for the Ethereum community, providing a reprieve from potential regulatory actions that could have categorized ETH as a security. The SEC’s decision aligns with the Commodity Futures Trading Commission’s (CFTC) stance, which has consistently classified ETH as a commodity.\n\nDespite this positive outcome, Consensys continues its legal battle against the SEC to secure further regulatory clarity. The company argues that the SEC’s enforcement actions against blockchain developers and technology providers have been overly aggressive and unlawful. Consensys’s lawsuit also seeks a declaration that offering user interface software like MetaMask Swaps and Staking does not violate securities laws.\n\nAs Consensys emphasized, the legal fight is not just about Ethereum but about safeguarding the future of blockchain innovation in the United States. The SEC’s stance on Ethereum had posed a risk to adopting and developing blockchain technologies, with potential negative implications for US leadership in this sector. By challenging the SEC’s authority, Consensys aims to prevent what it describes as an unlawful power grab that could hinder technological advancements and economic opportunities.\n\nThe resolution of the Ethereum investigation marks a critical juncture, but Consensys insists that the broader regulatory environment still requires significant reform. The company’s lawsuit highlights the need for clear guidelines that support innovation while ensuring compliance with existing laws. As the blockchain industry evolves, resolving these regulatory issues will be crucial in determining the pace and direction of technological progress.\n\nAccording to Consensys, fighting for regulatory clarity is essential to ensuring blockchain technology continues growing and contributing to the economy. The company’s actions reflect a broader concern within the crypto community about the need for balanced regulation that fosters innovation without stifling growth.\n\nIndustry participants and regulators alike will closely watch the outcome of Consensys’s ongoing legal battle with the SEC. The case highlights the tensions between regulatory oversight and technological innovation, a dynamic that will shape the future of blockchain technology and its applications.\n\nMentioned in this article"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQVXdiUG12X2Vadm9nenlRWHFWWXd2S1hpZ3p4QTNJNElxRF9ETHRuYVA2a2ZWYTV5YWVoWExnYVFrZkhKUmt3RGxtRDVSMEw1WEhRSG1oRVZpUE11SjBnTUpOUmRqOTlpdHhpYUVtcUpaeVJuRENTelhjbGVnYUdBRUQ1YTFiM2wzeEtwQ3VVRUxxdlJ0YzBPc094dFJCa2VQVjROVEZnZ3JqZWhxTXM5NF8xc0NYbUJI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Crypto Token Ether Rallies on Claim About SEC’s Ethereum Probe - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPUlJPR29sSnZQeEdndHdlTEpfX1hEVUYyVl9mR3dLTVl1VHY4Yy10dHdxbFpOdVBqdEF1c01zOWNXM08xOXcxVk5TUXVnOGVwTzBnVVkyQTVQbVE5RWxjX0xEUzFBU1I4NzRSbEhSTFVETXhuTDAyVEllM0xSMkxXLThxM0pkdWtE0gGOAUFVX3lxTE1BSU0zMjhQb1dKcXRPRTJVMjAydU9nRXVocFVkRWtPVGNUWWNCRDlMUU16c1RmUTMzTnBUZG1Uc0NUQTN0d3Y4dnBNZmd0T3ppV01KdXlaak1IQVhQeGRaZ0VzX3VFWUk2YTNPRmNZR1lQWEpId3BEOE1Oam8yd2c1cWZlUHJ4d3llQlBVWkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum stablecoin volume drops: Will it impact ETH prices? - AMBCrypto News",
        "content": "Stablecoin volume on Ethereum fell to $40 billion, indicating the potential of leading the cryptocurrency to a bear phase.\n\nThe MVRV Long/Short Difference, alongside holders’ sentiment showed that ETH’s price might increase.\n\nStablecoin volume on the Ethereum [ETH] blockchain has dropped from $84 billion to $40 billion, according to data from CryptoQuant. When the volume of stablecoins increases, it means that demand for tokens on a blockchain might increase.\n\nAlso, when this happens, it strengthens the native cryptocurrency of the ecosystem. For Ethereum, the drop in volume indicates that most ERC-20 tokens have been underperforming.\n\nETH holders don’t believe in bears\n\nERC-20 tokens refer to the fungible tokens created using the Ethereum blockchain. Historically, if the stablecoin volume plummets to $30 billion, ETH falls into a bear market. Therefore, the risk was present.\n\nAt press time, ETH’s price was $3,517, representing a 4.18% decrease in the last seven days. While there have been predictions that the price would revisit $4,000, that has not happened in weeks.\n\nBesides this, AMBCrypto looked at the LTH-NUPL. LTH-NUPL stands for Long-Term Holder- Net Unrealized Profit/Loss. This metric assess the behavior of long-term holders.\n\nTypically, the metric considers UTXOs with at least a lifespan of 155 days. According to Glassnode, Ethereum’s LTH-NUPL was in the belief (green) zone.\n\nThis indicates that holders of the token are convinced that the price might increase.\n\nIf this conviction remains the same in the coming weeks, then ETH might not fall into a cycle. Instead the price of the token, backed by demand, could be looking at hitting a new all-time high.\n\nWill rising volatility lead the price higher?\n\nThe Market Value to Realized Value (MVRV) Long/Short Difference is another metric that can tell if ETH is in a bear zone or not.\n\nWhen the reading of the metric falls into the negative region, it means that a cryptocurrency might have dropped to the bear market.\n\nBut as long as the metric remains positive, the cryptocurrency is in a bull phase. At press time, AMBCrypto observed that the MVRV Long/Short Difference was 35.50%.\n\nWhile this was a decrease from the reading last month, it was a sign that ETH has not succumbed to the bear zone. However, one cannot deny that it implies that ETH’s price might fall.\n\nBut if it does, the value of the cryptocurrency is unlikely to slide below $3,000. If this remains the case, ETH might have a chance at retesting $4,000 and beyond.\n\nMeanwhile, the one-day volatility has begun to increase. Volatility measures how rapid price can move in different directions. When volatility increase with buying pressure, price can jump to incredible figures.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nOn the other hand, high volatility will selling pressure leads to correction. For ETH, it remains uncertain where the price would head next.\n\nHowever, something seemed almost certain, holders might not give in to bearish demand that drive the price lower than expected."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE05VlY3V2V3c3Fld25xZ2pnLTRFVXM1OWEzRWpyZnRyRDVNOTZqUzJMYnZmMGVwaTRjSUlaUTdHUXA3blVkcmJWMjNwX3FtQ2hWdktMUjlBVGNQN25lYUY3aGN1a0NXa2d6NVdTdklMNVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "The dark side of tokenisation - Financial Times",
        "content": "Print this page\n\nThe writer is a law professor at the American University Washington College of Law\n\nTraditional financial institutions are increasingly showing interest in “tokenising” real-world assets, meaning they are curious about how these assets could be digitally represented by programmable tokens recorded on shared ledgers. There could be real efficiency gains associated with tokenisation, but the drive towards it could also take a dark turn.\n\nThe most dangerous outcomes would arise if tokenisation of real-world assets were pursued simply to feed into what has been described as “the perpetual motion machine that is crypto trading”. Regulators around the world have expressed concerns about the integration of crypto and traditional financial markets, because of the high levels of volatility, leverage, concentration and operational risk associated with the crypto markets. This integration would be sped up if ownership of tokenised real-world assets were recorded on so-called permissionless public blockchains. The type of ledger favoured by the crypto industry, these blockchains can be accessed by any computer running the necessary software to host them, no identification or vetting required\n\nThe tokenisation of real-world assets can and should proceed without using these problematic blockchains. Their inefficiencies are well documented, and experimentation to resolve problems in scaling their use tends to focus on processing transactions off the blockchain (defeating the stated goal of decentralisation).\n\nIt is perhaps less well appreciated that these kinds of blockchains are also plagued by governance problems. We cannot simply trust in the code of the blockchain. Public permissionless blockchains are “designed by people, maintained by people, and governed by people”, as one research paper put it. but we don’t necessarily know who these people are, who pays them, or if they’ll show up in an emergency. This is an untenable position for critical financial infrastructure.\n\nUnfortunately, BlackRock has chosen to host its tokenised Buidl fund on the public permissionless Ethereum blockchain. The good news is that some other financial institutions have taken a different path, and are experimenting with other kinds of ledgers to see if tokenisation yields efficiencies in their markets.\n\nEfficiencies can arise from programmability, meaning that software known as “smart contracts” can be built into the tokens to allow for the automation of functions, like interest payments. Smart contracts can also be used to build bespoke financial products out of multiple tokenised assets — this is known as composability. Ownership of tokenised assets can also be split into smaller pieces in a process known as fractionalisation. When ownership of all tokenised assets used in a single transaction is recorded on the same ledger, the transaction can be settled “atomically”, or simultaneously, 24/7.\n\nCross-border payments seem particularly ripe for improvement through tokenisation, but we shouldn’t rush to tokenise everything. Some purported benefits (particularly those relating to financial inclusion) are overhyped. And where efficiencies gains are real, they can invite corresponding fragilities. Even when divorced from crypto, there is a dark side to tokenisation.\n\nTokenisation promises to bring more real-world assets into the financial markets, and to engineer them into new categories of bespoke financial products both big (through composability) and small (through fractionalisation). This may unlock liquidity and efficiencies in good times, but we learned in 2008 that illiquidity, deleveraging and fire sales will be on the menu when things turn south. Discretion and forbearance (for example, with regard to margin calls) are often critical to containing the damage in these circumstances, but obligations automated with smart contracts will inflexibly self-execute regardless of context.\n\nIn addition, smart contract software provides another attack surface for hackers, and the more comprehensive the underlying ledger, the more attractive a target it becomes for cyber attacks. Atomic settlement also deprives markets of the benefits of netting of transactions.\n\nIf we think back to 2020, we learned the hard way that supply chains could become brittle when the unexpected occurred; now there is increasing interest in production strategies that are less efficient, but more resilient. We should explore tokenisation with the same mindset. We need to ask “when something is efficient enough, will making it more efficient introduce too many fragilities and be counterproductive in the long run?” In the best-case scenario, tokenisation experimentation will spur the financial industry to start thinking intentionally about this question.\n\n."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPVXliS1doV3c4aGplT1lOYXczcHBhazFIZUw3WTdqU3hWd0lHQ2paUUJQaWFoU2JpRkx6VjRwLVA1dFdQWEhhWnJfLXg5ZWVkS1BaMXRKcG5wS0prNXlrczRHUzZleFRDcmhZS3lGVlRJTFBXYkh1Y3BOVnZfcGJyUUVVblkydW9ZaGJBZWVLVnhHWDJCMmfSAZsBQVVfeXFMT1ZjZ1QtRFpvdXBQdThZazZyd2Q1bGxCUXMzdTF0dnQ2ZHhHcTVFYmVxUC1ETFVfU3lNWVI2cGtWVzlYOXNqYnJaNHpGV0t3NkFTWFpWdVRrYkg3ZnBrR3phTVNNbUtVNVgxTDhQTUwyOGJ0cUR6cE9ybjhnZzREd1ZIdjFVcndoanNUYy1YS0NWdERIVE5DUmo0ZHM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Ethereum 2.0 Case Closed by SEC: Major Win for Developers - Crypto News Flash",
        "content": "The SEC has closed its investigation into Ethereum 2.0, clearing ETH from being classified as a security.\n\nDespite the SEC’s decision, ConsenSys continues its lawsuit for regulatory clarity on MetaMask Swaps and Staking.\n\nToday saw a big boost for the blockchain community as top Ethereum development firm ConsenSys revealed a critical milestone for Ethereum.\n\nConsenSys has received notification from the U.S. Securities and Exchange Commission (SEC) that it is closing its Ethereum 2.0 investigation. The continuous discussion about securities laws and cryptocurrency rules has reached a turning point with this ruling.\n\nETHEREUM SURVIVES THE SEC. Today we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0. This means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nSEC Drops Ethereum 2.0 Investigation\n\nConsenSys announced that the Enforcement Division of the SEC has decided against filing charges claiming that ETH sales qualify as securities transactions.\n\nThis result follows a June 7 letter from ConsenSys asking the SEC to verify that the May approvals of ETH Exchange-Traded Funds (ETFs) signaled the end of the Ethereum 2.0 inquiry because ETH is a commodity.\n\nBlockchain researcher Collin Brown and many other cryptocurrency enthusiasts applauded the announcement. ‘Ripple (XRP) will follow, knowing they are on the right side of history,’ Brown said. The crypto community, which has long been scrutinized by the SEC’s strict enforcement system, shares this opinion in large measure.\n\n🚨BREAKING 🚨#Ethereum 2.0 gets the green light! SEC closes investigation, confirming ETH is not a security. Big win for developers and the crypto community! 😎#Ripple (#XRP) will follow, knowing they are on the right side of history! pic.twitter.com/vwqATokhkL — Collin Brown (@CollinBrownXRP) June 19, 2024\n\nConsenSys underlined that the fight is far from finished, even with the SEC’s ruling. The company is still suing to have the MetaMask Swaps and Staking user interface software declared to not be in violation of securities laws.\n\nConsenSys said that obtaining the regulatory certainty required for the blockchain sector to flourish—which is essential to many new technologies and innovations—should not require a lawsuit.\n\nCurrent Market Reaction\n\nThe news is helping ETH’s price. CoinMarketCap reports that the price of ETH at the moment of writing is at $3,567.10, up 3.48% over the previous day. With a 1.26% increase over the last week, ETH has remained bullish, reflecting robust market confidence in the wake of the SEC ruling.\n\nPrevious to this, CNF reported on updated estimates from Bloomberg ETF analyst Eric Balchunas that Ethereum ETFs may start trading as early as July 2. This move strengthens confidence in Ethereum and the larger crypto market by offering a more controlled and stable setting for business expansion.\n\nRecommended for you:"
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPV1c4NlRmTDNLWXlZOUVMN3czZGpwWWxkY2dQRU1fbm8zS3BSamFrSkhuTlZrZlV3NzFKYWZBQ1VzSXRobDZBckRzTXd1bjdScEZVdnhoMS1wQ2lmeUFRWmxUdVU0OGc5QlVFNnRLRm5vZ3F0M3VVSnR4bzJXZUtGTTd2UXc2R29OSDZBM2VJejRUUdIBlwFBVV95cUxPdGVPYndzZkx3VVc4LXZ5OGRJc0RYdjI0UlVsS2FTRDR5MnVHUEh3Y0ZnUmRsLTgwRDN5MWRPLXlpd0IyNVVocXhhMEVfYXNVWFlHbDNrTUU0WTJjdnZaNXZydWVuOGo0YXg0clh1V0Ewc2RyQkdSVnFhTlBCbUJTUkFRaDVBS0pKZHlMVG9hQ0E5T0dZTU8w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum whales are on the move: What does it mean for ETH’s future? - AMBCrypto News",
        "content": "Ethereum whales accumulated large amounts of ETH in the last few days.\n\nDevelopments for Ethereum ensued, price remained stagnant.\n\nEthereum’s [ETH] price has remained stagnant over the last few days, despite this, whales have shown interest in the ETH token.\n\nEthereum whales move in\n\nThe number of Ethereum wallets holding significant amounts of ETH has been on the rise.\n\nAccording to Santiment’s data, over the past four weeks, there’s been a massive increase of over 3% in Ethereum addresses that hold more than 10,000 ETH.\n\nWhales hold a substantial amount of ETH, and their buying activity can significantly influence market sentiment. If they continue accumulating, it can drive up demand for ETH, potentially leading to a price increase.\n\nThis can attract further investment, creating a positive feedback loop and propelling the price even higher.\n\nWhile whales can contribute to price appreciation, their actions can also introduce volatility.\n\nIf these large holders decide to sell a significant portion of their ETH holdings in a coordinated manner, it could trigger a sudden price drop, causing panic among smaller investors\n\nNew developments on the network\n\nApart from whale interest, another factor that could impact Ethereum significantly would be the developments occurring on the network. In the most recent developer call, multiple aspects of the Ethereum network were discussed.\n\nThis meeting of Ethereum developers addressed upcoming advancements to the Ethereum blockchain. The discussions centered on three primary areas Electra, PeerDAS, and SSZ-related improvements.\n\nElectra is the name for a series of upgrades to the Ethereum consensus layer, which coordinates validators on the network. The call addressed the nearing completion of code for the next Electra version and upcoming testing phases.\n\nPeerDAS refers to a planned modification to the Ethereum network’s communication system. This would allow nodes to process and validate larger amounts of user data.\n\nDevelopers are planning separate testing phases for PeerDAS to ensure its stability before integrating it into the main network.\n\nFinally, the call touched upon SSZ, a technical specification for data encoding. Several improvements related to SSZ are being developed, and their potential inclusion in a future major upgrade is being explored.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nLooking at the price\n\nAt press time, ETH was trading at $3,524.08 and its price had declined by 1.08% in the last 24 hours.\n\nDespite the dip in price, the volume at which ETH was trading at had surged by 30%."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE41V1Z0bTMyMXkyWUF4M2xvVjl2Q1BNUThIUG96S0FYLTVxM2lzRllVMjFMSEw5cGFOU3p2bXRrY0VZUDhySkpCSFVHZzBQM0NvUnBQbWtkZkRNaHExRmF6dVp2Tnp2YUh6dXlKVTNMd1F3RDR3Ny11andnSdIBgAFBVV95cUxNSDhpWjZYenYzd1g3dmlUMjBrdnNTU3VEM3BUUlNjOE1veWxCejlzRkNKTndZWU5KeGVBS2c5M1ZoMjJpRTN3dGZMZ0RRaXZhZ1NNN2xXWVo5MndWb3NyeG5MZnlpeHZ0bmc1VUxFbFpyVUtfOXlMbGFmS3VaQ2ZmUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Wins As US SEC Ends Securities Investigation - Bitcoinist",
        "content": "The crypto industry received a significant jolt of clarity and optimism as the US Securities and Exchange Commission (SEC) concluded its investigation into Ethereum 2.0, announcing that it will not pursue any enforcement actions. This decision marks an important victory for Ethereum and could serve as a critical reference point for the treatment of digital assets under US securities law.\n\nEthereum Is Not A Security\n\nIn 2018, the SEC made a key distinction that Ether was not a security. However, by 2023, amidst evolving functionalities and the transition to Ethereum 2.0, the SEC revisited this stance, hinting at possible regulatory oversight. This shift led to increased scrutiny and uncertainty within the Ethereum community, culminating in a lawsuit filed by Consensys on April 25, 2024. The lawsuit aimed to confirm the classification of ETH as a commodity, arguing that the SEC lacked jurisdiction over its trade and governance.\n\nIn a pivotal response dated June 7, 2024, Consensys urged the SEC to acknowledge the approvals of Ethereum-based ETFs made earlier that May, which were predicated on the assumption that ETH is a commodity. Consensys argued this should conclusively end the SEC’s investigation into Ethereum 2.0.\n\nThe SEC’s Enforcement Division officially responded on June 18, 2024, as communicated in a letter addressed to Kevin S. Schwartz, attorney for Consensys. The letter stated, “We write to provide notice that we have concluded the investigation in the above-referenced matter […] based on the information we have as of this date, we do not intend to recommend an enforcement action by the Commission.”\n\nImportantly, the SEC underscored that this closure should not be seen as an exoneration or that no action may ultimately result from the staff’s investigation. Nonetheless, Laura Brookover, a lawyer at Consensys, underscored the significance of this development, stating, “The SEC sent us a closing letter in the Ethereum 2.0 investigation today. Things have changed remarkably fast since we filed our lawsuit against the SEC in late April, culminating in today’s development.”\n\nThis resolution can be perceived as a critical moment for the broader crypto industry, particularly in how digital assets are classified and regulated. Alexander Grieve from Paradigm noted the tone of the SEC’s notification, commenting, “They’re pretty hedge-y/evasive in their notification—BUT it is relatively unusual for the SEC to specifically highlight to a company that they’ve closed an investigation.”\n\nThe closure of this investigation without enforcement action could set a precedent for how other cryptocurrencies are treated by regulatory agencies, potentially easing the regulatory environment for digital assets.\n\nWhile the immediate threat of an enforcement action has been alleviated, Consensys and the wider crypto industry are looking towards further clarifications in regulatory policy. Consensys in their lawsuit also seeks a federal court ruling regarding their operations, asserting that they do not act as brokers nor issue securities through their software offerings like MetaMask Swaps and Staking.\n\nAs stated in their lawsuit, “Consensys is built on creating software products that allow people around the world to use and build on top of the Ethereum network, and it is entitled to run its business without the cost, burden, and uncertainty of an unlawful enforcement action.”\n\nAt press time, the price of Ether (ETH) has responded favorably to the SEC’s decision, showing a notable increase of 3.3%, bringing it to a current trading price of $3,561.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxNSUNlTzB6dnFzTXpkNTEtbU9zakdWc1c0Q2dTTktxd0p3dTE2dDgwMGN5R2RaVndKSlpnZkstVk1yNW9LUzRFYW1QOG41STA4M2lXZWt0MXphb1pRcEVycFFSTTlHTDZHQ2FoR1NZQ3kwZlZEU2dJakJlYTRpNTVXN1NqY1hBRUNGeTVONG5JTkxPVTRFN2tqVk5kNXlXc3I2eENvcXBvY1o4Uk5BczA4OURDSjdTSE5OakxtVTZtaksyVkEwUmJYSjdVd0VtNzJ6QVRrQVBWejEzQ3ByaDBlWXdraGY5UnRFcW9OMlowOEHSAfYBQVVfeXFMT2ZOMzl4N2d6RVN6TkxidmM4Wi1uNXB2cUhLTllxN2VYWFFFR0QtaVZoZUxxZEd4eXlONUJhakNHQ1JqSGtQbGhpMUdPcEIzZkpHZTVQd0o0NjhmdXFuQmJabnNaZ1I1V3pJRDZwSEVTaTU3VDhjcXRtVk9UOHFmQTNHZTJVcTdLV0dUVnhzUDI2QW90RTBMQVFUdlQ5eHAzNjc1ZkRsVExBX3ZOZWpVZlFieEJfcHpnNm41c0V1NXg0eGJEQ2tNbUFHVmkwS0ptalJHX1FVbENxNUhnWFFtcDd6M3Ricmw3QVIyTEhyZVU1dThiNTh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin technical indicators signal bullish momentum - FXStreet",
        "content": "Bitcoin price action shows a bullish divergence on a momentum indicator.\n\nEthereum price finds support around $3,362 price low from Friday.\n\nRipple price faces rejection by its daily resistance level of $0.499 level.\n\nBitcoin (BTC) price action shows a bullish divergence on a momentum indicator, signaling a forthcoming bullish trend. Ethereum (ETH) and Ripple (XRP) are poised to mirror Bitcoin's trajectory, preparing to breach resistance levels and rally upwards in tandem.\n\nBitcoin price action indicates bullish momentum\n\nBitcoin price was rejected by the weekly resistance level of $67,147 on Monday and fell by 2.2%. BTC is currently supported by its 50% retracement level at $64,274, calculated from the swing low of $56,523 on May 1 to a swing high of $71,995 on May 21.\n\nIf BTC bounces off $64,274, it could rally 4% to reach its previous resistance level of $67,147.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator (AO) support this aforementioned bounce. The lower low formed in the 4-chart on June 18 does not reflect the RSI's higher high for the same period. This development is termed a bullish divergence and often leads to the reversal of the trend or a short-term rally.\n\nIf the bulls are aggressive and the overall crypto market outlook is positive, then BTC could extend an additional rally of 6% to reach its previous resistance level of $71,280.\n\nBTC/USDT 4-hour chart\n\nHowever, if Bitcoin's price breaks and closes below its daily support level of $60,800, the bullish thesis would be invalidated, leading to a 4% decline , its weekly support level of $58,375.\n\nEthereum price shows potential for a rally\n\nEthereum price finds support around Friday's low of $3,360, which is currently trading at $3,533. The $3,360 low roughly hovers the 61.8% Fibonacci retracement level at $3,279.\n\nIf this support holds, then ETH price could rally 3% from its current trading price of $3,533 to tag its previous high of $3,717 on June 9.\n\nThe Relative Strength Index (RSI) breaks above its mean level of 50 in the 4-hour chart, and the Awesome Oscillator (AO) is on its way to doing the same. If bulls are indeed making a comeback, then both momentum indicators need to maintain their positions above their respective mean levels. Such a development would add a tailwind to the recovery rally.\n\nIf ETH closes above $3,717, it could extend an additional rally of 6% to reach its previous resistance level of $3,977.\n\nETH/USDT 4-hour chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $3,292 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 13% crash to the previous support level of $2,864.\n\nRipple price poised for a breakout\n\nRipple's price faced resistance at $0.515, its 50-day Exponential Moving Average (EMA), on Monday and fell by 3%. XRP is currently trading at $0.495.\n\nIf Ripple price breaks above the 50-day EMA at $0.515, it could rise 7% from $0.499 to $0.532, its previous high from June 5.\n\nThe Relative Strength Index (RSI) in the daily chart is below the 50 mean level, while the Awesome Oscillator (AO) is below its zero line. If bulls are indeed making a comeback, then both momentum indicators need to maintain their positions above their respective mean levels of 50 and zero. Such a development would boost the recovery rally.\n\nIf the bulls are aggressive and the overall crypto-market outlook is positive, the XRP price could extend an additional 9% to $0.581, a 50% price retracement level of $0.419 and $0.744 from March 11 to April 13.\n\nXRP/USDT 1-day chart\n\nOn the other hand, if Ripple's price produces a daily candlestick close below $0.450, the daily low from June 7, the move would invalidate the bullish thesis by making a lower low on the daily time frame. This development could see XRP's price decline 7% to the April 13 low of $0.419."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPUkxfWXk5aWc4TlJuVFB5SEpvTXhpUEo3c19pcmJMRWFtSHlVRFhUNG8xQllzdVU1dkhVcy1iZDB3VFhzTkFOcFFTS3hqUEdmMU5XUEdVQUhUSjBDaUZ4WmV1LXByNDRTcHdHUlFKWVM4Mkh0WFozUHBZZGJLcURDa2MxVG9HQzJwdUIyVXAxdFR5R1IzNmfSAZsBQVVfeXFMTlE4dGxzNjlULUg0NmZvamZBRTRZVzFPaTZRbjI4OElwajZqOUdCM21jZklkbFFCcHN0dDROV0RMalpWQ0stZExkdDRkN2N0Tm5fR043QlVIZTZabUFCckljYjQxUmgyU2lNQllVbTR1Z3NFNVNEbXlxS3hVSFR3VDE1blVPY3RCSUplOEdfcTR1ZjB6R3dxMFdmUU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "3 Reasons Why SEC Can Approve Spot Ethereum ETF S-1 Filings By July 2 - CoinGape",
        "content": "The U.S. Securities and Exchange Commission (SEC) is expected to approve the long-awaited Spot Ethereum ETF filings by July 2. This move comes amidst several key factors aligning towards regulatory clarity and increased market interest in crypto-based investment products. Moreover, Bloomberg analyst Eric Balchunas had previously revealed that they have pushed the potential Spot Ethereum ETF S-1 approval date to July 2.\n\n1. ConsenSys Vs. SEC Investigation Resolution\n\nOne pivotal reason behind the anticipated approval of Spot Ethereum ETF filings is the recent progress in regulatory discussions between ConsenSys and the SEC. ConsenSys, a prominent blockchain technology company, sought clarification on the SEC’s stance regarding Ethereum’s status as a security. This came in the context of their ongoing investigation into Ethereum 2.0.\n\nadvertisement\n\nThereafter, the SEC announced the conclusion of this investigation. This development signals a significant shift in their approach towards Ethereum. Moreover, the resolution of this investigation is crucial as it sets a precedent for Ethereum’s regulatory status, potentially mitigating concerns over its classification as a security. With ConsenSys paving the way for regulatory clarity, the SEC may view this as a favorable signal towards approving Spot Ethereum ETFs.\n\nAlso Read: Breaking: Bitwise Files Amended Ethereum ETF S-1 After SEC Feedback\n\n2. Spot Ethereum ETF S-1 Amendments by Applicants\n\nAnother key factor influencing the timeline for SEC approval is the proactive approach taken by ETF applicants such as Bitwise. Recently, Bitwise diligently amended their S-1 filings in response to feedback from the SEC. They addressed regulatory concerns and enhancing transparency in their proposed ETF structures.\n\nNate Geraci, the host of ETF Prime, expects other applicants like VanEck, BlackRock, Franklin Templeton and others to mirror the move within this week. In case other amendments gush in, the Spot Ethereum ETF S-1 approval could be expedited.\n\nBitwise’s recent amendment, for instance, detailed significant investment commitments. This included a $2.5 million seed investment from Bitwise Investment Manager, LLC. Moreover, expressions of interest from institutions like Pantera Capital Management LP underscore the robust market demand for Ethereum ETFs, despite being non-binding.\n\n3. SEC Chair Gary Gensler Hints At Summer Approval\n\nSEC Chair Gary Gensler‘s public statements have also influenced expectations regarding the approval timeline for Ethereum ETFs. Gensler previously indicated that approvals for such products could be expected “over the course of this summer.” This underscores the SEC’s proactive stance towards embracing innovation while ensuring investor protection.\n\nWhen revising the potential approval date, Balchunas even hinted at an earlier approval. In a post on X, he wrote, “Decent chance they work to declare them effective the next week and get it off their plate before the holiday weekend. Anything is possible but this is our best guess as of now.”\n\nHowever, as of now, the week hasn’t seen such a big leap despite the recent S-1 amendment. Nonetheless, the approval remains imminent as hinted by market analysts.\n\nAlso Read: Hashdex Files 19b-4 For Combined Spot Bitcoin and Ethereum ETF\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOZmlPcVRFUkF4YXBESk40UVhkdXY2bnR3eG5zOTZnWVVQcVBrYVkzWFFEWldMTW1RTFU3WU9aT1ZTdzV0N0gwaXVTNk1RdXRtcUxnUTlLT3c2ZzJpZGEzTzNrZDJjbTlUczZCaGNrN0E4V01BRzQtRXQweXY2MVVEenlwcVpNdGtFSU10eTdTVUY3bVJzOElwd0dn0gGfAUFVX3lxTE1TaTNUU092SkIwMnRLZWY1MHJFUUdSRXVGT1pMb3ZqN3NEZnZSLXIxUGVoaWFoR0tKUVVXdmR1SFhwTEtqVHBuUmpMbmRmQUVqNC10Vl9kZnVRaG1CVjV6eWFIbUIyd0RYc3F3QkpVM1VIeDJSTHRFR2FMaDhERUYxTkJ0SXN5aUF4R2pVX2hSWkpZTm5SOFUzZm5EX0s3aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "This Crypto Investor Lost Nearly $4M in Ethereum (ETH) to Armed Robbers - CryptoPotato",
        "content": "A cryptocurrency investor based in London has lost almost all his digital asset investments to armed robbers following a physical attack in his home.\n\nAn X post by the victim, pseudonymously named Ram, revealed that the three thieves were armed with machetes and forced him to transfer all his crypto to certain accounts.\n\nInvestor Loses $4M Crypto to Robbers\n\nAccording to Ram, the robbers were aware of his residence and knew he had crypto. Upon arrival at his home, they forced him to open his Ledger wallet and transferred over $3.7 million worth of ether (ETH) to their addresses. Ram said he was lucky not to get stabbed.\n\n“This just happened – 3 guys physically robbed me at my home. They were armed with machetes. They knew I had crypto and knew where I lived…I’m still in a state of shock. This is one of the worst experiences of my life,” the crypto investor stated.\n\nData from Etherscan shows the transactions moved 1,098 ETH from one address and 13 ETH from the other. With ETH trading at around $3,400 at the time of writing, the stash is collectively worth more than $3.77 million.\n\nDue to the theft, Ram’s wallet addresses now hold less than $63,000 worth of crypto assets, including StakeWise (SWISE), Unibot (UNIBOT), USD Coin (USDC), Staked Aave, and FOX.\n\nKraken Investigating Incident\n\nThrough his tweet, Ram sought the help of on-chain sleuth ZachXBT and crypto exchanges Binance, Coinbase, and Kraken to recover the funds. Digital asset influencer and investor James Crypto Guru revealed that the thieves were selling the assets on Kraken through the Bitrefill payment gateway, tagging the exchange’s support team to look into the matter.\n\nIn response to James’ tweet, the Kraken Support team disclosed that they were investigating the situation; hence, Ram faces the possibility of recovering some of his stolen assets. Ram’s experience highlights the importance of investors keeping mum about their crypto holdings.\n\nWhile offline crypto thefts are rare, online attacks have remained on the rise. Recently, decentralized finance protocol UwU Lend and omnichain tokenization platform Holograph lost $20 million and $14.4 million, respectively, after attackers exploited vulnerabilities in their smart contracts."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE81OHpEWVdKX08zd1RYNDN0akhENFVzZ0c3bUJwNXl4WE9HZDdQSUNuNnZnSGNscHRiUndvM1NIMEc4RlV6a2NXcU1DYlFhdlpKbjlMVHNzX19jZU1oOGEzN011a253c3hYZ2xzS3R0VGcyTnFZZWFMZ19IdVFjdG_SAYQBQVVfeXFMT2FIc0lldVdWaHg2UWJZUDJIYVA2Vk9ER2dITGRtOG04NmxjbmdKUk10UjRqdjJMTDF3MnNCWm5wOTFGeV9WOWlpQVB2ZHVlZmVRTlFJSU9yaDVUZVVCMVNGbHlEQVNUX053aTJTOWVFNWxJdkxoaWJqQjFGRGkydGJrQ0x3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Altcoin dominance at 9%, drops 15% in 30 days: What now? - AMBCrypto News",
        "content": "Altcoin dominance has declined by 15% in the last month.\n\nThe demand for ETH remained significantly low, putting the altcoin at risk of a further price decline.\n\nAltcoin dominance has cratered by double digits in the last month. At 9.88% at press time, it has fallen by 15% in the past 30 days, according to TradingView.\n\nAltcoin dominance refers to the relative market share of all cryptocurrencies, excluding Bitcoin [BTC]. Its decline means that the total market capitalization held by altcoins was decreasing compared to BTC.\n\nThis may be because investors are moving their funds from altcoins to BTC, which they perceive as a safer and more stable investment asset.\n\nAltcoin dominance waning?\n\nIn times of market consolidation like this, altcoin dominance may decline while Bitcoin dominance increases, as altcoins lose value or fail to attract investors.\n\nHowever, BTC’s dominance has yet to record any significant growth within the one month considered. As of this writing, its value was 55.36%, declining by 1.03% in the last month and 0.69% in the last seven days.\n\nAMBCrypto reported earlier that this gradual decline in BTC dominance is due to the strong resistance the coin faces at the $70,000 price level.\n\nETH remains at risk of decline\n\nAt press time, Ethereum [ETH] traded at $3,561. According to CoinMarketCap, the altcoin’s value has surged by 14% in the past 30 days, despite the general decline in altcoin dominance in the crypto market.\n\nAn assessment of the coin’s performance on a daily chart revealed that it broke below the support level of $3693 on 10 June and has since flipped it into resistance.\n\nEven though it has managed a mere 1% price hike in the last week, ETH’s price has since oscillated within a range, with new resistance formed at the $3693 price level and support found at $3428.\n\nConfirming the general decline for ETH among market participants, its key momentum indicators were positioned below their respective center lines at the time of writing.\n\nFor example, ETH’s Relative Strength Index (RSI) was 48.60, while its Money Flow Index (MFI) was 29.59.\n\nThese indicators measure oversold and overbought market conditions by tracking an asset’s price changes.\n\nAt their values as of this writing, they suggested that selling pressure was significantly higher than buying activity.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nIf the decline continues, ETH risks falling to $3496.\n\nHowever, if invalidated, its price might rally toward $3658."
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNZ24tVlN0Ym9wVUtyclF1WUxVYU1kYm8xczBoUFFVUkU3d29mYzRWZXZJRDJGV1VSMWRVdHV2QzFqeHNQR2MzdnlnSmw1ZjItRklMTW9mMHlaS2JYMGdQSi1yMkFDREN4LXkwMzBPWTBJRkZpWHBpckJsZ0Y2TndmR0NUSVBuRVlGdVJKams5UUZySExramdZalNtZ0RwUWMyQk9rYWxLMXh5UVhU0gGyAUFVX3lxTE5PNjQ5LW5PUGVweHktZWF2WTRTTXFhRmhGb1hIOXdkS21DcUhLTWFRS2VJVVozeEFyZmJhV0Vjd0RyLUx5U2NFN0JNOFpBeGpYc3lScGlIVzBHY1dWXzNycnJUNmFPQUlObzlKUjhDaG1uRDNqdFNma2x0cXhFNXBBWXcxSUc3NndyM0hNUDZ5ZGNaUmNsdWlJZVpGakhhdWNXWGp1X0lham1CeUl1ODhWMmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Crypto Prices Today June 18: Bitcoin Nosedives To $65K, Ethereum Sinks 5% Amid Bearish Market - CoinGape",
        "content": "The crypto prices today rode a bearish wave as Bitcoin (BTC) slipped to the $65K mark, whereas Ethereum (ETH) showed signs of a pullback. Altcoins Solana (SOL) and others mainly followed, with Dogecoin (DOGE) and Shiba Inu (SHIB) meme coins noting a dip of 9%-13%. However, XRP traded in the green, defying broader market trends.\n\nThe global crypto market cap saw a significant 3.14% decline to $2.35 trillion, although the total crypto market volume from yesterday spiked 104.01% to $94.07 billion. This follows whopping outflows recorded across the crypto sector, triggered by the U.S. Fed’s recent hawkish stance.\n\nadvertisement\n\nHere’s a collection of some of the top cryptos and their price movements today, June 18.\n\nTop Crypto Prices Today\n\nBitcoin Price\n\nThe BTC price chart illustrated a faded movement today, nosediving to $65,374.98, down 1.39% over the past day. The token’s 24-hour bottoms and highs are $64,597.25 and $67,252.08, respectively.\n\nBitcoin’s dominance stood at 54.87%, a 0.93% jump over the past day. The token boasted a waned market cap of $1.29 trillion. This drop comes in the background of nearly $146 million outflows recorded in the U.S. spot BTC ETFs, per data by Farside Investors.\n\nEthereum Price\n\nETH price traded primarily in the red in the past 24 hours, falling 4.39% to $3,428.45. The token’s 24-hour lows and highs are $3,371.59 and $3,591.67, respectively.\n\nEthereum boasted a market cap of $419.50 billion.\n\nSolana Price\n\nSOL price corrected 9.25% over the past day to trade at $134.26 at press time. Solana’s 24-hour slumps and peaks are $130.16 and $148.95.\n\nXRP Price\n\nHowever, the Ripple Labs-backed crypto noted slight gains of 0.33% over the past day to reach $0.4893. XRP’s 24-hour lows and highs are $0.4808 and $0.5194, respectively.\n\nDOGE & SHIB Prices\n\nBesides, the meme coins sector mimicked the broader market’s tumbled movement. Dogecoin (DOGE) fell 9.74% from yesterday to $0.122, while Shiba Inu (SHIB) fell 12.12% to $0.00001802. Further, Pepe coin (PEPE) plummeted 11.84% to $0.00001055.\n\nAlso Read: GameStop (GME) Plunges 13% After Unexpected Announcement From CEO\n\nTop Crypto Gainers Today\n\nThe only top gainer for today was XRP, per CoinMarketCap’s data, with its price action facilitated above.\n\nTop Crypto Losers Today\n\nzkSync (ZK) price crashed 30.23% to $0.2002.\n\nFantom (FTM) price plummeted 20.69% to $0.5013.\n\nEthena (ENA) price plunged 18.89% to $0.6021.\n\nStarknet (STRK) price dipped 17.82% to $0.7444.\n\nMeanwhile, it’s also worth mentioning that BTC and ETH noted gains in their hourly timeframe charts, underscoring a tussle to gain upside momentum. Similarly, altcoins SOL, XRP, DOGE, and others followed.\n\nAlso Read: Ex-SEC Official Denies Joining Memecoin Platform\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNN3prRFRuRlpFNmFPYm1tdEg1TW5RWGxQQkpyLTUtTmtZVlFBeXU0LUFiUThQOEY1cjVfV0ZTVzZyaThSUi1yU3Azem0taktlNU02SkJITmJmRERweC1Vck5laVlybTJ4ZFF5MDhUQkN3dFZIdXFWZFUxQTl2cUNULTFwaVl4Tmk2V3lFV1dxWGg3T05CNUw5M2hEUE9wQmVBSmlxMDhHWUwzSlBaNkHSAbMBQVVfeXFMTVJ0MnFVcnduN1JfTEE2MmJ2Sjd6Z052Q0J4SWhyTENoQVhRTDJsYUVEYWdkRS1sUGNMNTJqby1YeGxkajV1YVBFdVh0M1BFTjU0LVNQUjI2RzRiRlhTMGRGY3JYSmdGTFk4ZVQwMkZTc2Z2anRYUVVrY2M5VnpmbFMweEFRLXhJSUxRb0dfbGROeVBKclhyTWFTdEplWE5OSGlMUVN2Q3RpS0NBZGJJOVFYUk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Is ETH in Danger of Falling to $3K or Will the Bulls Wake Up? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has landed on a decisive and substantial support region following a brief consolidation correction stage, with potential for a bullish reversal.\n\nHowever, if Ethereum sellers breach this pivot, a cascade in the market is likely.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA closer look at the daily chart shows that Ethereum has reached a pivotal support region after a brief consolidation correction stage. This region encompasses the price range between the 0.5 ($3421) and 0.618 ($3289) Fibonacci levels, aligning with the substantial support of the 100-day moving average ($3412). T\n\nThe alignment of these support indicators highlights the strength of this critical level and the prevailing demand at this juncture, which could halt further downward pressure.\n\nA battle between buyers and sellers is expected at this pivotal price range, leading to heightened market volatility and potential liquidations. The outcome will likely determine Ethereum’s upcoming trend. If sellers overcome buyers and breach this crucial support region, a cascade toward the 200-day moving average at $2996 will be imminent.\n\nThe 4-Hour Chart\n\nOn the 4-hour chart, Ethereum formed a head and shoulders pattern, resulting in increased selling activity and a break below the pattern’s neckline.\n\nThis development and a bearish divergence between the price and the RSI indicator have heightened bearish momentum, leading to a significant downward movement. Following this, Ethereum has formed a descending flag pattern, a well-known bullish continuation pattern if breached from the upper boundary.\n\nCurrently, the price is hovering around a critical and decisive support region marked by the 0.5 ($3420) to 0.618 ($3289) Fibonacci retracement levels and the flag’s lower boundary. This area is experiencing intensified volatility and fluctuations.\n\nIf sellers break down this crucial support, an impulsive downtrend targeting the $2.9K support is expected. Conversely, if sufficient demand returns and shrinks the existing supply, a reversal towards the flag’s upper boundary at $3.6K will likely occur.\n\nSentiment Analysis\n\nBy Shayan\n\nEthereum’s price has experienced heightened selling pressure near the $4K mark, leading to a significant decline. This likely stems from participants’ aggressive interest in opening short positions near this pivotal level. Analyzing the potential liquidation levels is crucial for determining the mid-term price targets.\n\nAs the chart demonstrates, a significant amount of liquidity resides above the crucial $3.9K mark, potentially representing buy-stop orders from notable short positions around this critical juncture. This liquidity region is likely to be the main target for buyers if demand returns to the market and the price experiences a bullish reversal near the $3K threshold.\n\nReaching this crucial liquidity range would likely lead to increased market volatility and potentially trigger a short-squeeze event, where short positions are forced to cover, driving the price higher. Nevertheless, if the selling pressure continues and Ethereum fails to reclaim higher levels, the price may continue to consolidate or decline."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNalBualVGMkY0bnVsdmFHeDgtMkx4SkNJZllid2xHWS1pM1BOXzdRZUtIT0drZGZWaTVJZTBUTEZBNXFib3llV0FTZE5lV2xXY0J4eEdPZzU2emFmWG42Q0VMZjZpNGdCZFpMXzNyTzZOOHY0Z2ZPWXdqVmtyZmhIbk5lT05wV2vSAYwBQVVfeXFMTzJTdUlBUVlzellwb0h3REF0TWFtUGNObXRFRFBwUTdkamRvOVhXek5MX2lNTnlRM1pEeWRIckMwV1pZbGQ2QU1NQ2RZWHRfeEVmWGtvQkx4Tkt3VWZEY0llU242TTEtbko0bXA5NHoxU2IzdHpJTlV3dUt5U3VkUGVOTVdFdzU1Vk5wUTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "NFT market revival: Ethereum takes the lead as sales surge - AMBCrypto News",
        "content": "NFT sales volumes grew by 10.95% over the last week.\n\nEthereum regained the top spot in the NFT sector.\n\nWhile crypto investors weren’t initially flocking to NFTs in 2024, the past few weeks have seen a shift in the market. NFT sales are on the rise, with some collections experiencing significant surges in activity.\n\nThe NFT market recently saw gains for the second consecutive week with sales up by 10.95% during this period.\n\nBlue-chip blues\n\nHowever, the picture wasn’t entirely rosy. Ethereum-based NFT big names like Bored Ape Yacht Club (BAYC), Mutant Ape Yacht Club (MAYC), and CryptoPunks haven’t seen uniform growth.\n\nCryptoPunks’ sales volume dropped a hefty 59%, and the average holding time for these digital avatars has also dipped. This suggests some investors might be offloading their Punks.\n\nMAYC, on the other hand, witnessed the same level of disinterest. The sales, though down 53% compared to earlier highs, show a different story.\n\nThe average holding time for MAYC NFTs skyrocketed by 74%, indicating investors are holding onto their Mutant Apes with confidence.\n\nApeCoin sees no love\n\nDespite the resurgence in MAYC popularity, ApeCoin, the cryptocurrency linked to these Ape collections, hasn’t mirrored the growth.\n\nApeCoin’s price has actually fallen by nearly 16% in the past month. Even if the resurgence in interest in Ethereum NFTs hasn’t helped ApeCoin, the future of the token looks extremely glib.\n\nThe rise of Ethereum NFTs like MAYC and CryptoPunks has propelled Ethereum back to the top spot in the NFT space. For months, Bitcoin dominated NFT transactions, but renewed interest in Ethereum NFTs has revitalized the network’s overall activity.\n\nAccording to CryptoSlam’s data, the Ethereum network saw $154.8 million worth of NFT sales being made on the network over the past month.\n\nThe surge in activity on the Ethereum network can also help improve the overall sentiment around ETH and help the altcoin in terms of price movement.\n\nBitcoin has been pushed to second place in terms of NFT volume. While collections like NodeMonks and Bitcoin Puppets remain popular, Ethereum’s resurgence has shifted the focus.\n\nIf activity on the Bitcoin network continues to decline and investors lose confidence in Bitcoin NFTs, the price of BTC can be affected negatively.\n\nSolana remained a close third in NFT volume, with Polygon trailing just behind."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQZVBIbFlLUk5FdmRfdXJkT1g2VVVaNkRwalBrT0ZjVVRGRm5uWmlBMXUteHI5UTVPZ0piUVlPWkdaUm1PV3dRUlF2NmhVY3VCMGtNR2hGR1lFaEpNT1Zfd3ZyeDZTaV9kZ3F1Uk5iMWVFRTZZajk4TUFzSkU3MmU1MHBiLWZIVE3SAYwBQVVfeXFMT3JVRlRnVnNaVUFqMGNzSzI4WEJTOURFdU9yVWdkY2pndWxPQUlZenNWSlBDSTQ4cTNXc3MwRlNGUVgxeTBKbEhIYktaajRtRlNqbFFKaXZVY1BKWUEtZ3RGSmR6c3oyM25KMVNVYWFHeWVTNEp1czh2alB4Y1A3SWI4NmdjX1E1YVMyUGQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Restaking EigenLayer Goes Live On Coinbase, What’s Next? - CoinGape",
        "content": "Ethereum’s restaking protocol, EigenLayer, has officially launched in full trading mode on Coinbase International Exchange, sparking renewed interest in the cryptocurrency market. This move marks a significant milestone for EigenLayer, a protocol that enhances returns by leveraging Ether staking to support the Ethereum blockchain.\n\nNotably, the launch has fueled optimism among investors, who see this as a potential catalyst for market growth.\n\nadvertisement\n\nEigenLayer Goes Full Trading On Coinbase\n\nCoinbase International Exchange’s recent announcement regarding EigenLayer has caught the attention of the crypto community. The leading crypto exchange has transitioned EigenLayer’s EIGEN-PERP pre-launch market into full trading mode, allowing for various order types, including limit, market, stop, and stop-limit orders.\n\nNotably, this transition follows a brief period in post-only mode, where users could post and cancel limit orders without actual matches being made. Precisely, the move to full trading mode has generated excitement among investors, with the potential to boost market sentiment significantly.\n\nMeanwhile, major exchanges like Coinbase, Binance, and others, often influence crypto markets through such positive announcements. The market’s focus has now shifted towards EigenLayer’s innovative features and its implications for Ethereum staking.\n\nEigenLayer’s primary appeal lies in its restaking capability, which amplifies returns for investors by allowing them to deposit Ether coins in support of the Ethereum blockchain. This unique approach offers a new avenue for maximizing yields within the Ethereum ecosystem, making it attractive to investors looking to enhance their staking returns.\n\nAlso Read: Vitalik Buterin Lauds Relevance Of Community Notes, Here’s All\n\nThe Project’s Controversy\n\nEigenLayer’s recent developments have not been without controversy. The protocol’s highly anticipated token distribution through an airdrop faced backlash due to the exclusion of users from the United States and China.\n\nDespite raising approximately $165 million from prominent backers like a16z Crypto, Eigen Labs’ decision to restrict access to residents of certain countries has raised regulatory concerns. Besides, it also sparked debates within the crypto community.\n\nMeanwhile, this exclusion has overshadowed the airdrop program, despite its success among eligible participants. Notably, Tron Founder Justin Sun managed to secure over 3 million EIGEN tokens from the airdrop, valued at around $30 million. Such significant acquisitions highlight the potential value and impact of EigenLayer’s tokens in the broader market.\n\nNotably, the controversy surrounding the exclusion of specific jurisdictions underscores the regulatory challenges faced by innovative decentralized finance (DeFi) projects like EigenLayer. However, the successful transition to full trading mode on a major exchange like Coinbase signifies a crucial step forward for EigenLayer, potentially paving the way for increased adoption and acceptance within the crypto community.\n\nAlso Read:\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPREViSjBYSFpac3E1QlpPWjllWG4tZEhKNmZFV0R3VzBYUTE3WTVoekJVTTFVWklpcmMzU2JHU1NXS1VRQ2dfcXZzYlhONEhoeFZpbVZYOEpUTmppVEFYOVZQZUZvU1hzSHE3SldiVkdsb1JLTllpa1hnUXFxZnZmSlhSbnRjSko1S21BWEpXN3BVb1NfSEFhUnBLMmprWUHSAaQBQVVfeXFMT3BrT2l4TGF2S1J5OVdwVUlYeGNkV1F0dzN0SnNxTWNaWXRZNnFfX3p4bU11RjQ0Q1hWNWs1MDIzME55cUZ4Tk9LQ3F5RzIxdDZseWJxWUlOVllVMU9BRTNnVUhTQ0g0UGdnQ3hDRzd6SnFLRUI1MlFQRE9NZmFVdW03aFBMV2JFcnhvaDg0RFR3SWJJUUpCREMzdTlWZm5YNHBWTm4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Are Solana, Cardano, Polygon Commodities As US SEC Ends Ethereum Investigation? - CoinGape",
        "content": "The U.S. Securities and Exchange Commission (SEC) has permanently closed its Ethereum investigation, which sparked a rally in ETH and altcoins. While the move by the SEC has gained skepticism, especially in the XRP community, does Ether gaining status as a commodity means all proof-of-stake (PoS) cryptocurrencies such as Solana, Cardano, and Polygon are commodities?\n\nSolana, Cardano, Polygon, Other PoS Crypto Are Commodity?\n\nThe SEC’s ending Ethereum investigation sparked speculation that Solana, Cardano, Polygon, and other proof-of-stake (PoS) could also be commodities. Also, Ether has leaped over Bitcoin and XRP in terms of gaining regulatory clarity.\n\nadvertisement\n\nPopular XRP sleuth Mr. Huber asked former SEC securities lawyer Marc Fagel whether the SEC now considering Ethereum as a commodity means anything for proof of stake crypto projects. The latest move by the SEC brings major PoS crypto such as Solana, Cardano, and Polygon in the spotlight. The SEC has alleged Solana, Cardano, and Polygon as securities in Binance, Coinbase, and other lawsuits.\n\nI have no visibility into their thinking but, no, I wouldn’t make that leap. I don’t know what evidence (or lack of such) led the SEC to close the investigation, but I assume the prevalence of serious defenses (not present for other crypto) was a big factor. — Marc Fagel (@Marc_Fagel) June 19, 2024\n\nAlexander Grieve, government affairs lead at Paradigm, said that it is relatively unusual for the SEC to highlight a company in response to a closure of an investigation. The SEC is “under no obligation to do so.” Also, Ethereum Foundation was part of the investigation, but it didn’t receive any letter.\n\nMarc Fagel agreed that it’s highly unusual to send a closing letter to one party if something was ongoing as to another party in an investigation.\n\nAlso Read: XRP, Cardano, & 7 Other Communities Must Watch This Key Move By Binance\n\nWill Consensys Drop Lawsuit Against SEC?\n\nConsensys revealed that the SEC Enforcement Division has closed its investigation into Ethereum 2.0, as per a letter send by SEC Assistant Director Kristin M. Pauley on June 18. The company claimed it’s a major win for Ethereum developers, technology providers, and industry participants.\n\nThe move comes in response to a letter sent by Consensys seeking confirmation from the SEC. The May ETH ETF approvals by the SEC were largely a result of ETH’s status as a commodity.\n\nConsensys said it will continue to challenge the SEC in the lawsuit. The company seeks a declaration from the SEC that offering the user interface software MetaMask Swaps and Staking does not violate the securities laws.\n\nAlso Read: The Sandbox Expands Memecoin Chest With DOGE, PEPE, SHIB Purchase\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOcHBlemd3X2pfNDhxYkFITVpmNVhsZnRtM1J3bW5fUG9pSl9mNFdZdHo0SE9PZnhoSEVMRmlsOWFtM2tseUN0Rk1JOFl6enJvbks0ZzJoSnFoRUE1TlBsOF9BUURXeno0ckdmQzU3WTBQSDBhb2YwOEpZdVc3VE5wWHhMT3Yxek83cThvWU0wWWjSAZ4BQVVfeXFMTlcybk1GY1hsU0RUeFg2bUs1QndNY1VFSDJrRTkzM0VYWENkQVRKTm45elRCdTlJdUJ5LXpEdE5wR0FHbDBCbjNuVEZSdEFSd2daQllxamRiSFJTX1l6WS1LUnV5bDd6ZnZsNlRib3ozNGd4d3hfYTB5dEk5b2xKdXRTeW9kT25OaFBNSjJsTHBkY01NUzYxN0pQYXV0S0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 18, 2024 - Analytics Insight",
        "content": "1. Market Adoption:\n\nThe use and popularity of Ethereum to support decentralized applications (DApps) and smart contracts elevate its necessity and requirements. It is also important to note that large banks and other forms of financial companies that invest in Ethereum’s technology can also have a positive effect on its Price.\n\n2. Regulatory Environment:\n\nInformation on changes in regulations greatly influence the Ethereum market. Temporary fluctuations in prices might be attributable to the latest regulatory changes in the major markets such as the US, EU, and Asia.\n\n3. Macroeconomic Factors:"
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNNHlPQWxheTZUMWJTa2gtLVA4RVNsLVVBSWFkQjI4X25aTFdJSC1ZX2VPdWV6MHl4SnNZcnZDVXZYVHVNMEtJLWdsT0Q0dVJRR2JEUUZnY0tvV2IzX2QydzBwS2hIWEEwNUZEZTR6R01QMWtaLWlWdG9zSzhsUFZDQThMZEthT1BYMnVZeFg5WlHSAZ4BQVVfeXFMTmRNdHVmTGJMeUw2Mm1hTlVvQ3NDd3dlZ2kwVjI5N2JFcloxWmt3UDBoVENPNk82QVp3NWtqRDlCTFVhellGMDBsR0t1eWlEeWpQbnlBRHg4SXlJOGo1UDg1cGZmemxSeGtvTmR4RU1BSExYME1ibUxQbGY1NzU3VTZPUXF6M1o5RDJ0QWhNMmhhSEtYQzlNRUxURHBJZlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 19, 2024 - Analytics Insight",
        "content": "24 Hour Performance\n\nIn the past 24 hours, Ethereum price has ranged between US$3,377.40 and US$3,586.41, reflecting volatility that traders can exploit for short-term gains. The 3.05% increase over this period suggests a positive sentiment among investors, likely driven by recent developments in the Ethereum ecosystem or broader market trends.\n\n7 Day Performance\n\nOver the past 7 days, Ethereum price has increased modestly by 1.3%. This indicates relatively stable market behavior, with incremental gains that may be attributed to ongoing advancements in Ethereum's technology, as well as sustained interest from institutional investors."
    },
    {
        "id": 93,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNX2g3QXduU3VQaHJ3X0JhQy1iUXZIYzc0SFFMSXVzR1VOcEliTkhFN0NUcUdRb2xnTFFPNWw2NlU3MzhBWV9GTVVqWVY5QXJ4bDZvQ0JINHdGc0c3b2NCUHFmMUpDLWdwTzZGVzdObERpTmVJQTdPREppMU83NjZOXzNIa0N4RW1LNUVYS2NnZ1g1OUdoTTNPSjhnMGQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Targets $3,300: Will ETH Rise 50% Versus Bitcoin? - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum is down when writing following yesterday’s contraction. Even though the community is optimistic, citing favorable fundamentals, sellers still control price action. For the Q1 2024 uptrend to be valid, Ethereum needs to close above $3,700 and reverse recent losses. If not, the odds of even more losses remain amplified going forward. Presently, the immediate support level is at $3,300.\n\nEthereum is down 3% in the last day and week. At the same time, the average trading volume is decent, at just over $20 billion. Traders expect prices to recover, shaking off the current weakness, in the days to come. When this prints out and there is a decisive high-volume breakout above the local resistance levels, participation will likely expand.\n\nTraders should monitor the following Ethereum news:\n\nEven though Ethereum is tracking lower versus the greenback, analysts are confident of its performance versus Bitcoin . By the end of the year, optimistic traders say ETH could post a 50% spike versus BTC . If this prints out, it would follow the same path as the 2019 to 2021 Bull Run.\n\nWhile the mainnet transaction processing speed remains low, scaling successes in layer-2 and 3 solutions have seen the combined TPS rise to all-time highs. This is primarily because of the explosion in processing speeds in Xai, a layer-3 platform.\n\nEthereum Price Analysis\n\nAt press time, ETH/USD is fragile.\n\nThe coin is trading below $3,700, slipping yesterday.\n\nThough the June 17 bar had a long lower wick, pointing to strong demand at the tail end of the day, earlier losses today validated bears.\n\nAccordingly, aggressive traders can short on every high, targeting $3,300. This preview aligns with the bear formation set in motion by the June 11 bar.\n\nThis outlook will only change when Ethereum soars above $3,700, ideally with expanding trading volume."
    },
    {
        "id": 94,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPeXZEV0o3NXB4d1ZkektfWWlDXzF2OTdZTEtYY2gxTXVHeEk1N3NJeVBwYnhDV3lZR0NHdkExLVpnUWxTUkNKeXYzYU9kbU1MY3BoZlFPdW1XZVdEMmw2OGlPOFVpNmpHWnY4em9uVkRPU3c1YVp0b3RlV0RWZXJsVGJ5em1NZVpZM09VLXVackhVelU3TW9PN1g2bXJZdDk3ZjBUT2N0TlBPTjNMaEhZNTlzempIM3pzX05YUGIxRzFnRDjSAcgBQVVfeXFMTXY1V1Z6MFVLTzVLeDl2cUxTY1hpVlJpV0dUay1pZlpXREswc2h2UHdTMlpiSG0zelFZOTFOSDhmYUNkT1NLMzlsRkFqc3R3TjgxM0Y1RWFnMWVXZ29oc1FGN1pMLTREQjRzQ3hsZ0tYNUlfY211R1NxUVpCME1rM2N1ZHk5Wk5nQ0Vib3JYUTJnQ09TendfZmM1WjBqYlVhcVdnbG92WXVobHJPOXBmQU9qemFXS3lKcGFGc0pLdDRSVmNEMHlxV3o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Gains Momentum Above $3,500 Amid Surging Whale Interest: What’s Next for ETH? - Coinpedia Fintech News",
        "content": "Shayan is a digital nomad and a professional journalist. He delivers high-quality engaging articles to Coinpedia through his in-depth research and analysis.\n\nEthereum has successfully overcome its regulatory challenges as the SEC concluded its investigation into ETH. This news has boosted buying confidence in ETH, even with bearish pressure on the Bitcoin price chart. Additionally, there is a notable increase in on-chain metrics, indicating potential for further upward movement in the coming hours.\n\nSEC’s Closure of Investigation Boosts On-chain Metrics\n\nIn a recent update shared on X, Ethereum developer Consensys announced that the SEC’s Enforcement Division has closed its investigation into Ethereum 2.0. This decision signifies that the SEC will not pursue charges regarding ETH sales as securities transactions, marking what Consensys described as a significant victory for Ethereum developers and community.\n\nAlso read: Crypto Market Chaos! Spot Ether ETFs Launch Expected to Increase Volatility\n\nConsensys made this announcement following a letter dated June 7, requesting the investigation’s termination, especially after the SEC’s approval of spot Ether exchange-traded funds (ETFs) in May, based on ETH being categorized as a commodity.\n\nThis news has sparked increased buying interest in Ethereum in recent hours. According to data from Coinglass, Ethereum’s open interest has surged by 4% in the past 24 hours, reaching $15.8 billion. Moreover, the total liquidation amount exceeded $33 million during this period, with liquidations evenly split between both sides of the market.\n\nAccording to IntoTheBlock data, there has been a notable recovery in the volume of large transactions. This metric rose sharply from a low of $2.05 billion to a recent peak of $5.8 billion. This increase indicates that Ethereum’s increased volatility was driven by surging interest from large-scale investors. Additionally, Lookonchain reported a massive accumulation of 5,603 Ethereum (worth $19.6 million) today by a prominent ETH Whale.\n\nThe current long/short ratio has surged above 1, reaching 1.206. This suggests increasing bullish dominance, with approximately 55% of total positions anticipating a continuation of the upward trend.\n\nWhat’s Next For ETH Price?\n\nEther bounced back from the low of $3,350 as buyers triggered intense buying activity. This pushed the price above immediate Fib channels and ETH price retested buyers’ patience at $3,600. However, bears are strongly defending a surge above higher EMA trend lines. As of writing, ETH price trades at $3,524, surging over 3.5% in the last 24 hours.\n\nSellers are strongly defending the EMA100 trend line. A drop below the 50-day SMA at $3,379 could shift the advantage to the bears. The ETH/USDT pair might decline towards the crucial support level of $3,172. If bulls fail to defend this level, we might see a decline toward support at $2,850, where strong buying interest from bulls is anticipated.\n\nConversely, if the price rebounds from current levels or bounces off the 50-day SMA, it would indicate bullish buying interest. This scenario would increase the likelihood of a rally above the 100-day EMA. In such a case, the pair could target $3,740."
    },
    {
        "id": 95,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQR0lNXzVaLU9xUDdOY1A0eTN6VjFVaHU5Q09Ld21Yak0xYW1MODZLdnVrUFd4VFJiU2tsMFY2bjc1dXhlV3lSNmU0VEhIMW84ZmhKWVRVelY2cF8yQTdSMmE1OW16eWZleVJzVDhGaWtKdWMwRmpscDJISURFSm0tVUpCUmNiamdRM2taUmRMN3RQdTRueWZuNXZQeEw2aUJMYWxhbTBHazlCNVZvZ3J6VHZWVmlJcmvSAbwBQVVfeXFMT0pFeC1GMkhPOGJvd1ZrSms5WUpRQ3owUmJ1ZWlYeVNlZjdZS04xbnR4OHh1RjBLREJ3TDgyeVkwZVd5cXJiWVUwZnRaanhndGxQQmZxbEkxUlV6U2lBanFnX01OZzNxR2hfNlJZcHcwSlZvYXl1ek4xRGZfWlVPWjNCMXB5YkpUMlpoVmpialAzODRTLVVWMWFSTjdWZlFQVG5JWWhCT1NTcnFZaGJ0dWNJRHVWS280WTgzcGU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH Price To Plunge To $3.2K This Crypto Market Crash? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nWith a surge of 74.63% in its trading volume and a price correction of 3.56% within the past 24 hours, the Ethereum price has plunged below its important level of $3,500. Furthermore, with the rising bearish sentiment, the market sentiments hint at a further fall in its value.\n\nNotably, the altcoin leader, ETH Price, has started this week on a bearish note by losing over 5% in valuation over the past 2 days. Moreover, the price continues its struggle to reclaim the $3,500 mark, indicating a negative influence in the crypto space.\n\nWith the ongoing cross-border market correction, will the Ethereum token make a comeback this week? Or will its price plunge toward its crucial support level of $3,200? Dive in as, in this article, we have covered the market sentiments and short-term price analysis of Ethereum crypto.\n\nETH Coin Price On The Verge Of A Major Break Down:\n\nAfter hovering close to its important support level of $3,700 for a brief period post Ethereum ETF approval by the SEC, the bulls failed to hold the value above its support level. This resulted in the Ethereum price experiencing a breakdown in its price chart.\n\nTradingView: ETH/USDT\n\nSince the breakdown, the ETH token has been constantly trading in a closed range between $3,400 and $3,700, highlighting a weak price action for the altcoin in the crypto market.\n\nMoreover, the altcoin leader has formed a symmetric triangle pattern in the 1D time frame and is on the verge of testing its support trendline, the outcome of which is uncertain.\n\nEthereum Market Sentiments:\n\nThe Simple Moving Average (SMA) displays a bearish crossover in the 1D time frame, suggesting a weak bullish sentiment in the crypto space.\n\nThe technical indicator, RSI, fails to gain momentum, resulting in it recording a bearish reversal above the mid-point. Furthermore, it is now headed toward its oversold range, highlighting an increase in the selling-over-buying pressure for the Ethereum token in the market.\n\nWill The ETH Price Go Up?\n\nIf the bulls hold the Ethereum crypto above the support trendline of the symmetric triangle pattern, it will test its resistance level of $3,730. Maintaining the value at that level will set the stage for the ETH coin price to attempt to test its upper resistance level of $4,094.75 this month.\n\nHow Low Will ETH Go?\n\nOn the contrary, if the bears overpowered the bulls, the Ethereum price will continue trading under a negative influence, break down its support trendline, and test its support level of $3,400 this week.\n\nFurthermore, if the bearish sentiment intensifies and the bears continue to dominate the market, the ETH token will plunge further and prepare to test its crucial support level of $3,000 during the coming time.\n\nAlso Read : Bitcoin, Ethereum, And XRP Price Prediction: Is The Bull Rally Over?"
    },
    {
        "id": 96,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNWlVRa21jc2I1akxDZkpDTVFRR1NfWmlWY1Q0QXF2RDFxVG1WZWNYb2hHZHpBaEFQQjJXaldCeEhPcUpCRUMtMGlxVmpjMFhRVFhodXJ1cWpvUlpRM3pPb2VmcHk2OTdsbHJFT3FZa2ZVa0JNSktxX2dsNTI1WS1mVWg4R1dfUndHX1NEbUxxdVRialQ5b3ZGSUtuQdIBoAFBVV95cUxObFZuWVRBZXN0RWNzX2U4cVpwVGlJVFU5QmRFUy14enB6X3Zma2Z4TThQd04yNkN2a1hQdzE2ODVGeEd1T2ZIa3g3ajVUZ3VrUU5tV09tUWFwVXk4Z0d1Z1lTUkVnQWpGSTBQdGJRNjU4N1ZMNXNSNHdlZ0NwLXBfSWttQWtFeWl4dlYtcHp3NVhzOUJ1aTcyai1zN0M5QWt2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Will ETH Price Hit $4,000 In June? - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nWith a sudden price jump, Ethereum spearheads the next phase of an uptrend in the altcoins. As the ETH price jumps by 2.30%, the top altcoins and especially meme coins display massive recovery today.\n\nThe intraday recovery action after a bearish patch reveals a potential trend reversal entry opportunity. With sideline traders ready to buy the dip, the bull run can continue this week to reclaim lost levels.\n\nWill the biggest altcoin’s renewed recovery surpass the swing high at $3,872 for a new 52W high above $4,000? Check our Ethereum price prediction to find out if the bull run will hit $5,000 this year.\n\nSEC Closes Ethereum Investigation\n\nThe recent news that the SEC is officially closing the Ethereum investigation into the sales of ETH as a commodity sparks a bull run in the price of Ethereum and altcoins.\n\nFollowing the news, the ETH price crosses above $3,500 and projects a potential uptrend this week.\n\nEthereum Price Performance\n\nFollowing the bearish reversal from the $3800 mark, the ETH price trend converts the consolidation range into a lower high. The downfall drop Ethereum to $3500 level with lower price rejection teasing a potential bounce back.\n\nTradingview\n\nIn the last 72 hours, the ETH price action teases a morning star pattern in the daily chart, with an intraday growth of 2.30%. With a bullish candle completing the morning star, the price action reveals a double-bottom formation.\n\nWith a neckline at $3,615, the bullish reversal pattern can reinstate an uptrend with a breakout rally. Further, the long-tail candles forming at the $3,500 levels uncover the underlying demand bolstering uptrend chances.\n\nOpen Interest Surge Teases Bull Run\n\nWith a 4.33% surge in the last 24 hours, Ethereum’s open interest over all the exchanges surpasses $11 billion. Currently, the OI stands at $11.55 billion, suggesting a positive outlook from the market participants.\n\nFurther, the funding rate at 0.00713483 bolsters the positive outlook and reveals long-side traders willing to pay short traders. Thus, a bullish dominance is visible in the derivatives data.\n\nWill The ETH Price Cross $4000?\n\nWith dovish derivatives, bullish price action and the SEC closing Ethereum’s investigation, the altcoin is ready to take off. The neckline at $3,615 breakout could fuel the next price surge to hit the $3,775 mark.\n\nAs per the Fibonacci levels, the ETH price could aim for the $4,303 level as the next target."
    },
    {
        "id": 97,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQM3VRcWU0Rmd3UUdPR1NhTTZKSFZMV25FYTZTMkFGVkwxdVE1LVhhRzI2M25uVTZxODV3cjlNNHgwSTNnY3luMG1DbXBubldaNW9oSElSR0ZJWkNndUhEM0gyOUpTZEV3cEx3UjRkR0RnaktfVFdPU1pMem9CMWROV3pyTGpvc3ZQLThDcGxJZkp4dVhGUElrcTg0MWFVNTN3LV95Z1RZeHBaa2gw0gGyAUFVX3lxTE5GT0JRTXQxa1V4NllWdlZYTUFOMWdoY3lHVnRrMnNXbk1Kbmk1UVo5c1hETmhMN2VYdlpXZldXek1sdkU4QS14OW9qSWtkWW8xcEJoZDZQeFUxd014M2xycHBhaUtRNHZ6Mk9RT3p6UW9wTTk3d19Ld3h2c1g1NGZKckNEd08tOGJZVXdWYU16c0Q4aXVkS2dPdFNBWXpkRTU1R0VJTEZfUkE2LTFsTnBBeUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Green Light for Ethereum ETFs? SEC Comments Signal Potential July Launch - Coinpedia Fintech News",
        "content": "Mustafa has been writing about Blockchain and crypto since many years. He has previous trading experience and has been working in the Fintech industry since 2017.\n\nStory Highlights SEC issues crucial comments on spot Ethereum ETFs' S-1 forms, response due by Friday.\n\nTimely response to SEC comments essential to avoid delays in Ethereum ETF approval.\n\nSEC might fully approve Ethereum ETFs by July 2 if issuers promptly address feedback.\n\nBig news for Ethereum fans!\n\nThe U.S. Securities and Exchange Commission (SEC) has just delivered critical feedback to issuers of spot Ethereum ETFs regarding their S-1 forms. This is a major step forward for launching these long-awaited investment vehicles, but could it mean Ethereum ETFs are just around the corner?\n\nRead on to find out the latest developments and what it means for investors.\n\nDeadline Looms: Issuers Rush to Respond\n\nIssuers of spot Ethereum ETFs are under intense pressure to address the SEC’s comments promptly, with a deadline set for this Friday.\n\nJUST IN: US SEC ISSUES COMMENTS TO SPOT ETHEREUM ETF ISSUERS ON S-1 FORMS; DEADLINE FOR RESPONSE IS THIS FRIDAY — BSCN Headlines (@BSCNheadlines) June 19, 2024\n\nIn recent years, interest in spot Ethereum ETFs has surged, offering investors a regulated avenue to gain exposure to Ethereum without the complexities of direct cryptocurrency ownership.\n\nApproval Hinges on SEC’s Evaluation\n\nAlthough all eight issuers had their 19b-4 forms approved on May 24, the fate of their S-1 forms now lies in the SEC’s hands. These forms provide comprehensive details on the ETFs’ investment strategies, risks, and management, pivotal for securing SEC approval.\n\nThe SEC’s comments are crucial as they typically highlight concerns or seek clarifications, requiring issuers to respond effectively to facilitate the approval process.\n\nWith the Friday deadline looming large, issuers face potential delays if they fail to meet the SEC’s response timeline, jeopardizing the anticipated launch schedules for these ETFs.\n\nApprovals are Coming!\n\nSenior ETF Analyst Eric Balchunas, speaking to Bloomberg, indicated that the SEC’s comments on the S-1 filings were relatively minor, hinting at a possible approval by July 2. Despite this, the SEC has not specified an exact approval timeline beyond stating it will occur sometime this summer, contingent on issuer responses.\n\nEvaluating the Market Impact\n\nWhile the precise impact of Ethereum ETFs remains uncertain, analysts speculate they could attract significant investor interest, potentially capturing up to 20% of the market flows currently seen by Bitcoin ETFs.\n\nLove it or hate it, Ethereum ETFs are coming. Are you ready?\n\nAlso Read: Analyst Reveals Why Nvidia’s Surge is a Bearish Call for Bitcoin"
    },
    {
        "id": 98,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxQMXFzRjZ1ZkRxYWFaX1FNZVN2MmRydzZfMlBVaFBaX2g2ZjBHMm9Lald2amt0dGw0NHU5QjJaZDlyalB6UmhWeVlMVVg3WDBYdVZsTHRXcTJYLTBXVmRHWS1XTzVpaDFXQ1ZSTjQ0bGJQdzhVZGZ4UHk2elI4ZEllZXhINDI5NllHd0pFNEJlUkpuOEd4ODAwMGZIaWxzNkg3ZmpZSTFDcjNPUjhwM0kzWE1lT3VnSmZTWEFRam1OYkRZd1VPRDN1NG1JMHI2UFhYTzg1Nkt0MmrSAd4BQVVfeXFMT3RRVUdpcDA0anFoWDEyc3l1VzlvZjhtaThjNktCTFhNUzhtY0lDcmpjaV9BUWVpcEZNS0RSY0Ruc2VnOTlPWW9mSGduSXRMSE9GdXhHc0duTzhUQkFJNk8wdjRLZEZ0N01wbDZHQzduUHpuVDc1OE1zWUhUb1AtZ195OEpibWdIX1h3Y2Ezcy14ZWJJbjEzVmNJcHIyOFdPWVFjUFYwUTJFeGJRU0pGTVJMVTZRNnZEdUxIVGlYbVZBRU9ONU5MR24zRmpXUE5VWUp3QXpIcjZUQ3llUk1R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "SEC Suspends its Investigation into Ethereum 2.0: Will This Be the Catalyst to Propell ETH Price to $4000? - Coinpedia Fintech News",
        "content": "A passionate cryptocurrency and blockchain author qualified to cover every event in the crypto space. Researching minute occurrences and bringing new insights lie within the prime focus of my task.\n\nSEC Suspends its Investigation into Ethereum 2.0: Will This Be the Catalyst to Propell ETH Price to $4000?\n\nStory Highlights Ethereum managed to reclaim and sustain above the crucial resistance at $3500 as positive rounds around the network built confidence among the market participants\n\nETH price is strongly heading towards one of the important targets, which may clear the path towards the interim milestone at $4000\n\nA major win for the Ethereum developers as the US SEC suspends all its investigation into Ethereum 2.0. The SEC has earlier approved an investigation to examine the buy-sell-trade of individuals and entities. However, in a recent update shared by Cosensys, the blockchain development company behind Metamask, the SEC notified the company of the withdrawal of the investigation.\n\nETHEREUM SURVIVES THE SEC.\n\n\n\nToday we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0.\n\n\n\nThis means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nIn a detailed thread, the company said the notification was a reply to the letter that was sent to confirm whether the approval of the spot ETH ETF was after the agency decided to close the investigation or not. To this, the SEC notified its closure, however, the blockchain company is expected to continue its fight to bring justice to the developers, technology providers, and traders who have suffered under the SEC’s illicit crypto crackdown.\n\n“Our fight continues,” says the post, which also seeks a declaration in their lawsuit that metamask swaps & staking do not violate the securities law.\n\nWill ETH Price Reach $4000 This Week?\n\nNo sooner than the rounds of the SEC’s withdrawal of investigation circulated within the market, the ETH price gained momentum and overcame the previous bearish action. While Bitcoin continues to remain stuck around $65,500, the ETH price has already made it above $3,500. However, the second-largest token is required to clear certain levels, which may only send the price beyond $4000.\n\nThe recent bullish push has pushed the ETH price a step ahead towards the critical resistance zone between $3,663 and $3,703. As the token has failed to surpass these levels, it is now very important to enter and clear this zone. The technicals are bullish, with the MACD displaying a drop in selling pressure and the levels are closer to undergoing a bullish crossover. Secondly, the DMI is also displaying a similar trend but the plunging ADX may be a matter of concern.\n\nTherefore, the Ethereum (ETH) price may receive a decent bullish push but may not reach the milestone at $4000 as the strength of the rally is waning. Besides, the volume does not show any bullish figures, suggesting the market participants remain doubtful of the upcoming trend. Historically, network upgrades or any positive events have failed to have a sustained and extended impact on the price and hence, traders seem to expect a similar trend now."
    }
]