[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9qLVVGQkhfbGFwWG9GbUlYREpaSEl2OW9vVmVONUlzZDJrT0NQMUFQOWlDVXZQOGRpVmx5MVVHQ1gwVmVLV1pKZ0JVdmpaQzJERVhLbmJYQkZFbUFIZUtpU2RpVUlPMmgwTFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price History: 2015 To 2024 - Bankrate.com",
        "content": "Advertiser Disclosure\n\nWe are an independent, advertising-supported comparison service. Our goal is to help you make smarter financial decisions by providing you with interactive tools and financial calculators, publishing original and objective content, by enabling you to conduct research and compare information for free - so that you can make financial decisions with confidence.\n\nOur articles, interactive tools, and hypothetical examples contain information to help you conduct research but are not intended to serve as investment advice, and we cannot guarantee that this information is applicable or accurate to your personal circumstances. Any estimates based on past performance do not a guarantee future performance, and prior to making any investment you should discuss your specific investment needs or seek advice from a qualified professional.\n\nHow We Make Money\n\nThe offers that appear on this site are from companies that compensate us. This compensation may impact how and where products appear on this site, including, for example, the order in which they may appear within the listing categories, except where prohibited by law for our mortgage, home equity and other home lending products. But this compensation does not influence the information we publish, or the reviews that you see on this site. We do not include the universe of companies or financial offers that may be available to you.\n\nEditorial disclosure\n\nAll reviews are prepared by our staff. Opinions expressed are solely those of the reviewer and have not been reviewed or approved by any advertiser. The information, including any rates, terms and fees associated with financial products, presented in the review is accurate as of the date of publication."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPcUxlcWNveTI2OFJmbDdObEJVbUY2MFRKeEZXSE9pNVBxb1hoU1I4WXR0X2ltc3RYeU9kTldKaFNZbm9UMFlSOTdMSjRoLWxGN3hzWmtfS0FpNUJ1eFNNd1gxMFF0anVKM19wNGV5Z3RxWmtTbFBZaWo3MnU4bTZkS0ZCY241VE5R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "What is cryptocurrency? What to know about this increasingly popular digital currency before investing - Business Insider",
        "content": "Paid non-client promotion: Affiliate links for the products on this page are from partners that compensate us (see our advertiser disclosure with our list of partners for more details). However, our opinions are our own. See how we rate investing products to write unbiased product reviews.\n\nCryptocurrencies are digital assets that are created and run on a blockchain.\n\nBitcoin and ether are two popular cryptocurrencies, but there are many others.\n\nInvesting in cryptocurrency can be extremely risky, and the underlying technology is very new.\n\nInvestors need to understand how cryptocurrencies work, who creates and controls them, and why you might want to buy cryptocurrencies.\n\nWhile there may be opportunities to build wealth, there are a lot of risks involved with crypto investing, and you need to be mindful of scams.\n\nWhat is cryptocurrency?\n\nCryptocurrency is a decentralized digital currency that investors can buy and sell along the blockchain. Unlike banknotes or minted coins with a tangible physical form, cryptocurrencies can only be accessed using computers and other electronic devices.\n\nA decentralized currency is not issued by a government or financial institution. In fact, no single person, company, or government controls a cryptocurrency's blockchain. Instead, it's run by a decentralized network of computers worldwide. Anyone with advanced technology skills and coding experience can create a cryptocurrency.\n\nThe lack of a central authority can also make cryptocurrencies more secure. \"It's hack-proof because there's no one central point of failure,\" explains David Donovan, executive vice president at Publicis Sapient.\n\nHow do cryptocurrencies work?\n\nWhile there are thousands of cryptocurrencies, many with unique traits, they all work similarly. It's hard to avoid jargon when discussing cryptos, but the concepts can be relatively easy to understand.\n\nBlockchain technology\n\nA cryptocurrency's blockchain is a digital record of all crypto transactions. Copies of the blockchain are stored and maintained by computers around the world. They're often compared to general ledgers, part of traditional double-entry bookkeeping systems where each transaction leads to debit and credit in different sections of the books.\n\n\"It works like a general ledger — it's that simple,\" says Donovan. Perhaps you start with two coins and send one to someone. \"On the blockchain, it would say I'm sending you one coin, and I now have one coin, and you have one coin.\"\n\nEach grouping of transactions is turned into a block and chained to the existing ledger. Once a block is added, it can't be reversed or altered — which is why people describe blockchains as \"immutable.\"\n\nSome cryptos have their own blockchain. For example, there are Bitcoin and Ethereum blockchains. However, some cryptos are built on top of an existing blockchain rather than starting from zero.\n\nEther is the cryptocurrency native to the Ethereum blockchain, but is also available for trading on other exchanges like Coinbase, Binance.US, Ninjatrader and Robinhood.\n\nPublic transactions under pseudonymous\n\nCryptocurrencies have another defining feature. The blockchains are public ledgers, which means anyone can see and review the transactions that occurred. However, they can also provide a degree of anonymity.\n\n\"You have a private key, which is how you initiate transactions, and a public key, which is how someone identifies you in the market,\" says Donovan.\n\nA blockchain's transactions are tied to a crypto wallet's public key, but nobody necessarily knows who controls that wallet. This is why cryptos are often described as pseudonymous — the public key is a person's pseudonym.\n\nComing to consensus\n\nCryptocurrencies commonly use one of two mechanisms to create a system of trust and determine which transactions are valid and added to their blockchain:\n\n\n\n\n\nProof of work . This relies on people around the world, known as miners, competing to be the first to solve complex cryptographic puzzles and add the next block to the blockchain. The winners are paid after the other network members confirm that the required amount of computing power was used to find the solution. \"The way you ensure all the participants are validating the transactions is the hard work, effort, and money they're spending solving the problem,\" says Donna Parisi, global head of financial services and FinTech at Shearman & Sterling. However, proof-of-work systems require a lot of energy to power.\n\n. This relies on people around the world, known as miners, competing to be the first to solve complex cryptographic puzzles and add the next block to the blockchain. The winners are paid after the other network members confirm that the required amount of computing power was used to find the solution. \"The way you ensure all the participants are validating the transactions is the hard work, effort, and money they're spending solving the problem,\" says Donna Parisi, global head of financial services and FinTech at Shearman & Sterling. However, proof-of-work systems require a lot of energy to power. Proof of stake. This is a newer and less energy-intensive mechanism. \"Proof of stake is they validate transactions on the blockchain by people putting value on the line,\" explains Parisi. \"They stake some of the currency they own to make sure they only validate true transactions.\"\n\nTypes of cryptocurrencies\n\nAccording to CoinMarketCap, there were more than 25,149 different cryptocurrencies with a global market value of about $1.16 trillion as of May 30, 2023. Some of the most popular cryptocurrencies include:\n\nBitcoin\n\nDogecoin\n\nEther\n\nLitecoin\n\nTether\n\nBinance coin\n\nDai\n\nTRON\n\nCronos\n\nUSD coin\n\nBitcoin cash\n\nBitcoin, the first cryptocurrency, was launched in 2009 as an alternative type of decentralized and digital money. Since then, people have also created cryptocurrencies that serve other functions or are designed for specific types of transactions. All non-Bitcoin cryptocurrencies are often referred to as altcoins.\n\n\"Cryptocurrencies can have many different uses,\" says Parisi. \"Some are used in gaming environments to earn rewards in a game, while others facilitate payments. Some are designed for cross-border remittances … some are designed for micro payments.\"\n\nFor example, stablecoins are a type of cryptocurrency that try to maintain a steady and fixed exchange rate with another asset, such as the US dollar. Governance tokens are another example of a specialized cryptocurrency. They give token holders voting power in a corresponding crypto project.\n\nInsider's Featured Crypto Apps Public Investing\n\nWealthfront Investing Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Editor's Rating 4.35/5 A five pointed star A five pointed star A five pointed star A five pointed star A five pointed star Editor's Rating 4.34/5 A five pointed star A five pointed star A five pointed star A five pointed star A five pointed star Start investing On Public's website Start investing On Wealthfront's website\n\nWhat is digital currency?\n\nDigital currency is a type of currency that can only be accessed in an electronic form, such as through a computer or mobile phone. This money has no physical equivalent, unlike tangible forms of currency like banknotes or minted coins. But just like physical money, digital currencies can be used to purchase goods and services.\n\nHowever, you'll be limited to online platforms and communities, such as investing platforms, gaming sites, and gambling portals. Some of the most popular forms of digital currency include cryptocurrencies, central bank digital currencies (CBDC), and stablecoins.\n\n\"There's a strive toward decentralization,\" says Nisa Amoils, a managing partner at A100xx Ventures. \"Digital currencies like cryptocurrencies continue to be a worthwhile investment for many investors.\"\n\nDigital currencies come in two forms:\n\nCentralized currency: Currencies issued by governments or financial institutions as part of the commercial banking system that are available to the general public.\n\nCurrencies issued by governments or financial institutions as part of the commercial banking system that are available to the general public. Decentralized currency: Currencies not issued by governments or financial institutions. Instead, decentralized currencies operate through peer-to-peer financial networks to eliminate the middleman (aka banks) and allow lending, trading, and borrowing directly with merchants.\n\nDigital currencies like crypto are often appealing to investors who are wary of government-issued funds and are that are seeking alternatives.\n\n\"Some people who had been excluded from the traditional financial system, or have had their currencies devalued, are seeking an opportunity to participate in the markets, and this is a retail-driven phenomenon first,\" says Amoils. \"There's this crisis of trust, and people want wealth creation for themselves. And so that spurred this whole kind of trading speculative movement.\"\n\nHow to invest in cryptocurrency\n\nYou can start investing in cryptocurrencies through existing crypto exchanges and investing platforms. Some of the best cryptocurrency exchanges (such as Kraken and Coinbase) offer assets like staking rewards, goal-planning features, low fees, and more.\n\nSome of the best investment apps that offer cryptocurrencies (such as Robinhood Investing) include a range of investment types, low fees, market access, and more.\n\nIf you want to get more advanced and start trading, note that you can strategies such as shorting crypto that are popular with day traders who don't buy and hold for the long term.\n\nYou can create your own crypto\n\nAnyone with coding skills and/or advanced technical knowledge can create their own cryptocurrencies — although this is not always an easy feat and isn't recommended for beginners. The three ways to create crypto are:\n\nBuilding a new blockchain: The most advanced way to create crypto, but offers the most flexibility of nodes, architecture, tokenomics, and more.\n\nThe most advanced way to create crypto, but offers the most flexibility of nodes, architecture, tokenomics, and more. Modifying a blockchain: If you can't create your own blockchain, you can modify an existing blockchain's open-source code to your liking. Still, this method requires expansive technical knowledge.\n\nIf you can't create your own blockchain, you can modify an existing blockchain's open-source code to your liking. Still, this method requires expansive technical knowledge. Building upon a blockchain: The simplest way to make your own coins or tokens is by expanding upon an already existing blockchain. But keep in mind that the success of your cryptocurrency will be reliant on the success of the original blockchain. Some blockchains that allow this are Binance and Ethereum.\n\nAre cryptocurrencies secure?\n\nThe blockchain technology behind cryptocurrencies can help ensure that the coins and systems remain secure. \"What's never been refuted is the value of blockchain,\" says Donovan. \"The way the ledger system is set up and every transaction is recorded. And the fact that it's immutable.\"\n\nHowever, that doesn't mean you don't need to worry about security. The crypto world is rife with scams. Of course, that's also true of traditional financial systems and currencies. Someone asking you to pay with a gift card or wire transfer is a red flag that you're dealing with a scammer. But several factors could make crypto scams especially worrisome.\n\nFor example, cryptocurrency transactions can't be reversed. There's also less regulation of cryptocurrencies and platforms than of traditional financial services in the US. Plus, some people may feel pressure to act quickly and send or invest their money because they're worried about missing out on an opportunity.\n\n\"One way to avoid a scam is to invest in more well-established cryptocurrencies,\" says Parisi. \"You still may be subject to scams or fraud in terms of how you hold it, send it, or receive it.\" But you can have some certainty that the cryptocurrency itself isn't a scam.\n\nAre cryptocurrencies a good investment?\n\nCryptocurrencies may present a good investment opportunity, and there are many ways to invest in the crypto world.\n\nYou could buy a coin (or coins) and hold onto them, hoping they'll increase in value. Or you could use your coins in a decentralized finance (DeFi) platform to earn interest through staking or lending. You also might take a more traditional route, such as an exchange-traded fund (ETF) that is tied to cryptocurrencies. There could even be opportunities to invest in projects or supporting industries rather than in the cryptocurrencies themselves.\n\n\"From an investment perspective, crypto is rapidly evolving,\" says Parisi. \"You shouldn't put an amount of assets you're not willing to lose. It should be, relatively speaking, a small portion of your portfolio.\"\n\nBefore making any investment, consider the potential pros and cons:\n\nPros Cons Easy to invest\n\nDiversify your portfolio\n\nThere is a lot of opportunity\n\nFaster and cost-effective transactions\n\nDecentralized currency\n\nSecurity and transparency through the blockchain Cryptocurrencies can be very volatile\n\nSome crypto projects may fail\n\nThe investment may be a scam\n\nEnvironmental impact due to excessive power consumption through ASIC computers\n\nLacking refund and cancellation policies\n\nShould you invest in crypto?\n\nWhile cryptocurrency investing is a hotly debated topic, it's worth understanding what's going on so you can make an informed decision. If you decide to get started, you could fully jump in or just dip your toe.\n\n\"Learn about crypto by opening up wallets, accounts, trading currencies, and learning more about the use cases,\" says Parisi. \"But do it in a reasonable way. We're still in the early days, and regulation of crypto is still evolving.\"\n\nDonovan suggests opening an account with a regulated and publicly traded company like Coinbase. But, he says, \"It's really about being smart and using the system to take baby steps.\"\n\nCrypto FAQs\n\nWhat is Bitcoin? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Bitcoin is a cryptocurrency, an electronic version of money that verifies transactions using cryptography (the science of encoding and decoding information). As Bitcoin educator, developer, and entrepreneur Jimmy Song says, Bitcoin is \"decentralized, digital, and scarce money.\" Bitcoin is decentralized because this code is run by thousands of computers (i.e., 'nodes') spread across the globe, digital because it exists as a set of code that determines how it operates, and scarce because its code caps its overall volume to 21 million bitcoins.\n\nWhat is Ethereum? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Ethereum is an open-source, decentralized computing platform network. The Ethereum network works like the Bitcoin network in that it's built on blockchain technology, essentially a digital public ledger where financial agreements can be verified and stored entirely by software — without the intervention of a third party.\n\nWhat are privacy coins? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Privacy coins are cryptocurrencies that obscure transactions on their blockchain to maintain the anonymity of users and their activity. Participants in a transaction will know the amount transacted and the parties involved. However, the same information will be unobtainable to any outside observer.\n\nWhat is a crypto wallet? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. A crypto wallet is a software program or physical device that allows you to store your crypto and allow for the sending and receiving of crypto transactions. A crypto wallet consists of two key pairs: private keys and public keys. A public key is derived from the private key and serves as the address used to send crypto to the wallet.\n\nWhat is hash rate? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Hash rate is a measure of the total computational power being used by a proof-of-work cryptocurrency network to process transactions in a blockchain. It can also be a measure of how fast a cryptocurrency miner's machines complete these computations.\n\nWhat is yield farming? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Yield farming is a means of earning interest on your cryptocurrency, similar to how you'd earn interest on any money in your savings account. And similarly to depositing money in a bank, yield farming involves locking up your cryptocurrency, called \"staking,\" for a period of time in exchange for interest or other rewards, such as more cryptocurrency.\n\nWhat is crypto staking? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Crypto staking is similar to depositing money in a bank, in that an investor locks up their assets, and in exchange, earns rewards, or \"interest.\" \"Staking is a term used to refer to the delegating of a certain number of tokens to the governance model of the blockchain and thus locking them out of circulation for a specified length of time,\" says Nicole DeCicco, the owner and founder of CryptoConsultz, a cryptocurrency consultancy in the Portland, Oregon area.\n\nLouis DeNicola Louis DeNicola is the president of LD Money Media LLC and an experienced writer who specializes in consumer credit, personal finance, and small-business finance. He is a Nav-certified credit and lending specialist, a multi-year attendee of an 18-hour advanced credit education seminar, and a volunteer tax preparer through the IRS's VITA program. Louis works with various publishers, credit bureaus, Fortune 500 financial services firms, and FinTech startups. In addition to Insider, you can find his work on Experian, FICO, Credit Karma, FICO, and Lending Tree. You can connect with Louis on LinkedIn or reach out to him directly at ladenicola@gmail.com Read more Read less Tessa Campbell Investing and Retirement Reporter Tessa Campbell is an investing and retirement reporter on Business Insider’s personal finance desk. Over two years of personal finance reporting, Tessa has built expertise on a range of financial topics, from the best credit cards to the best retirement savings accounts. Experience Tessa currently reports on all things investing — deep-diving into complex financial topics, shedding light on lesser-known investment avenues, and uncovering ways readers can work the system to their advantage. As a personal finance expert in her 20s, Tessa is acutely aware of the impacts time and uncertainty have on your investment decisions. While she curates Business Insider’s guide on the best investment apps, she believes that your financial portfolio does not have to be perfect, it just has to exist. A small investment is better than nothing, and the mistakes you make along the way are a necessary part of the learning process. Expertise: Tessa’s expertise includes: Credit cards\n\nInvesting apps\n\nRetirement savings\n\nCryptocurrency\n\nThe stock market\n\nRetail investing Education: Tessa graduated from Susquehanna University with a creative writing degree and a psychology minor. When she’s not digging into a financial topic, you’ll find Tessa waist-deep in her second cup of coffee. She currently drinks Kitty Town coffee, which blends her love of coffee with her love for her two cats: Keekee and Dumpling. It was a targeted advertisement, and it worked. ExperienceExpertise:Education: Read more Read less"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQZlNCd2ZTX3YxVkpQNG0xTW1PSjhFOHVXYWtaS21iNmx2SVBrcGtHdm80N3J1WkJ1NURoWDdoa29wRmpTSW0zTlIybTluaE5SNXFISF9pZERQY1doTFhIOG1EOHVXTGhWU1ZSX3hQdzNzN25zNjF0NEVvcGJRTkxiM3NwRVQzUDJFclZaeHlzVnpMR1d3TklObWRiNkN5enJWWVdXT1RPeFRKQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETPs Could Help ETH Price Surge Past $5,000: Bitwise CIO - CryptoGlobe",
        "content": "Matt Hougan, Chief Investment Officer at Bitwise Asset Management, is forecasting a bright future for Ethereum, predicting the cryptocurrency will surpass its all-time high by year-end thanks in part to the launch of spot Ethereum Exchange-Traded Products (ETPs) to trade above $5,000.\n\nIn a new blog post, Bitwise noted that he believes that the launch of these Ethereum ETPs “could be choppy,” as “money may flow out of the $11 billion Grayscale Ethereum Trust (ETHE) after it converts to an ETP.”\n\nPer Hougan, since the launch of spot Bitcoin ETPs these funds have “brought more than twice as much Bitcoin as miners have been able to produce,” with these ETPs buying up 263,965 coins while miners produced 129,181 BTC since their launch.The result was Bitcoin’s price rose.\n\nSource: Bitwise\n\nHougan’s bullish outlook hinges on three key factors that differentiate Ethereum from Bitcoin.First, Ethereum boasts a significantly lower short-term inflation rate compared to Bitcoin when its ETPs debuted.\n\nWhile Bitcoin saw an inflation rate of 1.7%, Ethereum currently sits at nearly zero as consumed ETH is burned on the network. This balance between new coin creation and network activity creates a more favorable supply-demand dynamic for Ethereum, potentially pushing prices upwards.\n\nSecondly, Ethereum’s Proof-of-Stake system reduces selling pressure on the market. Unlike Bitcoin miners who must often sell newly minted coins to cover operational costs, validators on the Ethereum network face no such pressure, translating to less forced selling of ETH, further bolstering its price.\n\nLastly, a significant portion of the Ethereum supply is currently unavailable for sale as roughly 28% of all ETH is staked, while an additional 13% is locked up in decentralized finance smart contracts. With nearly 40% of the total supply effectively removed from circulation, scarcity could drive prices higher, he argued.\n\nHougan anticipates these factors, coupled with an estimated $15 billion flowing into new Ethereum ETPs over the next 18 months, to create a perfect storm for Ethereum’s price surge.\n\nWith the cryptocurrency currently trading at around $3,400 after moving up 11%, it’s well below its previous peak. To Hougan, it is likely that Ethereum will not only challenge its all-time high but potentially surpass it.\n\nFeatured image via Unsplash."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNTGt5eGF2dWFEVVp0YWhYdndBZGxUaVBFY0RjSjRvQXRXQjkzNVdpMHZKNDJ4TnpmNk1uclVEOThLYzIyR1NUSXIxeTBHVktZS0k0dEMwNkVFR0lxdklHN3lrVGtNSVVVZHVQdXlwN2hrZ3o5c3FUMnBCRGgtYmQ4UERBT1lZNVp2X3RTN0FVa1czZmplUnhwRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Is Ethereum a No-Brainer Buy After the Bitcoin Halving? - The Motley Fool",
        "content": "The world's second largest cryptocurrency still has near-term catalysts.\n\nMany cryptocurrencies pulled back a couple of years ago from their all-time highs as rising interest rates drove investors toward more conservative investments. Yet three tailwinds have lifted the broader market this year: expectations for lower rates, the approvals of the first Bitcoin (BTC -4.01%) spot exchange-traded funds (ETFs) in January, and Bitcoin's halving in April.\n\nBut now that Bitcoin has concluded its long-awaited halving, which reduces the rewards for mining Bitcoin every four years, there will probably be fewer near-term catalysts for the world's top cryptocurrency. So is it time to turn our attention toward Ethereum (ETH -6.78%), the world's second largest cryptocurrency, for bigger gains this year?\n\nThe differences between Ethereum and Bitcoin\n\nEther is the native token of the Ethereum blockchain, which was launched in 2015. Ethereum initially used the same energy-intensive proof of work (PoW) mining method as Bitcoin, but it transitioned to the more energy-efficient proof of stake (PoS) method in a process called The Merge in 2022. That transition reduced Ethereum's mining energy consumption by 99.95% and made it deflationary -- which meant more coins were being burned, or permanently removed from circulation, than created. PoS blockchains also allow investors to stake, or lock up, their tokens for fixed periods to earn interest-like rewards.\n\nThe Ethereum blockchain was also developed to support smart contracts, which can be used to create decentralized apps (dApps), smaller tokens, and other crypto assets. Bitcoin's blockchain can be used only to mine more coins. That's why Ethereum is usually valued by the expansion of its developer ecosystem, while Bitcoin is often compared to gold or silver.\n\nThat key difference drove the U.S. Securities and Exchange Commission (SEC) to say that Bitcoin was the only cryptocurrency that could be classified a commodity. That classification supported its approvals of the first spot Bitcoin ETFs.\n\nYet the SEC was reluctant to call Ethereum and other PoS coins commodities, saying the staking process made it similar to securities. Nevertheless, the SEC still cleared the way for Ethereum's first spot-price ETF applications earlier this year.\n\nThe tailwinds and headwinds for Ethereum\n\nEthereum's biggest near-term catalyst will be the potential approvals of its first spot ETFs. The SEC has already reportedly granted preliminary approvals to at least three of the eight planned spot-price ETFs, according to Reuters, and the latest speculation suggests most of those funds could start trading as early as July 23.\n\nEthereum's price has already risen about 50% this year, but the first spot ETFs might drive its price even higher. For reference, Bitcoin's price has rallied more than 40% since the approvals of its first 11 ETFs on Jan. 10.\n\nAnother major catalyst is Ethereum's recent Dencun upgrade, which increases its speed and reduces the gas fees -- essentially network user fees -- for its Layer-2 blockchain. Stabilizing and declining interest rates could also drive investors back to Ethereum and other cryptocurrencies.\n\nYet Ethereum still faces unpredictable headwinds. The Dencun upgrade made Ethereum inflationary again, and its supply will keep rising unless more tokens are burned. It also still processes transactions at a slower rate than newer PoS blockchains such as Solana (SOL -6.89%) and Cardano (ADA -9.13%) -- and those limitations could curb the expansion of its ecosystem.\n\nEthereum's planned spot ETFs also won't feature any staking mechanisms like its underlying tokens, so it might not be a compelling alternative to directly owning the cryptocurrency. Lastly, the market's expectations for lower rates and ETF approvals might have already been baked into its current price.\n\nSo is Ethereum a no-brainer buy right now?\n\nEthereum is trading at about $3,400 as of this writing, but some bullish investors expect it to generate huge gains during the next few years. VanEck's Matthew Sigel and Patrick Bush expect its price to more than triple to $11,800 by 2030, while Ark Invest's Cathie Wood says it could be worth a whopping $166,000 by 2032.\n\nWe should take those rosy estimates with a grain of salt, but I believe Ethereum's spot-price ETF approvals and lower interest rates should limit its downside potential this year. The Ethereum network's next planned upgrade, Pectra, should further increase its speed and lower its gas fees to keep pace with Solana and Cardano. Therefore, I believe Ethereum is still a good cryptocurrency to accumulate right now -- but investors shouldn't necessarily expect it to blast off in the next few months."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxNdkJ0dC1uVG84UzREZzluazk0eDRacGkwc2prLWNGOUhwSU9sZmpIdmRwVFY3c2d1Skd4MXR2RFB4NG5HTjJ1UFlDeHdzRWt1VVpaaWFvanhYUzMxcnJ2WHdPcGRWdjUzS0tIX0Uxb0RFSGkyS0NXV0NxOUdpaG9PRnUxX2FWLXlYY0V5d1Z3Tm1CSEszam00N2dpMkFtbVE1RHN2am1LLWw0cVA4bmhqR0RBZnNvWUJ5MjZrM3VDTElxVHcyTG5fb25iQXAzNVRRbjIzYkgwaVp0UHJ1dUUzcmFGX2pjaVdUcEg4dTZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Passes $3.3k As SEC Gives Preliminary Approval To ETH ETFs - Indiana Gazette",
        "content": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada\n\nZip Code"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNZVRaYkZCeG50OHdZcG1UR0NlZWhSRGRWX0tEbmh4a0c1YVJIRGp2MmEyMUV4cGs1dkZVRkVOTnFlVG9kaWQ3eVpJdERUTjlEaVNoNWJCOS0zSEhKMER0UTR6eWtmM3BRM1VSSEVrY1hOMmNzcWxfRjhodlR2eGFxSEJQRmgwYzctR2tWM3k5WVFYUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Cboe confirms trading launch of 5 spot Ethereum ETFs on July 23 - CryptoSlate",
        "content": "The Chicago Board Options Exchange (Cboe) issued listing notifications for five new spot Ethereum exchange-traded funds (ETFs) scheduled to begin trading on July 23 — confirming reports from earlier in the week.\n\nThe notifications clarify that the funds are pending final regulatory approval. The five ETFs are 21Shares’ CETH, Fidelity’s FETH, Franklin Templeton’s EZET, Invesco’s QETH, and VanEck’s ETHV.\n\nEach ETF will be listed on Cboe’s BZX Exchange and quoted on the SIAC Tape B data feed.\n\nSenior Bloomberg ETF analyst Eric Balchunas reported on July 15 that the SEC had instructed issuers to submit final amendments in preparation for a trading launch next week.\n\nSources told Balchunas that the regulator would give the final green light on July 22, setting the stage for a Tuesday trading launch. The issuers subsequently filed amended S-1 forms on July 18, revealing the final details for their funds, including sponsor fees.\n\nThe introduction of these ETFs is anticipated to enhance Ethereum’s liquidity and market depth. Analysts predict that the ETFs will attract a broad range of institutional investors who have been cautious about direct cryptocurrency investments due to regulatory uncertainties.\n\nThe ETFs are expected to pave the way for further institutional adoption, potentially driving Ethereum prices higher. Some analysts project that the token will climb above $5000.\n\nThe launch of these ETFs could mark the beginning of a broader trend of integrating digital assets into traditional financial products. The SEC’s decision may influence other jurisdictions to follow suit, potentially leading to a global expansion of crypto ETFs.\n\nSome firms have already begun work on ETFs linked to other major crypto tokens like Solana and Injective. However, some experts believe the lack of a regulated futures market for these tokens could be a challenge in securing approval.\n\nEthereum was trading at $3515 as of press time, up 2.2% over the past 24 hours, based on CryptoSlate data.\n\nBitcoin Market Data At the time of press 12:43 am UTC on Jul. 20, 2024, Bitcoin is ranked #1 by market cap and the price is up 4.22% over the past 24 hours. Bitcoin has a market capitalization of $1.32 trillion with a 24-hour trading volume of $36.95 billion. Learn more about Bitcoin › Bitcoin $66,736.68 4.22% Crypto Market Summary At the time of press 12:43 am UTC on Jul. 20, 2024, the total crypto market is valued at at $2.43 trillion with a 24-hour volume of $83.85 billion. Bitcoin dominance is currently at 54.19%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxORkcyN2Q5aXBYamdOTU1RanZGbUR1VEUyanpaOG1lVTR3LXh2Yy1IOEttMUtvQUZETTlBRHdEb2drLWpCa3RCbkJ4ZkFfM0ZORzdBM243NVFfZi1UdEhzSTVNc2l3TXlOdGh0eG9vczRLLXp6NW9pMWZOVDJoV1gwYndBa3NOeWo0dFFqXzdn0gGWAUFVX3lxTE9RdkdvQUZlR25EWDVBbHJrX3FsX2ZXZmQxNl9SeXZWNXRCa2UwQzJBWDhQbGdlV05xUFFaRWNaYm9hODIzVWt2eGZnYnZZRzBhbktoMlVEUktnSmRsWWJNLUlqUTFoT0F0TllsUGZzVVFsZkVRdDlUek54bGkzc0dFbjlRNkg4LW01UkkzTGNpM3BYUUNfZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Galaxy Digital Acquires Nearly $1 Billion in Ethereum in CryptoManufaktur Deal - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nGalaxy Digital Holdings, a digital assets financial services firm, has topped up its coffers with nearly $1 billion in staked ETH, just days before spot Ethereum ETFs are expected to begin trading in the U.S.\n\nThe Michael Novogratz-owned firm said on Friday in a statement that it had taken ownership of the tokens in its acquisition of node operator CryptoManufaktur (CMF). It did not disclose the terms of the deal.\n\nThe acquisition has grown Galaxy Digital's total percentage of staked crypto tokens by roughly 43%.\n\n“Galaxy is rapidly expanding its… staking capabilities and capacity to provide enterprise-grade technical expertise and support to strategic corners of the digital asset ecosystem,” Zane Glauber, who leads Galaxy’s blockchain infrastructure team, said Friday in the statement.\n\nAD\n\nAD\n\nGalaxy Digital’s purchase of CMF brings its total assets under stake to roughly $3.3 billion, according to the company’s statement. Galaxy Digital did not immediately respond to Decrypt's request for comment on the terms and timing of the deal.\n\nETFs stoke ETH staking\n\nGalaxy Digital’s play for CMF's staked Ethereum tokens comes as U.S. regulators appear poised to green light the first batch of spot Ethereum ETFs for trading next week.\n\nIt’s a development that could bring the token's holders big returns: Bitwise Chief Investment Officer Matt Hougan predicted Wednesday that the funds’ approvals could push ETH's price to $5,000.\n\nSpeculation that ETH’s price will skyrocket in the near future has led to a broader increase in tokens being locked up on the Ethereum network. As of publication time, more than 33 million Ethereum tokens (worth $114 billion), or roughly 27% of the total ETH supply, is being staked and earning rewards, Coinbase’s data shows.\n\nAD\n\nAD\n\nEdited by Andrew Hayward\n\nEditor's note: This story was updated after publication to clarify that the acquisition grows Galaxy's total staked crypto assets by 43%, not exclusively Ethereum tokens."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPaXFTVW4tOTZ4UzY3ZFZEMGlMLUhFTzhpVlIwYkwtNmFTcGdLeTFocnBDSVE2STJBbGdKMXV1cVdqSXdwNy1lc1czQWtrTnQybUxhd0lrRDk0UHVETkxMVExrUE1QYjh6YjgzSE1mcm14dk1WczFNRXlPWGREdW1Ud1VucUtUM1RnZVBrQWRGRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Derivatives Market Flat Despite Imminent ETF Launch - Yahoo Finance",
        "content": "Ethereum Derivatives Market Flat Despite Imminent ETF Launch\n\nEthereum (ETH) experienced a notable rally in the past week, gaining 10.4% to reach up to $3,500. However, it encountered strong resistance at the $3,500 mark, and is currently trading at $3,416, down 0.20% in the past 24 hours. The United States Securities and Exchange Commission (SEC) approved two additional spot Ethereum exchange-traded funds (ETFs). Despite this seemingly positive development, the derivatives market for Ether has shown minimal excitement.\n\nThe SEC has reportedly granted preliminary approval to at least three issuers to start trading spot Ethereum ETFs on July 23, with a total of eight waiting for final regulatory approval. Matt Hougan, Chief Investment Officer at Bitwise, is optimistic about Ether’s price hitting $5,000 by the end of 2024. He cites factors such as Ether's low inflation rate, minimal costs for validators, and the fact that 28% of its supply is locked in staking.\n\nDespite these forecasts and the overall crypto market capitalization increasing by 43% year-to-date in 2024, Ethereum investors remain surprisingly cautious. Typically, futures contracts should trade 5% to 10% higher than spot markets due to their extended settlement periods. Currently, the annualized premium for Ether's fixed-month contracts stands at 11%, indicating moderate optimism. However, this indicator has not maintained levels above 12% in the past month, raising concerns given the expected inflows from the upcoming spot ETF launch in the US. Similarly, Bitcoin’s basis rate also stands at 11%, suggesting no excessive bullishness among Ethereum investors.\n\nFrom a macroeconomic perspective, the latest US Producer Price Index showed a 2.6% increase over the previous year, slightly above the anticipated 2.3%. This indicates that the US Federal Reserve still faces challenges in controlling inflation, which could continue to dampen demand. Furthermore, China's disappointing annual GDP growth of 4.7% could have negative implications for global stock markets."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBKTFBJVmJrMG9IYzQ5UUszQy1CQ3k2S3cxbjI0bmdJT1pNanNWVnRUNFZua1U5NGhRbnNkdWdGTU5TY3EyRVI5Rlc0LXB4N2M5c3paS2ZjRVdkWFRsUE9KTFc1dWNSQzdwSTlfd2Yyc1Y5V251?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Ethereum On The Verge Of Breaking $3,500 Resistance: Analyst Predicts $4K Surge - TronWeekly",
        "content": "Popular cryptocurrency trader Crypto Jack posted a convincing Ethereum (ETH) price prediction. In a recent post on X, the analyst analyzed that Ethereum is on the verge of achieving a major achievement after struggling to overturn resistance at $3,500. This could potentially open up the possibility of a new target of $4,000.\n\nCrypto Jack emphasized the importance of the current level of Ethereum that is considered resistant. After the breakout of the triangle, ETH faced the resistance at $3,500. This struggle is almost over, or at least, the signs on the market could signal an inclination towards an upward direction.\n\nTraders and investors have paid a lot of attention to ETH’s price pattern and movements. Consequently, ETH tends to evade major trends since it remains the second biggest cryptocurrency based on market capitalization. The $3,500 resistance has been both psychologically and technically a major hurdle to ETH from attaining its desired value. Going beyond this level might be an indication of a strong bullish market that would further boost the market sentiment.\n\nEthereum Poised For Breakout\n\nCrypto Jack’s $4,000 target prediction supported by a technical analysis of ETH and the current state of the market. He mentioned that a triangular patterned breakout in the chart indicated the likelihood of an upward trend. He said that it is soon going to cross it and become a much higher number and asked the crypto fraternity to get ready for the next resistance level.\n\nThe prediction towards Ethereum to hit $4,000 has well captured the interest of the cryptocurrency space. This bullish aspect is further supported by the fact that Ethereum seems to be expanding on the technological front with newer developments and integrations in the sectors of DeFi, NFT, and smart contracts.\n\nThe overall sentiment seems to be charging up with the crypto market’s center of attention being on the price of Ethereum. Bitcoin has also gone up and is giving a good sign to altcoins such as ETH hence giving a positive view for the altcoins. From Crypto Jack’s recommendations, one is inclined to support the premise that Ethereum is about to rally big time.\n\nCrypto Jack predicts that there may be a revolutionizer that would catapult ETH to $4,000, and everyone in the crypto space would wallow in it. While market trends continue to develop, Ethereum is waiting on the sidelines and looking forward to the start of the bullish trend to buy it."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNelV1MFQxajB3VDhBcmtGRFU2T1ZkV3R0OEo2MnZRa0JzUFZyNFB2T05zSmhXQ0hXX1RucTlaRnVlLXdXVmFxSmZ2YWR0OFlIaWdva214dnFlZTNSV0dFSElzVEx1cWhVSndIRHBzUXpKc1VpajdfZ3RWbExrc29FYWphUGRTNXZwTElUTlhucl9kZ2RNc1RwYkM4clEzanBoMHROUVU4d2Y4c0NQcVhHSU5KRXlfZjhPbVRoLURVRldKek5TV0JHM9IBzgFBVV95cUxQaTdYV2tmUDl3MWdjMG9JUEp6ckdxem9DcDFaNWZhSTNfLS1QZC01Y2FOcHZuaFZPY1lyQS1LWDhwNEdhbDRWMnVZLUxWN05TNnUwbFNNVEdYTDRybXg4XzBSTExyeDJqTmxWNnFBSGZibnFGU25SdF9hOUZKNTNfQVdMYnBQcFNMVjlTTko3cnZlS1R2T0tvSXU4eUtJdU9TUFJuT2Jsek5ZYThRaUFRbVBXaTBNakdLc004QUdQWFktR00yTXE3UjdhejUtdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Galaxy Buys Almost All of CryptoManufaktur's Assets, Expanding Ethereum Staking Portfolio - CoinDesk",
        "content": "Galaxy has been expanding into blockchain infrastructure, adding to its primary business lines of crypto trading and investment management. Novogratz is a closely followed figure in crypto and on business TV networks like CNBC, partly because of his deep background on Wall Street, he was as an executive at Goldman Sachs, and hedge fund Fortress Investment Group."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNZ3V3cEtBUHlyRmM2MjJPUi1NR3hCTHBrcl85TXhJZG1EZVNkNGtWOWlyM0d3aV96Tk9aSjd4c0ZHWDBHZTJvUktyc1JZeG94dDQxcmVYWDNYNWFUQU1rTVNqblVsem5RT0FwcHZ4N2ZEUzNtbFlaUmdTd3JhdU13Y2tkNGctT2x6TXJKT1pqT3M0S2UzYVJTZW9qa2lYcG90MzdEQ3UwRkdXeGdreGfSAbYBQVVfeXFMUEJjdkE1TFFGNV9mNmVidDNQX0x6ZDJvTEhzWUtsNHBHNl93eHdrdHhIM3FOUmMyMUZVcFNJa0lrQ1EwREhiQ0lqLW9vSWxyQm5tb1hrYl94ZjhPcDdPRmlaSm80RWIzdmRpU01OOGoyRl8yMGFLN3NhSGVzX2w2bThoZDktVE5yTzBwRWwycGVTZ1VEVV80VWdGclZBNkpDZzM4cURjdmZZSFFIeVBFYUM5M2VYX3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Mixer Tornado Cash Has Received Almost $2 Billion in 2024 Despite Sanctions - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn the first six months of 2024, more than $1.9 billion has been deposited onto Ethereum mixer Tornado Cash (TORN). Although things have slowed down in July—the protocol has seemingly attracted only $65.1 million worth of deposits, according to data provided by crypto analytics service Flipside.\n\nGiven Tornado Cash’s nature as a mixer, the total value locked (TVL) metric used for judging an ecosystem’s activity level is not as reliable. Total value locked refers the the value of assets that have been deposited into a decentralized application. That's why TVL isn't typically used to measure activity on Tornado Cash. The expected use case is to deposit funds and then withdraw anonymized funds—rather than keep them in the protocol for a long time like with most decentralized finance services.\n\nStill, DeFiLlama data for Tornado Cash’s TVL shows sizeable growth, with the protocol starting the year at under 160,000 ETH and currently standing at nearly 168,600 ETH. In U.S. dollars, this is a growth from $374.4 million to the current value of $572.82 million — when taking asset value growth into account.\n\nAD\n\nAD\n\nWhat is Tornado Cash?\n\nTornado Cash is a coin mixer that was created to preserve the privacy of crypto users. Using zero-knowledge proof cryptography, the protocol anonymizes user deposits and allows their withdrawal to a new address that cannot be traced to the old one.\n\nThe Ethereum mixer has seen inflows from wallets associated with major hacks, including the hacker behind the Poloniex hack sending $3.3 million worth of Ethereum (ETH) to the mixer back in early May. Due to transactions linked to hacks—including some allegedly linked to North Korea—the U.S. Treasury Department sanctioned Tornado Cash in early August 2022.\n\nThis was then followed by the lengthy legal prosecution against Tornado Cash developers which was seen as a major overreach by much of the crypto community. This prosecution is still ongoing, with a last week ruling delaying the money laundering trial of Tornado Cash co-founder Roman Storm, over the objections of the prosecution.\n\nCoinbase's chief legal officer Paul Grewal said in April that the U.S. Treasury is \"bending old laws past their breaking point\" by placing blame for Tornado Cash’s misuse on developers and TORN holders.\n\nImmutable, open-source software code isn’t property, which creates a real issue for Treasury, as it’s authorized to regulate only 'property' in which a foreign national has an interest, he said at the time.\n\nAD\n\nAD\n\nEthereum co-founder Vitalik Buterin said in late May that Tornado Cash developer Alexey Pertsev being sentenced to 64-months in prison was “really unfortunate,” and continued to back privacy-centric crypto tools, encouraging people to develop “next-gen” solutions.\n\n\"I think a lot of people have been going under the assumption [...] that just building software is something that’s okay,\" he said during a fireside chat at DappCon in Berlin, \"and is a totally legal and legit way to fight for privacy.\"\n\nEdited by Stacy Elliott."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQN09TYm5hRzBjSXhkRHJKRVduRVlEaThuTTMycWR5MTF2TkNqQmEyeGU2dUJKUmNiMlRhRlNHMVJ3MUFzbHE4aktPS21rWGJ6Z2FpejBwRkZHSnplOUVOa1NxT0R1SE4yckNkVHIzR24wU3Q0MnNwTG5HU012WnJNcTI0UElUQWQ0X3REb0c2aF9heXVadlpTTFRHUHR2VkhPQVUxNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "WazirX attacker converts $235 million theft into Ethereum, holds nearly 60K ETH - CryptoSlate",
        "content": "On-chain data shows that the WazirX exploiter has converted most of the stolen assets from the Indian crypto platform into Ethereum.\n\nOn July 18, WazirX was exploited for around $235 million in several digital assets, with blockchain investigators suggesting that the North Korea-backed Lazarus Group perpetrated the attack.\n\nWhile the exchange quickly implemented measures to stop the theft, recovering the funds seems unlikely as the attacker actively converts the stolen assets into ETH, the second-largest digital asset by market capitalization.\n\nWazirX exploiter holds nearly 60,000 ETH.\n\nBlockchain analyst Lookonchain reported that the WazirX exploiter had converted most of the stolen assets to 43,800 ETH, worth $149.46 million. This brings the total ETH in the attacker holding to 59,097 ETH, valued at around $201.67 million.\n\nMarket observers suggested that the asset conversion was part of a sophisticated money laundering technique that also involves using crypto mixing services like Tornado Cash to obfuscate the transaction trails.\n\nDespite this, the exploiter’s address still has up to $15 million worth of other relatively lesser-known digital assets left. This includes 1.66 billion DENT, worth $1.56 million, and 6.76 million CHR, worth $1.72 million, among others.\n\nMeanwhile, on-chain data shows the exploiter sent 7.7 million DENT, worth $7,300, to a new Binance deposit address. Lookonchain said:\n\n“It is worth noting that the WazirX exploiter deposited 7.7 million DENT ($7.3K) to a Binance deposit address that has not been used before.”\n\n‘Force Majeure’\n\nA post-mortem report from the exchange showed that the affected wallet used Liminal’s services, a digital asset custody and wallet infrastructure provider.\n\nWazirX explained that the exploit resulted from discrepancies between the data on Liminal’s interface and the transaction’s content. It wrote:\n\n“During the cyber attack, there was a mismatch between the information displayed on Liminal’s interface and what was actually signed. We suspect the payload was replaced to transfer wallet control to an attacker.”\n\nThe exchange also described the attack as a “force majeure” event beyond its control and assured it was actively working to recover the stolen funds.\n\nMentioned in this article"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE1kYlpKdjBGaVh0d0doWTVzLWNwZ0piamlYeTdSZl9oWkxpaGFtZmMwMkZUS3U0Q0l6Rld1emNGa2RfQnIzbmNOR3QwOWdfc0lTYzJYU0xGSjFvMmhsWGZTSkdNbEE1amtrQnpTWlRoOFhnMzlP0gF8QVVfeXFMUEFQTjFyN0FIMDlpVTAtbHpzMXNNMDM5YnJIUHNDOE1mQUJUUzBFM0dRQmM0RmJNVl94YVk5NVJxMVNpeExvUzdYQ1JKVUQ1bnFEcDg3cFQyY0FZb2swOGZXQXVCRWlIMEpOcW5fY2RYNk9IV0NvRC1lX2h3ag?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Begin Trading on July 23, Cboe Confirms - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSpot Ethereum exchange-traded funds (ETFs) will be listed for trading on Tuesday, July 23, the Chicago Board Options Exchange (or Cboe) confirmed Friday via notices posted to its website.\n\nCboe said that the following spot Ethereum ETFs will begin trading on Tuesday: 21Shares Core Ethereum ETF (CETH), Fidelity Ethereum Fund (FETH), Franklin Ethereum ETF (EZET), Invesco Galaxy Ethereum ETF (QETH), and VanEck Ethereum ETF (ETHV).\n\n\"We are pleased to announce that One (1) Exchange Traded Product ('ETP') will be listed on Cboe and will begin trading as a new issue on July 23, 2024, pending regulatory effectiveness,\" each listing reads.\n\nAD\n\nAD\n\nThe date had been expected: Earlier this week, multiple sources close to the situation told Decrypt that they expected the SEC to issue final approvals for trading to begin on July 23, as the regulator was seeking final drafts of filings from firms.\n\nEthereum ETFs received initial approvals from the SEC in May in an unexpected about-face from the regulator, which had been scrutinizing Ethereum-centric firms and appeared to treat the asset differently than Bitcoin. But just four months after spot Bitcoin ETFs began trading in the United States, the SEC followed suit with initial approvals.\n\nNow, it appears that Cboe is confident that ETF operators will get their final approvals ahead of trading on Tuesday. Decrypt has a complete list of Ethereum ETFs that are expected to start trading on Tuesday, including funds from BlackRock and Grayscale.\n\nEditor's note: This story was updated after publication with additional details."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxOLWNWQTJzU1hpM0ZKYjFXQTg0ZXFXRzlmUXBrdWRhTVY3TkxlaE1ualdtT21DYmJLU0R2Um9WbVM5U0JqRXBQdm1ibzMyMkhaQWFrRmUwLWxPR2VBeWZaYl9hLVR4ZHJxQ1ZkX2c4Q3V0UDk4MU8ybkZFM1dKbEhEU3UxT1I0Rk1YVjQwYnZLNFlJalB4dWIzNW1xc05OcVVld0t1UkU5UVhpazBya1g4VVZTcHFFY0plbjBtRTlaWWhwVnlueFhfS3o2N2l1LTJxWU44aU5Ob9IB3AFBVV95cUxPN2FEbU5JOHBVS1prUHhyaEhJU21OcHgxY05qNEtJSWY0eFpWOE1OSnRSN2JFaXdCS2x2bkwwTEZEUElsd0tlVmh1TFg1dGNuQ1BRNUkwV21seGtTQ3dVaXR3a0E2aS1XYTdQaU03VkI0NGM2SDFWQTR3WWlTckltLXpnRHh0SXNJNm43aS00VEY2WXpVcVVZcFFyb0tHXzF1RDZSVXFDLW9hNHBKR2diTFo5UVNVZHM3c3Jfbml0V1RIcUVHemE5QjJKWUhET1JkWEd3ZFhRTTZOZGQ4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Crypto Trader Issues Ethereum Alert, Says ETH To Underperform Bitcoin Over the Short-Term – Here’s His Outlook - The Daily Hodl",
        "content": "A prominent crypto analyst is issuing a warning to traders, saying that Ethereum (ETH) could underperform against Bitcoin (BTC) in the short term.\n\nIn a new strategy session, pseudonymous crypto trader Kaleo tells his 642,600 followers on the social media platform X that he believes Ethereum will be outpaced by the crypto king during the next week.\n\nHowever, the strategist says that the launch of spot market Ethereum exchange-traded funds (ETFs) will eventually cause the leading smart contract platform to outpace the crypto king.\n\n“Gonna be a contrarian here and say that I believe Ethereum actually dips a bit next week vs. BTC. Lots of hype leading into the spot ETF launch (which I think is warranted), but don’t think this manifests into outperformance until a couple months later.”\n\nThe trader’s chart suggests that ETH/BTC will hit 0.1500 by the end of 2025 or at the start of 2026. According to TradingView, it is currently sitting at 0.053.\n\nKaleo goes on to note that traders shouldn’t panic if Ethereum doesn’t immediately rise after the launch of its ETFs as Bitcoin experienced weeks of choppiness before breaking out.\n\n“Friendly reminder that we didn’t see up only immediately after the BTC spot ETFs started trading. Price went up leading into it, followed by a couple of weeks moving lower afterward before things really started to rip again.\n\nPoint being – if we don’t see green candles across the board next week immediately after the spot ETH ETFs launch – it’s not the end of the world.”\n\nThe trader concludes his analysis by saying that BTC looks primed to outpace the stock market.\n\n“BTC: Strong bounce off support for the Bitcoin/SPX ratio. Looks pretty obvious BTC continues to outpace stonks from here.”\n\nEthereum is trading for $3,404 at time of writing while BTC is valued at $63,597.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQUnAyNjZtQ3B1NjdMNWJXVWE5NWplRzFmOWk1RkJqelBZZ1VpUTRGTklJX29pRDk5RmkzcTU4MUE1Z1ZKU3NWMDEzWFNyTDVVNkdfWVVMNThtRklpa2RYREpmRzhhamNabmdwbENTUnNoVE00Ukhoa2lMNGQwMnBOTHFUc0NNREFJVXVLVHdHMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "5 Tokens to Buy Before the Ethereum ETF Trade Starts - Brave New Coin Insights",
        "content": "5 Tokens to Buy Before the Ethereum ETF Trade Starts\n\nThe cryptocurrency market is currently experiencing a calm period, a sort of calm before the storm. Traders and investors are eagerly awaiting the next big bull run. During this time, altcoins present some of the best entry points. Although they have begun to show signs of rising, they haven't yet skyrocketed, making them ripe for investment. With the Ethereum ETF trade on the horizon, this transitional phase hints at massive potential gains across the board.\n\nThis article unveils five tokens that are particularly poised for impressive growth as the market braces for the ETF impact.\n\nCYBRO Presale Advances as Demand for AI-based Tokens Surges\n\nThe CYBRO presale has rapidly advanced to its fifth stage, amassing over $1.3 million. This AI-based yield aggregator offers users the potential to enhance their earnings within the Blast ecosystem, delivering unparalleled rewards for staking ETH and stablecoins. Smart investors see great potential in $CYBRO tokens as the Artificial Intelligence (AI) is the hottest trend in crypto nowadays,\n\nBenefits for CYBRO Token Holders:\n\nCompetitive staking rewards\n\nAccess to airdrops\n\nReduced trading and lending fees\n\nA robust insurance program within the platform\n\nIndustry experts forecast a potential return on investment of 1200%, with CYBRO tokens currently available at a presale price of just $0.03 each. This technologically advanced initiative has already garnered attention from prominent crypto whales and influencers, reflecting strong market confidence and interest..\n\n\n\nWith only 21% of the total token supply allocated for the presale and approximately 64 million tokens already sold, now is an opportune moment to secure a position in this innovative project, which holds significant potential to become a major player in the cryptocurrency space.\n\n>>Join CYBRO and aim for future returns up to 1200%<<\n\n\n\nHigh Hopes for ETH as Altcoin Season Nears Amid Bullish Patterns\n\nEthereum, also known as ETH, is the second largest cryptocurrency by market cap. It’s known for its smart contract technology, which allows developers to create decentralized apps. Despite recent market dips, ETH is showing strong patterns similar to 2021. This suggests the coin could see significant gains soon. Its technology has many uses and a solid track record, making it an attractive option. With the potential for a bull run, ETH stands out as a promising investment.\n\n\n\nXRP: The Hidden Gem Ready to Shine Despite Market Challenges\n\nXRP, developed by Ripple Labs, is designed for fast and low-cost international payments. Unlike Bitcoin, XRP focuses on making cross-border transactions easier and quicker for banks and payment providers. The coin’s technology allows for almost instant transfers with minimal fees, making it an attractive option in the financial world. As we see repeat patterns from 2021, XRP’s strong fundamentals and real-world use case could make it a top performer in this market cycle. Its resilience and utility make it a hidden gem worth watching.\n\n\n\nSOL’s Hidden Potential: Why Solana Could Be the Star of the Next Bull Run\n\nSolana (SOL) stands out with its fast and low-cost transactions. This coin uses a method called Proof-of-History, making it different from other coins. Developers love it because it can handle many transactions at once. This makes it great for DeFi and NFTs. With the market now looking for strong coins after the latest dip, SOL could be in the spotlight. Patterns from 2021 suggest a chance for another big rise. Solana looks very attractive as the next big thing in the crypto market.\n\n\n\nTON Coin: A Hidden Gem Ready to Shine in the Next Altcoin Boom\n\nTON Coin is catching eyes in the crypto world. Originally developed by Telegram, it’s designed for fast transactions and strong security. It uses blockchain tech to deliver blazing speed and low fees. Even with the latest market slump, similar to 2021 patterns, smart investors are seeing its potential. The unique technology and vision behind TON make it a strong contender in the next altcoin surge.\n\n\n\nConclusion\n\nETH, XRP, SOL, TRX, and TON might have limited short-term potential. However, CYBRO, an innovative DeFi platform, provides unique chances for investors. Its AI-powered yield aggregation on the Blast blockchain enhances earnings. It offers lucrative staking rewards, exclusive airdrops, and cashback on purchases. The user experience is exceptional with easy deposits and withdrawals. CYBRO focuses on transparency, compliance, and quality, making it a standout project. Strong interest from crypto whales and influencers further underscores its promise.\n\n\n\nSite: https://cybro.io\n\nTwitter: https://twitter.com/Cybro_io\n\nDiscord: https://discord.gg/xFMGDQPhrB\n\nTelegram: https://t.me/cybro_io\n\n\n\n"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNNnZ0MWFsdEFYaUpCZWVLYW85Sk01R3NwMVZqbmxMVjdqOVJHdGM4NVNua3VlZGFENWZQUW1TY0NNakxJZXUyT3FDSnFkSDZSWUluLVZ4RmZMSC1SVlZZNEpxOFFHU3Nubmtqb21aeG05X3BfOVRYUGhnQ2pLMVF1WXVsUUNoV3hiNDRtd3hkNEFSNVE0TmfSAZsBQVVfeXFMTTRuZk1XY0piVzZ3T3NySTJ1Y3lLOTBubWdoWndEbm1LZDlLa2RVVVZTMUg1aFc4UUYzVmRwSjUwS0tQTnllb2swTzhzbDdnZG5iTW1hcV9CaWhMa0RFTDFDd19nTXBuSVVtZzdLSTNESFhybHgxQjRUaDFwXzdQUGlTS29vT05MdmpPd3d2anJadGlNd05VWjZNSlU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF: BlackRock wins as Grayscale subject to ‘outrage outflows’ - AMBCrypto News",
        "content": "Grayscale’s has a hefty 2.5% fee, 10X higher than its competition.\n\nBlackRock fees are set at 0.25% as the market expects outrage flows from Grayscale.\n\nPotential Ethereum [ETH] ETF issuers updated their fee structure on Wednesday as the market prepares for potential S-1 approvals and launch of the products on July 23rd.\n\nAccording to Bloomberg ETF analyst James Seyffart, about seven issuers have waivers based on either period or assets held.\n\nHowever, Grayscale’s ETHE had the heftiest fees at 2.5%, while BlackRock’s iShares Ethereum Trust pegged fees at 0.25% post waiver.\n\nUnlike BlackRock’s 0.12% starting fee for 12 months, if net assets are below $2.5 billion, Grayscale’s ETHE will maintain 2.5% throughout after the conversion of its trust to ETF on 23rd July.\n\nEthereum ETF fee wars\n\nThis has riled the market commentators. One observer, Nate Geraci of ETF Store, termed Grayscale’s move a ‘huge miss’ and that it was disappointing.\n\nFor his part, Bloomberg ETF analyst Eric Balchunas cautioned that Grayscale’s fees were ‘10X higher than competition’ and ‘outrage outflows’ were likely.\n\n“Grayscale not lowering at all. This means they 10x higher than competition. Wow. Prob cause some outrage outflows. My guess is the Mini ETF will be dirt cheap tho, like maybe 15bps. Interesting dynamic at play.”\n\nFor perspective, indeed, the Grayscale Ethereum Mini Trust (ETH) had a similar fee structure as BlackRock: 0.25% with 0.12% as the starting fee. The Mini Trust will reportedly be spun off from ETHE after the conversion.\n\n“10% of $ETHE will be automatically spun off and into $ETH. $ETHE currently has $10 billion in assets. So $ETH should essentially start it’s life with $1 billion in assets.”\n\nHowever, despite the Mini Trust’s lower fees, some market observers projected massive outflows from ETHE.\n\nPer HODL15 Capital estimates, ETHE outflows could hit 50%-60% following the hefty fees.\n\n“Will Grayscale replicate the $GBTC fee mistake with $ETHE? If so, expect 50%-60% outflows 👇 Just over $10 Billion AUM.”\n\nMeanwhile, SEC Commissioner Hester Peirce has stated that ETH ETF staking could be open for reconsideration amidst looming political change in the U.S.\n\nOn the price front, ETH’s recent recovery hit resistance at $3.5K. The second-largest digital asset traded at $3.4K as of press time and could only eye $4K if it cleared the $3.5K."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQUlFZc2NvellZZm1odG4wb1Fkbi1OaXR5dHpYa1M3cVdrTWpxLXJaZzh1NzF0OUZFQnhnZWhqT2NGcjVDOFYtdUlpN2kySHdkTFBNcjVmUE5WN19WX1F2UkZmVkNLcXJNS0ZHb2hEUXlEcjg5Q0t3Snp5Y3MzNW9KckpTb2dZRWtvRkRfNUIzYUJiaDBSU0HSAZsBQVVfeXFMTUp0TkNEMzdQVGc5VUdhMDBkeDhzMENPT2NxX3dnTjFCZVVFQ1NXTDRYaVZaTUp1YzlEY1NPTG5RMnllbjVvQm1WVFFIbWplaWlJX0lPTGM5cm90c0lEa1o1ZkI5NXp1UHFsWV9GblBLUFpBMVRrVDhqajhXdDUwNFF2OEZNWjF6U25YYmRDTnZTQnltOFQ0TC1rZzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Withdrawals on Exchanges Skyrocket on Spot ETF Mania, Data Says - U.Today",
        "content": "Advertisement\n\nBased on Glassnode's data, cryptocurrency analyst Leon Waidmann of BTC-ECHO platform indicates massive accumulation interest of Ethereum (ETH) investors. Owners of ETH bags are moving them out of exchanges, which typically is a strong bullish indicator.\n\n$126,000,000 in week: Ethereum (ETH) investors drained exchange reserves\n\nEthereum (ETH) investors are withdrawing their riches from exchanges at an increased pace. As the multi-month trend gained traction, centralized crypto platforms lost $126 million in equivalent in just seven days. The report was shared by Leon Waidmann, a seasoned cryptocurrency analyst, with his X followers.\n\nThis trend started in March 2024, but it gained steam only in Q3, 2024. The local \"top\" of exchanges reserves amount was registered after Ethereum (ETH) set its three-year high above $4,000.\n\nAccelerated withdrawals from exchanges typically are being interpreted as an indicator of investors confidence. As such, amid the new phase of spot ETF hype, Waidmann is enthusiastic about what is next for the ETH price:\n\nAdvertisement\n\nNext big $ETH rally incoming!\n\nEthereum (ETH), the second largest cryptocurrency, is changing hands at $3,500 as of press time. In the last 24 hours, its price gained 1%.\n\nEthereum's (ETH) trading volume lost 15% and declined to $13.3 billion.\n\nSpot Ether ETF launch date finally confirmed\n\nAs covered by U.Today previously, on July 20, the U.S. Chicago Board Options Exchange (CBOE) confirmed the launch of spot ETH ETF in the United States at July 23, 2024.\n\nEthereum ETFs from Fidelity, Invesco Galaxy, Franklin Templeton, VanEck and 21Shares will be available in the first cohort of exchange-traded products based on spot Ether.\n\nWhile this event is typically expected to be a major bullish catalyst for the Ethereum (ETH) price, some experts are cautious about its role.\n\nTop U.S. bank JP Morgan foresees lower interest in ETFs on Ether compared to this of Bitcoin ETFs in January 2024."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQaUpScVMtZ0pVa3QyWHdMeWwxUnRMQzFIUlZBQlRjMXVMWnRFTktqbVk2MDJMSE5fcTM5dUhkWDBOUFFQMHdiV3RxcDVkOGFRaFlZSWlBTFJ1UzVTVTdnajE4N3BTLTFTWTFJclVHMmdmUUVLaHYydTZ4WklVYWZkbmlrc0V4ZDdvNkZ4NmJqR0t4clVwSFRWR3FsdXVhd2pJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Crypto: The Ethereum ETF Soon to Hit the Market, Here is the Key Date! - Cointribune EN",
        "content": "Sat 20 Jul 2024 ▪ 3 min read ▪ by Evans S.\n\nEvery new milestone is eagerly anticipated by investors in the crypto sphere. The latest news? The launch of the first spot Ethereum ETFs, scheduled for July 23, 2024.\n\nThe big day for Ethereum ETFs is approaching\n\nThe Chicago Board Options Exchange (Cboe) recently confirmed the date: the spot Ethereum ETFs will start trading on Tuesday July 23, 2024.\n\nAmong the listed funds, there are prestigious names such as 21Shares Core Ethereum ETF (CETH), Fidelity Ethereum Fund (FETH), Franklin Ethereum ETF (EZET), Invesco Galaxy Ethereum ETF (QETH), and VanEck Ethereum ETF (ETHV). This diversification offers investors a multitude of choices to allocate their funds according to their preferences and investment strategies.\n\nETFs (Exchange-Traded Funds) allow investors to gain exposure to Ethereum without having to directly buy the crypto. Indeed, it significantly simplifies access to the market.\n\nMoreover, ETFs offer a regulated and secure way to invest, which could attract more institutional investors, thereby bringing increased stability and legitimacy to the crypto market.\n\nThe Securities and Exchange Commission (SEC) gave its preliminary approvals in May, marking a significant shift in its position towards Ethereum.\n\nThis turnaround surprised many observers, as the SEC had previously scrutinized Ethereum-centric companies very closely, seemingly treating this asset differently from Bitcoin. Indeed, the final approval of the ETFs by the SEC, expected before July 23, is a formality eagerly awaited.\n\nWhat This Means for Investors\n\nWith these new ETFs, investors have new options to diversify their portfolios. Instead of focusing solely on Bitcoin, they can now add Ethereum to their investment strategy via a more traditional financial product. This diversification can reduce risks and maximize opportunities for gains, particularly in a market as volatile as crypto.\n\nThe arrival of Ethereum ETFs is also likely to attract more institutional investors to the crypto market. These investors, who often manage significant portfolios, are looking for secure and regulated ways to access this growing market. ETFs offer exactly that: exposure to Ethereum without the complexities and risks associated with direct crypto ownership.\n\nIt is plausible that the introduction of spot Ethereum ETFs will have a significant impact on the asset’s price. The increase in institutional demand could drive prices higher, bringing a new dynamic to the market. However, as always in the crypto world, it is essential to remain vigilant and not fall prey to excessive speculation.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOX1BhTkJBdnc4MHBiSFV5QW93bGRfSjVrRmVBZDd3UHZlNENzUGdqcVA3d3RGaDZKQlZIMXRnZnYxdmlVVkhRNjA0SE5yR3psS2lKQUFRSVZnRm9HTUd6aHd1V25aTmc4Q3FRSWQ2VHBWRWhrYVB3dE8yX2NLUGRObHpSVnQyWTd6X2fSAY8BQVVfeXFMUDBhY2pxTVJicG5YRlljZWlzdnFXdnBHc1lQaVRVcDdFeEl4VC1nSFNCTWpfRHRaOU5FMWRrenZHTzFCQWpNQndKTk5uZl9EM2YzQ2o1Q0lpVDUxam5JTDVBU0tfZTVKZlZ4NERQM1pFaUFvTFdpbGJXbTlXUV9zeVZSMG9vVFdpMjdUR21RSkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Ethereum Mini Trust, Key Spinoff Concerns Addressed - CoinGape",
        "content": "After Grayscale announced the fee slash for its Ethereum Trust spinoff to an Ethereum Mini Trust ETF, some crypto enthusiasts are curious to know more about the product. Quite a number of people are concerned about how it would operate, considering that it is a new shift.\n\nMechanics For Grayscale Mini Trusts\n\nJames Seyffart, a Senior Bloomberg ETF Analyst, took out time to explain the mechanics of the new Grayscale product. He noted that it would essentially be the same for the Grayscale Bitcoin Trust and BTC Mini Trust ETF. That is, if you own 1,000 shares of ETHE, you should receive 1,000 shares of mini ETH. This is from a share point but from a value point of view, it is quite different.\n\nadvertisement\n\nA person who has $1,000 in ETHE or GBTC, will end up with $900 in the original fund and $100 in the new mini ETFs after the spinoffs.\n\nDoing a thread on the situation for @Grayscale‘s spinoff for $ETHE & $ETH because I’ve gotten about a million questions on it. The mechanics will be essentially the same for $GBTC & $BTC spinoff. If you own 1,000 shares of $ETHE, you should receive 1,000 shares of mini $ETH. 1/ pic.twitter.com/Er66mj5L46 — James Seyffart (@JSeyff) July 19, 2024\n\nMarkedly, July 18 was initially announced as the record date for the first issuance and distribution of shares of the new Grayscale Ethereum Mini Trust. However, it has now been rescheduled for July 23 while the spinoff for GBTC to BTC Trust is scheduled to happen on July 31 as earlier announced.\n\nGrayscale BTC And ETH Mini Trusts Share Distribution\n\nAs a criteria for share distribution, Seyffart stated that one had to be the owner for those shares on the record date. He went on to say the record date was the reason for the drop in ETHE trading price on Thursday when trading commenced. Seyffart believes that GBTC will follow similar trend when its spin off happens in about two weeks.\n\nAccording to the ETF Analyst, ETHE has a current market value of $29. “Theoretically the $ETH shares would hit your brokerage accounts at a much lower handle (price per share) because you are getting an equivalent number of shares in the new fund but its 1/10th of the value of your original position. Somewhere around $2-$3 per share?”\n\nHe says the same applies to GBTC which has a current value of $59 per share. The BTC Trust should trade between $5-$6 per share based on the trading price as of today.\n\nMeanwhile, the sponsor fee for both the Grayscale Bitcoin Mini Trust and the Ethereum Mini Trust has been fixed at 0.15%. This makes the duo the cheapest crypto ETF products in the market to date.\n\nRead More: Telegram To Launch Web3-Enabled Mini App Store, Here’s All\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBVbkdCV01fX2lqaTk1QnFkYlVvcEFLTk1YbHFjVlFxUVFORm0yMThDT1ZYWEtNNEZUNGZMVHVnQmtLR2MwLTYzN2RfNk9ocEZLTmtsYnJMT0RHM3l6SUtiZGVjU1VNanh6RFRGMElmb9IBdEFVX3lxTE9pakkzaFhMM3Q0V2txN3FlV3R0Y2IwWlNRSGZZZHZzLXQtM09hU29sUnU2Z2NOdHJqbTZZbnllLVJMc01JN0lHUHBuRGVYZjZUYUNJVGlrMXpYWnR3ZVZaendpOUM1QkpLYXU1eGNJSEh6dlk4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Whales Buy $126 Million in ETH: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nMajor crypto investors, or whales, have started to accumulate Ethereum (ETH) in large numbers. This trend emerged over this past week as the ETH price managed to rebound after the crypto crash. This bullish sentiment on the market signals a sustained rebound from the leading altcoin.\n\nAdvertisement\n\nAccording to the latest data from IntoTheBlock, Ethereum has witnessed massive exchange outflows. Around $126 million worth of ETH has been withdrawn from crypto exchanges this week. This means that the Ethereum whales bought huge amounts of coins during this time.\n\nNotably, this strong accumulation trend comes ahead of the potential spot Ethereum ETF launch in the coming days. On July 17, the United States Securities and Exchange Commission (SEC) gave the green light to the proposed rule changes to list two spot ETFs.\n\nPer the official announcement , applications from two Ethereum ETF filers, ProShares Ethereum ETF and Grayscale Ethereum Mini Trust, were approved by the SEC. These spot Ethereum ETFs were approved to be listed and traded on the NYSE Arca Inc. However, official trading will commence after the approval of the S-1 filings.\n\nAdvertisement\n\nEthereum price movements\n\nAmid the ETF buzz and strong accumulation trend, the price of Ethereum has dipped 1.48% today. Currently trading at $3,408.57, the price is still up 10.9% over the last seven days. This means that ETH is still in the bullish zone despite today’s slight decrease in its value. Moreover, the broader prospects of ETH are looking optimistic."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQTGlmaWxXVnFHRFpzelpFc0Q5RlhPWEdOdFpjSkt2Y0ZmS1hZcVhwX3dZSUVyTjVEQ1hfLTZ3TUR1S0JncFNkdTVJN09LcWxna21FYWRWc2RGdWdpWjZFY3NtTEk4RVpOaWJobzhLZ1FFSEU2UjF3Q21RNC1Eblc4eGoyRFo2ZGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Five Spot Ethereum ETFs To Launch on July 23, CBOE Says - Watcher Guru",
        "content": "Five Spot Ethereum ETFs, including Fidelity and VanEck, are set to launch on July 23rd, according to the CBOE exchange. Cboe posted new issue notifications Friday afternoon, which are procedural for ETF launches, revealing the Ethereum ETF launch date.\n\nJUST IN: Five Spot Ethereum ETFs to launch on July 23, Cboe confirms.\n\n\n\n• VanEck\n\n• Invesco\n\n• Fidelity\n\n• 21Shares\n\n• Franklin Templeton — Watcher.Guru (@WatcherGuru) July 19, 2024\n\nCboe will house most of the first trading of Ether ETFs. The exchange has revealed that trading will commence next week. These include the Fidelity Ethereum Fund, the Franklin Ethereum ETF, the Invesco Galaxy Ethereum ETF, the VanEck Ethereum ETF, and the 21Shares Core Ethereum ETF. “We are pleased to announce that 1 Exchange Traded Product (‘ETP’) will be listed on Cboe and will begin trading as a new issue on July 23, 2024,” the exchange said.\n\nAlso Read: Ethereum: Will ETH ETF Have a Bigger Impact Than Bitcoin Did?\n\nHow Are Firms Pricing Their Ethereum ETFs?\n\nSource: Unsplash\n\nEther ETF applicants first received 19b-4 form approvals back in May. However, there has been a delay in wrapping up final loose ends. In addition, firms disclosed fee amounts in amended registration statements on Wednesday:\n\nFidelity set its fee at 0.25% and said it would waive it through the end of 2024.\n\nFranklin Templeton said it will waive its fee until Jan. 31, 2025, on the first $10 billion of the fund’s assets.\n\nVanEck said it will waive its fee for a year after the fund is listed for the first $1.5 billion.\n\n21Shares set a 0.21% fee, which will be waived for six months starting when the shares are listed or during the first $500 million, whichever comes first.\n\nAlso Read: Pepe Coin’s 390% Boom: Next Big Crypto?\n\nFurthermore, an interesting note is the timing of the approval. The SEC is greenlighting the launch date of the Ethereum ETF during the biggest Bitcoin conference of the year. That week will be a memorable one for all of crypto, as BTC and ETH represent the only two cryptocurrencies with an ETF in the US.\n\nNow, all eyes are on what token could be next. There has been a lot of anticipation surrounding a possible Solana ETF soon. Crypto ETFs have entered the spotlight. As a result, the opening week performance of Ether ETFs may dictate how easily the next ETF is approved in the future."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxNcFhuQkloc2hOTEZnbXc2T0xuYzJweGM0MXZqczdQY1A0MTAyVFlSX2c3ZWF0cThfUkZYdUo5ZEFnVFk1TUExaEpwLU50RnEzRGJUc1pqMUdzaVRpWnBRRlVLQnRENnBta1M0V05wNXVnZmlCaGpiYkMxSjFvNnUxM0RQZ3dZOVVoSlV6RXBDeFIzOEpPU0RoS1pDb3VMWHVkeUktSG1tWkhEZUY3ZWhBQk9DVThWcUVxVW5qMEpIZ0RqckRxTGJXYmVZR1NOUG45SGFEREtHMFNndUc50gHiAUFVX3lxTE9ndGRkU0txeDFQcHAwbDVhS1B5R290aURpdXU3SlVOYU9temFqLWtLM1Q1bWhEdk4wdFlMWk9PdFVKYjExZGxqNjN1OFV3dVlGODNlSWYzTFRLVE5USFpDV2ZoUUkzSGl0WFdQLXZTS1lfTHQzdE9aQlVqQ1hoUFpIMnZDcExSWF9UNTQ5N25TVnhOUHU1dV9MRzg3MzlvcERkWW5tTGl3SzVqb1czdXR0X2xseTFuUDl6dUJ5UVVHN3dRbUZUSXp3T2Y4UVZoRURoT1VwWWp1R1ctMEFzbWQ3LVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Grayscale's fee poised to slow down ETH ETF flows amid dump from Ethereum Foundation - FXStreet",
        "content": "Grayscale's Ethereum Trust fee could spark outflows, canceling out potential inflows across Ethereum ETFs.\n\nEthereum Foundation-related wallet has been dumping ETH on exchanges.\n\nEthereum could see a new all-time high if it moves above a key resistance.\n\nEthereum (ETH) is down 0.4.% on Thursday following speculations surrounding the potential negative impact of Grayscale's Ethereum Trust fees and ETH dump from the Ethereum Foundation.\n\nDaily digest market movers: Grayscale's fee, Ethereum Foundation dump\n\nThe Grayscale Ethereum Trust 2.5% fee has left many ETHE holders fuming as the asset manager maintained the high fee structure it applied to Bitcoin ETFs.\n\nSeveral analysts predicted that the move may see Grayscale's Ethereum Trust suffer increased outflow similar to its Bitcoin counterpart when ETH ETFs go live. As a result, it could cancel out potential inflows in other Ethereum ETFs, reducing the upward impact on ETH's price.\n\nEthereum ETF issuers filed their final S-1 registration statements on Wednesday, revealing fees for their respective products. The Securities and Exchange Commission (SEC) also approved 19b-4 filings of Grayscale's Mini Trust and ProShares Ethereum ETFs, two of the latest additions to the ten funds potentially launching on Tuesday.\n\nBloomberg Ethereum ETFs List\n\nMeanwhile, an Ethereum Foundation-related wallet, 0xdbe, is suspected of dumping ETH following the recent price dip after depositing 1,602 ETH worth $5.48 million to Kraken in the past few hours, according to Spot On Chain.\n\nSince June 8, 0xdbe has been dumping ETH on exchanges, potentially selling 19,488 ETH worth about $70.6 million. As revealed in the chart below, a decline followed its three large sales.\n\nPnL overview\n\nETH technical analysis: Ethereum could rally above the $4,093 yearly high\n\nEthereum is trading around $3,400, down 0.4% in the past 24 hours. The move has seen ETH liquidations reach $30.90 million, with long and short liquidations accounting for $22.08 million and $8.82 million, respectively.\n\nSince the crypto market recovery, Ethereum's Taker Buy/Sell Ratio has been in an uptrend, according to CryptoQuant's data.\n\nETH Taker Buy/Sell Ratio\n\nThe Taker Buy/Sell Ratio estimates the dominant sentiment among futures traders. Values above 1 suggest bullish pressure is dominant, while values below 1 indicate bearish pressure.\n\nIf the Taker Buy/Sell Ratio uptrend continues, ETH will likely ride the bullish wave further. And with spot Ethereum ETFs set for a potential Tuesday launch, ETH bears could see heavy liquidations.\n\nOn the upside, ETH faces resistance around $3,977, a level it has failed to overcome since descending from its yearly high of $4,093 in March. ETH options data also shows several call options with a strike price of $4,000. Hence, prices are likely to tilt towards this level in the long run.\n\nETH/USDT 8-hour chart\n\nA successful move above this resistance level could see ETH rally to a new all-time high in the coming months. On the downside, ETH may find support around the $3,000 psychological level.\n\nETH could drop to $3,360 in the short term, where $24.39 million long positions risk liquidation."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE02U21QLTZXaExBSmJBeGxBbVpveHJHaTEycEhnN2lESUZVS2YwRkw4Y3htVmk2OU9vVnZiNFFlRV8wSVViZml4dFU5TTMwaC1oalNUaXU5LVRFX3Uwc2c3SFQwTTRxTXFnYWdLOEgyZjVJYUNOUEN0NU1SSnUwZ9IBgwFBVV95cUxOMnhPam5zNEZramZpekR1Y3dLMDlucWt6d29ZZEZ6cmNUNWdzaFJrblZuWXRiM2NGel96aFNtd1Iyb051WlBRVVJhNXJsdjZOZENNcmJZdXRqNWZDbm4xeVp0RFJtV25MVUlZN3RyR0Nmb3piclhBV2YwRGx0RnFlMnNfVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 12:04:53 GMT",
        "title": "Ethereum Bullish Or Bearish? What Futures Market Data Says - Bitcoinist",
        "content": "Here’s what the data related to the Ethereum futures market suggests regarding whether the sentiment around ETH is looking bearish or bullish.\n\nEthereum Taker Buy Sell Ratio Has Observed A Strong Surge Recently\n\nIn a new CryptoQuant Quicktake post, an analyst has talked about the outlook of Ethereum based on futures market data. The focus indicator here is the “Taker Buy Sell Ratio,” which keeps track of the ETH taker buy and taker sell volumes on the derivatives platforms.\n\nWhen the value of this metric is greater than 1, it means the taker’s buy or long volume outweighs the taker’s sell or short volume and thus, a majority bullish sentiment is present in the market.\n\nOn the other hand, the indicator being under the mark implies the dominance of a bearish mentality among future users as more sellers are willing to sell at a lower price.\n\nNow, here is a chart that shows the trend in the 14-day simple moving average (SMA) Ethereum Taker Buy Sell Ratio over the last few months:\n\nThe 14-day SMA value of the metric appears to have been sharply going up in recent days | Source: CryptoQuant\n\nAs is visible in the above graph, the 14-day SMA Ethereum Taker Buy Sell Ratio has observed a rapid increase recently, implying that the balance in the market has been shifting.\n\nAlongside this spike in the indicator, the asset’s price has also seen a surge. The chart shows that a similar trend in the metric was also observed in the lead-up to the price rally in the first quarter of the year.\n\nBased on the recent trend, the quant comments:\n\nThis surge indicates strong buying interest in the perpetual market, suggesting a notable bullish sentiment. If this upward trend in the Taker Buy/Sell Ratio continues, it confirms a potential mid-term bullish trend in the market, with the price likely rallying toward higher values.\n\nIt remains to be seen if the 14-day SMA Taker Buy Sell Ratio will continue its surge in the coming days, thus confirming this possible bullish setup for the cryptocurrency.\n\nSpeaking of the futures market, the CME Group has recently seen its dominance grow in the calendar futures market for Ethereum and Bitcoin, as the analytics firm Glassnode pointed out in an X post.\n\nThe trend in the Open Interest dominance of the CME group in the BTC and ETH calendar futures market | Source: Glassnode on X\n\nThe above chart displays the data for the Open Interest dominance of the CME Group. The Open Interest refers to the number of contracts currently open on the calendar futures market.\n\nIt would appear that the CME Group now occupies 83% and 65% of the Bitcoin and Ethereum calendar Open Interests, respectively.\n\nETH Price\n\nEthereum’s recovery has stalled during the last few days as the asset’s price still trades around the $3,400 mark.\n\nLooks like the price of the coin has been moving sideways since its surge | Source: ETHUSD on TradingView\n\nFeatured image from Dall-E, CryptoQuant.com Glassnode.com, chart from TradingView.com"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQdUJNMTRLdURuZGVmSWxVdzBhOW5PdTF1dEFOenJCZVBWT2p4UVg2YjBtY0tDdGpaVjB4WlNtZE8zeDNUby1QQnhFc0VERUI0Y2NHUUVCRDB3b2pZWElRZHZKOHVpR0k3RVJyd09jS0N1VVV4dG9IS01RWE5oN0Z6OU5EXzhCRFQ0Y1NKN2JCV0ZIXzFiRlJJNkRB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 17:18:24 GMT",
        "title": "Ether: The Native Currency of Ethereum and Its Role in the Network - Cointribune EN",
        "content": "15 min read ▪ by Luc Jose A.\n\nEthereum, much more than just a blockchain, is presented as an open platform allowing for the creation and implementation of smart contracts. At the heart of this decentralized network is ether, the native currency that powers transactions and operations. This article aims to unveil all the specifics of this cryptocurrency, from its role in the Ethereum network to how it can be acquired, stored, and used.\n\nSummary 1. What is Ether? 2. Ether: The Specific Characteristics of the Crypto a. Decentralization and Accessibility b. Divisibility c. Security 3. What Role Does This Crypto Play in the Ethereum Network? a. Use for Transaction Fees Payment b. Incentives for Miners and Validators c. Facilitating the Deployment and Execution of Decentralized Applications (dApps) d. Supporting Smart Contracts 4. What About the Market Capitalization and Volatility of the Asset? 5. How to Buy ETH? a. Step 1: Choose an Exchange Platform b. Step 2: Create and Verify Your Account c. Step 3: Deposit Funds d. Step 4: Buy Ether e. Step 5: Transfer Your Ether to a Crypto Wallet 6. How to Choose a Crypto Wallet to Store Your ETH Tokens? a. Security b. Type of Wallet c. User Interface d. Compatibility e. Cost 7. What Are the Future Prospects for Ether and the Ethereum Network? a. The Evolution of the Ethereum Network b. Integration with New Technologies c. Development of Decentralized Applications (dApps) 8. Conclusion\n\nWhat is Ether?\n\nEther, often symbolized by ETH, is the native currency of the open-source Ethereum blockchain. It is a cryptocurrency that allows transactions on the network while serving as fuel to execute smart contracts and decentralized applications (dApps). Ether is distinct from all other cryptocurrencies because it has a dual function. Indeed, it is both a tradable digital asset and a means to access and interact with the various features offered by Ethereum. Its creation aims to facilitate operations on the Ethereum network by ensuring a robust internal economy and encouraging participants to adhere to the system’s rules.\n\nEther: The Specific Characteristics of the Crypto\n\nEther (ETH) possesses several characteristics that allow it to stand out and attract many investors. These include its decentralization, accessibility, divisibility, and security.\n\nDecentralization and Accessibility\n\nOne of the most remarkable characteristics of ether is its decentralized nature. Unlike traditional financial systems, where transactions are managed by centralized intermediaries, ether operates on a decentralized platform, the Ethereum network. This decentralization means that no one, no entity or organization, controls ether or the Ethereum network. This offers unmatched transparency and fairness, allowing anyone, anywhere in the world, to access and use ether without restriction.\n\nThe decentralization of ether also fosters innovation. Developers worldwide can create and deploy decentralized applications (dApps) on the Ethereum network without needing approval from a central authority. This has led to an explosion of innovative applications in various fields, including finance, real estate, and gaming.\n\nDivisibility\n\nEther is highly divisible, which makes it flexible for transactions of all sizes. One ether can be divided up to 18 decimal places, with the smallest unit called “wei.” This divisibility allows for microtransactions, which would be impossible or impractical with traditional currencies due to high transaction fees. In the world of ether, whether you want to send 1 ETH or 0.0000001 ETH, it is entirely possible. This feature is particularly useful for decentralized applications that require low-value transactions, thus facilitating economic interactions on the blockchain.\n\nSecurity\n\nSecurity is a major concern in today’s digital world, and ether excels in this area. Thanks to the blockchain technology on which it operates, all ether transactions are secured by cryptography. Each transaction is recorded on the blockchain after being verified by the network of miners or validators, making falsification or modification almost impossible.\n\nMoreover, ether allows users to retain full control over their funds through secure wallets. Unlike traditional bank accounts, where your funds can be frozen by the bank, Ethereum wallets are controlled only by their owners.\n\nWhat Role Does This Crypto Play in the Ethereum Network?\n\nMore than just a cryptocurrency, ether plays a major role in the Ethereum network. Here is how this asset contributes to the functioning and maintenance of this network.\n\nUse for Transaction Fees Payment\n\nOne of the most common analogies is to consider ether as the fuel that powers the Ethereum network. Each operation on the network, whether a simple financial transaction or the execution of a complex smart contract, requires a certain amount of ether to be completed. This portion of the cryptocurrency is referred to as “gas” and is essential for operations on the network to be processed efficiently and in a logical order. Ether is used to pay transaction fees, which are calculated based on the complexity of the operation. For example, a simple financial transaction will cost less in terms of gas than a complex operation such as executing a smart contract or deploying a decentralized application (dApp).\n\nIncentives for Miners and Validators\n\nMiners and validators play a significant role in maintaining the security and integrity of the Ethereum network. They verify and validate transactions, ensuring they are legitimate and conform to the network’s rules. In return, they are rewarded with ether. This reward is an incentive for miners and validators to continue their work, which, in turn, ensures the network’s stability and security. Miners solve complex mathematical problems to add new transactions to the blockchain, while validators stake their ethers for the right to validate transactions.\n\nFacilitating the Deployment and Execution of Decentralized Applications (dApps)\n\nEther is also indispensable for the deployment and execution of decentralized applications (dApps) on the Ethereum network. dApps are applications that run on a blockchain and are collectively controlled by their users rather than a central authority. Ether is used to pay the gas fees associated with the deployment and execution of these dApps, thereby maintaining a decentralized and secure environment for users. Developers who create dApps on the Ethereum network must pay fees in ether to deploy their applications and execute smart contracts. Ether thus facilitates innovation and the development of new blockchain applications.\n\nSupporting Smart Contracts\n\nSmart contracts are self-executing agreements where the terms between buyer and seller are directly written into the code. The parties involved automatically execute the terms of a contract when certain conditions are met. Ether is essential for the operation of smart contracts on the Ethereum network. It is used to pay the gas fees necessary to execute these contracts, ensuring that the contract terms are executed as intended.\n\nEther, the Native Cryptocurrency of the Ethereum Blockchain\n\nWhat About the Market Capitalization and Volatility of the Asset?\n\nThe market capitalization of ether is an indicator of its value and position in the cryptocurrency market. Currently, with a market capitalization of 177 billion euros, ether ranks as one of the most valued cryptocurrencies, just behind bitcoin. This high capitalization demonstrates the confidence and massive adoption that ether enjoys in the crypto ecosystem.\n\nHowever, like any cryptocurrency, the asset is subject to significant volatility. The price of ether can fluctuate considerably in a short time, in response to various factors such as regulatory announcements, bitcoin market movements, or technological developments within the Ethereum network. This volatility can present opportunities but also risks for investors and traders.\n\nEther’s volatility is often seen as a double-edged sword. On the one hand, it can offer substantial profit opportunities for savvy traders. On the other hand, it can pose a high risk for those not well-prepared to navigate the turbulent waters of the cryptocurrency market. Despite its volatility, the enduring appeal of ether lies in its technological potential and its role in the rise of decentralized applications and smart contracts.\n\nHow to Buy ETH?\n\nPurchasing ether (ETH) is a process that has been greatly simplified with the evolution of cryptocurrency exchange platforms. Here is a step-by-step guide to help you acquire ether securely and efficiently.\n\nStep 1: Choose an Exchange Platform\n\nThe first step to buying ETH is to choose a reliable cryptocurrency exchange platform. There are many platforms such as Coinbase, Binance, or Kraken that offer ether purchases. When selecting your platform, ensure it provides a good level of security, an intuitive user interface, and reasonable transaction fees.\n\nStep 2: Create and Verify Your Account\n\nAfter choosing your platform, you will need to create an account. This process typically involves providing some personal information and verifying your identity, in accordance with KYC (Know Your Customer) regulations.\n\nStep 3: Deposit Funds\n\nOnce your account is verified, you can deposit funds. Most platforms accept deposits in fiat currencies such as EUR, USD, or GBP, as well as cryptocurrency deposits like bitcoin. Deposit methods vary but generally include bank transfers, credit/debit cards, and sometimes online payment services like PayPal.\n\nStep 4: Buy Ether\n\nOnce your account is funded, you can now purchase ether. On the exchange platform, search for the corresponding trading pair, such as ETH/EUR or ETH/USD, enter the amount you wish to buy, and confirm your purchase. The purchased ether will then be credited to your account on the exchange platform.\n\nStep 5: Transfer Your Ether to a Crypto Wallet\n\nFor security reasons, it is recommended to transfer your ether from the exchange platform to a private crypto wallet. There are different types of wallets, including online, mobile, desktop, and hardware wallets. Hardware wallets like the Ledger Nano S Plus or the Trezor Model T are considered the most secure because they store your private keys offline, safe from hackers.\n\nHow to Choose a Crypto Wallet to Store Your ETH Tokens?\n\nChoosing a crypto wallet is a crucial step for any investor looking to get started with Ethereum. An adequate wallet will allow you not only to store but also to manage and use your ether securely and efficiently. Here are some criteria to consider when selecting your crypto wallet for storing your ETH tokens.\n\nSecurity\n\nSecurity is often placed at the top of priorities when it comes to choosing a wallet. A secure Ethereum wallet should offer robust features such as strong encryption, password protection, and two-factor authentication (2FA). Also, opt for a wallet that gives you full control over your private keys to ensure that you are the only one with access to your funds.\n\nType of Wallet\n\nThere are several types of wallets, each suited to specific needs. Online wallets, accessible via a web browser, are very convenient but often less secure. Mobile wallets, installed on your smartphone, offer a good balance between convenience and security. Desktop wallets, downloaded and installed on your computer, offer a higher level of security, although their security can be compromised if your computer is infected with malware. Finally, hardware wallets store your private keys offline on a physical device, making them immune to online attacks, and are often considered the safest way to store cryptocurrencies.\n\nUser Interface\n\nThe user interface of the wallet is another important criterion. An intuitive and easy-to-use interface can greatly enhance your experience, especially if you are a beginner in the world of cryptocurrencies. A good wallet should make it easy to view your balance, send and receive ETH, and interact with the Ethereum network.\n\nCompatibility\n\nBefore choosing a wallet, make sure it is compatible with ether (ETH) and other cryptocurrencies you plan to use. Some wallets support a wide range of cryptocurrencies, which can be advantageous if you intend to diversify your portfolio. It is also worth checking if the wallet supports decentralized applications (dApps) and Ethereum smart contracts.\n\nCost\n\nFinally, consider the costs associated with using the wallet. Some wallets are free, while others, particularly hardware wallets, involve a purchase cost. Additionally, watch out for potential transaction fees, especially if you plan to make frequent transactions.\n\nWhat Are the Future Prospects for Ether and the Ethereum Network?\n\nThe future of ether and the Ethereum network looks bright, with many promising prospects on the horizon.\n\nThe Evolution of the Ethereum Network\n\nThe Ethereum network has continuously evolved since its inception, with constant improvements and updates. The transition to Ethereum 2.0, also known as Ethereum 2 or Eth2, is one of the most anticipated evolutions. This upgrade aims to improve the scalability, security, and sustainability of the Ethereum network by shifting from a proof-of-work (PoW) consensus mechanism to a proof-of-stake (PoS) model. This transition is expected to significantly reduce the energy consumption of the network and enhance its efficiency, attracting more developers and users.\n\nIntegration with New Technologies\n\nEther and the Ethereum network are also likely to play a crucial role in integrating with new technologies such as the Internet of Things (IoT) and artificial intelligence (AI). Thanks to its ability to execute smart contracts and support decentralized applications (dApps), Ethereum could become a key player in developing these technologies.\n\nFor example, Ethereum’s blockchain could be used to automate and secure IoT transactions or manage data and AI algorithms in a decentralized manner.\n\nDevelopment of Decentralized Applications (dApps)\n\nDecentralized applications (dApps) continue to grow and diversify on the Ethereum network. Sectors such as decentralized finance (DeFi), real estate, and entertainment are experiencing a real revolution thanks to dApps.\n\nEther plays an essential role in this development by providing the fuel needed to deploy and execute these dApps. With the continuous development of dApps, the demand for ether is expected to grow, which could positively impact its value.\n\nConclusion\n\nIn summary, ether, the native currency of the Ethereum network, plays a crucial role in its operation and development. It serves as fuel for the execution of transactions and smart contracts, while providing incentives for miners and validators. Thanks to its decentralization, divisibility, and security, ether has become a highly appreciated cryptocurrency and has positioned itself as a key player in the crypto ecosystem. Its future prospects look bright, with promising developments in the evolution of the Ethereum network, the integration of new technologies, and the growth of decentralized applications.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQY05FS1FvS1duNEpsaTJESmI4TkFUUXQwd3J3X2xGRjBRMVpYQ3hwOFdjOXlUak5tRXo1bHhSNDZhNjU0dmtmbU1fdjNwT01qRGZFbHpONzJTMGlMY3A2elE1WWduT3FRR01sOV9BU2t3ak5SZXdxT2JpZWxHXzF5QU5JMW1mZ9IBiwFBVV95cUxQb296ZE05YS0yM3NVZ1hfNExTOVRsWUkzMnphVmc2SXc2LS1pbVE4NWpFVXExSVJtLWFPRVB1aW5XSEhMYzV0LXoyV3BlTmZMQ1lZM25sWUo4Ri1iMmxhLWM4bUVVUjNRN1RYU2xoVmcwMlhLNTdEVUhERTFOaDE1YkFXakptSEs1QlRN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Rally to $5,000 Imminent As Exchange Reserves Shrink - CoinGape",
        "content": "The cryptocurrency market is poised to end the third week of July on a bullish note. Bitcoin reached a peak of $67,466 on Friday, marking a 15% weekly surge, while Ethereum price surged to a high of $3,540, achieving a 13.7% rise over the week. Looking ahead, Ethereum will capture significant investor attention as five spot Ethereum exchange-traded funds (ETFs) are slated to commence trading on the Chicago Board Options Exchange on July 23.\n\nEthereum Price Poised for a Breakout with Upcoming ETFs Launch\n\nEthereum, the second-largest cryptocurrency by market cap showcased a remarkable recovery in the past two weeks. The bullish turnaround has boasted the assist from $2811 to $3481 registering a growth of 23.8% while the market cap surged to $419.2 Billion.\n\nadvertisement\n\nThe recent price jump above daily EMAs (20, 50, 100, and 200) accentuates a positive shift in market sentiment. Moreover, the 4-hour chart revealed the V-shaped recovery daily as the inverted head and shoulder formation.\n\nThis bullish reversal chart pattern signals a bottom formation and potential for a new breakout opportunity for traders.\n\nMoreover, the Ethereum transition to Proof-of-Stake (PoS) has catalyzed a significant decline in ETH exchange reserves, as highlighted by on-chain analyst elcryptotavo. Since the PoS implementation, Ethereum holders have increasingly opted to stake their ETH, reducing exchange liquidity.\n\n#Ethereum ticking bomb 💣 🚀 #Ethereum reserves on exchanges have been dropping since the move to Proof-of-Stake (PoS) and the approval of the #ETH ETF has only accelerated this trend. 📉💪 How much more will the ETF impact the reserves? 🤔💼 #Crypto #Blockchain #ETHNews… pic.twitter.com/sj4m6eV4lD — EL CRYPTO TAVO (@elcryptotavo) July 18, 2024\n\nThe approval of the Ethereum ETF has further intensified this trend by providing a new investment vehicle for institutional and retail investors. This scarcity effect is expected to drive up Ethereum prices as supply constraints become more pronounced.\n\nFurthermore, the Chicago Board Options Exchange (Cboe) has officially announced that five Ethereum spot ETFs, managed by VanEck, Invesco, Fidelity, 21Shares, and Franklin Templeton, are set to begin trading on July 23.\n\nThus, the Ethereum price forecast hints potential breach of the overhead neckline at $3550 and a 9% rise before challenging Flag pattern resistance.\n\nThe Ether coin has developed this continuation pattern amid the past 4 months of consolidation. The pattern’s two parallel trendlines as major resistance and support allow buyers to recuperate the exhausted bullish.\n\nThe Relative Strength Index indicator at 59% indicates a positive trend for ETH’s future and the potential of entering a high momentum.\n\nA potential breakout from flag resistance will better signal the uptrend continuation and bolster buyers to chase the $5500 target.\n\nFrequently Asked Questions (FAQs) 1. What are Ethereum spot ETFs? Ethereum spot ETFs are investment funds traded on stock exchanges, which hold Ethereum as their underlying asset. 2. What does a decline in ETH exchange reserves mean A decline in ETH exchange reserves refers to a decrease in the amount of Ethereum held on cryptocurrency exchanges 3. Will Ether price hit new high? Amid the upcoming launch of Spot Ethereum ETFs and formation of continuation pattern flag, the ETH price is well-positioned to challenged $4891 peak\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]