[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE41SkN5bVFjZjRCRzBNdG9TQkltei1xOVdWX0RvakpBYy1BcnUtWGtHUmJ2OVBacElNSUt3Y2x1QkRpZGdZa0Nzbkltdll6amVyT3RlMmdNaDI5ZGNqcHAyTkI4M1RFMFB5Nkp5T0lNTzdOSnNwbzhEdkNkTUQ5N0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 May 2024 07:00:00 GMT",
        "title": "If You'd Invested $300 in Ethereum 5 Years Ago, Here's How Much You'd Have Today - Yahoo Finance",
        "content": "Ethereum (CRYPTO: ETH) prices have historically proven very volatile. It's not uncommon to see its value double or triple in a matter of months. In other months, however, its price has been cut in half or worse.\n\nBut what about the long term? If you had invested $300 into Ethereum five years ago, and held on, you'd likely be very pleased with the outcome.\n\nHow profitable has Ethereum been over the last five years?\n\nIf you had put $300 into Ethereum five years ago, you'd have roughly $5,600 today. That's a 1,770% return, even higher than Bitcoin's 1,000% performance over the same period. The S&P 500, for comparison, increased in value by just 87%.\n\nBut before you jump in and buy Ethereum, there are a few important caveats to note.\n\nFirst, Ethereum was still a young, relatively unknown technology five years ago. The crypto industry has come a long way since then, with far greater utility, adoption, and recognition. It's possible that Ethereum's biggest days of growth are behind it.\n\nSecond, these eye-popping returns were only accrued by investors with so-called diamond hands -- that's crypto terminology for holding tight through extreme ups and downs. If you purchased Ethereum five years ago only to sell it at the start of 2023, for example, you'd only be sitting on a 640% gain. That's still impressive, but far less than what patient investors have earned. Conversely, if you purchased Ethereum at the start of 2022 only to sell one year later, you would have lost two-thirds of your original investment!\n\nEthereum has proven a terrific long term investment, but its short term movements are difficult to predict.\n\nShould you invest $1,000 in Ethereum right now?\n\nBefore you buy stock in Ethereum, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Ethereum wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $544,015!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of April 30, 2024\n\nRyan Vanzo has positions in Bitcoin and Ethereum. The Motley Fool has positions in and recommends Bitcoin and Ethereum. The Motley Fool has a disclosure policy.\n\nIf You'd Invested $300 in Ethereum 5 Years Ago, Here's How Much You'd Have Today was originally published by The Motley Fool"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNaDZvbzdFN2tCSlhzT1RPV1dMSHVMY1ltYm1Rc3JiQTBVcWxjX2pOVUpLdzh0QWFjVjVsQnprbVZKenJHbllpcWJ3SjV5TFlLbENsdVNzMDRYV2NTa2dEU3JYd0IzODRvRmhNT3NSX0xyd1hqaGJuTkZhbW9SZU0yMzU0LXN0UdIBiwFBVV95cUxNVTBnR1RtRUhKUWVOajh2bUtfSGpKR2xoeTVnbzg2UkJFTFVwSk9HMHVGYU14ekstd011Y1AySWNvMUYtUktZNnJvb0NtSXVyNzJzNUZlNXc0WlhkcE9DVlAxODYwczlEaEdLTVBiSDAwZnVnS1ZZYm1pY2J6bjBDZnE4ZC1rN1FNRWhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 May 2024 07:00:00 GMT",
        "title": "Ethereum Lead Dev Shares Crucial Message on Account Abstraction - U.Today",
        "content": "Advertisement\n\nEther developer Yoav Weiss has shared some notes on Ethereum’s road map for account abstraction.\n\nLately there's a lot of chatter about the road to full account abstraction. I wrote some notes on what we've been building and how it gets us to full AA.https://t.co/UYEM0e5QLX — yoav.eth (@yoavw) May 3, 2024\n\nIn his post, Weiss gives a detailed overview of ERC-4337, what led to its development as well as Ether team’s future plans.\n\nWhat is ERC-4337?\n\nThe ERC-4337 standard enables smart contract crypto wallets on the Ethereum blockchain, enhancing user experience with decentralized applications (dApps).\n\nAdvertisement\n\nThe concept, introduced by the Ethereum team led by Vitalik Buterin, aims to transition assets exclusively to smart contracts rather than externally-owned accounts (EOAs).\n\nERC-4337 introduces a \"pseudo-transaction\" object called a UserOperation, facilitating transactions on behalf of users and stored in an \"alt mempool\" until confirmation. This initiative marks a significant step toward improving the usability of Ethereum for dApps and smart contract interactions.\n\nBrief history\n\nWeiss discussed the origins and evolution of ERC-4337, highlighting the journey from Vitalik Buterin's initial proposal to the current focus on standardizing account abstraction (AA) across Layer 2 (L2) networks.\n\nThe development stemmed from the realization of wallet fragmentation due to custom implementations of AA by various L2 networks, prompting the need for a protocol-level standard like ERC-4337.\n\nThe road map now includes Rollup Improvement Proposals (RIPs), notably RIP-7560, aimed at facilitating the migration of L2 chains to native AA. RIP-7560 is being refined into separate optional RIPs to streamline the implementation process and address specific use cases like validation, 2D nonces, aggregation and EOA (externally-owned accounts) enhancements.\n\nFuture\n\nThe current focus has predominantly been on L2 adoption, but there's acknowledgment of the value in implementing AA on Ethereum's Layer 1 (L1). The plan is to gradually transition L2 chains to RIP-7560 while Ethereum L1 continues with ERC-4337, ensuring compatibility and a smooth migration process over time.\n\nWeiss emphasized the importance of collaboration with L1 core developers, L2 developers, and the broader community to refine RIP-7560 and ensure a successful implementation across both Ethereum L1 and L2.\n\nFeedback from developers working on the Ethereum Object Format (EOF) is particularly sought to optimize the clean separation between protocol and user-facing aspects in RIP-7560.\n\nButerin's take\n\nVitalik Buterin outlined four main goals for an account system revamp on Ethereum, emphasizing the need for key rotation and deprecation, quantum resistance, batching and support for sponsored transactions.\n\nHe highlighted the limitations of Ethereum's current end user account (EOA) model in achieving these goals, underscoring the necessity to transition the entire Ethereum Virtual Machine (EVM) ecosystem toward smart contract accounts (SCAs).\n\nButerin expressed a desire to avoid creating two separate developer ecosystems for smart contract wallets and EOAs, emphasizing the importance of cohesion and interoperability within Ethereum's development landscape.\n\nThe Ethereum core developers have recognized the importance of delivering incremental feature upgrades to enhance user experience in the short term, while simultaneously advancing a longer-term road map for Ethereum's evolution."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxQY0dsNUZSOTFPRlNjQ0YxbE0zRU9SN0NscHVuZ2FkdlVCOGF3S1NWTFZZdTlad2MySzlWeVRsUUs0Ulpkbld2WmFHal90bVpyXzZFOV9Zc2YxVmd3RkExdFprUzJFYVNnS3ZLX2NPRmFlS1JlVDNOMlJsMW9jWDVkR1JnQzJ1U1R0SGw3c1ZwZk9VYm9CcFZLXzM4TUM0UkQ3NTg1SHU5MC0xUmpXbFQ5V3JkU3dpVUlaMWhXUVluel9KbUxtTllNNzZ2YWPSAdIBQVVfeXFMT0FLNTdxNGtnUW9qaWc0SHZ6YjRXLUpVbkZaTW5tZUExWU4wanVueE92SngzcXF4R0hIZU51ZklNMm0yVUhOY3ZFQ2tSYUlaVGJuYWZUMmhFTFVYNTd3ZTZCaGNZckVobzhmUS1QUTdDQTZkcGoyMGxZemtwZC05dmltX3J6REFIVnR3UkxJQUYyN1dKZFl5b05PT2gwQmpKaVNhWVlQTHZWVGlJeUcyeWI3OTJsQmdmOW5KSDhuU3lOYnNiUGdiUDdhS1BKdWNOdUZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 May 2024 07:00:00 GMT",
        "title": "Crypto Trader Says Top Ethereum Rival Primed for Massive Bull Run Ahead, Updates Outlook on Bitcoin - The Daily Hodl",
        "content": "A closely followed crypto strategist believes that one Ethereum (ETH) competitor is ripe to witness steep bursts to the upside.\n\nTrader Ali Martinez tells his 61,400 followers on the social media platform X that he is bullish on Cardano (ADA).\n\nAccording to the analyst, ADA “seems ready for a parabolic bull run” after seeing its value drop by about 50% over the past month. Martinez points out that in 2020, Cardano saw an over 50% correction before going on a vertical rally.\n\n“In 2019, Cardano consolidated within a parallel channel, signaling an end to the bear market.\n\nFollowing the stagnant phase, ADA broke out of the channel with a 75% surge, then underwent a 56% price correction, setting the stage for an impressive 4,095% bull run.”\n\nMartinez says that a similar pattern may be playing out this time around.\n\n“Recently, in 2023, something similar happened! Cardano consolidated within a parallel channel, marking an end to the bear market. Following this period of stagnation, ADA broke out of the channel with a 72% surge.\n\nNow, ADA has undergone a 50% price correction, setting the stage for an impressive bull run ahead!”\n\nLooking at the trader’s chart, he seems to predict that Cardano will appreciate by roughly 2,080% from current levels.\n\nCardano is trading at $0.467 at time of writing.\n\nAs for Bitcoin (BTC), Martinez says that the Tom DeMark (TD) Sequential indicator is flashing a bullish signal for the crypto king.\n\nTraders use the TD Sequential Indicator to predict potential trend reversals for tokens based on the closing prices of their 13 previous bars or candles.\n\nSays Martinez,\n\n“The TD Sequential presents a buy signal on the Bitcoin daily chart. It anticipates a one to four daily candlesticks rebound for BTC.”\n\nBitcoin is trading at $62,750 at time of writing, up over 6% in the past day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNb1VlRkNBLTRkT1lDdlFLQmI5QnhQOG1mY1FSR3FjWlVZbVdMYVhBMUZuQVZaeHdrdklxZklMNjVpalFYY2NsTEZaeVNsVXFGN0VnMGpMX2FUNktIeXVvWm5IMFVGekp5ZFBOMzFpOV9vRlk1UWJYUUxPUVBsLTBJZkVOY29xSkJwd2Q0WjFVckR4cGNGMk5xVzJ4QkN1eWRHaDZSUllGbXlFcTBDeFBQSEpnNNIBuAFBVV95cUxPQzV3RlNvYzRoX242Yzh1cC1lbHk3Vnp5eHZKNy1MZXhwNmtvQ21TYS1tTFg1amRhVGwtaEg4SG5fWS0wRkUyVXQtUjFzWlBreGltdDFTZW5HaVNmX1I3OTU0T1ctbks3VDZCWFJMSzZXM2xhcmRQV1J5ckVZWWVocENaV0xOaERhN1ZTeE1FYVpJbF9lTFpSU2lZZGJ6VFU4RWk0ajNDVmhkeXVGMDJuOFJVX2FJcW9C?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 May 2024 07:00:00 GMT",
        "title": "Is the Ethereum Bull Market Back or is Another Dip Below $3K Imminent? (ETH Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price is yet to continue its uptrend following a rejection from the $4,000 resistance level. But the bulls are now showing signs of strength, perhaps staging a more considerable recovery.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nAs the daily chart depicts, Ethereum’s price has been making lower highs and lows inside a descending channel since failing to break above the $4,000 resistance level.\n\nYet, the cryptocurrency is climbing back above the $3,000 level and the midline of the channel. If the market successfully recovers back to these levels, a breakout above the channel and a continuation toward $4,000 and even higher prices can be expected.\n\nThe 4-Hour Chart\n\nThe 4-hour chart offers a much clearer picture of recent price action. The market has barely broken through the $3,000 resistance zone and is currently testing the midline of the descending channel.\n\nWith the RSI showing values above 50%, ETH is likely to break through the level and potentially continue outward to the $3,600 resistance area. In this case, market participants can be optimistic that a new bullish wave will begin soon.\n\nSentiment Analysis\n\nBy TradingRage\n\nEthereum Funding Rates\n\nFollowing the recent decline in Ethereum’s price, many futures traders have been liquidated or reversed their long positions. This can be a good sign, as the futures market has seemingly cooled down.\n\nThis chart demonstrates the Ethereum funding rates metric, which measures whether buyers or sellers are executing their futures orders more aggressively (using market orders). Positive values point to bullish sentiment, while negative ones show bearish expectations.\n\nIt is evident that the funding rates have significantly dropped compared to a couple of months ago. Low but positive funding rates can be interpreted as a bullish signal, as they show that while the futures market is not overheated anymore, the demand is still there, and the price can soon rally higher."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOZEpyUDRyaEMwMW14MlBqNG5QeFhudVI4OVBEVGNuVnlTMXFRMVd1MjJScGY3MmNXdFQtNlVHUVFPVERZcktCQXFhM0FiMW9LZXNOVmRfVXFpd1ZvTktkQmp6ejFIdUIwdkJRemNaM2V3OG5PeVR4bDFBWERNeVMyYVo3bVdJQWpiSDBsUU4xQW5MWXVGMzZNM0FNZjh4dG5xWGxwR25lSnZQdGtw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 May 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum's strong comeback, a wave of new followers revives speculation - Cointribune EN",
        "content": "Sun 05 May 2024 ▪ 3 min read ▪ by Fenelon L.\n\nThe Ethereum network saw a record influx of new users at the end of April, despite a bearish crypto market. This newfound momentum is rekindling hope, but the influence of “whales” raises questions.\n\nThe Rush Towards Ethereum\n\nAccording to Santiment, a company specializing in blockchain analysis, April 28 and 29 saw the creation of 266,600 new Ethereum wallets, a record since October 2022. This surge contrasts with the general gloom of the crypto market.\n\nSeveral factors explain this renewed interest:\n\nThe anticipation of upcoming network updates, aimed at improving its performance and security.\n\nThe recent fall in prices, perceived as a buying opportunity by investors looking for bargains.\n\nHowever, behind this improvement hides a more nuanced reality. According to CoinMarketCap, 97% of Ethereum addresses hold less than $1000 in crypto, while a handful of “whales” concentrate 41% of the circulating supply, according to Clank, a whale tracking platform.\n\nOn average, each whale owns close to 10 million ETH, equivalent to $3.7 million, giving them a considerable influence over the network.\n\nETH Stands Strong Amidst the Storm\n\nDespite concerns related to capital concentration, Ethereum has shown resilience. Its price has risen by 30% since the beginning of the year, while the general crypto market has fallen by 8.75% in one week. Currently, ETH is trading at $2971.73 with a total market capitalization of $352 billion.\n\nThis relative stability reflects investors’ confidence. According to the data available, 74% of Ethereum holders bet on the long term and keep their positions despite the market volatility. This “HODLing” (Hold On for Dear Life) mentality illustrates their belief in the project’s future potential.\n\nThe massive arrival of new users on the Ethereum network sparks optimism, fueled by the anticipation of upcoming improvements and investment opportunities due to the recent drop in prices. However, the concentration of holdings in the hands of a few “whales” remains a matter of concern for the community. Time will tell if Ethereum can maintain this positive momentum and further democratize its ecosystem.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFB6NVJiZ3RGaFA1Njg1Y1didGk0Rkt1U3FaTy04aVJTdktnU1lkYkZZak1oLUl3V2s4VlFUaFFldDNKV0xaUS1GNjhXTGlxazE1anJ3VEgwcTF0VC15N0ZMaDB4RURPVUpELVJ6Tmc2T0xPNmpPSnVXYktCci1zd9IBgwFBVV95cUxOb2VhSi1ENkRnNXA1Z3NrWjdvMnJMMm9aekNCM25iV2psMnBIS3pzelZuTnFVM1dRdGFLNDl4X1RhZ09uOEItVjlPLTZuSUdKZmdRekN0dURna2pETWg1U3BJUml1bnBqb0RIel9EYXhNb2pkclVraFZkNjdGNFN2aXh1OA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 May 2024 07:00:00 GMT",
        "title": "Solana takes on Ethereum as ‘DEX war’ takes new turn - AMBCrypto News",
        "content": "Activity on Jupiter, Solana’s biggest DEX, trumped Ethereum-based Uniswap’s numbers\n\nETH’s volume remained higher than SOL’s, while JUP and UNI sentiment differed\n\nJupiter, a decentralized exchange built on the Solana blockchain, has overtaken Uniswap as the DEX with the highest number of Unique Active Wallets (UAWs). AMBCrypto noticed this after looking at data from DappRadar.\n\nAt press time, UAWs on Jupiter exchanges were over 205,000. Uniswap, built on Ethereum [ETH], had less than 170,000.\n\nHow did this happen?\n\nUAW measures the crypto-wallet addresses that interact with a network or applications. If the metric increases, it implies a rise in user activity. On the other hand, a decrease suggests dwindling attention.\n\nAs can be seen below, Jupiter’s active wallets rose over the last 24 hours while Uniswap’s declined. However, this is not just about the DEXs mentioned. Instead, it speaks more of the competition between Solana and Ethereum.\n\nFor years, Ethereum dominated Solana on this front. However, this cycle has been different, and there are reasons attached to it too. For starters, Solana has been the chain producing most of the top memecoins.\n\nWhile a few have appeared on the Vitalik Buterin-developed blockchain, it has not been able to match Solana. For instance, you could mention dogwifhat [WIF], Bonk [BONK], and Popcat [POPCAT] as some of the memecoins that have grown incredibly on Solana. On the other hand, PEPE seems like the only major one that has come out of the other.\n\nBeyond the emergence of tokens, another factor that has played a part is the transaction fees. Investigations revealed that the cheap fees Solana offers has helped with retaining traders. Though fees on Ethereum are now lower than before, it’s still nowhere close to what Solana’s fees are.\n\nSimply put, the DEX takeover happened as a result of a combination of these factors.\n\nThat being said, on-chain data also revealed that Ethereum’s volume is still much higher than Solana’s.\n\nETH, UNI, overtake SOL, JUP on some fronts\n\nAt press time, Solana’s volume was $3.32 billion. Ethereum, on the other hand, registered a figure of $12.39 billion. On the price front though, SOL led ETH in terms of growth.\n\nAt the time of writing, SOL was changing hands at $139.03 — A 537.65% hike in the last 365 days. Within the same period, ETH’s price appreciated by ‘just’ 61.10%.\n\nShould this performance remain the same in months to come, then SOL could topple ETH all through this cycle. However, it is important to note that the DEXs mentioned have their native tokens too.\n\nFor Jupiter, the ticker is JUP. Uniswap’s UNI is more popular as it is a lot “older’ than the former. At the time of writing, JUP’s price was $1.02, representing a 75.53% hike in the last 90 days.\n\nMeanwhile, UNI changed hands at $7.08 following a 14.54% hike within the same period. Regardless of the price action though, the Weighted Sentiment of Solana-based JUP was negative.\n\nEthereum-based UNI was in the green, indicating that market participants are more bullish on it than JUP. However, sentiment without action might not affect prices as JUP might continue to outperform UNI.\n\nRealistic or not, here’s SOL’s market cap in ETH terms\n\nFor Ethereum and Solana, the battle might not stop anytime soon. Ergo, participants might need to keep an eye out for developments on their respective blockchains."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOUXB1eHQzc1dTMUo3WkpzUkdFSXVQazFKRXo2bVlaX21ZcTRnOGJFUG1OdXpucm9xVkR1dk5TSW9OUFF5RnpXRmxacEx6YUVRclRjVEd3TFI4TWZ4NTRJck9SNVlWcHVubTdWTFU0OVVnQ2l4SF9HcGlUN0d4aF8yTEtHcElkb2RzeXNCV2I1bnZDNldDd09paHNwTdIBoAFBVV95cUxNYlp6SXlMWTZrVUMtT29KeXlMczI2V3lLemFfWXg4U29kUFd2SWRkUTBSV1BROHlqd0RtUGJhNnBGN0gtYUE3TVc2NHFIY0luWEVnOGlhNVRQcHgtWUMtZ0FVUDVkM1Y0c1F3MFBlNmlBcnJTaldjQ1cwM2dJeVpxN2pGOTdSamFsR2JNWkJmemlvLVhVWUNTZGlEX2FhRDNX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 May 2024 07:00:00 GMT",
        "title": "Ripple CEO Reiterates XRP & Ethereum Not Securities, Slams SEC’s Gary Gensler - CoinGape",
        "content": "Ripple CEO Brad Garlinghouse has made a bold statement amid the ongoing legal battle with the U.S. Securities and Exchange Commission (SEC). In his latest statement, the Ripple CEO not only backed XRP but also extended support to Ethereum (ETH) as the token vs. securities controversy escalated. In addition, he slammed the SEC and its Chairman Gary Gensler.\n\nRipple CEO Backs XRP & Ethereum\n\nDuring a Fireside Chat alongside Arrington Capital Founder Michael Arrington, Garlinghouse made a scathing remark against the SEC. According to a post on X by Fox Journalist Eleanor Terrett, the Ripple CEO said that the SEC is “grossly wrong.” Moreover, Garlinghouse went on to deem SEC’s Gensler as an “unethical human being.”\n\nadvertisement\n\nFurthermore, he noted that both XRP and Ethereum are not securities. This comes after almost four years of the Ripple vs SEC court battle and the newly initiated Consensys vs SEC lawsuit. The Consensys lawsuit demands the regulatory agency to consider that Ethereum is not a security.\n\nHowever, the SEC had already once classified Ethereum as a security, which has led to contradiction in their current statement. Meanwhile, netizens have weighed in on the matter with some supporting Consensys, including the Ripple CEO. However, former Ethereum advisor, Steven Nerayoff, labeled Ethereum as a security and deemed it as an “undeniable” fact.\n\nAlso Read: XRP Price Prediction: XRP Eyes Major Reversal as Buyers Step In at $0.48\n\nXRP Vs SEC Case Update\n\nRipple’s forthcoming response to the lawsuit marks a significant milestone, especially after the SEC opposed their motion regarding the Fox Declaration. The SEC contends that the Fox Declaration merely provides a summary of XRP institutional sales rather than expert analysis.\n\nMoreover, they argue its admissibility under the law, likening it to the previously submitted Ferrante Declaration. However, Ripple is expected to challenge any assertions of financial harm stemming from the declaration.\n\nWhilst, Judge Sarah Netburn issued a scheduling order concerning Ripple Labs‘ motion to strike the new expert evidence the SEC submitted. This evidence supports the SEC’s claim for remedies and a final judgment, which could entail Ripple paying nearly $2 billion in penalties.\n\nFurthermore, following the SEC’s opposition on April 29, Ripple has three business days to file its reply as per Judge Netburn’s order. Legal experts note the SEC’s vigorous response, yet maintain that Ripple’s argument remains pertinent unless the financial records’ summary is contested.\n\nDespite Ripple’s stance, the SEC maintains that Fox’s declaration lacks personal opinion and merely reflects counsel’s instructions to assess potential pecuniary harm among institutional buyers.\n\nAlso Read: 400M XRP Just Unlocked From Escrow, Is XRP Price About To Skyrocket?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOZXRheTJvVF8yQzNjN21aTmJsZ1JzOTF3eU1yRUFzWFhpR1hkZmFvVjAxUjNSSkVneUtmTGVSN0hVUDI0NzNZeW1CUnNDWGFmaG1ZcVNnalJpeEdVVzEyM1BJeUIwUUJVQ3JWdEF3aHFnM1JDNUJ3dHJuZVRsZk5xLXpxaHNVT1J1YUZHbkRIMUFYNEFyaVR30gGfAUFVX3lxTE11OUs5TS1xTHotbnBsaGxHZXNvVy04anN5UHZiSVBZOXVOQ19BTmU2OGN6cExVa1l2cmN2ZktIbWltZGJISDdsQ1ZETC1yZm9XTUF5eEVKT2dOZzVXN1ZIaHF3ZUdzQVVCMVBJa1pEZUt2QzVPakdZYUlmbUR3dkFYN25qS1E4eUZVaTB5SHNMRVhmVGFfZjZLdlFhN19ZQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 May 2024 07:00:00 GMT",
        "title": "This Week on Crypto Twitter: Ethereum, CZ, and Roger Ver in US Government Crosshairs - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt\n\nCrypto Twitter often delivers a heavy helping of the law, but the past seven days brought a double dose.\n\nOn Monday, unredacted portions of a lawsuit filed by Ethereum software company Consensys against the U.S. Securities and Exchange Commission (SEC) revealed that the regulator has secretly considered ETH to be a security for over a year.\n\nThe bombshell news quickly sparked anger and indignation, given the fact that SEC Chair Gary Gensler has repeatedly refused to comment publicly on his agency’s view of ETH in the intervening period.\n\nAD\n\nAD\n\nIf Gensler decided over a year ago that Eth is a security he should have said so. There’s no need to keep secrets like this from the people you claim you’re protecting and who pay your salary. Absurd. — Palley (@stephendpalley) April 29, 2024\n\nEven prominent American lawmakers waded into the debate. Rep. Patrick McHenry (R-NC), chair of the House Financial Services Committee, posted a stern statement on Twitter on Tuesday, accusing Gensler of having lied when he testified before Congress about ETH’s regulatory status without revealing the SEC’s internal, pre-existing determination on the subject.\n\n#ICYMI: New court filings indicate that @SECGov Chair Gary Gensler knowingly misled Congress when pressed on the classification of #ETH at a @FinancialCmte hearing to conduct oversight of his agency. 📖 Read my full statement 👇 pic.twitter.com/8osMpbY6Iu — Patrick McHenry (@PatrickMcHenry) April 30, 2024\n\nShifting from the U.S. House to a federal courthouse, Binance founder Changpeng “CZ” Zhao was sentenced to four months in U.S. federal prison that same day. Zhao pleaded guilty to money laundering violations last year. While it was certainly significant to see yet another founder of a major crypto exchange sent behind bars, the punishment was far less harsh than the three years prosecutors were hoping for.\n\nIndeed, the prevailing sentiment on Twitter following the sentencing hearing was fairly lighthearted, with many joking that Zhao had predicted his own sentencing given his famed use of the number “4” as a signal to dismiss cynical deployments of “fear, uncertainty, and doubt,” or FUD.\n\nAD\n\nAD\n\n🚨BREAKING🚨 CZ #Binance is sentenced to 4 months in prison. Seems like he knew it👀 pic.twitter.com/ykoovo4QkA — EvanLuthra.eth (@EvanLuthra) May 1, 2024\n\nBinance gets a $4 billion fine CZ gets 4 months in prison We live in a simulation — Will (@WClementeIII) April 30, 2024\n\nZhao himself took to Twitter shortly after the sentencing hearing to share his plans for life after prison and assert that he accepted the outcome of the trial, writing, “I will do my time.”\n\nI would like to thank everyone for your care and support, be it writing letters, showing support on X, or in any other form. They all mean a lot to me and keep me strong. I will do my time, conclude this phase and focus on the next chapter of my life (education). I will remain a… — CZ 🔶 BNB (@cz_binance) May 1, 2024\n\nIf that wasn’t enough criminal crypto news for one day, only hours later the U.S. Department of Justice announced that it charged Roger Ver, an early Bitcoin investor known in some circles as “Bitcoin Jesus,” with evading nearly $50 million worth of taxes. Ver was arrested by authorities in Spain on Tuesday.\n\nMany on Twitter decried the arrest as an unjust anti-crypto provocation, given the fact that Ver renounced his U.S. citizenship in 2014.\n\nMy friend, Roger Ver, one of the most principled voluntaryists alive, has been arrested for not paying taxes to the US govt - despite not being a citizen of the United States. The government's war on crypto continues... — Sal the Agorist (@SallyMayweather) April 30, 2024\n\nOthers signaled their indifference to Ver’s plight, validating his status as a controversial personality in the crypto ecosystem.\n\nAD\n\nAD\n\nI've been here long enough to remember every shady, unethical and outright illegal thing Roger Ver has done (at least since 2014) so if you are a Roger Ver did nothing wrong crusader I highly suggest you re-evaluate every terrible life choice you have made that led you to this. — Socal Crypto, Secessio plebis (@Socal_crypto) April 6, 2024\n\nSome people found a way to reconcile both perspectives.\n\nRoger Ver is an ass. Taxation used as an ulterior form of wealth redistribution is theft. “Exit-Taxing” a non-resident is repulsive. Free Roger Ver. Nothing else to say on the matter. — StopAndDecrypt 🖕 (@StopAndDecrypt) April 30, 2024\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOdGVjMmJ6YUd0NTVxYWhzLWNvRkg4M3dqNUd1bnFqZk9FSnNaSG5fRENFS0hwR2laR0NDbzVENXJ1SVRVNFE2bWFIaC1RLTdNZDZsMTRjS3pJUUNwMVhPRW5kVTVqdjRTNkJMejdtNlVrTWd1UjdZMUxnTGZwb2NIRlptNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Saw a Huge Surge as Furrever Token Hits $1 Million Presale Milestone, Launches $10,000 Competition - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, May 05, 2024 (GLOBE NEWSWIRE) --\n\nDespite recent turbulence in the crypto markets, both Bitcoin (BTC) and Ethereum (ETH) have experienced a remarkable surge in prices over the past two days. This unexpected rally comes amidst a backdrop of uncertainty, indicating renewed investor confidence in these leading cryptocurrencies. Adding to the fervor, Furrever Token (FURR) has achieved a significant milestone, surpassing $1 million in presale funding, and has now launched a lucrative $10,000 competition, further igniting excitement in the crypto community.\n\nBitcoin's Resilience Shines as Whales Drive Market Surge: What's Next for Crypto?\n\nAmidst recent market turbulence, Bitcoin (BTC) has emerged resilient, witnessing a remarkable surge driven by whale activity. On May 3, the total market value soared to $2.18 trillion, propelled by a 10% increase in Bitcoin's price to approximately $64,300.75. Notably, over $2.8 billion worth of BTC was accumulated by whales within 24 hours, signaling renewed confidence in the market. Analysts interpret indicators such as the Spent Output Profit Ratio (SOPR) and Bollinger Bands, foreseeing a potential short-term turnaround.\n\nDespite recent corrections, market intelligence suggests key support levels and hints at a rebound, fostering optimism among investors. As Bitcoin trades at $61,721, attention turns to sustaining momentum above $59.7K, with the community eagerly anticipating further market growth and potential milestones.\n\nEthereum's Regulatory Challenges and Price Dynamics: Insights for Investors\n\nAmidst its pivotal role in the crypto landscape, Ethereum (ETH) faces a complex interplay of regulatory hurdles and market dynamics, offering crucial insights for investors. Currently trading at $3,158.07 with a 6% increase since yesterday, Ethereum maintains its position as the second-largest cryptocurrency with a market cap of $373 billion. However, the path to launching Ethereum ETFs remains uncertain, with regulatory approval prospects cast into doubt by analysts like Bloomberg's James Seyffart. Seyffart suggests that approval for spot Ethereum ETFs in 2024 is improbable, potentially delayed until 2025, citing cautious behavior from the U.S. Securities and Exchange Commission (SEC).\n\nEthereum's price trajectory reflects this uncertainty, experiencing fluctuations within a ranging channel, with bullish signals indicating potential for testing new highs. Technical indicators such as the Relative Strength Index (RSI) and Bollinger Bands provide further insights into Ethereum's market momentum and consolidation phase. As Ethereum navigates through regulatory challenges and market fluctuations, its future outlook remains a subject of intense interest, with regulatory decisions poised to significantly impact adoption and integration of Ethereum-based financial products.\n\n\n\n\n\nStory continues\n\nFurrever Token (FURR): Pioneering Cuteness in Crypto with $1 Million Presale Success and $10,000 Frenzy Bonanza Competition\n\nFurrever Token (FURR) has rapidly ascended as a darling of the investor community, captivating enthusiasts with its innovative approach and endearing charm. Priced at $0.000648, FURR injects a refreshing dose of cuteness into the crypto space, leveraging the universal appeal of adorable cat imagery to transcend traditional boundaries. This delightful experience fosters a sense of community and shared joy, resonating strongly with users seeking a break from the seriousness often associated with blockchain technology. The project's commitment to creating a user-friendly platform, complete with cute cat-themed stickers, emojis, and visuals, has struck a chord with investors. To buy FURR, investors can visit its official website, furrevertoken.com, where they can also explore the potential for up to 15X returns.\n\nThe success of Furrever Token's presale, which amassed over $1 million in funding within just two months, speaks volumes about the project's traction and investor confidence. This rapid growth underscores not only the widespread appeal of FURR but also the growing appetite for projects prioritizing user experience and community engagement. With 65% of tokens available during the presale and a prudent allocation for team tokens locked for a year to reassure investors of the project's long-term viability, Furrever Token has demonstrated a commitment to transparency and sustainability.\n\nTo celebrate its successful presale progression, Furrever Token (FURR) has announced an exhilarating competition: the Furrever Token $10,000 Frenzy Bonanza Competition! This thrilling event invites Furrever Token enthusiasts to participate in a seven-day competition on the Gleam platform, where completing various tasks earns participants points for a chance to win. With $10,000 worth of FURR up for grabs, three lucky winners will be crowned Bonanza Champions at the end of the competition. First place takes home $5,000 worth of FURR, second place wins $3,000, and third place receives $2,000.\n\nThe competition runs from 02/05/2024 to 09/05/2024, offering participants ample time to secure their spot as one of the ultimate Furrever Winners. Winners will be selected randomly through the Gleam platform, with each winner receiving the prize value in FURR tokens directly to their connected wallet. To be eligible, participants must have a minimum of $10 worth of FURR on the website dashboard. So, get ready to embark on this exciting journey and may the fluffiest members emerge victorious!\n\nIn conclusion, Furrever Token's rapid rise to prominence in the cryptocurrency space is a testament to its innovative vision, strong community ethos, and unwavering commitment to delivering a unique and enjoyable experience for users. As the project continues to evolve and expand its reach, it is poised to make a lasting impact, capturing the hearts of investors and cat lovers alike while carving out its niche in the ever-growing crypto landscape.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Furrever Token Bonanza Competition\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:Robert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOcDV3cFZaZU8tdVlHT0dJTklSZ3dHYS1uaHVzcEZjaEZPd1BTRWl6bmNtRS1VcDJvYWxQblFrV214V2NjUzRpMm9mZkl4emZpdldrQTM5QUtwUnhnQ0NEWTlwcWJVRVczQXhmNXF5aHFMNnFFNWZJN3NBMldOb3ZQbE1oQUlZdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 May 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum incinerates $12.7 billion in ETH - Cointribune EN",
        "content": "Sat 04 May 2024 ▪ 3 min read ▪ by Evans S.\n\nEthereum is distinguished by an operation of remarkable audacity in the crypto sphere: the burning of 12.7 billion dollars’ worth of ETH. This strategic move, far from being a mere supply reduction, reveals a profound vision and a commitment to the stability and longevity of the cryptocurrency.\n\nEthereum and the Reduction of Its Crypto Supply\n\nThe burning of ETH, implemented following a major upgrade of Ethereum thousand days ago, involves the destruction of a portion of the transaction fees.\n\nThis process no longer rewards the miners with these fees, but rather removes them from circulation, inducing a notable deflationary effect.\n\nTo date, approximately 4.3 million ETH have been eliminated, marking a decisive shift in the platform’s monetary policy.\n\nThis reduction in supply aims to increase the scarcity of the ETH crypto, which, theoretically, could support or increase its value in the market.\n\nComparable to stock buybacks in the financial world, this strategy can promote an appreciation of the price, thereby offering investors an opportunity for gain, provided the demand remains stable or increases.\n\nThe crypto market’s reaction to this massive burn has been predominantly positive, interpreted as a sign of maturity and responsibility on the part of Ethereum’s developers.\n\nBy controlling inflation and reinforcing user trust, Ethereum solidifies its position as a leader among alternative cryptocurrencies.\n\nEconomic and Technical Implications\n\nThrough this burn, Ethereum also improves the security and stability of its network. This makes a majority control less attractive in a Proof of Stake framework. Thus, the ETH crypto becomes more resistant to manipulation attempts, ensuring greater reliability for large-scale transactions.\n\nThe burning process also acts as a catalyst for innovation. By adjusting its economic structure, Ethereum encourages developers to design cost-optimized decentralized applications (dApps), promoting the emergence of new uses and functionalities within the ecosystem.\n\nIn the long term, this strategy could redefine the economic landscape of cryptocurrencies. Ethereum positions itself as a technological platform and a strategic economic player, positively influencing its own economy and that of the sector more broadly. Meanwhile, the rush of investors continues.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQVllBWER0Nk5ITlJHeHk3end3eGo0TThkSWRnSU5lWXllREZLX0U4UnVodkNuMDdaeW1GR1hHVEEzWnZscjlXRWpMcERjTmo5cmUzWU9pUnpvLVhVQk1adDkwLWI3dGVFblBoWnRjN3BRbkR2aWlISUlhdUZFMXQ2UjlKSl90R3Vkb1VDNWZ0eTR3WWxnUVZxNlN1NnhOLU5KLWfSAacBQVVfeXFMTVYwUFVPUVZ4YVc2ZEE4aGlqLVFUemhuczU5YmU5Uzd6NDVyelYwVU13c0h4SmFRbl9FUzkxU2xybUNMODhaSHVYSmZLY19CMjFjNnVUNnQtdjVGakRNaW41NU5sNy1VTVJYb0o0V0ZBR2k4S283bnZOWXNjZjRLUzRvRm95S1Viclh3QzFOUERhSC1OYTY3ZXY2LUNSWnExWTJlQ19kZEU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 May 2024 07:00:00 GMT",
        "title": "Bitcoin – This falling metric could be the key to Ethereum, Solana price rallies - AMBCrypto News",
        "content": "Top altcoins like Ethereum, Solana, and BNB registered major gains over the last 24 hours\n\nHowever, metrics and technical indicators weren’t all bullish\n\nBitcoin’s last 24 hours have been productive, with the cryptocurrency climbing back above $63,000 on the charts. As expected, most of the market’s altcoins followed suit, with their charts seeing green as well. However, the latter’s performances fueled a fall in Bitcoin’s [BTC] dominance. In fact, it hit such a critical level that a fresh altcoin season could be right around the corner now.\n\nAltcoin season is here\n\nCaptain Faibik, a popular crypto-analyst, recently shared a tweet highlighting an interesting development. As per the same, Bitcoin’s dominance is now moving inside a rising wedge pattern. What this means is that the chances of BTC dominance falling over the coming days are quite likely. This would be a positive sign for altcoins as their market cap is likely to surge then.\n\nMags, another famous crypto-analyst, also shared a tweet mentioning a historical event. The tweet stated that in 2020, the altcoin market was in an accumulation phase. That ended in the second half of the year, kick-starting a massive bull rally.\n\nThe analyst believes a similar trend can be seen this time around, further increasing the chances of an altcoin season soon. If the rally happens, then altcoins’ market capitalization can be expected to hike dramatically.\n\nA look at the top altcoins\n\nTo see whether altcoins are preparing for a rally, what better way than to check the performance of the top alts? According to CoinMarketCap, Ethereum [ETH], the king of altcoins, pushed its price up by more than 4.5% in the last 24 hours. At the time of writing, it was trading at $3,111.72 with a market cap of over $373 billion.\n\nLike ETH, BNB and Solana [SOL] also turned bullish as their values surged by 3.6% and 5%, respectively. At press time, BNB was trading at $586, while SOL’s value rested at $145.2.\n\nHowever, it was surprising to note that despite the recent price upticks, investors’ confidence in these top altcoins remained low. AMBCrypto’s analysis of Santiment’s data revealed that ETH, SOL, and BNB’s weighted sentiments all remained in the negative zone.\n\nHowever, the good news was that Ethereum’s open interest rose slightly along with its price. A rise in this metric is usually a sign that the prevailing price trend is likely to continue.\n\nSOL’s open interest took ETH’s lead as it registered an uptick as well. On the contrary, the same for BNB fell, despite its price recording an uptick on the charts.\n\nAMBCrypto then analyzed ETH’s daily chart to see whether it could sustain its bull run. We found that its Money Flow Index (MFI) went sideways after an uptick, while its Chaikin Money Flow (CMF) moved south.\n\nThese suggested that investors might not see ETH’s price rise explosively in the short term.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nSimilarly, Solana’s technical indicators looked pretty bearish too. Both its MFI and CMF went south, indicating that the token’s rally might not last.\n\nConsidering these data sets, it will be interesting to see how soon a fresh altcoin season comes along."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOaVFROUw0QlNUUEZCc0FSLVhqamhhZmdHM0drTHEyeTVPQ3N5aG4zODlKVEtmQjloMmRoWHFfUWZxckVBUS00dmNkbkdCcjVRLTF1RDgwdTQtTTM1VmI5ZGk3ZGNoU3pYZzBJb0JOZlRBdWJQVHZIcUNuaFNjMlA2a0puNEk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 May 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) and Ethereum (ETH) Rockets Skyward as Furrever Token (FURR) Gives a Chance to Earn $10,000 - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, May 04, 2024 (GLOBE NEWSWIRE) --\n\nIn the midst of recent turbulence in the crypto markets, characterized by a brief spell of uncertainty, Bitcoin (BTC) and Ethereum (ETH) have emerged as beacons of resilience, surging to new heights. However, amidst this soaring trajectory, Furrever Token (FURR) has ignited a fresh wave of excitement by unveiling a lucrative opportunity for investors: the chance to pocket a substantial $10,000 reward. As BTC and ETH continue their upward ascent, the allure of FURR's enticing competition adds an extra layer of intrigue to the already exhilarating world of cryptocurrency investing.\n\nBitcoin (BTC) Rockets Towards $62,000 Amidst Renewed Bullish Momentum\n\nAmidst a recent tumultuous period for the cryptocurrency markets, Bitcoin (BTC) is staging an impressive rebound, surging by nearly 5% to reach around $61,857.26. This resurgence follows a sharp dip below $57,000, with BTC climbing 5.2% over the last 24 hours. Market analysts are closely eyeing the critical $62,000 level, identified as a key resistance point on BTC's daily chart. While some traders anticipate a bullish breakthrough, others caution against a strong rejection, emphasizing the significance of sustained volume and candlestick closure above this threshold.\n\nTechnical indicators and on-chain data suggest various levels of resistance and potential targets, with some analysts eyeing $82,000 as the initial objective. With signals of bullish momentum strengthening, Bitcoin's price action continues to draw attention, with a possible bull flag formation on the weekly chart signaling further upward potential towards all-time highs and beyond.\n\nEthereum (ETH) Faces Regulatory Hurdles as SEC Decision Looms\n\nAmidst a backdrop of regulatory uncertainty, Ethereum (ETH) is currently priced at around $3,081.29, marking a 3.5% increase since yesterday. As the deadline for the U.S. Securities and Exchange Commission (SEC) decision on Ethereum Exchange-Traded Funds (ETFs) approaches, industry experts express skepticism regarding approval. Analysts like Michaël van de Poppe and MicroStrategy CEO Michael Saylor doubt the likelihood of approval for Ethereum Spot ETFs this May. Three prominent applicants, VanEck, Ark 21 Shares, and Hashdex Nasdaq, face hurdles as the SEC scrutinizes underlying securities issues, potentially leading to postponements rather than outright denials.\n\nConcerns are raised that Ethereum may be classified as a security by the SEC, a move that could impact not only Ethereum but also other major cryptocurrencies and ETF applicants. In contrast, Hong Kong's crypto market experiences significant growth, with nearly $300 million in weekly inflows following the launch of Bitcoin and Ethereum ETFs. This divergence from the U.S. market, where spot Bitcoin ETFs face notable outflows, underscores the shifting dynamics of global crypto investments.\n\n\n\n\n\nStory continues\n\nFurrever Token (FURR): A Whimsical Journey Through Presale Success and Cute Crypto Innovation\n\nFurrever Token (FURR) is poised to captivate investors and accelerate through its remaining presale stages, leveraging a unique blend of charm and innovation. With a mission to infuse the crypto space with a delightful dose of cuteness, FURR transcends traditional use cases, offering users an irresistibly charming experience.\n\nIn a market dominated by serious blockchain projects, FURR stands out by fostering a warm and friendly community centered around the universal appeal of adorable cat imagery. The tokenomics of FURR are designed to incentivize participation, with 65% of tokens available during the presale, creating ample opportunities for early investors to secure their stake in this whimsical ecosystem. Moreover, the team's commitment to transparency and longevity is evident through the allocation of 10% of tokens, locked for a year, reassuring the community of their dedication.\n\nThe launch on a decentralized exchange (DEX) like PancakeSwap further enhances accessibility and liquidity, ensuring a seamless experience for investors. Held on the Gleam platform, the competition spans 7 days, offering participants the opportunity to accumulate points by completing various tasks. At the end of the frenzy, three lucky winners will each walk away with a share of the $10,000 prize pool in FURR tokens. The stakes are high, with the first-place winner bagging $5,000 worth of FURR, followed by $3,000 for second place and $2,000 for third place. The competition kicks off on 02/05/2024 at 12:00 pm (UTC +1) and concludes on 09/05/2024 at 12:00 pm (UTC +1), so rally your purrfect skills and join us for a chance to claim your spot among the ultimate Furrever winners!\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Furrever Token Bonanza Competition\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1zOGd5dDNqbnRyR2ZiSkhadjRDSnU5RXphWFBRUzd5ay1Lck4tUUotVWszaFhFY3Nja0xia09zR0gxajZEVDBlOTROeWU4S2tTQnppYTlvNVdvWHhQd1hmMjdEb0V4UDQ0WE1yS3VqdnNDUmNNZGRKeVphRFZxQ0HSAYQBQVVfeXFMTm1LZ0d3TEVJWUtrX1lQSHhDN1V4d25ldGN4elYwQ2RWb0d0ZjNza055WHRLQUxoZmRWTXRET0RuSXpHOUFfS0V2b1FiX1BoZzRNZ29fMDBVN1BGZFJ1R2FBbFlSNUd5bEc2MHF6LVFfN3BROGEycDVrckl5SWF4VFB2YVEy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 May 2024 07:00:00 GMT",
        "title": "Ethereum NFTs on Blast – Should ETH holders worry now? - AMBCrypto News",
        "content": "Blast overtook Ethereum in terms of NFT volume\n\nWhile ETH’s price fell, network growth and velocity grew significantly on the charts\n\nEthereum [ETH] has largely been dominant in most sectors across the crypto-space. On a certain front, however, it would seem that the tides have shifted in favor of the Blast network.\n\nNFTs on full Blast\n\nRecent data suggests that over the last 24 hours, Blast NFT collections like PAC REKT, Blastopians, and Plutocrats have collectively generated more volume than the entire Ethereum NFT market across all exchanges.\n\nNow, even though Blast outperformed Ethereum in terms of NFT volume, a significant portion of this volume can be attributed to wash trading. For context, Wash trading in NFTs inflates trading volume by buying and selling between controlled wallets, creating fake popularity, and misleading investors. It undermines the NFT market by distorting prices and reducing real liquidity.\n\nEven though a large part of Blast’s NFT volume can be due to wash trading, the declining interest in Ethereum NFTs does raise concerns about the state of the network. In fact, AMBCrypto’s analysis of Santiment’s data revealed that the number of NFTs being traded has fallen significantly.\n\nTaking a deeper look\n\nNFT collections on other networks such as Bitcoin and Mythos managed to outperform Ethereum NFTs. According to CryptoSlam’s data, popular Ethereum NFT collections such as BAYC and Crypto Punks were not able to get into the top 5 most sold NFTs over the last month. The number of Crypto Punk buyers fell by an alarming 20%, whereas the number of BAYC buyers fell by 2.78%.\n\nIf this trend continues, Ethereum may lose its top spot in the NFT sector soon.\n\nETH holders bleed\n\nAs far as ETH’s price is concerned, at press time, it had climbed back above $3,000 on the back of Bitcoin’s recovery. Additionally, the network growth for ETH continued to rise as well.\n\nRising network growth is a sign that new addresses have been showing interest in ETH. Velocity climbed too, implying a surge in transaction activity on the Ethereum network.\n\nRising interest from new addresses and growing velocity could help ETH see green and push the altcoin to the levels it was trading at prior to the latest market correction.\n\nHowever, the size of the addresses showing interest in ETH will also play a key role in Ethereum’s future price movement.\n\nFor instance, addresses holding 100-10,000 ETH were declining at press time, according to Santiment’s data. Substantial purchases made by large addresses can play a huge role in ETH’s price trajectory in the future.\n\nIs your portfolio green? Check out the ETH Profit Calculator"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNTEx4NVhvdFktLXFLRkNPenB1d3NLWWNlQ3VpN2xxaTJQeTNKb2FrUkoxaDd6TEh5SnhvY0ZHTjYtWWJGTEZOdXNuWnIydXdvRFljZkRUemlXd2lvaUQyYi1uRjlDckJZVWdQZ2ZhRlBRQkdnRnlLU3lVQ0JxZFVoTW5tNWtKMlFPUmhfV0l1X29PTXVnekI5M9IBngFBVV95cUxQN054bTRaNGdWN0IyN1VTWF85UTNFYUhmaEdrTlhZOFBNejRuNnJtN1RocVBRZDAxQW5WM09OLWVPU0ZRaUlFZmE2bkh5SFpoSi1PZ2Y2c3p0dmJrV01RSDk2amxRZVVSTlRPMV9pTFlyMXdzbmVEVWNTd19xSFlNZDFlVDJ1TTZHS3VhLW5IRFhIZ1Y2SUkycndMT3RjZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 May 2024 07:00:00 GMT",
        "title": "Ethereum’s $35 million shake-up: How ETH’s 7% hike triggered a 2-month high - AMBCrypto News",
        "content": "ETH’s price appreciated by over 5% on 3 May\n\nThis contributed to a hike in the number of short positions liquidated\n\nEthereum’s [ETH] 7% price rally during the intraday trading session on 3 May caused short liquidations on its derivatives market to rally to a two-month high, according to Coinglass.\n\nIn fact, the on-chain data provider went on to reveal that on that day, $35 million worth of ETH’s short positions were liquidated. In comparison, long liquidations totalled just $7.16 million.\n\nLiquidations happen in an asset’s derivatives market when a trader’s position is forcefully closed due to insufficient funds to maintain it. Short liquidations occur when the value of an asset suddenly rises, and traders who have open positions in favor of a price decline are forced to exit their positions.\n\nAccording to Santiment’s data, the altcoin closed on 3 May above $3000 after trading below that price level since the beginning of the month.\n\nDerivatives market traders stay their hands\n\nStill extending its gains at press time, ETH’s price was up by over 5% in the last 24 hours. At the time of writing, the market-leading altcoin was valued at $3,104.\n\nHere, it’s worth noting that Coinglass data also suggested that the price rally has not instigated any significant activity in ETH’s derivatives market. In fact, trading volume in that market grew by just 2%.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nSimilarly, the coin’s Futures open interest recorded a minor 3% hike over the same period. ETH’s Futures open interest was $10.68 billion at press time. Furthermore, ETH’s Options volume cratered by over 50% during the period under review.\n\nOptions trading grants participants the right to buy or sell an asset at a specified date. Generally, when ETH sees a decline in its Options volume, it means that there is less speculation on its future price movements as market participants wait to see where the coin’s market might be heading next.\n\nA combined reading of the minor hike in ETH’s Futures trading volume and its declining Options volume suggests that the coin’s derivatives market participants have adopted a “wait and see” approach. Simply put, they are not placing significant bets on where its price might head next."
    }
]