[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTFBoV3ZmLVNxSlpkbEF0amVYZTVoUnFLcGdWbWVwY21ia05pU3UzOWtlSWwwWmNaSEc5b1otcU1QSlQ1QW5DVGJoQVBIT1BwaVpTalViMG9rVUQwMXVpT0MxSE03TmN2OEEtT0otRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Is Ethereum a Good Investment? - Benzinga",
        "content": "Decided Ethereum is a good investment? You can get ETH on eToro or Robinhood today!\n\nJOIN THE MOON OR BUST EMAIL LIST Our team is diligently working to keep up with trends in the crypto markets. Keep up to date on the latest news and up-and-coming coins. EMAIL* Submit Cancel eth Ethereum $2485.06 * *prices delayed up to 10 minutes -5.00% 24H Buy Ethereum MOON BUST 1125 votes\n\nAs one of the leading cryptocurrencies in terms of market capitalization and technological advancements, Ethereum has established itself as a leading blockchain platform with strong utility and potential for growth. But with the volatile nature of the cryptocurrency market, many investors are left wondering, is Ethereum a good investment?\n\nIn this guide, we will delve into the factors that make Ethereum an attractive investment option, as well as the potential pitfalls to look out for. Whether you are a seasoned investor or a curious beginner, gaining insights into Ethereum's investment potential can help you navigate the complexities of the digital currency market.\n\nUnderstanding Ethereum: An Overview\n\nEthereum is not a cryptocurrency — it’s a global computer for running decentralized apps (dApps). Ether (ETH) is the cryptocurrency that powers the Ethereum network, and it's the required form of payment for running your app or processing your transaction on the highly-desired Ethereum blockchain.\n\nWhile Bitcoin is really good as a store of value, it doesn't support smart contracts like Ethereum does. Arguably, Ethereum is equally capable as a store of value. This being said, many prefer bitcoin to store value because of its hard-capped supply. While both the supply of Bitcoin and Ether are increasing, there will never be more than 21 million bitcoin in circulation. With Ethereum 2.0 and EIP-1559 however, Ether may become deflationary, that is, the supply of the token will actually decrease with time.\n\nEther has been competing with Bitcoin for the top spot as the largest cryptocurrency by market capitalization since its release in 2015 and came close to overtaking Bitcoin in February 2018. Both of these coins have hit new all-time highs since then, and there appears to be more room for both to grow in 2024. Some experts predict Ethereum will \"flip\" Bitcoin this market cycle to become the dominant cryptocurrency in the industry.\n\nHow Ethereum Has Performed Since Launch & in 2024\n\nEthereum has had a volatile price history since its launch in 2015. In its early days, Ethereum was trading at just a few dollars per coin. However, during the cryptocurrency boom of late 2017, Ethereum reached a high price of over $1,400. In Nov. 16, 2021, it reached an all-time high of $4,891.70. Since then, Ethereum's price has fluctuated significantly, driven by factors such as market speculation, technological developments, regulatory news and overall market sentiment.\n\nHow Did Ethereum Perform in 2023?\n\nIn 2023, Ethereum performed exceptionally well, experiencing significant growth in its value and market capitalization. The implementation of Ethereum 2.0 brought about scalability improvements and lower transaction fees, making the platform more efficient and attractive to investors and developers. The rise of decentralized finance (DeFi) applications also boosted Ethereum's performance, as more projects were built on its blockchain. Overall, Ethereum solidified its position as a leading smart contract platform and continued to show strong growth potential.\n\nHow Much is Ethereum Right Now?\n\nAs of Jul. 18, 2024, Ethereum (ETH) is priced at $3,406.85\n\nEthereum Price Prediction\n\nPrice predictions are not always accurate, but a Ethereum price forecast can highlight potential investment opportunities. Benzinga has compiled important information regarding ETH future prices to address questions about whether Ethereum will rise in value. Discover ETH price forecasts here.\n\nWhere to Buy Ethereum\n\nDecided you want in on the Ethereum action? Listed below are a handful of exchanges where you can purchase Ether. If you're new to crypto, jump to our guide on How to Buy Ethereum or compare exchanges with the Best Cryptocurrency Exchanges guide.\n\nAdvantages of Ethereum\n\nThe overwhelming performance of Ethereum has attracted traditional and institutional investors alike. Ethereum and other cryptocurrencies provide you with the following advantages over traditional investments that point to Ethereum being a good investment:\n\nVolatility: While this was previously seen as a negative, smart investors have realized market cycle patterns and are able to capitalize on the parabolic gains produced by market bubbles.\n\nWhile this was previously seen as a negative, smart investors have realized market cycle patterns and are able to capitalize on the parabolic gains produced by market bubbles. Liquidity: Ethereum is arguably 1 of the most liquid investment assets due to the worldwide establishment of trading platforms, exchanges and online brokerages . You can easily trade Ethereum for cash or assets like gold instantly with incredibly low fees. The high liquidity associated with bitcoin makes it a great investment vessel if you’re looking for short-term profit. Digital currencies may also be a long-term investment due to their high market demand.\n\nLower inflation risk : Unlike world currencies — which are regulated by their governments — Ethereum has a transparent inflation plan that is subject to less meddling. The blockchain system is infinite, and there’s no need to worry about your crypto being deflated.\n\n: Unlike world currencies — which are regulated by their governments — Ethereum has a transparent inflation plan that is subject to less meddling. The blockchain system is infinite, and there’s no need to worry about your crypto being deflated. Decentralized finance : Ethereum and DeFi are relatively young — non-fungible tokens (NFTs) and many other new applications are becoming more mainstream on a daily basis. This newness brings unpredictable swings in price and volatility, which may create opportunities for massive gains.\n\n: Ethereum and DeFi are relatively young — non-fungible tokens (NFTs) and many other new applications are becoming more mainstream on a daily basis. This newness brings unpredictable swings in price and volatility, which may create opportunities for massive gains. Finality : The consensus mechanism of a blockchain ensures the integrity and security of the transaction record. Ethereum offers customizable consensus methods such as RAFT and IBFT for enterprise networks, which provide quick transaction finality and require less infrastructure than the Proof of Work algorithm.\n\n: The consensus mechanism of a blockchain ensures the integrity and security of the transaction record. Ethereum offers customizable consensus methods such as RAFT and IBFT for enterprise networks, which provide quick transaction finality and require less infrastructure than the Proof of Work algorithm. Tokenization: Ethereum enables businesses to represent any digitally registered asset as a token. By tokenizing assets, companies can diversify their product offerings (e.g. unique paintings), develop new incentive models, as well as fractionalize previously large assets (e.g. real estate) and allow for crowdsourced data management.\n\nDisadvantages of Ethereum\n\nEthereum may play a part in the future of monetary exchange and global computing systems, but it is equally important that you are aware of the concerns surrounding cryptocurrency investing. However, a few are certainly overblown (or will be fixed soon) and mistakenly make some investors think that Ethereum is a bad investment.\n\nVolatility: If you happened to buy Bitcoin on December 17, 2017, the price was $20,000. Weeks later, you couldn’t sell your investment for more than $7,051. Although you would be doing great now, to avoid painful losses in the short term, keep a close eye on the market. This isn't a unique disadvantage for Ethereum as all cryptos (except for some stablecoins) are volatile so this alone doesn't make Ethereum a bad investment by any means..\n\nIf you happened to buy Bitcoin on December 17, 2017, the price was $20,000. Weeks later, you couldn’t sell your investment for more than $7,051. Although you would be doing great now, to avoid painful losses in the short term, keep a close eye on the market. This isn't a unique disadvantage for Ethereum as all cryptos (except for some stablecoins) are volatile so this alone doesn't make Ethereum a bad investment by any means.. High transaction fees : Arguably Ethereum's largest drawback, transaction fees, hold back the network from reaching mainstream adoption. Using Ethereum's blockchain can cost hundreds of dollars, so retail investors with smaller amounts of capital are priced out from using the network. While other smart contract blockchains have cheaper fees, Ethereum has the most applications and use cases built on its blockchain.\n\n: Arguably Ethereum's largest drawback, transaction fees, hold back the network from reaching mainstream adoption. Using Ethereum's blockchain can cost hundreds of dollars, so retail investors with smaller amounts of capital are priced out from using the network. While other smart contract blockchains have cheaper fees, Ethereum has the most applications and use cases built on its blockchain. New regulation: The government is unlikely to let cryptocurrencies remain completely unregulated for long. New regulations could interfere with business models, and cause crashes that are entirely out of your control.\n\nThe government is unlikely to let cryptocurrencies remain completely unregulated for long. New regulations could interfere with business models, and cause crashes that are entirely out of your control. Threat of online hacking : Hacks are a threat facing many cryptocurrency investors. Most exchanges let you buy and sell your cryptos using a mobile app or website. However many users also store their crypto on exchange wallets. This leaves them susceptible to losing their investments should the exchange get hacked, and their private keys being stolen. Cryptocurrency held on most exchanges isn’t insured by the Federal Deposit Insurance Corporation (FDIC).\n\n: Hacks are a threat facing many cryptocurrency investors. Most exchanges let you buy and sell your cryptos using a mobile app or website. However many users also store their crypto on exchange wallets. This leaves them susceptible to losing their investments should the exchange get hacked, and their private keys being stolen. Cryptocurrency held on most exchanges isn’t insured by the Federal Deposit Insurance Corporation (FDIC). Competition: There are a ton of emerging smart contract platforms giving Ethereum a run for its money, namely Binance Smart Chain, Cardano and Polkadot. While these cryptocurrencies offer better scalability than ETH, they lack decentralization and the robust DeFi ecosystem that Ethereum has on its network.\n\nThere are a ton of emerging smart contract platforms giving Ethereum a run for its money, namely Binance Smart Chain, Cardano and Polkadot. While these cryptocurrencies offer better scalability than ETH, they lack decentralization and the robust DeFi ecosystem that Ethereum has on its network. Proof of Work consensus: Although Bitcoin also uses proof of work consensus, this is more of a con for Ethereum. Transactions on Bitcoin are only necessary to transfer the crypto, while Ethereum's network is used for a variety of functions. Proof of work is more expensive and slower than proof of stake, which is currently being used by many ETH competitors.\n\nEthereum Trading Signals\n\nIntoTheBlock provides a fantastic suite of fundamental and technical trading signals to help you make your own informed decision on whether Ethereum is a good investment or not.\n\nHow to Store Ethereum Safely\n\nSo, is Ethereum a good investment? It can be if you do your research, manage your coins properly and keep an eye on the market. Crypto investing is not as simple as calling a broker and buying or selling. You are actively involved in the process, and that means you need a wallet. Cryptocurrency wallets are a fundamental part of the ecosystem, giving you the ability to easily send and receive money.\n\nThere are two types of wallets: software and hardware. MetaMask and Exodus Wallet are typically the best route to go for software wallets, and the Ledger Nano X is the best hardware wallet.\n\nBZ Pro Tip: If you lose access to your wallet’s private key, whatever cryptocurrency was associated with the wallet is now lost forever. The best way to prevent this, is to handle your private key and seed phrase with extreme care. A forgotten seed phrase can remove currency from circulation forever. A memorized seed phrase can carry billions of dollars across borders with 0 physical evidence.\n\nEthereum NFTs\n\nA key driver for Ethereum's blockchain is the rise of NFTs. Almost every high-value NFT is secured by Ethereum's blockchain, including CryptoPunks, Bored Ape Yacht Club, and Art Blocks. Many new users on Ethereum were drawn to its network to invest in NFTs, so if NFTs continue to breach into the mainstream, it's likely Ethereum will continue to gain adoption. While other platforms like Solana and Avalanche have NFTs, the market for non-fungible tokens on these blockchains is magnitudes smaller than that of Ethereum.\n\nDisclaimer: Do not take out a loan to invest in cryptocurrencies like Ethereum. Do not purchase them with credit. Do not do anything that could endanger you or jeopardize your financial future. If you aren’t sure how much risk you are capable of handling, consult a financial advisor who is trained for this.\n\nEthereum vs. Other Investment Options\n\nBitcoin and Ethereum have completely different use cases. Bitcoin acts as a store of value, similarly to gold. Ether acts as a store of value too, while the Ethereum Virtual Machine enables a host of innovative applications such as DeFi, NFTs and the metaverse.\n\nThe Ethereum Virtual Machine allows coders to write programs called “smart contracts.” Ethereum smart contracts can automate thousands of financial products and are the building blocks of NFTs. These smart contracts enable full-fledged applications like decentralized exchanges (DEXs) and automated market makers (AMMs).\n\nWhile very basic smart contracts are technically possible on Bitcoin's blockchain, Ethereum's custom programming language and huge team of developers make it the likely long-term settlement layer. Bitcoin's blockchain acts as a decentralized ledger for processing payments. Ethereum is a ledger with a full computer attached, allowing much, much more than just processing payments.\n\nAs far as which of the two is a better investment, it's impossible to say for sure. It’s likely that both Bitcoin and Ethereum will stand the test of time and coexist peacefully in the future. Bitcoin is ahead now but Ethereum seems to be the clear winner in terms of utility though it is generally more volatile. At the end of the day, your investment decisions must be made by you (or an investment advisor). The best thing you can do is to educate yourself as much as possible before risking any of your hard-earned money, and never invest money you aren’t willing to lose entirely. You don't want to end up on the front page of Wall Street Bets, after all.\n\nShould You Invest in Ethereum?\n\nInvesting in Ethereum can be a risky but potentially rewarding venture. As one of the largest and most established cryptocurrencies, Ethereum has a strong community and a wide range of use cases beyond just digital currency. Its smart contract functionality has enabled the development of decentralized applications and other blockchain innovations. However, like any investment, there are risks involved, including market volatility and regulatory uncertainties. It's important to do thorough research and understand your risk tolerance before deciding to invest in Ethereum.\n\nFrequently Asked Questions\n\nQ Does Ethereum have a future? A Ethereum’s future looks promising with the implementation of Ethereum 2.0, the rise of decentralized finance applications, and the recent adoption of ETH ETFs. Its scalability, security, and adaptability make it an attractive choice for users and developers in the blockchain space. Q How do you mine Ethereum? A Ethereum is an unregulated digital currency that can be mined effectively by most modern graphics cards (GPUs). Mining Ethereum is actually quite simple, and can generate passive income for people with low electricity costs. Q Can Ethereum reach 100k? A According to Changelly, Ethereum could hit $100,ooo by 2033.\n\n***Information is not intended for U.S. users"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQUGxyZ0ZUXzR2Mm5fcjJudVFNRVhvZ3lNSmU0dHN4QlNEc1l1eGE1bVJZdE9OZHQ1ZXhnYTlvTFJmblZSVkRhNW4zelBscEJ3VUdlMFFiVXpXQjlmQy1jMjZOMUJFOS02VDl6Szk3dnpxNF8tRXJpdk1aVFI5RXRtdF80R2lTTW9YVWJDQw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "What’s Next for Ethereum ETFs Following SEC Approval? - Foley & Lardner LLP",
        "content": "Following the approval and launch of Bitcoin Exchange Traded Funds (EFTs) in January 2024, the U.S. Securities and Exchange Commission (SEC) approved eight Ethereum ETFs for listing and trading on SEC-regulated exchanges on May 23, 2024. The approval represents a significant milestone that paves the way for increased institutional and retail investments in crypto ETFs and addresses critical regulatory issues that have surrounded Ethereum for years. The approval of these Ethereum ETFs is especially noteworthy in light of recent comments by SEC Chairman Gary Gensler who suggested that Ethereum, due to its staking mechanics, might be classified as a security under SEC regulations.\n\nThe approval of these applications occurred without much resistance, which is a notable departure from the contentious process that preceded the approval of Bitcoin (BTC) ETFs. As outlined in our prior article, the SEC only approved BTC ETFs after three federal judges ordered the SEC to grant approval following Grayscale Investments’ victory in court. In Grayscale Investments v. SEC, the D.C. Circuit found the SEC was “arbitrary and capricious” in rejecting Grayscale’s application to list a BTC ETF.\n\nIn contrast, this time the SEC approved the Ethereum ETF applications of its own volition. While this maneuver might have been to avoid more litigation and public scrutiny, the approval shows a steady departure from “regulation by enforcement” and a movement toward actions that promote growth in the cryptocurrency industry and investor freedom.\n\nThis piece begins by explaining what the SEC has approved and why. Next, our team comments on what to expect in the future and what this all means for the cryptocurrency industry and investors going forward.\n\nThe Approval Order\n\nThe SEC approved the listing and trading of eight Ethereum (ETH) ETFs: the Grayscale Ethereum Trust, the Bitwise Ethereum ETF, the iShares Ethereum Trust, the VanEck Ethereum Trust, the ARK 21Shares Ethereum ETF[1], the Invesco Galaxy Ethereum ETF, the Fidelity Ethereum Fund, and the Franklin Ethereum ETF. All the ETH ETF sponsors are familiar names from the first round of BTC ETFs.\n\nThe most important development from the approval order was the SEC heavily implying that ETH is a commodity and not a security. The SEC approved the applications under the rules for commodity-based trust shares. None of the sponsors filed applications under the Investment Company Act of 1940, which is required for ETFs that trade securities. Additionally, the SEC only cited court precedents that involved commodities and not securities to support approving the applications.\n\nThe SEC further justified its approval in ways reminiscent of how it explained approval of the BTC ETFs. Notably, the commission cited the high correlation between spot ETH prices and the Chicago Mercantile Exchange (CME) ETH futures market. This is significant because CME surveillance of spot ETH markets would help detect any market manipulation that could affect the integrity of ETH ETFs.\n\nThe SEC’s approval of the Ethereum ETFs comes with specific conditions, including a prohibition on staking ETH via ETH ETFs. If the sponsors of these ETFs want approval to stake ETH, they will need to submit a proposed rule change and wait for SEC approval.\n\nWhat’s Next?\n\nAlthough the SEC, in late May, approved the sponsors’ applications to list ETH ETFs on public exchanges, we likely will not see the ETFs listed for trading on those exchanges until mid-to-late July, at the earliest. Each sponsor must submit an S-1 filing as a registration statement and wait for SEC approval before the ETFs can actually be listed for trading. Recently, the SEC returned the submitted S-1 forms with slight comments, asking sponsors to resubmit by July 8, 2024, which delayed the expected launch. Bloomberg ETF analyst Eric Balchunas had previously stated that an end of June launch for the ETH ETFs was a “legit possibility,” but recently revised his prediction, suggesting an expected launch date of mid-to-late July, pending the SEC’s review and final approval of the resubmitted S-1 forms.\n\nSimilar to our prediction for the BTC ETFs, we again expect a heated battle for market dominance. Generally, the first movers in the ETF industry box out competitors by gaining significant market share early on. Other factors, such as brand recognition, price competition, commitment to the crypto industry, and developments in disruptive technology may also prove important. But at the moment, it is unclear what factors will affect the ETH ETF market or to what degree each factor will affect the market. Price and market power will likely be important to investment banks, but analyst prowess may be relatively unimportant considering that the ETH ETFs are single-asset funds.\n\nWhile the SEC’s approval of ETH ETFs represents a clear and positive step in the classification of ETH as a commodity, the SEC remains free to argue that ETH staking is an investment contract (a.k.a., a security) subject to its jurisdiction. That said, the SEC cannot rationally assert that ETH alone is not a security in the case of ETH ETFs but that it is a security in other cases. If sponsors want to stake the ETH in the ETFs, the SEC may put up much more a fight than they did in approving the ETF applications in the first place. Notably, the Financial Innovation Technology for the 21st Century Act (FIT21) aims to classify ETH and many other crypto assets as commodities. The House of Representatives passed FIT21 on May 22, 2024, but the bill’s prospects in the Senate are uncertain. It remains to be seen if FIT21 will be the first piece of federal cryptocurrency asset legislation.\n\nThe Approval Order only covers ETH ETFs, not any other single-crypto-asset fund or any multi-asset-crypto-fund. However, the fact that the SEC has now approved two cryptocurrency ETFs shows a shift in the political and regulatory landscape regarding cryptocurrency assets. Even if the SEC treats the “vast-majority” of cryptocurrency assets as securities, the focus will undoubtedly shift to which cryptocurrency asset will be the next to gain ETF approval.\n\nOur Perspective\n\nOverall, this is a positive step forward by the SEC and for the cryptocurrency asset industry, which is piercing mainstream financial markets in aggressive fashion, pushing innovative investment and technology opportunities to the forefront.\n\nThe Approval Order demonstrates that crypto assets can start life as a security and transition to a commodity (or other non-security) over time. Thus, Ethereum’s founders, and the founders of many other cryptocurrency assets, can rest easier knowing that their assets either are or can become so decentralized that the SEC cannot classify them as securities.\n\nEven following the Approval Order, we still expect SEC Chairman Gary Gensler to reiterate his position that most cryptocurrency assets are still securities in the eyes of the SEC. Chairman Gensler affirmed this belief in the wake of approving BTC ETFs, and again in the days leading up to the ETH ETF Approval Order. But we are optimistic that the SEC’s decision to approve two cryptocurrency ETFs demonstrates the SEC staff’s commitment to a “merit-neutral” perspective.\n\nThe Approval Order will stimulate growth in the fledgling United States cryptocurrency retail market. When the ETFs are listed on public exchanges, U.S. investors will be able to buy, sell, and hold ETH in their IRAs, 401Ks, and brokerage accounts. In the coming years, it is very possible we will view the SEC’s decision to approve ETH ETFs as an important step in what became a trend of integrating cryptocurrency assets into traditional finance networks through ETFs and other financial instruments.\n\nWhile the SEC’s action is certainly a good step forward for investor freedom, the SEC is still preventing investors from unlocking the full potential of their investment. The decision to prohibit sponsors from staking ETH in the ETFs likely deprives investors of an average additional 2.61% return on ETH staked for one year. The staking issue will pose many crucial questions going forward: How will sponsors and investors craft staking agreements for each ETF? What will the SEC do when a sponsor submits a proposed rule change to allow staking? Can the SEC resolve this issue amicably by cooperating with the industry, or will the courts have to decide?\n\nWe believe that the SEC cannot credibly assert that ETH alone is a security in some cases but not in other cases, so the freedom to stake ETH in the ETFs should not be as big of an issue the SEC is setting it up to be. Still, the SEC may need to hear that from a judge before it concedes.\n\nIn conclusion, we would be remiss to not remind readers that good governance by cryptocurrency-savvy, ETF-savvy officers and directors, and expert SEC legal advice by counsel, will all be necessary for sustainable market success in this industry. The digital assets industry is still a young, volatile, and highly creative technology sector that is fraught with perils identified as legal and regulatory “risk factors” in several prospectuses.\n\nETFs are complex. Cryptocurrency assets are beyond complex. Sponsors and banks should not seek SEC approval for a cryptocurrency asset ETF, nor should a bank, broker, or RIA contract with a cryptocurrency asset ETF sponsor or authorized participant, unless led and advised by seasoned counsel.\n\nSpecial thanks to Ryan Chatoo, a summer associate in Foley’s Miami office, for his contributions to this article.\n\n[1] On May 31 ARK Invest ended its partnership with 21Shares and is no longer involved with the ETF. The SEC has approved 21Shares to continue under the rebranded name of 21Shares Core Ethereum ETF."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE9mdTFjTC0wOENRbWR4WnYyaEIxVTFKYVc4dHIxVno2NGtmVFE2eWduYWFSZ2V5MExpdmxkbjVLTl9GZVRwd0VpbDhIZ3hJVFV5c2VqUW9ZNTQ3eWdoYUtpMFRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs start trading Tuesday. Here’s what you need to know. - Fortune",
        "content": "New spot ETFs for Ethereum—which will let investors purchase the second most popular cryptocurrency in the form of stocks— are expected to begin trading on Tuesday, July 23. The Securities and Exchange Commission has green lit at least three funds to enter the market that day, sources told Reuters, although it’s believed that a total of eight Ethereum ETFs will launch simultaneously.\n\nThe instruments follow in the footsteps of the eleven trading spot Bitcoin ETFs. Having accumulated over $54 billion in assets under management since launching in January, Bitcoin has soared 47% this year. Here’s all you need to know about their Ethereum counterparts.\n\nWhat is a spot Ether ETF?\n\nEther is the native cryptocurrency of the Ethereum blockchain. Despite the SEC’s reservations, Ether is legally considered to be a commodity, but the corresponding ETFs will be securities.\n\nETFs first came to market in 1993. The funds pool together a basket of securities, such as a handful of different energy stocks, and the price aligns with the indexes that it tracks. They are listed on exchanges and can be traded during market hours, thus operating like stocks.\n\nSpot Ether ETFs will track the spot—or current—price of Ether. The products give investors access to the underlying crypto without the need to own a crypto wallet. The ETFs will be set up as grantor trusts, meaning investors will own a share of the Ether held by the trust.\n\nWho issues them and what are the fees?\n\nEight asset managers are proposing to offer Ethereum ETFs: BlackRock, Ark Invest/21Shares, VanEck, Grayscale, Fidelity, Bitwise, Franklin Templeton and Invesco/Galaxy Digital. Each instrument will be near-identical, so the fees charged to investors are competitive. For now, we know that Franklin Templeton will charge 0.19%, VanEck at 0.20%, and Invesco and Galaxy Digital will charge a 0.25% fee for its jointly filed ETF.\n\nThe full list of fees will be revealed when the final registration statements, or S-1s, are submitted to the SEC. This will be on Tuesday, if trading begins for all eight.\n\nWhere can I access them?\n\nThey will be listed on the Nasdaq, Chicago Board Options Exchange (CBOE) and New York Stock Exchange.\n\nWhy would someone buy an Ethereum ETF?\n\nBitcoin and Ether tokens represent units of ownership—and thus value—of an underlying blockchain. Beyond that, they are very different.\n\nWhereas Bitcoin may be a long-term hedge against inflation, Ethereum is closer to a tech investment. The blockchain’s main premise is “to remove the intermediary and allow for 24/7 uptime in financial services, such as trading and lending, in addition to tokenization, digital collectibles, and digital identity,” Vetle Lunde, senior analyst at K33 Research, told Fortune.\n\nWhile for now crypto markets are tightly correlated, this may not always be the case, he adds. So, Ether ETFs allow investors to diversify which corners of the crypto economy they want to invest in.\n\nWill their popularity match the spot Bitcoin ETFs?\n\nDemand for the funds will be 20% that of the spot Bitcoin ETFs, James Seyffart, Bloomberg’s ETF analyst, told Fortune. This prediction is because the market capitalization of Ether is about one-third of the size of Bitcoin. Plus, he adds, the ETFs will lack a key benefit of holding Ether: Investors will not be allowed to stake, which generates yields. But, even at this smaller size, they would be “extremely successful” by any ETF launch standard, says Seyffart. Similarly, K33 Research predicts that during the first six months of trading, inflows will be $4 billion—a quarter of the spot Bitcoin ETFs.\n\nWhen judging their success, it’s key to evaluate performance after six months of trading, rather than simply on “game day” and the initial weeks, Leah Wald, CEO and president of Cyberpunk Holdings Inc., told Fortune. Launching in summer, they’re coming to market when trading is typically “more muted,” she points out. Plus, success should also be judged on volume and spread, rather than simply inflows, as the health of these metrics foreground AUM growth down the line, she adds, as investors feel safe allocating dollars into these new securities.\n\nWho will be investing in them?\n\nInstitutional investors, such as hedge funds, pension funds, banks and endowments. Retail investors will also access them, either by buying them directly, or through portfolio allocations via wealth advisors. The latter group will likely dominate the first six months of trading, as the Q1 13Fs for the spot Bitcoin ETFs reveal that over 80% of total AUM was from non-professional investors.\n\nHow will the ETFs impact the crypto market?\n\nIf K33’s prediction of $4 billion in inflows over six months is accurate, at current prices, this would mean 1% of Ether in circulation would be absorbed by the ETFs by the end of the year. This absorption is “well positioned” to strengthen Ether’s price in the second half of the year, says Lunde.\n\nThe inflows would also be bullish for the wider market, history suggests. The fresh capital flowing into Bitcoin via the ETFs have boosted the crypto market cap by 46% in 2024, according to K33. Lunde anticipates the products “could further expand the broad market strength” as they enable sidelined capital to enter the market. Plus, Bitcoin ETF investors have “have proven to handle volatility with grace, and flows have been solid even during deep corrections,” says Lunde, suggesting ETFs can open up the market to new investors committed to the long-term.\n\nLastly, as BlackRock, a behemoth of traditional finance, is issuing one of the funds, this shows the firm is diving deeper into crypto. This grants the industry a “solid and well-needed stamp of approval,” he says."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQYWlZWnF4T2NpQW1wQk9PSm80NEhpTExCTTBUQkEwMmpZbk9tM01TUjNDdjBEUUVKSkRGSlVCUHZ1ZVVFbjB1azdSZzR1SWsyTFlmcmtOcmUybHhXb193c29HRlVENXY2WXRKUVlXck12bndjc0xsc2VVUTNZR3JIcnY2cFUwZ2xHakw5b3dVUVhuQ2hidzZkOUNEbE83elF0NHpHTHhwb0w1Rmp1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Bitwise predicts Ethereum ETFs will trigger 50% surge to new all-time high over $5k - CryptoSlate",
        "content": "Bitwise CIO Matt Hougan predicts that the upcoming spot Ethereum ETFs will drive the digital asset’s value to new all-time highs, surpassing $5,000.\n\nIn a June 16 note to investors, Hougan wrote:\n\n“By year-end, I’m confident the new highs will be in. And if flows are stronger than many market commentators expect, the price could be much higher still.”\n\nHowever, Hougan mentioned that ETH’s price might not rise immediately after the ETFs launch next week because “money may flow out of the $11 billion Grayscale Ethereum Trust (ETHE) after it converts to an ETP.”\n\nStill, Hougan emphasized that spot ETFs usually generate new demand for commodities like ETH. He referenced the launch of similar products for Bitcoin, which led to a price increase of around 25% since January 11 and about 110% since October 2023, when the market began anticipating their approval.\n\nWhy ETH could reach a new high\n\nHougan outlined three structural reasons why the inflows into spot ETH ETFs will have a more significant impact than they did for BTC.\n\nFirst, he claimed ETH’s short-term inflation rate is 0%, unlike Bitcoin’s 1.7% when its ETFs began trading. This means BTC needed “$16 billion of Bitcoin buying per year just to tread water.” With ETH, the situation differs as “people using Ethereum-based applications—everything from stablecoins to tokenized funds—consume ETH as well.”\n\nHougan highlighted the correlation between “the amount of ETH being consumed” and network activity, noting it presents “another lever of organic demand working in [ETF] investors’ favor.”\n\nFurthermore, Hougan pointed out that Ethereum’s price does not have to deal with the threat of “miners’ selling” because its stakers do not need to sell before making profits. ETH stakers are investors who have locked up a certain amount of their coins to help the network operate smoothly.\n\nHe wrote:\n\n“A key difference between Bitcoin mining and Ethereum staking is that staking does not have significant direct costs. As a result, Ethereum stakers are not forced to sell the ETH they produce. Even if Ethereum’s inflation rate rises above 0%, I do not expect significant selling pressure from stakers.”\n\nAdditionally, Hougan pointed out that approximately 40% of the Ethereum supply is locked in staking and smart contracts, making it unavailable for sale.\n\nSo, Hougan reiterated his prediction that ETH ETF assets under management could reach $15 billion within their first 18 months of trading and concluded that:\n\n“ETH is currently trading at ~$3,400, just 29% below its all-time high. If the ETPs are as successful as I expect—and given the dynamics above—it’s hard to imagine ETH not challenging its old record.”\n\n[Editor’s Note:\n\nData from ultrasound money shows that Ethereum’s inflation rate is now above zero percentage, coming in at 0.466% over the past 24 hours and 0.595% over the past 30 days. However, since The Merge it has recorded a negative 0.136% inflation due to ETH being burned through transaction fees, making it deflationary over 1 year and 306 days.\n\nHougan’s argument regarding Ethereum’s inflation ultimately relies on the network’s consumption. High transaction numbers lead to high amounts of ETH burned and, thus, lower inflation. Yet, the surge in layer-2 usage due to lower fees has resulted in fewer mainnet transactions over the past few months, thus pushing Ethereum back into inflationary territory.]\n\nMentioned in this article"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBFWG5zc1pKbl9MTlQ0dzBJWTI3ZExOY2lDVTZQOFR6Y3didlJwUjdxSldnVmI0QXVFaUFqOWJjTVNSUzhmOXh4U1BGajZzTktoWnZPbFIwSEFKRDhKaWI3Yl8zREhhaWtKRDFJNjlVaVNpNjVZQTJibQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "BlackRock Sets 0.25% Fee for Spot Ethereum ETF Ahead of Potential Launch - Yahoo Finance",
        "content": "BlackRock Sets 0.25% Fee for Spot Ethereum ETF Ahead of Potential Launch\n\nAsset management giant BlackRock has announced a 0.25% fee for its upcoming spot Ethereum exchange-traded fund (ETF), which is expected to launch next week. According to BlackRock's S-1 registration statement filed on July 17, the fee will be accrued daily at an annualized rate of 0.25% of the fund’s net asset value and will be payable at least every three months, either in US dollars, in-kind, or a combination of both.\n\nBlackRock has also indicated that it may waive all or part of the fee for certain periods, with plans to implement such a waiver upon the ETF's launch. Similar to the launch of the iShares Bitcoin Trust, the spot Ether ETF will initially trade at a reduced fee of 0.12% until it either reaches 12 months in operation or amasses $2.5 billion in net assets, whichever comes first.\n\nOther asset managers have also disclosed their proposed fees and waiver periods amid a surge of amended S-1 registration forms. Franklin Templeton’s spot Ether ETF will charge the lowest fee at 0.19%, while Bitwise and VanEck have set their fees at 0.20%. The 21Shares Core Ethereum ETF will charge 0.21%, and Fidelity and Invesco Galaxy will match BlackRock's fee of 0.25%.\n\nNotably, five issuers, Bitwise, Fidelity, Franklin Templeton, 21Shares, and VanEck, plan to waive their fees initially. VanEck's fee will be waived for the first 12 months or until it reaches $1.5 billion in net assets, whichever comes first. Bitwise will waive its fee for the first six months or until it accumulates $0.5 billion in net assets. Franklin Templeton has set a waiver period until January 31, 2025, or until it reaches a $10 billion threshold. Fidelity will waive fees until January 1, 2025, after which the fee will increase to 0.25%.\n\nMeanwhile, Grayscale has set a fee of 2.5% for its spot Ether ETF. However, its newly approved Grayscale Ethereum Mini Trust will offer a more competitive fee of 0.25%. Grayscale also announced that 10% of its spot Ethereum ETF will establish the Ethereum Mini Trust, providing $1 billion in seed funding."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNV3RGU28xS2JVWWFPRnlCNTM0T1dMVnVURlNWZG50enpHZDdJdTVlQm5yMklLaG5fYkJmVDJER1VhTlZtdVZuLXNyeXN4QVR4SThSSW9JRXB3dEtIbm4tWXNZUHV0UWhPVGo3LTQ2dXFBVnNDU3FSMnE0anRwTkNOMW1PM2RlUC1BTWdXcXh5Mm00VWlVYVNWZURVTWXSAaIBQVVfeXFMTkRVY09LZ1lyLU5aYldEZHhGYlRfR2xGNFp1RDZBMjRRTG9XTDMxNjZ5TGtrV08yYzZGSXNhUnlIa0VkeHRobFFTZDYtOG81c2owSTRDY3l4Z3pONnlpZThwQzZDSlp6aUc4X2c4X2NKWThRbWFpWGlnQ0VfZkhsS1F2bjdYaUN1b204NlNJSEJtZzBpTXVtcXB5aTR1X0pfMVR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum co-founder warns against voting only on 'pro-crypto,' a day after a16z founders support Trump - CNBC",
        "content": "Ethereum co-creator Vitalik Buterin on Wednesday cautioned against voting for political candidates based solely on whether they have adopted a \"pro-crypto\" stance.\n\n\"The game of politics is much more complicated than just 'who wins the next election', and there are a lot of levers that your words and actions affect,\" Buterin wrote in a blog post that warned even Putin and the Russian government had \"expressed willingness to become 'open to crypto.'\"\n\nButerin's post comes as Donald Trump, who has positioned himself as the pro-crypto candidate for president, rallies members of his party at the Republican National Convention in Milwaukee, and a day after venture capitalists Marc Andreessen and Ben Horowitz told employees of Andreessen Horowitz (a16z) that they plan to make significant donations to political action committees supporting Donald Trump's campaign.\n\nIn an episode of \"The Ben & Marc Show,\" which features the a16z co-founders, Horowitz said that the Joe Biden administration, in the form of the U.S. Securities and Exchange Commission and the Federal Deposit Insurance Corporation, has \"fought\" them every step of the way by \"using very nefarious means.\"\n\n\"They've sued I think over 30 of our companies,\" added Horowitz. \"They're losing almost all these lawsuits, but the problem is that when you're a startup you don't have the money to fight the U.S. government and so they're kind of nuking the industry in that way.\"\n\nFairshake, a super PAC backed by crypto's top companies, is now one of the top-spending PACs in this election cycle. Of the $160 million in total contributions it has raised, 94% can be traced back to just four companies: Ripple, Andreesen Horowitz, Coinbase and Jump Crypto.\n\n\"There is a particular style of being 'crypto-friendly' that is common to authoritarian governments, that is worth being wary of. The best example of this is, predictably, modern Russia,\" added Buterin, a Russia-born coder who built ethereum in his late teens.\n\nTesla chief Elon Musk and venture capitalist Peter Thiel, as well as crypto leaders like Tyler and Cameron Winklevoss have also endorsed Trump.\n\nIn early June in San Francisco, technologists, crypto executives, and venture capitalists paid up to $300,000 per ticket to join a Trump fundraiser that ultimately raised more than $12 million.\n\n\"In particular, by publicly giving the impression that you support 'pro-crypto' candidates just because they are 'pro-crypto', you are helping to create an incentive gradient where politicians come to understand that all they need to get your support is to support 'crypto,'\" continued Buterin, who is known for periodically posting longer essays opining on existential threats to the ecosystem writ large.\n\nButerin did not single out any names in his post of either political candidates, or of those opting to support them.\n\nTrump — who launched his latest non-fungible token collection on the solana blockchain in April — has been making increasingly bullish comments on crypto.\n\nHe is accepting digital currency donations and has pledged to defend the rights of those who choose to self-custody their coins, meaning that they don't rely on a centralized entity like Coinbase to hold their tokens and instead, do it themselves in personal crypto wallets, which are sometimes outside the reach of the Internal Revenue Service. Trump also vowed at the Libertarian National Convention in Washington in May to keep Sen. Elizabeth Warren, D-Mass., and \"her goons\" away from bitcoin holders.\n\nMeanwhile, following a meeting with bitcoiners at Mar-a-Lago with about a dozen mining executives who pledged cash and votes to him, Trump declared that all future bitcoin will be minted in the U.S., should he return to the White House.\n\nOn Monday, the Republican presidential nominee added Ohio Senator JD Vance to his ticket as vice president — a move viewed by many as a net win for the crypto sector. Vance has advocated for looser regulation of crypto and disclosed in 2022 that he personally holds bitcoin .\n\nIt comes in stark contrast to the Joe Biden White House, which has been seen as hard on crypto. Under President Biden, the SEC has dialed up actions on the sector, and even in the absence of hard-and-fast rules from Congress, the U.S. has proven to be one of the most active enforcers of penalties and legal enforcements against crypto companies.\n\nThe angrier the crypto industry got at the SEC for arresting and prosecuting them, the more people like Vance saw a chance to stake out a position on the opposite side of a crypto-skeptical Biden administration.\n\nHowever, the perception that Biden is anti-crypto and Trump is pro-crypto has some Biden allies concerned enough to take their case directly to senior White House officials.\n\nTrump is set to headline the Bitcoin 2024 conference in Nashville, Tennessee on July 27."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNTmtfUEpZSnBoTllmdmFlR1BtRG9VbWFoZUstQnJGcDVlOTE3d0QyYlIyczNVMDZuaF9XT0NPS1JqUVE3NW84ZU5vWmJHcUlrbnRYUXRRQnVmekhWNlloLURzMVVYa09vbFh6LUZKUzR3MUtCRVR4SXRZNWlqaDNBVlNPRy1xOXhjRW1ndmJDUzRRaU5uSGRTUWVpNUcwNXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Fees for Spot Ethereum ETF 10 Times Higher Than Competition - Unchained",
        "content": "Grayscale will charge a 2.5% fee for its main spot ether ETF, which will be converted from the Grayscale Ethereum Trust (ETHE).\n\nAs spot Ethereum exchange-traded fund (ETF) issuers gear up for a potential launch day next week, one issuer is employing a vastly different strategy than the rest.\n\nCrypto investment manager Grayscale Investments revealed in a filing that it plans to leave fees at 2.5% after converting its Grayscale Ethereum Trust (ETHE) into a spot ether ETF. This means that fees on ETHE will be 10 times higher than the eight other ETFs (except for ProShares, which is yet to disclose fees on its Ethereum ETF).\n\nGrayscale is rolling out another spot ether-based fund – the Grayscale Ethereum Mini Trust (ETH) – which it will seed with 10% of ETHE’s assets as soon as it launches. Based on ETHE’s current AUM, that equates to over $1 billion worth of liquidity for the Ethereum Mini Trust.\n\nGrayscale revealed that it will charge 0.25% fee, with an initial fee of 0.12% for the first 12 months or until the fund reaches $2 billion in assets under management (AUM) for the mini trust. Still, with other issuers charging similarly competitive fees, it remains to be seen whether this will work in their favor.\n\nBlackRock and Fidelity plan to charge a 0.25% sponsor fee on their funds, with BlackRock charging an initial fee of just 0.12% for the first $2.5 billion or 12 months, and Fidelity waiving the entire sponsor fee until the end of the year.\n\nBitwise and 21Shares will charge a fee of 0.20% and 0.21% respectively, but waive this amount entirely for the first six months or until the fund’s AUM hits $500 million.\n\nVanEck will also charge a 0.21% fee, with a fee waiver period of 12 months or until the first $1.5 billion in assets, and Franklin Templeton will charge a 0.19% fee, waiving the amount until the first $10 billion in assets or Jan. 31, 2025. Invesco Galaxy will charge 0.25% fee and will not include a fee waiver.\n\n“I’m not sure what Grayscale’s strategy is here. Feels like they started with the right idea, then it got botched somewhere along the way,” said Scott Johnsson, a general partner at Van Buren Capital.\n\n“Investors selling ETHE are probably not going to be charitable with your mid-price mini option after you stick them with a 10x fee and force them to realize gains.”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPa0hVVXVzbEl6YnkzOW1IeGpBN3BuWVJBYU9Ma251Qi1yNkRydTlMTkhob1FTX2NMYkZVMFFnUDJSMXV1N2VWbjVEeENBamZMaFl5Q3I0dmo4WW9zQUV2Z0ZjMGpJb2lQMHNNOTFaWEdQQTJqZW9BWFRlMkdJMUdzcmdnUmp5YUp2VkV1SmVpWDc0WXd4eDRfZ240WDV4OXNHNTRqMzlIWEZKM3d5Z0JxWHk4d2NQYVhsYmZwZl9VNnVTVmgxem1FSHF2LUlMcWF3WkRVMUZEbGdmZ3p4QlNYa1BCR25sc1hy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Insights into the price fluctuations of the cryptocurrency ethereum - St. Louis Post-Dispatch",
        "content": "Lee Enterprises newsroom and editorial were not involved in the creation of this content.\n\nEthereum is considered the second most popular cryptocurrency after Bitcoin. Ethereum's price has had its share of highs and lows. Why does its price change so much, and how can investors navigate these ups and downs?\n\nA Bit of Background - What Is Ethereum?\n\nEthereum is not just a digital currency. It is a platform that allows developers to build and run applications without a central authority (like a bank or the government). This makes it different from Bitcoin, primarily a digital form of money.\n\nThe currency used on this network is called Ether (ETH). Since its launch in 2015, Ethereum has become the backbone of many innovative technologies, including decentralized finance (DeFi) and digital collectibles known as non-fungible tokens (NFTs).\n\nEthereum's Price History\n\nEthereum's price has seen its share of highs and lows. When it first launched, Ether was priced at about $0.30. By early 2018, during intense interest in cryptocurrencies, its price skyrocketed to around $1,400. However, this boom was followed by a severe crash, which brought the price down to around $80 by the end of the year.\n\nDespite these fluctuations, Ethereum has shown resilience. In 2021, it reached new heights, surpassing $4,000, likely due to the rising popularity of DeFi and NFTs. These technologies primarily rely on the Ethereum network, which results in an increased demand for Ether.\n\nWhy Does Ethereum's Price Fluctuate So Much?\n\nSeveral factors contribute to Ethereum's price fluctuations:\n\nMarket Sentiment: Like the stock market, cryptocurrency prices are heavily influenced by people's thoughts and feelings. Joyous news, such as a big company starting to use Ethereum, can drive the price up. Negative news, like a hack or stricter regulations, can cause the price to drop.\n\nLike the stock market, cryptocurrency prices are heavily influenced by people's thoughts and feelings. Joyous news, such as a big company starting to use Ethereum, can drive the price up. Negative news, like a hack or stricter regulations, can cause the price to drop. Technological Developments: Ethereum is constantly being updated and improved. Progress or delays in these updates can also affect Ether's price.\n\nEthereum is constantly being updated and improved. Progress or delays in these updates can also affect Ether's price. Network Usage: The more people who use Ethereum for transactions, smart contracts, and applications, the higher the demand and price of Ether will typically be.\n\nThe more people who use Ethereum for transactions, smart contracts, and applications, the higher the demand and price of Ether will typically be. Competition: Other cryptocurrencies like Binance Smart Chain, Cardano, and Solana offer similar features to Ethereum but often with lower fees and faster transactions. This competition can influence Ethereum's market share and price.\n\nNavigating the Ups and Downs\n\nFor those considering investing in Ethereum, below are a few tips to navigate its price volatility:\n\nThink Long Term: If you believe in Ethereum's future potential, holding onto your investment through its ups and downs might be a good strategy.\n\nIf you believe in Ethereum's future potential, holding onto your investment through its ups and downs might be a good strategy. Stay Informed: Keep yourself updated on news and developments related to Ethereum. Understanding what's happening in the market can help you make better investment decisions.\n\nKeep yourself updated on news and developments related to Ethereum. Understanding what's happening in the market can help you make better investment decisions. Use Risk Management Tools: To protect yourself from significant losses, consider using tools like stop-loss orders, which automatically sell your investment if the price drops to a certain point.\n\nEthereum's price volatility can seem intimidating. However, understanding the factors that drive its price changes and adopting a thoughtful investment approach can help investors best navigate its ups and downs.\n\nThis information is intended for educational purposes only and is not to be used as investment advice. As with all investments, there is risk, and the past performance of a particular asset class does not guarantee any future performance. Any claims, recommendations or errors are the contributor’s own, and the reader is responsible for evaluating all information contained herein."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9lQ2Q3UTVDVUFnaThJcDl1Mm9uUUhZbkJxQVRzSS1zMW9RQXVDeDEtdzBJNWlvcXYzRkEyUzVXWGFBcGpBTkZhTmxYRTBqQmhzM3B2TFNINUFkcFlyVlhUS0JEdFBZZ1pNazFNeTNoMW14YTFx0gF8QVVfeXFMTWt6by1jQUZ1NEFTWExzQmViNXA2b3U5cE9LNUgxQ2haelNva2NtWkhZSHJNQ2hqSzBDYzFNeXZkeVZBWkhFYjc4bUM1ZTZPSXNscllmbFhRR1N3LW1zZFFHYWRrdFNBckNZZ0k4VHlfTjhla2N5VHBvV1VITg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Ethereum Mini ETF Gets Green Light From the SEC - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Securities and Exchange Commission has approved crypto asset manager Grayscale's mini Ethereum exchange-traded fund (ETF).\n\nThe green light came on Wednesday, along with approval for asset manager ProShares' Ethereum ETF.\n\nThe SEC had unexpectedly said yes in May to proposals from Grayscale and a long list of other asset managers to launch spot Ethereum ETFs.\n\nGrayscale's initial proposal was to convert its longstanding Grayscale Ethereum Trust into a spot Ethereum ETF. That crypto fund currently operates like a closed-end fund, where it is harder to redeem shares.\n\nAD\n\nAD\n\nIt then filed for its mini trust, which would be seeded with assets currently backing the bigger ETF.\n\nBloomberg Intelligence ETF analyst James Seyffart said on X (aka Twitter) that the mini fund “should help alleviate some of the likely Grayscale outflows” anticipated from the conversion of the larger fund.\n\n“Grayscale is excited to share that the SEC has approved Grayscale Ethereum Mini Trust's Form 19b-4,” Grayscale said in a statement to Decrypt. “The Grayscale team continues to engage constructively with SEC staff, as we seek full regulatory approval for U.S. spot Ethereum ETPs, and we will share more information, as appropriate.”\n\nSeyffart predicted that the fund would now likely start trading alongside the other products next week. Sources on Monday confirmed to Decrypt that the Ethereum ETFs would likely start trading on July 23.\n\nAD\n\nAD\n\nIn a landmark moment for the crypto industry last year, a judge sided with the firm in a lawsuit, agreeing with the firm that Wall Street’s biggest regulator lacked a coherent explanation for denying its proposed conversion to a Bitcoin ETF after years of denials.\n\nThe ruling paved the way for the SEC to give the green light to spot Bitcoin ETFs.\n\nIn January, the SEC approved Grayscale's proposal to convert its Bitcoin Trust into a Bitcoin ETF. Grayscale also has a mini Bitcoin ETF with lower fees than its flagship Bitcoin product.\n\nThe fees for the forthcoming Ethereum mini ETF have not been disclosed.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxORTk1Vl9tblZwV0JhUXV4Yk1odGFkbWgtQ1N4TGllOExhQVdUYk9jTHVnSmRQdWQtVDlwRERPbnJGNkhaaVgtRFY4aEpGN2huWXl1U2ZGUHN0T3ZWVmE2TVFHS0VpN1hSYkdOZGlDcVlNTS16Qkh2N0dHSzFIb09JbGNfVWw3dmREeVlsYU8teUctUkpGUzVmX2l4RWw1ZWg5TEVkcjNoMWVRRXIzbTlEUzdJQXFiOHR6X0l6bmVHME5ELXJXSS02VGFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum co-founder's warning against 'pro-crypto' candidates: 'Are they in it for the right reasons?' - TechCrunch",
        "content": "Vitalik Buterin, the co-founder of Ethereum, issued a warning on Wednesday against choosing a candidate purely based on whether they claim to be “pro-crypto.” In a blog post, Buterin said it’s more important to scrutinize a candidate’s broader policies to ensure they support cryptocurrency’s underlying goals, including internationalism and protection for private communications.\n\n“If a politician is pro-crypto, the key question to ask is: Are they in it for the right reasons?,” wrote Buterin. “Do they have a vision of how technology and politics and the economy should go in the 21st century that aligns with yours?”\n\nThough Buterin does not mention any politicians or crypto investors by name, his comments come just one day after Marc Andreessen and Ben Horowitz threw their support behind former President Donald Trump in the 2024 Presidential election. The founders of Andreessen Horowitz noted on their podcast yesterday that Trump’s crypto regulation plan is “a flat-out blanket endorsement of the entire space.” The influential venture capitalists join the ranks of other notable Silicon Valley players, including Elon Musk, who endorsed Trump in the last week.\n\nFurther, Ethereum’s co-founder made the case that signaling you broadly support any “pro-crypto” candidates could incentivize politicians to promote the cause in bad faith. Buterin notes that authoritarian leaders, particularly in Russia, have claimed to support crypto in an effort to consolidate power.\n\n“It doesn’t matter if they also support banning encrypted messaging, if they are a power-seeking narcissist, or if they push for bills that make it even harder for your Chinese or Indian friend to attend the next crypto conference — all that politicians have to do is make sure it’s easy for you to trade coins,” said Buterin.\n\nThe co-founder of Ethereum suggested to look into a “crypto-friendly” politician’s views on crypto five years ago. He says this can serve as a guide for whether the politician may reverse their position five years in the future.\n\nNotably, former President Trump starkly opposed decentralized tokens five years ago. In a tweet from July 2019, Trump said he’s “not a fan of Bitcoin and other Cryptocurrencies, which are not money.” In a follow-up tweet, he said “we have only one real currency in the USA,” referring to the United States dollar.\n\nBut in May, Trump completed a total flip-flop on his stance regarding cryptocurrencies, becoming the first major presidential candidate to accept bitcoin donations. The Wall Street Journal reports that Trump’s crypto fundraising efforts have collected $3 million worth of donations in the second quarter."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQcTJ6bUcxblJybW5ObVh1YTZ1N2JtLUZiVVRjQ0tzSUx6SWNQUjNsTXAxWEt2ZEZkOEU3eUp1RVhxMTBfNHo5V1ZLWUlSdGRrMHl2Z20xT0JrUndFbjA0dDk1cGFOVEdYRkg4eDZncWZTeUVmaElzV1BZaENzNGt4Mzd4Q1FGOTVMckpuMDR4ZndWX2ZoR2pwc1ZHNERQSk93bFlHUmsyalNwSkxPZGdvVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "BlackRock reveals competitive 0.25% fee for spot Ethereum ETF as issuers update filings - CryptoSlate",
        "content": "Several spot Ethereum (ETH) ETF applicants submitted S-1 amendments detailing sponsor fees and waiver details to the SEC on July 17 as they prepare for a potential trading launch next week.\n\nAlmost all of the issuers have detailed fees and sponsor fee waiver terms in the latest filings.\n\nBlackRock set a 0.25% sponsor fee and said it would only charge a 0.12% fee for the first 12 months or up to the initial $2.5 billion. Meanwhile, Fidelity set the same 0.25% fee and said it would waive the entire sponsor’s fee until Dec. 31 without any other conditions.\n\n21Shares and Bitwise added a 0.21% and 0.2% fee, respectively, which they will waive entirely for the first six months or up to the first $500 million.\n\nGrayscale added a 2.5% fee for its main spot Ethereum ETF, converted from Grayscale Ethereum Trust. It added a 0.25% fee and a 12-month waiver to its mini ETH trust, which is valid for up to $2.0 billion.\n\nFranklin Templeton reasserted its 0.19% fee and decision to waive the fee for the first $10 billion in assets. The firm added that the waiver period will last until Jan. 31, 2025.\n\nVanEck similarly reasserted its 0.20% fee and said its fee waiver period would last 12 months from launch or up to the first $1.5 billion. Invesco Galaxy also reasserted its 0.25% fee and a starting fee of 0.25%.\n\nProShares has not submitted fee or waiver data.\n\nLaunch pending\n\nBloomberg ETF analyst Eric Balchunas commented on the fees by questioning whether each fund can generate significant inflows against funds unlocked from Grayscale’s converted ETF.\n\nBalchuans said:\n\n“Do these newborns have enough strength to offset those outflows a la BTC. Anyway short story is [Grayscale’s] 2.5% fee made path to a decent net flow number a little harder. We’ll see.”\n\nThe latest additions represent one of the final steps toward approval.\n\nThe SEC approved proposed rule changes for spot ETH ETFs on May 23. The changes permit exchanges to list and trade the funds but do not give asset managers the final green light needed to issue them.\n\nAccording to industry insiders, the funds are expected to secure the final approvals next week and will begin trading on July 23.\n\nMentioned in this article"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE85R0lPZkpMN3VZUE9Sa284Q2pmWWJrN1BoVHp0U1M4LXFVMVZMbWVSYzFoMnV6RF9ha0ZvMVExMjFnLXRXLVN0V3p0dkdGN09VT1RLbGtuMWxlMEs0QTFOREJIbFQtTGpwWEdGcXhtZ1BsOE1NN1hueHl1TXVkZnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "If You Invested $1,000 In Ethereum When Mark Cuban Called It Closest We Have To A 'True Currency,' Here's How Much You'd Have Today - Yahoo Finance",
        "content": "If You Invested $1,000 In Ethereum When Mark Cuban Called It Closest We Have To A 'True Currency,' Here's How Much You'd Have Today\n\nBillionaire entrepreneur Mark Cuban has been a long-term investor in cryptocurrencies, allocating space to heavyweights like Ethereum (CRYPTO: ETH) in his portfolio.\n\nWhat Happened: In a podcast hosted by Delphi Digital in March 2021, Cuban heaped praise on the world's second-largest cryptocurrency.\n\nDon't Miss:\n\n1 in 4 Americans own a share of Bitcoin according to NASDAQ, how many people got started through this free crypto faucet?\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\nHe notably mentioned its versatility and technological advancement, features which eventually drew him into the asset. \"I wish I had bought it sooner, but I started buying it four years ago, simply because I think it's the closest we have to a true currency,\" Cuban stated.\n\nWhen Cuban made these bullish remarks, one Ether was valued at $1,716. So, if you invested $1,000 then, it would have fetched you 0.58 Ether.\n\nThat seems a long time ago. The cryptocurrency ballooned to its all-time high of $4,878 later in 2021, faced a painful winter in 2022, and made a spirited recovery in 2023-24.\n\nAs of this writing, one Ether is priced at $3,449.26. Therefore, 0.58 ETH will be worth $2,000 today, nearly doubling in value.\n\nWhy It Matters: Ether has been on a strong recovery path this year, jumping 51% year-to-date. Its YTD gains have mirrored that of the apex cryptocurrency Bitcoin (CRYPTO: BTC).\n\nA big part of the boost has come from the approval of exchange-traded funds that will track the price of the asset in real-time. The ETFs are likely to begin trading by next week, giving mainstream investors a convenient way to get exposure to the cryptocurrency.\n\nNote that as of today, Mark Cuban just holds 0.026 Ether, worth $88.11 in his portfolio, according to data from Arkham Intelligence.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article If You Invested $1,000 In Ethereum When Mark Cuban Called It Closest We Have To A 'True Currency,' Here's How Much You'd Have Today originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1WdXlxbjRmekEwaENMSkdCZ1BMdjlkTVI3Q0ZvQnVvNjhCUHRkV3NlUl9sVm5McDNZNG81R0NGLUp1WlJ5c24tZW9Jd2QxOXNtYkZsb1lyc2phQzU4QTByOHRHMXVQQl9DOUFocG9zU196TXVpa1dyNGR5NXN3NzTSAYcBQVVfeXFMT0FrS2xZd3UxWTAtSTEtbm9Jd2dzZXBrekZqZ2o5bW5FY2hqbnlwWm5qSjE3SzZuYU0zaEtiVnExMXFfQ0F0NXVub0poeEJlQ2dmTzhPcWMtUms5cGdrZ0dycFlZS0d5ZXBlRlpMSHVxbDliM1pvSkExOVcxLTBsbFQ4N053eXB3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Staking Near All-Time High as ETFs Loom and Rewards Rise - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe amount of Ethereum that’s currently staked within the network is near an all-time high as rewards for locking up ETH are on the rise—and just days before spot Ethereum ETFs are expected to begin trading in the United States.\n\nMore than 33.2 million Ethereum tokens (worth roughly $114 billion) were staked as of publication time, representing about 28% of the total ETH supply, Coinbase’s data shows. The growth in the total value of staked ETH coincides with a nearly 5% increase in the estimated reward rate for staking ETH over the past month.\n\nStaking Ethereum is the process by which ETH is locked up for a specified period of time to secure the proof-of-stake network. In exchange for locking up their tokens, ETH holders earn rewards from the network. The current estimated reward rate of Ethereum is 2.60%, according to Coinbase. That’s up from a 2.48% reward rate last month.\n\nEthereum staking has been on a steady rise, breaking the 30 million ETH mark back in February and hitting an all-time high mark above 33.4 million on July 12, per on-chain data curated by Dune.\n\nAD\n\nAD\n\nWhile staking rewards have drawn many Ethereum holders to lock up their tokens, the massive amount of staked ETH has drawn centralization concerns, given how much being staked to the likes of Lido—which commands 29% of all staked ETH—as well as Coinbase and others.\n\nEthereum is trading at $3,425, down 1% in the past 24 hours.\n\nEthereum ETFs near\n\nEthereum holders’ growing interest in staking also comes as investors expect a swath of spot Ethereum ETFs to receive final approval to launch in the U.S. this month.\n\nAs Decrypt previously reported, spot Ethereum ETFs are likely to get a green light from the U.S. Securities and Exchange Commission to begin trading on July 23, according to sources familiar with the matter. That’s just seven months after their Bitcoin equivalents clinched approval to begin trading.\n\nAD\n\nAD\n\nHowever, when spot Ethereum ETFs do launch, inflows could be modest, some analysts predict. A recent research report from Citi shows that spot ETH ETFs in the U.S. could receive just 30% to 35% of the net inflows their spot bitcoin counterparts received, with distribution skewed to the downside.\n\nStill, a rush of investor dollars into funds holding the token could be a boon for ETH holders. Bitwise Chief Investment Officer Matt Hougan said Wednesday that ETH's price could hit $5,000—a new all-time high—following the expected launches of several spot Ethereum ETFs later this month.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPUlFIS0J6RDY4RjJpX1B2TkY2eGItWjNzWHUzNnMwOXpYMTFCa3FlX3dmN0thd193MU13LWs5X29pNHdWNklteExfZWtHLXBTUmUzMXVQNVJvYXRZRUVzQ190d193Ukh3ci0tam9lMS1QLUNMMmFpTzI5bHFuRG94YVJYUVNMVjl5emlBcS10dUhpWkU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Protocol Village: Shape, Creator-Focused Ethereum L2 in Optimism Superchain, Makes Testnet Available - Yahoo Finance",
        "content": "(PROTOCOL VILLAGE EXCLUSIVE) July 18: Shape, a creator-focused layer-2 network atop Ethereum and part of the Optimism Superchain, announced the availability of its testnet, with GA going live in Q3. According to the team: \"The network is an open space where everyone is free to create whatever they want – from high art to weird experiments. Shape ensures creators that thrive on the network share in its success through 'Gasback.' This mechanic rewards cultural impact directly by giving 80% of sequencer fees back to smart contract owners. Shape is powered by Optimism and, as part of the Superchain, contributes 15% of sequencer fees to the Optimism Collective to fund public goods.\"\n\nChainlink Releases 'Digital Asset Sandbox' for Financial Institutions\n\nJuly 18: Chainlink, the blockchain oracle project, announced the launch of the Chainlink Digital Assets Sandbox (DAS), \"designed to accelerate digital asset innovation within financial institutions.\" According to the team: \"The Chainlink DAS is the ideal solution for financial institutions that want to quickly innovate and experience the potential of generating new revenue opportunities, increasing efficiencies, improving time-to-market, and more. With the DAS, institutions can seamlessly access ready-to-use business workflows for digital assets.\" CoinDesk 20 asset: {{LINK}}\n\nSchematic illustrating an\n\nBitrue Ventures Launches $40M Fund for 'Nascent Web3 Companies'\n\nJuly 18: Bitrue Ventures, the research and investment section of crypto exchange Bitrue, has launched a $40 million investment fund and \"is putting out the call to aspiring developers,\" according to the team. A blog post reads: \"Individual recipients of funding can receive up to $200,000 of investment funds that can be allocated however they feel is most appropriate. In addition, Bitrue will make available their various avenues of expertise to provide further support to these projects. While Bitrue Ventures will consider investing into any niche within the crypto space, we believe that the most successful projects right now are likely to be building in the sectors of Artificial Intelligence (AI), Real World Asset tokenization (RWA), GameFi, Decentralized Physical Infrastructure Networks (DePIN), and Decentralized Finance (DeFi). As such, projects building within these industries will stand a better chance of receiving funding.\"\n\nInfStones, Blockchain Infrastructure Provider, Launches Node-as-a-Service\n\nJuly 18: InfStones, a blockchain infrastructure provider, \"launched its node-as-a-service (NaaS) product, empowering emerging protocols to jumpstart their DePIN projects while making sophisticated blockchain node operations accessible to mainstream users,\" according to the team: \"Since 2018, InfStones has provided enterprise-grade node management services to industry-leading groups such as Binance, CoinList and BitGo. In the recent node sale for cloud computing platform Aethir, InfStones’ NaaS product helped to successfully convert over 26,000 of its Checker Node license holders into long-term node operators.\"\n\nStory continues\n\nRaise to Provide Payment Rails for Polkadot Mobile App, Enabling Retail Purchases\n\nJuly 18: Raise, a payments provider and with a white-label gift card infrastructure, has partnered with Parity Technologies \"to provide the payment rails for the Polkadot mobile app, enabling DOT payments at over 1 million stores and websites across the U.S.\" According to the team: \"Users can make purchases and earn up to 20% cash back in DOT. This integration, previewed at Polkadot Decoded, bridges the gap between crypto and retail, making it easier and more rewarding to use crypto for everyday transactions. The app is set to launch in Q3, with plans to expand internationally by the end of the year.\" {{DOT}}\n\nZivoe, RWA Credit Protocol on Ethereum, Raises $8.35M\n\nJuly 18: Zivoe, a real-world asset credit protocol atop Ethereum, raised $8.35 million in their last round, aiming to broaden credit access by connecting blockchain liquidity with real-world borrowers, according to the team: \"The round comes in tandem with Zivoe launching its RWA credit protocol on mainnet on July 31 and their Initial Tranche Offering (ITO), a unique liquidity bootstrapping mechanism.\"\n\nAI-Focused Layer-1 Chain Nuklai Announces Launch of DAO for Governance, Say on Use of Funds\n\nJuly 18: Nuklai, a layer-1 blockchain built for artificial intelligence, announced the launch of the Nuklai DAO, \"a decentralized autonomous organization designed to empower its community and ecosystem,\" according to the team: \"With this development, the company moves towards greater community-driven governance and collaboration. This initiative allows community to have a direct say in the allocation of these funds through proposals and votes on Commonwealth and Snapshot. The launch of the Nuklai DAO will manage the 400,000,000 NAI Community token allocation.\"\n\nPolygon, Google Cloud, Accenture Release White Paper on Web3 Loyalty Programs\n\nJuly 18: Polygon Labs, in collaboration with Google Cloud and Accenture, jointly released a white paper that highlights how Web3 solutions can build high-margin loyalty programs. According to the team: \"The paper highlights how users can enjoy rewards such as tokenized privileges, gamification, collectibles and community-generated content. This not only improves the user experience but also generates new revenue streams for brands while empowering users to actively participate in loyalty programs.\" {{MATIC}}\n\nChainbase Raises $15M to Grow Omnichain Data Network\n\nJuly 18: Omnichain data network Chainbase has raised $15 million in Series A funding with Tencent Investment Group, Matrix Partners and Hash Global among the investors. Chainbase is an interoperability layer that is building the \"first crypto world model,\" to deliver data from across the cryptocurrency spectrum, according to an emailed announcement on Thursday.\n\nFantom Foundation, Sonic Labs Partner With Alchemy for RPC on Opera Chain\n\nJuly 18: The Fantom Foundation and Sonic Labs announced a partnership with Alchemy \"in which the leading Web3 infrastructure provider immediately contributes RPC support (mainnet and testnet) and key development tools to developers on Fantom’s Opera chain.\" According to the team: \"Alchemy will also support the new Sonic network in the same capacity, enhancing its performance and scalability when it launches later this year.\"\n\nOutlier Ventures Partnership With Morgan Creek Digital Brings Accelerator to Latin America\n\nJuly 18: Global Web3 accelerator Outlier Ventures has announced a new strategic partnership with Morgan Creek Digital, to launch their first-ever accelerator program in the Latin American region. According to the team: \"The program seeks to identify startups developing solutions to drive technological and financial innovation across Latin America. The virtual program starts in September and lasts for 12 weeks, offering selected startups support from Outlier Ventures’ in-house team of experts, tailored mentorship from industry experts, networking opportunities with investors, and up to 200K investment.\"\n\nVisa's Data Partner Allium Labs Raises $16.5M as Their New Findings Show Stablecoin Activity is Back Up\n\nJuly 18: Data platform Allium Labs, which provides enterprise-grade blockchain data to companies like Visa, Stripe and Uniswap Foundation, has raised $16.5 million in a Series A funding round, it announced Thursday. The funding round was led by venture capital firm Theory Ventures whose founder Tomasz Tunguz will join the board as part of the investment. Tunguz said “The demand for cryptocurrencies and tokens has just started\" and that Allium will provide the data to \"foster broader adoption.\"\n\nPundi X Launches Payment Solution for Merchants\n\nJuly 18: Pundi X, a blockchain developer, has launched a crypto payment solution, Pundi X Pay for merchants, according to the team: \"This innovative solution is set to transform the landscape of physical store crypto transactions with the omni QR code payment layer, making it easier for merchants and customers to embrace cryptocurrency payments. Pundi X Pay InStore QR Code features include extensive wallet integrations (over 500+ direct wallet apps), flexible payment options, instant digital receipts, and AI-powered multi-chain transactions and security: powered by Pundi X AI.\"\n\nBitGo Integrates Stacks, Enabling Delegate and Solo Stacking\n\nJuly 18: BitGo has integrated Stacks, \"enabling delegate and solo stacking for its clients,\" according to the team: \"This grants them the ability to earn BTC directly within their wallets via a secure and risk-controlled process. Additionally, BitGo now supports the Stacks token standard and acts as a network Signer, contributing to consensus and block production. This Signer role will be crucial for the future launch of sBTC, a decentralized Bitcoin-backed asset.\"\n\nZeebit, Solana-Based Casino, to Rely on Sonic L2 Infrastructure\n\nJuly 18: Zeebit, describing itself as \"Solana's first on-chain casino,\" is \"launching the first fully decentralized risk-on gaming platform on Solana using SonicSVM infrastructure,\" according to the team: \"This on-chain platform features casino classics, PVP games, and novel Web3 experiences with provable fairness and non-custodial settlement. Leveraging Sonic’s scalable L2, Zeebit will migrate its current Solana-based platform, including player histories. Supported by major Web3 VCs and incubated by Solana Labs, Zeebit’s testnet launch will offer various games, followed by a mainnet launch with incentivized campaigns.\"\n\nAethir, DePIN for GPUs, Teams With Beamable for Cloud-Based Game Development, Distribution\n\nJuly 18: Aethir, a DePIN project specializing in GPUs for AI and pixel streaming, and Beamable, a creator-centric platform for building live games, announced a \"strategic end-to-end solution that will empower game studios to develop, build, scale and distribute live games entirely in the cloud,\" according to the team: \"With the launch of this end-to-end solution, developers will be able to store, manage, and process data all on one platform to create more engaging and scalable gaming experiences.\"\n\nProtocol Village is a regular feature of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Project teams can submit updates here. For previous versions of Protocol Village, please go here. Also please check out our weekly The Protocol podcast.\n\nTON Foundation Says Trustless Bitcoin Bridge for DeFi Launched\n\nJuly 17: TON Teleport BTC, a trustless bridge facilitating secure bitcoin (BTC) transfers to and from The Open Network (TON) blockchain, has launched. According to a message from the TON Foundation team: \"This development enables BTC holders to securely engage in DeFi on TON and participate in decentralized exchanges (DEXs), lending platforms, and other applications. The TON Teleport BTC process is entirely trustless and transparent, operating without a centralized issuer. Each BTC on TON is 100% backed by actual BTC, pegged through the teleport process, ensuring secure and reliable transactions.\" {{TON}}\n\nIoTeX 'DePIN Infrastructure Modules' to Reduce Development Time\n\nJuly 17: IoTeX, an Ethereum compatible blockchain platform optimized for decentralized physical infrastructure projects (DePIN), is launching its 2.0 platform to democratize access to DePIN by partnering with NEAR, Filecoin, RISC Zero, Espresso and more, \"to enhance data availability, storage, computation and sequencing,\" according to the team: \"IoTeX 2.0 features DePIN Infrastructure Modules (DIMs) and Modularity Security Pool (MSP) to cut development costs and support sustainable growth for DePIN projects, positioning itself as the largest decentralized hub for devices and data that will be deployed by both humans and AI agents.\" According to a press release: \"The introduction of Modularity Security Pool (MSP) enables DePIN layer-1s to restake their Proof-of-Stake security to DIMs, fueling growth and fostering sustainability within the ecosystem.\"\n\nSchematic illustrating how IoTeX's Modular Security Pool works in conjunction with its DePin Infrastructure Modules (DIMs), designed to reduce development time and initial costs for DePIN applications (IoTeX)\n\n\n\n"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQTy1lWk1Mak5IOEVlTEpzbFdydHNLTmZFSS1Wd0M3MUt4QzIwcmxaWlFVUzBjeG9BZmRGS09MUFBtNXlDX2gxcnpoeWJ4TXdjdzFZa3dIX0ZZYURfOUM3TlA0VlY1cWwxNFBvX09GUDYyR1VWdlBoXzRCMGlUOVhtb3ZCMVRodW9HN1hRSVNVZHNBVWtvRVoyWmlRLU5jQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Bitwise CIO lists three reasons why Ethereum will hit record after ETF launch - DLNews",
        "content": "Ethereum ETFs’ launch will catapult its price to new heights, expert says.\n\nThe cryptocurrency’s staking feature plays a key role in its prices.\n\nBitwise CIO expects $15 billion in inflows over the next 18 months.\n\nWith spot Ether exchange-traded products set to hit markets next Tuesday, one expert says Ethereum will hit a new all-time high soon after.\n\nMatt Hougan, Bitwise’s chief investment officer, said there are three reasons why Ethereum will rise above $5,000 after the ETFs start trading.\n\nUnlike Bitcoin, Ethereum’s slow supply growth, lack of miners, and staking will pay serious dividends and enable the new ETFs to outperform Bitcoin funds, Hougan said in a new investor note.\n\nHe has previously estimated that investors will pour $15 billion into spot Ethereum ETFs in their first 18 months of trading.\n\nEthereum supply slows\n\nMost cryptocurrencies are inflationary, meaning more are created and sold on the market over time.\n\nBitcoin does this, but the amount that will ever exist is capped at 21 million.\n\nEthereum is also inflationary, but a technical feature that slows this process was added three years ago.\n\nThe burn feature destroys a small portion of Ether with every transaction.\n\nJoin the community to get our latest stories and updates\n\nWhen people swap, trade, or lend on the Ethereum network more frequently, more Ether can be destroyed than produced.\n\nAccording to data from Etherscan, the net amount of Ether hitting the market has been nearly zero as of September 2022.\n\nThe network produces an equal amount of Ether as the burn feature destroys.\n\nThe total supply growth of Ethereum since 2015. Source: Etherscan. The total supply growth of Ethereum since 2015. Source: Etherscan. (Etherscan/Etherscan)\n\nHougan said this slowed growth and the launch of a new demand source will increase Ethereum’s price.\n\nThere’s less Ethereum on the market, and with the launch of Ethereum ETFs, many Wall Street firms will start buying it for their products.\n\nMore demand translates to higher prices.\n\nMiners aren’t stakers\n\nBitcoin mining is an industry that demands enormous resources, from electricity costs to high-end machines. Miners regularly sell the Bitcoin they mine to pay these costs.\n\nThis isn’t the case with Ethereum stakers.\n\nEthereum operates a proof-of-stake consensus algorithm. This means it doesn’t require an industrial-grade mining operation to keep it secure.\n\nInstead, users must lock up 32 Ether, which is worth roughly $111,000 today, and become validators who secure the network.\n\nValidators are paid in newly created Ethereum to prevent fraudulent transactions on the network.\n\nRunning a validator is far less expensive than running a profitable mining outfit. This means there is less need to sell Ethereum to continue operating.\n\n“In the short term, there is simply less forced selling each day in Ethereum than in Bitcoin,” said Hougan.\n\nStaked and off the market\n\nMore than 33 million Ether are staked today, nearly 28% of the entire cryptocurrency’s supply, according to a Dune dashboard by analyst Hildobby.\n\nMore importantly, says Hougan, this is Ether that’s not moving soon either, as they are locked up for a set period, meaning it cannot be withdrawn or sold.\n\n“Currently, 28% of all ETH is staked, meaning it is effectively off the market,” Hougan said\n\nThe combination of low inflation, fewer sellers in Ether stakers, and millions of Ether off the market make the proposition of an ETH ETF especially bullish, said Hougan.\n\n“If the ETPs are as successful as I expect — and given the dynamics above — it’s hard to imagine ETH not challenging its old record.”\n\nCrypto market movers\n\nBitcoin is up 3% over the past 24 hours to trade at $65,000.\n\nEthereum is up 1.8% to $3,476.\n\nWhat we’re reading\n\nLiam Kelly is a DeFi correspondent at DL News. Got a tip? Email at liam@dlnews.com."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxONVM2UVplc0VxQ0FUWThlYVp4SU9jbDZFaFNBOFNDYnhXRWxyOXhkakl3WklfSFgybzRUTzlLWWJaWlhRMEtJWFpoSF8zTGVBV1Q5UEY4QmVudE03MkdHdTcwMzFzQVNzNzh1SnZjU3JkQkhGNlJRLTA5dlkxRHgzbzNVSlpoN0tfeThickoxYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Why Grayscale’s fees for its $10bn Ethereum ETF are a ‘nonstarter’ for investors - DLNews",
        "content": "Grayscale Investments is keeping its spot Ethereum ETF fees at 2.5%.\n\nThat’s 10 times more expensive than its competitors’ fees.\n\nThe ETF will likely suffer high outflows at launch.\n\nThe results are in: Grayscale Investments will keep charging a 2.5% fee to holders of its Ethereum trust when it converts into an exchange-traded fund.\n\nThat’s a massive fee compared with other potential Ethereum ETFs — which are all set to launch on July 23.\n\n“Grayscale isn’t lowering its fees at all,” Bloomberg Intelligence ETF analyst Eric Balchunas wrote on X, pointing out that the firm’s ETF will be roughly 10 times more expensive than its competition.\n\n“Probably will cause some outrage flows,” Balchunas added.\n\nBy comparison, the Ethereum ETFs issued by BlackRock and Fidelity Investments will each have a 0.25% fee, VanEck and Bitwise will each charge 0.20%, and Franklin Templeton 0.19%.\n\nInflows and outflows\n\nGrayscale’s case is unique in that it isn’t spinning up a new fund from scratch, but converting its existing Ethereum Trust — ticker ETHE, which holds almost $10 billion in assets — into an ETF.\n\nThe trust was designed in such a way that investors could create new shares, but not redeem them. Even so, the trust was popular for a long time because it was one of the only ways for Wall Street investors to get exposure to Ethereum.\n\nAnd because it was the only game in town, Grayscale could get away with its 2.5% fees.\n\nJoin the community to get our latest stories and updates\n\nBut once the trust converts into a fund — at the same time all other Ethereum ETFs launch — investors will be able to finally redeem their shares.\n\nAnd because other Ethereum ETFs will launch imminently, Grayscale risks seeing outflows from its fund to cheaper alternatives.\n\nThe same thing happened with spot Bitcoin ETFs: Grayscale has seen more than $18 billion in outflows since it converted its Bitcoin trust into an ETF in January.\n\nBlackRock and Fidelity’s Bitcoin ETFs, meanwhile, have amassed over $30 billion in assets between the two of them.\n\nGrayscale didn’t respond to a request for comment.\n\nHigh fees and no yield\n\nAlongside ETHE’s conversion, Grayscale is launching a separate spot Ethereum ETF, called the mini Ethereum ETF. The mini fund will process smaller fees — 0.25% — and will be seeded with 10% of ETHE’s assets upon launch.\n\nThe move “should help alleviate some of the likely Grayscale outflows,” Bloomberg Intelligence ETF analyst James Seyffart posted on X.\n\nBut not everyone is convinced.\n\n“There’s one massive idiosyncratic factor with Ethereum that will affect demand and that’s staking,” Adam Morgan McCarthy, an analyst at crypto data firm Kaiko Research, told DL News.\n\nWhen using crypto infrastructure, Ethereum holders can lock their Ether in the network — a process called staking — to receive a 3% yield. But the Ethereum ETFs won’t give holders that opportunity.\n\n“The value proposition for a crypto-native fund holding ETHE is hard to see when these funds can redeem shares and buy Ether to stake in return for yields — as opposed to paying high fees to stick around in Grayscale’s fund,” McCarthy said.\n\n“Even paying 0.2% without the staking element seems like a nonstarter to me,” he added.\n\nMcCarthy pointed out that, because Ethereum enabled staking relatively recently, in 2022, some ETHE investors are likely still waiting to exit the fund and lock their Ether in staking protocols.\n\n“Expect outflows from ETHE and some reallocation into new funds which are launching with waivers and low fees,” McCarthy said.\n\n“But a decent chunk of outflows will exit the market altogether,” he added.\n\nTom Carreras is a markets correspondent at DL News. Got a tip about Grayscale and Ethereum ETFs? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQVEoxQWc4WjNTcjJ2ZV9aNExnX0VzejNIZHJLVTcxckcyWFd6X1hNZGg2SlFETGJPQkNqTnhlSWVSaFUxNEZtR0EwQmtXVnFDallMUmFPSEdSTFFULWlJS2VEWGQ5NmxlaHFEbDFONkNkMnppVUlaSEJBT1J4ZnpMdFdhMnRfZEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Staking Nears Record High as Spot ETFs Set to Launch in the U.S. - Yahoo Finance",
        "content": "Ethereum Staking Nears Record High as Spot ETFs Set to Launch in the U.S.\n\nEthereum (ETH) staking is approaching record levels, driven by increasing rewards and the imminent launch of spot Ethereum ETFs in the U.S. According to data from Beaconchain, over 33.2 million Ethereum tokens, valued at approximately $114 billion, are currently staked. This represents about 28% of the total ETH supply. ETH is currently trading at $3,419, down 1.97% in the past 24 hours.\n\nThe rise in staked ETH aligns with a nearly 5% increase in the estimated reward rate for staking Ethereum over the past month. Staking involves locking up ETH for a specified period to help secure the proof-of-stake network, in exchange for rewards. As of now, the estimated reward rate is 2.60%, up from 2.48% a month ago. Ethereum staking has been steadily increasing, surpassing 30 million ETH in February and reaching an all-time high of over 33.4 million ETH on July 12, according to on-chain data from Dune.\n\nDespite the allure of staking rewards, the substantial amount of staked ETH has raised centralization concerns. Platforms like Lido command 29% of all staked ETH, along with significant stakes held by Coinbase and other entities.\n\nInvestor interest in staking is also buoyed by the anticipated approval of multiple spot Ethereum ETFs by the U.S. Securities and Exchange Commission (SEC). However, the exchange-traded funds, which differ from their underlying asset, won't be able to be staked, yet they are expected to attract significant investor interest.\n\nSome analysts predict that inflows into these new Ethereum ETFs might be modest. A recent Citi research report indicates that spot ETH ETFs in the U.S. could receive only 30% to 35% of the net inflows seen by their Bitcoin counterparts, with a potential skew towards lower inflows."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPcWtRYjVaTHJ6OXhfbnNVQlNhRFZSZ3ZNd0UzTHcxUFdhUFFqQ1BCZnVhalg4WjdPTEVTbWVhMEdpaTJGS2ZWZFdfdW80Q1lqdDJaem9NeFB0Mkd4U3ZhMmdBVUxPWXFrSjd5Vk1fRGJubkNIRkRybDVpMWFaQ21EWnUzOU1KRm45VjY2RnpOZ0FuRUdMV2RGZHJGODJoOTF2T3l2SVBRTVhTY1Z5VEg4OXoyWG5KS19sV0V3d1Q1VldBUzRfRW5tdUJ3LVBqanF6?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Bitwise CIO Matt Hougan: Ethereum To $5,000 In 2024 And $15B In ETF Inflows - Benzinga",
        "content": "Matt Hougan, Chief Investment Officer at Bitwise Asset Management, has outlined three key reasons why he believes Ethereum ETH/USD will reach a new all-time high following the launch of spot Ethereum Exchange-Traded Products (ETPs).\n\nWhat Happened: Hougan predicts that by year-end, Ethereum’s price will surpass its previous record of $5,000, driven primarily by ETP inflows.\n\nHe bases this forecast on three structural factors that differentiate Ethereum from Bitcoin BTC/USD:\n\nEthereum’s Lower Short-Term Inflation Rate: Unlike Bitcoin, which had a 1.7% inflation rate when its ETPs launched, Ethereum currently has a 0% inflation rate. This balance between new ETH creation and consumption through network activity creates a favorable supply-demand dynamic for price appreciation. Reduced Selling Pressure from Validators: Ethereum’s proof-of-stake system doesn’t require validators to sell ETH to cover operational costs, unlike Bitcoin miners who often need to sell newly mined coins. This results in less forced selling pressure on the Ethereum market. Significant Portion of ETH Supply Locked: Approximately 28% of all ETH is currently staked and unavailable for sale. An additional 13% is locked in decentralized finance smart contracts. With about 40% of the total supply off the market, there’s potential for increased scarcity and price pressure.\n\nAlso Read: Donald Trump Comments On Crypto Pivot: ‘If We Don’t Do It, China Will’\n\nHougan anticipates that new Ethereum ETPs will attract around $15 billion in assets over their first 18 months.\n\nGiven these factors and Ethereum’s current price of approximately $3,400 (about 29% below its all-time high), he finds it difficult to imagine ETH not challenging its previous record.\n\nWhile Hougan expects some initial market choppiness due to potential outflows from the Grayscale Ethereum Trust ETHE as it converts to an ETP, he remains confident in his bullish outlook for Ethereum by the end of the year.\n\nThis bullish outlook for Ethereum comes at a pivotal time for the cryptocurrency industry, as market participants eagerly await regulatory clarity and potential ETF approvals.\n\nInvestors and industry leaders will have the opportunity to delve deeper into these topics and explore their implications at Benzinga’s Future of Digital Assets conference on Nov. 19.\n\nRead Next:\n\nImage: Shutterstock"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOd2FCd3pmNWRmRGR6TGxZR0dTRDh4MmFOdlEtVlV1UHAxTEJWbjl2eFFLTWlPZFJPT1ZQS2h1S1pZamZvSHpEQ0d6Skw2Q0VRM0VMdnVOcXFjT0lld0V1YlNfM1dKRVVhVm9sZlQtUXpvRUdESVh3QmZ1VFVLaXZyVXVJVHc3QnIwMEJEaThkLUpaTTBCamM3dWZIWkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "How Ethereum group plans to preempt restraining crypto laws with new handbook - DLNews",
        "content": "The Enterprise Ethereum Alliance has released its first DeFi Risk Assessment Guidelines.\n\nThe guidelines are intended to help DeFi protocols meet regulatory requirements and inform regulators.\n\nIndustry group the Enterprise Ethereum Alliance wants to prevent new crypto laws that stifle innovation with a new handbook.\n\nIts DeFi Risk Assessment Guidelines is an in-depth handbook detailing the risks involved in working with DeFi, and how to assess, manage, account for and mitigate them.\n\nSuch guidelines are needed due to regulatory ambiguity and a general lack of accounting standards and guidance for DeFi in laws like the EU’s Markets in Crypto-Assets regulations, the EEA says.\n\n“There are no specifics on what security reporting requirements are expected from the project to be compliant,” Dyma Budorin, co-chair of the EEA’s DRAMA working group and CEO of blockchain security firm Hacken, told DL News.\n\nThe guidelines will enable DeFi protocols to take a proactive approach to compliance, while also helping regulators draft regulation that doesn’t stifle innovation.\n\nThe initiative comes as regulators and politicians have put pressure on the industry with the threat of anti-crypto laws, tax loophole cuts, and a barrage of enforcement actions against industry heavyweights.\n\nThe guidelines in action\n\nThe EEA guidelines cover seven main DeFi risks and contain sections on how to assess and address such risks.\n\nThese include software-based threats such as smart contract exploits or maximal extractable value, as well as more general considerations such as compliance and legal risks.\n\nJoin the community to get our latest stories and updates\n\nThere’s also an extensive list of defined terms to help the uninitiated make sense of DeFi-specific jargon.\n\nRegulators in the UAE and the EU are already using the EEA’s guidelines, according to Budorin.\n\nNot just for crypto natives\n\nThe EEA’s board is composed of crypto natives like Consensys’ Joe Lubin and the Ethereum Foundation’s Aya Miyaguchi, as well as members from non-crypto native companies, including senior employees from JP Morgan, Santander, and Microsoft.\n\nThe EEA said its guidelines will be relevant to both such non-crypto firms and regulators.\n\nBudorin said they’re also important for financial institutions assessing investment risks.\n\n“They don’t know what DeFi risks are, and that’s why they don’t step into DeFi,” he said. “DeFi protocols that plan to cooperate with old money can use the DeFi Risk Assessment Guidelines as best practice references.”\n\nThe guidelines come as DeFi adoption among major traditional finance firms heats up.\n\nGlobal asset manager BlackRock this year launched its first tokenised fund on Ethereum.\n\nSeveral other firms, including JP Morgan, Goldman Sachs, and HSBC, are also continuing their experimentation with DeFi through tokenisation.\n\nTim Craig is a DeFi Correspondent at DL News. Got a tip? Email him at tim@dlnews.com."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE56aFBseG1mTnVuN2VFaFRsREFMNV9IQURzR0lsc0J5bjZSblBOY3AxMU9FdzMwMUNCRHNSVGltaDdmc1V4OXNZVVByODctLXlCYnRUbl9PVVcxeV9YSEloYkg4ZUdBUDh6Zm1qenNTTlRZVkxPelVRN1hn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "U.S. Spot Ethereum ETFs May See Modest Inflows Compared to Bitcoin, Citi Reports - Yahoo Finance",
        "content": "U.S. Spot Ethereum ETFs May See Modest Inflows Compared to Bitcoin, Citi Reports\n\nSpot Ethereum (ETH) exchange-traded funds (ETFs) in the U.S. could experience net inflows at just 30%-35% of the levels seen by spot Bitcoin (BTC) ETFs, according to a research report by Citi. This projection translates to a range of $4.7 billion to $5.4 billion in net inflows over a six-month period. The Citi analysts noted that these figures might be overestimated as both the inflows and ether’s return beta relative to such flows could be lower than anticipated.\n\nSpot Ethereum ETFs are set to become tradable in the U.S. next week after receiving approval from the Securities and Exchange Commission (SEC) earlier this year. However, Citi analysts suggest that while Ethereum offers potential long-term diversification benefits due to its broader set of use cases, these advantages are not yet fully realized.\n\nCiti also highlighted that the lack of staking options in Ethereum spot ETFs might contribute to lower-than-expected inflows. Furthermore, Bitcoin’s first-mover advantage has already secured billions in inflows and strong performance before Ethereum’s ETF approval in May.\n\nDespite these cautious forecasts, Citi’s report noted that the timing of the spot Ethereum ETF launches coincides with an increasingly dovish stance from the Federal Reserve, which may signal lower interest rates, a stronger equity market, and a weaker U.S. dollar. Such a macroeconomic environment could prove beneficial for the broader crypto market."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMipwJBVV95cUxNS0puODdtWkhoc1BqWkRQc2REdlVYSnpCWGFIbGVkZFZKY0o4dk1KTkQ4dUtOWGdPVlJQRS0tS0JZb3JiRU9DVGJMR3hOanFOM2hzYU5MZkxrUGVSLWdlbVZ1dG1Rc1hwSkp4QkU1Y2JSVnoyYXpHM19LU19uUnVJczh2a09ucjgyaWYyaUxCdW54eWR0anRMXzVkRksxb01JZ2FtdFFPVjh0emhaOGxadVlwcTEtMUQ4MmdpV05YOTNNUklNdWEwWnZWVmFYSkhzdUhUX1NHUnU1SzVFTk94ZUJwbXRIVC1YMU00ZGR4RHBsa0FTTGhWT1ljZWpORVlyY2hDODFVSHRqNUc1cUJTNENweXB2b2pydlljWWlsOHU5dk1LX1h3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Investments® Provides Update Related to Upcoming - GlobeNewswire",
        "content": "STAMFORD, Conn., July 17, 2024 (GLOBE NEWSWIRE) -- Grayscale Investments®, the world’s largest crypto asset manager*, offering more than 20 crypto investment products, previously announced that it has set a record date of July 18, 2024 (the “Record Date”) for the initial creation and distribution of shares of Grayscale Ethereum Mini Trust (the “ETH Trust”) to shareholders of Grayscale Ethereum Trust (Ticker: ETHE) (“ETHE”) (referred to as the “Initial Distribution”). Grayscale intends to list the ETH Trust on NYSE Arca, subject to required regulatory approvals, under the ticker symbol “ETH.” See that press release here.\n\n\n\nToday Grayscale is confirming that from and after July 18, 2024, anyone who purchases ETHE shares will not be entitled to receive ETH shares in the Initial Distribution.\n\nAdditionally, Grayscale currently expects the Distribution Date to be July 23, 2024, following (i) the filing and effectiveness of the ETH Trust’s registration statement on Form 8-A to register the ETH Shares under the Exchange Act, (ii) the effectiveness of the ETH Trust’s registration statement on Form S-1 (Registration No. 333-278878) under the Securities Act, and (iii) the ETH Shares having been approved for listing on NYSE Arca. No assurance can be given that the Initial Distribution will occur on Grayscale’s anticipated timeline, and Grayscale will update the market to the extent its expectations change.\n\n\n\nRecord Date July 18, 2024 Ratio of ETHE Shares: ETH Shares 1:1 % of Ether held by ETHE contributed to the ETH Trust 10% Anticipated Distribution Date July 23, 2024\n\n*By AUM as of 7/15/2024\n\nNO OFFER OR SOLICITATION\n\nThis communication is for informational purposes, solely in your capacity as a shareholder of ETHE, and does not constitute an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such jurisdiction. No shareholder approval of the Initial Distribution is required by applicable law, and we are not seeking ETHE shareholder approval.\n\nFORWARD-LOOKING STATEMENTS\n\nCertain of the statements contained herein may be statements of future expectations and other forward-looking statements that are based on Grayscale’s views and assumptions and involve known and unknown risks and uncertainties that could cause actual events to differ materially from those expressed or implied in such statements. Grayscale assumes no obligation to update any forward-looking statements contained herein and you should not place undue reliance on such statements, which speak only as of the date hereof. Although Grayscale has taken reasonable care to ensure that the information contained herein is accurate, no representation or warranty (including liability towards third parties), expressed or implied, is made by Grayscale as to its accuracy, reliability, or completeness. You should not make any investment decisions based on these forward-looking statements. No assurance can be given that the Initial Distribution will occur on Grayscale’s anticipated timeline, or at all.\n\nIMPORTANCE OF OBTAINING PROFESSIONAL TAX ADVICE\n\nThis communication is not intended as, and does not constitute, tax advice. As further discussed in the section of the Preliminary Information Statement filed by ETHE entitled “Material U.S. Federal Income Tax Consequences of the Initial Distribution,” the U.S. federal income tax consequences of the Initial Distribution are complex, subject to uncertainty in certain respects and may be affected by circumstances specific to a beneficial owner of ETHE Shares. Any beneficial owner of ETHE Shares who receives ETH Shares in the Initial Distribution, and any intermediary holding ETHE Shares or ETH Shares, should consult their own tax advisor regarding the U.S. federal income tax consequences of the Initial Distribution, including the proper allocation of existing tax basis between ETHE Shares and ETH Shares. Please refer to the Preliminary Information Statement filed by ETHE for more information, including other U.S. federal income tax considerations relating to the Initial Distribution and ownership of the ETH Shares.\n\nADDITIONAL INFORMATION AND WHERE TO FIND IT\n\nA definitive information statement on Schedule 14C will be furnished to ETHE shareholders on or after the Record Date for the purpose of informing ETHE shareholders of the Initial Distribution, in substantial compliance with Regulation 14C of the Exchange Act. The information statement will describe the Grayscale Ethereum Mini Trust, risks of owning shares of the Grayscale Ethereum Mini Trust and other details regarding the Initial Distribution, and will be made available on our website at www.grayscale.com/documents#regulatoryfilings. ETHE shareholders will not need to pay any consideration, exchange or surrender existing ETHE Shares, or take any other action to receive shares of the Grayscale Ethereum Mini Trust in connection with the Initial Distribution.\n\nETHE is not a fund registered under the Investment Company Act of 1940 and is not subject to regulation under the Investment Company Act of 1940, unlike most mutual funds or ETFs.\n\nGrayscale Ethereum Trust and Grayscale Ethereum Mini Trust Risk Disclosures:\n\nAn investment in the Grayscale Ethereum Trust or Grayscale Ethereum Mini Trust may be deemed speculative and is not intended as a complete investment program. An investment in ETHE or the Grayscale Ethereum Mini Trust should be considered by persons financially able to maintain their investment and who can bear the risk of total loss associated with an investment in ETHE or the Grayscale Ethereum Mini Trust. Extreme volatility of trading prices that many digital assets, including Ether, have experienced in recent periods and may continue to experience, could have a material adverse effect on the value of ETHE and the Grayscale Ethereum Mini Trust and the shares of each trust could lose all or substantially all of their value. Digital assets represent a new and rapidly evolving industry. The value of ETHE and the Grayscale Ethereum Mini Trust depends on the acceptance of the digital assets, the capabilities and development of blockchain technologies and the fundamental investment characteristics of the digital asset. Digital asset networks are developed by a diverse set of contributors and the perception that certain high-profile contributors will no longer contribute to the network could have an adverse effect on the market price of the related digital asset. Digital assets may have concentrated ownership and large sales or distributions by holders of such digital assets could have an adverse effect on the market price of such digital assets. The value of ETHE and the Grayscale Ethereum Mini Trust relate directly to the value of the underlying digital asset, the value of which may be highly volatile and subject to fluctuations due to a number of factors.\n\nA registration statement related to Grayscale Ethereum Mini Trust has been filed with the SEC but has not yet become effective. An investment in the Grayscale Ethereum Mini Trust cannot be made, nor money accepted, until the registration statement is effective. An investor should consider the investment objectives, risks, and charges and expenses of the Grayscale Ethereum Mini Trust carefully before investing. A preliminary prospectus which contains information about Grayscale Ethereum Mini Trust may be obtained by emailing info@grayscale.com. The information in the preliminary prospectus is not complete and may be changed. The final prospectus should be read carefully before investing, and when available may be obtained from the same source. This communication is not an offer to sell shares and is not soliciting an offer to buy shares in any state where the offer or sale is not permitted.\n\nGrayscale Investments, LLC is the Sponsor of Grayscale Ethereum Trust and Grayscale Ethereum Mini Trust.\n\nAbout Grayscale Investments®\n\nGrayscale enables investors to access the digital economy through a family of regulated and future-forward investment products. Founded in 2013, Grayscale has a proven track record and deep expertise as the world’s largest crypto asset manager. Investors, advisors, and allocators turn to Grayscale for single-asset, diversified, and thematic exposure. Certain Grayscale products are distributed by Grayscale Securities, LLC (Member FINRA/SIPC) and certain products are managed by Grayscale Advisors, LLC.\n\nMedia Contact\n\nJennifer Rosenthal\n\npress@grayscale.com"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5qeUFlRTA1c3hLblFPRzhmNm9QVG9BckxUOXEteEo5c080ZG4xOVF0cTFnREpwTHRWeDRWUGNJREdwQkhoWlFqNkhKQmxlZkFZR2JfVmZmM2I0MlRQLXYwODY1ZWdvTm04dFFyRUd1dTJ3WGt0V3hERzRfZEdsbnfSAYcBQVVfeXFMTkVXenNHN2laSExEOUExdEhWZjczaExxa3NJX0g5R2laUUhxcnItSm1TTWhGd1M0ZkZGQTNteXkwbkNSSloxLWJwdnY0MzZ2YWlaTnNnT0NJak9UQUN4UUpoTC1WZEx6bmZHTWhRVGljU1k0QVdsQXhIaVFSUzRqZVc4Qm8tVVRF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Will Hit $5,000 After ETFs Launch, Predicts Bitwise Exec - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMatt Hougan, chief investment officer at Bitwise Asset Management, forecasted on Wednesday that the price of Ethereum could surge past $5,000 following the launch of Ethereum ETFs.\n\n\"[ETF] inflows will push prices to all-time highs, above $5,000,\" he declared. “By year-end, I’m confident the new highs will be in.”\n\nHougan's prediction is grounded in the belief that ETF inflows will significantly impact Ethereum's price by creating new sources of demand—similar to what was observed with Bitcoin after its funds launched. But it will take some time.\n\n“I think the first few weeks could be choppy, as money may flow out of the $11 billion Grayscale Ethereum Trust (ETHE) after it converts” to an ETF, he wrote.\n\nAD\n\nAD\n\nThe primary driver for this anticipated price surge is the interplay between supply and demand, he said. ETFs introduce new demand without altering Ethereum's underlying supply fundamentals. Hougan noted that Bitcoin ETFs have purchased 263,965 BTC since their January launch, compared to 129,181 BTC produced by miners, resulting in a substantial price increase.\n\nHougan outlines three key reasons why Ethereum might see an even greater impact from ETF inflows than Bitcoin.\n\nFirst, Ethereum's inflation rate has been 0% over the past year, meaning the supply of ETH has remained constant at 120 million. This contrasts with Bitcoin's 1.7% inflation rate at the time its ETFs launched. Hougan said Ethereum-based stablecoins and tokenized funds support the equilibrium between ETH creation and consumption, leading to price appreciation.\n\nSecondly, Hougan pointed to staker dynamics. Unlike Bitcoin miners who need to sell their mined BTC to cover operational costs, Ethereum stakers are not under the same pressure. “There is simply less forced selling each day in Ethereum than in Bitcoin,” Hougan noted.\n\nAD\n\nAD\n\nFinally, he noted that a substantial portion of ETH is staked or locked in decentralized finance (DeFi) contracts. “Currently, 28% of all ETH is staked, meaning it is effectively off the market,” he wrote.\n\nHougan said he expects Ethereum ETFs to attract $15 billion in new assets over the first 18 months, a significant influx that could drive ETH from its current trading price of approximately $3,400 to new heights.\n\nWith ETH trading at around $3,400—just 29% below its all-time high—Hougan concluded that the introduction of ETFs and the resulting demand dynamics make it likely that Ethereum will challenge and surpass its previous records."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNSnpoVTdrc0IwREh0NGNoZ3VNNEVWdXp0SUR1ZVl1TGxWNDhIN19fMWdFUzZkQjgtN0xFelY3Z1FoSHdnVmZpU21LWFBwVzVmd19OQ0dyQlhsVlhYMXZfZFJLN2tpeXZYdTBzMnRHNFJwSkNHT2VJY29IdmN1cmZhYVdXNG1fb3ZEeEhxbHJjWmxlRDdtUHh5b0R2T3dORVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Hong Kong’s $350m crypto ETF market pins hopes to Ethereum staking funds - DLNews",
        "content": "OSL head Patrick Pan tells DL News regulatory approval of ETH staking ETFs is likely.\n\nDebut of Hong Kong crypto ETFs only hit 40% of expectations, Pan said.\n\nIssuers and regulators are in negotiations over staking funds.\n\nHong Kong’s rollout of its spot Bitcoin and Ether exchange-traded funds may have been lacklustre, but regulatory approval for Ethereum staking could turn things around, according to Patrick Pan, the CEO of OSL.\n\nOSL is a regulated digital assets platform in Hong Kong that worked with ETF issuers ChinaAMC and Harvest Global to launch the city’s first spot crypto ETFs.\n\nIn an interview with DL News, Pan said that fund issuers were in the midst of negotiating with the Securities and Futures Commission, or SFC, which regulates the markets in Hong Kong.\n\nWhile the SFC has yet to send a clear signal it will approve staking products, he’s hopeful they’ll soon get the green light.\n\n“There are a lot of different funds and crypto exchanges trying to negotiate with the SFC,” Pan said.\n\nStaking ban\n\nHis words echo sentiments from Vivien Wong, partner at HashKey Capital, who recently expressed optimism that an ETH staking product could hit Hong Kong within the next six months. HashKey also launched spot crypto ETFs with Bosera in April.\n\nThe prohibition on staking in Hong Kong contrasts sharply with the more permissive environment elsewhere.\n\nStaking is not only barred in Hong Kong for the ETFs but also on cryptocurrency exchanges; they cannot offer complex financial products for retail investors.\n\nJoin the community to get our latest stories and updates\n\nHong Kong launched its first spot Bitcoin and Ether ETFs in April, following the US launch of a spot Bitcoin ETF in January.\n\nThe six ETFs have $353 million in assets under management, according to data from The Block.\n\nPan noted that Hong Kong’s market size meant the rollout was always going to be smaller than in the US, but it was still below OSL’s expectations.\n\n“It only attained 30 to 40% of our estimates,” he said.\n\nGrowth of crypto ETFs\n\nSeveral structural barriers also impede the growth of crypto ETFs in Hong Kong.\n\nOne major issue is the lack of access to mainland Chinese money. Furthermore, many Hong Kong investors and family offices have direct access to US markets, diminishing the local ETFs’ appeal.\n\nAnother significant obstacle is the readiness of intermediary channels, which are crucial for distributing ETFs.\n\n“These intermediaries are not fully ready,” Pan explained.\n\nDespite these challenges, Pan believes that regulatory approvals for features like staking could catalyse growth.\n\nHe also anticipates a better performance in the coming quarter, as market conditions stabilise and regulatory clarity improves.\n\nCallan Quinn is DL News’ Hong Kong-based Asia Correspondent. Get in touch at callan@dlnews.com."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiqgJBVV95cUxNRHVyOEM4RGZQa3ZZWG0tc2Jra0xaLUZvYktXdnRkZWJwUVU3YXREMG50YVA3QVg4U3pyUGFWTkR4ek5YXzdkdjRWYUc2cU9tRU9vUV8yZnJLU1Q2SGNaMk1FdXJIdEZEcFFCZERGYnJfVDlLUnBGd2pZVGlQRnZSbmwtX3FHYWVoQ3AyOHlPVVNIWWlzbWZWanRteE4zZVk5WU9TLWVrV2VMVmtXWjZFZG1QVG9vWk9JUzAxcjhRWS1ZQ0U5QzI2aFR3MEdfZGFwbmdVUzRQQm1KaE55QTRVRjhiQjVBQ2FaR0xhZjYzT25QeFV3cDhHR3lVcjlwa0FmNmd4WTAwTUpLa0FrNU9aemtmWl9Dbk5ISDlLTnIycDFIM0VGLUEwUXRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Analysts Question Strategy Behind High Fees Of Grayscale Ethereum Spot ETF: They Seem Focused On 'Maximizing Short-Term Revenue Vs Playing Long Game' - Markets Insider",
        "content": "Eric Balchunas, a renowned financial analyst, recently expressed skepticism about the potential success of Grayscale’s Ethereum (CRYPTO: ETH) spot ETF due to its high fee structure.\n\nWhat Happened: Grayscale submitted updated S-1 filings with the SEC Wednesday, revealing the all-important information about the fund management fee. The digital asset management giant will charge 2.5% for its Grayscale Ethereum Trust, significantly higher than its competitors. A miniature version of the fund, Grayscale Ethereum Mini Trust, will however charge 0.25%.\n\nBalchunas questioned these moves, asking whether the 0.25% fee would be low enough to attract sufficient organic flows to offset what he referred to as “The Big Unlock”.\n\nHe further speculated on the ability of new entrants to the market to counterbalance the predicted outflows due to the flagship version’s high fees, drawing a parallel with Bitcoin (CRYPTO: BTC). “Anyway short story is the 2.5% fee made path to a decent net flow number a little harder,” Balchunas feared.\n\nCheap but not sure cheap enough to move the needle (as most are cheaper and brand name BlackRock is same fee) to attract organic flows to offset The Big Unlock. And do these newborns have enough strength to offset those outflows a la btc. Anyway short story is the 2.5% fee made… https://t.co/0sH0tXrjtL — Eric Balchunas (@EricBalchunas) July 17, 2024\n\nAnother well-known ETF expert, Nate Geraci, called this a “huge miss” by Grayscale, indicating that the mini trust should have been priced much lower. “Entire pricing strategy around both spot BTC & ETH ETFs seems focused on maximizing short-term revenue vs playing long game,” Geraci stated.\n\nBtw, think this is *huge* miss by Grayscale…\n\n\n\nIf you're gonna charge *2.5%* on ETHE, need to undercut market w/ mini trust.\n\n\n\nDisappointing.\n\n\n\nEntire pricing strategy around both spot btc & eth ETFs seems focused on maximizing short-term revenue vs playing long game. https://t.co/8DE1UIlCIo — Nate Geraci (@NateGeraci) July 17, 2024\n\nSee Also: Mark Cuban: Trump’s Re-Election Won’t Directly Impact Bitcoin’s Price\n\nWhy It Matters: These criticisms come even as other funds, including the one by BlackRock, are priced much lower. The ishares Ethereum Trust will charge 0.25%, and so will the ETFs by Fidelity and Invesco.\n\nGrayscale, which already operates the Grayscale Bitcoin Trust (NYSE:GBTC), faced significant outflows pressure after launch due to its 1.5% fees, highest among all spot Bitcoin ETFs. Since launch, it has recorded net outflows of $18.69 billion as of this writing, according to SoSo Value.\n\nGrayscale’s flagship Ethereum Trust, along with the mini Trust, are expected to go live for trading by July 23.\n\nPrice Action: At the time of writing, Ethereum was exchanging hands at $3,423.79, down 1.55% in the last 24 hours, according to data from Benzinga Pro.\n\nIllustration via Shutterstock.\n\nRead Next:"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOc1djNDR4MzBYMmJpV3poWjlHenQ0eWJVWlNfRUVlNHdZOXc1SURzQjFKQ1RLY3gtLXQ1aWJwUzVTblNWbFhpRHV5TkFYWURra2ZnOWxBSlk5WFNXeEIzUDE2cXpaMWUtTjBEbGpjdUdpclBlN2Y4TjQxdVNGamxyVTZFWWF1OXhRb19lbHlDWUFIcGZvYUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "BlackRock Announces 0.25% Fee for Ethereum ETF Launch - Crypto Times",
        "content": "BlackRock, a leading asset management firm, has announced a 0.25% fee for its soon-to-launch spot Ethereum exchange-traded fund (ETF). BlackRock stated in an amended S-1 registration statement filed on Wednesday that it might “waive all or a portion” of the fee for certain periods of time.\n\nBlackRock’s spot Ether ETF will start trading with a reduced fee of 0.12%, either until 12 months have passed or the fund reaches $2.5 billion in net assets, whichever occurs first, with potential fee waivers at launch. The amendment statements come after the Bloomberg Analyst announced 23rd July as the Ethereum ETF launch date.\n\n“The Sponsor’s Fee is accrued daily at an annualized rate equal to 0.25% of the net asset value of the Trust and is payable at least quarterly in arrears in U.S. dollars or in-kind or any combination thereof,” said the firm in their recent S-1 registration statement.\n\nOther issuers have also outlined their fee structures amidst a flurry of amended S-1 registration forms. Franklin Templeton’s spot Ether ETF plans to charge the lowest fee at 0.19%, while Bitwise, VanEck, and the 21Shares Core Ethereum ETF have set their fees at 0.20%, 0.20%, and 0.21% respectively. Fidelity and Invesco Galaxy will match BlackRock with a 0.25% fee.\n\nNotably, Bitwise, Fidelity, Franklin Templeton, 21Shares, and VanEck plan to waive their fees at launch, with VanEck waiving fees for 12 months or until it reaches $1.5 billion in net assets and Bitwise waiving fees for six months or until it hits $0.5 billion in net assets.\n\nGrayscale, however, will maintain its fee for the spot Ether ETF at 2.5%. Conversely, its newly approved Grayscale Ethereum Mini Trust will offer a more competitive 0.25% fee.\n\nPending approval, these ETFs will be listed on major exchanges including Nasdaq, New York Stock Exchange, and the Chicago Board Options Exchange, expanding access to Ethereum investments for institutional and retail investors alike.\n\nThe decision by BlackRock to introduce a 0.25% fee for its Ethereum ETF, with potential fee waivers, reflects strategic flexibility amid market competition and investor expectations."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOeldMUmR6Mk54Z1pRWmlsY0ZCdWFfS2ZUeUZySElnanAtOVR6UmlYTDdiN0VKMUxUclpVQ2dIX05YaDhKQndlMGJPeUhybl9jazkybmpoWVBwMHFkdVFyT24wajc4M3NidThnUGFKQTBaVGtFUkJiYktGZ3BVVHV4SUtxbmw5eFJlZGZMcEZ6Q0syTHdmUWIycEprb2lGUmxJYzdhWg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Here’s the $700M Signal Driving ETH to $4k - The Crypto Basic",
        "content": "Ethereum price topped out at $3,517 on Wednesday, July 17, 2024, marking a 25% rebound over the last 12 days of trading; on-chain data shows increased staking on the ETH 2.0 network could be a key bullish catalyst.\n\nEthereum Price Spikes 25% Ahead of Expected ETF Launch on July 23\n\nThe anticipation surrounding the potential launch of an Ethereum ETF on July 23 has been a significant driver behind Ethereum’s recent price surge.\n\nFurther buoyed by the dovish macroeconomic indices in the recent Non-Farm Payrolls and Consumer Price Index (CPI) data, market sentiment surrounding ETH has turned overwhelmingly positive as investors look forward to increased institutional participation and Fed Rate cuts in H2 2024.\n\n- Advertisement -\n\nThe chart above shows how ETH price fell to a 100-day low of $2,815, during the market crash on July 5. But since the dovish NFP data, bulls traders entered a buying frenzy over the weekend pushing Ethereum price back above the $3,000 level.\n\nHowever, on Monday, July 15, the Ethereum ETF’s impending launch on July 23 hit the newsreels. The bullish headwinds from the anticipated ETF inflows have put the Ethereum price rally into second gear this week.\n\nAt the time of writing on July 17, Ethereum’s price had broken above the $3,517 area, up 25% from the historic lows recorded on July 5. With the Ethereum ETF launch date still nearly a week away, speculators are betting on further upside toward the $4,000 range.\n\nEthereum ETH 2.0 Stakers have Deposited $700M in 7 Days\n\nAnother vital catalyst that has boosted the Ethereum price action in the last few days is the increased staking deposits lumped up by ETH investors. Since the Bloomberg analysts highlighted July 23 as a possible launch date, investors have increased the spate of deposits into the ETH 2.0 beacon chain staking contracts.\n\nThe chart below tracks the official data from Ethereum blockchain network, showing the daily changes in the number ETH coins deposited within the ETH 2.0 beacon chain contracts. Increased staking often occurs during periods where investors consider the effective yield more profitable than other alternatives, or when they are increasingly confident of the project’s growth trajectory.\n\n- Advertisement -\n\nAs of July 10, investors staked a total of 32,919,270 ETH in the Ethereum 2.0 staking contract. But following back-to-back dovish NFP and CPI macroeconomic reports, as well as the announced ETH ETF launch data, Ethereum investors have reacted by increasing their staking deposits.\n\nAt the time of writing, the total staked funds have now reached 33,124,709 ETH, reflecting an increase of 205,439 ETH within the last seven days. Increased staking during a market uptrend is interpreted as a bullish signal for a number of reasons.\n\nFirstly it signals that despite Ethereum prices climbing towards monthly-time frame peaks, majority investors are looking to staked more funds, and hold out for future gains rather than sell now. This decline in sell-side pressure could encourage indecisive new entrants to buy-in on the ETH rally in the days ahead.\n\nMore so, when the newly-staked 205,439 ETH is valued at the current prices, it means that investors effectively removed over $711 million worth of liquidity from the short-term market supply.\n\nIn essence, if investors keep cutting down selling pressure by adding more to the $700 Ethereum 2.0 staking deposits, ETH price is likely to advance further toward $4,000 as demand rises ahead of the ETF launch date slated for July 23.\n\nIn summary, the combination of heightened anticipation for an Ethereum ETF and the substantial increase in ETH 2.0 staking deposits are driving Ethereum’s price toward new highs."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNRzRRNHk0WDlyUDhoTkd5MFZqbGk2aVlNeHB2MWt4c2dmLWJHdmQxOHJLeHlXSnNDUW0yZWNKakVyWWZORlBZRGJibnBzcll5a0cwV203VXdpNmE2R3k3V19MTGdYS1hNMkZlNTFkczJHd3hENzNpZmtIdl9PU294WTFUOEt2Z19odFFxOE9CRTQ4MFcwSE9Kb3pCekx5Z2VFclJTNjFJQ2tuWWpnWGZzNzBoVFhneVloT0VXZUVDLThEblhCNG54a25B0gHPAUFVX3lxTE5PRWN2ejdEUFFac0t2eGNMMFZBaS1RLVNWc05tSXBxblVpd2JMcDA0dDRiNEVSTmJxX0Z6UGk5UUZBUFBBRm5CMXIzR2ljdTJYYlBzYUNrNHk2OG9lSS1HbHRIMXVVZnlhN3E4NEE3OW1icEdjTmdiUnBKdS1JQThMYVJ1RnlDOWZCLXp1QjYzMjNLdXYwMVJGeDVWM3JvZDhsVDZnaDRVN2hsdGhtYkxRd2JfeWxMdmdLVGxrSGI2SmZXSzg4Q0RKMEQ4d01YZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Europe’s Top Derivatives Exchange Targets $400B Ethereum Market with New Instruments - Finance Magnates",
        "content": "Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights Finance Magnates Pacific Summit 2024 | FMPS:24 Highlights\n\nRelive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Relive the best moments from the Finance Magnates Pacific Summit 2024 with our highlights video! ✨ From action-packed moments, insightful speaker sessions, the exclusive Opening Blitz, and immersive workshops, this video captures the energy and excitement of FMPS:24. Whether you attended or missed out, here’s your chance to experience the top moments that made FMPS:24 unforgettable. 🎬 Watch, share, and join the conversation! Don’t forget to use the hashtags #fmps #fmps24 #FMevents when sharing. Stay tuned for more events. See you next time! 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more!"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQdERSVllSOVRFRTl2QkpRV21hSjVRZmgzS1V0bkw4VkFXMFhvTG9qdjJLSS04UkFDWGcxdlpNODY3aTRsQlUySldCZGd4cWl2R2ZObFNfSHVZSVpFamRTcXVXeGNzVlhEY09HRXhJWFBrVjBNZDB6VTM5Y0NRRWQwR0lJR1FSVzNEYU9CMGRqbnh4Q1ZuNllQZFZ3R19DR03SAaQBQVVfeXFMTVg5NjN5SVFHV3YzZTM3Z1RqWVFVWjZiOHpOMFNuLU1jbFBDdWxqUjY1OFVJellsZHh4V09XaGdmeFB0YWJwN2VBLVZXUHBUWEt2Z0dFSy1tS3JKUk9NSkNEM3U3dlRyZTgzQzNGR2N0c0puSEhlZUdLV1ZocE5zTm11YzE3X2QzalFuN0JxclhLTU9MelpYYlVLOWFsNDNqRGpnM3g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Is XRP Ready for $0.7? Shiba Inu (SHIB) on Verge of $0.00002, Ethereum (ETH) Reversal Halted - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nXRP's 30% rally placed the asset at the forefront of the bull market, with the potential to break even higher, potentially hitting this year's high of $0.7, but numerous factors should align for it.\n\nOver the last few days, XRP has demonstrated remarkable strength, breaking through major resistance levels and drawing interest from the cryptocurrency community. With many speculating as to whether the momentum can push XRP even closer to $0.7, the rally has brought the cryptocurrency very close to a critical threshold.\n\nNumerous signs point to the possibility that XRP will keep rising. First, there has been a noticeable surge in trading volume for the asset, which suggests that investors are actively participating in it. As more market participants join the rally, this spike in volume frequently precedes subsequent price increases.\n\nFurthermore, technical research reveals that XRP has overcome a number of resistance levels and converted them into support. The previous thresholds at the $0.52 and $0.54 levels are now serving as support, giving the next leg up a strong foundation. Major cryptocurrencies like Ethereum and Bitcoin are also seeing gains, and the market's attitude toward cryptocurrencies is currently positive overall. This general bullishness on the market makes it easier for XRP to profit from the upward momentum.\n\nAdvertisement\n\nShiba Inu regains important positions\n\nShiba Inu is getting closer to the $0.00002 price threshold, which could be the next move for the asset since it is already trading close to the month's high. The main issue with the asset right now, though, is the lack of momentum.\n\nWith steady ascents toward the $0.00002 mark, SHIB has demonstrated a comeback in the last few days. This level poses a major psychological obstacle for investors and traders. Crossing above this barrier might open the door for more gains and possibly spark a bigger rally. Technical indicators show that SHIB has overcome a resistance level of 100 EMA.\n\nThe asset is currently up against the 200 EMA resistance, though, and it could be a major obstacle. Additionally, the Relative Strength Index (RSI) is getting closer to the overbought area, indicating that the current rally may be flagging. Even with the improvement, the trading volume is still low when compared to earlier spikes.\n\nThere is reason for concern because this weak trading activity suggests that there may not be enough market interest to sustain the current price movement. A spike in volume would be required to give SHIB the necessary momentum to continue on its upward trajectory.\n\nEthereum stops\n\nEthereum has hit the 50 EMA resistance level and now might retrace below key values like $3,300. Luckily, we saw a volume surge, which could be a sign of an upcoming reversal.\n\nEthereum experienced a setback after its recent rally brought it close to the 50 EMA resistance level. At $3,300, a critical support level, the asset is presently having difficulty holding its position. The 50 EMA presents a significant challenge because, if not decisively broken, it frequently functions as a barrier that can stop upward momentum. The increase in trading volume is one aspect of Ethereum's current market activity that is positive.\n\nStronger interest and participation from traders are frequently indicated by increased volume, and this can result in more persistent price movements. The increase may suggest that buyers are entering the market, which could lead to a reversal.\n\nWe might witness a further retracement of the asset, possibly testing lower support levels like $3,200, or even $3,000. This could happen if the asset is unable to hold its position above $3,300. Further, worth keeping an eye on is the Relative Strength Index, which can reveal if an asset is overbought or oversold and offer insights into potential future price movements."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBVelRFZ3VWQ3NVaFZfM3FVR181MlRQYV9EVlN3bGVpejNfUks0UFZyTzhwMkNyeWl5NTE0b3hiV3hKM253OFJHR3MxUXQyNENpV0JTT2tERkgtN3I5UjVvbHg3U1ItN0xTQTlxOHU1cnZPbUlGazVJ0gF8QVVfeXFMTjVHalc2MU5ob0dzN3pTZHk5a29TY3dpM2FtTzdBem8wSHg3czZWVVYtT0N3VnFtWm5VRW1FWlhYTERvSXVXWmh6UUFZb2ZldWFvRmFmLUNPVWg2V2cyb0QtTFlUWXdTODlVYXhPYXJuam9TajBkUV9mT3FYSw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Ethereum VS Solana: Which Blockchain is Better for Minting NFTs? - CryptoPotato",
        "content": "If you’re struggling to decide between choosing Solana or Ethereum to mint your Non-Fungible Tokens (NFTs), you have come to the right place. In this guide, we’ll explore each blockchains’ strengths, capacities, weak points, and overall differences so you can make a better decision that suits your goals in the NFT market.\n\nEthereum: Ecosystem, Marketplace, and Security\n\nEthereum is undoubtedly the largest ecosystem in the DeFi (decentralized finance) sector, with thousands of projects of all kinds building on it. So it’s no surprise that the vast majority of NFTs are running on it as ERC-721 tokens.\n\nTo be accurate, roughly 95% of all the NFT ecosystem uses Ethereum, so it’s no coincidence that when investors look for an NFT marketplace, the first one they usually run up to is OpenSea, Rarible, Nifty Gateway, and more.\n\nWhen it comes to size, Ethereum takes the lead with a much bigger pool of buyers and sellers – or, in other words, trading volume. So if you mint NFTs in an Ethereum-based marketplace like OpenSea, you could get more exposure and people willing to buy or place bids on your NFTs. On the other hand, everyone knows there’s also a huge supply of NFTs that no one would ever like to buy or bid for.\n\nWant to mint your first NFT on OpenSea? Check our step-by-step guide here.\n\nEthereum’s attributes make it one of the top ecosystems for starting a DeFi project. Its data architecture and security components are the reason why so many developers are building on top of its blockchain.\n\nHowever, when network activity increases exponentially (which is something frequent), the network suffers a major transaction backlog, which leads to an enormous spike in transaction fees that usually surpass the digits per transaction, something that could be affecting the number of users who can afford to mint NFTs.\n\nThis has prompted NFT creators and collectors to seek alternative blockchains with higher throughput, scalability, and lower gas fees. One option that has become a very serious competitor is Solana —a high-performance blockchain that leverages different cryptographic mechanisms to scale its network (we’ll discuss this later.)\n\nWhile paying elevated gas fees can be a crippling experience sometimes, the upside is there’s more money flowing in Ethereum, so the flipping ceiling is way higher. Data from CryptoSlam shows that Ethereum has had a whopping selling volume of over $1.8 billion in the last 30 days, compared to $120 million from Solana-based marketplaces.\n\nAccording to current data from CryptoSlam, the most popular NFT collections in the market exist on the Ethereum blockchain. These include CryptoPunks, the Bored Ape Yacht Club (BAYC), the Mutant Ape Yacht Club (MAYC), and so forth.\n\nAdditional data shows that the average NFT sale price in Ethereum (as of Q4 2021) was around $3,000 compared to Solana’s $1,000.\n\nSolana: Throughput, Low Fees, Growing Ecosystem\n\nSolana takes the lead in terms of technology, functionality, and versatility.\n\nSolana is a high-performance blockchain that uses a consensus mechanism called Proof-of-History, which leverages a set of protocols to execute transactions with high throughput— more than 60,000 transactions per second (TPS).\n\nIn Solana, transaction costs are usually less than a dollar. Many NFT projects and collectors are migrating to Solana to benefit from its scalability and low transaction fees. They have more freedom to build their projects without suffering from technical limitations, which is why Solana is turning into a hub for general NFTs.\n\nMinting NFTs with a Solana-based marketplace like Solsea is remarkably cheap, fast, and easy to profit from once it hits the secondary market. Usually, Solana mints are quickly snapped up, and royalties in Solana-based markets are also frequently higher compared to Ethereum-based ones.\n\nWhile Solana’s ecosystem isn’t nearly as big as Ethereum’s, it doesn’t mean it isn’t growing. In fact, Solana’s user base has been growing at a much faster pace since the beginning of 2022, and even analysts from investment bank JP Morgan have claimed that it could overtake Ethereum in the long run.\n\nAccording to data from CryptoSlam, the NFT market in Solana gained significant momentum throughout the third quarter of 2022. By the end of January, the ecosystem’s sales volume crossed the $1 billion mark.\n\nOne of the most popular collections on the Solana blockchain is the Degenerate Ape Academy, a collection of 10,000 unique NFT Apes.\n\nWhile they may look similar to the Bored Apes from Ethereum, they have their own set of unique traits.\n\nThey can be pretty expensive, too—the highest sale price for a Degen Ape was $1.1 million in September 2021. However, in mid-December, an NFT from the Solana Monkey Business collection was sold for over 13,000 SOL, or about $2 million.\n\nGrowing ecosystems frequently offer early adopters a great opportunity to establish themselves at the top of the list by the time they reach a larger audience. However, one of their problems is that the risk is usually higher. Since the beginning of 2022, the Solana network has suffered several downtimes, forcing users to liquidate their positions as they were unable to top up their collateral during the outages.\n\nAnother concern that developers have addressed lately is the rise of rug pulls in Solana. This is usually the problem with emerging technologies, as scammers will try to spot and take advantage of any weak points they can find. However, rug pulls and scams can happen on both sides of the story, so it’s not only about security issues but rather making sure you do good research before investing in an NFT or any DeFi projects.\n\nRugpulls are the most common type of scam in the DeFi ecosystem. If you want to learn how to spot them, check our latest guide on the matter.\n\nClosing Thoughts\n\nEach blockchain has its own pros and cons, so it really comes down to what you want to do with each one. If you’re looking for a high-throughput blockchain with scalability and low gas fees, then Solana might be more suitable for you.\n\nSolana\n\nPros:\n\nHigher throughput and scalability.\n\nGrowing ecosystem.\n\nLow gas fees and environmentally friendly.\n\nMinting NFTs is cheap and relatively straightforward.\n\nCons:\n\nLess secure network.\n\nLower exposure with a smaller market.\n\nDowntimes are more frequent.\n\nNow, if you want exposure to a bigger market and benefit from the security aspects, then you might be better off with Ethereum.\n\nEthereum\n\nPros:\n\nAccess to a larger market.\n\nHigh network security.\n\nNFTs are sold for a much higher price on average.\n\nCons:\n\nNetwork congestion can cause transaction delays.\n\nLower throughput and scalability.\n\nTransaction fees can become unpayable for a good percentage of users who want to mint NFTs."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPR3RVVEh5M3NHN1BSamgtSHprREtRdFhWZ1E0eUoxWHRaVzkwZE11bEJPNzJHSWlrd3MyOXRDN0hmVlotODJGWjJqWktHcmV3MDFIbHJHc0tUajZuTTEyQUpDUWhnd2ZKU3pRZmdGbGRHTnhfcVlpeHdPOGNNOE5wUFh5OExWQ0lOaVEtY3NUUVhQREZ3c2FWME9mN0IwZUZLRllTdDV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "The launch of Ethereum ETFs: the news from the community - The Cryptonomist",
        "content": "The crypto world is buzzing with news, July 23, 2024, will mark a crucial date for Ethereum (ETH) investors: on this date, in fact, the launch of several exchange-traded funds (ETFs) on ethereum in the United States is expected, an eagerly awaited move that could lead to a significant turning point for the cryptocurrency market.\n\nThe Securities and Exchange Commission (SEC) of the United States recently responded to the issuers regarding the final approvals for these ETFs, granting preliminary approval for at least three of the eight proposed.\n\nThe launch of Ethereum ETFs: the news from the community\n\nThe ETFs on ether cash represent a significant innovation for the US financial market. The issuers of these ETFs have worked closely with the SEC to ensure\n\nthat their registration statements become effective, thus allowing the ETFs to start trading smoothly. This intense collaboration was necessary to meet the strict regulatory requirements and to gain the necessary trust from the regulatory authorities.\n\nThe introduction of ETFs on cash ether could have a significant impact on the cryptocurrency market. ETFs represent an accessible and regulated investment tool that allows investors to gain exposure to cryptocurrencies without having to purchase them directly.\n\nThis could lead to an increase in the demand for ether, as institutional and retail investors look for safe and regulated ways to enter the bull market of cryptocurrencies.\n\nAccording to analyst John Smith, the preliminary approval by the SEC for ether ETFs is a positive signal indicating a growing recognition and acceptance of cryptocurrencies by regulatory authorities.\n\n“This move could pave the way for further financial products based on cryptocurrencies in the future, further contributing to legitimizing the cryptocurrency sector as a whole,” said Smith.\n\nWith at least three of the eight proposed ETFs on ether already preliminarily approved, the competition among issuers is becoming fierce.\n\nAmong the main contenders are high-profile financial companies such as VanEck, ProShares, and WisdomTree, all with extensive experience in managing ETFs on other asset classes. The competition between these financial giants could lead to significant innovation in the design of ether ETFs, with the goal of attracting a wide range of investors.\n\nThe regulatory challenges\n\nDespite the preliminary approval, the issuers of cash ether ETFs still face several regulatory challenges. The SEC, in fact, has expressed concerns regarding the volatility of the cryptocurrency market and the possibility of market manipulation. For this reason, the issuers must demonstrate that their products are designed to mitigate these risks and protect investors.\n\nJulie Anderson, expert in financial regulation, emphasized the importance of this verification process.\n\n“The SEC is trying to balance innovation with investor protection. Issuers must demonstrate transparency and solidity in their proposals to obtain final approval,” said Anderson.\n\nIf everything goes according to plan, the launch of cash-settled ether ETFs on July 23 could mark the beginning of a new era for the cryptocurrency market. Investors will finally have access to a regulated instrument to invest in Ether, which could lead to an increase in confidence in the cryptocurrency market and greater participation from institutional investors.\n\nFurthermore, the success of ETFs on ether could pave the way for the approval of other financial products based on cryptocurrencies, such as ETFs on other cryptocurrencies or on diversified cryptocurrency portfolios. This could further expand investment opportunities in the cryptocurrency sector and help stabilize the market in the long term.\n\nConclusion\n\nThe preliminary approval of cash ether ETFs by the SEC represents an important step towards the integration of cryptocurrencies into traditional financial markets.\n\nThe launch scheduled for July 23, 2024, is awaited with great interest by investors and industry operators, as it could mark a significant turning point for the cryptocurrency market.\n\nHowever, it remains to be seen how the issuers will overcome the regulatory challenges and if they will manage to obtain the final approval from the SEC. In any case, the attention of the financial world will surely be focused on this historic event, which could open new perspectives for investment in cryptocurrencies."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxQYXV0RXVwZHdDT1ZOSjlNUm02cmJmYkJ2MGdNbktCamhfVE1xTDRUeVRyc1p2RXpqSXdIZTRKRDZPdFNOMnNBQV9CVk0xTmd4MzYwLVdCVmE1TVZxSFJuVEVfSGNkb0ZVZUREc0twRVp0SDhoV2ZIRVJROHlTVm50NUlsUUVnbWdlaDBCZ1h6azBlNW1JRHdSZE1hOEhxMUQyc1R6V3pJX3ZSZlpmd2hDX0VrWTRWeDNLa1gtTVV3R2hkdkRTaDdPSUM1dmQxNDMzdGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Traders pile $20m into Ethereum bets as ETF launch looms — here’s where they see the price heading - DLNews",
        "content": "Ethereum ETFs are expected to launch next Tuesday.\n\nEther is predicted to hit new highs later in the year.\n\nTraders have put $20 million on bullish bets that suggest that Ether will rally on the back of the launch of spot Ethereum exchange-traded funds, with others expecting the cryptocurrency will hit new record highs later this year.\n\nThe trades — puts and calls on options that expire on July 26 compiled by tracker basedmoney — come as market watchers expect spot Ethereum ETFs to launch on July 23.\n\n“It appears the majority of traders see the ETF as a catalyst for price action to the upside,” Bartosz Lipinski, CEO of crypto exchange Cube.Exchange, told DL News.\n\nMarket watchers hope that spot Ethereum ETFs can replicate the success of similar Bitcoin funds that launched in January and catapulted the cryptocurrency to a new all-time high in March.\n\nEther trades 30% below its all-time high of $4,878.\n\nBullish bets\n\nTraders piled $20 million into bets that pay off when the price gains.\n\nOf the 467,220 bets made on trading platform Deribit, about 7% are for payouts when the price reaches $4,000, making it the biggest position for the July 26 expiration.\n\nOver 31% of trades that expire on July 26 pay out in the range of $4,100 to $6,000.\n\nJoin the community to get our latest stories and updates\n\nHowever, “a not insignificant amount” of almost 5% of trades were at the $3,000 strike, he added.\n\nThis shows “that a decent minority of traders are taking the contrarian stance that ETH could drop on the debut,” Lipinski said.\n\nHe suggested that these trades represent a hedge against the same sell-off that happened shortly after spot Bitcoin ETFs were launched.\n\nLipinski added that bullish bets, or calls, outweigh bearish ones, or puts, “at virtually every expiry,” which suggests that the market is optimistic about Ether’s price in the months ahead.\n\n“The further out into the future we look, the more bullish sentiment grows,” Lipinski said.\n\nThe number of open contracts for bets that pay off on December 27 for prices at $5,000 and $6,000 is “well above any other level, and says to me that the market believes ETH could hit a new high by the end of the year,” he added.\n\nCrypto market movers\n\nBitcoin is down 1.8% over the past 24 hours to trade at $63,913.\n\nEthereum is down 0.9% to $3,409.\n\nWhat we’re reading\n\nEric Johansson is DL News’ News Editor. Got a tip? Email at eric@dlnews.com."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQa2RNakI1V2trRDU5UGRTZ1JtYklJQ3ZrWU5vLWlTU3RBeW1XSVVnX0RidV9LalltdjhBSThXSnNOM1Z4bWNwSXAxdVhBVXhnQU5jRllKTWZoMnJwTVpJRHVvWFdsWTd5Tkl6eU9sVjNyWlFSSHAtYlB0X1Z1X3J4c3lFSG9wa0nSAY8BQVVfeXFMUHNZelJiU3h4SGhVTzRWbU5NTW5WaHFSQVJsU1l2V2lyY0ExU0pseU14WFA3SU8yb2c2SlZleEVmb0p5RWVZWXc3Nnhuc3lLSHJPN2p2d3hJd3JtMGRpZzZqUUtoZzVQTlFqTHRMVy1sSlhualJhSTJoR3docC11X2RTeS12YVJ5VEtLU3AyOUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Creator Vitalik Buterin Rattles Industry After Warning of Pro-Crypto Candidates - Decrypt",
        "content": "In brief Ethereum co-founder Vitalik Buterin wrote a post warning voters from supporting \"pro-crypto\" candidates that may be making superficial promises.\n\nButerin's post received a range of reactions, with one outspoken crypto startup CEO calling him \"politically naive.\"\n\nRepublicans and presidential candidate Donald Trump have increasingly embraced crypto during the 2024 election cycle.\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA blog post published by Ethereum co-founder Vitalik Buterin Wednesday urged prospective voters not to support political candidates simply because they call themselves pro-crypto.\n\nThe post elicited a wide range of reactions from crypto industry figureheads, and didn’t sit well with some of the industry’s more conservative voices—particularly Messari CEO Ryan Selkis, an increasingly vocal backer of former President Donald Trump.\n\n“Vitalik is an idealist, not a realist. He is one of the more politically naive people I have read and/or interacted with in crypto,” Selkis told Decrypt. “Moreover he’s Canadian, and he’s given thinly veiled permission to vote for the most provably authoritarian and anti-tech president in American history because he’s intellectually overconfident but politically weak.”\n\nSelkis co-founded the crypto market intelligence firm Messari in 2017. Over the past few years, he’s emerged as a political heavyweight within the crypto industry, coordinating efforts to fund a crypto-friendly political action committee, while railing against the Securities and Exchange Commission (SEC) on Twitter (aka X) for what advocates say is a regulatory war on crypto.\n\nAD\n\nAD\n\nAgainst choosing your political allegiances based on who is \"pro-crypto\"https://t.co/rEbRjZYtFB — vitalik.eth (@VitalikButerin) July 17, 2024\n\nIn his blog post, titled “Against choosing your political allegiances based on who is ‘pro-crypto,’” Buterin emphasized that supporting crypto isn’t limited to the regulatory treatment of cryptocurrencies or blockchain tech.\n\nHe argued that a politician’s stance on issues like privacy, internationalism, and even immigration are part of the larger “cypherpunk” picture—and that a candidate simply claiming they’re “pro-crypto” to get more votes isn’t a very meaningful embrace of those values.\n\n“It doesn't matter if they also support banning encrypted messaging, if they are a power-seeking narcissist, or if they push for bills that make it even harder for your Chinese or Indian friend to attend the next crypto conference,” Buterin wrote of a presiding political dialogue in the U.S. “All that politicians have to do is make sure it's easy for you to trade coins.”\n\nAD\n\nAD\n\nJake Chervinsky, the chief legal officer at venture capital firm Variant Fund, replied on Twitter that Buterin’s post had “solid points,” but that some readers were likely to draw a conclusion that Buterin himself did not explicitly state.\n\n“Too many people will read the headline as ‘Vote Biden!’ and miss the rest,” Chervinsky wrote.\n\nAnother headline for this could have been \"Don't sacrifice your cypherpunk ethos for a particular 'pro-crypto' politician or policy proposal.\" I entirely agree with that principle. Politicians will come and go. Privacy, speech, and the rule of law must be preserved. https://t.co/QrrBwoDNGu — Peter Van Valkenburgh (@valkenburgh) July 17, 2024\n\nPeter Van Valkenburgh, the director of research at Coin Center, a non-profit focused on crypto policy issues, recommended an alternative headline for Buterin’s post.\n\n\"Don't sacrifice your cypherpunk ethos for a particular 'pro-crypto' politician or policy proposal,” Van Valkenburgh suggested on Twitter. “Politicians will come and go. Privacy, speech, and the rule of law must be preserved.”\n\nIncentives aligned?\n\nCastle Island Ventures partner Nic Carter wrote that crypto already aligns with his “libertarian/conservative values,” and that it only makes sense that Republicans would embrace it. He also argued that Trump has surrounded himself with politicians that are “authentically pro-crypto,” such as his vice presidential pick Sen. J.D. Vance (R-OH) and the one-time presidential candidate Vivek Ramaswamy.\n\nButerin did not immediately respond to a request for comment from Decrypt.\n\nOn Twitter, Selkis has described November’s coming choice between President Joe Biden and Trump as an existential moment for crypto. On Wednesday, he wrote his “political allegiances [are] based on who is mentally competent to be commander-in-chief.”\n\nAD\n\nAD\n\n“I also like Trump's evolution on crypto,” the CEO added.\n\nIt's also worth noting that Vitalik's political commentary is meaningless to me, and should be to you as well if your primary focus is American politics. He is a Canadian and Russian. I humbly suggest that he fix those governments first, and stay out of American politics. — Ryan Selkis (d/acc) 🇺🇸 (@twobitidiot) July 17, 2024\n\nIndeed the former president has changed his tune on crypto since saying Bitcoin “seems like a scam” in 2021. Accepting crypto donations now while defending the industry, Trump is set to be a headline speaker at next week’s Bitcoin conference in Nashville, Tennessee.\n\nFollowing the failed assassination attempt against Trump by Thomas Matthew Crooks during a Pennsylvania rally Saturday, Selkis’ comments drew mixed reactions. “The Civil War for the country started today,” Selkis wrote, prior to posting, “Praying for peace. Preparing for war.”\n\nWithout explicitly naming any politician, Buterin wrote that a politician’s thoughts on crypto years ago are a relevant gauge for future expectations. How a politician acts when supporting freedom and supporting corporations are at odds with each other is telling too, he wrote.\n\nEmphasizing the importance of decentralization among crypto pioneers like Satoshi Nakamoto, Buterin reprised a quote from the pseudonymous creator of Bitcoin. He described Nakamoto’s response to someone doubting cryptography’s ability to solve political problems as a rare statement on the subject, and an early lesson that informed crypto’s core values.\n\n“We can win a major battle in the arms race and gain a new territory of freedom,” Satoshi wrote of peer-to-peer networks. “Governments are good at cutting off the heads of centrally controlled networks like Napster, but pure [peer-to-peer] networks like Gnutella and Tor seem to be holding their own.”\n\n“Thank you for writing this,” Linda Xie, the co-founder of Bountycaster, a bounty service for the decentralized social media network Farcaster, wrote on Twitter. Previously, she posted, “I'm not a single-issue voter on crypto and won't support someone just because they are pro-crypto.”\n\nAD\n\nAD\n\nFollowing Buterin’s blog post, Selkis wagered that Buterin wouldn’t debate him because it would reveal “how little he understands politics outside of textbooks.” Still, Selkis pondered whether Buterin could present himself one day as “a debate equal.”\n\nEdited by Andrew Hayward"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQQkVPU3F1dzNaZ2NkYnMxUU14azhZcE1wRFh2RjJDOVJrNldZWnVFTnFGLUExSDFXTkh6eTBrNkZ3MWFZNFNUeUU1NUsxNFNydEFKOWlUdnRGMXhIV0ZHMmgyQ2p2NzRiWnhVTHhCWU54Z1NJZTNlQnpaQUxOSDh0YUZkaU5Zc1lNUVZISC12S0hqWkZ4bTNRSEl0bVRmY0hLYndaRFgzSzZQa0lpVGNsT1ZvTUg1bEctMlpDbUpub3dVRE9WRGh1NnU2eGRYSzV1X3R0UFhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin warns against voting on crypto policy, as a16z founders endorse Trump - Fortune",
        "content": "One of crypto’s most influential voices has warned the industry to refrain from voting for political candidates based solely on their digital asset policies. In a blog published Wednesday, Ethereum’s co-founder Vitalik Buterin argues that electing candidates simply for being crypto “friendly” could hurt the industry more in the long-run. Considering whether candidates are ideologically at-odds with what crypto stands for, is more important than if they endorse the right to trade coins in the here and now, he argues.\n\n“If you care about freedom, you might want the government to respect your freedom to have the kind of family you want. If you care about building more efficient and equitable economies, you might want to look at the implications of that in housing,” he continues. Buterin added that losing site of these bigger questions could lead crypto voters to lose sight of the ideals that “originally created crypto in the first place.”\n\nIn his view, crypto payments are just one iteration of the decentralization movement’s larger ideological goal of freedom, and a party’s commitment to protecting this goal is what should be on the ballot. “Decentralized networks are good at protecting freedom, and money is an important sphere where such networks can be applied – but it’s one important sphere among several,” he writes.\n\nAgainst choosing your political allegiances based on who is \"pro-crypto\"https://t.co/rEbRjZYtFB — vitalik.eth (@VitalikButerin) July 17, 2024\n\nTrump, who has committed to be the “crypto president,” will speak at Bitcoin 2024 next week, an annual conference that also serves as a tribal gathering for fans of the original cryptocurrency. Details of what he will discuss have not been disclosed. David Bailey, CEO, BTC Inc., the organizer of the Bitcoin Conference, told Fortune in a statement that Trump will “share his vision for the future of the American Bitcoin industry and its impact on the U.S. economy.”\n\nIn his blog post, Buterin also listed examples of technologies that should also be protected in the name of freedom, beyond just crypto and blockchains. This includes encrypted messaging, privacy from centralized AI companies, and prediction markets and Community Notes that he argues help people form “high-quality opinions about important topics in an adversarial environment.”\n\nButerin’s appeal to higher ideals, however, was quickly met with suggestions he was ignoring political reality.\n\n“Much of this seems too clever by half. Good crypto policy requires electing pro-crypto candidates, period. Political reality beats idealism every time,” responded prominent crypto layer Jake Chervinsky on X. Another user added, “The underlying goal has to be mass adoption, which requires good policy. The tech is inherently democratic.”\n\n‘Sorry mum’\n\nButerin’s blog comes just one day after Ben Horowitz and Marc Andreessen, co-founders of tech venture capital firm a16z, announced their endorsement of Donald Trump on a podcast. “For little tech, we think Donald Trump is actually the right choice. Sorry mum, I know you’re going to be mad at me for this, but we had to do it,” Horowitz said. On that same podcast, Andreessen expressed his fears over how the Democrats might regulate Silicon Valley: “My big concern is what we saw in crypto was the foreshadowing of what’s gonna happen in AI.”\n\nThe a16z founders aren’t the first prominent members of the industry to make their support for Trump public.\n\n“I am going to vote for the person who’s going to do the best job for our economy…I am a voter when it comes to economics, and on that basis, Trump.” ARK Invest CEO Cathie Wood said during an interview with YouTuber Kevin Paffrath last month.\n\nIn addition, this week it was reported that Tesla CEO and meme coin enthusiast Elon Musk is donating $45 million per month to a new pro-Trump super political action committee, called America PAC. Further donors to the lobbying group include the Winklevoss twins, who founded crypto exchange Gemini, and former U.S. Ambassador to Canada, Kelly Craft, who has lobbied on behalf of the Bitcoin mining industry.\n\nProminent crypto figures turning to Trump is also indicative of a wider shift. A June survey by Paradigm found that 13% of Republican swing voters are now more convinced to vote for him in light of his recent crypto conversion. Moreover, just over one third of Republicans view crypto positively, the survey found."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5YMEg1NVhoVVlqTnFhcUpaamVjZFEweW1kVEE5Sk56UGNKVlZ1TklLV1MwLXRNdzdnTm8wSm9lVENrRXBnMmcxemdLQlV5amtNcUhtZ1lNRHR6TE5hdndhZEtoM1BqTXBpZEVPWUZiVGdPa1B6T19zRG9n0gF_QVVfeXFMTlJGaUpkVnFFSDhQUU1BOF93RzVFckVId0JscTdZVWtJRzhzNDFDd0UycHlDMUp0dzVmUkFsenIwTFh3VnRNb25mcWY5a1JjRUI0RmFZXzJWSUMzNWpuXzIzS0t1a0REMTFSeHNxdEJsSkE5alBnMGVvU2kxXzAxaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Reach $4,000 Next Week? 10 ETFs Launching - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum could break through numerous resistance levels and even enter the path toward an ATH after numerous ETFs might potentially get approved next week. However, staying cautious is still extremely important.\n\nAdvertisement\n\nThe market has been buzzing since 10 Ethereum ETFs, including VanEck Fidelity and Grayscale, have announced their upcoming launches next week. These ETFs may result in large capital inflows into Ethereum, similar to the substantial capital inflows that Bitcoin saw following its approval of ETFs.\n\nThe approval of Bitcoin ETFs has historically raised investor interest and resulted in significant inflows, which has raised prices. Ethereum's price may see a large increase if Ethereum ETFs exhibit a similar pattern.\n\nJust below the 50-day Exponential Moving Average (EMA) major resistance level, Ethereum is currently trading at $3,440. In the event that this level is broken, $3,800 could be the next major barrier. If the ETF approvals proceed, the flood of institutional capital could propel Ethereum past this point, perhaps aiming for the psychological $4,000 threshold. But we must approach this optimism cautiously.\n\nAdvertisement\n\nThough the market can be unpredictable, there is a good chance of significant inflows. It is possible that some of the expectation of ETF approvals has already been factored in. Further more, there may be a retreat if the approvals are delayed or denied.\n\nThe potential approval of 10 Ethereum ETFs next week could significantly impact Ethereum's price, possibly driving it toward $4,000. If we derive parallels from Bitcoin's ETF-driven inflows, Ethereum might see substantial institutional investments. However, the general sentiment on the market has much more impact on Ethereum or even Bitcoin right now than the potential approval of the ETF."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQdlpFVnN0UzVNVkgwVjYxeTZ5R05aSEVaeFJFVTJDLVJ5c250RG43ZFB6djN2REFuVzBFc0FVVnlTT1ZJRHBmLTlRQ3diLTFlQUFMZEFQa2VnREtQcFFPeHdONzVleHlqS0NUOVRnRlVuQ1lzT0pKQ0VwaEswLTB5Rl9vR0tYejFzV0tRYmp3dWpEb1E4LUpMRVo5Q3Jac0pxMjdvb05Fb2dsQdIBrwFBVV95cUxOdEJORG1DNEw3NmVOa3BULUlCbk5hanAweUg3TF9yenpzX3RQbS1NcnVidlRUMDRVLWFwT2pJN1A2UXdFNUdzQkl3czBDUnRSOF9fMC1uc2RMVFUxZ3A5NUZDNG5vdlZxczZ5Tkw2cnE4Mzk4RFBwRzNUaUNnUkVSMHdObjB5NzBFYkVua2RUTWk4TWZrREJ0MEJ4c1I4R3dTTTUyX3VzdldQZ1hwdGZr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "‘Ancient’ Ethereum (ETH)-Based Altcoin Jumps Over 50% on New Coinbase Listing - The Daily Hodl",
        "content": "A gaming altcoin built on Ethereum (ETH) is seeing 50% gains after being suddenly listed on top US crypto exchange platform Coinbase.\n\nIn a new post on the social media platform X, Coinbase says it is now listing ETH layer-2 gaming blockchain Ancient8 (A8) with an experiment label, meaning the asset could have low trading volume and high volatility.\n\n“Ancient8 is now live on coinbase.com and in the Coinbase iOS & Android apps with the experimental label. Coinbase customers can log in to buy, sell, convert, send, receive or store these assets.”\n\nAccording to A8’s official website, the protocol uses Ethereum scaling solution Optimism (OP)’s blockchain to significantly boost performance and lower fees when developing games.\n\n“As the pioneer gaming ecosystem on the Optimism Superchain, Ancient8 leverages OP Stack Layer2 tech to offer blockchain games the best of Ethereum with no code changes needed, at a significantly lower cost.”\n\nAncient8, which first launched its testnet in 2023, currently features five games: Onchain Clash, Omnizone, MasterDuel, Wee Pepe, and DeWorld. The project says it sees a future where gaming, interoperability, and decentralization seamlessly intertwine.\n\n“Looking ahead, Ancient8 aims to strengthen network decentralization and build a robust gaming community. With that goal in mind, we envision a continuously evolving Web3 gaming forefront, where decentralized technology and community collaboration coexist in harmony.”\n\nThe news sent A8 soaring from a 24-hour-low of $0.172 to a 24-hour-high of $0.261, a 51% leap. The token has since corrected, trading for $0.194 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Yurchanka Siarhei"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPM25TX1Uwd1dzOWJBWFQweldXNnZKSnhzd09IeFBEMk90cUw1RTl2dHlzbmVDcWE1ekQ5bVlYRlZNbnp6SGhtUDBuYnBVN010QUdSTDZmQTc0T1IzalNIRVEwczBVcGpDWU1lakVqQmZFcWZfWlI4QTB3M3I3ejljcEpPdk5obllzQ0pMUDU1eWNOU25tRVFVb3hIdzE4Qi1STFBJTmVpYkN2aWvSAbABQVVfeXFMUHV5SWhQbU93N1U1ZFZVUXY2NE1vWTFGUHlmbm9fLWR2a0cxOTJ6TWQ5MlhmMFVrVGtsS0RnNXJQaHhPaE51UUk0QmZ2WFBaM2FkS1hZTUwxbmkzVVpSSm5jc0JiWU01dnFPX2VjY0N0ZVRfV1ZCSnBjUDFvM1NoQV9SMkhEOUY2NktSNnBfb0pIbWlOaWx6dVBCdU9OMnVHZGhZTm9ERkJoZG9BeUFVYVM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Is $3.7K Realistic for ETH or is a Correction to $3K Coming? - CryptoPotato",
        "content": "Following a revival in buying interest and demand, Ethereum’s price has surged, reclaiming the 100 and 200-day moving averages.\n\nThis price action suggests a shift towards a potential rally, with buyers targeting a new yearly high in the mid-term.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA detailed analysis of Ethereum’s daily chart reveals that after a notable increase in buying pressure near the substantial $3K support region, the cryptocurrency initiated a bullish spike, surpassing the 100-day ($3340) and 200-day ($3152) moving averages.\n\nAdditionally, ETH has reclaimed the significant resistance region of $3.5K, a crucial barrier for buyers in recent months. This price action indicates a strong buyer presence in the market, aiming for a new yearly high.\n\nHowever, Ethereum has formed a sideways wedge pattern over the recent months. It is expected to continue its upswing after a short-term period of market consolidation, aiming to breach the wedge’s upper boundary at $3.7K. Successfully surpassing this level could lead to a new yearly high above $4K.\n\nThe 4-Hour Chart\n\nOn the 4-hour chart, an increase in bullish momentum led to an impulsive surge, breaking the multi-month descending trendline.\n\nThis impulsive move also saw the price reclaim the significant $3.3K resistance region, previously filled with supply. This development reflects strong buyer interest in the market, aiming for higher levels in the long run.\n\nHowever, Ethereum reached its prior major swing high in the 4-hour timeframe, resulting in sideways consolidation.\n\nThis swing serves as a robust resistance level, and breaking above it could pave the way for another impulsive surge toward the key $3.7K resistance zone. The ongoing consolidation phase is a positive sign for the market, confirming the recent breakout above the trendline and completing a pullback to it. If the price surpasses its prior central pivot of $3524, the continuation of the bullish movement will become imminent.\n\nSentiment Analysis\n\nBy Shayan\n\nWhile Ethereum’s price has experienced a bullish reversal, a closer examination is essential to determine if the bullish trend will persist. The chart highlights the Taker Buy/Sell Ratio, a crucial metric for evaluating futures market sentiment. Values above 1 indicate aggressive buying by bulls, while values below 1 suggest bearish selling pressure.\n\nAs depicted in the chart, the Taker Buy/Sell Ratio surged above 1, simultaneously with the bullish revival in Ethereum’s price. This surge indicates strong buying interest in the perpetual market, suggesting a notable bullish sentiment. If this upward trend in the Taker Buy/Sell Ratio continues, it confirms a potential mid-term bullish trend in the market, with the price likely rallying toward higher values."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPeHJDZUdpeWVCcmJLdE90NzF3alpKVkJPeFpOd3M5SFFicFJZcHEwWmdHRmFXY2xoVW9GdlV2emxIQzlIRnJHdVQ0bjZCaEVJN1ZhOHZYT0RURndPeWNZRmdZUG1IS3pnQnh0aWJ4andGY05pMzVPZnFiMnI3cmxHRmYzVHBMNUVBSU9wcGtLN2VEVkVTRmpVdExJLVN3dGZj0gGmAUFVX3lxTE84SHFaSmFGWG5sblpmMUN2eV9rdWVZUVZrNElVOWE4UnlSU0xlLTNCX2lOMFY4WXczSnFvb05ZcGVkeXN0SFNOOWVUanpxekhYbzZmXzNIRXdsdDdMSThCQ2RnMzhiZldteHg5NHhjX2VvRXZXdlJhaGF2X01QVURBcnZHQS1lU283aERxUkxiaUN5dXRBWmxtVFhzZk9NSFBJbkVBNnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF Race Intensifies as Issuers Prepare for Imminent Launch - CryptoPotato",
        "content": "ETF issuers are making their final preparations to launch spot Ethereum-based products in the United States next week.\n\nOn July 18, ETF Store president Nate Geraci noted that the final S-1s were in from prospective spot ETH ETF issuers. The Form S-1 is the initial registration form for new securities required by the SEC for public companies.\n\nTwo months ago, “just about everyone thought these had no chance of approval,” he added before predicting that the launch date could be Tuesday, July 23.\n\nLooks like *Final* S-1s now IN from prospective spot eth ETF issuers… 2mos ago, just about everyone thought these had no chance of approval. Next step = launch (sounds like Tues)! — Nate Geraci (@NateGeraci) July 17, 2024\n\nETH ETFs Gearing Up\n\nOn July 18, Bloomberg ETF analyst James Seffart summarized the offerings from the nine spot Ethereum ETFs that are expected to launch for trading next week. The interesting thing to observe is the fee structure, with the heavyweights BlackRock and Fidelity charging just 0.25% in fees for their yet-to-launch funds.\n\nAs an initial sweetener, BlackRock is issuing a reduction for the first 12 months or $2.5 billion gathered in assets for its iShares Ethereum Trust (ETHA). Fidelity stated it would waive fees for its FETH fund until the end of the year. Ark 21Shares and Bitwise are asking for 0.21% and 0.2%, respectively.\n\n“Seven of the 10 ETFs launching are coming out with fee waivers, some waiving the fee completely anywhere from six months to 10 months,” said Seyffart, who added: “This just shows how competitive these issuers expect things to be — and it’s going to be a battle to raise assets.”\n\nOkay everyone. Here are the details for the #Ethereum ETFs that we expect to launch next week. We are only missing details for Proshares’s ETF. 7 of the 10 funds have fee waivers. pic.twitter.com/5v3QnHOeub — James Seyffart (@JSeyff) July 17, 2024\n\nThere has been some concern over what will happen to Grayscale’s Ethereum Trust given the massive exodus from its Bitcoin fund, which lost more than 50% of assets under management since it converted to a spot ETF.\n\nGrayscale will also charge a 0.25% fee for its mini ETH fund, according to recent filings. The firm has stated that 10% of its spot Ethereum ETF will establish its Ethereum Mini Trust, providing $1 billion in seed funding.\n\nHodl Capital estimated that a similar exodus from Grayscale’s ETHE fund could be as much as $10 billion in AUM.\n\nWill Grayscale replicate the $GBTC fee mistake with $ETHE? If so, expect 50%-60% outflows 👇 Just over $10 Billion AUM https://t.co/EB8IXDGPg4 pic.twitter.com/TFSzbnRvpZ — HODL15Capital 🇺🇸 (@HODL15Capital) July 17, 2024\n\nEthereum Price Outlook\n\nEthereum prices are holding up following an increase of more than 10% over the past seven days. The asset was trading just over $3,400 at the time of writing, having fallen from a 17-day high of $3,500 yesterday.\n\nThere may be a little pump if and when ETFs go live, but it is likely that prices have already been factored in."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE1ONS1kMFM0dUtRTkhkRC1YeDhYWHpTWnlDT3MtQ1pwRWJkaEd0b2RiTFZRM05GcDZ5dG1rUkZ1RTFGNTRRclc1MTdack9DWUZzOUdIcUt4Zm5QTVF1SkdrQ2VfUTJPZjdqMVBteDF0VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "How Will Ethereum Evolve In 2025? - Jumpstart Media",
        "content": "Ethereum is a leading cryptocurrency prized for its versatility and innovation, though traders should be mindful of potential price volatility.\n\nThe cryptocurrency world, although a relatively new player in the realm of trading and investment, has nonetheless made a significant impact with its unique features. Operating on decentralized networks called blockchains, cryptocurrencies have introduced a new way of thinking about technology. While the practical applications of this system might not always seem as immediately obvious as the buzzworthy technologies like artificial intelligence (AI) and the metaverse, blockchain is nonetheless a core component of a significant tech revolution—one that is reshaping the economy and tech sector entirely.\n\nDespite its origins in the crypto space, blockchain technology is expected to evolve beyond its current scope, promising to revolutionize payment systems and financial infrastructures. An ideal future might see a hybrid model that integrates traditional financial mechanisms with blockchain’s novel features to enhance transactional efficiency and security.\n\nBlockchain facilitates direct asset transfers without the need for third-party oversight, but its decentralized nature also introduces volatility and price fluctuations. These aspects have deterred some potential traders and led others to minimize their transactions to avoid significant losses. For blockchain to be viable for daily transactions, it must advance to be both safer and compliant with established market standards.\n\nBeyond the financial industry, researchers believe blockchain can also be transformative for other industries by enhancing market efficiency and transparency. It simplifies global supply chains by reducing errors, improves tracking, ensures secure record-keeping and even enables personalized loyalty programs, to name a few. While challenges such as scalability and interoperability remain, ongoing advancements are expected to address these hurdles.\n\nIn the context of cryptocurrencies, one of their major draws is their independence from any central authority. This autonomy is particularly appealing to investors who value anonymity and security, as no institution or individual can seize their digital assets on the blockchain—except in criminal cases, of course. This feature is crucial in regions plagued by significant inflation, currency devaluation or authoritarian regimes.\n\nAdmittedly, the prices of cryptocurrencies are inherently volatile and unpredictable due to their decentralized nature. Therefore, investors must be well-prepared and adopt sophisticated strategies to grow their portfolios. For those invested in Ethereum (ETH), understanding the Ethereum price prediction for 2025 is vital for crafting a long-term investment plan that aims to maximize gains and minimize losses.\n\nEthereum’s role and innovations\n\nEthereum is the second-largest cryptocurrency in the world, trailing only behind Bitcoin. Unlike Bitcoin, ETH is not just used for trading. Ethereum is celebrated for its innovation and ingenuity, even outside of the crypto community. The Ethereum network has facilitated the rise of non-fungible tokens (NFTs) and the concepts of decentralized finance (DeFi) and decentralized applications (DApps).\n\nOperating as an open-source network, Ethereum incorporates smart contract functionality that is pivotal for DeFi. It is continuously upgraded and maintained by teams of validators, who are compensated with Ethereum tokens for their efforts. Without their assistance, transactions wouldn’t move on the system. These tokens, often referred to as gas fees, incentivize the community to keep the network secure and efficient. Unfortunately, the rising popularity of cryptocurrencies has led to increased demand and higher gas fees, which can make Ethereum less accessible to some investors.\n\nDespite high gas fees, many believe that Ethereum’s robust and secure system justifies the cost. The platform’s high security and continuous upgrades make it one of the most reliable blockchain systems worldwide.\n\nMarket trends and price action\n\n2022 has been a difficult year for Ethereum as it navigated through a bear market and the subsequent crypto winter. In 2023, much effort went towards consolidation, as there’s no way to build and achieve growth without having a firm foundation first. Nonetheless, the prices ultimately remained relatively low.\n\nHowever, by the beginning of 2024, Ethereum’s value started to climb as a result of the approval of Bitcoin exchange-traded funds (ETFs). This had long been anticipated by market participants for around a decade and was expected to have far-reaching effects on the market.\n\nThis approval helped Bitcoin reach new all-time highs, while altcoins like Ethereum managed to break through some key resistance levels. As of June 26, Ethereum has stabilized at the US$3,400 mark, with projections estimating continued growth throughout the rest of the year. The general consensus among experts is that Ethereum could get to US$20,500 by the end of the decade. This ambitious goal reflects confidence in Ethereum’s unique model and scalability solutions that continue to attract investors.\n\nLooking ahead to 2025\n\nFor cryptocurrency investors, both the short-term and long-term outlooks are crucial. Common forecasts suggest that Ethereum will hit US$5,000 by December of this year before climbing even higher in 2025. The much anticipated official approval of Ethereum-backed ETFs is expected to significantly influence this growth, though investors should stay alert to potential market corrections.\n\nBy 2025, ETH might reach a new peak at US$6,500, with its price likely oscillating between US$4,500 and US$5,500 on average. These fluctuations present opportunities to buy more and strategically expand your asset portfolio. Generally speaking, while the market’s direction in 2025 remains uncertain, an upswing could significantly enhance Ethereum’s price potential, whereas a bearish trend could lead to modest pullbacks.\n\nIn the ever-evolving world of cryptocurrency, staying informed and adaptable is key to achieving a positive outcome.\n\nAlso read:\n\nHeader Image from Unsplash"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1ZX3lEMVYzZjRGTUVFU1lXV05LYjg0WWtfRE82bzVTZmZENTRQdkttWGR1UFUzZ0lhYVVDME5IeGk3YjR3SnVwVGtBYllqR3ZYRVNrS29nRVQxMDRUVVNJVjVXWXU5Q09YeVhLQmZCQWFnTGdDNE9J0gF8QVVfeXFMTjJEU2UxS1o5anY4cWEzUERBbGZKcDAzZ21fUXBtdWhpYU40eVNkS1lOa1dyWF9Cd1pIdXF3SWVsandNZ29ya3V1WEpYbl95UmV4dUExUWNaaDRJNk9tM0ZzUklDSTRIUEtKdzFUSHJiY0RiZHRVOHZhVXZjSA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Will Ethereum upstage Bitcoin post ETF launch? - AMBCrypto News",
        "content": "Market trends favor Ethereum as ETF launch nears.\n\nThe report showed a changing landscape in spot trading volume, options, Futures, and perpetual contracts.\n\nCryptocurrency markets have experienced high volatility over the last two months. Market preferences are shifting, especially since the SEC approved Ethereum [ETH] spot ETFs in May.\n\nWith the anticipated launch of ETH spot ETFs, investors are getting increasingly optimistic.\n\nAlthough ETH ETFs have yet to start trading, a report by Kaiko and a joint report from Block Scholes and Bybit showed changing market preferences.\n\nA change in trends\n\nAccording to the recently released report by Block Scholes and Bybit, there has been a massive landscape shift in spot trading volumes, futures, options, and perpetual contracts.\n\nThe report posited that Ethereum enjoyed a better volatility premium over Bitcoin [BTC]. This mainly arose from increased address activity and a positive market sentiment shift towards ETH.\n\nEthereum gains ground over Bitcoin\n\nThe ETH to BTC ratio has sustained a positive value of 0.05 since the approval of spot ETFs. This ratio is considerably higher than pre-approval levels of around 0.045.\n\nThe higher ratio shows that when the ETH spot ETFs start to trade, it will continue to outperform BTC.\n\nOverall market sentiment\n\nETH has gained more than BTC in multiple areas since the approval of ETH spot ETFs in May.\n\nAlthough the crypto market has experienced high volatility over the past two months, ETH Futures have shown more resilience and quicker recovery than Bitcoin’s Open Interest.\n\nETH’s faster recovery for its future suggested a rising positive sentiment, with many investors confident in its future.\n\nETH’s trading volume has been sustained within the same range since May. According to Kaiko, ETH’s liquidity has been sustained with 1% depth and a consistent range of $250M.\n\nThe ETF approval seems to have changed the trend after dipping below $200M and reversed the trend after SEC’s approval. Therefore, the ETF anticipation has played a critical role in improving liquidity.\n\nAdditionally, ETH perpetual contracts have experienced increased trading volume. The increase showed that investors were willing to pay a premium to hold long positions, which showed confidence in crypto’s future potential.\n\nAs reported by Kaiko, Implied Volatility surged over the past seven days. For instance, ETH options set to expire this Friday surged from 53% on the 13th of July to 62% at press time.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe surge in these contracts implied that investors were paying short positions to protect themselves against price hikes in the short run.\n\nThis market sentiment shows considerable optimism over ETH’s future, especially with upcoming ETFs this week."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNb2RDRk1YS1I5RjZUNTNZY18tbi14dzJsTXJ1UnVWMHoxakt2dDRzZWZSMXJhOWZDclRUcWZWRUNWQUsxRDZzNmg5MGtYeWh4UTRZOVhfTF9qRGRxMHkteHJCMWlWdTFuejItRTdMNDl4SjZKT1VldndLbFZMWWpqZFJQaXBQb0pjQldRZnFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Ethereum: Will ETH ETF Have a Bigger Impact Than Bitcoin Did? - Watcher Guru",
        "content": "With the Ethereum ETF set to debut next week, the market is waiting to see how its impact compares to that of Bitcoin. Indeed, BTC became the first crypto to get spot ETF approval in the United States, breaking the US Securities and Exchange Commission’s (SEC) rejection streak in January.\n\nThere is no denying the impact that Bitcoin had on the market after its debut. Just three months after launch, the leading crypto surged to a $73,000 price, setting a new all-time high mark. Yet, one expert predicts that the upcoming crypto ETF could actually be more impressive.\n\nSource: Watcher.Guru\n\nAlso Read: Ethereum ETFs Expected to Officially Launch July 23\n\nEthereum ETF to Have a Bigger Impact Than BTC?\n\nEarlier this month, Kraken’s head of strategy, Thomas Perfumo, told Bloomberg that Ethereum’s ETF was a “rising tide lifts all boats,” situation. He reinforces the importance of the arrival, and what it means for crypto. Now many have wondered if the Ethereum ETF could actually have a bigger impact than its Bitcoin counterpart.\n\nOne such person who believes in its potential is Bitwise chief investment officer Matt Hougan. In a recent report, the executive highlighted what the crypto market could expect from the product. Moreover, he discussed how it could be the biggest crypto-based ETF yet.\n\n“The first few weeks could be choppy, as money may flow out of $11 billion Grayscale Ethereum Trust (ETHE) after it converts to an ETP,” Hougan said. “By year-end, I’m confident the new highs will be in,” he added.\n\nAlso Read: Bitwise Says SEC is Open to Solana ETF After Ethereum Launch\n\nAfter discussing the impact that Bitcoin had on the market, Hougan asked if ETh could “see the same sort of impact,” when it arrives. He answered, saying he thinks, “It might be bigger.”\n\n“I think the new Ethereum ETPs will attract billions. And I think the money flowing into these new ETPs will have a bigger impact than it did with Bitcoin,” he stated. Hougan notes that lower short-term inflation rates and ETH staking play a role. It will be interesting to observe, as crypto could be heading toward a monumental bull rally."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5fY1hvR0dpVmVyZW12NHNLcjBrRGdkdlFxSnBDSDJmSEh2ZnJLN2RIaXE4RlFHYVpDNEY5Q2VHTzBMU1lYb1ZEaDNhaGxKMVBjc1BxcFUwRXZlS2hOYlN5WXhrbDlFRWlPb0QxTml0YWJFV2Nfdy1qSDlUamxlRTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Shiba Inu and Ethereum: Price Prediction Analysis - Watcher Guru",
        "content": "Shiba Inu and Ethereum have become some of the most important players in the cryptocurrency market. We’re not surprised about this fact.\n\nThis analysis examines their current positions, recent performance, and future price predictions to understand how they will evolve.\n\nAlso Read: Shiba Inu or Pepe Coin: Which Cryptocurrency Can Reach $0.01 First?\n\nUnderstanding Crypto Market Trends Through Shiba Inu and Ethereum\n\nCurrent Market Positions\n\nOn July 17th of this year, Shiba Inu (SHIB) traded at $0.00001930, with a market capitalization of $9,477,145,257. Amazing, right? Ethereum (ETH), on the other hand, is priced at $3,489.79.\n\nRecent Performance\n\nShiba Inu has experienced some unexpected price changes over the past year. The chart shows a spike in early 2024, which was then followed by a correction. Despite this volatility, SHIB has kept a relatively stable price recently.\n\nThe Ethereum Price chart shown above shows a more consistent growth over the same period. The cryptocurrency has shown an upward trend since early 2024, with some occasional fluctuations.\n\nAlso Read: Ethereum ETFs Expected to Officially Launch July 23\n\nTechnical Analysis\n\nShiba Inu’s indicators show the 50-day SMA is at $0.00001999, while the 200-day SMA is a bit lower, at $0.00001962. This close value suggests that its price is hovering around moving averages. Furthermore, the 14-day RSI is at 56.63.\n\nEthereum’s indicators show a more bullish trend: The 50-day SMA stands at $3,447.97, and the 200-day SMA is lower at $3,105.22. This difference suggests that its price is trending above the long-term moving average.\n\nPrice Predictions\n\nShiba Inu Price Predictions\n\n5-Day: $0.00004291\n\n1-Month: $0.00001867\n\n3-Month: $0.00001703\n\n6-Month: $0.00001731\n\n1-Year: $0.00003633\n\n2025: $0.00002083\n\nThe price predictions for Shiba Inu show a mixed outlook. In the short term, a significant spike is expected during the next 5 days. This might be caused by market speculation of upcoming events.\n\nUnfortunately, this surge is most likely going to be short-lived, with decreases forecasted for the one-month, three-month, and six-month periods.\n\nThe long-term outlook looks more positive, with a large increase predicted for the 1-year mark.\n\nEthereum price predictions\n\n5-Day: $3,590.26\n\n1-Month: $3,613.70\n\n3-Month: $4,590.75\n\n6-Month: $5,743.92\n\n1-Year: $6,370.35\n\n2025: $5,580.19\n\nEthereum’s price predictions are more bullish than SHIB, and that is obvious at this stage. The forecast suggests steady growth across all time frames, with an important boost in the three-month and six-month periods. That’s very interesting.\n\nThis positive outlook is due to Ethereum’s strong fundamentals and the development of network upgrades.\n\nThe 1-year prediction also shows that it might continue to grow. Even if the 2025 prediction is lower than the 1-year forecast, it still represents a large increase from the current price.\n\nThe price predictions for Shiba Inu and Ethereum show different paths. Even though Ethereum has a constant positive outlook, Shiba Inu is more volatile and has short- and long-term growth potential."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxPSDRvdnRycGs0UmQtNVV4ZHFYWGpwaVdvd2RyUG82bXd6RDhEblkzLWJScjduc2kwU1diRWZiWnFqaU5TYWF5ZEh2c0pkWGhnOHlkd0NmT1pOUWpubmlacHgzTXM0Vy1HTjBPZEdLejZBSnU5R2d2Q1hMTG9wTVFsbU9iSHVhWk5pSUdJNVBROVdxbkowU2lxdUFKMkhMcGxwRDYyVi1yeDZRWXNXYVFfOE4teG5pUU40UHlvY29GM1doLURlSWhJTk5nR1JDNm1GanJSNU9vQnZmdXprdU9UTmhOSnoxRS14OUFVdtIB8gFBVV95cUxNWjZwN0lYa1dvZlM4V3diS3hua2JmMHktYnlqbXloYi1xOVRlM25vbE9pY3RnSjRzampfa2tmNGhRZ2tMMWVSVFJxZ1FtdEF6bHNoczZkcFUwTUdxaElIcFNVZzRPM0pnWTBIbHFFMmtjcHR5QjNWbU9PU1dUOTd1MUtkb0V1WlBadXk5blNsanpHUE9HajFoblVkRWRMM0k1MHU2ZjBOVGVUNFVoVGI3YVMtV3pNQkZRbEdKMTkxNDA4VlF5UXVWRGNnUHNvY3U0LXNFU0NWODE3aFc2Ykhvc2U5OThFTHFCOTVLMzVSeF9hdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin jumps 3% to hit $65,000 level; Ethereum, Altcoin XRP surge 11%; here's what analysts say | Stock Market News - Mint",
        "content": "Bitcoin prices (BTC) surged over 3 per cent on Wednesday, reaching $65,758 at 12pm (India). BTC has experienced high traction among investors due to increased inflows and positive sentiments following an assassination attempt on US presidential candidate Donald Trump, which has significantly increased the odds of the former president winning the upcoming election.\n\nMajor altcoins have also benefited from BTC's rise. Ethereum (ETH), BNB, Tether, XRP (11%), Dogecoin, Cardano, Tron, Avalanche, and Shiba Inu have seen gains of up to 11% during this period. Conversely, Toncoin was among the losers, declining by over 1%.\n\n“Bitcoin has stayed strong despite the large sell off by German government. Mt. Gox settlements have started flowing to customers. This will not be a mass sell off like the German government exercise but people are still being cautious. These have been multi billion dollar sell events and yet, Bitcoin continues to hold strong. It’s good to see such liquidity in BTC, it has helped build more confidence amongst the market participants. We’re in the maturing market phase for Bitcoin. It is going through a cycle where we get to see how it reacts to large sell off events. It has proven to do well until now!,” said Nischal Shetty, CoFounder, Shardeum.\n\nOn Monday, lifetime net inflows into these ETFs exceeded $16 billion, with market bulls now aiming for the $71,500 level. Despite Mt. Gox's decision to move 91,755 BTC valued at $5.8 billion, BTC remained stable above the $65K mark, unaffected by the development.\n\nAccording to CoinSwitch Markets Desk, spot Bitcoin ETFs have attracted over $16 billion in inflows since their launch in January, with $300 million added earlier this week alone. The funds, primarily BlackRock's iShares Bitcoin Trust and Fidelity's Wise Origin Bitcoin Fund, have seen consistent inflows despite fluctuations in Bitcoin prices, highlighting strong investor demand for regulated Bitcoin exposure.\n\nThe top mover of the day remained worldcoin’s WLD (+20%), the Sam Altman related token’s long bearish run ended."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPNldXVDVGTjloOVNyZ0ZITjd1dFlrWUpjUVhrdllLenB4WHRpLUlFWktKTnRVV2NKYXRTMDQ2blF5XzdCQm81Q0ZJcW9rTmNrWmJTM1ctRlRCSVF5SmFVRS03NTBwMkxyY3ZBTV82TUdvTWd5V0llT24zdUpfSVlaTURzRTA4ZW5ZU3NWTkcxdU53QVhjTTFXc1kxMGJja3REYUJLUE03WmZvU2t6V3BTaWdEdG5JQTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Launch of Ethereum ETFs Announced, Crypto Rebounds Over 20%! Analysis from July 17, 2024 - Cointribune EN",
        "content": "Wed 17 Jul 2024 ▪ 6 min read ▪ by Family Trading ▪\n\nAfter reaching the lower part of its range, Ethereum rebounded by nearly 22%. Let’s examine together the future outlook for ETH.\n\nSituation of Ethereum (ETH) Price\n\nAfter reaching the lower part of its range around $2,900, a zone mentioned in the bearish hypothesis of the analysis of June 26, Ethereum attracted buying interest allowing it to rebound by more than 22%. In less than two weeks, the crypto price regained $3,500. It seems that this increase was accelerated by the announcement of the launch of Ethereum spot ETFs. Now, ETH has stabilized around its resistance. The most significant value zones are located on both sides of the crypto: below the current price, one can note $3,065. Above, one can identify the $3,800 zone.\n\nA value zone is a price range rich in volumes that can act as a key level for investors.\n\nAt the time of writing this text, the price of Ethereum is trading just below $3,500. The latest fluctuations of ETH show a short-term bearish trend on the verge of being reversed, which could thus signal a continuation of the medium and long-term bullish trend of the crypto. These statements can be supported by the fact that Ethereum has managed to reposition itself above the 200-day moving average. Unsurprisingly, the dynamics of Ethereum have resumed with more fervor, as evidenced by its price and oscillators. All these elements undeniably demonstrate a resurgence of buying interest in Ethereum.\n\n\n\nETH/USD Chart (1D)\n\nThe current technical analysis was carried out in collaboration with Elie FT, an investor and passionate trader in the cryptocurrency market, now an instructor at Family Trading, a community of thousands of proprietary traders active since 2017. There, you will find Lives, educational content, and mutual support around financial markets in a professional and friendly atmosphere.\n\nFocus on Derivatives (ETHUSDT)\n\nThe open interest in perpetual contracts on Ethereum seems to have followed the trajectory of its underlying asset’s price. This indicates an increase in speculative activity on ETH. Considering Ethereum’s recent rise, the predominantly seller liquidations, as well as a positive funding rate, the optimism surrounding Ethereum is evident. One can naturally conclude that this interest in ETH/USDT contracts is mostly buying-oriented, thus reinforcing the conviction of continuing the bullish momentum of the cryptocurrency.\n\nOpen Interest / Liquidations & Funding rate ETH/USDT\n\nThe liquidation heatmap of ETH/USDT over three months reveals that the previously identified liquidation zone at $2,850 has been reached and likely sparked buying interest. Now, the most prominent liquidation zones are mainly above the current price of Ethereum. Notable are the zones between $3,500 and $3,600, and just above, between $3,650 and $3,750. Higher, the most significant zone is at $3,900. Below the current price, $3,000 can still be noted. Approaching these levels could trigger massive orders, increasing the risk of a period of heightened volatility for Ethereum. These zones, therefore, represent crucial points of interest for investors.\n\nETH/USDT Liquidation Heatmap (3 months)\n\nHypotheses for Ethereum (ETH) Price\n\nIf the price of Ethereum stays above $3,065, one could anticipate a continuation of the bullish trend leading to a break above $3,500. The next resistance to consider would then be around $3,700 or even $3,800. If the bullish movement continues, it could reach $4,000 or even $4,100. At this point, this would represent an increase of more than 18%.\n\nIf the price of Ethereum fails to stay above $3,065, one could foresee a return around $2,900. The next support to take into account, if the bearish movement continues, would be around $2,800. Lower, the support at $2,720 can be noted. At this point, this would represent a decrease of about 21%.\n\nConclusion\n\nAfter reintegrating the lower part of its range, Ethereum demonstrated a significant rebound. The crypto’s buying interest thus seems to have strengthened, supported by recent announcements and a medium to long-term bullish trend that seems to be continuing. Therefore, optimism seems to dominate regarding the cryptocurrency’s future. However, it will be crucial to closely observe the price reaction to various key levels to confirm or refute current hypotheses. It is also important to remain vigilant against potential “fake outs” and market “squeezes” in each scenario. Lastly, let us remember that these analyses are based solely on technical criteria and that cryptocurrency prices can also change rapidly based on more fundamental factors.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQOGJ2STFpNUpHa1NDa01YTDNseVhyTFVKZUhSV0ljNWxHb3lGTnd2ZnVmVXVOZVhkdmFvVl84Y1l1MjduQVM4NjBCTHJUTEJBREtFSVBHRXhEc1BuSjBQOXg3VUNHSGNHSW1QbmVEYTVhRnJDdmZxX01JR3YxblFCTG42VUtGUTJNQVJNMy1hQmFNUXNJd21hUGU0eVZ1MlhZQWNvTUFkc2NSLVJBdXVFMkZsVFFIWmlucjliemFPemc4dzdWbFN2UFZnWl9uNmd4WXY4dVV1TlEyUW0zRHRGZ3pNN0NoUEUt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Analysts Question Strategy Behind High Fees Of Grayscale Ethereum Spot ETF: They Seem Focused On 'Maximizing Short-Term Revenue Vs Playing Long Game' - Benzinga",
        "content": "Eric Balchunas, a renowned financial analyst, recently expressed skepticism about the potential success of Grayscale’s Ethereum ETH/USD spot ETF due to its high fee structure.\n\nWhat Happened: Grayscale submitted updated S-1 filings with the SEC Wednesday, revealing the all-important information about the fund management fee. The digital asset management giant will charge 2.5% for its Grayscale Ethereum Trust, significantly higher than its competitors. A miniature version of the fund, Grayscale Ethereum Mini Trust, will however charge 0.25%.\n\nBalchunas questioned these moves, asking whether the 0.25% fee would be low enough to attract sufficient organic flows to offset what he referred to as “The Big Unlock”.\n\nHe further speculated on the ability of new entrants to the market to counterbalance the predicted outflows due to the flagship version’s high fees, drawing a parallel with Bitcoin BTC/USD. “Anyway short story is the 2.5% fee made path to a decent net flow number a little harder,” Balchunas feared.\n\nCheap but not sure cheap enough to move the needle (as most are cheaper and brand name BlackRock is same fee) to attract organic flows to offset The Big Unlock. And do these newborns have enough strength to offset those outflows a la btc. Anyway short story is the 2.5% fee made… https://t.co/0sH0tXrjtL — Eric Balchunas (@EricBalchunas) July 17, 2024\n\nAnother well-known ETF expert, Nate Geraci, called this a “huge miss” by Grayscale, indicating that the mini trust should have been priced much lower. “Entire pricing strategy around both spot BTC & ETH ETFs seems focused on maximizing short-term revenue vs playing long game,” Geraci stated.\n\nBtw, think this is *huge* miss by Grayscale…\n\n\n\nIf you're gonna charge *2.5%* on ETHE, need to undercut market w/ mini trust.\n\n\n\nDisappointing.\n\n\n\nEntire pricing strategy around both spot btc & eth ETFs seems focused on maximizing short-term revenue vs playing long game. https://t.co/8DE1UIlCIo — Nate Geraci (@NateGeraci) July 17, 2024\n\nSee Also: Mark Cuban: Trump’s Re-Election Won’t Directly Impact Bitcoin’s Price\n\nWhy It Matters: These criticisms come even as other funds, including the one by BlackRock, are priced much lower. The ishares Ethereum Trust will charge 0.25%, and so will the ETFs by Fidelity and Invesco.\n\nGrayscale, which already operates the Grayscale Bitcoin Trust GBTC, faced significant outflows pressure after launch due to its 1.5% fees, highest among all spot Bitcoin ETFs. Since launch, it has recorded net outflows of $18.69 billion as of this writing, according to SoSo Value.\n\nGrayscale’s flagship Ethereum Trust, along with the mini Trust, are expected to go live for trading by July 23.\n\nPrice Action: At the time of writing, Ethereum was exchanging hands at $3,423.79, down 1.55% in the last 24 hours, according to data from Benzinga Pro.\n\nIllustration via Shutterstock.\n\nRead Next:"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxNT3Q3Tzl6TnB5c3RLeUIwQkpoWG1VQ1FGRmYyczVLbDg4Q0FSNmhVbVhUZ0t1SmdyWC1WaVZtV3MzV0dnVzI1bE8tb2NWcEd5dC1HM1piT2hhSXFEMHdPVnF0bGdRMXRwM3RwelZKb3doVkNWN1g5aFl5dUYtZFNFX0hTTGhvb1MyaEYxcWx6U3VVU3BpeVUtN0N5T3NzQkNqdGNJWXNKcDJoVmtjdEFRWWhFQXRpNV9TWTZXZGdqRmVJdktRMW4zTHFvYjk1TTlqVm1WWHBZREJPU0RHWFFZdkpNS041QUXSAewBQVVfeXFMUHJ0XzRNVEdDMW9ObGU4VTJ5VjIwUDJfNTJzbllCUUU5cTFCRFB5Y2lQN2RVQUhMd20tNUpxYXJzcWtmY29UZVJNWXRPcGJFcGxWcnZKeHlZYjNoZDJCSl9YOHlQeHY0VnlNdHladG1HTmYtcVZQYkt4SEJFTmRjSzFzWEllUy1kaW9NRGZ3TVN1R28xTmJKM2lQWHVlZUR2TDEtNzA4X05zZXprMG5LaXRFUkh1Tm00RkMyT3JlTU5sWmdYOW5TTkZzSEVQdFVHYjRvTnFQNGV1aGdIT3J6LXlTMU80dVViWWNjS0o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin breaks above the descending trendline - FXStreet",
        "content": "Bitcoin price breaks above the descending trendline on Sunday, signaling a potential bullish momentum in the near future.\n\nEthereum's price surges above the $3,240 level, marking a shift in market structure from bearish to bullish.\n\nRipple's price breaches the daily resistance level at 0.499 on Saturday, signaling a potential bullish trend on the horizon.\n\nBitcoin (BTC) broke above its descending trendline on Sunday, signaling potential bullish momentum in the near term. Concurrently, Ethereum (ETH) and Ripple (XRP) also surged, surpassing significant resistance levels and setting the stage for a bullish trajectory across the cryptocurrency market.\n\nBitcoin price sets for a rally\n\nBitcoin price broke above the descending trendline on Sunday, trading 1% up at $61,365 on Monday. The trendline is formed by connecting multiple swing high levels from early June to mid-July.\n\nIf the trendline holds as pullback support around the $58,357 level, which coincides with the weekly support level, BTC could rally 9% from that level, targeting its daily resistance level of $63,956.\n\nThe Relative Strength Index (RSI) on the daily chart is trading above the neutral level of 50, and the Awesome Oscillator (AO) is on its way to doing the same. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective mean levels. Such a development would add a tailwind to the recovery rally.\n\nBTC/USDT daily chart\n\nConversely, if BTC closes below $56,405 and forms a lower low in the daily timeframe, it may signal persistent bearish sentiment. This scenario could trigger a 7.5% decline in Bitcoin’s price, targeting a revisit of its daily support at $52,266.\n\nEthereum price shows potential for further rally\n\nEthereum price broke above the $3,240 level on Sunday and, at the time of writing trades 0.87% up at $3,275 on Monday.\n\nIf the $3,240 level holds as support, ETH could increase 8.8%, targeting a retest of its daily high from July 1 at $3,524.\n\nThe Relative Strength Index (RSI) on the daily chart is trading above the neutral level of 50, and the Awesome Oscillator (AO) is on its way to doing the same. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective mean levels. Such a development would add a tailwind to the recovery rally.\n\nIf the bulls are aggressive and the overall crypto market outlook is positive, and ETH closes above $3,524, it could extend an additional rise of 5.5% to retest its daily high of $3,717 from June 9.\n\nETH/USDT daily chart\n\nOn the other hand, if Ethereum's daily candlestick closes below $2,817, forming a lower low in the daily timeframe, it may signal persistent bearish sentiment. This scenario could trigger a 7% decline in Ethereum's price, targeting a revisit of its daily support at $2,621.\n\nRipple price shows potenti for the bulls\n\nRipple price broke above the daily resistance level of $0.499 on Saturday. Currently, it faces resistance around the $0.532 daily high level from June 5. At the time of writing, it trades 1.7% up at the $0.528 level.\n\nIf XRP closes above $0.532, it could rally 7.76% to retest its daily resistance level of $0.574.\n\nOn the daily chart, the Relative Strength Index (RSI) and the Awesome Oscillator (AO) are currently positioned above their critical thresholds of 50 and zero, respectively. These momentum indicators strongly indicate bullish dominance.\n\nFurthermore, surpassing the $0.574 level could pave the way for an additional 12% rally to retest the next daily high, recorded on April 9, at $0.643.\n\nXRP/USDT daily chart\n\nHowever, if Ripple daily candlestick closes below $0.413, it indicates sustained bearish sentiment, forming a lower low in the daily timeframe. Such a scenario could lead to a 16% decline in Ripple's price, targeting a revisit of its low from March 12 at $0.347."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNY3hBQjhLNjZLZjlFVFhxSjFhZHJnYlp5U2paYy1DR2VWcWs1YXllRS1kQk5HcGJXNXFvc185OGxOTlpkZ1Q1TzRsM3dVSGpNYnNsOG5fY0FMQXFDU08zZDQ4WU9XaEw5MjBpNWllYnk3RWt2YzBvZ1pjaDAxMDVmV21sUkxvME3SAYwBQVVfeXFMUGJqZG1HVDU3Ylk4bk5md1ZtT0YwWmJCNzdFTTloMFpPVjhUWXNuUGZjN0pMOXQyNHY3UWhRb3BXUjZxY25iTEFmeVNBVUZPdEhxUkVGc1NnbEhjOHItTERUSUd2T0RoUVlqLU1OWXN0YWZJTEIyeHFzOW45NG9DcTNZOWxIYWR5RmFyMlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Pectra Devnet nears launch: Will ETH climb higher? - AMBCrypto News",
        "content": "Developers continued to work on Plectra upgrade for the Ethereum network.\n\nChanges in staking rewards were discussed to mitigate centralization and other risks to the network.\n\nApart from the market recovery, the increasing attention around Ethereum [ETH] has helped it soar over the past few days. The upcoming Plectra update could further help Ethereum see green.\n\nDevelopers continue with their work\n\nIn the 137th All Core Developers Consensus (ACDC) call, the primary focus was on the progress of two testnets, Pectra Devnet 1 and PeerDAS Devnet 1.\n\nPectra Devnet 1 is nearing its launch, with both Consensus Layer (CL) and Execution Layer (EL) clients prepared. The Ethereum Foundation DevOps team is rigorously testing various client combinations to ensure compatibility and stability.\n\nPeerDAS Devnet 1 is currently undergoing bug fixes before its planned relaunch. Once these issues are resolved, the devnet is expected to be restarted by the end of the week.\n\nIn addition to testnet updates, the call also covered research on fork choice testing by the TxRX team at Consensys. Their newly developed test generator aims to identify potential bugs and deviations in client software from CL specifications.\n\nThe successful launch of Pectra Devnet 1 is a significant step towards the Pectra upgrade, which is expected to introduce several improvements to the Ethereum network.\n\nThe ongoing development of the fork choice test generator is crucial for enhancing the reliability and security of the Ethereum ecosystem.\n\nNew changes for stakers\n\nAdditionally, Ethereum is also considering adjusting its staking rewards to maintain a lower staking rate, potentially around 25% or 12.5%.\n\nThis change could have a substantial impact on the returns ETH holders receive from staking. The Ethereum Foundation is exploring this option to address several concerns.\n\nA lower staking rate is seen as a way to mitigate the risk of centralization, where a significant portion of ETH becomes concentrated in a few large staking pools.\n\nThis centralization could potentially threaten the network’s security and decentralization.\n\nAdditionally, a lower staking rate might reduce the likelihood of a mass slashing event leading to a chain split, a scenario where ETH holders might pressure the protocol to restore lost funds.\n\nHow is ETH doing?\n\nAt press time, ETH was trading at $3,455.17 and its price had grown by 1.16% in the last 24 hours. Despite the recent surge in price, the network growth for the Ethereum token had declined, suggesting that new addresses were slowly losing interest in the ETH token.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nMoreover, the velocity at which ETH was trading at had also fallen significantly, implying that the frequency at which ETH was trading at had also fallen.\n\nIf these trends continue, ETH’s chances of rallying further would diminish even further."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPcHhKRUg3WVk0ZGxabEp6VExBRldBeEl1b040SUVjZWJlVmZva3FELWpQWUttM3VtQV8xLUExM1NpZWtLM0dFeDRoUXZZcUtyN1o4X0szMjVZQ3IxUFNtRERaRGNyeVh4Rld6U0Fsb3IxNkpFUUZjY3cwbTkxY1JZb1RnVU9qU2p6X0FQUVdTWEZCVnh5dW1CejMxOGNnS1VDLXFiZ2tqcHQySFQ2cXlxQTUwREVDaV9wTnhOWnJON2hTNF9zZzlYVGREN05kZnprd3dnTURR0gHbAUFVX3lxTE9yZXFqaHZTUE9DcUlUc0lXNXBVTUtpZy1FMXo1TnJ0YklwNGY3RkxycFh2N3ZtVC05QnZiQS1ISG9rOTZZNlNBMDI1VHZMcFhUTEU0SHBQT1BmUlR1SnJtLXljSlF1ejNYbGlBRE82Y3hfdnlOMjNGOFRMRGhrU3M0QXFydEdQMWkzOVRMSFkybmJPYVFySFhJRFNMMEhvVS0zN0RsNlJtMGQzcEh1MFFGNkFrNHkya2tVYzcyMUN2cTUwLUVSbTdOZldTWTI0SzVnbUszOWdJM2taOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin, as Other Crypto Leaders Line Up Behind Trump, Argues Against Picking Candidates Just Because They Like Crypto - CoinDesk",
        "content": "Vitalik Buterin, as Other Crypto Leaders Line Up Behind Trump, Argues Against Picking Candidates Just Because They Like Crypto\n\nThe comments from Buterin, widely viewed as Ethereum's intellectual leader, stand in stark contrast to the strongly pro-Trump rhetoric from other well-known crypto figures.\n\nBy Margaux Nijkerk Jul 17, 2024 at 6:43 p.m. UTC"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNX3VJVU4wUnJvcDd6N0lZU0lDWWZTT1RIaUNrdkFidTFnSHVzRlhPNDZGWjFXeDFyTnY3dk03YWtSNFVHeEZqaW9wb2FmeEdJanZta3dnSEhlR1NLWGxhcXZuQ0NfRldYd2czSXlmYzRWSnVKQnVndWJuS2hSb2JCT0U0enNDQW5QUXM4NVRCY0EwVkVnTWdjLTVIOTZ6Q1VfaG84ajYtLW1JRkMxSWMyQdIBtgFBVV95cUxPRHp3d2pGUU9KQVBGUHdFX2dCVGhhZzRsMHl0d1R0NlZ0OFZQU0JyUHBPUGlXTDBvcFdYbWtGVTVQZlhzQTJ1dVVnWmwxYUFkX2RPRTlhWkpJNE9EWVpUVldJYXpJSEtiNlZSSk0zbkU0LWN6cVc3YWxMR3BiU2xfMlNHNmVYeGtRVVVTc2xRdUNvTHVlODRFSmpoNlptUUZTdTVEM3JQU21La1RkRGZUajZGemNrQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Here’s How ETH Could Surge Above $5,000 in 2024 After Ethereum ETP Approvals: Bitwise CIO - CryptoPotato",
        "content": "Bitwise Asset Management’s Chief Investment Officer has predicted that the introduction of Ethereum Exchange-Traded Products (ETPs) will drive ether (ETH) prices to new all-time highs above $5,000 by the end of the year.\n\nThe CIO suggests that ETP flows could have a bigger impact on Ethereum than they did on Bitcoin.\n\nThe Road to Ethereum’s New All-Time-High\n\nAccording to Matt Hougan, with ETPs projected to attract $15 billion in new assets over the next 18 months and ETH currently trading at around $3,400, only 29% below its all-time high, the conditions are just right for a price rally.\n\nThe anticipated price surge for Ethereum depends on fundamental supply and demand principles. While ETPs do not alter the underlying fundamentals of ETH, they introduce new demand sources. This dynamic was observed with BTC following the launch of spot Bitcoin ETFs in January.\n\nSince then, these financial vehicles have gotten more than twice the amount of Bitcoin that miners have produced, leading to a notable price increase. Bitcoin has risen approximately 25% since the ETP launch and over 110% since the market began factoring in the possible products in October 2023.\n\nHowever, Matt warned that the first few weeks after the ETP launch might experience some volatility. This could happen because the $11 billion Grayscale Ethereum Trust (ETHE) is switching to an ETP, which might cause short-term selling. Despite this, the CIO is confident that by the end of the year, ETH will hit new record highs, with even greater gains possible if more money flows in than expected.\n\nEthereum’s ETP Gains Might Be Bigger Than Bitcoins\n\nSeveral factors suggest that Ethereum could experience even higher gains from ETP inflows than Bitcoin. When Bitcoin ETPs launched, the asset’s inflation rate stood at 1.7%, requiring $16 billion of annual BTC purchases to maintain equilibrium.\n\nEthereum’s inflation rate over the past year has been 0%, with the ETH supply remaining at 120 million. This equilibrium is due to the consumption of ETH by various Ethereum-based applications, which balances out the daily creation of new ETH. With new demand meeting zero new supply, the potential for price appreciation is high. Additionally, increased activity on the Ethereum network would further increase organic demand for ETH.\n\nAnother advantage of Ethereum is its “proof of stake” consensus mechanism. Unlike Bitcoin miners, who often need to sell their newly mined BTC to cover operational costs, Ethereum stakers do not face high direct costs and are not compelled to sell their rewards. This reduces the daily forced selling pressure on ETH, creating a more favorable supply-demand balance.\n\nCurrently, 28% of all ETH is staked and thus locked in contracts for a set period, making it unavailable for sale. An additional 13% is locked in decentralized finance smart contracts, reducing the available supply. About 40% of ETH is effectively off the market, which could amplify the impact of new demand from ETP inflows."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxPX2NudTJpNm5WVG9oNGZIOXRoZjd0R2k0S2IwRndjSDVEdmZIbE5rVWtXdk0yNFotTEZSX0pWeGtOdEdyRXBaSlhUa3FyV21kZEd0a3hvaUpuOHdfTHNSWjF2M183QnJ2RGZDWnVpbVZLRjczaFhHcGZQZ0pVR1lucWtCRmQ2dmw2QWJKLWJsVm9ySkIySTJablhSeENwallOcTZscWVVWGdOV1ZOa1hMQlVEeElsaXlaT1h4ZmRjZzhEUjFfWm9nN3VhZUlDck0xRlHSAdcBQVVfeXFMUG5QOWpWaHZCQUl2dkNKZkVEMmpjaE1UY3JyUHdGSkxJNlA2UlRDc0ExNFlDRjRna3N2MGVOV0dBczBhVGdkR2diNlZDaXRaVm9LVDZXZlNIMWZIVy12bUhfMzVXbG9QQ2VrcmFrTW5JSXphTHIxcVJ5VUFNZUdIX0UwZDg5ajlxQ0NEWW1OX3RPY01Mb1ZhU21SRGRoRlY3SG0xOWMzZHJfbFNYeEFmcjl4cTZhYVZuQm0xVTBTbUZJOVJvUDlrY3B5dFlGRFNHclZQZF9MTlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin surpasses $65,000 mark - FXStreet",
        "content": "Bitcoin price closes above the daily resistance level of $64,900, signaling a bullish move.\n\nEthereum price bulls take $3,240 threshold, indicating a transition to an upward bias.\n\nRipple price breaches the daily resistance level of $0.574, signaling a potential bullish trend on the horizon.\n\nBitcoin (BTC) closes above the daily resistance level of $64,900, with Ethereum (ETH) and Ripple (XRP) subsequently breaking through their resistance levels, indicating an emerging bullish trend.\n\nBitcoin price action signals bullish trends ahead\n\nBitcoin price surged above a descending trendline last Sunday, marking a 7% rally over the following two days and achieving a close above the daily resistance level of $64,913 by Tuesday. As of today, BTC is trading slightly up by 1.1% at $65,622 on Wednesday. Such a strong upward momentum often precedes a retracement, presenting a potential buying opportunity for investors on the sidelines.\n\nSideline buyers seeking opportunities can consider positions between the $59,200 and $57,800 levels, where the previously broken trendline resistance now serves as support. However, should BTC sustain its bullish momentum, it may advance by 2.5% from its current trading price of $65,622 to test the weekly resistance of around $67,209.\n\nOn the daily chart, the Relative Strength Index (RSI) is currently above the neutral level of 50, and the Awesome Oscillator (AO) has also flipped above its neutral level of zero. These momentum indicators strongly indicate bullish dominance.\n\nFurthermore, surpassing the $67,209 level could allow an additional 7% rise to retest its daily high of $71,997 from June 7.\n\nBTC/USDT daily chart\n\nConversely, if BTC closes below $56,405 and forms a lower low in the daily timeframe, it may signal persistent bearish sentiment. This scenario could trigger a 7.5% decline in Bitcoin's price, targeting a revisit of its daily support at $52,266.\n\nEthereum price shows potential for a rally\n\nEthereum price broke above the $3,240 level on Sunday and rallied 7.36% in the next two days. It is 1% up at $3,486 on Wednesday at the time of writing.\n\nIf the $3,240 level holds as support and ETH closes above the $3,524 level, it could increase 6%, targeting a retest of its daily high from June 9 at $3,721.\n\nThe Relative Strength Index (RSI) on the daily chart is trading above the neutral level of 50, and the Awesome Oscillator (AO) is on its way to doing the same. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective mean levels. Such a development would add a tailwind to the recovery rally.\n\nETH/USDT daily chart\n\nOn the other hand, if Ethereum's daily candlestick closes below $2,817, forming a lower low in the daily timeframe, it may signal persistent bearish sentiment. This scenario could trigger a 7% decline in Ethereum's price, targeting a revisit of its daily support at $2,621.\n\nRipple price eyes a bullish move\n\nRipple price broke above the daily resistance level of $0.574 on Tuesday and is currently 1% up at $0.585 on Wednesday.\n\nIf XRP holds above the $0.574 level, it could rally 12% to retest its daily high from April 9 at $0.643.\n\nOn the daily chart, the Relative Strength Index (RSI) and the Awesome Oscillator (AO) are currently positioned above their critical thresholds of 50 and zero, respectively. These momentum indicators strongly indicate bullish dominance.\n\nXRP/USDT daily chart\n\nHowever, if Ripple's daily candlestick closes below $0.413, it indicates sustained bearish sentiment, forming a lower low in the daily timeframe. Such a scenario could lead to a 16% decline in Ripple's price, targeting a revisit of its low from March 12 at $0.347."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOa1JMT2pUZko5SzRwMENWLTh0THdYUHRzUmIwcGI5Zjc1cGVUUUlsQ3phNDVfd01oVFVyekZ2U1dyek9qYU1RZ1FMa2FQOXdEa21LWllTeTJlazNPaTE2ZWotU1U4c3p5NXkwdE5ITFNRQkJWN3BFYzRSN1Z6ZGNfU18xdDRPa0xMUWlHQ21XWdIBlAFBVV95cUxPM1pUdVF3YXhiWUpuTzhlc2lzcUJabFl3OEVDbXRma2RTMGJENXVBci1ySmVZQnF0MDlPbi1FSGY4UG5FS1dtMy1JV3dLZjJBZUZ3LVBqS3J6Z0F3YTBwVm9pOW9iUTZ4aDNWaGtBNHQ4ZEc4c2RGajhDcHp2X09pMTVFSHZabFA4YmtLVUpDMERqNUJ6?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Breaking: 21Shares Reveals Spot Ethereum ETF Fee In Updated S-1 Filing - CoinGape",
        "content": "21Shares filed an amended S-1 form for its Spot Ethereum ETF (CETH) on Wednesday, July 17. It discloses key details about the Trust’s operations and fees. The filing revealed the sponsor fee to be charged once the ETF starts trading. In addition, details on a 6-month fee waiver were included.\n\n21Shares Submits Updated S-1 For Spot Ethereum ETF\n\nAccording to the SEC filing, 21Shares Core Ethereum Trust (CETH), will pay a unitary sponsor fee equivalent to 0.21% of its Ethereum (ETH) holdings. The competitive fee is in line with market expectations. Previously, VanEck’s 0.20% fee sparked speculations of lower fees by other issuers.\n\nadvertisement\n\nInterestingly, 21Shares has proposed to waive the entire sponsor fee. This waiver will stand for a six-month period after the listing of their Ethereum ETF. However, the fee waiver can also be removed when the Trust’s assets reach $500 million, whichever milestone is achieved earlier. This waiver strategy aims to attract investors by reducing operational costs during the Trust’s initial growth phase.\n\nEarlier, Bitwise offered a similar fee waiver, however, the firm is yet to announce the sponsor fee details. In addition, Invesco Galaxy also disclosed 0.25% fee in a July 9 filing. Hence, the latest revelation by 21Shares places it second in the list of competitive fee for Spot Ethereum ETFs.\n\nMoreover, the amended S-1 filing underscores 21Shares’ proactive approach in structuring its ETF to appeal to potential investors in the crypto market. Also, the latest development is in line with the potential Ether ETF launch date set for July 23.\n\nEarlier, Bloomberg reported that July 17 will see the final round of S-1 amendments with fee details. Hence, the 21Shares’ filing proves that right. Moreover, Senior Bloomberg ETF analyst, Eric Balchunas, believes that the launch should take place next Tuesday if there aren’t any last minute mishaps.\n\nAlso Read: Breaking: Ethereum ETF Staking Open For Reconsideration – SEC Commissioner\n\nWhat’s Next In Line?\n\nMoreover, reports indicate that the SEC has preliminarily approved at least four issuers. This sets the stage for imminent developments pending final procedural checks. Key stages leading up to this include the SEC’s request for updates on critical 19b-4 forms. Thereafter, the historic May 23 approval of the 19-b4 filings for the eight applicants, including BlackRock, VanEck, 21Shares, Grayscale, and others.\n\nAs 21Shares was the first one to file an updated S-1 for its Ethereum ETF application for the last round of amendments, other issuers were expected to follow suit. Hence, the other seven issuers also filed the amended S-1 forms. BlackRock revealed a fee of 0.25% while Franklin Templeton announced the lowest fee of 0.19%. However, Grayscale doubled down on charging the highest fee of 2.50% despite the Bitcoin ETF fiasco.\n\nFurthermore, the much-awaited Spot Ethereum ETF launch comes amid significant crypto events such as The Bitcoin Conference in Nashville, slated for Tuesday, July 23. Moreover, speculations swirl around heightened market attention towards these ETFs products as Donald Trump will attend the conference. Hence, the timeline makes sense as it will lead to a major hype around the launch as well as the conference.\n\nAlso Read: Ethereum ICO Wallets Deposit 3,631 ETH into Kraken Ahead of Ether ETF Approval\n\nKritika Mehta Kritika boasts over 2 years of experience in the financial news sector. Currently working as a crypto journalist at Coingape, she has consistently shown a knack for blockchain technology and cryptocurrencies. Kritika combines insightful analysis with a deep understanding of market trends. With a keen interest in technical analysis, she brings a nuanced perspective to her reporting, exploring the intersection of finance, technology, and emerging trends in the crypto space.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxNdVlDMXVPUE81VGdYcjFIYVZNSFcyOFBNVzY5aWlWMXJvdlpUWkkwLVZZb3l1NVhrYTNwYklXeFY1UmFidGctTUlpQW1vbVR6UzdLcTVoa3pvWUJQd1ZiV0NjWTZLWGh1VFZseEthcUViQkRrYnFRZHJvZ3NEMmZ6Rk9nLXdVRWhLSDBRR2ZsaHZqcWd5VTZxRWNXaTdYcnBrdlkwVWpaTTN3VVBZTHl4d3NjbGI3Y09ORzFVNTI3cUEydjFNVUVZVU1DbWg4bV80YmxOY3ZJQzcyc0M2bF9RS3lRZC1SUUoxQUFITNIB8gFBVV95cUxOd3pPOEo1OVhLc2ZaaWhKTHZ5czM0T0pQTU5EVU84QVp1WVlCcnlsQzdnMVBBVFdsNVZic1AtSFItX2RHdW5lQmNJRzZXZThGUkFEVk1UaTd2LUtXdnRzV0lnYnRYTWU3dF92Y19nWExyc2FKSFVkUGowdUpRWlBOTkoxbEFGVUpWZ2xTdjFUS1pCVHBRN3poWjRxZEZvN0Vvbmd1d2FTMDJIdHg4M3JJRmczZWtmbEVOUHl2RWY1bDJHeGNRV3NVVWU1OTRnVUZjWTg4dm9yM01TMTZCblA2THpBY3VrRW9fNmV4SFdrdTgyQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum, Solana, and XRP rally with Bitcoin after Donald Trump incident and ETF hype - FXStreet",
        "content": "Crypto tokens added nearly 4% to market capitalization, pushing it to $2.52 trillion as traders digest news of the shooting at Donald Trump’s rally.\n\nSpot Ethereum ETF approval is expected this week, fueling the anticipation of Ether token holders and crypto traders.\n\nBitcoin sustains above $65,000 as Ethereum, Solana, and XRP extend gains on Wednesday.\n\nCrypto market capitalization increased nearly 4% in the last 24 hours and climbed to $2.522 trillion on Wednesday, as seen on CoinGecko. Almost all cryptocurrencies ranked in the top 10 assets by market capitalization have rallied in that period.\n\nBitcoin’s gains have likely catalyzed rallies in Ethereum, Solana, and XRP, among other assets. At the time of writing, Bitcoin trades at $65,260, and Ethereum, Solana, and XRP extend recent gains.\n\nAdditionally, Spot Ethereum ETF approval is anticipated this week, and this is likely the other key market mover for the assets.\n\nEthereum, Solana, and XRP rally amidst ETF hype, Donald Trump rally incident\n\nETF experts and analysts believe that a Spot Ethereum ETF approval is likely this week. As anticipation brews, Ether holders and traders expect gains, and the sentiment is positive, as seen on cryptoeq.io.\n\nEric Balchunas, Senior ETF analyst at Bloomberg, believes that the US Securities & Exchange Commission (SEC) will likely approve the ETF by Thursday, July 18.\n\nWe don't have a new over/under launch date yet because we haven't heard what the SEC's game plan is. Hope to hear soon. But if you forced me gun to head style to give my best guess for date I'd go with July 18th. — Eric Balchunas (@EricBalchunas) July 8, 2024\n\nCrypto traders are likely digesting the news of the events that unfolded at former US President and candidate Donald Trump’s rally on Saturday, as the shooting was followed by a rally in crypto prices. Analysts at on-chain data tracker Santiment attributed this to traders anticipating Trump’s win in the November 2024 Presidential elections and his pro-crypto stance.\n\nFormer US President Trump is scheduled to deliver a speech at a Bitcoin Conference later this month, on July 27. The Presidential candidate is expected to deliver his speech in Tennessee, in person, despite injuries sustained at the shooting.\n\nIn the last 24 hours, Ethereum, Solana and XRP extended gains by 3.2%, 4.1% and 12% respectively, per CoinGecko data. The three assets have positive returns for the last seven days period.\n\nBitcoin, Ethereum, Solana and XRP extend gains\n\nAt the time of writing, Ethereum trades at $3,488, hitting a new two-week high at $3,517 previously on the day, while XRP touched a three-month high at $0.6188."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPd0pjRHdybjlyenlRWm9rM3JHaF9nR0UwWFlVWkgtNndQeVFvbnBsWkNaZGhZYU85TFNLaE1uOW9RVEVrOTBfSDJaSENPc0tSNXZEZ0tFcVRTRG1YbzBpMGw1VkY3eURKd2RmM0tHZ1JDdkR4aW1fajc0dUlPSHZFWmlqM2FpOWFoMVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) at $3.4K and Solana (SOL) Prices Correct - The Cryptonomist",
        "content": "SPONSORED POST*\n\nTL; DR\n\nEthereum (ETH) surges above $3,400 as market sentiment improves\n\nSolana (SOL) retreats to $155 despite analysts predicting a move to $200.\n\nClandeno (CLD) is tipped to outperform the market with 40X gains after listing.\n\nEnthusiasm has returned to the crypto market after the failed assassination attempt on former U.S. President Donald Trump. This caused major cryptocurrencies to hit key price levels. Ethereum (ETH) surpassed $3,400 while Solana (SOL) marched towards the $160 mark.\n\nThis market excitement has spilled to Clandeno (CLD), a new blockchain-based e-commerce platform. Analysts laud Clandeno (CLD) as the best new cryptocurrency to buy during its live ICO. Ethereum (ETH) and Solana (SOL) investors are partially booking profits to buy CLD tokens in anticipation of the predicted 40X surge.\n\nWill Ethereum (ETH), Solana (SOL) and Clandeno (CLD) turn out to be the best altcoins to invest in? Let’s find out.\n\nEthereum (ETH) Smashes $3,400\n\nEthereum (ETH), the second largest cryptocurrency with a market cap of nearly $410 billion, was one of the biggest gainers in the past few days. Trading at $3,395 at press time, Ethereum (ETH) is up 10% in the past week. Ethereum (ETH) is taking a breather after reaching a high of $3,490 on July 16.\n\nInvestors are optimistic that Ethereum (ETH) could soon reach $4,000 as ETH spot ETFs are rumored to start trading on July 23. This will be a major win for Ethereum (ETH) and new cryptocurrencies such as Clandeno (CLD). Clandeno (CLD) is tipped for massive growth, while Ethereum (ETH) can only register modest gains for its holders.\n\nSolana (SOL) Corrects After Reaching $160\n\nSolana (SOL) jumped from $134.17 on July 12 to $160 on July 16. This marked a 19.2% jump. However, Solana (SOL) has surrendered its gains, retreating to $155.17 at press time. Analysts have come in full force, predicting that Solana (SOL) is headed to the $200 price level.\n\nSolana (SOL) is one of the best-performing assets over the last year, surging 454%. Expert analysts claim that Solana (SOL) has limited growth potential. Bullish analysts are predicting a move to $80,000 for Bitcoin. New cryptocurrencies such as Clandeno (CLD) will see huge gains when leading cryptos surge.\n\nAs Solana (SOL) corrects, investors are leaning towards Clandeno’s (CLD) live ICO.\n\nClandeno (CLD) is Set for 40X Growth\n\nClandeno (CLD) is set to transform the e-commerce industry by offering launching an innovative blockchain-based online marketplace. The new e-commerce platform will focus on addressing several challenges affecting the industry. Clandeno (CLD) will have unmatched transaction efficiency, improved security and decentralized governance.\n\nApart from its user-centric approach, Clandeno (CLD) is focused on delivering a great investor experience. This starts with launching CLD, a native token with several utilities within the Clandeno (CLD) ecosystem. With a total supply of only 525 million CLD tokens, investors are guaranteed price appreciation. The Clandeno (CLD) team will lock the liquidity pool for 20 years and team tokens for 2.5 years.\n\nInvestors are flocking to buy CLD tokens during the initial coin offering because Clandeno (CLD) is poised for 40X growth. Clandeno (CLD) has a practical utility and a growing community of investors to see an exponential price surge during the crypto bull run.\n\n\n\nTo find out more about the Clandeno presale, visit their website here.\n\n*This article was paid for. Cryptonomist did not write the article or test the platform."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNM1FXaHhQMXMyZVVrbngyMllGaUYxRllJdU1wc2xKN002cUkzYmVFNzZva0dtLWZIeDZKWTFVeHhMamhFazQyX2JRUGRjOEgwOG8zR0pXZ2VqMURLUVBmTkVrTWN0REE3Nk95VWNtVUh3ZmM1NWdldW16U3AxR3l2UDhhX0PSAYoBQVVfeXFMTzNpYmRrdzZyQVJNWTlZTXNiY2tHZTY5QVZjc1lzRnl1TDlYRUFSbHRLMHY4ZUZwSjZRRXZ1RG1WNWFJT1BpYTEwYV9BdmVjektzYUl6eUZzeVMyUmlNdDVPU3c1REJaWWxpa0ZmeWhMVXgxR242ajNzWFNncE0xaElFZHowQWdPbVJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Solana gains spotlight as Ethereum ETF countdown begins - AMBCrypto News",
        "content": "Ethereum ETF set to launch on 23rd July, paving way for Solana.\n\nVanEck’s filing signals growing institutional interest.\n\nThe crypto world is on edge as Ethereum ETF launch approaches. The Ethereum [ETH] launch is set for 23rd July, according to a renowned crypto analyst. This milestone comes after Bitcoin’s ETF success.\n\nAmidst these developments, VanEck’s recent filing for a Solana ETF has intensified market anticipation.\n\nSolana in the Spotlight\n\nAs Ethereum takes center stage, Solana [SOL] emerges as the next potential ETF candidate. Known for its speed and low costs, Solana could be the third major crypto to secure an ETF.\n\nThis prospect has already boosted Solana’s market position and investor interest.\n\nEric Balchunas, a senior ETF analyst for Bloomberg, recently replied to an ETF approval week tweet and added more fuel to the Ethereum ETF launch speculations. In the tweet, he stated that the the launch could be on 23rd July.\n\nSocial buzz and whale activity\n\nAMBCrypto’s analysis of Solana’s social volume data shows recent stability with a slight downward trend.\n\nHowever, whale holdings have increased since January. The total supply held by whales stood at 42% of the total supply at press time.\n\nThis indicated strong institutional interest despite waning social volume trends, which may result from Ethereum stealing public attention.\n\nSolana correlation insights\n\nAMBCrypto’s analysis of the Hyblock buy volume in the last two years indicated that the correlation between Ethereum and Solana stood at 0.44. This suggests a moderately positive relationship between the two giants.\n\nThe connection could benefit SOL as Ethereum’s ETF launch approaches, potentially driving increased interest in both assets.\n\nIs your portfolio green? Check out the SOL Profit Calculator\n\nAt press time, Solana was trading around $160.79, forming a bullish pennant pattern. The recent breakout above key resistance signals potential for further gains.\n\nIf it breaks through the bullish pennant resistance, the rally will continue. Both the RSI and MACD indicators support an optimistic bullish outlook."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQNVNEMlFzdk03YUYzS2c4T1dYbzhUT2NuZ0d2RzFZamFaYkJoS3lTQlNLU3dCb1Z2WG5mRlFOdVNIdzh5VXpJMzFDX05WeHpvRmlyb0lITWNjWENudWljQVpWclB4cU5CRkZyUFo4bFo2dl9ZUkhPTUg3Z1hsSkVGaDRXZjFWWllLcl9uVXpmZnNPZlB4eWJFRGZnU1hRSzh0TDZVb2tqZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "WonderFi working on Ethereum-based products with new innovation and development arm - BetaKit - Canadian Startup News",
        "content": "Dubbed WonderFi Labs, the new arm is working on a Layer 2 blockchain and non-custodial wallet.\n\nToronto cryptocurrency company WonderFi has launched an innovation and development arm focused on building decentralized technologies and applications to expand its offerings beyond centralized trading platforms.\n\nWonderFi Labs will internally develop products and look to support external projects that build on WonderFi L2.\n\nDubbed WonderFi Labs, the new arm will be led by WonderFi vice-president of engineering Kartik Bajaj and will develop, incubate, and invest in on-chain applications. The first projects under development are a Layer 2 blockchain built on Ethereum called WonderFi L2 and, an Ethereum Virtual Machine (EVM)-compatible non-custodial wallet that will connect to WonderFi L2 and other EVM-compatible Layer 2 blockchains.\n\n“By establishing WonderFi Labs, we are committing resources and a standalone division to the development and implementation of our new products and services,” WonderFi president and CEO Dean Skurka told BetaKit in an email statement. “This will allow us to strengthen the ecosystem while maintaining our existing strategic roadmap with the exchange business and our expansion plans in Australia.”\n\nSkurka added WonderFi Labs will continue to internally develop other complementary products and look to support external projects that build on WonderFi L2.\n\nLayer 2 refers to technologies built on top of existing blockchains, otherwise known as Layer 1, such as Ethereum. Layer 2 technologies are meant to extend the capabilities of a blockchain, while still utilizing the security protocols on the base layer. WonderFi did not provide additional details on its L2 project beyond that it will “enable low-cost and fast transactions for a global audience, while leveraging the security of Ethereum.”\n\nRELATED: #CDNtech companies Nuvei, WonderFi, Thinkific saw revenue growth in Q1 2024\n\nA non-custodial wallet, as opposed to a custodial wallet, gives owners full control and responsibility over their blockchain-based assets rather than entrusting them to a third party, such as an exchange. Being EVM-compatible means the wallet can communicate with any of the multiple blockchains that use EVM to verify and execute transactions, such as withdrawing and depositing cryptocurrency.\n\nThe launch of WonderFi Labs comes on the heels of an interesting Q1 2024 for WonderFi, which trades on the Toronto Stock Exchange and operates multiple cryptocurrency platforms.\n\nThe firm reported a “record” quarter for revenue, which increased 43.4 percent quarter-over-quarter to $18.5 million CAD, and that its platforms handled a 58-percent surge in trading volumes. These results were reported just a few weeks after WonderFi shareholders claimed the company was underperforming amid a digital-asset bull run, and called for the company’s board to be replaced. WonderFi and the dissenting shareholders ultimately signed a co-operation agreement.\n\nFeature image courtesy WonderFi."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxOY19hVDRzTm11M003NzRBajBtRkVfZVVvTzRFNm4tVElXbXNuaWxGcnVHaUJ1c1M0OXYxSFMtOUFQODBZQWJXcWpodXFveC0tbWxsWnN0TzFTSDRiNkFPSGtNY29xbDBNYnF0cU81R29TX0FFWjBhZnVjakxMUzA1WnNhUVptenpCRzNPcThEbGxzblhJX2hJM254YVJ0SW5OS3c2SnBnTGdkSlZhaG1tcHJyOXQwMDR3dVpkcmFHZHJQbXJKVkZYbUZpNThOVGltWTNKdDB0TFZIaDJUOFY3NEFPN2pMUG5hMWZj0gHwAUFVX3lxTE5hblc3bW40QjMzbG9ObktSNEJaMUJwejc2dFlGZFVaamw5RlpvNEdYSERPNzYtbklMZXZ4STNoQzZsX2J0bmF5REwzTEprUGZWWmNodTJacXZfUi0tMXZPNE5tMmFrTGo1RlpPMkg0bDNHTHZuemlIai1Fc1JCVFlMeno0Ri1OQjBtVVYzZi1HSGo0cUFSVTZ1Nk5MallxeW1JRTA3OWMzZDMzYl9nWGQxa0Y3SmIwSVFVSkR1QzlZM2NGSzlSRkUzOEJzMXItVWpsN0pSbVF6RmwwaHpqWEVvV0pjV3JsUnVtYm8yNWdXWA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, XRP gains grind to a halt as traders turn cautious ahead of ETH ETF approval - FXStreet",
        "content": "While I am impressed by the current bounce in Bitcoin $BTC it should be noted that the sequence of lower highs and lower lows continues despite the halving, despite the ETf, despite the hype pic.twitter.com/V5M6FFaMpJ\n\nUPDATE: The WazirX Hacker is out of SHIB. $102.1M SHIB was stolen this morning from WazirX and has now been fully sold off by the attacker. pic.twitter.com/sjCSZJhdIv\n\nSAVE THE DATE: MATIC → POL After community consensus, the long-awaited upgrade is set for September 4th • Initial phase: POL replaces MATIC as the native gas and staking token for Polygon PoS • Subsequent phases: POL will serve a crucial role in the AggLayer More details pic.twitter.com/SyxsFAlOeZ\n\nEthena (ENA) trades at $0.478 at the time of writing. ENA is rallying early on Thursday. The token could extend gains by 20% and hit the lower boundary of the Fair Value Gap (FVG) between June 22 and June 24 at $0.573.\n\nThe Ethereum ETF may not be as bullish as you think for the first few months and here is why… As soon as the Ethereum spot ETF gets approved, the Grayscale Ethereum Trust of ETHE will get converted into an ETF. Blackrock fees are .25% Vaneck fees are .25% Grayscale fees are… pic.twitter.com/Cydcbkqusb\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNQTVKWl9lWkduX0NualE5ZHFSVjM0d1d1ekx6eG5XYzBGMWJCRWxrTnBSM3NpQ2VwVmtzWEZGWXRLNzZmXzdyeXgwUDgyaFpvUzVid0JVMlFoLTFRUFlVM0tmOWQwajd6Y3FUeTZiNkZyOGM5TlhzTm1qTHRxckFjMUJVdW80eHZSRHFxTldvZ1d2R24tNE9tZFFQSDRaVU9IcXlmNUdkQmVLbXVsSjNXN3RRYWt3Q09UcWlmRWd6WWxKeGIyTHFz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Co-Founder Warns Against Choosing Politicians Based Solely on Crypto-Friendliness - CryptoGlobe",
        "content": "In a blog post published on July 17, Ethereum co-founder Vitalik Buterin voiced his concerns about the growing trend within the crypto community to support political candidates based solely on their stance towards cryptocurrencies. Buterin’s argument highlights the risks of such a narrow focus and emphasizes the broader values that originally motivated the creation of cryptocurrencies.\n\nButerin acknowledges that “crypto” has become an increasingly significant topic in political discourse, with various jurisdictions considering legislation to regulate blockchain activities. He mentions examples such as the Markets in Crypto Assets regulation (MiCA) in the EU, efforts to regulate stablecoins in the UK, and the regulatory actions by the SEC in the United States. While he views many of these legislative efforts as mostly reasonable, he expresses concern over extreme measures like treating almost all coins as securities or banning self-hosted wallets. These fears have driven the crypto community to become more politically active, favoring candidates who are lenient towards crypto.\n\nHowever, Buterin argues against this trend, asserting that making political decisions based solely on a candidate’s crypto stance risks betraying the deeper values that drew people to the crypto space. He notes that within the crypto community, there is often an overemphasis on the centrality of money and the freedom to hold and spend it. While he agrees that financial freedom is crucial, he cautions that an exclusive focus on cryptocurrency is not aligned with the original ideology that inspired the creation of crypto.\n\nButerin traces the roots of cryptocurrency back to the cypherpunk movement, which advocated for free and open technology to protect and enhance individual freedoms. He recalls the early battles against restrictive copyright legislation and the importance of decentralization, citing a statement from Satoshi Nakamoto that emphasizes the power of peer-to-peer networks. Bitcoin, according to Buterin, was seen as an extension of this spirit, offering a decentralized means of online payment.\n\nHe argues that the ideology that originally created crypto was about more than just financial freedom; it encompassed a broader vision of decentralization and individual liberty. Buterin points out that there are other technological freedoms just as foundational as financial freedom, such as the freedom and privacy of communication, digital identity, and thought. He stresses that these freedoms are increasingly important as more of our lives become mediated by technology, particularly AI.\n\nButerin urges the crypto community to remember these broader goals and not to reduce their political engagement to a single issue. He argues that supporting a politician simply because they are pro-crypto can lead to aligning with values that contradict the foundational principles of the crypto movement. For instance, he says, a politician who supports crypto for the wrong reasons might also advocate for policies that undermine other freedoms.\n\nHe also discusses the importance of internationalism, a value dear to many in the cypherpunk community. Buterin highlights how cryptocurrency can contribute to global economic equality by providing access to financial systems for people in poorer countries. He cautions that politicians who favor protectionist policies, such as tariffs, may harm internationalism even if they are pro-crypto.\n\nButerin emphasizes the need to evaluate politicians on a broader set of values beyond their stance on cryptocurrency. He suggests looking at their positions on other related issues, such as encrypted messaging and digital privacy, and considering whether their overall vision aligns with the values of decentralization and individual freedom."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPUXR4OFU3OE1WX3dOYVJXSFJmVDcwbXJlLW5wX181SnR6TDR0a1ZyY0NqZFZjTVFzVUVmQk1ycWQxTkI4cXZFWU5kSmZwOTR0a25Eb2tHSGVnVHVVakpzb1RGajNZQUNjdkNOOG9zNmFIMGl4d1dtcnRKLTJZRWxiT3RRZk1JcXdWSGpzdHpkdkUzc1V6THhkTm01LWVvZXlrVXByUDgyMlNiTk1qYklWcUlLSWg1VWhFQXcyTm93U1R2alXSAcgBQVVfeXFMUEFNUVpiZENpWWpRV0FtS1pGVjFqOG1nRkJEbzVGR0otejF5LWpHenJESi1nSkdsNmdIQ3ZtLXVVZ1VfMDk2VEtqNVc4SjU5UWFOOUljenBmajZLcVlDb0ZId2NqZkRBWExFX25FWTljYUpqWlY4cUtIa2Q5aWdyRWxLNW9qdk9ZZk9iUE9BR0JraHVfdWgxb0FRRjVjcFhHNUpFcnQ2elFZWE1vSXFQaWxxNnhvMlpfRElmZjR2OXVvX3hqLU9oVjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin jumps over 3% despite sell-off events; Ethereum, Altcoin XRP surge - The Statesman",
        "content": "Bitcoin prices surged over 3% on Wednesday, reaching USD 65,758. It rallied above USD 66,000 in early Asian trading, extending its recent gains after a volatile few weeks.\n\nBTC has experienced high traction among investors due to increased inflows and positive sentiments following an assassination attempt on US presidential candidate Donald Trump.\n\nAs per the CoinSwitch Markets Desk, spot bitcoin ETFs have attracted over $16 billion in inflows since their launch in January, with $300 million added just this week.\n\nAdvertisement\n\nFunds like BlackRock’s iShares Bitcoin Trust and Fidelity’s Wise Origin Bitcoin Fund have seen steady investments, reflecting robust investor demand for regulated Bitcoin exposure.\n\nMajor altcoins have also benefited from BTC’s rise. Ethereum (ETH), BNB, Tether, XRP (11%), Dogecoin, Cardano, Tron, Avalanche, and Shiba Inu have seen gains of up to 11% during this period. Conversely, Toncoin was among the losers, declining by over 1%.\n\nAs altcoins also show strong performance, the overall crypto market sentiment remains optimistic. Investors are closely watching key resistance and support levels to gauge future movements.\n\nOn Monday, lifetime net inflows into these ETFs exceeded $16 billion, with market bulls now aiming for the $71,500 level. Despite Mt. Gox’s decision to move 91,755 BTC valued at $5.8 billion, BTC remained stable above the $65K mark, unaffected by the development."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE5jaW1LU05oUHpWV3J5UFVGY0JaX25xMkhmS256bWlBTmZLTWkxVWdQNjdqZmNZa3lONVJncUlNc1hTRTZtVFpOOWlkNXFRX0pRaVFMQ19ueGJUd25OeWxPVnFOYWY0WVB1U29LUVNnVkZvZ9IBd0FVX3lxTFBDUDNoQjJGT1NONnRJWV9EZjBCM1B2MHJhTTlOR2tuN084dWFIczFWUDFiWlVWcTFuTERXLUJSMFpabGJBaEVUTWpDdTZ6TlhtR2tMT0RhVUlVbDVFRHFDdjBpaW85NXlJdy1OZ3JmSzFFa0liMTFv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 03:31:21 GMT",
        "title": "Ethereum Price Stays Strong: Will ETH Continue To Rise? - NewsBTC",
        "content": "Ethereum price failed to clear the $3,500 resistance zone. ETH is consolidating above the $3,380 support and might attempt another increase.\n\nEthereum is correcting gains and struggling near the $3,500 zone.\n\nThe price is trading above $3,380 and the 100-hourly Simple Moving Average.\n\nThere is a key bullish trend line forming with support at $3,375 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to rise unless there is a close below the $3,350 support.\n\nEthereum Price Fails To Surpass $3,500\n\nEthereum price made another attempt to clear the $3,500 resistance zone. ETH struggled to continue higher above $3,500 and started a downside correction like Bitcoin. There was a move below the $3,450 and $3,420 levels.\n\nThe price even dipped below $3,400 and tested $3,375. A low is formed at $3,376 and the price is consolidating above the 23.6% Fib retracement level of the recent decline from the $3,516 swing high to the $3,376 high. There is also a key bullish trend line forming with support at $3,375 on the hourly chart of ETH/USD.\n\nEthereum is now trading above $3,375 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $3,450 level and the 50% Fib retracement level of the recent decline from the $3,516 swing high to the $3,376 high.\n\nThe first major resistance is near the $3,480 level. The next major hurdle is near the $3,500 level. A close above the $3,500 level might send Ether toward the $3,550 resistance.\n\nThe next key resistance is near $3,640. An upside break above the $3,640 resistance might send the price higher toward the $3,750 resistance zone in the coming days.\n\nMore Downsides In ETH?\n\nIf Ethereum fails to clear the $3,450 resistance, it could continue to move down. Initial support on the downside is near $3,380 and the trend line.\n\nThe first major support sits near the $3,350 zone. A clear move below the $3,350 support might push the price toward $3,270. Any more losses might send the price toward the $3,220 support level in the near term. The next key support sits at $3,150.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 zone.\n\nMajor Support Level – $3,380\n\nMajor Resistance Level – $3,450"
    }
]