[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFB6Tk9WcGlGTEMxakFqeGEzS092NzM0eHAtc3JnRWlZbVNNMjJETk1oeUFpSjY4RWZ5ZjNadUh5WjFpWFRDQ0N0MkVJeGlKU2ZCWEJmdDJ2YXBrS0FWbjRwRWF1OWxGQlZ3ZVlSNmdBcnRTNWNTTVRsZTJNNVNFZXPSAYcBQVVfeXFMTkJwQjZRcUMzNEl0TVE2d3FkR2xNZHFrLVNIVWVwZXRiUTd3VlN2Yy1POEZrZDJJdkx5OHpsMUJSc2xkVVREMnVsdmRtdDhFYkp3SFNueHU5MlNJUjJUcUdHU2lJTG9qdVZnMElPZk0wWVlxbzVmQ0tCamFyOUhHNUx4dS15ZFFv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Dips to Weekly Low Amid SEC Security Uncertainty - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe price of Ethereum dipped overnight following revelations that the U.S. Securities and Exchange Commission (SEC) has secretly considered the cryptocurrency a security for over a year.\n\nEthereum is currently trading at a weekly low around $3,050, down 3.9% on the day, per data from CoinGecko. In the past day, traders have moved roughly $15 billion worth of volume. ETH is now trading 15% lower than it was a month ago.\n\nIts downward price movement follows the publication of previously redacted portions of a lawsuit filed by Consensys against the SEC. According to the software firm's complaint, an internal Formal Order issued by the regulator in March 2023 explicitly referred to the investigation of \"certain securities, including, but not limited to ETH.\"\n\nThe internal order stands in stark contrast to the regulator's public refusal to explicitly state whether it considers Ethereum a security. SEC Chair Gary Gensler has repeatedly deferred when asked to outline the SEC's position on the matter, including during a House Financial Services Committee oversight hearing in October 2023.\n\nAD\n\nAD\n\nWere the SEC to define Ethereum as a security, it would also contradict Gensler's own prior statements on the matter; in 2018, while still a lecturer at MIT, he stated that Ethereum is “not a security” in the eyes of the SEC. Gensler was seemingly referencing an opinion expressed by the SEC's former Director of Corporate Finance, William Hinman, in a June 2018 speech in which he described Ethereum as \"sufficiently decentralized\" that it could not be considered a security.\n\nHowever, those statements predate Ethereum's 2022 \"Merge,\" in which the blockchain network switched from the proof-of-work consensus mechanism employed by Bitcoin to a proof-of-stake model.\n\nIn September 2022, as the Ethereum network's Merge took place, Gensler suggested that proof-of-stake cryptocurrencies could be considered securities, a view he's since reiterated. And the SEC's March 2023 internal order specifically references an investigation into \"Ethereum 2.0,\" the name commonly used to describe the post-Merge network.\n\nAD\n\nAD\n\nThe SEC's position on Ethereum comes at a crucial time, as the regulator considers whether approve or reject multiple applications for spot Ethereum ETFs. The SEC has repeatedly delayed its decision on applications from asset managers including Grayscale, BlackRock and Franklin Templeton.\n\nWith a key deadline looming in late May, ETF watchers have turned pessimistic on the chances of approval, with investment bank JP Morgan giving even odds on whether it'll be approved or rejected.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNYTVocFptYzUtdnFEbW9vSkt1ZGE2bmE5emU3OGl1c205Z3Y5YmNIX0NlRkFTSmdOR3VJc1UtV1pRbjlocGI5TnJpNWw5T1pCVXl6N3A4Y19EcTBVMUc1TFdNbnozOGVqUEIwd2x3aExwQ042R3FWUV9yTkV3RmNaR1lMZUhfY2FvdWxlZ2JqQm05Zl9U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Plunged Today - The Motley Fool",
        "content": "The hype around crypto seems to be fading.\n\nThe crypto market has had momentum all year, but that seems to be coming to an end as April comes to a close. The entire market has dropped, but the biggest names are leading the way.\n\nBitcoin (BTC -3.23%) has fallen 4.7% since the stock market's close on Monday, Ethereum (ETH -2.30%) is down 6.5%, and Dogecoin (DOGE -7.14%) is off 6.1%. And this continues a bad week with the tokens down 9.7%, 8.1%, and 18.2% over the past seven days.\n\nCrypto ETFs have hit saturation\n\nWhen Bitcoin exchange-traded funds (ETFs) hit the market in the U.S., they brought billions of dollars in new investment to the industry, and Bitcoin jumped and pulled the entire market with it. But that didn't happen in Hong Kong.\n\nBitcoin and Ethereum ETFs were introduced in Hong Kong yesterday, and there was only $8.5 million in Bitcoin ETF trading and $2.5 billion in Ethereum ETF trading on opening day. That could indicate the appetite for crypto ETFs is fading.\n\nBinance founder's fate\n\nThe other cloud hanging over crypto is the sentencing of Binance founder Changpeng \"CZ\" Zhao in Seattle. He pleaded guilty to one count of violating the Bank Secrecy Act in November, but prosecutors have asked for a three-year sentence.\n\nIt's not clear what will happen to CZ, but like what happened with previous court cases and charges, the crypto industry has had to fight for both regulatory clarity and against fraud in the industry. Investors were reminded of that today.\n\nThe momentum trade may be over\n\nMore worrying for crypto investors is that the rally's driver over the past six months has now faded. Investors have been in a \"risk on\" mindset since mid-2023 and are now facing a slowing economy and the reality of higher interest rates for longer than previously expected.\n\nCrypto was supposed to be a hedge to some of these economic woes and offset the inflation brought on by money printing. Still, the reality is that crypto trades correlated with higher-risk assets like growth stocks. And many growth stocks are falling if earnings miss expectations by even a tiny amount.\n\nUnless there's a turnaround in the growth rate of the economy or the appetite for risk from investors, we may have seen a top in crypto values for a while.\n\nHow crypto can get its mojo back\n\nWhere I'm looking for growth in the next year is the utility crypto can bring to the financial market. Companies are beginning to test or use crypto and the blockchain for applications like financial payments and the issuance of bonds, which are just scratching the surface of potential use cases. But the market value is still driven more by hype and speculation than real utility.\n\nI think tokens that add utility will be the best place for long-term investments, and that may mean meme coins like Dogecoin and tokens like Bitcoin that are expensive to use to transfer funds get left in the dust. The blockchain is coming, but not all tokens will have value when it does."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPeGNLTmNoeG44NTRINGMxUy1jemZCcG1hYUZPWk1zb29PMWpkelVyYU9id2lDUW1UeDJ3VVZuS1UxWGgyZUNTN253bkxqNmtnQUNqaUlWcnVxcG16RTljTGV5alQ4dTJibHVVSXlWMGVDQ1R1TXV3VVdVdGVlOHRQQWNmWndQZ3dkQi1YTnBEY3BaQkpWeXhjXzZrX2lZZVFFZW9XcGVXbmR5UjdWd1JTZVdFMVJwVXNqeWZaOFEtWdIBxAFBVV95cUxQbFB2RzlQdlpqR3VKUVdTTGtkTXlSOUdMMHZ0ZFREbnpsalFTcVZKVkdFU3RZZTBpSmU3YllUMFVmUDF5cU1CUDJ4TXJuX0FISW15Rl90WkpmNVpNc3NaS1pCbEMzNmtiak9TM3hHaF9GVmpDM0VHZ2tnTlF5TXE5Tm5pbEdpZ0hBME55eTFaaHFCaVFKa3BRRUhRUktxQ2V1V2R1QUNMLTVadDdmQnZRaFBGUGdNdVBnNXlyTElGOG9HTGZ2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Ethereum and Altcoin Capitulation Approaching Amid ‘One Final Push’: Analyst Benjamin Cowen - The Daily Hodl",
        "content": "A widely followed crypto analyst believes that Ethereum (ETH) and other altcoins are on the verge of a major market correction.\n\nIn a new video update, crypto strategist Benjamin Cowen tells his 800,000 YouTube subscribers that Ethereum against Bitcoin (ETH/BTC) may be making one final move to the upside before a market capitulation.\n\n“In order for confirmation of [bullishness], you would need to see ETH/Bitcoin get above its bull market support band and then start holding it as support. And if you don’t see that, then I still think it’s just going to be yet another lower high that everyone once again got excited about that ultimately resolved to the downside.”\n\nThe analyst also says ETH and alts may be repeating a similar pattern from the last cycle when the TOTAL3 chart, which tracks the market capitalization of all altcoins minus Ethereum and stablecoins, suffered a severe correction against Bitcoin.\n\n“Last cycle, the ETH/Bitcoin capitulation occurred, it finalized after alt/Bitcoin pairs broke down.\n\nSo one thing about this bounce is that alt/Bitcoin pairs have not yet broken down. They haven’t had a weekly close below their range low. So I think that you’re seeing something very similar with alt/Bitcoin pairs that you saw over here [in June 2019], one final rally up to the bull market support band – it didn’t even make it to the bull market support band back then – and then it came down. I think you’re seeing something like that happen once again with alt/Bitcoin pairs, one final push before capitulation down to the range lows this summer…\n\nI think this is the final push before the final capitulation into the summer, as we get into potential rate cuts.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Anna Anikina\n\nGenerated Image: DALLE-2"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE92OURBU1Z3OVNRZ2I3cHJrRGl4S2d3Vm0yckZreWZ0UUd2SWdjX0xoeTdGQzg2bVlTZFFTektMTUpTZUpYWndLZ0dvRlBBQ2Vuczhjd3pjY202a29MaVl5R0hWdnFPNDRWMkRMZnl3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum spot ETFs start trading in Hong Kong with high expectations - Crypto Briefing",
        "content": "Despite questions about Ethereum's legal status in the US, Hong Kong ETF issuers have stated that the crypto has been classified as a non-security in the region.\n\nShare this article\n\nHong Kong-listed spot Bitcoin and Ethereum exchange-traded funds (ETFs) are set to debut in a few minutes. In anticipation of the launch, Zhu Haokang, Digital Asset Management Director and Family Wealth Director at China Asset Management, is confident that the launch scale of Hong Kong’s virtual asset spot ETFs will exceed the US’s initial $125 million scale.\n\n“I am very confident that the initial listing scale of Hong Kong’s virtual asset spot ETF (more than US$125 million) can exceed the issuance scale on the first day of the United States,” Haokang said in a press briefing.\n\nHaokang confirmed that mainland Chinese investors are barred from participating in these ETFs, while Hong Kong’s qualified investors, institutional investors, retail investors, and international investors who comply with the regulations have the green light.\n\nHe also noted that the ETFs have garnered significant global interest, especially from regions like Singapore and the Middle East that lack similar offerings. The physical subscription method allows Bitcoin miners to invest directly using their Bitcoin holdings.\n\nWayne Huang of OSL clarified that Ethereum’s potential classification as a security in the US would not impact Hong Kong crypto ETFs due to the independent regulatory processes of the Hong Kong Securities and Futures Commission (SFC).\n\nHong Kong is able to launch the world’s first spot Ethereum ETF because the SFC has already defined its regulatory framework clearly, considering Ethereum as a non-security virtual asset, Huang added.\n\n“Hong Kong has already had a clear definition of Ethereum. Ethereum It is not a security, but the first non-securities virtual asset to be included in Hong Kong supervision together with Bitcoin, and it is one of the two targets that can be provided to retail investors,” Huang said.\n\nAdditionally, he reported that discussions are ongoing to expand the range of virtual assets available in Hong Kong’s ETF market.\n\nThe launch is anticipated to have a positive effect on crypto prices by increasing liquidity, encouraging regulatory compliance, and opening new capital channels.\n\nCommenting on the upcoming debut of Bitcoin and Ethereum ETFs in Hong Kong, Bloomberg ETF analyst Eric Balchunas suggests that this will be an opportunity to compare demand and investment flows into Ethereum ETFs against Bitcoin ETFs directly.\n\nHe estimates that Ethereum might capture 10% or less of net flows compared to Bitcoin.\n\nNote also that this is the first time we will get clean look at how popular Eth is relative to btc in ETF format. What % of the net flows do you think they will grab? I think 10% or less, James more optimistic. https://t.co/ZKggtAGQIH — Eric Balchunas (@EricBalchunas) April 29, 2024\n\nPreviously, Balchunas said the launch’s impact will likely be minor compared to that of the US market, considering the nascent state of Hong Kong’s ETF market, which currently holds only $50 billion in assets, as well as other factors like fee structures and China investors’ restrictions.\n\nHowever, he sees the Hong Kong-listed crypto ETFs as a long-term positive for Bitcoin adoption.\n\nBitcoin’s price has climbed over the past few hours. It’s currently trading at $64,000, up over 1.5% after dipping below $62,000 earlier today, according to CoinGecko.\n\nMeanwhile, Ethereum is hovering around $3,200, down 1.4% in the last 24 hours."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOWEw0X3NraUpwRnh5V28xUUVSbENiVFhkVGFFbUFhRXItNDRKOENHMkNMUWowVWN1a3k4Zl9UREwwMUtuTG8zOEwwMkhtbkVsOU9mV3JPQVFJTjZJZFdQcjFXRnJsZ2hydGRFaDc4RWYwTzEzOHdTM0NjQTJIQ1ZMVGxxd3BIRFhrYUFZbFdtYllwTFdlUmFscGNYdUlhc0dESUh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Why Hong Kong’s disappointing Bitcoin and Ethereum ETF launch was actually a huge success - DLNews",
        "content": "Six Bitcoin and Ethereum spot exchange-traded funds debuted in Hong Kong on Tuesday, drawing mixed reactions.\n\nWhile analysts hailed the launch as a great success, some traders criticised the funds’ low trading volumes.\n\nIt’s all relative\n\nThe Hong Kong Bitcoin and Ethereum spot ETFs processed roughly $12.7 million in trading volume on their first day, per Bloomberg data — numbers which Singapore-based crypto trading firm QCP Capital called “terribly disappointing.”\n\nThe numbers may indicate institutional crypto interest is concentrated in the US while Asian interest is more private wealth focused and natively dominated, QCP said, further attributing Bitcoin’s 8% drop to the poor numbers.\n\nBut Bloomberg Intelligence ETF analysts James Seyffart and Eric Balchunas said that the volumes had to be understood within the wider context of Hong Kong’s market size.\n\n“If you localise numbers, this was big,” Balchunas said.\n\nChinaAMC’s Bitcoin ETF alone is already the sixth most successful ETF launched in Hong Kong in the past three years, out of 82 different ETFs.\n\nThe crux of the question: the Hong Kong ETF market is worth roughly $50 billion, which makes it 168 times smaller than its US counterpart, according to Balchunas.\n\nJoin the community to get our latest stories and updates\n\nAdjusting for market size, it’s as if the Hong Kong ETFs processed the equivalent of $1.6 billion in trading volume, whereas the US Bitcoin ETFs saw $4.6 billion in trading.\n\nIn other words, the Bitcoin and Ethereum ETFs were almost as popular on that day in Hong Kong than they were in the US — it’s simply that the pool of demand is much smaller.\n\nInvestors shouldn’t therefore expect them to have the same market-moving impact as the US ETFs, but that doesn’t make them a disappointment.\n\n“By any reasonable relative measure for the launch of these ETFs — they were a massive success for the Hong Kong market,” Seyffart said.\n\nIt will take a few days to properly measure inflows, Seyffart and Balchunas said, because the full data isn’t available yet.\n\nBut ChinaAMC’s fund vacuumed $141 million worth of Bitcoin on its first day, some of it from its seeding process.\n\nCrypto market movers\n\nBitcoin is down 5% over the past 24 hours to trade at $58,100.\n\nEthereum dropped 2.8% to $2,900.\n\nWhat we’re reading\n\nTom Carreras is a markets correspondent at DL News. Got a tip about Bitcoin ETFs? Reach out at tcarreras@dlnews.com."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNVUNoMzI3MEFjRW9EQWRobThac2I1bFoxdDdNYk4xVkd3WFdTc0VGYTlVSEJPQTVjTVlXVmxPaUI3VFp2eFZPQUxoX19sckhaOHcwQWlFYWJBeW9IOEt6bXBhLWQ0RmJWcXkwN2V0MmsxNlZwZ3F6eVFYUGNzRUtVOTFLRjlxV3pPRF8w0gGQAUFVX3lxTFByeWdjVXRWLVlCR0trX1BrOTJscWRfVlFnY0dMN1JPandjYTQ2NzlwbUtpcEkzbjlyd0p0b256MjhZbWpDWXhaMFpDREIxYXlVTm1KXzJwcDBkaUtZSFMwRjVFeGVUNEJnbk5YZ0NLaWZBUjBXdkpNMU83T0N2b0xVTzQ1U2lIVVRqOWF0LXFtYg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Will Ethereum Price Hit $10,000 If The SEC Changes Tune? - CoinGape",
        "content": "The approval of Bitcoin ETFs in the US in January this year broadened the outlook of the crypto market for most investors. Attention quickly shifted to Ethereum with companies swiftly filing with the Securities and Exchange Commission (SEC) to offer spot ETH ETFs. For a short while, Ethereum price surged alongside Bitcoin price. Although the latter achieved a new all-time high of $73,837 according to data by CoinGape and CoinGecko, ETH topped out at $4,091.\n\nEthereum Price Market Update As Volatility Rages\n\nThe post-Bitcoin halving crypto environment remains in a precarious state. An initial climb in crypto prices waned, paving the way for the current correction. Bitcoin price changed at $60,715 on Tuesday during US hours, painting a 3.5% drop in the last 24 hours.\n\nadvertisement\n\nEthereum, the second-largest crypto had been hammered the most, losing a modest 5.6% of its value to $2,984. A 6.6% fall in the market cap to $361 billion reflects the intense sell-off in April while the 8% spike in the 24-hour trading volume hints at the growing interest in Ether among traders.\n\nLosing support at $3,000 exposes Ethereum price to more selling pressure at the outset of May. The position of the smart contract token below two bull market indicators — the 20-day Exponential Moving Average (EMA) and the 50-day EMA (blue and red lines on the chart) could further trigger more declines this week.\n\nA death cross pattern confirmed on April 17 when the 20-day EMA flipped beneath the 50-day EMA is another bearish signal that’s hard to ignore.\n\nSimilarly, the Relative Strength Index (RSI) reveals that sellers have more influence at the time of writing. Therefore, it would be imperative to anticipate continued losses to $2,800, and if push comes to shove $2,500.\n\nDespite the correction, the RSI is not oversold, suggesting that there’s room for more downward movement.\n\nNevertheless, the same four-hour chart brings attention to a wedge pattern. If Ethereum price rebounds before breaking below the lower trendline support, chances of a targeted recovery will increase significantly.\n\nA falling wedge is considered a bullish pattern occurring after a substantial surge in the price of an asset followed by a drop, or consolidation. As the trendlines narrow, bulls fight to retake control.\n\nTraders will look for a breakout above the upper trend line, which often points to a breakout target equal to the distance between the widest points of the pattern. A 24% increase in price could drastically change Ethereum’s outlook.\n\nIs Ethereum A Security?\n\nUS Regulators are undecided on Ethereum’s status — whether a security or a cryptocurrency. With the expectations of a spot ETF gaining momentum, this determination is crucial and likely to set a precedent for many digital assets.\n\nA recent report by Fox Business producer Eleanor Terret revealed that Gary Gensler and the agency he heads, the SEC believed that Ethereum passed as security, but only for some time.\n\nThis revelation comes amid the ongoing Consensys lawsuit against the SEC. In the report, Terret said that Gensler and the SEC “appear to have believed for at least a year” that Ethereum was an “unregistered security trading out of compliance with current federal regulations.”\n\nAn investigation dubbed “Ethereum 2.0” is being carried out by the SEC intending to unearth details of Ethereum being a security, especially on the sales of Ether from 2018.\n\nFormer executives of the SEC like Director of Corporation Finance Bill Hinman are on record stating that Ethereum was not a security. Hence, the ongoing investigation could throw this stance in the wind, further opening a can of worms for the SEC.\n\nOn the other hand, if the “Ethereum 2.0” investigation affirms Ether’s status as a cryptocurrency, it could potentially bolster its position in the industry.\n\nAt the very least, it will increase the probability of spot Ethereum ETFs approval — a move that could blast ETH price above the previous all-time high. A clear path could also be opened for Ethereum to close the gap to $10,000 bolstered by increased adoption among retail and institutional investors.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNLXJ2ODBseE9PSTFWMVZYVVY5NFJEaWIzR0sxR3dZdTBjSmwxNTZMQzBKMEFIaFZyZkxEMFdROTlhclhWMnAyS0JrbjZoM3pSbTdnVGw2VXE5Vl8zdno3M3hxeHozWkRUeGFHZzRVZ2hPLVFrMTcxTzF3aHZwWW84bURETlRMUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong debuts Bitcoin and Ethereum ETFs - Yahoo Finance",
        "content": "Hong Kong launched its first six spot Bitcoin and Ethereum exchange-traded funds (ETFs) on Tuesday.\n\nThe three, spot bitcoin ETFs by China AMC, Harvest and Bosera all closed the day in green, with Bosera leading with 1.8%.\n\nAll three Ether ETFs fell by the end of the trading day in Hong Kong, with China AMC’s Ether ETF leading the losses at 0.77%.\n\nThe ETFs offer investors the option for both cash and physical redemptions, a feature that is anticipated to contribute to their success.\n\nHong Kong’s crypto ETF debut follows the launch of similar Bitcoin-based products in the U.S. in January this year.\n\nThe U.S. market is awaiting the Securities and Exchange Commission’s (SEC) decision on the applications for nine spot Ethereum ETFs, which are reportedly likely to be rejected next month.\n\nThe SEC is investigating whether Ether, the native cryptocurrency of the Ethereum blockchain, is a security.\n\nLast week, Consensys, an Ethereum development firm, filed a lawsuit against the U.S. SEC to challenge the agency’s stance on Ethereum.\n\nCourt documents suggest that the regulator has been investigating Ethereum’s status as a security since at least 2018.\n\n“Hong Kong has already had a clear definition of Ethereum,” said Wayne Huang, head of ETF at OSL, in a press conference on Monday.\n\n“It is not a security, but the first non-securities virtual asset to be included in Hong Kong supervision together with Bitcoin, and it is one of the two targets that can be provided to retail investors.”"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE8zakJvNmZXVmR5Nks5QlU0dndqeFVaSmdRTEt1dGk5MTVWMDFzejczUUlTeDBuVktkRGxVeWtyd2hpc3ZKYkRfRkVBeUlJU2FDdTI1OTBBZzFWNjB4VVZhU095TXpQM2dxYXdEdVdfYVrSAXhBVV95cUxObllKSmhRVkQzbnhpTTl5bG9kMFdWZVduMTlMYURkWUZpdzZ3dm5NSUgzYmswRkhFcThQWXhVT3QtRzVreFZ1eEhjVlFqRnF0QVNfWU9URGdCZEJpOFpVYkRzUU5sMUJ2SU9nQ09UTFZiSWo4YnVUdm0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "If the SEC Thinks Ethereum Is a Security, Are ETH ETFs Doomed? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWill the SEC approve an Ethereum ETF this year?\n\nOptimism among market participants is fading—and now that the SEC’s stance on Ethereum as a security has been made public, those hopes may have been shot down for good.\n\n“If this SEC approves a spot Ethereum ETF before the election, I will eat my HODL hat,” Matthew Sigel, head of digital assets research at Van Eck, an Ethereum ETF applicant, told Decrypt.\n\nThat’s because of a lawsuit filed last week by Ethereum software company Consensys against the SEC, which revealed that the Commission believes Ethereum (ETH) to be an unregistered security—and that the SEC has, for the last year, pursued investigations on that basis. Consensys wants a court to declare Ethereum as a non-security, preempting any forthcoming charges from the SEC. (Disclosure: Consensys is one of 22 investors in Decrypt.)\n\nAD\n\nAD\n\nTo be clear, the SEC has yet to bring charges against Consensys, or anyone else, that formally allege Ethereum is a security. But the revelations in the Ethereum giant’s lawsuit have already had far-reaching implications, with top Washington lawmakers accusing SEC Chair Gary Gensler of lying to Congress last year about the agency’s position on ETH.\n\nWhile the long-term impact of SEC’s investigations into Ethereum plays out, in the more immediate term this means spot Ethereum ETFs likely aren’t happening—at least, not without another legal fight.\n\nSpot market Ethereum ETFs would allow Wall Street firms and investors to gain indirect exposure to ETH without having to deal with crypto exchanges or wallets. After a decade of denials from the SEC, spot Bitcoin ETFs finally gained approval for trading in the U.S. market in January—but only after Grayscale, one of the biggest digital asset managers in crypto, successfully sued the SEC to make it happen.\n\nStill, after Bitcoin ETFs got the green light, analysts assumed spot ETH ETFs were right behind, with approval likely by summer. Now analysts and ETF issuers on Wall Street aren’t so sure.\n\nAD\n\nAD\n\nEthereum ETF applicants are expected to hear back from the SEC regarding approval by May 23. By last month, analysts were already cooling on the prospect that these initial filings would gain approval; this week’s news has only further convinced experts that ETH ETF applications have a ways to go.\n\nEric Balchunas, Bloomberg’s senior ETF analyst, opined on Twitter this week that the SEC’s now-evident position on ETH’s security status likely means spot ETH ETFs aren’t coming to Wall Street any time soon. And that’s because ETFs based on commodities and securities operate on different rules, he said.\n\nYes dif rules, 33 act for commodities — Eric Balchunas (@EricBalchunas) April 29, 2024\n\nIt doesn’t appear, though, that the SEC’s apparent hostility towards Ethereum has spooked would-be ETH ETF issuers—at least not yet. A spokesperson for crypto fund manager 21Shares, the first-ever Ethereum ETF applicant in the U.S., told Decrypt that the firm remains committed to seeing its petition approved.\n\nVan Eck, a more traditional Wall Street investment firm, remains all-in as well.\n\nThe company’s digital assets research chief Matthew Sigel believes the product will be approved “in time.”\n\nBut he emphasized that Van Eck’s experience bringing crypto to Wall Street has never been without conflict. This week’s news constituted just one additional bump in a road the firm always expected to be long and winding.\n\n“This has been war since January of 2022, it's been a war for the entire Biden tenure,” he said. “Part of our investment thesis for this asset class is that it will continue to win the bigger battles in the courts over time.”\n\nAD\n\nAD"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOYTV5a09lVmh6MFVndDZtQWNpc3Zmbk5lZ0w2TVNRSHFYRTZuTHE1SnFoNEwzX3ViQVhjNHpTRUxPanp2SUhRdzFYaUx6MWNxU01rQURQTzlDY1lhRl85cFRkclhwR3MtQkxZeDdsbnFBQmFaU1VFaVRMUTRSdDRnZXNiRTdSaDZKNWx0dVlzZWhPQTc0NG9ERGlrTl9FbW11cldBV3BSUDdoeEhzOVd6TmpKN21hSE9HcmdrNUg5SGIyRUo2QTA00gHMAUFVX3lxTE93NzdJT1lxeHA4WmpxaE01aGhJWVZRaEJkTFlOOHNjX05TTVUyT2IyVnVvS2dmOUUzY0VPNTBoZjlFbkVxREJQXzJGRVdxdFdCWWl5RTQzSE50Z2ppT09KMHNvcXNSM2tUa21WRTlKRDBHNXFEODFvWWJWckRPNW84V242d1dyckhhSlZRVGUzT0JFUkY2bnhqb3JvSmt0Y2JVemZkajAyMTE1bnRIb015N2JiNVo5WWphbDlDbWtPeVpoRmRHMkEyc3g0Rg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Bitcoin's Ethereum-Style Programmability Could Come in 12 Months, Rootstock Founder Says - CoinDesk",
        "content": "Linus's release of BitVM last year has been widely cited by Bitcoin developers as a breakthrough for the 15-year-old blockchain since it theoretically would facilitate the development of programmable layer-2 networks similar to those that are being used in the Ethereum blockchain ecosystem to make transactions cheaper and faster. Key to the project's promise is that BitVM would require no changes to the underlying Bitcoin code – seen as crucial due to the blockchain's decentralized governance, often lacking consensus among developers over major upgrades."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOVnNwSmdXbjg0Y1hGN3VXYTV0NHFpQnU4eDRlcDN5UFBtb0laUW1XNlMxZ3U3RGZ3c3pocjlSODRCWTVnVnBzLURqQ0tkVng2bVJ0N0o2aWc3YVd1eEk3SFk3NDhxV1IwNF9qZnFnZk5iaktib0JzMWF6N2F5QjNWeElFeFh2bGhuQnZwQ1lFVk5sZzF1TEVXUTlLNTJnSktjc2xsLThHVTDSAbABQVVfeXFMUHk0Tzl0dV9WVnNEUVV4V2pHd2trTURoczFXcUpaMjdvYnh5X25ydk1MSFNHMTFsVXpPM0VqWkk2dUs2Tk1yYUtRSmgtTlJ6NndNcktyRVFrbGpwWTZvVFp0YUNTNHBDbnNqelNjUWZvY0NMdlM0TGlWZ3p5eHhQemN3SUVFcDhUbkJ0OGx2Mk1SOG9LUkF3RVhRNEVsMC14OTNvSjA5Nmk3ZTQtM0VrZV8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Bitcoin Crashes to $57,000 and Ethereum Slips Below $3,000 Hours Before Fed Meeting - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn the hours leading up to the next Federal Reserve meeting, investor pessimism has hit Bitcoin and Ethereum hard.\n\nAt the time of writing, BTC has dropped 7.6% and ETH is down 6% over the past 24 hours. The Bitcoin price is hovering around $57,000, while the Ethereum price is stuck at just under $2,900, according to data from CoinGecko.\n\nThe volatility has been hellish for derivatives traders. In the past 24 hours, $457 million worth of crypto futures positions have been liquidated, according to CoinGlass. And no big surprise, $392 million of those were long contracts.\n\nTraders opening futures contracts are essentially placing bets on future price action. To be long on an asset is to bet the price will go up. And to be short on it is to bet it'll go down.\n\nAD\n\nAD\n\nAnd it's not just blue chips like Bitcoin and Ethereum that have been impacted. Sagging prices have been widespread throughout the market. In fact, out of the whole top 100 cryptocurrencies by market capitalization on CoinGecko, just a few assets have escaped the sea of red, barring stablecoins that have managed to maintain their pegs, such as Tether (USDT) and Circle's USDC.\n\nThe U.S. Federal Open Markets Committee will publish its interest rate decision at 2 p.m. Eastern Time today, with Fed Chair Jerome Powell scheduled to speak at a press conference at 2:30 p.m.. Back in February, investors seemed certain that May would be the month that the FOMC finally cut interest rates—which is usually a bullish sign for risk assets like Bitcoin.\n\nThat's because lowered interest rates usually coax traders out of U.S. Treasuries to chase gains in riskier assets, like equities and crypto assets.\n\nThe Fed's key interest rate currently stands at a high of 5.25% to 5.5% and has been unchanged since July 2023 as the central bank aims to curb inflation. Policymakers have been keeping a close eye on inflation, which is currently 3.5%, in hopes to get it closer to 2% before considering rate reductions. But that's becoming a distant hope, as last month inflation increased to the highest it's been since September.\n\nAD\n\nAD\n\nTraders had a small jolt of hope in March, when the Swiss Central Bank announced it was cutting interest rates. “For some months now, inflation has been back below 2% and thus in the range the SNB equates with price stability,” the central bank wrote in its decision at the time. But it seems the sentiment in Switzerland hasn't spread to other major central banks.\n\nJust a month ago, traders seemed certain that the Fed might lower interest rates in June, according to the CME Fed Watch tool. But sentiment has soured. Traders don't expect to see the Fed ease interest rates until December—and even then it's just a 75% majority that seem to feel that way."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOREtuYWRfWG1MbFZseWFUcWJ4ODl5QnZ1M2xIOUM1bE1oTzRta0VWSkNGbnZtazM4WFdpWDVBakFUYTRKeExQcEZINE5SdDBTZWpfcnpsaUx1VDJ1bFFFUmZyMG5tUnNrQkZhbldDdnA5azVVTWg2Uk5tM05oWmpXMi1jQ1NkMzk0X0o4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Halving the Cake: Can Bitcoin & Ethereum Survive the Cut? - Yahoo Finance",
        "content": "Toobit\n\nNew York, NY, April 30, 2024 (GLOBE NEWSWIRE) -- As the cryptocurrency landscape continues to evolve, the looming question on investors' minds is whether Bitcoin and Ethereum, the two leading digital assets, can withstand the challenges presented by their upcoming halving events. The halving, a programmed reduction in the rewards miners receive for validating transactions, has historically sparked intense speculation and debate within the crypto community.\n\n\n\n\n\n\n\n\n\nToobit, a pioneering cryptocurrency platform, offers insights into the potential implications of the halving for Bitcoin and Ethereum. According to Toobit's analysis, both Bitcoin and Ethereum face unique challenges and opportunities as they approach their respective halving milestones.\n\n\n\n\"Bitcoin's halving event, which took place on 19 April 2024, represents a significant milestone for cryptocurrency,\" states a spokesperson from Toobit. \"The halving has officially raised the stakes for the asset. Not only is it scarce, but BTC price has hit an all-time high. This shows that there is a viable future for cryptocurrency despite all the noise. Every move from now onwards will dictate cryptocurrency history.\"\n\nWith the issuance of new Bitcoin rewards being cut in half, the Bitcoin halving event underscores the asset's scarcity and reinforces its position as a store of value. However, it also raises concerns about the sustainability of Bitcoin's mining ecosystem and the potential impact on transaction fees.\n\nSimilarly, Ethereum's transition to Ethereum 2.0, coupled with its popular EIP-1559 upgrade, adds another layer of complexity to the halving equation. Despite these changes happening several years ago, the Ethereum halving is not as clean cut as the Bitcoin halving, which may make it confusing for unfamiliar users. Toobit emphasizes the importance of staying updated with these developments, as they are responsible for the shaping of Ethereum's future viability as a leading smart contract platform and decentralized finance (DeFi) ecosystem.\n\n\n\n\"Previously, Ethereum's transition to a proof-of-stake consensus mechanism promised scalability and sustainability benefits, but it also introduced uncertainties regarding its economic model and network security,\" explains Toobit's spokesperson. \"It's easy to get excited about the new ETH price with each halving event and forget about the bigger picture. Therefore, we must also reflect on Ethereum's ongoing efforts to address scalability challenges and enhance user experience with every halving event.\"\n\nStory continues\n\nIf you believe that this is time to start investing in crypto, Toobit is the place to start. Pick your choice of cryptocurrency: BTC, ETH, XRP, SOL (SOL price), DOGE (DOGE price), ETC (ETC price), FTM (FTM price), Storj (STORJ price), FIL (FIL price) or the 100 other tokens that Toobit offers. Sign up for an account today and get free USDT to try out trading with zero risk. Plus, that's not including the many prizes that Toobit has lined up for our users via exciting weekly competitions! Begin your trading journey today with us at Toobit and experience sailing the crypto seas for yourself.\n\n\n\nAs investors and enthusiasts brace for the Ethereum halving event after just completing the Bitcoin halving event, Toobit encourages stakeholders to remain vigilant and informed about the evolving dynamics of the cryptocurrency market. With careful analysis and strategic planning, investors can navigate the halving landscape and capitalize on the opportunities presented by Bitcoin and Ethereum's maturing ecosystems.\n\n\n\nFor more information, crypto market analysis, and expert insights, visit Toobit's website at https://www.toobit.com/\n\n\n\nAbout Toobit\n\nToobit is a leading cryptocurrency platform dedicated to providing comprehensive insights, analysis, and tools for investors and enthusiasts. With a team of experienced professionals and cutting-edge technology, Toobit empowers users to navigate the complexities of the cryptocurrency market with confidence and clarity.\n\n\n\nCONTACT: Erin Gao Toobit erin.gao (at) toobit.com\n\n\n\n"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNWTJFQTBxRTdzSmtQNkRIRnNTVG9aTXQtMC10Z1pBM0lQQTlETTlaM2s5VlV2SUw3MFpFMGJHNHZSUlpLLUx5eXhfOXc0SGNLTm9Lb1FVcU1uNHRnWjlzWXpHM05aSFZMZjQyYWl0RmFOX1RWQ2VURFZYMDFZXzJPTWlheFdZU1RHQl84OFN6OHVMZHFsbXhSWWYtQTc3czZxeHVrVHd1a2pveDJrZHVETGtrbFllbzhaRmV1aEZqYXVUR0lHWHlxRdIBzgFBVV95cUxPQWxONkk3ODNwZFNnTS1qRDkzZENfU1pfX3BLT1NCYXNPMzI1YlJYZFdTMG96bHVnTXppQ0gzVVJiaUd6bVV1OWFSX3RrVTdRc1VfMGpQQ19fbHNsR2VtaTJoa0RFN3ZaajVrTU1PSXJPdmFnNm1KMk52RjlFam93c24taTZ4ajRDb1lqWk1mWnZRS1ZZZHJERHBxRzQ3ejJLVkRjZHE3WXE4TlFvQTREN29oQ2R0b19yZTR0dk90bUNvcldORUx1YnZleC0wUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Restaking 'Gold Rush' Spreads to Solana From Ethereum, With Jito and Others Joining In - CoinDesk",
        "content": "Restaking 'Gold Rush' Spreads to Solana From Ethereum, With Jito and Others Joining In\n\nThe race is on to build a dominant restaking protocol for Solana.\n\nBy Danny Nelson May 1, 2024 at 12:01 p.m. UTC"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPV2U1eWJiUEE3WTdWbHRvbGFiQVhYZjNhSEJNWkVVXzJhbU5Qb0VNcjh6OGZZX1IwWHRRa21kQ1ZIZmhXNTMwU3p5a2pnLWNPMWxITGxHQ19nQ0VadTFZNUFoZEtmcU5UTU54Y0RiTEpxSE9rT3dieFBkMVZlb3N1R3BkQjNWLXPSAY8BQVVfeXFMTmRuVUZSUUFNQm9SRHFRYm5FMFJhRlhWYldSNGl2bUMxOHp3dWVsNVVNODl4TE5yWnp0cmJDRHFITFlONkxROVZZbkktWlNpVW9mS2ViSmREQ0I2dEgzemk0MEFCRDZ3a0JNU2ZqVWVrMnpjVjZ0MHBIX18xOGhQeW12OV9KQWJ4MDRZQndWU0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "How Ethereum Founder Vitalik Buterin Keeps His Crypto Safe - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum founder Vitalik Buterin is advising people to \"decentralize your own security,\" after weighing in on a Twitter discussion about using cold wallets.\n\nTo prove his point, Buterin said that he keeps 90% of his crypto funds in a mutisig Safe wallet.\n\n\"M-of-N, some keys held by you (but not enough to block recovery), the rest held by other people you trust,\" he wrote. \"Don't reveal who those other people are, even to each other.\"\n\nThe \"m-of-n\" Buterin referred to describes one of the ways multisig, or multi-signature, wallets can be set up. The first variable refers to minimum number of signatures required to sign a contract, therefore spending or transferring funds from the wallet. The second variable refers to the total number of possible signatories that exist for the wallet.\n\nAD\n\nAD\n\nThe conversation started after a developer and research, who goes by the pseudonym 0xkofi on Twitter, urged crypto traders to think about how devastating it would be to lose all their funds and avoid it by investing in cold storage.\n\nThe above is why I use a multisig (@safe) for >90% of my personal funds 🙂 M-of-N, some keys held by you (but not enough to block recovery), the rest held by other people you trust. Don't reveal who those other people are, even to each other. Decentralize your own security. — vitalik.eth (@VitalikButerin) May 1, 2024\n\n\"Your hardware wallet will be your fortress of solitude,\" Kofi wrote. \"It will allow you to sleep peacefully at night. It will protect you so that you can survive this game long enough to win.\"\n\nBut not everyone is sold on that being the right way to protect their personal crypto stash. Peter Watts, Uneven Labs CEO and the founder of Reservoir, a developer platform for launching NFT collections, highlighted the risks involved in relying on hardware wallets.\n\nAD\n\nAD\n\n\"When using a hardware wallet, the biggest risk becomes yourself,\" he wrote, adding that someone might find a stashed private seed phrase, or a user could secure it so well that they can't retrieve it themselves.\n\nThat's when Buterin chimed in to describe how he makes sure that he isn't the single point of failure for the security of his cold storage wallet.\n\nPeople often think of @safe wallets as a team only solution. While this might have been true in early 2020, the user base has since evolved significantly. Today, individuals make up more than 99% of @safe users, including notable ones like @VitalikButerin and @punk6529 https://t.co/EyZuKpF2xa — Daniel (@danftz) May 1, 2024\n\nAlthough Safe (formerly Gnosis Safe) multisig wallets have often been treated as a product to help DAOs and other groups manage shared treasuries, there's a lot of individuals who use them in a similar way to Buterin.\n\n\"Today, individuals make up more than 99% of Safe users, including notable ones like Vitalik Buterin and Punk6529,\" wrote a SafeDAO contributor and delegate known as Daniel on Twitter.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOa3UxNnJEQXlKMUx5YXlzVkxkOFk2X2c4ejlJcExyTnF2Wl9FZVpJbWVhRzQxOFNpbS12ZUhIVm1mY3Q2TktsZ2phYVRpNWRVRHRxRkZSNHkwUHpCdnY2c1p5Tk0yeDJaUDBHWGhaZFhleV84YS1aRjk2UE96eHJ2QVZ5WEhLX2dE0gGQAUFVX3lxTE02VGpGUlJLUEV4TTZuLUlGb2xFMU43aFFHVDFvczVpTHVmVnlUemV0em5YYjhwa2tTMHVMUzVhcENjUjlrOWZQdjNfcFlwU1AzOFVLenlvblBqYVF1V2p4QmlrM0RkeE1UcU5MQVp6VHdyS0t3RkNQY3Q1WHRzZDlfU3JWeW5SSmlTYmxpcmsxSA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Redstone Network Launches to Power Fully On-Chain Ethereum Games - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nRedstone, a new Ethereum scaling network designed for fully on-chain games and “autonomous worlds,” launched its mainnet today—with a number of early games already available for play.\n\nDeveloped by Ethereum startup Lattice, Redstone was built via Optimism’s OP Stack scaling tech. But it’s much more than a rebranded riff on the layer-2 tech that also powers networks like Base and Zora—Redstone has been significantly retooled for the needs and demands of video games, particularly those that use blockchain for much more than asset ownership.\n\n“We've had core developers come along and make really cool contributions to the OP Stack,” Optimism co-founder Ben Jones told Decrypt’s GG. “This is the first [network] that’s not just tweaking dials a little bit.”\n\nMany crypto or “Web3” games utilize technologies like NFTs for unique user-owned items or cryptocurrencies for decentralized economies. But fully on-chain or autonomous games also put their game logic or rules on-chain, working within the capabilities but also limitations of the decentralized technology to power playable games.\n\nAD\n\nAD\n\n🔴🪨Today, we’re announcing Redstone, a super cost-effective L2 for onchain games, worlds, and other ambitious applications.@redstonexyz is a Plasma-inspired Alt-DA chain, built on the OP Stack.https://t.co/Rqnnhu5bmu — Lattice (@latticexyz) November 15, 2023\n\n“Most of the time, when you fully embrace the medium or the system you're building to, you tend to get more interesting results—and sometimes better harmonization—just purely from a product development perspective,” Lattice co-founder and CEO Justin Glibert told Decrypt’s GG.\n\nGlibert says his team has embraced this model of building entirely on Ethereum, a “computer that had to be multiplayer out of necessity, and not out of choice.” Following early experimental games like Dark Forest, zkDungeon, and OPCraft that his team created or helped build on other chains, they’ve designed Redstone to better suit such games—and it’s open to the public.\n\n🏁🔴🪨 Coming soon to Redstone Mainnet: @DFArchon. DF Archon is building DF Ares, community-run rounds of the beloved onchain game Dark Forest. They bring new flavor and new plugins to the classic DF gameplay! Get ready for May 1st. https://t.co/9Dn5e51hRj pic.twitter.com/A0nuusqhjw — Redstone Chain (@redstonexyz) April 23, 2024\n\nAD\n\nAD\n\nCertainly, crypto games can be built on layer-1 networks, as well as general-purpose layer-2 scaling networks. But fully on-chain games can be held back by the way those networks are typically designed. Games need low latency speeds, for example—and with such a constant flow of player inputs, they need to cut down on the friction of interacting with a blockchain.\n\nRedstone is built for just that, and it also features the first implementation of Plasma Mode, an alternative data availability protocol co-developed by Lattice and OP Labs. Plasma Mode allows for increased transaction throughput via an off-chain data availability provider, but also includes a permissionless Ethereum layer-1 feature that lets any user challenge suspicious inputs.\n\nIn short, Plasma Mode picks different kinds of design trade-offs to power games and other high-throughput decentralized apps, but also includes an on-chain capability to challenge potential threats. It’s inspired by the Plasma concept that Ethereum founder Vitalik Buterin co-authored back in 2017 (and recently shined a fresh light on), and will be available throughout the OP Stack going forward.\n\nThat’s paired with MUD, Lattice’s engine for on-chain Ethereum games. It’s being used by the studio’s own Sky Strife, a tactical strategy game in the vein of Nintendo’s classic Advance Wars that’s available to play today. Other Redstone launch games also use MUD, plus EVE Online developer CCP Games is using the engine for its Project Awakening game—though Glibert said that CCP has yet to choose a network for that project.\n\nAlong with Sky Strife, the initial lineup of Redstone games includes titles like Biomes, a Minecraft-like sandbox game; DF Ares, a community-driven revival of Dark Forest; and Downstream, which has been described both as an “infinitely moddable MMO” and the “world's first post-singularity civilization simulator.”\n\nA screenshot from Sky Strife. Image: Lattice\n\nOne of the more distinctive games on the launch list is DEAR, a game by ARPA that sounds like a cross between an abstract art project, a virtual pet simulator, and a crypto-fied social experiment. Or as an ARPA representative described it, “DEAR is a digital creature that transforms under the collective behavior of all players—a tug of war between two factions, whether you feed or abuse the creature.”\n\n“Experimental” is a fair term to describe most of what’s happening around Redstone and fully on-chain games. Some of the early games look far from mass-market in aesthetic and are built around new and unfamiliar concepts.\n\nThere are various benefits to being fully on-chain, Glibert said, such as the ability to easily deploy modifications to games and create new business models around existing games. Fully on-chain games (FOCGs) can’t be shut down or erased from existence like some Web2 games, while autonomous worlds (AWs) could yield new kinds of play mechanics and experiences.\n\nAD\n\nAD\n\nThis onchain game introduces an interplay of LOVE and HATE, with a PVP twist. DEAR gamer, DEAR is a creature that inhabits a dark, digital forest, with cellular components woven into smart contracts. DEAR exhibits purposeful behaviour and mimics essential human interactions,… pic.twitter.com/gRw2c5ucHc — ggQuest (@gg_quest_gg) April 24, 2024\n\nWhether there’s a business here, however, remains to be seen.\n\n“Most of the studios out there that have raised capital to build on-chain games—nobody knows if it's actually going to be a valuable market,” said Glibert. “I would say most of the people that are doing this seriously, they also don't know if there's actually a mature-enough business model today to do it.”\n\nBut they’re still building, attempting to push the edges of what’s possible on-chain.\n\n“There is a lot of noise of ‘how to monetize’ before a FOCG actually takes shape,” ARPA co-founder and CTO Majorknight told Decrypt’s GG. “Rushed monetization is the killer of innovation. At best, it creates one-hit-wonders like the play-to-earn games we have seen and doesn't have anything to do with making FOCGs, or improving the infrastructure.”\n\n“The world's first Post Singularity Civilisation Simulator”??? WTF is @DownstreamGame 👇 --- Downstream will launch on @redstonexyz mainnet on May 1st, together with the first @gg_quest_gg experiences --- ⚔️ Gameplay Downstream is an onchain world made up of hexagonal tiles… pic.twitter.com/hLcVmI92No — ggQuest (@gg_quest_gg) April 18, 2024\n\nMajorknight described the Lattice team as a team of “young, talented, and driven people who focus on building the infrastructure” for such games, further praising them for attempting to empower new types of on-chain games.\n\n“The original vision of FOCGs is to utilize risk-free and creative scenarios to test the possibility of new blockchain applications and push the boundary of the infrastructure, similar to the relationship between games and simulations in science/engineering and between games and GPUs,” they added. “Who else to collaborate with if not the team who coined the term FOCG/AWs and established this vision beyond the short-sighted monetization?”\n\nAD\n\nAD\n\nEdited by Stephen Graves"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFA4OFQ2dU5GZmlRMDJtUzZ6MFZIdG1MNTdDZVFNeHVjQ1NUcEtaYTdRdVVEREFfVm1sTFBmTk5mc0hLMzl4dHlBRnJFRGZPQTdXRHFnTlZ4Q3ZDS3U1TEU0R2p2V0NpUDkteG9NRl9NbHFuWEd0OFZScDBPX2lUd9IBgwFBVV95cUxPb2ttMHpJUVh2Vk9xLTVIVzVTYkwwMzgtY1ZYdjEta1BzZzNkUTIwekpOallqZ3AtZnhROFd2NVBxa0RpZkk5VlQyUTMyeGZPUkwtX2x0c1BCYU9LaEpWV180YkdQYjhPdTY2QnB5VFBNUVhzM2hraFJnRTVtZTF3NmJIdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Ethereum Price: Whale Dumps $6M ETH Amid Crypto Crash - CoinGape",
        "content": "Ethereum, the second-largest cryptocurrency by market cap in the last 24 hours, underwent a significant price drop of approximately 7.8%. This sharp decline has raised alarms among investors, particularly against the backdrop of widespread turbulence in the Ethereum market. The sudden downturn has prompted a thorough investigation into the factors driving this decline.\n\nEthereum Price Plunge Amid Whale Activity\n\nOf particular significance is the occurrence of a significant whale 0x035 offloading event involving 1,767 ETH, valued at approximately $5.4 million, which was transferred to the leading exchange Upbit. This substantial movement of Ethereum tokens by a single entity has further fueled bearish sentiments within the market, exacerbating uncertainties surrounding Ethereum’s future price trajectory.\n\nadvertisement\n\nMoreover, data from on-chain trackers has shed light on the substantial whale activity surrounding Ethereum, particularly within the past few hours leading up to the price plunge. The transfer of 1,767 ETH to Upbit a centralized exchanges (CEX) shows the scale of whale involvement in Ethereum’s market dynamics. Notably, Whale Alert’s data confirms the magnitude of this transaction, emphasizing the significant value transferred to Upbit.\n\nThese recent developments, marked by Ethereum selloffs and heightened whale activity, have intensified concerns among investors regarding Ethereum’s short-term outlook. The phenomenon of whales capitalizing on profit opportunities amid the absence of a post-halving rally has further contributed to the prevailing sentiment of caution within the Ethereum community. Additionally, regulatory uncertainties surrounding Ethereum’s classification as a security have added an additional layer of apprehension, amplifying the overall market volatility and reinforcing the need for vigilance among market participants.\n\nAlso Read: Possible Outcomes of FOMC Meeting, How Would Bitcoin And Crypto Market React?\n\nEthereum Market Analysis and Insights\n\nAgainst the backdrop of Ethereum’s recent price decline and heightened market volatility, a comprehensive analysis of its current market dynamics offers valuable insights into its ongoing performance and future prospects. At present, Ethereum’s price stands at $2,904, reflecting a significant 7.8% decrease over the past 24 hours, indicative of the mixed sentiments prevailing within the market.\n\nFurther examination of derivatives data reveals an 8.30% decrease in ETH’s open interest and it is currently valued at $7.6 Billion. This decline in open interest highlights the evolving nature of Ethereum’s market dynamics and the potential impact on investor sentiment and trading activity.\n\nDespite these challenges, TRON founder Justin Sun’s accumulation of significant amounts of ETH signals confidence in Ethereum’s future potential and may serve as a catalyst for renewed investor interest in the token.\n\nMoreover, Ethereum’s median gas fee has reached its lowest point in three years, standing at 6.43 gwei as of April 27. This notable decline in gas prices offers potential relief for users, particularly amidst ongoing concerns regarding high transaction fees on the Ethereum network.\n\nAlso Read: Bitcoin ETF Outflows Jump to $161 Million Ahead of FOMC\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQX0JGR0trYklPT0hjZDJ2amZQOUdVOGpEaUtkUUZ1dnlXMXNhSFM1aXd1QTB4ZVpMR1B5WmZDc0lkb29MallCdUE4bHpsMUhfNlV6MnVoMEg0OU9lZUx6Z1U2a1Nvck5hZVc5ZFhILTBHWWIxcmE1VExyaE1HNnlMbk5QVkxLaXRBYlp3V0JmcnFfMzFyV2Nj0gGcAUFVX3lxTE9PT2R4TmpKMmszVmVyWWpBYmxEODFjeFdDV293X09wOGtDMWU2ajE0NDA2ai1qLUFiTWNLRkRKX01tdmhBM3JOU2lIZXpodzgxMlZWWW1fVjlKOGNWV2hwaTZzLV8wcVU5OWN6cVE0OEtGMzZUQk1EUEZ4NGVQOW1WRk9NN3Zyd1RCWFFzSDFRQnNQWHNrYjRJeTdTcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "What Historical Trends Hint for Ethereum Price Behavior in May? - CoinGape",
        "content": "Amid the broader market correction, the Ethereum coin witnessed a three-day losing streak with its price falling from $3286 to $2888 accounting for 12%. The recent fall backed by increasing volume hints at the sellers’ conviction to lead the asset value lower as BTC goes Sub-60K. However, an analysis of the daily chart shows the correction still holds above a healthy retracement level and keeps the bullish pattern intact for a potential reversal.\n\n\n\nAlso Read: Vitalik Buterin Warns Against Hardware Wallets, Proffers Alternative\n\nadvertisement\n\nEthereum’s Falling Wedge Hints a Silver Lining in the Bearish Cloud\n\nIn the past seven weeks, the Ethereum price has shown a textbook example of a downtrend with new lower highs and lows in the daily chart. This price swing connected with downsloping trendlines reveals a falling wedge pattern which is a bullish continuation setup often spotted in an established uptrend.\n\nUnder the influence of this pattern, the ETH price plunged from a $4084 high to its current trading price of $2899, registering a 30% fall. If the broader market selling persists, this altcoin may fall another 6% to hit a lower trendline at $2700.\n\nThe aforementioned level coinciding with the 50% retracement level and 200-day EMA slope created a high demand zone for buyers to counterattack. The renewed demand pressure at $2700 will indicate an initiate sign of local bottom formation.\n\nHowever, the buyers would need an upside breakout from the wedge pattern to develop a renewed recovery trend.\n\nAlso Read: ETH Futures ETF Issuers Stay Positive on SEC Approval Despite Feud\n\nHistorical Returns Hints Ethereum Price Recovery In May\n\nEthereum’s historical performance in May shows significant volatility with a mixture of substantial gains and losses over the years. So far In May 2024, the asset saw a modest decrease of -3.79%, while in 2023 a slight increase of +0.16%. Notably, May 2022 experienced a sharp decline of -28.84%.\n\nIn contrast, May 2017 and 2019 saw impressive surges of +161.43% and +56.65% respectively, highlighting the potential for high returns despite overall instability. Furthermore, the ETH price witnessed losses in years like 2018 and 2021, which posted -13.96% and -2.31% respectively.\n\nHowever, the average gain of +23.66% suggests a higher potential for Ethereum to rebound and keep a bullish outlook this month.\n\nTechnical Indicator\n\nAverage Directional Index: The ADX slope uptick near 23% indicates the sellers are gaining momentum for a prolonged downfall.\n\nExponential Moving Average: The ETH price trading above the 200-day EMA slope accentuates the broader market sentiment remains positive.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNLUt2YzJfUG1EcGZwZW0zVmJpbHJsMVlVa3VhNzEwbkZteWNSR0pVYnd2cHJCNjlDb1FqVEtoTTVlSnlZWU1GRjE0UWVuSVdxbTdseDBoanc4aHJWNHNkVW81VHp3ZzFvcFliU2lMdEl2eGtEbUdTek5NT0tndEgyazhUdFhQejRZMWVGYXRLSjJlZGlpTGZmNm8wbk1nRGlNZ0U2RlNka1k0YnpvbGtGY0pUQjNNV1d3OHNuTlA4SUh3eEZqQVhPM1dKWFBOUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Analysis of the price of Bitcoin and Ethereum: perspectives in the context of a changing market - The Cryptonomist",
        "content": "The cryptocurrency market, represented mainly by Bitcoin (BTC) and Ethereum (ETH), is facing new challenges arising from global macroeconomic conditions, here is a price analysis.\n\nThe unexpected increase in the Consumer Price Index (CPI) in the United States in April and the decline in GDP in the first quarter reflect an evolving financial context that could negatively impact the price of major cryptocurrencies.\n\nImpact of Global Liquidity Tightening on the Analysis of Bitcoin and Ethereum Prices\n\nRyan Lee, analyst at Bitget, highlights that the global liquidity squeeze could have a significant impact on the performance of BTC and ETH in the month of May.\n\nWith the reduction of the FED’s net liquidity, the market expects an average performance for Bitcoin and Ethereum.\n\n“Looking at the options market, the implied volatility of BTC and ETH has dropped from highs of 78% in April to around 58%, with a more significant reduction for options expiring at the end of May,”\n\nobserve Lee.\n\nThis indicates that options market traders predict a low probability of a significant turnaround in the next month.\n\nWhile interest rates in the USA continue to rise, suppressing demand in the real estate sector and showing a direct influence on existing home sales, the cryptocurrency market is feeling this pressure.\n\nLee predicts a possible correction for BTC and ETH in May, followed by a volatile recovery.\n\nAccording to the analyst, BTC could fluctuate between $56,000 and $68,000, while ETH, influenced by events such as the launch of ETFs on Ethereum, could show greater volatility, fluctuating between $2,600 and $3,600.\n\nOther experts in the field share similar opinions, but with variations in short-term expectations. Edward Moya, senior analyst at OANDA, comments that “the strength of the US dollar and the increase in interest rates could continue to put pressure on cryptocurrencies, which traditionally benefit from a high liquidity environment.”\n\nThe Influence of Macroeconomic Conditions on Cryptocurrencies\n\nThe behavior of cryptocurrencies in a climate of rising interest rates and a strong dollar raises significant questions about their role as “safe haven” assets. Traditionally, assets like gold have been preferred by investors during periods of economic uncertainty.\n\nHowever, with the evolution of the global financial context, cryptocurrencies have also started to be perceived as possible alternatives. “Cryptocurrencies have shown remarkable resilience in times of economic turbulence, which could strengthen their appeal as an alternative investment in times of uncertainty,” notes Jennifer Liu, market analyst at CoinDesk.\n\nThis point of view is supported by a growing acceptance of cryptocurrencies in various economic sectors, increasing their legitimacy and potential for stability.\n\nLooking to the future, technological innovation in the field of blockchain and cryptocurrencies continues to play a crucial role.\n\nWith the introduction of new features, such as improving the energy efficiency of mining operations and developing more user-friendly platforms, cryptocurrencies are trying to overcome some of the main critical issues that limit their adoption on a large scale. “The technological aspect cannot be underestimated,” says Alex Kuptsikevich, financial analyst at FxPro.\n\n“Innovations such as Ethereum’s transition to Proof-of-Stake are indicators of the potential of these technologies not only as speculative assets, but as long-term sustainable solutions to various global problems.”\n\nWith these ongoing developments, investors are encouraged to stay informed and proactive. Market conditions can change rapidly, and having a deep understanding of both economic dynamics and technological innovations can provide a significant advantage.\n\nIn conclusion, while macroeconomic challenges pose uncertainties, the adaptability and advancement of cryptocurrencies offer a window into a future where they can emerge as pillars of a new financial paradigm."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi8gFBVV95cUxQM3NybG80RTQyaFgyaDE5aGdudXhVUXVzdjAyR2szdUtIa0w2dlRGVFR2cE1LMTR3UzZ5NWU5ckV1OFRzQ3ZkQ3U1aXpyc0t6R2xJcEhpa09sRjlzLUtOQi1QR2s0ZmpMbDU5YjRsSnVQMENuYzFQNnRqOWdZWTNmMkExWm5tbXlJQmJqS1NnWTBiRVZvSjVZbnA1aEhHQlJlXzdKUmFiem9tU1kwa0xQTGZqWEowUm5UbjRLNmFuZHptUkpDVFVMT1BjNm05VFdaOGdTeDVPMUM3aHdfNlVQQjhWR3diZFZkLVQ4SGtUdUJpUdIB9wFBVV95cUxOdzl2MXJYOTRTMEZJNjRLYjhuVDFHSzRSb3Y1VHBldGk0bjhXQURtSjlOLUhXQzNVM01jbmJpUlpTYldYNmRZeTdYSVczUGJHQVQ5dWZnLThiNzhrY2NWUVNyRHM5OTFtSjhJVGdBemtseDlEdW80RnBnTTIxdUkzYUZNLUJkOHZXaDE1OTVpeVhrNVY1UTZmTWhIUHdwald6V1NHUzJOSkR5ZFQ3SXFvN3BsZFFjVXVjdXN3b1I1WnZ2NW1EZ1BJREU1UmhISHUwMmtwLXpjV0lDczZGaEhDLTlVQVlJd0RQVkpBLXB5VDgxbGdzUHlj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Raboo Steals Spotlight Amid Ethereum & Solana Downturn: Which Crypto to Buy Now? - Atalayar EN",
        "content": "Amidst the downturn of Ethereum and Solana, Raboo emerges as a compelling option for investors. With a token presale now in its third stage at $0.0042 and a projected 100x surge in 2024, Raboo is poised to disrupt the market. As investors ponder which crypto to buy, Raboo's potential for exponential growth steals the spotlight in the turbulent cryptocurrency landscape.\n\nRaboo: Emerging Powerhouse Amid Ethereum & Solana Downturn\n\nRaboo is captivating the cryptocurrency market with its remarkable progress and innovative features. As it passed the $1 million raised mark, Raboo boasts over 5,200 registered members and 1,800 token holders, signifying widespread interest and trust.\n\nThe exclusive NFT launch for presale token holders adds allure, offering potential rewards and perks. Its integration of social-fi and artificial intelligence elements creates a dynamic platform for meme enthusiasts, fostering engagement and community participation.\n\nWith a fully audited contract on the Ethereum blockchain, Raboo demonstrates its commitment to reliability and security, instilling greater confidence among investors. This meticulous auditing process ensures that the token's smart contract functions as intended, mitigating the risk of vulnerabilities or exploits.\n\nBy prioritizing security, Raboo provides investors with assurance regarding the integrity of their investments, fostering a conducive environment for participation in its ecosystem. This emphasis on transparency and risk mitigation not only strengthens investor trust but also positions Raboo as a trustworthy and dependable platform within the volatile cryptocurrency market.\n\nEthereum: Benefits, Challenges, and Future Outlook\n\nOne benefit of Ethereum is its robust ecosystem, offering a platform for decentralized applications (DApps) and smart contracts, fostering innovation and development in the blockchain space.\n\nEthereum's scalability challenges are primarily manifested in network congestion and high gas fees during periods of peak usage. Network congestion occurs when there is a surge in transactions, leading to delays in processing and confirmation times.\n\nAs a result, users experience slower transaction speeds and higher fees when prioritizing their transactions. Additionally, high gas fees, which are required to execute transactions and smart contracts on the Ethereum network, can become prohibitively expensive during peak periods, especially for smaller transactions.\n\nAdditionally, Ethereum's transition to Ethereum 2.0, aimed at addressing scalability issues through the implementation of proof-of-stake consensus and sharding, has faced delays and uncertainties, leading to concerns about the network's ability to handle growing demand and competition from alternative blockchain platforms.\n\nSolana: Advantages, Price Predictions, and Fluctuations\n\nOne benefit of Solana is its high throughput and low transaction fees, making it ideal for decentralized applications requiring fast and cost-effective transactions. However, Solana's price can be volatile, influenced by factors like network performance, market demand, and competition.\n\nDespite fluctuations, analysts predict continued growth potential for the Solana price as it establishes itself as a leading blockchain platform.\n\nHowever, investors should remain cautious due to the inherent volatility of the cryptocurrency market and conduct thorough research before making investment decisions related to Solana price fluctuations.\n\nConclusion\n\nAs Raboo steals the spotlight amidst Ethereum and Solana downturns, its unique features like NFT launches, AI meme integration, and an audited Ethereum contract make it a standout choice. With its potential for massive growth and community engagement, Raboo emerges as a leader for those wondering which crypto to buy in the current market.\n\nYou can participate in the Raboo presale here."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNcTJtWVRpVW9FdW5ETEgyNXFNS3NwT2JXQ0x1bDNPSzhHVXE5S0kyTzNNckIwaGZ0cHFCOGNvcnpoaXdZYVFCTzdGeTN5RlJteWJ5VE5UUkpsRWFNRVFBMzRveU9hdThjUGkzNThnWThaWk9KQTJzeGdBWUhEMFlpR2xxOFdLZS1EUDVZcDl3UlBfVDdQejEtRF9LbURHMTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin Layer 2s Aim to Attract Ethereum-Like Dapps. Will They Succeed? - Unchained",
        "content": "Episode 638\n\nBuild on Bitcoin (BOB), Botanix, and Citrea plan to bring DeFi, perps, stablecoins, and much more to the Bitcoin ecosystem. Here’s how.\n\nListen to the episode on Apple Podcasts, Spotify, Pods, Fountain, Overcast, Podcast Addict, Pocket Casts, Castbox, Google Podcasts, Amazon Music, or on your favorite podcast platform.\n\nIn this episode of Unchained, host Laura interviews Alexei Zamyatin, co-founder of Build on Bitcoin, Willem Schroé, founder of Botanix Labs, and Orkun Kılıç, co-founder of Chainway Labs. They discuss their respective projects, all of which are focused on developing Layer 2 solutions for Bitcoin.\n\nZamyatin’s Build on Bitcoin is a hybrid Layer 2 that connects to both Bitcoin and Ethereum, aiming to bring innovation back to the Bitcoin ecosystem. Schroé’s Botanix Labs is developing a decentralized Layer 2 solution using the ‘Spiderchain,’ which uses a series of multi-signature wallets to secure the chain. Kılıç’s Chainway Labs is building Citrea, a zk-Rollup on Bitcoin that aims to create a Bitcoin-backed economy.\n\nAll three projects are in various stages of development and testing, with BOB’s mainnet launch expected shortly.\n\nShow highlights:\n\nIntroduction to Build on Bitcoin (BOB), Botanix, and Citrea: How they aim to innovate and expand Bitcoin’s capabilities, including their architectural designs that integrate Ethereum users and work toward decentralization and trustlessness\n\nSecurity Aspects and Integration Strategies: What the security risks associated with BOB, Botanix, and Citrea are, and strategies to enhance decentralization over time\n\nHow these Layer 2s influence Bitcoin fees, and how Botanix’s integration can leverage the Bitcoin ecosystem, with insights on the potential of Layer 3s and zk-rollups to transform Bitcoin’s utility and fee dynamics\n\nHow these projects aim to attract Ethereum users and developers, and the reasons why this may be an attractive opportunity for them\n\nHow Runes, Ordinals, and BRC-20s operate on Citrea, Botanix, and BOB\n\nHow Bitcoin is always a derivative when it’s not in its Layer 1 and the pros and cons of different bridging solutions\n\nThe concept of forward secrecy and how it can help improve security in blockchains\n\nWhy Willem believes that Layer 3s are possible and bullish for Bitcoin\n\nHow “merged mining” resembles Ethereum’s restaking and why it’s positive for Bitcoin\n\nThank you to our sponsors!\n\nGuests:\n\nWillem Schroé, founder of Botanix Labs\n\nOrkun Kılıç, cofounder and CEO of Chainway Labs\n\nAlexei Zamyatin, cofounder of Build on Bitcoin\n\nLinks\n\nRecent coverage on Unchained of Bitcoin L2s: Stacks’ Muneeb Ali On Why Bitcoin Is Exciting Once Again\n\n\n\nBuild on Bitcoin\n\nCitrea\n\nBotanix\n\nLearn More:"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9aSnl6Tjdzc2NNVkhJbG9nTVFWRUxUU1JMbDJWN1RmZXc1TnExMjVhYTZ2TzNkanJXQW5fdnNiNkZkcVR5aHRwUUhEOE95cXM5QTFFbnJVYm00aU83RWthVHJjZGQzR1Nkbmp1VnV2dHktZXhrZ0lJbXV0LWk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Solana and Ethereum Smart Contract Audits Explained - LCX",
        "content": "Ethereum Smart Contract Security Audit\n\nEthereum, the pioneer of smart contract platforms, has been the go-to choice for decentralized applications (DApps) and smart contracts for several years. However, its success has also made it a prime target for attackers. Here are some key points to consider regarding Ethereum smart contract security audits:\n\nSolidity Language: Ethereum smart contracts are typically written in Solidity, a specialized programming language. Solidity has a rich set of tools and libraries for developers, but it can be prone to vulnerabilities, such as reentrancy attacks and integer overflow.\n\nOpenZeppelin: OpenZeppelin, a popular open-source framework, provides standardized contracts and libraries to help developers build secure Ethereum smart contracts. These pre-audited components reduce the risk of coding errors.\n\nAuditing Firms: Ethereum smart contracts are often audited by specialized firms that focus on blockchain security. These audits help identify vulnerabilities and suggest fixes before deployment.\n\nDecentralized Autonomous Organizations (DAOs): Ethereum is home to numerous DAOs, which are organizations governed by smart contracts. DAO security has been a major concern, as vulnerabilities in these contracts can lead to large-scale theft.\n\nEthereum 2.0: The transition to Ethereum 2.0, which includes a shift to a proof-of-stake consensus mechanism, is expected to enhance security and scalability.\n\nHow Does an Ethereum Smart Contract Audit Work?\n\nThe finest security companies will subject their code to stress tests to determine how it performs in a variety of situations. According to experts, it is essential for a project to provide a comprehensive and explicit technical specification and, ideally, documentation of the deployment process.\n\nThese audits aim not only to identify vulnerabilities that black hat hackers could exploit but also defects that could prevent an Ethereum smart contract from functioning properly. The attack vectors under investigation can become quite technical, but they include replay attacks, in which malignant actors repeatedly transmit valid data in order to conduct fraudulent activities. Other attacks include reentrancy, reordering, and brief address attacks.\n\nOnce an investigation has been completed, crypto projects receive a detailed report of the vulnerabilities within their code, along with recommendations on how to mitigate their impact or eradicate them altogether. Therefore, the resources conserved by an effective audit can significantly outweigh the cost. Moreover, it can prevent reputational injury.\n\nSolana Smart Contract Security Audit\n\nSolana, a newer entrant in the blockchain space, has gained popularity for its high-speed and low-cost transactions. When it comes to Solana smart contract security audits, here are some key considerations:\n\nRust Programming Language: Solana smart contracts are typically written in Rust, a programming language known for its safety features. Rust’s memory safety and other design choices reduce the risk of common vulnerabilities.\n\nProgram Library: Solana provides a standard library for writing smart contracts, which includes built-in functions to ensure security. This library encourages best practices in contract development.\n\nProgram Analysis Tools: Solana offers various program analysis tools and a developer-friendly environment, making it easier for developers to identify and fix issues.\n\nCommunity Auditing: The Solana community actively participates in auditing smart contracts. While this approach may lack the formality of third-party audits, it fosters a collaborative environment focused on security.\n\nInteroperability: Solana’s interoperability with other blockchains and its support for cross-chain communication introduce new security challenges that need careful consideration.\n\nAre Solana Smart Contract Audits Different?\n\nAudits of smart contracts will vary marginally based on the blockchain code they are based on. Common security flaws in Solana can include omitted ownership checks, allowing attackers to circumvent access controls using spoofed configurations.\n\nAnd while smart contracts can call functions from external smart contracts, validation failures may allow black hat hackers to inject malicious inputs that influence the operation of the code. Top auditing firms will evaluate a Solana smart contract based on the quality of its documentation, security, architecture, and code. Additionally, vulnerabilities are designated severity levels, allowing business-critical issues to be addressed first.\n\nHow Do Smart Contract Audits Benefit Crypto Projects?\n\nAudits are essential for ironing out any bugs in a crypto project and ensuring that the code is suitable for widespread use. In 78 incidents during the first quarter of 2022 alone, hackers stole $1.33 billion; two-thirds of these attacks were on the Ethereum and Solana blockchains. But how could a smart contract audit have assisted them?\n\nWell, common causes include crypto initiatives that prioritize speed over a comprehensive audit from a reputable service provider. They may also rely on internal teams to conduct security reviews. While this appears fiscally prudent, there is a risk that internal personnel are not up to date on the most recent cyber techniques used by malicious actors. Unavoidably, some will also believe that they are invincible. But complacency is the greatest enemy in the crypto space, and even the best initiatives can be hacked.\n\nHow Much Do Smart Contract Audits Cost?\n\nThe cost depends on how complex the smart contract is. According to Hacken, this can increase to $500,000 for larger initiatives with more lines of code, not to mention the additional engineering hours required. The company contends that these expenses pale in contrast to the economic harm that a smart contract vulnerability can cause.\n\nAnd here’s how smart contract audits can make a difference: an audit uncovered at least one critical bug in 80% of initiatives. However, according to Hacken, only 75% of organizations have completely acted on an audit report in the past, with the remainder ignoring the conclusions or considering only a small number of recommendations. As a consequence, their security score was lower.\n\nHow Long Do Smart Contract Audits Take?\n\nIt is a process that requires several weeks, depending on the speed at which a crypto project operates. Initial audits typically take between 2 and 14 days, depending on the complexity and scale of a smart contract. These investigations can be expedited if necessary. Again, larger protocols may take longer, up to 30 days in some instances.\n\nDo Smart Contract Audits Improve Crypto’s Image?\n\nBlockchain technology is becoming a bigger part of all our lives — and auditors ensure that crypto initiatives put their best foot forward. Improving the quality of smart contracts reduces negative press coverage of significant hacks and enhances the reputation of crypto projects in the eyes of the public.\n\nConclusion\n\nBoth Solana and Ethereum offer unique approaches to smart contract security. Ethereum, with its longer history, has established formalized auditing processes and a robust ecosystem of tools and libraries. On the other hand, Solana’s emphasis on safety through the Rust programming language and community engagement is a promising step towards ensuring secure smart contracts.\n\nIn the ever-evolving landscape of blockchain technology, security remains a top priority. Developers and organizations must carefully consider the trade-offs and security features of each platform when choosing where to deploy their smart contracts. As both Solana and Ethereum continue to evolve, the blockchain community can look forward to even more robust security measures and best practices for smart contracts.\n\nIn conclusion, the security of smart contracts is an ongoing concern, and it’s essential for blockchain developers and organizations to stay vigilant, adopt best practices, and adapt to the changing landscape of blockchain security to protect valuable assets and ensure the trust of users and investors."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQTnAyV01OSFZBcTdCYVBLdlNDdThvMDFSa19YODBBdktCVWVucWFvWUlRcWhPZDVKQTIwMU5iMDhpQVlhbUt0MnpNeXRYcVREa1hsT0VIMDZ5VWw3cEJ4QUtzVi1mU3ZSOFIzOTBubG50U3loeEFRN21fQjllRXJIYnNzQkdnWWd3SEHSAY8BQVVfeXFMT1Q2QlBfSVpsTWxzYTA5cjE3OUREYnNlZ2dNSEQzMzlKLWU2NlJtT0hBaE11YzdaVFBiQWNJY2pYelVTbklEMThOaF8waVFFVHhMeU1aWmFudjEzeUs1NVpmU1pCUVVvZDhmVHhrVGR0TU5nN0ZkX1loM0lpeFFXNURZdlo3eGNuS0xDRDFmSWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Ethereum price’s $3360 rejection – Blame profit-taking or… - AMBCrypto News",
        "content": "Ethereum saw two sizeable waves of profit-taking in the past month that projected doubts about an upcoming rally.\n\nThe ETH whales have added to their stash, with retail being keen to sell.\n\nEthereum [ETH] saw a rejection from the $3360 resistance level over the weekend. This outlined short-term bearish sentiment.\n\nIn other news, the latest Dencun upgrade was a success, helping L2 solutions reach low gas fees.\n\nThe next target for the developers is called Prague. Even though hopeful news was breaking, on-chain metrics showed a lack of faith from market participants.\n\nThe clues from the Ethereum supply distribution\n\nAMBCrypto’s analysis of the supply distribution showed that almost every wallet holding anywhere from 1 to 100k ETH has been selling in recent months.\n\nThe micro wallets with under 0.1 Ethereum were the ones buying, hopeful of a rally after Bitcoin’s [BTC] halving.\n\nIn the past, when the 100k-1 million token holder cohort was added to their stash, it came during a market rally. Sometimes it preceded a major retracement, like it did in mid-January.\n\nThe second half of April saw this cohort quiet down, neither adding to nor selling their supply.\n\nThe 1 million- 10 million cohort saw a sharp uptick in early March. Since then, they too have been quiet. Together, it showed that the large participants expected bullish sentiment in the coming months.\n\nA sharp spike in the 100k- 1 million holders’ supply could be useful for traders to mark local tops and imminent retracements.\n\nDoes fear still rule the market?\n\nThe network realized profit/loss (NRPL) grows during periods of swift price appreciation as profits pile up. The first two weeks of March saw strong price rallies alongside NRPL spikes.\n\nThis indicated profit-taking activity.\n\nHowever, the NRPL has trended downward since then. It saw occasional spikes, such as in late March and mid-April, each smaller than the last.\n\nThis showed participants were keen on booking profits even though the price was just above the $3k support zone.\n\nIt indicated a lack of faith, which is part of the extended retracement Ethereum has witnessed in the past two months.\n\nOn the other hand, the mean dollar invested age (MDIA) has trended strongly higher in the past month. This metric shows that the asset is in an accumulation phase once again.\n\nIt fell sharply during the rally to indicate holders were realizing profits en masse.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nIn the past month, the HOLDer sentiment has been stronger than the collective urge to book profits.\n\nIn conclusion, the metrics showed both fear and hope were present in the market, but long-term investors have more reason to hold on than to sell."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNamRRcGh1VzBudjFmQ09MSy1OWExfMXpwTUotTlFPektJdzdaQ3Z0MFR1bWZad2lGVVVjdElBRDBBUWx5RE9uVjJ5cUk0YmdMY3J5T0N1LW5CVkRIcmJTNEVfWm9nZDZnM0ZqVEJYYy1hOWhoSGZ4YkNwZmZ3MjFfSjdGZVLSAYwBQVVfeXFMTzVBaWpuNHNaZkZaWFBrYU9lOFBCTk9jdk40ZnB6TVRvOVNYWXhWMFktamYtalJ5QUlxdHNqbG9yYUtLZFdVY3lNS1ZZMm9JVUNtVk5GVV9BSUF5bmhIWlpobUY5NTREdnJLaFdTWUdycjFIY2p4VWtCdmhfSE03MndZckZLaXo4QWVWZUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong's Bitcoin and Ethereum ETFs a 'Message From China': OSL CEO - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter Hong Kong’s spot Bitcoin and Ethereum ETFs had a relatively successful first day of trading compared to crypto futures ETFs, some crypto industry observers believed it would send a message to China and across Asia. However, the CEO of OSL—the sub-custodian for the ChinaAMC and Harvest Global ETFs—believes this framing is wrong.\n\n“Some may view this as a message ‘to’ mainland China,” OSL CEO and Chairman of the Board Patrick Pan told Decrypt. “I think this is more a message ‘from’ China for all to see.”\n\nDue to Hong Kong's status as a Special Administrative Region controlled by China—which has been called a “testing ground” for China—the passing of spot crypto ETFs was likely influenced by the mainland. “Nothing happens in Hong Kong without China's blessing—not even a raindrop,” veteran analyst Markus Thielen told Decrypt earlier this month.\n\n“The successful launch of the spot Bitcoin and Ethereum ETFs in Hong Kong says a lot about Hong Kong,” Pan added, “and its critical role as the gateway to mainland China.”\n\nAD\n\nAD\n\nDespite this, mainland Chinese investors cannot currently invest in the fund. This is because Hong Kong ETFs must be listed for at least six months before they’re added to the Shanghai Stock Exchange’s southbound stock connect—a program that allows mainland China investors to access Hong Kong assets.\n\nChina has a long and rocky history with cryptocurrencies, effectively banning crypto multiple times. So access to crypto ETFs in Hong Kong could be a rare route for investors from mainland China to access crypto.\n\n“The regulatory policy in mainland China since 2021 has been quite clear on the position of crypto asset businesses and trading in the mainland.” Pan told Decrypt, “But it has not slowed down the development and maturity of the regulated digital asset sector in Hong Kong—not one bit.”\n\nSince OSL’s first spot ETF application, it only took four months for the ETF to be approved and start trading. This is a stark difference to the lengthy process in the United States, spanning nearly 10 years from the first application to the eventual approval of several spot Bitcoin ETFs.\n\nAD\n\nAD\n\n“In a space of four months, we have gone from zero to listing highly sophisticated digital financial products in one of the world’s top stock exchanges,” Pan explained. “The blueprint for even broader and deeper digital asset product adoption across [Asia] has just been written for all to see.”\n\nOSL believes the $11 million trading volume for Hong Kong ETFs on its debut day is a “promising start,” and said that the firm is “encouraged” by the initial investor interest.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNUDNiTzVuS0RDZ2UxaS1vazV2WHprOUJrU1ZYdTRjcWVkWHdRblBWZUQ5Njlxc1FfZHNHVWhZY3czNWNSeUdFM1R0OVpDbndUa2otYkIzT25jRHU4dDU1R2tZQ2g0b0lOVk5DZjFoQTJEYllWTkVwMzhEUUl4MU8wemkxNGhIWlV5UHBUZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "MAOCAT Launches First Presale on Ethereum for Cat-Based Memecoin - Yahoo Finance",
        "content": "Maocat\n\nMAOCAT is a new Ethereum cat memecoin that is quickly gaining popularity.\n\nHong Kong, April 30, 2024 (GLOBE NEWSWIRE) -- The MAOCAT team recently launched the presale phase for their cat-based memecoin, a total debut on the Ethereum blockchain. Feline crypto enthusiasts now have a golden opportunity to join this cool new project.\n\nAfter years of dog-themed memes market domination, MAOCAT wants to shake things up and give cats the spotlight they deserve. Becoming a proud MAOCAT holder is as easy as connecting a hot wallet and purchasing tokens on the presale page.\n\nA Golden Opportunity for Feline Crypto Fans\n\nThe MAOCAT's presale presents a new opportunity for feline crypto enthusiasts. The operation has already managed to sell over half of its planned tokens. This leaves an exciting prospect for investors to purchase the remaining MAOCAT tokens.\n\nIn Phase 1, the starting price of the token is $0.0015, but it will gradually increase to $0.003, phase after phase. With a total supply of 5,000,000,000 tokens, the presale allocation is 60% of this amount.\n\nIn terms of taxation structure, the MAOCAT project has a clear system in place. With a 3% marketing tax, 3% LP tax, and 2% development tax, there are no buy and sell taxes. In terms of rewards, users can benefit from staking rewards, NFT token compensation, governance participation, and transaction fee payments.\n\nIt is also worth mentioning that the project features four pillars within its ecosystem:\n\nAn NFT collection of 10,000 unique MAO CAT NFTs\n\nAn NFT marketplace on the Ethereum blockchain\n\nA decentralized exchange (DEX) called MAO SWAP for DeFi 2.0 solutions\n\nA gaming platform for users to enjoy and earn rewards using $MAO tokens\n\nIn this context, MAO tokens will serve as the primary utility tokens for all these ecosystems. This means that MAO will effectively be the core asset for this community.\n\nHow to Become a Proud MAOCAT Holder\n\nBuying MAO tokens is straightforward. To start, traders must have a compatible cryptocurrency wallet that supports ERC-20 tokens. MetaMask is a popular option. Once the wallet is ready, users can access the MAOCAT presale platform through its official website.\n\nOnce on the platform, users must connect their wallets to enable transactions. From there, they can purchase MAOCAT tokens by selecting their desired amount and following the instructions to confirm the transaction.\n\nAs the team's 3-stage roadmap shows, this project is only getting started. In short, the team will continue to launch various features and initiatives to develop the MAOCAT ecosystem further. This includes the launch of the Mao cat game, 10,000 NFTs, and an NFT marketplace on platforms like Opensea.\n\nStory continues\n\nAbout MAOCAT\n\nMAOCAT is a new Ethereum cat memecoin that is quickly gaining popularity. Thanks to its ecosystem (featuring four subprojects), MAOCAT is drawing in an increasing number of holders. After a long list of successful dog-based memecoins, the team is launching cats into the spotlight on the Ethereum network.\n\nMAOCAT offers an advanced staking program where participants can earn rewards in $MAO tokens at a dynamic rate over time. This incentivizes holders to keep their tokens and encourages new users to join in and stake their tokens.\n\nThe MAOCAT presale is ongoing and allows anyone with an ERC-20 wallet to participate. By reserving $MAO tokens through the purchase window, crypto fans can become early investors in this promising project.\n\nAnyone wishing to learn more about MAOCAT can easily refer to the project's website and whitepaper. The social pages at the bottom let users stay up-to-date on MAOCAT's news and developments.\n\nX (Twitter) | Telegram | Instagram | YouTube\n\n\n\n\n\nDisclaimer: This is a press release and does not contain any financial advice. Readers should do their own research before taking any actions related to the company mentioned. You are solely responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. Cryptocurrency is volatile.\n\nCONTACT: James L. team (at) maocatcoin.org\n\n\n\n"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNT0dIQ0lKQkxjSHBacXNCNGdTT3ZBM2YybDFTMmVsSEZnVzJ3bjlfWjFtV0FDU211TDBuOUlheGFTUWF6UGdZX1V5UWREbkU3blJZUFUyLW9yNjJDdVBWNzkyMUxUaWlOaXc3eDM2Y0FfMk04Yl9KcF8xUDh4aDh6OHZ6aGZLQmU3QzJ5bWZ5T201UGxRTVVkVNIBngFBVV95cUxNWnZpb0ZuVUdaUHZabWVzcVl3V3Q3ZklFVjIwUl9ZRTVCTmthdTNENHVyUmExOVp1MmZRc2phX2J0U19IRzdVbmxQa1I1TFI1NkxJc1JVRThsbGY2S2Y2MTZmNC1JOEFaS05MdkY3bXh0Qm1qbnQ5MVNSXzh0SXdoSWp0YS1LSWZOYTcwZjJXX1poVFJhRXZJalRhaDM1Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin & Ethereum – Traders, should you play this waiting game? - AMBCrypto News",
        "content": "Trading volumes in crypto have plummeted to January lows.\n\nBitcoin and Ethereum prices have declined slightly, impacting market activity.\n\nThe crypto market is witnessing a significant lull, with trading volumes dropping to levels not seen since the start of the year.\n\nThis downturn accompanies a noticeable decrease in the prices of major cryptocurrencies, with Bitcoin [BTC] and Ethereum [ETH] shedding 4.6% and 0.3% respectively over the past week.\n\nAs of the latest data, Bitcoin hovered around $62,858 while Ethereum traded at approximately $3,141.\n\nOn the 30th of April, market intelligence platform Santiment, via an X (formerly Twitter) post, reported that this decline in trading activity aligned with a broader sentiment of uncertainty among traders.\n\nThe once-popular rallying cry to “buy the dip” has quieted, and the bullish chatter that typically accompanies hopeful market cycles has notably diminished.\n\nMoreover, a significant portion of the market is holding onto their assets, driven by the “fear of missing out” on any potential recovery rallies.\n\nBitcoin and Ethereum: Future possibilities\n\nThis market behavior has led to a stark consolidation period for Bitcoin, where neither significant upsides nor sharp declines are being observed.\n\nSantiment highlighted this period of indecision, noting that the current situation is characterized by a lack of selling, underpinned by traders’ reluctance to miss out on potential gains.\n\nThe platform also suggested keeping an eye out for a surge in trading volume, which could signal a forthcoming market-wide rally as the calendar turns to May.\n\nThe recent drop in Bitcoin’s trading volume is a stark reminder of the diminished market enthusiasm. From highs of over $23 billion last week, trading volumes have plummeted to just under $20 billion.\n\nThis decrease is likely a cooling-off from the fervor generated by the recent Bitcoin halving and the inflow into ETFs, which are now showing signs of waning interest.\n\nData from Farside investors indicated that Bitcoin spot ETFs saw a modest inflow of $51.6 million on the 29th of April—a sharp decline from previous months.\n\nWhat’s next?\n\nAs the hype surrounding major catalysts like Bitcoin’s halving and ETFs dissipates, the market is left in a state of anticipation for the next big wave.\n\nThe potential approval of Ethereum-based ETFs could be just the spark needed to reignite investor confidence and reinvigorate market activity.\n\nAs it stands, the cryptocurrency community is watching closely, waiting for signs of either a further decline or an unexpected rally that could redefine the current landscape."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNYXFhVkZDamItdFE4d19kRGdBQkJhTWlmSVFhU3RJZHhtMEJaTjNQVVhkTWJJSGQxOFlVX096MHNYTGNmdV8xY3JRYzc2bTIxTjAwRWtDdFdrT1hGcVBHdlRyVFhCVUVxWWlkSks1Y0NIaVFUQmpfc3hmMloyWnM3SHJiUFhRUnloOExLMWpBd0MxU3pDZ21aM9IBngFBVV95cUxNc1Zma2NPYjZtZ2IxcW5HcEZhRUZDZ1MwTlBjUlNqRDlVV3RWX1lmUVVKV3VXQ1ltbGR3Z3BHLXRMZUVQRXZrNE5WYWo5NHNpVlBqNWQwZnNLVkhsbmNzdHBFY2V1U1pQUDA3VVBweENqbk9xZE9SQ1FoSTRwT0sweUNsRXQwVG13S0h5b19YcDA4MENtaTJ0WTVIWGhRdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Ethereum’s price below 3K! How long should you wait before the next rally? - AMBCrypto News",
        "content": "ETH’s price dropped under $3000 on the 30th of April.\n\nThe decline will likely continue if bearish momentum climbs.\n\nEthereum’s [ETH] brief decline below $3000 during the trading session on the 30th of April led to a spike in its social activity, Santiment noted in a post on X (formerly Twitter).\n\n🗣️ #Bitcoin and #Ethereum are seeing significantly higher discussion compared to other assets today. Traders have showed a sizable amount of fear with $BTC dropping as low as $59.5K and $ETH as low as $2.9K today. Counter traders have used these signs as a great #buythedip… pic.twitter.com/6pRAFHidcD — Santiment (@santimentfeed) April 30, 2024\n\nAccording to the on-chain data provider, at the time of press, the altcoin ranked second in terms of social discussion after Bitcoin [BTC].\n\nBetween the 29th and the 30th of April, ETH’s social dominance skyrocketed by 150% as the chatter involving the coin across Telegram, Reddit, X, and 4Chan increased.\n\nTo rise or fall?\n\nGenerally, when an asset’s price decline is followed by a surge in social activity, it often signals an impending price correction.\n\nHowever, a look at the coin’s price movements on a daily chart suggested that ETH might not be poised for any significant rebound in the short term. Its price may even witness further downside.\n\nReadings from the coin’s Fibonacci Retracement levels showed that ETH’s decline below $3000 marked a breach of an important support level, which it had formed at $3145 over the past few weeks.\n\nExchanging hands at $2,899 at press time, the likelihood of a further decline remains high as demand for the leading altcoin continues to plummet among market participants.\n\nFor example, ETH’s key momentum indicators were positioned below their respective center lines at the time of press. Its Relative Strength Index (RSI) was 45.31, while its Money Flow Index (MFI) was 40.50.\n\nAt these values, the indicators signaled a preference for coin distribution over accumulation.\n\nFurther, the coin’s MACD line (blue) rested below its signal line (orange) and approached the zero line at press time.\n\nWhen an asset’s MACD line rests below its signal line, it indicates a rise in bearish momentum. This means that the asset’s price could be in a downtrend or that it is expected to experience downward pressure soon.\n\nTraders often interpret it as a potential sell signal.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nIf bearish momentum climbs, ETH’s next price point might be $2867.\n\nHowever, if the bulls increase their demand and are able to initiate a price rally, the coin might correct its movement, reclaim support at $3145, and rally toward $3300."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNaDBwYW9tdW90cDdfcDIxVWdhbzBHRFNvUWxuWU9CMUM5NTR1d0NsenRrRXdEZ2Jfb2ZKeThkUzlxdE1nVUZ6QzJrU0ozb1F1Nk1VWXJNU0p6LTNnaXc4S0tuSzBsT0dBN2lwdnZzczZtMGlfeFBtdHlSNzhwWHByQTFWWHcxV2h1cFpNZUIwcHrSAZYBQVVfeXFMT2NlZHRiRGl3cEVKT251YnB6Q0pDU2U0djVRSVBqZ2tDRFVUUkRXOVZEQ1hlM25xU0UwZ0s1YW1DTG90bkltZkx6OU5yY2lsTmxFVGY1UE9yWHJSRWJtSWszMTk2d3RTU1RUTXNZTng5UUhRa3dFMjRKNENaVmJJT3ByNzU2ajFCc2ZRQ2JISlJwOWREQktB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Why Ethereum’s price can spiral towards $2500 over the next 7 days - AMBCrypto News",
        "content": "Ethereum flipped its 1-day market structure bearishly.\n\nThe former range highs were the next support region of interest.\n\nEthereum [ETH] saw a wave of selling activity as profit-taking arose amidst fear. The downtrend was persistent in April and the selling volume was growing.\n\nThe indicators were bearish on the one-day timeframe.\n\nThe disappointment from the Hong Kong ETFs’ volume on the first day outlined the sentiment toward ETH and crypto. The Open Interest also fell lower to suggest speculators were more guarded.\n\nThe bullish order block above $2500 next\n\nThe higher timeframe trend of Ethereum flipped bearishly after it dropped below the $2906 swing low. If the daily session closes below this level, the price would very likely head toward the next support zone at $2600.\n\nThis region also has confluence with the former range highs that ETH traded within a few months ago. The RSI on the 1-day timeframe has been below neutral 50 for most of April, highlighting consistent downward momentum.\n\nThe OBV also slipped below a support level recently and retested it as resistance. Ethereum is likely to register sizeable losses before reaching the next notable level on the indicator.\n\nThe hunt for liquidity could see ETH go south\n\nThe closest cluster of liquidation levels for ETH was downward. The $2640-$2750 region presented an attractive pocket of liquidity.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIt also has confluence with the bullish order block highlighted at the range highs.\n\nIt is expected that ETH will descend to this liquidity pocket before a reversal. Chances of a reversal before that were slim, since these liquidation levels act as magnetic zones to the price.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOQkxWRTR0YjRyVUFfTHcwNFJoTnNxRDU4Yk9sbFBtWGpmRU1oUnU5RWxJU2VBTVBtNXpXWnRDVWctS0U1ZEFKaDZzYm5ULXc1Q245T193b2VrVVFCZlBaaDB6LXFMaFlJV2xwM0M5dENDbm11VTJ2Ym1ReTdpVTJSaEMzM0lodkxRYnUzQnNsTFVxQzBVb3pHWndoc2hBWFNFUENPbkt5bVZ1V1BOdXFWbdIBtgFBVV95cUxObmZVVl9hUTlaUTBZUWFCSDkyanRjOFFiNW1UNVhnZ25xX2U0czYtd2djMWtYcnRldHNYWUZscW9lOXlGdTUyTlRoODc1Yzg0ZHEyOFBsWmF2R3FhNXBNMzNhajFHb3pLYzl4OVEyN2NTNmRDOEdEZFFORlpPMWplNmUzYUJXa2JkbUhwcEt0clBtYnpjVkNnc2RIak84a3NuTEY0eXNmdWdTWUVuenp1cFJSbS00dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Disappointing Launch Day for Hong Kong’s Bitcoin, Ethereum ETFs as BTC Slumps Below $61K - CryptoPotato",
        "content": "Hong Kong’s debut of six new spot Bitcoin and Ethereum exchange-traded funds (ETFs) marked a trading volume of HK$87.5 million ($11.2 million). This volume was significantly below the inaugural trading of 11 spot Bitcoin ETFs in the U.S., which achieved a staggering $4.6 billion.\n\nMeanwhile, bitcoin’s price dumped below $61,000, having experienced a 2.3% decline within the last 24 hours and an 8% decrease over the past week.\n\nHong Kong’s ETFs Record Low Volumes\n\nThe Hong Kong Stock Exchange (HKEX) data indicates that the performance and interest in the six Bitcoin and Ethereum ETFs managed by China Asset Management, Harvest Global, Bosera, and HashKey were relatively low after debuting in Hong Kong today.\n\nThe Bosera HashKey Bitcoin ETF recorded HK$249,000 in first-day trading volume, while the Bosera HashKey Ether ETF saw HK$99,000 in trading volume at the closing bell.\n\nIn contrast, the China Asset Management (CAM) Bitcoin ETF performed better, generating HK$4.6 million in trading volume at the closing bell. The CAM Ether ETF also had a trading volume of HK$4.6 million.\n\nBitcoin Falls Below $62,000\n\nEven with the introduction of Bitcoin and Ethereum ETFs in Hong Kong, the overall sentiment in the crypto market remains negative. Perhaps driven by the disappointing numbers coming from Asia, BTC reacted in a negative manner and dumped below $61,000 for the first time in 11 days.\n\nBitcoin started last week with some positive momentum, briefly surpassing $67,000. However, it failed to sustain this upward trend and began to lose value, reaching a low of $60,700 on Monday.\n\nFollowing a brief recovery to $64,800, bitcoin faced another rejection, struggling to maintain even a minor rally. Meanwhile, the rest of the crypto market followed suit, with the market capitalization dropping 3% over the last 24 hours to $2.35 trillion."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxOU2tabmFzcHRFU2hqRDBUU1NOUXRFeEl0XzY3elRyOTZZTFBGMWliMWUwNUR4dzkzYlZuWTV2REtTbnVIQzY5Z19sQmlvcWQ1anQtdUdVdzZic3UwYmJRNEw1angwU2tWMk9oVEI4ZkkxZ2doMUJuWWRKMmplVHRkLURZdTFGSzJuZWRleUltaVdRZlBpUDh2RHQ4Q21Qc1BQQ3ptbzZrWEFaQ1VkaGlfcGFiLXpUWUNQM1E1d01GZlVmWnIzM25qMWFwOXc0OWwxYTZDazI3Sk1iWXg1VnM2TndnUHROQ0xYOHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "BingX Introduces $REZ Spot Trading Amid Growing Popularity of Ethereum Restaking Ecosystem - Media OutReach",
        "content": "space, is poised to issue its launching on centralized exchanges. Its launching may also benefit the VILNIUS, LITHUANIA - Media OutReach Newswire - 30 April 2024 - The restaking category is growing in popularity, propelled by some eye-catching projects, such as Renzo EigenLayer , and others. Renzo ($REZ), with a high potential of becoming the top 1 token in the restaking space, is poised to issue its launching on centralized exchanges. Its launching may also benefit the Ethereum price as the restaking category will add vitality to the Ethereum ecosystem.\n\n\n\n\n\nRenzo (REZ) is a cryptocurrency project aiming to simplify and enhance Ethereum staking through its role as a Liquid Restaking Token and Strategy Manager for the EigenLayer protocol. EigenLayer focuses on a concept called Actively Validated Services which allows Renzo to potentially offer users higher yields than traditional ETH staking methods.\n\n\n\n\n\nEssentially, Renzo acts as a bridge between users and the EigenLayer ecosystem. Users deposit their ETH holdings into Renzo, which then strategically allocates them within EigenLayer's network of validators. This process eliminates the complexities of managing validator nodes directly, making staking more accessible for everyday users.\n\n\n\n\n\nA key feature of Renzo is its issuance of ezETH, a Liquid Restaking Token. When you deposit ETH into Renzo, you receive an equivalent amount of ezETH. Unlike staked ETH, ezETH is a tradable token. This means you can hold ezETH to earn staking rewards (such as airdrop ) while retaining the flexibility to buy, sell, or trade it on compatible cryptocurrency exchanges. This liquidity aspect is a major advantage compared to traditional staking methods, where your ETH remains locked for an extended period.\n\n\n\n\n\nAnother highlight of Renzo is its focus on promoting the wider adoption of EigenLayer. Users can also earn points for EigenLayer airdrop , if they stake ezETH via Renzo protocol. By acting as a user-friendly interface, Renzo encourages more people to participate in EigenLayer's network of validators, which contributes to the overall security and efficiency of the Ethereum blockchain.\n\nTrading of REZ will start on 2024-04-30\n\n\n\n\n\n\"We are thrilled to offer our users the opportunity to trade these popular tokens,\" said Jason, BingX crypto asset analysis \"As one of the leading cryptocurrency exchanges, BingX is dedicated to providing a diverse range of assets and supporting the growth of innovative projects within the Base Chain ecosystem.\"\n\n\n\n\n\nTraders can now access REZ on BingX and take advantage of the platform's advanced trading features and liquidity. BingX Spot gives users early access to some of the most sought-after tokens in the space, with more that 700+ trading pairs."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNMHcyaWM4cktXWWY4c3JSLVhjNFA1YTJBRXJFRXhFbklOcWR2TWp2cFVqSWpFVEdoMnJFMVVqMW1xcVdFcjNfQmx3bk5IYk5KNjVwTlNmQWEzUEFtZ0NucGZYN3BfaHJfd2doZTNWVnJnc3g4T2lld3FsU1RkTEptWFpBOEdEbHRFY0dabGVvdUVRTXR3VVM1aGQtbmZNTEVpVHlF0gGoAUFVX3lxTE1yS3g3ZVpwMmRGeWJGM1ZiVldkZ2Vld1Z5dHBRX0ZuTld1eC1sbjFvNTVMQldIZnVUakpmdkhuVFhQWnNzaDQ2eFktRVF5YVgzQXkzb0JBQnRBMnp2TlpDc1l1STMwNzFNRXQ3RnZMLTM4UnhuYmZNTDlLbnRtUVJLd2J1OWJSZUVkWjNZVmJabUxDWW1GaDRZMWRRckNFMTE2UUFLaXNaNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 1: Bitcoin & Ethereum Crash 5%, Cosmos Gleams Amid Market Dip - CoinGape",
        "content": "The top crypto prices today crashed heavily as the Bitcoin (BTC) price plunged to the $60,000 level despite the recent Hong Kong ETF launch. In addition, the Ethereum (ETH) price plummeted below the $3,000 mark, losing hold on a crucial level. Moreover, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) plunged notably, mirroring the bearish trend.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price crashed by 5.13% reaching $60,191.06 at the time of writing on Wednesday, May 1. On the other hand, it’s trading volume spiked 41.71% to $37.91 billion in the last 24 hours. Whilst, the crypto’s market capitalization slipped to $1.18 trillion.\n\n2. Ethereum Price\n\nThe Ethereum price tumbled 5.46% to $2,999.10 at press time with a market valuation of $365.74 billion. Whilst, ETH saw its trading volume surge 29.66%, reaching $17.99 billion.\n\n3. Solana Price\n\nThe Solana price extended below the $130 mark today. The Solana price lost 7.06%, settling at $126.06. In contrast, SOL witnessed a 42.20% surge in trade volume to $3.48 billion in the last 24 hours.\n\n4. DarkLume (DLUME)\n\nDarkLume is a gamified socioeconomic system that runs in a virtual world. It offers a distinct blend of fantasy and social interaction. DarkLume enables users to become citizens of virtual countries by participating in recreational activities. It serves as a platform for interaction in a dynamic social ecosystem. To reinvent luxury living and entertainment in the digital age, catering solely to the needs and preferences of modern societies.\n\nThe token is currently running a presale for 40000000000 DLUME tokens. It has already raised $25,033 at $0.0005. The next price is expected to be $0.00060, while the listing price might be $0.0015. These price estimates are entirely situational and subject to change as presale activity increases.\n\n5. XRP Price\n\nWhilst, the XRP price inched closer to drop below the $0.50 level amid the broader market crash. The XRP price recorded a slump of 2.66%, reaching $0.5026. On the other hand, XRP’s trading volume soared 24.41% to $1.36 billion.\n\n6. Cardano Price\n\nMeanwhile, the Cardano crypto price slipped 2.96% to $0.442 today. Whilst, ADA recorded a hike of 40.13% in its 24-hour trading volume, settling at $416.32 million.\n\n7. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price crashed by 7.29% to $0.1324 while its rival, Shiba Inu price tumbled 7.57% and traded at $0.00002215.\n\nAlso Read: How Will Bitcoin Price React To FOMC Meeting?\n\nTop Crypto Gainers Today\n\nCosmos (ATM): The Cosmos crypto surged 5.43% and traded at $8.56.\n\nThe Cosmos crypto surged 5.43% and traded at $8.56. Optimism (OP): The OP crypto price rallied 2.52% to $2.58.\n\nThe OP crypto price rallied 2.52% to $2.58. Starknet (STRK): The Starknet crypto price was up 2.22% and was valued at $1.24.\n\nThe Starknet crypto price was up 2.22% and was valued at $1.24. Tron (TRX): The TRX crypto price rose 0.45% to $0.1201.\n\nTop Crypto Losers Today\n\nArweave (AR): The AR price plummeted 17.25% to $29.74.\n\nThe AR price plummeted 17.25% to $29.74. Stacks (STX): The STX price plunged 15.01% to $2.04.\n\nThe STX price plunged 15.01% to $2.04. Sei (SEI): The Sei price witnessed a dip of 11.75% to $0.542.\n\nThe Sei price witnessed a dip of 11.75% to $0.542. Lido DAO (LDO): The LDO crypto slumped 11.43% to $1.90.\n\nDue to the sudden bearish trend, none other crypto made it to the top gainers list. Moreover, millions worth of crypto liquidations were noted in the past 24 hours, which could have catalyzed the latest crash. According to Coinglass, Bitcoin alone witnessed $107.64 million liquidations in the last 24 hours. Out of this $93.26 million has been attributed to longs.\n\nAlso Read: Here’s Why Pepe Coin Price Sees a 20% Breakout Rally in May\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQajVHTkt4bEpwU002WGJjOFlCdVAtNlF1REJOeVdFOTVrdy1RQ1ZPZXpzazNaT0x3TmhmSHVNaWY5ay1UWGVndTlVM1Y1ak92UFZwTE5ndTEySnpOVk5Fb2dITURWaXozUWRpWE5RZG1mOTFqaU5yMUtvNGd1Q1R3WjV1cDRhalJLZ1JUbEt2SdIBlAFBVV95cUxNWnRObGV4bmZySllPWFFlUnNqOVdFbFNLOWdNWk56VV8xbzdnZk1xR1JQOUc1S0dybVQtaXF5b2hPV0JJODdVeFhFWkM3aGFwVVJvM1lpOHdNSU9kV25sS21XM0JscG5lUk1DQWZxZVVWX3JyeDhFYnlyRHVZdjZKQzB4Ylg0ZG4zVWlFeGo3b2dIRmQ1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Ethereum to outshine Bitcoin this summer? Raoul Pal’s bold prediction - AMBCrypto News",
        "content": "Analyst claims ETH will eclipse BTC in crypto summer.\n\nThe US liquidity injection could boost the market in the second half 2024.\n\nEthereum [ETH] could outshine Bitcoin [BTC] as we inch closer to crypto summer. The bold projection was made by Raoul Pal, founder of Real Vision and key crypto market commentary figure.\n\nIn an X post, Pal underscored that crypto summer is an altcoin season that shifts attention from Bitcoin to others. Part of his post read,\n\n“Crypto Summer is usually the start of Alts season, which goes full “bubble-tastic” in Fall. This is when ETH bases and begins to outperform BTC. This is when SOL accelerates its outperformance of BTC & ETH.”\n\nAdding a timeline to his projection and how “crazy” things can get, Pal highlighted that,\n\n“Once the markets are full refreshed, that is usually when The Banana Zone starts, picking up to full mania towards the latter part of the year…and well into 2025”\n\nThe US liquidity factor\n\nPal’s projection is purely based on historical data. However, past performance doesn’t necessarily dictate future outcomes. So, what could be the key catalyst for Pal’s wild projection?\n\nAn easing macro front is one of the likely factors. The Singapore-based crypto trading firm, QCP, emphasized how US liquidity injection could drive markets.\n\nIn a weekend update over Telegram, the firm acknowledged that US inflation was still hot. However, it reiterated that the US treasury could inject more liquidity in the second half of the year. Part of the statement read,\n\n“However, at this point, monetary policy might matter much less than fiscal policy, which will be the main driver of liquidity and asset performance.”\n\nThe firm added that,\n\n“The upcoming Quarterly Refunding Announcement (QRA) on 1st May could also see higher issuances in short-term US bills. This will drain the RRP, which currently has USD 400 billion, and also increase liquidity.”\n\nLast week, BitMEX founder Arthur Hayes made a similar projection. He highlighted that extra liquidity will be injected into the economy during the US elections.\n\nMore liquidity means an extra money supply within global or local markets, especially when central banks cut interest rates. This is a perfect condition for risk-on assets to rally.\n\nWhether Ethereum outperforms Bitcoin remains to be seen. However, much of the hyped “crypto summer” could be fueled mainly by macro factors rather than historical cycles."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOeEE2VWV1TUVxZEpHVFlsNGZ4SDY2Z0wwTDQ0RU1CR2pKRTJqOHRxVVBzSzBXRjNhd1J1cHJOVHUzVTVlMGt5UTJSRF9hdFdQcWZPTEU4WlVtaVlEaHc5QzJlVnVBczdjLUxJSVVpY215aGZSRmNGRTNOLVlyVzk0SlIyWnZmRlJnb1lZVl9sNFhSeVd1dmlJ0gGkAUFVX3lxTE1JM1hrMEdYYjctRWlhUzdNNlE3Z3lEMXBpbjIwdHN4Y2Y3OFBFZXl5R0lUUWF5V3dBRU9KS0lleUpGNE9xS3hkeVA4NGVfNXJuZ2VsbmFrTUpXdVdQMEhWeUVKbkM1ckZoVk1za0ZTOWdQY3VsdFZ2dTNUcWI5R2tDUkhQeEZvbDZRUkJSLTR0WEs3SjRxd3lsWkhwYVVoa1lRcXRj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Continuous to Dip; Trading at US$3,170 - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPY21xaXZPaHh3ZkpGelJ3b0pyTm5BTFhBempWUHdqWW81QkliR3dtME1zbW5qTnNyRkZXYXJoeENDUGJMU3ZoNjJ1YlNSbDg2R1VLQ2h1cGNneVp6OElDR0IycXNTRHZsUzNvVnVsOFo0OThrM0tJOWJ0eTRYMElFY3VuRzdyTTQwdUNMbFBMV25FM19OSUZCSdIBngFBVV95cUxNQnZCS3FsNGtTZTRyczROc1JyaXJIZGpUNk1oNVQ5WHNmdVVJSGpkZHNpUDZTLTJTZDc1X0ZibU1MSmJscWJUYmRZeXV0RklZS0RwTVpobUVNcmlRcDZpT2hIOG9xRkIyN3F1ajhZMXJkZ3o2N0VWNFpuemhrV3ktZVZYeWgyeWRzM0tnRDY2eUtMMnBXR0ZSOFFwVjhrdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Why is Bitcoin dropping and why are Ethereum, altcoins taking BTC’s lead? - AMBCrypto News",
        "content": "Bitcoin was trading 16% below its ATH recorded in March.\n\nFurther downsides could be potentially dangerous for the broader market.\n\nBitcoin [BTC] sank below $60,000 during U.S. trading hours Tuesday, extending a string of losses in what has been one of the worst months for the cryptocurrency market in recent memory.\n\nBloody April\n\nThe world’s largest digital asset was down nearly 5% in the 24-hour period, data from CoinMarketCap showed. It ended April at a 14.5% monthly discount.\n\nAs of this writing, it was hovering over $58,000, down 16% from its all-time high (ATH) recorded in March.\n\nThe slump rippled across the market, causing other coins to trade in the red.\n\nMore than $36o million worth of positions were liquidated in the last 24 hours, with longs accounting for 85% of the total, AMBCrypto noted using Coinglass’ data.\n\nAbout $107 million in Bitcoin liquidations was observed in the 24-hour period.\n\nWhat is causing negativity?\n\nThe sell-offs followed the lackluster debut of the newly-listed spot ETFs in Hong Kong. They recorded just about $11 million in trading volume on the first day, according to data from Hong Kong Stock Exchange.\n\nThis was a fraction of what U.S.-based spot ETFs clocked in their debut in January.\n\nU.S. spot ETFs were not exactly having a great time either, as they saw net outflows of $161 million on Tuesday, the fifth straight day of outflows, AMBCrypto examined using SoSo Value data.\n\nMoreover, expectations of the U.S. Federal Reserve keeping the interest rates steady in the upcoming FOMC meeting in light of hotter-than-expected inflation data was also prompting traders to take out their capital from riskier investments.\n\nIs your portfolio green? Check out the BTC Profit Calculator\n\nWhat to expect next?\n\nShivam Thakral, CEO of Indian cryptocurrency exchange BuyUcoin talked about the significance of Bitcoin’s current price levels in a statement shared with AMBCrypto.\n\n“Bitcoin was retesting the crucial support zone of $58,000-$60,000. This zone holds significant importance for the short-term prospects of altcoins. If it is lost, altcoins could potentially suffer further downsides.”\n\nThe increasing FUD might help in a creating a local bottom. While reacting to the crypto market’s greedy state, popular technical analyst Ali Martinez said that more fear was needed for a sustained rebound."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNRG5xR3pJeVFwbF8wWUhrZFBNVG4ySENnazQ2NVhfSGhGUC0yQ0RMVFF1SHViWlV4a1lQaE1mT1BKc3oyTUhLUzctSVhPdnctYWtVMmdIV3FnSHdYcGdSMjNKOEtLeEFwZEhTR3ZhS1JSUzljNmIyNGx5eFRNYTRMY1A2OEhSbEdOelpaTS1B0gGTAUFVX3lxTE1fVkstY1ZiWjlUTVVJNnVpWnd1MmFMWHhuU1ZSQjlkVjFRRExKSzFGVTZZQU1pdWRQby1HMDl0N3c3dmRBWk82Y1JqdTBHaGZ5VVVadV9TdVhNMUlPc2NrNmI5eHZSVGpwZFZLZ2ZZV2VKb09uSjRUUDZPNmV5dnU3RV9SUHo3cFY2YmJFMjlETkxaYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Ethereum: Hong Kong spot ETFs fail to impress, what next for ETH? - AMBCrypto News",
        "content": "ETH was down 3.2% in the 24-hour period at press time.\n\nDerivatives market has been bearish on the coin for the last 2-3 days.\n\nWorld’s second-largest cryptocurrency Ethereum [ETH] trended lower since the listing of first-ever crypto spot exchange-traded funds (ETFs) in Hong Kong.\n\nAccording to CoinMarketCap, ETH rose to $3,250 shortly before the funds started trading on the Hong Kong Stock Exchange (HKEX) – the city’s bourse.\n\nHowever, the stiff resistance pushed the digital currency back, causing it to fall to $3,020 as of this writing, a 3.2% drop in the 24-hour period.\n\nWell-known technical analyst and trader Ali Martinez had talked about the significance of $3,200 as an important resistance level for ETH recently.\n\nAs many as 2.43 million addresses had acquired 5.14 million ETH at this level. Hence, overcoming this “brick wall” was critical for a sustained rally.\n\nSpot ETFs start on a dull note\n\nThree spot Ether ETFs, along with three Bitcoin [BTC] spot ETFs, debuted in Hong Kong, a city which has been vying to project itself as the next crypto hub.\n\nHowever, the shares of all the three ETFs tied to ETH closed lower, according to AMBCrypto’s analysis of HKEX data, as trading volumes failed to pick up. This, in turn, might have influenced sentiment towards the cryptocurrency, causing it to drop.\n\nSpeculative market bets against ETH’s rise\n\nAs ETH dipped in the spot market, ripples were felt in the derivatives sector as well. The Open Interest (OI) in ETH futures plunged 4.5% in the last 24 hours, as per AMBCrypto’s analysis of Coinglass’ data.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIt looked as if the derivatives market had sensed a poor opening day for Hong Kong Ether ETFs. The number of traders shorting the crypto against those who were taking long positions has been rising in the last 2-3 days, as per Longs/Shorts Ratio.\n\nAs of this writing, nearly 53% of participants were bearish on the coin."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNaGthQ0RaVEtKazBqUVd1VG4tNENmRExlZDFOUURmcnpMeF82VnNYSzk1ZS1yRWtJTU4yNTlFSjVTZ0pqMFdLTU5ucmdralBzbEpfM1I4QkFnUU8tZjdpbzcwM0N4bW0wWkhhcVBiVVFxb3k3VWRVemhJeC1Vc0F0dDlGQWZ0d2JUX3piMm5R0gGTAUFVX3lxTE9sMkl3Zmt1WV96OHRMOUFCbC05d2tMS3VxRlNIaU1XbWJkeVNOWkZRUmNLRGRCZTBENDhNTS1hdFJVeUViX2JSR2t5eUwzYURsWFd6QWRTRk9qV05KYkhXUmVJcEx1emR6Q2V6SWo5VWdVSWpKOFRERWRPc0V1UWF6dEw3MEZ4d3hpLVAzYkJLS0ctaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Solana loses 10% in 24 hours, but ‘beats’ Bitcoin, Ethereum in THIS key area - AMBCrypto News",
        "content": "Funds attracted inflows despite SOL’s bearish price action.\n\nThe prospect of improving network health might have driven investors towards SOL.\n\nDigital asset funds tied to Solana [SOL] SAW healthy demand last week, as investors’ appetite for the fifth-largest cryptocurrency took a healthy turn.\n\nSolana sees a shift in sentiment\n\nAccording to the latest report by crypto asset management firm CoinShares, Solana-based crypto products attracted more than $4 million in inflows last week.\n\nThis was a sharp turnaround from the $300,000 in net outflows recorded in the week prior.\n\nThe recent inflow boost came even as blue-chip assets like Bitcoin [BTC] and Ethereum [ETH] witnessed heavy outflows, totaling $423 million and $38 million respectively.\n\nInterestingly, demand for SOL-linked funds surged despite a bearish price action, which saw the crypto tumble 16% over the week, AMBCrypto noted using CoinMarketCap data. At press time, in just 24 hours, SOL’s price was down by over 10% on the charts.\n\nIn fact, the price decline resulted in a slight drop in total assets under management (AUM) from last week, from $1.15 billion to $1.14 billion.\n\nWas this the reason?\n\nWhile it is difficult to pinpoint the bullish catalyst propelling investors toward Solana goods, the possibility of reduced network congestion could be a credible cause.\n\nSolana developers have been shipping release after release to alleviate transaction failures and congestion on the network, issues that have contributed significantly to the FUD around the coin.\n\nThe latest one to go out was the v1.18.12, which was currently being validated in the test environment.\n\nThe Solana community hoped that these improvements would finally resolve the ongoing troubles with the blockchain, which has been strained to its limits due to an explosion in meme coin trading.\n\nRead Solana’s [SOL] Price Prediction 2024-25\n\nThe latest blow\n\nWith Bitcoin crashing below $60,000, the downtrend has persisted on SOL’s charts, with the altcoin down 10% in 24 hours.\n\nThe latest drop appeared to be part of the broader market bloodbath, fueled by lackluster performance of newly-listed spot crypto ETFs in Hong Kong."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPU0xaUzd0bllDX2VJVFN5QzV6ZVE1UmNoaUlqdmNDRDRRRm51NDdXWi1ic2ttWXJkbTNwdlYxbzhnWEpTbExURWd2SWhGNVRIUXlNOFNoV2hNSUFsM3NwcmtQMDRUZmhEeFdGMnMyV0FyQkwzV0twY01DNElFZHJ2VGZtbWg4c0JOYU1GYXo3WXpid9IBlwFBVV95cUxOX1ktMHI1c3AxVzhHazBiaERwbzQwdTF4VTJLcTlfOUhIX0kxbzlhS0tEWnRZcWlwS0V4VzBac2ZMbFBSaDFfRmtBSTRlOE9naVVpZ0dxWmVHajVZdzd4V3lQUUpUeDM2cy1Oam1xMnIwdVVJZWJOYlNSTGxIb2M0ZG0xU3NiSnVwRjB5US1LczNPdTZ5cGFJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "April 2024 Report – BTCFi dominance, Ethereum’s fall, and May forecast - AMBCrypto News",
        "content": "Runes on Bitcoin’s blockchain can save traders from massive losses in the coming months.\n\nStaking on the Ethereum blockchain is on the rise, raising concerns about its future as “money.”\n\nAhead of the FOMC meeting (Federal Open Market Committee) of May 2024, the crypto-market saw a significant decline. Bitcoin dropped to $56,494 – A level last seen on 28 February 2024. Market sentiment skewed towards the side of fear as investors rebalanced their portfolios in expectation of no rate cuts.\n\nBitcoin’s MVRV Ratio (7-D) fell to -8.099%, at press time. On average, Bitcoin holders were underwater. It suggested that the market value was significantly lower than the price at which most acquired BTC.\n\nIt could also be taken as a sign of undervaluation. According to AMBCrypto’s market report for the month of April, Bitcoin will continue its downward journey for the majority of trading sessions in May.\n\nHowever, the report discusses three factors (Related to BTCFi, Options ETF, and Solana) that could reverse the king coin’s trajectory. Investments through BTC ETFs will have a bigger impact on price, compared to the fed rate cut anticipation or geopolitical strains.\n\nSince 24 April, BTC ETF outflows have been outweighing the inflows. On 30 April, a $161 million outflow was registered – The highest in the last three days.\n\nAMBCrypto’s report throws light on a fresh perspective though – It reveals numerous institutions are seeking approval for Bitcoin ETFs. If these ETFs are green-lit in May, it could lead to a significant hike in demand, potentially driving the price north.\n\nBitcoin’s savior – Runes\n\nThe rise of DeFi on the Bitcoin blockchain could save traders from registering massive losses in the coming months (AMBCrypto’s report dives into its full details).\n\nInterestingly, the 7-day moving average of Bitcoin’s market cap to transaction fee ratio fell below that of Ethereum. It highlighted a huge surge in activity on the Bitcoin network since the launch of the Runes protocol. Basically, this ratio indicates how much money is flowing into a cryptocurrency relative to the transaction fees being paid.\n\nAltcoins’ performance in April\n\nFollowing Bitcoin’s footsteps, the price of other cryptocurrencies also fluctuated by a significant degree. April was a volatile month for most altcoins. The broader market witnessed a downturn due to geopolitical tensions and inflation fears. However, some sectors thrived, like gaming tokens.\n\nAs per AMBCrypto’s report, Ethereum’s dominance has been challenged by Solana, whose DeFi market share has been surging steadily. Meanwhile, an Ethereum ETF is still pending SEC approval, and staking on the Ethereum blockchain is on the rise, raising concerns about its future as “money.”\n\nTake a look at AMBCrypto’s Market Analysis – April 2024 Edition\n\nDive into April’s market trends, valuable data, and exclusive insights to help yourself navigate through May’s market movements.\n\nThe report delves deep into key topics like –\n\nRising popularity of DeFi on Bitcoin\n\nAmerica’s love for memecoins\n\nFall in USDT’s dominance\n\nSolana’s TVL masterstroke\n\nNFT market’s recovery\n\nMarket forecast for May\n\nYou can also download the full report here."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQLXp4ZURVWXYzc1lwbU5udkkwMmZiaU92dEJ1WjlxNW1zdUlNUzQ2cWNmTkc1dE92Q0ZkLTNlcGRpa1VPRnNSX0NmQXNTVUdSTUV2Qi0xQnBCZ1dvZUZaSTAzbHZ3Rnk0Sm9CeV9xeHJoaUN6Si0yNGZTemxiaS1xemNB0gGHAUFVX3lxTE5ycDF3aFFFdzhpRTZId0x2R3FKWi1aYzFKdi0wZDFRUERxR0RxTzdTN1RmbTJHNTZmeEFmdFlFekVuZG05WmNwN04yQ2dNVUxqSDlWQ2xubnI1Uk9CQ3U1TGhDV3Y3RTgyOGJmQTJIZXd0LU5NYzhsVlpiV2s2NFJkOWtpTkg2TQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "What Next For Bitcoin (BTC) and Ethereum (ETH) Price? - Coinpedia Fintech News",
        "content": "Fun-loving and cheerful, a passionate blockchain and crypto writer who knows no boundary…connect if you share the same passion. With 10+ years of writing experience, I am a Crypto Journalist by chance, exploring, and learning all the dynamics of the sci-fi action-filled crypto world. Currently, focusing on cryptocurrency news and price data. With a passion for research and challenging my capabilities, I am slowly getting into the crypto arena to bring new insights every day.\n\nAnalyst Davinci, in his latest video, discussed the potential impact of Bitcoin roll-ups on the cryptocurrency’s value, suggesting a remarkable tenfold increase. While historically associated with Ethereum, rollups may soon revolutionize Bitcoin’s transaction capacity and functionality, according to a team of crypto developers.\n\nThe analyst observed that Bitcoin is struggling to break free from its current situation on the charts. Despite attempting to rally again, he anticipated this might be its last push before a potential breakdown. He noted it could mark a critical moment if Bitcoin drops back to or below $60,000.\n\nWhile there’s a chance of a bounce from that level, he suggested considering a short position. Assessing the risk-reward ratio, he highlighted the potential for a downward move, possibly reaching down to the red line. This presented an opportunity for a profitable short trade on Bitcoin, which he recommended considering if it was missed earlier.\n\nWhat’s Next for Ethereum?\n\nLooking at Ethereum’s chart, it keeps trying to go up but keeps getting stopped by a price level that used to be its support. It’s acting as tough resistance, making it hard for Ethereum to climb higher. If Ethereum drops below $3200, it could be in big trouble, possibly falling even more.\n\nAnalyzing where Ethereum might go next, it looks like $2500 could be a significant target for its price to drop. This means Ethereum might have a rough patch ahead. However, Ethereum and Bitcoin are expected to do well in the long run, regardless of challenges from regulators like the SEC and governments.\n\n“You cannot stop a technology whose time has come,” he declared confidently, assuring his audience of brighter days ahead in the world of crypto.\n\nAlso Check Out : Here’s When Bitcoin (BTC) Price Will Initiate a Fresh Rally"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9USjVSaEdWQ05aTEhwUmJVc3BaSTNRNEVOREk2MjhENDkxUmRSYWQzYm50UWtERFdFNXI3UGVaTWUtREVad2lhNUZMYnRxT0h1b2dQQWZ4UnZaZjVEckpVN0UyZ0pvV2NmalJVRXFIaVBzaENFc19WeXBZTzHSAYIBQVVfeXFMTmZaZFVRWHN3eDRiS1FKb3cwUUhyZ1VaS0tMXzVPS0dabUJab0M2SkVFam0yazhzUWxsNG9pT0NQTnh5MTRvYTRsbUpkLVp4NmJwWFZjT2ptUndzVExoQmtLMmR4bjJ5eUZZSFotellPSGVRRDRocGtjWDZvdUQ5ZjNaQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Apr 2024 21:01:34 GMT",
        "title": "Ethereum Price Prediction: Crypto Expert Says ETH Is Yet To Bottom Against Bitcoin - NewsBTC",
        "content": "A crypto analyst has predicted when Ethereum, the world’s second-largest cryptocurrency, will bottom against Bitcoin, however, under certain conditions.\n\nAnalyst Predicts ETH/BTC Bottom Timeline\n\nIn a recent X (formerly Twitter) post, crypto analyst and founder of ITC Crypto, Benjamin Cowen, shared his forecast regarding the Ethereum to Bitcoin price ratio, projecting the timeline for when ETH/BTC would hit its lowest value in the current market cycle.\n\nSharing insights on the market conditions, Cowen noted striking similarities between the present market’s dynamics and the one seen in 2019. He disclosed that ETH/BTC’s recent bounce mirrored the market’s behavior in 2019, two months before the Federal Reserve (FED) cut down rates.\n\nCowen predicts that the ETH/BTC ratio will reach the lowest point in its price cycle when the FED makes a significant change in its monetary policy, often referred to as a “pivot.” The crypto expert expects this pivot to occur in a few months, ultimately suggesting that Ethereum would bottom against Bitcoin in the coming months.\n\nHis analysis is also based on the assumption that macroeconomic conditions and the FED’s monetary policies can significantly impact the cryptocurrency market. Sharing a price chart of Ethereum against Bitcoin in another post, Cowen projected that the ETH/BTC ratio will head towards a range of 0.03 and 0.04 by summer.\n\nCommenting on his prediction of ETH/BTC’s bottom, a crypto community member expressed skepticism about the FED’s likelihood of cutting down rates while inflation was still high. Cowen responded that the absence of a rate cut further reinforced his beliefs that the ETH/BTC ratio has not yet reached its lowest point. He suggests that unless inflationary pressures are addressed, the ETH/BTC ratio may continue on its downward trend.\n\nCrypto Expert Calls Ethereum A Higher Risk Asset\n\nIn another post, Cowen referred to Ethereum as a higher-risk asset and Bitcoin as a lower-risk asset. The crypto analyst’s forecast on Ethereum against Bitcoin is underpinned by his interpretation of capital migration dynamics, suggesting that higher-risk assets typically depreciate relative to lower-risk assets.\n\nHe highlighted the uncertainty surrounding the future market movements of ETH/BTC following the halving event. Cowen predicted that if ETH/BTC witnesses a “relief rebound” after the halving, then he expects a rejection by the bull market support band, particularly in the context of weekly closing prices, estimated to range between $0.053 to $0.054.\n\nWhile acknowledging his past successes in predicting ETH/BTC price movements, Cowen highlighted that his predictions remain speculative, stating, “Just because I have been right so far about ETH/BTC does not mean I will continue being right.”\n\nETH bulls fail to hold $3,000 | Source: ETHUSDT on Tradingview.com\n\nFeatured image from Finbold, chart from Tradingview.com"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBCRFhjeTdaVTByVk4zUFpCazlSM0Rfd202QVJ3Mk80NllDdlg3emd2c3E1OVFHaDc5bGd3UlFOVk94cXl2VXRlWmQ1VE5TQTRlZ25BVXRrUjVsYVExUW5IcW52Z3JBbjhKSjNBSF95WGhBWS1vTHpNOF9YSzZudw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "What Caused the Global Crypto Market Crash Today? - Coinfomania",
        "content": "The broader crypto market experienced a sharp decline from April 30 through to the first day of May. Investors are worried about the huge loss in numbers, one that has not been seen in almost 3 months. According to data from CoinMarketCap, the global crypto market cap has crashed by 5.64% to $2.14 trillion in the last 24 hours.\n\nSince the beginning of 2024, the crypto market has had a bullish momentum, catalyzed by the approval of spot Bitcoin ETF by the U.S. Securities and Exchange Commission. Additionally, the positive sentiment was sustained by the anticipation of the recently completed Bitcoin halving. However, it seems like the momentum has come to an end as prices took a nosedive, beginning the month of May in ‘bloodbath.’\n\nAt the time of writing, Bitcoin, the flagship cryptocurrency has plummeted by 7%, trading below the $60,000 mark. Per CMC data, BTC is changing hands at $57,636 with a live market cap of $1.13 trillion. Similarly, Ethereum, the second-largest cryptocurrency by market cap has declined by a notable 5% $2,892 in the last 24 hours.\n\nOther popular cryptocurrencies including XRP, Solana (SOL), and BNB have lost 1.47%, 6.19%, and 5.13% of their value respectively over the last day. The tokens that took the worst hit among the top ten cryptocurrencies include Dogecoin (DOGE), and Toncoin (TON) with 9.12% and 8.99% respectively loss respectively.\n\nAs the overall outlook seems like the downturn is not reversing soon, investors are curious about the reasons behind the trend. Let us take a look.\n\nWhy is the Crypto Market Down Today?\n\nBitcoin ETFs Saturation\n\nEarlier this year, the crypto market, led by Bitcoin experienced a rally following the approval of spot ETF by the United States regulatory watchdogs. As a result, billions of dollars were injected into the market from institutional investors causing an upward swing in the price of the asset. However, crossing to Asia, the Bitcoin and Ethereum Spot ETF approval in Hong Kong did not generate the same buzz as it did in the U.S. On the opening day, only $8.5 million in Bitcoin ETF trading and $2.5 billion in Ethereum ETF trading was recorded. This reduction might signify a loss of interest in crypto exchange-traded funds.\n\nSentencing of Changpeng Zhao\n\nThe founder and former CEO of Binance, Changpeng ‘CZ’ Zhao was sentenced to 4 months in prison on April 30 by Seattle-based U.S. District Judge, Richard Jones. Following the event, the crypto market plunged by 5.12% to $2.21 trillion, indicating the level of attention the court case gained. CZ pleaded guilty to one count of violating the Bank Secrecy Act in November 2023 hence the sentence. Even though the prosecutors had asked for a three-year sentence, the embattled founder was given a slap on the wrist with a lenient sentence.\n\nMomentum Fade\n\nWhat is alarming cryptocurrency investors more is that the catalyst for the previous six months’ surge has suddenly subsided. After adopting a “risk on” mentality in the middle of 2023, investors are now dealing with a slowing economy and the fact that interest rates will be higher for a longer period than initially anticipated.\n\nBitcoin and other cryptocurrencies are pictured as a hedge against inflation by investors, however, the reality is that cryptocurrencies are very volatile assets and their value can rise and drop sharply at any time. We may have witnessed a peak in cryptocurrency values for the time being unless there is a change in the economy’s growth rate or investors’ willingness to take on more risk."
    }
]