[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPTFRPbGlUa3BETjlkYWttWDB2MU1RN25PR1I1b0VyOUs3NHpER19BWDJ3VV9PU2ZfWEdJeVBrd2ItMnJ3MENxc1dFZktRX0hCVUNvNmsxRno1al9WSUc3Ujc0ekU4QVQyRkpsUUtnWTZPQng2ZG9nbVlSbldnYXhic3hRdTVlVnhtWlRpU0swRlFqTmpHb1dUXzVrdEdHOGVpLUZYNGdRQ181Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Investing in Ethereum ETFs: What to Know - The Motley Fool",
        "content": "Ethereum (ETH -5.71%) exchange-traded funds (ETFs) offer a convenient way to invest in the second-largest cryptocurrency by market capitalization in a manner similar to buying stocks. Much like the early days of Bitcoin ETFs, the landscape for Ethereum ETFs currently features futures-based options, while spot ETFs are still pending regulatory approval.\n\nDefinition Icon Cryptocurrency Cryptocurrency is decentralized and secure digital money, based on blockchain technology, that offers new investment opportunities.\n\nIn this article, we'll explore the available Ethereum ETFs, examining both the futures-based products currently accessible and the potential future of spot Ethereum ETFs. We'll also provide guidance on how to invest in these ETFs, offering insights into their structure, the benefits they offer, and considerations for investors looking to add Ethereum exposure to their investment portfolios.\n\nImage source: Getty Images.\n\nWhat is it? What is an Ethereum ETF? The easiest way to understand Ethereum ETFs is to break them down into two main components. Ethereum itself is a blockchain platform with its own cryptocurrency, Ether (ETH). It's widely used for its smart contract functionality, which enables automatic, decentralized agreements that execute when their conditions are met.\n\nDefinition Icon Ethereum (ETH) Ethereum is a blockchain created in 2015 that is supported by a decentralized network of computers all over the world.\n\nAn ETF is an open-ended investment fund that holds assets like stocks, commodities, bonds, or even cryptocurrencies. ETFs are unique because they trade on stock exchanges much like individual stocks, offering the liquidity and accessibility that typical mutual funds do not. Combining these, an Ethereum ETF is a type of investment fund that either holds Ethereum directly or invests in related derivatives like Ethereum futures contracts. This setup allows investors to gain exposure to Ethereum's market movements without buying and holding the actual cryptocurrency through a crypto exchange or dealing with the complexities of digital wallet security. Essentially, when you buy shares of an Ethereum-based ETF, you're indirectly investing in Ethereum's performance with all the trading ease of traditional stocks. Holdings What do Ethereum ETFs hold? Due to regulatory constraints, U.S. Ethereum ETFs are currently unable to hold Ethereum directly. Instead, these ETFs gain exposure to Ethereum through Ethereum futures contracts traded on the Chicago Mercantile Exchange (CME). These futures allow investors to speculate on the future price of Ethereum without the challenges -- such as security and custody -- of managing actual cryptocurrencies.\n\nSince these futures are based on Ethereum's anticipated future price, they provide a method for investors to gain indirect exposure to Ethereum's price dynamics. Due to the nature of futures trading, which requires a margin, it is common for Ethereum ETFs to maintain significant holdings in cash or cash equivalents. Low-risk assets, like money market funds, commercial paper, or Treasury bills, are often used as collateral for these trades. This setup ensures that the ETF can meet potential margin calls during periods of high volatility, thereby securing the leveraged positions taken on futures contracts. What is Ethereum? What is Ethereum? Ethereum, launched in 2013 by Vitalik Buterin, is a comprehensive decentralized finance (DeFi) platform for decentralized applications (dApps) and smart contracts that run autonomously without a central authority. Ether is Ethereum's native cryptocurrency and is essential for operating dApps and executing smart contracts. It serves as \"gas,\" paying for the computational resources needed to execute operations and giving Ethereum its value. Ether trades on various cryptocurrency exchanges and is used both as an investment and a utility token. In September 2022, Ethereum underwent a major update, transitioning from a proof-of-work (PoW) to a proof-of-stake (PoS) system. This shift significantly reduced the platform's energy consumption by changing how transactions are verified and blocks are added to the blockchain. Instead of miners solving puzzles, validators now stake Ether to earn the right to validate transactions and yield, enhancing Ethereum's sustainability and scalability. Spot ETFs Spot Ethereum ETF approval While Canadian securities regulators have allowed spot Ethereum and other cryptocurrency ETFs to trade since April 2021, the U.S. Securities and Exchange Commission (SEC) has been slower to adopt similar measures. This landscape shifted significantly on May 23, 2024, when the SEC finally greenlit spot Ethereum ETFs. However, these ETFs have not yet started trading in the market since the SEC still needs to approve the individual prospectuses submitted by ETF issuers aiming to launch these products. SEC Chair Gary Gensler has suggested that the process should be completed by the end of summer, although no specific timeline has been confirmed. Once these approvals are in place, though, spot Ethereum ETFs will be allowed to begin trading on exchanges.\n\nHow to buy How to invest in Ethereum ETFs Investing in Ethereum ETFs is straightforward and follows the same procedure as trading any other ETF or stock. Here's a step-by-step guide to help you get started: Figure out your position size: Decide how much of your portfolio you want to allocate to Ethereum ETFs in terms of dollar value. Consider whether this investment fits with your overall risk tolerance and investment strategy versus regular stocks. Pick the right ETF: In the next section, we've provided a table of the major Ethereum ETFs currently available. Choose the one that best meets your needs based on factors like fees, liquidity, and past performance. Search the ETF on your brokerage: Locate the ETF by typing its full name or ticker symbol into your brokerage's search function. Make sure you select the option for \"shares\" or \"equity\" to ensure you are purchasing the ETF itself and not options based on it. Enter an order: Specify the number of shares you wish to buy. You can place a market order, which executes the trade at the next available price, or a limit order, which sets a maximum price you are willing to pay and executes only if the share price meets or falls below this threshold. Finishing up: If your order is successful, your brokerage account will reflect the purchase, with the ETF shares added and the corresponding amount of cash deducted. Top three Top three Ethereum ETFs Here's an overview of the largest Ethereum ETFs on the market in terms of assets under management (AUM):\n\nLargest Ethereum ETFs by assets under management, June 2024. Fund Name Ticker Symbol Net Expense Ratio ProShares Ether Strategy ETF (NYSEMKT:EETH) 0.95% VanEck Ethereum Strategy ETF (NYSEMKT:EFUT) 0.66% Bitwise Bitcoin and Ether Equal Weight Strategy ETF (NYSEMKT:BTOP) 0.85%\n\nRelated investing topics\n\nOutlook An outlook for Ethereum ETFs Currently, investors can trade Ethereum futures ETFs, and with the recent SEC approval, spot Ethereum ETFs are expected to hit the market soon. The ETFs offer the convenience of trading through a regular brokerage account, eliminating the need for a crypto exchange or self-custody of digital assets. However, it's important to note that these ETFs incur expense ratios and do not offer the 24/7 trading capability that direct investments in the cryptocurrency sector provide. Looking ahead, much like Bitcoin ETFs, which have attracted significant investor interest and led to new price highs for Bitcoin, Ethereum ETFs may similarly benefit from substantial inflows and expanded interest from retail investors.\n\nFAQ\n\nInvesting in Ethereum ETFs FAQ Which Ethereum ETF is best? angle-down angle-up There's no universal answer, but the VanEck Ethereum Strategy ETF (NYSEMKT:EFUT) is a great candidate with a lower 0.66% expense ratio. Is there an Ethereum ETF in the U.S.? angle-down angle-up U.S. investors can currently buy Ethereum futures ETFs. Spot Ethereum ETFs, which were recently approved, are still awaiting launch. How to get Ethereum ETFs? angle-down angle-up You can buy shares of Ethereum futures ETFs via most brokerages. Spot Ethereum ETFs are still unavailable. Is there an Ethereum spot ETF? angle-down angle-up Spot Ethereum ETFs are available on Canadian exchanges, denominated in both Canadian and U.S. dollars. U.S.-listed spot Ethereum ETFs are still unavailable, although they have received regulatory approval."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQNF9lbXViZkk1RG16Z01Jb0pDOGxIMUNyRGxnNXZZc3JVdFp2cDd2UVAxV3NjUE5Qbks0QnVucTlBOUZWZDZwUzNXRDYyN0dmVVpmekM5Y0UwMU5Kd05nX0U1X0ZoN2tiWE43MDh2SS1UX0M5azNFRDlMNHlVU3VPVnVzT0h0MmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "US Spot Ethereum ETFs Could Launch on July 4: Report - Unchained",
        "content": "A lawyer for one of the prospective issuers said that the approval process for a spot Ethereum ETF was “down to the finishing touches.”\n\nThe U.S. Securities and Exchange Commission (SEC) is reportedly in the final stages of reviewing offering documents from prospective Ethereum ETF issuers.\n\nAn early July launch date for spot Ethereum exchange-traded funds (ETFs) looks increasingly likely, according to statements made by industry executives to Reuters on Wednesday.\n\nThe U.S. Securities and Exchange Commission (SEC) is reportedly in the final stages of reviewing offering documents by prospective issuers. Two executives from these firms said that only “minor” issues in these filings were still being ironed out.\n\nIn light of these talks between the securities regulator and asset managers reaching the closing stages, people with knowledge of the matter told Reuters that they expect a spot Ethereum ETF to be launched as early as July 4.\n\nA lawyer for one of the issuers also said that it was “down to the finishing touches,” relaying optimism that the fund’s launch was no less than a week or two away.\n\nBlackRock, Fidelity, VanEck and Franklin Templeton are among the eight issuers hoping to launch a spot Ethereum ETF next month, and have been laying the groundwork for their approval over the last few months.\n\nEarlier this week, VanEck filed a form 8-A with the SEC, which is one of the standard filings that must be submitted before securities can be offered on an exchange. On the same day, SEC chair Gary Gensler noted that the process of reviewing issuer documents was “going smoothly.”\n\nIndustry watchers had largely mixed views on how a spot Ethereum ETF would affect the wider narrative around ether as an asset class. Some argued that the news was already priced in to the market, while others claimed that the event would trigger positive price momentum for the second largest digital asset.\n\nEthereum has recently turned inflationary after the fee-reducing Dencun upgrade took effect, leading to a lower amount of fees burned and a higher number of tokens in circulation. One area that market participants will likely be watching closely is the impact spot Ethereum ETFs will have on ether’s supply and demand dynamics."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNSWNnUTFNZ3dRTWJtVXpyOFhobXExLWM3V2NaeW5PMTJCc1dFUnhEZUdLZUFUc1RqN2tHXzdWVmtPWmpjRnpHZ0xtTWpNMzdNbkc0OG5SY1BQMHJ2WDNBOURCTVFDUE1YNTFNSnRoaGV1Y2oxMXgxZl9lQWJvSFhVZXRVOVRPSFYtVnlhU3otTWxzSkRRSlkxb0NMRmxfdUFzNEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs are coming. Can they revive tepid crypto markets? - Fortune",
        "content": "Not one to show his hand, SEC Chair Gary Gensler still gave as optimistic a prognosis on Ethereum ETFs as could be expected yesterday, speaking at the Bloomberg Invest conference. In between his usual frosty statements on the crypto sector, including accusing his interviewer of going after “clicks,” Gensler said the process of working with issuers was “going smoothly.”\n\nThe rare acquiescence from Gensler seems to confirm predictions from the Bloomberg soothsayers that the ETFs could launch as soon as July 2. With crypto assets from Coinbase to Bitcoin cratering in recent days, could the arrival of an Ethereum ETF reinvigorate the bull market? After all, the approval and launch of Bitcoin ETFs back in January served as a catalyst for the current rally.\n\nThe short answer is: probably not. Ethereum has always been the less-loved younger sibling to Bitcoin, even with its newfangled capacity for smart contracts, improved transactions, staking, and a slew of other advantages. It’s been years since anyone predicted the “flippening”—that fabled day when Ethereum overtakes Bitcoin—with a straight face.\n\nI caught up with Christopher Perkins, the president of the VC firm CoinFund, who told me that one of the main challenges for Ethereum will be branding. Bitcoin is easy. The proto-cryptocurrency laid claim to the moniker “digital gold,” which any investor can understand. A baby boomer looking where to allocate the millions of dollars scored from selling a house they bought in 1970 for $10,000, however, might have a harder time understanding the value proposition of Ethereum. What exactly is a smart contract, and why should we care? “Those boomers, with the money—they don’t ape into things,” Perkins told me.\n\nEven with the hype around the Bitcoin ETF, we’re seeing slow adoption as investors grow more comfortable with the new asset class. As Perkins said, ETFs offer two main advantages: regulatory certainty coupled with operational scalability, or improved user experience. Bitcoin, thanks to its early commodity designation, was never really in a regulatory gray zone, though ETFs made it easier for people to buy them directly into their brokerage accounts, rather than setting up a Coinbase or Robinhood account. With Ethereum, however, the approval and launch of ETFs does genuinely create a safety moat that didn’t exist before, especially after months of speculation that the SEC would reject the applications.\n\nFurthermore, an Ethereum ETF that offers yield could be a game-changer, if the SEC ever approves them. Last year, Perkins spearheaded a project to provide a benchmark rate for the staking yield on Ethereum, which he pointed out is often higher than Treasury rates, when adjusted for inflation. “The ETF is going to be very important, but it’s also imperfect because it’s going to deprive investors of that yield out of the gate,” he said.\n\nSo if Ethereum ETFs do finally come next week, or soon after, don’t expect a spike in adoption. But Perkins said to take a long-term view: “This is just another step in mainstreaming and regulatory de-risking.”\n\nLeo Schwartz\n\nleo.schwartz@fortune.com\n\n@leomschwartz\n\nDECENTRALIZED NEWS\n\nCoinbase shares are down as crypto markets face a downturn amid macro uncertainty. (Fortune)\n\nThe official X account for Metallica appears to have been hacked after exploiters posted about a Solana token called METAL. (Cointelegraph)\n\nThe Jack Mallers-run Bitcoin app Strike entered the U.K. amid a Europe expansion. (CoinDesk)\n\nCreditors are gearing up to vote on a reorganization plan for the bankrupt FTX after revealing the proposal in May. (The Block)\n\nA Telegram-based crypto app called Hamster Kombat has enjoyed massive success in Iran ahead of presidential elections. (Associated Press)\n\nMEME O’ THE MOMENT\n\nSam Trabucco and Kanav Kariya riding into the crypto sunset:"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQS2dGeUZlMGxPRDBNbWlEaDE5ajdJNFZ5dDZPY09WSENUSmJwUnVvSDdKWTRoeHk3aW1HS1luRU5uTXA1V19YdzduenUyVkdpNGhNWG1YWTFyeENSV1h3eTZjRjBJUGw3ZVBxcHJjVGNjUHNqb1prZGN3dWJnNjhGN3Z4bTNXZl80LUlzb0FNaFFXc3g5WWRlS1ZSV3BCblJtTXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Faces Challenges Amid Price Struggles and High Fees - The Dales Report",
        "content": "The TDR Three Key Takeaways regarding Ethereum and Its Challenges:\n\nEthereum price movement, dipping to $3,250 before a slight recovery to $3,400, has raised concerns among investors. Economic factors such as inflation and rising interest rates still pose significant challenges for Ethereum. The futures market’s sentiment indicates that a rally to $3,700 is highly unlikely in the near term for Ethereum.\n\nEthereum faced significant price struggles, dropping to its lowest level in over a month. This price movement, dipping to $3,250 before a slight recovery to $3,400, has raised concerns among investors and analysts alike.\n\nThe primary focus remains on the upcoming launch of a spot Ethereum ETF. Despite initial excitement, analysts have tempered their expectations. Stephen Richardson, managing director of financial markets at Fireblocks, expressed skepticism and reported on Cointelegraph, stating he expects significantly lower inflows at the Ethereum ETF launch. This cautious outlook stems from broader economic challenges, including inflation and high-interest rates, which continue to affect the cryptocurrency market.\n\nRegulatory scrutiny around Ethereum has eased, creating a more favorable environment for investors. However, economic factors such as inflation and rising interest rates still pose significant challenges. These macroeconomic trends impact consumer confidence and investment behavior, affecting the overall attractiveness of Ethereum.\n\nOne of the critical issues Ethereum faces is its high network fees. The blockchain’s gas fees can deter users, pushing them towards other networks like BNB Chain and Solana, which offer lower fees. This competition is evident as these alternative blockchains capture more volume and generate significant daily revenue, despite having fewer deposits. ETH’s weekly revenue is relatively low compared to its market capitalization, raising questions about its valuation and growth potential. Markus Thielen, head of research at 10x Research, reported on Cointelegraph pointed out that the revenue it generates is minuscule compared to its market capitalization, indicating that the asset does not currently represent a viable, sufficiently cash-flow-producing investment.\n\nSentiment in the Ethereum futures market has shifted to a neutral range. This change reflects a lack of strong bullish sentiment, as evidenced by the futures premium falling below 10%. The cautious stance of professional traders highlights the uncertain outlook for ETH. The futures market’s sentiment indicates that a rally to $3,700 is highly unlikely in the near term.\n\nAdditionally, Ethereum faces stiff competition from other blockchains like Tron and Solana. These platforms, despite having fewer deposits, manage to generate significant daily revenue, underlining the competitive challenges ETH must overcome.\n\nEconomic conditions, consumer confidence, and interest rates impact Ethereum’s market dynamics. High network fees, competition, and economic factors present challenges, and analysts are skeptical about significant gains from the upcoming spot Ethereum ETF launch. A rally to $3,700 seems unlikely in the near term.\n\nWant to be updated on Cannabis, AI, Small Cap, and Crypto? Subscribe to our Daily Baked in Newsletter!"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOWk04YVU4eU5GVU5kaUJpOEhaaURxRFhJRHhJN2FHeHNwMlVCOHpxaW1taDlVVzZUYnlGQWptaWkzbUpJU1ZPUGhXS1hEQmxuc091Wi13d0JLZmhKOXVDV2hNNURDNTV4UFdEWUVQOXFNT3NCMjNWdjh6bmJFVTVmOFlMODhmZXZ0bjhfMnRLaV9mcUVJb1hhemg3RVBkaU1CRHZrUTIwOFVMSkZ1UmhwYkEweHhCYWcyd3ljZHBOemtFMW5JS0lfVnFJcjZCcHVmYlRsUk13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Inflows Could Be Up To 50% Of Bitcoin ETF Inflows: Galaxy Research - Benzinga",
        "content": "The cryptocurrency market is bracing for a potential influx of new investment as Ethereum ETH/USD spot exchange-traded funds (ETFs) near trading launch in the United States.\n\nWhat Happened: A new report by Galaxy Research suggests these new financial products could attract substantial capital, potentially reshaping the Ethereum ecosystem, Coindesk reported.\n\nAccording to Galaxy analyst Charles Yu, “We expect the net inflows into ETH ETFs to be 20-50% of the net inflows into BTC ETFs over the first five months, with 30% as our target, implying $1 billion/month of net inflows.”\n\nThis projection underscores the significant interest anticipated in Ethereum ETFs once they become available to U.S. investors.\n\nThe path to Ethereum ETF trading has been cleared following the Securities and Exchange Commission’s (SEC) approval of applicant filings last month.\n\nHowever, the final hurdle remains the approval of S-1 filings, which is necessary before these products can begin trading.\n\nGalaxy’s report draws parallels between the expected demand for Ethereum ETFs and the successful launch of Bitcoin spot ETFs in January.\n\nThe research suggests that independent investment advisors and broker/dealer platforms will likely drive new demand for these Ethereum-based products.\n\nAlso Read: Uncle Sam On The Move: US Government Transfers Millions In Bitcoin To Coinbase\n\nWhy It Matters: Interestingly, the report highlights Ethereum’s unique market dynamics, suggesting it may be more sensitive to ETF inflows than Bitcoin BTC/USD.\n\nThis sensitivity is attributed to the significant portion of ETH supply locked in staking, bridges, and smart contracts, coupled with lower holdings on centralized exchanges.\n\nHowever, Galaxy also notes potential challenges for Ethereum ETFs.\n\n“Galaxy cautioned that spot Ethereum ETF demand may be limited due to the lack of staking rewards,” the report states, highlighting a key difference between holding ETH directly and through an ETF.\n\nThe conversion of the Grayscale Ethereum Trust ETHE into an ETF is expected to influence market dynamics. Galaxy estimates that “these negative flows could be about 319,000 ETH per month or $1.1 billion.”\n\nHowever, the report suggests that the impact may be less severe than what was observed with the Grayscale Bitcoin Trust GBTC conversion.\n\nWhat’s Next: As the cryptocurrency market eagerly awaits the potential approval of Ether ETFs, which could come as soon as July 4 according to a recent Reuters report, investors and industry professionals are keen to understand the implications of these new investment vehicles.\n\nFor those seeking deeper insights into the future of Ethereum and the broader digital asset landscape, Benzinga’s Future of Digital Assets event on Nov. 19 promises to be a crucial forum.\n\nRead Next: U.S. Offers $5M Reward For Information On Crypto Fraudster Ruja Ignatova\n\nImage: Shutterstock"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOaDRRTDVacnUtYWp2R0JoZV8zaWItc0syajlFTkVZZjRPc1hjNVpaQnRwQ2I2U2VpYmpldjNFeXVHamU1OFR0ODNsQU02T3R4UDNpcWVOaEdJRjBZZnNvd1E5M0FiQk41MTdqdzZ2c21IdlhiWktQVXd2N1I2ZnRwdTM3eEtmZ0lvalI4eU5LaVFZdkdsdWRVcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ether to $7,000? Six experts on how Ethereum ETFs will unleash a ‘floodgate’ of demand - DLNews",
        "content": "The launch of spot Ethereum ETFs are expected any day now.\n\nSome market watchers expect the price to surge to $7,000.\n\nOthers are more cautious.\n\nThe launch of Ethereum spot exchange-traded funds is imminent.\n\nBloomberg Intelligence analyst Eric Balchunas said on Tuesday that issuer VankEck’s 8-A form submission was “good sign” for a July 2 launch date.\n\nIndustry executives told Reuters that the ETFs could launch before July 4.\n\nAs excitement builds, demand for futures bets on Ether via the Chicago Mercantile Exchange surged 105% to $1.32 billion — close to the exchange’s all-time high Ether open interest of $1.35 billion.\n\nBut what do the experts say? We found out.\n\nLekker Capital’s Quinn Thompson\n\nThe way Quinn Thompson sees it, being bearish has never been so cool amongst crypto investors as it is now — and that’s bullish.\n\nIn a Wednesday X post, Thompson forecasted a period of calm as sellers tire before a “slap in the face” type moment shows them their outlook is too bearish.\n\nThat could look like positive spot Ethereum ETF flows upon launch, or even something as simple as competition among ETF issuers to offer the lowest fees, he said.\n\nJoin the community to get our latest stories and updates\n\nVanEck has already said it won’t charge a fee for its spot Ethereum ETF.\n\nThompson finished with a bold price prediction: “Ether will reach $7,000 and Bitcoin will make its first attempt at $100,000 by the election in November.”\n\nBitwise’s Matt Hougan\n\nEthereum exchange-traded products will attract $15 billion in net flows in their first 18 months on the market, Bitwise’s Matt Hougan said in a recent X post.\n\nHougan based his prediction on data from Europe and Canada, where crypto ETFs have established markets.\n\nWhile $15 billion is significantly less than the $56 billion investors have piled into US Bitcoin ETFs, he still said such a figure would be a “historic success.”\n\n“Only four ETFs launched since January 2020 have gathered $15 billion in flows,” he said, adding that he believes Ether’s best days are ahead of it.\n\nHougan’s analysis came with a caveat, though.\n\nHe said there’s a “good chance” of initial net outflows from Ethereum ETFs after their launch as traders who played the discount-arbitrage game redeem out of Grayscale’s Ethereum Trust.\n\nQCP\n\nSingapore-based QCP is also looking at the Bitcoin ETF launch for clues.\n\n“If the Bitcoin ETF approval was any indication, we could see a similar 60% rally from here,” the firm said in a Monday note.\n\nWith today’s prices, that would translate to Ethereum trading at around $5,430 in the months after its ETF launch.\n\nQCP also spotted a market mismatch that could boost Ether’s price in the short-term.\n\nBased on VanEck’s S-A filing, and the fact that its ETF is already listed by the Depository Trust and Clearing Corporation, QCP said trading for the ETFs could start as early as next week.\n\nThe firm noted, however, that the Ether options market for July doesn’t appear to have reacted.\n\n“If there is a substantial breakthrough in the approval process, it could catch the market by surprise,” QCP said on Wednesday.\n\nConsensys’ Joe Lubin\n\nExpect a “floodgate” of demand for Ether, which will likely lead to a supply crunch and drive prices higher, says Joe Lubin, co-founder of Ethereum and founder of crypto infrastructure firm Consensys.\n\nInstitutions that have already gained exposure to Bitcoin ETFs “will most likely want to diversify into that second approved ETF,” Lubin told DL News.\n\nBernstein\n\nSpot Ethereum ETFs will drive a 75% surge to $6,600, according to analysts at research firm Bernstein.\n\nThey extrapolated that number by looking at how the SEC’s approval of spot Bitcoin ETFs in January spurred a 75% rally in the following weeks.\n\n“We would expect similar price action for ETH,” Gautam Chhugani and Mahika Sapra said in a recent report.\n\nCrypto market movers\n\nBitcoin is down 0.1% over the past 24 hours to trade at $61,141.\n\nEthereum is up 0.6% to $3,398.\n\nWhat we’re reading\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Reach out to him with tips at tim@dlnews.com."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE1sOHp0LTVaZGhISDM2NGY1VlVGRktuLW5wMmRvWWZEU0UyUFdxc3RYTjBqdEFfeTFYZ3FZa1h0ZjVLejBQWEZ3QjQwSG8tRWlWQ0YzUnpCams0RjRvTzF3YVB0eXEtaTFY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF to attract $15 billion by 2025's end: Bitwise CIO - Crypto Briefing",
        "content": "Ethereum ETPs to potentially reach $35 billion, aiming for market parity.\n\nShare this article\n\nEthereum (ETH) exchange-traded products (ETPs) are set to draw $15 billion in net inflows within the first 18 months of their launch, according to Matt Hougan, Chief Investment Officer (CIO) at Bitwise. In a recent report, Hougan underscored that Bitcoin and Ethereum ETPs should capture net inflows comparable to their market cap, where ETH gets 26% of the combined market.\n\nCurrently, US investors hold approximately $56 billion in Bitcoin ETPs, and the Bitwise CIO expects this to rise above $100 billion by 2025. Ethereum’s market cap, which stands at $432 billion, suggests a substantial potential for asset inflow, aiming for parity with Bitcoin ETPs at around $35 billion.\n\n“For starters, the Grayscale Ethereum Trust (NYSE: ETHE) is expected to convert to an ETP on launch day, bringing $10 billion in assets with it. Net that out and we’re left with $25 billion in inflows to reach parity,” he highlighted in the report.\n\nHowever, Hougan points out the fact that Ethereum ETPs are slightly underperforming their absolute market cap weight, as they are currently gathering 22-23% of total assets under management versus a 26% market cap weighting.\n\n“I can imagine various reasons, including that Bitcoin ETPs arrived first in many of these markets (as they did in the U.S.). Some investors may have bought a Bitcoin ETP and stopped there, thinking their crypto exposure was covered. I suspect this dynamic will be true in the U.S. as well,” he added.\n\nTherefore, Hougan lowered his expectations from $25 billion to $18 billion, excluding the assets from Grayscale’s trust.\n\nAdditionally, there’s another factor taken into consideration by Bitwise’s CIO, which is the “carry trade.” Carry trade involves buying spot Bitcoin ETPs and selling Bitcoin futures contracts against that position, and traders profit from the premium between futures and spot prices.\n\n“I don’t expect Ethereum will have the same dynamic—the Ethereum ETP carry trade isn’t profitable right now for institutions (in part because U.S. Ethereum ETPs won’t engage in staking their assets). For that reason—and to keep my estimate of Ethereum ETP flows on the conservative side—we need to remove the $10 billion in carry-trade-related AUM when sizing the Bitcoin market.”\n\nAs a result, Bitcoin’s initial denominator of $100 billion falls to $90 billion, and the adjusted estimate for Ethereum ETPs’ net inflows becomes $15 billion."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFB5QkdTcGI3a0NOd2RTU3NzQTBWZ1gwbExJamIxX05SNjVhNWtYdEQ0dmdvVlkzbFhscFREOFU1WkVRUjgtM1NuVFdIczk2VUFsVHJZQjJaQ2ttajE1aHRLVXR2UnFZT3FBLVpsN054blZ0UDlNWUHSAXtBVV95cUxPSkktUkU2YjNtYVotdUl3bGVPYXdzUC1NMFNqWjhCT0FYeVJxQTQ4RFZWRzA1M2NLNW4tbWJuTmRNcFR2NzRad2J5OHIxN29KM2lnODl4aFpjRGVpWG9BTTV2RGN0dXl2Y2tmTUF6VlZwUlhhVlFGSEhEZEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Records Major Bullish Sign Against Bitcoin - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) might finally be ready (BTC) to gain some ground against Bitcoin.\n\nAdvertisement\n\nAs noted by prominent trader Josh Olszewicz, the ETH/BTC pair has managed to close above the two-day Ichimoku cloud for the first time in 525 days.\n\nfor the first time in 525 days, ETH/BTC has closed above the 2-day Cloud pic.twitter.com/ihwRBF6uY1 — #333kByJuly2025 (@CarpeNoctom) June 27, 2024\n\nHis analysis suggests that the pair has likely bottomed after nearly two years of underperformance.\n\nAdvertisement\n\nThe flagship altcoin is currently changing hands at 0.055 BTC on the Binance exchange.\n\nAfter peaking at 0.061 BTC back in January, the ETH/BTC pair experienced a substantial downtrend, plunging all the way back to 0.044 BTC in May. However, Ethereum managed to gain as much as 28% against the largest cryptocurrency during the same month following the unexpected approval of several 19b-4 forms for Ethereum exchange-traded funds (ETFs) by the U.S. Securities and Exchange Commission.\n\nThe approval process is now going \"smoothly,\" according to SEC Chair Gary Gensler , and it seems like these products will be able to start trading in the near future.\n\nEarlier today, Reuters reported that Ethereum ETFs would likely go live by July 4. According to the anonymous sources cited by the outlet, the talks between prospective ETF issuers and the regulator have advanced to the \"final stages.\" Now, only \"minor\" issues have to be resolved.\n\nEven though the expected launch of Ethereum ETFs could be a major bullish catalyst for the leading altcoin, it remains to be seen whether inflows will be impressive enough for the market. Morningstar's Bryan Armour has noted that Ethereum ETFs would be unable to generate the same level of excitement as Bitcoin ETFs."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNeFVfUmszbVBzZExEVUROY0x3RjMtVEtoQVRDckNVc3dfODBzWVRJbzRkeG0wNWJTWkZKMjB6OEgydzRoRDNSMkpvd0I3WjhJa3RGaXpMTHZEVnpuN1hnR3lqV1kwaC1vNEl6bDhqblQwcXBjYl9aOGZ2QlFNa0tMZUtFVElSSFNDYlZ5OExFZEZrb1RsbEx1MVZYanY5Z3BsVVVhOHRxWjDSAa4BQVVfeXFMUDZlUHU2U0l5RjlVbkZzUDFMMTJuZEh0dTVWd0RRYlJnc2xyNkJRT3hYU2pRd2RXdVI2RGR5RUVTWDNMaVF1d3pTbzNra2Ewdm1iVm5aLTVyRjExamduLTlLS3hRWVdCQkJPd3RuMk1RTnhMY0ktdlFXQ2c0cjkzeGxIcmMxZWFaemlQYmV3YmF4WGVydjNxYVJ0MkZlby1XN184Y3JaZkt5VzRlMUZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Still Ultrasound Money? Here’s How Much Ethereum Supply Has Inflated Since Dencun - CryptoPotato",
        "content": "Ethereum’s status as an ultrasound money system becomes increasingly questionable as the days go by, especially as its supply keeps increasing at a high rate.\n\nSince mid-April 2024, about a month after the Ethereum network underwent the Dencun upgrade, more than 112,000 ether (ETH) has been added to the market at the fastest daily rate after the Merge.\n\nThe Effects of Dencun\n\nOver the years, Ethereum has witnessed several developments that have led to the network are we know it today The Merge in September 2022 marked its transition from a proof-of-work consensus mechanism network to that of proof-of-stake.\n\nIn mid-March, Ethereum underwent another upgrade that reduced the transaction fees of its layer-2 networks by roughly 4x and enhanced the blockchain’s scalability by expanding its capacity. Dencun introduced nine Ethereum improvement proposals (EIPs), including EIP-4844, which implemented proto-danksharding, a mechanism that allowed for data blobs.\n\nWith blobs, layer-2 solutions like Arbitrum, Optimism, and Polygon became able to submit transaction data to Ethereum for collective settlement within a dedicated blobspace without additional expenses.\n\nIt is worth noting that Ethereum implemented some upgrades to ensure it remained deflationary before Dencun came. One such was the London upgrade that took place in August 2021. London introduced a mechanism that removed ETH from circulation with every transaction by burning a portion of the network’s gas fees. The Merge further cemented this approach to deflation and lowered ETH’s inflation rate by 90%.\n\nETH Now Inflationary\n\nSince Dencun, Ethereum’s transaction fees have been low, meaning less ETH has been burned. On-chain analysts believe Ethereum is no longer deflationary, as the new ETH supply has turned positive. The amount of fees burned on Ethereum is no longer positively correlated with higher network activity; fewer fees are burned regardless of how many users are transacting on the network.\n\nNevertheless, the total supply of ETH since the Merge has plunged significantly, with an overall reduction of 345,000 ETH. Around 1.36 billion ETH has been issued, but more than that has been burned.\n\nWith Ethereum’s inflationary rate increasing post-Dencun, the purchasing power of ETH is reducing, which may have a negative impact on investors.\n\nMeanwhile, ETH was worth $3,374 at the time of writing, down 4.8% in the past week in correlation with the drawdown in the crypto market."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQT29DSVVnT0o2ajhicTRBLXY4UGs3bG9BWThfSklZS3ZpRWQ4NS1BalBPVXltRkdRZkozNlBQcXBiUXJ6X3BZSmhfOWJhM09mX01YOEdEalpkejVnS1MyZGFWbHNoM2o1b3hDZEtjV0t5WnJtdUw2aGZjWDF1S3pJRzBvYTR3U1BFc0o3NHZLZ2hweGhESl9DcWJ3Y2dXcVhyZ0Vj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "BloFin believes spot Ethereum ETFs will drive short-term surge in ETH prices - CryptoSlate",
        "content": "Crypto exchange BloFin believes the imminent launch of spot Ethereum exchange-traded funds (ETFs) in the US will drive a short-term surge in ETH prices as investors shift their attention from Bitcoin to the second-largest crypto asset by market capitalization, according to a June 26 research note shared with CryptoSlate.\n\nThe exchange, citing various data points such as options skewness, portfolio adjustments, and whale holdings, noted that the ETFs’ launch would likely boost Ethereum’s short-term price.\n\nBloFin analysts said:\n\n“The relative strength of BTC has lasted for several months, but investors are changing their views: they seem to believe that the performance of ETH will strengthen for some time with the listing of the spot ETH ETFs.”\n\nLast month, the US Securities and Exchange Commission (SEC) approved key filings for spot ETH ETFs, surprising many market participants. Since then, the ETH ETF applicants have been engaging with the regulator’s staff, and there are rumors that these financial instruments could start trading as early as the first week of July.\n\nBullish ETH expectations\n\nBloFin observed that Bitcoin’s skewness data had been more bullish than Ethereum’s for the majority of this year. However, the trend has reversed in recent weeks, with investors’ short-term expectations for Bitcoin now “neutral” and “slightly bearish,” while expectations for Ethereum are more bullish.\n\nAlthough investors remain bullish on Bitcoin’s medium and long-term performance, their optimism for Ethereum has surpassed that of the top crypto in the shorter time frames.\n\nThe analysts explained that one of the reasons driving this change is the potential for higher returns. According to the note:\n\n“Assets with relatively low market cap and relatively high volatility have a better potential for returns during the interest rate cut cycle.”\n\nBloFin also anticipates that the “asset allocation period” following the approval of spot Ethereum ETFs will positively impact ETH’s price, similar to Bitcoin’s experience in February and March.\n\nAdditionally, the latest forward exchange rate term structure of ETH/BTC suggests that investors believe ETH will outperform BTC in the coming months, pushing the exchange rate higher in the short term.\n\nAccording to the analysts:\n\n“The Risk Premium difference between ETH and BTC has also converged to within 25[basis points], and investors are looking forward to the potential new wealth effect brought by ETH after the listing of spot ETH ETFs.”\n\nBloFin highlighted that on-chain data further supports its bullish outlook. According to the firm, ETH whales have stopped selling their holdings, while BTC whales continue to reduce theirs.\n\nThe firm noted that this might be due to miners regularly selling BTC for cash, but it could also indicate investors readjusting their portfolios.\n\nMentioned in this article"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPbVFlUmdrTUhYdkVmWXhkdlRUX0RQOWRuZWY4SGFEQ2JvMmZ6dkNMaWJKemNxcFczQlpOOWlzSmJheW9fTW5vWlJ3MlBiNnBCUTlQRVVKMFBKVmpQbHZ3NjQwa0ZPQ1E3N2ticDVZRHQ3WnA5eXBLaVA5aHAteDVhYXk0VGFjUWtU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Prediction: Ethereum Could Skyrocket to $22,000 by 2030 - The Motley Fool",
        "content": "Ethereum continues to be a tech disruptor. But will it really be worth over $2 trillion by 2030?\n\nThrough the first six months of the year, Ethereum (ETH -5.65%) is up 50%. That's right in line with the performance of Bitcoin (BTC -3.04%), which is also up 50%. At its current price of $3,500, Ethereum is within striking distance of its all-time high of $4,891.\n\nBut the best may be yet to come. Investment firm VanEck recently predicted that Ethereum could hit a price of $22,000 by 2030. That might sound overly aggressive, but VanEck has some solid data to back up its prediction. So will it be right or not?\n\nEthereum's disruptive ability\n\nFor the better part of the past decade, we've seen Ethereum disrupt the tech sector. Ethereum was the first smart contract blockchain platform. It pioneered entire sectors of the crypto world -- such as non-fungible tokens (NFTs) and decentralized finance (DeFi) -- that had never existed before. VanEck is counting on Ethereum's ability to remain a tech disruptor over the next five years to warrant such a hefty valuation.\n\nMost importantly, VanEck sees Ethereum making further inroads into the finance, banking, and payments sectors. And VanEck also sees Ethereum building value in sectors ranging from blockchain gaming to artificial intelligence (AI). The key to disruption will be Ethereum's ability to provide solutions that are cheaper, faster, and better than those currently available from market leaders.\n\nThe $15 trillion opportunity\n\nThat's where things get interesting, because VanEck digs into the numbers to estimate the total potential market opportunity (which it refers to as total addressable market, or TAM). That number could be as high as $15 trillion. The lion's share of this value ($10.9 trillion) will come from finance, banking, and payments. And there is a growing market opportunity ($1.4 trillion) that could result from artificial intelligence.\n\nThe logic here is simple but powerful: Ethereum will continue to roll out disruptive solutions that make it possible to win market share from entrenched incumbents. And the big push will be in DeFi, where a rich, vibrant ecosystem already exists. Just think of how upstart decentralized cryptocurrency exchanges are winning market share from centralized cryptocurrency exchanges such as Coinbase Global (COIN -7.39%).\n\nWhen you consider key future trends such as asset tokenization (which involves moving real-world financial assets onto the blockchain), it's possible to understand just how big the DeFi opportunity might be. Cathie Wood of Ark Invest, for example, has suggested that smart contract networks such as Ethereum could be generating fees of $450 billion by 2030.\n\nThe new ETFs\n\nAnd, finally, there's the matter of the new spot Ethereum ETFs. These recently won approval from regulators and are expected to start trading soon. Once they do, they could lead to a huge influx of new money into Ethereum. VanEck now predicts that the impact of these new ETFs could be greater than that of the spot Bitcoin ETFs.\n\nThat's highly debatable, though. As one of the firms that will be launching a spot Ethereum ETF, VanEck may be overestimating the potential impact of these ETFs. In comparison, JPMorgan Chase (JPM -1.81%) predicts these new ETFs might only attract $3 billion in new investor money. That's about one-tenth of what the new spot Bitcoin ETFs have attracted.\n\nA $2 trillion asset?\n\nVanEck provides three different scenarios for the future value of Ethereum. In the base case scenario, VanEck predicts a price of $22,000. In the bull case scenario, VanEck predicts a price of $154,000. And, in a bear case scenario, VanEck predicts that the price of Ethereum could collapse to just $360. Yikes!\n\nThat's a wide range of outcomes to work with, and that's what makes investing in Ethereum potentially so risky. Yes, Ethereum could soar to a price of $22,000, giving it a massive $2 trillion market cap. But it could also lose nearly 90% of its value and be banished to the dustbin of history.\n\nKeep in mind that Ethereum is not the only blockchain going after that $15 trillion market opportunity. There are plenty of other blockchain competitors, each one promising solutions that are cheaper, faster, and better. So if you're thinking about investing in Ethereum, make sure you do your due diligence and have a good grasp of the assumptions being used to predict a price of $22,000."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE9YZFdDaHRCOG4wVWFNbTF4aHliOXBlWVo0a0hHdVctQ1ptR2pFaThTX0kyZ2pUbzhsYkpMekV4UldaQ0xQTGY1SDFEeEw5dzdHbG56dy1ZVTRRU0R5dWlydEhraVQzeDFI0gFuQVVfeXFMT1R0VmxYbGtHSVRMSzhneGgyMG1kd2tXR2o2YVIwRnFJT3VNbjQ1QkpuVGZleGVFczQxbGJHQUdWRHZNVGNJNE5qY0lSUmZzSGdEQngxczMwcHdCbVVmZnJ4ZVhmMUJDemhvR3Y5cGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Cardano Boosts Connectivity with Ethereum - U.Today",
        "content": "The Cardano Foundation, the non-profit organization behind the popular proof-of-stake blockchain, has boosted the level of interoperability by integrating the Inter-Blockchain Communication protocol.\n\nAdvertisement\n\nThe integration now makes it easier for developers to Ethereum Virtual Machine (EVM)-based applications on Cardano sidechain.\n\nThe standardized protocol, which was originally introduced back in 2019 by Cosmos Network, makes it possible to bridge several heterogeneous blockchains by sending information via special channels. Data can be easily transferred by blockchain with different consensus mechanisms. No direct communication between them is required in order to ensure the validity of certain information.\n\nAdvertisement\n\nWith Cardano, for instance, enterprises that rely on the ICB protocol can still take advantage of the network's deterministic fees and other advantages while working with other chains. \"With the implementation of IBC on Cardano, businesses benefit from a framework for developing and deploying scalable, secure, and interoperable blockchain solutions,\" the foundation said.\n\nA governance controversy\n\nIn other news, the foundation recently stirred some controversy with its voting decision earlier this week.\n\nDuring a bootstrapping phase, which will take place between the two stages of the hard fork's implementation, the foundation will become a member of an Interim Constitutional Committee (ICC).\n\nIt has already taken part in the ICC election, placing The Cardano Atlantic Council at the top of its ratings. When voting for candidates, it takes into account such factors as the level of engagement, technical expertise, transparency, and so on.\n\nHowever, the foundation faced some pushback from some members of the community who believe that it had to rule itself out from the entire ICC voting process. \"I think it is wrong that Cardano Foundation should put their thumb on the scales,\" one user commented."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE55QURxZVR0S0VKUzM2eUNxUG1nUFIxamxJVG9uZy1WcmkwQ0lsOGQwa1VIaFJhOUxLUzVXNlY4UTdOOGdqUVQwUGRSUk11R2NBX3BsandVZ3htQmFYNzc3ajhjTW1SSTJIZXhQSFhSUVRURElvWTI0c2FFZ2XSAYIBQVVfeXFMTUxwaGFsQXhSS09YSFJsVmp5Rm80dlZweUU4MG9OS3VPZ1RIcElZdjF1MFk5N2tOOWI2UkhjM0FUMWpRTmRsdl9SMzFSYjR2YkRLQkVOSWJYUjUyZ1BsOVpCdjBIRENRenVKaWlOcDRFQm1ia1FvUXVKSm5kRHdIMnJpZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Major Investment Firm Moves $65.59 Million in Ethereum (ETH) - U.Today",
        "content": "Paradigm Capital has moved a substantial amount of Ethereum (ETH) to the institutional-grade custody platform Anchorage Digital, per data from Arkham . At precisely 8:53 a.m. UTC+8 today, Paradigm Capital, identified by the address 0x11...c3cD, deposited 19,504 ETH, valued at approximately $65.59 million, into Anchorage Digital.\n\nAdvertisement\n\nThis transaction marks a notable occurrence in Paradigm's recent activity. Over the past three months, the firm has established a pattern of depositing Ethereum into Anchorage during the latter half of each month. However, today's deposit is exceptional for two reasons: it is the second deposit this month and the largest single deposit Paradigm has made in the past three months.\n\nThe movement of such a large volume of ETH by Paradigm Capital shows the firm's strategic approach to asset management and security. Anchorage Digital, known for its robust security measures and institutional-grade custody services, has become a preferred platform for major financial players seeking to safeguard their digital assets.\n\nThis significant deposit may also highlight Paradigm's growing confidence in the stability and potential of Ethereum as a valuable asset. It also reveals that the broader trend of institutional investors is gravitating toward reliable custody solutions to manage and protect their holdings.\n\nAdvertisement\n\nEthereum sees rising institutional confidence\n\nThe recent deposit by Paradigm Capital aligns with a growing trend of institutional interest in Ethereum. As the second-largest cryptocurrency by market capitalization, ETH has attracted considerable attention from traders due to its diverse use cases, including DeFi, smart contracts and more.\n\nInstitutions like Paradigm Capital play a key role in legitimizing and stabilizing the market. Their involvement not only brings substantial capital into the ecosystem but also enhances market confidence. By opting for trusted custody solutions like Anchorage Digital, these institutions set a standard for security and trustworthiness in the handling of digital assets."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxOMWxGb1JlcjJDeEFjd19fVms5cWk5YmVpbEdmWkxLbjZ4SHhVcnVkRHJoTGt4MWh4TEdSNEJZNllySzQ0VnNHU09fMk5NNmJLSHJlcTU1YWw2eFVZT1BNcFRQWXNtT1VmTWNZejRZWXVheG1CWl92SXNEZHBkZUluWGRIalhUaVZZelBKWk4yYzNWWVRaaFotbjVfT2R3Mnh4V21CR2JqYl9lMXRLaFRrcFhlbXB2TXhyaWt0YnpWbTFaSkRCbk1iMHNmclNsazBDMERsYkl4WmJtN2w5SE1yc2RvMFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Spot ETFs On The Horizon: Regulatory Approval Expected By Fourth Of July: Report - Benzinga",
        "content": "The Securities and Exchange Commission is reportedly on the verge of greenlighting exchange-traded funds linked to the spot price of Ethereum ETH/USD.\n\nWhat Happened: Discussions between asset managers and regulators are nearing their end and the hotly anticipated investment avenues could go up for listing as soon as July 4, a Reuters report indicated Wednesday.\n\nExecutives from two of the firms anonymously revealed that the process of amending the offering documents is down to resolving minor issues. A lawyer associated with one of the issuers stated that approval is likely just a week or two away.\n\nEight asset managers, including BlackRock, VanEck, and Grayscale Investments which had previously launched spot Bitcoin BTC/USD ETFs such as iShares Bitcoin Trust IBIT, VanEck Bitcoin Trust HODL, and Grayscale Bitcoin Trust GBTC, are seeking SEC approval for the funds.\n\nSee Also: Here’s How Much Profit Donald Trump Would Make If He Sold His TRUMP Memecoin Today\n\nWhy It Matters: The launch of funds tracking the spot price of Bitcoin BTC/USD in January was a massive success, attracting about $8 billion in assets. As of late June, these nine new products have nearly $38 billion in assets. However, some ETF and cryptocurrency analysts believe the launch of the new spot ether ETFs will be less impressive due to ether’s smaller market cap and trading volumes.\n\nThe latest speculation comes a week after Bloomberg ETF analyst Eric Balchunas moved up the launch date for the ETFs to July 2. Balchunas had said that there was a “decent chance” the SEC would declare them effective and get it off their plate before the holiday weekend.\n\nIn a recent interview, SEC Chair Gary Gensler highlighted the smooth progress of ETF filings He indicated that the final decision lies with asset managers to make full disclosures for the registration statements to go into effect.\n\nWhile the enthusiasm was palpable, a few analysts predicted that the launch could potentially lead to a 30% drop in Ether's price.\n\nPrice Action: At the time of writing, Ether was exchanging hands at $3,377.13, following a 1.06% drop in the last 24 hours, according to data from Benzinga Pro.\n\nPhoto Courtesy: Shutterstock.com\n\nRead Next: Congressman Matt Gaetz Introduces Bill To Allow Federal Tax Payments In Bitcoin\n\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxOQThncmdpT05sMzV1NC1JLWJLRTR1amc2OGRnandwdl9idXhkRlpqa0JFWHRfM1ZCcmM2OGJVQU5WQ3hDWThVZ0MzN3pqU2JkbmVpdnA4TEdtV2pMU3EwVmoySkNWZDlnUHB5UzY4THhCcHFuVkNzdVY3LUNzWVFIYkFoTnlUbWJjQVUxTUtkd3lpUzNEdDY4bmtMcktmSzVZOE04V3J6Q1N6UWhpQ0pFNHpETmJZYnFLRmJqU3VxWHJyZ2dkaGFvN1RrQVlEcjE3MEEwS3VQZWlIV3MzS1RlZXJn0gHnAUFVX3lxTFB4OU82NFo4LWZKQnNMVmxqaFBwSGlKWlFrV2dzSEljYkZrNlVDWVA4QWVSN3AwVGxWUFBlRDJTcndJUmN4WHNzcXY4Vk4yTGwxeVVINlNBZldrb2g2VEJaRjV6RGJ4aVRQTGZQamV2OTIwcldNWGZ0bzNRZU1GaGk4a0tfbVM1akhLSzZJaUJVdEUweXZsYmxHMlJIN2VXMHpzdV94WFg0ZTh3R0F6c2pVMGgyWDFvQTJBWGtBbTE3MFJ2ZTZ0b080djBsbnotTmlPTUhRLUlCMDlHZzBvQXdnaGpzdGdXTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum primed for 40% gain following ETF launch - FXStreet",
        "content": "Ethereum ETFs could launch on July 4, reports Reuters.\n\nEthereum could see a 40% rally two months after spot ETH ETF goes live, says StoneX.\n\nEthereum may need to shed 4% of its value before staging a comeback.\n\nEthereum (ETH) is down 1% on Wednesday following reports that the Securities & Exchange Commission (SEC) could approve spot ETH ETFs on July 4. Meanwhile, brokerage and financial services firm, StoneX, predicted ETH to see a 40% gain in two months after ETH ETFs go live.\n\nDaily Digest Market Movers: July 4 launch, 40% ETH price growth\n\nAccording to a recent Reuters report on Wednesday, the SEC could approve spot ETH ETFs by July 4, citing sources from industry insiders.\n\nThe report stated that the SEC could give the greenlight on July 4 \"as talks between asset managers and regulators enter the final stages, industry executives and other participants told Reuters.\" The July 4 prediction aligns with earlier speculations from Bloomberg analyst Eric Balchunas, who speculated that ETH ETFs might launch around July 2.\n\nProspective spot ETH ETF issuers filed their amended S-1 registration statements with the SEC last week following comments from the agency. The SEC approved issuers' 19b-4 applications on May 23 but also needs to greenlight their S-1s before ETH can begin trading.\n\nA recent analysis by StoneX predicts that the launch of spot Ethereum ETFs could trigger a 40% growth in ETH's price two months after they go live. In a wider time frame, StoneX's model predicts that ETH's price will be between $2,142 and $12,621 over the next two years.\n\nThe company mentioned that its \"conservative\" predictions are due to the belief that NFTs won't see more mainstream attention as they did in 2021. The analysis also suggested that video games and real-world assets (RWA) — which many believe will boost TVL and user adoption — may not see tangible growth.\n\nThe StoneX analysis follows Bloomberg analyst Eric Balchunas's suggestion that ETH ETFs will capture lower net flows than Bitwise CIO Matt Hougan predicted because \"ETH futures ETF were a borderline flop.\"\n\nHougan predicted that spot Ethereum ETFs will attract up to $15 billion in net flows by the end of 2025. He arrived at the $15 billion figure by analyzing Ethereum's relative market cap compared to Bitcoin, international crypto ETFs volume, Grayscale Ethereum Trust conversion, and the Bitcoin \"carry trade.\"\n\nYeah, I thought about that. It's a fair question.\n\n\n\nThe largest ETH futures ETF (EETH) is only ~5% the size of the largest BTC futures ETF (BITO). I didn't adjust things downwards for two primary reasons:\n\n\n\n1) My gut just says futures products are different;\n\n\n\n2) At Bitwise, our… — Matt Hougan (@Matt_Hougan) June 26, 2024\n\nMeanwhile, SEC Chair Gary Gensler commented in a Bloomberg event on Tuesday that the process of launching spot Ethereum ETFs is \"going smoothly.\" He stated that the products going live depend on asset managers making full disclosures in their registration statements.\n\nETH technical analysis: Could Ethereum shed 4% of its value\n\nEthereum is trading around $3,350 on Wednesday, down nearly 1.2% in the past 24 hours. ETH's total liquidations in the past 24 hours have reached $21.82 million, with long positions accounting for 61% of liquidations and shorts 39%.\n\nETH open interest (OI) has been declining — although at a slow pace — sitting at $15.09 billion today. This indicates that traders are more cautious, especially as wider bearish sentiment seems to be overshadowing bullish sentiment around the potential launch of spot ETH ETFs.\n\nEthereum's 30-day Market Value to Realized Value (MVRV) ratio is at -7%, indicating all addresses that purchased ETH within the last 30 days are at an average loss of 7%. Historically, ETH often rebounds when the 30-day MVRV reaches -15% to -17%.\n\nETH/USDT 4-hour chart\n\nAs a result, ETH may need to shed 4% of its value to collect liquidity around the fair value gap of May 20, extending from $3,110 to $3,457 before a fresh rise. The $3,203 key support level could prove crucial in the potential decline to help ETH bounce back up."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE0wU01ZQjl3TDJuVWJTVHlmTHc0ZmV6MDFyNDdwaU1qOGVjSE50VGttRlQ0TjN0OUs3NktFS1ZFd3hGVHNtS2xjeV9sMWlyTUpFamlGQ3FHV01VRlpfTEpqbW9DeDNub0RuX256dNIBckFVX3lxTE1YQmV0ZjlOaGFJOXRnYmRmdXBVTFNEa2N6WWJjTmRRRW9zbjVyd0k2SWdVSXVQOFV2S2w3V3dfa1FvbDdiWlVOUlRIaFRlU0dOTll6RUwzSjZoaVRhaFdDcEpvZUlhM3Z6VGg0NEJaU2Fjdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum for Taxes? Dogecoin Creator Says Yes - U.Today",
        "content": "Florida Republican Matt Gaetz introduced a bill on Tuesday to allow federal income taxes to be paid using Bitcoin (BTC). The proposed legislation requires the U.S. Secretary of the Treasury to establish a program facilitating tax payments in BTC. As of now, only Colorado permits the use of cryptocurrency for paying taxes.\n\nAdvertisement\n\nThe announcement did not pass by the crypto community unnoticed. Billy Markus, co-creator of Dogecoin and known as Shibetoshi Nakamoto, expressed his support for the idea, stating a preference for paying taxes with Ethereum (ETH) instead of converting it to cash. This viewpoint highlights a roiling demand to integrate digital currencies into standard financial transactions.\n\ni wouldn’t mind sending the government 34% of the Ethereum instead of 34% of the estimated cash value at the secondWIn of purchase Advertisement June 25, 2024\n\nGaetz's proposal arrives as cryptocurrencies gain wider acceptance. If enacted, this bill would represent a significant shift in tax payment methods, aligning with the interests of crypto enthusiasts who prefer to use digital assets directly.\n\nWin-win?\n\nPaying taxes with Bitcoin or Ethereum could help taxpayers avoid the complications and potential losses associated with converting crypto to fiat currency at volatile market rates. From another point of view, this option may offer a more straightforward method for handling tax obligations to the government with digital assets.\n\nThe progression of this bill will be closely watched by crypto enthusiasts on one side and policymakers on the other, marking a potential step toward broader acceptance and use of digital currencies in one of the biggest financial systems."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQOUp3aHFpZE5kb0cxc2NJUzQ4RkVwc0dQT2Vkb3U1R2s1REx5RHlHc3NvOGFsUHIwV0Rzc3JpTllHM0xEcHZidTdOTFh4cHdSS2lsTmlsOVFiSVFMcndoSVJmNVdadi05a1oxRk9qYl9UQmtWUDJ0dGZEMGJtM3pFRkJ1S1PSAYwBQVVfeXFMUDQwT0doY3V3R0lpNTJxOWJNWVF0aHo4S0cwYXRyRnJyZF9XQk56U2RTcWF5TTVDLWZWaFNkdWFJNmZTTnNZSmRWcWdudnE0eFBnajM1SG5GQ2I4aE0tZTlzdkVOX0RrOXBmMk9ESXRPcFF0ME1NejhZRkdQU3lNOXVtLTh4amxBcjVZQkM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Issuers Are Already Racing to Drop Fees - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe fee for VanEck’s proposed spot Ethereum ETF will be waived after launch until 2025 or when the fund’s assets under management (AUM) reach $1.5 billion mark—whichever comes first—according to an amended SEC Form S-1 filing.\n\nWhen either of the aforementioned stipulations is fulfilled, the global asset manager will levy a 0.2% fee. Across its currently trading funds, which includes the VanEck Bitcoin Trust, the firm currently has $102 billion assets under its management.\n\nVanEck is not the only asset manager trying to lure investors into the queue for its Ethereum ETF. Franklin Templeton announced that it would forgo its sponsor fee for six months or until its spot ETH fund reaches $10 billion, at which point it’ll start charging a 0.19% fee.\n\nAD\n\nAD\n\nNotably, earlier this month, VanEck made a forecast that the price of ETH would reach $22,000 by 2030 and dubbed Ethereum “digital oil.” But there's still no word on when exactly trading will begin. Yesterday, during a Bloomberg Invest Summit, Securities and Exchange Commission (SEC) Chairman Gary Gensler commented that the approval process for U.S. spot Ethereum ETFs is going smoothly.\n\nThe SEC chair had previously stated that U.S. spot Ethereum ETFs will start trading sometime during the summer.\n\nInterestingly, VanEck filed an 8-A form with the U.S. regulator yesterday. This led many to speculate that U.S. spot Ethereum ETFs are one week away, as previously Bitcoin spot ETFs started trading exactly one week after fund houses had submitted their 8-A form with the SEC.\n\nRoad to $15 billion\n\nA report from Bitwise’s chief investment officer, Matt Hougan suggests that U.S. spot Ethereum ETFs could witness nearly $15 billion in net inflows in the first 18 months after trading begins.\n\nHougan goes on to state that his estimates could vary, as he has not factored in the negative impact of not having Ethereum staking in the spot ETFs. However, Hougan notes that it should not have any significant impact on the ETFs.\n\nAD\n\nAD\n\nOn that point, Bitwise’s competitor Grayscale disagrees. The firm updated the disclosure statement for its Grayscale Ethereum Trust last week to very explicitly spell out for investors that they are at a “competitive disadvantage” buying shares instead of buying and staking Ethereum.\n\nMeanwhile, the Bitwise also report suggests that there are multiple tailwinds for Ethereum due to increasing stablecoin supply, increased regulatory clarity, and the positive impact of Ethereum’s Dencun upgrade.\n\n“Still, I think $15 billion in the next 18 months is a good starting point. My gut tells me we’ll do better than that; ETH is a compelling asset powering the world’s most versatile blockchain. But even $15 billion in net new demand will have a dramatic impact on the Ethereum market.” Hougan concluded in his report.\n\nInterestingly, a report based on K33 Research indicated that Ethereum ETFs will likely see net inflows of $4 billion within five months of their launch.\n\nLast week, Bitwise reported that Pentra Capital Management LP intends to invest $100 million when Bitwise’s spot Ethereum ETF starts trading.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQaEFyZEsxSENUckdscGNGZ2w5ZlhRc19iUWlBQTVsSW1NaG11VGpQNGZVRTFET0Uta3FVNWk0UGgtWGNBUmM5ekR4a2JMR1RJeEVSSFZ0a2NJcW45Tl9ReWtQdlVXLUdWVnl5LV9SVkxxdE43Zy1fdGxMZUtjV1l2RkkwRG5NeDJHX2RiZXd6VUV4UmplaDlrV2RBZXZGbmp3X2V4a3RRTko1dkk2TlB6bGN1LW5fZ0F6UENGbVdRYnJmbVXSAcgBQVVfeXFMUHVhRGpTUW1OU0Q1cjdHaXBzRHpRN2pqaU5GNWZJX3hlLWV3V05LeWlSbHhsZHJKM0IzaElUbGR5dlltVmNMdUpuNTBmV1VmeGt5UGVtQmdfS1p2YjNPdVlqNkdhaVl6LVF2cThJdWNNLUZCTmI3WWRRWmVUYUJKVGl3VmItM0ExU1I4dXYxNWRycDRvUjl1djUwdTN2VjBpclBzZm8zLTAzTnpUS1pRbjduSF9mYWxQaEFYb3hLUjNLVmI3RjYxV1g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Gary Gensler Provides Ethereum ETF Update While Slamming ‘Highly Centralized’ Crypto Industry - The Daily Hodl",
        "content": "U.S. Securities and Exchange Commission (SEC) Chair Gary Gensler says that the approval process for spot market Ethereum (ETH) exchange-traded funds (ETFs) is “going smoothly.”\n\nIn a new interview at the Bloomberg Invest Summit in New York, Gensler indicates that the SEC will give final approval to the ETH ETF applications, but stops short of giving a timeline.\n\nHe says that the agency’s staff is working through the particulars of required registration and disclosure statements for the ETH ETFs.\n\n“I don’t know the timing, but it’s going smoothly. You can almost follow it publicly. You see these filings…\n\nAnd it’s really about the asset managers making the full disclosure so that those registration statements can go effective and those lawyers know what that is. It’s something our Division of Corporation Finance handles hundreds, if not thousands of times over anybody’s career. It’s smoothly functioning. It’s really up to the asset managers to make the proper disclosures.”\n\nBloomberg exchange-traded fund (ETF) expert Eric Balchunas recently said ETH ETFS may be approved by July 2nd.\n\nIn the same interview, Gensler also lobbed criticism at the crypto sector, calling it “highly centralized.”\n\n“So much of this field is highly centralized. It’s not decentralized. That’s not what’s happening here. It’s highly centralized around a few platforms that are also centralizing and commingling things that we would never allow anywhere else. And we don’t. The law doesn’t allow you to be trading against your customers and operating a so-called exchange and trading in front and possibly also taking investments in a investment contract or security and then listing and getting the listing pop.\n\nThese are all happening potentially at these, and we see some of the leading [ones who] two years ago would have filled a room much bigger than this if they were sitting on this stage are now sitting in jail or awaiting jail.”\n\n?\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNNnU4U01ZeHU4MF9jUGdiR1dCRXNza21Ud0YwRks5NFpFdkNpNi12eEZNU1o3QkYtTDFmQjNEeFhPNkhQUmlfTS1UZ3I0Q1JNSU5HXzJKSlNfVXUwcTZ5clZfRVFuRnY2bHp6LXBjZnk4QkNwaElHc0JSb2hpOHpHTXZaREFfdElzVm5lRHdqbGtpRTNXVGpYVDNBNGJBdXFqdWdxVy1EYzRhbzJScERj0gG0AUFVX3lxTE5lOWJNNUd1cmxFNXJURE9XRGhlSlVUMWlob3U3WVNUdGV5V0lHc0JYRVI4S0c2T0Q4cWlnU1JURGxhd3RZOXFta3luQlc3WjZwZ2o5MXpWclpyaWkzUUFWdWNpaEl3dkZZOGh2Z0ZENWNleEdJUEk2czlMYVdxV2I4ck40SXg2cTNCM29MdFNodUpmOWlTaXpFS3NGalM4UVcydVRpQzFpdndDak40RnlEbmU1Wg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "MegaLabs, Behind the 'Real-Time' Blockchain, Raises $20M, Led By Dragonfly - CoinDesk",
        "content": "According to a press release, MegaETH achieves its scaling in two ways: through its “heterogeneous blockchain architecture, which boosts performance by allowing network nodes with different hardware configurations to specialize on specific tasks,” as well as a “hyper-optimized EVM execution environment that pushes throughput, latency and resource efficiency to hardware limits.” An EVM execution environment is a blockchain operating system compatible with Ethereum's programming standard."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNdHJhVXN2TTNHQVNLMXVXN016NGV3YXBjUll4amJTd19hM3VsZ0ljYml2X0tKek50LW1vd1AyaVV5RlBNWFJneDhDNnpYUHdCQ3hUYW5YM0RUaDlqcW9SZnQyVHNFS28zQkhqUWZ5Ykg2ZnhraW1yU21xbTBHbE1HcUJwa3N1akVqaXFuWU5tTXN1Rlg4aHg4WHBCeTFhSG5kWkV6TVJwaFlfMlU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "VanEck launches ETF on Ethereum (ETH) with zero commissions until 2025 - The Cryptonomist",
        "content": "VanEck has recently announced the launch of a new ETF on Ethereum (ETH) with zero fees until 2025. With this move, VanEck demonstrates its intention to keep up with the times and offer its clients an investment opportunity without additional costs.\n\nLet’s see below all the details about it and other news.\n\nVanEck files Form 8A for the new spot ETF on Ethereum (ETH): no fees\n\nAs anticipated, recently VanEck submitted the 8A form for its spot ETF on Ethereum. Market analysts still hypothesize July 2 as a possible launch date for these new funds.\n\nVanEck just filed 8-A form for spot Eth, which is just part of process, but.. should be noted that they filed their 8-A for spot bitcoin exactly 7 days before launch. Good sign for our July 2nd over/under (7 days from now). But again, anything poss. Sure we'll hear more soon.. https://t.co/2BlkDnWhrz — Eric Balchunas (@EricBalchunas) June 25, 2024\n\nFurthermore, VanEck has decided to adopt an innovative approach by completely waiving the fees for its ETF.\n\nMatthew Sigel, head of digital assets at VanEck, communicated via email that the company will not apply any fees for its ETF on Ethereum.\n\nAlthough the duration of this promotional offer has not been specified, it is likely that it will last until 2025.\n\nHowever, if the fund’s assets were to reach 1.5 billion dollars before that date, the zero-cost structure will be revoked and a 0.20% fee will be applied.\n\nEric Balchunas, an ETF analyst at Bloomberg, noted that it is rare for issuers to reveal their fee structure so early, even before the official launch. VanEck is not the only company taking this direction.\n\nFranklin Templeton, for example, has already declared that it will charge a fee of 0.19% for its spot ETF on Ethereum. Commenting on the situation, Balchunas stated the following:\n\n“What BlackRock intends to charge is probably the most uncertain variable outside of the exact launch date. Their fee will be the benchmark for all the others. It must be competitive.”\n\nVanEck is aware of the initial losses resulting from the adoption of a zero-commission policy. In an email sent to ETF.com, Sigel stated:\n\n“VanEck aims to be a leader in cryptocurrency ETF fees, even at the cost of losing money initially. The goal is to recover through volume; in this case, the volume of decentralized finance.”\n\nSpot ETF on Ethereum: expected demand lower compared to Bitcoin, according to Bernstein\n\nThe Spot ETF on Ethereum, recently approved, is expected to attract significantly less interest from investors compared to the ETF on Bitcoin, according to a report published on Monday by Bernstein.\n\nThe management company has predicted that this second ETF based on cryptocurrencies will attract demand on a very small scale.\n\nAlthough the ETF on Ethereum has not yet been launched, the market is eagerly awaiting its arrival. However, experts point out that the lack of staking functionality in the ETF on Ethereum could reduce spot conversions.\n\nFurthermore, the current market conditions could further dampen interest in this product once it becomes available. Despite the approval of the product, a timeline for the start of trading has not yet been established.\n\nThe Securities and Exchange Commission (SEC) of the United States approved a crucial regulatory filing last month, fueling speculation that the ETF could be launched in July.\n\nBernstein has stated the following:\n\n“Ethereum as the main platform for tokenization is building a solid use case, both for stablecoin payments and for the tokenization of traditional assets and funds.”\n\nFurthermore, they stated that an “improved regulatory regime” would be beneficial for Ethereum. However, it is unlikely that such a change will occur before the next presidential elections in the United States in November.\n\nThe supply of Ether increases: inflation after the Dencun update\n\nThe supply of Ether (ETH) has reached its longest inflationary period since the Merge that occurred in 2022. It seems that the Dencun update of the blockchain, implemented in March, is the main cause of this increase.\n\nAccording to the data from the Ethereum ultrasound.money dashboard, the supply of Ether has gradually increased, with over 112,000 ETH added to the total supply since April 14.\n\nMuch of this inflationary growth is attributable to the Dencun update, introduced on March 13.\n\nThis update has implemented nine Ethereum Improvement Proposals (EIP), including the EIP-4844, which seems to be the main cause of the increase in supply.\n\nThe EIP-4844 has introduced “blob”, a mechanism that allows for temporarily and separately storing transaction data, thus reducing the fees paid for block data on Ethereum’s layer-2 networks.\n\nThe Dencun update also introduced proto-danksharding, which improved efficiency in data availability for block space on the Ethereum mainnet.\n\nThis development has led to a significant reduction in transaction execution costs on Ethereum layer-2 networks, such as Arbitrum and Optimism. However, it has also resulted in a notable decrease in the total amount of ETH burned on the mainnet.\n\nDespite the supply of ETH increasing in an inflationary manner in recent months, the overall supply of ETH has still decreased significantly after the Merge.\n\nSince September 2022, more than 1.5 billion ETH have been burned, while 1.36 billion ETH have been added to the supply, leading to a net reduction in the supply of 345,000 ETH.\n\nThis decrease corresponds to just over 1.1 billion dollars at current market prices, since Ethereum switched to a proof-of-stake consensus mechanism."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE5KdDN6cGZQYVhlSzhsbTVVeGtPRkZzNkVWdExMR0hSMDFUVEdMc3hVX2hNRENtei1yMWdsR2hXMzFpX05FdTdSMEU0ZFluOVZZQlVZczdpZVJ5OFh3MDhrWk9HSXctZEwzdU9URzcxUFg4dnZO?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Why Ethereum is Not a Commodity – Opinion - Securities.io",
        "content": "Ethereum, the second-largest cryptocurrency by market capitalization, has been at the heart of regulatory debates for several years. The key question remains: Is Ethereum a commodity, a security, or something else entirely? In this opinion piece, I will argue why Ethereum does not meet the criteria to be considered a commodity. Instead, I believe Ethereum is best understood as a utility token.\n\nTo classify Ethereum as a commodity, it would need to meet specific criteria, which it does not. Firstly, Ethereum was launched with pre-mined tokens. During its initial coin offering (ICO) in 2014, 60 million Ether (ETH) were sold to the public, while 12 million were allocated to the development fund. This pre-mining activity is more characteristic of securities, as it involves an initial distribution controlled by the developers.\n\nAdditionally, Ethereum’s development roadmap is highly structured and transparent. The Ethereum Foundation and core development teams, such as those within ConsenSys, outline detailed plans for future upgrades, including the significant transition from Proof-of-Work (PoW) to Proof-of-Stake (PoS) with Ethereum 2.0. Commodities typically do not have such centralized and planned development trajectories.\n\nCore developers in the Ethereum ecosystem play a crucial role in leading protocol changes. Vitalik Buterin, Ethereum's co-founder, and other prominent developers consistently propose and implement updates. This centralization of decision-making contrasts with the decentralized nature of commodities, which do not rely on a core team for their evolution.\n\nFurthermore, the Ethereum ecosystem has substantial backing from venture capitalists (VCs) and institutional investors. These stakeholders often influence the direction and development of the network, similar to how shareholders might influence a corporation. Such dynamics are more aligned with securities, where investor interests are paramount, rather than commodities, which are typically free of such concentrated influence.\n\nEthereum’s tokens were also sold both publicly and privately, with the ICO being a primary example. This method of distribution is characteristic of securities offerings, where tokens are sold to raise capital for development and operations. Commodities do not usually undergo such sale processes before their availability on the market.\n\nThe transition to Proof-of-Stake (PoS) with Ethereum 2.0 raises questions about whether this mechanism affects its classification. PoS operates on a system where validators are chosen to create new blocks based on the number of tokens they hold and are willing to “stake” as collateral. While PoS changes the consensus mechanism, it does not fundamentally alter the nature of Ethereum's distribution or governance.\n\nTo determine whether Ethereum is a security, we can apply the Howey Test, a legal standard that assesses whether a transaction qualifies as an “investment contract.” The Howey Test consists of four criteria:\n\nAn investment of money, In a common enterprise, With an expectation of profits, Derived from the efforts of others.\n\nEther was purchased with the expectation that it would increase in value. The funds raised from the ICO were pooled to develop the Ethereum network, indicating a common enterprise. Many investors bought Ether with the expectation of profiting from its appreciation. The success and value of Ethereum are heavily dependent on the efforts of the core developers and the broader Ethereum community. Based on these criteria, one could argue that Ethereum resembles a security more than a commodity. However, the decentralized nature and utility of the Ethereum network differentiate it from traditional securities.\n\nThe classification of Ethereum as a security or commodity has significant implications, particularly in the United States, where the Securities and Exchange Commission (SEC) has been scrutinizing cryptocurrencies. In 2018, former SEC Director of Corporate Finance William Hinman suggested that Ethereum might not be a security due to its decentralized structure. However, more recent statements from SEC officials imply that this view could change as the regulatory landscape evolves. Outside the United States, regulatory approaches vary. For instance, in Switzerland, the Swiss Financial Market Supervisory Authority (FINMA) categorizes tokens based on their function and transferability, often distinguishing between payment tokens, utility tokens, and asset tokens. Ethereum's broad utility within decentralized applications (dApps) and smart contracts aligns it more closely with a utility token under FINMA's framework.\n\nA utility token is designed to provide access to a product or service within a blockchain ecosystem. Ethereum's primary function is to facilitate operations within its decentralized platform. It powers dApps, executes smart contracts, and serves as “gas” to pay for transactions on the network. These functionalities underscore its utility rather than its investment potential. Utility tokens are not typically classified as securities because they are not primarily bought for investment purposes but rather for their inherent utility within a blockchain ecosystem. This distinction is crucial in understanding Ethereum's role and value.\n\nThe classification of Ethereum as a security, commodity, or utility token has profound implications for its regulatory treatment and adoption. In the United States, securities are subject to stringent regulations, including registration requirements and investor protections. If Ethereum were classified as a security, it could face significant legal and operational hurdles, potentially stifling innovation and growth. Conversely, if Ethereum is recognized as a utility token, it may benefit from a more favorable regulatory environment, fostering broader adoption and development. This distinction also matters globally, as different jurisdictions have varying regulatory frameworks for cryptocurrencies.\n\nIn conclusion, Ethereum does not meet the criteria to be classified as a commodity. Its pre-mined tokens, structured development roadmap, centralized leadership, venture capital backing, and method of token distribution align it more closely with characteristics of securities. However, its extensive utility within the blockchain ecosystem and the decentralized nature of its operations suggest it should be classified as a utility token. The debate over Ethereum's classification is not merely academic; it has real-world implications for developers, investors, and regulators. As the regulatory landscape continues to evolve, it is crucial to recognize Ethereum's unique position in the cryptocurrency space and advocate for a regulatory framework that acknowledges its utility and fosters innovation. Ultimately, the classification of Ethereum as a utility token offers the best understanding of its role and value, balancing regulatory oversight with the need to support the growth and development of decentralized technologies. I am still looking forward to Ethereum Spot ETFs in the US soon."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQeDBvUFFPdkRaR0lhc3JtLXVNRURGeTZLNl9YWUFnV2ZFRl9NYmtSeVdjWEUtcDEtS2pfbl9FSEQ1eW10Tlo5WnhtNTdkcDhLQk04eV9XOFRUbFMwSVF6RUowNUFBNVMwLWxTYi1UZ2h2ZVFDMXl5Q1VWV2N3MFBvSGRfZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "How Ethereum Could Rally to $5000+ - Investing.com",
        "content": "Over the last several months, using our Elliot Wave Principle (EWP) count that Ethereum ( ) was most likely gearing up for a rally to $4800-5400. We tracked it as a standard impulse pattern “contingent on holding above key price levels because there are no certainties. Only probabilities.”\n\nOn Monday, May 20th, the second-largest cryptocurrency by market cap rallied strongly but has since given up most of those gains. See Figure 1 below. Hence, Ethereum failed to hold above several key price levels we had laid out, so we must adapt our preferred POV. Allow us to explain below.\n\nThe rally from the green W-4 low made on May 1 now counts best as three (orange a, b, and c) waves up. In ending diagonals (see here). The ending diagonal is a special type of wave that can occur in Wave 5 of an impulse. The wave structure of an ending diagonal is different from that of the impulse wave. Where the impulse wave had a general structure count of 5-3-5-3-5, the ending diagonal most often has a structure count of 3-3-3-3-3. All five waves of an ending diagonal break down to only three waves each, indicating exhaustion of the larger degree trend. Also, Wave 1 and Wave 4 may overlap each other.\n\nThus, the current rally and decline could be (grey) W-i and W-ii of the (green W-5), contingent on holding above the orange and red horizontal warning levels. Namely, second waves, also in an ED, tend to bottom out around a 50.0-76.4% retracement of the preceding same-degree 1st wave. On Monday, ETHUSD reached the 61.80% retracement and—so far—bounced off it. Thus, although Ethereum can move even a bit lower to ~$3045, it should not move much below it to keep the ED pattern alive. A break above the (blue) 50-day Simple Moving Average and its Ichimoku Cloud can trigger the grey W-iii, iv, v per the Fibonacci-target zones, as shown.\n\nMeanwhile, positive divergences (blue dotted arrows) are forming, suggesting exhaustion of the current downtrend, but it is a condition, not a trigger. Suppose the Ethereum Bulls fail to show up over the next few days. In that case, they risk a breakdown to as low as $2900+/-200 before starting their next attempt for that rally to $4800-5400. Namely, we remain long-term Bullish on this cryptocurrency, which started its Bull run towards ideally $10+/-2.5K in 2022, contingent on holding above $2150."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPMjNqLUx3VTNSMkVtYnA4dHBhRFBqN2Q4OW1kVUxDQ0tfTjNiQmJmbEIxVGd0NDhWdDN1ejk0ekROaU42aDZxZGRhSnhrdmZqUkdzeGNYb1pHSWVyMmJRR1VlUGlURXVULW9YR090WFFha3VSRHp0MGVKeUVCVWpVcnZER3dDYV9jMWRqRG9qRThuZ9IBlwFBVV95cUxNelJoQVFERnBLRVpwMThHS2dCS0c0SlpYbnRseDYwTUVyZnpkOEw3STFKWWp4a05DbG5pNEJCRjB5Vm5LcmQxMzY0b0d4eWN4VWlkWmRZUmJBOWlFNVBDY0xKN2NfaUFjcHJGQlhLMWNiV0NOZ2NnU0RqVVNjOUR2bHNoOEhrOXJuTEtJRWlFMGdycm50UGU4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s price rally: What makes THIS level a make-or-break point - AMBCrypto News",
        "content": "Ethereum chalked out a classic descending channel pattern on the daily chart, confirming a bearish edge.\n\nThe immediate support range at the $3,200 level can determine ETH’s near-term trajectory.\n\nEthereum’s [ETH] reversal from the $3,900 resistance level over the past month has set the stage for the bears.\n\nThe altcoin’s increasing Open Interest trend during this time has further raised questions about its ability to hold the immediate support level.\n\nShould the sellers continue to increase pressure from its press time level, ETH could invalidate a bullish rally and see a downward breakout. A rebound from the $3,260 level can help the buyers regain some momentum.\n\nAt the time of writing, ETH was trading at $3,362, up by nearly 3% in the past 24 hours.\n\nCan ETH bulls reverse the bearish trend?\n\nETH sellers have consistently held the resistance level near the $4,000 mark as the altcoins for over three months. The $3,900 ceiling blocked ETH’s 35% rally last month and pulled the price below the 20-day and 50-day EMAs.\n\nThe resulting price action chalked out a classic descending channel pattern on ETH’s daily chart.\n\nShould the upper trendline of this descending channel continue to resist bull runs, ETH could continue its downtrend in the short term. In this case, the $2,800 region could help provoke a bullish rebound.\n\nOn the other hand, a potential close above the current pattern can set the stage for bulls to trigger a rally. In such a case, The first significant resistance level for the buyers would be in the $3,900 region.\n\nThe Stochastic RSI showed extremely oversold readings at the time of writing. Buyers should wait for a potential bullish crossover to gauge ETH’s near-term bullish potential.\n\nPrice action rising above the 20/50 EMA and a bullish crossover on stochastic RSI together could create a strong buy signal for traders.\n\nEthereum: Bearish edge emerges\n\nAccording to data from Hyperblockcapital, ETH’s Open Interest indicator marked an uptrend (higher highs) over the past month.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nHowever, the price action saw lower highs during this time. This reading typically suggests a bearish divergence– where more traders are entering short positions rather than long positions.\n\nAlso, the total net exchange flows over the past day increased by nearly 140% to reaffirm the overall bearish sentiment. ETH’s rebound from the $3.2K–$3.3K support range would be crucial to break the bearish narrative."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOOE9fbnpVaHJNVklNV0lZU2xhSjNWRk41aG1jTkdDY1U5WllvcExmZXFOamdUVUxTTDNCN2pMbWdJVjFva3dfaVRwMWxBd1pPUTdjTzJvX1EyZkk3ZUZBSW1ibkxhS0JfTVl1T19kNktHTm5PSzNHbU1TcEtWUFdSOGZ0ZXE1Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Bybit Web3 Presents: Grow Your Ethereum Portfolio Masterclass Livestream and YieldNest Giveaway - Yahoo Finance",
        "content": "DUBAI, UAE, June 26, 2024 /CNW/ -- Bybit , the world's second-largest crypto exchanges by trading volume, is excited to announce its first-ever Ethereum (ETH) Masterclass , a free online event that shows ETH's capacity to drive the next bull run. This masterclass, designed for seasoned crypto investors and newcomers, will explore the opportunities in decentralized finance and Bybit Web3 to grow your ETH position.\n\nBybit Web3 Presents: Grow Your Ethereum Portfolio Masterclass Livestream and YieldNest Giveaway\n\nScheduled to stream on Jun. 28, 2024, at 6AM UTC, the ETH Masterclass will feature experts who will coach viewers on managing their portfolios and finding new ways to grow their ETH holdings. The event promises to be an invaluable resource for anyone looking to deepen their understanding of decentralized finance (DeFi), and the Ethereum ecosystem, and capitalize on its growing potential using Bybit Web3.\n\nFeatured Trainers:\n\nSam Kazemian, founder of Frax Finance\n\nDeo Brands, co-founder of YieldNest\n\nEmily Bao, Bybit Web3 evangelist\n\nCryptos Cobra, founder of Cryptos Cobra\n\nHosted by Nathan Thompson, lead tech writer at Bybit.\n\nParticipants can also pre-register, take the Ethereum poll, and unlock a share of 36,000,000 PEPE tokens during the event period from Jun. 21, 2024, 8AM UTC to Jul. 5, 2024, 11:59PM UTC.\n\nYieldNest, a participant in the livestream, will join the giveaway by offering three exclusive YieldNest NFTs, typically only given to users with 5+ restaked ETH at YieldNest. These NFTs provide a +15% boost on YieldNest Seeds.\n\nLivestream Details:\n\nMark Your Calendar: Jun. 28, 2024, 6AM UTC\n\nTune In: Watch Live\n\nJoin us for this transformative event and equip yourself with the knowledge to navigate and capitalize on the evolving Ethereum landscape.\n\n#Bybit / #TheCryptoArk / #BybitWeb3\n\nAbout Bybit\n\nBybit is the world's second-largest cryptocurrency exchange by trading volume, serving over 33 million users. Established in 2018, Bybit provides a professional platform where crypto investors and traders can find an ultra-fast matching engine, 24/7 customer service, and multilingual community support. Bybit is a proud partner of Formula One's reigning Constructors' and Drivers' champions: the Oracle Red Bull Racing team.\n\nFor more details about Bybit, please visit Bybit Press .\n\nFor media inquiries, please contact: media@bybit.com\n\nFor more information, please visit: https://www.bybit.com\n\nFor updates, please follow: Bybit's Communities and Social Media\n\nDiscord | Facebook | Instagram | LinkedIn | Reddit | Telegram | TikTok | X | Youtube\n\nBybit Web3 Logo (PRNewsfoto/Bybit)\n\nCision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/bybit-web3-presents-grow-your-ethereum-portfolio-masterclass-livestream-and-yieldnest-giveaway-302183029.html\n\nStory continues\n\nSOURCE Bybit\n\nCision\n\nView original content to download multimedia: http://www.newswire.ca/en/releases/archive/June2024/26/c4302.html"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQVXppMnA5VUNRZUxOYktHbnBGQUlkOU14OGkwemtkazJ1by0tZE8zaHhyX0d1SzJZU29IU2J2UlZVV0hadDF6bENDLXRHZDhZbElJSTlRTDEtaDN1MG9Vb0RNYnQzRWp3RDdzOHNYMkFUV0RlUjFEeE5RZmkzbnNBd3lxTWpCNW5fVXRSemgxLXJkOEpo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Exploring Blast (BLAST): A Yield-Bearing Ethereum Layer 2 Solution - Blockchain News",
        "content": "Exploring Blast (BLAST): A Yield-Bearing Ethereum Layer 2 Solution Darius Baruo Discover Blast (BLAST), an Ethereum Layer 2 protocol offering yield on ETH and stablecoins. Learn about its features, tokenomics, and how to buy BLAST.\n\nBlast, an Ethereum Layer 2 solution, is making waves in the crypto community with its unique integration of native yield for ETH and stablecoins. According to blog.bitfinex.com, this protocol distributes yield from decentralized sources like ETH staking and on-chain T-Bill protocols directly to users, offering a 4% yield on ETH and a 5% yield on stablecoins.\n\nKey Features of Blast\n\nBlast operates as an EVM-compatible, optimistic rollup, making it easier for users and developers to benefit from higher baseline yields without altering the familiar Ethereum experience. A standout feature is its auto-rebasing mechanism, which adjusts balances in user accounts to reflect accrued yield. This mechanism is applied natively for Externally Owned Accounts (EOAs) and can be optionally enabled for smart contracts, allowing seamless integration with existing Decentralised Applications (DApps).\n\nThe yield generation is facilitated by Ethereum’s Layer 1 staking rewards, particularly through protocols like Lido, which automatically transfer yield to Blast users via the rebasing mechanism. Additionally, users who bridge stablecoins to Blast receive USDB, a stablecoin whose yield is derived from MakerDAO’s on-chain T-Bill protocol. This ensures users benefit continuously from competitive yield rates, whether they hold ETH or stablecoins.\n\nGas Revenue Sharing Model\n\nAnother notable feature of Blast is its unique gas revenue sharing model. Unlike other Layer 2 solutions that retain gas fee revenue, Blast redistributes this revenue back to DApps programmatically. This allows DApp developers to either keep the revenue or use it to subsidize gas fees for their users, promoting a more cost-effective and attractive environment for DApp usage.\n\nWhat is the BLAST Token?\n\nThe BLAST token serves multiple pivotal roles within the Blast ecosystem. It is essential for governance, allowing token holders to participate in decision-making processes regarding protocol upgrades and yield strategies. This decentralized governance model ensures the community has a significant say in shaping the platform’s future.\n\nBLAST tokens are also crucial for staking within the ecosystem. Users can stake their tokens to secure the network and earn rewards in return. This staking mechanism incentivizes users to contribute to the network’s security and helps maintain the ecosystem's overall health and stability.\n\nAdditionally, BLAST tokens facilitate various transactional activities within the ecosystem, such as paying for transaction fees on the Blast Layer 2 network. This ensures operations are cost-effective and efficient, given the high gas fees often associated with transactions on the Ethereum mainnet. The transaction fees collected in BLAST tokens are redistributed within the ecosystem, supporting further development and incentivization.\n\nBLAST Tokenomics\n\nThe Blast airdrop initiative rewards early adopters and participants within the ecosystem. Users can earn Blast Points and Blast Gold through activities like maintaining balances in ETH, WETH, and USDB, or participating in DApps on the platform. Points are distributed automatically based on the balance held in users’ wallets or smart contracts, and users can earn multipliers by engaging with highlighted DApps.\n\nDespite the active engagement through the airdrop, detailed information about the tokenomics of BLAST is still pending. Users are encouraged to join the Blast community to stay informed about the latest developments, including updates on the airdrop and detailed tokenomics.\n\nHow to Buy BLAST\n\nTo buy BLAST with cryptocurrency, log in to your Bitfinex account, go to the Deposit page, choose the crypto you plan to buy BLAST with, generate a deposit address on the Exchange wallet, and send the crypto to the generated address. Once the funds arrive, you can trade them for BLAST.\n\nTo buy BLAST with fiat, log in to your Bitfinex account, get full verification, go to the Deposit page under the Bank Wire menu, choose the fiat currency for your deposit, check your email for wire details, send the funds, and once they arrive, you can use them to buy BLAST.\n\nBlast also offers mobile options for on-the-go purchases.\n\nBLAST Community Channels\n\nFor more information and updates, visit the Blast website, follow them on X (Twitter), or join their Discord community."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPS2E5ZjdJWXl3dDFTd2VfQVJlUWVORG5KaUhpcjU5enVtTUJ3bE5faGFRSWZENFZheGRrWjQxVXZUeFJicFpNRm5waVZTcWhRN0tDV0ZPbUV4dFlUVl9yQmdvQ21WeHk2VnVPVF9TOFBkT1VHV2lLT080YzBQaWNZU09Kam9UbFE1RU5PMWNIMNIBlAFBVV95cUxOSVFTb0VudGwzaUVNd3BwYkpYUXEzSWZVYURNbTNmN0ROTmItU0ozMmlSQ3pNY040V0llLVFDdXJrS2xVMlV3Yi1GWDdxNkxUU0tJZXVVWXNUQW1Qb3IxS3I2OUgyM09NQmdKWUNvSVBtZTZGUXdiWktsc19iYzZFWVFGN0wyYTRCVHlyVEkxNlo4TXF0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "5 Reasons Why Ethereum (ETH) Is Much Stronger Than Bitcoin (BTC) Right Now - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum's price performance certainly raises some serious questions, as the second-biggest cryptocurrency on the market is clearly losing momentum and is unlikely to gain enough traction for a bounce right now. But fundamentally, it has at least five reasons to recover sooner than expected.\n\nMt. Gox does not have any ETH\n\nThe imminent risk of a massive sell-off from Mt. Gox is one of the major factors weighing on Bitcoin. The trustee of the defunct exchange is scheduled to return a sizable portion of Bitcoin to creditors, which may intensify selling pressure. Due to this, Ethereum has a clear advantage over BTC, which might enter the market and lower its price.\n\nGerman government not selling Ethereum\n\nSelling pressure on the market has been exacerbated by reports that the German government has been selling off the Bitcoin that has been seized. The recent difficulties of Bitcoin are partly attributable to this action.\n\nOn Ethereum, there is no miner sell pressure\n\nSince the release of Ethereum 2.0, the proof-of-stake (PoS) consensus mechanism has replaced the proof-of-work (PoW) method. That implies that miners for Ethereum will no longer have to sell a lot of ETH in order to pay for their overhead. Nevertheless, in order to cover their costs for things like electricity, Bitcoin miners must constantly sell their Bitcoin.\n\nAdvertisement\n\nETH will also get an ETF\n\nEthereum, though not officially confirmed yet, is headed toward becoming its own exchange-traded fund, much like Bitcoin. Institutional investors could be exposed to Ethereum through an exchange-traded fund without having to physically hold the asset, which could raise demand.\n\nGreater supply shock on ETH\n\nThe introduction of a burning mechanism for transaction fees through EIP-1559 has resulted in a significant reduction in the supply of Ethereum. A supply shock could occur for the asset as a result of this mechanism, which lowers the total supply of ETH."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQSHltS01yc0pETTIzcFFJVG5NNzBHUTF6RGxiMlJUUkpvNEt2UlIwdjZYQmpURFkxc0c5bTViZXJ5dzhPX3JXQWFiWS02Z3J3S3NuZk02RE9Xa0Q5cUtuT1ZBaTNGaktIMVNMU0paWU1vTFFBRTQtNWx0alpWNHhBSllZaVZCWlBhRERteFJNeFNrS1B5bVFkLUZfemcwaHpScWlZQ3E4aXQweFlWQ1F6S1pWY0lJamNHM1FhUXFWdlM0bnFtaHV2c283cmNYR2hkQWg2WDNfVzJqQkVobncxN2xYN1lqcmoz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Top Trader Is Long Bitcoin, Ethereum, Short Litecoin, Cardano...And Thinks Shiba Inu's Time Has Passed - Benzinga",
        "content": "Crypto researcher Trade The Flow on Thursday offered trading ideas to navigate the current sideways price action in the crypto markets.\n\nWhat Happened: Trade The Flow suggested that long/short pair trading could be an effective strategy in these choppy conditions and offered several trade ideas.\n\nAmong his suggestions were long positions on Bitcoin BTC/USD and Ethereum ETH/USD, paired with short positions on Litecoin LTC/USD and Cardano ADA/USD, respectively. He reasoned that BTC and ETH are leading the market and have potential catalysts ahead like the Ethereum ETF, while LTC and ADA lack network effect and real activity.\n\nAmong his many strategies, he suggests longing Pendle PENDLE/USD, and shorting Ondo Finance ONDO/USD. Although both have similar narratives there are huge discrepancies in their protocol metrics.\n\nIn the meme coin universe, he includes longing Pepe PEPE/USD and shorting Shiba Inu SHIB/USD, as the former is the most established meme of crypto culture that continues to catch a lot of market attention. Shiba Inu's time has passed in his opinion.\n\nMeanwhile, on the PEPE/ETH pair, the trader stated, \"If you see PEPE as a high beta for ETH, then this pair trade can smoothen a bit your drawdown if the market is down, but you still have a lot of upside if it goes up.\"\n\nAlso Read: Here’s How Bitcoin And Altcoins Will Behave ‘Until Fed Cuts Rates,’ According To Veteran Crypto Analyst\n\nWhy It Matters: Trade The Flow’s insights provide a unique perspective on the current market conditions and potential trading strategies. His suggestions for long/short pair trading could help traders navigate the market’s volatility and potentially generate profits even in a bearish market.\n\nHowever, as with any trading strategy, traders need to do their research and consider their risk tolerance before making any trades. As Trade The Flow himself noted, \"There are infinite combinations of pair trade, and this is just a glimpse of some of them.\"\n\nThe trader added that these types of trades enable to be more market neutral and smoothen profit & loss to the downside and build a bigger position.\n\nWhat’s Next: The influence of Bitcoin as an institutional asset class is expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next: Raoul Pal Foresees Crypto Boom In Election Year’s Q4, Names It ‘Banana Zone’\n\nThis content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nImage: Shutterstock"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQSTJHZVFUWGZUM05ycDhtQ2lfY3FoVDRDelpKdEJHVjg0QWlyUE9NMlUyMXZpNnh4Tm5TMnBjc2p1LXV3eThwekxyX2xiLUxnU0hzQzF2d1FQbW9YLVZFc3pWdlhKdUJhcWhrZXhmSFRpZTdyN0wzM2ZBRlZRb3JleGhjVVZhWmpDaDBIMmh1R1BtNVBBQTh6VGtNblVzYjdSZk8ydlR0RUZhbzFLWTBxaA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "The SEC Ends Its Ethereum 2.0 Investigation, but Staking Isn't in the Clear - CoinDesk",
        "content": "Bitcoin Price Index XBX\n\nThe CoinDesk Bitcoin Price Index (XBX) is the world’s leading reference for the price of bitcoin, used by the largest institutions active in crypto assets. It is the crypto market standard, benchmarking billions of dollars in registered financial products and pricing hundreds of millions in daily over-the-counter transactions. Built for replicability and reliability, in continuous operation since 2014, the XBX is relied upon by asset allocators, asset managers, market participants and exchanges. The XBX is the flagship in a portfolio of single- and multi-asset indices offered by CoinDesk ."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9oV0F5WHAxNXhyX1l3aFBrT3RPOWxvd3hTN1lmSGFFLS1KVnFvX0gwWUt2LVFaV2owVVA5NFFTaDhfV0dNU1dYUk1iNXBrVVJDRmh4UHlLR1dNWmFudGFQRldYSWd3SXo5eURVMmVlM2xaQnF2V1g4RXl30gGCAUFVX3lxTE5TYThiLWo2dFBRczR0SDMzNEVwaHJ4cUFnaGcyODJ3WnZnUWRPT0JwcjNTSlp1dGRDSkdJMDdNZUhRWGtkUzJJZ3hBc0tMNWFjSWJkYTJhRlAwRHd0MGdaMmIxaFBlOG96V28yc3ROYjlOMEZRMEducG9QR2E0dVhFUFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "What to Expect From Xai as It Aims to Become Ethereum Gaming's Valve - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nKey contributors to Xai, the Ethereum-based layer-3 gaming network, say they aim to build the next Valve, developing their ecosystem in a similar way to the video game titan behind the Steam marketplace and some of the best-loved games of all time.\n\nTobias Batton, co-founder and CEO of Ex Populus—a game studio that works closely with the Xai Foundation as a “labs company” of sorts, he previously told Decrypt’s GG—explained that the Valve model is how they envision the future of the gaming network.\n\nIn the same way that Valve has its own internal studio creating games like Half-Life, Counter-Strike, and Portal, Xai has Ex Populus working on multiple upcoming releases. Equally, as Valve offers development tools, so does Xai through its partnership with Sequence.\n\n“That's kind of how we think about things in a very broad sense for the Xai ecosystem,” Batton told Decrypt via Zoom.\n\nAD\n\nAD\n\nWhile Valve games are widely adored, the firm has arguably become even better known for the market-leading Steam platform. Valve’s store has quite the head start, with over 100,000 games at present while Xai has just a couple currently live. But by the end of its new Vanguard: Genesis campaign, Batton says there will be a healthy library to choose from.\n\nThe campaign saw a near-instant spike in transactions, with Xai accounting for 41% of all transactions in the Ethereum scaling network ecosystem, according to L2beat data, amid its own all-time high for transactions.\n\nOver the past 30 days, Xai has recorded the most transactions of any Ethereum layer-2 with over 114 million transactions; Coinbase's Base network is next up with 83 million transactions over the same span.\n\nMost of that activity has not been tied to gaming, however, as users first interact with the budding network—launched back in January—by taking advantage of rewards initiatives amid the Vanguard: Genesis campaign.\n\nAD\n\nAD\n\n$XAI flipped Base in TPS Xai Season 2 off to a great start 🎮⛓️ pic.twitter.com/EaqoEmtRa8 — soby is on xai 🎮⛓️ (@soby0x) June 14, 2024\n\n“The first activity a lot of people latched onto is called our Vanguard mint, which is this massive NFT drop,” Batton said, explaining that more and more transactions are coming from Unicorns Bingo, a play-to-earn mobile game. “I think as more things release throughout the campaign, you’re going to see a lot of that activity engage with the games.\"\n\nThis follows the previous Xai Odyssey campaign last year, which saw a similar jump in user activity—with 500,000 connected wallets collectively generating 5 million daily transactions, ahead of a rewards distribution of tokens that were worth a grand total of nearly $200 million at XAI's peak price in February.\n\nSet to run through November, Vanguard: Genesis will help launch a dozen new games on Xai, but that's not the full extent of what's coming to the network—other games will come via Xai's partnership with The MIX and perhaps other launches. Alongside this new suite of games, the campaign will also see new quests, achievements, and rewards available for the community.\n\n“We think about this as an ecosystem-wide event,” Batton told Decrypt. “We can build this huge momentum curve and then slot in different game launches into that momentum.”\n\n🚨 Crypto Unicorns is LIVE on @XAI_Games! Blockchain’s most robust gaming economy has finally launched on XAI!🎉 After migrating over 250 smart contracts from Polygon, we’re ready to begin the next era of Crypto Unicorns. Come join us to Breed, Battle, & Collect and expand… pic.twitter.com/OKVHsMtCbZ — Crypto Unicorns (@crypto_unicorns) June 26, 2024\n\nCrypto Unicorns marked the start of that release slate late Tuesday, completing its migration from Ethereum sidechain Polygon to the Arbitrum-based layer-3 gaming network. This franchise is one of the crypto industry’s most stalwart gaming brands, offering a play-to-airdrop campaign (Unicorns Bingo) as the migration was under construction.\n\nWhile Crypto Unicorns is already widely known, Batton highlighted a lesser-known project called The Lost Glitches as one of the games he’s most excited to launch.\n\nAD\n\nAD\n\n“I encourage you to go look at their Twitter account and look at their media. Oh my goodness, it's amazing,” Batton said. “It’s probably the best-looking card game I've ever seen, which is saying a lot because Parallel looks great. But I think The Lost Glitches takes it a step further.”\n\nAside from these games, Batton also expressed excitement for Final Form, a card-driven auto-battler game that his own Ex Populus studio is developing. Beyond that, there are several other games planned to launch via the campaign, some of which remain unannounced as of this writing.\n\nComing back to the Valve comparison, Batton sees the Vanguard: Genesis campaign as comparable to the massive, annual Steam Summer Sale that has become a reliable event for gamers. In turn, this isn’t going to be a one-hitter quitter. Instead, there are plans to do “two or three” seasons, as he called it, per year.\n\n“Every season is going to have a group of games that we promote. And I think the focus is likely to be on new games launching,” Batton said. “But we'll also be happy to bring games back from previous seasons that are maybe doing retention campaigns, especially if they have something new to offer.”\n\nThat’s the long-term vision. For now, the team's eyes are set on Vanguard: Genesis, which Batton hopes will populate Xai with must-play games and help the network live up to the promise generated by sizable hype and a valuable token drop earlier this year.\n\n“Our focus has been: Let’s go out and find the best triple-A, production-quality games. Let's get like half a dozen of those to just crush it in 2024,\" he said.\n\nEdited by Andrew Hayward\n\nAD\n\nAD"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQZm1tRFBlelBHcE1tOWFOSE1PRFhhZDF3NFpxbUgxLUFqU1RsTVlkVzFXbFFFMm85UUpRcy04a0VGTm1IRDh1Nno4YjI0TlN5d3BjbkQyYjNMeUtyM1RVSDh5VW43ZVpocGpfaEl0a0tMSW4yRVVHZF9ialJRRXFheGJQWTJ1SE9WaGxTel9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Demand to be Lower Than Bitcoin, Says Bernstein - Watcher Guru",
        "content": "The recently approved Spot Ethereum ETF is expected to see far lower demand from investors than its Bitcoin counterpart, Bernstein says. Indeed, the management firm released a research report Monday forecasting the second crypto-based exchange-traded product to see demand on a much lower scale.\n\nThe Ethereum ETF has yet to go live, with the market anxiously awaiting its arrival. Yet, the lack of staking features in the ETH option means less spot conversion, experts have stated. Additionally, the state of the market could further lessen interest in the product when it goes live.\n\nSource: Wealth Management\n\nAlso Read: Ethereum ETF Applicants File Updated S-1 Documents With SEC\n\nEther ETF Demand to be Notable Lesser Than BTC\n\nIn January, Bitcoin’s Spot ETF approval changed the game for cryptocurrencies. It was a massive catalyst for the leading cryptocurrency’s surge to an all-time high of $73,000 just three months later. Yet, analysts are not expecting the same to take place for the second digital asset to get the investment product.\n\nAccording to Bernstein analysts, the incoming Ethereum ETF will not garner the same demand as Bitcoin when it launches. “ETH should not see as much spot ETH conversion due to the lack of an ETH staking feature in the ETF,” the firm’s Gautam Chhugani and Mahika Sapra wrote.\n\nSource: Bitcoinist\n\nAlso Read: After Ethereum ETF, Dogecoin; Solana; And XRP Next In Line?\n\nAlthough the product has been approved, there is no timetable for it to begin trading. The US Securities and Exchange Commission (SEC) approved a critical regulatory filing from issues last month, leading to rumors it could launch in July.\n\n“ETH as a primary tokenization platform is building up a strong use-case, both for stablecoin payments, as well as tokenization of traditional assets and funds,” Bernstein added.” They also said that an “improved regulatory regime,” would be a benefit to ETH. Such a shift isn’t likely to come to fruition until the impending US presidential election in November."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQMXNDekJNR3RhMXRlTWdnTVMtMTB4NDVMY3RMZUlGcElfRF81Y0xpNGpQYW90MVlHQnBxamQ4MTdNU05ZWkVuczJYSmZVS0M0OXRKOTJQMThralpwazRHQkhvWUstSTduemlBbzU5Zlg2bW9VWkZKaFZtYVdRNWZZQ0hrS2JIVTR0ZGRwR1U5WHg0QUJtck9KUEFhd0F5OGxpd3ZQRFNtRTNEWXpGVkdhbDcxZG45NjhvV0N3WUN1cTBPaUJENG5Od19YeVFhbk4wR1dKVkx2SdIB1wFBVV95cUxQMXNDekJNR3RhMXRlTWdnTVMtMTB4NDVMY3RMZUlGcElfRF81Y0xpNGpQYW90MVlHQnBxamQ4MTdNU05ZWkVuczJYSmZVS0M0OXRKOTJQMThralpwazRHQkhvWUstSTduemlBbzU5Zlg2bW9VWkZKaFZtYVdRNWZZQ0hrS2JIVTR0ZGRwR1U5WHg0QUJtck9KUEFhd0F5OGxpd3ZQRFNtRTNEWXpGVkdhbDcxZG45NjhvV0N3WUN1cTBPaUJENG5Od19YeVFhbk4wR1dKVkx2SQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Dogecoin, Solana, And Cardano ETFs Could Follow Spot Ethereum ETFs – How The Crypto Market Will React - Blockchain News",
        "content": "Could Dogecoin ETFs, Solana ETFs, and Cardano ETFs follow on the heels of Spot Ethereum ETFs? Industry experts believe so. Meanwhile, ETFSwap provides the most secure platform for trading Spot Ethereum ETFs.\n\nNotable figures in the crypto space predict that the approval of Spot Ethereum ETFs will launch an avalanche of proposals for Dogecoin ETFs, Solana ETFs, and Cardano ETFs. Meanwhile, ETFSwap (ETFS) is garnering increasing attention from traders for its unique offering of diverse ETFs on a user-friendly platform equipped with industry-leading AI trading tools.\n\nWhy Traders Say They Have “The Best Trading Experience” Trading Spot Ethereum ETFs On ETFSwap (ETFS)\n\nETFSwap (ETFS) is a platform for trading and investing in tokenized exchange-traded funds (ETFs) listed on the blockchain. It enables investors to diversify their portfolios with secure, legitimate tokenized assets backed by real-world securities purchased from traditional financial markets. This is possible because ETFSwap (ETFS) works with MiCa-compliant regulated investment banks to deal in securities and crypto trading.\n\nETFSwap (ETFS) offers traders the potential to earn heightened profits with up to 10x leverage on all trades, 50-60x leverage on perpetual futures and options trading, as well as optimal liquidity. The platform also provides the tools and support to manage leveraged trades effectively so traders can take advantage of opportunities while mitigating risks.\n\nUsing advanced AI-powered tools like the ETF Screener and ETF Tracker, ETFSwap (ETFS) investors are empowered to make better-informed trading decisions. With artificial intelligence, these tools analyze large amounts of market data to identify trends and provide insights into the best assets to invest in for maximum profits.\n\nETFSwap’s (ETFS) responsive, easy-to-use interface has drawn praise from traders using the platform. They say they always easily access the features and screens they need, whether they are executing trades, checking their portfolios, staking ETFS, or trading perps.\n\nSpot Ethereum ETFs Approval Could Pave The Way For Dogecoin ETFs, Solana ETFs, And Cardano ETFs\n\nFollowing its declaration of Ethereum (ETH) as a commodity, the SEC announced it should fully support the Spot Ethereum ETFs by the Summer of 2024. Industry experts say this could open the doors for Dogecoin ETFs, Solana ETFs, and Cardano ETFs to enter the crypto market.\n\nCanadian firm 3Qi has filed a proposal with securities regulatory authorities in Canada to approve what could be North America’s first Solana ETFs. If granted, US Solana firms could start filing proposals for Solana ETF approval with the SEC, and Dogecoin ETFs and Cardano ETFs may follow.\n\nCardano ETFs may also enter the crypto market before long. Cardano (ADA) is the 10th largest cryptocurrency on the planet by market capitalization and boasts a more secure and scalable blockchain than most others. With its oft-intense competition with bigger blockchains, Cardano ETFs could receive approval soon after Solana ETFs.\n\nDespite Dogecoin’s (DOGE) status as a meme coin without much utility, gaining approval for Dogecoin ETFs is not impossible. Dogecoin (DOGE) is currently ranked 9th among the biggest cryptocurrencies in the world, one place above Cardano (ADA). So, it is well-positioned to lead meme coins to an age of institutional usage with a Dogecoin ETF. When the proposals start pouring in, Dogecoin ETFs could be among the first to receive approval.\n\nHow Dogecoin, Solana, And Cardano ETFs Will Impact The Crypto Market\n\nFollowing the approval of Bitcoin ETFs earlier this year, Bitcoin (BTC) saw a price rally of up to 75% as Whales poured 2,212 BTC into US Bitcoin ETFs. A similar trend is expected for Dogecoin ETFs, Solana ETFs, and Cardano ETFs once they gain approval.\n\nAlthough bearish market conditions have since sunk Bitcoin’s (BTC) price, tokenized assets are receiving favorable attention. According to Rajagopal Menon Vice President, WazirX, about $2 billion was invested into Bitcoin ETFs over the last week. Ethereum (ETH) also saw a 22% price surge following the SEC’s approval of Spot Ethereum ETFs.\n\nConclusion\n\nDogecoin ETFs, Solana ETFs, and Cardano ETFs will inevitably follow the SEC’s approval of Spot Ethereum ETFs. Till then, investors can trade Spot Ethereum ETFs on ETFSwap (ETFS) and earn heightened profits by investing in ETFSwap’s native cryptocurrency ETFS, which analysts believe will make over 200000x.\n\nThe token is currently on presale at $0.01831 and more than twenty-six million tokens have been sold. Investors can accumulate more tokens with the ongoing 20% promo to maximize their returns.\n\nFor more information about the ETFS Presale:\n\nVisit ETFSwap Presale\n\nJoin The ETFSwap Community"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxONVVwVnA0Q2ljd0hGSW1KYS13MEVSMjVmSF80eDlxX1daeVBwaGN6UVY5Qm1lN1FlcXMzUTNyTDR4Z0RZZWNxYjF0S0xLTmYtQ0hsQTlJU3FyYjZpVFNCWGhDRjR2YnoySmZ4NVFZWlRjR19xQktCdTk2dUdNM1ZyZ3ZSWGlSN3lzZFRPQWNONlVhRG5VeFV1WTdjY2plN3A2WkxTRVhHc0rSAa4BQVVfeXFMTmZyb3ZZSWxpQzlMelVzUUs0ZGx3bGV3THVMV0tvMnlXUWJNSjdlU0s5ZGx1UjdPR0dfQW16dkNna3pyTzZjOHJ0bTVzMmpkb0FJbzRRdnR6RUNIUWJwYVJQRHZYcHAtcjlZaDdPVlFLSmNPRkY4QWp5MVpIamxpb3R0RmYyb3VlY3NnWDE3Q3gxTEpBeGVZUXEwdEhLTEpHNVhXbjNZVk9oNDRrbEhR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: Eyeing $5,000 As $15B Spot Ethereum ETF Inflows Linger? - CoinGape",
        "content": "Ethereum Price Forecast: As spot Ethereum ETFs trading nears, predictions hint at massive inflows of up to $15 billion. According to a report by Matt Hougan, a Bitwise investment officer the milestone could be achieved in just 18 months.\n\nMeanwhile, the crypto market has been sending mixed signals this week, starting with a sell-off on Monday and an immediate recovery on Tuesday. Ethereum price hovered at $3,376 toward the US session on Wednesday, June 26, and after correcting by 5% in seven days.\n\nadvertisement\n\nBitcoin had settled above $61,000 following a rebound from $60,000 support. CoinGecko data shows no change in the total market cap which holds at $2.386 trillion.\n\nHow Spot Ethereum ETFs Will Achieve $15B Net Inflows\n\nAccording to Hougan’s analysis, investors are likely to buy Bitcoin and Ethereum ETFs based on their respective market shares.\n\nCurrently, Bitcoin accounts for a cumulative market value of 74%, with investors in the United States pumping $56 billion in BTC ETFs since the approval on January 10, 2024.\n\nBitwise anticipates that US investors will have put $100 billion in Bitcoin ETFs by the end of 2035, as more and more fund managers allocate funds to the digital product.\n\nHougan argued that “using this $100 billion figure as a reference, spot ether ETPs would need to attract $35 billion in assets to reach parity, a process I expect will take about 18 months.”\n\nIt is worth keeping in mind that the existing Grayscale Ethereum Trust is worth $10 billion and awaiting to convert to an ETF. This implies that Ethereum ETFs will need only $25 billion to reach the $35 billion target.\n\nHowever, this is not likely to be the case considering in Canada, Ethereum ETPs make up between 22 – 23% of the total assets under management (AUM). In other words, Ether ETFs could underperform the total market cap weight.\n\nTherefore, the Bitwise report cuts its estimate to $18 billion in 18 months where $3 billion is allocated to unforeseen market factors, arriving at the $15 billion spot Ethereum ETFs’ outlook.\n\nEthereum Price Forecast: When Is ETH Likely To Blast To $5,000?\n\nEthereum price is currently engulfed in uncertainty, the same uncertainty holding many cryptocurrencies including Bitcoin from advancing into the bull market.\n\nA descending channel on the four-hour chart guides the retreat from May’s peak of $3,972. The major support stands out at $3,300 as highlighted by the black band.\n\nIf broken, declines are likely to extend to $3,200 with $3,000 and $2,800 not too far away. The Relative Strength Index (RSI) downtrend reinforces the bearish grip, implying that the sell-off is not over.\n\nOn the positive side, the upcoming trading of spot Ethereum ETFs could change market sentiment, encouraging traders to long ETH for a breakout above $4,000.\n\nThis Ethereum price prediction reveals should ETF net inflows surge drastically, a rally might break out driving the smart contracts token to reach the $5,000 milestone.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQSjdmWUpOUUVKeGpxakU3TjNQc0dBQ0RTdWZOa3VIX2RNblVxTTRubEFJQVJweDFXRDJSanM0LWZzRUtCdE1GVTJWM19lM0kxS2R5NU8xX1FKaVlkN3dRc0phQUtkY1dGY0x6YjhJS1hvcHRXNGZQdHNzUXVRcFphNGJTREYzcHV1dkRBeUVmQ2tOS09OTkxvSTUzUVJaYXg2Y2x2YXZXakQwQjdHYlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Artificial intelligence (AI) sets the price of Ethereum (ETH) for July 1st - The Cryptonomist",
        "content": "In the midst of the media campaign for the approval of Ethereum ETFs, artificial intelligence (AI) has ventured some price predictions for ETH.\n\nToday, ETH experienced a brief recovery, reaching a high of $3,418. However, this rise was followed by a significant drop, bringing the price to $3,355.39 with a daily decrease of 1.84%.\n\nThe price movements of Ethereum (ETH) and the use of AI as an evaluation tool\n\nThis volatility has sparked the debate on what the price of ETH (Ethereum) could be in the near future, and the use of artificial intelligence (AI) to predict such movements is becoming increasingly popular.\n\nArtificial intelligence is revolutionizing many sectors, including financial markets. AI algorithms can analyze enormous amounts of data in real-time, identifying patterns and trends that might escape the human eye.\n\nThis makes AI a valuable tool for predicting the price movements of cryptocurrencies like Ethereum.\n\nOne of the main methodologies used by AI for price prediction is sentiment analysis. This process involves collecting and analyzing data from social media, forums, financial news, and other online sources to assess investors’ sentiment towards a particular asset.\n\nFor example, a general positive sentiment could indicate an increase in price, while a negative sentiment could predict a decrease.\n\nAnother common approach is technical analysis, which uses historical price data to identify trends and patterns. AI algorithms can analyze this information much faster and with greater precision compared to humans, providing more accurate predictions.\n\nFor Ethereum, technical analysis might include the study of recent price fluctuations, trading volumes, and other technical indicators to predict future price movements.\n\nIn addition to sentiment analysis and technical analysis, AI can also incorporate macroeconomic and market factors to provide more comprehensive forecasts.\n\nFor example, the impact of regulations, technological development, and the adoption of Ethereum’s blockchain can all influence the price of ETH. AI algorithms can aggregate and analyze these factors to offer a more holistic view of the market.\n\nThe price predictions of ETH\n\nFor July 1, 2024, the price predictions for Ethereum based on AI vary depending on the model used and the data considered.\n\nSome models predict a price increase thanks to the introduction of ETH ETFs, which could attract a greater number of institutional investors and increase demand.\n\nOther models, however, indicate that the current global economic difficulties and market volatility of criptovalute could continue to exert downward pressure on the price of Ethereum.\n\nFor example, if the introduction of ETH ETFs were to lead to a wave of institutional investments, the price of Ethereum could rise significantly, potentially surpassing historical highs.\n\nHowever, if macroeconomic conditions were to worsen or if new restrictive regulations were to emerge, the price of ETH could continue to fall.\n\nConclusions\n\nIn conclusion, the use of artificial intelligence to predict the price of Ethereum offers a powerful tool for investors.\n\nHowever, it is important to remember that, despite the advanced analytical capabilities of AI, predictions are never 100% certain. Cryptocurrency markets are notoriously volatile and influenced by a wide range of factors.\n\nTherefore, investors should use AI-based forecasts as one of the many tools in their decision-making arsenal and continue to closely monitor market conditions."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE1BTmQtNW1FVzVEbDBWY2Q0d3IwYTlwUEU1dndHVDJTV2RDVDlKc0E5a20tRU5vaVZ2NkVtN1UtZkZZa2VhakVpbnp5SkYwWGlIU3JCZkF0bkVNeVNtdjRISkF3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "0x (ZRX) Protocol: What It Meant and How It Worked - Investopedia",
        "content": "What Was the 0x (ZRX) Protocol?\n\nThe 0x (zero x) protocol enabled the peer-to-peer exchange of assets on the Ethereum blockchain. It was launched in 2017 by ZeroEx Labs, an organization based in San Francisco. The protocol itself was not, by the developer's definition, a decentralized exchange; it allowed for the creation of decentralized exchanges that can be used in broad applications.\n\nHowever, the Commodities and Futures Trading Commission disagreed—it shut down the 0x protocol in September 2023 for operating as an unregistered exchange, and its developers were fined $200,000.\n\nKey Takeaways The 0x protocol was an open protocol that enabled the peer-to-peer exchange of assets on the Ethereum blockchain.\n\nThe 0x protocol was open source and managed by the 0x decentralized autonomous organization.\n\nThe 0z protocol was shut down, and as of June 26, 2024, it is no longer maintained.\n\nThe History of 0x (ZRX) Protocol\n\n0x was founded by Will Warren and Amir Bandeali in 2017, who launched an initial coin offering in 2017. The ICO was a success, raising $24 million and another $85 million between two fundraising rounds between 2021 and 2022.\n\nThe secondary protocol was created on Ethereum to act as a settlement layer for trading ERC 20 tokens. ERC 20 tokens are fungible (exchangeable) tokens that follow the standards set by Ethereum Request for Comment 20.\n\nIn 2021, 0x launched the 0x Decentralized Autonomous Organization (DAO), the organization that would allow participants to govern the progress of the project.\n\nBut in September 2023, the Commodities and Futures Trading Commission filed and settled charges against ZeroEx, Inc, along with two other digital asset exchanges, Opyn, Inc, and Deridex. Charges included failing to register as a futures commission merchant, failing to register as a swap execution facility, and illegally offering leveraged and margined retail commodity transactions.\n\nZeroEx was ordered to pay $200,000 in fines and cease operating as an exchange. As of June 26, 2024, the project community was very small, and the 0x Project's Reddit page had been abandoned.\n\nAs of this writing, 0x (the ZRX token) had a market cap of $307.6 million and a 24-hour trading volume of $10.5 million. It had a circulating supply of 847.5 million ZRX.\n\nHow the 0x (ZRX) Protocol Worked\n\nThe protocol set up a system of makers, takers, and relayers. Makers were the users who placed orders on the exchange proxy and waited for a match (providing liquidity). Takers placed orders that were immediately matched (removing liquidity). Relayers were network participants who maintained the order book, acting similarly to an exchange.\n\nThe 0x protocol’s message format was composed of a set of data fields that carried vital information, such as the digital asset or token to be traded, the price value of the transaction, the expiration time, and the defined identities of the transacting parties.\n\nSmart contracts took care of the necessary business logic for generating, sending, receiving, and processing the data linked to the trading activity. ZRX was 0x’s native governance and staking token. ZRX owners had a say in how the protocol evolved, and token holders could also stake their tokens to earn ETH (the Ethereum token ether) liquidity rewards.\n\nThe Future of 0x (ZRK)\n\n0x's future is somewhat unclear, as its market cap and price have continued a general downward trend since its introduction. Having been shut down by regulators in 2023, the protocol and its few remaining fans don't have many options unless it transitions from exchange services or registered with the CFTC.\n\nWhat Is the 0x Protocol? 0x was a protocol for the Ethereum blockchain. It facilitated peer-to-peer exchanges of assets built using Ethereum. The project was shut down by the CFTC for operating as an unregistered exchange and abandoned by its developers.\n\nWhat Is a 0x Exchange Proxy? A 0x exchange proxy was an entity that allowed applications to be developed using the protocol.\n\nWhat Is the Price Prediction for 0x Protocol? Although the project has been abandoned, there is still ZRX trading activity. However, as there is no active development, ZRX is likely to continue to decline in market value.\n\nThe Bottom Line\n\nThe 0z protocol allowed users to exchange assets using the Ethereum blockchain. In 2023, the CFTC shut it down for operating as an unregistered exchange.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info. As of the date this article was written, the author does not own ZRX."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5qQU43TjkzWVFmQkJiMndRYXc0NVAtbmtnTUNPdThhM0Y5bW9zeUhqOExPVXFINGpNS1ZVVkxMUW9yeU55cDFMOTJRY2UtX0ctVS1iekdBc1JaZFFBbGNFY1pULXdSYVdfdnFOcWxlMnhmMkZBMWpnRTNTX2FZZ28?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "7 Cryptos to Watch This Week: Bitcoin, Ethereum and More - Yahoo Finance",
        "content": "If you can’t handle the extreme ebb and flow of high-risk asset classes, the cryptocurrency market probably isn’t right for you. We’re getting a taste of the wildness of the blockchain ecosystem, with the total market capitalization of all cryptos slipping conspicuously on Monday. At the moment, the value of global virtual currencies comes in at $2.26 trillion.\n\nOf course, that’s disappointing for those who recently got into the space. Previously, the sector had done a good job of holding onto the $2.5 trillion market cap support line. Unfortunately, with the benchmark digital assets slipping badly in recent sessions, investors need to prepare for possibly extended rough waters.\n\nWhat’s causing the choppiness in the high seas? Some experts point to the German government standing poised to liquidate a significant amount of cryptos “earned” through illicit means. Further, some evidence exists that the whales — or the big dogs in the market — have slowed their trading activity. With the fading momentum, people aren’t as eager to participate in cryptos.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nFrankly, the erosion of major tech players like Nvidia (NASDAQ:NVDA) probably doesn’t help either in terms of ginning up sentiment. Still, that could also spell discounts for the opportunist. Below are several cryptos to watch this week.\n\nBitcoin (BTC)\n\nCrypto prices collapse downturn. Bitcoin (BTC-USD) cryptocurrency value drop bear market concept. Doomed Cryptos to Dump. cryptos to sell\n\nSource: Quality Stock Arts / Shutterstock.com\n\nIt’s not time to hit the panic button. However, crypto investors need to pay close attention to Bitcoin (BTC-USD) this week. In the past 24 hours since the clock officially turned to Tuesday morning, the benchmark virtual currency lost more than 2% of market value. Over the past seven days, it sank more than 6%.\n\nTo be sure, it’s not so much the red ink in the basis points that hurt. Rather, it’s that Bitcoin is threatening to slip below — and perhaps well below — the critical $60,000 level. Yeah, you can say it’s just a number. But let’s keep in mind that not too long ago, BTC received praise for jumping back up above the 70K milestone. Going backwards is not what the bulls had in mind.\n\nIs it time to buy the volatility, though? I think it might be the right idea but I wouldn’t be surprised if more downside materializes. So far, the candlestick of the June 25 session is very small compared to the red blotch represented by the Monday session.\n\nMaybe take a nibble but keep the powder keg dry. That would be my idea.\n\nEthereum (ETH)\n\nCrypto currency etherium. ethereum coin on exchange charts. e-currency Ethereum. Ethereum price predictions\n\nSource: viktoryabov / Shutterstock.com\n\nAs with the benchmark digital asset, it’s not time to panic on Ethereum (ETH-USD). It is time to put your crosshairs on this bad boy because circumstances are getting volatile. In the past 24 hours, ETH slipped about a half percent. During the trailing one-week period, the number two crypto by market cap dipped around 2%. These stats aren’t what’s important.\n\nStory continues\n\nRather, as with other cryptos, the technical profile for Ethereum appears to be weak. Conspicuously, the popular virtual currency is trading hands at $3,374. That’s below its 50-day moving average, a key barometer for near-term market health. Also, it goes without saying that ETH is off its 20-day exponential moving average.\n\nIf more volatility materializes, which wouldn’t be out of the question, the $3,100 support line must hold. Otherwise, it could be a quick drop to $2,900. That’s the type of activity that the bulls will not want to see.\n\nAs for playing this market, I’m not liking how the response to the June 24 fallout has been so pensive. Again, nibble at Ethereum if you must but keep the powder keg dry.\n\nTether (USDT)\n\nA concept token for the Tether cryptocurrency.\n\nSource: DIAMOND VISUALS / Shutterstock.com\n\nAs the mainline stablecoin or cryptocurrency pegged to a fiat currency (typically the dollar), Tether (USDT-USD) provides a critical look into broader blockchain sentiment. Basically, USDT represents the oil that keeps the digital asset ecosystem’s chains moving smoothly. That’s because crypto investors will convert their wealth into Tether. When opportunities arise, they can respond immediately.\n\nSo, here’s how the theory plays out. If more market participants are comfortable storing their wealth in crypto terms, Tether should rise in value relative to dollars. In other words, USDT should be traded at a higher peg relative to USD. On the other hand, if people are not comfortable with cryptos overall, they’re less likely to hold Tether units. In this case, dollars will be worth more than USDTs.\n\nRight now, one dollar is worth about 0.9996 Tethers. Under a perfect peg, one dollar should be worth one USDT unit. So, the fact that the stablecoin is worth less than a single greenback suggests broader pessimism. That’s not surprising given the evidence that we’ve seen.\n\nAgain, this isn’t meant to panic investors. However, it’s worth mentioning so that you don’t go too aggressive on cryptos this week. Like I said earlier, you may want to keep the powder keg dry.\n\nSolana (SOL)\n\nConcept art of the Solana (SOL-USD) blockchain.\n\nSource: Shutterstock\n\nLet’s move to some potential opportunities in cryptos, beginning with Solana (SOL-USD). What’s interesting about SOL is that unlike many other major digital assets, SOL gained 8% of market value in the past 24 hours. That said, it didn’t move anywhere in the past week, losing about half-a-percent. So, what’s going on with this popular altcoin or alternative crypto?\n\nTechnically, Solana finds itself at an interesting crossroads. Generally, circumstances don’t look particularly pleasant. First, SOL failed to secure its top-level support line around the $178 mark. It then failed to hold the $156 line, represented by its 50-day moving average (DMA). At one point, Solana briefly slipped below its 200 DMA, which sits at $133.\n\nMoving forward, the next few sessions will be critical in establishing the near-term trajectory. Presently, Solana trades hands at approximately $135.50. It really has to move higher from here, perhaps jumping to its 20-day exponential moving average (EMA), roughly $145.\n\nIf SOL is unable to make progress, it risks falling to the $100 level. As with the other cryptos, a small position now may be warranted. However, keep the powder keg dry for a bigger discount.\n\nCardano (ADA)\n\nCardano (ADA) token with blue and orange digital background.\n\nSource: Stanslavs / Shutterstock\n\nA fan favorite within the altcoin community, Cardano (ADA-USD) enjoys no shortage of supporters. However, it might be put-up-or-shut-up time for the blockchain asset, at least from an immediate perspective. In the past 24 hours, ADA gained about 2.5% of market value. That’s good. In the trailing week, it gained over 2%. That’s even better.\n\nHowever, the problem is that Cardano’s technical profile is very suspect. Presently, the coin trades at just under 39 cents. That’s noticeably below the 20-day EMA, which comes in at 40.6 cents. Also, it’s significantly under its 50 DMA, which stands at 43.9 cents. The 200 DMA? Forget about it — that’s up at 54.2 cents. Honestly, the bulls need to think about small steps first.\n\nA horizontal support line is evident around the 45.5-cent level. For Cardano to regain credibility immediately, it must move to this mark, full stop. I’m hoping that the legion of supporters will see the discount and bid ADA higher.\n\nBut it’s also possible that with the whales being pensive, ADA could struggle. For speculators, nibble at the currently cheapened price. Just know that there’s a possibility that Cardano could fall quickly below the 35-cent line.\n\nChainlink (LINK)\n\na digital representation of the chainlink (LINK) cryptocurrency\n\nSource: Stanslavs / Shutterstock.com\n\nThose seeking a speculative upside wager in cryptos may want to turn their attention to Chainlink (LINK-USD). Let’s look at some interesting stats. During the past 24 hours, LINK gained nearly 7% of market value. Over the course of the last seven days, the cryptocurrency gained more than 2%. Amid the blockchain fallout, those are pretty encouraging numbers.\n\nIt just might get better. LINK has a tendency of see-sawing violently. Throughout much of April and May, the price of the digital asset baselined at approximately $13. However, during the recovery rally late last month, LINK briefly shot up beyond $19 on an intraday basis. That provided temporary hope that sentiment can carry Chainlink back to the $20 level.\n\nUnfortunately, earlier this month, the crypto encountered a series of volatile sessions. The bad news is that the blockchain asset finds itself trading below its 50 and 200 DMAs. However, the good news is that the bears attempted to drive LINK below $13 but failed. Just to repeat, that price represented a prior support line.\n\nMoving forward, it’s possible that LINK could start marching higher. I’ll start getting excited should the price breach its 50 DMA, which stands at $15.71.\n\nUniswap (UNI)\n\nA concept image for the Uniswap (UNI) token.\n\nSource: Shutterstock\n\nOne of the most popular altcoins for its underlying utility, Uniswap (UNI-USD) dipped about 1% in the trailing 24 hours. During the past one-week period, the digital asset dropped almost 4%. At the moment, the crypto features a market cap of $5.67 billion. That’s good enough for number 18 in terms of the most valuable virtual currencies.\n\nLooking at the technical profile, Uniswap finds itself in an interesting position. Presently, at a price per unit of $9.47, it sits below its 20-day EMA ($9.98). Further, it’s trading right at its 50 DMA. During the June 24 session, the bears managed to drive the price below this key barometer briefly before rebounding. To establish credibility, Uniswap needs to build from here.\n\nOne positive news item is that the price action has held strong above the 200 DMA ($8.79). If a correction materializes, a drop below this point could send the digital asset down to $7.\n\nWhat may work in favor of Uniswap is strong support for the underlying ecosystem. If enough investors jump in, UNI could start moving higher. Still, I would probably keep the powder keg dry just in case for unexpected headwinds.\n\nOn the date of publication, Josh Enomoto held a LONG position in BTC, ETH and USDT. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nA former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia.\n\nMore From InvestorPlace\n\nThe post 7 Cryptos to Watch This Week: Bitcoin, Ethereum and More appeared first on InvestorPlace."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOWVZfUlhHbndPbzZHTkRjbnAxODA1U2d5VExkel90cFlkSW1LVzJaY3N6YzV3ZWJmNkdaMjlTcHRsNlg5V0c3MkVZOE0ySXpoclRwRkpBRkpYWXFETkgzX2dVdjNCN2p1YlRiMjhtLXlJZ1c5MFo3b1RLb3RMQ2xscEcxMzFfeU1iamdaMlpWMGxiSGE0NXg3VmJvVHBxeEZ0Yk5Uc19GS3k1Y3Zp0gGyAUFVX3lxTFBWQnhDUDJiZUFiaWhMMFU4alEyUUpiNm1vZElKT3lDbUNYV0xZM0pyOUVaZElpb2tOZmN6a2JBSjdyUld4dHVEd05VRWZTNExpUzd0Tjg3cE5IODBPbGlqZGNRV25nWGRoNlJ0NE5EOUxDc1RxcDU4RUlPZUd3MWdBM21jZzQtWUcwdldIbTlEazBaVG5ZaDdIakhNR2pFT0Y0cWg3MTBYbE1KdTZrTzZaN0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Prediction: Is Ethereum Price Poised For $4000 As Spot ETF Trading Nears? - CoinGape",
        "content": "Ethereum has defended support at $3,200, subsequently keeping at bay calls for an extended correction to $3,000. In light of the spot Ethereum ETF trading in July, sentiment in the market is bound to improve and propagate a rebound to $4,000 and higher in the same month.\n\nA 20% Ethereum Price Breakout Could Happen Before End of June\n\nadvertisement\n\nETH price action is interesting as inside the giant ascending triangle, a falling wedge is forming. In fact, the falling wedge has formed for the last month, and room for price action movement is thinning out. Falling wedges are generally bullish market structures since they have a higher probability of breaking to the upside.\n\nThe Ethereum price action is trending below the 50-day but above the 200-day simple moving average (SMA), indicating a tussle between the bears and the bulls.\n\nIf the price of Ethereum breaks above the falling wedge, it could trigger a 20% move that restores the asset back above $4,000. On the flip side, Ethereum has robust support at around $3,000 to hold the price up.\n\nThe lag in ETH price (despite the increasingly positive fundamentals) may be instigated by Bitcoin, which has left many market participants in a state of panic as it encroaches near a dangerous support level.\n\nBitcoin price dropped 1.59% yesterday and closed the day at $60,807. While today the price is slightly up, it still doesn’t constitute good news.\n\nThe whole region between $60,198 and $62,252 is a danger zone as a close below this range could result in a larger price drop to the $50,000 support level.\n\nOn a positive note, if Bitcoin price manages to bounce off this level, we may witness a surge to $70,000 soon after.\n\nEthereum Price Lags Despite Positive Fundamentals\n\nEthereum price action is setting itself up for a break to the upside in anticipation of the approval of an Ethereum ETF by July. U.S S.E.C Chair Gary Gensler told a Bloomberg Invest audience that the Ethereum ETF approval process was “going smoothly”. In a separate interview with the Financial Times, Gensler signaled that the ETFs would begin trading soon. These developments have Ethereum investors at the edge of their seats for what could be the biggest ETH and altcoin run in the history of crypto.\n\nBottom Line\n\nBTC is experiencing downward pressure, with ETH showing promises of a significant breakout. As Bitcoin approaches the critical $60,000 support level, this price action may signal a short-term bearish sentiment in the broader crypto market, warranting caution and strategic decision-making.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOUWh5Q3dqQ19pMXlyVnV6anp3bXVNb2FYZ2FaZlBiRE1iNy1SNUhDbWp1VW9CTmVhcFhUOFpCTVlFLU56OGJxZThPRFJkQ0JtUkpaRkJvNUlIRmJLeUlLZ2kxUmMybmV1NG1XV0VtMVhMVTZWWU5uRXR2cnZ1UFZaVGdLRdIBiwFBVV95cUxPalVNUW9MRjdfM0dvelY1a1ZnZmFjXzZiTUNQeWdpbzhkUWhBb21tMWhjTlRyS0JxM0VFZEZhWGVlMzBGdWZIRmhTZXhCTTBFYTRVZ1B1NG5pTm8wU0JWaW01RDJIamwxeERwdWJtTjJnNU1qUnQ5VkgtOWhqV3N6cFRpbWp1VHVsRDAw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Bybit Report Says Institutional Investors Will Triple Their Holdings With Spot Ethereum ETFs – Here’s Where You Can Trade It - AlexaBlockchain",
        "content": "A recent market report by crypto exchange Bybit highlighted how much institutional investors have increased their exposure to ETH since the Spot Ethereum ETFs were approved on May 23, 2024. In anticipation of the launch of these Spot Ethereum ETFs, ETFSwap (ETFS) has emerged as the go-to platform for investors to trade these Spot Ethereum ETFs.\n\nETFSwap (ETFS) Is The Right Place To Trade Spot Ethereum ETFs\n\nETFSwap (ETFS) is a decentralized investment platform that tokenizes exchange-traded funds (ETFs) like the Spot Ethereum ETFs and enables them to be traded on-chain. Thanks to its exciting features, ETFSwap (ETFS) has emerged as the right place for investors to trade these Spot Ethereum ETFs.\n\nThe trading platform offers staking services, meaning that institutional investors can stake and earn yields on their ETH tokens while also gaining exposure to the Spot Ethereum ETFs. This is significant, considering that the Spot Ethereum ETF issuers had to remove staking plans for their respective funds.\n\nAs such, ETFSwap (ETFS) allows institutional investors to enjoy the mouth-watering yields that the ETH provides while simultaneously investing in the Spot Ethereum ETFs. Besides enjoying staking rewards from their ETH, investors can also stake their ETFSwap (ETFS) tokens and even earn greater yields with up to 87% annual percentage yield (APY).\n\nMeanwhile, ETFSwap (ETFS) offers leverage trading services, allowing institutional investors to use up to 50x leverage on their trades. This enables users to maximize the gains from investments in these funds, like the Spot ETH ETFs. ETFSwap (ETFS) also offers perpetual trading services, meaning that investors can keep their ETF trades open for as long as they like.\n\nETFSwap (ETFS) also stands out because it offers the best user-friendly interface. Using the ETFSwap (ETFS) token, investors can easily convert their ETF holdings to crypto assets and vice versa. Investing on the ETFSwap (ETF) platform is also very straightforward, as Know-Your-Customer (KYC) requirements are non-mandatory.\n\nThe trading platform has also gone overboard to ensure that users are profitable in their investment by integrating artificial intelligence (AI) powered tools on the platform. These AI-powered tools, ETF Screener and ETF Tracker, are designed to offer the best accurate recommendations based on market data that they have gathered.\n\nInterestingly, ETFSwap’s (ETFS) beta platform is expected to launch in 30 days. That means now is the perfect time to accumulate the ETFSwap (ETFS) token, especially while it is still selling at a discounted price of $0.01831 in its ongoing presale. ETFSwap’s (ETFS) value is expected to skyrocket once the beta platform launches.\n\nBybit Says Institutional Investors Have Tripled Their ETH Holdings Since Spot Ethereum ETFs Approval\n\nBybit revealed in a recent release that institutional investors have tripled their ETH following the approval of the Spot Ethereum ETFs. A snapshot Bybit took before the Spot ETH ETFs were approved shows that ETH only accounted for 6.54% of these institutional investors’ allocations. However, that figure spiked to 14.29% following the approval of the Spot Ethereum ETFs.\n\nFigure1: Institutional Investor Allocations Before ETH ETF Announcement\n\nInstitutional Investor Allocations Before ETH ETF Announcement. Source: Bybit\n\nFigure2: Institutional Investor Allocations After ETH ETF Announcement\n\nInstitutional Investor Allocations After ETH ETF Announcement. Source: Bybit\n\nAs Bybit noted, this development highlights the growing belief these investors have in ETH’s potential. These institutional investors are also believed to have increased their ETH holdings because of the crypto token’s predicted rally to new highs once the Spot Ethereum ETFs begin trading. ETH is expected to rally to as high as $5,000 once these funds launch.\n\nThese Spot Ethereum ETFs are expected to begin trading by the first week in July based on the latest prediction made by Bloomberg analyst Eric Balchunas. As such, ETH’s road to a new all-time high (ATH) could soon begin.\n\nConclusion Of ETFSwap (ETFS) Also Rallying Alongside ETH\n\nETFSwap (ETFS) will also rally alongside ETH once the Spot Ethereum ETFs begin trading. ETFSwap‘s price surge will be triggered not just by the hype around the Spot Ethereum ETFs but also by the trading volume the crypto token is set to experience, thanks to investors looking to invest in the tokenized fund on the trading platform. Considering this, it is best to accumulate and increase your ETFSwap (ETFS) holdings before the crypto token takes off.\n\nFor more information about the ETFS Crypto Presale:\n\nVisit ETFSwap Presale\n\nJoin The ETFSwap Community\n\nRead Also: Expert Prediction For Crypto In June: Top 3 Altcoins For 50X ROI"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMijgJBVV95cUxPcjVobXVmRGtybm9DWUxwT0FsNWg0T2wxQ09VZmlwUW9Ka2FYbktEX0dMa2xYSmI3cGZoZ3pxV05jN09EYy01YWh3NHc0WTNaaGJnYlpaUGxKTnNmTGpxNW1FbXpzbFY1S1c0SXlzRFZRWGFIOXIxSzZBeENDbFlUaVJ4UUwxclp2YndZdmtqbThieS0xalR0RV85ZWlKOEVPLTR4S2NRdzRvTVVTRWpzc2Zzc0FtUHhqZHpaYmFkdUk0YWJ6dURrRjh2UUIzRlNpbEp3WjJ0RlAtN3BXZlFVYlY0bEZ4djVoalNDbFhkbWVFWldiRE1yN0o5YmU4MU1XaWtGbkVNVzRBS095b1HSAZMCQVVfeXFMTzU2Vi1RbzFuTVZvWFRmci1wcXkxcGhjaVhBVkQ1ZlBsUF9XV0VHVVMtWjB4MmlEcmJQTlZteFZlTnRaYU9NNHNORzgxRHEyamEwTHRsN1hZLVFGUmZUWDcxcWRXVzdCd1pRMkVrV2pzTnNhSThoTnZLeXd3Z0l2cTZ3N3R2cDJPTlRzMWNOc21XLXBiTlEyMXRsYmxyUG5DakZKcWJ5NV9hVVJoQU95cWhVNmxsTllUWThaUHJVb3ZGY29aTC1tcFpMdDlzc1ppQWtOelVfN1NnaXoxRE5Mc25DOGE2QUNsbFBYeWtqVGpIb3VDRGFibDlYY0FVMTY2YUIzTWJLRWx4YkYwNGVDbTBtVnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $60k but down 1.5%. Ethereum, BNB, Solana, Dogecoin, others fall u - The Economic Times",
        "content": "Did you Know?\n\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPQlFlNWRLdjhSaDQ5RloyMExrZlA4MVZhWVpPb09abjYxa2ptOWdEcE9tZG51cmtYSF9vd3BfcURWNTA0LS1FS1RQaDNyOUxVa1pIWHl2MzJ6NktPbkRueTh6RTJIT01KWEx4QjE4VGNFMjQ3ZW5yNElvSFpSU2k5MUhuZzI4ZEVRTUZoNms5M3dWdE1ySnI0eHFlSmxia2VnNGtDY24waEo5Zl9USTRxRGdWenRXM2U4bDI4ekJ4X2prS01PUnVZQXAtVVFYTGvSAdQBQVVfeXFMT2txN3lVcFpuWkw5VFNyYk1ydi1lbTJmV2R5cmZQd1JRZ05HV2NZYm1Iak9HZU5zdkU4QnJlRXpvamlDT2VtUldORmIyX1BscW94NGxaLThIb1BSekYxeWdYdS1fdm5Kb3RvcXNlLXZ0VlZjOHgzejFpRFA4Tm8tbVhoaGNYdEk1MldMcmtNdk03dTBNNjh6YU4zNGdUNUJjYUhOdFRoVU9Vb1h6MmVnYUo2MWI1OHJDNzM1M0FjUG56aHRlOWptTEZmWDhCMHc3elZFZjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC bounces off key support - FXStreet",
        "content": "Bitcoin tested $58,375 support on Monday and currently trades at $61,996 on Wednesday.\n\nEthereum retested the $3,288 support level on Monday and is now near $3,407 on Wednesday.\n\nRipple price faces stiff resistance at $0.500.\n\nBitcoin tested crucial support on Monday, rebounding by 5.8%. Ethereum followed a similar pattern, retesting support on Monday and gaining 4.8% by Wednesday. Ripple trades below its daily resistance level of $0.50 but has shown resilience despite Bitcoin's decline.\n\nBitcoin price looks promising\n\nBitcoin's price broke below the descending wedge on Monday, declining approximately 7.5% from its daily high of $63,369 to a low of $58,402. After retesting its crucial weekly support near $58,375, BTC rebounded by 5.8% from Monday's low of $58,402, closing at $61,806 on Tuesday. BTC trades at around $61,996 at the time of writing, edging up approximately 0.6% on Wednesday.\n\nIf the weekly support at $58,375 holds, Bitcoin could encounter resistance at several key levels.\n\nThe lower boundary of the descending wedge sits around $62,000. The descending wedge's daily resistance and upper boundary hovers near $63,956. The 61.8% Fibonacci retracement level and the weekly resistance are at $66,631 and $67,147, respectively.\n\nA breakthrough above these resistance barriers could propel BTC's price towards retesting the next weekly resistance at $71,280.\n\nThe Relative Strength Index (RSI) is currently below 50 on the daily chart, while the Awesome Oscillator (AO) is below its zero level. For bulls to stage a convincing comeback, both momentum indicators must sustain positions above their respective thresholds of 50 for RSI and zero for AO.\n\nBTC/USDT daily chart\n\nHowever, if BTC closes below the $58,375 level and forms a lower low on the daily time frame, it could indicate that bearish sentiment persists. Such a development may trigger a 3% decline in Bitcoin’s price, revisiting its previous low of $56,552 on May 1.\n\nEthereum price shows resilience\n\nEthereum price retested its support level of $3,288, the 61.8% Fibonacci retracement level drawn from a swing low of $2,862 on May 14 to a swing high point of $3,977 on May 27 on Monday. ETH rebounded by 4.8% from Monday's low of $3,240, closing at $3,394 on Tuesday.\n\nETH trades at around $3,407 at the time of writing, edging up approximately 0.7% on Wednesday.\n\nIf this support at $3,288 holds, ETH price could rally 9% from its current trading level of $3,407 to tag its previous high of $3,717 on June 9.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator in the daily chart are both below the mean level of 50 and zero, respectively. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective levels.\n\nIf ETH closes above $3,717, the high of June 9, it could extend an additional rally of 7% to reach its previous resistance level of $3,977.\n\nETH/USDT daily chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $3,288 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 13% crash to the previous support level of $2,862.\n\nRipple price shows potential for upside\n\nRipple's price currently trades at $0.476, below the daily resistance level of $0.499. Despite Monday's fall in Bitcoin’s price, XRP has shown resilience in its price action.\n\nIf Ripple's price surpasses the barrier at $0.499, it could rise 7% from $0.499 to $0.532, its previous high from June 5.\n\nIn the daily chart, the Relative Strength Index (RSI) is below the 50 mark, indicating neutral to bearish sentiment, while the Awesome Oscillator (AO) remains below zero, suggesting bearish momentum. Both indicators must rise above their critical thresholds of 50 for RSI and zero for AO for a sustained bullish trend. Such a development would bolster the ongoing recovery rally in the market.\n\nIf the XRP daily candlestick closes above $0.532, it could extend an additional 9% rally to $0.581, a 50% price retracement level of $0.419 and $0.744 from March 11 to April 13.\n\nXRP/USDT daily chart\n\nConversely, if Ripple's daily candlestick closes below $0.450, marking the June 7 low, establishing a lower low on the daily chart would invalidate the bullish outlook. This scenario might lead to a 7% decline in XRP's price towards the April 13 low of $0.419."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPeWJGNEhVZ1FjMFlrWXRjSF90dEdIZkJPNXJtVWNCWm43TkJLakREalNIaWphM0VXTkpuYko5WHZRUlgyUFlHaldXa29xYXQwY19PYmVKYlZiQVh2NGRUZVdSbHdyTVY4NWNGTVJPLTdNVGlSOFFoY19LNkhaQzFLR2JTZ09FTU1nRFlTcDRkcU1UY0szRENHTkhfdWw5dS1ZcTFhZEJxVGE4X1A1Ml9TMGxFSFl4di1ZcHROY3RFWHZZdEpaUDNnUVdjWkhRWmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ready To Leverage The Spot Ethereum ETFs FOMO? Experts Say These Crypto Presales Are Your Best Bet - Techpoint Africa",
        "content": "With Gary Gensler, the Chairman of the US Securities and Exchange Commission (SEC), recently hinting that spot Ethereum ETFs could be fully approved by September, the FOMO psychology in the crypto market gets even stronger. Hence, major crypto experts say that ETFSwap (ETFS), WienerAI (WAI), and CYBRO are the best bets for anyone looking to leverage the prevailing spot Ethereum ETFs FOMO.\n\nETFSwap (ETFS): The Crypto Investor’s Perfect Bet\n\nETFSwap (ETFS) is poised to pull in massive liquidity from new ether assets upon the full approval of spot Ethereum ETFs as this ecosystem is the only ERC20 provider of exchange-traded funds (ETFs) assets. ETFSwap (ETFS) utilizes the Ethereum (ETH) blockchain to host high-liquid real-world assets like coal gas, oil, gold, and many more on-chain. Users, especially traditional traders, then get to trade these assets via bountiful leverages up to 100X.\n\nWith ETFSwap (ETFS) launching its beta platform in less than 30 days and spot Ethereum ETFs expecting full approval in September, ETFSwap (ETFS) is tipped to be at the forefront of of a revolutionary Web3 era by establishing the first decentralized protocol that provides direct access to leveraged, fixed-income, cryptocurrency, and commodity ETFs. ETFSwap (ETFS) provides all investors with compounded profit-making strategies as they can stake, swap, and buy multiple ETFs across various markets and also earn up to 87% APR.\n\nMore so, ETFSwap (ETFS) bolsters the chances of its users with its custom ETF screener and tracker, which utilizes AI-powered algorithms to provide accurate big data analysis. Crypto experts then say that now is the time to buy into its ongoing presale, which is still selling at a low $0.01831 price - there most likely won't be a better price to make millions.\n\nWienerAI (WAI) Could Be A Good Investment\n\nMajor crypto experts have also tipped WienerAI (WAI) to be a crypto presale that brings bountiful returns upon launch. WienerAI (WAI) is already gaining massive popularity in the crypto space, and the launch of spot Ethereum ETFs is another major boost to the native WienerAI (WAI) token. WienerAI (WAI) combines innovative intelligence technologies with a unique approach to contemporary issues, making it one of the high-potential crypto presales — just like ETFSwap (ETFS).\n\nWiener (WAI) focuses on developing advanced AI solutions to create technology that can be applied in various fields acrrloss all financial borders. Littler wonder crypto experts say that WienerAI (WAI) could be a good investment for when the spot Ethereum ETFs FOMO pervades the entire crypto space, with its presale alreading raising millions.\n\nCYBRO’s Marketplace Set To Boom\n\nCYBRO is another crypto presale tipped to leverage the spot Ethereum ETFs FOMO with its hold-to-earn marketplace. CYBRO is powering an AI-based yield aggregator platform on the Blast blockchain and it is already gaining massive adoption with its ongoing presale rounds experiencing massive buy ins.\n\nWith CYBRO, non-professional crypto investors get to leverage multiple investment vaults and strategies tailored to their investment preferences. More so, holders of CYBRO tokens will receive spacial rewards including airdrops, APR yields, cashbacks, and lower trading fees. It's no surprise then that the ongoing CYBRO presale is expanding daily with new investors as its investment strategies advance both DeFi and CeFi (centralized finance).\n\nConclusion On The Crypto Presales To Leverage The Spot Ethereum ETFs FOMO\n\nETFSwap (ETFS), CYBRO, and WienerAI (WAI) have emerged as the best bets for leveraging the spot Ethereum ETFs FOMO as their ecosystems are well placed for integrative DeFi and CeFi into high-liquid financial investment hubs.\n\nThe ETFS presale is still underway at just $0.01836, and major crypto experts are saying that all crypto investors should not miss this massive opportunity as the ETFSwap (ETFS) ecosystem is the best placed to leverage the spot Ethereum ETFs FOMO.\n\nFor more information about the ETFS Presale:\n\nVisit ETFSwap Presale\n\nJoin The ETFSwap Community"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQOHZjRFd4RTlieGwwd3htYjAyS2VxeTBTRWtJX25uWU8xZHNLeGlGRW93eFVlaGFuWmQzZWVrSUNrektyb3NQZWZGbF9JY1hOYktDLVE2SjhNT3NVVGJKZGRVLWpwOHJ4X0ZZLU5fNlp4dFA2VmUtVDNPaFdpWVAybGwtWmdzcGlTQk5F0gGQAUFVX3lxTE8yVWlYSlpjSXN0TlVsUHVyMDBYWTJmOGkzOXBrVEdLdnNaVkE4enZnVE5CZ29rZjRRMnd4NkRES1ZILTdEdF9CNHlFRm9UMmhaa2V1c0lfZjVmajNVa0kwck5mdmV5LW1GUXZtSTFqZ3ZVQkh1NGhZSlpyRmlUUnlmWHlsaW1FVHdxcGRwb1JLYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ethereum faces inflationary pressure: Will ETF approvals help? - AMBCrypto News",
        "content": "Ethereum has seen an increased inflationary trend recently.\n\nETH was trading at around $3,300 as of this writing.\n\nEthereum [ETH], previously recognized for its deflationary trend, has shifted towards a more inflationary pattern in recent months.\n\nWhile the mechanism to burn ETH—part of its transaction fee model introduced in EIP-1559—has continued, the overall supply of Ethereum has still increased.\n\nThe hope among investors and market observers is that demand for ETH will increase with the finalization of approvals for exchange-traded funds (ETFs).\n\nEthereum becomes more inflationary\n\nThe inflationary trend in Ethereum’s supply has reportedly reached its highest level since 2022, particularly following its recent network upgrade in March.\n\nAccording to data from Ultrasound Money, the total supply of ETH has expanded by over 112,000 ETH in the past four months.\n\nThis increase in supply is largely attributed to the effects of the upgrade, which took place on 13th March.\n\nThe upgrade, part of ETH’s ongoing development and improvement protocol, has had a significant impact on the network’s economic model.\n\nEthereum not easing up on burns\n\nDespite the recent inflationary trends observed in Ethereum’s supply due to the upgrade, the overall balance since the implementation of the Merge remains deflationary.\n\nAccording to Ultrasound Money, over 1.7 million ETH have been burned due to transaction fees, while the total new supply added since the Merge is over 1.3 million ETH. This results in a net reduction of over 344,000 ETH being removed from circulation.\n\nThe ability of this mechanism to outweigh the supply increase from the upgrade maintained ETH’s appeal as a deflationary asset.\n\nSuch dynamics are crucial for its long-term valuation, as the reduction in supply, assuming steady or increasing demand, can lead to an appreciation in ETH’s market price and make it an attractive hold for investors.\n\nEthereum ETFs imminent\n\nThe prospects for the launch of an Ethereum ETF appear more promising, as highlighted by Bloomberg ETF analyst Eric Balchunas.\n\nHe noted that VanEck, a significant player in the ETF market, has taken a crucial step by filing an 8-A form for their Ethereum Trust on 26th June.\n\nThis form is essential for corporations looking to issue securities on national exchanges, signaling a readiness to proceed with the ETF.\n\nEric Balchunas pointed out the strategic timing of this filing, drawing a parallel to VanEck’s previous actions with their Bitcoin spot ETF, which was filed exactly seven days before its launch on 11th January.\n\nThis pattern suggests that the ETH ETF might be following a similar timeline, potentially indicating an imminent launch.\n\nHow it could impact ETH\n\nThe introduction of Ethereum ETFs could significantly impact the market dynamics for ETH.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nBy facilitating broader and more regulated access to ETH for institutional and retail investors, these ETFs could increase demand for ETH.\n\nThis heightened demand, coupled with Ethereum’s existing deflationary mechanisms, could absorb excess supply and enhance Ethereum’s deflationary trajectory."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPNEJsS0oxbXV2d01SV29IazB3OHdrNXFyU2Y2ME9EZVJ3Rm9idmlFemhUMHpmek9QQkN1eExUaXMzTTV5c2NfYThnRmJCaWlqa0hCNHo5RDd4SjUzalZOUWxueThEa003eUNManRZc0tNZ1c4X0VYS2c5V3pSSXBtVmRoSUtXblh5RjVVa1E1SDFKcTZZR1B3YTA0MlJzMktVRXFZQXprNFUwR0dXRHcwVEp5aHl6UTZUR3pXOHJYZHdoZVJiX1QxYk50UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Crypto Expert Predicts ETH at $6K by September - Top Presales to Pump with it - Techpoint Africa",
        "content": "Crypto market charts largely don't look good at the moment.\n\nAll major projects are trading in red, with Bitcoin leading the charge. The main currency plummeted from $73K level to the $61K where it currently stands in just two weeks.\n\nThis is a 7% drop in the last week alone.\n\nRest of the big names aren’t doing much better… XRP is down by 5%, BNB 3%, Avalanche by 4%.\n\nEthereum on the other hand is sustaining the dip with a small green candle, but green nonetheless.\n\nIn fact, one analyst, degenttrading (@degentradingLSD) gave a very bullish prediction for ETH.\n\nLet’s take a look at what he had to say, and check out some smaller crypto presales that crypto influencers believe can ride the ETH’s bullish wave.\n\nCan We See ETH at $6,000 By September? Degen Trading Seems to Think So\n\nEthereum (ETH) has been at the centre of many bullish predictions, with some analysts projecting its price could hit $6,000 by September.\n\nOne prominent voice, Degen Trading, outlines several compelling reasons for this optimistic outlook.\n\nDegen Trading highlights the significant increase in CME open interest (OI) from pre-ETF days to now, noting a rise of around $5 billion. This surge suggests that the introduction of Ethereum ETFs could ease trading constraints and unlock a substantial influx of capital into the market.\n\nHowever, Degen Trading also points out the challenges posed by the lack of prime brokers like Genesis, which complicates spot borrowing as a hedge against CME futures longs.\n\nContrasting Ethereum with Bitcoin, Degen Trading argues that Ethereum’s ceiling is higher due to its position as a decentralized global settlement layer or \"world computer,\" compared to Bitcoin's branding as digital gold.\n\nThis sentiment is echoed by traditional finance professionals who show more enthusiasm for Ethereum and Solana over Bitcoin.\n\nThe expected conversion of Grayscale’s Ethereum Trust (ETHE) into an ETF is also seen as a positive development, likely facing less selling pressure than its Bitcoin counterpart due to a smaller lender overhang.\n\nA critical aspect of Degen Trading's analysis is Ethereum's relative illiquidity compared to Bitcoin.\n\nWith Ethereum's liquidity being only about 10% of Bitcoin’s, an influx of $3-4 billion could significantly impact ETH’s price, potentially pushing it towards the $6,000 mark.\n\nAdditionally, the current bearish sentiment on Crypto Twitter is viewed as an ideal technical setup for a bullish reversal as the Ethereum ETF launch approaches.\n\nThese factors combined present a strong case for Ethereum’s potential to reach $6,000 by September.\n\nHowever, this growth would only amount to a bit less than 2X from ETH’s current price point, so we wanted to highlight some project that can provide much bigger profits, in the 10X to 100X range.\n\nCrypto Presales That Can Provide Bigger Gains than ETH – Quick Overview\n\nBefore we make a detailed analysis, let’s check out the basics of these presales that can provide bigger profits than Ethereum in 2024:\n\nCrypto Presales That Can Provide Bigger Gains than ETH – Detailed Analysis\n\nNow we can take a look at these presales in more detail:\n\nPepe Unchained ($PEPU) – A Next-Level Meme Coin with Layer 2 Tech\n\nPepe Unchained ($PEPU), a recent entrant in the presale market, has quickly garnered over $600,000 in funding since its launch late last week.\n\nUnlike many copycat tokens that follow the success of popular coins like Pepe Coin (PEPE), Pepe Unchained aims to elevate the concept to new heights.\n\nOne of the standout features of Pepe Unchained is its upcoming launch of a proprietary layer-2 network.\n\nThis development promises enhanced speed, security, and lower transaction fees, making it a robust platform for both transactions and meme culture.\n\nThe introduction of double staking rewards further enhances its appeal, offering investors an opportunity for substantial returns once the token lists on exchanges.\n\nPepe Unchained is positioned not just as another meme coin but as an improved version of its predecessor, integrating advanced technology and rewarding mechanisms that could drive significant growth and investor interest.\n\nDOUBLE YOUR REWARDS WITH PEPE UNCHAINED STAKING!\n\nPlayDoge ($PLAY) – Combining Nostalgia and Blockchain in a Unique Play-to-Earn Experience\n\nPlayDoge ($PLAY) brings a fresh twist to mobile play-to-earn (P2E) gaming by merging the charm of Tamagotchi with cutting-edge blockchain technology. In this game, players take on the role of caregivers for their virtual Doge pets, engaging in activities like feeding, training, and playing. These interactions reward players with $PLAY tokens, creating a fun and profitable experience.\n\nThe game leverages nostalgic 8-bit graphics, reminiscent of classic video games, to attract and engage users. The combination of meme culture and interactive gameplay provides a unique and captivating experience in the crypto gaming sector.\n\nThe $PLAY token, based on the BNB Smart Chain, is integral to the PlayDoge ecosystem. It facilitates various in-game transactions and unlocks special features, enhancing the overall user experience. The tokenomics of PlayDoge are well-structured, with a total supply of 9.4 billion tokens. Distribution includes 50% for the presale, 11.5% for liquidity, and 7.5% for community rewards, among other allocations.\n\nThe presale phase has shown remarkable success, amassing over $4.6 million shortly after launch. This strong start underscores the high interest and trust within its vibrant community.\n\nPlayDoge ($PLAY) stands out as a dynamic and innovative project that combines nostalgic elements, advanced blockchain tech, and strong community involvement.\n\nFor those interested in crypto investments within the gaming sector, PlayDoge offers a compelling opportunity with its unique approach and promising early performance.\n\nJOIN THE PLAYDOGE REVOLUTION! ADOPT YOUR VIRTUAL DOGE PET AND EARN REWARDS TODAY!\n\nWiener AI ($WAI) – Innovating Meme Coins with Advanced AI Trading\n\nWienerAI brings a fresh perspective to the world of meme coins, drawing inspiration from dog-themed projects like Myro, Bonk, Dogecoin, and Shiba Inu.\n\nWhile it shares the playful essence of meme coins, WienerAI sets itself apart with its advanced AI trading bot, designed to enhance trading efficiency and provide MEV-resistant trade execution, offering users a competitive edge in the crypto market.\n\nThe token's presale is strategically divided into multiple stages, each with increasing token prices. This structure incentivizes early investment, allowing initial backers to acquire tokens at a lower cost.\n\nAdditionally, early investors benefit from generous staking rewards and community airdrops, making WienerAI an attractive addition to any crypto portfolio.\n\nWith 30% of the total token supply available during the presale, there's ample opportunity for investors to get in early and maximise their potential returns.\n\nThe $WAI presale has generated significant interest since its launch, raising $6,2 million within a few weeks. This rapid success reflects the strong market confidence in WienerAI's unique blend of meme culture and cutting-edge AI trading technology.\n\nIf you’re looking to diversify their crypto portfolio with a project that offers both entertainment and advanced technology, WienerAI could be your safest choice.\n\nBy joining early, you can take advantage of cheap token price and substantial staking rewards, becoming part of a forward-thinking community poised to make a significant impact in the crypto world.\n\nBUY $WAI TOKENS TODAY AND ENJOY ADVANCED AI TRADING BENEFITS!\n\nBase Dawgz ($DAWGZ) – A Meme Coin for the Bold Investors\n\nIn our quest for promising projects, Base Dawgz ($DAWGZ) stands out with its daring approach.\n\nThis adventurous meme coin has chosen to launch on the innovative Base network, while also embracing a multi-chain strategy.\n\nBesides Base, $DAWGZ will be available on Ethereum (ETH), Solana (SOL), Binance Smart Chain (BSC), and Avalanche (AVAX), positioning itself perfectly to capitalise on Ethereum’s bullish projections\n\nThe presale for Base Dawgz has seen great success, raising over $2 million in just three weeks\n\nThis strong start reflects the growing interest from investors who are eager to benefit from the project's innovative share-to-earn system.\n\nBy sharing memes and other content on social media, investors can earn points redeemable for rewards. Additionally, those who use referral links from the presale site will earn a 5% bonus once the coin launches.\n\nBase Dawgz combines an engaging concept with practical utility, appealing to a broad audience of crypto enthusiasts.\n\nIts multi-chain functionality and robust presale performance highlight its potential in the dynamic world of meme coins.\n\nJOIN BASE DAWGZ AND CAPITALISE ON THE BASE MEME COIN MANIA!\n\n99 Bitcoins ($99BTC) – A Revolutionary Learn-to-Earn Token\n\nNavigating the intricate world of cryptocurrencies can be challenging, but 99Bitcoins aims to make it both educational and profitable with its new initiative, $99BTC.\n\nThis learn-to-earn token redefines traditional learning by incentivizing users to engage actively with crypto education.\n\nHere's how it works: instead of merely consuming information, users participate in educational content, quizzes, and community activities related to cryptocurrency.\n\nBy doing so, they earn $99BTC tokens, making the acquisition of crypto knowledge rewarding both intellectually and financially.\n\nInitially launched as an ERC-20 token on the Ethereum blockchain, $99BTC plans to transition to the BRC-20 standard, native to Bitcoin's blockchain. With a total supply of 99 billion tokens, the project has already raised $2,2 million in its presale, pricing each token at $0.00111.\n\nThe tokenomics are designed to encourage long-term engagement, with 14% of the supply allocated for staking rewards and 17% set aside for community rewards, ensuring active contributors are well-compensated.\n\n99Bitcoins' ambitious roadmap includes listing $99BTC on decentralised exchanges (DEXs) and launching the beta version of its learn-to-earn platform by the end of the year.\n\nThe project's strength lies in 99Bitcoins' established reputation and the dual benefits of learning and earning offered by $99BTC. This token has the potential to bridge the gap between education and financial empowerment in the digital asset space.\n\nBy combining educational engagement with financial incentives, $99BTC could transform how people learn about and interact with cryptocurrencies, making it an exciting addition to the crypto ecosystem.\n\nINVEST IN 99 BITCOINS AND TRANSFORM YOUR CRYPTO KNOWLEDGE INTO PROFITS!\n\nConclusion\n\nAs Ethereum aims for a potential surge to $6,000 by September, it's crucial to keep an eye on emerging projects that could offer even more substantial gains.\n\nProjects like Pepe Unchained, PlayDoge, Wiener AI, Base Dawgz, and 99 Bitcoins are creating significant buzz with their unique value propositions and innovative approaches in the crypto space.\n\nThese presales present an exciting opportunity for investors to diversify their portfolios and capitalise on the growth potential of these next-generation meme coins and utility tokens."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNQUdGNW5iNkxGZkFqZHhlVWpiN3pzWC1oN0V6T3BxdzZSMGE1cGRLWlNLdTNhX05sUGIzTlo2bEp1T3dCMHJ1M0EwM0toYnFCblBUUkNWSDJHeUNGdW81TWlpYTVRVy1la2ZHVWVmSURjLTFmUFBhZXFNOTFhN2tlT0F4Z1VoQVVwdS04V0lYbnZfZzFPY2ZnUEZVQWd2d9IBowFBVV95cUxQdkVCWXJYSFhYRzBLYTNKZ0RXamNQbzdQb2NqMVFMemlDdzdIVUJQT0R5VlVkSzh4UTg0U2RWZjJLVTNRV2I4U1hYOHVqX1J5ZUEyXzF5OE91WnZ2LUlJZk80c2JId2ZIRHRXT0ZHaS1kSV9zSnJrdUY1OEVVZGYxSGNDRmtxSzV4YmdSZENwbzd2SVJvQTRCRzlwZGF1eXd3OG9Z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "VanEck Declares Zero Fee for Spot Ethereum ETF Gearing Up for July 2 Launch - CoinGape",
        "content": "Soon after VanEck filed Form-8A for its spot Ethereum ETF on Tuesday, June 25, another filing suggested that it would completely waive the ETF fees for an unspecified time till 2025, or until the assets hit $1.5 billion, whichever comes earlier. With analysts expecting July 2 as the launch date for the Ethereum ETFs, issuers like VanEck are already raising the competition bar.\n\nVanEck Eyes Leadership for Spot Ethereum ETFs\n\nIn a recent email to ETF publication, Matthew Sigel, head of digital assets at VanEck outlined the firm’s strategic approach to crypto ETFs. He said that VanEck “aims to be a leader on crypto ETF fees even if it means we lose money at the outset.”\n\nadvertisement\n\nHe further added that the plan is “to make it up on volume; in this case, decentralized finance volume”. Sigel said that if the Ether ETFs manage to spark a renewed interest in Ethereum, it would boost the network activity, ultimately driving the Ethereum price higher.\n\nAlso Read: ETH Price Reversal Soon As Ethereum ETF Coming In Two Weeks\n\nAdditionally, Sigel stated that VanEck is also exploring investments in Ethereum-based DeFi projects such as Aave and Curve, highlighting the firm’s greater interest in the decentralized finance (DeFi) sector.\n\nVanEck Triggers A Fee War\n\nCurrently, VanEck and Franklin Templeton are the only prospective issuers who have declared the fees for the Ether ETFs. Previously, Franklin stated that it would charge a 0.19% fee for its spot Ethereum ETF.\n\nBloomberg Intelligence ETF analyst Eric Balchunas said that issuers usually don’t disclose their fee structure until the very last of the launch period. Moreover, he said that firms are awaiting BlackRock’s call before making a move.\n\n“What BlackRock is going to charge is prob the single most imp missing variable outside of exact launch date. Their fee is the sun that the rest will need to orbit around. Must be nice,” he said.\n\nThe removal of the Ethereum staking feature from the spot Ethereum ETFs would be a crucial factor in deciding on the ETF fees. With direct investments in Ether, investors can earn an additional 3% yield by staking their ETH. Thus, ETF issuers will have to go the extra mile to attract investors to invest in Ethereum ETFs.\n\nIn a major update, SEC Chair Gary Gensler said that the progress on spot Ethereum ETFs is very smooth for the moment.\n\nAlso Read: Spot Bitcoin ETFs Vs. Spot Ethereum ETFs: Which Is The Better Buy?\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNdll1ci1WWnFOTm1sd0wzQThPNkNiOVBZQmJ4NGtyZkphTm1JUmtkMGZaVW5BYktheTlLcmdjcmF1cDNkd1RCeXFUQU5RZXZUeTNrX3E5eUJmNm02RjdOVEIxeUhlamJ0V1dRZW1KcE1weHVhaVo5UTZwdFVtYXk5bDhZcFROdkJpRG9Ka1VxM2pLLUly0gGaAUFVX3lxTE8xX2hoUGU3Y3h0YUhoODFCWjdLQzZXZ0c2Qy1ZbjhiVHcxazlqRDk3bWVycktsZ1czUVdOLWh0NHdWdFZCT3d0UkgyaXd6OGtBektOcTJrSkl6V3ZsbkN5VkprXzhiYVc1TXFITUVOamtzR2ozakFiSGtMalhBdEZSeVZJdjMwQUpiVUNDbHBleFF4Qk1DbzVPX0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ethereum bulls have a tough battle ahead: Will these key levels help? - AMBCrypto News",
        "content": "Data of holders in/out of the money provided valuable insights into where Ethereum could halt its downtrend.\n\nTwo network metrics showed increased selling pressure behind ETH in recent weeks that has not yet let up.\n\nEthereum [ETH] bulls were in a pickle after failing to defend the $3.6k demand zone earlier this month.\n\nThe $3600-$3650 region had served as resistance back in March and the first half of April but was breached and flipped to support in late May.\n\nThe Ethereum ETF hype was building for July, but with Bitcoin [BTC] set to face selling pressure from miners and Mt. Gox and a general lack of demand, ETH bulls might have an uphill battle ahead.\n\nA price drop toward the next support zone is anticipated- but where will the correction likely halt?\n\nMajor support and resistance zones\n\nAMBCrypto observed that the in/out of money around the price data from IntoTheBlock showed a large amount of ETH was bought in the $2970-$3171 zone, amounting to 2.28 million Ethereum.\n\nAs the price approaches this level, the amount of holders at the money would increase, which means this region would be hard to break down.\n\nSimilarly, any price bounce would struggle to climb above $3.5k, since many of the holders would be near breakeven at that price and would look to sell due to the fearful conditions.\n\nTherefore, in the coming weeks, the $3.1k and $3.5k levels are the ones to watch out for.\n\nActive address count reflects positively on network health\n\nThe daily active addresses have trended upward in June even though prices have fallen lower. Rising active addresses is a good sign for network usage. But the other metrics were bearishly biased.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThe mean coin age has dramatically trended downward over the past month. This showed token movement across the network and distribution. The MVRV ratio also fell below zero to highlight holders at a loss.\n\nTogether, they were a strong sign of further bearishness. The MCA has to begin trending higher to hint at price recovery."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxPNHpmRVM3WHVUaW5pZkRVcDBMZktTang4bURkSm9EV0w1cXZtbDRDLWI4bkQ3eU9RcG5Xb3hHM3ltZldoUG9sbnhBdi11RUd6QklyRFIxUC1sSlJvQ3B4UFdSN05wd3g4N0VMcThpRm1BbHdkZVNOYVd0REJDcmZPVDl1Nzk1UlhSUVMxNGctVkE2a0dBNTlfQmpVS3JjRXA4VUhhb1dka3hFcUJ6Tk9aM1dmUlpHd0JTTmxIX3l3VTVPaTgwOGhYTWR5UjM3VWw1MXFEVDNGZ1hrR0hobWd2NkdhMjRLdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Crypto ETF Trading Platform ETFSwap (ETFS) Announces Support For Bitcoin, Ethereum, And Dogecoin - Markets Insider",
        "content": "ETFSwap (ETFS), a crypto ETF trading platform, has officially announced its support for Bitcoin (BTC), Ethereum (ETH) and Dogecoin (DOGE).\n\n—\n\nIn a major development in the market, ETFSwap (ETFS), a crypto ETF trading platform, has officially announced its support for Bitcoin (BTC), Ethereum (ETH) and Dogecoin (DOGE). This platform has expanded its support for these leading digital currencies to ensure users can swap their cryptocurrencies for tokenized institutional ETFs.\n\nCrypto ETF Platform ETFSwap (ETFS) Declares Support For Bitcoin, Ethereum And Dogecoin\n\nETFSwap (ETFS) has extended its support for some of the world’s most popular cryptocurrencies. This innovative crypto ETF trading platform has added Bitcoin (BTC) and Ethereum (ETH), the two largest cryptocurrencies and Dogecoin (DOGE), the largest meme coin by market capitalization, to its extensive portfolio of cryptocurrencies.\n\nAs a decentralized exchange, ETFSwap (ETFS) allows users to swap cryptocurrencies in place of tokenized institutional ETFs. By supporting Bitcoin (BTC), Ethereum (ETH), and Dogecoin (DOGE), investors can now swap their cryptocurrencies in fully DeFi mode, exchanging digital assets for valuable ETFs that provide access to a range of commodities.\n\nETFSwap (ETFS) crypto ETF trading operations are anchored to blockchain technology, ensuring that users can execute trades efficiently and initiate transactions safely. This platform integrates state-of-the-art Artificial Intelligence (AI) powered ETF trackers and screeners to help users streamline their trading processes, providing the most accurate ETF recommendations based on historical data and sophisticated analytical algorithms.\n\nTo ensure user security and privacy, ETFSwap (ETFS) has integrated robust security measures to protect users' assets and secure their trading accounts. This platform is designed to safeguard users against potential cyber-attacks, having undergone an audit by leading cybersecurity and blockchain audit firm CyberScope.\n\nETFSwap (ETFS) is evolving past traditional ETF trading, acting as a bridge to both the Decentralized Finance (DeFi) sector and the Traditional Finance (TradFi) landscape. This platform empowers traders with a wide range of intuitive traditional and crypto ETF trading solutions and cutting-edge features. This includes borderless and permissionless trading, access to advanced customizable trading strategies and freedom to close and open positions during trades.\n\nTaking Crypto ETF Global Expansion To New Levels\n\nThe ETFSwap (ETFS) ecosystem is expanding at a rapid pace, continuously increasing its offerings to include digital assets which cater to the needs of its growing user base. By expanding its offerings to include Bitcoin (BTC), Ethereum (ETH), Dogecoin (DOGE), it effectively attracts investors within these communities to its platform.\n\nWith the imminent launch of its native token, ETFS, users will be able to join ETFSwap’s robust community of investors and users. This platform has already attracted more than 10,000 new users, granting them access to tokenized assets backed by valuable real-world securities.\n\nAs the demand for ETFs grows in the market, the platform is poised to witness more growth and adoption from institutional investors. Numerous investors are already flooding into ETFSwap's ongoing presale to purchase ETFS tokens and secure their positions in preparation for the platform’s revolutionary growth.\n\nMoreover, ETFSwap (ETFS) has revealed intentions to launch its own ETF in 2025, offering investors more opportunities to diversify their holdings to generate substantial gains. This platform is set to capitalize on the multi-billion dollar ETF market, taking advantage of the growing demand and inflows into Spot Bitcoin ETFs and Ethereum Spot ETFs to propel its native token to new levels.\n\nInvestors are currently buying ETFS tokens at a highly discounted price of $0.01831. The tokens are selling out fast in its ongoing presale stage, as investors are accumulating hard in preparation for a surge to $0.03846 in the next presale phase.\n\nMore than 250 million ETFS tokens have already been sold, underscoring investor’s interest and heightened demand for the cryptocurrency. With the launch of a Solana and XRP ETF, the ETFS token is poised to soar even higher, as analysts predict a 108X price increase in this bullish cycle.\n\nConclusion On ETFSwap’s Support For Bitcoin, Ethereum, And Dogecoin\n\nETFSwap’s new support for Bitcoin (BTC), Ethereum (ETH) and Dogecoin (DOGE) is a significant milestone that will pave the way for crypto ETF adoption and future development. By allowing users to swap cryptocurrencies for tokenized ETFs, ETFSwap (ETFS) democratizes access to institutional ETFs through its innovative platform. Its token presale is set to end soon. Hence, investors are urged to buy ETFS fast to generate maximum returns.\n\nFor more information about the ETFS Presale:\n\nVisit ETFSwap Presale\n\nJoin The ETFSwap Community\n\nContact Info:\n\nName: Alan hawks\n\nEmail: Send Email\n\nOrganization: ETFSwap\n\nWebsite: https://etfswap.io\n\n\n\nDisclaimer:\n\n\n\nThis press release is for informational purposes only. Information verification has been done to the best of our ability. Still, due to the speculative nature of the blockchain (cryptocurrency, NFT, mining, etc.) sector as a whole, complete accuracy cannot always be guaranteed.\n\n\n\nYou are advised to conduct your own research and exercise caution. Investments in these fields are inherently risky and should be approached with due diligence.\n\nRelease ID: 89133831\n\nShould there be any problems, inaccuracies, or doubts arising from the content provided in this press release that require attention or if a press release needs to be taken down, we urge you to notify us immediately by contacting error@releasecontact.com (it is important to note that this email is the authorized channel for such matters, sending multiple emails to multiple addresses does not necessarily help expedite your request). Our efficient team will promptly address your concerns within 8 hours, taking necessary steps to rectify identified issues or assist with the removal process. Providing accurate and dependable information is central to our commitment."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOOE5ucWQyaWE1STFXWFZxdkE0bnFZOUptam5yOXFVaWJEREFuZ1Myd0h4SzY4cFczd3o2R0N4ZDJyamNLVEZiWWNyenQyVzVwZXFUemlFbkc1SWZaZXNIb0o1MzFYMm0xMnZ1eWVzdkhWRlVHYmNkV2g5ang5S0JGbDlJVWQyOHFINjRHaDQzWVNjei0zT1lhV1ZUZVhXa01VcTZCWDhfaEVZTVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Analysts Forecast $15 Billion in Net Inflows to Ethereum ETFs by 2025 - Crypto News Australia",
        "content": "US spot Ethereum ETFs are anticipated to start trading on July 2, following a VanEck filing.\n\nBitwise CIO Matt Hougan projects US$15 billion in net inflows to Ethereum ETPs within the first 18 months.\n\nAnalysts predict the ETF launch will boost Ether’s short-term price, with investor focus shifting from Bitcoin to Ether.\n\nSpot Ethereum exchange-traded funds (ETFs) are expected to launch soon in the United States. Bloomberg analysts have chalked in July 2 for a trading start, which is seven days after a VanEck filing concerning these funds.\n\nInterestingly, with the Spot BTC ETFs we saw trading commence exactly seven days after a VanEck filing.\n\nRelated: VanEck Files for Ethereum ETF, Could Start Trading Next Week\n\nBut what impact might these funds have on ETH? A significant one, according to Bitwise Chief Investment Officer (CIO) Matt Hougan.\n\nAdvertisement\n\nCIO Optimistic About ETF Inflows\n\nIn a post on platform X, the CIO said he believes the money coming into these funds over the following months will be substantial.\n\nEthereum ETPs will attract $15 billion in net flows in their first 18 months on the market. Matt Hougan Matt Hougan\n\nHougan expects investor allocations to BTC and ETH exchange-traded products (ETPs) to align with their market caps: BTC holds 74% of the market at US$1,266bn (AU$1,905bn), while ETH comprises 26% at US$432bn (AU$650bn).\n\n3/ U.S. investors have $56 billion invested in spot Bitcoin ETPs. I suspect this will reach $100 billion by the end of 2025, as these ETFs mature and are approved on platforms like Morgan Stanley. By this logic, spot Ethereum ETPs will need $35 billion in AUM to reach parity. — Matt Hougan (@Matt_Hougan) June 26, 2024\n\nBesides considering factors like market cap comparisons between BTC and ETH, Hougan thinks investment in Bitcoin ETPs, and the structure of international crypto ETP markets will drive adoption.\n\nHis projection is based on the current investment distribution, expected growth in Bitcoin ETPs, and the conversion of Grayscale’s Ethereum Trust. Hougan adjusts his estimates considering the absence of a staking-related “carry trade” in Ethereum, similar to what exists for Bitcoin, leading to a conservative inflow estimate for Ethereum ETPs.\n\nI don’t expect the flows to come in a straight line. In fact, I think there is a good chance we see net outflows from the ETH ETP complex at points after their initial launch, as traders who played the discount-arbitrage game aggressively redeem out of ETHE. Matt Hougan Matt Hougan\n\nETF Launch to Drive Short-Term ETH Price: Analysts\n\nMeanwhile, analysts at crypto exchange BloFin believe that the ETF launch will have severe short-term ramifications for the price of Ether as investors shift their focus from Bitcoin to ETH. In a note shared with CryptoSlate, citing “options skewness, portfolio adjustments, and whale holdings”, the analysts said ETH is expected to see price increases.\n\nThe relative strength of BTC has lasted for several months, but investors are changing their views: they seem to believe that the performance of ETH will strengthen for some time with the listing of the spot ETH ETFs. BloFin BloFin\n\nRelated: Over Half of Japanese Investment Managers to Adopt Cryptocurrencies, Survey Reveals\n\nBloFin’s analysis reveals a recent shift in investor sentiment, now favouring Ethereum over Bitcoin in the short term, driven by Ethereum’s potential for higher returns in a lower interest rate environment and the expected approval of these spot Ethereum ETFs.\n\nAdditionally, on-chain data indicates that ETH whales are holding onto their assets, further boosting Ethereum’s bullish outlook relative to Bitcoin.\n\nGet the most important crypto news delivered to your inbox by subscribing to the CNA newsletter"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMimAJBVV95cUxONkJZbWszeW5YRkRqZTZiVnpHNWJVUmhYYWgweHBXQ3ZkcTR5eXJVZHc3a20tci1Nby1jcFFXNVhRMFp5elRyTV9XcGNuRk5kS0RVSXdXdktJallCNWFCeDJaRVVEWEl3VVM2M0M3RFFxMWZZay1ZOW0yeTVVcFZ5QUVfY3Vjc1F0R3RuTmUtdi15OEVTdjBkYW56bGstUC0wQjg5OWpqMW9DeTRNcXFIRFJ2OUV4ZmZReDh4R3Y4Ni1SM2VEVU8zSklZZEwwNlJseUpiNG5Ub0x6Sm5QLW5qWEV6MUk0UnBTam0yZEg4bFJSQ1lwcWRjVmszRmwtWmZ0Z0lUT2FoODJJekdvakRWY2hYWE96dGhw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Who Knew The SEC Closing The Ethereum Investigation Would Be Bearish For ETH and Altcoins; Here Is A Crypto Gem To Make It All Back With - The Portugal News",
        "content": "The recent closure of the investigation initiated by the SEC had a major unexpected drawback on Ethereum (ETH) and several other altcoins including Solana (SOL), Cardano, and Polygon.\n\nBy Advertiser, in Crypto · 27 Jun 2024, 09:31 · 0 Comments\n\nMany analysts and traders expecting a bullish outcome based on the data results were shocked as these altcoins trended downwards, with investors leaving to find more stable investments. Despite these negative trends, a top DeFi token, Rollblock (RBLK), has emerged to help investors regain their losses in the crypto market.\n\n\n\n\n\nThe Impact of The SEC Investigation On Ethereum (ETH)\n\n\n\n\n\nOn June 20, 2024, after the SEC closed its investigations, Ethereum (ETH) saw a brief uptick in price to $3,608.25. However, to the dismay of investors, this wasn’t a lasting growth as the price immediately fell to $3,502 and has since trended downwards, now sitting at $3,403.\n\nThis Ethereum price drop led to greater market instability, with cryptocurrencies like Bitcoin Cash (BCH) and Ethereum Classic (ETC) also trending downward. Investors looking for the best altcoins to invest in are now more cautious about their investment and seek promising investments that don’t display heightened volatility.\n\nThis market reaction to the SEC update underscores the importance of having stable cryptocurrencies with high growth potential in every investor’s portfolio. It also shows how major assets like Ethereum can upset the balance of the entire market. With innovative tokens connected to high-growth industries, investors can experience stable portfolio growth unaffected by changes in major coins like Bitcoin (BTC) and Ethereum.\n\n\n\n\n\nRollblock ($RBLK) Stands Out As a Potential Henge Against Crypto Volatility\n\n\n\n\n\nRollblock (RBLK) is a new protocol that aims to disrupt both the GambleFi and casino industry. This project, built on Ethereum, has a live casino and allows $RBLK token holders to receive a percentage of revenues generated by its casino, which will result in a steady increase in investor profits as the platform grows. To guarantee a growing crypto platform, Rollblock has designed several initiatives capitalizing on the $540.3 billion gambling industry.\n\nThe traditional online gaming industry has struggled with transparency and trust when placing bets. With no desire to risk their funds on rigged games, many players now refuse to place bets, negatively impacting the industry's growth. Rollblock provides a solution to this by using blockchain technology to secure all transactions. All users are guaranteed a secure bet, and bets can’t be changed once placed.\n\nWhile playing games, Rollblock will reward users with the $RBLK tokens which they can then use to play more games, win, and grow their funds. The platform has seen a huge influx of users, 100s daily, in just two months due to its easy-to-access system, requiring no KYC from gamers before accessing hundreds of games on the platform. Users only need to open an account with an email or crypto wallet, deposit from a selection of over 20 cryptocurrencies, and start playing different games with instant wins and payouts. This has accounted to Rollblock currently having 3000+ registered users already.\n\nAs the platform grows, Rollblocks price is expected to soar a massive 720%. This is huge for investors, who can not only profit from price increases, but also Rollblocks revenue share model.\n\nUp to 30% of the casino revenue will be used to buy back the RBLK tokens from the open market. 50% of purchased tokens will be allocated for rewards, and 50% will be burned to increase token value.\n\nIn addition to the Rollblock revenue share model, players on the platform can also stake their $RBLK to earn more rewards and bonuses. Any $RBLK earned can be converted into other cryptocurrencies or fiat at low transaction fees and fast processing times.\n\nInvestors struggling to find the best token to invest in and those looking to regain the money they’ve lost from Ethereum (ETH) and other altcoins have a huge opportunity with the Rollblock ($RBLK) presale. Currently in stage 3 of the presale with a price of $0.014, analysts have already predicted that Rollblock could see an 800% rise in the next few weeks before the presale is over. Investors who get in early enough could not only enjoy these profits, but could see an additional 100x rally once RBLK is listed on major exchanges.\n\n\n\n\n\nDiscover the Exciting Opportunities of the Rollblock (RBLK) Presale Today!\n\nWebsite: https://presale.rollblock.io/\n\n\n\nSocials: https://linktr.ee/rollblockcasino\n\n\n\n"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPYWhVLS1jcVBhSi12N0JfeUk5TDdIQ2hfTVRqZnE2OGxWZjNqRlhlU2FUNTEwbjltYzFLQ2xuTGhHeXRiVzRROWZDNVhDZVUtUXVzNENWbDQ1c294dlF1YlhrSklVb0NkRWowVW5oaHZpcnpNQTYwenQxNGpIU2JFQm43SnZPVXU5M3ZReHRZQ0xBcExsMVpCVHRRRTY3eEJkVlk2bNIBsgFBVV95cUxQekRHR3hnQmVfYndCdkhzclk2cWpZWEdkeG9RLUc1MktrWXhxMWdZUXlvOFU0X05DbHJRc1h3YVhIbTYzRi15WnpsdmQwMXRxOXdpRllfRHpfSjMyYnltdDA1N3FYMWRRTHZzbmJsN1F6T1FXVE9uY2w2STljOW84aXZkNVNmamhaSjBJNkRJSjk0R0JaSDZGU2kwZHpRRGNGRnp4Q0FVYk4tTkdXdk1oLVBR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Ascends: Hovers Around US$3,372 on June 27 - Analytics Insight",
        "content": "The U.S. Securities and Exchange Commission (SEC) is set to approve several exchange-traded funds (ETFs) that will track the spot price of Ethereum, reportedly by July 4.\n\nThis advancement follows final discussions with leading asset managers such as BlackRock and Grayscale Investments.\n\nThe introduction of these funds marks a significant milestone in the maturation of crypto markets and their adoption by mainstream investors.\n\nWhile initial reactions and the long-term performance of these ETFs remain speculative, the strategic initiatives by top asset managers suggest a strong belief in Ethereum's potential.\n\nAsset managers are looking to build on the success of January's spot Bitcoin ETFs, which attracted US$14 billion in inflows.\n\nGrayscale, in particular, aims to transform an existing trust into a spot Ethereum ETF , reflecting a strategic move to broaden crypto investment options.\n\nAnalysts have mixed views on the potential inflows, with some cautioning that Ethereum ETFs may not generate the same level of excitement as their Bitcoin counterparts. Others, like Bitwise's Matt Hougan, are more optimistic, predicting US$15 billion in net flows within the first 18 months. Once approved, the new Ethereum ETFs could begin trading within 24 hours."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9vLU45TTY5MHEyaEVOVXVtM01RZzdoZXlwRXVMOTVkY0kyTjktcFMtLVFmMTZRVFVIM2RacDRVbXEtOHVqdXF3dmQwMG9CbmtTV3JDekdQV2dhNmhKQm9ybjJhMFVVRUN2WktVZWpMSlVFMjNYZjJn0gF8QVVfeXFMT2o3OWlmSGV2Y3VSNmF0bXFYU0Z2OXA3OWZRWndlTzJqWFJEeXVOdjNUUGtGT1pQb3JuMUhHQ2hhN3Q4R0dsT094MzlycnlXRGFwVjRoSjFHbmNNbEQzdVI5NG1Pbmk4ZUJaekEwenQ3cDN3VmY4dmtQVDZGQw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 03:43:18 GMT",
        "title": "Ethereum Price Roadblocks: What’s Hindering A Fresh Increase? - NewsBTC",
        "content": "Ethereum price struggled to recover above the $3,420 resistance zone. ETH is consolidating and might decline again if there is a move below $3,320.\n\nEthereum is struggling to gain pace for a move above the $3,420 zone.\n\nThe price is trading below $3,400 and the 100-hourly Simple Moving Average.\n\nThere is a connecting bearish trend line forming with resistance near $3,400 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair must clear the $3,400 and $3,425 resistance levels to continue higher.\n\nEthereum Price Faces Hurdles\n\nEthereum price started a decent recovery wave above the $3,320 level. ETH even cleared the $3,350 level but the bears were active near $3,420. A high was formed at $3,426 and the price corrected gains like Bitcoin.\n\nThere was a move below the $3,380 level. The price dipped below the 23.6% Fib retracement level of the upward move from the $3,230 swing low to the $3,426 high. The bulls are now trying to protect more downsides below the $3,320 level.\n\nEthereum is still trading below $3,400 and the 100-hourly Simple Moving Average. On the upside, the price is facing hurdles near the trend line and $3,400. There is also a connecting bearish trend line forming with resistance near $3,400 on the hourly chart of ETH/USD.\n\nThe first major resistance is near the $3,420 level. The main resistance is near the $3,450 level. A close above the $3,450 level might send Ether toward the $3,550 resistance.\n\nThe next key resistance is near $3,620. An upside break above the $3,620 resistance might send the price higher. The next hurdle sits at $3,680, above which the price might gain traction and rise toward the $3,720 level. Any more gains could send Ether toward the $3,880 resistance zone.\n\nAnother Drop In ETH?\n\nIf Ethereum fails to clear the $3,400 resistance, it could start another decline. Initial support on the downside is near $3,350. The first major support sits near the $3,320 zone and the 50% Fib retracement level of the upward move from the $3,230 swing low to the $3,426 high.\n\nA clear move below the $3,320 support might push the price toward $3,250. Any more losses might send the price toward the $3,200 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $3,320\n\nMajor Resistance Level – $3,400"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOVmtsTWV6NTVGRVFhTW5ibnFEdG5Za0dRMHZrVXpkNExqd05kQTlpUkpUTWJ2WmtRTmNSdmwtNW9lXzIteUIyOEktMlRWWjh5SDFjVHpjTDRBWjZJRk4yNDBocEQyaTRmSG9XblJJdU9Qc1lLVjMwMU1ldXV2WkVhUmpyQTc0RGdQYkh0YkJIWjViZ2NkMTJ5Rzl3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Can ETH Surpass 4K Before The End Of June? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Ethereum, the second-largest cryptocurrency by market capitalization, has shown promising signs of gaining ground against Bitcoin. This development, coupled with fluctuating prices and new positive signals, could mark a significant shift in the cryptocurrency market dynamics. With these signs, can Ethereum break the 3K level and surpass 4K?\n\nEthereum's Bullish Sign Against Bitcoin\n\nEthereum (ETH) has been lagging behind Bitcoin (BTC) for nearly two years. However, recent analyses suggest a potential turnaround. A prominent trader recently highlighted that the ETHBTC pair has closed above the two-day Ichimoku cloud for the first time in 525 days. This technical indicator often signals a bullish trend, suggesting that Ethereum might have bottomed out after a prolonged period of underperformance.\n\nCurrently, Ethereum is trading at 0.055 BTC. After reaching a peak of 0.061 BTC in January, the ETHBTC pair faced a significant downtrend, falling to 0.044 BTC in May. However, Ethereum rebounded, gaining 28% against Bitcoin in May following the U.S. Securities and Exchange Commission's (SEC) unexpected approval of several 19b-4 forms for Ethereum exchange-traded funds (ETFs).\n\nThe approval process for these ETFs is progressing smoothly, according to SEC Chair Gary Gensler. Reuters reported that Ethereum ETFs might go live by July 4, with talks between prospective ETF issuers and the regulator reaching the final stages. While the launch of Ethereum ETFs could be a major bullish catalyst, analysts cautioned that they might not generate the same excitement as Bitcoin ETFs.\n\nEthereum Price Prediction and Analysis\n\nEthereum (ETH) Current Price Fluctuations\n\nAs of today, Ethereum's (ETH) price fluctuates around $3,4K, showing stability above this level. This stability is accompanied by positive signals from stochastic indicators, suggesting a potential bullish wave.\n\nEthereum Price Prediction: What is The Expected Scenario?\n\nThe bullish wave is expected to target $3,493.00 initially, with the potential to rally towards $3,641.82. However, if the price breaks below the $3,360.31 support level, it could halt the bullish trend and subject Ethereum to correctional bearish pressure. With these numbers, predictions highly doubt that Ethereum could ever surpass 4K, at least not by the end of June. However, with the launch not far away, expectations and predictions can drastically change.\n\nEthereum Price Analysis: What is The Main Trading Range?\n\nTo sum it up, the expected trading range for Ethereum lies between a support level of $3,280.00 and a resistance level of $3,530.00. Investors should monitor these levels closely to gauge Ethereum's next moves.\n\nEthereum is showing signs of a potential bullish trend against Bitcoin, supported by technical indicators and the forthcoming launch of Ethereum ETFs. However, Bitcoin's price fluctuations and market dynamics require careful monitoring to capitalize on these opportunities."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5lZlFsMDViREUyazlqQmV2dXBZWUNkUVJQeGhUbWhoTHA2SFBNOFFfT0EtVk9oNjVuRWRpWGhzSVFfaVJKWENKRndLMGVoOVkwZ1p0QU5BbjVkbXF1c2xTeDRGRDVWMFdtZ2tObHlxcnBGaHFQMUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "AI predicts Ethereum for price for July 1, 2024 - Finbold - Finance in Bold",
        "content": "Much like many other prominent cryptocurrencies, Ethereum (ETH) has been offering a relatively strong overall performance since the start of 2024, but has been struggling since in the last 30 days of trading.\n\nIndeed, though ETH is up nearly 50% since January 1 and, having crossed above $4,000 in March, though it managed to reach highs not seen in years, the last month saw a decline of approximately 11%.\n\nNonetheless, given that June 25 saw another turning of the tide with numerous cryptocurrencies beginning to reverse the downtrend, Finbold decided to consult several of the leading artificial intelligence (AI) platforms on where Ethereum might find itself on July 1, 2024.\n\nAI sets ETH price on July 1, 2024\n\nThe first to be consulted – the most advanced model of OpenAI’s flagship ChatGPT platform – proved mostly neutral about ETH.\n\nIndeed, according to the AI, the cryptocurrency is likely to remain mostly level in the forthcoming five days of trading and find itself somewhere in the relatively narrow range between $3,420 and $3,480 on July 1.\n\nChatGPT outlines its ETH price target for July 1. Source: Finbold & ChatGPT\n\nMicrosoft’s (NASDAQ: MSFT) Copilot – its ‘balanced’ mode, to be precise – provided exceptionally bullish. Indeed, the AI predicted that ETH will skyrocket in the coming days and find itself somewhere in the range between $3,900 and $4,000.\n\nCopilot outlines its ETH price target for July 1. Source: Finbold & Copilot\n\nAmong the large language models (LLMs), Alphabet’s (NASDAQ: GOOGL) Gemini – once known as Google Bard – proved the most troublesome. After initially attempting to build a prediction using a fictional current Ethereum price at $1,400, it finally agreed to retrieve more contemporary crypto market information.\n\nHaving overcome the initial hurdle, Gemini estimated ETH is likely to stand at $3,350 on July 1, 2024.\n\nGemini outlines its ETH price target for July 1. Source: Finbold & Gemini\n\nFinally, the predictive machine learning algorithms of a platform specialized in providing forecasts of future prices of assets – PricePredictions – proved significantly more bearish than the LLMs.\n\nETH price prediction for July 1, 2024. Source: PricePredictions\n\nIndeed, according to the platform, ETH’s downtrend is set to continue, and it placed the cryptocurrency at $3,175.25.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNaHdEckd2NENMY0FjYi1DOUNNeFdRdmIza25PQTFCS21zSk9IYmg5d25NZmxRa3d3bE1oU3BMT3hhT05YdG1PaENkeWtHX1Z4dWRBaDFHNkhqNnlpdHBVeVVqcjlpS3VpR3JBSlc2VGZNcjgzeGczbkd4R1FBT3U3Z3k3SWFKU29UcVM2Slg0dnRpdWgwMFJSRVZ6T0premtWZXB1eFdkdVV0ZUdBX2xnMXFMeEtERUVuZmUwUEVIcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Smart Money Moves In: Ethereum, Cosmos, and Angry Pepe Fork Lead Crypto Rally As Others Stall - Blockchain Reporter",
        "content": "Under a dynamic turn of events in the altcoin market, Ethereum, Cosmos, and a new entrant, Angry Pepe Fork, are leading a notable rally attracting large interest and money from astute investors. These altcoins have exploded ahead, showing strong performance and fresh investor confidence while other altcoins battle to keep momentum. Let us find out more.\n\nAngry Pepe Fork: One Of The Promising Alt Coins To Watch\n\nAngry Pepe Fork is a glimmer of hope for rebels and outlaws determined to overturn the current meme-themed coin situation. The Angry Pepe Fork army has a great opportunity to earn and grow thanks to APORK’s unique “Conquer To Earn” system. Additionally, as the community stakes its tokens and rewards both individual and group efforts with each zombie coin defeated, the Annual Percentage Yield (APY) increases.\n\nMoreover, whether you are staking for the long term or the short term, there are advantages at every turn. Depending on their desired level of commitment, participants can modify their earnings during the 30, 60, and 90-day tier-based lock-in periods. This novel approach makes a lot more sense because during the presale phase, participants can begin staking and earning money. Furthermore, the current market decline presents a chance to purchase a large quantity of APORK tokens in advance of the cryptocurrency market’s anticipated bull run.\n\nFurthermore, analysts project that the price of Angry Pepe Fork will have risen by 500% by the end of the presale. Meanwhile, SOLIDProof has thoroughly reviewed the platform’s smart contract, ensuring a reliable and secure investment. It is strongly advised that you become a part of this movement because each token is now only being sold for $0.014 during the initial presale stage.\n\nThe APORK project will also pique your interest if you liked Angry Pepe Frog or missed the initial phases of the native Pepe coin. Notably, presale revenue for this project has already exceeded $169,000, and by the end of the following month, it is anticipated to reach $1 million. Additionally, by only issuing 1.9 billion tokens, APORK intends to maintain scarcity. This could result in a sharp increase in the value of APORK tokens due to strong demand and limited supply.\n\nEthereum Price Consolidates\n\nGensler emphasized that asset managers are currently the center of attention. Moreover, Spot Ethereum ETFs, according to Gensler’s initial suggestion, would launch in the summer. The 19b-4 forms were approved by the SEC last month, opening the door for this investment class. S-1 filings are currently being worked on by the SEC and issuers; approval is required before the products can start trading.\n\nSpot Ethereum ETFs are expected to launch on July 2, according to some knowledgeable analysts. Meanwhile, the Ethereum price has been consolidating between the $3,620 and $3,250 levels over the past week. However, analysts expect a bullish breakout in the coming days.\n\nCosmos Price Prediction\n\nAs of July 26, 2024, the Cosmos price is expected to increase by 2.01% to $7.05 based on a current Cosmos price prediction. Moreover, technical indicators indicate that the current mood is bearish, and over the previous 30 days, Cosmos had 13/30 (43%) green days and 9.47% price volatility.\n\nMeanwhile, the projected yearly low Cosmos price for 2025 is $6.19, based on the token’s past price fluctuations and BTC halving cycles. It is anticipated that Cosmos will cost as much as $30.37 in the upcoming year. As of right now, the Cosmos price prediction for 2025 ranges from a low of $6.19 to a high of $30.37. If Cosmos hits the higher price target, Cosmos could see a 343.87% increase in value by 2025 compared to its current price.\n\nConclusion\n\nEthereum, Cosmos, and Angry Pepe Fork are rising as notable performers as the altcoin market undergoes a dynamic change that attracts much attention from smart investors. These altcoins are not only keeping great momentum but also show great promise for large returns.\n\nMeanwhile, with its creative “Conquer To Earn” approach, which provides special staking chances and expected great yields, Angry Pepe Fork is creating waves. APORK is positioned for amazing expansion, maybe rising by 500% by the end of its presale with a well-reviewed smart contract and a strategic approach to token shortage. Its appealing presale price and great community support make it one of the promising alt coins to watch.\n\nVisit Angry Pepe Fork Presale"
    }
]