[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOS0ttOXV3cUNSNk1EWU81c3RiNGlFVlhObkNvUE5IdXE3WVBUVUwxNmkzakswNklQSDEyZ3Q3dnZCOXN2cVNZN0xONGwwekxDMjdVcVFDNzB6TFJaci1OZHN3VXhiODJBZWwwMERVQlhDelR0bHhNRS00aEdOX3FtNzIwcHRqTENGeHExeUFsc0tpTENfTi1uQg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Should You Buy Ethereum While It's Still Below $2,500? - The Motley Fool",
        "content": "There are three different catalysts that have the potential to send Ethereum higher in 2024.\n\nAmid the current crypto market rally led by Bitcoin, there's one crypto that seems to be getting completely overlooked: Ethereum (ETH 0.07%). That's somewhat surprising, given that Ethereum is the world's second-largest cryptocurrency, with an enormous $290 billion market cap.\n\nHowever, the hype around a spot Bitcoin exchange-traded fund (ETF) has focused investor attention squarely on Bitcoin. At the same time, a number of direct Ethereum rivals skyrocketed to triple-digit percentage gains last year, and have become the new darlings of crypto investors looking for maximum upside. But there are several reasons Ethereum might be undervalued at its current price of about $2,400.\n\nEthereum vs. the wannabe Ethereums\n\nAt the end of 2022, Ethereum was the talk of the crypto industry. It had just pulled off The Merge, which fundamentally transformed its blockchain to make it faster, cheaper, easier to use, and much more energy efficient. The hype around Ethereum grew to the point where some investors even thought that Ethereum might eventually surpass Bitcoin in terms of market cap.\n\nBut then came 2023. All of a sudden, rival blockchains like Solana started gaining traction with investors. At one point, Solana was up more than 1,000% for the year. Avalanche, another Ethereum rival, was up nearly 200% for the year. By way of comparison, Ethereum was up 90%, and seemed to be losing the attention of investors.\n\nSo the big question is whether Ethereum is still best-in-class. If you think that the so-called Ethereum killers are just a bunch of Ethereum wannabes with no long-term staying power, then Ethereum could be highly undervalued at its current price. But if you think that Ethereum's long reign as the top Layer-1 blockchain network in the world is coming to an end, then it's a completely different story.\n\nA spot Ethereum ETF incoming?\n\nRight now, the imminent arrival of the first spot Bitcoin exchange-traded fund (ETF) for the U.S. market is getting all the headlines. But, according to a growing number of crypto investors, a spot Ethereum ETF could be coming soon. And that means that Ethereum could soon get the same type of boost Bitcoin is getting right now.\n\nCertainly, the underlying logic makes sense. Wall Street is looking for more reliable ways to invest in crypto, and has apparently determined that the ETF investment product is the best way to achieve this. Once it can show that a spot Bitcoin ETF is successful, then it's time to crank up this formula for every other major cryptocurrency.\n\nGiven Ethereum's market heft -- it now accounts for about 17% of the market value of the entire crypto market, second only to Bitcoin -- it would only make sense that Ethereum would be next in line for a spot ETF. And, indeed, there is already an application in the works for just such a product. In September, Cathie Wood's Ark Invest filed for a spot Ethereum ETF. If the Securities and Exchange Commission (SEC) decides to approve this (admittedly, a big \"if\"), it could result in billions of dollars flowing into Ethereum, pushing up its price.\n\nA sexy new upgrade\n\nFinally, there's the matter of Ethereum's next big upgrade. Ethereum recently published its strategic roadmap for 2024, and one item on the roadmap that caught the attention of investors was something called EIP-4844 (\"Ethereum Improvement Proposal 4844\"). Basically, this is a proposed technical change that would enable the processing of transactions on the Ethereum blockchain to become much faster and more efficient.\n\nI know, I know. You're probably rolling your eyes right now. What a bunch of blockchain babble, right? But consider that EIP-4844 got J.P. Morgan really excited. In a research note to clients, JPMorgan specifically referred to EIP-4844 as a key reason it thinks Ethereum could outperform Bitcoin in 2024. That's because this major technical change would make it theoretically possible for the Ethereum blockchain to handle 100,000 transactions per second, up from about a dozen or so now. With that type of speed, Ethereum would basically be unstoppable.\n\nHow much higher can Ethereum go?\n\nFirst and foremost, Ethereum needs to convince investors that it is still the preeminent Layer-1 blockchain network. So keep an eye on how Ethereum deals with the growing threat from the likes of Solana. As long as investors buy into the idea that Solana is a faster and more cost-efficient version of Ethereum, it's hard to see Ethereum skyrocketing in price.\n\nWith that in mind, it's certainly possible to find a number of bullish Ethereum price predictions for 2024. Some crypto traders think that Ethereum could double, triple, or even quadruple in value. I may not be as bullish on Ethereum, but I'm certainly open to the idea that Ethereum could surprise a lot of people in 2024."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNLTlRdmgwbUVsWml1MGctWDdPMXQ0czFRR3c2REs3b3IxVUpjM1BfdkhGSmhHcHBsRVJwREtpTVFWS2hyR2hVXy1INFpEbmE3NDNPcUhJTHFWN3gyWmpQbUZKWjBUZEU4SE9FX1lJM012czFNOTFWdGFwRHJWRWJPLUtLZWtSYS1zRTYybTNPZnRVUk5lMEhXa0JuemF4VnhXSUhjR9IBqgFBVV95cUxPX2tYNUxBNlJOTFRyTmZ4bHlRM3NMV2gwUHJKTUtOU2ZhajAxLV9OaUg4bTZhVERMZG9kU203R1M3NG5wenVJTTJFaXZoa3N4R3ViVW1TbjFVTm00U0xQMGZHWGJiUmFtTU45dWNkdjZEWW5rTjRsQUVpSTNPbUpMeHRVZW80eGw4ZXAwTHNrV3pKaWRMSVJFMXhIQk5mMkZhTWdoSWxMX3Ytdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ether prices spike on hopes of an ETF — but the SEC signals that's less clear cut than bitcoin - CNBC",
        "content": "In this article BTC.CM=\n\nETH.BF= Follow your favorite stocks CREATE FREE ACCOUNT\n\nwatch now\n\nSt. Moritz, SWITZERLAND — U.S. Securities and Exchange Chair Gary Gensler fired warning shots to the crypto industry, casting doubt over whether digital coin ether would follow next in the footsteps of bitcoin to receive approval for an exchange-traded fund. After the bitcoin ETF approval, prices for ether — the token linked with Ethereum — spiked to their highest level since May 2022. That was because investors are betting on an ether — or ETH — ETF to be rubberstamped by the SEC next. The agency is due to give decisions on spot ETH ETF applications beginning in May. BlackRock, Invesco, Ark and VanEck are among the firms in line for approval, as well as Grayscale.\n\nThe SEC has long been an opponent of cryptocurrencies, and its bitcoin ETF approval in no way changed its stance in a big way. After the ETF decision, Gensler issued a statement in which he called bitcoin \"speculative\" and said it could be used for \"illicit\" purposes. One comment poured cold water over hopes of an ETH ETF. \"Importantly, today's Commission action is cabined to ETPs holding one non-security commodity, bitcoin. It should in no way signal the Commission's willingness to approve listing standards for crypto asset securities,\" Gensler said Wednesday after the SEC decision on the ETFs.\n\nCrypto as commodities or securities?\n\nA long-running debate in the U.S. is over whether cryptocurrencies are classified as securities or as commodities. Key to Gensler's comments was his reference that bitcoin's status as a \"non-security commodity\" was one of the reasons why the SEC was comfortable approving the ETF. Gensler made clear that \"the vast majority of crypto assets are investment contracts and thus subject to the federal securities laws,\" in the SEC's view. This complicates matters for an ETH ETF. \"One distinction which I think people have to look at which is that bitcoin clearly has been bucketed as a commodity, Ethereum, there's still some question. Is it a security? Is it a commodity? And I think until that's resolved, it cannot be look at exactly like the bitcoin product, in terms of how do you structure and ETF around it,\" Bill Tai, chairperson of Aktai, told CNBC in an interview at the Crypto Finance Conference in St. Moritz. Tai said that approving an ETH ETF is \"not as clear cut\" as was the case of bitcoin. \"I do think that it's not out of the range of possibility, but there are additional factors to consider around that one because of its classification,\" Tai said. Securities and commodities are regulated under different laws and by different agencies.\n\nWill an ETH ETF happen this year?\n\nCommentators are split on when an ETH ETF may come to the market. Some, like Antoni Trenchev, co-founder of cryptocurrency exchange Nexo, think it will happen this year. \"I'd watch what the SEC does and not what it says, because it wasn't long ago that the prospect of a spot Bitcoin ETF seemed like a distant dream. Things move very fast in crypto and investors are front-running what they believe to be the next big spot ETF approval,\" Trenchev told CNBC by email. \"You'd have to say now that bitcoin has knocked down the door it's only a matter of when not if others will follow — most likely in 2024 — and ETH is definitely the leader of the pack.\" Christopher Giancarlo, co-founder of the digital dollar project and former chair of the U.S. Commodity Futures Trading Commission, oversaw the introduction of bitcoin futures in 2017. He said that, in his experience at the regulator, the approval of one product opens the doors for others. \"Once we greenlighted bitcoin futures, there as a tremendous movement in the CFTC jurisdiction area for greenlighting ethereum futures and that did come 18 months later,\" Giancarlo told CNBC on Thursday. He added that he would be \"shocked\" if there weren't growing demand for an ether ETF. \"The SEC's going to have deal with the growing demand for that product,\" Giancarlo added. Others are a little more skeptical that the SEC could approve an ETH ETF in the short term.\n\nwatch now"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOOGNWUWIyOTVPOWJlaVk0Y0lQc2pYaHhES3RYTHhsTER2cl9UaElwX0g1OF9hc1gzaC14Nk1NUjluWXUwQVc0NDU4QXRhLXJRYTNCT2d0QlFBTnhIRU01ZkkzbVM5V1pkZFpIRU1MWW14YUwydzVUNnI5VU5Vb2Z4c2F5LWp0OHVzb2ZHWGhvUHV3SmJTOFV0eUZJcE9fdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Two Powerful Blockchain Platforms of the Future: Ethereum and Solana - Paxos",
        "content": "Blockchain, once overlooked in the shadow of cryptocurrency, is now a powerhouse player in its own right with implications far beyond the financial sector. From improving supply chain integrity to facilitating transactions for a wide range of digital assets, its use cases are vast and varied.\n\nBut what lies at the heart of this innovative technology, and how can it be harnessed? It is helpful for enterprises across many industries to understand the fundamentals of blockchain and how key platforms like Ethereum and Solana are leading the charge in this technological revolution.\n\nWhat is blockchain?\n\nBlockchain is digital ledger technology that documents transactions across a network of computers. It can log and track everything from cryptocurrency payments to real-world assets to legal agreements.\n\nBlockchain technology is renowned for its security and immutability. The technology’s name stems from the fact that it’s comprised of a series of “blocks,” with each containing transaction data, a timestamp and a cryptographic hash of the previous block. Every transaction is linked in a “chain” and distributed across numerous nodes.\n\nBecause of the decentralized nature of the blockchain, there’s little risk of manipulation from entities like governments or financial institutions. In fact, a blockchain’s structure makes it nearly impossible to retroactively alter any single record without changing all subsequent blocks.\n\nBlockchain technology offers transparency and decentralization, making it an attractive option for transactional applications—among them, money movement, supply chain management and even digital identity verification.\n\nEthereum and Solana\n\nWithin blockchain technology, there are many different blockchain platforms. Two of the most prominent blockchain platforms are Ethereum and Solana, each with unique features and capabilities.\n\nEthereum (ETH): Ethereum, launched in 2015, is both a cryptocurrency and a platform for building decentralized applications. Ethereum introduced the concept of “ smart contracts ,” or self-executing contracts with the terms of the agreement written directly into lines of code. The latest iteration of Ethereum’s blockchain is secured using a proof-of-stake ( PoS ) consensus mechanism—essentially, th e process by which validators create new blocks. ( Learn more about consensus mechanisms and how they work here .)\n\nSolana (SOL): Solana is a newer blockchain platform that launched to the public in 2020. It’s known for speed and efficiency. It employs a unique hybrid consensus model, combining proof-of-history (PoH) with proof-of-stake (PoS). This enables it to process transactions rapidly and with lower fees compared to Ethereum. As such, Solana is an attractive platform for high-frequency trading and other applications requiring quick transaction times.\n\nEthereum and Solana have gained popularity because they offer solutions to common pain points related to scalability, speed and cost. These platforms have also sparked an entire ecosystem of subsequent innovation: Ethereum’s smart contract functionality has given rise to decentralized applications (dApps), decentralized finance (DeFi) platforms and non-fungible tokens (NFTs).\n\nThe future of finance: instant transfers and more\n\nImagine a world where international suppliers are paid the moment goods are shipped, employees receive compensation in real-time and complex financial transactions are settled instantly. This immediacy not only streamlines business operations, but also opens doors to new financial strategies like dynamic pricing. The ripple effects of such capabilities include more agile, responsive and competitive businesses and a transformation of the way global commerce operates.\n\nBlockchains like Ethereum and Solana have the potential to make such hypotheticals into realities. With their ability to power instant, 24/7 financial transactions across borders, blockchains may be particularly attractive to enterprises operating in multiple countries or those engaging in high-volume trade, not to mention the implications for sectors like e-commerce and digital supply chain management.\n\nBlockchain technology is evolving rapidly. Many enterprises need a hand when it comes to adopting it and maximizing its potential and a trusted partner can help you seamlessly integrate blockchain into existing operations.\n\nBlockchain is transforming the way we think about money, assets and transactions and is paving the way for new business models and strategies. With the right partners to help you navigate and implement blockchain systems, your business will be well-positioned to stay a step ahead in the digital finance era."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOSWlMeGVNZFZLZDl5SThZcENLcndYM0VUTzV4ODB5dzFMQi1CZ05zamIwNkF1aTBuTU94TERxeWJGYUl4N01BT2RqcHZ5N0s3WnNtRjVRQWl5Wl9jZG5KOHotVWx2N082azlNblk1S1BiSU5udFdFUkQtUWx0WVlrdWpyRVB0YTQ5TG4yZG1FbW1DZzJpaE1jYkltaGtqcEJfME9IUVBFNFNPd3ZOTnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Rival Ether Jumps on Bets Token Is Next for ETF Approval - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNajVaT2lES1J2Q2hjRW1nb0hSM2ZuM1ZTa3RKbnhWaXpZY0VXMmJ4OV9jUk16cGVJTmgzaEFFOTRsVlN6OFNINE9nTFoydmEya1R5V1BJSnRqeWpvcjE4YTVkRGd5Vi1IVkhCdEhJU1NhOGZ1RS1ValRTZUxDRlV3Nw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Spot ETFs Could Be Next, According to Bloomberg Analyst - Yahoo Finance",
        "content": "Ethereum Spot ETFs Could Be Next, According to Bloomberg Analyst\n\nWith the U.S. Securities and Exchange Commission (SEC) approving 11 spot Bitcoin exchange-traded funds (ETFs) on January 10, the path is now clear for spot Ethereum ETFs to be approved in 2024, according to Bloomberg ETF analyst Eric Balchunas.\n\nBalchunas believes there is a 70% chance that spot Ether ETFs will be approved by May, the month the SEC must make a final decision for several applications. Balchunas previously stated that he could not see a scenario where spot Bitcoin ETFs are approved but spot Ether ETFs are not. He compared the two cryptocurrencies, saying that \"Ether spot is tied to the hip of Bitcoin spot.\"\n\nThe earliest deadline for spot Ethereum ETFs decision is in May later this year for VanEck’s Ethereum ETF. BlackRock’s deadline is in August, however if the SEC does approve, it could approve all applicants like it did for the spot Bitcoin ETFs.\n\nPrior to the SEC's spot Bitcoin approval, Valkyrie Funds' chief investment officer Steven McClurg said he wouldn't be surprised if spot Ether and XRP ETFs come to market after Bitcoin. Several major asset managers, including BlackRock, VanEck, ARK Invest & 21Shares, Fidelity, and Invesco Galaxy, have filed applications for spot Ether ETFs. The SEC must make decisions on these applications by various dates ranging from May 23 to August 7.\n\nFollowing the Bitcoin ETF approval, Ethereum (ETH) gained 8.5% over the past 24 hours, and rallied over 15% in the past week, breaking above the $2.5K level, as investors speculate on the potential of a spot Ether ETF approval.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPd1J6OTJ3TkF6NHBNV2UtX25ZM1hHNmhudEJxOHJ2Y2ppRWx0RHhDdjdzdmFmUzBKb3k5WmZmamhnMnhYM1V2ZGM1Y3VnWHNuSFlaR3BlM0FXNFNDM2hFdVpwU1BoX25ONzh2U01SLXc0aURqVlAtdFlLaDgtaFp1NDNRdFNwR25vZjBtaGVoRW1Xei1QcHFRY281a9IBoAFBVV95cUxPRUQzVDVZeGZxQ0NQVFJyUTdyTmNFVnVmU056QWJXaGtXMklEV2xaYTFlTEY5MlQ1Y0ZhUkJ6Q2tRRG5OX1gyYnUxLVgtM2NQbVJ6RXI5d0IzUy03cGJTanp2dUdpd3AxWElqRUFVbVRveVF2NERhUzhmQktHaS1temVZWFlrSGRXMUxFQjZaa04zQjF2MVpDeUFCd01VUlM3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin Proposes Gas Limit Increase - CoinDesk",
        "content": "Following Buterin’s Reddit comments on Wednesday, more users on X, the platform formerly known as Twitter, chimed in with words of support for the suggested increase. Jesse Pollak, the head of protocols at Coinbase and creator of the layer-2 blockchain Base, shared his support of the move and suggested the gas limit could even be increased even further, to 45 million."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE8xdU1aQWZOUVlOdDczYUs4Wk9Zb09JODdCa1lERDQycW5ja2tTelhnVkpSbFI3cmU3NFlmZERiOEpnMmtqcnNBblNzeVdkbU9pNm9neEQ2R0FqYW1USE5ybk9ZMGJyOGJPWnFEWjlubmdEVlpsemhHUWhGb9IBgwFBVV95cUxQeGc1MzFNYl81cTR3ODJKUnl3REZrVVJSWTRhX0N6anFaYjFKTGJQTEJGYWxZakNFWkZobS1DbGRkWElnNnJwLUVnSGJKRENGZzZqeDJPNTh5WTVNeHU5X2o3ZkpJbkFjMFktZU5lczF0VlVKaDJ2WmUtMEVKazJ3TlQtaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF Hopes Push ETH Up 8% to Over $2,600 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFollowing Wednesday's landmark approval of multiple spot Bitcoin ETFs, hopes that a spot Ethereum ETF could be next to market have propelled ETH to levels not seen since May 2022.\n\nEthereum is currently up 8.7%, trading at just over $2,620, per data from CoinGecko.\n\nBitcoin itself is trading relatively flat, up 2% over the past day. The SEC's approval of a spot Bitcoin ETF Wednesday followed days of confusion, including a fake tweet posted by the \"compromised\" SEC Twitter account on Tuesday.\n\nSeveral hopefuls have filed applications for a spot Ethereum ETF with the U.S. Securities and Exchange Commission (SEC), including Ark 21Shares, BlackRock, Fidelity and Grayscale.\n\nAD\n\nAD\n\nThe SEC's approval of a spot Bitcoin ETF was a long time coming, but traders are betting that an Ethereum ETF might be quicker to market.\n\nBloomberg Intelligence's ETF analyst Eric Balchunas reportedly pointed to a 70% chance of an Ethereum ETF being approved by May, the SEC's final deadline for a decision on multiple spot Ethereum ETF applications. Balchunas noted that he had heard “on the back channels” that spot Ethereum ETFs “will be fine.”\n\nSEC chair Gary Gensler has repeatedly refused to confirm whether the regulator considers Ethereum a security or a commodity.\n\nPrior to taking up his post at the SEC, Gensler himself stated that the regulator considered Ethereum \"sufficiently decentralized\" that it doesn't qualify as a security. At the time, Gensler appeared to be referencing the views of SEC's former Director of Corporate Finance William Hinman, expressed in a much-cited June 2018 speech.\n\nAD\n\nAD"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNM2xFN1FZajdCMEUzZmFPVGtJdkhjaGNSakFKd1lPV0RZaGpyUm1Pamh3b0JWYkhmaHJEcFpLYWlTTWE3M1FtLXhkREFLQlhybVRvU1lyN1B6OEtodUQ4Q2tDN0I4eEJXaDVXUVJPTkJNLWR6XzAwb2JaNk9vN1VhUzBNa3dkbm9Mek82YVZjcGtpOTRVcHl1dg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Why Bitcoin Cash, Ethereum Classic, and Litecoin Are Surging Today - The Motley Fool",
        "content": "Spot Bitcoin ETF approvals are just one catalyst taking these three tokens higher today.\n\nThe entire crypto world has been shaken, in a positive way, by recent developments around yesterday's approval of certain exchange-traded products. For Bitcoin Cash (BCH -3.17%), Ethereum Classic (ETC -2.40%), and Litecoin (LTC 0.29%), broadly positive sectorwide sentiment appears to be a key driver behind these tokens' impressive moves higher. As of 2 p.m. ET, these three tokens have rocketed 13.9%, 34.3%, and 6.3%, respectively, over the past 24 hours.\n\nThe approvals of 11 spot Bitcoin exchange-traded funds (ETFs) yesterday by the Securities and Exchange Commission (SEC) has undoubtedly led to significant interest across the cryptocurrency sector today. Much of today's increase can be attributed to expectations that institutional capital will flow into this sector in dramatic fashion. In fact, projections from some analysts peg the impact of these approvals at around $100 billion. That's a win not only for Bitcoin, but for investors considering this entire space, as it legitimizes crypto for institutional and retail investors alike.\n\nLet's dive into what's behind the specific moves in these three cryptos today, over and above the obviously bullish headline news dominating the market right now.\n\nWhy are these three tokens surging today?\n\nFor Bitcoin Cash, a peer-to-peer electronic cash system tied closely to Bitcoin, today's news is obviously a net positive for this network. However, there are other key drivers supporting Bitcoin Cash's recent performance. News that cryptocurrency payments have surged to a record high in 2024 is very bullish for the likes of Bitcoin cash and other payments-focused cryptocurrencies. A report on Jan. 10 cited that nearly 1.3 million Bitcoin transactions were reportedly processed in 2023 alone, bringing the total number of Bitcoin transactions to more than 4 million. For those bullish on crypto as a payments facilitation technology, this is a strong catalyst to consider for Bitcoin Cash.\n\nFor Ethereum classic, the proof-of-work fork of the Ethereum blockchain, excitement around the potential approval for spot Ethereum ETF approvals appears to be driving interest in this adjacent token. Essentially, investors and traders appear to be speculating on a potential hard fork for Ethereum Classic, which would better align the network with Ethereum's, and improve its outlook (if Ethereum surges as a result of ETF approvals, one could argue Ethereum Classic could be due for a rally as well). Of course, such a substantial move of more than 30% may be overdone, so this will certainly be a token traders focus in on in the coming days.\n\nLitecoin's more muted rise today appears to be tied more to sector-specific tailwinds than anything else. Largely viewed as a Bitcoin and Ethereum alternative, this is a token that typically rides the tides higher and lower over specific time frames. Right now, there's a rising tide lifting most boats in this sector, and Litecoin investors are certainly pleased to see momentum taking this token higher over the past 24 hours.\n\nIs this momentum sustainable?\n\nUltimately, we'll have to see if these spot ETF approvals are a \"sell the news\" event, or a strong catalyst that puts a floor beneath crypto prices for the foreseeable future. In many respects, we won't know which outcome will materialize until after the fact. Thus, some amount of hesitation may lead to a waiting period for certain long-term investors, and could present an opportunity for buyers considering these tokens to jump in and ride momentum higher over the medium term.\n\nOverall, I think yesterday's spot ETF approvals are a bullish catalyst for the sector. For one, these approvals legitimize crypto as an asset class institutional investors can buy into. Another key factor driving sectorwide interest is the flurry of institutional capital expected for large-cap cryptos. Accordingly, for those seeking exposure to these trends, and looking for less-visible (and potentially higher-upside) ways to play crypto, these three tokens will likely continue to be in focus in the coming weeks."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQaDRnYldpTVAtdzc4eXpBakRkUWhscGpYaUNaV3B0N2RuamktU2ZKZ094TDlhWElUMHFuNnB5NHgtY1Z1TV9TMkJ3Wk00eDRqNW1XNkRzU2U2TS1rRVlUZnFtSWJCV19zODVYR2hMSVpXdE01eGV5clZyUDVQYzhZQ3laX21IYnhHeFRUT1NuZ0lQZU1ERi1VYWZOMklyM1pUX1p2N2pORDFsU0NkSjhNMnNNdGF1djRreElFUFNRaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "'Historic' day for bitcoin paves way for ethereum ETF: crypto investor Brian Kelly - CNBC",
        "content": "In this video\n\nShare Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\n'Historic' day for bitcoin paves way for ethereum ETF: crypto investor Brian Kelly\n\nBrian Kelly, BKCM Founder & CEO, joins 'Fast Money' to talk the kick off of spot bitcoin ETF trading after SEC approval."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOU2pKZm5Ta1ZaemFSWjRwLUlqTkJwbmtLX1BoQnMtVGdXemU0U2lSekF3MV81VEhLbUFkUWNLYlNWWFVYS3Q1M0ZYNDRpNGYwdjlFMmdwUWJLUzNmY1N1aWp0MWZnSXMzSFBBR0dnOE1PMXA3dVkyYlp4a1FQUUpuQS1fZUpDNjV5ZERpSlBTWldXQmpuSVlIaVdTa9IBowFBVV95cUxOZ3A4RmpsOW9qUWo1alZ6MFNzb1IzVTREXzRFckFFWDhucWpwNlNCbWVaYlVIVnpGZzVzRlU4RzRJSlFzY0hRS2xxeU1Fa2ZvN0M5ck9WX0R4ZDZab3ItbXo4VWVPZ2V6NGx5M00tVTZqOGNYZU5CZXNuVkQ1M1B1WFBkSVdtMUltNlpFZy1wdUUxMUEzZmthUDNUTEtnY3VmZDh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Dips, Then Bounces After ETF Approval While Ethereum Tops $2,500 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe United States Securities and Exchange Commission (SEC) officially approved the trading of spot Bitcoin exchange-traded funds (ETFs) Wednesday, as expected—but the price of Bitcoin itself has been choppy since, though it's currently sitting about where it was when the news hit.\n\nBitcoin (BTC) is currently trading for $45,814 according to CoinGecko. It was around $45,840 when the news leaked via an order on the SEC website that was posted and then removed, and the price jumped as high as $46,263 soon after. It's mostly down since, however, albeit not significantly.\n\nEthereum (ETH), on the other hand, rose above $2,500 for the first time since May 2022 on Wednesday afternoon, and has continued climbing while Bitcoin pops up and down. Ethereum is currently trading for about $2,550, up about 11% over the past day.\n\nOn top of that, native tokens for Ethereum scaling networks have also been hot on Wednesday. Arbitrum (ARB) is up 26% over the last 24 hours to a current price of $2.18, while Optimism (OP) is up 11% today to $3.92. Arbitrum set an all-time high price Wednesday afternoon, following the Bitcoin ETF approval.\n\nAD\n\nAD\n\nBroadly, the cryptocurrency market is up about 2% over the past 24 hours.\n\nEditor's note: This story was updated after publication with additional information.\n\nSHOW ALERT: Tune in to Rug Radio’s FOMO Hour at 10:30am ET Thursday to hear Decrypt’s Stacy Elliott and Fox Business’s Eleanor Terrett chat all things Bitcoin ETF with Farokh Sarmad, Michael Anderson, and Ovie Faruq."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQWm13TFg2M0pBSzYtV0NCQU80VnpGelJwa3dmUWd4Z1FjUG1vYUlGZkRBdmFpYkNLVFBvWUkyV25LYk5GelRKSnFrTExxdTdJcWZ2V1I5V2I3VkJhOEJuOFpnQzhCRHVDNFViTFlSaWhpVXFoa2pseTZHdXF6cklFMjNjclpyc0VDX1ZUQ3F0NjEtb2hRLTlMUExB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum applications take place as top gainers ahead of ETF announcement - crypto.news",
        "content": "According to CoinMarketCap, native tokens of Ethereum applications, including Lido DAO, Rocket Pool, and Aribtrum, take the lead ahead of spot Bitcoin ETF approval day.\n\nLido DAO (LDO) takes the top spot on the gainers on the Jan. 10 charts with a live price of $3.80, with a 24-hour trading volume reaching $385 million, in what is a 16.1% increase. The surge in the value of Ether (ETH) and native tokens of Ethereum-based applications is said to be driven by trader optimism surrounding the potential approval of an Ether exchange-traded fund (ETF) following the anticipated approval of a Bitcoin ETF in the United States.\n\nBlackRock’s iShares Ethereum Trust, a spot Ether ETF, may have its way paved by the approval of its Bitcoin counterpart.\n\nTop crypto gainers of the day | CoinMarketCap\n\nYou might also like: Stacks, Injective, Internet Protocol emerge as crypto top gainers\n\nFor similar reasons, Rocket Pool (RPL) has also seen an increase in value today, operating as a decentralized Ethereum staking pool that offers a competitive annual percentage rate (APR) of up to 4.3% for ETH2 staking. As of the most recent update, the live price of Rocket Pool stands at $31.76, accompanied by a 24-hour trading volume of $22 million, revealing a 14.9% increase in Rocket Pool’s value over the last 24 hours.\n\nRounding out the third spot is Arbitrum (ARB), which stands out as an Ethereum layer-two (L2) scaling solution, employing optimistic rollups to enhance speed, scalability, and cost-effectiveness within the Ethereum network. As of the latest data, the live price of Arbitrum is currently $1.94, accompanied by a 12.1% increase in value.\n\nWith the market experiencing significant volatility this week in response to ETF updates, investors are making many big moves in the crypto space."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxORE5MVmNteUtBLUF0ZXFSZG1sMVROUHZrVmM1RHNrWGdVeG0weVhYeFVSakRXeDFkNjYySUNMakw0aGVtdThNMWtoUkM1d2FESG1QOUhac1pSQTdqT1F0TXVSeHQzaENKdTlZaXowZ29HT0NSeW5WZmNSdzI5d0l3Nkh2ZFM0YXZUUTlnTzJLTlAtSXBFMVlYVWtubERaNzRVTG1JckFjcElaZnMwclVMMGRkRGVSRFNpT3lR0gHAAUFVX3lxTE9FLU5ueE0tXzhCWjk2MVFaTEh1aTQ0eU5pV2dBazc1d0xmaDZfaGRtbEp4eEFsNnVORXd2aW1KM1FyZzZVbUdFM1Y4NkhKV3ZZUEVNLTdTUDBIWldHSTlKU3FKa2J4YVZaeU5kWG1vd2UxVVpaZEJadEVQR2dYSG5rd2Q2XzMxUU5QRzRmdGtwRUE2RTlaeHNZOUdJZWxRcXZybVBXejlQcDBTLVpIYUtXLVRnZkxEZG10TDYwa09YbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ether ETF Hopes Drive Smart Money Bets After Historic Bitcoin ETF Approval - CoinDesk",
        "content": "“The approval of the Bitcoin ETFs by the SEC has opened the door for other cryptocurrencies,” said Lucy Hu, a senior analyst at Metalpha, in an email. “The market is now paying close attention to Ethereum ETF applications ... As the ETH spot ETF deadline is coming close, we believe more institutional investors will allocate more ETH in their portfolios this year to capture more returns.”"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQOU1DeFJOa2xaOHZSUkZRbFEzdzJaR21fXzN4RlBKNU01cGp3ZkN5VF8tbTFMOFBva1RXWElLV2Rkb1BBNmNxeHlPcFhuVWN0bHBPRW5FMmdNSUVvblJ6SnlpNUJTcFNpWUY5dVdscGdTU0QxRmY4TXBjNVRmdmZiQlc3M1paRm85TDUwR2o0ekJPZ0FZYnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum takes the lead over Bitcoin in derivatives trading volume - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNMmROUGR5bFFOUEZ6Q2tJQkkwZmdnY3NSa1ZJbks1RGxMM3BMcFh0aWNCQ1NMSlFXNEM5M0REMHVjeGFqNXBqaThkUmNnVGhKX085X0RfZU5IRDlnWEN5NlZ2MlQ4bi03WUJLWGlXYnJXaHhoVDFfc1YyejFJSnhnM3J3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum vs Bitcoin: Will ETH Price outperform BTC After ETF Approval? - crypto.news",
        "content": "Ethereum price briefly broke past the $2,400 mark on Jan. 10, up 10% within the weekly time frame, ahead of the much-anticipated Bitcoin ETF Approval.\n\nThe crypto market experienced widespread volatility on Jan 9 after the U.S. Securities and Exchange Commission (SEC) announced false Bitcoin (BTC) ETF approval in a now-denounced post on X.\n\nDespite the raging controversy, Ethereum’s (ETH) price has maintained a steady uptrend, trading as high as $2,440 on Jan. 10.\n\nEthereum vs Bitcoin: Crypto derivatives traders are betting bigger on ETH\n\nBetween Jan. 7 and Jan. 10, Ethereum’s 11% price growth performance has dwarfed Bitcoin’s 4%. Interestingly, vital derivative market metrics now suggest that ETH price could further outperform BTC if the SEC issues a timely positive verdict on Bitcoin Spot ETFs.\n\nFirstly, the funding rate represents the interest paid by bullish traders to inverse traders to keep their LONG futures contract positions open. As of morning trading hours Eastern time on Jan. 10, ETH currently has a Funding rate of 0.014%, which marginally exceeds currently exceeds BTC’s 0.12%\n\nEthereum (ETH) vs Bitcoin (BTC) Funding Rate | Source: Coinglass\n\nPut concisely, a higher positive funding rate in Ethereum than in Bitcoin implies increased demand for long positions in the ETH derivatives market, potentially reflecting a more optimistic sentiment.\n\nIn further confirmation that Ethereum price could outperform Bitcoin, the open interest dynamics have also flashed similar signals since the week’s turn.\n\nYou might also like: Bloomberg ETF analyst: Bitcoin ETF to be approved today\n\nETH open interest growth has outpaced BTC\n\nETH Open Interest has increased by 14.6% from $3.71 billion at close on Jan. 7 to $4.57 billion at the time of writing on Jan 10. Meanwhile, BTC open interest has witnessed only a 5% boost, from $6.4 billion to $7.3 billion during this period.\n\nEthereum (ETH) vs. Bitcoin (BTC) Open Interest | Source: Velo Data\n\nOpen interest represents the dollar value of all active futures contracts for a specific cryptocurrency. An increase in open interest implies more new entrants are bringing fresh capital than those closing out their positions.\n\nThe chart above clearly illustrates that the percentage increase in ETH has outpaced Bitcoin’s open interest amid intense speculation on the spot BTC ETF verdict. This affirms that crypto traders are betting on Ethereum to deliver larger price gains in the days ahead.\n\nWill ETH reach $3,000 after BTC ETF approval?\n\nDespite Bitcoin pulling more media traction, the current ETH Funding rate and Open Interest trends imply that crypto traders anticipate higher price gains in Ethereum after a positive ETF verdict. If this scenario continues, ETH’s price will likely reclaim the $2,500 territory.\n\nHowever, IntoTheBlock’s in/out of the money around price (IOMAP) data, which groups the current ETH holders by their historical entry points, shows a major resistance sell-wall around the $2,475 range.\n\nThe IOMAP depicts that 567,150 addresses have acquired 398,810 ETH at the average price of $2,475.\n\nGiven that this cluster of holders has been holding at a loss for nearly two years, they could rapidly book profits as ETH price approaches their break-even point again.\n\nBut if the derivative traders continue doubling their bullish positions as depicted by the elevated ETH funding rates, Ethereum’s price could break above $2,500 for the first time since May 2022.\n\nEthereum (ETH) Price Forecast, Jan. 2024 | Source: IntoTheBlock\n\nConversely, if a material market even sends ETH price into a down trend, the $2,200 support level could be crucial.\n\nAs seen above, the 2.85 million addresses that had acquired 7.7 million ETH coins at the minimum price of $2,220 could mount a formidable buy-wall to avert a prolonged Ethereum price downswing."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNNGxzaFVLS1VhUWtBU0wzOWFYaXRqRkh0OHhRRzdYbllBRWI1T29GeTA1UTNfaEJhYUJyTGI4Yk1TaktXbkVXaEhnV2pPcVJkZS1aNG10Q1I2eEZtWi1sMERSYldiMW1PcEpxU1lzd09sQXBGYnVLZEVDRGlZdlY0U2lKSktfZWxWN0xIVFhBbWIwNlN1MTVweTlvTklkT0F6QVFwSzNzc0NoclHSAbABQVVfeXFMT1hicTZrY0RDMDV1RWRMN1VQelUzc1EycUpFaW5kckdYcG1pOEo4MEQ2T2RIOXNBTnFTc2ZGNkd4STZWcjdvQzBhaDVCVVYtT3Q5Tkc3bU5FVEN5SDVCUnF4Sjh6ZVYzejVKMlBoaEpjakw2SkZpVmhoZXVneDRzOFdmWFF6T1ZqOE96ZFB1bjlpdFJkdXlmd3R0LV84MlUxYWhabHEwdjVmVWdXVTE1Zlo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ether Jumps Over $2.4K as Traders Bet on Possible Ether ETF Next - CoinDesk",
        "content": "But some stated that select tokens could gain in the coming days. \"Tokens in the ETH ecosystem like LIDO, ENS, and MKR experienced sharp up moves which should continue to take the attention away from BTC as traders now must position for the possibility of an ETH ETF,\" said Jack Tan co-founder of crypto exchange WOO X, in a Telegram message."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQVVQzLTJJbk0tRUFwRzlYSW5oMjhDMXRpanRmWnFUYmo2RkVEXzdjbHgxUXJEaHJ4bGtNdzVkYXlpczZ1U0ROdEdoUWtmZExDdUgxQmtHb3EyVmlXTjBubmg4Q2IzeXY2NEdhSnRoaFp3Zy1EQnFHLUJuR1pOQkw3bjdDQXdOWG5NQ1ZHMFIyc09oSW1qR3QyVU93?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Fake Airdrop for Ethereum, Solana, Tron Users Carried out by Scammers - TOKENPOST",
        "content": "Fake Airdrop for Ethereum, Solana, Tron Users Carried out by Scammers\n\nHackers target the Ethereum, Solana, and Tron crypto communities by enticing them with a fake airdrop scheme.\n\nWallet drainers, previously fixated on executing crypto scams via EVM chains, have now expanded their horizons to target Ethereum (ETH), Solana (SOL), and Tron (TRX) communities.\n\nThis shift marks a concerning trend as these scammers venture into well-established crypto groups.\n\nPhishing Scams via Fake Airdrops\n\nThe modus operandi involves enticing crypto enthusiasts through fraudulent airdrops. The scammers create a webpage where users can supposedly claim Ethereum, Solana, and Tron airdrop rewards.\n\nThese scams are labeled an \"exclusive opportunity\" for the community, urging individuals to link their primary wallets for access. Scam Sniffer highlights that these fraudsters can drain various crypto wallets using this deceptive webpage.\n\nAccording to CoinGape, this development is particularly problematic given the popularity of Ethereum, the second-largest cryptocurrency, alongside Solana and Tron.\n\nThe lure of substantial crypto rewards might mislead investors, potentially resulting in significant losses amounting to millions or even billions in digital assets due to these wallet drainer scams.\n\nIdentifying and Avoiding Crypto Scams\n\nWhile scammers occasionally upgrade their strategies, identifying potential scams can still be achieved through simple checks.\n\nAccording to Blockworks, Scam Sniffer's shared snapshot reveals grammatical errors on the fraudulent airdrop webpage, serving as a red flag for cautious users. However, it's crucial to remain vigilant as scammers adapt and refine their tactics over time.\n\nTo stay secure, always verify the source of such links. If a reputable entity is not the source of the airdrop updates, it is advisable to steer clear of such offerings.\n\nFurthermore, heightened caution is necessary, considering recent incidents where hackers compromised verified X accounts of well-known companies like Certik and Mandiant to promote crypto scams.\n\nEarlier this month, Certik experienced a similar attack on its X account, followed by Mandiant on January 4, 2024, raising concerns about the security of even the most established platforms.\n\nPhoto: Nahel Abdul Hadi / Unsplash\n\nTokenPost | [email protected]"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBaSFVVQllydUEwSC1RdUZkWlpSTXN0eW9nS2YzTFdyNHA3bWlBTlp3X0d4NUp3b01OOEtjRGVhM2syY2ZWTGZwOXc5NjFxQjd2YzhJMU9MZ0lGQmk3WnhMblV0VHg4YUoxNC1CN2JOMzVLVXE1N2VRVzVnTXFZQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum’s price surges despite the market-wide chaos - crypto.news",
        "content": "The crypto market witnessed decline after false news about a Bitcoin (BTC) exchange-traded funds (ETF), but despite bearish sentiment in the market, Ethereum (ETH) posted gains.\n\nETH gained 3% in the past 24 hours and is trading at $2,380 at the time of writing. The second-largest cryptocurrency even got close to the $2,400 mark as the hacked X account of the U.S. Securities and Exchange Commission announced the approval of a spot BTC ETF.\n\nETH price, whale activity, open interest and RSI – Jan. 10 | Source: Santiment\n\nEthereum’s market cap is holding strong above $286 billion with a daily trading volume of $17.1 billion.\n\nYou might also like: Spot Bitcoin ETF issuers file new AP disclosures with SEC\n\nAccording to data provided by Santiment, whale transactions consisting of at least $100,000 worth of ETH surged by 7.9% over the past day — rising from 5,790 to 6,242 unique transactions in 24 hours.\n\nOn the other hand, Ethereum’s Relative Strength Index (RSI) is currently hovering around 59, per Santiment. The indicator suggests that ETH is still in a good position for a further potential rally.\n\nWhile the increased whale activity suggests high price volatility, Ethereum could still hold its current price point if the RSI stays below the 60 mark.\n\nFollowing the price surge, according to the market intelligence platform, Ethereum’s total open interest (OI) increased by 4% over the past 24 hours — rising from $3.75 billion to $3.90 billion."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFB6S1pVMzYyMGZQWlRQYkI4TGdTaUlfVGJXTjBWMkdtZlJoX0xDbnAzaUpWZXV4NTVwdW5kc0c4cGZEUGpuREVocm1DR200REItX1R5TnBkczYwWnZ0TEhDTVZ5blJscU40VkJJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Why is Ethereum Classic (ETC) Going Up? - CoinGape",
        "content": "Ethereum Classic price is continuously going up for the past few hours and is now floating around $28, at the time of writing. It recorded more than 30% gains in the last 24 hours with almost 35% weekly and monthly gains.\n\nThe approval news of the first Bitcoin spot ETF is spreading like wildfire in the crypto industry. And, it is already showing strong signs of impact on all major cryptocurrencies including Ethereum Classic. Let us learn more about what is happening in the industry and why ETC is going up, in the present article.\n\nadvertisement\n\nBitcoin Spot ETF Approved, Finally\n\nThe long-awaited Bitcoin spot ETF was finally approved by the US SEC on 10 January, 2024. Entire crypto industry has been waiting for this news for several months. And, now that it is finally approved, several altcoins and Bitcoin are following an uptrend.\n\nThe anticipation of the Bitcoin ETF approval has itself brought considerable returns for Bitcoin since the past couple of months. From around $26,600 in October, 2023, Bitcoin’s value breached the $45,000 mark as soon as we entered January, 2024.\n\nWhile one of the strong reasons behind this price rally was the awaiting Bitcoin spot ETF approval, another reason is the upcoming Bitcoin halving event.\n\nAs the US SEC final judgment approached, a fake post was posted from the official X account. This caused a sharp price spike in the BTC chart. However, Gary Gensler, chair of the US SEC clarified that the US SEC account was hacked and the ETF approval post was posted by unauthorized individuals. As Gary Gensler stated that the post was fake, the BTC price dropped around 5% within a couple of hours.\n\nHowever, the US SEC finally approved the Bitcoin spot ETF application of Grayscale Investments. As a result, several altcoins like Ethereum, Ethereum Classic, Pepe Coin, and others are rising in value.\n\nEthereum Hits 20-Month High\n\nEthereum Price Chart on Jan 11, 2024\n\nSurprisingly, the Bitcoin spot ETF approval has more impact on altcoins when compared to Bitcoin. The BTC price rose slightly and briefly touched the $47,000 mark whereas the Ether price increased by around 10% in the last 24 hours and is trading above $2,600, at the time of writing.\n\nEthereum has hit its 20-month high as the last time it traded above $2,600 was in May, 2022. At present, Ethereum price is recording 18% weekly gains and 16% monthly gains. And, the ETH price is expected to rise further.\n\nMost of the investors believe that Ethereum is the next best cryptocurrency after Bitcoin. Because of its sophisticated technology and network upgrades Ethereum stands out from the rest of the cryptocurrencies. And, investors don’t hesitate when it comes to Ethereum in the market conditions like present.\n\nEthereum Classic to Reach the $30 Mark\n\nEthereum Classic Price Chart on Jan 11, 2024\n\nThe clear winner among all the altcoins is Ethereum Classic. The ETC price rose by 34% in the last 24 hours and is showing no signs of slowing down with its increasing trading volume. It is currently trading at around $28 and is just $2 away from reaching the $30 mark.\n\nSo far, Ethereum Classic is one of the top performing altcoins in the crypto industry after the Bitcoin spot ETF approval surfaced. In addition to the price, its trading volume is soaring by 276%, standing at $1.8 billion and implying that the price could surge further. Its market capitalization also surged by 34% and crossed the $4 billion mark today.\n\nThe approval of the Bitcoin spot ETF and the upcoming Bitcoin halving event are not only pushing the BTC price but also the prices of altcoins."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOVzc5NGNUWnJkeUtXZVBGTEYzN3Zpd2JGZWExVDR6Vk1OS2dDYUtMVTN1ZVpBcVdfU3RTUVdTMUEtOURaRU1aNnptRG9LYzdHUVZBd2x0NnQyRVZsaU90a3JKM2RIOFM2SEZxNWYyVVVDSmx2d1M4V1k5NjVCcmJuOVlxWFZtdFIydjVYYWxKZV9Jc3p1cGlyYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Classic (ETC) Rockets with 50% Surge in 24 Hours - Crypto Times",
        "content": "Ethereum Classic (ETC) has surged by 50% in the last 24 hours, reaching $31.93, outperforming Ethereum (ETH) which gained 11.24%.\n\n\n\nEthereum Classic ETC | Source: CoinMarketCap\n\nThis notable upswing coincides with the positive sentiment in the crypto market following the approval of the first U.S. Bitcoin exchange-traded fund (ETF).\n\nETC’s trading volume has seen a substantial increase, crossing the 1.23 billion mark, a level unseen since September 2022, indicative of heightened trader interest.\n\nThe ongoing rally, which commenced on January 8 and found support at $18.37, demonstrates the coin’s resilience and marks the fourth consecutive day of gains for ETC.\n\nNotably, an upcoming upgrade named Spiral, scheduled for January 31, 2024, has added to the excitement. The Ethereum Classic Spiral Hard Fork, detailed in ECIP-1109, is set to occur at block 19,250,000.\n\nThis development is seen as a significant factor contributing to ETC’s recent momentum, as the crypto community anticipates the changes introduced through the upgrade."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBCeTNfUEJETU9HLVVtQ0NQTGhpZ0RNTUE3ZFR3TWtVR0xzb1ZpeGI3UlhxU2dQZmlPWWZOSi1JWkxjSmdDUlZYSzVkbWU0eEFXQ1hrN2tLeHk5eWFvU0MtZVVOT0VyczU0cjN3bzcwbnZTdTRUMXRFbkZzVGtBUdIBgwFBVV95cUxPSVZjdjA1V1lwRng3dzhvNlFOZFNGRzlhTGFtX2RodnJnYTBXQnFucFI3NHJOazdEUzF5NHVlX0ZtaUc5djdULTdvSDExUDY2dEhCVmNBajIzbDhpUFp4S3dDRENhdVhPMi1VZml3X0piVFJ5dnBiTHVQTXBSRDJjM21pbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Key Reasons Why Ethereum Classic (ETC) Blasted Higher by 50% - U.Today",
        "content": "Ethereum Classic (ETC), the original version of Ethereum that split from the main network in 2016, has blasted higher by 50% in the last 24 hours.\n\nAdvertisement\n\nThe coin, which ranks as the 21st largest cryptocurrency by market capitalization, has outperformed its more popular sibling, Ethereum (ETH), which gained only 11.24% in the same period.\n\nAt the time of writing, ETC was up 50% in the last 24 hours to $31.16, gaining 55% in the last seven days.\n\nETC appears to be the biggest beneficiary of the crypto market's positive sentiment following the approval of the first Bitcoin exchange-traded fund (ETF) in the United States.\n\nAdvertisement\n\nAccording to Santiment, an on-chain analytics platform, Ethereum Classic blasted off following the Bitcoin ETF announcement, surpassing $26 for the first time since October 2022.\n\n📈 #EthereumClassic has blasted off following the #BitcoinETF announcement, reaching above $26 for the first time since October, 2022. Trading volume has surged, indicating major trader interest. However, $ETC sentiment still appears neutral for now. https://t.co/LhebnauCQX pic.twitter.com/wEf3ujmqH6 — Santiment (@santimentfeed) January 11, 2024\n\nETC surged higher in today's session, extending a larger rally that began on Jan. 8 after support was met at $18.37.\n\nSantiment reported that Ethereum Classic trading volume has increased, indicating major trader interest. It went on to say that ETC trade volume has not surpassed 1.23 billion in a single day since Sept. 13, 2022.\n\nETC will have gained for the fourth day in a row if the market closes in the green today.\n\nAlso, an impending upgrade, due on Jan. 31, is adding to the excitement surrounding the Ethereum Classic network.\n\nThe Ethereum Classic upgrade, dubbed Spiral, will take place at block 19,250,000. The Ethereum Classic Spiral Hard Fork is expected to occur on Jan. 31, 2024.\n\nEthereum Classic core developers have published ECIP-1109, which contains details of ETC's Spiral hard fork.\n\nThis document proposes the following blocks for implementing these changes on Ethereum Classic networks: 9, 957, 000 on the Mordor testnet (already upgraded in November 2023) and 19,250,000 on the Ethereum Classic mainnet (expected for January 31, 2024)."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOdmxKaW5QLTEtSS1kdmlrVEljVFRjQWdMSy04cmNicHVtLTdBNVhsa0d2cUpaTWZUZHJ0Rjd4SFg1U0V2WFFSZWNJN2VmRGlkRGhYTjF3TUpMcDJKY0lIcXdJNkVZU3FySXo5aDVHWmtZTzJEWk92TXZ3Tm5tOER4X0NGcVdNVk81LXdYRXJSM2lmMTE4MTFyLWtMcU94MXVGVHFiR1NMalVycGFPZW9VWUw4bVRhUjY50gHAAUFVX3lxTE9JMHJJY0lWNVdjdVRiaTVtSkw5WlVBYVJMT3A3RWVfZTg0SjJvc3ZDTlhVQmdocTk0bThHd2UxN0VEci1aOWYycTZLWUhpdzktRVRSbzJ2bW5DbF9DNGRpUi1HNDVfNi00bF9HTVZrdm5sTWw5empOUDdxcHg5bVA0Smpac1J6ZThLY1NsWk5pa1pOaEhDSXRuRXNvcnUyWUVBVVBjdFpwT3pYaFk0NHZDdGZ6Y3BVN0xhTVdQOUYtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Bitfinity Aims to Enhance Bitcoin Ordinals With An Ethereum Virtual Machine On ICP - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe red-hot Ordinal Inscription protocol continues to draw new developers who hope to put their stamp on the Bitcoin blockchain. The latest is Bitfinity, which aims to integrate its Ethereum Virtual Machine with Bitcoin. The grand plan, Bitfinity said on Thursday, is to support Bitcoin-enabled DeFi services using a sidechain on the Internet Computer.\n\nTo achieve this, Bitfinity has raised $7 million in new funding, led by San Francisco-based investment firm Polychain Capital and Connecticut-based ParaFi Capital.\n\n“As the demand to integrate Bitcoin increases, we believe Bitfinity’s EVM opens up the Bitcoin ecosystem to novel use cases and applications,” ParaFi Capital managing partner Ben Forman said in a statement. “We’re excited to support the entire Bitfinity team on their mission to enhance Bitcoin utility.”\n\nLaunched in 2021 by the Dfinity Foundation, Internet Computer (ICP) is an advanced blockchain-based computing system housed in a network of machines distributed worldwide. Internet Computer uses a unique consensus model called proof-of-useful-work, which aims to be more efficient than proof-of-work yet more secure than proof-of-stake models.\n\nAD\n\nAD\n\nBitfinity says smart contracts can hold and transfer Bitcoin and Ordinal assets on-chain using the Internet Computer's threshold signature scheme, known as Chain-Key.\n\nBitfinity’s EVM scheme is not the first time the ICP network has been used to handle Ordinal inscriptions. In November, Ordinals Marketplace Bioniq launched on the Internet Computer.\n\nBitfinity founder Max Chamberlin said the project is not meant to supplant Bitcoin but to show that Ethereum and Bitcoin devotees are not that different.\n\n“Justin Drake, an Ethereum researcher, once quipped, ‘Ethereum is Bitcoin,’ Bitfinity founder Max Chamberlin told Decrypt. “In the spirit of those words, I believe we are all Bitcoiners. Bitfinity is for everyone, and though some Bitcoin purists might shudder at the thought, they weren’t supportive of Ordinals or BRC-20 tokens anyway, and those took off to dizzying heights.”\n\nAD\n\nAD\n\nWhile Bitfinity may offer lower cost and faster speeds, the company will still have to convince Bitcoin purists and Ordinal enthusiasts to use their platform instead of minting on the blockchain directly.\n\n“Bitfinity doesn't change the fact that Ordinals are directly inscribed onto the Bitcoin blockchain, and as such, doesn’t change the core ethos of on-chain digital assets,\" Chamberlin said. “Rather, it just makes it cheaper to use them.”\n\nSince its launch last year, over 50 million Ordinal inscriptions have been minted on the Bitcoin blockchain. One of the most recent inscriptions was of a letter from U.S. Securities and Exchange Commission chair Gary Gensler announcing the approval of several spot Bitcoin ETFs.\n\nIn addition to Ordinals, Bitfinity said future Bitcoin plans include BRC-20 tokens in its protocol. The BRC-20 standard allows users to create meme-coins on the Bitcoin network.\n\n“If the lessons learned from Ethereum are anything to go by, many users will prefer a low-cost side-chain or L2 to run their transactions,” Chamberlin concluded. “So perhaps we could rejoin, in the spirit of Justin Drake, and declare—far from Ethereum being Bitcoin—Bitcoin is actually Ethereum through L2s like Bitfinity and much more beyond that.”\n\nEdited by Ryan Ozawa.\n\nEditor's note: This story was updated after publication to correct the type of consensus algorithm used by Internet Computer."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOSTFZTXhmUVZMYVBiVmhqMEFxUndTYzNWaWQwci1FekV5OVVNNVlfbjc0Vy1QRFpERTk3aXJoVDdHTHhsb1hLU09Oems5Yy1yVVRqMXBTemlTaEJ2bXVLMTlESThvYVZDUDF6emJjdWQtN2V1SGFRV2ZwTWoxamptb2ZtbDd1MmdBUzdRcFFGcUstWVVtS0c5VUc0MF81ZFJRMXQ0Z0RhRC1qeTN3SzB4Z2ctNFZUMHYyMkxwWtIBwgFBVV95cUxPRjFqQklhSDROX1RJb1BkclV1dW4zUW1WTUsyU284ZG80cnRuSDhVRWp3US1Ybm81RFh0cU1jRVh2aUN1QjM5cEFlNHc2eFBZQWZZZWtUUmlBa0JTWnNPeXZfLUk2ek5ydXN0S0paTUlUTkItYUNOSWJyOFBSNENHbTJVdHdZdmZ3Ym1MdzBjXzlhOXpTbndjeDBNSEtXQmRXSTV4OE4wZF85UlhNbVJZTm1vQTVKM0M4cDFLS09hejhIUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "First Mover Americas: Ether, Lido DAO, Arbitrum Gain on Possibility of ETH ETF - CoinDesk",
        "content": "With the crypto industry anticipating the SEC approving a spot bitcoin ETF as early as today, BlackRock (BLK) and ARK 21Shares both cut the fees for their proposed ETFs, joining rivals who announced reductions yesterday. BlackRock said it will charge 25 basis points on net asset value in a new S-1 filing on Wednesday, having previously revealed a fee of 30 basis points on Monday. The asset-management giant is offering a promotional rate of 12 basis points on the first $5 billion during the first 12 months after listing. ARK 21Shares reduced the fee by 4 basis points to 0.21%, having previously said it would charge 0.25%. The firms are waiving the fee entirely for the first six months or the first $1 billion in assets, whichever comes first."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPM0NpcWFTVXR3UWZ0Q09fYWtsSy1FamY2VkVsZHZkWWJfRm54Z2YyOGM4M1RwNGwxQ3FncTlFcUdOYmZTTE5CNUtHNWdDUzlaVnRXWmVSWDFlTjFiYnRRNkNQb2NSc2NiVEEzSGh0Qk5UeDFjcGp3QUplcS1MZXFsZTBUN3Z0c0piTDF0TkM4QU1QeEZEVXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ether Rallies on Optimism Following Spot Bitcoin ETF Approvals - Unchained",
        "content": "Ether has risen as much as 9% in the last 24 hours on expectations that a spot Ethereum ETF will get approved next.\n\nThe U.S. Securities and Exchange Commission (SEC) finally approved spot Bitcoin exchange-traded funds (ETFs) on Wednesday, and now optimism about the prospects of a spot Ethereum ETF approval is driving a rally in ETH prices.\n\nETH prices were up about as much as 9% over the last 24 hours before settling slightly. As with Bitcoin, futures ETF products based on Ethereum have already been approved and launched, while applications for spot ETF investments are awaiting a decision by the SEC.\n\n“ETH’s recent outperformance relative to BTC is a nod to the market’s anticipation of a spot ETF approval,” Mark Connors, head of research at Canadian digital asset management firm 3iQ, told Unchained in an email.\n\nRead more: Why Spot Bitcoin ETFs Are (But Mostly Aren’t) a Big Deal for Crypto\n\nBitcoin was roughly flat over the last 24 hours after gaining as much as 6%, but optimism about a spot Bitcoin ETF has been driving prices up higher for some time now, with Bitcoin rising more than 80% since BlackRock and Fidelity first stoked enthusiasm last June by filing their ETF applications. Overall, Bitcoin has gained about 174% over the last year, compared to Ethereum’s gain of about 99%, according to CoinMarketCap.\n\nAccording to analysts, this disparity is largely due to the fact that the narrative driving Bitcoin’s rally — optimism around the spot Bitcoin ETF approvals— directly relates to Bitcoin rather than crypto as a whole. But now that attention is shifting to ETH ETF approvals, will ETH experience the same type of huge rally?\n\n“I would say that it’s not going to be the exact same because Bitcoin’s qualities are more fundamentally oriented towards gold where it is secure, it is a stored value. It is a money,” said Connors., He later noted that Ethereum is more of a decentralized, dynamic platform than Bitcoin.\n\nWhat’s Next?\n\nAfter approving a slate of Ethereum futures-based ETFs late last year, the SEC now has until May to decide on spot ETFs, including offerings from VanEck, ARK Invest 21Shares, and BlackRock.\n\n“Investors are waiting for the spot ETFs for Ethereum exposure,” said Neena Mishra, ETF research director at Zacks Investment Research, during a call with Unchained. “Ethereum futures ETFs made their debut late last year, and we’ve seen almost no interest from investors. That was not a surprise because investors want the real thing.”\n\nRead more: Spot Bitcoin ETF Approval Sparks Altcoin Rally\n\nSEC Chair Gary Gensler has said that Bitcoin is the only digital asset that isn’t a security, which could make it harder for Ethereum to get approved. But Mishra doesn’t think that stance will stand in the way of spot ether ETF approvals since the futures-based ETFs positioned Ethereum as a commodity. Gensler was also hesitant about the spot Bitcoin ETFs, as evidenced when he posted an X thread warning about the risks of crypto investments earlier this week, but the approvals still happened.\n\n“I see very low chances of [the SEC] not approving the spot Ethereum ETFs,” Mishra noted."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxNWFZKQXJXX3J6RXZhRnlNNTNvMGNxalFfTGNObTNhY0RmY0pTU2U0azNIMlNqSlVqdzdXVUN3UGxUdGlDMDFYaVZNNFpnOEMtSktVXzh1LUNzZ1dKUTZ0eHotZXF0bGlqQ0pJYm16b1Jac2VTeG56UUl1WWRKT25vWEZ3TGlydjY2MUdNSVpEWTM5SkZaTXRLOGFKY05IQkdBSjJ3cm95YXB4b0V6UkNnMlIzYUE0TFZycDJra05ZeVpobG5HRzRtSWZEY2NwLWpjQVozVU8zUFA0YkhNeS13RDVB0gHnAUFVX3lxTE9oMkdlWGpwRTVGVzFlM19jTGJKX0pNeG93U1p3T1psNUkzYVZMcndVUDJRZXJmT2pfQ081SnJ0WUYtOVo4Y1dBT3lZemZmOWVWalVRVWhsa0lrdUVwLTBVY3o4YVR0U0pLWDVJdXpYWVBuR3FQcFJYbVQwYXlFMWVJdmhqcnNHQ1B6cnN5ZHlrWUxHU3Q4NlYySjUxTTFtX1lsZWlpVklVN2w1MHhzeUVGcHJINzY0SWNMTEdTcmEzZ3NiSlR2emdBV0xkc1dVSF93Z0tXVW9sRmpEYlp0b25xOGlVblpOWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Classic Price Forecast: Chances of 21% correction wane on bullish market momentum - FXStreet",
        "content": "Ethereum Classic price formed a double-top reversal pattern that hints at a 21% decline.\n\nPrice indicators highlight the potential of the pattern failing due to bullish broader market cues.\n\nThe anticipated spot Bitcoin ETF approvals will likely have a bullish impact on altcoins, benefiting ETC.\n\nEthereum Classic price was seemingly adhering to the micro bearish reversal pattern, which failed despite the recent correction in the crypto market. The short-term outlook ahead of the spot Bitcoin ETF approval is now looking bullish as ETC is bouncing back from the crucial support of $19.33.\n\nEthereum Classic price notes a bearish reversal pattern\n\nEthereum Classic price on the 4-hour scale invalidates the double-top bearish reversal pattern that has been observed in the past four weeks. This pattern consists of two peaks or tops of nearly identical height positioned closely together, with a trough in between. It suggests a possible shift in market direction.\n\nThe potential trend reversal is indicated by the price encountering a resistance level on two separate occasions without successfully surpassing it. This is often interpreted as a sign to consider selling or initiating short positions as further declines in the market.\n\nIn the case of Ethereum Classic, this double top was formed at $23.42, with the neckline or support level of the pattern being marked at $19.33. This is also the breakout level, and an extended decline below this line would confirm the bearish reversal pattern. Furthermore, a successful pattern would only be observed when ETC falls to the target price of $15.24, which, according to the pattern, would register a 21% decline on the 4-hour chart.\n\nHowever, Ethereum Classic price took the other route and, instead of falling through the neckline, bounced off it to note minor recovery, trading at $19.90 at the time of writing. Although this does not rule out the potential for decline, the price indicators do suggest invalidation of the pattern is likely, too.\n\nETC/USD 4-hour chart\n\nThe Relative Strength Index (RSI) and the Moving Average Convergence Divergence (MACD) indicator are giving out mixed signals, with the former still sitting in the bearish zone and the latter noting a bullish crossover.\n\nEthereum Classic RSI and MACD\n\nIf Ethereum Classic price continues the current path and broader market bullish cues kick in, ETC could move sideways or upwards beyond $20 and invalidate the bearish pattern.\n\nOn the other hand, if the Ethereum namesake falls through the neckline and falls below $19, the bullish thesis would be invalidated, and the reversal pattern could be deemed mildly successful since absolute success would warrant a 21% correction."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBBaEwtUHVSbnRuVW9NM0tSUHhfVjJyQk9rdUUxbXJJUVdTOEozeTlEMlZyTlluMl9Ka1FtckZWMGtxajZGcURTV0JBY0pIN2RoQkZ5MTMzUDJRbDBUOEktQkY5bVR0ZGYzTmpWVjFIcmJZZk5NTDVZb1EzaU5fd9IBgwFBVV95cUxPWjFHdW9zVnF2NGliVlQ3VS1Xa1hFSzU3QzQwc1NYaDBsSV9PdkdmOVhncU8wLWlQLTZfbzRlYlNPOThqTjU4ZnpEYmJWTDV4NTFPbHlVbE44YnkyUmNiYnJIWFhpcEpZQVBIQXA0YUxvUEk1LVVpOUxOYVdocUprTTU5TQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Commends $100M Boost to Ethereum Ecosystem - U.Today",
        "content": "Advertisement\n\nOver $100 million has been distributed in the third round of Optimism's Retroactive Public Goods Funding (RetroPGF).\n\nIn a recent post on the X social media platform, Ethereum founder Vitalik Buterin expressed his admiration for Optimism's ongoing dedication to funding public goods.\n\nThis initiative is particularly significant as it supports developers and other contributors to the Ethereum ecosystem who may lack a traditional business model.\n\nHow it works\n\nOptimism's RetroPGF has been described as an economic flywheel that propels the Optimism Collective forward.\n\nAdvertisement\n\nIt functions by rewarding individuals and projects that build essential infrastructure, tooling, and content, thus enabling the ecosystem to flourish.\n\nThis round of funding has acknowledged 501 projects and individuals for their positive impact on the Collective.\n\nThe initiative shows the value of community-driven development in the cryptocurrency world, where projects are often collaboratively built and maintained.\n\nA diverse range of projects\n\nThe beneficiaries of this round of funding include both well-established names in the Optimism Collective and newcomers who are contributing to the future of the ecosystem.\n\nIn total, 643 projects have received awards across the three rounds of RetroPGF. This demonstrates a commitment to building a self-sustaining economic system that consistently rewards contributors.\n\nThe process involves significant community participation. This includes badgeholders who vote on the allocation of awards, and teams dedicated to building the public goods infrastructure.\n\nOptimism has also announced that more rounds are planned for 2024, signaling continued support for this experimental and iterative process."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNOWYybklzWE9YdXBNVUdGd3BaVll3UnBuWDhMeEtlTDM2VEtiN3VEbDkzdk5vOXpCdkQ3cFBRbkhxR0JYd0haM3RLQlBPWWlldzQ1VWlTWkN6bjEwQjdxUGdXbXBickJCM25wR2wzSmJpM2E1b0pLM1l2enZONGxiRjhTdzRzcGI1Nlg2dEV2eEV2d2QydEFxT9IBngFBVV95cUxNSFZwLUh1QnczYXFuVVlnWW9oV1BSTndHRmFHelVxZDV6ZEdSdXFrNTNZUTY5ZEZod3ZadjA2LUpfNlZWd0V0aVBfSVcyajJ0MlVBdHB2a182WV8yNVE2NEZrODkzdTY5ZXNKdU1lNWJidTdZc21TdktaVllscExiOGJZeDNLMTBkYVVRU2ZKcTFjLS1aalo1bUlpdTh2Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Whale Accumulation Surges Ahead of Spot BTC ETF; Is $3K Near? - CoinGape",
        "content": "Ethereum Price Prediction: Ethereum, the second-largest cryptocurrency, currently shows a lack of bullish momentum contrary to the generally bullish sentiment around Bitcoin spot ETFs. The ETH price has been resonating between the $2400 and $2140 horizontal levels for the past five weeks, with the overhead supply preventing the buyers from a higher rally. Will potential approval from the US SEC bolster the Ether price to escape this uncertainty?\n\n$2400 Breakout Will Trigger a Direction Rally\n\nA steep support trendline leads to the current recovery trend in the ETH price.\n\nA potential recovery may face new resistances at $2680 and $3000\n\nThe intraday trading volume in Ether is $20.8 Billion, indicating a 68% gain.\n\nAn ascending trendline in the daily time frame chart shows the Ethereum price recovery is intact and the current sideways trend is likely a post-rally consolidation to recuperate the exhausted bullish momentum.\n\nadvertisement\n\nInterestingly, the Ethereum whales have accumulated nearly $1 billion worth of Ether despite its underperformance relative to Bitcoin. A recent tweet from renowned crypto analyst Ali Martinez reveals that the Ethereum smart money has significantly increased its holdings by accumulating more than 410,000 ETH tokens during the past month(December).\n\nThis accumulation amid the crypto market’s progress towards the first spot Bitcoin ETF hints the ETH may also witness a major impact of US SEC approval as the potential for spot Ethereum ETF will also accelerate.\n\nBy press time, the ETH price shows a 3.77% jump and teases a bullish breakout from the $2400 resistance level. If buyers succeed in closing a daily candle above this barrier, it could lay a solid foundation for additional upward movement.\n\nSuch a breakout could potentially result in a 10% rise in ETH, setting its next target at around $2,680. Following this, a prolonged recovery could target the $3,000 and $3280 mark.\n\nThis Support Prevents ETH From Major Correction\n\nOver the past two months, the ETH price has been receiving dynamic support from an ascending trendline. The coin price rebounded several times from this support indicating the buyers are actively accumulating at a dip which is a key sign of sustainable recovery. Thus, it also indicates losing this support could intensify selling pressure and trigger a new correction in this asset.\n\nBollinger Band: An uptick in the upper boundary of the Bollinger band indicator suggests the bullish momentum is strengthening.\n\nAverage Directional Index: A low value of ADX(15%) hints the ongoing consolidation has managed to offer buyers sufficient break to kickstart a new rally.\n\nRelated Articles:\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPOEswMzlLSzBYTVdoaDUxdlhmc2JDVWgtVXBqREdjQS1hWGtGSWdabVhhRDV0RWthSHpGUzJHU2VRYXFlV1dLS2pjeTMzbExBd1E3SlVoS2pjRlFTTG1DSTFnYjhPYnhZNFZtNW50cWpYX1E2OEZCOEJUZGdTRTh2RFItdmpQeEFCUXfSAY8BQVVfeXFMTUhoTEJaX0VmRUpzenVVY1ZHRTYyclRXd25XeVhQMWpxb1lRLUQ0UXNoX1VRTVpjZEhoN1A0Yy1QMk4xNTlPSDZDQTBrS2tSczdBa29tRF8wbWZmYnVPdEZ0S2d3UTdLVjhhTzY3d1dQa1hWUVlIY05Ob1o3LTJlNG9DM2szRTZOaDBFX0RCWDA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "ETC Price Jumps 34% As Ethereum Classic Trading Volumes Surge - CoinGape",
        "content": "With the approval of the US Bitcoin ETF, altcoins have registered a strong rally while Bitcoin rests. Though the Ethereum price surged 10%, its off-shoot Ethereum Classic (ETC) has registered even greater gains. The ETC price is up by a staggering 32% trading at $27.74 with a market cap of $4.05 billion.\n\nThe Ethereum Classic Trading Volumes\n\nIn the wake of the Bitcoin ETF announcement, Ethereum Classic (ETC) has experienced a significant surge, surpassing the $26 mark for the first time since October 2022. The surge in trading volume suggests substantial interest from major traders.\n\nadvertisement\n\nDespite the notable price movement, the sentiment surrounding Ethereum Classic remains neutral at present, as indicated by on-chain data provided by Santiment. Investors are closely monitoring the developments in the Ethereum Classic market following the recent Bitcoin-related news.\n\nThe ETC Price Bullish Breakout\n\nIn the weekly chart analysis, Ethereum Classic (ETC) has shown a departure from the lower high formation that characterized the previous bearish trend until 2022. After a year-long consolidation range throughout 2023, ETC struggled to surpass the resistance at $23. A recent resurgence, however, has resulted in a bullish breakout from the consolidation range, signaling a notable trend reversal for Ethereum Classic. This breakout is seen as a significant entry point for traders on the sidelines. The heightened market activity has contributed to a remarkable 250% increase in the 24-hour trading volume, supporting the sharp upward movement and hinting at the potential continuation of an uptrend. Currently trading at $28.43, Ethereum Classic has formed a bullish engulfing candle in the daily chart. The breakthrough above the $25 barrier positions Ethereum Classic for a sustained bullish rally. The rising sentiment in the market is fostering increased risk appetite among investors, contributing to the broader uptrend in the altcoin market. Under favorable market conditions, Ethereum Classic’s price trajectory may lead to a breakout beyond multiple resistance levels, with a potential target of $40 on the horizon. However, should ETC struggle to maintain its momentum, a retest of the $25 level could be in the cards. Traders and investors are closely monitoring market dynamics to gauge the sustainability of Ethereum Classic’s current bullish momentum.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPQlRXdmhRSXByaDRWczF2OUhEOXc1cnV6cFFCMDB4djJIWmw1OWtMaWRac0ZrOWNnU1hnRFZzQVk4LXQ2dVczRXphZ0xBTEdRX09XbnppZ284WGdHRVhaZTBkZFFGUTNLWjZyNzJZTklWUXVJNkVDQmh4NEhRSld2TU94U1dDUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Classic (ETC) Rockets Skyward: Notches 34% Surge - Watcher Guru",
        "content": "Ethereum Classic (ETC) has emerged as a standout performer in the cryptocurrency market, registering an impressive 34% surge within the past 24 hours. This surge not only surpasses the performance of major cryptocurrencies like Bitcoin and Ethereum but also positions Ethereum Classic as the top performer among the 100 leading cryptocurrencies by market cap presently.\n\nRemarkable Rally of Ethereum Classic\n\nWhile Bitcoin recorded a modest 1% increase and Ethereum observed a substantial rise of over 9% in the last 24 hours, ETC’s surge has garnered significant attention. This noteworthy upward movement in price has elevated ETC to a prominent position. It has further established it as the leading performer among the top 100.\n\nBitcoin’s recent upswing, triggered by the announcement of a Bitcoin ETF, has propelled its value beyond the $26 mark for the first time since October 2022. The accompanying surge in trading volume indicates considerable interest from major traders.\n\nAlso Read: Robinhood CEO Announces Plan to List Bitcoin ETF Soon\n\nSustainability of Ethereum Classic’s Momentum\n\nThe crucial question on everyone’s mind is whether ETC can maintain its impressive momentum. According to Changelly, a cryptocurrency exchange platform, ETC is anticipated to stay in positive territory over the next few days. The altcoin is predicted to reach as high as $22.59 on Saturday, Jan. 12, following a 5% daily surge. The average anticipated percentage surge for Ethereum Classic in the upcoming days ranges between 3-5%.\n\nSurging Trading Volumes and Neutral Market Sentiment\n\nIn tandem with Ethereum Classic’s surge, there has been a significant spike in trading volumes. It escalated by 234% within a single day and reached a total of $1.54 billion. Despite these substantial movements in price and volume, the overall sentiment surrounding the Ethereum Classic remains neutral. This was indicated by on-chain data provided by Santiment.\n\nInvestor Watch: Monitoring Ethereum Classic Market Developments\n\nInvestors are closely monitoring the developments in the Ethereum Classic market. This is especially true in the aftermath of recent Bitcoin-related news that has stirred the cryptocurrency landscape. As Ethereum Classic continues to defy market expectations, its impressive surge and heightened trading volumes have captured the attention of enthusiasts.\n\nAlso Read: Ethereum Breaches $2,400 While BTC Bleeds, Will ETH Hit $3,000 Soon?\n\nThe recent 34% surge of Ethereum Classic serves as a testament to the dynamic nature of the cryptocurrency market. As ETC takes a prominent position with its remarkable performance, the upcoming days will play a pivotal role in determining whether it can sustain its momentum and potentially instigate further market developments. Investors are advised to remain vigilant, stay informed about the evolving cryptocurrency landscape, and closely monitor any subsequent news that may impact Ethereum Classic’s trajectory."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNUEVPdF92UjdSLUNpbVpJamxhczE5VENpdHg4QWZTX3NLMFJNQ2dVU3RQcHA5azc4UmRjNjhlUHNxRjlCY09hTE5JMlFUaVZfR2NMRjBKMGRJMGtiVkFmV3lCWDEwUUU4T04tT3dEdGQ2bjUwU3NQNGpDZ2lzN0xJaDBhS2tJUjgzSWEzZ0VMQUJHREdwcTZMZW1NMFlvS01Vcm1KQdIBqgFBVV95cUxNNE9pRkprUlUzaFpQZGFnVHNPRTNodEQ2ZHQwUGpWaGxWVUhOWUR5N3hOU09McFhyWkZWV3Bod05tTUV4Y0QxSXpYcnVGdDRfaUFVeDI2MndFQ0dZaS11V0lRU0JaMDg2ZWZNUGp4eGhXN3V3aUtVM0hsZTdzTVY0MF9aNmdveXNvZTlHMWZEZU5WeDZXR0hJVWxHRU5FOGRqUjRmdlJMUDNRdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Tests $2.4K as Bulls Look to Finally Take Control: ETH Price Analysis - CryptoPotato",
        "content": "Ethereum has been increasing in the past day in the hopes that an ETH ETF might be next in line on the SEC’s agenda.\n\nMeanwhile, the probability of a further bullish continuation seems to remain high, considering what the charts are demonstrating.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily timeframe, the price has been trapped between the $2,100 and $2,400 levels over the last month. A breakout from either side of this range can determine the trend’s short-term direction.\n\nA bearish breakout would likely result in a decline toward the 200-day moving average, located around the $1,900 mark. On the other hand, a break above the $2,400 level would pave the way for the price to target the $2,700 resistance zone in the upcoming weeks.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour chart, the recent choppy price action becomes much more clear. The cryptocurrency has tested both the higher and the lower boundary of the range several times.\n\nCurrently, the price is testing the $2,400 resistance area. A breakout from this level would result in a rally higher toward the $2,700 area, while a rejection could lead to a drop back to the support zone at $2,100.\n\nSentiment Analysis\n\nBy TradingRage\n\nEthereum Open Interest\n\nWhile Ethereum’s price has been going through a consolidation phase, the underlying dynamics of the futures market are displaying an interesting sign.\n\nThis chart demonstrates open interest, which is one of the most essential metrics for future market sentiment evaluation. It measures the number of open futures positions. Higher values are typically associated with higher volatility and vice versa.\n\nIt is evident that while the price has been moving in a tight range recently, the open interest has dropped considerably. A significant decline in open interest without a price plunge is considered a bullish signal, as it hints at the fact that the futures market is not overheated anymore, and the price can continue its gradual uptrend in the coming weeks."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPbVRDV1JGaklwOU56YWczR1N1enkyWVNxUEEyal9acFZZMFhGa21QZG4yQTM1NVUwQjRvVFBnM281c2ZtbTlpYjVFV0FHNmNUd2RrdnFRejhVYXJyTUkyUnJDQ1Y4UENrclM4cmI5RWU2RHdJRl8wNnBKRThFUmlZT0lrQllYVXhp0gGOAUFVX3lxTE5hN0xUZU93d1NkenlBYVNtdHVBM3JHV2lpbzlxQnBvOG52WnhsMUtELWI3UzNFWVV5VnBXVjR2TGJLVzdkTU1tYnFVWGJUWHpMQ1Q4cTZHU3NqUV9DMlFXQzVWY2JHTDJBNWdHSU1nckhnSFlpblRfRWxOeFJrNnY1LUtZOXZjdmwyM2lvZXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum: All about ETH ETFs, Vitalik’s visions, and more - AMBCrypto News",
        "content": "Ethereum surged by 5% amid Bitcoin ETF excitement.\n\nVitalik Buterin proposed a gas limit increase for Ethereum’s network efficiency.\n\nThe cryptocurrency market experienced a surge in excitement as the Bitcoin spot ETF approval resonated across various assets. Following this, Ethereum [ETH] recorded a 5% price growth within the last 24 hours, fueled by the positive sentiment in the market.\n\nHowever, what are the chances of an Ethereum ETF getting approved?\n\nETF saga continues\n\nAnticipation is building around the looming deadline for Ethereum’s ETF decision, set for 23rd May with VanEck’s spot ETH ETF.\n\nNew deadline to obsess over just dropped May 23rd is the final deadline for decision on VanEck’s spot ETH ETF pic.twitter.com/dgi5EVbPeQ — Will (@WClementeIII) January 10, 2024\n\nWith the approval of 11 BTC ETFs, it is expected that ETH ETFs would have a sure shot at SEC’s approval. The approval is also expected to have a palpable impact on the state of ETH.\n\nThere could be also be massive accumulation of ETH prior to the approval.\n\nVitalik chimes in\n\nSeparately, in a recent Reddit ask-me-anything (AMA) session hosted by the Ethereum Foundation’s research team on 10th January, Vitalik Buterin brought attention to the gas limit, proposing a modest increase to enhance network throughput.\n\nButerin highlighted the nearly three-year period during which the gas limit remained static, suggesting that a 33% increase to around 40 million from the current 30 million could contribute to the network’s efficiency.\n\nThis adjustment aligns with Buterin’s vision for maintaining Ethereum’s technological advancement.\n\nThe proposed increase in the gas limit holds significant implications for Ethereum, as it aims to address scalability challenges and enhance the overall performance of the network.\n\nBy accommodating more transactions within each block, Ethereum can potentially lower transaction fees and improve user experience. Only time will tell whether this will help Ethereum attract more users to its network.\n\nHow is ETH doing?\n\nAt the time of writing, Ethereum was trading at $2,415.34, reflecting a 5.07% price growth in the last 24 hours.\n\nMoreover, there was a surge in trading volume and an increased network growth. This showed that the spike in ETH’s price was being driven by new addresses.\n\nHow much are 1,10,100 ETHs worth today?\n\nHowever, the velocity at which ETH was trading had declined which meant that the number of addresses transferring their ETH declined materially in the last few days.\n\nThis could act as a hindrance in the price movement of ETH going forward.\n\nSource: Santiment"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPb3UyZWhERGotQVNKUlQzck4tR2JrSnkzcmoxQ2JGMlctZFRjNGd5Y09yYUU5TFkyaUcyTXhvY1VnTkpWdTMxOWRyanVrbU1SN3JVRWhnZFRGMGVzYlcxSTQ0dG94NVFOYWZKOTFkdS1tOV9HU0JRcWY3WHpSLXp3WUJxXy1KSXhPby1NM0JBSFV0THoteHVCOUlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "The fake approval of the Bitcoin ETF greatly benefits Ethereum! - Cointribune EN",
        "content": "Wed 10 Jan 2024 ▪ 3 min read ▪ by Eddy S.\n\nThe crypto market has experienced intense turbulence in recent days, following a false announcement that teased the imminent approval of a Bitcoin spot ETF by the SEC. While this misleading information has disenchanted Bitcoin investors, it has paradoxically energized Ethereum and many altcoins, which have seen their trading volumes explode upwards.\n\nEthereum and Altcoins Boosted by Optimism over Bitcoin ETFs\n\nDespite the Bitcoin ETF illusion turning against the queen of crypto, Ethereum cheerfully crossed the symbolic threshold of $2,400, with a 2.8% increase. More importantly, the decentralized cryptocurrency benefited from very high trading volumes, indicating growing investor interest in this digital asset with multiple use cases.\n\nMany altcoins like Avalanche, Solana, or Cardano also jumped between 3 to 8% simultaneously. This bullish surge reflects the market participants’ optimism regarding a future approval of a Bitcoin spot ETF in the United States. Such a decision would pave the way for massive inflows of institutional capital, benefitting the entire crypto ecosystem.\n\nBTC Struggles to Bounce Back in a Volatile Market\n\nOn the contrary, Bitcoin is struggling to recover from its speculative excesses, after falling by more than $2,000 within 24 hours. Briefly surpassing the $47,000 mark, the original cryptocurrency fell back below $45,000, reflecting the market’s nervousness after the ETF hoax.\n\nSome are hoping for support around $46,200, but caution remains advisable. Bitcoin is now trading around $45,000, far from its all-time high in November 2021. According to many analysts, this could be a “bear market rally,” a faint uptick in a sustained bear market. Others are more optimistic about a lasting rebound.\n\nBitcoin’s Dominance Erodes in Favor of Ethereum\n\nThese sharp jolts demonstrate the gradual emancipation of Ethereum and altcoins from Bitcoin, despite its still overwhelming dominance, accounting for about 53% of the crypto market cap. Boosted by record volumes, Ethereum and others are now progressing according to their own dynamics, little affected by Bitcoin’s transient downturn.\n\nThis tumultuous episode reminds us of the volatile nature of the crypto Wild West, prone to extreme fluctuations based on false news or unverified rumors. It also marks Ethereum’s spectacular breakthrough, which is emerging as the most serious alternative to Bitcoin, even if there is still a long way to go to dethrone the crypto veteran. The coming months promise to be exciting, with the prospect of a “flippening,” a reversal of the established order!\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNSE02UVdGT2dCZ3NSQ0NsUzNtWlFiRmhOaGpVVEJ3VkxOckFFc1IwcHJzRTV4dG50QS1VdkQwNlhZX2xpdnktd0o2VEtlZWNiRVVrQzJfeXVQSGdDaXpOZW9pNWVQNEtXaXdhelJTV2VBOHdvd0RUb2I5a3Y2WHZCaldBd09vdWlQMjBibS15SW9rZnBlXzdFNFVtbi1uWHZPYVY1TkxwTnhnUVJMTFp5VlJoYUtxYWhnbTM3andPQ1FSRzhnVEEtUXJKTGwwYUtmNjVBTE9vRdIB3AFBVV95cUxPWjBVckRRZl95NnFlX2dHWmtSbnhpbUh4Wi1vZDR1Ry1Ud21yOXRHN2pUVlFyN2NzWXB1b05veG5wSC1xSGRPY01fMnMwdnFDZFZOSTFnQ2lrdFFRMEVoOTRMOUdfbjJXTHYwQzMtYzFDYUhfRUNkNndnOHBwblUyRFZfd0pGaE5RM05vdUJpd1lDcDBhQWFFUXNRX2pBcGRydnNZU0I1UVdLTl95TUp5LWpyTmZyVnBHLURFQzVxbTUxeUFGZ2FkRUdKVXU0TFZXNHoxcmtBeW5jdWZz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Bitcoin, Ethereum & Cryptos — Asian Wrap 11 January - FXStreet",
        "content": "Ethereum (ETH) price is trading with a bullish bias, coming on the back of anticipation that an ETH spot exchange-traded fund (ETF) will come to the market shortly after the US Securities and Exchange Commission (SEC) has approved the launch of the BTC ETF. The overflows from the ETH market have spilled to the blockchain’s Layer 2 (L2) tokens.\n\nBitcoin Spot ETF was approved by the US Securities and Exchange Commission, marking January 10 as a historic moment for BTC holders. The approval has triggered fee wars among issuers and experts weigh in on who is likely to survive in the long term, offering near zero fee to market participants.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNSEQxLUgzeVE3cWRteC1LN01MampRVW8xRUNEU1NDRkRQVGxIMjBHRW5hV216R2VIdDhUaVNQQ21UN2lCUVdFTXBNOWw0bE9RN3pQaDA4eWwwN2F0OHFqNzN1MGg1Q2kwUUZwdmlhbUs3LURnWjZnZVJDUl9tWXBPX25rZVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "ETF Bitcoin Spot: Ethereum and XRP could follow! - Cointribune EN",
        "content": "Wed 10 Jan 2024 ▪ 3 min read ▪ by Fenelon L.\n\nThe SEC’s imminent approval of the first spot Bitcoin ETF in the United States could herald a new era for cryptocurrencies. According to Steve McClurg, Chief Investment Officer at Valkyrie Funds, ETFs on Ethereum and Ripple could quickly follow.\n\nAfter the Bitcoin ETF, is it Ripple and Ethereum’s turn?\n\nConfident about the future, Steve McClurg, Chief Investment Officer at Valkyrie Funds, stated in a recent Bloomberg interview that he “would not be surprised to see spot Ripple or Ethereum ETFs come to market” following the approval of the first Bitcoin Spot ETF.\n\nThis optimism is based on the impending decision by the Securities and Exchange Commission (SEC) to authorize the first exchange-traded funds (ETFs) that directly replicate the price of Bitcoin, expected this week. Valkyrie’s ETF is among the concerned products.\n\nMany observers see this as a major positive signal for the entire crypto sector. This regulatory advancement could pave the way for mainstream investors to adopt financial vehicles directly backed by cryptocurrencies.\n\nWith this precedent, Mr. McClurg anticipates that ETFs on other significant digital assets, like Ether or XRP, will quickly in turn receive the regulatory green light, capitalizing on the growing interest of investors in the asset class.\n\nA Growing Interest from Investors\n\nMr. McClurg emphasizes that investors’ interest in diversifying their crypto holdings remains increasingly strong. He specifically mentions the recent decision by Grayscale to add Ripple to one of its publicly traded trusts.\n\nSuch publicly-focused financial vehicles facilitate access to cryptocurrencies for novice investors, he believes, paving the way for mass adoption.\n\nThough confident, Mr. McClurg admits that the regulatory approval process remains unpredictable. Nothing is yet entirely certain regarding the launch of the Bitcoin ETF.\n\n“Anything could still happen“, he said, acknowledging that the regulatory environment remains complex. Administrative or political hurdles could still postpone the deadline or complicate the efforts of other players wishing to propose new crypto index funds.\n\nHowever, the potential validation this week of a first Spot Bitcoin ETF nonetheless seems to signify a turning point. If confirmed, this regulatory step forward could unlock the arrival of a new generation of crypto investment products, finally making these assets accessible to the general public.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOaFpranJYYUEzTVFreXhwOGg3ME13N1pBTGduTEl3SkZNWjk5QTBwb0todk0wQUlkM0hYbWI1Njl0NnRvN0U1allraGM2OWp3YnNtTzJKZUFCY1RPRW9XNnhEWlZEUk1XRmpEOGNoVm9oYTVOZl9zSDAyaHF3ZzdETG9fRGZwdjU3djRmWDJGc3dUdkZ4WFFVNk14Zkk4Nm8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 02:03:20 GMT",
        "title": "Developer Thinks The Ethereum \"Ultrasound Money\" Narrative Exaggerated: Is It? - Bitcoinist",
        "content": "The term “ultrasound money” has been thrown around quite a bit in the Ethereum (ETH) community, often describing the network’s potential to become a deflationary asset with better tokenomics than Bitcoin (BTC). While some proponents believe this narrative is well-founded, others argue it is overstated and based on overly optimistic assumptions.\n\nIs The Ethereum “Ultrasound Money” Narrative Exaggerated?\n\nIn a post on X, antiprosynthesis.eth, a developer, challenged the “ultrasound money” narrative, arguing that it is often accompanied by jargon that may conceal the reality of Ethereum’s monetary policy. Specifically, the analyst believes the narrative is a bit “overboard” and loaded with “a bunch of pseudo-scientific hocus pocus” that might mislead ordinary users.\n\nAdopting a neutral view, antiprosynthesis.eth, Ethereum’s monetary policy is, most importantly, designed to be sustainable without the dangerous pitfalls of hyperinflation or excessive deflation. The developer argues that striking a balance in token emissions is critical.\n\nIn Ethereum’s case, this is achieved by burning a portion of gas fees. Following the activation of EIP-1559 in 2021, the first smart contracts platform changed its bidding system, creating a system where the network sets a base fee with the allowance for a user to “tip” the validator. The base fee is burnt, helping the network become deflationary–or, as researchers argue, sustainable.\n\nIn Bitcoin’s case, the network will continue to issue new coins to miners until all the 21 million BTC are distributed. This will be more than a decade from now. To achieve this, the Bitcoin protocol has been halving mining rewards. In the early years of Bitcoin, miners received 50 BTC whenever they confirmed a block of transactions. However, after the network halves in April, miner rewards per block will fall to 3.125 BTC.\n\nThe Road To Sustainability, Ethereum’s Issuance Rate Continues To Fall\n\nComparing the two approaches, the Ethereum developer notes that each system has its mechanism of ensuring its tokenomics are sustainable. The analyst adds that the “ultrasound money” narrative championed by supporters may be exaggerated and, to some degree, an overly optimistic assessment of ETH’s ability to be deflationary.\n\nAs of January 10, Ethereum has destroyed over 3.9 million ETH since the implementation of EIP-1559 based on the Ultra Sound Money data. During this time, the network issued more than 6.9 million.\n\nThis confirms that Ethereum has been burning more ETH recently; it remains inflationary, to a smaller degree, like Bitcoin. Still, unlike Bitcoin, Ethereum’s issuance rate has been dropping steadily due to increased token burning.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiS0FVX3lxTE5xajZZbXdiZnZWRXV4Tm9jMU5kVnNSVkktSjBhbDRfbXFNTHE4aUd3VkFaTzJONXdZa3BhWjVoRnY3dVVTVlcxdkZVQdIBUEFVX3lxTFA5bzdMR2EwY1VfQWdleEtQU0wtZm5uOVVlMm9DVnhETzRlR0tGdUl3QTBuNkoybFlwc3BReW84WFNZNENSMU52R0VqT01FUlNm?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Anticipating a $4k Target ETH as ETF Approvals Loom in 2024 - CoinGape",
        "content": "Ethereum price has recently witnessed a significant upswing, climbing by 8.5% in just 24 hours and registering a 15% increase over the past week. This surge has propelled ETH past the $2,500 mark, a level not seen since May 2022. The momentum came after the Bitcoin spot ETF approval, sparking investor speculation about the imminent approval of Ethereum’s spot ETFs.\n\nEthereum price fluctuated between $2,200 and $2,300 in the past few days, with buying and selling pressure struggling to establish a clear market direction. However, the market soon gained traction, allowing ETH to break free from this range; currently, ETH price is hovering at $2,641. Despite encountering resistance at $2,450 and experiencing a brief correction, the bulls regained control, pushing the price above $2,600.\n\nadvertisement\n\nAnticipation of Ethereum ETFs Fuels Market Optimism\n\nThe cryptocurrency market is optimistic following the historic approval of 11 Bitcoin spot ETFs on January 10, 2024. This development has heightened expectations for the approval of Ethereum spot ETFs later in the year. Bloomberg ETF analyst Eric Balchunas estimates a 70% chance of Ethereum ETF approval by May, further fueling market enthusiasm.\n\nNew deadline to obsess over just dropped May 23rd is the final deadline for decision on VanEck’s spot ETH ETF pic.twitter.com/dgi5EVbPeQ — Will (@WClementeIII) January 10, 2024\n\nIf the bulls maintain their momentum and push Ethereum past the $2,700 resistance level, the course could be clear for Ethereum price to test the $3,000 mark. Sustaining this level could set the stage for an attempt to breach the $4,000 resistance in the near future. Conversely, if bearish trends prevail, Ethereum could see a decline, testing support levels at $2,500 and potentially dropping to $2,450 by the weekend.\n\nEthereum Technical Indicators Point to Bullish Trends\n\nEthereum’s market behavior reinforces the bullish sentiment. The Moving Average Convergence Divergence (MACD) indicator shows a rising green histogram, signaling a dominance of buying pressure over selling. The MACD and signal lines are currently above the zero line, indicating bullish pressure. Additionally, the Chaikin Money Flow (CMF) indicator stands at a positive 0.42, suggesting a strong buying trend.\n\nThe four-hour technical indicators also support this bullish outlook. The Relative Strength Index (RSI) has crossed overbought territory, surpassing 70, indicating strong buying pressure. Furthermore, the 20 Exponential Moving Average (EMA) is positioned above the 50 EMA, confirming the market’s bullish dominance. Most of the moving averages and oscillators in the four-hour chart indicate buying pressure, suggesting a continued upward trend for the asset in the short term.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQOHlpU041V0JyUXdadzZFd2dsN1M3NmdnQU1OQzducHJpeDZwS3VLbk1YMnFyNUl2N0VObnJaNllza3hxM3lFSW9UZHRlWDRYNFJQOGtOTUloR3BEYWdhX0Q3SWl5NGktQnBZVzlIUEFtOTd6bkNaU0JKQWRkZHlFMGlWMzFnRnkyYjJWcWtyRWpMZWtTQ2NGY0F6LTNQYnFN0gGmAUFVX3lxTFAzNmtpYlRaOG85SkFVNndaQ25haGo5WkRkcjZaVUVGZlFaZENrMW90c3Qzbi1rRi0ya2UwN084RV8wdDJndE9Ic1dnQlFfV0pTamNqTEh3RkxrbDRNVG1XMHlpZlQ2dkZOSGh1LUxxa0tuMGo1M2xOMnFWMTU2c3VvMF85SlV5NVJZOTI1UW5ZLUlXUzUyVFVtbkZ3bGNQYVZMZng3ZEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "The Protocol: Beneath Bitcoin ETF Chaos, A Blockchain Drama - CoinDesk",
        "content": "GITHUB REJECTION! While crypto traders, tradfi investors, financial institutions and probably lots of normies and newbies were engaging in the gripping speculation over whether U.S. regulators would approve a spot bitcoin ETF, a struggle over the very soul of the Bitcoin blockchain was taking place on the open-source developer platform GitHub . At the core of the matter was whether data-oriented applications like Ordinals inscriptions – often referred to as \" NFTs on Bitcoin \" – should be allowed on a network that purists argue should be preserved primarily as a settlement layer for peer-to-peer payments. In September, the longtime Bitcoin developer Luke Dashjr, who sits in the latter camp, created a proposal – technically known as a \"pull request\" or PR – to put strict limits on the amount of data that could be stuffed into an individual transaction. The proposal quickly touched off an acrimonious debate that went on for months, until several days ago when Ava Chow , a maintainer of the paramount Bitcoin Core software, abruptly closed the PR without taking action. \"It's abundantly clear that this PR is controversial and, in its current state, has no hope of reaching a conclusion that is acceptable to everyone,\" Chow wrote, the last post in the thread. It's possible there could be additional chapters, though, since Dashjr later tweeted, \"Spam filtering isn't dead until the spam is dead.\""
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxPNWIxWlIzeUp3aW03eVZ5OHMtdmpHMzhfQ2dkTTJqUTN4TFd0WS1LOER1cTdwaHAtd3AtRklFb3JLLXBsTEZnSVFmNTdhbXl0Y3FVa3R5dEV0U2J4TjJxZF80Y1VTN0s2QTB5d0t5MTVnUE4tUTdPRjZkQXhGc2VYZnhIMkd2YnRhdDBndEVDUmp0M2NzUHgtWmttQmFseWlaMU0ySzVrZG9vbGVBQk1wYmo2bzl2UktpaDJaeTFLWmctWGtxMkdxU3UwWGZtNWFmNldEemQySDZ3NEYwcVV30gHkAUFVX3lxTE84eVFubnctQVJPTmk2NUdZN2dUM3U1SV9mdVlDeG96WHVTdjFJS1pWZ1J1Ni1FRFE2WWlZSDNubF8ydHpoTWZqci1nUEtnNk54aHZsRzJLTDA1aW5VYW81eWo0ZWdxd0dUU1RPRUVSXzRBZzlCbEdXbkI1eDFpWk1NMVdldXc4VDR6NEpLeGtLU016bmVBdkxmUFZ6czNhZWRua0gzdmVIWGJ6LTBlS0tYeXk5OWxmeTZIRTI5bk9vb1lmUVQxRUtyQVcyaFU2UlY4V05YNGdjUnc0Z3RXNk01My1Idw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum price eyes $2,800 as spot Bitcoin ETF hype raises hopes that ETH could be next - FXStreet",
        "content": "Ethereum price is up 8%, outperforming Bitcoin as excitement over expectations of spot BTC ETF approvals increase.\n\nETH could extend the climb 15% to $2,800 once a Bitcoin ETF is approved.\n\nThe bullish thesis will be invalidated if Ether market value breaks and closes below $2,135 support.\n\nEthereum (ETH) price remains a top performer among the crypto top 10, spiraling within a bullish technical formation that commits Ether to more gains. It comes as the countdown to possible spot Bitcoin exchange-traded fund (ETFs) approvals climaxes since ETH community members anticipate the hype shifting toward a similar spot ETF for Ethereum.\n\nAlso Read: Ethereum price could target $3,000 with ETH whales buying the dip\n\nETH could come next if a spot Bitcoin ETF is approved\n\nEthereum (ETH) price did not flinch even as Bitcoin crashed in the aftermath of the fake spot BTC ETF approval news. It comes amid expectation that after the US Securities & Exchange Commission (SEC) greenlights the BTC product, Ether could be next.\n\nMultiple participants in the crypto sector, including Valkyrie Fund CIO Steven McClurg, say an ETH ETF launch would be unsurprising.\n\nNEW: @ValkyrieFunds Chief Investment Officer @stevenmcclurg says it wouldn’t surprise him if he saw “Ripple” ($XRP) and Ethereum spot ETFs coming to market now that the @SECGov is about to approve one for Bitcoin. pic.twitter.com/EBcwvbgChs — Eleanor Terrett (@EleanorTerrett) January 9, 2024\n\nIt comes as multiple institutions have already submitted applications for spot ETH ETFs, including VanEck, Ark21Shares, Hashdex, Grayscale and Invesco.\n\nETH ETF applications\n\nAmid this anticipation, Ethereum is going through a supply shock with funds rushing into the ETH market as investors front run a possible spot ETH ETF.\n\nEthereum could rally 15%\n\nEthereum price is moving within an ascending parallel channel, a bullish technical formation that could see ETH reclaim the $2,457 range high. Enhanced buyer momentum might see the largest altcoin by market capitalization metrics test the $2,800 level, a move that would denote a 15% climb above current levels.\n\nIn highly bullish cases, Ethereum price could extend the gains to the $3,000 psychological level, standing 25% above current levels.\n\nThe rising Relative Strength Index (RSI) accentuates the bullish thesis by showing that buying strength is increasing. Both the Awesome Oscillator (AO) and the Moving Average Convergence Divergence (MACD) indicators are also in positive territory. This would demonstrate that bulls are leading the ETH market. More closely, the MACD has crossed above the signal line (orange band), which is a bullish crossover.\n\nETH/USDT 1-day chart\n\nOn-chain metrics support bullish outlook for Ethereum price\n\nSantiment’s daily active addresses metric supports the bullish outlook for the Ethereum price, showing a progressive surge in crowd interaction with ETH as more unique addresses are created. In mid-December, there were 387,000 daily active addresses, while the number currently stands at 413,000. This represents a 6.7% increase in just under a month.\n\nAlso, whale transactions for transfers of $100,000 and above have been spiking, accentuated by surging volumes to show increasing investor interest.\n\nETH Santiment: Daily active addresses, volume, whale transaction count\n\nOn the other hand, with the potential for early profit-taking, Ethereum price could correct if the bears have their way. The ensuing seller momentum could see ETH market value dwindle, losing the support at $2,388. In a dire case, an extended fall could send the proof-of-stake (PoS) token to the depths of $2,135, below which the prevailing bullish outlook would be invalidated if a lower low occurred.\n\n(This story was corrected on January 11 at 08:55 GMT to say that in a highly bullish case, Ethereum price could extend gains to the $3,000 psychological level, not $30,000.)"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQZWxMSlJia0ZWYjFqRkxEZ3QzcmdyeFVMNHUzcEF1Vjl4STkwV1lkNUx3eFhyZzBEX2dQejNpVFdTNkJJeGdoMml5Uy12ZEIwYjZqTjBpUEJ0RmdQZy03eXhqOW85TWdHLTViRnZMdl9nR3pLdDlKZ05Bc09rb0pZNDBWTUFPMDlPVGZFLThDYmpMVVRXWG1GYldsQ1NoQdIBpgFBVV95cUxNN1RpT2ZzSmxMaTFmYUZESU4wMjBkZ3d2UUlSbVFtU1ZwbldrMGJvRzRVQ3VuWDN1TUYtS01YclZZMEhIZEh4MFIyeU03QlV1a1FNeHN6MjFPQ1U4UWxkaGQxVWRMUjJTWEVuTUttR0FEWlFrbnpLcjVtR0dyRW9LVTkwMzlfak5xRHVRWVZab2xEcXJxakZJRHowZzV3UnFXbVVod29n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Twitter Gives Up on NFT Profile Pics, Killing Ethereum Feature for Paying Users - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nTwitter has axed the option for paying premium users (formerly Twitter Blue subscribers) to use a verifiable NFT image as their profile picture (PFP), two years after debuting the feature,\n\nLaunched last January, the feature was billed as an exclusive benefit for paying users, introduced in the era before billionaire Elon Musk purchased the social media platform later that year. It was also seen by crypto advocates as a forward-thinking move that validated NFTs, ahead of similar decisions by Meta to integrate NFTs into Facebook and Instagram later that year.\n\nHowever, the ability for X Premium subscribers to activate the feature via the iPhone version of the mobile app is no longer available. TechCrunch first reported the move early Wednesday, noting that X Premium marketing no longer mentions the feature. Decrypt independently confirmed that the option is not currently offered within the app.\n\nUsers were previously able to designate an Ethereum NFT as a profile picture by confirming ownership via the blockchain, and the image would be shaped like a hexagon rather than the standard circular PFP. It’s unclear whether users who still had an NFT equipped will still be able to use the verification method, or whether it profile pictures will still appear as hexagons on the platform.\n\nAD\n\nAD\n\nTwitter has yet to comment publicly on the decision. Decrypt reached out to the company and received an automatic reply stating, “Busy now, please check back later.” Previously, under Musk’s regime, the platform’s press outreach email address returned a poop emoji to any received email.\n\nCrypto Twitter users have largely responded by memeing the news, with many people posting some variation of the following tweet: “X has removed support for NFT PFPs. Just so you know: Digital property rights are not a joke. If any of you take screenshots of my [NFT] and pretend it's yours, I will sue you.”\n\nX has removed support for NFT pfps. Just so you know: Digital property rights are not a joke. If any of you take screenshots of my CryptoPunk and pretend it's yours, I will sue you. pic.twitter.com/SHnSNEjXqo — Farokh (@farokh) January 10, 2024\n\nWhile Twitter was the first of the social media giants to embrace NFTs, Meta moved on much faster. In March 2023, Meta announced that it was “winding down” support for NFTs on Instagram to focus on other priorities. Meta is still building towards its vision of the metaverse, a more immersive future internet, but has shifted more attention to AI development of late.\n\nAD\n\nAD\n\nNews of Twitter's removal of the NFT profile picture feature comes following major crypto-related drama on the platform. On Tuesday, the official account of the United States Securities and Exchange Commission (SEC) tweeted that it had approved trading of spot Bitcoin exchange-traded funds (ETFs). But minutes later, SEC Chair Gary Gensler tweeted that the account had been \"compromised\" and that the approval was not yet made.\n\nTwitter confirmed late Tuesday that the SEC account lacked two-factor authorization to secure access, and that someone had gained unauthorized access to a phone number tied to the account. On Wednesday, the SEC said that it has asked the Federal Bureau of Investigation (FBI) to help investigate the issue, with the regulator claiming that the false tweet was not a saved draft that an unauthorized user posted ahead of schedule.\n\nEven so, the SEC is still expected to announce the official approval of spot Bitcoin ETFs in the United States on Wednesday, with analysts projecting a late afternoon announcement ahead of trading expected to begin Thursday.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5hSGVrbGZYNDFISkZtRzNMSHZYd0NSTTAwSjBCMTBSUUFHR2NyZUowT3RwcWJDbEpUWnpURDZGMUJPVDVyWGJ0WEpVdjVsbjZoTWFjTHFqcnF1V1AtbUo5QlMwM0VKVW85Um1wTFRrVUNEaVVRSTVHNDFTOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "MOG Coin sees 47.5% gain as ETF deadline approaches - crypto.news",
        "content": "MOG Coin, an Ethereum-based coin, takes a spot on CoinGecko’s top trending report following double-digit gains in the last 24 hours.\n\nAs another Ethereum-based coin, MOG joins the surging token list on pending ETF approval day. MOG tokens are actively traded on decentralized and centralized crypto exchanges, with Uniswap V2 Ethereum emerging as a popular platform for buying and trading Mog Coin. The MOG/WETH trading pair on Uniswap V2 has since recorded a substantial trading volume of over $1 million in the last 24 hours.\n\nMog Coin price chart | Source: CoinGecko\n\nYou might also like: Ethereum applications take place as top gainers ahead of ETF announcement\n\nAs of the latest data, the daily trading volume for Mog Coin (MOG) stands at $1.5 million over the past 24 hours, indicating an increase of 108% from yesterday.\n\nReflecting on the historical performance of Mog Coin, its all-time high occurred on Aug. 18, with a recorded price of $0.061091, marking a span of five months. The current price registers a 50.5% decrease from the recorded all-time high.\n\nConversely, the all-time low for Mog Coin was observed on Jul. 24, with a recorded price of $0.084526, marking a period of six months. In contrast, the present price reflects a substantial increase of 1,093% from the recorded all-time low.\n\nWith much of the world awaiting the final verdict on a Bitcoin ETF, it is no surprise that wild price swings in either direction are likely to ensue."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxQYVBCUWl3eTVJbDJZV04xQkxudGRkSDEtV2w0bEh3VzFkR3AzOEs4a3F1NGlrM2dFVmduc0pTMVZHM0ZpN3FrLW9SX3lSdzdxYzdabE5qMHhDLXQ4bDdwdF82MHJkaktsMjNNZUg3VW54QTYyMlBOcmFfU0liSVdtUFJNZEdjUzB1d3hZY2MtdmVJa181bmVza0luUFRETV90aVNYcTE0TDZDWEt0MWNrX3h3ZGstRHEyOW5jVU41bllnU3lqY0FZR3dMdEQ3UG1aR2J2OGowcHRUSmPSAeABQVVfeXFMTWhZMFQwSWFkckZLd3NhTFdhajltdDJyZVpqNUxlMnNKeFZocGZaUXpRdEtSMEtDOWd0THJrMk8tcUNkYlVaRTlGZjYzUFN5dHRiVXcwcFBySzhYb1pCckhiN0hVcFd1a19vd1lCM0ladzdjdGJnRzR2TmJSVDdWWjI2ZTE0dmFlUy1NMHZyQ2pKUmxVU0ktWHFRWlltR3lLVUh0cG5CTjV5czRpbG1pek16MmFfd3FUYmF3b2NrWEQ0NnBHN2hGZ0pDSjZRS0ZhclpxTVVWY1JZZm1tUEJGMmo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "XRP and Ethereum ETFs could come after approval of Bitcoin's, Valkyrie Funds CIO says - FXStreet",
        "content": "Ripple and Ethereum Spot ETFs could come to market post likely approval of Bitcoin Spot ETFs, says Valkyrie Funds CIO.\n\nXRP is the only digital asset with regulatory clarity from US courts and the altcoin’s relisting by major exchanges is a key step.\n\nEthereum price rallied with the false announcement of the Bitcoin Spot ETF by the SEC, BTC price suffered as traders “sold the news.”\n\nEleanor Terret of Fox Business shared views of crypto industry leaders on why Ripple XRP and Ethereum Spot ETFs could soon be approved by the US Securities and Exchange Commission, following the highly probable greenlight for Bitcoin Spot ETFs.\n\nXRP bulls and Valkyrie Funds’ CIO, Steven McClurg are positive that XRP and Ethereum Spot ETFs will receive the regulator’s seal of approval.\n\nAlso read: Bitcoin ETF announcement hack reveals BTC price upside is likely capped\n\nSEC could approve a single product XRP Spot ETF: Fox Business reporter\n\nFox Business’s Eleanor Terret shared her conversation with crypto market participants, bulls and bears and Valkyrie Fund CIO, Steven McClurg. They offer different sets of views on the likelihood of SEC’s approval on a single-product XRP Spot ETF.\n\nThe bullish case is based on the fact that XRP is the only cryptocurrency that has received regulatory clarity from the US District Court. This refers to Judge Analisa Torres’ XRP ruling from July 13 that states that XRP was not a security in its “secondary sales” on exchange platforms. This clarity ushered XRP’s re-listing on major crypto exchange platforms like Coinbase and Kraken.\n\nGrayscale’s Digital Large Cap Fund recently relisted XRP and this is considered a positive sign that the altcoin will be included in future funds by the crypto asset management giant.\n\nSteven McClurg says that it wouldn’t surprise him if he sees XRP and Ethereum ETFs come to market after the SEC comes close to approving the Bitcoin Spot ETF product.\n\nNEW: @ValkyrieFunds Chief Investment Officer @stevenmcclurg says it wouldn’t surprise him if he saw “Ripple” ($XRP) and Ethereum spot ETFs coming to market now that the @SECGov is about to approve one for Bitcoin. pic.twitter.com/EBcwvbgChs — Eleanor Terrett (@EleanorTerrett) January 9, 2024\n\nThe bearish case is that the SEC Commissioner Gary Gensler and his views on cryptocurrencies other than Bitcoin could negatively affect an Ethereum or XRP Spot ETF bid without Congressional intervention on crypto regulation. Terret argues that a change of administration to one that has a “crypto-positive” outlook is likely needed for the same.\n\nIt is also likely that once Bitcoin Spot ETFs are approved, BTC will stand distinctly from other cryptocurrencies and this difference could be followed by rejections of Spot ETFs for other assets like XRP and Ethereum.\n\nEthereum rallies while BTC hit by “sell the news” trade\n\nVetle Lunde, Senior Analyst at K33 Research elaborated on the capped BTC price gains following Bitcoin Spot ETF approval in his recent tweet on X. Lunde sheds light on the possibility that the news of ETF approval is likely a “sell the news” trade for Bitcoin traders.\n\nBitcoin price reaction to false SEC announcement. Source: K33 Research\n\nInterestingly, Ethereum price rallied and crypto analysts noted that capital is likely to rotate from BTC to ETH and fuel gains in the latter. Scott Melker, crypto analyst, notes that the outcome of the series of events on Tuesday could act as a roadmap when the Bitcoin Spot ETF decision is released by the SEC."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiSkFVX3lxTE56emxBNFNTcUlJV2cwSFljekh0Vm1sd2tzRVVsQ2JuRmhtYmRNT3JnUjlpRW9BZ2wzeV9YdUJESzlCX09JNDkxcGFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "What is Neon EVM (NEON): the first Ethereum Virtual Machine on Solana - OKX",
        "content": "The Ethereum Virtual Machine (EVM) is known to be a foundational element in blockchain technology. It enables secure and automated smart contract execution, underpins decentralized applications (DApps), and provides interoperability across many different crypto projects.\n\nThe technology's widespread adoption, security measures, and support for token standards like ERC-20 and ERC-721 contribute to its role in the Web3 ecosystem, particularly among decentralized finance (DeFi) protocols and non-fungible tokens (NFTs).\n\nNeon EVM represents fresh evolution for EVM. The promise of Neon EVM lies in its ability to integrate EVM capabilities into the Solana (SOL) blockchain. This means developers can leverage the familiar EVM environment for deploying and executing smart contracts on Solana, combining the strengths of Ethereum's (ETH) ecosystem with the speed and scalability of Solana's blockchain. Meanwhile, the interoperability enabled through Neon EVM opens up new possibilities for DApps and supports the transfer of Ethereum's projects to the Solana network.\n\nWhat is Ethereum Virtual Machine (EVM)?\n\nTo understand the impact of Neon EVM, let's start with the basics. The EVM lies at the core of Ethereum's functionality, serving as a decentralized runtime environment that executes smart contracts. In other words, it translates code into tangible actions, powering the development of a diverse range of DApps.\n\nWhat does EVM-based mean?\n\nThe term 'EVM-based' refers to blockchain networks directly built using the EVM architecture, incorporating the EVM natively into their infrastructure. This direct integration provides one-to-one compatibility, allowing smart contracts written for Ethereum to execute on EVM-based networks. Ethereum-based projects can migrate effortlessly to these platforms, benefiting from the familiarity of the Ethereum environment.\n\nWhat does EVM-compatible mean?\n\nWhen a blockchain is labeled EVM-compatible, it means the chain follows EVM standards without being directly integrated with the core architecture. While EVM-based chains directly replicate Ethereum's Virtual Machine, EVM-compatible chains maintain compatibility with Ethereum's tooling and smart contract standards but might introduce additional features or optimizations.\n\nSimilar to EVM-based blockchains, developers benefit from a familiar environment, using Ethereum-compatible programming languages and tools, such as the widely familiar Solidity language. This compatibility also allows for interoperability, providing a smooth transition for projects between Ethereum and EVM-compatible blockchains.\n\nWhat is Neon EVM?\n\nNeon EVM is positioned as the first EVM on Solana, allowing developers to deploy EVM-compatible DApps on Solana with minimal reconfiguration. The platform enables DApps to process Ethereum-like transactions while embracing Solana's functionalities, including parallel execution of transactions and low gas fees.\n\nWith Neon EVM, developers can continue using familiar smart contract languages and Ethereum tools. This includes writing smart contracts in Solidity and Vyper, funding DApps with MetaMask, and deploying DApps on Solana through the Truffle environment, all while taking advantage of the efficiency of Solana transactions. This not only supports the transition for Ethereum developers but also potentially expands their reach by tapping into Solana's user base and accessing the platform's liquidity.\n\nNEON, the native utility and governance token, plays a broad role, from enabling transactions to decentralized governance through Neon DAO.\n\nHow does Neon EVM differ from Ethereum's EVM?\n\nOne difference between Neon EVM and Ethereum's EVM lies in the execution of transactions. While Ethereum's EVM executes smart contracts sequentially to maintain consistent and predictable outcomes, Neon EVM uses the parallel execution capability of Solana to enable smart contracts to be processed concurrently.\n\nTo allow for parallel transaction processing, Neon EVM bundles transactions and sends them to the Solana mainnet. Under ideal conditions, Neon EVM achieves a throughput of 4,500 transactions per second (TPS), surpassing Ethereum's general limit of around 1,500 TPS.\n\nHow does Neon EVM work?\n\nNeon EVM serves as a gateway for Ethereum-based applications to access the high transaction speeds and low transaction costs of Solana without changing its codebase. Here's an overview of the platform's key components and functionalities:\n\nNeon Proxy\n\nNeon Proxy allows for the migration of Ethereum DApps to the Solana blockchain. Acting as a bridge, Neon Proxy channels Ethereum-like transactions on the Solana network with minimal friction. This component packages Neon transactions, which represent Ethereum-style transactions, into Solana transactions. These packaged transactions are then processed on the Solana blockchain, leveraging its parallel execution capability and high throughput. Neon operators, responsible for running Neon Proxy servers, support this migration. They accept payments in NEON tokens and manage transactions within the Solana ecosystem using SOL.\n\nNeonScan\n\nNeonScan functions as both a block explorer and an analytics platform designed for users and developers. As a block explorer, NeonScan allows users to inspect and analyze transactions, blocks, and tokens associated with the Neon EVM on the Solana blockchain. This transparency provides users with a comprehensive view of the network's activity, allowing them to verify transactions, track token movements, and understand block information.\n\nNeonPass\n\nNeonPass is a tool that helps enable the transfer of ERC-20 tokens between the Solana and Neon EVM. This tool simplifies the cross-network cryptocurrency transfer process, allowing users to navigate the complexities with ease. Each transaction conducted through NeonPass incurs a gas fee, payable either in NEON or SOL tokens, depending on the originating network.\n\nNeon Faucet\n\nNeon Faucet is a service designed to help users obtain NEON and other ERC-20 test tokens. It's a resource for developers working within the Neon devnet, providing them with the necessary test tokens for application testing in a risk-free environment.\n\nBy using these tokens, Neon Faucet enhances the application development and testing processes on the Neon EVM platform before their deployment on the main network. Users looking to use Neon Faucet need to connect their crypto wallet to the service, which then allows them to access NEON and other ERC-20 test tokens for a thorough and secure testing experience.\n\nWho created Neon EVM?\n\nNeon EVM, developed by Neon Labs, operates under the oversight of the Neon Foundation for its development and governance. Marina Guryeva is the founder and CEO of Neon Labs and has been active in the blockchain space since 2015.\n\nGuryeva previously served as the Director of CyberFund, an investment platform for blockchain startups. In 2019, she assumed the role of Director at Commun, a blockchain-based social network. In 2021, Guryeva founded Neon Labs with the aim of integrating Solana's scalability and low transaction fees into the Ethereum ecosystem.\n\nNEON token: powering transactions and governance\n\nThe NEON token, native to the Neon EVM ecosystem, serves a dual role. It functions as a utility token, facilitating transactions on the Neon platform including transfers, DApp deployment, interactions within DApps, and more. Beyond transactions, NEON serves as a governance token, empowering holders to actively participate in decentralized decision-making processes through Neon DAO.\n\nThe final word\n\nNeon EVM's mission within the Solana ecosystem is clear: to harness Solana's capabilities while providing Ethereum developers with a platform that feels like home. This integration brings forth a new era of possibilities for developers seeking high-performance blockchain solutions. As Neon EVM looks ahead on its roadmap, the promise of continued innovation underscores its commitment to shaping a multi-chain future."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE5TcWxiS3drME1WWFY1M0VsLUNUbEthRG1TMUJTTmM0eE1hOVNPQzYxQTBhRDlNc25QS00zd2Q0cVBUOUxWVGhrNjFUQWZjN3ljY1lFVjhmRDhwaXhVVzFIbWNhUGw4ZUt3R3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Top Trends in Crypto for 2024 - Bitcoin Market Journal",
        "content": "Table of Contents\n\nKey Takeaways\n\nBitcoin is expected to increase in value in 2024, driven by factors like the approval of bitcoin spot ETFs and the upcoming bitcoin halving event. These developments are expected to attract more investors and increase demand.\n\nis expected to increase in value in 2024, driven by factors like the approval of bitcoin spot ETFs and the upcoming bitcoin halving event. These developments are expected to attract more investors and increase demand. Coinbase will continue its growth momentum into 2024, potentially doubling its revenue. This growth is attributed to increased bitcoin demand and higher institutional adoption due to the approval of Bitcoin ETFs.\n\nwill continue its growth momentum into 2024, potentially doubling its revenue. This growth is attributed to increased bitcoin demand and higher institutional adoption due to the approval of Bitcoin ETFs. Ethereum could grow substantially, with an upgrade (EIP-4844) enhancing transaction throughput and reducing costs. Additionally, the integration of AI in the crypto industry is foreseen to bring significant improvements in transaction analysis, efficiency, and security.\n\nIntroduction\n\nIn 2023, we saw a resurgence in bullishness in the crypto industry, and we expect to see the same energy carry over into 2024 as increasing adoption, revenue growth, and the integration of new technologies are on the horizon.\n\nHowever, new tokens and assets, uncertain regulations, security concerns, and technological innovations speak to the industry’s dynamic nature. This can make it challenging to predict upcoming trends, let alone keep up with them.\n\nThat said, we see some emerging trends that will help fuel the excitement 2023 brought to the crypto industry. These trends include a surge in bitcoin’s value, Coinbase’s revenue growth, the increasing adoption of Ethereum, the rising influence of stablecoins, and the integration of advanced technologies like AI in crypto.\n\nRead more about the crypto trends we see shaping the industry in 2024.\n\nTrend 1: The Surge of Bitcoin\n\nIn 2023, we saw bitcoin rally 150% higher, and at the beginning of January 2024, we saw its price surge to over $47,000. Analysts predict bitcoin’s price rise will continue throughout the year, with the potential to reach an all-time high and hit $80,000 before year’s end.\n\nBitcoin’s price trajectory is strong. Chart via Coinmarketcap.com\n\nThere are a couple of factors at play that support this prediction. For one, there’s the SEC’s approval of a spot bitcoin ETF, which puts bitcoin within the reach of ordinary investors, directly within their brokerage accounts.\n\nTraded on stock exchanges, bitcoin spot ETFs hold bitcoin as their primary asset and directly track the price of bitcoin, therefore providing investors with price exposure without directly owning the asset. This should help bitcoin appeal to a broader range of investors, leading to increased demand and a price increase.\n\nAnother factor that could lead to a surge in bitcoin price is the halving event, which is set to take place in April 2024. These halving events occur roughly every four years, the last occurring in May 2020. Bitcoin halving cuts the reward for bitcoin mining in half, meaning miners receive 50% fewer bitcoins for verifying transactions. Historically, these halving events have been associated with price increases as a reduced rate of new bitcoin creation leads to scarcity, eventually increasing demand and price.\n\nTrend 2: Coinbase’s Growth Trajectory\n\nCoinbase is the largest cryptocurrency exchange in the US by trading volume, and the company has spent years building brand authority with investors, giving them pricing power. 2023 saw Coinbase’s stock soar 418%, and its revenue saw a 14% increase. The company is well-positioned to carry this growth into 2024, with the potential to double its revenue.\n\n\n\nCoinbase shares have outpaced even bitcoin.\n\nThe bitcoin ETF and bitcoin halving event are two of the main catalysts for the predicted growth at Coinbase, as both events should lead to an increased demand in bitcoin, which accounts for most of the platform’s trading volume.\n\nThe approval of bitcoin ETFs will also likely lead to an increase in institutional adoption, as insurance companies, pension funds, and other institutional investors who would otherwise be reluctant to engage with crypto will be more likely to invest, as ETFs offer a regulated and well-known investment structure. Coinbase is thus far the sole custody provider for all the proposed bitcoin ETFs. which should generate substantial revenue in the form of custody fees.\n\nTrend 3: Ethereum’s Rising Tide\n\nEthereum will also likely see rapid growth in 2024, with some analysts predicting its revenue will double.\n\nThis is partly due to a scheduled critical upgrade known as EIP-4844, which is expected to occur in the year's second half. The upgrade will boost throughput to 100,000 transactions per second and reduce transaction costs by as much as 90%, making the network more accessible to mainstream users and driving adoption.\n\nOver the years, Ethereum has made significant efforts to improve the adoption of crypto projects. Ethereum offers smart contract functionality, serves as the primary platform for the DeFi ecosystem, provides a framework for tokenizing and selling NFTs, and enables the creation and issuance of new tokens. In short, it acts as a foundation for the growth of various crypto projects, and the reduced transaction cost will only make the platform more appealing to its users.\n\nTrend 4: The Stablecoin Revolution\n\nWhile most of the attention leading into 2024 has centered around bitcoin, investors want to keep their eyes on stablecoins in the coming year.\n\nIn the latter half of 2023, JP Morgan announced an improved tokenized payment platform, PayPal launched its stablecoin, and Visa expanded its stablecoin settlement capabilities. These events complement the optimistic forecast predicted for stablecoins in 2024, as Bitwise predicts that stablecoins will surpass Visa in terms of settled volume.\n\nIn 2023, we also saw significant advancements in stablecoin regulation. According to Cointelegraph, 25 countries had stablecoin regulations in place last year. The US will likely act on stablecoin regulation in the coming year. Doing so will give the US a mechanism to oversee adoption and ensure its central role in supervising and regulating stablecoin issuers. Additionally, it’ll allow the US to serve as a home for growing businesses that will likely be strategically significant in expanding the role USD and other stablecoins play in the global economy.\n\nTrend 5: On-Chain Innovations for Traditional Finance\n\nWe will also likely see a rise in on-chain innovations in 2024. In 2023, JP Morgan collaborated with a handful of blockchain firms to demonstrate how proof of concept could allow asset managers to tokenize funds on a blockchain of their choice and purchase and rebalance their positions in tokenized assets across multiple chains.\n\nThe demonstration coincides with the traditional financial sector’s growing interest in crypto and blockchain technology. In 2024, we will see more traditional finance companies explore on-chain innovations through partnerships and services as regulatory clarity improves.\n\nTrend 6: AI, Decentralization, and Crypto\n\nIntegrating AI tools into the crypto industry holds immense potential, and we expect to see some of this potential come to fruition in 2024. More companies will use AI algorithms to enhance transaction speed, analyze transaction data, and improve efficiency and security.\n\nAI trading tools will also become more refined and user-friendly, making crypto trading more accessible to many investors. AI will also be integral to real-time sentiment analysis, regulatory compliance, and forecasting. Additionally, we will likely see the rise of AI-powered personal trading assistants capable of learning an individual trader’s risk appetites and preferences to offer customized advice and manage trades.\n\n2024 will also likely see the growth of decentralized prediction markets. While prediction markets have existed for years, crypto takes them to the next level by making them permissionless and borderless and automating functions like making payouts and determining winners and losers. We expect decentralized prediction markets to become a primary venue for sports-based and event-based wagering.\n\nLastly, you can expect financial advisors to allocate to crypto in 2024 increasingly. According to a Bitwise survey, 98% of financial advisors with crypto allocations in client accounts plan to maintain or increase that exposure in 2024.\n\nInvestor Takeaway\n\nAs you can see, many exciting crypto trends are emerging in 2024. Analysts predict that bitcoin will rise in price and prominence, Coinbase’s revenue will grow, Ethereum will establish itself as a powerhouse, and stablecoin adoption will increase.\n\nWe can also expect more financial companies to explore on-chain innovations and AI playing a more prominent role in the crypto world. If you’re currently invested in crypto, we recommend regularly looking at your portfolio to determine how these trends may affect your investments.\n\nAdditionally, subscribe to Bitcoin Market Journal for the latest news for crypto investors!"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQQUFvSlRkbC1HNnJlTXE5bnl3Wl9EdHp4ZHZnVGJUVnFzbXU5azVoRFdJUklWbEt0SV9Fak4yNWNHUlNHOFZNVlE3UHpyX29ZczVVcUV5a09kQzFzT0ZOSUhGQUtfbXEyOFVuOFpuMmVaNU9DVmRXbWNleEpWcjBFQVhEaVh4bVRWaHJITXBXbEt3bmJkMF9jNmtXSzBrbkdqOVhDdHN3VGw3QWZJcnFF0gG8AUFVX3lxTE5lTmd5Q2dod0Yyd0EwSXl6TkU3X3MtUEtWa3JwQWgxVkl6YjFJQ2F4TS1DU1FSYUs5UkQ1Y01Tem9IX0VFZ1lYNTRFLXJvMTRqVUtaSUg1X2s4Q2lMNEJFUVBWVEtFeGp5ZkhOd1VlNTNxUFBmNnd3R1F0X2U5STVUVkRyS3hsV0xIa2tJRTRRRV9TaGZySG92TFZNcFg2eWtiSFZxNmg0Sk96RGJuTE0tQl96clVSXzN3TW9h?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum price and spot Bitcoin ETF Approval - Analytics Insight",
        "content": "Notably, the commission did not name Ethereum as a security in any of its recent lawsuits targeting crypto exchanges. The SEC has also not challenged Ethereum's classification through the ETF registration process with the Commodity Futures Trading Commission (CFTC)."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPTDc5cnlVSkpJOTNOV1pfNGtydG5CTHdiOWZ6Z2hBX0RleFdETExWWHN3NUNOOXZSMzcxZUliaHFYVEtmWm5JNjNral8tUXdEcUFxN29jVkZVUFRoWFpFTmtWWXFDMlNyeG9KbFBGNHFILWVRUEtvajZ2OFoxc0I0SDF4YzBtaTVSYlZPRlRDSkJXN3hEX2FaVko2elhKeTFpdnpxZ2YwSk83N2vSAbABQVVfeXFMTVVQVkZrT1pKMTFySTdtUEZIR3NjVlpCb3J4NVZIdktyNHFBNkZ4bnFHQ29OQzhBeDhrcFp1REYzVDZGZFFiV3pHdUdXVWNxM3JvZlozd1lnNlY0WUdHdGo0bDJaZGNsVTMxOWdidDR0QzRQUXVIV0E1Qmt0SXlFQnVlczF0ZDBuNUhLQUpYN3dKRm9QOXJoUU9WaFBDUTVnSXZuVjctMmsyMWNVaHc3T2M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Yes, Spot Bitcoin ETFs Are off to a Rocking Start, but Now It’s Time To Move to Ethereum - Wccftech",
        "content": "This is not investment advice. The author has no position in any of the stocks mentioned. Wccftech.com has a disclosure and ethics policy.\n\nIf historical analogs continue to hold true, and we have no evidence at this time that they would not, Ethereum is all set to take the crypto leadership mantle now that spot Bitcoin ETFs have begun trading.\n\n$1B in 4 mins of Bitcoin ETF trading https://t.co/Jq1Q64GvXJ — On-Chain College (@OnChainCollege) January 11, 2024\n\nThe cumulative volume of spot Bitcoin ETFs hit $1 billion in just the first four minutes of trading! This is a phenomenal level of activity, even against already-elevated expectations.\n\nWhat's more, Bitcoin has now hit a new 2024 high, having zoomed past the $48,000 price level and quickly approaching the $49,000 handle.\n\nThe ETFs open up new institutional flows that waited for regulatory and SEC approval. It's a green flag. But there's even more. The ETFs were only approved for CASH subscriptions (not in-kind). So every purchase takes more Bitcoin off the market. This metric is going higher. — Charles Edwards (@caprioleio) January 11, 2024\n\nFor the benefit of those who are still not sure how the launch of these spot Bitcoin ETFs affects the world's preeminent cryptocurrency, every unit of these ETFs that is purchased translates into actual Bitcoin purchases in real-time, barring settlement-related delays.\n\n🔸 ETF approval could send Bitcoin to $60,000 near term - deVere's Green Nigel Green, a long-term cryptocurrency advocate and CEO of the deVere Group, sees the landmark SEC approval of 11 spot Bitcoin ETFs on Wednesday sending the cryptocurrency higher - perhaps to $60,000 as… — *Walter Bloomberg (@DeItaone) January 11, 2024\n\nIt is hardly a surprise, therefore, that bullish Bitcoin projections just keep rolling past analyst commentaries. DeVerre's Nigel Green now expects the world's largest cryptocurrency by market capitalization to hit the $60,000 price level as soon as March 2024, well ahead of the halving event in April, when Bitcoin's mining reward will again be cut in half in what is a regular 4-year cycle.\n\n🔸 CAHTIE WOOD: BASE CASE FOR #BITCOIN IS $600,000 RANGE, BULL CASE IS $1.5M BY 2030 — *Walter Bloomberg (@DeItaone) January 11, 2024\n\nAdditionally, ARK Invest's Cathie Wood seems to have stolen the limelight for ultra-bullish projections by predicting that Bitcoin is expected to hit the $600,000 price level by 2030 in her base case scenario, and a whopping $1.5 million in the bullish case.\n\nWhen the #Bitcoin futures launched in 2017, the coin that went up 100% within weeks was #Ethereum When the Coinbase IPO launched in 2021, the count that went up 80% within weeks was #Ethereum#Bitcoin put in tops on both events ($20k+$64k), & proceeded to dump after — Matthew Hyland (@MatthewHyland_) December 22, 2023\n\nNonetheless, we've witnessed these manic times in the crypto world a number of times already over the past decade, and each time Ethereum was able to outrun Bitcoin in the ultra-bullish phase of the cycle. In the aftermath of the launch of Bitcoin futures in 2017, Ethereum went up around 100 percent within the next few weeks. When Coinbase went public in 2021, Ethereum rallied by around 80 percent in the immediate aftermath.\n\nThe #Ethereum ETF will draw more interest and excitement than the BTC ETF leading into it Its just simply based on timing, post-halving is a much more bullish time period which means market participants likely grow exponentially between now and then Bitcoin will do great to — Matthew Hyland (@MatthewHyland_) January 10, 2024\n\nOf course, spot Ethereum ETFs are also now expected to launch by May 2024, just around the time when the euphoria around Bitcoin's halving event would be peaking.\n\n👀 More big whales are withdrawing $ETH from #Binance in the past hours. ✅ Join the #SpotOnChain website and mobile app for more updates about whales now: https://t.co/UV6E05ZjXZ https://t.co/OZ1Jk42Qkq pic.twitter.com/Ob6183DpNz — Spot On Chain (@spotonchain) January 11, 2024\n\nBased on the historical analogs, we can predict with a fair amount of confidence that Ethereum's time to shine is now approaching. And, crypto whales are already positioning for this eventuality.\n\nDo you think Bitcoin is about to be upstaged by Ethereum? Let us know your thoughts in the comments section below."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxQS2plREFUV2R3ZnJQNzhFM051SjRsSi1VOTR3SlZoX29fX2YyQVFRN3Uxb3A4MUt4aXR2LXdmZXNUcmphbFhfejBCTUs3UWdHc0d3TTZXQTJ0djhZejRoa09xdWxiRWZDTkNXRERNcnhtUVNNdG1kUW1LNkNyY0lBemRVWmVhTGlBZ3BaUnlfazROR1ozZkJ0NnRraWpHZVZCUzlScW1GM19wTklsSXl0SG0wOGVhbHRUUTFHeno2c3VteHZNc0g4al9hT2QxcU1jQnFMYmRkN2QxZ1lqd1VITGJyNGVoaGI1b1B5dXJVNFVVVjY2aFYzXzF1VdIB-wFBVV95cUxQS2plREFUV2R3ZnJQNzhFM051SjRsSi1VOTR3SlZoX29fX2YyQVFRN3Uxb3A4MUt4aXR2LXdmZXNUcmphbFhfejBCTUs3UWdHc0d3TTZXQTJ0djhZejRoa09xdWxiRWZDTkNXRERNcnhtUVNNdG1kUW1LNkNyY0lBemRVWmVhTGlBZ3BaUnlfazROR1ozZkJ0NnRraWpHZVZCUzlScW1GM19wTklsSXl0SG0wOGVhbHRUUTFHeno2c3VteHZNc0g4al9hT2QxcU1jQnFMYmRkN2QxZ1lqd1VITGJyNGVoaGI1b1B5dXJVNFVVVjY2aFYzXzF1VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Best Coins to Buy in the Bull Run: Riding the Crypto Bull Run with ApeMax, Helium, Tectum, Celestia, Chainlink, Solana, Ethereum, Bitcoin - - Disrupt Africa",
        "content": "As 2024 dawns, the cryptocurrency market is abuzz with excitement for a potential upcoming bull run, fueled by the anticipated approval of a Bitcoin ETF and the upcoming Bitcoin halving. This phase of burgeoning possibilities has attracted the gaze of both seasoned and novice crypto enthusiasts, looking to ride the wave if the bull run charges for an explosive year.\n\nIn this vibrant landscape, explore the most promising cryptocurrencies: ApeMax, Helium, Tectum, Celestia, Chainlink, Solana, Ethereum, and the iconic Bitcoin. Each of these coins offers unique value to the evolving crypto world. Leveraging the latest market trends and data, we delve into the reasons behind their popularity within the crypto community.\n\n1. ApeMax (APEMAX)\n\nApeMax, a rising meme coin in crypto, stands out for innovation and a growing community. Introducing the pioneering “Boost-to-Earn” staking feature, ApeMax has over 9,000 token holders and 3.5 billion staked tokens. This feature allows ApeMax holders to earn rewards by staking their tokens on preferred entities, offering immediate utility and engagement opportunities seldom seen in presale coins. Eligible early adopters can swiftly engage in staking after purchasing even during the presale phase.\n\n2. Helium (HNT)\n\nHelium (HNT) is a decentralized blockchain network catering to Internet of Things (IoT) devices. Introduced in July 2019, the Helium mainnet supports communication among low-powered wireless devices, facilitating data transmission across its node network.\n\n3. Tectum (TET)\n\nTectum is known for its high-speed, scalable blockchain technology, focusing on creating a seamless user experience. It aims to provide solutions for real-world applications by offering fast transaction speeds with minimal fees.\n\n4. Celestia (TIA)\n\nA modular blockchain platform, Celestia is designed for interoperability and scalability. It stands out by offloading computation to specialized rollup chains, aiming to create a more efficient “network of networks” for blockchain communication.\n\n5. Chainklink (LINK)\n\nA powerhouse oracle network, Chainlink bridges the gap between blockchain contracts and real-world data, enabling secure and reliable interactions beyond the chain. Its widespread adoption and deep integration with DeFi protocols position it as a key player in the evolving blockchain landscape.\n\n6. Solana (SOL)\n\nSolana is renowned for its incredible speed and low transaction costs, boasting the ability to process thousands of transactions per second (TPS). Solana’s rapidity stems from its distinctive hybrid consensus mechanism, merging Proof-of-Stake (PoS) for energy efficiency with a novel Proof-of-History (PoH) algorithm.\n\n7. Ethereum (ETH)\n\nEthereum, a trailblazer in blockchain technology, transformed the landscape with smart contracts – self-executing agreements that activate once preset conditions are met. This breakthrough enabled diverse applications, from digital marketplaces to decentralized finance (DeFi), securing Ethereum’s status as the second-largest cryptocurrency after Bitcoin.\n\n8. Bitcoin (BTC)\n\nBitcoin, known as “digital gold,” is the first cryptocurrency, established in 2009 to enable decentralized, peer-to-peer financial transactions. Bitcoin’s independence from central authorities, secure blockchain-based transaction recording, and limited supply of 21 million coins contribute to its value and potential inflation resistance.\n\nWhy does Bitcoin influence when the crypto bull run will happen?\n\nAlthough it is impossible to predict if and when a crypto bull run will happen, Bitcoin often influences the timing and sentiment around a crypto bull run because it is the leading and most established cryptocurrency. As the pioneer and most widely recognized digital currency, Bitcoin tends to set the tone for the broader cryptocurrency market. A Bitcoin bull run can impact other innovative altcoins like ApeMax.\n\nFinal Thoughts\n\nAs talks of an upcoming crypto surge grow louder, attention shifts towards diverse digital currencies. Beyond the big players like Bitcoin and Ethereum, other innovative altcoins like ApeMax, Celestia, Solana, and many more, emerge as noteworthy contenders, each catering to the niches of their community.\n\nYet, amidst the excitement, it’s crucial for crypto enthusiasts to approach this landscape with caution and thorough research. Understanding the risks inherent to cryptocurrencies is essential. The crypto market’s volatility and factors like regulatory shifts, technological advancements, and global economic trends significantly influence its direction. Predicting which digital currencies will shine remains uncertain.\n\nFor comprehensive details on ApeMax, refer to the official website and ensure compliance with geographical limitations before any purchase."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOc0dMUmVRMGlYUHBGYnphR2h3VFV1bmNIcVNmcjlTVGZRQXNUUEh3eXVYQXlhV3hZNGhlQ0V2bDNMV3NhRGhJYWlTSmhNZ0dRSUlDVlRwSktiQ3BmNVE3dDg2U1dEN1VOX3ZNQ3RQeG9aWGx3U0kyQmNNOGRLbUtNbFRYeXpLY1lvaUJndDNsV200NER4UjBQYkpFQldqakZVVU040gGoAUFVX3lxTE1VRWZtRzZjdUdFWTRVVnhFNEk1WG5vR2ZhXzdoUnNSa1dfNFpSSEtydnpOY0VzSG1WQ0hzYmJHZFZkUFJKdzUwTmNKX2NFV3hOMDhsWDVBUFgxM3dXRlV6aVRaUllXNDAwbjBwTlBGcW5MM1BlU3ducEdGZVVBNU4xV2gwUU81UHVhNjRSZV80NkNmNEI2SVRFT1hsMTZaRUtiVVFTUXBVXw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Fees Increase, Holders Switch to Meme Moguls (MGLS) and Shiba Inu (SHIB) - Punch Newspapers",
        "content": "Ethereum has yet to scale its Layer-1 architecture, which is causing the network fees to skyrocket and holders to lose faith in the project. Meme Moguls (MGLS) and Shiba Inu (SHIB) are two standout projects picking up pace as holders look for alternative options. Notably, Meme Moguls is predicted to surge 30x as it navigates through a presale of discounted tokens. Let’s take a closer look!\n\nWill Shiba Inu (SHIB) Reach $0.00002000 In 2024?\n\nShiba Inu is a memecoin that rose to fame in 2021 by copying the Dogecoin playbook of using a beloved dog as its mascot. Early buyers of Shiba Inu saw a massive return on their investment, with the coin’s value surging by more than 1000x in less than a year.\n\nWith a current market cap of $5.66B, Shiba Inu isn’t far from achieving its ultimate goal of ‘killing’ Dogecoin ($11.53B market cap) to become the top dog of memecoins. However, Shiba Inu is more than 500x the valuation of Meme Moguls, so the potential gains are less significant.\n\nStill, holders of other cryptos are switching to Shiba Inu due to the consistent innovation from the team. For example,Shiba Inu has just launched an NFT clothing collection with Busta Rhymes. This adds to the decentralized exchange, layer-2 protocol, and multi-coin ecosystem.\n\nPricewise, Shiba Inu is now trading at $0.000009559 after starting the year at $0.000008000. Market analysts note that there is heavy resistance sitting at $0.00001000 to $0.00001100, but if Shiba Inu breaks through, it could potentially reach $0.00002000 by the end of 2024\n\nInvestors Flock to Meme Moguls (MGLS) for Potential 100x Growth\n\nInvestors who missed out on Shiba Inu’s early gains are looking for the next big memecoin opportunity. With its attractive combination of gaming, education, and rewards, Meme Moguls could be just that.\n\nThis play-to-earn platform enables users to step into a realm of virtual meme trading. So get ready to channel your inner Elon Musk and invest your way to the top of this revolutionary new trading virtual platform. The fun is big, but the rewards are bigger!\n\nUsers compete with friends and other players through simulated investing to build the most successful meme portfolio. Those who use the investment strategies to their advantage can turn simulated profits into real cashable returns.\n\nThe MGLS token is the native currency within the Meme Moguls ecosystem. Holding it comes with staking rewards, governance rights, and funds to purchase items from the in-game marketplace.\n\nInvestors can now purchase MGLS tokens at a reduced price of $0.0027 during stage 4 of the Meme Moguls presale. This price will keep increasing in each presale stage, so early investors stand to make the most gains.\n\nMarket experts have pointed out that Meme Moguls distinguishes itself within the saturated memecoin arena through its unique combination of gaming, educational elements, and substantial rewards.\n\nThis unique mix positions Meme Moguls favorably for substantial growth, with analysts suggesting that a 100-fold increase in its value as it enters the broader market is within the realm of possibility.\n\nVisit Meme Moguls\n\nEthereum (ETH)’s Fee Surge: A Roadblock or a Path to Innovation?\n\nAccording todata from Ycharts, Ethereum gas fees have risen 141% in the last year to a current fee of 0.9084 USD/tx at the time of writing. These Ethereum fees rise when the network is congested, making transactions more expensive and slower.\n\nEthereum’s rising fees have caused layer-2 solutions such as Arbitrum to gain popularity as they offer faster and cheaper transactions. However, Ethereum’s modular approach could take some time to come to fruition, and in the meantime, many investors are turning to alternative cryptocurrencies.\n\nThe EIP-4844 upgrade is another potential solution to the high fees on Ethereum, as it uses blobs to make it cheap to send layer-2 data to the mainnet. EIP-4844 is due to go live in the first half of 2024.\n\nPricewise, Ethereum has recently breached the $2,130 resistance level that had held the price down for more than a year. However, the momentum has stopped, and the price is now consolidating beneath the $2,400 level. The potential for aspot Ethereum ETFcould be the next big catalyst as it opens up the market to a broader investor base.\n\nFor more information about the Meme Moguls (MGLS) presale follow the link below:\n\nWebsite: https://mememoguls.com/\n\nTwitter: https://twitter.com/meme_moguls"
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPTE5rQkg3NDZiNVRKUHFmUS10Nk9BTVlNSEdRQ1RfczZPclRRdGdNYW9obXBNSFpFVlhSeGRvdUxCd2VSOGZFQUZZSWlRa3VzeTBRZXJxLUhPVjRBUHpXbDBLSS1DUEI5M25mQy1YckpjTHZaNUxGai1pXzhVMXJDV1ozeGdSZUZZdkxpWjdRNUtXSkhhOVRkX3NFZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Climbs 10.12% In Bullish Trade By Investing.com - Investing.com UK",
        "content": "Investing.com - Ethereum was trading at $2,478.51 by 20:47 (20:47 GMT) on the Investing.com Index on Wednesday, up 10.12% on the day. It was the largest one-day percentage gain since November 9, 2023.\n\nThe move upwards pushed Ethereum's market cap up to $294.87B, or 17.19% of the total cryptocurrency market cap. At its highest, Ethereum's market cap was $569.58B.\n\nEthereum had traded in a range of $2,342.21 to $2,480.04 in the previous twenty-four hours.\n\nOver the past seven days, Ethereum has seen a rise in value, as it gained 10.36%. The volume of Ethereum traded in the twenty-four hours to time of writing was $25.32B or 24.56% of the total volume of all cryptocurrencies. It has traded in a range of $2,167.4207 to $2,480.0354 in the past 7 days.\n\nAt its current price, Ethereum is still down 49.04% from its all-time high of $4,864.06 set on November 10, 2021.\n\nElsewhere in cryptocurrency trading\n\nBitcoin was last at $45,849.8 on the Investing.com Index, down 2.27% on the day.\n\nTether USDt was trading at $1.0006 on the Investing.com Index, a gain of 0.01%.\n\nBitcoin's market cap was last at $900.73B or 52.52% of the total cryptocurrency market cap, while Tether USDt's market cap totaled $94.38B or 5.50% of the total cryptocurrency market value."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOQmR1MW50M0dZMFZ1eTdHNGYwUnBmcTU5WXZxWUQxVTY4THpNUzVRcjkxVThPYXI3R3Y2aldwNG0yQVhfejJSR0pPUlBWR1ZodXY4TDhyckJpQ3JuOTlJdnhjRHh1eXd6LWUtWjVFZnphRzlycFI4a0FZMVpMU0hrbTdFd25TWXNZSGtEV3RiaFVMR0x5WHpFUEdidER0YUJ3RjZOR21MZi0zYzRVTmY2a3ItQVJwLUhmR2M2aXczZ9IBzAFBVV95cUxNTG1uWDNrSzZINWlxanF1VWttdXRIYUt3Q19mWTRHeEc1RlQwdFdQZ20zVnlCSnZQVm1rMUx5VGJWYjM3aXA5bGNaa01EczZoSG5CMV9VU2hLS0NpTktLM3loUHo4a3RabllyTzUteUZjdFVnZ215b09nRl9XdkE5LWdEeGRsZjdQMFd0MHRkb28yMzJILWtFcHhJd3VMVXdNci1GNnR5ZTJCTUtNNUZ3ekFVWkdkZTZJWFZrNzdxU05jQXRsUVhZYzgtblc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "How To Get zkSync Airdrop: Free Crypto Airdrop Guide 2024 - Analytics Insight",
        "content": "zkSync airdrop has emerged as one of the hottest and the most sought-after crypto airdrops of 2024. Users are flocking to the Ethereum L2 to earn points for a potential free share in the zkSync token which is set to release later this year. This article is going to be a comprehensive guide on how to maximize your eligibility chances for free tokens."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNMTIwcTFTeW80aWs0dEI4TGo5OVNoTk5ZNzA0Q0dlczNJUTNCZkMzM2Z5dDctSmFzdjJDakxCTGRzdzAwR3hSOC1KSmRFejlldk9mVDVjdmU4YksycFdSSzl3QjBhU0F3UlhJYXFPakRCNGh0d0pDbXhYVHktTC1JLW9hQnctdGhzc1p3VERJZVZZQXI0LWdmeGtrS25sYy1K0gGmAUFVX3lxTE9MMWhyTU5zam5IUmxuYkZSMXZvYUpqWTkySjAzWlRtdzh0Y3hHNThYMGpDaDBOSG9xRlFBNDBqVjl6ZkVpSkI0T1BfaHgyTTI3eTROdmUyVlpwNUtXYUp1NWxjWUx5TnAwYU1lajRjZHJRczNacGR3Z0w3RWswWHg2dEY4UVI1eFRjN0FEOW9oLW9RTnk4dHFCLWN0d1lQLTliSUhPS2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Classic (ETC) Explodes Over 50% In Massive Price Jump – Here’s Why - NewsBTC",
        "content": "The long-awaited arrival of a Bitcoin spot ETF in the US has sparked a surge in cryptocurrency prices, with Ethereum Classic leading the charge among altcoins.\n\nAfter languishing around $20 for months, Ethereum Classic (ETC) has skyrocketed over 50% in the past seven days, currently hovering around $29.45 and just a breath away from reclaiming the $30 mark.\n\nThis impressive rally comes amidst a broader market upswing triggered by the Securities and Exchange Commission’s (SEC) historic approval of the Bitcoin Trust ETF on January 10th, 2024.\n\nRelated Reading\n\nETC price action in the last week. Source: Coingecko\n\nEthereum Classic Surge: A Combination Of Factors\n\nETF-fueled optimism: The approval of the Bitcoin spot ETF signifies increased institutional interest in the crypto market, a development that traditionally benefits the entire ecosystem, including altcoins like ETC. This optimism is reflected in the strong performance of other major cryptocurrencies, with Ethereum witnessing a 10% climb and briefly hitting a 20-month high above $2,600.\n\nEthereum Classic’s unique appeal: Compared to its Ethereum counterpart, Ethereum Classic boasts a smaller market cap and lower transaction fees, potentially making it a more attractive option for traders seeking higher returns and cheaper on-chain activity. Its recent network upgrades have also bolstered confidence in its technological capabilities.\n\nSpillover effect and community hype: The Bitcoin ETF approval has undoubtedly fueled a general sense of bullishness across the crypto landscape, influencing investor sentiment towards altcoins with perceived potential. Additionally, the strong community support and active development around Ethereum Classic further contribute to its upward momentum.\n\nETC market cap currently at $4.248 billion. Chart: TradingView.com\n\nETC Trading Volume Soars\n\nThe surge isn’t just limited to price. Ethereum Classic’s trading volume has also soared by a staggering 276% in the past 24 hours, reaching a volume of $1.8 billion.\n\nThis increase in trading activity further validates the market’s interest in Ethereum Classic and potentially indicates continued upward pressure on its price.\n\nHowever, it’s crucial to remember that the crypto market remains highly volatile. While the Bitcoin spot ETF approval and Ethereum Classic’s recent performance are positive indicators, investors should conduct thorough research and consider both the potential benefits and risks before making any investment decisions.\n\nRelated Reading\n\nWith its strong community, technological advancements, and now, the tailwinds of the Bitcoin ETF approval, Ethereum Classic has positioned itself as a frontrunner in the current altcoin rally.\n\nWhether it can sustain its momentum and break through the $30 barrier remains to be seen, but its recent performance signals a renewed level of enthusiasm for this resilient blockchain project.\n\nFeatured image from Shutterstock"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9EMUhTRG5Qa2QxWkI1LWZQLVEyajdkQ0FEcWx1VVBiVUM4ZTVxb0lzTm8zSnE3bDJ3SFZPYUhIRlA3elpJUmFnVWlMQmhjSlRyQ1REQTVUU0o1ZlBwQlNfR28ybjBjekhPVTd1TkNEZHA0Yzd0Wm5XUXdpV2Uwd9IBgwFBVV95cUxQNXlUWFN0dWhGTXFvVU5ieFlmTmwwYkt1ZVRjMUZxTE5BZHRrS2piby1iT25KbzZEUjZGdWw1ZUNrZm1rVkp5bm9yYm43cDF6dFFMZnlOWEJpdnFOd3ZoVXpwRDVEQ1JZbV9sc3MwOWh4bUdpa2RUWWp3Nm1iUm9SRjFGZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Analyst Predicts 100% Rise Against Bitcoin - NewsBTC",
        "content": "Crypto analyst Michaël Van De Poppe recently made a bullish prediction for the Ethereum price against Bitcoin in the near future, noting the path for this to happen. According to a social media post by the analyst, price action on the ETH/BTC pair for the next months will center around spot Bitcoin ETFs, with a rotation into ETH also in the prediction.\n\nAnalyst’s Prediction of 100% Ethereum Price Rise Against Bitcoin\n\nMichaël Van De Poppe recently took to X to share a chart of Ethereum’s price performance against Bitcoin (ETH/BTC pair) on the weekly timeframe. Price action on the chart forms green (bullish) candles during periods of Ethereum’s performance over Bitcoin, while red (bearish) candles are formed during periods of Ethereum’s underperformance against Bitcoin.\n\nRelated Reading\n\nXRP And XLM Price Correlation Persists, Ripple CTO Explains Why 8 months ago\n\nTaking a look at the chart shared by Van De Poppe shows that Ethereum’s performance on the ETH/BTC pair has been on a decline since the middle of 2022. This decline particularly increased during the last quarter of 2023, as the enthusiasm regarding spot Bitcoin ETFs led to a surge in the price of Bitcoin. Consequently, the analyst noted that Ethereum’s price performance against Bitcoin is now around the 2022 low of 0.04922.\n\nAccording to Van De Poppe, the approval of the long-awaited spot Bitcoin ETFs could lead to the creation of another liquidation candle on ETH/BTC to eventually take the liquidity around the 2022 low. This would eventually lead to a rotation into Ethereum, combined with a bullish weekly divergence.\n\nAs a result, the ETH/BTC pair would be propelled to a target just above 0.12 by the rotation, signifying an increase of more than 100%. Notably, the last time ETH reached this level on the ETH/BTC pair was during the crypto’s first major bull run in 2018.\n\n#Ethereum approaches the low of 2022 and is likely going to take the liquidity there. If an ETF approval for #Bitcoin happens, I think we’ll have a liquidation candle on ETH/BTC and after that a rotation into Ethereum, combined with a bullish weekly divergence. pic.twitter.com/kGq91S7kq9 — Michaël van de Poppe (@CryptoMichNL) January 9, 2024\n\nETH bulls regain control of price | Source: ETHUSD on Tradingview.com\n\nThe Rotation Game Has Started\n\nSpot Bitcoin ETFs have been approved by the SEC on Wednesday, causing the price of Bitcoin to spike to $48,600, its highest point since April 2022. However, the price of Bitcoin has stalled and is now trading at $45,839, about where it was when the news of the approval of spot Bitcoin ETFs came out.\n\nAt the same time, Ethereum rose over $2,500 to reach $2,600, its highest point since April 2022. Ethereum has maintained this gain to outperform Bitcoin and is trading at $2,618 at the time of writing.\n\nRelated Reading\n\nIs Cardano The Next Solana? Institutional Investors Clamor For ADA Exposure 8 months ago\n\nAccording to another post on social media by Michaël Van De Poppe price action since the approval of spot Bitcoin ETFs suggests that the rotation is already happening on the ETH/BTC pair.\n\n“The rotation game is happening already,” he stated, adding a $3,500 price target for ETH.\n\nThe rotation game is happening already. A massive weekly bullish divergence on the $ETH / $BTC pair suggesting that we’re going to have a strong run on Ethereum, and altcoins. We’re at January 2016, good times ahead. Ethereum to $3,500. pic.twitter.com/H72vZDFNFR — Michaël van de Poppe (@CryptoMichNL) January 11, 2024\n\nInvestors are now anticipating the approval of spot Ethereum ETFs, which could also drive up the price of ETH.\n\nFeatured image from AMBCrypto, chart from Tradingview.com"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE5MbnVvNFMxem90VnQtSlNJSHhTODMzenJILWg5Y3lPNTNpS0s2NzlmSXhIZ0ZnZ0VBb3JLRFZFNU9tWHItWFpQSkRoS09vSDQ1NUV0eVo1VTI0UlhzSGVTSHZsNjhLb2ZSaXk4Q05VQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "How to Add RPC Networks and Send Crypto From Metamask - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "MetaMask is a versatile wallet that supports Ethereum and other EVM-compatible blockchains. This guide will help you add various networks, including Arbitrum, Optimism, and Injective, ensuring a broad range of capabilities for your MetaMask wallet.\n\nInstalling and Setting Up MetaMask Download MetaMask: Visit the official MetaMask website and download the extension for Chrome, Firefox, Opera, Brave, or as a mobile app for iOS and Android. Install the Extension: For Chrome, click “Download for Chrome” and then “Add to Chrome”. Create or Import a Wallet: After installation, click “Get Started”. You can either import your existing wallet using a seed phrase or create a new wallet. Secure Your Wallet: If creating a new wallet, set a strong password. Note down your seed phrase securely and never share it with anyone. Confirm Seed Phrase: Verify your seed phrase by selecting the words in the correct order. How to add RPC Networks to MetaMask Adding RPC Networks Manually Using Metamask You can add an unlimited number of networks, including mainnet and testnet options, to your MetaMask wallet. How to add Arbitrum? 1. Access Network Settings: Open MetaMask, click the network dropdown menu near the logo.\n\n2. Add Network Details: Click “Add Network” and enter the following details for Arbitrum: Network Name: Arbitrum One\n\nNew RPC URL: https://arb1.arbitrum.io/rpc\n\nChain ID: 42161\n\nCurrency Symbol: ETH\n\n\n\n3. Save and Use Arbitrum: Click “Save”. You can now use the Arbitrum network. If you haven’t installed Coinbase Wallet, do so and set up your account.\n\nOpen the Coinbase Wallet extension and view your balance.\n\nSelect “Receive” to find your Arbitrum address.\n\nCopy the Arbitrum address.\n\nAccess your MetaMask Wallet extension and log in.\n\nEnsure you’re on the Arbitrum network; switch to Arbitrum Mainnet if necessary.\n\nClick “Send”.\n\nIn the “Send To” window, paste the Coinbase Wallet address.\n\nEnter the amount of ETH you want to send.\n\nProceed by clicking “Next”.\n\nReview the recipient address, gas fee, and transfer amount on the confirmation page.\n\nConfirm the transaction. In MetaMask, check recent transfers under the “Activity” tab.\n\nIn Coinbase Wallet, view recent transactions via the transaction icon. How to add Optimism? 1. Access Network Settings: In MetaMask, click the network dropdown menu.\n\n2. Add Network Details for Optimism: Network Name: Optimism\n\nNew RPC URL: https://mainnet.optimism.io\n\nChain ID: 10\n\nCurrency Symbol: ETH\n\n3. Save and Use Optimism: Click “Save” to start using the Optimism network. Log into your Kraken account.\n\nNavigate to the deposit section and select Ethereum (ETH).\n\nCopy the ETH deposit address provided by Kraken.\n\nOpen your wallet that holds your Optimism-based ETH.\n\nEnsure that your wallet is connected to the Optimism network.\n\nIn your Optimism wallet, select the option to send or transfer funds.\n\nThis action typically involves clicking a “Send” or “Transfer” button. Paste the Kraken deposit address into the recipient field.\n\nEnter the amount of ETH you wish to send to Kraken.\n\nReview any transaction fees that may apply and adjust the amount if necessary.\n\nDouble-check the details, especially the Kraken deposit address.\n\nConfirm the transaction in your Optimism wallet.\n\nThe transaction will be processed, and the ETH will be sent to your Kraken account. Log back into your Kraken account after the transaction.\n\nCheck your balance or transaction history to confirm the receipt of ETH. How to add Injective? To connect MetaMask to Injective, follow these steps: Navigate to the Injective Network Hub website. Click ‘Connect’ at the top of the page. Select ‘MetaMask’ from the available options. MetaMask will automatically link to the Injective network, creating a unique ID tied to your EVM wallet address.\n\nHow to add Avalanche? 1. Access Network Settings: Open MetaMask, click the network dropdown menu near the logo.\n\n2. Add Network Details: Click “Add Network” and enter the following details for Avalanche: Network Name: Avalanche C-Chain\n\nNew RPC URL: https://api.avax.network/ext/bc/C/rpc\n\nChain ID: 43114\n\nCurrency Symbol: AVAX\n\n\n\n3. Save and Use Avalanche: Click “Save”. You can now use the Avalanche. Sign in to your Binance account.\n\nGo to the ‘Funds’ or ‘Wallet’ section and select ‘Deposit’.\n\nChoose AVAX (Avalanche) from the list of cryptocurrencies.\n\nCopy the AVAX deposit address provided by Binance.\n\nOpen the wallet where your AVAX tokens are stored.\n\nEnsure that your wallet supports AVAX and is connected to the Avalanche network.\n\nFind and click on the “Send” or “Transfer” option in your AVAX wallet.\n\nThis action typically involves selecting a button or tab within the wallet interface. Paste the Binance AVAX deposit address into the recipient field.\n\nSpecify the amount of AVAX you want to send to Binance.\n\nBe mindful of any network fees and adjust the sending amount if necessary.\n\nDouble-check all the details, especially the Binance deposit address.\n\nConfirm the transaction within your AVAX wallet.\n\nThe transaction will then be processed, and the AVAX will be sent to your Binance account. Log back into your Binance account after some time.\n\nCheck your AVAX balance or review your transaction history to confirm the deposit. How to add Binance Smart Chain? 1. Access Network Settings: Open MetaMask, click the network dropdown menu near the logo. 2. Add Network Details: Click “Add Network” and enter the following details for Binance Smart Chain: Network Name: Binance Smart Chain\n\nNew RPC URL: https://dry-purple-forest.bsc.quiknode.pro/83528916be057ba132db188808697bf7cd64232d/\n\nChain ID: 56\n\nCurrency Symbol: BNB\n\n\n\n3. Save and Use Binance Smart Chain: Click “Save”. You can now use the Binance Smart Chain. How to add Polygon Mainnet? 1. Access Network Settings: Open MetaMask, click the network dropdown menu near the logo.\n\n2. Add Network Details: Click “Add Network” and enter the following details for Polygon Mainnet: Network Name: Polygon Mainnet\n\nNew RPC URL: https://polygon-rpc.com\n\nChain ID: 137\n\nCurrency Symbol: MATIC\n\n\n\n3. Save and Use Polygon: Click “Save”. You can now use the Polygon Mainnet. Log into your eToro account.\n\nGo to the ‘Portfolio’ section.\n\nLocate or add MATIC (Polygon) to your portfolio.\n\nChoose the option to deposit MATIC and copy the provided deposit address. Open the wallet where your MATIC is stored.\n\nEnsure that your wallet is connected to the Polygon network.\n\nSelect the “Send” or “Transfer” option in your MATIC wallet.\n\nThis action is usually initiated by clicking a button or tab within the wallet. Paste the eToro MATIC deposit address into the recipient field of your wallet.\n\nSpecify the amount of MATIC you want to send to eToro.\n\nTake note of any network fees and adjust the sending amount accordingly.\n\nDouble-check all details, especially the eToro deposit address.\n\nConfirm the transaction in your Polygon network wallet.\n\nThe MATIC will then be sent to your eToro account. After the transaction, log back into your eToro account.\n\nCheck your MATIC balance or review your transaction history to confirm the deposit. How to add Linea? 1. Access Network Settings: Open MetaMask, click the network dropdown menu near the logo.\n\n2. Add Network Details: Click “Add Network” and enter the following details for Linea: Network Name: Linea\n\nNew RPC URL: https://linea.blockpi.network/v1/rpc/public\n\nChain ID: 59144\n\nCurrency Symbol: ETH\n\n\n\n3. Save and Use Linea: Click “Save”. You can now use the Linea. Using ChainList to Add Networks ChainList is a convenient platform for adding custom networks to MetaMask: Visit ChainList: Go to the ChainList website. 2. Sync MetaMask with ChainList: Connect your MetaMask wallet to ChainList.\n\n3. Search for Networks: Use the search function to find the network you want to add.\n\n4. Connect Wallet: Click ‘Connect Wallet’ for the chosen network to add it to MetaMask.\n\nFinding the Right Contract Address To avoid losing funds, always verify the contract address from the project’s official website or trusted sources like Etherscan, Polygonscan or Arbiscan. How to Find an Ethereum Contract Address A block explorer is a web-based application enabling users to browse and search the Ethereum blockchain for various activities, including transactions, addresses, tokens, and current prices. Etherscan stands out as the most widely used block explorer for Ethereum. These platforms are useful for locating contract addresses, which can be done by searching for either the decentralized application (dApp) or the contract directly.\n\n\n\nMost Ethereum wallets compatible with ERC-20 tokens, such as MetaMask, Trust Wallet, or MyEtherWallet, typically provide the contract addresses for the tokens they support. If you hold a particular token in your wallet, you’ll often find its contract address displayed within the wallet’s user interface. Numerous decentralized applications (dApps) and token projects list their contract addresses on their official websites. These addresses can typically be found in sections such as the FAQ, at the bottom of the homepage, or within the documentation area of the site. Individuals with technical expertise have the option of employing developer tools and Web3 platforms for a more direct method of locating and engaging with Ethereum contract addresses. Covalent, for instance, offers powerful APIs that facilitate the querying of blockchain data, which includes the discovery of contract addresses. Practical Uses of Ethereum Contract Addresses Prior to sending or receiving ERC-20 tokens, which are the standard format for tokens based on the Ethereum blockchain, it’s crucial to confirm the token’s authenticity by verifying its contract address. This step helps ensure that you are interacting with the genuine token and not a fake one. When engaging with decentralized applications (dApps), being aware of the contract address is essential for direct interaction with the smart contract. This knowledge is particularly useful for various activities, such as executing trades, engaging in decentralized finance (DeFi) protocols, or utilizing a decentralized exchange (DEX). For developers, the comprehension and utilization of contract addresses are fundamental aspects. Each time a new contract is deployed on the Ethereum blockchain, it generates a unique address. It’s crucial for developers to record this address for any subsequent interactions with the contract. Key Considerations and Safety Tips Always double-check addresses : Given the irreversible nature of transactions on the blockchain, it’s imperative to verify the accuracy of the contract address you’re interacting with to avoid any irreversible errors.\n\n: Given the irreversible nature of transactions on the blockchain, it’s imperative to verify the accuracy of the contract address you’re interacting with to avoid any irreversible errors. Beware of scams : In the realm of cryptocurrency, phishing and scams are common threats. It’s crucial to use contract addresses obtained only from reliable and trusted sources to ensure safety.\n\n: In the realm of cryptocurrency, phishing and scams are common threats. It’s crucial to use contract addresses obtained only from reliable and trusted sources to ensure safety. Understand gas fees: Engaging with Ethereum contract addresses necessitates the payment of gas fees, and these fees can fluctuate depending on the level of network congestion. Using Rainbow Wallet Rainbow Wallet: For Ethereum-based tokens, If you want to experience to use a New crypto wallet consider using Rainbow Wallet."
    }
]