[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOcmNKZnhVOVZQSWhUNzVnQlltOHF6alBxNTRzT0RubkxiRVZOYm9UQUt4eExiOV82M1pUcnI5QzVfQW9XektfZEYyWkEza1R3UGtUY1Nkd1FNUmQ4b0F3WkRsN0tWX2VIZnNsS1QxREpvS1hVa2I5TkVvQ0lIX19qRFdEdmJIdTNxUXE5Tmx0VjBQUVozenRwRHZvRm1qN05WRnVqc0U4N0w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Watch Kraken Head of Strategy: Ethereum ETF Is a Big Deal - Bloomberg - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPcHU5Ry1HZWwtOXRWUE8zVnlydjQ3bnl1b2xJd21EZUZ4bC1tYXAxSEZkR1hJSWV5YndWeVBZWEpISXZnMWw2WDNTdll4bXdTbUsyRzFzaUtISnBkdXExOVNBRUZ3eEYtT05pYkI3MkxKZmxvZ0QyYVdobUhmSS1VX1NNaTlPLU5WTEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Kraken exec expects Ethereum ETF launch to ‘lift all boats’ - CryptoSlate",
        "content": "Kraken Head of Strategy Thomas Perfumo said spot Ethereum (ETH) ETFs could help the crypto sector while commenting on political developments in the US.\n\nOn July 12, Perfumo told Bloomberg that spot Ethereum ETFs would attract capital flows while attracting attention to crypto, noting:\n\n“It’s a rising tide, lifts all boat story. “\n\nPerfumo further explained that Ethereum’s eventual value “hinges on the Ethereum ETF.”\n\nHe said that the crypto market is “pricing in” $750 million to $1 billion of net inflows to Ethereum products on a monthly basis, which would imply that Ethereum could reach all-time highs between $4,000 and $5,000.\n\nPerfumo also compared expectations to Bitcoin’s all-time high in March, which he called a “quiet peak” that occurred without any evidence of millions of new investors entering the industry.\n\nPolitical developments\n\nPerfumo also commented on political developments. Early in the interview, he said US election outcomes will “set the tone for policy making and the legislative agenda for the next four years.”\n\nHe also emphasized the importance of legislative action and clarity and noted that recent developments show bipartisan support in Congress.\n\nThe House recently decided to pass the Financial Innovation and Technology for the 21st Century Act (FIT21) and attempted to repeal the SEC’s controversial accounting rules along with the Senate. However, President Joe Biden chose to veto the resolution.\n\nPerfumo said:\n\n“Even though you’ve hit barriers at the executive level, [there’s] still good progress going forward.”\n\nHe added that the Republican party appears “more pro-crypto [and] more progressive” on the matter, noting Donald Trump’s plans to attend the Bitcoin Conference in Nashville.\n\nTrump has also made numerous statements in favor of pro-crypto policy, including at recent campaign events in Wisconsin and San Francisco.\n\nMentioned in this article"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOMldIeG5tdWg4ZVNmaTVOQjYwVEpNVWJmTTA0TjhLTGM4c3VkSmVLb3V5am9jd3ZQV212djYzNDJoaEJmR01rM2tWcmdYZmZWM2hHWlpHU05RaXhub0JCLXpkNUNRdlBTR2E4TTdObUZOaFZyMnBCbjU0dldzQmpnc2g0eHdzZmdZQThsOElqTGw4UU5DeGI4VVM2UU9SNTB4a0QwZU4yb9IBrAFBVV95cUxNYUFreE91V0hMaEVSTE83WkRJeERaejZuTEhIYWtBcjN3ekswd1dINUszcnp6a0FLTDZ5QTA5WDFwT05Eb0pCQ2YzTUtHWUFzSkxOTXJWTGpzNUVicFNMWGw3LW1CNGpzdmJXdUZhRjF3c2NqeXhGZWVoeFY0a0ViUktpZm9LLXZSSDBiTjRON2RWS0pzWHJZbWNjaGpZcWFMVlJUNzFjeDBVWTl6?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Is ETH on the Verge of a Deeper Correction Toward $2.7K? - CryptoPotato",
        "content": "Ethereum’s price has been dropping recently, following a second rejection from the $4,000 resistance level, and it has yet to recover.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily chart, the price has been making lower highs and lows since failing to break the $4,000 level to the upside a while ago. The market has also broken below the 200-day moving average, around the $3,100 mark.\n\nThe price is currently retesting the 200-day moving average but is seemingly getting rejected to the downside. As things currently stand, the cryptocurrency seems likely to drop toward the $2,700 support level in the short term.\n\nThe 4-Hour Chart\n\nThe 4-hour chart demonstrates a zoomed-in view of the recent price action. As evident, the downtrend has recently been aggravated to the downside, with the market briefly breaking below the $3,000 support level.\n\nYet, following an oversold signal by the RSI, the price has recovered above the mentioned support zone. However, the price seemingly lacks the momentum to continue higher and might be on the verge of a deeper decline toward the $2,700 area.\n\nOn-Chain Analysis\n\nBy TradingRage\n\nEthereum Exchange Reserve\n\nDuring the Ethereum downtrend in the last few weeks, many analysts have been looking for signs of capitulation that point to a potential bottom. Some signals are becoming evident.\n\nThis chart displays the Ethereum Exchange Reserve metric, which measures the amount of ETH held in exchange wallets. An increase shows potential selling pressure, while a decline indicates a decrease in supply.\n\nFollowing the recent brief decline below the $3,000 level, the exchange reserve metric has experienced an increase above its 30-day moving average. This might indicate the beginning of the capitulation phase, as many investors’ stop losses were below the $3,000 level."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPcXhGUWZudF9RWWJpVE1xWnVic0Z4NHlBS3lKUEJXc0hhZHZSUExTalBvU2FQTEp0SUl1RWplZUR1Z2lVZFA3VkxENHpQN182RWtCakpYNzFvSE1hRnFLUlNMcTNTZ3RCMnZOQ1IxSWR1QVJPdU81NVd5dVpoWnBDOF8xQVNkNkk1TUF6RWlBT2Z2eXJiNnlVMmNXRjl6dnI4d2VKVGdjWGdsWXl4RDM4Mkp2Y3RyZGZoQ09lcmJ5cTQyVmZFZEhub3NpU1lCTm5aT2hOctIB2gFBVV95cUxPdDl0MHRRNUI0SnM1QTJWSWdUbmZ2X184WHJWaWpLWDJ5YWFUY2t2bGpyQmFKMktCREtibFlXaVlUMWU1blFPQXhFMVI3MERNY3JxZl9sdzFwam9HVkR2eUR3NWpNbmZzUXVkTGl0b3JJWUZmeHVmenJQcnpsXzN1OTRmbUtFVmRhSFVQWG42cllrekRWYnV4dUhDT0RBVmNNSFItNjUtbWpoOGRwZ0Q3a2Q0cXJxMk1JZEhNazV5dnJwUW5NRjZBMjEzQ1A5TGpwV095RUhHY1VWZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum on-chain activity reveals mixed signals amid declining inflation - FXStreet",
        "content": "Ethereum could rally in Q3 following reduced US inflation and launch of spot ETH ETFs.\n\nEthereum's on-chain activity shows mixed sentiment among investors.\n\nBearish exhaustion candle could signify a downturn for ETH if SEC delays ETH ETF approval.\n\nEthereum (ETH) is up 0.5% on Thursday following cooling inflation reports in the US. However, mixed on-chain sentiment signals uncertainty among investors despite the potential launch of spot ETH ETFs.\n\nDaily digest market movers: CPI data, mixed on-chain signals, increasing supply\n\nEthereum's price is expected to react positively in the coming days to the recent decline in the US Consumer Price Index (CPI), a metric for measuring the cost of goods and services. The CPI for June declined by 0.1% from May, beating market expectations and reaching a three-year low. As a result, many expect the Federal Reserve (Fed) to cut rates in September.\n\nCombined with the potential launch of spot ETH ETFs in the coming days, many expect Ethereum to have a positive Q3. This also aligns with predictions from JP Morgan analysts that the crypto market will rebound in August.\n\nAlso, on-chain activity shows that Ethereum has been facing a flurry of exchange deposits and withdrawals in the past 24 hours, according to data from Lookonchain. This shows mixed sentiment and uncertainty among ETH investors. As some are de-risking, others are accumulating their selling pressure, keeping the price of ETH in a somewhat horizontal trend.\n\nThe key transactions include Golem pausing its ETH selling spree after staking 40,000 ETH, a whale depositing 10,000 ETH into Binance, another withdrawing 16,074 ETH in the past week, and HTX founder Justin Sun increasing his ETH holdings.\n\nMeanwhile, despite increasing staking deposits, ETH's supply has started trending upwards since the Ethereum Dencun upgrade in March. As the chart from Bitwise below shows, ETH's supply trended downward to -450K between The Merge and Q1 '24. It started moving upwards in Q2'24 following the Dencun upgrade. If ETH continues on this path, it will lose its deflationary status.\n\nETH Supply change since The Merge\n\nETH technical analysis: Ethereum posts bearish exhaustion candle\n\nEthereum is trading around $3,125 on Thursday, up 0.5% on the day. ETH has seen $26.27 million in liquidations in the past 24 hours, with long and short liquidations accounting for $17.05 million and $9.23 million, respectively.\n\nWhile the market remains gloomy, ETH is taking a slow ride up, offsetting its weekly losses as the market anticipates the launch of spot ETH ETFs.\n\nHowever, ETH posted a bearish exhaustion candle on the 8-hour time frame after attempting to sustain a move above the $3,200 price. An exhaustion candle has a long wick 2-3 times the length of its body and little or no wick on the other side. If a bearish exhaustion candle appears during an uptrend, it indicates bulls may be losing momentum, and vice versa if a bullish exhaustion candle appears during a downtrend.\n\nETH/USDT 8-hour chart\n\nIn the case of ETH, the reversal suggests that some of the over 2 million addresses that purchased ETH around $3,200 sold as they broke even, according to earlier predictions.\n\nWhile it seems ETH may tilt toward the downside after the bearish exhaustion candle, optimism from lower-than-expected CPI data and the Securities & Exchange Commission (SEC) approving issuers' ETH ETF S-1 drafts may see it attempt another move above the $3,200 price level. The move up may see $3.73 million worth of shorts being liquidated around the $3,222 price level.\n\nHowever, if the SEC continues delaying approval of ETH ETF, Ethereum will likely fall back to the $2,900 to $3,000 price level."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPRElTWXhqd0tpd0ZtdjNGOWcyX29jY3hpa0poWDRYUklwWndGLTJmeWJqYXlCNE9kT0Uwb21IY3Q5aU5HamlHZFN1S0lFUnZrNmpfNTliWmtabjUtZXJ4cmdSZ0w4cmFnVVBLS3BENTdvbTYxUkg0elYyZ2ozMGNuMm50aXRaTGRDMHpydjJZMF9aSV9PS2RkZmJXejVDNXU50gGmAUFVX3lxTFBzdW1JU0F0SmZSay1Jb3JhYTlnLWNyOGlaVWZrX2k4LWk0eDVEQ1RRczBMS1pmSHp6aHpNSFJWQ3EwcnB6Q2ZkY2twUUJRQVhPcDRId0Vzcm5pekN3YXh0bGo3THNGX2s4UF9sR1NrNFB2QzNYUmd3WG9aemNrYUxQR3BZTXJmeHJRMTNLc3lYWUtlbFpVTzJnSmNzS0tkZWtlN1d1dGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price To Hit $5,000 As ETH ETF Speculation Ignites Bullish Comeback - CoinGape",
        "content": "Ethereum price has seen a notable increase in value over the past day following the market recovery. ETH price is hovering above $3,100 after an upward trend over the recent hours.\n\nAs of the time of writing, Ethereum price is trading at $3,155 with a surge of 3% during the US trading hours. The current market capitalization stands at $379 billion, according to CoinMarketCap data.\n\nadvertisement\n\nThe trading volume for Ethereum has experienced a significant increase, rising 27% in the past 24 hours to approximately $11 billion. This uptick in volume indicates heightened trading activity and interest in Ethereum during this market recovery period.\n\nOver the past week, Ethereum price has been trading in a range bound between $2,800 and $3,1500. The popular cryptocurrency saw a 5% increase in value over the seven days. During this time, several market events have influenced price movements. A significant drop was observed, where prices briefly dipped before recovering strongly above the $3,100 mark.\n\nEthereum Price Gains Traction: ETF Speculation Fuels Optimism\n\nEthereum’s spot ETF might trigger significant investments into the cryptocurrency sector, potentially seeing $1 billion added monthly. This forecast comes from Thomas Perfumo, Kraken’s Head of Strategy, during his Bloomberg interview.\n\nPerfumo highlighted the Ethereum spot ETF as the foremost of four major growth drivers for the cryptocurrency market in the latter half of 2024. He predicts the ETF’s approval would garner substantial interest from the broader financial community, channeling more capital into cryptocurrencies. According to him, this development marks a pivotal moment, promising to transform market dynamics by attracting new investors.\n\nCan ETH Potential Surge Towards $3,300 Soon?\n\nEthereum price prediction is on the brink of a significant market move. If it successfully breaks through the $3,200 resistance mark, it could ignite a bullish trend, pushing its value close to $3,300. This surge could set the stage for a challenge against the $3,400 level.\n\nConversely, a market downturn could see Ethereum price retreat to the $3,100 support. Prolonged bearish pressure might further drive its price down to $2,900, signaling a potential bearish shift in the market trend.\n\nTechnical Indicators Show Signs of Bullish Momentum for ETH\n\nThe 4-hour technical indicators for Ethereum price show signs of a bullish trend. The Moving Average Convergence Divergence (MACD) indicator currently displays a positive crossover. The MACD line (blue) has crossed above the signal line (orange), suggesting potential for upward price movement.\n\nThe Relative Strength Index (RSI) is positioned at 57. This level is slightly below the overbought territory (typically above 70), indicating that there is still room for upward price momentum before the asset becomes overbought.\n\nFrequently Asked Questions (FAQs) 1. What is Ethereum 2.0? Ethereum 2.0, often referred to as Eth2, encompasses a series of upgrades aimed at enhancing Ethereum's scalability, security, and sustainability. 2. When will Ethereum 2.0 be released? The initial phase, the Proof of Stake Beacon Chain, was launched in December 2020. The final integration, known as The Merge, which combines Ethereum Mainnet with the Beacon Chain, was anticipated in the first half of 2022. 3. Can Ethereum reach a new all-time high? Market conditions and technological advancements such as Ethereum ETF could potentially drive Ethereum to surpass its previous highest price.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNaFdKTk5wMmZvNFpfZE9FUGltLTRtZkFZb2ZNeDNfSFhyY0xTaGZqRy12eUNFd1pMdXJXdnA4cGdLRFJ1NEhWR184Q0pLSnNMc3E4clNyTGdqMFI4RWQ1WDJuLXBoOVRweWx4T2FRekxlVGtWSjFsMlJvZTh3RGVCaTY1LWI1VFFmTmfSAY8BQVVfeXFMUFN2VXFQeTBPVXRiSEg2ME15TWlfcUxMdzhuOEloUkJ4bGhHX2R1bC1Vc0JZYVMxNGs3QmVxY0RWU09QMHhvbmtIYll1T2E2bVVHRFdLRWh6M1ZZQnlHY2VxYmFvWVpjcFd6V3ZRd0lRSUYzVlBFZ2dVX0tnS0VLVXhqMHBuNjRMRDZQOUx4Uk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum’s balancing act: Whale deposits vs. exchange reserves - AMBCrypto News",
        "content": "Ethereum whales have been active with deposits in the last few days.\n\nETH has been on a decline after failing to sustain recovery attempts.\n\nIn recent days, Ethereum [ETH] has experienced varied price movements, with attempts at recovery frequently negated by ensuing declines.\n\nConcurrently, there has been a notable influx of ETH into exchanges, a movement largely attributed to whales transferring large volumes.\n\nWhile the immediate assumption might be that these large inflows could lead to price drops, further analysis sheds additional light.\n\nEthereum whale deposits more ETH\n\nRecent data from Lookonchain revealed that a whale wallet deposited 10,000 Ethereum coins, valued at over $31 million, to the Binance [BNB] exchange.\n\nThis transaction continued a pattern for this particular whale address, which has transferred a total of 30,000 ETH, worth more than $94 million, to Binance since the 1st of July.\n\nThis wallet is among several that have moved large volumes of Ethereum to exchanges in recent days.\n\nIncrease in Ethereum net deposits\n\nAMBCrypto’s analysis of the Ethereum netflow via CryptoQuant indicated that there have been more inflows than outflows on exchanges since the beginning of the month.\n\nThe data highlighted a significant influx at the start of the month, with over 72,000 ETH (approximately $250 million) entering exchanges.\n\nThroughout the month, there have only been three instances of net outflows. This trend suggests that more Ethereum has been deposited than withdrawn in recent days.\n\nAdditionally, it appears that substantial deposits by large whale accounts have significantly contributed to this pattern.\n\nExchange reserve remains at decent levels\n\nDespite the recent surge in Ethereum inflow to exchanges, the overall exchange reserve has not shown a corresponding increase.\n\nAnalysis of the exchange reserve chart revealed that while there has been a modest uptick in the last few days, it was relatively minor compared to the overall decline.\n\nAt press time, the reserve stood at about $52 billion, down from over $57 billion at the beginning of the month.\n\nThis suggested that the decline in Ethereum’s value may have influenced the reduced dollar valuation of the exchange reserves.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAdditionally, although there has been an increase in Ethereum volume, it has remained fairly stable, with figures hovering around the 16 million range. So, the changes in volume have not been substantial.\n\nAs of this writing, Ethereum was trading at approximately $3,071, experiencing a slight decrease of nearly 1%."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQdVNBdTYtNXMyc1A0S3p3Zmg5NDFRTmM5cGJaNkJEWF9oRUpBR3Y2QlZ5ZnFWbnJ0cjh6OENoTVFwaDY5WlNQSVpmdzRfRE05eEI3X0Y4NDFIeWJTa0I4bXZhSklvSnBBRHNKTHgySkZPVXpmbHBBTy1uSEJkekF1cnY2a1hhY3JuUkNVd3VtQ1k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin’s vision for the future of Ethereum - Yahoo Finance UK",
        "content": "Vitalik Buterin speaks at EthCC in Brussels, 2024.\n\nEach day, Coinrule will run through the state of the digital assets market for Blockbeat, your home for news, analysis, opinion and commentary on blockchain and digital assets.\n\nVitalik Buterin, co-founder of Ethereum, offered a comprehensive perspective on the current state and future of the ETH blockchain at the Ethereum Community Conference (EthCC) in Brussels. EthCC is a major event where developers and enthusiasts gather to discuss Ethereum’s advancements and challenges. In his keynote, Buterin addressed a packed room, highlighting both the strengths and vulnerabilities of Ethereum and proposing ways to fortify the network against potential threats.\n\nThe Ethereum co-founder began by outlining the strengths of Ethereum, focusing on its ability to support complex smart contracts that have fostered a robust ecosystem of decentralized applications (dApps). These applications range from decentralised finance (DeFi) to non-fungible tokens (NFTs), showcasing Ethereum’s versatility. He also praised the Ethereum community for its international and intellectual diversity, for its contributions to the network’s development and governance. It is the community that ensures the integrity and continuous improvement of the Ethereum blockchain.\n\nButerin did not shy away from discussing Ethereum’s weaknesses. He pointed out that the network struggles with handling a high volume of transactions, which leads to increased fees and delays. Security is also a concern, as Ethereum can be vulnerable to different types of attacks, including those targeting smart contracts. Additionally, using Ethereum can be complicated for new users. Newcomers may find managing wallets and interacting with decentralised applications difficult. There are also challenges in becoming a network validator. The validation process requires a significant amount of Ether (32 ETH) and technical knowledge to run a node. These issues can limit the network’s growth and its ability to attract more users.\n\nVitalik Buterin, co-founder of Ethereum, offered a comprehensive perspective on the current state and future of the ETH blockchain at the Ethereum Community Conference (EthCC) in Brussels.\n\nTo address these threats, Buterin proposed several solutions. He suggested increasing the quorum threshold from 75% to 80%. This means that a larger majority of validators would need to agree to confirm transactions. This change would make it harder for malicious actors to control the network. Buterin also advocated for automated responses to 51% attacks. During such attacks a bad actor controls more than half of the network’s mining power. This automation would allow honest validators to quickly move to a new fork of the chain. The goal behind this improvement is to reduce reliance on manual coordination. Simplifying the protocol and improving usability were also key points, aimed at making Ethereum easier and safer for everyone to use.\n\nStory continues\n\nButerin’s commitment to Ethereum’s continuous improvement was evident throughout his speech. He has been a frequent speaker at EthCC, discussing various topics over the years. In previous conferences, he tackled issues such as abstraction and the network’s evolution. His ongoing engagement with the community underscores his dedication to refining Ethereum and addressing its challenges head-on.\n\nButerin’s keynote at EthCC highlighted the dual nature of Ethereum’s journey—its strengths and its areas for improvement. By focusing on decentralisation, community engagement, and protocol simplification, Ethereum can overcome its current challenges and pave the way for a more robust future. As the blockchain continues to evolve, Buterin’s insights and leadership will remain crucial in shaping its trajectory."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOUnhwVXc2MFhGNXQwdkVJSjZsMkhiVnNTZGo3NkUtb0hMamlLR09GQ2xMaXJpWW80dDAyUnBHVXVsYjY2bWtvX2o0aDhaSUR2MmwyVElSYjZEX3Bha3I5a0JJTDJvdFdaR0pYV0EySTdHR19VX0ZzUmk1dFpnRW96U1dYbXB6d3ZzUUJlYl8wR2dTcUNQ0gGaAUFVX3lxTE5relJPS1J3ZWdQYVBWbHRRSDhneVktdktRZXhqeDlYM1pfdW9zTnl6RWxVZ1NPNkxodDhLdF9TT0dNS3RCbFlCS2ZPLTAtSVpveFgzZUYtYnJxSExNX1c2RFU5anhWRHRMU0E0dTM1eGZfMEtiaURrUVVSc3JzU2xCa2xXOExtSjZYTnpEX1FLQWUzRkx2MjJERnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "ETH Gas Fee Flashes Inactivity Concerns Before Ethereum ETF Approval - CoinGape",
        "content": "Ethereum investors are currently sitting on the edge of their seats eagerly awaiting the approval of spot Ethereum ETFs by the U.S. SEC. However, just before the final decision on ETF approval, the Ethereum gas fee dropped to a two-month low suggesting major inactivity on the Ethereum network.\n\nEthereum Gas Fee Drop Suggests Major Inactivity\n\nOn-chain data provider Cryptoquant has released a new chart highlighting the recent trend in the average Ethereum gas fee (gwei). As per the below chart, the gas fee has dropped to the lowest level since May 2024, indicating a sharp drop in the activity on the Ethereum blockchain network. Historically, the chart shows a strong correlation between the rising gas fees and the increasing ETH price.\n\nadvertisement\n\nThis decline in gas fees raises the question of whether it is calm before the storm, especially with the anticipated approval of the spot Ethereum ETF on the horizon.\n\nOn the other hand, the Ethereum staking activity has peaked at new all-time high levels ahead of ETF approval. Ethereum whales have been accumulating the coins in the last few weeks and moving them to staking.\n\nA day before, Tron founder Justin Sun accumulated a massive $5 million worth of ETH. Since February, Sun has been on an ETH accumulation spree and holds $1.1 billion of ETH, expecting a strong surge after the ETF approval.\n\nAlso Read: Ethereum Investors Are Ready To Sell ETH As It Hits $3.2K\n\nEthereum ETF Approval and ETH Price Action\n\nThe Ethereum price attempted to break past the $3,200 level on Thursday, however, the bull failed in this attempt pushing ETH back to $3,070. for ETH to reclaim the bull run, it has to surge past $3,200 giving a technical breakout above the diagonal formation as visible in the below chart.\n\n$ETH – I’m still positioned to expect upside and still think we go up but we haven’t reclaimed the diagonal and OBV hasn’t broken out yet. That OBV V shape looks really good and I’m betting on UP. But have to keep bias in check if we reject both of these. pic.twitter.com/xAy5wWiFCf — IncomeSharks (@IncomeSharks) July 11, 2024\n\nBitwise CLO Katherine Dowling recently said that the Ethereum ETF is currently close to the finish line. Prospective issuers are eagerly waiting for the SEC to provide updates on the pending launch. It will be interesting to see whether there are more filings pending ahead of the final approval.\n\nAlso Read: Bitwise Executive Says Ethereum ETF Is Close to the Finish Line\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNMF9nSGR5WVJfRFJSUW9Kd1p3Vm5peVVLYXdIWE9PNlBKNjM3R1p6ZzlZQ2JRZlE0ZXhQN29rWVp5bmRuNTVQZVpfaXBfOU9NOE95SktvNHFON05NRWN0ZnBuVUdwU0l0ZjE5RFVpU3FTZXlaVU1ycHJpQnBhcko0T3NaRldTTnNSMTVsTndoNFVYRkpOV2hodUlXUlRNSU1aUnF6NHVTZHctaHUtMFloZjVfaXdNc29QVXZyMWpB0gHDAUFVX3lxTE5adHlqcFduRU5LOGlHQXoxSEtIUGtzSGdfQzFsOHRoNWRteWFPN0lvc25ZekhQbXNweEI3VEFsazNIOFVrWGJqbkw0SEVySDlBd3hOb2x6NG40T0FuTkJwSDJJZWpoZkhtdUVucVlYeXRabDN1UTNNWExvRWtIam95RzBxdVc0b1JqakxMZ1R4SW4tZ0JlOFZveWJSaGFiam1FMEpkdE9JVFljcXJURGlER1JyYjd0X3pCTGQzdGhpekZqOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Key insights from Ethereum's performance in current bull cycle - FXStreet",
        "content": "Ethereum's price has followed a divergent pattern in the first 365 days after a Bitcoin halving event.\n\nOver 90% of ETH's supply has been in profit since January.\n\nEthereum investors are slowly displaying confidence again with ETH ETFs on horizon.\n\nEthereum is up 0.3% on Friday as key insights from Glassnode reveal ETH's next potential move as the current bull cycle matures.\n\nDaily digest market movers: How ETH has performed so far in current cycle\n\nDespite earlier predictions that the agency would likely approve issuers' spot ETH ETF S-1 registration statements, the Securities & Exchange Commission (SEC) has remained silent. While the SEC remains mum, key on-chain data provide insight into key historical price moves in Ethereum and how they may affect the current cycle:\n\nEthereum has followed a somewhat divergent market performance in the first year after a Bitcoin halving event, according to Glassnode. In 2016, ETH suffered a 45% drawdown before picking up the pace to rally about 3,400%. In the 2020 halving, ETH charged up by 150% before rising about 2,150%. Since the past halving in April, its price has remained relatively flat.\n\n\n\nETH Price Performance after Halving\n\n\n\nEthereum has often experienced steeper drawdowns than Bitcoin during the early and later stages of previous bull cycles. In previous cycles, ETH saw corrections of above 65%. However, the largest drawdown in the current cycle is quite low compared to others, coming in at -42%.\n\n\n\nThe total supply of ETH in profit crossed the 90% mark in January and remained relatively above it throughout H1. According to Glassnode, extended periods where 90% of a coin's supply is in profit often indicate the later stage of a bull cycle. This is characterized by profit-taking from investors, which in turn outweighs demand.\n\n\n\nETH Percent Supply in Profit\n\n\n\nETH's growth is evident in its 267% rise, adding $354 billion to its market capitalization since the FTX lows of November 2022.\n\nETH technical analysis: ETH investors are slowly gaining confidence again\n\nEthereum is trading around $3,135 on Friday, up by a mere 0.3% on the day. After posting a bearish exhaustion candle, ETH briefly declined to $3,060, sparking over $40 million in liquidations in the past 24 hours. Long and short liquidations accounted for 81% and 19% of total liquidations, respectively.\n\nThe move saw ETH's total liquidations flipping that of Bitcoin despite its relatively lower market cap. This could prime ETH to begin a fresh move toward the upside.\n\nETH options Open Interest (OI) declined to $5.16 billion on Monday, its lowest level in the past year. The move signified heightened uncertainty among traders as ETH's price retraced below $3,000.\n\nHowever, following a slowdown in the bearish pressure and a slight rebound in ETH's price, ETH options OI has begun climbing up again, nearing the $6 billion mark on Friday. The price recovery and rising OI indicate traders are slowly gaining confidence in ETH again.\n\nThis is also evident in ETH's Long/Short Ratio, which has risen to 1.04 in the past few hours.\n\nWith the potential launch of Ethereum ETFs on the horizon and BTC seeing heavy selling pressure from miners, the German Government, and Mt. Gox repayment, investors may reallocate capital into ETH. However, the SEC's delay to greenlight issuers ETH ETF S-1 drafts may hamper a good price increase.\n\nAs a result, ETH will likely follow a horizontal trend within the $2,852 to $3,300 range but slightly tilted toward the upside until the SEC moves on ETH ETFs.\n\nETH/USDT 8-hour chart\n\nAccording to Coinglass data, ETH may drop to around $3,041 in the short term, where there is a liquidity wall of $35.57 million, before rebounding."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxORXJrUmZweGJZODFQSG9zd3hNUjRJNWtaekViMlppR25sV25IcHVkWjNHS0hsRndUaV8zZEFONjBEMWNYS1NhRnY1aVczdGlvQmJDRFhHSGxJUGNUcDZoQk9mVU9OZ2ZaZGpqRnFneUxWemZkeWJJWDdGd2dQcTBWcnJvOGtUTHVZZjJQUdIBkgFBVV95cUxNYjVqZHBYSU1DLTJkbFNJdlFpb2lWQk5Obl9LdmFKSFpPVlppUGE1TGVGLUpNSFRXaGE5OU9HVzVTMTMzUmNiYUEzcXNLYXJTdUxZeHZLV01nRFBFNDhJNXRsVWIyd2VZVWUyVWs5bEk3bTZObFlHVnc4aHItcThIWTR2aWpTQWRqc1FqRlVjckFzdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Classic – Swing traders, watch out for these key levels! - AMBCrypto News",
        "content": "Ethereum Classic is likely to face rejection at its former support zone\n\nOBV and Open Interest showed buyer enthusiasm was low\n\nEthereum Classic [ETC] has retraced all of the gains it made during the rally from January to March. Back then, the altcoin’s price had risen from $18.33 to $39.67 at the apex. Alas, the market’s buyers have been underwhelming since then.\n\nThe fall below the $22.9-level meant that a new bearish move seemed more likely than a recovery. Here are the levels and scenarios that ETC swing traders need to watch out for.\n\nFormer support level is now the short-term bullish target\n\nIn April and again in June, the 78.6% retracement level at $22.9 was tested and defended as support. However, the Awesome Oscillator and the price action revealed that a strong downtrend was in play in June.\n\nSupport levels at the 50% and 61.8% retracement zones were lost quickly to sellers and in July, the bears marked another victory by forcing a descent below $22.9. The recent bounce from $18.3 doesn’t mean the bulls are winning though.\n\nInstead, Ethereum Classic swing traders would want to take short positions around the $23.2-$24.1 zone. More conservative bears can wait for a bearish engulfing candle to go short. With the OBV just barely above its three-month support level and the AO resolutely below neutral zero, the bearish argument is very convincing.\n\nOpen Interest at its lowest since October 2023\n\nThe weakness of the bulls was captured by the Open Interest chart. Alongside the price, the OI has slid persistently and stood at $89.7 million at press time.\n\nDespite the 10.6% price hike over the past week, the speculators did not seem too keen to bid.\n\nAdditionally, the spot CVD halted its downtrend over the past week and was slowly climbing higher at press time. The funding rate was positive, underlining the presence of bullish sentiment.\n\nRead Ethereum Classic’s [ETC] Price Prediction 2024-25\n\nThe short liquidations on 8 July after the rejection from $21 suggested a liquidity hunt. Traders should be on the lookout for a price surge that takes out short positions, as that might warn of a liquidity hunt in the opposite direction during the move towards the $23 resistance zone.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQUHlCVnVnWDE5ZEgwSmxJMEVjZFRxaWVhUzBFOFN5STl1eWc0Q0UwUGJrSHFXZWFPVWVPLVV4T29UcGl3eTdadGEzRVpmMHM2bW54MjJkemJrMUIyS0R5SFNlVVR0Tk42NFVLRFVXazRNWnFvYUllM3YtRV9YZGxrcDFlMTjSAYoBQVVfeXFMTnRmZ0JkWlNNMzVHcmpvNHFQQjJ2TmVVaWdLWXNoZ1FhT0Njc1B0UXZkaHZhSXVqZWl6UC1ZTkhIMXJWeThGTjBSNDVMQ0JvNW9jN05BVDlhNGJzNGRNc0NwQWRyLW0wTGYzUWp0Y1h3c1ZKdlB2bjNMejRkYkN2V2M3YjdMTFJyNWdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Key Reasons To Invest In Ethereum And Solana Now - CoinGape",
        "content": "Ethereum and Solana, prominent Layer-1 blockchains and decentralized application (dApp) hubs, currently face significant market dips. Ethereum leverages blockchain technology in its open-source platform, ensuring secure decentralized applications. Solana, also open-source, exploits the blockchain’s permissionless nature to innovate in decentralized finance (DeFi).\n\nSolana’s price recently dipped, disrupting a short-term upward trend. Typically, such corrections persisted for over a month before recovery. Meanwhile, Ethereum price exhibits a bearish pattern, albeit with modest rebounds.\n\nadvertisement\n\nThese platforms are known for their distinctive strengths; Ethereum prioritizes robust security, whereas Solana offers high throughput and minimal transaction costs. Despite the current volatility, this combination of features makes them pivotal players in the cryptocurrency domain.\n\nAnticipated Growth with New ETFs\n\nEther and SOL are poised for significant growth with the anticipated arrival of new investment products. Ethereum is at the forefront of excitement with its upcoming spot ETFs.\n\nThe financial community buzzes as the possibility of introducing Ethereum ETFs as early as this week remains pending approval from the U.S.\n\nSecurities and Exchange Commission. Investment experts, like Bitwise Asset Management’s Matthew Hougan, are preparing to capitalize on this development. Ethereum’s price is expected to surge, potentially exceeding its previous peak of $4,867.60 in November 2021.\n\nOn the other hand, Solana is not far behind, with a major ETF launch planned for March 2025. As the market begins to stabilize from recent fluctuations, Solana has shown impressive recovery.\n\nThe Cboe Exchange recently confirmed that asset managers VanEck and 21Shares would list their Solana-based products, pending regulatory green lights. The exchange has formally requested approval from the SEC to list these innovative ETFs.\n\nEthereum and Solana Drive Innovation in Blockchain Technology\n\nEthereum and Solana are pivotal in the blockchain landscape, fostering dynamic ecosystems for decentralized applications. Ethereum, a pioneer in smart contracts, maintains a vast array of dApps encompassing DeFi and NFTs, making it a leader in the field.\n\nOn the other hand, Solana excels in scenarios demanding high transaction speeds and minimal delays, such as gaming and high-frequency trading, thanks to its superior throughput capabilities.\n\nThese platforms rank among the top ten in market capitalization, enjoy robust developer support, and enjoy surging trading volumes. Their ongoing rivalry promises further advancements, making them attractive investment prospects in the blockchain domain.\n\nETH and SOL: Surge In DeFi TVL Dynamics\n\nEthereum holds a significant advantage as the leading platform in TVL, representing the total capital held within its smart contracts. High TVL indicates strong user activity and commitment to the platform, suggesting many users are locking up their assets in Ethereum-based DeFi projects. According to data from Defillama, ETH’s total value locked is currently at $54.273 billion.\n\nSolana has a smaller TVL than Ethereum. It’s known for its high-speed and low-cost transactions, which appeal to a different segment of DeFi users and developers. Solana’s focus on scalability and efficiency has helped it quickly become a competitive DeFi ecosystem, attracting innovations and developers, which could boost its TVL over time. Currently, the total value locked is $4.47 billion.\n\nScalability and Efficiency\n\nHistorically, Ethereum has faced challenges with scalability and high gas fees, especially during peak usage. However, ongoing upgrades, notably the shift to Ethereum 2.0, aim to address these issues by moving from proof-of-work (PoW) to proof-of-stake (PoS), which is expected to improve transaction speeds and reduce costs significantly.\n\nSolana is designed for high throughput and can process thousands of transactions per second (TPS), making it one of the fastest blockchains. This technical advantage makes it an attractive platform for high-frequency trading environments and applications requiring quick transaction settlements.\n\nFrequently Asked Questions (FAQs) 1. Is Solana Faster Than Ethereum? Yes, Solana is faster than Ethereum. Solana can handle over 65,000 transactions per second, while Ethereum manages about 15 to 45. This speed comes from Solana’s special design for handling many transactions. 2. Is Solana Cheaper Than Ethereum? Yes, using Solana costs less than Ethereum. Solana’s transaction fees are very low, only a fraction of a penny. Ethereum’s fees vary and can be high when the network is busy. 3. Is Solana More Secure Than Ethereum? Ethereum is considered more secure than Solana. Its network is more tested and has more validators, which makes it more decentralized. Solana has had more issues with network outages.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNdlFsX2toelVfV0dVU3o3eXhRMGJXeXBYNG5yaFRjM19WWVB5anVTaWRzLWI0U3lubzhsSHVjcXNrYVlSMUFMTEVMWUFjMzFGb0xIRm5wR3prM0lOT2c3LTB5S1pzZW9Pa29FUlNoa3Z4MXhOTWlIRWtZMjJIa2t0RnBSamLSAYoBQVVfeXFMUF9qa2VyeFNtd295Y0kzNTNtT3B2ZWYzRjJvQzU0OUpEWUd2NFhyWE0yZklnSUc5el81Z0FqUkVXblpBMVJVWkYzeF92SktldFl3RFduaWF3N2wtZFNrandxSzg0d25JUUhwTlpBa2tfaFNjYU9oX1g2RWE4R2dqYnpQRjNYOFhuX1NR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Ethereum gas fees hit new low as Pectra dawns – What next? - AMBCrypto News",
        "content": "Ethereum fees declined significantly and hit its lowest point in over a month\n\nDevelopers continued to work on the Pectra update, with the testnet expected to launch next week\n\nEthereum [ETH] has seen a significant surge in price over the past week, with the altcoin even managing to push past the $3,000-level. This has inspired some hope among investors. Despite the positive price movement though, overall interest in the Ethereum ecosystem declined.\n\nGassed out\n\nCryptoquant analyst Woominkyu’s analysis of Ethereum gas fees revealed a downward trend since May 2024, reaching its lowest point in recent months. This suggests a relatively quieter period of network activity on the Ethereum blockchain.\n\nThe analyst’s chart visualized the average gas fee (Gwei) in blue, while the black line tracked Ethereum’s price. Historically, periods of increased gas fees have often coincided with upward price movements for Ethereum.\n\nNew developments underway\n\nEven though interest in Ethereum’s ecosystem seems to be slowing down, new developments on the Ethereum network may help attract users to the network.\n\nEthereum developers on 11 July discussed advancements for development on the Ethereum network. Progress on the Pectra and PeerDAS testnets were the primary focus. Developers expressed confidence in launching Pectra the following week, while addressing remaining issues on PeerDAS. For context, PeerDAS stands for Peer Data Availability Sampling. It’s essentially a method being explored to improve the scalability of the Ethereum network.\n\nAdditionally, preparations for the Pectra testnet launch are now underway. Various client combinations are being tested to ensure a smooth transition. Efforts to integrate the EthereumJS client into the Pectra testnet are progressing too.\n\nAlongside testnet development, research is also being done into potential vulnerabilities in Ethereum’s client software. A tool designed to identify these issues is being developed and refined with the goal of enhancing network security.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nOverall, the Pectra upgrade is primarily focused on adjusting the blob gas limit. Blobs are essentially data chunks that are processed off-chain to improve Ethereum’s scalability.\n\nBy modifying the blob gas limit, the Pectra upgrade aims to optimize the efficiency of data processing and potentially enhance the overall performance of the network.\n\nHow is ETH doing?\n\nAt press time, ETH was trading at $3,139.96 following a 2.23% hike in the last 24 hours.\n\nHere, it’s worth pointing out that the volume with which ETH was trading declined by 26.55% over the same period too."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQVHA0dGpzNVRUTnZTcEkwcnVrRFc5alZCYklnMGJyV2JJd2hYQ2xvMzZHX2ZlcEo5cHNzQ3lYODFqSmplUmE4MjMtb1NFNmM5Rnl0YXFoWHZNY2dZY2NTVnBFSldteGd4MW1Scm9GSnRROUZVUUJjTmlCU19vbjVVSHVaR2VvdmYyM3FKdTlPU3F6bWFHLUtOaGJnc21hbGtCMWVOdzZqdjNHeFhVQ053V0pYMkxSOW02cHlZUHhoSXZ3cjZBWmxHTHlieVo5akXSAdQBQVVfeXFMTWZPYmlGcTFDclQxeHI3S1dfTTRKeDZON3NxZE52Y2gyQjBJLUM4X1NhOUlCMHBrU1ZrM1VEeUVOWkxFNXJlcTF3OGZzVXFyZjRjWEt1eTgtMjlxOUtOTEZMMHFGblNvQzV0dExRczVFQ0kySWhmXy1jRFZNWm1WdXBxcmpyRnVvbHRyS0pmcGgxMzBwVVRaZkZvUFlvN0FkVnNCWVQ4V3dabXpyLWZhbnhRb3JEYU1SbzFaWmFsbXZ1Q1JxNW15T2VteUVaYmpiZGJCbUI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF launch, a game changer for Ether and altcoins? - FXStreet",
        "content": "Ethereum analyst from venture capital firm says Spot Ethereum approval could come as early as this week, placing odds at 72.7%.\n\nA crypto analyst predicts 200% gains in Ether price, post the anticipated approval of the Spot ETF by the Securities & Exchange Commission.\n\nEther sustains above $3,000 even as supply on exchanges surges to 2024 peak.\n\nEthereum (ETH) traders are watching two key events closely: the anticipated approval of the Spot Ether ETF and the activities of whales, the large wallet investors holding ETH.\n\nAn analyst has predicted that the odds of Spot Ether ETF is 72.7% this week.\n\nEthereum ETF launch, and on-chain activity\n\nAnalyst behind the X handle @DarkCryptoLord says that the odds of the SEC approving a Spot ETH ETF is 72.7% this week. ETH traders anticipate the ETF approval to act as a bullish catalyst for the altcoin’s price.\n\nEric Balchunas, Senior ETF analyst at Bloomberg shared his thoughts on the Ether ETF and said it remains unclear why the US financial regulator is taking so long.\n\nYeah, rn it’s all quiet on the Western Front re eth ETFs. Nada from SEC this week. Unclear why they taking such sweet ass time. Every issuer is ready. Docs are ready. It’s like a rain delay in baseball. Gotta just wait. Maybe things will move fast next week. We’ll see… https://t.co/o1ZSdIf1nE — Eric Balchunas (@EricBalchunas) July 12, 2024\n\nSantiment data shows that Ethereum supply on exchanges has climbed to its highest level in 2024. It is likely that Ether holders anticipate a rally in ETH price and are waiting to take profits.\n\n19.23 million Ether is being held in wallets across crypto exchanges per Santiment chart.\n\nSupply on exchanges vs. ETH price\n\nAnalyst predicts 200% gains in Ethereum\n\nAnalyst behind the X handle @follis_ notes the similarities between Ether chart and Bitcoin’s prior to the largest asset by market capitalization rallying 200%. If the Ether ETF garners as much attention and interest from institutional investors, as Bitcoin did, it is likely that the altcoin extends gains by 200%.\n\nEveryone focussed on Germany and Mt Gox\n\n\n\nMeanwhile the Ethereum ETF is about to launch and the $ETH chart looks identical to $BTC before it pumped +200% last year\n\n\n\nStudy ETF rallies pic.twitter.com/VWENNnO8dN — フ ォ リ ス (@follis_) July 9, 2024\n\nAltcoins related to Ethereum, staking tokens, staking tokens, Layer 2 scaling assets could extend gains alongside Ether. Bitcoin’s post-ETF gains reflected in assets like BRC-20 and related assets, if history repeats this could occur for Ethereum.\n\nAt the time of writing, Ether trades at $3,152 on Binance."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQMFFJVkxJSUdTNkM4ZUlxczNXQzFfODFGRGVyUVI1X1lsSEhKSlR2WFpza0hBQnBfWFlIZkJNZVpvakJlY1N1Y2ExSjYxS3VUM0xOOEpQdTgwc205cnYxOWNFYlRudEJQYnZIaFJ2WGxpQmRYZDY1dUtFaUY3ZmF0ZzF4TFhIVVhqMERfNGZMc2VZQVFKSkJJLWdWaFNQVEIzeEtoT251eVRka3ZMRll4c09CSUJPMlJIejhR0gHAAUFVX3lxTE50OEpHQm01c1NRaFY1azNXLU54d0NTSmhVZ0wwTEdRb0tueklna04xR1lJWUtzU2sxSTBjV04xNDk4b29VOW12TWJYOG9rSGw3Nm5oR0dZLVZmZWU4NG14UUR2b2s1d2xYUE42UElGa0IyZ0V3eUdOYkRmQ3lwa2VZWkRwNVQ1WDNlR3pfbWw5ZnJwOTgxNXU2ai03cW1QRzVCSlB3QXFSc2tZWmpEUWdKcldoQWJUWkNDdWd6X3YwdA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "ETH/SOL Price Prediction: Ethereum Shows Bullish Signs as Solana Struggles - CoinGape",
        "content": "Ethereum price decreased by 2.7% in the last 24 hours to trade around $3,067 during American hours hours on Friday. On the other hand, the Solana price dropped by 5.4% in the last 24 hours to trade at $135.39. ETH price gained 4.52% against Solana on Thursday, going into the wee hours of Friday morning before retracing back a little bit.\n\nEthereum Price Eyes 7% More Gains Amid Fearful Markets\n\nThe Ethereum price action is trending below the 21-day, 50-day, and 200-day simple moving averages (SMA), while the relative strength index (RSI) is at 39 and rising. This indicates that bullish momentum is building on the Ethereum asset. The RSI also aligns with the chaikin money flow (CMF), which is at -0.05 and headed upwards. These two oscillating indicators signal that ETH price may be inbound for more upside.\n\nadvertisement\n\nEthereum price prediction shows the asset has bullish tendencies as the price action trailed back into the falling channel. A resistance barrier exists around the $3,300 level that, if broken, may catapult the price of ETH to $3,950.\n\nEthereum price has formed a double bottom against Solana, with 5.16% gains remaining until the market structure is completed.\n\nSOL Competes with Ethereum Price Amidst ETF Rumors\n\nOn the other hand, Solana price is trending inside an ascending triangle in the 4-hour time frame and is currently at the bottom trendline. The asset is also trending below the 21-day, 50-day, and 200-day SMAs, which is not bullish. The 200-day SMA currently offers a resistance of around $143, which coincides with the horizontal resistance line of the ascending triangle.\n\nIf the price of SOL breaks above the ascending triangle, it may surge 18% to $172. On the flip side, if bears prevail, the asset may find lower support around $121. The SOL RSI is trending at 41.61 and headed down, which shows increasing bearish momentum.\n\nNevertheless, the asset is at a crucial point against ETH price, where a bounce back could result in 15.74% gains.\n\nNate Geraci, president of ETF Store, shared Roxanna Islam’s prediction that more Solana ETF applications may be filed if the ETH ETF is confirmed. Cboe’s 19b-4 filings for VanEck & 21Shares already hint at the industry’s readiness.\n\n“I believe more issuers will submit spot Solana ETF filings after the spot ether ETFs are finalized.” –@roxannaswan Agree. My $$$ is on Bitwise first. pic.twitter.com/FoR84Fy9If — Nate Geraci (@NateGeraci) July 12, 2024\n\nBottom Line\n\nEthereum price action suggests a potential increase, targeting $3,950 if it can break through the $3,300 resistance level. Meanwhile Solana price prediction shows positive momentum in the short term against Ethereum, bucking the trend in a market where many crypto investors remain cautious. It trades within an ascending triangle pattern but shows increasing bearish momentum with its downward RSI. The price of Solana could either surge to $172 if it breaks above the pattern or find support around $121 if bearish trends continue.\n\nFrequently Asked Questions (FAQs) 1. What is the current price action for Ethereum? Ethereum's price has decreased slightly but shows potential for bullish momentum. If it can break through the $3,300 resistance, it could reach a target of $3,950. 2. What are the critical support and resistance levels for Solana? Solana is currently navigating critical support and resistance levels within an ascending triangle pattern. It could potentially surge to $172 if it breaks above the pattern or drop to $121 if bearish trends continue. 3. What are the potential impacts of ETF rumors on Solana and Ethereum? ETF rumors have a significant influence on the market. More Solana ETF applications may be filed if an ETH ETF is confirmed, potentially impacting both cryptocurrencies' market dynamics and price movements.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPN3l4dS1VOUZKaTZqRDFqdmlYS3QwSmdRVXBsR0R5Wjl5bklGblpWV05md0x5cE5NT0lENFhra2UwSTJsdkhMQWFLa28zTFBMQ1h3Q3ltZzFfekJIeGhPeHZjTDFpYWtmTnJUR1ZGTm0wSzdqOTBCam80N3hzXzhPN2NVazdBTi0tQzJfa1lJUdIBlAFBVV95cUxQZjNRQmpBUlA5RFhselhkNWhMNXdOVlM2TFprM0c1SjFlZXdKNlZ0MDZJa1BDblJVWk5qRllTUXZjcm9rZmZ5eVRfQ3U2M21jYUJXd2dScEx4TDdrZzRHTUdxSF92ZUdGM2VlckpuZmE5QkJ0aUJSYWU5Yzh1Z3hkQzhPR1lScFQwOWVXOHNZZlNLUzkx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF Approval: How Long Will the SEC Stay Silent? - CoinGape",
        "content": "The U.S. Securities and Exchange Commission (SEC) is keeping issuers of spot Ethereum ETFs in suspense with extended delays. Additionally, Ethereum bulls are eagerly anticipating a significant price rally once the approval process concludes.\n\nNate Geraci Predicts Timeline for Ethereum ETF Approval\n\nETF Store President Nate Geraci recently shared his observations of the SEC’s approach towards the spot Ethereum ETFs review process. Geraci stated that the US SEC seems to be treating the spot Ethereum ETF S-1 filings in a manner similar to the 19b-4 forms, thereby maintaining a high level of secrecy in the matter.\n\nadvertisement\n\nDespite the silence, Geraci believes that the approval shall happen by the next week. “I still think approval is likely next week. There is absolutely no reason for delay,” he said.\n\nIt appears the SEC is playing the spot eth ETF S-1s similar to the 19b-4s… *Extremely* tight-lipped. Still think approval next week. Absolutely no reason for delay. — Nate Geraci (@NateGeraci) July 12, 2024\n\nThe SEC is repeating the same mistake this time as it did with the spot Bitcoin ETFs, said Geraci while quoting SEC Commissioner Hester Pierce. Back then Pierce said: “Had these products come to market in the way other comparable products typically have, we would have avoided the circus atmosphere in which we now find ourselves.”\n\nBloomberg’s ETF strategist Eric Balchunas also commented on the SEC’s lack of action regarding the Ethereum ETFs. He said that there’s been no communication throughout this week after the issuers submitted S-1 forms on Monday. This leaves the issuers puzzled over the delay.\n\n“Every issuer is ready. Docs are ready. It’s like a rain delay in baseball. Gotta just wait,” Balchunas remarked. He expressed hope that the situation might progress quickly next week, but uncertainty remains. As per the market sentiment, the issuers are expecting one more filing submission before the final approval by the SEC.\n\nAlso Read: ETH Gas Fee Flashes Inactivity Concerns Before Ethereum ETF Approval\n\nTop Players Accumulate ETH Before the ETF Approval\n\nOver the last few weeks, some of the top market market players and Ethereum whales have been accumulating ETH in preparation for the ETF approval.\n\nThomas Perfumo, the head of Strategy at Kraken showed that the US Ethereum ETFs can see inflows to the tune of $1 billion every month following the approval. Additionally, big market players like Tron founder Justin Sun have accumulated $1.1 billion worth of Ethereum gearing up for a big rally ahead.\n\nAs of press time, the Ethereum price is trading 1.25% up trading at $3,123 with a market cap of $375 billion. Ethereum bulls should take the price past $3,200 in order to trigger the bull run up to $4,000 and beyond.\n\nAlso Read: Bitwise Executive Says Ethereum ETF Is Close to the Finish Line\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPS25hV01DaUhSUkZGamY0QVBrY0lSRHpSLTZDbnU4Wk5CUFNlSXUtWGZwUmhzS0stekE5Zkx3U3NBYmdQQVdseGs4bmpYUkxndElwSUVQWDRWT2lKMHFzMHlCUkt5YzdtMFRTRWZMdy1rWWl3WElCQkxSblU1UFljcjg4cjhlcS1maU5mS01vMXl2UDVI0gGaAUFVX3lxTE55dnE1MWlGMlU4bk1lMVNHQ25ZVUJtMThYbVc4aDllLVNIdXY0X0FwVmpzWkw1NWRDU1VGaEx1MGdSNkFuVzU0aGZsZ3ppWERoaXBmd212V0tfUjV3b0RJbDh2TG5pWEh0c1pNblRkVXRhOC1xVWhNR3IxWWVCMXYyY2thRDhvNUJCc0l4OUxHTUQ2ckV0dHhFYXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Ethereum News: Whale Scoops $33M ETH As Spot ETF Approval Speculation Looms - CoinGape",
        "content": "A significant Ethereum whale has made a substantial purchase, investing millions into the second-largest cryptocurrency by market capitalization. This notable transaction occurred at a crucial time, as the crypto community anxiously awaits potential approval of spot Ethereum ETFs by the U.S. Securities and Exchange Commission.\n\nThe timing of this large-scale acquisition, combined with the ongoing regulatory uncertainty, has ignited intense interest among investors and analysts. Many view this as a possible indicator of shifting market dynamics for Ethereum.\n\nadvertisement\n\nDetails Of The Whale Purchase & Market Context\n\nA significant Ethereum transaction has caught the attention of the crypto community, highlighting growing interest in the cryptocurrency as speculation about ETF approval intensifies. An Ethereum wallet, identified by the address 0x517…7aF15, has made a substantial purchase of 10,545 ETH coins.\n\nThis acquisition occurred over a brief three-hour period, indicating a rapid and decisive move by the buyer. The total value of this purchase amounts to approximately $33.29 million, with each ETH coin acquired at an average price of $3,156. Interestingly, the buyer executed this large purchase through five separate transfers. Each transfer involved an identical amount of ETH, suggesting a strategic and possibly automated buying approach.\n\nOver recent weeks, there has been a noticeable trend of accumulation among top market players and Ethereum whales. Thomas Perfumo, the head of Strategy at Kraken, has provided valuable insight into the potential impact of spot Ethereum ETF approval. According to Perfumo, U.S. Ethereum ETFs could see substantial inflows, potentially reaching $1 billion every month following approval.\n\nAdding to the intrigue, other high-profile figures in the crypto space have been making significant moves. For instance, Justin Sun, the founder of Tron, has reportedly accumulated Ethereum worth $1.1 billion.\n\nAlso Read: Hong Kong & Australia Bitcoin ETF Inflows Hit Record High\n\nCurrent Ethereum Market Status & Regulatory Outlook\n\nAs of the latest data, Ethereum price is trading at $3,153.88, with a 24-hour trading volume of $8.9 billion. This represents a 1.30% price increase over the last 24 hours and a 4.60% increase over the past week. The current circulating supply stands at 120 million ETH.\n\nThe cryptocurrency community is closely monitoring the U.S. Securities and Exchange Commission for potential approval of spot Ethereum ETFs. The SEC has been delaying its decision, creating uncertainty for ETF issuers and investors. Market analysts remain optimistic about an imminent approval, with some predicting it could happen as soon as next week.\n\nHowever, there are concerns that the SEC might be repeating its approach from the Bitcoin ETF approval process, potentially causing unnecessary delays. Bloomberg’s ETF strategist Eric Balchunas noted a lack of communication from the SEC this week, despite ETF issuers submitting their S-1 forms on Monday.\n\nInterestingly, just before the final decision on ETF approval, Ethereum gas fees dropped to a two-month low, suggesting major inactivity on the Ethereum network. This development adds another layer of complexity to the current market situation and regulatory expectations.\n\nAlso Read: Solana Co-founder Highlights US Govt’s Crypto ‘Mess’\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNemJoNVY3bkYzcGtPMVVRSDdIRVd1MUM1Y0VMTGNpVXE3Q3hmRXlmU1d1bVZvbEI2Zy1Tbk00OWhxRHdlcmhLbnoxN2tJZ1JsODhLVXpFdlplWEt2VWxNNVd1NldfR1Z3ZWxLZFMzM29FQllScVQzYVFzT2RnaFE3VzdKSDFkQ3NQZUN6cWh2cEZ2aDJZTEstSkJUUTRON2pqbUkxTlFB0gGrAUFVX3lxTE5ya1FtVTJOelpFQkNkaWpzdnlxNmJQQm4wR25rajhWNzRBSGswTUtiYUd3aEh6Y19HZF9XcDJBc2xiZEtFdXVyNjdLSkJqRXljNUJHZDE1b1dNbkJoLUxQeVlpUTVxWXR0TTIwbDQtUG9KQW1FZDZlY3VkX1BBb1JuRy1aUW95VFJBcU9uTDR4VU5NVVZ0SzBZZG5LVUZTcWpxeXczM2ZGQzY1MA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Bulls Gear Up For Recovery – Can Spot ETFs Push Price To New Highs? - NewsBTC",
        "content": "Ethereum (ETH) is gearing up for a price uptick as we begin a new week. Ethereum is currently trading at $3,195 and is up by 1.83% in the past 24 hours. Although Ethereum’s gains are part of a wider market rally after a rebound, the altcoin is in the best position to surge the most in the coming weeks.\n\nRelated Reading\n\nFundamentals point to an extended price surge in the face of a looming launch of Spot ETFs. Additionally, technical indications are pointing to a bullish outlook for Ethereum as it approaches a crucial resistance level around $3,250.\n\nEthereum Basking In Bullish Sentiment\n\nEthereum is now looking to break above $3,200 after trading for the majority of the week below $3,100. Although Ethereum broke above $3,000 again last week, the king of altcoins largely consolidated between $3,000 and $3,100 in what looked like a slowdown of bullish sentiment.\n\nHowever, on-chain analytics and fundamentals point to Ether still basking in bullish sentiment among investors. Majority of investors are waiting for a signal before jumping on the asset.\n\nFor starters, there’s a growing sense that Ethereum Spot ETFs could be on the horizon. VanEck and other potential issuers amended their filings earlier in the week in hopes of receiving the SEC’s final permission. It could be a game changer for the crypto market in 2024 if Spot Ethereum ETFs start trading.\n\nAccording to Thomas Perfumo, Head of Strategy at Kraken, the Spot ETFs could open up an additional $1 billion inflow into Ethereum monthly. This new inflow of demand and money could see Ethereum push past its current all-time high of $4,900 into new price territories above $5,000.\n\nAccording to multiple reports, things are taking a better turn for the approval of these Spot ETFs, and the potential for approval by the SEC has jumped massively. As noted by Eric Balchunas, senior ETF analyst at Bloomberg, everything is already in place for the approval of the ETFs, and it is unclear why the SEC is taking so long. This has led to an increase in a bullish case for Ethereum for the rest of the month.\n\nYeah, rn it’s all quiet on the Western Front re eth ETFs. Nada from SEC this week. Unclear why they taking such sweet ass time. Every issuer is ready. Docs are ready. It’s like a rain delay in baseball. Gotta just wait. Maybe things will move fast next week. We’ll see… https://t.co/o1ZSdIf1nE — Eric Balchunas (@EricBalchunas) July 12, 2024\n\nRelated Reading\n\nBitcoin Whales Accumulate 71,000 BTC Amidst Price Dip – Details 2 months ago\n\nIndicators Looking Bullish\n\nOn the technical side of things, technical indicators also support a bullish outlook. According to the daily candlestick chart, Ethereum is on its way to closing its third consecutive bullish daily candle for the first time since June 16. The crypto is also attempting a break above the 100 SMA. A break above the 100 SMA in correlation with a bullish daily close could solidify the bullish momentum as we head into a new week.\n\nFeatured image from Reddit, chart from TradingView"
    }
]