[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQUlhTckdrak5fdnNqMnJNTWhpSGRNaXdiN19NbWtucUJEWG1CSzRVLXdUUUk0bjNBMi00TUdJNk90WERsZmRrNkZfRTNrTjhidkN0WkgzZ05WTGR3NmlWZHJpa2tsNjhLcmlHSGh5VENLZzgxMjdpbVE4SmxBWWpxMGFZbWdXS0FOX2pCaEE1NHpYZ0JnaF9ndFJJdVk4NWd4Mlp5TGtUV0ZPNWswS0l4UmV3SjZnbHNFRFl3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "SEC approves stake-free Ethereum ETF proposals - Euromoney magazine",
        "content": "Photo: Pixabay\n\nThe US Securities and Exchanges Commission (SEC) recently approved “on an accelerated basis” rule-change proposals from three exchanges looking to list spot Ethereum exchange-traded products. Most observers had expected the SEC to reject the applications on the basis that they were filed as commodity ETFs and the SEC deems Ether (or ETH, the native cryptocurrency of the Ethereum platform) to be a security.\n\n“The approval order leverages research from Bitwise and the SEC examining the correlation between spot Ether prices and the price of regulated Ethereum futures contracts,” says Matt Hougan, chief investment officer at crypto index fund manager Bitwise. “The fact that there is a large, robust and regulated futures market in Ethereum had a big impact on the decision.”\n\nBryan Amour, Morningstar\n\nAnother factor was removal of staking from the filings. Ethereum relies on staking to ensure the security of the network, rewarding users who participate in block production and validation through a portion of newly created ETH.\n\nHigher staked amounts help secure the network further by making it more immune to 51% attacks. A 51% attack is an attack on a cryptocurrency blockchain by an entity or group that controls more than 50% of the network and thus can prevent new transactions from gaining confirmations and to reverse non-confirmed transactions.\n\nEthereum"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBnMnU2aDUxY2tvOXItd2NrdzBkQVBnZk5ZRG1Cd1JjMVdxRTNFeUdRaF9qNkpvQnA1US1SbUI2T0NKOGxVNkJtZjdsOGo4X2dSMnJXSDJnb3hYUTVTbi1VbmR1VG9taVBPdUVNLXpkTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Celestia's Blobstream goes live on Ethereum mainnet - Crypto Briefing",
        "content": "Currently available on testnet, Blobstream is expected to be deployed on L2s following audits and Celestia's upcoming launch.\n\nShare this article\n\nModular blockchain network Celestia has launched its data availability solution, Blobstream, on the Ethereum mainnet, according to the team’s announcement on Monday.\n\nBlobstream 🎇 is now live on Ethereum mainnet. Deploy a high-throughput L2 as *permissionlessly* as a smart contract. pic.twitter.com/74wyw5Xknq — Celestia (@CelestiaOrg) June 10, 2024\n\nDeveloped by Succinct Labs, Blobstream enables Celestia’s data roots to be streamed to an Ethereum light client on-chain. The solution offers high-throughput data availability (DA) for Ethereum layer 2 solutions (L2s), secured by cryptoeconomic guarantees.\n\n“This provides permissionless, high-throughput DA to Ethereum L2s, secured by cryptoeconomic guarantees rather than reputation or hidden trust assumptions,” stated Celestia.\n\nPreviously, Ethereum developers faced throughput limitations, prompting them to move to alternative layer 1 networks or rely on centralized services for DA.\n\nBlobstream allows developers to continue their work within the Ethereum ecosystem. Builders can create customizable, high-throughput blockspace without the need for permissions or committees while ensuring security through cryptographic economic guarantees.\n\nApart from the launch, the Celestia team announced that Blobstream on the Ethereum mainnet is now accessible on Celestia’s blockchain explorer Celenium.\n\nAccording to Celestia’s blog announcement, Succinct Labs has introduced Blobstream X, a zero-knowledge (ZK) implementation that streamlines the verification of Celestia validator signatures on-chain with a single ZK proof. This reduces validator overhead, simplifies the Celestia protocol, and accelerates the streaming of data root commitments for Ethereum L2s.\n\nAs noted, both Blobstream and its ZK implementation are currently available on testnet. Following code audits and Celestia’s upcoming launch, the community will be able to deploy Blobstream on Ethereum Mainnet and L2s to enhance streaming DA.\n\nPrior to this deployment, Celestia had already brought Blobstream to Arbitrum Orbit, Starknet, and Base, marking a continuous commitment to improving the Ethereum ecosystem’s infrastructure."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNdWpGYjg2NGlfWmV6aGRKZTlFelpaU3hYa0hwaWFmV2d0UFNWZ2RYUzFGdzkzekRCQXU2b1MxQ215NUprd0VRc0FXUzFJdjdQQTJCN1FXMllhalA2TFRvUlRwOEYzVld5SE5XVVYyQlpSaC11cXl6TmdOZFNZNTZ3QXp5Z9IBiAFBVV95cUxPaWVHQncyazQtV2pLTUExQlBwSjVjeWF0N1FGa1ZvSlVTSnBSdXN6X3JQbW5odDBKZVBLT3BCYVo5RmF2SGhxa3d1djJFUlN2VExCSjcycml0eVhVV3VNRkxiQ3RSenc4ejd0TVVEYmJlR1lOR2RLZ3lfSEVRYnd1M1FTeEQwWTk1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Generated More Revenue Than Robinhood and Etsy in Q1 - U.Today",
        "content": "Ryan Rasmussen, a senior researcher at Bitwise Asset Management, has noted that Ethereum, the second-largest blockchain network, managed to generate more revenue than major public companies of the likes of Etsy, Yelp, and Reddit in the first quarter of 2021 .\n\nAdvertisement\n\nEthereum generated more revenue than Robinhood, Etsy, Yelp and Reddit in Q1 2024.\n\n\n\nProbably nothing. https://t.co/OYYWrYvdZx — Ryan Rasmussen (@RasterlyRock) June 10, 2024\n\nAccording to data provided by Coin98 Analytics, Ethereum achieved record transaction fee revenue of roughly $1.2 billion. This marked a 79% increase compared to the previous quarter.\n\nEthereum's transaction fees recorded a significant uptick in March due to the major market rally that took place during that month. Bitcoin hit its current all-time high of $73,737 while the flagship altcoin also approached its all-time peak of $4,878 which was logged more than two years ago.\n\nAdvertisement\n\nEther is likely to end the second quarter on a high note as well due to the approval of spot exchange-traded funds in the U.S.\n\n$22K by the end of the decade?\n\nAmerican investment management firm VanEck recently predicted that the price of the leading altcoin could potentially reach a whopping $22,000 by the end of this decade.\n\nFor Ether to achieve this pie-in-the-sky target, the network has to become cheaper and more efficient.\n\nLast year, VanEck predicted that Ethereum's revenue could potentially grow to $51 billion on an annual rate in 2030, which is its base case. Its bull case is $136 billion.\n\nThe company counts transaction fees, including the tip fee, as a revenue line.\n\nVanEck has also predicted that Ethereum could end up becoming a store-of-value asset, evolving beyond merely a transactional currency. This could potentially add “Security as a Service” (SaaS) as a new revenue item."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNUTZCMTA3eGNCWGZCT0MxbldsLXZFVHFWeTlDcGNKcGxrRnhBajZNZTFfMXMyU05BZW83SUl6cTlFY0UybmRhbWt5Tl80TDdSX3VXZ1JHZ2l2RHBYaGpPS19YV2ZyUGVZLWNkN1ZSQUtqMmJfRngyX1lFaTlkVHIyQjB3NlNoVWhqbnZYMEIxdHZ3YTViYk1UaXF1MkpVYWw5bDh1Y2VMZ0hwMmZIWTFQQmc1bTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Whales Activity Surges: Will ETH Break $4,000 or Drop Below $3,650? Analyst Insight - TronWeekly",
        "content": "Renowned crypto analyst Ali Martinez has brought attention to a notable trend in the Ethereum market. Over the past three weeks, the number of Ethereum addresses holding 10,000 or more ETH has surged by 3%. This increase indicates a significant spike in buying pressure among large-scale investors, often referred to as “whales.”\n\nThis uptick in large holders could signal a positive outlook for Ethereum, as increased accumulation by whales often precedes significant price movements. Investors and analysts alike are closely monitoring these developments, anticipating potential impacts on the broader crypto market.\n\nAs of the latest data, Ethereum’s price stands at $3,698.25, with a 24-hour trading volume of $12.20 billion and a market capitalization of $444.30 billion. Despite this bullish activity among major holders, the ETH price has slightly dropped 0.28% in the past 24 hours.\n\nWill Ethereum Break $4,000 or Drop Below $3,650?\n\nIn a recent analysis, prominent crypto analyst Crypto Patel outlined potential scenarios for Ethereum (ETH) price movements. Patel’s insights delve into both bullish and bearish outcomes, providing a detailed forecast based on current trading patterns.\n\nEthereum (ETH) is currently trading within a bull flag or parallel channel pattern against the USDT. This setup typically indicates a period of consolidation before a potential breakout. Traders and investors are keenly observing these patterns to determine their next moves.\n\nAccording to Patel, a bearish scenario could unfold if ETH breaks below the crucial support level of $3,650. Should this happen, Ethereum might experience a significant drop towards $3,152. This level is noteworthy as it represents the last Fair Value Gap (FVG), a region where prices previously moved quickly, leaving little traded volume behind.\n\nOn the other hand, if Ethereum manages to stay above the level of $3,152 support, then it turns into a bullish one. As Patel predicts, following this, ETH can rally up to $4,000 in the meantime. Go past that resistance, and a hugely bullish wave could knock Ether to $6,000-$7,000.\n\nCrypto Patel’s analysis reiterates the importance of vigilance on important support and resistance levels in this existing trading scenario. Traders must remain alert and change their strategies according to these potential breakout points.\n\nRelated Reading | DOGE Enters Key Wyckoff Phase: Major Spike Predicted Amid Market Volatility"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPNUtvTUhLazlfZ0V1UUtOczB3QXpyS3ZIVnZFRDFMWFJNbTMzQTROb2hYcHdkM1VMRFNveTJRaTU4T2ZmX241ekstbVY5YXd1MjJtV1hldk9tNWZIT2d2a1dZVmd2WXZpUjlOOG5pc1RSQWxlWFJfWmktX2ZOSFl0c0U5ZEstSDIxVHJ4QU1tcXE1RlZxSjdnZkxn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin & Ethereum Balances Hit 4-Year Lows Pre-July 2020 - Crypto Times",
        "content": "Bitcoin and Ethereum exchange balances reached their lowest levels in four years, with BTC dipping under 2.3 million coins worth $160 billion and ETH below 16 million worth $59 billion.\n\nIn fact, Glassnode reports that this decline in exchange balances has been a trend since before July of 2020. The study by Glassnode shows that in the past half a decade, various different market situations such as the pandemic, the 2021 peak, the 2022 Terra-FTX crisis, and the spot BTC ETF approval, has shown users active in withdrawing their assets from the exchanges.\n\nExchange Balance Chart: Source – Glassnode\n\nCryptocurrency users’ long-term bullish sentiment, fueled by factors like BTC’s role as an inflation hedge, adoption as legal tender in countries like El Salvador, and institutional demand from firms like BlackRock and Fidelity, underscores their positive outlook on cryptocurrency values despite volatility.\n\nIn 2020, Ethereum launched the Beacon chain, enabling Ether staking, with over 27% of Ether staked currently, valued at over $119 billion, highlighting its role in the optimistic scenario as the second most popular cryptocurrency and a key player in decentralized finance (DeFi).\n\nThe expectation of future spot ETH ETF approvals, DeFi growth, and staking activities have all boosted the bullish sentiments and made users “hodl” their tokens for the longer term.\n\nThis trend is in line with the general belief in the ability of such digital currencies as Bitcoin and Ethereum to increase their value in the future irrespective of the daily fluctuations.\n\nThe crypto community continues to believe in these assets because of the ongoing technological development and integration across different industries."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPWnRneEI0NDB0LTF1aF9HVmZETVE4eGhtSVhGUExrUW1oME1tenVaYXFhaWl5LWYtWlk5aTc4Sk4xcmJSYzNmVU01LXRXVEZ1NUp0MHhWVUNzZGlJV0EwZFFvdUxib2toaG5lNEFPdHNCeEJKWTNKenNidU1JbXEzeTBB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Beyond Bitcoin and Ether: 10 cryptocurrencies you need to know - Quartz",
        "content": "Created as a joke by software engineers Billy Markus and Jackson Palmer in 2013, Dogecoin features the likeness of the Shiba Inu dog popularized in the Doge meme. But what initially began as a joke would transform into one of the world’s most valuable cryptocurrencies.\n\n\n\nAdvertisement\n\nThe credit for Doge’s success goes to the GameStop saga that began in January 2021. The meme stock reached its peak when a group of small investors, encouraged by the Reddit community WallStreetBets and helped along by an Elon Musk tweet, skyrocketed the price of individual GameStop shares to $86.88 in January 2021.\n\n\n\nOn Reddit, investors later discussed what cryptocurrency is equivalent to meme stock GameStop — and the answer was Dogecoin. That’s how Dogecoin came into the limelight, and just as GameStop reached its peak, Dogecoin started to gain traction, peaking in May 2021 at $0.74 per coin.\n\nDogecoin had a market capitalization of $23 billion as of June 5, 2024, making it the eighth-largest cryptocurrency."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNcDQ0Z2dmbHlPU2c3OUtiTzZuUkdWcGVsNHdwc19UNXpOWUtDVTc1azNpMFd1T3BRdFNGYmY2UnBTcnNxTkpKeExBUmlkTkN6TVltcnBnQTUxYVFKdzAyTFFVckVTOUthQnlydGlrZXZtQnZoTkgxWkVRNjVMVHNkLTN6RVJBdzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Apple soars, bitcoin and ethereum fall: Tuesday's market trends - Yahoo Finance",
        "content": "Yahoo Finance's Jared Blikre joins Asking for a Trend to break down Tuesday's market trends.\n\nApple (AAPL) has reached a new all-time high, rising about 7% intraday. Blikre notes that the probability of this movement being a false breakout is an unlikely high-risk scenario.\n\nStock volume in the overall market has recently plummeted. Although volume is currently less than average, Blikre believes that it will normalize through the summer.\n\nFinally, bitcoin (BTC-USD) and ethereum (ETH-USD) are having their worst day in five weeks, which he also expects to normalize over the coming months.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Asking for a Trend.\n\nThis post was written by Melanie Riehl"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNUE5ybmg5QTQ0X2FpNWZYSlFReGk2ZWVvc1ZvYmNXNFNWbDdVTXFoUnE4SjBCeGY4Tl8wNWNtTzhMSmsyNnVfcmlOTVRMR3ZqdDU4OHpITzRmMUxHWWdkeU9Qb25BdGl5dU85ZzhjVWZXYnk3a0F5VVNyaEhWQWwxYkJBWkx4ZklXVDhr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Expected to Capture 20% of Bitcoin ETF Flows - Watcher Guru",
        "content": "Following the recent approval of the Spot Ethereum ETFs last month, one analyst has predicted that the investment vehicle will capture as much as 20% of Spot Bitcoin ETF flows. Indeed, cryptocurrency exchange Bitfinex’s head of derivatives, Jag Kooner, predicted the performance of the ETH offering.\n\nBoth Ethereum and Bitcoin represent the only two crypto-based ETFs in the United States. Moreover, since its approval in January, BTC has had one of the most successful exchange-traded products in the country’s history. Now, there is the expectation that Ethereum could capture a fifth of the flows going into the Bitcoin offering.\n\nSource: Watcher.Guru\n\nAlso Read: Can Ethereum ETFs Garner High Demand Like Bitcoin ETFs?\n\nEthereum ETF to Capture 10%–20% of Bitcoin ETF Flows\n\nWith the midpoint of 2024 fast approaching, the year has seen the digital asset sector climb to the forefront. Dominating discussions within finance, crypto-based ETFs have been a massive part of the ongoing discourse. As the second such opinion prepares to go live, the market is observing what its debut could look like.\n\nMoreover, they are beginning to question what effect its debut could have on the cryptocurrency industry as a whole. With Bitcoin proving to be immensely successful just five months after its launch, the presence of a secondary offering has undoubtedly become a point of interest.\n\nAccording to one expert, the recently approved Spot Ethereum ETFs could capture a significant portion of Bitcoin ETF flows. Specifically, Bitfinex Jag Kooner noted that the offering could acquire as much as a fifth of the overall flows into the digital asset investment offering.\n\nSource: Blockchain Reporter\n\nAlso Read: $438B Asset Manager Susquehanna Buys $1.3B In Bitcoin ETFs\n\n“Forecasts show that spot Ethereum ETFs could capture between 10 and 20% of the flows that have been going into spot Bitcoin ETFs,” Kooner told The Block. “The launch of gold ETFs offers a historical parallel, as when new gold ETFs were introduced, they attracted significant investment,” Kooner added.\n\nThe debut of those new gold ETFs, historically, affected the inflows in investment products that already existed. Kooner remarked, “Similarly, the introduction of Ethereum ETFs could see fund managers reallocating resources to balance their exposure to both Bitcoin and Ethereum.”"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOdXBVMUFlVjRRSmdMRFJDdkxjQmRRcEIycmlteEJHcndma2x6c3lfUzJ4Y285OUR1cEJXbUl2cHd3WmQ1ODBWMXhvRVA1MGF2Q3ZUMGRtSkZkY2ExWGF2TkRiLTFJZUVrZDRkNXJ0cUEteFdNT3RyU2FheC1DbVlZQTFuWjVCM19MTEVDejZxRl9nY01qWk4xRS1XSWkwU0xiTjd2MnF3QS01dDZiczU0eEx4NEJIaknSAbwBQVVfeXFMT3FWLW9MdmJPR0F2VkU5bmlsbGNJRkt5dlpMUmhZWjhVdHpzNC1WSUZpbXJ5RjhtQl9aU2JtSUJFUG1BS3kwS08yQ19vWF8taDhtZmk2Vmo4RU9ZUGhwYXVxN3NOaGV1T01JQmlZSVJod2F5RWRKcWpURWtNM1lUOHJ1WGRFVG5SSlBHcDZnMEFnamVObnpJMEg0WXhLQTdMbjRGSDc0QkZUNDFJS3VtbFBJTUdFaWdKQWV6V0g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Biggest Bank in the World Says Ethereum Is ‘Digital Oil,’ Bitcoin ‘Digital Gold’: Report - The Daily Hodl",
        "content": "The world’s biggest bank, the Industrial and Commercial Bank of China (ICBC), is reportedly calling Bitcoin (BTC) “digital gold” and Ethereum (ETH) “digital oil.”\n\nIn a new report shared by Matthew Siegel, VanEck’s head of digital assets, the ICBC gives praise to the top two cryptocurrencies by market cap.\n\nThe report also says that market demand is strong for digital assets, pushing innovation in the sector.\n\n“Market demand drives the continuous iteration of digital currencies.”\n\nThe report draws comparisons between Bitcoin and gold while also saying the crypto king has added benefits.\n\n“Bitcoin retains the scarcity similar to gold through mathematical consensus, while solving its problem of being difficult to divide, difficult to identify authenticity and inconvenient to carry. Its monetary attributes are gradually weakening, while its asset attributes are constantly strengthening.”\n\nIn calling Ethereum “digital oil,” the report praises various characteristics of the top smart contract platform’s ecosystem. While ICBC highlights some of the network’s shortcomings, it also believes technological advances will resolve them over time.\n\n“Ethereum has been continuously upgrading its technology in terms of security, scalability, and sustainability, providing technical power for the digital future…\n\nEthereum introduces Turing completeness with its exclusive programming language (Solidity) and virtual machine (EVM), allowing developers to write and arrange for a variety of complex smart contracts and applications, providing a strong platform support for blockchain technology. Its flexibility has been widely recognized in the fields of decentralized finance (DeFi) and non-fungible tokens (NFT), and is gradually extending to the physical infrastructure network (DePin).\n\nIn essence, Ethereum’s Turing completeness enables it to execute any programming instructions under the premise of correct instructions and sufficient resources, but it also poses several practical problems…\n\nLooking ahead, Ethereum developers will continue to work on finding the Pareto optimum between sustainability, security and efficiency.”\n\nBitcoin is trading for $66,502 at time of writing, down 5% in the last 24 hours. Meanwhile, Ethereum is trading for $3,464 at time of writing, down more than 6% on the day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQR2tqZmtmZGZjVlhCeUxQODRmbmRLbW9tNWFkSVhGOU8za1hiOWxhTjloanVqaTV3UmwwMk9YTTFKZHRabE9Vb3FjNTQxVEVYRXZmc1k2WDRGQlN4d3k2YVhVWTR3THhpMTBJbDFidUY0YkY5RFhDQWRFOXNxZy1RZUFFdkRfTVN1d0dCcTh3M1hxMzVadlJUX0pWNGx2VHpqRzI5eWlldHJ0YjRVczV4Wm15NnczeGtoVVJJSDVnTC1ydzFUbGRTRDZueFBBUVZTa0lBTW5B0gHbAUFVX3lxTE1pYjVjc3FoODFFOFNGeFlqbFNWYVh1VUQzUU15cEZsR2RqMDlDTlNPZExsbkZyWGNBTzBRYXY1VEtMeWtST1l2SW1RekhtLWJnY2lNRlhxeEdmRVpuSnMwV2tKN0hYNDhiX2hpOTNnbkFEVUQ2NHBKZVRnTm8yX3RsZHI0T3ZYLVQxbGgwWHlIUG5nLWpibDhSWVh1dWdOeHFTaTVhM3lpLVd5WE1CMkktT3RoNk5sWVJnVVJQR0daTnpuZVRNWnVXa1JZRm13ME16bjdNQ2s3NmVFdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Ethereum breaches key support, receives ‘digital oil’ tag from world's largest bank - FXStreet",
        "content": "Ethereum is termed the \"digital oil\" of the digital future by the world's largest bank, ICBC.\n\nSEC is yet to provide feedback on ETH ETF S-1s despite expectations of the agency's comments earlier on Friday.\n\nEthereum's recent sell-off may be temporary, considering bullish events on the horizon.\n\nEthereum (ETH) is down over 6% on Tuesday as the general crypto market is trending downward. Despite the bearish sentiment, the Industrial & Commercial Bank of China has commended Ethereum's growth, describing it as \"digital oil.\"\n\nDaily digest market movers: SEC stays mute, ICBC commends ETH\n\nIn a recent report, the world's largest bank, the Industrial & Commercial Bank of China (ICBC), hailed the growth of Ethereum and Bitcoin. While comparing Bitcoin to Gold due to its scarcity, the bank also termed Ethereum \"digital oil,\" noting its role in \"providing a strong platform\" for supporting a host of Web3 innovations.\n\nAlso read: Ethereum ecosystem sees impressive Q1 earnings, issuers plan to market ETH as the ‘ultimate app store’\n\n\"Ethereum has been continuously upgrading its technology in terms of security, scalability and sustainability, providing technical power for the digital future,\" the report states.\n\nMeanwhile, the Securities & Exchange Commission (SEC) has yet to respond to prospective spot ETH ETF issuers on Tuesday, more than one week after they filed their S-1 registration statements on May 31. Issuers had expected the agency to comment on their filings on June 7. However, they have yet to get any feedback and now expect the SEC to provide comments this week, a source told The Block. According to Nate Geraci, issuers will file another round of amendments after they receive the SEC's comment.\n\nThe SEC approved spot ETH ETF 19b-4 filings of issuers on May 23. Before spot ETH ETFs can begin trading though, the agency must approve the issuers' S-1 registration statements. SEC Chair Gary Gensler told Reuters last week that the timing of the S-1 approval depends on how fast issuers respond to the agency's comments.\n\nRead more: Ethereum's price suffers slight decline amid Hong Kong's plan to allow staking in ETH ETFs\n\nWhile the wait continues, issuers have stated that they plan to market the ETFs as a “producing tech stock” or the “ultimate app store.”\n\nETH technical analysis: Ethereum's recent setback may be temporary\n\nEthereum is trading around $3,490, down over 6% on Tuesday. The market appears to be in risk-off mode ahead of the Consumer Price Index (CPI) report and Federal Open Market Committee decision on June 12, according to QCP Capital.\n\nThe market decline has accelerated ETH liquidations, with long liquidations accounting for $48.39 million of a total of $52.58 liquidations in the past 24 hours.\n\nAlso read: Is Ethereum price forming a local top?\n\nETH open interest (OI) has declined by about $680 million between Friday and Tuesday. Specifically, ETH options OI also reduced by $1.21 billion in the same time range. Coupled with declining options volume, this confirms the bearish sentiment in the market.\n\nETH/USDT 4-hour chart\n\nETH has breached the $3,618 support and is looking to extend the downward move below the $3,457 price level. With spot ETH ETFs on the horizon, the current sell-off may prove to be a temporary setback and a good accumulation zone. A further plunge below the $3,300 support will strengthen the bearish trend."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPWEFGNWV2UkJIczI3UU9LWS1aTEhna0U1V0Zib29TOHJSaldPamVNT0p0eHlxdThpZ2pSaC1VN1ByVTM0VFp2UFY3eUpUblBkbGJlR3F1X29tRTFGa2l4ZU9UQWNjbjBtY3FyUjdrcWxwOHFuUTB3OUw4STh5XzEySXI5YjB5MXZk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC)’s 200K Potential, Ethereum (ETH)’s Growth, and Furrever Token’s Rewarding Referrals - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, June 11, 2024 (GLOBE NEWSWIRE) -- The cryptocurrency market is rife with opportunities and evolving narratives. As we navigate through 2024, Bitcoin, Ethereum, and Furrever Token stand out as significant players with distinct prospects and features.\n\nBitcoin’s 200K Potential\n\nBitcoin, the pioneer of cryptocurrencies, continues to dominate discussions with bold predictions. Analysts are eyeing the $200,000 mark, driven by potential catalysts like institutional adoption, macroeconomic shifts, and technological advancements. Despite recent fluctuations, Bitcoin’s long-term outlook remains optimistic. This price target is not just speculative hype; it reflects Bitcoin’s growing acceptance as a store of value and hedge against inflation. Investors are keenly watching regulatory developments and market trends that could propel Bitcoin to new heights.\n\nEthereum’s Growth\n\nEthereum, the second-largest cryptocurrency by market capitalization, is experiencing a bullish trend. Its robust ecosystem, fueled by smart contracts, decentralized finance (DeFi) applications, and non-fungible tokens (NFTs), positions Ethereum for significant growth. The anticipation surrounding SEC approval for an Ethereum ETF further boosts its prospects. If approved, this ETF could attract substantial institutional investment, driving Ethereum’s price upwards. With Ethereum 2.0’s ongoing upgrades aimed at improving scalability and efficiency, the platform’s potential continues to expand, making it a compelling investment option.\n\n\n\n\n\nFurrever Token’s Rewarding Referrals\n\nAmidst the major players like Bitcoin and Ethereum, Furrever Token introduces a refreshing and engaging twist to the crypto market. Designed with a charming cat-themed ecosystem, Furrever Token aims to provide a delightful user experience while offering substantial financial opportunities. One of its standout features is the new referral program, which allows users to earn 10% in $FURR Tokens for every deposit made through their personal referral link. This system not only incentivizes community growth but also creates a stream of passive income for users.\n\nThe ongoing presale of Furrever Token has already raised over $1.3 million, with the project currently in stage 9, aiming for a total of $1.9 million. The token, priced at $0.000732, offers the potential for up to 15X returns, making it an attractive investment. Furrever Token’s roadmap includes exciting future developments, such as exclusive cute cat content, ensuring continuous engagement and rewards for its community. The project’s commitment to security, validated by an audit from Securi Lab, further enhances its credibility.\n\nStory continues\n\nConclusion\n\nAs the cryptocurrency landscape evolves, Bitcoin, Ethereum, and Furrever Token each present unique opportunities for investors. Bitcoin’s ambitious $200K target, Ethereum’s growth fueled by its versatile ecosystem, and Furrever Token’s innovative referral program create a diverse array of investment options. By staying informed and strategically investing in these promising cryptocurrencies, investors can navigate the dynamic crypto market and capitalize on its potential.\n\nWhether you are captivated by Bitcoin’s bold predictions, Ethereum’s technological advancements, or Furrever Token’s charming and rewarding approach, 2024 promises to be an exciting year in the world of cryptocurrency. Explore these opportunities and make smart investment choices to maximize your returns.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support-at-furrevertoken.com\n\n\n\n"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPYWJzNVdIdlE0U2szMmVqczZYSVdqWC1nbEJqUnpKeUVDeE1zWUd5d0ZNMWVrMVV4RW1IZFV3bzdSX25EMVFEYnJteVNsdEhqU0FQQmszVFNkNVB0MmpfWVliYjNKNVVzY2x3LUZueTdiQnZ6c05mdHJoSVlaS0FwSG9xNDctNXVwVklYeWJmbVNTcWNiaU1jdVFwWDZrd9IBowFBVV95cUxOTEozQzhFdWdlOEJVOVVfMmlHYXpPWF9YaGx3dFFqVVVHb05qRDVQX3plMnVZLW50bzk0RUxMMl9TSkxUQXhGVWdMQ0diOGs0RnhsQm1Ta25aUXFaRmhSRGs4UWFROGFNWUlWZGR1S1JybEVMdGQ1X2RpcE5EMTRHcl8ySC1wdU9PTS1QVVRuZURiWmFBUU10OWZZMlFrSm1SdFBZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum price forming a local top? - FXStreet",
        "content": "Ethereum price struggles to surpass the $4,000 mark.\n\nOn-chain data suggests that the short-term whales are booking profits.\n\nETH development activity and active addresses slow down.\n\nEthereum (ETH) price faces struggles to surpass the $4,000 barrier. On-chain data reveals that investors appear to be capitalizing on gains, contributing to the emergence of a potential local peak. This situation can be seen in the decreasing ETH development activity and a corresponding slowdown in active wallet addresses, suggesting a pivotal moment in the trajectory of Ethereum's price journey.\n\nEthereum whale activity\n\nData from CryptoQuant's 7-day moving average of the Taker Buy Sell Ratio reveals the relative aggressiveness of buyers versus sellers. A value above one suggests buyer dominance, while a value below one indicates aggressive selling.\n\nThe chart below reveals that the Taker Buy Sell Ratio has remained below one and has been declining sharply in recent days. This indicates that most futures traders are aggressively selling Ethereum, either for speculative reasons or to take profits. This significant drop in the metric is a bearish signal, suggesting the current downward retracement in ETH could persist if this trend continues and a local top forms.\n\nETH Taker Buy Sell Ratio chart\n\nSantiment’s Network Realized Profit/Loss (NPL) indicator provides daily network-level Return On Investment (ROI) data based on a coin’s on-chain transaction volume, offering insights into market sentiment. Sharp spikes in a coin’s NPL suggest holders are selling at significant profits, while steep dips indicate holders are realizing losses, potentially signaling panic sell-offs and investor capitulation.\n\nFor ETH, the NPL indicator spiked from 36.69 million on June 10 to 1.06 billion on June 11. This positive trend suggests holders are selling at significant profits, hinting at the formation of local tops.\n\nETH Network Realized Profit/Loss chart\n\nSantiment’s data of Active Addresses indicates the number of unique addresses that participate in transactions on a blockchain or cryptocurrency network within a given day. This metric is used to gauge the level of network activity and user engagement. Higher Active Addresses typically suggest increased usage and interest in the cryptocurrency, whereas lower Active Addresses mean weakening demand and diminished confidence in the cryptocurrency.\n\nAs in ETH’s case, the number of Active Addresses is decreasing constantly, from 644,950 addresses on March 20 to 450,000 addresses on June 11. This 30% fall in Active Addresses indicates weakening demand and diminished confidence in ETH.\n\nETH Active Addresses chart\n\nSantiment’s Development Activity indicates project development activity over time based on a number of pure development-related events in the project's public GitHub repository.\n\nAn increase in metric typically signals ongoing efforts to maintain, innovate, and enhance the protocol, which investors and stakeholders view positively. Conversely, a decrease in the index may trigger concerns regarding the project's sustainability, innovation capacity, and community involvement over the long term.\n\nIn ETH’s case, a sharp fall in the index from 329 on May 19 to 270 on June 11 implies that Ethereum's developing activity is constantly decreasing, signals concerns regarding the project's sustainability, innovation capacity, and community involvement over the long term, which adds further credence to the bearish outlook.\n\n\n\nETH Development Activity chart\n\nAnalyzing the declining Taker Buy Sell Ratio, surging Network Realized Profit/Loss, dwindling Development Activity, and diminishing Active Addresses collectively implies a potential local top for Ethereum's price. Nonetheless, a shift in market sentiment fueled by positive US CPI news this Wednesday, coupled with significant institutional investment inflow into Ethereum spot ETFs, has the potential to negate the bearish outlook and propel ETH towards retesting its all-time high at $4,878."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQWFVyS1hFVFAwWWZwNW41bUVEYWw0Y1lQWk5iU0VNbWt3M2ZLS1RWVW11YXV3cXB3RVRTc05jcGFybmMtVmNjd1VCMzFodGJ3cU5YWnJsRmpNNjNSUVhpYnFVZm4yS1A0aEVtR09QQ2RCUVNvcS02NnptQ1lyMG12ci1nR29IejQtUnF6NlZuZC1BZzd5U2w2alRmNjV2N0VRWmZaTtIBqgFBVV95cUxON2dOb3ZNNkhCdUhlY1l6cklMZVVEYmJXdmNacEZrSTEwQ3RoaUlKZHdNSHNNdmxkUXNXbXBNRDZVb3oyS29QYjBVZTVKWFFMWnY2bWh4dUk1ZXljbzVRS2czMTJnNU1Ob0QyQThFdnMzTTJDQzR1R1djYmlDMjctZzUzZjFPa0RzY21ZdnVFTDJkdXUzamlBc0pPcW1XRzMwS1hnUFhXTks4dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Institutional Money Pours Into Ethereum, Addresses Holding Over 10K ETH Surge - CryptoPotato",
        "content": "All eyes are on spot Ethereum ETFs. SEC’s surprising turn of events last month has prompted a surge in addresses holding large amounts of ETH during the period.\n\nSuch a trend could potentially hint at a much-needed revival for the world’s largest altcoin, which has been struggling to surpass the $4,000 resistance level.\n\nWealthy Investors Accumulate ETH\n\nThere has been a 3% rise in the number of Ethereum addresses holding 10,000 or more ETH over the last three weeks. This metric is seen as an indicator of rising institutional investment and accumulation by Ethereum whales and high-net-worth individuals.\n\nPopular crypto analyst Ali Martinez tweeted,\n\n“The number of #Ethereum addresses holding 10,000+ $ETH has increased by 3% in the last three weeks, signaling an important spike in buying pressure!”\n\nAs such, a spike in addresses with large ETH holdings suggests increasing buying pressure and demand from deep-pocketed investors. This could potentially be an upcoming bull run for Ethereum as whale accumulating supply is often a precursor to an uptick in asset prices.\n\nThis comes a month after the US Securities and Exchange Commission (SEC) reached a landmark decision to approve spot Ethereum ETF. The financial watchdog granted permission for a total of eight separate ETF products tracking Ethereum proposed by Grayscale, VanEck, ARK Invest, Franklin Templeton, Fidelity, BlackRock, 21Shares, and Invesco Galaxy.\n\nThese listings will enable traditional investors to gain exposure to the cryptocurrency through regulated investment vehicles and are also expected to unlock new capital inflow while simultaneously boosting its mainstream accessibility and liquidity. Hence, whales are bullish on the development as evidenced by the resulting accumulating activity.\n\nEthereum Scarcer Than Bitcoin on Exchanges\n\nFurther validating this trend is Glassnode data, which shows that centralized exchanges are experiencing a supply crunch for both Bitcoin and Ethereum. Only 11.73% of Bitcoin’s total supply and an even lower 10.56% of Ethereum’s supply remain on major exchanges.\n\nThis indicates that investors are withdrawing and holding their cryptocurrencies off exchanges, further signaling an accumulation trend.\n\nWhen supply on exchanges dries up, it can create upward price pressure as the remaining liquidity gets absorbed by buyers. Interestingly, Ethereum appears to be even scarcer than Bitcoin on exchanges currently."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPeXNGYWs3N2V6M1BEZ2UzNHhqMkllYWloS2VaaWVpQ21XckF0a2pNX0dBNHpUQlhCT1l0YWlMWE01ZklhU0pkWkp5MUxGQjFEZXNUdjdqd2pJZmRvRFZndXZwd1FzZDF5eWRVVzZrelFxei1WNkdnajJSUnJyeEFBaWxmX2FkR2hRWmFPX1pB0gGTAUFVX3lxTE90bHJIVnIzM1NvTTc3SmZ4TkhxLTR5VTluS1FUckZGSldYUENtbzdER0s4WWJ5QmhkeFRTUTRYREpvT0R5X0N1ejg5Wjl3WDRqWlVyaVRXTzhvZWhvTVpkU2Q4MjhzdGRqdEdkMVV3eEtHWl9hYjliMWIxNXFYTmlDM19GRmJDM01YbWxYaW4yQ2FGdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Faces Bearish Phase as Futures Traders Aggressively Sell - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nRecent data from CryptoQuant indicates a bearish outlook for Ethereum (ETH), suggesting that the current downward trend might continue if prevailing conditions persist. Ethereum, struggling to maintain momentum above the $4,000 mark, is facing significant pressure from futures market participants.\n\nAdvertisement\n\n$ETH's plummet might persist in the short term\n\n\n\n“This trend suggests that the majority of futures traders have been selling #Ethereum aggressively, either for speculative purposes or to realize profits.” – By @Greatest_Trader\n\n\n\nLink 👇https://t.co/yz9DVphQ8l — CryptoQuant.com (@cryptoquant_com) June 11, 2024\n\nThe provided chart illustrates the seven-day moving average of the Taker Buy Sell Ratio, an indicator used to gauge the aggressiveness of buyers versus sellers on the futures market. This metric is crucial for understanding market sentiment and potential future price movements. A value above one indicates buyer dominance, suggesting more aggressive buying activity. Meanwhile, a value below one signals seller dominance, pointing to more aggressive selling activity.\n\nIn the context of Ethereum, the chart reveals a troubling trend. The ratio has consistently failed to climb above one and has been on a sharp decline recently. This decline indicates that the majority of futures traders are selling ETH aggressively. This selling could be driven by speculative strategies or the need to realize profits amid market volatility.\n\nAdvertisement\n\nImplications of current trend\n\nThe significant drop in the Taker Buy Sell Ratio is a bearish signal. It suggests that sellers are outweighing buyers, leading to increased downward pressure on Ethereum's price. If this trend continues, ETH might struggle to break through resistance levels, potentially leading to further price declines.\n\nSeveral factors could be contributing to this aggressive selling behavior. For instance, the overall bearish sentiment on the crypto market could be influencing ETH traders to sell off their positions in anticipation of further declines. Moreover, traders might be realizing profits from previous gains, contributing to increased selling pressure."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQRXkxOGRJZlBqUkIxcjk2dVlIWk1uYzBYZmQ1YUpjVExZem50TnlTZFZ6SWstRmtXSkNDTkVCNTc5QUcxbUVYM1pmSEhjV1JCSEFvQk1ieTk4ODUyOTZJcnlpOGtqQ1VCU2EzNHZHYklSOW4zLXBtVHV1NjdhTWJqOGo4azUtR3hhRExnWmU4TQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Struggles Amid Regulatory Uncertainty and Market Concerns - Yahoo Finance",
        "content": "Ethereum Price Struggles Amid Regulatory Uncertainty and Market Concerns\n\nEthereum (ETH) has declined to $3,560, dropping 3.4% in the past 24 hours despite the anticipated launch of spot exchange-traded funds (ETFs) in the United States. The lack of bullish momentum for ETH is being attributed to regulatory uncertainties and broader macroeconomic concerns, which have dampened investor sentiment.\n\nDespite the potential for the U.S. Securities and Exchange Commission (SEC) to approve ETF filings from major firms like BlackRock, Fidelity, and VanEck this week, investors are hesitant. The lack of clarity on the timeline for individual S-1 fund filing approvals by the SEC has added to the uncertainty.\n\nBeyond regulatory issues, the macroeconomic environment is also a concern for investors. The real estate market, both in the U.S. and globally, is showing signs of stress. Moody’s Ratings recently warned that at least six U.S. regional banks are at risk of having their debt ratings downgraded due to significant concentrations in commercial real estate, which is suffering from higher interest rates.\n\nThe bearish sentiment is evident in ETH futures metrics, which have reached their most pessimistic point in over three weeks. Data from Laevitas.ch reveals that the ETH futures premium dropped to 13% on June 10, down from 15% on June 6. While this is not outright bearish, it is the lowest level in over three weeks, indicating diminished confidence."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE92S3RBbXp5VDVQWkZKanRmek5IcUJjNGpkWmxyUzU2THRvc3FURzAwQUxsbUM1UlVxWUZ6XzJTOGNIaEpHZ0RjOTVmbGdvZ2tBUTdJbFBNYjJBVkwzOW9XSUl1NzFVZXBiSDF3ejlwMjJFQWswZ1RsU3MzZTbSAYIBQVVfeXFMUGROa1NHVG8tU3VCMmRtZjJkck5WOUhVOVRTWERITWg0RXFkbFlxQTFLQU03UWJoWk5JUHk0cXdfaFJLYVE2a3R5S0k4OHEteGJSamZBZDdkY2Z1SjktWjJUdU52SUtFQnJCX3h2cTRZbUNaZGxmTTBBRE5WSUZjZkNFUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Major Spot Ethereum ETF Update to Come This Week: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nDespite the United States Securities and Exchange Commission (SEC) granting approval for a spot Ethereum ETF, the cryptocurrency world is still awaiting S-1 approval to usher in trading of the asset. Per a source in communication with the SEC, some comments are now anticipated this week. Nate Geraci, an analyst, in a post on X said that at least one of the several prospective issuers that filed an application will receive comments from the regulatory authority this week.\n\nAdvertisement\n\nFwiw, at least one prospective spot eth ETF issuer anticipating SEC comments back on S-1 this week...\n\n\n\nIssuers would then file another round of amendments based on those comments.\n\n\n\nvia @Timccopeland pic.twitter.com/WB1VQcmbh0 — Nate Geraci (@NateGeraci) June 11, 2024\n\nSpot ETH ETF regulatory delays and issuer expectations\n\nNotably, since the May 31 deadline passed to submit the first draft of S-1 registrations, spot Ethereum ETF issuers have anticipated that the regulatory body would provide an update on the status of their application. To date, nothing definite has come from the Gary Gensler-led commission.\n\nInterestingly, issuers were optimistic that the SEC would provide comments on the drafts as of June 7. However, two of the issuers categorically stated that nothing was communicated from the SEC to them. The only communication from SEC Chairman Gary Gensler at a recent appearance on CNBC was ambiguous.\n\nThe back and forth of the SEC prior to granting the 19b-4 approval led some issuers to drop out of the race. Notable among those that pulled out was Cathie Wood’s Ark Invest. The asset management firm, despite filing documents with the SEC in partnership with 21Shares to become an Ethereum ETF issuer, later withdrew.\n\nArk Invest, in an official statement, noted that it continues to believe in Ethereum’s “transformative potential and long-term value.” However, Ark will no longer pursue an Ether ETF product.\n\nStakeholders' concerns about spot Ethereum ETF\n\nAs issuers anticipate clear communication from the regulatory body, some stakeholders are entertaining doubt as to the potential of the spot Ethereum ETF product. Global banking firm JPMorgan believes that these products could attract a much lower share of inflows than expected.\n\nAnalysts are, however, optimistic that if the SEC gives the green light, the product is likely to perform well in the crypto space."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9zZHdCTENnS3h3NV9fMzgwZjJUV0FicFJRQUVMaFNPTjB1eURQTWtodDkyamllVnEtSGg0LWtNQlJxR0wtWVdlSFIwazZ6UEdmY1FhS0VBTGdteWw4VzY1QUd6SWl5ZWRZc095eWpkZHZDaTBJV1VZTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum exchange balances at 4-year low - crypto.news",
        "content": "Bitcoin and Ethereum user balances have dropped to levels not seen since 2020.\n\nGlassnode data revealed that user balances of Bitcoin (BTC) and Ether (ETH) on centralized exchanges reached a four-year low as investors held out for higher prices in a bull market.\n\nBTC balances dipped to below 2.3 million coins, valued at around $160 billion, while ETH balances have dropped below 16 million, amounting to less than $59 billion.\n\nBitcoin and Ethereum exchange balance at 4-year low | Source: Glassnode\n\nWhy Bitcoin and Ethereum exchange levels dropped\n\nThe amount of BTC and ETH on exchanges has been in a downtrend since before July 2020, per Glassnode. Data confirmed that users continued to withdraw assets from these platforms following the pandemic, through the previous 2021 peak, during the 2022 Terra-FTX contagion, and even after spot BTC ETFs were approved.\n\nThe four-year pattern suggests that crypto users have adopted a bullish long-term outlook, expressing confidence in the future appreciation of these assets regardless of market cycles.\n\nAfter the COVID-19 crisis in 2020, inflation also rocked world economies and incentivized investors to station capital in technologically sound vehicles. Bitcoin’s hard-capped supply and immutable design bolstered its status as an inflation hedge and sovereign nations like El Salvador have adopted the cryptocurrency as legal tender.\n\nYou might also like: Bitcoin ETFs see significant inflows despite market fluctuations\n\nThe bullish thesis is perhaps solidified even further as Wall Street behemoths like BlackRock and Fidelity drove institutional demand through spot BTC ETFs. Companies like MicroStrategy under BTC maxi Michael Saylor have also parked billions in the top digital asset.\n\nAs the second-largest crypto and top altcoin asset, ETH commands its own bullish thesis as the leading substitute for BTC. The token powers the biggest decentralized finance (defi) ecosystem worth nearly $70 billion per DefiLlama.\n\nIn 2020, developers launched the Beacon chain, which kicked off the eventual transition from proof-of-work (PoW) to proof-of-stake (PoS). The move unlocked Ether staking, a process of locking up ETH for network security and passive yield.\n\nAt press time, over 27% of Ethereum’s supply was staked. In other words, users have deposited over $119 billion worth of ETH in staking providers like Coinbase, Lido, and EigenLayer.\n\nThe hype around spot ETH ETF approvals, defi growth, and staking surges has culminated in a positive outlook for the cryptocurrency and has further encouraged users to hold on for dear life, otherwise known in the crypto community as “hodl.”"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPQ2FlbkdveHVOVDFseWpWeHZJZ1ZXLVRxMkliaXVnRWlYRWlocVZ5NURUbFloaVZGNUJqcDMtZDBGdzgtYjZVeHF0Wng3SzNrU2lEeTdtdWpBSDNqT25POGtYTm9vUkpuakg2OGJfdlc0OWxEcHVzTWJfbXNFcTF3WV9Dd2RRWS1MaWRRMmJuUFRLYjVtTERvZnZxQ0FESXBIT3lHTk5XU1RMTzNfWURHSDVtekR2NUo1Z3hoZ3QtZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "World's largest bank ICBC praises the evolution of Bitcoin, Ethereum as innovative financial assets - CryptoSlate",
        "content": "The world’s largest lender, Industrial and Commercial Bank of China (ICBC), recently published an in-depth analysis highlighting the rapid evolution and growing diversity in digital currencies, where it compared Bitcoin to gold and deemed Ethereum “digital oil.”\n\nThe report emphasizes the human capacity for imaginative belief, as noted by historian Yuval Noah Harari, as a driving force behind the exponential growth in digital currency types and applications.\n\nVanEck head of digital assets research Matthew Sigel noted:\n\n“Chinese SOE banks keep writing love letters to Bitcoin and Ethereum.”\n\nThe ICBC report outlines the divergent development paths of various digital currencies, each addressing unique needs within the financial ecosystem.\n\nThe love letter\n\nAccording to ICBC’s report, market demand has fueled innovation in the digital currency sector, from the birth of Bitcoin (BTC) to advancements in Ethereum (ETH) and the exploration of central bank digital currencies (CBDCs).\n\nICBC said that Bitcoin has managed to retain a scarcity similar to gold through its mathematical consensus mechanism. The flagship crypto has resolved issues related to divisibility, authenticity verification, and portability. The report added that despite Bitcoin’s waning monetary attributes, its status as an asset is solidifying.\n\nMeanwhile, Ethereum provides “technical power for the digital future” and is establishing itself as “digital oil” capable of powering myriad applications across the web3 ecosystem.\n\nEthereum, distinct from Bitcoin, incorporates Turing completeness through its proprietary programming language, Solidity, and its virtual machine, EVM.\n\nThis feature allows developers to create and manage complex smart contracts and applications, positioning Ethereum as a critical platform for DeFi and NFTs. The report also acknowledged Ethereum’s potential to extend its influence to decentralized physical infrastructure networks (DePin).\n\nDespite the potential, Ethereum faces several practical challenges, including security vulnerabilities, scalability issues due to high computational demands, and significant energy consumption.\n\nEthereum developers are exploring various solutions to address these challenges. The introduction of the Proof of Stake (POS) consensus mechanism and sharding technology in the Ethereum 2.0 upgrade aims to enhance network throughput and sustainability. Additionally, developers are working on Layer 2 solutions such as state channels, side chains, and rollups to improve scalability.\n\nStablecoins and CBDCs\n\nThe report also highlighted the crucial role of stablecoins in bridging the gap between the digital currency market and the real world. Stablecoins, which peg their value to traditional assets like fiat currencies, offer stability in the volatile crypto market.\n\nICBC said that stablecoins facilitate seamless transactions and provide a reliable store of value, making them an essential tool for everyday financial activities and a bridge for integrating digital currencies into the global financial system.\n\nFurthermore, CBDCs represent a significant innovation in the modern monetary system. By digitizing fiat currencies, central banks can improve the efficiency of payment systems, reduce transaction costs, and enhance the effectiveness of monetary policy.\n\nAccording to the report, CBDCs can streamline cross-border transactions, reduce reliance on intermediaries, and offer greater financial inclusion by providing access to digital financial services for unbanked populations.\n\nThe report noted that the development and implementation of CBDC infrastructure requires careful consideration of privacy, security, and regulatory implications to ensure their success and widespread adoption.\n\nThe report concluded that while the development vision for each digital currency varies, all aim to enhance financial inclusion, security, and payment efficiency. As digital currencies continue to evolve, developers and policymakers need to focus on balancing sustainability, security, and efficiency.\n\nMentioned in this article"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxONWpZRTZsZEthNGZEaGVZZFNzeXRLQzhIRUF6OVNhTGNlZlB5dnIySDBWRXpibWFIakkxSndobU9MQzdzUUN3TGJCQVpRQWJFOG5NRGlGck1WNV9wbVcweXpubk9DcXdiazBTazAwOWRjMGZWbEJUclRydEdYN1ljaFJwVnlMd3JZSzluQkZmOVExdjI3blE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Why will Ethereum drop toward 2500 level for BITSTAMP:ETHUSD by ShinForex1 - TradingView",
        "content": "The information and publications are not meant to be, and do not constitute, financial, investment, trading, or other types of advice or recommendations supplied or endorsed by TradingView. Read more in the Terms of Use"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxObmd3dEU4RXg4RFBXZkZPcDlvOFpkaXRhZ3hXTTFKOW4zN19HVHUtbEowVnVtWEZrbXcwUERsVlZYQ3FtQk5UVzdlaUYxM1YxckRCLWhRalBMTE82MGtNSDF1eFFxRW80UURlSWlDSEpybTZSWGJuWUJIX0N3d2FuclRoM2ViVUswbkRYd3ZuU2JrenlaOE9ocNIBngFBVV95cUxPdkJaMUFPRGwtVi1PTmhtRlMyNEplUUlCWXRGenc0ZFBhcEZDNVpCTUNTU2ZEOEI2UENLTU1RalNRMGNVR3d5QlJjMUgwdWZhMDlYN0F1SUVtYnp6OWo5N3ZJTXlXUmYteHB3WWl2cl91ZnczZ1ZtSzZWeU1Md056Z3RFWXhTM2xWc3NBaDBPLURxemlfa0NMb3BXbDNiQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s sentiment takes a hit after ETF nod, but it’s not all bad news! - AMBCrypto News",
        "content": "Ethereum’s funding rate has remained positive despite recent declines.\n\nThe ETH trend has also remained bullish despite the price declines.\n\nAfter the news of the Ethereum [ETH] spot ETF approval subsided, its weighted sentiment declined as well. Despite this decline, other metrics suggest that Ethereum might be poised for a positive run once spot trading resumes.\n\nEthereum’s sentiment and social volume declines\n\nAn analysis of the Santiment sentiment chart showed a decline in Ethereum’s sentiment. The chart indicated that weighted sentiment spiked to over 6% on the 20th and 21st of May.\n\nIt then briefly declined to around 2% before spiking over 6% again on 23rd May. This spike coincided with the news of the ETH spot ETF approval, reflecting heightened conversation and sentiment during that period.\n\nHowever, after that spike, there have been declines in the weighted sentiment, which has now turned negative. As of this writing, the weighted sentiment is around -0.4.\n\nThis indicates that negative sentiment now outweighs the positive sentiment that Ethereum enjoyed a few weeks ago.\n\nAdditionally, an analysis of the social volume showed spikes corresponding to the increases in weighted sentiment. The chart indicated that social volume surged to 4,197 during those periods.\n\nHowever, similar to the weighted sentiment, it has since declined significantly. As of this writing, the social volume was around 415.\n\nEthereum’s trend of new addresses continue\n\nAn analysis of the new addresses chart on Glassnode revealed that new addresses have continued to flow in despite the weak sentiment. As of this writing, the number of new addresses exceeds 105,000.\n\nAlthough there were declines at the beginning of the month, an uptrend is now evident. This indicates that more addresses are being created even before the spot ETH trade gets underway.\n\nThe number of addresses could further increase once trading starts.\n\nEthereum remains positive on the derivative side\n\nAn analysis of Ethereum’s weighted funding rate on Coinglass showed that it has remained positive despite recent declines.\n\nThe chart indicated that the funding rate was around 0.092% as of this writing. This suggests that buyers dominate the market, and there is a strong belief in a future rise in Ethereum’s price.\n\n– Read Ethereum (ETH) Price Prediction 2024-25\n\nETH sees slight increases\n\nAs of this writing, Ethereum was trading at around $3,690 after a 0.4% increase. AMBCrypto’s analysis of its daily time frame price trend showed slight increases over the last two days.\n\nThese slight increases followed an over 3% decline on 7th June, which brought Ethereum down from the $3,800 price range."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQODliLUZTcDNJekdXUmRMR09QR3FvZlJOU3VBbEhSM0toYzVEYTFkVUVJMWxGanFZWmlwQ0hMbFBtYkdsbzhsR3FXenpjZnlFSVh6RmRsXzA2Uk9pVWlnRGN0amV0WlBfaFpCS2ttdC13SDNLLS1BWDFySnZ5a0JuWTY1YklvMWlENXV6ZFZqQ2Q4TjBWakg0NmN6QlVraEHSAaQBQVVfeXFMTXFONVBLWmdjRTNubWRZUjJTcEtrWkgxeVRJMVh0Z0h3U1QxcG44SndNZ2lxZkxOVlUwZ1p0amRPaTJiZTdzMGhRTm9VQW05R1cwMWFlRWd4LXBUM0lWTGpuRmhCcUlod1FKSnFBWHlsckdyM0UwR3dhY19RWDVqakh4UkN1cUZsdTgwZGhsdlNHaU8zTUZjY3Nsd0FvRmRFeHI5dmI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Futures Traders Selling Aggressively, Will ETH Price Drop Further? - CoinGape",
        "content": "Amid the broader cryptocurrency market correction, the Ethereum (ETH) price has faced significant selling pressure, with its price dropping 3.5% to $3,550. Additionally, Ethereum’s daily trading volume has surged by 84%, reaching $14.8 billion.\n\nEthereum Futures Traders Sell Aggressively\n\nWith Ethereum’s price struggling to surpass the $4,000 mark, traders might want to focus on the behavior of futures market participants, as per the CryptoQuant report. The chart below displays the 7-day moving average of the Taker Buy Sell Ratio, which measures the relative aggressiveness of buyers versus sellers. A value above one indicates buyer dominance, while a value below one indicates aggressive selling.\n\nadvertisement\n\nAs shown in the chart, the ratio has failed to rise above one and has been declining sharply in recent days. This trend suggests that most futures traders have been selling Ethereum aggressively, either for speculative purposes or to realize profits. This significant drop in the metric is a bearish signal, indicating that the current downward retracement could continue if this trend persists.\n\nOn the other hand, Santiment’s Network Realized Profit/Loss (NPL) suggests that holders are selling at significant profits, while steep dips indicate holders realizing losses, potentially signaling panic sell-offs and investor capitulation.\n\nFor ETH, the NPL indicator spiked dramatically from 36.69 million on June 10 to 1.06 billion on June 11. This positive trend indicates that holders are selling at substantial profits, hinting at the formation of local tops.\n\nUncertainty Surrounding Spot Ether ETF Approval\n\nAnalysts believe that ETH is failing to catch the bullish momentum as there’s no clarity on how long it would take for the SEC to approve the S-1 filings. Despite the Ethereum investment inflows hitting record last week, investors aren’t sure whether this shall continue further.\n\nHowever, even if the U.S. Securities and Exchange Commission (SEC) approves filings from BlackRock, Fidelity, VanEck, and other firms this week, investors worry that the current market conditions are not conducive to demand for Ethereum ETFs.\n\nFor the Ethereum price, there’s a notable support zone, comprising the 100-day moving average at $3,430 and the 0.5 Fibonacci retracement level at $3,419.\n\nIt will be interesting to see whether the Ethereum whale accumulation continues or not going ahead. Additionally, macroeconomic concerns are showing further signs of stress.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFB4T0pHTjJsbmpQX1pEdXhUNUstR0lvWG5aS1BDaVViNGY2bjdlcmR0cVVIR2Z5clJMNmlxc3poQzFFR1lCa2ZiT2FBQVQ2XzhadndwbXFTQ2U0eG51Q0V2Y0M1Q2czV1VVb1ItX1REVVppTllxdzB5TFZZS3NlNEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum a Good Investment in 2024? - VanEck",
        "content": "Welcome to VanEck\n\nVanEck is a global investment manager with offices around the world. To help you find content that is suitable for your investment needs, please select your country and investor type.\n\nSelect Your Country / Region Austria Belgium Denmark Finland France Germany Ireland Italy Liechtenstein Luxembourg Netherlands Norway Poland Portugal Spain Sweden Switzerland United Kingdom Netherlands Select Investor Type Individual Investor Professional Investor Select Investor Type"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQNFJnVFVQRGdPb2NiTG5fU2JqUEVhX3RQTXpwRWpyRE1aanJZVmJ6b2gtY0ZRRFBHazVUOThnWmVYM0tMQS0zV0NiRmJhVWJ1Umx3anNMX1JFOTNHblo1SXFYSWhRT3pOT0U0Szlkamw0WlpEb3I3cEtxbzBySV82SjYzMU1OTjVSc0lBNXVLR196Vzc5dmdkbl9VYVRBa2RNOEJDYg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Ethereum in demand as investors buy the dip By Investing.com - Investing.com",
        "content": "Investing.com - Twelve cryptocurrency wallets purchased 156,733 from Coinbase (NASDAQ: ) in the past few hours, valued at approximately $574 million. This transaction was completed at an average price of $3,664 per Ethereum.\n\nHowever, despite these purchases, Ethereum's price is struggling amid corrections that have hit the crypto market in general.\n\nIf you're looking for an opportunity to invest in crypto companies' stocks amid the recent market movements, Investing Pro provides you with the necessary tools to make informed investment decisions. Despite the challenges Ethereum faces after the massive purchase of 156,733 units worth nearly $574 million, there is still optimism for price increases due to the supply on exchanges dropping to a level not seen in seven years. Subscribe now and get an additional discount by using the code SAPRO2. Click here to subscribe.\n\nWill Ethereum's price drop by 7%?\n\nAccording to data from the analysis platform Spot On Chain, 11 out of the 12 cryptocurrency wallets withdrew about 13,059 Ethereum. Notably, one of the wallets – 0xdfa, withdrew a slightly higher amount, 13,084 Ethereum.\n\nMeanwhile, the supply of Ethereum on cryptocurrency exchanges has significantly decreased, reaching its lowest level in seven years, as reported by blockchain data from Glassnode. Lark Davis, an experienced crypto investor, highlighted this trend.\n\n\"The supply of Ethereum on exchanges is at its lowest level in 7 years, and as a result, the price of Ethereum could rise significantly.\"\n\nAt the same time, the crypto community is abuzz with the recent approval from the U.S. Securities and Exchange Commission (SEC) for Ethereum ETFs. This development is a crucial advancement for the cryptocurrency market, opening the door for significant potential investments, reflecting the early success seen with ETFs.\n\nMeanwhile, prominent crypto researcher Bobby Banzai predicts monthly inflows of $569 million into Ethereum ETFs. His predictions are based on the performance of international ETFs and futures data from the Chicago Mercantile Exchange.\n\nDespite these positive developments and market optimism, the immediate impact on Ethereum's price has been unfavorable. Following these large purchases, Ethereum's price has dropped by 4.91% in the last 24 hours and is currently trading around $3,494.18. Spot On Chain attributed this to the possibility that the transactions from new wallets could be part of over-the-counter (OTC) deals, which do not directly affect the market price. The data analysis platform's forecast indicates cautious short-term expectations for Ethereum, predicting a potential 7% correction from the current market price.\n\nNevertheless, Ethereum faced challenges this Tuesday, with the digital currency market undergoing a price correction. If this downward trend continues, Ethereum's next support level could be at $3,302.\n\nIn the last 24 hours, has dropped by about 3%, has fallen around 7%, and has decreased by approximately 7%."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxONzg5ZmZsRVdTZk14V2ZFRFpiUWdTNWg2azNVMVQ5M3B3OGJHS3VYb1FYN1BYUVhNb045NWM1ZU85T0xNRGVXWUdNWTVpcWpURUt2SlpHdDZLNDU5eWQtWFR3NmxENVZoTWtDdVBhT1E3WVo1Z0E4QnEyQ0h2eVBqbGdPSHpSY04wMnF5aFFZOE52SE0xdmk2Qk05VUF4X0otQnVMbUN3cmM4dHpiREZWbjVlQzZ0STN1SFB5aHFGdkFidm5WdUh1V2V3RWc4UWQyb3dkVnFFVjBzTnhCbEp0NGZ6S0J1OEdrb2pmMHVnUznSAfYBQVVfeXFMTmVtY2xPdnFodXhsbjVSTzBnUUQzZmRtZFE1Q044bFVEVlpWWW1SM2c3enZWdnNyM0g2dUNZRVFMSGFSR2VVblJMWTc0MGg3eHdZRFlDOWdTRnZ3ZkJfOS11Z2pzTmstU25NNTdkRUpmYVRjblBib0NsblRETHExVU1oc2VtakhjaWtMM2ZhS2lZZ1gyUWstaDU5TkpEb0FiTkd6YWM1QVBmdHhzMGlkY3NsZHdPX2Q3RUtsY240cE1XNDZibW9ESGEwRG01aDhmX2U4ZEpTc3prMDVSLUZFNXRISXhRRVQzTjd5STBKUWJac3RsVGRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ecosystem sees impressive Q1 earnings, issuers plan to market ETH as the ‘ultimate app store’ - FXStreet",
        "content": "Ethereum ecosystem generated more revenue in Q1 than Etsy, Robinhood or Reddit.\n\nIssuers plan to market Ethereum as a 'producing tech stock' and the 'ultimate app store’.\n\nEthereum could see a bullish reversal in the coming days.\n\nEthereum's (ETH) price is down 1% on Monday as its exchange supply hit record lows following growth in global ETH ETFs' inflows. Meanwhile, issuers plan to market Ethereum as the 'ultimate app store’.\n\nDaily digest market movers: Low exchange supply, high ETF inflows, ‘ultimate app store’\n\nEthereum has recorded several amazing feats in the past few days despite its recent price decline. Here are the latest ETH market movers:\n\nAccording to Glassnode data, only 10.5% of the total ETH supply was left on exchanges as of June 8. Coupled with the declining exchange supply, data from IntoTheBlock shows that large ETH holders (addresses with >10K ETH) recorded a net inflow of 267K ETH on Thursday, the highest daily accumulation since March. This shows that investors are becoming increasingly bullish on ETH, potentially because of the expectation of spot ETH ETFs.\n\nAlso read: Ethereum's price suffers slight decline amid Hong Kong's plan to allow staking in ETH ETFs\n\nRecent Bitwise research revealed that crypto protocols on Ethereum generated more revenue than Robinhood, Reddit, Yelp and Etsy in Q1 2024. \"These applications are a testament to the resilience, creativity, and vision of the global crypto industry,\" said Bitwise.\n\n\n\nGlobal Ethereum ETFs witnessed about $69 million in inflows — their highest inflow since March. Inflows across ETH ETFs will likely continue to rise as investors expect spot ETH ETFs to begin trading in the US in the coming weeks.\n\n\n\nHigh inflows follow predictions from Bitfinex’s Head of Derivatives, Jag Kooner, that spot Ethereum ETFs could attract around 10-20% of flows witnessed in spot Bitcoin ETFs.\n\nHe built his predictions around the historical flows seen in Gold ETFs after they launched in 2004 and how it paved the way for subsequent flows in Silver ETF launches in 2006. Bloomberg analyst Eric Balchunas has previously shared a similar analysis comparing ETFs of Bitcoin to those of Gold and Ethereum to Silver.\n\nAlso read: Ethereum ecosystem active users spike 55% in Q1, 2x ETH ETF records impressive volume\n\nMeanwhile, executives of different issuers, including Van Eck, 21Shares and Franklin Templeton, deliberated on the potential demand for Ethereum ETFs in a recent panel session moderated by Eric Balchunas. According to Balchunas, the executives plan to \"position it (Ethereum) as being like a 'producing tech stock', 'ultimate app store', very different pitch than BTC.\"\n\nETH technical analysis: Ethereum to see a potential bullish reversal\n\nEthereum is trading around $3,661 on Monday after the US Nonfarm Payrolls (NFP) data on Friday cooled signs of any potential breakout above the $3,900 resistance. The NFP news briefly sent ETH below the $3,618 support before a slight recovery. ETH liquidations sit at $9.47 million, with the majority coming from long liquidations worth $6.99 million.\n\nETH/USDT 4-hour chart\n\nAccording to data from Laevitas.ch, the ETH futures premium dropped from around the 15% mark to 13% on Monday — its lowest level since the SEC's position response toward spot ETH ETFs — signaling dwindling investor interest. The futures premium stays around 5% to 10% in neutral market conditions.\n\nRead more: Ethereum open interest surges by 50%, SEC Chair says ETH ETF launch will take more time\n\nETH Open Interest (OI) also declined from $16.97 billion on June 6 to $16.37 billion on Monday, a $600 million decrease. However, considering prices declined faster than OI, investors may still be confident of a bullish reversal, indicating the bearish move could be temporary.\n\nAs a result, ETH will likely sustain a horizontal move slightly tilted toward an upward movement. The $3,900 resistance is the key price level for ETH to overcome before any significant breakout. A sustained move below the $3,618 support will invalidate the bullish thesis."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPMklFNW85TG5wRUZpOThaZzV5Z2w3TXVTRXVTRi1fR3g3eUtIR09QNHV3VTJNNnJNazUzZDlRSFZ2WGNzUEhET3I1dVJjSFRjcHk3VVd2MVo1NVVHMk5pOHRqVFNibFlSdGhkWDZpVDJjOGpidUxvVF9JaWhvLWR0SDJXTTBGMjZ2a3hndElxWXg1Z9IBlwFBVV95cUxQSkI0dTMxcjFrbjMtd2dDR1JIQW5nV09HUDluR05YdERoaFI1SUkwNkNhLWl1azN5MDJtcG9wVnpoeUlLNlFjNjFMeXdYVFRpVHVwODh4TFRfRVNNdEc1VFd1cHhvZ1NYVHM3NVdxZW9RNFNTU2V2OXBoT1ZQX0NxTUxMbVdudENReHJPbVY4bjdJNkdtc1VN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Emerges as Crypto Darling After SEC’s Spot ETF Nod - CryptoPotato",
        "content": "Ethereum witnessed its strongest week in terms of capital inflow since March, with total inflows amounting to $69 million over the past week, as per the latest stats by CoinShares. The latest influx can be attributed to the surprise decision by the US Securities and Exchange (SEC) to allow spot Ether ETFs.\n\nAs a result, Ethereum’s YTD inflows surged to almost $81 million.\n\nThe improvement in investment products based on Ethereum had a significant impact on other digital asset products, attracting a staggering $2 billion. This subsequently resulted in the recent 5-week streak of inflows to $4.3 billion.\n\nBitcoin Still King with $1.97B Weekly Inflow\n\nEthereum products may have overshadowed Bitcoin for the past few weeks, but the latter remained the main attraction, with weekly inflows of $1.97 billion. On the other hand, short-Bitcoin investments experienced outflows for the third consecutive week, recording $5.3 million.\n\nAltcoins also saw a minor uptick in activity. Investment products based on Solana, Litecoin, and Chainlink witnessed $0.7 million in weekly inflows each. Meanwhile, XRP and Fantom stood out with inflows of $1.4 million and $1.2 million over the past week.\n\nTrading volumes in exchange-traded products (ETPs) soared to almost $13 billion for the week, representing a 55% increase from the previous week. According to the latest edition of CoinShares’ Digital Asset Fund Flows Weekly Report, inflows were observed across almost all providers, coupled with a continued deceleration in outflows from established players.\n\nThis turnaround in sentiment is believed to be a direct response to weaker-than-expected macroeconomic data in the United States, which has brought forward expectations for monetary policy rate cuts. Positive price movements led to a rise in total assets under management (AuM), surpassing the $100 billion mark for the first time since March of this year.\n\nUS Leads $2B Global Crypto Inflow\n\nRegionally, the US experienced the highest inflows last week, registering $1.98 billion. In fact, CoinShares found that the first day of the week marked the third-largest daily inflow ever recorded. The iShares Bitcoin ETF now comfortably exceeds the incumbent Grayscale, with $21 billion in assets under management.\n\nHong Kong, Canada, and Switzerland followed suit with inflows of $26.1 million, $12.7 million, and $10.6 million, respectively, whereas Brazil, Germany, and Australia settled with $9.5 million, $2.5 million, and $1.7 million in inflows, respectively. Sweden, on the other hand, recorded a weekly outflow of $9.2 million."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOQ2xRVVVBRjRtU2lMLWlzLU1adWVTYmItTnJPTnpWLTU2SG0zR1Q3WnE2U2I0UURud2dmaWlMVUdjVkdIUWV4Zm9TRllkalJ3cDlkcDVpcXFNLVlfeklCMnMzMzNOX2pUNjNRaDY4TldmWXlicW9IS2hPZVRETkdvMm5LenRObXdLeXJRY3pJNkpmbmtWSDY1eDUzbEs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "News on Ethereum ETFs: the SEC has added the ProShares one - The Cryptonomist",
        "content": "Among the news from yesterday, the SEC added ProShares’ request to those that should be definitively approved for the issuance of spot Ethereum ETFs.\n\nIn May, it had approved eight more, but evidently, the one from ProShares had not yet arrived.\n\nThe fact is that, despite having already approved the requests, the process to reach the final approval of all the documentation is not yet complete, and it is assumed that it will not be before July, or at most the end of June, so in fact there is still time to submit new applications.\n\nSEC news: The approval of ProShares’ Ethereum ETF\n\nThe document published yesterday by the SEC reveals that NYSE Arca has proposed a rule change to list and trade shares of the ProShares Ethereum ETF.\n\nThe fund will be simply called ProShares Ethereum ETF, and for now it does not yet have a ticker.\n\nNow the SEC will allow time to submit public comments on this request until the end of the month, and then it will have 45 days to approve, disapprove, or extend the request.\n\nIt is however very likely that the final decision will come along with all the others, just as it happened both in May and January, when in a single day the SEC approved all the requests for the issuance of a spot Bitcoin ETF on the US exchanges.\n\nSo now there are nine requests that should be approved in July, and since for this ProShares request there is time until the end of June to submit comments, it seems likely that the block approval cannot happen before July.\n\nThe approval process\n\nSpecifically, what the SEC approved en bloc in May are the requests to be able to issue an Ethereum spot ETF on the US exchanges submitted by eight companies with the 19b-4 form.\n\nThis is actually just the first step, because to reach the final approval it is necessary for the SEC to also approve the S-1 form.\n\nCurrently, not all eight applicant companies have already submitted this final S-1 form, although at least one (BlackRock) has already done so.\n\nCertainly, it has not yet been presented by the ninth applicant, namely ProShares.\n\nThe approval of the S-1 form constitutes the definitive green light, after which the shares of the ETFs can effectively land on the stock exchange.\n\nIn January, when the S-1 forms of the spot Bitcoin ETFs were approved, the actual landing on the stock exchange took place the day after, because everything was already ready.\n\nThe same thing could happen for those on Ethereum, given that for several weeks now the issuing companies have been preparing for the actual launch.\n\nMoreover, although the SEC will most likely approve the S-1 forms all together, it is not certain that the ETFs will be listed on the same day, so there is a bit of competition among the different issuers to be among the first to have the opportunity to launch the actual trades on the stock exchange.\n\nThe successo\n\nThe spot Bitcoin ETFs launched in January on the US exchanges have had great success from the very beginning.\n\nIt should be noted, however, that in the first weeks the Grayscale ETF took advantage of this to liquidate many BTC, given that previously it was a fund traded only OTC that could not easily liquidate the underlying and that over the years had accumulated as many as 620,000 BTC.\n\nIt is hypothesized that something similar could happen this time as well, given that one of the ETFs is precisely the Grayscale Ethereum Trust which holds more than 10.7 billion dollars of ETH.\n\nThe Grayscale Bitcoin Trust has gone from 28.5 billion dollars to 19.2, and since it is hypothesized that Ethereum ETFs could attract capital equal to about a quarter or a fifth compared to those of Bitcoin, the risk that the current 10.7 billion is too much exists.\n\nTherefore, after the actual stock market debut, it will be necessary to distinguish between daily trading volumes, which could be significant, overall capital inflows or outflows on all new ETFs, and Grayscale liquidations.\n\nIn light of this, although in the case of high trading volumes this launch can immediately be defined as a success, it will be necessary to wait for the situation to stabilize before being able to issue a definitive judgment.\n\nAs for Bitcoin, it was evident from the beginning that the new ETFs were a success, but it took a few weeks before this success could start to have positive effects on the price of BTC.\n\nIt is not a coincidence that the price of ETH is not growing in these days of anticipation, probably also because in reality a drop in its price is expected after the actual landing on the stock exchange of its new ETFs."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOYllHNHV1bElfYXVpdGl6RVY3TUZBbGF6ZmFSemx0MkVpWFVNSWpJbjJRMVhvYV9WN25JcXdaMU83T2ZWTE9KTDBRdXd5c1R2RUtJblRFdF8tRk1LelNDNE5sTUE0ZWNobVF3amtVTnJTc1RfZXp1Tm1feEJNRnozTTdQbnZhbklIWU82d3VkaEpfS25sZU91cGhMM0JLRFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Are Democrats Pivoting on Crypto? - New York Magazine",
        "content": "Neither Gary Gensler nor Elizabeth Warren is a fan of crypto. Photo: Chip Somodevilla/Getty Images\n\nOn a warm evening in late September 2023, Mike Novogratz, the billionaire hedge funder turned crypto investor, walked into a restaurant in Washington, D.C. In town from New York, the CEO of Galaxy Digital had spent the day on Capitol Hill visiting with Congress as part of a contingent of crypto entrepreneurs — most of them young people of color — organized by industry giant Coinbase to send a message to Democrats at a moment when crypto was increasingly seen as a Republican cause. Some key lawmakers hadn’t even shown up to the meetings. “I’m a Democrat, and it’s incredibly frustrating that they don’t see crypto as progressive,” Novogratz, an outspoken progressive who has donated millions of dollars to the party, including to Joe Biden in 2020, told me.\n\nOne Democrat was causing more frustration than any other: Gary Gensler, the chair of the Securities and Exchange Commission. He had spent the bulk of his tenure in the Biden administration attacking crypto, rejecting the need for new industry regulations, suing or threatening a wide swath of crypto companies, and blocking new products like crypto ETFs. And much of the party seemed to be taking their cues from him.\n\n“Gensler is becoming a real problem for our industry,” lamented Novogratz of his former Goldman Sachs colleague. “Part of me wants to take him by the neck and crack it. And I probably would, but I don’t want to get blood on my nice suit.” He gestured to his cream-colored attire.\n\nNow, nine months later, many elected Democrats have done a legislative version of what Novogratz had in mind and offered a meaningful (if partial and hardly unanimous) rebuke of Gensler and the faction of the party — led by Senator Elizabeth Warren — that has been fiercely anti-crypto. In May, the Senate voted 60-38, including 11 Democrats and independent Kyrsten Sinema, to roll back an SEC accounting rule for digital assets, defying a veto threat by President Biden. (The bill would have allowed financial institutions to hold crypto on behalf of customers without having to account for it on their balance sheets, treating it the same way as traditional assets.) Chuck Schumer voted for it, an unusual move by the Democrat and Senate majority leader in that he effectively bucked the will of his party’s leader. So did Senators Cory Booker, Kirsten Gillibrand, and Ron Wyden. Then, a week later, 71 Democrats, including former Speaker Nancy Pelosi, helped pass the Financial Innovation and Technology for the 21st Century Act, or FIT21, in the House, against the opposition of Gensler’s SEC and the White House — a historic event in that it was the first successful vote for a bill that sets out to regulate cryptocurrency at all. Both measures were actively supported by crypto-industry lobbying groups. Late in the evening on the last Friday in May, Biden followed through on vetoing the Senate measure, but the parallel actions by both houses of Congress on two separate pieces of legislation unmistakably signified the moment when the Democrats ceased to be a straightforwardly anti-crypto party.\n\n“In terms of the public policy, Gary Gensler is just wrong about this,” Congressman Wiley Nickel, a North Carolina Democrat who co-sponsored the House bill, told me. He hoped the vote (regardless of the bill’s fate in the Senate) would signal that many Democrats do not share the beliefs of Gensler and Warren. “If Biden allowed Gary Gensler to be the only voice on this, he definitely would lose a significant number of votes,” Nickel added. “If the Democratic Party were the party opposed to web3, to blockchain and crypto, we would only lose votes.”\n\nThen on May 23, another surprise twist complicated the picture even more. After initially signaling that it would block a slate of new financial products (called ETFs, or exchange-traded funds) that would allow average investors a much easier route to purchase ethereum, the second-largest cryptocurrency, the SEC suddenly — and, to many observers, shockingly — flipped and approved eight of them, including one from Novogratz’s company. “The sense is that the tone from the SEC has just changed literally overnight,” Emilie Choi, the president and COO of Coinbase, said at a conference just before the approval. “Probably the administration sensing some panic, I guess.”\n\nThere were signs that in the weeks leading up to these developments, Democrats had indeed begun to panic about the political implications of being pegged as hostile to crypto. Probably not coincidentally, this occurred after Donald Trump announced that his campaign would accept donations in crypto and that he would “build a crypto army moving the campaign to victory on November 5th!” At a campaign event for holders of Trump’s NFTs at Mar-a-Lago in May, the former president called up Ryan Selkis, an influential crypto entrepreneur who had previously voted for Biden, to speak at the podium, and Selkis threw his weight behind Trump.\n\nWell…\n\n\n\nI didn’t expect to share that I was in Mar-a-Lago tonight, but President Trump spoke very highly about crypto and then…invited me and @MihailoBjelic on stage to say a few words.\n\n\n\nFight for crypto.\n\n\n\nSupport President Trump. pic.twitter.com/bPAnvFlxMp — Ryan Selkis (d/acc) 🇺🇸 (@twobitidiot) May 9, 2024\n\n“All of a sudden, the Democrats in crypto, the tenor of their conversation on the Hill and their friends in the White House, changed. It went from ‘Guys, you really should pay attention to this’ to ‘Oh my God, we’re going to lose,’” says a person close to the industry. “You’ve listened to Gary Gensler and Elizabeth Warren for so long, and now we’re backed into a corner.” Warren, of course, has been a chief enemy of crypto for years, making her belief that the industry is primarily a scam a core part of her platform. In a campaign ad last year, she included the Politico headline “Elizabeth Warren Is Building an Anti-Crypto Army.”\n\nPressure had been building on Democrats to extend an olive branch to crypto supporters for months. A Coinbase-backed pro-crypto super-PAC called FairShake, which has raised nearly $100 million this election cycle, helped defeat Katie Porter in the California Senate primary in March, running attack ads against her for being an ally of Warren’s. Recent polls showed that 20 percent of registered voters have owned crypto, amounting to some 35 million Americans, disproportionately made up of young Black men — an important cohort to Democrats. “That’s a very sizable group, and a lot of them are single-issue voters,” says Nickel. “And they were being organized, and real money, material money, was going into it,” says a veteran Democratic strategist.\n\n“This is one of those issues that there’s no one really against it. You’re not going to pick up any new votes for being against crypto,” says the strategist. “There’s only upside politically and policywise to be for it, and only downside politically and policywise to be against it.”\n\nThe crypto landscape has also changed recently. While many in Washington had believed — or hoped — crypto would simply die and disappear after the collapse of FTX and the incarceration of Sam Bankman-Fried, the opposite proved true: Bitcoin recently traded at all-time highs thanks in part to new bitcoin ETFs, approved by Gensler’s SEC in January, that made the cryptocurrency more accessible to regular Americans. Yet the SEC and Congress had yet to lay out a regulatory path for the industry to operate legally, nor had they enacted much in the way of practical protections for consumers. Frustration was growing among Democrats that they had fumbled the issue in a way that might even cost them a meaningful number of votes in 2024. “The approach that both Gary Gensler and Elizabeth Warren have advocated, refusing to regulate the technology on the grounds that that will be the best way to kill the technology, no longer makes any sense — it’s a failed policy,” says a person who has worked in prior Democratic administrations. “Based on our polling, there are millions of voters who are going to vote against Joe Biden on the basis of Gary Gensler’s approach on this issue. With democracy on the line, that’s just a phenomenally irresponsible approach to take.”\n\nWhile Congressional Democrats were reluctant to admit that Trump’s pivot from a not particularly crypto-friendly first term had played a role in how they got a higher-than-expected number of their peers to vote for legislation favored by the crypto industry, Washington lobbyists and crypto advocates said it seemed to break the dam. “The shift is due to a long-term engagement effort by industry with congressional Democrats. The landslide is due to one person: President Trump,” Selkis told me. “The president broke Elizabeth Warren’s evil spell over the Democrats in the Senate, House, and White House.”\n\nWhether the White House will adopt a friendlier crypto stance before the election is still something of a mystery. There are signs that a shift is in progress, though. Notably, Biden did not threaten to veto the House legislation the way he did the Senate measure, saying instead that while he opposed it, he was “eager to work with Congress to ensure a comprehensive and balanced regulatory framework for digital assets.” (Justin Slaughter, the policy director for Paradigm, a crypto VC firm that has been one of the most active industry players in Washington, called it “the most positive statement by this or any White House on crypto, ever.”)\n\nThis is the most positive statement by this or any White House on crypto, ever.\n\n\n\nThe key phrase is “The Administration is eager to work with Congress to ensure a comprehensive and balanced regulatory framework for digital assets” & also states importance of developing them in US. https://t.co/zrG6X8Hzjy — Justin Slaughter (@JBSDC) May 22, 2024\n\nBiden’s late-Friday veto of the Senate bill followed a flurry of efforts by Democrats in Congress to talk him out of it, including coming up with alternative paths to give Biden an out without going back on his word. Nickel, for one, told me he hoped Gensler would just withdraw the rule altogether. There is significant skepticism within the party about whether Biden’s action was the right move. With its anti-crypto tenor, the veto amounts to “political malpractice,” says the Democratic strategist, using a term I heard from other Democrats about the White House’s crypto approach. “I do think the White House, sooner rather than later, is going to make the decision that they don’t want Gary Gensler to potentially impact their ability to win the election. And he has, full stop — he has. Millions of crypto voters are going to vote up or down on this.”\n\nBiden just lost the crypto vote.\n\n\n\nWhat a stupid, stupid mistake. pic.twitter.com/4pk6nTczTl — Avichal - Electric ϟ Capital (@avichal) May 31, 2024\n\nEven for pro-crypto Democratic voters, though, flipping pro-Trump on this single issue is a huge leap. “There’s a lot of soul-searching happening in the industry, and it is quite complicated for a lot of folks who grew up voting Democrat to think on some level, Why does this guy that I voted for, and this party that I voted for, want to put my industry out of business?” says the person close to the crypto industry. “I’ve seen colleagues wrestle with this.”"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPZ3dZc3FnaUN1d1RYdU9LSkFPeHpVZE5pODNwWVBCR2thUktpamp2LVZ6SzRzS1Z6N3JKNV9adjFQdElsd2xpcWQ5MDRVZnBabWR4Rk9yeDBpcVVYVHFsRUlHM2ltY21rUFIxb3k5MDF0U0JXdDl3enFNaDRkTWJqVkk4SGctTVVrc3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Crypto Market on Fire: Bitcoin's Breakout, Ethereum's Growth, and Furrever Token's Promising Launch - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY , June 10, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency market is experiencing a fiery surge as Bitcoin, Ethereum, and the newly introduced Furrever Token make significant strides. This trifecta of digital assets is creating a buzz among investors, each offering unique opportunities and showcasing promising growth trajectories.\n\nBitcoin's Breakout: A Bullish Run\n\nBitcoin, the leading cryptocurrency by market capitalization, is once again in the spotlight with a remarkable breakout. Recent activities have seen Bitcoin reclaim and stabilize around the $69,000 mark, driven by substantial whale activity. High-net-worth investors have opened massive long positions, indicating strong confidence in Bitcoin's potential for further gains. This bullish sentiment is underpinned by record-high open interest and funding rates, suggesting that the market is poised for continued upward movement.\n\nHistorical data shows that Bitcoin often experiences significant price appreciation following such bullish patterns, making it an attractive option for both new and seasoned investors. As Bitcoin continues to lead the market, its influence on the broader cryptocurrency ecosystem remains unparalleled, driving momentum across various digital assets.\n\nEthereum's Growth: Innovation and Expansion\n\nEthereum, the second-largest cryptocurrency by market cap, is also witnessing impressive growth. Known for its robust smart contract capabilities and a vast ecosystem of decentralized applications (dApps), Ethereum continues to innovate and expand. The recent approval of Ethereum ETFs has further fueled optimism, attracting institutional investors and enhancing market stability.\n\nEthereum's transition to Ethereum 2.0, aimed at improving scalability and reducing energy consumption, is a significant milestone. This upgrade is expected to enhance the network's performance and security, making Ethereum an even more attractive platform for developers and users. The increased adoption of Ethereum-based DeFi applications and NFTs (non-fungible tokens) further cements its position as a leader in the blockchain space.\n\n\n\n\n\nFurrever Token: A Whimsical Revolution in Crypto\n\nAmidst the excitement surrounding Bitcoin and Ethereum, Furrever Token (FURR) is carving out its own unique niche. Unlike traditional cryptocurrencies, Furrever Token infuses the crypto world with a playful and heart-warming twist. Centered around adorable cat imagery, Furrever Token aims to create an engaging and fun ecosystem that appeals to both crypto enthusiasts and cat lovers alike.\n\nStory continues\n\nA Delightful Concept\n\nFurrever Token stands out with its focus on cuteness and community. The platform features cat-themed stickers, emojis, and visuals that enhance user interaction and foster a sense of camaraderie among holders. This whimsical approach not only differentiates Furrever Token from other digital assets but also creates a loyal and enthusiastic user base.\n\nRobust Tokenomics and Community Engagement\n\nThe tokenomics of Furrever Token are meticulously crafted to support its long-term vision. With a total supply of 9 billion tokens, the distribution includes 65% available during the presale, 25% allocated for decentralized exchanges (DEXs), and 10% reserved for the team, locked for a year to ensure project stability and trust. This thoughtful allocation aims to balance initial accessibility with sustained growth potential.\n\nCommunity involvement is at the heart of Furrever Token. By empowering early adopters as moderators, the project fosters organic growth and meaningful engagement. This strategy has already attracted nearly 4,000 active members on Telegram, demonstrating the strong interest and participation in the Furrever ecosystem.\n\nPromising Presale and Future Prospects\n\nFurrever Token has raised over $1.3 million and is in the ninth stage of its presale, targeting a total of $1.9 million. The token’s upcoming launch on PancakeSwap offers up to 15X returns for early investors, creating significant buzz and FOMO (fear of missing out) within the crypto community. With a current price of $0.000732, FURR presents an attractive opportunity for those looking to invest early in a unique and promising project.\n\nEnsuring Security and Trust\n\nSecurity and transparency are paramount for Furrever Token. The project's smart contract has been audited by Securi Lab, providing an additional layer of assurance for investors. While the team remains anonymous—a common practice in the crypto world—they have implemented measures such as locking their tokens for a year to build trust and demonstrate commitment to the project's success.\n\nConclusion\n\nAs Bitcoin and Ethereum continue to lead the charge in the cryptocurrency market with their impressive breakouts and sustained growth, Furrever Token is set to be the next big thing with its unique and whimsical approach. With strong tokenomics, community involvement, and a promising presale performance, Furrever Token offers a refreshing and potentially lucrative opportunity for investors. The combined momentum of these digital assets underscores the dynamic and exciting nature of the crypto market. For more information, visit Furrever Token's official website.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE1qVWwwUkh1ZVpzRUh5bHVMRk5kSWllU2VnTXVBREdfRmtnZENQa0dIa0RYVi1xakppdmJvdlY4QVBaaU1MUGRUcGJlY2hfU19Rd0ZNOW1LVXZ1aVltb0NxZFczTkh4YUN3RjVQbGVTTTFnaElabW9Vcnlpb29BUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "“Bitcoin’s Next Move Could Be $100,000, But This Is Still Altcoin Season”: Analysts Predict Ethereum and BlockDAG Network Takeover - Yahoo Finance",
        "content": "BlockDAG Network\n\nLondon, UK, June 11, 2024 (GLOBE NEWSWIRE) -- Analysts are offering a variety of predictions for Bitcoin's future price movements, reflecting a range of optimism influenced by upcoming events and historical trends. However, the broader cryptocurrency market indicates a burgeoning altcoin season, where altcoins, particularly those involved in AI and decentralized finance (DeFi) like BlockDAG Network and Ethereum, might outshine Bitcoin in the short and longer term.\n\n\n\n\n\nThe Bitcoin Trend to $100,000\n\n\n\nOne of the most influential factors in Bitcoin price predictions is the recent Bitcoin halving event, occurred in April 2024. This event, which occurs roughly every four years, cuts the reward for mining Bitcoin in half, effectively reducing the supply of new Bitcoin entering the market. Historically, Bitcoin halvings have been followed by significant price increases. For example, post-halving price surges have been observed in past cycles, leading some analysts to forecast that Bitcoin could reach new all-time highs of $100,000 now two months after the 2024 event.\n\nDan Tapiero, a prominent crypto analyst, predicts that Bitcoin could hit $100,000 by late 2024 or early 2025. Tapiero cites the halving event and the increasing adoption of blockchain technologies by both countries and companies as key factors driving this potential rise. Similarly, Geoff Kendrick from Standard Chartered Bank also believes Bitcoin could test the $100,000 mark next year, driven by banking sector turmoil, the halving event, and the end of the Federal Reserve's rate hikes.\n\nBeyond these optimistic forecasts, other analysts provide a more nuanced view. For instance, projections for Bitcoin's 2024 price range from a low of around $27,341 to a high of $118,102, reflecting the cryptocurrency's inherent volatility. This wide range highlights the unpredictable nature of Bitcoin's market behavior, influenced by various macroeconomic factors, regulatory changes, and shifts in investor sentiment.\n\nLooking further ahead, some predictions are even more bullish. By 2030, Bitcoin's price is anticipated to reach between $149,316 and $265,318, suggesting a potential increase of over 850% from its current levels. These long-term projections are often based on the assumption that institutional interest and mainstream adoption will continue to grow like it has done since 2009, providing an even stronger foundation for Bitcoin's value appreciation.\n\nAltcoins: Ethereum and BlockDAG Network Lead\n\n\n\nAnalysts point out that while Bitcoin may reach new highs, it lacks the explosive potential of many altcoins in the current market environment. The altcoin market shows substantial upside potential, driven by innovations in AI and blockchain technology. For instance, AI-focused cryptos like Bittensor, Fetch.ai, and Openfabric AI are gaining traction due to their novel applications in decentralized machine learning and AI-driven tasks.\n\nMoreover, Ethereum continues to be a critical player, with expectations of significant growth due to its extensive use in DeFi and other blockchain applications. Analysts suggest that Ethereum, along with BlockDAG Network , which offer scalable and efficient blockchain solutions, could lead the next phase of blockchain adoption.\n\nEthereum is poised to lead the altcoin season in 2024, according to several analysts and market experts. This potential leadership is attributed to various factors, including technological upgrades, regulatory developments, and the overall momentum in the cryptocurrency market.\n\nOne of the critical drivers for Ethereum's potential leadership is the upgrades to its network. The most notable of these is the EIP-4844 (proto-danksharding) upgrade, which took place in March 2024 and aimed to significantly reduce transaction fees and enhance scalability. This improvement is benefiting Ethereum's layer 2 (L2) networks like Polygon, Arbitrum, and Optimism, making Ethereum more efficient and attractive for users and developers.\n\nThe approval of Ethereum exchange-traded funds (ETFs) is another catalyst for Ethereum's rise. ETFs make it easier for institutional investors to invest in Ethereum without dealing with the complexities of direct cryptocurrency transactions. The recent approval of Ethereum ETFs in Hong Kong has already generated optimism in the market. There is also speculation about potential ETF approvals in the United States, which could further drive institutional adoption.\n\nMarket Dynamics and Historical Patterns\n\nHistorically, altcoin seasons follow significant events in the cryptocurrency market, such as Bitcoin halvings. Analysts like Michaël van de Poppe and Josh Olszewicz highlight that Bitcoin's recent performance often precedes a shift in investment towards altcoins. They suggest that Ethereum's underperformance relative to Bitcoin recently indicates a potential for a significant catch-up, especially as technological and regulatory developments come to fruition.\n\nCrypto analyst Ash Crypto has pointed out that Ethereum's current price action resembles the bullish breakout observed in 2020. If Ethereum follows a similar trajectory, it could reach new all-time highs overcoming the $4,000 mark and can catalyze a broader altcoin rally, potentially leading to a substantial increase in altcoin valuations.\n\nAt the same time, BlockDAG Network represents a significant advancement in blockchain technology, aiming to address some of the inherent limitations of traditional blockchain systems. Utilizing a Directed Acyclic Graph (DAG) structure, BlockDAG combines enhanced transaction speeds and security with high decentralization, creating a robust framework for the future of decentralized finance (DeFi) and crypto mining.\n\nBlockDAG has garnered significant attention and investment since its inception. It has raised substantial funds through its presale, highlighting strong investor confidence. For instance, the project has already raised over $50 million and is seeing daily inflows of $500,000 that has left analysts claiming it could lead the altcoin market together with Ethereum.\n\n\n\n\n\n\n\n\n\n\n\nAs market dynamics evolve, it is essential to recognize the distinct opportunities presented by different projects within the cryptocurrency landscape. Bitcoin's potential rise to $100,000 reflects its status as a digital store of value, while the altcoin market, especially with projects like Ethereum and BlockDAG Network, promises higher returns driven by technological advancements and new use cases. This diversification highlights the importance of a strategic approach to cryptocurrency investment, balancing between established assets like Bitcoin and emerging technologies within the altcoin space.\n\nRead About BlockDAG Presale:\n\nWebsite: https://blockdag.network\n\n\n\nPresale: https://purchase.blockdag.network\n\n\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\n\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Alan smith support(at)blockdag.network\n\n\n\n"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNVVltSWVfbjhYMnRBaF9ZSE9nQy0zWEdILTU4TVpzUnVlT01BbFhlVVNNWThmaWZQMVhNOWE2SlhUQmRvSGNuamdXcUUzVER1OW9icXhqR2EtYjBfeVo2ci0wRmN2QnIzdDVMZFRLQmRPdkNnSnFBOWlYTWJZYU8xVU9aMk12SGhtVkk2NUhiSWFHQUtmNWEyZ0Fsc1dKT3VrTWZDX2pR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "The price of Ethereum in Bitcoin is still falling, but not in USD - The Cryptonomist",
        "content": "In recent days in the crypto markets, an interesting dynamic is occurring regarding the price of Ethereum in Bitcoin and in USD.\n\nThe thing is curious especially because by the end of the month, or at the latest by the first week of July, the final listing of spot ETH ETFs in the USA is expected, but despite this at the moment Ethereum appears clearly subordinate to Bitcoin.\n\nThe price of Ethereum and Bitcoin in USD\n\nRegarding the price trend in USD in recent days, there is not much to say about either Ethereum or Bitcoin.\n\nAfter the sudden movement on Friday, when the price of BTC dropped almost abruptly from around $72,000 to around $69,000, over the weekend it did nothing but move sideways just above $69,000.\n\nAmong other things, the current level is perfectly in line with that of last Monday, so Friday did nothing but burn the gains accumulated during the week.\n\nIndeed, at the beginning of June it was below $68,000, so the current level should still be considered very good, being in fact only 6% lower than the historical maximum.\n\nA similar argument can also be made for Ethereum.\n\nThe current price is below $3,700, and it is in line with that of the last decade of May.\n\nCuriously, however, it is still at -25% from the absolute highs of 2021, but last week it had not risen much.\n\nAfter the boom of May 20, when the news of the possible imminent approval of the applications for the issuance of a spot ETH ETF in the USA came out, it rose only until the end of the month, then started June above $3,700 and in fact has been lateralizing until now.\n\nFriday had reached just above $3,800 before the drop that brought it back below $3,700.\n\nDuring the weekend, it did not move from this last level.\n\nThe dynamics of this morning\n\nThis morning, however, there was some small movement, although not significant.\n\nThe price of Bitcoin has moved from $69,700 to $69,200, as if it wanted to start a small bear trend, but once it reached this last level, it recorded a rebound that seems to have averted further declines, at least for now.\n\nThe price of Ethereum went from $3,715 to $3,655, but only to bounce back and return above $3,670.\n\nThese are dynamics that only serve to liven up the markets a bit, but they are not decisive in any way, not even in the short term.\n\nHowever, it cannot be ruled out that tomorrow or the day after tomorrow this period of lateralization may end, even if it is not yet clear in which direction it might go.\n\nThe Ethereum/Bitcoin ratio and the relationship with the price in USD\n\nThe only truly interesting dynamic is that of the relationship between Ethereum and Bitcoin.\n\nFirst of all, you can analyze the price trend of ETH expressed in BTC.\n\nAt the beginning of June, one ETH was worth about 56 thousandths of BTC. However, already on June 2, this price started to drop.\n\nIn particular, on June 3rd it had dropped to 54 and on June 5th to 53.\n\nAfter Friday’s drop, it ended up falling below 53 thousandths of BTC, so now it is still below.\n\nIt is worth noting that at the end of May it had also risen above 57 thousandths, so this is a decline that has been going on for more than two weeks now.\n\nConsidering instead the ratio between the market capitalization of BTC and that of ETH, today it has risen to 3.1, after being below 2.9 at the end of May.\n\nHowever, these are not very high values, given that before the news of the probable approval of spot ETH ETFs it was almost 3.6.\n\nWhat matters most at this moment is that from Friday’s drop this ratio has risen, albeit slightly, indicating that Bitcoin is holding up better than Ethereum in these days when financial markets seem a bit worried about the Fed’s restrictive monetary policy.\n\nThe dominance of Bitcoin\n\nThe picture for altcoins becomes even bleaker if we analyze the dominance of Bitcoin.\n\nAt the end of May, according to Trading View data, it had dropped to 53.7%, and since then it has started an almost constant rise.\n\nJune started above 54%, and last week it had already risen above 54.7%.\n\nThe most interesting thing, however, was the reaction to Friday’s drop, with Bitcoin’s dominance suddenly jumping from 54.6% to 55.5%, although it then fell to 54.9% over the weekend.\n\nThis morning, however, it rose again, returning to 55.5%, before slightly correcting to 55.4%.\n\nIf we take as a reference the 51.9% at the beginning of the year, it is evident how in this 2024 it is precisely Bitcoin that dominates the crypto markets, although there are occasionally some small exceptions.\n\nAmong other things, the maximum peak of the dominance of the year was 56.3%, which is not much higher than the current levels. This gives a good idea of the fact that altcoins as a whole are not going through a good moment at all. Just think that the current levels are similar to those of the second half of April 2021, that is, in the midst of a great bull run.\n\nIn summary, despite the fact that in theory the attention at this moment should be focused on Ethereum, it is still Bitcoin that dominates the crypto markets, with the altcoins that for now are limited to suffering while waiting for better times,"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQTlJkVGhvUDBldUgwTEtmNlExWGRRT0ZZLWxNeUR0TnE5dU9uYUdDMmFaaW5tcXhTQ3FNdWp4LUU2aGVaM1RmRVZZQnF3bDlkc05DbGpqcS1jRE9sV2ZaTzR4RWhIZl9rcy1vT0dMaTBkUVdtT1FXY3UyZUowbEZCZVhKc3JxNUVvUVc0Nk1CaThlUENLYWIydTVJdGxCMm_SAaQBQVVfeXFMTmswN056eDdub2ttMzJtR3BKLWVINzg1YWhEX09NdnA5ZmlkSDBzbUUwcC15WGdoWHFRaUlNN0ktSG1RbHZ0RGhnaVVjT2N3S0laX1ZTSlJmXzcwWTJyV3ZUQ0VoekpOT2J3LUJVZHljbS1VYmhNN2R3YXJXSkNtYjBnaENoQ0FxY0R4WHRjeVluZzVrQW51ZF9FdS1MQU1WZlZyc0s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Mega-Whale Addresses Surge In Three Weeks, 83% ETH Price Rally Likely - CoinGape",
        "content": "After facing some selling pressure last week, the Ethereum (ETH) price seems to be stabilizing around $3,700. On the other hand, the Ethereum on-chain indicators continue to show strength hinting at buying pressure on the upside.\n\nSurge in Ethereum Whale Addresses\n\nCrypto analyst Ali Martinez has highlighted a significant rise in the number of Ethereum addresses holding 10,000 or more ETH, which has increased by 3% over the past three weeks. This uptick signals a notable spike in buying pressure for Ethereum.\n\nadvertisement\n\nOn-chain data from Santiment reveals that enthusiasm for Ethereum surged following the SEC’s approval of Ethereum ETFs. Despite this initial excitement, social sentiment has now stabilized, which is considered an ideal state ahead of the commencement of trading for these new Ethereum financial products.\n\nETH Price Action Ahead\n\nOn the other hand, some market analysts believe that the ETH price is forming chart patterns similar to that in 2021, after which it rallied by a staggering 83%. In a recent analysis, noted analyst Caled Frazen drew attention to the striking similarities between Ethereum’s current price action and its performance in 2021.\n\nWhile cautioning against expecting an exact repetition of historical patterns (“history rhymes, but it doesn’t repeat”), Frazen emphasized the significance of the observed parallels. Frazen noted that in the 2021 cycle, the “red zone” served as a crucial level. Although it wasn’t flawless support, it proved significant enough. Following a failed breakdown, Ethereum witnessed a remarkable rally of +83% within 50 days.\n\nBased on the Coinglass chart depicted above, Ethereum (ETH) open interest witnessed a decline from $16.97 billion recorded on June 6 to reach $16.35 billion as of the latest update on June 9, marking a decrease of $620 million.\n\nDespite ETH’s price experiencing a 7.38% dip from its weekly peak on June 6, the reduction in open interest was comparatively moderate, contracting by only 3.65%—almost half of the price decline.\n\nA deceleration in open interest reduction relative to price decline amid a market downturn can potentially be interpreted as a bullish recovery signal for two significant reasons.\n\nIn the event that Ethereum ($ETH) breaches the support threshold at $3650, there’s a possibility of a downturn toward $3152, marking the previous Fair Value Gap (FVG).\n\nShould Ethereum manage to hold steady at the $3650 mark, it could signal a potential upward trajectory towards $4000. Furthermore, surpassing the resistance barrier at $4000 might instigate a robust bullish surge targeting the $6000-$7000 range.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOV2RZbkszMzFNN3VqZVMxNzk4V3R4M080Ynp1U0Q3U0EzZTZ1ZV84eV9CQU03X0xtUm9PbkthZEROYUxIeGU1aE8wNGN1enp5YWRrLWhaN2JMY2JRZlEwODRyb1VqR2wwcXh5Y0FRZWdmSFhFVEltZkVvczY2dWFtUXlsZjJvcHpDcmNBa3JQcDFIakhoMVowUnFtYUzSAaIBQVVfeXFMUFgtakZFZlBRTDVGaDg3SFJlYnRIRTA1OG9WYUdDSEp1SkpOYUh5Uy16RFc5V0JBcmJNTTNtSTdmZzFIc3o5RHZBVURCTFBua2t5V1ljaFd4YlNXZHUyeHAyb2lLeUVXQmZhNXh5SHZOYmo0Rjg1SjEwcFVxaEVVRmh1UXI1R3pWdnYyN05YcU1vbFIzcjUxdnVuUHZZTWNiRWNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Legendary Trader Peter Brandt Issues Crucial Warning as Ethereum Price Eyes Dump - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nLegendary trader Peter Brandt has recently updated his outlook on the Ethereum (ETH) price chart, highlighting a worrying pattern. Thus, Brandt has identified a controversial head-and-shoulders top formation, which is typically seen as a bearish indicator, suggesting that the price may soon fall.\n\nAdvertisement\n\nThis pattern usually signals a reversal from a bullish trend to a bearish one, often resulting in a significant drop in price.\n\nDespite identifying this bearish pattern, Brandt stressed that he is not short on cryptocurrencies. This is particularly interesting given that just a month ago, in early May, Brandt announced that he was officially short on Ethereum futures.\n\nAdvertisement\n\nHowever, at that time, he made it clear that he refrains from shorting the spot market due to counterparty risk and always uses stop-loss orders to manage his risk.\n\nThis is# an arguable head and shoulders top. I do NOT short cryptos pic.twitter.com/gjC0OPoJm3 — Peter Brandt (@PeterLBrandt) June 11, 2024\n\nBrandt's current stance seems to be a shift from his previous position. While he is now signaling a potential bearish trend, the price of ETH has continued to rise. Currently trading at $3,500, the altcoin has seen a significant increase from its price a month ago, when it was trading at less than $2,900.\n\nThe head and shoulders top pattern highlighted by Brandt could be a critical warning for traders and investors. If the pattern holds true, the price of Ethereum could face a downturn in the near future. However, the market's recent behavior suggests a complex scenario, where traditional chart patterns and market sentiment are not entirely in tune."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPaWRGVzNENUptOWJKSHpNbFhpbU8wOERnZGZyemllTC1tX29Ra3ZuS3pmYkFLM1ZpM2dJRkVkZFY5ZmR6TVBlWS05RlZOcE1weGYySmdObGhPaFdpbWNFMGp1aFluUmltNVBLQzFsU3IzYS11bFBTdWtuQXpKU0RYZTFfZXc4bXNhNlEtbjJCLW5vblAwbnNyVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "2 Cryptocurrencies to Buy Whether Bitcoin Hits Another All-Time High or Not - The Motley Fool",
        "content": "Ethereum and Solana are set to soar higher in 2024, even if Bitcoin continues to trade sideways.\n\nAfter Bitcoin hit a new all-time high of $73,750 in mid-March, crypto investors were understandably excited about where it could head next. The crypto seemed poised to skyrocket past the $100,000 level this year. But Bitcoin continues to trade right around the $70,000 mark, leaving some crypto investors searching for potential alternatives.\n\nIf you're one of those investors, there are two cryptocurrencies to put on your radar screen right now: Ethereum (ETH 0.14%) and Solana (SOL 0.76%). Both will potentially soar higher in 2024, whether or not Bitcoin goes along for the ride.\n\nEthereum\n\nThe big catalyst for Ethereum right now is the recent approval of eight new spot Ethereum exchange-traded funds (ETFs). They're set to start trading soon, and when they do, it could lead to a huge influx of new investor money into Ethereum.\n\nWhile this influx of money isn't likely to be anywhere close to the amount of money that flooded into the new spot Bitcoin ETFs, it's nonetheless expected to be significant. For example, JPMorgan Chase predicts that the influx of new money into spot Ethereum ETFs could be as high as $3 billion over the next six months. And K33 Research, an independent crypto research firm, thinks the number could be as high as $4 billion.\n\nThe thought of so much new money flowing into Ethereum, which is already up 70% for the year, has some investors giddy. For example, some think Ethereum might outperform Bitcoin over the next six months, simply due to the potential impact of the ETF boom. When you add in the fact that Ethereum continues to roll out new tech upgrades to its core blockchain, there's growing cause for optimism.\n\nSolana\n\nLike Ethereum, Solana is up 70% for the year. This comes on the back of a monster year in 2023 when it skyrocketed more than 900%. While Solana's upward trajectory has cooled somewhat of late, there's still potential for an enormous move upward in the second half of the year.\n\nOnce you take a quick look at Solana's core metrics, you'll understand why. Just about every key metric has experienced tremendous growth over the past 12 months. The number of users is way up, transaction activity is way up, and the size of the Solana blockchain ecosystem continues to grow by leaps and bounds.\n\nIn no small part, this has to do with soaring consumer adoption. Solana has become the go-to blockchain for buying, selling, and launching meme coins. Even big-time celebrities (well, OK, B-list and C-list celebrities) are getting in on the action, with rappers, reality stars, and musicians launching meme coins of their own on Solana. Since these celebrities have millions of followers on social media, it's possible to argue that Solana is getting a free marketing blitz directed at its core user demographic (young, tech-savvy, and with plenty of disposable income to spend on crypto).\n\nThe good news is that all of this is uncorrelated with what's happening on the Bitcoin blockchain, so Solana can soar higher, even if Bitcoin continues to trade sideways.\n\nThe Layer 1 investment thesis\n\nEthereum and Solana share one key trait in common: They're both Layer 1 blockchains. This means that they're the fundamental building blocks of the blockchain world. When it comes to any key blockchain niche -- such as non-fungible tokens (NFTs), decentralized finance (DeFi), blockchain gaming, or decentralized Web3 applications -- the core starting point is always the Layer 1.\n\nThat's what has me excited about Ethereum and Solana as potential Bitcoin alternatives. If you buy into the general notion that a crypto bull market rally should help to inject new life into every single niche of the blockchain and crypto world, then Ethereum and Solana should be among the biggest beneficiaries.\n\nA rising tide lifts all boats, and Ethereum and Solana are two of the biggest boats out there. Even if you're on the sidelines about Bitcoin, it might be time to take a closer look at Ethereum or Solana."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxQcGRqbGFGSS1lYUh4M0JYSmFBWGFfNTFRT3Y2bE5lalE1NDFxTXVHSWJvcE82QXVnLU5ESGZhTXRMcDdVNExTM21RZkwtZVdieE42RlpaNkFUN2dYaVdlZzhNejVIam8zMEd0X2pEdGlMU2kzUTNwTURpbjMxUVA4YmIzQnBteDRaNkk3d2h0X2xtYnd6MlN2RTFyTm9sNEtWMl9hN2lTdko0RFpnZjBKMlFxYWM1ZFhxT0NyUTVyMmliRFBEWUo3dkJleUVqeUUyaVFMTFozLWJwbENqOUlSTFA5VmswcHPSAewBQVVfeXFMUHVHZzh5STNDUWJ5X3h2SUUwV0k4TzVuR2lsMGRGb3M4UU1RZEctR3VRdGc2TGx6OVVoYTMwdzhSZHRxSS0zWXJFdlRvd0tmYnlIeVlFdC1lV2NlY3FKQ1Q2WWJITDJhM1AxZGpubU1CX2U2V0JSbkhPN1FEVnRyTXRyMzZkY010bFF2V0dxM2t1b1R1cU9YcE9QOFpiWk9HQjFQMXZsdnZ3dmZMakQ1Q0lnSi1KaU94X0Rjd2ZIVDQycGEzeXYzRlZGZDMwYk92ZDZ0LXRaZm1FeGpCbVViNEZsQmRiRVBrWlVsa0U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC likely to take markets on a rollercoaster - FXStreet",
        "content": "Most recent article: Top 3 Price Prediction Bitcoin, Ethereum, Ripple – Bitcoin could see high volatility due to US CPI\n\nBitcoin price broke out of a symmetrical triangle pattern and remains above throwback support.\n\nEthereum price is likely to have a pullback into its major support area between $3,400 and $3,200.\n\nRipple price holds the daily support level at $0.467.\n\nBitcoin (BTC) price is trading with a bullish bias following a successful breakout and retest of a symmetrical triangle pattern. Ripple (XRP) also follows in BTC’s footsteps as it continues to hold on to its major support level. Ethereum (ETH) price, on the other hand, shows signs of an impending correction.\n\nBitcoin price eyes for a 7% rally\n\nBitcoin price broke out of the symmetrical triangle pattern on June 4, which was formed by connecting the three lower highs and three higher lows, formed since May 19 using trend lines. The breakout, however, was rejected by the weekly resistance around the $71,280 level.\n\nCurrently, BTC finds support around the upper boundary of the symmetrical triangle pattern around the $68,500 level.\n\nIf this support holds, then BTC could rally 7% to its all-time high of $73,777.\n\nBTC/USDT 1-day chart\n\nHowever, if BTC breaks below the lower boundary of the triangle and closes below $67,147, the bullish thesis could be invalidated, leading to an 8% crash to its daily support level of $61,293.\n\nEthereum price looks promising\n\nEthereum price broke above a falling wedge pattern on the daily chart on May 20, leading to a 21% rally. However, it is encountering resistance from a bearish order block established on March 12, which ranges from $3,980 to $4,093, posing a challenge for ETH bulls.\n\nInvestors considering buying ETH should watch the following levels:\n\nThe 50% retracement level at $3,424, calculated from the swing high of $3,984 on May 27 to the swing low of $2,864 on May 13. The 61.8% Fibonacci retracement level at $3,279 from the same movement.\n\nIf the conditions mentioned above play out, then the Ethereum price could revisit its previous resistance level at $4,000.\n\nETH/USDT 1-day chart\n\nConversely, if Ethereum's daily candlestick closes below the $2,864 level, it would create a lower low and indicate a disruption in the market structure. This development would negate the previously discussed bullish outlook and could potentially lead to an additional 9% decline, reaching the prior support level of $2,600.\n\nRipple price finds support on a major level\n\nRipple price bounces off from its daily support level of around $0.467 on Friday.\n\nIf the daily support at $0.467 support holds, XRP could move to the upside and retest its previous resistance level at $0.571.\n\nXRP/USDT 1-day chart\n\nHowever, if the Ripple daily candlestick closes below $0.467, then XRP could crash an additional 10% to its previous support at $0.419."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQeFY4OUtOZUh4WTlWV1JOSGt0TzZkaVpRcTNjR3JYcEVtbXVkejVhTVo0cnFpYjhBUmtCVWJPM3RaNjc1QkNGS1U3SExwTV9yMHVmYTVVWUN0cTBzbm9OZ0xycXlncVQzTHNGd3IwZ09FT192cjl0elA5dXVYcF9RTXpIdHpHT2Rl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Litecoin (LTC) Beats Bitcoin & Ethereum in Network Activity - Watcher Guru",
        "content": "In a surprising development for the cryptocurrency, Litecoin (LTC) has surpassed both Bitcoin (BTC) and Ethereum (ETH) in network activity. Indeed, the asset has surpassed the two leading cryptocurrencies, as LTC saw a 110% surge in daily active addresses over the last week, according to Santiment.\n\nThe development was the first time that Litecoin was able to surpass the two prominent digital assets. Moreover, its daily active address figures reached heights of 728,000, surpassing BTCs 593,000 and 419,000 by Ethereum. Subsequently, all eyes are on LTCs potential to orchestrate an epic rally from the metric.\n\nSource: Blockchain Reporter\n\nAlso Read: CFTC Calls Ethereum & Litecoin Commodities in KuCoin Lawsuit\n\nLTC Rally Incoming? Litecoin Could Build Off its Victory Over BTC and ETH\n\nThe digital asset market has been at the center of the finance sector, with the midpoint of 2024 fast approaching. Bitcoin had carried its early momentum to an all-time high in March, reaching $73,000. Moreover, Ethereum joined the leading cryptocurrency as the second asset to receive spot ETF approval this year.\n\nHowever, both of those cryptocurrencies were surpassed in one key metric by an unlikely competitor. Indeed, Litecoin (LTC) has recently beaten both Bitcoin and Ethereum in network activity. Specifically, the asset saw a massive surge in daily active addressees that exceeded both the leading assets.\n\nSource: Santiment\n\nAlso Read: Litecoin Transactions Surpass 180 Million in 2023 as Adoption Accelerates\n\nMoreover, the market is now observing how LTC could respond to the metric increase. An influx of daily active addresses shows a growing consumer base, which should impact the price. However, the asset has seen its value decrease over the last several weeks.\n\nLitecoin is currently in the midst of a 4% decline over the last month, according to CoinMarketCap. Trading at $77.74 currently, there is hope that it could surge in the coming days. Over the past 24 hours, its volume has surged almost 60%, which is an interesting part of the growing equation."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNUEgyeXZ6SEk4aEZFaVJreTNtWDczWUNFTFZfVnExcktPblZqVldGbWZpS0sxRy1udFF2RFZ3a3hjUFJCYUF3bE9ZVmVyODZFcTYwTzR0SUNpVlZzX2lsU3dyb3RwLXFfeXhUeXJuLUYxbmRRTU9wb0liMHpjVEVlS3M3QzdVNEhVeTlrTVJ4ZDE0VGxmVlFpYUpKWkxORDVsRGtQY29vUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Crypto: Investors are accumulating Ethereum ahead of the next price surge - Cointribune EN",
        "content": "Mon 10 Jun 2024 ▪ 3 min read ▪ by Fenelon L.\n\nAs the price of Ethereum oscillates around a crucial resistance level, savvy investors are seizing this last opportunity to accumulate the crypto before a potential surge in its price. Indicators converge to suggest that a powerful bullish rally could start soon.\n\nA crucial resistance level to overcome\n\nThe crypto market frequently offers exceptional opportunities to the most astute investors. This is precisely what is currently unfolding with Ethereum (ETH).\n\nAlthough the crypto is currently experiencing a pullback of around 2%, this correction phase could represent the last window to position oneself at a lower cost before a potential major rebound, according to the latest analyses.\n\nIndeed, if Ethereum’s price manages to break through the key resistance around $3,700, it could trigger a powerful bullish rally, according to renowned analyst Milkybull. The expert even points out that this price zone could constitute the last opportunity to strengthen one’s position in ETH at relatively low levels during the current bullish cycle.\n\nTechnical indicators seem to corroborate this scenario with signals increasingly supporting a strong latent buying pressure. Supporting this thesis, the Coinbase Premium indicator for Ethereum shows a sustained bearish trend, suggesting low selling pressure among American investors, often considered a reliable barometer of upcoming trends.\n\nEthereum positions itself for a major rally\n\nDriven by a series of favorable factors in 2024, Ethereum has already recorded an impressive gain of nearly 67% since the beginning of the year.\n\nIn the wake of these major developments, many analysts now expect a dizzying potential appreciation for Ethereum. A target of $6,000 by early July is frequently mentioned, fueling investor enthusiasm for this crypto.\n\nCryptoQuant data has also corroborated this underlying bullish dynamic. Between May 23 and June 2, investors withdrew no less than 797,000 ETH, representing a colossal value of $3.02 billion, from the reserves of major centralized exchange platforms. A strong signal indicating that crypto investors are in a phase of massive accumulation.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPMmlBcngwcHJFNjRmbmFYVDZrR2ZPSkNvTWVlMFZuSXJlaHliaEpFNVItd3dZdFdac2hJR3NoeEE0YTJSNDJBSm1Genl6WS1XZHlraGJhNWI2TWpFWE5va19mSlBaSTdmT1VBb2lHQWozS1hqa2RnX21PRlM0ZFBQeHhsb09xZ0hyWjZCRDhIcEFRMHVkX1VkcUhvVUR1QlU40gGmAUFVX3lxTFBoRVVGX3BiVnh1cEJ1a2hoazhRbWJXYVBzaXNaRGJwekRpdFRNZnVxT29XeEkyQVFsQkhENWZ2WGdtQkZsYkUxREo1eXFjZ2JvNm1IVkkxT1ZuYWRMcThONGlReDlrUG5MdGJSYmlZLXA4MnlXdmQ0ektvZXg0U09ETG9QZ2xGMjYyZWF4TzlhNjZhZXpEOURIeHFva1pVWE03eVU4YWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Prediction: Can Ethereum Price Pump Ahead Of FOMC? - CoinGape",
        "content": "Ethereum price broke out downward from a consolidation zone, invalidating the previous bullish flag. Meanwhile, the markets eagerly await the Federal Open Market Committee (FOMC) meeting on Wednesday to know whether interest rates will get cut or spike higher.\n\nThe price of Ethereum was $3,448 during American trading hours on Tuesday, a 6% drop in the last 24 hours and a further 9.7% decrease in 7 days, as per CoinGecko data.\n\nadvertisement\n\nETH/USD Price Prediction: Bears Take Hold of the Market, These Are the Support Levels to Watch\n\nETH price was previously trending in a consolidation zone, part of a larger bull flag market structure. Bull flags are bullish, and the markets expected the pattern to resolve upwards. However, the Ethereum price experienced great downward pressure in the early morning hours of June 11.\n\nThe price of Ethereum broke below the range, invalidating the bull flag on the 4-hour timeframe. Nevertheless, on the daily timeframe, ETH price action is still trending above the 50-day and 200-day simple moving averages (SMA), albeit very close.\n\nIf bears persist, ETH price may drop further and find support at the 50-day SMA, which also coincides with the 0.5 Fibonacci retracement level. This will put the price of ETH around $3,400. Further below, key support areas exist around $3,200 and $2,900.\n\nOn the flip side, if the bulls overpower the bears, the ETH price may rally and test the lower boundary of the range around $3,650. If ETH continues to rise, it may re-enter the range and move sideways between $3,700 and $3,950 before breaking to the upside and heading towards $4,200. Currently, $3,650 is the strongest resistance level for Ethereum price action.\n\nWhy is the Ethereum Price Crashing?\n\nThe drop in Ethereum price comes a day ahead of the FOMC meeting and also coincided with Bitcoin’s drop in price. The crypto community thinks that the recent market panic is connected to the FOMC outcome.\n\nThe panic is of FOMC and PPI outcome coming on wed and thurs. My guess is we will pump back strong after FOMC and PPI numbers🙏🙏#Bitcoin #altcoins — ₿ SatMaxx ₿ (@vinee202) June 11, 2024\n\nMarket analysts from Bankrate forecast that the FOMC will leave interest rates at a 23-year high in the upcoming meeting. However, they also estimate that there will be three or fewer rate cuts before the end of 2024.\n\nMeanwhile, Ethereum fundamentals remain strong, as the mainnet continues to dominate in fees over Layer 2s, generating 20X more fees than the top L2s combined.\n\nBottom Line\n\nInvestors remain alert for Wednesday and Thursday since FOMC and PPI data may influence the next direction of Ethereum price and the general markets. Ethereum’s positive fundamentals may help sustain the price if FOMC results and comments turn out negative for the markets\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQb1dKQ2JXTEY1UE9tbWpNYWVnOG1TNTdQRW02bS1iSmprdEVHNE96Yk5Oa19YMVNwWktkU09mTzl6MHVNN0NfNlh6NnEyZEQ1a2lXLWQzU3Z5TGE1M0FZRmstSmtEMGpqbmw4Z1FPX0doWXl0aXJ5b0lpNDBycmNaWWsxdnFFMXN3TE5tOVNDVFRrSEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "World’s Largest Bank Calls Bitcoin Gold and Ethereum ‘Digital Oil’ - Watcher Guru",
        "content": "In what is certainly a positive note for the entire industry, the world’s largest bank, the Industrial and Commercial Bank of China (ICBC), has recently applauded the evolution of both Bitcoin and Ethereum. In a recently published report, the lender praised cryptocurrencies for their importance in an ever-shifting financial landscape.\n\nSpecifically, the bank compared Bitcoin to gold while highlighting its rapid growth in a more digitized economy. Additionally, it called Ethereum “digital oil” while referencing the power of the ecosystem to power a host of Web3 applications and programs throughout the growing marketplace.\n\nJUST IN: 🇨🇳 World's largest bank, ICBC, says \"#Bitcoin retains the scarcity similar to gold.\" June 11, 2024\n\nAlso Read: BTC: Bitcoin Could Hit $100,000 in the Next 10 Days, Says Analyst\n\nICBC Praises Bitcoin and Ethereum for Rapid Growth and Evolution\n\nThere is no denying that the digital asset market has been a massive part of 2024 so far. With the midpoint fast approaching, there have already been two crypto-based spot ETFs approved by the US Securities and Exchange Commission (SEC). Moreover, the prominence of the asset class has surged in recent months.\n\nThat has seemingly caught the attention of the world’s largest bank, ICBC, which has recently applauded the evolution of both Bitcoin and Ethereum. Specifically, the world’s leading lender published a report that highlighted what makes these tokens so important and impressive. VanEck head of digital asset research Matthew Sigel went as far as to call the report “a love letter” to BTC and ETH.\n\nThe bank compared Bitcoin to gold, noting that the toke “retains a scarcity similar” to the metal. Throughout 2024, both gold and BTC have surged to all-time highs as they have dominated the investment sector.\n\nSource: Bitcoinist\n\nAlso Read: Cryptocurrency: 3 Coins To Buy Now Before Ethereum Hits $5,000\n\nAlternatively, they noted Ethereum is “digital oil” in its potential to power applications across Web 3. The bank highlighted how these two assets are growing and evolving to be better used within the market. Specifically, they reference market demand as leading BTC value as an asset to “consistently” strengthen.\n\nMoreover, they note Ethereum has a similar benefit, in that the asset “has been continually upgrading its technology” in varying areas. The report highlights security, scalability, and sustainability, as the most focused aspects that have yielded impressive returns as far as exposure and adoption.\n\nThese two tokens are currently leading the entire market. They have both received exchange-traded products this year and should continue to grow. This kind of reverence for their trajectory only showcases how mainstream institutions are beginning to value that growth."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQMVpSS0ZVcjFDb0JOSFZHOEZieWxBaWZneGJzMHp3QkZ1ZGV3Z1gxVUFnQllkaVZVM3NSdE03YXUxNU1pdUhLcEFDNWM1V05CVm5iSG85ekQ0TUNsRl9yakhtRFd1SjU5bHZzTDVZM0xQMHlyaVJueG5ucnBPRUdudUppbDlUb1HSAYwBQVVfeXFMUElDbm9jRGVtZ3dXYnhudEZxZVJWTjFYSm9VTGdXcUo5MDRJTXNLT2FNbm9xcFc5VUoxNW1MWE1tRnIwNnZOaE9fdGplX1c4QWZSMm9ETDBlRmdGb21ldFJmdDJocWwydGhRb3VGc05IQWYzbmNyT2NUSzhkNl9DbHlUTW5EaWlPXzc0cGs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum’s price dip signaling the start of a new rally? - AMBCrypto News",
        "content": "More whale addresses have accumulated ETH in the last few weeks.\n\nETH’s bull trend has continued to weaken with the price drop.\n\nEthereum [ETH], which has been moving closer to a bear trend over the past few days, has presented a buying opportunity for large investors.\n\nAccording to recent data, big wallets have acquired more Ethereum as the price declined, which is a bullish signal.\n\nWhale addresses scoop up Ethereum\n\nAMBCrypto’s analysis of some major Ethereum addresses revealed a slight increase starting from the end of the previous month. Specifically, wallets holding over 10,000 ETH showed growth beginning around the 19th of May.\n\nAt this point, the number of such wallets was approximately 952, and Ethereum was trading at around $3,074.\n\nThe number of wallets holding over 10,000 ETH grew from around 952 to approximately 980 as of this writing.\n\nDespite the ETH price increase to around $3,700, these addresses have continued accumulating more Ethereum.\n\nAdditionally, AMBCrypto’s look at the mega whale chart over the last 30 days revealed a noticeable development: the trend has flipped to the upside.\n\nThis indicated an increase in accumulation by most of the major wallets, reflecting heightened buying pressure.\n\nWith this move, it is just a matter of time before the price picks up—a trend that these addresses are betting on.\n\nMore Ethereum flows out of exchanges\n\nEthereum’s Netflow on CryptoQuant showed that it had been dominated by negative flows in the last few weeks. The chart indicated that the volume of outflows has consistently surpassed inflows in the new month.\n\nA look at the chart showed that since the beginning of the new month, more ETH has left exchanges than has flowed into them.\n\nThe analysis indicated that from the 1st of June to now, the negative flow volume was over $354 million, while the positive netflow volume was around $226 million.\n\nThis netflow trend, combined with the accumulation by major wallets, is a positive sign for ETH despite its recent price trend.\n\nETH moves closer to the neutral line\n\nAMBCrypto’s analysis of Ethereum on a daily timeframe showed that it has been trending in the $3,600 price range for the past three days.\n\nAs of this writing, it is trading at around $3,670, experiencing a decline of approximately 0.8%. ETH saw a slight gain in the previous trading session, but the recent decline has wiped this out.\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nEthereum’s Relative Strength Index (RSI) showed that it was above 52 as of this writing. However, the RSI is on a downward trend, indicating that a further price decline could push it below the neutral line.\n\nThis means that while the trend is currently bullish, it is weakening."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOaGwtOTQtNzhQcUxVa01wVGxxYUJuVFdaa0J4anhSRFhKODFLMGZBQ1VjRTRhWGNEY3N5SHNPTVlkZEY5dGthaDB6U1loNjd4elNvTWJ3c3hkZGVHOFpxWlp4RkQxYTBqaUhIUDF6ejE2T0Rud0k1dFFDM3B2UHN0c1hpcjZvd9IBiwFBVV95cUxNSnVkdTd2ejgzU0xDdEl1U0lBOFRMTXlaaXdCY1A3OWtwUnVpWE9QUUs3Z19GVjRpbXROTzdVQkE5cjREaFZXenBLWjAtZjdvSG5TWTN2WWktckNKUVFnVXR5YmdRUE5naHozU3ExNFVFQk5PUE1PTW5DMXktZU1UOG9TQ2xtdDg4Y2FJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Why a rise in Ethereum staking has not helped ETH’s price - AMBCrypto News",
        "content": "The amount of staked ETH has increased significantly over the past few weeks.\n\nETH’s price continued to move sideways.\n\nEthereum [ETH] has remained stagnant around the $3600 level for quite some time. But despite the sideways movement, optimism around the cryptocurrency has remained high.\n\nThis was indicated by the rising interest in ETH staking over the last few weeks.\n\nEthereum staking on the rise\n\nAccording to recent data, 32.5 million ETH had been staked on the network.\n\nEven though the number of stakers increased, which can typically drive up rewards, both the reward rate and inflation rate for staking ETH saw a decrease.\n\nThe reward rate refers to the annual percentage return a user gets for staking ETH. It’s essentially the interest a user earns to help secure the network.\n\nThe inflation rate, on the other hand, reflects how quickly the total supply of ETH increases. New ETH is created as staking rewards, and this contributes to inflation.\n\nA declining reward rate means a user will earn a bit less new ETH per staked token in the short term. However, a declining inflation rate suggests the total supply of ETH is growing at a slower pace.\n\nIn the long run, this could actually be a positive sign for the value of ETH. If demand for ETH stays strong while the supply grows slower, it could push the price of ETH up.\n\nAt press time, ETH was trading at $3,669.67. After surging past the $3,600 level after the ETF announcement, the price has moved between the $3,979 and $3,607 level.\n\nThis recent correction in ETH’s price could be attributed to profit-taking done by short term holders after the sudden uptick in price.\n\nThe RSI (Relative Strength Index) for ETH had declined significantly over the last few days, implying that the bullish momentum for ETH had slowed down.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nAdditionally, the CMF (Chaikin Money Flow) for ETH had also diminished, implying that money flowing into ETH had declined. If bearish sentiment prevails, ETH may retest the $3,607 levels before moving upwards.\n\nEthereum’s Network Growth also declined materially over the last few days. This implied that new addresses showing interest in ETH had fallen, which may cause problems for the altcoin in the long run."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPZFhkd0VsQkRBUHBPQVZlMHBuVVhMYThSS3ZjOEc2R2xVVUY5cUJYTXBTMmhEZGJ4SUl2NUxrMkRwYS1PNTUyZkpuNmRILWE4ZjhUOEZtQjNGeFVIaGdJaURET2g4VXJjY2JJSjNlRlVoNGdqYmo2Vi05ZHprQWdzbDNDM2p5TkdKYVHSAY8BQVVfeXFMUE80T1d6c3V2NVpNUTFVY0NHS2RCQzdZeG5jdTZfX1k0LTc2WVlSN3VuT1RNcnRzb1JVVDlXRGhpQ0wwRXR0S3VORnlxVzd1c0oxaFpDRkNpaHFvY3JQdFUyeGJDUGlHbmhvUDhZQXR2Sl9STUtxVUZBdjlpNkNWaWsxVW8tS0V3aG1wRGlCdk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum reserves hit 8-year low: Is a price explosion close? - AMBCrypto News",
        "content": "Ethereum reserves on exchanges are at an eight-year low, setting the stage for a price surge.\n\nCurrent bearish indicators suggest there might be room for further decline before a rebound.\n\nThe amount of Ethereum [ETH] held on exchanges has reached its lowest point in eight years. With the imminent launch of its spot ETFs, we could see a huge supply shock, and it might lead to a dramatic increase in Ethereum’s price.\n\nBut let’s check out what the data is telling us.\n\nEthereum ETFs to cause a stir?\n\nIf the spot ETFs garner the huge interest everyone expects, the initial rush to buy Ether could drive prices up rapidly, followed by possible corrections as the market adjusts to the new demand and supply dynamics.\n\nEthereum’s price is below both the 50-period and the 200-period moving averages, trending downward. This alignment generally indicates a bearish sentiment.\n\nThe RSI is around 43, which is below the neutral 50 mark but not yet in oversold territory (below 30).\n\nThis means the price could decline a little more before reaching oversold conditions, which often come right before a price rebound.\n\nA significant 89% of Ethereum holders are in profit at the current price, which is a strong indicator of a healthy market.\n\nWith 51% of Ethereum held by whales, there’s a huge concentration of Ethereum in the hands of a relatively small number of wallets.\n\nThere has been a large volume of transactions exceeding $100K, totaling $32.81 billion over the last seven days, highlighting massive institutional or large-scale investor activity. In other words, investors of all kinds are currently bullish on Ether.\n\nRecent downward trends in the MVRV ratio might suggest that Ethereum is entering a zone where it is less overvalued, aligning with a potentially more sustainable price level or even undervaluation.\n\nThis cooling-off could be a healthy market correction, providing a more stable foundation for the bull run.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAs it stands, if Ethereum can sustain above the recent support at $3,670, it might attempt to break the $3,733 resistance.\n\nA successful breach above this could push the price towards the next psychological barrier at $3,800."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOQ0ZORVFOUkQ3Z0NsYWdIQWhTZC01SndyeUlzeC13V3ZwYXZ2V2JVWGltbEtCU0dTS19zbXNsUTdqOVdQMFB3NFk3SnFORGpEMWV4R0UtcUZFNU4xMkhFNnhzdTZzTnpyTjZOU0t6RFp5Ykw3VGN4STZDenNIb2dsY2JUaFhmVFF40gGWAUFVX3lxTE54Y1h1N1B6V1pmbUVpWHM3M3FfYUM1djNFYnFDSEo1UzV5V2pmTURyUURsVUZwSmVSQ1lGWTdLVDJwQThKNWV1SEZxVW1SaTd1SmJmSUJnN0swV01RZ01uYTFuaUp3VmtJN2s3dE14ZGZaN21Xelo2WFdPZUZ4bGVPTzZGVGZ4dWxQUXBOWEVhVWxoZHotdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 10, 2024 - Analytics Insight",
        "content": "Specific comments from the leading personalities of the crypto industry, such as Hayden Adams, the founder and CEO of Uniswap Labs, recently fueled concerns regarding Ethereum transaction fees. Adams went on to say something that I considered shocking: users should not have to think about “gas fees,” which are the cost rendered for performing transactions within the Ethereum network. This statement has sparked controversy, especially regarding the ability of Ethereum to support stable high transaction fees, which is why measures to address the concern must be taken into consideration.\n\nAdams’ comments follow the Ethereum community being threatened by high charges on transactions. Recently, the artist Iggy Azalea spoke about gas fees, or reprocessors, wondering about their need and doubts about their usage. Even if Azalea’s assumptions about splitting may not be correct, her comment has raised concerns regarding the tendency to increase transaction fees and the impact the situation has on Ethereum users."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQTGVBYktQX1ZjWjdua3pSdVBRQUptb3FsNnB4azNXWUMwa3BXbHFFazc5QUYtRmZxUldjUFNDZlFGRjVmb3BDUXJSb0ZteWFHSWoyRU1YaE0wZkkxRk9LdmIzN2xXOEhCYkx5d3VOdUd4MUhnX01uZ3A5Tm81QVJROV9FUUhYVmc5bUFVUUhsZGhyXzZRd1dGNU81WlpiQ0hHWUlyYlZnYVhYZmZNbEdVeU5KU1FiLVFWY0RScw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Analyst Reveals Several Reasons Why Ethereum Could Reach a $150K Valuation per ETH - Crypto News Australia",
        "content": "Spot Ethereum ETFs in the US could drive ETH to new highs; analyst Adrian Zduńczyk disagrees it’s priced in.\n\nZduńczyk cites a US$154K ETH price target by 2030, with significant yearly growth and a solid user base supporting this forecast.\n\nHe advocates a 70% BTC and 30% ETH portfolio for optimal risk-adjusted returns.\n\nThe case of the Spot Ethereum exchange-traded funds (ETFs) possibly coming to the United States is a potential catalyst for ETH to reach new all-time highs. Or is the launch – which is expected to see Ether ETFs trade as early as July – already priced in?\n\nRelated: Fidelity International Introduces Instant Share Tokenisation on JPMorgan’s Onyx Blockchain\n\nCrypto analyst Adrian Zduńczyk, a Chartered Market Technician (CMT) with 651K followers on social platform X, doesn’t think so. Based on a VanEck analysis, @crypto_birb believes that ETH could be worth $154K (AU$233.5K) by 2030, with a base target of US$22K (AU$33.3K).\n\nVanEck’s target for ETH by 2030, source: Adrian Zduńczyk via X\n\nAccording to Zduńczyk and VanEck the optimal crypto portfolio is 70% in BTC and 30% in ETH – and they say adding 6% of crypto to the standard 60/40 portfolio will boost profits.\n\nAdvertisement\n\nVanEck Believes Huge Price Target Driven by US$66 Billion in Free Cash Flows\n\nSo how did the American investment manager come to that lofty price prediction?\n\nIt’s simply a “projection of Ethereum generating $66 billion in free cash flows by 2030 and applying a 33x valuation multiple” says Zduńczyk.\n\n2) Portfolio Boost: 6% Crypto Allocation\n\n\n\nAdding 6% crypto to a 60/40 portfolio boosts the Sharpe ratio, with a minor drawdown impact. Analysis of 169 sample portfolios showed that including 3% BTC and 3% ETH significantly improves the risk-adjusted returns. pic.twitter.com/UKyFhCs7iZ — Adrian Zduńczyk, CMT (@crypto_birb) June 8, 2024\n\nThe analyst explains that Ethereum benefits from a strong set of user metrics, with 20 million monthly active users generating US$3.4 billion (AU$5.2 billion) in yearly revenue.\n\nEthereum ecosystem daily active user growth, source: Artemis.XYZ\n\n71% of Network Revenue to Come from Finance By 2030\n\nAnnually, 0.4% of Ethereum’s total supply is burned, highlighting a deflationary trend in its economic model. The platform’s robust economic activity is further underscored by a settlement value of US$4tn (AU$6tn) and US$5.5tn (AU$8.3tn) in stablecoin transfers, reinforcing these growth figures, he added.\n\nBy 2030 it is expected that 71% of the network revenue will come from finance, based on a strong user base and transaction fees much lower than those of credit card processors and payment apps.\n\nOther bullish forces for ETH are the increasing importance of layer-2 networks and the potential of AI integration.\n\nFurther, Zduńczyk believes Ethereum will become a Sharpe Ratio leader. The Sharpe Ratio assesses an investment’s performance against a risk-free asset, adjusting for risk; a higher ratio indicates better risk-adjusted returns.\n\nThe analyst calculates that a portfolio consisting of 71.4% Bitcoin (BTC) and 28.6% Ethereum (ETH) yields a Sharpe ratio of 1.43. This indicates that this combination of BTC and ETH provides a favourable balance between expected return and volatility when compared to other potential combinations of these two cryptocurrencies.\n\nSharpe Ratio comparison BTC/ETH, source: @crypto_birb via TradingView\n\nRelated: Analyst Miles Deutscher Unveils 20X Portfolio Strategy for the Upcoming Bull Run\n\nFinal words of warning though, Zduńczyk says that 2030 is well past his “timeframe of interest” and in general long-term predictions are obviously fraught with uncertainty. He believes there will be a possibly prolonged bear market in 2026, which is why he will be looking to exit the market in 2025."
    }
]