[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNMHNYM29hZUNrN1dWLUMwWFR1MkpXX2xia3JzWXBLalE2QmYycjVFel9OaE9SZmx2QU9jM3JTcm5FMURCempQellFcFFsdWJNQkF2TjRfd3ZZb2haYnJFNVBaQVZXRGMyM2czLTJSTWd1eFpzUHBGbzh4cUF1Y3ZaTWtUOUVJZ0gxcmg5ZzViaGZVeFJHajdyTW51dF9PRkJBQlAtTzFZZGxaUTTSAbABQVVfeXFMT0g2UEhKamZmMnBOcW1KNmd0d29ZUmx5bERPS1NMN1VzQ01VbExVdl9ndkotMExmWlBwVWdiMHlLU1ZaX2lIcmNkOHMwY18tM1c0bTUxTVU2OW1WdVFvSDhoSVQxSXl0Q1VfVTM5b2xKUUdld0xXQmtoZGVCeFlqWmNlZ2dZNUpiSXVRVUR6ZTFSVVZKbEc4d2FzZGJYRHo1ME9HQ3VpLWN5Y0NOaUZ4QjY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Feb 2024 08:00:00 GMT",
        "title": "Charles Hoskinson Forecasts Cardano’s Triumph Over Ethereum with Upcoming Developments - ZyCrypto",
        "content": "Advertisement\n\nCharles Hoskinson, the founder of Cardano, has expressed confidence in the future of the network, underscoring its potential to surpass Ethereum in the realm of decentralized finance (DeFi) and blockchain innovation.\n\nSpeaking during a recent interview with Dan Gambardello, host of the Crypto Capital Venture YouTube channel, Hoskinson noted the remarkable growth of the Cardano ecosystem, especially in the face of challenging market conditions. He emphasized the community’s dedication and collaborative efforts in propelling Cardano forward.\n\nDespite initial scepticism labelling Cardano as a “ghost chain,” he stressed how the project had defied expectations, boasting over half a billion dollars in total value locked (TVL) during a bear market.\n\n“We’ve had overwhelming participation and constant growth and innovation,” said Hoskinson, highlighting the vibrant activity within the Cardano ecosystem, with numerous projects and transactions fueling its expansion.\n\nAddressing criticisms and comparisons to Ethereum, Hoskinson underscored Cardano’s steady progress and its distinct approach to scalability, governance, and innovation. He pointed out the misconceptions surrounding benchmarks like TVL and ADA price, emphasizing the significance of Cardano’s comprehensive roadmap and its focus on building a robust infrastructure.\n\nAdvertisement\n\n“We know how to scale, we know how to get fast finality, we know how to get partner chains in, we know how to get rollups in,” Hoskinson asserted, outlining Cardano’s strategic initiatives to address scalability and network efficiency.\n\nAccording to the pundit, a pivotal aspect of Cardano’s future success lies in its governance model and the utilization of its treasury funds. With nearly $750 million worth of ADA in the Cardano treasury, Hoskinson highlighted the community’s governance over these resources, enabling strategic investments in ecosystem growth and development.\n\nMoreover, Hoskinson emphasized Cardano’s collaborative approach and burgeoning partnerships with other blockchain projects. He also highlighted the interoperability and synergies fostered by Cardano’s Partner Chains framework, enabling seamless integration with other blockchain ecosystems.\n\nHoskinson expressed confidence in Cardano’s potential to become the dominant governance system in the crypto space, toppling networks such as Ethereum.\n\n“We’re getting recursion and rollups and that means all this stuff that’s happening in Ethereum not only works on Cardano works best on Cardano…so we will be probably one of the dominant zero knowledge layers thanks to all the work,” he added.\n\nIn light of recent developments like the intersect platform and advancements in scalability solutions, Hoskinson asserted that Cardano is poised for exponential growth. He encouraged a shift away from tribalism and adversarial dynamics within the crypto space, emphasizing the collective benefits of collaboration and innovation."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE12b3JoNzZKUmo3aUtpUkI2MWxRUVJRbEZ3aGh4VEhMejhxWDVvTzBfZWlZLTYtTENJeWotbmtENWpRZE01OHRFdTFmZ0VJNHZjZGJNRFFXdHNBbUtwVUhoV3JfUFVRYlZTVDdaeGNQY0nSAXZBVV95cUxPUHkzeUZUTDFjT0RnNWVlTmFqcUJicUJQa2xLNDMtR2NabDhPSGVaaDF5SzlvY3V3YUpnbGh2QTVxN1ZrR1VFYkQ4WW1QeEJzcm1vTWo2UlI1ZEd4NUJLZjNfMzRlNjhxd3F0QTNPOG1OY00ybEtB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum sets March 13 for Dencun upgrade - Forkast News",
        "content": "Ethereum developers have scheduled the “Dencun” upgrade for March 13.\n\nThe update, which follows the successful completion of the final testnet deployment, aims to enhance the Ethereum network’s scalability and efficiency by reducing costs for layer-2 transactions.\n\nThe Dencun upgrade is expected to introduce several key improvements, including the implementation of proto-danksharding, a precursor to full danksharding that will eventually allow for more transactions per second.\n\nThe significance of the Dencun upgrade lies in its potential to address current network congestion and high transaction costs, which have been longstanding issues for Ethereum users.\n\nBy improving throughput and reducing fees, Ethereum can maintain its competitive edge in the decentralized finance (DeFi) and non-fungible token (NFT) sectors, where it currently holds a dominant position.\n\nEthereum is the leader for NFT sales volume with over US$42 billion in all-time sales, according to CryptoSlam data.\n\nThe blockchain’s US$38 billion worth of assets locked in its decentralized applications represents almost 60% of the aggregate value of assets locked in the entire DeFi sector.\n\nEthereum’s transition to a proof-of-stake consensus model has been a complex and multi-phased process, with the Dencun upgrade representing the latest effort to optimize the network’s infrastructure."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTE5fX0xqMFJSX1BIUnZ6eEotVmxyMmdxRWQwcG5vcUw2dUp6dFl3YUNWWW91cW13N05OMEVGRDl0LUtSWU56QndHN1FwLUlBVi1ISE1UekN2Um0xc1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Algorand Vs. Ethereum – What’s the Difference? - Securities.io",
        "content": "You will be ready to develop a more comprehensive trading strategy once you learn the differences between Ethereum (ETH) and Algorand (ALGO). Both of these networks provide Dapp developers with a foundation upon which to create. While Ethereum pioneered in this sector, networks like Algorand have attempted to improve its blockchain design to create more scalability. Here's everything you need to know regarding Ethereum vs. Algorand.\n\nWhat is Algorand?\n\nAlgorand was built to help bridge the gap between centralized and decentralized finance. The protocol entered service in 2017 and immediately caught traders' attention for multiple reasons. For one, the network's developer was a Massachusetts Institute of Technology (MIT) professor and Turing award-winning computer scientist, Silvio Micali.\n\nThe protocol provides high-end scalability and flexibility to the market and saw its mainnet go live in 2019. It enables developers to create new Dapps that can leverage traditional financial applications and today's most advanced DeFi protocols. The developers believe this approach is needed to help drive large-scale adoption.\n\nWhat is Ethereum?\n\nEthereum has proven to be an innovative force in the market. The network was the first to introduce the concept of easy-to-program smart contracts in 2013. This revolutionized the crypto sector by allowing developers to leverage smart contracts when building apps.\n\nToday, Ethereum reigns supreme as the largest Dapp and DeFi ecosystem in the world. The network has helped drive investment in the sector via the introduction of the ERC-20 protocol. This token standard helped to drive the 2017 ICO (Initial Coin Offering) breakout. There are currently over 400,000 ERC-20 tokens in circulation. Notably, Ethereum itself held one of the largest ICOs of its time.\n\nWhat Problems Was Algorand Built to Alleviate?\n\nAlgorand tackles the issue of centralization head-on. The protocol was designed to provide open access to financial services on a global scale. The protocol leverages the decentralized nature of blockchain to improve transparency and democracy in the financial sector.\n\nThe system remains secure and scalable. Scalability concerns have long been an issue for crypto users. Before its migration to a PoS network, Ethereum in particular suffered from congestion that often resulted in higher gas fees for everyone. Algorand also leverages a PoS consensus mechanism to provide enhanced performance to users and remain valid. This structure enables anyone to secure passive returns.\n\nNew Developer Onboarding\n\nAnother problem that Algorand seeks to reduce is new developer onboarding. It's confusing to convert to an entirely decentralized system from a traditional protocol. Algorand helps to eliminate confusion by removing technical barriers. The system eliminates the need to learn any smart contract programming. Users can create NFTs and other digital assets with ease.\n\nWhat Problems Was Ethereum Built to Alleviate?\n\nEthereum was designed to provide more functionality to blockchain users. The network improves blockchain versatility compared to its competitor at the time Bitcoin. To accomplish this task, Vitalik Buterin, the founder of the platform, integrated a script-based PoW system.\n\nThe protocol has full DeFi support and is the largest DeFi ecosystem in the world. Notably, what Ethereum may currently lack in scalability is made up for in liquidity.\n\nHow Does Algorand Work?\n\nAlgorand is a layer 1 blockchain that provides secure p2p commerce between network users. The protocol operates as an open financial system that leverages the immutable nature of blockchain tech to improve usability. Today, Algorand has found use by both the enterprise and consumer sectors for various Dapps.\n\nAs part of its all-inclusive strategy, Algorand includes a variety of services. One of the main features of the network is the AlgoFi P2P lending protocol. This system enables users to secure returns in the form of interest payments on lent-out crypto. To participate, users provide liquidity to large interest-bearing lending pools.\n\nHow Does Ethereum Work?\n\nWhile Ethereum originally utilized a Proof-of-Work (PoW) mechanism known as the Ethash algorithm, it has since transitioned to become a Proof-of-Stake (PoS) network. This event, which occurred in 2022, was viewed as a major upgrade, often referred to as the launch of Ethereum 2.0. It marked Ethereum's shift towards greater energy efficiency, scalability, and security.\n\nValidators are now responsible for processing transactions and creating new blocks, requiring a stake of 32 ETH for participation or the option to join a staking pool. This transition signifies Ethereum's commitment to sustainability and long-term scalability improvements. As such, users can stake their Ethereum to become Validators. To become a validator on Ethereum, you need to stake 32 ETH. If you don’t have this much ETH, you can leverage mining pools to combine your tokens with others and split the rewards.\n\nHow to Buy Ethereum (ETH) and Algorand (ALGO)\n\nCurrently, Ethereum (ETH) and Algorand (ALGO) are each available for purchase on the following exchanges.\n\nUphold – This is one of the top exchanges for United States & UK residents that offers a wide range of cryptocurrencies. Germany & Netherlands are prohibited.\n\nUphold Disclaimer: Terms Apply. Cryptoassets are highly volatile. Your capital is at risk. Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment, and you should not expect to be protected if something goes wrong..\n\nKraken – Founded in 2011, Kraken is one of the most trusted names in the industry with over 9,000,000 users, and over $207 billion in quarterly trading volume.\n\nThe Kraken exchange offers trading access to over 190 countries including Australia, Canada, Europe, and is a top exchange for USA residents. (Excluding New York & Washington state).\n\nEthereum vs. Algorand – Smart Contract Networks Battle it Out\n\nWhen you look at Algorand (ALGO) and Ethereum (ETH) it's easy to see that they both have use-case scenarios. Algorand may be more advanced in terms of features but it lacks the liquidity of Ethereum. As such, both projects have the potential to continue to expand moving forward.\n\nTo learn more, make sure to visit our Investing in Algorand and Investing in Ethereum guides."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE1xX2Zna3l6aTdCazI0Nzk3SF9tM3FTQjFwODlEQWpZVHJSdFQ0WXhKZF9zQTB4X1BMYmdsVTlSSmlHZklNRUFYV3VTakVYTndXT2oySWVSaHRRaE5jUzV6bm5RQzl2d1k4TlpZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum could end 2024 close to $4,900: Finder survey - Crypto Briefing",
        "content": "Anticipated to approach its all-time high, Ethereum's 2024 forecast looks promising and includes a $5,300 peak.\n\nShare this article\n\nEthereum (ETH) is forecast to approach its all-time high by the end of 2024, with predictions setting its value at $4,887, slightly below the peak of $4,892 achieved in November 2021, according to a recent report by Finder. The report, which includes insights from 40 industry experts, also anticipates Ethereum could reach as high as $5,300 at some point during the year.\n\nDespite varying predictions, a significant majority of the panelists (71%) recommend buying ETH at this time, with 26% advising to hold and a mere 3% suggesting to sell, indicating a generally optimistic outlook for ETH’s performance in the coming year.\n\nMitesh Shah, founder and CEO of Omnia Markets Inc., is optimistic about Ethereum’s prospects, projecting a year-end price of $5,000 and a significant increase to $10,000 by the end of 2025. Shah attributes this potential growth to the increasing interest in cryptocurrency investment following the approval of Bitcoin Spot ETFs, which he believes will also benefit Ethereum as investors seek to diversify their portfolios.\n\nMeanwhile, Joseph Raczynski, a futurist from Joe Technologist, Consulting & Media, has a more conservative estimate, predicting Ethereum will close 2024 at $3,900 and ascend to $5,600 by the end of 2025. Raczynski highlights the potential for an Ethereum ETF and the overall positive trajectory of the cryptocurrency market as key factors that could drive Ethereum’s value upward.\n\nAlexander Kuptsikevich, a senior market analyst at FxPro, and Nick Ranga, a senior cryptocurrency and forex analyst at ForexTraders.com, both foresee Ethereum ending the year at $3,500, with Kuptsikevich expecting a peak of $5,500 and Ranga projecting a rise to $4,500 by 2025. Both analysts point to the recent approval of Bitcoin ETFs as a positive sign for Ethereum, suggesting that an Ethereum ETF may also be on the horizon.\n\nConversely, Dimitrios Salampasis, a Senior Lecturer at Swinburne University of Technology, offers a more cautious view, suggesting Ethereum might only slightly increase to $2,500 by year-end due to ongoing network challenges."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNaXRuYkxSa3ZCUTVjdHE4MUtUdThJVDJzTG1SVHV4MmtGWExiTmJIZnJCZnM0dmYtTlI2TnlKUXVheHBwclJTOTBRZmlEdGRlOHlUSVpZOGt6MXowMFV0QVhMSkdhUndaaDhDaEpCLUl3Q3hHbGxCbXNsXzBZSlUyTE9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Danksharding and Proto-danksharding Explained - Ledger",
        "content": "Danksharding and Proto-danksharding Explained\n\nBy Lipsa Das\n\nBeginner\n\nSHARE\n\nKEY TAKEAWAYS: — The Ethereum network is working towards improving its scalability, as blockchain apps are heavy to run which slows down transaction times.\n\n\n\n— Danksharding aims to solve Ethereum’s scalability issue but introducing it will take several upgrades.\n\n\n\n— EIP-4844, or proto-danksharding, lays the groundwork for Ethereum’s future by introducing a new type of transaction and a way to store temporary data.\n\nIf you know anything about the Ethereum network, you probably know that it’s the hub for decentralized applications (dApps) accessible through an Ethereum wallet due to its capability to host smart contracts. Ethereum is still the most popular network for blockchain apps today, and as such this puts the network under huge amounts of pressure. Unfortunately, hosting so many platforms, protocols, apps and tokens slows down its transaction finality and causes exorbitant fees.\n\nTo combat this scalability issue, the Ethereum roadmap includes several upgrades. With the Merge, Ethereum became a proof-of-stake chain, greatly reducing its power consumption and opening the door to innovations only possible on PoS networks. But to achieve cheaper and faster transactions, Ethereum still has a way to go.\n\nOne plan for the network was to implement sharding, a way to reduce network congestion and fees by splitting the massive Ethereum blockchain into smaller partitions. But the current solution it has found is danksharding: a way to make transactions much quicker and cheaper than they are currently.\n\nHowever, upgrading the Ethereum network isn’t easy. Its high network activity and the sheer number of apps relying on the network means big updates to the network’s consensus can take months or even years to implement. As such, it needs a custom solution. Enter proto-danksharding: it’s essentially a step between Ethereum as you know it today and its danksharding future.\n\nBut before we get into the details, what is danksharding in the first place? Let’s dive in.\n\nWhat Is Danksharding?\n\nDanksharding introduces a way to communicate with existing Ethereum layer two solutions, which is much easier to implement than sharding the whole Ethereum network. It also introduces a way to process more data per block, allowing for more complex transactions without slowing down the network or raising its gas fees.\n\nEssentially, it’s all about making blockchain rollups more efficient.\n\nTo understand how it works, let’s first dive into how blockchain rollups interact with the Ethereum blockchain currently. Today, rollups batch and process Ethereum transactions on their Layer 2 chain, then transmit a “validity proof” on the Ethereum main chain. While this method does save costs, over 90% of rollup transaction costs still go directly to the Ethereum mainnet for posting that proof.\n\nDanksharding will allow the Ethereum network to process these bundled transactions from layer two rollups without storing all of their data immutably. This essentially means the Ethereum mainnet is less burdened by data in the long term.\n\nWhat Is Proto-danksharding (EIP-4844)?\n\nProto-danksharding is a proposal, which when implemented, would provide the foundations to introduce danksharding to the Ethereum network. The concept was proposed in Ethereum Improvement Proposal 4844 (EIP-4844), and named after Ethereum researchers Dankrad Feist and Proto Lambda. Soon, EIP-4844 is due to be implemented as part of Ethereum’s Dencun Upgrade scheduled for March 13th, 2024.\n\nHow Does Proto-danksharding Work?\n\nIn preparation for danksharding, proto-danksharding introduces a new transaction type called “blob-carrying transactions” and its associated data type — “blobs”. Essentially, these two features allow the Ethereum network to process data from blockchain rollups more effectively. Let’s see how they work:\n\nWhat Are Blobs (Binary Large Objects)?\n\nBinary Large Objects (blobs) are a temporary store of data. Although new to the Ethereum network, blobs are already common in computer science. You can see them across programming languages like Javascript and Python.\n\nTo understand their significance in crypto though, it’s important to know that Ethereum currently stores all of its data on every node in the network—and this data lasts forever. It does this using its persistent memory store, calldata, however, this method of storing data is heavy on the system, and it’s also very expensive.\n\nBlobs, on the other hand, are cheaper to maintain since they have an expiry date of 4096 epochs, (approximately 18 days). This drastically reduces their storage cost. Each blob can store up to 128 kb of data, and each block can contain up to 16 data blobs. This is a lot of data storage available for more temporary means. In the long run, it means the Ethereum network is storing less data per block.\n\nWhat Are Blob-Carrying Transactions?\n\nBlob-carrying transactions are a new type of transaction on the Ethereum network designed specifically for handling blobs. Essentially, they carry a validity proof which allows the Ethereum chain to verify their authenticity without reading the blob itself.\n\nTo do this, it uses a mechanism named a KZG commitment scheme. Using Zero-Knowledge proofs, the mechanism guarantees the EVM can view a commitment to a blob, but not the blob data itself. Blob-carrying transactions have their own mempool separate from the EVM. This keeps data safe while optimizing block space.\n\nAnd of course, as a new type of transaction, there’s a new fee mechanism to match. Derived from EIP-1559, the pricing structure for blob-carrying transactions is dynamic; based on supply and demand. Typically, more than three blobs per transaction cause higher fees, varying by approximately 12.5% from block to block.\n\nPros of Danksharding\n\nReducing Transaction (Gas) Fees\n\nThe first benefit of danksharding is reduced transaction fees. To explain, high gas fees on the Ethereum network are primarily caused by network congestion. This can occur when there are huge numbers of people accessing blockchain apps and platforms on the Ethereum network. And, as you know, Ethereum is the home of the majority of dApps, meaning network congestion is a frequent issue users face. By allowing the network to process rollups more easily, danksharding will help Ethereum avoid congestion. This will improve gas fees on the wider Ethereum network—not just using a layer two chain.\n\nFaster Transactions\n\nAnother benefit of danksharding is that it allows Ethereum to process transactions much faster than was previously possible. By introducing a way to store data temporarily, it helps the network’s nodes. Previously, each node would store an entire copy of the blockchain’s history which is a heavy burden. With danksharding, the nodes store and process much less data, allowing them to work more efficiently. This means that your transactions become much faster.\n\nCons of Danksharding\n\nSecurity\n\nWhile danksharding may be the answer to Ethereum’s scalability concerns, there are some concerns about its security.\n\nWhile this method is much easier to implement on the network than the previous plan, sharding, Danksharding involves validating blob-carrying transactions off-chain. This is a security risk, as less popular rollups may become targets for bad actors. To explain, the smaller and less experienced the chain, the easier it is to attack. This could mean that blob-carrying transactions from malicious sources could end up on the Ethereum mainnet. While rollups have security measures to defend against this, they are not as robust as the Ethereum mainnet.\n\nThe Future of Proto-Danksharding\n\nAs the largest smart contract blockchain, Ethereum has faced significant challenges in scaling its infrastructure to meet the growing demand. However, ongoing scaling efforts such as sharding and the Ethereum Dencun upgrade represent promising steps toward improving the network’s capacity and performance.\n\nThe Ethereum Dencun Upgrade, which includes proto-danksharding, went live on the Goerli testnet on Jan 17th, 2024. The final test on Holesky testnet concluded successfully in Feb 2024, and in theory, it will go live at on March 13th.\n\nHowever, remember: it might be a while before the Ethereum mainnet integrates danksharding itself. The future of the Ethereum chain likely lies in blockchain rollups, and danksharding is just one way it is accommodating that potential."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNWDc5LW54cFRMQjkxZ2M1T3RpcWJaS0RKQms5WFlZRFJkMk9aN0tLVU9zNHkwVXpyX2dDUkJtMm9MMFplVmlYWWZjQUYzc3A0T25VMkVxQUhlT2lQN3g4aTFLWDhBd1FGbjBQbGxIQ21lc0tQWXJYVEpzQzdBYmdEeVBtWTZuZ0dNT2xmUlNkS2dHWmJoMTFydkp4Z2JwLUtaMDQwYkNxR2F6Um96ZklXNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Wrapped TAO on Ethereum soars to $82m — but it’s all controlled by one person - DLNews",
        "content": "The Wrapped TAO token on Ethereum is gaining popularity.\n\nBut the bridge that issues the token is controlled by a single person.\n\nThe bridge's creator stands to make $16 million in staking rewards over the coming year.\n\nCryptocurrencies tied with artificial intelligence projects have been some of the buzziest lately, and Bittensor and its native TAO token is the biggest of all by market value.\n\nA crypto bridge letting users send Bittensor’s TAO token to Ethereum has soared in popularity in recent months, as Ethereum users clamour for exposure to the buzzy AI token.\n\nThe bridge, which is community-run and independent of the project, now holds $82 million worth of TAO — all at the mercy of one person.\n\nOnchain records analysed by DL News show that the bridge creator must sign off every time someone holding wTAO on Ethereum wishes to redeem it for TAO tokens on the Bittensor network.\n\nIn DeFi, permissioned bridges are unusual. It means one individual or entity has total control over funds deposited into the bridge.\n\nThe pattern of these onchain movements is further explained through chat records in the project’s official Discord server, a messaging app.\n\n“Verification happens at least once a day morning/night or whenever I see a [transaction] come through,” CreativeBuilds, the pseudonymous developer who built the bridge said in the Bittensor Discord on July 9.\n\n“Withdrawals are verified manually but automatically processed once verified,” CreativeBuilds said.\n\nJoin the community to get our latest stories and updates\n\nDL News attempted to contact CreativeBuilds for comments on Discord and via email but has not heard back.\n\nUsually, developers use smart contracts to shift control of crypto bridges from humans to immutable computer code.\n\nBut the Bittensor network cannot handle smart contracts, making it difficult to create a bridge that functions in this way. This bridge was set up by CreativeBuilds, independently from those developing the Bittensor network.\n\nBittensor says it is transforming machine learning by decentralising it, creating a global marketplace for AI knowledge. It enables AI models to share intelligence, forming a digital collective brain.\n\nThe Tao Bridge\n\nThe Tao Bridge works by letting users deposit TAO tokens on the Bittensor side, and issuing Wrapped TAO — or wTAO for short — on Ethereum, which represent the TAO held in the bridge.\n\nIn the context of crypto bridges, wrapped tokens are placeholder tokens which represent tokens held by a bridge.\n\nBittensor’s TAO token has a maximum supply of 21 million tokens and thus the same tokenomics as Bitcoin. As with Bitcoin, there is a halving of the token rewards every four years. The current circulating supply amounts to 6.2 million TAO.\n\nThe project uses a proof-of-stake validation mechanism, meaning the network is secured by TAO holders staking their tokens. Currently, 89% of the supply is staked and the staking yield, paid in TAO, sits at 15.99% annually. For those who run their own staking validator, yields increase to 19.49%.\n\n$16 million a year\n\nOnchain data from TaoStats shows that 150,000 TAO tokens held in CreativeBuilds’ bridge are staked through a connected validator, earning a nearly 20% yield.\n\nIn Discord posts from January 2023, CreativeBuilds said he had been “very clear” about the fact that the funds were staked, and said the staking yield would be used to “to offset the cost of bridge [transactions].”\n\nWith some 150,000 TAO deposited into the bridge, its owner is set to earn around 29,250 TAO over the coming year. If TAO continues to trade at its current value of $550 per token, this haul will be worth over $16 million.\n\nIn the same Discord posts from January, CreativeBuilds said he would “create a system which passes through the rewards to an onchain contract in which users can stake wTAO and receive rewards.”\n\nThe Tao Bridge website does not appear to link to such an onchain staking contract.\n\n‘Just want to make sure it’s safe’\n\nSince October, TAO has rallied 990% amid a broader ETF-fueled rally in crypto assets.\n\nBittensor's TAO token has surged in recent months.\n\nAs the only option to buy the TAO token without using a centralised crypto exchange, the Tao Bridge has surged in use. Since October, the amount of wTAO issued on Ethereum through the bridge has almost tripled.\n\nMany users appear to trust the bridge due to CreativeBuilds’ active role in the Bittensor community.\n\nSome are still wary.\n\nThe Tao Bridge’s code is closed-source meaning that other users and developers cannot check it for bugs, or make sure it does what it is advertised to do.\n\n“Can’t find anything on the team behind it. Are they doxxed? It’s way easier to purchase and store wTao for me. Just want to make sure it’s safe,” said one user in the Bittensor Discord posting under the name The_1Legend.\n\n“The team is me and no I’m not doxxed,” CreativeBuilds replied.\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Ryan Celaj is DL News’ New York-based Data Correspondent. Reach out with tips at tim@dlnews.com and ryan@dlnews.com."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPeWJ2Ry1GQWRYczVuWW11ZUNsZmdJZl9Md2EtWUVoeUZ2czBCdkQyNnVtcndSRlBHeHBZdnd5ZFlGUUNqRDhvV19FakEzNkRMR3hENS12Z2RMZEk3Vm5JNmFueU82czRqMXpVSVluRnJkNWh1ekdkeHk5ZU90XzdTa3dOZGMzdHd0SFdPUkNRaF8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "COTI leaps 55% following latest Ethereum MPC privacy innovation - CryptoSlate",
        "content": "COTI’s privacy-focused Ethereum L2 development reached a critical milestone by successfully integrating its Multi-Party Computation (MPC) protocol. Its token price surged approximately 55% following this technical achievement.\n\nMPC is a powerful cryptographic tool that allows several parties to work together on a computation using their private data without revealing that data to each other. COTI confirms that the successful implementation of the MPC protocol represents the first in a series of technical goals they will meet before COTI V2 is fully deployed.\n\nCOTI V2 architecture and MPC integration.\n\nCOTI V2 architecture hinges on MPC technology, ensuring the privacy of its Layer 2 computations on Ethereum over private inputs executed without compromising data confidentiality. Participants supply encrypted data to an MPC’ black box’, which executes specific computational processes. MPC results are delivered in a way that safeguards data integrity throughout, even amidst potential external scrutiny. Each MPC entity, dubbed an “MPC endpoint,” will later integrate into the project’s custom Extended-EVM execution module.\n\nMPC endpoints facilitate collaborative computation without sacrificing data privacy. This advancement significantly improves EVM functionality, unlocking support for more diverse dApps within a framework offering transparency alongside essential privacy capabilities. This integrated MPC architecture provides greater privacy and security for complex computations on-chain, potentially fueling wider adoption of Ethereum technology as use cases expand.\n\nTo facilitate MPC use, users first establish cryptographic key material. Next, data is submitted in encrypted form for safe storage. Users then submit workloads in secure MPC bytecode, with operations like addition and multiplication taking place on confidential data without exposing those original values. Workloads can generate public outputs or outputs specifically encrypted to remain accessible only to chosen users.\n\nTesting and future plan.\n\nPer COTI, a simulated state was tested within MPC modules as they collaboratively generated a ‘garbled circuit.’ This cryptographic concept represents a specific computational function and has inherent security, being inherently single-use. This provides forward and backward secrecy through design.\n\nThis first development milestone includes completing the protocol, including design and algorithms. Importantly, COTI developers demonstrated the capability to securely input and output data using distributed keys, enabling advanced encryption and decryption functions without compromise.\n\nThe achievement of this privacy-focused landmark emphasizes the progress towards COTI’s ambitious Layer 2 solution. A COTI blog post states,\n\n“The creation and implementation of a secure MPC protocol is the first of many development milestones we’ll reach throughout the year. Stay tuned for further COTI V2 updates as development continues.”\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNNDhxVUJZbVBIdWVpRm9WdUdWLUhpQ01mN0NINlVtWnExR0Qwd0ZIaFZmSTdXSzU3VDZvSXJncU5oZHJ0NHRvRmpaVm1UYkNMOGw1TGotZURUSXhGRjdndHM5cS02YllNUThYVXBfbXlhdjJrT1RtNEdTcG1meVczN0x6bUxIRGFRQXdhaXE1ai1hWndKR1doS0FYblBuVTlV0gGoAUFVX3lxTE9QTmR0Wmh6ajNaQkZ6a3hWbHpmeUdaNHRUdDh0T3JQQnp2YWhGbk9kTTk3ZTd4TlhCeG5GQjBOU2dDMFUtQXZUbHRQb3drSWo0WE9XVlo1aG1nT2ZwTG11NDJPMzNNaGRQajVFYjJTTmtwMnloVFJrZ2p1alNsMlNKRVdERExpd3k4WGE2X0diSUcwM3g4bE5HaE5MYU00Rll6X1NKclpJZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "What Is ERC-404? The Experimental ‘Semi-Fungible’ Ethereum Token Standard - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEstablished token standards for Ethereum include fungible ERC-20 tokens and non-fungible ERC-721 tokens (NFTs). Now an experimental and unofficial new token standard, ERC-404, aims to combine elements of both into a single \"semi-fungible\" digital asset.\n\nWhat is ERC-404?\n\nERC-404 is a new token standard for digital assets on the Ethereum blockchain developed by pseudonymous creators \"ctrl\" and \"Acme.\"\n\nToken standards are formal sets of rules and protocols that determine the behavior of tokens on blockchain networks such as Ethereum.\n\nAD\n\nAD\n\nThe ERC-404 token standard combines features of ERC-20 and ERC-721, enabling the creation of \"semi-fungible\" tokens that employ features from fungible and non-fungible tokens.\n\nHow does ERC-404 work?\n\nNFTs are non-fungible, meaning that they are unique and indivisible; you can't own fractions of an NFT.\n\nERC-404 circumvents this limitation by using token mint and burn mechanics to enable fractional transfers of an NFT.\n\nIssued tokens are linked to an NFT. If you buy a full token, the linked NFT is minted to your wallet. If you sell a fraction of the token, the linked NFT is burned. If a wallet holding fractions of a token purchases enough fractions to hold a complete token, a new NFT is minted automatically.\n\nWhat's so special about it?\n\nThe ERC-404 token standard enables native fractionalization of NFTs, creating new primitives and new mechanics built atop them. This, in turn, allows for experimentation with NFTs and the trading of them.\n\nAD\n\nAD\n\nThe token standard's creators suggest that the goal is to create an NFT with \"native fractionalization, liquidity and encourages some aspects of trading/engagement to farm unique trait sets.\"\n\nThe team behind Pandora, a project using ERC-404, claims that it effectively enables NFTs built using the standard to \"effectively have a token price that reflects a floor price in real-time\" because it allows for \"actual native liquidity.\" Rather than needing a single counterparty to buy their NFT, holders of ERC-404 tokens can sell at a time of their choosing if there's a liquidity pool.\n\nFurthermore, instead of having to lock up or wrap NFTs and issue shares against them, fractionalization of NFTs can be achieved natively without relying on third-party protocols and solutions.\n\nAnother possible use case suggested by the Pandora team is gaming NFTs that incorporate randomization into the destroying and reminting of NFTs.\n\nERC-404 projects\n\nPandora: Pandora is one of the first projects to employ the ERC-404 token standard. It comprises 10,000 PANDORA ERC-20 tokens and 10,000 linked \"Replicant\" NFTs. A Replicant NFT is minted to your wallet if you purchase a PANDORA token on an exchange.\n\nPandora is one of the first projects to employ the ERC-404 token standard. It comprises 10,000 PANDORA ERC-20 tokens and 10,000 linked \"Replicant\" NFTs. A Replicant NFT is minted to your wallet if you purchase a PANDORA token on an exchange. DeFrogs: DeFrogs is a collection of 10,000 Pepe the Frog-themed NFTs using a variant of the ERC-404 token standard, billed as the first ERC-404 PFP collection, which its creators claim is deflationary.\n\nDeFrogs is a collection of 10,000 Pepe the Frog-themed NFTs using a variant of the ERC-404 token standard, billed as the first ERC-404 PFP collection, which its creators claim is deflationary. Monkees: Another PFP collection using the ERC-404 token standard, Monkees consists of 100 NFTs with ten attributes and six traits.\n\nThe future of ERC-404\n\nUnlike the popular ERC-20 and ERC-721 token standards, ERC-404 is \"experimental\" and unofficial. That means it hasn't been submitted for review as an Ethereum Improvement Proposal (EIP) or undergone a full external audit. This means it could have undiscovered flaws, introducing a significant risk to token holders.\n\nThe team states that, \"While these two standards are not designed to be mixed, this implementation strives to do so in as robust a manner as possible while minimizing tradeoffs,\" though they concede it is a \"non-standard\" implementation of ERC-721.\n\nBecause ERC-404 is an unofficial token standard, many NFT platforms and marketplaces do not support it by default\n\nThe team behind the token standard plan to submit it as an official Ethereum Improvement Proposal, a potentially lengthy process. However, their decision to circumvent the standard approval process for token standards could encourage other projects to do the same—which could lead to more unaudited token standards going to market, with the attendant risks to users that entails.\n\nAD\n\nAD"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOdGFRR2VTT2h2ZS1jX3cxdnFiUTJ5blVFTEltTm1nOE53WWhKSDNidFhnWkZ6cWhlb1pmbUFDSlNaWEVwX3UxUEVqOG9yOGtWSDN0S0xUMUNHejhQNWxOc3d4YTg5RlFPa2pYempkYW82X2JJUjZuNjl4VWlyd3dKTjRXNW1ySURNZlhGbjJGMDJFWkhka2U4NEFYcHpRSkNCRWswMTZmNGdDSUxYZHN2SUFJSGhfUVB6c1BEZGJOaHQzd9IBxwFBVV95cUxPTzBPdHgwaENWM1EwMEFDTTl6WHRXY2xJRUxGaDRRQ1d3VGRqMXkxcGczYldWanh3UTFQR1F1YW55X2dReVVBNllyRm9acmtQdFZDeUFtUUJXcUs3LTZTLWc0VW5pNmM1bk5mYlpTaGtoSXdaZDZ4eGV4WWUzUDQ0RWEtcXBXWjAwV2oxN2E3U1Y0MkxWc2xaMlFKM2Q2RDNXbTN6R2VzWTNGRlZGTU9MWWdnWmhPSkFhWlNqZ3pIdENJWl82aGlR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Feb 2024 08:00:00 GMT",
        "title": "More Than $1,000,000,000 in Ethereum Flows out of Centralized Exchanges This Week: IntoTheBlock - The Daily Hodl",
        "content": "Ethereum (ETH) flew off centralized exchanges this week, potentially reducing selling pressure on the ETH market, according to the crypto analytics firm IntoTheBlock.\n\nIn a new analysis, Lucas Outumuro, IntoTheBlock’s head of research, tracked Ethereum’s netflows, which measure the ETH moving in and out of centralized crypto exchanges by subtracting the amount of ETH’s withdrawals from its deposits.\n\nOutumuro notes that more than $1 billion worth of Ethereum netflows left centralized exchanges this week. ETH’s network fees, which indicate the willingness to spend and demand to use the asset, increased by more than 30% over the same time period.\n\nBitcoin (BTC) also flowed off centralized exchanges, clocking $300 million worth of net outflows and breaking an eight-week trend of inflows onto exchanges. Bitcoin’s network fees spiked by more than 50% this week as well.\n\nLarge upticks in exchange inflows tend to lead to an average price drop of 5% for crypto assets, according to a 2021 study published by fellow crypto analytics firm Santiment.\n\nETH is trading at $2,512 at time of writing. The second-ranked crypto asset by market cap is up 2.64% in the past 24 hours.\n\nBTC is trading at $47,478 at time of writing. The top-ranked crypto asset by market cap is up nearly 3% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNNUowVTM5YTZPUXpJUVFoMGZVS0JBQ2kxel9WSHlNaGtQSEJSODlLTWVuMkEteUhUTUpuNjJvZEt0VEZ6bzhFMC00dUFvRDZXY1dXMU9KNlRUVlpiSjBVOUhFck1mVVRkSGFTNWNsU0RhbzFBdEFGMkRlWjYwYXdjSFhiaE9RMEhvZ2FSUDVqUGRzMkFZeEZfWHM3aUc0UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Feb 2024 08:00:00 GMT",
        "title": "Crypto: Ethereum surpasses the threshold of 2 million active users! - Cointribune EN",
        "content": "Sat 10 Feb 2024 ▪ 3 min read ▪ by Evans S.\n\nEthereum, the pioneering blockchain recognized for its crypto innovation and flexibility, has reached a historic milestone: that of 2 million daily active users. This unprecedented event not only underscores the platform’s rapid growth but also heralds dizzying developmental prospects for the years to come.\n\nAn Expanding Ecosystem\n\nEthereum has always been at the forefront of blockchain technology, far surpassing its competitors in terms of active users and revenue generation for its holders (HODLers).\n\nThe platform has undergone a radical transformation since its inception, evolving from an energy-intensive Proof of Work (PoW) system to a more sustainable Proof of Stake (PoS) model under the guidance of Vitalik Buterin.\n\nThis transition to PoS, requiring validators to stake a significant amount of the ETH cryptocurrency, has not only reduced the blockchain’s carbon footprint but also strengthened the network’s security and efficiency.\n\nCrossing the threshold of 2 million daily active users is indicative of Ethereum’s attractiveness and robustness.\n\nThe Ethereum community, with its unwavering commitment to innovation and continuous improvement, has made possible what seemed to be a distant goal.\n\nThe successful implementation of Layer 2 (L2) solutions to enhance scalability and reduce transaction costs is a key factor in this exponential growth.\n\nMarket Dynamics and Future Anticipations\n\nThe evolution of Ethereum’s price is also a crucial indicator of its vitality and potential.\n\nDespite market turbulence, characterized by significant price fluctuations of major cryptocurrencies, Ethereum has demonstrated impressive resilience and bullish trends, surpassing the $2500 barrier. This performance is partly attributable to the positive anticipation surrounding the launch of the first Ethereum spot ETFs in the United States, a development that promises to inject additional liquidity into the Ethereum market.\n\nThe introduction of an Ethereum spot ETF represents a major step towards recognizing Ethereum as an investable and legitimate asset class. This development could not only attract a broader spectrum of institutional and traditional investors but also strengthen confidence in altcoins. However, regulatory uncertainty remains a challenge, with an ambiguous approach from regulators, underscoring the complexity of classifying Ethereum as a security or currency.\n\nThe future of Ethereum seems more promising than ever, with ongoing technical developments aimed at improving its scalability and further reducing transaction fees. The imminent Denchain upgrade, which targets the enhancement of layer 2 protocols, is particularly anticipated. This technical evolution, coupled with market optimism and increased liquidity due to spot ETFs, positions Ethereum on an upward trajectory towards new peaks.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxNTDNnZmZWdERIeUpDUU5VdTlHbjd5cVF6Ul9CeXJmUWViM2xlOHp0NXFtZFAyUWJ5c1o1YTgxZzdjeUI2T1BZRTVRVkNhVlU2UnhEWWxzMmtka1RVaVhNdV92cjkwcnowdjN0MGl3Nm5MTUxYWEZVVHJrN3VRTzAxdzJwWXItNWxId0xxNUhfbE5RTWYzMVVBMnhwOGdhdEp5ZkZ0WExhTjhDUVpKVDVaZk5HaXZ4MjFqZDhsNkVVLUlGX19SWUZJelIxRW5KN1Z1dWx5dXZwYTIyVTlEMkdybVBR0gHnAUFVX3lxTE16MkpKVGJPMkdRdXZvNDktMEx6RUprNHF0LTFnczBsWW4zWVFvaWR2aFhqaFEwZmdkUHJjZURvT0lNajBXZUF0TnNVeUNtcWJITGV5a2hHUTgzbm4wM2dTZUJRTjQ2MDJvaENob3NBNDNBRFVPVjQ1dWZJRFZVaHlTNHRCQzhfZEEyRnlzdGdRczFBM1VNTGpmZ0RFbXN4UHEwaW5nU1VpcHJLeVNKT2xlUHpOaGVNeGc4aXZlYnNpVVFjZTV6Y1BXb3BubnNhQVVwbTA3STJySXV0WVJkNkZGNjFNN29ZVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) rockets ahead this month – So why does a market analyst fear further collapse? - FXStreet",
        "content": "Among the top 10 most capitalized cryptocurrencies, Ethereum (ETH) has outshone its peers, marking the strongest performance with a 7% increase over the week. As market analyst for FXStreet Mike Ermolaev noted, the ETH price recently peaked at $2,706 and, even despite a pullback, many are eagerly eyeing the potential for Ethereum (ETH) to breach the $3,500 mark in the near future.\n\nNevertheless, according to Ermolaev, the possible declaration of ETH as a security could cast doubt on the possibility of reaching this coveted milestone. He also points out a crucial detail that could temper expectations: some technical indicators suggest a potential slowdown in Ethereum’s (ETH) growth.\n\nEthereum (ETH): Updates, sentiments, and transactions\n\nEthereum (ETH) has exhibited significant growth while trading within the range marked with its support at $2,016 and resistance at $2,633. The ongoing price increase may be associated with the upcoming Dencun update aimed at increasing network scalability and stability.\n\nAdditionally, one of the main pieces of news was that Whale Alert flagged a series of sizable Ethereum (ETH) transactions totaling close to 240,000 ETH. These movements have piqued the interest of traders and investors alike, especially considering that the majority of these transfers were directed towards leading crypto exchanges. Such big movements often raise questions about potential market shifts and the intentions behind such transfers.\n\nAdding fuel to the fire, Prometheum is poised to make waves with its upcoming announcement of custody services for Ethereum (ETH). With ETH's market capitalization trailing closely behind Bitcoin at $280 billion, this move may serve as part of a larger effort by Prometheum to challenge regulatory perceptions and push for Ethereum (ETH) to be recognized as a security – a stance met with skepticism by industry peers.\n\nEthereum (ETH) technical analysis\n\nDespite a small pullback observed earlier in the week, the ETH price has shown good growth, but key technical indicators depict a mixed picture: the Accumulation/Distribution Indicator (ADI) sits at 30.06, indicating moderate buying pressure.\n\nDespite the bullish crossover, the MACD signal line at 8,83 remains slightly above the MACD line at 7.3. This suggests a potential bearish divergence if the signal line continues to diverge away from the MACD line, indicating weakening bullish momentum.\n\nEthereum (ETH) price prediction\n\nIn a bullish scenario, if Ethereum (ETH) manages to break above the resistance level at $2,633, it could signal further upside potential toward $2,983 and $3,600.\n\nConversely, in a bearish scenario, if ETH fails to hold above the support level at $2,016, it might trigger selling pressure, potentially pushing the price lower towards $1,750 and $1,134.\n\nWhat awaits Ethereum (ETH)?\n\nEthereum’s (ETH) recent surge past the $2,400 barrier has sparked both excitement and concern among investors. Ethereum’s (ETH) upward trajectory is supported by optimistic sentiments and bullish predictions from industry experts. However, according to Mike Ermolaev, the path forward is uncertain, with key technical indicators suggesting potential challenges ahead. As Ethereum (ETH) navigates these dynamics, attention will remain focused on its ability to maintain momentum and potentially breach the $3,500 mark. But it remains unclear what will happen if Ethereum (ETH) is indeed declared a security. There is reason to fear that this event could crash the indicators to historic lows."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE1Va21WdmpZMUR5Z21idk9EMzdncDRDY2xMSlVPaDdkVE5KS2FORElzZV9UN0Z2S19aa2VWdl9yQ0loeGJ6SXMxdHhnQnZZN1Z3OGVYbXBlaElfTGZfTjlHcFV0Zm0yTGZkcWpMa0FlY9IBdEFVX3lxTE5nRGdFM1ppMGFIYnVNQ0lxSktGQUdJTFAzaXc2Q2VvWmtaTGFyc0JnYU5LMXR0ZWtCYjJLY01ZcVdMRjV0aGpmNmtCRnNXNjZiYklkT1NxcDgwckp0U240eDRGd3ZISlkxNXJaakFLdVBVemxq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum staking hits milestone: over 25% of supply now locked - Forkast News",
        "content": "Ethereum’s staked supply has reached a new milestone, with at least a quarter of its total supply now locked in staking contracts.\n\nThis milestone comes despite the Shapella upgrade in April 2023, which enabled staked Ether withdrawals. Ethereum transitioned to a proof-of-stake consensus mechanism in September 2022, allowing investors to lock their Ether to validate transactions in exchange for rewards.\n\nAs of Thursday, there are over 30 million Ether staked in the network, with 942,731 validators, according to Dune Analytics data.\n\nInvestors need at least 32 Ether (US$77,678) to become validators, but the entry barrier is lowered by liquid staking services such as Lido, which allows users to stake their assets in a pool.\n\nAccording to Dune Analytics, 31.5% of the 30 million staked Ether comes from Lido staking."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOcUlHa3R5NTY5SW91WV9rczFiSVNFS1JHTHZjYnNjLVpmeU9rbFcwZXlnMlFjWFVhQjlTSU9iaHItUDQ1ejhuSkh5bDk1U2EtSUJkMzY1OUdCdldJVFdRN1NaR2x2aGRJTHo4YV9CV25uRWkzWE12VHRLNHRJZ3EwZ3dfNXNGQ01sLXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Dencun - The planned upgrade for March 2024! - Cointribune EN",
        "content": "Fri 09 Feb 2024 ▪ 3 min read ▪ by Eddy S.\n\nThe Ethereum Foundation recently announced the deployment date of the Dencun upgrade on the mainnet. Scheduled for March 13, 2024, this long-awaited hard fork will bring significant structural changes to the Ethereum network.\n\nEthereum, Technical Improvements Brought by Dencun\n\nTechnically, Dencun introduces several notable new features to the Ethereum blockchain:\n\nTransition to a proof of stake consensus to validate blocks, replacing energy-intensive mining with validators. This is a fundamental change in the protocol, ending the use of intensive computing power to secure the network in favor of a system based on holding ETH.\n\nTransaction fees significantly reduced, divided by 100 thanks to Dencun. The Ethereum network becomes much more affordable for end users and improves its competitiveness against competing blockchains.\n\nImproved scalability achieved through larger blocks and solutions like sharding. The goal is to support 100,000 transactions per second compared to only 15 currently. This increased capacity is crucial for Ethereum to meet growing demand.\n\nEnhanced security thanks to new EVMs and “proto-danksharding.” These technical changes will make smart contracts and transactions on Ethereum more robust against exploits.\n\nThese technical improvements prepare Ethereum to welcome many more users and decentralized applications. They significantly modernize the infrastructure to make it more efficient, secure, and scalable.\n\nThe Economic Impact of the Hard Fork\n\nBeyond its technical implications, Dencun will also have significant economic repercussions on Ethereum:\n\nEnd of new ETH issuance through mining, replaced by only 900 ETH created each day. This drastic reduction in the network’s native inflation strengthens the scarcity of Ethereum (ETH) and favors an increase in its price by eliminating mining sales.\n\nDestruction of transaction fees, made possible by the EIP-1559 mechanism. This mechanically reduces the total number of ETH in circulation when network activity is high. A positive deflationary impact.\n\nAnnounced end of the triple halving of issuance with each major fork. Dencun will be the last fork to divide the issuance by three. In the long term, ETH becomes increasingly scarce.\n\nStaking rewards encouraging Ethereum holders to participate in securing the network, with an estimated yield between 5 and 15%. A much less inflationary model than mining.\n\nWith its Dencun upgrade, Ethereum enters a new decisive technical and economic era on March 13, 2024. These fundamental changes position the blockchain as an ideal infrastructure for Web3 and decentralized finance, and the anticipated positive impact on the value of ETH also generates considerable interest from investors.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9wUkhUTUVzbzVsemNTVzJNR0R3d3E5M05tWllqVmp3ajEwVWhUN2xhdC1fYlVqcjl6a0RPUjBEWms2V2Q4VnhUMTJlZWNydEZlUnMtNnpDWUpvR1JIMlBTUWZlQ3BVNTF1UlhCNmhyS3pVWk00Rm8tdUFlYzZaUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Feb 2024 08:00:00 GMT",
        "title": "Ethereum revolutionizes NFTs with ERC-404! - Cointribune EN",
        "content": "Sat 10 Feb 2024 ▪ 3 min read ▪ by Eddy S.\n\nA completely new Ethereum standard named ERC-404 is currently under development. Spearheaded by creators “ctrl” and “Acme,” this ambitious project aims to merge the fungible ERC-20 tokens with the usually incompatible ERC-721 NFTs. Behind this revolutionary idea lies the potential for fractional ownership of NFTs, a concept with profound implications.\n\nThe ERC-404 Hybrid Token Concept\n\nThe purpose of the ERC-404 standard is to combine the ERC-20 standards, which define fungible tokens such as USDT, with ERC-721, used for unique NFTs. This ambitious merge would result in a hybrid token that brings together the best of both worlds.\n\nSpecifically, ERC-404 tokens would allow multiple wallets to own fractions of the same iconic NFT. This way, it would be possible to own shares in a Bored Ape Yacht Club or a rare digital artwork. These fractional shares would then be tradable or usable, just like any ERC-20 token.\n\nThis disintermediated innovation in the field of NFT ownership opens up new use cases. For instance, lenders could accept fractions of an NFT as collateral, instead of having to seize the entire NFT. However, the technical challenges are complex for a successful integration of the two standards.\n\nEthereum, Adoption, and Criticisms Raised by ERC-404\n\nAlthough its development is still experimental, the ERC-404 standard has already garnered a lot of interest within the crypto ecosystem. Industry giants like Binance and OKX quickly announced their support for the standard before retracting it.\n\nThe Pandora token, the first to adopt ERC-404, experienced explosive growth in its valuation. Other projects using ERC-404 have also emerged, demonstrating the potential of this concept.\n\nHowever, ERC-404 also draws criticisms from within the crypto community. Some developers such as “quit” have warned against security flaws, like the potential theft of fractionated NFTs on poorly-configured lending platforms.\n\nThe creators of the standard have downplayed these risks, attributing the issues more to an incorrect implementation of ERC-404. Regardless, utmost caution remains paramount when it comes to the security of this experimental technology. Its adoption will require thorough audits and checks before it is deemed safe. With their ERC-404 standard, Ethereum developers are pushing the boundaries of blockchain innovation by merging two previously incompatible standards.\n\nDespite the technical challenges and controversies, this promising concept of fractional NFTs is already generating a tremendous amount of excitement. If properly audited and secured, Ethereum’s ERC-404 could become a major revolution for the future of cryptocurrencies and digital ownership. The next steps of this experimental project are crucial.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQYktNT29UVXpuNW8xd3MtaXIwUWVXWGVqaVgtYVVIZVJpWVAtSFV4ZGNYWXBZUUpQMWZvVEFwUTVYdlFfSWhtcTlvMWtMWGF1TG1oUjJDZkNMLUN4TTBMamI5UWhFbnpMc2lOWmgxeEVmcUtmWG9BQktEOUJXVTdoMS1NUTAwZlVZcFRWR3llNnF3Z3dFdkVJ0gGcAUFVX3lxTE1zbzhLNnNYVjVUTzVvM2d1TEZJZE9iZHF3LTE3ZVE0bWhHVU1TS1lORUVUbXZIeWkyYVVmamNaT3NUcGlwNWFzNHV3V0owbVlvWk8xUUMxZnAxYk9CazNRNjdnV3ZaZWdUT2VBSUFQdGR4SUxQbUZlRDhzaEZzUnZCRF9DR1p0NmZMNUowZ19Oc3dSaVVVbFpxQzZWaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Staked Ethereum hits 25% of total supply – Can it help ETH’s price? - AMBCrypto News",
        "content": "Almost 365 days after the Shapella upgrade, validators have staked 25% of ETH’s supply.\n\nETH remained deflationary, indicating a long-term bullish potential.\n\nAMBCrypto’s query on Nansen’s dashboard showed that about 25% of the total Ethereum [ETH] supply has been staked. This percentile amounts to 30 million ETH.\n\nFrom the result of the query, Nansen showed that 936,849 validators were involved in the process.\n\nFull-blown staking on Ethereum began after the blockchain’s Shapella upgrade in 2023. Though the activity has been in place since the September 2022 Merge, the Shapella upgrade gave it more popularity.\n\nSo, instead of miners, validators are now in charge of securing and maintaining the Ethereum network.\n\nValidators prefer to stick to Lido\n\nBesides ensuring network security, validators stake ETH to get a share of the reward. This reward is usually between 6% to 15% Annual Percentage Rate (APR).\n\nIt is, however, important to mention that some ETH holders might not be able to stake. This is because the minimum requirement is 32 ETH which earns validators 2 to 5 ETH yearly.\n\nFurthermore, an analysis of the staking data showed that Lido Finance [LDO] remained the preferred staking platform for depositors.\n\nAt press time, its market share in the staking sector was 31.8%. Also, the average price of the staked ETH was $2,022, indicating that most participants have gained from the altcoin’s price as well as the rewards.\n\nFor a large part of January, ETH staking deposits dropped. But the condition changed since the last week of the 1st month.\n\nAccording to Dune Analytics, Netflow on the 14-day Moving Average (MA) had increased to 840, 263. This increase suggests that participants’ interest in the activity has jumped.\n\nETH aims for $2,750\n\nIt also inferred that players were confident in ETH’s long-term potential. Interestingly, ETH’s price increased to $2,435 on the same day the staked supply hit 25%. The performance represents a 3.19% increase in the last 24 hours.\n\nMeanwhile, data from ultra sound money revealed that Ethereum had maintained its deflationary status.\n\nAs of this writing, the supply change was -3342.67 ETH. Ethereum being deflationary means that the cryptocurrency no longer has an infinite supply. In the long term, this could be bullish for ETH since high demand with low supply leads to a price increase.\n\nAMBCrypto also analyzed the Liquidity Heatmap. The Liquidity Heatmap attempts to predict levels where traders might get the best liquidity positions.\n\nOn the upside, liquidation could occur around $2.520. This level might also serve as a resistance point for ETH.\n\nHow much are 1,10,100 ETHs worth today?\n\nIf bulls flip this resistance, the next liquidation point could be around $2,750. Therefore, traders looking to long ETH with high margins should watch out for their targets.\n\nOn the other end, shorts should watch out for ETH’s movement around $1,855 and $2,100. Should sellers’ aggression fail to appear, high-level traders around this region risked being wiped out."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTFA5eUZ5ak9vdTB4OU5haFBIVFhtQTJ4c3ZDUHg3N1FxRHV2UEd5TzdCSVNIakRfV19xZkZ2aWd3STlZa2hjX0hGOGM3YWVTODRNUWY2dXFFeW1GLUhtTUZFZGRDWVFXeHVCSTRXU9IBckFVX3lxTE9tVkZqWkRubWNkUXZIVEg5S1FTSFZuUFV3bjU5ZmlPY3BlVkhISFBCeU4tbC1TblNDbGRmOEc0TTZVbjktbEJxejBPaHdtU040ODhzUUwwQ2ttbVJCNHpCUWRadTdkTWdLVDhSY3F1eFhIdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction for February 9 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nMost of the coins continue their bull run, according to CoinStats.\n\nAdvertisement\n\nETH chart by CoinStats\n\nETH/USD\n\nThe rate of Ethereum (ETH) has risen by 3.51% over the last 24 hours.\n\nImage by TradingView\n\nOn the hourly chart, the price of ETH is going up after a breakout of the $2,479 level. At the moment, there are no reversal signals, which means the growth is likely to continue to the $2,550-$2,600 zone.\n\nImage by TradingView\n\nA similar situation can be seen on the bigger time frame. Currently, traders should pay attention to the bar's closure in terms of the $2,500 area.\n\nIf it happens above it, there is a chance to see a test of the resistane of $2,613 within the next few days.\n\nImage by TradingView\n\nOn the weekly chart, bulls are also more powerful than bears. If nothing changes, the upward move may lead to a test of the $2,600-$2,700 zone next week.\n\nEthereum is trading at $2,508 at press time."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQNl9kNklxUzF2SHlYWE1LMWQyMjMwaTRocXd1aUEyc2FlMHBVVEkxbDdIUHdFLWdYTDN5MjFJelF0VzdrNmE3RDFLNDlkQ0dEbHVXb2paWHYxTm1YLXZnRUNJTHE2MXBiMmJHaXkyVzMtNmFDSGFmRnk2SjBKU0FLYlhB0gGHAUFVX3lxTE82WDJYYTZVbXhRcW9QMVhPcDhyem1nc1VvNkl0NmJOZDVCOTFXNVZ3YS1JdXpTd2xUUWFaMS1sOFlhWHNoWGJQOEVGSFltaWtwZmpyMERKZlRtUlhadk9JWS1fTG5FS294a2ZmODZRODM1YzI0aFgwODU5OWo0MHRUVVMtN2lfSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Rally: Experts Foresee ETH to $4,887 by 2024, $19,190 by 2030 - CoinGape",
        "content": "A recently published report by Finder conducted in January 2024 and shared with Coingape features the combined opinions of 40 crypto industry experts on the price projections for Ethereum (ETH) up to 2030. This survey, being a notable move to assess the growth potential of Ethereum, has delivered a common idea that there is a great future perspective of ETH among the participants.\n\nEthereum’s Trajectory of Price Through 2030\n\nAs per the findings, the panelists expect a big rise in the market value of Ethereum and an average price of $4,887 by the end of 2024. This upward trend is expected to persist, with projections indicating a further growth to $7,492 by 2025 and an amazing jump to $19,190 by 2030.\n\nadvertisement\n\nThese forecasts are all the more positive than the panel surveys in October 2023 and January 2023 and, in another way, highlight that the market and its performance are winning the confidence of market actors.\n\nCurrently, Ethereum (ETH) has had a bullish rally in the last 24 hours with price bouncing between an intra-day low and high of $2,475 and $2,522. At press time, ETH was exchanging hands at $2,492, a 0.30% surge from the support level. During the rally, ETH market market capitalization surged to $299,492,362,705 while the 24-hour trading volume dipped by 36% to $8,169,785,827.\n\nExpert Ethereum Insights\n\nJonathan Hababou Solomon, co-founder and co-CEO of A.R.I.A., emphasized the significant milestone of Ethereum exceeding $2,470, indicative of a reversion to the bullish mode. Solomon and other experts, including Damian Chmiel of Finance Magnates, noted that Bitcoin and Ethereum prices are strongly correlated. That suggests Ethereum may benefit from the same catalysts that have previously pushed Bitcoin up, such as ETF regimes and halving events.\n\nPedro Febrero, VP of Web3 at RealFevr, noted that Ethereum is in fact undervalued when compared to Bitcoin, considering its massive adoption and capabilities in DeFi, NFTs, gaming, etc. Nonetheless, experts’ viewpoints on Ethereum’s imminent future differed.\n\nWhilst some, including Josh Fraser of Origin Protocol, foresee an ETH peak price of $17,000 in 2024, influenced by such factors as possible ETFs and diminishing sell pressure, others, such as John Hawkins of the University of Canberra, take a more careful approach and predict a decline to $2,000.\n\nThe Consensus on Buying, Holding, or Selling ETH\n\nThe survey shows a strong preference for buying ETH, as 71% of the panelists recommend the acquisition at the current time. The expectation of Ethereum ETFs and the changing discourse around on-chain assets and decentralized applications gives credence to this view. Identically, a very small 3% of the shareholders believe that the best time to dispose of ETH is today because of the belief in the future development of Ethereum.\n\nDiversity of views is what one comes across in the discussion on the current valuation of Ethereum. Due to its impressive growth and potential as a global settlement layer, about half of the panelists think ETH is undervalued. On the other hand, however, a sizable 45% believe that Ethereum is fairly priced given the recent approval of Bitcoin ETFs and the potential for a similar event happening for Ethereum. Though a small fraction of the market views ETH as overpriced, the persistent system flaws within the Ethereum network are pointed at.\n\nThe survey further looked at the competition between Ethereum and new blockchain platforms, such as Solana. The majority of analysts (66%) have predicted that crypto fans will rely on the usage of Ethereum and Solana, thus taking advantage of the different features each provides. This point of view leads to a diverse and multi-chain future of the blockchain industry where different platforms meet the needs and choices of different groups of users.\n\nRead Also: XRP Price Prediction As Renewed Recovery Hints 14% Surge, But There’s A Catch\n\nKelvin Munene Murithi Kelvin is a distinguished writer with expertise in crypto and finance, holding a Bachelor's degree in Actuarial Science. Known for his incisive analysis and insightful content, he possesses a strong command of English and excels in conducting thorough research and delivering timely cryptocurrency market updates.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNWktsaDh1U0E4VnZVUEI1dnRvZnhZX0lvMVhfSVpHUFVEM051cHJ6czZFSlFNQVBKT0c1ZkdSam9mQmN2Zm5HeF9QSGR2eDBfby1aM2ZrbC1saWI1Yy15N2NRd2pNVm8yZ21hX3NiX3lvOHZ4Y1V6S1k1dnF4TmpjbkloRFg0OUxoMU54VEJFSnZUdjVEQV9reU52eDlCWmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum restaking protocol EigenLayer TVL surges amid rising ETH staking - CryptoSlate",
        "content": "EigenLayer, an Ethereum-based restaking protocol, has surged past Uniswap, the foremost decentralized exchange (DEX) on the Ethereum network, regarding total locked value (TVL).\n\nData from DeFillama shows that EigenLayer has emerged as the top-performing decentralized finance (DeFi) protocol over the past month. Its TVL skyrocketed by 171% in the last seven days alone, reaching $5.67 billion, positioning it as the fifth-largest DeFi protocol.\n\nIn contrast, Uniswap saw a modest 6% increase in TVL, reaching $4.31 billion during the same period. Other prominent DeFi protocols, such as Lido, Aave, and Maker, also experienced comparatively modest growth rates of less than 10%.\n\nMeanwhile, EigenLayer’s rapid increase follows staked ETH growth to an all-time high of more than 29 million tokens despite the recent selloff by the defunct crypto lender Celsius, according to Nansen data shared with CryptoSlate.\n\nWhy is EigenLayer TVL surging?\n\nEigenLayer’s surge can be attributed to the reopening of its vault for deposits on Feb. 5.\n\nSince then, ETH holdings on the platform have skyrocketed from 941,000 to 2.3 million within a week, marking a significant increase. This influx represents approximately 2% of Ethereum’s total circulating supply now staked through this platform.\n\nBlockchain analytics firm SpotOnChain reported that the top four restakers on EigenLayer are Puffer Finance, Tron’s network founder Justin Sun, Eigenpie, and Kelp DAO. Puffer Finance leads the group with 233,600 ETH restaked, followed by Sun with around 109,300 ETH — Eigenpie and Kelp DAO trail closely, having restaked 88,600 ETH and 75,300 ETH, respectively.\n\nWhat is EigenLayer?\n\nEigenLayer dominates the restaking market, attracting significant attention from the crypto community. Since June 2023, this DeFi protocol has gradually increased its deposit limit through a phased launch strategy.\n\nETH restaking has emerged as one of the leading narratives in the crypto market as it allows investors to earn extra rewards on their staked ETH. The protocol supports popular liquid staking tokens such as lido-staked ETH (stETH) and rocket pool ETH (RETH) restaking via its platform.\n\nMurathan, a contributor to DeFi collective, pointed out the increasing popularity of native restaking among ETH validators. He said:\n\n“1 in every 4 validators entering the Ethereum validator queue are setting their withdrawal credentials to an EigenPod.”\n\nHowever, some community members have warned that the model might create a Ponzi scheme that could come crashing soon.\n\nMentioned in this article"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBGWjRsVWxUcGJHWnRYYUZDVy1tX0UtbFVJcU5EY1daR25UWW9TbGk0QkJZamRZampIU0I2enBQOTdYdTB5VWkzdXV1TXNfS1ZmNjdkcHBiMFV1bHBiSnBuYXZjNDlHVjNUSE5nQTVvblQ5ODRRX2040gF8QVVfeXFMT0dUbk9jUmp3eUxpU2ZhNTlVQWxZVUJSMDNVR3Y5bFBBZEJXU0VVN2c0OFR0TFNPdFRpX2ZwbERiMUkxYjF5ODl6NmVETDhmSDJhX1lNTFg1dlQ3SXBTQWhkNGljd2JWakZiZFNkb3NSSVJ0bmR0bm5LZmZoWA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Insider: China's ETH Stake 'Jeopardizes Crypto' - Bitcoinist",
        "content": "Steven Nerayoff, a former advisor to Ethereum, has publicly voiced concerns about the Chinese Communist Party’s (CCP) alleged dominance over the ETH blockchain. His comments, made on X (formerly Twitter), echo the investigative findings of TruthLabs, an on-chain sleuth.\n\nAccording to TruthLabs, the CCP is speculated to control approximately 66.6% of ETH supply. This claim, if accurate, presents significant implications for the decentralization, security, and regulatory standing of Ethereum.\n\nThe CCP has taken over Crypto by being Ethereum's largest hidden whale, with an ownership estimation on my end of near 66.6% of the Eth supply today. They've clearly compromised the SEC, and CFTC, with Prometheum being given the ONLY Special Purpose Dealer Broker license for… pic.twitter.com/C5eCrGUH7d — TruthLabs 🫡 (@BoringSleuth) February 8, 2024\n\nNerayoff’s statements bring to light the potential deep-seated vulnerabilities within the ETH ecosystem. The CCP’s stake in Ethereum jeopardizes the entire crypto world. It’s inevitable. Ethereum has vulnerabilities—that’s a fact. The SEC and other entities are compromised. We can’t ignore this; we must confront the corruption, hold key figures accountable, and keep advancing this constantly evolving industry,” Nerayoff stated, underlining the urgency of addressing these issues head-on.\n\nA focal point of these allegations is Prometheum, a company that recently received a Special Purpose Dealer Broker (SPDB) license from the US Securities and Exchange Commission (SEC), marking a controversial step towards potentially classifying Ether as a security. Nerayoff’s critique extends to this development, emphasizing the implications of such a classification.\n\n“Prometheum’s declaration of Ethereum as a security extends beyond regulatory semantics; it’s a move by entities with deep CCP ties, aiming to control the narrative and the crypto space,” he remarked, highlighting the strategic influence exerted by the CCP through entities like Wanxiang, which is deeply involved with Prometheum.\n\nIn his comments, Nerayoff also referenced TruthLabs findings about the SEC filings that underscore the pivotal role of Wanxiang in the operation and development of the Prometheum Network.\n\n“The company (Prometheum) uses Wanxiang (CCP) as their SOLE project developer and relies on Wanxiang’s ability to create and maintain a successful platform. The loss of the services of Wanxiang could have a material adverse effect on the ability of the Company to Develop, Operate, or maintain the Prometheum Network,” TruthLabs quoted, spotlighting the ties with China.\n\nIs Ethereum Really Infiltrated By China’s CCP?\n\nTruthLabs has been at the forefront of uncovering these unsettling dynamics, alleging that the CCP’s influence over Ethereum and entities like Prometheum could compromise the privacy and security of American citizens. The researcher’s analysis suggests that the CCP’s involvement enables direct access to sensitive information of US consumers, a claim that amplifies the call for scrutiny and accountability within the crypto industry and regulatory bodies.\n\nTune in at 1:10 and tell me @prometheuminc isn't eager to sell you their Wanxiang, deep CCP tied, Crypto. Why is Gary Gensler giving this company access to our markets, and to American consumers? How did this CCP front company get the only approval and US companies did not? Now… https://t.co/0FcfqHvv3i — TruthLabs 🫡 (@BoringSleuth) February 9, 2024\n\nMoreover, Nerayoff’s direct challenge to prominent Ethereum figures, including Vitalik Buterin and Joseph Lubin, underscores the gravity of the situation. “It’s undeniable now. Your day of reckoning approaches… Vitalik Buterin, Joseph Lubin, Ethereum Foundation,” he warned, signaling the need for a concerted effort to address and mitigate the alleged corruption and external influence that threaten the ethos and integrity of the Ethereum network.\n\nAs Bitcoinist reported, Nerayoff is currently preparing a fraud lawsuit with the help of TruthLabs against the Ethereum Foundation, Buterin and Lubin. It is not yet known when the lawsuit will be filed in a US court.\n\nOver the past few months, Nerayoff has made numerous serious accusations against the Ethereum founders and submitted an old audio recording as evidence. Neither the Ethereum Foundation nor Buterin or Lubin have yet commented on any allegations, something Nerayoff and TruthLabs interpret as an admittance of guilt.\n\nAt press time, ETH traded at $2,454.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxPQWRZaW1MdHBkVjJHeU9oUWZTM1JDM0l6R2dITEMzVUcyaFlBZFFzMEhNbm9BYm10MVhGNkpobEg3cHFITnczVlY1aFdZOUdMZERsSVh4UXdVRzBpMWFub3VpSXRWMmNDQTI5dXBZQ3dmRUJkaHBzb0Qxd29mS1g1SjhGZC1WcktNT2dkWlRQN2d4RXlMbDhnM05Za1RERFBIWjJDaHhRY2NMVDF3dVF2VjhhVXc2OEV0QzgydXROemtzanFQbEptTDYxTFM4Q0cxMldOY2VydWZROTBlY2RYeGZTMHd6ZVV0Rm8ycHBDenBBT3JvcW5B0gH8AUFVX3lxTE5YODRQZ3JiRXp6a1RUa2F4bTV2Sm9HRWtna2dSSFY2Tkw0cDJ1NXF0b2E1NDlUT1pEWWRHbmhvTk9CUGZVY21kcVBDeWY4WTFvbVc5S1JoR3ZQSmNFcHE0MU9tM2pjMk1zdlBpdTJWd3VyNXRtQ3c5Q2NIYXNXTGNvUlBKcGc4TWJYMnV4ZVY0cjFFQ01uOG5IdkJBaExrQi1KRW9jMko4cHRUeWZxaW9vVm56dWdrbUhoRzY4Q0pibFBxVTNfMk1FMkU4cWY4UHRldGt3dHdnSWV1QWh4VllXYzVrVHhOTzFEUHE0YmdqanZoZUh4UlUwYzh4UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC eyes $48,000 with Chinese Lunar New Year of the Dragon - FXStreet",
        "content": "Bitcoin price could hit $48,000 this weekend if BTC decisively closes above $45,451 mean threshold.\n\nEthereum price could reclaim $2,717 range high as ETH leads altcoin’s revival recourse.\n\nXRP could reclaim $0.5500 as Ripple price breaches midline of the descending parallel channel.\n\nBitcoin (BTC) price started moving after a prolonged consolidation, and with it Ethereum (ETH) and Ripple (XRP) prices. The general outlook is revival recourse, with markets flashing green as the Chinese Lunar Year of the Dragon sets in this weekend. It is a special year, representing strength.\n\n“We’re happy to do the Year of the Dragon, because it’s a very powerful year and very auspicious,” said local board member of the Organization of Chinese Americans, Anna Wong, adding, “and everyone feels lucky when they’re in the Year of the Dragon.”\n\nWith this optimism, crypto markets could rally this weekend as Chinese investors feel lucky.\n\nAlso Read: Bitcoin price shows strength as US BTC ETF flow percentage beats AUM in most regions\n\nBitcoin price could make it to $48,000 this weekend\n\nBitcoin (BTC) price has forayed past the midline of the supply zone at $45,451. The supply zone extending from $44,235 to $46,715 is an order block characterized by aggressive selling. If BTC manages to close above its midline, it could extend the gains to $48,000 this weekend, or in a highly bullish case, extend the gains to $50,000. Such a move would denote a 5% climb above current levels.\n\nThe Relative Strength Index (RSI) is northbound, pointing to rising momentum. The Moving Average Convergence Divergence (MACD) is also in positive territory with histogram bars flashing green to show a strong bullish wave.\n\nBTC/USDT 1-day chart\n\nConversely, with the RSI above 70, BTC is in overbought territory and a correction may be looming. Another threat to Bitcoin price upside potential is early profit-taking, which could see BTC fall back into the range between $40,650 and $43,750.\n\nIf selling pressure sends BTC all the way to $37,800, the cliff could see Bitcoin price roll over to $30,000, below which the bullish thesis would be invalidated.\n\nAlso Read: Bitcoin Weekly Forecast: BTC targets $52,000, will New Moon trigger a pullback first?\n\nEthereum price could reclaim its $2,717 range high\n\nEthereum (ETH) price is on a sustained uptrend, and could extend the climb past $2,600 to tag $2,717, levels last tested on January 12. This would constitute a 9% climb above current levels.\n\nThe RSI position at 63 shows there is more room in the north before ETH is overbought, with the inclination of the momentum indicator showing rising buying strength.\n\nThe MACD histogram bars are also green to show the strong presence of bulls in the market. Enhanced buyer momentum could see Ethereum price shatter past the range high to hit $2,800.\n\nETH/USDT 1-day chart\n\nOn the flip side, if traders start cashing in, Ethereum price could drop. While a break below $2,388 would harm ETH holders, the prevailing bullish outlook would only be invalidated if ETH crosses and closes below $2,280.\n\nAlso Read: Ethereum price tops $2,400 as 25% of ETH supply is staked and ETF applicants amend filings\n\nRipple price could take back $0.5500\n\nRipple (XRP) price has broken above the midline of the descending parallel channel. With momentum rising, XRP price could extend the gains 5% to the $0.5500 level. In a highly bullish case, the price could extend the climb, shattering the 50, 200 and 100-day Simple Moving Averages (SMA) at $0.5633, $0.5730 and $0.5970, respectively. This could lay the path for XRP to hit the $0.6000 psychological level.\n\nXRP/USDT 1-day chart\n\nOn the flipside, if the bears have their way, Ripple price could dwindle, potentially retesting the $0.4734 support.\n\nAlso Read: XRP Price faces threat of fall below $0.50 as XRPLedger AMM amendment is uncertain"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxOMWpYcnNHZEF1M2dHamw2NDAyRGZCN1IyXzcyWnVVX29KRzkyNWRNSTMwUHl0MWdfYmNVV2VfMmZnUVlhdVpRam1sUndaY05UWjdwd3QteTZjN3lmMTluR19ab1lRdFgzMVFIcUk2WFBuTlRkcGpSUGFnWEZEdVNxUS14eDhJLUVSU0w2cW1ZZ1hwZU51Mmg2VXoySHBLX2hfdk51NzFKbTBqM1NMSVc1Q2ROVHd5cUh4VU5RMDhseHZLS1NKOWNRYXFFTGNTUWYxTzh1X01ac9IB3AFBVV95cUxOYUxia2hMd084U2NrcUs0cUdET3RCRUxQQUlBdmZTSHZoTkFqb0VQMDYxdDQzVjZtck5ocXRPcWVsOHpfN3FVQjdSemt4azM5aUVNNmFna0pqM2liQTg1czVGZVNTbGxsXzJ0UkE1T3M3emZMYldWZGV4dEcxdFBhTVpqRmVxS3lOekpiS1BsWFZEdUZGb0dJY3JYY3hrT1BRcmRGY0NvX2FYMk43bjZIM2Q0eTJPX2RVelhOM3RNa2dDUVZqYmpUN3Vxb3JNbURFT3I0SVVRWmZsZGtO?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, Bitcoin & RUNE – European Wrap 9 February - FXStreet",
        "content": "ThorChain (RUNE) price is trading with a bullish bias, completing a full swing V-shaped recovery after the steep dip in the first four days of February. It comes amid an altcoin revival recourse, inspired by Bitcoin (BTC) price breaking past the $45,000 psychological level.\n\nDespite the Bitcoin spot Exchange-Traded Fund (ETF) approval, BTC price failed to rally as anticipated. The news of ETF inflows and outflows, caused a widespread panic among investors, which led to a brief pause. But lately, things are starting to improve with regard to ETF inflows.\n\nBitcoin (BTC) price action is showing strength and volatility after seven weeks of consolidation. The current weekly BTC candlestick has already registered a 9.30% gain and is likely to close on a positive note.\n\nAmong the top 10 most capitalized cryptocurrencies, Ethereum (ETH) has outshone its peers, marking the strongest performance with a 7% increase over the week. As market analyst for FXStreet Mike Ermolaev noted, the ETH price recently peaked at $2,706 and, even despite a pullback, many are eagerly eyeing the potential for Ethereum (ETH) to breach the $3,500 mark in the near future.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNdUxmYmNXWFc0TWlfcEd3NkR3aG9sdVRjOXItNkY0NGN4WkRKYzVGdjVwT05ycXgzdTZMTThDWDNOSjNFRkhwa2NvWk8taUZNTUwyVlU4V3ZzN3JNVk02UzNLM1AtbWVmRGlnSkJFRWhpVTJkNnVvMm51M1Z4WU9PakltSlrSAYoBQVVfeXFMTU1aRUZWTG5GRnVWNS11ckVSZlU0SnQyMzdrVHYwNnl4VGdDamhMVTkwRU1mX0pjcEtsaU5JODREMEhUbUZqdUZ2TjRSQTdmT0d6NVNEcll3STZIbTBQSkFLUEVpa3BfZnhhYkZwdnZSUmMtMFBUQTZBSDVlUGc4bnlyci1OZHN3dk1R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) and Dogecoin (DOGE) Surprisingly Share Common Trait - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum and Dogecoin, two vastly different cryptocurrencies in function and design, are currently linked by a shared trait: a notable decrease in social volume.\n\nAdvertisement\n\nThis drop in social chatter comes in the wake of a broader market recovery from the post-ETF downturn witnessed four weeks prior. Bitcoin has notably rebounded, soaring to heights not seen since mid-January, yet the reduced social interest in Ethereum and Dogecoin persists.\n\nSuch calmness could be a harbinger of stability. A muted social landscape may decrease the likelihood of reactionary sell-offs, which can shield the prices of these assets from potential drops in the near term.\n\nEthereum and Dogecoin's distinct market positions further color this phenomenon. Ethereum, a platform famed for its smart contract capabilities, sits at the heart of the DeFi and NFT revolutions, underpinning a vast ecosystem of applications.\n\nAdvertisement\n\nDogecoin, on the other hand, started as a meme and has since captured a cult following, often riding waves of celebrity endorsements and social media trends. Despite their differences, both currencies experience the ebb and flow of investor and media attention, impacting their market behavior.\n\nThe subdued social volume for these cryptocurrencies could imply a period of accumulation by large investors, or it might reflect a market consolidation phase, as attention pivots to newer or more volatile assets.\n\nEthereum and Dogecoin may not share the limelight, but they share the resilience of navigating through quiet periods of social volume. This tranquility could provide a more stable foundation for future growth, unaffected by the rapid sentiment changes often fueled by social media discourse."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOVjNjcFY4Mk91RnE4YWdfcnRuLVRFSl9zYjdIOUh0RVIwWnNUY0RuMHdHNFBtbFlFYXRDZVdhcXJWazFxY0RkQW1ZLWtHUnRCdGZjMkN4MHd0RUdxTGVtelgzOG5QcGx0Z1Zmemd4OXV2VXFwV2ZyQkNEcnpmTU9SREJ4RExFSknSAYwBQVVfeXFMTWZyN3d2d3FiUGQyeXBhNlBoZzJCbW5WcnpQYW84aEZvSFdmd0lJNHdsT09CWjVSWXBNOTd2amVHeExuc1Mxc3pycjRDbnFaVm1DX1BPeHBiazNLbmpJaW9hREVBeHBaeDFSX0pGWHZQdHNXc0pnd3hTeUtVSW83WFdFS1ZOYzRJbmUtZTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Feb 2024 08:00:00 GMT",
        "title": "Week in review: Analyzing the Bitcoin, Ethereum price surge - AMBCrypto News",
        "content": "BTC and Ethereum lead the 7-day increase metric.\n\nBTC and ETH have contributed to the increase in the general market cap.\n\nOver the last seven days, both Bitcoin [BTC] and Ethereum [ETH] witnessed price increases, consequently impacting their respective market caps. Furthermore, the growth observed in these two assets has contributed favorably to the overall market cap as well.\n\nBitcoin and Ethereum lead market increase\n\nAccording to CoinMarketCap data, Bitcoin and Ethereum have exhibited substantial value growth among the top assets in the past seven days. At the time of this writing, BTC has increased by about 7%, while ETH has increased by over 6%.\n\nA more detailed analysis showed that during the last week, the market cap of BTC witnessed a rise of over $60 billion. The market cap moved from around $845 billion on 3rd February to about $908 billion on 9th February.\n\nSimilarly, examining the ETH market cap showed a notable uptrend in the past seven days. Between 3rd February and 9th February, the market cap increased from about $276 billion to around $295 billion, reflecting a rise of around $19 billion.\n\nBitcoin and Ethereum’s market cap boost general market cap\n\nAt the time of this writing, Bitcoin and Ethereum held market dominance figures of about 52% and 17%, respectively. This implied that any fluctuations in their market caps would substantially impact the overall market.\n\nBased on the analysis of market caps on CoinMarketCap, BTC and ETH saw an increase of around $79 billion in the past seven days. This showed that the combined contributions of BTC and ETH accounted for a $79 billion addition to the overall market cap.\n\nAt the time of this writing, the general market cap has risen by about 1.7%, reaching around $1.7 trillion.\n\nHow BTC and ETH have trended\n\nAt the time of this writing, Bitcoin traded at about $46,200 on the daily timeframe chart. A chart review showed that it has experienced a growth of over 2%, marking the fifth consecutive day of increase.\n\nAdditionally, the Relative Strength Index (RSI) suggests that it is nearing the overbought zone at the time of this writing.\n\nHow much are 1,10,100 ETHs worth today\n\nFurthermore, an examination of Ethereum on the daily timeframe showed it was trading with an increase. At the time of this writing, it was trading at around $2,454, showcasing a rise of about 1.45%.\n\nIt is noteworthy that ETH has not displayed the same seamless increase as BTC but has witnessed an increase nonetheless."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBsRXFva3Z3dmsydDlCVVp3b2FpRTEyS095VE9iTzN3WC1LSktKbTBVbnVVMFNPY2VPaW9XWFl6cDhxZEF3eGMwdHpucFF6RUtJVnpXOV9xTGNqanVpVENaeUxVVHpaRWM4cGlsU0dwM2NTWERoYmV1d0pLaWfSAYQBQVVfeXFMT0oyVUlpbWRUQVpLZHFvbGFSRW5SV3JHOGw4Z1YyYXAtb2ZJdEZxcHMxTkstN2xxUVRtMnhHZ2ZqcVJ6Rm1vVnpWcUV6U0U5bjU3TG5yZGFtbEM3NFRMbWJ4NEhVbUNmT3ZtREtCOE9EcTYtaW5OYmZOX25wMWdhbDlHNXFY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Why Treasure Is Building ‘Infinity Chains’ on Arbitrum to Power Ethereum Games - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto gaming ecosystem Treasure had options. Built on Arbitrum, the platform—which currently spans 15 games—attracted proposals from the Optimism, zkSync, and SKALE teams in recent weeks to migrate to another Ethereum scaling network.\n\nInstead, Treasure intends to double down on Arbitrum. This week, the ecosystem’s core team announced plans to launch a Treasure Chain built on Arbitrum and using its existing MAGIC token to pay for gas, with a web of “Infinity Chains” that can power the various games being built around Treasure.\n\nUnder the proposed plan, which Treasure’s DAO still has to approve (with a vote planned for Monday, February 12), Arbitrum developer Offchain Labs will build out the Treasure Chain—a custom Ethereum layer-2 scaling network—that will then enable game creators to deploy their own layer-3 Infinity Chains that orbit it.\n\n“This is really just an evolution of our vision at Treasure, with the history of us being one of the earliest projects to build on Arbitrum,” co-founder Karel Vuong explained to Decrypt’s GG. “The natural next step for us was to launch towards our own chain. Our ambition is really to build this gaming and entertainment powerhouse that's built and owned by everyone.”\n\nAD\n\nAD\n\n𝗜𝗻𝘁𝗿𝗼𝗱𝘂𝗰𝗶𝗻𝗴 𝗧𝗿𝗲𝗮𝘀𝘂𝗿𝗲: 𝗜𝗻𝗳𝗶𝗻𝗶𝘁𝘆 𝗖𝗵𝗮𝗶𝗻𝘀 ✨ The litepaper for the Treasure Chain is here! This expands upon our vision to build an end-to-end gaming ecosystem. Everything connected by $MAGIC, powering infinite games. ♾️https://t.co/ZwNbg25H8l pic.twitter.com/otcgfdNzbp — Treasure (@Treasure_DAO) February 5, 2024\n\nWe’ve seen other games—like Pixels, Pirate Nation, and Crypto Unicorns—hop chains (or make plans to) in recent months, so what convinced Treasure to stick with Arbitrum?\n\nVuong pointed to what they saw as deficiencies with rival proposals, whether it’s the technical makeup (in the case of Optimism) or a perceived lack of traction with users (as with zkSync). Arbitrum has specific functionality that Treasure needs, he added, and they’ve built up a user base in that ecosystem. On top of that, Treasure and Offchain Labs already have a bond.\n\n“We've been in the trenches together since the days where Arbitrum gaming was in its infancy,” said Offchain Labs Chief Strategy Officer A.J. Warner. “People only thought about Arbitrum as a DeFi-focused environment.”\n\nAD\n\nAD\n\nThat’s no longer the case. Treasure’s own rise helped kick-start that evolution, with a growing list of games including The Beacon, Mighty Action Heroes, and Kaiju Cards. More recently, Arbitrum has seen the rise of Xai, a layer-3 gaming chain that held an airdrop in January and will begin rolling out games in the coming months.\n\nVuong and Warner both said they see potential for interoperability and collaboration across the Arbitrum gaming space, though Warner said that they’re still “looking at the best ways to do it securely without compromising.” As he noted, bridges between chains tend to be susceptible to attacks, as seen with the Ronin Network’s $622 million bridge exploit in 2022.\n\nIf Treasure’s DAO approves the proposed plan, then the core team aims to get the Treasure Chain testnet launched by the end of this quarter, with a mainnet launch in Q3 2024.\n\nVuong sees an array of potential benefits to the plan, including enhanced cohesion across the Treasure ecosystem, enhanced utility for the MAGIC governance token, and the ability to enforce creator royalty settings on NFT sales. For Treasure, too, it’s an opportunity to take its growing toolset for game developers and build something even bigger with it.\n\n“We’re seeing this opportunity to build new IP as a decentralized game publisher,” Vuong said, “almost like a new Marvel Cinematic Universe, but one that is truly bottom-up.”\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNNEdkbE5qMEwxeGNuMm5OcEFlNDM1T2wxYV84aXR5VmlTVktfVTFrckJ5eVhzeThKZmhobFZKRjZpYWNPOVg4NEZ2ODFid01lOFZoRXFEV3RoUjJFcEhBSXd6c3BiRGZhWkJfVmJRdE92bjlTc3N6R0hueXBnOGk2Y01GSmZoTXVWOW1KMTZyTzhCOVZwTDkteUgtdUNXX1VGdExGc3Nlc0hMSExRV2JvX0dDcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "VeChain partners with BCG as over 30m ETH staked on Ethereum, 15,000 users join Pullix presale - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nVeChain has partnered with Boston Consulting Group (BCG) to help reduce carbon emissions in the textile industry. Meanwhile, over 30 million ETH has been staked on Ethereum. Amid this, Pullix (PLX) has successfully attracted over 15,000 users in the ongoing presale.\n\nVeChain and BCG partner\n\nVeChain has partnered with Boston Consulting Group to leverage blockchain technology and drive sustainability transformations in the textile industry.\n\nThe goal is to promote a circular economy and increase textile material recycling, thereby reducing greenhouse gas emissions in the sector.\n\nYou might also like: VeChain Foundation collaborates with UN, VET up\n\nFollowing this, VET prices rose by 8.2% and 3.9% on the 14-day and 7-day price charts, respectively.\n\nCurrently, the coin is trading between $0.02743 and $0.02931.\n\nOver 30 million ETH staked on Ethereum\n\nNansen, an analytics company, notes that at least 30 million ETH, or 25% of the total ETH total supply, have been staked.\n\nThe more coins staked, the lower the circulating supply, a net positive for prices.\n\nSince Jan.23, ETH has been firm, rising from $2,272.09 to $2,442.97, breaking above the $2,440.09 resistance as bulls target $2,500.\n\nPullix hits new milestone\n\nPullix has been gaining traction in the ongoing presale.\n\nThe platform plans to introduce a hybrid trading platform allowing for seamless trading of conventional and cryptocurrency assets.\n\nYou might also like: Polkadot declining, Bitcoin under pressure as excitement builds ahead of Pullix launch\n\nIts native token, PLX, offers holders access to specific services, discounts, and staking prizes.\n\nThe token is trading at $0.1 in stage 7 of the presale.\n\nConclusion\n\nVeChain and Ethereum are making progress in their respective sustainability efforts. Pullix, a new defi project, has attracted over 15,000 users in its presale. Analysts expect more growth in the days ahead."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNMHVpOXVUcWhFRXZBcXl3STdHNlZ3Njlxdy1lTUxBUS1qUXAtQmxJbU5DOHpfVUhhOE1maHV3WmJEME9NcXB0M1RwcmpNd1hQa2pCbTVGVzhmREVJRzBnbVBOWFdKNFl1RENzeUxQdERsVkM2Mml3dUpjWVQzZDZpY0Vyb2hMcGpoZkVSa2J2MTgxX19Zb01JcGJBX0FWLU9YZW9R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Grayscale Bitcoin and Ethereum ETFs Experience Significant Outflows - Blockchain.News",
        "content": "Disclaimer\n\nDisclaimer: Blockchain.news provides content for informational purposes only. In no event shall blockchain.news be responsible for any direct, indirect, incidental, or consequential damages arising from the use of, or inability to use, the information provided. This includes, but is not limited to, any loss or damage resulting from decisions made based on the content. Readers should conduct their own research and consult professionals before making financial decisions."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQV2YxNGQ4SGtBUHhQOWI3MlR1emJmWWkxY3RncVpUVlFwa2dLSldpR1NGWll0YkVoamg4UmZqODZSSkRTbW1hX1M0YnpiNDdjMHBwdlJRQkNsTTczMExqelBab1J2dFNLVG9reDAtQ1l5YXFra1Q4cFBfSkFlYmcwaDFpZEgyekc0V0JYck1ndXNnWlZROHFr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Optimism to Stop ETH Withdrawals for 1 Hour Next Week - Crypto Times",
        "content": "Layer 2 network Optimism is planning to conduct a one-hour halt on Ethereum (ETH) withdrawals on February 15.\n\nThis pause aims to test an upgraded incident response system, enhancing the network’s ability to address security issues across various chains within the Optimism ecosystem.\n\nSpecifically, withdrawals of ETH from the Layer 2 network to the Ethereum mainnet will be temporarily stopped, while deposits from the mainnet to the Layer 2 network and regular transactions within the network will continue unaffected.\n\nThe new feature of the incident response system will enable a broader pause, impacting withdrawals of both tokens and NFTs for Optimism and any associated chains that opt into the system.\n\nWhen announcing the upgraded system on January 25, OP Labs emphasized that the enhancement aims to not only bolster individual chains but also harness the combined security intelligence across the entire Superchain.\n\nThe updated feature is currently operational on its testing network, and a one-hour pause will be conducted to evaluate its functionality in a live setting.\n\nOptimism encompasses a network of Layer 2 chains, referred to as the Superchain, employing optimistic rollups to decrease transaction expenses for dApps. Governed by a DAO called the Optimism Collective, this ecosystem includes prominent networks such as the OP Mainnet, alongside others like Base and Zora."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOLUlSRFZ2S3QyWnNodExjZERSRFZFNERhRDlVNGpDNVE0VGowMzM3MmZXU3Z6dUVYSzhEQTZRVFNOM1Q1NjF1V21ndjNpNnF0RmdwSTVIZ0ZveFQ3OGZIMUllT3Q4QXlESmNQb3hZSS16VmpkTm5UdlpiMjNDZWtYV00tRTNoQjJocjR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Feb 2024 08:00:00 GMT",
        "title": "Prediction: Solana Will Reach $260 In 2025 - The Motley Fool",
        "content": "Solana could be on a trajectory to reclaim its all-time high of $260. But a lot still needs to go right.\n\nIn 2023, Solana (SOL -0.75%) was one of the best-performing cryptocurrencies, up more than 1,000% for the year at one point. While that performance might be impossible to top in 2024, there's reason to think that Solana still has plenty more upside from its current price of $100.\n\nIn fact, Solana might now be on a trajectory to reclaim its all-time high of $260 by the end of 2025. Let's take a closer look at what needs to go right for Solana for this to happen.\n\nSurge in network activity\n\nOne of the most promising signs for Solana has been the rapid growth taking place on its blockchain network. New users, for example, recently surged to their highest level since 2022. Overall network activity, as measured by metrics such as Total Value Locked (TVL), continues to show signs of improvement.\n\nMost importantly, trading volume on Solana's decentralized exchanges continues to grow quickly. This sudden display of strength in decentralized finance (DeFi) is notable, since it is an area where Solana has historically lagged. In fact, by the end of 2023, Solana was starting to eclipse its chief rival Ethereum (ETH -0.75%) in terms of overall trading volume on its decentralized exchanges.\n\nSolana vs. Ethereum\n\nThat brings us to the No. 1 reason why I think Solana has the potential to skyrocket in value between now and the end of 2025: Solana is the one blockchain most capable of supplanting Ethereum as the market leader. Ever since it launched in 2015, Ethereum has reigned supreme in the smart contract blockchain space. But now, nearly a decade later, it looks like Solana could be ready to topple Ethereum.\n\nThe narrative about Solana as a so-called \"Ethereum killer\" has existed since it launched in 2020, due to its superior transaction processing speeds and lower costs. Now this narrative is really gaining steam with high-profile institutional investors. At the end of 2023, for example, Cathie Wood of Ark Invest pointed out on CNBC that Solana was a faster, more cost-efficient version of Ethereum. That quickly led to a 20% boost in valuation.\n\nJust keep in mind, however, that Solana was trading for less than $10 at the end of 2022, and some traders thought it might eventually go to zero. So Solana is still a very risky, speculative investment.\n\nMost notably, I'm concerned that some of the recent surge in activity we've been seeing on the Solana blockchain is really just a lot of smoke and mirrors. The recent surge in trading activity, for example, seems to be coming from the speculative buying and selling of Solana meme coins.\n\nHow high can Solana go?\n\nWhile a price target of $260 for Solana might sound ultra-aggressive, it's really not. By way of comparison, investment firm VanEck recently set a price target of $3,200 for Solana. And we've already seen Solana soar by nearly 1,000% in 2023. So asking Solana to double or triple in value to reach a price it was trading at less than three years ago does not seem to be out of the realm of reason.\n\nMoreover, if you do some quick back-of-the-envelope math, it's possible to see a real path forward to $260. Ethereum's total market cap right now is $277 billion, while Solana's total market cap is $42 billion. So investors currently perceive Ethereum to be 6.5 times more valuable than Solana.\n\nIf you buy into the investment thesis that Solana is chipping away at Ethereum's dominance and setting itself up to eventually supplant Ethereum as the market leader, then the market caps of the two cryptos should converge at some point. From this perspective, the potential upside of Solana might be as high as $650!\n\nIs a price of $260 realistic?\n\nFor Solana to hit a price target of $260, a lot needs to go right. It needs to continue to chip away at Ethereum's dominance in key market niches, especially decentralized finance. It needs to convince more institutional investors that it really does have the potential to be an \"Ethereum killer,\" and it needs to innovate at a rapid pace, in order to attract new users and developers.\n\nThat being said, I'm extremely bullish on Solana going forward. The darkest days of the \"crypto winter\" now seem to be in the rearview mirror. Two years from now, I'm confident that we'll see Solana climbing to an all-time high of $260."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQN1JiTEUzOWkwMzNfekxzOE5IampEN1pNSnNWTW5jSk45NVRrdEk2RGx2RFA2Nzc1QlJvcjRERVp6cUNzUVBhOTYxazFHeEtVRlpUZjhFSjFvbXlqaU5jVmlwdS1qR29mOUUxQUh4MUYtZ2R3bzVqN1ZCUl82c2NmZllYZEJydHhMbjVsMHJkZ1ZOeXl3QkQ3QnNOVUFGWUxSc3dQQzNRV2M0NmxpY2RtZkpNQVbSAcIBQVVfeXFMT25zMTdEamQ0YXBiN2p6VVduRmxVU01hcnp3Z09jVHk5MTVTelYzSDBaZXF6MU4zdWQ3R0poTE9NbXNEU3B3Tzlhd3hPbGZQMGFyX0JURzJnNVk4OXAzcU1Cc0lQQmtjWEdDYlVNdjkwY1N3WWVLUWRORVQtV2F6bG14OFNweDhRUXV1bW8zSkJ6bHBYNG03c2pIazU1NFppLTF5Q0VWcmVGTG5pLTZEWXBfbS0zY3JRSmlzYWoyQWdfeGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Surges 1.19% Today, Reaching US$2,450 - Analytics Insight",
        "content": "Crypto News: Ethereum (ETH), the second-largest cryptocurrency by market capitalization, has seen a slight increase in its price today, reaching US$2,450. This represents a 1.19% gain. The current price of ETH is still below its all-time high of US$4,878.26, which was achieved on November 10, 2021. Since reaching its peak, the Ethereum price has dropped by about 53.02%. However, it is above its 50-day and 200-day moving averages, indicating a positive trend in the long term. The current market cap of ETH is US$295.2 billion, making it the second most valuable crypto asset after Bitcoin."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTFA1TXJDZGtkUUhCeGdJOFdSRzlxb05XZmlQTnNCTC1xMlJhandXaHlRUFZZT3oxSlpDNEtaa0g4Z0I0TDZXS2xQRlpMLXpkdVpDT0cxZ2E5ekdhNTBKOWNHUGlBQkl1ZnBSTWk1ZlZWYzEydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Should You Invest In PIXEL? - Bitcoin Market Journal",
        "content": "I spent the morning playing a video game.\n\nWhile I wasted a lot of time, I did earn some Popberries. And I learned a little something about the new generation of play-to-earn (P2E) games.\n\nPixels is a P2E game similar to the classic farming game Stardew Valley. It’s an open world where you develop plots of land, farm various crops, then buy and sell your crops in marketplaces to obtain more exotic items and skills.\n\nLike real farming, it’s a lot of work.\n\nThe “work” comes from spending a lot of time in the game. Like, a lot. You’ve got to plant seeds, water them, wait for them to grow, harvest the fruits, take the fruits to the town square, sell them, buy more seeds, and repeat. (And that’s just the farming.)\n\nYou can always buy your way to faster farming, but if you want to start from the beginning, get that index finger warmed up, because you’re going to spend a lot of time clicking.\n\nI got interested in Pixels when I read they were doing a cross-promotion with Binance, as Farmer Barney kept reminding me every time I talked to him.\n\nBinance is allowing users who stake their crypto in Binance Launchpool to earn PIXEL tokens, which can be used to buy stuff within the game … and which may go up in value as the game grows more popular.\n\nWhat I wanted to know: Should I invest in PIXEL?\n\nP2E Games: How They Work\n\nP2E games reward players for their time and effort in the game. You defeat monsters, complete quests, or (in the case of Pixels) farm several thousand acres of Popberries.\n\nIn return for your work, you receive some kind of in-game token, which you can often sell outside the game on crypto exchanges.\n\nThe P2E market is rapidly growing, with billions of dollars invested in 2023. Some games – like Axie Infinity and Decentraland – have seen significant token price appreciation, attracting players who want to make money.\n\nOn the other hand, the market is also volatile. Many games struggle to retain players long-term, especially since the perceived value is based on the token price, not on how much fun it is to play.\n\nThere are currently about 1,000 P2E games, with over a million daily active users, according to DappRadar. The top games, like Axie and The Sandbox, have market caps worth over a billion dollars, according to CoinMarketCap.\n\nIt is tempting to write off P2E games as another weird crypto thing, like memecoins. But I think there is something more at play. As Chris Dixon said, “The next big thing will start out looking like a toy.”\n\nIf you think of the underlying technology behind P2E games being something more like redeemable reward points, it is an extremely valuable innovation.\n\nYou can see brands like Starbucks or Marriott “rewarding” customers for completing certain “quests,” like ordering new menu items or staying at a collection of properties – all using blockchain-based rewards points.\n\nThat’s not so different from a P2E game, except that games currently have to do it at scale, with thousands or even millions of players making real-time transactions 24/7. And most blockchains are not built to handle that.\n\nWhich is where Ronin comes in.\n\nRonin: Scaling P2E Games on Ethereum\n\nCreated by the team behind Axie Infinity, Ronin was developed as a sidechain to Ethereum (though not technically accurate, it’s easiest to think of it as a Layer-2 solution).\n\nThe goal of Ronin is to make transactions faster and cheaper than working directly with Ethereum. Gas fees are significantly lower, making gameplay more affordable.\n\n(If you’re wondering why you wouldn’t just build your game on a faster Layer-1, building on Ethereum gives you access to everything built on Ethereum. For example, Pixels allows you to bring in your Ethereum-based NFTs into the game as playable characters.)\n\nOf course, Ronin also has its own token, RON, which saw a lot of hype at launch, then promptly crashed to pennies before recently seeing a significant uptake after Pixels announced their deal with Binance:\n\nI feel the same way about RON that I do about every other Layer-2 solution. I don’t know which of them will win, or if they’ll even be needed in the long term. Investing in L2s is like a bet-on-a-bet: you have to bet on Ethereum as the winning L1, then Ronin as the winning L2.\n\nWhy not just simplify, and invest in Ethereum?\n\nAfter all, any value that is generated by any P2E game built on Ethereum will accrue to Ethereum. Every Ethereum game means more Ethereum wallets, more Ethereum users, and a bigger Ethereum ecosystem.\n\nThe easiest way to invest not just in Pixels, but every Ethereum-based P2E game, is just to buy and hold ETH. It’s like an index fund in the entire Ethereum ecosystem.\n\nLess Payola, More Playability\n\nIf you’ve got the time and curiosity, play a bit of Pixels. Unlike most blockchain apps, it works right out of the box, directly in your browser, with no complicated setup. The usability is something every blockchain developer should strive for.\n\nOn the other hand, I kept running into limitations in the game where it wanted me to buy bigger plots of land, or NFTs, or access to a VIP room in the “sauna” area:\n\nTo me, traditional games like Fortnite strike the perfect balance between fun and money. Fortnite is free to play, and you can use the default characters forever. But if you want to upgrade your character, you buy V-Bucks (with real dollars), which is Fortnite’s revenue stream.\n\nUpgrading your Fortnite character is more about the flex. It doesn’t give you new skills, or make the game run any differently. Playing as Iron Man or a giant banana is just more fun. And that is worth paying for.\n\nI get the appeal of Pixels, but if I’m playing a game, I still want less commerce and more fun. Less payola, more playability.\n\nInvestor Takeaway\n\nI’m a huge believer in the potential of these games – not just as games, but as reward mechanisms for any company that wants to incentivize customers to do something (try a new product, take a test drive, or use new features or products).\n\nBut for my money, ETH is still the best investment of all. If P2E games hit the mainstream, ETH will be the real in-game reward.\n\nHealth, wealth, and happiness,\n\nJohn Hargrave\n\nPublisher, Bitcoin Market Journal"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE40cktvYXRzTEVXaVBiQm5ERTc3M0t3QUtSWTVkUUlfaDlTalVPZVdUU2g0akZsNDZUWW9vLVRKaERsQ2NJZFlUWUJuQmhjVmo5SV85ODdaNnJtN3plcHR6NHNYZHFhcGU3S2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "[Web3 Interview Series] How ETH63 Intends Drive Ethereum Growth in the Philippines - BitPinas",
        "content": "Editing by Michael Mislos\n\nWith the Ethereum Foundation’s flagship Devcon event set in Southeast Asia, the Philippine-based group ETH63, supported by the foundation’s Road To Devcon (RTD) Grants, is gearing up to host the inaugural Ethereum Meetup Manila 2024 on February 24th. This meetup aims to boost awareness and deliver educational insights into the Ethereum network, encouraging greater understanding and participation among the local community.\n\nFor this interview, BitPinas sat down with Paolo Dioquino and Christine Erispe to learn more about ETH63’s upcoming meetup and goals in the Philippines.\n\nWhat is ETH63?\n\nETH63 is a community initiative that emerged in the latter part of Q4 last year. The name combines Ethereum’s ETH and the Philippines’ country code +63.\n\nPaolo Dioquino, Core Member, ETH63\n\nWhile not the first Ethereum community to have been founded in the country, as previously mentioned, this is the first one with official support from the Ethereum Foundation.\n\nAdvertisement\n\nIn the interview, ETH63 core members Dioquino and Erispe, known in the community as Rightside and 0xDanki respectively, recounted the initiative’s origins. The idea, sparked by friends like Anton Buenavista of Pendle and QZ of ETH Singapore, aimed to highlight the Philippines for Devcon 7—now known as Devcon Southeast Asia. (Note: Dioquino is also part of Pendle, leading Growth.)\n\n“Now we join in because they were looking for representatives per region in Southeast Asia to create a community in preparation. It was an interesting idea so we grouped together. I invited over different like-minded people []—Danki, me, Jaydee, and Luis— to build this forward.” Paolo Dioquino, Core Member, ETH63\n\nDioquino is referring to Jaydee Rebadulla, Director at Lycaon Creatives, and Luis Buenaventura of GCrypto, who is also a regular BitPinas contributor.\n\nEthereum Meetup Manila 2024\n\nThe meetup, as Dioquino and Erispe highlighted, is the first tech-focused community gathering for Ethereum enthusiasts in the Philippines, designed to increase awareness and serve as a platform for networking, learning, and sharing insights.\n\n“We aim to spark wider interest about Ethereum by bringing in people who are actually involved and very passionate about Ethereum. And what we hope to achieve by the end of the event is to just gather people who might be interested to build, who might be interested in knowing more about the technology.” Christine Erispe, Core Member, ETH63\n\nThe ultimate goal, they shared, is to cultivate broader interest in Ethereum and encourage individuals to explore opportunities within the ecosystem.\n\nWho will be and what to expect at Ethereum Meetup Manila\n\nKeynote speeches and panel discussions will feature Web3 leaders, including ETH63 core members, alongside figures from the Ethereum Foundation and other notable entities. The meetup aims to unite Ethereum developers and enthusiasts, fostering a collaborative environment for growth and innovation.\n\nSpeakers include Buenaventura, Dioquino, Ken Arthur Bassig of Magnus Capital, Isabella of Router Protocol, and Ethereum Singapore’s QZ.\n\nRoad To Devcon (RTD) Grant\n\nThe RTD Grant aided ETH63 in kickstarting the upcoming meetup, the core members shared.\n\n“Applying for a Small Grant in RTD gives us the opportunity to actually be supporting Ethereum and to actually be the bridge from Ethereum Foundation towards the Philippines. Now, it gives us a certificate or representation that we are here to actually provide value for [] the Philippines.” Paolo Dioquino, Core Member, ETH63\n\nErispe added, “It’s not just about the funding we got from Ethereum, the biggest thing about it is the connections. Through being granted by RTD, we got connected [with] the rest of the Ethereum community in Southeast Asia and beyond and I think that’s the most important thing. We got the help and representation we need for the Philippines []to actually make this happen.”\n\nChallenges in the space\n\nChristine Erispe, Core Member, ETH63\n\nHighlighting education and awareness, Dioquino emphasized the steep learning curve for newcomers in understanding blockchain and cryptocurrencies\n\n“If you want people to get educated you have to give them… make them aware of what’s happening in the space, right?” he commented.\n\nOn the other hand, Erispe pointed out the need to shift the local blockchain community’s mindset from being consumer-oriented and profit-driven to recognizing blockchain’s broader societal benefits.\n\n“Blockchain offers more than just profits; it offers the decentralization, data ownership, maybe even something as big moving parties who wouldn’t otherwise collaborate in a trustless manner… I think that’s one of the blockers, we need to change how people think about blockchain.” Christine Erispe, Core Member, ETH63\n\nWhat’s next for ETH63?\n\nLooking forward, ETH63 plans to leverage partnerships with local brands and media for broader exposure and is exploring collaborations with educational platforms for crypto-related education. The vision is to evolve into a decentralized community that supports Ethereum’s growth in the Philippines.\n\n“If anyone is interested to learn more (about Ethereum) we are the square one. We are the first community they go. I also see ourselves spreading across different people. It’s not just us. They don’t even need to officially like interact with ETH63, if they are interested with Ethereum then they’re already part of the community. So that’s how I see us. We’re pretty much decentralized.” Christine Erispe, Core Member, ETH63\n\nUltimately, they hope to cultivate widespread interest and engagement in the Ethereum ecosystem across the Philippines.\n\nETH63’s Ethereum Meetup Manila is happening this February 24, 2024.\n\nThis article is published on BitPinas: [Interview] How ETH63 Intends Drive Ethereum Growth in the Philippines\n\nDisclaimer:"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPcVd5VllXd3lUM0l2ako3dDhVQWszNGJndVRHMGFWdVNyYm4wUHFZbkhJdldZSmFMOEh5anlKTmIzVi1HQzRlTTdpMWRaSFF1NmNnM1d2RDlUSUlaM19QMmR4RVAtWmgybDhXZHhtbjFYQ2VaNUpCR1U0bkNyeXdvcGJEVXJwUkRf?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Analysis: Predictions for Next Week - ICO Desk",
        "content": "Ethereum Price Analysis: ETH’s recent momentum is the highly anticipated Dencun upgrade\n\nEthereum Price Analysis: Ethereum, the second-largest cryptocurrency by market capitalization, has been the subject of considerable attention in recent days due to its price dynamics and upcoming developments. As of the latest data, Ethereum is trading at $2,450.98, with a 24-hour trading volume of $11,271,429,834 and a market capitalization of $294,438,478,059. Over the past 24 hours, ETH has experienced a positive growth rate of 1.19%, reflecting bullish sentiment among investors.\n\nOne of the key factors driving Ethereum’s recent momentum is the highly anticipated Dencun upgrade, which introduces proto-danksharding, a feature outlined in Ethereum Improvement Proposal (EIP) 4844. This upgrade is poised to significantly enhance the functionality of layer-2 networks, such as Arbitrum, Optimism, and Polygon, by introducing an additional data field called a blob. The implementation of proto-danksharding is expected to increase transaction bandwidth for layer-2 solutions without extending processing timeframes on Ethereum’s main network.\n\nDevelopers have hailed the Dencun upgrade as one of the most significant advancements since the activation of staked ETH withdrawals following Ethereum’s transition to a proof-of-stake model, known as The Merge. The proposed deployment date for the Dencun upgrade is Mar. 13, pending any unforeseen delays. Successful deployments of the upgrade have already been witnessed on major Ethereum testnets, including Goerli, Sepolia, and Holesky.\n\nIn addition to the Dencun upgrade, another potential catalyst for Ethereum’s price rally is the approval of a spot ETH exchange-traded fund (ETF). However, regulatory bodies such as the U.S. Securities and Exchange Commission (SEC) have postponed decisions on ETH ETF approvals until May. Moreover, individual commissioners have expressed differing opinions regarding the classification of Ethereum and similar assets.\n\nAs the Ethereum ecosystem evolves and new developments unfold, the cryptocurrency community eagerly awaits further insights into the impact of the Dencun upgrade and the potential approval of an ETH ETF. Traders and investors should monitor these developments closely as they navigate the dynamic landscape of the cryptocurrency market in the coming week.\n\nIf Ethereum’s Dencun upgrade progresses smoothly and gains widespread adoption among layer-2 networks, it could fuel bullish sentiment in the market. Positive feedback from developers and increased efficiency in Ethereum’s ecosystem may lead to a surge in demand for ETH, driving prices up by up to 10-15%. However, if Ethereum encounters technical challenges or delays during the implementation of the Dencun upgrade, investor confidence may wane, leading to a decrease in demand for ETH."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOY0RpU0dJdFNUeE9iQVZrTTZQaFpRRlRqZlZ0SW9kd3FZdW82SHBKZmFsOHB6dW1fOWEwanA5NllBVXQzeFdIUlE5ZkNCZF9tZmZOZ09PZ0xHanZZRXltWjNfYXFQUTRhT2NITkpsOWVrU2RDTjkxc0RFZGlhc0xSS05HMFhZRUt3RzRKQ0dlLUJkdmY3MFlGQmhWRkR0T29GZlhqMFpPOGJrLWhUd3pLanpoNUxWd9IBuwFBVV95cUxQaGJTb0czdnlXUld4RHNqVnUxLTRFRVFETWQ3Zk81NXJMUFdpSU13dWNvU2ZncDdra3plTlJxRE5OZlNHd3NHR2lXOHJPTFFEMEZrSU9yZXRoVWRidGtkc19IOE82T1JBNDV0VW5PeXVnMDl1dFI3ZG1ZZWJHUTVoYmY1eHlFcmotQm1EYTVBcmloMUVuZTBQam50OFZ5MFRUVldocU5MY1RrWnlSSEVYMmtVUm1qQ1BwZjEw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Feb 2024 08:00:00 GMT",
        "title": "Crypto Drama Unfolds: Ethereum Co-Founder’s 22,000 ETH Transfer Sparks Price Speculation - NewsBTC",
        "content": "In a recent development, Ethereum [ETH] co-founder Jeffrey Wilcke’s wallet has made a notable deposit of 4,300 ETH to a cryptocurrency exchange.\n\nThe deposit made by Wilcke amounts to 22,000 ETH, valued at approximately $41.1 million at the time. With Ethereum’s current price standing at $2,500, this deposit has injected renewed interest and excitement into the market.\n\nEthereum Co-Founder Transfers 22K ETH: Impact On Price\n\nDespite this substantial deposit, the overall trend of Ethereum’s netflow remains unaffected. This deposit comes after a considerable hiatus, with the last recorded transaction from this wallet dating back to June 2023.\n\nSource: Lookonchain/X\n\nAccording to an analysis of the Netflow metric on CryptoQuant conducted by NewsBTC, there has been a continued outflow of ETH from exchanges. In fact, more than 9,800 ETH left the exchanges at the end of trade on February 10th. However, it is worth noting that the previous day witnessed a significant inflow of over 75,000 ETH.\n\nRelated Reading\n\nShiba Inu On Cusp Of Lunar Launch As 1.3 Trillion SHIB Barrier On Crosshair 7 months ago\n\nIn the midst of these market movements, Ethereum’s price has been on an upward trajectory over the past three days. As of the time of this report, ETH is trading at over $2,500, indicating a strong positive trend.\n\nEthereum Bulls Gain Momentum: $3,000 Milestone?\n\nThe Short Moving Average and Relative Strength Index (RSI) further validate this bullish sentiment. The RSI has crossed the 60 mark and is moving towards the overbought zone, while the price remains above the yellow line, acting as a support level.\n\nFurthermore, Ethereum has been making waves in the crypto world, surpassing even Bitcoin and signaling a robust bullish trend. All eyes are now on ETH, with growing expectations that it may soon hit the $3,000 milestone.\n\nEthereum currently trading at $2,501.5 on the daily chart: TradingView.com\n\nSpeculation is also building about a potential climb to $5,000, with rumors circulating about an upcoming upgrade referred to as “Dencun” next week. However, it is important to note that information regarding this specific upgrade is limited, and further research is required to verify its impact on Ethereum’s potential price surge.\n\nAs the market eagerly anticipates the future trajectory of Ethereum, investors and enthusiasts are advised to exercise caution and stay informed. Tracking official Ethereum community channels, developer blogs, and reputable cryptocurrency news sources will provide valuable insights into the latest developments and upgrades affecting ETH’s price movements.\n\nRelated Reading\n\nWilcke’s recent deposit, combined with Ethereum’s positive trend and the anticipation surrounding the rumored Dencun upgrade, has created an atmosphere of excitement and speculation within the cryptocurrency market. With ETH surpassing Bitcoin and eyeing new all-time highs, the future of Ethereum holds immense potential for investors and traders alike.\n\nFeatured image from Adobe Stock, chart from TradingView"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOeG84eVdBY3hMMEFLTzRsZ2ZXQjE5WVowZmxtRzBmcjN5QU0yUmQxRXlVUGlaQXVVZS1RUGM1WUxkNEh6SGk3VlczejdaTTdncHJTMTNNSEtPR3UtOFpNS0t6Zk01YUNYR2JuSGxxVW5JSEN1b3JLZkdoVFprNkx6MmI1bmp5VWVUVUViLWo0MmhKaDNaQklLNHR30gGeAUFVX3lxTE9ad2pBbnFEQkVSeEZPQk1USmZkSHpYZy1QRi1pWHVkdjQ0V1E4TEtHYWdSWHgtaHV1RFFhX3VQMFJ2c2I3dXNQTGNiMTFHSzJ4eUE4MUJHOTlVSEh1bFFCaVBXM0k0THFhUHpIWU1DbGJNWHU0aE1ZbjRObUw2NEVhRmRjTk1tSWRvRFlldnVEa1F0X2I2NDJjVnpEQUpB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Here’s How High AI Thinks ETH Will Go After the 2024 Bitcoin Halving - CoinCodex",
        "content": "Ethereum Price Prediction: Here’s How High AI Thinks ETH Will Go After the 2024 Bitcoin Halving\n\nKey takeaways:\n\nEthereum price is forecasted to surge over +82% in the next 6 months to around $4,496 following the 2024 Bitcoin halving based on historical patterns.\n\nEthereum has historically performed well after previous Bitcoin halvings, with gains of 1.8% after 2016 and 88.6% after 2020\n\nUpcoming protocol upgrades like the EIP-4844 or proto-danksharding are expected to enable Ethereum to scale from 15 TPS initially to an estimated 1,000 TPS.\n\nExperts remain bullish on Ethereum's future, with price targets as high as $15,000 by the end of 2024. The ongoing developments make ETH well-positioned for the next crypto bull market.\n\nEthereum Price Prediction: Here’s How High AI Thinks ETH Will Go After the 2024 Bitcoin Halving\n\nRecently within the crypto space, all eyes are on the highly anticipated 2024 Bitcoin halving event. The upcoming halving is expected to usher in a new crypto bull market and have wide-reaching impacts across the industry. According to our algorithm, one digital asset poised for enormous growth following the 2024 halving is Ethereum.\n\nIt's not news that Ethereum is the second-largest cryptocurrency after Bitcoin, with a current market cap of over $200 billion. Powering billions in decentralized finance (DeFi) transactions, the digital asset has firmly established itself as the leading smart contract platform.\n\nOur algorithm has forecasted that Ethereum could surge over +82% in the next 6 months to achieve a new high price of $4,496 following the 2024 Bitcoin halving. This bullish outlook is based on several key factors outlined below.\n\nThe Bitcoin Halving Cycle\n\nFirst, let's review the Bitcoin halving and its historical effects. Bitcoin's code was designed to cut the block reward for miners in half every 210,000 blocks, or approximately every 4 years. This halves the supply of new Bitcoin entering circulation.\n\nThe first halving was in 2012, the second in 2016, and the third in 2020. After each halving, Bitcoin has seen a dramatic surge in price over the following 12-18 months. For example, Bitcoin rose over 8,000% in the year after the 2012 halving.\n\nThis pattern has held true over the last decade, with each halving igniting tremendous momentum. Most industry experts anticipate the 2024 event will kick off Bitcoin's next major bull run. This macro tailwind could also lift prices across the crypto sector, including Ethereum.\n\nEthereum's Price Performance After Previous Halvings\n\nAlthough a relatively new asset, Ethereum already has an impressive track record following Bitcoin's halving cycles.\n\nHowever, Ethereum was launched in 2015, so it wasn't around during the first Bitcoin halving but experienced the second halving in 2016. At that time, ETH was trading around $11. In the year following the halving, Ethereum's price surged a bit by 1.8% to around $11.7.\n\nThe second halving occurred in 2020, with ETH trading near $211. Over the next 3 months, Ethereum climbed over 88.6% to its all-time high above $398\n\nThis data shows Ethereum has benefited from the increased crypto activity surrounding past halvings. Even modest percentage gains would boost ETH significantly from today's price of approximately $2,426.\n\nRecent Developments Strengthening Ethereum's Outlook\n\nBeyond historical patterns, Ethereum's tech improvements and adoption metrics point to a very bullish future.\n\nIn September 2022, the Ethereum blockchain underwent its largest upgrade ever, called the Merge. This transitioned Ethereum from an energy-intensive proof-of-work consensus to a much greener proof-of-stake consensus.\n\nThe Merge paves the way for massive scaling upgrades like sharding. Lower fees and faster speeds which made Ethereum more usable for global mass adoption.\n\nAdditionally, developers are working on implementing EIP-4844, also known as proto-danksharding. According to a report, the upcoming upgrade will introduce a new transaction type that can carry blobs of data. By attaching this additional data to blocks, EIP-4844 will increase throughput from 15 TPS to an estimated 1,000 TPS initially.\n\nFull danksharding based on EIP-4844 is expected to scale Ethereum to over 100,000 TPS, according to researchers. This major protocol upgrade demonstrates the ongoing innovation of Ethereum developers to meet the demands of global adoption.\n\nEthereum retains its dominance in crucial areas like non-fungible tokens (NFTs), stablecoins, and decentralized finance (DeFi). Billions of dollars worth of value flow through Ethereum dApps daily, indicating the network's maturity.\n\nMajor multinational corporations are also launching Ethereum-based initiatives, further demonstrating its advantages as an enterprise blockchain solution.\n\nExpert Price Predictions Support Ethereum's Outlook\n\nIn addition to AI forecasts, expert analysts in the crypto space also view Ethereum very favorably ahead of the 2024 halving.\n\nIn a recent report, JPMorgan analysts set a bullish target for ETH in 2024, saying, \"While we are cautious on overall crypto markets into 2024, we are looking for Ethereum to outperform bitcoin and other cryptocurrencies next year helped by the forthcoming EIP-4844 upgrade or Protodanksharding”.\n\nFinally, Crypto YouTuber and analyst Lark Davis predicts Ethereum could reach up to $15,000 by the end of 2024 and make a lot of people millionaires through Ethereum Layer-2-2assets.\n\nEthereum Will Make Millionaires In 2024, BUT Not How You Think pic.twitter.com/00YCLPyGCl — Lark Davis (@TheCryptoLark) December 25, 2023\n\nBottom line: The Key Takeaway on Ethereum's Future\n\nWhile short-term volatility in crypto markets will continue, the long-term outlook for Ethereum appears decisively bullish. Driven by the 2024 Bitcoin halving, ongoing technological progress, and maturing global adoption, Ethereum is firmly on the path toward capturing greater value."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxORDZZeHlrVi1jWjM5R244UVF4SWlVLU5IZnRBRl9oalo1Vlg2ZG5rVVI3STNRc3lFT09tQnZhdEZSbkpPRGF2dW9oWFZPQkhkTlJIZjl5UTU0S1Z1UEhGX3UyZk56NVRwMENMY2xIS0hHckx5a1ZWREFYVHFGcFJsdGROWU0xbVFnRzFVYVdsRGVVcERsVE13V19n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Bullish Bets on Ethereum: Major Upgrade Ignites $27,000 ETH Price Predictions - Coinpedia Fintech News",
        "content": "Zameer is a financial analyst and writer with a particular interest in cryptocurrency markets. He has been studying cryptocurrencies and their market behavior for several years and deeply understands the factors that affect the price of cryptocurrencies. His expertise lies in his ability to use both technical and fundamental analysis to make informed predictions about the future direction of cryptocurrency prices. He has a strong understanding of market sentiment and uses this to inform his trading decisions and price predictions.\n\nStory Highlights Dencun upgrade (March 13th) aims to reduce fees and attract developers, potentially boosting ETH price.\n\nRyan Berckmans says ETH could reach $27,000 due to reduced selling pressure.\n\nAnalysts advise caution but expect a gradual recovery towards $2,000 by March.\n\nIn the world of digital currencies, Ethereum is currently making waves, surpassing even Bitcoin and indicating a strong bullish trend. All eyes are on ETH, with expectations running high for it to hit $3,000 and speculation building about a potential climb to $5,000, thanks to the upcoming Dencun upgrade next week.\n\nHowever, regulatory issues may delay the Spot ETH ETF, injecting a note of caution into the optimism.\n\nDuncan Upgrade: The Boost We’ve Been Waiting For!\n\nSet to go live on March 13, Ethereum is gearing up for the eagerly anticipated ‘Dencun’ upgrade. ETH developers confirmed this during their bi-weekly call, pinpointing the upgrade’s occurrence at slot 8626176, precisely at 13:55 UTC. While awaiting formal approval from developers and GitHub verification, the upgrade introduces “proto-dank sharding,” a clever solution to reduce transaction fees and make Ethereum data access more cost-effective, attracting developers to platforms like Celestia, Avail, and EigenDA.\n\nStaying glitch-free is key\n\nAhead of the Dencun upgrade, Ethereum developers are meticulously using testnets to simulate mainnet conditions, ensuring any glitches are detected and fixed efficiently. This precautionary step minimizes disruptions when the upgrade eventually rolls out to the public.\n\nRead More About the Upgrade: Cheaper Fees, Faster Future: Ethereum’s Dencun Upgrade is Nearly Here!\n\nWhat Experts Are Saying\n\nRenowned Ethereum investor Ryan Berckmans forecasts a substantial surge, predicting ETH could reach $27,000 in the upcoming bull cycle. He anticipates reduced selling pressure from miners post-upgrade, contributing to the potential price rally. Berckmans also factors in Ethereum’s scaling upgrades and considers the impact of the US presidential election on crypto prices.\n\nHistory to Repeat?\n\nDespite the bullish outlook, historical patterns suggest a potential short-term correction during the Dencun upgrade, reminiscent of the ‘sell the news’ event observed after the Merge event in September 2022. Analysts advise caution, yet they believe in a gradual recovery, with ETH possibly retesting the $2,000 level in March.\n\nAs Ethereum’s rally continues, investors are closely watching the unfolding drama of Dencun, eagerly anticipating the next chapter in Ethereum’s journey.\n\n“Do you think the Dencun upgrade will truly send ETH prices soaring?"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNZ3ZMZENHd3B4dXpFT2kwVkFiRkQ1VDF4RDNaWEU0SEtKMzh6OXlOdWxDcHlfQW1rMmNkNFVfbmxqRjlXb3dDT2drS3Z1ekN5MUtfTXpFT01TaU1feFlSQ3JZOHRxVTBFYkdTYmF4UEQyWlliaVBrbGMyRWV2UXhMNHRUZkFvaU8tbmVyU203VWRQUFhidlcxZ2tUbmwtYzNpVkZjLWV3WWhSNTNTQU52OA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "COTI Achieves Critical Privacy Milestone for Ambitious Ethereum L2 Upgrade - CoinCodex",
        "content": "Key Takeaway\n\nCOTI achieved a major development milestone by successfully integrating MPC protocol into its upcoming COTI V2 architecture.\n\nMPC enables private computation on sensitive data, providing privacy benefits needed for enterprise/consumer adoption.\n\nCOTI's MPC implementation distributes encrypted user data across endpoints that collaboratively compute results.\n\nThe integration of MPC lays the groundwork for COTI V2's enhanced privacy, security and compliance capabilities.\n\nCOTI V2 aims to leverage technologies like MPC and zk-Rollups to maximise performance, scalability and privacy on Ethereum Layer 2.\n\nCOTI, a digital payment network looking to upgrade into a privacy-focused Layer 2 on Ethereum, recently achieved an integral milestone that advances its development roadmap.\n\nAfter months of work, COTI successfully completed designing and integrating a multi-party computation (MPC) protocol into its upcoming COTI V2 architecture. MPC refers to a sophisticated cryptography technique that allows a group of parties to jointly compute results from private data without exposing the underlying data.\n\nThis privacy-preserving functionality will serve as a core component powering the COTI V2 network. By leveraging MPC, COTI V2 will enable developers to build decentralised applications that handle sensitive user information securely and competently.\n\nImportance of Privacy for Blockchain Adoption\n\nCOTI's push into MPC signals a growing focus on privacy across the blockchain industry. As enterprises and consumers look to leverage blockchain technology, concerns around data exposure have frequently arisen as obstacles to adoption.\n\nIntegrating privacy enhancements like MPC aims to remove these adoption barriers by proving blockchains can offer confidentiality guarantees comparable to traditional systems. The ability to compute sensitive information without compromising data could open up a wide range of valuable use cases.\n\nHow MPC Protects Data Privacy\n\nMPC involves distributing data inputs across endpoints controlled by different parties. These endpoints encrypt the data in a collaborative process that maintains confidentiality while still allowing computations to occur.\n\nIn COTI's implementation, user data gets submitted to MPC endpoints in an encrypted state. The endpoints run computational workloads on this data to produce outputs that may be public or encrypted for specific users. No single endpoint ever has full access to the plaintext inputs or sensitive intermediate data.\n\nCOTI relied on advanced cryptography, like garbled circuits, to realise this complex choreography. These one-time executable structures translate pseudo-contracts into encrypted computational blueprints. After use, the garbled circuits get destroyed to prevent potential misuse.\n\nIntegrating MPC into the COTI Tech Stack\n\nCOTI's push into MPC highlights the technology's growing popularity as projects search for \"best of both worlds\" solutions that merge public blockchains and private data. MPC unlocks this hybrid model through its mathematical assurances of data confinement during off-chain computations.\n\nThe company emphasised that this milestone is only the first of many on its stacked development roadmap for 2023. COTI plans to share more updates as work progresses on other components, like its extended EVM module and revamped staking model.\n\nThe scope of upgrades in the works signifies COTI's ambitious vision for its Ethereum L2 rollout. By zeroing in on features like MPC and zk-Rollups, the project aims to offer users some of the highest performance, scalability, and privacy available on Layer 2.\n\nCOTI first emerged in 2017 as a fintech-focused payments network built on its own bespoke blockchain. Its native token currently boasts a market cap of over $150 million.\n\nThe pivot to an Ethereum sidechain optimises COTI's positioning and technology stack for the maturing Web3 landscape. It also opens up integration opportunities with the thriving DeFi and NFT ecosystems on the Ethereum mainnet.\n\nThe road to COTI V2's launch remains long and challenging with its intense development schedule and demanding requirements. However, progress like the latest MPC milestone provides promising indicators that the team's lofty architectural ambitions can materialise into reality."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBXY3NYUThFbzU4NjRFME9BblVqZUhrZk9aY1ZCWXJLbzE2RWpoMFhsT1dVSkNxU2F2MVlIdk9CM2hfZnRmS0Y3UV9YUExHZmIwSkthLUNUNUJDVlRoN2RudV9xWEVFTVFzZFVTQ0hPTVdVU3NXSGVZRzl4Y0xZQdIBgwFBVV95cUxNY2I2cnZ4bkR0Ni1YM0pHeUtFZGU1NktLWnNCZV9BN3RZQURHNHBpV1NYdGdmM3dWRWpBMkRmcG0yNlhhSTNIRzRIVWJLUk95VmEzbVd1bnlHTF9rcUlBRTVTR1B4bk1UTWllT3RaVkRVUEhhM00zVzhhZ01WOGNoV1V3WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Might Dip 10% Ahead of Dencun Upgrade Mainnet Launch - CoinChapter",
        "content": "Dencun upgrade\n\nYEREVAN (CoinChapter.com) — Ethereum (ETH) could lose 10% of its market valuation ahead of the Dencun Upgrade Mainnet launch in March 2024, based on several technical indicators. However, before diving into the Upgrade news, let’s look at the charts.\n\nETH Charts Bearish Despite Dencun Upgrade\n\nThe Ethereum daily chart indicated that ETH has been trading within a rising channel since June 2022. The channel features two parallel rising trendlines that enclose the price action by connecting swing highs and lows.\n\nThe channel does not predict a bias after the token leaves the formation. However, if the setup remains relevant, it could be instrumental in predicting short-term price fluctuations. ETH broke the channel’s resistance on Jan. 10, possibly based on the spot Bitcoin ETF euphoria. However, the bulls failed to hold the altitude, and ETH fell back into formation.\n\nEthereum (ETH) price. Source: TradingView\n\nOn Feb. 9, ETH/USD approached the resistance again. Thus, the coming sessions would determine if the leading altcoin can break above the trendline confidently. If ETH retests the resistance, the likely target will stand near $2,200, a 10% drop from the current value.\n\nAdditional Bearish Factors Could Tank ETH\n\nThe chart above also points to a relative strength index (RSI) divergence. In detail, the RSI is a gauge of the most profitable market entry and exit points based on investor expectations. An RSI divergence is a dissonance between the indicator and the price action.\n\nWhile the Ethereum coin price printed higher lows, the RSI, conversely, insisted on lower lows, creating the mentioned divergence. It is considered to be a strong hint of a looming decline. The RSI divergence also backs the channel’s short-term bearish prediction.\n\nEthereum Dencun Upgrade Coming in March\n\nOn Feb. 7, the Dencun Upgrade launched on the last testnet, Holesky. Ultimately, Ethereum’s core developers have set a launch date for the Dencun upgrade on the mainnet.\n\nTim Beiko from the Ethereum Foundation revealed that the upgrade will activate at slot number 8626176, with an anticipated rollout on Mar. 13, 2024. Additionally, Beiko shared on X that the upgrade will bring in blob transactions and transient storage features.\n\nIn detail, the Upgrade focuses on enhancing Ethereum scalability, security, and efficiency. It comprises two parts, Deneb and Cancun, spread across nine Ethereum Improvement Proposals (EIPs).\n\nSeveral EIPs, including the mentioned EIP-4788, 6780, and 7514, focus on enhancing security at both the user application and consensus levels. Also, several proposals aim to improve the stakeholder user experience and block confirmation times.\n\nFor example, EIP-7044 makes voluntary exits in delegated staking perpetually valid, and EIP-7045 extends the time for validators to submit attestations.\n\nThe Dencun upgrade is a part of Ethereum’s long-term development strategy, particularly its “Surge” phase, aiming to scale performance to 100,000+ transactions per second (TPS). It continues Ethereum’s evolution following the Shanghai hardfork and is crucial in establishing Ethereum as a scalable, decentralized, and globally accessible settlement layer.\n\nEthereum Dencun Upgrade on the Roadmap. Source: gsr.io\n\nThe team initially planned the upgrade for late 2023 but rescheduled it for 2024 due to deployment and consensus issues. The final dates for public testnets were:\n\nGoerli: Jan. 17, 2024\n\nSepolia: Jan 30, 2024\n\nHolesky: Feb. 7, 2024\n\nAs mentioned, Ethereum plans for the mainnet launch on Mar. 13, 2024. However, the date could be subject to change."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE96WFUxaGlOYVZSeHFxekRHcE9HOXgzYVQwdmlJWkJDZV9kMllVVU9SY0ZXd0Ryb1EwYjJVTnFJenZYVUoyZ1NkTkNEVEt4QW5MZU92dnpEYUp5OS1CQTVuSlNoVmpGaTZPQk0w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum’s Upcoming March 13th Upgrade to Make L2s Much Cheaper and Faster - Coinfomania",
        "content": "Ankr , one of the world’s leading Web3 infrastructure providers, today announces that it has become one of the first RPC (Remote Procedure Call) providers to Aptos, a safe and scalable Layer-1 blockchain. Developers can now access Aptos Testnet Community and Premium RPCs, make request calls, and receive information returns that mirror the results they would get by running an Aptos full node by themselves.\n\nThe partnership will enable developers to build safe, scalable, and upgradable dApps on top of the Aptos blockchain. Following this partnership, Ankr is now an RPC provider to 19 blockchains including Ethereum, BNB Chain, Solana, Polygon, and Avalanche. An RPC enables various applications to interact with the blockchain.\n\n“Ankr is excited to be an early supporter of Aptos with an RPC that now makes it easy for all developers to start building on the ecosystem. This is just the beginning of Ankr’s products for the blockchain that will doubtlessly attract more demand ahead of the much-anticipated mainnet launch.”\n\n-Josh Neuroth, Ankr’s Head of Product\n\nOnce the Aptos mainnet is live, Ankr will add support for it with additional docs, features, and tools to help Web3 developers streamline building. Aptos is the highly anticipated network that will bring new tech and scalability benefits to Web3. Developers building on the Aptos testnet have witnessed over 160,000 transactions per second (TPS), thanks to promising upgrades like their parallel execution engine, Block-STM.\n\nThe Ankr Network serves an average of 8 billion blockchain requests per day across more than 50 networks. It delivers time-tested and high-performance RPC node infrastructure to handle any request load, massively expanding Aptos’ public RPC resources.\n\nAnkr’s Aptos Testnet RPC (Remote Procedure Call) connects wallets, command-line interfaces, and dApps with the Aptos blockchain. It acts as a messenger or blockchain router that relays on-chain information between Aptos nodes, dApps, and ultimately end-users so they can execute necessary tasks like transactions, populate wallet balances, fetch ownership information, and more.\n\nTo strengthen the global Aptos network, Ankr is providing a geo-distributed and decentralized Aptos RPC composed of many independent blockchain nodes running worldwide for low-latency and reliable connections.\n\nDevelopers can make their first call to Aptos using Ankr’s RPC Service now. They can use the endpoint https://rpc.ankr.com/http/aptos_testnet/v1 to call the Aptos chain using the standard EVM JSON RPC methods.\n\nAbout Aptos\n\nAptos is a safe and scalable Layer-1 blockchain founded by Meta alumni. It is backed by a16z, FTX Ventures, Paypal Ventures, Coinbase Ventures, Binance Labs and other leading investors. With its mainnet launch on the horizon, Aptos promises to be a faster, more scalable and more secure blockchain than its existing competitors, thanks to its advanced programming language called Move. The Move language and resource model solves many performance and security issues found in most other Layer-1 protocols.\n\nFor more information, visit: Website | Twitter | LinkedIn\n\nAbout Ankr\n\nAnkr is building the future of decentralized Web3 infrastructure, servicing over 50 proof-of-stake chains with an industry-leading global node delivery system and RPC aggregator. Ankr currently serves over 2 trillion transactions a year across Web3 and is the leading infrastructure provider for BSC, Fantom, and Polygon chains as of 2022. Ankr also offers a suite of developer tools, including the Liquid Staking SDK, Web3 Gaming SDK, and AppChains As a Service, that empower dApp developers to build Web3 apps quickly and easily.\n\nDisclaimer: This is a paid press release. Coinfomania does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. Readers should do their research before taking any actions related to the company stated in the press release."
    }
]