[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPSkRlZ2JtVWd2NXBDajEwRkk0RnoteWZlTFBFWlhWRzU4UlNsdEJQY2JFeDFDR1BXSWszTHpUN1hOaE9fRVlhSVY5QTAwLUNRSmgydFd1MFpVMXlVcDUybXZJZ3NoMnhsOEk4SWhwVUloWVVyQmc5RFhqMmNZNVNqTElGNHFzdnVLdUFUM09aMjNTUlhUN19SZzJOM1ZyYndxNHEzR19KYk1WazZ4UG5MMm5n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 25 Feb 2024 08:00:00 GMT",
        "title": "Ethereum’s Whales Invest $500M in 48 hours –Here’s What to Expect - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9zU0t4MGFyZnhYdjItQkF3MDhSa3pVekpoSEVuZVl4TXNEZzJmT1VDLUlZcFByMzdFWlRCV1ZmenFVWW1fanc0SFJfWVZ1b3NHWTlueFY0MV8xY1RDMHNjUkVrM2wxVTNabVhmQmVlZkxhbzkxLTNkV3hxc0dBV28?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 25 Feb 2024 08:00:00 GMT",
        "title": "Up More Than 900%, Can Solana Really Steal Ethereum's Crown? - Yahoo Finance",
        "content": "One of the hottest debates in crypto right now is about Ethereum (CRYPTO: ETH) vs. Solana (CRYPTO: SOL). While the former remains the reigning champion of blockchain development, Solana is building considerable momentum to unseat Ethereum.\n\nDoes Solana have what it takes? Or will Ethereum cement itself as the home of decentralized development?\n\nThe answer is not straightforward, and there are several gray areas to consider. Let's look closer at the state of affairs between Solana and Ethereum to determine which cryptocurrency is a better investment.\n\nImage source: Getty Images.\n\nA little background first\n\nEthereum's launch in 2015 changed crypto forever. Its novel smart contracts meant developers could build blockchain-based applications, essentially making Ethereum the first programmable cryptocurrency. With this new functionality, non-fungible tokens (NFTs), stablecoins, yield farming, and many other aspects of today's decentralized finance (DeFi) economy could all be built.\n\nLike any technology, subsequent iterations eventually came along. Enter Solana. Given the title \"Ethereum killer,\" Solana arrived in 2019 and offered developers similar smart-contract capabilities, except with the added benefit of blazing speeds and low fees. As two of Ethereum's primary pinch points, Solana has become one of Ethereum's most formidable challengers.\n\nSolana starts to expand as Ethereum lags\n\nOver the past year, Solana experienced significant growth. After losing more than 95% of its value and falling to just $9 at the depths of the \"crypto winter,\" Solana has since rebounded to more than $100 today. This resurgence is likely fueled by growing momentum in the broader crypto market, as well as its flourishing ecosystem. A quick look at key metrics such as active addresses, total transactions, and total volume on the blockchain reveals that they are all near record levels and hint at a bright future for Solana, especially in this new bull market.\n\nThen there's Ethereum. While Solana has taken center stage, the original smart-contract blockchain has more or less watched from the sidelines. As Solana jumped more than 900% in 2023, Ethereum notched a modest 90% gain. Furthermore, while its blockchain remains one of the busiest in all of crypto, it has not seen an increase as impressive as Solana's. By most accounts, it looks like Solana is closing the lead that Ethereum has enjoyed over the last few years.\n\nEthereum's not standing still\n\nSolana's run over the past year has been nothing short of remarkable. But here's the harsh reality. There's still considerable room separating it from Ethereum.\n\nStory continues\n\nToday, Ethereum's total market cap is more than $340 billion. Solana's is just $45 billion. Then there's DeFi. Currently, nearly 60% of the total value within the DeFi economy calls Ethereum home. Solana makes up only 2.7%.\n\nIs it true that Solana is faster and cheaper to use? Absolutely. But this increased throughput isn't without trade-offs. To provide such capabilities, Solana's design makes known sacrifices in decentralization and security -- two crucial factors to consider when investing in cryptocurrencies.\n\nAs of last count, Ethereum has roughly 900,000 validators around the world. Solana comes in with around 2,000. In addition, Solana has become notorious for network outages. Over the last three years, Solana's blockchain has gone offline six times, with the most recent occurring in early February 2024. Ethereum's blockchain has never had such a lapse.\n\nThe shiny features that Solana touts will likely fade with time. It often falls on deaf ears, but Ethereum is not a finished product. With the most developers of any blockchain (and five times more than Solana), Ethereum is constantly improving and boasts an impressive roadmap outlining future upgrades that will make the blockchain more capable, faster, and cheaper to use.\n\nTake the Dencun upgrade as an example. Slated for implementation next month, Dencun will introduce new mechanisms that will enable Ethereum to process transactions through its expansive Layer 2 ecosystem at a much cheaper rate. Some estimates project that Dencun will reduce pesky gas fees by up to 10 times.\n\nBuilding a strategic portfolio\n\nNo blockchain is perfect, but some are closer than others. The case for an investment in Solana would be that it's still in its early days and has more room to grow. But with Ethereum, the investment thesis is abundantly more apparent. It still holds a stranglehold on DeFi. It has the most developers. It has a proven track record of functionality and is one of the most secure and decentralized blockchains in the world.\n\nI own both Solana and Ethereum. There are plenty of reasons to believe that Solana's network could keep growing, but it makes up a smaller portion of my portfolio as there is considerably more risk involved. Conversely, I have much more confidence in Ethereum over the long haul, so it receives greater allocation. For investors, the choice comes down to whether they prefer the new kid on the block or the seasoned veteran who has done this a time or two.\n\nShould you invest $1,000 in Solana right now?\n\nBefore you buy stock in Solana, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Solana wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of February 20, 2024\n\nRJ Fulton has positions in Ethereum and Solana. The Motley Fool has positions in and recommends Ethereum and Solana. The Motley Fool has a disclosure policy.\n\nUp More Than 900%, Can Solana Really Steal Ethereum's Crown? was originally published by The Motley Fool"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFBaRGJFTm90SU1FSFIzQXRuMUUwbkcyVzNHRzA1cWZ3YjAtUGlQR2wyMUY2R19fUi1VQzdYRGpCcG1rbmh1cEEtZ2ZNeWR1Z3ZXeWtXR1FpMjlvWUlpdGthMlctSVZpc0ppa2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "How Many Confirmations for Ethereum? - Crypto Head",
        "content": "Table of Contents\n\nDisclaimer: This is not a validation of cryptocurrency or any particular provider, service, or product. It should not be taken as advice to engage in trading or use any services. Please check our terms and conditions .\n\nQuick Answer: There are over 7,000 cryptocurrencies, with Ethereum being the second most popular after Bitcoin. Unlike other cryptocurrencies which function mainly as a store of value or medium of exchange, Ethereum’s blockchain allows for the creation of smart contracts and decentralized applications. Transactions on the Ethereum network are confirmed by miners who prioritize transactions with higher gas fees. The number of confirmations for a transaction can vary depending on the crypto exchange used, with different exchanges requiring different numbers of confirmations. Coinbase, for example, requires 35 confirmations for Ethereum, which typically takes around ten minutes. Binance requires 12 confirmations, also processed in under ten minutes, while Kraken needs 20 confirmations, which can take about five minutes. The number of confirmations for Bitcoin and other cryptocurrencies also varies by exchange. Generally, Bitcoin transactions are considered final after at least three confirmations, which can take about 30 minutes depending on the network congestion and transaction volume. Overall, the confirmation time for Ethereum and other cryptocurrencies is influenced by the chosen exchange, the transaction fee (gas), and the current network load. Users should select platforms with high transaction throughput for faster confirmation times.\n\nOn the cryptocurrency market, there are over 7,000 digital currencies, such as Ethereum (ETH), Bitcoin (BTC), Litecoin (LTC), Monero (XMR), Ripple (XRP), Bitcoin Cash (BCH), Cardano (ADA), EOS, Zcash (ZEC), and many others.\n\nNext to Bitcoin, Ethereum is the second most popular digital currency. However, unlike Bitcoin and other altcoins, Ethereum has been designed as more than just a store of value or a medium of exchange.\n\nThe Ethereum network is a decentralized and open-source computing network and operating system used for creating smart contracts and decentralized applications. Now, the question: how many confirmations does ETH need? Generally, ETH confirmations depend on the crypto exchange you are using.\n\nIn this article, we’ll explain to you how Ethereum works and how the confirmation is done. After we finish explaining this, we’ll be able to give you the number of confirmations you need for Ethereum for the three most popular exchanges.\n\nHow Many Block Confirmations Ethereum\n\nSame as Bitcoin and other digital currencies, Ethereum works on a blockchain network basis. A blockchain is a distributed, decentralized public ledger on which all the cryptocurrency transactions are recorded and confirmed.\n\nThe term distributed means that anyone who participates in the Ethereum network has an equivalent copy of the public ledger, which allows the participants to have an insight into all previous transactions.\n\nThe Ethereum network is decentralized due to the fact that it’s maintained and operated by all the holders of the distributed ledger and not by any centralized authority.\n\nMoreover, this network is secure because its participants use complex cryptography to verify and confirm the transactions. Ethereum is unique because its users can develop apps that run on the Ethereum blockchain, just like software runs on our computers. These applications allow users to deal with complex financial transactions or transfer and store personal data.\n\nHow Many Confirmations Does Ethereum Need\n\nEvery Ethereum transaction contains the wallet address of the receiver, the amount of Ethereum that will be transferred, the private key to authenticate the transaction, and the transaction fee that the sender will pay (called a gas fee).\n\nSimilar to how the Bitcoin network works, the Ethereum network also consists of miners or validators who confirm the transactions and select the one with the highest fee first.\n\nThis means that if the amount of gas is larger, the miners will put this transaction on the blockchain as a priority, and the confirmation time will be shorter. On the other hand, lower gas leads to more time for transaction confirmation. The number of transactions that are pending is available on Etherscan.\n\nOnce you send the transaction, the coins won’t be added to the block right away. Instead, they’ll be redirected to the transaction pool, a place where all unconfirmed transactions end up.\n\nThe Ethereum miners pick up a transaction from this pool, authenticate the particular transaction, and create a block. Afterwards, in order to add the new block to the blockchain, the miners have to solve complex math equations. When the miners resolve these math equations, the new block gets confirmed and attached to the blockchain.\n\nThe number of transactions that the miners can incorporate into the blockchain is limited due to the blockchain gas limit. Therefore, the Ethereum network can process limited blockchain transactions.\n\nAfter the miners attach a new block on the blockchain, they can collect their reward in cryptocurrency tokens. The tokens that are used on the Ethereum network are known as Ether. With these tokens, you can sell and buy goods and services.\n\nHow Many Confirmations for Ethereum\n\nThe number of Ethereum block confirmations appears to be undecided. The Ethereum white paper suggests that seven confirmations can be sufficient in order for one transaction to be confirmed, which should take about two minutes.\n\nHowever, Ethereum transactions are usually made through cryptocurrency exchanges, and the number of block confirmations that are needed depends on the cryptocurrency exchange that you are using.\n\nIn other words, each cryptocurrency exchange decides the number of Ethereum confirmations needed. This isn’t the case only with Ethereum, it’s the same for Bitcoin, Litecoin, ZEC, Monero, BCH, EOS, ADA, and other cryptocurrencies.\n\nLet’s take a look at the most popular cryptocurrency exchanges and the number of confirmations they require.\n\nHow many confirmations does Coinbase need?\n\nCoinbase supports over 50 cryptocurrencies, such as Bitcoin, Ethereum, Litecoin, and Dogecoin. For every one of these cryptocurrencies, Coinbase has a required number of confirmations:\n\nEthereum – Coinbase requires 35 confirmations, which takes around ten minutes;\n\nBitcoin – Coinbase requires 3 confirmations, completed in 30 minutes;\n\nLitecoin – 12 confirmations in 30 minutes;\n\nEOS – It requires only one confirmation which takes only one minute.\n\nBinance ETH Confirmations\n\nBinance also supports over 50 cryptocurrencies, and it’s well known for having some of the lowest transaction fees. Here are the number of confirmations that Binance requires:\n\nEthereum – Binance requires 12 network confirmations processed in under 10 minutes;\n\nBitcoin – It requires only one confirmation, which takes approximately 10 minutes.\n\nKraken how many confirmations?\n\nKraken is another reliable cryptocurrency exchange on the market. Same as Coinbase and Binance, Kraken supports a wide range of cryptocurrencies. Let’s see what the numbers look like here:\n\nEthereum – Kraken needs 20 confirmations and manages to process them in five minutes;\n\nBitcoin – It needs 4 confirmations that take 40 minutes;\n\nLitecoin – It needs 12 confirmations, and it takes 30 minutes;\n\nEOS – It doesn’t need any confirmation, meaning it’s nearly instant.\n\nFrequently Asked Questions\n\nHow many confirmations does a Bitcoin transaction need?\n\nA Bitcoin transaction needs at least three confirmations before it can be considered final. The number of confirmations needed depends on the network congestion and the amount being transacted.\n\nHow long is 12 network confirmations?\n\nThe length of 12 network confirmations depends on the blockchain protocol used. For example, Bitcoin uses 10 minutes for each block confirmation, whereas Ethereum takes around 15 seconds per block.\n\nHow long is 35 network confirmations?\n\nThe average number of blocks needed for a transaction to be confirmed on the Bitcoin blockchain is currently around 10 minutes. This means that if you send 1 BTC from one wallet to another, it will take about 30 minutes before it appears in both wallets.\n\nA Few Words Before You Go…\n\nOur team hopes that we’ve managed to introduce you to the Ethereum cryptocurrency and how its decentralized network works.\n\nYou’ve also learned that the number of Ethereum confirmations largely depends on the cryptocurrency exchange you’re using, and even the gas fees can affect Ethereum confirmation time, which is why you should always opt for a platform with high transaction throughput like the ones suggested here.\n\nShare on: Facebook Twitter LinkedIn Reddit\n\nAbout The Author"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPNE83QkptYkhJdk42S3JJMFoxRzFpTE1tUUxNOUR0WVZFNmJhbWdaTHVoSGktSENjVEhVTXg3dmdpaWppTHNjRnNZam5rOWg2R1FSM1VxaVN6RE45RGpGSzdWa190bmpDd3Q3ZjFZbmJId0NybllUb3pNaWlmNWpwWW5jZzNmbnZyNGZST1dLdXViaEk3SWtfaUU5R1haZTlkQW80aktsaGlQX3ZkRzVBdnE0OVhiZ9IBuwFBVV95cUxNaXhwVW9NUFZnSGxsdjNyZ1hnSXhvRnZBcUZUeHNYVTZFZklVNlFWdHNuXzNNbVFsdEVoWmsxeDBSVERXVG1QaFE2NkdwZ0pnQVRGX2dsN0dHMjVUR1pfcXZDNXZSZzdTb1JpaXFDMDlna0NnZjU2M1pDSGhCUExTcmVSdE1jNXZKeTdWN3dBdDJ2UDVxSFlXZm9TSFZSd2dUMW85WlM2UFFURERrbC1YY0xTcllCdXdhMUxB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Avail, an Ethereum Data Network to Rival Celestia, Raises $27M In Seed Round - CoinDesk",
        "content": "Avail Nexus is a “zero-knowledge, proof-based coordination rollup on Avail DA,” meaning that it will operate as an infrastructure layer that connects different rollups through the Avail ecosystem to talk to one another, according to a press release seen by CoinDesk. It will “act as the verification hub, which unifies a wide array of rollups both inside and outside the Avail ecosystem, utilizing Avail DA as the root of trust.”"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTFB0aS1kWWJndm9adGw0N1NhbVFwdnFvdzM5SDRGeVM4NC1EQWxidEVxZDBOTDdlU2NQdEFfSE9lelVCNWlPeXZ1eHFMd2d4WEVzTUx3dU1lSmF2dC1mNloybV93?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "How to Store Ethereum Offline - Crypto Head",
        "content": "Table of Contents\n\nDisclaimer: This is not a validation of cryptocurrency or any particular provider, service, or product. It should not be taken as advice to engage in trading or use any services. Please check our terms and conditions .\n\nQuick Answer: Ethereum (ETH) is a decentralized platform known for its smart contracts and dApps, using Ether as its native cryptocurrency. For secure offline storage of ETH, popular options include hardware wallets like Trezor and Ledger Nano X, and paper wallets. Trezor provides strong security with a PIN and a 24-word seed phrase backup. Exodus is a user-friendly hot wallet that integrates with Trezor for added security. Ledger Nano X offers Bluetooth connectivity and security features like a secure chip and a PIN code. My Ether Wallet (MEW) is Ethereum’s native web wallet with easy Ledger Nano X integration. Metamask is another good wallet for Ether, offering browser-based access to ERC20 tokens. Using a combination of these wallets can ensure both security and accessibility for your ETH holdings.\n\nEthereum (ETH) is the second most popular cryptocurrency today, right after Bitcoin (BTC). Its market capitalization is also second only to BTC, enabling people worldwide to use Ether for all sorts of transactions – from buying different products and trading the currency for fiat currency on exchange platforms to investing in different business ventures.\n\nEthereum is a fully decentralized software platform, with the aim of providing users with a diverse choice of defi products and services, such as smart contracts and decentralized applications or dApps for short.\n\nIn order to enable these and many more services, the Ethereum blockchain uses the Ether crypto token to carry out all sorts of transactions and to cover the transaction fees that are measured in gwei, the smallest denomination of ETH. There are also many altcoins based on the Ethereum network such as ERC20 tokens.\n\nSince Ethereum is such a popular cryptocurrency and is constantly traded in high volumes on cryptocurrency exchanges like Coinbase or Binance, people need trusted and secure methods of storing their ETH.\n\nHow do you store Ethereum offline? There are different ways to keep your crypto safe and ready for use at all times, though the different types of wallets come with varying degrees of security. However, the most popular of them are Trezor, Exodus, Ledger Nano S, and My Ether Wallet. We will take a look at these methods and list some of the popular options for Ethereum cold storage.\n\nCryptocurrency Blockchains: Ethereum (ETH) vs Bitcoin (BTC)\n\nBefore we get to the storage options, let’s take a quick look at how the Ethereum ecosystem works. In order to see the specific characteristics of the Ethereum blockchain, we will compare it to the most popular crypto network, the Bitcoin blockchain.\n\nBitcoin was the first crypto asset, with its famous peer-to-peer blockchain technology that enables miners to earn Bitcoin rewards while expanding the blockchain by verifying BTC transactions and preventing fraud in the form of double-spending. When enough transactions have been verified by miners whose computers are actually solving mathematical tasks that contribute to the verification of these transactions, a new BTC block is added to the blockchain. The first miner to solve the problem gets the BTC reward.\n\nThe ETH blockchain is also an open-source network but instead of solving mathematical problems, the network consists of developers and clients that use ETH to launch different smart contracts and dApps and pay for them.\n\nThe system nodes also verify transactions, using the proof-of-work algorithm which is based on having one network participant act as the prover and other participants as the verifiers who confirm the validity of the transaction by using a minimal amount of computational power. This sort of verification system enables the smooth functioning of smart contracts which are really the moving power behind the ETH blockchain, since they enable users to conduct business quickly, safely, and on their own terms.\n\nEthereum Smart Contracts\n\nSo, what are smart contracts, and what is their role in the ETH network?\n\nThe Ethereum blockchain enables users to initiate and run smart contracts in order to carry out different computational tasks. The concept of smart contracts itself was a fresh innovation introduced by Ethereum back in 2015, when the network first appeared. These contracts were made to provide users with far more opportunities than just financial transactions, such as exchanges or cashouts of digital assets.\n\nThey are essentially really simple and their goal is to allow two interested parties to enter a business agreement that is solely based on the conditions they agree upon.\n\nThis eliminates the need for a broker who defines the contract conditions, since all the terms and conditions of a smart contract are directly negotiated between participants. There is no central authority (government institutions, banks) or digital middleman that defines the agreement apart from the two interested parties.\n\nSmart contracts essentially democratize the process of doing business by giving the opportunity and means to individuals, startups, and other companies to do business on whatever terms they agree upon with their partners.\n\nHot Storage vs. Cold Storage Ethereum\n\nNow that we have briefly introduced you to how the Ethereum blockchain works and what it’s used for, we can move to the methods of storing your ETH. The first thing you need to decide when it comes to storing any type of crypto assets is what you want to use them for.\n\nDo you want to have small amounts of ETH available in just a few clicks, so you can carry out day-to-day payments? Maybe you’re planning on serious investment using ETH to develop decentralized apps and conduct smart contracts on a daily basis, or you just want to store large amounts of Ethereum securely, so you can cash out bigger sums when needed.\n\nDepending on how you plan to use your ETH, you should decide what kind of cryptocurrency wallet you want to use, whether to go with hot storage (or so-called hot wallets), desktop wallets that are constantly connected to the internet, or with different types of cold storage (or cold wallets) that store your crypto data offline.\n\nYou can always choose one method for storing your crypto, but if you plan to use your assets in various ways, it’s a good idea to diversify the wallets you use and combine both hot and cold storage.\n\nCold Wallets\n\nSince this guide is focused on storing Ethereum offline, we are going to take a closer look at cold wallets. Cold wallets are divided into two categories: hardware wallets and paper wallets.\n\nSince the cold wallets are offline, with no connection to the web, there is no chance of someone compromising your ETH and stealing your funds with your private key and public key. The only way someone could possibly get to your funds is if they physically find your wallet and steal it (if you have a paper wallet), but if you’re using a state-of-the-art hardware wallet, you’ll have an extra layer of protection in the form of a PIN code.\n\nCold wallets are a bit slower to use because they require additional steps when you want to check or exchange your funds, because the wallets aren’t located on your PC, laptop, or smartphone.\n\nHowever, an additional minute or two to access your funds is really worth it in exchange for the top security of your funds. Storing ETH in cold wallets is especially recommended when you need to keep large amounts of assets. The possible risks associated with hot wallets, such as hackers or compromising transfers, are thus avoided.\n\nHardware Wallets\n\nHardware wallets are wallets in the form of specialized USB devices made by hardware wallet manufacturers. These devices store all the necessary data you need in order to access your crypto assets without exposing them to potential external breaches because they aren’t connected to the internet. These wallets often come with special locks with PIN codes and encryption to add another level of security to your digital assets.\n\nPaper Wallets\n\nPaper wallets are another form of highly secure cold wallets. Basically, a paper wallet is a piece of paper with the printed public and private keys to your funds, along with QR codes of the keys to enable quick access using a smartphone.\n\nSome people regard paper wallets as a secure way to store ETH offline, but keep in mind that with a paper wallet, you have to be careful where you keep it, so that it doesn’t get physically damaged, like the print fading away and becoming useless.\n\nPopular ETH Cold Storage Wallets and Hot Wallets\n\nThese are some of the most popular Ethereum wallets. We picked two hardware wallets for safe offline storage of your ETH and two hot wallets that are compatible with hardware wallets as well for maximum protection.\n\nTrezor Hardware Wallet\n\nTrezor is one of the most trusted cold storage options available on the crypto market today. It is a key-sized device that stores your private keys securely and you can sign transactions with it, too. The hardware is so secure that you can even connect it with a USB cable to a computer infected with malware and your data still won’t get compromised.\n\nYou have total control over the private keys stored on the device and you have the option to back up the content of the wallet with a 24-word seed phrase generated while setting up the device.\n\nYour seed phrase isn’t generated while connected to the internet. It’s generated offline and the words will appear on your Trezor device’s screen. There is even a possibility to add an extra passphrase to the 24-word seed phrase, which means you have an additional layer of security just in case.\n\nExodus Crypto Wallet\n\nExodus is a multi-currency, multiplatform hot wallet that offers easy-to-use, fast services, and it’s a popular tool for storing ETH. Users of Exodus have a superb online support team at their disposal that really excels in answering all questions related to the platform.\n\nWhen it comes to storing Ethereum offline, the main perk of Exodus is its partnership with Trezor, which enables a seamless connection between your hardware wallet and the Exodus wallet in just a few steps. All you need to do is pair your Trezor device with your Exodus account and you can transfer funds instantly between the two wallets or from Trezor to a bank account, debit or credit card.\n\nLedger Nano X\n\nLedger Nano X is a next-level hardware wallet that comes with increased capacity for storing crypto, along with Bluetooth connection capability. A USB cable connection is not necessary and you can control the wallet with your iOS or Android-based mobile device directly.\n\nAs far as security goes, your private keys remain perfectly safe in the Ledger Nano X security chip.\n\nYou also have the standard 24-word passphrase set up and an additional PIN code to ensure that even in the event of losing the device, no one can hack it and get access to your ETH. Ledger is a great choice for storing large amounts of Ethereum without worries.\n\nMy Ether Wallet\n\nMy Ether Wallet or MEW is the Ethereum network’s native web wallet for storing ETH. It’s easy to use, practical, and provides good security.\n\nHowever, what’s even more important is the featured possibility of this hot wallet for a smooth connection to Ledger Nano X, giving you a very secure option for storing the bulk of your ETH offline, with easy access in combination with MEW.\n\nFrequently Asked Questions\n\nIs Metamask a good wallet to store Ether?\n\nYes, Metamask is a great Ethereum wallet for storing Ether. The best thing about Metamask is that it allows users to access all ERC20 tokens from any browser. This means that you don’t need to download anything to use Metamask.\n\nA Few Words Before You Go…\n\nThe popularity of Ethereum is ever growing, alongside Bitcoin and other popular altcoins like Litecoin and Ripple.\n\nWith the market cap increasing by the day, users need secure and trusted solutions for storing their ETH offline.\n\nWe’ve presented you with the most practical methods to keep your ETH safe and easily accessible at the same time by offering combinations of the best hardware and software wallets on the market.\n\nShare on: Facebook Twitter LinkedIn Reddit\n\nAbout The Author"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTFAwcVc3R291TGdYa1VvbnFTWF9sV2FsOFhDMG9Qa0Z3T1lVUkh4cEhuVUV1QUFZU3RxUGQ3Qm12a1hzMkc5bDU2empPMTVRRENvUU1UNjBSUnJLbnVqMUFndHZYdjB2QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "How Much Ether Does Vitalik Have? - Crypto Head",
        "content": "Table of Contents\n\nDisclaimer: This is not a validation of cryptocurrency or any particular provider, service, or product. It should not be taken as advice to engage in trading or use any services. Please check our terms and conditions .\n\nQuick Answer: Ethereum, the second-largest cryptocurrency, is a decentralized computing network that uses blockchain technology. Unlike Bitcoin, Ethereum is designed to support decentralized applications (DApps) and smart contracts, allowing complex transactions and data storage without intermediaries. Vitalik Buterin, a co-founder of Ethereum, was one of the youngest crypto billionaires in 2021. After transferring most of his ETH, he had around $10,000 worth of Ether in his main wallet. He also made a significant donation to the India Covid Relief Fund. Buterin owns various ERC-20 tokens and has disclosed holdings in Bitcoin, Zcash, Dogecoin, and Bitcoin Cash. His salary from the Ethereum Foundation is estimated to be between $140,000 and $250,000 per year. The Ethereum Foundation holds approximately $1 billion in ETH. Ethereum, being at the forefront of the DeFi movement, could inspire individuals to invest in cryptocurrencies.\n\nNowadays, the crypto market offers lots of different cryptocurrencies you can invest in, such as Bitcoin (BTC), Litecoin (LTC), Ripple (XRP), Bitcoin Cash (BCH), and Ethereum or Ether (ETH).\n\nYou probably know Bitcoin already since it’s the world’s first and most popular cryptocurrency, but how much do you know about Ethereum, the second-largest cryptocurrency and most popular platform for decentralized blockchain-based solutions?\n\nAnd exactly how many ETH does Vitalik have? In 2021, after transferring most of his ETH, Vitalik is left with 10,000 USD worth of Ether in his main wallet. Read more about what Ether is and more about Vitalik Buterin below.\n\nWhat Is Ethereum and How Does It Work?\n\nAs we already said, Ethereum is the second most popular digital currency, right after Bitcoin. However, Ethereum is in no way a direct competitor to BTC. Unlike Bitcoin, ETH isn’t designed to be just a store of value or a medium of exchange. Rather, it’s meant to be a decentralized computing network that is based on blockchain technology.\n\nA blockchain is a decentralized, distributed, public ledger on which transactions are recorded and authenticated.\n\nThe Ethereum network is decentralized because it’s not maintained or operated by a central authority, such as a central bank. Instead, the network is maintained by Ether miners. The distribution part means that every user of the network has an identical copy of the ledger.\n\nBlockchain technology uses cryptography in order to secure the network and confirm transactions. The users solve complex math problems in order to verify every transaction on the network and by doing that, they add new blocks on the blockchain, which is the foundation of the Ethereum ecosystem. For every new block that gets added to the blockchain, the users are rewarded with digital assets, known as tokens.\n\nEthereum’s coin is called Ether, although you’ll find that most people use the name Ethereum interchangeably for both the platform and the coin.\n\nYou can use Ether to sell and buy goods and services, just like you’d use Bitcoin. You can buy and sell Ethereum itself through cryptocurrency exchanges.\n\nThere are two things that are unique for the Ethereum DeFi system, however. The first one is that you can use the network to develop decentralized applications (DApps) that run on the blockchain. These apps can make complex financial transactions and transfer and store personal data. The second unique feature is smart contracts that allow two parties to set up the rules of their own transaction without the need for an intermediary.\n\nWho Is Vitalik Buterin?\n\nWe’ve gone over a brief overview of the Ethereum network and coin, but we’re yet to cover who the Ethereum founder is. In fact, there are eight of them: Vitalik Buterin, Charles Hoskinson, Gavin Wood, Antony Di Iorio, Amir Chetrit, Jeffrey Wilcke, Mihai Alisie, and Joseph Lubin.\n\nVitalik Buterin, one of the co-founders of Ethereum, is a Russian-Canadian software developer and programmer born in 1994 in Moscow, Russia.\n\nHe is also known as the co-founder of Bitcoin Magazine in 2011. Buterin studied at a private high school in Toronto and attended the University of Waterloo, but he dropped out (it’s a trend in the tech industry) and devoted himself to the crypto world.\n\nVitalik Buterin presented the design for the Ethereum network for the first time in 2013, when he was only 19 years old, with a whitepaper intending to develop a general scripting language for developing apps that will be based on blockchain technology. In 2014, he was finally able to develop his project with the help of crowdfunding. The first version was presented to the public in 2015, and the Ether supply was hard-capped at 72 million ETH.\n\nHow Much Eth Does Vitalik Have?\n\nEthereum has seen huge surges in its value in the past two years because the mainstream economic world is increasingly embracing digital assets as a legitimate currency. As it’s the second-largest cryptocurrency in the world, you are probably assuming that a lot of people own ETH, but we’re interested in learning how much ETH its founder owns.\n\nIn October 2018, Vitalik Buterin disclosed his public Ether wallet, i.e. the main cryptocurrency wallet where he stores his Ether. This wallet held over 355,000 ETH, and as the volatility of Ethers’ price constantly fluctuates, you can check Ethers’ current value to see what that adds up to today.\n\nIn August of 2021, for instance, that meant a little over one billion USD. This makes Buterin one of the youngest crypto billionaire.\n\nIn May of 2021, the Ethereum inventor transferred exactly 325,001 Ether to a separate crypto wallet, leaving only 10,000 USD worth of Ether in his main cryptocurrency wallet. On May 21st of the same year, Vitalik donated over 1 billion USD worth of crypto to India Covid Relief Funds.\n\nHow Much Bitcoin and What Coins Does Vitalik Own?\n\nVitalik doesn’t only own Ether but a variety of ERC-20 tokens in the Ethereum blockchain as well. These are tokens that are developed on the Ethereum platform, such as Augur (REP), Maker (MKR), OmiseGo (OMG), and Kyber Network (KNC). These tokens are gaining increasing traction in the DeFi industry over time.\n\nVitalik Buterin also said that he owns Bitcoin, Zcash, Dogecoin, and Bitcoin Cash worth over 10% of the value of Ether in his ownership. Buterin’s other cryptocurrency holdings are approximate: 2,000 BTC; 140,000 ZEC; 58,000 BTC; and 3.6 million DOGE.\n\nVitalik Buterin doesn’t earn only from cryptocurrency holdings.\n\nHe has disclosed that he earns a six-figure salary from the Ethereum Foundation. Moreover, he has stated that his salary is roughly 144,000 USD per year. However, the current salary of Vitalik Buterin is estimated to be somewhere between 140,000 and 250,000 USD.\n\nFrequently Asked Questions\n\nWho owns the most Ethereum coins?\n\nThe owner of the most ETH coins is Vitalik Buterin, founder of Ethereum, and Charles Hoskinson, co-founder of IOHK.\n\nHow much eth does the Ethereum foundation have?\n\nThe Ethereum Foundation has approximately $1 billion dollars worth of ETH. This number fluctuates based on how much money they are able to raise through their ICO.\n\nA Few Words Before You Go…\n\nHopefully, you’ve got a good idea of Ethereum and how it works.\n\nThe goal of this article was to give you an insight into the wealth of the youngest crypto billionaire Vitalik Buterin, but maybe this article will also inspire you to start investing in cryptocurrencies like bitcoin or other cryptos like Cardano and Shiba Inu, the future of the global economy.\n\nYou can also read more about Vitalik Buterin net worth here.\n\nShare on: Facebook Twitter LinkedIn Reddit\n\nAbout The Author"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9ha2NYZjZ5TE1IMlY0YWc4NHd6QjFXRFh1eWphaUlsSXJiaXh6RlZ3SGxuZ2F6NjNkZTJmUG9DRVAxUDdLS19ReDAyQjYwNWZVZkdTeG5CbVhyWGVvNnp2NFdOY0YwTnBEeTVranVfYmxDM3VlZHBPT0hiWXbSAYQBQVVfeXFMUHNCVzFwSFRBVnZPUk9pQS1GaWRNeE00Rm1oWFl4TXVQX1RMaTNSTkFnVThwX3VQVlI4N1RUa2FiU3MzQWVGTHM4UjRpUno1SHByZ3ZzdUQyWVZTZUNZZkNneE9RQVhjWlRWTC1NdVk0MEZCaFRWa3hSVmtPRVlOM2M1SExq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price at 22-Month High as Open Interest Soars and Dencun Nears - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum (ETH) continues to be the top coin. The second biggest digital asset by market cap is trading at 22-month highs on Monday.\n\nETH is now priced at $$3,151, CoinGecko shows, having broke past the $3,000 mark for the first time since April 2022 last week. It has gained 3.5% since the same time yesterday and risen by more than 8% over the past week.\n\nKaiko analyst Dessislava Aubert told Decrypt that \"open interest just hit a multi-year high of $7.7 billion and funding rates are at their highest levels since early January,\" meaning new capital is entering the market due to rising speculative interest as well as hedging.\n\nAD\n\nAD\n\nETH's network is set to undergo an important upgrade next month. Named \"Dencun,\" it aims to solve scalability problems with the blockchain.\n\nThe upgrade will bring \"proto-danksharding\" to the network, promising to make it faster and cheaper to use via layer 2 solutions. Layer 2s, or L2s, batch together unverified transactions made on Ethereum, process them on an external network, and send confirmation back to mainnet.\n\nA number of high-profile, traditional Wall Street firms are also hoping to get a spot ETH exchange-traded product approved.\n\nSuch a fund, if given the green light by the Securities and Exchange Commission (SEC), would bring the asset to traditional investors. Big names like BlackRock, VanEck, and Grayscale are all waiting on the regulator. Just last week publicly traded crypto exchange Coinbase submitted a comment letter to back Grayscale's bid for an Ethereum ETF.\n\nThe SEC in January approved 10 spot Bitcoin ETFs, which have so far been popular and received huge inflows of capital.\n\nAD\n\nAD\n\nBritish multinational bank Standard Chartered said last month that a spot ETH ETF will get approved by May and send the asset's price above $4,000 per coin.\n\nDespite its recent surge, ETH is still well below its November 2021 all-time high of $4,878.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOeXdlaGlBZWcyeVJhZ0o3R05GazhGNS1TS0syekdVdV83Snlyc2RiUzVDZXg5eXEtWm1GakFoSXVySnBGZkJKZlhxZEJ2MWQ4N21MUVZzTGpyY015eHpsVWdJeF9iZGhtdV9KdFJWUFpQQmtQejR2OUk5T1RVU1R2X2lZRDNvRFA1U1piejV6VW9jekhPaUJmcHhIei1lNE5MdnpuQWZSc011cE5XT0w0YtIBtgFBVV95cUxPOEZfY1U3RGRjRlhLMmVUaF9oRmdKRE1sTDFnNTN1dWNtZnBUcm9TeWI4VElqS2ZyRTVSQmxtYXZvaGNDMEZZbTR3OXc4S01PLUI2NFItM0dka2d5aXRyb0JKVUphZ3NJeTJyN3ROY1p2Rk93eFVPc3NqcldlbVhnYW5CUnN6a3ZEclRMT2tZZmxtNEk3ODZCYk9lcmpJN3FGR25kQmh0MlpOMC1ldnBJUkwtS00yUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Ether Tops Bitcoin as the Largest Crypto Asset for Institutions: Bybit Research - CoinDesk",
        "content": "Despite Solana's (SOL) strong performance in the third quarter of last year, where it rallied and erased many of the losses of the crypto winter , Bybit's data suggests that both institutions and retail users have not been interested in HODLing the token that was once at the center of Sam Bankman-Fried's portfolio."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNQVRLdmotR3NpRUxWWVRtbC12czlRV2NuMllSNmVRVjUwc0ZSa2diX2YwVnBKU2tURW1QWEVYaDNiS0w5U3kzMWFkamN6eEN1ay14VzR5SDgwUnlEQllSdkN5OUJ5VHY4MnpCMzloaUxHRE5ISFF3WlRqOUFxc2FUTlZEUlNYU19iVjdQa1Uxd2dZRllzYUhFR1BXVW01bkh4bl9vMUUyc3FUN3BMSlI2Vl9UalFuSjBrUGJITTl4ajA2Y1BsSWfSAcsBQVVfeXFMUHduazNLYVc1aVRaVkNkN25QT0MzTTV4LUFEbVpYSW42dUxPSnRRN0hyTVVOdEVMZ2wxTHZ0Y19Mb3pQYU82a1FmYUVHNmFoX3hXeS1ULUhtcDAwa185NHgzVTE4Vk5ZUUFHdmwwSDlrQ3c5M00wZmJzZzUyNE5fek1XUlVGaXhMSzBmdGp4UmV5eVNSczRQTjctMHkyY0todjFBRTgyYjI0b2VPSHZobnpWeVViUlVhdUJXWHQwVWp6RXZKVWpZNmhtLW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Ether's Bitcoin Beating Rally Not Just Because of Potential ETF Approval: Bernstein - CoinDesk",
        "content": "The amount of ether locked up is also an important factor. Bernstein notes that ETH held on exchanges is at an all-time low of 11%, a sign that more of the cryptocurrency is being locked up. There is ETH locked in staking pools, decentralized finance (DeFi) smart contracts and on layer-2s ."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPYTk1V1FGQXZ6NGdnSC1zRFR6YVJUQVpPZFptNFNFN1FZNVRjY1RJWmxMQUlsY0VncU9DajBkUm4xUlpHNE12TDVzWTJWYXUtZ3p0eVlGcTFDcC1aeno0aUVsaGROSWlfSkVLMDc4a0dFMUZtdWptX3k4dVlVdWV6WmtiRFp4QXd2VzFsVXA3N2pqNVNObkVPenBJclBWb29jRHMyRTh3SDFmZWtxWlJ4N2VB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Ethereum and Bitcoin futures open interest near record highs in notional value - CryptoSlate",
        "content": "Quick Take\n\nThe total amount of funds allocated in open futures contracts or “futures open interest” is nearing an all-time high for Ethereum and Bitcoin in terms of notional value.\n\nEthereum’s open interest currently stands at $10.5 billion, aligning with it crossing the significant price threshold of $3,000.\n\nThis is particularly noteworthy as its current level mirrors that of November 2021, Ethereum’s peak at $11 billion, when the price of ETH was approximately $4,700.\n\nSimilarly, the notional value of Bitcoin is also approaching all-time highs, with roughly $22.5 billion corresponding to the same levels observed in May and November 2021, when Bitcoin traded over $60,000.\n\nFor Bitcoin, the open interest represents about 2.25% of its market cap. For Ethereum, the open interest accounts for approximately 2.77% of its market cap. Both have seen increases in the past weeks, but they are historically at an average level."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPNkU0U1RNNFhoakNRZmpBN2E5M2RGUlJ3a3YxdUJjSUxWeVlOLXBuOTdfZUF6OVVUU0FGTHFwMHhja3BkbWl5OXNrVUdDdldZX0J4T0JjQjRJRVJGUkVNZEt1cHNfZ0R1OERUWUhkY1E0NS1Wek1GSWlrcXhJc3hjdVluRkU5NEllSVpaSlhCYVl1TDhHS0VTVjZjUG9pajZN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Name Service community approves eth.link settlement - Domain Name Wire",
        "content": "ENS plans to pay auction bidder $300,000 to settle dispute.\n\nThe results are in, and the Ethereum Name Services (ENS) DAO has overwhelmingly authorized ENS Labs to settle a dispute over eth .link.\n\n88% of the voting power approved paying $300,000 to Manifold Finance, which won eth .link at auction.\n\n62% also authorized settling at an amount lower than that. (I believe the thinking was that the lower amount would be considered if the community didn’t approve the full $300,000).\n\n84% approved reimbursing ENS Labs for its litigation expenses, which have totaled about $750,000.\n\nOnly 11% voted to continue litigation.\n\nNow, ENS will need to paper a settlement with Manifold before dropping the case filed against GoDaddy and Dynadot. Manifold will be in a strong position to get the terms it wants, given that the DAO publicly opposed continuing litigation."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNNkE3ZDYyc1dSbDRqWDBPdmVKTUcwMWZlUFVpN3k3ak13Wk9GRlRjS3lJekNVb2RPamI1M2tRZlRCTEtoZTBEcGRWOWZuQUtQdGplMUJuTV80d3pzVGdSc1dhc0FFN1J6elJEaXFqN01qaklVNll2RFJZdmNHc0VadjZFVGhJeWE2ZnBWYlZoVGt1Z2M5VkZjcFNGWHdzU0duODE2Qnd2TlFhSGh3TUVVNVBtZmkyZVU4R0xuSlQ2dXFUdHgyR21YNDZjbTfSAdIBQVVfeXFMTkNtTDd6SHVCc3ZYb2ZaTllQcWtDc3JHRHFNQWNEcGY4Z1M2VWJLc01FamtIWWNyTEpPM3J1YklrWFk2eEJPOHdPX0ZpTnpJaDZlUFZoanAwYWpNbFlseFhCNlY2V2J2THYyZ1FaZ0FvLVlWeHM3QjVpOVF0RW5oLUtrUmx6WEZDYnF3b0drRnYtRzlRMXFfNXl1eEZFYzRqX2VYM1JCczZ0WHNMY1JpVTVrWm5OaGYzYTdkNWlGNmJacFpSQjVaQnNtdC1jTDQ1WmZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 25 Feb 2024 08:00:00 GMT",
        "title": "Last Great Opportunity To Accumulate Bitcoin and Ethereum Coming, Says Crypto Strategist – Here’s When - The Daily Hodl",
        "content": "A closely followed analyst believes investors will have one last chance to accumulate Bitcoin (BTC) and Ethereum (ETH) at lower levels before the markets witness the next bull phase.\n\nPseudonymous analyst Rager tells his 199,300 followers on the social media platform X that he’s keeping some capital on the sidelines in anticipation of one more pullback.\n\nAccording to Rager, Bitcoin and Ethereum might see a correction around the April halving, when the rewards of BTC miners get cut in half.\n\n“Holding spot in positions and waiting for the BTC and ETH pullback in the next couple of months to buy around halving.\n\nThat will be the last great opportunity for this cycle.”\n\nLooking closer at Bitcoin, Rager thinks that BTC is primed for a short-lived pullback. According to the analyst, his expected retracement will set the stage for Bitcoin to rally above $60,000.\n\n“The uptrend from the bottom has been primarily composed of a few days of strong price action followed by a lot of chop and pullbacks.\n\nThe one time period with sustained grinding up without substantial pullback was from October to January where we saw the BTC spot ETF (exchange-traded fund) approval [being] front run.\n\nBitcoin and the market in general have a lot of upside opportunities coming but could be due for a short-term pullback. After a pullback and people flip/flop bearish, it’s likely we see another burst to the upside to break $60,000 for the first time since 2021.”\n\nAt time of writing, Bitcoin is trading at $51,683.\n\nAs for Ethereum, Rager thinks that the native asset of the top smart contract platform is poised to move higher.\n\n“The question is how long can ETH stay above $3,000 this time?\n\nThe target remains $3,500 for this run-up, and with the ETH spot ETF talk, I think we can hit this sooner rather than later.”\n\nAt time of writing, ETH is worth $3,031.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/TadashiArt"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE9NVlNkZDg4dDByNlVKYTFYd1NsYmc2b1V2RGhXd0d2WEdmQ012MXdxMWdneFRaSTRYcUZtX0otUFRpZVQtZkJHYVpjLWVkd2FmMHZnRUk2ajE5ZGlsZUlGVFl3UEFfLUxj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "How Big Is the Ethereum Blockchain - Crypto Head",
        "content": "Table of Contents\n\nDisclaimer: This is not a validation of cryptocurrency or any particular provider, service, or product. It should not be taken as advice to engage in trading or use any services. Please check our terms and conditions .\n\nQuick Answer: Ethereum (ETH) is a leading cryptocurrency that offers more utility than Bitcoin’s blockchain, allowing for smart contracts, decentralized apps (Dapps), and Non-fungible Tokens (NFTs). Unlike Bitcoin, Ethereum’s blockchain is not capped and its size is constantly growing, directly related to the network’s traffic and Ether’s popularity. Ethereum operates on a decentralized network maintained by nodes and miners, with plans to transition to a proof of stake system through the Ethereum 2.0 upgrade. Smart contracts on Ethereum eliminate the need for intermediaries, streamlining the process of agreements and transactions. Dapps represent the future of a decentralized internet, with Ethereum providing the infrastructure for developers to build independent applications. NFTs on Ethereum are unique digital assets that represent ownership of a wide variety of content, from art to music. While archive nodes store the Ethereum network’s full transaction history, they are not essential for transaction processing. The actual size of the Ethereum blockchain is dynamic and can be tracked through specialized websites, reflecting its continuous growth and the increasing adoption of ETH.\n\nEthereum (ETH) is the second most popular cryptocurrency right after Bitcoin (BTC). Along with BTC, Ethereum transactions make most of the daily crypto market capitalization on a global scale. Just like Bitcoin, the Ethereum network is based on blockchain technology, but its chain offers far more utility and flexibility than the classic Bitcoin blockchain.\n\nStartups, developer teams, and crypto enthusiasts around the world use Ethereum and its currency Ether as an innovative financial tool, payment method, and store of value.\n\nAdditionally, it is also used as a means of powering smart contracts and decentralized apps that create whole new digital ecosystems based on the open-source Ethereum blockchain, with really low transaction fees.\n\nLet’s take a look at how the Ethereum blockchain works, what it can be used for, and how big it is.\n\nCryptocurrency and Blockchain Technology\n\nThe most popular cryptocurrencies on the market all use decentralized blockchain technology in order to facilitate transactions and send data. Bitcoin was the first digital currency, and it was also the first blockchain which was later copied or at least largely imitated by developers when they created hundreds of altcoins such as Litecoin (LTC), Bitcoin Cash (BCH), Monero (XMR), and others, including Ethereum. However, the Ethereum blockchain became something very different from the Bitcoin network.\n\nBlockchain technology is basically a type of data storage in the form of blocks that contain information about transactions and all sorts of other data, such as programming code or valuable web developer data used to power online ecosystems.\n\nWhen a cryptocurrency has a blockchain, this means that all amounts of that crypto and all transactions are located within its blockchain which acts as a distributed, public ledger of transactions. Miners are responsible for validating new transactions and creating new blocks of the chain.\n\nPeople don’t actually have their cryptos stored in their digital wallets. They store the private keys that give them access to their funds, proving they are the owners of certain cryptos.\n\nBlockchains have impeccable security since they are decentralized and use special algorithms, and then make sure there are no scams such as double spending of the same funds by any malicious individuals.\n\nApart from this, blockchains enable lightning-fast transactions of funds, much faster than any classic bank transfer or wire transfer, which is another characteristic that makes cryptocurrencies a highly versatile asset for transferring money and information.\n\nHow Does the Ethereum Blockchain Work\n\nThe Ethereum blockchain is a fully decentralized network with no central authority or entity such as a company or developer team that has full control over the network. Instead, the blockchain is powered by the joint computing power of system nodes, miners that validate every transaction on the blockchain to make sure it is legit.\n\nUsers can search the Ethereum blockchain to check their transactions using Etherscan Ethereum blockchain explorer. As opposed to other cryptocurrencies that are designed mainly as a form of digital cash, Ethereum has higher functionality and can also perform numerous computational tasks during the mining and transfer verification process.\n\nSince its launch in 2015 by Russian programmer Vitalik Buterin, Ethereum has gained a large global community of supporters and enthusiasts that actively contribute to the popularity of the network. Its blockchain has become a synonym for crypto multifunctionality because it offers users the capability to conduct smart contracts and power decentralized applications.\n\nOver the years, the Ethereum network has become a base for numerous ERC20 tokens that use the ETH blockchain and there are also plans to move the whole network to a proof of stake algorithm rather than the current proof of work verification method. This planned upgrade is called Ethereum 2.0 or Ethereum 2, and it will enable even more advanced options for users and developers.\n\nSmart Contracts\n\nSmart contracts are a basic feature of the Ethereum blockchain. Usually, contracts between two interested parties in the real world require intermediaries such as lawyers and state institutions that check if a contract complies with rigid legal regulations before it can be signed.\n\nThe ETH blockchain enables people to conduct all sorts of contracts without the involvement of any third party, directly between themselves.\n\nA web developer can make a contract directly with their client using Ethereum, independently of local laws, or a startup can create a contract on their own terms with a potential investor, agreeing to terms that aren’t influenced by any other factor beyond the two involved parties. These contracts are especially handy for the fast and reliable creation and powering of decentralized applications.\n\nThis ability to facilitate fast and simple agreements is called smart contracts.\n\nThese contracts make doing business far simpler and easier because a contract can be signed real fast and you don’t have to consult any central authority before a contract can take effect. Smart contracts are also used as the powering mechanism behind DAOs (Decentralized autonomous organizations) that are used to automate transaction processes on the Ethereum blockchain.\n\nDecentralized Applications\n\nDecentralized Applications (Dapps) are all applications built on the Ethereum blockchain using the ETH native programming languages, which can be combined with other popular coding languages to create apps that work independently of centralized ecosystems.\n\nA Dapp doesn’t depend on any single web authority in order to work and the resources used to power a Dapp come entirely from the decentralized ETH blockchain.\n\nThese sorts of applications are regarded as the future of decentralized internet, available to any person on the planet with access to the web. Developer teams use ETH to conduct smart contracts that enable the creation of innovative Dapps such as Uniswap, Dark Forest, Foundation, and others.\n\nThere are numerous Dapp use cases that show the high scalability of the ETH blockchain such as industries like finance, sales, and healthcare. You can also build entertaining web platforms focused on games, music, and culture which have huge business potential, all thanks to the ETH blockchain.\n\nThis feature of the ETH blockchain makes it especially attractive for developer teams because it gives them the means to create all sorts of web platforms and applications independently of large, centralized web services.\n\nNon-Fungible Tokens (NFT)\n\nThe ETH blockchain enables the creation and use of Non-fungible tokens (NFTs) which are digital assets that are entirely different than just digital cash.\n\nETH or BTC by themselves can be used as virtual money, but an NFT is actually a token built on a certain blockchain, in this case, the Ethereum blockchain, but the token contains specific data and information about a certain project, smart contract, Dapp or any other form of information its owner decides to store using it. You can even turn a book, movie, or piece of art into NFTs and store them using the Ethereum blockchain.\n\nNFTs are unique digital properties because each token is one of a kind, containing specific data that can’t be copied or counterfeited. This feature is something that has been introduced on the crypto market by Ethereum as a way of tokenizing different data and assets.\n\nYou can buy an NFT from the various NFT marketplaces around the world.\n\nArchive Nodes\n\nIn order for transactions and data to be processed through the ETH blockchain, Ethereum full-nodes store blocks of data and facilitate operations such as smart contracts. Archive nodes, on the other hand, are a simplified method used to identify Ethereum nodes running in archive mode.\n\nArchive nodes aren’t necessary for facilitating transactions of data and funds through the ETH blockchain. Still, they are an important part of the network because they house information about the transaction history and data flow of the network. Ethereum archive nodes house several terabytes of network data.\n\nEthereum Blockchain Size\n\nHow big the Ethereum blockchain actually is in size is a common question, since the supply of ETH isn’t capped like that of Bitcoin, and the ETH chain is constantly growing at different paces, depending on network traffic.\n\nSubsequently, there isn’t a number you can put on the ETH blockchain size as a definite figure of size, but you can track the growth of the blockchain using different specialized websites such as Blockchair or Ycharts that show the exact size of the chain on a daily basis.\n\nThe growth of the network is directly linked to the exponential rise in popularity and value of Ether, which won’t be going away anytime soon.\n\nA Few Words Before You Go…\n\nThe Ethereum blockchain is growing in size fast, which is all a result of the enormous popularity achieved by the ETH ecosystem through the versatile functions and options it offers users, from a means of payment all the way to smart contracts and Dapps.\n\nEthereum is bringing the future of a decentralized web to life, and people all over the world are recognizing this and joining the ETH community.\n\nShare on: Facebook Twitter LinkedIn Reddit\n\nAbout The Author"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxPbERIWkdBR0FScjNwYnZEbVM3ZXFjUHJWbWE5QXRVaEllaW1lYlU1dDI2M091UFlNWWJxbEwtS1NmOTNyRkN5M0VqWm1DUHRLbjEzaS1HUmd4S3BCNDdxSE93dzFrQ1VvUWFyZlJMTkpVTzZnVWZlSXNPSEJSSDFKZTlkU1BXWm4xMXpNN3BtTktIeEU4MlNJak4wTXdXUWZOeDZRYTBodkM2VWNwazVMVEpidDcybUpwaHFjR09VVDNmSkJBLS1MZdIBzgFBVV95cUxQRjhkaUI4X0Jsc1B0Zlg3c0kyRmotMU45ZUthUnVfUHlfcDNjemJxcEpRcERHdnBOUDdhUWVpXy1WWWpLcjRzUERtczRkTUNSLUUxZWtxeWl4S1J1Y1NHLURxVkhka3hLQkt1V3lLb2t3WGRMcUc0cDNQY1B0aFRVOTVhM0MyZ1h6U0tFWEtEcjIyR043cHhma2RHYnF5VVZ0YnU4Q00yX3R1MjE4aVhMdG5DMENqaGNvZWJhekpDdkpKTFZJZ2xzSGVHWHFsUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 25 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Layer-2 Altcoin on the Verge of Big Breakout, According to Top Trader – Here’s His Outlook - The Daily Hodl",
        "content": "The closely followed trader known pseudonymously as The Flow Horse says that one Ethereum (ETH) scaling altcoin is about to see much higher levels.\n\nThe Flow Horse tells his 202,500 followers on the social media platform X that he’s anticipating moves in the Ethereum layer-2 subsector in general.\n\nThe top trader specifically names the native asset of Celo (CELO), a crypto project transitioning to become an ETH scaling solution, as an altcoin that could witness a big breakout.\n\n“Expecting we see some love for the ETH layer-2 group.\n\nThere is a well-known pair close to the musical instrument that is breaking out of a monthly accumulation range.\n\nI’m accumulating a position…\n\nBought spot CELO.”\n\nLooking at the trader’s chart, he seems to suggest that CELO may have carved a bear market bottom and is poised to begin its uptrend. At time of writing, CELO is trading at $0.875, up nearly 10% in the last 24 hours.\n\nThe trader is also looking at the Solana versus Ethereum (SOL/ETH) ratio. Based on SOL/ETH, The Flow Horse says that Ethereum will likely outperform Solana – perhaps until the market becomes too optimistic on the approval of a spot Ethereum exchange-traded fund (ETF).\n\n“Two months now, and still going to go lower most likely.\n\nBottoms when ETF bros increase odds of ETH approval from 60% to 90%.”\n\nAt time of writing, Ethereum is trading at $3,033 while SOL is worth $103.10.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNNW5laThnTVQyRW9ScG1mMG1hNkwzYkNRME1ERWZXckZIQlB0RUVTNDQ5Rkg0c2Q0cXRlb3hiOWQ0bnFoZmVuSlFiRUU4NjZHVWVRbndkVF84enNRWXJoeTg0M2U2bzdPeEFIRDNjaFZfZERIS1VrSXV2a01QMWUxWUxBSFpRT3R0SnZHbVN30gGTAUFVX3lxTE9LZWc2aVVqTnlLT055c2ZzdFl5bFROb2FIU2V1WU1wdjBjN1pqRDVOMmNnYW4wb25OcE9oRTNzeUVZQV9rT0JiQTF0cFBIYnNCblU2Q085UGFBdDNFNmlVUVptNjM0SzcxSHJ0QmZCeDFFTE13OEdCYkNTNVBfaExRNjJ6LXBocUNJTjZ5QWUwUUtrUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "$64 Million in Ethereum Pulled From Exchanges by Whales as Price Jumps - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a remarkable display of confidence in Ethereum (ETH), cryptocurrency whales have collectively withdrawn approximately $64 million worth of ETH from major exchanges, as reported by Lookonchain. This significant activity comes amid a notable increase in the price of ETH, further fueling speculation and interest in the cryptocurrency market.\n\nAdvertisement\n\nLookonchain revealed that a substantial sum of ETH has been moved from the clutches of exchanges to more secure environments. Specifically, an Ethereum address labeled 0x8B94 has withdrawn a staggering 14,632 ETH, valued at roughly $45.5 million, from Binance. This enormous withdrawal was not left to sit idly; instead, the funds have been actively staked within the past six days.\n\nFurthermore, the analysis highlighted the emergence of two new whale wallets, which have collectively moved 6,000 ETH, equivalent to $18.7 million, from Kraken to unknown destinations over the past two days. This movement indicates a growing trend among large-scale investors to secure large amounts of Ethereum outside of exchange platforms.\n\nEthereum whales go bullish\n\nThe current market dynamics offer a backdrop to these substantial transactions. Ethereum's price stands at $3,059, marking a 1.37% increase in the last 24 hours and an impressive 38.26% rise over the last 30 days. Additionally, Ethereum's trading volume has surged by 9.77%, reaching $13,810,498,210 in the same 24-hour period, highlighting increased activity and interest in the cryptocurrency.\n\nAs previously reported by U.Today, a wallet suspected to be associated with blockchain magnate Justin Sun has recently acquired an impressive 13,780 ETH, valued at approximately $41.24 million, from Binance. This purchase is part of a larger pattern, with the alleged Justin Sun wallet amassing a total of 168,369 ETH, worth around $487 million, from Binance and DEX in less than two weeks."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxNai1SRFljQ254dHNyXzV4YkJUMkFMMlBmRjV1YkFJR1Y2dFc4SHpxWi15eFlSajJJV1VMMDhwaGNpZzkwR1NiSW5HQ2VlQ2dER3Y3TXZWVWhacGtsRzl1eGloUmw0LWxUNmJGLUJ5Z3paUlhUMWphcGhUZjRQbVgxQk9nZm9hQzZabWVsWjlJcGZkMkxWdVo5MnFYR0p1RU5DY0t5V1B1dzVkNU83M3Y3ekllcWd4MWFaT3NmZjNKc0RaQmUxWHBqcEg3SktFa2xUWkF6UVRSY3VFdjYt0gHiAUFVX3lxTE1yVjZEbHJtaFNfN0JndzN6RXcxYmZkNjRza1VTS0hzY0l0aXRRUS1VS3FWQWVLdUNQWGR0ZENDWEprMXRQcnhJNzdSeWg5aXg4V1A4eTkxaFd6X3FmbndTTUl5Y2MwdHBwdEdWYW9vZ0VTS0dybjdSNUcxOVFjNVIyOTlPbXFUVnkwMXNnREJrRnVKMjg4dU1FY0JuT3J3azF1Q2FndVNxZWs3YmtlMFExbUdTSXNJWjRYaXVJLWNJc1lyX1ByZzllRWFGZmtZYUdKR1ZYRm5BelFqLThaRkY3UVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 25 Feb 2024 08:00:00 GMT",
        "title": "Ethereum price teases with a breakout, eyes $3,200 milestone as ETH bulls show resolve - FXStreet",
        "content": "Ethereum price is confronting the upper boundary of the ascending parallel channel after multiple attempted breakouts.\n\nETH could make a 6% climb to $3,200 as bulls continue to show up.\n\nThe bullish thesis will be invalidated if the PoS’s token breaks and closes below $2,572.\n\nEthereum (ETH) price consolidation within the ascending parallel channel has lasted since October, with the Proof-of-Stake (PoS) token making multiple attempts to breakout. As it stands, Ethereum continues to outperform Bitcoin (BTC) with double the gains.\n\nAlso Read: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Possible start of a trend reversal for BTC\n\nEthereum price eyes $3,200\n\nEthereum (ETH) price is up almost 3% in the last 24 hours to trade for $3,015 as of publishing time. The PoS token broke out above the ascending parallel channel, with prospects for more gains as the ETH bulls continue to show up.\n\nThe Relative Strength Index (RSI) is teasing with a buy signal, pending execution when the RSI crosses above the signal line (yellow band). The Moving Average Convergence Divergence (MACD) indicator is also above its signal line (orange band), with histogram bars flashing green in positive territory.\n\nEnhanced buyer momentum could see the Ethereum price shatter the $3, blockade, clearing this range high with a possible extension to the forecasted target, $3,200, standing 6% above current levels.\n\nIn a highly bullish case, Ethereum price could extend a neck high to the $3,500 milestone, last tested on April 5, 2022.\n\nETH/USDT 1-day chart\n\nOn the flip side, a rejection from the upper boundary of the channel could see ETH price plummet, squatting below the immediate support at $2,905.\n\nAn extended fall could see Ethereum price slip below the midline of the channel, with the possibility of retesting the midline of the market range, the 50% Fibonacci retracement level at $2,572. A break and close below this level would invalidate the bullish thesis.\n\n(This article was corrected on February 25 at 14:05 GMT to say, in the second bullet point, that Ethereum could make a 6% climb to $3,200, not $32,000.)"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBKeGNVcy1CUlU2eGh1N09UckU0TlZITkdxRm5tNmxNOU9LekIxN0NEeTdoYngtUDFqRUNNWmgybm1ZM3ZPX2c0QXduLTRqVWo5WXpucFktNzgyTU5SbkJYWHg1SlhVSGMy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "What is Vitalik Buterin’s Net Worth? - Crypto Head",
        "content": "Table of Contents\n\nDisclaimer: This is not a validation of cryptocurrency or any particular provider, service, or product. It should not be taken as advice to engage in trading or use any services. Please check our terms and conditions .\n\nQuick Answer: Vitalik Buterin is a Russian-Canadian programmer and co-founder of Ethereum, the second largest cryptocurrency after Bitcoin. He has been involved in the blockchain and cryptocurrency industry for many years and is also a co-founder of companies like Aragon, Golem, and Status. Buterin’s net worth is estimated to be around $150 million, although this figure could fluctuate due to the volatility of digital currencies. He attended Sir Robert Borden High School and later the University of Waterloo, where he studied computer science and became deeply involved in the cryptocurrency space. He co-founded Ethereum in 2014, which launched in 2015 as a decentralized platform for smart contracts and decentralized applications. Buterin’s personal Ethereum holdings have been substantial, and at one point, he reportedly held 405,000 Ether. However, cryptocurrency prices are highly volatile, and his net worth has fluctuated accordingly. Buterin has made significant contributions to the crypto community, including donations to various causes and projects. He is on the board of directors for Dogecoin and has expressed interest in the coin’s development. Despite his wealth, the exact figures of Buterin’s assets and financial status are not publicly disclosed, making it challenging to confirm whether he is a crypto billionaire.\n\nVitalik Buterin is a Russian-Canadian computer programmer and entrepreneur who is the co-founder and CEO of Ethereum, the 2nd largest Cryptocurrency (after bitcoin). He has also served as the chief architect at Ethereum since 2014. He is considered one of the founders of Ethereum, along with Joseph Lubin and Charles Hoskinson.\n\nIn addition to his role at Ethereum, he serves as the co-founder of several other companies, such as Aragon, Golem, and Status. With that said, how much is Vitalik Buterin net worth?\n\nApart from the Ethereum creator, he earns a salary of $100K per year from his company, Consensys. Vitalik’s net worth could be $150 million, but considering the volatility of the digital currency, it may be higher or lower than estimated.\n\nWho is Vitalik Buterin?\n\nVitalik Buterin grew up in Toronto, Ontario, Canada. He attended Sir Robert Borden High School, where his classmates included fellow Bitcoin creator Gavin Andresen.\n\nWhile attending high school, Buterin worked part-time jobs such as pizza delivery and working at a video game store.\n\nButerin began programming at age 12 and became interested in cryptography while playing online games. At age 15, he wrote his first program, a text editor called BBEdit. He continued developing software throughout high school, including a chess AI named Deep Blue. In 2007, he cofounded Ethereum, a decentralized computing platform based on blockchain technology.\n\nEarly Life\n\nVitalik Buterin graduated from high school in 2007. After graduating, he enrolled at the University of Waterloo, where he earned a bachelor’s degree in computer science. While there, he became involved in the cryptocurrency scene.\n\nAt age 17, he met Joseph Lubin, founder of Ethereum and ConsenSys. Lubin told Buterin about Bitcoin and how it could improve society.\n\nButerin spent most of his time studying mathematics and physics. His interest in cryptography led him to work for the Tor Project, an organization that develops privacy software. During his studies, he began working on a decentralized version of Twitter called StatusNet. This project caught the attention of Satoshi Nakamoto, the creator of bitcoin.\n\nIn 2011, Buterin joined the team behind Ethereum, a blockchain-based digital currency. The project raised $12 million in funding during its initial coin offering and went live in July 2015.\n\nThe following year, Buterin published a paper titled “Bitcoin and Cryptocurrency Technologies,” which laid out the fundamentals of digital assets.\n\nEthereum Blockchain\n\nIn 2012, Buterin launched Bitcoin Magazine, a publication focused on covering cryptocurrency news. While writing for the magazine, he met Joseph Lubin, another early adopter of cryptocurrency. Together, they founded Consensys, a startup that aimed to build tools for developers to use in building decentralized applications.\n\nAfter working on Consensys, Buterin joined Ethereum in 2013. His goal was to develop a system that could run smart contracts without relying on intermediaries such as banks. In 2014, he officially announced the launch of the Ethereum blockchain, a public blockchain network designed to support decentralized apps.\n\nButerin published a white paper where he proposed a vision for a decentralized and open-sourced blockchain platform called Ethereum. The white paper circulated widely among developers and entrepreneurs and drew considerable attention.\n\nThe platform was officially launched in July 2015, with Buterin credited as one of three founding members, along with Gavin Wood and Anthony DiIorio.\n\nAs a smart contract platform, Ethereum allows anyone to write code that runs exactly as programmed without the possibility of downtime, censorship, fraud, or third-party interference. This makes it possible to build anything from decentralized apps to digital currencies to autonomous organizations.\n\nHow many ETH does Vitalik Buterin own?\n\nBeing the creator of Ethereum, you might be wondering, how much Ether does Vitalik have? Vitalik bought his first batch of Ether in 2013, when it cost about $0.40 per coin. Today, Ethereum trades for about $8,500 per coin.\n\nButerin began mining Ether in July 2016, when it was selling for just $9.50. After buying out the rest of the supply, he held onto nearly 400,000 Ether. Over the course of 2017, he sold off some of his holdings, making a profit of about $270 million.\n\nIn January 2018, Buterin purchased another 300,000 Ether, bringing his total up to 405,000 Ether. On Feb. 4, 2018, Ether reached $1,400. In mid-February, Buterin’s Ether holdings climbed to $360 million, or roughly $300 million before taxes.\n\nBy early April, however, the price of Ether fell to $300, meaning Buterin lost about $90 million on his investment. He still owned about 360,000 Ether, though, which put him at about $267 million before taxes.\n\nOn May 3, 2018, Ether hit $2,200. By late June, the price of Ether had fallen to $700. Buterin sold off about half of his remaining Ether holdings, leaving him with about 275,000 Ether — or $225 million before taxes.\n\nAt this point, Buterin‘s Ether holdings are valued at about $150 million. And while the price of Ether is rising again, Buterin is planning to sell off his remaining Ether holdings.\n\nIs Vitalik Buterin A Crypto Billionaire?\n\nVitalik Buterin is one of the most influential people in cryptocurrency today. His Twitter account boasts over 2 million followers. In fact, he’s even been called the “crypto messiah.” And even made the Fortune 40 under 40 list in 2016 and the Forbes’ 30 under 30 list in 2018. So, how rich is Vitalik Buterin exactly?\n\nButerin’s net worth is largely tied up in cryptocurrencies like Ether and XRP. And depending on where you look, his net worth ranges anywhere from $1.2 billion to $1.6 billion. If we take into consideration his ownership stake in mining companies like Hashflare, it could push him above the $1.5 billion mark.\n\nButerin‘s net worth fluctuates based on what happens with the price of cryptocurrencies.\n\nFor example, during the 2018 bear market, Buterin lost a significant amount of money because his investments dropped in value. On the flip side, when the market rebounds, Buterin makes a lot of money.\n\nThe problem is that there are no reliable sources of information about Buterin’s personal finances. There’s no public record of his income and expenses, nor is there anything publicly available about his assets and liabilities. This makes it difficult to determine whether or not he’s actually a billionaire.\n\nShiba Inu Tokens\n\nIn April, the anonymous creators of the coin known as SHIB, announced that it had been gifted half of all the coins in existence to Vitalik Buterin, the co-founder of Ethereum.\n\nAccording to CoinMarketCap, there are roughly 505 billion SHIB tokens in circulation. Depending on when you’re looking, one SHIB token can value at around $0.0010.\n\nOn May 10, those 505 billion SHIB were worth $7 billion, giving Vitalik Buterin a net worth of $15.3 billion when combined with his other digital assets.\n\nButerin’s Donations\n\nThe founder of Ethereum has been quite generous with his crypto wealth. He has donated 5% of the total circulating supply to support the covid relief fund in India. Vitalik Buterin, the creator of Ethereum, has also donated $1 million of ETH to the Dogecoin foundation. He has done it because he believes that the cryptocurrency industry needs to unite against the current challenges.\n\nRecently, he has also sent $1 million of Ether to the Dogecoin project.\n\nIn addition to that, Buterin is on Dogecoin’s board of directors. He tweeted that he hopes someday DOGE will switch to the PoW/PoS consensus mechanism that Ethereum is about to implement in August this year, and he wants to see DOGE become the main coin used in the ecosystem.\n\nFrequently Asked Questions\n\nHow rich is Vitalik Buterin?\n\nHe is one of the richest people in the crypto space, with an estimated net worth of $1 billion.\n\nA Few Words Before You Go…\n\nVitalik Buterin is one of the world’s richest people thanks to his work developing Ethereum — the second largest cryptocurrency by market cap. He holds around $1 billion worth of Ether, making him one of the wealthiest individuals in crypto.\n\nButerin isn’t just rich because he’s the creator of Ethereum; he’s also been able to amass massive wealth outside of blockchain technology. However, the majority of Buterins’ wealth is stored in Ether, though he owns shares in multiple companies, including the crypto exchange, Coinbase and Ripple.\n\nVitalik Buterin’s net worth is likely much larger than it appears here.\n\nShare on: Facebook Twitter LinkedIn Reddit\n\nAbout The Author"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNbHNIMVNVVFBTdXQwNjV4S2FhOThCSVM4dHV2VFdvTzJmcFVhTWIxZ0MwOW04MnZWRWd0VjltVE1td05JOEN4WnEzOTFjZ1FxejRQTGFiWFM3bFE4QS1EX2U0RkRJYmppQnduS1ZZMEJBTEg0cmxMam56ZnB3eHNMb2JjcmdvTWU5c0x2aEJpekl4T3k3dk44S3ZXT1p4dXVqdVRIaXV3d3RpZ1piMnNFMlRRNmhYT2wzVkHSAb8BQVVfeXFMTzdLYU1TcjJ1REhxbFdBeEUzVzJvM1dKNEgwbkRJWmh2bnB5N2N0RXVRaVVrTVRfMldwTGxlbUI5cVljS1ZoRVBUd0wwZ2ZVQWI4d2EyZ2RDcUl1SHJsY1Z1VWtwMlduZ05CeldfSmNrUzFvMmRuTWFEcW1PS2pNanI1MklmTEkxcklvY28zZkFOZnFOTmdLVmlhQ1QwQUljNUNWOXZBRlJTUmFOTzNVMnpVZXI2SWw4ejVGT2JDZ1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Ethereum price rally beyond $3,000 depends on two catalysts - FXStreet",
        "content": "Ethereum whales are accumulating large volumes of ETH after supply on exchanges hit a six-month peak.\n\nETH price sustained its uptrend even as Ether holders consistently realized gains since February 15.\n\n$20.48 million in short positions were liquidated in the past 24 hours as ETH price climbed to a new 2024 high.\n\nEthereum’s large wallet investors, including a wallet address that allegedly belongs to Justin Sun of TRON, have been spotted accumulating the altcoin, according to on-chain data. The accumulation by whales could offset the altcoin’s Supply on Exchanges, thereby reducing the selling pressure on ETH.\n\nTypically, Ethereum price rallies post a Bitcoin halving event, the upcoming halving in April 2024 could catalyze gains in ETH if the trend repeats itself.\n\nAlso read: Ethereum price teases with a breakout, eyes $3,200 milestone as ETH bulls show resolve\n\nEthereum price could sustain uptrend with whales’ massive ETH accumulation\n\nData from on-chain intelligence tracker Lookonchain revealed that wallet that allegedly belongs to TRON co-founder Justin Sun scooped up 12,702 ETH worth $36.9 million on February 21. Between February 11 and 21, the address bought 104,055 Ether worth $296 million at an average price of $2,846 from Binance and decentralized exchanges.\n\nWallet that allegedly belongs to Justin Sun, Ethereum accumulation. Source: Etherscan\n\nThe tracker identified addresses that are accumulating Ether in the past week. A whale wallet withdrew 14,632 ETH tokens from Binance, worth $45.5 million and staked it in the past week. Two other large wallet addresses withdrew 6,000 Ether from Kraken, worth $18.7 million, in the past two days.\n\nWhile Santiment shows that ETH Supply on Exchanges has hit its highest level in six months, the recent activities of whale wallets could reduce the selling pressure on the asset.\n\nEthereum Supply on Exchanges. Source: Santiment\n\nEthereum wallet addresses holding between 100,000 and 1,000,000 ETH tokens have accumulated more Ether since the beginning of February. Wallets holding between 10,000 and 100,000 ETH and 1,000,000 and 10,000,000 ETH have shed their Ether, reducing their Ethereum holdings in the same timeframe.\n\nKey catalysts\n\nThe accumulation of ETH wallets holding between 100,000 and 1 million Ether coincides with Ethereum price rise, as observed in the chart below, in the past six months. This suggests it could be a key catalyst to the token’s gains. If this trend continues, Ethereum price could continue rallying past the $3,000 mark.\n\nEthereum holdings of different whale cohorts. Source: Santiment\n\nAnother key catalyst is the upcoming Bitcoin halving. As seen in previous halving events, Ethereum price rallies in response to the mining reward halving of the largest asset. This is a trend that has repeated in the previous three halvings. If it continues, Ethereum price could rally towards its $4,000 target, ahead of the SEC’s decision on Spot Ethereum ETF approval in May 2024.\n\nIt's important to note that in the past 24 hours, $20.48 million in short positions were liquidated as Ethereum price surged to a new peak in 2024, according to CoinGlass data. ETH price climbed to a high of $3,135.65 on Monday."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxON2NuanVEVDNFMjdzUTkzRVlXeWJEYmdGQTZEazBLSnl5VFlaX2hBTXlzWnN0WTczSTlMajlFb2s5YTAwUERGMHFnSVNqWFJaZk9ORUVWTFpBZTlZcm9LcEhxRXFlSHZTN3dxbWZ4ck9ZOU5MVzMtMlFKby12all4Y3pkc1RVZlJV0gGOAUFVX3lxTFBGbGtLVEdnQjlNbTB3blVXTWdpSkpPdjhleEdJMmN6TWZQdWwxWWhvdE1iNDdNeHFQcnRhTDNXd19ENXFpSmxlMURmdnNYOFl5ZDFuaGlLaGhSTHNnWWNnWFpscWhpWGJ5NXJ6UHBEZm9CblVBak5NbkJ0UTZxczRQYVE4VlkteDdrTWY5NWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Is Ethereum Price Heading to $3500? This Chart Pattern Offers Insight - CoinGape",
        "content": "Ethereum Price: ETH, the second-largest cryptocurrency, experienced significant volatility this week, reflecting the consolidation of Bitcoin prices below $38,000. This sideways movement led to a decrease in bullish momentum across the crypto market, hindering the progress of most major cryptocurrencies.\n\nDespite this, with the Bitcoin price stabilizing above $30,600, ETH witnessed a resurgence in buying interest. This surge pushed ETH’s price beyond the psychological barrier of $3,000. Is this breakout a signal to enter the market?\n\nadvertisement\n\nAlso Read: Grayscale Sees Ethereum’s (ETH) Parabolic Run Post Dencun Upgrade\n\nIs ETH Price Ready to Gain $3500?\n\nThe Ethereum (ETH) coin initiated its current recovery trendline in late January when the price showcased sustainability above $2166. This upswing recorded 41% over the past five weeks and reached the current trading price of $3062.\n\nThe recovery was spared in response to the Bitcoin price rally, following the massive inflow of funds into the spot BTC ETG. The bull run gained further momentum as the Ethereum network steadily progressed to its much-awaited Dencun upgrade scheduled for implementation at slot 8626176 around mid-March.\n\nThis week, the Ethereum price traded majorly sideways resonating between the two horizontal levels of $3030 and $2875. Following an aggressive rally, the recent consolidation must have asserted the ETH price to recuperate strength.\n\nWith an intraday gain of 3%, the altcoin gave a decisive breakout from the range’s resistance and reclaimed the psychological level of $3000. If the coin price shows sustainability above the reclaimed level, the buyers may aim for a potential target of $3180, followed by $3280.\n\nAlso Read: ETH/BTC Chart Analysis: Is Ethereum’s Rally Against Bitcoin Ushering In the Altcoin Season?\n\nChannel Pattern Puts Ethereum Price at Risk of New Correction\n\nWhile the current market outlook for Ethereum seems bullish, a look at the daily chart shows the ongoing rally is strictly following the structure of an expanding channel pattern. With the coin price close to the pattern upper trendline at $3180, the ETH price may face intense supply to trigger a new correction.\n\nTechnical Indicator\n\nExponential Moving Average (EMA): A bullish crossover state between the daily EMAs (20, 50, 100, and 200) indicates a strong uptrend in action.\n\nAverage Directional Index: The ADX slope at a high of 41% indicates the buyers may soon hit exhaustion and need a minor pull to recuperate strength.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOamtZVno5emM4cFZ6RkpBTXp4NG9UNEgxcFVDRWxQTVdsaUR2clRzUmhTUU1rZFFObFItWUFXYkpldUV6ZTV1WWpINEV3YVRCeFFXVWUzWWdkM19nQ2NDaUtWU2lnTU10V3Zha0R2WEtYemRoNkhhRVdnVGN4OFR3cEg5TzdvaEN3SFVxeEc3Zkd4eDU0anRHMlh0RGpkQnpBZ0x5ajJJTUg5YlZPZW0wakIySWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Starknet (STRK) Surges to Fourth Largest Ethereum Layer 2, TVL Exceeds $1.3 Billion - Crypto News Flash",
        "content": "Starknet’s TVL surpasses $1 billion, becoming the 4th largest Ethereum L2 solution.\n\nSTRK token faces volatility but shows promise with a market cap of $1.39 billion.\n\nIn an electrifying development this week, Starknet, an Ethereum-based Layer-2 (L2) scaling solution, has taken the crypto world by storm with its historic launch. This new entrant in the blockchain domain has quickly ascended to become the 4th L2 solution on Ethereum, with its Total Value Locked (TVL) surpassing the remarkable $1 billion milestone, marking a significant achievement in its nascent journey.\n\nThe Surge of Starknet\n\nFollowing the strategic launch of its STRK airdrop, Starknet catapulted into the limelight of the crypto ecosystem. The protocol generously rewarded its early adopters, distributing over 700 million tokens from the allocated 1.8 billion for the airdrop, a move that significantly contributed to its rapid ascendancy.\n\nDespite a few hitches, such as inconsistencies where some users received millions of STRK tokens leading to an immediate sell-off and a subsequent price drop post-launch, the airdrop was largely deemed a success. This event mirrors the tumultuous debuts typical of Ethereum L2 solutions but hasn’t deterred Starknet’s momentum.\n\nStarknet’s growth trajectory has been nothing short of phenomenal. With data from L2Beat showcasing a staggering TVL of $1.31 billion, up by over 620% since its inception, Starknet now only trails behind giants such as Arbitrum One, OP Mainnet, and Manta Pacific in the L2 space.\n\nThe adoption by leading trading platforms like Binance Exchange, which listed STRK for trading, further bolstered Starknet’s position in the market. This support from top exchanges underscores the confidence in Starknet’s potential and technology. Dive deeper into this development in the YouTube video below.\n\nUnique Approach to Scalability\n\nStarknet sets itself apart with its innovative use of zk Rollup technology, addressing the Ethereum scalability challenge in a novel way. This distinctive approach has attracted significant new capital inflows, with major smart contracts like Orbiter Finance and Rango Exchange now leveraging the platform, drawing a diverse user base. To explore how Ethereum is revolutionizing the digital industry, check out the following YouTube video.\n\nSTRK Token Dynamics\n\nThe journey of the STRK token has been marked by volatility, a common trait in the digital currency landscape. Currently trading at $1.92, the token has seen a slight decline of 1.53% in the last 24 hours. Despite the selling pressure from early recipients and a more than 30% decrease in trading volume, the launch of Starknet and its native token STRK is perceived as relatively successful, with a current market capitalization of $1.39 billion.\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPeGNRVkx6Wkc5RW1Nbk1BMUIxTF9la00zZVVyZnNqOC0yM2V3RUJKQS1oX2NicXFwSU4yTGtWeC1QeG9HQWhfaVFldUpVUXhnLUJFNnh6cndmM2xNUi01YVFSeFJPVFp1V1NGb1RTVFgzNl9qUHJ3OGFPZVRxVlFaNHhrZ1JjSGlnUkRmWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Why Coinbase and Crypto Are Popping Today - The Motley Fool",
        "content": "Everything in crypto is up big today.\n\nCryptocurrencies rallied sharply on Monday as investors jumped back into the market. Bitcoin traded over $53,000 for the first time since November 2021, and that's pulling the entire market higher.\n\nEven bigger moves took place. Ethereum (ETH -0.79%) jumped 8.3% since the close of the market on Friday, NEAR Protocol (NEAR 0.87%) was up 21.3% on Monday, and Coinbase (COIN 6.28%) jumped 16.9%. Bitcoin miners Marathon Digital and Riot Platforms were up 21.7% and 17%, respectively at the end of trading today. This is the momentum that's been forming for a while, but for some, it may last.\n\nEthereum's getting an upgrade\n\nThe Ethereum blockchain will get an upgrade called Dencun in mid-March that's expected to increase throughput and reduce costs on the blockchain. This could make the blockchain much more usable for utility, which has always been the cryptocurrency's promise.\n\nGrayscale, a digital currency asset management company that has several crypto funds, has touted the upgrade as a catalyst for Ethereum long term. They also think it could be the next to be approved for an exchange-traded fund (ETF).\n\nNear Protocol is up big, as well, but that's largely because it's following the bullish moves across the industry. There wasn't any specific news; speculation drove Near higher today.\n\nMiners shine\n\nIt should be no surprise the rising price of Bitcoin has led to a jump in Bitcoin mining stocks. These companies not only generate revenue from mining Bitcoin -- so their revenue and gross margin will rise as Bitcoin does -- but they also hold Bitcoin on the balance sheet. This gives them double leverage when the price of Bitcoin increases, which is what we see today.\n\nCoinbase rides the tide\n\nRiding the wave of crypto momentum is Coinbase, the exchange and crypto infrastructure company. Trading is a big part of Coinbase's business, but it also indicates more activity on the blockchain from developers and, potentially, financial institutions.\n\nThe upside is that products like wallets, the Base blockchain, cloud tools, commerce applications, and more will run on Coinbase. That's where the company's service products are going and why this could be a disruptive company long term.\n\nThe end of crypto's winter\n\nIt's become clear over the past six months that the crypto winter may be over. Trading is up, valuations are increasing, and there's more development and investment in the industry than before the last bull market. That will likely lead to more activity on the blockchain, even if the value generated isn't evenly distributed.\n\nBlockchains that can provide real utility through smart contracts, fast transactions, and low costs are going to add value and could be disruptive technologies. That's why Ethereum's upgrades are so important as developers look for more use cases.\n\nI think the best way to invest in the crypto recovery is with Coinbase because it benefits no matter what blockchain the activity is going to. It could outpace all of its crypto rivals in 2024."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiV0FVX3lxTFBZb0VhNHVyaWs5czA3NU5rT2lLQkp5b3JneUhpVGNzYmxfSVZEbDFuM3BuSllCblZPZzB4SF9hOHFlU1BSWV9hcDRMZ3Y4MEd0TE9SR0FwNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 25 Feb 2024 08:00:00 GMT",
        "title": "What is EigenLayer? Boosting Ethereum functionality through restaking - OKX",
        "content": "EigenLayer is an Ethereum-built protocol that supports the restaking of ETH on the blockchain's consensus layer. Through EigenLayer smart contracts, those who stake ETH can provide cryptoeconomic security to other applications across the network.\n\nFollowing a stakedrop of EIGEN, the project's native token, users have been rewarded with a portion of EIGEN for their active restaking efforts and willingness to be early adopters in the EigenLayer ecosystem.\n\nWith EigenLayer, Ethereum security is no longer fragmented across modules but is aggregated instead, improving security for the decentralized applications (DApps) that use the modules. EigenLayer addresses some of the trust and innovation challenges faced on Ethereum, allowing for faster development and deployment of DApps.\n\nEager to learn more about what EigenLayer is? Read on as we explain what the project was built to achieve, the role of the EIGEN token, and the project's restaking function.\n\nTL;DR\n\nInnovative platform: The security of Ethereum is transformed by EigenLayer through the ability to restake staked ETH.\n\nSolves fragmented trust: Addresses the slow progress and lack of confidence among some in Ethereum, caused by divided trust.\n\nEnhances security: Enhances the safety of DApps and bridges, decreasing the need for security expenditure.\n\nMarket-based governance: Unifies the Ethereum community through shared security and governance.\n\nPotential and risks: Provides rewards for extra measures to ensure protocol security in the face of novel risks.\n\nWhat is EigenLayer?\n\nEigenLayer is a platform designed to enhance the cryptoeconomic security and functionality of the Ethereum network by enabling the restaking of staked ETH.\n\nThe project addresses the challenges of divided trust and sluggish development on the Ethereum base. These challenges have traditionally hindered the network's ability to offer secure DApps and middleware services at a reasonable cost.\n\nEigenLayer aims to enhance security for Ethereum DApps, bridges, and other protocols by enabling the restaking of staked ETH. As a result, projects using EigenLayer avoid the need to allocate further resources to their security systems.\n\nWith this approach, Ethereum can use its established network of trust while incorporating collective security and market-based governance to better align the goals of DApps, middleware services, and Ethereum.\n\nEigenLayer has an optional feature that allows users to earn extra incentives by securing additional protocols, but this also comes with the possibility of facing new penalties. Users can decide to participate in securing protocols with specific penalty conditions, which means they must accept new risks and potential rewards. The platform supports any protocol that requires robust security, such as oracles, bridges, and rollup services, providing services such as data availability through the same network.\n\nOne example of EigenLayer's utility is EigenDA, a data availability layer designed for Ethereum. Its goal is to offer more affordable and faster data availability when compared to the current Ethereum base layer. This can ultimately improve programmability and the pace of progress on the Ethereum platform.\n\nThe benefits of using EigenLayer include improved capital efficiency, access to higher rewards, and support for novel actively validated services (AVS) and DApps. It also allows for the restaking of liquid staking tokens, which broadens the scope of participation beyond active validators to include those who've staked ETH through liquid staking providers like Lido and Swell. This inclusivity is balanced with measures to prevent centralization, such as imposing caps on the allocation of liquid staking tokens and single deposits.\n\nHowever, like any innovative platform, EigenLayer comes with its challenges. These include the potential for slashing risks, where staked ETH could be rapidly depleted if validators misbehave, yield risks, and centralization risks that could pose systemic threats to the Ethereum network.Despite these concerns, EigenLayer represents a significant step forward in addressing the fragmented trust issue and making Ethereum a more unified and secure platform for decentralized finance (DeFi) and beyond.\n\nEigenLayer's approach to restaking staked ETH is a vital component of the broader Ethereum 2.0 upgrade, aiming to enhance the security and efficiency of the network. By allowing for the creation of a security pool through restaking, EigenLayer supports DApps, bridges, oracles, and more, enabling these entities to leverage Ethereum's security without establishing their validator networks.\n\nHow does restaking work on EigenLayer?\n\nThe ability to restake ETH on multiple protocols concurrently reinforces the validation of the network, maximizes capital efficiency, and decreases the costs for validators. Restaking can be divided into two main forms: liquid restaking and native restaking.\n\nLiquid restaking: Involves depositing liquid staking tokens (LSTs) into EigenLayer smart contracts. Supported tokens include stETH (Lido), rETH (Rocket Pool), and several others, with plans to expand support to more tokens. Liquid restaking offers flexibility and inclusivity, allowing a wider range of stakeholders to participate in the restaking process.\n\nNative restaking: Native restaking is targeted at those operating an Ethereum validator node. It involves setting an Ethereum validator's withdraw credential to EigenLayer's smart contracts, enabling direct participation in the restaking mechanism. This form of restaking is crucial for maintaining the Ethereum network's integrity and security.\n\nEigenLayer improves Ethereum ecosystem security by pooling resources and using a free-market governance model. This extends security to different protocols, incentivizing participation and honesty for validators and stakeholders who choose to restake with EigenLayer.\n\nRestaking has benefits such as promoting competition among security providers, lowering barriers for new protocols, and strengthening Ethereum's resilience against attacks. Validators earn income, and stakeholders can increase efficiency by diversifying their staked assets.\n\nWho uses EigenLayer?\n\nThree parties make up the EigenLayer ecosystem, and each plays its own specific role.\n\nStakers\n\nStakers in the EigenLayer ecosystem can restake ETH or liquid staking tokens (e.g. stETH, rETH, cbETH, and LsETH) across multiple protocols. This allows them to use their staked ETH as security for other protocols and earn fees and rewards. This is essential for improving Ethereum's network security and efficiency by using existing staked capital.\n\nOperators\n\nOperators validate transactions and maintain network integrity. They benefit from the EigenLayer ecosystem by validating multiple networks at lower costs, promoting a competitive market for pooled security. As a restaker, users will get to select from a pool of operator nodes that includes OKX, Coinbase, and others.\n\nActively Validated Services (AVS)\n\nThe EigenLayer ecosystem allows AVS developers to access Ethereum's staked capital and validator set, enabling them to create decentralized services and tap into a trusted network for security. This eliminates the need to create a new trust network, reducing fragmentation and promoting permissionless innovation. AVS developers within the ecosystem today include Edgevana, Ethos, and Everstake, among others.\n\nWhat are some key features of EigenLayer?\n\nRestaking mechanism\n\nAllows for the restaking of assets by both ETH stakers and Liquid Staking Token holders.\n\nContributes to Ethereum's security and allows stakers to earn extra rewards without additional capital.\n\nLiquid Staking Derivatives (LSDs)\n\nMarket value of $28B, enhancing liquidity for stakers.\n\nEnables engagement in DeFi ventures while maintaining possession of staked assets.\n\nEigenDA\n\nEigenLayer's initial AVS offers decentralized data availability.\n\nProvides lower transaction fees, increased speed, and reliable compatibility with rollup technology.\n\nCost reduction and throughput in EigenDA\n\nAddresses capital, operational, and congestion costs through erasure coding and other mechanisms.\n\nCan sustain high-throughput, accommodating applications that require large amounts of bandwidth.\n\nSecurity features\n\nUses restaking to ensure economic stability and promote decentralization.\n\nUses proof of custody to guarantee the validity of stored data.\n\nFaults and EIGEN, the universal intersubjective work token\n\nWhen it comes to blockchains, faults can be categorized into four types:\n\nObjectively attributable faults: Verified mathematically and cryptographically.\n\nIntersubjectively attributable faults: Most observers must agree.\n\nNon-attributable faults: Privacy breaches that only the victim notices.\n\nSubjective faults: Relies on personal preferences. To use a real-world example, something like your favorite cafe.\n\nEigenLayer focuses on objectively attributable and intersubjectively attributable faults, for broader consensus and resolution.\n\nThe role of social consensus\n\nSocial consensus is crucial for solving conflicts. It makes decisions fairly and that are, in theory, widely accepted. Several methods help achieve this.\n\nSlashing operators' stakes: Here, operators are penalized if they act outside of the norm.\n\nUsing a committee: A group determines the true answer and penalizes those who disagree.\n\nForking the chain: If there's a big disagreement, a new version of the blockchain can be made.\n\nRestaking ETH and the role of EIGEN\n\nEigenLayer uses Ethereum's security to handle objective faults. But, it needs a new way to deal with subjective faults. This is where the EIGEN token comes in.\n\nEIGEN token explained\n\nThe EIGEN token introduces intersubjective staking to fix intersubjective faults. This process involves a setup phase, where rules of coordination are established, and an execution phase, where these rules are implemented.\n\nIf the majority of EIGEN token stakers act outside the rules, a challenger can make a new token version. This new version penalizes malicious stakers to encourage honest and compliant behavior.\n\nUnique features of EIGEN\n\nThe EIGEN token has numerous unique features. It's universal and can be used in various applications, providing broad cryptoeconomic security. It also uses a two-token system to avoid forking issues. One token is fork-unaware and is suitable for applications like lending protocols.\n\nTo prevent malicious challenges, anyone who wants to fork the token must put up a bond in EIGEN. If an attack happens, the system redistributes the malicious stake to compensate for the losses, preserving cryptoeconomic security.\n\nHow do EIGEN and ETH complement each other?\n\nETH and EIGEN work together inside EigenLayer. ETH makes the system decentralized and prevents collusion, while EIGEN helps with cryptoeconomic slashing. Together, the tokens support the network's security and effectiveness, and contribute to a stronger decentralized space overall.\n\nWhat's next for EigenLayer?\n\nThe potential applications of EigenLayer are diverse, including DeFi, governance, and cross-chain interoperability. The protocol's embrace of permissionless innovation opens the door to fresh advancements built by developers using the platform.\n\nMeanwhile, the protocol has taken major steps forward itself during 2024, including the EigenDA mainnet launch during April 2024 and the onboarding of rollups onto the EigenDA mainnet for test traffic. Following this final testing and hardening stage, EigenLayer will begin to onboard production traffic for all rollups. The protocol has stated that onboarding of the first rollups onto the EigenDA mainnet is \"the next phase of a multi-stage launch towards the endgame for data availability for the Ethereum ecosystem\".\n\nAlthough big things lay ahead for EigenLayer, its future development isn't without challenges. This includes complicated technology, uncertainty about market acceptance, and the need to balance maintaining overall security and providing economic incentives within its community.\n\nDespite facing these obstacles, EigenLayer is paving the way for a significant impact on the larger blockchain community. By addressing the long-standing hurdles of scalability, interoperability, and security for Ethereum, its solutions have the potential to encourage a new phase of blockchain advancement. This new era could be characterized by heightened productivity, a wider range of applications, and a fairer and more decentralized digital market.\n\nEigenLayer airdrop: explaining the EIGEN Stakedrop\n\nTo bootstrap the EigenLayer ecosystem and drive higher liquidity, EigenLayer announced the EIGEN stakedrop. Pegged as an airdrop designed for EIGEN staking, the stakedrop is meant to reward users who interacted with the overall EigenLayer ecosystem before the season one snapshot. This mostly includes Liquid Restaking Token users, and those who directly restaked ETH or LSTs on EigenLayer. As a whole, the EigenLayer team mentioned that approximately 113 million EIGEN tokens will be distributed to users in season one.\n\nHow to claim your EIGEN stakedrop\n\nAt the time of writing, ETH and LST restakers can begin redeeming their EIGEN stakedrop claims while season one phase one is live. Simply visit the EigenLayer claim site, connect your OKX Wallet, claim the EIGEN tokens you’re allocated, and begin staking and delegating. Find out more about EIGEN season one eligibility to see if you qualify.\n\nThe final word\n\nEigenLayer innovates on Ethereum by enabling the restaking of ETH to boost network security and speed up development. It helps to align the various interests within the ecosystem, offering incentives for additional protocol security. Key features like EigenDA aim to enhance data availability, improving Ethereum's efficiency.\n\nDespite its obstacles, EigenLayer is an important milestone in developing a stronger and more cohesive Ethereum ecosystem."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNNkVGcTVOamxieFdtV2paVFdJOGVicjFsc2JmRlNsU2Rsdk9hVEhJbzc1enQ1Wm5EMjMyV1NFblhRNFhmU3AwZy1VcVpqT3MzZ0piQkQxNGhYdjcxYnpjWHpkZXRYZ015QXM5aDByX1dXTUFMemJBLVZ4anprUHl3c3c1TncyX3pPMDBWZHlPTDZMdlNPckJSYjB1NWhna1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Lido’s stETH leapfrogs XRP market value amid Ether staking frenzy - DLNews",
        "content": "StETH is now the sixth-largest crypto by total token value, overtaking XRP by the same metric.\n\nThe latest jump comes amid an uptick in ETH deposits on Lido and Ether’s latest rally.\n\nLido’s flagship liquid staking token has overtaken XRP to become the sixth-largest crypto by market capitalisation with a value of $30 billion, according to CoinGecko.\n\nThe staked Ether product is now ten times more valuable than the DeFi’s protocol’s native governance token LDO, which has a total token value of $3 billion.\n\nThat milestone has come as staked Ether deposits on Lido have climbed to about 9.8 million Ether.\n\nLido is a liquid staking DeFi protocol. Users who stake Ether on Lido receive stETH, which represents the amount of ETH they staked on Lido.\n\nStETH also tracks the price of Ether, which is also enjoying a heady turn over the past few weeks, surging past $3,100 for the first time in two years.\n\nBut Ether’s price climb isn’t the only reason for this milestone, as Lido’s net deposits have experienced a significant uptick since the start of the year.\n\nInvestors are increasingly staking Ether amid the ongoing allure of potential airdrops and compounded yield opportunities in the buzzy, emerging restaking market. Lido’s stETH is one of the many deposit options, alongside RocketPool’s rETH, Coinbase’s cbETH, Swell’s swETH, for restaking on protocols like the $8 billion EigenLayer.\n\nIndeed, Lido’s staked Ether accounts for 35% of the ETH deposits on EigenLayer, second only to natively-staked Ether, according to data from the protocol’s dashboard.\n\nJoin the community to get our latest stories and updates\n\nThe rise of restaking\n\nRestaking is a buzzy new extension of the $94 billion Ethereum staking market. It works like staking but with an additional step.\n\nIn staking, investors lock their Ether on the blockchain — this can be natively or via a liquid staking provider like Lido. In the latter case, they receive liquid staking tokens.\n\nEther tokens natively staked are locked on the blockchain until withdrawn, a process that can take time depending on the exit queue at the time of withdrawal.\n\nWith liquid staking, users receive an equivalent token of their deposit that can be reused elsewhere in the market to mint stablecoins or earn additional yield, for example.\n\nIn restaking, investors can lock their liquid staking tokens like stETH again to earn even more yield — and more risk, per JPMorgan.\n\nRestaking could result in a “cascade of liquidations if a staked asset drops sharply in value,” wrote bank analysts.\n\nEthereum co-founder Vitalik Buterin has also raised concerns about the niche, indicating that complex and poorly designed models could overload the network.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBoeU5qQ3RDY0hGNHpZMDFfVlJiZUpzRHc2QWlBX29KN2xxVUFZUlZMTUV2ZG5HZ0hvWkpuaTFCcldRODBkZ29VYVdWZmp0Mml6dUlhbjZfZ2ZhSDJ1UWhhUnNEdUd4TEdfMXAw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "How to Transfer Tokens From MetaMask - Crypto Head",
        "content": "Table of Contents\n\nDisclaimer: This is not a validation of cryptocurrency or any particular provider, service, or product. It should not be taken as advice to engage in trading or use any services. Please check our terms and conditions .\n\nQuick Answer: Cryptocurrency transactions are increasingly common, with Ethereum-based tokens like Tether, Chainlink, and Binance coin being popular choices. Digital wallets are essential for storing these assets, and MetaMask stands out as a reliable, user-friendly option available as a browser extension and compatible with hardware wallets like Ledger and Trezor. MetaMask is a web3-based decentralized application that allows interaction with smart contracts and secure storage of cryptocurrencies. It keeps user data private while transactions are publicly visible on Etherscan. To send Ethereum (ETH) or ERC20 tokens from MetaMask, users need the recipient’s public address and to pay a gas fee. Custom tokens can also be transferred using MetaMask in conjunction with MyEtherWallet (MEW). Transferring funds from MetaMask to a bank account can be done through exchanges like Coinbase. MetaMask supports storing NFTs and is celebrated for its accessibility, being a free browser extension that’s easy to use.\n\nUsing cryptocurrencies for financial transactions has become increasingly popular in recent years. Some of the most popular assets today are Ethereum-based tokens such as Tether (USDT), Chainlink (LINK), and Binance coin (BNB).\n\nFor crypto-beginners, one of the first challenges is to find a solution as to where to store their assets, since cryptocurrencies need a special digital wallet. The market offers countless digital wallets, so it can be difficult to find one that is reliable, easy to use, and secure.\n\nWhen it comes to sending and receiving Ethereum and ERC20 tokens, MetaMask is a great choice. How to send token from Metamask? In most cases, you only need the recipient’s public address and other details like the amount and gas fees you need to pay. For custom tokens, you need to use MyEtherWallet (MEW) to transfer them.\n\nWhat Is a MetaMask Wallet?\n\nMetaMask.io is an online cryptocurrency wallet. It comes in the form of a web browser extension available for Google Chrome, Brave, Vivaldi, Opera, and Firefox, and it’s also compatible with the Ledger and Trezor hardware wallets.\n\nMetaMask is based on open-source code and has a dedicated developer community that constantly works on updating the platform so as to provide its users with the best quality of service.\n\nIt is a web3-based decentralized application which allows users to interact with smart contracts using ERC20 tokens. The main purpose of these wallets is to store ethers and other cryptocurrencies safely. They allow users to send funds from one account to another, and also keep track of all transactions made through them.\n\nMeta Mask also provides access to various DApp features such as sending Ethers, viewing transaction details, etc.\n\nSecurity\n\nSecurity is always a major concern when it comes to cryptocurrencies. MetaMask performs great in this field since they offer several layers of protection. To start off, the only way to access the users’ assets is through a user password.\n\nThe second layer of user authentication is a unique 12-word seed phrase, known as a private key.\n\nThis means that the user’s main concern is to keep the password and seed phrase safe and not to worry about the security of their funds. Still, using MetaMask combined with a secure hardware wallet is an even more secure option.\n\nBecause MetaMask deals with Ethereum-based transactions, all of them are publicly visible on Etherscan, as they are registered on the Ethereum blockchain. However, the MetaMask wallet account data is always kept private.\n\nFeatures and Interface\n\nThere are lots of reasons why MetaMask is ranked as the best for desktop use among numerous Ethereum wallets. Its user-friendly interface and versatile features give it an edge over the competition. For instance, apart from storing Ethereum blockchain-based assets, you can also transfer tokens to cryptocurrency exchanges such as Coinbase, Binance, and other third-party websites through MetaMask.\n\nBelow, we’ll take a look at a step-by-step tutorial on how to transfer tokens using MetaMask. For now, keep in mind that MetaMask supports only ETH, ERC20, and several custom tokens.\n\nHow to Send Tokens From Metamask\n\nHow to Transfer from Metamask Ethereum (ETH)\n\nAll transactions from MetaMask require a small gas fee, which is standard for all transfers.\n\nWe will start with the ETH transfer process.\n\nSo, let’s say that you have some ETH in your MetaMask wallet and you want to transfer them to a third-party website.\n\nOpen the MetaMask extension in your browser and make sure you’re logged into your account. Then, select the send option. This will open a window with a field that says recipient address, where you should paste the recipient’s wallet address. Be sure to double-check the address, since there’s no way to recover your assets if they get sent to the wrong address or a destination that is incompatible with the currency you sent. In the field amount, you can enter the exact amount of ETH you wish to transfer, using as much as 18 decimals. Clicking on the next button will prompt MetaMask to create a transaction window, with all the details. In the top section of this window, you can see your account details on the left and the recipient’s account details on the right. Underneath, you will see the exact amount of ETH you selected for the transfer. The Gas Limit and Gas Price fields can be changed, but it’s fine to leave them at their default values. (Note: If you’re not sure about how much your ETH transaction from MetaMask will cost, you can use the ETH Gas station to calculate the price) When everything is in order, you just have to press the send transaction button to start the transaction. Just select Yes in the pop-up window and that’s it. Depending on the busyness of the network, it could take up to a few minutes to receive confirmation that the transaction is complete.\n\nTransferring ERC20 Tokens\n\nThe process is relatively the same for ERC20 tokens, with a few differences.\n\nWhen initiating an ERC20 transaction, you fill in the amount section with the number of tokens that you want to transfer. Next to the amount field, you can select the ERC20 token from the dropdown list. (Note: If you’re using MyEtherWallet or MEW with MetaMask, it will automatically calculate the transaction gas limit based on average market activity and Ethereum network busyness) It’s that simple. After the transfer is complete, you will see the transfer hash and details at the bottom of the page.\n\nTransferring Custom Tokens\n\nMetaMask also supports the transfer of custom tokens.\n\nAt first, it can seem a bit complicated, since there is no send button next to the custom tokens. Instead, you have to use MEW, and connect it with your MetaMask account. After connecting MEW with MetaMask, all you have to do is add your custom token contract address in MetaMask. The custom tokens will then appear in the dropdown menu ready for sending. The rest of the procedure is identical to transferring ERC20 tokens.\n\nFrequently Asked Questions\n\nHow do I transfer tokens from Metamask?\n\nTo transfer tokens from Metamasks, click on “Settings” then select “Exchange”. Enter the amount of ETH/ERC20 token you want to send. Click on “Send”, enter the address where you would like to receive the tokens, and confirm the transaction. The other option is to use MyEtherWallet.com to create a new wallet, add your Ethereum address, and then send the tokens directly to yourself.\n\nHow do I transfer money from Metamask to my bank account?\n\nThe easiest way to transfer funds from Metamask to your bank account is through Coinbase. To use Coinbase, you need to create an account for yourself first. Then, you would go to the “Send” tab at the top right corner of the pageand click on “Funds Transfer”. Enter the amount you want to send, select the wallet address you want to receive the funds into, and then confirm the transaction. This should be done immediately after sending the funds.\n\nHow do I send tokens to Metamask?\n\nTo use Metamask, simply click on “Send” under the “Tokens” tab. Then select Ethereum from the dropdown menu. Next, enter the amount of ETH you want to transfer into Metamask, then press “Transfer.” Once the transaction has been confirmed, Metamask should show the new balance for your account.\n\nCan Metamask store NFTs?\n\nMetamask supports multiple types of ERC20 tokens, including NFTs. To add any token, click “Add Token” at the top right corner of the page, then select the token from the drop down list. Once selected, enter the address for the token into the field provided. Click “Save.”\n\nA Few Words Before You Go…\n\nAs you can see, using MetaMask to transfer your tokens to third-party token addresses is relatively simple, and even more importantly, it’s secure.\n\nIt’s no wonder that MetaMask is so popular among users because it’s easy to use, free, and available as a browser extension.\n\nShare on: Facebook Twitter LinkedIn Reddit\n\nAbout The Author"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE5lb3RyUGZQMDFaTmdNZmprNGtLVHgxTjIwUWVSZENhclpoVGQ0NTdneEtMOUhTa1VzVTZpa3QzenZiVHRDak84WXNFMUpYSjBPYmtxeGN5MW5HeHR3alg4RWd0dzdZQ3BITmRsYnhJQV90UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Dencun Upgrade: Tokens To Watch Out For - BitPinas",
        "content": "The much-awaited Dencun update on Ethereum is said to happen in the first quarter of the year.\n\n(Read more: 24+ Potential Crypto Airdrops to Watch Out For in 2024)\n\nThe Dencun Upgrade: A Brief Overview\n\nWhile Dencun is expected to fix some of the major issues with the Ethereum network, one of the most anticipated benefits of this update is to significantly improve Ethereum’s scalability and efficiency that will reduce the fees on all the layer two protocols built on top of the network.\n\nThis is a plus for Ethereum L2 users as transactions will be cost-effective, mostly because Ethereum L2s are known for being dapp developer-friendly through smart contracts and more use cases like NFTs, lending, staking, and even web3 games.\n\nOther highlights of the upgrade include:\n\nThe introduction of proto-danksharding, which will enhance the throughput and efficiency of L2s through data blobs, thus, improved data availability is expected.\n\nThe introduction of temporary data storage on smart contracts, which will allow immediate clearing of intermediate data after transaction completion, thus, reducing permanent storage overheads.\n\nThe restriction of the “SELF DESTRUCT” function for smart contracts, thus, improving a contract’s stability and predictability.\n\nThe activation of Beacon Chain’s block roots to be accessible to the EVM, which will allow smart contracts to directly access the network’s consensus state without needing external oracles, thus, reducing external dependence.\n\nThe joint cooperation of multiple EIPs to collectively contribute to optimizing the validator lifecycle and operations on Ethereum.\n\nAdvertisement\n\nWith this, BitPinas has listed a list of Ethereum L2s that could soar alongside the Dencun update.\n\nEthereum Layer 2s\n\nPolygon\n\nPolygon (https://polygon.technology/), formerly known as the Matic Network, is known as the “Ethereum Boster” because it seeks to solve Ethereum’s scalability and poor user experience challenges by scaling the network.\n\nIt provides a platform for building and connecting Ethereum-compatible networks and allows developers to build dApps that can benefit from faster and cheaper transactions than the Ethereum blockchain while still being able to benefit from the security and network effects of its mainnet.\n\nRead: Polygon (Formerly) MATIC Philippines Guide And Usecases\n\nWhat to Watch Out For?\n\nSome of the Polygon developers are pushing to transition from $MATIC to $POL, which will function as the lone token within the Polygon ecosystem.\n\nArbitrum\n\nArbitrum (https://arbitrum.io/) is another L2 solution that seeks to scale Ethereum.\n\nIt basically allows users to build and access web3 apps and deploy smart contracts in a cheaper and faster transaction.\n\nIt recently introduced its flagship product, the Arbitrum Rollup, which is an Optimistic rollup protocol that inherits Ethereum-level security.\n\nWhat to Watch Out For?\n\nArbitrum One is the number one L2 by TVL and has the highest transaction value in the Ethereum ecosystem.\n\nOptimism\n\nOptimism (https://www.optimism.io/) is a blockchain that claims to be low-cost and lightning-fast.\n\nIt has three features: the OP Mainnet, which is an EVM-equivalent Layer 2 blockchain connected to Ethereum; the OP Stack, which is the standardized, shared, and open-source development stack that makes it easy to spin up production-ready Layer 2 blockchain just like OP Mainnet; and the Superchain, which is a network of OP Stack chains that share a bridging protocol, governance system, and more.\n\nWhat to Watch Out For?\n\nThe OP Mainnet is the second L2 2in terms of TVL among the Ethereum ecosystem.\n\nCOTI\n\nCOTI (https://coti.io/) is a Privacy Centric L2 on Ethereum, which claims to be built with a groundbreaking privacy technology that is fast, secure, and can run on any device.\n\nIt eyes to solve Ethereum’s data sensitivity issue by enabling end-to-end encryption across web3 applications.\n\nWhat to Watch Out For?\n\nCOTI’s privacy preservation solution is the first-ever solution to exist in the industry.\n\nMantle\n\nMantle Network (https://www.mantle.xyz/) is a technology stack for scaling Ethereum that is EVM-compatible, which means all the contracts and tools that work on Ethereum also work on Mantle Network with minimal modifications.\n\nIt has two audiences: users that can experiment with web3 apps and developers that can deploy smart contracts in an efficient, low-fee environment.\n\nWhat to Watch Out For?\n\nMantle is the third largest liquidity staking derivatives protocol in terms of volumes staked.\n\nMetis\n\nMetis (https://www.metis.io/) is an Ethereum L2 Rollup platform that claims to offer simple and fast smart contract deployment within the network.\n\n“Metis offers an exclusive list of products to blockchain project developers, app developers, and everyone who is interested in obtaining modern solutions for Ethereum challenges.Select a product to start with Ethereum Layer 2 and access an extended range of opportunities,” the team advertised.\n\nWhat to Watch Out For?\n\nIts centralized sequencer alpha mainnet launch is set to happen in March.\n\nThis article is published on BitPinas: Ethereum Dencun Upgrade: Tokens To Watch Out For\n\nDisclaimer:"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPa29HMHFqTDc0Z0RnTjI0OWVqSUR5SXliTmtGZzNUZWpDb044dk13b2pjN2p0ektuZ3NTaUJMNXNFYzBmajhwSlVlMXNQSHBHZmZPMk9wYlZZTjJfcXB0Qk1fZm9qU3o2RmtlQkg2OXViZHRKOEdTbnlFUjA4VjByRnJBSDlpb0paTVVCbFNHbmpIcEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum: Shaping the Future of Finance Together - Kenyan Wallstreet",
        "content": "Over the past decade, cryptocurrencies have gone from an obscure technology embraced by innovators and early adopters to reshaping the landscape of global finance. The two most influential and widely-used cryptocurrencies, Bitcoin and Ethereum, have spearheaded this financial revolution. Together, they are driving financial inclusion, decentralizing services through blockchain technology, creating investment opportunities, and spurring technological innovation across countless industries. However, they also face challenges around volatility, security, regulations, and more on the road to mainstream adoption.\n\n\n\nFor a deeper insight into Bitcoin’s market trends and price predictions, explore this comprehensive analysis of Bitcoin price prediction. Understanding the future trajectory of Bitcoin is essential for individuals navigating the dynamic landscape of cryptocurrency investments.\n\n\n\nFinancial Inclusion for the Unbanked\n\nCryptocurrencies have brought financial services to hundreds of millions of unbanked and underbanked individuals across the world. According to the World Bank, around 1.7 billion adults globally lack access to formal financial services. This prevents them from saving, obtaining credit, making payments securely, building credit history, managing financial risks, and more.\n\nBitcoin, with its permissionless and pseudonymous nature, finally enabled these unbanked populations to participate in the global financial system. Using Bitcoin, anyone with an internet connection can send or receive money across borders trustlessly without requiring documentation, identification, or approval from any gatekeeper. Platforms like Paxful allow trading Bitcoin for hundreds of payment methods, including gift cards, online wallets, and cash payments.\n\nThe decentralization of finance through cryptocurrencies has been revolutionary for financial inclusion. Remittances, which many underbanked populations rely heavily on, can now be sent faster and cheaper through crypto compared to traditional wire transfers. DeFi lending markets allow users to permission lessly access loans using cryptocurrency as collateral, with no credit checks.\n\nDecentralized Finance – The Future of Banking\n\nDecentralized finance, popularly known as DeFi, refers to blockchain-based financial services that do not rely on traditional banks or financial intermediaries. The majority of DeFi applications are currently built on the Ethereum network, taking advantage of the platform’s programmability, smart contracts functionality, and active ecosystem of developers. To start using Ethereum’s DeFi protocols, users first need to obtain some ETH. A convenient option is to directly buy eth with debit card on mainstream cryptocurrency exchanges that support debit card purchases.\n\nDeFi applications aim to decentralize financial use cases such as lending, trading, derivatives, asset management and more by using smart contracts instead of centralized institutions. For example, lending protocols like Aave and Compound allow users to seamlessly lend and borrow assets through permissionless liquidity pools funded by lenders in the network. Decentralized exchanges (DEXs) like Uniswap enable trading crypto tokens through automated liquidity pools instead of order books.\n\nBy decentralizing the control and governance of these financial applications using the underlying blockchain networks, DeFi aims to make finance more transparent, accessible, efficient and composable. Although still early, DeFi has grown exponentially, with over $100 billion locked into Ethereum DeFi applications alone promising a more open and connected financial future for all.\n\nAutomating Finance Using Smart Contracts\n\nAt the core of Ethereum’s groundbreaking capabilities lie smart contracts – programmatic agreements on the blockchain which self-execute based on predefined conditions. These enable automation and remove intermediaries using code rather than relying on all parties to manually execute their obligations.\n\nSmart contracts open up an array of new possibilities. Many DeFi lending protocols on Ethereum use smart contract collateral to secure loans trustlessly. NFT marketplaces like OpenSea gain efficiency by automating transactions and royalty payments to creators using smart contracts instead of lawyers and accountants. Decentralized insurance offerings pay out verified claims automatically when pre-agreed conditions configured in a smart contract are triggered. Prediction markets, derivative contracts, transparent supply chains and more all gain programmability using Ethereum’s smart contract infrastructure.\n\nWhile the applications are abundant, smart contract execution remains deterministic, immutable and highly composable, allowing money, digital assets and financial services built on Ethereum’s blockchain to combine seamlessly in previously unimaginable ways. This composability unlocks new opportunities for innovation combining decentralized applications using existing building blocks.\n\nInvestment Opportunities with Cryptocurrencies\n\nBeyond enabling new models for finance, cryptocurrencies themselves have evolved into a high-growth alternative asset class, providing early investors tremendous opportunities. In fact, an investment of just $1,000 into Bitcoin in 2010 would be worth over $50 million today! Of course, the extreme volatility makes timing notoriously difficult. Still, institutional and retail adoption has been rising steadily over recent years as cryptocurrencies become more mainstream.\n\nIn 2021, Tesla allocated $1.5 billion into Bitcoin, while MicroStrategy invested billions into digital assets instead of traditional corporate treasury reserves. Major banks like Goldman Sachs have also enabled trading of Bitcoin futures. These big institutional players helped legitimize cryptoassets as an emergent institutional investment vertical similar to commodities, hedge funds, venture capital and more. Retail traders have also flooded into the scene, using exchanges like Coinbase and Kraken to gain exposure.\n\nWhile Bitcoin remains the most popular and stable cryptocurrency dominating investor interest, Ethereum provides unique investment opportunities given its position as the leading blockchain for decentralized applications. Investing in the native token Ether allows speculation on the growing activity of DeFi, NFTs, games, DAOs, stablecoins and other use cases atop the network. As adoption of applications on Ethereum increases, it stands to boost the underlying network use and its token value.\n\nTechnological Innovation and Impact\n\nThe technology powering Bitcoin and Ethereum – as well as the wider landscape of cryptocurrencies and blockchains – promises profound innovations across industries. They allow valuable digital assets like money, identity, credentials, property deeds, licenses and artwork to be controlled, transacted and verified without requiring trusted third parties. This has the potential to transform legacy models across healthcare, supply chain, music, manufacturing, voting, credentials and countless other industries.\n\nAlready NFTs are reinventing digital art ownership and royalties for creators. Sensor-equipped hardware like the GrainChain system uses the Bitcoin network to establish transparent provenance tracking from farms to facilities to stores in supply chains. Healthcare providers can leverage blockchain identities to enable control over sensitive records to patients without intermediaries. Musicians get paid directly by integrating systems like Audius with social media apps instead of centralized music studios.\n\nDespite their youth, blockchains have inspired incredible amounts of innovation in both finance as well as technology. Bitcoin gave birth to cryptocurrencies – Ethereum expanded that into decentralized applications. Yet much of their transformative capacity still remains untapped. And with the next generation of shards, layer 2 solutions, sidechains and cross-chain bridges aim to scale throughput and lower latencies even further to support internet-scale adoption.\n\nRegulatory Challenges on the Path to Maturity\n\nOf course, no major new emergent technology comes without obstacles on the road to maturity and mainstream adoption. Cryptocurrencies have been saddled with several key challenges around volatility, security, and lack of regulatory clarity that have slowed institutional and governmental buy-in.\n\nFirstly, cryptocurrency markets themselves remain notoriously volatile, causing panic selling just as severe euphoric booms which witness coins multiplying rapidly in price over short periods. Government policies banning crypto trading often spark dramatic price movements as well. Until stability in pricing and valuation models for crypto assets emerge, most retail participants and corporates may remain apprehensive to embrace digital currencies.\n\nSecondly, security of keys and accounts remains a glaring issue given the irreversible and pseudonymous nature of blockchain transactions. Investors losing access to their private keys remain permanently locked out of their funds. Hacks targeting vulnerable exchange and wallet providers have cost users billions over the years. Solutions usingThreshold signatures, biometrics, hardware security modules and multi-party computation provide sophisticated key management targeted at enterprises. Yet better backup, storage and encryption standards for end users are critical for consumer and regulator confidence.\n\nFinally, the lack of consistent governmental policies, guidelines or legal frameworks across jurisdictions hampers institutions leaning into crypto adoption at scale. While crypto-friendly regions like Miami and Wyoming attract talent – other major economies like India and China have flip-flopped between conflicting stances. Achieving better international consensus or collaboration to address concerns around illicit financial flows while supporting innovation could be instrumental to unleash the full potential of crypto.\n\nThe Inevitability of Mass Adoption\n\nDespite facing regulatory uncertainty and experimenting with technical and economic tradeoffs, the mass adoption of blockchain-based digital assets seems inevitable in the years to come. Much like the commercial internet saw rapid early growth amongst consumers in the 90s beyond clunky interfaces and weak infrastructure, potential use cases for cryptocurrency abound across the mainstream today in ways that barely scratch the surface of what these networks can achieve in the future.\n\nUltimately, Bitcoin and Ethereum represent two sides of the same pioneering coin – one fulfilling digital gold and a stable store-of-value, while the other serves as the most fertile launchpad for decentralized applications. Together, they have kickstarted a movement towards open access, transparency and equal opportunity for finance and technology using the power of cryptography and blockchain. In the process, they have opened new worlds of innovation combining code, community and capital in ways that will shape and impact global finance for generations to come.\n\n\n\n\n\n."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQU1ZocTVYaEVyTmpiTHV1MGNxaXBaYWJfYS1OR1pQcFQ0eDdla3NTNzAtMHFzX3IySnpVWDhkMkVYb0s5RXppREdfMENSRU9lSDdYRmNNVVdHMS1Ob1hNMmNDQjZlZ3lBa3l2MzFVeXhDbnU1RmxWcVZkOV8yLUlwMHJIMkhtb2VOOHhwYWVpTVRDTXYyVWJ5aUVmTm9iazFvWmNMOFN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "How to Deposit and Withdraw using Bybit Wallet (Web3) - Bybit",
        "content": "How to Deposit and Withdraw using Bybit Wallet (Web3)\n\nHere's a step-by-step guide to depositing, withdrawing, and viewing the transfer history of your Bybit Wallet.\n\nDeposit Tokens\n\nThere are two (2) methods to deposit into your Bybit Wallet.\n\nFrom Your Bybit Funding Account\n\nStep 1: Hover your cursor over Assets in the upper right corner of the Bybit page, then select Withdraw.\n\nAlternatively, please head to your Funding Account page and click on Withdraw under the coin you would like to withdraw.\n\nStep 2: Click on Bybit Wallet, and your Bybit Wallet (Web3) address will be automatically filled. Select the Chain Type and enter the amount you wish to withdraw to your Bybit Wallet (Web3).\n\nFrom Your External Wallet\n\nLet's take MetaMask and the BNB chain as an example.\n\nStep 1: Select Binance Smart Chain under Ethereum Mainnet on the MetaMask page.\n\nStep 2: Click on the copy icon to copy your Bybit Wallet address.\n\nStep 3: Click on Send and paste your Bybit Wallet address into the input box. Please make sure you choose BSC, otherwise, your USDT and BNB may not be transferred successfully.\n\nWithdraw Tokens\n\nThere are two (2) methods to withdraw from your Bybit Wallet.\n\nTo Your Bybit Funding Account\n\nStep 1: Click on Withdraw in the column of the token you wish to withdraw.\n\nStep 2: Please follow the steps below to withdraw your tokens:\n\na. Click on the label Bybit Funding Account next to Your Address.\n\nb. Enter the amount you want to withdraw, or click on All to make a full withdrawal.\n\nc. Choose your preferred gas fees: Slow, Average and Fast.\n\nNote: After entering a valid receiving address, you will be able to see the estimated time and gas fee (in ETH) in this column. To ensure a successful withdrawal, please make sure you have a sufficient ETH balance in your Bybit Wallet, regardless of the type of coin you intend to withdraw.\n\nd. Click on Next.\n\nStep 3: Please make sure that all information is correct, then click on Send.\n\nStep 4: Click on Send Verification Code. A verification code will be sent to your email address. Please enter the verification code you received.\n\nYour withdrawal request has been successfully submitted!\n\nTo Your External Wallet\n\nStep 1: Click on Withdraw in the column of the token you want to withdraw.\n\nStep 2: Please follow the steps below to withdraw your tokens:\n\na. Enter the receiving wallet address in the wallet address field.\n\nb. Enter the amount you want to withdraw, or click on All to make a full withdrawal.\n\nc. Choose your preferred gas: Slow, Average and Fast.\n\nNote: After entering a valid receiving address, you will be able to see the estimated time and gas fee (in ETH) in this column. To ensure a successful withdrawal, please make sure you have a sufficient ETH balance in your Bybit Wallet, regardless of the type of coin you intend to withdraw.\n\nd. Click on Next.\n\nStep 3: Please make sure that all information is correct, then click on Send.\n\nStep 4: Click on Send Verification Code. A verification code will be sent to your email address. Please enter the verification code you received.\n\nYour withdrawal request has been successfully submitted!\n\nView Transfer History\n\nStep 1: Click on Orders in the upper right corner of the Bybit Web3 page to enter the Orders page.\n\nStep 2: View your deposit and withdrawal history under Pending or Submitted."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMi8wFBVV95cUxQaDNTN05oYkpNZjdZZEVpUzZOT210WUVVNmxacnVTbXU0djNDbDlOYWNTcTE2WUxJX0UwZjRRNnVpV2RMMmJGak50blhPTGNyeWVYcEFLM2cxOXlHNEVlalFvY3ppSk9PN2s3ZHpWYlIzTlBkRjZKcktqU3VJbVRmenhqLW9Hc2VGUzZGVy0wdXJMLXlnSmxhbUtLZXRRbGpWNEdoblNBNHE1ckd6bk5JUTdTQlR0WktQVE5VN25RTTlfQUd1YWl3M3NyZjFyQWZ0WVBEWlh3bmlYakJLQXZMN3V6d1FVVW8xUXZKMFQydVc0Vm_SAfgBQVVfeXFMUG1mdE1zV1ctanhjZEVhbnIzSkMtRnpDVi1GRVNud0t2b3BpdXJadEN4cmJ1cnNWZTdwTjNjTnZBVDh1SHBxc1VaU0ltSmo2YjNwY3o0YlFlTGRvM3ZZaHFIbUhQT2lfeXRRLWd6aVdxcmk0N29PeFhad3hIcmhNVVMtRXN0aUZYYWJFNzk4SDRaelNiLTNOWV8tMDhfQUVfNDI0NlpaYmtteEVfREItWUk1RjIzU3lBYXdOVTZqdVVNT3pTRXFMUG1FQnZDRFI1RHlBaldWYU0tMXd0cE1uZTN2WGdhNHZ5ZFNnY09HRGFvQzl6ZWNqcVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Ethereum Climbs Above $3,000, Market Cap Approaches $2 Trillion - ABP Live",
        "content": "Ethereum (ETH), the second-most popular crypto coin after Bitcoin (BTC), has managed to climb above the $3,000 mark over the weekend, accomplishing a 20-month high. Bitcoin (BTC), on the other hand, managed to remain stable within the $51,000 range. Other top coins, including the likes of — Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — saw minor dips across the board. The Flare (FLR) token emerged as the biggest gainer of the lot, with a 24-hour jump of over 18 percent. Helium (HNT) became the biggest loser, with a 24-hour dip of nearly 5 percent.\n\nThe global crypto market cap stood at $1.99 trillion at the time of writing, registering a 24-hour gain of 0.67 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $51,507.28, registering a 24-hour dip of 0.12 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 45.31 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $3,099.39 marking a 24-hour gain of 2.71 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.73 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour loss of 0.57 percent, as per CoinMarketCap data, currently priced at $0.08557. As per WazirX, Dogecoin price in India stood at Rs 7.51.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour dip of 0.11 percent. At the time of writing, it was trading at $69.98. LTC price in India stood at Rs 6,120.01.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5402, seeing a 24-hour loss of 0.92 percent. As per WazirX, Ripple price stood at Rs 47.38.\n\nSolana (SOL) Price Today\n\nSolana price stood at $103.58, marking a 24-hour gain of 0.10 percent. As per WazirX, SOL price in India stood at Rs 9,046.11.\n\nTop Crypto Gainers Today (February 26)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nFlare (FLR)\n\nPrice: $0.0472\n\n24-hour gain: 18.20 percent\n\nTheta Network (THETA)\n\nPrice: $1.49\n\n24-hour gain: 14.99 percent\n\nArweave (AR)\n\nPrice: $15.90\n\n24-hour gain: 13.45 percent\n\nMantle (MNT)\n\nPrice: $0.8972\n\n24-hour gain: 13.05 percent\n\nImmutable (IMX)\n\nPrice: $3.34\n\n24-hour gain: 9.62 percent\n\nTop Crypto Losers Today (February 26)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nHelium (HNT)\n\nPrice: $8.25\n\n24-hour loss: 4.85 percent\n\nCelestia (TIA)\n\nPrice: $16.58\n\n24-hour loss: 4.74 percent\n\nRender (RNDR)\n\nPrice: $7.25\n\n24-hour loss: 3.46 percent\n\nSei (SEI)\n\nPrice: $0.818\n\n24-hour loss: 3.28 percent\n\nKaspa (KAS)\n\nPrice: $0.168\n\n24-hour loss: 2.81 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nParth Chaturvedi, Investments Lead, CoinSwitch Ventures, said, “BTC (-0.2%) briefly dipped below $51K on Saturday before regaining its rangebound performance around $51.5k. BTC seems to be going through a cool-off period currently. With investor sentiment still strong, many are expecting a positive price action. ETH (+2.3%) reclaimed the $3k level for the second time in February. The recent upward movements have also elevated ETH’s Relative Strength Index (RSI) while growing its Total Supply in Profit; around 1 million ETH in profit over the weekend.”\n\nRajagopal Menon, Vice President, WazirX, said, “Bitcoin is consolidating around the $52,000 mark after a substantial two-week surge, supported by a resilient stock market, the upcoming halving event, and consistent investments in spot. Bitcoin ETFs. Bitcoin's stability above $50,000 is noteworthy, with alternative cryptos attracting short-term investors. The current price action indicates support at $50,500 and resistance at $53,000, suggesting a consolidation phase. With the RSI approaching overbought levels and rising moving averages, bullish momentum is evident. A breach above the $53,000 resistance could trigger a significant rally, possibly reaching the $60,000 milestone.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin's price resilience, bolstered by legal victories such as the recent Texas Blockchain Council and Riot Platforms' success against US energy regulators, underscores its stability amid regulatory uncertainty around the world, particularly in Nigeria. While calls for regulatory clarity persist, institutional interest is growing, exemplified by Carlson Group's inclusion of bitcoin ETFs. With Bitcoin trading around $51,600, holding support at $51,000 is key for a potential upside trajectory with resistance at $53,943, $55,214 and $56,497. The RSI at 55 suggests balance, while the 50-day EMA at $51,079 suggests bullish sentiment. As a result, a cautiously optimistic outlook prevails, dependent on sustained levels of support and regulatory developments.”\n\nShivam Thakral, CEO of BuyUcoin, said, “Bitcoin is experiencing consolidation over the last few weeks by trading under the $50,000-$53000 range. After rallying by around 36% since the start of 2024, Bitcoin has failed to breach the $53,000 resistance. A breakout above this level would push the price of the biggest cryptocurrency up to $60,000 in the near future.”\n\nCoinDCX Research Team told ABP Live, “In the last 24 hours, the crypto market showed a slightly bearish sentiment with the first net outflow from BTC ETF since January 25, 2024, signalling bearishness. Additionally, funding rates were not favourable for bulls. Technically, BTC closed in the red but stayed within its range, with local support around $50,600 and resistance at $52,500. Meanwhile, ETH remained relatively stable, hovering between $2,900 and $3,000, with local support at $2,880 and resistance at $3,030. In positive news, Reddit disclosed its investment of excess cash into Bitcoin and Ethereum, hinting at potential future investments in these cryptocurrencies.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQc05MMGMtT21VbmEyY1ZOUjk0R2tzWXlOMEtUU213QnVITEh2QzJYNlFXaUpXUmJnOHhMbW15VDRIN0Q3OUQ0Y2p3OTFlNW1PcHFPQ2pUdDlWTlU1ckFCalBoV0lWeTUwVjNXbnNQeC11amE4R20wUXg2QkZOVkU1QVVIMG5EWUJQU25pRnZzbHFsZmFuVlg5QUNWY0NFbkcyc3l6Mw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Feb 2024 08:00:00 GMT",
        "title": "Sui Recognized as 2024 Blockchain Solution of the Year at AIBC Eurasia Awards - Coinfomania",
        "content": "The Layer-1 Received the Top Honor at the Eurasia Awards While Experiencing a Period of Unprecedented Growth and Recognition\n\nSui, the layer 1 blockchain that has experienced explosive growth since its mainnet launch in 2023, has emerged as the winner at the Eurasia Awards held during the second edition of AIBC Eurasia in Dubai. The gala event, renowned for its world-class attendance and previous winners such as Animoca Brands and Crypto.com, witnessed the Sui Foundation being honored for the leading position the blockchain has achieved during the past months. Other nominees for the 2024 award included Near Protocol and 1inch Network.\n\nSui’s recognition comes amidst its significant growth and influence in the blockchain space. The Sui ecosystem has gained significant traction during the past months. The layer 1 recently surpassed $600M in Total Value Locked (TVL) and secured a spot in the top 10 of DeFi ecosystems. Likewise, examination of token flows via Wormhole—a leading cross-chain protocol that supports Sui—shows that, of the almost $500M worth of funds that left Ethereum through Wormhole in the last 30 days, over 64% of it was moved to Sui.\n\nThe award decision was made on February 11, while the ceremony and the announcement took place on February 25, at the Festival Arena in Dubai. Sui’s dedication to pushing the boundaries of blockchain technology, as evidenced by its recent partnerships and expansions, has solidified its position as a leader in the industry.\n\nGreg Siourounis, Managing Director of the Sui Foundation, said, “It’s truly an honor for Sui to receive this important recognition from AIBC. Winning the Eurasia Award for best blockchain solution speaks to the hard work and impactful contributions of the entire Sui community including our local partners like Ghaf Labs. This award should inspire builders on Sui to continue leveraging the network’s unique advantages and also encourage new or existing projects to opt into the fast-growing Sui ecosystem.”\n\nThe AIBC Eurasia Awards featured a diverse array of categories, each shining a spotlight on exceptional contributions within the blockchain and gaming industry. Other notable categories included “Web3 Gaming Leader of the Year,” “Crypto/Web3 Media of the Year,” and “Best Metaverse Project 2024.”\n\nThis distinguished panel that selected Sui as the Blockchain of the Year included industry veterans and business leaders such as Olga Yaroshevsky (Ph.D. and AIBC’s Lead Producer), Pavel Matveev (CEO at Wirex), and Giacomo Arcaro (renowned seed investor and Ethereum evangelist).\n\nDisclaimer: This is Sponsored Content. Coinfomania does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. Readers should do their research before taking any actions related to the company stated in the release."
    }
]