[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOcU83RHZGWDFrSGFlMVJVZ29WRktpM20yaU5DNDFIRWNxNkR3eVk2MDVPVkJxMkZvdEJrWUlDRXE0V3hIN1RBWlMtdmNTVzNNYWQwYnRzemtmRnRRcXczNmNlRG0wODVHVmMwRFc4WmdHQjE2aU54WG01b0ZlOUxHTG8xV19zelZOQ1dBVXlmT2RtYV80MGhmNVJBZ1R1aWN5Wmc1azQzSWZYbUNQVzk2aG4zU1piRFZoaGlsQ184dUFTeXZk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Proposes Hard-Fork Strategy to Protect Ethereum From Quantum Attacks - The Quantum Insider",
        "content": "Insider Brief\n\nEthereum co-founder floats a hard fork strategy to safeguard Ethereum funds against potential quantum computer attacks.\n\nVitalik Buterin’s strategy involves a series of measures designed to fortify Ethereum’s defenses.\n\nSome community members have voiced concerns over the efficacy of such measures if quantum computers capable of decrypting Ethereum wallet.\n\nEthereum co-founder Vitalik Buterin has proposed a hard fork strategy aimed at safeguarding Ethereum funds against potential quantum computer attacks. This proposal has ignited a widespread discussion on the necessity of quantum security measures within the blockchain ecosystem, as reported by Blockchain.News.\n\nButerin’s proposed strategy involves a series of measures designed to fortify Ethereum’s defenses in the event of a quantum computing breach.\n\nA quantum computer’s theoretical ability to solve certain mathematical problems far more efficiently than classical computers are the cause for concern. These cryptographic techniques serve as much of blockchain’s security. Quantum computers could — again, theoretically — undermine Ethereum’s cryptographic bedrock by decrypting private keys and compromising the integrity of smart contracts. This quantum capability could also disrupt consensus mechanisms, centralizing control or threatening the security of staked assets, which would Ethereum’s long-term viability and undermining trust in the platform.\n\nKey Steps\n\nKey steps were discussed in the Ethereum Research forum. The steps include the reversion of all blocks subsequent to the detection of a quantum attack, the suspension of traditional externally owned account (EOA) transactions to prevent further vulnerabilities, and the introduction of a new transaction type tailored for smart contract wallets that aligns with the anticipated RIP-7560 standard.\n\nThe proposal also outlines the implementation of an innovative transaction type or opcode that would enable users to submit STARK proofs. These proofs verify the user’s knowledge of a private preimage and a public address generated through approved hash functions, culminating in the replacement of the user’s account code with a quantum-resistant validation mechanism.\n\nAmong these deliberations, the web site reported that some community members voiced concerns that these measures would not be effective if people with malevolent intentions secure quantum computers capable of decrypting Ethereum wallets. These skeptics argue that distinguishing between legitimate owners and attackers could be extremely difficult under such circumstances. They advocate for the adoption of NIST standardized algorithms in a hybrid configuration with classical algorithms, such as combining the Dilithium and ed25519 algorithms, despite the resultant increase in block sizes due to the high number of signature and public key sizes of many current post-quantum schemes.\n\nAlternative propositions include the development of machine learning systems dedicated to the surveillance and identification of anomalous transactions, serving as an early warning mechanism to activate a fail-safe fork.\n\nThe Ethereum community’s engagement with these quantum security challenges underscores the sector’s proactive stance in navigating the security arms race posed by quantum computing advancements. Innovations such as Lamport signatures and ERC 4337-based quantum-resistant smart contract wallets, along with the integration of quantum-safe cryptographic solutions in digital signature applications, epitomize the blockchain sector’s commitment to resilience and adaptability in the face of technological threats.\n\nIf you found this article to be informative, you can explore more current quantum news here, exclusives, interviews, and podcasts."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPSEpVNTBMWFhoREdkZmJvN1Z3Y0g5ZncxRUNfRGlSYlBfakxxX0haZ3d5LUtVZnJvMl9oM190NDh2RTdwc3N6Nm5tRnlKOFl6VTF4eFJKbEloVTZLemJUQXEwdHlOYXlzQVBEeWx1SzJJbW1hZFRnaUZVam1Rcy1VZFFOWUpKOFhkUlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "London Stock Exchange To Accept Bitcoin and Ethereum ETNs Applications Starting Next Quarter - Yahoo Finance",
        "content": "London Stock Exchange To Accept Bitcoin and Ethereum ETNs Applications Starting Next Quarter\n\nThe London Stock Exchange (LSE) has announced plans to accept applications for Bitcoin and Ether crypto exchange-traded notes (ETNs) in the second quarter of 2024. However, the exact date has yet to be confirmed.\n\nAccording to the LSE's Crypto ETN Admission Factsheet, eligible ETNs must be physically backed and non-leveraged. They must also be backed by Bitcoin or Ether and have a market price or value measure of the underlying asset that is publicly available.\n\nThe underlying crypto assets must be held in a cold wallet or similar storage solution, including cold staking, and by a custodian subject to Anti-Money Laundering laws in the United Kingdom, the European Union, Switzerland, or the United States.\n\nETNs are debt securities that provide exposure to an underlying asset. They allow investors to trade securities that track the performance of crypto assets during the exchange's trading hours.\n\nThe U.K.'s Financial Conduct Authority (FCA) has stated that it will not object to requests from Recognised Investment Exchanges (RIEs) to create a market segment for crypto-backed ETNs.\n\nHowever, these products can only be offered to \"professional investors,\" such as credit institutions and investment firms. However, it will not be available to retail investors, with the statement saying:\n\n“The FCA continues to believe cETNs and crypto derivatives are ill-suited for retail consumers due to the harm they pose. As a result, the ban on the sale of cETNs (and crypto derivatives) to retail consumers remains in place.”\n\nThe FCA has also emphasized that cryptocurrencies are still deemed “high risk and largely unregulated,” and warns the public that their investments could go to zero. The UK government has recently ramped up regulatory efforts in the crypto industry, including allowing law enforcement to seize crypto assets suspected of being involved in illicit activities without a conviction."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxObEZRbDd3NnVSVWl0ekIwV3RyTkYyNU9kVlBoaUNvaERsbUFZNFRHWHlSZHByTTBEQjFQMlNJWXBXUTM3YldtdUM1VUxrcFFLaHBsdUgtVjlCeWpjNUVtVEhXaC1YMTQwRkFRV05qaGdTaF9xX1NYZW9nazFyLUMwbWJia0h6N2tyMW4wWHpXbzBwZE5JSFhiMUhxbW1TLVA2VUFCNHN4czZhQlg5d29QU1hLQnBwZzZ6d3Atck1n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "London Stock Exchange to Accept Applications for Bitcoin, Ethereum ETNs - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1GQUhxLWtySE45bEtTRFFxb1JUVEJLV0d0RDBwVnRwSVU2aGRjcTJKNDNDeS1ibHJBOGk5QmtKSHllbmpYV1J4LTFhdUFxMkFWaEhNVGIzVm5pajJSampkdC1MLTFYVWhac19VTzY3bDFtbllvc1ZwWdIBgAFBVV95cUxOeFZiR1hQajQ0VjVtNGNMcklEVkFVNC01bWY4dzBZYXQ1bFduRmtSQm5YLS1qLU5XUTNXSkkyNndYck4ta0phZDF6TVFFZXc0dTZMNE82RzVRVkpYek9JbjhSX0hCbGt6elRzS2JURk1USlZVU2dxV3FMaWdVWWFxUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "Coinbase Met With SEC Over Grayscale's Proposed Ethereum ETF - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAmerica's biggest cryptocurrency exchange met with the Securities and Exchange Commission last week over Grayscale's proposed spot Ethereum (ETH) exchange-traded fund.\n\nPublicly-listed Coinbase gave a presentation to Wall Street's top regulator where it talked about Grayscale's proposed product, documents filed on Wednesday from the regulator show.\n\nIn October, Crypto fund manager Grayscale filed an application with the SEC to convert its Grayscale Ethereum Trust (ETHE) into a spot ETH ETF. The proposed ETF would give investors direct exposure to the second biggest cryptocurrency; it would trade on a stock exchange—allowing investors to buy shares that track ETH's price.\n\nAD\n\nAD\n\nCoinbase's presentation showed that the crypto exchange had spoken about potential market manipulation and how the exchange would have a \"comprehensive surveillance-sharing agreement with the Chicago Mercantile Exchange will assist in surveilling for fraud and manipulation.\"\n\n\"Spot markets for ETH are highly indicative of a market resilient to fraud and manipulation,\" the presentation said, adding that the cryptocurrency has \"mechanisms that significantly limit ETH’s susceptibility to fraud and manipulation.\"\n\nIn January, the SEC gave the green light to 11 spot Bitcoin (BTC) ETFs to start trading. After a decade of denials, the investment vehicles now trade on stock exchanges, and have been a roaring success, with huge inflows.\n\nGrayscale was one fund manager that received approval; it converted its popular Bitcoin Trust into a spot Bitcoin ETF.\n\nNow, along with other reputable financial institutions, it is trying to get approval from the regulator to do the same with ETH, the second biggest digital coin by market cap.\n\nAD\n\nAD\n\nCoinbase analysis shows correlation b/w ether futures & spot markets every bit as strong as w/ bitcoin markets… Add-in that SEC approved CME-traded ether futures ETFs and I’m not sure what grounds for disapproval of spot ether ETFs would be. — Nate Geraci (@NateGeraci) March 8, 2024\n\nBritish multinational bank Standard Chartered last month said in a report that it expected ETH ETFs to get approval from the SEC by May—and that the asset price could soar as a result.\n\nOn Friday, ETH hit $4,000 per coin for the first time since 2021. The price of ETH stands slightly below that at $3,948, per CoinGecko data.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOanpvamlQN3VJVWpLLWh1dWdIdUM3TVZoQ2xIckJGZl9zMUpjNzVwQi1DNk5RTlhxeDZ4OHZORXVTVGRkNUczbWk5TlpBZDBXUXV2YmlwanZUaXNfN3o2NUZTUVFmWDZZTlRsTHpLdndOOVVZMkYyZk9WNXFXb0xtMHVfcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "3 Reasons Ethereum Price Could outperform Bitcoin in 2024 - crypto.news",
        "content": "Ethereum price broke above $3,9500 barrier again on Feb. 22, while Bitcoin price rally struggles for momentum: 3 vital market metrics suggest ETH could further extend its lead over BTC in the weeks ahead.\n\nEthereum (ETH) and Bitcoin (BTC) are historically closely correlated, but in 2024, ETH seems to have gained the upper hand. A deep dive into the on-chain data trends and expert analysis provides key insights into which asset would come out on top as the year unfolds.\n\nIs Ethereum better than Bitcoin in 2024?\n\nSo far in 2024, Ethereum and Bitcoin, the two largest assets in the crypto sector have attracted billions of dollars in capital inflows. As of March 2024, BTC is trading at historic all-time highs of $71,200, while ETH price attempts to establish a steady support above the $4,000 milestone.\n\nHowever, a closer look at the price charts shows that ETH currently has the upper hand having outperformed BTC by 7% in terms of year-to-date performance.\n\nEthereum (ETH vs. Bitcoin (BTC) Price action January to March 2024 | Source: TradingView\n\nThe chart above shows that ETH price has increased 79% between Jan 1 and March 11 2024, which is significantly higher than Bitcoin’s 72% price gains.\n\nHowever, while ETH currently has the upperhand, to determine which asset is a better value for money in 2024, it is important to examine the market catalyst driving both assets.\n\nFirst, it is important to note that both assets are driven by separate narratives and market catalysts in 2024.\n\nFor Ethereum, the ongoing ETH ETF filings, liquidity staking derivatives, the Eigen-layer re-staking and Dencun upgrade have emerged major themes within the ecosystem in Q1 2024. Meanwhile, the dominant themes for Bitcoin are the rapidly growing demand from the 10 newly-approved BTC ETFs and the upcoming halving event scheduled for April 19 2024.\n\nThese key events have triggered diverse changes in on-chain transaction trends and investment patterns across both ecosystems, leading to Ethereum price outpacing Bitcoin.\n\n3 reasons Ethereum price could outperform Bitcoin in 2024\n\nRetail investors are rallying behind ETH as Institutions dominate BTC markets\n\nThe US Securities and Exchange Commission (SEC) approved 10 new Bitcoin ETFs on Jan 11 2024 marking a real milestone moment for the cryptocurrency sector. Within the 2 months post-launch the ETFs have rapidly acquired about 800,000 BTC, about 4.2% of the total supply in circulation.\n\nEvidently, Bitcoin price has benefited immensely from record-breaking inflows made by the corporate institutional investors in 2024. But interestingly, the ETF’s dominance has triggered a skittish reaction among BTC retail investors, much to the apparent advancement of the Ethereum ecosystem growth.\n\nSantiment’s total holders metric estimates the total number of active or funded wallet addresses that currently exist on a blockchain network. It serves a proxy for measuring the level of adoption among retail investors and the mass markets.\n\nEthereum (ETH) Total Holders vs Bitcoin (BTC) | Source: Santiment\n\nIn the last 50-days dating back to Jan. 21, the Ethereum network has attracted 3.59 million new holder addresses, while 200,000 BTC addresses emptied their wallets and exited the network.\n\nThis rare on-chain trend suggests that the retail mass markets are overwhelming behind Bitcoin. As Bitcoin becomes more concentrated in the hands of fewer whale investors and corporate entities, it puts BTC price at risk of market manipulation and external shock from the macroeconomic fronts.\n\nThe significant increase in new holder addresses on the Ethereum network compared to the number of BTC addresses emptying their wallets suggests a divergence in retail investor sentiment between the two cryptocurrencies.\n\nFirstly, this trend indicates that retail investors are increasingly favoring Ethereum over Bitcoin, potentially due to Ethereum’s promise of profit-optimization and passive income from its low-risk staking yield to its retinue of decentralized finance applications (DApps).\n\nFurthermore, the growing dominance of institutional investors and corporate entities in the Bitcoin market introduces a new layer of uncertainty and potential risk. While institutional adoption has been a key driver of Bitcoin’s recent price rally, it also increases the susceptibility of the market to large-scale sell-offs or coordinated trading strategies by these influential players.\n\nIn the event of a tradfi market downturn or macroeconomic policy changes, the concentrated ownership of Bitcoin in the hands of highly-sensitive Wall Street players could exacerbate BTC price declines and lead to heightened market volatility.\n\nBitcoin Miners Trading Bearish while Ethereum Node Validators remain bullish\n\nThe divergence in the current trading disposition of Bitcoin miners and Ethereum node validators is another vital market catalyst that could drive ETH price further ahead of BTC. On the Bitcoin network, miners dedicate computing resources to validate transactions and secure the network in exchange of BTC block rewards. Ethereum, since its transition to Proof of Stake (PoS), now relies on its node validators for that critical function.\n\nBitcoin’s next halving event slated for April 19, will see miners’ rewards slashed from 6.25 BTC to 3.13 BTC. With the event now less than 40-days away Bitcoin miners have entered a selling frenzy in a bid to cash-in before the halving date.\n\nBitcoin (BTC) Miner Reserves December 2023 to March 2024 | Source: IntoTheBlock\n\nAs of Dec. 29 2023, Bitcoin miners held a total of 1.96 million BTC. But as the halving date drew closer, the miners rapidly offloaded 300,000 BTC, cutting down their balances to just 1.93 million BTC at press time on March 11 2024.\n\nValued at the current prices of $71,200, the miners have sold $21.5 billion worth of BTC in Q1 2024 ahead of the halving.\n\nIf the Bitcoin miner’s selling trend persists, it could slow down the BTC price rally, especially in comparison to Ethereum whose node validators have been accumulating more coins in recent months.\n\nEthereum node validators have doubled down on their bullish positions, depositing 2.4 million ETH worth $9.7 billion into the beacon chain staking contracts since Jan. 2024, meanwhile Bitcoin miners entered a $21.5 billion selling spree.\n\nEthereum (ETH 2.0) Staking Deposits Jan 2024 – March 2024 | Source: Beaconcha.in\n\nAt press time on March 11, the total staking deposits on the ETH 2.0 beacon chain stood at $1.4 million ETH, representing a 2.4 million ($9.7 billion) increase in 2024.\n\nUnlike Bitcoin miners, Ethereum node validators continue to double-down on their long-term bullish positions as ETH price edges further above the $4,000 mark. Positive speculations surrounding the Dencun upgrade, and progress of ETH ETF filings are key catalysts incentivizing ETH stakeholders’ bullish disposition.\n\nWith these catalysts still in play, ETH could witness even more coins taken out of circulation, while BTC circulation supply increases as miners increase selling pressure as the halving approaches.\n\nVanEck’s Head of Digital Assets to Cryptoquant also echoed this stance in a recent interview with Cryptoquant.\n\n“Over the medium term, ETH tends to outperform BTC in the halving year, right? So I don’t want to lose the forest for the trees. I don’t think there will be flippening, but I do think when the year (2024) is said and done, ETH will have outperformed BTC.\n\nIf these scenarios play out as predicted, ETH price will likely extend its lead over BTC in the weeks ahead.\n\nTechnical Indicators Highlight Ethereum’s Path to $5,000\n\nIn summary, Ethereum is expected to pull greater retail market demand than Bitcoin and also experience a temporary decline in circulation supply amid rising staking deposits. These key factors put ETH price on a path to a new all time highs above $5,000.\n\nETH is currently trading above the $4,030 range at the time of writing on March 11. IntoTheBlock’s in/out of the money chart shows that Ethereum has a relatively clear path to reaching a new all time-high.\n\n\n\nAs seen below, the chart highlights the $4,500 territory as the largest resistance cluster above the current prices. At that range, 617,760 addresses had acquired 1.6 million ETH at the average price of $4,557.\n\nEthereum (ETH) Price Prediction | Source: IntoTheBlock\n\nConsidering that they have been holding at a loss for 3-years, many of those holders could move to close their positions once Ethereum prices approach their break-even point.\n\nIf ETH price can establish a steady support level above that $4,500 area, it could potentially propel ETH price to a new all-time high above $5,000."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQSzhkRTF4WmtkTWdrVDZkZDdRT2h3WDREeTJfdlJzdWREVXJaRW1LM3BhZUlabUI2X3JDV09zRFJXZnZ6TjQtUjlGb2VDc2s5LWlvdk53azF5dVkwYWQ3T2lnQy0yMVkweC1EcWFuTEo3OWtqZ2EtN3cxM2sxTlBCUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Analysts lower odds of Ethereum ETF approval to 35% - CryptoSlate",
        "content": "In a recent shift of perspective, Bloomberg analysts have significantly lowered the forecast for the approval of a spot Ethereum exchange-traded fund (ETF) by May — setting the probability at a mere 35%.\n\nAccording to Eric Balchunas, the odds are down sharply from previous estimates, which ranged between 60% and 70%.\n\nThe revision reflects growing skepticism about the regulatory green light for Ethereum ETFs, contrasting the previously more optimistic stance.\n\nNo sign of activity\n\nThe caution among analysts follows recent discussions between Coinbase, Grayscale, and the SEC regarding the potential conversion of Grayscale’s Ethereum Trust into an ETF. While such meetings might usually indicate a positive trajectory, the absence of subsequent SEC commentary has tempered expectations.\n\nBalchunas and other analysts — including James Seyffart and Eleanor Terret — said that there is a distinct lack of activity in the regulatory circles despite the deadline being two months away.\n\nIn contrast, there was a flurry of activity among the SEC and spot Bitcoin ETF issuers for more than 10 weeks before the applications were approved.\n\nSeyffart said:\n\n“This Ethereum ETF cycle feels like the opposite of Bitcoin ETF approval odds at the moment. The more we see/hear (and don’t see/hear), the less optimistic I become.”\n\nHowever, the analysts added that the activity could pick up pace in the coming days. They also said that the expectation remains that an ETH ETF will be approved sometime this year — even if not in May.\n\nCautiously hopeful\n\nDespite these lowered expectations, some industry observers like Variant Fund’s Chief Legal Officer, Jake Chervinsky, remain cautiously optimistic, suggesting that the upcoming weeks could provide clearer signals about the SEC’s direction.\n\nHowever, he also raised concerns that the SEC may treat Ethereum like a security and would be unwilling to approve the applications without judicial intervention.\n\nThe overall sentiment appears to be veering towards skepticism, with major investment banks such as JPMorgan and TD Cowen also projecting unlikely approval by May.\n\nIn contrast to the Bloomberg analysts, the crypto market-making firm GSR has maintained a more hopeful stance, initially estimating a 70% chance of approval.\n\nHowever, the firm recently admitted that this optimism might soon wane if there’s no visible progress in the next month.\n\nMeanwhile, Standard Chartered has said multiple times that the SEC is likely to approve Ethereum ETFs in May.\n\nEthereum Market Data At the time of press 8:54 pm UTC on Mar. 11, 2024, Ethereum is ranked #2 by market cap and the price is up 3.37% over the past 24 hours. Ethereum has a market capitalization of $484.39 billion with a 24-hour trading volume of $29.46 billion. Learn more about Ethereum › Ethereum $4,033.29 3.37% Crypto Market Summary At the time of press 8:54 pm UTC on Mar. 11, 2024, the total crypto market is valued at at $2.71 trillion with a 24-hour volume of $170.31 billion. Bitcoin dominance is currently at 52.17%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNTmRBSC1MZVNLMF9yUWNUVGE1N0FwaHctcUVtem1zQV8weElOMEJDQnRTTDNLakNWWmpuWnBueDJQZDFKLWJ4UmprN2J5SmtNajJ1c2prYTJ1d1FCcmdsenROR0dVZVA3MC1EbnhMZFowWm15U25lVzl0ejhFS2xkSVZ2eEdIbERJbkY1WG95RnVsVjl2UWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "As Ethereum L2s multiply, new layer 3 blockchain aims to stitch them together - DLNews",
        "content": "Ethereum’s focus on L2s comes at a cost, spreading liquidity across dozens of blockchains.\n\nLayer 3 blockchain ZkLink Nova, which aggregates liquidity across five L2s, launched Monday.\n\nEthereum’s mass market appeal rests on so-called layer 2 blockchains: faster, cheaper blockchains that funnel into Ethereum, letting users dodge its notoriously high transaction fees.\n\nThere are more than 40 of these layer 2 blockchains, according to one estimate. Most are islands unto themselves: although protocols like PancakeSwap, a decentralised exchange, can be found on several layer 2 blockchains, assets on the many versions of PancakeSwap are siloed.\n\nA new layer 3 blockchain — a layer 2 for layer 2s — aims to fix that.\n\nZkLink Nova, which launched Monday, aggregates liquidity across five layer 2 blockchains: zkSync, Linea, Arbitrum, Manta, and Mantle.\n\n“The point is to deploy products that can, sort of, unify liquidity and users,” Declan Fox, head of business development at Linea, told DL News.\n\nThat means that an application deployed on those blockchains effectively shares assets. This larger pool of assets — or deeper liquidity, in market-speak — should make it easier to execute large trades without affecting an asset’s price.\n\nThe L2 boom\n\nLike all blockchains, Ethereum groups transactions into blocks, then appends them to an immutable ledger. Its transaction fee reflects the demand for space in each block, spiking along with user activity.\n\nBut a spike in activity can send the cost of a single transaction well above $100, an astronomical sum for the average investor.\n\nJoin the community to get our latest stories and updates\n\nDevelopers have bet the most convenient road to mass market appeal goes through cheaper layer 2 blockchains, which batch transactions before appending them to Ethereum.\n\nThat plan is coming to fruition. There are more than 40 layer 2 blockchains, according to L2BEAT, and another 35 in development.\n\nExisting layer 2 blockchains have processed almost twice as many transactions as Ethereum itself over the past year, according to data collected by Jack Gorman, a data scientist at venture capital firm Variant Fund.\n\nEthereum users have enjoyed massive savings: The average cost to swap tokens on Ethereum was just under $17 Monday morning, according to l2fees.info. It was between $0.68 and $2.16 on the major layer 2 blockchains the website tracks.\n\nlayer 3 blockchains take the concept a step further, creating a sort of blockchain-based Russian nesting doll in which each layer is cheaper than the last.\n\nzkLink Nova\n\nUnlike the few existing layer 3 blockchains, zkLink Nova will be general purpose rather than application specific.\n\nZkLink spokesman Neil Liew said Nova would offer “real interoperability.”\n\n“With Nova there is no need to bridge assets across chains, because the same ERC-20 token on zkSync and Linea, for example, is represented as a single token on zkLink Nova,” he said. “Nova simplifies DeFi by presenting a unified ecosystem for users and DApps, promoting a seamless blockchain experience.”\n\nWhile it aggregates transactions across several blockchains, it settles on Linea, an L2 that also runs on zero-knowledge technology. ZK technology creates “proofs” that are posted to Ethereum for verification.\n\n“You get additional savings on the settlement cost,” Fox said.\n\n“Rather than having to verify your proof directly on Ethereum, which is costly … what you’re doing now is, you’re actually settling on Linea, and Linea gas price is orders of magnitude cheaper than Ethereum.”\n\nLiew said zkLink will add other L2 blockchains in the future, and should be considered a complimentary, rather than competitive, product.\n\n“We are facilitating more user flow and liquidity flow into their chains and enhancing capital efficiency between the chains,” he said.\n\nZkLink’s three-step roadmap includes the eventual launch of ZKL, a governance token issued to incentivize a decentralised sequencer — the technology that orders transactions on layer 2 and layer 3 blockchains.\n\nAleks Gilbert is DL News’ New York-based DeFi Correspondent. You can contact him at aleks@dlnews.com."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNdld3cE9NWVJ6R0QzNHloMS1raFM5dE5tSTRKbkhPSlpfWi1VX0RIWUIyYnlNMDBnTFcwclVvOE8zbE9fVThOYlpFWml6cEROdE5BdXFRaDY2NTVpWElCRVRfRWc3d3Z6R3FJb3puMWhGQ2VCaWFjS0s1cVFMUnFVaHlQRW1DeWVsZjNmRjBvUW1Qd9IBlwFBVV95cUxPRVdCckFQdm5DRUtRUGsxOVZ1ajJ6UkYwSjZTYlo5TDNkTkZQT2VZNlVab21pbjVDejNfbS0zeFFpQTNSVVdfb211akRLT19seTJjOHE2bThqekQwcS04eF9USmZVRDR0c1FPeFFfaUZXeTBBZGd6SDRtNFpoWl9JQU5VcGxqODBHYUltWE1GLTYtLTFvdGNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Where Did We Go Wrong With Ethereum Scaling? - CoinDesk",
        "content": "Another barrier to entry for app founders and developers is the user distribution across all chains. This means app founders and developers are required to ask themselves whether a specific chain has the appropriate kind of users their particular app needs. For instance, what if a Web3 app founder wants to deploy on chain X for its low transaction fees and reputable “scalability,” but the network has, over time, catered to a DeFi user base?"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNS2I5SDBKTHRUY2VlSVdsWHVWdThmdFlJX1FkY3RSay0wU2xFWUxjcUlPc01FeU9fVTE0UGk4THFBZGR3WkdsbVo5amgyR1kzLVpxeC1SNmxCNlJlSG9BVnU4bHNGUXZHQWpNa2JtbzVDV1FWT1BlQnZVZ20xc3RFQmNvTTZCcEFpWVHSAY8BQVVfeXFMTzdKRmZZWmRpLVJ2dU92d2NIWXliTUNBT3RpNFZJWnZCRF8xckU4RHI2UE5GbkM5SHNqMDlKbS1vekRmMmY5X2RZTWpISDlPbG9Xa3ZlWWZTZG9DUGFFampidEE2OVkwVzlMNzlRemo0N3RmRjBOOUxUOFlIY0FxV2NYSmdxN3ZxU2MtZjNkcGM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Raoul Pal Issues Epic Bitcoin, Ethereum and Solana Price Prediction - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nLegendary trader Raoul Pal has doubled down on his forecast for the trio of Bitcoin (BTC), Ethereum (ETH) and Solana (SOL).\n\nAdvertisement\n\nHow high can Bitcoin soar?\n\nIn a YouTube chat with Anthony Scaramucci, Raoul Pal noted that he believes the Bitcoin price can end this current cycle with a massive price of $250,000. For reference, the Bitcoin price is actively in discovery mode, and it just recorded another all-time high (ATH) above $71,000 as optimism surrounding the coin remains sustained.\n\nDespite the $250,000 price target, Raoul Pal is not convinced this is the best the digital currency could do. He noted that the valuation could be higher depending on the trend in the spot Bitcoin ETF ecosystem.\n\nThe spot Bitcoin ETF has remained the dominant catalyst driving the price of BTC to new heights. The daily accumulation from spot Bitcoin ETF issuers, including BlackRock, Fidelity Investments, Ark Invest and Bitwise, notably surpassed the amount of BTC generated through mining.\n\nWhile an average of 5,000 BTC to 10,000 BTC is stacked up daily, only about 900 BTC are generated across the board, creating a notable supply shock that might help drive the price toward the estimated $250,000 in the long term.\n\nEthereum and Solana get high targets\n\nIn addition to the Bitcoin forecast, Raoul Pal projected a $17,000 to $20,000 surge for Ethereum this bull cycle, while he noted that Solana might jump as high as $700 to $1,000.\n\nWhile the duo of Ethereum and Solana have not retested their respective ATHs at $4,800 and $260 this ongoing bullish run, Raoul Pal has always highlighted their fundamentals as a key catalyst that can drive growth in the long term.\n\nOther analysts have even more bullish projections for Bitcoin as well as Ethereum and Solana, and time will tell how high the three digital currencies will grow this bull cycle."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQbU1MU1pzUkJXUlRCWUVnN2x4NlNBWXA1SWM5SmstdE1xSEVpelU2RzVaaS1PYVlsclNlV0d3bE81bWZaT3pxREg4Unh3YlpQWGVrcTdtcnQ2bkdPalFzRkdiY09yZGVXWXI5VEZybFNmMl9YT1ZaTDVwY0lhdGFzTzg1dWZpbFRBa2lONG5FUndKbW1PTHRr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin's Latest All-Time High Powers Ethereum and Dogecoin Higher Today - The Motley Fool",
        "content": "Bitcoin's streak of generating new all-time highs may not be over, prompting growing interest in other key digital assets.\n\nIt's another hot start to what looks likely to be another big week in the cryptocurrency world. Leading cryptos are once again surging, with Bitcoin (BTC 0.16%), Ethereum (ETH -0.28%), and Dogecoin (DOGE -3.98%) all making big moves.\n\nAs of 12:15 p.m. ET Monday, these three mega-cap cryptos had surged 3.8%, 2.9%, and 0.9%, respectively, over the prior 24 hours. Importantly, Bitcoin made a new all-time high above $72,500. In the wake of the Securities and Exchange Commission's recent approval of several spot Bitcoin exchange-traded funds (ETFs), continued capital inflows into those funds are creating a clear supply-and-demand imbalance for this top crypto. This catalyst, as well as anticipation of the upcoming halving event in April -- which will cut the rewards for Bitcoin mining in half and thus reduce the volume of new Bitcoin being created -- is exacerbating expectations that Bitcoin's recent momentum can continue.\n\nMost investors who follow crypto can understand the rather simple dynamics driving Bitcoin higher. But for more complex reasons, Bitcoin's recent surge could also mean continued upside for Ethereum and Dogecoin, two projects that are very different from Bitcoin in key ways.\n\nWhy is Bitcoin's move a sectorwide phenomenon?\n\nThere's certainly something to be said about Bitcoin's status as the key crypto benchmark other digital assets are valued against. The Bitcoin/U.S. dollar exchange rate is very important in the crypto world, with Bitcoin largely being viewed as the currency of choice for this sector. That should mean that as Bitcoin becomes more valuable, other tokens relative to Bitcoin should become relatively cheaper, at least compared to Bitcoin.\n\nHowever, during previous rallies, this hasn't been the case. And while capital is clearly flowing in one direction (toward Bitcoin via these exchange-traded funds), it's also true that retail investors and even some large money managers are finding ways to accumulate other cryptocurrencies ahead of what many expect could be a continued rally in risk assets.\n\nFor Ethereum specifically, the possibility that a spot Ethereum ETF could be approved as soon as May is a key catalyst many investors are watching. The Ethereum network is also undertaking a number of upgrades, including the upcoming Dencun upgrade, which is expected to unfold within two days. As investors may remember, \"the Merge\" upgrade created significant hype for this network as Ethereum shifted to a proof-of-stake protocol from the more energy-intensive proof-of-work protocol. The Dencun upgrade will look to build on that progress, with a focus on reducing Layer-2 transaction costs and making the network more efficient.\n\nFor meme tokens like Dogecoin, it has been \"party on,\" mostly due to the risk-on atmosphere that has been building in pockets of the market. Cryptocurrencies like Dogecoin that rely more on the value of their community and backers have seen outsized interest as a result of surging asset prices across the board in this sector. For now, the thesis supporting Dogecoin's rise may be as simple as \"price goes up,\" but it's also true that leveraged bets to the upside via long perpetual contracts are playing into Dogecoin's surge in recent days.\n\nHow long will this party continue?\n\nUntil we see some sort of slowdown in the flow of capital into Bitcoin, it appears increasingly unlikely we'll see the kind of material pullback many crypto bears have been predicting. Spot Bitcoin ETFs have siphoned an incredible amount of capital from institutional investors in record time, and the level of demand has surprised even some of the most ardent crypto bulls. If Ethereum and other digital assets can see similar waves of investment, all bets are off with respect to how long this period of price appreciation may last.\n\nUpgrades and other utility-generating use cases for a wide range of cryptocurrencies (and select meme tokens can be included in this group) could drive the fundamental investing thesis behind these digital assets as well. While I'm less enthusiastic about Dogecoin's long-term prospects relative to Bitcoin and Ethereum, its recent move is worth noting. In the crypto sector, speculative interest can manifest itself in significant near-term volatility, as we've seen play out in the past. Accordingly, these are three tokens every investor interested in the crypto space will want to watch moving forward."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNM09DMHQ5T0FreldYWHBzYnBjY3JrVzFVLVd3dFRzVlAzVjROOWpzZFRXY1dPc0NJenJmaXRQRGxNbXVFQW5ucndFTUk0MGt6NGo3WVIwWm5hTXlBWDd1VWVLd282WUpRWjltdUUzWnQ5RmZxUG5QeVJmS0RMc0xfTloyV3E2TlpiTmtFZ0lmeXhiZHRCSnpCNVJFb0o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Hard Fork Guards Ethereum Against Quantum Threats: Buterin - Crypto Times",
        "content": "Vitalik Buterin, co-founder of Ethereum, is adequately prepared to counter the potential threat posed by a large-scale quantum computing attack on the network.\n\nIn a recent post on Ethereum Research dated March 9, Buterin outlined a sudden “quantum emergency” where quantum computers are suddenly accessible, and malicious actors can exploit them to steal users’ assets.\n\nHe discussed Ethereum’s readiness to handle such a situation, emphasizing its ability to mitigate the impact and protect users’ funds in the event of such an attack.\n\nIf the blockchain were to undergo a hard fork, users would just need to update their software, minimizing the risk of fund loss. Buterin elaborated that the hard fork would involve rolling back the Ethereum network to a point where it’s evident that significant theft occurred and then halting all regular transactions from that moment onward.\n\nDevelopers would then introduce a new transaction type, outlined in EIP-7560, specifically designed to enable transactions from smart contract wallets.\n\nIn a scenario where transactions are made from an Ethereum wallet, the signature of the transaction discloses the public key. In a “post-quantum era,” this exposure could potentially reveal the user’s private key.\n\nThe proposed quantum-resistant Ethereum Improvement Proposal (EIP) introduces a new transaction type that relies on Winternitz signatures and advanced cryptographic techniques like STARKs. This aims to update existing wallet validation mechanisms, ensuring enhanced security against quantum threats without compromising user privacy.\n\nThis verification code utilizes ERC-4337 account abstraction, which is the foundational technology of smart contract wallets. It prevents the exposure of private keys when signing transactions in the future, thus making these accounts resistant to quantum attacks."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE54S2hTaUtMeUs4bXc4M1VPU2xRX25ULVdkVzd4ajBkaEkyR0FDMmJVWVg3cWxUbXd1eXdMVE53a1FhQlloMVBfX01vRkJIRWZpaDIyc200OTVLS0psWFlXUTYtYmREYUFFRXVKOFVmc2pzUdIBekFVX3lxTE9Xb1lmZ0ltLVBTbXZwaUVCd19GQkdMSVV2V2lvZzl2ZEVxUkl0bnVaZHVWTWl5aHVpeHpHVlZoTGRDZ1BHM0lJUHJlOGsxekg5Nk5wTzJQSVgwcGNfaXkyVUozQkJCTTViZWs2eDZTSFFTWWoyWlBtbkJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Dencun Upgrade Is This Week—Here's What to Expect - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum developers will roll out the much-anticipated Dencun upgrade on Wednesday, March 13. Developers have told Decrypt that the impact on gas fees for Ethereum scaling networks will be dramatic, with some estimating that they'll drop by 75% immediately.\n\nThe name is a portmanteau of Cancun and Deneb, two separate upgrades that have been combined to create the term \"Dencun.\" A word of caution for Ethereum upgrade first-timers: There's nothing that users need to do. Be wary of any blog, email, or Twitter (aka X) post that says otherwise and asks you to click a link or connect your wallet.\n\nLeading up to the upgrade, Dencun has already been pushed live on several of Ethereum's testnets. But the real push, to Ethereum's mainnet, will occur later this week. The upgrade is happening roughly a year after the Shanghai upgrade from April 2023, when the newly upgraded proof-of-stake network made it possible for users to unstake their ETH.\n\nThis new upgrade is targeted at addressing core aspects of Ethereum’s framework, including its scalability, security, and overall user experience.\n\nAD\n\nAD\n\nAt the heart of the Dencun upgrade is the implementation of proto-danksharding, a cutting-edge concept designed to significantly reduce transaction fees and increase processing speed across the network.\n\n\"This is the beginning of a new paradigm for how Ethereum operates,” Karl Floersch, the CEO of OP Labs, which builds layer-2 network Optimism, told Decrypt earlier this month.\n\nThe optimization is expected to make Ethereum a more attractive network to build on for startups, which could add even more protocols to its already bustling decentralized finance (DeFi) ecosystem.\n\nEthereum has long hosted the largest DeFi ecosystem when measured by the number of protocols. In fact, it has seldom accounted for less than half of the entire total value locked in DeFi projects. At the time of writing, there are 990 Ethereum-based projects, according to DeFi Llama.\n\nAD\n\nAD\n\nThe upgrade also includes several key Ethereum Improvement Proposals (EIPs), each tailored to enhance specific functionalities within the network. For example, EIP-7044 will introduce programmable staking exits.\n\nValidators secure the Ethereum network by locking up 32 ETH as their pledge to keep their validator client running and handle the transactions that come their way. If they don't, they stand to lose a portion of their 32 ETH to penalties.\n\nFor users who don't have 32 ETH to become a solo staker, there are pooled staking options. They allow users to deposit any amount of Ethereum and earn a share of the staking rewards (minus the pool fees, of course).\n\nBut what happens if the validator with whom you've staked your ETH experiences downtime and part of your staked funds get slashed?\n\nEIP-7044 will make it possible for ETH validators and stakers to store instructions for when to exit their position—called perpetually valid signed voluntary exits—in smart contracts, and specify when they should be carried out.\n\nFor example, someone running a validator node may want to exit if their hardware remains inactive for a certain number of blocks processed. This is an important protection for validators because they could face mounting fines if they're unable to process transactions on time.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQS2luYVJGN1lMNWU4VXJvUTRXSzd0eDNiX3YwQ2hPazMyTzI3SmFjaUo3aXoxb1dtNjd2SHBjWk9RcUxna1Nva0tVbVI2NWtWWXRWUGg4dkZJWmZGS1d2TW96T3hMVml0c214YlA5T1NKSVdNZVZDMjRmR29qNll6TU5nZElja3k2cU5MaA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin ETFs Are a Smashing Success, and Ethereum ETFs May Be Next - Yahoo Finance",
        "content": "Bitcoin (CRYPTO: BTC) ETFs have been a huge success in the U.S., and it makes sense Ethereum (CRYPTO: ETH) ETFs are next. We learned last week that Coinbase (NASDAQ: COIN) is pushing for exactly that.\n\nIn this video, Travis Hoium explains why Ethereum ETFs may not only drive crypto higher, but also could be a double benefit for Coinbase.\n\n*Stock prices used were end-of-day prices of March 9, 2024. The video was published on March 11, 2024.\n\nShould you invest $1,000 in Coinbase Global right now?\n\nBefore you buy stock in Coinbase Global, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Coinbase Global wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of March 11, 2024\n\nTravis Hoium has positions in Coinbase Global, Ethereum, and Solana. The Motley Fool has positions in and recommends Bitcoin, Coinbase Global, Ethereum, Polygon, and Solana. The Motley Fool has a disclosure policy. Travis Hoium is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through their link they will earn some extra money that supports their channel. Their opinions remain their own and are unaffected by The Motley Fool.\n\nBitcoin ETFs Are a Smashing Success, and Ethereum ETFs May Be Next was originally published by The Motley Fool"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE94cDFpd2VkRlc5d0ZqbG44a01wZGhDdnAxSm4wSWdSVmhCYnZPS3BVMTZSWV9NRkdnYTlhV1QtTjd4TG1kYXlaUlRfcVlUNjh4b2JFaTZmNmJVZFRQdHh3NkV3dGk1V0gtbzFGQ0xPVDlJZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Hits $4,000: How High Can ETH Go? - Watcher Guru",
        "content": "With Bitcoin surging above $71,000 for the first time, altcoins like Ethereum have embarked on renewed waves of recovery so far in March 2024. Amidst this bull run, ETH prices tapped new yearly highs, feeding optimism around the crypto’s outlook. The big question now is: just how high can Ethereum trend in the months ahead?\n\nAnalysis of price charts reveals Ethereum, with its $479 billion market cap, has surged past the $4,000 level for the first time in two years. A 75% increase in trading volumes to $22 billion supports this signal of strengthening upside momentum.\n\nAfter logging 15% gains last week, ETH has rallied 60% across the past 30 days. Ethereum has notched a bullish milestone that hints at a trend reversal.\n\nAlso read: Cryptocurrency: Top 3 Coins To Buy Under $10 For Better Gains\n\nCan Ethereum hit $5,000 next?\n\nIf Ethereum’s price is able to sustain support around the $4,000 area in the coming weeks, some analysts estimate the next likely upside target could be around $6,835 based on the 1.618 Fibonacci extension level.\n\nThis would represent the next key price milestone if the current bullish momentum is maintained. However, prices could also consolidate or correct before any potential further upside.\n\nEthereum hit its all-time high of $4,891 on November 16, 2021. However, the second-largest cryptocurrency is just 18% away from breaching its previous all-time highs.\n\nAlso read: Shiba Inu (SHIB) Forecasted To Surge 540% & Hit New ATH: Here’s When\n\nOf course, if existing market conditions deteriorate again, Ethereum may see a downside. However, indicators presently favor the ongoing bullish structure persisting through February.\n\nSo, with ETH firmly back in recovery mode, early technical clues support the growing narrative of history repeating itself this cycle. If Bitcoin manages to sustain the $71,000 level, ETH and other altcoins could stage a bullish outlook in the coming days."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQVXoweUFVRHIzZW5kRzlSY2hJSzZlbWFDbHRuNUFKQ2dSUGI4bExWcGtRcFhyTzVYVUJPcG53dVVtMkxiLVFfM3ZpODkyV1F0NDNiSV8tVTU1Z2JHZjg5VnVuYzJZMWNLV3RNc25BdEVMNDdDeEtYT0RDeG1OM0lSckluOTMta1lQWTZKYzVFM2lQWHJpZHlyWW5FakhTQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Proposes a Quantum-Resistant Hard Fork for Ethereum - Blockchain.News",
        "content": "Vitalik Buterin Proposes a Quantum-Resistant Hard Fork for Ethereum Jessie A Ellis Vitalik Buterin proposes a hard fork strategy for Ethereum to protect funds against quantum computer attacks, sparking a community-wide discussion on quantum security.\n\nEthereum co-founder Vitalik Buterin has proposed a hard fork strategy. This preemptive measure is designed to protect user funds in the event that quantum computers become capable of breaking current cryptographic defenses.\n\nThe proposal, outlined in a discussion on the Ethereum Research forum, highlights the urgency of preparing for quantum computers' ability to solve problems like the discrete logarithm, which underpins the security of many current cryptographic algorithms including those used by Ethereum.\n\nThe proposed hard fork would entail the following steps:\n\nReversion of all blocks following the detection of large-scale quantum attacks. Disabling traditional externally owned account (EOA) transactions to prevent further vulnerability. Introduction of a new transaction type for smart contract wallets, in line with the anticipated RIP-7560 standard. Implementation of a new transaction type or opcode allowing users to submit STARK proofs, demonstrating the knowledge of a private preimage and a public address derived through approved hash functions. The user's account code would then be replaced with a new, quantum-resistant validation code.\n\nThe conversation in the Ethereum community is informed by a range of expert inputs. One participant shared a visual aid to help understand the proof statement, while others discussed existing quantum-secure fallbacks for wallets and the integration of preimages into ECDSA signature nonces to create fail-stop signature schemes.\n\nSome community members have cautioned that if quantum computers capable of cracking Ethereum wallets are already in malicious hands, it might be too late to differentiate between legitimate owners and attackers. They suggest that instead of relying on stateful post-quantum algorithms, Ethereum should use NIST standardized ones in hybrid mode with a classical algorithm, like combining Dilithium with ed25519. This would, however, increase block sizes due to the large signature and public key sizes of current post-quantum schemes.\n\nOthers have proposed the development of machine learning systems to monitor and detect abnormal transactions as an early warning system to trigger a fail-safe fork.\n\nThe community's response underlines the importance of staying ahead in the security arms race against quantum computing. Innovations such as Lamport signatures and ERC 4337-based quantum-resistant smart contract wallets are already in development, as is the integration of quantum-safe cryptographic measures in other digital signature applications.\n\nThis initiative by the Ethereum community reflects the broader blockchain ecosystem's commitment to resilience and adaptability in the face of emerging technological threats. As quantum computing advances, the blockchain sector's proactive stance on security promises to be a critical factor in its long-term viability and trustworthiness.\n\nThe Ethereum team and community's proactive approach to quantum security demonstrates a clear recognition of the challenges ahead and a willingness to address them head-on. This ongoing conversation will likely shape the future of Ethereum's infrastructure and set a precedent for other blockchain platforms."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOaTl2SDBWQkI3X2phSEEwT085UDFqWS1mbXJKdGRON0pJMk9sYTlCNWJQMVN6SkFtaS1jdmZiRmpGYkJpcFJuTnE2eXF5V2xESDNEOEY4VjYzQVEycnVMczhqUkJkQmIyUmp0N21qQmFFWXlmb2hWN2lZOEEyLTNVb1R0QW1wbkxrc3c5eNIBkgFBVV95cUxOUnhqSVJMd1Fwb2FRUU9DeWlFSjBmaTRiOTVlcmZqaF9SZ2Y3dTB1M1UxaUQzVGN6LTRHaTQydU9wNlYtSjFmQklkbUtrUjU4R2VBeVN3aTl4U1R4cVJiNjVZRlNXZFdEajl0dlN3LVgybEEtbkxoemNVWmVYX1JCc1l3T3VkdHdwTHB0czlJeHBpZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Comparison Between Solana and Ethereum - ForexLive",
        "content": "When evaluating the blockchain space, two platforms frequently come up for comparison: Solana and Ethereum. Both have garnered significant attention, each with its own set of strengths that appeal to different users and developers in the cryptocurrency ecosystem.\n\nPerformance and Transaction Speed\n\nOne of the most notable differences between Solana and Ethereum is in terms of performance, particularly transaction speed. Solana has made a name for itself with its high throughput capacity, being able to handle about 65,000 transactions per second (TPS), while Ethereum currently processes roughly 30 TPS. This stark contrast is due to Solana’s unique consensus mechanism known as Proof of History (PoH), combined with the Proof of Stake (PoS) model, which allows for quicker validation of transactions and blocks.\n\nEthereum, on the other hand, is transitioning from Proof of Work (PoW) to a PoS system through its Ethereum 2.0 update, aiming to increase its transaction speed and reduce energy consumption. However, until this transition is complete, Solana takes the lead in performance.\n\nScalability\n\nScalability is another crucial factor in the comparison. Solana's architecture gives it a significant scalability edge, allowing for the support of thousands of nodes without sacrificing speed. Ethereum, with its current architecture, faces challenges in scaling, although layer two solutions like Optimism and Arbitrum are providing off-chain scaling options. The shift to Ethereum 2.0 also promises to address these concerns by introducing sharding, which will spread the network load across 64 new chains.\n\nCost\n\nTransaction costs are vastly different on Solana compared to Ethereum. Solana boasts extremely low transaction fees due to its efficient processing capabilities. Ethereum's fees, however, can vary widely and tend to be much higher, especially during periods of network congestion. This aspect makes Solana more attractive for microtransactions and decentralized applications (dApps) requiring a large number of transactions.\n\nDecentralization and Security\n\nEthereum is widely recognized for its level of decentralization and security, having a large and diversified network of nodes. While Solana’s architecture has led to a smaller node count, its newer network hasn't yet faced the same level of scrutiny or attack as Ethereum. Thus, Ethereum might be seen as more secure and decentralized at this moment.\n\nEcosystem and Adoption\n\nEthereum has a first-mover advantage, being the pioneer for smart contracts and dApps. It has an enormous and thriving ecosystem with a multitude of dApps, tokens, and decentralized finance (DeFi) applications. Solana is newer but growing quickly, developing its ecosystem and attracting developers with its performance benefits.\n\nConclusion\n\nWhether Solana is \"better\" than Ethereum depends largely on what metric you're measuring. If transaction speed and cost are your primary concerns, Solana may appear to be the superior platform. If decentralization, security, and ecosystem maturity are more important, Ethereum might be the preferred choice. Ultimately, the \"better\" platform will depend on the specific needs of the users and developers, and the continuous evolution of both platforms keeps this as an ongoing conversation in the blockchain community."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQak4tLWk5YWNTNVg0eExhb1hnWkwzNEhjdndaMnRiMklzSFNDX1lOdUxYSHFwbzVPM1ZpM3BoQndGU2ptREVBWjhwc3Q2ZF9BWDUwbUtsdm03UzBQam12MGk3d3lKUDNrUFZUTjJ1X2JiZ2xHZ2FnZnlPV3NhUTVMYmNjWm1YQm02ekE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum (ETH-USD) Is Under Scrutiny after Breaking $4,000 Level - TipRanks",
        "content": "Ethereum’s (ETH-USD) levels are currently under scrutiny as cryptocurrency analysts and investors peer into its performance after breaking the $4,000 value area – a level not seen for ETH since December 2021.\n\nAs the leading altcoin and second most valuable cryptocurrency by market cap behind Bitcoin (BTC-USD), Ethereum has fundamentally redefined how applications are built and operated on the Internet. It boasts a robust ecosystem that supports smart contracts and decentralized applications (dapps).\n\nThis in-depth analysis of the daily and weekly charts reveals a nuanced picture: weekly indicators signal caution, while daily trends suggest resilience and potential for continued upward momentum.\n\nAnalysis of the Daily Chart: Potential for Continued Uptrend\n\nETH-USD Daily Chart. Source: Tradingview\n\nEthereum’s technical conditions on the daily chart exhibit signs of bearish sentiment. The Composite Index, a crucial momentum indicator, has decisively crossed below its moving averages and is a bearish warning sign, indicating potential downward pressure on price.\n\nHowever, it is essential to consider the Detrended Price Oscillator (DPO), which remains above the zero line. The DPO’s position indicates underlying strength, suggesting that the prior uptrend may continue despite the immediate bearish outlook.\n\nInsights from the Weekly Chart: Indicators Suggest Caution\n\nETH-USD Weekly Chart. Source: Tradingview\n\nExpanding our analysis to the weekly timeframe reveals a broader perspective of Ethereum’s market trajectory. The trendlines, extending back to July 2022, illustrate a dominant upward trend, with the recent steepening slope suggesting a parabolic rise.\n\nThe immediate support level on this parabolic trendline is identified at $3,687. Furthermore, the Composite Index has reached historical resistance levels and shows a downward slope, while the DPO marks its highest levels since August 2021, signaling potential volatility.\n\nThe Outlook Is Mixed\n\nWhile long-term indicators suggest a cautious approach due to bearish signals, hidden strength on the daily chart and the strong support levels identified on the weekly chart offer a counterbalance. These insights suggest that while near-term volatility is likely, given the increased institutional interest in Ethereum and a broader bullish mood for crypto, a resumption of the uptrend has a strong probability of occurring."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOYzhBZ1FxeHRwMXhXdFFmcDZ4LTIzd3g1WVRCdVNEV1d6aFQ2NzFnRGltUkR5bHp6d3hEeXNFSnBYWFZTTkV2VnJyYlEzS19GNTZ2eEgwV1lpZ3EwRWRwYmdHeE9mM3EzVEU2YTBSYjNmQ2s1MTNidUNUYzRocDB3SmNPSW5qXzdFWWZGQ3F3eUllTXBRN3dKTjlNSUVIdTBUZ1NyRVlxUWh1MkI3OFBwemtCbUxPVmN2a3FUQUNkX09qdjdudFh5NEJwX2dNU0N0YkxSYVE2RnRXcXRaZF9iT0dXSkFlMlQz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "Bitcoin Vs. Ethereum Vs. Shiba Inu Vs. Doge: How Much You Would Have Now If You Had $1,000 Invested In Each Of The Crypto At Start Of Current Bull Run - Benzinga",
        "content": "Cryptocurrencies have been on a tear since late last year, as buying interest perked up in anticipation of a regulatory nod for spot Bitcoin BTC/USD exchange-traded funds. Although the rally stalled after the SEC approval came through in early January, it resumed after the lull.\n\nWhich of the widely owned and popular cryptos generated better returns for investors?\n\nStratospheric Climb: After a forgettable 2022, most cryptocurrencies began to take off in 2023, with most of the upside taking place toward the back half of the year. The upside is in part due to bargain hunting as investors looked past scandals and general risk aversion improved. But much of the buoyancy came on the back of optimism over the spot Bitcoin ETF approval and the impact it would have on the space.\n\nA spot Bitcoin ETF was perceived as a way for investors to gain more exposure to digital assets without having to directly own them, which could encourage wider adoption of cryptocurrencies.\n\nBitcoin ended 2022 with a loss of over 64% at $16,547.50. The crypto began a slow and steady recovery in 2023, and the rally began to accelerate only after the apex crypto broke above a key resistance around $30,000 in late-October. After moving sideways for much of January, the Bitcoin rally reaccelerated in February.\n\nDespite warnings from skeptics about a potential correction, crypto investors appear to have thrown caution to the winds and continued buying.\n\nSee Also: Best Online Cryptocurrency Brokers\n\nReturns From Investment: Bitcoin is trading just shy of the $70,000 mark after pushing past the level last week. The performance of Ethereum ETH/USD, the second-biggest crypto, has been a silent performer.\n\nMeme coin Shiba Inu SHIB/USD, though late to the party, has made strong gains this year. Dogecoin DOGE/USD, another favorite, has also gained traction.\n\nAssuming a hypothetical scenario in which an investor made a $1,000 bet on each of these cryptos, here’s how much return it would have generated now.\n\n$1,000 invested in Bitcoin at the end of October would have fetched 0.029 Bitcoin. It would be worth $1,975.87 now (based on Saturday’s closing price). This translates to a return of about 98% in little over three months.\n\nThe same $1,000 invested in Ethereum at the end of October would have fetched 0.55 of the crypto. This would be worth about $2,150, a return of about 115%.\n\nIf the investor had put in the dollars in SHIB, the $1,000 would have got him 125,000,000 SHIBs. The same would be worth $4,250, a 325% return.\n\nIf the investor had opted to plow in $1,000 in DOGE at the end of October, he would have received 14,646 of the meme coin. At Saturday’s closing, the holding would be worth $2,623, a gain of 162%.\n\nAt last check, Bitcoin rose 1.61% at $69,472.43, Ethereum was up a modest 0.31% at $3,906.97, while SHIB fell 4.61% to $0.000034 and Doge slipped 3.25% to $0.174072, according to Benzinga Pro data.\n\nRead Next: ‘May Be I Should Buy Some Bitcoin,’ Says Bill Ackman As He Weighs In On Energy-Guzzling Crypto Mining, MicroStrategy’s Saylor Says He Would Like To Discuss 1-On-1\n\nPhoto: Shutterstock"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE4teDBsbXJ1TXpUY19lSEtGM3BDdWxhdXRGZ2VHelRlQ3pmRjZvR3dEcmdJTWJMcS1YVlZ4b3FDUHc4azJEUFUtUm83LVJTU0pCLUtZQzVYMmpNQUJaZm1wZXNHOEN6TWZ0cEdfStIBckFVX3lxTE5lelNTTllVckdkMmxsbUNySVJuSGkxLTEtOGZsRmI0dl83STB0cTd4VlFFdHBseThqYVc5S2QyX1FCMUtBaXhKYzN3VHlMOVp5V3EteTlUNGxBV05jZU5FM2pTZ3NCTEJuVk02NnhyeWZQdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval Odds Plummet. Here's Why - U.Today",
        "content": "Advertisement\n\nThe likelihood of the U.S. Securities and Exchange Commission (SEC) approving an Ethereum (ETH) spot Exchange-Traded Fund (ETF) has significantly decreased.\n\nThis is evidenced by market sentiment on platforms like Polymarket, where the approval odds dropped to 24%.\n\nDespite the crypto community's optimism earlier this year, recent developments indicate a growing skepticism about the SEC's approval of Ethereum ETFs, particularly in the lead-up to the anticipated decision date of May 23.\n\nDiminishing optimism\n\nEleanor Terrett, a reporter at Fox Business, has noted that there has been a significant change in mood regarding the SEC's stance on Ethereum ETFs.\n\nInsiders suggest that the SEC, under Chairman Gary Gensler, is less engaged in discussions about Ethereum ETFs compared to their Bitcoin counterparts, hinting at a possible contentment with the progress made with Bitcoin ETF approvals.\n\nAdvertisement\n\nAdditionally, political pressure from figures like Senator Elizabeth Warren, who have expressed dissatisfaction with the SEC's approval of Bitcoin ETFs, seems to be influencing the regulator's approach toward Ethereum products.\n\nRegulatory delays\n\nThe SEC has recently postponed its decision on various Ethereum ETF proposals, including those from financial giants BlackRock and Fidelity. This has set the stage for further uncertainty despite the fact that such an outcome was expected by market analysts.\n\nThis delay signals a cautious approach from the SEC, mirroring its previous hesitance with Bitcoin ETFs.\n\nAs reported by U.Today, Eric Balchunas, a senior analyst at Bloomberg, has tempered expectations for Ether ETFs, likening them to an opening act following a headliner. Jake Chervinsky, Variant's chief legal officer, speculated the SEC's cautious approach is influenced by political resistance and market volatility.\n\nDespite this, the crypto industry remains hopeful, looking for signs of potential approval in the regulator's future actions and commentary."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPeFZXb0MtalA4d1pRbV9Wei10SW9MWjZiVHlvYks1NEJscFZvS01NYzhlZTlIa2Rwb1JQVWNqVWdyQnhvMlN4eG5SdF9aZE5UcDJrV3BEdm0wX2c2MG9fTTIzM3cwa08wenltMkZfMW9QamlndGtKRlFRc0dmQ05NWmFBdmpjVmxLc2xxRFVnLXZPS0liaHFEMzVKVWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "London Stock Exchange wins nod to list Bitcoin and Ethereum offerings for pro investors - DLNews",
        "content": "The FCA has given the London Stock Exchange the green light to accept applications for crypto exchange-traded notes.\n\nThe ETNs will be limited to professional investors.\n\nThe exchange said it will accept applications to list the products in the second quarter.\n\nThe London Stock Exchange announced Monday it will accept applications for Bitcoin and Ethereum exchange-traded notes, in a move that sets the stage for a new market segment in the UK.\n\nThe announcement came as the UK’s Financial Conduct Authority said it “will not object” to requests from recognised investment exchanges to list ETNs.\n\nThe ETNs will be available only to professional investors.\n\nUnlike the booming spot Bitcoin exchange-traded funds that were approved in the US in January, ETNs are classified as debt securities, but like the ETFs, they provide investors with exposure to an asset. While spot ETFs represent a stake in an underlying commodity, ETNs are issued as senior debt notes and are traded more like bonds than stocks.\n\nCrypto adoption in the UK has been slow going despite Prime Minister Rishi Sunak’s stated desire to make the UK a “crypto hub.” Sunak said that in April 2022 when he was the Treasury head.\n\nSince then, cryptocurrency firms have faced pushback from regulators, who have approved only a handful of crypto businesses. But now the FCA appears to be more open to crypto investment products.\n\n“Exchanges will need to continue to make sure sufficient controls are in place so trading is orderly and proper protection is afforded to professional investors,” the FCA said in its statement Monday.\n\nThe LSE said it will accept applications for the ETNs in the second quarter, but didn’t give a specific launch date.\n\nJoin the community to get our latest stories and updates\n\nTyler Pearson is a junior markets correspondent at DL News. He is based out of Alberta, Canada. Got a tip? Reach out to him at ty@dlnews.com."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOMFM1ZnQyWDkxR0FyTGhvSDJoOUJUMEtpRy13VVhFZ2xzdkZLdTFLV2tVRVpjNFpQNmp6VDJnNzBDdTFTdkVlRFZvWTNvNW91R1VxUExVRjNNSFJKN3JvQWZwZDhlZjg4bDNiU0JuOHI2eDJVc2VaVkNPbGM5aUQ2ZVFmenh3djljTVZEY3VPb9IBlAFBVV95cUxQR3lzTUdIaVl6d1RSMjYyUTdrYmRobXZJbTlkQ25NdnpYWFFueHN3YlItNjFGTjFDSTZhc0V5R045S2VtQldWZnpjSmJZVW40aWlkeWswcHBkcENlRXRVVjI3Ni1sOVVZN1JLTkthUWFBNjJCVnUwVGtRUnUwUXVMbURvcTBERVZ3Y3E5Ri1HYlhWekE5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Opens Up on Ethereum's Strategy Against Quantum Attacks - U.Today",
        "content": "Vitalik Buterin, renowned for his pivotal role in shaping the cryptocurrency landscape, has recently unveiled groundbreaking insights regarding Ethereum's resilience against potential quantum threats. In his latest research, Buterin delves into strategies to safeguard users' funds in the face of quantum computing advancements.\n\nAdvertisement\n\nAddressing the pressing concern of quantum-enabled theft, Buterin elucidates on Ethereum's preparedness for such a scenario. He highlights the inherent vulnerability stemming from the nature of ETH addresses and the implications of quantum computing on cryptographic functions.\n\nDrawing upon the architecture of Ethereum's blockchain, Buterin proposes a pragmatic approach toward mitigating quantum risks. His solution involves a strategic hard fork combined with the adoption of quantum-resistant cryptographic techniques. By reverting to a prior block and implementing alterations in transaction protocols, Ethereum could potentially avert large-scale fund breaches.\n\nAdvertisement\n\nButerin emphasizes the role of advanced cryptographic mechanisms such as STARKs in fortifying Ethereum's security posture against quantum threats. These innovations, coupled with modifications to transaction types and validation processes, could render Ethereum more resilient in the event of a quantum emergency.\n\nQuantum era\n\nThe proposal outlined by Buterin underscores the proactive stance of Ethereum's development community in addressing emerging challenges. By laying the groundwork for potential hard forks and infrastructural enhancements, Ethereum aims to bolster its readiness to navigate the uncertain terrain of quantum computing.\n\nIn essence, Buterin's insights herald a new chapter in Ethereum's ongoing quest for robustness and adaptability in the face of evolving technological landscapes. As the cryptocurrency ecosystem braces itself for the quantum era, Ethereum stands poised to confront these challenges head-on, guided by the vision of its pioneering creator."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPWHdSaG5nb1BET3RXVElISDFGUzhma0trSnRCM3FpXzVlbk1EWnM3alhLMFNzSVVvMlRKc3N0QV9JbjNSTWpLbXRKS0lHbGFaMFJseE8tZ1IzSkhaazFVOWtobXBSbU94T1FsajdXR0JpU2hpM2pYRXJsRnJKVjJmYlY5RG8tR2FYY3YzeUZOZkRIR2U0S21uN3RwQURJTTZVXzd2cEpVS1ZWOVl3dDNSWDBucThwWFZrT1QtQWdZWE4waThScEJCTmk2MWNNeFFxNnBUcNIB2gFBVV95cUxOV0xHcC1DWWctdjFIdjYxOFJ2dEpBYVhGTlIwckcwNFRKd0hEb2lIWVVxY09jcDk5R3ZPWTgxS2VXamRYZnd2Nll6TjNXS2RhNTlnazA0X3puMVBFaWJ1S3ltT19fYmJzV3VQWk5iZFdKc2dONmxaQ2ZvY2RGbjQtNVFjSEdIR2F3b0I1d1JWdnU4OEhvZ05hSF9OYzlBbVJpTTZKbU9JM0MzWXN3NW5rcFNvdlhWczRoMXh6MjZJME9JcTdDOW56bFZ1TVM1X0hOVjNZb25GMDdWUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "In bitcoin's shadow, another cryptocurrency, Ether, stages its own rally - The Economic Times",
        "content": "New York, Mar 10, 2024 -Bitcoin has captured the limelight in recent weeks as it surged to a new record high, yet another major cryptocurrency , Ether, has been enjoying its own meteoric rise.Launched in 2015, Ether, also known as Ethereum , is by far the second-largest digital currency in terms of total value, now estimated at over $460 billion.Along with other cryptocurrencies including Solana and Dogecoin, it benefited from the regulatory approval in the United States of a new bitcoin investment product, the exchange traded fund -- or ETF -- in mid-January, said James Butterfill of the investment company CoinShares.These ETFs allow investors to profit from any change to the price of cryptocurrencies without having to buy them directly, while also letting them sell at any time.The launch of crypto ETFs has led to an influx of new money, sending bitcoin to a fresh record on Friday of $70,085.Bitcoin's rise has been well-documented, but Ether's has been even more impressive, surging almost 72 percent year to date in comparison to bitcoin's 61 percent rise.This strong performance is largely due to \"expectations that an Ethereum ETF could be approved in the United States,\" according to Dessislava Aubert of research firm Kaiko.Several asset management companies have applied for authorization from the US financial markets regulator, the Securities and Exchange Commission (SEC), to market these Ether investment products.The SEC must rule on the first such applications, from VanEck and Ark 21Shares, by May 23 at the latest.\"Ethereum has started to wake up as investors are anticipating a potential approval,\" Michael van de Poppe of MN Trading told AFP, adding that \"people are rotating from Bitcoin to Ethereum as a potential investment opportunity.\"Beyond the ETF effect, the digital currency dreamed up by Russian programmer Vitaly Buterin has several other cards up its sleeve.For Simon Peters of cryptocurrency exchange eToro, Ethereum is also buoyed by the prospect of \"Dencun,\" a major upgrade to the technology underlying this digital currency, scheduled for March 13.This major change will improve transaction processing capacity and cut transaction costs, but also has the potential to unleash the growth of an ecosystem with multiple applications.\"Bitcoin's primary use is as store of value, while Ethereum has much more potential use cases,\" Peters told AFP.For example, it is the destination of choice for non-fungible tokens -- or NFTs -- the certificates of digital authenticity that caused such a stir three years ago.The two cryptocurrencies are not in direct competition, according to van de Poppe from MN Trading, because Bitcoin is \"hard money,\" while Ether \"is basically an investment for the entire blockchain and smart contract ecosystem.\"Ethereum has already successfully negotiated two major technical transformations in recent years, including the switch to a less energy-intensive system in September 2022.James Butterfill said there is \"increasing optimism\" that a \"Dencun\" upgrade will \"go without a hitch,\" which would reinforce the currency's credibility.He added that Ether, by the very nature of its operation, offers the \"added benefit\" of interest generated by its holders.The mechanism for creating this currency involves owners putting up existing Ether coins as collateral in a process known as \"Proof of Stake,\" which differs from bitcoin's energy-intensive method involving highly complex calculations, known as \"Proof of Work.\"Ether investors who agree to put up some or all of their holdings receive a fee of a few percent a year, in addition to any potential capital gain if the currency appreciates in value.The \"Proof of Stake\" process adopted in September 2022 has significantly increased the amount of Ether used as collateral, notes Simon Peters, currently at 21 percent compared with just 10 percent 18 months ago.\"There is less Ethereum in circulation,\" he said, adding: \"If demand increases, given the squeeze in supply, then price should follow.\"\"I think that Ethereum is going to be outperforming Bitcoin,\" said Michael van de Poppe, adding the total market capitalization of Ethereum could end up exceeding that of bitcoin."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNZFZJbEhHNDlvRlZ3ZzFoV08tN18wd1Z0b3NwdExYSTRlZnpXeHF3OWNtOVM3Q29Ib3NfaGNkRjJkWEROSTRXbTZ6VHZ0ZnpBckpENHdlaXBLbTFmX0I4VnV5eTNTX3RDejNnUGdFUDFqcU9mV3BwMzBQalduYmVJTHdqR1U4d0l1amc4WEl4dzF4MUZGYkFLUWhkckxLYjFyN3BhZDU1d25PYWvSAbABQVVfeXFMTllVWHRsTHZienRXYzB6Wi1EbTNoY3pHTnMzNDNNYU02dG5WVElhMDlueW9PVGdFMHZTRFlDSmlqT2VJS1ByWVFPSk9mSHF5bjVMNWJmM0drTmxLYkZlYUFYNVlrY0xmVmZpbXpiZm41aUh3VExSZE1TNlItb1RLTkJRQWJkNl9pQnJad2hIVmQyMnVSTENCbUpKbGJZYU1VZTdZaEZoZExmNGFobWVjbWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "No ‘Flippening’ Expected, but Ethereum Poised to Outperform Bitcoin: VanEck Executive - CryptoPotato",
        "content": "The introduction of spot Bitcoin ETFs has attracted a fresh influx of investors, driving a notable increase in trading volume. This trend has generated a wave of optimism that extends beyond Bitcoin itself.\n\nBut this hasn’t made the launch of a spot Ethereum ETF any earlier as the US Securities and Exchange Commission (SEC) is currently evaluating the possibility of such a fund. Despite the uncertainty, experts appear to be bullish on the trajectory of the world’s largest altcoin.\n\nEthereum’s Bullish Outlook\n\nBitcoin is gearing up for another important event this year in the form of halving, which is scheduled for April this year. Looking at the previous halving events, Matthew Sigel, VanEck’s Head of Digital Assets, for one, has shared a bullish outlook for Ethereum.\n\nThe executive expressed doubt regarding the occurrence of a “flippening,” a scenario where Ethereum surpasses Bitcoin as the leading crypto asset. However, he anticipates that Ethereum will surpass Bitcoin in terms of performance.\n\nIn a statement to CryptoQuant, Sigel said,\n\n“Over the medium term, ETH tends to outperform BTC in the halving year, right? So I don’t want to lose the forest for the trees. I don’t think there will be flippening, but I do think when the year is said and done, ETH will have outperformed BTC.”\n\nDelays in Spot Ethereum ETFs\n\nThe VanEck exec discussed the regulatory challenges facing the asset class in the United States, noting that the government’s reluctance to involve banks and brokers poses a significant hurdle.\n\nThis cautious approach by financial institutions has affected the listing of ETFs related to crypto assets as well, with the SEC once again delaying its decision to approve or reject BlackRock and Fidelity’s spot Ethereum ETF.\n\n“The US government doesn’t want banks and brokers to touch these assets, right? So as you see the distribution strategies by money managers and financial advisors, you will notice that the banks and the bank-owned brokers have been slow, or are not listing these ETFs as well. We do expect that regulation to change over time, but it is a considerable headwind and we constantly have to remind ourselves that this is not a US asset class. This is the anti-dollar.”\n\nA similar sentiment was echoed by Jake Chervinsky, Chief Legal Officer of crypto firm Variant. He said the SEC is facing increasing political pressure and navigating through market instability, both of which may impact its decision-making process on spot Ethereum ETFs."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE5QLVBjVWVLMVhDczc3VU5fVVJXNG5DZE1VSHdHR3RBbllvX0hMRnJDUnU5SnUxeG5xRXZDR1RXeFZOWUo5Y0FiR0lDXzYzRUdGNktsaUtIaEdzVWliSDNINGt2UkwweExTMkHSAW9BVV95cUxObHNRMWdMcExHTktWdlJuNTVRM1pqU3hFTEh3dUwxb3hKZWZTcFRMUDh5TGR4ODc3VFZJSEEwZEh3V1pFUDJMa1d1bWlNY2VGcWdCS0JvZGtoMDE4WjRnSE9JRUR4eDc0N1hsd0tvMzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 14:53:36 GMT",
        "title": "Ethereum (ETH) Price Prediction for March 10 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSome coins are already trading in the red zone, according to CoinStats.\n\nAdvertisement\n\nETH chart by CoinStats\n\nETH/USD\n\nThe price of Ethereum (ETH) has grown by 1% over the last 24 hours.\n\nImage by TradingView\n\nOn the hourly chart, the rate of ETH might have set a local resistance level at $3,970. If the daily candle closes far from that mark, the drop is likely to continue to the support at $3,908. Such a scenario is relevant until tomorrow.\n\nImage by TradingView\n\nOn the daily time frame, the price of the main altcoin is once again trying to fix above the recently formed level of $3,940. If that happens, the rise may lead to a test of the important area of $4,000 shortly.\n\nImage by TradingView\n\nFrom the midterm point of view, bulls are not facing any pressure from bears despite the recent sharp growth. At the moment, one should focus on the nearest zone of $4,000.\n\nIf a breakout happens, it might be a prerequisite for a further upward move to $4,100-$4,200.\n\nEthereum is trading at $3,936 at press time."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQX3lUYmlDcE1WMXdYeDZzcmVWeEFkWkk0Z3Jva1ptQ3BibUI1ZzFZcGt2X0lRb0VWUXNNVkcwUXdDdW5MNmhRY0thdWVnbFBmUHcyQzlyY056NEliRHg1R1VJTndMbF9PdWRpZ1dJQlRBbG52TV94eFFiUHI4alJCZTZoT1h3ZVNvRGMwY3R2enlqd2dfbnMzWnI1NzdLbC1hNy16VGFPblNidGx3VE5FTEVoS0tBMG0xS05YLXB3VXRoX080TlhUNXp0b3RBQdIB0wFBVV95cUxOWFNHQVFyMG5uNklUWFdFX05RSWdiYnJnWUNJNjUxS3JPSXVJVGg1MWlucFVZT25maTZhVHFVN1RTVmU3MV9iekgtemRGNEVMYktaSi10aUZBZzNJbFA5V1oydE9Uc3RkNU1EMlRQeHFYZHVGcVZQb0ZFaTB6cG9LNlBqZ0szdmlWS3ZaVFVxV3ZpSV9lZGdYaVUzdGhIWVpvT2FpYWw4ekRlU28tQlFxTTBVRWZfMVVycmtLaGpwZ09NdDZWdmlOaFdpNHhYdDRkdGNF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Rallies Incoming for Ethereum and One ETH Rival, According to Crypto Strategist – Here Are His Targets - The Daily Hodl",
        "content": "A closely followed crypto analyst believes that rallies are in store for two top smart contract platforms including Ethereum (ETH).\n\nPseudonymous analyst Loma tells his 301,200 followers on the social media platform X that he thinks Ethereum will likely continue its slow grind up.\n\nThe crypto strategist shares a chart suggesting that ETH will eventually return to all-time high at around $4,871.\n\n“Can steadily just trail stops under that $3,200 area. Price closes below $3,200 on any meaningful timeframe and maybe you can start calling tops.\n\nUntil then, it’s just a game of patience. Slow is smooth; smooth is fast.”\n\nAt time of writing, ETH is trading for $3,963, down about 1.33% in the last 24 hours.\n\nThe analyst is also keeping an eye on ETH rival Solana (SOL). Loma says he’s bullish on Solana and that dips are opportunities to accumulate SOL.\n\n“Any consolidations forming on lower timeframes around $140s (and maybe mid $130s) are good for compounding, in my opinion.\n\n$200 or the market is wrong.”\n\nAt time of writing, SOL is worth $143.52, down over 2% in the past day.\n\nAs for the broader crypto markets, Loma thinks that digital assets may go through a period of consolidation before witnessing the next leg up.\n\n“One month sideways cool-off period where people chop themselves to smithereens instead of slowly building out positions?”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPN084YVEwMWFiNUVsclVMU2NvZDI3THRtOEdvTWhQUkRfQ2tXeGd3NWRGQ0MxZE5uZElVSVQzZXZpZmJjWEl0YVVwU1lOdjU4TEY0SHVkT1IxOHJpUlV2U2FMakx6dnVmOUhZRXptejJnVnVjMDNvS2lUZjh6ZFpWX2VlZncxN0lCbGdMd1ozR0VpQ0VQM0xvZExoSdIBoAFBVV95cUxNbURCTHJXakI0ZFpEdnZUTml5aHgyb01LOHdkRG5OenByekNxbnNERzZVUnA4cWU4MHpZQkdaOXVDNFpEeEd3SXljRXZFZjdfWnM1eEUwUmZfNzFSMGhzTjBuZnhqWmRMTnFzd1JKeEE0eTZSQTlEXzB3RS1Oc25CQ0ZzVmh4cWRGem5pNEJ6bGc0VmV2eXprV3I5dWIyVlpG?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin rises to another record, ether breaks through $4,000 - CNBC",
        "content": "Last week, bitcoin hit new records in volatile trading for the first time since 2021, before more subdued trading over the weekend.\n\nThe price of the flagship cryptocurrency was last higher by 3% at $72,022.16, according to Coin Metrics. Earlier, it reached an all-time high of $72,750.16.\n\nAt the same time, heightened leverage in the crypto market has led to the biggest price swings in nearly a year, with funding rates at their highest levels since January 2021 and bitcoin open interest at all-time highs.\n\nInflows into U.S. spot bitcoin ETFs continue to drive the cryptocurrency's price action. Last week, crypto investment products saw record inflows totaling $2.7 billion, according to CoinShares. That put the year-to-date total at $10.3 billion, just off the record of $10.6 billion for all of 2021.\n\nMeanwhile, ether broke $4,000 for the first time since December 2021, lifted in part by bitcoin. It was last higher by 3% at $4,034.00.\n\nInvestors were also looking ahead to the Ethereum network's next big tech upgrade, dubbed \"Dencun,\" this week. In the past, the crypto asset has rallied into the day of the upgrade and then seen traders sell on the event.\n\nCiti analyst Alex Saunders pointed out in a note Monday that price action could look different for Dencun given the strength of other key crypto catalysts in play at the moment – specifically, the inflows into bitcoin ETFs, the upcoming Bitcoin halving and the potential that the Securities and Exchange Commission could approve trading of spot ether ETFs in the U.S. in May.\n\nCompanies whose performance is tied to the price of bitcoin was mixed on Monday. Crypto exchange Coinbase advanced gave back earlier gains but closed just under flat as the broader rally in tech cooled. Bitcoin proxy Microstrategy rose 4% after the company purchased another roughly 12,000 bitcoins for more than $821 million in cash, according to a filing.\n\nMiners fell. Marathon Digital lost 12%, CleanSpark fell 16%, Iris Energy lost 5% and Riot Platforms slipped 4%. These were some of the biggest stock market gainers in February but have turned lower for March as investors digest the upcoming Bitcoin halving event, when mining companies' revenue will be slashed.\n\nNew U.K. crypto trading products\n\nElsewhere, the U.K.'s Financial Conduct Authority said Monday that it would allow exchanges to list cryptocurrency-linked exchange-traded products for the first time – two months after spot bitcoin ETFs began trading in the U.S.\n\nSpecifically, the FCA said it would not object to requests from recognized investment exchanges to create a U.K.-listed market segment for crypto-backed exchange-traded notes, or ETNs. The London Stock Exchange said it will accept applications for the admission of bitcoin and ether ETNs from the second quarter of this year.\n\nUnlike an ETF, which is a fund that holds assets, an ETN is an unsecured debt security issued by a bank. It is typically linked to a market index or other benchmark. An ETN promises to pay out at maturity the full value of the index, minus management fees.\n\nBitcoin bulls note this will lead to increased institutional investment into bitcoin and other cryptocurrencies. They say this will, in turn, impact the price positively as more serious money floods into the market."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE9SS2ozWTBoZlZOSTNHWmNnejhwNE1pazMtaG9aVEZQeXY5bVRwX09URmpQeGwtZ0tiTWxDWnRrTUZjb3huS3B5bC04VE5iOGo4amVCeUFPNXNaLXlvNHltbFZYU0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Breaks Through $4,000 Again After More Than Two Years - Bitcoinsensus",
        "content": "Ethereum (ETH) has surpassed $4,000, reaching a new yearly high and marking a significant milestone in its recovery.\n\nThis price surge reignites interest in ETH and signals strong momentum within the broader crypto market.\n\nCatalysts like the upcoming Dencun upgrade, potentially reduced gas fees, and growing DeFi & NFT sectors drive ETH’s growth.\n\nThe world’s second-largest cryptocurrency, Ethereum, has finally made a triumphant comeback, breaking through the $4,000 barrier for the first time since late 2021. This surge in price occurred right alongside Bitcoin’s successful attempt at setting a new ATH at over $71k. ETH’s present price milestone underscores the leading altcoin’s resilience and further highlights the increasing optimism surrounding the crypto industry’s future.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nThe recent climb of Ethereum’s price can be attritbuted to a number of different related factors. These include the upcoming Dencun upgrade, which promises significant improvements in the Ethereum network’s scalability and reduced transaction fees, and is expected to happen sooner rather than later. Ethereum also remains as the dominant platform for decentralized finance (DeFi) and NFTs, which have continued to thrive and keep growing up to now.\n\nKeeping Up with Bitcoin\n\nThe news of ETH’s $4,000 breakthrough coincides with BTC’s surge to an entirely new ATH price of more than $71,000. As Bitcoin spends more time trading sideways in the next few weeks or months, it is highly expected that altcoins like Ethereum will take over the narrative as part of the typical “altcoin season” that comes along with every recorded instance of increased institutional and retail interest.\n\nThe last time that ETH’s price was at the $4,000 level was back in late 2021, which is more than 24 months ago. Its return to this price level now is taken by some experts as a signal of bullish sentiment resurgence. At the same time, it can also be seen as reinforcement of the positive correlation between BTC’s price performance and the broader altcoin market.\n\nUnleash the potential of leverage trading! Join Bybit today with our link, complete KYC, and earn up to a $40 bonus on a $100 deposit. Don’t miss out on this exclusive offer; claim your bonus now!\n\nAs of this writing, ETH is pretty much in price discovery mode. Will it reach $5,000 any time soon? Well, the current momentum is strong, but it’s still absolutely crucial to remember the inherent volatility of crypto assets. The truth about the sustainability of ETH’s upward movement will likely be unraveled soon enough.\n\nEnhance Your Crypto Trading Skills With Our Legends’ Trading Masterclass\n\nEmpower your crypto trading skills with our Legends Masterclass. Sign up now and take advantage of our limited-time discount offer! Join the class today."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPTU5vb1JuQ3VERmFwd2pnb01sbDZOYnJqLWJGSkE0OVR5TFlpUWEtVEpfbVpyMzJBYm5Td2JBT3pVWjlxaGVjaUw4MU5tcmRJaENtdG5SSDA4dk92dWRxTzdBX1FTdlJnQkN2NE5sNTdjOGxna3VtZzlTRjJIV2l6MHhJaG9FWEtFRkJXQVNSbXRWdFBPZVAyUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin ETFs Are a Smashing Success, and Ethereum ETFs May Be Next - The Motley Fool",
        "content": "If Ethereum ETFs are approved, the floodgates open in crypto.\n\nBitcoin (BTC 0.18%) ETFs have been a huge success in the U.S., and it makes sense Ethereum (ETH -0.32%) ETFs are next. We learned last week that Coinbase (COIN 6.28%) is pushing for exactly that.\n\nIn this video, Travis Hoium explains why Ethereum ETFs may not only drive crypto higher, but also could be a double benefit for Coinbase.\n\n*Stock prices used were end-of-day prices of March 9, 2024. The video was published on March 11, 2024."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPZUtrQ2JaYU42S0JwUzV3N09CQzhldzdveU43d29VZHJjN1o4XzJ3SjBlVHg3Wk1HdVpvYTdhdnFmUjl6S0JlSGhLRDlVTV9fZmpUUXREQk1Yc2FOYkx3Tk5QODEyMDJPdC1RYnZHU1h5WGlxT1VxU0xIT2I4eHpqSHFWd2lDMWxwVV9Cd1JOSEgwcDZOQl9yZG82VVFPbkk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Unibot token slumps 40% amid schism between project’s Ethereum and Solana devs - DLNews",
        "content": "Unibot’s native token fell past $50 today.\n\nConflict has broken out between the popular Telegram bot’s Ethereum and Solana developers.\n\nBoth sides traded accusations of breach of trust.\n\nUnibot’s token fell more than 40% today as news emerged of infighting between its Ethereum and Solana developers of the popular Telegram trading bot with over $1.1 billion in volume.\n\nUnibot’s Ethereum developers said they had ended their collaboration with their Solana counterparts, accusing them of reneging on previous agreements.\n\nThe Solana group confirmed the split, announcing plans to rebrand from Unibot’s Ethereum team.\n\nUnibot is a Telegram trading bot on both Ethereum and Solana. It first emerged on the Ethereum mainnet last May, followed by a Solana deployment in January.\n\nUnibot users, especially those who use the Solana-based iteration, now find themselves in the lurch.\n\nToday’s split is the latest problem to rock Unibot, which was previously hacked for $5.6 million last year. These problems have contributed to the project falling further behind its major rival, Banana Gun bot.\n\nUnibot and Banana Gun bot belong to a class of projects that allow crypto users to trade tokens using only a few simple commands on Telegram.\n\nUnibot token slumps below $50 amid in-fighting between project teams\n\nTelegram bots have evolved into a crypto niche in their own right and boast a $1.6 billion market capitalisation, according to Coingecko.\n\nJoin the community to get our latest stories and updates\n\nApart from trading, several bots also share revenue with users, and some of them help traders automate airdrop farming activities.\n\nUnibot developers lance accusations\n\nThe Ethereum developers behind Unibot accused the Solana group of a breach of trust because the latter also launched a version of the bot on the Blast blockchain without its approval. Blast is a layer-two blockchain built by the same team behind the NFT marketplace Blur.\n\nUnibot’s Ethereum developers accused its Solana counterparts of refusing to undergo the KYC identification process, too.\n\nAs such, the Unibot Ethereum team demanded the Solana group change its name which is currently Unibot on Solana.\n\nFollowing the split, the Unibot Ethereum developers launched a Unisol X frontend for users on Solana as an alternative to the Unibot on Solana bot. They decided to launch a second front because they are no longer working with the Solana group.\n\nResponding to Unibot’s accusations, Reethmos, the pseudonymous Unibot on Solana builder, said the split would not affect its users.\n\nUnibot has earned over $53 million in revenue since inception. (whale_hunter/Dune)\n\nReethmos countered Unibot’s statement and accused the Ethereum developers of engineering the split because the Solana team blocked their access to the bot’s revenue.\n\n“They farmed $30 million from tax farming but apparently it wasn’t enough,” Reethmos said on X, formerly Twitter. Tax farming is the practice of levying fees on token swaps, and Unibot’s Ethereum developers earn 40% of the tax imposed on trading the token.\n\nUnibot generates revenue across all chains, which is shared among token holders. To qualify for the revenue share, holders must hold at least 10 Unibot tokens.\n\nOf the $53 million in cumulative revenue the bot has generated, $48.2 million has been realised on the Ethereum deployment.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQQWpOOTZhREZVQ0tiQU93Nm5peld6UzFSTG5kcTB5cEROb1hqd21IQWd2TGdnRmIzNVI2QzRpX0JuNXRQNExKVXNmOVczakpRSGw4UmRkT2dzU1YtM0FJMlFIU0FKWHVNUjd1QjdnT0dUQzYzWDR5U3Bxd185c1V2b05BX2FVUmxKM3dUbVdITlVVcGh4TlU2U3VzVUViOEdCVmlUNGQtT1dHdXhmVDhnU3ZNSnA4QVN0dW13alhUNDdfZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Starts Consolidation – Why Pullbacks Could Be Limited - TradingView",
        "content": "Ethereum price is still struggling to clear the $4,000 resistance zone. ETH might consolidate for some time above $3,600 before the bulls gain strength.\n\nEthereum traded to a new multi-month high above $3,980.\n\nThe price is trading near $3,850 and the 100-hourly Simple Moving Average.\n\nThere is a short-term breakout pattern forming with resistance at $3,950 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could resume its increase if it clears the $3,950 resistance zone.\n\nEthereum Price Revisits $4K\n\nEthereum price extended its rally above the $3,900 level, like Bitcoin. ETH cleared the $3,950 level and traded close to the $4,000 resistance zone. It traded to a new multi-month high above $3,990 and recently started a consolidation phase.\n\nThere was a pullback below the $3,920 level. The price tested the 23.6% Fib retracement level of the recent wave from the $3,211 swing low to the $3,9983 high. Ethereum price is now consolidating near $3,850 and the 100-hourly Simple Moving Average.\n\nThere is also a short-term breakout pattern forming with resistance at $3,950 on the hourly chart of ETH/USD. If the pair stays above the $3,800 level, it could attempt another increase. Immediate resistance on the upside is near the $3,900 level.\n\nNewsBTC\n\nSource: ETHUSD on TradingView.com\n\nThe first major resistance is near the $3,940 level. The next major resistance is near $4,000, above which the price might gain bullish momentum. In the stated case, Ether could rally toward the $4,120 level. If there is a move above the $4,120 resistance, Ethereum could even rise toward the $4,220 resistance. Any more gains might call for a test of $4,350.\n\nAre Dips Limited In ETH?\n\nIf Ethereum fails to clear the $3,950 resistance, it could start another downside correction. Initial support on the downside is near the $3,800 level.\n\nThe first major support is near the $3,600 zone or the 50% Fib retracement level of the recent wave from the $3,211 swing low to the $3,9983 high. The next key support could be the $3,400 zone. A clear move below the $3,400 support might send the price toward $3,250. Any more losses might send the price toward the $3,120 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $3,800\n\nMajor Resistance Level – $3,950"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOMkdEcUZxZFFSMXpFUmx1RnVtXzk2b3dwLWJUNzdIS2J2MVBoYl9hS1pPSnpHRU1MbE1sZGZJaWJmVlBKZFgtbmZBdjQ4Q1ZJWjJCZmtmU3RfcnBhWlo4eUNEclFCQ2NLU2EybnpRN2VQLWVjSzZIMkZHbm1ISjBqWUpQQWFnZW5XN1VDZEVGbVNlX3FvUTBUV19wUjlfWGtpUmJsaGVVeDJvN1RaY1JOdnFPLXJFczEtM1JR0gHAAUFVX3lxTFBnVkw1a2dnZ0xSdVZXV1J5U2pLVVVSTEtmdXJLdVlvVlc5TXBxZXEyWVBWUXEwTktMenZidnJzYU5MLUlWSjdWZWo5em91UlBWMGZDeklUdWNUVzVZTVlYcGdsU3BrUTVqdnROeWlkMG0tR01PbW9fLUNzc2MwclMwZzQzd0FFaXMwdEhkZ1k5WjFJdVlKcC15bF9vbU5PclV5eE0wWnhlVGRmRjRfVElzTkQ3Z3VLNEtFWWVjS0VHZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum surges past $4,000 for the second time in its history - Forbes India",
        "content": "\n\n\n\nThe Ethereum (ETH) price neared the $4,000 mark for the first time since December 2021 on March 8, 2024. As of March 11, it has gone past $4,000, the second time in the entire price history of Ethereum. The upward movement in Ether's price seems to be fueled by anticipation surrounding Ethereum's upcoming Dencun upgrade and the potential approval of a spot Ether exchange-traded fund (ETF) by the United States Securities and Exchange Commission (SEC).\n\n\n\nAs of writing, ETH is holding down at $4,010 and continues to be on the rise, while other major cryptocurrencies are also displaying positive sentiment, with Bitcoin at $71,085.\n\n\n\nThe Dencun upgrade, considered the most substantial enhancement to the Ethereum network since the merger, aims to incorporate several Ethereum Improvement Proposals (EIPs), including EIP-4844, which introduces \"proto-danksharding.\"\n\n\n\nProto-danksharding is a feature designed to enhance transaction processing by utilising blobs, thereby expediting transactions and reducing costs for layer-2 chains and rollups dependent on Ethereum. The Ethereum developers have scheduled the Dencun mainnet launch for March 13.\n\n\n\nAdditionally, there is optimism about the SEC's potential approval of spot Ether ETF applications. It's expected that the SEC will announce its decision on all spot Ether ETF applications simultaneously, similar to its approach with Bitcoin ETFs on January 10, to maintain fairness among issuers. The statutory deadline for the SEC's decision on ETFs is set for May 23.\n\n\n\nIt is believed that the SEC's decision-making process for Ether ETFs won't be as prolonged as it was for Bitcoin ETFs. Drawing from the success of spot Bitcoin ETFs since their launch on January 11, a spot Ether ETF product is anticipated to attract significant capital inflow into the second-largest cryptocurrency by market capitalisation.\n\n\n\nIt is possible that institutional investors may increase their exposure to Ether once attention shifts from Bitcoin's recent all-time high to the potential of an ETH ETF. This could lead to liquidity consolidating at higher levels, potentially triggering price rallies in the long term. With the potential for increased institutional interest and capital inflow, Ethereum's position as the second-largest cryptocurrency is poised for further growth.\n\n\n\nShashank is the founder of yMedia. He ventured into crypto in 2013 and is an ETH maximalist.\n\nTwitter: @bhardwajshash\n\n\n\n"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1fQzhLb2dyVnItUHN1RG9ZUFZjbVZ3ZUdzN1VEV2hRb3hhaU5BR1kwaFhBME04ak5MQ3R0dmdUZmNnU1FDNVFaTjlCTHE2QXRIajB1ZkxjdmhnQXdtOWMzRkpoUXIwTEY2QXRiWHMtT29mbkhZZm9ONmI1X01BSFHSAYQBQVVfeXFMTWRXblh2T2JVVjR5cmdZemw5T3NYbnF2VElSRzRka2s4Nzl2ZktSdVFib3dqdGV1V0FUcGlRcDBCR0lnOVh0a3Z0WUJTZXRxSHpTdnJ6eUYwVGo3TzVXanJRaHk3b0x3Z3YwbWstMWl3OVFCQ0ZMS2pVSGpQR1dZM2RRS0Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum crosses $4,000 – How long before a new ATH? - AMBCrypto News",
        "content": "ETH saw an over 3% price increase and traded above $4,000 at press time.\n\nOver 90% of the supply was in profit.\n\nFollowing weeks of steady price rise, Ethereum [ETH] has successfully breached the $4,000 price threshold.\n\nThis achievement not only marks the reclamation of the $4,000 zone by ETH but also signifies that the king of altcoins might achieve a new all-time high.\n\nEthereum crosses $4k\n\nAMBCrypto’s examination of Ethereum’s price trend on a daily timeframe showed that, at the time of this writing, it had surged past the $4,000 mark, having risen by over 3.8%.\n\nGoing back in history, the last time ETH reached this price range was between October and December 2021, coinciding with its previous all-time high of $4,878.\n\nAdditionally, our analysis of its Relative Strength Index (RSI) showed a strong overbought trend, with the RSI surpassing 80. This suggested a strong bullish trend in an overbought state.\n\nGiven the press time RSI, a price correction may be imminent before ETH resumes its upward trajectory toward a new all-time high.\n\nEthereum in profit crosses 90%\n\nEthereum’s surge beyond the $4,000 price threshold has had a cascading impact on the overall supply in a profitable state.\n\nAMBCrypto’s look at the Total Supply in Profit via Santiment showed that, at press time, the indicator was over 128 million, accounting for over 95% of the supply.\n\nThis marked the first time a substantial portion of ETH’s supply was in a profitable state.\n\nAfter a decline in 2022, when the majority of the supply was held at a loss, this recent shift signified a significant positive turn in the market sentiment.\n\nMore positive Ethereum sentiments\n\nOf late, Ethereum’s Funding Rate spiked as well, reaching its most positive level since the 5th of March.\n\nAMBCrypto’s analysis via Coinglass showed that, at the time of this writing, the Funding Rate was around 0.07%.\n\nThis marked the second-highest Funding Rate in nearly a year, signaling an increase in buyer aggression.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nAt the same time, Ethereum’s Open Interest soared to its highest level in over a year. At the time of this writing, the Open Interest was over $13 billion.\n\nThis surge in derivatives indicated positive sentiment among traders, reflecting increased confidence in Ethereum’s potential to surpass its current price level."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPcUtSTXFwYWFob25qNi1VY1Y2RnFQbFY5Sks3aE9sVkcxcDIxNjB6YVJSMk9YT19aaVRhTHh5UFJhRjV5dEpiakI0SU9KSVBweG8yVjQ0ZGdiWjh6Ulk4V1BOakZmSGVONEoxTTFZbE9zSlZJcHZTenRVYVRRRThGVGNpRG16NkhmUW5EVmpEbmctTFN4a3hydjJzRzQyOG90MUNQd0tUSzFzaDEyX2xXQk5POA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "PEPE Price Rallies 300% as Ethereum Crossed $4k: More Gains Ahead? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPWFJXQ0lFVS1tN21GQ2M3SDRlTmhRYzhKWkdILWNUNE5iV1JSX2UyTVBTRk5neGRPb1RpS2VHM09pVnNXNzZEa0VjT0V2TG1SaWFJVy05dHBkMm81N1dPV0c5S2l3dkt4cXQ1WllDSFI3WDh5T3VGOWxmNmxSY2pvVWo2V0l1eUhxQVJ3TXlhclE3RTRqZldXQ3ZocVE0R3VTVGNVVGJjYzlRRTM0RmlJ0gG0AUFVX3lxTE9DNmRodGlrMmdEM2lpblBMbS1fb2Z1ci04ZnRZVWQ0WEo3N2pndTZHSXJ1bUJ4WmJLeU9BZmZOSHd0YTV0NXg4QnlWVVB2WkVac285QVNzOUs5Qi1nbXo4MTlxYWhmTTZ5RThyY0V4VkRoWVZxT1gxTW44ekM2VUk2UHNqbXQyZENfbUs0VURoYmRPUktxdThUYi1UcC15RGJaa1Z6TWhMQlhhMTdUcUl4TFRsNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Explodes Past $4,000 as Bulls Now Eye All-Time High Levels (ETH Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has been rallying rapidly over the last few weeks, breaking past several resistance levels. Yet, the price has reached a significant level that could hold the market for a while.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily chart, the price has been steadily rising, making higher highs and lows. The market has left the 200-day moving average far behind, a behavior typically seen during crypto bull markets.\n\nCurrently, the ETH price is trying to pierce through the $4,000 resistance level after failing to do so last week.\n\nIf the breakout occurs, ETH will likely reach a new all-time high. However, judging by the massive overbought signals on the RSI, a pullback looks pretty probable in the short term.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour timeframe, it is evident that the price has been consolidating below the $4,000 level for a while. Yet, the bullish momentum has seemingly kicked in again, and ETH is on the verge of blowing past the $4,000 resistance zone.\n\nThe Relative Strength Index also shows values above 50% but is still not overbought in this timeframe. Therefore, the market might still rise higher before an eventual correction.\n\nSentiment Analysis\n\nBy TradingRage\n\nEthereum Funding Rate\n\n\n\nWhile Ethereum’s price has yet to reach a new all-time high, market participants expect the price to rally much higher. This optimistic behavior can easily be witnessed in future market sentiment.\n\nThis chart presents the Ethereum funding rates, which indicate whether the buyers or the sellers are executing their orders more aggressively on aggregate. Positive values indicate bullish sentiment, while negative values point to pessimism by market participants.\n\nThe chart demonstrates that the funding rates have been showing extremely high values recently, even higher than during the last all-time high. While this aggregate buying pressure is not inherently bad, it can lead to a potential long-liquidation cascade that could cause short-term price drops."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPTUdDQjNYZVFDQlpqLXBxRGR4NEhQN0kteEVyRFBHdHVmWjNsZmpDV0d6cTk5ZkFnTU54U2ZScHo4cVpVVHRuemdtN0VGWktVZjVHWm4talR2QWdzY0xyTkhfc05ENjhnRmM4Z0ZZYWpDenlUaC02MFh6N2Y4THN6cUtDYkt1b1VCeW9INGdzVXBSZ2FZVE9XT19NVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "The London Stock Exchange opens doors for Bitcoin and Ethereum ETNs - Tech.eu",
        "content": "In case you’re under any illusions, crypto is back, and the London Stock Exchange (LSE) has given it a huge regulatory boost.\n\nThe LSE announced today that it will start accepting applications for the admission of bitcoin and ether crypto exchange-traded notes (ETNs) in the second quarter of this year.\n\nETNs are debt securities that provide exposure to an underlying asset. Crypto ETNs enable investors to trade securities that track cryptoassets on-exchange during London trading hours, and they are traded on their own dedicated trading segments.\n\nConditions for LSE admission\n\nAccording to a factsheet published by the LSE, the Exchange will only consider applications for admission in respect of Crypto ETNs where the issuer can demonstrate:\n\nThe proposed Crypto ETN is physically backed, has a reliable and publicly available market price or other value measure of the underlying, and has Bitcoin or Ethereum underlying crypto assets.\n\nThe underlying cryptoassets must be wholly or principally held in ‘cold storage’ or subject to arrangements that achieve an equivalent outcome to cold storage and held by a custodian or custodians subject to AML regulation in the UK, EU (or EEA, where equivalent laws apply), Jersey, Switzerland, or US.\n\nFurther, crypto ETNs admitted to trading on LSE are only appropriate for professionals and are only available under trading segments specifically designated as “Professional investors only.”\n\nAccording to the LSE, “the exact launch date will be confirmed in due course.”\n\nStill, it encourages early engagement from prospective issuers interested in admitting Crypto ETNs to trading on the Exchange.\n\nThe UK’s Financial Conduct Authority (FCA) stated today that it will not object to requests from Recognised Investment Exchanges (RIEs) to create a UK-listed market segment for crypto asset-backed Exchange Traded Notes (cETNs).\n\nIt specifies that:\n\n“Exchanges will need to continue to ensure sufficient controls are in place, so trading is orderly and proper protection is afforded to professional investors. ETNs must meet all the requirements of the UK Listing Regime, for example on prospectuses and on-going disclosure.”\n\nThe LSE’s move follows the SEC's approval of the first Bitcoin ETFs (exchange-traded funds) to be listed on US exchanges in January.\n\nLead image: \"London Stock Exchange\" by jam_90s is licensed under CC BY 2.0."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPOEpIblN4ckJoZmJtejBURHp5dTRpblFUcVRaNVliMmhQNTM1NFYxc0hVdTFmLTdUVklYV29mdFFnTFNWaFVtRFVnWE9UbEIyckh6RnAwdmNySjVTM2hORUlyVENVQ1JCQVpBdmgxRXUxQ25OVV9seGV5aWhRMTZZUHZJNEFBdW5WNVlkcnVKLXZXckl4ZHhMQ195R3ZnMV9NaWNoMS02TUZ1M1g4c3k0NkM0Rmk4d9IBuwFBVV95cUxPMkU5STg2Z3pNbUtaOGRZR1BqSFJfR2JEYzNva2lLTXh1amNyaV9MT1R1VjFQa05zN0ZYa1ZESFpiZVROQjRabzlOWG85Wk1CYmZPaHlBTnFUT0RPU2hRRHM4dE1Gb19pVjVrRXlNN1E4bk1Jb1Fna0c0T203ajk0M21jTV9jMHlPLTloWEtpV29wX1NmUUMzRUxsbWxzZ3hHQjdLTEpsczBjX1RxQVlxWWF2OEphY2JoaHVJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval Odds Plummet, Shiba Inu Whales Disappear as Large Transactions Drop, Samson Mow Hints at BTC Bullish Price Prediction: Crypto News Digest by U.Today - U.Today",
        "content": "Advertisement\n\nU.Today has prepared the top three news stories over the past day.\n\nEthereum ETF approval odds plummet, here's why\n\nAccording to data provided by Polymarket , the odds of the SEC approving an Ethereum spot exchange-traded fund (ETF) dropped to 24% . The pessimistic analysis follows the agency's recent delay in its decision regarding Ethereum ETF proposals from BlackRock and Fidelity, with the final deadline being postponed to May 23. In a recent X post , Fox Business journalist Eleanor Terrett noted a major change in sentiment regarding the SEC's stance on Ethereum ETFs. Based on Terrett's conversations with insiders, the regulator spearheaded by Chairman Gary Gensler seems to be less involved in discussions about Ethereum ETFs compared to their Bitcoin analogues, which may indicate that it is content with the progress achieved with Bitcoin ETF approvals. Another factor that appears to be influencing the SEC's approach to Ethereum products is political pressure from figures like Senator Elizabeth Warren, who have voiced dissatisfaction with the agency's approval of Bitcoin ETFs.\n\nShiba Inu (SHIB) whales disappear as large transactions plummet\n\nData shared by IntoTheBlock demonstrates that Shiba Inu is witnessing a notable decline in whale transactions , with their value dropping by 14%. Whale transactions are often considered a crucial sign of financial activity on crypto markets since these large holders have the power to affect prices with their sizable trades. If this activity decreases, it may indicate that whales are either taking profits and exiting their positions or reallocating their investments to other assets. Even though the dwindling of whale movements may be viewed as a negative trend, it is not always harmful. Whales frequently sell their holdings in order to realize gains, particularly following a big price surge like the one that SHIB recently had. This whale sell-off behavior can help stabilize prices following volatile times, fostering a more stable and less manipulable market environment.\n\nAdvertisement\n\nBullish Bitcoin price prediction hinted at by Samson Mow, hold tight"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOR3VYWGtzOHd1SWlHTjgyYmVXQnI5NXpJd2hJU1AxZHRRaldDTm9vSlZRczlhZXJtQi1QMVVzcldOMXg4Z0lDcUZlUmJicjFlOHhZSk9qaWl0RVJtSVhvVEZvNmhzT3dmMXRjaEMybDlDYS16UUpDdUxMcXZKd3B0Yll4blRiQjNSR1R2SUIxZHZRcU1CN0VDNWJ2VFpWaWo3OU9yQ25ub0jSAa4BQVVfeXFMTnlya05YZ0dvX2tzRFoyWG1qMmVkUDNZNEVWbHAwaUFmcGFwbkpMNWhjaW1ZNU5Xc3J1MHhxM3E1MDIxT0pZUVM5Q1lYSUlIMk1HNHU1RlBBRGM3S3F4Njc4R2F4UDhDTFcwOFhnQUFjWWdXQ2lHM1BoZFFnRHdCOTdjeFZsajBSUVdfdkFZOExaNi0wdnNRLVBWQ1pLZ01KSVdUbTJCeTE4MFBmcU9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Optimism Around Spot Ethereum ETF Approval Waning Down, Can ETH Price Rally Continue? - CoinGape",
        "content": "Last week, Ethereum attempted a surge past $4,000 levels, however, faced selling pressure at this point and has partially retraced back. At press time, the Ethereum (ETH) price is trading 2% down at $3,866 with a market cap of $464 billion. All eyes are currently on the Etheruem Dencun upgrade scheduled to go live on the mainnet ahead of this week. However, the optimism around spot Ethereum ETF seems to waning down with time.\n\nSpot Ethereum ETF Approval Unlikely?\n\nFox Business Journalist Eleanor Terret shared her observations stating that optimism surrounding the approval of spot Ethereum ETFs by the U.S. Securities and Exchange Commission before May 23rd appears to be diminishing.\n\nadvertisement\n\nConversations with knowledgeable individuals indicate that recent meetings have been largely one-sided, with issuers and custodians actively pushing the SEC staff to expedite the process. However, it seems that the SEC staff have not been as responsive or engaged in meaningful discussions compared to their handling of spot Bitcoin ETF applications.\n\nTerret further added that SEC chairman Gary Gensler perceives that he has already satisfied industry demands with the approval of spot Bitcoin ETFs. Furthermore, prominent anti-crypto politicians such as Senator Elizabeth Warren are reportedly displeased with the SEC’s decision to greenlight Bitcoin ETFs and are actively opposing the possibility of Ethereum ETF approval.\n\nThe sources said: “Staff has been very hard to gauge on this and we’re not sure if anyone really knows what’s going on in their heads. But they’re going to have to start work soon if it’s going to have a shot.”\n\nNo Strong Correlation Between ETH spot and Futures ETF\n\nEric Balchunas, an analyst at Bloomberg, noted that the U.S. SEC staff has not provided any feedback to the issuer of the Ethereum spot ETF application, contrasting with their involvement during the Bitcoin spot ETF evaluation.\n\nThis lack of engagement is viewed unfavorably, especially considering the notable correlation between Bitcoin spot and future ETF approvals. However, the correlation between Ethereum spot and future ETFs is not as robust, suggesting a potentially less optimistic outlook for Ethereum ETF approval.\n\nAlthough the Ethereum price has witnessed some pullback, analysts are optimistic about the ETH rally to continue going further. As reported, analysts see a minimum gain of an additional 25% in Ethereum all the way to $5,000. However, post the Dencun Upgrade, it will be interesting to see how the bulls sustain the momentum.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1OQWNaMTRrcm5EWW9BS29jaERsZzlTN0U5UTBqN0cwX2lmTUZRY2NjYTJxaFg5b1REOTAxT3cxSWl1QnZocGJtUDI2UzRXa1ZPem1mOGtCbW1zSHU4ZFotMnFEOXhHcC05TmRJQ1UyUDA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "UK regulator to allow crypto-related securities - Financial Times",
        "content": "Print this page\n\nSimply sign up to the UK financial regulation myFT Digest -- delivered directly to your inbox.\n\nThe UK’s financial regulator will allow some bitcoin-linked securities to be listed on the stock market, in a softening of its tough stance on digital assets as investors around the world snap up funds investing directly in cryptocurrencies.\n\nThe Financial Conduct Authority said on Monday it would “not object” to the creation of bitcoin and ethereum-backed exchange traded notes for professional investors.\n\nIssuers can apply to list notes that are linked to the bitcoin and ethereum coins on the London Stock Exchange from April. ETNs are debt securities that track an underlying asset but are traded and settled through a central market entity like a stock exchange and securities depository.\n\nThe news helped push bitcoin and ethereum higher. Bitcoin, the world’s largest cryptocurrency, hit $72,000 for the first time while ethereum touched $4,000 for the first time since December 2021.\n\nThe UK had become one of the last major markets to hold out against the trading of crypto-related securities, even though the government has been championing the country as a potential centre for digital asset markets.\n\nIn 2021 the FCA banned crypto-related derivatives, which included exchange traded products, owing to concerns over the amount of leverage, or borrowing, available to consumers. Some operators offered as much as 100 times leverage on bitcoin.\n\nThe ban — which also covered unleveraged securities — has drawn sharp criticism from members of the crypto industry, who argue that the UK cannot become a leading market for digital assets unless retail investors are given regulated and easy routes into popular tokens such as bitcoin.\n\n“Bitcoin is by far the most well-known crypto asset, and for it to be very difficult for the UK public to be able to buy it, how can we claim to be a crypto hub if we only offer risky ways of buying this asset?” said Tim Lowe, strategic adviser at London-based institutional staking firm Attestant.\n\nRegulators in other major markets have become increasingly comfortable with investors buying crypto-linked securities, as long as the securities are in a regulated product.\n\nAt the start of the year the US approved spot bitcoin ETFs, following countries in the EU, Australia and Canada. Hong Kong has also signalled it will approve ETNs. The newly approved group of US spot bitcoin ETFs, including ones issued by BlackRock and Fidelity, have collectively pulled $10bn since their launch in January, according to crypto investment group CoinShares.\n\n“With increased insight and data due to a longer period of trading history, the FCA believes exchanges and professional investors should now be able to better establish whether crypto-ETNs meet their risk appetite,” the regulator said in a statement.\n\nIt continues to believe “that crypto derivatives are ill-suited for retail consumers due to the harm they pose. As a result, the ban on the sale of ETNs . . . to retail consumers remains in place.”\n\nThe LSE said that securities behind the ETNs could not be leveraged. They must be kept in an offline storage vault and held by custodians subject to anti-money laundering rules in the UK, EU, Jersey, the US and Switzerland."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOMjl5OGxxOTFwdFJ1ZkFYRUhGOW1NeVQ5U08wVmc2dlRudkxPZ0J6NXlVWmc4S1F1U3J1RHM0a29yeWFIcXU3bl9XbnNjZU1nUDlubUg3NEpfMnBJV2s4dy1DcW41eHJtdXdNMHpXdzdib3M5RTg0XzJJRGFQaHBDeDBOZ2FMRFnSAYwBQVVfeXFMTjBfRlg3aXJ6T2VSWHMzZ3BzWWk5ZWR0NnhmZ2wxamRLZEdFQllIMC05Z0dTVlFHOGJNQkdsR3FXYldSbWhMdXkwdzJzbGJROEM5dFhsaVRfQU5GYTJHRjROYkdRVkR1X2U3YjR6OGpDc0RJNUdqRnVObEIxOW4ybEhvQlQ1YU5QeWFEZHo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "Here’s what’s going on with Bitcoin, Ethereum, and the S&P 500 - AMBCrypto News",
        "content": "Bitcoin increased by 10% and Ethereum rose by 14.7% in the past week.\n\nBTC and ETH were trending over the S&P 500 at press time.\n\nBitcoin [BTC] and Ethereum [ETH] have displayed strong price performances in recent weeks, surpassing some previous all-time highs.\n\nThese upward trends in the prices of these crypto assets have caused them to diverge from the S&P 500. What implications could this have for the crypto assets?\n\nBitcoin and Ethereum trend above traditional assets\n\nAMBCrypto’s analysis of Santiment showed that the crypto asset class, comprising Bitcoin and Ethereum, exhibited stronger growth than the S&P 500 in the past week.\n\nThere was a 10% increase for BTC, a 14.7% increase for ETH, and a modest 0.5% increase for the S&P 500. Thus, the crypto asset classes yielded a more positive return for the week.\n\nAnalyzing Bitcoin’s trend\n\nAMBCrypto’s analysis of the daily timeframe trend of Bitcoin on the 8th of March showed a 2% increase, maintaining the $68,000 price range.\n\nNotably, the significant aspect of the price trend on that day was a surge to the $70,000 price range during the trading session.\n\nThis marked the first time in over a year, instilling hope for a potential sustained rise to that level.\n\nAs of this writing, Bitcoin was trading around $68,450 with a less than 1% increase and continued to exhibit a strong bull trend.\n\nEthereum remains in a strong bull trend\n\nAMBCrypto’s look at the price trend of Ethereum on the 8th of March, similar to Bitcoin, revealed a significant high point. Despite a slight increase of 0.42%, ETH tested the $4,000 price level on that day.\n\nAt the time of this writing, it was trading at around $3,900, reflecting a 0.7% increase.\n\nEthereum continued to maintain a strong bull trend at press time, as indicated by its Relative Strength Index.\n\nIs your portfolio green? Check out the BTC Profit Calculator\n\nThe current trends in the S&P 500, Bitcoin, and Ethereum suggest a lack of correlation between equities and crypto assets. This divergence raises the likelihood of a sustained bull market.\n\nThe ongoing bull trends in BTC and ETH over the past few weeks serve as an indicator that the market could potentially be transitioning into a full-fledged bull market soon."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPYnVOWTN1WmZDbXkzNExuTjBEMDBiTjdqRVJkbXBnenV2S1d0ZEt6dzRUOG9UZG9jWVU2YlJXdlpIQTI2ZTVOS1dTbno0MGI0d3ZGV0llTzJaemZCejROWHdzX0l2Q3JNMVplcW4zQ0tGTmMzYmRNaThiRVRvMkVod21wczhQMWpWNW10TG83OFgwZ0FoUzc2WVpqaVZfN1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum triggers the quantum alert! Vitalik Buterin on the warpath! - Cointribune EN",
        "content": "Mon 11 Mar 2024 ▪ 4 min read ▪ by Eddy S.\n\nDevelopers of Ethereum, the $200 billion crypto ecosystem, have sounded the call to arms. Their mission? To protect the millions of digital assets held on the network from the clutches of a new kind of enemy – quantum computers. The first round of this unprecedented battle for survival is fast approaching.\n\nQuantum Computers Threaten the Ethereum Blockchain\n\nA threat full of power and mystery looms on the horizon. These quantum computing monsters, still in development, could one day crack the crypto codes that secure Ethereum wallets.\n\nIn the blink of a digital eye, billions of dollars in ETH and other assets could be stolen. A digital apocalypse hovers, threatening to obliterate Ethereum as we know it. Time is of the essence to counter this technological plague before it becomes a reality.\n\nDevelopers have no choice but to act, and to do so quickly. To undertake a massive preemptive counter-attack. A decisive action to save the flagship of the crypto ecosystem before it’s engulfed by the raging waters of the next quantum revolution.\n\nVitalik Buterin’s Operation Renaissance\n\nIt was Vitalik Buterin, the visionary behind Ethereum, who lit the fuse. An emergency plan will be put in place to secure the network – a hard fork of a magnitude equal to the threat it faces.\n\nThe first crucial step: to completely disable transactions from the classic wallets. Too vulnerable to quantum attacks. Instead, new “smart” wallets will take over. Built upon the very structure of the Ethereum blockchain, they will benefit from crypto armor resistant to the capabilities of these future quantum monsters.\n\nBut the cornerstone of this renaissance operation lies in the integration of STARK proofs (Scalable Transparent Arguments of Knowledge). A mechanism that will enable users to reliably verify their ownership of assets without having to expose their private keys, even to the verification system itself. A cutting-edge cryptographic breakthrough.\n\nA transitional mechanism will also be deployed to allow holders to safely migrate their funds to this new fortified system. A renaissance that will not come without pain for users, forced to undergo a lengthy software update process. But it is a necessary sacrifice on the altar of resilience against the existential threat posed by quantum computers.\n\nToday, Ethereum once again defies the doubts of skeptics to lead the way to a new post-quantum world. Where digital ownership will withstand the onslaught of mass destruction weapons that will be quantum computers. A new era that remains science fiction for now, but towards which the leading network of the blockchain is advancing, prepared for battle. Ready to secure a decisive victory for free crypto!\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNTWQwSzRpSVNqWURYRVVjelJNY3MyRjY1ZTNqbFVuTTJPXzZuMDlkVG1XT2xSUjlCWFkyelphTjh1UDRmV25PcEtYSmI4Y0Z0YXdIM2VmNXpGUFNTZFdRQzlSX2JHYlpKVFczcWdkWkplUnFaUUFLZUxlRkRaSmtmazFR0gGHAUFVX3lxTFB1Q1pCZktqMWwzdW5jXzBiZ3dRcVNHaGhOLWRPRWJ3emVKNTVkUUFiMGFaSGRrZjJOUVZkblQzSUVhWW1tRVdXamlhTEdnRWwzWmZfWE8ydjNTWDRYaWxyUVp3X0pXODk3eWQtaXVibEs5RTZJOTdtb0IxRF83QUt5REdzRnhJTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Gary Gensler remains silent on Ethereum ETFs: What now? - AMBCrypto News",
        "content": "With the recent approval of Bitcoin [BTC] ETFs, attention has now shifted to the possibility of an Ethereum [ETH] ETF.\n\nHowever, unlike its counterpart, the path to approval for ETH ETFs remains uncertain, leaving the market speculating about a potential timeline.\n\nAdding to the intrigue, SEC Chair Gary Gensler has offered no clear indication of whether the commission will approve a spot Ether ETF anytime soon.\n\nIn a recent interview with Yahoo Finance, Gensler avoided directly addressing the question, opting not to prejudge any filings.\n\nHe noted,\n\n“I don’t want to prejudge anyone filing, and as you said, there are ten filings in front of us.”\n\nHe further added,\n\n“So, news alert, I’m not going to prejudge that. But to your question, we look at the facts and circumstances and that which was in front of us.”\n\nWill ETH ETF receive similar validation?\n\nAmidst the anticipation surrounding the approval of an Ethereum ETF, major players like BlackRock and Fidelity are already vying for a spot in the market.\n\nDespite optimism fueled by the presence of ether futures ETFs and Grayscale’s past success against the SEC, Bloomberg’s senior analyst Eric Balchunas warns that the SEC’s silence could signal potential hurdles.\n\nEric highlighted,\n\n“Normally I’d say this was good sign but as far as I know the Staff has not given any comments yet to the issuers, which is not a good sign as we past when they gave comments on btc ETFs.”\n\nNotably, while Gensler remained ambiguous about the ETH ETF approval, his disapproval of the crypto industry was evident, despite his role in the recent Bitcoin ETF vote.\n\nThe future of ETFs\n\nIn the interview, Gensler criticized the crypto industry for widespread fraud and abuse, pointing to recent bankruptcies.\n\nHe slammed intermediaries for not disclosing how they handle investors’ money, comparing their actions to things that wouldn’t be allowed on traditional stock exchanges.\n\nWith the potential approval of an ETH ETF looming, there’s speculation that it could open doors for broader acceptance of similar crypto ETFs in traditional finance.\n\nHowever, Gensler’s conspicuous silence on the SEC’s stance hints at a complex approval process ahead, leaving investors and market participants in anticipation."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNclFjMUpYcnFvMFJVMkxacnVDcDl4SXBTVGVnbjBTcXh3QTA3ZnkyOE1zcE00WVhTeXE0ZUdCQ0ROT1IyT001TmM4N2dlZS1rbFY1U1FTYlp4WHU2WV9SYTBYVGxrWER3ZDdwRnl2a2oyeUk1MHlTaC14V1lfeWFtYVhtS3FXSXJucXl3cmJ5MWw3RGVwMHVpT1FhbjFHcDdDb1NxNHZCbXdIZHE0SzBQcm0ta1FQVjg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Stalls Below $4,000 After Weekly Rally: Consolidation or Correction? - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum (ETH), the world’s second-largest cryptocurrency by market capitalization, has seen its price hover stubbornly below the $4,000 mark in recent days, despite registering over 10% gains in the past week. This consolidation phase has analysts pondering whether it’s a healthy pause before further ascension or a sign of a potential correction.\n\nETH/USD Technical Analysis Paints a Mixed Picture\n\nLooking at the ETH/USD technical indicators:\n\nResistance: The immediate hurdle for ETH bulls lies at the $3,850 level. A decisive break above this point could propel the price towards $4,000 and potentially higher.\n\nSupport: The first line of defense in case of a pullback sits at $3,740. A clear breach below this level could see ETH revisit the $3,650 zone or even the 50% Fibonacci retracement level of the recent rally, around $3,550.\n\nMoving Averages: The 20-day and 50-day Exponential Moving Averages (EMAs) are currently acting as dynamic support for ETH prices, indicating a short-term bullish bias.\n\nMomentum Indicators: The Moving Average Convergence Divergence (MACD) on the hourly chart is losing some momentum in the bullish zone, suggesting a potential slowdown in the upward trend. However, the Relative Strength Index (RSI) remains above 50, signifying that the market isn’t yet overbought.\n\nPossible Reasons for Consolidation in Ethereum Price\n\nSeveral factors could be contributing to ETH’s current consolidation:\n\nProfit-taking: After a significant weekly rally, some investors might be taking profits, leading to a temporary price pullback.\n\nWider market correction: If the broader cryptocurrency market experiences a correction, ETH could be dragged down along with it.\n\nMacroeconomic factors: Global economic uncertainties, such as rising interest rates, could dampen investor sentiment across riskier assets, including cryptocurrencies.\n\nLatest Developments to Know Before Trading Ethereum\n\nSpot Ethereum ETF Approval Delays: Fox Business journalist Eleanor Terret reported diminishing optimism surrounding the U.S. Securities and Exchange Commission (SEC) approving spot Ethereum ETFs by May 23rd. Her sources suggest a lack of engagement from the SEC staff compared to Bitcoin ETF applications. Additionally, prominent anti-crypto politicians are reportedly opposing Ethereum ETF approval.\n\nEthereum’s Quantum Readiness: Ethereum co-founder Vitalik Buterin expressed confidence in the platform’s ability to counter a potential quantum computing attack through a hard fork and new transaction types. This would involve a network rollback and user software updates to protect existing wallets.\n\nDeFi Resurgence: The decentralized finance (DeFi) ecosystem has seen a significant uptick, reaching a $100 billion total value locked (TVL) for the first time since May 2022. Ethereum maintains its dominance in DeFi with a 59% market share. Lido, an Ethereum-based staking protocol, remains the leader with $39 billion TVL.\n\nLooking Ahead\n\nThe next few days will be crucial for determining the direction of ETH’s price. A sustained break above $3,850 could signal a continuation of the uptrend. Conversely, a drop below $3,740 with increasing selling pressure could indicate a more significant correction."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQd3l4TlhESUQwbWZ3RVROUDQxTmdBVmdPQXNwelNfamlOTGtnUkhJUmk4eFRoZHBSOWxDMXZmRzNqRDJfUUVNS0FCWkhSbTF0cUZKeDRtYTRCNElTUl9hYU1uMHlnYnpjaWI1clI4b1l0M2NYRUFxaVQxSl9mcGpoaTZIcFdCaEtQZFRxSm9yQlJaZGVKRjZOOVlGS2JCRThNZEFTWmYzMlXSAa4BQVVfeXFMTU5NTGVRVjVGN2cxa1ktZElqZmNWSnB2alRHVTlUZWNRbWpRNnJoQmtNRDdDNXpBdkZ0R1hpSkktY2dDUjNfU2xhTEN0WFphTFZPQVo2ZVUzNkNEcUZHbVlxVVRfMUMxaFhaalVUdl9BOEJDY3d6WXJMd3dJM0dSYVQ3QVRKVDVwQUJfWEY3Q043TW1EeGY3UFlJcVpsMXg5QWM0Yk1ZdEtaTTJ6eDF3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Crypto Prices Today March 11: Bitcoin Drops To $68K, Ethereum At $3,800, SOL, XRP, PEPE Dip - CoinGape",
        "content": "The top crypto prices today registered a bearish turn as the Bitcoin (BTC) price slumped to the $68,000 level after attaining a peak at $70,000. In addition, the Ethereum price dropped below the $3,900 mark. Meanwhile, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) dipped in value.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price sustained above $68,000 despite the pullback The Bitcoin price was down by 1.50%, reaching $68,508.25 at the time of writing on Monday, March 11. On the other hand, it’s trading volume surged by 43.47% to $36.63 billion in the last 24 hours. Meanwhile, the crypto boasted a market cap of $1.34 trillion.\n\nadvertisement\n\nIn the altcoin arena, the Ethereum price dropped 2.54% to $3,854.68 at press time with a market valuation of $462.93 billion. Whilst, ETH saw its trading volume increase by 37.73%, reaching $17.60 billion. Meanwhile, the Binance Coin (BNB) price defied the bearish trend and surged by 5.61%, reaching $521.25. In addition, its 24-hour trade volume spiked by 127.41% to $5.71 billion.\n\nThe Solana price geared up to extend below the $140 level. The Solana price was down by 4.05%, settling at $141.35 On the contrary, SOL witnessed a 35.39% hike in trade volume to $3.95 billion in the last 24 hours. Whilst, the XRP price dropped below $0.62 amid the pullback. The XRP price recorded a dip of 2.52%, reaching $0.61. However, XRP’s trading volume increased by 11.98% to $1.76 billion.\n\nMeanwhile, the Cardano price dropped 2.99% to $0.7142 today. Whilst, ADA recorded a 19.48% hike in its 24-hour trading volume, settling at $723.09 million. As the top crypto prices witnessed a hike, popular meme coins also followed. The Dogecoin price slipped 5.84% to $0.1681 while its rival, Shiba Inu price plummeted by 7.35% in value and traded at $0.00003242.\n\nAlso Read: Bitcoin (BTC) Price Consolidates As ETF Issuers Eyes Crucial Week Ahead\n\nTop Crypto Prices Today Are\n\nPepe Coin Declines\n\nThe Pepe Coin (PEPE) crypto, a popular meme coin, slumped significantly today. At press time, the Pepe Coin price was down by 8.89% to $0.000008381 with a market valuation of $3.53 billion. In addition, its 24-hour trade volume plunged by 20.23% to $1.26 billion.\n\nPyth Network Rallies 50%\n\nPyth Network (PYTH), a trending crypto, recorded an impressive surge of 20% and ranked as one of the top crypto gainers. The PYTH price soared by 19.78% to $0.8291 at the time of reporting. Moreover, its trade volume skyrocketed by a whopping 317.39% to $513.31 million. Furthermore, the PYTH Network crypto recorded a new all-time high of $0.8934 amid the rally recently.\n\nAlso Read: SHIB Vs DOGE Vs Pepe Coin; Who Is Winning The Memecoin Bull Run?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNWnhPdTF0VWVuX29oWVBwODZpalBoNHJGUVpZalF0WUJFU2EwUGE2OXFRM1Q3c0pPMkNDTHZhTkFOeGJXQTlCbkJpeVZUY3pOYUJSV1hBaWlBdXIyMW1BV1JGclJrVnhURVZhUWNLQ0lOY3AzcWVMWGF6UVpsb3dkSFZPTjBGcEdjUXhTdHlYTTNnTW80OTAyc2Q0eUxpeTlvTEc2dXVZV2pjUTVEeDI1Sjd6SElKel9BcWJRRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Here's how Bitcoin, Ethereum, and other tokens are performing on Monday - NewsBytes",
        "content": "Summarize Simplifying... In short Cryptocurrency prices are fluctuating with BNB, Solana, and Shiba Inu seeing significant gains, while XRP, Cardano, and Dogecoin are down.\n\nThe top five gainers of the day include Gala and Pyth Network, while JasmyCoin and Shiba Inu are among the biggest losers.\n\nThe global crypto market cap is currently $2.61 trillion, marking a slight increase from the previous day. Was a long read? Making it simpler... Next Article Next Article\n\nMarket capitalization of Bitcoin stands at $1,365 billion\n\nToday's cryptocurrency prices: Check rates of Bitcoin, Ethereum, Dogecoin, Tether\n\nBy Akash Pandey 10:42 am Mar 11, 202410:42 am\n\nWhat's the story Bitcoin has lost 1.52% in the last 24 hours, trading at $68,533.35. It is up 7.71% from last week. The second most popular token, Ethereum, has dropped 2.48% from yesterday, and is trading at $3,854.36. From the previous week, it is up 10.62%. Bitcoin and Ethereum have a market capitalization of $1,365 billion and $463.42 billion, respectively.\n\nAltcoins\n\nHow have other prominent cryptocurrencies performed?\n\nBNB is trading at $521.69, a 5.65% increase from yesterday and 25.71% higher than last week. The current price of XRP is $0.66, down 2.86% in the last 24 hours. It is 3.76% lower compared to last week. Cardano and Dogecoin are trading at $0.77 (down 3.49%) and $0.11 (down 6.53%), respectively.\n\nOther tokens\n\nSolana's price has increased by 8.37% since last week\n\nSolana, Polka Dot, Shiba Inu, and Polygon are currently trading at $140.64 (down 4.48%), $10.43 (down 0.55%), $0.000033 (down 8.45%), and $1.19 (up 1.94%), respectively. Looking at the weekly chart, Solana has gained 8.37%, while Polka Dot has gained 6.75%. In the past week, Shiba Inu's value has increased by 40.96%, whereas Polygon is 8.1% up.\n\nData\n\nTake a look at top 5 gainers of the day\n\nThe top five gainers on the basis of the 24 hourly movement are Gala, Pyth Network, Theta Network, NEAR Protocol, and FLOKI. They are trading at $0.077 (up 26.13%), $0.88 (up 20.59%), $3.47 (up 12.76%), $6.83 (up 12.12%), and $0.00022 (up 11.27%), respectively.\n\nStable tokens\n\nWhat's going on with the popular stablecoins?\n\nA stablecoin is a cryptocurrency with extremely low volatility. Its value is pegged to a real-world asset such as fiat currency or gold. Talking about some of the popular tokens, Tether, USD Coin, and Binance USD are trading at $1 (down 0.14%), $1 (flat), and $536.9995 (up 11.87%), respectively.\n\nData\n\nToday's top 5 losers\n\nThe biggest losers of the day are JasmyCoin, Shiba Inu, Pepe, Bonk, and Ronin. They are trading at $0.022 (down 8.87%), $0.000033 (down 8.32%), $0.0000088 (down 7.75%), $0.000033 (down 6.89%), and $3.66 (down 6.87%), respectively.\n\nDeFi\n\nTake a look at leading DeFi tokens\n\nDeFi, short for decentralized finance, refers to all global, peer-to-peer financial services on public blockchains. Some of the popular DeFi tokens are Avalanche, Chainlink, Uniswap, Internet Computer, and Dai. They are trading at $41.55 (down 3.71%), $21.31 (up 6.91%), $14.11 (down 1.23%), $13.99 (down 3.85%), and $0.99 (down 0.03%), respectively.\n\nNFT\n\nTop 5 NFT tokens of the day\n\nNon-fungible tokens (NFTs) are cryptocurrencies that lack the attribute of fungibility, which means they cannot be exchanged for one another like other tokens. Among the popular NFT tokens are Internet Computer, Immutable, Render, Stacks, and Theta Network. They are currently trading at $13.98 (down 3.87%), $3.49 (up 0.59%), $11.65 (down 2.82%), $2.99 (down 3.08%), and $3.48 (up 12.89%), respectively.\n\nMarket outlook\n\nTotal cryptocurrency market capitalization\n\nThe current global crypto market cap is $2.61 trillion, a 0.26% increase over the last day. The total crypto market volume over the last 24 hours is $110.85 billion, which marks a 25.28% increase. The global cryptocurrency market valuation was $1.8 trillion last month, in comparison to $1.64 trillion three months ago."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNcnpnM1U0bVhYM1pILXZMVVdjNDBlRDNZdHVUckZmOHlhUmV4RUZFT2NDakk3cEtIV3JYN0JJS1MxalAtQWQxcl9tWEkwbURkVE5pdFZmV3g1SnhtaE94VGhfTGpyZVZsUV9zSE9HbVdSdTU4YWRiSGNjV3pQYUFQZlQ3Q2M0U1kzRGVvRWhmR2M1WVBUbllDbnBYQTlBYUVHbGF2bGtFWm1RUnlFczh2dlhpTThKN05uQk9qYjVPZlEyV1Rl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "JPMorgan credits Ethereum for Crypto boost; Whales favoring this new AI Altcoin over Solana - Cyprus Mail",
        "content": "Analysts at global investment bank JPMorgan have noted three primary catalysts for the crypto boost, naming Ethereum (ETH) as a significant reason for the surge in crypto retail interest. The altcoin’s contributions are highlighted by two impending yet substantial developments within its ecosystem: the Dencun upgrade and the prospective approval of spot Ethereum ETFs. Whale interest in the new AI altcoin InQubeta (QUBE) rises as market sentiment for Solana (SOL) drops.\n\nWith a promising price entry and a prevalent recommended presale, InQubeta is attracting institutional investors. This gem coin merges the blockchain and artificial intelligence industries, guaranteeing a unique and revolutionary crowdfunding model. This article explores Ethereum’s role in the crypto boom and the rising whale interest in the Solana competitor.\n\nInQubeta (QUBE): Attracting Whales with NFT-backed features\n\nInQubeta is a top-rated AI token on the decentralized cryptocurrency list with impressive features that attract investors to the platform. This ICO offers a crowdfunding model backed by non-fungible tokens (NFTs), ensuring all willing participants can hold equity in AI tech startups without needing a considerable budget. Equity in these startups is minted into trending NFTs that are fractionated, allowing investors to own blocks in different projects, thereby diversifying their portfolios and reaping immense rewards from the growth of these startups.\n\nInQubeta is set to clear the eighth stage of its recommended presale as more whales gain interest in the token. Less than 9% of this stage is left, selling at $0.0245 per token, after which the price will increase to $0.028 apiece. The presale has recently hit the $11 million milestone as more tokens are purchased daily and whales buy in bulk. Over 861 million QUBE tokens have been sold, with investors looking to claim substantial returns upon launch.\n\nThis blockchain ICO is topping the decentralized cryptocurrency list with a deflationary token burn model that aims to reduce the supply of tokens in circulation, raising demand and market value over time. A buy-and-sell tax imposed on transactions within the platform funds a dedicated pool that rewards users who stake their QUBE tokens, further reducing supply and raising demand. From trading NFTs to offering exciting opportunities for diversified earnings and passive income, InQubeta continues to thrill investors, welcoming whales to purchase its presale at discounted rates.\n\nEthereum (ETH): Pushing the Crypto market with exciting developments\n\nAccording to JPMorgan analysts, the Ethereum network is credited with two of the three catalysts that will drive crypto prices over the coming months. The team, led by Nikolaos Panigirtzoglou, a top-rated market strategist, has noted that the revival of retail impulse in February reflects market anticipation for the Bitcoin halving event, the Dencun upgrade, and the possible spot ETH ETF approvals. While the first two catalysts are priced in, the spot ETH ETF approval only has a 50% chance based on their on-chain data analysis.\n\nThe major upcoming upgrade for Ethereum, Dencun, is set to be released on March 13th. The upgrade merges Cancun and Deneb, two more minor upgrades on the network. It focuses on the execution and consensus layers of the network to enhance scalability, efficiency, and security while significantly reducing transaction fees on layer 2. The decision regarding the SEC approval for the spot ETH ETFs is expected to be made in May, but skepticism remains as the SEC Chairman has yet to clarify whether Ethereum is a security or a commodity.\n\nSolana (SOL): Continued defiance among top Altcoins\n\nAnticipation for a Solana rally is rising as the token maintains an upward trend, even with expectations of a market reversal for altcoins following recent pullbacks. Its charts indicate a solid bullish trend, as analysts note a series of high lows and higher highs. Following its week-long rally, analysis of the token’s on-chain data predicts a promising trajectory in March, putting SOL within reach of possibly hitting its all-time high of $259.96.\n\nSOL-based products, particularly its decentralized exchanges (DEXes), have witnessed increased user interest. The project’s DEXes have had their most productive week as DeFiLlama’s data, analyzed by AMBCrypto, signified a cumulative volume of $11.24 billion between February 25th and March 2nd. Solana has surpassed all top smart contract blockchains, including Ethereum, with a total value locked (TVL) that surged by 52% in the past month and a 177% weekly growth rate.\n\nConclusion\n\nThe crypto market is rallying, with a boost credited to Ethereum based on on-chain data analyzed by the JPMorgan team. Whale interest in Solana has dwindled as investors turn to other projects with impressive utility and exciting offerings. The AI altcoin is attracting whale investments with its trending NFTs and revolutionary crowdfunding model. Investors anticipate substantial returns upon launch, as the project has proposed a list price of $0.0308, a 340% increase from its initial cost.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities\n\nDISCLAIMER – “Views Expressed Disclaimer: Views and opinions expressed are those of the authors and do not reflect the official position of any other author, agency, organization, employer or company, including NEO CYMED PUBLISHING LIMITED, which is the publishing company performing under the name Cyprus-Mail…more"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQSHZDUWhmNGh0V0NrT1pCR0JJSllyTDZyeVM3eTRNaGc3MEhncTVLQXZqVl9QSVRORm1wSkc0TnZnTU1saWtGTV95Tm10NVo5ODltSzVqdlNRanBsMTJ3QUhocHh3NTB1bV9UTTRtLWJLd243NUZuM2tHS3p0TEdBejM0cDVLQmpzSmNSbkJ5eHhZNUQ4TW9xMVdqeTRuaHlCWmNz0gGoAUFVX3lxTE02OFcyYVRucGFzWXp5anllX2dRV2FPamxTRmE4TWxwMnd0NzZSOFhUNFhKQ0hlMXdkb0JZcUxxWFFTRjJRNnpTR2pjQVdITThjWl8wSGt6UkJrV2RhNjN6dDNfOHpoeGxOVFhEeUtya0VwS3ZSY2lKYlB4cFVxZkc2Q09HRFBhOTZIaWdUVFF0SXc2ekxESE41ZEQ1WDRVMnV6RUFQQXBrOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "Top Crypto Events This Week (March 11th-17th): CPI, Ethereum Upgrade, and More - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nThe crypto market is gearing up for a pivotal week, with multiple significant events poised to shape investor sentiment and influence market dynamics. From crucial economic reports to blockchain upgrades, here’s an overview of the key events to watch out for in the upcoming week –\n\nCPI Report – March 12\n\nThe eagerly awaited February Consumer Price Index (CPI) report, scheduled for release on March 12, stands as a potential catalyst with the power to impact both crypto and stock markets. Investors are keenly observing whether the inflation reading will prompt the Federal Reserve to consider interest rate cuts.\n\nA positive macroeconomic environment is necessary for sustaining the current bullish momentum in the crypto market. We saw Bitcoin, Ethereum, dogwifhat and other altcoins and memecoins surge significantly this week. Considering past experiences, rising interest rates triggered a crypto winter in 2022.\n\nThe bond-market pricing shows that the market believes there is a 62.6% probability of the Fed being the one to execute a rate cut by June. Nevertheless, a delay in the change could result in a negative effect on crypto prices and risk assets.\n\nPPI Report – March 14\n\nOn March 14, the PPI report could provide additional information that would help the Fed judge the necessity of a reduction in rate. The PPI shows upward movement, which could have consequences for consumer prices now.\n\nIncreased PPI could be a sign of broadening the market outside the region. Cryptocurrencies, mainly Bitcoin, are generally referred to as having the ability to act as an inflation hedge just like other precious traditional assets, such as gold.\n\nTraders and investors in the crypto market are keeping a keen eye on the CPI and PPI data which will then determine the Fed’s potential decision on upcoming rate-hike plans.\n\nEthereum Dencun Upgrade – March 13\n\nEthereum’s much-anticipated Dencun Upgrade, set for March 13, marks a significant milestone in the platform’s evolution.\n\nBy integrating “Deneb” with the name of a famous tourist destination “Cancun,” the upgrade will lead to improved scalability, security, and network efficiency. Proto-Danksharding and many other EIPs will be introduced, which aim at lowering costs of Layer 2 approaches, improving security measures, and creating a more rewarding staking experience.\n\nEIP-4844 could, conceivably, bring a drastic downfall in Ethereum’s settlement costs quite effectively. This is a significant development in the context of Ethereum’s pursuit of resolving its scalability challenges.\n\nSam Bankman-Fried’s Sentencing – March 28\n\nSam Bankman-Fried, the founder of the bankrupt FTX crypto exchange, faces a potential prison sentence of up to 110 years on the 28th of March.\n\nBitcoin Halving – March – April\n\nBitcoin halving was predicted to happen earlier on 6th March. Nevertheless, we can expect the Bitcoin halving to take place supposedly around April or May.\n\n“For the previous halving in 2012 and 2016, the market followed by substantial price rise for bitcoin; a bullish narrative for the 2024 halving came up as the market talk”, indicates Rikke Staer, the CEO of Coinify.\n\nSpot Bitcoin ETF Options and Spot Ethereum ETFs – WHEN?\n\nCryptocurrency traders are anxiously waiting for the arrival of a spot bitcoin ETF options which may be several months away.\n\nOn the other hand, the SEC is given a time extension until the end of May to make its decision regarding the first spot ETH ETF applications.\n\nThe green signal to the spot Bitcoin ETFs options and the spot Ethereum ETFs being approved are likely to introduce new dynamics in the crypto market.\n\nRegulatory clarity on spot Bitcoin ETF options and potential spot Ethereum ETFs is a key factor driving investor sentiment in the crypto space.\n\nThe Fed’s interest rate, the sentencing of SBF and the Bitcoin halving to occur in a few weeks are likely to be the main news stories in the crypto industry, affecting traders’ perceptions and strategies."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQcGI1WFY3ZjZUVnFwN0JpclBaSUhvaUtoMGNyeUpMZF92c19xOHFlbE5KM3ZLb2VwdDNiR0hreExpTC12SFBKUWdFUVVLNWJaQ1JqZDhvYmFUbGRjNGpEZU90MUFSeW1TVWZaaFFMNkdZcm80Y05PdjVCQ3Vzc25JSkVhT3o2NVBtbzJNbG9fcHFNS2M3M1daU3NoVdIBoAFBVV95cUxNUm85MTVKVXZGSnlYczc3WllQOEY4Nm1iMTB0MnMwb0h4ckUwekt0Z2V0enlBUXpQcnRqR0x0MlNlRHY2aU5EUVBaNFktR1hYNExiSWRwQVIwbnhWMHpTVjhpMWtXMDlpNVRpYkozQWx0YXRnTi1UUldjRUJnLXVEajJ0dGZHbGQ2ZE9vX2ZYbkFsdDNrVVc5YmkxSmpubEQ1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin Ethereum And XRP Price Prediction For Coming Week! - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nThe crypto industry concluded the first week of March positively with top tokens adding significant value to their respective portfolio. Further, the price of Bitcoin successfully achieved a new all-time high (ATH) of just over $70,000 on 08th March.\n\nThe leader of altcoins, Ethereum (ETH), has added over 14% to its portfolio during the previous week. Ripple (XRP) token on the other hand has successfully recovered its losses during this week, indicating an increase in the bullish influence within the crypto market.\n\nBitcoin (BTC):\n\nThe market leader, Bitcoin, traded in a closed range between $47,705 and $50,540 for a while, following which the bulls recorded a jump of 9.35%. However, the price faced rejection at $52,853, after which the price traded sideways for the next twelve days. As the market volatility grew, the BTC price jumped 27% within the next two days.\n\nAfter displaying a neutral trend for five days, the BTC token jumped 11.33%, recording a new ATH. Following this, the bulls lost momentum and recorded a correction of over 10%. The bulls quickly regained momentum, resulting in a bounce back in the chart.\n\nTradingView: BTC/USDT\n\nThe Moving Average Convergence Divergence (MACD) displays a constant flatline in the chart, indicating a neutral trend for the coin in the crypto market. Further, the averages show a similar trend, indicating an uncertainty in future price action.\n\nIf the bulls hold the price above the support level of $68,296, the price will continue to gain momentum and attempt to test its upper level of $72,000 during the coming week. However, a negative trend reversal may pull the price toward its support level of $64,287.\n\nEthereum (ETH):\n\nThe Ethereum price displayed a neutral trend for a while, after which the market gained momentum and the ETH token recorded a jump of over 8% in value. After trading sideways for a while, the bulls regained momentum and the price jumped 22.5% over the next five days.\n\nFollowing this, the price traded sideways for the next few days. After testing its low of $3,176, the ETH price regained momentum and recorded a jump of over 24% and since then the price has been trading in a closed range.\n\nTradingView: ETH/USDT\n\nThe technical indicator, MACD, displays a rising red histogram, indicating an increase in the selling pressure in the market. Moreover, the averages show a bearish convergence, suggesting the price may continue losing value in the coming time.\n\nIf the market pushes the ETH price above the resistance level, the bulls will regain momentum and prepare to test its upper resistance level of $4,200 in the coming days. Conversely, if the bears overpowered the bulls, the price would lose momentum and fall to test its support level of $3,533.\n\nRipple (XRP):\n\nThe XRP price traded in a consolidated range between $0.530 and $0.5626 for a brief period during which the token displayed significant volatility in its price. As the bulls regained momentum, the Ripple price added approximately 25% over the next seven days.\n\nUpon facing rejection at $0.6624, the Ripple token traded under a bearish influence and recorded a correction of 14% in valuation. After testing its low of $0.5626, the XRP price recorded a jump of 11.80%. Since then, it has been attempting to break out of its important resistance level at $0.6290.\n\nTradingView: XRP/USDT\n\nThe MACD shows a neutral trend in the histogram, highlighting a weak buying and selling pressure in the market. However, the averages show a bullish convergence, suggesting a mixed sentiment in the crypto industry.\n\nIf the market holds the XRP price above the support level of $0.6290, the bulls will continue to gain momentum and prepare to test its upper resistance level of $0.680 by the coming weekend. Negatively, a bearish trend may pull the price toward its lower support level of $0.583."
    }
]