[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPdXgtTzE3T01LZkdGRjhLbFdpUnpHVW9jLU9tX3dDZ0IxdHR4cGZURFZ0Y25FSngzbXM5a0Zac1M4TEFXY01vTHlZVnBRRUNsVG1pVmladUp1by1mWkowdkNQUUE1TzVGaHk3RDJFaERMY1ZwM3ZWWlhMc1o5V3dabw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "The future of spot ethereum ETFs - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nFuture of spot ethereum ETFs\n\nRic Edelman, head of the Digital Asset Council of Financial Professionals and former head of Edelman Financial Engines sits down with CNBC’s Bob Pisani to discuss the next crypto ETF the market is gearing up for and the state of spot bitcoin ETFs."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNWlFxRDUwc185WWF1VFhqcF8tLThiaVZBTlF5czJTNksxMkZnb3JKN044S3ZPSlpLYlFLOWdTTzRrLUw5RVpESkRSSFFONUIwbVQzYVM1WEpSbENEYkFEdWpIT2Y2d1k3d0tvbFdEcHFLOGRhWVZVUjU1Snd5VE0yZ3ZOTVljbVBNMGRNYVN3LWZySWp0Wk5MbGpqZVlTcnl4Qmp6eC14QWxRT1NEYUlZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Ethereum has been increasingly inflationary for over a month as fees hit all-time low - CryptoSlate",
        "content": "Since Ethereum moved from proof-of-work to proof-of-stake in 2022, it has become a deflationary asset. The total circulating supply of Ethereum (ETH) currently stands at 120,105,358 ETH, representing a 415,680 ETH decrease from the supply levels observed before The Merge.\n\nHowever, over the past 30 days, Ethereum’s supply dynamics have shifted, with 35,548.72 ETH being burned (removed from circulation) and 75,072.43 ETH being issued as block rewards to validators. The net result is a supply increase of 39,523.71 ETH during this period. Data from Ultrasound Money show that, based on the supply change over the past 30 days, Ethereum’s current annualized inflation rate is approximately 0.4%.\n\nIn comparison, Bitcoin’s inflation rate stands at 1.068%, while Ethereum’s Proof-of-Work (pre-merge) inflation rate would have been significantly higher at 3.74%. If the current 30-day rate persists, projections for the next year indicate that around 433,000 ETH will be burned, and 914,000 ETH will be issued, creating a net gain of 481,000 ETH.\n\nData from OKLink shows a continued decrease in ETH burned since March, when an average of around 6,000 ETH was burned daily. Since the start of May, only around 900 ETH has been burned daily, the lowest average levels since The Merge.\n\nThe recent Dencun upgrade on the Ethereum network has had a notable impact on the ecosystem. The upgrade has led to a decrease in layer-2 transaction fees and overall network activity. Consequently, this has seemingly resulted in a lower burn rate, pushing Ethereum’s supply back into an inflationary state.\n\nData from Etherscan and Ycharts shows that gas fees have also plummeted to around 5 gwei, the lowest on record.\n\nInterestingly, Ethereum’s inflation rate has drawn closer to that of Bitcoin, especially in the aftermath of Bitcoin’s halving event last month. As per data from the past 7 days, Ethereum’s inflation rate for the past week stands at 0.54%, just 0.29 percentage points higher than Bitcoin’s post-halving rate of 0.83%.\n\nEthereum’s inflation rate has been steadily increasing since February when it reached a local low of -2%.\n\nWhile Ethereum’s supply has become slightly inflationary in the short term due to reduced network activity and burn rate, its overall supply is still decreasing on a net basis. This can be attributed to EIP-1559, which introduced a burn mechanism for a portion of transaction fees.\n\nLooking ahead, Ethereum’s inflation rate and supply dynamics will likely be influenced by future network upgrades and adoption trends. If transaction fees and burn rate remain low, Ethereum may continue to experience inflationary pressure in the near term. However, the long-term trajectory will depend on the success of upcoming upgrades and the overall growth of the Ethereum ecosystem.\n\nThe adoption of layer-2 networks and the recent increase in layer-3 network activity reduces load from the Ethereum mainnet, yet it does so at a cost. However, the current increase in L2 and L3 activity is not at a level to create sufficient L1 transactions to keep Ethereum deflationary. Only time will tell whether the ultra-sound money concept for Ethereum will be retained in a world dominated by L2 and L3s."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPQ1owd01CdmxhVXRnRTY5SXFBN2ZUc0FYRWJLZnNXV0RKbEs1WjgzR25NRUlzZzZ2MDNBQmFaZXdma0lieENJbzVSOEx2Q19hX2NsdHdiSlc2ajZaNnBrZ0lSLUNmY01tZG16b29SbS1LMUJLOGR3MjJoa0RqZW9zNUVIeERqc2piT0JxODNMbGM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Is Ethereum Still a Millionaire-Maker Crypto? - The Motley Fool",
        "content": "If you are thinking about investing in Ethereum, focus on future growth potential, not historical track record.\n\nSince its launch in July 2015, Ethereum (ETH 0.10%) has skyrocketed in price from just $0.31 to $3,000 today. That's a nearly 10,000-fold return on your investment! If you had invested just a few hundred dollars in Ethereum a decade ago, you'd likely be a millionaire today.\n\nBut does Ethereum still have the power to make you a millionaire? While it's hard to argue with Ethereum's historical track record, things get a bit dicier when you consider its future prospects.\n\nCompetitive landscape\n\nWhen Ethereum launched back in 2015, it stood alone as the only smart contract blockchain platform. And, as such, it had an incredible first-mover advantage. Arguably, it was not until 2020, when blockchain upstart Solana (SOL -1.47%) appeared, that Ethereum saw its first legitimate rival.\n\nTo put that into perspective, imagine if your favorite Silicon Valley tech company had an incredible five-year head start on the competition. After that time period, it would probably appear to have an insurmountable lead when it comes to market share, intellectual property, and customer lock-in. Quite frankly, it would look unstoppable.\n\nThat's why I think Ethereum's ability to replicate its historical track record is limited at best. There's simply too much competition now, and Ethereum is no longer the only major Layer-1 blockchain. Check for yourself -- three of the top 15 cryptocurrencies by market cap are direct Ethereum rivals. That type of competition simply did not exist back in 2015.\n\nIncremental vs. disruptive innovation\n\nMoreover, I've soured a bit on Ethereum's endless blockchain upgrades. Yes, the 2022 blockchain upgrade known as The Merge was impressive. People have compared that technical feat to changing the engine of an airplane while in mid-flight. The Merge resulted in a total transformation of Ethereum. In the process, Ethereum became faster, cheaper to use, and more efficient in processing transactions.\n\nHowever, Ethereum originally promised us 1 million transactions per second, and we're nowhere close to that. Of even more concern, Ethereum now relies on a complicated mix of Layer 2 blockchains for scalability and functionality. The core Ethereum blockchain (i.e., the Layer 1) just isn't fast or efficient enough to handle current transaction volumes. So, we have several more upgrade cycles to go, each filled with new tweaks and upgrades.\n\nThere's nothing wrong with incremental innovation, of course. But there's a big difference between incremental innovation and truly disruptive innovation. And that's what has me concerned about Ethereum -- we may have witnessed the end of disruptive innovation with The Merge. And that's going to open up the door for fast, nimble competitors to challenge Ethereum.\n\nThe SEC and regulatory risk\n\nFinally, there's the pesky little matter of the Securities and Exchange Commission (SEC). Ever since The Merge, the SEC hasn't quite made up its mind about whether Ethereum is a commodity or a security. When Ethereum converted into a proof-of-stake blockchain as part of The Merge, it changed the way that people interact with the blockchain, with possible regulatory consequences.\n\nFor example, the process of staking crypto could be interpreted by some as \"the investment of money in a common enterprise with a reasonable expectation of profits to be derived from the efforts of others.\" According to the SEC, that would make Ethereum a security.\n\nThis might sound incredibly wonky from a legal perspective, but it matters for investors. There are some Bitcoin maximalists delighting right now in Ethereum's potential regulatory quandary, and there is a very real risk that the SEC could deem Ethereum to be a security. If that happens, all bets are off. I don't think it would pose an existential risk for Ethereum, but it would certainly scare away a lot of investors.\n\nThe myth of the 1,000x crypto\n\nIf you have $1,000 to invest in crypto today, you would need a 1,000-fold return on your investment to become a millionaire. So, let's reframe the original question of Ethereum being a millionaire-maker crypto in the following way: Can Ethereum increase 1,000 times in value from its current price of $3,000?\n\nThat would suggest a stratospherically high $3 million price tag for a single Ethereum coin sometime in the near future. Given Ethereum's circulating supply of 120 million coins, that would imply a total market cap of $360 trillion! By comparison, the total market cap of the S&P 500 these days is about $50 trillion.\n\nAt the end of the day, investing based only on past performance is like driving a car by only looking in the rearview mirror. So stop focusing so much on Ethereum's historical track record, and focus more on how it's going to create value in the future."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOTlpoTkxWUENncWpiSHljYmpQdm5STUFDVDZkd214T1FFT2JIVlFKTjRlQUZ2U29wdF92ak4zOGg0eS1BLTVoN2lYSi1ndHI5Tkw3bmxLM2VUX05oZ3NuNm1pcVRJbnJFR0ZSYWowVGhDbGQ1dy1qLWQ5OFJMekZBckxMOURCZ2xvLUFyWi1GVWp4SnFQSE1ZM291Y19XTUt0T0VLRndGRWU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "How this crypto hedge fund will trade the Ethereum ETF decision - DLNews",
        "content": "The SEC is likely to reject Ethereum spot ETFs.\n\nBut Ethereum may still rise in the aftermath of the event.\n\nThe deadline for the Securities and Exchange Commission to approve or deny spot Ethereum exchange-traded funds is only nine days away.\n\nThe outlook is gloomy. Bloomberg Intelligence ETF analyst Eric Balchunas told DL News that he doesn’t expect approval before the end of 2025. Bettors on Polymarket, meanwhile, ascribe a 14% chance of the ETFs getting approved before May 31.\n\nBut the consensus around the SEC’s decision may offer an opportunity to crypto traders.\n\n“Sell the rumour, buy the news”\n\nThere’s an expression in markets: Buy the rumour, sell the news.\n\nIt refers to the practice of accumulating an asset — a crypto coin, or a company stock — in the lead-up to a scheduled, bullish event, and dumping it after the announcement.\n\nThe launch of the Bitcoin spot ETFs is a good example: Bitcoin rose 77% in the three months leading to the approval, but crashed 20% immediately after the ETFs were greenlit.\n\nThe Ethereum ETFs might offer a similar strategy, but in reverse, Quinn Thompson, founder of crypto hedge fund Lekker Capital, told DL News.\n\nHe suggested that the rejection of the Ethereum ETFs may lead to some bullish price action.\n\nJoin the community to get our latest stories and updates\n\n“It’s clear that positioning and sentiment is skewed bearish going into the event, given consensus is strongly towards a rejection,” Thompson said. “But given everyone is largely on one side of the boat going in, you should be looking to fade [the market’s expectations].”\n\n”In these situations, it takes a drastically better upside or worse downside to not fade consensus going [into the event],” he added.\n\nIn other words, the rejection is likely priced in already, and market participants may find themselves caught off guard if Ethereum suddenly pushes higher.\n\n“My best guess is that it’s a nonevent, as a likely denial is hopefully incorporated into the market,” Brian Rudick, senior strategist at crypto trading firm GSR, told DL News.\n\nThe warning signs are all there, Rudick said — the SEC’s lack of engagement with prospective ETF issuers, Ethereum’s uncertain regulatory status, and the agency’s investigation into the Ethereum Foundation.\n\nThompson, meanwhile, said that the SEC’s reasoning behind the anticipated rejection would likely affect any trading strategy.\n\n“If there’s a rejection due to litigation, I could see that bringing the market down a bit,” he said.\n\nThe SEC has until May 23 to decide whether to approve or reject asset manager VanEck’s application to launch a spot Ethereum ETF.\n\nCrypto market movers\n\nBitcoin is up 1% over the past 24 hours and is trading at $61,835.\n\nEthereum is up 0.3% to $2,918.\n\nWhat we are reading\n\nTom Carreras is a markets correspondent at DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNUlIyRTlQNHJ2NlNJeDNHQW5JSmZRdDk4R0VPc0NfQS1mZlBQMjdkSkF4bEx0OXdYNl9FUTVXUHZDWVdDOHNPUlJLelNpRUxzNlF5M2ZPc0ZoeEplS2Rjd244cUdPaXdiNDU3d3YydXAtZllESzFRVkp3X1FZY1RzeGFvc1lhV3F3RjdOMmlkVTBrc050TDlxWFBOQWRiSHBvZVpJTlczVUhCYVg1dlpzeEhPcXVseVBMTS0zTlBUUlo5OUVTakhGeFRhT0J1UdIB0wFBVV95cUxNUV9oQmJscVE1SURfME1rWVpxOVFBTUx1b1p0SmFZdHBidnVLUmZaakVlYW9oc01jcE9sM01aS1VqbXdnakVORi02bE5KekVKUFZRcGFOV2hleGZUSWNGVUo2a3lqMTNDNDFqNlRLWWxRVU5rWHR0QWNSVl9fZFN0RGM4dnVrRERHU0tJc3pVMjlLcUdZUm53QW95R1p1WFVYSGoydHliVzJwdDJnRk1lZHlJXzBscmYzTW1URmVHS2t4ZUN0ZnVlY0lleHBENTVwdzVz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 May 2024 07:00:00 GMT",
        "title": "Analyst Michaël van de Poppe Says Big Moment Coming for Ethereum, Predicts Rally for Layer-1 Altcoin - The Daily Hodl",
        "content": "Crypto strategist Michaël van de Poppe believes that Ethereum (ETH) is close to witnessing a big trend shift.\n\nVan de Poppe tells his 717,600 followers on the social media platform X that he doesn’t expect the U.S. Securities and Exchange Commission (SEC) to approve pending applications for spot Ethereum exchange-traded funds (ETFs) in the coming weeks.\n\nThe SEC is slated to approve, delay or deny the ETH ETF applications by financial giants Hashdex and Ark 21Shares on May 30th after postponing it in March.\n\nVan de Poppe predicts that the SEC’s decision will end up being a pivotal point for the top altcoin by market cap.\n\n“This is a very likely scenario with Ethereum, through which the delay/denial in two weeks is the big moment of reversal for ETH and the markets.”\n\nLooking at the trader’s chart, he seems to predict that ETH will plunge below $2,700 before reversing and rallying to $3,800.\n\nAt time of writing, ETH is worth $2,920.\n\nNext up is the layer-1 crypto project AIOZ (AIOZ). According to the analyst, he expects AIOZ to sustain its bullish momentum as long as it continues to trade above $0.65.\n\n“This one looks very promising and is one of the strongest trending assets.\n\nIn-trend level to hold: $0.65-0.68.\n\nIf that’s lost, then the long-term investment region comes into play.\n\nIf we hold, I expect $1.35-1.45 might seem next.\n\nVery strong one.”\n\nAt time of writing, AIOZ is trading for $0.795.\n\nAnother altcoin on the trader’s list is the Ethereum scaling solution Arbitrum (ARB). Van de Poppe thinks that ARB is very close to carving a bottom.\n\n“This one has a full correction and is at the end stage of the correction. Massive cascade in the past weeks, through which the markets often fill that wick in the weeks after. In that regard, markets are close to the end of the correction.”\n\nBased on the trader’s chart, he seems to predict that ARB will bottom out at around $0.90.\n\nThe last altcoin on Van de Poppe’s radar is the native asset of the video-sharing blockchain Verasity (VRA). According to the analyst, VRA is in a full-blown downtrend and may find support at $0.004\n\n“A full retracement is happening, which is relatively common for altcoins in this stage of the cycle.\n\nAn important area of support, and I think most of the pain is already in.\n\nThis support has held in the past, and I expect to do the same here.”\n\nAt time of writing, VRA is worth $0.0051.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOYzc0UVUxLTVfcUEybTFEQUtGbWxhSjkwWUdjYXhVb2I2b2gtc1BWMk5WcjlZeWQyd3RmSXZUbmpES00yeVVMME1MTVNTM0JCSDh5cW9OeDY2bVJSVlh6QXZXNnpYWmxSMlhCU3BMRUhCTDFGZGlWZGpQWkJXM3Z4Z0p6UdIBiAFBVV95cUxQWlA0U2xYSExwMW0yaVV1ZEFoeFZTeFJCLVdYbF9fcHItMmdrUU5rX0k3cko1d25sLXZ2RzItV2FGRnhKdDRLQUJsOHJqOVpvdklDTDdXdkhmNU5Hek9PVlZKYmotTlIzU1dEY2g1RDZBUll4VmEtNE5CdkMxWEVaTmlsU2g1OXh5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Ethereum sees $12M whale transfer: What about ETH’s price? - AMBCrypto News",
        "content": "Ethereum’s Netflow got more positive.\n\nETH was close to entering the $3,000 price zone.\n\nRecent data indicates that one of the early Ethereum [ETH] holders has transferred millions of dollars worth of ETH to an exchange.\n\nWhile this movement was relatively small, it could contribute to the positive Netflow trend that ETH has been experiencing recently.\n\nEarly Ethereum holder sells most of their holdings\n\nAccording to data from Spot on Chain, a significant transfer of 4,153 Ethereum coins to Coinbase occurred in the early hours of the 13th of May.\n\nThis transfer, valued at over $12 million at the current ETH price, caught attention because the originating wallet is among the asset’s early holders.\n\nFurther analysis revealed that since 2021, this wallet had deposited over 9,000 ETH—worth more than $21 million—to exchanges.\n\nAs of press time, the wallet retained 2,566 ETH, valued at over $7 million. This recent transfer has contributed to the increased positive Netflow observed in Ethereum transactions.\n\nEthereum inflow increases\n\nThe Ethereum Netflow chart analysis indicated a notable increase in positive flow over the last three days. However, it appeared poised to be the highest observed in recent days.\n\nWhile the Netflow stood at around 4,600 and 3,000 in the preceding two days, it has surged to over 18,000 at the time of this writing.\n\nThis surge suggested a significant increase in exchange inflow over the past 24 hours.\n\nFurther analysis of the ETH inflow chart revealed that over 83,000 ETH had entered exchanges at the time of this writing.\n\nConsidering the 94,000 inflow recorded yesterday and the ongoing inflow, we will likely observe further increased activity by the end of the day.\n\nETH price and volume see an uptrend\n\nAnalysis of the Ethereum volume indicated a pickup at press time.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAfter experiencing a drop in the previous trading session, with volume falling below $10 billion, the volume has now reached approximately $10.1 billion as of this writing.\n\nAdditionally, the price of ETH is approaching the $3,000 price zone. The daily timeframe chart examination revealed that ETH had surged by over 1.7%, with its trading price around $2,980."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNV3V2QWwwcGNncFhfVzZkNkk2b1VVZTFJY2p3Zk9aZVN5cjRnSFZvTEVxS3ZLakF3NkxHSkp5V3hEZlEzdTc4VlN6bzhjSDg1Ui04bDNud1FNblhCQWFsTlk2VFg0RS1FTWtXZVMzQ3h6NDhpNkV0QVA3aEpId083bG1JQjlmYnIzNjNXcXFmSGV4OGdSaU9mNXo0dUNycFpfV1BTNzA4eEYxNXNPRGk4VUJCaXAtMVJCcGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Ethereum Hits 1 Million Active Node Validators, Will ETH Price React? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNVXkxMS1WSllfX0JOTWJoY0VoWFRTTDVNU1dLS2M0aWlYRW12bjN0NEpXaF9OeTJ5X3ppSUFlTWpydmItT3NVdXNzS2xpOGtRQjVhYTdHM2UtVW5WeDFHWXd2RTY4UnlWRXREdzhZenpMd2J3bng1R2tuNlZDc3NaYVB1Mkl6TUdPMUVRVnBWS21HUWpkeHNr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Prediction: Ethereum Will Reach $5,000 by the End of 2025 - The Motley Fool",
        "content": "If Ethereum is going to hit a new all-time high of $5,000 in 2025, here's what needs to happen.\n\nIt's been a strange year for Ethereum (ETH 0.02%). The world's second-largest crypto exploded out of the gate early, soaring from $2,200 in January to $4,000 by mid-March. It looked like Ethereum was easily going to reach the $5,000 mark by the end of the year.\n\nBut that's not what happened. Ethereum fell in value after hitting its high-water mark of $4,000, and now sits right at the $3,000 level. The good news, though, is that there are two key catalysts that could help Ethereum reach the $5,000 level by the end of 2025.\n\nThe arrival of altcoin season\n\nFirst and most importantly, there's the arrival of \"altcoin season.\" This refers to the period of the crypto bull market cycle when lesser-known altcoins explode in value. This typically happens during the early stages of a Bitcoin halving cycle, when investors start to diversify their holdings in search of higher returns.\n\nConsider what happened during the previous altcoin season, which lined up nicely with the start of the previous Bitcoin halving cycle in May 2020. On the date of the halving, Ethereum was trading under $200. One year later, it was trading for $3,800. It eventually went on to hit an all-time high of $4,891 in November 2021.\n\nWhile there's no guarantee that this same pattern will happen again in 2024, it's clear that investors are starting to look around for other places to invest their money beyond just Bitcoin. Thus far, meme coins and AI crypto tokens have gotten all the attention, but the time could be coming soon for larger-cap cryptocurrencies such as Ethereum.\n\nThe approval of spot Ethereum ETFs\n\nThe other big factor would be SEC approval of new spot Ethereum exchange-traded funds (ETFs) similar to the new spot Bitcoin ETFs. Admittedly, these spot Ethereum ETFs would likely not see the same types of inflows as the new spot Bitcoin ETFs, but the influx of new money would still be significant. And that new influx of money would presumably help to push the price of Ethereum higher over the next 18 months.\n\nAs in the case of the Bitcoin ETFs, there are a number of influential Wall Street players fighting to make them a reality. These include the likes of Ark Invest and BlackRock, both of which now have extraordinarily successful spot Bitcoin ETFs. Approval for these new spot Ethereum ETFs was supposed to come in May, but it now looks like the Securities and Exchange Commission (SEC) will push off approval for these ETFs until the end of the summer.\n\nThe impact of these new spot Ethereum ETFs could be huge. Arguably, the primary reason why Ethereum soared in price from $2,200 to $4,000 earlier this year was the expectation that the new spot Ethereum ETFs were coming soon. Wall Street got a bit ahead of itself, and was already starting to price in their impact. So, it's not out of the range of possibility that Ethereum could soar from its current price of $3,000 to $4,000 once these new investment products are approved.\n\nBeware the SEC\n\nThe only problem, of course, is that there's something about Ethereum that the SEC does not like. Ever since Ethereum transformed from a proof-of-work blockchain to a proof-of-stake blockchain in September 2022 as part of The Merge, the SEC has been looking for reasons to classify Ethereum as a security.\n\nRecently, the concerns about potential SEC oversight have returned, and that has had a chilling effect on Ethereum's price. That's why I don't think Ethereum will reach the $5,000 mark this year -- investors need to have absolute clarity about regulatory risk before Ethereum can skyrocket in price.\n\nThe good news here is that the regulatory climate appears to be shifting in Washington, D.C., in favor of pro-crypto legislation. And some lawmakers have spoken out publicly about the potential overreach of the SEC and the need to change crypto's regulatory framework after the 2024 election.\n\nHow high can Ethereum go?\n\nThe future price trajectory of Ethereum will depend, to a considerable degree, on the price trajectory of Bitcoin. If you assume that Bitcoin can hit a price of $150,000 by the end of 2025, as many crypto investors now do, then Ethereum has the potential to soar in value to $7,500.\n\nUsing just a few back-of-the-envelope calculations, it's easy to see why this is possible. A $150,000 price tag for Bitcoin implies a $3 trillion market cap. If you then multiply that figure by 0.3 (which is the ratio of Ethereum's current market cap to Bitcoin's current market cap), you arrive at a market cap figure of $900 billion for Ethereum by the end of 2025. Given Ethereum's circulating coin supply of 120 million, that implies a price of $7,500.\n\nSo, while $5,000 might sound at first like a pie-in-the-sky price forecast, it's really not. In fact, it's a bit conservative. As long as the SEC doesn't get involved, Ethereum has a real chance to hit $5,000 by the end of 2025."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE8xblpGdndDcGdPb1RDdzhDMVBQMk5vcXdFb0FwVE9vZ2J3WW5qRjhob3NhNHEtcWpYbnVsbVR0ZUVuUmRkeHZ1SmptcktLV21GOS1WRHBBZzhCbjlPYllzaFVTTndLTHZZcG1ZNEdxNi1hSmE1ZnQybV9n0gF_QVVfeXFMUGV2WDJNem9sRVAyQzBPd1ltZmlXaW53TUptYkRGUERIRnhrWmhGei1OczljWnI4UlVTODVIa0pBRjNyRTl0MTY0RDVBRVBudWttZXlYajd1SUMyNWgyb05NZHZ2QW8yVFVjY002Z21CeGxmc2ZPQ1VSTFpfa0JEMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 May 2024 07:00:00 GMT",
        "title": "Can Ethereum bulls take bears out of the market? - AMBCrypto News",
        "content": "The positive reading of the bulls and bears indicator suggests that the price might increase.\n\nEthereum’s network was overvalued and could hinder the potential upswing.\n\nThe price of Ethereum [ETH] might have decreased by 7.30% in the last 24 hours, but an assessment of a key indicator suggested that the decline might soon end.\n\nThe indicator talked about here is the Bulls And Bears metric provided by IntoTheBlock. This indicator can be measured in addresses or volume.\n\nHowever, the focus is usually on large buyers or sellers, as they have a big influence on price movements.\n\nThe 1% want to keep the faith\n\nA net negative of the Bulls and Bears indicator suggests more large sell orders than buys. In this instance, the price of the asset involved might decrease.\n\nBut for Ethereum, data showed that the reading was positive, indicating bullish confidence in the price trend. Should this metric maintain its position over the coming days, then ETH might be able to rise toward $3,100.\n\nHowever, failure to sustain the status quo or improve on it could send the price of the altcoin below $2,800. When AMBCrypto looked at Ethereum’s STH-NUPL, we observed that market participants were not exactly confident in the cryptocurrency.\n\nSTH-NUPL stands for Short Term Holder — Net Unrealized Profit/Loss. With this metric, one can have an idea of the behavior of short-term investors.\n\nInvestors panic, but ETH may come to their aid\n\nFrom our analysis, ETH’s underwhelming price action has changed the sentiment investors have toward the coin. In March, the metric was in the optimism (yellow) region.\n\nAt that point, holders were confident in ETH’s price action. But as of this writing, that reading has reached the capitulation (red) region, indicating that market participants are in fear.\n\nHowever, fear can act as fuel for a bounce. If the STH-NUPL continues to fall, ETH’s price might also decrease.\n\nMoving, on, a turnaround might occur as intense fear could trigger a harder upswing if buying pressure increases.\n\nIn this instance, Ethereum might target a rise toward $3,500. Besides this metric, AMBCrypto found another indicator suggesting that ETH might soon recover.\n\nThis time, we looked to the dormant circulation. According to on-chain data from Santiment, the 90-day dormant circulation had dropped to 9246.\n\nIf the metric increases, it means that coins that have not moved for a long while are starting to change wallets. Sometimes, this means old hands are selling.\n\nThus, the recent decline implied that long-term Ethereum investors were not selling as much as they did around the 7th and 8th of May.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nHowever, the Network Value to Transaction (NVT) ratio suggested that ETH might still be overvalued. Low values of the NVT suggest undervalued.\n\nBut for Ethereum, the metric spiked, indicating that the network is overvalued relative to transactions."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOVDU2dWozeEFCcjR3bGV4cjh1NnFFVy1IaXlKNnQ3UUFQOU1oVVQybGx0SURxVFhuck5yam5yUmtSako3SlZZTl90R3hFWGJ0aTdBbHhsTkEyS3MwOE5BU2pRMTQ0WE53cTVIWUkxN2M3SzI5MXphTjhya2FCVU9lSmJ1TmcxelFUN3o0NkhfcTJfLUJ5OXBF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 May 2024 07:00:00 GMT",
        "title": "4 Reasons to Buy Ethereum Like There's No Tomorrow - The Motley Fool",
        "content": "The world's second-largest cryptocurrency still has a lot of upside potential.\n\nEther (ETH 0.02%), the largest cryptocurrency of the open-source Ethereum network, has rallied nearly 70% over the past 12 months. However, it's still trading about 35% below its all-time high of $4,815, which it reached during the apex of the buying frenzy in cryptocurrencies in November 2021.\n\nSome bullish investors believe Ether's price could soar even higher. VanEck's Matthew Sigel and Patrick Bush expect its price to reach $11,800 by 2030, while Ark Invest's Cathie Wood believes it could be worth $166,000 by 2032. Investors should take those estimates with a grain of salt, but I believe Ether could still head much higher for four simple reasons.\n\n1. Interest rates are stabilizing\n\nEther, Bitcoin (BTC -1.65%), and many other cryptocurrencies were crushed in 2022 as rising interest rates drove investors toward more conservative investments. However, the Federal Reserve recently left its rates unchanged and won't likely raise them again this year. That stability -- and expectations for lower rates after inflation cools off -- should drive more investors back toward cryptocurrencies and riskier plays.\n\n2. Its supply is declining\n\nIn August 2021, the Ethereum Network implemented two major changes with its \"London\" upgrade. First, it changed the calculations of transaction fees -- also known as \"gas fees\" -- from a manual bidding system instead of an automated one. That change simplified and streamlined the process by setting prices based on the congestion in the network.\n\nSecond, it started to \"burn\" -- or remove from circulation -- the base fee of every transaction on its network. That burning process ensured that only Ether could be used to pay for transactions across the Ethereum Network (which solidifies its economic value) while gradually reducing its supply to stabilize its market price.\n\nIn September 2022, the Ethereum Network switched from the energy-intensive proof of work (PoW) mining method (used by Bitcoin) to the more energy-efficient proof of stake (PoS) method. That transition, known as \"The Merge,\" reduced its total mining energy consumption by about 99.95%.\n\nIt also made the Ethereum Network deflationary -- so more Ether was being burned than being issued. As a result, about $12.7 billion in Ether has been burned since the London upgrade. That's equivalent to 3% of its current market cap of $378 billion. While that burn rate might gradually cool off, the ongoing process should limit the crypto's downside potential.\n\n3. Possible ETF approvals in the future\n\nThe U.S. Securities and Exchange Commission (SEC) approved the first spot price Bitcoin exchange-traded funds (ETFs) earlier this year. However, the SEC has been reluctant to approve the first spot price ETFs for Ether because it believes Bitcoin is the only cryptocurrency that can be considered an asset instead of a security.\n\nThe SEC believes that Bitcoin's PoW process is more similar to the physical process of mining precious metals, so it can be assigned a market-driven spot price like gold and silver. But it says the PoS process that Ethereum uses makes it more similar to a security, which is subject to tighter regulations than commodities.\n\nThe SEC doesn't seem eager to approve the first \"spot price\" Ether ETFs anytime soon, but ETF issuers -- including VanEck, Ark Invest, and seven other companies -- could file litigation against the agency to accelerate the process. The recent approvals of Bitcoin and Ether ETFs in Hong Kong could also force the SEC to stop dragging its feet.\n\n4. The growth of decentralized apps\n\nThe main thing that sets Ether apart from Bitcoin is its open-source network. Bitcoin's blockchain can only be used to mine the cryptocurrency, but developers can build decentralized apps, tokens, and other crypto assets on the Ethereum Network.\n\nAccording to Fortune Business Insights, the decentralized apps market could grow at a compound annual growth rate (CAGR) of 28% from 2023 to 2030 as more companies roll out decentralized investing, lending, and crypto services that aren't tethered to centralized financial institutions. That expansion could drive more companies and consumers to adopt Ether as a mainstream digital currency.\n\nInvestors should brace for lots of volatility\n\nEther, like Bitcoin, is a volatile asset that could easily lose half its value before it doubles again. Therefore, investors shouldn't use any cash they need over the next five to 10 years to buy Ether. That said, Ether could still generate massive long-term gains for investors who can stomach all the near-term volatility."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNanBTc3kyNUNUT0wwRnhWY3ZxQUxHUEJRckpyV3dnSlhsNExrS3ViSUNfc3JFYllBSUlKU3k1Rl9TZUJHQnNzYzFBeXRTMkRjdDlNdWxLNDhneWpCeGQ0TEMxWmsxUTlVVVBMd3ZOX1c3X1RIRUNwRXNxc1QybUg1TVdYMEJpZFdiX0JLR1dn0gGTAUFVX3lxTFB2bHZ5ck1zNG9pZWNHWjZIdEZHbUdGYUZSci1mWnBJRWpLbG9Gd1RncHVjT0N0NXA0ZEU1QjRwUHVTNE91TWVXSzk2cWYwQTFDS0tqbEVLQm5XdVJILTBLaW1TY3VqT2h3X3RDR3hxb0FNSFZ4clZXRGNiVE1BekVpOFBPY2p5NDFBQ09UVEZndGtvTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 May 2024 07:00:00 GMT",
        "title": "Ethereum network dips to 6-month low – Here’s how it affected ETH - AMBCrypto News",
        "content": "Ethereum’s fees hit a six-month low in the past seven days.\n\nETH was down by 6%, and metrics looked bearish.\n\nAs L2s gain popularity, Ethereum’s [ETH] network usage plummets, reaching a six-month low.\n\nThis aligned with Vitalik Butarin’s 2020 roadmap, which aimed to enhance scalability by offloading transactions from the mainnet.\n\nIn the meantime, ETH bears entered the market and pushed the token’s price down.\n\nEthereum’s network activity dwindles\n\nIntoTheBlock recently posted a tweet highlighting the fact that ETH’s fees plummeted to a 6-month low this week as it dropped by over 29%.\n\nThe drop in ETH’s fees reflected a shift in activity to over 50 live Layer 2 networks. To see what’s going on with Ethereum, AMBCrypto analyzed Artemis’ data.\n\nNotably, overall activity on the network had dropped, alongside the blockchain’s Daily Active Addresses declined last week.\n\nETH’s Daily Transactions also followed a similar trend. The decline in fees also caused the blockchain’s revenue to drop last week.\n\nNotably, it was surprising to see the blockchain’s usage drop when its gas price declined. As per Ycharts, ETH’s gas price dipped from 47.5 Gwei to 8.5 Gwei over the last month.\n\nEthereum turns bearish\n\nWhile the blockchain’s network activity dwindled, its price action also turned bearish. According to CoinMarketCap, ETH’s price has dropped by more than 6% in the last seven days.\n\nAt the time of writing, it was trading at $2,920.99 with a market capitalization of over $350 billion.\n\nAMBCrypto’s look at Glassnode’s data revealed a possible reason behind this price decline. We found that ETH’s number of addresses with balances greater than $100k sank over the last seven days.\n\nThis clearly indicated that whales were selling their holdings.\n\nNot only whales, but selling sentiment was overall dominant in the market. Our analysis of Sentiment’s data pointed out that ETH’s Exchange Inflow spiked twice last week.\n\nAdditionally, its Supply on Exchanges increased. This hinted at a sell-off, which might have triggered the price correction.\n\nThe negative price action also had a negative impact on market sentiment. Ethereum’s Weighted sentiment dropped in the last few days, suggesting that bearish sentiment around the token was dominant.\n\nAMBCrypto then analyzed ETH’s daily chart to see whether a further price drop is likely to happen.\n\nWe found that its Relative Strength Index (RSI) was resting under the neutral mark. Its Money Flow Index (MFI) also registered a downtick.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe king of altcoins was resting under its 20-day Simple Moving Average (SMA) at press time, indicating a further price decline.\n\nETH’s price had touched the lower limit of the Bollinger Bands, which can trigger a trend reversal."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNZHNmcWVYTEFuQUsxQW1xN21RVFBoeXNrTndfVFoxT3MzbWRsN0xzbHRQODZvbmxGZUEwUVlSMWNMVU5CU3NFeDRpbDN0alF2ZHZvUU9BSzNxNFRacmM5VldFVENNWHhLNDE0VDFORFQ3WVFWMm9TVDNFZE5hTElEekhaRdIBiAFBVV95cUxOdUw3a29aekpGUEd1dTlaSlEwaXVOQ0xlcTlZck1CZTZyN1lGMTJQWng1a0RKR0hDMW1nOFZlTjdBcF9nNEdpT05BTENpOVQtcldJdTA5OVNyQVpGRlBuYlFMamNMbXhhMy0wMEZ0M0FVdmMxWGJpbXhtYkc1YnhSQXBFc2ZvcXgx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Ethereum Sell-off Fears Mount as 56,795 ETH Linked to Coinbase - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) is exploring a reboot from its weeklong bearish drawdown, relying on the power of its ecosystem whales. However, there seems to be a contradictory trend as on-chain data shows that as many as 56,795 Ethereum have moved in and out of Coinbase in 24 hours.\n\nAdvertisement\n\nEthereum whale transfers, What's happening?\n\nData from crypto analytics platform Whale Alert shows that ETH moved in and out of Coinbase in different tranches, with sell-off fears heightening. The largest of these transactions featured the transfer of 30,020 ETH worth approximately $86,959,077 from an unknown wallet to Coinbase Institutional.\n\nWhile the actual motive behind any transfer cannot be guessed, this communicates the expectation of a sell-off to observers. This sender has a very tricky track record with Coinbase Prime. The address reportedly converged more than 30,000 ETH over the past six days before eventually transferring them all in one fell swoop.\n\n🚨 🚨 🚨 🚨 30,020 #ETH (86,959,077 USD) transferred from unknown wallet to Coinbase Institutionalhttps://t.co/cJulHpXQot — Whale Alert (@whale_alert) May 13, 2024\n\nBesides this, other minor transactions like 7,701 ETH moved in two tranches, and 7,882 ETH were also transferred from Coinbase Institutional to unknown wallets. The impact of these transfers is currently not negative; however, Ethereum's price is yet to reclaim its psychologically important level of $3,000.\n\nAt the time of writing, Ethereum is changing hands for $2,977.23, up 2.20% in 24 hours, per data from CoinMarketCap.\n\nEthereum tipping point\n\nOne of the most important tipping points for Ethereum is slated for later this month, the approval or disapproval of the spot ETH ETF product. At the moment, the approval odds for approval of this spot Ethereum (ETF) product come in at 25%, according to Bloomberg analysts.\n\nEthereum investors might be exercising the necessary caution in order to avoid getting caught up in any bearish fallout from the uncertainty surrounding ETF approval. This largely accounts for why ETH has not traded above the $3,000 price mark since May 10."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOZk16ZzBzdHhsWVhBOGVzak9mZlBrdklVWlB5OXFPdUNJZU9HSjQ1V2ZQLWxVSnFsUVdneWZ3eEZjam1GYjlWWW04cmJzTEhON0hJdjN6OGtUOC1iWm9USlZtQk1DWGkyZUdVekM2azlHM1dnWlByVVRFajd6STQ1ZWdkZ0dTS3ZsWlU4a9IBkgFBVV95cUxPMGJjbTc5eTI2c1BkM2hUdHE5Y1pocVRDQXFFV2c3ZlJ6VXdQbDVOTGZoYWY4Z1JRR0hINXg4LUJjZmlUeEdYMHdmZGRRaDZDanpiN3RvV2xJenZVUTZ1TWRldTZ6aTh3amxleXBpSGxQcEJEMEo0VWF3blZzTDRxa3F4cFAwejJaN3pBdDhtcUxOUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Ethereum Price: What’s Happening With ETH Price Today: May 13, 2024? - CoinGape",
        "content": "Ethereum price has gone through a rollercoaster in the last few weeks as the price has witnessed multiple ups and downs. The second biggest cryptocurrency, Ethereum (ETH), has declined more than 11% in a month, 9.31% in a week, and almost 2% drop in the last 24 hours. So, what’s happening with the Ethereum price? Will there be recovery anytime soon? Let us discuss that in this blog.\n\nEthereum (ETH) Price Analysis\n\nEthereum price has declined continuously in the last few days following the crypto market decline. At the time of writing, ETH is trading at $2,892.53, the lowest value in two months. However, the trading volume has witnessed a 35% upsurge, pushing the value to $8,291,166,546.\n\nadvertisement\n\nIt is because of the current whale interaction on the network which has interfered with the Ethereum holder’s sentiments. As per the Spot On Chain data, a single whale has deposited 4,153 ETH worth $12.2 million ETH tokens on the Coinbase exchange. As a result, Ethereum is in a selling zone where its MACD and exponential moving averages indicate selling pressure on the token.\n\nWill Ethereum Price Recover Anytime Soon?\n\nAs the overall market is down, Bitcoin price has also slipped to $60K from $63K. Seeing a momentary price drop in Ethereum isn’t big. However, a few analysts have spoken of the possibility of ETH prices dropping to the low of $2500.\n\nBenjamin Cowen, a crypto analyst, has been monitoring the ETH price against the BTC and has continuously spoken of Ethereum being bearish for a long now. He believes Ethereum might go down and settle around the April 2021 level of $2500\n\nAlso Read: Top Celebrities Who Don’t Support Crypto Market\n\nETH price has already crossed the key resistance line of $2,910 and is continuing a bearish trend. The next support is at the $2,865 level, and if Ethereum’s price moves down the line, Ethereum might decline to an even lower value of $2,650.\n\nIn contrast, if Ethereum surged to the upper support level of $2,950, the price may go as high as $3,250 in the upcoming days.\n\nFinal Thoughts\n\nEthereum holders’ sentiments are also affected by the upcoming SEC announcement on the Ethereum Spot ETF proposals. After multiple delays, the result will be out by the month’s end, but the possibility of approval keeps declining each day, impacting the Ethereum price. A market reversal with positive results from the SEC is the biggest hope for ETH holders to see the token surge to anywhere near the ATH target of $4,891.70.\n\nRead More Top Crypto Assets Defying Bearish Market Outlook\n\nPooja Khardia With a deep-seated passion for reading and five years of experience in content writing, Pooja is now focused on crafting trending content about cryptocurrency market. As a dedicated crypto journalist, Pooja is constantly seeking out trending topics and informative statistics to create compelling pieces for crypto enthusiasts. Staying abreast of the latest trends and advancements in the field is an integral part of her daily routine, fueling a commitment to delivering timely and insightful coverage\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPOU83YkhGaVYzN0NReFZfY1hKU3l4aC1SOEl1T2V2MHUzSDFxTXBzS3lfN1I0bS1iQjNzWWgzVGlNOVVkTzlVUnotUTFpcjg2UVVIVDNnZVcwcWFlWGdBeVNEbUlVLXB4RmozU1k2RXA3a3FXeFZGdG1ZU1FVUTlvZ05lTlhfOXlybVZUeWFaVjZRQnRuX25ybGhhZGpPZ1RaSnVRWl9Vcjd3U0HSAbABQVVfeXFMT0pCS0h2ZTJ6d1cwdXdOeUFvTUdkU2dEVVZGSlRvMW5KTnJJa3ZYbFd1bnB3MEZPaXFydzNMMTI5dkR3Z0NaQkZwbTZYTHpWVm1rd0lpcExTblhoV2l4WkpySEs1YTZHeWlwY1BPSko2clFzcTNBWExuQmxrT2dKWlpqeXgxNm1KNVhGNmZkdXlVMkFJVUdnRndTZWdqa2J3aWU3aU1DQ1VZcUw2SXdnQTM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Bitcoin Unable to Recover Decisively, Ethereum Consolidates Below $3K (Weekend Watch) - CryptoPotato",
        "content": "The cryptocurrency market has calmed down considerably in the past 24 hours, halting the bearish assault and finding some consolidation in the process.\n\nBitcoin’s price is trading at around $61K on Sunday morning, while Ethereum is now firmly below the pivotal $3K level.\n\nAre the Bitcoin Bulls Regrouping?\n\nAs CryptoPotato reported yesterday, Bitcoin’s price experienced a sudden correction, dropping below $61K and losing around 3.5% in a single day.\n\nThis seemingly had to do with a statement from a representative of the US Federal Reserve, who said that it may be too early to think about rate cuts.\n\nThe market has calmed down since then, and it seems that the worst is behind us.\n\nAlicia Bakery CMO - A really good agency Did you like this market update?\n\nThis is all you need not to miss any price action in the raging crypto markets. Start receiving this recap, for free, every day: Invalid email address Your privacy is guranteed. Thanks for subscribing, you will get your first report in the next hours!\n\nThe bulls even attempted a recovery, but it was quickly halted at around $61.4K when sellers stepped in and pushed the price to $61K, where it currently trades.\n\nIt’s worth noting that despite the recent declines, the Fear and Greed index is still pointing out that the market is in a state of “greed.”\n\nAltcoins Consolidate, Ethereum Below $3K\n\nNone of the major altcoins by means of total market capitalization has recovered from the crash the other day, but at least they are consolidating and charting ever so slight gains, as seen in the heatmap below.\n\nEven though the market seems to be completely painted in green, that’s just the 24-hour heatmap. On a seven-day scale, most of the cryptocurrencies are trading in the red.\n\nIt’s worth noting that Ethereum is now consolidating below the critical psychological level of $3K, and it’s very interesting to see if the buyers will be able to reclaim it soon.\n\nMeanwhile, today’s best performers are Immutable (IMX) – up 4.7%, and Ribbon Finance (RBN) – up 3.3%.\n\nOn the other hand, the cryptocurrencies that performed the worst are Zebec Protocol (ZBC) – down 7.8%, and Kaspa (KAS) – down 4.8%."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQU3ZNR2FjY0trS2gxd2w4QnhHYkZqM0s4OVk1TEkxal9pX2lMUHdNRWEwdGt0X1VERFBMMFZ0ZEJTTWlWbFpLdjBIbWJpdGZNdDdNSkRNNmxHR3g2WU9UWVc2dG9pSzJWRDI2ZnU2WXJYTmFCQ1ZuVFk4YVcyUnByeG5FcmJSY0xPa2Jkak5DZC1HT3p3Y0VwOUJoay1iZEN1Q1F1WUZn0gGrAUFVX3lxTFBmX0pyN0xNMGtvSUsxMzhxNjhXN015bEV4YjN0YzBlN3pBczVuNmNWQmxHcnFFZnhNQlNjWW9UNDQyYWZBSlV6eEo0RW8xYjRwNnNuV1I4LV9ZbTJWeEVmUF9nVWFheXByVHlKLWFrN0hRN1Z3Y1FqN3JDUFIzT2dpSmt1VzZrdWpyckxUbDhEenNqMWhVOE1jaEdEbU1MZF84dE5uTG9NdXNrRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Is Ethereum About to Resume the Uptrend and Break Above $3K? (ETH Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has been following Bitcoin, dropping lower since the beginning of March. Yet, things might be about to change soon.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily timeframe, the price has been making constant lower highs and lows inside a descending channel pattern. Yet, with the 200-day moving average and the $2,750 support level nearby, the market seems likely to rebound soon. Currently, the price is approaching the $3,000 resistance level.\n\nA bullish breakout above this level would be a probable scenario and could lead to a rise toward the higher boundary of the channel and the $3,600 resistance zone.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour chart, the price has been hovering around the $3,000 level over the recent weeks. Yet, the market has broken a bearish trendline to the upside. If the price keeps above the trendline and breaks through the $3,000 level, a rally toward the higher boundary of the channel will become more likely.\n\nWith the RSI approaching 50%, it seems that the market momentum is in equilibrium, but the short-term fate can be decided as soon as today.\n\nSentiment Analysis\n\nBy TradingRage\n\nTaker Buy Sell Ratio (30-Day SMA)\n\nThe perpetual futures market has been one of the key driving factors for crypto prices over the recent years. Therefore, analyzing this market’s metrics can provide useful information for anticipating future price movements.\n\nThis chart displays the 30-day moving average of the Taker Buy Sell Ratio, which measures whether the buyers or sellers are executing more market orders on aggregate. As market orders are the ones moving the price, this metric can provide crucial insight.\n\nThe Taker Buy Sell Ratio has been trending below 1 over the last few months, indicating that most futures traders have been selling BTC aggressively. This can either be for speculation or hedging spot portfolios. Yet, the metric is showing sings of recovery at the moment, and its rise could lead to a market rally as the aggressive supply would shrink. Therefore, with enough demand from the spot market, a new uptrend could begin soon."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPTUV2dmJ2eXhvY3BvQzZUTlBMZFI5RktPcDV1Q2pCLXloaGdCeHZ2RjJqeml6cmdkY3ExV2ZQWDRDdzFYaUY4U21RVlJHTWtJMllGbjhLei1lSUszNmlwS25kcTFoTmdRQ2RQR2JFNlRmMElDRG5zZmNMamtRXzczelJKVThOUEtFSTltSm5pOVFLMGx2WmJiWtIBngFBVV95cUxOR0NhNGRmaHVCUXR5SHcwQlNFZ2JDRDRxWXFtR0M4RDMyTGNEOXNLa1QyWnMxZWlub3o4Si1XcHExUkhSTHQtOUllMmJjTFZ2VlY3eU9MaTFxUHFobmFFWEhWUkNuUUdPb3dZa0tXUXpXUXllR2JTc3liS0JuV0FGTVE0bFBxaHhPUzdEdEZrcUFsalJld1NXQXhxcThNQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Parity Wallet Hacker Moves $9 Million in Ethereum, Leaving $246 Million in Limbo - U.Today",
        "content": "In a development echoing one of the largest crypto heists in history, Cyvers Alerts has reported that a hacker, who exploited a vulnerability in Parity's multi-signature wallet in 2017, has now moved a substantial sum of Ethereum (ETH). The hacker, responsible for the theft of 150,000 ETH, valued at $30 million at the time, has initiated the laundering of a portion of their loot, transferring 3,050 ETH, equivalent to $9 million, through the eXch platform.\n\nAdvertisement\n\nThis marks a significant chapter in the saga, underscoring the enduring impact of cyber breaches in the digital asset realm. Cyvers Alerts took to X to highlight the unfolding events, reminding followers of the 2017 incident that shook the crypto community. The vulnerability in Parity's Multisig Wallet version 1.5+ had allowed the perpetrator to abscond with a staggering amount of Ethereum , causing substantial financial losses.\n\n🚨ALERT🚨 In 2017, a vulnerability in Parity Multisig Wallet version 1.5+ led to the theft of over 150K ETH, valued at approximately $30M USD at the time.\n\n\n\nThe hacker behind this theft has demonstrated remarkable patience, marking a significant chapter in crypto history. Today,… pic.twitter.com/JPD5nJcmrJ — 🚨 Cyvers Alerts 🚨 (@CyversAlerts) May 13, 2024\n\nThe latest maneuver by the hacker underscores a strategic and patient approach to their illicit activities. By utilizing eXch and consolidating multiple addresses under \"0x5167052b,\" they have successfully laundered a portion of the stolen funds. However, what's more concerning is the sizable sum still under their control. With 83,017 ETH, valued at a staggering $246.6 million, remaining untouched at the primary address \"0xb3764761,\" the hacker retains significant leverage within the cryptocurrency ecosystem.\n\nAdvertisement\n\nOngoing threat\n\nThis recent activity reignites discussions surrounding security measures within the crypto space and the persistent threat posed by vulnerabilities in blockchain platforms. Despite efforts to enhance security protocols and mitigate risks, incidents like the Parity Wallet breach are stark reminders of the ever-present danger of cyber attacks .\n\nAs stakeholders assess the implications of this latest development, attention turns to broader implications for investor confidence and regulatory oversight within the crypto market. The ability of hackers to exploit weaknesses in infrastructure and maneuver substantial sums of digital assets shows the need for continued vigilance and collaboration within the industry to safeguard against such threats."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPUUdTTHNXRHFkNnhhcllkUjRTNWtrejJkbW1ZampzZVM2U0JkT3VjVERxMDIwZ0FOSm0tV2J4Tkk1bTQ1VVR2UE5hWTRHU29SV1piNjNCN3RwUGYwTHV4NVdDLURhUVZVQnl6Uk5ILVVYemlackNOQ25ZQW45TUlKOVNwN01GWnJveVlpZ0pLNEFXU0ZxdHFHNTBR0gGfAUFVX3lxTE5CaFFTdnNYdmE4LVFra0V6LVVzS291V28tY2tOcVNQNjdVTkU3SWhHZ1hBLUtORTdWZzcwRXNNT3o5Ym5lYnJtOHQxVFQxSFpxVFRVVXkyeFV3YmxWdUI5VnhtZjZHaVlRWDNhUThDRU1uSWt6dUhQdGh0Vk9DWm5IME1jNFJmY185UHFpZHR3MXZFMEVmcmN1U3pzazZ2TQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Will ETF Uncertainty Push $ETH Below $2700? - CoinGape",
        "content": "Ethereum Price Analysis: Ethereum, the second-largest cryptocurrency by market cap is up $0.82 to trade at $2935 currently. This uptick signals another reversal from the support region around $2875-$2850, projecting a fourth reversal within a month. This active demand zone has prevented a prolonged correction in Ethereum and shifted the price trend sideways. How far will this consolidation continue?\n\nAlso Read: Ethereum Whale Liquidates ETH Portfolio At $6.5M Loss, Price Dip Ahead?\n\nadvertisement\n\nEthereum Price Analysis: Is ETH Price Ready to Hit $4100?\n\nThe Ethereum price has traded sideways for nearly a month, resonating within two horizontal levels of $3300 and $2850. The coin price rebounded several times from both these levels indicating indecision among market participants.\n\nHowever, if the consolidation continues, the ETH price hits the downsloping trendline of a falling wedge pattern which has carried the current correction trend for over two months.\n\nIf the overhead supply at this resistance is intact, the potential retest will accelerate supply liquidity in the market, bolstering Ether for prolonged downfall. The bearish thesis will get better traction if sellers break $2850 support.\n\nThe potential breakdown will plunge the Ethereum price to $2700, followed by $2600.\n\nFurthermore, in a recent Twitter conversation, Eric Balchunas, a senior ETF analyst for Bloomberg, responded to developments regarding the ARK Invest/21Shares application to remove staking from its Ethereum (ETH) spot ETF. Balchunas noted that while this adjustment might appear to be aligning the ETF proposal more closely with SEC guidelines—a potentially positive sign—there has not been any specific feedback from the SEC yet.\n\nHmmmm. Interesting. While it may seem like this is them getting their docs in shape based on SEC comments (which would be good news) there hasn’t been any comments. So its prob either a Hail Mary or maybe trying to give SEC one less thing to use in their rejection. Not sure (yet) https://t.co/CeQwj5ktPn — Eric Balchunas (@EricBalchunas) May 10, 2024\n\nHe expressed uncertainty about whether this change was a strategic move to avoid potential grounds for rejection by the SEC or simply a last-ditch effort to gain approval, describing the situation as either “a Hail Mary or maybe trying to give SEC one less thing to use in their rejection.”\n\nAs the market is uncertain about the approval of U.S Sec for ETH ETFs, the technical analysis hints a breakout above the wedge pattern could spark recovery sentiment.\n\nA potential breakout from the overhead trendline will accelerate the bullish momentum and lead a recovery rally to $4100.\n\nTechnical Indicator\n\nBB Indicator: The ETH price pressuring the lower boundary of Bollinger Band on the downside indicates the selling pressure is active.\n\nMoving Average Convergence Divergence: Multiple crossovers between the MACD (blue) and signal (orange) lines accentuate the uncertain market sentiment.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxPR0JWLVBSTG1WR0t5bm82WUxkTE5Raktja09UVURsOHhfNnlpeGJVb3lOcXVta3hpY29sOWEtMTNJZnNTbFRZQTBYdFFqTnZkNUFCR0tpc2huYUpqcEl0VnRLQWFsQ1VFVm1Wa1ZDcS1JSndVWHF2Mm1VZl9TUDZzMnkzQURJOWV1bnlpTVBfRnVVXzVfODJ3NVR2SDZkZTFBbGIyekVuSllMQzhNbF9RaDdpRGRLa25QUGFobmdLYjhfRTNXRXdiTVB1bGlwdlY4Q2VLQktCUnBkNUFtYjB0bncyYnM3UlVtSE5z0gHwAUFVX3lxTFBKTk9ZczNqTXpUREJFMF9rM1Z6RThCVXBjN0lJZlJ0dXFIeUUwSWpzSDBaOHhabjNSSS1lQzJ5UXUyb1RuUzlOV3ZlXzdTb0QxVkMtaEIzaTdmLWg1aEJJZjlVRGlPZ0s4ZGRYM3VRVDQtNVZ6VG1EMl9qWmhUQlZyTm9WU3pwbDhJVlJjUlM3dWp5aXVhdmh1dkJ5VGFyeXgxRm9OeWZwaWh6THRzUmFneGVDOGRtMEVNWDFrZHQ0amFZMEM1aHBONFpFSkRVXzNyYU1XNUFrNE9CSk5HckNJQ3VRNFhielRESWxabGw1ZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Altcoins thresh as BTC conceals directional bias - FXStreet",
        "content": "Bitcoin price could reverse current market structure if bulls manage a stable candlestick close above $65,500.\n\nEthereum price’s 26% upside potential under threat as ETH tests $2,900 support.\n\nXRP provides another buying opportunity at $0.50 as Ripple price plunges almost 10% in a week.\n\nBitcoin (BTC) price continues to conceal its hand on higher time frames with the stance compelling altcoins to pick a side. Altcoins with bullish fundamentals continue to show short-term strength, whereas those devoid of any continue to bleed. The fate of altcoins hinges on BTC with a show of stability likely to kickstart a rally for Ethereum (ETH) and Ripple (XRP) prices.\n\nAlso Read: Crypto market eyes a bullish turnaround\n\nBitcoin price attempts market structure reversal\n\nBitcoin price is trading with a bullish bias on the H4 time frame, consolidating along an ascending trendline. The Relative Strength Index (RSI) has managed a few higher highs, suggesting a growing bullish trend.\n\nHowever, for the current market structure to change, the bulls must manage to push BTC beyond $65,500 and maintain a stable candlestick above it on the four-hour chart. Such a move would pave the way for an extension to the $72,797 threshold, beyond which the $73,777 all-time high would be ripe for retaking.\n\nBTC/USDT 4-hour chart\n\nConversely, if the bears have their way, Bitcoin price could drop, slipping below the support confluence between the ascending trendline and the horizontal line at $60,630. In a dire case where BTC rolls below the $60,000 psychological level, it would trigger panic selling. This could send Bitcoin price all the way to the $56,552 support level before a potential recovery.\n\nAlso Read: Bitcoin price attempts recovery after weeklong downtrend as mainland China wants in on Hong Kong spot BTC ETF\n\nEthereum price’s 26% target objective could fall through\n\nEthereum price consolidation within a falling wedge pattern continues as the bullish reversal technical formation signals a possible 26% target objective. However, with BTC concealing its directional bias, this potential weakens.\n\nNotably, Ethereum price has slipped below the ascending trendline, worsened by the equal lows on the RSI. If the RSI support breaks, ETH could fall through, recording a lower low and extending the downtrend below the $2,900 threshold.\n\nETH/USDT 1-day chart\n\nOn the other hand, enhanced buyer momentum above current levels could see Ethereum price break above the $3,212 resistance level. A stable close above this level on the one-day time frame would activate the breakout, potentially sending ETH 26% north to $4,083.\n\nAlso Read: Ethereum could see slight increase, institutional whales make hefty deposits on Coinbase.\n\nXRP bulls have another buying opportunity\n\nRipple price has tested the 50% Fibonacci placeholder for yet another time. But not all hope is lost as XRP tests the support due to the 50% Fibonacci placeholder at $0.4952. If this support level holds, the XRP price could climb 12% to take back the $0.5703 resistance level.\n\nXRP/USDT 1-day chart\n\nConversely, if the $0.4952 support breaks, Ripple price could extend the fall to $0.4500, or in a dire case extend a leg south to $0.4188, levels last tested on April 13.\n\nAlso Read: SEC vs. Ripple lawsuit update: All related parties to file letters to seal motions and evidence"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE54Y25PWGpvQ2o0ZXJBd1VBQzhIUW5USEdTcWlFN2FZRUlFSk9ocWxzYUIwQ2lrVXVkSmR0TWNFVFNhOEVyVGQ2RDFIVkhRQkJWNHZMLXVIN1FjdUp1akV4bVJnVEU0dWIzN2oxZF9BWU9aVUtWMThfSm1mTUZYZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Bitcoin Navigates 0.65% Gain in Danger Zone, Ethereum Drops 0.25% Amid Market Pressures, Furrever Token Launches $20,000 Competition to Boost Presale - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, May 13, 2024 (GLOBE NEWSWIRE) --\n\n\n\nIn the ever-changing landscape of the cryptocurrency market, major tokens such as Bitcoin and Ethereum are undergoing significant fluctuations, presenting both challenges and opportunities for investors. Amidst this dynamic environment, the Furrever Token (FURR) emerges with an innovative marketing strategy aimed at attracting Bitcoin and Ethereum holders, further diversifying the crypto ecosystem with its unique thematic focus and competitive initiatives.\n\nNavigating Bitcoin's \"Danger Zone\": Market Dynamics and Speculations\n\nBitcoin (BTC) has been experiencing considerable volatility, currently trading at approximately $61,229.50, marking a slight increase of 0.65% from the previous day. This instability is particularly evident as BTC recently tested the critical $60,000 support level, a move that has heightened caution among investors. This phase is often described as the \"danger zone,\" a term used to denote the turbulent period following Bitcoin's halving events.\n\nDuring trading on May 10, Bitcoin's price momentarily dipped to an intraday low of $60,190 on Bitstamp, down from attempts to stabilize around $63,000. This sudden decrease has sparked widespread speculation among traders and analysts. Many believe that large-volume institutional actions, coupled with the temporary closure of the BTC ETF market, might have driven the drop.\n\nDespite this recent dip, market experts like Rekt Capital remain optimistic, suggesting that the end of this challenging \"danger zone\" could be in sight. Historically, such periods have been marked by sharp downturns followed by eventual stabilizations. The current market scenario of BTC demonstrates the complex interplay between market sentiment and institutional influences, which continues to dictate the cryptocurrency's price movements. As Bitcoin navigates through these fluctuations, the broader crypto community watches closely, anticipating the cryptocurrency's next moves in this unpredictable market landscape.\n\nEthereum Faces Market Headwinds and Analyst Scrutiny\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, has recently been trading at $2,927.63, marking a slight decrease of 0.25% from the previous day. This modest drop is part of a broader trend of challenges that have caught the attention of investors and analysts alike.\n\nA significant event stirring the market was a major sell-off by an Ethereum whale who liquidated 6,714 ETH at a price of $2,903 each, culminating in a loss of approximately $6.5 million. This large-scale transaction has intensified concerns over Ethereum's future price direction. Market indicators are not promising, with the Relative Strength Index (RSI) showing a decrease in investor interest and key averages indicating a bearish outlook.\n\nStory continues\n\nDespite Ethereum's substantial trading volume of $10.1 billion over the last 24 hours, the price has declined by 4.07%, fluctuating between $2,935.95 and $2,894.15. Analysts have pinpointed the $3,017 level as a crucial resistance point; surpassing this could potentially shift the momentum to a bullish trend and help Ethereum break out of its current descending channel pattern.\n\nHowever, several factors are complicating this outlook. The cryptocurrency has been in a descending channel since mid-March, and the delayed approval of a Spot Ethereum ETF by the U.S. Securities and Exchange Commission (SEC) has added to the bearish sentiment. Moreover, the recent Dencun hard fork, which was intended to enhance Ethereum's scalability, did not have the expected positive impact on its price, leading to further speculation about its effectiveness and future impact on Ethereum's market performance.\n\nThese developments paint a complex picture for Ethereum as it navigates through ongoing market challenges and investor scrutiny.\n\n\n\n\n\nFurrever Token Launches $20,000 Competition to Attract Bitcoin and Ethereum Investors\n\nThe Furrever Token (FURR) has introduced an exciting $20,000 competition, targeting holders of Bitcoin (BTC) and Ethereum (ETH) to diversify into its presale phase, which prominently features cat-themed imagery and an engaging, playful ecosystem. Operating on the BNB-20 blockchain, Furrever Token is currently offering 65% of its approximately 9 billion token supply to early investors, signaling a strong start with over $1 million raised in just two months.\n\nAs the presale progresses, Furrever Token continues to captivate the community's interest, with its current price set at a modest $0.000648. A notable aspect of this token is its absence of buy and sell taxes, which enhances its accessibility and affordability, appealing especially to new entrants in the cryptocurrency market.\n\nThe centerpiece of Furrever Token's promotional activities is the \"Furrever Token $20,000 Highest Total Buys Competition.\" This contest is designed to spur enthusiasm and investment by rewarding the top 10 participants who purchase the most FURR tokens during an 18-day period from May 9, 2024, at 17:00 UTC, to May 27, 2024, at 12:00 UTC. The top purchaser will be awarded $5,000, with descending prize amounts for the other top buyers.\n\nThis initiative not only underscores Furrever Token's commitment to building a robust and engaged community but also positions the token as a potentially lucrative opportunity for investors in major cryptocurrencies like BTC and ETH, looking to leverage their holdings into new and promising digital assets.\n\nFor further information or any assistance regarding Furrever Token, reach out only through the official channel at support@furrevertoken.com to avoid potential scams.\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nJoin $20,000 Furrever Token Giveaway\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPLUt1ekpSMW8zWGc4RDhoY1drVVZnTDlDd2QzN2ZDZ1Z5a0hYWGtJWG02V2tRZkpnT0NYYkVSNDNPREZVRWs3VUVweEtUdTB2YS1nVEpQOVg4UFBaWWRvT0Q1RFBlTzVEeEtEbnVjZFVTNXdGbllKQTNyZEs2RHNQWjdIbV9iWU9yM18yNFhhSE5ReFFK0gGaAUFVX3lxTE9UTXd1UDBHb0huUTU3RG41YWJjOHZUcnBqcTNaYmVhcnlKeWZQZjN1U0JUVXppUXlVS1BHRDNNWFFxM1ZwTUhsR21sejk0bkM1bFcta25KRGJGb3ppOEhmSW5yNEw5ZUVfN1dpSDhFSEoyWDdWdnFzRFNxNDhyUXdzRE01QTJ3bTdtVnhVSUN3MHRNdy1xVC05RXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum: Two levels where a swing trade could be profitable - AMBCrypto News",
        "content": "Ethereum has a slightly more bullish bias for the coming week.\n\nThe Bitcoin consolidation phase was still ongoing, and a revisit to $60k was growing more likely.\n\nBitcoin [BTC] traders were going through a relatively tough period after the easy, straightforward rallies that have been the norm since last October.\n\nEthereum [ETH] has been more complicated, but BTC’s halving event last month has changed the market conditions to chop and range formations all over the market.\n\nAMBCrypto investigated what the market sentiment was looking like over the weekend, and where this week’s price action could go.\n\nOne of the two has speculators expectant of bullish returns in the near term\n\nThe 10th of May saw an increase in the Bitcoin Open Interest, but the OI has been trending downward since the price spike on the 6th of May.\n\nMeanwhile, the price also formed a series of lower highs over the past week, descending from $64k to $61.1k at press time.\n\nThe Funding Rate was negative at the start of May when Bitcoin plummeted to $56k. Since then, the Funding Rate has recovered.\n\nHowever, in the past few days, it has been barely above zero, which indicated the sentiment was not strongly bullish.\n\nEthereum also saw Funding Rates slip into the negative territory in early May but has since recovered. The past week’s downtrend saw the funding rate hover around the baseline +0.01 mark.\n\nA slight bounce from $2980 to $3040 on the 9th of May saw the Open Interest and the funding rate jump higher.\n\nThis did not repeat with Bitcoin despite a similar price bounce, which suggested that speculators were more eager to long ETH than BTC.\n\nWhat are the next liquidity pockets that could attract prices?\n\nThe 7-day liquidation heatmap of Bitcoin showed a bright cluster of liquidations at the $60k area. To the north, $61.8k and $63k are the next bullish targets.\n\nOn the 5th of May, we saw prices jump above the $64k mark to collect liquidity before a brutal short-term reversal.\n\nSimilarly, we might see a downward plunge on Monday to collect the liquidity at $60k before rebounding higher. Hence, BTC traders would want to buy the dip to the $50.6k-$60k region.\n\nHowever, traders must also be prepared for a move below $59.4k for BTC, and set their stop-losses accordingly in the event of a dip to $60k.\n\nRead Bitcoin’s [BTC] Price Prediction 2024-25\n\nOn the other hand, Ethereum has a cluster of liquidity nearby to the north at $2950. This was close to the current market price of $2928. A dip to the $2860 region would likely present a buying opportunity.\n\nThe liquidation levels around the $3.1k-$3.2k area present an attractive target. A drop below $2.8k would likely herald a strong short-term downtrend, and traders can cut their losses in this scenario."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNNW5md1VTbDUtMXFWdnh1UzhsaTBKeEZaMFBHYXh3YWl3RWFQZzFrVi1tcDQyU2ltLUh3SnByRl9FMzh0VmFwX1V2UGlMNmFERVktWkwtLWZPcTZpc2lvZWhpX0tVZXJoa1psZW0tWnVoYnBuMFpGaGM4dHBwdGs2SGFyMmVjc202bWhQNdIBkgFBVV95cUxOVFlJbTR2aUR6ajVLS0taaU9FUHoxOUhpVnBGTElSTVFiSHdhNTBCcTlFTDFSd3hjUlhuZDl0SnZ1RXRqRDVMRHZ6ZGdYdWxuVUY2NjM2SmhMT0lBZzdadk04VHlpVzE0Sm1FeXZhRUFadGRFbzJqYXBlTGE0SFYtN3IyX3hnNXZydmkxb2ZORWNmdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 May 2024 15:36:14 GMT",
        "title": "Gas Gone Cheap! Ethereum Fees Plunge 93% To Rock Bottom Prices - Bitcoinist",
        "content": "Ethereum users are rejoicing over a dramatic drop in gas fees, with the network experiencing its lowest point since early 2020. This translates into significantly cheaper transactions, making the platform more accessible for everyday users and developers. However, experts caution that this fee fiesta might be temporary, raising questions about the long-term health of the network.\n\nEthereum Gas Prices Hit Rock Bottom\n\nData from from BitInfoCharts shows intraday gas fees dropping 93% from the peak of $30 just six months ago. This translates to a significant cost reduction for various activities on the Ethereum blockchain. Simple asset swaps now cost around $5, while minting NFTs has become a much more affordable endeavor at roughly $9.\n\nThis newfound affordability is attributed to a confluence of factors. The recent Cancun-Deneb upgrade is believed to have played a role in optimizing network efficiency. Additionally, a general downturn in network activity coincides with a calmer period in the broader cryptocurrency market.\n\nA Boon For Users, But A Challenge For Miners\n\nWhile users are celebrating the lower fees, concerns linger about the long-term sustainability of this trend. The near-zero “blob fee” suggests a lack of demand for block space, raising the specter of future congestion and fee spikes. Additionally, lower fees could negatively impact the profitability of miners who secure the Ethereum network.\n\nAccording to analysts, this situation is a double-edged sword. While lower fees are great for users, they could make it more economical for large players to dominate block space, hindering decentralization.\n\nEthereum is now trading at $2927. Chart: TradingView\n\nThe Quest For Scalability: Enter Multi-Dimensional Gas\n\nThe recent gas fee developments highlight the ongoing struggle to optimize Ethereum’s scalability and affordability. In response to these challenges, Vitalik Buterin, the platform’s founder, has proposed a significant upgrade introducing the concept of “multi-dimensional gas.”\n\nThis upgrade aims to provide Ethereum with greater flexibility in managing various resources. By taking a more nuanced approach to resource allocation, the network could potentially improve transaction throughput without compromising security.\n\nA Look Ahead: Will Ethereum Maintain Its Momentum?\n\nThe dramatic drop in gas fees serves as a welcome respite for Ethereum users. However, the long-term viability of these low fees remains uncertain. The network’s ability to handle future surges in demand and maintain a healthy balance between user experience, miner profitability, and decentralization will be crucial for its continued success.\n\nThe proposed multi-dimensional gas mechanism embodies the ongoing efforts to address these challenges. As the Ethereum ecosystem continues to evolve, its ability to adapt and innovate will determine its position in the ever-changing landscape of blockchain technology.\n\nFeatured image from AutoDeal, chart from TradingView"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOTTJaRzBoNEhQNUp6cWxPZHI0Y2w2RktnN0hPamRxQnNzSkMwRDRWbVMxbnVOR3hNQnJWd2NHSzI0RmFES0R6OXJNeTR1S1E4cE1TRXJMZUhVX2E4ZEFEUzQtN3pRbXJYU0xIMTVkcS1WTUQ4RzZDd1BmWWRWTFlKcG80aDBqQmh5TEdBQ3Qxb3poWnBIQlF3YVU2SXJKT1FaZFh6ZzI0UGlPQmZxSGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum dethroned by Solana in terms of decentralized exchange volume - Cointribune EN",
        "content": "Mon 13 May 2024 ▪ 3 min read ▪ by Ariela R.\n\nIn the ever-evolving world of cryptocurrencies, the order of platform supremacy seems established. But the emergence of new players is challenging this current order. This is the case for Solana (SOL), which has just overtaken Ethereum (ETH) in terms of DEX volume.\n\nSolana Surpasses Ethereum in Decentralized Exchange Volume https://t.co/JMiP2HmQL8\n\n\n\nFollow us and stay up to date with the latest developments for #Bitcoin #Ethereum #Ripple #cryptomarket #cryptocurrencynews — COINTURK NEWS (@Cointurknews) May 10, 2024 Crypto: Solana surpasses Ethereum in decentralized exchange volume\n\nSolana overtakes Ethereum in terms of DEX trading volume\n\nLaunched in 2020, the cryptocurrency platform Solana stands out for its transaction speed and low fees. This makes it particularly attractive to DeFi users. This crypto blockchain has experienced exponential growth in recent months, attracting many investors and developers.\n\nAccording to recent data, DEX trading volume on Solana has reached $1.3 billion. For the first time, this volume exceeds that of Ethereum, which is at $1.29 billion. This remarkable performance marks a turning point in the competition between the two crypto platforms. It indicates the potential of Solana to emerge as a promising alternative to Ethereum.\n\nSolana: a crypto ecosystem in full expansion\n\nIn addition to the DEX trading volume of Solana, its transaction fees have also increased. These have reached 50% of the fees generated on the Ethereum crypto network lately. Analysts also predict that soon, transaction fees on the Solana network could surpass those of Ethereum.\n\nSpeaking of increases, the price of SOL has also seen a rise of over 6% in 24 hours. This situation propels Solana to the rank of the most performing altcoins in the crypto market.\n\nA new order is emerging in the world of cryptocurrencies\n\nSolana’s surpassing of Ethereum in DEX trading volume is a strong signal of its potential to become a major player in the DeFi space. Its speed, negligible fees, rapidly expanding ecosystem, and innovative technology make Solana an attractive alternative for users and developers.\n\nAlthough Ethereum maintains its dominance in terms of market capitalization, Solana is now positioning itself as a serious contender, ready to shake up the established crypto order.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPZzNaTks2VHJzTFNtU1hWd2I0cXd0V28taW9wLVpYLWw1b2hKN2w5NUhhQVpXbGxJZ0p6ck5ucEZqUXBzckpNRUhKWDdyWGNPQ3RMbDQtNEpnYVJhT0VXZ01iVXhhRHY0aEFzSmltcVpEZEl3Z2xaMWNtTUNsMXd6RUFzNmp0S3VpNGVXZUJycTAzR2NMY0xfSEt5UGVpRGtwV2tj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 May 2024 07:00:00 GMT",
        "title": "Bitcoin or Ethereum? We asked ChatGPT which asset is a better buy for summer 2024 - Finbold - Finance in Bold",
        "content": "As summer 2024 approaches, the debate intensifies between Bitcoin (BTC) and Ethereum (ETH), two major players in the cryptocurrency market. Bitcoin is increasingly viewed as a digital gold, offering stability in times of economic uncertainty.\n\nThis perception is supported by its reduced volatility post-halving, now lower than that of many S&P 500 companies, according to Fidelity.\n\nEthereum continues to push the envelope with technological innovations like the recent Dencun upgrade, which aims to cut fees and enhance scalability. However, these changes have brought back inflationary aspects, moving away from the deflationary trend set by the 2022 Merge.\n\nThis has led to heightened volatility, with Ethereum’s implied volatility remaining significantly higher than Bitcoin’s despite the overall market calming.\n\nWith their divergent roles in investment portfolios—Bitcoin as a burgeoning digital asset and Ethereum as a technological pioneer—Finbold sought insights from ChatGPT, OpenAI’s advanced AI model, to determine which might excel in the coming months.\n\nThis analysis highlights the need to evaluate Bitcoin’s appeal as a growing store of value against Ethereum’s progressive platform in a rapidly changing market landscape.\n\nChatGPT’s analysis: Bitcoin vs. Ethereum investment prospects\n\nAccording to ChatGPT, the decision largely depends on individual investment strategies and risk tolerance. Bitcoin is generally better suited for investors seeking stability and a relatively safe store of value, akin to digital gold, especially amidst economic uncertainties. It appeals to risk-averse individuals or those new to cryptocurrencies.\n\nChatGPT Bitcoin investment prospects. Source: Finbold and ChatGPT\n\n\n\nConversely, Ethereum fuels a platform for decentralized applications and is a major player in blockchain technology. Investors who believe in the future of these technologies may prefer Ethereum.\n\nChatGPT Ethereum investment prospects. Source: Finbold and ChatGPT\n\n\n\n\n\nWhile Bitcoin offers stability and potential for incremental growth, Ethereum provides a gateway to a rapidly evolving blockchain ecosystem with higher risk and potentially higher rewards.\n\nUltimately, diversification with both BTC and ETH can be a way to manage risk and potentially benefit from the growth of both major cryptocurrencies.\n\nBitcoin and ETH recent price performance\n\nBitcoin and Ethereum price chart. Source: TradingView\n\n\n\nAs of 2024, the year-to-date performance of Bitcoin and ETH presents a clear contrast in investment returns. Bitcoin has seen a significant rise, with a YTD increase of 45.16%, showcasing its volatile yet high-growth nature. The current price of Bitcoin stands at approximately $61,200.\n\nOn the other hand, ETH has gained 28% YTD, with its current price at about $2,921.\n\nThe choice between Bitcoin and Ethereum should align with individual investment goals, risk tolerance, and interest in the technological aspects of cryptocurrencies.\n\nWhile Bitcoin offers stability and potential for incremental growth, Ethereum provides a gateway to a rapidly evolving blockchain ecosystem with higher risk and potentially higher rewards.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPN0laTEMyV2dCUFBESk5RSVF2SU1waUduM3JhQ1RlVzhWbEtUZVpTdEc0ZEI3Qy1GTXZMNGVCelYzbWdKOW5sTTBqclBBZ0NqWkZoQWxuT2p4QzRUSldXdzRta0NZMnVKMnlLaUhObk1udlp0dEt4YzY5VDRYLXZ4V24wRDRUam56ejloaklib2dZODUyV1ZSVGFWNlFsWjdlU2FMaUhNQm9uSkHSAbABQVVfeXFMUEZKSmtBcGtnaTNMU1AwVFhRUXdqQm9fSmxleUpLbGcxeFJzVWFOUWNhU25aY1NfVERuQ2ZzSkkwX3ZPdGVPRmhka1hiZ2FHYzFUbEdnN2d5RVlmMldHQWx6aTFmQ1llc0VKSG5VaEdZT2VOWFo3TFdnME1ESW9qTnRmX1VqRWV3SEtEUzM2cnYtVkh4MUpaS0lpenhMalZoSHVwZm9GLVJjbDduMWxQV2g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Ancient Whale Moves Millions in Ethereum to Coinbase: Is This the End of the Crypto Boom? - Coinpedia Fintech News",
        "content": "Mustafa has been writing about Blockchain and crypto since many years. He has previous trading experience and has been working in the Fintech industry since 2017.\n\nAncient Whale Moves Millions in Ethereum to Coinbase: Is This the End of the Crypto Boom?\n\nStory Highlights Ancient wallets from 2016 bought Ethereum at $11 per coin, now transferred millions to Coinbase.\n\nLarge-scale ETH transfers to exchanges spark concerns about market sentiment and sell-offs.\n\nDormant Bitcoin wallets moved 687.33 BTC, worth $43.89 million, after over 10 years.\n\nEthereum (ETH) is making waves in the crypto seas as ancient whale wallets migrate to Coinbase, causing ripples of volatility and sparking concerns among investors about a potential market shake-up.\n\nHere’s everything that there is to know.\n\nEarly Investors, Big Moves\n\nDiving into Ethereum’s history uncovers stories of early investors who snagged their ETH at remarkably low prices. One such tale revolves around a whale that first entered the scene in 2016, scooping up a massive 12,427 ETH from Poloniex at just $11 per coin.\n\nFast forward to today, and this ancient behemoth has made a splash by depositing 4,153 ETH into Coinbase, now valued at a hefty $12.17 million.\n\n8-year old whale made a move again.\n\n\n\n3 hours ago, the whale 0x2cE deposited 4,153 $ETH (~$12.17M) to #Coinbase.\n\n\n\n8 years ago, he accumulated 12,427 $ETH from #Poloniex at avg entry $11.\n\n\n\nHis wallet:https://t.co/rgBtQ6R1RUhttps://t.co/kx6zfjxZ59 pic.twitter.com/WMUGfI20fd — The Data Nerd (@OnchainDataNerd) May 13, 2024\n\nThe motives behind these whale-sized transactions are clear. With the current market price of ETH hovering around $2,984 per coin, these early investors are eyeing profits that would make even seasoned traders envious. A staggering surge in value, amounting to an impressive 27,027.27%, underscores the bountiful rewards reaped by those who took the plunge into Ethereum’s depths when it was still in its infancy.\n\nA Tale of Two Whales\n\nBut the Ethereum saga doesn’t end there. Another ancient whale recently made waves by transferring 614 ETH to Kraken. Having initially snagged these coins five years ago at an average price of $195 per coin, this investor’s haul is now valued at a staggering $1.79 million. And yet, this is just the tip of the iceberg, as they still hold a formidable 1,329 ETH, valued at almost $4 million, in their digital treasure trove.\n\n3 hours ago, a whale 0x06E just deposited 614 $ETH (~$1.79M) to #Kraken.\n\n\n\nThose $ETH was bought 5 years ago with avg entry $195.\n\n\n\nJust now, he still has 1,329 $ETH (~$3.9M) in his wallet.\n\n\n\nHis address:https://t.co/Odin18efJK pic.twitter.com/Uie9gipeJJ — The Data Nerd (@OnchainDataNerd) May 12, 2024\n\nWhale Watch: Signals of a Market Shift\n\nOn the flip side Whale Alert, a popular cryptocurrency tracker, has also reported multiple transactions where unidentified whales transferred large quantities of ETH to Coinbase. These transactions, including 30,020 ETH, 11,192 ETH, and 11,207 ETH, are collectively valued at tens of millions of dollars.\n\nThese activities suggest the possibility of a sell-off by major holders who are capitalizing on Ethereum’s recent price surge.\n\nAwakening Ancient Bitcoin Giants\n\nFurthermore, in addition to the Ethereum activity, Coinpedia previously reported the awakening of ancient Bitcoin wallets that had been dormant for 10.3 years. These wallets recently transferred a substantial 687.33 BTC to two undisclosed wallets, with a total value of $43.89 million.\n\nThe sudden awakening of ancient wallets and the movement of substantial ETH holdings to exchanges signal a potential shift in the cryptocurrency market, hinting at upcoming sell-offs as part of profit-taking.\n\nAlso Check Out: Ethereum Price at Risk as Critical ETF Decision Approaches: What Next For ETH Price?\n\nAre you worried about a potential sell-off? How are you adjusting your crypto strategy?"
    }
]