[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOSWlMeGVNZFZLZDl5SThZcENLcndYM0VUTzV4ODB5dzFMQi1CZ05zamIwNkF1aTBuTU94TERxeWJGYUl4N01BT2RqcHZ5N0s3WnNtRjVRQWl5Wl9jZG5KOHotVWx2N082azlNblk1S1BiSU5udFdFUkQtUWx0WVlrdWpyRVB0YTQ5TG4yZG1FbW1DZzJpaE1jYkltaGtqcEJfME9IUVBFNFNPd3ZOTnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Rival Ether Jumps on Bets Token Is Next for ETF Approval - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNbVdjcjdvOUcxM3VwakpzSl9qUlgwX0tTZXhKV3o3V3k5bHNkcTViVFc4NWZDbC15Vy1scUo0a2tYdmNTOWRhWENISmpITWhYd2ZFVUlodTlVUGw5QkpaOHMyMXZVVlE0OEVJYU1CUDJDY3VSSVE3STh0RDFtRmEzQXAzc2dXcjFlSkJZajJqNDc0cjB3c05CODhyQVg5MmxrMUVjeFlzT2oyejg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum-Bitcoin ratio drops to historic low as ETF approval speculation heightens - CryptoSlate",
        "content": "Ethereum’s value against Bitcoin has dropped to historical lows as market anticipation grows for an imminent launch of a spot exchange-traded fund in the U.S.\n\nData from Paris-based crypto intelligence platform Kaiko showed that the ETH/BTC ratio has steadily declined since the smart-contract-enabled blockchain transitioned into a proof-of-stake network in September 2022. During the last 24 hours, the metric dropped to 0.048, its lowest point since May 2021.\n\nThe ETH/BTC ratio is a crucial measure for gauging Ethereum’s performance in relation to Bitcoin. When this ratio rises, Ethereum gains strength or maintains its value better than Bitcoin, suggesting a market preference for ETH over BTC.\n\nConversely, a decrease in the ETH/BTC ratio indicates Ethereum’s weaker performance compared to Bitcoin, potentially signaling investor leanings toward the perceived safety of Bitcoin.\n\nThis ratio goes beyond mere price movements as it encapsulates shifts in investor confidence and market sentiment between these two prominent cryptocurrencies.\n\nCryptoSlate’s data shows that BTC’s price has greatly outperformed Ethereum’s over the past year. During the period, the top cryptocurrency’s price rose by more than 170% to a 21-month high of more than $47,000, while ETH was able to post a modest gain of 74%.\n\nBTC’s positive run could be attributed to the surrounding market optimism and demands for the potential approval of a spot ETF. Over the past several months, several asset managers, including BlackRock, VanEck, Grayscale, and others, have actively engaged the U.S. Securities and Exchange Commission (SEC) over the applications, fueling speculations that these products could begin trading as early as Jan. 11.\n\nOn the other hand, Ethereum’s lukewarm price performance came amid the launch of several futures-based ETFs for the digital asset last year. These ETFs barely made a ripple in the market as they saw tepid demand, forcing asset manager CoinShares to describe ETH as the “least loved altcoin” compared to rivals like Solana.\n\nMentioned in this article"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPaWZSRmFzTXVQVFZBQTkxVlVSY01MNGZSdG00bUw4RGpYS1lZZ01tMXcxVzNqWi1LZmZZWF81UGRvVXp0ajJQQjZJYno0aW1ieV9VYWNpb1pYTG83YzFNWHlYOEVYTm9YR0VZU25LYnEzdHJDQlFJTzNTRFhmN2hybTFydzJCYmlIa2dLQlVsQTZwY0ZnU25WX0VWQ3RFeTFSOE1IdWxMXznSAa4BQVVfeXFMT2pncjJrNXFPUnZLR1dwN250cXRNd3VwelZSdVUtSFlXUzFWNzJHM0RXdHdLZXdscmRNX2hoWTV6MmFaMWhma0czTGFCMmJnaTZ0V0FnWFlUM21XeGM5SDI1ZEJFZGdyZ0RFWmtTNzFIWDFmTGpTRzVKYmZKZVprSVMwQVBqQlMtUXpoVnI2WkcxdGRRX3NCQk9PblFTeW5yaXdHRXI4eUI4dHpCV1Rn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETF Fever Drives Ethereum to 32-Month Low Versus BTC - CoinDesk",
        "content": "Bitcoin's increase against altcoins like ether can be attributed to the emergence of two narratives: hopes that a spot bitcoin ETF will be approved in the U.S. and the upcoming \"halving,\" or reduction in the reward given to miners who create new BTC."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOU2pKZm5Ta1ZaemFSWjRwLUlqTkJwbmtLX1BoQnMtVGdXemU0U2lSekF3MV81VEhLbUFkUWNLYlNWWFVYS3Q1M0ZYNDRpNGYwdjlFMmdwUWJLUzNmY1N1aWp0MWZnSXMzSFBBR0dnOE1PMXA3dVkyYlp4a1FQUUpuQS1fZUpDNjV5ZERpSlBTWldXQmpuSVlIaVdTa9IBowFBVV95cUxOZ3A4RmpsOW9qUWo1alZ6MFNzb1IzVTREXzRFckFFWDhucWpwNlNCbWVaYlVIVnpGZzVzRlU4RzRJSlFzY0hRS2xxeU1Fa2ZvN0M5ck9WX0R4ZDZab3ItbXo4VWVPZ2V6NGx5M00tVTZqOGNYZU5CZXNuVkQ1M1B1WFBkSVdtMUltNlpFZy1wdUUxMUEzZmthUDNUTEtnY3VmZDh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Dips, Then Bounces After ETF Approval While Ethereum Tops $2,500 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe United States Securities and Exchange Commission (SEC) officially approved the trading of spot Bitcoin exchange-traded funds (ETFs) Wednesday, as expected—but the price of Bitcoin itself has been choppy since, though it's currently sitting about where it was when the news hit.\n\nBitcoin (BTC) is currently trading for $45,814 according to CoinGecko. It was around $45,840 when the news leaked via an order on the SEC website that was posted and then removed, and the price jumped as high as $46,263 soon after. It's mostly down since, however, albeit not significantly.\n\nEthereum (ETH), on the other hand, rose above $2,500 for the first time since May 2022 on Wednesday afternoon, and has continued climbing while Bitcoin pops up and down. Ethereum is currently trading for about $2,550, up about 11% over the past day.\n\nOn top of that, native tokens for Ethereum scaling networks have also been hot on Wednesday. Arbitrum (ARB) is up 26% over the last 24 hours to a current price of $2.18, while Optimism (OP) is up 11% today to $3.92. Arbitrum set an all-time high price Wednesday afternoon, following the Bitcoin ETF approval.\n\nAD\n\nAD\n\nBroadly, the cryptocurrency market is up about 2% over the past 24 hours.\n\nEditor's note: This story was updated after publication with additional information.\n\nSHOW ALERT: Tune in to Rug Radio’s FOMO Hour at 10:30am ET Thursday to hear Decrypt’s Stacy Elliott and Fox Business’s Eleanor Terrett chat all things Bitcoin ETF with Farokh Sarmad, Michael Anderson, and Ovie Faruq."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQWm13TFg2M0pBSzYtV0NCQU80VnpGelJwa3dmUWd4Z1FjUG1vYUlGZkRBdmFpYkNLVFBvWUkyV25LYk5GelRKSnFrTExxdTdJcWZ2V1I5V2I3VkJhOEJuOFpnQzhCRHVDNFViTFlSaWhpVXFoa2pseTZHdXF6cklFMjNjclpyc0VDX1ZUQ3F0NjEtb2hRLTlMUExB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum applications take place as top gainers ahead of ETF announcement - crypto.news",
        "content": "According to CoinMarketCap, native tokens of Ethereum applications, including Lido DAO, Rocket Pool, and Aribtrum, take the lead ahead of spot Bitcoin ETF approval day.\n\nLido DAO (LDO) takes the top spot on the gainers on the Jan. 10 charts with a live price of $3.80, with a 24-hour trading volume reaching $385 million, in what is a 16.1% increase. The surge in the value of Ether (ETH) and native tokens of Ethereum-based applications is said to be driven by trader optimism surrounding the potential approval of an Ether exchange-traded fund (ETF) following the anticipated approval of a Bitcoin ETF in the United States.\n\nBlackRock’s iShares Ethereum Trust, a spot Ether ETF, may have its way paved by the approval of its Bitcoin counterpart.\n\nTop crypto gainers of the day | CoinMarketCap\n\nYou might also like: Stacks, Injective, Internet Protocol emerge as crypto top gainers\n\nFor similar reasons, Rocket Pool (RPL) has also seen an increase in value today, operating as a decentralized Ethereum staking pool that offers a competitive annual percentage rate (APR) of up to 4.3% for ETH2 staking. As of the most recent update, the live price of Rocket Pool stands at $31.76, accompanied by a 24-hour trading volume of $22 million, revealing a 14.9% increase in Rocket Pool’s value over the last 24 hours.\n\nRounding out the third spot is Arbitrum (ARB), which stands out as an Ethereum layer-two (L2) scaling solution, employing optimistic rollups to enhance speed, scalability, and cost-effectiveness within the Ethereum network. As of the latest data, the live price of Arbitrum is currently $1.94, accompanied by a 12.1% increase in value.\n\nWith the market experiencing significant volatility this week in response to ETF updates, investors are making many big moves in the crypto space."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQOFhkc2NSN1M0V1UzWVdJTHdTdk93eFFBRzVEU0FxQW9ldkxNS2JhVGxKVzhwMGE0T0NMOXBINko4RHpySEZlQWhCYzRuTlZEOXZhcU9FMXB3RFdxNVdCZjZBbEtIY2hMWXR2MFB3N0tENktNRVBWZnBON2dtanFHbGlVSHpSZVVON3haSmFUNW1pdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Market Cycles Echos 2018-2022 - Crypto Times",
        "content": "According to Coinbase Research, Bitcoin and Ethereum are at present following a trend similar to that observed between 2018 and 202 Thus far this year. This suggests that the market may see additional growth.\n\nAnalysts cite metrics such as net unrealized profit/loss and supply in the candle of profits, suggesting so far that this market is not yet overheated like it did in 2023. This indicates possible further upwards moves.\n\nPrices could also be buoyed by the next Bitcoin halving, due in April 2024 when the block reward will shrink to half. Coinbase Research, however, remains careful to point out that the link between halvings and price rises is still not completely made.\n\nBitcoin price performance since cycle low/ Source: Coinbase Research\n\nThe upcoming Cancun upgrade for Ethereum, scheduled to enhance scalability and security features in its protocols could also result in an increased transaction volume leading potentially to an increased ETH price.\n\nOverall, Coinbase’s research indicates that the current crypto market cycle appears to be on track with this 2018-2022 cycle followed by potential upside before reaching its peak."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOZjRvVlUxQ0pBODFNcF9wWW1qbVZsbzJHUlZvaEtkY0ZsbzhMWmxxcmRmdGIwc3FiT2hsVmk1a0dRT2d3LS1GTXZhbTYtS1ZuUUV2Zlo4eDhENHVLZjB0SDBVUVdGNldSdlhvczRIQ3BONjBoRlVDQ1NCcW5NNnlGVmItTG5xYXQwS1hmaHhVeC1HQ2hTZHBaYXlhaUZBM0pi0gGmAUFVX3lxTE9CT2VKTVg1OV9JbVhBWVNQVjMxal9qLUhtYjFFd1FQWC1DUm04eElwSjdLbnNoR2tyYUdXQTlFVHpWRzZHdzJRbHVMc2pNRElrekl1NTV1cTlIejZHalBWcmpENEU4V3Q1WHFNUjRfeTFOYVNwOGJMYWtjRlhmdWt6dFBwZENGLWlQbmJmY0ZQQ3BaMGRVclhhU0o3MExzdzdGeXFxalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) at Critical Juncture as Michaël van de Poppe Predicts Bullish Breakout - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn the ever-evolving landscape of the cryptocurrency market, Ethereum (ETH) finds itself at a critical juncture, with renowned crypto analyst Michaël van de Poppe predicting a potential bullish breakout. In a recent tweet, van de Poppe conveyed his insights, indicating that Ethereum was approaching the low of 2022 and was likely to absorb liquidity at that level.\n\nAdvertisement\n\nHe expressed the belief that in the event of a spot ETF approval for Bitcoin (BTC), there would potentially be a liquidation candle on the trading chart for the ETH/BTC trading pair. Following this, analyst van de Poppe foresaw a rotation of funds into Ethereum, accompanied by a bullish weekly divergence.\n\n#Ethereum approaches the low of 2022 and is likely going to take the liquidity there.\n\n\n\nIf an ETF approval for #Bitcoin happens, I think we'll have a liquidation candle on ETH/BTC and after that a rotation into Ethereum, combined with a bullish weekly divergence. pic.twitter.com/kGq91S7kq9 — Michaël van de Poppe (@CryptoMichNL) January 9, 2024\n\nAccording to the most recent data, Ethereum is presently valued at $2,294, indicating a noteworthy 3.04% uptick in the past 24 hours. The trading volume within this period has experienced a substantial surge, escalating by 36.14% and peaking at $12.48 billion. In the aftermath of this modest rally, ETH has observed $21.60 million in short liquidations and $11.79 million in long liquidations, as reported by CoinGlass.\n\nSpillover effect\n\nThe focal point of van de Poppe's analysis revolves around the potential approval of a Bitcoin spot ETF by the U.S. Securities and Exchange Commission (SEC). The cryptocurrency market anticipates a breakthrough, with BlackRock, a financial behemoth, leading the charge. BlackRock, along with other prominent firms such as Grayscale Investments, Valkyrie and ARK 21Shares, has recently submitted updated 19b-4 filings for their proposed spot Bitcoin ETFs.\n\nMarket sentiment is building as BlackRock expresses confidence in the SEC's approval for its spot Bitcoin ETF, with expectations pointing toward a potential decision as early as this Wednesday. A positive outcome could trigger a ripple effect in the broader cryptocurrency market, impacting not only Bitcoin but also potentially leading to a rotation of funds into Ethereum.\n\nMichaël Van de Poppe's prediction hinges on the notion that Bitcoin spot ETF approval may prompt a notable uptrend for Ethereum. Traders and investors are closely monitoring these developments, recognizing the interconnected nature of cryptocurrencies and the potential spillover effects of major regulatory decisions. As Ethereum stands at this critical juncture, the market awaits further clarity from regulatory bodies and key players in the cryptocurrency space."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNMmROUGR5bFFOUEZ6Q2tJQkkwZmdnY3NSa1ZJbks1RGxMM3BMcFh0aWNCQ1NMSlFXNEM5M0REMHVjeGFqNXBqaThkUmNnVGhKX085X0RfZU5IRDlnWEN5NlZ2MlQ4bi03WUJLWGlXYnJXaHhoVDFfc1YyejFJSnhnM3J3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum vs Bitcoin: Will ETH Price outperform BTC After ETF Approval? - crypto.news",
        "content": "Ethereum price briefly broke past the $2,400 mark on Jan. 10, up 10% within the weekly time frame, ahead of the much-anticipated Bitcoin ETF Approval.\n\nThe crypto market experienced widespread volatility on Jan 9 after the U.S. Securities and Exchange Commission (SEC) announced false Bitcoin (BTC) ETF approval in a now-denounced post on X.\n\nDespite the raging controversy, Ethereum’s (ETH) price has maintained a steady uptrend, trading as high as $2,440 on Jan. 10.\n\nEthereum vs Bitcoin: Crypto derivatives traders are betting bigger on ETH\n\nBetween Jan. 7 and Jan. 10, Ethereum’s 11% price growth performance has dwarfed Bitcoin’s 4%. Interestingly, vital derivative market metrics now suggest that ETH price could further outperform BTC if the SEC issues a timely positive verdict on Bitcoin Spot ETFs.\n\nFirstly, the funding rate represents the interest paid by bullish traders to inverse traders to keep their LONG futures contract positions open. As of morning trading hours Eastern time on Jan. 10, ETH currently has a Funding rate of 0.014%, which marginally exceeds currently exceeds BTC’s 0.12%\n\nEthereum (ETH) vs Bitcoin (BTC) Funding Rate | Source: Coinglass\n\nPut concisely, a higher positive funding rate in Ethereum than in Bitcoin implies increased demand for long positions in the ETH derivatives market, potentially reflecting a more optimistic sentiment.\n\nIn further confirmation that Ethereum price could outperform Bitcoin, the open interest dynamics have also flashed similar signals since the week’s turn.\n\nYou might also like: Bloomberg ETF analyst: Bitcoin ETF to be approved today\n\nETH open interest growth has outpaced BTC\n\nETH Open Interest has increased by 14.6% from $3.71 billion at close on Jan. 7 to $4.57 billion at the time of writing on Jan 10. Meanwhile, BTC open interest has witnessed only a 5% boost, from $6.4 billion to $7.3 billion during this period.\n\nEthereum (ETH) vs. Bitcoin (BTC) Open Interest | Source: Velo Data\n\nOpen interest represents the dollar value of all active futures contracts for a specific cryptocurrency. An increase in open interest implies more new entrants are bringing fresh capital than those closing out their positions.\n\nThe chart above clearly illustrates that the percentage increase in ETH has outpaced Bitcoin’s open interest amid intense speculation on the spot BTC ETF verdict. This affirms that crypto traders are betting on Ethereum to deliver larger price gains in the days ahead.\n\nWill ETH reach $3,000 after BTC ETF approval?\n\nDespite Bitcoin pulling more media traction, the current ETH Funding rate and Open Interest trends imply that crypto traders anticipate higher price gains in Ethereum after a positive ETF verdict. If this scenario continues, ETH’s price will likely reclaim the $2,500 territory.\n\nHowever, IntoTheBlock’s in/out of the money around price (IOMAP) data, which groups the current ETH holders by their historical entry points, shows a major resistance sell-wall around the $2,475 range.\n\nThe IOMAP depicts that 567,150 addresses have acquired 398,810 ETH at the average price of $2,475.\n\nGiven that this cluster of holders has been holding at a loss for nearly two years, they could rapidly book profits as ETH price approaches their break-even point again.\n\nBut if the derivative traders continue doubling their bullish positions as depicted by the elevated ETH funding rates, Ethereum’s price could break above $2,500 for the first time since May 2022.\n\nEthereum (ETH) Price Forecast, Jan. 2024 | Source: IntoTheBlock\n\nConversely, if a material market even sends ETH price into a down trend, the $2,200 support level could be crucial.\n\nAs seen above, the 2.85 million addresses that had acquired 7.7 million ETH coins at the minimum price of $2,220 could mount a formidable buy-wall to avert a prolonged Ethereum price downswing."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNNGxzaFVLS1VhUWtBU0wzOWFYaXRqRkh0OHhRRzdYbllBRWI1T29GeTA1UTNfaEJhYUJyTGI4Yk1TaktXbkVXaEhnV2pPcVJkZS1aNG10Q1I2eEZtWi1sMERSYldiMW1PcEpxU1lzd09sQXBGYnVLZEVDRGlZdlY0U2lKSktfZWxWN0xIVFhBbWIwNlN1MTVweTlvTklkT0F6QVFwSzNzc0NoclHSAbABQVVfeXFMT1hicTZrY0RDMDV1RWRMN1VQelUzc1EycUpFaW5kckdYcG1pOEo4MEQ2T2RIOXNBTnFTc2ZGNkd4STZWcjdvQzBhaDVCVVYtT3Q5Tkc3bU5FVEN5SDVCUnF4Sjh6ZVYzejVKMlBoaEpjakw2SkZpVmhoZXVneDRzOFdmWFF6T1ZqOE96ZFB1bjlpdFJkdXlmd3R0LV84MlUxYWhabHEwdjVmVWdXVTE1Zlo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ether Jumps Over $2.4K as Traders Bet on Possible Ether ETF Next - CoinDesk",
        "content": "But some stated that select tokens could gain in the coming days. \"Tokens in the ETH ecosystem like LIDO, ENS, and MKR experienced sharp up moves which should continue to take the attention away from BTC as traders now must position for the possibility of an ETH ETF,\" said Jack Tan co-founder of crypto exchange WOO X, in a Telegram message."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOOWlvYXR1Q2lRRTlseVhpUUx2TTMzTzFFMEIteG1MUHFCQ0lrNVFjbUNWa2xUSDVJRHVZVEMtQnVwZzhhSXNyNTdUNk8xVzU2em41UFQxck1mcVltMXRMZnJRcE1qQ1ZvbktPMUpBT2EtUDFiZWxNMUlwc0RUQnFtLW05X1pRYWtoanFnS19B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Coinbase says Bitcoin, Ethereum current cycles resemble 2018-2022 - crypto.news",
        "content": "Bitcoin and Ethereum are seemingly following the pattern of previous years, when their prices jumped by 500% and 1,000% respectively, Coinbase research says.\n\nThe current crypto market cycle for Bitcoin (BTC) and Ethereum (ETH) closely echoes the period between 2018 and 2022, when both cryptocurrencies witnessed a significant surge in their prices, according to the latest research report conducted by Coinbase Research and Glassnode.\n\nAs noted by analysts, various metrics of cyclicality, including net unrealized profit/loss and supply in profit, follow the previous trends and indicate that the current state of the crypto markets does not reflect the euphoric conditions witnessed during the maximum of 2023, suggesting the market still has room to surge.\n\nBitcoin price performance since cycle low | Source: Coinbase Research\n\nYou might also like: Bitcoin ETF applicants ramp up BTC purchases ahead of SEC verdict\n\nWhile acknowledging the potential positive impact of the upcoming Bitcoin halving, Coinbase Research remains cautious, noting limited supporting evidence and characterizing the relationship as somewhat speculative.\n\n“With only three halving events historically, we have yet to see a clear pattern fully emerge, particularly as previous events were contaminated by factors like global liquidity measures.” Coinbase Research\n\nThe next Bitcoin halving is expected to take place in April 2024 based on current mining rates. The block reward will decrease from 6.25 to 3.125 BTC.\n\nRegarding Ethereum, analysts spotlight the forthcoming upgrade named Cancun. Anticipated to enhance scalability and security, the upgrade aims to make layer-2 transactions as cost-effective as possible, potentially leading to a significant increase in the number of processed transactions on the Ethereum network.\n\nCoinbase also notes that both Bitcoin and Ethereum have undergone two cycles, encompassing both bull and bear markets, with the ongoing cycle, which initiated in 2022, closely mirrors the patterns observed in the preceding cycles."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOSTFZTXhmUVZMYVBiVmhqMEFxUndTYzNWaWQwci1FekV5OVVNNVlfbjc0Vy1QRFpERTk3aXJoVDdHTHhsb1hLU09Oems5Yy1yVVRqMXBTemlTaEJ2bXVLMTlESThvYVZDUDF6emJjdWQtN2V1SGFRV2ZwTWoxamptb2ZtbDd1MmdBUzdRcFFGcUstWVVtS0c5VUc0MF81ZFJRMXQ0Z0RhRC1qeTN3SzB4Z2ctNFZUMHYyMkxwWtIBwgFBVV95cUxPRjFqQklhSDROX1RJb1BkclV1dW4zUW1WTUsyU284ZG80cnRuSDhVRWp3US1Ybm81RFh0cU1jRVh2aUN1QjM5cEFlNHc2eFBZQWZZZWtUUmlBa0JTWnNPeXZfLUk2ek5ydXN0S0paTUlUTkItYUNOSWJyOFBSNENHbTJVdHdZdmZ3Ym1MdzBjXzlhOXpTbndjeDBNSEtXQmRXSTV4OE4wZF85UlhNbVJZTm1vQTVKM0M4cDFLS09hejhIUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "First Mover Americas: Ether, Lido DAO, Arbitrum Gain on Possibility of ETH ETF - CoinDesk",
        "content": "With the crypto industry anticipating the SEC approving a spot bitcoin ETF as early as today, BlackRock (BLK) and ARK 21Shares both cut the fees for their proposed ETFs, joining rivals who announced reductions yesterday. BlackRock said it will charge 25 basis points on net asset value in a new S-1 filing on Wednesday, having previously revealed a fee of 30 basis points on Monday. The asset-management giant is offering a promotional rate of 12 basis points on the first $5 billion during the first 12 months after listing. ARK 21Shares reduced the fee by 4 basis points to 0.21%, having previously said it would charge 0.25%. The firms are waiving the fee entirely for the first six months or the first $1 billion in assets, whichever comes first."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBaSFVVQllydUEwSC1RdUZkWlpSTXN0eW9nS2YzTFdyNHA3bWlBTlp3X0d4NUp3b01OOEtjRGVhM2syY2ZWTGZwOXc5NjFxQjd2YzhJMU9MZ0lGQmk3WnhMblV0VHg4YUoxNC1CN2JOMzVLVXE1N2VRVzVnTXFZQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum’s price surges despite the market-wide chaos - crypto.news",
        "content": "The crypto market witnessed decline after false news about a Bitcoin (BTC) exchange-traded funds (ETF), but despite bearish sentiment in the market, Ethereum (ETH) posted gains.\n\nETH gained 3% in the past 24 hours and is trading at $2,380 at the time of writing. The second-largest cryptocurrency even got close to the $2,400 mark as the hacked X account of the U.S. Securities and Exchange Commission announced the approval of a spot BTC ETF.\n\nETH price, whale activity, open interest and RSI – Jan. 10 | Source: Santiment\n\nEthereum’s market cap is holding strong above $286 billion with a daily trading volume of $17.1 billion.\n\nYou might also like: Spot Bitcoin ETF issuers file new AP disclosures with SEC\n\nAccording to data provided by Santiment, whale transactions consisting of at least $100,000 worth of ETH surged by 7.9% over the past day — rising from 5,790 to 6,242 unique transactions in 24 hours.\n\nOn the other hand, Ethereum’s Relative Strength Index (RSI) is currently hovering around 59, per Santiment. The indicator suggests that ETH is still in a good position for a further potential rally.\n\nWhile the increased whale activity suggests high price volatility, Ethereum could still hold its current price point if the RSI stays below the 60 mark.\n\nFollowing the price surge, according to the market intelligence platform, Ethereum’s total open interest (OI) increased by 4% over the past 24 hours — rising from $3.75 billion to $3.90 billion."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxNWFZKQXJXX3J6RXZhRnlNNTNvMGNxalFfTGNObTNhY0RmY0pTU2U0azNIMlNqSlVqdzdXVUN3UGxUdGlDMDFYaVZNNFpnOEMtSktVXzh1LUNzZ1dKUTZ0eHotZXF0bGlqQ0pJYm16b1Jac2VTeG56UUl1WWRKT25vWEZ3TGlydjY2MUdNSVpEWTM5SkZaTXRLOGFKY05IQkdBSjJ3cm95YXB4b0V6UkNnMlIzYUE0TFZycDJra05ZeVpobG5HRzRtSWZEY2NwLWpjQVozVU8zUFA0YkhNeS13RDVB0gHnAUFVX3lxTE9oMkdlWGpwRTVGVzFlM19jTGJKX0pNeG93U1p3T1psNUkzYVZMcndVUDJRZXJmT2pfQ081SnJ0WUYtOVo4Y1dBT3lZemZmOWVWalVRVWhsa0lrdUVwLTBVY3o4YVR0U0pLWDVJdXpYWVBuR3FQcFJYbVQwYXlFMWVJdmhqcnNHQ1B6cnN5ZHlrWUxHU3Q4NlYySjUxTTFtX1lsZWlpVklVN2w1MHhzeUVGcHJINzY0SWNMTEdTcmEzZ3NiSlR2emdBV0xkc1dVSF93Z0tXVW9sRmpEYlp0b25xOGlVblpOWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Classic Price Forecast: Chances of 21% correction wane on bullish market momentum - FXStreet",
        "content": "Ethereum Classic price formed a double-top reversal pattern that hints at a 21% decline.\n\nPrice indicators highlight the potential of the pattern failing due to bullish broader market cues.\n\nThe anticipated spot Bitcoin ETF approvals will likely have a bullish impact on altcoins, benefiting ETC.\n\nEthereum Classic price was seemingly adhering to the micro bearish reversal pattern, which failed despite the recent correction in the crypto market. The short-term outlook ahead of the spot Bitcoin ETF approval is now looking bullish as ETC is bouncing back from the crucial support of $19.33.\n\nEthereum Classic price notes a bearish reversal pattern\n\nEthereum Classic price on the 4-hour scale invalidates the double-top bearish reversal pattern that has been observed in the past four weeks. This pattern consists of two peaks or tops of nearly identical height positioned closely together, with a trough in between. It suggests a possible shift in market direction.\n\nThe potential trend reversal is indicated by the price encountering a resistance level on two separate occasions without successfully surpassing it. This is often interpreted as a sign to consider selling or initiating short positions as further declines in the market.\n\nIn the case of Ethereum Classic, this double top was formed at $23.42, with the neckline or support level of the pattern being marked at $19.33. This is also the breakout level, and an extended decline below this line would confirm the bearish reversal pattern. Furthermore, a successful pattern would only be observed when ETC falls to the target price of $15.24, which, according to the pattern, would register a 21% decline on the 4-hour chart.\n\nHowever, Ethereum Classic price took the other route and, instead of falling through the neckline, bounced off it to note minor recovery, trading at $19.90 at the time of writing. Although this does not rule out the potential for decline, the price indicators do suggest invalidation of the pattern is likely, too.\n\nETC/USD 4-hour chart\n\nThe Relative Strength Index (RSI) and the Moving Average Convergence Divergence (MACD) indicator are giving out mixed signals, with the former still sitting in the bearish zone and the latter noting a bullish crossover.\n\nEthereum Classic RSI and MACD\n\nIf Ethereum Classic price continues the current path and broader market bullish cues kick in, ETC could move sideways or upwards beyond $20 and invalidate the bearish pattern.\n\nOn the other hand, if the Ethereum namesake falls through the neckline and falls below $19, the bullish thesis would be invalidated, and the reversal pattern could be deemed mildly successful since absolute success would warrant a 21% correction."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPc3E2eHhBVUpScEJhWTNBdXlXb2x5eklVOWhSOWtudVAwNFJzVHVOUnByWEVLSjNIdVdYZHJzUmwzWHdqNzNWVDAyZjEza2IzeXQ4TFMwN3prek5uMFNSdl9ZcnRxZ2wxeGRsT2FoN2ZpaTRZZmZuNTQ0emgwTHdaWHc4NGtqN1RtUEdWYXdycDZnVXpUMWZael90NDBhc0o0YmJPLURDWjlJWjBHRHFGYkZMVk13Vkd6Vi10NUg4TlRoOW0xdnfSAcsBQVVfeXFMUE5weGw2b216TV9mNkxNMllaZEp5UlRoN2VIczByRGE2X2lRMWM4SFRyZXEzVVlfZFpQb0xPbF9zS1ZfSG1jZ0UtajlLX25iQV91MDJDZEhYVktLaWhwVDBYUGZlX3hUUm0teEVvMW5Hb1dNdzFOOHRFd2g5djVwNUJPeEc2RVJIdm4tdXlZTmJIdVlCTm5TaG1QVXNXWU1iSURmcVNmODVaRFp6QWU0VjBNZnM4VS1RbWRFRElNVmdXM3NUaG9xUmVXd3M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Crypto Bear Says Fakeout Rallies and Then Massive Corrections Coming for Bitcoin and Ethereum - The Daily Hodl",
        "content": "A widely followed crypto bear believes that major corrections are coming for Bitcoin (BTC) and Ethereum (ETH) after fleeting rallies.\n\nPseudonymous trader Capo tells his 83,873 Telegram subscribers that the possible approval this week of a spot Bitcoin exchange-traded fund (ETF) will likely ignite a short-lived rally for Bitcoin and other digital assets.\n\n“Whales are showing strong interest in the $48,000-$50,000 level. News can trigger volatility and leave large wicks. So a pump to that level and a big rejection afterward is a likely scenario.”\n\nThe trader shares a chart predicting Bitcoin’s price action “for the next few days.”\n\nLooking at his chart, the trader suggests that Bitcoin will soar toward $51,000 upon news of the approval of a spot market Bitcoin ETF. After the rally, he suggests that Bitcoin will likely correct down to the $30,000-$31,000 as whales “sell the news.”\n\nThe trader also predicts Ethereum will rally to as high as $2,600 before correcting. And he expects other altcoins to also undergo a massive correction after a brief move to the upside.\n\n“Interesting week ahead. ETF news should be released soon. As explained these days, I expect the market to pump first. BTC to $48,000-$50,000, ETH to $2,500-$2,600. Alts should pump more, especially low caps. After this, which should take a few days, the market should reach a very important local top. That’s when I will start opening swing short positions, aiming for new lows.”\n\nLooking further out, the trader maintains his long-standing prediction that Bitcoin will eventually collapse to the $12,000 level, which his chart suggests will happen around April.\n\n“BTC HTF (high timeframe) idea.”\n\nBitcoin is trading for $46,776 at time of writing, up 7% in the last 24 hours. Meanwhile, Ethereum is trading for $2,314 at time of writing, up 4.7% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNOWYybklzWE9YdXBNVUdGd3BaVll3UnBuWDhMeEtlTDM2VEtiN3VEbDkzdk5vOXpCdkQ3cFBRbkhxR0JYd0haM3RLQlBPWWlldzQ1VWlTWkN6bjEwQjdxUGdXbXBickJCM25wR2wzSmJpM2E1b0pLM1l2enZONGxiRjhTdzRzcGI1Nlg2dEV2eEV2d2QydEFxT9IBngFBVV95cUxNSFZwLUh1QnczYXFuVVlnWW9oV1BSTndHRmFHelVxZDV6ZEdSdXFrNTNZUTY5ZEZod3ZadjA2LUpfNlZWd0V0aVBfSVcyajJ0MlVBdHB2a182WV8yNVE2NEZrODkzdTY5ZXNKdU1lNWJidTdZc21TdktaVllscExiOGJZeDNLMTBkYVVRU2ZKcTFjLS1aalo1bUlpdTh2Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Whale Accumulation Surges Ahead of Spot BTC ETF; Is $3K Near? - CoinGape",
        "content": "Ethereum Price Prediction: Ethereum, the second-largest cryptocurrency, currently shows a lack of bullish momentum contrary to the generally bullish sentiment around Bitcoin spot ETFs. The ETH price has been resonating between the $2400 and $2140 horizontal levels for the past five weeks, with the overhead supply preventing the buyers from a higher rally. Will potential approval from the US SEC bolster the Ether price to escape this uncertainty?\n\n$2400 Breakout Will Trigger a Direction Rally\n\nA steep support trendline leads to the current recovery trend in the ETH price.\n\nA potential recovery may face new resistances at $2680 and $3000\n\nThe intraday trading volume in Ether is $20.8 Billion, indicating a 68% gain.\n\nAn ascending trendline in the daily time frame chart shows the Ethereum price recovery is intact and the current sideways trend is likely a post-rally consolidation to recuperate the exhausted bullish momentum.\n\nadvertisement\n\nInterestingly, the Ethereum whales have accumulated nearly $1 billion worth of Ether despite its underperformance relative to Bitcoin. A recent tweet from renowned crypto analyst Ali Martinez reveals that the Ethereum smart money has significantly increased its holdings by accumulating more than 410,000 ETH tokens during the past month(December).\n\nThis accumulation amid the crypto market’s progress towards the first spot Bitcoin ETF hints the ETH may also witness a major impact of US SEC approval as the potential for spot Ethereum ETF will also accelerate.\n\nBy press time, the ETH price shows a 3.77% jump and teases a bullish breakout from the $2400 resistance level. If buyers succeed in closing a daily candle above this barrier, it could lay a solid foundation for additional upward movement.\n\nSuch a breakout could potentially result in a 10% rise in ETH, setting its next target at around $2,680. Following this, a prolonged recovery could target the $3,000 and $3280 mark.\n\nThis Support Prevents ETH From Major Correction\n\nOver the past two months, the ETH price has been receiving dynamic support from an ascending trendline. The coin price rebounded several times from this support indicating the buyers are actively accumulating at a dip which is a key sign of sustainable recovery. Thus, it also indicates losing this support could intensify selling pressure and trigger a new correction in this asset.\n\nBollinger Band: An uptick in the upper boundary of the Bollinger band indicator suggests the bullish momentum is strengthening.\n\nAverage Directional Index: A low value of ADX(15%) hints the ongoing consolidation has managed to offer buyers sufficient break to kickstart a new rally.\n\nRelated Articles:\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNUEVPdF92UjdSLUNpbVpJamxhczE5VENpdHg4QWZTX3NLMFJNQ2dVU3RQcHA5azc4UmRjNjhlUHNxRjlCY09hTE5JMlFUaVZfR2NMRjBKMGRJMGtiVkFmV3lCWDEwUUU4T04tT3dEdGQ2bjUwU3NQNGpDZ2lzN0xJaDBhS2tJUjgzSWEzZ0VMQUJHREdwcTZMZW1NMFlvS01Vcm1KQdIBqgFBVV95cUxNNE9pRkprUlUzaFpQZGFnVHNPRTNodEQ2ZHQwUGpWaGxWVUhOWUR5N3hOU09McFhyWkZWV3Bod05tTUV4Y0QxSXpYcnVGdDRfaUFVeDI2MndFQ0dZaS11V0lRU0JaMDg2ZWZNUGp4eGhXN3V3aUtVM0hsZTdzTVY0MF9aNmdveXNvZTlHMWZEZU5WeDZXR0hJVWxHRU5FOGRqUjRmdlJMUDNRdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Tests $2.4K as Bulls Look to Finally Take Control: ETH Price Analysis - CryptoPotato",
        "content": "Ethereum has been increasing in the past day in the hopes that an ETH ETF might be next in line on the SEC’s agenda.\n\nMeanwhile, the probability of a further bullish continuation seems to remain high, considering what the charts are demonstrating.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily timeframe, the price has been trapped between the $2,100 and $2,400 levels over the last month. A breakout from either side of this range can determine the trend’s short-term direction.\n\nA bearish breakout would likely result in a decline toward the 200-day moving average, located around the $1,900 mark. On the other hand, a break above the $2,400 level would pave the way for the price to target the $2,700 resistance zone in the upcoming weeks.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour chart, the recent choppy price action becomes much more clear. The cryptocurrency has tested both the higher and the lower boundary of the range several times.\n\nCurrently, the price is testing the $2,400 resistance area. A breakout from this level would result in a rally higher toward the $2,700 area, while a rejection could lead to a drop back to the support zone at $2,100.\n\nSentiment Analysis\n\nBy TradingRage\n\nEthereum Open Interest\n\nWhile Ethereum’s price has been going through a consolidation phase, the underlying dynamics of the futures market are displaying an interesting sign.\n\nThis chart demonstrates open interest, which is one of the most essential metrics for future market sentiment evaluation. It measures the number of open futures positions. Higher values are typically associated with higher volatility and vice versa.\n\nIt is evident that while the price has been moving in a tight range recently, the open interest has dropped considerably. A significant decline in open interest without a price plunge is considered a bullish signal, as it hints at the fact that the futures market is not overheated anymore, and the price can continue its gradual uptrend in the coming weeks."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPb3UyZWhERGotQVNKUlQzck4tR2JrSnkzcmoxQ2JGMlctZFRjNGd5Y09yYUU5TFkyaUcyTXhvY1VnTkpWdTMxOWRyanVrbU1SN3JVRWhnZFRGMGVzYlcxSTQ0dG94NVFOYWZKOTFkdS1tOV9HU0JRcWY3WHpSLXp3WUJxXy1KSXhPby1NM0JBSFV0THoteHVCOUlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "The fake approval of the Bitcoin ETF greatly benefits Ethereum! - Cointribune EN",
        "content": "Wed 10 Jan 2024 ▪ 3 min read ▪ by Eddy S.\n\nThe crypto market has experienced intense turbulence in recent days, following a false announcement that teased the imminent approval of a Bitcoin spot ETF by the SEC. While this misleading information has disenchanted Bitcoin investors, it has paradoxically energized Ethereum and many altcoins, which have seen their trading volumes explode upwards.\n\nEthereum and Altcoins Boosted by Optimism over Bitcoin ETFs\n\nDespite the Bitcoin ETF illusion turning against the queen of crypto, Ethereum cheerfully crossed the symbolic threshold of $2,400, with a 2.8% increase. More importantly, the decentralized cryptocurrency benefited from very high trading volumes, indicating growing investor interest in this digital asset with multiple use cases.\n\nMany altcoins like Avalanche, Solana, or Cardano also jumped between 3 to 8% simultaneously. This bullish surge reflects the market participants’ optimism regarding a future approval of a Bitcoin spot ETF in the United States. Such a decision would pave the way for massive inflows of institutional capital, benefitting the entire crypto ecosystem.\n\nBTC Struggles to Bounce Back in a Volatile Market\n\nOn the contrary, Bitcoin is struggling to recover from its speculative excesses, after falling by more than $2,000 within 24 hours. Briefly surpassing the $47,000 mark, the original cryptocurrency fell back below $45,000, reflecting the market’s nervousness after the ETF hoax.\n\nSome are hoping for support around $46,200, but caution remains advisable. Bitcoin is now trading around $45,000, far from its all-time high in November 2021. According to many analysts, this could be a “bear market rally,” a faint uptick in a sustained bear market. Others are more optimistic about a lasting rebound.\n\nBitcoin’s Dominance Erodes in Favor of Ethereum\n\nThese sharp jolts demonstrate the gradual emancipation of Ethereum and altcoins from Bitcoin, despite its still overwhelming dominance, accounting for about 53% of the crypto market cap. Boosted by record volumes, Ethereum and others are now progressing according to their own dynamics, little affected by Bitcoin’s transient downturn.\n\nThis tumultuous episode reminds us of the volatile nature of the crypto Wild West, prone to extreme fluctuations based on false news or unverified rumors. It also marks Ethereum’s spectacular breakthrough, which is emerging as the most serious alternative to Bitcoin, even if there is still a long way to go to dethrone the crypto veteran. The coming months promise to be exciting, with the prospect of a “flippening,” a reversal of the established order!\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNSEQxLUgzeVE3cWRteC1LN01MampRVW8xRUNEU1NDRkRQVGxIMjBHRW5hV216R2VIdDhUaVNQQ21UN2lCUVdFTXBNOWw0bE9RN3pQaDA4eWwwN2F0OHFqNzN1MGg1Q2kwUUZwdmlhbUs3LURnWjZnZVJDUl9tWXBPX25rZVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "ETF Bitcoin Spot: Ethereum and XRP could follow! - Cointribune EN",
        "content": "Wed 10 Jan 2024 ▪ 3 min read ▪ by Fenelon L.\n\nThe SEC’s imminent approval of the first spot Bitcoin ETF in the United States could herald a new era for cryptocurrencies. According to Steve McClurg, Chief Investment Officer at Valkyrie Funds, ETFs on Ethereum and Ripple could quickly follow.\n\nAfter the Bitcoin ETF, is it Ripple and Ethereum’s turn?\n\nConfident about the future, Steve McClurg, Chief Investment Officer at Valkyrie Funds, stated in a recent Bloomberg interview that he “would not be surprised to see spot Ripple or Ethereum ETFs come to market” following the approval of the first Bitcoin Spot ETF.\n\nThis optimism is based on the impending decision by the Securities and Exchange Commission (SEC) to authorize the first exchange-traded funds (ETFs) that directly replicate the price of Bitcoin, expected this week. Valkyrie’s ETF is among the concerned products.\n\nMany observers see this as a major positive signal for the entire crypto sector. This regulatory advancement could pave the way for mainstream investors to adopt financial vehicles directly backed by cryptocurrencies.\n\nWith this precedent, Mr. McClurg anticipates that ETFs on other significant digital assets, like Ether or XRP, will quickly in turn receive the regulatory green light, capitalizing on the growing interest of investors in the asset class.\n\nA Growing Interest from Investors\n\nMr. McClurg emphasizes that investors’ interest in diversifying their crypto holdings remains increasingly strong. He specifically mentions the recent decision by Grayscale to add Ripple to one of its publicly traded trusts.\n\nSuch publicly-focused financial vehicles facilitate access to cryptocurrencies for novice investors, he believes, paving the way for mass adoption.\n\nThough confident, Mr. McClurg admits that the regulatory approval process remains unpredictable. Nothing is yet entirely certain regarding the launch of the Bitcoin ETF.\n\n“Anything could still happen“, he said, acknowledging that the regulatory environment remains complex. Administrative or political hurdles could still postpone the deadline or complicate the efforts of other players wishing to propose new crypto index funds.\n\nHowever, the potential validation this week of a first Spot Bitcoin ETF nonetheless seems to signify a turning point. If confirmed, this regulatory step forward could unlock the arrival of a new generation of crypto investment products, finally making these assets accessible to the general public.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxPNWIxWlIzeUp3aW03eVZ5OHMtdmpHMzhfQ2dkTTJqUTN4TFd0WS1LOER1cTdwaHAtd3AtRklFb3JLLXBsTEZnSVFmNTdhbXl0Y3FVa3R5dEV0U2J4TjJxZF80Y1VTN0s2QTB5d0t5MTVnUE4tUTdPRjZkQXhGc2VYZnhIMkd2YnRhdDBndEVDUmp0M2NzUHgtWmttQmFseWlaMU0ySzVrZG9vbGVBQk1wYmo2bzl2UktpaDJaeTFLWmctWGtxMkdxU3UwWGZtNWFmNldEemQySDZ3NEYwcVV30gHkAUFVX3lxTE84eVFubnctQVJPTmk2NUdZN2dUM3U1SV9mdVlDeG96WHVTdjFJS1pWZ1J1Ni1FRFE2WWlZSDNubF8ydHpoTWZqci1nUEtnNk54aHZsRzJLTDA1aW5VYW81eWo0ZWdxd0dUU1RPRUVSXzRBZzlCbEdXbkI1eDFpWk1NMVdldXc4VDR6NEpLeGtLU016bmVBdkxmUFZ6czNhZWRua0gzdmVIWGJ6LTBlS0tYeXk5OWxmeTZIRTI5bk9vb1lmUVQxRUtyQVcyaFU2UlY4V05YNGdjUnc0Z3RXNk01My1Idw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum price eyes $2,800 as spot Bitcoin ETF hype raises hopes that ETH could be next - FXStreet",
        "content": "Ethereum price is up 8%, outperforming Bitcoin as excitement over expectations of spot BTC ETF approvals increase.\n\nETH could extend the climb 15% to $2,800 once a Bitcoin ETF is approved.\n\nThe bullish thesis will be invalidated if Ether market value breaks and closes below $2,135 support.\n\nEthereum (ETH) price remains a top performer among the crypto top 10, spiraling within a bullish technical formation that commits Ether to more gains. It comes as the countdown to possible spot Bitcoin exchange-traded fund (ETFs) approvals climaxes since ETH community members anticipate the hype shifting toward a similar spot ETF for Ethereum.\n\nAlso Read: Ethereum price could target $3,000 with ETH whales buying the dip\n\nETH could come next if a spot Bitcoin ETF is approved\n\nEthereum (ETH) price did not flinch even as Bitcoin crashed in the aftermath of the fake spot BTC ETF approval news. It comes amid expectation that after the US Securities & Exchange Commission (SEC) greenlights the BTC product, Ether could be next.\n\nMultiple participants in the crypto sector, including Valkyrie Fund CIO Steven McClurg, say an ETH ETF launch would be unsurprising.\n\nNEW: @ValkyrieFunds Chief Investment Officer @stevenmcclurg says it wouldn’t surprise him if he saw “Ripple” ($XRP) and Ethereum spot ETFs coming to market now that the @SECGov is about to approve one for Bitcoin. pic.twitter.com/EBcwvbgChs — Eleanor Terrett (@EleanorTerrett) January 9, 2024\n\nIt comes as multiple institutions have already submitted applications for spot ETH ETFs, including VanEck, Ark21Shares, Hashdex, Grayscale and Invesco.\n\nETH ETF applications\n\nAmid this anticipation, Ethereum is going through a supply shock with funds rushing into the ETH market as investors front run a possible spot ETH ETF.\n\nEthereum could rally 15%\n\nEthereum price is moving within an ascending parallel channel, a bullish technical formation that could see ETH reclaim the $2,457 range high. Enhanced buyer momentum might see the largest altcoin by market capitalization metrics test the $2,800 level, a move that would denote a 15% climb above current levels.\n\nIn highly bullish cases, Ethereum price could extend the gains to the $3,000 psychological level, standing 25% above current levels.\n\nThe rising Relative Strength Index (RSI) accentuates the bullish thesis by showing that buying strength is increasing. Both the Awesome Oscillator (AO) and the Moving Average Convergence Divergence (MACD) indicators are also in positive territory. This would demonstrate that bulls are leading the ETH market. More closely, the MACD has crossed above the signal line (orange band), which is a bullish crossover.\n\nETH/USDT 1-day chart\n\nOn-chain metrics support bullish outlook for Ethereum price\n\nSantiment’s daily active addresses metric supports the bullish outlook for the Ethereum price, showing a progressive surge in crowd interaction with ETH as more unique addresses are created. In mid-December, there were 387,000 daily active addresses, while the number currently stands at 413,000. This represents a 6.7% increase in just under a month.\n\nAlso, whale transactions for transfers of $100,000 and above have been spiking, accentuated by surging volumes to show increasing investor interest.\n\nETH Santiment: Daily active addresses, volume, whale transaction count\n\nOn the other hand, with the potential for early profit-taking, Ethereum price could correct if the bears have their way. The ensuing seller momentum could see ETH market value dwindle, losing the support at $2,388. In a dire case, an extended fall could send the proof-of-stake (PoS) token to the depths of $2,135, below which the prevailing bullish outlook would be invalidated if a lower low occurred.\n\n(This story was corrected on January 11 at 08:55 GMT to say that in a highly bullish case, Ethereum price could extend gains to the $3,000 psychological level, not $30,000.)"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQOHlpU041V0JyUXdadzZFd2dsN1M3NmdnQU1OQzducHJpeDZwS3VLbk1YMnFyNUl2N0VObnJaNllza3hxM3lFSW9UZHRlWDRYNFJQOGtOTUloR3BEYWdhX0Q3SWl5NGktQnBZVzlIUEFtOTd6bkNaU0JKQWRkZHlFMGlWMzFnRnkyYjJWcWtyRWpMZWtTQ2NGY0F6LTNQYnFN0gGmAUFVX3lxTFAzNmtpYlRaOG85SkFVNndaQ25haGo5WkRkcjZaVUVGZlFaZENrMW90c3Qzbi1rRi0ya2UwN084RV8wdDJndE9Ic1dnQlFfV0pTamNqTEh3RkxrbDRNVG1XMHlpZlQ2dkZOSGh1LUxxa0tuMGo1M2xOMnFWMTU2c3VvMF85SlV5NVJZOTI1UW5ZLUlXUzUyVFVtbkZ3bGNQYVZMZng3ZEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "The Protocol: Beneath Bitcoin ETF Chaos, A Blockchain Drama - CoinDesk",
        "content": "GITHUB REJECTION! While crypto traders, tradfi investors, financial institutions and probably lots of normies and newbies were engaging in the gripping speculation over whether U.S. regulators would approve a spot bitcoin ETF, a struggle over the very soul of the Bitcoin blockchain was taking place on the open-source developer platform GitHub . At the core of the matter was whether data-oriented applications like Ordinals inscriptions – often referred to as \" NFTs on Bitcoin \" – should be allowed on a network that purists argue should be preserved primarily as a settlement layer for peer-to-peer payments. In September, the longtime Bitcoin developer Luke Dashjr, who sits in the latter camp, created a proposal – technically known as a \"pull request\" or PR – to put strict limits on the amount of data that could be stuffed into an individual transaction. The proposal quickly touched off an acrimonious debate that went on for months, until several days ago when Ava Chow , a maintainer of the paramount Bitcoin Core software, abruptly closed the PR without taking action. \"It's abundantly clear that this PR is controversial and, in its current state, has no hope of reaching a conclusion that is acceptable to everyone,\" Chow wrote, the last post in the thread. It's possible there could be additional chapters, though, since Dashjr later tweeted, \"Spam filtering isn't dead until the spam is dead.\""
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPY09USnNtNTMwYjQ2dFZUMThYaUl5N25CRnA3WjZBQ1c2N3ptR1ZnM0lsd1lkZHhnVzhhcF85Zk1oRHhycmZwM1RpTUpEQXdxckNyVmNsV0JEWDI5UmU1ZExzM0dNZXppamlmcWlIZ3Q1RElRYzF6cnZEanNlejU4djNNNk5OdFBvUm12cnhqWVpLT2pkdHRiWUdjaGhHWHpE0gGmAUFVX3lxTE84S0k2ZWpYRUNXRUdJTFJlSmRlRVo0WkNBeERjSzdlY0N1SW5lc2dfMkpnbU9GSzhPU1FBVW5fSnA1M2ZCaVdvRUUxd055YXBzTHZTUi1STGcwSzNKQTlUNll0XzQyQ0JBcU1KTkVzTVRMUE44MlliZmxLcVliSDgwYTgxTFhoNlhNeTVRUHZlMDZyV1AxSXp2Z1lxQ3NYd0FFdWFYaFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Fantom Founder Andre Cronje Reflects On Bitcoin & Ethereum’s State Bloat Problem - CoinGape",
        "content": "Fantom co-founder Andre Cronje, known as the godfather of decentralized finance (DeFi), further raised concerns over probabilistic finality in blockchains including Bitcoin and Ethereum as the market sees expanding use cases and adoption in traditional finance. He said Fantom has already solved state bloat as Ethereum developers look to solve state bloat in the chain.\n\nAndre Cronje Says Fantom Has Resolved S tate Bloat Issue\n\nIn response to Ambient Finance founder Doug Colkitt’s belief that Ethereum is the only chain looking to solve state bloat in its long-term plan, Andre Cronje said “I am pretty confident in saying we already solved state bloat at Fantom.”\n\nadvertisement\n\nEthereum roadmap entails using Verkle trees to allow for “data to be small enough to be attached to every block.” It could help validators and nodes to become stateless as all ‘state’ can be stored more efficiently off-chain.\n\nHowever, Andre Cronje said any blockchain that uses probabilistic finality or any variant of the longest chain rule won’t resolve this issue. Bitcoin and Ethereum chains depend on probabilistic finality. Finality refers to when a block of transactions is considered permanent and cannot be altered or reversed.\n\nFantom uses aBFT (Asynchronous Byzantine Fault Tolerance) consensus mechanism, which does not require the longest chain rule.\n\nMoreover, Fantom introduced the new database Carmen, a flat storage method that does not use tree or dictionary structures while maintaining a cryptographic signature of the world state. This greatly reduces the bloat of the current active state (two epochs). Carmen supports real-time pruning, and although archive nodes still need to retain all data, most validators can enable pruning.\n\nAfter adopting the above technology, Fantom’s status is reduced from about 2TB (archive) to 60GB (archive). Cronje said state bloat has been one of Fantom’s core milestones since its early days.\n\nAlso Read: BlackRock And VanEck Files Updated S-1 For Spot Bitcoin ETF Approval\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQRGY1dzdOSkxLZ3M4dEZyckpXY3BwMTl6Qko1dGRvU3JuSWowdjE4RzRfMXRpbjBfNWNKR0dlSDRucDdDd0Vmend3aTFST3VQNG54Y1JaMEpOX3JvLTBnVUdjbTFoYWhra3VPeFNINVVIZDh1VUVQcWNHUkNBY0R1bXRJc0ZuTGk3d0NxRzk1b0dxNy1UTi1r0gGcAUFVX3lxTE8wX2VINVEta2ZyWVNLQTVQR1VHZ29XSlNhekUtWUFHQnZNTFlya2NPOHcxOENZVTh2RzJLdEw4YktNbjNfa3FHZ3N0N1NNWWp0c0VkemlBWHdOQU1sZmlUcTFxR0NEMlpvdEkwY2hLZ294d3d5S2dBcHBxdUowWVppVUtoM19fZmRBTE1iYmN0Sno3REMzTEd5WVBpcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Scam Alert: Crypto Hackers Lure Ethereum, Solana & Tron Communities Into Fake Airdrop - CoinGape",
        "content": "Wallet drainers have now started targeting Ethereum (ETH), Solana (SOL), and Tron (TRX) communities to execute phishing scams. Earlier, they focused on conducting crypto scams via EVM chains. However, the trend has changed after they expanded their reach into well-established crypto groups.\n\nAlso Read: Crypto Scam: Trading Platform Coinspaid Might be the Latest Victim\n\nadvertisement\n\nOverview of Wallet Drainers’ Airdrop Scam\n\nAccording to a post by Scam Sniffer on X, phishing scams have been initiated by attracting crypto enthusiasts via fake airdrops. They have designed a webpage wherein one can claim Ethereum, Solana, and Tron airdrop rewards.\n\nThe scammers term the airdrop scam as an “exclusive opportunity” for the community. Moreover, they encourage people to connect their primary wallet to be able to access these airdrops. In addition, Scam Sniffer noted that these fraudsters can drain various types of crypto wallets via this webpage.\n\nThis update is an alarming one considering the popularity of Ethereum, the second-largest crypto, Solana, and Tron. It could instill crypto investors into believing such wallet drainers in anticipation of high-end crypto rewards. Thereby, millions and billions of digital asset investments could be wiped off owing to such wallet drainer scams.\n\nHowever, it is possible to identify such scams via a few checks. The snapshot shared by Scam Sniffer shows that the concerned airdrop scam webpage has grammatical errors, which could be a way to be safe from such fraudsters. But, they can upgrade their strategies from time to time.\n\nHence, it’s always better to check the source of such links. If a trusted entity isn’t posting such airdrop updates, then avoid such offerings completely. Moreover, it’s time to be even more cautious since hackers have been hacking reputed companies’ X (formerly Twitter) accounts to promote crypto scams.\n\nCertik and Mandiant Official X Accounts Get Hacked\n\nEarlier this month, Certik, a blockchain audit firm, witnessed its X account being hacked. Thereafter, malicious links were posted that promised people to return the digital assets they lost to various crypto scams. The dubious link was available on their website for quite sometime before the Certik team managed to regain access.\n\nThe X account of Mandiant, a cybersecurity company, was successfully reclaimed by its rightful owner on January 4, 2024, after falling victim to hacking. The incident unfolded over several hours on X, with users presenting evidence of the account takeover. The attackers, posing as the Phantom, a non-custodial crypto wallet, used the compromised Mandiant X account to promote a cryptocurrency scam.\n\nAlso Read: Just In: Founder of ACE Crypto Exchange Arrested for Fraud\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBfWUhITS12b0lxRHBSeFFZYWhwOERuQ0N0WW9IMWJaWXVwbVZPMGNUN1RZb2VHZmk3WFlHWEtYM0tLZkRscmNsbXVVMEp4aDJLUjRsejBQTUJBZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin is DeFi’s future - Blockworks",
        "content": "Ethereum has long held the title of premium layer-1 for decentralized finance (DeFi). It’s been the blockchain of choice for smart contract developers of all varieties.\n\nDespite Ethereum’s issues with network congestion, security vulnerabilities and the merge to proof-of-stake (PoS), other alternative layer-1s like Solana, Algorand and Tron were unable to overcome Ethereum’s DeFi dominance.\n\nHowever, with continued regulatory enforcements in the US this year changing traditional crypto users’ perspective on the industry, projects are seeking a destination to build upon that might provide more longevity as well as the trustless, secure and decentralized benefits they’ve come to expect from crypto.\n\nBitcoin has the potential to play the most important role in mainstream DeFi adoption.\n\nOver the past fourteen years, Bitcoin has set itself apart from other blockchains. As the original digital currency, Bitcoin can complement the DeFi ecosystem across layer-1s, as the centerpiece of multichain DeFi.\n\nAt the time of writing, Bitcoin’s total value locked (TVL) remains nascent at $158 million, compared to its $513 billion market cap. Compared to all other chains in DeFi, which total a combined $38 billion in TVL — Bitcoin DeFi’s untapped potential is outsized.\n\nAs the only digital asset that is truly a commodity, per the Commodity Futures Trading Commission, Bitcoin is also gaining steady traction in the US regulatory landscape, as opposed to other chains.\n\nCommentators often pit Bitcoin against Ethereum. The real “flippening,” however, is connecting DeFi to Bitcoin. Doing so gives users the best of both worlds, combining the dexterity of innovation that Ethereum brought along with the purity of Bitcoin.\n\nThe debate around bringing DeFi to Bitcoin should not be around anything other than what Bitcoin-enabled DeFi can unlock for users and developers.\n\nBitcoin brings DeFi back to the basics\n\nBitcoin’s underlying proof-of-work (PoW) consensus mechanism offers the bedrock for a global payment network separated from any one entity or governing body.\n\nThe built-in computational guarantees are enough to attract institutional investors, illustrating that it’s good enough for the power players of traditional finance. These intrinsic properties of Bitcoin are a part still missing from other DeFi ecosystems. When projects are given access to the stability, security and privacy of Bitcoin, time and again they make the switch from alternative blockchains back to Bitcoin.\n\nBitcoin’s potential as the safest pathway for new users to enter the world of DeFi is often overlooked, mostly due to the decades-old narratives that have built up around Bitcoin. But many of these narratives are no longer even supported by the most active of Bitcoin builders.\n\nWhat makes Bitcoin DeFi stand out?\n\nUnlike many other layer-1s that have also experienced the price volatility and regulatory uncertainties of the last couple years, Bitcoin has the predictability of the halving on its side in 2024. Historically, bitcoin halving events have created increased interest: This expected demand keeps actual network development separate from market fluctuations.\n\nRead more from our opinion section: Bitcoin blockspace isn’t too expensive, you’re just too cheap\n\nBitcoin’s network effects, driven by its extensive user base, create a compelling advantage for new users venturing into DeFi. This network effect fosters liquidity, reduces friction and ensures seamless integration with DeFi platforms, making it easier for anyone holding bitcoin to access and utilize decentralized applications.\n\nBuilding Bitcoin DeFi does not lack challenges, as builders still must navigate its simplistic-by-design structure to unlock usability for a broader set of users. Solutions, by way of smart contract capabilities, have been created by various layers that are already creating the functionality that Bitcoin deserves.\n\nBut Bitcoin’s robust blockchain, powered by a distributed network of nodes, provides a level of security and censorship resistance that is unparalleled in traditional financial systems.\n\nWhile DeFi offers unparalleled financial freedoms and opportunities, navigating its complexities can be intimidating. In this context, Bitcoin’s status as the safest pathway to DeFi cannot be overstated. Its stability, trust, network effects, security, interoperability and regulatory compliance make it an ideal starting point for those seeking to explore the DeFi landscape.\n\nRena Shah is the Head of Operations and Strategy at Trust Machines, a company building the largest ecosystem of applications on Bitcoin. Previously, she was the Head of Exchange at Binance.US, where she grew the exchange from $30M to $3B in daily trading volume within 18 months. Shah is a veteran in the crypto space with previous roles at Ember Fund, a retail-focused app, and with a market maker, Apifiny. Rena spent time on the commodities side with a unique background as a drilling engineer. She spent her early career offshore on drilling rigs while spinning up Bitcoin mining pools. Notably, she managed a $300M energy portfolio for the Family Office of the Houston Texans NFL team. She’s currently an Advisor at Tribe Capital.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPYW9qdXRQOFF0d2JIbDhJN3dTeVVFaEN5cnBibHNSbmZrdkhqbjJLTGM3aklSTkNXOU85VHZvaEtGS253ay1HMFZOU0dEZ1hjRmlNYjZILWVHdHdoSjBjNFlzYUI0dmQ5cEpBXzBxOTk1a1BPcGx5ZEYtYTVaYklab09Rb0tPWWdhT3ZvNVdn0gGTAUFVX3lxTE40ckJYemlNMGZIa3NjbEZ3VVBOSlA5NWJBcG80N2doX3FYQTU3aGdzSjB6Y3FBOERWNE5pdXFuODEyalhzOC1RWkt4SUZpUWRreEhnM1FHakJIZXFjTUVXUGZkdXNuQS1yUVVUaTh6bTFLSTlvSUtwMnlvZkdJb0d5N0JWenZmWUZBN2RiaUNUYW9QNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "XRP ETF Likely After Bitcoin Approval, Valkyrie's Investment Chief Says - U.Today",
        "content": "Advertisement\n\nIn a recent Bloomberg interview, Valkyrie Funds' co-founder and chief investment officer, Steve McClurg, hinted at the possibility of the approval of Ethereum or XRP exchange-traded funds (ETFs) following the anticipated launch of Bitcoin spot ETFs.\n\n\"So, it wouldn't surprise me if we saw Ripple or Ethereum spot ETFs out there,\" he said.\n\nThis prediction comes in the wake of the U.S. Securities and Exchange Commission (SEC) likely giving the green light for Valkyrie's Bitcoin ETF, with trading expected to commence as early as Thursday.\n\nHowever, McClurg is not certain whether Valkyrie is going to launch such products in the future. \" I really don't know if we're going to do that or not,\" he added.\n\nAdvertisement\n\nMore spot ETFs on the horizon?\n\nMcClurg's optimism about Ethereum and Ripple ETFs is backed by recent market developments.\n\nHe pointed out that Grayscale's addition of XRP to one of their publicly traded trusts shows a growing interest in diversified cryptocurrency investment products.\n\nValkyrie has not confirmed plans to pursue these specific ETFs, McClurg believes that the market is ripe for such offerings.\n\nHe emphasized that these potential ETFs could be more retail-focused, providing easier access to a broader range of investors who may not be deeply embedded in the cryptocurrency market.\n\n\"Anything can happen\"\n\nHowever, McClurg cautioned that the SEC's decision-making process is unpredictable, and the agency's approval is never guaranteed.\n\nValkyrie is prepared to launch its Bitcoin ETF, but McClurg remains cautiously optimistic, acknowledging that \"anything can happen\" in the regulatory landscape.\n\n\"We're prepared for an effective date on Wednesday and trading on Thursday, but we know that anything can happen. So I'm about 95% sure that we will be trading on Thursday,\" he said."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5hSGVrbGZYNDFISkZtRzNMSHZYd0NSTTAwSjBCMTBSUUFHR2NyZUowT3RwcWJDbEpUWnpURDZGMUJPVDVyWGJ0WEpVdjVsbjZoTWFjTHFqcnF1V1AtbUo5QlMwM0VKVW85Um1wTFRrVUNEaVVRSTVHNDFTOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "MOG Coin sees 47.5% gain as ETF deadline approaches - crypto.news",
        "content": "MOG Coin, an Ethereum-based coin, takes a spot on CoinGecko’s top trending report following double-digit gains in the last 24 hours.\n\nAs another Ethereum-based coin, MOG joins the surging token list on pending ETF approval day. MOG tokens are actively traded on decentralized and centralized crypto exchanges, with Uniswap V2 Ethereum emerging as a popular platform for buying and trading Mog Coin. The MOG/WETH trading pair on Uniswap V2 has since recorded a substantial trading volume of over $1 million in the last 24 hours.\n\nMog Coin price chart | Source: CoinGecko\n\nYou might also like: Ethereum applications take place as top gainers ahead of ETF announcement\n\nAs of the latest data, the daily trading volume for Mog Coin (MOG) stands at $1.5 million over the past 24 hours, indicating an increase of 108% from yesterday.\n\nReflecting on the historical performance of Mog Coin, its all-time high occurred on Aug. 18, with a recorded price of $0.061091, marking a span of five months. The current price registers a 50.5% decrease from the recorded all-time high.\n\nConversely, the all-time low for Mog Coin was observed on Jul. 24, with a recorded price of $0.084526, marking a period of six months. In contrast, the present price reflects a substantial increase of 1,093% from the recorded all-time low.\n\nWith much of the world awaiting the final verdict on a Bitcoin ETF, it is no surprise that wild price swings in either direction are likely to ensue."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxQYVBCUWl3eTVJbDJZV04xQkxudGRkSDEtV2w0bEh3VzFkR3AzOEs4a3F1NGlrM2dFVmduc0pTMVZHM0ZpN3FrLW9SX3lSdzdxYzdabE5qMHhDLXQ4bDdwdF82MHJkaktsMjNNZUg3VW54QTYyMlBOcmFfU0liSVdtUFJNZEdjUzB1d3hZY2MtdmVJa181bmVza0luUFRETV90aVNYcTE0TDZDWEt0MWNrX3h3ZGstRHEyOW5jVU41bllnU3lqY0FZR3dMdEQ3UG1aR2J2OGowcHRUSmPSAeABQVVfeXFMTWhZMFQwSWFkckZLd3NhTFdhajltdDJyZVpqNUxlMnNKeFZocGZaUXpRdEtSMEtDOWd0THJrMk8tcUNkYlVaRTlGZjYzUFN5dHRiVXcwcFBySzhYb1pCckhiN0hVcFd1a19vd1lCM0ladzdjdGJnRzR2TmJSVDdWWjI2ZTE0dmFlUy1NMHZyQ2pKUmxVU0ktWHFRWlltR3lLVUh0cG5CTjV5czRpbG1pek16MmFfd3FUYmF3b2NrWEQ0NnBHN2hGZ0pDSjZRS0ZhclpxTVVWY1JZZm1tUEJGMmo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "XRP and Ethereum ETFs could come after approval of Bitcoin's, Valkyrie Funds CIO says - FXStreet",
        "content": "Ripple and Ethereum Spot ETFs could come to market post likely approval of Bitcoin Spot ETFs, says Valkyrie Funds CIO.\n\nXRP is the only digital asset with regulatory clarity from US courts and the altcoin’s relisting by major exchanges is a key step.\n\nEthereum price rallied with the false announcement of the Bitcoin Spot ETF by the SEC, BTC price suffered as traders “sold the news.”\n\nEleanor Terret of Fox Business shared views of crypto industry leaders on why Ripple XRP and Ethereum Spot ETFs could soon be approved by the US Securities and Exchange Commission, following the highly probable greenlight for Bitcoin Spot ETFs.\n\nXRP bulls and Valkyrie Funds’ CIO, Steven McClurg are positive that XRP and Ethereum Spot ETFs will receive the regulator’s seal of approval.\n\nAlso read: Bitcoin ETF announcement hack reveals BTC price upside is likely capped\n\nSEC could approve a single product XRP Spot ETF: Fox Business reporter\n\nFox Business’s Eleanor Terret shared her conversation with crypto market participants, bulls and bears and Valkyrie Fund CIO, Steven McClurg. They offer different sets of views on the likelihood of SEC’s approval on a single-product XRP Spot ETF.\n\nThe bullish case is based on the fact that XRP is the only cryptocurrency that has received regulatory clarity from the US District Court. This refers to Judge Analisa Torres’ XRP ruling from July 13 that states that XRP was not a security in its “secondary sales” on exchange platforms. This clarity ushered XRP’s re-listing on major crypto exchange platforms like Coinbase and Kraken.\n\nGrayscale’s Digital Large Cap Fund recently relisted XRP and this is considered a positive sign that the altcoin will be included in future funds by the crypto asset management giant.\n\nSteven McClurg says that it wouldn’t surprise him if he sees XRP and Ethereum ETFs come to market after the SEC comes close to approving the Bitcoin Spot ETF product.\n\nNEW: @ValkyrieFunds Chief Investment Officer @stevenmcclurg says it wouldn’t surprise him if he saw “Ripple” ($XRP) and Ethereum spot ETFs coming to market now that the @SECGov is about to approve one for Bitcoin. pic.twitter.com/EBcwvbgChs — Eleanor Terrett (@EleanorTerrett) January 9, 2024\n\nThe bearish case is that the SEC Commissioner Gary Gensler and his views on cryptocurrencies other than Bitcoin could negatively affect an Ethereum or XRP Spot ETF bid without Congressional intervention on crypto regulation. Terret argues that a change of administration to one that has a “crypto-positive” outlook is likely needed for the same.\n\nIt is also likely that once Bitcoin Spot ETFs are approved, BTC will stand distinctly from other cryptocurrencies and this difference could be followed by rejections of Spot ETFs for other assets like XRP and Ethereum.\n\nEthereum rallies while BTC hit by “sell the news” trade\n\nVetle Lunde, Senior Analyst at K33 Research elaborated on the capped BTC price gains following Bitcoin Spot ETF approval in his recent tweet on X. Lunde sheds light on the possibility that the news of ETF approval is likely a “sell the news” trade for Bitcoin traders.\n\nBitcoin price reaction to false SEC announcement. Source: K33 Research\n\nInterestingly, Ethereum price rallied and crypto analysts noted that capital is likely to rotate from BTC to ETH and fuel gains in the latter. Scott Melker, crypto analyst, notes that the outcome of the series of events on Tuesday could act as a roadmap when the Bitcoin Spot ETF decision is released by the SEC."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOYlpzVVBZYmdGVVNOVWM4bVVpd1d0d3BNbW91VjFMZVkxTkEyanJPSWZHWEZIZURPOURFZjdwU29fR1FKZ256UlA3VjQ0bWZ4bXFVckNSMHVJRks3aHZOWFZqa0poaXl4X1dFZVIxSmUzcm9tT3o3MFFkLWpqbU4wZnRhQ1BpY2pybnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Blockchain Brawlers reports 309% gains as a top trending token - crypto.news",
        "content": "Ethereum ecosystem cryptocurrencies continue to lead, with Blockchain Brawlers outperforming their 12.7% increase, according to CoinGecko data.\n\nBlockchain Brawlers (BRWL), a web3 fighting game, tops the Jan. 10 trending report, exceeding its record all-time low of $0.001593 seven months earlier by 939%. The current market capitalization of BRWL stands at $21 million, securing position 1,003 on CoinGecko at the time of writing.\n\nBlockchain Brawlers price chart | Source: CoinGecko\n\nYou might also like: Stacks, Injective, Internet Protocol emerge as crypto top gainers\n\nDelving further into its price performance, Blockchain Brawlers has exhibited a substantial increase of 427% over the past week. This growth positions the game ahead of the global cryptocurrency market, which has seen a 3.8% uptick and surpasses similar Ethereum ecosystem cryptocurrencies by outperforming their 12.7% increase.\n\nThe recent upswing in the value of Ether (ETH) and related projects are attributed to heightened trader optimism. This surge is particularly linked to expectations surrounding the possible approval of an Ether exchange-traded fund (ETF), with anticipation building on the heels of the expected approval of a Bitcoin ETF in the United States."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE5TcWxiS3drME1WWFY1M0VsLUNUbEthRG1TMUJTTmM0eE1hOVNPQzYxQTBhRDlNc25QS00zd2Q0cVBUOUxWVGhrNjFUQWZjN3ljY1lFVjhmRDhwaXhVVzFIbWNhUGw4ZUt3R3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Top Trends in Crypto for 2024 - Bitcoin Market Journal",
        "content": "Table of Contents\n\nKey Takeaways\n\nBitcoin is expected to increase in value in 2024, driven by factors like the approval of bitcoin spot ETFs and the upcoming bitcoin halving event. These developments are expected to attract more investors and increase demand.\n\nis expected to increase in value in 2024, driven by factors like the approval of bitcoin spot ETFs and the upcoming bitcoin halving event. These developments are expected to attract more investors and increase demand. Coinbase will continue its growth momentum into 2024, potentially doubling its revenue. This growth is attributed to increased bitcoin demand and higher institutional adoption due to the approval of Bitcoin ETFs.\n\nwill continue its growth momentum into 2024, potentially doubling its revenue. This growth is attributed to increased bitcoin demand and higher institutional adoption due to the approval of Bitcoin ETFs. Ethereum could grow substantially, with an upgrade (EIP-4844) enhancing transaction throughput and reducing costs. Additionally, the integration of AI in the crypto industry is foreseen to bring significant improvements in transaction analysis, efficiency, and security.\n\nIntroduction\n\nIn 2023, we saw a resurgence in bullishness in the crypto industry, and we expect to see the same energy carry over into 2024 as increasing adoption, revenue growth, and the integration of new technologies are on the horizon.\n\nHowever, new tokens and assets, uncertain regulations, security concerns, and technological innovations speak to the industry’s dynamic nature. This can make it challenging to predict upcoming trends, let alone keep up with them.\n\nThat said, we see some emerging trends that will help fuel the excitement 2023 brought to the crypto industry. These trends include a surge in bitcoin’s value, Coinbase’s revenue growth, the increasing adoption of Ethereum, the rising influence of stablecoins, and the integration of advanced technologies like AI in crypto.\n\nRead more about the crypto trends we see shaping the industry in 2024.\n\nTrend 1: The Surge of Bitcoin\n\nIn 2023, we saw bitcoin rally 150% higher, and at the beginning of January 2024, we saw its price surge to over $47,000. Analysts predict bitcoin’s price rise will continue throughout the year, with the potential to reach an all-time high and hit $80,000 before year’s end.\n\nBitcoin’s price trajectory is strong. Chart via Coinmarketcap.com\n\nThere are a couple of factors at play that support this prediction. For one, there’s the SEC’s approval of a spot bitcoin ETF, which puts bitcoin within the reach of ordinary investors, directly within their brokerage accounts.\n\nTraded on stock exchanges, bitcoin spot ETFs hold bitcoin as their primary asset and directly track the price of bitcoin, therefore providing investors with price exposure without directly owning the asset. This should help bitcoin appeal to a broader range of investors, leading to increased demand and a price increase.\n\nAnother factor that could lead to a surge in bitcoin price is the halving event, which is set to take place in April 2024. These halving events occur roughly every four years, the last occurring in May 2020. Bitcoin halving cuts the reward for bitcoin mining in half, meaning miners receive 50% fewer bitcoins for verifying transactions. Historically, these halving events have been associated with price increases as a reduced rate of new bitcoin creation leads to scarcity, eventually increasing demand and price.\n\nTrend 2: Coinbase’s Growth Trajectory\n\nCoinbase is the largest cryptocurrency exchange in the US by trading volume, and the company has spent years building brand authority with investors, giving them pricing power. 2023 saw Coinbase’s stock soar 418%, and its revenue saw a 14% increase. The company is well-positioned to carry this growth into 2024, with the potential to double its revenue.\n\n\n\nCoinbase shares have outpaced even bitcoin.\n\nThe bitcoin ETF and bitcoin halving event are two of the main catalysts for the predicted growth at Coinbase, as both events should lead to an increased demand in bitcoin, which accounts for most of the platform’s trading volume.\n\nThe approval of bitcoin ETFs will also likely lead to an increase in institutional adoption, as insurance companies, pension funds, and other institutional investors who would otherwise be reluctant to engage with crypto will be more likely to invest, as ETFs offer a regulated and well-known investment structure. Coinbase is thus far the sole custody provider for all the proposed bitcoin ETFs. which should generate substantial revenue in the form of custody fees.\n\nTrend 3: Ethereum’s Rising Tide\n\nEthereum will also likely see rapid growth in 2024, with some analysts predicting its revenue will double.\n\nThis is partly due to a scheduled critical upgrade known as EIP-4844, which is expected to occur in the year's second half. The upgrade will boost throughput to 100,000 transactions per second and reduce transaction costs by as much as 90%, making the network more accessible to mainstream users and driving adoption.\n\nOver the years, Ethereum has made significant efforts to improve the adoption of crypto projects. Ethereum offers smart contract functionality, serves as the primary platform for the DeFi ecosystem, provides a framework for tokenizing and selling NFTs, and enables the creation and issuance of new tokens. In short, it acts as a foundation for the growth of various crypto projects, and the reduced transaction cost will only make the platform more appealing to its users.\n\nTrend 4: The Stablecoin Revolution\n\nWhile most of the attention leading into 2024 has centered around bitcoin, investors want to keep their eyes on stablecoins in the coming year.\n\nIn the latter half of 2023, JP Morgan announced an improved tokenized payment platform, PayPal launched its stablecoin, and Visa expanded its stablecoin settlement capabilities. These events complement the optimistic forecast predicted for stablecoins in 2024, as Bitwise predicts that stablecoins will surpass Visa in terms of settled volume.\n\nIn 2023, we also saw significant advancements in stablecoin regulation. According to Cointelegraph, 25 countries had stablecoin regulations in place last year. The US will likely act on stablecoin regulation in the coming year. Doing so will give the US a mechanism to oversee adoption and ensure its central role in supervising and regulating stablecoin issuers. Additionally, it’ll allow the US to serve as a home for growing businesses that will likely be strategically significant in expanding the role USD and other stablecoins play in the global economy.\n\nTrend 5: On-Chain Innovations for Traditional Finance\n\nWe will also likely see a rise in on-chain innovations in 2024. In 2023, JP Morgan collaborated with a handful of blockchain firms to demonstrate how proof of concept could allow asset managers to tokenize funds on a blockchain of their choice and purchase and rebalance their positions in tokenized assets across multiple chains.\n\nThe demonstration coincides with the traditional financial sector’s growing interest in crypto and blockchain technology. In 2024, we will see more traditional finance companies explore on-chain innovations through partnerships and services as regulatory clarity improves.\n\nTrend 6: AI, Decentralization, and Crypto\n\nIntegrating AI tools into the crypto industry holds immense potential, and we expect to see some of this potential come to fruition in 2024. More companies will use AI algorithms to enhance transaction speed, analyze transaction data, and improve efficiency and security.\n\nAI trading tools will also become more refined and user-friendly, making crypto trading more accessible to many investors. AI will also be integral to real-time sentiment analysis, regulatory compliance, and forecasting. Additionally, we will likely see the rise of AI-powered personal trading assistants capable of learning an individual trader’s risk appetites and preferences to offer customized advice and manage trades.\n\n2024 will also likely see the growth of decentralized prediction markets. While prediction markets have existed for years, crypto takes them to the next level by making them permissionless and borderless and automating functions like making payouts and determining winners and losers. We expect decentralized prediction markets to become a primary venue for sports-based and event-based wagering.\n\nLastly, you can expect financial advisors to allocate to crypto in 2024 increasingly. According to a Bitwise survey, 98% of financial advisors with crypto allocations in client accounts plan to maintain or increase that exposure in 2024.\n\nInvestor Takeaway\n\nAs you can see, many exciting crypto trends are emerging in 2024. Analysts predict that bitcoin will rise in price and prominence, Coinbase’s revenue will grow, Ethereum will establish itself as a powerhouse, and stablecoin adoption will increase.\n\nWe can also expect more financial companies to explore on-chain innovations and AI playing a more prominent role in the crypto world. If you’re currently invested in crypto, we recommend regularly looking at your portfolio to determine how these trends may affect your investments.\n\nAdditionally, subscribe to Bitcoin Market Journal for the latest news for crypto investors!"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQQUFvSlRkbC1HNnJlTXE5bnl3Wl9EdHp4ZHZnVGJUVnFzbXU5azVoRFdJUklWbEt0SV9Fak4yNWNHUlNHOFZNVlE3UHpyX29ZczVVcUV5a09kQzFzT0ZOSUhGQUtfbXEyOFVuOFpuMmVaNU9DVmRXbWNleEpWcjBFQVhEaVh4bVRWaHJITXBXbEt3bmJkMF9jNmtXSzBrbkdqOVhDdHN3VGw3QWZJcnFF0gG8AUFVX3lxTE5lTmd5Q2dod0Yyd0EwSXl6TkU3X3MtUEtWa3JwQWgxVkl6YjFJQ2F4TS1DU1FSYUs5UkQ1Y01Tem9IX0VFZ1lYNTRFLXJvMTRqVUtaSUg1X2s4Q2lMNEJFUVBWVEtFeGp5ZkhOd1VlNTNxUFBmNnd3R1F0X2U5STVUVkRyS3hsV0xIa2tJRTRRRV9TaGZySG92TFZNcFg2eWtiSFZxNmg0Sk96RGJuTE0tQl96clVSXzN3TW9h?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum price and spot Bitcoin ETF Approval - Analytics Insight",
        "content": "Notably, the commission did not name Ethereum as a security in any of its recent lawsuits targeting crypto exchanges. The SEC has also not challenged Ethereum's classification through the ETF registration process with the Commodity Futures Trading Commission (CFTC)."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxObkJCNEhTMGdNcktBRkxObW5xclpBempTWndzaVh1enY2NkE2OHd2ODN4UHNOYnZVbHBoTkJJNXRmODV1QlRpQ3pKS2Y0a1ZnVlpGVEw1RnVyQjY1MklQNExHV1AxSGdkQjZFSGxpaEdVWDFGSDNsbmFMTk10NzZ2WUFtcVRHZ1lXUC1xOVVOZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Solana vs Avalanche: In-Depth Analysis for Game Development - PlayToEarn",
        "content": "The blockchain ecosystem is constantly evolving, with Solana and Avalanche emerging as two of the most intriguing game-creation platforms. This extensive research examines the merits and limitations of each, allowing developers to make an informed decision.\n\nAn Overview of Solana and Avalanche\n\nSolana stands out in the blockchain industry for its novel consensus process, which mixes Proof of History (PoH) with Proof of Stake (PoS). This unique combination enables Solana to handle up to 65,000 transactions per second (TPS). This high throughput is critical for games with real-time player interactions and sophisticated on-chain activities.\n\nAvalanche distinguishes itself through its distinct multi-chain design, which consists of three principal blockchains: the Exchange Chain (X-Chain), Platform Chain (P-Chain), and Contract Chain (C-Chain). This tripartite structure enables a more adaptable and scalable method for managing various sorts of transactions and interactions in the blockchain ecosystem. The C-Chain, in particular, is EVM-compliant, providing a familiar environment for Ethereum developers.\n\nTransactional Speed and Scalability\n\nTransaction speed is critical in the gaming industry, as the player experience can be determined by the responsiveness and fluidity of the game environment. Solana's outstanding ability to execute thousands of transactions per second provides it with a major edge, particularly in games that demand frequent and rapid data updates, such as MMORPGs or competitive multiplayer games.\n\nAvalanche, while not as fast as Solana, is a significant advance over older blockchains like Ethereum, having a capacity of approximately 4,500 TPS. This pace is more than adequate for many game kinds, particularly those that do not have the same high-frequency, real-time interactions as others.\n\nDevelopment Environment and Language Support\n\nThe choice of development environment and programming language has a considerable impact on the ease and speed of game creation. Avalanche's support for Solidity, the primary language for Ethereum smart contracts, makes it an appealing choice for developers familiar with the Ethereum environment. This familiarity can shorten the learning curve and accelerate the development process.\n\nHowever, Solana demands knowledge of Rust and C, which may not be as common among blockchain developers. While some languages provide performance benefits, they may demand additional training or the hire of specialized workers, which could affect the development timeframe and budget.\n\nDecentralization and Security\n\nDecentralization and security are essential for ensuring the integrity and reliability of blockchain-based games. Solana's strategy, while efficient, has encountered issues like as network congestion and occasional downtime, which can degrade the game experience.\n\nAvalanche's multi-chain architecture provides a more distributed approach, which could improve stability and reduce the risk of network congestion. This is especially important for games that cannot tolerate frequent disturbances or slowdowns.\n\nEcosystem and Community Support\n\nA strong and supportive ecology can greatly improve the growth process. Solana has quickly established a robust community, with several projects and resources available to developers. This assistance can be quite beneficial, particularly for novice or independent game developers who rely on community resources and participation.\n\nAvalanche also has a thriving community, notably among developers looking for Ethereum compatibility. The platform's dedication to supporting Ethereum-based projects and assets makes it an intriguing option for developers wishing to get into the vast Ethereum ecosystem.\n\nCost Efficiency\n\nFor many game makers, particularly independents or startups, the cost is an important factor. Solana's low transaction fees make it an appealing platform, especially for games that use microtransactions or demand regular user engagement.\n\nWhile Avalanche charges lower fees than Ethereum, it often costs more than Solana. However, its compatibility with Ethereum and other architectural benefits may make these expenditures worthwhile for particular types of games or development tactics.\n\nGame Types and Use Cases\n\nSolana is ideal for games that require fast transactions and scalability, such as real-time strategy or large-scale multiplayer online games. Its infrastructure is intended to handle the enormous throughput demanded by these games while maintaining performance.\n\nAvalanche, with its EVM compatibility, is suitable for games that incorporate current Ethereum-based assets or for creators transitioning away from Ethereum. Its multi-chain architecture also provides versatility, making it appropriate for a wide range of gaming applications, including those that may benefit from the unique functionalities of its several chains.\n\nConclusion\n\nThe choice between Solana and Avalanche for game development is based on a number of variables, including the game's unique requirements, the developer's expertise with blockchain technology, and the project's overall aims. Solana has unrivalled speed and scalability, making it suitable for high-stakes, real-time gaming. Avalanche, with its unique design and Ethereum interoperability, offers a dynamic and robust platform for a variety of gaming applications.\n\nBoth systems are constantly evolving with new features and upgrades. As the blockchain ecosystem grows, Solana and Avalanche will play important roles in influencing the future of blockchain-based gaming. The choice between them should be based on a detailed examination of each platform's strengths and how they relate to the unique needs of the game and its developers."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE1xcUFJdURHOW9tUmtjV1FDZGFSRnhUZ0tzUVppa2pSM1VLVHRqa3QxaGcxTS1zZUxUTm9CS0xlb1dyZ1U0NDBhVm1kUDRPdGtLTXdfdXRiZUZFcDcySHBTUTFmSjg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "10 Best Crypto to Buy Now in January 2024 - Blockchain Reporter",
        "content": "As we have stepped into the first month of 2024, many are wondering about the best crypto to buy now. The crypto market has proven to be a hotbed of innovation, offering investors new opportunities and challenges alike. Whether you’re a seasoned trader or a novice looking to venture into the exciting realm of digital assets, staying informed about the latest trends and potential investment options is crucial.\n\nIn this article, we embark on a journey to explore the 10 best cryptocurrencies that stand out as promising picks for January 2024. As the crypto market continues to mature and diversify, making informed decisions becomes increasingly important. From established giants to rising stars, each of the selected cryptocurrencies has unique features, potential for growth, and a compelling narrative that makes them noteworthy in the current market.\n\n1. Bitcoin (BTC)\n\nBitcoin, a decentralized peer-to-peer cryptocurrency, was first conceptualized in 2008 and officially launched in early 2009. The pseudonymous creator, Satoshi Nakamoto, remains unidentified to this day. Bitcoin revolutionized the digital currency landscape by introducing the innovative concept of a blockchain, offering a highly secure and fully decentralized form of currency.\n\nIts implementation of Proof-of-Work ensures the integrity of transaction history, making it exceptionally challenging to manipulate or duplicate coin transactions. The network’s security is maintained by miners, who earn BTC as rewards for contributing to the expansion of the Bitcoin blockchain through block additions.\n\nDespite the emergence of numerous cryptocurrencies and blockchain platforms following Bitcoin, BTC continues to maintain its status as the largest cryptocurrency by market capitalization and emerges as the best crypto to buy now. As per recent reports, BlackRock anticipates the approval of its Bitcoin spot ETF application by the SEC on Wednesday, January 10.\n\nThe report further notes that other companies seeking approval for a Bitcoin spot ETF are also optimistic about the outcome. Various companies putting forth their Bitcoin ETF offerings have disclosed the fees they intend to levy on investors. Regarding BTC price performance, Bitcoin has been on an upward trajectory, nearing the $47,000 threshold. Naturally, if the approval of a Bitcoin spot ETF is imminent, heightened volatility in the market can be anticipated.\n\n2. Ethereum (ETH)\n\nEthereum, a blockchain designed to facilitate smart contracts, empowers intricate applications such as decentralized lending protocols and non-fungible tokens (NFTs). Initiated by Vitalik Buterin, the Ethereum project saw the publication of its whitepaper in late 2013, followed by the blockchain’s launch in July 2015.\n\nPresently, Ethereum boasts a dynamic ecosystem of decentralized applications spanning decentralized financial services, NFT marketplaces, publishing platforms, decentralized cryptocurrency exchanges, and beyond. In our view, this diverse landscape positions Ethereum as the best crypto to buy now. ETH serves as the intrinsic asset on the Ethereum blockchain, motivating users to contribute to network security.\n\nInitially employing a Proof-of-Work consensus mechanism, Ethereum transitioned to Proof-of-Stake in September 2022. Developers within the Ethereum community have set January 17, 2024, as the targeted date for launching the Dencun upgrade on the testnet. The chosen testnet for the upgrade is Goerli, scheduled at epoch 231680. Tim Beiko from the Ethereum Foundation indicates that testnet clients supporting the update are expected to release around January 10.\n\nAs of now, the tentative timeline for the Dencun upgrade on the Ethereum mainnet is late February. However, Ethereum developers have not established a definitive deadline yet. This upgrade is set to incorporate five Ethereum Improvement Proposals (EIPs) and marks the first significant enhancement to the Ethereum mainnet since the Shapella upgrade. Launched in April of the current year, Shapella enabled users to withdraw staked ETH.\n\n3. Arbitrum (ARB)\n\nArbitrum is a layer 2 solution built on optimistic rollups technology for the Ethereum network. The primary objective of the Arbitrum platform is to provide users with faster and more cost-effective transactions, all while leveraging the robust security of the Ethereum network. While relatively new in the cryptocurrency domain, the Arbitrum platform has swiftly emerged as a major player in the DeFi ecosystem, boasting one of the highest Total Value Locked (TVL) among blockchains.\n\nArbitrum maintains its dominance in the Ethereum Layer 2 realm, commanding a substantial 49.8% market share, as reported by the layer 2 aggregator L2Beat. The platform’s TVL has experienced a consistent uptrend since mid-October of the previous year, currently standing at $9.79 billion. This makes ARB be listed as one of the best crypto to buy now.\n\nIn a recent development, the Arbitrum project has implemented a feature allowing projects utilizing Arbitrum Orbit custom blockchains to employ custom gas tokens. Notable projects already leveraging custom tokens for their Arbitrum Orbit chains include XAI (Binance Launchpool’s latest project), Caldera, AltLayer, and Conduit.\n\nSimultaneously, the second phase of the Arbitrum Foundation’s grant program has commenced, aiming to offer financial support to projects developing decentralized applications on the Arbitrum platform. These projects encompass areas such as gaming, decentralized physical infrastructure networks (DePIN), NFTs, social media, and beyond. Notably, Arbitrum’s ARB token has demonstrated robust performance, registering a 46.60% gain over the past 30 days.\n\n4. Solana (SOL)\n\nSolana stands out as a smart contracts platform distinguished by its distinctive architecture, enabling it to handle thousands of transactions per second at remarkably low costs. This efficiency is realized through the utilization of a distinctive Proof-of-History algorithm and a Proof-of-Stake consensus mechanism. The native SOL token is recognized for its cost-effectiveness, with users typically paying less than $0.001 per transaction, making it one of the most economical cryptocurrencies for transfers in the market.\n\nDespite experiencing a significant decline in value during the 2022 bear market, Solana maintains one of the most remarkable ecosystems in the cryptocurrency industry and emerges as one of the best crypto to buy now. Solana remains a standout performer in the cryptocurrency market, witnessing a recent 32.59% increase over the past 30 days. This positive momentum aligns with a series of favorable announcements and fundamental developments.\n\nA clear testament to Solana’s current momentum is the substantial trading activity on its decentralized exchanges, amounting to $10.1 billion in the past 7 days. Notably, this figure surpasses the trading volume generated by decentralized exchanges on Ethereum during the same period, which stood at $8.8 billion. This achievement is particularly noteworthy considering that the market capitalization of SOL is approximately eight times smaller than that of ETH.\n\nDiscussing market capitalization, SOL has surpassed XRP, securing the 5th position in the cryptocurrency market rankings. It is currently within reach of BNB, hinting at the possibility of ascending to the 4th spot soon. In parallel developments, Trezor, a prominent hardware cryptocurrency wallet manufacturer, has recently added support for SOL and tokens following Solana’s SPL token standard.\n\n5. XRP\n\nXRP facilitates swift and economical transfers, rendering it well-suited for applications such as remittances. Unlike relying on either Proof-of-Work or Proof-of-Stake, XRP employs the XRP Ledger Consensus Protocol. Participants within the XRP network have the autonomy to select a set of validators they deem trustworthy. Ripple has seamlessly integrated the XRP cryptocurrency into its products, with On-Demand Liquidity (ODL) being a notable example.\n\nCollaborating with cryptocurrency exchanges, ODL utilizes XRP to facilitate efficient cross-border money transfers. XRP has experienced a notable surge lately, with a 26% gain over the past week, reaching its highest price point since July and surpassing BNB in market capitalization. While this uptrend might suggest a potential overextension and the likelihood of a price correction, it’s crucial to note that the recent rally follows several positive developments associated with Ripple and XRP.\n\nIn October, the SEC dropped its claims against key Ripple executives Brad Garlinghouse and Chris Larsen, despite the ongoing legal battle between the regulator and the Ripple company itself. In recent developments, Ripple has entered into a partnership with the National Bank of Georgia to supply the technology supporting a pilot program for a central bank digital currency (CBDC).\n\nThe pilot project, known as Digital Lari, will utilize the Ripple CBDC Platform. Additionally, XRP has gained acknowledgment from the Dubai Financial Services Authority and received approval for utilization within the Dubai International Financial Centre (DIFC). Overall, XRP has been witnessing many positive developments and this makes it one of the best crypto to buy now.\n\n6. BNB\n\nBNB, introduced by the Binance cryptocurrency exchange in 2017, functions in two key capacities. Token holders enjoy exclusive privileges when utilizing Binance, such as reduced trading fees, participation in the exchange’s Launchpad and Launchpool programs, cashback on Binance Visa card transactions, and additional benefits.\n\nAdditionally, the token operates as the native asset on the BNB Chain blockchain. BNB Chain, a derivative of Ethereum, provides users with considerably lower transaction fees and enables developers to seamlessly deploy EVM-compatible decentralized applications. Formerly identified as Binance Coin, BNB has undergone an extensive rebranding.\n\nAs BNB is the sole non-stablecoin cryptocurrency eligible for Launchpool staking, the Launchpool announcements have markedly heightened the demand for BNB. As of the current writing, BNB demonstrates a 25.07% surge in the last 30 days. As we have approached mid-January, BNB has emerged as one of the best crypto to buy now.\n\nThrough Binance Launchpool, individuals have the opportunity to stake their BNB and earn tokens from upcoming blockchain projects. The flexibility to unstake BNB at any time allows users to receive additional tokens as a beneficial incentive while assuming relatively low risk—holding BNB or stablecoins throughout the staking period. It would be prudent to monitor Binance in the upcoming days to determine if they announce another Launchpool or perhaps introduce a new Launchpad program.\n\n7. Cosmos (ATOM)\n\nCosmos is a network specifically crafted to enable seamless interoperability among diverse blockchain platforms. Central to the Cosmos network is the Cosmos Hub, which operates on a Proof-of-Stake blockchain model. The Cosmos Hub is strategically structured to foster connections not only within the Cosmos ecosystem but also with external blockchains such as Bitcoin and Ethereum.\n\nCommunication among the various blockchains within Cosmos is facilitated by a protocol known as IBC (Inter-Blockchain Communication). Cosmos features its native asset called ATOM. Users have the option to stake their ATOM tokens, contributing to the network’s security while earning staking rewards and a share of collected transaction fees. The Cosmos community has endorsed a proposal to limit the inflation rate of the ATOM token to 10%.\n\nPresently, the inflation rate hovers around 14%, with the cap established at 20%. Upon implementation, the proposal will decrease the influx of new ATOM tokens into circulation. However, it will also lead to a reduction in the Annual Percentage Rate (APR) for staking ATOM tokens, decreasing from approximately 19% to around 13.4%.\n\nAs per the proposal, research findings suggest that the Cosmos Hub blockchain is currently overspending on its security measures. The proposal further contends that diminishing the inflation of ATOM could yield favorable impacts on decentralized finance protocols and money markets within the Cosmos ecosystem. All these positive developments make ATOM one of the best crypto to buy now.\n\n8. Litecoin (LTC)\n\nLitecoin, an established cryptocurrency, made its debut in October 2011, ranking among the earliest “altcoins” in the market. Initially, Litecoin closely mirrored Bitcoin, essentially emerging as a modified version of Bitcoin’s codebase. With a maximum coin supply of 84 million, Litecoin’s cap is four times larger than that of Bitcoin. Notably, it targets a block time of 2.5 minutes, making it four times faster than Bitcoin’s block time.\n\nSimilar to Bitcoin, Litecoin employs Proof-of-Work to achieve consensus on its ledger state, but it distinguishes itself by utilizing the scrypt hash function instead of Bitcoin’s SHA-256 hash function. In the preceding months, Litecoin has demonstrated robust performance, with traders strategically amassing LTC holdings in anticipation of new developments.\n\nSince the beginning of the year, LTC has witnessed a remarkable increase of 38% and presently holds the position of the 11th largest digital currency by market capitalization, emerging as one of the best crypto to buy now. In addition, there’s a notable surge in the institutional investor narrative within the crypto sphere.\n\nIn recent weeks, prominent firms like Blackrock and Fidelity, among others, have submitted applications for Bitcoin spot ETFs, indicating a recognition of cryptocurrencies as integral to their long-term strategies. Amid this growing institutional interest, LTC has gained further visibility by being listed on the EDX Markets exchange, one of four cryptocurrencies featured on the platform.\n\n9. Shiba Inu (SHIB)\n\nShiba Inu, a meme cryptocurrency introduced in 2020 by an individual using the pseudonym “Ryoshi,” draws significant inspiration from the Dogecoin (DOGE) cryptocurrency and incorporates the Shiba Inu dog breed in its branding. Diverging from Dogecoin, which operates on its own blockchain, Shiba Inu is created as an ERC-20 token on the Ethereum blockchain.\n\nWhere to Buy Shiba Inu (SHIB)\n\nIn 2021, SHIB experienced a notable surge in popularity, securing the position of the second-largest meme coin by market capitalization, surpassed only by Dogecoin. Furthermore, SHIB has gained prominence as one of the leading penny cryptocurrencies currently. The Shiba Inu project’s team is actively pursuing the acquisition of the .shib Top-Level Domain (TLD).\n\nTLDs, like .com, .org, .net, and .io, play a crucial role in categorizing websites based on factors such as use case and geographical location. Collaborating with the Web3 domain project D3, the Shiba Inu team is actively working towards securing the .shib TLD. The significance of incorporating .shib into the global Domain Name System extends beyond aesthetic website appearances.\n\nSuccessfully acquiring the .shib domain could pave the way for websites, personalized usernames, and even email addresses culminating in .shib. In addition, the SHIB team has been consistently enhancing the Shiba Inu token burning mechanism. This development is expected to inject positive momentum into the SHIB price, making it one of the best crypto to buy now.\n\n10. Uniswap (UNI)\n\nUniswap, a decentralized cryptocurrency exchange, pioneered the AMM (automated market maker) model, revolutionizing the traditional exchange process. By eliminating the requirement for order books, this distinctive design offers a seamless method for directly swapping various tokens on the blockchain without dependence on intermediaries.\n\nUniswap Price Prediction\n\nThe governance of Uniswap lies in the hands of UNI token holders, enabling them to propose and vote on various matters. UNI tokens were distributed to previous users of the Uniswap protocol through an airdrop in 2020, and currently, the token is accessible for acquisition on numerous decentralized and centralized trading platforms.\n\nThe Uniswap protocol achieved a new milestone with a record daily trading volume of $11.84 billion, nearly doubling its previous highest daily volume. This surge occurred as users flocked to trade USDC, the prominent stablecoin that faced challenges following the weekend’s Silicon Valley Bank failure. The significance of this failure to USDC lies in Circle, a major issuer of the stablecoin, revealing that approximately $3.3 billion of the total $40 billion supporting USDC is held at Silicon Valley Bank.\n\nThe substantial increase in trading volume highlights the Uniswap protocol as a vital component of the crypto market infrastructure, demonstrating its capability to efficiently manage significant volumes even in times of market turbulence. All in all, UNI is expected to grow in terms of price and emerge as one of the best crypto to buy now.\n\nConclusion\n\nAs we navigate through January 2024, the crypto market presents a dynamic landscape with various promising options. From established leaders like Bitcoin (BTC) and Ethereum (ETH) to emerging players such as Arbitrum (ARB) and Solana (SOL), each cryptocurrency discussed in this article has its unique strengths and potential for growth.\n\nHowever, it’s essential to note that the crypto market is inherently volatile. In navigating this diverse crypto landscape, investors should conduct thorough research, stay abreast of market developments, and align their decisions with individual risk preferences. The volatility inherent in the crypto market underscores the importance of a cautious and informed approach as we explore the opportunities of 2024.\n\nFrequently Asked Questions (FAQs)"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxQY3EzdXhHeUMtcFkwa3BCMXhZVU5HZFNIQkk1LUJsSk1yMDVDNWpJTmc2SzBFd21LVElsZVFIVDRQT3ZPZTJLSl9aWDRPUG5IZ1VCVlRwYmZiQWFmM0RwV01Dd0FRNjVjanJtdFdPSk1JbWRfLVAtLUhodHZQMlQwTmJiVFpmYTZKMi1qSVVDbHRQaTZjWG55bC00d240YVhNb1FmNlZjOTdTRXBxbHNrVEE1b09ET09VV1lRcWF3RUdMNE5nLS1vOHE4ckh0RC1MR3NxREN4bmYzWEdOYTZkc2dFUWt0NVhNUEItVm1SUGpRQVN1V1k40gH8AUFVX3lxTE42VnY2YU9oak1XV09FVUI5LWVfYjhwcHBmZTF4cUswNEt0TnBjLV9RT1RNSHluVTh6S2RjX0RFWXN0eTFuWG9QaVRwV2VxNTdXUVh3WloyYUxNSk9oUUEtakxLTTRVdzN6cng4X1c1REJLMk5HekVIN0ZoamtRSEZuMnlhZTdUaW82RXNHSzVGS0FYOVU5TUVXVHM3OVk0TzFLMWZ0a2xFOU56bnFrWWFjdFVnLWhWZlFGTkVVVDRyVFNxWllYSFpWQy1Mb25xOGpDMnR3M1lzT0xGVDNSVFE5ZmcyLWw0ZWFLT3F5SVMyaEcweGtaSU1kMWlNUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Rises Above $47,000 For The First Time Since April 2022 - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, managed to touch the $47,000 mark early Tuesday, before settling down at around $46,800 at the time of writing. The coin managed to achieve the $47k high for the first time since April 2022. As was expected, the buildup to the possible approval of BTC spot exchange-traded funds (ETFs) by the US Securities and Exchange Commission (SEC) continues to keep the interests of investors buoyed. Popular altcoins — including the likes of Ethereum (ETH), Ripple (XRP), Litecoin (LTC), Solana (SOL), and Dogecoin (DOGE) — landed in the greens across the board. Memecoin BONK became the biggest gainer of the lot, with a 24-hour jump of over 27 percent.\n\nThe global crypto market cap stood at $1.72 trillion at the time of writing, registering a 24-hour dip of 6.86 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $46,790.79, registering a 24-hour gain of 7.61 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 41.80 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,307.31, marking a 24-hour jump of 5.19 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.06 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour gain of 4.96 percent, as per CoinMarketCap data, currently priced at $0.08034. As per WazirX, Dogecoin price in India stood at Rs 7.20.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour jump of 6.94 percent. At the time of writing, it was trading at $67.06. LTC price in India stood at Rs 5,918.70.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5735, seeing a 24-hour gain of 1.68 percent. As per WazirX, Ripple price stood at Rs 50.68.\n\nSolana (SOL) Price Today\n\nSolana price stood at $101.84, marking a 24-hour jump of 15.83 percent. As per WazirX, SOL price in India stood at Rs 8,999.\n\nTop Crypto Gainers Today (January 9)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nBonk (BONK)\n\nPrice: $0.00001248\n\n24-hour gain: 27.81 percent\n\nAstar (ASTR)\n\nPrice: $0.1495\n\n24-hour gain: 27.28 percent\n\nBitcoin SV (BSV)\n\nPrice: $89.67\n\n24-hour gain: 25.29 percent\n\nStacks (STX)\n\nPrice: $1.99\n\n24-hour gain: 23.75 percent\n\nInternet Computer (ICP)\n\nPrice: $13.13\n\n24-hour gain: 23.27 percent\n\nTop Crypto Losers Today (January 9)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nGMT (GMT)\n\nPrice: $0.3485\n\n24-hour loss: 6.06 percent\n\nMina (MINA)\n\nPrice: $0.9865\n\n24-hour loss: 14.10 percent\n\nInternet Computer (ICP)\n\nPrice: $10.71\n\n24-hour loss: 13.24 percent\n\nGala (GALA)\n\nPrice: $0.02317\n\n24-hour loss: 13.19 percent\n\nConflux (CFX)\n\nPrice: $0.1707\n\n24-hour loss: 12.95 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin has surged beyond the $47,000 mark within the last 24 hours, fueled by growing optimism among investors regarding Bitcoin spot ETFs. The upcoming SEC decision on Bitcoin ETF approval, anticipated this week, has the market eagerly awaiting. BTC has maintained an upward trend for the last five days, marking a 10 percent increase month-to-date and an impressive 173 percent rise year-to-date. If the current price level holds, the next hurdle lies at $49,000.”\n\nCoinSwitch Markets Desk noted, “The crypto market experienced a rise of 5.8 percent in the last 24 hours, resulting in a total market capitalization of $1.8 Trillion. The crypto fear and greed index is highly positive and has jumped by 6 points as compared to yesterday. With just one day to go for SEC’s decision on ARK/21 Share’s Bitcoin ETF, SEC Chief Gary Gensler posted a series of posts on Twitter mentioning the risks associated with cryptocurrency investments. If history is to be repeated this might be considered a positive sign as in Oct 2021 a similar post was made by SEC’s investor education account, a day before the first Bitcoin futures ETF became effective.”\n\nRajagopal Menon, Vice President, WazirX, said, “Bitcoin has surged up to $47,000, indicating a bullish sentiment among investors. This rally has sparked anticipation about the digital currency potentially reaching $48,000 soon. A key catalyst propelling this momentum is the fervent speculation surrounding the potential introduction of a Bitcoin ETF, which has garnered considerable attention and excitement.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin's surge past $47,000 is attributed to expectations that the US SEC will approve a spot bitcoin ETF this week. With a 7 percent daily gain and an 87 percent increase since September 2023, the market is expecting a historic moment after the ETF's approval. Applicants such as BlackRock and Fidelity, which are updating their filings and disclosure fees, have fueled FOMO as analysts predict spot bitcoin ETFs will attract significant demand and legitimacy, easing investor scepticism. Standard Chartered predicts an inflow of $50-100 billion in 2024 and a potential BTC price of $200,000 by 2025. Traders are trying to stop this rise, looking for short-term profits towards $48,500 and the psychological level of $50,000. However, caution prevails with expectations of choppy conditions and potential profit-taking, while the long-term outlook appears bullish, driven by factors such as the Fed tapering cycle, Bitcoin rate halving and growing institutional adoption via new ETFs.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The overall crypto market witnessed a mini rally as the deadline for SEC approval for Bitcoin ETF nears. The total crypto market cap touched the $1.72 trillion mark with Bitcoin and Ethereum jumping by almost 8 percent and 6 percent respectively. Any confirmation of ETF approval by the SEC will push the market higher and it may lead to a market-wide rally. It is important to note that Bitcoin has surged by 10 percent since the beginning of 2024.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOc0dMUmVRMGlYUHBGYnphR2h3VFV1bmNIcVNmcjlTVGZRQXNUUEh3eXVYQXlhV3hZNGhlQ0V2bDNMV3NhRGhJYWlTSmhNZ0dRSUlDVlRwSktiQ3BmNVE3dDg2U1dEN1VOX3ZNQ3RQeG9aWGx3U0kyQmNNOGRLbUtNbFRYeXpLY1lvaUJndDNsV200NER4UjBQYkpFQldqakZVVU040gGoAUFVX3lxTE1VRWZtRzZjdUdFWTRVVnhFNEk1WG5vR2ZhXzdoUnNSa1dfNFpSSEtydnpOY0VzSG1WQ0hzYmJHZFZkUFJKdzUwTmNKX2NFV3hOMDhsWDVBUFgxM3dXRlV6aVRaUllXNDAwbjBwTlBGcW5MM1BlU3ducEdGZVVBNU4xV2gwUU81UHVhNjRSZV80NkNmNEI2SVRFT1hsMTZaRUtiVVFTUXBVXw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Fees Increase, Holders Switch to Meme Moguls (MGLS) and Shiba Inu (SHIB) - Punch Newspapers",
        "content": "Ethereum has yet to scale its Layer-1 architecture, which is causing the network fees to skyrocket and holders to lose faith in the project. Meme Moguls (MGLS) and Shiba Inu (SHIB) are two standout projects picking up pace as holders look for alternative options. Notably, Meme Moguls is predicted to surge 30x as it navigates through a presale of discounted tokens. Let’s take a closer look!\n\nWill Shiba Inu (SHIB) Reach $0.00002000 In 2024?\n\nShiba Inu is a memecoin that rose to fame in 2021 by copying the Dogecoin playbook of using a beloved dog as its mascot. Early buyers of Shiba Inu saw a massive return on their investment, with the coin’s value surging by more than 1000x in less than a year.\n\nWith a current market cap of $5.66B, Shiba Inu isn’t far from achieving its ultimate goal of ‘killing’ Dogecoin ($11.53B market cap) to become the top dog of memecoins. However, Shiba Inu is more than 500x the valuation of Meme Moguls, so the potential gains are less significant.\n\nStill, holders of other cryptos are switching to Shiba Inu due to the consistent innovation from the team. For example,Shiba Inu has just launched an NFT clothing collection with Busta Rhymes. This adds to the decentralized exchange, layer-2 protocol, and multi-coin ecosystem.\n\nPricewise, Shiba Inu is now trading at $0.000009559 after starting the year at $0.000008000. Market analysts note that there is heavy resistance sitting at $0.00001000 to $0.00001100, but if Shiba Inu breaks through, it could potentially reach $0.00002000 by the end of 2024\n\nInvestors Flock to Meme Moguls (MGLS) for Potential 100x Growth\n\nInvestors who missed out on Shiba Inu’s early gains are looking for the next big memecoin opportunity. With its attractive combination of gaming, education, and rewards, Meme Moguls could be just that.\n\nThis play-to-earn platform enables users to step into a realm of virtual meme trading. So get ready to channel your inner Elon Musk and invest your way to the top of this revolutionary new trading virtual platform. The fun is big, but the rewards are bigger!\n\nUsers compete with friends and other players through simulated investing to build the most successful meme portfolio. Those who use the investment strategies to their advantage can turn simulated profits into real cashable returns.\n\nThe MGLS token is the native currency within the Meme Moguls ecosystem. Holding it comes with staking rewards, governance rights, and funds to purchase items from the in-game marketplace.\n\nInvestors can now purchase MGLS tokens at a reduced price of $0.0027 during stage 4 of the Meme Moguls presale. This price will keep increasing in each presale stage, so early investors stand to make the most gains.\n\nMarket experts have pointed out that Meme Moguls distinguishes itself within the saturated memecoin arena through its unique combination of gaming, educational elements, and substantial rewards.\n\nThis unique mix positions Meme Moguls favorably for substantial growth, with analysts suggesting that a 100-fold increase in its value as it enters the broader market is within the realm of possibility.\n\nVisit Meme Moguls\n\nEthereum (ETH)’s Fee Surge: A Roadblock or a Path to Innovation?\n\nAccording todata from Ycharts, Ethereum gas fees have risen 141% in the last year to a current fee of 0.9084 USD/tx at the time of writing. These Ethereum fees rise when the network is congested, making transactions more expensive and slower.\n\nEthereum’s rising fees have caused layer-2 solutions such as Arbitrum to gain popularity as they offer faster and cheaper transactions. However, Ethereum’s modular approach could take some time to come to fruition, and in the meantime, many investors are turning to alternative cryptocurrencies.\n\nThe EIP-4844 upgrade is another potential solution to the high fees on Ethereum, as it uses blobs to make it cheap to send layer-2 data to the mainnet. EIP-4844 is due to go live in the first half of 2024.\n\nPricewise, Ethereum has recently breached the $2,130 resistance level that had held the price down for more than a year. However, the momentum has stopped, and the price is now consolidating beneath the $2,400 level. The potential for aspot Ethereum ETFcould be the next big catalyst as it opens up the market to a broader investor base.\n\nFor more information about the Meme Moguls (MGLS) presale follow the link below:\n\nWebsite: https://mememoguls.com/\n\nTwitter: https://twitter.com/meme_moguls"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPTE5rQkg3NDZiNVRKUHFmUS10Nk9BTVlNSEdRQ1RfczZPclRRdGdNYW9obXBNSFpFVlhSeGRvdUxCd2VSOGZFQUZZSWlRa3VzeTBRZXJxLUhPVjRBUHpXbDBLSS1DUEI5M25mQy1YckpjTHZaNUxGai1pXzhVMXJDV1ozeGdSZUZZdkxpWjdRNUtXSkhhOVRkX3NFZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Climbs 10.12% In Bullish Trade By Investing.com - Investing.com UK",
        "content": "Investing.com - Ethereum was trading at $2,478.51 by 20:47 (20:47 GMT) on the Investing.com Index on Wednesday, up 10.12% on the day. It was the largest one-day percentage gain since November 9, 2023.\n\nThe move upwards pushed Ethereum's market cap up to $294.87B, or 17.19% of the total cryptocurrency market cap. At its highest, Ethereum's market cap was $569.58B.\n\nEthereum had traded in a range of $2,342.21 to $2,480.04 in the previous twenty-four hours.\n\nOver the past seven days, Ethereum has seen a rise in value, as it gained 10.36%. The volume of Ethereum traded in the twenty-four hours to time of writing was $25.32B or 24.56% of the total volume of all cryptocurrencies. It has traded in a range of $2,167.4207 to $2,480.0354 in the past 7 days.\n\nAt its current price, Ethereum is still down 49.04% from its all-time high of $4,864.06 set on November 10, 2021.\n\nElsewhere in cryptocurrency trading\n\nBitcoin was last at $45,849.8 on the Investing.com Index, down 2.27% on the day.\n\nTether USDt was trading at $1.0006 on the Investing.com Index, a gain of 0.01%.\n\nBitcoin's market cap was last at $900.73B or 52.52% of the total cryptocurrency market cap, while Tether USDt's market cap totaled $94.38B or 5.50% of the total cryptocurrency market value."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPNGRjczFVNVFpajdUeUYtQUdNZnRFSDVocmJ3OEkyWTgtYzA3UVJYSXpIUHQyVXgzNC1QZk94aHpFS25NaEhCcjAxZjBZb2FoR1JnclVmNWxHSzZQUlZ4SkNoakctMEVaUl9qc0FCRXFLcmI4bUswR2hwemNkeUdmd2g4NlV3aHBvY2ZUd1ZLSE9PS3JRSXNfWGkzb0hGMFlsT0c1MXMzYW00clE3TDA2dC1rY0_SAboBQVVfeXFMT3c4cmMxVXc4dGVXX3FyWlhyLUl4ejdUWWlFN25BRk43QXdpZEQ1eGtfWTVZWGg0TnlJNFJ3aWtCM29tUVlRTEg5WkZ6MFRadmdFYkw3TmNUR1p2MVh0UUVjNC1NbUJHNUxUR3oyRURiMVJOQ2x3Z2R1V0VlZFdaUGFDR2VxRzRRaXA2M29OOU5zVURYZllqQlZWbXMxQS01SjRBLWpmd2ZzS2pObF9rRW10R09vQzZiRTZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ripple Massive 96x Price Prediction, Ethereum Next Price Target Revealed – Meme Moguls 80x in Q4 - Punch Newspapers",
        "content": "Ethereum (ETH) and Ripple (XRP) are both bullish on the charts. ETH specifically faced an upward momentum fueled by an increase in its usage and trading volume. XRP, on the other hand, is projected to experience gigantic growth soon by major crypto analyst EGRAG CRYPTO. Alongside them, Meme Moguls (MGLS) is also making significant progress. We will analyze the on-chart data for both to determine the best crypto to invest in.\n\nEthereum (ETH) Stays Above $2,200 – Price to Reach $3,829.22 by the End of Q4\n\nEthereum (ETH)’s indicators are in a mixed position, with the cryptocurrency’s recent rallies putting it in a position where it could correct. Yet, other data suggests that it could also see another rally. The 30-day average has been well above the 200-day average for multiple months. This implies that the Ethereum crypto was overbought by traders in recent weeks.\n\nAt the same time, the RSI for the crypto is around 50, indicating neutral territory for the Ethereum price. Holders are aware that ETH’s support level has risen and held up consistently since November of 2023. Even if ETH struggles in the short term, it is highly unlikely that it can fall significantly.\n\nDuring the past week, the crypto traded between $2,187.29 and $2,434.45 and has consistently remained above $2,200. According to the Ethereum price prediction, it can rise to $3,829.22 by the end of Q4 2024.\n\nRipple (XRP) to Rally 96X According to EGRAG CRYPTO\n\nRipple (XRP) remains the subject of bullish projections. The X (Twitter) user EGRAG CRYPTO, a notable analyst, expects the price to surge in the upcoming sessions. The analyst outlined Ripple crypto’s 20X rally in 2021 when the overall industry was booming. He noted how progress occurred despite the lawsuit they had with the US Securities and Exchange Commission (SEC). The company secured three vital court victories.\n\nAccording to the analyst, the Ripple price could potentially grow between $5.88 and $16. This is a bullish Ripple price prediction, but the analyst also forecasted further growth. The crypto could rise an incredible 96X from the cycle bottom, which would result in a value of $27.\n\nMeme Moguls (MGLS) to Introduce Virtual Trading and a P2E Ecosystem\n\nMeme Moguls (MGLS) is an upcoming P2E meme-oriented ecosystem aimed at helping investors and traders enhance their strategies while also improving the performance of their portfolios. This will be completed through an introduction of a platform where they can access real-time market simulations.\n\nPlayers will get immersed in a fantasy meme-trading world. Here, they can create custom avatars and climb their way up leaderboards. They can reach Moguls status to get the highest rewards. They can also begin trading or selling character NFTs on the market alongside other rare NFT items and mined materials.\n\nThere is also Moguls Land, which is the dedicated Metaverse in the ecosystem. Here, each player can join liquidity pools or mine tokens. All they need to do to accumulate more MGLS is to stake it in the pool, which will result in fixed passive capital gains. These aspects make it the best crypto to invest in.\n\nSummary\n\nEthereum and Ripple both have growth potential, but Meme Moguls has seen a massive rally. Its presale has reached Stage 4, where MGLS trades at $0.0027. This blockchain ICO has been growing at a rapid speed, analysts project an 80x price jump.\n\nVisit Meme Moguls"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOQmR1MW50M0dZMFZ1eTdHNGYwUnBmcTU5WXZxWUQxVTY4THpNUzVRcjkxVThPYXI3R3Y2aldwNG0yQVhfejJSR0pPUlBWR1ZodXY4TDhyckJpQ3JuOTlJdnhjRHh1eXd6LWUtWjVFZnphRzlycFI4a0FZMVpMU0hrbTdFd25TWXNZSGtEV3RiaFVMR0x5WHpFUEdidER0YUJ3RjZOR21MZi0zYzRVTmY2a3ItQVJwLUhmR2M2aXczZ9IBzAFBVV95cUxNTG1uWDNrSzZINWlxanF1VWttdXRIYUt3Q19mWTRHeEc1RlQwdFdQZ20zVnlCSnZQVm1rMUx5VGJWYjM3aXA5bGNaa01EczZoSG5CMV9VU2hLS0NpTktLM3loUHo4a3RabllyTzUteUZjdFVnZ215b09nRl9XdkE5LWdEeGRsZjdQMFd0MHRkb28yMzJILWtFcHhJd3VMVXdNci1GNnR5ZTJCTUtNNUZ3ekFVWkdkZTZJWFZrNzdxU05jQXRsUVhZYzgtblc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "How To Get zkSync Airdrop: Free Crypto Airdrop Guide 2024 - Analytics Insight",
        "content": "zkSync airdrop has emerged as one of the hottest and the most sought-after crypto airdrops of 2024. Users are flocking to the Ethereum L2 to earn points for a potential free share in the zkSync token which is set to release later this year. This article is going to be a comprehensive guide on how to maximize your eligibility chances for free tokens."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNMTIwcTFTeW80aWs0dEI4TGo5OVNoTk5ZNzA0Q0dlczNJUTNCZkMzM2Z5dDctSmFzdjJDakxCTGRzdzAwR3hSOC1KSmRFejlldk9mVDVjdmU4YksycFdSSzl3QjBhU0F3UlhJYXFPakRCNGh0d0pDbXhYVHktTC1JLW9hQnctdGhzc1p3VERJZVZZQXI0LWdmeGtrS25sYy1K0gGmAUFVX3lxTE9MMWhyTU5zam5IUmxuYkZSMXZvYUpqWTkySjAzWlRtdzh0Y3hHNThYMGpDaDBOSG9xRlFBNDBqVjl6ZkVpSkI0T1BfaHgyTTI3eTROdmUyVlpwNUtXYUp1NWxjWUx5TnAwYU1lajRjZHJRczNacGR3Z0w3RWswWHg2dEY4UVI1eFRjN0FEOW9oLW9RTnk4dHFCLWN0d1lQLTliSUhPS2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Classic (ETC) Explodes Over 50% In Massive Price Jump – Here’s Why - NewsBTC",
        "content": "The long-awaited arrival of a Bitcoin spot ETF in the US has sparked a surge in cryptocurrency prices, with Ethereum Classic leading the charge among altcoins.\n\nAfter languishing around $20 for months, Ethereum Classic (ETC) has skyrocketed over 50% in the past seven days, currently hovering around $29.45 and just a breath away from reclaiming the $30 mark.\n\nThis impressive rally comes amidst a broader market upswing triggered by the Securities and Exchange Commission’s (SEC) historic approval of the Bitcoin Trust ETF on January 10th, 2024.\n\nRelated Reading\n\nETC price action in the last week. Source: Coingecko\n\nEthereum Classic Surge: A Combination Of Factors\n\nETF-fueled optimism: The approval of the Bitcoin spot ETF signifies increased institutional interest in the crypto market, a development that traditionally benefits the entire ecosystem, including altcoins like ETC. This optimism is reflected in the strong performance of other major cryptocurrencies, with Ethereum witnessing a 10% climb and briefly hitting a 20-month high above $2,600.\n\nEthereum Classic’s unique appeal: Compared to its Ethereum counterpart, Ethereum Classic boasts a smaller market cap and lower transaction fees, potentially making it a more attractive option for traders seeking higher returns and cheaper on-chain activity. Its recent network upgrades have also bolstered confidence in its technological capabilities.\n\nSpillover effect and community hype: The Bitcoin ETF approval has undoubtedly fueled a general sense of bullishness across the crypto landscape, influencing investor sentiment towards altcoins with perceived potential. Additionally, the strong community support and active development around Ethereum Classic further contribute to its upward momentum.\n\nETC market cap currently at $4.248 billion. Chart: TradingView.com\n\nETC Trading Volume Soars\n\nThe surge isn’t just limited to price. Ethereum Classic’s trading volume has also soared by a staggering 276% in the past 24 hours, reaching a volume of $1.8 billion.\n\nThis increase in trading activity further validates the market’s interest in Ethereum Classic and potentially indicates continued upward pressure on its price.\n\nHowever, it’s crucial to remember that the crypto market remains highly volatile. While the Bitcoin spot ETF approval and Ethereum Classic’s recent performance are positive indicators, investors should conduct thorough research and consider both the potential benefits and risks before making any investment decisions.\n\nRelated Reading\n\nWith its strong community, technological advancements, and now, the tailwinds of the Bitcoin ETF approval, Ethereum Classic has positioned itself as a frontrunner in the current altcoin rally.\n\nWhether it can sustain its momentum and break through the $30 barrier remains to be seen, but its recent performance signals a renewed level of enthusiasm for this resilient blockchain project.\n\nFeatured image from Shutterstock"
    }
]