[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE1WSWZKQ3VacVRDY0JsRTFHWnRNLXg1NEMyWENOY3MzN3N3dEN0ZnJaeUkzWFhsMzJGRzNrREF4UjExdlY4TlBaZjNoQUVQdlFhTUhiS2k5X3JveTlIVnZsRUtLSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum: What It Is and How It Works - NerdWallet",
        "content": "NerdWallet, Inc. is an independent publisher and comparison service, not an investment advisor. Its articles, interactive tools and other content are provided to you for free, as self-help tools and for informational purposes only. They are not intended to provide investment advice. NerdWallet does not and cannot guarantee the accuracy or applicability of any information in regard to your individual circumstances. Examples are hypothetical, and we encourage you to seek personalized advice from qualified professionals regarding specific investment issues. Our estimates are based on past market performance, and past performance is not a guarantee of future performance.\n\nWe believe everyone should be able to make financial decisions with confidence. And while our site doesn’t feature every company or financial product available on the market, we’re proud that the guidance we offer, the information we provide and the tools we create are objective, independent, straightforward — and free.\n\nSo how do we make money? Our partners compensate us. This may influence which products we review and write about (and where those products appear on the site), but it in no way affects our recommendations or advice, which are grounded in thousands of hours of research. Our partners cannot pay us to guarantee favorable reviews of their products or services. Here is a list of our partners."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPVTNoX21wNGNERjBNQldsOUQ5cWpDTF9OOVd6cTdzakpQNlhmR1dLTkpEdGkxaTZTekVqNlZLcW1jQkp6UU5rcTJTLTNPSm5zQm93bTVhby1kRW9WYXBqdkpaRWJ6Z0s0WlZ0MmxVYUZmTFRxMFpFbVNDRGE4R3ZCTjVzWkE2d3VMUHYyWlNTRUVJSHhHbmVWeHNWYWEtcmxoRG8w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Experts see two factors driving Ethereum to $10,000 in catch-up rally with Bitcoin - DLNews",
        "content": "Bitcoin's all-time high cranks up pressure on Ether to follow suit.\n\nInvestors are counting on Ether ETFs to spur gains.\n\nAn Ethereum upgrade is on the way.\n\nBitcoin just hit a new high, and the wider crypto market is now worth more than $2.6 trillion.\n\nEthereum’s not been lost in the bullish run-up, rallying more than 65% since the beginning of the year.\n\nIt’s impressive, but sitting at $3,809 in late afternoon trading UK time Wednesday, Ether is still 21% below its all-time high of $4,800.\n\nWhat gives?\n\nIn a word, time.\n\nSzymon Sypniewicz, CEO of crypto onboarding solution Ramp, said it may simply take longer for the market to understand Ethereum’s complexity, especially “compared to the much simpler idea of Bitcoin as digital gold.”\n\nNew financial system\n\nEthereum lovers have long argued the second most valuable blockchain network will be the infrastructure of an entirely new financial system.\n\nThrough smart contracts, supporters point to a future with more transparent markets, tokenised versions of popular funds, and faster settlement times.\n\nJoin the community to get our latest stories and updates\n\nOthers say it’s only a matter of time before institutional investors take bigger positions in Ether. And the advent of Bitcoin ETFs may be increasing their appetite.\n\n“ETH hasn’t hit its institutionalised hype cycle yet,” like Bitcoin has, Robby Greenfield, co-founder and CEO of payments protocol Umoja Labs, told DL News. “Thus, the vast majority of new inflows from the BTC ETF will naturally lead toward greater buy pressure, along with the upcoming BTC halving,”\n\nGreenfield predicted that Ethereum will close the gap with Bitcoin in terms of its gains.\n\nHe told DL News the cryptocurrency should “clear $10,000 this year.”\n\nGreenfield added that an Ethereum ETF approval would undoubtedly help drive up its value. He joins a host of industry players counting on the US Securities and Exchange Commission to follow up its January approval of Bitcoin ETFs with a green light for Ether.\n\n‘It’ll be good for investors to have access to ETH in a way that’s easy and familiar.’ — Eugene Cheung, Bybit\n\n“An ETH ETF should naturally be approved,” Eugene Cheung, Bybit’s head of institutions, told DL News. “It’ll be good for investors to have access to ETH — one of the world’s premier risk assets — in a way that’s easy and familiar.”\n\nMaybe so, but the SEC, and especially its hard-charging chair, Gary Gensler, may take a different approach to an Ether ETF.\n\nGensler acknowledged reluctantly clearing the way for Bitcoin after the commission lost a court ruling in its effort to stop Grayscale from converting its BTC trust into an ETF.\n\nThere is no such court case driving decision-making on an ETH ETF.\n\nThe SEC is expected to weigh in on a slew of different Ethereum ETF applicants, including those from BlackRock and Fidelity, in May.\n\nCrypto prediction market Polymarket puts the odds of approval at 43%. JPMorgan’s latest analysis gives it a 50% chance.\n\nBloomberg ETF analyst Eric Balchunas called an Ethereum ETF “small potatoes,” characterising it as “the opening act coming on after the headliner.”\n\nEthereum upgrade\n\nJPMorgan does, however, point to another catalyst for Ethereum: the Dencun upgrade, which is designed to help the network scale up by cutting costs for various rollup solutions on the market.\n\nRollups batch crypto transactions, be they simple swaps or borrowing activity, into much smaller chunks of data.\n\nThese small chunks are then settled on Ethereum, reducing the overall data footprint on the network.\n\nBybit’s Cheung says this is good news for Ethereum supporters.\n\n“With layer 2 solutions built on top of Ethereum, the blockchain is becoming the settlement layer for a whole new digital infrastructure encompassing gaming, trading, and investing,” he told DL News.\n\n“The value of all of this will tend to accrue to the ETH asset.”\n\nUnlike Bitcoin’s automated halving event, Ethereum’s Dencun upgrade does not regulate the cryptocurrency’s scarcity. In contrast to Bitcoin’s pre-programmed 21 million token cap, Ethereum’s supply is infinite.\n\nNot a sure thing\n\nStill, the upgrade’s success isn’t a sure thing for the asset’s price performance.\n\nThe layer 1 competition is heating up, and one exec says Ethereum may even be overtaken this cycle.\n\n“Given the network’s poor performance during periods of high activity and the proliferation of alternative layer 1 protocols that have optimised for Ethereum’s shortcomings, Ethereum’s position as the second-ranked cryptocurrency is not necessarily guaranteed this cycle,” CMO of crypto exchange VALR, Ben Caselin, told DL News.\n\nLiam Kelly is DL News’ Berlin correspondent. Contact him at liam@dlnews.com."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiV0FVX3lxTE5DdnRiVjBGbzZ0bTJSMjVwTTZhS1luMGRaQnRZUldNNGQ3bWtXcnA5ZVBsMnh5bjlQSjNXR211Y28xYjdQNlZGVy1ZeC1TeUstczM3bGoxa9IBX0FVX3lxTE0zRTBpNTRreWduRV9pSVFZQ2gyZTFNTGVRUjRncldQaEdiOUR1Z0V1Q3BSRmoxdHdHSGFZWGFjSkowS09lV1RZcnlpU3o4dE9odllpY2hpSTZCSnJPcExV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Hits $3,800 for First Time Since December 2021 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum jumped over $3,800 Wednesday morning, hitting its highest price since the end of 2021.\n\nAt time of publication, the Ethereum price has pulled back slightly, trading at $3,796.53, up 2.8% on the day, per data from CoinGecko. The cryptocurrency last traded over $3,800 on December 29, 2021, according to the price tracking site.\n\nThe cryptocurrency's price surge comes as staked Ethereum hit over $116 billion earlier this week, up 9% since the start of the year. Today, 31,320,207 ETH are currently staked, worth over $119 billion at ETH's current price, per data from beaconcha.in.\n\nAD\n\nAD\n\nEthereum's positive momentum also comes amid anticipation for the network's Dencun upgrade, set to be pushed to mainnet on March 13. Dencun will introduce proto-danksharding to Ethereum, a measure designed to reduce transaction costs for layer-2 blockchains, addressing issues around scalability.\n\nFollowing its full implementation, Dencun is expected to enable Ethereum to cheaply handle more than 100,000 transactions per second. According to Terence Tsao, a developer at Offchain Labs, which builds Arbitrum, Dencun should cause gas fees on layer-2 networks to drop by as much as 75%, potentially enabling crypto companies to cover users' gas costs on layer-2 networks.\n\nDencun also introduces \"blobs,\" which temporarily compress transaction data off-chain, in order to minimize storage and processing costs on Ethereum. “We will be able to handle data much more efficiently, and in a cheaper way as well,” Ethereum core developer Mario Havel told Decrypt last year.\n\nAnother feature set to arrive with the Dencun upgrade is EIP-7044, an Ethereum Improvement Proposal that enables ETH validators and stakers to store instructions for when to exit their position. That means validators could automatically exit their position if their node falls inactive, thus avoiding mounting fines for failing to process transactions.\n\nEdited by Stacy Elliott.\n\nAD\n\nAD"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOVnRmLUVnZ2pzbklybmV4TXpMQWM2UlJCUFQ5a1JxZFJ6SkJmd0owSjYzTWNfQ1psbUFBMUN4VE9yMVRBNGJIMVJjdFpuTXRyRTJ0VmRNNFlISEwxU1l4UDZYYUNvWUh6NmxJZzhzdThyRTBjRjFLZkUwMWNUSFdKSWprQkMza2NISHgtM1hJcWw2eGF5VXBDMEhvaVhyY0lOWENwN3hEMFVQdkVVM2RZRERDd1RLTEN6?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum is set to outperform Bitcoin as the spot ETH ETF narrative comes into play, analysts say - crypto.news",
        "content": "Analysts at QCP Capital note that despite Bitcoin’s quick drop to $59,000, funding is back to sensible levels and the more likely scenario is the outperformance of the ETH/BTC pair.\n\nIn a volatile overnight session, Bitcoin (BTC) quickly set a new all-time high of $69,400 only to undergo a rapid decline, plummeting to $59,200 within a matter of a few hours. This steep downturn resulted in the liquidation of over $1 billion worth of leveraged long positions on Binance alone.\n\nHowever, as noted by analysts at QCP Capital, the market quickly rebounded as the dip was aggressively bought up, with the $60,000 level demonstrating robust support. According to analysts, funding rates have returned to “sensible levels,” hovering around 30% annually on Binance. Therefore, analysts at QCP Capital anticipate Ethereum (ETH) to outperform Bitcoin, noting that the narrative surrounding a spot Ethereum exchange-traded fund (ETF) gains traction.\n\n“[…] the likely scenario is the outperformance of ETHBTC as the ETH spot ETF narrative comes into play.” QCP Capital\n\nYou might also like: As Ethereum’s Dencun upgrade nears, here is all you need to know\n\nDespite the leverage unwinding, term futures are still trading at a significant premium to spot prices, analysts emphasized, adding there has been a surge in client activity aimed at selling the spot-forward spread, particularly for contracts expiring between September and December this year, allowing investors to secure risk-free yields for the year.\n\nTop cryptocurrencies by market cap from their all-time highs | Source: CoinGecko\n\nAs of press time, Ethereum remains significantly distant from its all-time high compared to Bitcoin, suggesting a potential for rapid value appreciation. While Bitcoin trails only 4.3% from its historical peak reached on Mar. 5, Ethereum lags behind its 2021 record by over 20%, according to CoinGecko data.\n\nAs the crypto landscape evolves, Wall Street behemoths are intensifying efforts to introduce more spot crypto ETFs, following the U.S. Securities and Exchange Commission’s (SEC) approval of all applications for spot Bitcoin ETFs earlier in January. Reports indicate ongoing discussions between the SEC and Ethereum ETF applicants, with decisions on spot Ethereum ETFs delayed until May at the earliest. VanEck’s filing, in particular, awaits a response by May 23, alongside applications from BlackRock, Franklin Templeton Grayscale, and Invesco Galaxy."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNeHM0OEZfa1Y3Q2xrdnRpaE5LNFh2d19VREgxVG1UcTdTaHFsS1Q1MV9ET1VXX24ycU4tYUN6SW80YWdaLXBIQXNxNHV3MHNqbUxOWTBZWEx2cnctT1F6QmpEUzNjTUNCY1RMT0YtU2RqTkxnYVNzVFROTGdfNUhoUldITklkSWM2S2tkRTJyeldpVkhVMFBEcGFKel9CYWRhZDZpMzNLS01pRklzT3RYNHJ6UnE3UdIBuwFBVV95cUxPRWJ0cWF5WEczckZkQ194UWlLMk4yWG5iaGNVMlBZMlhtVm1GQlY5dVNxVzdmSWNaeHVxRktGaklwLWJFR01sQ2JKYWVBQ2JTZjdCZ0VaUUpNTEw4eUZ6c3BCNHpMWk80cllFOEZ5RC1xVGllNEIwdTUwaWh4NGdWc3VldjNJWG9JeUZWUXBZeTZUdlVYUkU3R2lRVUJoWGgzOHp3MHZST0l2WHdHR0thTkNBRXhreFhtcXdj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Fees Set to Drop for Arbitrum, Polygon, Starknet, Base. But How Much? - CoinDesk",
        "content": "StarkWare CEO Eli Ben-Sasson said that blobs will significantly reduce, but it depends on the prices of the blobs that fill up. Ben-Sasson told CoinDesk that “90% of the cost that users are paying for transactions are related to the cost of data on the layer 1. So it means that if now this data gets added into blobs, and let's say the price is 10x lower, then 90% of the cost goes down by a factor of 10.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPcWRKWHhqelZfSVFMRXZ2WXBVdjdGZE1MNlZUSkhZZjkwbVk3b3VzaUtYUlpubWdpNnNnbm5saXJmdjk2SVpFdGM4aXgzS05JTFVXMUl3WF9mQlRUdFB1bnp3ZkluU1JOOEk5cGlBUC1Rc1ZQU1psSThoT0taTEQ5VWtxYW1iekI2VEl3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "SEC seeks public comments on Ethereum ETF, raises concerns on proof of stake - Crypto Briefing",
        "content": "Public comments are due in the next 21 days, and rebuttals are due in 35 days.\n\nShare this article\n\nThe Securities and Exchange Commission (SEC) has announced in a filing submitted Monday that it will be extending its decision timeline on BlackRock’s spot Ethereum exchange-traded fund (ETF) proposal. Aside from Blackrock, the regulator has also delayed its decision on another ETF proposal by crypto firm Fidelity.\n\nThe SEC can delay decisions up to three times before arriving at a final decision, with the first deadline in May. According to the filing, the SEC is opening the approval of Ethereum ETFs to public comments to “address the sufficiency” of the proposal.\n\nIn particular, the SEC has raised concerns on the “nature of the underlying assets” held by the iShares Ethereum Trust. Comments for both Fidelity and BlackRock are due in the next 21 days, and rebuttals are due in 35 days.\n\nThe SEC framed its concerns on the matter with the following question:\n\n“Are there particular features related to ether and its ecosystem, including its proof of stake consensus mechanism and concentration of control or influence by a few individuals or entities, that raise unique concerns about ether’s susceptibility to fraud and manipulations?”\n\nBoth BlackRock and Fidelity filed for their spot Ethereum ETFs in November last year, with other firms like Franklin Templeton, Ark 21Shares, VanEck, and Grayscale soon following suit. However, the SEC announced a delay last January and extended the initial 45-day review period, citing more time to read the proposals. The SEC had also approved ETFs on the same day, except this was for Bitcoin.\n\nSEC Chair Gensler was also quick to temper potential criticisms and clarify that the SEC has no ulterior motives and that the delays “shouldn’t be read to be anything other than that.”\n\nAn ETF is a pooled investment security that can be purchased or sold in the same manner as an individual stock, though it differs from a mutual fund in that the latter only trades once a day after market close.\n\nAnalysts and market commentators are ambivalent about when the final decision will be handed and whether BlackRock’s ETF will get the green light. The policy environment in the United States could affect the decision and the relative success of crypto-based ETFs. BlackRock’s Bitcoin ETF currently holds a record-breaking $10 billion in assets under management.\n\nMeanwhile, enthusiasm for the potential approval of Ethereum ETFs has spurred the price of ETH, which is currently up 7.1% at the $3,700 level, according to data from CoinGecko."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQejM5VENWc281WHY2cmdnVkxYQ2JjWnlrTTYtLUtxSzg2OWNlbUtoaFJiZjd2WnZEQzlVMmJaZkNXQ2xadnY1dW9kSlFPbGc5UmlGVlJ4cGFiRWh5cWl2SmtqeFdPcmZRM2xIYWdxZXhJeEV5SkVyeEpVanpaTm9pN01sX1ZXbFMtX3B3b3Y3djhFRm1HRXZzZl83b3EzVWd6Y204cXpJQkpseFFNYld1N2NCLWRmVk9aYVJya2tiOHJLOUZQTTRyU25fZGNNTl9hYkRfSEEzWdIB3AFBVV95cUxOalVXVVJLVWxUMGlwS0V2OTdnUjlvdDU5NFR2bm1IMEFMT2JLOFBnM2t3LWd6TllwQmIxbDhFNGFFYVZzU3d0OEFCaWFGb0N1c3BMaDlZenpvMUp1UnVudnRma3NEUXdaRzI4eGhQcjZFQ0RINmVKVURpaW1VMzVuQllSSVFhc1VSUWJLUHhjZFNFNFY4NXJ1NVRzRHppcDE2NmtrT3BkNVFUMUlYNHh2ZzdhaVJ4LURsYUk1RmRPUFN6V08zVnUyeERjTXJPWjBaRzhRdENIWTBpbWpn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum surges past $3,800, hits highest level since January 2022 - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nIn a notable surge within the cryptocurrency market, Ethereum (ETH) has surpassed the $3,800 mark, reaching a peak above $3,860 in Wednesday's trade, marking its highest level since January 2022.Meanwhile, at 4.20 pm, the crypto token was trading 4% higher at $3,830. It has also gained nearly 65% in the last one month, and over 145% in the past one year.\"This rally is fueled by a combination of factors, including Ethereum's shift to a proof-of-stake consensus model, which has made its token supply deflationary. Additionally, the amount of ether locked up in staking pools, DeFi smart contracts and layer-2s is also an important factor,\" said Sumit Gupta, Co-Founder of CoinDCX.The rise in Ethereum also comes amid speculation of the launch of an Ethereum ETF following the recent launch of a Bitcoin ETF However, according to a regulatory filing on Monday, the U.S. Securities and Exchange Commission (SEC) further delayed its decision on an application by asset manager BlackRock for its spot Ethereum exchange-traded fund.BlackRock in November last year filed its application for its iShares Ethereum Trust, which will be listed on the Nasdaq if approved.The SEC in January delayed its decision on BlackRock's application after it gave the green light to several Bitcoin ETFs.A spot crypto ETF tracks the market price of the underlying digital asset, giving investors exposure to the token without having to buy the currency.Meanwhile, in today's trade, Bitcoin also touched new all-time highs for the first time in over two years before experiencing a sharp decline as traders decided to cash out some profits.Bitcoin hit a high of $69,170, topping November 2021's all-time peak of $68,999.99. Investor interest has increased since the Securities and Exchange Commission approved 11 spot bitcoin ETFs in late January. It then reversed course and was recently down around 0.5% at $66,658 at 4:17 pm IST."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE1zTzNodTVYTDNMM2FvVnhHa2F1eW9HUUtGbFdzcVdwQk5GMW5WbFpoeUo5RThYREtHb3gzc0xfZ0RtYW9ZaGpLSDV3OG1zWk4yb1BCSjU4SXg1RmwyNnJjRlVIb3RCQi01Um9mdUtwa04xZ3IwSTl3dnZIeVF5QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Beyond ETH: 3 Cryptos That Are a Better Bet Than Ethereum - Yahoo Finance",
        "content": "Over the last 15 years, cryptocurrencies have existed. And as long as these digital assets have proliferated, they’ve done so with volatility.\n\nThe entire market capitalization of the crypto sector peaked right around $3 trillion during the height of the last hype-driven mania in 2021. However, a so-called ‘crypto winter’ ensued in the last couple years, with the sector bottoming out around $900 billion. At the time of writing, the entire market is moving quickly toward a $2.5 trillion valuation, with plenty of momentum to break through to new highs.\n\nEthereum (ETH-USD) is certainly one of the top tokens leading the way higher, alongside the king of crypto Bitcoin (BTC-USD). Yet, there could be other more lucrative options in this sector for long-term investors seeking even greater upside. Let’s dive into three such tokens.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nSolana (SOL-USD)\n\nSolana Crypto currency Gold Solana SOL. Close up on white background Blockchain concept 3d rendering\n\nSource: pasit chomying / Shutterstock.com\n\nA well-known “Ethereum Killer,” Solana (SOL-USD) might be an excellent option to consider instead of Ethereum.\n\nThis proof-of-stake network is built on an intriguing proof-of-history consensus mechanism. Essentially, that means Solana uses time stamps to speed up the sorting of transactions. Doing so allows the network to process multiples of the typical order flow at a fraction of the cost.\n\nTherefore, this speed and cost advantage are reasons most investors like Solana. The network has become synonymous with the NFT space, given the fact that many transactions are for smaller dollar amounts. Ethereum’s network, which can charge hefty gas fees for its usage, isn’t as well-suited for such purposes. Hence, the real-world utility Solana has been able to generate.\n\nAdditionally, while Ethereum focuses more on gradual upgrades, Solana is known for innovative solutions such as their Saga phone and successful crypto strategies. These high-growth strategies make this token more compelling for those seeking outsized gains, at least during this bull market rally.\n\nAvalanche (AVAX-USD)\n\nAvalanche (AVAX-USD) crypto coins on a black background\n\nSource: Skorzewiak / Shutterstock\n\nIt was only in 2020 when Ava Labs launched Avalanche (AVAX-USD). This new blockchain offers seamless automated contract executions through its smart contract support. Also, Avalanche focuses on enhancing scalability and usability. This allows the blockchain to handle thousands of transactions per second.\n\nOne of the best features investors love about Avalanche compared to Ethereum is its relative cost-effectiveness. Like Solana, Avalanche offers transaction fees that are a fraction of the cost, which is rare for other blockchains to offer.\n\nStory continues\n\nAs of the time of writing, Avalanche is the 10th-largest crypto based on market capitalization. AVAX’s consensus protocol facilitates node collaboration, ensuring transaction processing. It boosts security by randomly verifying validators’ confirmations, enhancing transaction legitimacy. Additionally, its three-blockchain structure resolves common blockchain issues, offering scalability, interoperability, and user-friendliness. This sets Avalanche apart in the blockchain sector and is the core thesis for owning this token for the long-term.\n\nCardano (ADA-USD)\n\nA concept token for Cardano with a trading chart in the background.\n\nSource: Shutterstock\n\nStanding out due to its strong focus on sustainability and security, Cardano (ADA-USD) places third in the list of cryptos to buy instead of Ethereum. Utilizing smart contracts via the Alonzo upgrade, ADA offers lucrative investment prospects. Predictions suggest Cardano could surge to new all-time highs, as soon as this August. The jury remains out on that, but I do think this is a mega-cap token many investors will be watching closely.\n\nMuch of that has to do with Cardano’s impressive user growth. Total wallets on the Cardano network are nearing 4.6 million, with active daily addresses surpassing 30,000 and peaking at 64,568 on February 16. This spike in interest hints at growing demand for Cardano, signaling more upside could be on the short-, medium- and long-term horizon.\n\nI think Cardano’s relative value proposition is intriguing, but I wouldn’t be the farm on this one. Even still, Cardano can be viewed as a diversification play for investors looking to build a well-rounded crypto portfolio. In that regard, this network, with its strong fundamental growth metrics, appears appealing at current levels.\n\nOn the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nChris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective.\n\nMore From InvestorPlace\n\nThe post Beyond ETH: 3 Cryptos That Are a Better Bet Than Ethereum appeared first on InvestorPlace."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOZ1ZCa3F3c3NRLVdWNjY5Y1NqUk5qY3NkaFpTMEw4UGlFellVLXZHNVpCZXUyd2VpVEFxNHVNVkFKYnNVQ0FlcVQ4bGF0V2RoVEF1cEpTZTNxajhuOHpCYUNtVXNNSGJ6dnFpNEJIU3JVQkpVSFN6cXVrT1NkdnhiYmFVaE5CQTQ3c21pazN2RDlPTDZU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Behind Bitcoin, Ethereum, and Dogecoin's Wild Ride - The Motley Fool",
        "content": "Cryptos popped, dropped, and recovered all in a few hours.\n\nIt's been a crazy 24 hours for some of the biggest cryptocurrencies in the world. Bitcoin (BTC 0.29%) peaked at $68,800 in early trading on Tuesday, only to crash to 61,400 five hours later. As I'm writing at 11 a.m. Wednesday, its price is hovering around $66,500 and seems to have stabilized.\n\nUnsurprisingly, Ethereum (ETH -0.20%) followed a similar path, peaking at $3,805 in early trading Tuesday, falling to $3,360, and now trading at $3,800 again. Dogecoin (DOGE 1.68%) slid from $0.188 down to $0.132, but is now back up to $0.162.\n\nBitcoin's flash crash\n\nThe rapid drop in Bitcoin on Tuesday was driven by some profit-taking by traders, which was natural after its big run-up. CoinDesk also reported that Bitcoin miners were also seen selling some tokens to lock in profits in their business.\n\nMany Bitcoin miners keep the crypto on their balance sheets for extended periods, which gives them leveraged exposure. But that's only valuable if they eventually take profits.\n\nThe blockchain itself exposes some of the inner workings of the crypto market. Tracking movements on the blockchain can tell when certain actors are moving Bitcoin to exchanges or making decentralized sales. And that information can be shared extremely quickly.\n\nThe ETF craze continues\n\nFunds flowing into Bitcoin ETFs continue to keep the market afloat -- the BlackRock iShares Bitcoin ETF (IBIT 1.49%) pulled in $778 million on Tuesday alone. That fund now holds 183,000 Bitcoin and is one of the biggest owners of the token in the world.\n\nAs money continues flowing into ETFs, the buying pressure pushes Bitcoin's price higher, and because it is the leading crypto, other tokens follow in its wake.\n\nBut that may be the most bullish news for Ethereum and Dogecoin. It has now been proven that there's investor interest in owning cryptocurrencies through ETFs, and Ethereum and Dogecoin will likely be the next ones to get ETFs approved. They have two of the biggest market caps in the crypto industry and are widely held by investors.\n\nWhat's holding the industry back is that such funds require regulatory approval by the Securities and Exchange Commission, which has been reluctant to give it. But there are several court cases ongoing that could provide clarity on what is and isn't a security. Decisions in those cases could lead to approval for more crypto ETFs.\n\nCaution is needed in crypto\n\nThe recent rise in cryptocurrency prices has been driven almost entirely by speculation and inflows of funds into coins and ETFs over the last few months. Both trends can reverse just as quickly as they arose, so investors need to be cautious.\n\nFor example, in 2021, values surged, only to come crashing down to earth in 2022. The prices of Bitcoin, Ethereum, and Dogecoin have moved with a significant level of correlation to growth stocks -- and valuations of those equities are getting stretched to a point that their rise may not be sustainable.\n\nThis crypto bull run may continue, but investors should be prepared for a pullback. If history is any guide, one is likely coming."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPeE9neWpkNWZOY2dlVXotVVZGYlJtVjJTVTNQck0xSE1ZcWgtc0UzTF9kY1ZmNFEwdWszaVdsb1ZqeTVVdjkwV3Ita25UWUtKcUpXcE1Ob3h6VEFUdTNHM3dLdnE3bFQ4Mjh2NkV3TWRRZGk4VTJQU2JHYTFZaVoxcUc2dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "SEC Puts Ethereum (ETH-USD) ETF Decisions on Hold - TipRanks",
        "content": "The SEC’s postponement of verdicts on the Ethereum (ETH-USD) ETF applications from investment powerhouses BlackRock (BLK) and Fidelity came as no surprise. It’s maintaining an anti-crypto stance despite approvals for Bitcoin ETFs – which the courts essentially forced the SEC to approve. The review for BlackRock’s iShares Ethereum Trust and Fidelity’s Ethereum Fund, originally slated for March, now shifts focus to May for potential approvals.\n\nEthereum’s Price: A Beacon of Resilience\n\nETHUSD\n\nDespite regulatory uncertainties, Ethereum’s price resilience is notable, with a significant uptick from $2,289 to $3,830 since early February, marking nearly a 70% increase. This surge came in the wake of heightened expectations for Ethereum ETF approvals despite a recent pullback in gains across the crypto landscape.\n\nEthereum ETF: A Transformative Step for Cryptocurrencies\n\nThe approval of an Ethereum ETF would represent a significant breakthrough, being the inaugural ETF for a smart contract-enabled cryptocurrency. This development would elevate the position of altcoins within the financial ecosystem. Because ETH is in the realm of smart contracts and decentralized finance (DeFi), investors believe the broader altcoin market may attract TradFi beyond BTC and ETH.\n\nWhile the SEC contemplates the fate of the Ethereum ETF applications, Ethereum’s enduring growth and the community’s steadfast enthusiasm highlight the platform’s robust infrastructure and widespread support. The outcome of the SEC’s decision is poised to have profound effects on Ethereum’s assimilation into the traditional financial sphere, underscoring its lasting significance and importance."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPX2I3enRZYWZKT3FlSlNXZWc3aUhMMHhQWnhnaXpzcE9UNjJrSFpxbndkOS13UnAyLXFpRmVLYWhEUGswTWZtbkZYdjc4c094Ni1CWjBuWFdPTHpLMnhNdUJ4QWpJOW5Vd2xBTW1MZ3hGbkc5Sk5uSjR2V0pET1hyTWJTM2ZBa0xUQ0RsSDVjd1BPNFhPQ2x6eXJUQW1vM0N6WHh4eTJCaXJpT0tFM0xkOXpPNnVxMXZp0gG-AUFVX3lxTE81OGVxOFhYSGJ3Y1BGVjdzNDM5Wi01RVZaYTJXT2hLWjdWWVRXaHNuZFdVOVp3RU5HY1NKMG1uRE11V1hfY0g1YzRnQXhRY29RelRSal9QbGR2UjBIWHRuRTZLYXpabXZSXzRRT1VsT1dGa0pneW9mM3FVNGZtbkVTNjd2T0lZcGhJYnk4eDYyemV6WGotNmhraWJhRnA1Z0VWRUtBNl84THljTUVvSjIyTEpkbUpnWTVBRGZ1eFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Bitcoiners, Solana Acolytes Crash Ethereum Conference in Denver – for a Reason - CoinDesk",
        "content": "Bitcoin, which is in the midst of a developer renaissance with the advent of its own NFTs and decentralized finance (DeFi) services, had an impressive turnout of builders at the conference. So did Polkadot, the \"hub-and-spoke\" blockchain created by Gavin Wood, an Ethereum co-founder who used to market his new project as an improvement over the Ethereum model. Even Solana, the speed-focused network that's long positioned itself as an \"ETH Killer,\" had a well-attended booth at Denver's National Western Complex, the conference's venue."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE5HSi1najN4QTlzVDVtR3MzYi1DSFhtczd1RlhJMmROTFF4NHFNZTJrX0ZWRkIxd0xFcWdtVTJOXzNfNTZ5UHN5ekN1MGNQWXNRdTFPUVZUa1BOSEZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Can ETH Target $4,500 Next? - crypto.news",
        "content": "Ethereum’s price continues to advance towards $4,000 despite market-wide liquidations and the U.S. SEC postponing a decision on Blackrock and Fidelity ETH ETF filings.\n\nEthereum traders have doubled bullish positions despite a major setback to institutional participation on the pioneer smart contract network and intense market volatility recorded on Mar. 6.\n\nMarket analysis explores how this show of conviction among speculative traders could impact the ongoing ETH price rally in the near-term.\n\nEthereum price reclaims $3,900 despite bearish headwinds\n\nEthereum’s price rose 9%, soaring from $3,500 to a peak of $3,900 within the daily timeframe on Mar. 6. The latest wave of ETH price rally is remarkable, as ETH defied downward pressure from two major bearish events.\n\nThe crypto markets suffered intense volatility as investors who booked profits when BTC claimed a new all-time high on Mar. 5 inadvertently triggered over $1 billion in liquidations.\n\nPreviously, crypto.news also reported that the U.S. SEC had postponed its decision on Blackrock and Fidelity’s filings to launch an Ethereum ETF product.\n\nDespite two crucial events, ETH added another $48 billion to its market cap within the daily timeframe on Mar. 6, breaking past $3,900 for the first time in three years.\n\nEthereum (ETH) price gained 9% on Mar. 6 2024 | Source: TradingView\n\nIt was previously anticipated that the SEC would provide a verdict as early as April 2024. Still, the latest development means that the May 7 deadline on Vanguard’s application is now the most significant date for a possible ETH ETF approval verdict.\n\nThe launch of the Ethereum ETF is expected to open the floodgates of institutional demand, as observed in the Bitcoin markets over the past month.\n\nTypically, news of such a verdict delay from the SEC, could put instant downward pressure on the price of the underlying asset. Remarkably, ETH defied the bears’ soaring 9% within 24 hours of the postponement hitting the newsreels.\n\nBullish traders keep ETH funding rates elevated\n\nThe dominant bullish expectations and positive buzz surrounding the Ethereum ecosystem ahead of the upcoming Dencun upgrade were vital catalysts for ETH’s resilient price performance on Mar. 6.\n\nMarket data shows that ETH speculative traders have maintained their bullish conviction, even as BTC and other mega-cap altcoins experienced major liquidations.\n\nSantiment’s Funding Rates metric presents a daily aggregate of fees paid between holders of perpetual futures contracts for a specific crypto asset. Fluctuations in funding rate trends offer insights into speculative traders’ inclinations regarding short-term price movements.\n\nThe chart below shows that the ETH funding rate remained at elevated positive values above 0.05% since Feb. 27, when ETH prices first broke above the $3,500 milestone price.\n\nDespite the bearish headwinds on Mar. 6, ETH bulls did not exit their positions. Instead, they doubled down on bullish positions, driving the funding rate to a 2024 peak of 0.09%.\n\nEthereum (ETH) Funding rate vs. Price | March 2024 | Source: Santiment\n\nElevated levels in funding rates suggest that traders are overwhelmingly confident of further short-term price upswings and, as a result, offer higher fees to keep contracts open.\n\nUnsurprisingly, ETH’s price quickly soared above $3,900 within the subsequent 24 hours following the spike in funding rate. If this rare market trend persists, according to historical trends, it’s only a matter of time before ETH’s price breaks above the $4,000 mark.\n\nEthereum price prediction: $4,500 retest only a matter of time?\n\nEthereum’s journey to having a listed ETF in the U.S. may have suffered a setback. However, its path toward reclaiming the $4,000 price level still appears unhindered, considering the growing bullish conviction observed in the ETH derivatives markets.\n\nIntoTheBlock’s global in/out of money chart further affirms this stance: The latest price upswing on Mar. 6 effectively sent the percentage of profitable ETH holders above 97%.\n\nProfitable holders are often reluctant to sell during a bullish market phase, hence, ETH is likely to maintain a relatively high support level above $3,500 as it consolidates before its next leg-up.\n\nHowever, in the event of another bullish upswing, the bulls now have only the $3,992 resistance level to beat on its way to new peaks above $4,000.\n\nEthereum (ETH) Price Prediction | March 2024 | Source: IntoTheBlock\n\nAs seen above, 1.3 million addresses had acquired 493,080 ETH at the minimum price of $3,992. Hence, if Ethereum’s price can establish a steady support level above that range, a move towards new peaks above $4,500 could be on the horizon as predicted."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNREhpRXJrbXVQYVlhNmFxVlJILWlSR1VJRkplLU12T2tLVzJpMTgzOHBfWE1QS0NpbDlzdGJtMmVNbWV2T25KUXh4ejZELXFIQV9ZM1h4YWo2V2xsd2MyZnpLdjViLVRualphNHRwbUtvbjdtc3gzTUlQbWtHMkM2am1fcjc4X0ZTUTV4TnM3TFdPVnE3NDhwbWo0R05iZlJMYk8xY3BsWXJMNmNVbEF2N3VLWXPSAboBQVVfeXFMTUVUZUhHdDZtM0tWYVNFaHB6TGY3TzFiS3k0N1g5ZXR6QXBiNE85MXZnOUhDNDRvemROc3djN04tbktLcmxPeElhbndLQTF1TGhxQ2V1Q2x1SGYwdmVtakpVNzRpN3dfbGlOMEl6R3lJOGJGc3JKSzhKNlN5bFBodjM1d01KdE9yUFBMMGxDRVFmZWx6RzZyNnhBQUVYSUV4NndGdndpNWhVT1MwZmQ0aUVYMmRVRlZudWh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "SEC Pushes Back Decision on BlackRock, Fidelity's Ether ETF Applications - CoinDesk",
        "content": "\"We've seen a couple updates over the last 30 days. Some of the different issuers have done some things, but what that was, as far as I'm concerned ... a lot of the updates thus far have been them bringing these Ethereum filings up to date with the things they learned in the bitcoin ETF process. There's nothing that's been updated that is specific to ETH,\" he said. \"We haven't seen anything that's relevant specifically to an update that indicates to us for sure that the SEC is talking to any of these guys about a theory, but they are notoriously close-lipped and not supposed to talk to anyone.\""
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNUFczeDhYd1BlTGJfNTFzSG5PUmw2aDNrY3lNTXJRRzlaNWJVeWJOd3pyOW5kSzFUd0VpTEpxVUF0alpsOEw1c0l3QUU5UTRVMUd0bWZoQ3N6RmlGWDR3ZktwUE5uMS12cS13b0hHMFUtbWFUcFhxYVB4ZWlaZXZfbHBZLS0tcVNO0gGQAUFVX3lxTE9acTk5bEFMaEFZdXNDMlhGNzdkd0FjVjNQT1hEeXZiZ19qaUpoWGt0aVF5SUhUeFVTaWthazVzc0lycFFxZTBjNm5lSldKZk9oX0xGODNoZm9xb3Q4Y3ZXazRjQTBTUUtocm8tdmtqVzAyQ09yczFLUHc5dVQtSER1WmN2S2w2MF96SFZsZ2o0NQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Coinbase Is Giving Out Free Cards and Currency for Ethereum NFT Game 'Parallel' - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCryptocurrency exchange Coinbase is offering up free in-game items and currency for Ethereum NFT card game Parallel, which launched to the public in open beta last week.\n\nThe exchange will offer up $5 worth of in-game credits (Glints) and two free packs of non-NFT cards to new players who access the game either through Coinbase’s “explore” page for retail traders or through social media posts from Base—the Ethereum layer-2 scaling network incubated by Coinbase.\n\nParallel mints some of its NFTs on Base, along with NFTs on the Ethereum mainnet. Base creator Jesse Pollak described Parallel’s open beta launch in a press release as a “hugely important case study” for the Ethereum scaler.\n\n“With the power of Base's on-chain transactions showcased by Parallel's ongoing success,” he added, “we are excited to continue supporting ambitious and creative projects in leveraging Coinbase integration, and making Ethereum accessible to everyone.\"\n\nAD\n\nAD\n\nParallel, GG’s pick for the 2023 game of the year, is an NFT-driven collectible card game in which players assemble decks and battle it out against each other. It’s similar to Hearthstone and Magic: The Gathering, but with a space opera setting and additional tactical elements.\n\nPreviously available in a closed beta, Parallel opened up to the public last Thursday and launched a new in-game season of content. Parallel also just released NFT starter decks minted on Base, priced at 0.01 ETH (about $38 at present)."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQei1wd2ZHQmltSUVBMmNOdWpQZDloc2tnNjJmRm9lTk1SWk03TFdaWnh0Qm5tOFdpa2p6d0IwRlYzQkMyWTNpbnQwXzcwS3V2bFdweTF0bnRUQ2JXMGVWVWJPNWJzZVJGdjdMaWxqVTNaV25YNDFuY1VUQUFUWGVLZ2p4YVBOTTByRDllN21Ubm56MlBYa2lQd3U0MGtQNm9LN0MySnBPUXkxeW0ydXgyVl9qcmI3N19VOU9sNUhYWTcyTjcwTzJr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Flash News: OKX Wallet Adds Support for Blast, an Ethereum Layer 2 Network - PR Newswire",
        "content": "SINGAPORE, March 5, 2024 /PRNewswire/ -- OKX, a leading Web3 technology company, has issued updates for March 6, 2024.\n\nOKX Wallet Adds Support for Blast, an Ethereum Layer 2 Network\n\nOKX Wallet today added support for Blast, a Layer 2 network. With the integration, users can now manage their Blast mainnet assets directly via their OKX Wallet. This adds to the already impressive portfolio of over 85 blockchains supported by OKX Wallet.\n\nBlast is the only Ethereum Layer 2 solution that supports native yield for ETH and stablecoins. Since its launch, the Blast mainnet has attracted significant interest from the cryptocurrency community, amassing a total value locked (TVL) of $2.4 billion with 186,668 unique users.\n\nIn addition to the wallet integration, OKX's decentralized exchange aggregator, OKX DEX, will soon support trading of Blast ecosystem assets. This will provide users with a seamless experience for trading and managing their Blast-related assets.\n\nOKX also recently announced that it is the first major industry player to fully integrate Uniswap Labs' trading APIs into its offerings. The integration includes the launch of the 'Snap' trading mode feature on OKX DEX to aggregate Uniswap's industry-leading liquidity.\n\nFor more information, please visit the OKX Support Center.\n\nFor further information, please contact:\n\n[email protected]\n\nAbout OKX\n\nA leading global technology company driving the future of Web3, OKX provides a comprehensive suite of products to meet the needs of beginners and experts alike, including:\n\nOKX Wallet: The world's most powerful, secure and versatile crypto wallet which gives users access to over 80 blockchains while allowing them to take custody of their own funds. The wallet includes MPC technology which allows users to easily recover access to their wallet independently, removing the need for traditional, 'written down' seed phrases. In addition, OKX Wallet's account abstraction-powered Smart Account enables users to pay for transactions on multiple blockchains using USDC or USDT, and interact with multiple contracts via a single transaction.\n\nwallet which gives users access to over 80 blockchains while allowing them to take custody of their own funds. The wallet includes MPC technology which allows users to easily recover access to their wallet independently, removing the need for traditional, 'written down' seed phrases. In addition, OKX Wallet's account abstraction-powered enables users to pay for transactions on multiple blockchains using USDC or USDT, and interact with multiple contracts via a single transaction. DEX: A multi-chain, cross-chain decentralized exchange aggregator of 400+ other DEXs and approximately 20 bridges, with 200,000+ coins and more than 20 blockchains supported.\n\nexchange aggregator of 400+ other DEXs and approximately 20 bridges, with 200,000+ coins and more than 20 blockchains supported. NFT Marketplace: A multi-chain, zero-fee NFT marketplace that gives users access to NFT listings across seven top-tier marketplaces including OpenSea, MagicEden, LooksRare and Blur.\n\nWeb3 DeFi : A powerful DeFi platform that supports earning and staking on about 70 protocols across more than 10 chains.\n\nOKX partners with a number of the world's top brands and athletes, including English Premier League champions Manchester City F.C., McLaren Formula 1, The Tribeca Festival, Olympian Scotty James, and F1 driver Daniel Ricciardo.\n\nAs a leader building innovative technology products, OKX believes in challenging the status quo. The company recently launched a global brand campaign entitled, The System Needs a Rewrite, which advocates for a new paradigm led by Web3 self-managed technology.\n\nTo learn more about OKX, download our app or visit: okx.com\n\nDisclaimer\n\nSOURCE OKX"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQbEtJWjRWRlh1Zy1UbXlra2RkbGl4T204OEE0cWxvYkJkNTRhMnNUeVRtTGszZlFvZHV6T0JQbk9aNG1lTVRkdUdBN3IyOEVLZnpqbmp1ckVSMmpBM05lRGhDeVJqY1FBVEc2ZU1SMlhiMk52SE1QUWV6YVVCWU5zZ1VQMWhsNkJ3cmJzeGZRQThKYkdF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price to hit $4,000 ahead of Dencun Upgrade? - crypto.news",
        "content": "Ethereum price soared to a new 2024 peak above $3,740 on March 4. ETH 2.0 staking trends suggest the Dencun upgrade could usher in more gains.\n\nAfter outperforming Bitcoin (BTC) price in February 2024, Ethereum bulls have doubled-up on their staking positions in the first week of March.\n\nWith the anticipation of further upside after the Dencun Upgrade, ETH price looks set to make another attempt at reclaiming $4,000 as the week unfolds.\n\nETH 2.0 staking deposits cross $115 billion milestone\n\nIn early February, ETH developers confirmed March 13 for the mainnet launch of the Dencun upgrade. The critical “proto-danksharding” feature is billed to reduce transaction costs on Ethereum as well as auxiliary Layer-2 networks.\n\nEthereum price reached a new 2024 peak of $3,743 on March 5, sparking concerns that investors could start booking profits.\n\nBut with the Dencun upgrade now 1-week away, on-chain data from the ETH 2.0 beacon chain shows that investors have maintained a bullish outlook staking their coins rather than exiting at the current historic prices.\n\nThe total staking deposits on the ETH Proof of Stake (PoS) network crossed 31.3 million ETH rose from 30,569,041 ETH. This marks a significant milestone as the total stake value has now hit the $115 billion mark.\n\n\n\nEthereum 2.0 Beacon.chain staking deposits cross $115 billion | March 2024. | Source: BeaconCha.in\n\nRising staking deposits generate positive traction for any Proof-of-Stake network. Firstly, it enhances network security and stability, which could be critical amid euphoric network activity.\n\nSecondly, it signals that despite elevated prices, ETH investors are playing the long-game, with high optimism surrounding the Dencun upgrade.\n\nOverall, Ethereum staking hitting $115 billion while prices are trending at a 3-year peak indicates an overwhelming positive conviction among investors that the upcoming network improvements could drive the rally further.\n\nForecast: can Ethereum price reach $4,000 ahead of Dencun upgrade?\n\nDrawing data-driven insights from the staking trends analyzed above, Ethereum price currently appears primed for further upswing toward $4,0000 ahead of the Dencun upgrade slated for March 13.\n\nFirst, ETH has to establish steady support above $3,800. However, the bulls must withstand the profit-taking wave from the final cluster of 8.7 million addresses that acquired 3.4 million ETH when prices last reached $4,000 in the 2021.\n\nBreaking above this final resistance level, could set the stage for ETH price to advance towards its all-time highs above $4,000, as predicted.\n\nEthereum (ETH) Price prediction, March 2024 | Source: IntoTheBlock\n\nOn the downside, the bears could invalidate this ETH price prediction by staging another reversal below $3,000. But as observed in the past week, the buy-wall at the $3,100 territory offers significant short-term support for ETH price."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQb0R1ckJIYXVralVOR3EyQWlnTzZFM3ZTamo2ZmpvMklwTmxPTzF5RHhZVHVzSzBrcGJ0UXRyZlFmakE0ZzVSeldFLVNLOGFSeExxTDZHR0RNUEtQTGVSOThmNzItczVrOURnMG1YMFpyMzNfZDZMcmlodlpZTDU1anF5Smx0OHZCUXA0aElaN1VOWXBSVWpsRzIzdlJvbXYwRTRzanEzbGd0UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Ethereum price hits two-year high as network fees soar, SEC stalls on ETF decision - CryptoSlate",
        "content": "Transaction fees on the Ethereum blockchain experienced a significant surge in the past 24 hours, coinciding with ETH’s price surpassing $3,700, marking a two-year high.\n\nThis development comes amid the US Securities and Exchange Commission’s (SEC) delay in ruling on multiple pending spot ETH exchange-traded fund (ETF) applications.\n\nEthereum’s price spike coincides with high network fees\n\nDuring the past day, ETH’s price jumped by approximately 7% to around $3720 as of press time, its highest price level since early 2022.\n\nThe surge brings ETH’s total rally to over 60% during the past month, as the blockchain network mirrors a broader crypto market revival that has propelled Bitcoin’s price to more than $67,000.\n\nHowever, Ethereum network gas prices soared amidst this price upward trajectory, hitting an average peak of 79 gwei, with peak costs reaching as high as 219 gwei, according to Etherscan data. Several Ethereum users took to social media to decry the high fees and how it impacted their trading activities, including token swaps and borrowing transactions.\n\nRemarkably, this surge in fees saw the total network fees surpassing $33 million in a single day, a threefold increase compared to the beginning of the year, according to data from Cryptofees.\n\nMeanwhile, market observers noted that the impending Dencun upgrade could address these high fee challenges. This upgrade is anticipated to tackle Ethereum’s historical issues of sluggish transaction speeds, limited throughput, and high fees.\n\nSEC’s delays spot Ethereum ETF decision\n\nDespite Ethereum’s impressive surge, the SEC has further delayed its decision on BlackRock and Fidelity Ethereum ETF application.\n\nThe regulator is seeking public comments on the potential fraud and manipulation risks associated with a spot ETH ETF and has also raised questions about Ethereum’s proof-of-stake consensus mechanism.\n\nMeanwhile, the SEC’s decision is unsurprising as market participants remain divided on whether the regulator would greenlight Ethereum’s ETF. Industry insiders say the SEC remains cautious about cryptocurrencies despite its recent approval of a spot Bitcoin ETF.\n\nNevertheless, major crypto stakeholders, such as Coinbase, have advocated for the approval of ETH ETFs.\n\nMentioned in this article"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5tQ0IwUW5yY0M0aWlpVXF3ZEk5VUJOT3VSSmpHZFh0YzJwSjF4cTBjR0xmcDJCNEZnYzJGSld0djRpVEZEN2taT2Q5OEhDZXplUFpTb2pGZEI5LVlIenlQWXN1cXN4RmhTNHBYS3V3TVZKQmxHVnpnVEVpNkI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Here's How Much Trump Could Have Had if He Didn't Sell His Ethereum - Yahoo Finance",
        "content": "Though former President Donald Trump is famous for many things, Ethereum trading is not usually something that comes to mind for most. However, Trump dealt in Ethereum in recent months, according to data from Arkham Intelligence. The blockchain analytics company cross-references on-chain transactions with financial filings made by a Donald Trump account to find the former President's wallet address.\n\nIn December 2023, Trump sent more than 1,000 Ethereum (ETH) tokens to Coinbase, presumably to sell. At the time, the Ethereum was worth $2.4 million. However, ETH has since performed very well, and the former president may be wishing that he held on for longer.\n\nDon't Miss:\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today .\n\nBitcoin has jumped nearly 50% already this year – how much would you need to get started today?\n\nIf Trump were still holding all 1,075 ETH that he sent to Coinbase, they would be worth more than $4 million, nearly 60% higher than what he sold them for, as ETH reached higher than $3,700 today. By selling in December, Trump could have had $1.6 million more in his portfolio.\n\nAdditionally, some expect the price of ETH to continue going up in the near term. The chain is expected to unveil new upgrades soon, which will increase speeds and security while lowering costs. The potential for spot Ethereum ETFs as early as May 2024 could provide another boost for the token.\n\nWhile Trump may be regretting his sale, the ETH was essentially free for him. He obtained the tokens through an NFT project that used his name, image and likeness and gave Trump royalties.\n\nThe project, called Trump Digital Trading Cards, was minted in December 2022 for $99 each. The 45,000 unique NFTs feature photos of Trump in different settings and poses. As of right now, the cheapest NFT is on sale for a little less than $500 (0.14 ETH), and the most expensive sale goes for 37 ETH (worth nearly $150,000 at the time).\n\n—\n\nTrending: Large boom in cryptocurrency and metaverse interest as BTC skyrockets — has Apple Vision Pro increased the demand for virtual real estate?\n\n—\n\nAdditionally, the project has generated more than 15,000 ETH in trading volume, which is what has allowed Trump to amass his ETH holding. In total, Trump has received nearly 1,500 ETH from the project.\n\nHowever, the Trump NFT projects do not stop there. Trump announced the release of another project in late 2023. The project is largely similar to the original project but carries some much more personalized rewards. For example, those who buy more than 47 NFTs, priced at $99 each, will receive a physical piece of the suit Trump was wearing in his infamous Georgia mugshot. Other rewards include autographed cards and even a dinner with Trump himself.\n\nStory continues\n\nAs Trump continues to earn royalties and does well on the campaign trail, it will be interesting to see how he handles his ETH position going into the presidential election in November.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Here's How Much Trump Could Have Had if He Didn't Sell His Ethereum originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5oY1I1UUtrbV8takE2cjZ6bEtZbUFTbG9pLXU0aEZHaEFiZnpiTjA0aUNNQW9jUmFzVGdrS2syZEE0NzUzWnlCVTBRVjEzRmZTcXBiT0RoM2dnYnRWbzRVamlDbkd0MHhnLTFDcEJiVjE3bkVxOFpsNFN0R3I?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Top 6 Memecoins Surges Rapidly While Bitcoin Experienced Huge Spike & Ethereum Shine - TronWeekly",
        "content": "Bitcoin (BTC) and Ethereum (ETH) have been commanding significant attention in the dynamic cryptocurrency landscape. BTC is edging closer to its previous all-time high, while ETH has exhibited remarkable resilience by overcoming substantial resistance levels. Despite these notable performances, the overall market sentiment remains bullish, with numerous altcoins demonstrating impressive growth trajectories. Memecoins, in particular, have emerged as focal points, drawing attention with their exceptional gains.\n\nTop 6 Memecoins Rapid Surge\n\nWithin the realm of memecoins, Pepe (PEPE) has emerged as a standout performer, experiencing an unprecedented surge of 400% over the past week. At its pinnacle, the memecoin reached an impressive peak of $0.00000766. Presently, PEPE continues to maintain momentum, trading at $0.00000716, marking a substantial 32.80% increase in price and an impressive 80% surge in trading volume within the last 24 hours.\n\nDogwifhat (WIF) has captured significant interest, boasting a weekly surge exceeding 338%. The memecoin currently valued at $1.63, WIF showcases stability despite a marginal 6.81% decrease in price, accompanied by a modest 8.56% decline in trading volume within the last 24 hours.\n\nFloki (FLOKI) has also made waves within the cryptocurrency community, exhibiting a remarkable 320% gain over the past week. Presently the memecoin is trading at $0.0001536, FLOKI demonstrates resilience with a slight 4.23% increase in price, juxtaposed with a notable 26% decrease in trading volume within the last 24 hours.\n\nBonk (BONK) Solana based memecoin has witnessed a surge of over 205% in the past week, currently trading at $0.00003664. Despite experiencing a significant 45% increase in price, BONK also boasts a remarkable 108% surge in trading volume within the last 24 hours, indicating heightened investor interest.\n\nShiba Inu (SHIB) a well known memecoin has showcased robust growth, boasting a notable 178% increase over the last week and currently trading at $0.00002711. With a commendable 22% rise in price and a modest 2% increase in trading volume within the last 24 hours, SHIB continues to captivate market participants.\n\nThe pioneering memecoin, Dogecoin (DOGE), has recorded impressive gains of 92% over the last week, trading at $0.1674. DOGE has experienced an 18% increase in price and an impressive 80% surge in trading volume within the last 24 hours, underscoring its enduring appeal within the cryptocurrency ecosystem.\n\nMoreover, several altcoins, including Bitcoin Cash (BCH), Cardano (ADA), Polkadot (DOT), and Solana (SOL), have reported substantial gains in their weekly charts. BCH surged by an impressive 70%, ADA by 33%, DOT by 31%, and SOL by 28%, as per data sourced from CoinMarketCap, further illustrating the widespread bullish sentiment pervading the cryptocurrency markets.\n\nBitcoin (BTC) & Ethereum (ETH) Weekly Review\n\nBitcoin (BTC) has recently surged, surpassing the $66,000 mark. As of the latest update, BTC is priced at $66,256, boasting a 24-hour trading volume of $65.53 billion and a market capitalization of $1.30 trillion. Notably, BTC has seen a 6.02% increase in price within the last 24 hours, with an impressive gain of 28% over the past week.\n\nRenowned crypto analyst CryptoCon has conveyed an optimistic outlook for Bitcoin’s future trajectory, hinting at a potential early Christmas for enthusiasts of the digital asset. This optimism follows Bitcoin’s recent breakthrough of a significant resistance level just a fortnight ago. Subsequent to this breakthrough, two new price targets have emerged: Level 3, marked at $85,334, and the Cycle Top Band, positioned at $115,000.\n\nHowever, it’s crucial to recognize that the indication of $115,000 as the cycle top by the Cycle Top Band isn’t set in stone. Historical data indicates that Bitcoin often surpasses previous all-time highs (ATHs), leading to an upward extension of the bands and the possibility of attaining even loftier prices. Therefore, while $115,000 may appear to be a significant milestone, it might not signify the ultimate peak.\n\nThe significance of the Cycle Top Band only materializes when Bitcoin’s price interacts with it, signaling a potential conclusion of the cycle. This methodology has proven effective in the past, with Bitcoin’s price movements aligning with this pattern throughout the last three cycles.\n\nFurthermore, Ethereum (ETH) has broken out from a major resistance level of $3,500. Currently, ETH is priced at $3,560.83, accompanied by a 24-hour trading volume of $23.33 billion and a market capitalization of $427.77 billion. Over the last 24 hours, ETH has observed a 3.63% increase in price and a notable 14% surge over the past week.\n\nEthereum is currently positioned for significant growth, as underscored by insights from Rekt Capital, a prominent crypto analyst. Rekt Capital points out that Ethereum has recently surpassed its Macro Range, which was previously marked in red, indicating a significant breakthrough in its price movement. This development signals a potential shift in the market dynamics.\n\nHowever, in order to sustain this upward momentum, Ethereum now faces the crucial task of solidifying the former resistance level represented by the orange zone as a new support level. This transition is essential for Ethereum to consolidate its gains and pave the way for further price appreciation. Successfully establishing this support level would provide a strong foundation for Ethereum to ascend to higher price levels with greater stability and confidence.\n\nDespite the challenges ahead, the current trajectory of Ethereum’s price action is encouraging. The market sentiment is optimistic, reflecting growing confidence in Ethereum’s long-term prospects and its ability to navigate through evolving market conditions."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOYU5HZS11V0FLT2FfNXJ1elEzWE9pTnBmTUg0WHZzLXdiYkYxclN4bnk5dnh0Z0pZWlAzdGQ5WDRieUVYRG1KTlNtdWpBSG1EQlhpczhjNlhoa0VINGFvOWJNenVpb1hkQmU3R0hVSVN3T1lIdGsxeF9oNTlGSVFzTWVHZUo5RVJPaWk3c3ZUZEdCZ2hlVXV2YUZxMWJzcXhkS0daRnlORdIBrAFBVV95cUxQN1QzM2lpUkFUSGhaT09Gb19MOGIzb0pYYng0clBpSzVYZzQtLTJ1V2N0Y3p2MENxYXhtTEQ0dW16SnN4U08yY0I5RTdHUlpVdGd3RThQNWtVS2ZxbzZVZ19fS2lUMEx5UWgzTFJ4LVFXbl92V1ZCNXVNLXNMdklsWHNoVGpxWjdWeHV4Vm9oenZKSjRaWnhMNjVoQ09XRXc1RHRoOVRxbDRWaWZZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Binance Integrates Ethereum Layer-2 Blast Network Into Its Web3 Wallet - The Daily Hodl",
        "content": "Binance’s Web3 wallet has integrated a brand-new Ethereum (ETH) layer-2 scaling solution.\n\nThe exchange’s users can now use the wallet to complete transfers to and from the Blast Network, which offers native yield for ETH and stablecoins.\n\nBlast launched its mainnet last week and says it has already clocked more than $2.4 billion in total value locked (TVL).\n\nTVL refers to the amount of capital deposited within a protocol’s smart contracts and is often used to gauge the health of a crypto ecosystem.\n\nSome members of the crypto community have expressed skepticism about the new Ethereum scaler. Back in November, Jarrod Watts, a senior developer relations engineer at Polygon Labs, argued that Blast wasn’t actually a layer-2.\n\n“The Blast smart contract: 1/ Accepts funds from users. 2/ Stakes users’ funds into protocols like LIDO. There’s no testnet, no transactions, no bridge, no rollup, and no sending of transaction data to Ethereum. It’s not an L2.\n\nBy sending money to the Blast contract, you’re basically trusting 3-5 strangers to stake your funds for you. You won’t be able to withdraw that money at any point in time unless those 3-5 people decide to do the right thing in the future. Again, there’s no bridge here.”\n\nBlast, however, pushed back against those criticisms.\n\n“Multisigs can be highly effective if used properly. This is why L2s like Arbitrum, Optimism, Polygon, and now Blast use a multisig model.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPNkg4QTNYZDJCQmxCSERDOTJtZG42LU11ZXJNM3N5T3B1TktkSlNBb1VaU2huMndRMkFtNjBEeDdhN1Y0Q204b1A1TUVqTkExbWVidjBqd0sxSVFoTjd4U2lNNDNTWFJwX2lIYU9nZVVpSndoOXJET3NqTHJ5VS1ITFN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "BlackRock Spot Ether ETF Again Delayed by SEC - Yahoo Finance",
        "content": "Ethereum\n\nThe Securities and Exchange Commission has again delayed BlackRock Inc.’s spot ethereum ETF application, extending their time to decide on the asset management giant’s proposal for an exchange-traded fund holding the second largest cryptocurrency.\n\nThe delay is the second since BlackRock filed to create the iShares Ethereum Trust in November. The agency first delayed its ruling in late January, when it also extended the review time for a similar application from Grayscale Investments.\n\nInterest in crypto ETFs is surging as investors pouring billions into spot bitcoin funds helped push the price of the top cryptocurrency to an all-time high today. Ethereum, the No. 2 cryptocurrency by market capitalization, while gaining lately, remains about $1,000 less than its all-time high of $4,891.70, according to CoinMarketCap.\n\nWhile the SEC greenlit ethereum futures funds in October, it's taken a more cautious approach to ETFs that own crypto and expose investors to the so-called spot market over concerns about market manipulation and fraud. A handful of firms, including Fidelity Investments, Bitwise Asset Management, Ark Invest, and Franklin Templeton, are seeking to create their own spot ethereum ETFs.\n\nThe decision to delay the ETF was largely expected by analysts, who foresee May as the date to watch for the SEC to make a final decision on the funds.\n\n“The only date that matters for spot ethereum ETFs at this time is May 23,” Bloomberg ETF analyst James Seyffart wrote on Twitter/X after Invesco’s filing was punted in early February. May 23 is the final deadline for VanEck's spot ether fund.\n\nThe SEC is also asking for the public to weigh in on \"concerns about ether’s susceptibility to fraud and manipulation,” according to the filing.\n\nEthereum vs Bitcoin\n\nMany cryptocurrency investors are hoping that after the watershed approval of ten trading spot bitcoin ETFs in January that spot ethereum funds could be just around the corner.\n\nYet while many analysts believe that the ether funds will eventually be approved, the path isn’t necessarily straightforward. A central issue that has yet to be settled is whether ethereum would be designated a commodity by the SEC, according to etf.com analyst Sumit Roy.\n\nAt the ETF Exchange conference in Miami in February, a group of executives including Bitwise Asset Management’s Matt Hougan, Galaxy’s Steve Kurz, and Grayscale’s David LaValle agreed on a spot bitcoin panel that there was about a 50% change that ethereum ETFs would be approved by their May deadline.\n\nCommenters have 21 days to submit their thoughts to the SEC.\n\nStory continues\n\nEthereum, which is the second largest cryptocurrency, has seen its price surge in recent weeks on the coattails of bitcoin’s rise. The cryptocurrency is up 14% over the past week and nearly 3% over the past day, according to database CoinMarketCap.\n\nContact Lucy Brewster at lucy.brewster@etf.com.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE82TF81cXV1X0JHSndpcXNYX3JpX25ENExOYmtjd3hyd24xUmp5TWpDVjhRU2xmSjNDc3dJZVRfSndfTkVZRVRKVlN5TFhiZ2x3X3pwLTZQSFVNcjJEcEpBa2U3dTV1UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "ETHDenver 2024: 3 Top Takeaways - Unchained",
        "content": "The festival saw a more than 33% increase to 20,000 visitors compared to last year. What do the attendees and presenters tell us about the future of Ethereum and crypto in general?\n\nAs the seventh annual ETHDenver drew to a close on Sunday, reflecting on who came and presented offers a hint at the future of Ethereum and crypto generally. The festival announced it had more than 20,000 attendees this year, a more than 33% increase from last year’s 15,000 unique visitors. Among them were founders and developers of layer 2 and non-Ethereum projects as well as members of the U.S. government and a presidential candidate.\n\nLooking at the attendees and presenters of ETHDenver 2024, here are three takeaways about the future of Ethereum and crypto in general.\n\nRead more: ETHDenver’s 2024 Hackathon: Onchain Security, AI, and Gaming Fun Dominate the Winning Projects\n\nTakeaway #1: Horizontal May Be the Answer to Ethereum’s Scalability Problem\n\nEthereum has long had a scalability problem. When the number of transactions and users increases substantially on Ethereum, the blockchain network suffers in performance, marked by high levels of gas fees. Layer two (L2) rollups, which have been endorsed by the blockchain’s co-founder Vitalik Buterin since Oct. 2020, are seen as the answer to the scalability problem.\n\nThe number of L2s has substantially grown in the past couple of years as data analytics website L2Beat shows that there are 44 L2 projects currently.\n\nDespite the proliferation of scalability solutions in the form of L2s, “we are starting to see a lot of limitations on the performance of L2… notably recently with Inscriptions,” Kenny Li, co-founder of L2 Manta, said to Unchained in an interview. For example, Arbitrum suffered an outage in Dec. 2023 because of a surge in inscriptions.\n\nLi said, “The scalability problem is not solved at all, especially when we’ve talked about these killer apps, these 1 billion users… Most of these L2s are not going to be able to sustain 1 million active users, and so now the question is: what do we do next?”\n\nWhile L2s offer faster and cheaper transactions than the base layer of Ethereum, they suffer from fragmentation. An application on one L2 can’t efficiently communicate with the version of itself on a different chain, can’t share liquidity, nor access the same user base, according to Li.\n\nPolygon co-founder Brendan Farmer noted a similar observation. “If we think about the current state of crypto, we’re limited by infrastructure, and so we believe that in order to capture latent demand that we think exists, we need to remove the scaling limitations.”\n\nFor both Manta’s Li and Polygon’s Farmer, how the crypto space progresses forward with widespread adoption is through “horizontal scalability.”\n\n“We’re at a point now where we can solve it, [scalability], in the sense of it’s not going to be through one singular L2, or L3 even. It’s going to be through horizontal scalability,” Li indicated. “Instead of just having the [transactions per second] of one L2, you can take advantage of the TPS of all the different L2s that are existing today that way applications when they need to scale their user base, they can look across all these L2s and say, ‘Okay this one’s got the TPS I need currently and start running compute through that… I think that’s very akin to a very tried and true model, which is cloud computing.”\n\nRemoving limitations on infrastructure, according to Farmer, is the ability to scale horizontally through Polygon’s aggregation layer. “The way we think about the agg layer is, it’s this piece of shared infrastructure that provides unified liquidity and composability and a user base that’s accessible to any chain and there’s no requirement to join the agg layer.”\n\nThe focus on horizontal scalability has provided a sense of optimism for Farmer. “This is the first time where it’s felt like there are real solutions to infrastructure problems that have been facing us for a long time. We can see in the distance the way to build an internet scale crypto ecosystem that is not limited by a lot of the infrastructure bottlenecks that we faced in the past,” Farmer said.\n\nTakeaway #2: Ecosystems Merging\n\nETHDenver, as its name suggests, has historically been the home of Ethereum enthusiasts, contributors, and developers, and yet the annual community gathering has attracted individuals and communities from other blockchain networks, notably Solana and Bitcoin, demonstrating the growing overlap between the various sub ecosystems within the crypto space.\n\nOne of the talks on the mainstage was about how projects such as Eclipse, Neon, Monad, and Polygon were merging Solana and Ethereum together. One of the speakers, Polygon advisor Ajit Tripathi, praised both Ethereum’s culture of research and Solana’s product first, engineering culture, saying “these two things need to come together.”\n\nSukanya Parashar, senior integration engineer for Neon EVM, which is based on Solana, said on stage, “We wanted something to build for the Ethereum community so that they easily can deploy their existing apps on Solana and get Solana’s benefits of high transaction speed, low gas fees and of course parallel execution.”\n\nCosmos, another blockchain network, is also seeing an overlap with the Ethereum community. “We’re headed towards an industry where the Cosmos and Ethereum ecosystem are slowly converging… For example, there are rollups on Ethereum right now that are secured by Celestia DA,” said Avril Dutheil, a core contributor of Cosmos-based chain Neutron, in an interview with Unchained.\n\nCelestia, as a standard Cosmos-SDK based blockchain that is known for its data availability services, is “an example of Cosmos actually securing Ethereum,” Dutheil added.\n\nSimilarly to those in the Solana and Cosmos ecosystem, Bitcoiners are learning from the experiments happening on Ethereum. In fact, “there’s an amazing opportunity to learn from everything that has already happened in Ethereum,” Muneeb Ali, the co-creator of layer 2 Bitcoin network Stacks, said in a talk called, “Have Fun Staking Turing Incomplete: What Bitcoin Builders Borrowed From Ethereum.”\n\nDavid Tse, co-founder of BabylonChain and professor at Stanford University, said in the same talk that 1,200 people showed up to a Bitcoin event at ETHDenver, highlighting the synergy between Bitcoiners and Ethereum contributors.\n\n“The event was to showcase that there are synergies between Bitcoin, Ethereum, Cosmos, and other ecosystems… Maximalism is not great, and I think if you work together, we can achieve much bigger things and just grow the piece,” said co-panelist Alexei Zamyatin, co-founder of BOB, a hybrid L2 between Bitcoin and Ethereum.\n\nTakeaway #3: Politicians Recognize the Importance of Crypto\n\nThe United States federal government has not been friendly toward crypto, but three government officials and candidates came to ETHDenver to discuss how they hope to change the relationship.\n\nSEC Commissioner Hester Peirce, local congressional representative Brittany Petterson (D-CO), and independent presidential candidate Robert F. Kennedy Jr., each spoke on the mainstage.\n\nPeirce lamented the lack of regulatory clarity from the agency she currently serves, the U.S. Securities and Exchange Commission, saying, “If you really want to sort the bad behavior from the good behavior, having rules that are clear to people who want to follow them is a much better approach.”\n\nWhen CoinDesk’s Jennifer Sanasie asked Petterson about how to stop American crypto startups from leaving the U.S. and setting up in regions with more regulatory clarity, Petterson said that the flight of investments — crypto or not — is a concern of hers in general.\n\n“Right now, it’s in question whether or not we will even do our job and pay our bills as the United States of America, if you can even believe that’s how bad it’s gotten at the federal level. And so our inability to govern, our inability to regulate and change with changing times as quickly as technology is innovating and [as] our economy is innovating, that is a huge problem for our long-term success as a country,” Pettersen said on ETHDenver’s main stage.\n\nKennedy Jr. emphasized his alignment with the crypto community, saying how he was going to “end the war against all cryptocurrencies,” in his press conference at ETHDenver.\n\n“We need the infrastructure for transactional freedom in this country so that people can use Bitcoin and they feel comfortable… There’s a million ways to do that and I want to explore everything,” he said. The political discussions at ETHDenver boil down to the prominent and growing intersection between the crypto industry and the U.S. government."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQZktSS1c5Ry00TXc3ek5rTW9uQ2g1V0tYRW52WmRyMjg4eWNSTzdhelFETHA0MEVVUEFIZ1lld2V6Zlhnd3dfMFVheXRQcV8xbndpdEhhZzV5eVNubUdBalVOdXhGMmhETDVNNXZIbmlhRU82ZXdkbm1MWlhsNEdJRVRZUGgwQdIBiwFBVV95cUxQa0xfdTVGVEZmUVNVU01QcWNVaVJqUzg0aHdZZVpkQ1lBTkxzWGhRR0kxaU5fTUxlV2Q1R09sSlhIM09zUFVLY1JacURnYm10QUdFdF9yb0RBbTRNUGJNVThzYkw1dTFOZkRranNFZWJWZG9MUHRESWpRTTFjTmNwcVRLWUVUbjdwX19F?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum whales are on the move – What next for ETH prices? - AMBCrypto News",
        "content": "ETH was up by more than 6% in the last 24 hours.\n\nThe token’s indicators and metrics turned bearish, suggesting a price correction.\n\nEthereum’s [ETH] price crossed a critical level as its value surpassed the $3,700 mark. Since the token was enjoying a bull rally, AMBCrypto planned to take a look at its metrics to see whether the uptrend would last or whether investors should expect a price correction.\n\nWhales are not backing down\n\nAccording to CoinMarketCap, ETH’s value shot up by more than 6% in the last 24 hours, allowing it to cross the $3.7k mark. At the time of writing, Ethereum was trading at $3,691.87 with a market capitalization of over $443 billion.\n\nThough the token’s price dropped slightly, whale activity around it remained high. AMBCrypto reported earlier how whale activity around the token went up in the recent past. The trend seemed to have been continuing as its whaler transaction count remained high.\n\nAdditionally, its supply held by top addresses also went up last week, meaning that whales were still accumulating the token.\n\nThough whale activity around the king of altcoins was high, a few of the metrics hinted at a price correction. An analysis of CryptoQuant’s data revealed that ETH’s net deposits on exchanges were high compared to the 7-day average.\n\nHigher deposits can be interpreted as higher selling pressure. Its Korea premium was also red, meaning that selling sentiment was dominant among Korean investors.\n\nThings looked bearish in the derivatives market as its taker buy/sell ratio turned red, suggesting that futures investors were also selling ETH.\n\nWhat to expect if ETH’s price plummets?\n\nSince a few of the metrics looked bearish, AMBCrypto checked the liquidation heatmap to see the support levels. As per an analysis of Hyblock Capital’s data, ETH has strong support near the $3.3k mark.\n\nTherefore, if the token witnesses a price correction, its price might go down to that level before initiating another bull rally.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nTo check which way ETH might head, we took a look at its daily chart. As per our analysis, the chances of ETH witnessing a price correction seemed high. The token’s Relative Strength Index (RSI) entered the overbought zone.\n\nAdditionally, its Chaikin Money Flow (CMF) also registered a downtick, further increasing the chances of a price decline. However, the MACD remained bullish on Ethereum as it displayed a bullish upperhand in the market.\n\n\n\n\n\n"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOM3VneE1RaGVZR19kZzlHeGd5Tl94a3ptQndJay1kYUtacUZPbjZESTlyQU9QN1FCRUlNaUdEc0RkcnhBbDVNdTFpV3lkR3NkdmUtMC0zYWZEUm81VEtYeVdKdl9yd2k4ZHZzdV91TEh1LUtEYU1mSjNob3laVTRoNGNiemw0eGdiaTB6WjhuN21WTGhXYVdscjRiLUhaLW0tYWVWc1dfTnNXb09JWEllbWpkZTg1Mm1DRFNQaG9obnBldnNRM05qend6aWZqbHZWektSRjduSVIxVE3SAeABQVVfeXFMTzNLbVFsM3NmbmVGUVdYX2dhQVo0VmdFUXp6ZHFCMHJQT3lFVHRsaHp0UHlHT3hOSUlUaFBFbEEyellLY3BaNE9NVGZtdF9iM2k2c2VEQVhZMnZHT1luTEh2cFhUVFNaeGZMVUxFYWlFTm5BOHYyRDZEQ08yOG00Y0RQTThIRWlYdjhhMEM3OFVvN016ZHdiRm93VW5OQXAtQVNGSlhTRkwzS2JFOE43aUNJaWdFOWpGa1JhNmdGd1FJQi1TaC1kYnVFdHlvZWkzWkVxRXZDZmRhN3dQa2JHQng?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum price beats crypto market bloodbath nearly a week away from Dencun upgrade - FXStreet",
        "content": "Ethereum price rallied over 5% on Wednesday despite the crypto market correction led by Bitcoin price decline.\n\nEthereum Dencun upgrade,scheduled for March 13, is expected to lower transaction costs for Layer 2 chains.\n\nStaked Ethereum climbed to $118 billion, as ETH holders prepare for EIP-4844 arrival on the mainnet.\n\nEthereum (ETH) price climbed on Wednesday while several other cryptocurrencies wiped out their recent gains following Bitcoin’s price rally and its subsequent pullbackon Tuesday. Ether resumed its recent uptrend towards the psychological $4,000 target despite mass profit-taking by holders.\n\nThe Dencun upgrade, a key technical development on the Ethereum mainnet, is scheduled to go live on March 13. The upgrade marks an important milestone for Layer 2 chains and rollups.\n\nAlso read: Ethereum price poised for gains as Dencun upgrade goes live on the testnet\n\nEthereum gears up for gains ahead of Dencun upgrade\n\nThe Dencun upgrade is the most significant upgrade for the Ethereum blockchain since the Merge, where the chain shifted its consensus mechanism from Proof-of-Work to Proof-of-Stake. Developers have set March 13 as the date for Dencun’s mainnet release.\n\nThe upgrade is popular for its “proto-danksharding,” a feature through which the chain uses blobs, which reduce the burden on the underlying blockchain and lowers costs for Layer 2 chains and rollups that depend on the Ethereum chain. This is possible with EIP-4844, one of the key Ethereum Improvement Proposals that is part of the Dencun upgrade.\n\nWith the successful completion of the Sepolia and Holesky testsnets, Dencun is ready for its deployment and smooth implementation on the Ethereum mainnet.\n\nThe Dencun upgrade, also known as a hard fork, will trigger when Ether’s blockchain reaches the slot 8626176.This is expected to occur at 13:55 GMT on March 13.\n\nDencun upgrade, a game changer for Layer 2 chains\n\nDencun has significant implications for Layer 2 chains. The development upgrade is packed with EIPs to enhance scalability by processing transactions off-chain while offering L2 protocols the security of the Ethereum mainnet.\n\nThe key EIPs in the Dencun upgrade are EIP-1153, EIP-4788, EIP-5656, EIP-6780, EIP-7044, EIP-7045, EIP-7514, and EIP-7516. These improvement proposals are set to facilitate the expansion of operations in Layer 2 protocols.\n\nExisting Rollup technologies like Arbitrum, zkSync, StarkWare, and Optimism heavily utilize the Ethereum mainnet for security, so these projects stand to benefit from the upgrade. This is expected to drive further adoption and boost these projects’ utility.\n\nEthereum price inches closer to $4,000 target\n\nEthereum price is $3,819 at the time of writing. The altcoin is rallying towards its psychologically important $4,000 target on Wednesday after Bitcoin price hit a new all-time high on Tuesday. Both coins are highly correlated, with the three-month correlation co-efficient at 0.95.\n\nThe value of staked Ether has climbed to $118 billion as of Wednesday, further reduces the circulating supply of the altcoin and paving the way for the rally to continue. Despite consistent profit taking – $1.969 billion since the beginning of March, according to data from Santiment –, the altcoin has climbed higher and has no significant resistance in its path to $4,000.\n\nThe Moving Average Convergence/Divergence (MACD) indicator and the Awesome Oscillator (AO) support Ethereum’s gains.\n\nETH/USDT 1-day chart\n\nA daily candlestick close below the 23.6% Fibonacci resistance at $3,432 could invalidate Ethereum’s bullish thesis. In the event of a decline, ETH price could nosedive to the 38.2% Fibonacci retracement at $3,190."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE80ZGtlM0pObHp1eFBoVjdnNEJDd1paUTJhUU9KNERoNGc0YklNVDJ1eS1UaVJoZVZkVTBiRi1BNnJHeVIxWFZwZmM2LTB4cURUQmF3RVNvbkdwbm5SZmRjVnRUWHhkUTRLaWZ6b2JlQXNMXzTSAXhBVV95cUxPcFRYSHhhMDBndXZCTmhRUmJ1NmVyR3NJLWs4MjZXTGExNHlrQ3ZSbDJneDd4ZVY4V3g5SFZrZWZ6WG5BTWFFeHlkSFl2WW9LbGRnaE9UZlJzSHBPUHJqYkJzZFNIZjM1M1R3Vk5BQ080SWVzYXRhNlo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Makes Large Ethereum (ETH) Transfer - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum has been on an explosive trajectory on the market, and a recent transaction from Vitalik Buterin's wallet has caught our attention. PeckShieldAlert reports that the wallet labeled as Vitalik.eth has transferred 30 ETH to Railgun and then swapped approximately 27.63 ETH for 100,000 USDC, subsequently bridging these to the Base layer.\n\nAdvertisement\n\nIt is important to note that Buterin has clarified in the past that transactions from his wallet do not necessarily equate to personal movements of funds. These transfers can often be related to redistributing funds across different platforms or for charitable causes. Hence, while it is intriguing to monitor such high-profile transactions, they should not be directly correlated with market predictions or individual investment strategies.\n\nTurning to the Ethereum price chart, the currency has demonstrated robust performance in recent days. The chart depicts a sharp incline in ETH's value, breaking through previous resistance levels with conviction.\n\nThe currency's price has soared past significant milestones, with traders and investors showing bullish sentiment. This surge aligns with a broader trend of increased adoption and acceptance of Ethereum as a cornerstone of the blockchain and DeFi ecosystems.\n\nAdvertisement\n\nEthereum's moving averages provide a technical confirmation of this bullish trend, with shorter-term averages positioned above longer-term ones, indicating sustained buying pressure.\n\nThe volume bars corroborate this movement, with substantial activity accompanying the price increase. However, as Ethereum approaches uncharted territory, resistance levels may form at psychological price points, and any substantial sell-offs could test the currency's newfound support levels.\n\nEthereum's market performance has been impressive, coinciding with notable wallet activity from one of its founders. While the market may draw correlations between the two, savvy investors understand that in times of high volatility, predicting movements of digital assets becomes even harder."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNYzJEWlBMeHNrWjk4TkthYmtra2hxZFUxYzNTRTJ0OTBOcHdVWkxjbjAxZmRXZ1k0WVNMelUxblBzVTNwTHVfYTdMQWQySXNTWHBVS2I1blpzb3RudmZBb2RtSjJYWm5Ia21EUEg5SENJcm9DNURmZTZzSWFGQWg2Rm5sNndCU3poZ0oyaXFCMlYwZ0RtdVRoMm14RHdDVGM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "The price forecast for Ethereum: 5,000 USD by the end of 2024 - The Cryptonomist",
        "content": "As the cryptocurrency market continues to evolve and mature, investors are constantly looking for information on the future performance of important digital assets like Ethereum (ETH), analysts believe that ETH predictions could reach up to 5,000 USD by the end of the year.\n\nThanks to its solid blockchain technology and versatile applications, Ethereum has emerged as a protagonist in the crypto space, attracting both investors and developers.\n\nLooking ahead to the end of 2024, let’s analyze the factors that determine Ethereum’s forecasts for this period.\n\nThe market dynamics that have led Ethereum price forecasts to $5,000\n\nBefore diving into future projections, it is essential to evaluate the current market dynamics of Ethereum. According to the latest data, Ethereum is trading at 3,801. This valuation reflects Ethereum’s constant growth trajectory, supported by key updates and increasing adoption in various sectors.\n\nThe recent performance of Ethereum has been influenced by several factors, including technological advancements, regulatory developments, and market sentiment. The implementation of the Shapella upgrade in April 2023 has contributed to a significant surge in prices, highlighting the impact of protocol improvements on investor confidence.\n\nLooking ahead to the end of 2024, Ethereum is set to undergo further developments and updates that could influence its trajectory. The anticipated Dencun upgrade, expected in the coming years, is set to introduce improvements aimed at increasing scalability, security, and functionality.\n\nFurthermore, Ethereum’s transition to a proof-of-stake (PoS) consensus mechanism is a milestone that could influence its long-term sustainability and performance. By replacing the energy-intensive proof-of-work (PoW) model with PoS, Ethereum aims to improve efficiency and reduce environmental impact, aligning with the market’s growing ESG (Environmental, Social, and Governance) considerations.\n\nRegulatory developments also play a crucial role in shaping Ethereum’s prospects. As governments around the world address the regulatory landscape surrounding cryptocurrencies, clarity and compliance measures could have an impact on investor sentiment and market dynamics.\n\nPrice forecasts and analysts’ insights\n\nSeveral analysts and experts offer insights on the potential price trajectory of Ethereum by the end of 2024. Cryptonewz predicts that ETH could reach $5,000 by the end of the year, thanks to fundamental factors such as protocol upgrades, increasing adoption, and broader market trends.\n\nFurthermore, the bullish sentiment surrounding the Ethereum ecosystem, including decentralized finance (DeFi) applications, non-fungible tokens (NFTs), and decentralized autonomous organizations (DAOs), could fuel demand and drive price appreciation. These innovative use cases demonstrate the versatility and utility of Ethereum beyond traditional cryptocurrencies.\n\nOn the other hand, market volatility and external factors such as geopolitical events or macroeconomic trends could introduce uncertainties and fluctuations in the price trajectory of Ethereum. It is essential for investors to consider risk factors and conduct thorough research before making investment decisions.\n\nBeyond price predictions, investor sentiment and adoption trends provide valuable insights into Ethereum’s long-term prospects. As more institutions and retail investors embrace cryptocurrencies as an asset class, Ethereum is poised to benefit from increased liquidity and demand.\n\nFurthermore, the vibrant Ethereum developer community continues to drive innovation and build decentralized applications (DApps) in various sectors, from finance to gaming to supply chain management. This ongoing growth of the ecosystem strengthens Ethereum’s position as a leading blockchain platform and enhances its utility and value proposition.\n\nConclusions\n\nIn conclusion, Ethereum’s predictions for the end of 2024 remain influenced by a combination of technological developments, regulatory factors, market dynamics, and investor sentiment. While price predictions offer guidance, it is essential to consider the broader ecosystem and fundamental factors that determine Ethereum’s trajectory.\n\nAs Ethereum continues to evolve and mature, its ability to innovate and adapt to changing market conditions will be crucial to sustain its growth and relevance. By staying informed and monitoring key developments, investors can make informed decisions and navigate with confidence in the dynamic landscape of the cryptocurrency market."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE01dVl6MXgtX3V5bWpKV1hsXzZUclFHQWpmT0lQX09wcGhtY3RtVXpobFJKVDV0YXlxR2tucTYxS3YtM2RJX2ZwMHM1bWcyUFNjVHB2WE4wMm1zUzN6LXpURXR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 17:01:57 GMT",
        "title": "‘​​The Polyverse Testnet’ is live, bringing IBC to Ethereum - Blockworks",
        "content": "Polymer, an Ethereum rollup that is hoping to become Ethereum’s interoperability hub, has launched the Polyverse Testnet, becoming the latest team hoping to tackle blockchain interoperability.\n\nThe testnet will be launched in three phases dubbed ‘Basecamp,’ ‘Into the Unknown’ and ‘Discovery.’ The first phase, Basecamp, will be live starting today and is designed to incentivize developers to facilitate liquidity onto the testnet from other rollups.\n\nPhase 2, Into the Unknown, will commence the following week, where Polymer will select a handful of decentralized apps to promote to end users, who will also be able to receive rewards. Then the final phase, Discovery, will focus on refining and optimizing incentive mechanisms to drive participation.\n\nThe blockchain interoperability problem\n\nLike many cross-chain messaging and bridging protocols today, Polymer was created to solve the issue of blockchain interoperability.\n\nRead more: Interoperability isn’t just a buzzword\n\nBlockchain ecosystems today remain relatively isolated from one another, meaning they can not communicate or interact with each other — creating terrible user experiences for their customers.\n\nAn example of this in Web2 would be being unable to send emails from your Gmail account to an Outlook account.\n\nTo address the communication barrier, cross-chain messaging protocols and other interoperability solutions have sprung into life as a means to enable blockchains to safely transfer valuable information to each other.\n\nThis type of infrastructure is critical to blockchain scaling, as evidenced by the attention and interest it has received from investors.\n\nWormhole, one of the largest cross-chain messaging solutions today, secured $225 million in a private token sale, which saw interest from Brevan Howard, Coinbase Ventures and Multicoin Capital late last year.\n\nSimilarly, LayerZero locked in a seven-figure Series B fundraise, where investors from a16z, OKX Ventures and Sequoia Capital gave the protocol $120 million to expand its operations.\n\nPolymer also recently revealed that it acquired $23 million to bring Cosmos SDK’s inter-blockchain communication (IBC) protocol to Ethereum.\n\nRead More: Polymer Labs secures $23M to bring IBC to Ethereum\n\nPolymer’s approaches to interoperability\n\nUnlike many interoperability protocols today, Polymer is not designed as a third-party bridge but rather as a layer-2 Ethereum rollup solution that serves a similar purpose to the ‘interoperability hub’ on Cosmos. It aims to provide IBC to Ethereum and connect with other layer-2 solutions.\n\nIBC, unlike many other interoperability solutions today, is not a bridge application but a network standard, Devain Pal Bansal, a product analyst at Polymer Labs, told Blockworks.\n\n“The biggest benefit of introducing it to Ethereum, particularly Ethereum rollups, is that it extends the capabilities of how a rollup settles on Ethereum via the native bridge and extends it cross rollups – without a third party required to attest to data or its validity by simply using the shared source of truth for all rollups – Ethereum,’ Bansal said.\n\nTommy O’Connell, a senior product manager at Polymer, explained to Blockworks that applications can build their own bridges and control inbound and outbound messages using a layer-1 trust layer. This eliminates the need for an additional trust assumption of a third party.\n\n“This also allows us to be focused on enabling chains to join Polymer’s ecosystem of chains with just a SINGLE connection to the hub, mitigating Polymer being a blocker for growth,” O’Connell said.\n\nThis differs from Wormhole, for example, which relies on a 13 of 19 supermajority to attest to a message before it is produced or sent. It is also different from Axelar, which relies on validators for attestations.\n\nIt is important to note, however, that Polymer’s minimum viable product (MVP) will be limited to the Base and Optimism at the testnet launch.\n\nThough this is the case, O’Connell notes that there are immediate plans to grow to other OP stack chains and soon after to other chains such as those in the Cosmos ecosystem.\n\n“The primary benefit for OP stack rollups is that we have built an IBC client for OP geth, which enables us to extend the capabilities of native L1<>L2 bridge across rollups. It is particularly appealing because we can unlock other chains built on the OP stack with minimal expansion effort,” O’Connell said.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNa2xnZVE0ajNkY0NCdk50TnlwNTAtck5aT3d0RkVRQVpQaUdxVTl5VndTcldyQ2NLYW9Fd2xsZjA3MVdLMW0zZWZiVWFkVzRVSGl3SGVBM1VEMkpMbDNwb0pXdmFhT1o2Z204NGttZlIyR3FLWUNjRklZVGFLREw5alNUbUJ4YlZjVDdHbHFfR1RJcW5nOUZ3MFJFSEVCSzVTZ1A5ZXY2cWRQcE1UUU9KM2Q4a0RSRHVxUHpVMXJnd1dFRlpOX25hUmI5Wlg0dFZBY2fSAdcBQVVfeXFMUDZFajZyd0FpZHl5WHZJcFVweDQ0RlA0RHFuY3BlZHVXeEh1OXJEOWdHWFJWRWNFakZ5Z1ZwLUo5OEFfOVRycHF1SFZjTldXVFB1amZRR08tSl9CWVV4NXFhbVJ4Uy0yU2x6WENub0trWmNGVlk4ZHdUQ0JURmdPQ3NWUFI3UkQ1NmczU19iRlZnbEpheDlJNGs4YVN2V2l1OWhwMlRyX3NaOV9HdzFOZHktaFBQN0diSXpVeVNnYjdTcXhFYlVYbGFKTWJBd21LelZPbDFkV1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, XRP & Bitcoin – European Wrap 6 March - FXStreet",
        "content": "Ethereum (ETH) price climbed on Wednesday while several other cryptocurrencies wiped out their recent gains following Bitcoin’s price rally and its subsequent pullbackon Tuesday. Ether resumed its recent uptrend towards the psychological $4,000 target despite mass profit-taking by holders.\n\nThe Dencun upgrade, a key technical development on the Ethereum mainnet, is scheduled to go live on March 13. The upgrade marks an important milestone for Layer 2 chains and rollups. The Dencun upgrade is the most significant upgrade for the Ethereum blockchain since the Merge, where the chain shifted its consensus mechanism from Proof-of-Work to Proof-of-Stake. Developers have set March 13 as the date for Dencun’s mainnet release.\n\nXRP price slipped below the key psychological level at $0.60 as Bitcoin experienced a sharp correction after briefly touching a fresh all-time high on Tuesday. The altcoin, which recovered slightly on Wednesday from a low at $0.5386, could see further declines with the upcoming developments in the SEC vs. Ripple lawsuit.\n\nThe payment remittance firm’s Chief Legal Officer Stuart Alderoty said that the Securities and Exchange Commission (SEC) has shown “a bad faith practice” by citing a default judgment from a relevant legal issue.\n\nWhat’s next for crypto after $1 billion in liquidations?\n\nBitcoin (BTC) price action on Tuesday created a new all-time high at $69,387, but it was soon followed by a steep correction that triggered one of the biggest liquidation events. Despite such a fallout, BTC is very close to reaching the pre-crash levels. Surprisingly, the crypto market and its participants remain bullish.\n\nWhen Bitcoin's price dropped nearly 6% on Monday, many investors saw this as a sign of a potential correction or a lower low setup. But on Tuesday, BTC bulls swept the previous ATH at $69,000 and set a new one at $69,387, cleaning out the bears. Quickly following this move, BTC crashed violently, shedding nearly 15% of its value in less than five hours, rinsing the late bulls. This price action was a classic example of a double whammy, where market participants on both sides were rinsed."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxNU3NnV2toWE9DbXJwWU1wTzh1N0dISlN6RU16cmxmQmJHNnJUYlNVMVpUbFk3UWhUV2xtNkpKNlE5dmItR1NfeFljelZBLWRnbnNmczR6Y2JocFVYU0tYN2RMaEltQ2JhZ3daTXBaTnd2R0x4NlVMTWVWbDVGY1djX3NzRS16aUpyaXBzSVRkS2pOai1VSzkzem5nVWE4blhFSUpWc2F1Rk9ibFpWMzNyMzBSOG53WG85V2I4M0lPa0Jfbl9ZVV9xakVja1dWVktVMTRyYWpB0gHbAUFVX3lxTE9nR255c0J2UDJrQ2xzNkJTZWVDT0F1UDNUN1JrV21VbTFrOXFyMW5lQkxWRklYLTZ6Y3ZUZ3hrWkJRNUZkbW9HaEdQa3VDUWV1ZXpOX1Y4YV95QzhkWlJpZ1Bzbk0tLTFPcFo3SXFnSWRsVlctbWxzaEdSa1RWb3lwbERzUzlVcEFHbHoydFNsQ1M0REtJOHhHeEwtdXZYTmcwdGxnMGhjaFZwMm9vNERYNmp3MDdSbHd4Ri1rcWRSczNMRjVzZXRYenE5SG84QTNpTzgwM1p6dHRMdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "US SEC further delays decision on BlackRock's spot ethereum ETF - The Economic Times",
        "content": "Did you Know?\n\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOWFhud1VmZ2hDYndLbjQ0dmtwX1I2MXV4VzN5aFRGZXJDd09ITU1KNjVnYnF2OWt1OGJLQ0dlRTJIZERwb3I4RVdheGMwNGJ5Y0NFNmUwalNlMmt5akhSM2h4S3M2TW82QWZ4RUlnODdoV1h6Vk1CcGl1aFh3TktVMmhIZlJNbXY3WllXU3hBODJkZ0NvZlZZblRR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Chart of the day - Ethereum (06.03.2024) - XTB",
        "content": "The recent days have been very volatile in the cryptocurrency market. Yesterday, Bitcoin broke its historic all-time high (ATH), momentarily surpassing the $69,000 level. However, shortly after this, there were cascading declines due to the over-leveraged state of the market. Bitcoin briefly fell below $60,000, and Ethereum approached $3,200. Nevertheless, as quickly as the declines happened, they ended just as swiftly. Today, we are observing a strong rebound. The BTC price has returned above $66,000, and ETH is gaining to the level of $3,770.\n\nLooking at the historical behavior of capital in the market, Bitcoin breaking its previous ATH initiates the start of capital flow to Ethereum, and then to smaller projects. We are observing such a movement in recent days. Ethereum has two very important events ahead. One of them is the Dencun update, followed by the approaching final deadlines for ETF applications. On this wave, it's possible that the bulls might strive to break through the $4,000 level. In such a scenario, the ETH price would still be nearly 20% below its ATH.\n\nSource: xStation 5"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQNjJvbHMzSnVIeDJyNmoyLV9xRTQ1LUhHNWk2ZS1XdGZKSEY3YktwQV9ocHZxYzJQdUluNnFFc0F6MzlKTmJDVmxtUWk1aWFtT1hNYzJKbFIxU1N1Y25oU2hSRktnQ0FzUkZiUkZ2U2I2d2QwTWt3V3ZMb3VzbzI1WlpIRkpIWmJaS3d3UWJaYmdYdlZtUzIyZWVQa09kQzl3YjExMEJKS1k4QdIBrwFBVV95cUxPT2ZyaVlmLXRDaEdoX2lpNGcxNE1KVDg1azhXMnNLYkJJcUdIWFZ2Q0ZqTmw2Vl9KZVVrU2JrQmQ5Y2JJcXNXNm9fNjR6dGw0VEo4TS1ycGduemlabTNmdmVwRkxfT2VpZzEyRThONERROUZ4MmNTVWRlRm9Dak1BVTB3aXA0MXVma1MwQkxnSzhtVmZjaHdXa2VoZnJJVXI1dkkycE5zTHFYTVlvbl93?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Classic Price Forecast: Will ETC Soar To $60 Mark By The End Of March? - CoinGape",
        "content": "Ethereum Classic price forecast: ETH has emerged as a standout in the decentralized blockchain sector, with its price making a remarkable jump of 5% within a mere 24-hour window. Currently, the Ethereum Classic price is trading at $36.41. This upward trajectory suggests a bullish trend is unfolding in the market for Ethereum Classic.\n\nEthereum Classic’s trading volume has seen a robust increase, soaring over 196% to reach $1.7 billion in the same time frame. This surge in trading activity points to a heightened interest from the cryptocurrency trading community. Positioned 22nd on CoinMarketCap, Ethereum Classic boasts a live market capitalization of $5.17 billion, marking a significant milestone.\n\nadvertisement\n\nFor the first time since September 2022, the price of Ethereum Classic has climbed past the $35 threshold, catching the eye of investors and traders. Recently, the currency has witnessed a substantial rise, appreciating more than 45% over the past month and over 28% in the last week, following a bullish breakthrough.\n\nEthereum Classic Price Forecast: Bullish Trends Propel ETC Forward\n\nMarket momentum for Ethereum Classic accelerated after it fluctuated within a higher trend band, ranging between $30 and $37 for about a week. This movement culminated in a push past the resistance level. The market’s optimism is mirrored in the broader cryptocurrency landscape, with Bitcoin surpassing the $64,000 mark and Ethereum breaking the $3,400.\n\nIf the market maintains its current upward momentum, the price of Ethereum Classic (ETC) might soon exceed the $40 level. This progress could set the stage for a rally toward the $50 resistance area. An extension of this bullish trend could even test the $60 resistance barrier. On the flip side, a negative shift in market sentiment could push ETC back down to the $30 support zone, with a further drop to $20 possible if the situation deteriorates.\n\nEthereum Classic Price Forecast: Potential for Further Growth\n\nTechnical analysis of daily trading charts presents a positive outlook for ETC’s short-term path. The Moving Average Convergence Divergence (MACD) indicator shows promising signs, with a significant bullish indication as the MACD line overtakes the signal line, suggesting it’s a good time to buy.\n\nThe market’s buying strength is further underscored by the Relative Strength Index (RSI), which has climbed above 70. This points to a stronger buying momentum compared to selling pressure. Additionally, the Awesome Oscillator is displaying green bars, reinforcing the bullish sentiment in the market.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNNERCZjE5RnVHTlJVMlYxU3o1emszVzh4X2pFWVNWUjhTLUgtcDMwMUpXS0d0VzhqazF3MmU0QVVJTWhYcGx1UUFtckk4dlo4cktzbkE2NUFsa3hDbFdRaWRUUXgwbGpWRklyQ0QwTGppNGgtYThsRnRzN2xlVGVoS3I5ZGcxOE5tZmljNU9xSG5STlNGUmtKbkJNWmN4YmtLWTFBa2VMQVM1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum soars, beginning of the Altseason? Crypto analysis of March 06, 2024 - Cointribune EN",
        "content": "Wed 06 Mar 2024 ▪ 5 min read ▪ by Family Trading ▪\n\nEthereum recorded an increase of over 16% last week and reached the $3,500 threshold. Let’s examine the future perspectives for ETH together.\n\nCurrent Situation of Ethereum (ETH)\n\nEthereum continues its rise, reaching new highs. At the time of writing, one Ether is trading at approximately $3,850. Thus, the Ethereum price has crossed the 61.8% Fibonacci retracement level, calculated from its all-time high. It’s worth noting that ETH has recently experienced a bearish impulse which allowed it to test this level as support. It now seems to be targeting the 78.6% level, located just below $4,000.\n\nNaturally, Ethereum has continued its bullish trend. However, it is worth mentioning that its price has significantly deviated from its 50-day moving average, indicating a period of high volatility that may lead to a correction. It is not surprising that the momentum of Ethereum has been revised upwards, which is well illustrated by the oscillators, indicating that a period of overbuying might currently be underway.\n\nDaily chart of ETH/USD\n\nThe current technical analysis was carried out in collaboration with Elie FT, investor and passionate trader on the cryptocurrency market. Today a trainer at Family Trading, a community of thousands of proprietary traders active since 2017. Here you will find Lives, educational content, and mutual aid around financial markets in a professional and warm atmosphere.\n\nFocus on Derivatives (ETHUSDT)\n\nIt can be observed that the open interest of ETH/USDT perpetual contracts has been significantly more volatile than the price of Ethereum itself. Although funding rates have been positive, this reveals a period of uncertainty among speculators. With that said, it is clearly visible that Ethereum’s recent drop was accompanied by a decrease in its open interest and liquidations of long positions. This indicates that many buying traders left the market during the last correction. Nevertheless, it is important to note that these positions have already been partially reopened, accompanying an increase in Ethereum. This phenomenon thus demonstrates a growing interest in cryptocurrency.\n\nOpen Interest / Liquidations & Funding rate ETH/USD\n\nThe one-month Ethereum liquidation heatmap shows that the cryptocurrency has recently bounced off a subtle liquidation zone around $3,300. The interest shown at this level was predominantly buying, which contributed to the subsequent rise in ETH. Currently, the most significant liquidation threshold under its current price is around $3,000. The price’s approach towards these levels could trigger a massive ordering, increasing the possibility of a period of increased volatility on Ethereum. These zones therefore represent crucial points of interest for investors.\n\nETH/USDT Liquidation Heatmap (1 month)\n\nAssumptions for Ethereum’s Price (ETH)\n\nIf Ethereum’s price manages to hold above $3,350, we might anticipate a bullish continuation up to the levels of $3,900 or even $4,000. The next resistance to consider, if the bull run continues, would be $4,100 or even $4,500. At this stage, it would represent a rise of over +17%.\n\nIf Ethereum’s price fails to hold above $3,350, we could envisage a return to $3,000. The next support to consider, if the bearish movement continues, would be around $2,800. At this stage, it would represent a drop close to -25%.\n\nConclusion\n\nEthereum continues to show a bullish trend, crossing key Fibonacci retracement levels. Despite a recent bearish correction, Ethereum bounces back reaching new highs. Can we attribute this surge to the approach of the Dencun update? What is certain is that it will be crucial to closely observe the reaction of the price at various key levels to confirm or refute the current assumptions. It is also important to remain vigilant for potential “fake outs” and market “squeezes” in each scenario. Finally, let us remember that these analyses are based solely on technical criteria and that cryptocurrency prices can also evolve rapidly based on other more fundamental factors.\n\n“””\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPall0YVZ1RnQzSmprc1g0ZjBhT1RRc1V4SEg0SkpENjdURGNRZ3JZRUthQ2lmUjFPSXlxeW9aem5mb1RTZ1lCejlCWjVLaW5fb1BGLW5mVE5nTjhyVktCeEk4R1RXTGFxQkY3aU16OEFEZWZnSTBoUUotOFExbVV0MV9BVjU1U0h1RXEtTGtvSVBYQVhQSlc5T3VuMHZxMThq0gGmAUFVX3lxTE9uV2N2dlNlWkNwSUZHeUJxRkhSNlYwUjF3MHR5MUg4cDZLSEg0bDc2MnFHR1J6NkJiSW9CU3hQVTNZaDBDLXgwRFJhekM0SlhhcXJsZGxIaFYtdDdrVWNoYUZrMVljNTQ0N2szX0hVZWU5WHJPeU9FaEx1RVNZM1J5eDMwNkJaVnc0UWpoZDdtbzktYjM1WEprQ3E3UWxCc0JIRDFuVEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Why ETH Q1 Hype Cycle Could Peak Above $5,000? - CoinGape",
        "content": "Ethereum price prediction: ETH is slowly closing in on the crucial $4,000 level after Bitcoin price topped out at $68,537 on Monday, March 4. Select altcoins, especially meme coins like Shiba Inu (SHIB), Dogecoin (DOGE), Pepe, and more graced the market with triple-digit gains, accentuating the bullish theory.\n\nThe second-largest cryptocurrency, trading above $4,000 during US business hours, is only 22.83% from its record high of $4,891. Ether boasts a 7.2% increase in 24 hours on top of a 16% surge in a week and an impressive 64% in a month.\n\nadvertisement\n\nAccording to CoinMarketCap, ETH is experiencing a staggering accrual in trading volume to $33 billion, with the market cap rising to $456 billion. This significantly underscores the strong fundamental factors backing the current rally, including the Dencun upgrade on March 13.\n\nEthereum Price Prediction: ETH Goes Boom Ahead of Dencun Upgrade\n\nEthereum seems poised to break above $4,000 anytime from now. The unstoppable run is mainly buoyed by positive sentiment in the market as Bitcoin price rallies closing in on the all-time high, the anticipation for a spot ETF, and the upcoming Dencun upgrade.\n\nThe Ethereum Dencun upgrade will take place on March 13 following three successful testnets launches in the past months. This upgrade promises a lot of goodies for the Ethereum ecosystem such as lowering transaction fees on layer 2 protocols.\n\nNetwork congestion will also be addressed with the block size increasing to 25 MB from 12.5 MB. With proto-danksharding, Ethereum will finally address scalability issues.\n\nThe coming days before the upgrade are expected to shape the outlook of Ethereum price, compelling investors to position themselves by buying ETH.\n\nGrowing optimism for a spot Ethereum ETF is another factor driving the price. The approval of Bitcoin ETFs saw investors, stakeholders and potential operators of the products shift their attention to Ethereum.\n\nThe Securities and Exchange Commission (SEC) is expected to consider greenlighting spot ETH ETFs, further fuelling interest in the cryptocurrency.\n\nRecommended: 4 GameFi Rising Altcoins On The Move As Bitcoin Flirts With ATH\n\nAssessing ETH Price Technical Outlook For March\n\nAfter stepping above $3,800, Ethereum price teeters at $3,803. In addition to the bullish sentiment across the market, the uptick in price has been reinforced by the Moving Average Convergence Divergence (MACD) indicator as it rises above the neutral area.\n\nKey bull market indicators like the 20-week Exponential Moving Average (EMA), the 50-week EMA, and the 200-week EMA are still catching up with the uptrend, signaling that the rally is far from over.\n\nTraders would be interested in the way ETH price reacts to resistance at $3,800 over the coming sessions. A daily close above this level could trigger a larger breakout as bulls target highs above $4,000.\n\nThe expected increase in buying pressure due to the Dencun upgrade will also boost the price towards the all-time high. Hence, the likelihood of Ethereum soaring above $5,000 in quarter 1.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPTE1BZ1dkRTRHWjM5R0RsWm84OUdoS2RZRVRjWlZDbC1EM0hhTm9KYmhiSS0zQ1g0N3JqY0JGQlVvNWFROGthY3VkNlM1Z1cyLVAtTXEwRmIteHluazJ5cVNrcDRUblVQdVhGbWJIUEtoYzA0VEt1ZDVxOGFnZDR0OWRWRWXSAYoBQVVfeXFMTTRRb0ttV2lCcDVqaG9qVkpCenowRjFuSkJkLW52Q0JYWGNHZU5Wd3hMWlQwUGRFZEdLLXV2NzNjNHo2YzluS3BfYXBvN2tWd3ZPMlJDLThPT1ZJZ0NweGtaUS1WOVU1cUw5ZlVWVTdtcVI3MV84UUF3a2taemVpdVlBVVpXaWhDTmpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "What next for Ethereum as SEC delays spot ETF proposals - AMBCrypto News",
        "content": "SEC postponed its verdict on the applications for spot Ethereum ETFs from BlackRock and Fidelity.\n\nPrice of ETH remained unaffected and continued to grow.\n\nThe United States Securities and Exchange Commission (SEC) decided to postpone its determination on the approval or rejection of Ethereum [ETH] exchange-traded funds (ETFs) submitted by BlackRock and Fidelity, according to filings made on the 4th of March.\n\nSome delays\n\nIn January, the SEC initially deferred its decision on the Ethereum ETF applications from BlackRock’s iShares Ethereum Trust and Fidelity’s Ethereum Fund, shortly after granting approval for several spot Bitcoin [BTC] ETFs.\n\nThe regulatory body has the option to delay its decision up to three times before reaching a final verdict.\n\nMarket observers and ETF analysts had long anticipated the SEC’s delay, speculating that a decision on approving or denying the ETFs would likely coincide with the approaching final deadline in May.\n\nBloomberg ETF analyst James Seyffart emphasized 23rd May as the crucial date, marking the deadline for VanEck’s spot ETH ETF application.\n\nHowever, opinions vary on the significance of a spot Ether ETF compared to spot Bitcoin ETFs.\n\nWhile BlackRock’s iShares Bitcoin ETF has already amassed an impressive $10 billion in assets under management, Bloomberg ETF analyst Eric Blachunas expressed reservations about the impact of the yet-to-be-approved Ethereum funds, describing them as “small potatoes” in comparison to their Bitcoin counterparts.\n\nDespite this, Blachunas and Seyffart planned to provide formal odds on the likelihood of an ETH ETF approval.\n\nPotential impacts\n\nThe prolonged uncertainty surrounding the approval of ETH ETFs can contribute to an atmosphere of unpredictability within the cryptocurrency market.\n\nInvestors and enthusiasts eagerly await regulatory decisions as they can significantly influence market dynamics. The repeated delays by the SEC may lead to frustration and impatience amongst investors.\n\nMoreover, the delay might be interpreted by some as a lack of regulatory clarity for Ethereum-related financial products.\n\nUnlike Bitcoin, which recently saw a successful rollout of spot Bitcoin ETFs, the repeated postponements for Ethereum ETFs could create a perception that Ethereum’s regulatory framework is less defined or more challenging to navigate.\n\nThe comparative hesitation and cautiousness of the SEC in approving Ethereum ETFs, especially when contrasted with the swift approval of Bitcoin ETFs, could signal potential concerns or reservations specific to Ethereum.\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nDespite these factors, the price of ETH continued to soar. At press time, ETH was trading at $3,469.49 and its price rose by 1.56% in the last 24 hours.\n\nThe volume at which ETH was trading had spiked as well and had increased from 12.15 billion to 22.9 billion during this period."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPZVBvX0JfNHJiSmthcGxPWmRRa25hV1dJYlZxNTBEcXFQUF9tTGNBX05sY0lRTXJVNjEwVUtoQkdwSUgzSzNtYTRMbVJSS1JweUdiSTktTGJvS2ZHZkRta0F3QXUxekNGNWlqVXhqV1BxbmZPSXVxeEJBNHA1aFp0blVlXzk3a2I2S2VlSWVXWkpWRGZtaFppRW53Y2ZVTEVtQnZB0gGoAUFVX3lxTE4zZE9yT0RkWHU3anlraDlQMmptbm5VT2NkSHdPb3pNM3JrMUV2bTgtUnpQZXZJNnBRVTJUX1N1TWZwR2ZYYk1kQlZCaHUxUDNvVWh4Vm03Wjg0YXMtVjBGUzhiLU00WG96NURmUTdZSV96OVA0ZGN2SnJ1SlpqUEltYmt5NlFycldEOFlJVzFScllSd202aTZYb2R3dUw4dTFLaEhTQTQtZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "ETH Price Shoots Past $3,700 Despite SEC Refusing BlackRock Ethereum ETF Approval - CoinGape",
        "content": "The world’s second-largest cryptocurrency Ethereum continues on its mega bull run with the ETH price skyrocketing all the way past $3,700. As of press time, ETH is trading 7% up at $3,713 with a market cap of $446 billion.\n\nSEC Delays BlackRock Spot Ethereum ETF Proposal\n\nOn Monday, March 4, the U.S. Securities and Exchange Commission (SEC) announced a delay in its decision timeline regarding BlackRock’s proposal for a spot Ethereum ETF. This marks the second postponement of the SEC’s decision on BlackRock’s iShares Ethereum Trust.\n\nadvertisement\n\nAdditionally, the SEC has sought public feedback on whether the ETF should be approved, particularly focusing on concerns related to Ethereum’s proof of stake mechanism and its susceptibility to fraud and manipulation.\n\nSimilarly, the SEC has deferred its decision on Fidelity’s spot Ethereum ETF. The agency has requested public comments on this matter, posing similar questions as those raised for BlackRock’s proposal. The public should submit their feedback for both proposals within the next 21 days, with rebuttals expected within 35 days thereafter. May 23, is the final deadline for VanEck’s spot Ethereum ETF application, which will put greater clarity on the SEC’s decision on the matter.\n\nThere’s a division among crypto experts regarding the potential approval of a spot ether ETF. Optimistic voices suggest that SEC approval could arrive as soon as May, drawing parallels to recent Bitcoin ETF approvals paving the way. However, skeptics maintain a cautious stance, expressing uncertainty about the likelihood of spot ether ETF approvals.\n\nEthereum Price Rally to $4,000 Soon?\n\nConsidering the current Ethereum price action, it is clear that investors have decided to look past the Ethereum ETF approval for now. The most important event ahead is the upcoming Ethereum Dencun upgrade in a week or two.\n\nEthereum has surged above the $3,650 mark, surpassing the 100-hourly Simple Moving Average. On the hourly chart of ETH/USD, a bullish trend line is forming, with support emerging around $3,600. This trend line closely aligns with the 50% Fibonacci retracement level of the recent upward movement from the $3,465 swing low to the $3,715 high.\n\nLooking ahead, immediate resistance is anticipated near the $3,720 level, with the first significant hurdle at around $3,780. Beyond that, a major resistance zone lies near $3,850, signaling potential bullish momentum if breached. Further upside could see Ethereum targeting the $3,920 level.\n\nIn the event of a breakthrough above the $3,920 resistance level, Ether might potentially surge towards the $4,000 resistance. Further upward momentum could prompt a test of the $4,200 mark.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQNDBlRjRiREFpMHVHWHB1bENydXBESWlnRG9QVFBOUjM3di0zUDZWSnBFVkd6Z0Mya3E3bUlsbXpsRjMyRF9XR243amZtalExQ2dWdjlnbDd1dEtPY25TOTNZN05WOWhMUXRmUHBSQTVWOGNkclJLZk1FUnd0WUZxVnVCUnpmTE51anA4cms0Q1A3SGpEcWfSAZsBQVVfeXFMT2I0Z1ZydVZDNjloNUZTS2VzR09sbU40YlByalJQbUw2TnFrdjY3c25lMHlNY1dzN1V3dlJUdEw5RmliLWNua1pvSEdjTXJsN1lpQ3FMeGFWNWYwWDVXeklZT2xSMGVTYUV2dWVyQjVWNjBKRnJjZFNEVElCbk5QWE9OV0N2ZDB3YlBhOUJIN002WFo3RGFEUzNTRFU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Foundation Dumps $13 Million Worth of ETH; Is a Sell-Off Ahead? - CoinGape",
        "content": "The Ethereum Foundation has executed a significant transaction, liquidating $13.3 million worth of Ethereum (ETH), which has caught the attention of investors and market analysts alike. This move by the foundation, known for its influential role in the cryptocurrency sector, has sparked discussions regarding its potential impact on Ethereum’s market position.\n\nDespite the sale, Ethereum has shown resilience with a bullish trend, currently trading at $3580.74. This represents a 14.6% increase over the past week, with a robust market capitalization of $420 billion and holding a 17.8% dominance in the crypto market, as reported by CoinGecko.\n\nadvertisement\n\nBitcoin (BTC), the leading cryptocurrency, has also seen substantial gains, rising over 28% in the last seven days and nearing its all-time high of $69,000 in November 2021. The current BTC price hovers around the $67,000 mark, highlighting a period of overall growth in the cryptocurrency market.\n\nUpcoming Ethereum Network Update and Market Dynamics\n\nAs the Ethereum network gears up for the Dencun update, a combination of the Cancun and Deneb updates, the cryptocurrency community is closely watching the potential effects on Ethereum’s scalability, efficiency, and security. This update, scheduled for March 13, aims to reduce layer-2 transaction fees significantly. The Ethereum Foundation has already successfully upgraded test networks, signaling readiness for the mainnet activation.\n\nEthereum’s user base continues to expand, with 1.8 million new users joining the network last month, increasing the total number of ETH holders to 115.5 million addresses. This growth contrasts Bitcoin’s slight decrease in wallet addresses, underscoring ETH’s strengthening market presence. The reduction in Ethereum’s exchange supply by $2.3 billion further sets a positive stage for its price trajectory, potentially pushing it towards the $4,000 mark in March 2024.\n\nRegulatory Landscape and Future Prospects\n\nThe cryptocurrency sector closely monitors the U.S. Securities and Exchange Commission (SEC) as it engages with applicants for spot Ethereum ETFs later this month. This meeting is crucial for determining the future of Ethereum-based investment products, with decisions expected to be postponed until May at the earliest. The SEC’s handling of these applications, including those from leading firms like VanEck, BlackRock, Franklin Templeton, Grayscale, and Invesco Galaxy, will be pivotal in shaping the regulatory framework for cryptocurrency ETFs in the United States.\n\nFollowing a landmark lawsuit by Grayscale against the SEC, the approval of spot Bitcoin ETFs in January marked a significant moment in the broader acceptance of cryptocurrencies as legitimate investment vehicles. The upcoming decisions regarding spot Ethereum ETFs are anticipated to further influence the market dynamics and regulatory stance towards cryptocurrencies in the U.S., with potential implications for Ethereum’s market performance and investor sentiment.\n\nRead Also: Anthropic Launches Chatbot To Rival ChatGPT and Google Bard\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOcDk1RW9XSjFxSFkwV0pqdjl4RU1XZjdXcUY4ZXlLZzRSR0lWRC1pbVhvLTNVQk1GRHg1Si02cy1QdFRSTHJlb1p6c18td3B5VTNlMkkwS0U5c3dqZ1F6aGItTHZBOXo0eXRiZlo5OWszZUNBMFRWWGZ1dTRtNnlObFRZV2JxcHJPZm5kTVl3Z0EtVFQxQjdBZ0x3aV93emRlMjJhNGlLTW1kNXljT3ZvaGVaRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Drops Over 10% But Bulls Are Not Done Yet - TradingView",
        "content": "Ethereum price rallied toward $3,850 before crashing. ETH followed Bitcoin, but the bulls are now active near the $3,350 support zone.\n\nEthereum traded to a new multi-month high above $3,800 before crashing.\n\nThe price is trading near $3,500 and the 100-hourly Simple Moving Average.\n\nThere was a break below a key bullish trend line with support at $3,620 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could resume its increase if it clears the $3,600 resistance zone.\n\nEthereum Price Takes Major Hit\n\nEthereum price extended its rally above the $3,650 level, like Bitcoin. BTC surged and even traded to a new all-time high above $69,000. ETH also cleared the $3,800 level before the bears appeared.\n\nThere was a strong bearish reaction from the $3,827 high. The price crashed over $500 and traded toward the $3,200 support. There was a break below a key bullish trend line with support at $3,620 on the hourly chart of ETH/USD.\n\nA low was formed at $3,211 and the price is now attempting a fresh increase. There was a move above the $3,500 level. The price climbed above the 50% Fib retracement level of the downward move from the $3,827 swing high to the $3,211 low. Ethereum is now trading near $3,500 and the 100-hourly Simple Moving Average.\n\nImmediate resistance on the upside is near the $3,550 level. The first major resistance is near the $3,600 level or the 61.8% Fib retracement level of the downward move from the $3,827 swing high to the $3,211 low.\n\nNewsBTC\n\nSource: ETHUSD on TradingView.com\n\nThe next major resistance is near $3,680, above which the price might gain bullish momentum. The next stop for the bulls could be near the $3,820 level. If there is a move above the $3,820 resistance, Ether could even rally toward the $3,950 resistance. Any more gains might call for a test of $4,000.\n\nMore Losses In ETH?\n\nIf Ethereum fails to clear the $3,600 resistance, it could start another downside correction. Initial support on the downside is near the $3,440 level.\n\nThe first major support is near the $3,400 zone. The next key support could be the $3,340 zone. A clear move below the $3,340 support might send the price toward $3,220. Any more losses might send the price toward the $3,120 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $3,400\n\nMajor Resistance Level – $3,600"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNWkNTcXlRLW9WV3NUUWNoN1FwaktDYzN2cUNwMkZUaGY2elhfQXgwYTgzak8wTXcwVzBYUWlWMXlKbnppdmhFZU5PNWZXUGlmbHZOS1ZmQVFST3dmUmlBTzUwanB1QUZtS3R4MzFZQlZST2wxdWVMX0ZFYTlYcGZTSDQ0TmJ6RGo4MlBrcDloejdYdlduVk5iZ0NhSHd5M0NoYjRJYdIBqgFBVV95cUxQLWJfQ1NIdC1qa1UzOWc3S04tLTBfQUJ5SzE1WV9ZX3ZWcXdsWEF0Y2prbW1lb1U4SDdmN2lWamxWcUFiVlhKQXVrZHpTSlJ6dnBxMU9HQm9KNWE3MUE1SjJkRU9pc2dTNC03azY4dkU2b0l4NnZVaG1SYW11YUR2QXhBT2g1OGg5TkdfTzNQdTdfdjktOERZVzdKdV9Ka2RHdnFBWE1hQ3Z5UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Liquid Restaking Tokens: What Are They and Why Do They Matter? - CoinDesk",
        "content": "Liquid Restaking Tokens: What Are They and Why Do They Matter?\n\nLRTs repurpose staked ether to support external systems like rollups and oracles with an economic security layer, explains Marcin Kazmierczak, Co-Founder of RedStone & Warp.cc.\n\nBy Marcin Kazmierczak Mar 6, 2024 at 6:55 p.m. UTC\n\nElection 2024 coverage presented by Stand with crypto"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPMmdzYmxkZ0RCWXRybG1JczA4OGg1dDIxeThRajhXQmVGUnRmRVZSUmZnQlg4QkgySXJEWnh1c3JreTdWWkRMTnJvWUl0VnduaHB2MVluSHJuMFFIWXktVXFkNW5iekJqZEMxN1JDNlNsZEl1RHdjR1dUc1ZkSkdLX0lCR3JWTVprQkI3ZTdmNFJ4NHBBMHJObHFib0xaR0HSAaQBQVVfeXFMUFRWYjktZVhuWDFXc2NTdWx5Tm9ZcUZ1X0dHVThueUc2VktzcEVTeEdxSFY3RE00X2h6dFRpMVJtM21wdFFNaHRtcS1xbzBJUVFxTHBlbHJUcnk0UXdhQTlfay0xZnN3UHJJX1FCbmFhRWkzZnF6V2ZMOU5GbVdvbWFzb2Rkem0wS0xnZGR5VnFoazNIcllqSkZCbEZ3NjI3TS1VNS0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "5 Under $1 Ethereum Layer 2 Altcoins To Buy As Dencun Upgrade Beckons - CoinGape",
        "content": "The impending Dencun update, poised for March 13, is set to elevate Ethereum, potentially driving its price above $3,800 amidst bullish trends. This significant upgrade highlights Ethereum’s enduring advancements and its crucial role within the blockchain sphere.\n\nDrawing attention to five promising Ethereum Layer 2 altcoins priced under $1: Skale (SKL), Loopring (LRC), Mantle (MNT), Myria (MYRIA), and Gelato (GEL). These tokens, emblematic of innovation and scalability within Ethereum’s ecosystem, present compelling opportunities for portfolio diversification in anticipation of the Dencun event.\n\nadvertisement\n\n1. Skale (SKL)\n\nSkale (SKL) stands at the forefront of the decentralized world, offering a groundbreaking network designed for developers. It’s a unique platform that supports the creation of custom blockchains and decentralized apps, all within Ethereum’s vast ecosystem. This initiative directly addresses Ethereum’s scalability hurdles and the high cost of gas fees, providing a viable alternative for developers.\n\nThe network’s currency, the SKL token, follows the ERC-777 standard, fulfilling a dual purpose. It not only incentivizes network participation through staking rewards but also plays a pivotal role in governance decisions.\n\nPresently, SKL is priced at $0.1054 despite a slight decrease of 5.76% in the last day. However, it has surged by more than 45% in the recent month. With a market cap of $546 million, it ranks as the 140th largest cryptocurrency.\n\n2. Loopring (LRC)\n\nLoopring (LRC), a pioneering Ethereum layer-2 solution, leverages “zkRollup” technology for superior DEX performance. This approach consolidates transactions away from the chain. It employs zero-knowledge proofs to achieve reduced costs and enhanced transaction speeds compared to Ethereum’s mainnet operations.\n\nThe platform’s native token, LRC, plays a crucial role in staking, governance, and securing fee reductions within the ecosystem. As “zkRollups” continues to gain prominence as a top-tier layer-2 methodology, Loopring is poised for significant growth in 2024. This positions it as a key alternative coin purchase ahead of the anticipated Dencun network upgrade.\n\nCurrently, LRC’s price stands at $0.3503, witnessing a 7.03% drop over the past day following a modest market adjustment. Positioned at 154th on CoinMarketCap, its market capitalization is now $478 million.\n\n3. Mantle (MNT)\n\nMantle (MNT) has swiftly risen within the Ethereum Layer 2 network rankings, clinching the fourth spot in Total Value Locked (TVL) just two months after launch. This climb reflects a surge in investor interest, buoyed by an Annual Percentage Yield (APY) of 7.2%. Boasting the ability to process up to 200 transactions per second, Mantle underscores its processing strength. Its performance heralds a robust challenge to its peers in the Layer 2 space.\n\nWith its efficient and scalable nature, Mantle has become a notable contender. The token’s price now sits at $1.01, following an uptick of more than 12% in the preceding week. Such growth earmarks it as one of the prime cryptocurrencies for purchase today.\n\n4. Myria (MYRIA)\n\nMyria emerges as a purpose-built Ethereum Layer 2 scaling solution, focusing on NFTs, blockchain gaming, and more. Developed in partnership with StarkWare, Myria’s solution promises instant trade confirmations and zero gas fees for NFT transactions. This is achieved without compromising the security of user assets.\n\nUsing StarkWare’s STARK prover and Zero-Knowledge Rollup (ZK-Rollup) technology, Myria can compress numerous transfers into a single transaction. This efficiency enables it to support up to 9,000 transactions per second (TPS). Presently, Myria’s token value is $0.01454, marking a 2.17% increase over the last 24 hours.\n\n5. Gelato Network (GEL)\n\nGelato Network (GEL), a pioneering decentralized network, leverages bot technology for the automation of smart contract operations across major public blockchains like Ethereum, Polygon, and Fantom. This innovation allows web3 developers to delegate their DevOps requirements. Consequently, they can dedicate their efforts entirely to developing their primary product.\n\nThe latest price of GEL stands at $0.7671, marking a 5.28% increase over the past 24 hours. Positioned at number 485 in CoinMarketCap’s rankings, Gelato boasts a market capitalization of $84 million. The network reports a circulating supply of 109,951,523 GEL coins, while the maximum supply remains undisclosed.\n\nBottom Line\n\nThe Dencun upgrade positions Ethereum for a pivotal leap, making SKL, LRC, MNT, MYRIA, and GEL attractive prospects. These altcoins, emblematic of innovation and scalability within Ethereum’s ecosystem, offer a unique investment opportunity ahead of a transformative moment in blockchain technology, spotlighting the potential for growth and diversification.\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPVmtjV2xkaXJDNmZqaVJxLWVKS0hmWWlRMlh2TVVzSXNXUFNJQlRsUEphZUtJNG5VOWVQazIzcmV4OWFUZFFnUVZpdkxYNk9QQ0RkT01wa29pajgzX3dUQUF6RDFZR2phLU9jUFZNVWE1LXMxSm10M0NTOGtnVDh0WnVyOVkwT29QNnYw0gGQAUFVX3lxTE05TFhqUlI0Tm16ZFBmWGRmTHVBc09GZ2V6bjl0eWdMVGQ5WFRmSW8ySUpZWlNCRXo2cTRRQjNQUEY5UkY5dlZzSTByVHZUT2Q3NnJEMVlNZG5YNnZhYlpqbXQzWXdoUmxlUVFnZEJkOEI3eGhHajM3Z0hKLVpVWlhZcmJqUHJOaDVQc3FaWG0yMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Ethereum in the spotlight as weekly crypto inflows tap $1.84B - AMBCrypto News",
        "content": "Investment inflows linked to Ethereum rose to $85 million.\n\nThe price of ETH surpassed $3,600 and could hit $4,000 soon.\n\nLast week, digital asset investment products registered a total inflow of $1.84 billion. During the timeframe which ended on the 1st of March, Ethereum [ETH] hit its highest inflow since July 2022.\n\nAccording to the report provided by CoinShares, total trading volume hit $30 billion, indicating high interest in cryptocurrency-related products.\n\nHowever, most of the inflows went to Bitcoin [BTC] which accounted for 94% of the total. But short Bitcoin inflows also jumped, indicating that some investors were bearish on the coin. The report read,\n\n“94% of the inflows were into Bitcoin, totalling US$1.72bn, although recent price moves saw short investors double down with a further US$22m inflows into short-bitcoin investment products.”\n\nETFs offer the confidence\n\nFor Ethereum, its total inflows were about $85 million. The notable increase suggests that investors were looking to ETH exposure as the deadline to approve spot Ethereum ETFs nears. However, the Assets under Management (AuM) was shy of its all-time peak.\n\nFurthermore, AMBCrypto observed that the AuM hit $14.6 billion. But it was still far off the high of $23.7 billion. This number implies that the value of Ethereum funds controlled by institutions was still lagging.\n\nHowever, if the U.S. SEC approves the Ethereum ETFs, this position might change and the total AuM value might go higher. But as of this writing, there were rumors that the SEC might delay the applications.\n\nIn terms of the price action, ETH’s value has been increasing. At press time, ETH changed hands at $3,696, thanks to a 14.66% increase in the last seven days.\n\nVolume increases as ETH eyes a higher value\n\nWhen it comes to the volume, on-chain data showed that it has been increasing. As of this writing, ETH’s volume was 31.69 billion.\n\nIf the volume continues to increase alongside ETH’s price, then a higher value might appear in the short term. In a highly bullish scenario, ETH might cross the $4,000 mark within a few weeks.\n\nDespite the bullish sentiment, traders might need to be careful. If ETH slides below $3,500, the bullish thesis could be invalidated. Though it seems unlikely, it remains an option to watch out for.\n\nHowever, it is important to note that the total AuM hit $82.6bn. This was only a little away from the $86bn peak which occurred in early November 2021. If the inflows continue to increase as it had done since the beginning of the year, the AuM might surpass the 2021 high.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nIn addition, other altcoins were also involved in the flows. While Polygon [MATIC] had more inflows, Solana [SOL] registered high outflows:"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxORlktUGhxSlNsWWxQWXVhbV8xczlSSnB0WG9kUjVHMGtRb0tMN2RIMGRyOWZMY0M1Y0xkRlJfV2dlbkVXUjJyRVNqeURSNFgzNUV0YVBOTjFEcUc3SWEybEVvRmYzS3ZfTkd1TWo2MUtrZHI1SHFGX0FXRDBUbWxySU9zYnFVOF9XSWFrODh1UjJ6WjhkVDFRY1FTWGtVb295NnFVcjgxQ3VLM09jQnBNOHpTY03SAboBQVVfeXFMT00ySktvd0U3eGdOZ1dWTzNLSGN4TU5aWU91Q21WUEVIX09PTlFTVjhGZE1kaWhVWnFsemZ1cEVUV1RNOERQUVhRU2hLdkJNNmRKWVRvdEVoQ0RmZVNKQVBZUFAyVjgzVW5kRFFtMVlldEZJVzRtNF93RFRpWkxQbkhkVHd1cmU2UW1pcnlXOGdXVXlLc1RTQ3R5QUZsQ2pUaU1yVlhMLTZqaEJETG5zazFsMEw3VERGZV9R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Here's When Solana (SOL) Might Rally, Ethereum (ETH) Surges Again, Cardano (ADA) Volume Heralds New Heights - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nSolana has been a standout in the cryptocurrency space as a formidable competitor to Ethereum, especially in terms of transaction fees. As the market anticipates a reversal from recent pullbacks, many are eyeing SOL for its potential to rally.\n\nThe price chart indicates that SOL has been maintaining a strong uptrend, supported by a series of higher lows and higher highs, a bullish indicator in market technicals. The moving averages have positioned themselves in a manner that suggests sustained buying interest, with the shorter-term moving averages trending above the longer-term ones. This alignment typically underpins a continued bullish sentiment.\n\nSolana's immediate resistance lies around the $135 price level, a breakthrough of which could signal a fresh rally. On the downside, support can be found near $115 and $104, which have previously acted as springboards for price rebounds. The significant volume accompanying recent upward price movements shows active market participation, further bolstering the case for an optimistic outlook.\n\nA bullish scenario for Solana might emerge following a broader cryptocurrency market reversal, particularly if the market begins to seek alternatives to Ethereum amid high gas fees and network congestion. As a scalable and low-cost option, Solana could attract significant interest, both from developers and investors, potentially driving its price higher.\n\nAdvertisement\n\nEthereum remains strong\n\nEthereum is experiencing another significant price surge, bolstering its position as a mainstay on the cryptocurrency market. The recent upward momentum continues to captivate investors and enthusiasts, signaling robust market confidence and renewed interest in the blockchain's long-term potential.\n\nA meticulous examination of the price chart shows Ethereum breaking through resistance levels with gusto. The latest price action sees ETH pushing past the $3,500 barrier, a level that previously posed considerable resistance. This breakthrough is a testament to the strong bullish sentiment currently driving the market.\n\nThe chart depicts a steady sequence of higher highs and higher lows, indicating a robust uptrend. Ethereum’s moving averages are in perfect bullish alignment, with short-term averages soaring above longer-term ones, suggesting that the momentum could very well sustain in the near term.\n\nFrom a support and resistance standpoint, the recent surge has placed Ethereum above the crucial $3,500 mark, which may now serve as a support level in the event of a retracement. A look at volume shows substantial buying pressure, reinforcing the current price increase.\n\nCardano has some fuel\n\nCardano is signaling potential upward mobility as trading volumes surge, despite indications of being oversold in recent times. This volume increase can be a harbinger of a substantial price surge, attracting attention from investors and traders within the cryptocurrency space.\n\nAnalyzing the price chart, Cardano's recent performance reveals a promising trend. After enduring a period of consolidation, ADA is showing signs of life as trading volumes ramp up, a critical factor often preceding price rallies. This uptick in volume accompanies ADA's rise past the resistance level at $0.65, suggesting that the market is gathering momentum for a sustained move upwards.\n\nThe current trend is characterized by ADA's price trading above both the short and long-term moving averages, a bullish signal for market participants. The moving averages have formed a supportive base for the price, indicating that any pullbacks may be short-lived and used as buying opportunities for those looking to capitalize on Cardano's potential growth.\n\nLooking to the future, the immediate resistance Cardano faces is around the $0.77 mark. Should ADA's volume continue to increase and push the price above this level, it could open the door to new heights, potentially challenging the $0.80 threshold. A break above these levels would solidify the bullish case, potentially propelling ADA toward the coveted $1 mark."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPNGlhdk0zUWdBZTV4YTV3bWd2MkJQS2FhLWp0dWNJNnU2NHN1Mk9ncHRMLU5oVDRPUTZXN1BDdVdMV2dodEhpVE9sRVlfSUV1UE14Z0wwUVhyZHpVdmdsc245c3h5bjJmNklyN1BlUGUyWm5UM3JoeFBhXzd2dDR2NGdfcEV2UWRqcTlvMWpBd2VQUmswSW1z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "3 Cryptocurrencies to Buy Hand Over Fist in March - The Motley Fool",
        "content": "Bitcoin, Ethereum, and Cardano could soar higher in the coming months. Here's why.\n\nIt's getting harder and harder to ignore the obvious: A bull market rally has finally arrived for crypto investors. Bitcoin (BTC 0.32%) is leading the way with 53% gains year to date, but plenty of other cryptocurrencies are up anywhere from 30% to 50% for the year. And some speculative meme coins are posting triple-digit gains for the year.\n\nSo which cryptocurrencies are the best buys in March? Bitcoin is the obvious choice. But if you are looking for more diversification in your portfolio, then Ethereum (ETH -0.20%) and Cardano (ADA -1.44%) could be nice additions as well. Let's take a closer look.\n\nBitcoin\n\nAll eyes are now on Bitcoin, and for good reason. The enthusiasm around the new spot Bitcoin ETFs, which officially launched in January, continues unabated. Both retail and institutional investors are now looking to boost their Bitcoin allocations, and that has led to a huge rally to start the year. Bitcoin is now up 27% over the past 7 days, 50% over the past month, and 53% for the year.\n\nBut there's more to Bitcoin than just the narrative around exchange-traded funds (ETFs) based on the cryptocurrency's spot price. There's also the upcoming halving, scheduled for late April, in which the rewards for new Bitcoin creation will drop by one-half. This supply-side shock, combined with the ongoing influx of new demand, is almost certain to send Bitcoin even higher.\n\nThis has been the case with three previous Bitcoin halving events, and many investors think the same thing will happen again in the 2024-2025 cycle. In fact, some investors are now predicting that Bitcoin could blast through the $100,000 mark by the end of the year. Just be careful, though, because past performance is no guarantee of future results.\n\nEthereum\n\nEthereum is now up by roughly 60% for the year, just like Bitcoin. Much of this is based on investor speculation that Ethereum could be getting a spot ETF of its own sometime in May. The same investment giants that filed for spot Bitcoin ETFs in 2023 have also filed for spot Ethereum ETFs, and that includes well-respected names like BlackRock and Fidelity Investments. If you buy into the spot ETF narrative for crypto, then any approval of a spot Ethereum ETF in the coming months could send Ethereum soaring in the long run.\n\nEthereum also continues to make the types of updates and adjustments to its blockchain that will help it maintain its competitive lead in the Layer 1 blockchain space. The upgrade everyone is talking about now is Dencun (a combination of the code names \"Deneb\" and \"Cancun\"), which will improve the speed, scalability, and efficiency of the core Ethereum blockchain. At the end of last year, JPMorgan Chase predicted that the type of performance breakthroughs made possible by Dencun could be significant enough for Ethereum to outperform Bitcoin in 2024.\n\nAs an investor, it's up to you to decide how Dencun fits into the long-term outlook for Ethereum. If you look at Ethereum's roadmap for future development, then Dencun looks like the next stage in a multi-year plan filled with future speed and performance enhancements.\n\nCardano\n\nFinally, there's Cardano, which has suddenly awakened from a long slumber. Over the past 30 days, Cardano is up more than 50%, and has now gained 25% in the new year. Still trading for less than $1, Cardano could be a low-budget crypto to pick up on the cheap as the bull market rally gains steam.\n\nThe primary factor driving interest in Cardano has been the noticeable uptick in activity on the blockchain, as measured both by the number of daily active wallets (a proxy for how many people are using the blockchain) and the number of transactions taking place on the Cardano network. There also seems to be an uptick in the number of very large transactions (defined as transactions of $100,000 or more) happening on Cardano -- a possible sign that large financial institutions are now exploring this cryptocurrency. If so, that could be a very bullish indicator.\n\nAnd the winner is...\n\nIf you're forced to choose between these three cryptos, the obvious winner is Bitcoin, and it's not even close. Even with Bitcoin nearing its all-time-high of $69,000, it still looks like this crypto is significantly undervalued based on simple analysis of supply and demand. If there's just one crypto to add to your portfolio in March, it's Bitcoin. But diversification is always a good idea. Cardano and Ethereum look good in a supporting role."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxNOU1fQ2hKVGF2dmNnYXBjbEV4bEpLSzQ4RmV5bXZvSk1QWVFBQlFRdi1WTnJaVGhMWmFBeXNjR21aOU90WTlQdWs3TnI2SnhrT0I2X1pBSm5vQi10d2FQQy1zYmxWdDROX3J4SFgyVHFueVpmT3hLdlRRTHhQbmtUTlRGTDc2Tm1BeVNwNUU2OGJPelpwOTlmSDRHTGNqZEFRS0twUVl0RkVCU3FwMlV5Tk1VQWlaSS10R29kYXFlMWU1WkJWTjJYaDM2Yll4eGZVZ09VWkxINXZTVGNwYjFHazIyNnNzS3M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Co-Founder Bullish, AI Project Scotty to Become 100x Crypto - Techpoint Africa",
        "content": "Ethereum co-founder bullish on crypto, highlights security needs, while AI project Scotty the AI emerges as potential security solution with presale opportunities.\n\nJoe Lubin, co-founder of Ethereum and CEO of Consensys, recently shared his bullish sentiments on the crypto market during a chat moderated by Axios reporter Crystal Kim at ETH Denver.\n\nLubin's optimism resonates with the majority of attendees at ETH Denver, indicating widespread bullish sentiment pervading the crypto market. Lubin discussed various topics, including the current ‘super cycle’, the potential benefits of Bitcoin (BTC) and Ethereum (ETH) exchange-traded funds (ETFs) for retail investors and developers and the growing need for decentralisation across industries.\n\nLubin highlighted the contrast between the current centralised trust model and the decentralised trust introduced by cryptocurrencies.\n\nHe discussed that crypto represents a paradigm shift towards decentralised trust, a concept previously unseen in financial systems. Lubin also expressed optimism regarding the approval of spot Bitcoin ETFs, stating that it marks a significant milestone for crypto advocates and investors.\n\nAmidst Lubin's bullish outlook and the growing institutional interest in cryptocurrencies, innovations in the crypto space continue to thrive. One such innovation is Scotty the AI, an emerging AI crypto project aimed at enhancing security and fraud detection within the blockchain ecosystem.\n\nScotty the AI: Pioneering Security and Fraud Detection in Crypto\n\nNamed after the Scottish Terrier breed, known for its intelligence, loyalty and vigilance, Scotty embodies these very traits in its mission to safeguard the crypto space and shows people how to make money with crypto.\n\nAs the crypto market experiences significant growth and adoption, the need for robust security measures becomes increasingly crucial. Scotty the AI addresses this need by utilising advanced AI capabilities to analyse blockchain data, identify patterns and proactively detect potential threats.\n\nPURCHASE $SCOTTY WITH ETH, USDT OR CARD PAYMENTS\n\nKey Features of Scotty the AI\n\nProactive Threat Detection: Scotty's AI analyses vast amounts of blockchain data to identify patterns and proactively detect potential threats, focusing particularly on fraud detection. It functions as a vigilant guardian, safeguarding users against malicious activities and security breaches within the crypto market.\n\nTransparent and Community-Driven Approach: The project prioritises transparency and community involvement, relinquishing token ownership to foster democratic governance and empower the community.\n\nScottyChat: Crypto Conversations\n\nA key feature of Scotty the AI is ScottyChat, an AI-powered chatbot designed to transform crypto conversations and increase user engagement.\n\nScottyChat leverages advanced AI algorithms to offer real-time market insights, analysis and personalised recommendations in a conversational format.\n\nThis interactive platform serves as a hub for crypto enthusiasts to exchange ideas, gain valuable insights and navigate the complexities of the digital asset landscape – showing users how to make money with crypto the optimal way.\n\nBUY AND STAKE $SCOTTY FOR 231% ESTIMATED REWARDS\n\nOperating around the clock, ScottyChat ensures 24/7 availability, empowering users to access valuable insights and information whenever needed. Whether navigating volatile market conditions, conducting research or finding guidance outside traditional trading hours, ScottyChat remains a reliable companion, ready to assist and support their endeavours.\n\nScotty the AI's Tokenomics and Development Roadmap\n\nScotty the AI's tokenomics feature a fixed token supply of 1.73 billion $SCOTTY tokens, built on the ERC-20 standard and emphasises a community-driven approach. The project's development roadmap outlines strategic initiatives focused on security enhancement, community involvement, and market outreach.\n\nPresale Opportunities and Future Prospects\n\nAs the crypto market experiences its \"unstoppable momentum,\" as described by Joe Lubin, Scotty the AI emerges as a significant player in ensuring the security and integrity of blockchain transactions and gives valuable insight to users on how to make money with crypto.\n\nIts innovative features and transparent governance model position Scotty the AI to redefine security standards within the crypto space, making it a potential candidate as a 100x crypto.\n\nThe project's presale stages offer early supporters the opportunity to acquire $SCOTTY tokens at a favourable price point, presenting a potentially lucrative investment opportunity."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOU2xOY09Od2N6Y2ZKNnFtREVvQXc2U2ZQWTRscTYtcWx3dWI0YWR1Q3l4Z0UtaFIyMWdNTXFIbjVmbzYxZGJUbHFSV1FqVWZ0ZFh0RGl2Mjh3X2ZkV2FBTW9JbURhNktReXFZUEdBcVBsRXJZOEtDWmZURmtSX0huTWRncXFLRzgyX3czRGZsYVBRSVcxMHp3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Liquid Restaking (LRT): A New Trend in the Ethereum Ecosystem - Incrypted",
        "content": "LRT Protocols: Growing Interest And Popular Applications\n\nThe restaking ecosystem is now in a testing phase. It will continue until EigenLayer is fully launched and AVS operators emerge. Despite this, LRT protocols are still attracting capital.\n\nThe above description outlines the general principle of operation for liquid restaking platforms. Now, let’s examine the specific characteristics of the largest projects in this segment.\n\nAs of now, Ether.fi is the largest liquid restaking service. It offers a wrapped eETH token in exchange for restaked Ethereum. Moreover, depositors can choose solo-staking by setting up an Ethereum node with a partial deposit or no deposit at all. EigenLayer and Ether.fi award points to depositors based on the amount deposited. The current APR is 3.95%.\n\nPuffer.fi is a well-known LRT provider. They offer native ETH restaking to EigenLayer with the liquid token pufETH. Users can also run an Ethereum node through their platform.\n\nThe protocol stands out because of its top-notch interface and the gamification of the liquidity campaign. Additionally, it has launched a native anti-slashing system and other technical solutions. At the time of writing, the APR is 3.3%.\n\nKelp was launched by the founders of Studer Labs and is positioned as a DAO. Like other LRT services, it offers points and EigenLayer points. The protocol tokenized the latter by issuing a KEP token, where one KEP equals one EL point. This expands trading opportunities. It lets individuals exit farming before the EigenLayer airdrop.\n\nOne main feature of Kelp is its support for a variety of assets. It includes ETH and LSD tokens from different providers. Also, Kelp aims to create a community-driven infrastructure. It embodies the principles of a decentralized autonomous organization. The project documentation provides further technical details.\n\nRenzo protocol accepts ETH, as well as liquid staking tokens from Lido and Binance. The attracted assets go to EigenLayer or to an Ethereum deposit contract for restaking later. Renzo has launched its own points system and referral program. They’ve also introduced the ezETH token. At the time of writing, the APR is 2.83%.\n\nEigenpie is a SubDAO on Magpie’s DeFi platform. It provides earning opportunities in different decentralized finance applications.\n\nEigenpie’s key feature is its integration of many LSD providers. Unlike its competitors, the service has isolated pools for each asset. It also allows the minting of individual LRT tokens. This feature lets incentives and rewards be distributed more flexibly. It lowers risks for investors.\n\nBesides these, there are half a dozen smaller projects. Most of them launched a few months ago and likely still have time to prove themselves. Yet, like LSD, the principle of ‘the pioneer gets everything’ may apply. This could bring Ether.fi to the forefront of the market.\n\nPoints Programs\n\nInterest in LRT is growing, possibly because people expect an airdrop from EigenLayer and liquid restaking protocols. These mentioned applications have introduced point programs that grant points based on the amount of staked ETH.\n\nWhen a user provides an asset to an LRT service, they get points from both the project and EigenLayer simultaneously. These points will be converted into tokens in the future. For instance, according to Kopp, the TGE of the Ether.fi protocol has been scheduled for April 2024. As for the EigenLayer team, they have not yet announced a launch date.\n\nThese points also include APR for native ETH staking and potential rewards from LSD protocols. Most investors are attracted to the increased rewards for the same amount of locked assets.\n\nThe increase in leverage options has amplified this trend, especially in operations such as liquid restaking. Recently, Gearbox platform introduced liquid restaking with leverage of up to x19. Pendle yield trading platform also provides boosts for LRT point farming.\n\nPendle And Its Importance For LRT\n\nPendle offers a unique feature: it divides an asset into two tokens – a base part and a yield. You can trade them individually. This feature allows for the maximization of potential returns through leveraged liquidity. Although Pendle became popular during the peak of LSD, its mechanics also suit LRT protocols.\n\nLet’s look at a scenario to explain the process. A user deposits their ETH (or a wrapped version) into the Pendle pool of a liquid restaking protocol like Ether.fi. This will allow them to transform the underlying asset into one of two tokens:\n\nyield token (YT) enables you to farm EigenLayer and Ether.fi points using leverage. Converting one ETH into YT can provide you with the same number of points as blocking in LRT with six ETH.\n\nAs the maturity date of YT approaches, the value of the yield token compared to the underlying asset decreases. On the maturity date, the yield token value becomes zero. So, in essence, the user «burns» the deposited ETH (partially or completely) in exchange for a boost to farming points;\n\nbase token (PT) allows for a fixed yield during a specific period while being locked. When the maturity date arrives, the owner can use the PT to receive their asset and promised profit. But the yield of the PT changes, and you can only get the highest yield on the maturity date.\n\nThe liquidity provided by PT holders enables YT holders to receive boosts for farming. YT holders leverage the underlying asset, while PT holders get a fixed interest on the capital they provide. The amount of the boost and the rate of burning the underlying asset during farming depend on the ratio of assets in the YT and PT pools.\n\nTo justify such a strategy for point hunters, it is necessary to ensure that the rewards received in the future will outweigh the cost of the «burned» underlying assets. However, currently, neither EigenLayer nor any of the LRT protocols have reported the conversion rate of points to tokens or even the date of distribution. Consequently, farming through Pendle represents a high-risk gamble with many variables."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1DLVpPb2ZpWE5DYlhLLXp0VVo1M1BQenB4RzBKUnBfdDJIeFJ2UDVoemdScURTdDJTV1VrRHdyelZHaGlDVTJycnJIdW1xUFZ6dlFYaXI1aWV1MEZrbDEwU212cnFfejhCTkVieW1INkZkYnFScG9ETDlfZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Ethereum ETF - The only date that matters - Cointribune EN",
        "content": "Tue 05 Mar 2024 ▪ 4 min read ▪ by Nicolas T.\n\nThe SEC (Securities and Exchange Commission) has postponed its decision regarding the approval of BlackRock’s Ethereum ETF.\n\nEthereum ETF\n\nThis is the second postponement for BlackRock’s iShares Ethereum ETF. The first was in January, shortly after the approval of Bitcoin ETFs. The SEC can postpone its decision up to three times before having to make a final verdict.\n\nThe deadline will be May 23rd. It will concern VanEck’s Ethereum ETF application. Bloomberg’s ETF analyst James Seyffart believes that May 23rd is the “only date that matters”:\n\nSEC just delayed @InvescoUS & @galaxyhq's #Ethereum ETF. 100% expected and more delays will continue to happen in coming months.\n\n\n\nThe only date that matters for spot #ethereum ETFs at this time is May 23rd. Which is @vaneck_us's final deadline date pic.twitter.com/gkVZL2QuPK — James Seyffart (@JSeyff) February 6, 2024\n\nTo him, “all decisions before this date will be adjournments.” “Personally, I can’t imagine them rejecting VanEck’s Ethereum ETF and then approve those of the competitors.”\n\nIt is worth noting that the SEC is going to launch a public consultation to decide whether it should approve Ethereum ETFs or not. Concerns are particularly focused on the potential for fraud and manipulation associated with the Proof-of-Stake mechanism.\n\nAnother point to note is that the ETF applications are based on the premise that Ethereum is a “commodity”. Here is what can be read in the SEC’s statement published this Monday, March 4th:\n\n“On November 21, 2023, Nasdaq submitted to the SEC an ETF application aiming to list shares of the iShares Ethereum Trust under the name Nasdaq Commodity-Based Trust Shares.”\n\nHowever, SEC Chairman Gary Gensler has consistently refused to classify Ethereum as a “commodity”. Here are his remarks following the reluctant validation of Bitcoin ETFs:\n\n“It is important to note that the Commission’s decision is limited to ETFs backed by a ‘commodity’, bitcoin, and not a ‘security’. It should in no way signal the Commission’s willingness to approve ETFs for crypto-assets [Ethereum] that fall under the securities laws.”\n\nNo ETH ETF until 2025?\n\nVariant’s legal director for the crypto company, Jake Chervinsky, doubts an ETH ETF could be approved this year:\n\nI am a lot less confident about ETH ETF approval this year than many of you are.\n\n\n\nThe SEC got a ton of political blowback for approving BTC ETFs, even though the court basically forced it to.\n\n\n\nNow animal spirits are in control of the market, and an ETH ETF would only add to that. — Jake Chervinsky (@jchervinsky) March 1, 2024\n\nFor him, the SEC will have to be forced again by a court decision. Indeed, Bitcoin ETFs probably wouldn’t have happened if the Columbia Court hadn’t given the green light for Grayscale’s Bitcoin Trust to be converted into an ETF.\n\nJake Chervinsky also added that it is reasonable to think that the question is not “if” Ethereum ETFs will become a reality, but “when”.\n\nEthereum has not been affected by the postponement of the SEC’s decision. It is trading around $3,700, which is 30% below its 2021 record high.\n\nThe ETH/BTC pair is still down 34% compared to 2021. On the other hand, Bitcoin is a hair’s breadth from its all-time high, bolstered by the tens of billions of dollars funneled through ETFs.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBWOFJzV3U3ZnFQTFd3czVMTUxSWDBvWEdPcXpDZ3FOWkM1WTNpZy1UeEJuc2ZHSUt5M2lkQnVrVUUteDJ6dlBmUVh5cG00OU9KSWY4bldlY3JDaGpITG5qd0ZTS3ctbWtNQjNmbXZ0OWdYeUt4c3RFVXBDbUo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "DeeStream presale draws Dogecoin and Ethereum bulls - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nEthereum (ETH) , Solana (SOL), and Dogecoin (DOGE) holders appear to be flocking into the ongoing DeeStream (DST) presale. DeeStream plans to launch a decentralized video streaming platform.\n\nThe Solana boom\n\nHard-charging Solana is on a tear, soaring to $138, adding 28% in the past week.\n\nBulls easily broke above $125, turning it into support.\n\nYou might also like: Solana loses over 12% in a week as active addresses decline\n\nStrong buy-side pressure indicates this rally could go on further, with bulls targeting $160 in March.\n\nDogecoin roaring\n\nDogecoin broke above $0.18 before cooling on to $0.168 on March 4.\n\nSo far, DOGE is up 21% in the last 24 hours.\n\nThough it is not a low market cap coin, analysts expect more gains this week.\n\nDeeStream presale piques interest\n\nDeeStream is launching a web3 content streaming platform, offering creators a significant revenue share, instant payouts, crypto-native income streams, and freedom of speech.\n\nThe platform is expected to attract the world’s largest content creators and audiences.\n\nYou might also like: DeeStream presale attracts Chainlink, Polkadot, and BNB investors\n\nMarket analysts predict that DST could extend gains, rising with the current crypto rally.\n\nIn the current DST presale, the token is selling for $0.04.\n\nDeeStream’s smart contracts have bee audited.\n\nAt the same time, the platform’s liquidity has been locked for life.\n\nThis measure prevents the team from dumping to retailers; a bullish development for investors."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQYjBxQnpqYWZWU0lPcnpQRURaU0lsdE9iNWxOU04yZlJObVBCbm9ZYlQ5QmpVN1dLejhxN201a0tIQUpQNEFTdTljZjRTbEM3alljYzdxSi1ENjBXRmhwU0RwS1lvUlhhaVRQMVp4dnJKa0dOYXZWcjJhbTl3aTVvdTFR0gGHAUFVX3lxTFBwTlJseHJRNndFNF9LX21rTXd4YUt1MjRwTjhNZ2laVWNWYXJoNUVmWnRpTGNLTnNLX1dySl9CMUNyRWkwdGk3bGEydFV6UkJ6UlVKc25lbk9GRjdLU1piN21KV1NwaTFCVWg1TTJHZGN3SmQxR093Yzd6YmM2X3BjMkduNnp5RQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "ETH Tops $3900, Analyst Forecasts Momentum Amid 70% Surge - CoinGape",
        "content": "Ethereum (ETH) has recently experienced an extraordinary surge, catapulting its value past the $3900 mark. This surge comes on the heels of a brief period of retesting support levels, during which Ethereum demonstrated remarkable resilience in the face of market fluctuations. As a result, Ethereum has seen a staggering 70% increase in value, signaling a significant shift in market sentiment and investor confidence.\n\nIn the midst of recent market volatility, Ethereum stood firm as it successfully retested new support levels. This retest not only validated the strength of Ethereum’s underlying fundamentals but also served as a catalyst for its subsequent surge. Investors, buoyed by Ethereum’s ability to weather market downturns, quickly repositioned themselves, driving Ethereum’s price to new heights.\n\nadvertisement\n\nMarket Position and Growth Trends\n\nAs the second-largest cryptocurrency by market capitalization, Ethereum continues to assert its dominance in the cryptocurrency market. Its recent surge has further solidified its position, attracting considerable attention from investors and traders worldwide. With its unique value proposition and innovative features, Ethereum stands poised for continued growth and success.\n\nOne of the most striking trends in Ethereum’s recent performance is its divergence from Bitcoin’s price movements. While Bitcoin remains the dominant force in the cryptocurrency market, Ethereum’s surge past $3900 demonstrates its ability to chart its own course independently of Bitcoin’s fluctuations. This divergence highlights Ethereum’s unique value proposition and underscores its growing importance as a standalone digital asset.\n\nAlso Read: Cathie Wood’s Ark Invest Sells Coinbase, Nvidia Again; Buys Tesla Shares\n\nValuation and Market Implications\n\nEthereum’s recent growth metrics paint a compelling picture of its increasing value and significance within the cryptocurrency market. With notable percentage increases in trading price, Ethereum has captured the attention of both retail and institutional investors, driving demand and fueling further growth.\n\nThe implications of Ethereum’s valuation extend far beyond its own ecosystem, shaping the direction of the broader cryptocurrency market. As Ethereum continues to innovate and expand its reach, its valuation serves as a barometer of market sentiment, influencing investor behavior and market dynamics. With expert forecasts predicting continued momentum for Ethereum, the future looks bright for this pioneering cryptocurrency.\n\nAlso Read: U.S. Prohibits AMD’s AI Chip Sales To China\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQVGdBMkMxZWpKMmNCUjc2dktvbURielJOcUJENlZhVVNiV1I5c0U5NGNKUk9qa1lWSnAzM2FkNFI0N0dQQ3dCa250ZllqRnR0VC0yTDlJdmNCbGsyeHk3aXB5UUdyaEk4RF9FV21xdXFJbVh6R0tWazRRT01vemQ3RjN5YzNnN1pqc0ROc9IBkgFBVV95cUxQLVNkTUxMSGlGajdYTE16azdISDJDS3E2TzI5cW5NVUluMVF0d3FDbzM3NVF0dGNvVzFSckY5RVNrLUVFWjJoUlRfR2UxN0VaanAtS3VqTE5lQlIxd19MdDVMVHdDdk5ZOUF6TWJkSUtYZHFSNlVzeFRUWFBiT2lTVXhucFpJamRRYncxZTZ6bHBpUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Bitcoin NFTs surpass Ethereum NFTs: How Ordinals played a part - AMBCrypto News",
        "content": "Bitcoin NFTs surged, outselling Ethereum with an 80% weekly increase.\n\nNodeMonkes propelled the growth, while BTC saw green.\n\nIn the past week, sales of Bitcoin [BTC] NFTs have exceeded those of Ethereum [ETH], thanks to a sudden surge in Bitcoin Ordinals-based NFT collections.\n\nThe NodeMonkes collection has played a significant role in driving this increase.\n\nNFT season\n\nBitcoin NFT sales experienced an impressive 80% week-over-week surge, reaching $168.5 million.\n\nRemarkably, three of the top five best-selling NFT collections during the week were based on Bitcoin Ordinals.\n\nIn comparison, Ethereum’s NFT sales amounted to $162 million, according to AMBCrypto’s analysis of CryptoSlam’s data.\n\nThe Ordinals platform, launched in January 2023, introduced enabled the creation of NFT-like assets on the Bitcoin network.\n\nThis was achieved by allowing users to embed files, such as images, into satoshis (sats), the smallest unit of Bitcoin.\n\nNodeMonkes takes the lead\n\nNotably, the top-performing collection within the Ordinals ecosystem was the NodeMonkes collection, generating over $11 million in sales across more than 100 transactions.\n\nFollowing closely was the Uncategorized Bitcoin Ordinals, which achieved over $8 million in sales, marking a substantial 39.51% increase in the last 24 hours.\n\nOrdinals collection Natcats secured the fifth position with sales surpassing $1.7 million.\n\nNodeMonkes, a collection of 10,000 unique pixelated profile pictures (PFP) in the Ordinals style, was launched in December. It is the first 10,000-strong collection on the Bitcoin blockchain.\n\nWhile other 10,000-count-Ordinals collections had debuted earlier, the NodeMonkes team etched their creation onto the blockchain in February 2023, just a month after the Ordinals platform was introduced.\n\nAt the time of writing, NodeMonkes’ market capitalization soared to over $500 million, positioning it as the third-largest PFP-style NFT collection across all blockchains.\n\nIt trailed only the Ethereum-based Bored Ape Yacht Club (BAYC).\n\nRead Bitcoin’s [BTC] Price Prediction 2024-25\n\nPositive market sentiment, driven by the popularity of Bitcoin NFTs, could further boost investor confidence and contribute to a more dynamic ecosystem.\n\nState of BTC\n\nAt press time, BTC was trading at $65,015.57 and its price had grown by 5.16% in the last 24 hours. The volume at which BTC was trading had surged by 107.48% during this period.\n\nMoreover, the Long/Short difference for Bitcoin had grown significantly, implying that long-term holders had outnumbered short-term holders.\n\nLong-term holders are less likely to sell their holdings, which may help BTC sustain its current price levels."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPS25KQTYxRTN4MGQxWHl1WDh1aEdOVTROWW82azl0eVJvb2NzZjVlT01yOXNTRmJzNE4wM1pqSXBQNjYxSWdHUndtVXo4aXdXb25WSGw0dG9KU1VmaUlyc3dNNFVWZnRiOUozS1RMdkZCanZ3R3JfQ2ttRWRJT3hwLUVNQ2ZBVVpMMkI0bG5aNjBDdl9PaTAtRDFWWnpjUnZYc1phdmx3aXA0UdIBrwFBVV95cUxPemZvNjJnUVI4WmUtelFBemwwTUNDZ25JbUQwSlExSWFZajJzZ0I3bWRVUzZRVERZSXJyTjA5bjZhbXR4a0M1N0hSdm5SM1J2TXk4bnhuMUZJRTdfQzNKZW94NjRsTEFVcWtfRFA0ODNCSi11X2VnUEZjYVA0YXpDSTl2Tkx6WXRhRHFHVXZHMGR2aXZLTS1tU2ZxMklwNDlYNEtRMkpUX3dQTHpGemRz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Bitcoin ETF Giant Grayscale Introduces a Crypto Staking Fund - CoinDesk",
        "content": "Staking plays a key role in how some blockchains. Whereas the Bitcoin network relies on proof-of-work – in which miners crunch complex numerical puzzles to create new bitcoin (BTC) – proof-of-stake networks like Ethereum instead allow owners of their token to pledge their assets to run the network. Doing so is called staking, and it generates income for the staker."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPOXA1em1ZeFFDQkN1TXkxXzRUVmJlZ19NVGU1OVMyZFJyblZZd2cxMTlGUFBYX2NMR21IOVBGbmRPbExPUGQtSWxRbW5MTjhFZ25DSTBHTkw4ck9HWkNhemEwNjhTRkVVMWdTZEItUDJTTlpXYml0bzN6TENJVXdiSkc2cm9SbURrZlJvX2V3YnBIb29ZY2w2RTNfbkxIUnJ5WThpcFRUQUIyMHdB0gGzAUFVX3lxTFA3NGdZWXNlSXFfVFpIeGk1Qm1SSXdWZTdCeGd1a3pCdldMUEx6VnpEbjIyY0t1c3k5M3ZacC1hd2paYlZfSU5UdVh2cVBBTEphbTllckJ4MHZEM2JTS09KODIyTXpmNW1QYS1BbG0wYkJWVFZsSTRBVk8zSUVETmNYemh2SHVUQ05nbHZNdzBiU3Y5Q1dVdVh6cC1YUm00MFlDTzZfRlFMLWktUUlhSGdfZ3FF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum goes beyond the $3,800 mark - The Financial Express",
        "content": "With Bitcoin (BTC) setting records in 2024, Ethereum seems to follow a close second, as the cryptocurrency has gone past the $3,800 level. From what it’s understood, the cryptocurrency last clocked its record level in January 2022.\n\nAlso Read Bitcoin crosses $68,000\n\nAs of March 6, 2024 (5.13 pm, Indian Standard Time), at the time of filing, Ethereum was trading close to the $3,900 level, recording a nearly four percent increase in market capitalisation and an approximately 61.25% increase in 24-hour trading volume, as stated by CoinMarketCap, a crypto-price tracking website. The website mentioned its market capitalisation to be around $465 billion and 24-hour trading volume at a little above $51 billion.\n\nAlso Read Bitcoin faces a downfall liquidating over $1.1 billion\n\nIt’s believed that this hike in price is attributed to the potential approval of spot Ethereum exchange-traded funds (ETFs), which can take place in May 2024. However, in recent developments, a regulatory filing revealed that the US Securities and Exchange Commission made the call to postpone the spot Ethereum ETF application belonging to BlackRock, an investment management company. Reportedly, BlackRock made the filing for its iShares Ethereum Trust application in November 2023.\n\nAlso Read NEET PG 2024: Students could face ‘meltdown’ over last minute exam pattern changes, SC tells NBE Stree 2 makes August a blockbuster month on box office iPhone 16 Pro: Everything to expect ahead of Sep 9 launch Modi vs Modi: Samir Modi says have DNA reports to prove ‘I am not adopted’; done everything to make amends in relationship\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOUjFMMlVZZmtzODZ3eWZoRDZuR2ZYamh2VS1SaEQtV293MWkzUldFVHdRd1pjY0Y3Rko3NEJnTEtUdktpc1hJWFZxaTMyUXZ5NzUtRkxkTXA4c0hReDlqMWxXYmNEdlBXWUw3ejQ0dkRoektJSGVWM0pRM2NfV1lhOUZPYkpUQU5zQUtTR1p3VlRubGVWbVQtNWx3ZFpUeDE0QW9CUVQ5THRQZlZyZ2NJWk9R0gG6AUFVX3lxTFBVSHNRRVREYlZvcTF0WjZPaTlpb2RoTUpVQkpLclZLVWwtM3BXdEN0dFloRFZibnZfZUFoT3VPT3V5RGRoVVBLTXVyRkc5Wk9vUVVPaW5ORlJBSS1mYWFhaG9sbVBxNDM1aTV3NkhIMVBxTDlVZDd1R2hidXA0bmNLd2JRckJlWHFJYTk5RFRpZ0pjRHV1cEtGVkczUnQ0M1AwLTBUejAxV2ZuSHYwaUVjak1WYWdzNVNPdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Bitcoin NFTs Surpass Ethereum NFTs: The Role of Ordinals in the Emerging Trend - Crypto News Flash",
        "content": "Bitcoin NFTs surpassed Ethereum on the weekly volume charts, with the NodeMonkes collection leading the charts as its market cap exceeded $500 million.\n\nOf the top five collections by weekly sales, three were from the Bitcoin ecosystem as interest in Ordinals surges as BTC approaches its all-time high in the ongoing bull cycle.\n\nBitcoin just can’t put a foot wrong this year. The top crypto has gained close to 60% since the turn of the year, and it’s edging ever closer to breaking its record-high price, as this report by Crypto News Flash alludes to. This terrific start to the year has translated to its NFTs, with Ordinals outshining Ethereum NFTs to emerge as the most traded weekly.\n\nAccording to data from Crypto Slam, Bitcoin NFTs have attracted $181,821,799 in trading volume, just edging out Ethereum to rank highest in the market. Ethereum trails closely behind by around $650,000, with Solana at a distant third with $65 million.\n\nWhile Bitcoin just edges Ethereum out, the altcoin still has superior numbers on the all-time list at $42 billion to $2.6 billion, and on the buyer’s charts, its numbers are at least eight times higher.\n\nOn the weekly chart, Bitcoin saw 58,829 buyers, while Ethereum saw nearly twice that at 110,642.\n\nMost interestingly, the highest volume of trade went to uncategorized Ordinals, which Crypto Slam describes as “a diverse assortment of digital assets on the Bitcoin blockchain that has not yet been identified as part of an established collection.”\n\nThis points to Bitcoin’s NFT revolution being spearheaded by retail users who mint their own Ordinals rather than purchasing from the blue-collar NFT collections. This is massively bullish as it shows genuine interest in the BTC NFTs and indicates that this hype can be sustained.\n\nNodeMonkes came in second on the weekly volume charts and was the top collection. NodeMonkes boasts of being the first collection to inscribe 10,000 unique pixelated profile pictures on the Bitcoin blockchain in the first few weeks after Ordinals launched. However, the collection’s release was delayed, and others went to the market first.\n\nNodeMonkes have become wildly popular, and on Monday, one NFT in the collection sold for over $1 million for the first. The NFT, known as Alien Hoodie, is the second-highest NFT sale on Bitcoin after the recent $1.4 million sale of the second-ever Bitcoin Ordinal inscription.\n\nSOLD: Alien Hoodie (#2769) for 17 btc ($1,080,000) on M.E. The first million dollar monke sale. Congratulations to buyer & seller. —— SEND NODES —— pic.twitter.com/9DrvZBJH2X — NodeMonkes ◉ (@nodemonkes) March 4, 2024\n\nThe NATCATS TAP collection rounds up the top five highest sales this week as Bitcoin’s third entry. Ethereum’s entries into the top five were CryptoPunks and Pandora.\n\nBitcoin Ordinals Flip Ethereum NFTs\n\nFor Bitcoin, flipping Ethereum is monumental. The king of altcoins has dominated the NFTs market for years, emerging as the most favored network for some of the largest collections, from Bored Ape Yacht Club to CryptoPunks and ArtBlocks.\n\nAdditionally, Ethereum has been at it for over five years. On the other hand, Bitcoin has barely done it for a year, with its Ordinals NFTs launching early last year. However, in that time, BTC has recorded $265 billion in overall trading volume with 370,000 buyers.\n\nEthereum might have even bigger challenges to worry about on the NFT front. As Crypto News Flash reported, the Injective network recently released its version of the semi-fungible ERC-404 token standard, giving Ethereum a run for its money on the front.\n\nCloser to home, users are increasingly turning to Layer 2 solutions to mint their NFTs to avoid gas charges on Ethereum. While this is still technically part of the Ethereum ecosystem, it points to dissatisfaction in the network. Crypto News Flash pointed to this trend in December when it reported on the rise of Polygon NFTs.\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMihgJBVV95cUxQWThiUjVLSEhndkNTazROaWJHa2Z5dFF3SkFuYV9RSkh5T3lSSFRtSjRBZFU5OVYtcE1DX1VtYUY1TFF2eGhYb0Y2QTlONkRMbzUwa3h6U3BYd2F4eVVxdnROZlBNQW9RNE41MnlVUk04QXQ2UC1NRmZTYjFmc1hiNmxuU0NMbF9Xa1Nsel96bDV6SmsxTkNrV1lVcHhjeTFabUhXQTFzVzc1STJkQWhqMzVxd24xNGtleXlRb0djOEJteGxoM3J6a1Y5ZFNKUGRDV0I5X3BsSDJuUUs4ZEN5QkVSbERHdVlGekNxenJTdDlKVGZSSVV0WkJzZmRSWHZENEJMdFJn0gGTAkFVX3lxTE1YYlVBTTR6czdFWTlHaFJJbEhRZ3hoRmZxbnJxa1AyQzZNblVaaVlnTkhCRTVFSTNQZmM5WkZ4NmdseWNTV1ZYcmw1OXNKOTNJS2JpNXlLV21UR0pCZndDckVrTWt6OUJScDFjUkI5Si1QOEVjYXVoMlN0aFdra1R3RFpjNEkyMGJpWkZ2VFRmSnJ1VGFMWEFpQi1faHQ5NExoNW1XZjltZGlhbzh2ZTY3Skl3VjhFNE5HLWU0SVVjOE1HeDZtTkNEaGNrVUZTUUVxSVNQLWFrTXdlMWdQam5PQmI0R1U5M0czSmNYSUtraFlYS1BybXhrRnRQRG1lQXlpZUxveUVtTzV2eFJLcDY4Smc0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Bitcoin And Ethereum Prices Rebound As Dogwifhat (WIF), Uniswap (UNI) and Aptos (APT) Go Ballistic With 10%-15% Surges - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQSnJONkFNVVVBQ1UwNlBwSjNGdERCdUtWbTJkNnhnMmwybDZMd2NVOVlPRjZESVJCQ2dja1JsbVJfdjNNczZIanZwS0R5eTFGMU5iSTZJNUszX2V1OFdLTnFVVDIxYmM4cVo5enhuaWhhb3J5eDItcFRjTWtHbXJxVnJ6YlJiRXEyc1NxYXIxT2xIeXZWQTk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction 2024, 2025, 2026-2030 - Investing.com Canada",
        "content": "In this (ETH) price prediction 2024, 2025-2030, we will analyze the price patterns of ETH by using accurate trader-friendly technical analysis indicators and predict the future movement of the cryptocurrency.\n\nEthereum (ETH) Current Market Status\n\n\n\nETH Current Market Status (Source: CoinMarketCap)\n\nWhat is Ethereum (ETH)\n\nEthereum (ETH), known as Ether, is the native cryptocurrency of Ethereum. Ethereum is an open-source blockchain platform that revolutionized the blockchain and DeFi sector by the introduction of smart contracts. This second-generation blockchain was launched in 2015. Its native crypto coin, ether (ETH) was launched through an initial coin offering (ICO) in August 2014. The entire Ethereum network is fueled by Ether (ETH).\n\nThe blueprint of the Ethereum network was first released in its whitepaper in 2013 by Ethereum Co-founder Vitalik Buterin. Since its launch, the blockchain-based software platform functions as a potential launchpad for several other crypto tokens, DeFi protocols, and numerous decentralized applications (dApps). Thus, Ethereum is regarded as the “world computer.”\n\nThe smart contracts are coded programs that execute autonomously with pre-defined conditions on Ethereum. These smart contracts are deployed and executed via the Ethereum Vending Machine (EVM).\n\nEthereum will transition to the Proof-of-Stake (PoS) consensus through The Merge upgrade. Initially, the Ethereum network was built on the high energy-intensive proof-of-work (PoW) since its launch. From 2020, the Ethereum developers have begun preparing for the PoW to PoS transition. The Merge upgrade is set for September 15. After this transition, the Ether (ETH) which was an inflationary token will convert into a deflationary token.\n\nEthereum 24H Technicals\n\n(Source: TradingView)\n\nEthereum (ETH) Price Prediction 2024\n\nEthereum (ETH) ranks 2nd on CoinMarketCap in terms of its market capitalization. The overview of the Ethereum price prediction for 2024 is explained below with a daily time frame.\n\nETH/USDT Ascending Channel Pattern (Source: TradingView)\n\nIn the above chart, Ethereum (ETH) laid out an ascending channel pattern. An ascending channel is the price action contained between upward-sloping parallel lines. Higher highs and higher lows characterize this price pattern. An ascending channel is used to show an uptrend in a security’s price. Ascending channels are short-term bullish in that a stock moves higher within an ascending channel, but these patterns often form within longer-term downtrends as continuation patterns.\n\nAt the time of analysis, the price of Ethereum (ETH) was recorded at $3,770.93. If the pattern trend continues, then the price of ETH might reach the resistance levels of $3734.35, and $6167.80. If the trend reverses, then the price of ETH may fall to the support of $2271.93, and $1540.71.\n\nEthereum (ETH) Resistance and Support Levels\n\nThe chart given below elucidates the possible resistance and support levels of Ethereum (ETH) in 2024.\n\nETH/USDT Resistance and Support Levels (Source: TradingView)\n\nFrom the above chart, we can analyze and identify the following as resistance and support levels of Ethereum (ETH) for 2024.\n\nETH Resistance & Support Levels\n\nEthereum (ETH) Price Prediction 2024 — RVOL, MA, and RSI\n\nThe technical analysis indicators such as Relative Volume (RVOL), Moving Average (MA), and Relative Strength Index (RSI) of (ETH) are shown in the chart below.\n\nETH/USDT RVOL, MA, RSI (Source: TradingView)\n\nFrom the readings on the chart above, we can make the following inferences regarding the current Ethereum (ETH) market in 2024.\n\nEthereum (ETH) Price Prediction 2024 — ADX, RVI\n\nIn the below chart, we analyze the strength and volatility of Ethereum (ETH) using the following technical analysis indicators — Average Directional Index (ADX) and Relative Volatility Index (RVI).\n\nETH/USDT ADX, RVI (Source: TradingView)\n\nFrom the readings on the chart above, we can make the following inferences regarding the price momentum of Ethereum (ETH).\n\nComparison of ETH with BTC\n\nLet us now compare the price movements of Ethereum (ETH) with that of Bitcoin (BTC), and Ethereum (ETH).\n\nBTC Vs ETH Price Comparison (Source: TradingView)\n\nFrom the above chart, we can interpret that the price action of ETH is similar to that of BTC. That is, when the price of BTC increases or decreases, the price of ETH also increases or decreases respectively.\n\nEthereum (ETH) Price Prediction 2025, 2026 – 2030\n\nWith the help of the aforementioned technical analysis indicators and trend patterns, let us predict the price of Ethereum (ETH) between 2025, 2026, 2027, 2028, 2029, and 2030.\n\nConclusion\n\nIf Ethereum (ETH) establishes itself as a good investment in 2024, this year would be favorable to the cryptocurrency. In conclusion, the bullish Ethereum (ETH) price prediction for 2024 is $5835.81. Comparatively, if unfavorable sentiment is triggered, the bearish Ethereum (ETH) price prediction for 2024 is $2721.19.\n\nIf the market momentum and investors’ sentiment positively elevate, then Ethereum (ETH) might hit $6000. Furthermore, with future upgrades and advancements in the Ethereum ecosystem, ETH might surpass its current all-time high (ATH) of $4891.70. and mark its new ATH.\n\nThis content was originally published by our partners at The News Crypto."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPYk1KYVpfZVZhbFQ1Rnd1S1dIS3dtdUJVNDYtU2N0eWJqMEJsWWxBZUlEVE5Fa2VMWFlnQU5sRVNMb3lObDFTR1p0cGZRRnlQUVdCTzJZU2V6YW4xbFRkN2dUbWJOVUozRmZFOHloVU5xOGh4dEpZT2w1TEJKRjlCVWkxWDJVelVIV09yN2hQMHkwdEM4TU1fTllsMS05cmQ3ZWfSAacBQVVfeXFMT2J5UTZxVV90T0N0UGVnTzdKQ09BcmRIWWlNUVh2TjFhLWJucnl2eGtRbmxMWlVWb0hjX2ZwWUwtR290bWhjVDFtNE90U2lMSHdHU0tzTW5nc0tLVWN2Sld2ZThONEdkMHRORVVnZzM3UlllUlVnM3RYMnpqZEtTeVlwSEVuWFdJSXJFTHh2TlZLbEM4UG9KX0otQlRET3dTT1RRckFNbGs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Crypto Prices Today: Bitcoin Closer To $68K, ETH, XRP, PEPE Gain As SHIB Soars 68% - CoinGape",
        "content": "The top crypto prices today suggest a bullish sentiment as the Bitcoin (BTC) price neared the $68,000 level while other altcoins gained significantly. In addition, the Ethereum price inched closer to the $3,700 mark. Meanwhile, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) witnessed a notable price hike.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price strongly sustained above $67,000. The Bitcoin price was up by 5.99%, reaching $67,414.65 at the time of writing on Tuesday, March 5. On the other hand, it’s trading volume spiked by 107.04% to $71.35 billion in the last 24 hours. Meanwhile, the crypto boasted a market cap of $1.35 trillion.\n\nadvertisement\n\nLooking at altcoins, the Ethereum price surged 5.72% to $3,683.19 at press time with a market valuation of $442 billion. Whilst, ETH saw its trading volume surge by 80.87%, reaching $28.94 billion. Meanwhile, the Binance Coin (BNB) price increased by 2.07%, reaching $423.61. In addition, its 24-hour trade volume rose by 19.34% to $2.30 billion.\n\nThe Solana price attained the $130 level again. The Solana price was down by 0.30%, settling at $130.17. In addition, SOL witnessed a 44.16% surge in trade volume to $4.71 billion in the last 24 hours. Whilst, the XRP price extended above $0.64 level owing to the recent rebound. The XRP price recorded a gain of 1.34%, settling at $0.6403. Moreover, XRP’s trading volume spiked by 90.55% to $4.21 billion.\n\nMeanwhile, the Cardano price recorded a hike of 1.99% to $0.7617 today. Whilst, ADA recorded a massive 50.23% gain in its 24-hour trading volume, settling at $1.62 billion. As the top crypto prices witnessed gains, the meme coin space was also followed. The Dogecoin price soared by 18.70% to $0.1851 while its rival, Shiba Inu price soared by a huge 68.27% in value and traded at $0.00003834.\n\nAlso Read: Shiba Inu Price Retains 51% Surge Amid Shib Name Service Update\n\nTop Crypto Prices Today Are\n\nPepe Coin Extends Gains\n\nThe Pepe Coin (PEPE) crypto, a trending meme coin, gained significantly. At press time, the Pepe Coin price soared by 8.87% to $0.000007115 with a market valuation of $2.98 billion. In addition, its 24-hour trade volume surged by 42.79% to $4.17 billion.\n\neCash Surges 62%\n\nThe eCash (XEC) crypto registered a phenomenal surge of over 62% and ranked as one of the top crypto gainers today. The Bonk price soared by 62.52% to $0.00007124 at the time of reporting. Moreover, its trade volume skyrocketed by a whopping 1948.20% to $1.28 billion. Furthermore, the eCash crypto attained a high of $0.00008649 amid the rally today.\n\nAlso Read: Bitcoin ETF: Blackrock Sees 6th Day of $1 Bln Trading Volume As Bull Run Continues\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxNbzZQQ1l2QlJacVgyTExSLUx1Z3llN3JzQzBDRmZCS0xRMnNWZW95ZEc0bjQ0V1Y3LVNtY2VBYzkxc0lzajJIQWpVZmtKa25hNWZlS1pkTVhjNjROLUFmcXhZcTYxZG15c2t5dENXQWtEWmctUnlYdFBDTVRVSjlwZ3hUdDEzM3ZFc1p0LXd5NVF0OU5SZWFrUnBnaVpCX3JkaVdYc0RkMHVNeExHSG1XT29wX0ItVzc1SWRQQkUxVVpYdkIwR21weXMxOXRCX05YY3E3Y0V3RExuRDRhT1NvaEJuT3F0eWtuamFlY0NtUTnSAf4BQVVfeXFMT1ZRdEpfRk4zRmtQa0dqRHlXUm5aTjdSTjVkNDAzcmFXRXlzQ0h5NFd2V2k4OWZfYUstUDZITFJqOUs4aDNraElIbllxcms0MWJncDFqNXpkWS1TNVlGT19idDdzMUhfVjRFenhSb2tURVZFUjB0cmtxNVNxYlJMWTYtOXV4Y2J6bzkyNUQtbm5MSThjUWl4bmRfXzFQQmt0SmdCM2VFUDkxUVV5ZTBtLWhNb0tEQzRVSmd6MTI1Z3BZUnNaaGJrQ3RvQ2VrbkV1VXg5VHdzUGpROGFoYTNWcldnTUx3eEpKZFQyZThKam9ielQxTEptLWFDeF81d1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Bitcoin Tags $68.8k, Ethereum Inches Closer To $4k, Latest Prediction For Dogecoin, SHIB, PEPE & BONK - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMihAJBVV95cUxNeGlidDhtT3o2NWp3aEpXUXhhcjI2MlJUOEJ0OFhTTGJwZkRtc1dQQ1F2U3RDMUhUSFFfTGVUaHRmQU5rbTQ0YmV6b0R4RVNPYkU5OXBGcWxFa0diMzZWVERKLTROTjBpN2tRdW02SkpGdWhjR1FWZHNOTXpzUjEweHFZajdvUUpIWEpIaTJtVHl2Z1BPTFpCdWxRYUlveF9ZaUhLVG8wNHZ5WDMwMEIxcjRaYXNPQVB1ekg1THlhNHRWY0Q5VHR5Qlgwa05kemRIV21kdmNTM0ZEQmI3bnRkOUNIbTFtdnh2a25XUnRrbDhhZzhMTUFobFpnVE9YODAxaU1tNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Athene Network (ATH Network) Crosses 3 Million User Milestone, Establishes Itself as Leading Layer 2 Ethereum Solution - Markets Insider",
        "content": "Athene Network (ATH Network) Crosses 3 Million User Milestone, Establishes Itself as Leading Layer 2 Ethereum Solution\n\n—\n\nIn an era where cryptocurrency mining is evolving beyond traditional hardware, the trend of mining via mobile phones is capturing the global audience with unprecedented momentum. Leading this transformative wave is the Pi Network mining app, closely followed by the rapidly ascending Athene Network (ATH Network), a newcomer that's reshaping the landscape of mobile mining.\n\nLaunched in October 2023, Athene Network (ATH Network) has quickly become a sensation in the blockchain community, amassing over 3 million users in a few short months. The platform's growth trajectory continues to astonish, with over 1 million new miners joining monthly, signaling a robust and unwavering interest among participants.\n\nUnlike its competitors, Athene Network (ATH Network) offers a unique proposition - a comprehensive ecosystem that extends beyond its mainnet. Its flagship application, the Athene App (ATH App), has become the cornerstone of its success. This free daily mining coin app not only facilitates mining but also serves as a gateway to decentralized finance (DeFi), attracting over 50,000 new users daily. Available on both iOS and Android, the app is a testament to Athene's commitment to accessibility and innovation.\n\niOS App: Athene Network on the App Store\n\nAndroid App: Athene Network on Google Play\n\nFurther enriching its ecosystem, Athene Network (ATH Network) has launched Athene Gaming, a platform hosting over 6000 games, which debuted in January 2024. The platform has quickly become a preferred destination for gamers worldwide, offering a diverse and immersive entertainment experience.\n\nMoreover, the integration of Athene DEX with Appleswap.ai heralds a new era for trading platforms, offering users convenience and high liquidity. With the anticipated launch of Athene Mainnet and Athene Bridge in Q2 2024, along with Athene Launchpad in March 2024, the network is poised to unlock unprecedented opportunities for the blockchain community.\n\nThe Athene Foundation, set to commence in Q1 2024, aims to catalyze the future of blockchain. With significant backing, including over $2 million raised in angel rounds, the Foundation is dedicated to nurturing blockchain startups and facilitating traditional businesses' transition to blockchain technologies.\n\nAs Athene Network (ATH Network) continues to expand its offerings, including the upcoming Game Tournament - Flappy Lion in March 2024, and a P2P trading and e-commerce platform in Q2 2024, the question arises: Can Athene Network (ATH Network) surpass existing giants to become the premier Layer 2 solution for Ethereum?\n\nWith a mission to foster blockchain development and integration, Athene Network (ATH Network) and the Athene Foundation are solidifying their stance in the global tech and financial spheres, challenging established norms and setting new benchmarks for innovation.\n\nFor further information and to experience the future of blockchain with Athene Network (ATH Network), visit the official website and download the Athene app (ATH App) today.\n\nX: https://twitter.com/Athene_Network\n\nTelegram : https://t.me/AtheneNetwork_Ann\n\nContact Info:\n\nName: David Jones\n\nEmail: Send Email\n\nOrganization: Athene Network (ATH Network)\n\nWebsite: https://athene.network/\n\n\n\nDisclaimer:\n\n\n\nThis press release is for informational purposes only. Information verification has been done to the best of our ability. Still, due to the speculative nature of the blockchain (cryptocurrency, NFT, mining, etc.) sector as a whole, complete accuracy cannot always be guaranteed.\n\n\n\nYou are advised to conduct your own research and exercise caution. Investments in these fields are inherently risky and should be approached with due diligence.\n\nRelease ID: 89123397\n\nIf you come across any problems, discrepancies, or concerns related to the content contained within this press release that necessitate action or if a press release requires takedown, we strongly encourage you to reach out without delay by contacting error@releasecontact.com. Our committed team will be readily accessible round-the-clock to address your concerns within 8 hours and take appropriate actions to rectify identified issues or support with press release removals. Ensuring accurate and reliable information remains our unwavering commitment."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE84Wi1QeHBDRUZiaF9MeFFkWnVaNEdKTFJraWhEVEtUcDNSYmtUSDBBWGZKNlZSNVJ6WG5nd2d4UzRMSjBDcDlENllzcXQ2Y1pkaXpqWktrWF9lQmh6RmFhZ3NONGgyLUROUEt1blNfYU9kTUJyazNLM19SUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Blast Airdrop and Ecosystem Guide – How to Participate - BitPinas",
        "content": "The Ethereum Shanghai was one of the most awaited upgrades of the Ethereum Network, as it enabled the transition of the blockchain from proof-of-work (PoW) to the proof-of-stake (PoS) consensus mechanism.\n\nIn the PoS consensus mechanism, Ethereum users can stake their $ETH to further help the verification and security of the network. In return, those who staked their $ETH received rewards.\n\nBut aside from this update, Ethereum Shanghai also caused the birth of the only known protocol with native yield for $ETH and stablecoins, it is called Blast.\n\nRead more: 30+ Potential Crypto Airdrops to Watch Out For in 2024 (Updated Mar. 2024)\n\nBlast Introduction\n\nBlast (https://blast.io/en) is an Ethereum L2 that recently launched its mainnet. Basically, it allows those who will bridge their assets from the Ethereum mainnet to the Blast mainnet to earn a yield of 4% for $ETH and 5% for stablecoins.\n\nAdvertisement\n\n“Blast yield comes from ETH staking and RWA protocols. The yield from these decentralized protocols is passed back to Blast users automatically. The default interest rate on other L2s is 0%,” its whitepaper read.\n\nMoreover, the developers of Blast, who turned out to be also the developers of the NFT Marketplace Blur, explained that a new L2 is needed because there is no technology yet that incorporates the native yielding for $ETH and stablecoins:\n\n“Blast is an EVM-compatible, optimistic rollup that raises the baseline yield for users and developers without changing the experience crypto natives expect.”\n\nLastly, other dcentralized app developers can build on top of Blast to benefit from its native yield feature as it makes it possible for protocols to create new business models.\n\n“Other L2s keep revenue from gas fees for themselves. Blast gives net gas revenue back to dapps programmatically. Dapps developers can keep this revenue for themselves or use it to subsidize gas fees for users,” they promoted.\n\nBlast Airdrop Guide\n\nIn early 2024, Blast started hosting an airdrop campaign in line with its mainnet launch.\n\nIt follows a points system where 50% of the total rewards are said to go to ‌early access participants while the other half will go to ‌developers within its ecosystem.\n\nTo join:\n\nStep 1: Go to https://blast.io/en/airdrop/sign-up.\n\nStep 2: Connect a wallet. Compatible wallets are MetaMask and WalletConnect.\n\nStep 3: Obtain an invite code.\n\nStep 4: Use its Bridge feature at https://blast.io/en/bridge.\n\nStep 5: Use the dapps within its ecosystem. Aside from the below listed dapps, participants can also obtain points by joining: DTX Airdrop: Earn Crypto Points Through DTX’s New Starship Program Launch Juice Finance Airdrop Campaign Details\n\nStep 6: Refer new users. Referrers will earn 16% of the referee’s points and 8% of the points of the referee’s referee.\n\nStep 7: Wait for the featured dapps that will give multipliers.\n\nStep 8: Monitor the points collected at https://blast.io/en/leaderboard.\n\nAside from Blast Points, the other 50% that is allocated to ‌developers within its ecosystem is called Blast Gold, a special token within the Blast ecosystem that is manually distributed to dapps.\n\nIt depends on the dapp developers on how they will distribute Blast Golds to their users.\n\nInitially, this campaign is scheduled to conclude in May 2024. However, the developers confirmed that they will be moving it to June 26, 2024.\n\nThe Blast airdrop is launching June 26.\n\n\n\nWe know this is past our initial estimate of May and we’re sorry for the delay. The airdrop allocation will be increased to account for this.\n\n\n\nThere will be two final Dapp Gold distributions before the airdrop. pic.twitter.com/5XkYzDuFwD — Blast (@Blast_L2) May 15, 2024\n\nThe number of token rewards is also said to have increased due to the delay.\n\nBlast Ecosystem: A List of Potential and Confirmed Airdrops\n\nAside from Blast itself, dapps built on top of it are also having an airdrop campaign, or even the community is speculating for an airdrop to happen.\n\nThough its mainnet was just recently launched, there are already a number of dapps built on it.\n\nBlaster\n\nBlaster is a decentralized exchange that allows users to trade and launch tokens. It also promotes “gambling while farming both $BLAST and $BLSTR rewards!”\n\nAs of March 2024, an airdrop campaign is ongoing in line with its token’s pre-generation event. The airdrop rewards distribution is expected to happen on the second quarter of this year.\n\nTo join:\n\nStep 1: Go to https://blasterswap.com/airdrop/about.\n\nStep 2: Connect wallet. Accepted wallets are MetaMask, WalletConnect, Coinbase and Rabby.\n\nStep 3: Earn points: By trading at least $100. By providing liquidity pools. By referring new users.\n\nStep 4: Post a Blaster-related content on X to double the points.\n\nStep 5: Wait for the reward.\n\nWen\n\nWen (https://wen.exchange/) is a native NFT exchange that claims to focus on maximizing revenue for creators, buyers, and traders by distributing native yields with almost zero trading fees.\n\nAs of March 2024, its early access airdrop is ongoing. To join:\n\nStep 1: Go to https://wen.exchange/earlyaccess/join.\n\nStep 2: Connect wallet. Accepted wallets include MetaMask, Coinbase Wallet, and Phantom. Note: To be eligible, the wallet must have at least one Ethereum transaction.\n\nStep 3: Follow Wen on X at https://twitter.com/wen_exchange.\n\nStep 4: Join Wen’s Discord community at https://discord.com/invite/eT9fj7hTS9.\n\nPacMoon\n\nPacMoon (https://pacmoon.io/) is a meme coin project that claims to focus on community engagement and social media interaction for its value.\n\nAs of March 2024, its developers have confirmed an airdrop but the details are yet to be announced. It is currently in its early access phase where early access participants can earn a 10% airdrop bonus.\n\nJust go to https://pacmoon.io/airdrop and enter an invite code to receive the bonus.\n\nCyber Finance\n\nCyber Finance (https://cyberfin.xyz/) is a decentralized perpetual exchange that offers up to 50x leverage on blue-chip tokens.\n\nAs of March 2024, a leaderboard system is ongoing in line with its early access campaign. To join:\n\nStep 1: Go to https://cyberfin.xyz/leaderboard?ref=wkskx.\n\nStep 2: Connect a wallet. Compatible wallets include MetaMask, Phantom, Rabby, and Rainbow.\n\nStep 3: Connect X account.\n\nStep 4: Follow Cyber on X: https://twitter.com/CyberFinance__.\n\nStep 5: Join Cyber on Discord for upcoming tasks: https://discord.com/invite/cyberfin.\n\nThis article is published on BitPinas: Blast Airdrop and Ecosystem Guide – How to Participate\n\nDisclaimer:"
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNNGI3VHAyWWd4OVY1Nm03ZTU0TnpoNUpWcS1PaHdKMzNUY2ZzeTI5WHZTTnZfWlBHcFNtZkJTT1ZTMGFYS0tRbGZDVmR6dF93VFZhakRneThFSkFyMHpQUlZES0F1WWI5TGVqNXIxd2laWjd3X0d6VHN4X2t3TlhqbF9wRjI4QXZhUHcxSTFzWEFTSU1JLW9HYUpvbzJHeGdlMmI2N2VVdEtwS252aEpzNEdRelpvZjF6OHhGcmJLOGFDWnBlZE1rdTFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Experts Rate BlockDAG Crypto’s 5000% ROI Potential Higher Than Injective (INJ) Forecast And Ethereum Evolution - Daily Trust",
        "content": "The latest Injective (INJ) forecast has been the talk of the town and signals a promising rally in the crypto market. Furthermore, the evolution of Ethereum has also been a significant industry trend in recent times, with the Ethereum ETFs on the horizon.\n\nInterestingly, new crypto projects have also started to sprout. One of such is BlockDAG (BDAG). BlockDAG stands out due to its various incredible achievements since its inception. It has raised over $2.56 million in 2 presale batches, selling over 2 billion tokens. It has also generated $1,567,640 through BDAG miner sales, selling more than 3.1K miners. This development underlines BlockDAG’s potential as it aims to become a cryptocurrency giant within the market soon.\n\nInjective (INJ) Forecast: Gliding Through Volatility\n\nThe Injective (INJ) forecast is poised for a rally after a 70-day buildup, signaling potential upward movement. Known for facilitating smooth transactions, Injective stands out in the cryptocurrency arena. Despite market volatility, Injective’s prospects for growth are strong, attributed to its secure, fast trading and ability to link diverse ecosystems.\n\nFCTA to get 9 perm-secs for mandate secretariats – Wike\n\nChildren starving to death in northern Gaza hospitals – WHO\n\nWhile the outcome of the expected rally is uncertain, highlighting the speculative nature of cryptocurrencies, Injective’s technology is pivotal in DeFi’s expansion, with a focus on interoperability and user-friendliness, garnering attention from cryptocurrency enthusiasts.\n\nEthereum’s Evolution: Adaptability & Innovation\n\nSince its inception in 2013, Ethereum has been a leading cryptocurrency, second only to Bitcoin, and a key player in DeFi, NFTs, and the Metaverse. Its continuous evolution has expanded its influence into gaming, art, and online casinos, enhancing its value and solidifying its status as a blockchain leader.\n\nWith upcoming updates like Danksharding, Ethereum aims to improve data management and scalability. These advancements, along with efforts to increase transaction speed and reduce costs, highlight Ethereum’s commitment to progress and user experience, positioning it for a dynamic future in blockchain innovation.\n\nBlockDAG’s $2 Million Mega Giveaway Allure\n\nBlockDAG is turning heads in the crypto market. It has raised over $2.56 million in its presale phase, trading over 2 billion tokens. It has also generated $1,567,640 from BDAG miner sales, selling more than 3.1K miners. These achievements show BlockDAG’s strong potential in the crypto market, elevating its current status as a leading presale crypto.\n\nThere’s more buzz with the $2 Million Mega Giveaway. So far, almost 3000 people have joined. The giveaway offers the community a chance to win big cash prizes. This prize will be shared among 50 lucky members who engage on BlockDAG’s social media platforms. Participants must follow BlockDAG’s social media pages to participate, submit their wallet address and engage with the community to increase their chances of winning. Users can also bring friends into the challenge, increasing their chances of winning.\n\nThis giveaway is not just for promotion, it is a big deal. It shows BlockDAG’s dedication to its community and innovation. However, users must hurry and join now, as this giveaway ends on April 15. As BlockDAG nears selling out its second presale batch, its quick sales highlight its growing status in the market and its resolve to bring the needed transformation into the crypto space.\n\nQuick Take\n\nThe Injective (INJ) forecast and Ethereum’s ongoing innovation are no doubt, top projects. However, BlockDAG’s presale looks most promising, as investors are sure of a 5000x return on investment. Moreover, it’s a win-win situation, as BlockDAG’s $2 Million Mega Giveaway further creates more avenues for winning. BlockDAG’s place as a top investment option for 2024 cannot be contested.\n\nJoin BlockDAG Network Now:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu"
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPNG14eVA0Z2g2OVE3M3ZZc3lHZ3BOOXF5NWt3MHgtdS1HOHdpcDBfTjd2RjZMYUJQMzl3Nk9JOTYxSlNCTi1CamNmR3ZweGI5RV9vQmNCYVZvSWFuallrM3dUZ0YzNlpSUVlLODRKcjg2dENQem9JSGdPeXlaSWNqWVRUbXcxbU5MLTlqOVF0S3NOUFHSAZcBQVVfeXFMTTZGUHQyMnF6SDlnMHRNd3BjTE9QeG54OEIxYjllQmp3ZktidmRjVXJFcEM0ZUY3LWVSQ01lUFd4U01RcXlBX0FyTFNoWVNvbWhIdXAyRnUxZ2xYX0NUT29lb203VzBOMi1UQ2syb21wT0JPS2hIMjBydmdMa1VTT19FdWhvRmVRdGZRVlBiYkhPcXhhTFR1WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction After Bitcoin Halving 2024 - CoinCodex",
        "content": "Ethereum is comfortably positioned as the world’s second most valuable cryptocurrency, and it looks like ETH will only solidify its spot over time. Of course, the most important crypto event in the next year will be Bitcoin halving, and it’s expected to have a significant impact on the markets for all cryptocurrencies, including Ethereum.\n\nIn this article, we’ll share our Ethereum price prediction after the halving, and explore whether Ethereum is likely to be a good long-term investment or not. First, let’s take a look at how Ethereum has performed during previous Bitcoin halvings.\n\nKey takeaways: Historical trends show Ethereum's varied performance around Bitcoin halvings, with notable differences between the second and third halvings.\n\nSpeculating on Ethereum's price after the fourth Bitcoin halving in 2024 remains uncertain. While Bitcoin halvings generally create a bullish sentiment, their specific impact on Ethereum's price is unpredictable.\n\nOur projections suggest a potential price dip for Ethereum to around $3,900 by April 2024, 25% below its all-time high but a significant 75% rise from its current value.\n\nLonger-term forecasts indicate a surge to over $6,300 by late July 2024, followed by a dip to $3,700 before rallying to peak above $7,300 in March 2025.\n\nEthereum's long-term potential as an investment looks promising due to the Ethereum triple halving concept. Factors such as reduced ETH issuance, EIP-1559's ETH burning, and staking contribute to deflationary pressure on its supply.\n\nHow has Ethereum performed before and after Bitcoin halvings?\n\nFirst off, we need to keep in mind that Ethereum didn’t even exist yet when the first Bitcoin halving happened back in 2012. ETH has only been around for two Bitcoin halvings, so the sample size of Ethereum’s price action before and after Bitcoin halvings is extremely small.\n\nDate ETH Price 1M before Halv. ETH Price at Halv. ETH Price 1M after Halv. ETH Price 3M after Halv. 2nd BTC Halving Jul 9, 2016 $14.7 $11 $11.7 (+6.3%) $11.2 (+1.8%) 3rd BTC Halving May 11, 2020 $160 $211 $249 (+18%) $398 (+88.6%)\n\nBrackets show ETH performance relative to the BTC price at the time of each respective halving.\n\nAs we can see, the ETH price action around Bitcoin halvings has been quite different if we compare ETH’s performance amidst the second Bitcoin halving and its performance amidst the third Bitcoin halving.\n\nThe Ether market was relatively quiet during the second Bitcoin halving, which happened in July 2016. In fact, ETH saw a 25% price decline in the month leading up to the second Bitcoin halving. Following the halving, it showed a modest recovery, although ETH’s price three months after the halving was only about 1.8% higher than it was at the time of the halving.\n\nThe situation amidst the third BTC halving in May 2020 was much more favorable for Ethereum. ETH increased by 31.8% in the month leading up to the third halving. Three months after the halving, Ether was up a whopping 88.6% compared to its price at the time of the halving.\n\nBased on this, it’s difficult to tell what will happen to the Ethereum price as the fourth Bitcoin halving approaches. Generally, Bitcoin halvings are seen as bullish events and improve the overall sentiment in the cryptocurrency market. So, it might be worth considering increasing your ETH stack a bit before the halving.\n\nWhat is the Ethereum price prediction after the Bitcoin halving in 2024-2025?\n\nCurrently, most estimates are suggesting that we should expect the next Bitcoin halving to happen in mid-April 2024. At the moment, the Ethereum price prediction on CoinCodex is forecasting Ethereum to trade at roughly $3,660 on April 15, 2024. This would be about -24.7% below Ethereum’s current all-time high but a 24.9% increase compared to the Ethereum price at the time of writing.\n\nAs far as the Ethereum price prediction for 2024 and 2025 is concerned, the forecast is expecting the ETH price to accelerate sharply soon after the Bitcoin halving, hitting new all-time highs just above $6,600 in September of 2024.\n\nThe prediction is expecting that ETH will then drop and find support at roughly $4,070, before gathering momentum for a new rally that’s forecasted to reach its peak above $7,000 in April 2025.\n\nIs Ethereum a good long-term buy?\n\nEthereum appears to be quite promising as a long-term buy thanks to a concept known as the Ethereum triple halving. Even though the Ethereum protocol does not have a halving mechanism, it does have features that provide deflationary pressure to its supply:\n\nReduced ETH issuance under Proof-of-Stake consensus\n\nETH burning via the EIP-1559 upgrade\n\nEthereum staking lowers the amount of ETH that is effectively in circulation\n\nThese three factors have already contributed to reducing the ETH supply, and will continue to make ETH deflationary so long as demand for transacting on the Ethereum market remains high. Based on Ethereum’s current trajectory and status as the undisputed king of the smart contracts space, the future is looking bright for ETH holders.\n\nEver since Ethereum moved from Proof-of-Work to Proof-of-Stake, ETH has turned deflationary. Since the transition to Proof-of-Stake, the ETH supply has been dropping by 0.23% per year on average. In that time period, 1.08 million ETH has been issued, while 1.49 million coins have been burned.\n\nETH issuance and burns since the Ethereum network transitioned to Proof-of-Stake. Image source: ultrasound.money\n\nHowever, it's important to understand that it's not guaranteed that ETH will remain deflationary forever. This is because the EIP-1559 mechanism burns the base ETH transaction fees paid by users. This means that the amount of ETH that's being burned depends on the demand for transactions on the Ethereum network. If demand for transactions saw a significant drop, it's possible that ETH could become inflationary again at some point in the future.\n\nAnother way to get a unique perspective on the Ethereum price from a long-term perspective is the Ethereum rainbow chart. This chart uses a concept known as logarithmic regression and features 9 different colored bands. Depending on which band the Ethereum price currently resides in, it can be interpreted as signaling overbought, underbought, or neutral conditions.\n\nIn the video below, you can learn more about the Ethereum rainbow chart and how you can use it to gauge the current conditions in the Ethereum market, as well as its long-term prospects.\n\nThe possibility of an Ethereum ETF\n\nIn January of 2024, the first spot Bitcoin ETFs were approved by securities regulator Securities and Exchange Commission (SEC) to enter the U.S. market. Before that, the only Bitcoin ETFs which were allowed were Bitcoin futures ETFs, which held Bitcoin futures contract and not actual Bitcoin.\n\nThe logical next step for crypto investing products in the U.S. seem to be ETFs that would allow investor to easily gain access to Ethereum, which is the second largest crypto asset by market capitalization. Several asset management companies including the likes of Franklin Templeton and VanEck have already applied to list spot Ethereum ETFs, and BlackRock CEO Larry Fink has said that he sees value in an Ethereum ETF.\n\nTo be sure, it might take a long time for the SEC to approve spot Ethereum ETFs – after all, getting the first spot Bitcoin ETFs was a multi-year effort even though several large asset management firms were pushing to get these products on the market. Still, the narrative that an Ethereum ETF is likely to come in the future will likely serve as a tailwind for ETH.\n\nThe Dencun upgrade\n\nAnother bullish factor for Ethereum is the Dencun upgrade, which will introduce several EIPs (Ethereum Improvement Proposals). The most notable EIP that will be included in the Dencun upgrade is EIP-4844, also dubbed \"Proto-Danksharding\".\n\nEIP-4844 aims to significantly improve performance for applications that depend on the use of extensive datasets, such as decentralized applications (dApps) and layer-2 scaling solutions developed on Ethereum. By dividing tasks between the consensus and \"database\" layers, the upgrade is an important step towards the ultimate goal of completely fragmenting the Ethereum blockchain into shards to achieve massive scalability.\n\nThe Ethereum Dencun upgrade will also introduce other EIPs such as EIP-6780, EIP-5656 and EIP-1153.\n\nThe bottom line\n\nSo far, there hasn’t been a clear trend of how Ethereum tends to perform in anticipation and immediate aftermath of Bitcoin halvings. Of course, Ethereum has only been around for two Bitcoin halvings, so the historical data is very limited. Overall, it might be a good idea to purchase some ETH as the halving approaches since the crypto markets tend to be optimistic in the lead-up to Bitcoin halvings.\n\nETH appears to be positioned well over the long term, thanks to its tokenomics. After transitioning to Proof-of-Stake, the protocol needs to issue much fewer new ETH coins, and EIP-1559 is constantly burning the ETH that’s being spent to pay for transaction fees. If you’re looking to learn more on this subject, check out our article exploring the Ethereum triple halving."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPa1YyeTJSLTZnWWV3UXhZUGJPS1RSUkNRcTdsTDY5QmVNVHdyV28zNEk5V1lWUjg5Y2JlNHpZZXhnOGgxVWJIa3F5NVRzdW5aT3Z2UkVzRkN5Z2UxbkZ3MnYxa3hWeGJVc1lqX21SWUZfMFZVSnJtU0pBR0I0Rll0N3hmbFh1WE1Nb1owb3V2V0wtczF4cGg1SEJMZ3RYa0dnOHNPQnRfaFN0Tk9XSEMxONIBtgFBVV95cUxQM2UzcDRrNThyUEFxZVp3Zmp0S2ZMNXRsNi00aVhpelp4U0VGVnBRWndLVnV3Y1JfZ2FqcHRTQ2VQZ09wWFRhcG9tVWlSWjRPZVV6Wm15QUswLUVwMFdRYWtOQWlvaFNaYy1leENyQm9rMkwzRVlsOTg3MGhWZ2hGazJCbzBiRWJJWGs4WVM4ZzZwcUNNMnlxMGxRa2U5TUNRQUlaczkzbmRUQk5BNUpoU25DRFc2Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Recovers From Dip: ETH Hits $3,900 For The First Time In Two Years - NewsBTC",
        "content": "After Bitcoin (BTC) recorded a new all-time high (ATH), Ethereum (ETH) rallied above $3,800 before the price crashed over 10%. The second-largest cryptocurrency has recovered from the dip and reached $3,900 momentarily for the first time in over two years.\n\nRelated Reading\n\nThe Ethereum Foundation Is Selling ETH Again, Is The Top In? 6 months ago\n\nEthereum Recovers And Rallies to $3,900\n\nOn Thursday, Bitcoin reached a crucial milestone after breaking above $69,000 and recording a new all-time high (ATH). Before the euphoria was over, the flagship cryptocurrency’s price started to drop, trading as low as $60,000. Since then, BTC’s price has recovered to hover between the $66,000-$67,000 price range.\n\nFueled by the bullish sentiment, Ethereum rallied above $3,800 before suffering a considerable price drop. The ‘king of altcoins’ lost momentum and shredded about 12% of its price to trade at a price as low as $3,360, according to CoinMarketCap data.\n\nAfter the dip was done, ETH started to show a recovery alongside Bitcoin. As reported by NewsBTC, a crucial resistance level to clear during this recovery was $3,600. Ethereum surpassed this support level and has maintained its price above the $3,800 range during the last 4 hours.\n\nEthereum reached the $3,800 support level twice in the last 24 hours. This price range was not seen since January 2022, and the regained bullish momentum propelled the token’s price to a higher milestone.\n\nEthereum hit $3,900 for the first time since December of 2021. The biggest altcoin briefly soared to $3,901 before falling to the $3,850 price range.\n\nAt the time of writing, ETH is trading at $3,834, representing a 1.6% price drop in the last hour and a 2% increase from 24 hours ago. Similarly, the token exhibits green numbers on longer timeframes.\n\nETH price performance in the 4-hour chart. Source: ETHUSDT on TradingView.com\n\nEthereum’s price performance has surged almost 16% in the past week, 65% in the last month, and an impressive 145% in one year.\n\nETH’s market capitalization increased 1.55% to $459.7 million on the last day. Its daily trading volume has increased by 58%, with $52.16 billion in market activity in the previous 24 hours.\n\nWhat’s Next For ETH’s Price?\n\nMany analysts have forecasted that ETH’s rally is far from over. Analyst Altcoin Sherpa predicted that Ethereum could reach $4,000 when it breaks through the $3,000 price barrier.\n\nEthereum’s rally seems to be fueled not only by Bitcoin’s momentum but also by the general market dynamics. The date for the Dencun upgrade is approaching, and this update is expected to bring several technical improvements to Ethereum’s infrastructure,\n\nMoreover, the possibility of Ether-based spot exchange-traded funds (ETF) being approved by the US Securities and Exchange Commission (SEC) in May has built expectations for Ether and the blockchain’s ecosystem.\n\nPseudonym trader Ash Crypto suggested to his Telegram subscribers that the price correction experienced after Bitcoin’s new ATH was not a “reason to panic.”\n\nMessage from Ash Crypto to his Telegram Subscribers. Source: Ash Crypto on Telegram\n\nRelated Reading: Ethereum Price Follows Bitcoin Surge, Why $4K Is Just A Matter of Time\n\nThe trader considers that the “late long flush to cut all the leverage” was expected and that a soon-to-come stabilization in BTC’s price will propel the run of ETH and all altcoins. Similarly, he announced the ‘incoming alt season’ after the price of ETH hit $3,900 and suggested that Ethereum’s next support level will be $4,200.\n\n$ETH JUST MADE A NEW HIGH 🔥 $4,200 IS COMING NEXT ! GET READY FOR ALTSEASON pic.twitter.com/ZLirlerVDJ — Ash Crypto (@Ashcryptoreal) March 6, 2024\n\nCover image from Unsplash, chart from Tradingview"
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1zYUdGMGlaNDBXWEVndlZLdmdTaDd5NE9XUjFVX1lkS19ZSzNpRzNaYVVCSTBndmlwdFphTWtaSFZjNnFXOHNwSGpLcFFjNGRVZW5raWdiMGU4enpEa3Y5Sll1N2xobzNzemxDTTF5VFdaTGszRzJzZXlB0gF_QVVfeXFMTzlPNzBzcUtjTGlUSTNWdU9XRHlVQTNaanpZOG12NHktZ1ZsSzdNT0pxODZBNDJSUWRjMDlSM1hmWTRqVVh2THhKREJDLTdJR2ZZMkZCS19qaWJZV2psdkVOVmNKRXpFMEZDbWdfLU5RdkNpdDJ4TUNDTmphLUZraw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 21:04:40 GMT",
        "title": "The Ethereum Foundation Is Selling ETH Again, Is The Top In? - NewsBTC",
        "content": "The Ethereum Foundation, a non-profit organization, has initiated an unexpected ETH sell-off to a single address, prompting speculation about a potential market peak.\n\nEthereum Foundation Executes Multiple ETH Transfers\n\nOn Monday, March 4, Blockchain analytics platform LookOnChain revealed a series of transactions executed by a wallet address related to the Ethereum Foundation. Sharing a screenshot of the transaction details on X (formerly Twitter), LookOnchain disclosed that the Ethereum Foundation had initiated three ETH transactions to a single wallet address identified as “Cumberland Forwarder”.\n\nRelated Reading\n\nAmong these transfers, two involved selling off 500 ETH each, while the third recorded a transaction amount of 0 ETH. At the time of writing the price of Ethereum is trading at $3,684.95 according to CoinMarketCap. This price puts the value of the Ethereum Foundation’s 1000 ETH sell-offs at over $3.68 million.\n\nIt’s uncertain whether this unexpected sell-off indicates a shift in the foundation’s perspective on Ethereum’s current valuation, as the foundation is known for selling ETH tokens during tops. Additionally, the timing of the transfers could be an indication of a peak in Ethereum’s price, which often precedes a significant price correction.\n\nIncluding the Ethereum Foundation, there have been other major ETH transfers made by investors. Earlier in January, bankrupt cryptocurrency company Celsius Network initiated a massive sell-off worth about $125 million ETH. Following this large-scale transfer, Ethereum’s price experienced a major decline.\n\nWith the price of Ethereum slowly approaching its peak value, if a similar sell-off phase occurs, it could potentially trigger a shift in market sentiment, pushing investors to opt for other major cryptocurrencies as they attempt to diversify their portfolios and avoid risks.\n\nETH’s Price Update\n\nRecently, Ethereum has been witnessing significant gains, driving its price closer to its previous all-time high of $4,379 in May 2021. Notably, the cryptocurrency has been aggressively following Bitcoin’s recent bullish uptrend, reinforcing its position as the second-largest cryptocurrency in the space.\n\nRelated Reading\n\nBitcoin Will Reach A New All-Time High This Week, Matrixport Head Of Research Says 6 months ago\n\nVarious analysts have consistently made bullish predictions about the price of Ethereum, with the majority expecting the cryptocurrency to surge above $5,000 soon. Considering the multiple upgrades and developmental activities ongoing within the Ethereum blockchain, a price surge to $4,000 seems probable.\n\nIn the advent that Ethereum reaches its “top in”, the cryptocurrency may undergo a sell-off phase, as investors seek to maximize profits by cashing out their investments. This could lead to a price reversal, with persistent selling pressures diminishing demand and instigating Fear, Uncertainty and Doubt (FUD) among traders and investors.\n\nETH price beats $3,700 resistance | Source: ETHUSD on Tradingview.com\n\nFeatured image from CNBC, chart from Tradingview.com"
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOWEF5cHJuaW9pWG5Sb3hyUHZlaW5NOGlkOG9LWW1sYUViMnBHeWRYaVJhbW82ODFVOWRYdEp3NkdfTkR1WVl6a2NEcnZZeDlFX3BuejVxLU1hVHRRODVjWUdpak1Lck5PZmVGN2N6ODVCRzRrLUVmZHEtVWF6a2lEQnp1WUXSAYgBQVVfeXFMTmxGMnNGcEliRTB5ZVZvQ1VENmZFSWZCS1VkTWlXU0hzYkh6MWtPSGVnOS1VN2tnOG1DaktieG4ycGJnSy1QdmhjeHJKbWtoekVwenFiTTRuaU5xbldTTFpRYTVPZ1pKdmRKMXRTYjFEQlhkeXpJQkxOZ19Malo3TUxuR25nR2lKUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Classic Price Prediction – ETC Price Estimated to Reach $ 40.19 By Mar 10, 2024 - CoinCodex",
        "content": "Disclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision.\n\nEthereum Classic is down -6.86% today against the US Dollar\n\nETC/ETH decreased by -3.67% today\n\nEthereum Classic is currently trading 16.49% below our prediction on Mar 10, 2024\n\nEthereum Classic gained 34.88% in the last month and is up 70.90% since 1 year ago\n\nEthereum Classic price $ 33.57 Ethereum Classic prediction $ 40.19 (11.86%) Sentiment Bullish Fear & Greed index 90 (Extreme Greed) Key support levels $ 34.03, $ 32.03, $ 30.73 Key resistance levels $ 37.32, $ 38.62, $ 40.62\n\nETC price is expected to rise by 11.86% in the next 5 days according to our Ethereum Classic price prediction\n\nis trading at $ 33.57 after losing -6.86% in the last 24 hours. The coin underperformed the cryptocurrency market, as the total crypto market cap decreased by -8.05% in the same time period. ETC performed well against BTC today and recorded a 0.94% gain against the world’s largest cryptocurrency.\n\nAccording to our Ethereum Classic price prediction, ETC is expected to reach a price of $ 40.19 by Mar 10, 2024. This would represent a 11.86% price increase for ETC in the next 5 days.\n\nETC Price Prediction Chart\n\nBuy/Sell Ethereum Classic\n\nWhat has been going on with Ethereum Classic in the last 30 days\n\nEthereum Classic has been displaying a positive trend recently, as the coin gained 34.88% in the last 30-days. The medium-term trend for Ethereum Classic has been bullish, with ETC increasing by 64.46% in the last 3 months. The long-term picture for Ethereum Classic has been positive, as ETC is currently displaying a 70.90% 1-year price change. On this day last year, ETC was trading at $ 19.64.\n\nEthereum Classic reached its all-time high price on May 06, 2021, when the price of ETC peaked at $ 165.75. The current ETC cycle high is $ 45.11, while the cycle low is at $ 12.63. ETC has been displaying high volatility recently – the 1-month volatility of the coin is at 10.74. Ethereum Classic recorded 18 green days in the last 30 days.\n\nEthereum Classic technical analysis for today - Mar 06, 2024\n\nThe sentiment in the Ethereum Classic markets is currently Bullish, and the Fear & Greed index is reading Extreme Greed. The most important support levels to watch are $ 34.03, $ 32.03 and $ 30.73, while $ 37.32, $ 38.62 and $ 40.62 are the key resistance levels.\n\nBullish sentiment for Ethereum Classic\n\n28 indicators are currently signaling a bullish prediction for Ethereum Classic, while 5 indicators are showing a bearish forecast. With 85% of indicators favoring a positive prediction. This results in an overall Bullish sentiment for Ethereum Classic.\n\nCrypto market is currently experiencing Extreme Greed\n\nCurrently, the Fear & Greed index is at 90 (Extreme Greed), which signals that investors have a positive outlook on the market. The Fear & Greed index is a measure of sentiment among cryptocurrency investors. A “Greed” reading suggests that investors are currently optimistic about the cryptocurrency market, but can also be an indication that the market is overvalued. A “Fear” reading, on the other hand, signals that investors are currently hesitant about the cryptocurrency market, which potentially represents a buying opportunity.\n\nEthereum Classic moving averages & oscillators\n\nLet’s take a look at what some of the most important technical indicators are signaling. We’ll be going through key moving averages and oscillators that will allow us to get a better idea of how Ethereum Classic is positioned in the market right now.\n\nPeriod Daily Simple Daily Exponential Weekly Simple Weekly Exponential MA3 $ 30.84 (BUY) $ 27.87 (BUY) - - MA5 $ 30.44 (BUY) $ 26.62 (BUY) - - MA10 $ 28.96 (BUY) $ 24.81 (BUY) - - MA21 $ 27.64 (BUY) $ 22.83 (BUY) $ 42.07 (SELL) $ 21.77 (BUY) MA50 $ 25.86 (BUY) $ 20.57 (BUY) $ 20.86 (BUY) $ 20.81 (BUY) MA100 $ 23.63 (BUY) $ 19.06 (BUY) $ 4.17 (BUY) $ 22.30 (BUY) MA200 $ 20.67 (BUY) $ 18.57 (BUY) $ 21.67 (BUY) $ 20.89 (BUY)\n\nPeriod Value Action RSI (14) 79.92 SELL Stoch RSI (14) 91.85 SELL Stochastic Fast (14) 94.83 SELL Commodity Channel Index (20) 66.67 NEUTRAL Average Directional Index (14) 47.58 BUY Awesome Oscillator (5, 34) 5.22 NEUTRAL Momentum (10) 10.53 NEUTRAL MACD (12, 26) 0.85 NEUTRAL Williams Percent Range (14) -5.17 SELL Ultimate Oscillator (7, 14, 28) 64.20 NEUTRAL VWMA (10) 31.13 BUY Hull Moving Average (9) 33.80 BUY Ichimoku Cloud B/L (9, 26, 52, 26) 30.85 NEUTRAL\n\nThe Relative Strength Index (RSI 14) is a widely used indicator that helps inform investors whether an asset is currently overbought or oversold. The RSI 14 for Ethereum Classic is at 79.92, suggesting that ETC is currently overbought.\n\nThe 50-day Simple Moving Average (SMA 50) takes into account the closing price of Ethereum Classic over the last 50 days. Currently, Ethereum Classic is trading below the SMA 50 trendline, which is a bearish signal.\n\nMeanwhile, the 200-day Simple Moving Average (SMA 200) is a long-term trendline that’s calculated by taking an average of the ETC closing price for the last 200 days. ETC is now trading below the SMA 200, signaling that the market is currently bearish.\n\nThe bottom line about this Ethereum Classic prediction\n\nAfter considering the above factors, we can conclude that the current forecast for Ethereum Classic price prediction is Bullish. ETC would have to increase by 11.86% to hit our $ 40.19 target within the next five days. Moving forward, it will be important to monitor the ETC market sentiment, the key support and resistance levels, and other metrics. However, we have to keep in mind that the cryptocurrency markets are unpredictable, and even the largest crypto assets display a lot of price volatility. For long-term Ethereum Classic price predictions click here.\n\nDisclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPa28zSHVRSFVQb2xFdzVXZDlGTFBPeGlPOGEtUkdpT1VEVDlFWTE4OUdNeUdkY283S181UW9oN2lvN3VrcHBZSEU0VDMzMWdpUnhKdlpydVlkS3Q1WE9EUGxldkhVOEo3QmlHRWQ1WFBkM0FBTHRDS2V2THdoSWoxd3lsSlRUQ3l5TVI0czhJdW01aWFQTHVTbTdLc1hfS1ZNLU9pTGFYZmh3RTNkdUtSSg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Restaking Protocol EigenLayer Tops $10.5 Billion in TVL Ahead of Dencun Upgrade - Blockonomi",
        "content": "EigenLayer, a restaking protocol built on top of the Ethereum network, has seen its total value locked (TVL) hit $10.5 billion, up around 23.5% in the last seven days and over 360% in a month, according to data from DefiLlama. Data also shows that the protocol’s TVL was about $2 billion at the beginning of February.\n\nThe protocol’s TVL is up over 360% over the past month.\n\nWith this major surge, EigenLayer has become the second-largest DeFi protocol, only behind Lido Finance, a leading Ethereum liquid staking protocol. Lido’s TVL currently sits at over $34 billion, up around 15% over the past week and 56% in a month.\n\nBig Ups To EigenLayer\n\nAdditional data shows that WETH accounts for over 41% of the total assets sent to EigenLayer, and stETH accounts for over 32%. Other tokens share a small portion. The tokens that EigenLayer currently supports include Lido’s stETH, RocketPool’s rETH, Coinbase’s cbETH, Stakewise’s sETH, Mantle’s mETH, Frax’s sfrxETH, Ankr’s ankrETH and Binance’s wBETH, to name a few.\n\nEigenLayer is the pioneer in restaking, a trend that has emerged since earlier this year. Simply put, restaking is repurposed staked ETH and Ethereum’s liquid staking tokens across Ethereum and other platforms to enhance security.\n\nIn February, EigenLayer announced that it had successfully raised $100 million in a series B round from a16z fund. Previously, in March 2023, the protocol reportedly secured $50 million from Blockchain Capital, Coinbase Ventures, Polychain Capital and many other funds.\n\nEigenLayer hasn’t issued tokens yet, but the team’s leaders told Bloomberg they are open to token issuance.\n\nAs EigenLayer gains traction, projects associated with it, such as Ether.Fi, Kelp DAO and Puffer Finance, also experience growth. Kelp DAO recently airdropped EigenLayer users based on reward points measured by protocol activities. Ether.Fi announced today that it partners with Omni Network in a $600 million deal to boost the security of EigenLayer’s restaking model.\n\nEthereum-powered Protocols Set to Benefit from Dencun Upgrade\n\nEthereum’s Dencun upgrade is set to go live on March 13. This will be one of the largest upgrade following the Shanghai upgrade last year. The Dencun upgrade is expected to bring several key improvements that will not onlyl benefit Ethereum but also the projects built on top of it, particularly liquid staking, restaking, and cross-chain protocols.\n\nTwo major highlights of the Dencun upgrade is the EIP-4788 and EIP-4844, aimed at reducing risks while enhancing security for dApps. Apart from the security aspect, these proposals also target fee reduction on layer 2 protocols like Arbitrum and Optimism, potentially driving more users to engage with the blockchains.\n\nLiquid staking protocols, like Lido Finance and Rocket Pool, are among the names that could take advantage of the Dencun upgrade. Over the last year, the liquid staking segment has increasingly attracted large-scale adoption, with the potential to reach billions of dollars in value.\n\nThe total value locked (TVL) of projects in this segment, as seen in DefiLlama’s report, increased by 300% last year.\n\nLiquid staking protocols such as Lido, Rocket Pool, SSV and Stader have become familiar names to investors in the industry since Ethereum successfully deployed The Merge, switching from Proof-of-Work to Proof- of-Stake and then proceeded to unlock staked ETH after the Shanghai upgrade in April 2023. This movement potentially continues after Dencun.\n\nAnother group that can benefit from the Dencun upgrade are staking projects, with common names being EigenLayer, Swell, Ether.Fi and Kelp DAO.\n\nAs a result, a wave of new DeFi derivatives products have come, allowing users to reuse their staked assets. For example, Lybra Finance and Prisma Finance are currently offering yields to ETH depositors, while veterans like Abracadabra are showing signs of entering liquid staking.\n\nAccording to CoinMarketCap’s data, Ethereum (ETH) is nearing $3,600 amid Bitcoin’s price rally earlier today. At press time, ETH is trading at around $3,560, up around 2% in the last 24 hours."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOcHVSWThHeURobUQzOGFDbGhSdko0UTdvUWVSN2tpa3ZDOXprenlxZkVqbm9RSG1nWVluOTQtZHFvU2xKeFFkd3ZyVTIzVkVxNElxbEVhZnZwQUFHMmlnX0RGenFJS0dYMHJjUGljdGRMU25YRExVNkJuLTBPTGRUcGxkZEEwVlpyNkFXS1NEQnN1OThiaXk4X1ViWG15SElvR2J3c3dnQW0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Massive Ethereum Staking Surge Ahead of Dencun Update: Over $116 Billion Staked - Crypto Economy",
        "content": "TL;DR\n\nThe upcoming Ethereum upgrade, called Dencun , is eagerly anticipated by the community.\n\n, is eagerly anticipated by the community. ETH staked on the Beacon Chain has experienced a significant increase, reaching a total of 31.387 million ETH, valued at approximately $116 billion.\n\nDencun promises to improve transaction speed and profitability on the network, addressing concerns about scalability and efficiency.\n\n\n\nThe crypto community eagerly awaits the upcoming Ethereum upgrade, known as Dencun. With just a week to go, data shows a significant increase in the amount of Ethereum staked on the Beacon Chain, reaching an impressive total of 31.387 million ETH, valued at approximately $116 billion.\n\nThis increase in staked ETH reflects an upward trend since the beginning of the year, with a 9% growth. This steady increase underscores the ongoing interest and confidence in the Ethereum platform and its shift towards a proof-of-stake consensus mechanism, implemented in September 2022 with “The Merge.”\n\nThe Dencun upgrade has been primarily highlighted by the introduction of proto-danksharding, a feature that promises to make transactions on the network faster and more profitable. This improvement is especially relevant at a time when scalability and efficiency are critical issues for widespread cryptocurrency adoption.\n\nIn addition to improvements in transaction speed and efficiency, the Dencun upgrade also brings significant changes to the Ethereum staking process. One of the most notable changes is the introduction of EIP-7044, which aims to make it easier for users to earn rewards through Ethereum staking without the need to be full validators. This improvement will also simplify the process of unstaking ETH, offering a smoother and more accessible experience for users.\n\nEthereum Prepares to Take a Key Step Towards a Bright Future\n\nOne of the most interesting aspects of EIP-7044 is its ability to allow ETH validators and stakers to store exit instructions in smart contracts. This provides an additional layer of security and flexibility, allowing users to specify conditions under which they want to withdraw their Ethereum. For example, users could set conditions to automatically withdraw if their hardware remains inactive for an extended period, helping to protect validators against potential penalties for failing to process transactions on time.\n\nDencun promises to significantly improve the speed, efficiency, and accessibility of the network. With a steady increase in the amount of ETH staked and exciting improvements on the horizon, the future of Ethereum looks brighter than ever."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOWndaTC1qVzZpRVprbVp5SlNKTlJMaktwRUt6Qk9PSnBWZjBCRHRaNFZUM3RBZHNHLUZjOFdSRFNUZjNrZ2RhSFZRbVpuOEVyMUhPUjdjTFVidzh0Ml9TSFBxN0NTRmRwOFBzU2FKeURKcXdDUnRKRmlGNUE2dWZHMk5vZ0hHd3V2TjFJbzRBQTlKalowaExSRVp1QTYxVzRjZ09OUGNkNFhzaXo2NzFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Could Hit $4,000 with Break of Key Resistance, Glassnode Co-founders Say - Blockchain Reporter",
        "content": "The cryptocurrency market is witnessing an intriguing development as Ethereum (ETH) is on the brink of potentially breaking a significant price resistance. According to the latest market analysis shared by the co-founders of Glassnode, a leading blockchain analytics firm, Ethereum is showing promising signs of a bullish run that could see its value surge towards the $4,000 mark.\n\nThrough a detailed tweet from Negentropic, an X (formerly Twitter) account run by Glassnode’s co-founders, the recent market dynamics were dissected. The post outlined Ethereum’s market behavior, noting its recent price actions mirroring those of Bitcoin (BTC), the leading cryptocurrency by market capitalization.\n\nLast week, #ETH mirrored #BTC’s rise but struggled around $3.5k-$3.6k. Meanwhile, #BTC soared past $60k, touching $64k before settling near $62k. Failure to break $3.5k may lead to sideways movement, but a close above could fuel a surge towards $4k and beyond! 🚀 #crypto — 𝗡𝗲𝗴𝗲𝗻𝘁𝗿𝗼𝗽𝗶𝗰 (@Negentropic_) March 5, 2024\n\nHowever, while Bitcoin has experienced a substantial rally, surpassing the $60,000 threshold and reaching highs of $64,000 before stabilizing around $62,000, Ethereum has faced hurdles. The analysis indicated that ETH has struggled to breach the resistance zone between $3,500 and $3,600.\n\nDespite these challenges, Ethereum is currently witnessing a positive shift in momentum. The latest figures show ETH’s price standing at $3,759, representing a 7.40% increase over the last 24 hours. Moreover, there has been a significant uptick in trading volume, with a 76.40% increase, signaling heightened activity and interest in the cryptocurrency, with current volumes reaching $32.1 billion.\n\nBullish Catalysts for Ethereum\n\nThe optimistic sentiment surrounding Ethereum is underpinned by various factors that suggest a favorable market outlook. Key among these is the growing adoption and utility of decentralized finance (DeFi) applications, which continue to thrive on the Ethereum platform. This burgeoning sector has introduced a new paradigm in financial services, contributing to Ethereum’s increased demand and valuation.\n\nAdditionally, the upcoming Dencun upgrade for Ethereum, set for March 13th, 2024, marks a significant advancement and may enhance Ethereum’s scalability, allowing it to better contend with quicker Smart Contract Platforms in the cryptocurrency sector, like Solana (SOL). This upgrade is expected to address existing bottlenecks and enhance the overall functionality of the Ethereum network, making it more appealing for broader applications and investments.\n\nHowever, it is essential to recognize the inherent volatility and uncertainty within the cryptocurrency market. While Ethereum’s prospects appear robust, its future price movements will be influenced by a myriad of factors, including market sentiment, regulatory developments, and technological advancements. Investors and enthusiasts are therefore encouraged to stay informed and approach their investment decisions with caution and due diligence.\n\nOverall, the path ahead remains filled with uncertainties. As the digital asset ecosystem continues to evolve, Ethereum’s journey toward the $4,000 mark will be closely monitored by investors, analysts, and enthusiasts alike, marking yet another exciting chapter in the ever-dynamic world of cryptocurrency."
    }
]