[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQRjRFUVNId0hHb21HZnBodFVkZ0pBc2FKU19JN2hfYlJfelhoTnhUOHkydUNZeEo3NGtDbVM5MXd1SmJhY2U5LVo0VDh6ZEJYMGJndDlpNUxzZlJ3Qks4LV82OFpWY3QxYjRHaGdCaEdoSUQ5VHh5QXZLYk5faTNNaWowX21vTGF4MDgtUThKV1pNTGp3VEpMZ0ZZUURrWm1VSmFwbHhYanpHM0sySkgzTdIBtgFBVV95cUxOeG1yYXFINDNPcExjcjVaN0hUVTlWMTIyU3BzTGhtMkRIUEJzM1VLa1dGajBERTVrTUw0c2ZwSmMyOTJUV0F6eDdOWk9fejhNUkJSMERWdl9pV1Q0R3hhMUFuNlhTdllZY1hCMFQ4N1R4dEFTWm1lOTA1UUZDTmcyaTJubHUxRFhySzFrQ0xTcmx5eFk2TW04bVp5YjVaNXFWWjVvcTdqdkdEbUZvRUd5akxWYVVmZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "S&P Global Just Made Ethereum's Centralization Risk a TradFi Concern - CoinDesk",
        "content": "S&P is right: concentration or centralization risk exists in all crypto. The fact that this is being discussed by traditional finance (TradFi) analysts once again ( Morgan Stanley has flagged this before) shows just how much institutional interest there is in crypto post-ETF."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQRGR1NTk2X0pvQUkzQzhaRjJxenNPNGFVWW5aZTFUM1EyZG10SUhZdGRKek5QS0xwVklocnE4TEFDQlk1d2ZhNUxTNmx1Z2FmeWFaTTdHbWUtTkVhZUFGZlpuVXJUTVZKa1pObjhZX2U4dHJFQVp4a3libG9OZEQ5cG1BTEZYVE5KN0llUGl2Q3lYNXhr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Is Ethereum Fulfilling Its Potential as an Incredible Disruptor? 3 Reasons I'm Bearish - The Motley Fool",
        "content": "This innovative crypto gets a lot of attention, but investors need to ask pressing questions.\n\nEthereum (ETH -0.92%) was born from the perceived limitations to adding functionality to Bitcoin. Launched in July 2015, Ethereum has skyrocketed nearly 93,000% in value since its public release, even though it remains more than 40% off its peak price.\n\nIs the world's second-most-valuable cryptocurrency, with a current market cap of about $350 billion, fulfilling its potential as an incredible disruptor? I'm not so sure. Here are three reasons I'm bearish on Ethereum.\n\nHuge promise\n\nLet's first try to understand why there's so much hype surrounding Ethereum and its long-term potential. Thanks to the blockchain network having functionality for smart contracts, many bulls believe that Ethereum can disrupt numerous industries, particularly those that depend on expensive intermediaries, by giving power and value back to the users.\n\nIn other words, smart contracts can automate a lot of functions that are slow and cumbersome, and that might not add much value. The end result, as many hope, is a better and cheaper user experience.\n\nViewed in this light, it might be encouraging to see Ethereum's complex roadmap. With scalability, security, and sustainably as the top priorities, the network's developer community has laid out different sets of upgrades to accomplish certain milestones. The latest event, known as The Merge, changed Ethereum to a proof-of-stake consensus mechanism, significantly reducing its energy usage.\n\nViewed as the world's decentralized computer, Ethereum's ultimate goal is to change the entire structure of the economy, mainly as it relates to how individuals can have greater control in an internet-enabled world.\n\nReasons to be skeptical\n\nIt's easy to get caught up in Ethereum's promise. There are more than 250 million unique wallet addresses. It has the most total value locked by far of any other crypto, which measures the amount of assets locked in a specific DeFi protocol. And sure, there are thousands of decentralized applications.\n\nBut I view things with a critical perspective. I think Ethereum is still primarily used as a tool for financial speculation, not actual utility. Even if spot Ethereum exchange-traded funds get approved, it proves that investors only want price exposure, instead of using Ethereum tokens in some dApp setting.\n\nAnd are dApps really better than services provided by well-known businesses? Marketplace and platform-like businesses, such as Meta Platforms, PayPal, Uber, and Airbnb, have billions of users combined who find value in what they have to offer. They work just fine as is.\n\nAnother reason I'm bearish is that I view Ethereum as another venture start-up, which defeats the entire purpose of crypto aiming to be decentralized and give power to the people. There are still a few head developers, most notably Vitalik Buterin, who have outsized influence on the direction of the network. And these founders stand to gain the most financially should things work out as planned.\n\nThe Securities and Exchange Commission said that Bitcoin is the only crypto that's a commodity, and that others are essentially securities. This supports the argument that Ethereum is just another profit-seeking enterprise.\n\nAnd the last bear case rests on the belief that Ethereum is a solution looking for a problem. In fact, this is probably true for nearly all cryptocurrencies right now.\n\nAll of the focus and discussion centered on the complex technicalities of the underlying network sound exciting. However, one really has to question if more and more people will engage further with Ethereum and use its dApps in the future. I'm not confident in this outcome.\n\nIt might make some bullish Ethereum supporters uncomfortable to challenge their beliefs about the cryptocurrency. But I think healthy criticality is necessary to set realistic expectations about its future."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNeGk4aEpJZ1IwT3QwSmxWZzc2Yk9wemt5bXNBVHlZM2QxLUxBMkxSSDk1QTExOWNoaUw2RWFyN0pYaEhCSjZSUUNjLWR5Nlk2cFVEM3ZaTVNnMHd0Zjdndk15SXNTSTBVdkhTNV9kU3M5WGJuTnJ6UEhRLWlkMXE5RW1FczNUX3AxTVBvVUJERzJwbl9SRzhMbExxX2JOVTFYWjBCdjJ2T3Mzazg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: $3,500 Breakout or $2,500 Reversal? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNeUxibmJQd1NvQWF1U2ZNWFB3ZVlUMF8zX194Y0R2WmJQRnFpTFo4UmI1ZTFmRzZ4M0ZmNGVLV3ZUaWZiVGlIUGhpa0JPaUNrTFpZdmFFaEt5NEZ5SE1uSnJWcjRaekdmY2dMc3Q4dmlIOURmOWF3RFNlZHFuWTBxT25WbkRxZzVsdXo4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Reddit invests in Bitcoin and Ethereum ahead of IPO - Yahoo Finance",
        "content": "Reddit, the popular social media platform, has invested in Bitcoin (BTC) and Ethereum (ETH) as part of its treasury management strategy.\n\nThe company’s initial public offering (IPO) filing with the U.S. Securities and Exchange Commission (SEC) on Feb. 22, also mentioned the acquisition of ETH and Polygon (MATIC) for virtual goods sales.\n\nReddit’s potential IPO is anticipated to be one of the largest tech IPOs of the year, although the company has not yet disclosed the number of shares to be sold or the price range for the offering.\n\nThe S-1 filing unveiled that select Reddit moderators and users could participate in its IPO via a directed share program, diverging from the norm of shares being predominantly bought by large institutional investors.\n\nReddit’s foray into the cryptocurrency market is part of a larger vision to integrate blockchain technology into its network of forums and discussions.\n\nThe social media platform has a history with blockchain technology, though not always successful.\n\nLast year, Reddit announced the shutdown of its community points program associated with its MOON cryptocurrency."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOXzNFeEhacnU2dVd4QlJzYmJDZkNFcVVMMzlwWjd4VjJ2Z2NMbjM3eDVuMHFXRUhRamRBQklUNUFfR1RJUWZBcjEyYzNDM1N1NTg4cmdzcklabjY3Q0t5b2RyMEVrOGRRZlJfYTVmQlJOcl95QXRXaS1SSXJzQlRMMUh5TzVsMUFFQmM0ZWtCSEpYSW1KZmfSAZ4BQVVfeXFMTXAxUkstWjNJWG5sYXJLQ1VuSGZlU0FKSDI0d0JQN18tZVNzMnc3OWhGRklKVnhiUjFsNEhlRl9RMmRMdnJac3pUQjhvaldtcjY1MWE0MUV6RlRtWXY1YUtXd1hUWUw5bnk3eHhfcEFhU2NNSEFyV1RXSkxiX2xhaUV5Y2tlZXJCUm0xZU1KeVJDYS0teW91NFAyRl94Znc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "AI Tokens Resist Cooling Crypto Market as Bitcoin, Ethereum Wobble - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter a month of bullish activity, the broader cryptocurrency market is settling as the week draws to a close. Major currencies like Bitcoin and Ethereum are trading relatively flat, reflecting a pause in recent upward momentum.\n\nArtificial intelligence-linked tokens are still going strong, however, buoyed by the current momentum within the AI industry, which is sparking increased investor interest and activity in related digital assets.\n\nIndeed, after Nvidia's blockbuster earnings report this week, tradfi stocks related to AI tech are all on the rise: NVDA, AMD, and MSFT on the Nasdaq are all in the green for the week. Nvidia called it a “tipping point” for AI.\n\nBitcoin's current market position\n\nAD\n\nAD\n\nBitcoin opened the day at $51,252 but slightly decreased to around $51,134, marking just short of a 1% drop within the last 24 hours. This movement underscores a trading sideways period consistent since February 15, as Decrypt previously reported.\n\n\n\nThe cryptocurrency's current position below its EMA10 mark (the average price of the last 10 days) raises concerns about a strong correction. Closing the day under this critical threshold could suggest that bearish forces are gaining a foothold in the market.\n\nSome market indicators signal that a correction might already be underway.\n\nThe RSI—an indicator that measures the strength of bulls over bears in a market—was previously at an exceptionally high 80 points (meaning 8 out of every 10 traders were buying), but has decreased to 66 points. Although still high, this reduction suggests a shift towards a more balanced market dynamic and shows that traders are not as crazy about BTC as they were just a few days ago.\n\nThe convergence of Bitcoin's EMA10 and EMA55 points to a narrowing gap between short-term and long-term buying performance. This trend suggests a cooling off, where recent buyers (who bought BTC during the last 10 days) are not seeing the same returns as those who entered the market earlier (in the last 55 days). It also explains why the RSI is also dropping.\n\nAD\n\nAD\n\nIf this correction continues and the EMA55 crosses above the EMA10, it could mean that the correction may be turning into a bearish trend that leaves newer buyers facing losses.\n\nThe current market is weighing the potential impacts of recent spot ETF approvals and the upcoming Bitcoin halving. The halving has historically influenced Bitcoin's value, sparking a major bull run every four years, and could play a significant role in shaping future market trends.\n\nEthereum's market dynamics\n\nEthereum opened the day at $2,970 but has experienced a 1.4% drop, with its price adjusting to $2,947 by the time of this report. This movement reflects a stronger intra-day decline compared to Bitcoin.\n\nDespite a stronger bullish trend earlier, Ethereum has not maintained its momentum this week. The appearance of a Doji candlestick in yesterday's trading session indicates a potential shift in market dynamics.\n\nThe Doji descriptor is used when a candlestick is flat and has no body—in other words, the price doesn’t move during the session. Yesterday, ETH started the day at $2,967 and ended at $2,968, signaling indecision among traders.\n\nThis pattern indicates a balance between buyers and sellers, with neither side gaining significant ground, and suggests that Ethereum's dominant bullish trend may be weakening.\n\nEthereum's weekly performance remains positive, though, with a 6% gain over the last seven days. However, this growth is modest compared to the substantial increases seen in previous weeks. Last week, it spiked 14.89%.\n\nAD\n\nAD\n\nThe observed deceleration in Ethereum's value growth suggests a potential for minor corrections. These adjustments may be influenced by Bitcoin's market movements, as altcoins often follow the lead of the flagship cryptocurrency.\n\nFor long-term Ethereum holders, the current market conditions still present a bullish outlook. Despite the potential for short-term corrections, the overall trend supports holding onto the coin—for now.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPWHlrRUdfUEJUSGFUVVRFZ1FIa21LU1J0LTZzZ0ZkbDh5MS04UXNpME54TUF6UlhnMjdKZ2prRk96emZWQXpONmE1dUcwbHdEalRpU0R4OWdpZVZjUlBReDdRWXF1elk0SkdjbjZINVFYQW5OeUlaZkRBdUxYemtDY0ZJUk9iRUlKVGRaak1R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum spot ETFs may intensify validator concentration risk, says S&P Global - Crypto Briefing",
        "content": "The research focuses more on Coinbase as a potential risk factor due to its existing custodial role and potential to gain significant control through ETFs.\n\nShare this article\n\nSpot Ethereum exchange-traded funds (ETFs), if approved, could intensify validator concentration risks within the Ethereum network, according to recent research from S&P Global.\n\nThe research, titled “U.S. Ether ETFs Could Exacerbate Concentration Risk,” sheds light on the potential impact of spot Ethereum funds on validator concentration on the Ethereum network, particularly those that incorporate staking.\n\n“An increase in ether staking ETFs could affect the mix of validators participating in the Ethereum network’s consensus mechanism. The participation of institutional custodians could reduce the current concentration on the Lido decentralized staking protocol. However, it may also introduce new concentration risk, particularly if a single entity is chosen to stake the bulk of ether included in these ETFs,” stated the analysis.\n\nTraditional spot traded products like spot Bitcoin ETFs secure their holdings in digital vaults, with their primary function being to mirror the asset’s market price. However, Ethereum’s unique proposition lies in staking – where crypto is locked up to support network operations and secure transactions, rewarding participants in the process. Despite potential rewards, staking introduces the risk of ‘slashing’ if validators underperform or act maliciously.\n\nAccording to the research, spot Ethereum ETFs won’t affect the validator mix, but the proposed staking-enabled Ethereum ETFs, such as those of Ark Invest and Franklin Templeton, could become large enough to significantly influence validator power.\n\n“Spot ether ETFs that simply hold ether will not affect the validator mix in Ethereum’s consensus mechanism. Spot ether ETFs that include staking, however, will do exactly that–at least if inflows are high enough,” added the analysis. “U.S. spot ether ETFs that incorporate staking could become large enough to change validator concentrations in the Ethereum network, for better or worse.”\n\nS&P Global’s analysis also highlights specific concerns around Lido and Coinbase. Both entities are potential threats to validator concentration but for slightly different reasons.\n\nThe research notes that while Lido holds nearly 33% of staked ETH, it’s unlikely that US institutions launching Ethereum staking ETFs will directly engage with Lido due to regulatory and risk considerations. Instead, these ETFs might opt for regulated digital asset custodians for staking, potentially mitigating Lido’s dominance. However, this shift raises concerns about the role of Coinbase.\n\nThe research warns that Coinbase, a major exchange with significant validator control, could increase its Ethereum stake through ETFs, leading to greater concentration. Furthermore, Coinbase’s dual role as custodian for multiple Bitcoin ETFs and potential involvement in Ethereum ETFs could exacerbate concentration.\n\nHowever, the overall impact of ETFs on concentration depends on their staking practices. The research suggests that the introduction of new digital asset custodians could allow ETF issuers to diversify their stakes across different entities, potentially mitigating concentration risk."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOTzNsSC1vakRCdGwtTnJ3YVFhRzBKLUlKdnFiXzFzdzBsMjV2LXF3MjJhTWthNHpzZ2V0S0FlMXZXdU9BLVlGNEVtTXE0VnllUk1Icmg4X2VnNGhrUUlNQUpNeGdCNUJSRThrS3ZtZEpKSVVDQmtBUFM1TjIyNnlDTUFDOXp2VzU5YnZ3M2F5NGR2UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Reddit IPO filing reveals treasury exposure to Bitcoin, Ethereum - CryptoSlate",
        "content": "Social media giant Reddit has been quietly buying Bitcoin and Ethereum with some of its excess cash and holds an undisclosed amount of the two tokens in its treasury for investment purposes.\n\nThe social media giant’s crypto exposure details were revealed in its initial public offering (IPO) prospectus, which was filed with the SEC on Feb. 22. The filing comes after months of speculation about the company’s plans to go public.\n\nThe company did not disclose how many shares it plans to sell or the price range for the offering. However, it is expected to be one of the largest tech IPOs of the year.\n\nCrypto exposure\n\nThe filing clarifies that Reddit’s crypto holdings are confined to Bitcoin and Ethereum, both established players in the crypto space. The revelation was somewhat of a surprise, considering the company’s cautious approach toward crypto in recent years.\n\nAccording to the document, Reddit’s board of directors has approved the investment policy, which focuses on “risk mitigation” by only investing in cryptocurrencies deemed “not likely to be a security” by regulatory bodies.\n\nThe filing did not disclose the amount of Bitcoin and Ethereum held in the treasury or how long the company has been buying them.\n\nWhile the disclosed crypto holdings are limited to treasury purposes, the filing also mentioned that Reddit had acquired Ether and Matic for virtual goods sales. It added that the amounts were “immaterial” in recent years.\n\nThe filing acknowledges the inherent risks associated with cryptocurrencies, including volatility, cybersecurity threats, and potential regulatory changes. It also highlights the accounting challenges posed by treating cryptocurrencies as indefinite-lived intangible assets and the upcoming changes in accounting standards.\n\nDigital infrastructure\n\nReddit’s IPO filing hinted at broader ambitions to integrate blockchain technology into its expansive network of forums and discussions. It described the platform’s ongoing efforts to diversify its revenue streams and enhance its digital infrastructure, with cryptocurrencies playing a crucial role in this strategy.\n\nThe filing also mentioned exploring decentralized applications (dApps) and the potential for blockchain to offer new forms of content creation, sharing, and ownership. It also emphasized the potential of blockchain to enhance user experience and create new avenues for community engagement and monetization.\n\nReddit’s IPO filing offers a glimpse into a social media giant cautiously embracing the world of cryptocurrencies. While the company’s current exposure is limited, its openness to experimentation and focus on regulatory compliance suggests a potential for future growth and innovation in this space.\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE80c01MTFBWdXp3YlJFNEZmWENraktsZGdTWF95UE5pSkNwNWhsSUo4ZnlFVGpFSWdTcTJfclgxd1NTVDQ4SEJBY0swZGRvLXQyZHRiNDlGTDFqbUE0bXBwUkFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Grayscale: Ethereum’s Dencun upgrade driving price upward - crypto.news",
        "content": "While a possible spot Ethereum ETF approval looms ahead, Grayscale experts believe an upcoming technological improvement is behind recent price upticks.\n\nGrayscale research analyst William Ogden Moore said in a Feb. 23 report that Ethereum’s Dencun upgrade has most likely triggered rallies in Ether (ETH) prices. According to CoinMarkerCap, ETH is up 34% in the last 30 days and 28% year-to-date per TradingView.\n\nEthereum’s Dencun upgrade, scheduled for March 13th, 2024, represents a major step forward and could help Ethereum compete in terms of scalability with faster chains in the Smart Contract Platforms Crypto Sector, such as Solana. We believe that recent price performance reflects the market’s anticipation of this upgrade. William Ogden Moore, Grayscale research analyst\n\nETH 30D price chart | Source: CoinMarketCap\n\nYou might also like: Coinbase calls on SEC to approve Grayscale’s spot Ethereum ETF\n\nDencun promises to uplift throughput and reduce transaction costs, allowing users to spend less gas fees and make more transactions on ETH’s mainnet and layer-2 scaling solutions like Arbitrum.\n\nDevelopers plan to achieve this key overhaul via proto-danksharding, introducing data blobs.\n\nMoore’s report suggests that Ethereum could seize greater smart contract business share from competitors like Solana if the network can offer cheaper fees. Moore opined that this might unlock a multi-billion market tied to real-world assets.\n\nIf Ethereum can simply become more competitive in throughput and cost, it could position itself to capture smart contract applications that demand high levels of security and censorship-resistance like stablecoins or tokenized financial assets. William Ogden Moore, Grayscale research analyst\n\nGrayscale’s bullish outlook on ETH and its blockchain complements the investment firm’s bid for a spot exchange-traded fund following its successful GBTC conversion last month. According to Yahoo Finance, the company hopes to do the same with its Grayscale Ethereum Trust (ETHE), which holds over $7 billion in assets under management (AUM).\n\nThe U.S. SEC delayed a decision on Grayscale’s application till May, along with several other issuers.\n\nETH YTD chart | Source: TradingView"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE1BZnlKMmFNNnBzTjJ0QlljeGFLRThEZHZyUXJLbThKdTgxLS1HN204OUYtdmRWei16ZTducHJtbGxmM19TYlkzT09vZUFHT05XZ3FQYUdOdUFmM2hIOUFGSVRuYUExS0Jld25seHRjSdIBdEFVX3lxTE04bEI2eGdub2RJdERUM05jOTloV1RjUDhkWUpodXh1cGxjdkdBNld0eXVwX1VUelRPS2N1LXJFbVl0VXVBbFZSRWNXbFRMOVVTVWpSbVlEWmlIT3ZmT2FFdDlmRjNIM0xjT2xmYkFOSllSX1FV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Dencun Upgrade Date Confirmed by Devs - U.Today",
        "content": "Almost all software clients are ready for Ethereum Dencun activation, says Galaxy researcher Christine Kim. Meanwhile, Ethereum (ETH) developers agreed on the first EIPs of Electra, a hardfork expected in late 2024.\n\nAdvertisement\n\nEthereum Dencun activation on March 13 confirmed\n\nDencun mainnet activation is scheduled for March 13; the timeline is confirmed by Ethereum All Core Developers Consensus Call #128 that happened yesterday, Feb. 22, 2024. All software clients except Lodestar are ready for mainnet Dencun release.\n\nquick notes from the eth dev call this morning, acdc #128:\n\ndencun 🐡\n\n- all client teams, except lodestar, have released final software versions for the dencun upgrade\n\n- these versions plus the dencun-ready candidate client for lodestar are currently being tested on one last… — Christine Kim (@christine_dkim) February 22, 2024\n\nUpdated software client versions together with Lodestar are currently being tested on one last testnet within the framewok of a so-called mainnet shadow fork. Meanwhile, Ethereum (ETH) devs scheduled more testing on the shadow fork over the next few days.\n\nDencun-ready MEV-Boost software will be released by the Flashbots team next week, Kim says. Prior to March 13, all node operators should upgrade their clients and MEV protection software.\n\nAs covered by U.Today previously, Dencun or Cancun-Deneb upgrade reconsiders the way data is being processed in Ethereum (ETH) to make it more resource-efficient.\n\nDevs started working on Electra, next major Ethereum hard fork\n\nDencun will introduce the Proto-Danksharding mechanism and \"blob\" data instrument to reduce the volume of data Ethereum (ETH) network needs to store.\n\nEthereans have started working on the Electra upgrade. The first version of the agenda includes three EIPs: EIP 6110 \"Supply validator deposits on chain,\" EIP 7002 \"Execution layer triggerable exits\" and EIP 7549 \"Move committee index outside attestation.\"\n\nEthereum Electra is the next major milestone in the Ethereum proof-of-stake (PoS) roadmap."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOdm1YSTFnaDNJS1ZXcFBVSUg4ZVh4dmFqNVRxRmtqRVFHSWJTNWtaR3hDdHFBQUxJTnBqejltOVktTGFUQ1IySWQ1bDRSMkZqSkpPWVJTSXFXeHJQVmk0N0RwamtHMkNISk93b2FCcmFFenljQnJWZUV2OHVGc2NzeG1oTUpia0NEQ0ZWVlVqclFhMy1xR2otY3d5eDl2SlpISGV6cmhxVkpERjdIYmxiV2QxZFdHY0xzT1NoZmxB0gHDAUFVX3lxTE9xU1hOREdjVzZfcjE4bW12WWRLZlhKakdTem1jZWNSV3RhUkh6SWh0VlVlT2RJQno5VWhMS2hTRHF2VEp6Y2hZcVBPck1EWS1ZS0x0WlNxMUNVcXMyUGM4MWtYVXVNenF5SEIyTXY2S3RoX0NsQXZWOXRPNnlBRE12WTJOMjJiQlNVOV9SMFZkYUFVNmtGZF9fcThNcjZEZGFrQmRuMEpJUUFhNkt3ODFQdGdEd1ItbHZ3ek5xQjN2dDUxdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum price briefly touches $3,000 for third time in a week - FXStreet",
        "content": "Ethereum price revisited its local top of $3,000 as market participants turned euphoric on Thursday.\n\nSocial media mentions of buying Ethereum and $3,000 peaked on Wednesday.\n\nETH price could revisit its support at $2,601 before retesting its 2024 peak.\n\nEthereum price crossed $3,000 for the third time this week, resulting in euphoria among crypto market participants. On-chain intelligence firm Santiment noted that traders bought Ethereum at the local top, above $3,000, out of the Fear Of Missing Out (FOMO).\n\nAlso read: XRP price suffers pullback with latest update in SEC v. Ripple lawsuit\n\nEthereum price crosses $3,000 yet again\n\nEthereum price has crossed the psychologically important $3,000 level several times this week, with no sustained continuation of the uptrend. ETH price has corrected briefly each time the altcoin revisits the $3,000 mark.\n\nOn-chain intelligence tracker Santiment identified the likely driver of the price rally to $3,000. Each time Ethereum price hit its local top, there was an increase in the mention of “$3K,” “buy,” or “buying Ethereum” in relation to ETH. This indicates there was an increase in FOMO among market participants and this resulted in traders buying ETH at the local top, above $3,000.\n\nThis also explains why Ethereum’s run to $3,000 has been a short-lived trip each time.\n\nEthereum rallies to $3,000 yet again. Source: Santiment\n\nOther factors influencing Ethereum price are Bitcoin price trend, which is currently sideways below the $52,000 level and the anticipation surrounding the approval of a Spot Ethereum ETF. Bitcoin’s price trend and the next move, a rally towards $53,000 or a correction towards the psychologically important $50,000 level, could determine where Ethereum price is headed next.\n\nAdditionally, the anticipation surrounding the Spot Ethereum ETF could die down soon and ETH price fails to sustain its recent gains.\n\nEthereum price could revisit 2024 peak on one condition\n\nEthereum price is in uptrend and the altcoin is currently trading close to the 23.6% Fibonacci retracement level of its rally to the 2024 top of $3.033.09, at $2,829.36. Ethereum price needs to hold steady above support to attempt another rally towards its yearly high.\n\nSustained buying pressure and positive momentum can help Ethereum price rally higher. The green bars on the Moving Average Convergence/ Divergence (MACD) and the Awesome Oscillator (AO) suggest that there is positive momentum and Ethereum’s uptrend is intact.\n\nETH/USDT 1-day chart\n\nIf Ethereum price closes below $2,829.36, it could result in a sweep of support at 38.2% Fibonacci retracement of $2,703.32 and even the 50% Fib retracement at $2,601.46 if the correction is steep. ETH price is likely to recoup its losses, rallying towards the $3,033.09 target post the correction."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPbThZbl9yT21iaDZIRUJYdm1PWnhnZ1l4TWRYME04TDRtdmRXeUVZNVVTeThXUkhacjZDMDk5eVlEMFJad25OOThGLWhRcm1SZnRRU2l4NmdzQlNWLV9TNUZFdlB4S0gyTndHSVJtSlpWVkMyaE5hUXFjVGJRd3B4Q19QZUZVRGJKdjFsTE5JZk9qSV9oX0U5WFRWdkhqaWdERGxnd1VR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Mystery Ethereum whale accumulates $411 million ETH in February amid ETF rumors - CryptoSlate",
        "content": "An unknown Ethereum whale has been accumulating ETH at a rapid pace since the start of February. Over the past 23 days, wallet 0x7a95c has acquired $411 million worth of ETH and stETH, mostly from Binance.\n\nData shared with CryptoSlate from Spotonchain traces the ETH inflows into the wallet throughout the month, showing persistent purchases of between 3,000 and 34,000 ETH.\n\nCryptoSlate analysis tracing inflows and outflows from the wallet shows connections with multiple different exchanges and DEXs. Almost all funds into the wallet came from Binance with $21 million HTX and 1inch. However, in terms of outflows, a wide range of addresses are connected, including Wintermute, Uniswap, 1inch, AlphaLab Capital, Native Pool, and Paraswap, among others.\n\nDigging into the transaction details on Spotonchain, the whale transferred a substantial amount of 7,915 ETH, valued at approximately $23.52 million, from Binance to their wallet. This transaction, recorded on Feb. 22 at 16:38, signifies the continuation of a notable pattern of accumulation by this entity. The transaction details indicate a deliberate strategy by the whale to increase their holdings in Ethereum.\n\nOver the past four days, the whale has reportedly purchased a total of 112,923 ETH through Binance and 1inch, with an average acquisition cost of $2,892 per ETH, amounting to an investment of $326.5 million. Following these transactions, the whale’s Ethereum holdings now stand at 132,585 ETH, alongside 5,485 STETH, cumulatively valued at $411 million. This portfolio currently exhibits an unrealized profit of $21.13 million, highlighting the financial gains resulting from these strategic moves.\n\nThe pattern of accumulation includes several other significant transactions. Notably, 17,198 ETH were withdrawn from Binance in a prior transaction, contributing to the whale’s growing Ethereum reserves.\n\nFurthermore, the whale’s activities extend beyond Ethereum purchases, as evidenced by a withdrawal of 40 million USDT from Binance. This suggests a broader strategy that potentially includes leveraging stablecoin reserves to further increase Ethereum holdings. The whale’s transactions and holdings, particularly the strategic use of both ETH and STETH, reflect a sophisticated approach to digital assets investment, emphasizing diversification and timing to capitalize on market movements.\n\nRumors of a potential spot Ethereum ETF being approved by the SEC have helped push Ethereum back over the $3,000 mark on two occasions this month. Concerns over theoretical issues with the centralization of staked Ethereum amid a spot ETF have been raised, though at present any potential approval is unclear.\n\nUnconfirmed rumors of Justin Sun relationship\n\nEarlier in the month, Lookonchain suggested the whale may be Justin Sun based on an analysis of similar transactions with a suspected wallet belonging to the investor. However, all information appears to be circumstantial, and the wallet has no equivalent active address on the Tron blockchain. Still, interestingly, the 0x7a95 wallet has never interacted with USDC and only appears to use USDT for stablecoin transactions. Circle stated that Justin Sun has no accounts with them in a 2023 letter to Senator Elizabeth Warren, yet wallets identified by Arkham Intelligence to belong to Sun transacted with USDC as recently as Feb. 22.\n\nThe only connection to Justin Sun that could be identified by CryptoSlate was a 1inch Settlement contract with two tangentially related wallets. Addresses 0x874d and 0x158B received $21 million from 0x7a95, and both transferred funds to the 1inch Settlement contract 0xA888. A Justin Sun-tagged wallet, 0x1387, received $58 million from the same 1inch contract a year ago. However, all transactions from 0x7a95 happened much more recently.\n\nCryptoSlate is monitoring the wallet and related addresses should further information become apparent.\n\nMentioned in this article"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQYXBfWUtGSER0TkQyN0dEZUdjUFJVakRjUVpMWTFuSEgxLTNzRVRVc3NrUEhPSjV0Nkk1RzhMeUFsZi1EUFJRRFlaSmlrQy1mU1RjYXl1bXFkejdTdXQ5cWVEZmJrUy1IaGlSNHlDNGpXRzlhYXRYRzhsYTB4Wm1rNWVZamFsRlRoRVBZNVdUMGlyRkhRVk5vRnY5b0hvdVdueUE1MVdPdU5lbXVJUmpoSmZnSDBYLV9mZEVDLUF30gHDAUFVX3lxTE5jaDBEZkZmXzFkVTRGSjVVYzZUUFpsd2VaTmROdWp2TFNRMWNHb09BZ0l2azZIQzJCaXh4NElCR3p0MlVNcGREMkh6ZkptMXY1V3Fsc0ZRWTVCUTg1U19EUzF5TDhkQWZQT2dLS3FJZXluMkdqNFNOelR1QmFzQmpuZjRORGp6UGp3Z2xzNlM0QUpIX2hIY2JxM2NDU0dCQ2wtcGVSVjNmUEFRUWVYUXN5NFVNbHNXbjdXU093eTFSZzJlYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Layer-2s About To Take Off, Says Coin Bureau’s Guy Turner – Here Are His Top Picks - The Daily Hodl",
        "content": "The host of the Coin Bureau YouTube channel, Guy Turner, is expressing bullish sentiment on Ethereum (ETH) layer-2 projects.\n\nIn a new strategy session, Turner tells the 2.41 million channel subscribers that ETH’s Dencun update may cause layer-2 projects to go on massive rallies and he names his top four picks.\n\nThe Dencun upgrade, which is expected to roll out in March, aims to reduce costs for layer-2 transactions and data availability on the leading smart contract platform.\n\nSays Turner,\n\n“As the Dencun upgrade draws near, Ethereum’s layer-2s are about to take off.”\n\nFirst up, the trader says that Arbitrum (ARB) could maintain its upward momentum.\n\n“ARB recently hit an all-time high of $2.40 on the 12th of January, and hasn’t really shown many signs of slowing down either in large part due to the anticipated effects of Dencun. This is because Dencun’s impact on layer-2 transaction speeds and costs will likely see more and more people adopting Arbitrum as an even cheaper way of interacting with Ethereum.”\n\nArbitrum is trading for $1.83 at time of writing, down 6% in the last 24 hours.\n\nNext up, the trader says Optimism (OP) has a lot of upward potential due to its aim to build a “superchain” ecosystem that promotes collaboration across multiple layer-2 scaling solutions.\n\n“One of the first entrants to the ‘superchain’ ecosystem was none other than Coinbase’s very own layer-2 solution, Base…\n\nThis superchain could quickly become a reality after Dencun.”\n\nOptimism is trading for $3.68 at time of writing, down more than 9% in the past 24 hours.\n\nAnother scaling solution on the trader’s radar is Immutable X (IMX), which he believes could become more popular in the GameFi industry.\n\n“Immutable could see a rapid acceleration in blockchain gaming development as network efficiency is supercharged. With Immutable being positioned as a big player in the GameFi narrative, many more gaming developers will be turning their attention to the best environment to launch their products in, and Immutable will be a top contender in that regard.”\n\nImmutable is trading for $3.33 at time of writing, down more than 5% in the last 24 hours.\n\nLastly, the trader says Polygon (MATIC) could rise in value due to its own planned network upgrade called Polygon 2.0.\n\n“MATIC hit an all-time high of $2.92 on the 27th of December 2021. At the time of shooting, it’s still at 66% down from this price point. However, this could all change with 2.0.”\n\nMATIC is trading for $0.93, down nearly 9% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNeVVEcU5sZ1JWY1FLc1Rra0F5UFZuY09mYURTS0VRR1F2VmtrbGxJOURCcmI4UDJlZng3Zy1MUjhoMEtocFV0MFpnaGdJcTFMQVdJSzdGbE05UFo4TURjQURmYVFRZUZjbmxreWlDSGxLcTR4U20tNV9lal9FTDhTN0Vxcjc5TXMtU2NCWUVNOVpFQTZhUmFabFBB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "New Layer 2 Ethereum network soars past $128m in deposits in 24 hours - DLNews",
        "content": "Zircuit has attracted over $128 million in deposits within the first 24 hours since opening deposits.\n\nIt is backed by notable investors including Pantera, Dragonfly Capital, and Maelstrom, and introduces \"sequencer level security.\"\n\nZircuit allows for the staking of restaked and staked Ether.\n\nA new Ethereum Layer 2 network, Zircuit, enables the staking of restaked and staked Ether.\n\nYes, you read that right.\n\nOver $128 million has already been deposited in Zircuit since deposits opened in the last 24 hours, all before Zircuit’s mainnet has even gone live.\n\nZircuit is backed by Pantera, Dragonfly Capital, and Maelstrom and considers itself an Ethereum zero-knowledge layer 2 network. One of the key features Zircuit introduces is what it has dubbed, “sequencer level security.”\n\nZircuit monitors the mempool, the backlog of pending transactions on a blockchain, and searches for malicious transactions to prevent their inclusion in a block.\n\nEssentially, if a hack or exploit is detected, the Zircuit network has the ability to stop it in its tracks.\n\nDeposits now sit in a smart contract on Ethereum, and once the Zircuit mainnet goes live, users will have the option to migrate to the mainnet or withdraw at any time without penalties.\n\nUntil then, users can earn yield and points on their deposits. This includes the yield from Ether staking, EigenLayer points, liquid restaking protocol points, and Zircuit points.\n\nJoin the community to get our latest stories and updates\n\nFor users who want to experiment on Zircuit’s testnet, it is already live.\n\nEigenLayer is a new protocol within the Ethereum ecosystem that extends Ethereum’s security across blockchain networks by implementing restaking. The launch of the EigenLayer mainnet — the core blockchain infrastructure — is slated for the second quarter.\n\nZircuit accepts deposits in Ether, in liquid staking token stETH or in any of the following liquid restaking tokens: ezETH, rswETH, rsETH, and LsETH.\n\nThe largest depositor so far is wallet address, 1ef2, who has deposited over $22 million so far in stETH and rsETH tokens.\n\nPoints are part of a wider trend in crypto that generally precede a forthcoming airdrop. Users earn points, which are later migrated to tradable tokens in the future just by using these protocols.\n\nStaking restaked staked Ether\n\nStaking Ether secures the Ethereum network and offers users an annual percentage yield of 3%-4%.\n\nUsers can run their own node to stake, which involves a certain level of technical knowledge and at least 32 Ether, or they can use a liquid staking protocol like Lido that abstracts away the technical know-how and capital requirements of staking.\n\nRestaking Ether involves depositing a liquid staked token, like stETH from Lido, into EigenLayer, a buzzy new Ethereum protocol that extends Ethereum’s security to other blockchain networks through restaking.\n\nCurrently, because the EigenLayer mainnet is still not live, staked Ether that is restaked with EigenLayer, or one of the many liquid restaking protocols, does not earn any additional yield, but earns EigenLayer points. It is expected when EigenLayer’s mainnet is live, restaked Ether will earn an additional yield.\n\nAdditionally, these liquid restaking protocols offer their own points on top of the EigenLayer points.\n\nFinally, users can take their liquid restaked tokens, which are already earning the Ether staking yield, EigenLayer points, and liquid restaking protocol points and deposit them into Zircuit to earn Zircuit points. Or, users can choose to just deposit staked Ether.\n\nPoints are generally non-transferable, but one protocol, Whales Market, has opened up a secondary market for these points.\n\nPoints for EigenLayer have already seen over $2.1 million in total volume at an average price of $0.14, giving the estimated 1.7 billion points in circulation a market cap of $250 million.\n\nRyan Celaj is DL News’ New York-based Data Correspondent. Reach out with tips at ryan@dlnews.com."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNM2xFMHdxZ1cycng3dnoxdEd0WTZKQ3Zyc0Y2VTBIOWZnWXp3OUhXT0NXMDcxNlhiQ0wyRFc4Qmllcm9Ga2VoT1BmWGJzZk85Tkg5eE1NMWFxUWNIeHdUcG9VMTNNcW5CODJQYjNseDhUUm5heW1ZVENiWnl1MmRKUmJRVko5SVHSAY8BQVVfeXFMT3loMVdNVXlQZDFOYzJkaTc2ajg2VVp0cnI4a2IxeHByYzV6a0FhVmMzS0pvRzBwU1lsSVl1ZWd5aW9ad2VNeGRNVkR3Ukd1QndkS1FvX3RSWVZqUWk1RHpkX0xva25IQng2M19RNU42NXV1TUs2TDJYcklsOFZYSExkcWF3ZXI1aWFKdUpEMEU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Starknet Price Jumps After Ethereum Scaler Bows to Pressure Over Token Unlock Schedule - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nStarkWare, the startup behind the Ethereum scaling network Starknet, announced Thursday that it will revise its STRK token allocation schedule for contributors and investors following backlash from the crypto community.\n\nThe company will spread out its allocations over the course of years rather than conducting a sizable planned STRK unlock this April. The price of STRK jumped following the announcement, according to CoinGecko, rising from $1.86 to $2.03 in a matter of minutes before settling to just under $2 as of this writing. The token is up 9% on the day.\n\nStarkWare had initially planned to unlock 1.3 billion STRK tokens for investors and early contributors on April 15, following this Tuesday's token launch. The short cliff had been controversial among Starknet users and across the broader crypto community, amid fears that such a sizable unlock (about 13% of the total STRK supply) could impact the token's price.\n\nUnder the revised plan, StarkWare will unlock 64 million tokens monthly for the first year starting April 15, and then 127 million tokens monthly for the 24 months thereafter.\n\nAD\n\nAD\n\nImportant update: After listening to feedback from ecosystem friends and collaborators, we are changing the lockup schedule for StarkWare’s early contributors and investors to make it more gradual. We value this community and want to earn its trust by building great tech that… — StarkWare (@StarkWareLtd) February 22, 2024\n\nThis spreads out the token unlocks, with 580 million tokens set to unlock for contributors and investors by the end of 2024, with another 1.4 billion STRK unlocked in 2025 and a further 1.5 billion STRK set to unlock for those people in 2026.\n\nIn a tweet, StarkWare co-founder and CEO Eli Ben-Sasson wrote that his company \"listened to concerns re: long-term alignment of StarkWare w/ Starknet ecosystem,\" \"proposed a more gradual release schedule,\" \"[believes] trust is earned with actions, not just words,\" and \"[thanks] investors for their support on this.\"\n\nBen-Sasson had previously brushed off criticism over the token unlock schedule after the token launch plans were revealed last week.\n\nAD\n\nAD\n\n“The unlocking for the team and early investors… is one aspect in which we may be non-standard,” Ben-Sasson told Decrypt last week. “But we build different and we view things a little bit differently.”\n\nWe\n\n1. listened to concerns re. long-term alignment of @StarkWareLtd w/ Starknet ecosystem.\n\n2. proposed a more gradual release schedule\n\n3. believe trust is earned with actions, not just words\n\n4. thank investors for their support on this@StarkWareLtd ❤️ @Starknet https://t.co/WZsiZsn3yM — Eli Ben-Sasson (@EliBenSasson) February 22, 2024\n\nStarknet's token launched this Tuesday with a massive airdrop to nearly 1.3 million eligible wallets, but the price fell sharply thereafter. It's currently down 55% from the peak price of $4.41 achieved on Tuesday, though it has rebounded from a low of $1.70 on Wednesday.\n\nEditor's note: This story was updated with additional details after publication."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQVGdLR3QwajVqdTAxSG5rSjhvbWh1NXh5SXVweVEwLUhSd2xkWEF5YTN3TGpsaGFGWlUyVUJpYmhkSFo4aUJpR0NKNk53R3l4NExFcVY1SmtEcEhSWnczWHJ0QmJuVUlBZ2lLUmNmSHFoWE9yRF9XM1VkMWxfbnJvRUhlUVltcFFQUzJwQUNGZmkwVEZMNVFCeFZDVUTSAaIBQVVfeXFMT0VLSjVndUV5bHl5YU9EVk4tLUhRVTB6cHY4Ny1KQ0JxeDMzV205RUwyWENZaTk4UDYtWW9QOE9NQnJjV1ZsZ2ZtZzh4NGw5SXNYbnVYMEVRb293QzhCbGp6eDVRRWkzOUZUTXhBTEdESTYtSk50aF80cUhLWkZIX1I4Z0FkNl8zZGRvOFVuUk1SRXhVM3pYNTZENHhDekVOWmtn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Tron Founder Justin Sun Buys Almost $300 Million in Ethereum in Less Than 10 Days - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBlockchain sleuth @lookonchain has reported that a wallet that may belong to the founder of the Tron blockchain Justin Sun conducted another massive purchase of Ethereum within merely 30 minutes on Feb. 21.\n\nThe aforementioned cryptocurrency tracker revealed how much Ethereum Sun bought through this wallet in less than 10 days.\n\nJustin Sun's cumulative Ethereum purchases\n\nIn a significant turn of events, the founder of one of the largest cryptocurrencies, Tron (TRX), Justin Sun, made two massive Ethereum purchases within just 30 minutes, withdrawing 12,702 ETH from the Binance exchange. This amount of the second largest cryptocurrency is evaluated at approximately $40 million in fiat.\n\nEarlier, the same “suspected Justin Sun wallet” purchased 10,136 ETH from the same crypto trading platform. Overall, within less than a consecutive 10 days, Justin Sun’s wallet has accumulated almost $300 million worth of crypto – a whopping 104,055 ETH.\n\nAdvertisement\n\nJustin Sun has not been the only large investor scooping up Ethereum recently. As reported by U.Today, an anonymous whale made a gigantic investment into this cryptocurrency by purchasing 58,134 ETH within the last three days using Binance and 1inch exchanges for their fund transfers.\n\nEthereum briefly surpasses $3,000\n\nEarlier today, the second-biggest cryptocurrency in terms of market capitalization value, Ethereum, briefly surged above the $3,000 level, as was expected by many in the cryptocurrency space.\n\nThe price increase constituted 4.24%. ETH failed to hold at that peak, though, and went back down 2.05%, landing at the $2,978 mark where it is exchanging hands at the time of this writing.\n\nEthereum largely reached that high for the first time since mid-April 2022 in light of the community expecting spot Ethereum ETFs to be approved soon. Standard Chartered banking giant announced its forecast that the Securities and Exchange Commission regulator of the U.S. market will grant approval for these exchange-traded products by May 23. Should this happen, the bank continues, Ethereum is likely to skyrocket to the colossal $4,000 price mark.\n\nThe price surge would be driven by rising demand for Ethereum coming from potential Ethereum ETF issuers – among them Grayscale and BlackRock. Both funds have already launched spot-based Bitcoin ETFs – they have been trading since Jan. 11."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNTmNxZFUtd0lzUG1GUHUwUndHODNWZGotaGpLOHNXejRkR3BLZTNsbHlRelBDakRfTWs0NFhrcUV0TDVUbGkwWkVoWl9LY2pVOUJhZndzTnhuTTdFZXRRbjl2SjVYUnB3TEx3cWU4X3JsYlAwcW9oVVFzYW9aa2M5aXE3Z9IBiAFBVV95cUxNUXRORldBU0R6azNpU3N0Mk81bkdGYzRTRjFreHRTRkdESThTckxOLXpTVVdoeXBpNWg5ck41VENybElCOUxaUHFHOTJReDNCei1qTXJobHY4Z2dud2hPbVpVNUticzlKU0R0QlRrSXRBblhFUXAtRkF0eFQ4VnMtTVdNUUs5NlNy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "$4 Billion Worth of Ethereum (ETH) Purchased at This Price Level - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to insights from IntoTheBlock, a cluster of 1.38 million addresses acquired 1.33 million ETH, amounting to a staggering $3.9 billion, at an average price of $2,984. These investors are currently in the red, facing unrealized losses due to the recent price dip.\n\nAdvertisement\n\nThe psychological impact of such a significant number of investors sitting at a loss cannot be understated. As Ethereum's price approaches their break-even point, these holders may be prompted to sell, either to recoup their initial investment or to prevent further losses, potentially leading to an increase in selling pressure.\n\nAdding to this narrative are substantial moves by Ethereum whales, which have historically been indicative of imminent price shifts. Recent activity includes the sale of 34,134 ETH, valued at $100.8 million, near the crucial $3,000 level. Notable transactions by individual whales, including addresses 0x7102 and 0x702a, involve significant amounts of ETH being moved to decentralized exchanges (DEXs) and large platforms like Binance and Kraken. These transfers could be precursors to potential sell-offs, considering the sizeable amounts involved.\n\nAdvertisement\n\nAt present, Ethereum's USD pair shows that after a remarkable rally, the price has settled near the $3,000 mark. While the aforementioned whale activities and the volume of \"at a loss\" investors could suggest a bearish outlook, the price of Ethereum remains resilient. The $2,984 level, where a bulk of purchases occurred, could serve as a soft support zone. A fall below this price might trigger a cascade of sell orders, resulting in further downward momentum.\n\nConversely, if Ethereum sustains above this level and reclaims ground above $3,000, it could alleviate the immediate selling pressure and potentially lead to a reversal, aiming for resistance levels at $3,100 and beyond. However, market participants should be wary of the large sell-offs by whales, which could dampen the bullish momentum."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPTXI2alZSUTJNWjFBTC0wdnNUVDFlLXFzellZWXBNX1hqbGtTSEh0MkRPNFo1bW5nUlZyYWdTZHVYVzYtMzUtV09VUktWZElqeGVWZk55ZE5HUkNOR1llRWN2RzdpeVVXS3FDUHNWMDdFeGRSWW9FS2sxbmZTdFliUEE1R1p4QmQ1UVd5UFFzbXFPYUdlQllZcTRjZEplLUZuY3fSAacBQVVfeXFMTXpPNE1DcUdJY2xLNk05M1hlNThXMEdVSGIwOWlRSGhvejVWRHpLYkdYdUhRNDhmTlAwWWpjcEJqOElIS1Z4YTczcFJCd1RHa251X1p6OW1IWE40bjlFalZPQ0wwb0pqMkxfR3h4Qk02M3ZzbmpTeFNndkRYaThadVRhZHJpbDlxT2NGc0cxOFlVV2lycTk0Uks2WW9TcFZzQVdta0JHX3M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Could Reach $4,000 In March On 4 Factors Including Spot ETF - CoinGape",
        "content": "The launch of Bitcoin ETFs in January turned the spotlight on Ethereum price, the second-largest cryptocurrency. Investors believe Ethereum has a high probability of receiving a spot ETF, especially with several proposals already with the Securities and Exchange Commission (SEC).\n\nDespite the growing optimism, ETH clawed back some of the gains it accrued earlier this week, falling from slightly above $3,000 to $2,900. The pullback came upon increased volatility in the market, with Bitcoin (BTC) rejecting $53,000 for a sweep at $50,500.\n\nadvertisement\n\nBesides Ethereum, other altcoins such as Solana (SOL), XRP, and Cardano (ADA) also pulled back to gather more liquidity. This could account for the modest price gains in the market on Thursday.\n\nEthereum price is one of the most uniquely placed projects, considering its standing as the second-largest crypto, the largest smart contracts platform, and its upcoming Dencun upgrade.\n\nThis article looks at these factors and more to determine the role they are likely to play in ETH’s recovery journey in the short term.\n\n1. The Dencun Upgrade Scheduled For March\n\nThe Dencun upgrade comprised of two separate upgrades “Deneb” and “Cancun,” is a major improvement for the Ethereum network that will increase its scalability and efficiency when implemented.\n\nIt will introduce proto-danksharding, a feature that will reduce the cost of transactions on layer 2 solutions like Polygon and Arbitrum, which are faster and cheaper than the main chain. The upgrade has been tested on three testnets: Goerli, Sepolia, and Holesky.\n\nWith the final launch expected in March 2024, Ethereum price is already showing signs of an incoming rally. The token surged to highs slightly above $3,000 this week, backing positive sentiment.\n\n2. The Spot ETF\n\nThe approval of the spot Bitcoin ETFs has been referred to as a major development for the cryptocurrency industry. In addition to validating Bitcoin as a global mature asset, ETFs allow traditional investors who are not interested in the complexities of crypto to get exposure to BTC.\n\nMoreover, the move opened the door to fresh speculation regarding the approval of a spot Ethereum ETF. Two years after the approval of Bitcoin futures ETF, Ethereum got its futures ETF. Experts say that the wait could be much short-term for the spot ETF.\n\nLike Bitcoin the hype surrounding the ETF could be a major catalyst for Ethereum price in the coming months.\n\nRecommended: Ethereum Price Rally Gains Momentum for $4000, Here Why?\n\n3. Staking\n\nValidators in the Ethereum ecosystem are required to stake at least 32 ETH. This condition significantly reduces the circulating supply. Ether becoming a PoS network through the Merge in 2022 allowed investors to freely stake and withdraw liquidity.\n\nContrary to expectations, the transition to PoS made staking even more attractive to investors, who have so far locked in $46.65 billion worth of ETH in smart contracts, according to Defi Llama.\n\nUnlike 2022 and 2023 when Ethereum experienced a persistent drop in staked assets, 2024 is looking positive, implying that investors have a long-term bullish outlook.\n\nAn increase in staking translates to reduced sell-side pressure. Holders stake tokens they do not intend to sell in the near future, expecting the price will rise with time.\n\n4. Ethereum Price Dons Bullish Technical Structure\n\nDespite the correction from $3,000, Ethereum still holds above key indicators like the 20-day Exponential Moving Average (EMA). Besides, support at $2,900 stopped the decline on Wednesday, realigning ETH with the upward trajectory.\n\nThe four-hour chart shows that dips are profitable. So until support at $2,800 flips, traders may want to consider buying ETH and in the process contributing to the momentum targeting $4,000 in March or before Bitcoin halving. The Ichimoku Cloud also affirms Ethereum’s long-term bullish outlook.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPTi1uanNEWWxpendPVlFyb09pemRRcGZjYTlQclZJRUdWUTE5SlFGbGdadWdNbFFFNkdKS0NMQ04ySlREQU52Q2VtVGlNT0l1ampLT2ZPendYaEd4UUhyZGZBOER2RUdEd2pjRHNHVDBYN3VuUXhJRUZXbFkzdjRoTTNULW5KdnVyVXhLUmxXMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "A16z Invests $100M in Ethereum Restaking Protocol EigenLayer - NFT News and Insights from the Industry - NFTgators",
        "content": "Quick take:\n\nThe investment comes after EigenLayer’s $50 million fundraising last March led by Blockchain Capital.\n\nEigenLayer uses a points system for those who stake on the platform and have no plans to launch a native token.\n\nFounder Sreeram Kannan believes the platform is not affected by the SEC’s increasing scrutiny of staking platforms.\n\nEigenLayer has received a $100 million investment from Andreessen Horowitz (A16z). The Ethereum restaking protocol enables Web3 developers building on top of Ethereum to leverage the blockchain’s security for their networks.\n\nSpeaking on the Big Take podcast, which is broadcast through iHeart Radio, Apple Podcasts, Spotify and the Bloomberg Terminal, EigenLayer co-founder Sreeram Kannan explained why his company’s platform operates slightly differently from traditional staking protocols.\n\n“The idea is that when you stake on Ethereum, you are promising that you’re going to run the Ethereum network nodes correctly,” Kannan said in an interview. “With restaking, you are taking the same Ether and making additional promises that you will also validate other networks correctly.”\n\nThis announcement comes on the back of EigenLayer’s $50 million fundraising in March 2023, which was led by Blockchain Capital.\n\nAlthough most staking protocols have issued their own tokens, EigenLayer maintains it does not plan to launch a native token, and will instead continue to use its paint-based system for those who stake on the platform.\n\nMost staking platforms have come under scrutiny from the SEC chair Gary Gensler who believes the protocols are breaking SEC rules by staking tokens. However, according to Kannan, his company is “essentially offering a marketplace for those looking to restake,” and does not conduct the actual staking process, which is being scrutinised by regulators.\n\n“If Gary Gensler understood what we’re building, he would like us a lot,” he said. According to EigenLayer, “users that stake $ETH can opt-in to EigenLayer smart contracts to restake their $ETH and extend cryptoeconomic security to additional applications on the network,” through a primitive the company describes as the “rehypothetication of $ETH on the consensus layer.”\n\nTo A16z, this investment demonstrates the venture capital firm’s commitment to investing in crypto. The firm raised $4.5 billion in 2022 for crypto projects, and despite a relatively bear crypto market, it has continued to invest.\n\nA16z General Partner, Ali Yahya thinks that EigenLayer will play an important part in the advancement of the crypto industry. “It will enable all sorts of new kinds of applications to be built,” he said. “People will stake capital in order to gain rewards from new services that get spun up on top of EigenLayer.”\n\n****\n\nStay up to date:\n\nSubscribe to our newsletter using this link – we won’t spam!"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPZVlTNmRDN29JNWhpei1DRUt4ck0wajBSbVItRVd5THlJR2RLZnI2V042T2NEU0lOY0hzZnZacGVZSmhCMDd5elVvbHZsUFBpdVNCYXdCZ0h6YjRWVE1KeWl6U3NRejRUemhuZ28yZUo5TGlrdno1aHltS2w5UFkxTHcxMms3S3pPRWxoX1Q5eXRNMExmc0VkNnVnOVRXNWxFMDM2VDFQZDLSAa4BQVVfeXFMTmllVHQ2SnJ5TU1KZzF5SXlLcVdZWDBOVDM2aFIxRzdzOWJsYkkzN1c2NHg3MEg2VzhaZ0hsS3V0dG4xd0JiWXdxbWRKY09aNHVDOUo2R2ozMmFmcERFSTBNMm84RzFlYTBmWFhSbHZNVWs0YnRDLWxOYk5iMk9wMTg5ck05WF9sam9NalVlN3FVNTZ0b1RCVDM3RWJ0ZkQ2cm1iZjltUWdtSHY2YmlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Taps $3,000 As DeFi TVL Soars To $45B, Ushering In The Altseason? - CoinGape",
        "content": "Ethereum price has been on a roller coaster ride, reaching $3,000 for the first time since April 2022, before falling back to $2,900 to gather more liquidity.\n\nThe number two cryptocurrency has several catalysts behind its stellar performance, such as the Dencun upgrade and the spot ETF, which give it an edge over Bitcoin.\n\nadvertisement\n\nETH has gained 6% in value in the past week, outshining its peer, which as discussed earlier, faces liquidity at $53,000 – a level that it must clear to keep the uptrend intact.\n\nThe bellwether cryptocurrency slipped below $51,000 on Wednesday in a move that could pave the way for a stronger rebound, targeting pre-halving levels in the area between $58,000 and $60,000.\n\nHow Surge In Staking Could Trigger Ethereum Price Rally\n\nEthereum earned the deflationary status after the Merge upgrade, with which the network transitioned to a proof-of-stake consensus mechanism from a proof-of-work protocol like Bitcoin.\n\nSince the Merge, the supply of ETH has increased by 1,047,643 according to Greg Magadini, director of derivatives Amberdata. But at the same time, 1,407,200 ETH have been burned or taken out of circulation. Effectively, the net supply of ETH dropped by 359,557.\n\nBitcoin, by contrast, saw its supply grow by 1.7% in the same timeframe, showing that Ethereum is becoming a scarce asset, thanks to the mechanism that destroys a portion of the transaction fees paid to validators.\n\nMoreover, more than a quarter of Ethereum’s supply, or about 30.1 million ETH, is now locked in staking contracts, earning rewards for securing the network.\n\nCumulatively, the total value locked (TVL) in Ethereum’s decentralized ecosystem is now above $45 billion up from $20 billion at the start of the bull market in Q4 last year, Defi Llama data shows.\n\nSpikes in TVL affirm the long-term bullish sentiment in the market. Investors are willing to bet on Ethereum’s long-term bullish outlook by locking their holdings out of circulating supply, essentially reducing sell-side pressure.\n\nThis coupled with key market movers like the upcoming Ethereum Dencun upgrade and the hype building around a potential spot ETF points to a parabolic rally in the months ahead.\n\nEthereum could also ride on the momentum from the Bitcoin halving anticipated in April. Historical price action backs halving as a potential bull run trigger not only for BTC but also for altcoins.\n\nEthereum Price Technical Outlook: Bullish Or Bearish?\n\nSeveral key levels are emerging as Ethereum climbs above $3,000. Although the brief climb above $3,000 was a welcome bullish gesture, failure to close above it allowed traders to take liquidity, which may explain the correction to $2,900 on Wednesday.\n\nWith the price currently pivotal at $2,900, the next vital area is the green band around $2,800. Several four-hour candles close under $2,900 could validate additional dips to this support level, allowing Ether to collect liquidity as investors buy the dip. The 50-day Exponential Moving Average (EMA) backs the demand zone.\n\nThe technical structure remains bullish unless the 50-day EMA flips becoming an immediate resistance. Until then, traders may take advantage of dips to gain more exposure to Ethereum price ahead of its next breakout attempt above $3,000.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQMXJwbXAyMXhhV0JJUVBHbjNESzNKVG05dzg1RU9fMjRHS0tSektkUGJBcVJUcFY2TnI4WklWS3hRaDREeENDZldEeFpxYmQzZXM1MHkydnVYREY5ZWlUVVpsX2VDNGFZUXZaTmJQR3ZSTTBiZ0tGRTZCQnlqcTNRZ19qUUNkWTFsUlpxc1FZLXFYcEcxODFIMWUxU0dzUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "A retail revival is afoot in crypto. JPMorgan names three factors driving it - DLNews",
        "content": "JPMorgan analysts outlined three key catalysts driving retail investors back to crypto.\n\nBitcoin’s next halving and Ethereum’s Dencun upgrade are “largely priced in.”\n\nWhile approval of a spot Ether ETF is 50/50, the bank said this has attracted interest.\n\nThe retail push into crypto was likely responsible for February’s rally, JPMorgan said.\n\nRetail investors are flocking back to crypto in anticipation of three key catalysts in the coming months, according to JPMorgan analysts.\n\nCatalysts\n\nRetail interest rebounded in February after slowing in January, and it was “likely responsible for this month’s strong crypto market rally,” analysts at JPMorgan said in a note on Thursday.\n\nJPMorgan analysts, led by Nikolaos Panigirtzoglou, showed a chart depicting total flows onchain for smaller versus larger wallets.\n\nA smaller wallet is a proxy for a retail investor, they said.\n\nThey then adjusted for inflows into the newly launched spot Bitcoin ETFs, explaining: “Retail investors’ Bitcoin holdings that have shifted to the new spot Bitcoin ETFs are technically held in larger institutional wallets, even if the end-investor is retail.”\n\n“After a pause in January, the crypto rally gathered pace in February,” they wrote.\n\nThe Bitcoin halving in April, Ethereum’s next major upgrade, and the prospect of spot Ether exchange-traded funds have lured investors back to crypto, the investment bank said.\n\nThe first two catalysts, the halving and Ethereum’s Dencun upgrade, are “largely priced in,” the analysts said.\n\nJoin the community to get our latest stories and updates\n\nJPMorgan analysts “only see a 50% chance,” of spot Ether ETFs gaining approval in May, meaning this catalyst isn’t fully priced in.\n\nThe halving\n\nBitcoin’s so-called halving, which occurs automatically once every four years, is expected in April. It marks a supply change, halving the amount of new Bitcoin created each day.\n\nWith less supply and growing demand for Bitcoin due to new investment vehicles, such as spot Bitcoin ETFs, analysts expect the halving to push prices higher.\n\nThe Dencun upgrade\n\nEthereum’s upgrade, dubbed Dencun, is scheduled March 13, and aims to enhance scalability and reduce transaction fees on layer 2 platforms.\n\nDencun is considered Ethereum’s most significant change since April 2023, when the so-called Shapella upgrade allowed stakers to withdraw staked Ether on the network.\n\nSpot Ethereum ETF approval\n\nThe potential US approval of spot Ethereum ETFs is the final catalyst JPMorgan cites.\n\nAfter more than $10 billion poured into Bitcoin ETFs following their approval last month, Ethereum is also positioned to attract investors.\n\nBlackRock is among fund giants hoping to win a green light for a spot Ethereum ETF, following its hugely popular entry into a Bitcoin version.\n\nSome say Ethereum may even outperform Bitcoin if the ETFs win a regulatory nod, given that it’s more levered to economic activity in the crypto ecosystem.\n\nCrypto market movers\n\nBitcoin fell 0.6% to $51,200 on Friday. The leading cryptocurrency is down 2% over the past seven days.\n\nEthereum traded just below $3,000, down 1.1% since Thursday.\n\nWhat we’re reading"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPQlNiTHhVbE54c1lxWTg0bDZLUXZfMW9pcWl4VHVwOXc2WEZzQlpPSHh0TE05ekVLdjV4NWdjblR4d1Iyd3BvRzgtMHNIMnFaMHRxdmhDR3g2WHBKZXZyUVdHVi1qSXJjTXJUN3FxbnNDeXpLZEhzRktBdmNqcDZacEVnOEloQWdpc2ZFZkprYWZYcVVLa0t0VkUwZHB3N1pGeDM4WtIBqgFBVV95cUxOUjFyVkxQSlBtUE42SGx6cVlGZktsVHpXdnBiM1BnVktmcnhsVDFMcGVSeVBjSlJRbWNPZ1VneXVMY3FyNjRlUFl5elNKTFlsSnBJOGZmUU5iTDNCY1pLQi13eHRpRWVCU3dDMFhJdU5iNFE5WWxxNnJDeFYycmk3VUxNbHFqcVYzWV9OT2Zscm8zTXZSUXA3bVlzeURsWXV6djZnMHF6SFRVQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Reddit Discloses Bitcoin and Ether Holdings in IPO Filing - CoinDesk",
        "content": "“We are going public to advance our mission and become a stronger company,” co-founder Steve Huffman said in the filing. “Our users have a deep sense of ownership over the communities they create on Reddit. This sense of ownership often extends to all of Reddit. … We want this sense of ownership to be reflected in real ownership—for our users to be our owners. Becoming a public company makes this possible.”"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxQc0V5QnRnVjJwVU1uVTl1Rk9od2xTMHdwSHcwdHZqQlpLNkozVkhTNTJUeGc1U19ibVpEQjZMaE9wdHFTM2Nybi0zYUwteXZpOFRVSkU3SlRRSGV1STdvdG5SalYxTWxva2pyRS1zWmJRRlFvOWdtc283ZW9jN1JPVjN4WVVNWW5SWEpnbUJBbGRSaDFtQmZiOWhIWDZIdW9feTRfbW55ZDB4OGRCS2dtOWhUU0pHbENRbXdSdkMwZ2VROFJEOW15cnBUd3NKX0hsWFRiM2tzQkUzQlRRcGlaRnVDa9IB6AFBVV95cUxOMl9SeldvTkFGeEJnYWh5UGpqd1pMc2dmZFZoN3JsNVduOFdFN0NDWXctOUhNZ0JkbUdoQl9sUUpTV1c5R0hvOE1YT09LYnJhNENBdG1sM00yU1o4cERXcXRxbEhNRmpaVGZrT0UxN0dmVXItZXlrTm5kYlc2WlFFVm1qak80cmZxcTk2UThvUGlMdklqY2s3cWYwT3F2UzdTaFBydHlUWk15Q2YtaHJHMDhmblhaQ2dDQVhweGFKYkFvQTVkb1N2TWgzdWJrcXFUT0ExNTNJVHFaR1NRUDJvWXRHS2NkS1Rn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Possible start of a trend reversal for BTC - FXStreet",
        "content": "Bitcoin (BTC) price is leading markets into weekend mode where trading volumes are low and, therefore, the price becomes susceptible to volatility. With altcoins awaiting the BTC cue, Ethereum (ETH) and Ripple (XRP) prices appear to have taken a hint.\n\nAlso Read: Bitcoin Weekly Forecast: BTC likely to correct to $50,000 soon\n\nBitcoin, altcoins, stablecoins FAQs What is Bitcoin? Bitcoin is the largest cryptocurrency by market capitalization, a virtual currency designed to serve as money. This form of payment cannot be controlled by any one person, group, or entity, which eliminates the need for third-party participation during financial transactions. What are altcoins? Altcoins are any cryptocurrency apart from Bitcoin, but some also regard Ethereum as a non-altcoin because it is from these two cryptocurrencies that forking happens. If this is true, then Litecoin is the first altcoin, forked from the Bitcoin protocol and, therefore, an “improved” version of it. What are stablecoins? Stablecoins are cryptocurrencies designed to have a stable price, with their value backed by a reserve of the asset it represents. To achieve this, the value of any one stablecoin is pegged to a commodity or financial instrument, such as the US Dollar (USD), with its supply regulated by an algorithm or demand. The main goal of stablecoins is to provide an on/off-ramp for investors willing to trade and invest in cryptocurrencies. Stablecoins also allow investors to store value since cryptocurrencies, in general, are subject to volatility. What is Bitcoin Dominance? Bitcoin dominance is the ratio of Bitcoin's market capitalization to the total market capitalization of all cryptocurrencies combined. It provides a clear picture of Bitcoin’s interest among investors. A high BTC dominance typically happens before and during a bull run, in which investors resort to investing in relatively stable and high market capitalization cryptocurrency like Bitcoin. A drop in BTC dominance usually means that investors are moving their capital and/or profits to altcoins in a quest for higher returns, which usually triggers an explosion of altcoin rallies.\n\nBitcoin may have just chosen a directional bias\n\nBitcoin (BTC) price has recorded a steady series of lower highs and lower lows over the past four days, suggesting a clear directional bias. However, this is subject for confirmation considering that the $50,638 support level continues to hold. A break and close below it would confirm the continuation of the downtrend, likely sending BTC to $50,000.\n\nThe Relative Strength Index (RSI) has already executed a selling signal by crossing below the signal line (yellow band). This is reinforced by the histogram bars of the Awesome Oscillator (AO), which are steadily edging toward the midline.\n\nIn addition, based on the Mean Reversion Channel (MRC) indicator principle that holds that price tends to return to its average over time, the market is leaning to the downside.\n\nBTC/USDT 1-day chart\n\nOn the flip side, if buyer momentum increases, Bitcoin price could push north, escaping the market range above $52,829. In a highly bullish case, BTC could shatter the range high at $52,985 before confronting the $53,000 psychological level. A decisive candlestick close above this level would clear the path for an extended move north.\n\nAlso Read: Bitcoin price eyes $48,000 as European Central Bank tears down at BTC after spot ETF approval\n\nEthereum price repels $3,000\n\nAfter a rejection from the $3,000 psychological level, Ethereum price is trading within the ascending parallel channel. However, it risks an extended fall following the execution of a selling signal on the RSI. With the weekend setting in, low trading volumes and the resultant volatility could see ETH retest the $2,874 support. In a dire case, the slump could send the Proof-of-Stake (PoS) token to the $2,770 support confluence between the horizontal line and the midline of the channel.\n\nETH/USDT 1-day chart\n\nHowever, with the bulls still maintaining a presence in the BTC market, seen with the large volumes of green histogram bars of the AO, Ethereum price could overcome the $3,000 milestone, or in a highly bullish case, clear the range high of $3,036 to tag the $3,200 milestone.\n\nAlso Read: Ethereum price risks decline as increasing exchange supply raises chances of profit taking\n\nRipple price eyes $0.5000\n\nRipple (XRP) price has recorded a series of lower highs and lower lows over the past four days after a rejection from the upper boundary of the descending parallel channel. After crossing below the signal line, the RSI is below 50, showing the market is leaning to the downside. The red histogram bars of the AO accentuate this and add credence to the bearish thesis. In a dire case, Ripple price could roll over to the $0.4734 support floor.\n\nXRP/USDT 1-day chart\n\nOn the other hand, enhanced buyer momentum could send Ripple price above resistance stemming from the upper boundary of the channel, with a decisive candlestick close above it setting the pace for an extension to $0.6000. Such a move would constitute a 12% climb above current levels.\n\nAlso Read: XRP price plunges as Kraken cites SEC v. Ripple lawsuit in its legal battle against the regulator"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE1hUThIY2o2VkVQRDdvRWpkSkJkRERMRXVMMmdrdjNHNHNtckQ4dmV6ZEU1Ri00NzBUd1hYMzcxU29UbDZKZDFKYVpod2tjTnVWRVJrajJzTUlHaE95T3FWenpmQ0gwVjJFUGFzetIBdEFVX3lxTE5tSWJaMFdpR2pKUWxNZ2ViaUY3empaY1VHNmVCZ095MXcybmhlNFlOTHBhSEFmLXExVlA0R2M2VExQUTMwZUlPUUNGQkNFMlZaQklid3hQeUV1RUszMC0wdEV0S0pGc05kTDkza2pFZG9Renk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ronin Adds 'Kaidro' Role-Playing Game Following 'Pixels' Ethereum Token Launch - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSky Mavis, creator of the Ronin blockchain and its Axie Infinity game, announced the next game that is coming to the Ethereum gaming sidechain: Kaidro, an anime-style role-playing game based on the webcomic of the same name by Gadget-Bot Productions.\n\nOriginally planned to launch on Immutable X, another gaming-centric Ethereum scaling network, the Kaidro game will instead release exclusively on Ronin.\n\nKaidro is set in a post-apocalyptic world where players battle enemies using mechs and magic. Teams of three players will compete in player-versus-player and player-versus-environment gameplay across various maps and objectives.\n\nIn addition to the game, Gadget-Bot is collaborating with writer Tim Hedrick, known for his work on “Avatar: The Last Airbender” and “Voltron: Legendary Defender,” on an animated Kaidro TV series. The studio also partnered with the musical duo Odesza to create the new Kaidro game trailer.\n\nAD\n\nAD\n\nWelcome to the family, @kaidrochronicle and @gadget_bot! Tal’jor is coming to Ronin ⚔️ • Multiplayer action RPG coming to Ronin\n\n• Story-driven based on hit Kaidro IP\n\n• PvP, PvE, Web3 integrations and more Full announcement and a leak 👇pic.twitter.com/F1YO7LZLcf — Ronin (@Ronin_Network) February 22, 2024\n\nGadget-Bot was co-founded by Peggy Chung and Robert Simons, who have substantial film and video game credits between them including “Jurassic World” and Call of Duty. Last year, they told Decrypt’s GG why they wanted to turn the “Kaidro” webcomic into a crypto game.\n\n“When we were growing this fanbase, we were creating this huge world. When we saw Web3, we saw it as this way of giving ownership to that fanbase and letting them be a part of it,” Simons said in April 2023. “We saw things like NFTs… as a way for people to actually own a portion of the 'Kaidro' world and forever own it.”\n\nWednesday’s announcement comes during the same week that Pixels, currently the most popular game on Ronin, launched its long-awaited PIXEL token following play-to-airdrop campaigns. The token generated more than a billion dollars worth of trading volume in less than a day on Monday, entering the top 10 among all cryptocurrencies by that metric.\n\nAD\n\nAD\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Andrew Hayward."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOOFNUTzREak91MnFMV0RnVWoxdVZYSE9CZkhLVzU3Rk9STFYwUmdCZDlDV2kzUnc5cHpjQmlyZGJuR2lMVWpsWGJndXhaTFMyZkR6OXZMVV9YamJjT29NTzBSNW9TTGRidGZScHhaTzdxX0FtbW81NHRDWkhMME5iM0lEMWxBQ2ZGT05BYjE3YUhRMV9Dd0lOTNIBngFBVV95cUxPWDh0QUtJTHFIeUxnc1FlbVZMakJKOTNBZGRTcUk2ajFIRkV4RXhrYkRUd3ZQYWZhZGlwblBzVENNYjItcEp1WEVMWFFYVHlxZThMeXVTdWZwMHRDSEN2VGRwY1hIeXh1SGs4UUNfQ1QxcjBUSlZhaWpzd2ZDVHNvcWlOVWt0LWNZUVVSTmpDWEozV3R0bFMzNWZtLVVwZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Dencun Upgrade: Which Layer-2 Platforms Will Benefit the Most? - CoinGape",
        "content": "As investors keep a close watch on the potential approval of spot Ethereum ETFs, attention is currently directed towards the imminent Ethereum Dencun upgrade. Scheduled for March 13, this upcoming enhancement is anticipated to wield significant influence, potentially bolstering various players within the Ethereum ecosystem.\n\nExploring the potential ripple effects, let’s delve into how the Ethereum Dencun upgrade stands to benefit other Layer-2 platforms within the Ethereum ecosystem.\n\nadvertisement\n\nThe Ethereum Dencum Upgrade\n\nGet ready for the ‘Dencun’ upgrade, set to roll out on March 13, marking a significant hard fork update aimed at boosting the Ethereum network’s scalability, security, and user-friendliness. As part of Ethereum’s roadmap initiative, dubbed ‘The Surge,’ this upgrade is a pivotal step forward in scalability enhancements.\n\nHere’s what you can expect from the Dencun upgrade:\n\nEIP-4844: Boost scalability.\n\nEIP-1153: Cutting down on-chain data storage expenses.\n\nEIP-4788: Elevating security and functionality.\n\nEIP-5656: Fine-tuning EVM performance\n\nEIP-6780: Improving network security.\n\nThe standout feature in Dencun is the implementation of Proto-Danksharding. With EIP-4844 (Proto-Danksharding), a new transaction type called ‘blob-carrying transactions’ is introduced, reducing transaction costs for both L2 users and ramping up Ethereum’s transaction throughput.\n\nPopular crypto analyst Miles Deutscher explains that the Ethereum Dencun upgrade will reduce transaction fees on Layer-2 platforms by a considerable magnitude. The analyst also emphasizes the increased commercial viability for dApp developers and users. This shift will position L2s as more appealing options compared to alternative L1s, offering a positive catalyst across various sectors such as DeFi applications, gaming platforms, and on-chain trading.\n\nLayer-2 Platforms That Benefit From Dencun Upgrade\n\nAlthough several Layer-2 platforms will benefit from the Ethereum Dencun upgrade, Miles Deutscher shares his coveted list of those platforms that he thinks will benefit the most.\n\nPolygon (MATIC): Deutscher noted that $MATIC currently finds itself in a compelling position. It’s on the verge of rebranding to POL. Despite lagging behind other L2s, there’s been notable investment in implementing zk technology. Considering these factors, Deutscher believes $MATIC could emerge as a strong performer in the weeks or months ahead. Arbitrum: Arbitrum’s metrics remain impressive, solidifying its position as a preferred chain for launching new dApps. Maintaining its status as the top L2 in terms of Total Value Locked (TVL), Arbitrum also boasts transaction volume that outpaces other L2 solutions. Optimism: Optimism ranks as the second-largest L2 by Total Value Locked (TVL), closely following Arbitrum, and it has demonstrated robustness in transaction processing. Recently, the platform unveiled its fourth airdrop, which is expected to reignite interest and activity within the ecosystem. COTI Network: COTI has unveiled V2, an Ethereum Layer 2 (L2) solution focused on privacy, featuring the introduction of ‘Garbled Circuits.’ This innovative technology offers an efficient method for maintaining privacy, marking the blockchain’s maiden implementation of such a feature. Mantle: Mantle is currently among the rapidly expanding Layer 2 solutions. With over $1.5 billion worth of ETH staked as mETH (Mantle Staked ETH), it ranks as the third-largest LSD (Layer 2 Staked Deposit) after Lido and RocketPool. Moreover, mETH stakers can anticipate some promising airdrops in the near future. Metis: Metis is experiencing a wave of favorable developments that are propelling its growth forward. Notable among these is the establishment of the 4.6 million $METIS Ecosystem Fund, signaling a significant injection of $400 million into the ecosystem. Additionally, the upcoming launch of the decentralized sequencer alpha mainnet in March promises to further enhance the platform’s capabilities and usability. Moreover, the implementation of the LSB (Liquid Staking Blitz) campaign is poised to bolster participation and engagement within the Metis community.\n\nMiles Duestscher stated that he’s keeping a close watch on other Layer-2 Networks such as Manta Network, Starknet, zkSync, and Linea.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE9xR1o0Nm53NF9TQXJ4M1RsVVpYUU9Tdm03bjRqcklwM3djNERUaGJyS3VyaFFsVXR0cGpYaFJVWjI3UFNrOXBySktWcDdYN01IUzhsN0dTZ2tkcnRUSlI2S3BGU2tIY0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Reddit buys Bitcoin, Ethereum, and MATIC, reveals new IPO filing with the SEC - Crypto Briefing",
        "content": "Reddit's approach to crypto reflects a broader trend among tech companies exploring the potential of crypto.\n\nShare this article\n\nReddit has officially submitted its S-1 with the Securities and Exchange Commission, marking a significant step towards its initial public offering. The social media giant disclosed in the filing that it has invested in crypto assets, including Bitcoin and Ether, and has also acquired Polygon’s MATIC.\n\n“We invested some of our excess cash reserves in Bitcoin and Ether and also acquired Ether and Matic as a form of payment for sales of certain virtual goods, which we may continue to do in the future,” the filing stated.\n\nThe company clarified that its crypto holdings did not add up to much money during the periods covered in the IPO paperwork.\n\n“The net carrying value of our cryptocurrencies, which consisted primarily of Bitcoin and Ether, as well as all related cryptocurrency activity, was immaterial for the periods presented,” Reddit wrote in its S-1.\n\nThese investments are part of Reddit’s strategy to integrate blockchain technology into its operations and offer new forms of payment for virtual goods.\n\nDespite these challenges, Reddit’s board of directors has approved investments in Bitcoin, Ether, and potentially other cryptocurrencies that are not deemed securities by regulatory authorities.\n\nAs of the end of 2023, Reddit’s Treasury investments in crypto were confined to Bitcoin and Ether. The company’s use of crypto extends beyond Treasury purposes, as its product and engineering teams also utilize these digital assets for specific applications.\n\nLooking forward, Reddit is set to list on the New York Stock Exchange under the ticker symbol “RDDT.”"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPa1lRT3pwVzBlNmtjdlAxN2lTazdvQVl0bF9obVRyMTMtMWNFRWVMc3dqYjBUZXRucG44ZHNEUWVSRmdTWUY1SVpnLUxRb2dVQlNWWDNuVnVpZzNiYmZiUndnOUZZRUxaQmhsNEV1T0R2dFJBZGcxVm1PUmxyaHZPbkp4MVV0Q0xVWTdabXdHX3BXOVlaTWlfUGVEN25hUEktcE9v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Superfluid Secures $5.1M to Fuel Ethereum-Based Token Streaming - Crypto Times",
        "content": "Superfluid secures $5.1 million in funding, spearheaded by Fabric Ventures, to innovate real-time crypto transactions on the Ethereum platform. Drawing support from prominent investors, the recent funding round for Superfluid underscores the market’s robust confidence in its innovative vision.\n\nWith the launch of “distribution pools,” the platform heralds a new era in efficient one-to-many crypto streaming. Moreover, Superfluid’s approach to scaling, with its “super tokens,” promises a seamless transaction experience. This innovation allows for predictable gas costs, even as the number of recipients scales up.\n\nStrategic Growth and Community Governance\n\nWith a focus on the Ethereum ecosystem, Superfluid is poised for strategic expansion. The team, primarily engineers, plans to boost its marketing efforts with fresh capital. Additionally, the possibility of a native token launch remains open, reflecting the protocol’s community-first approach.\n\nSuperfluid’s strategic funding and innovative offerings are setting new standards in the crypto transaction space, backed by a strong ethos of community governance and scalable solutions."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOZWRpNmFaRC1qRHNKbUY2c25TdGk0QmExQ2Y4UUtIdzdvNlNWb1VQTHNOVXhsbnkzQy1LVGtXLWR1NnFaRE1rOGVQZTEySHhONk9sYVlDTktuS1NvMGJKMzlKbjQ2eUt5dkFyVjBrWjZaeWFheWwzazg0S1FlWTVjRlpEQ0phMktaMlVIeEJFaGMwaXY5MjBPVEJzZmJuSXI0a0l1ekdEWmRJV2JqNDZ5MElUMUFxZ9IBuwFBVV95cUxQY3ppN3BjaVhfMGhYT1RjbVdIUzY0LWt4aXBRY052WE5fRGFIb1lzZkFkZFJNYUNGSnhDOG80bGk2dkh0blJSREV6WmZQMEZwT3BmRVNTNXY0R1pmR2llUlpCWDU3N19ZY3N0SWp0UE5XX1dPczl2S3FhZ3pOd2h6ZzMyUDRPdk9vS19tMHo0REFHTnc3RXl4MWJLdkRJNzYwWUNLa1o4WXYzcFpwWEFieXkwMnNTMmRIZmow?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Dogecoin (DOGE) 'Hidden Golden Cross' Might Surprise You, Ethereum (ETH) Breaks $3,000 Barrier, How Long Will Solana (SOL) Stay Bearish? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nDogecoin is showing a gleam of technical optimism. The recent crossing of the 100-day and 50-day EMAs is a small version of the much celebrated 50-200 EMA golden cross, often regarded as one of the most bullish signals in technical analysis.\n\nThis mini golden cross, while not as definitive as the classic version, still gives traders a reason to pay attention. Historically, such crosses have been precursors to potential uptrends. For Dogecoin, the price has been oscillating around this crossover region, suggesting a tug-of-war between bears and bulls.\n\nDOGE/USDT Chart by TradingView\n\nDogecoin's current support level can be spotted around the $0.077 mark, which aligns with the 100-day EMA. Should this level hold, it could act as a springboard, reinforcing the bullish sentiment brought about by the EMA crossover. On the flip side, if this support falters, we might see a dip toward the $0.070 threshold, where previous market activities have shown interest.\n\nIf Dogecoin can capitalize on this mini golden cross, the next target would be to test the resistance at $0.088. A break above this level with sustained volume could set the stage for a continued upward trajectory, with the $0.10 psychological barrier as the next significant milestone.\n\nAdvertisement\n\nEthereum finally scores\n\nEthereum has achieved a significant milestone by breaking through the $3,000 price barrier, a bullish signal that many investors have anticipated for the last few months.\n\nThe ascent to $3,000 marks a key psychological and technical level for Ethereum. This breakthrough is supported by a robust volume profile, suggesting that the move is backed by substantial market interest.\n\nLocal support levels now adjust to this new paradigm, with previous resistance around $2,800 potentially becoming a new support zone. Should ETH maintain its position above this level, it would confirm the strength of the current trend and possibly establish a foundation for further gains.\n\nLooking at the potential for a rally continuation from the current levels, the momentum appears strong. Investors and traders will now be eyeing the next resistance levels, which could be around the $3,200 to $3,300 range, where ETH may face a test. A consolidation above $3,000 could provide the springboard needed to challenge these higher thresholds.\n\nIn a bullish scenario, if Ethereum manages to sustain its current levels and market sentiment remains positive, there is a possibility of continued growth, potentially targeting the all-time highs seen previously. The RSI and volume will be key indicators to watch for sustaining buying pressure.\n\nSolana still losing\n\nSolana is currently exhibiting bearish tendencies. A close look at SOL's price trajectory reveals it is navigating through a potentially critical phase.\n\nAs of now, SOL is manifesting a downtrend within a bearish channel pattern. The price has recently faced resistance at the upper trend line of this channel, suggesting a possible continuation of bearish momentum. Key support levels to watch include the psychological round number at $100, followed by a more established support at around $90 which, if broken, could lead to a further slide.\n\nIf SOL fails to hold the $100 level, we could witness a steeper decline, with the next substantial support level at $90. A break below this could potentially open a path toward the $80 mark, especially if broader market sentiment remains negative.\n\nA bullish reversal could occur if SOL finds solid footing at the current support levels. For a shift in trend, SOL would need to break out of the descending channel, pushing past the immediate resistance near $110. This could indicate short-term bearish exhaustion and potentially signal the start of a recovery phase, targeting subsequent resistance levels at $120 and above."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQUW9kaXdUMFE2UEM3RzRkemVYZ3hwM3E2SFJzUGpEZzRWRmluMFg4VGFXSFotVkgwaWFtZXJ1SUdieVlubUFGYUhIWVYxVTlFRnZkcDlOWXFNVU5sdXhhLVoxTVhyVHVGN3ZXNXBrR2tWYlUzdVZHblRveTlMTm9ZN2lIREZESjZXV01uMXFtaWxYWkhjVXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Hackers steal nearly $10 million from Axie Infinity co-founder’s personal accounts - The Record from Recorded Future News",
        "content": "One of the co-founders of the video game Axie Infinity and the related Ronin Network had nearly $10 million in cryptocurrency stolen from personal accounts.\n\nReports said wallets belonging to Jeff “Jihoz” Zirlin were hacked to the tune of 3,248 ethereum coins, or about $9.7 million. Zirlin confirmed on social media late Thursday that two of his accounts were compromised.\n\n“The attack is limited to my personal accounts, and has nothing to do with validation or operations of the Ronin chain” or Axie Infinity operator Sky Mavis, Zirlin said. Another Ronin Network co-founder, Aleksander Larsen, echoed those comments.\n\nIt’s unclear how the intruders got access to Zirlin’s wallets.\n\nThe Ronin Network underpins Axie Infinity, which has a play-to-earn economy based on ethereum. It’s particularly popular in Southeast Asia. Hackers stole $600 million in cryptocurrency from the system in March 2022 — an attack that U.S. prosecutors subsequently attributed to Lazarus Group, a North Korean state-backed cybercrime operation.\n\nOn Friday, analysts traced the funds stolen from Zirlin’s accounts to activity on Tornado Cash, a mixer designed to hide the source of cryptocurrency. Lazarus used the mixer to launder funds from the 2022 hack, according to the U.S. government, which separately sanctioned Tornado Cash.\n\nBlockchain investigator PeckShield told the publication Cointelegraph that the theft was indeed a “wallet compromise.”\n\n“I want to assure everyone that we have strict security measures in place for all chain related activities” for Ronin, Zirlin said."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQajBrRGhpeU5wVVFlMDg1VUtkYzRhbzh4VFhKME1xRVJiQy1SRTZZalhKOXZiME5EWHRuWWtQVVltOVZzdmQ5RjBjcGRGNG1MaDJpSUZUMlhfZlV0MHdEUG1EeGJMbzkxbnN2cEQ2ZG1TUEtUakY3Mm5BajAtd0thUU9FUThiMUtQSF9FUmVPUTRuQTVLemNBc2I0YURNVUJySkI1dnJhM2Jlc05XZ0xDUUVPWTJjdUxGZ3fSAb8BQVVfeXFMUDlDNWFaLUd2WFN2TWtZTFozcF9mdHV3TW9OaUFVTk9vQlFNS3RaX1FCUXNzR0UyQWpRdFpQTGNvWFhNb2VFSmZ6X2FMeVVmdTdmMmh1MVJLV29VdEpia2hTa3BRTUJFUW9OV1BTTEh6WGJVSWFvd0VValNsNXpTdW9Gd2UtYWZaTXMwN2dGY3lCT0xSSU5oNk9jUG9Hc2tackdPMEluZHpkcDJXcjIxWFJDOXlkcXNWclRpeHFwV2M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "ETH/BTC Chart Analysis: Is Ethereum’s Rally Against Bitcoin Ushering In the Altcoin Season? - CoinGape",
        "content": "The first quarter of 2024 is proving to be an exciting era for crypto investors. While attention was majorly on Bitcoin in Q4 last year and in early January, interest has been gradually shifting to Ethereum and the altcoin market in general. The ETH/BTC chart analysis takes into account the changing dynamics, that could result in an unparalleled altcoin season.\n\nETH/BTC Chart Analysis: Ethereum Fires Up As Bitcoin Stalls\n\nThe ETH/BTC trading pair with a value of $0.0574 holds above an important support area highlighted by the 0.382 Fibonacci ratio around $0.0573. Slightly below the same demand zone is the 200-day Exponential Moving Average (EMA) (the blue line on the chart).\n\nadvertisement\n\nWith the Relative Strength Index (RSI) neutral but sliding toward the midline and the oversold region, ETH/USD could push harder on the above support area. Holding firmly above the 0.382 Fibo would make Ethereum stronger, insinuating a larger breakout in ETH price. Ethereum will weaken against Bitcoin if the same support caves.\n\nThe technical structure on the daily chart is no different, with the ETH/USD pair expected to bounce off the 0.382 Fibonacci support level. A stronger Bitcoin in January butchered the demand area, causing a flash drop to $0.051, underscoring the importance of controlling sell-side pressure.\n\nThe upcoming Dencun upgrade is likely the secret weapon Ethereum bulls have against Bitcoin. This upgrade has many benefits for Ethereum as a network and its underlying layer 2 scaling solutions such as Arbitrum and Polygon.\n\nAssessing ETH/USD Weekly Technical Structure\n\nSeveral key levels would determine where the ETH/BTC pair heads in the coming days or weeks. For starters, support highlighted by the green band on the weekly chart has been tested more than once — in May, in Dec/Jan, and in February.\n\nThat said, there is a high chance ETH/USD will rebound from the green-colored support area for another targeted attempt at the trend line resistance from September last year. Ethereum will emerge extremely bullish if this resistance is broken, paving the way for widespread rallies in the altcoin market.\n\nA potential spot Ethereum ETF is another key factor to keep in mind while trading the ETH/BTC pair, especially long-term. Experts anticipate the same bullish outlook for Ethereum if the SEC greenlights the products that allow traditional investors to seek exposure to ETH on the stock market without having to worry about the complexities of crypto including exchanges and storage.\n\nHowever, the Bitcoin halving due in April may turn the tables around, bolstering BTC price rally toward the end of the year and subsequently in 2025.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPZ1ZUWUFUZGI3SjFPZmdUeXhJU2lkS3lLSmVERW9VYkhYUVFqczV0dnFOYktaS1IwQ1RreVBES1Nta2JkSXFaemtEWEpfQ01sYnlIcU5RMmRKam9HSmJwcV8yVHpMTmR5aktlY2NVWHctY09qcVhSUjJYNGJUdHBUOFFOYnNBY0RWQ3dnTTFJY3p5VTNRRVZnRlpxSVc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Crypto: Shiba Inu Unleashes Ethereum Power for New NFT collection - Cointribune EN",
        "content": "Thu 22 Feb 2024 ▪ 4 min read ▪ by Luc Jose A.\n\nThe crypto project team for Shiba Inu (SHIB) recently announced the launch of its latest non-fungible token (NFT) collection, entitled “SHEboshis”. This initiative marks a significant milestone for the project, as it introduces the use of the ERC-404 standard, a first in the Ethereum ecosystem. The Ethereum ERC-404 standard promises to bring enhanced fluidity and to facilitate the fractionalization of NFTs, thus opening new prospects for holders and investors. In this article, we will explore the implications of this advancement.\n\nNew Horizons with Ethereum ERC-404\n\nThe SHEboshis venture represents a bold dive into the uncharted territories of the ERC-404 standard. Kaal Dhairya, a crypto developer at Shiba Inu, shared in a blog post the team’s excitement about exploring the yet untapped potential of this standard. The Ethereum ERC-404, which combines the features of the ERC-721 standard (dedicated to NFTs) and ERC-20 (for fungible tokens), is a standard that aims to make NFTs more liquid and to encourage their fractionable nature. It is seen as a potential game-changer in the Ethereum ecosystem and the crypto market at large.\n\nThe decision to mint the SHEboshis on the Ethereum network was driven by the desire to leverage the significant liquidity of the latter, thereby giving the SHEboshis the launch they deserve. In the long run, the team plans to bridge these NFTs to Shibarium.\n\nHowever, the launch was not without its challenges. A bug temporarily allowed for additional minting, which resulted in an excess allocation of NFTs to certain addresses. Dhairya apologized for the inconvenience caused and announced the increase of the total number of SHEboshis from 12,000 to 20,000 to compensate for this incident.\n\nThe Allocation of Unexpected Sales Revenue\n\nThis technical incident which allowed for an additional issue of SHEboshis resulted in unexpected sales, generating revenue of 652 Ethereums for the Shiba Inu team. In a gesture of transparency and commitment to the crypto community, the team detailed how these funds would be used.\n\nHalf of these proceeds will be allocated to strategic initiatives, including token supply reduction through “burn” operations (token destruction), donations to charities, as well as to the team itself and the provision of liquidity for the NFT project. Charitable donations will be directed towards specific causes, such as support for relief efforts in Japan following the Noto earthquake, as well as to non-profit organizations such as the Manny Pacquiao Foundation and Women in Blockchain. The remaining portion of the revenue will be dedicated to operational expenses and the team’s treasury, with the goal of continuing their mission towards a decentralized future, as described in the project’s crypto whitepaper.\n\nIn conclusion, Shiba Inu’s initiative to introduce SHEboshis NFTs through the ERC-404 standard on Ethereum marks a significant turning point in the crypto ecosystem. By combining technological innovation and community commitment, Shiba Inu not only pushes the boundaries of what NFTs can be but also paves the way for new possibilities in liquidity and “fractionalization” of digital assets.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQZlV0M1hGRUFibU1hN290cHVjRFJ0WXI1eEVXeGMtbU9ZUWowV0pFYXZMRGJYNWNqYnJua0pWWVpoSVliZXMyRFVrTFBjLXVkeTRaTnM0QkNmTVRkMGVfakl0LUlGR2VhZHBQbnlmZWk3UlEyeFJFZjlmdmV0SjZyNC1YZF8tVWJFMnBsSGpMVEdMRk1wV3oxSktnOGFtcm9Rai03TGZGbWVTcVlfLVB3NDR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Foundation alongside zkSync allocates $900K for ZK Layer 2 development - CryptoTvplus",
        "content": "The Ethereum Foundation, alongside Aztec, Polygon, Scroll, Taiko, and zkSync has announce the launch of the first ZK Grants Round. This grants initiative aims to enhance the Zero-Knowledge (ZK) Layer 2 Ecosystem, with a total shared prize pool of $900,000.\n\nAccording to the Foundation, each contributor, including the Ethereum Foundation, raised $150,000 to support research and development for ZK proofs and standards.\n\nThe Ethereum Foundation (EF) is a non-profit organization dedicated to supporting Ethereum and related technologies. Established in 2014, the EF aims to promote Ethereum and related technologies without controlling or leading them. Instead, the EF serves as one component of a broader ecosystem.\n\nThe EF focuses on initiatives such as the Ecosystem Support Program, which provides both financial and non-financial support to projects and entities within the wider Ethereum community.\n\nA zero-knowledge proof (ZKP) is a cryptographic method used to prove knowledge about a piece of data without revealing the data itself. It allows one party (the prover) to convince another party (the verifier) that a claim is true without disclosing any information other than the fact that the claim is true.\n\nZKPs are used to provide privacy guarantees and are employed in various blockchain use cases, such as identity management, authentication, and private transactions.\n\nAccording to a report from Protocol Labs, the zero-knowledge proof market is anticipated to generate $75 million in revenue by 2024 and is expected to surpass $10 billion by 2030. The report further highlights a projection of almost 90 billion zero-knowledge proofs being needed for web3 applications alone in the year 2030.\n\nApplication dates and deadlines for the funding\n\nEthereum Foundation also noted in the announcement that interested parties are invited to submit proposals by 11:59 UTC on March 18th, 2024. These projects can be in various stages of development, including ideas, proof-of-concepts, work in progress, and fleshed-out projects.\n\nThe focus of development includes enhancing multi-prover systems for validity, ZK, and fraud proof. It added that the funding is also open to projects that improve various proof systems, enhance efficiency and user-friendliness of ZK Domain Specific Languages (DSLs), and create security benchmarks for ZK Rollups (ZKRs) and bridges.\n\nAdditionally, teams can explore the development of tools and interfaces for ZK and validity-proof based Layer 2 solutions, creating transpilers between zkDSL and Solidity, and investigating hardware acceleration for ZK protocols.\n\nAll proposals are expected to be submitted in PDF format, English language, with detailed descriptions, budgets, timelines, an applicant profile, and a link to published work. Eligible projects must be open source, align with the round’s goals, and benefit the Ethereum ZK Layer 2 ecosystem as public goods.\n\nEvaluation criteria include impact on the Ethereum ZK Layer 2 ecosystem, value to multiple Layer 2 solutions, documentation clarity, and proposing individual or team experience.\n\nEthereum Foundation revealed that ineligible projects involve illegal activities, financial products or services, art or social impact initiatives, retroactive funding requests, and those planning token launches or public funding rounds."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNcmRfQTRHUXFhZkt3Vmh6SGQ5YzhPYl9fZ2tfNHVSSHRkN2tGWVNnWFNpSWRsdlV4djE2ZXo5cmtYeFpuU3NlWXVwQlZIckZERXMycHUtWFAwUjRGMkZhekZqRURwWWNQcktnd2t4b3l0MVdzZDFRS3FhS2tia2NVZS1sSXc4TW05ekcwOXljNnZ2Z3BqcHI5RDEtRTFQbzVjRGhxOWFxNUQ3blFLemY3Tnd30gG3AUFVX3lxTE1fbENZcWZpQUM3RHNnZmNXZm1FbWxBd1Z5azlwM01GVHpVeTFJQjlGODVOZDR1cm9SanRNSng4UHJVS2p5dlFPY2lLR185cHFhbkVaN2d5VFRRUUdSMV9TRzFTVFFEVHMxanVHVGR3UktHdGk3YWZGOTY0dFY4dzB0QU9GQWV5RlQtSXdVX1dma3BnVUtqdFRJeUkxa0ZCWWJLY09Mb1pMZWg4Zk5FaHNOUWstd2tOUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Coinbase Urges SEC To Approve Grayscale’s Spot Ether ETF — Is ETH About To Go Turbo Parabolic? - ZyCrypto",
        "content": "Advertisement\n\nCrypto exchange Coinbase has formally asked the U.S. Securities and Exchange Commission (SEC) to approve Grayscale’s bid to convert its current Ethereum Trust product into a spot ETH exchange-traded fund (ETF). This move comes after a handful of prominent Wall Street titans, including Fidelity and BlackRock, have filed paperwork for Ethereum ETFs.\n\nEther price could explode to unfathomable heights if the SEC allows the listing of the asset’s spot ETFs on U.S. exchanges.\n\nSpot ETH ETFs Should Be Approved\n\nCoinbase, which is the Grayscale Ethereum Trust’s crypto custodian, has stood firmly behind the asset manager in its application to introduce a spot ETH ETF.\n\nIn a 27-page letter shared by Coinbase chief legal officer Paul Grewal on Thursday, the exchange explained several reasons why the Securities and Exchange Commission should approve an ether-based spot ETF.\n\nKey to Coinbase’s argument is the categorization of ether as a commodity, not a security, a distinction crucial for legal compliance and market perception.\n\nAdvertisement\n\n“The market has long understood that ETH is not a security,” Coinbase wrote in the letter. “Senior officials of the Commission have publicly said as much on several occasions over the past six years, and neither the Commission nor its staff has disavowed this position, even after the merge.”\n\nCoinbase then praised Ethereum’s proof-of-stake consensus mechanism, stating that the model effectively mitigates risks of fraud and manipulation, leading to a more robust and reliable platform. This remark comes amid growing concerns over concentration risks within the Ethereum network, especially regarding spot ETH ETFs that include staking options.\n\nThe economics show that ETH is as resilient as BTC in satisfying the Commission's standard for ETP approvals. 4/6 pic.twitter.com/wDsnMFGZhL — paulgrewal.eth (@iampaulgrewal) February 21, 2024\n\nThe exchange also highlighted ETH’s market depth, liquidity, and tight spreads as evidence of a mature and efficient market. Furthermore, Coinbase points to its comprehensive surveillance-sharing agreement with the Chicago Mercantile Exchange (CME), which would allow it to monitor ETH futures to safeguard against fraudulent and manipulative practices in the Ethereum market.\n\nFinally, ETH futures ETFs are similar products to spot market ether funds, so it would be arbitrary for the SEC to grant approval to one but not the other, given their close correlation, Coinbase argued.\n\nSpot ETF Can Fuel ETH Rally\n\nThe SEC’s approval of nearly a dozen spot Bitcoin ETFs in mid-January marked a watershed moment for the crypto industry, spurring the price of BTC to break the $50,000 hurdle in February for the first time since 2021.\n\nEther, the market’s second-largest cryptocurrency also managed to rise through the $3,000 mark, buoyed by Bitcoin’s strong upward momentum.\n\nJust like with spot Bitcoin ETFs, these regulated investment products are anticipated to boost ether’s institutional appeal — driving demand for ETH. If retail appetite maintains the momentum while institutions swarm in, ETH could soar past $3,500. If this happens, ether could then quickly find itself returning to its November 2021 lifetime peak of $4,878."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxObktWUzAySFpoRUlzNFhuR2NudW1hUkM0ZHJxZElCRE1lNm14YTdZY0g0cDRhNmNJYXhRd2lRNFR2alNEMW9ubGdGcGlpeWxkaDVfWUxmYzFKSVg2MFlCb0EyakU3OUZQa2FHV2JJVjdNb2dCZ0xvbU5WdnRqWWRqRHFKU1dPNnY5ZWdWNG5iOUcyZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "What Will Ethereum’s Price Be If Its Market Cap Hits $1 Trillion? - Watcher Guru",
        "content": "An intriguing analysis has surfaced from a prominent analyst, borovik.eth, shedding light on Ethereum’s potential trajectory within the overall market. According to borovik.eth, Ethereum has the capability to ascend to the level of a $1 trillion asset, a prospect that has garnered widespread attention among investors.\n\nPrice Projection at $1 Trillion Market Cap\n\nAt the milestone of a $1 trillion market cap, borovik.eth predicts that the price of Ethereum (ETH) could soar to an impressive $8,322. This bold prediction has ignited discussions and debates within the crypto community, prompting stakeholders to contemplate the implications of such a significant valuation.\n\nETH will be a 1 TRILLION asset this cycle\n\n\n\nAt 1 trillion, $ETH will be $8,322\n\n\n\nYou aren’t BULLISH enough! pic.twitter.com/psmhR5b7bN February 20, 2024\n\nCurrent Market Status\n\nCurrently, Ethereum is trading at $2,948.11, reflecting a notable surge of 11% over the past seven days. This recent price increase has propelled ETH beyond the $3,000 milestone, a significant achievement not seen in over two years. However, amidst the excitement surrounding this milestone, lingering questions persist regarding ETH’s ability to maintain its newfound momentum and avoid a recurrence of past bearish trends.\n\nHistorical data paints a cautionary picture, with Ethereum experiencing a substantial downturn the last time it surpassed the $3,000 mark in 2022, witnessing a staggering plunge of nearly 70%. The looming question now is whether history will repeat itself, casting doubt over Ethereum’s current upward trajectory.\n\nAlso Read: ETH Surpasses $3,000; Why is Ethereum Up Today?\n\nOn-Chain Metrics Analysis\n\nExamining on-chain metrics provides valuable insights into Ethereum’s current status and potential future path. Data from IntoTheBlock reveals that over 16 million ETH addresses are currently at a loss of approximately 15%. Notably, nearly 879,000 addresses stand to become profitable if ETH continues to breach the $3,000 threshold. This influx of potentially profitable addresses further introduces the possibility of increased selling pressure as holders seek to break even at this psychologically significant level.\n\nETH is extremely close to breaking $3k. Here's what the onchain picture looks like👇\n\n➖In total, there are still over 16 million ETH addresses holding at a loss (~14.7%).\n\n➖There are about 879k addresses that would become profitable as Ethereum breaks $3k.\n\n➖These addresses have… pic.twitter.com/P4hby7NdJJ — IntoTheBlock (@intotheblock) February 20, 2024\n\nHowever, within the broader context of Ethereum’s upward price movement, this group of addresses represents a relatively minor hurdle. With over 83% of addresses already in profit, Ethereum is likely to overcome this challenge with minimal disruption to its overall trajectory.\n\nFurthermore, as ETH progresses towards a $1 trillion market cap, investors will closely monitor market dynamics and on-chain data for further insights into Ethereum’s price movements and potential challenges. With Ethereum standing at a critical juncture in its evolution, the crypto community eagerly anticipates whether borovik.eth’s bold prediction will come to fruition.\n\nAlso Read: Ethereum Surges Towards $3,000: Can ETH Hit $5,000 Next?"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOUGJRcDhpa3V2bXoxN3p6QU91SjlmR3k2SnUyZlBKRTJKSzlsMThJNW5RMTk1NkxYczZRRlJiaUI5WWx5YTlmT0hVMndSYnY4aXR4SGdKNy1PWG1Kc3hxSVltck50b0VqdUtCaFB0UnFNeWpmdC1RM0NWQ0lNUy1kN2NwT0txVFZia0FFYjVR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Why Andreessen Horowitz is betting $100 million on crypto restaking - Fortune",
        "content": "Venture capital firm Andreessen Horowitz, a.k.a. a16z, has announced that it’s investing $100 million into EigenLayer, a startup that facilitates crypto restaking.\n\nSo what actually is restaking? It’s a process that involves repurposing ETH tokens that are deposited, or staked, as a means of securing the main Ethereum blockchain. When a validator stakes tokens, it signifies a commitment to the network’s security.\n\n“They’ve already put up some economic capital and promise in Ethereum that they will not violate the governance of the protocol, otherwise they lose their stake in what it does,” founder Sreeram Kannan, a former University of Washington professor, explained to Fortune. “EigenLayer provides a universal, decentralized, validation marketplace.”\n\nEigenLayer, founded in 2021, provides a mechanism for developers to deploy protocols atop Ethereum’s existing node-operator infrastructure, which offers significantly more flexibility, Kannan adds. “That is why I think Andreessen took a bet on us.”\n\nAli Yahya, an a16z general partner, wrote in a company blog post, in part: “We’re excited to partner with Sreeram and the whole team on building a platform that unlocks a new dimension of open innovation on top of Ethereum.”\n\nSilicon Valley stalwart a16z’s recent $4.5 billion crypto-fund raise made a splash in the sector, perhaps hinting at a reversal in what’s been diminishing interest in Web3-related venture capital outlays. VC funding for crypto had been declining since the start of 2022, although the final quarter of 2023 saw a 2.3% uptick, according to a report by PitchBook, a private market data analysis provider: “After six straight quarters of decline, an uptick in funding, albeit a tiny percentage, could present welcome news for startups in the coming quarters.”\n\nA potential roadblock for EigenLayer could come via Securities and Exchange Commission Chair Gary Gensler, who told crypto firms last March that digital assets using staking protocols could be considered securities under federal law, The Block reported.\n\nThe investing public is anticipating a return on these “proof-of-stake tokens, and getting 2%, 4%, 18% returns,” Gensler said at the time. “I would just suggest that each of these token operators … seek to come into compliance, and the same with the intermediaries.”\n\nBut Kannan said that he’s not too concerned with such headwinds—“We are not anywhere in the same zone”—and that his firm is simply removing the need for new protocols to create additional staking tokens altogether, instead leaning on already-existing economic commitments made to Ethereum.\n\n“It helps many more developers participate in the crypto economy, without each of them having to worry about how to create a new decentralized economy around it,” he says."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNa1JnTmZRN1ZIRWRRel9TN0VBUUJCWm4td0UxeUxGREdVU1ZPVXBPUzFwWmVwcTJNbDlWT2NtVm5paTRCN3lxZGUtTnd1MlM0eWdEdVZSOXM3UEJpVG83enhYZUltVEpsS0ZFSFlJbEdsOEVoTFhoN0dXZHdTTEZDa0lXb2FxSlZSTHU2b0VNUG1DZ9IBlwFBVV95cUxNbl9DOTNMNnBHak9OXzZDYkppdHJyV2tUZDFjaWVlRkZpTTNIUlJfODNQWGJXVWc4YkJpOXc3ZmYyRkVjOHljbEY5R3ZjSWsyNnRYdndxQzF5R3Zkd3RnaGI4bFVweG5JTE9LOGthUUE0WGJYalBWTEo3ZThvVWFhcHFNYnJJV21DZW1oMmVodHRyejVtdE9R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Crypto Prices Today: Bitcoin Flux At $51K, Ethereum, SOL, XRP & PEPE Slip - CoinGape",
        "content": "The cryptocurrency universe witnessed quite the bustle today, February 22, following a slump in crypto prices, per data by CoinMarketCap. As the global market cap took a hit, plunging 1.62% to the $1.95 trillion mark, a bearish sentiment appears to be prevailing within the broader crypto market. Prominent cryptocurrencies like Bitcoin, Ethereum, XRP, and Solana collectively witnessed a price slump today. This appears to come due to the massive crypto market liquidation witnessed yesterday, per CoinGape Media’s report. However, sentiment for bolstered prices looms over the crypto horizon even though Fed’s stance on unchanged rates prevails. The crypto market appears to have witnessed the prior mentioned liquidation aligning with this.\n\nMajor Crypto Prices Today\n\nAs mentioned above, the Bitcoin price continued its downward movement post-liquidation today, falling 1.28% in the past 24 hours. The current BTC price rests at $51,411, with a market cap of $1.009 trillion. Meanwhile, the token also witnessed a substantial drop in its 24-hour trading volume, falling 9.45% and reaching $29.25 billion. Derivatives data also showcased a 1.18% drop in BTC open interest, hinting at a downtrend prevailing in the market.\n\nadvertisement\n\nOn the other hand, the Ethereum price marked a considerable 3% dip over the past 24 hours and is currently trading at $2,918. After a phenomenal run past the $3K mark, the 2nd most renowned cryptocurrency witnessed a significant plunge following yesterday’s $300 million liquidation. As of writing, ETH too witnessed a noteworthy decrease of 2.87% in the token’s market cap, reaching $350.97 billion, whereas the 24-hour trading volume dropped 3.41% to $19.08 billion.\n\nSolana’s price fell by 3.98% over the past day and is currently trading at $102.74. The token’s mark cap jotted a drop of 3.98%, reaching $45.29 billion, whereas the 24-hour trading volume also plummeted 13.63%, reaching $2.23 billion. XRP, the Ripple-backed token, witnessed a 2.80% dip over the past day and currently stands at $0.5421. Even XRP’s 24-hour trading volume fell 19.11%, while the market cap stood at $29.58 billion.\n\nAlso Read: Sam Bankman-Fried Opts to Retain New Legal Team Amid Concerns\n\nThe Top Crypto’s Prices For Today\n\nWorldcoin Price Soars\n\nWith a boasted market cap of $977.89 million, the Worldcoin price soared 4.33% in the past 24 hours and is currently trading at $7.36. The token marked a phenomenal week with the past seven days as a staggering 137.73% surge was witnessed, per market charts. This bullish movement comes primarily from numerous factors, including whale accumulations, burgeoning project adoption, etc.\n\nPepe Coin Price Falls\n\nAs of writing, the Pepe coin (PEPE) price, a meme coin, dropped 4.21% over the past 24 hours and is currently trading at $0.000001116. The meme coin’s market cap plunged 4.20%, reaching $469.54 million, whereas the token’s 24-hour trading volume also decreased by 20.89%, reaching $100.72 million.\n\nStarknet Slumps\n\nAfter showcasing a phenomenal surge, the Starknet (STRK) price tumbled 6.24% today, reaching $1.88. The token’s trading volume jotted a substantial drop of 33.56%, whilst the market cap dropped 6.08%, reaching $1.37 billion. Subsequent to the token’s recent listing on Binance, the price action seems to be fueling speculations.\n\nAlso Read: DCG Slams Genesis Settlement as ‘Subversive’ in Court Objection\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFAyMUVFSUxkRTNmUnpmX0cwcG5xdER2amRuNkMtODJrNWZqeThaZ0Y5X2MxcTB3bjFjd0tJWDBzRTV0SGpqTnk5c0VmME9jQ0Z1YzRteVVKaWZWY1VqQVVUQjV0Rk5qamZ3YWZKMElTc2UxOFdjZlJIcUxtcWk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum breaches $3,000 as ETF anticipation grows - City A.M.",
        "content": "Ethereum breaches $3,000 as ETF anticipation grows\n\nToday is the day of the long-awaited Ethereum Dencun upgrade. Dencun will reduce Layer 2 transaction fees and involve “blobs” and “Proto-dank sharding”. On Monday, Ethereum punched above $4,000 for the first time since December 2021. This new cycle high has happened even in the face of the perceived diminishing likelihood of an Ethereum spot exchange-traded fund (ETF) being approved by the SEC.\n\nOn Tuesday, Ethereum (ETH) crossed $3,000 for the first time since April 2022. Anticipation of the Ethereum spot ETF approval deadline on 23 May is one of the main catalysts.\n\nThe deadline forces the SEC to decide whether or not spot Ethereum ETF products will also become available for US investors. It will also retest BlackRock’s near-undefeated ETF approval win rate of 576-1.\n\nHester Pierce, the crypto-friendly SEC commissioner, asserted the SEC would avoid repeating the mistakes made with the Bitcoin ETF.\n\nIn the case of bitcoin, it took the crypto trust Grayscale to resort to legal action, needlessly extending the process and highlighting the SEC’s hostility towards Bitcoin and crypto. Ethereum’s recognition as a commodity by US regulators diminishes reasons for rejection.\n\nOn Wednesday, Coinbase endorsed Grayscale’s application to convert its ETH trust into an ETF – emphasising this stance.\n\nUnlike Bitcoin, the Ethereum community has shown readiness to adapt its technology. Ethereum is more of a technology platform than the ‘digital gold’ that Bitcoin stands for.\n\nThe March 13 Dencun hard fork serves as an example of Ethereum’s tech adaptability and will enhance the platform’s scalability. These changes are expected to boost transaction throughput.\n\nThey will also reduce transaction costs on Ethereum’s scaling protocols, known as Layer 2s, such as Arbitrum and Optimism.\n\nFrom a wider market point of view, the saying “sell in May and go away” becomes more interesting as crypto edges towards previous all-time highs.\n\nWith bullish developments such as strong Bitcoin ETF flows, the approaching Bitcoin halving and Ethereum’s potential spot ETF, demand for crypto is evidently rising.\n\nThe final bullish indicator comes from an unexpected direction. The European Central Bank (ECB) released a blog with reasons why Bitcoin is still worth 0.\n\nThe last time this happened was in November 2022, when the ECB’s blog post “Bitcoin’s last stand” perfectly marked the bear cycle’s bottom.\n\nCrypto market participants have not failed to point out the irony. For now, the ECB does not mention Ethereum in its blog posts, but an ETF launch could change this. The sentiment remains bullish."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxNVFVSLVNiandOcVZoeEdRWFBXYURwZDhIOXl1UVh4dFB0OWdFaEFJRU9qMmhreUVJX1ZpLXRpTVlESHFtRGI0T0JXWlJnRGtqZUt3YndRazZtZmFqVEpzQTZCYnhYWkdtWk9XLWg0Rzg1VHc1dmVCenZxemNoTWI4UUY5ZjNZYkZnUEEwS2RtRHVZV3VHc3pvR2pKYi1GeF9SSkJaZ21VYUN4eVM4OFRHOWgzVXBxaDVwaHlGdFFXYkVXNEJIYmlJMEVSR2xUeTlYNHZJY0ExMlh3a2pEM284LURZMFFBb3FwVkRaTE1VWkNyRnVvb1Iw0gH8AUFVX3lxTE1namtrSDVFT3lMU05aeUozQl95OWFGOUwxMVBwaldhMXZWaTV3WVBDY3N6a3BYVUoxS3RJb2xGZlBsUWdjbFpETExtdWFTQXltWWtMekx4YzE3UzFNN2tyY1pXUmZnb3poakVqcWlMQzhvWGVtZUJZaDVkTXRIQXZSWE5IUkp4VzAtQllVVXFlczJ4YTRQR2lDQnNXUHFMZUJGYXFmV3JfSDdVeDFWMjlHcnZpS2FDX3k0M0VTNU9tUWU0NDdsRVpab3dORkxLSHV3TlNrQ3E4ZVdyOG9fR3lXTmEzOVFpUWFYS1I3U1M2ZEhqSktORV8zOXBxYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Crypto market cowers with sell signals after FOMC minutes - FXStreet",
        "content": "Bitcoin price could make a 5% trip south to the $48,000 psychological level.\n\nEthereum price likely to revisit $2,770, a 5% fall with a sell signal already in play.\n\nRipple price eyes a 7% fall amid growing overhead pressure.\n\nBitcoin (BTC) price is flashing red, alongside most altcoins, coming after the Federal Open Market Committee (FOMC) minutes revealed that some members think that interest rates could have topped out. Per the report, others expressed concerns over the progress of inflation. Nevertheless, some policy makers say the economic outlook appeared firmer than the December projections.\n\nBREAKING NEWS\n\n\n\nFed Minutes suggest rates are at their peak https://t.co/J03IIvsmT5 pic.twitter.com/rEjWSwv3a7 — FXStreet News (@FXStreetNews) February 21, 2024\n\nFind detailed report here: Fed Minutes suggest rates are at their peak\n\nBitcoin price could revisit $48,000\n\nBitcoin (BTC) price is almost showing a directional bias, breaking below the $51,335 support. Judging from the technical indicators, if BTC records a candlestick close below the aforementioned buyer congestion level, the king of cryptocurrency could roll over to the $48,000 psychological level. In a dire case, BTC could retest the order block between $45,556 and $46,691.\n\nThe Relative Strength Index (RSI) has already registered a sell signal by crossing its signal line (yellow band), while the Moving Average Convergence Divergence (MACD) is dipping and could also cross below its signal line (orange band). Meanwhile, the MACD histogram bars are paling out.\n\nBTC/USDT 1-day chart\n\nOn the other hand, if the bulls show resolve, Bitcoin price could recover, flipping $52,985 into support as it extends towards $55,000 or in a highly bullish case, $60,000 psychological level. Such a move would constitute a 17% climb above current levels.\n\nAlso Read: Bitcoin price likely to fall but MicroStrategy’s $12 billion market cap makes it a possible S&P 500 candidate\n\nEthereum price could fall 5%\n\nEthereum (ETH) price, like BTC, is responding to a sell signal executed on the RSI. Traders heeding this call could see ETH drop 5% to the $2,770 support, coinciding with the midline of the ascending parallel channel. The paling MACD histogram bars accentuate this bearish thesis, solidified by the topped out MACD which is now deviating south.\n\nETH/USDT 1-day chart\n\nConversely, a recovery among the bulls could send Ethereum price north, first clearing the range high of $3,033 before creating a local top above it.\n\nAlso Read: Ethereum price scrapes $3,000 psychological threshold after 20 months, inspiring conjecture on altseason\n\nRipple price subdued by growing overhead pressure\n\nRipple (XRP) price remains within the confines of the descending parallel channel, a status made worse by growing overhead pressure. Specifically, XRP price faces overhead pressure due to the 200 and 100-day Simple Moving Averages (SMA) at $0.5643 and $0.5835 levels respectively. These features, coupled with the sell signal that the RSI has just executed, tilt the odds in favor of the downside.\n\nAccordingly, Ripple price could make a 7% drop to $0.5001, levels last tested on February 7. If this level fails to hold as support, XRP price could slip through to the $0.4734 support floor, around 13% below current levels.\n\nXRP/USDT 1-day chart\n\nOn the other hand, if the bulls come in, enhanced buying pressure could see Ripple price recover. A northbound move could see the payments token overcome the 200 and 100-day SMAs, bring the $0.6000 psychological level within reach.\n\nIn a highly bullish case, XRP price could leap further to test the $0.6421 blockade, nearly 20% above current levels.\n\nAlso Read: Ripple CEO criticizes SEC says regulator has lost lawsuits consistently; XRP price holds firm above $0.55"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOVFVEMkRhNEtWNDE4NDB6SGhPeW9CTlR2MWc0NE5uMVkzYUg1WkpSUFRnQ1M3TVpnR3E3TkNhMHdSc1lZOWZ4Vko1OE9VMXlHdVdwRUtBOVZITmM1NmJiTlZQS2dUdGl5M0k5SDdTaEFEaFlKUk5McWJleHdvbERwRi1JTlViN2NzQVZpQ0p4RXk1NXBzSngw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "DeFi investors punt nearly $1m into new Ethereum hybrid staking protocol offering 10% yield - DLNews",
        "content": "Asymmetry Finance's afETH is a hybrid staking token, offering a 10.2% annual yield by blending sfrxETH and vlCVX tokens.\n\nThe protocol plans to restake its sfrxETH through EigenLayer when deposits reopen.\n\nThe strategy behind afETH involves a number of risks due to the integration of vlCVX.\n\nAs the competition between Ethereum liquid staking protocols intensifies, projects are coming up with new ways to enhance the yields they offer.\n\nOne protocol — Asymmetry Finance — is trying to lure in investors with a hybrid approach. Its new afETH token combines the yields on staked Ether and Convex tokens to generate a 10.2% yield for investors. That’s significantly higher than the top three Ether liquid staking competitors — Ether.fi, Puffer Finance, and Kelp DAO— that offer yields between 3-4%.\n\nLaunched on February 20, afETH has already reached its 301 Ether — about $913,000 in today’s price — deposit cap.\n\nAlthough afETH offers almost three times the returns at other protocols, it also comes with more risks. That’s because 30% of it is backed by vlCVX — or vote-locked CVX — which has historically been much more volatile than Ether.\n\nAsymmetry also plans to take the other 70% of afETH’s backing, which is made up of Frax’s sfrxETH, and deposit it to buzzy restaking protocol EigenLayer to juice potential returns even more.\n\nLiquid restaking tokens, tokens that stake your Ether and then restake it in EigenLayer, are now close to $4 billion in total value locked — up from $296 million at the start of 2024.\n\nThe flurry of deposits to liquid restaking protocols recently has been due to a rising trend around of points — a wider trend in DeFi that typically heralds an upcoming airdrop. Users earn points — and free tradable tokens in the future — by using these protocols.\n\nLiquid restaking protocols are especially popular because they offer users EigenLayer points in addition to points for their own protocols.\n\nJoin the community to get our latest stories and updates\n\nTotal value of crypto assets deposited in EigenLayer\n\nEigenLayer is a recent Ethereum protocol that introduces restaking by extending Ethereum’s security to other blockchain networks. The EigenLayer mainnet — the actual blockchain — will go live sometime in the second quarter of 2024.\n\nEigenLayer investors have collected over 1.7 billion of these points — worth nearly $240 million on Whales Market, a secondary market where one point trades for $0.14.\n\nAsymmetry currently does not restake with EigenLayer since deposits into EigenLayer have been paused. But once they are unpaused, Ether deposited in Asymmetry will be restaked, as per the protocol’s announcement.\n\nAsymmetry Finance and points\n\nAssymetry Finance distributes points — dubbed gems — while also offering an outsized yield on its liquid restaking token, afETH.\n\nSince EigenLayer is not live yet, the yields received by liquid restaking tokens are generally the same as those you would receive staking Ether regularly.\n\nBut afETH is distinct from other LRTs on the market in at least one crucial way.\n\nWhile other LRTs represent a 1:1 deposit of a user’s Ether, afETH is considered a hybrid LST and each afETH is backed by a blend of two tokens: sfrxETH and vlCVX.\n\nsfrxETH is the liquid staked Ether token offered by Frax Finance, and vlCVX is vote-locked governance token of Convex Finance. Vote-locked implies a user locked their tokens to gain the ability to vote in governance and it’s used in another corner of DeFi, the so-called Curve Wars.\n\nHow afETH works\n\nWhen a user deposits their Ether into Asymmetry Finance, Asymmetry will take that deposit and automatically split it into 70% of sfrxETH and 30% of vlCVX.\n\nvlCVX, or vote locked CVX, is the key driver in producing the outsized yields offered by afETH.\n\nThe vlCVX is used in the Votium Vote Market, a market that lets protocols incentivize vote locked CVX users to vote for their liquidity pools, thereby directing valuable CRV token emissions to said pool.\n\nIn the last Votium round, which occur every two weeks, a total of $1.3 million was used as incentives for vlCVX votes.\n\nEssentially, vlCVX users are earning a 14.5% annual percentage return by being incentivized to vote for specific liquidity pools through Votium, and this yield is what lets afETH earn an over 10% APY.\n\nBut, the strategy — relying on vlCVX to back a liquid restaking token — comes with a number of risks.\n\nafETH may have the yield — but also the risks\n\nThe first risk is that users who may have just wanted to restake their Ether on Asymmetry are now exposed to the price of CVX.\n\nCVX is trading at $4.78, down over 90% from its all-time high of $49.9 on January 2, 2022.\n\nDaily price history for CVX\n\nAlthough recently the correlation — how similarly they trade — between CVX and Ether has been high, a hypothetical drop of 10% in the CVX price would cause afETH to lose about 3% in value.\n\nThe second risk is the lengthy lockup of vlCVX. Due to the 16 week lock period required for vlCVX, users who want to unstake from Assymetry are given two unstaking options: regular and instant.\n\nThe regular-unstake option gives the user 70% of Ether immediately, with the remainder available to claim at a later date depending on the availability of the vlCVX.\n\nDepending on how long it takes for the vlCVX portion to be available, by the time a user receives their deposit the price of vlCVX could move against them.\n\nThe instant-unstake option gives users their entire deposit in Ether, but it charges a fee and is only available for users withdrawing less than 2 Ether at a time.\n\nA third risk lies within maintaining the target afETH backing made up of sfrxETH and vlCVX.”For instance, they say they target 70/30 sfrxETH/vlCVX but it’s manual process by privileged address to rebalance” WormholeOracle, a pseudonymous researcher at crypto due diligence firm LlamaRisk, told DL News.\n\nThis target balance is not automated, instead it is managed by the Asymmetry team, and if it is not properly maintained, the backing of afETH could potentially skew even higher towards vlCVX, exposing afETH holders even more to the high volatility of vlCVX.\n\nAsymmetry did not respond to DL News’ requests for comment.\n\nSince the launch of afETH, 59,638 CVX - some $290,000 - has been purchased and vote-locked.\n\nThe impact on price has been noticeable, since afETH launched on February 20 the price of CVX is up 14%, while Bitcoin is down 0.3% and Ether is up 1.2% for the same period.\n\nOf the 99 million total supply of CVX, just over 61 million is vote-locked which is an all-time high.\n\nAs the landscape of liquid restaking tokens becomes increasingly crowded, protocols like Asymmetry Finance are navigating a delicate balance between risk and reward to carve out their niche.\n\nRyan Celaj is DL News’ New York-based Data Correspondent. Reach out with tips at ryan@dlnews.com."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNZFl6SkJ3WkVyMFJ4RzJnMVIwWEVIbk9fNTFXeDdtbExOcUNNNEJqdlJyc1QtNzZ4aXNpdllaNEtlOEdDSFpPWnhyRHV1alVRWVppcGVOeVdxY1ktUnZCNWVubFpINzRBOW44aU5OdWd4M1lQYVJQbE0ydE5lcFRRTEQ3WHVyTHdCZkJXMEtESXZlX3F6X0FHX0UyeVVBWjdHQTlXa0tJU0Z3TWk2UndOeS01NWlYVVozU0FYYm80cmhIRDk1T0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "News: Reddit announces IPO and reveals investment strategy in Bitcoin and Ethereum crypto - The Cryptonomist",
        "content": "News: Reddit has officially filed a prospectus document for its upcoming initial public offering (IPO) with the US SEC, with the dual intention of being listed on the New York Stock Exchange (NYSE) and investing excess funds in Bitcoin and Ethereum.\n\nLet’s see below all the details.\n\nReddit reveals investment plans in Bitcoin and Ethereum: news on the IPO project\n\nAs anticipated, Reddit has stated that it will allocate excess funds to investments in Bitcoin and Ethereum, a commitment reiterated in a recent filing with the Securities and Exchange Commission (SEC).\n\nIn the document, Reddit exposes its activity of holding cryptocurrencies and exploring the blockchain technology, emphasizing the potential legal, tax, and regulatory risks associated with such operations.\n\nThe filing also reveals that Reddit has acquired Ether and Matic as payment methods for the sale of virtual goods, highlighting the intention to continue such practices.\n\nThe company specifies that these digital assets are acquired for internal use, intended for product and engineering teams.\n\nReddit clarifies that as of December 31, 2023, its holding of digital assets was limited to Bitcoin and Ether for treasury purposes, following a policy that requires approval from the board of directors for any investment in cryptocurrencies.\n\nThe document specifies that investments in cryptocurrencies include Bitcoin, Ether, and other cryptocurrencies that enjoy positive recognition from regulatory authorities.\n\nThe deposit highlights Reddit’s adherence to the growing trend of adoption of cryptocurrencies and blockchain technology, while also emphasizing the uncertainty about their long-term continuity in terms of adoption by consumers and businesses.\n\nDespite the document not providing details on the specific amount of digital assets held by Reddit, it seems that the company has no intention of slowing down its investments in cryptocurrencies, especially in Bitcoin and Ethereum.\n\nThe recent launch of Bitcoin ETFs in the United States at the beginning of 2024 seems to further strengthen Reddit’s position in this sector.\n\nIt was also revealed in 2023 that the co-founder of Reddit, Alexis Ohanian, had purchased 50,000 ETH in 2014, an investment that has seen a significant increase in value over time.\n\nFiling the S-1 form for the IPO\n\nOn Thursday, Reddit officially filed its initial public offering (IPO) prospectus with the Securities and Exchange Commission (SEC), planning to list on the New York Stock Exchange (NYSE) under the symbol “RDDT”.\n\nThe social media company had initially confidentially filed a draft registration statement at the end of 2021, during a period marked by a wave of other IPOs.\n\nHowever, the market for public listings has undergone a significant contraction, dropping from 1,035 IPOs in 2021 to 181 in 2022 and 154 in 2023.\n\nIn its S-1 form, Reddit disclosed an annual revenue of $804 million in the last year of its IPO, marking a 21% increase compared to the previous year.\n\nHowever, despite these positive results, the company continues to report a net loss of 90.8 million dollars in 2023, highlighting the challenges on the road to profitability.\n\nReddit, which relies mainly on advertising sales for revenue, has emphasized the vast market opportunity in digital advertising, estimating a value of 1 trillion dollars (excluding China and Russia).\n\nIt is expected that this sector will grow at a compound annual rate of 8%, reaching $1.4 trillion in 2027, according to data from S&P Global Market Intelligence."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxOVHpvOGNmWHZob1hoU0E2RzVMNjJKaWlpNkE3UGh1UTd4SkdLSmtmMzFBY2d1WVVLdmlkQ1FRanA2OElMS2ppUV9mVjU1bnQ2dDJmTUhGQWFOSm9VeWJEaUY4SVprc01heVJyMDlYek1JbW13VlB6R05JRno4WEtnU1dsb0lTaXUzZGR0by1vRlRTM2c4ekRvRF80N1BJd1pSZ0ZnSzEzX1B3TlF3TllYWW5oWFJOS1RzU2g3aklNR3NUUWE4VVlzN21nN1pMUnNNd0ZTTE5OS0dBeDVyQVBB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "This cryptocurrency has more Google searches today than Ethereum (ETH) and Solana (SOL) - NO, its not Shiba Inu (SHIB) - Techpoint Africa",
        "content": "In the fast-paced world of cryptocurrency, trends can change in an instant. Today, a new player has emerged on the scene, capturing the attention of investors and enthusiasts alike. Retik Finance (RETIK), a cryptocurrency with ambitious goals and innovative features, has surged to the forefront of the market, surpassing even the likes of Ethereum (ETH) and Solana (SOL) in Google searches. At first glance, Retik Finance may seem like just another token in the crowded crypto space. However, a deeper dive reveals a project with immense potential and a dedicated community rallying behind it. So, what sets Retik Finance apart from the competition, and why is it attracting so much attention?\n\nThe Rise of Retik Finance (RETIK)\n\nRetik Finance (RETIK) burst onto the scene with a clear vision: to revolutionise the world of decentralised finance (DeFi) and redefine global transactions. From its inception, the project has been driven by a team of passionate developers and visionaries, determined to create innovative solutions that address the shortcomings of traditional financial systems. One of Retik Finance's key selling points is its commitment to accessibility and inclusivity. While other projects may cater primarily to institutional investors or high-net-worth individuals, Retik Finance aims to empower every individual to participate in the DeFi revolution. By offering user-friendly interfaces and cutting-edge features, Retik Finance has succeeded in attracting a diverse audience from across the globe.\n\nThe Power of Google Searches\n\nIn today's digital age, Google searches serve as a barometer of public interest and sentiment. When a cryptocurrency sees a surge in Google searches, it often signals increased awareness and potential investment activity. In the case of Retik Finance, the soaring number of Google searches is a testament to its growing popularity and relevance in the crypto community. Investors and enthusiasts are turning to Google to learn more about Retik Finance, eager to understand its technology, ecosystem, and potential for growth. As interest continues to spike, Retik Finance is quickly becoming one of the most talked-about cryptocurrencies in the market, outpacing even established giants like Ethereum and Solana.\n\nThe Unique Value Proposition of Retik Finance (RETIK)\n\nWhat sets Retik Finance (RETIK) apart from its competitors? At its core, Retik Finance offers a comprehensive suite of DeFi solutions designed to streamline global transactions and empower users. From futuristic DeFi debit cards to AI-powered peer-to-peer lending, Retik Finance is paving the way for a new era of financial innovation. One of the project's standout features is its multi-chain non-custodial highly secured DeFi wallet, which provides users with unprecedented security and control over their assets. Additionally, Retik Finance's smart crypto payment gateway facilitates seamless transactions across multiple cryptocurrencies, making it easier than ever for users to navigate the complex world of digital assets.\n\nThe Road Ahead for Retik Finance (RETIK)\n\nAs Retik Finance (RETIK) continues to gain momentum, the future looks bright for this emerging cryptocurrency. With a passionate community of supporters and a clear roadmap for growth, Retik Finance is poised to make waves in the world of DeFi and beyond. Investors and enthusiasts who have been captivated by the rise of Retik Finance are eagerly anticipating what the future holds. With each passing day, the project's presence on Google searches serves as a reminder of its growing influence and potential to disrupt the status quo. In conclusion, Retik Finance's ascent to the top of Google searches is a testament to its rising prominence in the cryptocurrency market. With innovative features, a dedicated team, and a clear vision for the future, Retik Finance is proving to be a force to be reckoned with. As interest continues to soar, all eyes are on Retik Finance as it charts a course towards greater success in the months and years to come.\n\nClick Here To Take Part In Retik Finance Presale\n\nVisit the links below for more information about Retik Finance (RETIK):\n\nWebsite: https://retik.com\n\nWhitepaper: https://retik.com/retik-whitepaper.pdf\n\nLinktree: https://linktr.ee/retikfinance"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQYzhNbHJHNEMtTllzdkhiWUhuN3BUdXJhd3pGX1Y0di1KbjBOVWVKQjJSNFJqa0V0M082NEdwWHdwa3p5akZ1WXgxR3BDS0g4eDJMdkxZb3duakQ2YnhoeGlwTF85eVBMSlFpZjBQWmFJRzRBWTY1MHY1TzF3LXNRU210bEVTVmNJejRyS2FXTVBrV2hIaUZvVVdXMEdGVGVheV9ZdjhUbUM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Block gained $207M on its Bitcoin Holdings and Ethereum Spot-Exchange Traded Fund - Tekedia",
        "content": "In its fourth-quarter earnings report released recently, fintech company Block reported a remarkable remeasurement gain of $207 million on its bitcoin holdings. As of December 31, 2023, Block held approximately 8,038 BTC for investment purposes with a fair value of $340 million.\n\nThe company’s earnings report highlighted a significant increase in bitcoin revenue, totaling $2.52 billion, representing a 37% year-over-year rise. This growth was driven by both an increase in the average market price of bitcoin and the price appreciation of Block’s bitcoin inventory during the quarter.\n\nBlock’s subsidiary, Cash App, played a crucial role in these gains. The platform generated a gross profit of $66 million on bitcoin sales last quarter, representing an impressive 90% increase year over year. The total sale amount of bitcoin sold to customers—which Block recognizes as bitcoin revenue—was $2.52 billion.\n\nShares of Block (NASDAQ: SQ) surged by 13% in after-hours trading, reaching $76. Overall, Block reported that its gross profit grew by 22% yearly, reaching an impressive total of $2.03 billion. Square, another subsidiary of Block, generated a gross profit of $828 million (up 18% year over year), while Cash App contributed $1.18 billion (up 25% year over year) to the company’s overall performance. In summary, Block’s strategic investment in bitcoin has paid off significantly, positioning the company as a major player in the cryptocurrency space.\n\nEther spot-exchange traded funds (ETFs) may increase institutional investment and power the world’s most-used blockchain, but they are unlikely to create euphoric price surges, according to some market observers. While interest in ether bets has risen significantly, an ETF could create sustained growth rather than explosive growth in the ether market.\n\nLast week, Ethereum’s native token crossed the $3,000 mark for the first time since April 2022, rising 15% in a week and beating bitcoin’s relatively modest 8% rally in the same period. Crypto circles on social application X expect such price action to continue after the expected issuance of ether ETFs later this year. The narrative is that these inflows could later find their way to the broader Ethereum ecosystem.\n\nHowever, some believe an ETF could create sustained, rather than explosive, growth in the ether market. Jag Kooners, head of derivatives at Bitfinex, stated that “Ethereum ETFs won’t cause bubbles.” He further explained that institutional investment through an ETF could stabilize the Ethereum market, similar to what has been observed with bitcoin and gold ETFs, fostering sustained growth.\n\nKooners also highlighted that Ethereum’s Layer 2 solutions which enhance scalability by enabling faster, cheaper transactions outside the main blockchain, play a role in fostering growth. Unlike bitcoin’s security focus, Ethereum’s L2 solutions prioritize rapid expansion, potentially attracting institutional investment and broadening application scope.\n\nBitcoin’s status as a macroeconomic asset has made it increasingly sensitive to global economic developments. As institutional participation in Bitcoin grows, adverse macro events can impact its price significantly.\n\nRecently, Federal Reserve Chair Jerome Powell expressed concern about high inflation, leading to expectations of faster stimulus unwinding. Additionally, Evergrande’s debt crisis and IMF warnings have added to market jitters. In contrast, Ethereum’s deflationary asset credentials and its transition to ETH 2.0 have helped it remain relatively resilient.\n\nHowever, it’s important to note that an ether ETF still faces regulatory headwinds. The classification of ether as a security or commodity remains a key hurdle despite ongoing regulatory discussions. Some traditional finance firms estimate a 50% chance of an ether ETF approval by May 2024 with ether considered the “only digital asset other than bitcoin” to get spot ETF approval in the U.S. Several companies have submitted applications.\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNd1I5R1RlODY3X2NtYzNGTlZ6UnZjWUVsendjU3ZvYjZFdUYtUU03emtwNkp0Q1l3MjZqM3plV1lYWVNlM19ldE9HUHJDTG5CVHdvSk9TUG1UNEdxOXk0bDdaWHRqR2J2QzM1a0RsZUdtMGJGM1d6SVVLVjFPeUlMT1NJZzVuTDJ5VG05VjRPaGVJUHlIMVF0b1NJc1hjZVdiVDQ2SS1WX2dCWEg5WWt4YWZ1QUg0aWtlVko2SUVjUDkyUdIBxwFBVV95cUxNdGdCTWZTSjNKWENfeF9UZzNMemlaV3lZblpWcFZJaHFkSnJxS3ZaWG4xbHVxSU5qQi1jZzNlYmtGck5tLVZ0U1VPeFBadVNKUUh5NDgwWHlrajNwa293Z1pkOXV3S29yb1dQMkdkZ1Z0eHZiNU9fVEpTWHJjcFhoSmQ5T0xFZ3ZFd3V6MVY3aWdxVy1sWUpfMTNjWWc1ajVtcWRkODV1a0w0MDRtb0RvSGhkQUdsQ1Z3NTZyLVd6QWNqeWVtY0dn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Analyzing the Relationship Between Ethereum Price and Futures Contracts - NewsDay",
        "content": "urethium\n\nAre you puzzled by how Ethereum prices seem to dance with the rhythm of futures contracts? A recent surge in cryptocurrency trading has propelled Ethereum futures into the spotlight.\n\nThis article peels back the layers to reveal how these financial instruments can sway the value of your digital assets. Stick around – it's simpler than you think!\n\nFutures contracts are deals to buy or sell Ethereum at a future date, affecting its price.\n\nThe contango effect can lead to higher future prices for Ethereum than the current price.\n\nGlobal economic conditions like inflation can change how people use Ethereum futures.\n\nComparing Ethereum's futures market with other cryptocurrencies shows different trends and investor types.\n\nFor smart trading, it's key to watch market makers and how they adjust their positions in response to the economy.\n\nFutures contracts are agreements to buy or sell an asset at a specified price on a future date, providing traders with the ability to hedge against price fluctuations. The contango effect, where future prices are higher than spot prices, can impact Ethereum futures contracts and their role in the market.\n\nA futures contract is a deal to buy or sell something at a set price on a future date. Investors use these contracts to lock in prices and hedge against the risk of price changes. These agreements are standard tools for market movements, including those involving cryptocurrencies like Ethereum.\n\nTraders rely on technical indicators and analysis to predict how Ethereum's price will fluctuate due to these contracts. They use futures to bet on the cryptocurrency's value, which can push its price up or down.\n\nFutures play a big role in setting expectations about where Ethereum's price might be going.\n\nFutures contracts play a crucial role in the market by allowing investors to lock in prices for assets at a future date. They serve as a risk management tool, enabling participants to hedge against price fluctuations.\n\nThe availability of futures contracts also provides liquidity and price transparency in the market, attracting both institutional and retail investors.\n\nMoreover, futures contracts help in price discovery by reflecting market expectations and sentiments. They provide valuable insights into future asset prices based on supply and demand dynamics, influencing investment decisions and overall market stability.\n\nThe contango effect can impact Ethereum futures contracts, leading to higher future prices than the current spot price. This occurs when market participants anticipate increased demand for Ethereum in the future due to various factors like inflation expectations or market dynamics.\n\nAs a result, investors may use futures contracts to hedge against potential price increases and secure favorable positions in anticipation of rising Ethereum prices.\n\nAnalyzing the contango effect is crucial for understanding how it influences Ethereum futures contracts and their pricing dynamics. By closely monitoring this phenomenon, traders can make informed decisions about their positions and effectively navigate the complexities of the cryptocurrency futures market.\n\nFutures contracts have a significant impact on the price dynamics of Ethereum, with global economic conditions playing a crucial role in shaping the futures market for this cryptocurrency.\n\nComparing Ethereum with other major cryptocurrencies in the futures market can provide valuable insights into its pricing behavior and market trends.\n\nFutures contracts play a pivotal role in influencing Ethereum's price dynamics. Market indicators analysis reveals how the trading activity in futures contracts can impact Ethereum's valuation, leading to significant price fluctuations.\n\nAdditionally, understanding the perpetual futures contract funding rate helps predict price movements, enabling traders to make informed decisions and hedge against inflation.\n\nCryptocurrency futures contracts introduce volatility into the market as market makers strategically navigate neutral trading positions. Analyzing the influence of global economic conditions on Ethereum's futures contracts provides insights into how external factors shape its price trajectory compared to other major cryptocurrencies in the ETF market dynamics.\n\nGlobal economic conditions heavily influence Ethereum futures contracts. Economic volatility can lead to increased demand for Ethereum futures as investors seek to hedge against inflation and currency devaluation.\n\nFor instance, during periods of uncertainty or high inflation, the demand for Ethereum futures may surge as they offer a way to protect against potential losses in traditional markets.\n\nMarket makers utilize technical analysis techniques to predict price movements based on global economic factors. They strategically adjust their positions in response to these conditions which impacts the liquidity and pricing of Ethereum futures contracts.\n\nEthereum's performance in the futures market often contrasts with that of other major cryptocurrencies. This table summarizes key differences and comparisons:\n\nCryptocurrency\n\nMarket Capitalization\n\nFutures Contracts Volume\n\nPrice Volatility\n\nTypical Futures Market Participants\n\nEthereum (ETH)\n\nHigh\n\nSignificant\n\nHigh\n\nInstitutional and Retail Investors\n\nBitcoin (BTC)\n\nHighest\n\nExtremely High\n\nComparatively Lower than ETH\n\nMainly Institutional Investors\n\nRipple (XRP)\n\nModerate\n\nModerate\n\nModerate to High\n\nMixed, with More Retail Participation\n\nLitecoin (LTC)\n\nLower\n\nLower\n\nHigh\n\nRetail Investors\n\nBitcoin Cash (BCH)\n\nLower\n\nLow\n\nHigh\n\nRetail and Some Institutional Investors\n\nEthereum attracts a significant volume of futures trading, reflecting both its high market cap and volatility. By comparison, the leading cryptocurrency, Bitcoin, commands the most attention from institutional investors with an extremely high futures contracts volume. Other cryptocurrencies like Ripple, Litecoin, and Bitcoin Cash see varying levels of engagement in the futures market, often with a larger retail investor base. Ethereum's futures market, therefore, serves as an important gauge for investor sentiment and market dynamics among its peers.\n\nIn conclusion, understanding the relationship between Ethereum price and futures contracts is crucial for investors. The influence of global economic conditions on Ethereum futures contracts requires careful analysis.\n\nBy studying market maker strategies and predicting price movements, one can effectively navigate the complexities of cryptocurrency futures contracts. As Ethereum continues to evolve in the futures market, evaluating contract topology and hedging against inflation becomes increasingly significant for informed decision-making."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE9SOTZMWTRaN3IxU2w2YlNmN2hzcVNWREFLNmNfUXZfZmZhOXdFZ3hBWF9QTWVISGVQN1hVMHZVLXhNS3ZDM2RKMzRSc1U3eFF5OUFUeF9RVXJ1YUd3Rk1aaFJ5X0NmVUFZbGdPYlBR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin, net worth S$739 million, spotted in S'pore at MRT station - Mothership.sg",
        "content": "What are the odds of bumping into a multi-millionaire in Singapore?\n\nAnd what are the odds of bumping into a multi-millionaire while waiting to take the MRT train in Singapore?\n\nThat was what one commuter here did, as he spotted Russian-Canadian computer programmer, and co-founder of cryptocurrency Ethereum, Vitalik Buterin, at King Albert Park MRT station.\n\nThe 30-year-old, who hails from Russia before his family emigrated to Canada when he was six, worked on developing the cryptocurrency full-time before he turned 20 and has been credited for being involved with the token early in its inception.\n\nHis net worth is currently at least US$550 million (S$739 million) and mainly held in the ETH token he personally co-developed.\n\nAt cryptocurrencies' peak, Buterin became the youngest crypto billionaire at the age of 27.\n\nHe was also spotted on the streets in Singapore, as per another two photos posted on Facebook on Feb. 21.\n\nButerin's unassuming character has won him high praise online.\n\nOne tweet, in response to Buterin's public transportation-using ways, read: \"A developed country is not a place where the poor have cars. It's where the rich use public transportation.\"\n\n\"A developed country is not a place where the poor have cars. It's where the rich use public transportation.\" pic.twitter.com/fSgrNFf2p7 — Richard H (Urban Red Dot) (@Richard_URD) February 20, 2024\n\nButerin's philanthropy has been well-documented.\n\nHe is known to not be a hoarder of other cryptocurrency.\n\nIn May 2021, he donated US$1.14 billion worth of cryptocurrency to the India Covid-Crypto Relief Fund.\n\nThe donation consisted of 500 ETH and over 50 trillion SHIB (Shiba Inu), a meme coin, that was gifted to him.\n\nThis donation was 5 per cent of the meme coin in circulation and caused a 50 per cent crash in the price at the time as it caused panic among holders of the coin.\n\nAround the same time, he also donated US$336 million worth of Dogelon Mars ($ELON), which had previously been gifted to him as well, to the Methuselah Foundation, which focuses on extending human lifespan.\n\nButerin's donation of this meme coin caused a 70 per cent drop in its value.\n\nTop photo via Asan Kayo & @dAAAb X"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQNFdObGcwV2FRYl9YZjEtX3hoNzF6aFY2X3lFMzZVUEZSVXEzSWpZdnZJamJ3X0d1Vkh1a2pRS3lXNHAzZHgwWFh6TGRjbUZQUno3d0xTWnM0Zmx2anpDWFdLZUQ3eU5vYTYtc2tMaVg3RVVLWVFGUFJsTXFZQjl2YtIBhgFBVV95cUxOeFpUYVI4VEhlNlNLdlI0WUtudndsLWNFem5lNm9JRWQ3Uld1Q0pvOENMcGRSbWhCbkp4ZWtmTGk5WkNXdWlHeTV5MHJXVFpoSVZkNEhLRkgwNFlmYl9meFowbjdyTnV4YjNnWTQ1THpNRU84VmZYaFNZU2N4TWUxRlE4TGU1UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:28:33 GMT",
        "title": "Top 6 Altcoins That Will Benefit From Ethereum’s Dencun Upgrade: Crypto Analyst - NewsBTC",
        "content": "As the Ethereum ecosystem braces for the much-anticipated Dencun upgrade, renowned crypto analyst Miles Deutscher provides an in-depth look at the altcoins poised for significant growth.\n\nScheduled for March 13, the Dencun upgrade is a critical hard fork aimed at enhancing Ethereum’s scalability, security, and usability. Deutscher’s insights reveal how specific Layer 2 (L2) solutions are uniquely positioned to benefit from the upgrade’s introduction of Proto-Danksharding and other key enhancements.\n\nDeutscher explains, “The Dencun upgrade, especially with EIP-4844, represents a paradigm shift in how Ethereum will handle transactions. By drastically lowering gas fees and increasing throughput, we’re looking at a more accessible, efficient blockchain.” This upgrade is part of Ethereum’s broader roadmap, known as “The Surge,” focusing on scalability improvements.\n\nTop-6 Altcoins To Watch Prior To Dencun\n\n#1 Polygon (MATIC/POL): With its impending rebrand and investment in zk-technology, Polygon is at a pivotal juncture. Deutscher notes, “Polygon’s deep dive into zk-rollups could redefine its position in the L2 landscape, making MATIC an attractive asset for forward-looking investors.”\n\nRelated Reading\n\n#2 Arbitrum (ARB): As the leading L2 by TVL and transaction volume, Arbitrum’s robustness is undisputed. “Arbitrum has cemented its position as a powerhouse in the L2 space, and the Dencun upgrade will only amplify its strengths,” Deutscher remarks.\n\n#3 Optimism (OP): Positioned as a strong contender in the L2 space, Optimism’s ecosystem is set to expand. “The announcement of Optimism’s fourth airdrop is not just a reward for its community but a strategic move to bolster its ecosystem’s vibrancy,” says Deutscher.\n\n#4 COTI Network (COTI): With the launch of V2 and its innovative ‘Garbled Circuits,’ COTI introduces a groundbreaking privacy solution. Deutscher observes, “COTI’s approach to privacy on the blockchain through ‘Garbled Circuits’ is a game-changer, potentially setting a new standard for private transactions.”\n\nRelated Reading\n\n#5 Mantle (MNT): Highlighting Mantle’s rapid growth, Deutscher points out, “With $1.5 billion in ETH now staked as mETH, Mantle is not just growing; it’s thriving, supported by strategic airdrops that reward its community.”\n\n#6 Metis (METIS): Identified as a potentially undervalued project, Metis’s upcoming initiatives are a beacon for investors. “Metis’s decentralized sequencer and the substantial METIS Ecosystem Fund are laying the groundwork for a robust, decentralized future, making it an intriguing prospect post-Dencun,” Deutscher explains.\n\nBroader Implications For Ethereum\n\nDeutscher also casts a spotlight on Manta Network, Starknet, zkSync, and Linea as projects to watch, emphasizing the widespread impact of the Dencun upgrade. He advises, “The ETH/L2 trade is increasingly compelling as we approach the Dencun upgrade. Shifting a significant portion of one’s portfolio into the Ethereum ecosystem seems prudent, given the transformative potential of the upcoming changes.”\n\nAt press time, ETH still traded just below the $3,000 mark.\n\nFeatured image from Shutterstock chart from TradingView.com"
    }
]