[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNMVFGLTduc1RmUnVYQ3Z3SWMyWlhuN1NaMDVYR0cwR0pmVFpTNVUzbnFCT2lNMlNLeXBYeklRU04xSXhpQkxxUlZwdjFWcVpyZzBRZGRwMVhscE9HRGZMZURrMWtPRnhacnpWY05mRER1a2duZlBEOWRIQXY3UnRJMDVtb0FWMzZEYlHSAY8BQVVfeXFMTXBoWnIxWUdWb0s5dEpScHNjYnlxRk9OSUlESng0anJucm5HQ19ZbF9XeEV5NUVEMFdzN2o3aDd2Ykh4d3pBaVVjN1dWWHQ3UVBkTk85LVpIamQySDFVOHhnZldrT1JiQ05wTXdseGpQMmMwb1g0U2pNYXNDQkFvamZ2dXZlZGhxQ2VoeFQtZ1k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Crypto for Advisors: Ethereum Staking - CoinDesk",
        "content": "Consensus awards are given to validators by the protocol for securing it. The size of the rewards are correlated to the number of validators that are securing the network. Since these rewards are shared across the validators, the more validators, the lower the rewards. Ethereum has seen the number of validators increase materially since it transitioned to proof of stake. As a result, consensus rewards have declined over that time period."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNNHR1M0t2LVYzVVFOd2R2TGtzd1JRYkVzTjZsX2FDM3JoQ3V5ZGpaWGxlMkkwR2pLWVpiMTBaMXB3NkEwM0VIRXRXaDZCcmtFR2pGM3lLczlnVXRGaG4tVzNBTF9CQXZUSmtxd09Rc2xnVEN2TWVvakdEcjljSW1tZUV6SUhZUEhua0dZOTRvTG5ySEd3WjFJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "What Is An Ethereum Wallet and How Does it Work? - Ledger",
        "content": "What Is An Ethereum Wallet and How Does it Work?\n\nBy Vineet Nair\n\nBeginner\n\nSHARE\n\nKEY TAKEAWAYS: — An Ethereum wallet allows you to send, receive, secure, and manage your ETH and Ethereum tokens.\n\n\n\n— Every Ethereum wallet works slightly differently, thus choosing the best wallet for you depends on its intended purpose.\n\n\n\n— Ledger Ethereum wallets offer you true ownership while keeping your funds secure, and exploring the Ethereum ecosystem is easy via Ledger Live.\n\nAs the digital landscape evolves, Ethereum, a leading blockchain platform, has become pivotal in the world of cryptocurrency. Central to the interaction with Ethereum’s ecosystem are Ethereum wallets, the keys to exploring the world of digital identities and crypto assets.\n\nEthereum wallets are more than just digital vaults; they are the bridge connecting us to the decentralized wonders of the Ethereum blockchain. From free and accessible software wallets to robust and trusty hardware wallets, each type offers a unique key to unlocking the world of digital assets. They are gatekeepers to a user’s digital presence on the Ethereum blockchain.\n\nThis detailed guide delves into the multifaceted world of Ethereum wallets, offering an in-depth understanding of their mechanics, varieties, and the considerations essential for selecting the right one.\n\nWhat Is An Ethereum Wallet?\n\nAt its core, an Ethereum wallet acts as a digital interface, enabling you to manage your Ethereum-based assets, execute transactions, and engage with decentralized applications (dApps). The wallet, therefore, is a powerful tool for navigating the Ethereum blockchain.\n\nAn Ethereum wallet simply lets you manage the assets at a specific blockchain address, but how they do that differs from wallet to wallet. To understand further, let’s dive into how Ethereum wallets work.\n\nHow Does an Ethereum Wallet Work?\n\nTypically, your crypto wallet will provide you with a secret recovery phrase when you set it up initially. While this is not true for all Ethereum wallets (such as Ethereum paper wallets) most crypto wallets today follow a hierarchical deterministic model, meaning they allow you to generate a near infinite number of Ethereum accounts with a single wallet. Thanks to the invention of standardized secret recovery phrases, they also allow you to restore all of these accounts with any HD wallet provider.\n\nyour Ethereum wallet can typically generate and store private keys for a range of accounts. Each new account in your wallet is controlled by a separate key pair. The public key is the unique identifier of the account, allowing people to find your account details and send you funds. The private key, on the other hand, is what you use to sign transactions: it allows you to control the funds at a specific address.\n\nYour Ethereum wallet’s job is to store that private key and keep it safe from potential onlookers. Some Ethereum wallets will store those keys on your laptop or smartphone, others will store them on a separate physical device. The final step is allowing you to sign transactions. To sign a transaction, your wallet uses your private key, thus verifying you agree to the terms of what you’re signing.\n\nBeyond these simple workings, there’s a lot more to it. For example, some wallets don’t allow you to manage your private keys yourself, and private key storage can also vary greatly from wallet to wallet. To understand deeper, let’s dive into the different types of Ethereum wallets.\n\nTypes of Ethereum Wallets\n\nSoftware Ethereum Wallets\n\nSoftware wallets, as the name suggests, operate via software installed on computers or mobile devices. They offer a user-friendly approach to crypto management, allowing you to set up HD wallets with multiple accounts for free. Beyond mere storage, these wallets often allow you instant access to blockchain services, enabling users to engage with smart contracts and decentralized applications (dApps) directly. Since software wallets are free and easy to download, they are often the choice of beginners. However, software wallets store private keys on the host device, meaning your laptop, smartphone, or PC. Since these devices connect to the internet, software wallets are often vulnerable to malware and spyware.\n\nMobile Ethereum Wallets\n\nMobile Ethereum wallets are software wallets designed specifically for operating on smartphones and tablets. Typically, they stand out with their intuitive interfaces and accessibility. Smartphones are so commonplace throughout the world, that mobile wallets are available to anyone. Plus, since they operate on smartphones, mobile wallets can use your phone’s camera to scan QR codes. This can be extremely convenient when using crypto for everyday purchases or in real life.\n\nHowever, as a software wallet, mobile wallets are not always safe. Your smartphone is vulnerable to malware, so if you’re using a mobile wallet, don’t use it to protect valuable assets.\n\nDesktop Ethereum Wallets\n\nInstalled on personal computers, Ethereum desktop wallets offer a comprehensive suite of features you can use on a device you already own. Much like a mobile wallet, desktop Ethereum wallets are available to download for free. Unfortunately, much like mobile wallets, desktop Ethereum wallets are also vulnerable to malware and spyware on their host device: your computer.\n\nEthereum Wallet Extensions\n\nThe final type of software wallet operates via browser extensions. Essentially these types of wallets are like apps in your browser. This may be a convenient way to use a wallet, but it’s also hazardous. Using a wallet that operates as a browser extension means it is always connected to the internet. This means you could reveal your private keys to a bad actor via your internet connection.\n\nThus if you’re using any type of software wallet, from mobile wallets to browser extensions, make sure you don’t use them to store valuable assets.\n\nEthereum Paper Wallets\n\nEthereum paper wallets are simply pieces of paper with private keys printed on them. Since they are physical objects in the real world, they aren’t vulnerable to online threats like malware and spyware.\n\nThe appeal of paper wallets lies in their simplicity and the absolute offline security they provide—shielding assets from digital malfeasance. However, Ethereum paper wallets have another vulnerability: physical damage or loss. Unfortunately, paper just isn’t that robust. Apart from that, paper wallets are also hard to use and don’t offer you any interface for sending and receiving cryptocurrencies. You can’t connect to a defi app with a paper wallet and you can’t manage multiple accounts with them either.\n\nEthereum Hardware Wallets\n\nHardware wallets are physical devices that store private keys and sign transactions in a secure offline environment. From there the wallet sends the already signed transaction to your internet-connected device, which transmits it to the blockchain. This keeps them insulated from online threats such as malware or phishing attacks. Designed with security in mind, hardware wallets provide a solution for managing all cryptocurrency holdings—big or small.\n\nEthereum hardware wallets also allow you to create multiple Ethereum accounts and manage them with a single interface. This is perfect for those who want to explore web3 freely. By setting up multiple accounts and segregating your assets, you can connect to potentially malicious apps while keeping your main holdings safe.\n\nIn short, hardware wallets combine the best features of software and paper wallets: accessibility and security.\n\nWhat is the Best Ethereum Wallet?\n\nThe “best” Ethereum wallet is subjective and varies based on individual requirements. Factors to consider include the wallet’s security features, ease of use, supported cryptocurrencies, and additional functionalities like integration with dApps or exchanges.\n\nIf you need to connect to apps, dApps, and smart contracts, your best choice is a software wallet. If you want to protect that software wallet and create separate accounts storing a range of valuable assets, your best option is a hardware wallet. Find out our comparison of the best Ethereum wallets in 2024 where we compare Ethereum hot wallets and Ethereum cold wallets. What’s more important is considering the most useful features a wallet should have for your purposes. So, let’s dive into what you should consider when picking an Ethereum wallet.\n\nWhat to Consider When Picking an Ethereum Wallet\n\nCustodial vs. Non-Custodial Wallets\n\nCustodial wallets are managed by a third party. It retains control over the private keys of the account containing your funds. Much like a bank, the service provider owns your account, it simply lets you use it.\n\nThe upside? You don’t need to worry about losing your keys (since you don’t hold them). You can log in with an email address and password, and follow a familiar password recovery process to regain access to your account. The downside? The custodial wallet provider reserves the right to deny you access to your funds, meaning you don’t have true ownership of your assets. Remember: “Not your keys, not your crypto”. If a centralized entity controls the private keys of your account, you don’t really own the assets stored there.\n\nIn contrast, non-custodial wallets give you complete control over your private keys and, by extension, your assets. This model ensures you maintain full autonomy over your funds. Non-custodial wallets have no intermediary with the authority to freeze, access, or manage the assets without your consent. This more decentralized approach to asset management aligns with the foundational principles of blockchain technology.\n\nLedger devices exemplify the non-custodial model, providing a hardware-based solution for secure asset storage. They store private keys offline, isolated from online vulnerabilities using a secure element chip and also provide a decentralized and secure method of asset management, ensuring true ownership of their digital assets.\n\nEthereum Wallet Security\n\nOf course, security is the paramount consideration when choosing an Ethereum wallet. Not all wallets offer the same level of security infrastructure, and this can significantly impact the safety of your assets.\n\nAs mentioned, software wallets are vulnerable to online threats such as malware and spyware. Since they sign transactions online, they risk exposing your private keys via your internet connection. To avoid these risks, your best option is to store your private keys offline. Both paper wallets and hardware wallets offer offline storage, which is preferable if you’re protecting significant amounts of money.\n\nIn some cases, you will need to use a software wallet to connect to a specific app or platform, as the specific app might not support hardware wallets. If you encounter this situation, the best option is to opt for a software wallet you can use in tandem with a hardware wallet. For example, you can use metamask with a Ledger device to connect to DeFi apps and NFT mints while keeping your private keys offline.\n\nThen when choosing a hardware wallet, you’ll want a device that can sign transactions offline in a secure environment. It should also have robust security measures to fend off physical hackers. For example, Ledger devices store private keys offline in a secure element chip. This protects private keys from online threats. Using the same chip as bank cards and passports also means it is resistant to countless physical hacks such as glitching and fault attacks. If you’re using a physical device on the go, this protection is extremely important to protect your crypto should the device fall into the wrong hands.\n\nUsage Considerations\n\nYour intended use of cryptocurrency greatly influences the type of wallet you should choose. When choosing an Ethereum wallet, your selection should align with your specific needs, since not all Ethereum wallets support the same assets.\n\nChoosing a wallet that supports the assets you’re interested in is the first step. For example, if you want to explore the world of NFTs, you will want to use an Ethereum wallet that supports ERC-721 and ERC-1155 tokens. And while most Ethereum wallets allow you to manage these NFTs, not all of them will let you visualize them too.\n\nFor those planning to buy and sell, you will need a wallet that interacts with NFT minting sites or marketplaces. Or if you’re more into tokens, DeFi, and trading, you will need a wallet that supports ERC-20 tokens and allows you to connect to decentralized exchanges and trading platforms. In short, it’s important to check the wallet you’re using is compatible with the type of asset you want to use and the platform you want to access.\n\nFinally, if you plan to secure a sum of ETH long-term, none of those functionalities are as important as security. In this case, you would want to use a wallet that stores your private keys offline.\n\nWallet’s Reputation\n\nResearching an Ethereum wallet’s reputation is crucial for the safety of your digital assets. Reviews, historical security breaches, and the wallet’s response to such incidents reveal its reliability. Reputable wallets often have robust security features and a good track record.\n\nNot all wallets are equally trustworthy; some have fallen victim to remote or physical hacks due to vulnerabilities in their code. So, before you decide on a wallet, make sure you do your own research to identify a provider that thinks of its user’s security first.\n\nWallet Backup Options\n\nHD wallets: restore from your seed phrase\n\nSecuring your Ethereum wallet with reliable backup options is essential for safeguarding your assets against device failure, loss, or theft. The most common, and most reliable method for backing up your crypto wallet is the safe storage of your secret recovery phrase.\n\nTo explain, most wallets are HD wallets, meaning you can manage a near-infinite number of accounts from a single interface, and restore any associated account using a single mnemonic named a secret recovery phrase (or seed phrase). Both Ethereum hardware and software wallets use this model and the method is standardized. That means even if you lose your hardware wallet, you can recover all of the associated accounts by importing the secret recovery phrase into a software wallet’s interface and vice versa. Thus, if you want a secure backup option, using an HD wallet is a great starting point.\n\nBackup Hardware Devices\n\nIf you want to create an extremely secure backup, a great option is to create a backup hardware device. With this method, you buy a second Ethereum hardware wallet to import the same accounts onto. Instead of storing a piece of paper with your secret recovery phrase as backup, you have two devices that allow you to access the same accounts.\n\nThrough a Centralized Entity\n\nUsing a non-custodial wallet, you must look after your own backup. This is preferable, as it gives you true ownership over your assets. However, some wallets are custodial. This means that you don’t own your private keys, thus, if you want to restore your account, you must typically undergo a more familiar password recovery process, much like you would with any other web2 financial platform. However, it’s important to note that centralized entities may not restore your access, as they have the final say over your assets.\n\nVia Backup Services\n\nSome wallet providers may also offer services to help you manage your wallet backup. For example, using a Ledger device, you can sign up to Ledger Recover; a paid optional service that can help you secure a backup and access it whenever you need using just your identity.\n\nHow Much Does an Ethereum Wallet Cost?\n\nChoosing an Ethereum wallet comes down to what you’re comfortable spending and the level of security you’re after. Sure, you can start with software and custodial wallets without spending a penny, but they’re not without their risks, which could end up costing you more down the line.\n\nThen you’ve got hardware wallets. Yes, they’re a bit of an upfront investment. They need to be made, and designed, and all that tech has to be paid for. But if you’re serious about keeping your crypto safe, that investment makes sense. Think about it: losing your crypto to a hacker is going to hit your pocket much harder than the $79 you’d spend on a Ledger device.\n\nHow To Use an Ethereum Wallet\n\nCreating an Ethereum Wallet\n\nCreating an Ethereum wallet means choosing a wallet provider.\n\nUsing a custodial wallet, you will have to set up login details, such as an email address and password. Typically, custodial wallets will also force you to undergo a KYC, which means showing the provider a copy of your government identification.\n\nUsing a non-custodial wallet, the process is a little different. With a software wallet, you will have to download and install the interface on your web2 device, such as your PC or smartphone. For hardware wallets, you will need to buy the device and install its companion software on your internet-connected device.\n\nFrom there, both non-custodial wallet types will provide you with a secret recovery phrase. This is a string of 12-24 English words that will allow you to restore your wallet using any HD wallet provider. Think of this as the golden key to your digital kingdom.\n\nFrom there, you will need to create a new Ethereum account to send and receive ETH and Ethereum tokens. Your Ethereum wallet uses your SRP to generate key pairs for each new account you create. The private key is like the secret password to your account, giving you the power to manage it, while the public key is more like your account’s address or ID, letting the world know where to send your Ether.\n\nStoring ETH in a Wallet\n\nIt’s important to clarify that Ethereum wallets do not store ETH, they store the private keys needed to control your Ethereum accounts. To store ETH you must move it to an account managed by a private key you control.\n\nSending & Receiving ETH with a Wallet\n\nTo send ETH, you need to initiate and confirm the transaction using your wallet’s interface. At this point, your wallet uses your private key to sign the transaction and then transmits it to the blockchain.\n\nTo receive ETH, you will need to share your blockchain address with the sender. Each Ethereum account has a different blockchain address, which is derived from its public key. This public key is generated by your Ethereum wallet and serves as a unique identifier for your account.\n\nLedger Ethereum Wallets\n\nWith Ledger devices, you can access the Ethereum ecosystem with the comfort of security. Ledger Ethereum wallets are multi-faceted, allowing you to secure and manage ETH and Ethereum tokens such as memecoins, stablecoins, NFTs, and more. Not only that, but via Ledger Live you can buy, sell, swap, and stake ETH with ease. Plus, Ledger Live offers a wide range of Ethereum apps and services that each benefit from Ledger’s clear signing plugin. That means you can start exploring NFT and DeFi platforms without blind signing—the biggest threat to your Ledger device.\n\nAll in all, Ledger devices and their Ethereum apps, offer the perfect environment to start exploring the Ethereum ecosystem.\n\nConclusion\n\nEthereum wallets are essential tools for anyone engaging with the Ethereum blockchain. They offer not just a means to store and manage digital assets but also serve as a gateway to the broader Ethereum ecosystem. Understanding the types, features, and security aspects of these wallets is crucial for making informed decisions and effectively managing your digital assets.\n\nSo what are you waiting for? Get yourself a Ledger device and start managing your Ethereum assets with a wallet designed for security.\n\nFrequently Asked Questions About Ethereum Wallets\n\nWhat is Ethereum?\n\nEthereum is a layer 1 blockchain that enables the development of decentralized applications (dApps) and smart contracts, with its native cryptocurrency, Ether (ETH), facilitating transactions within this ecosystem.\n\nWhat are the Features of Ethereum?\n\nEthereum is distinguished by its smart contract functionality, Ethereum Virtual Machine (EVM) that executes complex contract operations, and a thriving decentralized finance (DeFi) landscape that offers alternatives to traditional financial services.\n\nHow to Set Up an Ethereum Wallet?\n\nSetting up an Ethereum wallet involves selecting an appropriate wallet type, downloading and installing the application, creating or importing an Ethereum account, and securely storing the recovery phrase or seed phrase. This process varies slightly based on the type of wallet chosen.\n\nWhat’s the Most Secure Ethereum Wallet?\n\nHardware wallets are widely regarded as the most secure option for storing ETH, as they keep private keys completely offline, rendering them inaccessible to online hacking attempts.\n\nWhy Use an Ethereum Wallet?\n\nAn Ethereum wallet is essential for securely managing ETH and related digital assets, executing transactions, and engaging with the vast array of applications and services on the Ethereum network.\n\nWhat Is BIP-39?\n\nBIP 39, or Bitcoin Improvement Proposal 39, is a protocol that outlines how to generate a mnemonic phrase—a series of words used to back up and recover blockchain wallets. This mnemonic phrase, often consisting of 12, 18, or 24 words, acts as a human-readable form of your wallet’s private keys, making it easier to record and remember. Think of BIP 39 as a secret codebook that turns a complex digital key into a list of simple words, like “apple sunshine river.” It’s a way to back up and access your digital wallet using words instead of hard-to-remember numbers and letters.\n\nWhat are Public and Private Keys?\n\nPublic keys, which can be safely shared, are used to receive funds. In contrast, private keys, which should be kept secret, are used to authorize and sign transactions, thereby proving ownership of the associated assets.\n\nDo I Need an Ethereum Wallet?\n\nIf you intend to interact with the Ethereum network, hold or utilize ETH or other tokens, an Ethereum wallet is indispensable for ensuring the security and functionality of your digital assets."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQTjB5QjJIOFd1VUhCLUdCZTk1MGZXYVgxaTkzeUg2ZEtodUZjeGJLenhXUlZGOGt0WU1oaFJrTzEtNFByRmY1VHZ2OGdub1lpYzhDZVZESW5SLUN6SGotM2oxb3BacnVCbFRyaHEySzlVUHZYUkkzZGlvdFlqbnRoQUFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "3 Crypto Stocks to Watch as Ethereum Brings in the Dencun Upgrade - Yahoo Finance",
        "content": "While the price of Bitcoin (BTC) has been recently scaling unchartered territories, Ethereum (ETH) has also been fast off the blocks in 2024. The price of ETH is hovering around the $3900 mark, having risen 70.7% year to date as of Mar 8. Ethereum, which trails only Bitcoin in the crypto world, is known for its uses as a blockchain-powered, open-ended decentralized software platform.\n\nHaving completed the Shanghai Upgrade in 2023, Ethereum has ensured that it shifts its blockchain validation system from proof-of-work to proof-of-stake. Under the proof-of-stake system, miners of Ethereum will rely on Ether holders who will act as validators, thus lending more assurance to the system. In essence, proof-of-stake allows holders of Ether to lock up their funds as collateral to validate transactions and create new blocks, reducing the need for extensive computation and energy consumption. The result has been far stricter trading, and the amount of Ether locked up has risen significantly.\n\nA massive boost has also come in from new institutional investments, with traditional financial giants following up their successful spot BTC ETF bids with ETH ones.\n\nHowever, the latest upgrade to its systems is going to be a game changer, and may see the stock shoot well above its all-time high of $4400 witnessed in May 2020. The ETH blockchain's Dencun upgrade, scheduled for Mar 13, is going to be a massive step toward allowing the network to function as a proper database for layer-2 blockchains to store data more efficiently. Also, it will make transactions cheaper on these blockchains and boost mainstream consumer demand.\n\nAnalysts around the world have pondered that with Bitcoin scaling the heights it is currently, Ether will only follow suit with the momentum from the upgrades and ETH applications and touch its all-time high pretty soon. In fact, it may go beyond the $10,000 markbefore the year ends.\n\nSo, with Ethereum already starting to make good of the state of the market, it might be prudent to keep a watch on stocks exposed to this open-source, decentralized blockchain platform. Here is a selection. These currently carry a Zacks Rank #1 (Strong Buy), #2 (Buy) or #3 (Hold). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nMarathon Digital Holdings, Inc. MARA: This digital asset technology company mines digital assets and focuses on Bitcoin and Ethereum.\n\nMarathon Digital’s expected earnings growth rate for the next year is 238.1%. The Zacks Consensus Estimate for its current-year earnings has surged 450% over the past 60 days. Marathon Digital currently carries a Zacks Rank #3.\n\nStory continues\n\nCME Group Inc. CME: This company operates as one of the world's largest futures exchanges and offers a wide range of derivatives contracts and various solutions to invest in cryptocurrencies like Ethereum.\n\nCME Group’s expected earnings growth rate for the current year is 2.8%. The Zacks Consensus Estimate for its current-year earnings has improved 1.3% over the past 60 days. CME Group currently carries a Zacks Rank #3.\n\nBlackRock, Inc. BLK: This publicly owned company, which is one of the world’s largest investment managers andone of the first companies from the traditional market to join the Bitcoin ETF race back in June 2023 and got it approved this January, has already entered the ETH fray by applying for spot ETF.\n\nBlackRock’s expected earnings growth rate for the current year is 5.2%. The Zacks Consensus Estimate for its current-year earnings has improved 3.7% over the past 60 days. BlackRock currently carries a Zacks Rank #3.\n\nWhy Haven’t You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nMarathon Digital Holdings, Inc. (MARA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9KT2ZnNVRrZ3NiYXlacXRJd0VIbmRfNkNrdVl1Z1djdExZd3JJV2h0Mjh4VllRUExvSUJXcS1TdDkwWVR0R212bFJqQjRPcWxLaDdvSzREOUxGXzdRTS1LdUJpU3MydEdRZ1FhdUF5bVBHUGI3U1dHOVZB0gF_QVVfeXFMUDJrTXYzUm44Ym5oU0V6U2lNTHItcnk2dFBrRzRUTGFvMDhtWDhQRm9KSnJ1dlZTLXFuUnBxR2hvU3BHMGdqMkdRNlQzWUNlWlp2TEE4eXJmdUlWTi1KZlJ5YzExR1V0M3FRVEhjM2NfNUZ6WW1laDhQZkZ5blhDMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Approaching $4K First Time Since Late 2021 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nThe Ethereum (ETH) cryptocurrency is nearing the $4,000 mark for the first time since late 2021, according to the latest data from CoinGecko.\n\nCurrently priced at $3,980, Ethereum's ascent is in line with a broader uptrend in the cryptocurrency market, mirroring the movements of Bitcoin to some extent.\n\nThe crypto king has once again surpassed the $68,000 level, and it appears to be on track to hit a new record high.\n\nThe crypto market is also being propped up by an ongoing stock market rally. The benchmark S&P 500 rally recently hit a new all-time high.\n\nAdvertisement\n\nGrowing profitability\n\nAccording to recent data provided by IntoTheBlock, 94% of Ethereum holders are making money at the current price, with only 6% at breakeven and none in the loss zone.\n\nAn in-depth look at Ethereum’s global in/out of the money indicates that a majority of addresses (94.3%) are \"in the money,\" meaning they would profit if they sold their holdings at the current price. Interestingly, there are no addresses \"out of the money\" at present, and 5.70% are \"at the money,\" hovering around the break-even point.\n\nThis data indicates that the Ethereum market is currently experiencing a bullish phase, with most investors sitting on potential gains.\n\nThe detailed breakdown of addresses bought at various price points further displays the market's optimism, especially for those who invested when prices ranged between $3,381.23 and $4,579.78.\n\nEther's market dynamics\n\nThe price correlation with Bitcoin stands strong at 0.97, highlighting the interconnected nature of the two leading cryptocurrencies.\n\nThe holders’ composition by time held shows a stable investment pattern, with 75% holding for more than a year, 21% between one month and a year, and a mere 4% for less than a month.\n\nIn terms of transaction demographics, there is an almost equal split between the West (51%) and the East (49%), with transaction volumes exceeding $58.49 billion over the past week alone, reflecting robust market activity."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOOTZRQW9oV3dUVndIc1ZXbjhhZzNOZUFFS21RSklFUm1aZTZmYVZqRXh2YXhsMTZKNE5WMzdudjJpSjZUX3hZSDBPbEJwUVRWMEdOU2tKeDdmVk9lQkNMaEgtMktad0Z1UE9rM0NINzJmY0lobjNjMTRwVXU1U21DNVRCNDl0RXlVWEsyN0Zhc2JCenJJdmNVZ2VBN2VjaGxxb1Bz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Proof of Stake cut $21 billion ETH from circulation as deflation falls to 1.4% - CryptoSlate",
        "content": "The Ethereum network has seen a reduction of 417,413 ETH in supply since transitioning to a Proof-of-Stake (PoS) consensus mechanism in September 2022, per data from ultrasound.money. In the 540 days since The Merge, 1,509,991 ETH has been burned while the network has issued 1,092,578 new ETH, resulting in a net decrease.\n\nAs of press time, the market value of the ETH removed from the supply stands at $1,653,797,635, marking an annual inflation rate of -0.23%.\n\nIn contrast, Bitcoin’s supply has grown by 1.716% over the same period. This highlights the divergent monetary policies of the two largest cryptocurrencies, as Bitcoin maintains a predictable issuance schedule. At the same time, the balance between staking rewards and transaction fee burning now determines Ethereum’s supply change.\n\nA Proof-of-Work (PoW) simulation on the ultrasound.money dashboard shows Ethereum’s supply would have increased by over 5.5 million ETH during the same period had the network not shifted to PoS. Under the PoW model, the simulation indicates 7,031,556 ETH would have been issued with the same 1.5 million ETH burn rate, leading to a net increase of 5,521,564 ETH since The Merge. The value of the ETH issued under this simulation would amount to $21,865,393,440, representing a theoretical inflation rate of 3.26%.\n\nThe stark difference highlights the deflationary impact of Ethereum’s new consensus design compared to its previous mining-based system. The transition to PoS has significantly reduced new ETH issuance, as validators staking ETH now secure the network instead of PoW miners. This shift, combined with the ongoing burn mechanism introduced in EIP-1559, has put downward pressure on Ethereum’s supply growth.\n\nAccording to the real-time data, Ethereum’s total circulating supply currently stands at 120,103,624 ETH. Meanwhile, the PoW simulation estimates the supply would have reached 125,625,188 ETH if miners were still powering the network under the old model.\n\nThe supply reduction since The Merge aligns with the Ethereum community’s vision of making ETH a deflationary asset over time, diverging from Bitcoin’s fixed inflationary schedule. Proponents believe the combination of staking rewards and fee burning will continue to offset new issuance, potentially leading to net negative supply change periods.\n\nOver the past seven days, increasing ETH network fees has facilitated an uptick in deflationary behavior as it rose to -1.435%. Moreover, even under PoW, its inflation rate would have fallen to 1.911% due to the surge in network activity and its correlation with the burn mechanic.\n\nHowever, critics argue the move to PoS has centralized control of the network in the hands of major staking entities and exchanges. Some warn that the concentration of staked ETH could undermine Ethereum’s decentralization and security guarantees, in contrast to Bitcoin’s more distributed mining network.\n\nAs Ethereum continues to evolve under its new PoS regime and Bitcoin maintains its established PoW model, observers will closely watch how their respective supply dynamics and security trade-offs unfold. With Bitcoin’s issuance about to half due to the upcoming halving, its inflation rate will drop to 0.8%, which is within 1% of Ethereum. Bitcoin, however, has a fixed supply and will eventually have an inflation rate of zero. Ethereum’s inflation rate is tied to network activity and the amount burned through network transactions.\n\nStill, the deflationary trend in ETH over the past 540 days offers an early glimpse into the potential future of the two largest cryptocurrencies ahead of the first Bitcoin halving since The Merge. The long-term sustainability and implications for both networks remain to be seen, with Bitcoin currently thriving at a $1.3 trillion market cap and Ethereum next in line at $478 billion.\n\nMentioned in this article"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPaUtFLWJxT05BVm9jT3VVLXQwLVlYeVR0ZHg1aDN6a202RUNFTWgteWl1MEM5S1JRcVBNV3hSU0gtWXlCeVBWV0dkWXFNdUJjNzIyNmpMY0thMXdvVHNMS1dMNmM1STZYS3RkT3VnUFhRbjdsSjNBMk04anEtRHo4RGtVWFJhSXd2MmExRzZxa0pvVVJHUElWMktoSE9sNWFubVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "How Much Will the Dencun Upgrade Really Reduce Ethereum Layer 2 Fees By? - Unchained",
        "content": "Ethereum’s Dencun upgrade is scheduled for next week and is set to reduce fees on layer 2s by at least 10 times, if not more.\n\nEthereum’s Dencun upgrade is set to dramatically reduce fees on layer 2s when it rolls out next week.\n\nIn less than a week’s time, fees on Ethereum layer 2 networks are set to be reduced dramatically, thanks to Ethereum’s Dencun upgrade.\n\nScheduled for March 13, Dencun is the next major upgrade on Ethereum’s ambitious multi-year roadmap to reduce transaction fees, increase security, and future proof the network. At the heart of Ethereum’s scaling plan are layer 2 solutions, which help reduce the load on the network.\n\nThe Dencun upgrade includes a highly-anticipated improvement protocol EIP-4844, also known as “proto-danksharding,” that benefits layer 2 rollups that bundle together transactions and post them as a single piece of data to Ethereum.\n\nAfter the upgrade, instead of rollups needing to use calldata to post transactions to Ethereum, which is costly and makes up around 90% of the gas fees required to post bundled transactions, layer 2s will now be able to use a highly optimized and much cheaper transaction type called “blobs.”\n\nOn X last Saturday, Ethereum founder Vitalik Buterin noted that 125kb of calldata costs around 0.06 ether ($231.27), while users on the prediction market Polymarket expect the gas price of an equivalent-sized blob to be 0.001 ether ($3.93), which is a cost saving of around 60 times.\n\nPolymarket is predicting that blobs (~125 kB) will cost ~0.001 ETH. Today, 125 kB calldata costs ~30 gwei per gas * 16 gas per byte * 125000 gas ~= 0.06 ETH And if you think polymarket's guess that blobs will be 60x cheaper is over-optimistic, you can use the market to hedge! pic.twitter.com/vUwJInNhCP — vitalik.eth (@VitalikButerin) March 3, 2024\n\nAll Bets Are Off\n\nAround 36% of users betting on the topic on Polymarket believe a blob will cost less than 0.0001 ether ($0.39), while 33% think it will be between 0.0001 ether ($0.39) and 0.001 ether ($3.93).\n\n“There’s a pretty wide range of views, even on the prediction markets, as to how big the reduction will be,” said Ed Felten, co-founder and chief scientist at Offchain Labs, the research and development firm behind Ethereum scaling solution Arbitrum.\n\nThe lack of historical pricing for blob gas, which is the gas consumed by transactions that make use of blobs, makes it difficult to predict with certainty how much an average transaction will cost, said Luke Nolan, Ethereum research associate at digital asset investment manager CoinShares. He points out that even the layer 2 rollup Optimism uses Polymarket’s predictions as a midpoint estimate within its saving calculator.\n\nPredicting the price can be a dangerous exercise, said Nicolas Liochon, founder of Linea, an Ethereum layer 2 blockchain bootstrapped by Consensys. The real price will vary based on demand, he said. At the price levels predicted by users on the Polymarket, many external actors may want to use this blob space and, more broadly, activity on rollups is increasing dramatically, he added, which are both factors that could influence the fee reduction.\n\nConservative Estimates\n\nCoinshares’ Nolan agrees that transaction fees are unlikely to be sustained at a level of 60 times cheaper than in the current system if demand is high for blobs. As a conservative estimate, it’s more likely transaction fees will be reduced by 15 to 20 times, he added.\n\n“There’s a good likelihood it will be a 10 times or more reduction, but I wouldn’t bet my life on that,” Felten said. “It could easily be less.”\n\nSeveral layer 2s are predicting a reduction factor in fees closer to six to 10 times, which was stated at various ETHDenver panels, said Toni Mateos, co-founder and chief technology officer at LAOS network, which is a layer 1 blockchain deployed as a parachain within Polkadot.\n\nRead More: Top Takeaways From ETHDenver\n\nAverage layer 2 gas fees have ranged from $0.15 to $0.60 this year, according to a blog post from Lucas Outumuro, head of research at crypto market intelligence platform IntoTheBlock. He also estimates that costs will be cut by at least 10 times, thanks to the introduction of blobs.\n\nOn Base, the new Ethereum layer 2 from crypto exchange Coinbase, transaction fees are expected to decline from double-digit to single-digit cents, said Roberto Bayardo, a core developer at Base.\n\n“Fee reductions will vary depending on how aggressively the layer 2 chains take advantage of blob data,” Bayardo said. “We expect Optimistic rollups, like Base, to benefit the most, since they can aggressively compress transaction data stored in blobs, and otherwise have minimal layer 1 gas costs.”\n\nFor Morph, an Ethereum scaling solution that looks to combine the strengths of Optimistic rollups and zero-knowledge technology, its aim is to have as many layer 2 transactions as possible in a blob to share this cost. Test results show a range of 50% to 90% improvement in costs under different transactions-per-seconds and optimization methods, said Ender Lu, chief technology officer at Morph.\n\n“The cost of one blob remains fixed, regardless of whether it is fully utilized,” Lu said. “For example, whether you put 100 or 1,000 transactions into one blob, the gas cost remains the same.”\n\nLayer 2s with high activity levels will have an advantage, said Linea’s Liochon. Chains which can delay posting to maximally fill blobs to capacity will see the greatest cost reductions, while lower traffic chains may not have this flexibility, Bayardo said.\n\nEthereum Layer 2s that don’t use Ethereum for data availability, such as side chains or Plasma chains, won’t derive significant benefits from this upgrade, Lu said.\n\nA Waiting Game\n\nThere’s also a whole series of unknowns that will only be fully understood once the upgrade is rolled out and people’s behaviors adapt, Offchain Labs’ Felten said.\n\nDifferent layer 2s will have different policies around how they will pass any cost savings from fee reductions to users, LAOS Network’s Mateos said.\n\n“Layer 2 fees don’t necessarily correlate directly with submission costs to the layer 1,” Mateos said. “This fact varies by layer 2, some of which subsidize part of their costs to gain traction.”\n\nIt’s also unclear whether block builders, which are validators that construct blocks on the network, will require tips to include blobs and whether those costs will get passed back to the users, Felten said. And there’s also uncertainty around how much traffic will come to rollups as a result of the fee reductions and to what extent increased traffic pushes prices back up, he added.\n\n“After the upgrade, it’s important to not think after 12 or 24 hours that we know what the future will be,” Felten said. “It’ll take longer than that to really learn the full impact of it.”\n\nStill one thing remains certain, and that is that blobs are going to be much cheaper than calldata, Coinshares’ Nolan said.\n\n“Even a big uptick in this blob gas price means that it will always be cheaper to use blobs as opposed to calldata, no matter how much pent up demand there is,” he said."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5uaF9oQU40bl9Vbl9lZUlISlMwUElVMDJOei1kbl9uNTBSTWthSV9PTGYwdkk4LVMwYnd4NGptcDNyQjEwNVAybi16N1pFMEFVVnZkZHo3b0F5bEJoVzBXUm8xb0RyN0VXUkJGQw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 21:15:51 GMT",
        "title": "Coinbase met with SEC over spot Ethereum ETFs - Blockworks",
        "content": "Coinbase met with officials at the Securities and Exchange Commission to discuss Grayscale’s proposed ether ETF.\n\nAttorneys from Davis Polk, who represent Grayscale, were also present according to documents from the SEC. Various members of the SEC’s Division of Trading and Markets were present.\n\nA presentation from Coinbase was given at the meeting, though it’s not clear what else was discussed. In the SEC’s meeting disclosure, the agency included the Coinbase presentation in its filing.\n\nPer Coinbase’s presentation, shares of a potential ether ETF would be categorized as commodity-based shares, the same as the bitcoin ETFs.\n\nRead more: Ether is the Schrödinger’s cat of crypto\n\nCoinbase also said, “spot markets for ETH are highly indicative of a market resilient to fraud and manipulation.” Coinbase also said that it’ll have a surveillance-sharing agreement in place with the CME to “assist in surveilling for fraud and manipulation.”\n\nHowever, the meeting may not be a “good sign,” according to Bloomberg senior ETF analyst Eric Balchunas.\n\nRead more: Ethereum spot ETFs are next\n\n“Normally I’d say this was [a] good sign but as far as I know the Staff has not given any comments yet to the issuers, which is not a good sign as we [passed] when they gave comments on btc ETFs. Further, there’s no court loss hovering over,” he wrote in a post on X.\n\nLoading Tweet..\n\nBloomberg analyst James Seyffart said, “no comments so far isn’t a great look.” Earlier this year, Seyffart told Blockworks that he believed there was a 60% chance that the SEC would greenlight the ETH ETFs in May.\n\nThe Coinbase presentation also included data to show that the ether futures markets and the spot markets are as strong as bitcoin markets, a fact that ETF Store president Nate Geraci pointed out on X.\n\n“I’m not sure what grounds for disapproval of spot ether ETFs would be,” Geraci added.\n\nLoading Tweet..\n\nEarlier this week, the SEC delayed decisions on BlackRock and Fidelity’s spot ETH ETF applications. The delays were expected, however, with experts saying that the SEC will decide on the ether ETFs in May.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQdXp4eFFHWFZsQmtxWnViZnVIVlpJRzJRcUNBbjBnUWlVMW1vRUNHYlBrS3VwNGU2dWVEMjJvMFhObm56dXVFV1JLVnJQQVJWaEZZZ2JyMWRjWWY2R0RzWjZTWUNyMXNZQzdBQ0ZKRjU0eDNXaEtLWVNiR05YOWlaNE1VVkRNeDg5TFAyNjVqQmFVVHFxY0N3WnRaSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Has Ethereum’s $54bn liquid staking industry become too big? - DLNews",
        "content": "Researchers at the Ethereum Foundation warn that liquid staking protocols could soon control most Ether in circulation.\n\nBut their recent proposal to stem the growth of these protocols could harm solo stakers, critics warn.\n\n“We think there’s an emergency, and we basically wanted to have this as a conversation starter,” one of the researchers told DL News.\n\nA recent proposal to cut the amount of newly issued Ether was meant to stem the rapid ascent of Ethereum’s $54 billion liquid staking industry.\n\nBut critics, some of whom represent those very liquid staking projects, say it would have the opposite effect and pose an existantial risk to solo stakers who give the blockchain its greatest claim to decentralisation — a key feature for software intended to function as a sort of distributed world computer open to everyone.\n\nStaking is to Ethereum what mining is to Bitcoin. It’s the process that simultaneously creates new Ether, confirms and orders transactions, and provides economic security against those who would try to seize control of the blockchain.\n\nFor years, researchers have warned that the system has a flaw: Liquid staking protocols, which lock up, or stake, Ether on users’ behalf, could gain control of most of the Ether in circulation and, in turn, undue influence over the blockchain itself.\n\nLast month, a pair of researchers at the Ethereum Foundation warned that the time to act was closing fast. They proposed a simple but profound change: a modest decrease in the amount of newly issued Ether.\n\nThe change would lower the return on staking and discourage new entrants, who have overwhelmingly entrusted their Ether to large institutions or protocols rather than stake Ether themselves.\n\nCritics counter that it would have the opposite effect: By reducing the yield on staking, only the largest and most sophisticated operators would find it worth the trouble.\n\n“A proposal like this, if implemented, would essentially end solo staking,” Valdorff, a pseudonymous contributor to Rocket Pool, an Ethereum staking protocol, wrote on an Ethereum research forum. “Making staking profits marginal will ensure that the only validators left are those that are most effective at extracting value.”\n\nJoin the community to get our latest stories and updates\n\nEthereum Foundation researcher Ansgar Dietrichs, one of the proposal’s authors, said the proposal was meant to inspire a much-needed debate. He lamented that he’s seen few counterproposals since its publication on February 21.\n\n“We think there’s an emergency, and we basically wanted to have this as a conversation starter,” he told DL News. “I think we still have a ways to go to make this a productive conversation.”\n\nThe rise of liquid staking\n\nStaking offers a modest annual yield. On Thursday, that yield was just under 4%. That is often lower than the return investors can earn elsewhere in DeFi, for example by lending their tokens.\n\nStaking data firm Rated has called solo staking “the backbone of Ethereum,” and estimated it accounted for 6.5% of all staked Ether. Ethereum.org, a community-run website dedicated to the blockchain calls it the “gold standard.”\n\n“It provides full participation rewards, improves the decentralisation of the network, and never requires trusting anyone else with your funds,” the website reads.\n\nBut the share of Ether staked by people operating out of their own home is decreasing, according to Nixo Rokish, head of EthStaker, an online resource for solo stakers.\n\n“That is absolutely going down, because most of the new stake is going into liquid staking protocols,” she told DL News.\n\nBut staking is expensive — it requires 32 Ether, worth more than $124,000 on Thursday — and technically challenging.\n\nLiquid staking protocols make the process easy, by staking Ether on users’ behalf. Additionally, users can typically deposit any amount of Ether to liquid staking protocols, which batch deposits into the increments of 32 Ether required by the blockchain.\n\nFurthermore, liquid staking protocols address the opportunity cost by issuing IOUs for staked Ether. Those IOUs — known as liquid staking tokens or liquid staking derivatives — can then be used across DeFi in lieu of Ether, a win-win for Ethereum and for users leery of locking away tokens when there are more lucrative ways to use them.\n\nSeveral years ago, Ethereum researcher Danny Ryan warned that most Ether could eventually end up in a single liquid staking protocol. If that were to happen, the people who govern that protocol would have outsize influence over the blockchain, with the ability to confirm and order transactions as it sees fit.\n\nStaking has surged since last spring, when an upgrade to the blockchain enabled the withdrawal of staked Ether, removing the biggest risk associated with staking. As of Thursday, more than a quarter of all Ether in circulation had been staked, 38% of it through liquid staking protocols including Lido and Rocket Pool, according to pseudonymous data analyst Hildobby.\n\nLiquid staking derivatives are the biggest business on Ethereum.\n\nThere are now more than three dozen liquid staking protocols on Ethereum, according to data from DefiLlama. A growing number of stablecoins are accepting liquid staking tokens as collateral. And new Ethereum-based blockchains such as Blast are incorporating staking to offer users passive yields on crypto deposits.\n\nDietrichs and his co-author, Ethereum Foundation researcher Caspar Schwarz-Schilling, argue that it won’t be long before the vast majority of Ether is deposited in liquid staking protocols.\n\nIf that happens, liquid staking tokens such as Lido’s stETH or Rocket Pool’s rETH would become de facto money on Ethereum, supplanting Ether as the asset with the greatest liquidity.\n\nIt’s a risky state of affairs, they argue.\n\n“People are calling [staking] the risk-free rate of return or something on Ethereum. That’s not the case. Staking comes with risk, it’s supposed to be an activity for sophisticated parties,” Dietrichs said.\n\n“It’s almost analogous to the financial crisis of 2007 … where we just kept adding intermediary layers until no one understood that there was any risk under the hood,” he said.\n\nIdeally, Ethereum’s distributed team of developers would cap the amount of Ether that could be staked. That would need further research, however.\n\nA more modest solution would involve reducing the creation of new Ether in order to curb the appeal of staking. If implemented today, it would reduce the yield on staked Ether from just under 4% to about 3.5%.\n\nThe change could be included in a forthcoming Ethereum upgrade with the codename “Electra,” which is expected to be implemented in nine to 12 months.\n\n“This Electra proposal was really mostly meant to try and keep as many doors open as possible,” Dietrichs said. “Because what we’re concerned [about] is if we do nothing, and we keep having the staking ratio rise quite a bit, it’s going to be really hard to come back down.”\n\n‘Worse than doing nothing’\n\nStill, others thought that would “kill solo staking.”\n\n“I think that the proposed solution is worse than doing nothing as it just pushes staking to centralised operators that hold the most ETH by default,” Lefteris Karapetsas, founder of Rotkiapp and a longtime Ethereum developer, wrote on X, echoing comments from Valdorff and Lido engineer Dmitriy Gusakov.\n\nRokish said some critics might have another motive.\n\n“If you look at the people who are actually pushing back, those people work for protocols that depend on an infinite number of stake coming in, like DVT protocols, Lido, Rocket Pool,” she said, using the acronym for distributed validator technology.\n\n“All of these people are using solo stakers as an excuse to push back against this.”\n\nNevertheless, Rokish doesn’t believe the proposal is “robust enough or serious enough to be considered for inclusion.”\n\n“[When] messing with monetary policy, there better be a whole lot of research behind it, and it better not set a precedent of, like, tinkering with things that we don’t fully understand,” she said. “But I do think that the research needs to happen. And it’s kind of urgent at this point.”\n\nSome of the criticism is valid, Dietrichs said. But solo stakers have come to him to voice their support, and he still wants to see Ether issuance curtailed with Electra.\n\n“It’s a small hit [for solo stakers], but [it’s] actually stabilising things for them,” he said of the proposal.\n\nMeanwhile, he welcomes the debate, but hopes critics will produce their own counterproposals.\n\n“In a way, it’s good that it’s a little bit heated, the conversation around this, because it shows that people actually care,” Dietrichs said. “I would be more worried about the state of Ethereum if basically no one had an opinion.”\n\nAleks Gilbert is a DL News DeFi correspondent based in New York. Email him at aleks@dlnews.com."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNX1JDVU1Nd3p1aDlma09qVXdFWUFKTDhkdEpJNFNoamhxczRsX0FTdTl4c1Z1WVFZOXQtOGNlOFFuQkVTUllyM1R4bGF5OThyX3A0alpOa1RudVRwdXJXUERYVWJBZFVwT2V2UkpaaThVVl9FaG50ckxZQThzSFZwNlMzNndhOUpsSjVka1pCb2xHNW1QNkVlRHN2R0ppdlpPdEVTXzF0SzNiZGp2UDBtRVJIb1NCRENNUURMZFdQTTItcFU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Bullish $34 Billion Signal Appears after $4k Rally - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOVG8tOFRJS1dVWW96Q1pVOEkwS0ZQSWZ4TnRHekxQM0hQbUtYTVVkQjl3aTNmZURUbVZOMGltN2ZYeVJsLTBYSzN3Z2U3Yi12RW9LdkM2YW5zVndSdzkzSXF5ZV9RNXp0bHJMTkMwTnZUTldyS1dmOTdWU1pQRDZmUtIBhgFBVV95cUxQQmp0V05jaW52QXZLYXplZkdiSzZVQmtUZ1BrZWpwVlRhM0wtOHN0MHlYeElvOVNmSUNoaWRjMW95Mi12VmRaTmltQWo3dzFkaDlnbFk2REhtLUktZTc2WXdDdE9lV1M3VUtlYlRBd245cXVQeGFRakJQWHdXM1F4UDJPMU5mdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum is surging – Does that mean alt season is finally here? - AMBCrypto News",
        "content": "Capital is rotating into other altcoins led by ETH.\n\nEthereum’s TVL increased by 73.78%, indicating high altcoin interaction.\n\nEthereum’s [ETH] rise above $3,900 could be the catalyst that changes the market dynamics and helps altcoins climb higher than they have.\n\nEver since Bitcoin [BTC] hit a new all-time high, ETH has been outperforming it. This brought about the notion that Bitcoin’s dominance might have taken a step back.\n\nWhenever this happens, ETH’s price performs better. But the second most valuable cryptocurrency is not always the only beneficiary of this flipping. Most times, profits gained from ETH and BTC increase flow into other altcoins.\n\nETH is set to kickstart the ride\n\nAMBCrypto analyzed on-chain data from Santiment to check if it was the case this time. According to our analysis, we observed that capital has been rotating into other cryptocurrencies. Some of these include Render [RNDR], Fetch.ai [FET] and Fantom [FTM].\n\nWe arrived at this conclusion after assessing the whale transactions valued over $100,000. At press time, these large transactions have been occurring since the 5th of March.\n\nBut the ones recorded in the last 24 hours have been enormous, indicating that the much-anticipated altcoin season was here.\n\nAltcoin season is a terminology used to describe a market boon when other cryptocurrencies outperform Bitcoin. But something AMBCrypto noticed about the aforementioned cryptocurrencies was that they were all ERC-20 tokens.\n\nFor those unfamiliar, ERC tokens refer to fungible assets created on the Ethereum blockchain. Therefore, one can conclude that there was high interest in ETH and other assets linked to the network.\n\nIf capital continues to flow into these assets, other tokens built on Ethereum might follow. How about the Total Value Locked (TVL)?\n\nAssets locked proves that it’s time\n\nAccording to DeFiLlama, Ethereum’s TVL was $55.30 billion. This value represents a 73.78% increase in the last 30 days.\n\nThe TVL is an indicator of a protocol’s health. When it decreases, it means the protocol lacks an inflow of liquidity. This could also mean that market participants do not trust the blockchain enough to produce good yields.\n\nOn the other hand, an increasing TVL suggests that participants perceive the project to be trustworthy. Thus, the network enjoys a wave of capital flow which improves its health. This was the case with Ethereum.\n\nIf participants continue to bridge assets into Ethereum, the TVL might close in on its previous all-time high.\n\nRealistic or not, here’s FET’s market cap in ETH terms\n\nA rise toward $106 billion could also affect ETH’s price. Should this be the case, ETH could rise past $5,000 at the peak of the bull market.\n\nAlso, other altcoins might not be left out. For instance, FET, which has seen a 377% 90-day increase might trend higher. FTM’s price might also rise in the $3 direction while RNDR’s price could also swing upwards."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPcDNUX3Q5b1lfZ2s2TFdmNnR4cENiR3FJdVR0RmtYVUlUV0hDODcwU3NNMEY0aWhkR24tVHZFUnZCNXdhcC1kUHdGdGZ1WktRZmd0bUE0anlzQ2RXQUlQclM5aERNMG0xdFdLUTRiWEtwYXloUEFYaFI4dVo1cVFweW1jZ1VaUmZkd1VkN1htWnpUbHlzcUtFQ1NQbUk5LURIbmw1bDY4Rlh2YkRTNjVOQWFFbDRrclZjT3hyT3R2SzBLWXPSAcgBQVVfeXFMTlY1U0RlbHhXRXUxT1JWZWU2TzZ1X1NwLVBleS00bFJUR24yR0l4WlQ0cndSVmlxSnpkdHRzazlONExIVFJDLTU4bnE0dmE3dUVjcFdwLXFvWlFxb0hMbEtraE5nYUFsVDhCenREaVhKVE1ONmZOVVJTNURtZjNFSnRFQkljUmhwREFhZUZRM20zUHJtYlBqMG80WmhlajZpMG10RzJwaUdhZGhENU5HT3lrWEdzQ2Z6V05CUGdsOE92YUR2WHJOUHI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Meme Coin Frenzy Drives Ethereum Network Fees to Nearly 2-Year High: IntoTheBlock - CoinDesk",
        "content": "Fees on layer 2s, designed to scale the Ethereum network, also surged, with transactions costing as much as $1 on Arbitrum, the highest since 2022, the report said. This issue has a quick fix though with the Dencun upgrade coming up next week, which is expected to lower transaction costs on layer 2s to cents."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTE9KYVN4cnFaaEFpbDd5OVBKSURhbnVhV2ZyZ05YNGptcGFwY1FjSjF2STdJRG03REJ6cGJzdUpDd3VpYUNRUE9HbV8zdElkVDJkNXRjZm5ucE9fUkk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Ethereum hits $4K for first time since December 2021 - Blockworks",
        "content": "Ether has crossed $4,000 for the first time since December 2021.\n\nETH has been on a run this week, following bitcoin hitting a fresh all-time high. It’s up nearly 16% in the past seven days, according to CoinGecko, and up roughly 157% over the past year.\n\nThe all-time high sits at $4,878, per CoinGecko. ETH’s market cap sits at $478 billion.\n\nEthereum’s Dencun upgrade is scheduled for March 13, according to the Ethereum Foundation. The upgrade is set to introduce proto-danksharding to the Ethereum blockchain, meaning that rollups under EIP-4844 can add “blobs” of data on a beacon node.\n\nRead more: CFTC’s Behnam says Prometheum’s ETH stance could create inter-agency conflict\n\nBitcoin, earlier this week, carved out a new all-time high, topping $69,000. Bitcoin’s positive momentum follows the launch of the spot bitcoin ETFs.The funds, which received official approval from the Securities and Exchange Commission earlier this year, have seen a lot of volumes and flows — both in and out — showing investor interest in the products.\n\nAs Blockworks previously reported, net inflows to spot bitcoin ETFs hover around $9.4 billion so far.\n\nThe SEC is currently mulling similar ETFs that would hold ETH, though a decision on such funds has yet to be made. BlackRock, Fidelity, Ark 21Shares are some of the companies that have proposed such funds.\n\nIn February, Ark 21Shares amended its filing to include potential language around staking, though it’s unclear if the SEC will allow the proposals to include such language if they decide to approve them.\n\nA decision on the funds is expected in May. Bloomberg analyst James Seyffart told Blockworks earlier this year that he believes there’s a 60% chance the SEC approves the funds in May.\n\nEarlier this week, the SEC delayed decisions on the proposals from BlackRock and Fidelity.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQV0pKZ2w0UFhVOFk5WVBjTFhjOTdHZ2dxbGdCZ3dMYm9hTmxHekcwR1pRa293a2U0aW5ZWTJNZGVVallHYnJ1WHBJeUcyeFd0RGt0aV9UclZ4UWpvM0w4eDJFQmNNcTA4TTh2UjAydnRHWS1IWXR6V1NVdkdYdXZuUjM5SS1CUXIzM1M4OVd1azBac2F0VWRoMTQ2TFnSAaIBQVVfeXFMTWlXODRJczNYNmhxSFNTc2hqMC0xUTFlR2ozb0dNY0RHWHpRYzhtbGg2OGlEYkh2RDRfbVhPeHhENGdMdWY0bkh4U1J1LU4zSmtKcjVPeTlPajNIQ2hYSTJjT0pNclhqRVhzQWlLdmVPUWpYdGJNRXBzbmg2ajFlZGxra0Z1UDZxdXBzdUFpbTVadHUtQ3VyOHF4N0lrUk5QNmZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Ether Hits $4K for First Time in More Than Two Years - CoinDesk",
        "content": "Ether Hits $4K for First Time in More Than Two Years\n\nThe second-largest cryptocurrency last surpassed that level in December 2021.\n\nBy Lyllah Ledesma Mar 8, 2024 at 3:34 p.m. UTC\n\nElection 2024 coverage presented by Stand with crypto"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxNNzlMaVRSN2FDSllSZnliU0lKRnNOVHBaem5Qd2V6SVZjdTJsRlhRUHBGYktSS29tVzl0T29DUDVGaUZYS3dPbTZ1M3UxMHJxWVFDNlIwUDlJVHRkVFp4bTRLN2FBSEs2bm9mN1pRaXgtSU1SOHpfWW5icWRSSjJUZy04UzhreVdlTzZsUHFnSGVrWWlscjA2SlVHaXQtMzZmR3BIVlNscVRocE9meEFoTk5JRk5nb2pJcS1iV3I4b0VkTFdwTXVJZ3RrNNIB0AFBVV95cUxQU1gtX0JnUWl6ejZJSDFXbXdlZW1GbGdFUW1zQ182bllwLUkyQkxRdGxudmptTkFDVmZ4MjVjUksya19fV3FtMnZzd3ZYTW5ValpqcEVrbVl5aDZZclZCLVM0SEFmQWN4SmlDT25JWHA3aWJUQWpFZkJWd3oyVk9vSmFMaGxkS0tERERvV2pSU2JiUk9ZS0dtM1F0WkJZSFVQQTJvQV9Bc0l6X3F2cVlsZC1Db0Fwb0Y5SThGejJwX2ppbG1NTmh6TjBmNW5GUXFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "SHIB's 106% Move Higher Led CoinDesk 20 Gainers Last Week: CoinDesk Indices Market Update - CoinDesk",
        "content": "Meme coin shiba inu (SHIB) continues to see outsized gains among the CoinDesk 20, more than doubling in value so far this week and now up nearly 2.5x month-to-date. Bitcoin cash (BCH) and ethereum classic (ETC) have also emerged this week as outperformers, up 38% and 28%, respectively."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBuZnFjUFM1UnRlTFZmVTFfbkRVX2puS3VSVFhLcVdrZGJ4Tk82NnFRNXJlSFI1UWF6bnlQRkRaMHZhWFp1WF8tV3NMdHJta2R1eVk4WGExR24za19iUkNlcnJMaHo5RUhm?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Inside Ethereum’s EIP-4844 Magic : Blob Revolution - TronWeekly",
        "content": "With less than a week left until Ethereum’s Dencun upgrade goes live, anticipation is growing for the upcoming changes. Ethereum developer Tim Beiko shared insights on the main component of the hard fork—EIP-4844, also called “proto-danksharding.” EIP-4844 introduces blobs, a temporary data storage mechanism that frees up space in the mainnet. Carrying a payload of 128 kilobytes, data blobs allow rollups to process more transactions at a lower cost.\n\nEIP-4844 creates a new blob gas market to address scalability issues on ethereum by creating space for “blobs” of data, which can be used by L2s for settlement instead of calldata. This is expected to reduce fees for L2s.\n\nThese are stored in the beacon chain or consensus layer and not on the execution layer and get automatically deleted in a few months. So, the question arises if the upcoming EIP-4844 will reduce congestion and gas fees on the mainnet. Or, are Ethereum rollups [Layer 2 scaling solutions] the only ones that will benefit from data storage in blobs?\n\nInside Ethereum's EIP-4844 Magic : Blob Revolution 3\n\nOn average, 16 kilobytes of block space are utilized for Layer 2 data for seven days. Given the size of each blob [128kb], the goal is to have three blobs per block, with a maximum allowance of six blobs per block. Layer 2 fees, associated with off-chain scaling solutions, will be notably reduced. This surplus capacity contributes to a reduction in the gas price on L1, which is the main Ethereum blockchain.\n\nEthereum Poised To Break All Records\n\nThe Dencun upgrade combines changes to both Ethereum’s consensus and execution layers. Within the 9 protocol changes outlined in EIP-7569, Tim Beiko highlighted the following three:\n\nEIP-7044: Perpetually Valid Signed Voluntary Exits\n\nEIP-7045: Increase the Maximum Attestation Inclusion Slot\n\nEIP-7514: Add the Max Epoch Churn Limit.\n\nAhead of the Dencun hard fork on March 13, 2024, at 13:55 UTC, ETH appears to be gearing up for a major move. With the current price at $3,870, experts anticipate a potential rise to $4,000 this week. According to data from IntoTheBlock, the leading altcoin might surpass its previous peak. Nearly 93% of ETH addresses are profiting from their positions. Out of the 110.95 million addresses with a positive balance in the token, a staggering 103.1 million addresses are ‘In The Money.’"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxOQmNjb0w1SVRhaUZ2QXBxdzVNOGNsOHBjLUNza1dmTGRfWWFpYXJXcjlvUUF3R0tYWUtLVUpSYmtuSmQtdkZZY3pSSG56bHdNRTZSTXU3d1BoVkJmdHQ2SnFPd0szQVpxOUlucjM0QW5nTEpMX0l5LUFFZ1ZIYzAzZGs2S0lnSmJvX0RWeG9SSUZJcEhkSmpGcHFCZWpXNWg5TTJTWG92SWRZNHVTa3h6QnZxbkZUVG82TzhFZG9CbmU3UWh6NzRaVnpUbDl0S3prbW5xRmd6cHdBaEVnb05VRlBpQnZUcFU5eUZ0R2FSZ0XSAfYBQVVfeXFMUFlKMlF1SkpvYkQtY0cyYXpJRzVhN3Jqb3BmQ19sV3B4YWFwWVZnX3BhMzNsWE91WW9EWmJtdnliLTBuMnNNTEM1ZnFsa0UxeEkwbnNGUDV5bDI1MlNlS0owTjA1b1V6QS0tWUZ2UGZVODFWX3FOOWJ0c0QxMllqbHlvUHhGZGQtbG9Qb0tnSnpjUU9Lc042TDczdzVxS2liMmJGdDhVU2dYbm5aalZBenNfRldKUXRNVF9pbVh1YnlvXzdzUmMwVHQtampqRnFNS3dsVFN0a3pWYWdzQWxucmhrQ0E0Ti1PVmdObC0zbDJERzdhU1hn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Over half a billion dollars in Ethereum has been burnt in the past month, ETH holders await Spot ETF approval - FXStreet",
        "content": "Ethereum worth $583.94 million has been burnt in the past thirty days, slashing the altcoin’s circulating supply.\n\nEthereum hit a new high at $4,012 on Binance, ahead of the upcoming Dencun upgrade.\n\nETH holders await Spot Ethereum ETF approval by the SEC, attorney comments on likelihood of approval.\n\nEthereum price hit a new high of $4,012 for the first time since late December 2021, marking a key milestone for the altcoin ahead of its key upgrade. Ethereum holders are awaiting the upcoming Dencun upgrade, the most significant development since the altcoin’s migration to Proof-of-Stake.\n\nAlso read: Ethereum price tags $4,000 on Coinbase for the first time since 2021\n\nEthereum burn picks up pace closer to Dencun Hard Fork\n\nEthereum has been under the spotlight since the altcoin hit a new high on Friday, crossing the $4,000 level, on Coinbase and Binance. The altcoin made a comeback above this level for the first time since late 2021.\n\nEthereum had a major developmental milestone when it migrated from Proof-of-Work consensus mechanism to Proof-of-Stake, marked by the Merge. The next major milestone is the introduction of proto-danksharding, through EIP-4844, one of the improvement proposals included Dencun Hard Fork, scheduled for March 13.\n\nData from ultrasound.money shows that nearly half a billion dollars in Ether have been burned in the past thirty days. This metric has significance for ETH holders since it supports the reduction of the altcoin’s circulating supply and reduces the selling pressure on Ether.\n\nEthereum burned in 30 days. Source: Ultrasound.money\n\nEthereum price gains are supported by the bullish developments in the altcoin. The next target in Ethereum’s uptrend is likely $5,000, close to the December 2021 peak of $4,936. The Moving Average Convergence/ Divergence (MACD) indicator and the Awesome Oscillator (AO) support Ethereum’s uptrend and signal that the altcoin could rally higher.\n\nETH/USD 1-day chart\n\nA daily candlestick close below the 38.2% Fibonacci retracement of Ethereum’s climb to its 2024 high, at $3,307 could invalidate the bullish thesis for ETH. The altcoin could find support at the psychologically important $3,000 level if a correction ensues.\n\nSpot Ethereum ETF approval likely?\n\nAttorney Jake Chervinsky commented on the status of Ethereum as a commodity. The attorney states that the Securities and Exchange Commission (SEC) is less likely to follow through on its classification of the altcoin as a security, since this would conflict with the Commodity Futures Trading Commission’s authority. The CFTC has labeled Ethereum a commodity and the two entities are less likely to engage in a “civil war” like situation, says Chervinsky.\n\nThe status of Ethereum as a security or non-security has a direct impact on whether the SEC approves a Spot Ethereum ETF in May, the last deadline for the applications. Ethereum holders are anticipating an approval, and a similar impact on institutional capital inflow and is likely to act as a catalyst for the second-largest asset by market capitalization.\n\n(This story was corrected on March 10 at 04:33 GMT to say that Ethereum price hit a new high of $4,012, not a new all-time high.)"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQUHlRa2pMOWItWHNqODh3aTdSMWlGazdRem0wNzUwOTZJN2pOM0JicXpCcFlrOWwyLV9mWnFBS1VwNTJ3TV9Fc3pmQ3F6SEJFSmZ5TUlvVHE5eW9jckFxdl9KcksxQ0E2SGlGUkoxNVUxaTRIbFNadWpzYTBUUWRtMC1MXzNhUVlXbU5HMHA4ZXQtaUN40gGaAUFVX3lxTE1DSVR1cFdacFA1a0FBQmlNZHc5UG5fVlhqRDZpcUpqWlcxakpCUjFlcHRWMDVZZWQ5cGtpU3RNalJONXBJa1llaElUb1lKMFlNQkdKQnJPdktzNVgxWEdyQ2Jna0xZbVJ2UWpWNi1mQ3FlMW82UW8xNndDT3BHVmdzZEppZ1A4UWRpMVljUXdiMXNDSVlBRjI3REE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum’s Dencun Upgrade Set to Drive Near-Zero Transaction Fees - CryptoPotato",
        "content": "The forthcoming Ethereum Dencun upgrade scheduled for March 13 offers a chance for near-zero transaction fees for layer 2 (L2) solution users, possibly drawing in more new ones, as per a research report by Fidelity Digital Assets.\n\nThe forthcoming upgrade marks the initial step in Ethereum’s rollup-focused roadmap. This advancement will empower the network to function as a resilient database, enhancing the efficiency and cost-effectiveness of data storage for layer 2 blockchains.\n\nDencun Upgrade to Reduce Costs for L2 Blockchains\n\nAnalyst Max Wadington wrote that the Dencun upgrade would provide the necessary scaling capability to accommodate millions of users on layer 2 blockchains, positioning Ethereum as a more suitable distributed database for other blockchains. These enhancements are anticipated to attract significantly more users to the Ethereum ecosystem and broaden the network’s total addressable market (TAM).\n\nMoreover, the upgrade is poised to reduce costs for layer 2 blockchains to store data on the main network. This cost reduction is expected to be transferred to users through lower fees.\n\nLayer 2 solutions are separate blockchains constructed on top of layer 1, or the base layer, to alleviate scalability issues and efficiently manage data. However, the upgrade is not expected to benefit Ethereum users significantly, as the fee reductions promised to layer 2 users will not extend to those transacting on the base Ethereum blockchain.\n\nWadington explained that in the short term, users seeking to capitalize on this fee adjustment would need to compromise some decentralization and security by conducting transactions on layer 2 solutions instead of directly on the Ethereum network. Hence, it will likely encourage more users to bridge assets to other platforms.\n\nThe report added that conducting transactions on Ethereum for application-specific purposes would remain the preferred choice in the medium term, especially as layer 2 platforms mature.\n\nEthereum Price Surges\n\nEthereum surpassed the $3,000 mark and surged to over $3,900 earlier this week, reaching its highest value in almost two years.\n\nInvestor sentiment reflects optimism regarding the forthcoming Dencun upgrade and the potential approval by the U.S. Securities and Exchange Commission (SEC) of Ethereum exchange-traded funds(ETFs). Additionally, on-chain data reveals that nearly $200 million worth of ETH was burned in the past week, reducing the altcoin’s circulating supply and potentially fueling further price appreciation.\n\nAccording to CoinGecko data, Ethereum is trading at $3,789, up 8% in the last week. Notably, the second crypto by market cap has surged over 60% over the last month."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTFBxeDRaOTZldWljUlhGRzJ2TlR4LWhBNGhDRnJIQlptZUZRX1BfOXVnUGt3dFVaUkVya2htX2NpN256bk9fR01iSGxodWlRX3FyelBHaVl6QndBVTBpZ1UtZFJrVHM2WmNsZzZKcVB1VlE5Z9IBd0FVX3lxTE5Sc2hmN2ZXdXNmSlFSd3hxdUtLWWRWM0QzcDh1QjZkUUhsc2JFZy1WYjhIR1hTUHpvRGtsdE03TDJDNDJ3SXRPajRrZ1E1OElRSnd2ZWRHblN5aXJnZE9peTh0eGx4UDdVT1NESlJvb29ja1U0MkR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Fees Hit 2-Year High, Here's Major Driver - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAccording to data shared by the on-chain analytics platform IntoTheBlock, the second most popular blockchain, Ethereum, has seen a dramatic increase in weekly fees. IntoTheBlock has named one of the key drivers that have contributed to this surge.\n\nThe total amount of fees collected on Ethereum has increased by 78%.\n\nEthereum fees skyrocket thanks to meme coin mania\n\nEthereum fees begin to rise when this chain that first allowed developers to build DeFi dapps and create NFTs faces congestion as too many transactions are waiting in the meme pool to be verified. When it happens, miners begin to prioritize those pending transfers for which they are offered a higher gas fee.\n\nWeekly fees on Ethereum reached their highest since May 2022, with meme token speculation being one of the key drivers pic.twitter.com/fBl2Xk2j7d — IntoTheBlock (@intotheblock) March 8, 2024\n\nOnce in a while, transaction fees on Ethereum begin to skyrocket, and over the past few years this has been largely down to meme coin trading and the high level of speculation around meme cryptocurrencies.\n\nAdvertisement\n\nFLOKI surpasses DOGE, SHIB, PEPE\n\nCurrently, ETH fees total roughly 28 gwei. The last time fees this high were noticed on May 12, 2022, and in May 2023, the fees also went to approximately the same level. On May 5, 2022, Ethereum gas fees surged to as high as a mind-blowing 196.6 gwei, according to Bitinfocharts.\n\nAmong the most popular meme cryptocurrencies are Dogecoin (DOGE), Shiba Inu (SHIB), Pepe (PEPE) and Floki (FLOKI). According to the official Floki account on the X social media platform, FLOKI has outpaced DOGE, SHIB and PEPE on the world’s largest social network for investors, Stockwits, and became the most popular asset. FLOKI here has even surpassed stocks of major companies, such as Nvidia and Tesla.\n\nPulseChain/X acquires 163,295 ETH\n\nAs reported by on-chain data tracker @spotonchain, just recently Uniswap fork PulseChain/X purchased an impressive 15,003 ETH at approximately $3,932 per coin, paying 59 million DAI stablecoins for that ETH chunk.\n\nThis was not the first lump of Ethereum acquired by this blockchain platform over the past four days. In total, it has bought a staggering 163,295 ETH worth almost $621 million. PulseChain/X is now sitting on an unrealized profit of $24.3 million in fiat.\n\nAnother 15,003 $ETH was bought on-chain at ~$3,932 using 59M $DAI by wallets linked to PulseChain/X in the past hour!\n\n\n\nTotal amount purchased in the past 4 days: 163,295 $ETH (cost: 620.7M $DAI, avg price: $3,801)!\n\n\n\nEst. unrealized profit: $24.3M. https://t.co/YAgSMo1b1X pic.twitter.com/mgDpJI44qC — Spot On Chain (@spotonchain) March 8, 2024\n\nAt the time of this writing, the second largest cryptocurrency by market capitalization value, Ethereum, is changing hands at $3,948 per coin. Since Tuesday this week, Ethereum has staged a massive 18.66% increase."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQaFdXa1pITFRnTElCc0lWZW1HRG1PVHpVc1E4dTlyR2Y2WUplalNJSkRsdkNRZ1M2cUVxNWZaTmEzZDRUNzVjei1NYlVtZ1doRTR3Q2NFbkc4NkZCNWdhYXF6TUwyaEtmTGM0dnctb3VlcWF3T3pnNlZVX2J5bzVDQjR4MDJGUnRUQ0QwY0dGdEp5bWFX0gGaAUFVX3lxTE1QUlFRaVFFSUZFZVFaSTh3QmRMb1BBVW1EMnAyeV9GemZJcDg2U3d2MkZGSEFrVDB2T2hXVndKdzVhT0VjaTBQd3JoZ0NzWHRMaE9vRk1xblJ3OEdteVl3RGpYdldvaE8tWVppWGZnYWtxd21hN21Eb1NTMTdJbE1ybEJaTDNmaHcwVTZySVlrczRSQmFCYW9zN3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Braces For $5000 Rally With No Major Pullback On Horizon - CoinGape",
        "content": "The world’s second-largest cryptocurrency by market cap, Ethereum (ETH) ,surged past $4,000 on Friday, March 8. However, the ETH crypto faced a minor pullback. At press time, the Ethereum price was trading at $3,933 with a market cap of $472 billion.\n\nEthereum (ETH) Price To See All-Time High Soon\n\nCrediBULL crypto, a prominent crypto analyst, has weighed in on the current market dynamics, particularly focusing on Ethereum (ETH) following Bitcoin’s recent achievement of tagging its previous all-time high (ATH).\n\nadvertisement\n\nAccording to the analyst, there’s widespread anticipation within the crypto community that Ethereum is the next in line to surge, given Bitcoin’s ATH milestone. Those who have remained on the sidelines are reportedly eyeing a potential pullback to the $3600-$3700 range, a sentiment echoed by many participants in the market.\n\nHowever, CrediBULL crypto suggests that such a pullback might not materialize immediately, as the demand for Ethereum remains strong. The analyst says he wouldn’t be surprised to witness Ethereum’s price surge by another 25% or more before any significant correction occurs.\n\nOn the other hand, Ethereum continues to outperform Bitcoin as we move ahead in 2024. Over the last week, Bitcoin (BTC) price gained by 10% while ETH added 15% gains in the same period.\n\nBoosted by the imminent Dencun upgrade and a bullish atmosphere from Bitcoin’s profit recirculation, Ethereum, the second-largest cryptocurrency, is gaining momentum. Analysis of the ETH/BTC chart indicates that altcoins are nearing a breakout point.\n\nAll Eyes on Dencun Upgrade\n\nIn the next week, the Ethereum blockchain will undergo its much-awaited Dencun upgrade bringing significant improvements to the network. The upcoming Dencun upgrade scheduled for this month will reduce transaction costs on layer 2 networks, stimulating increased activity and potentially drawing mainstream consumer interest to Ethereum.\n\nAnother catalyst is the pending regulatory decision on spot Ethereum ETF applications, expected in May. Although the approval odds are less certain compared to spot Bitcoin ETFs, it still brings excitement to ether, according to the Bitwise analyst.\n\nAccording to IntoTheBlock data, ETH mainnet’s revenue from network fees surged to $193 million this week, marking the highest level since May 2022 and reflecting a 78% rise from the previous week. This notable increase in on-chain activity was primarily fueled by heightened speculation involving meme coins.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNYk0xcWo5T3JmUWhzNXI4cEZOdjJLNVNRY0RPbXViSnZrWjlPeHNBVjF3T2t1TllfNl9JaDJXbXhmRzNOQXc2RnNzZ0xQbzNaWjlDa0ZjNHZJTm9GSngzTDlBcmRTVFZLeXZCREdJYkg5T0Y5Snp0LXpuUlUyMnUtS1gwOEpHeWtuVmlESWJuS3BIRF9KNExGQ0FMa2xhTzZrWHh0YlhnMHh0bmVNUll2cXQ0VUY0ckxyNXozbVdMWEnSAcYBQVVfeXFMTlZCdS1WUHNLTHIwcTJwTUVwdG1sT1hzRHV6aXctYUMxQlNXMUh2bDBQRDlQM2JlaXpTWUp4RWY3dU1sWWRvVDRIR3VTbnhuMmRRT1g5bWlnRE9QemY2SGV3STdqWVFMTUliNk1Sam5ERENlZDhRY0RSNXM1YTBwUVBCTUY0TFhka2lCcFpXSzBMQU04aXZwX2hIN0diOVlid0pnOWlSMXc3QXk4dTJuNFQ1aEV6bHBrOElqSjFlYy16NGZsM1NB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Ethereum price tags $4,000 on Coinbase for the first time since 2021 - FXStreet",
        "content": "Ethereum transitioned from a Proof-of-Work (PoW) to a Proof-of-Stake (PoS) mechanism in an event christened “The Merge.” The transformation came as the network wanted to achieve more security, cut down on energy consumption by 99.95%, and execute new scaling solutions with a possible threshold of 100,000 transactions per second. With PoS, there are less entry barriers for miners considering the reduced energy demands.\n\nStaking is a process where investors grow their portfolios by locking their assets for a specified duration instead of selling them. It is used by most blockchains, especially the ones that employ Proof-of-Stake (PoS) mechanism, with users earning rewards as an incentive for committing their tokens. For most long-term cryptocurrency holders, staking is a strategy to make passive income from your assets, putting them to work in exchange for reward generation.\n\nEthereum uses decentralized blockchain technology, where developers can build and deploy applications that are independent of the central authority. To make this easier, the network has a programming language in place, which helps users create self-executing smart contracts. A smart contract is basically a code that can be verified and allows inter-user transactions.\n\nEthereum is a decentralized open-source blockchain with smart contracts functionality. Serving as the basal network for the Ether (ETH) cryptocurrency, it is the second largest crypto and largest altcoin by market capitalization. The Ethereum network is tailored for scalability, programmability, security, and decentralization, attributes that make it popular among developers.\n\nEthereum holders anticipate a Spot Ethereum ETF approval by the Securities and Exchange Commission, by May 23, the final deadline for VanEck’s application. This is likely one of the catalysts driving gains in Ethereum. The second major catalyst is the upcoming Cancun-Deneb upgrade, also known as the Dencun Hard Fork , scheduled to occur on March 13.\n\nEthereum (ETH) hit the $4,000 psychological barrier on Friday for the first time in more than two years. This significant achievement comes as the Bitcoin price hit its new all-time high on Tuesday.\n\nThe Proof-of-Stake (PoS) token's price has been on an upward trend since October 2023 and shows no signs of stopping. This development is in line with Bitcoin’s massive uptrend, which continues to climb higher, shattering all resistance levels.\n\nEthereum (ETH) price tagged the $4,000 psychological level on Friday at around 15:31 GMT before a quick correction. The move saw over $15 million in short positions liquidated against around $10 million in long positions for ETH.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQZlFIZlMwZS1fRDJEUlZFbUUwbktIemx0XzFSRHpManhsRXlyeFlwSThWOFhGVS1IV1FhT1cybzV2MG5Xa1kyLVBVd1VwdEltWlduSng2VHRVaTU4Y2x2emVxQnA0WWNLRXM2SEZzUVNOUDNucWc4QWhjY3p1SHpSS05jLVo2aDFnTG9maXZ0aFlCSXhM0gGaAUFVX3lxTE9lNTNoRzBDUXctNmZNMVFPbVJxREtXdzZDZHNmWEpTTDhfaVJxRWNrZnJKeUlUeXhyRU1yQTdFSDc4VVRFSkFNRFZIZTMyQkQtUXRZTVlnU25fWm9OaVk0WGJmQjZnelR5ZlZPT2JFY21xRGtYUnNWa0tkQjRBWVFIU3JOeE4wU1liRGxPcURiS1hCOU9IQklIQ1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Crypto Options Alert: Bitcoin and Ethereum Set for Significant Expiry Event - U.Today",
        "content": "Advertisement\n\nA significant event is on the horizon with the impending expiry of 29,000 Bitcoin (BTC) options and 270,000 Ethereum (ETH) options, according to data provided by Greeks.live. This event, set to take place on March 8, encompasses options with a total notional value of over $3 billion.\n\nThe crypto market has been notably volatile, experiencing its highest fluctuations in nearly a year, with Bitcoin hitting a new all-time high above $69,000 before experiencing a sharp 10% decline.\n\nThe surge in options trading, driven by the U.S. money-driven spot bull market, shows growing investor interest.\n\nUnderstanding options expiry\n\nAn options contract offers the buyer the right to purchase (in the case of a call option) or sell (in the case of a put option) the underlying asset at a predetermined price, known as the strike price before the contract expires on a specified date (expiry date).\n\nAdvertisement\n\nThe put-call ratio is a key indicator used to gauge market sentiment. It is calculated by dividing the number of traded put options by the number of traded call options.\n\nA ratio below 1, such as 0.86 for BTC and 0.55 for ETH, suggests that more call options (bets that the price will rise) are being traded than put options (bets that the price will fall), indicating a generally bullish sentiment among investors. However, the value below 1 also suggests a level of caution, as the market is not overwhelmingly bullish.\n\nThe concept of \"max pain point\" refers to the price level at which the largest number of options (both calls and puts) would expire worthless. For investors holding these options, it represents the worst-case scenario where they gain nothing from their investment in the option contracts.\n\nIn this context, the max pain points are $60,000 for BTC and $2,950 for ETH. Traders and market analysts often pay attention to these levels as options approach their expiry dates because significant numbers of traders may act to avoid the max pain point.\n\nBitcoin price consolidation\n\nBitcoin's price trajectory is in the spotlight, with market analysts and top traders like Jake Wujastyk predicting its readiness to establish new record highs.\n\nAfter a swift V-shaped recovery from a recent sharp decline, Bitcoin's price has stabilized, showing strong indications of an upcoming bullish run. The cryptocurrency is currently trading around the $67,000 level, with a market cap hitting a new high of $1.33 trillion, reflecting growing investor confidence and adoption.\n\nThe ABC pattern formed during its consolidation phase suggests a solid base for potential price jumps, with forecasts suggesting a reach toward the $76,000 mark."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOZy1POHZ2NnF1dHg3ZWE0Q2p4QlhWMF9WVkJFekFFVm80YktIOTB5NDc5blhSdEd3UXp0WDhHVlJyRHFKanVnenhIeV9adFNiQTIzb2wxN28tajVld3ZGVC1saEFCandZZDlFN0RfeFVGQllMeXNNd3hMZlE1aXhldmRXZXQ0OGQybDRN0gGTAUFVX3lxTFA3WGg3MW53ZWhpckJ6bjBqaUFOTDBxN3hMSWpTTHZaNWI4SEp0azh0MjJ6QUJBZkF1eDhkcGstRTZKNTdCQkU0X24xWV9TNlUxcWNzaDloS3ZRUlhEWmtoMUxEMnhSNzN0dkZtUjJVbEVPMXVQTXN5R3dzaWUwSnEyUmxCSDFRQWJQNEpqVWZqQWJ6Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "This Week in Coins: Bitcoin Touches $70,000 As Major Altcoins Soar - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nIt had been a long time coming: Bitcoin hit a new all-time high on Tuesday, soaring past its November 2021 record of $69,044 in the U.S. before dipping again.\n\nThen, on Friday, it did it again—this time by jumping above $70,000. This is remarkable, considering that the coin was trading for below $17,000 in January 2023.\n\nBitcoin's rise was aided by record-setting trading days in the spot crypto exchange-traded funds (ETFs). BlackRock's iShares Bitcoin Trust has been particularly popular.\n\nAD\n\nAD\n\nThe price of Bitcoin is now $68,413, up 10% over the past week, per CoinGecko data.\n\nAnd Ethereum, the second biggest digital asset, hit $4,000 for the first time since 2021. Over seven days, it has soared by 13% and the price of ETH stands at $3,894.\n\nBut the two biggest coins' gains over the week have been pretty tame compared to other assets. Meme coins, for a start, have jumped in value a ridiculous amount. Shiba Inu (SHIB) is the winning asset out of the top 20 biggest digital coins and tokens, after having jumped nearly 135% over the week.\n\nIts rival, Dogecoin, had a very good week—it nearly doubled in price. It has since dropped and is now priced at $0.1749. It touched $0.19 on Monday, and the Elon Musk favorite is still up over 27% the past seven days.\n\nElsewhere, Solana, the fifth biggest digital asset, rose above the $150 price point on Friday for the first time since January 2022. The token behind the Ethereum-competing blockchain is now up more than 13% over the past week and is priced at $145.82.\n\nAD\n\nAD\n\nBitcoin spin-offs like Bitcoin Cash also did well, although the gains were fleeting. BCH, the 20th biggest coin, was up nearly 40% over a seven-day period at one point—but it has now fallen back to $430 after peaking over $450 yesterday. BSV now trades at $109, up over 6% for the week.\n\nDespite the surge in alts and their tremendous gains, it's worth noting that most of them are well below their all-time highs from the previous bull market in 2021. Many still have a long way to go.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBoazJrUDIwanBKbk5mZmwzQ2tvVkNtQWxRTGFUZmNlQVk3WmFhZjZGR3lWSF83U3VIR2pEZWFRWjN6VWpJWDZwYThfZUtzSlZfSkhfZXZrdmhka3JnUW5uUThIc2VodTh0OHo3VDVpZml4RWpuRWxJT3o5ZVQzUdIBhgFBVV95cUxOSWFJekNabFlwV2ZjaVVXVmdTUl9neFgya2pjZ1ZBblkwX3BHdHBLLVYwTXk0V3Q4NEt3YXl5a3NoeXhPSTJrblNGNU1NalFiUTNvM2M1T1hYRGFoc3dUOVZBVjhsMUlHUThYb3I4aGZGOHR5dGhNaXJ6VTF6cUZ1amFCcGJVUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Batman Back on Blockchain With 'Legacy Cowls' Ethereum NFTs - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Dark Knight is returning to the Ethereum ecosystem in a new NFT collection commemorating the 85th anniversary of Batman's first appearance in \"Detective Comics #27.\"\n\nThe Legacy Cowls Collection is the next installment of the Bat Cowl Batman-themed NFT series that debuted in 2022. Made in collaboration with DC Comics and Warner Brothers Discovery Group, The Legacy Cowls Collection spans 11,544 digital collectibles using the Ethereum scaling network Palm that will drop on March 29 and be available via Candy Digital for $49.99.\n\nPricing details were not immediately available. Candy Digital is releasing as many Legacy Cowls as the number of original Bat Cowls released in the original 2022 drop. Owners of those NFTs have gone on to help shape the comic story that inspired this latest set of digital collectibles.\n\n“Batman is one of the world’s most iconic superheroes, with hundreds of millions of fans around the world. His story has shaped comic culture,” Candy Digital Chief Creative Officer Straith Schreder told Decrypt. “And, over the course of the past two years, his story has been shaped by fans on the DC NFT Platform, who have voted on, and contributed to the direction of an original DC comic book series, 'Batman: The Legacy Cowl.'\"\n\nAD\n\nAD\n\nArmed with unparalleled intelligence and strength, this entity will breach our greatest defenses… A lethal legacy comes into focus. Who lies behind the cowl? Peer Into the abyss.\n\nJoin our Live Stream\n\n03.08.24\n\n1PM EThttps://t.co/xA1MMFZJOO pic.twitter.com/fwEioyfdIy — Candy (@CandyDigital) March 6, 2024\n\nThe Legacy Cowls Collection features 3D collectibles with artwork based on \"Batman: The Legacy Cowl,\" created by DC artist Pablo M. Collar and writer Dan Abnett.\n\nSpecializing in sports and entertainment collectibles with a focus on fan experiences, Candy Digital is backed by investors including Galaxy Digital, ConsenSys Mesh, HENI, and 10T Holdings.\n\n“The Legacy Cowls project commemorates the first original DC comic on the blockchain,” Schreder said. “It marks the introduction of the first DC supervillain created through fan voting. And it points to a future where creativity is collaborative; where fans can shape and see themselves in the stories they love.”\n\nAD\n\nAD\n\nSchreder explained that by participating in The Legacy Cowls Collection experience, fans can continue to contribute to the story through voting and crafting events, as well as uncover clues and overwrite the Legacy Cowl’s “villainous code.”\n\nArtwork from the Batman Legacy Cowls Collection. Image: Candy Digital\n\n“2024 is a landmark year; this collection is a starting point,” she added.\n\nAccording to Candy Digital, owning a Legacy Cowl collectible grants access to augmented reality experiences on Meta platforms, along with voting on creative decisions, access to puzzles, and exclusive future drops. Schrader said that DC has been releasing \"DC collectible comics\" on a biweekly basis, with its 88th such drop coming this month.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPS3ZXNU9vZm5ZWk44N2hGcVNjb1Rha09CSE1GSGZfQ3JsNER3Z1dWNlprVVA5XzVUUy1ydFRSWnNlS2RGZ3FBY29IOGhjN0JVWExfalNWVnd2RHFFRUZicFhpRGRPRGtBNDNxeW92NXFCLTRWRk1ZWjFYcGZZUHRpQ1l6Z9IBiAFBVV95cUxOTWk2eU1EeVVsYzBCUE9VQkF5UUVaMjVHek9YcDZoMEhlX2JGUlNvUGltaE1lR2JselJKQlB4ZTVJWms1NjllOVBQdWljYVktMmx3YUV3eW5mQ2pZb1k1WGctOUxrRUo1d2UtcjRrbXV3N0xnbWdhMU5NajVBUXB3QW84TVV2NXhS?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Ethereum fees spike as the network prepares for Dencun - AMBCrypto News",
        "content": "The Ethereum fee rose to over 9,000 ETH.\n\nEthereum volume rose to over a ten-month high.\n\nRecently, Ethereum’s [ETH] transaction fees have surged. This increase aligns with the ongoing upward trend in the asset’s price and the network’s preparations for an upgrade to reduce fees in the ecosystem.\n\nEthereum fee reaches months-high\n\nAn examination of transaction fees on the Ethereum network indicates a continuous increase since the beginning of March.\n\nAccording to the chart on Glassnode, fees at the start of the month were approximately 6,300 ETH. At the time of this writing, fees have surged to over 9,000 ETH, marking the highest range observed in over ten months.\n\nThe fee escalation aligns with the observed rise in transaction volume over the past few weeks. It also coincides with the Ethereum developers establishing a date for the latest update.\n\nCountdown to Ethereum Dencun\n\nThe Ethereum developers have set a target date of 13th March for the highly anticipated Dencun upgrade, marking the most significant changes since April 2023.\n\nA key highlight of the Dencun upgrade is its “proto-dank sharding” feature, designed to reduce transaction costs on auxiliary “layer-2” networks built on Ethereum.\n\nThis is achieved by providing a dedicated space for data storage. Introducing a new transaction class, the upgrade incorporates data “blobs” to lower the costs of publishing transaction data on roll-ups.\n\nThese blobs serve as a distinct space in a transaction where roll-up networks or other protocols can temporarily store data.\n\nVolume data shows the reason for the fee spike\n\nAnalysis of Ethereum volume data provides insight into the recent increase in network fees. According to the chart on Santiment, on 6th March, the transaction volume was over $51 billion.\n\nNotably, this transaction volume marked the first time since 2022 that Ethereum witnessed such high volume. The day before, the volume surged to over $47 billion, representing the highest recorded monthly volume.\n\nAt the time of this writing, the volume has declined significantly to over $27 billion, indicating a notable decrease.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nEthereum suffers a slight decline\n\nBy the conclusion of trading on 6th March, Ethereum had surged to approximately $3,820, reflecting a remarkable 7% increase based on daily timeframe analysis. This price level marked the highest ETH had reached in over a year.\n\nHowever, at the time of this writing, the price has experienced a slight decline of around 0.4%, settling at about $3,815. Despite this modest dip, it maintained its position within the $3,800 price range, indicating a resilient and strong bull trend at the time of this writing."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOU2I2Q0tQQkhVX3NwT20wZ0t5ZC1Bb3FJMVVqakFXYUFydko4dWpxWjdzNGZLVUdUVHVScTgxbXhJRVlzeWp6ejJTUl9CWExPQ093WHpMd1k3VmZaaWVrUVVRbTBoT2R5T0s2U2VLLWp0Mno3WWV4TDc5X01Beng5OTlQLTl6NGI3cF9mLTNwZmdleVZVYVNIYzYwcEQwQTE1ZVEyNHpjMzg4TnpLZjBtYVlIcFk0UGtoSFpyWnFNMTRqRFJCQXhWSzdDVWJQQdIB0wFBVV95cUxPdTFmaEJtSERSRUp1REh3dTQzQUViZE05VV93UjdabW1ZVzZNMFFXQ1NWT0F2U1ptY3o1eFBvdjA3U1JXRzhtY2lSLTF5TmpEd01GWDJodHdRemlGRDloMEN6d29YMTVEZjdGV2t3R01BVDFXY19nbktjSTc0NUd3UDRrc2RxOU9vX1VjVUozOGNnM2V2Sm9DOEgxSndtNTFNM1ZFdDE1bkxqOG5hdEd2a21CUlVvQ0gzUUktS3AwQ0hLZDhXV1lKZ1ZfbDRSeGhKYy1V?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Hits $3,900 As Experts Believe NuggetRush Could Be A Potential Leader In Coming Altcoin Run - Crypto News Flash",
        "content": "Ethereum (ETH) is nearing the $4,000 milestone following Bitcoin’s recent surge. Altcoins like Dogecoin and Shiba Inu have also experienced significant gains, contributing to a bullish market sentiment.\n\nNuggetRush (NUGX) is an emerging token positioned in GameFi, DeFi, impact gaming, and play-to-earn (P2E). Still, in the ICO phase, it introduces a P2E game with governance tokenomics and deflationary features.\n\nIn the dynamic cryptocurrency landscape, Ethereum (ETH) is surging towards the significant psychological milestone of $4,000.00, propelled by the recent ascent of Bitcoin (BTC). On the other hand, NuggetRush (NUGX) emerges as an advanced token strategically positioned at the center of GameFi, DeFi, impact gaming, and play-to-earn (P2E). Here are reasons why Ethereum investors believe NuggetRush could lead the upcoming altcoin run.\n\nEthereum (ETH) Surges Toward $4,000 Amidst Bullish Crypto Landscape\n\nEthereum (ETH) is constantly heading towards the psychological $4,000.00 milestone after Bitcoin’s (BTC) rise to $68,537.15 on March 4, 2024. Multiple altcoins, including Elon memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB), have seen remarkable triple-digit gains, strengthening the current bullish sentiment in the market.\n\nCoinMarketCap data reflects a massive surge in Ethereum’s (ETH) liquidity and trading volume, hitting $33 billion, while its market cap has surged past $450 billion. These figures highlight the massive fundamental factors helping propel the current Ethereum (ETH) rally, especially the imminent Dencun upgrade set for March 13.\n\nThe upcoming Ethereum (ETH) Dencun upgrade, preceded by three successful test introductions, promises many boosts for Ethereum’s (ETH) ecosystem. Prominent aspects include decreased transaction fees on layer-2 protocols and easing network congestion, accomplished by raising the block size to 25 MB, up from the existing 12.5 MB.\n\nThe implementation of proto-danksharding will enable Ethereum (ETH) to resolve scalability issues efficiently.\n\nThe Dencun upgrade, combined with optimistic market sentiment fueled by Bitcoin’s surge to its all-time high and the potential for a spot exchange-traded fund (ETF), has strengthened Ethereum’s (ETH) upward momentum.\n\nOn March 7, 2024, Ethereum (ETH) was valued at $3,936.27, up 14.71% in the past week. Analysts say ETH will rise to $4,050.00 by the End of March, supported by increased bullish momentum in the crypto space.\n\nNuggetRush (NUGX): Unveiling an Advanced GameFi Token with Deflationary Features\n\nNuggetRush (NUGX) is an advanced token perfectly positioned at the center of GameFi, DeFi, impact gaming, and play-to-earn (P2E). Since it is still in the early stages of development, it is still available as a blockchain ICO.\n\nIn that context, NuggetRush (NUGX) will introduce a play-to-earn (P2E) game while blending tokenomics, consisting of a governance token. Interestingly, the token has a deflationary mechanism and characteristics. The rapid growth of an active community and massive interest in NuggetRush (NUGX) in its presale is subject to different factors and elements.\n\nThe main factors include community-driven progress, advanced technology, and a vision that supports decentralized finance (DeFi) non-fungible token (NFT) and gaming enthusiasts to engage with and derive considerable value from NuggetRush’s (NUGX) “ecosystem of rewards.”\n\nAlthough it is a relatively new project, NuggetRush dominates the crypto space. Its mission goes beyond its presale phase, and the team plans to help push NUGX toward a crypto market cap of $100 million. The significant target and many use cases confirm a growing momentum that may help NuggetRush (NUGX) become the best GameFi crypto.\n\nAdditionally, no taxes were charged on transactions executed in the presale space. On that note, NuggetRush has become attractive for most investors. The project has sold over 211 million NUGX tokens and raised over $2.7 million.\n\nCurrently, NUGX is valued at $0.019 in the Launchpad round of its presale. At the end of this round, NuggetRush will rise to $0.020, its mainstream listing price. The many utilities and growth potential make NUGX the best crypto investment today.\n\nVisit NuggetRush Presale Website\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQaV9UTVZkUkZzNGpnRjVqdTQ0TXd6amExajNrMTNzYjBTTVZwX1F2WVZ2R0Q4T0RPTm9leEpyeVlHanFtSm5QNGdYcU5mUVZPbXVpTWJOS2ZoNGRPWGZncl82YjducldYSFBkSUhCd2doNlZ6eENHQzZTcTRRQWZoaXlsWE80WXPSAYwBQVVfeXFMT2FqQXN5UHhIZHoweTY5cU10aTBRX3Vqb201SUV0WGl4M0pYakdDSW5NdG1BcjY4czlDcEZmU2xicFd5NUt0eHliVGI4MkNSUTBYdEdqb1d5Y243YzBJdGN3bWxaRlhMa1JzUTNwamM0T04tWHdvM25UdUpaOUE4UEpWbjZfdEtUWUdFa2U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Why Ethereum’s rally above $4K may not be good news for you - AMBCrypto News",
        "content": "ETH briefly exchanged hands above $4000 on the 8th of March.\n\nThe past two weeks have seen a spike in validator exits.\n\nLeading altcoin Ethereum [ETH] faces a potential short-term pullback after it traded briefly at a three-year high on the 8th of March.\n\nThis decline may be due to the overheated nature of the coin’s Futures market, which historically precedes a sharp fall in its value.\n\nAccording to data from Coinglass, ETH’s Futures Open Interest has crossed $13 billion, and, at press time, sat at its highest level since November 2021.\n\nAn assessment of the coin’s historical performance revealed that on the 16th of November 2021, the bull run caused investors to pile into Futures contracts.\n\nThis led to an inflation of ETH’s price to the barely sustainable level of $4891, which now represents its highest price point in the altcoin’s history.\n\nOn that day, ETH’s Futures Open Interest peaked at $14 billion before experiencing a significant crash, lowering the coin’s value as a result.\n\nIn the six months that followed, ETH chased new lows and even exchanged hands below $1,100 by June 2022.\n\nFurther, the recent hike in ETH’s value has resulted in a surge in positive Funding Rates across crypto exchanges. This, paired with rising Open Interest, puts the coin at risk of declining.\n\nHigh Funding Rates increase the risk of severe long liquidations, which may result in high market volatility and unpredictable price swings in either direction.\n\nValidators do not want to be left out\n\nAMBCrypto’s look at Ethereum’s on-chain activity revealed a recent increase in validators’ voluntary exit from the Proof-of-Stake (PoS) network.\n\nThis comes amid the new yearly highs recorded in ETH’s price and the desire of validators to profit from them.\n\nAccording to data from Glassnode, the number of validators who have left the Ethereum network, observed on a seven-day moving average, has increased by 42% in the last two weeks.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThis has resulted in a brief decline in the network’s participation rate. Per Glassnode’s data, the participation rate on the PoS network was at a two-week low of 99.46% as of this writing.\n\nThere were 999,660 active validators on the Ethereum network during this time, each staking over 32 ETH in the network’s 2.0 contract."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPRG1EdF9IOUgxVlB6VXRzX1B1a2s5U05qMEtwbUZlaElMcU1fS1NSVjFNLXNuZ3VLdjBaa2Y4SWF2SGpLdVRtRVd0RFhkbVJVS3E5cEtRMWhCVlZlTlVPTDNraFNLSHViQzN6RXNtTXdkWF9rajZ1ZGVhLWVrS1Q3VnA1ZjJjdnRXVlk2VVFTZGp0UU1nNThMVEtZNk9WSHpaQUdNRXRycERQTVVk0gGyAUFVX3lxTE9yLU40bGd5RjUxWHNLMWQwSUpiY29OdEQyWXdMOU53R0VySzJQNTJ2NWZzMDB1Mzd6QXVCMTZpVnJfaEtnSG9uVDV2SmQxZllYYy1GVkFPd1FCUTdFYTJTOEYwcG0td1I4ampGZmV5el9Gd2g4aU1GUGtVemRoNzA0Nmh0NS1QbDNHYzMxTmF0Zkt3THdCZlpHeUF0SjhWVHJ3TV9scWpIanFjRmlLUjAtNnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Is Ethereum (ETH) Next to Reach ATH? Solana (SOL) Finally Breaks Through, Will Cardano (ADA) Recover? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum is displaying a notable performance that may position it to reach the elusive $5,000 mark. As we scrutinize the current trend through technical analysis, several indicators suggest a robust bullish momentum that could potentially drive Ethereum to new all-time highs.\n\nEthereum has demonstrated significant resilience, maintaining bullish performance amid a market that has seen many other assets undergo substantial price corrections. Unlike its counterparts, Ethereum has not faced a drastic price drop that could severely undermine its bullish trajectory. This steadfastness has been a cornerstone of investor confidence, and it may well be the catalyst for Ethereum's next leg up.\n\nETH/USD Chart by TradingView\n\nAnalyzing the current price chart, Ethereum is in the midst of a strong uptrend, as evidenced by its consistent highs and higher lows. The moving averages are aligned in a bullish configuration, with the shorter-term averages above the longer-term ones, and the price comfortably positioned above these indicators, which now act as dynamic support levels. Resistance levels, meanwhile, are being tested and breached with increasing frequency, indicating that buyer pressure is substantial.\n\nA significant bullish scenario would see Ethereum continue to ride this wave of momentum, supported by increased adoption, advancements to the Ethereum network such as the anticipated move to proof of stake (PoS), and the broader trend of institutional investment in cryptocurrencies.\n\nAdvertisement\n\nThe previous correction phases of Bitcoin have historically been followed by price surges in Ethereum, suggesting that ETH could indeed be on the cusp of another significant run-up.\n\nLooking ahead, key resistance levels to watch are the psychological salient round numbers, with $4,000 acting as the immediate hurdle before the $5,000 target.\n\nSolana wakes up\n\nSolana has recently witnessed a significant breakthrough, marking one of the first sharp moves in the last few weeks. The asset has surged past resistance near the $120 mark, which had previously acted as a substantial barrier to its upward momentum.\n\nSupport levels for SOL have been established around the $100 zone, a psychological round number, and also near the 50-day moving average, which has historically served as a dynamic support during pullbacks. With the price now well above these levels, the moving averages are aligning in a bullish pattern, further underlining the positive outlook for the asset.\n\nThe current trend suggests a momentum-driven market that could carry SOL toward the next psychological resistance at $150. Such an ascent would mark a considerable gain from current levels and a notable victory for bulls within the market.\n\nCardano gets ready\n\nCardano might be fueling up for another surge attempt. From a technical perspective, ADA has recently undergone a retracement, stirring discussions around its capacity for resurgence.\n\nThe support levels to watch are near the $0.65 mark, which has previously acted as both resistance and support, suggesting it is a significant pivot point for the asset's price. Further support is found around the $0.55 zone, where the 50-day moving average lies, providing a potential springboard for a bounce back.\n\nOn the resistance front, ADA faces immediate barriers near the $0.80 level, with a more substantial psychological ceiling at $1.00, which could suppress attempts at a quick recovery. The recent price action indicates consolidation after a sharp move upwards, often a precursor to a continuation of the previous trend, which in ADA’s case was notably bullish.\n\nAnalyzing the current trend, ADA has seen a drop in momentum as evidenced by the Relative Strength Index (RSI) retreating from overbought levels, but the volume profile suggests that there remains interest in the asset at lower price points. Should buyers regain control, we could witness a recovery attempt with the potential to challenge previous highs."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5LdmlscEV3OGYwUWdvZlljcW81YWV4NkdoMjhoX0FBUW5CVHc4QVp2c2RiMDVxd0g0VzVONDBYX3Nka3NFWlhzMW5KS2VyZnBJOXQxR1Q0Q1NhaEkzMFhlbzU4NGpYR2psVkZrMlZ4ZnJBUm1FblB3ZTdR0gF_QVVfeXFMTnlwTzhJWVI4V3lQaS1qQjVpY1JDNmhMbk5vNmQ1RXA1OG5KVnVXLTF2akRJMl9jekJ6QnFVZDFGc1AyUGNnYXhBQ3M3Y2RoMUFNT25IeVA5TEpUVEtLcDZoWlk0STdUdEFWNWFrM3NlbWZJWE9QUTdJM09STUZjOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "How memecoins helped Ethereum’s transaction fees - AMBCrypto News",
        "content": "Ethereum’s weekly fees hit a 22-week high on the meme coin hype.\n\nETH’s supply on exchanges increased, prompting concerns of a correction.\n\nEthereum’s [ETH] bullish run on the price charts brought it to $3,949 at press time, setting it for a likely breach past the magical mark of $4,000.\n\nThe second-largest cryptocurrency was up nearly 15% over the week, according to CoinMarketCap.\n\nThe soaring prices got traders excited, as daily trading volumes hit multi-year highs of more than $20 billion, as per crypto market data provider Kaiko.\n\nEthereum blockchain gets busy\n\nApart from the impressive show in the market, the blockchain was also experiencing heightened demand for its blockspace.\n\nAccording to on-chain analytics firm IntoTheBlock, Ethereum validators collected over $190 million in fees over the week, the highest since May 2022, representing an increase of 78% from last week.\n\nWith this, Ethereum’s annualized fee rate surged over $10 billion for the first time since early 2022.\n\nThe high network demand was attributed to the ongoing meme coin bull market.\n\nTop Ethereum-based coins such as Pepe [PEPE], Shiba Inu [SHIB], and Floki [FLOKI] have been pumping this week, as retail investors returned to the cryptocurrency market.\n\nETH burn rate spikes\n\nThe fee spike also accelerated the rate at which ETH was moving out of circulation. Note that a set amount of ETH is burned for each transaction.\n\nThis corresponds to the minimum amount required for a transaction to be considered valid, i.e., base fee.\n\nAccording to AMBCrypto’s analysis of ultrasound.money data, more than 33K ETH were burned over the week, taking the annual deflation rate to 1.45%.\n\nAs per the supply-demand factors, such deflationary pressure might have a positive impact on ETH’s long-term economic dynamics.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nA cause for concern?\n\nETH’s rapid price gains over the week pushed the total supply in profit to over 95%, as per AMBCrypto’s analysis of Santiment data.\n\nInterestingly, nearly 320,000 ETH coins were transferred to exchanges in the week. This raised alarms that traders might look to profit-take in the days to come, causing a correction."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQX1A5NE5leFV1Q3E4ZTJsZVNOOTA1LS1TTWVtSTNLLXQ0TzZQM252eGJQdWJfNVduMUNnWTM0T3dKcGFmcHlDQnp3bHhqOUNEcmU2Ymc5bWoyYTc5YkE2NnJMdXR1WGZhdklxZVBJYTI5akFsVG9BTlF5c3BEUnI3SFVHcVhHUmdLZGE3X1VZUlkwQTVhaG5kQWowdmNMSTIw0gGmAUFVX3lxTE5EWlJBUXFfWDU2T2d2dmxxOHZWMk5LZFRXeklpWDRDY29qYk8xaDN1Z2t3a1V2bUlaMDZwc3RhaXBWMzQtM2ZTcVBELUx2eWJiSXhWVEptbG04REpRR2Fac2lWZ3RzU0x3Tzhhd3hWaW9IVWVuMlpZRnpsTDdfOUNxdEZ4Y25XQVJxTEdRNlhyZkdZNFdoSGZyZDQ5SlQ2RTVtZDJOOEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "These Catalysts Could Push ETH to $10K or Higher This Year: Bitwise Analyst - CryptoPotato",
        "content": "The price of Ether (ETH), the second largest cryptocurrency by market cap, could soar to $10,000 or even higher this year despite the asset being overshadowed by Bitcoin (BTC) in the past months. These were the words of Juan Leon, crypto research analyst at asset manager Bitwise.\n\nAccording to Leon, ETH, worth $3,950 at the time of writing, could rally past its all-time high of $4,800 and possibly surpass $10,000 due to catalysts like the upcoming Dencun upgrade and excitement surrounding the launch of spot Ethereum exchange-traded funds (ETFs).\n\nThe Upcoming Dencun Upgrade\n\nThe Dencun upgrade is highly anticipated and expected to enhance Ethereum layer-2 rollup efficiency through proto-danksharding or ephemeral blobs (EIP-4844). It is the network’s biggest upgrade since Shapella in April 2023, which enabled the withdrawal of staked ETH.\n\nProto-danksharding aims to reduce storage demands by using temporary storage space for higher transactional throughput. This will allow access to off-chain data, reducing the transaction costs on layer-2 networks by 10x or more. Both the Shapella and Dencun upgrades are major steps in Ethereum’s transition from a Proof-of-Work (PoW) consensus mechanism to a Proof-of-Stake (PoS) network.\n\nDencun has been successfully deployed on the Goerli, Sepolia, and Holesky testnets, and the mainnet launch is scheduled for March 13.\n\nLeon believes the launch of Dencun on Ethereum will be a positive sentiment catalyst that will push ETH to unprecedented highs. By reducing transaction costs on layer-2 networks, activity and mainstream consumer demand will pick up.\n\nExcitement Around Ethereum ETF Approval\n\nAnother catalyst that could cause the price of ETH to skyrocket is excitement around the launch of spot Ethereum ETFs in the U.S.\n\nSeveral asset management firms, including BlackRock, Fidelity, Invesco, Galaxy Digital, VanEck, and Ark Invest, all of which issued the new spot Bitcoin ETFs, have submitted proposals to launch similar products for Ethereum. However, the U.S. Securities and Exchange Commission (SEC) has pushed the deadline for deciding on their applications to May.\n\nThe Bitwise analyst thinks the odds of spot Ethereum ETF approval are not as high as they were for Bitcoin ETFs, speculating there is a 50% to 60% chance they may be greenlighted. Regardless, he believes their launch is imminent and may happen sooner or later."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNVDd1R0NCZURQTUhaMlhBRUpJSE1qMzFyQ2VQQTZaRFR1c1BNTmNQNkdYbEMtMnRMRWRVMUF4aXdjZkJMYjJfczhmWTlyRUhoaV9CWDVjNWhHNkdXVjJRSWtpR1JRUE5KalpvY094OEZob2VUOENPZFdkd0d2TmhDeUx0SGJSSWdJbUNfRUdka0Q0T0kwOUlJSVN5Sm5WTUtXYkZxQkV2ZXhMT1FvWTloSjgxRzFNRFFoTEVtYnJ0M2JCNkZ3YjNpbnBBRUh0cTZEdEJGbTdDRGw2Zzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "InEVM: the layer-2 compatible with Ethereum, Solana, and Cosmos blockchains - The Cryptonomist",
        "content": "The cryptographic project Injective has just launched on mainnet inEVM, a layer-2 rollup built on the Ethereum Virtual Machine capable of achieving composability with the Solana and Cosmos blockchains.\n\nAfter completing the testnet phase with Caldera that started in September of last year, Injective is now ready to expand the interoperability of the entire web3 landscape.\n\nThe crypto INJ is performing well on the market in the meantime.\n\nAll the details below.\n\nEthereum blockchain: Injective launches an interoperable layer-2 with Solana and Cosmos\n\nInjective’s blockchain platform has just launched the InEVM layer-2, which allows developers to achieve unprecedented compatibility between the Ethereum, Solana, and Cosmos worlds.\n\nTechnically, inEVM is a rollup scalability solution developed on top of the Ethereum Virtual Machine, capable of offering low-cost transactions and native interoperability between WASM and EVM environments.\n\nIt is precisely the interoperability component between multiple programming languages that elects Injective as the first L1 chain capable of offering developers a highly interconnected environment for the development of financial applications without the need for code alterations\n\nIt is worth noting how important messaging levels such as Hyperlane and LayerZero have been integrated within InEVM, allowing for a continuous flow of data and resources.\n\nFor this type of next-generation layer-2, Celestia acts as DA (data availability) while the decentralized oracle of reference is Pyth.\n\n1/ Injective #inEVM is live on mainnet, the first ever rollup designed to supercharge concurrent VM development.\n\n\n\ninEVM enables Ethereum developers to build dApps that leverage blazing fast speeds & near zero fees while achieving composability across WASM and EVM\n\n\n\nRead on 👇 pic.twitter.com/OXtPQTVnvx — Injective 🥷 (@injective) March 7, 2024\n\nThe launch of inEVM by Injective comes after the project successfully passed the Caldera testnet phase initiated in September 2023, during which it experimented and tested the proper functioning of the network.\n\nNow, thanks to the launch of the mainnet for this layer-2, the development team behind the network can pursue its originally set goal of creating a network of “Electro Chains” capable of expanding its ecosystem and improving blockchain interoperability.\n\nThis means allowing native dApps built on Ethereum to also run on networks like Cosmos and Solana, unlocking the true potential of the web3 world.\n\nIn a statement before the launch of the rollup, Eric Chen, CEO and co-founder of Injective Labs, reported that:\n\n“inEVM is a revolutionary solution that creates the first truly composable layer to scale on-chain finance globally in traditional finance (TradFi). We are laying the groundwork for greater collaboration in the blockchain community.”\n\nIt is worth noting that this milestone for Injective has arrived late according to the previously established roadmap, which had planned for a launch in the third quarter of last year.\n\nThe decision to delay the mainnet date is justified by the development team’s desire to launch the ecosystem with a myriad of dapps already available for the end user.\n\nIn this regard, among the most successful applications on inEVM we find the lending protocol TimeSwap and the on-chain options protocol Thetanauts, which together have raised over $200 million from private investors such as Polychain Capital, Delphi Digital, Bain Capital Crypto, and many others.\n\nAnalysis of the price of the crypto INJ\n\nINJ, the native token of Injective, is one of the coins that has experienced explosive performance in terms of price charts among those operating on the Ethereum, Solana, and Cosmos blockchains.\n\nActually, since the beginning of the year, the crypto has underperformed the performance of Bitcoin, achieving “only” a +20% in the cryptographic exchanges. At the same time, however, INJ came from a completely crazy bull run in which it had marked a +470% since October 2023 and a +3500% since January 2023.\n\nAfter rising throughout 2023, prices have slowed down the frenetic trend, waiting to continue the climb upwards with another leg up.\n\nAt the moment INJ has a token value of 43.15 dollars, very close to the historical high of 46.5 dollars reached last week.\n\nThe short-term situation with bulls not allowing bears to get close to the weekly EMA 50, makes us think that another bullish breakout could arrive soon capable of pushing the crypto to new levels.\n\nIt should be noted, however, that a downward break could cause prices to collapse significantly as the graphic structure is very extensive.\n\nBetween the prices of December and the current ones, we also notice a bearish divergence on the RSI indicator, which signals exhaustion of the upward momentum.\n\nAt this juncture, it will be crucial how the overall market outlook evolves, with BTC ready to set new all-time highs and ETH following enthusiastically.\n\nFor Ethereum, it is also worth mentioning the imminent arrival of the Dencun update, which will improve the scalability of the layer-2 solutions on its blockchain.\n\nIf inEVM by Injective manages to keep up with the wide range of second layer rollups developed on Ethereum, such as Starknet, Linea, ZkSync, Scoll, Blast and many others, being able to compete in terms of scalability and dapp development, it is likely that the INJ token will appreciate even more in the coming months.\n\nIn particular, if the compatibility with Solana and Cosmos environments will bring advantages to the web3 sector and allow the creation of successful applications, the Injective token will definitely have a very bright future."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOTDRsWmZ2d0NtbG5Ra1hUSTJ2NnRJSXNqcDVxVTgzSEZkbmt5SkVfODRlT1dJai1wc0QzLXJERnk4RFZrN1YySVNoUXVBX3ZhNHJxT2FfTS1hYmJScmFmUHg4UFdGTkZCTnpBeHBTSmxNUXMxNlRuZm5vTkptRTZicjJpYWl5VmF6MENsWTFybUpiSWx0TWVaazJjcTUtZDdhMlgzbTNIMGRNUkI3cmdvajVVNl82WjjSAbwBQVVfeXFMT2QwY3pMN3pYY2t6ZDF3UV82UzdVYk9BajhXdHExSmZSdmxZdE9ZbFNqS1NpWEdOdHNtVXdtSUFud3czOXFYSnV1cmQ0YTZWeEFfRjhJOGV6R1B2Vlo1OUQxX1VISHBmV19tZnpCS1N5Ul9OakRya043aXIxMTc3N0VmZ3otMU15YzFFUlNyekR1LW1zNlJkOF9UdUY2MFdUUTRESnYwdFJSZzhnWjF2b2YxdkJJbzR1UXc3bm8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Crypto Prices Today March 9: Bitcoin At $68K, Ethereum Nears $4K, PEPE Gains 20% As FLOKI Rallies 50% - CoinGape",
        "content": "The top crypto prices today witnessed a positive shift as the Bitcoin (BTC) price neared a new all-time high at $69,000 while other altcoins gained notably. In addition, the Ethereum price approached the $3,900 mark. Meanwhile, other top altcoins, such as Solana (SOL) and XRP witnessed a substantial price hike while Cardano (ADA) dipped\n\nMajor Crypto Prices Today\n\nThe Bitcoin price held firmly above $68,000 amid the bullish run. The Bitcoin price was up by 1.89%, reaching $68,434.94 at the time of writing on Saturday, March 9. On the other hand, it’s trading volume surged by 31.39% to $58.22 billion in the last 24 hours. Meanwhile, the crypto boasted a market cap of $1.34 trillion.\n\nadvertisement\n\nTurning to altcoins, the Ethereum price gained 0.83% to $3,931.55 at press time with a market valuation of $472.14 billion. Whilst, ETH saw its trading volume increase by 14.71%, reaching $24.76 billion. Meanwhile, the Binance Coin (BNB) price surged by 4.30%, reaching $489.40. In addition, its 24-hour trade volume rose by 0.11% to $3.52 billion.\n\nThe Solana price sustained above the $140 level. The Solana price was up by 1.85%, settling at $146.83 On the contrary, SOL witnessed a 9.77% dip in trade volume to $5.36 billion in the last 24 hours. Whilst, the XRP price traded beyond $0.62 amid the gains. The XRP price recorded a gain of 0.48%, reaching $0.6277. However, XRP’s trading volume dipped by 3.41% to $2.08 billion.\n\nMeanwhile, the Cardano price defied the gaining trend by dropping 0.38% to $0.7323 today. Whilst, ADA recorded a 7.03% hike in its 24-hour trading volume, settling at $899.59 million. As the top crypto prices witnessed a hike, popular meme coins also followed. The Dogecoin price gained 5.45% to $0.1714 while its rival, Shiba Inu price surged by 6.85% in value and traded at $0.00003561.\n\nAlso Read: Shiba Inu Aiming For The Second Peak Of The Week\n\nTop Crypto Prices Today Are\n\nPepe Coin Rallies 20%\n\nThe Pepe Coin (PEPE) crypto, a popular meme coin, witnessed nearly 20% gains today. At press time, the Pepe Coin price was up by 18.80% to $0.000009314 with a market valuation of $3.87 billion. In contrast, its 24-hour trade volume spiked by 103.98% to $3.43 billion.\n\nFloki Soars 50%\n\nFloki (FLOKI), a popular dog-faced meme crypto, recorded an phenomenal surge of 50% and ranked as the top crypto gainer for the second day in a row. The FLOKI price soared by 46.69% to $0.0002505 at the time of reporting. Moreover, its trade volume was up by skyrocketed by a whopping 300.16% to $2.72 billion. Furthermore, the FLOKI crypto recorded a new high of $0.0002767 amid the rally recently.\n\nAlso Read: Ethereum’s Price Hits $4000 Following Bitcoin’s Record Bull Rally\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQaGxIeFdtODZqVnh0a1RFelpNelFhR2RhRjc4Z2c1UEJ1a3htaEY1eWNrZXdkZGlJT1NiR05VenVKUGY1ZUxlOWUyUW82T0NCcjg3RGRXazY0MkVjRXhmSHlOdkZNUEVsTjhlNU5KU294YlM0YUtvNVdIaTdNbTltV0xmM1ZTamVWVEpoS1VzOTRNbHBZN2NIaEFpMkYyMUoxUG5IaVBB0gGrAUFVX3lxTE1ZSl8tNlE0czlZQ0JLM0t1dzQ2RVVxZ0N3YWpROERudEpMNVhHWF9YVmNkOW5HbTNmbFJTR3lDZE5hTlZWbUNITFdBVzN5QXhLM2JpUHlBc09QcjV5eDNna0FqZTViOUg3eEh3R24wQkN0QnE1cEJZWFRGWVloZUR1b29rQ3ZHa1pIa2NfNzdpbTJsTk9PTmlnRWRtTEVWMHVIYlk2Yl96OEVSaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Crypto Prices Today March 8th: Bitcoin Nears $68K, Ethereum At $3900, PEPE & FLOKI Rally - CoinGape",
        "content": "The top crypto prices today witnessed a positive shift as the Bitcoin (BTC) price neared the $68,000 level while other altcoins gained notably. In addition, the Ethereum price surged past to the $3,900 mark. Meanwhile, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) witnessed a substantial price hike.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price held firmly above $67,000 after the recent rebound. The Bitcoin price was up by 1.75%, reaching $67,129.10 at the time of writing on Friday, March 8. On the other hand, it’s trading volume plunged by 32.72% to $44.65 billion in the last 24 hours. Meanwhile, the crypto boasted a market cap of $1.31 trillion.\n\nadvertisement\n\nTurning to altcoins, the Ethereum price gained 3.17% to $3,901.20 at press time with a market valuation of $468.61 billion. Whilst, ETH saw its trading volume slump by 36.46%, reaching $21.70 billion. Meanwhile, the Binance Coin (BNB) price surged by 9.69%, reaching $470.13. In addition, its 24-hour trade volume rose by 7.68% to $3.51 billion.\n\nThe Solana price sustained above the $140 level. The Solana price was up by 4.22%, settling at $144.54 On the contrary, SOL witnessed a 1.01% dip in trade volume to $5.97 billion in the last 24 hours. Whilst, the XRP price extended beyond $0.62 amid the rebound. The XRP price recorded a gain of 1.31%, reaching $0.6268. However, XRP’s trading volume dipped by 23.05% to $2.17 billion.\n\nMeanwhile, the Cardano price increased by 0.63% to $0.7391 today. Whilst, ADA recorded a 29.69% decline in its 24-hour trading volume, settling at $848.08 million. As the top crypto prices witnessed a hike, popular meme coins also followed. The Dogecoin price gained 8.19% to $0.1647 while its rival, Shiba Inu price surged by 8.02% in value and traded at $0.00003358.\n\nAlso Read: Bitcoin (BTC) Price Reclaims $68,000 As Bullish Sentiment Resumes\n\nTop Crypto Prices Today Are\n\nPepe Coin Soars 13%\n\nThe Pepe Coin (PEPE) crypto, a popular meme coin, witnessed over 13% gains today. At press time, the Pepe Coin price was up by 13.55% to $0.000007731 with a market valuation of $3.25 billion. In contrast, its 24-hour trade volume slipped by 41.44% to $1.67 billion.\n\nFloki Surges 35%\n\nFloki (FLOKI), a renowned dog-faced meme coin, recorded an impeccable surge of 35% and ranked as the top crypto gainer today. The FLOKI price soared by 35.16% to $0.0001705 at the time of reporting. Moreover, its trade volume was up by 1.39% to $666.67 million. Furthermore, the FLOKI crypto attained a high of $0.000173 amid the rally recently.\n\nAlso Read: Ethereum About To Hit $4K Against All Odds\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQR012MkVNcnhwbEJnZG11ZWdCb3dNQ2tBWm5pOGF2ZGJSN2V4T0lnZEdkS1N0TkdLVlp4SFgyMjc2T283cEpNbk04LUhYR1h5QlhnSER1a3Vydm5IZ0NUcUFlXzFqdHFhZzI4d1pYc1FZMEFXZm9nOGNYR0d5STNWZXRROHlrUXdZeWNwVW9wX2k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Bitcoin ETF Outflows and Stable Ethereum ETF Holdings - Blockchain.News",
        "content": "Disclaimer\n\nDisclaimer: Blockchain.news provides content for informational purposes only. In no event shall blockchain.news be responsible for any direct, indirect, incidental, or consequential damages arising from the use of, or inability to use, the information provided. This includes, but is not limited to, any loss or damage resulting from decisions made based on the content. Readers should conduct their own research and consult professionals before making financial decisions."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPcUdCSFYyQV9lVk9iR29rNnl3SUc3SFF1Z3RoQVRoeUNrRDItZjRMNkdjWVV0SmNDRGpOMDBKMGljLTlPQkpXWmlDaU5kX3FOd3BzMlRmVnBrZHVqeTM2alhhN1JxWTk5NE96RkhhbGVDT2pjY0VrbE5hdzlsT1JrU2tpb3ZLeXllM1EyU0tFUnhmWkdjMWk3bVpPZTZGUE94bnFma9IBqgFBVV95cUxON01XcUJCbmtsMmN4RTRTeXYyZWZRdjJPYXUzZXZ6QWlBajh0S1ZLdkdpM180LTJYYWYxQzh1VThKQWQ1ZERYV3lrU1VRb0RkYllDSWdPdC1sd09VVWlGM1Z2TElhdmFCRy1fT3pscGdMSmFqRVBKU09LRDBPSU01d3psbkpkNEJJTlZoenNyaHdVSzRodGZPLXNCRmIyanRtdS1NVEtRTDhkQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Crypto’s wild ride and should you be on it? - Hindustan Times",
        "content": "By now, most news headlines have reported a bull run in cryptocurrencies led by Bitcoin and Ethereum. While Bitcoin is the king, its younger sibling Ethereum, is not far behind. Even as retail investors try to comprehend all this, high net worth individuals (HNIs) had already parked anywhere between 1-3% of their monies here. Bitcoin cryptocurrency (Representative Photoi)\n\nWhen asked for a perspective, Krishna Jha, a Bengaluru-based private investor, said, “The next bull run has started, and prices will go higher than they did earlier.” But Jha says he is unwilling to bet on cryptocurrencies. “My crypto holdings are zero.” What he does hold are through Exchange Traded Funds (ETFs) based out of the US.\n\nImagine a treasure chest filled with a limited number of gold coins. Their rarity and value make them highly sought-after. Bitcoin operates on a similar principle. Unlike currencies printed by governments, there is a cap on the total number of Bitcoins that can ever exist: roughly 21 million. This scarcity fuels its value, especially when demand starts to rise.\n\nAlso Read: Bitcoin back on the rise after vaulting to new record\n\nWhat adds to the scarcity value is that every four years, the number of new Bitcoins that can be mined will decline by half. The next halving is scheduled to happen in April this year. Think of it as the treasure chest to which access gets more limited. So, this much-anticipated event in April is driving the price of Bitcoins higher due to more demand chasing a smaller pool of assets.\n\nThen there is the fact that traditionally, buying Bitcoins involves navigating complex cryptocurrency exchanges and secure storage wallets. This was intimidating for new investors. However, with the government allowing Indian investors to buy Spot Bitcoin ETFs in India, the game has changed.\n\nThese ETFs function similarly to mutual funds. To place that in perspective, if you need biscuits, you don’t build a biscuit factory. Instead, you buy a packet(s) that suits your needs. As opposed to this, a regular Bitcoin miner has the infrastructure to build a factory. With a Spot ETF, the option to buy a packet of biscuits exists along with other assets, like you would in a mutual fund where you buy a basket of stocks. This is easier to handle and opens the doors for investors to buy Bitcoins indirectly. The doors have opened for more people, which explains retail investor interest.\n\nAs for Ethereum, the proposition is slightly different. It aspires to be the “world’s computer”. And of the thing it hopes to do is compete to be a global banking system. That means it is a potential competitor to Finacle built by Infosys. As we talk, Finacle is a core banking product that banks use to provide digital services. It is a centralized system banks use to manage accounts, process transactions and offer various services securely and efficiently.\n\nAlso Read: Bitcoin price briefly tops $69,000 for new all-time high\n\nAs opposed to that, Ethereum is a massive, global network of computers (nodes) that can run software applications in a decentralized way. Ethereum’s key feature is its ability to run smart contracts. Think of it as self-executing contracts where the terms of the agreement are directly written into code. They automatically enforce and execute the terms of a contract when conditions are met, without the need for a middleman. This can be used for a wide range of applications, from financial agreements to voting systems.\n\nAnd ETH is the native cryptocurrency of the Ethereum network. Call ETH the fuel or gas which powers the Ethereum ecosystem. Critics of Ethereum were unconvinced of its ability to scale. However, the upcoming “Dencun” upgrade on Ethereum in mid-March aims to improve its efficiency and scalability. This could attract more developers and users to the platform, potentially driving up the demand for ETH.\n\nTanuj Bhojwani, a Bengaluru-based public policy wonk and fintech analyst is clear that “The bull market is most definitely back.” That being said, Bhojwani also pleads caution. “Crypto is mostly a degenerate bet that many young people will take. And now that institutions have gotten in, the party will be wild for a few weeks.” Bhojwani’s comments are worth thinking hard about: Is it okay for people to take these bets? For that matter, can they handle a wild party? Perhaps not just yet."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPaGNaZW1QRmNhYVhFbnRnRHJiV2U5MWJzR2N4bzdMblNVZ2xIbUMtWVFJTkgwa0NDQzFBamMwZTBvd2FDQkY4OEl6VDJxaWlyYll4WF9rS3hXbkJLNnpOYzNQOVg3RC1xTEtIa2otOXZZbFB4eG1tMGdweXJUSTVZUkd1YTFHN050OXd3MW9SRy1lT3hFUDEtSC1GYkpfWl9OeVBFYkpKZXRySHBmSmfSAbMBQVVfeXFMTnVpSmx2MTFNMVgyZHdRWjBhMU5rQ09BVmNIMUkyYVFkWWRQLW51YWY3UlNTNDZLQmJyME1uM0tXd092M0RwaEJHMTVLN0laclZ2UV8zMnJVd1NPRThidHAxcU5kUU13UzBTcWsxX2R2aUREcEhYamp3SjJDX2E5c2M2Wk5oQ21LYmd5VXZGNjd0MkRITUkyYnJram9aN2FtbDB6N194N2dZX0lnbjNzLS1wLWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "ETH/BTC Price Analysis: Top Reasons Why Altcoin Season Calls After Bitcoin Rally - CoinGape",
        "content": "ETH/BTC price analysis: Bitcoin price hit a new all-time high this week but dumped massively below $60,000. The sudden move caught many players by surprise, with Ethereum falling to $3,200 support. Liquidations hit leverage investors hard as more than $1 billion in value exited the market.\n\nNow that Bitcoin has recovered above $67,000 investors are gradually turning to select large, mid, and small-cap altcoins speculating on further gains ahead of the Bitcoin halving.\n\nadvertisement\n\nIt is believed that Bitcoin’s surge to a new record high of $169,000 was partly due to the spot ETFs and the halving expected in March.\n\nEthereum, the second-largest crypto is buoyed by the upcoming Dencun upgrade alongside bullish sentiment of recirculation of gains from Bitcoin. The crypto market often moves in cycles, the four-year halving cycle being the most popular.\n\nIn the bull market, Bitcoin is usually the first to rally followed by large-cap altcoins like Ethereum and Solana. The altcoin season ignites as capital flows from the top into mid-cap tokens and finally small-cap coins.\n\nBased on the ETH/BTC price chart, altcoins are moving closer to the breakout threshold. Investors reference this chart when speculating on the start of the altcoin season — believed to dramatically grow crypto portfolios.\n\nETH/BTC Price Analysis: Ethereum Price Rally Beckons\n\nEthereum is trading at $0.058 against the largest crypto Bitcoin. The pair’s immediate downside holds above support provided by the 200-week Exponential Moving Average (EMA).\n\nDespite the growth in Ether’s price in the last few months, a larger hurdle represented by the yellow band on the chart has been a major bottleneck since October 2023.\n\nFor all the times Ethereum has strengthened against Bitcoin since the bull market in 2021, the ETH/BTC exploded by more than 40%, reaching highs around 0.085.\n\nKnowing the right time to start buying altcoins is every crypto investor’s desire. Hence, timing ETH/BTC breakout above the yellow band and subsequently past the falling trendline resistance could trigger FOMO not only in Ethereum but across the altcoin market.\n\nThe ETH/BTC pair must also rise above the Ichimoku cloud to back the rally fully. However, waiting for such a move might mean catching the rally too late and missing out on most of the gains.\n\nWith that in mind, it might be wise to start buying more altcoins as soon as the ETH/BTC pair spikes past the trendline and the yellow band resistance — and waiting for the next Ichimoku bullish signal while in position.\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQbEhHQVNkX0pZeE5jaXFlWDVQWVI2S0RjR2ZlN3hXd3RhZWpDRlBnbll2NUFhanNlR2FycWQ1NlQzZk1SbURwMWRLc3NJbV8tb0w2aGxPeUxFZkNhbFNsTUR2Tk1weEsyWUVmUVNwOHQ0Q00yaUZvNmlUQTZiVGJEeEpFRGowTlhwdmFiTVJOSjFTa0FfLVJpM1E0S1pUdHljMmk2cy1MOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Ethereum and Solana Surge Toward New Peaks: But Can The Rally Last? - Crypto News Australia",
        "content": "Ethereum and Solana have outperformed some competitors like Avalanche and XRP, with ETH and SOL registering week-on-week gains of 15% and 6.6%, respectively.\n\nEthereum’s price surge is fuelled by anticipation around Spot Ethereum ETFs and the significant network upgrade coming up.\n\nSolana’s bullish sentiment is driven by its potential to hit a significant price milestone and Pantera Capital’s initiative to purchase SOL tokens at a discount from the FTX estate.\n\nBoth Ethereum and Solana have seen solid gains over the past week—similarly to Bitcoin but outperforming other major assets like Avalanche and XRP. Week-on-week ETH grew by 15%, SOL by 6.6%, BTC by 9%, while XRP only managed 4.8% and AVAX remained relatively flat (up 0.3%).\n\nEthereum (ETH), 7-day graph, source: CoinMarketCap\n\nEthereum Upgrades, ETF Hopes, Fuel Fire\n\nWith the ETH price nearing USD 4k (AUD $6k), and Bitcoin breaking through all-time highs recently, the question is when the second largest crypto will follow suit.\n\nRelated: MicroStrategy Issues $700M in Convertible Notes to Fund Bitcoin\n\nThe first of two catalysts which could push Ethereum’s price up higher is the May deadline for a decision on Spot Ethereum ETFs.\n\nAdvertisement\n\nThis is something analysts give a fair chance—although questions remain around whether the Securities and Exchange Commission (SEC) believes Ethereum is sufficiently decentralised and doesn’t classify as a security. And SEC chair Gary Gensler doesn’t do much to put investors’ minds at ease here either.\n\nAnd then there is the Ethereum Dencun upgrade, driven by the introduction of proto-danksharding from Ethereum Improvement Proposal 4844. The upgrade aims to revolutionise the network by enhancing ‘rollups’ through a new transaction type called ‘blobs’.\n\nThis advancement promises to significantly reduce transaction fees and increase efficiency for dApp developers by enabling quicker and more efficient transaction batching, particularly benefiting Layer 2 solutions like Optimism and Arbitrum.\n\nMore broadly, there are a number of other events still causing volatility in March:\n\nAfter Bitcoin reaches its all-time high, there are still a large number of events that will cause price fluctuations in March, including CPI data, ETH Dencun upgrade, NVIDA conference, FOMC, SEC VS RIPPLE, etc. pic.twitter.com/hpRY2teU6u — Wu Blockchain (@WuBlockchain) March 6, 2024\n\nSolana Sentiment Turns Bullish\n\nAnalyst at market intelligence platform Santiment said Solana is nearing a significant price milestone, potentially reaching USD $150 (AUD $226) for the first time since January 16, 2022. The fifth largest crypto is witnessing a cautiously optimistic sentiment among investors and traders.\n\nSolana (SOL), 1-month graph, source: CoinMarketCap\n\nThe analysts say the prevailing mood is somewhat bullish, indicating a positive outlook on Solana’s (SOL) value and its potential for growth. However, the bullish sentiment is not seen as overwhelmingly strong to the point of inducing fear of missing out (FOMO), which could lead to an unsustainable bubble and subsequent sharp correction\n\nMeanwhile, according to a Bloomberg report, Pantera Capital, a USD $5.2 billion (AUD $7.84 billion) crypto asset manager, is raising funds to purchase SOL tokens at a significant discount from the bankrupt FTX’s estate.\n\nThrough the Pantera Solana Fund, they aim to acquire up to USD $250 million (AUD $376 million) worth of SOL tokens, offering them to investors at 39% below the 30-day average price, or at USD $59.95 (AUD $90.39), with a vesting period of up to four years.\n\nRelated: CNA Weekly Roundup\n\nThis strategy enables FTX liquidators to release SOL tokens, potentially benefiting creditors without adversely affecting the token’s market price. The estate’s holding of 41.1 million SOL, approximately 10% of the total supply, is valued at USD $5.4 billion (AUD $8.14 billion)."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTE9fMDVQRFBNSnRpdTBHaV9Na2lid0g0YmxlWVMwVWRtTWwzbmNMOE1SY3I5SFB2SDBCcEhCXzVva1ZQbTJEWkRiT296ZFVjbkpsajhTdVR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Investing in NEO (NEO) – Everything You Need to Know - Securities.io",
        "content": "NEO is one of the top cryptocurrencies in the world. This coin managed to capture the imagination of the Asian markets, even during times of regulatory uncertainty. Today, the NEO ecosystem is more vibrant than ever thanks to the hard work of developers and participation from the community.\n\nWhat is NEO?\n\nNEO is a non-profit community-based blockchain project that entered the market to provide Dapp developers with an easy-to-utilize platform. Specifically, NEO is an open-source blockchain and cryptocurrency. According to the company's whitepaper, NEO functions as a “distributed network for the smart economy.” Notably, NEO translates to new and young in Greek. The name is appropriate when you consider that the platform is seen by many as a newer and younger version of Ethereum.\n\nChinese Support\n\nNEO was China’s first blockchain project to receive a nod of approval from regulators. Interestingly, the Chinese government has embraced the project, even after shuttering exchanges in the country. The firm is one of only a select few cryptocurrencies allowed to operate in China at this time. This support and the nationalistic feeling behind the project have led many to call the project “Chinese Ethereum.”\n\nWhat Problems Does NEO Correct\n\nNEO seeks to tackle a multitude of issues facing the market. Primarily, NEO is meant to act as a more flexible alternative to Ethereum. The company utilizes a philosophy that evaluates design choices on a multivariate spectrum. In this way, Neo can adjust its market approach accordingly.\n\nFor example, NEO developers can decide based on each particular use case what level of decentralization/centralization is most appropriate for a project. They can also make similar judgments on other important issues such as the level of on-chain/off-chain governance. These options provide NEO with more use case scenarios for large scale adoption in both the commercial and governmental sectors\n\nHow NEO Works\n\nThe NEO blockchain can accommodate a wide variety of digital assets. For example, the network features full support for blockchain assets, digital identity, and smart contracts. The platform can support decentralized apps (dApp) of all types, tokenization of real-world assets, and initial coin offerings.\n\nTwo Heads\n\nNEO is a public platform that also leverages the Onchain network to create an optimal governance scenario. The interoperability of the networks extends the platform's reach to new heights. It also combines these project's communities to leverage developments across the network.\n\nOnchain\n\nOnchain was founded in 2014 in China. This private blockchain company is best known for its focus on government and large enterprises. The platform is well-known for its Decentralized Network Architecture (DNA) tech. This protocol simplifies the creation of public and private blockchains.\n\nTwo-Tokens\n\nNEO utilizes a two-tiered system to provide the network with more flexibility for users and developers. The ecosystem relies on both NEO and GAS tokens. In total, the firm will issue 100 million of each token. There are currently 70,538,831 NEO in circulation.\n\nNEO Tokens\n\nNEO is the cryptocurrency of the NEO blockchain. This crypto represents a share of ownership in the NEO blockchain. This crypto also plays a role in governance. It allows the community to create blocks and manage the network. Interestingly, NEO has indivisible units and cannot be divided like other coins such as Ethereum. The reasoning behind this decision is that each coin is meant to act as a single share in the NEO blockchain. Just like stocks, these coins cannot break down into smaller units.\n\nGas Tokens\n\nGAS is the utility token for the NEO network. This token was formerly known as ANC- Antcoins. In the ecosystem, GAS functions like Ether in the Ethereum network. Developers use GAS for transactions in the network. Additionally, users receive rewards in GAS tokens.\n\nGAS generates at a rate of eight GAS per block. The network automatically reduces the number of rewards per block after two million confirmed blocks. Users have options with GAS. You can trade GAS for other cryptocurrencies such as Bitcoin, Litecoin, or Ethereum. You can also convert your GAS to NEO directly. In this way, GAS pricing remains decoupled.\n\nCoding Smart Contracts\n\nNEO provides developers access to a powerful virtual machine that simplifies the most critical components of smart contract programming. For example, developers don't need to learn a new coding language to use the platform. The network allows smart contracts in C#, Java, Python, plus a wide variety of other coding languages. In this way, the network can accommodate developers from across the industry.\n\nConsensus\n\nNEO introduces the world to the Delegated Byzantine Fault Tolerance (dBFT) consensus mechanism. In this mechanism, there are certain nodes known as Bookkeepers. These digital accountants do the actual block verifications. The data is broadcast on the blockchain. Only when two-thirds of the nodes on the network agree with a bookkeeper’s version of the blockchain is consensus achieved.\n\nFaster Throughput\n\nThe dBFT consensus mechanism is fast, really fast. It can handle more than 1,000 transactions per second. In comparison, Bitcoin handles around six transactions per second (tps). Ethereum can handle a whopping 12 tps. Impressively, NEO seeks to push its tps rate to new heights with their next upgraded. The goal of the update is to take the network to an insane 10,000 transactions per second.\n\nGovernance Upgrade\n\nIn May 2020 the developers behind NEO proposed a major upgrade to the network. The upgrade would introduce a new governance model. The new strategy enables coin holders to vote for a committee of 21 governing members. These members hold the responsibility of representing the community. They gain the ability to vote on various modifiable parameters of the blockchain and other changes to the network's coding.\n\nThe proposal suggests that people that vote for these members receive extra GAS rewards. This reward is a means of thanking members for their participation in the governance process. The proposal states that out of the 21 chosen governing members, seven will also become consensus nodes.\n\nAs a consensus node, their responsibilities will extend to validating blocks. Additionally, these seven members gain veto powers. To make a veto decision, the consensus nodes must obtain two-thirds support from the community.\n\nHistory of NEO\n\nNEO entered the market as Antshares back in February 2014. This firm is the brainchild of two longtime blockchain enthusiasts, Erik Zhang and Da Hongfei. During this time, the actual cryptocurrency went under Antshares (ANS). In 2014, the two developers expanded their vision with the creation of Onchain.\n\nIn April 2016, NEO releases its whitepaper officially. The paper highlighted the benefits and technical aspects of the delegated Byzantine Fault Tolerance. At the time, this was the first Chinese born consensus mechanism. As such, it received heavy media coverage in the region.\n\nIn August 2016, NEO entered the market via an ICO. The event was a major success with the project securing over $4.5 million in funding. These funds went to the further expansion of NEO's strategy in the region. In September of the same year, Onchain established a Technology Strategic Partnership with Microsoft. The agreement inked cooperation on multiple projects.\n\nIn June 2017, Antshares rebranded to NEO officially. The crypto also received its first US-based support this year. Specifically, the coin saw a listing on Bittrex. The next year, the digital ID platform VALID announced a strategic partnership with the firm.\n\nNEO3\n\nThis year saw the announcement of a major upgrade. The NEO3 upgrade is set to be the company's largest to date. In addition to the introduction of the new governance models, the upgrade will bring more interoperability into the sector. Specifically, the platform will gain more cross-chain capabilities. Currently, developers are experimenting with these protocols. They have set up Testnets with Bitcoin, Ethereum, and Ontology.\n\nTokenization\n\nThe upgrade will also simplify the tokenization process. Specifically, developers want to make it easier to create and issue Non-fungible tokens. Non-fungible tokens are unique digital representations of an asset. Some examples of non-fungible tokens include the tokenization of:\n\nSecurity Tokens\n\nStocks\n\nREITs\n\nArt\n\nCars\n\nEvent Tickets\n\nOther Physical Assets\n\nHow to Buy NEO\n\nNeo (NEO) is currently available for purchase on the following exchanges.\n\nUphold – This is one of the top exchanges for United States & UK residents that offers a wide range of cryptocurrencies. Germany & Netherlands are prohibited.\n\nKuCoin – This exchange currently offers cryptocurrency trading of over 300 other popular tokens. It is often the first to offer buying opportunities for new tokens. USA Residents are Prohibited.\n\nWazirX – This exchange is part of the Binance Group, which ensures a high standard of quality. It is the best exchange for residents of India.\n\nUphold Disclaimer: Terms Apply. Cryptoassets are highly volatile. Your capital is at risk. Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment, and you should not expect to be protected if something goes wrong.\n\nHow to Store NEO\n\nThere are a few ways to store your NEO. The important thing to remember is that you only want to store your crypto in a wallet that allows you to earn your GAS rewards. The NEON wallet is one of the best options for investors seeking to earn their rewards.\n\nImpressively, you can also earn GAS rewards using a hardware wallet. The Ledger Nano S or the more advanced Ledger Nano X is able to connect to your NEON wallet directly. You can then send, receive, and get your rewards from one safe wallet platform Notably, NEON is not the core wallet for the network but it has received unmatched community support and has the blessings of the developers.\n\nSummary\n\nGiven NEO's unique stance in the Asian markets, it’s hard to imagine anything but success for this platform. These developers continually upgrade the network with NEO3 set to release in the coming months. For now, NEO shares a top spot in the crypto market as one of the premier Dapp development platforms available."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMi8gFBVV95cUxONmlqTU80MFlBNFdHWWJVek95dkRqS3dKZTN0NVlFZFhocE5NSGZmdUZHZlh3SmpjMElCSjczMDVXWEhjNHNZOU5IN0Y0VzBGNk95UkxqTWZvcUh2aFBHT3Q3eFVwSVN2TzVtYzhIcEhXOGxZSnJoR2tyMWJ4UG44dENIdURNdGZHUk5UeUxoR3ZDaE5QdlhLeXo4WGxlWmhLUHRaNXh1aXhOR09TTllPRTR5ZkRBWklIa3d4MENqLU9wNk4ybHRmQU9wd1Jwa3o5ZUYyQzJtWGVsVkVpOFpRNGpyNHplbEFWWTRMM2RLaURFUdIB9wFBVV95cUxQYmVrdXJGaWJEc3kxVHFNQkJNOWc3WTJDR0oydzVFYU8wOFREOVctTlcteUhFQlV0eEVzYndTWmJGeEl1elFPQ3NWSHRPQ3NYdUVxanNYVlFnMjg1UGdPdkdDZlNzOU9NcVZTeWJTSERGcnhYY096czVfRDBBSmEtbUo4MXdNMTVBLU55SW9tajdpOGZyOXcwV1NNYkV1NjdlRzJGQXowaUc0cnM4Y2pwdlpBN0p6ZUU5WGdLUU9Ic0tzSHpnYURaeWVmdHJyMXRrVGtXVlVXVUhOQ1UtWThKODdFaTB3em9HajhkNzRBRzdsLUdOWHNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Crosses $67,000, Ethereum Approaches $4,000 - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, crossed the $67,000 mark early Friday as it slowly looks to consolidate at around its all-time high of $69,000. Ethereum (ETH) is also slowly charting its course towards the $4,000 mark as overall market sentiment stands at ‘Extreme Greed’ for investors, as per CoinMarketCap data. Other popular altcoins — including the likes of Dogecoin (DOGE), Ripple (XRP), Solana (SOL), and Litecoin (LTC) — landed in the greens across the board. Memecoin FLOKI emerged to be the biggest gainer, with a 24-hour jump of over 32 percent. FLOW, on the other hand, became the biggest loser, with a 24-hour dip of over 6 percent.\n\nThe global crypto market cap stood at $2.56 trillion at the time of writing, registering a 24-hour gain of 2.14 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $67,183.33, registering a 24-hour gain of 1.91 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 57.65 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $3,910.48, marking a 24-hour gain of 3.68 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 3.33 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour jump of 6.98 percent, as per CoinMarketCap data, currently priced at $0.1638. As per WazirX, Dogecoin price in India stood at Rs 14.04.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 4.31 percent. At the time of writing, it was trading at $88.62. LTC price in India stood at Rs 7,500.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.6281, seeing a 24-hour jump of 0.74 percent. As per WazirX, Ripple price stood at Rs 54.05.\n\nSolana (SOL) Price Today\n\nSolana price stood at $144.98, marking a 24-hour gain of 4.52 percent. As per WazirX, SOL price in India stood at Rs 11,900.\n\nTop Crypto Gainers Today (March 8)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nFloki (FLOKI)\n\nPrice: $0.0001685\n\n24-hour gain: 32.67 percent\n\nTHORChain (RUNE)\n\nPrice: $7.11\n\n24-hour gain: 31.34 percent\n\ndogwifhat (WIF)\n\nPrice: $2.08\n\n24-hour gain: 18.44 percent\n\nPepe (PEPE)\n\nPrice: $0.000007876\n\n24-hour gain: 16.10 percent\n\nEOS (EOS)\n\nPrice: $1.25\n\n24-hour gain: 15.29 percent\n\nTop Crypto Losers Today (March 8)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nFlow (FLOW)\n\nPrice: $1.31\n\n24-hour loss: 6.54 percent\n\nNEAR Protocol (NEAR)\n\nPrice: $5.39\n\n24-hour loss: 5.87 percent\n\nFlare (FLR)\n\nPrice: $0.04006\n\n24-hour loss: 4.29 percent\n\nInternet Computer (ICP)\n\nPrice: $14.69\n\n24-hour loss: 3.98 percent\n\nWorldcoin (WLD)\n\nPrice: $7.29\n\n24-hour loss: 3.92 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “In the past 24 hours, Bitcoin has been actively trading at the $67,000 level, showcasing a renewed bullish trend driven by growing investor sentiment. The $65,000 level is witnessing strong support from bulls, pushing prices higher. Resistance is expected at $69,000 and $70,200. The influx of capital from traditional finance into spot Bitcoin ETFs is playing a pivotal role in the ongoing price surge, coupled with positive sentiment ahead of the imminent Bitcoin Halving.”\n\nRajagopal Menon, Vice President, WazirX, said, “Bitcoin is currently trading at $67,277 with 1.57% growth and has dominated recent attention, but Ether is poised for substantial growth in 2024. Analysts anticipate Ether (ETH) doubling or more from current prices, possibly reaching $8,000 to $10,000. The Dencun upgrade, set for this month, promises cheaper transactions on Layer 2 networks, driving increased activity. Additionally, excitement surrounds spot Ether ETF applications, with a regulatory decision in May.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The second-largest cryptocurrency now seems to be leading the crypto market. Ethereum almost touched $4000 after 2 years and recovered faster than Bitcoin since the dip on Tuesday. There have been talks of an ETH spot ETF, which could replicate Bitcoin's price momentum after the Bitcoin Spot ETF approval. Meanwhile, Blackrock has submitted another application to acquire Bitcoin ETFs for its global allocation fund with the SEC.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE1YcW9ONGlnUzkxVHJJVFpkX3A5LUVMSU5yLXRXVjZCMUpNTi1vc2hzRGlHVllVQktaVjNTU0RWa2xuZHJzZGN2dGktb0N3M1hVa2hRVVNGVXczRXF5MUJJU1FuSEJWMHZ6d2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Investing In Wrapped Centrifuge (WCFG) – Everything You Need to Know - Securities.io",
        "content": "Wrapped Centrifuge (WCFG) operates as a synthetic on the Ethereum blockchain ecosystem. The goal of WCFG is to expand Centrifuge users’ functionality and usability. The protocol enables Centrifuge users to leverage the vast Ethereum DeFi ecosystem to further their ROIs. Notably, Ethereum is the largest DeFi and Dapp network in the world.\n\nTo understand WCFG, you first need to look at the Centrifuge decentralized finance (DeFi) lending protocol. Centrifuge is a popular P2P lending application that enables users to secure profits via large lending pools. The project is unique in that it introduces credit into the DeFi sector. The goal of Centrifuge is to bridge the gap between several real-world assets by integrating pooled liquidity into the world of traditional finance.\n\nWhat Problems Does Wrapped Centrifuge (WCFG) Solve?\n\nAnother goal of WCFG is to make credit more accessible to small businesses. Businesses with good credit can access funding from centralized sources in an undercollateralized manner. Centrifuge seeks to bring that option to DeFi. The Ethereum DeFi ecosystem is massive. You can gain access to near-endless yield generation features. WCFG enables Centrifuge users to leverage these systems without giving up ownership of their original assets.\n\nLack of Interoperability\n\nOne of the main issues that WCFG helps to eliminate is the complete lack of interoperability currently plaguing the DeFi sector. There are a variety of top-performing networks, but few have the ability to conveniently and cost-effectively exchange data and value. WCFG is one way that Centrifuge users tackle this issue head-on.\n\nHigh Fees\n\nConverting CFG tokens to ETH is an expensive task when done on an exchange. The current gas fees of the Ethereum network add to the overall cost and delays of transactions. WCFG is faster and cheaper to create than converting your tokens directly.\n\nBenefits of Wrapped Centrifuge (WCFG)\n\nThere are a lot of advantages that WCFG brings to the table. For one, users can gain access to multiple passive income streams. Once you wrap your Centrifuge, you can then join major DEXs (decentralized exchanges) and arbitrage trade with more liquidity. You can also take advantage of the farming and staking protocols Ethereum has to offer.\n\nStaking is a great option for wealth generation for many reasons. Specifically, when you stake your tokens you don’t risk losing the primary asset. It’s easier to stake than to trade and secure consistent returns. Additionally, most staking protocols have a yield generation calculator that shows you exactly what your rewards will be based on your stake and the time. This feature provides you with a stable yield.\n\nMore Centrifuge Uses\n\nAnother benefit of WCFG is that it can be used in more Dapps. Dapps are seen by many as the main driving force behind crypto adoption. The more Dapps a protocol has and the more likely there are active users on the network daily. Centrifuge users can now participate in the vast Ethereum DeFi ecosystem using WCFG.\n\nHow Does Wrapped Centrifuge (WCFG) Work\n\nWrapped Centrifuge starts off as regular CTF. When a user wants to bridge the token onto the Ethereum network they will first use the wallet bridging feature to lock the token into a network smart contract. Notably, users can easily swap their tokens from CFG and WCFG using the dashboard. This option can be helpful when attempting to keep up with emerging trends or taking advantage of new Dapps hitting the market. This step locks the tokens up in a bridge account on the Centrifuge chain. The contract will then issue you a WCFG token in return. This token lives on the Ethereum blockchain. It represents the value of CFG on a 1:1 ratio.\n\nToken\n\nThe WCFG token operates as a synthetic asset on the Ethereum blockchain. The system leverages oracles to track and lock the value of CFG to WCFG tokens directly. Users can enjoy the benefits of the entire Ethereum ecosystem using WCFG. They can then convert their tokens back to CFG to leverage Centrifuge's lending and borrowing services at any time.\n\nCFGs\n\nThe native token of the Centrifuge network is CFG. The token lives on the Centrifuge Chain. Notably, the Centrifuge chain is a high-performance decentralized network that was based on Polkadot. CFG holders can take part in a vast array of features including staking, paying for transaction fees, and participating in the network's governance options.\n\nGovernance\n\nWCFG users need to convert their tokens back into CFG tokens to participate in the network's governance features. The protocol leverages a DAO (decentralized autonomous organization) to provide voting options to all users who hold CFG tokens. Users have the right to put forth network upgrades, changes, fee alterations, and more. They can also vote on token burns and buybacks. This flexibility helps to keep the community in the loop and improves the overall transparency of the network.\n\nThe Rise of Wrapped Tokens\n\nThe wrapped token concept continues to expand throughout the market. Originally, the wrapped token idea focused on bringing Bitcoin into the Ethereum ecosystem. This maneuver improved the overall liquidity of the Ethereum market significantly. Now, developers of other platforms are eager to follow suit.\n\nWCFG represents the evolution of the wrapped token concept. You now have completely different DeFi ecosystems communicating and leveraging each other’s features via wrapping protocols. As such, you can expect to see this concept only grow in popularity moving forward.\n\nHow to Buy Wrapped Centrifuge (wCFG)\n\nCurrently, Wrapped Centrifuge (wCFG) is available for purchase on the following exchanges.\n\nUphold – This is one of the top exchanges for United States & UK residents that offers a wide range of cryptocurrencies. Germany & Netherlands are prohibited.\n\nUphold Disclaimer: Terms Apply. Cryptoassets are highly volatile. Your capital is at risk. Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment, and you should not expect to be protected if something goes wrong..\n\nWrapped Centrifuge (WCFG) – A Smart Idea with Great Timing\n\nThe timing behind the integration of WCFG is excellent. The DeFi market is on the rise with more platforms entering service weekly. Centrifuge has proven to be a reliable and secure way for DeFi users to secure passive income. The integration of wrapped protocols into this network only strengthens its position in the market. It also provides CFG token holders with another reason to HODL their coins, as the demand for these flexible assets could increase alongside the added functionalities."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTFBkVEQxQnI2bjF0QWhCWFB0S19Yb3BLbExnUnBaMThMWUZCdEVyaVhobWtBbTVCck1ZLUJKZkxYRThocFBsZUFVelFYaHg1YmZLcmxlaWN5SWlfaUdQNGwxRno5aHE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Investing In Clover Finance (CLV) – Everything You Need to Know - Securities.io",
        "content": "Clover Finance (CLV) is a blockchain infrastructure provider designed to provide more interoperability between the Polkadot and Ethereum networks. The protocol introduces some proprietary features that make it unique including multi-chain developer tools and full DeFi capabilities. As such, the network continues to see growing adoption.\n\nWhat Problems Does Clover Finance (CLV) Solve?\n\nClover Finance solves one of the biggest issues facing Ethereum and Polkadot users, a lack of interoperability. Ethereum is by far the largest DeFi ecosystem in the world. However, the network is a second-generation blockchain that suffers from scalability issues.\n\nNetwork congestion increases the gas fees for Ethereum users. Consequently, the recent explosion of the DeFi and NFT (non-fungible token) sectors has resulted in record high fees for users. These fees have sent developers and users in search of more cost-efficient alternatives. One network that has seen a lot of potential as another option is Polkadot.\n\nPolkadot is faster than Ethereum due to its technical structure. However, the Polkadot DeFi ecosystem is much smaller than Ethereum. By allowing these networks to communicate data freely, the problem of interoperability and scalability can be resolved. Developers can use each network for its strongest qualities. For example, imagine a Dapp that leverages Ethereum’s security with Polkadot's scalability.\n\nBenefits of Clover Finance (CLV)\n\nClover Finance provides a lot of benefits to the market. The developers took great care to simplify the onboarding process for both users and developers. For example, the network is 100% EVM compatible. The network's compatible framework for Substrate based applications streamlines the migration of existing Dapps from Ethereum to Polkadot.\n\nGas Fee\n\nClover Finance introduces a new fee structure to the market. The network has an identity-based gas fee schedule. Those who participate in the network more, and handle more transactions, pay fewer fees. This strategy incentivizes users and helps build value in the CLV token.\n\nAdditionally, the system integrates a fee relay system. This protocol enables you to pay fees on behalf of other addresses. Notably, a portion of these fees gets distributed to the network nodes maintaining the blockchain with the rest going towards Dapp developers building applications that can expand the reach of the network.\n\nSecure\n\nSecurity was a main priority for the development team. They integrated enterprise-level protections to protect users and data from hackers. For example, end-to-end secure communication is used in all network functions. This includes functions such as when signers notarize Polkadot block headers or when they act as witnesses for Ethereum VM instances.\n\nStaking\n\nUsers can stake their CLV and help secure the network. There are two ways you can participate in the staking features and earn rewards. You can stake tokens and nominate yourself to be a node validator. You can also nominate other nodes for the position. The more tokens you stake and the higher your reward payouts.\n\nHow Does Clover Finance (CLV) Work\n\nClover Finance is able to bridge these two networks due to its multi-layered and decentralized structure. This design enables the platform to operate in a trustless manner, free of human intervention and centralized governance. These are the four layers that lay the foundation for the network.\n\nStorage Layer\n\nThe first layer of the network is the storage layer. Here is where vital information such as transaction data and the state of the network resides. Nodes interact with this data to complete network tasks.\n\nSmart Contract Layer\n\nThe Smart Contract layer is where developers can create and test their protocols. Placing the smart contracts on this layer lowers the overall cost of executing these codes. Notably, users need CLV to deploy smart contracts and Dapps on Clover.\n\nDeFi Protocol Layer\n\nThe DeFi Protocol layer enables developers to provide advanced DeFi features in their works. DeFi is one of the fastest-growing sectors in the crypto market. Features such as staking and farming provide a low-risk way for new users to secure rewards.\n\nExternal Dapp Layer\n\nThe External Dapp Layer is a game-changer. The developers separate the Dapps to provide more storage and expandability. The main advantage of this approach is that developers can seamlessly deploy their Dapps without using other virtual machines or network bandwidth.\n\nSPV Chain Simulation Technology:\n\nAnother core component of the Clover Finance network is the SPV Chain Simulation Technology. This mechanism operates as a two-way peg system between blockchains. Specifically, the system utilizes BIP-Schnorr compatible threshold signatures to enable seamless cross-chain communication between networks. It also provides a simplistic way for EVM-based Clover addresses and Polkadot-based Clover addresses to be bound.\n\nMulti-chain Wallet\n\nThe Clover Finance network wallet operates as a multi-chain system that streamlines your daily crypto tasks. This versatile wallet can connect to Ethereum, Polkadot, Kusama, Binance Smart Chain, Avalanche, Fantom, and Edgeware blockchains. It’s also able to simultaneously connect with Web3js-based dapps and Polkadotjs-based dapps. This approach makes it possible to carry out tasks such as viewing the balance of multi-chain assets from one window.\n\nCLV\n\nThe CLV token operates as a multi-use asset within the Clover Finance network. Users can pay for network transactions and initiate EVM instances using the token. You can also stake the token to secure network rewards. Notably, CLV integrates cross-chain compatibility using a 2-way peg bridge technology. You also need to hold CLV to participate in the network's governance system.\n\nConsensus\n\nClover Finance improves scalability and network responsiveness via the use of an advanced Nominated Proof-of-Stake consensus mechanism. This system provides users with the chance to become validator nodes or nominate others. Those who nominate others get a share of the rewards based on the number of tokens staked.\n\nHistory of Clover Finance (CLV)\n\nThe world got introduced to the Clover Finance concept in May 2020. A year later in July 2021, the platform officially launched its mainnet. Clover Finance was co-founded by Viven Kirby, Norelle Ng, and Burak Keçeli. Notably, the network secures $38 million during its Coinlist token sale.\n\nHow to Buy Clover Finance (CLV)\n\nClover Finance (CLV) is available for purchase on the following exchanges.\n\nUphold – This is one of the top exchanges for United States & UK residents that offers a wide range of cryptocurrencies. Germany & Netherlands are prohibited.\n\nUphold Disclaimer: Terms Apply. Cryptoassets are highly volatile. Your capital is at risk. Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment, and you should not expect to be protected if something goes wrong.\n\nCoinbase – A publicly traded exchange listed on the NASDAQ. Coinbase accepts residents from 100+ countries, including Australia, Canada, France, Germany, Netherlands, Singapore, the United Kingdom, and the United States (excluding Hawaii).\n\nKuCoin – This exchange currently offers cryptocurrency trading of over 300 other popular tokens. It is often the first to offer buying opportunities for new tokens. Restrictions may apply, depending on location.\n\nClover Finance – A Valuable Gateway Between Two Top Networks\n\nThe expansion of the DeFi sector has led to a strong push for more interoperability in the market. As such, Clover Finance fills a much-needed niche in the market. Combining these two DeFi ecosystems improves liquidity across the entire sector and provides Dapp developers with a world of new opportunities. As such, Clover Finance appears to have a bright future ahead."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPLUZja0VkOURxME1CWHZMNktFNFBpNVpqUzZ3WU9TejNPYU9aeVFyUU16T2tOYjVfbzZWTUd3RXlscnpiVS1uTk0wc1JaS09FeVJwa0NFR1p5N29IY2JvZ0ZldFZLRGVSMjRKU1U3TnZSdU12Y0l2d2d0MDhmZUo1eGM4eVFsV09MaUpnVGJ0U0lTbmhFelZCZGs4NmVUMXJKNFHSAa8BQVVfeXFMTk9SelNxWThCcXdRdkFNeEFKcXgtclpRNlBpeEdzZmw4LW9nTHVtdzlEalRqZE1hb3dDb29vMW9KNHhqVVd1NTFvN2JxaEUwV1ZFUmFEV0MzaElkdTFUYVIyRWJvNzFOcUFqMzFZQUNJQm9RdV92RkVMenk3cUM4OTN5STNLM2Rhb1UzWXBwZjRsaXVRRV9Yc29qVTZkUFlLWm5lMlk3OVAzZXJyLVRvWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Crypto gains popularity among female investors - The New Indian Express",
        "content": "Forex Suggest study says nearly one in every 10 women in India has ventured into the crypto world.\n\nIn order to understand how the exchange’s initiatives are impacting the female investors on its platform, it looked at some insights based on their engagement with virtual digital assets (VDAs) in the past 12 months, and found that women bought 19% of all gift cards sold on the platform and women were recipients of 9% tokens airdropped.\n\nMaharashtra had the highest number of female investors as well as the new female user sign ups, Haryana contributed to the highest transaction volume by female investors. Also, most popular tokens among female investors include Bitcoin, Ethereum and Shiba Inu, among others.\n\nMeanwhile, crypto trading platform CoinSwitch has announced it surpassed two crore registered users. This comes amid a strong resurgence in user activity in India, as investors turn bullish in the wake of Bitcoin ETFs in the US, the possible approval of Ethereum ETF, and the scheduled Bitcoin Halving event next month. Beginning this year, user registrations on CoinSwitch have grown by 5x as compared to the daily average user growth in 2023.\n\nBitcoin rises more than 150% in last six months\n\nBENGALURU: Bitcoin (+6.7%) crossed its previous all-time high of $68,640 from November 2021 in the last 24 hours. Currently trading just below $68K, institutional participation via spot BTC ETFs and the investor’s anticipation ahead of BTC halving seem to be the key drivers for BTC’s price performance. ENS"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQdFNmZzgtdllUQlRJeUY4WHV6SW1fUGloMDRnc0tIamFjcnZUazFZUTZvN2RwWEUteHc0UEE2b01NUzhtN3Nyczd2WWZIdUMwdlgyUC1vdzZzZF9tcEF6R09uMjlpMlNFcTJ0ZkdJREJucDhLeEVnenNub1N3YWpyYmh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Bloomberg Analyst Who Forecasted BTC ETF Not Optimistic About Ethereum ETF - Coinfomania",
        "content": "Grayscale’s recent survey highlighted the approval of a spot Ethereum ETF could increase US investor interest in Ethereum by 25%.\n\nThis increase in interest is driven by economic concerns like inflation and worries about financial stability, particularly among younger individuals and minority communities. 40% of voters from the previous year desired to invest in cryptocurrency. Due to economic instability, that percentage has increased to 47% this year, indicating that more individuals are interested in digital assets.\n\nSource: Grayscale\n\nAccording to Grayscale’s survey, many Americans are drawn to cryptocurrencies because they see them as a way to achieve financial stability and manage their expenses.\n\nEconomic worries have historically influenced crypto interest. Bitcoin’s limited supply allows it to function like gold, acting as a store of value. Grayscale found that familiarity with cryptocurrencies increases the likelihood of seeing Bitcoin as a hedge against inflation and other macroeconomic events.\n\nDemographic Ownership Patterns\n\nNearly 70% of people surveyed said they own some form of investment and around 19% own cryptocurrencies. Men, Black and Hispanic voters, and younger people have higher ownership rates. Gen Z respondents, in particular, reported a 31% ownership rate, with many saying they are more interested in cryptocurrencies because of inflation.\n\nDespite the FTX crash, enthusiasm for crypto remains strong in the US. Approximately 40% of investors believe their future portfolios will include Bitcoin.\n\nGrayscale’s data shows that cryptocurrency interest transcends political boundaries. Ownership rates are similar among Republicans (18%) and Democrats (19%). Voters are split on which party is more favorable to the crypto industry, with 30% believing both parties have a favorable stance on crypto policies.\n\nThis balanced interest aligns with recent bipartisan support in Congress for the resolution of SAB 121, enabling banks to serve as custodians for crypto, making it more accessible.\n\nPolitical Views on Crypto\n\nHowever, differences exist in how each party views the importance of crypto-related issues. Republican voters are more likely to prioritize inflation and the economy, with 54% compared to 33% of Democrats. Conversely, Democrats focus more on issues like gun violence, climate change, and income inequality.\n\nMeanwhile, Bitcoin and Ether prices continue to be affected by government sell-offs and Mt. Gox’s repayment. Bitcoin has stabilized around $57,000, while Ether stands at $3,027 as of press time."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFBOQWFsRTV5WnA1Rk9nekRXZUVKY1h4eXNxZ0hKU2VUcVg1UUlKejVlRXJTdEYtN2Jfb2JfQXh4RDJFUE1QXzVkeU1DbjN4azRObS1jY1ZWbXZocGtnQnlmQkpETnZzZUgzaEHSAW5BVV95cUxOMHN1Ujg0eUxuWWdMOFRCXzNZendwZzVaS0F5bi1qNWFDMmt5V3dKdzc2M18xWkJfS28xMjh5eENRSHJqaFJuWmRpTjlTRXl6MXZYdnVNeFJnYjZLVUZlemFCbmRnZjlfZTZWaHl0QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "12 Best Crypto to Buy Today for Long-Term: Optimize Portfolio Growth - CoinCodex",
        "content": "Even though the cryptocurrency markets are highly volatile, many crypto investors prefer to HODL their coins for extended periods of time and ignore short-term price movements. For many, this has turned out to be a profitable strategy. However, the difficult part is to choose which is the best crypto to hold long term.\n\nIn this article, we’ll be highlighting more than 10 cryptocurrencies that have strong long-term potential.\n\nThe best long term cryptocurrency projects: Find which crypto to buy today for long-term\n\nWe chose 12 crypto assets that have either already demonstrated a lot of longevity, or are positioned well to take advantage of future cryptocurrency bull markets. Our list covers payments-focused cryptocurrencies, smart contracts platforms, DeFi protocols and much more.\n\nWithout further ado, here is our list of the best long term crypto projects:\n\nBitcoin – The first and most valuable cryptocurrency\n\n– The first and most valuable cryptocurrency Ethereum – The leading decentralized smart contract platform\n\n– The leading decentralized smart contract platform BNB – BNB Chain's native asset and key part of the Binance ecosystem\n\n– BNB Chain's native asset and key part of the Binance ecosystem Monero – The most popular privacy coin\n\n– The most popular privacy coin Polygon – An Ethereum-compatible platform with improved scalability\n\n– An Ethereum-compatible platform with improved scalability Filecoin – A decentralized storage platform that incentivizes participants with crypto\n\n– A decentralized storage platform that incentivizes participants with crypto Cardano – A decentralized smart contracts platform\n\n– A decentralized smart contracts platform Chainlink – A decentralized oracle network\n\n– A decentralized oracle network Tezos – A decentralized smart contracts platform with on-chain governance\n\n– A decentralized smart contracts platform with on-chain governance Polkadot – An ecosystem of connected blockchains\n\n– An ecosystem of connected blockchains Maker – The DeFi protocol behind the Dai stablecoin\n\n– The DeFi protocol behind the Dai stablecoin Solana – A high-performance decentralized smart contracts platform\n\n– A high-performance decentralized smart contracts platform Celestia – Modular blockchain platform for data availability\n\n– Modular blockchain platform for data availability Uniswap – The dominant decentralized exchange\n\n1. Bitcoin – The first and most valuable cryptocurrency\n\nBitcoin (BTC) is the first cryptocurrency ever invented, and it has remained the world’s most valuable cryptocurrency ever since its launch in early 2009. Bitcoin was created by someone using the pseudonym Satoshi Nakamoto, whose real identity remains a mystery to this day.\n\nThe big innovation of Bitcoin is that it is a peer-to-peer digital currency which is extremely secure and censorship-resistant. This is possible thanks to its decentralized design, which allows anyone in the world to help secure the network by running a Bitcoin node. Users can also choose to mine Bitcoin to earn a reward in the form of newly issued BTC coins. The mining process ensures that it’s extremely difficult for anyone to edit the ledger of transactions or double-spend their coins.\n\nBitcoin was initially an obscure project that mostly appealed to cryptography enthusiasts and “cypherpunks”. However, it didn’t take long for a broader audience to catch on to the unique properties of Bitcoin, and a vibrant global market for BTC emerged by 2012 and 2013. BTC continued to grow in the following years, and hit a market capitalization of $1 trillion for the first time ever in 2021.\n\nWhy is Bitcoin a good crypto to buy for the long term?\n\nIf you think that cryptocurrency has long-term potential, it’s very difficult to argue that Bitcoin won’t continue to be one of the leaders in the space. Bitcoin is still easily the largest cryptocurrency by market capitalization, and while it’s feasible that it will be overtaken at some point, it will most likely continue to play an important role.\n\nBitcoin is an attractive asset to hold long-term thanks to its predictable monetary policy. There is a hard cap on the Bitcoin supply—only 21 million BTC will ever be created. In addition, the amount of new BTC flowing onto the market can be estimated very accurately thanks to mining difficulty adjustments and Bitcoin halvings. As a result, many investors view Bitcoin as sound money, which is likely to provide steady demand and help BTC recover from its bear market lows. In fact, many investors believe that Bitcoin will retest and possibly surpass its previous ATH after the 2024 halving.\n\nBuy Bitcoin Now\n\nOf course, the Bitcoin protocol has also demonstrated a lot of resilience and has been securing large amounts of wealth for well over a decade. BTC has delivered substantial profits to long-term holders. With each passing year, confidence in Bitcoin will increase if the protocol continues to perform as expected. This makes BTC one of the best long term crypto investments for 2024 and beyond.\n\n2. Ethereum – The leading decentralized smart contract platform\n\nEthereum (ETH) is a cryptocurrency that was released in 2015 and revolutionized the crypto space by introducing smart contract functionality, allowing developers to create decentralized applications on top of the network.\n\nEthereum goes beyond the simple transaction functionality offered by Bitcoin. It serves as a platform for cryptocurrency trading platforms, financial services, non-fungible token marketplaces, decentralized autonomous organizations and other types of DApps that run in a completely trustless manner. All operations are automated through the use of smart contracts.\n\nOne of the reasons why Ethereum initially got popular is that it allows users to create custom tokens that are transacted on the Ethereum blockchain similarly to ETH. Projects quickly realized that this could be used to raise capital, and we saw a wave of Initial Coin Offerings (ICOs) that reached a fever pitch in 2017. While ICOs mostly went out of style in the following years, there are still many projects on Ethereum that are issuing their own tokens and building fascinating applications.\n\nSince September 2022, Ethereum is using a Proof-of-Stake consensus mechanism, which makes it a lot more environmentally friendly than Bitcoin.\n\nWhy is Ethereum a good crypto to buy for the long term?\n\nEven though there are countless “Ethereum killers” looking to take Ethereum’s crown, Ethereum remains the undisputed king of the smart contracts space. With several improvements in the pipeline, it’s likely that Ethereum will remain the leader in this sector. While Ethereum is currently expensive to use because of its high transaction fees, future upgrades such as sharding will make it much cheaper (and faster) to use.\n\nA common criticism of ETH as an investment has been that it doesn’t have a hard cap on its supply. The shift to Proof-of-Stake (better known as the Merge), combined with EIP-1559, has contributed to making ETH a much more attractive asset to hold for the long term.\n\nThis is because the Ethereum protocol needs to issue fewer ETH tokens to reward staking validators compared to the amount it had to issue to reward miners. On top of that, EIP-1559 is burning the base transaction fees for all transactions, so the growth of the ETH supply has slowed down a lot and could even become deflationary. With this in mind, it’s not hard to see why ETH could be the best crypto for long term investors.\n\nBuy Ethereum Now\n\n3. BNB – BNB Chain's native asset and key part of the Binance ecosystem\n\nBNB (BNB) is a cryptocurrency that was initially issued in 2017 by the Binance cryptocurrency exchange on the Ethereum network. In 2019, BNB was migrated over to its own blockchain called Binance Chain, where it serves as the native asset—similar to the role ETH plays on Ethereum. BNB is used widely in the Binance ecosystem, providing discounted transaction fees for traders on Binance and allowing them to access special features like Binance Launchpad token sales.\n\nIn 2020, Binance launched Binance Smart Chain, an EVM-compatible blockchain platform that extended the functionality of Binance Chain by adding smart contracts with basically the same functionality as Ethereum. A simple way of describing the platform is that it’s a more centralized version of Ethereum that offers better performance (faster and cheaper transactions).\n\nThanks to its low transaction costs, Binance Smart Chain gained huge traction in the 2021 cryptocurrency bull market. In February 2022, Binance rebranded BNB and its associated blockchain platforms to better reflect the fact that an independent ecosystem has grown around BNB:\n\nBinance Coin (BNB) => BNB (BNB)\n\nBinance Chain => BNB Beacon Chain\n\nBinance Smart Chain => BNB Smart Chain\n\nWhy is BNB a good crypto to buy for the long term?\n\nSimply put, BNB is the biggest crypto asset at the moment that isn’t Bitcoin, Ethereum, or Tether. The BNB Chain ecosystem is seeing impressive amounts of usage, and there’s also a lot of demand for BNB coming from users of the Binance cryptocurrency exchange.\n\nIn the 2022 cryptocurrency bear market, Binance has solidified its position at the top of the crypto exchange industry. Its position became even stronger after FTX, one of Binance’s biggest rivals, collapsed in dramatic fashion.\n\nEven though Binance has made an effort to create some distance between the business and the BNB cryptocurrency, there’s still a lot of correlation between the two. Holders of the BNB cryptocurrency should be aware that if there are any issues with Binance as a business (like we've seen with the recent SEC lawsuits against the Binance exchange and BUSD creator Paxos), the value of BNB will also likely take a hit as well.\n\nIt is worth noting that investing in BNB might be a bit risky at the moment – however, if the company manages to prevail in its regulatory challenges against the SEC and other local regulators, Binance, and by extension, BNB, might be in a very good spot for the future.\n\nBuy BNB Now\n\n4. Monero – The most popular privacy coin\n\nMonero (XMR) is a privacy-focused cryptocurrency that launched in 2014. It was originally a fork of the Bytecoin cryptocurrency, but was enhanced over the years with new features that make it a unique contender in the crypto market.\n\nMonero utilizes technologies such as RingCT, Stealth Addresses, and Ring Signatures to make it virtually impossible to trace the amounts and addresses involved in any given transaction, while still making it possible to demonstrate that nobody is cheating the protocol by spending coins they don’t have.\n\nMonero is secured through a Proof-of-Work consensus algorithm that’s optimized for widespread participation. For example, while Bitcoin can only be profitably mined with specialized ASIC hardware, Monero can be mined with consumer-grade CPUs and GPUs. This ensures that the network of Monero miners is large and diverse in terms of geographic distribution, making the network difficult to compromise.\n\nMonero’s strong privacy features have resulted in some controversy, as XMR has gained considerable traction for illicit uses such as darknet markets. However, there are certainly also a lot of legitimate reasons why users would want to protect their privacy, and Monero can be a powerful tool for enhancing freedom.\n\nWhy is Monero a good crypto to buy for the long term?\n\nMonero is dominating the privacy coin sector, and has a very active community of dedicated users. The project has been going strong since 2014, and Monero is regularly updated with new features that improve its privacy and security.\n\nXMR’s track record suggests that it’s going to be around for a long time—it has a straightforward use-case of facilitating private and secure transactions, at which it excels. It’s likely that Monero will stay relevant in the future regardless of cryptocurrency industry trends.\n\nOne of the biggest risks to watch out for when it comes to Monero is regulatory risk. In some jurisdictions such as Japan, regulators have been pressuring cryptocurrency exchanges to delist privacy-focused cryptocurrencies such as Monero and Zcash.\n\nBuy Monero Now\n\n5. Polygon – An Ethereum-compatible platform with improved scalability\n\nPolygon (MATIC) is a Proof-of-Stake blockchain platform that’s compatible with Ethereum. It has emerged as one of the most popular Ethereum alternatives after Ethereum started suffering from high transaction fees. Polygon’s native asset is called MATIC, and it is used for key operations on the network like staking and paying transaction fees. Polygon is one of the first Ethereum scaling platforms to gain significant adoption, which helped the team launch a number of initiatives to accelerate growth further.\n\nDevelopers on Polygon can build any type of decentralized application that would also be possible to build on Ethereum, and they can also benefit from the suite of development tools that are available to Ethereum developers. This has made Polygon a very popular option for projects that want to build within the Ethereum framework, but require improved scalability. Polygon has reached around 2.7 million monthly active users, showing impressive product-market fit.\n\nWhy is Polygon a good crypto to buy for the long term?\n\nThe Polygon team has been very successful in securing partnerships with mainstream brands, including the likes of Reddit, Starbucks, DraftKings, and Robinhood. With these partnerships, Polygon could be a big winner if blockchain-based applications become popular in the mainstream. Reddit’s Collectible Avatars product, which uses NFTs on the Polygon blockchain, has already achieved impressive success.\n\nPolygon’s high activity in the bear market is encouraging, as it suggests the project has a long-term vision that doesn’t depend on current market conditions.\n\nThere is a risk Polygon could become redundant in the future if Ethereum can achieve major scalability gains through upgrades like sharding. To be fair, the Polygon team has plenty of other aces up its sleeve in addition to the Polygon PoS blockchain platform.\n\nBuy Polygon Now\n\n6. Filecoin – A decentralized storage platform that incentivizes participants with crypto\n\nFilecoin (FIL) is a decentralized storage project that conducted an ICO in 2017 and launched their mainnet in October 2020. Filecoin had one of the biggest ICOs of all time, as the team raised around $200 million in funding.\n\nFilecoin is a decentralized network that allows users to securely store data at competitive prices. It utilizes cryptographic proofs to ensure the availability and immutability of data stored on the network. The FIL cryptocurrency is implemented as an incentive mechanism for Filecoin miners, who are rewarded with FIL. Meanwhile, FIL is also used to pay for the storage and retrieval of data. As of July 2023, the Filecoin network stored 954 PiB (pebibytes) of data.\n\nFilecoin is built on top of the IPFS (InterPlanetary File Storage) decentralized file storage protocol, and provides an incentive mechanism for users to store data for others.\n\nWhy is Filecoin a good crypto to buy for the long term?\n\nThe Filecoin network provides a unique storage option that eliminates reliance on centralized cloud storage providers. It also provides an extremely competitive marketplace for storage, which ultimately results in better prices for consumers.\n\nAs people become more comfortable with using crypto assets and decentralized protocols, solutions like Filecoin could see increased adoption as well and become a crucial part of web3 infrastructure. For example, the Filecoin network can be used to store media associated with NFTs, ensuring that it remains available and unchanged for a long period of time.\n\nIf demand for decentralized storage grows in the future, Filecoin could certainly be one of the next cryptocurrencies to explode.\n\nBuy Filecoin Now\n\n7. Cardano – A decentralized smart contracts platform\n\nCardano (ADA) is a blockchain project that launched in 2017 following an initial coin offering. It operates through a Proof-of-Stake consensus mechanism, and is integrating smart contracts functionality to support decentralized applications like DEXes. The Cardano blockchain also supports custom tokens, which use the same architecture as the network’s native asset ADA.\n\nThe Cardano project consists of three main organizations: IOHK, which leads the project’s technical development, the Cardano Foundation, which promotes the adoption of Cardano, and Emurgo, which is focused on working with businesses.\n\nCardano uses the EUTXO (Extended Unspent Transaction Output) model, in contrast to the account model used by Ethereum. According to Cardano developers, this allows Cardano to offer improved scalability and privacy, as well as simpler transaction logic that makes it easier to verify transactions.\n\nWhy is Cardano a good crypto to buy for the long term?\n\nCardano is one of the strongest contenders in the smart contracts space. The Cardano blockchain is steadily receiving upgrades, improving its scalability and smart contracts capabilities, which is contributing to the formation of a decentralized application system on Cardano.\n\nEven though ADA is one of the most valuable crypto assets on the market today, the adoption of the Cardano blockchain has progressed slowly. However, as the platform’s smart contract functionality evolves further, we will likely see a growing number of interesting decentralized applications launching on the platform.\n\nThe project is known for its methodical approach to development, which helps Cardano avoid the pitfalls encountered by more rushed projects. However, it also means that the Cardano ecosystem has been slow to capitalize on important trends such as DeFi and NFTs.\n\nBuy Cardano Now\n\n8. Chainlink – Decentralized oracle network\n\nChainlink (LINK) is a decentralized oracle network that allows blockchains to access reliable data outside of the blockchain. The project aims to address the “oracle problem” faced by blockchains—by reliably connecting blockchains to the “outside world”, Chainlink unlocks a wide range of use cases that wouldn’t be possible with on-chain data alone.\n\nChainlink is already the most widely used oracle service in the decentralized finance sector, and is also gaining traction in the NFT and crypto gaming sectors. For example, a decentralized finance protocol could leverage the Chainlink network to feed data about crypto prices on centralized exchanges (which function off-chain) to its smart contracts. NFT projects can utilize Chainlink for provable randomness, which establishes trust in the fairness of NFT minting and distribution.\n\nWhy is Chainlink a good crypto to buy for the long term?\n\nChainlink already plays a very important role in the crypto ecosystem, as it’s used by a host of decentralized applications on many different blockchains. This includes major projects such as Aave, Synthetic, Compound, Ethereum Name Service, and Trader Joe.\n\nThe Chainlink network is currently transitioning towards its Economics 2.0 phase, which includes LINK staking, as well as the BUILD and SCALE programs that are designed to grow the Chainlink ecosystem and make the network more accessible for developers. With this in mind, it’s easy to see that Chainlink has some serious potential over the long term.\n\nThe Chainlink network can also be utilized for proof of reserves, which is becoming extremely relevant in the cryptocurrency industry after the FTX exchange was revealed to be secretly insolvent, losing billions of dollars worth of customer funds.\n\nBuy Chainlink Now\n\n9. Tezos – A decentralized smart contracts platform with on-chain governance\n\nTezos (XTZ) is a Proof-of-Stake blockchain platform with smart contracts functionality. One of the defining features of Tezos is its on-chain governance process, which allows the community of validators to propose and approve upgrades to the Tezos blockchain. A very interesting aspect of Tezos is that the network does not need to undergo a hard fork in order to implement upgrades.\n\nThe Tezos blockchain supports a smart contracts language called Michelson. Developers can also access tools that enable Tezos smart contract development in the far more popular programming languages Python and Go.\n\nThe Tezos mainnet was launched in September 2018. The project conducted one of the most successful ICOs of all time, raising approximately $232 million. The project received some negative press in its early days due to a dispute between former Tezos Foundation president Johann Gevers on one side and Tezos founders Kathleen Breitman and Arthur Breitman on the other side. However, the dispute has since been settled in court and Tezos has established itself as a well-respected project in the crypto community.\n\nWhy is Tezos a good crypto to buy for the long term?\n\nTezos has found traction within the art community and established itself as a popular platform for NFTs. The blockchain of course also supports other cases, such as decentralized finance, but adoption has been slower on that side.\n\nWe can also expect Tezos to be able to adopt new technologies rapidly thanks to its on-chain governance mechanism. As of September 2023, the Tezos blockchain has already received 14 major network upgrades, helping it stay up to date with cutting-edge developments.\n\nTezos will be interesting to follow in the long term as it’s a unique competitor in the smart contracts sector. While many projects are essentially copying Ethereum, Tezos offers an arguably better governance model and a smart contract integration with unique strengths. However, it remains to be seen if Tezos will be able achieve strong adoption outside of the NFT sector.\n\nBuy Tezos Now\n\n10. Polkadot – An ecosystem of connected blockchains\n\nPolkadot (DOT) is a blockchain platform that’s specialized to offer interoperability between different blockchains. The Polkadot network consists of the Relay Chain and many different parachains that are interconnected through the Relay Chain and benefit from its security. Parachains are blockchains built using the Substrate framework, and they can be fine-tuned for specific use cases.\n\nThere is a limited number of parachain slots available, so projects that want to launch a parachain and connect it to the Relay Chain need to win a parachain slot auction. Some examples of parachains on Polkadot include Moonbeam, Acala, Astar, and Centrifuge.\n\nProjects can take advantage of crowdloans, in which DOT holders can temporarily loan their DOT to their project of choice to help them win the auction. The loaned DOT is automatically released once the project’s parachain lease expires. Typically, projects will reward crowdloan participants with the native tokens of their own parachains.\n\nThe Polkadot project was founded by Gavin Wood, a computer scientist who was also one of the founders of Ethereum. The Polkadot mainnet launched in May 2020, and the parachain functionality was launched in December 2021.\n\nWhy is Polkadot a good crypto to buy for the long term?\n\nPolkadot is another unique competitor in the smart contracts sector, and DOT has been able to maintain its spot as one of the 20 largest crypto assets by market capitalization. The platform’s parachain functionality provides a lot of room for growth, as it can accommodate a wide range of projects thanks to the customizability of parachains.\n\nEssentially, this means that Polkadot could be positioned well to capitalize on any trends that emerge in the crypto and blockchain space.\n\nThe DOT token has dropped by around 90% since its all-time high, and is trading around its all-time lows as of September 2023, which could mean that there’s a solid opportunity to accumulate a DOT position if you believe in the long-term potential of Polkadot.\n\nBuy Polkadot Now\n\n11. Maker – The DeFi protocol behind the Dai stablecoin\n\nMaker (MKR) is a decentralized finance protocol on the Ethereum blockchain that issues and manages Dai, a decentralized stablecoin pegged to the US dollar. Users that hold assets that are supported as collateral (for example, ETH) can lock their coins into Maker’s smart contracts in order to issue Dai.\n\nThe system is overcollateralized—in order to mint Dai, users need to provide collateral that exceeds the value of minted Dai, and users are required to monitor the value of their collateral in order to avoid liquidation.\n\nThe MKR token is used as the governance token for the MakerDAO, a decentralized autonomous organization that oversees the Maker protocol.\n\nMakerDAO was founded in 2014 by Rune Christensen, and the Dai stablecoin was launched in late 2017. Initially, the Maker protocol only supported ETH as collateral. With the launch of Multi-Collateral Dai in 2019, it also became possible to use other forms of collateral. Today, Dai is backed by a diverse range of assets, including ETH, (wrapped) BTC, USDC, USDP, and many others.\n\nBuy Maker Now\n\nWhy is Maker a good crypto to buy for the long term?\n\nMaker is one of the earliest participants in the decentralized finance space, and the MakerDAO community has demonstrated an impressive ability to maintain the stability of Dai and the Maker protocol in the face of the highly volatile and unpredictable cryptocurrency market.\n\nLike most other crypto assets, the value of the MKR token dropped substantially during the 2022 crypto bear market. However, if you believe in the long-term potential of decentralized finance, MKR is definitely worth considering as the Dai stablecoin is one of the pillars of Ethereum’s DeFi ecosystem.\n\n12. Solana – A high-performance decentralized smart contracts platform\n\nSolana is a high-performance blockchain platform with smart contract capabilities. After launching its mainnet in 2020, Solana has emerged as one of the most credible competitors to Ethereum in the smart contracts sector. Solana uses a Proof-of-Stake consensus mechanism combined with innovations like Proof-of-History, which allow the blockchain to handle thousands of transactions per second while keeping costs low for users.\n\nSolana is one of the most popular blockchains today and one of the most credible competitors to Ethereum. The high-performance platform is seeing adoption in practically all sectors, ranging from DeFi to NFTs and blockchain-powered gaming.\n\nWhy is Solana a good crypto to buy for the long term?\n\nSolana is one of the strongest layer 1 blockchain projects in terms of technology. The project is also making a strong push into the mobile sector with the Solana Mobile Stack (SMS) and the upcoming launch of Saga, a flagship mobile phone with blockchain-friendly features. If blockchain technology is to reach widespread adoption, mobile devices are likely to play a very important role. It will also require strong scalability, which is definitely an area where Solana delivers.\n\nHowever, users need to be aware of the concerns regarding Solana’s reliability, as the network has suffered multiple outages which made it temporarily unavailable. The Solana ecosystem’s reputation was also negatively impacted by the collapse of the FTX cryptocurrency exchange, which was a very prominent backer of Solana. Still, the network remains a hotbed of DeFi and NFT innovation and has a strong community of users and developers who are actively using and developing the platform.\n\nBuy Solana Now\n\n13. Celestia – Modular blockchain platform for data availability\n\nCelestia is a layer 1 blockchain that’s optimized for data availability. Celestia is based on the Cosmos Software Development Kit, and uses the Tendermint algorithm to achieve consensus.\n\nCelestia can be used as an efficient and scalable data availability layer by rollups and layer 2 blockchains. Rollups transmit their transaction information to Celestia, where it gets ordered and available to download. In this process, rollups also inherit some of Celestia’s security advantages.\n\nThanks to the project’s data availability sampling technology, users don’t need to download a blockchain’s entire transaction history and data in order to verify it. A light node can verify data availability on Celestia just by downloading a small portion of each block, and Celestia is designed so that it scales as additional light nodes join the network.\n\nThe Celestia project emphasizes modularism over maximalism, meaning that they are looking to bring forth a modular blockchain ecosystem based on collaboration and interoperability between blockchains, rather than having blockchains exist as walled gardens that are competing to attract and retain users at the expense of other networks.\n\nWhy is Celestia a good crypto to buy for the long term?\n\nCelestia is already being used by several projects, and the platform looks poised to continue attracting builders in the future. Arbitrum Orbit, Manta Network, Osmosis and Dymension are just a few examples of projects that are part of the Celestia ecosystem. An added bonus of investing in Celestia is that holders of TIA are likely to benefit from several airdrops as new projects start building on Celestia.\n\nBuy Celestia Now\n\n14. Uniswap – The dominant decentralized exchange\n\nUniswap, a decentralized crypto exchange, was the pioneer in implementing the AMM (automated market maker) system. This innovative approach eliminates the traditional order books, enabling token swaps directly on the blockchain without the need for middlemen.\n\nThe Uniswap platform is fully decentralized, allowing anyone to establish liquidity pools for any token. As a result, new tokens often make their debut on Uniswap before they are listed on centralized exchanges.\n\nUniswap's AMM model has inspired numerous decentralized exchanges across various blockchain ecosystems. Still, Uniswap leads the DeFi space as the most active decentralized exchange both in terms of trading volume and TVL.\n\nThe governance of Uniswap is controlled by UNI token holders, who have the power to propose and vote on governance decisions. UNI was initially distributed to early users of the Uniswap platform through an airdrop in 2020 and is currently tradable on both decentralized and centralized exchanges.\n\nWhy is Uniswap a good crypto to buy for the long term?\n\nUniswap is the most dominant decentralized exchange in the DeFi space, and it doesn't seem like that will change any time soon. At the time of writing, Uniswap has a TVL (total value locked) of $6.05 billion, while the second largest competitor Curve has $2.60 billion. This is especially impressive, given that new decentralized exchanges are being launched on various blockchains practically every day.\n\nIn addition, the utility of the UNI token will likely be expanded in the future. The Uniswap Foundation has submitted a proposal to use the protocol’s fee mechanism to reward UNI token holders who stake and delegate their tokens. According to the proposal, the change is designed to incentivize \"active, engaged and thoughtful delegation\" in the Uniswap governance process.\n\nIf the community vote approves the proposal, it would allow for the automatic and unrestricted collection of protocol fees, which would then be distributed evenly among UNI token holders who have staked their tokens and delegated their voting rights.\n\nBuy Uniswap Now\n\nThe bottom line: These are the best long-term crypto investments for 2024 and beyond\n\nNative asset Launched in Description Market cap* Bitcoin BTC 2009 Decentralized peer-to-peer digital currency $1.32 trillion Ethereum ETH 2015 Decentralized platform for smart contracts $466 billion BNB BNB 2017 Native asset of BNB Chain ecosystem, used prominently on the Binance crypto exchange $70.4 billion Monero XMR 2014 Privacy-focused cryptocurrency $2.69 billion Polygon MATIC 2020 Ethereum-compatible smart contracts platform with improved scalability $8.9 billion Filecoin FIL 2020 Decentralized storage platform $5.2 billion Cardano ADA 2017 Decentralized platform for smart contracts $24 billion Tezos XTZ 2018 Decentralized smart contracts platform with on-chain governance $1.3 billion Chainlink LINK 2019 Decentralized oracle network $11.4 billion Polkadot DOT 2020 Interoperability-focused decentralized platform for smart contracts $10 billion Maker MKR 2017 Decentralized finance protocol that issues and manages the Dai stablecoins $1.85 billion Solana SOL 2020 High-performance decentralized platform for smart contracts $64 billion Celestia TIA 2023 Modular blockchain platform for data availability $2.7 billion Uniswap UNI 2020 The dominant decentralized exchange $8.6 billion\n\n*Data collected on March 8, 2024\n\nHopefully, this article helped you identify cryptocurrency projects with long-term potential and gave you some ideas about which crypto assets are worthy of having a spot in your portfolio over the long term. The projects we featured are likely to display a lot of resilience and continue building regardless of what’s happening in the unpredictable cryptocurrency markets. For these reasons, they are great choices for those looking to invest in cryptocurrencies for the long haul.\n\nOn the other side of the coin, we have high-risk cryptocurrencies like meme coins, which can sometimes go on explosive rallies but don’t have much fundamental value behind them. If you're looking for the best crypto to buy right now, it's important to analyze the current trends in addition to long-term potential.\n\nIt’s important to keep in mind that cryptocurrencies are a highly speculative asset class, and there’s no guarantee that you will see gains even if you hold your crypto for a long period of time. Always carefully consider your financial situation before purchasing any cryptocurrency, and don’t invest more than you are willing to lose.\n\nIf you are looking to invest in other asset classes for the long term, check out our list of the best long-term dividend stocks.\n\nDisclaimer: The content of this article should not be considered as investment advice. Always do your own research before deciding to buy, sell or transfer any crypto assets."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9aYWdxMEladGZSa0ZyN0d6RFo3MjA1X1RBVWoxd3JLZVpvR0JpV3cza3R5M29pdUxGanc4QS15Q0R6dzVtRlJPRHNOYXI4UmtPVWUyVEVlS3FJUW5UU0tmalNaNWdlS0RmemhGOTN2MG9Ec29Vd213?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Why are Ethereum Whales Turning to BlockDAG Presale Despite Litecoin (LTC) Surge? - Coinfomania",
        "content": "Today, we will delve into two exciting projects: Pullix and BlockDAG. Although at different stages of development, they have caught the attention of investors worldwide, in a very different light.\n\nPullix made a splash in the market with a successful presale, raising millions and gathering a good community along the way. However, as time went on, a shift in investor focus became evident after the Pullix exchange listings.\n\nBefore its official launch, Pullix put in significant effort to ensure long-term success. They gathered resources and laid the groundwork for their project. Additionally, before the Pullix exchange listings, they achieved important milestones such as listing on both decentralized and centralized exchanges (DEX and CEX) and even launching a beta version for testing purposes.\n\nHowever, despite these accomplishments, after Pullix’s exchange listings, it experienced a downfall in investor interest. The reasons behind this shift remain various, but it is crucial to examine the factors contributing to this change. Investors are eagerly running after BlockDAG’s potential after the Pullix exchange listings but is this hype justified?\n\nBlockDAG’s Presale Buzz\n\nOn the other hand, BlockDAG has been generating significant buzz with its $5 million presale and the $2 million giveaway!\n\nWhat’s more? This platform isn’t just about coins but mining and even a personalised payment card. Assume registration is hard? Skip the KYC with BlockDAG.\n\nBlockDAG is in a different stage of development compared to Pullix. As an emerging project, it is still building its foundation and gaining traction within the market. The promise of revolutionary technology has attracted investors looking to 2024’s wealth explosion.\n\nNavigating the Shuffle\n\nWith the continuous movement of investors between Pullix and BlockDAG, it is crucial to navigate this shuffle wisely. As an investor, it is essential to stay informed and make informed decisions based on thorough legitimacy and not just the hype.\n\nBy keeping a close eye on the project and understanding its unique journey, investors have been making the reasonable leap of moving to BlockDAG. The platform represents an entirely different opportunity with its multi-income source and multiple rewards, all within a stable ecosystem.\n\nUnderstanding the dynamics of Pullix’s downfall is key to entering BlockDAG’s $600M hype as it is essential for investors seeking the next big opportunity. While Pullix is available on Bitmart and Uniswap, BlockDAG is currently in the process of its 3rd batch of presale. This provides an opportunity for investors to get involved early in the project and potentially earn significant benefits when it is officially launched.\n\nBlockDAG has a vision of reaching $600 million within 2024 and has established a four-phase plan for its development and launch.\n\nThe first phase is the launch phase, where the groundwork for success is laid. Following this is the pre-launch phase, which focuses on maintaining the momentum of the presale. Next is the development phase, which runs parallel to the continuous growth of the presale. The final phase involves concluding the presale with batch 45. BlockDAG will finalize its Mainnet, prepare for broad-scale mining operations, and mark the culmination of its efforts. This paves the way for the official launch of the project.\n\nThe Key Takeaway\n\nThe prospect of all these phases is incredibly exciting, although there is still a long road ahead. However, by being part of batch 3 presale and joining BlockDAG’s journey from the beginning, investors have the potential to reap significant rewards when the project reaches its full potential.\n\nInvest in BlockDAG Presale:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram:https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\nDisclaimer: This is Sponsored Content. Coinfomania does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. Readers should do their research before taking any actions related to the company stated in the release."
    }
]