[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQSkN1cTQ3WVppdWNUZXpRUERrenU1MzAxUXVzbFdwZ3drNlZyS2JtbUhZeUliMHZrM1V2Ump0ME0zLTJCdjE2aG5PNGRLWXB4a05aMDZEOXZNXzFlVG1abWE0ajZXVVh4clNoZ1lRZTJid3piaXZfRzFxNEo0eGFZUXdzNUxETmlwUHphZl84TzhjeXhuQ1J0VWZ0aDBEWGw4SWFCcy1CckpjaHpGaDFvOEJZbXBmZ9IBuwFBVV95cUxNWW8telo2dnpIVU9FQjUxaTZid19OYTcweUpmQWFLR2Q4bnFORTFBQXN0UUlVeDMtRUVwUmNKN05wZTNCby1Oby1KWlpUY09rLWItMXpHeXdwSjEtZVhjLXdPbzFXMnhNc1J1V201OHB4UjBvbExjVXRQak1BZFFfNjh2Vl82RTE4YXplZWNmTXNkREpua2lQSFBQcDI1MF9vcVpjNjBobmZCOHB3UkNtM0VwZ0ltMXVOMlJV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "No More Than 50% Chance of Spot Ether ETF Approval By May, JPMorgan Says - CoinDesk",
        "content": "No More Than 50% Chance of Spot Ether ETF Approval By May, JPMorgan Says\n\nLawsuits against crypto exchanges offering staking services for proof-of-stake blockchains, including Ethereum, make approval of a spot ether ETF more challenging until these cases are resolved, the investment bank said.\n\nBy Will Canny Jan 19, 2024 at 10:37 a.m. UTC\n\nElection 2024 coverage presented by Stand with crypto"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOaHBadDlPeXhTZmlBQVN5ZEhOOE0ybmFMcHR3aHp3UFR1eFBRN2pQZUpVaF9rRlRIYUJPamNHSTd4Rk1NQlJXU0NiNGZQOEZ0UEtROUlkS1NTSG9WUEJFN3ZDZnVWOVo1ZFlBc3lMZlhZWGdyWGkyemU4MUdVTGx0OQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Spot Bitcoin vs Ethereum ETFs: The Race Is On - Yahoo Finance",
        "content": "ETF Investing Tools\n\nThe bitcoin versus Ethereum ETF race is on for 2024.\n\nA 24% performance differential divides the popular crypto investments, as futures-based Ethereum ETFs are up nearly 15% and the new spot bitcoin ETFs are down 9% in their first three days of trading through Jan. 16.\n\nOver that brief period, $1.2 billion has flowed from the Grayscale Bitcoin Trust (GBTC), while $740 million has flowed into new spot ETFs like the iShares Bitcoin Trust (IBIT), meaning that almost $2billion has gone into the non-GBTC spot bitcoin ETFs this year. The heavy flows and trading volume partially explain the negative performance for spot bitcoin ETFs thus far.\n\nInvestors Eye SEC Approval of a Spot Ethereum ETF\n\nMeanwhile, Ethereum appears to be gaining a similar kind of investor enthusiasm as Bitcoin did in 2023, as multiple issuers, including the ETF behemoth BlackRock, Inc., have filed for a spot Ethereum ETF. The timetable for the Securities and Exchange Commission to approve a spot Ethereum ETF takes us to May 2024, which could lead to the bidding up of Ethereum prices in the coming months.\n\nAlthough the 2024 spot bitcoin versus Ethereum ETF race has only just begun, the story is setting up as the more established cryptocurrency versus the rising outsider.\n\nGBTC Outflows Impact Spot Bitcoin ETF Pricing\n\nDigging a bit deeper into spot bitcoin’s poor start, $1.2 billion flowing out of GBTC pumped significant liquidity into the bitcoin ecosystem. The higher supply offset the early demand; thus, the price did not leap higher as many expected. The SEC announcement also appeared to become a “sell the news” event.\n\nBTC’s price rose more than 21% from late November through Jan. 8, peaking near $47,000 according to crypto data aggregator CoinGecko data, as signs suggested increasingly that the SEC would approve at least a few of the filings (the agency approved all 11 applications). A primary reason for GBTC’s huge outflows is likely its expense ratio of 1.50%, which is more than 100 basis points higher than any of the other 10 spot bitcoin ETFs on the market. Another reason is that GBTC had previously been a closed-end bitcoin trust with $29 billion in assets, and the SEC allowed it to convert to a spot bitcoin ETF last week as the new spot ETFs launched.\n\nGBTC’s conversion enabled investors to sell shares. They had likely been waiting to exit the closed-end fund once they were longer locked in. Many investors bought GBTC at a discount in 2023, which was as low as 50%. and sold at par to capture gains after the conversion.\n\nClosed-end funds can be less liquid than ETFs, which are open-ended funds. The limited number of shares outstanding can result in wider bid-ask spreads and reduced liquidity for CEFs. If there aren't enough buyers, a closed-end fund can trade at a discount.\n\nStory continues\n\nWhat’s Next for the Spot Bitcoin vs Ethereum ETF Race?\n\nInvestors will likely be eyeing the bitcoin halving in April. The halving will cut the reward for bitcoin miners from the current 6.25 to 3.125 bitcoin, reducing the number of tokens entering the system. Observers of the digital asset space widely expect the event to boost BTC’s price and bring more assets into spot bitcoin funds.\n\nBitcoin miners are lynchpins of the blockchain, helping to ensure its integrity. A month later, the SEC will decide on multiple applications for Ethereum ETFs, which could increase the price of ether, the token of the Ethereum network.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQQ0Vya2J2YWJJUHJ5eDF0RlhEWVBnM004a1ZnSmFmd042a25HSDVTUmNvSU91VWVkMjVsZ1FTMk1IQjFNempTNnVYaGFjM3ljRGtnR1N5bi1GdkF1ek96UEJMeTRIZFBGNXl4R3F2VHhXVzFTVkx6WEZGMTRRalIwOEo2ZFVPZDRNNlVLVm51c3FrUm5wamQtTVd2X0ZiOW1BMndibHFjb9IBrAFBVV95cUxQak5BcVp2RDY4YV80N0NCWnlVY3dIWGpFMFFiWDVQZDVKSmFhemNmSkRWRmQwdlJrR2NiQzg5dFhmQkNRM2tsaE1SaUVlb0dMX0UwMzZ4NlYxNGVzN2haay16eXJ2SnJFdldhVFhEWmNtMzBCM0NDOHRCRmRQV0xjd3JzbGtRNVFOWGlHdWhwb2pBaEV2WGlHTHdmT2NRdFB5NURXYzI0RzF4dFBt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Why Experts Foresee Solana (SOL) Outshining Ethereum (ETH) By 500% In the Next Bull Run - ZyCrypto",
        "content": "Advertisement\n\nThe co-founders of leading crypto analytics firm Glassnode, Jan Happel and Yann Allemann, foresee Solana (SOL) outperforming Ethereum (ETH) by a staggering 500% in the next bull run.\n\nThe duo who operate under the X account “Negentropic” recently shared their optimistic outlook on Solana’s potential ascent. Notably, their perspective was inspired by a recent interview featuring macroeconomist Henrik Zeberg and Global Macroinvestor CEO Raoul Pal, where the discussion centered around the potential for a remarkable rally in the SOL/ETH chart.\n\nNotably, the interview host asked Pal and Zeberg about their crypto preferences for a $10,000 investment over a 12-month period, specifically focusing on Ethereum and Solana in terms of risk-adjusted returns.\n\nPal and Zeberg, examining Solana’s recent performance trend, expressed strong confidence in its significant momentum. They anticipated Solana maintaining its upward trajectory, surpassing Ethereum, as indicated by the SOL/ETH chart.\n\nThat said, Glassnode’s co-founders delved into Pal and Zeberg’s analysis to answer the intriguing question of how much Solana could potentially outperform Ethereum. According to insights from Glassnode’s analytics, the current SOL/ETH ratio stands at around 0.14, and the co-founders anticipate a substantial increase in the ratio.\n\nAdvertisement\n\n“We all watched Zebergand and Paul talking about SOL-ETH ratio. They both agreed it looks BULLISH. But – just how much could the ratio rally? This chart suggests, that the SOL/ETH ratio could rise to ~0.76 from current level of ~0.14. In other words, SOL may outperform ETH by 4-5X into the Crypto top.” Negentropic remarked.\n\nContrary to an isolated rally for SOL, the market experts also anticipated a significant bullish rally for Ethereum.\n\nThat said, following a remarkable surge last month that propelled it to reach an impressive $126, SOL has experienced a subsequent retracement attributed to profit-taking by investors and the broader market downturn, particularly influenced by Bitcoin’s performance after the spot BTF approval.\n\nHowever, despite this setback, bullish sentiments surrounding Solana remain notably high. In a Friday tweet, analyst “Crypto Simon” noted that the SOL/USDT price chart is signalling a potential breakout from its descending channel, suggesting a shift towards an upward trend. He further highlighted a high probability of a bullish movement originating from the support level around $98, with SOL poised to target resistance levels near $128.\n\nAt press time of the latest update, Solana was trading at $89.31, reflecting a 6.36 % decline over the past 24 hours. Ethereum, on the other hand, was trading at $2,438 after experiencing a similar 3.8% decrease during the same timeframe. Despite this decline, Solana’s one-year trajectory remains notably robust at 340.43%, surging from around $20. In contrast, Ethereum’s one-year trajectory is comparatively lower at 60.72%, indicating growth from $1,500."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE95R1A3bWhWZ2o3YjRuQktXUVdRZU9rMy1yZDNlQ3B4VDNiSk03RkN0UGpXM3FhZmEzaGdxanFsZ1NRMTRFaW9fWDNzNUFkaF9MVXB4NzR0Rm5RdG9hYTlUWGstUl82SUY3SGw2aHowTU5lZ1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 18:42:17 GMT",
        "title": "Glitch in upgrade of Ethereum Goerli testnet won’t delay Dencun rollout - Blockworks",
        "content": "Blobs are live on Goerli.\n\nEthereum’s Goerli testnet successfully forked to “Dencun,” featuring the “Proto-Danksharding” EIP-4844 innovation.\n\nThat paves the way for two more major testnet forks, keeping on schedule, for now, a further move to Ethereum mainnet by the end of March.\n\nThe consensus coming out of Thursday’s All Core Devs meeting was to prepare a new software version by mid-next week. This could be used for both the Sepolia and Holesky testnets, slated for Jan. 30 and Feb. 7, respectively.\n\nDencun’s concept of “blobs” is a key component of the upgrade, and refers to a large piece of data that is not directly included in an Ethereum block but is instead referenced by the block.\n\nBy including extra data for transactions, Ethereum will better serve rollups that use mainnet for data availability. Rollups are expected to see around a 90% cost savings, which they will pass on to users in the form of cheaper transactions.\n\nRead more: Dencun and Pralectra: Ethereum core devs chart an ambitious 2024\n\nEven though the data in blobs is stored off-chain, the integrity and availability of this data are still maintained. Blobs are designed to be cryptographically secure, ensuring that the data they reference is immutable and verifiable.\n\nClient diversity wins the day…again\n\nA minor consensus issue in the popular Prysm client caused the forked chain to encounter difficulty finalizing blocks.\n\nTerence Tsao, protocol developer at Offchain Labs, which develops the Prysm client, estimated the resulting delay at about four hours while the team patched the problem.\n\nLoading Tweet..\n\n“When Prysm upgraded from Capella to Deneb state, we kept the historical route empty instead of carrying it over, so this issue was fairly easy to find,” Tsao told colleagues on the ACD call.\n\nThe bug didn’t show up in the many Devnets (developer networks) run over the past few months because these are forked from testnets and contain insufficient history to trigger the issue.\n\n“This is one of those very rare edge cases,” Tsao said. “I’m thankful for Goerli, because otherwise we probably wouldn’t have caught it until later.”\n\nPrysm now operates on less than 40% of Ethereum network nodes, so the resulting drop in validating participation rates, if it happened on mainnet, would be bad, but not catastrophic.\n\nIn fact, a similar incident occurred in May, showcasing the benefit of client diversity.\n\nRead more: Ethereum devs issue final report on finality SNAFU\n\nGoerli itself is scheduled to be retired following this month. The Ethereum Foundation and other developers have been encouraging users to transition to the newer Sepolia testnet, which will serve as the primary testnet for dapp developers in preparation for Goerli to be shut down.\n\nAnother testnet, Holesky, launched in September 2023 and is intended more for infrastructure and protocol development.\n\nRead more: Ethereum’s Holešky testnet launch hits a speed bump\n\nThe Prysm bug was the only major client issue observed in the wake of the fork, and one which can be easily avoided in the future according to Danny Ryan, a researcher at the Ethereum Foundation, who nevertheless called it “a failure” that “should be caught way upstream.”\n\nRyan said he intends to spend some time “making sure there’s nothing else funky on the fork boundary test.”\n\nClient teams expressed no reservations about sticking to the previously outlined release and testnet schedule, pending the results of the next fork in less than two weeks’ time.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPcnd6R1J5aWtEd0lESmFjS2d5LUNuYWdoNl9EWk1vQnlZbGRKNHd1SUpENXpqLUtVR0FYel9kaDNwNThISzZndDdFUmVoS2tKRHdLTFhsSXNZZ3pyZTJRbGtpQlVjaHFJZjg1MFo1SVdPNTZBblIyOUxmdmY3dkFYZWpENkVLZ25oWXZHNHVIamJTQzhGaGhTSi1taUdOaVRHb045RXlVVWhpcUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Arbitrum Commands Nearly Half of Total Market Share in Ethereum Rollups: Nansen - Unchained",
        "content": "Arbitrum has “robust fundamentals,” according to a Nansen analyst, but investors are concerned about its upcoming $2 billion token unlock.\n\nArbitrum, the leading scaling solution for Ethereum, has captured roughly half of the entire rollup market share, according to blockchain analytics firm Nansen in a research report published Thursday.\n\nRollups are designed to help users transact faster and more inexpensively on the Ethereum network by moving computation off-chain and batching a collection of transactions before posting them to Ethereum’s base layer.\n\nWith $11.47 billion in locked value in its smart contracts, Arbitrum has captured about 48% of the entire rollup market share.\n\nArbitrum has “robust fundamentals,” Nansen research analyst Sandra Leow said in the research report. Notably, growth in daily transactions and monthly revenue has been impressive. Despite Ethereum surpassing it in daily transactions, Arbitrum averages 600,000 to 900,000 transactions per day, outpacing its rollup rival, Optimism, the second largest rollup with over $5.5 billion in locked value, per L2Beat.\n\nArbitrum’s revenue trajectory has been consistently upward since Sept. 2023, Leow noted. Last month, Arbitrum generated revenue of $11.9 million, its highest monthly earnings to date.\n\nConcerns About Upcoming Token Unlock\n\nThe outlook is not all sunny for Arbitrum, however. Some crypto investors see risks in Arbitrum due to its upcoming token unlocks which will free up a massive amount of ARB.\n\nToken unlocks refer to the release of frozen or locked cryptocurrencies. Ideally, token unlocks are gradual to prevent large-scale sell-offs by early investors. But Arbitrum is about to have a “heavy unlock,” explained Charles Storry, co-founder of crypto index platform Phuture, to Unchained on Telegram.\n\nRight now, Arbitrum has a very small circulating supply of 1.275 billion ARB, only 12.75% of its total token supply. However, in about two months, 1.11 billion ARB — 87% of its circulating supply — will be unlocked.\n\nAfter the March unlock, which is valued at over $2 billion, Arbitrum will begin monthly unlocks for the next three years, according to its governance documents.\n\nPositive Catalysts\n\nSeveral catalysts may increase positive sentiment among the Arbitrum community, however, according to Nansen’s Leow. The first is a recently passed proposal about the implementation of a staking mechanism, which would let token holders lock their ARB in exchange for rewards.\n\nThe second is Arbitrum’s short-term incentive program (STIP), which allows protocols such as GMX and Camelot to apply and receive grants as a means to boost on-chain activity.\n\nThe third is EIP-4844, which “is a big step forward in Ethereum’s Rollup-centric roadmap,” because it reduces the cost of rollups by 10-20x, wrote Leow. While investors have expressed bearish remarks about ARB’s price, “generally people are more closely monitoring EIP-4844 (blobs) in the Ethereum Dencun upgrade,” Carlos Mercado, a data scientist at blockchain analytics firm Flipside Crypto, said to Unchained over Telegram.\n\nRead More: Ethereum’s Dencun Upgrade Live on Testnet After Bug Delays Finalization\n\nThe last catalyst revolves around Arbitrum Orbit, which allows developers to create new chains atop Arbitrum’s layer 2 rollup. According to Leow, the main benefit of Arbitrum Orbit is that it allows the use of tokens native to the chains atop Arbitrum as compensation for gas, which would “limit sell pressure of the said token.”\n\n“Despite investor concerns over imminent token unlocks and the ARB token’s underperformance, ARB is strategically positioned as a frontrunner in the optimistic rollup sector, commanding nearly half of the total market share in rollups,” Leow said.\n\nARB, the governance token for Arbitrum, is currently trading at $1.91, down roughly 14% in the past seven days, data from Coingecko shows.\n\nDisclosure: Arbitrum is a sponsor for Unchained."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNdGhYNVQ4dG1sRkZITjloY3RUTFVGTWh2T3pLXzI1SmhJZVNvaV9HY2ZPb20wVjUxTVFqZGlERlBCY0lmbzhZdnFWMVRYWWh4b0FYM3ZTd2hpZUJfUUpOUXA1UlFNdERENk53ZHZablpVQ3Ffd3B3ZG1LR1ZydTRMdjVQX0xVWGJXb2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum correlation plunges to lowest since 2021 - crypto.news",
        "content": "Kaiko Research highlighted that the correlation between Bitcoin and Ethereum has dropped below its average of 0.71 for the first time since 2021.\n\nThis development comes amidst a broader market downturn, with BTC and ETH prices falling nearly 6% over the past week, currently at $40,991 and $2,463, respectively.\n\nHistorically, BTC and ETH have demonstrated a strong correlation in their market movements. However, the recent divergence raises questions about Ethereum’s future trajectory, especially in light of its trade volume surge without corresponding signs of a rally in the derivatives market. This phenomenon contrasts sharply with the BTC market, which saw significant growth in anticipation of ETF approvals.\n\nYou might also like: Grayscale CEO: Most spot Bitcoin ETFs will not survive\n\nReflecting on Bitcoin’s past, it’s observed that BTC exhibited a remarkable 100% return over the past year, overshadowing Ethereum’s 60% gains. The approval of spot Bitcoin ETFs marked a pivotal moment; BTC prices dipped while ETH experienced a rally, fueled by speculation that it might be the next to receive ETF approval.\n\nInvestors had previously focused on “ETH beta” tokens, like Optimism (OP) and Arbitrum (ARB), which are closely linked to Ethereum but with higher volatility. However, after ETF approval, this trend saw a reversal, with these beta tokens experiencing a slump and ETH showing relative resilience by registering the smallest decline.\n\nThe current scenario underscores the evolving dynamics between Bitcoin and Ethereum. While BTC’s ETF journey catalyzed its market presence, Ethereum’s path appears less clear. Its reduced correlation with Bitcoin suggests a potential for independent market behavior. Yet, the lack of traditional rally indicators in derivatives markets and the shift away from ETH beta tokens post-BTC ETF approval inject uncertainty."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPbFZlbWNjckxYd2tUaXZncUQtVnV0Sy1JaTE0WXUyRUZrQUhvLWpFRnRrdlZScXZnbWJORE0yVWRkQ1lvWkZpdXphNUJudFVEdVVua3pXcUdsXzNpSk5sclZhLUREZ2RZX2VZNktucGU5S3dicTlDQjExdlhDQXlHdkR2X0VDeGc5d1hmdU9KRlJYQVcwdXVQTXJ0UVh4dWxjU2RMOEFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "SEC delays Fidelity’s Ethereum spot ETF, but decisions are still expected in May - CryptoSlate",
        "content": "The U.S. Securities and Exchange Commission (SEC) said on Jan. 18 that it has delayed its decision on Fidelity’s proposed spot Ethereum ETF.\n\nMore specifically, the decision concerns a proposed rule change that would allow Cboe BZX to list and trade shares of Fidelity’s planned fund.\n\nThe SEC noted that the proposed rule change was originally filed on Nov. 17, 2023 and published for comment in the federal register on Dec. 6, 2023.\n\nThe SEC said today that, based on those dates, it was previously required to approve, reject, or institute proceedings determining whether to disapprove the proposed rule change by Jan. 20. However, it has now chosen to use a provision that allows it to extend that deadline by 45 days to March 5, 2024.\n\nIt is likely that the SEC will choose to institute proceedings around Fidelity in March, as it done for certain other pending funds.\n\nSEC expected to decide on ETH ETFs in May\n\nBloomberg ETF analyst James Seyffart said today that the Fidelity delay was “completely expected” and asserted that late May deadlines “really matter.”\n\nThat May deadline appears to be related to the fact that the SEC must either approve or reject VanEck’s competing spot Ethereum ETF proposal by May 23.\n\nAs the SEC has already instituted proceedings on VanEck’s application, it cannot delay its decision any further. And because the SEC generally approves similar ETFs together, it will likely decide on all pending spot Ethereum ETFs in late May, even though other applications have later deadlines.\n\nIt should also be noted that Fidelity, VanEck, and several other applicants succeeded in gaining approval for spot Bitcoin ETFs on Jan. 10. The success of those Bitcoin ETFs does not guarantee that Ethereum ETF proposals will also gain approval.\n\nPublic expectations are divided: one prediction market on Polymarket currently reports 54% odds in favor of spot Ethereum ETF approvals.\n\nEthereum Market Data At the time of press 12:26 am UTC on Jan. 19, 2024, Ethereum is ranked #2 by market cap and the price is down 2.47% over the past 24 hours. Ethereum has a market capitalization of $295.94 billion with a 24-hour trading volume of $11.91 billion. Learn more about Ethereum › Ethereum $2,462.54 -2.47% Crypto Market Summary At the time of press 12:26 am UTC on Jan. 19, 2024, the total crypto market is valued at at $1.63 trillion with a 24-hour volume of $63.06 billion. Bitcoin dominance is currently at 49.61%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQSTBKU2ttbFkxYXlxa1VLZ2xPRTRSejJHWFJndDhwVWJPNmFuM2hZNk5HRl9NRTNRdG5pbWRkLVpXTm91ekdxMm5jLVU4ai1RUU1BU3lOOFpoejh2aVFoVXZ4ejJmRWdQdERZRzJVdVF5N3dUM3RxNU50TWZ6bUJXZjBBUHhrZURSSGtFdDhZM25tY2dmVkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "A quarter of developers left crypto — but here’s why that’s not a bad thing - DLNews",
        "content": "What you'll learn The number of blockchain developers fell 24% last year.\n\nNewcomer devs accounted for a greater proportion of the exit from the blockchain developer community.\n\nBlockchain developer talent is becoming more evenly spread across the globe.\n\nA new report by web3-focused venture firm Electric Capital found a significant drop in the number of monthly active developers in the last year, with a nearly 25% decrease to 22,411 compared to 2022.\n\nDeveloper activity is often seen as a measure of value creation in the crypto space. Despite challenges like bear market conditions and the allure of the emerging AI sector, most experienced developers — those with at least a year under their belt ­— remain committed to blockchain development.\n\nBut for the least experienced developers — those who have been working in crypto for less than a year — the scenario is quite different.\n\nBlockchain developer count declined last year (Electric Capital)\n\nThe report points out that the high turnover among the least experienced developers in the crypto sector is linked to the bear market’s impact.\n\nElectric Capital’s cohort retention analysis shows shows that those developers who start their careers during a bear market are more likely to leave sooner than their counterparts who join in more stable market conditions.\n\nExperienced developers grew 16%, according to the report. This growth trend is in keeping with the steady increase in established developers who choose to remain in the industry as seen over the last five years Indeed, growth figures for the most tenured blockchain developers is up over 52% in the last five years.\n\n“Experienced devs push more code: 75% of code is created by developers in crypto 1+ years,” the report said.\n\nEVM chains hold sway\n\nWhile multichain development has increased 10-fold since 2015, much of that activity is concentrated in Ethereum and other blockchains that run on the so-called Ethereum Virtual Machine. That includes blockchains like Avalanche, Fantom, and Polygon.\n\nJoin the community to get our latest stories and updates\n\nEVM networks are similar to Ethereum and they use the same smart contract logic. That makes developers on Ethereum more likely to migrate to other EVM blockchains and vice versa. EVM blockchains account for 87% of multichain developer activity, as per the report.\n\nEthereum layer 2 blockchains — Ethereum scaling networks that rely on the mainnet for security — saw the most crossover among developers from across all EVM networks. Developers working on layer 2 blockchains like Arbitrum, Starknet, and Optimism saw the greatest level of crossover in this regard.\n\nDev report 1 The majority of EVM smart contract code is first deployed on Ethereum (Electric Capital)\n\nBNB Chain and Polygon also drew from the crowd of multichain developers with roots in Ethereum. At least a third of Ethereum multichain developers deployed code on Polygon and BNB Chain.\n\n“71% of contract code is initially deployed on Ethereum.” — Electric Capital Blockchain Developer Report 2023\n\nEthereum the most unique\n\nEthereum stands out as the dominant player among EVM blockchains, boasting 7,864 monthly active developers, although this represents a 25% decline from the previous year.\n\nThe report highlights that the smart contract codes deployed on Ethereum last year were predominantly unique, with most not being deployed on any other EVM platforms.\n\nMoreover, 71% of EVM contracts are initially launched on Ethereum, reinforcing its role as the leading source of new on-chain logic for other networks.\n\nWhat about Bitcoin?\n\nMost blockchain development happens on Bitcoin, Ethereum, and the top 200 crypto projects by market capitalisation, with Bitcoin and Ethereum accounting for 40%, according to the report.\n\nNOW READ: Degens are so high on inscriptions they just poured $106m into a Bitcoin NFT game that hasn’t even been created\n\nBitcoin has seen a notable decrease in its developer activity, with 1,071 monthly active developers currently, marking a 19% reduction from the previous year’s figures.\n\nThis decline is primarily attributed to the departure of part-time Bitcoin developers and those who are involved in multiple blockchain projects.\n\nBut the report also found that developers dedicated exclusively to Bitcoin were more likely to remain engaged in the platform.\n\nWhile Ordinals caused a transaction spike on Bitcoin, it did not translate to significant developer interest, attracting only 3% of devs with most of their colleagues focused on Bitcoin layer 2 networks and other scaling networks.\n\nThe US loses more ground\n\nAs crypto adoption spreads across the globe, so also is the distribution of blockchain development talent across the globe.\n\n“74% of crypto developers live outside of the US.” — Electric Capital Developer Report 2023\n\nSeven out of every 10 blockchain developers are outside North America and the United States has lost 14% of its share of the global blockchain dev market since 2018, the report said. The US now only accounts for 26% of blockchain developers compared to 40% in 2018.\n\nGlobal blockchain developer distribution continues to be more diverse with each passing year (Electric Capital)\n\nEurope and Central Asia are now the major global hub for blockchain development with 36% of devs from this report, per the report.\n\nWith more blockchain developers outside North America, the distribution of talent has undergone a meaningful shift. India and Nigeria have seen the highest growth in developer count over the last five years.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQMEF3WVFPSWdKMC16Rndwd1BjQkJGSGJqcTFDbzh1Q3VWR2hMaGdVN1JTbHRJYW5vWVpJSnltZWlZejdYdHo5OXpUaHp0RWJfMkNrYjhsbnhTTEZpMmdROFdiNzdsRVVKNGI0YjBzdWZPcHE0anhMYmpMNjc5NWI0SEYxdWpvSFh2aWfSAY8BQVVfeXFMT3E5UnFQOVdHcGY5U2pvMWpGZlVqMGs1MEQxNDZhZF9uTlNhcWYxT1Z6V1lqUFhyV1BtcG1rZmtmYkFYYlpyRmtUcDJBYjB5d3dQY2Qyd3Z1aXl6QXFIQTNDYS1CSU44c3VwWlBJZk5menhPaFYwbmlnM0d4dU5NWlNFazlXbGJDMzZCbkl4TUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Here’s Why Ethereum Price May Outperform Bitcoin Recovery in Near-Term - CoinGape",
        "content": "Ethereum, the second-largest cryptocurrency by market capitalization, has exhibited a notable bullish trend since the second week of January. This period coincided with the much-anticipated approval of the Spot Bitcoin ETF, a development that significantly contributed to Ethereum’s price surge from $2,170 to $2,714. In contrast, Bitcoin displayed continued volatility during this period. As previously reported by Coingape, there was a substantial increase in whale accumulation for Ethereum in December 2023. This trend suggests that ‘smart money’ investors showed a greater inclination towards Ethereum over Bitcoin, despite a historical milestone.\n\nWill Bitcoin continue to rise as Ethereum ETF could be the next topic of investor’s focus?\n\nadvertisement\n\nEthereum Price Project Strength for Prolong Recovery.\n\nThe ETH price may prolong recovery until the expanding channel is intact.\n\nA falling coin price may find a surge in demand pressure $2430 and $2300 supports\n\nThe intraday trading volume in Ether is $11.03 Billion, indicating a 10.3% gain.\n\nThe Ethereum coin has rallied in a bullish trajectory for the past four months, where the price jumped from $1522 to a recent high of $2714, registering 77% growth. A look at the daily time frame chart shows that this recovery can be followed using two divergence trendlines which show the formation of an expanding channel.\n\nThe coin price rebounded at least thrice from both trendlines indicating the market participants took a stick on this pattern structure. In theory, this chart setup reflects increasing volatility in an asset but provides a directional trend, once price breaks from either trendline.\n\nAmid the current downturn in the market, the Ethereum price recently reverted from a $2714 high to a plunge of 7.25% to $2517. This bear within the chart range could tumble the ETH value another 8-9% to lower the trendline around $2300.\n\nSome recent insights from on-chain analytics firm Santiment indicate. In just one week, the Ethereum price dominance over Bitcoin has spiked, reaching a remarkable increase of +22.4%. The network is experiencing rapid growth, averaging 89.4K new $ETH addresses daily, with an impressive surge to 96.3K new wallets yesterday. Ethereum’s presence in exchange supplies is dwindling, dropping from 8.15% to 8.10%, approaching its all-time low of 8.05%.\n\nThese developments project the ETH price is likely to rebound from a lower trendline which could surge its value past $2700 to chase the $3000 mark.\n\nETH/BTC Pair Rebounds From Crucial Support\n\nBased on the latest insights from respected analyst Michaël van de Poppe, Ethereum is showing a remarkable rebound, potentially signaling an upcoming uptrend. To firmly establish this trend, Ethereum must surpass the 0.06 BTC level. The observation of a weekly bullish divergence is a strong indicator of Ethereum’s increasing momentum, suggesting we might see considerable strength in the market over the next few months.\n\nExponential Moving Average (EMA): The ETH price above daily EMAs(100 and 200) accentuates the overall trend is bullish.\n\nRelative Strength Index (RSI): The daily RSI above 50% reflects the buyers having an upper hand on this asset.\n\nRelated Articles:\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQV255UXdJRFFLcEI5aks5S2hYcEJjdGhaeHF0VFpUaVNLYmpIN3pqa1RnT3Ewb1JQWm5EcDZQeFE5UkpQNk9OTUdLYVZvcVNnaGtHVDJqTzQ1SnlwZGdZZ1NfbTlaRjhnQ2ZLV0lVQ3JidF9GVXpnRXFOT3gtalZNZGtBV04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "SEC delays Fidelity’s Ethereum ETF decision - Yahoo Finance",
        "content": "Fidelity’s quest to launch a spot Ethereum exchange-traded fund (ETF) has hit a regulatory roadblock as the U.S. Securities and Exchange Commission (SEC) extended its decision window.\n\nFidelity’s Wise Origin Ethereum Trust, if approved, is a fund that would track the performance of Ether, the second-largest cryptocurrency by market capitalization. It would allow investors to gain exposure to digital assets without directly owning them.\n\nAccording to James Seyffart, an ETF analyst at Bloomberg, the SEC may choose to approve a batch of spot Ethereum ETFs as it did with Bitcoin. Seyffart pointed to May 23 as the next key date, the deadline for the regulator’s decision on VanEck’s Ethereum ETF application.\n\nThe SEC approved 11 spot Bitcoin ETFs last week, allowing such funds to be traded for the first time in the U.S. Before the approvals, the SEC rejected all spot Bitcoin ETF applications.\n\nEther price outshined Bitcoin’s price following the approvals surging past US$2,600 for the first time since May 2022, CoinGecko data shows. Ether has since fallen, losing 7% over the past week to US$2,436 at 12:30 p.m. ET. Bitcoin dropped 6.4% in the same period to trade at US$40,642.\n\nFidelity’s Bitcoin ETF, one the funds that received the SEC’s green light last week, crossed the US$1 billion today, becoming the second to do so, The Block reported."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNVFhqeFFvVW9QNXR4czdrWk1SczdrYTdxZzluVlFKdUtsTXEwcVI0T1lVVlJqdElYbHk2eElYbFZMRjVQRDRFbVNBZEdKN3o2SDdaVWYzbElGRG5sVlU1cGZqUTJ4N1BVTE42dzBiZFBHdF9DaUZGUjhJa0lJQU8xVzRrckFZSlNrN1lKMnFzRk1XelZua1FIMnViSmNoUXA2aEdOQ3RuV3diUGJKTTJqLTl6dHVaT2NZYkQ40gHAAUFVX3lxTE9ValNhVkdwZklIajgwUndST1VTa04wRkMyb29EOEUzR0tQUHRLVVd1N29Rak5RZzVRZU1zdkl4QXhMUnlKVFktQ2lCOGlQVlQwSWV5c01oeFo4bzhZcVFEbDYzZnN3VjB1WUtGb0hnN29NaXcxNmFfeXVqa2xtdjBWSUQzUTJSWFBFNVl3bTBnNGszZFVPM0xVbHZsNVZ5SC13VVJSQkJiREdTMlNWZWtKQlUxdmV2RE1tY1dQZlR6WA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Could See Growth in Layer-2 Ecosystem, Drawing on Ethereum's Experience: Report - CoinDesk",
        "content": "The projects will need refinement so they don't fall victim to the inherent limitations of the Bitcoin network, according to the authors. One particular upgrade on the radar is Stacks' Nakamoto Release, designed to enable cheap BTC transfers on a L2, improving transaction speeds to around five seconds instead of 10 to 30 minutes or even more."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPd2M0MlY2Y3hBUjJLNnJuS1BIMjloVktUdW1mdjB4UVlmbEFLaS1xcERjRG1vTGtmU3ZxSjVPT2tzYk1lczZYc0R6QnNDNjAxOEg1ajlzSjdENmhkckJ1Z0xmLWExT2VjZHhKOUg2UnpnN1NLblZXYUFESWlDbm5QRU1WaExkbUpSc2Z5QW1aWkV2RGpfR0tCM3dRTURaR1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "DeFi investors sent $370m from Ethereum to other chains. Here’s where most of it went - DLNews",
        "content": "What you'll learn Most of the $370 million liquidity outflow from Ethereum via Wormhole in the last month has gone to Sui and Solana.\n\nOutflows are possibly driven by memecoin and airdrop speculation.\n\nSui’s TVL has spiked 10-fold since October.\n\nSui and Solana have sucked a lot of liquidity from Ethereum over the past month.\n\nThat’s according to data from crypto bridge protocol Wormhole that shows $370 million in liquidity has moved from Ethereum to other blockchains, with almost 90% going to Sui and Solana.\n\nWormhole’s operations head Dan Reecer told DL News that part of the appeal can be explained by Sui’s incentive programme within its ecosystem that is “driving a lot of DeFi activity.”\n\nAs for Solana’s popularity, he said it may be “related to people looking to earn points on different apps after seeing the recent community rewards from apps like Jito.”\n\nSui and Solana dominate Ethereum bridge withdrawals via Wormhole (Wormholescan)\n\nLiquidity rotation\n\nCrypto liquidity rotators are known for keeping in touch with the latest “meta,” or trend, to position themselves for possible rewards. They do so by quickly shifting liquidity to avenues likely to offer rewards for user deposits.\n\nOne of the recent metas is “points” — a system for acknowledging user participation in DeFi protocols that may qualify them for future airdrops.\n\nNFT marketplace giant Blur popularised the points airdrop system and used it to great effect in capturing significant market share from OpenSea, the previous dominant player.\n\nNow, the trend has spread across platforms, protocols, and blockchains, becoming even more commonplace on Solana.\n\nJoin the community to get our latest stories and updates\n\nSeveral Solana DeFi protocols including Kamino, MarginFi, Parcl, and Solend, have announced points systems of their own.\n\nSui TVL has surged 10-fold in the last three months\n\nSui announced a $50 million incentive programme in October. Such programmes are used to attract interest from developers and investors by funding grants for the former and user rewards for the latter.\n\nSince the programme’s announcement, Sui’s total value locked, a measure of investor deposits, has risen 10-fold to $320 million, DefiLlama data shows.\n\nSolend, Solana’s biggest DeFi lending app with $160 million in deposits, may further boost Sui’s total value following its expansion to Sui.\n\nDespite the significant transfer of liquidity from Ethereum to both Solana and Sui, their combined TVL of $1.65 billion still falls far short of Ethereum’s $32.6 billion.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQcnJvcU1zeXAxcEFuelU0aXJncmZTYjU4Sl9TQTRReGE2UWRjR3UzSUsxUVFxQlpxUnVNaXVRZms5c1hvRG5TMnQzVDY1aU5QMlVGcmxsUHR0T2JwUjRaSVFEb3pnRmxMbVJtdFlRbUtYdS0zTFg4SHVzeDljdWJBRVR0eENlSGNfb1Q0VEFxWmdNWnhIZkQwUHBQRzViaUlLUk4zM1BuNk55RWRKd1AyUXZCcmlnNGJxVV9CWW85UdIBxAFBVV95cUxQZHdOVlRmelU2YWs4QU5qVkxXNzR6Q2VhVWVVUTZqRFFDdUdKUF9YNW1qWHMwclVwVTBuYlh0YUF4dS1jazViMHNwN3F6Tml4Y0FRU01nMkZyOHhMS0szM3dlUWYxeHBZQVNvM1VMRkRmMVY5LUd1cFhBVDZ1OFMxUndhbEQwd0tyTDg2alowSWZZczR5NkFMSGZmVGJBbUNvSXEtT2lsRHRaZy1wT2tsWXdGSTdWNHNmNDIzUlB6N2FOOVpH?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Ether Could Soar in 2024 on the Back of Dencun Upgrade, ETF Narrative: Analysts - CoinDesk",
        "content": "“ETH could be poised for a breakout year,” Nasdaq-listed crypto exchange Coinbase said in the weekly newsletter. “Last week’s bitcoin ETF news proved to be a boon for ethereum, which briefly spiked above $2,700 — reaching its highest price since May 2022. And there are reasons to be even more optimistic about ETH’s near-term future. For one, several of the firms behind the BTC ETFs — including BlackRock and VanEck — are also plotting ether-based spot ETFs.”"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNbEw0a2huSEhKZ3daWlFsTFNPSGpIQVVzQ3F0aTlyRmM4aUVuSFVDbklNTWdvd1NkVTdfZFg0OTFsRjFPdktIZjlJUmlGekJhQmpIQTNiVklPalZnLTBTUDFfTWJVYmhMbUZ0aS05VEMtNE1xMkthcTJ2dEl1aUxkdWEtM080cVhMNTQxbXpySjhlRW9tcGY4OTljVmFGbW1GY3JtbDRObHlQYXJI0gGyAUFVX3lxTE9NbjdTaDk1Z2lGaFppR1kySmtwTjdIanpHbWI4bjVuZ0NUa2NfcjV2bHFwN2cycFZ6bGFtWmJ2NGV0TkljX0h4X3hWUGJ2c0dNRXVjX3lNRFdHeHNfRzJqdEdJcXZzemxsVjlZd2NvbnUtbk84bkZHMXZfZm9aZW9XRXJ2c2w2aDRyNk1TNElHZDFTRk9JblVvejBfYkRMWFdXVlVjNGxSRl9qR0hrZWFEdXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Staking Platform Kiln Raises $17M for Global Expansion - CoinDesk",
        "content": "Kiln said the money raised will be used to fund the company’s global expansion, which includes the opening of its Asia-Pacific headquarters in Singapore in the first quarter, as well as further product development."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQNzhCa0M0c3haT3VCeXB0eHUyUHlhbjAzWjRtS21sbTFPbTB3bHRNbXU4VmJDazNMZkJuR3FhVDctWXlxU2xrbk1ob1NIN0NDdmF0cDlRdVZKVF90QVZYaUtXOEI5elJ3QTFDVTQwdHc5XzNjUDZ3aXBjblhwMHNDZE9KZHVsSGVwa1N1MTFGcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Ethereum outpaces Bitcoin post-ETF launch as ETH/BTC ratio skyrockets - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPRk1nTkFvaUVWTWhvRmhoQl9OdVY3aW55VVE2ekczb1l5YVdxT3JUSXRxRW5NME50NEVpaERfUFF1Ql9iWnJ2MDVjczdLc004UWdjeVBuYXhmRmVRdVVnUERJR25rSmZDQ2ViQkpVRmZWNUFUSDFtRmVfbEFzLV9jeE14RUtQa0h3ZElrdnFFOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Ethereum’s Evolution: The Economics of a Spot Ether ETF - Blockworks",
        "content": "Wondering what happens after the approval of a spot Bitcoin ETF? Join us to explore the unique aspects of spot Ether ETFs and how they differ from their Bitcoin counterparts. Discover why a spot ETF is a game-changer for Ethereum, opening new avenues for accessibility, liquidity, and investor participation. Plus, we’ll discuss the exciting possibility of staking and yield strategies within ETFs and how institutions can use ETH staking derivatives."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOdktqZklPeUR4b1VyLWl0WjQ2amNiUlZKU1hOcVVVUV9sa0NGQzRQaFJFWGh4NXh3bjZkdzMzTGJBM29pTmpqbWNvRXkzWE40MWRJYWxwbHdkWXhncEM2T2hrdkFTNmp4SzU2ZUxrQjVCYlluV1J1Z1JtdGE5SU1QWVNBV3UzUWVBWU1FZXlocnV4blFKd0Y1bzNpYTZsQUxNVkV3ZmNycUJIQjh0eE04eE5qV0VXZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Weekly Price Forecast – Ethereum Continues to Consolidate - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPOUVYX3Y0bmlDSG15X2hOZDdRWGx0cTlTY0QzUDJDM0pqMTJKYkJtbEdUUEF4VGk2LTh3MVBvRTdtYVo5S2VqWWVZWmh5YkpNQzhYbVNnc3V0TEpZcm40ZXBnSmlTY0dTamFReGRfRkNaUDZEQ1dKSHhqZHJjYlIwazN0Q0ZEOTFPbnVV0gGQAUFVX3lxTE9EdmJicXgzMlNpemEwU3FtNVVKTzUxUGM5S3FzUGN0dEktVERaZnRYVXdCcnpOTzNIY0lxdG1IR0ZZdFdPXzdzdXF1WnlMMWY0ODFsUklYR21RaGN5QlY3andCUUNkVnktSkZkSlFDdFpkOU5KQUM5OHlWQ0pIVzNzSGVvcXBqWHlIdUVTQUFXSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's Dencun Upgrade: Two Key Dates to Watch as Testing Advances - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nChristine Kim, vice president of research at Galaxy, shared a quick recap of the latest Ethereum developers' call.\n\nAdvertisement\n\nGoing forward into the Dencun testing timeline, two key dates might be critical to watch ahead of mainnet activation.\n\nThe Cancun/Deneb upgrade on the Sepolia and Holesky testnets has been scheduled for activation on Jan. 30 and Feb. 7, respectively. In this regard, Ethereum core developer Tim Beiko says to expect an announcement with client releases in the coming week.\n\nQuick update from ACD call today:\n\n- Cancun/Deneb upgrade on Sepolia and Holesky testnets remain scheduled for activation on Jan 30 and Feb 7, respectively.\n\n- Client releases for both upgrades will be bundled and shared in a blog post next Tues.\n\n- Full writeup from today's call… — Christine Kim (@christine_dkim) January 18, 2024\n\nThe much-anticipated Dencun upgrade follows last year's Shapella upgrade. According to ETH developers, it will first be deployed to the Goerli testnet, then, if no major issues are found, to Sepolia and Holesky. Once Dencun is running smoothly on all three testnets, mainnet activation will be scheduled.\n\nDuring the week, the Dencun network upgrade was activated on the Goerli testnet. The upgrade included several changes, most notably the introduction of ephemeral data blobs with EIP-4844, also known as \"protodanksharding,\" which will help slash L2 transaction fees.\n\nEthereum developer Tim Beiko recounts the events that led to Goerli not finalizing immediately after the Dencun upgrade was initiated. Due to Goerli having an open validator set, there was an expected but significant drop in validator participation at the fork.\n\nIn addition to this, a client bug on the network with Prysm set the historical root value to 0 instead of copying over the last historical root when Deneb was activated.\n\nOnce the bug showed up on Goerli, its cause was found, a fix was made and a release was put out shortly after.\n\nWith more validators coming online and one client team upgrading some nodes that had been missed, the Goerli network eventually finalized.\n\nWith this significant milestone reached, Ethereum developers are now proceeding to fork the Sepolia and Holesky testnets before the mainnet launch.\n\nThe much-anticipated Dencun upgrade combines changes to both Ethereum's consensus and execution layers. The list of protocol changes includes: EIP-1153: Transient storage opcodes; EIP-4788: Beacon block root in the EVM; EIP-4844: Shard Blob Transactions; EIP-5656: MCOPY (memory copying instruction); EIP-6780: SELFDESTRUCT only in the same transaction; EIP-7044: Perpetually Valid Signed Voluntary Exits; EIP-7045: Increase Max Attestation Inclusion Slot; EIP-7514: Add Max Epoch Churn Limit and EIP-7516: BLOBBASEFEE opcode."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQakd5a1F3Rnd6Sngxc1lmeGgyMHhydm1JTzlOMjA0TWVJUnVvUmE0dWpvdnBrSzh6V0VoajVNRXdkaXJMVVJER0ZjWkxkdko1ejhENTVrTUpyTWdMZ3hhSldjTHlZdU5CbHdpVVQ5T3A1T3llMUVJZ1cycGdHeWQ4OXFOTzJqdnplcjBBd1RXNUNOczdma0J4dzYxVWVtOGlIdGZRTEV0UTA4T081U2x2ZWFIemZ0YUt4andZdW1GVUxfOE53QW4zOEo5ONIB0AFBVV95cUxQbUhkTlBqNFVuZG9HOFV6VXNweGMzbU1sbk5SNVhiXzhwZVprUmRmeDY2c0tlaDVmSmNsNWt4RVZrU0Z0YTlvVnJxM0NobjQwUjllQ0JxX2hUSFNMakNEazlfTGRYRGFxanZUWnNrOTJnUmhnMWJoUE82ak1lQmszdmJUcHR2WUZYRWFvWUo1QkxiMFJhaUNJTHpxM0hFdWkzY25MMnhjWEJVVklBVjI4TEFIWFU0cGpaMUllWEhBbGJELTFXaW53Mml2WVk5bjJJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum and XRP Sitting at ‘High-Risk’ Profit Levels, Warns Crypto Analytics Firm Santiment - The Daily Hodl",
        "content": "Crypto analytics firm Santiment says that three of the largest crypto networks by market cap now have more than 80% of their existing supplies in profit.\n\nThe Total Supply in Profit metric measures what percentage of coins are currently in profit compared to the last time they moved, and sometimes correlates with price trends.\n\nAccording to Santiment, Bitcoin (BTC), Ethereum (ETH) and XRP have 83%, 84% and 81% of their supplies in profit, surpassing their average that range between 55% and 75% and placing these coins in high-risk profit territory.\n\nSantiment says the assets last hit this level in March 2022.\n\n“Bitcoin (83%), Ethereum (84%), and XRP Ledger (81%) have their respective supplies in historically high risk profit levels compared to their averages that hover in the 55%-75% range dating back to 2018.”\n\nSantiment says cryptocurrency prices can still go up because of positive developments in the industry, including the approval of a spot Bitcoin exchange-traded fund (ETF) in the US, but the firm says a lower percentage of the supplies in profit would be a bullish indicator for the crypto assets.\n\n“Crypto can absolutely still climb due to more exposure from ETFs and other positive news. But ideally, a great signal to watch that would imply continued long-term growth would be a breach below 75% of their supplies in profit once again.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPN3U1eFViUlVsV3I5TVI2d1U2ai0xcXliNnQ3MU5pNEVtMk9hVjJkbF9pU2VBNVgzT3gzR2p3emlXOE1DMjZUaVppRkdLZWN3QW9SeTB1R0Jad2ZaRkd0dmxzWnJ5QTNDbVlqSFEzSVIzM2wyR3kwdExIb0hCRDhsQw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Can Ethereum (ETH) Price Reach $2,700 as a $1B Trading Strategy Unfolds - crypto.news",
        "content": "ETH price has outperformed BTC since the Spot ETF approval on Jan. 11, but on-chain data suggest the gap could further widen in the days ahead.\n\nEthereum price continues to consolidate its lead over Bitcoin this week closing above the $2,500 mark in each of the last 4 trading days from Jan. 15.\n\n2 vital trading indicators highlight how the ETH bulls could further assert dominance in the days ahead.\n\nInvestors have shifted ETH Worth $1 billion from exchange-hosted wallets into long-term storage\n\nAs Ethereum price raced up the charts last week, there was widespread speculation that investors could book profits at the milestone $2,500 territory. But interestingly, at the time of writing on Jan. 18, ETH price has closed each of the last 3 trading days above $2,500 suggesting that the bulls are, instead, holding out for more gains.\n\nLooking beyond the price charts, the recent shift in ETH exchange reserves better projects the bulls holding stance. Cryptoquant’s exchange reserves data provides a real time snapshot of the total units of a cryptocurrency that is currently held in wallets hosted on exchanges and trading platforms.\n\nAs of Jan. 11, investors held a total of 14.8 million ETH coins in exchange-hosted wallets. Interestingly, the figure is now down to 14.7 million ETH as of Jan 18.\n\nEthereum (ETH) Exchange Reserves vs. Price | Source: CryptoQuant\n\nAs depicted above, investors have now shifted 133,271 ETH coins from exchange wallets into long-term storage in the last 7 days. exchange-hosted wallets into long-term, dispelling concerns of potential widespread profit-taking at the $2,500 milestone.\n\nTypically, a drop in exchange reserves is often bullish for a cryptocurrency’s short-term price action. It essentially means that investors are moving their coins from trading wallets into long-term storage.\n\nPreference for long-term storage during a price rally signals investor confidence and intent to hold out for more gains. With the exchange supply in decline over the past week, it’s unsurprising that ETH price has consolidated above the $2,500 support since Jan 15.\n\nImportantly, the historical trends show that periods of rapid decline in ETH exchange reserves have often been followed by a price uptrend. If the pattern recurs, Ethereum holders can anticipate an upswing toward $2,600 in the days ahead.\n\nWhile exchange supply drops, ETH is attracting more demand\n\nSecondly, as Ethereum exchange supply declined over the past week, the total number of active ETH sell orders has now dropped far below market demand. This current Ethereum spot market dynamics is another vital on-chain indicator pointing towards ETH stretching its lead over BTC in the days ahead.\n\nIntoTheBlock’s aggregate exchange order books chart captures a cryptocurrency’s total active buy/sell orders across multiple exchanges.\n\nCurrently, there are active purchase orders for 357,490 ETH listed across 20 crypto exchanges including Binance and Coinbase. Meanwhile, the bears have put sell orders for only 250,750 ETH.\n\nEthereum (ETH) Aggregate exchange order books | Source: IntoTheBlock\n\nThe chart above depicts that the market supply for Ethereum has fallen short of demand by 106,740 ETH. Intuitively, when the demand for an asset outpaces supply by such a large margin, it signals a dominant bullish sentiment within the ecosystem.\n\nIn summary, the prolonged decline in ETH exchange reserves has now led to excess demand in the spot markets. These two vital short-term indicators could accelerate Ethereum price rally and further widen its lead over BTC.\n\nETH Price Forecast: $2,700 Could be the next target\n\nBased on the 2 critical on-chain data points analyzed above, Ethereum price looks set to remain in upward trajectory towards $2,700 in the short-term.\n\nBut for the bulls to validate this bullish forecast, they must first scale the $44,000 resistance level. IntoTheBlock In/Out of the money data, which groups current Ethereum holders by their historical entry prices. also affirms this forecast.\n\nIt shows that 1.78 million existing investors had acquired 1.84 million ETH at the maximum price of $2,612. If those holders look to sell as ETH approaches their break-even point, it could inadvertently trigger a reversal.\n\nBut if the bulls can smash through the sell-wall at $2,612, the $2,700 area could be the next target for Ethereum price.\n\nEthereum (ETH) Price Forecast | Source: IntoTheBlock\n\nOn the downside if things take a bearish turn, the bulls can rely on the historically significant buy wall at $2,400 for initial support.\n\nThe chart above shows that 853,920 addresses acquired 4.5 million ETH at the average price of $2,414. If those holders make frantic efforts to cover their positions, Ethereum price can stage an instant rebound from that territory."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNTkZFTk1IUjI2X01WRmZBWnF2YkxaZnA0UW5OcVZOYlJwd0hrck9Ca1JvRDBVQmQwV2kzeGZPa1VWbFNmT3otNXJaS0JVTHFnbDV2SktSSUF3elgtdW5zR3ltLWZtQkZFeUxqd05MQkFnU0MzN1Z1eGRRcTllcmRGa2J3ZXBMXy1fZkJsZElDemN4X1dmamFEQy1ZUnTSAaIBQVVfeXFMTTloM21hcXVoT2dsaUo4YmV1LTA2YngtbmducDRnZk1Uc0Yxd2tTSGxOQVh4MjNpQUl4YnlmOERJSUhkeHFHVlp4NXZnSzZqOWhMc21sMXR3dmNoRjlHb0Rha2dySVhueEhiVkRNOWlaMGloUjhzR3pZSnBibWJXYm1kMl90a21KVFRMNE9pV2ZzMjhPak5veU5WNVl1ejFIRk1n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Bull Market Over for ETH Following Drop to $2.4K? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has been on the rise over the last few months, breaking through resistance levels one by one. Yet, the cryptocurrency might have reached a potential turning point.\n\nTechnical Analysis\n\nBy TradingRage\n\nEthereum Price Analysis: The Daily Chart\n\nOn the daily chart, the market has been acting very bullish since breaking the 200-day moving average to the upside. It has been making consistently higher highs and lows, with the Relative Strength Index showing values above 50% the whole time.\n\nYet, the $2,700 resistance level decisively rejected the price to the downside last week. The market is currently consolidating below the mentioned level. Meanwhile, considering the availability of several support levels, investors can still be optimistic about the short-term trend.\n\nThe 4-Hour Chart\n\nThe 4-hour chat paints a more clear picture of the recent price action. The cryptocurrency has been forming a falling wedge pattern since failing to break above the $2,700 resistance area.\n\nA bullish breakout from the wedge can result in a retest of the $2,700 level, while a breakdown would be catastrophic, as the price could drop toward the $2,100 level in no time.\n\nSentiment Analysis\n\nBy TradingRage\n\nEthereum Funding Rates\n\nWhile Ethereum’s price has been gaining momentum on the upside, market participants have become more optimistic that ETH will eventually make a new all-time high this year. Yet, too much optimism might be a worrying factor.\n\nThis chart presents the funding rates, one of the key metrics for futures market sentiment evaluation. Positive values indicate that buyers are more aggressive on aggregate, while negative values demonstrate that short sellers are executing their orders more aggressively.\n\nAnalyzing the chart, it is evident that the funding rates have been very positive for a while, showing values comparable to what was previously seen during the $69K all-time high range. As a result, the probability of a long liquidation cascade is very high at the moment. These potential liquidations could lead to a significant drop in the coming weeks."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQbERjVFRISVoxZkVRQ19ZMkJMd2ZtbFpGaGoxNlBkZ2lVQXBuUVhhckxaVG1ZcmZBMy1TZE5kd3J6STNBZFp5cm5uRHQ4Z1VSOWxPelVsVXJRTUtlOThMbjhEU09sQWtPYUxMN3FTbFlDZVpDZkE3UGhpSXotZkFCOTd5a0FZUklpc05Vc2xn0gGWAUFVX3lxTE9heksydHotYVRIYUw4MUI2QVBEYkpscGprOTdUSHV3U2htVDJJVkxrZGYzclpyc2FyaFROMUlTVnEzVlA3emhTUW12M1luRnJyZ1VYRUNpN05pQktQd1RLbTZOQ3pKZjlHYUFNZVlIQ1dWX2JoM19NcGs3X2F4ZkY0cVdhN1h4RWdRSkRXZDgtT0dnV0ZsQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Ronin Gaming Wallet Now Supports Ethereum, Polygon, and BNB Chain - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Ronin blockchain’s official crypto wallet just got a massive upgrade.\n\nSky Mavis, maker of the play-to-earn NFT game Axie Infinity and the developers behind the Ronin gaming sidechain for Ethereum, have added multichain support to the Ronin wallet mobile app for iOS and Android devices.\n\nThe Ethereum mainnet, the Ethereum sidechain Polygon, and Binance’s BNB Chain will now be accessible in the latest update, according to an image in the announcement.\n\nThe new version of the app that began its phased rollout out this week includes an in-app web browser, a new visual design that offers more details on specific token activities and NFT information, and support for multi-party computation (MPC), among others.\n\nAD\n\nAD\n\n1/ Today, the Ronin Wallet evolves. Stronger security. New blockchains. A sleeker, more intuitive design. Check your preferred app store for the latest Ronin Wallet update now to feel the future of gaming at your fingertips 🧵👇 pic.twitter.com/XEYbytlfVD — Ronin (@Ronin_Network) January 19, 2024\n\nRonin Wallet’s MPC addition is an optional security feature that allows crypto traders to essentially “divide” their wallet’s login info on the backend, requiring two or more pieces of the login instead of a single private key.\n\nThe MPC feature, when combined with a social login, can be used across multiple Ronin-based games like Axie Infinity and Pixels without having to effectively create multiple wallets, according to the blog post.\n\nLate last year, the social farming MMORPG Pixels saw a substantial spike in activity when it migrated to Ronin. A month later, the Ronin wallet added support for Binance Pay, which allows users to swap cryptocurrencies for Axie Infinity tokens like AXS and SLP.\n\nAD\n\nAD\n\nWith other wallets from the likes of Magic Eden, Sequence, and Immutable also coming to the fore, competition is heating up among gaming wallets as crypto companies add more features to gain—and retain—users.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxPeWwwNkpsclprdnB3SGNLQ2N2NkVZTDZTOS14cV96SWh2VzFwbkRyTHc0SW1qSTRKd24zb3pwRmxZRW5sMGtXc3RGRDdiUDNGZU0wV2JOdFBpWjJIMGZXMEZfWEstR1BIV2ZSRnpTTlR2U1Nvd1padk1tTlVwVlllVF9XbUFHVG9FM3FBQzFtUTRTZUVQSDlTYV9CZjVSWGhBblRKems3VVUwZ01KNzB4RmVtZ2RDb3gtVjdrb181UjdjRjhaeHczXy15M2tJYlJON1ljSXY2emJoanJKZzhkNdIB5gFBVV95cUxNLVF3OTNlc1A1YUJpVTdnczhqblBsaHNpdFdHdUdlamczd1dsMVU2ZFphdUZHRHgzUXBET2RwUFM4NzJoMUhMTEJ3MlJ5V1pUNjkxaVA5cEZmcGRmQXdyRWczZUgzWWFRRDB4X2czaUkxSWt4WUFyaDhQZmU2WW92UE13TTNzMjlMSXNCcExCSWozbG9Sdnc5NExmTy1jUmM4YmVlTzNzbWNnOHM3YnFuRWpQMDIxZXp2SzRNS1JrQ2RSSDFEY0d0ZWkwdnpqdEl0RTdjTlkwVWNpemdqdW82blJhdC1Bdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "SEC lives up to the expectations as it delays spot ETH ETF; Ethereum price makes no move - FXStreet",
        "content": "The Securities and Exchange Commission (SEC) delayed its decision on Fidelity’s spot Ethereum ETF, per a filing.\n\nDespite the spot Bitcoin ETF approval setting a precedent, the SEC stated that it needs time to consider the issues raised following evaluation.\n\nThis was expected of the regulator, given its response in the past, and the next deadline is now on March 8.\n\nEthereum price remained stationary around $2,450, unaffected by the decision, but is losing the strength to reclaim $2,500.\n\nThe crypto market faced a long battle with the Securities and Exchange Commission (SEC) when it attempted to secure a spot in Bitcoin ETF, which finally came to fruition when the court interfered. Now, it seems like Ethereum is set to witness the same ordeal as the SEC is taking two steps back after rejecting the spot ETH ETF application.\n\nSEC says no to Ethereum ETF\n\nAfter a long, drawn-out battle for the approval of the spot Bitcoin ETF, it was expected that Ethereum or other assets might not have to deal with the SEC in this regard. The reason was that spot BTC ETF, backed by the court, likely established a precedent for exchange-traded products (ETP) of such kind, but by the looks of it, this did not happen.\n\nThe SEC, in a filing today, delayed its decision on Fidelity’s spot Ethereum ETF application. The regulatory body took an early decision as the deadline for the same was set on January 21. The final deadline for the SEC is on March 8, though this will likely get extended, too, given the present scenario.\n\nThere is a chance the SEC might not obstruct the process this time, given its brush with the law last year. i.e., Grayscale’s lawsuit against the regulator. Furthermore, just like the last time, there is not just one applicant as seven major asset management firms have applied to issue their spot ETH ETF.\n\nThis includes the likes of BlackRock, ARK & 21Shares, and Grayscale too, which is attempting to convert the Grayscale Ethereum Trust (ETHE) into a spot ETF. Grayscale was the biggest catalyst in making Bitcoin ETF a reality, giving Ethereum ETFs a strong backup.\n\nSpot Ethereum ETF applicants\n\nEthereum price sees nothing\n\nEthereum price did not react exorbitantly as the altcoin remained mostly undisturbed and unaffected by the SEC’s decision. This can be seen in the chart below, where the second-generation cryptocurrency is keeping above the $2,450 support line.\n\nThis shows that the market had been expecting something like this to happen, hence the lack of bearishness at present. However, even if there is no bearishness, it does not translate to an abundance of bullishness either. The price indicators Relative Strength Index (RSI) and the Moving Average Convergence Divergence (MACD) are both showing receding bullishness in the market.\n\nThe most harm this could do to Ethereum would likely be a correction to $2,356, where a bounce-off would revive the rally.\n\nETH/USD 1-day chart\n\nHowever, a rally to $2,600 and beyond would invalidate the bearish thesis and set a new multi-month high for the Ethereum price."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxOR0lPc1dVTmJZTFpnMmd3VFh2U3lyNUZ5TmFnQmZzSTBUSVp3NlZPRXpZcXdqM2M2V3JIX3dFeFRyQWlLcGlzSmF1X1B3aXI5UGw1UW5KWlZtWVpyRTFoLVBDWDZSd3k5MzAyeXBHNXp1aFJ5YUJZZ3k4bnZuX0hXTERMalNhVUs5ZXIxUkhmNDA0anRqZ2loVnBtU0lzenlYRXBqY0VIckpnVHBMRjNHOHdzZXpSLXYzUmlLdzBHRk1fUzFtVUwzeFFLZnFleHFpREd5N2puVFR3bFdZbkdN0gHkAUFVX3lxTE1ZdEhvVGh4TnVONDVQVm5hSVdYcjdEdWpBcFFKdC1FbVloMGRIN3FfQVk4bzg1N3JGaDBlYVo5U3V6SC1fR2tzR1hwU1VSYUlRQmNuQVlzcGswZUhQSDVTUW8zTDMzSk5DTVNZbklMZi1mNFk5MVpNRzNMMVJfdUdVcG5rWmYwUkhGMTNnRFh3RXJaVDNZVjdKYkRQU3JydDZVYllqeUU1dnQ2ZVJvZnRVWmQ2d2JCTE1GY3F4cWZvbkpYaDBoU1l4aUQ5dktlMXJ4d3lRQUZKMkpZN1VDLWlfOTR5SQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum and XRP hit peak profitability in ongoing cycle amidst altcoin season - FXStreet",
        "content": "Bitcoin, Ethereum and XRP supplies have hit historically high-risk profit levels compared to their averages from 2018.\n\nSantiment analysts believe these asset prices can climb higher due to exposure from ETFs and other positive developments.\n\nA breach below 75% of the asset’s supplies in profit could ensure long-term price growth in BTC, ETH and XRP.\n\nBitcoin price sustained below the $43,000 level despite historically high-risk profit levels, as seen on Santiment. Analysts at the on-chain data intelligence tracker note that once the level of supply in profit (currently above 80%) declines below the 75% mark, it is likely that the asset prices continue climbing.\n\nAlso read: Bitcoin price drops 8% in one week, BTC halving event draws close\n\nBitcoin, Ethereum and XRP supplies climb to record high-profit levels\n\nBitcoin, Ethereum and XRP’s 83%, 84% and 81% supply is currently profitable, according to Santiment data. These numbers put the three assets in the high-risk profitability zone, as seen in the chart below. The averages for the three assets have been typically in the 55-75% range over the past five years.\n\nAnalysts at Santiment believe there is room for BTC, ETH and XRP prices to climb higher. Experts argue that these assets have potential for long-term growth amidst positive development\n\nBitcoin, Ethereum and XRP Ledger. Source: Santiment\n\nIn the past two weeks, the approval of Spot Bitcoin ETF, news of leveraged ETF filing by issuer ProShares and the rise in Ethereum price against Bitcoin, have fueled optimism among traders. Experts believe that once the percentage of total supply in profit declines below the 75% range, it can be considered a signal of long-term growth.\n\nThe speculation surrounding XRP ETF is another factor likely to influence sentiment among market participants and impact the profitability of BTC, ETH and XRP supply. At the time of writing, Bitcoin price is $42,424, ETH is trading at $2,511.71 and XRP is exchanging hands at $0.5617."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMisAJBVV95cUxNa1VsUzZOUklzWlgyYnJNX3dlQ0tpdXNLb2x5TUNMeW8xalB2RVZ3TWRWSUwwYUNtN19FQzdici1Ubm5DNlVTYW9BNDI1a1FQNWUxOUhoTVRpMDBwTktzTDdpVHNkUmtaWktzaC0xU09YQnZuWGp5ekdGX2J0R2ZVdXY5a3ZUWl9BalNxaWc3aFBLbzFuM2poVkZaMTFfSWJ4YTV6Zy1ReU5xTXdmWWZlT0xXNDdIMU1FZG81V1gxekpzNlYwUDg4NzJZUjVuOTV2OUVzOURTOHQwNE0yU2NPc1VYakJwX0FCYjUtMEFBSGx2X1FpcnBUY0NQbEZvRHVvU0FnbXZpb2hXWE1ldjk2WEo5czV3RGNkUjhHQ1VyTUY2WWxZXzhXeGE0QkF1Umdu?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "The new Staking service by Metamask for Ethereum users. - The Cryptonomist",
        "content": "Non-custodial service provider Metamask has introduced a very interesting feature within its wallet called “Validator Staking” aimed at users of the Ethereum blockchain.\n\nThis is a service that allows you to stake ether directly on the Portfolio section of Metamask, running your own validator node that will be managed directly by Consensys.\n\n\n\nThis mechanism eliminates the need for pooling or complex hardware and minimizes the chances of encountering slashing of your Ethereum node.\n\nMetamask’s Validator Staking could also solve the problem of centralization of LSD providers like Lido, which currently controls over a third of all ETH locked on the Beacon chain.\n\nLet’s see all the details below.\n\nThe Metamask wallet makes Ethereum staking easier with the “Validator Staking” feature\n\nThe well-known non-custodial wallet Metamask presented yesterday to the public the “Validator Staking” feature which allows all Ethereum blockchain users to stake by running their own validator node on the network.\n\n\n\nThe node will be directly managed by Metamask’s parent company, Consensys, which eliminates the need for pooling or using complex hardware, but applies a 10% fee on the interest generated by staking.\n\nCurrently staking on Metamask has an APR of 4% and requires a minimum of 32 ETH to participate (or multiples).\n\n\n\nThe service could break down several entry barriers as few users are able to run their own validator node and often choose to use third-party services, centralizing the entire process towards a few players.\n\n\n\nStaking on Metamask instead assumes that the end user always has control of the node, even if it is not managed directly.\n\nIntroducing Validator Staking on MetaMask Portfolio.🦊\n\n\n\nWith a 32 ETH deposit, we run your very own validator node where you're always in control.\n\n\n\nNo pooling. No hardware. Just rewards.✔️\n\n\n\n🔗 https://t.co/rmCtgs86WO pic.twitter.com/R8VRttP2XX — MetaMask 🦊🫰 (@MetaMask) January 18, 2024\n\nThe Metamask service against the risk of slashing\n\nAs explained in the introductory video, the service provided by the Metamask wallet helps mitigate the risk of slashing in case of internet interruptions, as Consensys is a reliable entity that has never received sanctions from the network despite managing ETH worth over 2 billion dollars through more than 33,000 validators.\n\nFurthermore, Validator Staking also reduces the downtime of your node, maximizing the final yield.\n\n\n\nAll this could even solve the centralization issues of large liquid staking providers like Lido, which currently controls 32.2% of the Ethereum staking market with over 9.3 million ETH locked in it.\n\nSeveral experts from the Ethereum community have indeed observed how Lido is acquiring an increasingly dominant role in this context, risking to monopolize the LSD sector.\n\nAnyway, Lefteris Karapetsas, founder of the Rotkiapp cryptocurrency portfolio tracker, has noted that the returns offered by Metamask are not in line with those of Lido and other managers. These are his words in a post on X:\n\n” It’s an interesting idea, but a 10% commission makes it a completely unattractive option for any user who cares to compare it with other options available on the market.”\n\nA small step for Metamask, a big step for mass adoption\n\nThe service presented by the Metamask wallet, which allows Ethereum users to run their own validator node for staking in complete autonomy, opens the doors to an era of decentralization and operational simplicity.\n\n\n\nThis is a small step forward for Consensys, which can further strengthen its position in the cryptocurrency market, and at the same time a big step for the crypto community towards mainstream adoption of non-custodial practices non-custodial.\n\nThe fact that users can run a validator node without the need for special hardware and without certain skills speaks volumes about the potential offered by Validato Staking, which has all the cards on the table to scale the Ethereum staking market.\n\nObviously the yields are lower than those we can find on alternatives like Lido or official staking on the 2.0 platform, but they eliminate a series of risks and entry barriers that make the service very convenient for less experienced subjects in the web3 sector.\n\nThe vision of Metamask\n\nTraditionally, many people rely on centralized services for staking, but this initiative allows users to maintain greater control over their funds.\n\nDecentralization is one of the key principles of the Ethereum blockchain industry, and this move aligns with the goal of distributing decision-making power among users.\n\nIn order for the outside world to truly embrace the mainstream adoption of non-custodial crypto practices, it is necessary for these processes to be simple and intuitive for the end user.\n\nMetamask has always been oriented towards this vision, and while seeking to offer solutions that put the user in a position to always be in possession of their assets, it aims for a constant simplification of its products.\n\nThe wallet supported by Consensys, until a few years ago, was solely a wallet for cryptocurrencies, but now it is increasingly taking the form of a unified hub where it is possible to store one’s assets, exchange them with other users, engage in trading, staking, and even convert one’s coins into fiat currency.\n\n\n\nThe work to be done to reach the general public is still long, but it is evident that Metamask is on the right track."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiT0FVX3lxTE9zT204SDlfbGVSZlpEYnc0YjNyMDFwZUFhN0ZEeTA0VjNNY2RGUWk3RGtmNmdyMEp6N1hxNFJjV0E2RWtHLVBMRlBhZF94ZTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "ERC-3643 is looking for ways to bring compliance to RWA tokenization - Blockworks",
        "content": "The ERC3643 Association recently revealed a new UI plug-in tool that will enable DeFi protocols to run checks in compliance with the ERC3643 standard.\n\nThe ERC3643 standard, also known as the T-REX (Token for Regulated Exchanges) standard, is a modification of ERC-20.\n\nUnlike the ERC-20 token, ERC-3643 is a permissioned token that uses smart contract technology to define conditional transfer functions.\n\nThis means that decentralized validators can only approve certain transactions after they have met predetermined rules. This enables compliance structures that can be used for regulated assets, like securities, while retaining the standard of ERC-20 functionality.\n\nThis new UI tool was developed in collaboration with DevPro and Tokeny and enables ERC-20-compliant DeFi applications to interact with permissioned ERC-3643 tokens. This includes real-world assets, token securities, loyalty tokens, stablecoins and CBDCs.\n\nRead more: Ethereum Improvement Proposals to watch in 2024\n\nDennis O’Connell, president of the ERC-3643 Association, told Blockworks that compliance rules are directly embedded through ERC-3643 at a token level.\n\n“As an extension of ERC-20, ERC-3643 ensures interoperability with any ERC-20-supporting applications. The key distinction lies in denying transactions or actions if counterparties fail to meet compliance requirements, effectively bridging compliance and interoperability,” O’Connell said.\n\nHe notes that, unlike other standards that use wallet whitelisting for know-your-customer (KYC) checks, ERC-3643 uses digital identity to whitelist users through verifiable credentials.\n\n“This ensures the compliance validation process is entirely on-chain while protecting privacy. No actual data will be published on-chain; only verifiable credentials, which are proofs of verification by trusted parties appointed by token issuers,” O’Connell said.\n\nRead more: Dencun and Pralectra: Ethereum core devs chart an ambitious 2024\n\nThe standard was initially proposed to the Ethereum community in 2021, but did not receive approval until December last year. Companies currently exploring this technology include APEX Group, Aztec Group and Capgemini, to name a few.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQZDVHd3U1dkpOQzUyZEdmdFZZN3hsN2tRU09BSjRkVjc2LTFkb25tR0F3VF9jeHJMN242ZXhFbHVjQ2N4SGNqZ1h3TEdEZG54Z09nTUYzR3NQbW43bHhoQm1XWlpNUVVGMTc5d0dJTURRekNrek5UX3BVdGljRUxTb1FsLVhFMlRsaEl2Wg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin sparks debate on layer-2 classifications - Crypto Briefing",
        "content": "Buterin says that systems relying on external data availability are validiums rather than \"genuine\" rollups.\n\nShare this article\n\nA discussion over classifying layer-2 solutions (L2s) has erupted within the Ethereum community after remarks by co-founder Vitalik Buterin.\n\nIn response to a post on X by Daniel Wang, founder of Taiko, an Ethereum rollup solution, Buterin said that reliance on external chains makes a system no longer a rollup since assets can’t unconditionally be withdrawn if operators collude against users.\n\nThis is correct. The core of being a rollup is the unconditional security guarantee: you can get your assets out even if everyone else colludes against you. Can't get that if DA is dependent on an external system. But being a validium is a correct choice for many apps, and… — vitalik.eth (@VitalikButerin) January 16, 2024\n\nButerin adds, though, that despite the classification, validiums remain suitable for many other applications. Buterin notes that systems relying on external data availability (or DA, as mentioned in the tweet), such as modular blockchain Celestia, are validiums rather than “genuine” rollups.\n\nValidiums and rollups are scaling solutions for Ethereum that allow more transactions to be processed off-chain, reducing congestion and gas fees.\n\nRollups batch transactions off-chain while posting data to Ethereum for security, providing scaling through compression. Validiums also enable off-chain transactions but use zero-knowledge proofs for validity without publishing transactions on-chain.\n\nThe main difference between the two is data availability. In a rollup, the data is available on-chain, while in a validium, the data is stored off-chain and only a hash is stored on-chain.\n\nThis difference makes validiums more efficient and versatile than rollups but also introduces a data availability risk if the data availability providers collude, censor, or go offline. Validiums are administered by a collection of smart contracts deployed on Mainnet, including a verifier contract and a data availability committee.\n\nOn the other hand, rollups publish the full data of transactions on-chain, making them more reliable and secure but ostensibly less private than validiums.\n\nIn this case, Buterin is proposing critical changes to how layer-2 solutions are classified, introducing a new taxonomy of layer-2 solutions based on more neutral “strong” and “light” labels for rollups and validiums, respectively, with the “strong” label denoting “security-favoring” solutions, and the “light” label representing “scale-favoring” L2s.\n\nThis logic is based on two distinct purposes that layer-2 solutions serve: scaling and modularity.\n\nIn terms of scaling, rollups offer compression from transaction batching, providing security inherited from layer 1. However, data storage and verification processes limit throughput. Validiums avoid this through zero-knowledge proofs that validate off-chain activity without exposing transaction details on-chain. This enables validiums to scale to higher volumes.\n\nRegarding modularity, solutions like Celestia adopt this approach: data availability is customizable based on specific needs, and validation layers are open to independent deployment. If a classification between “light” and “strong” L2s, as Buterin proposes, is implemented, it will affect how modular chains allow customization across data and validation components.\n\nThe key difference here is how rollups mandate data availability on Ethereum, maximizing security but reducing modular flexibility. On the other hand, validiums enable adaptable data and validation layers to optimize performance but also open up trust assumptions, potentially lowering transaction security.\n\nRyan Berckmans, an investor in decentralized payments protocol 3cities, countered Vitalik Buterin’s proposed taxonomy by asserting that validiums should still be considered layer 2 solutions. Berckmans claims the L2 sector has the flexibility to define terms in ways that maximize usefulness.\n\nTo support his position, Berckmans points to L2Beat, a data provider tracking the adoption of layer-2 protocols, which currently categorizes validiums under its umbrella of L2 coverage.\n\nHowever, L2Beat’s explainer states that validiums and other models relying solely on validity proofs rather than direct data availability on Ethereum introduce additional trust assumptions and fall outside the scope of rollup-style L2 solutions. By avoiding base layer settlement, L2Beat argues that validiums fail to inherit the security guarantees that define conventional layer-2 implementations.\n\nThe arguments reveal inconsistencies that are still present across layer-2 implementations. Projects like L2Beat aim to bring clarity but need help with contradictions as pioneering teams innovate on scaling models that don’t neatly fit the current definitions.\n\nBerckmans advocates for a functional taxonomy that includes advanced networks expanding Ethereum’s throughput and capacity. In contrast, Buterin and L2Beat favor more strict security-oriented criteria that validium tradeoffs fail to satisfy at a conceptual level."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFBEczJUcHhiLTNtTDRmdUVxZ1AtWG5SR0NfemhCRDQ2TU9nZGRCMnhKdlhpbXM5YnRyMjNNc1F5MHJmNDlGN1FZQ2kzVVE4T29pS0txZGNmWjlydlRza01LajRwRXlyOWZibXZoQm5R0gFzQVVfeXFMT0M4dnVlcF90WV9ramN4YlBGNDVzeTZlMWozZTJOQWlaNzgyWE10eGhPSExOVTJ5QlBSZ3YzTHZid0taR2tsekQzdEVLUHdjemVEalZKT0RLSjNFRlBZRWNHa0RLdjJ6YnJJOWtNZFk0WUNsOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "SEC Delays Fidelity's Spot Ethereum ETF, Here's What's Next - Bitcoinist",
        "content": "The United States Securities and Exchange Commission (SEC) has announced an extension in the decision-making process for Fidelity’s proposed Ethereum exchange-traded fund (ETF). According to the official statement released on January 18, 2024, the SEC has decided to prolong the review period by 45 days. This extension is to ensure that the SEC has “sufficient time to consider the proposed rule change and the issues raised therein.”\n\nThe Fidelity Ethereum Fund, filed under the self-regulatory organization Cboe BZX Exchange, Inc., seeks to trade shares under BZX Rule 14.11(e)(4), specifically focusing on Commodity-Based Trust Shares. Initially published for comment on December 6, 2023, the proposal has now moved its crucial decision date to March 5, 2024, as the SEC utilizes the full extent of its designated period for a more thorough review.\n\nJames Seyffart, a Bloomberg ETF analyst, did not express surprise at this development. In his Jan. 18 X (formerly Twitter) post, he stated, “Fidelity Ethereum ETF delayed just now. Completely expected. Dates that really matter are late May in my view,” while also emphasizing the importance of late May as the critical period, particularly referencing the SEC’s final deadline of May 23 for VanEck’s Ether ETF.\n\nEthereum ETF Approval Has Good Chances\n\nWhile some analysts remain hopeful about the SEC’s potential simultaneous approval of multiple spot Ether ETFs just before the first final deadline, mirroring its strategy for spot Bitcoin ETFs, skepticism persists. Bloomberg’s Eric Balchunas projected a 70% likelihood of an Ethereum spot ETF approval in May, considering the multiple applications awaiting the SEC’s verdict.\n\nDigital asset lawyer Joe Carlasare expressed confidence in the eventual approval of an Ethereum spot ETF within the year. In a detailed analysis on X, he outlined key factors that should theoretically favor an approval: “ETH Futures are already trading on the CME. The SEC has already approved ETH futures ETFs. The CME has identical surveillance sharing agreements for the BTC futures and ETH futures. The correlation of ETH futures to spot is over 90% (just like BTC).”\n\nAccording to him the regulated futures market of significant size is the primary reason the SEC approved the spot Bitcoin ETFs. “Therefore, it would be arbitrary and capricious to treat the ETH futures and spot markets differently (See Grayscale v SEC),” he Carlasare claims, adding that the “SEC doesn’t like to pick winners. I think they would prefer two digital asset spot ETFs rather than just one.”\n\nAdding to the discussion, Nate Geraci, President of the ETF Store and co-founder of the ETF Institute, commented on the necessary components for a spot ETH ETF approval, saying, “CME-traded ether futures + CME-traded ether futures ETF approval + Grayscale court victory + spot bitcoin ETF approval = spot ether ETFs should be approved.” This statement suggests a positive outlook, considering all parts of his formula are already in place.\n\nContrasting these optimistic perspectives, Will Clemente III introduced a note of caution last week, reflecting on a recent statement by SEC Chairman Gary Gensler: “Gensler just said in his statement that BTC is the only crypto commodity, so not nearly as high of expectations for an ETH ETF getting approved – but the market loves narratives to grasp onto.”\n\nAt press time, ETH traded at $2,470.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNWFZkTWlIOWJ4ZDlIcW5vUmwyMTF5ZUNYQ0FyR1lmTjc3LUFfWENnNVUyWTZnVWFDOEhpaS1wXzA1ZU1rZkRES0l1MUNWQ2ZtRnJBUmVrUFhxNkxPVXZRVFJaT0NBZ2x4d0k5cURiSUhyTUE4YnNYVEp0RFBtOW51RkRNWVdXSmJPVEFoZUNKU1gwd9IBlwFBVV95cUxOZVRKWmt5OHJYQzVMdzdLV0xzTEZ2THQtcDFKdmRuMm1CZ1lsc1lJQ1pUazI3RnlMZDRFRFNHeERDZVhDNEFBSHRPN2ZQOGlYM28zb1FDRkhzWkFIUFo0a0U4OUJtS05nQTMtYVo3VUFJODhNU1d4enUyczhrUUJjN1l6YjJjRWZFRGMyNVU4Uk5BYVhzN2Nr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Ronin adds multichain support for Polygon, BNB and Ethereum - Blockchain Gamer",
        "content": "Following the recent growth streak for its Ronin blockchain, Sky Mavis has announced a range of updated features to its network’s wallet – both Chrome extension and mobile apps – including multichain support for Polygon, BNB and Ethereum.\n\nWith over 600,000 daily active users, much thanks to Pixels’ steady success since its Ronin migration, the network has inevitably attracted users native to other blockchains. In order to facilitate smooth onboarding for these, and “millions more” future players, Sky Mavis has introduced multichain support for Ronin wallets.\n\nUltimately, this means users of other blockchains – currently Polygon, BNB and Ethereum – can onboard Ronin using their current seed phrases, connect to external dapps, and access their NFTs, ERC-20 tokens as well as manage transactions on Ethereum and other supported chains.\n\n4/ Ronin has always been Ethereum aligned, and it’s about to get easier than ever for Ethereans to join our movement.\n\n\n\nIntroducing multi-chain support on the Ronin Wallet!\n\n\n\nYes: the Ronin Wallet now works on Ethereum ⚔️ pic.twitter.com/MAxezJeJhb — Ronin (@Ronin_Network) January 19, 2024\n\nDuring the latter part of 2023, Ronin experienced a massive growth spurt, going from 19,200 DAUWs and to its current 600,000.\n\nSince the first thirdparty games onboarding Ronin were announced in March 2023, the chain has seen multiple games migrating from other chains – most prominently Polygon – including Apeiron, ACT Games‘ Zoids Wild Arena, and of course Pixels.\n\nIn addition to adding multichain support, Ronin has also integrated MPC technology to enhance the security of its wallets. Users can choose to opt in to MPC, which basically separates a wallet into multiple recovery elements that must be combined in order to access the wallet, rather than just with a single seed phrase.\n\nRonin wallets are available to download via App Store, Google Play and Chrome store."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOZjc3ZHdQNVBXd0ZqQnlOYWw1ZkxLVHhXMy1OR0FfbkxUMDFzUHhpTHZFSk9EajBEanlXZXZuUkFrQ2RyVTlxLWJBZVhsTkFwRENzY3p6Rl8takJVcXdQZVdLTWVQQzBFOUNyQVpuaTZ4SkozT1A0QU1NOURqSTMzT2gyQWpYeHB1Si1meElxVV9hMDgyUUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "EigenLayer eyes new security model - DLNews",
        "content": "EigenLayer relies on a pooled security model that makes it cheaper to launch certain protocols.\n\nStill, that model may encourage risk-taking.\n\nOver the past two months, founder Sreeram Kannan has revealed a change that may minimise collateral damage.\n\nA forthcoming version of the billion-dollar EigenLayer protocol will let some users buy “insurance,” a change that may quell sceptics’ fears that the protocol could destabilise Ethereum.\n\nEigenLabs co-founder Sreeram Kannan detailed the change earlier this month in a series of posts on X.\n\nThe change, which Kannan had outlined during a presentation at a November conference in Istanbul, is highly technical.\n\nIn short, it is intended to reduce collateral damage suffered by EigenLayer’s users in the event some of them fail or are successfully hacked.\n\nKannan did not return requests for comment.\n\nRestaking\n\nEthereum’s security model requires that users lock up, or “stake” their Ether. The more Ether staked, the more an attacker would need to gain control of the network. Still, retail investors often find the process too technical or the capital requirement too high to stake Ether themselves.\n\nEigenLayer matches investors who hold Ether or staked Ether with individuals and companies known as node operators, who manage the capital and hardware necessary to run the Ethereum blockchain.\n\nEigenLayer then matches node operators with protocols that would otherwise require bespoke blockchains. EigenLayer calls these protocols actively validated services, or AVSs.\n\nJoin the community to get our latest stories and updates\n\nThis process, restaking, makes it possible to use the same capital to simultaneously secure Ethereum and a variety of other protocols.\n\nProponents have called it one of the most exciting developments on Ethereum, something that could make it safer, cheaper, and easier to launch new protocols.\n\nThe eight-month-old protocol has adopted a phased rollout, and its first AVSs have yet to launch. Nevertheless, it has already attracted more than $1.7 billion in user deposits.\n\nEigenLayer deposits topped $1 billion in December.\n\nSceptics, however, have questioned the protocol’s potential impact on Ethereum as money pours in and its full launch approaches.\n\nPooled and attributable security\n\nThat is, in part, because EigenLayer currently uses a “pooled” security model, in which AVSs rely on the same pool of capital.\n\nSharing the cost to access that security across every AVS makes it more affordable and ensures that attacking any single AVS would require a massive amount of capital.\n\nAt the conference in Istanbul, Kannan likened pooled security to a military alliance.\n\n“Cities don’t have armies, nations have armies. Sometimes even many nation states coordinate to create alliances that actually work together,” he said. “It’s exactly the same phenomenon. Shared security is strictly better.”\n\nIt may also introduce some unproductive incentives.\n\n“You’re incentivizing people to basically take on more risk with security that’s being subsidised by other people,” Chunda McCain, founder of Ion Protocol, told DL News.\n\n“If you assume now that everyone’s hand-in-hand, you know, all working together for the betterment of Ethereum, only building the most robust and resilient systems, then it’s great, right?” McCain continued.\n\n“As soon as you say, ‘OK, no, this is a permissionless protocol that anyone can build on top of,’ then you’re like, ‘Wait a second, this system doesn’t make sense’.”\n\nA future version of EigenLayer will still feature pooled security, but it will also give AVSs the option to purchase “attributable security,” a feature that Kannan has likened to insurance.\n\nAttributable security gives an AVS a claim on a certain amount of restaked capital that it can seize and redistribute in the event something goes wrong.\n\nThat allows them to enjoy the benefits of pooled security while limiting collateral damage to node operators, restakers, and other AVSs in the event one fails.\n\nAVSs will likely pay a premium for that, according to Kratik Lodha, a founder contributor at Renzo, a liquid restaking protocol.\n\n“As an AVS, when you are attracting attributable security you will ideally incentivise that capital more, as it’s solely dedicated to securing you and not any other AVS,” he said.\n\n“We see a hybrid model developing between the two wherein AVSs can have both [of] the security models and differently incentivise each.”\n\nGiven concern over the leverage that restaking could introduce to the Ethereum ecosystem, adding attributable security may address some of the criticism.\n\n“It definitely is less rehypothecation than pooled security,” said Meir Bank, co-founder of Anzen, a protocol under development that will attempt to automate AVS’s payments to node operators.\n\n“If the concern is just about the amount of rehypothecation, attributable security is less rehypothecated by definition.”\n\nSlow and steady\n\nMcCain said that some AVSs will form coalitions in order to save money on insurance — those that trust one another may opt to split the cost rather than purchasing it individually.\n\nWhile making the EigenLayer ecosystem safer, this could effectively raise the cost to launch AVSs using the protocol.\n\n“You decrease the cost of capital to some extent, but it’s not like the orders-of-magnitude decrease that you would get by pooling security across thousands of applications,” McCain said. “Because technically now the attributable security is a couple applications, or maybe a dozen at a time.”\n\nEigenLayer has not given a timeline for introducing attributable security. Node operators and an EigenLabs-built AVS are expected to launch in the first half of 2024, with third-party AVSs to follow.\n\n“The EigenLayer team, they’re not going at the fastest speed because they actually want to get these things right,” Bank said, “because it’s important for the long-term security of Ethereum.”"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQdF9KMms4OE9YWnhmcHVzejE1WUR5RlhkV3pxbGFZd2VWNUdSd2ZBUlpWVHp0WFNkNUpVTmp5X1RZd04wWEdFVFNzaEsxWW9XYVJONjU3NjNrRG9qb3lmR2FFRk55SXVvTE84S3ZMNHdiN0t0SFBvYUZJZnFvZGVOeVh6NDBMMUhHMGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Ronin Wallet Expands to Ethereum, Polygon, and BNB Chain - PlayToEarn",
        "content": "Ronin, a key player in the blockchain gaming world, has taken a major leap. Their latest update for the Ronin mobile wallet is a game-changer for Android and iOS users.\n\nDeveloped by Sky Mavis, creators of the Web3 game Axie Infinity, the Ronin wallet is part of the Ronin sidechain for gaming. Good news is, the wallet now supports not just Ethereum's mainnet but also Polygon and Binance's BNB Chain. This expansion marks a new era of versatility and access for Ronin wallet users.\n\nBut the update is more than just about adding new chains. The refreshed app, rolling out this week, sports a sleek new design, allowing users to see more detailed info about their crypto assets and NFTs. It's a visual and functional upgrade, tailored for the modern crypto enthusiast.\n\nOne of the standout features is the introduction of multi-party computation (MPC). This optional security feature adds a layer of protection, particularly useful for crypto traders. It works by dividing the wallet's login information, requiring multiple pieces for access instead of a single private key. It's a smart move in an era where security is paramount.\n\nThe beauty of the MPC feature stems from its ease of use across multiple Ronin-based games. Players of Axie Infinity, Pixels, and other games on Ronin can now manage their assets more efficiently. They can do this without the hassle of setting up multiple wallets.\n\nAdding to this momentum, the platform made headlines last year when the social farming MMO Pixels migrated to Ronin, leading to a spike in activity. Shortly after, the wallet integrated Binance Pay. This integration allows users to swap cryptocurrencies for Axie Infinity tokens like AXS and SLP, further enhancing its utility.\n\nRonin's move comes at a time when the gaming wallet space is becoming increasingly competitive. Other major players like Magic Eden, Sequence, and Immutable are also enhancing their offerings. The goal is clear – to attract and retain users in this fast-growing sector."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxQNXVHSVhFSUswbGxoWnZBSzlxY2FBUFEzckFtN1pESGZEQ2Q1ZjJ4VE02Tld3REUxTlA1MXFuODNMOS0wajZfU1dIbGFteEhzX192WEhqYTVyQ2Y4OUN6YlY0ZUpabHJYNm5GX01NQ3FadncwT2c4UlRlQkV1SnRndlp4cVlDQXY1a013ZWdZUzExZ1p0OWNlQjRhd3NYMFNHN3YxaTRRYjhQWUZmNENJSEg4T0otUmJqRVg2dk5MSndwVTRiLWowQUM3WWh1NXhtd2E1SHpacndJZHY1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Raoul Pal Spills Secrets: How To 'Make Life-Changing Money' In Crypto Within 2 Years - Benzinga",
        "content": "Macro investor Raoul Pal is predicting \"life-changing wealth creation\" in the crypto space over the next few years.\n\n\"This crypto opportunity is literally the perfect macro opportunity of a lifetime,\" he said Thursday. \"It's a very high probabilistic outcome that the next two years make life-changing money.\"\n\nYounger investors, particularly those burdened with student debt or unable to afford property, have a unique chance to improve their financial standing, he says.\n\nPal's advice:\n\nAvoiding FOMO (fear of missing out)\n\nSteering clear of leverage\n\nFocus on major assets like Bitcoin BTC/USD , Ethereum ETH/USD , and Solana SOL/USD\n\n, , and Be wary of exposing your portfolio to high-risk ventures.\n\nBitcoin ETFs — 'A Pivotal Moment': Pal described the Bitcoin ETF launch as a pivotal moment, akin to a \"go rodeo\" scenario, characterized by chaos and humor, typical of the crypto world.\n\n\"It's a total shitshow, nobody knows what's going on. Everybody's laughing. Everybody's memeing the whole thing,\" he said in an interview with YouTuber Jamie Tree, capturing the essence of the crypto community's response to the event.\n\nThis launch, according to Pal, signified a major shift where traditional financial entities are stepping into a domain previously dominated by crypto enthusiasts.\n\nDespite the high trading volumes witnessed during the launch, Pal pointed out an unexpected market response.\n\nMany hedge funds had been buying into the Grayscale Bitcoin Trust GBTC at a discount and hedging their bets, he says. But with the ETF's introduction, these dynamics shifted, leading to a sell-off in Bitcoin.\n\n\"So there's little selling of Bitcoin that was coming out of that. So there might have been $1 billion of selling that came out of that,\" Pal adds.\n\nDiscussing future inflows, Pal projects a bullish scenario for the Bitcoin ETF, estimating around 50 billion dollars in inflows for the year.\n\nRead Also: Binance's Market Share Among Crypto Exchanges Slides As OKX, ByBit Chip Away At Its Dominance\n\nEthereum ETFs: Regarding Ethereum ETFs, he gave a 70-75% chance of approval by August, citing SEC Chairman Gary Gensler's likely strategy to integrate major cryptocurrencies like Ethereum and Bitcoin into the traditional financial system.\n\nPal wasn't taken aback by Ethereum's surge following the Bitcoin ETF approval.\n\nHe drew parallels with the late 1990s public market, where early-stage investors and ETF companies had been selling products in advance, leading to significant market churn upon actual launch.\n\n\"The new volumes come in, people taking stuff off. So there's lots of churn,\" he said, explaining the post-launch market dynamics.\n\nPal's \"Everything Code\" thesis, known for its accuracy in predicting market movements, was a significant topic of discussion.\n\n\"The everything code just says liquidity in, I buy it, you make money. That's it,\" Pal summarized.\n\nThis approach, focusing on liquidity as a primary driver of asset prices, has enabled him to anticipate trends and make successful investment decisions in the volatile crypto market.\n\nRead Next: Sam Bankman-Fried's Mom And Dad Want FTX Lawsuit Dropped, Deny Wrongdoing"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNN0hqMHNsQ2tMajZ0cWJDc3FZSHJydi12QmZXWlF6dUNIZGcyVGpZS2tHSUZCaW9uUFd4blJJWWl2dHRZTUc4MWRENWRhbGVORENOLW41aHNVcjAzeUJHRzFWWmc5T1FyY0g4WkwxdDN3dmIzZ1pNYVRVSFRVY1ppYlVrVXRzaWhSakx6TlJDa9IBlAFBVV95cUxPQ2sySmhTVXMyUTFBOVl0X0NpckJFYUZFeDVXY1BFUkVtcWFkYjZmYlBNVVlvNHpSM1lFOHNtUkVZLUVaVzRIenUwekpMSlR1aUl1S2wwQnMyUUNsOFpUTmxUdThsak9kdnRaZW9haXZWbjh0ZUY3OEZBdzdUVkxpa2xFZGdubGllTDJxb080NnQwZk9t?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "How Bitcoin, Ethereum are luring in holders with surging profits - AMBCrypto News",
        "content": "Bitcoin and Ethereum hit historic profit levels.\n\nETH and BTC have yet to sustain uptrends in price.\n\nBitcoin [BTC] and Ethereum [ETH] have reached historic profit levels despite recent price fluctuations. As profits surged to noteworthy milestones, the number of holders has also steadily risen.\n\nBitcoin, Ethereum hit historic profit levels\n\nAn analysis of Santiment data showed that Bitcoin and Ethereum have achieved historic profit levels.\n\nAs of this writing, over 83% of the Bitcoin supply was in profit, although this marked a decline from the 89% observed at the beginning of the year.\n\nSimilarly, the Ethereum supply in profit was currently over 84%, slightly down from the over 85% recorded at the start of the year. It’s worth noting that the current profit levels for these assets are historic because the last time such levels were observed was in 2021.\n\nMore Bitcoin and Ethereum holders keep emerging\n\nAn analysis of Bitcoin and Ethereum holders on Santiment showed a parallel growth with the rising supply in profit.\n\nExamining the total number of Bitcoin holders from August 2023 to the present, there has been an addition of over 4 million holders.\n\nAs of this writing, the number of BTC holders was almost 53 million. Also, the chart showed an upward trend, signifying an ongoing increase in holders.\n\nSimilarly, an analysis of the total number of Ethereum holders during the same period showed an increase of over 9 million.\n\nAs of this writing, the number of ETH holders was nearly 113 million. Also, like BTC, there was a noticeable upward trend in the chart, indicating a consistent rise in the number of holders.\n\nETH maintains a bull trend while BTC falls from it\n\nThe daily timeframe chart for Ethereum showed recent fluctuations between profits and losses.\n\nDespite this, the price has sustained higher than those observed in the preceding months. As of this writing, Ethereum was trading at around $2,500, experiencing a decline of less than 1%.\n\nDespite this, the Relative Strength Index (RSI) suggests a strong bull trend, with the RSI just below 60.\n\nIn contrast, the daily timeframe chart for Bitcoin reflects a less favorable recent price performance. Trading at around $42,500 as of this writing, Bitcoin has encountered a decline of less than 1%, placing it in a bear zone.\n\nIs your portfolio green? Check out the BTC Profit Calculator\n\nThe BTC RSI was below the neutral line, indicating a bearish trend.\n\nCoinMarketCap data revealed that the current circulating supply of Bitcoin was around 19.6 million, while Ethereum’s circulating supply was about 120.1 million."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPM19hb090cmJkeGd2X0Ricmx3MVJsbUU5dm9KRlJRUXZORmR5bjhCZ0c2U3lORXVNR0NyTVFBN1VHMkpwdE9CV1lvWU9VVGFfOE9zXzgtTVhha3BjLS0zZTZHMVFvSkttTl9SdE4yMFBMeVZ5WmtoQ0lyUWNRRWstMzZ4QlQtNU5WX0FieEo5cXlLLWMtTTdqaDFfeW5vX3l3bTY0aWNRUGxNYV94aFpOLXEybThRYTBtY1FUY1dNSlZsZlNPeXVMdEo2QkN0dFNaYWlMd2JDWdIB3AFBVV95cUxQdEVNYURDenlEclFrbG51Z29OR2dxYlVuT0RhN1ZVY1FtTV9ReHp2NFhjNmdmRjR4Z3VoYy11d2FNSk5QYkJKNU5kQXA3QUZKNXNOQUdaWDRCYzhDYm5LTFg5RWJ6bHczTTItN2gtSXY3a0xSRGpOVERqNms1YWRvQmdzTTRWRS0tZV9iaXJILUtqQjUteVlQLVRhakVvRGxFdzBPWWozZ0NUcUlSdTlHRmNHNHNRb0dHd2Z6cmZNMjRRaVR1QS1qSWtCVlZsVFc3aWVnTWMzMEFjbFFt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Top Crypto Trader Says Ethereum Challenger Solana Gearing Up for a Double-Digit Rally – Here Are His Targets - The Daily Hodl",
        "content": "A widely followed cryptocurrency analyst and trader is expressing bullish sentiment on Ethereum (ETH) competitor Solana (SOL).\n\nThe analyst pseudonymously known as Bluntz tells his 237,000 followers on the social media platform X that Solana might soar more than 39% from its current value.\n\n“I think SOL might be gearing up for a leg up to $140-plus. This downtrend has been tested too many times now for me to consider bearish and can’t ignore the clear three-wave move down from the highs looking corrective. Looks like the past two-week range has been a base, send it.”\n\nBluntz practices the Elliott Wave theory, a technical analysis approach that attempts to predict future price action that tends to manifest in waves. According to the theory, a bullish asset goes through a five-wave rise followed by an ABC corrective move before starting its next leg up.\n\nLooking at the trader’s chart, he seems to predict that Solana will ignite a new five-wave surge after completing an ABC correction.\n\nSolana is trading for $100.62 at time of writing, up nearly 4% in the last 24 hours.\n\nNext up, the trader says memecoin dogwifhat (WIF) is set up for a breakout after a period of price consolidation around the $0.33 level.\n\n“Very healthy consolidation range beneath prior ATH (all-time high) on WIF. You better believe once we get out of this range it’s going to full send.”\n\nWIF is trading for $0.42 at time of writing, up more than 59% in the last 24 hours.\n\nThe trader also believes that decentralized exchange (DEX) project Maverick Protocol (MAV) is undergoing a massive rally after breaking out of an ascending channel.\n\n“Now that is a monster daily MAV breakout. We’ve entered the parabola phase.”\n\nMAV is trading for $0.67 at time of writing, up more than 2% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNc096UktZRTZmUjVVRWY3NjJWeFpUaDJDR0FiR3RHVEV4OVV6V0FfNTU4YkNlWE8zZDYweUVoc1Frb1NzS3JRMENRNXR4eTl1QnU1TkIwX3FUZFFHRHVNX0Vfa3VwTDBSLUk2Qy1CNF9jVVZndDczQzJTcUZrVW40bHF3blBsQnEwb0VXRFUtWjJNcG4xSk1WdDh2ZXFwbGpsTXNz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Near Foundation and Polygon Labs collaborate on Ethereum ZK rollups - CryptoTvplus",
        "content": "In a joint announcement, the NEAR Foundation and Polygon Labs revealed the successful integration of NEAR’s Data Availability layer (NEAR DA) with Polygon CDK, providing developers with a powerful tool for creating their own Zero-Knowledge (ZK) rollups tailored to their specific requirements.\n\nNear Protocol is a layer 1 blockchain network that utilizes a Proof-of-Stake (PoS) consensus mechanism and sharded architecture to enhance transaction throughput and scalability.\n\nIt is designed to enable the development of decentralized applications (dapps) and is considered a challenger to established layer 1 blockchains like Ethereum.\n\nNear Protocol’s sharding solution, known as “Nightshade,” involves breaking up the blockchain into sub-chains with different validators working on them, which are regularly connected.\n\nThis approach aims to improve transaction speed and reduce costs, while also addressing the challenge of scalability as transaction volumes grow.\n\nPolygon ZKM is a zero-knowledge proof (ZK proof) project developed by Polygon, a layer 2 scaling protocol for Ethereum.\n\nZK proofs are cryptographic techniques that allow users to verify their identity online without revealing sensitive information.\n\nPolygon ZKM is designed to enhance transaction throughput, preserve user data, and enable trustless on-chain verifications.\n\nNEAR DA is designed for efficiency and scalability, simplifying network management and reducing costs for Ethereum rollup builders.\n\nIt aligns with NEAR Protocol’s scaling capabilities, providing a robust and cost-effective data availability solution.\n\nPolygon CDK acts as a straightforward Layer 2 (L2) stack, which gives Ethereum developers the flexibility to create custom L2 chains with personalized configurations.\n\nThe integration of NEAR DA with Polygon CDK allows rollups to benefit from lower data availability costs, significantly cutting overall rollup overheads.\n\nNEAR DA not only offers cost-effective and fast data availability but also facilitates modular blockchain development.\n\nRollup builders on Polygon CDK can now use NEAR DA as a complete out-of-the-box modular solution, enhancing the overall development experience.\n\nIllia Polosukhin, the Co-Founder of NEAR Protocol, expressed enthusiasm about making NEAR Data Availability (NEAR DA) available to developers using Polygon CDK for rollups. He highlighted the benefits of NEAR DA, with emphasis on its cost-effectiveness, rapid data availability, and scalability through NEAR’s sharding technology."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOZHZ4Umo0U0FsdTlFSWI4RE9QY2VhY3Z2ZTlpZy0yd1BfX0V6U1c4VmYwVjBpZ0tuanhPbXRSRU9BNjFqbzg5TjNNbXhaM0NULXp6VWd4S21JVzhYZFE2clUtSEhIWHdseDJxOVBuZ0I4TDk1c0VrdFBTaTRiOFFBVXF2enVwdlFlMzZQaGk3cklQdUVRelZMOVFXSdIBoAFBVV95cUxPS0tfb1lBWUQwZzgyUHpTNTVoTXdKS3JUQnJFY3g5eU95bExiRTEwVHVfd2ZKS2NRbUFpMUhsaXlOdFBmUmI0WmZBdXV1UXhFQVV2VWFoMFRzeFBlV1BmdHpUeUh2a2p6U3hnZEVyMUI5TmpBaUh0SHZxTmd5V240RFFTMG9OV2RhN3lMUENPTERhT1JZb1Zhc05fSUtKbjdO?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "WEMIX and Arbitrum see most growth in 2023 but Polygon remains #1 gaming blockchain - Blockchain Gamer",
        "content": "Having recently looked at the number of discontinued and canned blockchain games – the Big Blockchain Game List has now been crunching data on which blockchains added the most new games during 2023.\n\nThe blockchains that added most new games during 2023 were:\n\nWEMIX with 56 new games,\n\nPolygon with 47 new games and\n\nEthereum with 33 new games.\n\nHowever, taking into account games which were discontinued, or changed blockchain or deployed on additional blockchains, the top growing chains of 2023 in terms of net increase during the year were:\n\nWEMIX with a net increase of 38 games,\n\nArbitrum with net 33 more games,\n\nTON up by 29 games, and\n\nImmutable up 18 games.\n\nThe category with the biggest net growth was Other Chains, up by 59 titles. Indeed, the increase of new blockchains – everything from L1s to L3s – was a key trend in 2023, and not just for gaming but for all blockchain applications.\n\nOf course, it’s also worth looking at which blockchains ended 2023 as being the most popular in terms of most supported games. For example, while Solana and BNB declined by net 30 titles during 2023, nevertheless, both remain in the top five most popular single blockchains for gaming.\n\nThe current breakdown is"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNZG5MVzNNN1RZM0hFeWhnWFQ1dlk0eEpGbkloYWR4czdzdXh4anZ1bC14Yy1OMkZESHZianJRYkNUZGkwbnlmOGlqVk9rdm40dTl5ZDhHc0l5LTFZY2hGMlc4dm11LVdINXJpT0tkNjE2cVZIUVdvOHdQRnlWMW1MekVhdG5lSERMd3VlLUFRYnlFS29aT1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "COTI announces Ethereum Ecosystem Growth Fund to drive privacy - CryptoNewsZ",
        "content": "The COTI Foundation has announced an Ecosystem Growth Fund with a hefty contribution of 400 million COTI tokens. The fund, with an estimated value of $25 million, will provide financial assistance to initiatives that promote the development and effectiveness of the COTI ecosystem.\n\nCOTI has long endeavored to develop a privacy-focused version of Ethereum L2. In addition to other elements, this entails the formation of the COTI Foundation, which is a fundamental component of its objectives and aims to transition the existing framework to a new solution.\n\nThe COTI Ecosystem Fund, which was established to promote the adoption and development of COTI V2, intends to conduct research in collaboration with entrepreneurs and developers. In addition, the development of services within the novel ecosystem will be undertaken.\n\nAdvertisement\n\nShahaf Bar-Geffen, the chief executive officer of COTI, asserts that the COTI Ecosystem Fund represents a favorable progression towards COTI’s evolution into a privacy-focused Ethereum L2. The allocated funds will be utilized for the development of applications within the ecosystem and the acceptability of COTI V2. They are committed to developing additional business connections.\n\nSoda Labs, a frontrunner in the field of cryptographic Multi-Party Computation (MPC), is the first beneficiary of the investment. Soda Labs will lead the charge in researching new uses for garbling protocols, making sure that COTI users have access to a private network that can grow with them.\n\nDr. Avishay Yanai and Dr. Meital Levy, both prominent figures in the cryptographic MPC protocol domain, founded Soda Labs.\n\nAs per Dr. Avishay Yanai, their focus has been on twisted circuits within secure MPC for a considerable period of time. They intend to continue developing the privacy tools necessary for the subsequent iteration of Web3, with the assistance of the COTI Foundation.\n\nAs a result of the funding, COTI transitioned to Ethereum L2, reaffirming its commitment to privacy through the use of twisted circuits. The group’s primary objective is to complete the development of an application that verifies confidential transactions for consumers and ensures adherence to all established regulations.\n\nAdvertisement\n\nCOTI intends to disclose additional activities and the establishment of supplementary associations in the coming months. In addition, they plan to implement a developer grant program."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNRmdseG5GNG5fME0wSnYtam1QdTNRRTZSSXMycDBzNzdLcW45U2E0bXZiVFBDdFFnckxOMVJQU29HYXlVckZKLUJrOVI2M0VzQ3plb0liM1dYTXp0Q3V0SXdXN2R5OWlyeENQU2RsVHBnQVMtUjlxY29RaUR1X3RId1NxUGFPa1hqNUxQYWFOQTRaMTNJcmhWYUx6V05wTnlTTHViNm1zTzk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Staking: MetaMask offers an innovative service with 10% commission - Cointribune EN",
        "content": "Fri 19 Jan 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nMetaMask platform now offers a staking service for Ethereum users who are interested. An appealing offer, but it has received mixed reactions due to the perceived excessive fee structure of the service.\n\nMetaMask offers crypto staking for a 10 % commission\n\nThe crypto wallet provider MetaMask has recently launched its stake validation service. It aims to simplify staking for Ethereum users while addressing concerns about centralization within the staking ecosystem.\n\nThe staking service in question is part of the MetaMask wallet. It allows Ethereum users to participate in the network’s proof of stake consensus mechanism, in exchange for a 10 % fee. This is even without requiring deep technical expertise.\n\nIntroduced on Thursday, January 18, MetaMask’s staking service requires users to deposit a substantial amount of 32 Ether (ETH). This represents an approximate value of 78,752 dollars according to the current market price.\n\nWith this initial investment, participants are freed from the responsibilities associated with the operation and maintenance of their validation nodes. These are managed by MetaMask on behalf of the stakers. A way to promote a secure and efficient operation of the service and to minimize the common challenges they often face.\n\nMetaMask launches Ethereum validator staking service😎#Metamask #EthereumDistribution pic.twitter.com/LvPzXOdTwu — finance ideas (@financeideas89) January 19, 2024 MetaMask launches Ethereum staking service with just a 10% commission\n\nAn offer not so interesting after all?\n\nOne of the main benefits of MetaMask’s staking approach is that it counters centralization issues within the staking ecosystem. Many users hesitate to rely on liquid staking providers like Lido, fearing that such a concentration of power might compromise the network’s decentralization.\n\nYet, even though the staking offer seems appealing, some consider it unprofitable due to the proposed pricing structure. MetaMask takes a 10 % fee on staking rewards. For Lefteris Karapetsas, founder of Rotkiapp, this is unattractive compared to other available options.\n\nThe expert particularly thinks of Lido, which stands out as a dominant player in the staking market with 9.3 million ETH staked on its platform. This represents about 40 % of the 28.8 million ETH staked on the Ethereum network. Indicating significant interest in participating in the network’s consensus mechanism.\n\nAlthough centralized exchanges like Coinbase also offer the option to stake on Ethereum, they charge significant fees of 25 % on staking rewards. This can deter users seeking more profitable and decentralized alternatives. In fact, MetaMask presents itself as a viable option, especially for users who prioritize accessibility, decentralization, and a proven experience in Ethereum staking.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQT2o0T0xWVEZYX3RRbkp0VTVFVFdHVElobHVaMzZGYmR0b1dTZ0tOY0hWdFV4a01yVXFLY1BNRDhnbFU3S2s4Yy1zaHhiX0R3RHBMLVpSVmJjRGZ3RG4xdnpsaWFYQ0laZFNPa1Z4RHd3WmtzWHJjNVB6Q3FwWGVTc1ZFVDN6MkZYTFFKSFY1TmdhQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Manta airdrop faces backlash after rare NFTs fall by 87% - DLNews",
        "content": "Manta Network has concluded its token airdrop.\n\nMany of those who participated in the airdrop leveled harsh criticism against Manta in the aftermath.\n\nRare NFTs, which previously traded for over $1,000, yielded just $132 worth of MANTA tokens.\n\nParticipants of Manta Network’s airdrop are feeling shortchanged after receiving far fewer tokens than they expected.\n\nThose who took up Manta’s offer to lock their funds on its Ethereum layer 2 blockchain found out that in many cases, the value of their rewards didn’t even cover their transaction costs.\n\nOther hopeful airdrop hunters spent thousands of dollars collecting Manta NFTs to boost their airdrop. But when Manta revealed how many tokens each NFT was worth, it became clear the market had hugely overvalued them.\n\n“People had too high expectations,” CC2, a pseudonymous trader known for his serial airdrop farming, told DL News. “People gobbled up the more expensive NFTs, expecting a massive payout, and that’s where the disappointment stems from.”\n\nThe episode highlights how promising airdrops of valuable tokens to users is a delicate balancing act for crypto projects.\n\nMany of those who participated in Manta’s airdrop blame the project for creating a complex airdrop system which they say was designed to lure users into locking up their funds with the promise of valuable tokens.\n\nDozens of airdrop participants took to Manta’s X post to complain about the airdrop. Quips such as “the worst airdrop ever,” littered the comments.\n\nBut others say the fault lies with overzealous airdrop hunters piling into Manta without considering the downsides of doing so.\n\nJoin the community to get our latest stories and updates\n\nManta Network declined to comment on this story.\n\nManta’s ‘complex’ airdrop\n\nParticipants of Manta’s airdrop could earn tokens in multiple different ways, such as contributing to the network’s Polkadot parachain or completing the project’s Galxe campaigns.\n\nBut on December 14, Manta introduced a way to earn points — a popular idea which typically hints that a project is preparing for an airdrop.\n\nTo earn points, users needed to bridge funds to Manta’s Ethereum layer 2 blockchain, Manta Pacific, where they would receive equivalent tokens that represented their bridged funds.\n\nThe more users bridged, the more points they would receive — but there was a catch. The equivalent tokens could not be bridged back.\n\nFor every 25 points users accumulated they were rewarded with a treasure chest that could contain an NFT of one of six rarities. These NFTs could be bought and sold on the secondary market. Manta told users that collecting NFTs would make users eligible for an additional 20 million token airdrop.\n\n“It was not clear how much the six rarities buckets would get individually, so it was difficult to price them,” USD Denominated, a pseudonymous crypto researcher who took part in Manta’s airdrop, told DL News.\n\nIn the end, Manta allocated most tokens to those who owned the more common lowest rarity NFTs, USD Denominated said.\n\nThe highest rarity NFTs, which previously traded hands for over $1,000 each, only yielded 60 Manta tokens, worth approximately $132.\n\n“The whole thing was quite complex, the rules were vague and new rules were introduced along the way, leading speculators to get burned on multiple occasions before the coin even launched,” USD Denominated said.\n\nDL News asked Manta if it was concerned that its points system had created false expectations among its community. Manta declined to comment.\n\n‘Manta are farming users’\n\nManta revealed how many tokens each airdrop participant was set to receive on January 17. The backlash from Manta’s community was severe.\n\n“It seems that new protocols like Manta are farming users more than the community is getting rewarded,” Zac Duggan, a Manta user who participated in the airdrop, told DL News.\n\nDuggan said he bridged over one Ether, currently worth around $2,500, to Manta Pacific, paying $40 in transaction fees to do so. He said he received only 13 MANTA tokens, worth around $28, for his effort.\n\nTerry Junior, another user who bridged just over $5,000 worth of tokens, told DL News he was also unhappy with his 13 MANTA token reward.\n\nThe reason many airdrop participants received so few tokens is because they bridged funds very close to the closing date of the airdrop, leaving little time to accumulate points.\n\nManta told users that bridged funds would be locked until March. Many assumed that they would be able to accumulate points up until then.\n\n“They could have simply warned people not to deposit because they knew the closing date,” Junior said.\n\nAccumulating deposits\n\nManta is not the only crypto project that promised an airdrop to those who lock up their funds.\n\nBlast, another Ethereum layer 2 backed by crypto venture firm Paradigm, launched a similar airdrop system back in November. So far, airdrop hunters have deposited over $1.3 billion to Blast.\n\nThe value of user deposits to Blast.\n\nBefore Manta announced its airdrop, it had taken in over $847 million worth of deposits.\n\nProjects often point to their deposits as a gauge of their success. Others are hoping that by encouraging users to bridge over their funds early they can bootstrap an active DeFi ecosystem.\n\nDespite their success in attracting deposits, such systems have received backlash from the crypto community.\n\nParadigm’s head of research Dan Robinson has previously said that the decision to not to allow withdrawals “sets a bad precedent.”\n\nAccording to USD Denominated, projects conducting such airdrops only have one objective: getting as many people to deposit as possible.\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Reach out with tips at tim@dlnews.com."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMigAJBVV95cUxOdHB3MG1wRUk1ZVdGS2hZNTF0NzdEUnhHUHpIYUR5aERwNFdCMWJYVWNtbUlydXU4RjdIZDNNdVhTd3c0ZUdXZnhFeW5fMkdvSG4yQlFQWTl2T25HSVJZbW5VU25LLXhpZGdXWktOR0ltRlp3OHpsTkRfNl9HcmZLUlpsV1lUWnVxTDVCTXUxT2lNRHR0UndqaUNySXdGd2JUcTZickMwMFRrb3BhbGpmVVYyNFNwcUo5RWE4dHd4NHkzcTZraU5EaFphUG5QLTZYdkloVXdrNm9BOHNhekp6bDdZb0kxWjFvYlZJVUlwSkVoa1paajJRUF80c2Yxa3pS0gGGAkFVX3lxTE1OMkNlQ05RYmlULWFnOGRNdV9QX3RrRGFNWTE2a3h2WlN5ZFY5ZTFhZXRuTFZtcjJqV0hieGpxbjJrckdNQ3RpdzdXNGR1SFpfWkIzVTVxOWJ4U2hZSk1GTXNYZjZodkJOUVRiT0JmdTdPNDlmSTJ3VF9oRmFoOUdta016VWhoeHJRV3NMYzRSZXhYSVhaalNiUExzbURSczdiTUYwb3R2VWpkTFBsd3ZXMkUyaXMtV05HZVVqTHY4eFdqMGxubUVoNk9EcmZWekdKTkpkVV81SXZfRnNYUHVfZjJQRG9wR1Z0RW9GdEdGMmFma3ROUElvLTUwcHVmQ1VwRmpQcVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Dips Below $42,000, Helium Becomes Biggest Loser - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, slipped below the $42,000 mark early Friday, marking the overall market’s first notable dip since December 2023. Other top coins — including the likes of Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — landed in the reds across the boarrd. The Conflux (CFX) token emerged to be the biggest gainer of the lot, with a 24-hour jump of less than 1 percent. Helium (HNT) became the biggest loser, with a 24-hour dip of over 13 percent.\n\nThe global crypto market cap stood at $1.62 trillion at the time of writing, registering a 24-hour loss of 3.23 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $41,073.88, registering a 24-hour dip of 3.61 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 35.80 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,458.72, marking a 24-hour dip of 2.69 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.15 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour loss of 3.37 percent, as per CoinMarketCap data, currently priced at $0.0776. As per WazirX, Dogecoin price in India stood at Rs 6.80.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour dip of 1.20 percent. At the time of writing, it was trading at $68.42. LTC price in India stood at Rs 5,916.56.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5503, seeing a 24-hour loss of 2.91 percent. As per WazirX, Ripple price stood at Rs 48.38.\n\nSolana (SOL) Price Today\n\nSolana price stood at $93.69, marking a 24-hour dip of 6.20 percent. As per WazirX, SOL price in India stood at Rs 8,202.62.\n\nTop Crypto Gainers Today (January 19)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nConflux (CFX)\n\nPrice: $0.1976\n\n24-hour gain: 0.71 percent\n\nBNB (BNB)\n\nPrice: $311.46\n\n24-hour gain: 0.69 percent\n\nAstar (ASTR)\n\nPrice: $0.1677\n\n24-hour gain: 0.62 percent\n\nBitget Token (BGB)\n\nPrice: $0.6059\n\n24-hour gain: 0.42 percent\n\nTop Crypto Losers Today (January 19)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nHelium (HNT)\n\nPrice: $6.56\n\n24-hour loss: 13.49 percent\n\nSui (SUI)\n\nPrice: $1.13\n\n24-hour loss: 12.48 percent\n\nEthereum Name Service (ENS)\n\nPrice: $20.03\n\n24-hour loss: 10.52 percent\n\nChiliz (CHZ)\n\nPrice: $0.09134\n\n24-hour loss: 10.33 percent\n\nBeam (BEAM)\n\nPrice: $0.01865\n\n24-hour loss: 9.82 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin has experienced a drop to $41,000, marking its first descent since December, propelled by increased liquidations and a strong US dollar. Traders are actively scouting for opportunities to accumulate positions below the $40,000 threshold. Despite the relatively low market volume, BTC continues to trade above $42,000, showcasing an impressive 96% year-to-date gain. The market could see some volatility as bears seek to exert dominance. However, if BTC can close above $43,700 resistance over the weekend we may see an uptrend.”\n\nParth Chaturvedi, Investments Lead, CoinSwitch Ventures, noted, “BTC (-3.7%) underwent ‘Sell the news’ pressure related to investor activity around the spot ETF approvals, leading to its lowest price in a month. We can expect some volatility in BTC’s price for some time. However, the ETF inflows and Assets under Management (AUM) continue to see healthy numbers. The newly launched spot BTC ETFs already have nearly $30 billion in AUM as compared to $11 billion for Silver ETFs. In another instance, BlackRock's Spot BTC ETF hit the $1 billion AUM, becoming the first of the recent group of BTC ETF providers to hit this milestone.”\n\nRajagopal Menon, Vice President, WazirX, said, “The global crypto market finds itself delicately balanced on a crucial support level, teetering between the prospect of a surge beyond $2 trillion and the looming risk of a significant downturn. The stakes are high, with the overall market cap hanging in the balance. Bitcoin faces a challenging scenario as its support is tentatively placed at $37,000, offering a less-than-optimistic outlook. Notably, market dynamics have witnessed an unexpected twist with a 'sell the news' frenzy surrounding the Exchange-Traded Fund (ETF) launch, catching many off guard. The last 24 hours have seen a marginal decrease of -0.04% in Bitcoin dominance, signalling the potential commencement of the altseason.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Despite a 3.76% drop in the overall crypto market, Bitcoin (BTC) is holding steady around $40,900, supported by the newly approved Bitcoin Spot ETF generating interest from investors. Ethereum (ETH) follows a similar trend, with analysts monitoring its performance. JPMorgan Chase CEO Jamie Dimon's recent criticism of bitcoin as \"worthless\" has created near-term uncertainty and weighed on market sentiment. The broader outlook remains cautiously optimistic, pending an expected Federal Reserve interest rate cut in March and Bitcoin's halving in April 2024. BTC, at $42,620, faces resistance at $43,288, while ETH, trading at $2,458, it is tracking resistance at $2,604. Both cryptocurrencies are showing consolidation and market participants are waiting for a potential breakout of resistance levels.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The crypto market is witnessing an unexpected downward trend as Bitcoin faces selling pressure due to heavy outflows from Exchange Traded Products (ETPs) to new spot ETF issuers. For example, Blackrock’s Bitcoin ETF has accumulated $1 billion worth of Bitcoin in just one week, which means there is a heavy outflow of Bitcoin to such regulated ETFs. We can expect the Bitcoin price to rise once this transition cools down and investors are done with profit booking.”\n\nCoinDCX Research Team told ABP Live, “From a technical standpoint, BTC faces a critical challenge in maintaining the current support at $41,000. A breach below this level might signal a bearish sentiment, while a successful hold could pave the way for a continuation of a new higher high. As for ETH, it remains positioned above the 20 EMA D. To sustain a positive trajectory, ETH needs to stay above $2,400, as dropping below this level could introduce a bearish turn.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMihAJBVV95cUxOamJhQmNNUWt4c2pJNHU1bnl5NTBXOGdIX0M2VXVGWnc3aUd5OVBscm1TdG90ZHZyakhua0NkVTdNQkFCSWhtZ29NUDl1SlRUd09OTlZzY2JjTWJHazZDbEVKX0x6bTFTR0p2UVhOeEI5SUVOYUFXRzJ3UGxkbkI3a243Wk1qY1J2Wm1JYzQ2Q3pyclc3X2Z2VUVwMjdONzNnY0lDRFNMRFJKYXZMbUZlZG5KSTE2WWJmZ2NaeHI0R20yMzRFejExSTg4UURJSXljRVo5RHdmS3hJV3ZkcUZwZXViRllYSjZ3elJCVTZSc0VQSHNVR2tJa1RMcXBYY25uNThsQtIBigJBVV95cUxNa1RtSXBVc0VzMzBROW9WYUl4ODR3RkJnSnJvM2Jxb3BpNHRVR01zQjM1QU5UeTZ0YVJBYV9jM2JsdzBGQ1ZVdnlxVUd2cVhORkN0b2EwcGFHVzlrMThVMHM2bzVZajdxWFotekQ1cHNuQmZiWTZUVDVCNWxCS3BKQm5meXdIRmhIOFVQdU54NTFGYTJYcDFFaUxBRlBicVFpdldyc3k4LUhndlg0VmRuMjVvRndHM2tBZG9pXzdzRTBqaVFrYTQ0VzU1MnpOVWV6VmtHdnRmMGRZMlVtNnNWOXVBT296S2t2NkZfVkRfNjFVbjZvWndHTHBJdTEzY2k1dGJrSUdGa2hRQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Remains Within $42,000 Range, ETHDYDX Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, managed to remain stable within the $42,000 range on Thursday. Other top coins — including the likes of Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — saw minor losses across the board. The ETHDYDX token emerged to be the biggest gainer of the lot, with a 24-hour jump of over 6 percent. THORChain (RUNE) became the biggest loser, with a 24-hour dip of over 10 percent.\n\nThe global crypto market cap stood at $1.68 trillion at the time of writing, registering a 24-hour loss of 1.20 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $42,594.04, registering a 24-hour dip of 0.68 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 37.30 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,529.24, marking a 24-hour dip of 1.70 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.21 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour loss of 1.31 percent, as per CoinMarketCap data, currently priced at $0.08018. As per WazirX, Dogecoin price in India stood at Rs 7.01.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour dip of 0.31 percent. At the time of writing, it was trading at $69.20. LTC price in India stood at Rs 6,049.49.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5659, seeing a 24-hour loss of 1.50 percent. As per WazirX, Ripple price stood at Rs 49.51.\n\nSolana (SOL) Price Today\n\nSolana price stood at $99.81, marking a 24-hour dip of 0.13 percent. As per WazirX, SOL price in India stood at Rs 8,664.62.\n\nTop Crypto Gainers Today (January 18)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\ndYdX (ETHDYDX)\n\nPrice: $3.10\n\n24-hour gain: 6.47 percent\n\nFlare (FLR)\n\nPrice: $0.02187\n\n24-hour gain: 5.85 percent\n\nRender (RNDR)\n\nPrice: $4.22\n\n24-hour gain: 2.55 percent\n\nHelium (HNT)\n\nPrice: $7.65\n\n24-hour gain: 2.14 percent\n\nSei (SEI)\n\nPrice: $0.7965\n\n24-hour gain: 1.67 percent\n\nTop Crypto Losers Today (January 18)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nTHORChain (RUNE)\n\nPrice: $4.25\n\n24-hour loss: 10.56 percent\n\nBeam (BEAM)\n\nPrice: $0.02062\n\n24-hour loss: 9.76 percent\n\nBonk (BONK)\n\nPrice: $0.00001289\n\n24-hour loss: 8.69 percent\n\nLido DAO (LDO)\n\nPrice: $3.13\n\n24-hour loss: 8.06 percent\n\nArbitrum (ARB)\n\nPrice: $1.96\n\n24-hour loss: 7.69 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin consolidates at $42,000, marked by profit booking and increased investor interest following spot ETF approval. Bears are currently active at $43,500. BTC's resistance stands at $43,250, with support at $42,120. Simultaneously, Ethereum developers deploy the Dencun upgrade on the Goerli testnet, and Ethereum is trading at $2,500.”\n\nCoinSwitch Markets Desk noted, “With BTC (-0.8%) consolidating in a tight range for a fifth day straight post the ETF development, altcoins have started to show weakness. With Ethereum (ETH, -1.8%) going up in the last few days, even ARB (-7.8%) and LDO (-8.9%) which were among the top gainers, have posted losses in the last 24 hours. On the regulatory front, Thailand is now getting its own version of Binance exchange as Binance and Gulf Innova joined hands to launch Binance Thailand, providing a more secured and regulated way of trading digital assets for the country. BNB (-2.3%) was unfazed by this move, however.”\n\nRajagopal Menon, Vice President, WazirX, said, “The US inflation data is falling back, and labour market indicators are in a position to enable the Fed to start slashing interest rates soon. This has been a cause of hope among market analysts who predict a favourable run for Crypto in the months following the rate cut, most likely in March. Liquidity issues in the market will also be reduced significantly due to this. Bitcoin’s price has mostly remained flat since ETF approval with a further decline in the last 24 hours as the market continues to get accustomed to funds related to Bitcoin.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin is witnessing a significant selloff as miners released a substantial 10,600 BTC (over $455.8 million) in the last 24 hours. On-chain analytics from CryptoQuant indicates a 130.45% increase in the crypto exchange's net flow, indicating active selling by miners. However, the decline in exchangeable bitcoin reserves suggests lower selling pressure as investors move assets out of exchanges. Despite recent swings, Bitcoin, currently supported between $41,000 and $43,000, maintains positive momentum. Experts are predicting that Bitcoin will soon cross $45,000 as they anticipate a halving event in April 2024, lower block rewards and boosted by the SEC's approval of a spot Bitcoin ETF. The network's robustness is evident in a saturated mempool that reflects organic growth.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The overall crypto market is at $1,68 trillion with Bitcoin and Ether witnessing marginal fluctuation from the previous day. If Bitcoin closes above $43,000 this week, then we may witness a healthy surge in its price in the coming weeks. The Bitcoin ETF inflows are nearing the $1 billion mark, which according to the experts, qualifies for a successful listing. We can expect a less volatile Bitcoin after the listing of ETFs as it’s a regulated financial product now.”\n\nCoinDCX Research Team told ABP Live, “From a technical perspective, there's a notable bullish indicator with the 50-week simple moving average (SMA) crossing above the 200-week SMA, a first in recorded history. However, upon closer examination, the previous weekly close appears bearish, contributing to mixed signals. Crucially, the $40,000-$41,000 range serves as a significant support level for BTC. ETH, meanwhile, has maintained its position above $2,500. The focus now lies on targets at $2,660 (local resistance) and $2,940.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMimgJBVV95cUxNaHdkbW54aFVaMl93ZEk0TER3MGhDUkZtbTZmcUIwOGtqVHVMazVwamdoMjgzdHAxVFFqLS1NNk9iT2pFZzlPeTJ2TUdmUFZ6QVlzdGdEOExHMHRPVEktN2lZM3ZXSmJZdFJUWU9jem9WSlhEX1o2NG1qUWlwY1pLYllGVjJaRlhTNkh0UjdFRHI3V3kybm5uZU1GZTZUeWFQaXhvcnVTZGwwLXdlVjhUTlYzcnVnMkpyVDNSWXRJU2pvWmw0bHl2X3FmZkcybzRhNG1nMXMwZmJCUGZLYlRTZEJhZERQVVJvTHZvUnhwTGdzdVJwMjNFLXdZbEdpZlBPRkpTaGxTV3BDREppUDluVXhRNjlVM0ZicmfSAacCQVVfeXFMT2VUZEYxLUI1aGhUSXVYQ2MxZ2N3X0FqN1drTkMyRjNVbC0zN29SVXlmZ2I3dEV0dk1VM0hJQ2kzenM5Ry00RzNhVVRMNXgwaTkyVTFQSmx4NEliUmQ5SHRLZTl3ZkYzRDZrMkUyWG9RdUpGN1A2b1JtTWxPYUI5eW9JVTBJRjE4UWtLMnpaM3NZWnBZa1Zsckh1MmZ0OHNnSXRyOWlFZ2o3XzZSdFFUcVdZZXJUT1JpOTdWbXBBMHc0YTJrR1c0TElURi1WS3puUW1hUDU0OVA3dEtCT0lIeUpESnJOVjJsdk1fakxtMVhCR3JUeFFnbm1XejBweS1jbGg0OF9jLXFfQUpONnEyUW83aVczczRMY1VhZ2lQdng5ZGJsb3pRTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "The Best Altcoins To Buy In January 2024: The Ultimate Crypto Guide Featuring ApeMax, Celestia, Sui, Injective, Ethereum, and Lido - Analytics Insight",
        "content": "ApeMax is a rising altcoin, capturing attention for its innovation and growing community, with over 9,000 token holders and 9.3 billion tokens sold. The introduction of the revolutionary \"Boost-to-Earn\" staking feature is what sets ApeMax apart from other meme coins. This unique staking mechanism allows ApeMax token holders to earn rewards by staking their tokens to boost their preferred entities."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE1QTWxFd2g0VWZkeFg0NmRUSnpJMUduRGhLYlF6Z29GaHhBanEzOUZMTnBiYnZiRlhtdnFmbHlJSzhLM2s4ODdNS2xvam9PdXhOdnZPU1hPSUpnNnh2WXhNLURoMDNJTFdP0gFsQVVfeXFMUE1iZ2NLY0VYR0g3ajVlVHYxY29Bd3B2bUN1Zlh5QWczaXlDWWlKaHZXbElFTW5FajVxWFVyWU1Damo2S2l1bjVJMi0zczhFcHpiZ0ZFM0RrN01mVGFyYTBhYjhBZWVvRGFOWXBF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "5 Best Ethereum Mining Apps for Android in 2024 - CoinCodex",
        "content": "We’ve analyzed multiple Ethereum mining apps for Android to help you understand why using them probably isn’t the best idea and why any app claiming to offer “Ethereum mining” is misleading.\n\nHowever, we don’t want to leave you empty handed, so we’ll also be featuring 5 Ethereum apps for Android that will enable you to earn ETH passively through staking.\n\nAre Ethereum mining apps for Android legit?\n\nThe short answer is no. The Ethereum cryptocurrency is secured through staking, and not mining. This has been the case since September of 2022, when an upgrade called The Merge removed the network’s old Proof-of-Work consensus mechanism and introduced a new Proof-of-Stake consensus mechanism.\n\nEven if Ethereum still used mining, no mobile phone on the market today would be powerful enough to mine it profitably.\n\nTherefore, any app that claims to provide Ethereum mining services is misleading at best and an outright scam at worst.\n\nWe were able to find 5 apps on the Google Play store that claim to be providing Ethereum mining or Ethereum cloud mining services. While the majority of these apps have a solid rating of 4 stars or more on the surface, a closer look at the reviews makes it obvious that the majority of 5-star reviews are not genuine. Meanwhile, there are a lot of genuine reviews with a 1-star rating that suggest the apps are not actually mining Ethereum. In some cases, the apps are even trying to convince users to buy another product.\n\nFor example, there are a lot of complaints from users saying that the app requires them to purchase a particular cryptocurrency wallet app before they can withdraw the ETH rewards they have supposedly earned.\n\nIf someone is asking you to pay to use a cryptocurrency wallet, that is a major red flag — legitimate cryptocurrency wallets, even those offering the most advanced features, can be downloaded for free. In fact, we haven’t been able to find a single legitimate cryptocurrency wallet that is not completely free to use (apart from the fees blockchain networks charge for transactions).\n\nBest Android apps for earning Ethereum rewards\n\nThe bottom line is that you should avoid all apps that claim to be offering Ethereum mining. However, there are apps that will allow you to earn ETH passively, by giving you access to Ethereum staking. Please keep in mind that you’ll need to already own some ETH if you want to earn additional ETH through staking.\n\nBinance - The world's top crypto exchange has an Ethereum staking feature\n\n- The world's top crypto exchange has an Ethereum staking feature Kraken - A rock-solid crypto exchange that allows users to earn ETH staking rewards\n\n- A rock-solid crypto exchange that allows users to earn ETH staking rewards Coinbase - Beginner-friendly crypto exchange with Ethereum staking feature\n\n- Beginner-friendly crypto exchange with Ethereum staking feature MetaMask - The best Ethereum wallet overall\n\n- The best Ethereum wallet overall Trust Wallet - A versatile crypto wallet that you can use to stake ETH and earn rewards\n\n1. Binance - The world's top crypto exchange has an Ethereum staking feature\n\nBinance is a leading cryptocurrency exchange that lists hundreds of different crypto assets and provides a diverse suite of services for crypto investors. This also includes Ethereum staking — if you have ETH, you can stake it on Binance to passively earn rewards.\n\nIf you stake ETH through Binance, you will receive WBETH tokens, which represent your staked ETH. The conversion rate between WBETH and ETH gradually increases in favor of WBETH through the time to reflect the rewards earned by the ETH Binance is staking on behalf of its users.\n\nIf you wish to get your ETH back, you can simply redeem your WBETH tokens and receive ETH in return. The amount of ETH you can earn this way is determined by the size of your stake (bigger is better) and the duration of your stake (longer is better).\n\nEarn ETH on Binance\n\n2. Kraken Pro - A rock-solid crypto exchange that allows users to earn ETH staking rewards\n\nKraken is a cryptocurrency exchange that has been operating for more than a decade and has built a strong reputation for keeping its users’ fund safe even though many other exchanges have lost their customers’ fund to hacks.\n\nIf you have ETH, you can stake it via the Kraken Pro app to benefit from staking rewards. Unlike Binance, which uses a token to represent staked ETH, the process on Kraken is more straightforward as there is no such token involved. However, the downside of Kraken’s approach is that users can’t get any liquidity from their staked ETH unless they unstake their coins.\n\nEarn ETH on Kraken\n\n3. Coinbase - Beginner-friendly crypto exchange with Ethereum staking feature\n\nCoinbase is a reputable crypto exchange that’s known as one of the best crypto platforms for beginners. Coinbase provides an Ethereum staking service which allows ETH holders to earn additional rewards on their coins passively.\n\nUsers on Coinbase have the option to wrap their staked ETH coins and receive cbETH tokens. These tokens can be redeemed (or “unwrapped”) for ETH, but can be useful to still access the liquidity associated with your staked ETH.\n\nIf you’re a long-term ETH holder that wants to put your idle coins to work, staking through Coinbase is certainly an option worth considering.\n\nEarn ETH on Coinbase\n\n4. MetaMask - The best Ethereum wallet overall\n\nThe previous ETH staking options we’ve covered in this article are all facilitated through centralized cryptocurrency exchanges which stake users’ ETH on their behalf. Now, let’s take a look at some options to stake Ethereum in a more decentralized manner using on-chain liquid staking protocols.\n\nLet’s begin with MetaMask, an extremely popular Ethereum wallet that also offers an Android app version. MetaMask offers a convenient staking option within the MetaMask portfolio feature that allows users to easily stake their ETH through liquid staking protocols such as Lido and Rocket Pool.\n\nThe added benefit of using MetaMask instead of a cryptocurrency exchange is that you remain in control of your private keys and don’t have to trust anyone but yourself to keep them safe.\n\nGet MetaMask\n\n5. Trust Wallet - A versatile crypto wallet that you can use to stake ETH and earn rewards\n\nTrust Wallet is a very popular all-purpose crypto wallet that is available both as a browser extension or as a standalone desktop application.\n\nOne of Trust Wallet’s biggest strengths is that it supports a truly impressive selection of cryptocurrencies, as it’s not just limited to EVM-compatible blockchains. You can also use Trust Wallet to store Bitcoin, XRP, Solana and many other popular cryptocurrencies.\n\nTrust Wallet has a user-friendly interface designed to cater to both beginners and experienced users. Navigating the wallet is easy, allowing users to seamlessly view their portfolio value in their preferred currency, monitor their transaction history, and effectively manage multiple wallets.\n\nYou can use Trust Wallet to securely hold your ETH and use it in liquid staking protocols to earn staking rewards. Just like MetaMask, Trust Wallet is also a non-custodial wallet, which means that you control your own private keys.\n\nGet Trust Wallet\n\nThe bottom line\n\nHopefully, this article helped explain why there are no legitimate Ethereum mining apps available on the market. However, there are still ways to earn ETH using an Android app. For example, you can stake your ETH coins through a cryptocurrency exchange app or use an Ethereum wallet app to stake your coins via protocols such as Lido and Rocket Pool.\n\nIf you want to learn more on the topic of earning crypto with your phone, make sure to take a look at our list of the best crypto mining apps for Android."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9TVm1jcXNSTjZ5QThxOWdOcXlNLU42S25fVWtYMnZ4emxkOG03aVZXN2tRUHB5Wl9SRjluY0FIQjhkVTIwbFNZNGxQOE9zYi1uWXp4cldQRldlZmVWUG1ZMUMwTV9icnhNazdFRlRjZGQzS3JXMm9wT1RXd9IBf0FVX3lxTFBXTmhpbzRvY1NKU3BmZXAtY3AxMThXbEZRd2NlN1M3TUxMeHlqNDlFa2syaE1YUzBackg1S094d09jZHh0R2tUWklkTjZWd1E2WEVxNXRmdXhLaldzVEZSQTd1cWRha3lwXzJGOHhqdEQ1Zk53MzdVb0RHY3JSWXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "What Is the Best Day of the Week to Buy Crypto? Historical Market Data Analysis - CoinCodex",
        "content": "According to our exhaustive analysis of historical crypto market data, the best day of the week to buy crypto is Sunday, with cryptocurrencies gaining 0.75% on average on each final day of the week. The second best day is Saturday, boasting an average increase in the value of crypto assets of 0.56%.\n\nIf you are involved in crypto trading, you’ve probably observed or heard about certain market patterns, such as, for instance, the repetitive debate over whether crypto usually goes up or down on weekends. But is there any truth to those claims, or are we just wired in a way to see patterns where there aren’t necessarily any?\n\nFor the purposes of this report, we analyzed trading data dating back to January 2016. Bitcoin and Ethereum were analyzed separately, whereas we settled on the total crypto market cap as an indicator of general crypto performance. It might not be the most optimal metric, but it does capture market trends beyond BTC and ETH effectively.\n\nIn this article, we are going to showcase our findings on what is the best day to buy Bitcoin, Ethereum, and other cryptos, what is the best month to buy crypto assets, and what time of the week is best to sell crypto. Armed with these findings and our weekly updated list of the best cryptocurrencies to buy, you'll hopefully be able to make better investment decisions going forward.\n\nKey highlights: When talking about the best days and months to buy Bitcoin and other crypto assets, we focused on highlighting the best-performing days and months. Technically speaking, you could try to time your trading activity to string together a number of historically positive days/months, which could be more profitable over the long run.\n\nSunday and Saturday are the best days to buy crypto, with average gains of 0.75% and 0.56%, respectively, outperforming weekdays.\n\nMay emerges as the most profitable month to invest in crypto, historically showing a 19.45% market increase, while October is the least favorable.\n\nThe ideal time to purchase cryptocurrency is during the late hours of Friday or early hours of high-performing days, leveraging the weekly performance trends.\n\nDespite minor differences in daily and monthly crypto market trends, these patterns offer valuable insights for optimizing investment strategies.\n\nWhat is the best day of the week to buy crypto?\n\nThe best day of the week to buy crypto is Sunday, which has been showing strong gains across the board – since January 2016, the total cryptocurrency market cap increased by an average of 0.745% on Sunday, with Bitcoin gaining 0.028% and Ethereum 0.256% on the final day of the week.\n\nInterestingly, crypto assets have been showing stronger performance during weekends than on weekdays, with crypto as a whole performing the worst on Fridays.\n\nBitcoin Ethereum Tot. crypto market cap Monday 0.323% 0.547% 0.144% Tuesday 0.355% 0.276% 0.268% Wednesday 0.239% 0.584% 0.301% Thursday 0.153% 0.365% 0.183% Friday -0.038% 0.006% -0.008% Saturday 0.364% 0.529% 0.561% Sunday 0.028% 0.256% 0.745%\n\n*Average daily value changes since Jan. 1st, 2016.\n\nWhat is the best day to buy Bitcoin?\n\nOver the years, Saturday has emerged as the best day of the week to buy Bitcoin, with the coin gaining 0.364% on average on that day. According to historical data, Tuesday is the second-best day to buy Bitcoin due to an average increase of 0.360%. Friday is the only day of the week that Bitcoin has shown negative growth over the years.\n\nInterestingly, out of the 50 biggest single-day spikes in the last 7 years, 10 occurred on Thursday, 9 each on Tuesday and Wednesday, 7 each on Monday and Saturday, 5 on Friday, and only 2 on Sunday.\n\nWhat is the best day to buy Ethereum?\n\nThe best day to buy Ethereum is Wednesday, with the currency showing 0.584% average gains. Monday is a close second, thanks to an average daily increase of 0.547%. Similar to Bitcoin and the rest of the crypto market, Friday is the only day of the week that is showing negative gains for Ethereum.\n\nWhat is the best time to buy crypto?\n\nGenerally speaking, the best time of day to buy crypto is in the late hours on the day that crypto performs the worst, or in the early hours on days when it performs well.\n\nData shows that the best time to buy cryptocurrency is in the late hours of Friday (speaking for the UTC time zone). The reason for this is simple – digital assets perform the worst on Fridays and usually gain steam over the weekend.\n\nWhat day of the week is best to sell crypto?\n\nJudging from the CoinCodex historical crypto market data, the best day of the week to sell crypto is late Thursday/early Friday, as most crypto assets lose their value just before the end of the work week. You could also approach things from a different perspective and look to sell crypto toward the end of the most profitable days, such as on Saturday and Sunday.\n\nWhat is the best month to buy crypto?\n\nThe best month to buy crypto is May, and it is not particularly close – historically speaking, the crypto market increased by 19.45% during the 5th month of the year. Conversely, the worst month for the crypto market as a whole was October, which saw the total market cap decrease by -5.77% on average.\n\nBitcoin Ethereum Tot. crypto market cap January 10.21% 8.54% 15.10% February 2.08% 39.28% 4.45% March 13.54% 38.05% 12.91% April -2.34% 31.40% 1.35% May 14.67% 26.12% 19.46% June 10.29% 34.29% 17.63% July 0.73% -8.08% -1.09% August 9.98% 8.84% 7.92% September 5.69% 9.90% 9.25% October -4.31% -9.81% -5.77% November 21.17% 5.15% 14.40% December 4.59% 3.80% 7.67%\n\n*Average monthly value changes since Jan. 2016.\n\nWhat is the best month to buy Bitcoin?\n\nThe best month to buy Bitcoin is November, which has historically seen BTC gain 21.17% during the month. On the other hand of the spectrum is October, which is the worst month for Bitcoin, with an average monthly negative growth of -4.31%.\n\nWhat is the best month to buy Ethereum?\n\nWith an average gain of 39.28% over the past 7 years, February is the best month for Ethereum, followed by March and June, with more than 30% price increases. Interestingly, our price prediction algorithm forecasts a repeat of this trend in early 2024, with Ethereum potentially gaining close to 40% in the spring of 2024.\n\nFinally, like Bitcoin and the rest of the crypto market, October has historically been the worst month for Ethereum’s price.\n\nWhat is the best year to buy crypto?\n\nThe question might not make sense at first, but the crypto market has historically been operating on a very clear 4-year cycle controlled primarily by Bitcoin halvings, preprogrammed events that halve the reward each miner receives upon creating a new Bitcoin block. The next halving is slated for April 2024 and will reduce rewards from 6.25 BTC to 3.125 BTC.\n\nHistorically, the price of Bitcoin (and other cryptocurrencies) has been closely related to the halving cycle – about one to two years after each halving, the price of Bitcoin reached a new ATH ($1,170 in 2013, $19,400 in 2017, $67,770 in 2021). Going from historical data, the best years to buy crypto are the years when Bitcoin halving takes place, as they have always been followed by market rallies.\n\nThe bottom line: There are relatively minor differences between various days of the week, but they are not irrelevant\n\nThe differences between buying crypto between different days of the week and even months are relatively minor. However, that doesn’t mean that there aren’t clear long-term trends that crypto traders can leverage to enhance their trading strategy and optimize times to buy. At the end of the day, the data shows that most days represent good opportunities to invest in crypto, with only Friday standing out as the day when most crypto assets lose value."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQaHBoNjF3Wlh3RTZoR1JlSllsYmFTa09HTlM3WnJJQy1ZckJhenRiblEtem1YamNpbmhqUXpjNGVMcHhRV2ZJVTZpVmNCQWJMYW1SQ1pXWC1zLUVQQXR4TlZnQ1JoVEc3YmVmNjVxSVlYcFJkd2RLeDNER1hESEQycnZtN09RaE1oSDl5X0VkaGRqblBndS0tcVdraXA3RGdYZzlDWllxdmhDRVphLXluS2dkRW1EYTRuV2Jua3BR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Serious Allegations: On-Chain Forensic Analyst Links Ethereum Foundation to 2016 Gatecoin Hack - Crypto Economy",
        "content": "In a detailed thread on the X social media platform, on-chain forensic analyst TruthLabs, known as @BoringSleuth and backed by former ETH advisor Steven Nerayoff, has leveled serious accusations against the Ethereum Foundation. According to TruthLabs, there is transactional evidence linking the foundation to the Gatecoin hack in 2016, an event preceding the infamous hack of The DAO.\n\nThe core of this revelation is a series of Ethereum wallet addresses and their interconnected transactions, painstakingly traced back to moments before the hack. The thread begins with a bold statement from TruthLabs: “Proof of the Ethereum Foundation’s involvement in the Gatecoin Hack in 2016, prior to the exploitation of The DAO,” setting the tone for a narrative that unravels a complex web of transactions, contracts, and potentially incriminating associations.\n\n🚨🧵Proof of the Ethereum Foundations involvement in the Gatecoin Hack in 2016, prior to the DAO exploit 🚨 Below is a thread showing transactional evidence linking the Ethereum Team to the 185K Ether stolen from Gatecoin, now worth over $460M today. 👇 — TruthLabs 🫡 (@BoringSleuth) January 17, 2024\n\nThe Gatecoin hack occurred between May 9 and May 12, 2016, a turbulent period in the crypto market, just before the onset of The DAO’s token sale and its subsequent hack. Gatecoin’s official statement at that time revealed losses of 185,000 Ethereum from their wallets, an astonishing amount valued today at over $460 million.\n\nTruthLabs, in their investigative thread, scrutinizes the on-chain movements associated with this event, focusing on four Ethereum addresses believed to be directly involved in the hack. One address, in particular, 0x1342a0, becomes a focal point due to its activities before the hack.\n\nThis wallet received an initial transfer of 1.6 Ether from another wallet, 0x8266, on May 9, 2016. TruthLabs delves into the origins and transactions of 0x8266, noting its developmental activities, including the creation of 10 distinct contracts. The wallet’s interactions revealed a close connection with wallet 0x556b, another development-centric address involved in setting up nine contracts and creating tokens that resembled The DAO’s infrastructure.\n\n0x556b, the last wallet that sent funds to the hackers’ 0x8266 wallet when they needed it, was originally funded by the Ethereum Foundation’s main wallet. In fact, they only received ETH from the foundation before the Gatecoin exploit.\n\nThe central accusation is based on the origin of funds for wallet 0x556b. TruthLabs reveals, “0x556b, the last wallet that sent gas funds to the hackers’ 0x8266 wallet when they needed it, was originally funded by the Ethereum Foundation’s own main wallet,” pointing out a direct financial path from the Ethereum Foundation to the Gatecoin hackers. This revelation is supported by a forensic map detailing the flow of funds and contract interactions leading from the foundation to the actors behind the Gatecoin hack.\n\nTruthLabs Speculates That Ethereum Was Facing a Financial Crisis at That Time\n\nThe plot thickens as TruthLabs speculates on the potential motive behind Ethereum’s alleged involvement. Citing financial forecasts from September 2015, the analyst suggests that the Foundation was possibly facing a financial crisis, with predictions of running out of funds by June 2016, coinciding with the period of the Gatecoin and The DAO hacks.\n\nSteven Nerayoff, in his supporting statement, emphasized the severity of these accusations and the urgent need for a response from the implicated parties. He states, “Vitalik Buterin & Joseph Lubin, the on-chain data by @BoringSleuth is either right or not. Silence can only be construed as an admission of guilt given the magnitude of these allegations.”\n\nThis sentiment is echoed by TruthLabs, who invites the crypto community to independently verify the findings and participate in unraveling the full extent of these claims. Neither Vitalik Buterin nor any other person from the ETH network has yet commented on the accusations. The silence from Buterin and Lubin certainly does not help to silence the critics. At the time of writing this article, according to CoinMarketCap, ETH fell by 1.25% in the last session, settling at $5,415."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxOZlEtc3IzamNadEhxTFpDSHNVNmE1RlV5MUpPNkxyNVZ2SWNySnozeEdsUUVDZVlpczdzSXJMYnJ6LXV5UktERW9ITmV5Q085U1BVM19pUWV4cVpxR05xZS00QTNjclQyQ1ZCUm5kaXJVQ0hZcUFFLWhUdnJPUjltZEtnREdzMk9lUTNuZE1vVHEtSG9VN0ptdk9vaEJMLXRTNlRjcUFGMy1YWmdQSDJSXzNhQlVQVUFtRk11OUp6Sy1kN3p1NVdQbGkwTUh3RWVXdmFKWGZ1TnZzSms1WFHSAd4BQVVfeXFMTmZRLXNyM2pjWnRIcUxaQ0hzVTZhNUZVeTFKTzZMcjVWdkljckp6M3hHbFFFQ2VZaXM3c0lyTGJyei11eVJLREVvSE5leUNPOVNQVTNfaVFleHFacUdOcWUtNEEzY3JUMkNWQlJuZGlyVUNIWXFBRS1oVHZyT1I5bWRLZ0RHczJPZVEzbmRNb1RxLUhvVTdKbXZPb2hCTC10UzZUY3FBRjMtWFpnUEgyUl8zYUJVUFVBbUZNdTlKekstZDd6dTVXUGxpME1Id0VlV3ZhSlhmdU52c0prNVhR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "SEC Extends Review Period for Fidelity's Ethereum ETF Proposal, Analysts Divided on Approval Prospects - The Currency Analytics",
        "content": "However, not all voices in the market share this optimism. Will Clemente III recently introduced a note of caution, referencing a statement by SEC Chairman Gary Gensler. Gensler indicated that Bitcoin (BTC) is currently the only recognized crypto commodity, leading to lower expectations for the approval of an ETH ETF. Clemente pointed out that while Gensler's stance may dampen expectations, the market often grasps onto narratives, creating room for potential surprises."
    }
]