[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQYTJxeUEydElOcXhwMFd1SW5sMlNoRmhPQTdfYUtmcUgzeEpFTEZqX3VnNmI4aHBYQm85akp0UlNuZ3o4SS0wQTg3RWFJWHFfeFpILXp5VmVMUU1qd2NQRVVZMmJ6TUdZRXliRjFXZGJrdUxadHlmNWk5aGs2VXAxZ0tuSzhHSXU4cGdfUTJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Earns $2.7 Billion in Fees Each Year: Lookonchain - Unchained",
        "content": "Lookonchain found that Ethereum earns over $2.7 billion in fees per year — more than twice the amount of fees generated by Bitcoin.\n\nEthereum earns the highest one-year fee revenue of the top ten blockchains by a large margin, according to a a new analysis from blockchain analytics firm Lookonchain.\n\nLookonchain found that Ethereum earns the highest fee revenue of $2.7 billion per year, while Bitcoin comes in second with a yearly fee revenue of $1.3 billion and Tron comes in third with a fee revenue of $459.3 million.\n\nOther layer one blockchains took the next spots on the list, with Solana earning $241.2 million in fees each year, BSC earning $176.5 million and Avalanche earning $68.8 million in fees.\n\nLayer 2 networks zkSync Era and Optimism earned $59.7 million and $40.4 million in fees respectively, while Polygon took the last spot on the list with $23.9 million in yearly fees.\n\nDespite Ethereum dominating in fee revenue, it’s also notorious for having sky high average gas prices. However, the average gas fee on the network is currently at one of its lowest levels in years.\n\nAt the time of writing, data from Etherscan shows that the average transaction on Ethereum costs around 5 gwei or just $0.27. The uptick in use of layer 2 scaling solutions and the impact of the Dencun upgrade may be some of the reasons driving gas prices lower, as activity across decentralized applications (Dapps) has been on the rise.\n\nData from DappRadar shows that volume across Ethereum-based Dapps surged 300% over the last week to $71.8 billion."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNY1ZuS3BaTnNuR3BxUkF2TGk5NXU5WjBPaE5JMXQxd1VJNlZHdlVSanlNbE5HVlBlUkVhYVRIRXJyODVNU2F4ZFZmZDVGMDMzQWJHNF9kZl85OUtoZ21pd2IzU0RQTzV4eFAwY3poNXIzYk5TalNmb2ZOdUhjeGdTMlZwM0tZM3R3OWhPYmRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin In Full Meltdown As Mt.Gox Moves $2.7B To New Wallet: King Crypto Decline To $51K Feared By Analyst - Yahoo Finance",
        "content": "Bitcoin, Ethereum, Dogecoin In Full Meltdown As Mt.Gox Moves $2.7B To New Wallet: King Crypto Decline To $51K Feared By Analyst\n\nThe cryptocurrency market bled profusely Thursday, as investors shuddered about the movement of billions of Bitcoin (CRYPTO: BTC) ahead of a probable sell-off.\n\n\n\n\n\nCryptocurrency Gains +/- Price (Recorded 8:30 p.m. EDT) Bitcoin (CRYPTO: BTC) -5.10% $57,248.99 Ethereum (CRYPTO: ETH) -6.78% $3,081.66 Dogecoin (CRYPTO: DOGE) -13.03% $0.1033\n\nRead Next:\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today .\n\nAmid the ongoing EV revolution, previously overlooked low-income communities now harbor a huge investment opportunity at just $500.\n\nWhat Happened: Bitcoin nosedived to the $57,000 zone, its lowest since Feb. 28. Since the beginning of this week, the world's largest digital asset has slumped 9.5%, nearly 21% down from its all-time high clocked earlier this year.\n\nThe second-largest cryptocurrency, Ethereum, also crashed to a six-week low, erasing all the gains made since the hype of spot ETF approvals in mid-May.\n\nThe sell-offs were precipitated by the movement of 47,228 Bitcoin, worth $2.7 billion, by defunct cryptocurrency exchange Mt. Gox from a cold wallet to a new wallet, possibly in preparation for payouts to its creditors.\n\nThe slump forced the largest wave of liquidations since mid-April, as $541.45 million in future contracts was wiped out in the last 24 hours. Long liquidations accounted for a whopping $472 million.\n\nBitcoin's Open Interest plunged 7% in the last 24 hours. A fall in price, coming alongside a fall in OI, is viewed by some analysts as a good sign because they think the downtrend will end once all long sellers have closed their positions.\n\nTrending: 1 in 4 Americans own a share of Bitcoin according to NASDAQ, how many people got started through this free crypto faucet?\n\nThe Cryptocurrency Fear & Greed Index flashed a \"Fear\" signal, implying that investors were bearish on the market prospects. But such conditions also provide buying opportunity for bold dip buyers.\n\nTop Losers (24-Hours)\n\n\n\n\n\nCryptocurrency Gains +/- Price (Recorded at 8:30 p.m. EDT) Core (CORE) -20.89% $0.9702 ORDI (ORDI) -17.83% $29.62 Beam (BEAM) -17.26% $0.01385\n\nThe global cryptocurrency market cap stands at $2.09 trillion, following a 6.06% fall in the last 24 hours.\n\nStock futures traded flat Thursday night. The Dow Jones Industrial Average Futures is up 0.08%, as of 9 p.m. EDT. Futures tied to the S&P 500 gained 0.01%, while Nasdaq 100 Futures slipped 0.03%.\n\nMarkets will open on Friday after the Fourth of July break. Investors have now set their eyes on the release of June jobs data.\n\nStory continues\n\nSee More: Best Cryptocurrency Scanners\n\nAnalyst Notes: Widely followed cryptocurrency analyst Ali Martinez sounded a bearish alarm, with more potential downsides to follow for Bitcoin.\n\n\"Bitcoin closing below $57,000 could spell trouble, with potential support only at $51,000,\" Martinez stated.\n\n\"If BTC can break past this level, the next significant target is $78,700,\" Martinez explained.\n\n\n\n\n\nOne of the most crucial resistance areas for #Bitcoin is $65,795. If $BTC can break past this level, the next significant target is $78,700! pic.twitter.com/tcxTJlKUo3 — Ali (@ali_charts) July 2, 2024\n\nIn a positive forecast, popular analyst Rekt Capital highlighted the possibility of King Crypto peaking around mid-September or mid-October 2025.\n\n\"The longer Bitcoin consolidates after the Halving, the better it will be for synchronizing this current cycle with the traditional halving cycle,\" the trader opined.\n\n\n\n\n\n#BTC\n\n\n\nIn the 2015-2017 cycle, Bitcoin peaked 518 days after the Halving\n\n\n\nIn the 2019-2021 cycle, Bitcoin peaked 546 days after the Halving\n\n\n\nIf history repeats and the next Bull Market peak occurs 518-546 days after the Halving...\n\n\n\nThat would mean Bitcoin could peak in this cycle... pic.twitter.com/bg6GjkvLlW — Rekt Capital (@rektcapital) July 4, 2024\n\nRead Next:\n\nElon Musk and Jeff Bezos are bullish on one city that could dethrone New York and become the new financial capital of the US. Investing in its booming real estate market has never been more accessible.\n\nGen Z and Millennial millionaires couldn't care less for stocks and bonds — Here's what they're buying instead.\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Bitcoin, Ethereum, Dogecoin In Full Meltdown As Mt.Gox Moves $2.7B To New Wallet: King Crypto Decline To $51K Feared By Analyst originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPQjJpN0k0TEdYLUk3Y3ZUczhOS2JvWW83TVBwdWlDWm1SWUIwNlZ1MVIyVDhYQ3NLUDdHeVByOXNkbWtzZGxjcU1UNkZzZ21EMW1FLXFxTWFXejVRM0ZETUZxX21FaFFNOWF2VUtGZlgxWS04RklyUlVKc01WRzhmZkEzYjZ3aHA0cUxELXlDdndHdS1QR1lGR3FOeEhvYm9BQ1NjOWhybklKV1BrVENsWDZ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Bull Flag Rebound Signals 25% ETH Price Rally in July - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE1udjRBTENJUnJKbnE0NjUzMkdIekpTZnV0OU4xeHdTTmJOb0xrTi1nRVJ0amtBajNFeC1haUlvMWpoUlM1bExqU1ZycVFWUlRWUm5xYWJVa2dOYVJTcmVYYWVTeFRWUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF, Uniswap V4, and Cardano are major crypto catalysts in Q3 - Crypto Briefing",
        "content": "Ethereum ETF, Uniswap V4, and Cardano upgrade aim to enhance market accessibility and efficiency in Q3.\n\nKey Takeaways Ethereum ETF launch expected to attract institutional investors in Q3 2024.\n\nCardano's Chang hard fork aims to implement decentralized governance by July's end.\n\nShare this article\n\nThree major catalysts are set to impact the crypto market in Q3 2024, according to the latest edition of IntoTheBlock’s newsletter “On-chain Insights”. The events include the trading start of spot Ethereum (ETH) exchange-traded funds (ETF) in the US, the Uniswap V4 release, and Cardano’s Chang hard fork.\n\nThe Ethereum ETF is expected to launch this quarter, potentially attracting institutional investors. Analysts at IntoTheBlock predict ETH ETF inflows could reach 30% of those seen during the Bitcoin ETF introduction, which saw $5 billion in net inflows over its first five months.\n\nSpot Bitcoin ETF inflows. Image: IntoTheBlock\n\nAs reported by Crypto Briefing, asset management firm Bitwise’s CIO predicted that Ethereum ETFs could attract $15 billion by the end of 2025.\n\nUniswap, the largest decentralized exchange by total value locked, plans to release its V4 version. This is the second development in crypto seen by IntoTheBlock analysts as a potential catalyst for prices in Q3.\n\nNotably, the V4 update introduces “hooks” for customization, dynamic fees, on-chain limit orders, and time-weighted average market maker functionality.\n\nCurrent profitability of UNI holders. Image: IntoTheBlock\n\nMoreover, Cardano aims to implement the Chang hard fork by the end of July, introducing decentralized, community-run governance. The Chang upgrade will proceed once 70% of stake pool operators have tested and updated their systems.\n\nThis is also a development in crypto that could boost prices in this quarter, the analysts pointed out.\n\nThese developments follow historical trends of catalysts boosting asset values. During the month leading up to Cardano’s last hard fork in September 2021, ADA’s price increased by 130%, rising from $1.35 to $3.10.\n\nThe On-chain Insights newsletter also mentions the application for a Solana ETF made by Bitcoin ETF issuers VanEck and 21Shares, further expanding institutional crypto access. Although it is unlikely to get approved in 2024, much less in Q3, this movement could boost investors’ sentiment."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQTXU1eGhqZ1p0Yjk2b0xpdk1DVmVyZ3RmTHVJSFF2eWpmMFgzZmxKZVAyak9teS1IS3gxdElHdVRfQkpjdlQtY2ZIX1Z3MkJqRkgxTWdqQURxaTJtRlRBZXhVcFBHTERoaU1YU2xpaHd6MzlTYW9vUElxUmZTRHhrUkV5cnV4RmpOZXhxb2tIOElYWnNvWkF5d3Z2cXQwV2tfclJCWFJTUUhQSUlfY0pqTi1saXhGT2NY0gG-AUFVX3lxTE1fVlZZZlNVSWpPSHFsVDI3SmIwT2hUTVE1VkVQUWctbnhINnI1eHkwWlM5NzhGdXliQmsyQnhLLTVYWUFuNW1WaG9vRG9GQkNVbTkwYXRLZmVNcTVVSkJYSHJjWUpCdllxdFU3RjlFOHdGRndpaUMtY2k5YXRhdklZYWdzYzEtNFNKWlNVYTlDVGZVakRTRU1mZEV0eGtGOWl2cWxEdUI0UzZwbXNrekpwRnNvUWVvYjUwM3VqaUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum mailing list breach exposes 35,000 to crypto draining attack - BleepingComputer",
        "content": "A threat actor compromised Ethereum's mailing list provider and sent to over 35,000 addresses a phishing email with a link to a malicious site running a crypto drainer.\n\nEthereum disclosed the incident in a blog post this week and said that it had no material impact on users.\n\nAttack details\n\nThe attack occurred on the night of June 23 when an email was sent from the address ‘updates@blog.ethereum.org' to 35,794 addresses.\n\nEthereum says that the threat actor used a combination of their own email address list and an additional 3,759 exported from the platform's blog mailing list. However, only 81 of the exported addresses were previously unknown to the attacker.\n\nThe message lured recipients to the malicious website with an announcement of a collaboration with Lido DAO and invited them to take advantage of a 6.8% annual percentage yield (APY) on staked Ethereum.\n\nMalicious email sent to Ethereum holders\n\nSource: Etheretum\n\nClicking on the embedded 'Begin staking' button to get the promised investment returns took people to a fake but professionally crafted website made to appear as part of the promotion.\n\nIf users connected their wallets on that site and signed the requested transaction, a crypto drainer would empty their wallets, sending all amounts to the attacker.\n\nCryptocurrency drainer site\n\nSource: Ethereum\n\nEthereum's response\n\nEthereum says that its internal security team launched an investigation as soon as possible to identify the attacker, understand the attack's purpose, determine the timeline, and identify the affected parties.\n\nThe attacker was quickly blocked from sending more emails and Ethereum took to Twitter to notify the community about the malicious emails, warning everyone not to click the link.\n\nEthereum also submitted the malicious link to various blocklists, which led to it being blocked by most Web3 wallet providers and Cloudflare.\n\nOn-chain transaction analysis showed that none of the email recipients fell for the trap during the campaign.\n\nEthereum concludes by saying it has taken additional measures and is migrating some email services to other providers to prevent such an incident from happening again."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQM1BpMm43dTJucC1zM282U2VqeEpoTzg3NTU0WUZ6MFJ5VXFTbExBdGdNS3UtV2RGdldfc1ZBb3pQbzN0SV9wZG94VmFuWlRNX21SVXhhOVRHaDQ2RWRjM080VnRQTUpCSlVFRTFXcEVuUV93bG5wTGhrWHRZelhDQnRzVldUX3hXZS13SWxlRXRWZms?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Solana Meme Coins Outshine Ethereum by 800% in 2024 - Crypto Times",
        "content": "Solana-based meme coins have significantly outperformed their Ethereum-based counterparts in 2024, yielding an average return of 8,469% as compared to Ethereum’s 962%, per the “CMC 2024 H1” report.\n\nSolana-based meme coins Vs. Ethereum-based meme coins, Source: CoinMarketCap\n\nAs per the report, the explosive rallies of WIF and BONK on Solana have drawn significant attention and capital from other blockchains, creating a cycle of increased meme coin performance and investment. While meme coins exist across various blockchains, Solana and Ethereum lead in activity and trading volume.\n\nEthereum meme coins are more well-known because they were primarily introduced in 2023 or earlier. In contrast, most Solana meme currencies came onto the scene in late 2023 or early 2024, capitalizing on the surge in attention at the time.\n\nPolitical meme tokens have become a prominent subgenre inside the $57.7 billion meme currency market with a market valuation of $784 million. The MAGA (TRUMP) meme coin has increased in value by more than 5,100% this year due in large part to Trump’s open endorsement of cryptocurrencies and his acceptance of cryptocurrency contributions for his campaign.\n\nThe exceptional performance of Solana-based meme coins underscores a growing shift in speculative investments within the crypto space. This trend is not only reshaping the dynamics between different blockchain ecosystems but also highlights the increasing integration of political narratives within the meme coin market.\n\nAs crypto becomes a significant topic for the upcoming November US elections, political meme coins are expected to continue attracting speculative interest, further driving their market activity and value."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNcDl3VXRpanE4ZW1hVUwyMnRGMU5KVlI1OXJlcGJOWXV3d295TkFHUXR6UlNsZDh1M2hsYVhFRWZLcEtjRi1PYTBGNzVKclhOWWRVUHZIN2JMYmFQY3RXb3VFejF1WTVxSHVBWk9mbk9HQXkwNDVuenowUGJYZ1Z1SVNwRVNiVDhpVUtWaUJOUFdZRmZTQWdNVGdsdXktNTl0UGhKY1U1dDFqcmxzRFA4cjQ1dkw5Sk1zU2VXSy02ZDYxVnVB0gHKAUFVX3lxTE9jMjVfdER1aTZBZHQyRUFPNnZqbW9zNHQ4Yl9JakU3S3d6TnlmTXQ5OVJKa3dLVlpxelB0MkhOeHZaMHZCSXg3OFYxSzhFSGd4THRVRUVXc3F0NFVyMllwQW9tdEJFWW5kMTNIZ3p6MmVTY3pHUFd4c0JxTGQ4eFBTQ0JhZ1FnT3MxS0w3Z3Z0d0g5aU1wTXpjUXlnR2I5UW9pQVFWVmZKc045dWdEWVZrd0tRVmMzMklkTDB0TzhXbUloVER2ZUh2Tnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum breaches key support as SEC delays ETF decision - FXStreet",
        "content": "SEC delays decision on Ethereum ETF S-1 drafts as analysts shifted their potential launch date again.\n\nEthereum whale risks liquidation if ETH declines to $2,984.\n\nEthereum breaches key support amid key insight from CME open interest.\n\nEthereum is down more than 5% on Thursday following the Securities & Exchange Commission's (SEC) failure to approve ETH ETF issuers' S-1 drafts. Meanwhile, the recent decline has strengthened the bearish outlook after ETH moved below a key support level, sparking $90 million in long liquidations.\n\nDaily digest market movers: SEC yet to approve ETH ETF\n\nDespite its light comments on issuers’ S-1 drafts, the SEC has yet to approve spot ETH ETFs following the US Independence Day holiday. As a result, Bloomberg analyst James Seyffart shifted his over/under date for a potential approval to next weekend.\n\nThe SEC approved spot ETH ETF issuers' 19b-4 filings in May, but also need to sign off on their S-1s before the products go live.\n\nNate Geraci, President of ETF Store, noted that the SEC expects issuers to amend their S-1s by July 8, with another round of filings potentially due around July 12. This \"would theoretically mean launch week of July 15\" for spot ETH ETFs, wrote Geraci in an X post.\n\nMeanwhile, following the recent market decline, a whale who longed ETH via the Compound protocol is about to be liquidated, according to data from Lookonchain. The whale deposited 12,734 ETH worth $40 million to Compound and borrowed $31.4 million worth of dollar-denominated stablecoins with a health rate of 1.06. The whale risks liquidation if the price of ETH drops to $2,984.\n\nETH technical analysis: Ethereum bears lead market amid slight bullish sentiment from US investors\n\nEthereum is trading around $3,132 on Thursday, down more than 5% on the day. The decline wiped out more than $90.81 million worth of long positions from the market, bringing the total ETH liquidations to $102.48 million in the past 24 hours.\n\nETH has now breached the $3,203 key support level, strengthening its bearish outlook. With the move, ETH has fully balanced the market inefficiency from itsprice spike following news of the SEC's U-turn on spot ETH ETFs.\n\nETH/USDT 4-hour chart\n\nETH may test the $3,029 support level in the next few hours. A bounce from this level will cool the bearish momentum. However, a move below it may see ETH seeking support around the $2,852 price level.\n\nIn the past 24 hours, Ethereum's futures open interest (OI) across top exchanges declined by almost 5%. Open interest is the number of outstanding contracts in a derivatives market that are yet to be settled.\n\nWhile the move signified wider risk aversion from traders, Ethereum's CME OI was an outlier, rising almost 1% in the last 24 hours. This indicates that US investors may be slightly bullish despite declining prices due to expectations of spot ETH ETFs' launch.\n\nAnother key insight is that spot ETH ETFs may experience impressive flows using the rising ETH CME OI as a proxy to measure investors' sentiment. As a result, ETH may take bears by surprise and rally past its yearly high, invalidating the bearish thesis."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPX2I2OHdvUjlnTGY4Njg0OTg0Q1l0cW16YXB3cmZYTm4zQjhqNGZwbHRDS2J1czg5amxuMVhmWjdkOXQ3OHJfUTVOaXBVU25DamRVNkJpVGsyYnUtdy1Zd0V1WXNqSlNaQjZsX01FXzRIUFJDSER1c1dhd2VJdHdJNzE5NV9EYkJPREJyamd5WDNPZWNoRGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Bloomberg analysts expect spot Ethereum ETFs to launch by mid-July - CryptoSlate",
        "content": "Bloomberg ETF analyst James Seyffart said he and his colleagues believe spot Ethereum ETFs could launch around July 15 as the application process settles.\n\nSeyffart posted the prediction on social media on July 3 but said he has “low confidence in those launch date predictions at this point.”\n\nThe prediction is related to Bitwise’s amendment to its spot Ethereum ETF application on July 3. Seyffart noted that the only significant change was adding a six-month fee waiver for the first $500 million in assets. Seyffart said:\n\n“These changes were very minimal and [I don’t know] why the ETFs wouldn’t be ready to go within a couple weeks.”\n\nHe added that there is no official timeline for approvals, and the SEC’s Division of Corporate Finance is “taking [its] time” approving each fund.\n\n“Literally nothing’\n\nBloomberg ETF analyst Eric Balchunas said the latest round of comments involved “literally nothing” and asserted the funds should have begun trading already.\n\nHe added that the light comments also allowed Bitwise to amend its application sooner than the July 8 deadline that it and other applicants are expected to meet.\n\nBalchunas said that all indications suggest a “launch [is] still on for this month.”\n\nMeanwhile, ETF Store president Nate Geraci believes applicants will submit one more round of amendments to add fees before the funds can begin trading.\n\nSEC issued exchange approvals in May\n\nOn May 23, the SEC approved 19b-4 rule changes, allowing exchanges to list and trade the pending spot Ethereum ETFs. The agency must now approve S-1 registration statements to permit asset managers to issue the funds, but there is no deadline by which it must do so.\n\nBalchunas said the final approvals are guaranteed, noting:\n\n“Good news is [the SEC] approved [the 19-b4s], this is just logistics and issuers at their mercy timeline wise.”\n\nBalchunas previously predicted spot Ethereum ETFs would launch before July 4, calling the prediction an “over/under” date. He extended the earlier prediction in late June as the SEC asked applicants to amend their S-1 registration statements by July 8.\n\nOther applicants have backed a near-future launch for the Ethereum ETFs. Galaxy Digital, which has an application pending with Invesco, expects the funds to launch in a matter of weeks.\n\nMentioned in this article"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE5WaE9WUjhpWmtxWmJudlBjTU41X21oUkJpbTk2dFN6c1p1TV9UM2F1R0dWTXJLQnNnQzZIR01UUlQ5aUpkTmpid2xHWUFHRm9NRlFvaUJmcTF0ZVVJb2tn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction | Is ETH a Good Investment? - crypto.news",
        "content": "How will the recent market crash impact Ethereum price prediction? Experts weigh in on potential outcomes.\n\nThe crypto market experienced extreme turbulence over the past 24 hours. Bitcoin (BTC), the leading cryptocurrency, plummeted to a new low of $53,700 on July 5.\n\nThe market-wide sell-off intensified following reports that Mt. Gox, the infamous collapsed crypto exchange, transferred over 47,000 BTC (worth approximately $2.6 billion) to a new wallet in preparation for a large-scale payout totaling about 142,000 BTC (valued at $7.9 billion at current prices).\n\nYou might also like: Why Bitcoin could stay low until October: What analysts are saying\n\nOn July 5, during Friday’s Asian trading hours, the Mt. Gox trustee officially confirmed that the exchange had made repayments in Bitcoin and Bitcoin Cash to some of the rehabilitation creditors, although the exact amount of BTC sent wasn’t specified.\n\nThe ripple effect of this panic selling spread across the altcoin market, leading to more pronounced declines. Ethereum (ETH), along with nearly all top ten altcoins, crashed by 10-20%, with Ethereum losing the crucial support level of $3,000, marking the biggest decline since the FTX crash.\n\nLargest liquidation event since the FTX collapse wow pic.twitter.com/BsCtDHkXTz — merts.eth (@merts_eth) July 5, 2024\n\nAccording to Coinglass data, over the past 24 hours, 221,704 traders have been liquidated. Bitcoin’s total liquidations reached $200 million, while Ethereum’s stood at around $160 million.\n\nDespite this turmoil, BTC has shown some signs of recovery, trading around $55,400 as of July 5. However, Ethereum hasn’t been as fortunate, trading below the $3,000 mark at $2,940, marking a 6.75% decline in the last 24 hours and approximately 15% over the week.\n\nLet’s delve into the major events impacting Ethereum and explore what we can expect in terms of Ethereum price predictions.\n\nWhat’s next for Ethereum?\n\nEthereum’s future looks busy and potentially transformative. One of the most anticipated developments is the launch of Ethereum-based spot exchange-traded funds (ETFs).\n\nAsset manager Bitwise has recently filed an amended S-1 form for an Ethereum ETF, indicating that these products are almost ready for launch. The deadline for this filing was July 8, and it suggests that we might see these ETFs trading soon.\n\nYou might also like: Ethereum at $10,000? Here’s how the first spot ETH ETF could make it happen\n\nBloomberg ETF analyst James Seyffart mentioned on social media that Bitwise’s amended S-1 form is a positive sign. He expects more issuers to follow suit in the coming days, predicting that these ETFs could potentially start trading as early as next week or the week of July 15.\n\nUPDATE: We've got another amended S-1 from @BitwiseInvest for their #Ethereum ETF. Expect more from other issuers throughout the rest of the week. We're thinking these things could potentially list later next week or the week of the 15th at this point. pic.twitter.com/xqVlt9lSGy — James Seyffart (@JSeyff) July 3, 2024\n\nThis move comes after the SEC approved 19b-4 forms for eight spot Ethereum ETFs on May 23, which included Bitwise. However, for these ETFs to begin trading, their S-1 statements must become effective as part of a two-step regulatory process.\n\nEric Balchunas, another senior Bloomberg ETF analyst, noted that the SEC’s delay in approving these ETFs has been puzzling, given the minimal comments received.\n\nHe speculates that the delay might be due to one problematic issuer or simply the usual summertime slow pace with people on vacation. Despite these delays, all indications point to a launch this month.\n\nThe introduction of Ethereum ETFs is crucial because it allows more investors to gain exposure to Ethereum without directly buying the cryptocurrency.\n\nHowever, in light of the current market uncertainties and bearish sentiment, it remains uncertain how impactful these ETFs might be on Ethereum’s price appreciation.\n\nExperts take on what is brewing?\n\nFollowing the recent market turmoil, experts have shared insights into what may lie ahead for Ethereum and the entire crypto market.\n\nAli, a crypto analyst, mentioned a large capital outflow from the market. In March, the market held over $110 billion, but now it has dwindled to just $20 billion, indicating waning investor confidence that could continue to exert downward pressure on prices.\n\nAli also discussed the current crypto cycle, mentioning the approval of Bitcoin ETFs, the rise of meme coins, and celebrities launching their own altcoins, asking if the market has already reached its peak. He suggested that BTC needs to surpass $61,000 levels for the bull run to resume.\n\n#Bitcoin currently lacks significant support. The main key demand wall is around $47,000, and for the bull run to resume, $BTC must close and hold above $61,000. pic.twitter.com/9cD2otd4ZK — Ali (@ali_charts) July 5, 2024\n\nAmid this, Peter Schiff, a prominent crypto critic, expressed concerns about Ethereum breaking key support levels and trading below $2,900, marking a 30% decline from its March high.\n\n#Ethereum is also breaking key support. It's trading below $2,900, down 30% from its March high. I think a crash down to $1,500 is coming. It looks like those buying the #Ether ETF rumors couldn't wait for the fact to sell. pic.twitter.com/XXEyX67BXK — Peter Schiff (@PeterSchiff) July 5, 2024\n\nSchiff believes Ethereum could decline further to $1,500, noting that investors who were anticipating Ether ETFs are now selling off before these products launch.\n\nAdding fuel to the fire, Michaël van de Poppe, another crypto analyst, pointed out that Ethereum has hit its lowest Relative Strength Index (RSI) on the daily chart since August 2023.\n\n#Ethereum reaches the lowest RSI (Daily) since the collapse in August '23.#Altcoins have reached their lowest RSI (Daily) ever or of this cycle.\n\n\n\nClear capitulation. pic.twitter.com/9eehaITkQI — Michaël van de Poppe (@CryptoMichNL) July 5, 2024\n\nHe also noted that many altcoins are experiencing their lowest RSI levels ever, indicating stark market capitulation.\n\nMeanwhile, another crypto analyst, offered a more optimistic view. He acknowledged that while the current pullback is challenging, it remains relatively minor compared to previous cycles.\n\nTo put things into perspective, the current pullback would still be relatively minor in the previous cycles.\n\n\n\nWe've been through worse.#Bitcoin pic.twitter.com/Q4vQsxqgZ8 — Jelle (@CryptoJelleNL) July 5, 2024\n\nEthereum price prediction: a bounceback possible?\n\nAs we look ahead, many experts have shared their Ethereum predictions for the coming years. Let’s break it down year by year.\n\nEthereum price prediction 2024\n\nFor 2024, Digitalcoinprice forecasts that Ethereum’s price could range from a minimum of $2,648.22 to a maximum of $6,412.82, with an average price of $6,166.53.\n\nCoincodex is slightly more optimistic, predicting that by August 4, Ethereum’s price might rise by 4.10% to around $3,005.95.\n\nThese predictions suggest some growth, but the market sentiment remains cautious.\n\nEthereum price prediction 2025\n\nIn 2025, Digitalcoinprice expects ETH to see further growth, predicting prices between $6,343.49 and $7,643.08, with an average price of $7,511.09.\n\nCoincodex also sees potential growth, estimating that ETH could fluctuate between $2,887.55 and $6,579.89.\n\nDespite the variation, both sources agree on an upward trend.\n\nEthereum price prediction 2030\n\nLooking ahead to 2030, the predictions become even more optimistic.\n\nDigitalcoinprice forecasts Ethereum could reach between $19,899.44 and $21,831.38, with an average price of $20,751.58.\n\nCoincodex, while more conservative, still predicts a substantial increase, with prices ranging from $6,378.65 to $11,950.\n\nThese long-term forecasts reflect growing confidence in Ethereum’s future and its potential to achieve a large value.\n\nWhen considering these ETH price predictions, it’s essential to remember that these forecasts can and often go wrong. The crypto market is highly volatile, and many factors can influence prices. Therefore, it’s crucial to do your own research (DYOR) and never invest more than you can afford to lose.\n\nDisclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nFAQs"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQQ01zVW42bGFtRVN1NGxMRHRSZ2I5WDZ0akpvaGNMaVN0RWtJcEJiX0pqSW40M0lsbGEwRDBpTy1kZDlfSXVRSjM4dmFSbjBramIwYzZLN3BSZVlEQmlucnJpd1k2OUcyb01sdTFQakVUNFpMdlBYMmdBUHBUSXhQdTJadkU2SlI3bk5WRXNDRFhOMHVQdlltbldIWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum staking ETFs will hit Hong Kong in six months — and the financial hub won’t stop there - DLNews",
        "content": "Hong Kong could launch Ethereum staking ETFs within the next six months.\n\nOther crypto products, like a Uniswap ETF or Chainlink ETF, may follow.\n\nThe Bitcoin and Ethereum ETFs launched in April have been warmly received by Hong Kong’s financial sector.\n\nEthereum staking exchange-traded funds are coming to Hong Kong — it’s just a matter of time.\n\nThat’s according to Vivien Wong, partner at HashKey Capital, a crypto asset management firm that played a vital role in getting Hong Kong’s spot Bitcoin and Ethereum ETFs off the ground.\n\n“As soon as spot Ethereum ETFs were approved in the US, people ran to us asking, ‘are you planning to launch an Ether staking product?’” Wong told DL News.\n\nShe said regulators, like Hong Kong’s Securities and Futures Commission, were talking with the industry.\n\n“Last month, I sent a message to regulators to say there was a need for Ether staking,” Wong said. “Without hesitating, they said ‘okay, please send a detailed proposal.’”\n\nThe timing of her comments is notable.\n\nNine spot Ethereum ETFs are expected to launch in the US any day now, as soon as the Securities and Exchange Commission finalises applications.\n\nStaking Ethereum ETFs\n\nEthereum is designed so users can choose to lock in their Ether holdings and earn a 3% yield on the asset — a process called staking.\n\nJoin the community to get our latest stories and updates\n\nWhile spot Ethereum ETFs enable investors to easily get exposure to Ether through their brokerage accounts, they don’t allow them to gain that extra yield.\n\nIn fact, in Hong Kong, holders of these ETF shares must pay a management fee that’s anywhere between 0.3% and 0.99%, depending on the fund they choose.\n\n“For a new Ethereum product to launch, it will probably require another six months or so,” Wong said.\n\nWaiting for the mainland\n\nHong Kong is so keen to offer products that don’t yet exist in the US, because the government wants the city to become a fintech powerhouse, according to Wong.\n\nAnd the process is running “pretty smoothly,” she said.\n\nAlready, the existing crypto ETFs are attracting two types of investors: People who simply want to “buy and hold,” and crypto natives, Wong said. Crypto natives, in particular, have been enticed by the ETF design.\n\nThe funds’ timely creation and redemption process allows investors to use them for over-the-counter trading purposes, according to Wong.\n\nBut by taking the lead and offering advanced products, the hope is for Hong Kong to draw in investors from other jurisdictions — and even, eventually, from the mainland.\n\nMainland investors cannot currently invest in these products. But hopefully, if the regulatory situation changes, “there will be more endorsements from investors in China and we will see more inflows,” Wong said.\n\n”We are waiting for that to open up this market,” she added.\n\nMassive success\n\nHong Kong’s crypto ETFs have hauled in almost $260 million in assets since they launched in April, per The Block data.\n\nCompared to spot Bitcoin ETFs in the US — which have brought in $14.6 billion since January 11 — that might feel small.\n\nBut considering that Hong Kong’s ETF market is 168 times smaller than its US counterpart, the products have been a massive success. “There is definitely excitement,” Wong said.\n\nWhether its financial institutions, wealth managers, distributors, or high net-worth individuals, the entire Hong Kong market is slowly digesting the products and becoming more comfortable with them, she said.\n\nIt wasn’t a guaranteed win.\n\nOpinion about crypto had soured in the region after some of the scandals from the last bear market — notably the fraud case surrounding Hong Kong crypto exchange JPEX.\n\nUniswap ETF?\n\nWong said that other cryptocurrencies will possibly have their own ETFs someday, but none of the choices are obvious, she said.\n\nFor Hong Kong regulators to approve new crypto ETFs, the underlying token must be publicly tradable through registered virtual asset trading platforms.\n\nAnd it must be very liquid, meaning that it must be easy for deep-pocketed market participants to trade.\n\nHaving a robust use case doesn’t hurt either.\n\n”ERC-20 tokens would be generally preferred,” Wong said, referring to tokens issued on the Ethereum network. “Some names like Chainlink or Uniswap.”\n\nAnd a Solana ETF might be in the cards as well.\n\n“We are talking with the SFC right now,” Wong said. “We are getting on with launching new products.”\n\nUpdate: The piece was modified to clarify that investors from mainland China will only be able to invest in the ETFs when Chinese regulation allows it.\n\nTom Carreras is a markets correspondent for DL News. Got a tip about Hong Kong and crypto ETFs? Reach out at tcarreras@dlnews.com."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9wckRnbkI3MmJXWGxVNDVxamNrV21ydkJvQmNnZmZqMGhKT0NTLVNpWVo2S2YtcGk3ZWZZd01UZ3FRYk5BbTBSaGc3ai1wNGRnRG9BQV9LWjMyQUczMHdkUnNLZ0QtTGxCSFUxUDE5czFxWVY1VFZZ0gF8QVVfeXFMUFhUb01aQ2c1VGpjN3pDeWhqT3NSQ3lPM2l6TEphalN3SkZVdDVVaHVwa1pUU21ua0c3V1lyc0gxRG9nTUFFOFBOY2VuOU5WS3BuMElYWDhPbWtjNUl5TTQxR1NfcXZjV3VRdFpwc3pJRC1tTUFLelBCT2dvWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Touch $3,000, Here Are 3 Things to Know - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum is slowly moving toward the $3,000 price level, and it seems inevitable if the market does not face an unexpected influx of fresh funds, which is unlikely. Investors should be ready to see Ethereum at $3,000 and potentially even lower.\n\nAdvertisement\n\nThe price of Ethereum is getting close to $3,000. This means that there will probably be more volatility on the market. In the past, traders have been drawn to important psychological levels like $3,000 in order to take advantage of possible deals and sellers to limit losses.\n\nIt is wise for investors to prepare for potential fluctuations and contemplate tactics to efficiently handle their risks: options, futures hedging, funds redistribution and other strategies may come in handy. The $3,000 drop could have a big impact on investor sentiment.\n\nEthereum, which frequently trades above crucial levels like $3,500, has benefited greatly from the investment community's strong support. A decline below these levels could cause confidence to waver, especially among individual investors, who may see the drop as an indication of an extended bearish phase.\n\nAdvertisement\n\nAn increase in caution when investing in Ethereum may result from this change in trading volumes. The ecosystem of Ethereum may be impacted by the drop in price. We are already seeing a notable outflow from the network, which does not really benefit the digital silver.\n\nFurthermore, the financial strain that Ethereum-based projects may experience could impede ecosystem innovation and development. The NFT (non-fungible token) and DeFi (decentralized finance) markets are no longer around levels we had seen back in 2021, and current tendencies show that things are unlikely to change in the foreseeable future."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQVmI1TEhWVkR4NDNacnZSRUJKbE16UDVJVDBaNlFBS3UydjlIWVN0dTJhZnZpZzJDQ3l6dTZpd1pZWGhGdFBBZGxWY0p4S2NWQTl3OEdfcmNFY2NYa01CZmMtaGw4SWJkWXhNZWtqRUo0MlFtNXNKUmg5clR6QmxjbVFLWWFkMW1LX0ZJdEF6ZzREaW1iVDBvb0Zad0E3eFVMZm16YjMtZkF3T05pMmthM0ItTzVGMzYtUGdvVGV2TnZiYknSAcgBQVVfeXFMUF9fb0pUWDRsNG40SUtIclJoS3RsRFVOX2s1Vzg0eEJwSW9MM21rcUxXTDV0THBTbUtNUEIyQjl6OFltb1dwRkNTSWFRRjROQkhqLXFmWm9aeEZrV3lvQ3hiYlA5Z3RVbFBZVXJSQk1EVnpLZmloSnQyUC1BZTZBTG5uOW1iaFlKQkcwdWZHUnpfM0hWWGtMSG5UTFoxb1BETXhCbnlBNnR1RTBkckZ2Ql95U1ZHOUM1T205R0pTVl8xS0RoN3JzQzU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum poised to follow Nvidia's steps as Bitwise files updated S-1 draft - FXStreet",
        "content": "Ethereum ETFs expected to begin trading in July after Bitwise files amended S-1 ahead of due date.\n\nEthereum ETFs could flip analysts' expectations if investors buy into ETH's Nvidia-like high-growth tech play narrative.\n\nEthereum derivatives data reveals investors are becoming more risk averse following Mt. Gox headwind on horizon.\n\nEthereum (ETH) is down 3% on Wednesday following Bitwise filing an updated S-1 draft and a wider market downturn with potential Mt. Gox BTC supply flooding the market. Despite the general market lull, investors may gain consolation from Bitwise prediction that Ethereum ETFs could outperform analysts' expectations if positioned as a high-growth tech play similar to Nvidia.\n\nDaily digest market movers: Could Ethereum be the next Nvidia?\n\nAsset manager Bitwise filed its amended S-1 registration statement with the Securities and Exchange Commission (SEC) today ahead of its July 8 due date. The new filing added a fee waiver for up to $500 million in assets under management, similar to Van Eck's waiver last week.\n\nConsidering the comments on these drafts were light, Bloomberg analyst Eric Balchunas said spot ETH ETFs should have begun trading and expects them to launch before the end of July.\n\nThe SEC approved spot ETH ETF issuers' 19b-4 filings in May but also needs to greenlight their S-1 registration statements before the products can begin trading.\n\nAccording to Bitwise CIO Matt Hougan, Ethereum ETFs could be more successful than earlier predicted if investors buy into the narrative that Ethereum is a high-growth tech play similar to Meta and Nvidia. Hougan had earlier predicted that spot ETH ETFs could attract up to $15 billion in net flows before the end of 2025.\n\n\"It's pretty easy for me to imagine investors selling a small amount of their tech exposure and adding ETH. I'd argue it's easier than imagining investors carving out an entirely separate portfolio sleeve for a new monetary asset,\" Hougan noted.\n\nHowever, people need to buy into the idea that \"Ethereum is a technology investment\" for this to happen. Hougan noted that a clear understanding of how Ethereum differs from Bitcoin and the growth of applications on its network would help strengthen the “high-growth tech play” narrative.\n\n\"What might that look like? Imagine stablecoins going from $160 billion to $1.6 trillion in assets as more people embrace the speed and transparency of blockchain-enabled payments. Or consider decentralized finance applications opening up new avenues for lending and borrowing with the onset of regulatory clarity. Or imagine more firms following BlackRock's lead and building tokenized funds on the Ethereum platform,\" said Hougan.\n\nMeanwhile, Lookonchain revealed in a recent analysis that Ethereum ranks number one among blockchain networks in terms of yearly revenue. Ethereum's revenue is at $2.728 billion per year, with Bitcoin coming behind at $1.302 billion. Increased revenue often indicates high user activity in a blockchain network, which helps estimate bullish sentiment.\n\nETH technical analysis: Ethereum traders are skeptical with Mt. Gox headwind in sight\n\nEthereum is trading around $3,307, down about 3% in the past 24 hours. ETH breached the $3,367 support level, pouring cold water on hopes of a potential rebound. ETH liquidations reached $44.33 million, equalling that of BTC in the past 24 hours despite having a lower market cap. Long liquidations accounted for 87% of ETH's total liquidations, with shorts at 13%.\n\nEthereum options open interest has declined by 57% since its spike following the SEC's approval of 19b-4 filings of spot ETH ETF issuers. As of May 24, ETH options OI was at $13.44 billion. However, following the expiry of May and June options, most investors have failed to open new positions as indicated in the chart below.\n\nETH options OI\n\nETH options OI is now at $5.69 billion, its lowest level since September. The decreasing options OI accompanied by ETH's price decline suggests option traders are more risk-averse. Two possible reasons for the uncertainty among traders include:\n\nSEC's delay in greenlighting prospective spot ETH ETF issuers’ S-1 drafts.\n\nPrevailing wider market bearish sentiment from Mt. Gox BTC supply.\n\nThe ETH Long/Short ratio also provides insights into traders' sentiment in the past week. The ratio's 7-day average is at 0.946, indicating the futures market is tilted toward the downside.\n\nAs a result, ETH may sustain a horizontal movement in the coming weeks until the SEC approves issuers' S-1 drafts for spot ETH ETFs to begin trading.\n\nETH/USDT 4-hour chart\n\nA breach of the $3,203 support could strengthen bearish sentiment and send ETH back to the $2,850 to $3,029 range."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPTWxlVl9mREV4ZGVRMjM2alVHQVVLYkZFMHI3ckhwckhDS0c3eWdyeDM1MElrQVVNQTRDblVBUlY5TzVoamtCX1BVTmZRcVFkVGR6X29yV2JDNktTX2lLZWZBOEttVzlOazBhbGJZRmtCNlRtUWdvWTFzY25aRExWV1lxYUxpZThJQVo4ZTF2VzU2X0FxaVE5VERVaFhRWnJTeXVNbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Set To Outperform Bitcoin In Coming Months - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOeVB5dnp2U0tlY0pEQUIzYzVhbjBVakE5NXpZc0kxbXYtOFIwMmh6QXN1WjhBZnN0d3FVU0psTDdYWllGcFpQbFc1a0xJYTQ1aXFVRkJNVlJqODFNOFpVMlh0N05FZ0RVTjl1R2dxX3J5NDlPQ3NIX1ZnU3huR2U1RW1vUFgxeGJaMmtlUUl1bTE0TVdfT0thSjA3NWRBZmxiLTY2NVhpMGhzX2kw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Over 35K exposed to crypto draining scheme after Ethereum mailing list hack - SC Media",
        "content": "Decentralized blockchain Ethereum had 35,794 users exposed to a cryptocurrency draining scheme following the compromise of its mailing list provider last week, BleepingComputer reports.\n\nAttackers leveraging a combination of their email address list and 3,759 additional addresses from the mailing list, only 81 of which were new, sent phishing emails via '[email protected]' promoting a partnership with Lido DAO that included a link, which when clicked redirected to a legitimate-looking site that proceeded to drain cryptocurrency within connected wallets, according to Ethereum. Investigation into the incident, which has not compromised any of the recipients, is still underway but Ethereum has already moved to block further phishing email delivery and avert potential compromise of other Web3 wallet providers through link submissions to blocklists. Aside from alerting users regarding the phishing scheme, Ethereum also disclosed performing selective email service migration and other measures to curb similar attacks in the future."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNVWRaUUJhSExpdm9pbldtaVBSR21xMjc1MXozLW5mLTVyZ0lJWXJOVFdOY1RuYTFPV1ZRQjdfUjZKYURuV2tmbFhlYUJBVTFNWDFCTWVFUTQ3VFk3N2J1amdVN3BUZTRldXFfQ29ObDVVZ0RQdHlsRWlpQ2VMYnVKeDBqV3dBV3NNWk81VlcyV1p1T3FoaWU4SkFxbDBiejc2YldPYjVVVURiSkdSZXlDd2g4OUY2R3pEWHJRTUpLcWoweVVzZ1QwZ1V3SVhiak9HSmtySGlsbUpmTEnSAeABQVVfeXFMTUkyLVVTb0NaUmVSaExMNHk2dE1sOXhaWWl3amx6OHNFY3dfYmxpMEZxMmRtTl9oMmJXaGp3OUZfZHZJLVE1X01lX19qZURPejVvVktELWFqRzlWcTMzdllHbEpPSVZQR2ZWbG1DVUhEUmtnN1dDWDVXdGdZN1BXc1VpNUF3YXRYNjFWT2tPRFlqeDVqUXBHb2QtUHJFTm05WmtZTWFTZlZEUTNnRzhpbzNoS29pMXFfRWk2dTMtaUw3TldiSW1Hc2VSOGRFc2ZXLTNGQ3Q4RG1uT0FoZkdGN04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum records another day of heavy liquidations as Mt. Gox bearish pressure persists - FXStreet",
        "content": "Ethereum sees over $108 million in liquidations as Mt. Gox begins repayment to creditors.\n\nGrayscale Ethereum Trust switched to trading at a premium to net asset value as spot ETH ETF launch draws closer.\n\nEthereum may begin consolidation as key support may prove crucial in coming days.\n\nEthereum (ETH) is down nearly 5% on Friday following the Mt. Gox BTC repayment, sparking more than $108 million in ETH liquidations. The repayment's supply strengthened the bearish momentum on Bitcoin, which spiraled into altcoins like ETH.\n\nDaily digest market movers: Mt. Gox headwind, ETHE discount\n\nThe defunct exchange Mt. Gox began the repayment of creditors today after transferring about $84.87 million worth of BTC to Japanese exchange Bitbank's hot wallets. The move increased the prevailing bearish sentiment in the crypto market as altcoins, led by Ethereum, suffered significant declines.\n\nWhile many expected ETH to be less affected by the wider market sentiment due to the upcoming spot ETH ETF launch, the Securities & Exchange Commission's (SEC) slow move to greenlight issuers’ S-1 drafts likely gave bears the momentum.\n\nThe SEC approved the 19b-4 forms of spot ETH ETF issuers on May 23 but needs to greenlight their S-1s before the products can begin trading. The prospective issuers include VanEck, BlackRock, Bitwise, Grayscale, 21Shares, Fidelity, Franklin Templeton and Invesco.\n\nMeanwhile, the Grayscale Ethereum Trust (ETHE) switched from trading at a discount to net asset value (NAV) to a premium of about 0.31% on July 3, according to data from YCharts.\n\nA trust trading at a discount or premium to net asset value means one share of the trust trades below or above the market price of the underlying asset it tracks.\n\nETHE Discount or Premium to NAV\n\nETHE has been trading at a discount because investors must sell their shares to exit their positions, as the trust doesn't allow them to redeem it for cash. The discount particularly increased between March and May after rumors of the SEC's Ethereum 2.0 investigation.\n\nHowever, the gap has closed and is now at a premium as investors bought the discounted shares heavily following the SEC's approval of prospective issuers' 19b-4 filings. The $9.5 billion ETHE trust will convert to an ETF when spot ETH ETFs go live.\n\nETH technical analysis: Ethereum may begin consolidation\n\nEthereum is trading around $2,984 on Friday, down nearly 5% in the past 24 hours. The further decline from Thursday's lows sparked historic liquidations for ETH, wiping off $134 million of open positions from the market. Long liquidations climbed to $108.4 million, while shorts were shy of $26 million.\n\nETH's price has reached the lows of May, when most investors expected a spot ETH ETF denial following reports that the SEC was investigating Ethereum 2.0. ETH broke below the $2,852 key support level but quickly posted a weak exhaustion liquidity void, considering this represents a key demand zone for the top altcoin.\n\nETH/USDT 8-hour chart\n\nETH has failed to sustain an extended move below this support level since mid-February. Additionally, IntoTheBlock's data reveals investors purchased about 57.02 million ETH around the $2,268 to $2,909 price range.\n\nConsidering these factors, ETH may not sustain an extended decline below the $2,852 support as the weekend approaches. ETH will likely begin a horizontal trend around the $2,852 to $3,367 price range, where it traded for nearly five weeks (April 12 - May 19)."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOdHhvUnZ0b2lLOE5vVnpTM0VMdVlJaTdDQUJfRU9GRDE3UXJPbnZTT0lpM2FiaFlMNWlaSTdwLXZyMVNqS2hudkhPMmlkWmwxV1ljY2dNZkhLNEdGTDRueW5KOTNyM3NpYzIzNWZoeUxkWGZvc0xTcFNvWUs4ZFRwSl9hbVhxb3JmMXhScEVmUGdHREdYU0gwaUxB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction as ETH Drops to $2,900 – Time to Buy? - The Tech Report",
        "content": "Why Trust Tech Report Tech Report is one of the oldest hardware, news, and tech review sites on the internet. We write helpful technology guides, unbiased product reviews, and report on the latest tech and crypto news. We maintain editorial independence and consider content quality and factual accuracy to be non-negotiable.\n\nThe cryptocurrency market has lost almost $800 million in the last three days. BTC is now below $60,000, representing a drop of 4.2%. Ethereum ETH is trading at $2,933, a loss of 6.56% over the last 24 hours. This drop is likely attributed to the massive German sell-off and Mt. Gox saga.\n\nAccording to a report, the German government has sold about $434.9 million worth of BTC since June 19. Unfortunately, this move brought negative sentiment in the market. Can ETH’s price bounce back amid this declining market?\n\nEthereum (ETH) Price Action\n\nETH’s price tried multiple times to break above $3,900 but failed as strong bearish momentum pushed it lower. On July 4, ETH hit a strong support level at $2,800, representing a 28.2% drop from the $3,900 level.\n\nCurrently, ETH is recovering slowly, trading above $2,900. However, the overall market sentiment remains bearish. Analysts warn that this recovery might be short-lived, and the bearish trend could continue, pushing ETH lower again.\n\nBased on that, the $2,800 level will be crucial in determining ETH’s next move. If this support breaks, we could see further drops. On the other hand, a strong bounce could signal a trend reversal.\n\nTechnical Indicators Signal Bearish Market\n\nETH’s technical indicators are predominantly bearish. The 50-day and 200-day Simple Moving Averages (SMAs) hover above the current market price. This positioning typically signals a strong downtrend, as the price is trading below the key long-term averages.\n\nAlso, the Price Volume Trend (PVT) indicator sits at 88K, suggesting decreasing buying pressure. This metric contributes to the downward price movement.\n\nFurthermore, ETH’s price is trading below the Bollinger Bands, indicating that the downward trend is strong and may continue.\n\nAlso, the Moving Average Convergence Divergence (MACD) is below its signal line, while the histogram bars display red candles. This typically signals ongoing selling pressure and reinforces the bearish outlook.\n\nThe SuperTrend indicator is flashing a sell signal, suggesting that the current downtrend may persist in the near term.\n\nLastly, the Relative Strength Index (RSI) currently stands at 27, indicating oversold conditions. While this might suggest a potential bounce, note that assets can remain oversold for extended periods.\n\nGiven this overwhelmingly bearish technical analysis, investors might consider waiting for clear reversal signals before entering long positions. Also, remember that markets can change rapidly at any time.\n\nPeter Schiff Predicts Ethereum Crash to $1,500\n\nEarlier today, renowned economist Peter Schiff predicted that Ethereum could crash to $1,500 based on market factors and technical analysis. Schiff sees Ethereum breaking crucial support regions, which usually signals a further decline in price as the buying strength is low.\n\n#Ethereum is also breaking key support. It’s trading below $2,900, down 30% from its March high. I think a crash down to $1,500 is coming. It looks like those buying the #Ether ETF rumors couldn’t wait for the fact to sell. pic.twitter.com/XXEyX67BXK — Peter Schiff (@PeterSchiff) July 5, 2024\n\nMoreover, Schiff believes the anticipated Ethereum ETF launch is overhyped. Schiff claims the ETH ETF hype will ultimately fail soon. According to him, investors are selling off their positions since the price didn’t go as expected.\n\nUnfortunately, Schiff’s $1,500 prediction may create fear, uncertainty, and doubt (FUD) among investors as they worry about the market’s future. The crypto market is not doing well right now. Most cryptocurrencies, like Ethereum, are losing value.\n\nEven if the U.S. SEC approves ETH ETFs, people might react differently to them because the market is already struggling. So, to be on the safe side, it is best to wait for the market to cool off before investing with proper risk management techniques in place.\n\nSecondly, while the broader crypto market is down, investors can consider a new memecoin on presale, which offers an opportunity to buy low and sell high.\n\nWienerAI: A Promising Alternative to Ethereum in a Bearish Market\n\nThe new project called WienerAI is gaining attention and has raised over $7 million in its presale. WienerAI combines humor with advanced technology. It offers an AI-powered trading bot on the Ethereum blockchain.\n\nThis bot helps users make better trading decisions and protects them from front-running bots. The project has an interesting story involving a mix of AI and a dog.\n\nAdditionally, WienerAI focuses on building a strong community called “The Sausage Army.” WienerAI offers high staking rewards, and holders of WAI tokens can earn substantial returns.\n\nFurthermore, the project has solid tokenomics with a clear allocation plan. Crypto influencers are already talking about WienerAI’s potential, highlighting its innovative features and engaging branding.\n\nAs a result, more investors are showing interest in the project.\n\nWienerAI’s Advantages in the Current Market\n\nWhile Ethereum struggles, WienerAI’s presale is thriving. It has already raised over $7 million. This shows strong investor confidence in the project.\n\nThe team behind WienerAI has a clear roadmap. They plan to list the token on major exchanges soon, which could increase its visibility and value.\n\nWienerAI’s AI-powered trading tool sets it apart from other cryptocurrencies. It promises to enhance trading efficiency and accuracy. This feature could attract traders looking for an edge in the market.\n\nAnother advantage is the project’s community-centric approach. It fosters engagement and loyalty among its users, which could lead to long-term support and growth.\n\nAnalysts believe WienerAI has the potential for a 100X return on investment, making it an attractive option for investors seeking high rewards.\n\nIf you want to join a new crypto project while it is still affordable, rush to the presale page now and grab as many coins as possible.\n\nDisclaimer: The opinions expressed in this article do not constitute financial advice. We encourage readers to conduct their own research and determine their own risk tolerance before making any financial decisions. Cryptocurrency is a highly volatile, high-risk asset class.\n\n🔎Looking for the next 10X crypto?\n\nCheck out the best crypto presales to invest now"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5xeDZZTnAwMEF0blh0d1dpai1zZFFqcjNFMGRpeVRzTElpem41LXQ3bHU4MUlYbmN2dWE5UGNmSHkwQkpjanRxUWtKZXEzeUZ5OUdrOHBESXhOY3RyMkFKdGJkYXdvVHRXZ2VJeF9wMlpDVk8xWXBr0gF8QVVfeXFMTW9SdzNxQjV0XzBJMWUtSmRrLW1fSDlJTDBpWTF6Y0hLUkdUY05hOXNfVDB3bFZNaWRvRDBvMGVTV2NKYnJENzh2dEN4MXlUZS1TT1VpNWYxb3M5ME1mbXpLdGx5bm5zbnR5bFBnaUNVcjF3bUNtOW80SFo4Uw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Peter Schiff Predicts Ethereum Crash to $1,500: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a recent tweet, renowned economist and cryptocurrency skeptic Peter Schiff predicted a significant drop for Ethereum, forecasting a crash to $1,500.\n\nAdvertisement\n\nSchiff noted that Ethereum is also breaking through key support levels, having previously said a similar thing about Bitcoin. Currently trading below $2,900, Ethereum has already fallen 30% from its March high.\n\nSchiff pointed out that the market appears to be reacting prematurely to the anticipated launch of an Ethereum ETF. \"It looks like those buying the Ether ETF rumors couldn't wait for the fact to sell,\" he commented, suggesting that investors who had driven up the price based on ETF speculation are now exiting their positions, contributing to the downward pressure on Ethereum's price.\n\n#Ethereum is also breaking key support. It's trading below $2,900, down 30% from its March high. I think a crash down to $1,500 is coming. It looks like those buying the #Ether ETF rumors couldn't wait for the fact to sell. pic.twitter.com/XXEyX67BXK — Peter Schiff (@PeterSchiff) July 5, 2024\n\nAt the time of writing, ETH was down 9.3% in the last 24 hours to $2,872.\n\nAs Ethereum hovers precariously below $2,900, Schiff’s bearish outlook adds to the growing concerns within the crypto community. The prediction of a drop to $1,500 would represent a significant decline and may influence market sentiment further.\n\nCrypto market losses deepen\n\nSchiff's comments come at a time when the broader cryptocurrency market is experiencing volatility. According to CoinGlass data, more than $800 million in bullish crypto bets were liquidated in the last three days, one of the heaviest such liquidations since April.\n\nBitcoin fell for the fourth straight trading session, part of a larger crypto sell-off that contrasted with recent record highs in global stock markets. Ethereum experienced higher losses, reaching 10%.\n\nApprovals for the U.S. ETFs of Ethereum are forthcoming, but interest in the products may be mixed if the crypto sell-off continues.\n\nInvestors are awaiting U.S. jobs statistics later Friday to get the latest hint at the Fed's policy stance. Recent soft economic indicators have boosted the case for the U.S. Federal Reserve to ease monetary policy in the coming months.\n\nLikewise, the market will be closely monitoring Ethereum's performance and the potential impact of ETF developments in the coming weeks."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQQ1JJTFBQeHBOeG1zU2pNSm9qLXF4Z043VUJ0aldXb0ZiZUl5ZlVvdTdQZmVYZ3FWSF84aHpLa1QzMVZJcExlZ0dHR3Rral9IWVJEdUw4a0lSUFVVYTVvTEdWS1J0cGtZZ2J2bGE3aFFhV1pjNm9sMjFqdDMyX2tMRzdjamNybnc3Vy1XV0prRWRoaWVkYk1XRTFB0gGfAUFVX3lxTFBaSnJaRkVxSHlCUjBnR21VX0FnTU5yYzZRdk1WUzNiUkpJNVhfU1ZZei1Bc1Vvb3U2WnFES2NsakJ2MlIxQUduUHJORFhYeHF6Xzg4dmhPY0V2MEZiRkprTVlZMXJiMlcyUGNRR1JnMHNfOUpkTGVQRFFGY2dxdmZMVlFkTHh0MTh0b1dweFFXVC1FbG1kZ0V0aVRjYjZfUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: Will ETH Crash Hit $2,500 Before Spot ETF Trading? - CoinGape",
        "content": "Ethereum Price Forecast: The intense selling pressure impacting most cryptocurrencies has been caused by various factors including the German Government’s Bitcoin selling spree and a colossal transfer of BTC to exchanges by Mt. Gox, a defunct cryptocurrency exchange.\n\nInvestors appear worried as a major correction paints price charts in the cryptocurrency market red in July. Collectively, the market has in the last few months tumbled to $2 trillion from $2.8 trillion—a milestone achieved in March.\n\nadvertisement\n\nLike most cryptos, Ethereum could not withstand the increasing pressure on the sell side. The second-largest digital asset extended the correction below the critical $3,000 level.\n\nEther is down 7% to $2,940 on Friday in addition to 16.5% in the last seven days, CoinGecko data shows. Nonetheless, the trading volume has surged by almost 60% to $30 billion, underlining a dramatic increase in selling activity.\n\nEthereum Price Forecast: Is the Dip a Buying Opportunity or Trap?\n\nDespite the upcoming approval of Ethereum ETFs, bearish sentiment continues to swell. Investors thought the up rally to $3,975 in June marketed the beginning of a long-term bull run but it has in the last few weeks proved to be a trap.\n\nThe Securities and Exchange Commission (SEC) is currently reviewing individual Ether ETF applications ahead of the live trading. However, headwinds in the market are leaving no stone unturned while turning crypto portfolios upside down.\n\nWhile the actual trading of Ethereum ETFs would be a game changer, especially for altcoins eyeing a similar milestone, the ongoing dip has many worried about how far it can go.\n\nBased on the Ethereum price prediction, the token of the smart contracts now holds below all three key Exponential Moving Average (EMAs) including the 20-day, the 50-day, and the 100-day.\n\nChances are that the downtrend will continue into the weekend, considering the Relative Strength Index (RSI) persistent drop.\n\nShould sellers intensify their activities, Ethereum might breach a previously tested support at $2,800, highlighted in black on the chart. Such a move could further destabilize ETH price thus accentuating the sell-off to $2,500.\n\nThe Money Flow Index (MFI) an indicator that tracks the flow of money in and out of Ethereum markets, shows signs of bottoming out above the oversold region.\n\nIf selling pressure equalizes buying pressure, ETH will start to move sideways, giving recovery a chance in the coming days.\n\nA potential double-bottom pattern from support at $2,800 could also influence the trend reversal. The last time Ethereum price tested this support area, a major upswing erupted to $3,975.\n\nIn the short term, traders can watch out for the reclamation of support at $3,000 where, ETH could consolidate awaiting the next catalyst, possibly the spot ETF approval to ignite a major rebound past $4,000.\n\nFrequently Asked Questions (FAQs) 1. Is the Ethereum blockchain the same as Bitcoin? Although they are both cryptocurrencies, ETH and BTC do not share the same blockchain technology. Ethereum is a proof-of-stake protocol while BTC is a proof-of-work network. 2. Can Ethereum topple Bitcoin to become the biggest crypto? Possibly, but considering Bitcoin’s dominance in the market, this achievement would take a long time. 3. When will Ethereum ETFs start trading? ETH ETFs could start trading 3 days after the final S-1 filings. This is projected to be around mid-July.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxQcEJJajVjQkJJaWtKYWFkMHRoekRWZHg1YjJ4bE5kNEV2eE9fNjhKSDVHT0w5Nm5Hd0hCdWpMN3FGbS0wN0VwTWJ4Zk9iZVpqNnZ2OFh3cndKS0FmdU51TW1vSW0yMXFfbUF0QUQ5MXF5eUN0SFF0aERQWFZZTnItV1JtY3lfd1FYWnBvRWxkazgtX3lnblVGeFRnaUQ3RkMteGVESW9QdTNxWlF5WHBmT2hNNjBHOWU0UTJuUG9zNWwxbXY4ZTRoQzRtWkdzOGtXNXBN0gHYAUFVX3lxTE9qZkRLdVEzRVFGT1hxU3lKUkZaLWhrVWZ6YzRTOVI2djFRYjM2TWcxZ1UwaTJMbjZhaWFSVm45aU9MQ2pCTzZuYVljUi05WktObVJuV3BsbTBTaGRkN0trUmxoTHNxMzc4VkhCajNIUnAwSzM0S041dm9PVzZsUFRLXzhHZjk5bE1yVFBQNWRCMEdFYm8zdzEycmF4REhZMkgyaVN1TjJhYVRrcHpnQ3pmOEdRdmxkNjZUTWFYcWV2NW9FX1RlNG11eUx6MkFXbk1BbEtWOFZORA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ‘Near Guaranteed’ To Rally by Over 180% Against Bitcoin, According to Analyst – Here Are His Targets - The Daily Hodl",
        "content": "A widely followed crypto trader is expressing bullish sentiment on Ethereum (ETH) relative to Bitcoin (BTC).\n\nIn a new strategy session, pseudonymous crypto analyst Altcoin Sherpa tells his 217,800 followers on the social media platform X that the Ethereum/Bitcoin (ETH/BTC) pair is “still holding up pretty strong.”\n\nAccording to Sherpa, the ETH/BTC pair is currently in a “fine spot” for long opportunities amid the potential approval of spot Ethereum exchange-traded funds (ETF) by the U.S. Securities and Exchange Commission (SEC).\n\n“ETH to all-time highs is near guaranteed before the end of the year.”\n\nEthereum, which is trading at 0.05457 BTC ($3,142) at time of writing, would need to rally by around 187% to reach the all-time high of 0.15636 BTC recorded in November of 2021.\n\nMoving on to the crypto king, Sherpa says,\n\n“Price still in an overall high time-frame range between $73,000 – $56,000 but things of course look bearish in the short term.”\n\nSherpa concludes his analyst by says that a bullish phase could kick off around three months from now for altcoins.\n\n“Altcoins are continuing to sell off, I still don’t see any end in sight for that. I never understood why people thought we’d get some sort of alt season in the summer.\n\nI could maybe see it for ETH ETF bidding but you generally need a healthy BTC for this to happen. Still possible I guess but I’m still a bit pessimistic. I think it’s likely we continue to chop and chill for the next few months and then have a very nice Q4.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPRHV4eTVGVEhwdE5LbkRGWV84enNjZmdfYnhFMFQ3TEQyWTJQb0dXMnhMaFFiamJBd0JCS091LWRfNEZKelluUWxFRmlGQlBFOGc1WUN4emhDNWpXeW0yV1VxZkh4dU93V04ycVVIemVZbEd5YW1LbU50cUNVdmVPb25hR2FwUVoxRjgyUEZFRGtOanktbElQVzd1NXM5aUY1ZjE4X2pxbUowUTl4b3ZWMlJHWEt0QzlT?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "From discount to premium: a significant change for the Grayscale Ethereum Trust - The Cryptonomist",
        "content": "The Grayscale Ethereum Trust (ETHE), one of the largest investment vehicles for ethereum, has seen a significant evolution in its price compared to the net asset value (NAV).\n\nHistorically, the Trust has traded at a discount to NAV, but recently, in anticipation of the expected launch of a spot ETF, this discount has turned into a premium.\n\nFrom discount to premium: a significant change for the Grayscale Ethereum Trust\n\nThe transition from discount to premium is a significant event for the Grayscale Ethereum Trust. Until recently, ETHE was trading at a price lower than the value of its holdings in ethereum.\n\nThis phenomenon was due to a series of factors, including the structure of the trust, the dynamics of supply and demand, and market expectations regarding regulation and competition.\n\nAccording to YCharts data, on July 3, 2024, the premium over NAV reached 0.31%. This means that investors are willing to pay slightly more than the actual value of the assets held by the Trust.\n\nThis change has been gradual and silent, but it represents an important signal of the evolution of investor sentiment.\n\nVarious factors have contributed to the transition of ETHE from a discount to a premium. One of the most important is the anticipation of the launch of a spot ETF on ethereum.\n\nA spot ETF would be a financial product that directly tracks the price of ethereum, providing a simpler and more direct way for investors to access this cryptocurrency through traditional markets.\n\nThe introduction of a spot ETF could increase the demand for ethereum and for related products like ETHE. Investors might see the Trust as an early and safe gateway to the ETF, expecting the price of ETHE to benefit from the increase in demand.\n\nThe impact of the regulator\n\nAnother key factor is the change in the perception of regulatory risk. Historically, crypto products like ETHE have been subject to significant regulatory uncertainties. However, there have been positive signs of a more favorable attitude from the United States Securities and Exchange Commission (SEC) towards crypto ETFs.\n\nThe recent statements and actions of the SEC suggest that the approval of a spot ETF on ethereum could be more likely than it was in the past.\n\nThis has helped to reduce the perceived risk associated with ETHE, making it a more attractive investment and contributing to the shift from discount to premium.\n\nFor investors, the transition of ETHE to a premium compared to NAV has several implications. On one hand, it indicates greater confidence in the product and its future prospects. On the other hand, investors need to be aware that they are paying a price higher than the actual value of the underlying assets, which entails an additional risk if the premium were to decrease or return to a discount.\n\nInvestors must also consider the impact of the potential launch of a spot ETF on ethereum. If the ETF were approved, it could provide a more direct and potentially less expensive alternative to ETHE, which could influence the price of the Trust.\n\nThe future of ETHE and ethereum ETFs\n\nThe future of ETHE and ethereum ETFs is closely tied to regulatory decisions and the evolution of the crypto market. If the spot ETF is approved, it could mark a significant change in the way institutional and retail investors access ethereum.\n\nAccording to Grayscale, the challenge will be to maintain the relevance of ETHE in a market that could see the entry of new competing products. However, the company has demonstrated an ability to adapt and innovate that could help it navigate this new landscape.\n\nThe transition of Grayscale Ethereum Trust from a discount to a premium relative to NAV is a significant event that reflects changes in market dynamics and regulatory expectations.\n\nWith the anticipation of the launch of a spot ETF on ethereum, investors are showing greater confidence in ETHE, leading its price to exceed the net asset value.\n\nHowever, this change brings with it new risk considerations and opportunities, which investors must evaluate carefully. As always, the evolution of the crypto market will be influenced by a combination of regulatory, market, and technological factors, and the future of ETHE will be a crucial development to follow."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1wZjQ4Y1FONnNnWnZ2M19QWnE5U3kzbk5HeG9wQU1Qb3kxNWRmalJjanF3Q0xNZXd2dm1uUlU4T0FkRHpDcFM0bWY3WE5oaXllWUt2MnUyNHVTS2NJOFdJRTlmOHB1UW5ja2xmamtPWDZWSjFvUmFYRHk3MXo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Set for Speed Boost with EIP-7732 - TipRanks",
        "content": "Ethereum (ETH-USD) is set for a speed boost with EIP-7732. Vitalik Buterin, Ethereum’s co-founder, is pushing for faster transaction times, and this new proposal could be the key. EIP-7732 aims to make the network faster and more efficient, addressing a growing demand for speed and reliability.\n\nWhat Is EIP-7732?\n\nEthereum developers have introduced EIP-7732 to split the tasks of validators and create a committee to ensure transactions are timely. This proposal could overhaul the block validation process, enhancing both security and speed for the blockchain.\n\nHow Does It Work?\n\nThe core of EIP-7732 is the Enshrined Proposer-Builder Separation (EPBS). This idea breaks down block creation into two main roles: the consensus proposer and the execution proposer. The consensus proposer selects an execution proposer, who then produces a valid block with essential data like payments or block hashes. A group of validators, called the Payload Timeliness Committee (PTC), makes sure the execution proposer submits the block on time. This separation reduces the workload on validators and boosts the network’s efficiency.\n\nWhy It Matters\n\nValidators currently juggle both consensus and execution roles within a short time frame, often leading to delays. By splitting these tasks, EIP-7732 allows validators to focus on consensus first and defer execution, improving overall performance. Additionally, this proposal introduces a trust-free exchange between builders and proposers, ensuring payments and valid block inclusion without needing extra middleware.\n\nThe Impact on Transactions\n\nVitalik Buterin emphasizes that a good blockchain user experience relies on fast transaction confirmations. Thanks to previous upgrades like EIP-1559 and the Merge, Ethereum transaction times have dropped to between five and twenty seconds. EIP-7732 could make transactions even faster, rivaling the speed of credit card transactions. However, implementing these changes might require another hard fork, which could introduce backward-incompatible updates.\n\nA Simple Comparison\n\nThink of a busy coffee shop. You order a latte, but the barista has to take your order, make the coffee, and handle the payment all at once. This slows everything down. Now, imagine a system where one person takes the order, another makes the coffee, and a third processes the payment. Everything moves quicker, and you get your coffee faster. That’s what EIP-7732 aims to do for Ethereum.\n\nLooking Ahead\n\nEIP-7732 is like a breath of fresh air for Ethereum. By splitting the validation process and making transactions quicker, it’s set to make the whole network way better for everyone using it. These upgrades could make Ethereum more appealing to investors and developers, which means more people might start using it. And as more people jump on board, the price of ETH could go up. Faster transactions and smoother operations could attract lots of new users and projects, boosting Ethereum’s value in the long run.\n\nAt the time of writing, Ethereum’s price is $3,113."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQNDUxOElQMUNlcVI2WVFPQU05bnNPeGhsRm0yVFZERW9NWFRzaWdKdnRzUVVHbUpPZXBiUmJLOEcxcTRCTnoyaEpTR3BHN3hSOE1kMjJ1dndtTmJCdmFBYlE5Y2FWcXJ3QnQ2TUNFcHpxRXM5eU1rV1NHYnBlT1NFa3pFSk5OQTJXeEpORFBKYWJ3T0xWM3dTR2JWeUlUOVhqRG0wUkRmRXJJSjlUbzdMMTFqQXkzVDhCc1pqckJLUnVPUm5NX1FXT1Q2ODhTc2V2RG5sZ9IB2gFBVV95cUxQN2RSSWs2dUdsOFdpQ1lLaVU2dmtiZjNKVHZmVGxmVU1lR0FIVExlU29Fc0dRSld0RE4zRE5TTER5SWkxRGZYMlVyOFhraUpLSTA3RVQyZUctNU0wV0JFZTlLbW9HMjhzdXNBTnRScHZwdGxUQUFaQ0MzNGh3RkwzdkZ6UnA4RUZkd3ZRd0tac2pxeU9FbGZ4OC00YnZLTFNJY1d0UFI4LVpxSlp1Y0pkTmxxN1FmQjUtZmxyb1ZkMFgxdkVKQnJFcjgtMlVsdE1tZk0wNXYtcW9uZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "$2,728,000,000 in Fees Generated by Ethereum Blockchain Annually, Over 5x Above Closest ETH Rival: Lookonchain - The Daily Hodl",
        "content": "Leading smart contract platform Ethereum (ETH) generates far more revenue from fees per year than any other blockchain.\n\nNew data from crypto tracker Lookonchain reveals that the top altcoin earns $2.728 billion in fees per year, or more than 5x its closest rival, Tron (TRX), which earns $459.39 million annually.\n\nEthereum also earned just over twice that of Bitcoin (BTC), the top crypto asset by market cap, which came in at $1.3 billion during the same time frame.\n\nOther top fee-generating chains analyzed by Lookonchain include smart contract platform Solana (SOL) with $241.29 million in revenue per year, Binance Smart Chain (BSC) with $176.56 million, and layer-1 blockchain Avalanche (AVAX) with $68.83 million.\n\nFurthermore, ETH layer-2 scaling solutions zkSync Era, Optimism (OP) and Polygon (MATIC) came in with $59.77 million, $40.4 million and $23.91 million, respectively.\n\nEthereum users pay gas fees paid in ETH and denominated in gwei to successfully conduct transactions and execute smart contracts on the Ethereum blockchain. Gas fees depend on the supply, demand and network capacity.\n\nAccording to Ethereum data tracker Etherscan, the current leading gas guzzler is decentralized exchange (DEX) protocol Uniswap (UNI), which has consumed 129.17 ETH worth $401,815.53 over the last 24 hours.\n\nCurrently, the average gas fee on the Ethereum blockchain is 6 gwei, or $0.39, according to Etherscan.\n\nEthereum is trading for $3,119 at time of writing, a 5.4% decrease during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOZ3VYTU1XUTBfWFE0ZC1fcDczRjlWWElPOTdMeGQ5TmJFZHF0dy1PdmlmV2pDX1ZRQ25Fb054TkdHRWprWFlQMFJMQ0taVy1pNVg2Y2FVeDNqbDd1VGQ4TGIxV2plZWc0aGNQN2d4MDZYajM5c3pIclZTWGd5ZEFCbGRxN3k5eG9fY3JYcVVjQTJCTkpkN0FFZEtXemR0UXBMNTE3QkZlczhobGZ2S2ItMkx1aXVQbk9VOVIyT0dBX00wdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Solana Meme Coins Outperform Ethereum 800% YTD – Top Winners Revealed - TradingView",
        "content": "In the first quarter of the year, Solana-based meme coins have emerged as the frontrunners, surpassing Ethereum’s meme coin ecosystem and artificial intelligence (AI) tokens, according to a recent report by market data platform CoinMarketCap.\n\nThis shift in popularity signifies a change in dynamics within the cryptocurrency market, with meme coins gaining traction and challenging previously dominant narratives such as smart contracts, decentralized finance (DeFi), and non-fungible tokens (NFTs).\n\nSolana Ecosystem Dominates Growth Chart\n\nThe CoinMarketCap report highlights that the Solana ecosystem has consistently topped the growth chart for the past eight months, with over 20 new tokens introduced in Q2 alone.\n\nEthereum’s ecosystem followed closely behind with 14 new tokens, while Derivatives and Stablecoins witnessed relatively lesser growth with 5 and 4 new tokens, respectively. This surge in Solana-based token offerings indicates a growing interest in the network and its potential.\n\nSolana’s meme coin ecosystem, in particular, has gained significant momentum in price performance and popularity since October 2023. Although Ethereum remains the dominant blockchain, Solana’s growing prominence suggests a noteworthy trend in the crypto space.\n\nInterestingly, SOL memes have significantly outperformed ETH memes, delivering an average return of 8,469% compared to 962% for Ethereum, as seen in the chart below.\n\nNewsBTC\n\nAs “speculative capital” from other chains rushed into Solana, attracted by the explosive rallies of tokens like dogwifhat (WIF) and Bonk Inu (BONK), more meme coins experienced price surges, attracting additional attention and capital.\n\nThe top winners in the meme coin space include the cat characters MEW, POPCAT, and Book of Meme (MEME). These tokens have outperformed even the most popular ones like WIF, BONK, Ethereum’s Pepe coin (PEPE), and Shiba Inu (SHIB).\n\nNotably, political memes also emerged as a popular subcategory, with the leading MAGA (TRUMP) meme coin gaining over 5100% year-to-date, largely due to vocal support for crypto from former President Donald Trump and the acceptance of crypto for campaign donations.\n\nEthereum Tops Fee Income Rankings\n\nDespite Solana’s significant gains, Ethereum continues to dominate the Layer 1 (L1) smart contracts market, representing 62.11% of the major L1s. The report notes that Ethereum’s recent milestone was propelled by the SEC’s approval of Ethereum Spot ETFs.\n\nHowever, Binance Smart Chain (BNB) and Solana have also gained traction, adding $42 billion and $18 billion to their market share among L1 networks. Solana currently leads with over 1.6 million active daily addresses, followed by BNB with 1 million active addresses.\n\nIn Q2, Ethereum experienced record low gas fees, reaching levels not seen since 2020 due to the growing adoption of Layer 2 solutions and the market excitement surrounding Solana-based meme coins.\n\nDespite representing 62% of the market cap among major L1s, Ethereum accounted for 70% of the daily revenue, generating approximately $2.7 million. Solana ranked second with around $900,000 in daily revenue.\n\nAccording to Lookonchain, Ethereum topped the fee income rankings in the past year with $2.728 billion, followed by Bitcoin with $1.302 billion.\n\nOther notable networks include Tron ($459.39 million), Solana ($241.29 million), Binance Smart Chain ($176.56 million), Avalanche ($68.83 million), zkSync Era ($59.77 million), Optimism ($40.4 million), and Polygon ($23.91 million).\n\nDespite both platforms experiencing success in various financial metrics and growth charts, Solana’s native token, SOL, has significantly outperformed Ethereum’s ETH token.\n\nAs of the current trading price, SOL is valued at $143.25, showcasing a year-to-date growth of 650%. ETH has seen a more modest surge of 68% during the same time frame, currently trading at $3,310.\n\nFeatured image from DALL-E, chart from TradingView.com"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNTGh6T18xazV0anRJY21QRV92Vkp1TFgtVFVLY2V1TVBoTmQtWHU5empzWjQtbVUzRnhOVS1EOHdJS1lpUG1wc2JCZ2ZhaWtZNWhEWXVwU0tyejQ0aTEwQTFuZFpGOXRHOHZ5T2VHZEFkZHFHMzVTYlpMVHZPbDdhV2xTZWpCckpuZXRCVTRhc3BFbUo5TDNXbjhWNHBGVlpM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Developers Unveils EIP-7732 Designed for Speed - Crypto Times",
        "content": "Ethereum developers have proposed an exciting update, EIP-7732, which aims to overhaul the block validation process and accelerate the blockchain. This proposal introduces significant changes designed to bolster security and performance by bifurcating the process into consensus and execution stages.\n\nIn response to the ever-growing demand for efficiency, EIP-7732 aligns with Ethereum co-founder Vitalik Buterin’s advocacy for quicker transaction confirmation times. At the heart of this proposal lies the Enshrined Proposer-Builder Separation (EPBS), a groundbreaking method that splits block creation into two distinct roles: the consensus proposer and the execution proposer.\n\nImage Source: Farcaster (Vitalik Buterin exploring methods to enhance the confirmation speed of Ethereum transactions)\n\nUnder this new system, the consensus proposer selects the execution proposer, who then commits to generating a valid block pack or a block hash. Ensuring this block’s timely submission is a dedicated group of validators known as the Payload Timeliness Committee (PTC).\n\nBy segregating the consensus and execution layers, EIP-7732 aims to alleviate the computational burden on validators, thereby enhancing network efficiency and speed. Presently, validators juggle both roles in rapid succession, a process filled with potential inefficiencies and delays.\n\nEPBS promises a solution by allowing validators to immediately handle consensus and defer execution validation, all without compromising performance or security.\n\nMoreover, this proposal introduces a trust-free exchange mechanism between builders and proposers. This guarantees payment and the inclusion of valid blocks, eliminating the need for intermediary middleware. As Buterin emphasized in a recent post, “One of the important properties of a good blockchain user experience is fast transaction confirmation times.”\n\nThanks to the transaction fee overhaul of EIP-1559 and consistent block times post-merge, Ethereum’s transaction confirmation now ranges between five and twenty seconds. While this matches the speed of credit card transactions, certain applications demand even faster processing, far outpacing the current 12-second Gasper consensus mechanism.\n\nWith EIP-7732 under discussion, the promise of swifter transaction speeds seems within reach. However, this advancement may come with the necessity of another hard fork, introducing backward-incompatible changes."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5heW5TbFVoQnlNZWVFWmlYa0s4a2FBVnUxczh2ZVVHbE9YM2hDQXJZQVlacW9ITGxjVVRjSTRyR0NtSUJYaTV4OGNEVkkxRzIyZXZmZG00alh3Z2JqMm5mbjFpUDNOeko0QnplN2JrTGNNS0pBX2Zr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval: What it means for investors and the crypto market - Verdict",
        "content": "The US Securities and Exchange Commission (SEC) has approved an Ethereum exchange-traded fund (ETF), the second cryptocurrency to have an ETF approved in the US.\n\nLaunched in 2015 with the vision of being a “world computer”, Ethereum has gained interest from tech enthusiasts and investors alike, growing to a market cap of $350bn.\n\nAn exchange-traded fund, or ETF, is a type of investment that tracks a particular index, sector, or commodity that can be traded on a stock exchange like a regular stock. ETFs make it easier to gain exposure to cryptocurrencies. By investing through an ETF, investors avoid the complexities of holding crypto; like securing private keys or dealing with disreputable cryptocurrency exchanges.\n\nThe approval of a second cryptocurrency ETF in the US signals greater acceptance of the asset class and increasing regulatory clarity. Greater access combined with increasing regulatory clarity is likely to drive an increased demand for Ethereum.\n\nThe chart above shows the subsequent price rise of gold following the listing of the first gold ETF in March 2003. When gold ETFs were introduced, they provided an accessible and cost-effective way to invest in gold compared to buying physical gold.\n\nWhy were Ethereum ETFs approved?\n\nThe approval of Ethereum ETFs by the US SEC on May 23 2024, was unexpected, with many market analysts anticipating a rejection.\n\nHow well do you really know your competitors? Access the most comprehensive Company Profiles on the market, powered by GlobalData. Save hours of research. Gain competitive edge. View profiles in store Company Profile – free sample Thank you! Your download email will arrive shortly Not ready to buy yet? Download a free sample We are confident about the unique quality of our Company Profiles. However, we want you to make the most beneficial decision for your business, so we offer a free sample that you can download by submitting the below form By GlobalData Submit Country * UK USA Afghanistan Åland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Democratic Republic of the Congo Cook Islands Costa Rica Côte d\"Ivoire Croatia Cuba Curaçao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati North Korea South Korea Kuwait Kyrgyzstan Lao Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macao Macedonia, The Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territory Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Réunion Romania Russian Federation Rwanda Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Pierre and Miquelon Saint Vincent and The Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and The South Sandwich Islands Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates US Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela Vietnam British Virgin Islands US Virgin Islands Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Kosovo Industry * Academia & Education Aerospace, Defense & Security Agriculture Asset Management Automotive Banking & Payments Chemicals Construction Consumer Foodservice Government, trade bodies and NGOs Health & Fitness Hospitals & Healthcare HR, Staffing & Recruitment Insurance Investment Banking Legal Services Management Consulting Marketing & Advertising Media & Publishing Medical Devices Mining Oil & Gas Packaging Pharmaceuticals Power & Utilities Private Equity Real Estate Retail Sport Technology Telecom Transportation & Logistics Travel, Tourism & Hospitality Venture Capital Tick here to opt out of curated industry news, reports, and event updates from Verdict. Submit and download Visit our Privacy Policy for more information about our services, how we may use, process and share your personal data, including information of your rights in respect of your personal data and how you can unsubscribe from future marketing communications. Our services are intended for corporate subscribers and you warrant that the email address submitted is your corporate email address.\n\nIt has been speculated that the motivation behind the SEC’s decision is that crypto policy has become an election issue since Trump adopted a pro-crypto stance. However, the precedent set by the approval of Bitcoin ETFs in January was likely a key deciding factor in the SEC’s decision.\n\nOff to a bad start: Listings of the Ethereum ETFs are delayed\n\nDespite the approval, the listing of Ethereum ETFs has faced delays. This delay is unusual, as ETFs typically start trading immediately after approval, as was the case for the Bitcoin ETFs launched in January. Pending SEC approval of S-1 forms, trading is expected to begin mid-to-late July, although an exact timeline is uncertain.\n\nThese delays have tempered investor excitement and highlighted the ongoing challenges with crypto regulation. When trading does begin, the Ethereum ETFs will be welcomed into a cryptocurrency market experiencing a summer lull. Both Ethereum and the wider cryptocurrency market are down 30% since their highs in the first quarter.\n\nWhat we can expect when Ethereum ETFs are listed\n\nThe approval of Ethereum ETFs follows the successful introduction of Bitcoin ETFs in January, which exceeded expectations. On the first day of trading, the ETFs saw $4.6bn in trading volume and have since amassed a combined $76bn of assets under management.\n\nHowever, the success of the Ethereum ETFs is not a foregone conclusion. The mood of the cryptocurrency market is very different now from what it was in January, and while Bitcoin and Ethereum share similarities, they are also very different assets. With a fixed limited supply, Bitcoin is viewed as digital gold, whereas Ethereum, with a more technically ambitious goal of “world computer”, is often likened to digital oil.\n\nMore Crypto ETFs to come\n\nThe approval of the Ethereum ETF marks a significant milestone in the cryptocurrency market, reflecting the growing acceptance and integration of digital assets into traditional financial systems.\n\nWhile delays and regulatory challenges persist, the Ethereum ETFs are likely not the last cryptocurrency ETFs the SEC will approve. Indeed 21Shares, issuer of the fourth largest Bitcoin ETF, has already filed an application with the SEC for a Solana ETF."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNS094SnoxLUQ0ZXM1ZlNKSnJMOFhDMHB3NTc2bEdBczI0OFpjUktqaXM1bjZtNFAyWVA5a09Ia0dvQlJkY3VmY1hiTmMtOTlwdnBKUXQxdmFRQmFPM0xmX0NpNlpubXVOd2dfcnRJVktXNVE5NVZOaWtoRGFhRm9kN21EcmpPeDJWVkRyYzFaQVVpc0xJMDlDbFVzUDJxaVNGWjAyMTNCOVE2WWRDejM3Szk5UHZUTmJJUjdBWnU1UmVyc1dRUFhvMkFhelVQbWtmUnNj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "A conversation with Jerome de Tychey, President of Ethereum France, and Bettina Boon Falleur, Head of EthCC - DLNews",
        "content": "What are the long-term goals of Ethereum France, and how do you see the organisation evolving over the next five years given how quickly narratives and themes change in crypto?\n\nJdT: The long-term goal of Ethereum France has always been to educate the public about blockchain technologies, particularly Ethereum. Over the next five years, we aim to expand our presence in French-speaking regions, reaching as many people as possible to help them understand the transformative potential of this technology.\n\nCrypto themes and narratives change quickly, and we aim to be adaptable and responsive to the industry’s evolution. We’re also seeking to maintain momentum and motivation within our nonprofit organisation, so we have been recruiting for the past two years to bolster operations and ensure sustainable long-term growth.\n\nIn your opinion, what are the most promising use cases for Ethereum in the next decade? How is Ethereum France positioning itself to capitalise on these emerging opportunities?\n\nJdt: The scaling roadmap of Ethereum has already delivered cheap blockspace for new applications. In my opinion, the main waves of blockchain adoption are going to be gaming and social networks. These themes first emerged at EthCC, and we closely monitor their progress to inform the design of our conference tracks.\n\nA core focus at Ethereum France is to encourage the development of these emerging use cases, and to nurture the growth in interest and talent entering the blockchain space. We host monthly meetups where builders can showcase their latest developments and make information accessible to onboard newcomers into the space.\n\nEthCC has grown significantly since its inception. What are some of the key milestones and successes of EthCC over the years, and how has the conference evolved to meet the changing needs of the Ethereum community?\n\nBBF: EthCC has grown organically since its inception, evolving alongside Ethereum. Starting as a small gathering of enthusiasts, it now covers a broad range of themes and attracts a diverse range of industry professionals. We’re proud of the influential speakers and key announcements made on our stage, reflecting the conference’s importance in the industry.\n\nJoin the community to get our latest stories and updates\n\nNow in its seventh edition, EthCC expects more than 6000 attendees and 360 speakers, including at the EthVC programme, which serves as a crucial connection between startups and investors. While we’ve grown a lot in recent years, we maintain an open and welcoming atmosphere. We understand that the event is not just for engineers and developers anymore. Catering to all professionals, we have expanded our services to include networking zones and silent workspaces. We’ve also added childcare services this year, acknowledging the growing number of parents in our community who want to fully participate in the conference.\n\nThe agenda of EthCC covers a wide range of topics within the Ethereum ecosystem. How do you curate the content and select speakers to ensure that the conference addresses the most pressing and innovative topics in the Ethereum space?\n\nBBF: Curating content and selecting speakers for EthCC is indeed a challenging task that keeps us on our toes. There’s no magic formula; we spend the year closely monitoring industry trends to best understand what’s happening in the Ethereum space. Given the fast-paced nature of Ethereum, making these decisions eight months in advance is challenging, and it’s nearly impossible to predict everything flawlessly.\n\nWe encourage everyone to apply to EthCC, and each year we discover small projects and lesser-known researchers with valuable insights. We always try to balance well-known speakers and fresh voices. Importantly, we have a strict policy against accepting payments for speaking slots. While this complicates things—especially when companies try to pressure us—it ensures we maintain high-quality speakers. Our reviewers do an extraordinary job, thoroughly reading every application and making selections based on merit. They avoid choosing speakers solely based on fame or rejecting them due to obscurity, ensuring a comprehensive agenda across different tracks."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOX0VoT2ZHXzNWUVdBOHFTRzBjVktudHpDZmh0SmlHUWNzandZR1I4MzJRNjllVTU0VjV4NmVWOW5CTXJFSm1GVG1iOXltRUdMM191b01zb0hWTEkwaVEwZ2V4OHBuY0tIVG1Pdkw3QnJ1bDlHMU8xUlZBVndSaVZTV2M3Y1duYlUtb203ZlpCSWNIeFZqVVRlLW96Z1dTV2tuZll0WUM0OGVaOTRP?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Could Drop Below $2,500 as Market Volatility Intensifies - Crypto Times",
        "content": "Ethereum prices are facing heightened volatility amid market turmoil. The oldest whale moved millions to Coinbase, raising fears of a massive sell-off. This movement has stirred the crypto market, especially after Bitcoin’s sharp decline below $53,500 in early trading.\n\nAt press time, Ethereum was trading at approximately $2,951.71, after reaching a daily low of $2,834, according to CoinStats.\n\nETH/USD 24 Hour Price Chart (Source: CoinStats)\n\nSignificant Bitcoin transfers from the Mt. Gox cold wallet and the German government’s address have intensified panic. Traders are on edge, expecting selling pressure from wallets holding vast amounts of BTC and in turn on the overall crypto market.\n\nMarket Indicators Signal Potential Decline\n\nDespite the declines, Ethereum remains above a key support zone, viewed as the last line of defense before a significant drop. Future markets indicate ETH’s price within a bullish range, with Open Interest (OI), monitoring total open positions in contracts, showing a major flush has yet to occur.\n\nRecent pullbacks brought ETH close to $2800, yet OI data suggests potential for further decline. The bearish outlook may intensify, risking a break below $2500, which could trigger mass liquidation as derivative contracts close.\n\nYou would think that but then you take a look at $ETH OI in coin terms and you realize that's not actually the case.\n\n\n\nWhen we look at OI in coin terms (below) we can see that the big flush on positioning hasn't actually happened yet- OI has just dropped in $ terms because price… https://t.co/EiWwbThRBn pic.twitter.com/bZ1vDflFmq — CrediBULL Crypto (@CredibleCrypto) July 5, 2024\n\nThe exit of open interest from the Ethereum ETF approval, valued at $3.5 billion, adds to the potential downside risk if prices exceed $2800.\n\nStruggling to Maintain Support Levels\n\nCurrently, Ethereum battles to reclaim the crucial support zone around $3000 with a daily price dip of 5.28% at press time. A daily close within or above this range might stabilize prices and prompt recovery. However, ongoing market fear, uncertainty, and doubt (FUD) could drive Bitcoin to $52,000, dragging Ethereum below $2700 over the weekend.\n\nTraders closely watch these levels, as a failure to hold support could lead to further significant losses.\n\nEthereum’s market position is precarious, with crucial support levels under threat. The coming days are critical, as market dynamics could either stabilize or further disrupt ETH prices."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPeGZONFlMNjVoQzllZHAzTkUtbHU3TTNLdmJBTUZzbXZGQ0hKSzFvN2t3SWZtcktXM2lUVmF6VmJZc2RFRjZobV8yOV92dk5tQlotTk12ZUVoemcwcWN4N2JKbHhsQVFjaDlsdVBBcjdPT2VXREFxVXU3YkRkZnFrQlZTU1hIa2N4THRjSGZMTHpsQ21Rc2swUXRsZVFQdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Crypto Heist in GTA 6? Bitcoin, Ethereum Rumors Swirls Again - Crypto Times",
        "content": "Rumors that the highly anticipated Grand Theft Auto 6 will utilize cryptocurrency have been circulating for more than a year now—and they’re swirling again. Recent claims by a popular Crypto Twitter influencer have reignited speculation, but as of now, there is no official confirmation.\n\nThe Source of the Rumors\n\nOn Wednesday, a pseudonymous Crypto Twitter influencer called Gordon—apparently named after Gordon Gekko from the iconic 1987 film “Wall Street”—shared with his nearly 500,000 followers that “GTA 6 will enable cryptocurrency payments,” and that “so far only Bitcoin, Ethereum, and USDT are confirmed.” This tweet quickly went viral, garnering over 500,000 views in just a few hours.\n\n🚨GTA 6 will enable crypto currency payments.\n\n\n\nSo far only Bitcoin, Ethereum and USDT confirmed 😳 pic.twitter.com/MoYQoppH5z — Gordon (@AltcoinGordon) July 3, 2024\n\nThe tweet by Gordon also included a fake trailer for GTA 6, which contributed to its virality. When asked for sources, Gordon humorously replied that his “uncle works there,” or dismissed previous reports as outdated. This playful attitude did little to quell the excitement and speculation among fans and crypto enthusiasts.\n\nDespite the buzz generated by Gordon’s tweet, there has been no official announcement from Rockstar Games or its parent company, Take-Two Interactive, regarding the inclusion of cryptocurrencies in Grand Theft Auto 6. Official trailers and announcements have made no mention of any crypto elements, and Rockstar Games has not responded to inquiries on the matter.\n\nPrevious Rumors and Speculation\n\nThis is not the first time rumors about cryptocurrencies in GTA 6 have surfaced. Earlier speculation in May 2023 suggested similar possibilities, and the game’s first official trailer, which leaked last December, featured a “BUY BTC” stamp—though this was likely added by the leaker. Despite these hints, there has been no substantial evidence to confirm these rumors.\n\nPotential Impact of Cryptocurrency in GTA 6\n\nThe idea of integrating cryptocurrencies like Bitcoin and Ethereum into GTA 6 is tantalizing for many. If such features were implemented, it could represent a significant step forward in the mainstream adoption of cryptocurrency within the gaming industry. This potential has fueled much of the ongoing speculation and interest.\n\nWhile the rumors about Bitcoin and Ethereum in Grand Theft Auto 6 continue to swirl, they remain unconfirmed at this time. For now, fans will have to wait for official news from Rockstar Games and hold on to their excitement as the game’s 2025 release date approaches."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNSkxUdnpBU01IY2lobERjN2VhV1l5dWY1UmJsSkh4Q2ZVem1ySmN3QktvVndlZzlsUmV0U2k4aEFNMmZaWUxtMnZ2UnpTUUg3cWctVUhZenlubEhNNjUtNldMelY1bkxyTXBuMmR2cVp5RVhnMkNpSVpVcEQ3eVVsYzJXcmRkcm8tNlRXWXVYdWhuYUN6ajd4R1FB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin vs Ethereum: A Battle of Titans for Blockchain Revenues - Cointribune EN",
        "content": "Thu 04 Jul 2024 ▪ 3 min read ▪ by Fenelon L.\n\nThe race for revenue in the crypto universe is intensifying, with Ethereum taking a considerable lead over its historical rival, Bitcoin. Ether generated $2.728 billion, while BTC followed with $1.302 billion, illustrating a new dynamic in the blockchain ecosystem.\n\nEthereum dominates the Blockchain revenue landscape\n\nThe Ethereum blockchain has established itself as the undisputed leader in terms of fee revenue, surpassing Bitcoin. Its exceptional performance of $2.728 billion over the past year illustrates its dominance in the Decentralized Applications (dApps) and smart contracts ecosystem.\n\nThe first quarter of 2024 proved to be particularly lucrative for Ethereum, with its revenue reaching $365 million, marking a remarkable year-on-year growth of 155%. This spectacular rise is mainly due to the boom in innovative sectors such as decentralized finance (DeFi) and non-fungible tokens (NFTs).\n\nEthereum’s transaction fee revenue reached a record high of $1.17 billion in the first quarter, marking an 80% increase over the previous quarter.\n\nBitcoin: A giant that remains in the race\n\nAlthough surpassed by Ethereum in terms of revenue, Bitcoin maintains its position of strength with $1.302 billion generated through transaction fees.\n\nThe introduction of Bitcoin Ordinals has played a crucial role in this performance, leading to a notable increase in transaction fees. Furthermore, the Runes technology has contributed significantly, accounting for up to 68% of Bitcoin transactions since the last Halving.\n\nDespite its primary function as a store of value and medium of exchange, Bitcoin proves its ability to generate substantial revenue. This resilience testifies to its growing adoption and persistent importance in the crypto landscape, beyond its status as a benchmark digital asset.\n\nIn sum, the future looks promising for these two leading cryptos. With the imminent launch of Ethereum ETFs and the continued growth of the Bitcoin ecosystem, analysts foresee significant capital inflows in the coming months.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOOWRWSkxfbXlubFEtNVp0ZVhzN3BPWHRSUHlYclUwS3RPTmJrcnVYdzdJbjBQeGR5LWxHSTNHaHBJbkNKcGdhdU1BRzc3dlVJRDVEelJCVF83Y0hpWldidTRHY3NmX2dGdkhSZkN1cmw1bVRvRUVoODdUY0F5bkVqMTVkY0tGSGVINGk4X0E2MEczckdONVJaWWtSQ0g3dWNob2I0aDhISQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Dropped Following Bitcoin’s Crash, What’s Happening? - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum’s price drop has breached critical support levels and fallen below the $3,000 mark as the crypto market collapses. Will the decline go further this weekend?\n\nWith a bullish close last Sunday and a 1.75% rise, the investors did not anticipate a crash this week. However, the release of the Mr. Gox Bitcoin payout has caused the crypto market to plummet to critical levels.\n\nThe massive payouts from the 2014 Mt. Gox security breach have increased supply pressure across the broader market. As a result, the crypto market experienced massive declines.\n\nAs buyers struggle to absorb the selling pressure, Ethereum (ETH), has fallen below the $3,000 mark. With this, Ethereum’s price struggled to find support amidst the market crash. Despite HODLers’ hopes for a quick recovery, ETH has fallen below the critical level. With a 16.42% drop this week, bearish patterns and signals still show on the Ethereum price chart.\n\nThe overpowering bears have initiated a decline with an evening star formation, aiming to restest the $3,460 range breakdown.\n\nOver the past four days, including a 6% intraday drop, ETH has broken below a long-standing support trendline, falling 16% in total. This decline has also affected major altcoins and meme coins like Solana, DOGE, and SHIB, which have each seen a drop of 15% or more this week.\n\nWith the increasing moment, the trendline breakout has pushed Ethereum (ETH) to its next support level at $2,875. Additionally, this decline has triggered a bearish phase in the MACD and signal lines, now below the zero lines.\n\nMeanwhile, a whale recently caused a massive stir in the crypto market by dumping 26,600 ETH valued at $82.5 million to repay debt on Aave, resulting in a 3.4% drop in Ethereum’s price. Following this, the whale created a new walley and borrowed 80.9 million USDT from Aavve to purchase 26,235 ETH priced at $3,084.\n\nAt press time, Ethereum (ETH) is trading at $2879, reflecting a 9.70% decrease in the last 24 hours."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQSVFKaVhEMk50YlNDaktOd0RnY0o4M29TT2x1QjFrazVtSkRUOVRRV3prWFlmNENYeDNmTm5xMExkVzREOFNnSGoycFNhbzdFZzNCWXlpY0paMkdmVXF2V25TTzMyN0xCT3U4OU5aVXd5ZUhoaUo0Sy1oWk9Wd0t6alowM2FNODg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Crypto - Ethereum ETF: Launch Imminent on July 15th? - Cointribune EN",
        "content": "Thu 04 Jul 2024 ▪ 3 min read ▪ by Eddy S.\n\nIn the dynamic landscape of crypto, a new advancement is about to materialize with the imminent launch of an Ethereum ETF. According to the latest updates, Bitwise has filed an amended version of its S-1 form with the SEC! Signaling a decisive step towards the introduction of a spot Ethereum ETF as early as this July.\n\nIs the Ethereum ETF arriving this July 15?\n\nThe ETF, which allows investors to access Ethereum without directly holding the crypto, is eagerly awaited by the financial community. Analysts predict that SEC approval could come as early as mid-July, with a potential target date set for July 15. This anticipation is based on the recent update of Bitwise’s S-1 form, which includes a fee waiver for the first six months up to a cap of 500 million dollars.\n\nNo one really knows why the SEC is taking their sweet time with these, given how light comments were, these could have easily been trading by now. Could be one 'problem' issuer slowing down process or just summertime lazy/ppl on vaca. Not sure. That said, all indications launch… — Eric Balchunas (@EricBalchunas) July 3, 2024\n\nThe SEC, which already gave the green light to spot Bitcoin ETFs earlier this year, appears ready to extend this approval to Ethereum. This represents a significant evolution for crypto, as Ethereum is often considered to have higher growth potential due to its extensive applications in decentralized finance (DeFi) and smart contracts.\n\nA launch eagerly awaited by the crypto community\n\nThe launch of the Ethereum ETF by Bitwise could mark a turning point for crypto investment. It will offer a new regulated and simplified path for institutional and individual investors. This could also signal increased recognition of the value and legitimacy of digital assets in the traditional financial system.\n\nAs the probable launch date approaches, the industry is closely monitoring the developments. If everything goes as planned, Bitwise’s Ethereum ETF could very well be the catalyst for a new era of crypto investment, accessible to a broader audience and integrated into the global financial framework.\n\nThe launch of the Ethereum ETF by Bitwise is a highly anticipated event that could transform the crypto investment landscape. With the SEC poised to give its approval, the financial world is on high alert, ready to welcome this new era of financial innovation.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNdlkzOHB5dTlwdVhRbkl0Yk1ldWExc093OE51dzhwbm9QNHVCYXFaQlNjcGtRQnNkSFZOclpoQVZiTzZtU1pDVmlmdWIxaHhGc1ZhbEtLSUxOczVYem5oVFFyVFVIcWtKY1JwOG15QWpSeVViZG5DV1JGNHA2V2dQbjJoTHNjMlJuS1Jsa0FfTzhsM1VhdE9xN2NB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Mt. Gox shakes up the crypto market: $580m liquidated in a few hours - Cointribune EN",
        "content": "Fri 05 Jul 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nA shockwave has shaken the world of crypto. In a matter of hours, Bitcoin plummeted by 8%, Ethereum tumbled by over 10%, and millions of dollars in long positions were liquidated. As traders try to understand the reasons behind this sudden downfall, concerns are growing over the significant movements of funds related to Mt. Gox, the defunct exchange platform.\n\nA Steep Dive for Bitcoin and Ethereum\n\nThe crypto market was hit by a wave of $580 million in liquidations, a direct consequence of an 8% drop in Bitcoin and similar declines for Ethereum, Solana, and Dogecoin. Long transactions on BTC and Eth saw losses exceeding $380 million, with the largest single liquidation observed on Binance, where an Ethereum transaction worth $18.4 million was forcibly closed.\n\nThese massive liquidations result from highly leveraged positions that traders could not maintain in the face of sudden price drops. Data from Coinalyze shows that this situation led to one of the largest waves of liquidations of the year. Moreover, open interest, which measures the number of unsettled bets on futures contracts, fell by 12%, signaling a capital outflow from the market. This increased volatility reflects a sense of panic among investors, exacerbated by external factors such as the movements of funds related to Mt. Gox and government decisions influencing the market.\n\nMarket dynamics, regulatory developments, and macroeconomic factors all play critical roles in Bitcoin’s price movements. Staying informed and agile is key for those involved in the market. Nickolas Hoog, VP of Marketing at BitMart\n\nThe Role of Mt. Gox and Other Trigger Factors\n\nIn anticipation of repayments to creditors, Mt. Gox transferred more than $2.7 billion in bitcoins to a new address. This move has sparked fears of increased selling pressure, amplifying the price drops.\n\nAt the same time, the German government’s decision to liquidate a portion of its bitcoin holdings added a layer of uncertainty to the markets. Traders, already nervous about macroeconomic uncertainties and the upcoming U.S. presidential elections, reacted by massively selling their positions. This massive liquidation caused significant losses for overleveraged positions, particularly on platforms like Binance, where an Ethereum/USDT transaction of nearly $19 million was liquidated.\n\nThis increased volatility and price drops have generated a sense of fear among investors, with the fear and greed index plunging to alarming levels. The outlook for the market remains uncertain in the short term, with analysts anticipating a challenging third quarter, marked by increased investor caution and persistent volatility.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNS3ZlMEdNYnVidEJzYnRpU3hmSkh6LTBuVWFqVXY5dnoxUDRnbTFYWXVlUmNNX0R1Z3NIYUpWcXpiRFlTMk9RTFYzeTZFTUFJQ1RqUGFmdUE3aFpkeHY0SXgyaVZlSnlPWGlsMndPSWdseUxlbkRSV0xXUlBPa0QtQ204R0pSR21xSUsxLTU3YUpvYVpqeVY4OWlfLVNZVWRiaHpNMTRJVVllZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Bitwise Files Amended S-1 for Ethereum ETF Ahead of Launch Deadline - Crypto Times",
        "content": "Bitwise Asset Management has submitted an amended S-1 form to the Securities and Exchange Commission (SEC) for its proposed Ethereum exchange-traded fund (ETF). This filing, completed on Wednesday, came just days before the July 8 deadline\n\nFollowing this development, Bloomberg ETF analyst James Seyffar predicts that Ethereum ETFs, including Bitwise’s offering, could begin trading within the next two weeks.\n\nUPDATE: We've got another amended S-1 from @BitwiseInvest for their #Ethereum ETF. Expect more from other issuers throughout the rest of the week. We're thinking these things could potentially list later next week or the week of the 15th at this point. pic.twitter.com/xqVlt9lSGy — James Seyffart (@JSeyff) July 3, 2024\n\nOn May 23, the SEC approved 19b-4 forms for eight spot Ethereum ETFs, including Bitwise’s product. However, issuers must also have their S-1 statements declared effective before trading can commence.\n\nMoreover, Bitwise’s updated S-1 form includes several revisions, most notably a fee waiver for the first $500 million in assets under management. However, the firm has not yet disclosed the fee structure that will apply after this threshold is reached. This competitive pricing strategy aims to attract initial investors to the product.\n\nFor instance, VanEck and others are offering similar waivers implying competition among these new financial instruments available for investment purposes. These moves suggest that companies are taking initiatives ahead of entering the market as expected.\n\nBloomberg ETF analyst James Seyffart noted that multiple issuers are expected to file amended S-1 forms throughout the week, indicating a coordinated effort to meet regulatory requirements."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOQjg4bWlrQ1gxZUtYT2NSUmI0dFN6TUozVGNJR1B3djBUTmxNSVVYQ0ZoYXJ6YWt4NFFySHBfWW1qZkpHWllKelR1NndOdGhlN19BTFBiNW9XQ1lTWXJZMERuRUI3aTF2VGNNWUtBTjVDTU0yek1nVGNIb29RSlY1UXo5cE1naUdteEtRRTFYaWs3bTZ2T3UxVy0zbzZIUUFodGhKWTl2LVRxU3BmcDJEa3lqQXliWlR2YWZHZtIBwgFBVV95cUxOTk1MbUFPR0hqeGl0NVhteUpZMzk2VG1XSGR3b0thVXNkc0xlNGpsY3hLdkhMRTZoOTRTSWRNY0Ewd0VRdEZoeXpqXzdIbUQzZ2F0N3l0eHhYY3hpekJwcEVWYWMzanpCWjdscmVlTEV5YkVPQ2F4Y3Y0eHFFVTJjeWhfWFZnU3hQOVFuZHpvMEdObXBVT195QnRnUDhwUEVjYmEyT0Fwdk9mem8zbGRCYmpRMENUMnhwakpMUGhMZmdHZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Here’s the Most Probable Level for a Recovery After ETH Crashes 5% Daily - CryptoPotato",
        "content": "As Ethereum’s price continues to trend lower, investors are wondering whether the bull market is over. Yet, there is still a key support level that can provide the staging grounds for a recovery.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily chart, the price has been trending lower inside a large descending channel pattern. In the last few days, the market has failed to reclaim the $3,500 level, and it dropped lower following a bearish rejection.\n\nCurrently, a decline toward the $3,000 support level, which coincides with both the lower boundary of the channel and the 200-day moving average, could be expected.\n\nWhile this confluence of support elements makes $3,000 a strong support zone, if it gets broken down, things can get much worse very quickly.\n\nThe 4-Hour Chart\n\nThe 4-hour timeframe shows a clear picture of the price’s rejection from the $3,500 resistance level. The $3,350 short-term support zone is also getting broken to the downside, making $3,000 a probable upcoming target for ETH.\n\net, investors should keep an eye on the RSI, as it has entered the oversold region, which could point to a potential recovery soon.\n\nSentiment Analysis\n\nBy TradingRage\n\nTaker Buy Sell Ratio\n\nAnalyzing the futures market metrics for Ethereum can be a great complement to price analysis. This chart demonstrates one of the most useful futures market metrics, the Taker Buy Sell Ratio.\n\nIt measures whether the buyers or sellers are more aggressive in executing their orders on aggregate.\n\nAs the chart demonstrates, following the rejection from the $4,000 level, a huge volume of market sell orders has been executed in the futures market, bringing the Taker Buy Sell Ratio to its lowest value in the past few months. This indicates that futures market traders believe the price will be dropping even lower in the short term."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOREh5M0wwVll4U095X1laWlJKeGM2RVdwSUdFSVR5LXI1anZicnVjZWstRk9vVVNLU29nTUdEZ0kzb1ZkZ0V0enRmUFZaUTc1a1d2VHAzb1JNd3pPTVVPYjBEYWxMb2VQUHBnVHZQSUFXbjhscHlkNUtpNWJEOUhzZm1OUkFYT2VmNUhBY0cyczRoSXMycXh6REZrV1Myb05VQ3BBR0pMeGVOQdIBrwFBVV95cUxPV0h0TmViWW1JZWJ1MXFnVVBNcnRTNE5Qb1ZGcHlEYVhxZ1hpal91T2tiMTdjaGlpUkNTTlF3WW45SURhbW1qYkNnS0xfRVNYQmNodXVsaTJnT09VVGdMQ1NWM1dwRHpHS0lvOUNyN25zUm1XeEgxVjJjZmtHcTlsMDBzd1RMTnFydGdBTkZvRVFOcXV3ektyeHdtZHZ1WWpVd1lYakNsX2N3VjJaLW13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Predictions: ‘Buy the Dip’ Opportunity or Further Pain for Bulls? - CryptoPotato",
        "content": "TL;DR\n\nEthereum (ETH) has faced significant declines, currently around $3,200, but some analysts remain bullish, predicting potential rebounds and an all-time high of $8,000.\n\nThe upcoming launch of spot Ethereum ETFs, expected to attract $3-$5 billion in net inflows, could boost investor confidence and drive ETH’s price higher, similar to the impact seen with spot BTC ETFs earlier this year.\n\nWhat’s Next for ETH?\n\nEthereum (ETH), similar to many other leading cryptocurrencies, has been severely affected by the latest market correction. Its price currently hovers at around $3,200 (per CoinGecko’s data), representing a 5% daily decline and 15% on a monthly scale.\n\nAccording to some industry participants, though, the negative trend may soon be replaced by a fresh uptick. The X user Poseidon claimed the “future is bright,” and ETH is poised for an all-time high of $8,000.\n\nCaptain Faibik was also bullish, forecasting that the price of the second-largest cryptocurrency “will bounce back hard,” meaning it currently offers a great “buy the dip” opportunity.\n\nOn the other hand, there are some worrying signs that Ethereum’s freefall may continue in the coming days. The popular crypto analyst, using the X handle Crypto Tony, claimed that everything would be under control as long as ETH’s valuation remains above $3,270. The asset lost that resistance level a few hours ago.\n\nWaiting for the ETF Launch\n\nOne important factor that could place ETH back into green territory is the launch of spot Ethereum ETFs (expected this month). Recall that the US Securities and Exchange Commission (SEC) approved multiple such products earlier this year, but they are not yet live.\n\nAccording to crypto exchange Gemini, the official introduction of spot ETH ETFs in America could attract net inflows in the range of $3-$5 billion within the first six months of trading. The move might improve the asset’s market position, moving it closer to the leader Bitcoin (BTC), the analysis reads.\n\nSpot ETFs will make it easier for traditional investors to gain exposure to Ethereum without needing to hold the cryptocurrency directly. This removes some hurdles, such as self-custody, for example.\n\nThe launch of those products could also be seen as a positive signal for the legitimacy and acceptance of ETH and the broader cryptocurrency market. As a result, investor confidence could be significantly boosted, leading to a potential fresh flow of capital and a subsequent price rally.\n\nRecall that the US SEC greenlighted spot BTC ETFs in January this year. The price of the primary digital asset hit an all-time high of over $73,500 approximately two months after that."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQQkhuWDZJVlprZ1ZieVUyQ3M0OU8ycXMzLU1tS2VZMzIzbWpXOTFEOTFiUHdSTjFPdHJWS3FQZkI2Z2pfNk03V2xEUXczeFU4Mk1NNHAtVU5fUkZjczVBT3N6LXlGcTRlY3dqNkxDa3BDN1Uyb2dFTnFUbkQ0eGkxSXJhU3o1bWc1bmtQeU9Na3hUYzAycGI5TVVzUEJ4bGp1dEdVdEMzaVNyNElLZ0hYUUctUHNvZUtSZ0NuNkJmdGJjNjVteFZVaVp4TGVtY3V6bDJvbm9n0gHbAUFVX3lxTFBRY091VUtBSjFGUzk4UDltMHNUczNHeHh4SEs2NXJxRmJCQjQ3V01HVHR6MDNoYTZYdnlnSXdva3BvbjNCNWZaeTR5QlpQOWhCUE1vMUxFcHQxcDVHREpUd2hQVHdrRjh2REVPaTI1Rjctb1RpbG1idnR5YmNnU0g4eC1vUC1tWVF2LTF0TUFldThNZmV3dV9XNDR1eFFOcUNFS1FTWGV3Y1dpN0FyVFhaM1M4MHZuTGpYRWlhRnJIX0l4c0FBSVBwV3U5OFdQYWZ4a3VrNUpFY3lOZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin falls below $56,000 level - FXStreet",
        "content": "Bitcoin price breaks below the weekly support level at $58,375, signaling a bearish move.\n\nEthereum price fell below $3,240, its daily low on June 24, indicating a shift in the market structure from bullish to bearish.\n\nRipple price trades below the weekly support level of $0.413, indicating a bearish trend ahead.\n\nBitcoin (BTC) breached the weekly support level of $58,375 on Thursday; as of Friday, it is trading 2.8% lower at $55,314. Ethereum (ETH) and Ripple (XRP) have dropped below crucial support thresholds, suggesting a potential downtrend for these assets in the coming days.\n\nBitcoin price breaks below the weekly support level at $58,375\n\nBitcoin price encountered resistance at the daily level of $63,956 on Monday, resulting in a 9.2% decline over the next three days. By Thursday's close, it had fallen below the weekly support of $58,375. It is trading around $55,314 as of Friday, reflecting a further decrease of 2.8% from the previous day's level.\n\nIf BTC's price closes below its May 1 low of $56,522, it could decline 7.3% to revisit its daily support at $52,266.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator (AO) on the daily chart support this bearish thesis, as both indicators are below their respective neutral levels of 50 and zero. This suggests continued momentum favoring bears, potentially leading to a further decline in the Bitcoin price.\n\nBTC/USDT daily chart\n\nHowever, if BTC closes above the $63,956 daily resistance level and forms a higher high in the daily time frame, it could indicate that bullish sentiment persists. Such a development may trigger a 5% rise in Bitcoin's price to revisit its next weekly resistance at $67,147.\n\nEthereum price falls below $3,000\n\nEthereum price was rejected by the descending trendline on Monday, resulting in an 11% decline over the next three days. By Thursday's close, it had fallen below its June 24 low of $3,240, now revisiting its May 1 low of $2,817.It is trading around $2,914 as of Friday, reflecting a further decrease of 4.4% from the previous day's level.\n\nIf ETH's price closes below its May 1 low of $2,817, it could decline 6.5% to revisit its daily support at $2,621.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator (AO) on the daily chart support this bearish thesis, as both indicators are below their respective neutral levels of 50 and zero. This suggests continued momentum favoring bears, potentially leading to a further decline in the Ethereum price.\n\nETH/USDT daily chart\n\nOn the other hand, if Ethereum's daily candlestick price closes above $3,524, forming a higher high in the daily time frame, it could indicate that bullish sentiment persists. Such a development may trigger a 5.6% rise in Ethereum's price to revisit its high of June 9 at $3,717.\n\nRipple price trades below the weekly support level of $0.413\n\nRipple's price encountered resistance at the daily level of $0.499 on Tuesday, resulting in an 11% decline over the next two days. At the time of writing, it trades 8.7% down at $0.393, below the weekly support level of $0.413.\n\nIf XRP’s daily closes below $0.413, it could crash 15% to revisit its March 12, 2023 low of $0.347.\n\nThe Relative Strength Index (RSI) and the Awesome Oscillator (AO) on the daily chart support this bearish thesis, as both indicators are below their respective neutral levels of 50 and zero. This suggests continued momentum favoring bears, potentially leading to a further decline in the Ripple price.\n\nXRP/USDT daily chart\n\nConversely, if the Ripple price daily candlestick closes above $0.499 and forms a higher high in the daily time frame, it could indicate that bullish sentiment persists. Such a development may trigger a 6% rise in Ripple's price to revisit its high of June 5 at $0.532."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxPanB3dVRpT3pqTTFIZWVCOGk0dHp3R1BSYTgyWk52a081WUo5YV92VWpZY0ZtZEszQTlMeEJKeGU5VGxaa25xMHlMd2lXUVZJZ0lmYzhIRUxxRVdKNXcwMGhuTEtpd3Zjbjl6T2Z3b0ctWnhweFBrUFJEb0dNZHFtVTllU0wxR3Frbm1iN2F2Z1ViTFB6b1Q5R0stbFpMdzFneXZTeFIxLXhjbWdQWk1DYWJIVW1DaEl3UkRlQTZlQXF5OVZWMks2U1RJcTRoN2VXdkJnODc4cHhwQjg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Predictions: ‘Buy the Dip’ Opportunity or Further Pain for Bulls? - TradingView",
        "content": "TL;DR\n\nCryptoPotato\n\nWhat’s Next for ETH?\n\nEthereum (ETH), similar to many other leading cryptocurrencies, has been severely affected by the latest market correction. Its price currently hovers at around $3,200 (per CoinGecko’s data), representing a 5% daily decline and 15% on a monthly scale.\n\nAccording to some industry participants, though, the negative trend may soon be replaced by a fresh uptick. The X user Poseidon claimed the “future is bright,” and ETH is poised for an all-time high of $8,000.\n\nCaptain Faibik was also bullish, forecasting that the price of the second-largest cryptocurrency “will bounce back hard,” meaning it currently offers a great “buy the dip” opportunity.\n\nOn the other hand, there are some worrying signs that Ethereum’s freefall may continue in the coming days. The popular crypto analyst, using the X handle Crypto Tony, claimed that everything would be under control as long as ETH’s valuation remains above $3,270. The asset lost that resistance level a few hours ago.Waiting for the ETF Launch\n\nOne important factor that could place ETH back into green territory is the launch of spot Ethereum ETFs (expected this month). Recall that the US Securities and Exchange Commission (SEC)approvedmultiple such products earlier this year, but they are not yet live.\n\nAccording to crypto exchange Gemini, the official introduction of spot ETH ETFs in America could attract net inflows in the range of $3-$5 billion within the first six months of trading. The move might improve the asset’s market position, moving it closer to the leader Bitcoin (BTC), the analysis reads.\n\nSpot ETFs will make it easier for traditional investors to gain exposure to Ethereum without needing to hold the cryptocurrency directly. This removes some hurdles, such as self-custody, for example.\n\nThe launch of those products could also be seen as a positive signal for the legitimacy and acceptance of ETH and the broader cryptocurrency market. As a result, investor confidence could be significantly boosted, leading to a potential fresh flow of capital and a subsequent price rally.\n\nRecall that the US SEC greenlighted spot BTC ETFs in January this year. The price of the primary digital asset hit an all-time high of over $73,500 approximately two months after that."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxQX1VRdURSWHN4bmd3ZlEycGRVQUVlcmV5WVBJUzNFenNzcGtoSG5oMUZDbGJ4WUE2UExUajFGTnk0Wnkyc3FwN1F1TU4wUGZGSk1QOGE4SXV1U2M2X0RLOUwxNG4zNFpPbnUxRE9ZMFEtZ0pQSVVrdW5fU09jenNnZ1lHUzhMRk5RVDVOcGhTTFFFUDZXeGR5U29GMllHbmdaYnV6QU1mc2F5YTVraVV3NWc4Y2xNTU9scUxkbXYtOVJHeU1LSGdwV0huOHFXMXk5UGk40gHYAUFVX3lxTE9URXRTLS01NDI4QkNzRjJWbksyMndtV0pQMGZkSEt2aXpKY3ZqSTRsa3NPQ3hwbW1oRXVCVWh2M2UzaEFxcTV4MWl2RlJGTmNUOVJqbC04VXBZOV9YYlVmbktHWHNaRFJ2NU9DNWJzbHk1eHFhV0VWc0xzbWpjRC1tX2pLY0lxdHR2NVFaMEFUVGJCZVZqZEtNNGJLRjd3U3Foa0dNaVVteDBidE5xdEd0OHFUcVR2YWFIZmFSeVpuMEVHbmpVOE1qREhVbVRVMXhObmtOdlFmMg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Trader Says Top Ethereum Rival Primed To Go Higher, Updates Outlook on Bitcoin and One Blue-Chip Altcoin - The Daily Hodl",
        "content": "A closely followed crypto strategist believes that one Ethereum (ETH) rival is in an uptrend after retesting the $120 range last week.\n\nPseudonymous analyst Altcoin Sherpa tells his 217,700 followers on the social media platform X that Solana (SOL) appears to have more upside potential after holding the 200-day exponential moving average (EMA) as support.\n\n“SOL: I didn’t trade this… I think SOL looks good for higher though.”\n\nSolana is trading for $140 at time of writing, down 8.5% in the last 24 hours.\n\nNext up, the analyst says that Bitcoin (BTC) has yet to confirm a trend direction as it continues to trade sideways around $60,000 within a range with an upper bound of $73,794 and a lower bound of $56,544.\n\n“BTC: still seeing the same type of choppy price action, no real conclusive trend yet in my opinion. 200-day exponential moving average (EMA) is still close to the range low and I don’t really see anything on lower time frames that suggests reversal (yet). Best to stay flat for now in my opinion.”\n\nBitcoin is trading for $60,157 at time of writing, down nearly 3% in the last 24 hours.\n\nNext up, the analyst is turning bearish on layer-2 scaling solution Polkadot (DOT).\n\n“The chart itself still looks … terrible for what it’s worth.”\n\nLooking at his chart, the trader suggests that DOT could bounce past $7 before dipping to the $6.40 level on the daily chart.\n\nDOT is trading for $6.04 at time of writing, down nearly 8% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQQWFRTFo0U2c2SWdXZUdIMlVhbnBjamhRY3Q2THlSYXc5ekNRNlBod0ZmUzd1bGN5ZWxfbl9YeGljVnNxcVdJZ2NaODl6cjZQRmxNTmxQYWZuVDM3cWRpbFRQVDFkM3hrWWJEaDREb0J2cVhVY1E4Mk1Ma2tiMHdpUjF6blExak9ldXNPRHBn0gGTAUFVX3lxTFBuNFJmRkRfd0sxMzdTQlRoanM3UDh6SE9wOVVzaTRsTTVLWFJuR0NTZlhTY0ZmekNIVW8yaVA1Nk4wWWxGY29LSzNVelExYXhNMzZGTk1kS2VDTl9SNkU5eFJ3N1JBSjhLeW5TVjdlVkNMZE10eGZrdi14ZzVzbTlsYXpxbFlkYmMtcUR5aEFPTG13WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Large Ethereum Whale on Verge of Liquidation as ETH Bloodbath Deepens - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAnalytics X account @lookonchain spreads the word about a large whale, who is long on ETH. Currently, this trader is on the verge of liquidation, the tweet states, while he is about to lose the more than $30 million in crypto that he borrowed.\n\nEthereum (ETH) whale on verge of liquidation\n\nAccording to the data source, this whale deposited 12,374 ETH to Compound, while he borrowed $31.4 million stablecoins. @lookonchain says that should the Ethereum price continue to decline, once it falls to the $2,984 level, this whale’s long positions will be liquidated.\n\nAs the market declines, the whale who is long $ETH is on the verge of liquidation!\n\n\n\nHe deposited 12,734 $ETH($40M) to #Compound and borrowed $31.4M stablecoins, with a health rate of only 1.06.\n\n\n\nWhen the price of $ETH drops to $2,984, he will be liquidated.\n\n\n\nAddress:… pic.twitter.com/lP9877HjCJ — Lookonchain (@lookonchain) July 4, 2024\n\nIn the meantime, another whale grabbed 9,425 ETH worth slightly more than $30 million earlier today. @lookonchain stated that it was a fresh wallet. The whale made a purchase of a dozen other cryptocurrencies, including BNB, MATIC, LINK, AVAX and top meme coins, such as Shiba Inu, Dogecoin, Pepe Coin and Floki.\n\nAdvertisement\n\nIn total, it bought and withdrew a whopping $120 million worth of altcoins from the largest cryptocurrency platform, Binance. The Ethereum chunk was the largest among his purchases.\n\nBitcoin price deep in red, Ethereum follows suit\n\nThis week, since Monday, the second largest meme cryptocurrency, Ethereum, has staged a decline of a whopping 10.42% as it has slumped from the $3,500 zone to the $3,150 mark, where it is changing hands right now.\n\nToday, Ethereum plummeted first by 3.03% in a big single red hourly candle. This drop was followed by a marginal rise and then another price decline of 3.09%.\n\nEthereum has been following the recent price decline of the flagship cryptocurrency, Bitcoin, which has been going down heavily since Monday. Analyst Charles Edwards published a tweet, in which he shared that the Bitcoin price keeps going down as major players continue to dump Bitcoin. Mostly, these are miners who are selling freshly mined BTC and their old Bitcoin reserves.\n\nLong-term holders are actively selling their BTC as well. Overall, according to the Glassnode data shared by Edwards, currently, there is a 374,000 Bitcoin negative flow. That is, approximately $24 billion worth of Bitcoin is being dumped on the market at the moment.\n\nThe U.S. and German governments have recently sold several large amounts of both Bitcoin and Ethereum, according to earlier U.Today reports."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOZGJiWnQtdEpOZVZnSkVtaS1VVlI4emRUeWhsTTFWZFgyRzYtRGJmblVMV056ZEhna0llWEFjYlNGZmlnOWNtTnBwNUpKbUNHNm8ybG1BRmw3N3ZiczhNOXc4UDNUVWhTSThMQnp2dHV0R0FoQ1p2eGtKSkNrQUhUTHpOQTVPM1lPNDBhd0hHS3ZialVjNnFHb2p6OThoWXM3emtzcThIRXExazlmaXh6ZkFMaXB1SlRKOEJSWmVCVE5TdzduRnQ2OTA3NXhhSE9mTjV30gHYAUFVX3lxTE1HZTZmOHpOU0pyUFk3YV91U3hNQlNZNDV1WGdLRUxReFJMTHNhV2R5bWFtR19ZNUJ3Mm5FSmw5aTJWS2d0a2NFQ09zWGVXTFpUcTlpOTJ5d0x2SUdqMl9TeUVMS0xuNVQ1a3BBZFQ3Wmk5ckN6SmM5bGQ1ME1KOUpTSUJTWG5Ga2hNZVlPbHBabzgzUGpSbk01ZW8xMXA0aFZPUkFmR081ektYR0FvS2xzYWVJU3pDdDhSbGk4eF9pSkN0M0JubjBReWszQjExRFBod2ZVaWV6RA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Over $370,000,000 in Bitcoin, Ethereum and Altcoins Liquidated in 24 Hours As BTC Briefly Dives Below $57,000 - The Daily Hodl",
        "content": "Options traders are seeing hundreds of millions of dollars worth of losses as Bitcoin (BTC) suddenly plummets below $57,000 and altcoins collapse.\n\nAccording to crypto data aggregator Coinglass, over $379 million in liquidations have occurred in the last 24 hours — nearly 90% of them from leveraged long positions.\n\nBinance, the world’s largest crypto exchange platform by volume, hosted the largest amount of liquidations at $181.38 million, followed by $101.07 million on OKX, $47.06 million on Huobi and $37.72 million on Bybit.\n\nCoinglass reveals that during the last day, $115.59 million worth of Bitcoin was liquidated, the overwhelming majority of them being long positions. Coinglass also finds that $100.76 million worth of the leading smart contract platform Ethereum (ETH) has been liquidated during the same time frame.\n\nOther prominent digital assets that saw large liquidations include ETH rival Solana (SOL) at $17.87 million, meme asset Dogecoin (DOGE) at $6.7 million, layer-1 blockchain Toncoin (TON) at $5.37 million, artificial intelligence-focused project Worldcoin (WLD) at $4.6 million, and BNB at $4.15 million.\n\nIn the past 24 hours, 131,492 traders were liquidated, according to Coinglass. The largest single liquidation order happened on Binance in the ETH/USDT pair for a value $18.48 million.\n\nIn the last 24 hours, Bitcoin traded from a high of $60,584 to a low of $56,836. The top crypto asset by market cap is trading for $57,369 at time of writing, down nearly 5% during the last day, while Ethereum is trading for $3,121.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/wacomka"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiRkFVX3lxTE5QY0kwR0JmV2w5anI2eHlnUU1hTldqYkF2RDdNaDA5V2ZJVHV6T2U3UFJEVHJWN2RIOVI5bFJod2ZOejR1dHfSAZsBQVVfeXFMT1F0a0psRl9qN3BYcldqX3VYeFVvUG94SHZiZWlsZVhTejY1Sk9YdmE4SmtuNWxNcVlrR1JWRG9EcXZqd2RybUdoYk12Q0d5cjBEcnFjbkVJYXBLdFBDYkozNUxnVnV2dGFnVlU2Ykx4eVkzam1Sdlp5U1BkVUZvZXBIOEpZTGFxY0RfTEZXTE42VF9oeUJrNHpXa1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs set to draw $15B? Bitwise exec makes bold new prediction - AMBCrypto News",
        "content": "Bitwise CIO predicts $15 billion inflow into Ethereum ETFs within 18 months.\n\nEthereum ETFs expected to attract significant institutional investment, bolstering ETH’s market position.\n\nAnticipation for the launch of Ethereum [ETH] ETFs has reached a fever pitch, with many experts speculating about potential launch dates. Industry analysts are increasingly confident that ETFs could debut as soon as mid-July.\n\nRecent developments suggest that multiple applicants will submit their amended S-1 forms by 8th July, as reported by Bloomberg.\n\nNate Geraci, president of The ETF Store, indicated that final approvals could be expected by 12th July, potentially setting the stage for a launch during the week of 15th July.\n\nEthereum ETFs to see $15 billion inflows?\n\nBitwise’s CIO, Matt Hougan, has expressed confidence in Ethereum’s appeal to institutional investors, a sentiment not universally shared until now.\n\nIn a video with analyst Scott Melker, the CIO reveals that the observations from European and Canadian markets, where Ethereum consistently attracts substantial investment, reinforce his optimistic outlook for similar success in the U.S. market.\n\nHougan’s analysis extends beyond mere speculation, delving into strategic conversations with leaders from major financial institutions.\n\nOne such dialogue with a $100+ billion advisory firm revealed a readiness to diversify into Ethereum upon the launch of an official ETF, highlighting the broader financial community’s growing comfort with cryptocurrency as a legitimate asset class.\n\nFurthermore, Hougan challenges the prevailing narrative of high correlation between cryptocurrencies and traditional financial markets.\n\nHe argues that, aside from brief periods of alignment due to extraordinary economic measures like those recently seen, cryptocurrencies generally operate independently of traditional markets.\n\nThis independence is crucial for investors seeking diversification and risk-adjusted returns.\n\nEthereum’s struggle: Market downturn and surging liquidations\n\nAmid the broader market downturn, Ethereum’s performance mirrors the decline seen in Bitcoin, with ETH dropping approximately 6.2% in the last 24 hours to a current trading price of $3,139.\n\nThis significant decrease has led to considerable losses for many traders.\n\nData from Coinglass reveals that over the past 24 hours, 113,506 traders have been liquidated, contributing to total liquidations of $317.34 million.\n\nOf this, Ethereum-related liquidations account for about $76.51 million, predominantly in long positions, amounting to $70.16 million compared to $6.35 million in shorts.\n\nFurther exacerbating the situation, market intelligence platform Santiment has reported a downturn in Ethereum’s open interest.\n\nAdditionally, data from CryptoQuant highlights that Ethereum’s Estimated Leverage Ratio across all exchanges has risen to a notable 0.392. This indicates an increase in leveraged positions relative to the asset’s market cap which could suggest heightened risk of volatility or further liquidations.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nDespite these challenges, not all indicators for Ethereum are bearish.\n\nAMBCrypto has reported a recent uptick in Ethereum’s decentralized application (dApp) volume, suggesting some areas of the Ethereum ecosystem continue to see robust activity."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPRV84Z1hfQUtpWHZYSzNEUy1ybE14ZWpvb3BRYlBHTlFlbThyMThuUlA3MW5OR09fdUNkQWdFWEpQeXpKdFR2S3JiZS1FSFJKVFpJaVl5enF0X2VtWThVVlFjejllaWJSb0Rjdmw4dFRzeE1YZTlWMk5JOGt3MXBRNll4ZEJ5djZUQ3pnUHlfY195UGFFMDR6NlhxVjFqMGJvdVNLdy1VX1NyaWxx0gGyAUFVX3lxTFBGUjZTcmpRQ0lJbTU0SWY4N0kyZTYwTEtKNEdSN2VKc1F2RlFVVVhma2FCWHo2QWY4enlpZ1k5bkZOdm55SXIxWEVSclpsTmZaMlA2ZHh0ajFHbzl5bGVVUklmQXkzYnJ0MVpzc2V5UVBvVUhXY1BwWV9zSDZBS0hoTlNudEZnaTFNR210RUxtLVc5RnhLejQyQnNwVWViZEFiZGcwVTI0dTRncThwOEpUOGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Lost All 'ETF Gains,' Shiba Inu (SHIB) on Its Way to Add Zero, Solana (SOL) Reaches $135, Critical Support Activated - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nThe second-biggest cryptocurrency on the market has reached \"pre-ETF rumor\" price levels, practically losing all their gains since May. Things are not looking good, and the only relatively positive thing we can see is the descending trading volume amid the price correction.\n\nEthereum's price rose initially as a result of the much-anticipated ETF news. It appears, though, that traders lack the conviction to keep the rally going despite the ETF announcement alone. Ethereum's current price of $3,205 is significantly below its recent highs, indicating that there was insufficient purchasing interest.\n\nThe absence of notable advancements in Ethereum's ecosystem this year is a major contributing factor to the lack of buying support on the market. There have not been any significant additions or innovations to the network that would increase its demand or utility.\n\nThis means that neither new investors nor existing ones are drawn to the Ethereum network and, as a result, usage and demand for it remain low.\n\nAdvertisement\n\nAn uncertain future lies ahead for Ethereum according to the technical analysis, too. There is a bearish trend in the price as it has dropped below the 50 EMA and the 100 EMA critical support levels. The 200 EMA at $3,090 is the next important support level, and if the current trend holds, it may be tested soon.\n\nShiba Inu's disrupted plans\n\nBitcoin plummeting below $60,000 has clearly disrupted a lot of plans on the market. Not many expected the digital gold to drop down so badly in the last 24 hours, which greatly affected the performance of assets like Shiba Inu, which lost a substantial portion of their values.\n\nShiba Inu (SHIB) is down a lot from its recent highs, trading at about $0.00001565. The asset has been steadily losing value, and the recent volatility on the market has made this trend worse. Key moving averages indicate additional bearish momentum, and the chart illustrates SHIB's difficulty finding support.\n\nIt is challenging for SHIB to regain its footing because of the resistance levels set by the 200 and 100 EMAs. The entire cryptocurrency market has been impacted by Bitcoins decline below $60,000. Since Bitcoin is the most popular cryptocurrency, its performance frequently influences other digital assets. Plunging panic sales have clearly affected altcoins such as Shiba Inu.\n\nShiba Inu has long displayed technical weakness. A bearish trend is indicated by the asset's recent trading below its major moving averages. An oversold state is indicated by the RSI at 27, but a recovery is difficult because there are not any significant support levels below the current price.\n\nInvestor caution has increased as the general outlook for the market has turned negative, according to various sentiment indicators. As a result of traders' reluctance to invest in a market that is declining, SHIB is under additional pressure.\n\nSolana goes down\n\nSolana went down with the rest of the cryptocurrency market, hitting a $135 price threshold, which is considered a critical support level as it coincides with the 200 EMA. The drop below it would be a long-term bearish signal that hints at the continuation of the bearish trend.\n\nThere is increasing pressure on Solana, which is currently trading at about $134. Traders' attention is focused on the 200 EMA at $131.29, which is a critical support level. A break below this mark would probably indicate the continuation of a bearish trend and might trigger additional drops.\n\nIn line with the bearish outlook, Solana has recently sold off and is now below its major moving averages, which include the 50 EMA at $147 and the 100 EMA at $144.\n\nBecause of Bitcoin's recent decline below $60,000, the sentiment surrounding the cryptocurrency market as a whole has turned negative. Altcoins such as Solana are facing more pressure due to the wider market downturn. Bitcoin may push Solana down even more if it keeps having trouble.\n\nSolana is getting close to oversold territory. Although this might point to a possible rebound, technical indicators and the general mood of the market point to the possibility that any bounce would be fleeting unless conditions in the wider market improve. Solana may stabilize and possibly rise again if it can maintain its hold above the 200 EMA at around $130."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQZE1TT09RVGJmbUNicUs2TEdBeDhTU002WDdObEZHNGxBWkZvZEJBNjV4dTJIb2p6dmFVQWZmZG1yYmltMnNqYThUWnVfY2VXMzFPdVJ3U2NPYW9LUkVaQXQwVUtiWHNoZGgteGR1UjY2Mlk5TmQ2Y0VsQkkyTlNCZV84QVZ3Q0NNOGxkZTdCR09oRDc1SUhpeGVZX0VncDZsak5qZXNySkVjQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Crashing: ETH Approaching $3,000 Despite Massive Adoption - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum is selling off when writing, looking at the performance in the daily chart. Even though the uptrend remains, since gains of May 20 weren’t wiped clean, there are cracks developing. These fissures are widening after ETH closed below $3,300 today, confirming yesterday’s losses. If the dump continues, the probability of the coin crashing to as low as $3,000 would be elevated, denting sentiment.\n\nAt press time, Ethereum is bearish, breaking below a critical support level. As things stand, Ethereum is down 5% in the last day and week. Since the coin is in red, there have been changes in trend; the coin is sliding on rising participation. Over the last day, the average trading volume rose to over $18 billion. This points to traders flowing in, possibly unloading.\n\nTraders and investors are monitoring the following Ethereum trending news:\n\nGTA 6, the popular video game, reports show that it will support other crypto assets apart from BTC , ETH, and USDT. The expansion of the number of coins accepted is a huge boost as far as adoption is concerned.\n\nCircle and Paxos are now regulated in the European Union, compliant with MiCA laws . Meanwhile, Société Generale, one of the largest banks in France, is launching its stablecoins on Ethereum. More TradFi companies are choosing the first smart contracts platform over modern solutions like Solana.\n\nEthereum Price Analysis\n\nETH/USD is under immense selling pressure, looking at the performance in the daily chart.\n\nWith the drop of July 3 and early today, every high below $3,300 could offer entries for aggressive sellers targeting $3,000 in the short term.\n\nSince the drop was comprehensive, the probability of ETH sliding below $3,000 to as low as $2,800 remains elevated.\n\nNotice that the gains of May 20 are yet to be completely erased, giving hope to optimistic Ethereum buyers.\n\nIf ETH unexpectedly picks up momentum, winding up recent gains, and breaks $3,500, it would be a huge boost for bulls."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPbnV6UGhxelVwdk9aYmg5eDZEeFlRWUpqcUtmZkU0bTdON3EwdWpQcHZmQ1JydGxBa0hucHZEalNjWVVrY3pfYUI0OHg3XzVlaEtvdXkxeVN2R3BNTDNuYnUtUm1ZN0RKY1FzZHo1WWphQ0NFbnFhNS1IY0FQUzFmOVdyN00wUm05UUZFT21yelBZNFdI0gGaAUFVX3lxTE1jRUlFY2Ixb3JoV3V0TW5uN1NxbnhiRWk4aXdfN09hT2NJWW5BSm1fNFE4VEdKcVJZUUpYS2d3ekdRTXdiQldVYVpodkxLand3ZTlobVhhT0xBQTlfY1JrR0xwR3NpQUFWSGhDeW1ZNmN5c29kRGhGLXNRLWN0d1d1VFRDSzhaajVUTTRxUEtrSmZLRTUzbHdvbkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum's L2 INTMAX to Offer $5,000 for Privacy Reward Mechanism Suggestions - U.Today",
        "content": "Advertisement\n\nINTMAX, a new-gen Ethereum ZK rollup with a stateless architecture, is calling on blockchain developers and privacy proponents to submit their ideas for rewarding users who contribute to privacy on its network. The blockchain team is also a partner and sponsor of the most anticipated EVM ecosystem event in Q3, 2024.\n\nINTMAX L2 calls for privacy-centric rewards tool ideas\n\nINTMAX, a key sponsor and supporter of ETHGlobal Brussels 2024, and a cutting-edge Ethereum layer-2 zero-knowledge rollup, shares the details of its new initiative focused on enhancing privacy in the ecosystem. A $5,000 reward will be offered to an entity or individual who proposes a privacy-centric solution for rewarding network contributors.\n\n#Ethereum developers, solve privacy problems and get the prize! We’re looking for ideas and implementations that reward privacy users (mining or airdrop). See you soon in Brussels ✌️ https://t.co/PbWl08r6JM — INTMAX (@intmaxIO) June 25, 2024\n\nThe suggestions might cover both airdrop-based or mining-based reward models on INTMAX. Submitting just an idea is acceptable, but it must be compelling to outperform someone who has also implemented it. As noted in the documentation, rewarding users for privacy without duplication remains a challenging problem for credible and active networks in 2024.\n\nAdvertisement\n\nPrivacy protocols such as INTMAX have a unique dynamic, wherein more participants in the network translates to greater privacy for every user. That is quite unlike most DeFi protocols, where having more users means greater competition for rewards.\n\nThe more participants there are in a privacy protocol contributing their funds and usage, the more privacy is afforded to everyone involved. This is a unique dynamic, where having more \"competitors\" actually benefits each individual user's privacy, unlike typical financial applications, where more users means more competition for rewards.\n\nOn the other hand, the introduction of more users makes it possible for malicious actors to exploit loopholes and obtain lucrative rewards without actually contributing to the privacy of the network. To ensure the integrity of privacy networks and properly incentivize users, it is necessary to close these loopholes.\n\nEnhancing privacy for future token distributions on EVM\n\nThe INTMAX contest is one of several enticing prizes up for grabs at ETHGlobal Brussels, with a total prize pool of more than $450,000 on offer to developers who can stand out from the crowd at one of Europe’s biggest annual hackathon events.\n\nTechnically, the contest invites developers to propose the safest and most resource-efficient implementation of the Quiz mechanism, or else develop a superior solution that solves the challenges of privacy rewards once and for all.\n\nDevelopers are not required to program the deposit and withdrawal process, or even provide any privacy guarantees but simply focus on designing the actual reward system."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNUFZOWDFkbjA2ZE50dU1SY0FXMGpMVElLRU9meTdsS3NuNjRkR19NMm9SVVUxZVNYQ2dGNU12amtpc3lLQjlXdWJTQUREcFY4S2xoMER0eWtZTHpicGNVM2FjMU03R19hVjA0LUlXRDFuUjk1VWRFVTNWWDBJSmZSN0phZVF6R3N6NUFJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs vs. Bitcoin ETFs: How Their Approvals Differ - CoinGape",
        "content": "The Securities and Exchange Commission (SEC) recently approved a spot Ethereum ETF, bringing jubilation to the crypto community. This development follows the approval of Bitcoin ETFs which took place slightly over a year ago. Both approvals are important milestones for the digital assets, but the differences in processes and implications of Ethereum and Bitcoin ETFs are notable. Let’s explore the differences between these two significant approvals and their implications for the future of cryptocurrencies.\n\nBreaking Down the Approval Processes\n\nWhen the SEC gave a go a head for the operations of spot Bitcoin spot ETFs, the event was embedded in the history of the cryptocurrency world. The acceptance signaled Bitcoin’s shift from a specialized virtual asset to a commonly-used investment option.\n\nadvertisement\n\nInvestors now have the opportunity to access Bitcoin through a regulated product, without requiring digital wallets or unregulated exchanges. This endorsement confirmed Bitcoin’s status as a valid asset category and established a model for upcoming cryptocurrency offerings.\n\nSkipping ahead to May 2024, the SEC’s endorsement of spot Ethereum ETFs takes a different path. Despite being a significant milestone, Ethereum’s approval is overshadowed by continued discussions regarding whether it should be classified as a security.\n\nIn contrast to Bitcoin, Ethereum has faced regulatory challenges on its approval journey, which aligns with ongoing talks about regulating digital assets, indicating a more complex regulatory landscape.\n\nEthereum ETF vs Bitcoin: Market Reactions and Investor Sentiment\n\nThe market saw an instant and significant impact following the approval of Bitcoin ETFs. Bitcoin price increased dramatically, and the amount of trading rose as both institutional and individual investors showed interest in the innovative investment option.\n\nThis response highlighted Bitcoin’s position as a top digital asset and showed how cryptocurrencies can blend with conventional financial systems\n\nEthereum’s approval has similarly generated excitement, with Ethereum price rising beyond expectation. The potential introduction of Ethereum ETFs promises to broaden its investor base and enhance market credibility.\n\nHowever, the exact timeline for these ETFs and the participants involved remain uncertain, creating a dynamic environment for ETH’s price and market behavior.\n\nNavigating Regulatory Terrain\n\nBitcoin’s Regulatory Hurdles\n\nThere were challenges in approving Bitcoin ETFs. The SEC investigated to prevent market manipulation and ensure investor protection. Bitcoin’s strong market presence and increasing attention from institutional investors were key factors in overcoming regulatory hurdles, despite the difficulties faced.\n\nEthereum ETF Unique Regulatory Landscape\n\nThe regulatory journey of Ethereum has been somewhat complicated. This is because, unlike Bitcoin, the wide range of applications offered by platform, has an ongoing debate on how to classify the ETH.\n\nThe complexity of Ethereum ecosystem which includes non-fungible tokens (NFTs) and decentralized finance (DeFi), is demonstrated by the approval of its ETF by the SEC. This decision shows the need for a more advanced regulatory approach in the changing world of digital assets.\n\nEthereum ETF vs Bitcoin: Implications for the Future\n\nThe acceptance of Bitcoin ETFs set an important standard for investing in cryptocurrencies. It showed that digital assets could be included in traditional financial products, opening the door to upcoming advancements and regulations in the industry.\n\nOn the other hand, the approval of Ethereum’s ETF highlights the increasing importance of its wide range of uses. Apart from simply being a digital asset, Ethereum’s participation in DeFi and NFTs showcases its ability to spark more innovation in the financial industry.\n\nThis approval may speed up integrations and developments, strengthening Ethereum’s significance in the changing crypto environment.\n\nLooking Ahead: Challenges and Opportunities\n\nThe approval of cryptocurrency ETFs signifies a major step forward in incorporating digital assets into traditional finance. These advancements are anticipated to stimulate creativity and broaden the applications of cryptocurrencies, impacting market trends and investor actions.\n\nThe timing and authorization of these ETFs also indicate more general political and regulatory factors. As the regulatory landscape keeps changing, focusing on centralization and establishing strong frameworks will be crucial for maintaining the expansion and adoption of digital assets.\n\nConclusion\n\nWhile both Ethereum and Bitcoin ETF approvals mark important milestones, their differing paths highlight unique aspects of each cryptocurrency’s journey toward mainstream acceptance. As the crypto market evolves, these approvals will play a pivotal role in shaping the future of digital asset investments and their integration into traditional financial systems."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQbGlKc1l1ZHR5ZnlrNE1qd0NvbnQ0SDZic25YYXJxczk1Z1RmanQyREpSWmJjVmY5SWFsWVdobHJ0WXpuSElKc05yWmkwUTQ1R0pEaFZ3N1RPWGFQNVIweFotcGZIWC1zTG82X2hTdm50WHJGWjV6X3FhcW9QbzR6dGpjMkxOYzDSAYwBQVVfeXFMTjctLUF3MjhUenpvZEZCTHdUOS04X2RkNlAxNDZmX2hTWElvOVpMT0lZWEtTZm1rUDVfRGJkUHFXTV9lRU13UDJtZTM4a1BJbHA2blAwWW1QTFRZbDdfcmRoRzlGejhEVGk2OWtDWEVJS1RPQ0JVWWg4THhFZ1F5OFprdHR5MmlFNVRQdnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Justin Sun Faces $66M Loss As Ethereum Records 10% Fall, Here’s Why - CoinGape",
        "content": "Ethereum’s recent 10% price drop has caused market speculations, with the global crypto market cap slipping over 8%. Among the notable impacts is the potential $66 million loss for Tron founder Justin Sun.\n\nThis comes amid his active interest in acquiring Bitcoin from the German government to stabilize the market. Notably, the ripple effects of these developments are raising questions about market strategies and future movements.\n\nadvertisement\n\nJustin Sun May Lost $66M Sparking Concerns Over His Bitcoin Buying Plan\n\nEthereum’s sharp decline today has resulted in a staggering potential loss for Justin Sun, estimated at around $66 million. The dip, part of a broader market downturn, has caused significant concern among investors.\n\nAccording to Spot On Chain, Sun’s extensive Ethereum holdings have been deeply affected by this downturn. The report showed that between February and June 2024, Justin Sun acquired 361,137 ETH through three wallets.\n\nMeanwhile, the purchases include 169,604 ETH in February at an average price of $2,870, 176,117 ETH in April at $3,177, and 15,416 ETH in June at $3,474. Just a day before the plunge, Sun was enjoying a $58 million profit.\n\nHowever, today, those gains have turned into a $66 million loss, highlighting the volatile nature of the cryptocurrency market. Meanwhile, these three wallets, which received Ethereum from Binance shortly after Sun’s stablecoin deposits, exemplify his active trading strategy.\n\nBesides, Sun’s swift movements in the market show both the opportunities and risks of high-stakes crypto investments. Meanwhile, amid this setback, questions arise if Justin Sun will remain committed to his strategy of BTC acquisition to minimize the market fluctuations.\n\nAlso Read: Pro-XRP Lawyer Buys The Dip, Eyes Another Lower Entry Point\n\nBitcoin Buying Strategy In Question\n\nWhile grappling with the Ethereum loss, Sun’s focus has also shown his willingness to negotiate with the German government to buy their Bitcoin holdings off-market. German government’s recent significant offloading of Bitcoin has weighed heavily on investor sentiment.\n\nHowever, Justin Sun aims to minimize further market disruptions by acquiring the government’s Bitcoin holdings privately. Sun’s willingness to engage with the German government highlights his broader strategy to stabilize the cryptocurrency market.\n\nMeanwhile, this proposal aims to avoid potential price volatility that could arise from large-scale Bitcoin sales by a government entity. Discussions are expected to explore terms that could facilitate a smooth transfer of these holdings, potentially altering market dynamics.\n\nHowever, the recent market downturn raises questions about whether Justin Sun will stay committed to his plans. Notably, in the past 24 hours, the market has witnessed massive liquidations, with 229,669 traders liquidated, amounting to $639.42 million in total. According to CoinGlass data, the largest single liquidation order, valued at $18.48 million, occurred on Binance’s ETHUSDT pair.\n\nThis wave of liquidations underscores the fragile state of the market and the need for strategic maneuvers to mitigate losses. As of writing, Ethereum price was down 10% and traded near the $2,800 mark. Its trading volume rose 52% to $30 billion in the last 24 hours.\n\nAlso Read: Leading Telecom Company Taiwan Mobile Gets Crypto Exchange License\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxNWFcxYkhfaU9GSUMxMTlLbjJlUW83aVZ0aTFyeHhESFpTVWNvbWtWcFpuYnh5M2JXZm9kRXM4YXZfQXpkbDJrWERKemlRRVJiQ2Fxa2VRRi1pY082UXBfb09FOW5IQUFUbHdIdlgyWDVnUWVsVmt1blh6a1hmT29HLWNKdXlrV1ZTUVBpVGZxNk1EMVh4aFVCNXhXTE5oSXFqaDVHSlJJbzd3NHI2OGRhVFlYalR3OTBqcW5tTGp5aG1fa1lhZFFXbjRKS0tJZVI1NGFHWGtXQTlKMlgyY0FBRlNpbVBZd05s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, And Dogecoin Plunge As Mt.Gox Moves $2.7B; Biden Trails Trump By Widest Margin, But Over Half Unenthusiastic About Either Candidate, Polls Find - Top Headlines Today While US Slept - Benzinga",
        "content": "Bitcoin, Ethereum, And Dogecoin Plunge As Mt.Gox Moves $2.7B; Biden Trails Trump By Widest Margin, But Over Half Unenthusiastic About Either Candidate, Polls Find - Top Headlines Today While US Slept"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5XdW5lc2ZKcEhPV3d2djJCTWRUakJFWFNXbFZsbF9rS0hRQnlhQWZwRDl2QV96bGhVN3BJdWJuRWlGT3p1SmVlOGxpeVU3V3N2ZUFkUkJzaGwzcmZoSTcwQ2RzYWE5MWwxV3NoT2xTNkN1dDY0ZHlsUWZReGFiZ9IBgwFBVV95cUxORWt0cmRJTy1sYmd6eVh3NlN6eXBBNGZhLUMxY3JMRHZoWGhBVnZVLWVjbjNnXzYtVXJQV280aTE0RkY5ZFBiU2p1RlJvdUR4ZWNVVDZCeUhhR3hXX0tKVkl0enlMRWh3aXRXOU5idklXeVlEb0Y2Y3lTOXlCeFQ2aUh1RQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Whale Faces Liquidation, ETH Price Nosedive - CoinGape",
        "content": "A significant Ethereum whale is on the brink of liquidation due to the ongoing decline in ETH prices. This whale has deposited 12,374 ETH to Compound and borrowed $31.4 million in stablecoins. If Ethereum’s price drops to $2,984, the whale’s long positions will be liquidated.\n\nCurrently, Ethereum is trading at $3,124, down from the $3,500 zone earlier this week. This 10.42% decline since Monday has intensified concerns about the whale’s potential liquidation. The situation worsened today with a 3.03% drop, followed by a marginal rise and another 3.09% decline.\n\nadvertisement\n\nEthereum and Bitcoin Prices Drop Sharply\n\nThe crypto market is seeing significant activity among large holders amid this price downturn. Another whale recently acquired 9,425 ETH worth over $30 million from Binance. This fresh wallet also purchased a variety of other cryptocurrencies, totaling $120 million in altcoins.\n\nAs the market declines, the whale who is long $ETH is on the verge of liquidation! He deposited 12,734 $ETH($40M) to #Compound and borrowed $31.4M stablecoins, with a health rate of only 1.06. When the price of $ETH drops to $2,984, he will be liquidated. Address:… pic.twitter.com/lP9877HjCJ — Lookonchain (@lookonchain) July 4, 2024\n\nThis large acquisition includes BNB, MATIC, LINK, AVAX, and top meme coins like Shiba Inu, Dogecoin, Pepe Coin, and Floki. The ETH purchase was the largest among these transactions. These moves are drawing attention as they occur during substantial market volatility.\n\nEthereum’s price drop is closely following Bitcoin’s recent decline. Bitcoin has been falling sharply since Monday, driven by sales from major players and miners. Analyst Charles Edwards noted that long-term Bitcoin holders are actively selling their BTC.\n\nGlassnode data shared by Edwards indicates a 374,000 Bitcoin negative flow. This translates to approximately $24 billion worth of Bitcoin being dumped on the market. Additionally, the U.S. and German governments have recently sold significant amounts of Bitcoin and Ethereum.\n\nAlso Read: Dogecoin Whale Bags 90M Tokens Amid Market Crash, What’s Next For DOGE?\n\nETH Price Drop Could Trigger Liquidations\n\nThe potential liquidation of a giant Ethereum whale could have broader market implications. If Ethereum’s price falls to the critical $2,984 level, it may trigger further sell-offs. This could exacerbate the current downtrend and lead to more liquidations.\n\nThe ongoing selling pressure from Bitcoin is also affecting the overall market sentiment. As major holders and governments offload their assets, it creates additional downward pressure. Investors are closely watching these developments to gauge the market’s next moves.\n\nMarket analysts are providing varied perspectives on the situation. Some believe the whale’s liquidation risk underscores the fragility of highly leveraged positions. They argue that such scenarios highlight the importance of risk management in volatile markets.\n\nOthers are focusing on the broader market dynamics at play. They point to the influence of Bitcoin’s performance on Ethereum and other cryptocurrencies. As Bitcoin faces significant sell-offs, it drags down the entire market, including Ethereum.\n\nAlso Read: US Government Shifts $14M Bitcoin Amid $BTC Dip, New Selloff Incoming\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQM1lxcldEeWlzTDYtbzMwY2pQNzBxbTluVi1HOUFwUDJKRHAyazFKQVpEclRCNU5hR3FEX1F4cGhQWEZHWHdXbVRwYkVxN2xSSUxETnlkMjdHZXJWdHhMemxtQTlKQlhoRUhLeVEyRVVoODRkM3c5cHFPMWpick9IV3pmWE5nUm15bFhwUWkxeFY3Rzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum Introduces EIP-7732 and Steps up the Pace! - Cointribune EN",
        "content": "Fri 05 Jul 2024 ▪ 3 min read ▪ by Eddy S.\n\nThe Ethereum developers have introduced an Ethereum Improvement Proposal, EIP-7732. This latest proposal promises to revolutionize the block validation process on the blockchain. This initiative aims to enhance the security and speed of the crypto network by separating the validation process into two distinct parts: consensus and execution.\n\nThe innovations proposed by Ethereum EIP-7732\n\nEthereum EIP-7732, supported by Vitalik Buterin, proposes the Enshrined Proposer-Builder Separation (EPBS). A method that divides the creation of crypto blocks between the consensus proposer and the execution proposer. The consensus proposer selects the execution proposer, who commits to producing a valid block containing essential information! Such as a payment or a block hash, for the proposer.\n\nA group of validators, known as the Payload Timeliness Committee (PTC), ensures that the execution proposer submits the promised block within the allotted time. This separation aims to reduce the computational load on validators! Thus increasing the efficiency and speed of the crypto network.\n\nEven faster crypto transactions!\n\nEIP-7732 meets the growing demand for efficiency on the Ethereum blockchain. It follows Buterin’s desire to speed up crypto transaction confirmation times. Thanks to the revision of the transaction fees from EIP-1559 and stable block times after the merge (Merge), transaction confirmations on Ethereum are now reduced to between five and twenty seconds.\n\nAlthough these speeds are comparable to those of credit card transactions, certain applications require significantly faster speeds. The impact of EIP-7732 on the market could be significant as it could strengthen Ethereum’s competitive position in the crypto market. The proposal requires a full network upgrade and thorough evaluation by the Ethereum community.\n\nEIP-7732 is a major advancement for Ethereum. It could not only improve the security and efficiency of the network but also open up new possibilities for users and developers. With community approval, Ethereum could take another step towards a faster and more secure crypto ecosystem.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQNzZVZS00Z2tnelhTazYyNno5XzNOcWFNRHYtVy1uWnhRT1daSmV3TjVrRmZvT2YxeS0ybm5SRmpPLW9wSTE2M0lsZ3NWclBzV0dOZTNfeTFYbTlmd0phSnd1WmZxUzU5V2FwZnUyekdabVFsc0Q1aVRoVTNpVFRKWEQyWFpLOTNnV0p1NdIBkgFBVV95cUxQZEc2b3FnbTh5R1p5TlZVWVJiTjlDalFNcWtuUEFSMEZORm5HczhqWjN3bTd0T0pYWmlwd0pod1p2eVJ2bmhGb3ZuUUY3TEdlQ0dNQnFONUJTZHFrNy1hTTFuVlVTYWs2bldmaGUzWXl2cGNRLUd6RGlxMmRQeGtlOERMX1haeGlUejQ1ZEVsdjRLZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Scampering to Avoid Liquidation in Epic Price Hailstorm - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe broader crypto market bloodbath has triggered an unexpected race for survival among Ethereum (ETH) whale investors. According to insights from crypto analytics platform Lookonchain, amid the intensive price slump, many traders are about to face liquidations, as the ETH price falls to a 24-hour low of $2,839.82.\n\nAdvertisement\n\nMoving against potential liquidation\n\nIn the trading world, the market dynamics are always notably different. One common trend is that traders generally borrow money with leverage, and price fluctuations often push these investors into losses or profits.\n\nIn line with these harsh market conditions, Lookonchain said three whales deposited 28,558 ETH worth approximately $82.2 million to Binance earlier today. This massive amount was used to repay the debts they owed.\n\nAs the price of $ETH drops, many whales are about to face the liquidation of $ETH deposited in #Aave and #Compound.\n\n\n\n3 whales deposited 28,558 $ETH($82.2M) to #Binance in the past 2 hours and sold to repay debt.https://t.co/4ynPQwessDhttps://t.co/ABzz0fceAt… pic.twitter.com/PNYtFvlnV1 — Lookonchain (@lookonchain) July 5, 2024\n\nTraders are often unlucky as the market downturn might happen unexpectedly, giving little or no time for traders to react to save their capital. This trend was seen weeks ago when Curve Finance Founder Michael Egorov suffered one of the worst liquidations on the market this year.\n\nIn another Lookonchain post on X, a trader got caught up in the liquidation as he saw a total of 4,215 ETH worth approximately $12.2 million of his funds liquidated. However, this whale appears to have started repaying the debt.\n\nEthereum price outlook\n\nThe Ethereum ecosystem is undergoing a very intense sell-off, marked by the slump of the top ETH-based tokens. At the time of writing, the price of ETH itself is changing hands for $2,864.08, down by 9.09% in the past 24 hours.\n\nWith the ecosystem mega coin in a downtrend, major altcoins like Shiba Inu (SHIB) and Chainlink (LINK) are down by 13.32% and 13.04% to $0.00001325 and $11.39, respectively.\n\nWhile the ecosystem appears strained, experts are optimistic that the coin is likely trading around its price fall, with a sustained rebound set to be recorded soon."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNRTR1SWxWM0xkZ0RpQV9yMUhQYWlQLTJINFVOYlh2QzlfTkx0ZHp2REZ2bkhmRVNzS2ZxQS1YTXB4UVlidEVTTW41eVRTOEFTUVlENnBHZ3RJZlcwT2Zlc3ByZVAtMks3a0oxeHA1UEdXalNWT2V3TjhXQzlUeDBhQ09QaVdPODlXekhGUV80ZkM2ekNJTTBQaQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Falls 10% In Bearish Trade - Investing.com",
        "content": "Investing.com - Ethereum was trading at $2,898.17 by 23:12 (03:12 GMT) on the Investing.com Index on Friday, down 10.25% on the day. It was the largest one-day percentage loss since November 9, 2022.\n\nThe move downwards pushed Ethereum's market cap down to $360.89B, or 17.62% of the total cryptocurrency market cap. At its highest, Ethereum's market cap was $569.58B.\n\nEthereum had traded in a range of $2,896.05 to $3,108.66 in the previous twenty-four hours.\n\nOver the past seven days, Ethereum has seen a drop in value, as it lost 12.95%. The volume of Ethereum traded in the twenty-four hours to time of writing was $20.66B or 21.95% of the total volume of all cryptocurrencies. It has traded in a range of $2,896.0498 to $3,522.0027 in the past 7 days.\n\nAt its current price, Ethereum is still down 40.42% from its all-time high of $4,864.06 set on November 10, 2021.\n\nElsewhere in cryptocurrency trading\n\nBitcoin was last at $55,408.9 on the Investing.com Index, down 6.05% on the day.\n\nTether USDt was trading at $1.0002 on the Investing.com Index, a gain of 0.09%.\n\nBitcoin's market cap was last at $1,104.18B or 53.90% of the total cryptocurrency market cap, while Tether USDt's market cap totaled $112.45B or 5.49% of the total cryptocurrency market value."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPNlktR2U3OWJ4ek0zUzR5d0FYUkxENzdXN3h4ajZpYWtuN0xIemdFZ1NsQ08zRFdfdk03MUQ4bnJNaHRtVWNNSmgzQVdvQ0I3eTFHQmlVY3pleDNySjFuMjZ6ZWp5M2NxYVRPOERFSDNKOW9JUW9LaTl3MVVIem4wZk5abXbSAYoBQVVfeXFMT1RhaUYzNVdyQWd6NHJPVE5aeDZTbDlRbC1DOUE5MDRaNUlMQl8zUUo4U0ZORWh0UE9MVl9MOFJCOC1DWkU5OHl5YzRVemxScFNhbm1JQVB6SWpTUEVXV19oR2xvTWVOaERUQ3h2M1FXYXBVTE5XUmtTeWk2Z0NnLUxfZW53OE1vOFhR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Are Ethereum ETFs imminent following Bitwise’s early S-1? - AMBCrypto News",
        "content": "Bitwise submits the Ethereum ETF filing early, suggesting a mid-July launch.\n\nEthereum price drops but ETH holders are bullish with the potential for price surge.\n\nIn the latest update on the potential approval of a spot Ethereum [ETH] ETF, Bitwise, an asset manager, has taken proactive steps by submitting an amended S-1 form ahead of schedule.\n\nBitwise move amidst unexpected delays\n\nInitially expected to launch around 2nd July, as per Bloomberg’s Senior Analyst Eric Balchunas, the timeline for ETH ETFs has since been adjusted to 8th July following the SEC’s new deadline for firms to amend their S-1 submissions.\n\nFor context, this delay originated from the SEC’s request on 28th May for issuers to address minor queries in their S-1 filings.\n\nRemarking on the same, Bloomberg ETF analyst James Seyffart said,\n\n“We’ve got another amended S-1 from @BitwiseInvest for their #Ethereum ETF. Expect more from other issuers throughout the rest of the week. We’re thinking these things could potentially list later next week or the week of the 15th at this point.”\n\nAdding to the fray was Nate Geraci, president of ETF Store, who recently expressed his optimism about the ETF’s approval, suggesting that the SEC could grant final approval by 12th July, paving the way for trading to start by 15th July.\n\nThe delay was not required\n\nThis has caused significant confusion within the industry regarding the final approval date. However, Bitwise’s early filing of the amended S-1 forms on 3rd July suggests that the products are nearing launch.\n\nProviding further insights on the matter, Balchunas noted,\n\n“Prob just wanted to get it off their plate and from what I hear the last round of comments were ‘literally nothing’ = took zero time to update. Also, no fee yet. Prob get those next week-ish.”\n\nThis has sparked criticism towards SEC Chair Gary Gensler. Many also argue that it’s time for a change in SEC leadership. Echoing these sentiments was X user Circuit, who claimed,\n\n“This is just Garry throwing this weight around one last time before he is out the door.”\n\nImpact on ETH: Should you be concerned?\n\nUnfortunately, despite Bitwise’s efforts to speed up the ETH ETF process, Ethereum’s price took a hit. According to CoinMarketCap, ETH dropped by 5.09%, trading at $3,189.50.\n\nHowever, AMBCrypto’s analysis of IntoTheBlock data reveals that a significant majority (72.06%) of ETH holders currently hold tokens valued higher than their purchase price, indicating they are “in the money.”\n\nIn contrast, a smaller segment (19.07%) holds ETH tokens that are worth less than their purchase price, placing them “out of the money.” This suggests a bullish sentiment or potential upcoming price surge for Ethereum."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQSUU5cGg3WkdPaEc0dFJyTElsWHZHVFF3NEZlUWVLS2VmMklndHhleXhFanRxajFHM2llVlRfYzBmWjlPM1BEWnhtTTAyUnBhX1M0VHRfY05HelRtU2FNSG4wOTFjZjNzVUptcEIwS3RDNVV0UE1PWFJsVHZ2czMyeXlZdThtYXlWVzVITUQ5NHNtV21Leks3T2t30gGfAUFVX3lxTE04QVFGZzZzOV9NbnRQNWJZTmhZOW13cUNZYTlkY2NEZEZRNlUxUmpxVUIxQURlOUsyVjlpempkN0lVakpVNTZ4b1ZZd0lzLW5KajdZTm5VUEtjTTNObERvMThyYW50QlVleEpsTnY3VVpfeEllWFRSamUyS1J6V0tCaTVLcFFyeHJndGZ6Si12X04zNWg5VU92WERoY0l2QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Altcoin Market Crash: Ethereum Suffers Most Liquidations In Panic Selling - CoinGape",
        "content": "With the Bitcoin price crashing all the way to $55,000, panic selling in the altcoins market remains even more pronounced. Ethereum and almost all of the top ten altcoins have crashed anywhere between 10-20% with the ETH price losing the crucial support of $3,000.\n\nAltcoin Market Crash, Ethereum Faces Most Liquidations\n\nIn a significant shakeup in the crypto market, 221,704 traders were liquidated in the past 24 hours as per data from Coinglass. The largest single liquidation order occurred on Binance in the ETH/USDT trading pair, valued at $18.48 million.\n\nadvertisement\n\nOn the hourly chart, the Ethereum liquidations have exceeded that of Bitcoin as well. In the past hour, the total Ethereum liquidations have shot up to $44.5 million, while the 24-hour ETH liquidations are at $107 million. Liquidations for other altcoins have also shot up singificantly.\n\nDespite all the developments hinting at a spot Ethereum ETF coming by July end, the ETH price has reacted negatively and is largely in tune with the broader market correction.\n\nEthereum developer Anthony Sassano has expressed his views on the current market overhang for ETH, pointing to potential outflows from Grayscale’s ETHE. Sassano noted that ETHE has been trading at a discount of less than 2% for months and is now at a premium, raising questions about how many investors are waiting for its conversion to an ETF before selling.\n\nSassano also highlighted the uncertainty surrounding ETHE’s fee structure post-conversion. He suggested that fees could be much lower than anticipated or even waived temporarily to attract investors to Grayscale’s mini-trust.\n\nAlso Read: Ethereum Leads Bitcoin By 2x In Network Fee Revenue\n\nFUD Reaches Historic Levels\n\nAs the crypto market continues to decline with more intensity, there’s major fear, uncertainty, and doubt (FUD) across social media platforms. On-chain data provider Santiment reported that the “sell” mentions have outnumbered the “buy” mentions every passing hour.\n\nThere have been several instances of this trend in the past 24 hours with the ratio of negative to positive comments reaching its highest in 2024. Santiment suggests that for bold traders, this period of heightened negativity could present an opportunity to adopt a contrarian strategy and buy into the market amidst widespread anger and frustration.\n\nAmong the altcoins, the entire memecoin sector has tanked even more heavily with all of the top memecoins losing between 17-25%. It will be interesting to see whether these meme coins bounce back or if this would be the end of the meme coin mania.\n\nAlso Read: Ethereum Whale Faces Liquidation, ETH Price Nosedive\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPZ0JIUVNFa2lMUmttUlhJa1N5MDJXQXp6dkFHb0M1cHVxbWpPSzBhTGdVRllNMDBRaDJ6MkJhZXBZQ0pqbWR0RmtxWGIwVjFVZXJaSHhwc0d1TGY5bmFmbW5iLUlLdVYzdjg5ZmxQS1JNN1V0MF9BVi1QYmdGYnFBbmFPdExJSl9FMjlLeDZaa2UtVjjSAZgBQVVfeXFMTTJPc1E1dWFXd3huTTZhVGsta2Nfd1hxLUxpc1RUS2QyekwyZFZiUTBMTkREYk1tcWhiOExYOS02TXFUMkpJVEwxRFh6UzFGMTl4VEFOTjcwN3B5cy1XTFQxc04yQXc3ZU1hbExKbVUzMHRCdlp5V1BHZmd2NmNmaDkwWlVGUWM4OWQwUFF4N2Q4OC1yeGc2MTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Bitwise Files Amended S-1 for Ethereum ETF Ahead of Launch Deadline - CoinGape",
        "content": "Bitwise has filed an amended S-1 form for its Ethereum exchange-traded fund (ETF) just days before its July 8 deadline. This move indicates that the product is nearly ready for launch. Analysts predict that these ETFs could begin listing within the next two weeks.\n\nBitwise Submits Amended S-1 for Ethereum ETF\n\nBitwise’s updated registration form was submitted on Wednesday. Analysts suggest that these products be listed by mid-July. A source close to the situation indicated the SEC might approve the final drafts by the end of next week.\n\nadvertisement\n\nThe SEC approved 19b-4 forms for eight spot Ethereum ETFs, including Bitwise, on May 23. However, issuers need their S-1 statements to become effective before trading can begin. This two-step process has kept the market eagerly awaiting the launch.\n\nDespite the light comments on the S-1 forms, the SEC has taken its time to get approvals. A single problematic issuer may need to be on time to process. Nevertheless, expectations remain high for a launch this month.\n\nAlso Read: Federal Reserve Forecasts “AI Will Be Deflationary” To Boost Economy\n\nAnalysts Confident in Near-Term ETF Launch\n\nBloomberg ETF analyst James Seyffart noted the frequent amendments in S-1 forms. He expects more filings from other issuers throughout the week. This pattern suggests a coordinated effort to meet regulatory requirements.\n\nUPDATE: We've got another amended S-1 from @BitwiseInvest for their #Ethereum ETF. Expect more from other issuers throughout the rest of the week. We're thinking these things could potentially list later next week or the week of the 15th at this point. pic.twitter.com/xqVlt9lSGy — James Seyffart (@JSeyff) July 3, 2024\n\nSenior Bloomberg ETF analyst Eric Balchunas expressed surprise at the SEC’s slow pace. He speculated on possible reasons, including summertime vacations. Despite this, he confirmed indications of a launch this month.\n\nThe SEC’s return of S-1 forms with light comments suggests minimal hurdles remain. Analysts view this as the final round of feedback. This has increased confidence in a near-term launch.\n\nBitwise made significant updates to its S-1 form. One notable change includes waiving the sponsor fee for the first $500 million assets. However, the firm still needs to disclose the fee after this threshold.\n\nAnother issuer, VanEck, also announced that fees would be waived initially. These moves suggest competitive strategies to attract initial investors. By waiving fees, these firms aim to lower the entry barriers for new investors.\n\nThe recent amendments highlight Bitwise’s proactive approach to regulatory compliance. The firm’s updates reflect a strategic positioning ahead of the anticipated market entry. This aligns with the broader trend among issuers to streamline their offerings.\n\nAlso Read: US Lawmaker French Hill Doubles Down On Trump’s Pro-Crypto Stance\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxQR3FQc2NYbHlKZjUwNGlyTkpuclgzRUtpTGRSeC1YblU3WHVYbnEtV1puTk5ORktwLXFRZUp5X1EzRUNvR2dIc0diTjE0YlhWRkNHSzhYY2pnNjg5ZmJBUmZEUkNQSWRNRGVwaUZfeWpMa1ZSbU5xcXdKenlnczYtXzBTblk1eHFONW5FU2lhVXpnNEFTRGY2ZS1lSUdjRFdXQlEzSGkzY29xZmJONXphSVpPUDZVQVZBSUc4eDQ4TVA5WUxZc1hoTlNRY0FZcW1GX1hVNm9BRDFMNDRMeWlwc0dR0gHvAUFVX3lxTE5CYlpfbFNZUDcwWHNHakluckhja2NBUlBVY2J3Zk1nS2tmZjhZQng4RHNSdzN0Y1NIem0xSE56REJqSUdSdG14WjkxM0RkZERVY1pvSlVERjc0YmtDRzJlMzdoTGtfM0RVTGJodkhHcUhfUFBaMnFfTVFLVHE1Ni1HRDREaGt0SUJlWGVBUlZ3WGJUYlJ2cU5nVzFRX2FnWTlyU3A2OTZGbmtuODZtVHdybGJfYnotdHpjbzNqQnpOWWU3QUU2dDlJYUNodFBXeFF5aXJkdF9Cb0RrakhRUEJZOHhJQmxabEltWWk3bXhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) And Cardano (ADA) Ready To Take Charge, But Analysts Pick Presale Star As The Best Crypto To Buy - Outlook India",
        "content": "Analysts Back Presale Star, KangaMoon, To Lead the Bull Market\n\nAlthough the top altcoins are preparing for a bull run, the attention of most market experts has been on KangaMoon. KangaMoon first caught the attention of industry experts in presale, where it raised over $8 million and onboarded more than 32k users. The resilience shown by KangaMoon during the recent market dip is one of the reasons market experts are bullish about this new altcoin."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOMjdSdm41S3owc3VoQTFmTkFRQ3VHeWNkMExnTVlLWmQ2ZkhHbUJmbmdVT0FyQ2s4eEJ5SkxiVGlyV1NocEV2X0xSYWE2Z1kyQ05uQ3Z5SzdBbFYtc0VpdkxkWlJ3Q25TeHZMQmdobXJxdWQtczVtbFhTaGYwV2RMUDQ0dU5YV3NiMW5GMk8zMmZ6X2NfbHM1a015dFdsYVUxVndpWGNyWHJzbFNEWFFia1lUckI0cDlH0gHGAUFVX3lxTE94ei1sclFlSERodjFQdElsOTY4d3owVzJxeWNqbUkyZURBczAxYjZOeXNNMFRCdThPNHJpc0hWNjNkZk9Rd2FJYTZkcUtrb2NrX0ZCRm1MR2VmTUNUenk5UFgwNmh1RENSeTA4eGcyVkdjX2dIUFB6MkFyM3JCd3ctS1lyaE9BWjhjUUtPcHJBNG54c2FqN0JWdW9nTWdMeUxJU3I0S1ZUNmo2LUJmSklJcVg0UzlzVVNBTkVmVUVGZEI1WmtQQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum's Performance Hits A 2-Year Low - Investors Focus On Emerging Cryptos - Outlook India",
        "content": "Players who complete any of these tasks will receive $PLAY tokens as a reward. The players who earn the most XP will be at the top of the list and receive extra $PLAY tokens as a prize. This gamification strategy has not only increased user engagement but also driven demand for the token. PlayDoge raised over $5.3 million so far, so hurry up and invest!"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxNZG0zQnRTeXFnSzRXdnBwU3NEOFJzbWRaNmsyX0pwY1RmcXhrSXlhNnRRNWxyS2NKeHI5Y1psR3BMcWZxT0trR0dtRlpoMUdnRWo1M040TzFoMmJ4UzJxSDRMREtSZ0VJY3hyR3M4aGdPSlNlWEVmaHNzWGxhTERuclZQaDZKcHQ1MnlncXF1eUo4c19pS2lwUDEzSzJUS25Mc0JwaE96RDBaVl9KY3E1M0JYSzcwSHMtaEpZckR4QWdEc2U4cG9MNWU0Sm44WkdtVHQyOHdiU01JYXR6b1diSVhQSnFZYlRvWFVBVVdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Crypto Millionaire Discuss Top 5 Tokens To Buy This Year; Polkadot (DOT), Ethereum (ETH), Ripple (XRP), Bitcoin (BTC) & Rollblock (RBLK) - Techpoint Africa",
        "content": "With approximately 22,932 cryptocurrencies, new investors can get overwhelmed with the sheer amount of choice there is in the market. While risk-averse investors should stick to Bitcoin, Ethereum, Polkadot or perhaps even XRP, Rollblock remains the most promising prospect for potential 100x gains by the end of 2024.\n\nRollblock (RBLK) stands out as the first globally recognized Play-to-Earn GambleFi token, seamlessly bridging centralized and decentralized gaming environments through its casino platform. By leveraging blockchain technology, Rollblock ensures that all transactions are secure, traceable, and immutable, significantly boosting security. This commitment to security has attracted substantial interest from investors looking for trustworthy and promising opportunities, and substantial returns.\n\nIs Polkadot A Lucrative Investment For Q4?\n\nPolkadot’s stability in 2024 may turn off ambitious investors, though Polkadot’s impressive utility could make Polkadot a solid long-term play\n\nPolkadot could rally when the bull cycle picks up steam, though Polkadot’s competition could hamper Polkadot’s potential.\n\nBitcoin Remains The Crown Jewel Of Cryptocurrency\n\nBitcoin may be the best choice for low risk tolerance investors seeking less than a 5x. With Bitcoin’s titanic market cap of $1.2 trillion, it’s improbable that Bitcoin will muster more than a 2x in 2024.\n\nHowever, the trade off is that Bitcoin’s almost guaranteed to soar eventually. With Bitcoin ETF’s seeing $73 worth of inflows and increasing bullish market sentiment, Bitcoin will remain #1 for at least the next 10 years.\n\nEthereum Likely To Rally In The Next 12 Months\n\nDespite having the second highest market of over $413 billion, Ethereum still has the potential to garner profits for investors in the upcoming bull cycle.\n\nThough Ethereum is unlikely to achieve more than a 10x, Ethereum’s a safe pick for investors who are content with minimal returns.\n\nThe Ethereum ETF could bolster the coin’s chances of a significant rally. As crypto analysts speculate on Ethereum's ETF release, the price for Ethereum could experience a minor surge any day from now\n\nXRP Could Breakout In 2025 Despite Stagnating Price Action\n\nWhile the price action for XRP rose almost immediately to $0.82 following Ripple’s partial victory in July 2023, the price for XRP has been relatively stable since then, fluctuating around $0.45 on the lower end and $0.55 on the higher end.\n\nXRP’s price slightly recovered to $0.48 in July. XRP holders are still anticipating gains exceeding $1 in 2024. It's possible that XRP could undergo a massive rally next year, though XRP remains the most speculative coin in the top ten aside from Dogecoin.\n\nRollblock Set To Explode Later This Year\n\nRollblock (RBLK) is emerging as the first Play-to-Earn GambleFi token, seamlessly merging centralized and decentralized gaming. Using blockchain technology, Rollblock ensures all transactions are secure, transparent, and immutable, enhancing trust and security. This focus on reliability attracts users and investors looking for a fair gaming environment.\n\nRollblock stands out for its accessibility. Unlike traditional online casinos that require lengthy KYC processes, Rollblock allows users to join easily by connecting their cryptocurrency wallet or signing up with an email. This easy entry process broadens its appeal. The user-friendly design ensures that both experienced gamers and newcomers can effortlessly navigate and enjoy various games, boosting its popularity and user base.\n\nThe RBLK token is central to Rollblock’s ecosystem. Players earn RBLK through gameplay, and these tokens can be used for future staking rewards. Additionally, Rollblock's revenue-sharing model distributes up to 30% of daily profits to token holders, conducting buybacks and token burning to increase RBLK's value. This approach promotes long-term holding and consistent demand, driving the token's value upward.\n\nThe ongoing Rollblock presale has been highly successful, with over 90 million tokens sold at $0.015 in under a month. This rapid sale shows strong market interest. With a fixed supply of 1 billion tokens and 60% allocated to the presale, the limited availability is expected to boost the token's value. Analysts predict an 800% increase in value by the presale's end, offering a prime investment opportunity.\n\nRollblock's price continues to rise, reflecting growing confidence in the project. Its innovative features, secure blockchain use, and active community engagement position Rollblock as a leader in the online gaming market. Analysts expect Rollblock to become the top DeFi token of 2024, with significant value appreciation potential. For investors, gamers, and crypto enthusiasts, Rollblock presents a unique chance to join a groundbreaking platform set to revolutionize online gaming.\n\nDiscover the Exciting Opportunities of the Rollblock (RBLK) Presale Today!\n\nWebsite: https://presale.rollblock.io/\n\nSocials: https://linktr.ee/rollblockcasino"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPUzBvakstX3Q4ZFJpMFMtZDk2cmJTMktrZGhCMW8xNDNSb002Vnd4UjRUd2VHeC14X1pjb0hGUGRGYlU5OFoyRUJFTEItRTV4YnFKZVJhZXdueUpuSHNzWm9mcUU3VWZVVW56em1vRWR4NmpnZjlqV1Ryc3I2bGlYNl9rN2VkX1ZUQkYxWV9aZk1NdlNudnRKTWxRbDF2WWxTdUJV0gGoAUFVX3lxTE1PUm5tSjZjWC0zRFpMenMySENSWmVSU1BGN3NLLVZuM2ZsMDUwNkJTM1puazQ3RnBqbXdCTks2Y3diQ29yRmFrR05QaVFRTTFmMnZ3QUFzanU1QUJmVmQyUmgyMXZ5bV9KZEg5TmlQcVZVQ3MtLW50c1h6ZDQ3MVYzOTk0TVZXY2FDRzJ0bHVhOHhHcmQ1ZXVTQXhvT2h6RFVLWnBOSEpPUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 11:06:45 GMT",
        "title": "Ethereum Faces Sharp Decline As ETH Targets $3,051 Support Level - NewsBTC",
        "content": "Ethereum (ETH) is experiencing a significant downturn, with its price rapidly approaching the crucial support level of $3,051. This sharp decline highlights increased selling pressure and growing bearish sentiment in the market.\n\nAs Ethereum nears this critical threshold, traders are closely monitoring its behavior for signs of either a stabilization or a further drop. The $3,051 support level is now a focal point, determining the short-term direction of Ethereum’s price action and potentially setting the stage for future movements in the cryptocurrency market.\n\nThis article aims to analyze the sharp decline affecting the digital asset and its impact on the cryptocurrency’s price as it approaches the $3,051 support level. It also seeks to provide traders and investors with a comprehensive understanding of the current situation, potential scenarios if the support level holds or breaks, and strategies for managing risk in this volatile environment.\n\nETH’s price is currently trading at around $3,181 and down by 5.05% with a market capitalization of over $382 billion and a trading volume of over $18 billion as of the time of writing. In the past 24 hours, there has been a decrease of 5.25% in ETH’s market capitalization and a 74.43% increase in trading volume.\n\nTechnical Indicators Pointing To A Decline For Ethereum\n\nA technical analysis of ETH’s price action on the 4-hour chart reveals that the crypto asset is actively bearish and trading below the 100-day Simple Moving Average (SMA). Ethereum has been consistently bearish since after breaching the $3,360 mark and is currently heading toward the $3,051 support level.\n\nAlso, an analytical view of the 4-hour Composite Trend Oscillator shows that the price of ETH may continue its bearishness as both the signal line and the SMA of the indicator have dropped below 50% and are attempting a move into the oversold zone.\n\nOn the 1-day chart, the crypto asset has made a sharp drop below the 100-day SMA and is attempting a break below the bullish trend line while dropping toward the $3,051 support level.\n\nFinally, on the 1-day chart, the composite trend oscillator indicates a further bearish move of ETH as the signal and the SMA of the indicator are both trending in the oversold zone.\n\nWhat If $3,051 Support Fails?\n\nAnalyzing potential outcomes if Ethereum breaks through the $3,051 support level reveals that if the digital asset breaks below this level, it may move lower to test the $2,865 support level and probably move on to test the $2,160 support level and other levels below if the price breaches this level.\n\nHowever, if the price of Ethereum faces rejection at the $3,051 support level, it will begin to ascend toward the $3,360 resistance level. Should the asset breach this level, it may continue to climb to test the $3,659 resistance level and possibly move on to test other higher levels if it breaches the $3,659 level.\n\nFeatured image from iStock, chart from Traadingview.com"
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOcGEwMHpOV0NhMDdMVkZvNW94Qlk5NWJtV0J2dFNMR2FtWVhhZW5pUS1mdnpsUFpaVWZSdUliSzh6dGFtMkZWNTU1V3RxRDRFN0VQSkNWMzlJQkl2dlN1aldYNjNBOVltVTA2b1QzNWUyb0pwaUgwQzBONDJmZy16X2VpY0x6eko3WFRjMzlZaHg1Zlo0bmfSAZsBQVVfeXFMTVBjQjVqazhsTFVoRWh5Z0JwbVItb0V1OVo5YWlCZEFtVnktelNYOVk2NFhZZC1HaW5nc3BSQlVwei1yUzZWS2F2ZVQ3eURBOVlvcm9RR2c1VTBBX3U2WHpTdVRJR0ZYeEYtUUZCZjZrSmFQQ0lYNy1oUkRRSTdzOS13ekVvRF9xc3lNWm9TVy05bnVELW1rbTdELVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Doomsday for Ethereum? ‘A Crash Down To $1,500 Is Coming,’ Says Skeptic, Here’s Why - NewsBTC",
        "content": "The crypto market is currently navigating through a turbulent phase, particularly for Ethereum, which has seen a significant downturn of nearly 15% in its value over the past week.\n\nAmid this negative price performance, Peter Schiff, a well-known economist and a skeptic of cryptocurrencies, has chosen to add salt to the wounds by projecting a stark prediction for ETH. According to Schiff, Ethereum could plummet to as low as $1,500, marking a substantial decline from its current levels.\n\nRelated Reading\n\nShiff’s Bearish Outlook And Community Reaction\n\nSchiff’s prediction comes when Ethereum is trading below the previous crucial support of $3,000 mark, a sharp 30% fall from its peak above $4,500 in March.\n\nThis decline coincides with heightened speculation surrounding the potential launch of an Ethereum spot exchange-traded fund (ETF), which seems to have triggered a premature sell-off among investors instead of propelling the price.\n\nSchiff’s commentary suggests that the market’s response to the ETF rumors has been to liquidate positions rather than hold, adding further downward pressure on Ethereum’s price.\n\nHe expressed his view on Elon Musk’s social media platform, X, stating, “It looks like those buying the Ethereum ETF rumors couldn’t wait for the fact to sell,” indicating a market driven by speculation rather than sustained investment confidence.\n\nWhile Schiff’s bearish outlook has garnered attention, it has also sparked a mix of skepticism and agreement within the crypto community. Users have expressed varying opinions on social media platforms, with some questioning the technical basis of Schiff’s $1,500 target.\n\nOthers humorously noted that Schiff’s pessimistic predictions often come at market bottoms, suggesting his views might inadvertently signal a buying opportunity. For instance, one user remarked on the irony of Schiff’s timing, indicating that his bearish predictions could contradict market sentiment indicators.\n\nthx for your inputs you do realize you only become relevant on this side of twitter as a bottom signal lol youre like those acoustic wif kids who had a stroke on stage the wif party as a top signal — agent pretzel (@agent_pretzel) July 5, 2024\n\nEthereum Faces Critical Juncture\n\nEthereum is experiencing a significant downturn, trading at $2,975—a 4.2% drop over the past day. This decline and Bitcoin’s similar trajectory have led to a 4.1% reduction in the global cryptocurrency market cap, erasing more than $200 billion in value.\n\nAccording to Coinglass, this downturn has triggered substantial losses for traders, with 207,020 liquidations in the past day, totaling $576.53 million. Ethereum-related liquidations account for $134.58 million, predominantly from long positions.\n\nWhile Peter Schiff’s outlook may seem too pessimistic amid these market conditions, another voice in the crypto analysis sphere, Inspo Crypto, offers a slightly more moderate view.\n\nHe notes that Ethereum’s price has fallen to early May levels and suggests that the next 8-hour trading window could be crucial in determining the market’s direction.\n\nRelated Reading\n\nAnalyst Predicts Ethereum Nosedive, Cautions Investors To Prepare For $2,700 Target 2 months ago\n\nIf Ethereum can rise above these levels, it might potentially ease the bearish trend. However, failure to reach the $3,170 mark (which it already has) could lead to further declines, possibly down to $2,700, exacerbating losses across the altcoin market.\n\n$ETH has broken down below $3,170. The next 8 hours (1D candle) will show whether the bulls have given up or not. If the price retraces back above, we should consider this a deviation. But if $ETH instead retests the lower trend channel next at $3,170 unsuccessfully, it could… pic.twitter.com/1msfKQBf2v — InspoCrypto (@InspoCrypto) July 4, 2024\n\nFeatured image created with DALL-E, Chart from TradingView"
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPeGNRS2UwbG56N2ZRc2pVdHp1M3VkZnA3ZjlGNzY4X1pucTloUHdHbmdSdS1kNzNiUWloZHBBQy1hRTlKbzg2WDFvU01YUFl0ZmZtOFBNX19zdzFzc3V5dXF1VWxTQUVUbU52VmFfVlF2WWhjZ0Uzb3NrQkRtODRJVk44ejlTdUFOSGhFZWZiV21iZzVQeGVKV0JXWVFtT0h1NVdlYmhETFhma05PRDRmNdIBtgFBVV95cUxPRndPVWcwNXJpQ25VekFZZ2VqRFJXMjAybXM0ZzZNNVlHLTlwb295M0QxWl9veGFadGxHUDVXYXZMaXNoYnhTYzJMSUtiQXY0czZoUElDR0YtbWpzRi1RYnViUWUwU1NhRVdQc0YtWFk2ZV94ZVpwRGFwVVJsLVU5RjNXUVBHY2U1Mm5xN25XalYxd1JkajVycHRaX0J5MmdrUXZqSjJ4cUUxZ2ZEX25QTlQ3UXA0QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Justin Sun Potential $66 Million Loss Revealed As Ethereum Price Declines - NewsBTC",
        "content": "Following a widespread crypto market crash on Friday, the price of Ethereum took a severe price hit falling by about 10%. While the prominent altcoin has made a minor recovery since then, its price slip has revealed some vital information on the holdings of Tron founder and key crypto figure Justin Sun.\n\n\n\nRelated Reading\n\nJustin Sun $66 Million Loss, Motive For Massive Bitcoin Buy Offer?\n\nAmidst the market mayhem on Friday, blockchain analytics platform Spot on Chain shared an intriguing report on Justin Sun’s investments in Ethereum. In an X post, Spot on Chain stated that Sun has allegedly acquired 361,000 ETH (worth $1.1 billion) over the last five months.\n\nThe Tron founder reportedly made this investment using three different wallet addresses purchasing 169,604 ETH with “0x7a9” in February at an average price of $2,870, 176,118 ETH with “0x435” in April at $3,177, and 15,416 ETH with “0xdbf” in June at $3,474.\n\n\n\nJustin Sun may have lost $66M after the #Ethereum price plummeted 10% today! From Feb to Jun, he allegedly bought 361K $ETH (est. cost: $1.1B) via 3 wallets, including:\n\n– 169,604 $ETH via “0x7a9” in Feb at $2,870 avg\n\n– 176,117 $ETH via “0x435” in Apr at $3,177 avg\n\n– 15,416 $ETH… pic.twitter.com/bwIezvMRtj — Spot On Chain (@spotonchain) July 5, 2024\n\nSpot on Chain noted that the aforementioned addresses always received ETH deposits from Binance following Sun’s stablecoin deposits on the exchange thus leading to suspicions that the Tron founder served as owner of these wallets.\n\n\n\nFollowing the repayment of creditors by defunct exchange Mt. Gox, coupled with a consistent massive Bitcoin sell-off by the US and German governments, the price of Bitcoin has plummeted by 10% over the last two days falling as low as $53,717.\n\nUnsurprisingly, this decline soon extended across the crypto market, with Ethereum crashing by a similar percentage to trade at $2810, marking its lowest price in the last five months. At that point, Justin Sun’s alleged ETH investments reached a $66 million loss.\n\nInterestingly, the Tron founder had reached out to the German government on Thursday to negotiate the sale of their remaining BTC holdings valued at $2.3 billion in a private transaction order. However, it remains unknown if the German government will take up this offer as Sun attempts to reduce the impact of their constant BTC sell-offs on his personal investments and the general crypto market.\n\nAt the time of writing, Ethereum has shown resilience since its earlier slump rising by about 5% to currently trade at $2,975. In tandem, the token’s daily trading volume is up by 47.33% and valued at $30.47 billion.\n\n\n\nRelated Reading\n\nAnalyst Predicts Ethereum Nosedive, Cautions Investors To Prepare For $2,700 Target 2 months ago\n\nSolana, Others Record Market Gains Amidst Market Crash\n\nWhile the general cryptocurrency remains in a downtrend, with the total market cap down by 1.02%, several assets have managed to stay afloat providing investors with some form of relief. According to data from CoinMarketCap, Solana is one of these assets, with a 4.99% daily gain alongside other prominent tokens such as Avalanche (AVAX) and Shiba Inu with respective gains of 3.99% and 3.70% respectively.\n\nNotably, prominent meme coin dogwifhat leads the resistance with the highest daily gain of 12.28%.\n\n\n\nFeatured image from Bloomberg, chart from Tradingview"
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBGWHp1QUNrdlFtOVFEaHlnSUdGMUpob2Q0eGkwN0Ftc3A3b2pjeDFOaUtwcTZfVFdUOF95UW90Q0ZyOXc5eTVKUjdOVUItRXZxNkJMSXZweW1iajMxWlpySlRjSi1ockdfMU11QXZWQ0fSAXZBVV95cUxNTlBXUGw0MHpTMWYyTWV0U0d3OGlTUmZnRG91TC1DTVNFb29JNDFTdFVseXF4cF8wV3dzcGtjR21EeHZKbWlVYWtUX3liMFpZRFlaS2w2TUlnVjVmRG92Tm10NEpfNjRkQUJtVlJwN28zZ1lfeDh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 03:31:49 GMT",
        "title": "Ethereum Dives Below $3K: What’s Next For The Crypto? - NewsBTC",
        "content": "Ethereum price remained in a bearish zone below $3,250 zone. ETH dived below the $3,000 support and even tested the $2,850 zone.\n\nEthereum started a fresh decline below the $3,120 and $3,000 levels.\n\nThe price is trading below $3,000 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $3,000 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could correct losses, but upsides might be limited above the $3,120 zone.\n\nEthereum Price Dives 8%\n\nEthereum price failed to start a recovery wave above the $3,150 and $3,200 resistance levels. ETH started another decline below the $3,120 support zone like Bitcoin. There was a move below the $3,050 and $3,000 support levels.\n\nThe price declined 8% and even tested the $2,850 support. A low was formed at $2,862 and the price is now consolidating losses. The price is showing a lot of bearish signs and trading well below the 23.6% Fib retracement level of the downward move from the $3,425 swing high to the $2,860 low.\n\nEthereum is trading below $3,000 and the 100-hourly Simple Moving Average. If there is a recovery wave, the price might face resistance near the $2,960 level. The first major resistance is near the $3,000 level.\n\nThere is also a key bearish trend line forming with resistance near $3,000 on the hourly chart of ETH/USD. The next major hurdle is near the $3,120 level or the 50% Fib retracement level of the downward move from the $3,425 swing high to the $2,860 low.\n\nA close above the $3,120 level might send Ether toward the $3,200 resistance. The next key resistance is near $3,250. An upside break above the $3,250 resistance might send the price higher toward the $3,350 resistance zone.\n\nMore Losses In ETH?\n\nIf Ethereum fails to clear the $3,000 resistance, it could continue to move down. Initial support on the downside is near $2,850. The first major support sits near the $2,800 zone.\n\nA clear move below the $2,800 support might push the price toward $2,720. Any more losses might send the price toward the $2,650 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 zone.\n\nMajor Support Level – $2,850\n\nMajor Resistance Level – $3,000"
    }
]