[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPdXgtTzE3T01LZkdGRjhLbFdpUnpHVW9jLU9tX3dDZ0IxdHR4cGZURFZ0Y25FSngzbXM5a0Zac1M4TEFXY01vTHlZVnBRRUNsVG1pVmladUp1by1mWkowdkNQUUE1TzVGaHk3RDJFaERMY1ZwM3ZWWlhMc1o5V3dabw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "The future of spot ethereum ETFs - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nFuture of spot ethereum ETFs\n\nRic Edelman, head of the Digital Asset Council of Financial Professionals and former head of Edelman Financial Engines sits down with CNBC’s Bob Pisani to discuss the next crypto ETF the market is gearing up for and the state of spot bitcoin ETFs."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQaGJ6RElPWXhnU0ViY0RPZGNaWXRNRG1oS0JQTEJZWnhOX0lqVnZvWkRKY3E3ZDlBVU13Smc4TFItMHMtaU0zQmExUTJuYkFCR2ZpbmlZVWtfR1ZLQ241UTZuS2pDZDZ2VXBQU2l5dTJjQmhoWG5ENUVhUlBGdnpBNWZtN0Z5a1ZrcDBHS2E3TXpZOEkzd2xzR0FiY0FqUWU5Y1BLSlZJOTliSzlmVk4tLXhlZ0dxdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Two Reasons Why Ethereum ($ETH) Is Underperforming Bitcoin ($BTC) As an Asset - CryptoGlobe",
        "content": "The Ethereum blockchain has long faced issues with scalability, particularly during high activity periods that lead to network congestion, slow transaction times, and high gas fees. These challenges affect user experience and limit the network’s capacity to support a diverse range of applications. The Dencun upgrade, introduced in March 2024, represents a significant advancement towards resolving these issues by laying the groundwork for future scalability improvements.\n\nDencun, which combines elements from the Cancun and Deneb upgrades, does not provide an immediate solution to all scalability problems. However, it is a crucial milestone in Ethereum’s development. Central to the Dencun upgrade is the concept of “proto-danksharding,” which sets the stage for future sharding implementations. Sharding involves partitioning the blockchain into smaller shards, each capable of processing transactions independently. This parallel processing is expected to substantially increase Ethereum’s transaction throughput in the future. While Dencun does not implement sharding directly, it establishes the necessary technical foundation for its eventual deployment.\n\nThe primary focus of Dencun is not directly reducing transaction fees on the Ethereum mainnet. Instead, it aims to optimize fees within Layer 2 networks. Layer 2 solutions function on top of the Ethereum blockchain, aggregating transactions off-chain before submitting them back to the mainnet. This process helps mitigate congestion on the main network and can potentially lower fees for users.\n\nA significant feature of Dencun is EIP-4844, which lowers the cost for Layer 2 networks to submit their bundled transactions to the Ethereum blockchain. This improvement is expected to enhance the efficiency of Layer 2 solutions, potentially reducing fees for their users. However, the actual fee reductions observed may not be as substantial as initially projected, and the long-term effects on fees will need further monitoring.\n\nOne unintended consequence of the Dencun upgrade has been its impact on the Ethereum supply. The reduction in transaction fees led to a decrease in the amount of ETH burned. Previously, higher network activity and fees resulted in more ETH being burned, contributing to a deflationary effect on its total supply. Following the Ethereum Merge, which transitioned the network from proof-of-work to proof-of-stake, this deflationary mechanism was an anticipated benefit. However, with fewer fees being burned and the natural increase in supply, the total supply of ETH has started to grow at a faster rate, shifting back towards an inflationary model.\n\nThe Dencun upgrade has prompted a fresh analysis from CryptoQuant, a respected South Korea-based blockchain analytics firm. This upgrade, according to CryptoQuant, may significantly alter Ethereum’s progression towards becoming an “ultra sound money” – a concept that denotes a currency that appreciates or maintains its value over time.\n\nSee our full analysis 👇https://t.co/6KYAcn0KQ8 — Julio Moreno (@jjcmoreno) May 13, 2024\n\nThe other problem for Ethereum is that once the U.S. SEC approved 11 spot Bitcoin ETFs, many people thought that probably within a few months, the SEC would start approving some, if not all, of the several pending spot Ethereum ETF proposals. Unfortunately, with the SEC’s recent crackdown against the Ethereum ecosystem (e.g. Uniswap receiving a Wells notice last month), it seems that SEC Chair Gary Gensler sees Ether (ETH) as a security (which is what Consensys CEO Joseph Lubin suspects) and therefore the expectations for spot Ethereum ETFs getting approved in the U.S. sometime in 2024 have been dramatically lowered. Eric Balchunas, a Senior ETF Analyst at Bloomberg, says he wouldn’t be surprised if we do not see an approval until 2025.\n\nBloomberg ETF analyst Eric Balchunas said that the U.S. SEC may reject Ethereum spot ETF on May 23, and approval may not be until the end of 2025. If Trump wins, the SEC will likely face a change in leadership that may be friendlier than Gary Gensler's. DLNews… — Wu Blockchain (@WuBlockchain) May 11, 2024\n\nThe following ETH-BTC price chart shows the extent of ETH’s underperformance against BTC: In the past one-year period, ETH is down 30% compared to BTC.\n\nFeatured Image via Pixabay"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNWlFxRDUwc185WWF1VFhqcF8tLThiaVZBTlF5czJTNksxMkZnb3JKN044S3ZPSlpLYlFLOWdTTzRrLUw5RVpESkRSSFFONUIwbVQzYVM1WEpSbENEYkFEdWpIT2Y2d1k3d0tvbFdEcHFLOGRhWVZVUjU1Snd5VE0yZ3ZOTVljbVBNMGRNYVN3LWZySWp0Wk5MbGpqZVlTcnl4Qmp6eC14QWxRT1NEYUlZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Ethereum has been increasingly inflationary for over a month as fees hit all-time low - CryptoSlate",
        "content": "Since Ethereum moved from proof-of-work to proof-of-stake in 2022, it has become a deflationary asset. The total circulating supply of Ethereum (ETH) currently stands at 120,105,358 ETH, representing a 415,680 ETH decrease from the supply levels observed before The Merge.\n\nHowever, over the past 30 days, Ethereum’s supply dynamics have shifted, with 35,548.72 ETH being burned (removed from circulation) and 75,072.43 ETH being issued as block rewards to validators. The net result is a supply increase of 39,523.71 ETH during this period. Data from Ultrasound Money show that, based on the supply change over the past 30 days, Ethereum’s current annualized inflation rate is approximately 0.4%.\n\nIn comparison, Bitcoin’s inflation rate stands at 1.068%, while Ethereum’s Proof-of-Work (pre-merge) inflation rate would have been significantly higher at 3.74%. If the current 30-day rate persists, projections for the next year indicate that around 433,000 ETH will be burned, and 914,000 ETH will be issued, creating a net gain of 481,000 ETH.\n\nData from OKLink shows a continued decrease in ETH burned since March, when an average of around 6,000 ETH was burned daily. Since the start of May, only around 900 ETH has been burned daily, the lowest average levels since The Merge.\n\nThe recent Dencun upgrade on the Ethereum network has had a notable impact on the ecosystem. The upgrade has led to a decrease in layer-2 transaction fees and overall network activity. Consequently, this has seemingly resulted in a lower burn rate, pushing Ethereum’s supply back into an inflationary state.\n\nData from Etherscan and Ycharts shows that gas fees have also plummeted to around 5 gwei, the lowest on record.\n\nInterestingly, Ethereum’s inflation rate has drawn closer to that of Bitcoin, especially in the aftermath of Bitcoin’s halving event last month. As per data from the past 7 days, Ethereum’s inflation rate for the past week stands at 0.54%, just 0.29 percentage points higher than Bitcoin’s post-halving rate of 0.83%.\n\nEthereum’s inflation rate has been steadily increasing since February when it reached a local low of -2%.\n\nWhile Ethereum’s supply has become slightly inflationary in the short term due to reduced network activity and burn rate, its overall supply is still decreasing on a net basis. This can be attributed to EIP-1559, which introduced a burn mechanism for a portion of transaction fees.\n\nLooking ahead, Ethereum’s inflation rate and supply dynamics will likely be influenced by future network upgrades and adoption trends. If transaction fees and burn rate remain low, Ethereum may continue to experience inflationary pressure in the near term. However, the long-term trajectory will depend on the success of upcoming upgrades and the overall growth of the Ethereum ecosystem.\n\nThe adoption of layer-2 networks and the recent increase in layer-3 network activity reduces load from the Ethereum mainnet, yet it does so at a cost. However, the current increase in L2 and L3 activity is not at a level to create sufficient L1 transactions to keep Ethereum deflationary. Only time will tell whether the ultra-sound money concept for Ethereum will be retained in a world dominated by L2 and L3s."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE85cnRNQVhDX2RDMHRBdlJlMnZBX1hXeUtCT0FkeVpSOG13bEJsRHFiN0ZXYVhNaEZmQXI3bDlLdU95ODBacFNma1ZabGdYX1VJZzNnb1Y2ZjlFM2J1a0U3MHZJaHnSAWpBVV95cUxQdElTejl1YnVXYVQzN212dG5OUFJ5b19mN2lSX3hlSFNFYlRVSE9sRUMzdVM1djVGT3NvR0h6SE1DTWRWbG56TTB0NWJHNFZyeFR5WUZ5cmFQbVlXLVNuZXBtS1Nyak0zY1Bn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Here's Why Ethereum ETF Could Be Denied - U.Today",
        "content": "According to James Seyffart, one of the leading ETF analysts, it is increasingly likely that the US Securities and Exchange Commission is going to deny a slew of Ethereum ETF applications this May by claiming that the underlying cryptocurrency is a security.\n\nAdvertisement\n\n“Not a guarantee that they will do this but I think this almost guarantees that the SEC is at least considering it,” Seyffart added.\n\nThis came after finance lawyer Scott Johnsson opined that Ethereum’s legal status was likely to appear in the agency’s upcoming ETF order.\n\nAccording to Johnson, the SEC is supposed to provide a \"notice of the grounds for disapproval under consideration\".\n\nAdvertisement\n\nThe SEC claims that it was improper to offer commodity-based trusts shares since the underlying asset is a security.\n\nNotably, this wasn’t an issue that Bitcoin ETFs had to deal with.\n\nAfter months of kicking the can down the road, the SEC is supposed to make its final decision regarding VanEck and ARK's Ethereum ETF filings on May 23 and May 24, respectively.\n\nThe industry consensus appears to be that these applications will be shot down by the SEC due the lack of engagement with issuers. However, it remains unclear what will be the exact reason behind this rejection. According to Bitwise's Matt Hougan, Ethereum ETF products will be rejected due to insufficient data.\n\nApart from VanEck and Ark Invest, several other big players, including BlackRock and Fidelity, are vying to launch a spot Ethereum ETF.\n\nAs reported by U.Today , Grayscale, which scored a big legal victory against the SEC last year, recently withdrew its “Trojan horse” Ethereum futures filing. This indicates that it does not intend to pursue another lawsuit against the agency.\n\nThe SEC has faced a lawsuit from Ethereum backer ConsenSys over its attempts to label the leading altcoin as a security. However, BlackRock’s Larry Fink recently stated that such a designation wouldn’t necessarily prevent them from launching an Ether ETF."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1QOXJmN0dOZldoRlJ5QkhIWFVxUG1pQzB2V0xub1V2TW5IcERhNUV4RTUzNk1lZDRSUlozaFBRc1JaRHVCTjY1OVFyOHlwd2U2Q2FmTlhBMjE0OWN2blNEQVQtRFhTMnZvVXJ3RExIQVRndG5PTC1tQzlUOHLSAYQBQVVfeXFMTlI5b1p5UDZvRWU4LVVKelZQQlZmeG5kUmZSd0JDTWxPZ3RCSWZscEZuOHpobnZfelpremdMeHJhM29vWmlfbGVoSngyR05xcnVtcGU1MVRDZkVKR2JESm8tRDgwaTVSVkE0MHJfM2dlRURiQVZWcmVhSzZNcU5sQXdDLU4y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Will Ethereum Be Declared a Security By the SEC Next Week? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Securities and Exchange Commission (SEC) may soon assert that Ethereum is a security in its expected rejections of several spot Ethereum ETF applications, a lawyer who specializes in digital assets warned Tuesday.\n\nThe regulator is due to decide on VanEck’s application for such a product on May 23, followed by a final decision deadline for ARK Invest/21Shares’ application the next day. BlackRock, Fidelity, and Grayscale also have applications on the SEC’s desk.\n\nIn March, the SEC put forth potential “grounds for [the] disapproval” of BlackRock’s application and Nasdaq’s proposal to list BlackRock’s product. One question the SEC posed in its notice is whether Nasdaq “properly filed its proposal” under the exchange’s rules for so-called Commodity-Based Trust Shares.\n\nRequiring that trusts hold a “specified commodity,” Scott Johnson, a general partner at Van Buren Capital, described the question’s inclusion as telling.\n\nAD\n\nAD\n\n“The obvious purpose is to potentially deny on the basis that these spot filings are improperly filed as commodity-based trust shares and do not qualify if they are holding a security,” he wrote on Twitter.\n\nRather than indirectly excluding the digital asset as a commodity, the SEC could explicitly assert that Ethereum is a regulated security in its expected ETF denials. But that’s “highly unlikely,” Terrence Yang, a managing director at Swan Bitcoin told Decrypt.\n\n“Gensler and his team, they’re political animals,” he said, arguing that the political backdrop surrounding crypto has grown too tense for a move that would likely spark backlash from crypto-friendly politicians, including Former President Donald Trump.\n\nFollowing the SEC’s approval of spot Bitcoin ETFs in January, hopes that spot Ethereum ETFs will get the same treatment have plummeted. On the blockchain-based prediction platform Polymarket, traders penciled in a pessimistic 16% chance that ETFs are approved this month, as of this writing.\n\nAD\n\nAD\n\nEven though SEC Chair Gary Gensler has publicly affirmed that Bitcoin is a commodity, the Wall-Street cop has been tight-lipped when it comes to Ethereum, refusing to answer questions about the cryptocurrency’s regulatory status as recently as March.\n\nLast month, a lawsuit filed by the Ethereum software company Consensys alleged that the SEC has internally viewed Ethereum as a security for over a year. Among other requests, the firm asked a federal judge in Texas to declare Ethereum is a commodity.\n\nPrior to its approval of spot Bitcoin ETFs in January, the SEC denied similar applications for a decade, citing concerns of fraud and market manipulation in Bitcoin’s spot market. So-called surveillance agreements monitoring the Bitcoin futures market for ETFs that were already approved wouldn’t be sufficient, the SEC said.\n\nEventually, a federal appellate court found that logic faulty, ordering the SEC to vacate its previous rejection of Grayscale’s application to convert its flagship trust into an ETF. Given the SEC approved Ethereum futures ETFs last October, Yang said a similar headache for the regulator could follow if it points to market manipulation again.\n\n“They can do it, but they should expect to get sued, and I think they'll get attacked politically through the heavy lobbying that the well-funded crypto industry has,” he said.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPQ1owd01CdmxhVXRnRTY5SXFBN2ZUc0FYRWJLZnNXV0RKbEs1WjgzR25NRUlzZzZ2MDNBQmFaZXdma0lieENJbzVSOEx2Q19hX2NsdHdiSlc2ajZaNnBrZ0lSLUNmY01tZG16b29SbS1LMUJLOGR3MjJoa0RqZW9zNUVIeERqc2piT0JxODNMbGM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Is Ethereum Still a Millionaire-Maker Crypto? - The Motley Fool",
        "content": "If you are thinking about investing in Ethereum, focus on future growth potential, not historical track record.\n\nSince its launch in July 2015, Ethereum (ETH 0.10%) has skyrocketed in price from just $0.31 to $3,000 today. That's a nearly 10,000-fold return on your investment! If you had invested just a few hundred dollars in Ethereum a decade ago, you'd likely be a millionaire today.\n\nBut does Ethereum still have the power to make you a millionaire? While it's hard to argue with Ethereum's historical track record, things get a bit dicier when you consider its future prospects.\n\nCompetitive landscape\n\nWhen Ethereum launched back in 2015, it stood alone as the only smart contract blockchain platform. And, as such, it had an incredible first-mover advantage. Arguably, it was not until 2020, when blockchain upstart Solana (SOL -1.47%) appeared, that Ethereum saw its first legitimate rival.\n\nTo put that into perspective, imagine if your favorite Silicon Valley tech company had an incredible five-year head start on the competition. After that time period, it would probably appear to have an insurmountable lead when it comes to market share, intellectual property, and customer lock-in. Quite frankly, it would look unstoppable.\n\nThat's why I think Ethereum's ability to replicate its historical track record is limited at best. There's simply too much competition now, and Ethereum is no longer the only major Layer-1 blockchain. Check for yourself -- three of the top 15 cryptocurrencies by market cap are direct Ethereum rivals. That type of competition simply did not exist back in 2015.\n\nIncremental vs. disruptive innovation\n\nMoreover, I've soured a bit on Ethereum's endless blockchain upgrades. Yes, the 2022 blockchain upgrade known as The Merge was impressive. People have compared that technical feat to changing the engine of an airplane while in mid-flight. The Merge resulted in a total transformation of Ethereum. In the process, Ethereum became faster, cheaper to use, and more efficient in processing transactions.\n\nHowever, Ethereum originally promised us 1 million transactions per second, and we're nowhere close to that. Of even more concern, Ethereum now relies on a complicated mix of Layer 2 blockchains for scalability and functionality. The core Ethereum blockchain (i.e., the Layer 1) just isn't fast or efficient enough to handle current transaction volumes. So, we have several more upgrade cycles to go, each filled with new tweaks and upgrades.\n\nThere's nothing wrong with incremental innovation, of course. But there's a big difference between incremental innovation and truly disruptive innovation. And that's what has me concerned about Ethereum -- we may have witnessed the end of disruptive innovation with The Merge. And that's going to open up the door for fast, nimble competitors to challenge Ethereum.\n\nThe SEC and regulatory risk\n\nFinally, there's the pesky little matter of the Securities and Exchange Commission (SEC). Ever since The Merge, the SEC hasn't quite made up its mind about whether Ethereum is a commodity or a security. When Ethereum converted into a proof-of-stake blockchain as part of The Merge, it changed the way that people interact with the blockchain, with possible regulatory consequences.\n\nFor example, the process of staking crypto could be interpreted by some as \"the investment of money in a common enterprise with a reasonable expectation of profits to be derived from the efforts of others.\" According to the SEC, that would make Ethereum a security.\n\nThis might sound incredibly wonky from a legal perspective, but it matters for investors. There are some Bitcoin maximalists delighting right now in Ethereum's potential regulatory quandary, and there is a very real risk that the SEC could deem Ethereum to be a security. If that happens, all bets are off. I don't think it would pose an existential risk for Ethereum, but it would certainly scare away a lot of investors.\n\nThe myth of the 1,000x crypto\n\nIf you have $1,000 to invest in crypto today, you would need a 1,000-fold return on your investment to become a millionaire. So, let's reframe the original question of Ethereum being a millionaire-maker crypto in the following way: Can Ethereum increase 1,000 times in value from its current price of $3,000?\n\nThat would suggest a stratospherically high $3 million price tag for a single Ethereum coin sometime in the near future. Given Ethereum's circulating supply of 120 million coins, that would imply a total market cap of $360 trillion! By comparison, the total market cap of the S&P 500 these days is about $50 trillion.\n\nAt the end of the day, investing based only on past performance is like driving a car by only looking in the rearview mirror. So stop focusing so much on Ethereum's historical track record, and focus more on how it's going to create value in the future."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNZTV1bS1ZWWh2NEpOMlU1clNqX3Vub0VIdW1KUV9TSUc3eXRxU3FEeEFEUzBvUGxPY0hfWjNUOXhVd1dqZ3BRZ2JkUnBBQ2NaNnVxdXlzdDlSX3JkRl85eWRoZFlpOHFiNl92ZzZFLXhFYWxIVkVVYzJ0YjgwUFhab1BWcFdzRzJ4bnUwcWhXN21Id2hJcS1sRFBFemtrOV9nM2dWTEhXNmxfZ9IBrwFBVV95cUxNNUI1T25uVlM1OGZ4MDEyalY2VmFERzA0NlRlTVVSWVAzZFFfOWxFUEhDRmp5aTN3WWJqYWNDSy1BVnFBNS0zYzBQQWtkQWEtWkFKSkRkUFdlWDY4YWVMVzZzaXE2NlVIODlnRDFITmNmWDRlOGFXRmo1U1AyZ09XemkwYXNQQTc3LThrN3lIRG9zaFYyamxsdXVwX1ktcVhBYzY2enV1bFBkRnU0SFNj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Why A Drop In The Price Of Ethereum Will Be Bullish Long Term - Investing Haven",
        "content": "There is a lot of fear for a decline in the Ethereum price. While the expectation of a drop is justified, confirmed by our latest Ethereum outlook research, it would not be a bad thing. Here is why an Ethereum price drop could be very bullish, long term that is.\n\nRelated – Can Ethereum Hit $100,000? An In-depth Analysis.\n\nThe way to think of financial markets, Ethereum being no exception, is in terms of structures. Particularly, chart structures with areas defined by support and resistance is the most simplified way to approach financial market analysis.\n\nEthereum’s 2024 support and resistance\n\nWe highly recommend not getting lost in the wild wild west of social media. Check this, it’s pure noise.\n\nEveryone has an opinion nowadays. Those who are able to collect lots of likes seem to be the smartest in the room. Very often it’s the exact opposite.\n\nIn order to understand the investment opportunity for Ethereum, we do the simplest possible thing, i.e. zoom out and remove all annotations.\n\nBelow is the weekly chart, no trendlines nor annotations.\n\nWhat do you see? How does it compare to the pattern in 2019?\n\nThere is tons of resistance even if ETH would rise to $4400. There is amazing support right above $1750, arguably in the $2200 area.\n\nIn case ETH drops in the coming months, it could be setting a gigantic cup and handle pattern. That’s not bullish, that’s a very bullish pattern!\n\nFrom our ETH predictions page:\n\nInvestingHaven’s Ethereum price forecast for 2024 is based on the bullish cup and handle chart formation. ETH should drop to its 50% Fibonacci level $2,250 in order to be bullish. A drop to $2,250 should offer an epic buy opportunity in 2024.\n\nEthereum’s 2025 chart pattern\n\nAs explained above, the $2250 area is a key Fibonacci level.\n\nNow, what follows may be counterintuitive to most, but it’s a reality – a drop may not feel good, but a drop to specific levels may be very good!\n\nProvided Ethereum respects $2250, on an 8 to 13 day closing basis, it will come with a very bullish outcome in 2025.\n\nA bullish cup and handle formation, which is what we forecast will be the outcome in case of an Ethereum price drop, has the intention to move much higher than resistance. For ETH, we expect a breakout to ATH, with targets well above former highs.\n\nFrom our Ethereum predictions page:\n\nInvestingHaven’s top analyst has a very bullish ETH forecast 2025. If the area $2,050 to $2,300 holds strong on a 3-week closing basis, ETH will resolve higher in 2025. The current long term bullish chart pattern has bullish targets in the $5,000 to $9,000 area provided support is respected.\n\nInvalidation considerations\n\nNow, there is always the possibility of an invalidation. In the case of ETH, what if it continues to rise to $5000 in 2024?\n\nWe don’t see this happening, there is not enough momentum in markets.\n\nMoreover, a rise to $5000 would qualify as a breakout, so the targets in that scenario would be much higher.\n\nIt’s one thing to rise to $5000, it’s another thing to continue to rise well above $5000.\n\nA rise to $5000 will be confusing for investors and traders alike – which decision do you take at $5000 in 2024?\n\nHowever, with a cup and handle formation, a rise to $5000 (which we anticipate will occur in 2025) will be very bullish. The take-away: it will continue to rise well above $5000.\n\nWhen does our bullish cup and handle forecast invalidate? If ETH will have risen well above $5000 by Sept of 2024. Unlikely to happen, also not good, long term, if it would happen.\n\n10-YEAR ANNIVERSARY OFFER: Go to our anniversary deals >> InvestingHaven.com celebrates 10 years. Temporarily, you can enjoy a discount on our premium gold/silver and crypto reports. Or you can become a VIP member. Receive our crypto FREE newsletter alerts Download 50 crypto investing tips"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPX1AyS09BNnFETzNJMF90UXE2R21rZUxrNjdDN0p3M2ZlS2FLeW9yS05Pdnp2SW1aTkNGcUYzdk5uQS1Vd2NtTjFxZ2pjYzZ5dnpDZzVCYmlnQUU3eFM3VzVHall6Y2FmR0NmeEo4enhiM1FYTnc2cXFfVTJudEY5VnBMMm9OVlRTWjJB0gGQAUFVX3lxTE1wTlNmUEJwRXdvRTlfMEQ1ZUUxWHBrWnVWVEF4SGhEQ1k3aUFGeE1TSnlCNnltQVZzWTU3elhvblRLX1g0ejFSYW13RjA3VTJqbGJTc0piQ29pZmxuWjlhNWtjdzlvZG5YWV9GTU5EOHFYanZyT3ZfY1BVWHlBZGFSZWxvbXR4M0dQOS0zWEJUWg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "U.S. regulators shun spot Ethereum ETFs: What about ETH’s price? - AMBCrypto News",
        "content": "Expectations for an Ethereum spot ETF has gotten significantly low in the community.\n\nEthereum’s market performance continues to lag behind the majority of its peers.\n\nGary Gensler’s SEC is known for playing power games with the cryptocurrency industry, like taking their time to approve any kind of application for crypto products.\n\nThey eased up a bit this year with the approval of eleven spot Bitcoin [BTC] ETFs.\n\nEthereum Spot ETF, when?\n\nNow, all eyes have turned to Bitcoin’s immediate sibling, Ethereum [ETH]. Applications have been filed quite some time ago for what the community sees as Gensler’s only preferred crypto to have its own spot ETF.\n\nNone has been approved, and the SEC has been noticeably quiet about it all. Just a few days ago, Grayscale withdrew their application for the ETH ETF., and didn’t reveal their reasons for it either.\n\nThe lack of engagement from the SEC with applications from ETF issuers plus Grayscale’s withdrawal have fueled speculation in the community that approval is not on the horizon.\n\nThis sentiment is mirrored in the market, with outflows totaling $14 million last week, according to data by CoinShares.\n\nFurthermore, ARK Invest and 21Shares have revised their proposal for a spot Ethereum ETF, removing plans to engage in staking.\n\nIn the latest filing, submitted on Friday, the previous clause that allowed 21Shares to stake a portion of the fund’s assets through third-party providers was omitted.\n\nBloomberg ETF analyst Eric Balchunas mentioned that this update could be an attempt to refine the application based on possible feedback from the United States Securities and Exchange Commission (SEC)/\n\nHowever, there have been no official statements.\n\nBalchunas also proposed that this amendment might be a strategy to minimize the details the SEC could use to potentially deny the application.\n\nEthereum’s market movements\n\nTurning our attention to Ethereum’s market, the second-largest cryptocurrency in the world is not having a good time at the moment.\n\nThough all the other cryptos in the top ten have seen modest rises in the past twenty-four hours, Ether hardly budged. At press time, it is still way below its critical support level of $3,000.\n\nData from Santiment reveals that there is a lot of bearishness among Ethereum traders.\n\nTrading volumes have gone down, liquidations are low, but not because investors are staying put, but likely because they’re bored.\n\nUnlike Bitcoin, Ethereum hasn’t made any kind of major price movements this year. And the bulls are now unimpressed.\n\nAMBCrypto took a look at the ETH/USDt pair on TradingView and discovered extreme volatility with multiple ups and downs.\n\nThe highest peak approaches the $3,340 level, indicating strong buying interest, while the lowest nears $2,840, where selling pressure intensifies.\n\nThe price repeatedly tested support around $2,900 this past month, as indicated by multiple touches on this line but without actually breaking it, showing resilience at this level.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nRecently, the price shows a slight upward movement around $2,968, suggesting a tentative recovery or consolidation phase. But still, it failed. Ethereum was worth $2,958 at press time.\n\nGiven this context, the short-term prediction for Ethereum would lean towards a continuation of bearish trends."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOTlpoTkxWUENncWpiSHljYmpQdm5STUFDVDZkd214T1FFT2JIVlFKTjRlQUZ2U29wdF92ak4zOGg0eS1BLTVoN2lYSi1ndHI5Tkw3bmxLM2VUX05oZ3NuNm1pcVRJbnJFR0ZSYWowVGhDbGQ1dy1qLWQ5OFJMekZBckxMOURCZ2xvLUFyWi1GVWp4SnFQSE1ZM291Y19XTUt0T0VLRndGRWU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "How this crypto hedge fund will trade the Ethereum ETF decision - DLNews",
        "content": "The SEC is likely to reject Ethereum spot ETFs.\n\nBut Ethereum may still rise in the aftermath of the event.\n\nThe deadline for the Securities and Exchange Commission to approve or deny spot Ethereum exchange-traded funds is only nine days away.\n\nThe outlook is gloomy. Bloomberg Intelligence ETF analyst Eric Balchunas told DL News that he doesn’t expect approval before the end of 2025. Bettors on Polymarket, meanwhile, ascribe a 14% chance of the ETFs getting approved before May 31.\n\nBut the consensus around the SEC’s decision may offer an opportunity to crypto traders.\n\n“Sell the rumour, buy the news”\n\nThere’s an expression in markets: Buy the rumour, sell the news.\n\nIt refers to the practice of accumulating an asset — a crypto coin, or a company stock — in the lead-up to a scheduled, bullish event, and dumping it after the announcement.\n\nThe launch of the Bitcoin spot ETFs is a good example: Bitcoin rose 77% in the three months leading to the approval, but crashed 20% immediately after the ETFs were greenlit.\n\nThe Ethereum ETFs might offer a similar strategy, but in reverse, Quinn Thompson, founder of crypto hedge fund Lekker Capital, told DL News.\n\nHe suggested that the rejection of the Ethereum ETFs may lead to some bullish price action.\n\nJoin the community to get our latest stories and updates\n\n“It’s clear that positioning and sentiment is skewed bearish going into the event, given consensus is strongly towards a rejection,” Thompson said. “But given everyone is largely on one side of the boat going in, you should be looking to fade [the market’s expectations].”\n\n”In these situations, it takes a drastically better upside or worse downside to not fade consensus going [into the event],” he added.\n\nIn other words, the rejection is likely priced in already, and market participants may find themselves caught off guard if Ethereum suddenly pushes higher.\n\n“My best guess is that it’s a nonevent, as a likely denial is hopefully incorporated into the market,” Brian Rudick, senior strategist at crypto trading firm GSR, told DL News.\n\nThe warning signs are all there, Rudick said — the SEC’s lack of engagement with prospective ETF issuers, Ethereum’s uncertain regulatory status, and the agency’s investigation into the Ethereum Foundation.\n\nThompson, meanwhile, said that the SEC’s reasoning behind the anticipated rejection would likely affect any trading strategy.\n\n“If there’s a rejection due to litigation, I could see that bringing the market down a bit,” he said.\n\nThe SEC has until May 23 to decide whether to approve or reject asset manager VanEck’s application to launch a spot Ethereum ETF.\n\nCrypto market movers\n\nBitcoin is up 1% over the past 24 hours and is trading at $61,835.\n\nEthereum is up 0.3% to $2,918.\n\nWhat we are reading\n\nTom Carreras is a markets correspondent at DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNVXkxMS1WSllfX0JOTWJoY0VoWFRTTDVNU1dLS2M0aWlYRW12bjN0NEpXaF9OeTJ5X3ppSUFlTWpydmItT3NVdXNzS2xpOGtRQjVhYTdHM2UtVW5WeDFHWXd2RTY4UnlWRXREdzhZenpMd2J3bng1R2tuNlZDc3NaYVB1Mkl6TUdPMUVRVnBWS21HUWpkeHNr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Prediction: Ethereum Will Reach $5,000 by the End of 2025 - The Motley Fool",
        "content": "If Ethereum is going to hit a new all-time high of $5,000 in 2025, here's what needs to happen.\n\nIt's been a strange year for Ethereum (ETH 0.02%). The world's second-largest crypto exploded out of the gate early, soaring from $2,200 in January to $4,000 by mid-March. It looked like Ethereum was easily going to reach the $5,000 mark by the end of the year.\n\nBut that's not what happened. Ethereum fell in value after hitting its high-water mark of $4,000, and now sits right at the $3,000 level. The good news, though, is that there are two key catalysts that could help Ethereum reach the $5,000 level by the end of 2025.\n\nThe arrival of altcoin season\n\nFirst and most importantly, there's the arrival of \"altcoin season.\" This refers to the period of the crypto bull market cycle when lesser-known altcoins explode in value. This typically happens during the early stages of a Bitcoin halving cycle, when investors start to diversify their holdings in search of higher returns.\n\nConsider what happened during the previous altcoin season, which lined up nicely with the start of the previous Bitcoin halving cycle in May 2020. On the date of the halving, Ethereum was trading under $200. One year later, it was trading for $3,800. It eventually went on to hit an all-time high of $4,891 in November 2021.\n\nWhile there's no guarantee that this same pattern will happen again in 2024, it's clear that investors are starting to look around for other places to invest their money beyond just Bitcoin. Thus far, meme coins and AI crypto tokens have gotten all the attention, but the time could be coming soon for larger-cap cryptocurrencies such as Ethereum.\n\nThe approval of spot Ethereum ETFs\n\nThe other big factor would be SEC approval of new spot Ethereum exchange-traded funds (ETFs) similar to the new spot Bitcoin ETFs. Admittedly, these spot Ethereum ETFs would likely not see the same types of inflows as the new spot Bitcoin ETFs, but the influx of new money would still be significant. And that new influx of money would presumably help to push the price of Ethereum higher over the next 18 months.\n\nAs in the case of the Bitcoin ETFs, there are a number of influential Wall Street players fighting to make them a reality. These include the likes of Ark Invest and BlackRock, both of which now have extraordinarily successful spot Bitcoin ETFs. Approval for these new spot Ethereum ETFs was supposed to come in May, but it now looks like the Securities and Exchange Commission (SEC) will push off approval for these ETFs until the end of the summer.\n\nThe impact of these new spot Ethereum ETFs could be huge. Arguably, the primary reason why Ethereum soared in price from $2,200 to $4,000 earlier this year was the expectation that the new spot Ethereum ETFs were coming soon. Wall Street got a bit ahead of itself, and was already starting to price in their impact. So, it's not out of the range of possibility that Ethereum could soar from its current price of $3,000 to $4,000 once these new investment products are approved.\n\nBeware the SEC\n\nThe only problem, of course, is that there's something about Ethereum that the SEC does not like. Ever since Ethereum transformed from a proof-of-work blockchain to a proof-of-stake blockchain in September 2022 as part of The Merge, the SEC has been looking for reasons to classify Ethereum as a security.\n\nRecently, the concerns about potential SEC oversight have returned, and that has had a chilling effect on Ethereum's price. That's why I don't think Ethereum will reach the $5,000 mark this year -- investors need to have absolute clarity about regulatory risk before Ethereum can skyrocket in price.\n\nThe good news here is that the regulatory climate appears to be shifting in Washington, D.C., in favor of pro-crypto legislation. And some lawmakers have spoken out publicly about the potential overreach of the SEC and the need to change crypto's regulatory framework after the 2024 election.\n\nHow high can Ethereum go?\n\nThe future price trajectory of Ethereum will depend, to a considerable degree, on the price trajectory of Bitcoin. If you assume that Bitcoin can hit a price of $150,000 by the end of 2025, as many crypto investors now do, then Ethereum has the potential to soar in value to $7,500.\n\nUsing just a few back-of-the-envelope calculations, it's easy to see why this is possible. A $150,000 price tag for Bitcoin implies a $3 trillion market cap. If you then multiply that figure by 0.3 (which is the ratio of Ethereum's current market cap to Bitcoin's current market cap), you arrive at a market cap figure of $900 billion for Ethereum by the end of 2025. Given Ethereum's circulating coin supply of 120 million, that implies a price of $7,500.\n\nSo, while $5,000 might sound at first like a pie-in-the-sky price forecast, it's really not. In fact, it's a bit conservative. As long as the SEC doesn't get involved, Ethereum has a real chance to hit $5,000 by the end of 2025."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOYzc0UVUxLTVfcUEybTFEQUtGbWxhSjkwWUdjYXhVb2I2b2gtc1BWMk5WcjlZeWQyd3RmSXZUbmpES00yeVVMME1MTVNTM0JCSDh5cW9OeDY2bVJSVlh6QXZXNnpYWmxSMlhCU3BMRUhCTDFGZGlWZGpQWkJXM3Z4Z0p6UdIBiAFBVV95cUxQWlA0U2xYSExwMW0yaVV1ZEFoeFZTeFJCLVdYbF9fcHItMmdrUU5rX0k3cko1d25sLXZ2RzItV2FGRnhKdDRLQUJsOHJqOVpvdklDTDdXdkhmNU5Hek9PVlZKYmotTlIzU1dEY2g1RDZBUll4VmEtNE5CdkMxWEVaTmlsU2g1OXh5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Ethereum sees $12M whale transfer: What about ETH’s price? - AMBCrypto News",
        "content": "Ethereum’s Netflow got more positive.\n\nETH was close to entering the $3,000 price zone.\n\nRecent data indicates that one of the early Ethereum [ETH] holders has transferred millions of dollars worth of ETH to an exchange.\n\nWhile this movement was relatively small, it could contribute to the positive Netflow trend that ETH has been experiencing recently.\n\nEarly Ethereum holder sells most of their holdings\n\nAccording to data from Spot on Chain, a significant transfer of 4,153 Ethereum coins to Coinbase occurred in the early hours of the 13th of May.\n\nThis transfer, valued at over $12 million at the current ETH price, caught attention because the originating wallet is among the asset’s early holders.\n\nFurther analysis revealed that since 2021, this wallet had deposited over 9,000 ETH—worth more than $21 million—to exchanges.\n\nAs of press time, the wallet retained 2,566 ETH, valued at over $7 million. This recent transfer has contributed to the increased positive Netflow observed in Ethereum transactions.\n\nEthereum inflow increases\n\nThe Ethereum Netflow chart analysis indicated a notable increase in positive flow over the last three days. However, it appeared poised to be the highest observed in recent days.\n\nWhile the Netflow stood at around 4,600 and 3,000 in the preceding two days, it has surged to over 18,000 at the time of this writing.\n\nThis surge suggested a significant increase in exchange inflow over the past 24 hours.\n\nFurther analysis of the ETH inflow chart revealed that over 83,000 ETH had entered exchanges at the time of this writing.\n\nConsidering the 94,000 inflow recorded yesterday and the ongoing inflow, we will likely observe further increased activity by the end of the day.\n\nETH price and volume see an uptrend\n\nAnalysis of the Ethereum volume indicated a pickup at press time.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAfter experiencing a drop in the previous trading session, with volume falling below $10 billion, the volume has now reached approximately $10.1 billion as of this writing.\n\nAdditionally, the price of ETH is approaching the $3,000 price zone. The daily timeframe chart examination revealed that ETH had surged by over 1.7%, with its trading price around $2,980."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxON2VIUDZZNk9HVkU5UzVWb0JTTUlGQXN3YjRFSzBNQklmN282VVdOckktY2djTHBaMU1kQW1ISUlHX1Fmc3hucFY3dGRRUko0V1dreUs2bkV2d3M2YUY1M3l0Rm5nQ0NiWHJERTJ2dmFoT09Xd3hRUlNBWUVPUHp1dmY5TFBXZDNuVzAzVW9Fd2dyT3VGWXNfVjVtR3Rqdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Cryptocurrency: “Mass Institutional Adoption” Underway, with Bitcoin, BlockDAG Network, and Ethereum Value Surge - Yahoo Finance",
        "content": "BlockDAG Network\n\nLondon, U.K., May 14, 2024 (GLOBE NEWSWIRE) -- Cryptocurrency is a growing interest for the world's financial institutions and massive investment establishments. Digital finance is no longer just about testing the waters and gaining a broader presence on online portfolios, they are an everyday reality for the majority of the world’s individuals and businesses.\n\nFrom its humble beginnings, the digital asset class has evolved into a global phenomenon. What started as an experimental concept has now become a burgeoning industry, with a market capitalization surpassing trillions of dollars. The proliferation of cryptocurrencies has sparked a paradigm shift in the financial landscape, offering decentralized solutions and disrupting conventional models of banking and commerce.\n\nCryptocurrency and the Mass Institutional Adoption\n\nIn recent years, the industry has witnessed a significant uptick in institutional adoption, signaling a seismic shift in mainstream acceptance. Institutions, ranging from hedge funds to multinational corporations, are increasingly recognizing the potential of digital assets as legitimate investment vehicles and store of value.\n\nThis mass institutional adoption is driven by several factors, including growing confidence in the technology, hedging against inflationary pressures, and diversification of investment portfolios. Moreover, regulatory clarity and enhanced infrastructure have bolstered both institutional and individual confidence, paving the way for broader adoption and integration of cryptocurrencies into traditional financial systems.\n\nBitcoin and other cryptocurrencies like Ethereum and BlockDAG Network have seen a surge in value this year, driven by recent developments in the financial sector.\n\nIn a notable move, some of Wall Street's biggest banks are collaborating with Visa and Mastercard to experiment with tokenizing their assets. This initiative, predicted by Citi analysts to grow into a $5 trillion market by 2030, involves banks like JPMorgan, Citi, U.S. Bank, and Wells Fargo, alongside Visa, Mastercard, and Swift. This could mean a significant step toward mass institutional adoption.\n\nTokenization of assets is considered the \"next generation for markets\" by BlackRock chief executive Larry Fink, who has embraced Bitcoin and cryptocurrency over the past year. BlackRock has quietly begun the second stage of its plan for a crypto-based \"revolution in financial markets\" by launching a tokenized private equity fund. Sovereign wealth funds are also showing interest in digital currencies, with potential trading activity expected in the coming months, according to BlackRock executives.\n\nStory continues\n\nBitcoin: Leading the Way\n\n\n\nAt the forefront of this cryptocurrency revolution stands Bitcoin, the pioneering digital currency that ignited the spark of decentralization. Since its inception over a decade ago, Bitcoin has captured the imagination of investors worldwide, becoming synonymous with the concept of digital gold. With its finite supply, decentralized nature, and immutable ledger, Bitcoin has emerged as a hedge against fiat currency devaluation and geopolitical uncertainty.\n\nIn March 2024 Bitcoin surpassed its previous all-time high, reaching around $73,000 per BTC, boosting the combined market capitalization of cryptocurrencies to approximately $2.5 trillion. Analysts speculate that former U.S. president Donald Trump and the Federal Reserve could trigger a massive price boom for Bitcoin.\n\nBlockDAG Network: A Promising Contender\n\nAmong the emerging contenders in the cryptocurrency space, BlockDAG Network has garnered attention for its innovative approach to blockchain scalability and efficiency and real-world use. Leveraging a Directed Acyclic Graph (DAG) structure, BlockDAG Network aims to overcome the scalability limitations of traditional blockchain architectures, offering high throughput and low latency solutions for decentralized applications. With recent funding of up to $25 million and a growing community of supporters, BlockDAG Network is poised to challenge existing digital projects and reshape the future of decentralized finance.\n\nEthereum: The Surge in Value\n\nAnother key player in the cryptocurrency market experiencing a surge in value is Ethereum, the leading platform for decentralized applications and smart contracts. Ethereum's native cryptocurrency, Ether, has witnessed a remarkable rally, driven by the explosive growth of decentralized finance (DeFi) and non-fungible tokens (NFTs). As the backbone of the DeFi ecosystem, Ethereum continues to attract developers, investors, and users, cementing its position as a fundamental pillar of the cryptocurrency industry.\n\n\n\n\n\nIn conclusion, the mass institutional adoption of cryptocurrency represents a pivotal moment in the evolution of finance, with Bitcoin, BlockDAG Network, and Ethereum leading the charge. As institutional investors flock to digital assets, this 2024 cryptocurrency market stands poised for unprecedented growth and innovation. While challenges and regulatory hurdles remain, the trajectory of cryptocurrency adoption points towards a future where decentralized finance becomes the cornerstone of global finance.\n\nRead About BlockDAG Presale:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram:https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Brown Williams support (at) blockdag.network\n\n\n\n"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPQ1JITF9ySVR5ckxlQTFaZU43RXpaYkhfYUZnNlZjQ0puWUsyVHI1OW9JY0x5dVB1RVBsSzdQcXhMOHRHU3lvN0cwbDVFY29OZ3NsU0VCa1hTNVhlU0tSelUwaW5YVHVsUGk4Q19vaUNFdmN2NnhpN1pjR245UHMzMVd2a05DU09kbVpmWXBuazRIZ9IBlwFBVV95cUxOaG41LTFYQkE4OUFXZG9maGVrdll1TDZ6R3Z0dGxzNnhTQkZPMXhTZTJvbFlBMkswVG9oMXh6LXhRVlI4U0xSdXF1OVUwZEg0enJUNFZzdjFSbkN0SjRLVVJTZzc3aGwzcFhnbER2Mmc1UmRqcDE0R040dTIzN1hXNDVkcmVXY19uc05yelpsRVduZlNST3Bj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Ethereum headed to ‘the grave’ if SEC rejects ETH ETFs, say analysts - AMBCrypto News",
        "content": "ETH faces immense odds as the ETF deadline approaches\n\nAnalysts predict BTC or SOL as potential beneficiaries of ETH woes\n\nEthereum [ETH] could face a bumpy ride and even a massive bloodbath if recent analysts’ outlook comes true.\n\nAccording to crypto analyst James Van Straten, ETH could lose more ground against Bitcoin [BTC] if the SEC rejects spot ETH ETF applications at the end of May.\n\n“Ethereum looks like it’s going to the grave. A rejection of the spot ETF sends the ETHBTC ratio lower from 0.047 to 0.03 as a long-term projection.”\n\nThe SEC’s decisions on most ETH ETF filings are due between late May and August. VanEck and Hashdex’s decisions are due on the 23rd and the 30th of May, respectively.\n\nThese are the immediate dates the markets are tracking from next week. Straten projects that an ETF rejection could further lower the ETHBTC ratio.\n\nThe ratio tracks the value of ETH against BTC. If the ratio is 0.047, it means ETH is worth 0.047 BTC.\n\nIn an ETF rejection scenario, negative market sentiment and sell pressure could make ETH worth less in BTC terms.\n\nEthereum’s inflationary ‘state’ could worsen price prospects\n\nEthereum is currently “issuing” more ETH than it “burns,” making it inflationary. This is the complete opposite of BTC’s fixed supply of 21 million coins.\n\nStraten added that ETH’s inflationary nature and a dip in transaction fees after the Dencun upgrade tipped Bitcoin to lead on the fees front,\n\n“Bitcoin fees continue to outpace ETH, with very little activity occurring on BTC. ETH has now transitioned into an inflationary state (lol). Dencun upgrade reduces transaction fees, and the ETH burn rate increases the supply.”\n\nAMBCrypto evaluated ETH’s inflationary state using Ultra Sound data. It showed that 4.2K ETH was burnt in the past seven days, but 17.6K ETH was issued over the same period.\n\nThat means Ethereum issued four times the token burnt last week, a massive surge in supply that could drag ETH prices down.\n\nBitcoin maximalist Fred Krueger shared the same sentiment. Krueger stated that ETH was “headed lower” after Solana [SOL] outcompeted it through lower fees.\n\n“But then, they (Ethereum) get clobbered by Solana with the low fees. So, enter Phase 2. The new upgrade lowers fees and makes ETH inflationary again.”\n\nBloomberg ETF analyst Eric Balchunas maintained a pessimistic view on May approval for ETH ETF filings.\n\nIf rejection plays out, ETH could witness a massive bloodbath on the price charts and affect its long-term holders, who are yet to book profit.\n\nIt remains to be seen how BTC or SOL will benefit from ETH woes if the SEC rejects the ETFs starting next week."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNV3V2QWwwcGNncFhfVzZkNkk2b1VVZTFJY2p3Zk9aZVN5cjRnSFZvTEVxS3ZLakF3NkxHSkp5V3hEZlEzdTc4VlN6bzhjSDg1Ui04bDNud1FNblhCQWFsTlk2VFg0RS1FTWtXZVMzQ3h6NDhpNkV0QVA3aEpId083bG1JQjlmYnIzNjNXcXFmSGV4OGdSaU9mNXo0dUNycFpfV1BTNzA4eEYxNXNPRGk4VUJCaXAtMVJCcGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Ethereum Hits 1 Million Active Node Validators, Will ETH Price React? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNWW41Nm5CSnI1YmlpYzRZaGFJRWV2Y3NOMEdlVFZ0RzlOUWY4WlNmazdGQVdDenh5N2tFdnBfTE8ybWpNMWp6cWhScmZnQWw5TUF6V25lNXNRUnBJT21lQXVTUEhseHR5dWpwTTdmWnRqaGozSzctWmIwSVlpRWVuMzdsTlEwZ2lnT20za0FaNWo3eTTSAZgBQVVfeXFMT2pDTmNtelRCekptd1A0R0tNM01fX2M3RF8xbWlqanI5XzI3UVM5bDlrLVVKYXFZNHYyZm5WNFlESEJsellXYXNEV0xQMEhSbWV1LVVmemRxUjRGNDdWUXlSZFN1N0pNUWt6Z1N1TjJxYzdqN2JmLW9PeWM3eldvNHpQd1hndThXRTk1MFpzbVNqVC1wRS15RVM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Ethereum: What does ETH’s future hold as investors continue to leave? - AMBCrypto News",
        "content": "Ethereum’s price fell by nearly 10% in a week.\n\nTechnical analysis suggested a possible short-term recovery, with key metrics indicating reduced investor interest.\n\nEthereum’s [ETH] price has seen a significant downturn, with a nearly 10% drop in the past week and 1% decline in the past day, bringing it to a 24-hour low of $2,868.\n\nThis decline is more pronounced compared to Bitcoin [BTC], which has managed to breach notable price marks despite the current market conditions.\n\nThe downturn in Ethereum’s market performance is attributed to several factors, including massive whale activities that have introduced substantial volatility and selling pressure into the market.\n\nIndicators of declining investor interest in Ethereum\n\nFurther compounding Ethereum’s market woes are the declining metrics of network activity.\n\nAccording to AMBCrypto’s look at Glassnode’s data, Ethereum’s active addresses have decreased from a peak of 564,868 in late April to 468,548 as of press time.\n\nThis decline in active addresses is paralleled by a drop in the number of new addresses—from 196,629 earlier in the month to below 85,000 on the 11th of May.\n\nThese metrics highlight a waning investor interest in Ethereum during this period.\n\nFrom a technical analysis perspective, Ethereum has broken significant support structures on the daily chart, indicating bearish pressure.\n\nThe 4-hour chart revealed that, at press time, there was liquidity near the $3,200 region that needed to be taken before any major downward continuation.\n\nThis suggested that Ethereum could experience a short-term rise above the $3,000 mark before potentially dropping to around the $2,800 level, setting the stage for a potential rally thereafter.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nNotably, the deposit of Ethereum into the exchange coincides with the reactivation of two Bitcoin wallets that had been dormant for nearly 11 years.\n\nEach of these wallets, holding 500 BTC, liquidated their entire holdings, which was yet another spot of bad news for investors."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOUm9wX1N2V09nUDVyT2lRMlQ3MFVYM3haRWtVQkV0NVR1WjNKY2pCZUNmazNfT1VsclJjQWk2YVI0MkhEckh0UHduTU80LVZ0VDdQV3lWejc5UmNWR3Q4WDZaLWNHbVBIZzB6MjlRZlZlTGxhN1N3MnVyY05jQXBpY2hCeHhaTHhsUEHSAZIBQVVfeXFMUElxNTA4aEpwN053YUJHTE83eTl4UmY2TFBZTXVsd0k5Q1hPdUg4Sm1nWjJ0Z0I0NUlmRTlzSUE2ZFVaNHl2OUFBT1kyeHZ6MnJmV3VfVi1rRkl4aHVpNnlEenN0N2QyYXpyclM3RnVkaXFaeHM1NHNPcVo1dUcyODdKMHoyckpSbmhHWVh3TGFIUGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Ethereum Co-Founder Joe Lubin: US Crypto Hostility Goes Beyond Biden, Gensler - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn recent months, anger at the U.S. government’s increasing hostility to crypto has—perhaps unsurprisingly—taken on a partisan flavor, with many industry leaders laying blame at the feet of individual Democrats, including President Biden, Senator Elizabeth Warren, and Securities and Exchange Commission Chair Gary Gensler.\n\nBut Ethereum co-founder Joe Lubin sees things differently. To him, the root cause of crypto’s crisis in America may not be the fault of any individual political actor—or even one political party.\n\n“It might go beyond that,” Lubin said in an exclusive interview with Decrypt. “There may be some entity—related, perhaps, to the banking lobby—that is behind this.”\n\nLubin believes that crypto and decentralization pose an existential threat to the global influence long enjoyed by the American state in cooperation with traditional finance. Thus, he figures, some nonpartisan element representing long-term American global interests may be behind the country’s accelerating crypto resistance.\n\nAD\n\nAD\n\nThe idea has echoes of what some prominent people in the crypto industry describe as “Operation Choke Point 2.0,” popularized by Castle Island Ventures partner Nic Carter. The theory goes that there exists a coordinated effort at the federal level, and perhaps beyond, to make it very difficult for crypto companies to do business.\n\nThe speculative agenda borrows its name from the very real “Operation Choke Point” the Department of Justice ran from 2013 to 2017 that sought to unlawfully cut off payday lenders and firearms dealers from banking services. Is the same thing happening now with crypto? Lubin says it may be bigger than even that.\n\n“It's pretty obvious that the United States likes to operate top-down, to control as much of the world as it can—through, especially, financial intermediaries,” Lubin said. “This technology doesn't make guarantees that the bank holding companies will maintain their edge long-term.”\n\n“So maybe it goes deeper,” he added.\n\nAD\n\nAD\n\nAs Lubin sees it, a so-called “clash of civilizations” between decentralization advocates like himself and the entrenched American establishment has always been something of an inevitability. In that light, he said, the SEC’s current assault on the crypto industry isn’t much of a surprise or aberration.\n\nLast month, Consensys, the Ethereum software company founded by Lubin, filed a preemptive lawsuit against the SEC, challenging the regulator’s reported position that the buying and selling of ETH constitutes an illegal unregistered securities offering. Lubin has previously said that an SEC victory in the case would “spell the end of the Ethereum blockchain in the United States.” (Disclosure: Consensys is one of 22 investors in Decrypt.)\n\nAs far as Lubin’s theory about Wall Street’s secret hand in crypto’s current woes goes, there are a couple of caveats. For one, he says, it’s just speculation. And second, it’s not like traditional finance has been wholly opposed to blockchain innovation: Most major banks embraced spot Bitcoin ETFs, and still more are lining up to list spot Ethereum ETFs.\n\nBut, Lubin says, profiting off crypto ETFs is a far cry from endorsing genuine decentralization. Wall Street firms could easily enrich themselves on Bitcoin ETFs while, at the same time, fighting to prevent companies like Consensys from building a decentralized future.\n\n“All of them can do well on this technology,” he said. “That doesn't mean they don't want to just perpetuate the system for as long as they can.”"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNZHNmcWVYTEFuQUsxQW1xN21RVFBoeXNrTndfVFoxT3MzbWRsN0xzbHRQODZvbmxGZUEwUVlSMWNMVU5CU3NFeDRpbDN0alF2ZHZvUU9BSzNxNFRacmM5VldFVENNWHhLNDE0VDFORFQ3WVFWMm9TVDNFZE5hTElEekhaRdIBiAFBVV95cUxOdUw3a29aekpGUEd1dTlaSlEwaXVOQ0xlcTlZck1CZTZyN1lGMTJQWng1a0RKR0hDMW1nOFZlTjdBcF9nNEdpT05BTENpOVQtcldJdTA5OVNyQVpGRlBuYlFMamNMbXhhMy0wMEZ0M0FVdmMxWGJpbXhtYkc1YnhSQXBFc2ZvcXgx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Ethereum Sell-off Fears Mount as 56,795 ETH Linked to Coinbase - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) is exploring a reboot from its weeklong bearish drawdown, relying on the power of its ecosystem whales. However, there seems to be a contradictory trend as on-chain data shows that as many as 56,795 Ethereum have moved in and out of Coinbase in 24 hours.\n\nAdvertisement\n\nEthereum whale transfers, What's happening?\n\nData from crypto analytics platform Whale Alert shows that ETH moved in and out of Coinbase in different tranches, with sell-off fears heightening. The largest of these transactions featured the transfer of 30,020 ETH worth approximately $86,959,077 from an unknown wallet to Coinbase Institutional.\n\nWhile the actual motive behind any transfer cannot be guessed, this communicates the expectation of a sell-off to observers. This sender has a very tricky track record with Coinbase Prime. The address reportedly converged more than 30,000 ETH over the past six days before eventually transferring them all in one fell swoop.\n\n🚨 🚨 🚨 🚨 30,020 #ETH (86,959,077 USD) transferred from unknown wallet to Coinbase Institutionalhttps://t.co/cJulHpXQot — Whale Alert (@whale_alert) May 13, 2024\n\nBesides this, other minor transactions like 7,701 ETH moved in two tranches, and 7,882 ETH were also transferred from Coinbase Institutional to unknown wallets. The impact of these transfers is currently not negative; however, Ethereum's price is yet to reclaim its psychologically important level of $3,000.\n\nAt the time of writing, Ethereum is changing hands for $2,977.23, up 2.20% in 24 hours, per data from CoinMarketCap.\n\nEthereum tipping point\n\nOne of the most important tipping points for Ethereum is slated for later this month, the approval or disapproval of the spot ETH ETF product. At the moment, the approval odds for approval of this spot Ethereum (ETF) product come in at 25%, according to Bloomberg analysts.\n\nEthereum investors might be exercising the necessary caution in order to avoid getting caught up in any bearish fallout from the uncertainty surrounding ETF approval. This largely accounts for why ETH has not traded above the $3,000 price mark since May 10."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOZk16ZzBzdHhsWVhBOGVzak9mZlBrdklVWlB5OXFPdUNJZU9HSjQ1V2ZQLWxVSnFsUVdneWZ3eEZjam1GYjlWWW04cmJzTEhON0hJdjN6OGtUOC1iWm9USlZtQk1DWGkyZUdVekM2azlHM1dnWlByVVRFajd6STQ1ZWdkZ0dTS3ZsWlU4a9IBkgFBVV95cUxPMGJjbTc5eTI2c1BkM2hUdHE5Y1pocVRDQXFFV2c3ZlJ6VXdQbDVOTGZoYWY4Z1JRR0hINXg4LUJjZmlUeEdYMHdmZGRRaDZDanpiN3RvV2xJenZVUTZ1TWRldTZ6aTh3amxleXBpSGxQcEJEMEo0VWF3blZzTDRxa3F4cFAwejJaN3pBdDhtcUxOUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Ethereum Price: What’s Happening With ETH Price Today: May 13, 2024? - CoinGape",
        "content": "Ethereum price has gone through a rollercoaster in the last few weeks as the price has witnessed multiple ups and downs. The second biggest cryptocurrency, Ethereum (ETH), has declined more than 11% in a month, 9.31% in a week, and almost 2% drop in the last 24 hours. So, what’s happening with the Ethereum price? Will there be recovery anytime soon? Let us discuss that in this blog.\n\nEthereum (ETH) Price Analysis\n\nEthereum price has declined continuously in the last few days following the crypto market decline. At the time of writing, ETH is trading at $2,892.53, the lowest value in two months. However, the trading volume has witnessed a 35% upsurge, pushing the value to $8,291,166,546.\n\nadvertisement\n\nIt is because of the current whale interaction on the network which has interfered with the Ethereum holder’s sentiments. As per the Spot On Chain data, a single whale has deposited 4,153 ETH worth $12.2 million ETH tokens on the Coinbase exchange. As a result, Ethereum is in a selling zone where its MACD and exponential moving averages indicate selling pressure on the token.\n\nWill Ethereum Price Recover Anytime Soon?\n\nAs the overall market is down, Bitcoin price has also slipped to $60K from $63K. Seeing a momentary price drop in Ethereum isn’t big. However, a few analysts have spoken of the possibility of ETH prices dropping to the low of $2500.\n\nBenjamin Cowen, a crypto analyst, has been monitoring the ETH price against the BTC and has continuously spoken of Ethereum being bearish for a long now. He believes Ethereum might go down and settle around the April 2021 level of $2500\n\nAlso Read: Top Celebrities Who Don’t Support Crypto Market\n\nETH price has already crossed the key resistance line of $2,910 and is continuing a bearish trend. The next support is at the $2,865 level, and if Ethereum’s price moves down the line, Ethereum might decline to an even lower value of $2,650.\n\nIn contrast, if Ethereum surged to the upper support level of $2,950, the price may go as high as $3,250 in the upcoming days.\n\nFinal Thoughts\n\nEthereum holders’ sentiments are also affected by the upcoming SEC announcement on the Ethereum Spot ETF proposals. After multiple delays, the result will be out by the month’s end, but the possibility of approval keeps declining each day, impacting the Ethereum price. A market reversal with positive results from the SEC is the biggest hope for ETH holders to see the token surge to anywhere near the ATH target of $4,891.70.\n\nRead More Top Crypto Assets Defying Bearish Market Outlook\n\nPooja Khardia With a deep-seated passion for reading and five years of experience in content writing, Pooja is now focused on crafting trending content about cryptocurrency market. As a dedicated crypto journalist, Pooja is constantly seeking out trending topics and informative statistics to create compelling pieces for crypto enthusiasts. Staying abreast of the latest trends and advancements in the field is an integral part of her daily routine, fueling a commitment to delivering timely and insightful coverage\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPOU83YkhGaVYzN0NReFZfY1hKU3l4aC1SOEl1T2V2MHUzSDFxTXBzS3lfN1I0bS1iQjNzWWgzVGlNOVVkTzlVUnotUTFpcjg2UVVIVDNnZVcwcWFlWGdBeVNEbUlVLXB4RmozU1k2RXA3a3FXeFZGdG1ZU1FVUTlvZ05lTlhfOXlybVZUeWFaVjZRQnRuX25ybGhhZGpPZ1RaSnVRWl9Vcjd3U0HSAbABQVVfeXFMT0pCS0h2ZTJ6d1cwdXdOeUFvTUdkU2dEVVZGSlRvMW5KTnJJa3ZYbFd1bnB3MEZPaXFydzNMMTI5dkR3Z0NaQkZwbTZYTHpWVm1rd0lpcExTblhoV2l4WkpySEs1YTZHeWlwY1BPSko2clFzcTNBWExuQmxrT2dKWlpqeXgxNm1KNVhGNmZkdXlVMkFJVUdnRndTZWdqa2J3aWU3aU1DQ1VZcUw2SXdnQTM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Bitcoin Unable to Recover Decisively, Ethereum Consolidates Below $3K (Weekend Watch) - CryptoPotato",
        "content": "The cryptocurrency market has calmed down considerably in the past 24 hours, halting the bearish assault and finding some consolidation in the process.\n\nBitcoin’s price is trading at around $61K on Sunday morning, while Ethereum is now firmly below the pivotal $3K level.\n\nAre the Bitcoin Bulls Regrouping?\n\nAs CryptoPotato reported yesterday, Bitcoin’s price experienced a sudden correction, dropping below $61K and losing around 3.5% in a single day.\n\nThis seemingly had to do with a statement from a representative of the US Federal Reserve, who said that it may be too early to think about rate cuts.\n\nThe market has calmed down since then, and it seems that the worst is behind us.\n\nAlicia Bakery CMO - A really good agency Did you like this market update?\n\nThis is all you need not to miss any price action in the raging crypto markets. Start receiving this recap, for free, every day: Invalid email address Your privacy is guranteed. Thanks for subscribing, you will get your first report in the next hours!\n\nThe bulls even attempted a recovery, but it was quickly halted at around $61.4K when sellers stepped in and pushed the price to $61K, where it currently trades.\n\nIt’s worth noting that despite the recent declines, the Fear and Greed index is still pointing out that the market is in a state of “greed.”\n\nAltcoins Consolidate, Ethereum Below $3K\n\nNone of the major altcoins by means of total market capitalization has recovered from the crash the other day, but at least they are consolidating and charting ever so slight gains, as seen in the heatmap below.\n\nEven though the market seems to be completely painted in green, that’s just the 24-hour heatmap. On a seven-day scale, most of the cryptocurrencies are trading in the red.\n\nIt’s worth noting that Ethereum is now consolidating below the critical psychological level of $3K, and it’s very interesting to see if the buyers will be able to reclaim it soon.\n\nMeanwhile, today’s best performers are Immutable (IMX) – up 4.7%, and Ribbon Finance (RBN) – up 3.3%.\n\nOn the other hand, the cryptocurrencies that performed the worst are Zebec Protocol (ZBC) – down 7.8%, and Kaspa (KAS) – down 4.8%."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQU3ZNR2FjY0trS2gxd2w4QnhHYkZqM0s4OVk1TEkxal9pX2lMUHdNRWEwdGt0X1VERFBMMFZ0ZEJTTWlWbFpLdjBIbWJpdGZNdDdNSkRNNmxHR3g2WU9UWVc2dG9pSzJWRDI2ZnU2WXJYTmFCQ1ZuVFk4YVcyUnByeG5FcmJSY0xPa2Jkak5DZC1HT3p3Y0VwOUJoay1iZEN1Q1F1WUZn0gGrAUFVX3lxTFBmX0pyN0xNMGtvSUsxMzhxNjhXN015bEV4YjN0YzBlN3pBczVuNmNWQmxHcnFFZnhNQlNjWW9UNDQyYWZBSlV6eEo0RW8xYjRwNnNuV1I4LV9ZbTJWeEVmUF9nVWFheXByVHlKLWFrN0hRN1Z3Y1FqN3JDUFIzT2dpSmt1VzZrdWpyckxUbDhEenNqMWhVOE1jaEdEbU1MZF84dE5uTG9NdXNrRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Is Ethereum About to Resume the Uptrend and Break Above $3K? (ETH Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has been following Bitcoin, dropping lower since the beginning of March. Yet, things might be about to change soon.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily timeframe, the price has been making constant lower highs and lows inside a descending channel pattern. Yet, with the 200-day moving average and the $2,750 support level nearby, the market seems likely to rebound soon. Currently, the price is approaching the $3,000 resistance level.\n\nA bullish breakout above this level would be a probable scenario and could lead to a rise toward the higher boundary of the channel and the $3,600 resistance zone.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour chart, the price has been hovering around the $3,000 level over the recent weeks. Yet, the market has broken a bearish trendline to the upside. If the price keeps above the trendline and breaks through the $3,000 level, a rally toward the higher boundary of the channel will become more likely.\n\nWith the RSI approaching 50%, it seems that the market momentum is in equilibrium, but the short-term fate can be decided as soon as today.\n\nSentiment Analysis\n\nBy TradingRage\n\nTaker Buy Sell Ratio (30-Day SMA)\n\nThe perpetual futures market has been one of the key driving factors for crypto prices over the recent years. Therefore, analyzing this market’s metrics can provide useful information for anticipating future price movements.\n\nThis chart displays the 30-day moving average of the Taker Buy Sell Ratio, which measures whether the buyers or sellers are executing more market orders on aggregate. As market orders are the ones moving the price, this metric can provide crucial insight.\n\nThe Taker Buy Sell Ratio has been trending below 1 over the last few months, indicating that most futures traders have been selling BTC aggressively. This can either be for speculation or hedging spot portfolios. Yet, the metric is showing sings of recovery at the moment, and its rise could lead to a market rally as the aggressive supply would shrink. Therefore, with enough demand from the spot market, a new uptrend could begin soon."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPTUV2dmJ2eXhvY3BvQzZUTlBMZFI5RktPcDV1Q2pCLXloaGdCeHZ2RjJqeml6cmdkY3ExV2ZQWDRDdzFYaUY4U21RVlJHTWtJMllGbjhLei1lSUszNmlwS25kcTFoTmdRQ2RQR2JFNlRmMElDRG5zZmNMamtRXzczelJKVThOUEtFSTltSm5pOVFLMGx2WmJiWtIBngFBVV95cUxOR0NhNGRmaHVCUXR5SHcwQlNFZ2JDRDRxWXFtR0M4RDMyTGNEOXNLa1QyWnMxZWlub3o4Si1XcHExUkhSTHQtOUllMmJjTFZ2VlY3eU9MaTFxUHFobmFFWEhWUkNuUUdPb3dZa0tXUXpXUXllR2JTc3liS0JuV0FGTVE0bFBxaHhPUzdEdEZrcUFsalJld1NXQXhxcThNQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Parity Wallet Hacker Moves $9 Million in Ethereum, Leaving $246 Million in Limbo - U.Today",
        "content": "In a development echoing one of the largest crypto heists in history, Cyvers Alerts has reported that a hacker, who exploited a vulnerability in Parity's multi-signature wallet in 2017, has now moved a substantial sum of Ethereum (ETH). The hacker, responsible for the theft of 150,000 ETH, valued at $30 million at the time, has initiated the laundering of a portion of their loot, transferring 3,050 ETH, equivalent to $9 million, through the eXch platform.\n\nAdvertisement\n\nThis marks a significant chapter in the saga, underscoring the enduring impact of cyber breaches in the digital asset realm. Cyvers Alerts took to X to highlight the unfolding events, reminding followers of the 2017 incident that shook the crypto community. The vulnerability in Parity's Multisig Wallet version 1.5+ had allowed the perpetrator to abscond with a staggering amount of Ethereum , causing substantial financial losses.\n\n🚨ALERT🚨 In 2017, a vulnerability in Parity Multisig Wallet version 1.5+ led to the theft of over 150K ETH, valued at approximately $30M USD at the time.\n\n\n\nThe hacker behind this theft has demonstrated remarkable patience, marking a significant chapter in crypto history. Today,… pic.twitter.com/JPD5nJcmrJ — 🚨 Cyvers Alerts 🚨 (@CyversAlerts) May 13, 2024\n\nThe latest maneuver by the hacker underscores a strategic and patient approach to their illicit activities. By utilizing eXch and consolidating multiple addresses under \"0x5167052b,\" they have successfully laundered a portion of the stolen funds. However, what's more concerning is the sizable sum still under their control. With 83,017 ETH, valued at a staggering $246.6 million, remaining untouched at the primary address \"0xb3764761,\" the hacker retains significant leverage within the cryptocurrency ecosystem.\n\nAdvertisement\n\nOngoing threat\n\nThis recent activity reignites discussions surrounding security measures within the crypto space and the persistent threat posed by vulnerabilities in blockchain platforms. Despite efforts to enhance security protocols and mitigate risks, incidents like the Parity Wallet breach are stark reminders of the ever-present danger of cyber attacks .\n\nAs stakeholders assess the implications of this latest development, attention turns to broader implications for investor confidence and regulatory oversight within the crypto market. The ability of hackers to exploit weaknesses in infrastructure and maneuver substantial sums of digital assets shows the need for continued vigilance and collaboration within the industry to safeguard against such threats."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxPR0JWLVBSTG1WR0t5bm82WUxkTE5Raktja09UVURsOHhfNnlpeGJVb3lOcXVta3hpY29sOWEtMTNJZnNTbFRZQTBYdFFqTnZkNUFCR0tpc2huYUpqcEl0VnRLQWFsQ1VFVm1Wa1ZDcS1JSndVWHF2Mm1VZl9TUDZzMnkzQURJOWV1bnlpTVBfRnVVXzVfODJ3NVR2SDZkZTFBbGIyekVuSllMQzhNbF9RaDdpRGRLa25QUGFobmdLYjhfRTNXRXdiTVB1bGlwdlY4Q2VLQktCUnBkNUFtYjB0bncyYnM3UlVtSE5z0gHwAUFVX3lxTFBKTk9ZczNqTXpUREJFMF9rM1Z6RThCVXBjN0lJZlJ0dXFIeUUwSWpzSDBaOHhabjNSSS1lQzJ5UXUyb1RuUzlOV3ZlXzdTb0QxVkMtaEIzaTdmLWg1aEJJZjlVRGlPZ0s4ZGRYM3VRVDQtNVZ6VG1EMl9qWmhUQlZyTm9WU3pwbDhJVlJjUlM3dWp5aXVhdmh1dkJ5VGFyeXgxRm9OeWZwaWh6THRzUmFneGVDOGRtMEVNWDFrZHQ0amFZMEM1aHBONFpFSkRVXzNyYU1XNUFrNE9CSk5HckNJQ3VRNFhielRESWxabGw1ZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Altcoins thresh as BTC conceals directional bias - FXStreet",
        "content": "Bitcoin price could reverse current market structure if bulls manage a stable candlestick close above $65,500.\n\nEthereum price’s 26% upside potential under threat as ETH tests $2,900 support.\n\nXRP provides another buying opportunity at $0.50 as Ripple price plunges almost 10% in a week.\n\nBitcoin (BTC) price continues to conceal its hand on higher time frames with the stance compelling altcoins to pick a side. Altcoins with bullish fundamentals continue to show short-term strength, whereas those devoid of any continue to bleed. The fate of altcoins hinges on BTC with a show of stability likely to kickstart a rally for Ethereum (ETH) and Ripple (XRP) prices.\n\nAlso Read: Crypto market eyes a bullish turnaround\n\nBitcoin price attempts market structure reversal\n\nBitcoin price is trading with a bullish bias on the H4 time frame, consolidating along an ascending trendline. The Relative Strength Index (RSI) has managed a few higher highs, suggesting a growing bullish trend.\n\nHowever, for the current market structure to change, the bulls must manage to push BTC beyond $65,500 and maintain a stable candlestick above it on the four-hour chart. Such a move would pave the way for an extension to the $72,797 threshold, beyond which the $73,777 all-time high would be ripe for retaking.\n\nBTC/USDT 4-hour chart\n\nConversely, if the bears have their way, Bitcoin price could drop, slipping below the support confluence between the ascending trendline and the horizontal line at $60,630. In a dire case where BTC rolls below the $60,000 psychological level, it would trigger panic selling. This could send Bitcoin price all the way to the $56,552 support level before a potential recovery.\n\nAlso Read: Bitcoin price attempts recovery after weeklong downtrend as mainland China wants in on Hong Kong spot BTC ETF\n\nEthereum price’s 26% target objective could fall through\n\nEthereum price consolidation within a falling wedge pattern continues as the bullish reversal technical formation signals a possible 26% target objective. However, with BTC concealing its directional bias, this potential weakens.\n\nNotably, Ethereum price has slipped below the ascending trendline, worsened by the equal lows on the RSI. If the RSI support breaks, ETH could fall through, recording a lower low and extending the downtrend below the $2,900 threshold.\n\nETH/USDT 1-day chart\n\nOn the other hand, enhanced buyer momentum above current levels could see Ethereum price break above the $3,212 resistance level. A stable close above this level on the one-day time frame would activate the breakout, potentially sending ETH 26% north to $4,083.\n\nAlso Read: Ethereum could see slight increase, institutional whales make hefty deposits on Coinbase.\n\nXRP bulls have another buying opportunity\n\nRipple price has tested the 50% Fibonacci placeholder for yet another time. But not all hope is lost as XRP tests the support due to the 50% Fibonacci placeholder at $0.4952. If this support level holds, the XRP price could climb 12% to take back the $0.5703 resistance level.\n\nXRP/USDT 1-day chart\n\nConversely, if the $0.4952 support breaks, Ripple price could extend the fall to $0.4500, or in a dire case extend a leg south to $0.4188, levels last tested on April 13.\n\nAlso Read: SEC vs. Ripple lawsuit update: All related parties to file letters to seal motions and evidence"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE54Y25PWGpvQ2o0ZXJBd1VBQzhIUW5USEdTcWlFN2FZRUlFSk9ocWxzYUIwQ2lrVXVkSmR0TWNFVFNhOEVyVGQ2RDFIVkhRQkJWNHZMLXVIN1FjdUp1akV4bVJnVEU0dWIzN2oxZF9BWU9aVUtWMThfSm1mTUZYZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Bitcoin Navigates 0.65% Gain in Danger Zone, Ethereum Drops 0.25% Amid Market Pressures, Furrever Token Launches $20,000 Competition to Boost Presale - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, May 13, 2024 (GLOBE NEWSWIRE) --\n\n\n\nIn the ever-changing landscape of the cryptocurrency market, major tokens such as Bitcoin and Ethereum are undergoing significant fluctuations, presenting both challenges and opportunities for investors. Amidst this dynamic environment, the Furrever Token (FURR) emerges with an innovative marketing strategy aimed at attracting Bitcoin and Ethereum holders, further diversifying the crypto ecosystem with its unique thematic focus and competitive initiatives.\n\nNavigating Bitcoin's \"Danger Zone\": Market Dynamics and Speculations\n\nBitcoin (BTC) has been experiencing considerable volatility, currently trading at approximately $61,229.50, marking a slight increase of 0.65% from the previous day. This instability is particularly evident as BTC recently tested the critical $60,000 support level, a move that has heightened caution among investors. This phase is often described as the \"danger zone,\" a term used to denote the turbulent period following Bitcoin's halving events.\n\nDuring trading on May 10, Bitcoin's price momentarily dipped to an intraday low of $60,190 on Bitstamp, down from attempts to stabilize around $63,000. This sudden decrease has sparked widespread speculation among traders and analysts. Many believe that large-volume institutional actions, coupled with the temporary closure of the BTC ETF market, might have driven the drop.\n\nDespite this recent dip, market experts like Rekt Capital remain optimistic, suggesting that the end of this challenging \"danger zone\" could be in sight. Historically, such periods have been marked by sharp downturns followed by eventual stabilizations. The current market scenario of BTC demonstrates the complex interplay between market sentiment and institutional influences, which continues to dictate the cryptocurrency's price movements. As Bitcoin navigates through these fluctuations, the broader crypto community watches closely, anticipating the cryptocurrency's next moves in this unpredictable market landscape.\n\nEthereum Faces Market Headwinds and Analyst Scrutiny\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, has recently been trading at $2,927.63, marking a slight decrease of 0.25% from the previous day. This modest drop is part of a broader trend of challenges that have caught the attention of investors and analysts alike.\n\nA significant event stirring the market was a major sell-off by an Ethereum whale who liquidated 6,714 ETH at a price of $2,903 each, culminating in a loss of approximately $6.5 million. This large-scale transaction has intensified concerns over Ethereum's future price direction. Market indicators are not promising, with the Relative Strength Index (RSI) showing a decrease in investor interest and key averages indicating a bearish outlook.\n\nStory continues\n\nDespite Ethereum's substantial trading volume of $10.1 billion over the last 24 hours, the price has declined by 4.07%, fluctuating between $2,935.95 and $2,894.15. Analysts have pinpointed the $3,017 level as a crucial resistance point; surpassing this could potentially shift the momentum to a bullish trend and help Ethereum break out of its current descending channel pattern.\n\nHowever, several factors are complicating this outlook. The cryptocurrency has been in a descending channel since mid-March, and the delayed approval of a Spot Ethereum ETF by the U.S. Securities and Exchange Commission (SEC) has added to the bearish sentiment. Moreover, the recent Dencun hard fork, which was intended to enhance Ethereum's scalability, did not have the expected positive impact on its price, leading to further speculation about its effectiveness and future impact on Ethereum's market performance.\n\nThese developments paint a complex picture for Ethereum as it navigates through ongoing market challenges and investor scrutiny.\n\n\n\n\n\nFurrever Token Launches $20,000 Competition to Attract Bitcoin and Ethereum Investors\n\nThe Furrever Token (FURR) has introduced an exciting $20,000 competition, targeting holders of Bitcoin (BTC) and Ethereum (ETH) to diversify into its presale phase, which prominently features cat-themed imagery and an engaging, playful ecosystem. Operating on the BNB-20 blockchain, Furrever Token is currently offering 65% of its approximately 9 billion token supply to early investors, signaling a strong start with over $1 million raised in just two months.\n\nAs the presale progresses, Furrever Token continues to captivate the community's interest, with its current price set at a modest $0.000648. A notable aspect of this token is its absence of buy and sell taxes, which enhances its accessibility and affordability, appealing especially to new entrants in the cryptocurrency market.\n\nThe centerpiece of Furrever Token's promotional activities is the \"Furrever Token $20,000 Highest Total Buys Competition.\" This contest is designed to spur enthusiasm and investment by rewarding the top 10 participants who purchase the most FURR tokens during an 18-day period from May 9, 2024, at 17:00 UTC, to May 27, 2024, at 12:00 UTC. The top purchaser will be awarded $5,000, with descending prize amounts for the other top buyers.\n\nThis initiative not only underscores Furrever Token's commitment to building a robust and engaged community but also positions the token as a potentially lucrative opportunity for investors in major cryptocurrencies like BTC and ETH, looking to leverage their holdings into new and promising digital assets.\n\nFor further information or any assistance regarding Furrever Token, reach out only through the official channel at support@furrevertoken.com to avoid potential scams.\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nJoin $20,000 Furrever Token Giveaway\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNUThxeWx5ZlUteVJVWHdZQUxtZUZkVGJOX25rSGlZZ2ZlVVpPY0w2M1FqNHFKOGdORDdZa3lhZEVGZENFNUxXRFV1WnE3ek5pOVZwZGZodW1xb3JEdFFXNHJHM05XWS1zS0hGbzBJNHA1VWE2Q01OS1pzWmVXc2xzeFZtSUVOOFJzMFRfemhzb3nSAZYBQVVfeXFMTlUtWGZfcHhucFlHMVlIYjd2dEIzWjA4TXA2b1drdXMtR2FYTm5ydWhHTzAxUGF4Z0JtSFNhZFFzOFZHbGJESk01RXRpc2FJSGduS1BRN2hfM1Zfdmd3UGhXMWZDb3RjMG1xWmlmdTZMbGJjc0FJbG5zYXRYMGZDSnBWT1hGYkxuaGg5U0hvWnpXa3JDTEpn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval Odds On Edge As SEC Unveils Major Notice - CoinGape",
        "content": "The U.S. Securities and Exchange Commission (SEC) has unveiled a official notice regarding the approval of Ethereum Exchange-Traded Funds (ETFs). The notice, brought to light by finance lawyer Scott Johnson, highlights the critical scrutiny facing the proposed ETF. Moreover, it highlights potential hurdles in its path to approval.\n\nSEC To Debate On ETH Classification Before Spot Ethereum ETF Decision\n\nJohnson, a prominent figure in the crypto space, took to social media platform X to reveal the contents of the official notice. He stated, “I’m aware this is widely considered a possibility, but this is your official notice that the SEC is considering the security question for ETH in this upcoming spot ETF order.”\n\nadvertisement\n\nThe crux of the matter revolves around whether the proposed Ethereum ETF aligns with regulatory standards. This particularly considers the investment product’s classification under Nasdaq Rule 5711(d) as Commodity-Based Trust Shares. Furthermore, Johnson emphasized the SEC’s obligation under 15 U.S.C. 78s(b)(2)(B) to provide notice of the grounds for disapproval under consideration, citing concerns over the Trust’s underlying assets and their classification.\n\nThe official notice, as cited by Johnson, states: “Pursuant to Section 19(b)(2)(B) of the Act, the Commission is providing notice of the grounds for disapproval under consideration. The Commission is instituting proceedings to allow for additional analysis of the proposed rule change’s consistency with Section 6(b)(5) of the Act.”\n\nAlso Read: Hong Kong Bitcoin and Ether ETFs See Record Net Outflows Since Launch\n\nPotential Implications On Ether ETF Decision\n\nSpecifically, the SEC is probing whether the Ethereum Trusts have properly filed its proposal to list and trade the shares, considering the nature of the underlying assets and their compliance with regulatory standards. Johnson’s revelation sheds light on the potential roadblocks facing the Ethereum ETF approval process.\n\nIn a X thread, he remarked, “The obvious purpose is to potentially deny on the basis that these spot filings are improperly filed as commodity-based trust shares and do not qualify if they are holding a security.” Moreover, he highlighted the SEC’s conflicting stance on the Spot Bitcoin ETF approval and the Ethereum ETF decision.\n\nJohnson underscored that the SEC never questioned the classification of the Bitcoin Spot/Futures ETFs while it’s the total opposite in case of ETH ETFs. However, the Commodity Futures Trading Commission (CFTC) and Consensys’ actions against the SEC are also responsible for raising these questions.\n\nThe CFTC has always considered ETH to be a commodity while the SEC was mulling on whether to declare it a security upon Prometheum’s request. Meanwhile, Ethereum developer Consensys issued a lawsuit against the SEC last month. The firm urged the agency to not label ETH as a security.\n\nAlso Read: Ethereum Price: What’s Happening With ETH Price Today: May 13, 2024?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPTzBCVXROWXNQNDU1eHBNbUlUTDhqUlBnSzJQcmo3X05ZTDNRaDN0S2pRTlU5ZlBNMDBBU25mb2JEXzhZUnlCaHhPVlBJYnNrUGJPejVBNXFnbUNjeXpOd015S3ZCWjFMMnhBWnc1amR3QW1fMGVfMENpNjd2U1ZvZVMyTmvSAYoBQVVfeXFMUFM3MThhb1ZPWGMxUWk1aFp6b3NJM3VDbHI0TUpQdXl4ZGFCbmZyc0s0UlVTWXIzVGpJaGZTX1BZLU9YQzJCbFJ2bWpnYmdXTk5vcGxQUlVfQ0xMRWhMendxcVZPSW9KdnF0MjIzZTJOa3hfYUlOWWZVWjRwZUR1RHpWdlVaY3NyVlFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Risk Denial By SEC, Bloomberg Analyst Warns - CoinGape",
        "content": "Recent developments indicate that the approval of Ethereum Exchange-Traded Funds (ETFs) by the U.S. Securities and Exchange Commission (SEC) may face significant hurdles. Bloomberg analyst James Seyffart and finance lawyer Scott Johnson have provided insights into the regulatory challenges and market implications surrounding these proposed ETFs.\n\nJames Seyffart’s Prediction and Regulatory Considerations\n\nJames Seyffart, a top Bloomberg analyst, has highlighted the increasing likelihood of the SEC rejecting Ethereum ETFs. He suggests that the SEC is considering classifying Ethereum as a security, a significant move that could impact the approval process for these financial products. Although this is not a definitive outcome, the fact that the SEC is contemplating this classification is notable. This marks one of the first times such a possibility has been mentioned in public SEC documents, indicating heightened regulatory scrutiny.\n\nadvertisement\n\nWhile this possibility has been widely speculated, it is now officially on the table. Historically, the SEC has not raised similar concerns for Bitcoin ETFs, whether spot or futures. The Commodity Futures Trading Commission (CFTC) has consistently considered Ethereum a commodity, further complicating the regulatory landscape. Meanwhile, Ethereum developer Consensys has taken legal action against the SEC, urging the agency not to label ETH as a security. This lawsuit underscores the significant stakes involved and the diverse perspectives within the crypto industry regarding Ethereum’s classification.\n\nAlso Read: CoinDCX DeFi Arm Okto To Launch Native Token With Massive Airdrop\n\nSEC’s Official Notice and Market Implications\n\nThe U.S. Securities and Exchange Commission has issued an official notice regarding the approval of Ethereum Exchange-Traded Funds (ETFs). This notice, unveiled by finance lawyer Scott Johnson, highlights the critical scrutiny and potential obstacles the proposed ETF faces. Johnson emphasized the SEC’s consideration of Ethereum’s classification as a security in the upcoming spot ETF order.\n\nDecisions on applications such as BlackRock iShares Ethereum ETF and Fidelity Ethereum ETF are anticipated, with deadlines looming in August. Despite the regulatory uncertainty, Polymarket data shows that the odds of Ethereum ETF approval have increased to 13% by May 31, up from a low of 6% on May 6. The SEC’s reluctance to engage in constructive discussions with Ether ETF issuers has led to disappointment within the crypto community, impacting overall market sentiment. However, ongoing meetings between ETF applicants and SEC staff, reported by Fox Business journalist Eleanor Terrett, suggest that negotiations continue, potentially influencing future outcomes in this regulatory debate.\n\nAlso Read: Bitcoin Price: BTC To Face $2.7 Billion Liquidation If Price Hits This Level\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPLUt1ekpSMW8zWGc4RDhoY1drVVZnTDlDd2QzN2ZDZ1Z5a0hYWGtJWG02V2tRZkpnT0NYYkVSNDNPREZVRWs3VUVweEtUdTB2YS1nVEpQOVg4UFBaWWRvT0Q1RFBlTzVEeEtEbnVjZFVTNXdGbllKQTNyZEs2RHNQWjdIbV9iWU9yM18yNFhhSE5ReFFK0gGaAUFVX3lxTE9UTXd1UDBHb0huUTU3RG41YWJjOHZUcnBqcTNaYmVhcnlKeWZQZjN1U0JUVXppUXlVS1BHRDNNWFFxM1ZwTUhsR21sejk0bkM1bFcta25KRGJGb3ppOEhmSW5yNEw5ZUVfN1dpSDhFSEoyWDdWdnFzRFNxNDhyUXdzRE01QTJ3bTdtVnhVSUN3MHRNdy1xVC05RXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum: Two levels where a swing trade could be profitable - AMBCrypto News",
        "content": "Ethereum has a slightly more bullish bias for the coming week.\n\nThe Bitcoin consolidation phase was still ongoing, and a revisit to $60k was growing more likely.\n\nBitcoin [BTC] traders were going through a relatively tough period after the easy, straightforward rallies that have been the norm since last October.\n\nEthereum [ETH] has been more complicated, but BTC’s halving event last month has changed the market conditions to chop and range formations all over the market.\n\nAMBCrypto investigated what the market sentiment was looking like over the weekend, and where this week’s price action could go.\n\nOne of the two has speculators expectant of bullish returns in the near term\n\nThe 10th of May saw an increase in the Bitcoin Open Interest, but the OI has been trending downward since the price spike on the 6th of May.\n\nMeanwhile, the price also formed a series of lower highs over the past week, descending from $64k to $61.1k at press time.\n\nThe Funding Rate was negative at the start of May when Bitcoin plummeted to $56k. Since then, the Funding Rate has recovered.\n\nHowever, in the past few days, it has been barely above zero, which indicated the sentiment was not strongly bullish.\n\nEthereum also saw Funding Rates slip into the negative territory in early May but has since recovered. The past week’s downtrend saw the funding rate hover around the baseline +0.01 mark.\n\nA slight bounce from $2980 to $3040 on the 9th of May saw the Open Interest and the funding rate jump higher.\n\nThis did not repeat with Bitcoin despite a similar price bounce, which suggested that speculators were more eager to long ETH than BTC.\n\nWhat are the next liquidity pockets that could attract prices?\n\nThe 7-day liquidation heatmap of Bitcoin showed a bright cluster of liquidations at the $60k area. To the north, $61.8k and $63k are the next bullish targets.\n\nOn the 5th of May, we saw prices jump above the $64k mark to collect liquidity before a brutal short-term reversal.\n\nSimilarly, we might see a downward plunge on Monday to collect the liquidity at $60k before rebounding higher. Hence, BTC traders would want to buy the dip to the $50.6k-$60k region.\n\nHowever, traders must also be prepared for a move below $59.4k for BTC, and set their stop-losses accordingly in the event of a dip to $60k.\n\nRead Bitcoin’s [BTC] Price Prediction 2024-25\n\nOn the other hand, Ethereum has a cluster of liquidity nearby to the north at $2950. This was close to the current market price of $2928. A dip to the $2860 region would likely present a buying opportunity.\n\nThe liquidation levels around the $3.1k-$3.2k area present an attractive target. A drop below $2.8k would likely herald a strong short-term downtrend, and traders can cut their losses in this scenario."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9yRFpJZ1dMRTlvQXgxNTBjR1hlOThpSjZlejBLaVJJNjRYRm9fTm9oeTBOcG5ldjl1QUlMQUlYSFBva0cwLV9aWGRNdkl0Y0xJX194aTdYSDZqRWVEMHR6Qnk5akVUa2lnbE96UFJGRE5keHEzem9va2hEWEFXSms?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "3 Meme Coins Outperforming Ethereum In May 2024 - CoinGape",
        "content": "Following the recent market crash that jolted the cryptocurrency world, there has been a significant change in the market dynamics. With Ethereum (ETH) staying at $2,915.90, experiencing declines of 1.76%, 4.93%, and 5.68% in the last day, week, and month, investors are looking for safety in other investments. The crypto sphere was shaken by the recent market crash, causing traditional assets and cryptocurrencies to suffer in the aftermath. Nevertheless, in the midst of such turmoil, memecoins have risen as unexpected saviors, going against market norms and surpassing even well-known giants such as Ethereum. Pepe Coin (PEPE), Floki Inu (FLOKI), and GameStop (GME) are some of the emerging stars in the crypto world, grabbing attention with their rapid growth and causing a stir in the industry.\n\nWhat is the reason behind the surge of Meme Coins?\n\nThe revival of meme coins gained notable momentum following the GameStop rally on Wall Street, a phenomenon that caused a stir in financial markets. The GME stock price surged after Keith Gill, also known as TheRoaringKitty, tweeted for the first time, after three years, and having been associated with Gamestop.\n\nadvertisement\n\nFollowing the rally, the meme coin industry experienced a huge increase of 34% in daily trading volume, resulting in a significant addition of $5 billion to investors’ wealth. This sudden change of circumstances brought memecoins into the spotlight, igniting a wave of new interest and investment madness.\n\nTop 3 Memecoins Outperforming Ethereum\n\nPEPE, FLOKI and Gamestop (GME) have emerged as best performing meme coins today, outperforming ETH.\n\n1. Pepe Coin (PEPE)\n\nPEPE, named after the famous internet meme, has been making waves in the crypto world with its performance. Currently trading at $0.00001092, PEPE price has seen a surge of 22.69% in the past 24 hours, and a 33.84% increase over the past week.\n\nWith a market cap of $4.6 billion and a trading volume of $2.4 billion in the last 24 hours, PEPE is proving to be a force to be reckoned with. Its circulating supply stands at 420,689,899,999,995 PEPE, indicating a strong investor interest in this memecoin.\n\n2. FLOKI\n\nTaking cues from Dogecoin price achievements and its Shiba Inu mascot, FLOKI has intrigued investors with its dog-inspired branding. FLOKI is now valued at $0.0001949, with a slight 10.83% rise in the last day and a consistent 9.66% jump in the previous week. Having a market capitalization of $1.86 billion and a trading volume of $497.6 million over the past 24 hours, FLOKI is establishing itself in the memecoin market. The circulating supply of 9,556,698,553,895 FLOKI shows increasing interest from both traders and investors.\n\n3. GameStop (GME)\n\nFollowing the infamous GameStop rally on Wall Street, GameStop Corp. (GME) has entered the realm of memecoins in a daring manner. Priced at $0.01178 now, GME has experienced a 290.97% rise in the last day and a1588.16% growth in the past week.\n\nGME has become popular among fans of memes due to its market cap of $81.1 million and trading volume of $177.2 million in the past day. The circulating supply of this memecoin has not been established yet, but the excitement surrounding it is undeniable.\n\nConclusion\n\nWhile Ethereum is facing challenges after a recent market downturn, meme coins such as PEPE, FLOKI, and GameStop are taking advantage of the moment to stand out. These meme coins are captivating traders and investors globally with their unique themes, viral marketing, and fast value surges. Although the future success of memecoins is unknown, it is evident that memes are influential in the constantly changing world of cryptocurrency. It will be interesting to observe the performance of these memes coins in the coming weeks and months as the market recovers and adjusts."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPOTVEUF9NODNIcFQtVUhaMXJCQ1VqVEhXMlZ3Qk5EbVlsLThIbkRLMU1GeHZiU21FNzBnSkhabDNrbE9RSGxrUkd6V2dLWjJJcEF6RkFxU2pRSnVkT0VvNmxCYUdSZHdTbktqZHhmLXhUa2N4eVlzcU5QWjdSX0lBMjc2dGFjZTZaYkxKWXR2RTFFMktrZDlsc1VhR3BFVVB0VUNiNnRR0gGrAUFVX3lxTE4zcUFyX2s5MEZoNXBEUm9jM2M1a1laNTBOWkd1aVBjQS1uTVVxVEg2bXVFV1IxYWU0bEp4cHl2SUU2WFJNaDZ1WFFnblVRblpLYjM4M3dBYkZxd3ZJZzRxa0dsakpIc2dXbjVjNnpNUWVVcFJaa3NqeWtib3p2a3YtVDFNa3hTdURvdTNpSEVGUlNDT1pIRWUxdUVZMFNpUFdoYXpPYlZTRHF1dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 14: Bitcoin Crosses $62K, Ethereum & Altcoins Mirror Sentiment - CoinGape",
        "content": "The top crypto prices today witnessed a rebound as the Bitcoin (BTC) price extended above the $62,000 mark. Moreover, the Ethereum (ETH) gained notably and sustained the $2,900 level. In addition, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) also noted a significant uptick.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price soared 2.57%, reaching $62,487.50 at the time of writing on Tuesday, May 14. On the other hand, it’s trading volume spiked 65.26% to $27.70 billion in the last 24 hours. Whilst, the crypto’s market capitalization stood at $1.23 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price gained 1.88% to $2,941.82 at press time with a market valuation of $353.40 billion. Whilst, ETH saw its trading volume jumped 53.71%, reaching $12.23 billion.\n\n3. Solana Price\n\nThe Solana price approached the $150 level amid the rebound frenzy today. The Solana price rallied 6.39%, settling at $148.59. In contrast, SOL witnessed a 69.38% hike in trade volume to $2.23 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price managed to attain the $0.50 mark again. The XRP price recorded a gain of 2.99%, reaching $0.5069. On the other hand, XRP’s trading volume shot up by 39.31% to $849.93 million.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price was up 2.42% to $0.4372 today. Whilst, ADA recorded a massive surge of 78.38% in its 24-hour trading volume, settling at $360.23 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price rallied 9.83% to $0.1508 while its rival, Shiba Inu price soared 8.31% and traded at $0.0000236.\n\nAlso Read: Toncoin Price Prediction: TON Poised to Break Past All-Time High Amid TVL Growth\n\nTop Crypto Gainers Today\n\nBounceBit (BB): The BounceBit price rallied 27.8% to $0.4205.\n\nThe BounceBit price rallied 27.8% to $0.4205. Pepe Coin (PEPE): The PEPE price soared 21.5% to $0.00001018.\n\nThe PEPE price soared 21.5% to $0.00001018. Floki (FLOKI): The Floki crypto price surged 20.8% and traded at $0.0001939.\n\nThe Floki crypto price surged 20.8% and traded at $0.0001939. Grok (GROK): The Grok price rose 12.7% to $0.01201.\n\nTop Crypto Losers Today\n\nOmni Network (OMNI): The OMNI price lost 8.82% to $14.89.\n\nThe OMNI price lost 8.82% to $14.89. Lido DAO (LDO): The Lido DAO crypto price slumped 5.47% to $1.64.\n\nThe Lido DAO crypto price slumped 5.47% to $1.64. THORChain (RUNE): The RUNE price dipped 3.70% to $5.66.\n\nThe RUNE price dipped 3.70% to $5.66. Worldcoin (WLD): The WLD crypto price slipped 1.48% to $5.29.\n\nCelestia (TIA), Bitget Token (BGB), Core (CORE) also made it to the top crypto losers list today. Whilst, the rebound in the Bitcoin price could be triggered by the positive ETF flows. On Monday, May 13, the Spot Bitcoin ETFs recorded an influx of $66 million, marking a resurgence.\n\nAlso Read: Bitcoin Price Forecast: Will It Be $70,000 Or $56,000 This Week?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQdHp6Si1vQkM3NWtHRzVYTUNXcHMtN0pPTGNhN1M0bUh3aHV0UXBZSjVMT3diMTQ1VUVBVEpMWlp5cnJZcFItUVJvSjNuZktQa19TX0FTd1NuZmd4SEctdWt2a1l4YjZJaHFfWDNCZ3dSb2xWZVZ4YjBDRVFwX2xXUnY0WXNNeHRibWptYkdSYXdrZTgxRjQtQXowQm91UWlaNkxDU1FHSzBFZnlpcXJlY2FZS0J2eUVodXMzQTNuNm9IRDVObVRrS2MwNmcydXFENkszX9IB2gFBVV95cUxNZ1Y4cEo3UWs5Q2Y5dXo3Q09VSkl4OE1lbS1Xc0RoMUZGQkRWS2I2Y3EzUkV6LXJKNHo4dlNhZ3JXSGpJVTBsSDQzQWZjNDRmNDlGQmtrR1NFaEZ2UlpyTlBnZVpQaDB6Y3lxNzVOREJyc3c3N3RyRjdkWFZkcmJJMjcxRG9TRmlWblJKdl9BWEl4ZUdOdmpkRDdDZ3R1d3FZLWhTV2dwQkdOcWpWSW1MSEg5ajI4dFczRHhiZGF3ZWNpaWVFT1dYeTdPSnVzVE9DSTV4Q2xEOE50Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Ethereum bears attempt to take lead following increased odds for a spot ETH ETF denial - FXStreet",
        "content": "Ethereum co-founder Vitalik Buterin proposed a new type of gas fee for calldata in the latest EIP-7706.\n\nCalldata gas would help reduce fees for certain types of transactions and improve the user experience.\n\nThe odds for the SEC to deny spot ETH ETFs have increased, says Bloomberg analyst James Seyffart.\n\nEthereum (ETH) is indicating signs of a bearish move on Tuesday as it is largely trading horizontally. Its co-founder Vitalik Buterin has also proposed a new type of gas fee structure, while the chances of the Securities & Exchange Commission (SEC) approving a spot ETH ETF decrease with every passing day.\n\nRead more: Ethereum trades horizontally as institutional whales dump heavily on Coinbase\n\nDaily digest market movers: Calldata gas in EIP-7706, spot ETH ETFs see diminished odds\n\nEthereum could be poised for new upgrades following recent proposals. Here are market movers for the largest altcoin:\n\nEthereum co-founder Vitalik Buterin proposed a new type of gas fee structure in a new Ethereum Improvement Proposal, EIP-7706, on Tuesday.\n\n\n\nThe proposal aims to reduce gas fees for data-heavy transactions that don't require much resources for computation through the introduction of a new type of gas uniquely assigned to calldata. The current gas structure of Ethereum involves only two types of gas, namely execution gas, which covers fees for the computational resources to process transactions, and storage gas, which covers the cost of storing data specifically in \"blobs.\n\n\n\nEIP-7706 introduces the third category related to calldata - a key part of Ethereum transaction that's transmitted to a smart contract \"when functions are invoked.\" Buterin also recommended in the proposal that Ethereum switch from using separate mechanisms and leverage a common approach for the different gas fees. EIP-7706 could lower gas fees for certain transactions while improving the user experience if the Ethereum community approves it.\n\n\n\nThe proposal follows an earlier essay on multidimensional gas pricing and the EIP-7702 proposal on account abstraction co-authored by Vitalik Buterin.\n\nAlso read: Ethereum declines briefly, JP Morgan sees a spot ETH ETF approval despite recent Wells notice\n\nAs the May 23 deadline for the SEC to decide on Van Ecks' spot ETH ETF application approaches, General Partner at Van Buren Capital, Scott Johnsson, revealed findings in an X post indicating the agency is \"considering the security question for ETH.\" I'm aware this is widely considered a possibility, but this is your official notice that the SEC is considering the security question for ETH in this upcoming spot ETF order. Note that this question was never (afaict) asked regarding a spot/futures BTC ETF product. pic.twitter.com/TwhqmTnJfC — Scott Johnsson (@SGJohnsson) May 14, 2024\n\n\n\nBloomberg analyst Eric Balchunas maintained the same stance of approval being slim in an X post. TLDR: the SEC asked commenters re the Eth spot ETFs whether these filers have properly filed their ETF listing proposals as commodities. This shows the SEC is perhaps considering to Eth is a security in their denial. Our odds of approval remain the same: slim to none. Nice job of… https://t.co/g9HGPzGyOp — Eric Balchunas (@EricBalchunas) May 14, 2024\n\nETH technical analysis: Ethereum primed to stay above key support despite bearish sentiment\n\nEthereum is trading around the $2,900 price level on Tuesday after failing to balance a previous price inefficiency from Friday. In the short term, most traders are slightly bearish as long liquidations hit $24.22 million in the past 24 hours, according to data from Coinglass. ETH's open interest declined by 1.8%, confirming the short-term bearish sentiment. This may be because of heightened expectations of a spot ETH ETF denial by the SEC.\n\nRead more: Ethereum needs a bullish trigger, Joseph Lubin blasts the SEC\n\nHowever, ETH may quickly bounce back up or at least sustain a sideways movement as the $2,852 price level has proven to be a key support for ETH — it has only gone below it once in nearly three months. The next leg up may see ETH attempt to break past the $3,161 resistance.\n\nETH/USDT 4-hour chart\n\nETH may not see huge price gains in the coming days, considering investors are exercising caution as the SEC's decision on ETH ETFs looms.\n\nAdditionally, the current price level could also prove a good buy opportunity for long-term holders in anticipation of ETH's next price rally."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOTTJaRzBoNEhQNUp6cWxPZHI0Y2w2RktnN0hPamRxQnNzSkMwRDRWbVMxbnVOR3hNQnJWd2NHSzI0RmFES0R6OXJNeTR1S1E4cE1TRXJMZUhVX2E4ZEFEUzQtN3pRbXJYU0xIMTVkcS1WTUQ4RzZDd1BmWWRWTFlKcG80aDBqQmh5TEdBQ3Qxb3poWnBIQlF3YVU2SXJKT1FaZFh6ZzI0UGlPQmZxSGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum dethroned by Solana in terms of decentralized exchange volume - Cointribune EN",
        "content": "Mon 13 May 2024 ▪ 3 min read ▪ by Ariela R.\n\nIn the ever-evolving world of cryptocurrencies, the order of platform supremacy seems established. But the emergence of new players is challenging this current order. This is the case for Solana (SOL), which has just overtaken Ethereum (ETH) in terms of DEX volume.\n\nSolana Surpasses Ethereum in Decentralized Exchange Volume https://t.co/JMiP2HmQL8\n\n\n\nFollow us and stay up to date with the latest developments for #Bitcoin #Ethereum #Ripple #cryptomarket #cryptocurrencynews — COINTURK NEWS (@Cointurknews) May 10, 2024 Crypto: Solana surpasses Ethereum in decentralized exchange volume\n\nSolana overtakes Ethereum in terms of DEX trading volume\n\nLaunched in 2020, the cryptocurrency platform Solana stands out for its transaction speed and low fees. This makes it particularly attractive to DeFi users. This crypto blockchain has experienced exponential growth in recent months, attracting many investors and developers.\n\nAccording to recent data, DEX trading volume on Solana has reached $1.3 billion. For the first time, this volume exceeds that of Ethereum, which is at $1.29 billion. This remarkable performance marks a turning point in the competition between the two crypto platforms. It indicates the potential of Solana to emerge as a promising alternative to Ethereum.\n\nSolana: a crypto ecosystem in full expansion\n\nIn addition to the DEX trading volume of Solana, its transaction fees have also increased. These have reached 50% of the fees generated on the Ethereum crypto network lately. Analysts also predict that soon, transaction fees on the Solana network could surpass those of Ethereum.\n\nSpeaking of increases, the price of SOL has also seen a rise of over 6% in 24 hours. This situation propels Solana to the rank of the most performing altcoins in the crypto market.\n\nA new order is emerging in the world of cryptocurrencies\n\nSolana’s surpassing of Ethereum in DEX trading volume is a strong signal of its potential to become a major player in the DeFi space. Its speed, negligible fees, rapidly expanding ecosystem, and innovative technology make Solana an attractive alternative for users and developers.\n\nAlthough Ethereum maintains its dominance in terms of market capitalization, Solana is now positioning itself as a serious contender, ready to shake up the established crypto order.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxNZzM2QUQtcDdGM1dRdmo3bFM5SWNudk16T1JSN2o5U1BnYmI1OUdTZFVreERiV0hSQ09oMldBcF9fQU02U013Mk5HNWdqSUx4RG42UFoxaGw3QzZuaENGQ3lWRlM3WFBkbllsLXhDekEyWE9sTExtT3FScFFqbEcwaUladW90QUFYUXZUcVNadUNFR1Z4UGxjczBfcHJONGw2b2tKUEZHa194OEZKemFMZm5Ec1hSb3FQOG05Qnl3aTZCRmVRSS1xeWZaMWRSdE40VFZjeXNLWjZXamF4amdvVC1YWlVEZ1R2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Dip As Wholesale Prices Breach Estimates: Analyst Explores Possibilities Of A Bitcoin Jump To $68K - Benzinga",
        "content": "Major cryptocurrencies inched lower on Tuesday on higher-than-expected wholesale inflation data for last month.\n\nCryptocurrency Gains +/- Price (Recorded 8:30 p.m. EDT) Bitcoin BTC/USD -2.10% $61,719.45 Ethereum ETH/USD -2.11% $2,890.58 Dogecoin DOGE/USD -1.67% $0.1467\n\nWhat Happened: World's largest cryptocurrency, Bitcoin slipped below $62,000, failing to sustain its gains from the previous trading day.\n\nThe market dip triggered $144 million in liquidations in the last 24 hours, with long liquidations touching $114 million. Bitcoin led the pack with $39.5 million in liquidations.\n\nThe price drop influenced the derivatives market's sentiment as traders taking short positions on Bitcoin sharply increased vis à vis those gunning for price increases in the last 24 hours.\n\nThe negative sentiment permeated as the U.S. Bureau of Labor Statistics reported a 0.5% increase in wholesale prices in April, higher than analysts' estimates, lowering expectations of an interest rate cut by the Federal Reserve\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 8:30 p.m. EDT) Ethena (ENA) +4.10% $0.8947 Lido DAO (LDO) +3.11% $1.97 UNUS SED LEO (LEO) +2.61% $5.93\n\nThe global cryptocurrency market cap stands at $2.24 trillion, shrinking 2.12% in the past 24 hours.\n\nIn contrast, the equities market surged on the day. The Dow Jones Industrial Average added 126.60 points, or 0.32%, to close at 39,558.11. The S&P 500 gained 0.48% to end the trading session at 5,246.68 points. The tech-heavy Nasdaq Composite closed at a record high of 16,511.18, following a 0.75% uptick.\n\nInvestors chose not to overreact to the hotter-than-expected wholesale inflation data ahead of the more significant consumer price index data, slated to be released on Wednesday.\n\nSee More: Best Cryptocurrency Scanners\n\nAnalyst Notes: According to on-chain analytics firm Santiment, bearish sentiment for large-cap cryptocurrencies was on the rise, as they failed to recover strongly. The firm also blamed Coinbase’s recent downtime for fueling the FUD.\n\n😒 Crowd negativity is very prevalent among top caps as they have failed to show sustained rebounds to keep traders interested. #Coinbase's outages and withdrawal freezes appear to be exacerbating this. #FUD could be big enough to propel a rebound soon. https://t.co/lntwhLetB1 pic.twitter.com/TRmSEM4LhX — Santiment (@santimentfeed) May 14, 2024\n\nHowever, Santiment added that rising negativity may play a significant role in accelerating a market recovery.\n\nProminent technical analyst Kevin spotted a falling wedge pattern for Bitcoin, noting, \"BTC is currently compressed between a ton of support and resistance and it’s gonna pop one way or the other within days.\"\n\nThe researcher pointed out that an upward breakout from this zone may propel the coin to $68,400, exceeding which could lead to price discovery. To the contrary, a breakout to the downside might see Bitcoin plummeting to $50,000–$52,000.\n\nUpdate on #BTC daily chart. BTC is currently compressed between a ton of support and resistance and its gonna pop one way or the other within days. Even though its not well defined I guess you can say we are in this falling wedge type pattern or a bull flag. 100 EMA is below with… pic.twitter.com/ZM4csGBnBX — Kevin (@Kev_Capital_TA) May 15, 2024\n\nRead Next: Ethereum’s Underperformance Against Bitcoin, Solana Means It ‘Will Need More Demand Sources,’ Says Trader"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQbDVLX1NaTmtLZThha0cxNmNsaVgxX1NWMkRiVnp2MDh0ZC0ycDRINVVLdDJFbHJpYVU2aDN4UHYzQjR1Y3c4bzJPeE50cFZ4TWFMcUtSS3RMY3ZEWmh5SkdZMVlXMnV3LUE3NHVCbE5QN1N4U2dCMkk1bUlab1o2ZklkTGRpR05OZjJIbjRGQUU4cVRhY3ZWeTM1WkhiM1FHY1hJ0gGoAUFVX3lxTE80VGp2VThWMUptdjl0ckN6ZjBKal9rd0Rfc2xvWU8tNnBMeXRoVlRMMW83RFJJRmc1dFoySXFsQThFQ25vZEFJQ0RONjlVYlZXMkh2X3kyaUVudlk2STFWYnNCdGtXYlVQRHBxcVhyVHRVT3JYSUFZNDJjbmxMemNCWlFRU29ZNHgzNDFwM2tjYmhjSF9MejZxcXFRNlBQS2g4LWhwQUlMaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Ethereum Struggling At Crucial Support, What Are Bears Targeting? - Coinpedia Fintech News",
        "content": "Zameer is a financial analyst and writer with a particular interest in cryptocurrency markets. He has been studying cryptocurrencies and their market behavior for several years and deeply understands the factors that affect the price of cryptocurrencies. His expertise lies in his ability to use both technical and fundamental analysis to make informed predictions about the future direction of cryptocurrency prices. He has a strong understanding of market sentiment and uses this to inform his trading decisions and price predictions.\n\nEthereum plummets down breaking support zones and still relying on the main uptrend support of $2880.\n\nThe overall trend trunks bearish again after increased selling pressure.\n\nA reversal can be seen if the buyers keep the price above MA lines ( $2900)\n\nThe biggest altcoin Ethereum(ETH) was rejected at $2996 and now heading down toward the main uptrend support level at $2880. Currently trading at $2902 with a 24-hour drop of 2.48% and a weekly drop of 5.64%. The downtrend that started after April 13 could never be reversed so far.\n\nOn the upside moment, the buyers have failed to maintain the price above moving averages.\n\nThe 1 hr ETH/USDT Chart says it all, forming a long-standing down-channel in the same range with price reading below the 50 days and 200 SMA isn’t a bull favorable trend. The RSI being more unstable at 35 indicates a slightly unsustainable trend.\n\nDencun, and Spot ETF Approval On The Reason Board\n\nEthereum’s downtrend can be seen to be the impact of unfulfilled demands by the Dencun upgrade that was released in March 204. The upgrade was a layer 2 blockchain upgrade to reduce time, and fees and increase the scalability of the network.\n\nThe other major impact is the unapproved and long-anticipated Ethereum ETF approval. The recent crackdown on SEC indicates a prolonged wait for the approvals to be in 2025.\n\nInterestingly, today on 14 May data revealed by the analyst “ Data Nerd” shows multiple whale withdrawals. In 24 hours, a total of 78,301 ETH were withdrawn from the exchange wallet. This can also be seen as a sign of accumulations, leading retail buyers to charge up.\n\n\n\n"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPN0laTEMyV2dCUFBESk5RSVF2SU1waUduM3JhQ1RlVzhWbEtUZVpTdEc0ZEI3Qy1GTXZMNGVCelYzbWdKOW5sTTBqclBBZ0NqWkZoQWxuT2p4QzRUSldXdzRta0NZMnVKMnlLaUhObk1udlp0dEt4YzY5VDRYLXZ4V24wRDRUam56ejloaklib2dZODUyV1ZSVGFWNlFsWjdlU2FMaUhNQm9uSkHSAbABQVVfeXFMUEZKSmtBcGtnaTNMU1AwVFhRUXdqQm9fSmxleUpLbGcxeFJzVWFOUWNhU25aY1NfVERuQ2ZzSkkwX3ZPdGVPRmhka1hiZ2FHYzFUbEdnN2d5RVlmMldHQWx6aTFmQ1llc0VKSG5VaEdZT2VOWFo3TFdnME1ESW9qTnRmX1VqRWV3SEtEUzM2cnYtVkh4MUpaS0lpenhMalZoSHVwZm9GLVJjbDduMWxQV2g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 May 2024 07:00:00 GMT",
        "title": "Ancient Whale Moves Millions in Ethereum to Coinbase: Is This the End of the Crypto Boom? - Coinpedia Fintech News",
        "content": "Mustafa has been writing about Blockchain and crypto since many years. He has previous trading experience and has been working in the Fintech industry since 2017.\n\nAncient Whale Moves Millions in Ethereum to Coinbase: Is This the End of the Crypto Boom?\n\nStory Highlights Ancient wallets from 2016 bought Ethereum at $11 per coin, now transferred millions to Coinbase.\n\nLarge-scale ETH transfers to exchanges spark concerns about market sentiment and sell-offs.\n\nDormant Bitcoin wallets moved 687.33 BTC, worth $43.89 million, after over 10 years.\n\nEthereum (ETH) is making waves in the crypto seas as ancient whale wallets migrate to Coinbase, causing ripples of volatility and sparking concerns among investors about a potential market shake-up.\n\nHere’s everything that there is to know.\n\nEarly Investors, Big Moves\n\nDiving into Ethereum’s history uncovers stories of early investors who snagged their ETH at remarkably low prices. One such tale revolves around a whale that first entered the scene in 2016, scooping up a massive 12,427 ETH from Poloniex at just $11 per coin.\n\nFast forward to today, and this ancient behemoth has made a splash by depositing 4,153 ETH into Coinbase, now valued at a hefty $12.17 million.\n\n8-year old whale made a move again.\n\n\n\n3 hours ago, the whale 0x2cE deposited 4,153 $ETH (~$12.17M) to #Coinbase.\n\n\n\n8 years ago, he accumulated 12,427 $ETH from #Poloniex at avg entry $11.\n\n\n\nHis wallet:https://t.co/rgBtQ6R1RUhttps://t.co/kx6zfjxZ59 pic.twitter.com/WMUGfI20fd — The Data Nerd (@OnchainDataNerd) May 13, 2024\n\nThe motives behind these whale-sized transactions are clear. With the current market price of ETH hovering around $2,984 per coin, these early investors are eyeing profits that would make even seasoned traders envious. A staggering surge in value, amounting to an impressive 27,027.27%, underscores the bountiful rewards reaped by those who took the plunge into Ethereum’s depths when it was still in its infancy.\n\nA Tale of Two Whales\n\nBut the Ethereum saga doesn’t end there. Another ancient whale recently made waves by transferring 614 ETH to Kraken. Having initially snagged these coins five years ago at an average price of $195 per coin, this investor’s haul is now valued at a staggering $1.79 million. And yet, this is just the tip of the iceberg, as they still hold a formidable 1,329 ETH, valued at almost $4 million, in their digital treasure trove.\n\n3 hours ago, a whale 0x06E just deposited 614 $ETH (~$1.79M) to #Kraken.\n\n\n\nThose $ETH was bought 5 years ago with avg entry $195.\n\n\n\nJust now, he still has 1,329 $ETH (~$3.9M) in his wallet.\n\n\n\nHis address:https://t.co/Odin18efJK pic.twitter.com/Uie9gipeJJ — The Data Nerd (@OnchainDataNerd) May 12, 2024\n\nWhale Watch: Signals of a Market Shift\n\nOn the flip side Whale Alert, a popular cryptocurrency tracker, has also reported multiple transactions where unidentified whales transferred large quantities of ETH to Coinbase. These transactions, including 30,020 ETH, 11,192 ETH, and 11,207 ETH, are collectively valued at tens of millions of dollars.\n\nThese activities suggest the possibility of a sell-off by major holders who are capitalizing on Ethereum’s recent price surge.\n\nAwakening Ancient Bitcoin Giants\n\nFurthermore, in addition to the Ethereum activity, Coinpedia previously reported the awakening of ancient Bitcoin wallets that had been dormant for 10.3 years. These wallets recently transferred a substantial 687.33 BTC to two undisclosed wallets, with a total value of $43.89 million.\n\nThe sudden awakening of ancient wallets and the movement of substantial ETH holdings to exchanges signal a potential shift in the cryptocurrency market, hinting at upcoming sell-offs as part of profit-taking.\n\nAlso Check Out: Ethereum Price at Risk as Critical ETF Decision Approaches: What Next For ETH Price?\n\nAre you worried about a potential sell-off? How are you adjusting your crypto strategy?"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPTFdOMmdTdXc1LUlVQ1pvV1JyNDdDdU9zbUx0MmRHZkNjTWNNYUo2Q3pTSnhpMmNIX3JvWTlmaWhxa2lTWTRGOVk5V3hHRFdmakRJTVV6X2t1aV9KSHRWRS1JSndXanduZndxaVZZNzNIQU84azRwdnNkWjAwQkJZelkySU15dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Ethereum Spot ETF Awaits SEC Verdict as Deadline Nears - Coinfomania",
        "content": "The US Security Exchanges Commission (SEC) on Wednesday, August 22 announced that it has disapproved of a proposed rule change that would have allowed investors to trade nine different Bitcoin Exchange Traded Funds (ETFs) on various exchanges.\n\nCoinfomania previously reported that the disapproved bitcoin ETFs include a pair of requests from Proshares, five from Direxion, also for listing on NYSE Arca and two proposals from GraniteShares, for listing on CBOE.\n\nThis sad news, coupled with reports of a new and strict regulatory framework for cryptocurrencies and ICOs in China, left the crypto markets on red earlier today after short-term gains from the previous trading day. But as usual, corrections soon followed.\n\nWith so much sorry saga about the approval of a bitcoin ETF by the SEC, some experts in the industry have concluded that there are very slim chances for the approval of a BTC ETF this year.\n\nHowever, a new report has revealed that there is still some hope of a reversal on the sad decision for Bitcoin enthusiasts. SEC commission Hector Pierce, who has been famous for lending her support to cryptocurrencies, confirmed in a tweet that the number of the rejected ETFs have stayed pending a second review by the Commission.\n\nYesterday’s staff orders disapproving SRO rules related to a number of bitcoin ETFs are stayed pending Commission review. See, for example: https://t.co/Ky9Z8t1E4q — Hester Peirce (@HesterPeirce) August 23, 2018\n\n\n\n“In English: the Commission (Chairman and Commissioners) delegates some tasks to its staff. When the staff acts in such cases, it acts on behalf of the Commission. The Commission may review the staff’s action, as will now happen here,” Pierce explained further.”\n\nAccording to a letter from the SEC, addressed to Eugene Schlanger, Senior Counsel of the NYSE Group, the Commission will review the disapproval order, but the order is still valid until the SEC revokes it.\n\nAlthough this report from the Commission does not in any way imply that the decision will be reversed, it has, to a large extent, put a smile on the faces of crypto enthusiasts.\n\nAlso, recall that Coinfomania reported two weeks ago that the SEC’s final decision of the Winklevoss twins Bitcoin ETF proposal had been scheduled for September 30, 2018. These events have made members of the crypto community remain optimistic that a bitcoin ETF could happen this year.\n\nDo you think one of these BTC ETF applications would be approved?"
    }
]