[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE8wMHo5X2s3WmNkUzNkMHVXTWNBM1ZsY2ZJTEQ1RW5sMXFJWDd5cGNtcUVvaTZMOEg2S0t2TlluTVJTRjFPNGxyYXNiZEhoWXQyRnlReTdNWnVXQk56QlVOeGtwcVY4ckpvVTJJSTdZQlExT1nSAXhBVV95cUxOU1J4RzhfeXNWMklPVU56WEluVUNFUFN1aUhiNnpINHBYOHI0aGdyZEwxNHhTREN5RFBnS2VDdjhBY3pmckZVakFxZGNxd21yTGtNelF1TnBFNzkyN3B2ZVVXeXlfUUl1VmVmazNzbzhSVktzcmM4aUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Feb 2024 08:00:00 GMT",
        "title": "Ethereum ETF in March? Bloomberg Expert Thinks Not - U.Today",
        "content": "Speculations are rife within the crypto community regarding the potential launch of an Ethereum ETF as early as March. Amid the buzz, James Seyffart, a renowned research analyst at Bloomberg Intelligence specializing in ETFs, has cast doubts on the feasibility of such a development.\n\nAdvertisement\n\nTaking to social media, Seyffart dismissed the rumors, asserting a firm stance that there is a negligible likelihood of an Ethereum ETF materializing in the speculated time frame.\n\nDespite the fervent speculation surrounding the matter, Seyffart confidently expressed skepticism, even placing a wager of 4 ETH against the purported likelihood of an imminent Ethereum ETF launch. His public dismissal comes as a response to the increasing traction of rumors within the crypto space, with numerous individuals bringing the speculation to his attention.\n\nAdvertisement\n\nNo — James Seyffart (@JSeyff) February 18, 2024\n\nInterestingly, while Seyffart remains doubtful about a March launch, he declined to extend his skepticism toward a potential Ethereum ETF by the end of 2024.\n\nIndustry push\n\nMeanwhile, recent developments indicate ongoing efforts by financial institutions to secure regulatory approval for Ethereum ETFs. VanEck and ARK/21Shares have submitted revised filings, signaling their persistence in navigating the regulatory hurdles.\n\nAdditionally, Standard Chartered and Franklin Templeton have also made strides in their respective applications for Ethereum ETFs, reflecting growing interest from traditional financial players in offering exposure to cryptocurrencies through regulated investment vehicles.\n\nWhile Seyffart's statement might dampen some spirits, the counterpoint lies in the continued industry push. Revised filings and new applications from established players paint a picture of sustained effort. This suggests that even if a March launch is unlikely, the underlying momentum for an Ethereum ETF remains strong, making its arrival in 2024 a real possibility."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPVVZtWWlQUHBOcEMzTVBWZ2VpYWNYQlJacnFOX0gzMFc2MXJIU2U3a0VCZjJSb2xSOXBOR0cxeVJQR21GNld0Nm5val9WTldMMzY5OE1hMmZ4YTNERzJnanRaaWJsTHZBWWRjaF9EWXZvbFNCampYazYwQ19SWFV1dDd3NHo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Feb 2024 08:00:00 GMT",
        "title": "Ethereum: Here’s When ETH Could Reclaim The $4000 Level - Watcher Guru",
        "content": "Ethereum (ETH) is following the market-wide rally, surging above $2.8k for the first time since May 2022. ETH has rallied 2.7% in the daily charts, 16.3% in the weekly charts, 23.8% in the 14-day charts, and more than 11% over the previous month. Moreover, ETH’s price has surged by 68.4% since February 2023.\n\nAlso Read: Ethereum Weekend Price Prediction; ETH Eyes $3,000\n\nETH is currently following Bitcoin’s (BTC) trajectory. BTC’s latest rally could be due to increased inflows into spot BTC ETF (Exchange Traded Fund) investment vehicles. However, ETH is still down by over 40% from its all-time high of $4878, which it attained in November 2021.\n\nWhen will Ethereum (ETH) reclaim its all-time high?\n\nAccording to CoinCodex, Ethereum (ETH) will breach the $3000 level by next week. The platform anticipates the second-largest cryptocurrency to hit $3078.45 on Feb. 22, 2024, a rise of about 7.9% from current levels. However, CoinCodex predicts ETH to fall below $3000 soon after.\n\nAlso Read: Ethereum Shock: $113K Gas Fee Spree Leads to Crypto Catastrophe\n\nChangelly anticipates Ethereum (ETH) to reclaim its all-time high in 2025. The platform predicts ETH to hit a maximum price of $6,263.37 next year, a rise of nearly 120% from current levels.\n\nTelegaon, on the other hand, anticipates Ethereum (ETH) to reclaim its all-time high in 2024. The platform predicts ETH to hit a maximum price of $5,054.04 in 2024, a rise of over 77% from current levels. However, the platform does not clarify which month ETH could reclaim its all-time high.\n\nHowever, there is a possibility that ETH could reclaim its 2021 peak very soon. There is a lot of talk about the US SEC (Securities and Exchange Commission) approving a spot ETH ETF later this year. A spot ETH ETF, along with BTC’s halving in April, could usher in a bull run for the crypto market."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNZC01bnZuUS1SYUZBdi1RcEdzSnU0SXFDRGtoR25Tc1hlcUNYdTh6RFQ2SWJKWXJoemgtMklJQjBCRWQ0X1hlY2UweGxuR1RtODRlR2N5aGFGcklnc2liSzlhaE90cHczOFFTYWh0VVpFNVQwS09zUmpqM1d3UVJHUjZlOVFKUkpoUm5jYU0yUmFYVktw0gGaAUFVX3lxTE5QTWdLTjhPTkx0dXFoTkhOZVBENU1SandJNW1GUTRpQkRFQThyRl9TSFBpZEhHTU5kVFlwemYzX0xQTDVUT1hoZ21fSXpuZHltczRmU2tCY2QzbVRmaHdzb1dVbndpQkhXQXlUbnhVc3VYSEFBX3V4My03MW5pX3pWWmxLSVFMSXRBZGpRa3JjNmVWUHlJYlhpZWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Feb 2024 08:00:00 GMT",
        "title": "Ethereum bulls might help prices, but predictions show… - AMBCrypto News",
        "content": "Ethereum showed strong bullish sentiment on the price charts.\n\nA retest of the range highs would provide an ideal buying opportunity.\n\nEthereum [ETH] saw a minor pullback from $2867 to $2719 from the 15th to the 17th of February.\n\nThis came after the strong breakout past the range highs at $2.6k, a level that the bulls struggled to breach over the past six weeks.\n\nThe steady rise in active addresses in recent weeks suggested that a long-term uptrend was beginning, but that does not rule out retracements.\n\nTwo demand zones were identified- but the data also suggested that a move toward $2900 was imminent.\n\nGauging the state of the market\n\nThe H12 chart of Ethereum showed a clear uptrend in progress. The market structure was firmly bullish. A drop below $2472 would be required to flip the structure bearishly.\n\nThe RSI was at 73 at press time and has been within the overbought territory over the past six days.\n\nThis does not necessitate a deep pullback, but it does show that the prices were likely overextended and might need time to cool down.\n\nMeanwhile, the OBV continued to rally higher as buying volume spurred it northward.\n\nThe steady demand and momentum indicated that it was only a matter of time before Ethereum prices climbed to $3000 and higher. Beyond $3k, the $3250 and $3580 levels were significant resistances.\n\nShort sellers could face liquidations soon\n\nAMBCrypto also analyzed the liquidation levels data from Hyblock.\n\nNotably, the Cumulative Liq Levels Delta remained positive despite the minor pullback over the past couple of days. This showed there were more long liquidation levels.\n\nHow much are 1,10,100 ETHs worth today?\n\nHowever, their liquidation clusters were at $2550 and just below the $2700 mark. Meanwhile, a $179 million short liquidation level was present at $2858 (blue).\n\nHence, a move to the $2850-$2900 region was likely. It could be followed by another move higher, as the long liquidations, while more numerous, were more spread out.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMimgJBVV95cUxOak1kc2xpTUJ3Tkd6RUEwekdKbnlzRDRpZkVvalk5MVh2X09GT2wzM1FhNTM1VVBSajJ6SFYxX2NVakx2VVRlSk01OWh4WDR4M1pGQmo5bWhIdXFQakptZGdyY3hPVF83V1hRcGhKOFdkRTJMZllUT3NNVHM2UDdhdHplVFJoNkFFTnd5YVhWN2pVRlB6cTJsOW1oR1c4QzRiakVRVHRnZnYxZXFJUTJ5cWlNck5wZTdwODc0OTJ2X3VwckRlODdxeXU0ZjJQdFhLQzdOczFwdjl6aExLcnFTS2dIYVNQZVN0RzZmSmc2eExENzVVYmJoajV0cFdwMllkd2RfLVFxYzcta3YzZm5wN1JpMldGN21kbEHSAacCQVVfeXFMTWUwSUhNMTRKbXhKTzdVMmZBOHU5eV9KWkplX3dlNlhkZndpNW0tWW9FN2tOYzQzak9TRGpwaWF6dDZJV0VsNWJ5aS1WemJiU2hyNXp2dUZ1YU95TEk1WXhsMG5za3ItaTlRa0t4amhxeTU3RGhJUEl4WUZpemhrU2dWZlhhLVNYa2tuS3UxQlpuT21BaGZjNGY2bG9QZm1seWxBUEZndUtfT3ZITTdKWXZZQzdXdkZ4VFU2TllpY2l2RVpRdXZBX1lyZnQ5b3FDMUxNM3pLekdXUzBGZGRzbEkxS0ZRWFlUY1lJRUdsUXJOSXc1ZWM1clNKbXluTDlJNTFyb0VIdVExSWVXRUNKUFNqWThyNmR4RnlqeE5odHdmb1dQdDEzVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Feb 2024 08:00:00 GMT",
        "title": "Prominent analyst says $100,000 for Bitcoin (BTC) is guaranteed, placing Ethereum (ETH) north of $6000 and Retik Finance (RETIK) at $18 - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxONzQ4MFVPWlVEY1ZHU3dfLTJTWm4tSDkwV09UOG4xMzBVOEZzb1JZZE9qNk9sRVlQZEtRR3BiZDF4cTdDNE45bXZVekExNkg2QzBlVzRnd21fY0VGNno1RWp4c1R0Y0NUaWdLVDlHZnl4UXhDWDgxTU1WWlVLc3BSZkxkQ0U1Q3h5SGNRbERjbUhYQjhQQ3V4RnFGY3ZSemtlMXk0SHlKUUtLb3FLQjdsVk4tTmFxTXlNbkExeFpB0gHEAUFVX3lxTE1OWm5MeDRjazM3VWFXUXpSSEwzc242WTBnMXpuMWVZSXc2Q2hiZGxXbC1oNGxRVzRZcklSc1Rmak9URklCa0tESWpTbnRPcTdJOVVSR2Y5N1ZuYVdLd3I2T05FQWx4RlVxZ0JZMTM1Y21hOHp3VENGTWFKbUE5MHM1OGVyMFFSNDhtQ1BveTZIY3J5TUhjQUdnUHlYSlA3RXpwZEpFUGRaUW5lY0tCdV9oNWkwNEU0S09CRktlZGljQmxlV1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Feb 2024 08:00:00 GMT",
        "title": "Battle of the blockchains: Can SOL challenge ETH? - The Financial Express",
        "content": "By Rajagopal Menon\n\nWhen David Hoffman, an ETH maximalist, narrated his experience of being at a Solana conference on Bankless, he casually emphasised that “Solana is not Ethereum, and it’s tiny”. Of course what he referred to was the market size of Solana vis a vis Ethereum, thus discounting the bullish narrative around SOL which according to him, is a community-built scenario on X(formerly Twitter). It sort of begs the response which was also a famous quote from the TV series Game of Thrones – “a very small man can cast a very large shadow.”\n\nBitcoin has minimalist functionality. It was designed for store of value and transfer of value. To overcome these limitations, a 19-year-old Russian developer Vitalik Buterin, wrote a new language and developed a new programmable blockchain called Ethereum. Blockchains become programmable when equipped with highly expressive programming languages that are nearly Turing-complete. Expressive languages facilitate the creation of code that is easily comprehensible. Turing completeness implies a system in which a program can be formulated to find solutions, allowing the program to execute a wide range of tasks using its codebase. Presently, Ethereum stands out as the most widely adopted programmable blockchain. With an early mover advantage, it was one of the first blockchains to facilitate and spread awareness of building applications and utility for crypto. It’s no surprise that Ethereum’s total value locked (TVL) has surpassed $20B at the moment.\n\n\n\nAs soon as applications started being built on blockchain, the Twitter community backing Vitalik’s visionary crypto project was present to remind anyone and everyone that Ethereum network was the place to be. Even today if a newbie considers building a product on blockchain, they would do their research on Ethereum before getting spooked by the high gas fees that have created hurdles for the network. This would then prompt them to look for more cheaper options, and the ever active messaging platform X, with Shib and Doge armies would make him/her consider Solana. It’s like your elders advising you to put your money in the same retirement fund that they invested in versus your peers encouraging you to go for low ticket investments which could bring high returns without putting a dent in the pocket.\n\n\n\nSolana’s TVL of $600M seems miniscule compared to Ethereum and might not look like an apple to apple comparison. However, we must remember that Ethereum started out like Solana when Bitcoin was the OG Crypto and eventually made its way up to the top of the charts, second only to BTC. As of now, Solana has secured its position in the top 5 tokens by market capitalization. This is a more constructive insight compared to TVL since it indicates a steady interest in capital inflows on Solana network in the last three years. While most have been attributed to the success of memecoins, frequent airdrops, robust community building and engagement, its price movements have also shown signs of promise. It pierced the 2% dominance mark on the charts in December 2023, an indicator of a bullish phase according to historic patterns.\n\n\n\nSolana seems to have cracked the code in terms of scalability and network efficiency with high TPS and low gas fees. This has largely contributed to building traction among developers who want Web3 to live up to its hype and produce dynamic results with exceptional capabilities, resulting in over 100 dApps being built on Solana. It could have been higher if the FTX fiasco didn’t occur at all. Solana is now boasting around 2500 active devs monthly, with a retention rate of 50%.\n\n\n\nIn 2023, Ethereum’s rollups saw success with the implementation of new frameworks by Layer 2 solutions like OP Stack, Arbitrum Orbit, and Polygon’s CDK. These helped the launch of new chains, functioning as either Layer 2s or Layer 3s. While Ethereum has more than 500 dApps running on its network, with over 5000 devs, it could see a contender emerge in Solana because of the new age DeFi apps being built, lucrative for crypto enthusiasts and their need for an instantaneous avenue for products they choose to engage with. Ethereum’s transaction fee of $1.149 is quite steep not just for developers but traders as well. Even though interest on the network continues to grow especially after the transition to Proof of Stake, it is slowly starting to look like a network for crypto veterans as compared to the new entrants.\n\nAlso Read Mumbai Local Train Update: Indian Railways working to increase frequency of trains, set to reduce wait time from 3 to 2.5 minutes Centre may sell part of residual stake in HZL in FY25; Move follows promoter Vedanta’s recent OFS Mumbai-Ahmedabad Bullet Train project: Over 175,000 noise barriers installed on 87.5 km viaduct Indian Army’s Bold Mission: Using Veterinary Care to Defuse Ethnic Tensions in South Sudan\n\nThe fact that Solana has reached the top 5 token list on the chart and also presents a potential for catching up with Ethereum’s market cap, indicates immense scope of its price increase in the next couple of years. But if Ethereum is too worried about Solana touching its tail, it has ETFs coming its way which could further boost its price and market cap, giving them some respite from all the buzz around SOL.\n\nVitalik has been the bigger person in blessing Solana with success in the past but it could also have been a gross underestimation of its potential which the industry couldn’t have foreseen. The colossal growth of Solana in 2023 has drawn developers en masse. With transaction fees as low as $0.00025 per transaction, it’s the go-to for launching fresh blockchain projects and DeFi apps. New devs with limited resources lean towards Solana for its enhanced transaction speed, lower gas fees, and superior scalability – the golden trio for any web3 dev. Solana is the ‘new age’ blockchain, offering amenities for NFTs, in-app transactions, and seamless payment settlements.\n\n\n\nEthereum, holding the second-largest market cap, often masks certain network drawbacks like gas fee and less scalability. Ethereum loyalists argue its matured ecosystem can weather volatility and security issues, making it the choice for stablecoins and real-world tokenized assets. Ethereum is quite omnipresent in the crypto ecosystem, especially for DeFi and metaverse stakeholders who somehow find themselves directly or indirectly in contact with ETH.\n\n\n\nIn the upcoming bull run, amid positive developments, both networks stand to gain. Solana could host new projects appealing to crypto newcomers, backed by solid sustainability plans and ample capital from improved VC funding sentiment. Institutional crypto investments, boosted by ETF launches, will see TradFi institutions building more use cases on blockchains. While Solana and Ripple have secured remarkable partnerships, Ethereum’s trust and credibility positions it as a major contender for the new wave of products in collaboration with traditional institutions. Solana isn’t poised to ‘kill’ Ethereum with the current state of events. But, never say never.\n\nThe author is vice-president, WazirX\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPY1d3c0stb3o0VUZVanM2emoydEZULV94dWpsYThpbWZWVXVqdDlHYjlBRlQzaUVSVE9UQVRvajhELW5VM19SelNHbHBqVjB1MnloTW0tcW5tdm5sSkFFNFZyNVlxRkdtZ19TTVJzVzZneWhyZlJnM1VmaGFsdllYNzMzYlBRZDN6NkJ4Z0JrbmYxY1ZYbnhoRzR2ZlY4OWtzbzVyRG03TjQzeUVW0gGyAUFVX3lxTE9vQXBWalRLWTRQbzlFS3RYZTd6M1U3Zjh2bTd5X3FMa0wxQUJfamxnVXlmcFplbUJwdl9USE1Tdng0a0xGanJXdkNlOFFQa0ZKSEl3WWVpZVp1cTVJcHZ6OUlEc2hYOTJCMGFTUnZTYXJ1WTc4V0ZUUzU2RGdibWNqVHhpY1d0NC1KWjVLZFhpUnZlY0U3U3JVYngwRm5FV2xtaklkTmxYZGZ6TEl6aWxqUWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) $3,000 Mark Confirmed, Solana (SOL) Fails Unexpectedly, Dogecoin (DOGE) Reaches Nemesis Resistance - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum's recent price action suggests that the $3,000 mark is within reach. This level is not just a psychological barrier but also a significant milestone that reflects the growing confidence of investors in the asset's long-term value proposition.\n\nUpon reviewing the latest price chart, Ethereum has been on a remarkable upward trajectory. The digital asset has persistently held above the 50-day and 200-day Exponential Moving Averages, which are often looked at as indicators of bullish sentiment when the price is above them. The 50-day EMA, in particular, has provided strong support during the recent uptick, currently residing around the $2,500 mark.\n\nEthereum's surge past the $2,800 level has been met with increasing volume, indicating solid interest in sustaining higher price levels. Resistance is anticipated as ETH approaches the critical $3,000 threshold. This is due to the expected profit-taking by traders who view this round number as an opportune moment to realize gains. However, the strength of the current trend suggests that any pullback might be short-lived.\n\nIf Ethereum faces selling pressure at $3,000, the $2,800 level may serve as the first line of defense against a significant retracement. A further drop could see the $2,500 zone, aligned with the 50-day EMA, acting as a more substantial support level.\n\nAdvertisement\n\nOn the flip side, if Ethereum breaks the $3,000 resistance, we could see an extension of the bullish run, with potential targets moving into uncharted territory. Such a move would confirm Ethereum's bullish stance and could trigger a new wave of speculative interest in the asset.\n\nSolana loses momentum\n\nSolana has encountered an unexpected stall in its price momentum. The asset, which has been the main choice of bulls during this bull run, has struggled to breach the $120 resistance level, a barrier that has proven to be a significant challenge.\n\nAn in-depth analysis of the price action reveals that SOL's movement has been constrained, with the $120 mark acting as a ceiling to its growth. This level is not just a technical resistance but has become a psychological one, with each approach being met with selling pressure that pushes the price back down. The inability to push past this point has led to a period of consolidation, with the price oscillating between this upper bound and support levels beneath.\n\nThe immediate support for Solana is observed around the $100 zone, a level that has been tested several times and has so far held firm. A break below this could open the door to further losses, with the next significant support level at around the $90 mark, where the 200-day Exponential Moving Average lies.\n\nThe lack of upward momentum in Solana's price can be partly attributed to broader market conditions, where increased transaction fees on the Ethereum network have led investors to explore alternative platforms. While this could potentially benefit Solana, the network itself has yet to showcase substantial growth factors that could catalyze a new wave of adoption and investment.\n\nSolana's recent outages and network instability have dampened the sentiment around the project, causing concern among potential users and investors about its reliability. These technical challenges need to be addressed for Solana to regain its footing and become a viable competitor to Ethereum once more.\n\nDogecoin faces fierce resistance\n\nDogecoin has encountered what may be considered its nemesis resistance at the $0.08 level. This price point has proven to be a formidable barrier and acted as a point of reversal during the previous run.\n\nDogecoin’s price chart indicates that while the asset has encountered resistance at $0.08, it has shown a commendable ability to break through previous resistance levels. The resilience of Dogecoin’s price can be seen in its recent approach to this threshold, as it edges closer to a potential breakout. The momentum behind Dogecoin, supported by an increase in volume, suggests that the asset may indeed possess the strength to push past this key resistance level.\n\nSupport for Dogecoin is currently established at the $0.075 level, where the cryptocurrency previously found buying interest. If a reversal were to occur, this support zone could be the first to be tested. A breach below this could see further support at lower levels, potentially around the $0.07 mark, where the 50-day moving average lies.\n\nThe Dogecoin network and community are experiencing a resurgence of activity, partly due to the celebration of Dogecoin's 14th birthday, which has historically been a catalyst for increased interest and speculative trading. Additionally, the potential implementation of Dogecoin on various payment platforms, including X payments (formerly known as Twitter) might become a strong growth factor."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPa3pBSWpCTV9QX3lwRjd6ZWpPUjl3QlV1OXRMMHVZUUtkajVWOEFpU2J2ZkFPazlIX3Jid1RYbi1BYWd3MWhpWUpTdHF2NmRzaXRXUjN3Umo2QzlHTFllUGFNdk5SRnFYM0Y1dzhBUFJLN2FjQTM3UElvVWVxZUhSZHJxOEplUkV4WnFDSUVR0gGTAUFVX3lxTE92aDdWNTdTYlgzalVxbDR1OGJqNl9xRks2YXVYSVc1TldDU29rMUd5YmU2b2hOT2pMSFJQUExMSzBXY0hKODZMWjVoaTQtZWxjcmRZYzh4YmFqckxiR0t6MVA1LWd3Uzdhcmt5Z0M4UVBRbEFWSlk4dENvdnRFQjBqQ2xnQklEV0lNTXEzR3RPS0s2bw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Feb 2024 08:00:00 GMT",
        "title": "Ethereum gas fees hit $84M last week, thanks to the ERC-404 hype - AMBCrypto News",
        "content": "Gas price paid per transaction bounced to levels last seen during the memecoin frenzy of May 2023.\n\nETH witnessed a minor retracement in the last 24 hours, dropping below $2,800.\n\nTransaction costs on Ethereum [ETH] rose to a 9-month high, spurred largely by the hype in the experimental token standard ERC-404.\n\nUsers make a beeline for ERC-404 transactions\n\nAs per on-chain analytics firm IntoTheBlock, the network collected a total of $84 million in gas fees the past week, marking a 61.5% jump from the week before.\n\nIn fact, average gas price paid per transaction bounced to 71 Gwei on the 9th of February, according to AMBCrypto’s analysis of Glassnode’s data. Such levels were last seen during the May 2o23 memecoin frenzy that saw the emergence of Pepe [PEPE] token.\n\nThe spike came in the days following the launch of the first functional ERC-404 project, Pandora, which has seen extensive demand lately. As of this writing, the Pandora token was up 270% since its launch, according to CoinMarketCap.\n\nFor the curious, ERC-404 is a unique token standard, which combines the properties of ERC-20 (fungible tokens) and ERC-721 (non-fungible tokens). As a result, tokens under this standard are both fungible and non-fungible at the same time.\n\nA special use case of this not-yet official token standard is that it can be broken down into fractions, effectively allowing multiple users to collectively own a single NFT.\n\nAn X user with a pseudonym PopPunk, who also happens to be a co-founder of gas auditing firm, stated that an average ERC-404 transaction required three times the gas required for an average NFT transaction. It was evidently clear that ERC-404 tokens were costing users a bomb.\n\nMeanwhile, AMBCrypto also observed a spike in daily on-chain transactions over the week, to the tune of 17%. In fact, about 1.15 million transactions were settled on the 16th of February, the highest for the month.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nETH pulls back but market appetite grows strong\n\nAs of this writing, the second-largest crypto was exchanging hands at $2,790, according to CoinMarketCap. ETH witnessed a minor retracement in the last 24 hours, dropping below $2,800.\n\nThe broader market sentiment was one of “extreme greed”, as per the reading from Ethereum Fear and Greed Index, suggesting substantial FOMO among market participants."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBMV1ZRQWgwbWl3dXpYYW5COC1BUDlwWHRRQ2hZY0hOU21Ic1FGRVk0NERBbU5TWW5mNUpZWDdaZEZtb1VhX25NMUNiUzgzcDhrUF8za19DVWVEUlhTWUJwOWJjc2l4UWpWZFhCVE1zM1VGX1VnQ1EtN3VfWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Feb 2024 08:00:00 GMT",
        "title": "US SEC May Name Ethereum a Security, Here’s Why - Times Tabloid",
        "content": "In the latest Ethereum news, it appears that the time is now up for the second-largest cryptocurrency which has so far avoided being named a security by regulators. This follows after a Wednesday announcement hinted that Prometheum is planning to launch custodial services for Ether, the Ethereum blockchain’s native coin.\n\nFrom the look of things, Prometheum may have orchestrated the move to force the hands of the US Securities and Exchange Commission (SEC). That is as it pertains to declaring a stance on Ethereum’s legal status, having classified over a dozen other cryptocurrencies as securities.\n\nRead Also: XRP Lawyer Reacts As SEC Confirms Investigating William Hinman\n\nFor what it’s worth, the majority percentage of the crypto industry has been at loggerheads with the SEC for many years. Top crypto firms such as Coinbase and Kraken, for instance, insist that most of the SEC’s rules are outdated. To this end, they have mostly been operating outside the regulatory framework of the agency.\n\nThe agency, on the other hand, has constantly maintained that its rules and regulations are sufficient for the crypto industry. At some point, the agency even filed lawsuits against these same crypto companies.\n\nHowever, the crypto industry was not buying the legal threats as many immediately drew support for Coinbase and others while slandering the SEC’s approach to regulation. They argue that Ether is more like oil or gold — an asset that doesn’t fit the legal definition of a security and so can’t be registered.\n\nPrometheus Backs US SEC\n\nIn all of this, however, it appears that Prometheus may have taken quite the unpopular route. The controversial crypto firm, which was founded by two brothers, Aaron and Benjamin Kaplan, argues that the SEC is well within its rights with the claims that most cryptocurrencies are securities.\n\nTo further prove their point, the Kaplan brothers hint that Prometheum will be able to list different crypto assets as securities under an exemption called Rule 144. This rule, according to the brothers, is normally used to trade restricted stocks.\n\nHowever, the Kaplans believe that by using blockchain data to confirm whether an asset has been in circulation for more than a year, the exemption rule can come into play nicely with ETH. This means that Prometheum may be able to bypass issuers and not work directly with them. That is, ultimately, the firm has the opportunity to choose which assets to list.\n\nAs expected, Prometheum’s submission and SEC-supportive claims have raised curious eyebrows even beyond the crypto industry. Some lawmakers are questioning the authenticity of the firm, which has next to no history to write home about. As a fact, it is being widely pushed that the SEC Chair Gary Gensler may have created the firm to advance his regulatory agenda.\n\nFurther fueling the agenda rumors was a CNBC interview last June. In the interview, Gensler could be seen heaping praise on Prometheum’s exemplary registration. Its registration as a special purpose broker-dealer set a compliance pathway for other firms in the industry to emulate, Gensler noted.\n\nIn the same month, Prometheum was also invited to testify at a crypto congressional hearing. This was despite its seeming inexperience in the industry at the time.\n\nWe are on twitter, follow us to connect with us :- @TimesTabloid1 — TimesTabloid (@TimesTabloid1) July 15, 2023\n\nRead Also: Ripple CTO Asks SEC about the Security Status of Ethereum (ETH) Sales on Exchanges\n\nWhat It Means for The Crypto Industry\n\nBefore now, the constant debate over Prometheum’s proposals has been nothing but theoretical. However, Wednesday’s announcement may have caused a major shift in the outlook of crypto regulation. If Prometheum begins to offer Ether custodial services for institutional clients by late March as announced, that may become the only compliant way to offer assets like Ether for trading.\n\nMeanwhile, Benjamin Kaplan has seized the opportunity to clear the air about the real intentions of the fast-rising firm. He recently disclosed that Prometheum is focused on building the crypto industry, rather than sabotaging it.\n\nFollow us on Twitter, Facebook, Telegram, and Google News"
    }
]