[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE03cjhWaUFSZUpKX2hLZHNFOTNxMlUwM2M2cHhRaTJFc29YZDM0RGRXZEtkVmVHU2J0QUFiRmhSTjJfZkNpQ0NtTVRtNTljUHB2QWlXc3NKUU1wRHVSNXNOWWx4ZEY5YkJD?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "What Is Optimism in Ethereum? - Unchained",
        "content": "Optimism is one of the most popular Ethereum Layer 2 protocols.\n\nDespite Ethereum’s position as the leading smart contract blockchain, it still suffers from scalability issues. This is a challenge for Ethereum as its network supports a growing ecosystem of decentralized applications (dApps) and decentralized finance (DeFi) protocols that require high throughput and low transaction fees to scale. To address Ethereum’s scaling issues, Layer 2 protocols have emerged. Optimism is one of the most popular ones.\n\nIn this guide, we’ll discuss what Optimism is, how it works, and its benefits and drawbacks.\n\nWhat Is Optimism?\n\nOptimism is a layer 2 solution for the Ethereum network that utilizes ‘optimistic rollups,’ a kind of rollup that ‘optimistically’ accepts all transactions in the rollup as valid.\n\nThis process saves time as individual transactions get submitted without proof of their validity. However, validators involved in the rollup have up to a week to question the whole rollup if they have any doubts.\n\nOptimism rolls up multiple transactions into one transaction and settles them on another layer, but with the receipts being relayed back to the Ethereum blockchain. By bundling up transactions, Optimism offers users cheaper transactions and an improved user experience.\n\nOptimism has since grown to become the second-largest Ethereum Layer 2 scaling solution after Arbitrum, with a total value locked of $772 million, according to data on DefiLlama. The Layer 2 solution is also supported by various DeFi platforms such as AAVE, Synthetic, and Uniswap.\n\nHow Does the Ethereum Layer-2 Optimism Work?\n\nThe Optimism Layer 2 solution addresses Ethereum’s scalability issue using optimistic rollup technology. These rollups bundle or consolidate several transactions into one on the Ethereum network, significantly reducing the gas fees required by sharing the cost between the users whose transactions are in the bundle.\n\nTransactions on the Optimism scaling solution are assumed valid by default, mimicking the ‘innocent until proven guilty’ principle. Thus, transactions are processed much faster, improving the user experience.\n\nOptimism has a security system in place for transactions deemed doubtful. This security mechanism provides a one-week window where validators can submit and run a fault proof. This means asset transfers from the Optimism network to the Ethereum blockchain may take up to seven days to complete.\n\nOnce a fault proof is submitted, the transaction in question will go through a verification process against the state on the Ethereum layer. If the fault proof is challenged successfully, it’s removed and reprocessed.\n\nOptimism, designed as a scaling solution for Ethereum, borrows significantly from Ethereum’s architecture. Optimism utilizes the same virtual machine as the Ethereum network and charges gas fees similarly but at a lower rate. Additionally, users can send just about any ERC-20 asset between the two blockchains.\n\nHow to Use Optimism\n\nFor anyone who has used Ethereum before, using Optimism feels the same as using Ethereum.\n\nTo use Optimism, you must deposit either ETH or ERC-20 tokens to the Optimism token bridge. This way, you can process transactions on the Ethereum mainnet through Optimism. You can then change your tokens back to the Ethereum network when done.\n\nYou’ll need to use the Optimism Gateway to deposit your tokens. You can connect to the Optimism Gateway via a Web3 wallet, such as MetaMask or Trust Wallet. The transaction cost quoted will depend on the amount of tokens you want to transfer and deposits happen in minutes.\n\nOptimism will also notify you that you won’t be able to withdraw the funds until after a week. This delay is part of Optimism’s security mechanism. However, once you have successfully deposited your funds on Optimism, you can use them on supported dApps like Uniswap and save on fees. To do this, ensure that your network is set to Optimism.\n\nBenefits and Drawbacks of Optimism As an Ethereum Layer\n\nJust like any technology, Optimism offers both benefits and drawbacks.\n\nPros\n\nScalability: Optimism provides a solution to Ethereum’s scalability problem by using optimistic rollups. This involves moving the computational and status storage off-chain.\n\nCheaper transactions : By bundling the transactions into one, Optimism significantly reduces the gas fees linked with Ethereum transactions while maintaining the trustless nature and security of the blockchain.\n\nEthereum compatibility : Optimism borrows heavily from Ethereum’s architecture, which results in enhanced user experience.\n\nCons\n\nSlow transactions: Optimism has longer withdrawal times due to its security mechanism, which allows validators to raise any concerns they have if they doubt a transaction.\n\nLimited smart contract functionality: Users would still need to rely on Ethereum or other blockchain alternatives if their dApps heavily rely on smart contracts.\n\nSecurity risks: There are some potential security risks as Optimism relies on its fault-proof mechanism to validate transactions.\n\nFinal Words\n\nOptimism offers several benefits for Ethereum transactions, including seamless compatibility with the Ethereum main chain, improved scalability, and reduced fees. But just like with other technologies, Optimism has its drawbacks, including longer withdrawal wait times and limited smart contract capability.\n\nAs Ethereum’s adoption grows, it will be fascinating to witness how Optimism will evolve and transform to meet user needs."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOb1IwT2tfeVB3NklRWC1TaDJpdEJJcjhjcFd5OVBOYXJnS29kSmM3MmtrUkNiNU0zZ0o5UkN0Y0Q2UTlMM3ZlWXZJZ1lIZXh3QTVGc0NEUll5UDFCcndqX1ROczZLeVdhYVlaMDJVYVh5d0xhS3UyS2hjX1lnWk1qdlZmMTZwTXJfam1mbm9vV2dMMHBoYncwdA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 08:00:00 GMT",
        "title": "Ethereum, Solana, and XRP Are Slumping Today. Here's Why. - The Motley Fool",
        "content": "A spot Bitcoin ETF was all but a sure thing -- has that changed?\n\nWell, that rally to end 2023 and into early 2024 had to end at some point.\n\nMany of the top cryptocurrencies in the market are reeling today, as risk assets across the board decline on a variety of headwinds. Ethereum (ETH 0.27%), Solana (SOL -1.54%), and XRP (XRP 1.99%) are among the tokens to watch for crypto investors, having declined 6.7%, 9.2%, and 8.4%, respectively, over the past 24 hours at 3 p.m. ET.\n\nA number of macro forces are driving most long-duration assets lower today. A strengthening U.S. dollar, a decline in long bonds (and corresponding surge in yields), and a widespread rotation to more defensive assets has plagued more speculative asset classes such as crypto over the past 24 to 48 hours.\n\nAdditionally, these three tokens have their own set of headwinds investors appear to be pricing in today. Let's dive into what's driving this move in these three top-10 digital assets right now.\n\nI thought this was a crypto bull market -- what gives?\n\nA good portion of the recent rise in crypto assets over the past few months can be attributed to expectations about a spot Bitcoin exchange-traded fund (ETF) approval. Expected by Jan. 10, such an ETF could pave the way for similar products for Ethereum (given there are proposals already underway) and potentially other major tokens such as Solana and XRP to follow.\n\nAccordingly, a narrative shift among many in the crypto market over the past day or so is wreaking havoc on investors relying on this catalyst. Some analysts and experts, such as Matrixport's Markus Thielen, believe that an ultimate approval for a spot Bitcoin ETF may still be a \"long shot.\"\n\nThis view appears to be spreading, with an increase in bearish bets on top cryptocurrencies driving some of the accelerated downside move today. Additionally, nearly $100 million in bullish perpetual contracts placed on Ethereum have been liquidated over the past 24 hours, as per Coinglass. XRP and Solana are also among the top five crypto tokens in terms of long liquidations today, suggesting leveraged upside bets on these tokens are turning sour.\n\nFundamentals weakening\n\nIn addition to the leveraged derivatives market, another key fundamental factor many investors consider when gauging the health of the crypto market over a specific time frame is total value locked (TVL). TVL generally reflects the amount of capital existing within specific crypto ecosystems. When times are good, capital flows into the crypto sector, and this number rises.\n\nUnfortunately, since the beginning of the year, the total TVL for all crypto projects has dropped 5.8% to $52.49 billion. Ethereum, Solana, and XRP saw similar declines in their TVL values, though these three projects have still seen their cumulative TVL numbers rally nicely off of last year's lows.\n\nWhile many still expect that a spot Bitcoin ETF could be approved in short order (partly due to various meetings between Wall Street companies and the SEC in recent days), investors and users appear to be taking a cautious approach with their capital right now.\n\nBottom line\n\nOverall, the crypto sector, and many of its top tokens, appear to be feeling the effects of uncertainty today. At the end of the day, investing is about assessing probabilities. And up until a couple of days ago, the market seemed to be pretty certain that spot ETFs are coming in short order, leading to risk-on trades across this sector in projects that may follow Bitcoin's lead.\n\nThe expected decision date is now about a week away. Until then, I expect more volatility on the horizon, as additional leaks filter into the overall narrative for this sector."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOa0dFRnBCdVltbW9ZQWFmWFhaWnR1MFpLcnpSYzQzcmxLQ1d5WEk5VWIwalRIWmszYmZXS1RpRG91TWpOSjNqUVJMd0pyQmFBbUZqUVl4MVdLNDFnZEp3WmxaaEYzeGt1N0xnRGRpZ2Vjc2RaWHo2NG1ra1hHMHpCTlc2RHFkTVFpWUFHN0VCZVZ0WTZxN2NvdDhRbWlzR1IwajRGMjI4STRHcy1memN3cmhTMlVKMkHSAbwBQVVfeXFMTzJlMWVuTWVjcXNRMUJDZVBDaDVoNDMwbElxQVU0Q1NsSVJOc0F3NjJ6X3gyeTl2Uk9GMm04cVVOY25jdmlzZTZGZzZWZHRxVWVtRG5XbURjeGltX1FDN0RIX0pvZlkzRUJsYzlxR1ZEaXNEQ3dZUjZseDFTQk5PMHFOUDNTbkVFNDQ5TC04QXNnYngwdzZKNlhYZUJKeG9OMGpBRFZCQnloZXFnbkdXMUdXdnBScE4wRWlhb2U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 08:00:00 GMT",
        "title": "Ethereum-Based Altcoin Explodes As Vitalik Buterin Says Project Is ‘Super Important’ - The Daily Hodl",
        "content": "An Ethereum (ETH)-based altcoin is exploding in value after ETH founder Vitalik Buterin said the project is vital to the crypto ecosystem.\n\nButerin tells his five million followers on the social media platform X that all layer-2 (L2) projects should integrate with Ethereum Name Service (ENS), a platform that lets users buy a “domain name” on the Ethereum blockchain rather than using default addresses.\n\nThe domain names on ENS can be used to transfer and receive funds instead of using alphanumeric wallet addresses.\n\nSays Buterin,\n\n“All L2s should be working on (trustless, merkle-proof-based) CCIP resolvers, so that we can have ENS subdomains registerable, updateable and readable directly on L2s. ENS is super-important, it needs to be affordable!”\n\nAccording to data from blockchain data platform Dune Analytics, there are about 2.14 million active ENS names and more than 801,000 unique participants.\n\nLayer-2s, such as Optimism (OP) or Arbitrum (ARB), are built on top of Ethereum to improve scalability and costs.\n\nCCIP, or cross-chain interoperability protocol, is a protocol that allows for the resolution of information on or off-chain from the Ethereum Virtual Machine (EVM).\n\nIn the past 24 hours, ENS was trading at a low of $8.88. After Buterin’s social media post, ENS soared to $14.20, a nearly 60% gain. ENS has since given up some of those gains and is trading for $12.82 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/klyaksun/monkographic"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPWHlobGprQ1ZLVjZWbC1PWjRxZzVtc0FXdXZmN0cyaG5yd0xOcktGN2JCWGExek1QeFYzUnpnQVk0Q3RlQ05leDNySmJ2bTNFc1dLMDAtWGY2Q1d3MjdwWHlBUk50NWh3dVM2Z1pDQzRIUWFRWFFBY0hfaVU0M0RzSGIxN1FsbTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 08:00:00 GMT",
        "title": "Solana NFT Sales Overtake Ethereum for the First Time Ever in December - Yahoo Finance",
        "content": "Solana NFT Sales Overtake Ethereum for the First Time Ever in December\n\nSolana's NFT sales volume surpassed that of Ethereum in December 2023, marking the first time this has occurred. According to data from CryptoSlam, Solana's NFT sales reached approximately $366.5 million, while Ethereum's sales totaled $353.2 million.\n\nWhen excluding wash trades, Solana's sales remained strong at $366.5 million, nearly matching its all-time high of $373.5 million set in October 2021. In contrast, Ethereum's sales were relatively flat, with December's total being comparable to November's $350 million.\n\nFurthermore, Solana saw an increased number of unique traders, with around 218,000 unique sellers and 279,000 buyers. That is nearly double the number of unique traders compared to Ethereum.\n\nThe surge in Solana's NFT sales may be attributed to the significant rise in the value of its native token, SOL, which has more than quadrupled in price over the past three months. This has also led to the resurgence of the Solana ecosystem, coupled with a memecoin frenzy led by Bonk (BONK).\n\nThe influx of users and transactions on Solana may be driven by broader momentum around the network and the hype surrounding specific projects offering potential airdrops and other perks. Projects like Tensorians and Mad Lads generated substantial trading volume in December, contributing to Solana's overall success.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPRXd6VXJtc1puZV94NU9sUk5oaEg2R3Q3dmVETmtlLWxaN2Uycm5OYzJoODJxYXZBYmtfc1N0SFhvcWNnUXZ6alB3U3BIeE1yTnp1V0UzTk9XTHFsNk5jX1RyR1lKbE5Za2NLalpwcEtTUG9zOU9QT1ZCRWdMb01XSjU5SFV2MUdtTU5WMERZX21VZi1fVnVBSXBmRnlNdzdHVXdtSHpGQlphR2fSAbABQVVfeXFMTmlLcVhHSDM1cWstcENEYzVVUFRwMkRiU0tpeEhiaVQwYjNhSkRETHd2djRQUnIxRE80SGRiQWJ4Q2pHbE1CdlpoVjBvWmFKSkhadFdDU0VEVHFxeUpoNXNFUzdKMkpXNFU4SGk2S1FBYlN5VWdESzN5RndiREd5UmVDUTJFRzBoZUh6UnJuTndWWEc5dWxYWjVHOHAzN3Z3LXJGRm5TUE1lUEJmRVhPZUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 08:00:00 GMT",
        "title": "Arbitrum One Becomes the First Ethereum Layer 2 Network to Surpass $10 Billion TVL - CryptoPotato",
        "content": "Arbitrum One’s Total Value Locked (TVL) witnessed a remarkable increase of 15.9%, reaching a milestone of $10.22 billion in the past seven days, making it the first Layer 2 (L2) network to surpass the $10 billion TVL mark.\n\nThe achievement follows an incident on December 15, where Arbitrum One faced a two-hour partial outage due to a surge of Bitcoin Ordinals-inspired inscriptions that led to the triggering of a sequencer stop.\n\nArbitrum One Dominates Ethereum Layer 2 TVL\n\nAccording to data by L2Beat, the total TVL for Ethereum Layer 2 networks has reached $20.82 billion, with Arbitrum One contributing significantly by accounting for 48.03% of the total.\n\nArbitrum currently holds a diversified asset portfolio with 30.9% in Ethereum (ETH), 23.68% in its native governance token ARB, 29.66% allocated to stablecoins, and the remaining 15.76% spread across various other assets. Notably, the ARB token has registered a 14.3% increase in value over the past 24 hours, according to Coingecko data.\n\nThe success of Arbitrum One can be attributed to its ability to replicate the Ethereum experience while offering substantially lower transaction costs. This cost-effectiveness has attracted a considerable number of decentralized applications (dApps), with approximately 470 currently deployed on the network.\n\nThe implementation of the ARB token, serving as a governance token, has significantly contributed to the platform’s growth. Governance tokens empower holders to actively participate in decision-making processes concerning the platform’s development and policies, thereby incentivizing greater user engagement within the ecosystem.\n\nFurthermore, the Arbitrum One network boasts a well-established Security Council, a deployed and operational proof system, and accepts fraud proofs from a minimum of five external actors. Moreover, the platform offers a 7-day exit window without relying on a permissioned operator in the event of an unpopular upgrade by actors with more centralization than a security council.\n\nArbitrum One on Upward Trajectory After Outage\n\nArbitrum One faced downtime on December 15, which was categorized as a “major outage” on the dashboard. An investigation was initiated to identify the root cause and implement a fix.\n\nBefore the interruption, Arbitrum’s layer-2 network had processed over 22.29 million transactions, as reported by l2beat, and boasted a total value locked of $2.3 billion, according to DefiLlama data.\n\nThe incident on December 15 was not the first time Arbitrum faced disruptions. In June 2023, the DeFi Layer 2 network experienced a standstill for over an hour due to a bug in its sequencer. The bug caused the sequencer to revert batches on-chain, leading to the depletion of Ether (ETH) from the sequencer. Developers intervened by manually replenishing the sequencer, addressing the bug, and restoring normalcy to the Layer 2 network."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE53Um9Xcm9yTXpocU9jRW9XeEJ5cmRRSGlYeWtqV2cxVVhDSXJxcnY0NXhrcnNnMnpzeExSeERhVDVEcXNpb1ZsRWlVNHlBU0tDSjRZSDZJTHQ1Unk0R0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 08:00:00 GMT",
        "title": "Etherscan buys Solana block explorer Solscan - Blockworks",
        "content": "The top two smart contract platforms by trading volume — Ethereum and Solana — will soon share a common infrastructure provider.\n\nEtherscan, the leading blockchain explorer for Ethereum that was founded in 2015, announced its acquisition of Solscan in what’s described as a “collaborative merging.”\n\nSolscan, founded in 2021, called the deal “a positive step forward for both platforms.”\n\nAccording to a statement from Etherscan, the merged teams will continue to focus on providing “credibly neutral and equitable access to blockchain data.”\n\nLoading Tweet..\n\n“The Solscan team has proven their expertise over the years by offering detailed insights and analytics,” Matthew Tan, CEO of Etherscan said. “Their expertise in making blockchain data accessible and user-friendly also aligns perfectly with our mission at Etherscan.”\n\nCredible neutrality is a major focus within Ethereum circles, as the developer community endeavors to design protocols and mechanisms that are impartial and fair, minimizing arbitrary or biased interventions.\n\nBlockchain explorers are vital tools in the cryptocurrency ecosystem. They allow users to search and analyze blockchains transactions, smart contracts and addresses. These platforms are crucial for transparency and accountability in the blockchain space, enabling both casual users and professionals to verify transactions and track the movement of digital assets.\n\nThe merged entity could address the growing need for cross-chain tracking and analysis tools. By pooling their resources and expertise, Etherscan and Solscan will be better equipped to innovate and expand their existing services.\n\nRead more: Etherscan Advanced Filter Feature Helps On-chain Sleuths\n\nConsolidation is often seen as a sign of a maturing industry, and can lead to more efficient and comprehensive services. Etherscan is considered the flagship block explorer for Ethereum, widely recognized and extensively used by the community due to its comprehensive feature set.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPSnpLdUpjQ21xM2RiUkE2d3JGenVUU2JGMnJLeDlHQWtXXzJPX0J6cVJpc0ctTnNhTk1rLXVyNWk3SnZlT056OTA3bzk3aEFQWUhTdWY3LXZKU3B0MzkyUDdwbXJTMUEzUlBMbXYtMGJfaGpGU1RaOGlsbG04dk1nZkotSdIBiAFBVV95cUxNOUVDOEdFaW11d2ZzQ2lvUEdZYUp6eFptRmxVak9rWmhrcVY3bUVqT0FqQktvWER3Rm9BZU1VSXlUVFhhOUhhQ3VLQUZIdkNtSEhRamVQSUJfZXpmeENGdEcxTFFIaHFsZjBuMTF2NHYybzlRR1lqbmtvSDV6bzlOcWFKZVJlam03?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 08:00:00 GMT",
        "title": "Why are cryptos like Bitcoin, Ethereum and XRP crashing? - AMBCrypto News",
        "content": "Bitcoin collapsed to $42,500, triggering a widespread market crash.\n\nThe 1-hour volume increased while many long positions were wiped out.\n\nThe enthusiasm about a Bitcoin [BTC] bull run in 2024 has faced a setback as the price fell by 4.85% in the last hour at press time.\n\nAccording to CoinMarketCap, BTC started the 3rd of January above $44,000 with many predicting that the coin would hit $50,0000 before the month ends.\n\nHowever, all that may have been put to rest at the moment as BTC’s press time price was a little above $42,500. Furthermore, Bitcoin was not the only cryptocurrency affected.\n\nSolana [SOL] fell by 7% within the hour while XRP plunged by 12%. Ethereum [ETH] also joined in with a 5.30% plunge.\n\nBitcoin ETFs to be delayed?\n\nAt press time, AMBCrypto found that right before the dump Matrixport reported the U.S. SEC would not approve any Bitcoin ETFs this month.\n\nThe news sent panic waves around the market. Also, Economist and trader Alex Kruger noted earlier that a crash was coming.\n\nFurthermore, Bitcoin’s trading volume surged as a result. At press time, BTC volume surpassed $40 billion. This was proof of high selling pressure. Liquidations have also affected traders, especially longs.\n\nAccording to Coinglass, the Liquidation HeatMap showed that over $500 million had been wiped out. Bitcoin took a large part of the hit with $72.13 million.\n\nDetails from the HeatMap also showed that longs were the most affected."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNekNkdFNLRlFqdk1TclJtVlo0cTA1d09YZkdwQ29udEJJbWlBOUpaUy1ZbksxOUpuVnZXeG5GMUtveWZqcVVmVHdQS0ZUcnFMd3h1U05HTVZSaVRldF9TSWtvWXRia1M1UmRZT1FEaHA0ak5Nb2Q2Z0s4N2pDOWR1bGtvcW8wQ21fZFFEdk1WemlwYWY2N01nMnI3engyNmNublcyYVgyaG02S3RXZmJSX0lfeXhNeG0xY09Nd2dYNVdQUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 08:00:00 GMT",
        "title": "Ethereum explorer Etherscan expands to Solana, acquires Solscan to serve 'credibly neutral' on-chain data - Crypto Briefing",
        "content": "Etherscan claims that the broader goal of the acquisition is to \"make on-chain data easy to access, driving mainstream blockchain adoption.\"\n\nShare this article\n\nEtherscan, a prominent blockchain data provider, has acquired Solscan, a leading explorer for Solana, to expand its data services by integrating the two platforms. Etherscan announced details of the acquisition on X, saying that it hopes to continue providing “credibly neutral and equitable access to blockchain data.”\n\n📢 We're excited to share that Solscan has now joined Etherscan! With the addition of @solscanofficial to the team, we hope to continue executing on our vision of providing credibly neutral and equitable access to blockchain data. pic.twitter.com/N8TcxQHFLi — Etherscan (@etherscan) January 3, 2024\n\nAccording to Etherscan, the integration aims to improve access and experience for the over 3 million monthly Solscan users by leveraging synergies in features and capabilities between the Ethereum and Solana explorers.\n\nEtherscan explores Ethereum data including wallet transactions and token details, offering insights into individual wallets and tokens. Solscan is a blockchain explorer specifically for Solana, featuring comprehensive analytics and user-friendly access to transactions, addresses, contracts, blocks, and tokens. Though these features are not mutually exclusive and can be found in both, Solscan has a simpler interface and provides more intuitive visualizations.\n\nIt’s worth noting that through this acquisition, Solscan will likely be included in Etherscan’s suite of products for its Explorer-as-a-Service (EaaS) offering, which includes explorers for major chains like Optimism, Arbitrum, Polygon, Linea, Scroll, and Base, among others.\n\n“The Solscan team has proven their expertise over the years by offering detailed insights and analytics. Their expertise in making blockchain data accessible and user-friendly also aligns perfectly with our mission at Etherscan,” shares Matthew Tan, CEO and founder of Etherscan.\n\nEtherscan claims that the broader goal of the acquisition is to “make on-chain data easy to access, driving mainstream blockchain adoption.”\n\nBlockchain explorers serve a vital purpose — they allow anyone to easily monitor activity on public ledgers. Services like Etherscan and Solscan help decode dense on-chain data into readable insight, helping contextualize information on transactions, tokens, NFTs, addresses, and more.\n\nThe acquisition can be seen as a response to demand for on-chain data as Solana‘s native cryptocurrency, SOL, experienced a sharp surge in 2023. Etherscan has not provided public information on the acquisition’s price and terms.\n\nData from CoinGecko indicates that SOL ranks as the fifth largest cryptocurrency by market cap ($47 billion), with its spot price trading at $110, down 3.4% in the past 24-hour cycle. Using the same indicators and cycle, Ethereum’s ether (ETH) has a market cap of $283.8 billion, with the token trading at $2,360, down by -1.1%."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQTVAwbzEtbURLWGVXbkdxN2pPRVFqWE1tRDB5M1U5el9DVXpTNjdoTVdwOVk4SVFwZ2RxYzhScGxmVXRJMUJhWW02N1lfNHV0Z0I3Q0xTUnQ1MjN2b1hqM0IyTmh0c3lOOXM2TzRGMV9LcFl0WEtWYjRBVm1lcVhLT9IBhgFBVV95cUxNRkRzSTN4RzRIeGttWHo0LVRNU2YyZ2cxeG5HSVJZbm83T21GdThXaUVwWGtnU2dEWjQzUlNma2w2T0wxZXc3MGhsY3ZhaUxHNmFHaWdLMm1pU0p3YmpsQmVKd0JuUHQ1UUs4bVB0QXBHRVFTWEswQk1DTnVrbnExYUg4YU8wZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum L2s Surpassed All Other Blockchains by TVL: Details - U.Today",
        "content": "Advertisement\n\nEthereum Foundation contributor Josh Stark noticed a major achievement for Ethereum-based ecosystem of second-layer networks. In 2021, 20% of his followers were sure that this \"flippening\" would never happen.\n\nEthereum (ETH) L2s accomplished historic milestone\n\nIn the first days of 2024, the aggregated sum of value locked in Ethereum-based L2 protocols exceeded that of all non-Ethereum blockchains. While Ethereum L2s are responsible for $20.7 billion in equivalent, the rest of blockchains amassed $19.6 billion, as noticed by Stark today, Jan. 4, 2024.\n\nit happened 🎉\n\n\n\n- Ethereum L2s = $20.7 billion\n\n- Other L1s = $19.67 billionhttps://t.co/o38jqwnHJC pic.twitter.com/uqWAqWkJUC — Josh Stark (@0xstark) January 4, 2024\n\nMeanwhile, he stressed that the metrics cannot be treated as exactly similar: For second-layer networks, the indicator refers to the sum of assets on L2, including native tokens. For L1s, the metrics reflect the sum of assets locked in dApps on this or that blockchain.\n\nAdvertisement\n\nThe analyst used L2Beat's data for tracking second-layer blockchains and DefiLlama to analyze what is happening on non-Ethereum L1s.\n\nIt is interesting that back in September 2021, he asked his audience about the date of this \"L2-over-L1\" flippening. While the majority of his followers were sure that this fact could take place in 2022, 20% answered that it would never happen.\n\nThe L2s ecosystem was 20 times smaller than the L1s one, as of the date of the first voting. During the crypto winter, this gap became even more dramatic; its peak was reached amid the Terra/Luna collapse in Q1, 2022.\n\nArbitrum (ARB) dominance inches closer to 50% again\n\nAs demonstrated by L2Beat, the ecosystem of Ethereum's L2s registered an all-time high in TVL on Jan. 2, 2024. The metric jumped above $20.78 billion in equivalent, adding over 330% in just one year.\n\nThe L2s scene remains heavily \"concentrated\": Only five networks — Arbitrum (ARB), OP Mainnet (Optimism, OP), Base, Metis Andromeda and Manta Pacific — are responsible for over 90% of its TVL.\n\nArbitrum (ARB), the largest Ethereum-based L1, is rebuilding its dominance after a small decline. As of printing time, it is one step away from the 50% barrier.\n\nFor the closest competitor, OP Mainnet, this indicator equals 28.65%, L2Beat data says."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTE1COXhFSGlaQnRWVXBaaWN2Y20wdXVnaVhkLTBzSld6TDV2OHRqdVJaZDlSc3NwbjJGUGd1TTd5NXJiWTFQN211VWlUSmxVZm45V0Vxcm01ZUstNmPSAWBBVV95cUxPQWFpaWNrZ2RtRklTMmY3SmFYQlp1Y2g1TFdraTVaQ0NHaExIRHZ0SG5IbFNPOWdZUGVEQm5HdFgyUmxCWTdhME1wRXR0M0pBZFNWeXFYMFpNRzBvYzNRZ3o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 08:00:00 GMT",
        "title": "Solana NFTs Overtake Ethereum Assets in a Historic First - NFT Plazas",
        "content": "Solana NFTs Overtake Ethereum Assets in a Historic First\n\nIn a landmark achievement for the NFT market, Solana NFTs surpassed a major threshold, overtaking Ethereum in monthly sales volume for the first time ever.\n\nAs per CryptoSlam, Solana NFT sales skyrocketed to approximately $366.5 million, overtaking Ethereum’s $353.2 million in December 2023. Excluding suspicious activities such as “wash trading”, this data underscores Solana’s escalating influence in the NFT market.\n\nA notable rise in user engagement on the platform is evident, marked by an increase in both sellers and buyers. Sales volume nearly hit a record-breaking level, closely matching its all-time high during the bull run in October 2021.\n\nComparative Dynamics and Emerging Trends\n\nIn December, Ethereum’s NFT sales remained stable, while Solana experienced a dramatic increase from its performance the previous month.\n\nA surge in Solana’s price is credited to this upswing. As are the projects of Tensorians and Mad Lads. Meanwhile, Ethereum’s flagship NFT collections, such as Bored Apes and Pudgy Penguins, continue to bolster the blockchain’s sales statistics. And let’s not forget Bitcoin Ordinals’ rise, remarkably generating more trading volume than both Ethereum and Solana combined.\n\nStill, Solana’s landmark achievement — surpassing Ethereum in NFT sales volume for the world’s first time — signifies a pivotal moment in the evolution of Solana NFTs.\n\nWant more? Connect with NFT Plazas\n\nJoin the Weekly Newsletter\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE5Oa1ZkT2FpeXBIanRobGR6NjFRcXZsbUhvRUEybW9OQm00eVRHOC1rT3dyWVJkLVBmTUl6NlNiVkNRVzdVc3FpN3lHTmVPVXdUbkVkZVZMMkNDUXJTUVotd0pR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 08:00:00 GMT",
        "title": "ERC-20 Token Standard Explained - LCX",
        "content": "What Is the ERC-20 Standard?\n\nERC-20 is a technical standard used on the Ethereum Blockchain for smart contracts. It is an acronym for “Ethereum Request for Comment 20” and was proposed in 2015 by Fabian Vogelsteller. Developers can establish their own tokens on this blockchain by adhering to the ERC-20 standard. This standard facilitates the creation and deployment of tokens by providing a common set of interfaces and functions that can be used by various token contracts. This implies that ERC-20 tokens are interoperable and can be traded on Ethereum-based decentralized exchanges (DEXs).\n\nThe Ethereum Blockchain is a decentralized platform that enables developers to construct and deploy decentralized applications (dApps), smart contracts, and digital tokens. Developers must adhere to the ERC-20 standard in order to establish their own digital tokens on the Ethereum Blockchain. These tokens represent numerous assets, including utility tokens, security tokens, and stablecoins. ERC-20 tokens are fungible, meaning that they can be exchanged for other tokens of the same type and value. For instance, a single ERC-20 token for a specific project has the same value as any other token of that project. This is due to the fact that all ERC-20 tokens share the same properties, such as a name, symbol, and decimals, as well as functions, such as transferring tokens between addresses and verifying an address’s balance.\n\nERC-20 tokens can represent any type of asset, including utility tokens, security tokens, and stablecoins such as Tether (USDT) or USD Coin (USDC). They can be used for fundraising for a new project, creating a loyalty programme for a business, or granting access to a specific service or product.\n\nThe ERC-20 standard specifies six required and three optional functions that developers must include in their smart contract code in order to generate an ERC-20 token. These functions include:\n\nTotalSupply: This function returns the entire number of tokens that have been generated for a specific project.\n\nBalanceOf: This function returns the token balance held by a specified address.\n\nTransfer: This function enables an address to transmit tokens to another address.\n\nApprove: With this function, an address can authorize another address to spend tokens on its behalf.\n\nTransferFrom: This function enables an address to receive tokens from another address that has granted permission for the transfer.\n\nAllowance: This function returns the number of tokens an authorized address is permitted to spend on behalf of another address.\n\nThe three optional functions that developers can add to the contract code for ERC-20 tokens are:\n\nName: The function returns the token’s name.\n\nSymbol: This function returns the token’s emblem (typically a few letters or characters representing the token).\n\nDecimals: This function returns the number of decimal digits that the token can be divided into.\n\nIn addition to the six required and three optional functions, developers can add additional functions and features to ERC-20 token contracts. Time-based restrictions on token transfers or special incentive structures for early adopters are examples of additional features.\n\nNotably, while ERC-20 has become the most prominent standard for creating tokens on Ethereum, there are other token standards, such as ERC-721 and ERC-1155. Each of these standards has its own distinct characteristics and use cases, but ERC-20 remains the most popular and widely adopted standard.\n\nNotably, ERC-20 tokens require the Ethereum network in order to function. When you send an ERC-20 token from one address to another, you will be required to pay a small quantity of ETH (in the form of gas fees) to cover the cost of processing the transaction on the network.\n\nHow Does ERC20 Work?\n\nERC20 is a standard protocol, not a piece of software or a program. The ERC20 protocol governs the creation of new tokens, ensuring that they conform to the necessary technical requirements. If a token does not adhere to the technical specifications specified by ERC20, it will not meet the definition of an ERC20 token and will not be issued on the network.\n\nIt may be useful to compare ERC20 to HTTP, the Hypertext Transfer Protocol used by websites. HTTP specifies how internet messages are formatted and transmitted, as well as how servers and web browsers should respond to various commands.\n\nSimilarly, ERC20 specifies the essential characteristics and functionality of tokens based on Ethereum. Uncompliant tokens cannot be issued, transferred, or listed on exchanges.\n\nThe ERC20 Standard\n\nTo utilise ERC20 tokens, smart contracts must adhere to the applicable ERC standards. Currently, there are nine laws, and six of them are mandatory. The remaining three are optional. These consist of:\n\nMandatory Rules Optional Rules Allowance Token Name Approve Decimal (MAX:18) TransferFrom Symbol Transfer BalanceOf TotalSupply\n\nThese principles must be incorporated into a token’s code for it to qualify as ERC20. Without explicit instructions for these rules or standards, the token would not be able to interact with smart contracts effectively, which could result in a variety of problems.\n\nConclusion\n\nThe ERC-20 token standard has played a pivotal role in the evolution of blockchain technology and the Ethereum ecosystem. Its simplicity, interoperability, and flexibility have enabled the creation of diverse tokens that power a wide array of decentralized applications. As the blockchain space continues to grow and evolve, the ERC-20 standard will remain a fundamental building block, and its influence will extend beyond this network into other blockchain networks. Understanding ERC-20 tokens is crucial for anyone interested in the world of blockchain and cryptocurrency, as they continue to shape the future of finance, gaming, and digital asset ownership."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPRFV1RVN1bk9yN21Sa042bktEYjBXMk9DLTFGa3hCai1aMUN5cG9NOUMxRjVXNnEwNjF6bWRyQVMzZ3lQSkcxS3FtRGYwdWxmQ3BoWlJheWFFVWx5RjY1cTlISmZ6LUhuT001NTFnZWlSLXoxZzUyS0xxc1ZvaEprclJxWEJTNWdrb0dBekxzTHpiMWp2RXhwMQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Upland adds Ethereum as a payment option with Metamask Integration - Block Telegraph",
        "content": "Upland, the mobile gaming metaverse, adds Ethereum as a payment option with Metamask Integration\n\nUpland, one of the most popular metaverse platforms, has announced a new integration with Metamask that allows support for Ethereum payments for its digital assets within the platform.\n\nThis strategic integration represents a further commitment to adoption with enhanced investment in features and functionality that help onboard the next generation of users. Behind all that is Dirk Lueth, Co-Founder of Upland, who is also Chairperson of OMA3, the Open Metaverse Alliance. He understands the need for collaboration, seamless user onboarding and the challenges facing the metaverse as a whole.\n\nhttps://x.com/UplandMe/status/1742304764933615850?s=20\n\nGaming sector continues to drive adoption\n\nAfter a stream of interesting posts from Upland on platform X users are beginning to understand the adoption rate of the platform. In 2023, over 1.5 million NFTs were minted and there were over 227 million total transactions. Despite the bear market, Upland has capitalized on the gaming sector by launching highly engaging features, easy onboarding and being a mobile-driven application.\n\nThe Open Metaverse is on the right track\n\nLaunched in 2020, Upland has transitioned from a property trading game to become a driving force in the development of the world’s most expansive digital economy. Merging the thrill of playing with digital assets with the potential of blockchain, Upland offers a diverse metaverse experience, featuring everything from virtual cafes, car racing, self-expression via wearables and customization options for world-building to strategic partnerships with global entities like FIFA.\n\nAs a key participant in the Open Metaverse Alliance, Upland champions open standards, facilitating seamless asset portability and data transfers between different metaverses. With a commitment to innovation, the team stands at the forefront of shaping the future of the metaverse.\n\nMetamask continues expansion of payment and wallet features\n\nThis follows a series of announcements by Metamask to improve user experience of the application in the third quarter of last year. One significant release was a feature called Metamask Snaps, allowing users to choose from a wide range of dApps or add-ons for their Metamask browser extension. This adds to their commitment to permissionless technology. The fact that developers maintain ownership over the creations and their code is a significant feature of Web3. It offers more user centric control and is a departure from traditional app store processes.\n\nTowards the end of last year Metamask announced a Stripe integration to expand crypto on-ramp options. As one of the most popular Ethereum and alt-coin wallets servicing over 30 million users, this was a major feature update."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPSGhGeGYxUHowRFZ0b1ZQaXN3bHB0SXFZM21UWC1Ma2lfb1YyUjNWTzZQN01OWW9SMEthUWp4eE1BZ0E2R29hanhneE12TzZKdmo3TTZJZmhMQU9VY2N4Uy1OaVZsdXVOLVVlZFQ2MHRqNEM4MmwtYVhBTXcyZ0NJQ1BydXBRUkNHYU5NX3h30gGTAUFVX3lxTE1kVmJMbUNiZlZqVXFZdjBWbk9iaVFHZ05RV3k0MG5zX2t3TWdNQmRWRW1Hdms3X1RQV2RTZF9vb19yVzZlbW9UVE1oZlVUWXY4bUx0bDV1ZV84ckoxTFhINXRDQkpLSUc2QXd3Z25yMkxLM1Q1T3haMHhweWgwYkNXUFhlcGJOdmNMamhtblVRckh6NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction Signals 20% Downside Risk As 60-Day Support Falls - CoinGape",
        "content": "Ethereum Price Prediction: Ethereum (ETH), the world’s second-largest cryptocurrency, has been experiencing a lateral trading pattern for over a month, fluctuating between two key levels at $2400 and $2137. The appearance of daily candles with rejection wicks at both ends signifies a prevailing uncertainty among investors. Recently, a sharp market downturn, partly attributed to speculated rejections of spot Bitcoin ETFs by the US SEC as reported by Matrixport, a digital asset financial services firm, resulted in a notable 6.5% drop in the ETH price. This decline led to the breach of a crucial support trendline, hinting at the risk of further corrections.\n\nIs Ethereum Headed for a Steeper Slide?\n\nA bearish breakdown below the support trendline hints at an early upcoming correction.\n\nA healthy retracement in ETH price should bolter buyers to revive exhausted bullish momentum,\n\nThe intraday trading volume in Ether is $19.3 Billion, indicating a 53% gain.\n\nOver the past eight weeks, the Ethereum price has shown signs of recovery, evident from an ascending trendline on the daily chart. This trendline has historically served as a strategic buying point for investors during market dips, indicative of a robust recovery.\n\nadvertisement\n\nHowever, during the current period of consolidation, Ether has been facing substantial resistance at the $2400 mark. The recent downturn, coinciding with the broader market sell-off, pushed the price below both the 23.6% Fibonacci retracement level and the established support trendline.\n\nIf the daily candlestick closes beneath this critical threshold, it could pave the way for sellers to exert additional downward pressure, potentially triggering a further 20% price decline, bringing the ETH price down to approximately $1750.\n\nEthereum Long-Term Holder Ratio Surpasses Bitcoin\n\nWhile current short-term trends suggest a cautious or downward trajectory for the Ethereum price, an analysis of the “Holder Ratio” chart presents a promising outlook for the cryptocurrency. In a retrospective of 2023, on-chain data from Intotheblock showcased on the X-platform, revealed that the proportion of long-term Ethereum holders exceeded that of Bitcoin for the second time. This vital statistic underscores a growing trend of Ethereum investors committing to hold their assets for extended periods, outpacing similar commitments among Bitcoin investors. This increase in long-term holding is significant as it reflects deepening confidence in Ethereum’s prospects and stability\n\nRelative Strength Index (RSI): The daily RSI slope drops below the midline reflecting the sellers are strengthening their group over\n\nExponential Moving Average (EMA): The ETH price above daily EMAs(50, 100, and 200) hints the broader market is strongly bullish.\n\nRelated Articles:\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE4zekgwVTkwb1hHREhUZFU5elV0WEwwT0xoSkhLek42cTIxQlRPWVMteWdEaHlqR3Vhdi1meXJ4bjVXVmphdUk2dGFDVFZrT1BOa3NST0VuQ0F6VjE1TWR2eEliMmtSRXBXUjNqbDF0bGd3Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction For 2024 - Watcher Guru",
        "content": "Ethereum (ETH), the world’s second-biggest cryptocurrency in terms of market cap started 2024 on the front foot. ETH is up for three consecutive days and is currently hovering around the $2,376 mark. The leading altcoin is gearing up for a breakout and another leg-up could take it to the $2,500 level.\n\nAlso Read: 25 New Countries Ready To Join BRICS in 2024\n\nWhile 2024 started positively for Bitcoin and the larger cryptocurrency market, will the momentum hold strong throughout the year? In this article, we will highlight how high Ethereum could trade in the indices this year in 2024.\n\nEthereum: How High Could ETH Trade In 2024?\n\nSource: CNN\n\nLeading on-chain metrics and price prediction firm Changelly has painted a rosy picture for Ethereum in 2024. The forecast estimates that ETH might sustainably scale up in the indices in the next 12 months.\n\nAlso Read: 5 U.S. Sectors To Be Affected If BRICS Ditches the Dollar For Trade\n\nAccording to the price prediction, ETH could reach a new yearly high of $3,988 in 2024. That’s an uptick and return on investment of about 65% from its current price of $2,376. Therefore, an investment of $10,000 today could turn into $16,500 if the prediction becomes accurate.\n\nSource: Changelly\n\nThe positive prediction has taken into consideration the upcoming Bitcoin ETH, which could soon be approved by the SEC. However, if the Bitcoin ETF fails to make a debut, then the prices of BTC and ETH could head south.\n\nAlso Read: Shiba Inu, Bitcoin & Ethereum: 3 Boldest Price Predictions For 2024\n\nMost importantly, the cryptocurrency markets are subjected to extreme volatility and cuts both ways delivering losses to investors. There is no guarantee that ETH could rise 65% and reach $3,988 this year in 2024. It is advised to do thorough research before taking an entry position into ETH at the moment.\n\nAt press time, Ethereum was trading at $2,376 and is up close to 0.5% in the 24-hours day trade. ETH is down nearly 51% from its all-time high of $4,878, which it reached in November 2021."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQeVIwMnU2ZU9HaF9uSUFyalQwSUw2eHRZdlpPdTdhWUl1Yk5ZSkNtRjF5NW1yWU13NDhRX3pObTdfVmRNZ3QwVFZHY2p4N2REaEhReXhxc1FRXzF2OHBBdjJkZlZnNUl0bjZKOGpMYUtIRHF3R0w4YkZkeTF4S3QydHlKNmNrQUJsMDkzMmpUSG4wZ9IBlwFBVV95cUxPZllGLU90bXZlazgwS1dfcjRVY0wzREFOVURWb3lUR2lZdkx1Z3lPNjI4LU5xcUtkazFDZ0pHRkRUaU9CSElyb1NXUXVqM2MydkRtTnNFM0FaSy1GZE1YUmwyZHZVN2NRdWlwekRFVlU2MGF0WU1UZTBZaHJ0UEw0dk93WUVkVjhrbWVKbEloY25uZEs0eU00?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 08:00:00 GMT",
        "title": "The Protocol: Is Solana's Rebound The Real Thing? - CoinDesk",
        "content": "SOLANA: BOOM TIMES OR BLIP? Solana's SOL token, which crashed in price from over $200 in 2021 to under $10 in 2022, has buoyed back above $100 in recent months, making it one one the biggest beneficiaries of the recent crypto market surge. The Solana blockchain was pilloried last cycle for its close ties to Sam Bankman-Fried and its spotty track record of network outages. SOL's latest price gains have been viewed by some as a signal of wider confidence in the ecosystem – an indication that traders see sordid company and performance issues as problems of the past. But the gains to SOL were accelerated in large part by auxiliary memes and airdrops, with a frenzy towards a few Solana-based tokens driving much of the hype. The biggest winner was BONK, a meme coin that has lept in price by over 200% in the past 30 days. (A funny side-plot to the BONK boom is that it was airdropped to owners of the Solana phone, which suffered from dismal sales until people realized they could buy it to nab BONK tokens, which were for a time worth more than the device itself.) Other winners included Pyth, a Solana-focused oracle network that recently launched a token; and Jito, a liquid-staking service whose just-airdropped JTO token marked a huge payday for some unsuspecting users. The Solana network has seen some technical improvements in the past couple of years, but, as is often the case in the world of blockchains, it remains to be seen whether the positive market developments were driven by genuine adoption of the speed-focused blockchain ecosystem, or by traders that will soon leave in favor of other buzzy bets."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5QcjRWUE9hRHJRMUJ4T21aempkc2pLRU93R0dGTjB3WTBfa3d0LXA3ZVE3c1hIN2xTZTdQZHVfQTBiVG1PUzh2YkpEUl90aHhvbW5wWVVJaFJSQTF3Q1VWUDlRRjk2c1JTdlM3aEtVa0E5d29rbkhoODJWNmZrZ9IBgwFBVV95cUxNekRKd2FyY1FBdkYtSHhaMmpHRjc1WFFQVm9WSGN4c19pcXRHR2o4emZRdkxSNnFMNVJFUmZqd1ZqcF9VSzNnU0RsNU1mU3Jnd1VqSVcxdHFMVEVHMW13QTA0anhoRjNtd3RuXzU0LUhBV3JnVUttUG9pVTVMa2FPc1VnMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "The Rise of Layer 2 Solutions in 2024: Scaling Cryptocurrencies for the Future - Coinnounce",
        "content": "Layer 2 Solutions: The Next Frontier in Crypto Scalability\n\nAs we delve deeper into 2024, the cryptocurrency world is buzzing with a key development: Layer 2 solutions. These technologies are pivotal in addressing one of the most pressing issues in the blockchain arena – scalability. But what exactly are Layer 2 solutions, and why are they becoming crucial for the future of cryptocurrencies like Bitcoin (BTC) and Ethereum (ETH)?\n\nUnraveling Layer 2: Enhancing Blockchain Efficiency\n\nLayer 2 solutions are advanced protocols built on top of an existing blockchain (referred to as Layer 1). Their primary objective is to enhance transaction speed and reduce costs, without compromising the security of the underlying blockchain. This is akin to adding express lanes to a busy highway; the original road (Layer 1) remains intact, but the new lanes (Layer 2) allow for faster and more efficient travel.\n\nLightning Network and Bitcoin: A Match for Speed\n\nOne of the most prominent Layer 2 solutions in 2024 is the Lightning Network, primarily associated with Bitcoin. This protocol facilitates instant, low-cost transactions by creating off-chain payment channels. It's a game-changer for BTC, transforming it from a digital gold to a viable medium for daily transactions.\n\nEthereum’s Scalability Quest: Rollups and Beyond\n\nEthereum, known for its smart contracts, has also been actively embracing Layer 2 solutions. Rollups have been a significant focus, bundling multiple transactions into a single one on the main chain. This not only speeds up the process but also reduces the infamous gas fees, making ETH transactions more user-friendly.\n\nThe Impact on Decentralized Applications (DApps)\n\nLayer 2 solutions are not just about faster and cheaper transactions; they have profound implications for Decentralized Applications (DApps). By alleviating the congestion on main chains, Layer 2 opens up new possibilities for DApps in terms of complexity and user experience, fostering innovation in the DeFi and NFT spaces.\n\nThe Future of Layer 2: Challenges and Opportunities\n\nWhile Layer 2 solutions offer immense promise, they are not without challenges. Interoperability between different Layer 2 solutions and the main blockchain, and ensuring the security and decentralization of these layers, are ongoing areas of development. However, the potential rewards are enormous, offering a glimpse into a future where cryptocurrencies can scale massively to meet global demand.\n\nEmbracing the Layer 2 Revolution\n\nAs we progress through 2024, the integration of Layer 2 solutions continues to reshape the landscape of cryptocurrency. For enthusiasts, investors, and developers, understanding and leveraging these solutions is key to navigating the future of digital currencies. Layer 2 isn't just a technical upgrade; it's a leap towards realizing the full potential of blockchain technology."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFB5cVJUMDdxaWhLdVAwOXlVS3Zzazh5NlZaRko2RGhQckI1VjJHcTYzZFdvTDlTcmFSOEp6OUltNzlXdDJpbl9jYnJLenFHMTNCZ3BMaG5JZUVmOVZUNGZLSkJ1NkJ3bFIt0gFuQVVfeXFMT0VMblByRk9IdzVHRFBJZlgyTWpZUkJFTkluYkhCZTVnaDdkeVVtU3RsTmItMkU4QjJZZ3JYcmNoVWNnSEYwY0dmZzVxV0ozOXF5OXZidDZubEJ1ekpYR1hGdk5GZkh0dGNIaHJ4OXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 12:33:55 GMT",
        "title": "The Year Of Solana: Ethereum's Etherscan Acquires Solscan Amid Unprecedented SOL Rally | Bitcoinist.com - Bitcoinist",
        "content": "Solana has been on an incredible run lately but it seems that the network is far from done. The most recent development is an acquisition of the official Solana explorer known as Solscan by the leading blockchain explorer in the crypto industry.\n\nEtherscan Takes Over Solscan\n\nThe name Etherscan has become synonymous with blockchain exploration, serving large names such as Ethereum and Avalanche over the years. As it continues to expand, it has added the largest blockchain explorer on the Solana network.\n\nOn Wednesday, January 3, Etherscan took to their X (formerly Twitter) account to announce the new acquisition. It revealed that Solscan is now officially part of the Etherscan ecosystem. “With the addition of @solscanofficial to the team, we hope to continue executing on our vision of providing credibly neutral and equitable access to blockchain data.”\n\nThis acquisition comes just mere months after the blockchain explorer had to path ways with one of its biggest clients, Avalanche. The Avalanche network had, in 2023, revealed that it would stop using the Etherscan service for its official explorer.\n\nApparently, the crypto firm had been paying upwards of $2 million a year to Etherscan to use their technology for their Snowtrace blockchain explorer. Avalanche would eventually partner with a smaller and lesser-known service provider, but in the process would provide a cross-chain service now domiciled on the same Snowtrace website.\n\nSOL price trending at $107 | Source: SOLUSD on Tradingview.com\n\nSolana On The Verge Of Bigger Things\n\nSolana is currently on the lips of every investor who is not only looking toward the recovery of the asset’s price but also the growth of tokens on the blockchain. Solana has since evolved to become the home of meme coins, beating out Ethereum for DEX volume, as well as USDT volume.\n\nAmid this, there have been calls for the continued rise of the SOL price. One analyst PS Trade believes that the coin’s price could be headed to $1,000. According to the analysis posted on TradingView, the analyst says there could be another attempt for a breakout toward $148-$158 before the local top is in.\n\nFrom there, once FTX begins to sell to pay back creditors, PS Trade expects the SOL price to fall back between $45 and $70, which they identify as a buy point. From this level, a 1,500% to 2,000% growth is expected which will push the price above $1,000.\n\nThe crypto analysis also lauded the network for its resiliency following the FTX collapse. “SOLANA has shown its resilience and dexterity of the project creators. They managed to revive a project that seemed to have drowned along with FTX,” PS Trade said.\n\nFeatured image from Coinfomania, chart from Tradingview.com"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQaG9UTmd0RFZQQWUxeXU4SmlRTXEwZS1KQjNWVUNlenZpNWEzbU5Ga0lmUElnUTJ0Z1pOU1NvNGV4WE9FMXhpRVF0WmN2dnN0OGlVeUxGR1lJcmVUd2ZTaWhPSXpERkJncDFuOGhyYTZhVWlCaTNUaTdkbG9zemg5d1Fmd0N6bVN0Y0hGLUFVWlNlZzlsMVlaR3AtWDgxY29QbFHSAacBQVVfeXFMTjFLbTBiSjVDb0NKa3kydTBmUlRMekV1NnNIaTIxem9JZ0pLakJvblF5LWQ3cmpMRlI1Q0hPQWxNZENsRkgxdTNSZjVZS2hHMDNMa3VzcXJRQTlXcGMtTHl1ei1JRzlYa3JKa3ZFbllzRDlUZWIydUlVcVE2TjZONWZSS19GU3l5R25MRG9uQml2eDJ5cDFNNGs3X3MyZm5WZXo2REt1bWs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin’s Historical Bull Run Analysis Points To Potential Peak In October 2025 - ZyCrypto",
        "content": "Advertisement\n\nBitcoin continued to surge higher on Thursday, following a surprise recovery on Monday, which was preceded by weak volatility for most of last week.\n\nBitcoin was trading at $44,240 at press time, marking a 3.43% increase over the past 24 hours. The broader market has also mirrored this growth, with top 10 cryptocurrencies such as Ethereum, BNB, XRP, and Solana experiencing notable increases in the range of 2.28% to 8.6%.\n\nMeanwhile, amidst this resurgence, prominent crypto analyst Ali Martinez has put forth a compelling perspective on Bitcoin’s future trajectory. In a tweet, Martinez drew parallels between the current market dynamics and historical bull runs, with his analysis suggesting that Bitcoin’s next peak could potentially materialize in next year’s fall.\n\n“If we mirror BTC’s past bull runs (2015-2018 & 2018-2022) from their respective market bottoms, projections suggest the next market peak could land around October 2025. That means BTC still has 700 days of bullish momentum ahead!” Wrote Ali.\n\nNotably, reflecting on historical patterns, the surge from $1,100 to nearly $20,000 in 2017 showcased a remarkable 20x increase within 12 months, driven by increased public awareness and retail investor participation. The subsequent years saw significant fluctuations, with the 2020 surge leading to an all-time high of over $68,500 in November 2021.\n\nAdvertisement\n\nHowever, challenges arose as the Bitcoin hash rate plummeted due to China’s decision to shut down mining operations, contributing to a subsequent price drop. The year 2022 further brought about a prolonged bearish trend, with the price dropping to as low as $15,700 due to investor concerns following the collapse of FTX and other high-flying crypto firms.\n\nNonetheless, Bitcoin staged an impressive recovery in 2023, driven by revitalized investor confidence and the anticipation of a spot Bitcoin ETF approval. Year to date, the cryptocurrency has surged by over 170%, outperforming traditional assets such as gold, the US dollar, and the S&P 500 by a significant margin.\n\nAdding depth to the argument on Bitcoin’s potential surge, indicators such as the Puell Multiple and the MVRV Z-score indicate potential upside. The Puell Multiple, standing at 1.53, suggests room for growth, especially after Bitcoin’s upcoming reward halving in March 2024. The MVRV Z-score of 1.6 signals that Bitcoin is not overvalued, supporting a continued rally into the next year.\n\nIn the short term, if Bitcoin can maintain its position above the $40,000 support level, a bullish run is anticipated to persist, with a strong likelihood of testing the $47,000 to $50,000 range."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPeVBQbktmWWdFS2d1NHlrOXNSQ2k2aVA5MXlsYi05S2taMFVycVppTGZJYThtbURuMERzYVh3cGRlN3JvV3dzM1FfcWZ2MXZ1UVZiMHNwME14RjJPdlVTYjhvaG1UMDlwbm95dExnMEJfeDJrNlYwMTR1eEFxWmNZTDhR0gGHAUFVX3lxTFBrWjdEZkdZUmpSdW10RzJTSDNkb0twMWltU0NWZ0hwMzJXcHFaYUdBUXV4MklpLURRbU1fM0FsVWpzVV9JdmJjODhBa1lUNU5CcXBnbkZqZkdkMFV1RnJ4SEUxMXFldWxQY0NYaHlNX09zd1B6c3VXSnk1UzVNQzBnOW1Oa2NBcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Top 10 Altcoins To Look Out For in 2024 - TechRound",
        "content": "0 shares Share\n\nTweet\n\nPin\n\nLinkedIn\n\n—TechRound does not recommend or endorse any financial, investment or gambling practices. All articles are entirely informational—\n\nStepping into 2024, the dynamic world of cryptocurrencies continues to evolve, presenting a variety of altcoins that hold promise beyond the dominant Bitcoin. These digital assets, each with unique functionalities and potential use cases, offer a spectrum of opportunities for those interested in the crypto market. Here are ten altcoins that merit attention in 2024, each offering distinct features and developments that could shape their trajectory in the ever-changing landscape of cryptocurrency.\n\nEthereum (ETH):\n\nEthereum continues to be a central figure in the crypto world, primarily due to its platform’s ability to host decentralised applications and smart contracts. Its transition to Ethereum 2.0, aiming for increased efficiency and scalability, could further solidify its position. There are a variety of ways in which to store your Ethereum, including using an Ethereum wallet. Ethereum’s potential in various sectors, from finance to gaming, makes it a key altcoin to watch.\n\nCardano (ADA):\n\nCardano is recognised for its scientific approach and strong focus on sustainability and scalability. Its proof-of-stake mechanism positions it as an energy-efficient alternative to traditional cryptocurrencies. With ongoing developments aimed at enhancing its ecosystem, Cardano could see increased adoption and utility.\n\nXRP (XRP):\n\nXRP stands out for its fast and cost-effective cross-border transaction capabilities. Its backing by Ripple Labs and recent legal victories add to its credibility. XRP’s growing adoption in the payment processing sector makes it a noteworthy contender.\n\nBinance Coin (BNB):\n\nAs the native token of one of the world’s largest cryptocurrency exchanges, Binance Coin has a vast range of applications, from trading fee discounts to payment processing. Its continuous burning mechanism, which reduces supply and potentially increases value, makes BNB an interesting altcoin.\n\nSolana (SOL):\n\nKnown for its high throughput and low transaction costs, Solana offers an efficient platform for decentralised applications. Its unique hybrid consensus mechanism contributes to its scalability, making it an attractive platform for developers and investors alike.\n\nDogecoin (DOGE):\n\nInitially started as a meme, Dogecoin has garnered a massive community and notable attention from influential figures. Its growing use in transactions and payments, coupled with its cultural impact, keeps DOGE in the spotlight.\n\nAkash Network (AKT):\n\nAs AI continues to influence the crypto narrative, Akash Network’s focus on decentralised cloud computing aligns with current tech trends. Its substantial growth in 2023 positions AKT as a potential leader in the AI-driven crypto space.\n\nRender (RNDR):\n\nRender’s role in the emerging field of decentralised graphics rendering, integral to AI and virtual reality applications, marks it as an innovative player in the altcoin market. Its impressive performance in 2023 suggests a bright future.\n\nImmutable X (IMX):\n\nWith its focus on NFTs and blockchain gaming, Immutable X taps into the burgeoning GameFi sector. Its solution for scalable and gas-free transactions on Ethereum makes IMX a key asset in the evolving gaming and digital collectibles space.\n\nRonin (RON):\n\nAs the blockchain behind the popular game Axie Infinity, Ronin’s success in the GameFi arena is notable. Its ability to handle high transaction volumes at lower costs positions it as a promising platform for blockchain gaming.\n\nCrypto expert Michaël van de Poppe explained in a tweet that understanding market trends is crucial for crypto enthusiasts. He emphasises the need for critical thinking in investment choices, especially in a market driven by hype and sentiment cycles. These altcoins are diverse and innovative directions the market could take in 2024. However, as with any investment, it’s essential to conduct thorough research and consider market risks before making decisions.\n\n—TechRound does not recommend or endorse any financial, investment or gambling practices. All articles are entirely informational—"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBhLWZNLU9vRlhLbHJfYXFlNl9HdVZiZWU3elZjUzlkU0t5WFBRX1d0U215T09taUs4YWs1U21pWW1pbjhEYnVtZFZiYW5zRXJyVGpacVZSOHhlYUxudV82MkQxNjktZ2FxSUI0QzNwZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "USDT on Tron Network Now Available at GCrypto - BitPinas",
        "content": "GCrypto, a cryptocurrency platform embedded within the GCash app, recently announced the addition of another cryptocurrency to its roster to start 2024 with new digital assets. Tron network’s Tether (USDT)is now available for purchase, sale, and trading on the crypto platform, bringing the total number of available tokens to 27.\n\nUnderstanding USDT\n\nTether (USDT) is stablecoin, a cryptocurrency that is pegged to the value of a fiat currency, in this case, the United States dollar (USD). Tether is designed to maintain a 1:1 ratio with the USD, meaning that one USDT token is intended to be equivalent to one USD. It is used as a medium of exchange and a store of value in the cryptocurrency market.\n\nThe stablecoin is issued by the company Tether Limited and operates on various blockchain networks, including Ethereum (as an ERC-20 token), Tron (as a TRC-20 token), and others. According to the company, the stability of USDT is maintained through Tether Limited’s backing by equivalent reserves in U.S. dollars.\n\nLast year, the stablecoin’s market share surged by 54%. This rise is attributed to challenges faced by its competitor BUSD, with issuer Paxos discontinuing stablecoin issuance under the New York Department of Financial Services’ directive.\n\nEthereum USDT vs. Tron USDT\n\nThe primary distinction between Tether USDT on Ethereum and TRON is the blockchain network on which they are built. Tether USDT on Ethereum is an ERC-20 token, whereas Tether USDT on TRON is a TRC-20 token. The address format of these tokens differs, with ERC-20 tokens identified by their Ethereum address, which begins with “0x”, and TRC-20 tokens using Tron addresses, which typically begin with “T”.\n\nUSDT Price to PHP\n\nCurrent Cryptocurrency Selection on GCrypto\n\nBitcoin (BTC)\n\nEthereum (ETH)\n\nEthereum Tether (USDT)\n\nTron Tether (USDT)\n\nUSD Coin (USDC)\n\nUniswap (UNI)\n\nChainlink (LINK)\n\nAave (AAVE)\n\nBasic Attention Token (BAT)\n\nThe Graph Token (GRT)\n\nEnjin (ENJ)\n\nLitecoin (LTC)\n\nBitcoin Cash (BCH)\n\nAvalanche (AVAX)\n\nPolygon (MATIC)\n\nPolkadot (DOT)\n\nAxie Infinity Shards (AXS)\n\nSmooth Love Potion (SLP)\n\nCardano (ADA)\n\nSolana (SOL)\n\nBinance Coin (BNB)\n\nStellar (XLM)\n\nSushiSwap (SUSHI)\n\nRipple (XRP)\n\nPaxos Gold (PAXG)\n\nShiba Inu (SHIB)\n\nApeCoin (APE)\n\nHow to Trade on GCrypto:\n\nAccess GCrypto through the GCash app. Ensure your GCrypto wallet is funded, with seamless top-ups available via GCash. Choose your desired cryptocurrency. Opt for either buying or selling. Enter the amount in PHP or cryptocurrency. Review and confirm the transaction details.\n\nGCrypto Crypto Additions in 2023:\n\nAdvertisement\n\n\n\n(Read: Beginners Guide to GCrypto | How to Buy & Sell Crypto on GCash)\n\nThis article is published on BitPinas: GCrypto Expands Offerings with the Inclusion of Tron’s USDT\n\nDisclaimer:"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQeG5ld1FiRUVBN292M211QTkzR0QyeGRweThXd2NuOG1MUlo0SGllXzRZOVREVFFGNklIZWV3RUhHeURaaHc3RElyd3N5bXZtd2hsTWc5S2M3Zm0xclNNNGc2T0xUZHBPY1UxZGQ0QjhwMk5rcXY3Wm1OOXh4eEVIeVA0Nmh0S3h6Slo0c2FjbnNNOUduNVhRdXpWUE9Pa0FjLVhCb0s5ONIBrAFBVV95cUxOemhQbVdNXzVFZ3ctc0pqRFJ4azVCcHkxMW03bTM3MW04TjlobkU1Sm1Vd3hLbkJjb0FOMktOemVGZDNCZ1FJU2lqTkQ1ZEJ6YktRd1pXZXVTcXBIRnJLa0dnXzlYMjlHQnZzN3JYRFFiMWJjTVNZekx6R2g4UkpyVk9iVTBjcWxDZWJPRUU0Qnpha1ZWX0xmNEk3bG9hWHhGU0poN1dqa1FjSTNy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Crypto prices today 4 Jan 2024: Bitcoin & Ethereum fall by 4.79% & 5.72% respectively - Web3Cafe",
        "content": "Bitcoin, the world's largest cryptocurrency, dipped by 4.79 percent to $43,267.46 over the past 24 hours. Ethereum, the second-largest cryptocurrency, plunged by 5.72 percent to $2,236.60.\n\nThe total trading volume witnessed an increase of 64.54 percent, reaching $118.65 billion. However, the global crypto market cap decreased by 4.83 percent to reach $1.66 trillion.\n\nadvertisement\n\nTop gainers and losers\n\nBeam, Akash Network and Sei emerged as the top gainers today, with their prices surging by 11.28 percent, 8.82 percent, and 7.65 percent, respectively. On the other hand, MultiversX, Terra Classic, and File Coin were among the top losers, with their values dropping by 16.69 percent, 16.38 percent, and 15.67 percent, respectively.\n\nMemecoins slips\n\nToday, most of the popular memecoins displayed negative trends, Elon Musk’s favourite Dogecoin decreased by 9.97 percent. Other popular memecoins like Shiba Inu, Pepe, Floki and Memecoin experienced a loss in their value with their prices decreased by 9.07 percent, 12.15 percent, 13.01 percent and 12.23 percent, respectively.\n\nMetaverse tokens negative performance\n\nMetaverse tokens exhibited a negative performance today. Internet Computer, The Sandbox, Theta Network, and Axie Infinity saw their prices decrease by 4.04 percent, 12.31 percent, 13.99 percent, and 9.36 percent, respectively. However, Stacks, Chromia, etc. recorded an incline in their value, indicating a divergence in investor sentiment within the metaverse sector."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE0wSFRfNC1WQml1bmRoN2VtRzkzVV92STRzS1NTY29CUk1mNktMUVNoeTliZjd2QWNERmR0c3NrX1EtOWxQdUREQ1FMRDlNTTF1N1RDVXRYM3JNU3lJbVRkUzFRTmNydTlZV1dONnhoUGdBVVhvdVHSAXtBVV95cUxOOVR0LXViVFNoTDBEQVBqdkJmZEtuWGJIelNsVUszb3NnR2hHOXdnSHlsS3ZCOHhVWndPTXZYM2NVZDY1SjV0QVlMNmNEX3ZyNDliNFoxcGJUS3Jrcl9tSW1iWjlFX1FadjAzaEpOalBRQ3hlb0ZQUS1oNUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 15:05:32 GMT",
        "title": "Solana Has Flipped Ethereum In Yet Another Metric In Its Bid To Reach $200 - NewsBTC",
        "content": "Solana has continued its bullish sentiment in its ecosystem to flip Ethereum in the stablecoin market for the second week in a row, according to on-chain data. SOL’s price gain has slowed in the past week, showing a negative 2.3% in a 7-day timeframe at the time of writing. However, stablecoin transfers on the Solana chain reveal the blockchain retaining its reputation as an Ethereum killer, registering more than $10.3 billion more trading volume in the last week.\n\nStablecoins Growing On Solana\n\nEthereum has mostly dominated the stablecoin market since the inception of Tether USDT. However, according to data from the crypto analytics platform Artemis, stablecoin trading volume on Solana surpassed Ethereum last week for the second week in a row, showing how quickly Solana is gaining traction. Solana registered $40.86 billion in stablecoin volume, compared to Ethereum’s trading volume of $30.31 billion.\n\nRelated Reading\n\nOn-chain numbers since December demonstrate that SOL is quickly becoming the chain of choice for stablecoin usage and transactions. Solana surpassed Ethereum in stablecoin volume for the first time in the week leading to December 25. During this period, SOL registered a weekly stablecoin trading volume of $103.01 billion, $12.14 billion more than Ethereum’s volume of $90.87 billion.\n\nSolana also went on a crazy surge last year, registering over a 950% gain as it reached a yearly high of $121. During this period, we saw Solana compete vigorously with Ethereum across various metrics.\n\nStablecoin trading volume, in particular, is at a 2,213% gain in a 3-month timeframe. The chain also witnessed 27.17 million stablecoin transactions in the same timeframe, compared to Ethereum’s 1.17 million transactions.\n\nDeFi aggregator DeFiLlama also shows DEX trading volume on SOL soared to $28.13 billion in December, surpassing Ethereum L2 chains Arbitrum and Polygon. Solana also overtook Ethereum in NFT trading volume in early December.\n\n\n\nSOL Price To $200?\n\nThe Solana ecosystem is expanding quickly, as evidenced by price surges and on-chain metrics. The price surge can also be attributed to various airdrops and the hype surrounding BONK, the first meme coin on the Solana chain. As more people buy and trade SOL and other assets on the blockchain, demand for the SOL coin is likely to increase.\n\nRelated Reading: Is A Bitcoin Spot ETF Approval A Sell The News Event? Experts Respond\n\nAt the time of writing, SOL is trading at $107, down by 5.74% and 3.44% in the past 24 hours and seven days respectively. It is now facing resistance at around $115, and a failure to rally above this price point could lead to a continued consolation toward support at $100.\n\nWhile there are never any guarantees, SOL’s strong fundamentals point to a potential price appreciation throughout the year and SOL’s path to revisiting the $200 price level and beyond.\n\nIf Solana continues to also outpace Ethereum and Ethereum L2 chains on key metrics and grows its real-world utility, $200 could be on the horizon sooner than most investors would expect.\n\nSOL at $107 | Source: SOLUSD on Tradingview.com\n\nFeatured image from Securities.io, chart from Tradingview.com"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPbWFEbEJibVk3VWF6VXBTamJPRmtqdldhQmtJZlE2UXVEWlhpUmRVbXNaLTcwVEdrbW5vVWNjNFFMR0o4UUg2Mld6aFg1aUtpZ2JaUFIyT2RfemhzQzk2eGxOSGlDcHFjTktOSU5XU3g5SDR4cU9vVnF4MjFPWldFSjdOSWFhREhXajE2cG9OeEo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Machine learning algorithm sets Ethereum price for January 31, 2024 - Finbold - Finance in Bold",
        "content": "The broader cryptocurrency market has experienced losses driven by the sudden dip in the price of Bitcoin (BTC), and the largest altcoin, Ethereum (ETH), wasn’t spared. Investors might wonder whether this is the beginning of a bear cycle or that tides might change soon.\n\nGiven the circumstances, Finbold sought the support of AI-powered machine-learning algorithms to assess the expected price of ETH by the end of the month.\n\nThese algorithms evaluate ever-changing market conditions and scrutinize relevant indicators to forecast the likelihood of this cryptocurrency experiencing gains by the conclusion of January.\n\nAccording to the algorithms, the projected price for ETH is expected to increase to $2,285 by January 31, reflecting a 2.60% rise from its present level of $2,227 as of the time of writing.\n\nETH price prediction for January 31. Source: CoinCodex\n\nAnalysts predictions\n\nThe MVRV comparison allows for evaluating whether the existing price is higher or lower than the perceived “fair value,” offering insights into market profitability.\n\nAs outlined in the Ethereum MVRV Pricing Bands, ETH’s forthcoming significant price targets at $3,830 and $5,100 were identified by cryptocurrency analyst Ali Martinez in an X post on January 2.\n\nThe potential price range of ETH according to MVRV. Source: Ali Martinez\n\nThe given range seems relatively bullish to other analysts, as momentum needs to be garnered for ETH to continue towards the price range of $3,000 and $3,500, as per crypto expert Michael van de Poppe’s post on January 3.\n\nThe potential price range of ETH. Source: Michael van de Poppe\n\nSpeaking of ranges, potential, and momentum, the current market sentiment registered by the fear and greed index toward this digital asset is in the greed section, standing at 65, as per the latest data retrieved on January 4.\n\nEthereum Fear and Greed Index is 65 — Greed\n\nCurrent price: $2,222 pic.twitter.com/objfj0pBLY — Ethereum Fear and Greed Index (@EthereumFear) January 3, 2024\n\nETH price analysis\n\nAt the time of press, ETH was trading at $2,227.82, reflecting a decline of -6.35% in the last 24 hours, adding to losses of -6.67% over the preceding week and contrary to a slight upside of 0.84% in the past 30 days.\n\nETH 30-day price chart. Source: Finbold\n\nAt the same time, TradingView’s technical indicators for Ethereum show a neutral sentiment. A summary of these indicators indicates a ‘neutral’ rating at 9, with moving averages signaling a ‘sell’ at 8. Oscillators are inclined towards a ‘neutral’ rating, registering at 8.\n\nETH technical analysis. Source: TradingView\n\nBroader cryptocurrency market trends, transaction fees, BTC price movement, and investors’ support are only some factors that may drive the ETH’s price in the coming days and months.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTFBrRXQxaHdxLTIzRHRMSFBWZlMteko5a0RQcE9zUlpwX3Bha084N292OVRUcUpBSFVOZnlhTFB4NEMyVmt5OVlmdDVpY1pLOXNIZklKQ0RHM2prMkRlTUdONHZoQUnSAWpBVV95cUxPRzA4TkdBa19mTE1MRGV4RnpWM1Fnbl9GYlVneEVLVjBPc2xfQW00eTlLSkFRQkdvX1VoLVpvTEwtRkdTNUFXQkQwbnRobFctR3lyZmxYSXRRS3RiRnQ0eTdsWG9jbDlpaG5R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Solana Beats Ethereum in 2023 — What Went Wrong With ETH Army - CoinChapter",
        "content": "Solana beats Ethereum in 2023\n\nNEW DELHI (CoinChapter.com) — Solana (SOL) investment products beat Ethereum (ETH) in 2023, according to the CoinShares digital asset funds flow report. The blockchain platform might continue outperforming Ethereum as L2 blockchains continue taking center stage.\n\nThe CoinShares report noted that Bitcoin (BTC) continued to be the favorite of investors, likely due to the spot ETF hype. BTC investment products attracted nearly $2 billion in inflows in 2023.\n\nSolana beats Ethereum in 2023. Source: CoinShares\n\nSurprisingly, Solana came in second with $167 million in inflows in 2023, while Etheruem investment products only saw $78 million in inflows, about 53% less than Solana.\n\nA few challenges in 2023 helped Solana outperform Ethereum as traders’ favorite. The transition to the Proof-of-Stake (PoS) model introduced new concerns regarding centralization and consensus mechanism complexity.\n\nThe new issues added to the challenges Ethereum was already facing, such as privacy and Layer-1 scalability. Furthermore, the emergence of L2 blockchains with faster transaction processing times and lower gas fees also cut into Ethereum’s user base.\n\nAdditionally, Ethereum’s dominance in the NFT sector declined. Once a favorite of NFT traders, Ethereum experienced a drastic decline in mintings and trading volumes. Ethereum-based NFT trading volume declined by nearly 59% in 2023.\n\nThe trend suggested a loss of investor interest, exacerbated by rising competition from other blockchains.\n\nWhat Went Right For Solana\n\n2023 was a difficult year for Solana, too, thanks to its association with the doomed crypto exchange FTX. However, the blockchain platform continued to build partnerships and expand its ecosystem. The growing interest in the DeFi sector also helped Solana sideline Ethereum.\n\nThe team at Solana has made expansive plans for 2024, with DeFi being a key focus point. Platforms like Orca and Raydium would likely lead the way for Solana’s DeFi expansion plans. The projects focus on yield farming and liquidity provision, making the DeFi sector more accessible to retail traders.\n\nSolana NFTs could outperform Etheruem NFTs in trading volume in 2023.\n\nMoreover, market participants speculate that Solana NFTs might sideline Ethereum NFTs in 2024. One reason behind the speculation is that Solana NFTs are cheaper to trade than those on Ethereum, which could attract new market entrants.\n\nSolana’s TVL also reversed its decline as a result of an increase in deposits and usage of its DApps. It seems likely that L2 blockchains and Solana would likely continue sidelining Ethereum in 2024.\n\nSOL Bulls Defend EMA Support\n\nMeanwhile, the SOL price is currently consolidating above the 20-day EMA (red wave) dynamic support. Despite the bearish pressure, Solana’s price spiked 5.5% to reach a daily high near $102 before retreating.\n\nSOLUSD daily price chart with RSI. Source: Tradingview.com\n\nIf the sell-off continues, the SOL price might drop to the 50-day EMA (purple wave) support near $83. Breaching the immediate support could see Solana price test the 100-day EMA (blue wave) support near $64.\n\nConversely, a rally from here would see the SOL price break above $110 before targeting the resistance near $128.\n\nThe RSI for SOL remained neutral, clocking a score of 56.01 on the daily charts."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMi8gFBVV95cUxQRlRCRHpPMmRaLVpCYU9JMzl4NVB2RFFKN1FhWUtiMGw4TEpCQnRXZEN6b1E1QWpaZjcxc202UDNBQk5EbDZsRHIzc0F2ZEJ2UXJMSUNYXzRvLUNWSFVMa3lacHdLLW5zSHk5dk0zXy1WQlpweGtHQkJFUFFLQ2UtVE8tWVhvRWFGalBTNFEydEkzcGJJZGxNbTNoYlhrYS1nZmdZRFo0LTNoQW5YanJCT1RjU3QzUGVtVGllOFBrbjlRRWRWcWU2dEVnSDllZnpzSnE2WFdWWTRCTC1rc3Y0UVJ2eWZaR3lHend5a1B6Z0k2dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 08:00:00 GMT",
        "title": "Which Coins Will Ride the Bull? Top Coins to Buy for the Crypto Bull Run with Solana, Ethereum, Sei, Celestia, Bonk, Coq Inu, Injective, and ApeMax - Finbold - Finance in Bold",
        "content": "DISCLAIMER: This article is a SPONSORED and does not constitute Finbold's editorial content. Crypto assets/products involve significant risks. Do not invest unless you are prepared to lose your entire investment. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected].\n\nThe crypto landscape witnessed a substantial uptick in 2023, with notable price surges in Bitcoin, Ethereum, Solana, and the advent of innovative newcomers like the Boost-to-Earn token, ApeMax.\n\nAs we step into 2024, the crypto market is gearing up for what could be a transformative year. The impending Bitcoin halving event in 2024 is a significant catalyst, historically associated with surges in crypto coin prices.\n\nAfter surfing the web to gather information from reputable Web3 sources and official coin websites, we will outline the top coins to consider for the upcoming crypto bull run.\n\nList of Top Coins to Buy for the Bull Run\n\nApeMax (APEMAX)\n\nApeMax has emerged as a frontrunner among new meme coins, carving out its space in the crypto space with distinctive features. The coin introduces an innovative “Boost” staking protocol, enabling token holders to “boost” their preferred entities and potentially earn rewards.\n\nApeMax’s standout feature also includes instant token access for eligible presale buyers, making room for immediate staking. With an ongoing presale, ApeMax continues its popularity in the market as anticipation grows for a potential bull run.\n\nSolana (SOL)\n\nSolana, a third-generation blockchain platform, employs PoS and PoH mechanisms to deliver smart contract functionality. Positioned as a potential “Ethereum rival,” SOL stands out for its high speeds, low costs, and overall efficiency.\n\nEthereum (ETH)\n\nMaintaining its prominence as the second-largest coin based on market capitalization, Ethereum continues to lead the smart contract revolution. The platform’s robust infrastructure empowers decentralized applications (DApps) and smart contracts, with the rise of NFTs and Web3 gaming sustaining Ethereum’s relevance.\n\nSei (SEI)\n\nSEI, a Layer 1 blockchain tailored for digital asset exchange, introduces its native utility token with various functions, covering transaction fees, DPoS validator staking, governance participation, and collateral for applications on the Sei blockchain.\n\nCelestia (TIA)\n\nLaunched in 2023, Celestia prides itself on being the world’s first modular blockchain network with a focus on scalability. Celestia is a layer-1 blockchain, emphasizing transaction arrangement and ensuring transaction data accessibility without engaging in smart contracts or computational processes.\n\nBonk (BONK)\n\nThough not a newcomer, Bonk gained traction on the Solana blockchain for its association with Solana meme culture. Bonk operates on the cost-efficient Solana blockchain with a market cap of $898 million.\n\nCoq Inu (COQ)\n\nOperating on the Avalanche C-Chain, Coq Inu boasts a total supply exceeding 69 trillion tokens. Established by the community in 2023, COQ stands as the 9th largest meme token by market capitalization, with a market cap of $139 million.\n\nInjective (INJ)\n\nInjective focuses on making DeFi and Web3 accessible. With user-friendly architecture, it allows easy creation of DeFi and Web3 apps, ensuring lightning-fast transactions and instant finality through its PoS consensus.\n\nIs a Crypto Bull Run Coming?\n\nRecent market movements in 2023, such as Bitcoin surging to $44,000, suggest the potential for a bull run. However, as bull runs are typically identified after they occur, crypto enthusiasts are closely monitoring the market for signs of a sustained optimistic trend in the coming weeks and months.\n\nWill ApeMax Surge in 2024?\n\nThe ApeMax presale continues into 2024, steadily gaining momentum. ApeMax’s distinct features and playful identity have garnered attention as the market anticipates a potential bull run. Given the inherent volatility of the crypto space, predicting future token surges remains uncertain.\n\nCan ApeMax Achieve the $1 Milestone?\n\nApeMax’s value trajectory remains speculative, influenced by factors like market demand and circulating supply. Despite uncertainties, the ongoing presale momentum and innovative tokenomics position ApeMax as a unique player in the crypto market.\n\nClosing Thoughts\n\n2024 holds the promise of being a dynamic year for the crypto market, fueled by bullish sentiment. Ethereum, Solana, ApeMax, and other innovative coins showcase the industry’s continuous creativity.\n\nHowever, thorough and independent research remains crucial, and crypto enthusiasts must also consider the associated risks and volatility of the crypto space. This article does not offer financial advice.\n\nFor readers interested in ApeMax, there are geographical purchase restrictions, particularly in the US, Canada, and other restricted regions. Please refer to the official ApeMax website for up-to-date information."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiS0FVX3lxTE8wMHlvdHJUNHhWWTVKWENNVkxLaDdVM29TTmVLS1pFazA3cWwyUk4wRzl3MkFacjd0NTczV3prU2NiUldSNXZrZ05GUdIBQkFVX3lxTFA4SzBTVUxBaVEzbE1WTF9ldk02aXVhbVMzcUN3OGRfdkdxdE51RUNvR2tvd09nQ2swc1haR2hTanUzQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Reveals The Importance Of Ethereum Name Service, ENS Token Price Immediately Soars 50% - VOI English",
        "content": "JAKARTA - The Ethereum Name Service (ENS), a decentralized domain name service running on the Ethereum blockchain, experienced a significant price increase on January 3, 2024. This was triggered by support from Ethereum co-founder Vitalik Buterin, who called ENS a \"very important\" service and had to be \"affordable\".\n\nAccording to data from Bitcoin.com Markets, ENS tokens rose more than 50 percent a day, from $8.28 (Rp 128,600) to $16.01 (Rp 248,700). This is the highest level ever achieved by ENS tokens since its launch in March 2023.\n\nButerin, who also has a 'vitalic.eth' domain at ENS, expressed its support through platform X (formerly Twitter). In X's post, Buterin emphasized the importance of ENS to be accessible and affordable, especially on layer two (L2) networks such as Optimism, Arbitrum, and Polygon.\n\nFor your information alone, L2 is a scalability solution that allows Ethereum transactions to be processed outside the main chain (mainnet) at lower costs and higher speeds. According to Bitcoin.com, to use ENS in L2, a CCIP (Cross-Chain Interoperability Protocol) resistor is required. The CCIP resolator is a protocol that facilitates communication and resolution of data between different blockchain networks.\n\nWith the CCIP resolator, users can register, update, and read ENS subdomains directly on L2, without having to return to the mainnet. ENS subdomains are human-readable names that replace complex alphanumeric wallet addresses. For example, if you have 'example.eth' domains, you can create subdomains such as 'dompet1.omen.eth' and 'dompet2.examp.eth'.\n\nENS is a decentralized naming service that functions similar to traditional DNS (Domain Name System) on the internet. However, in contrast to DNS controlled by central authorities, ENS is fully owned and operated by the Ethereum community. ENS can not only complete domain names to Ethereum addresses, but also to other information such as IPFS addresses, social media profiles, and personal data.\n\nENS is expected to increase the ease of use and adoption of Ethereum, by providing a flexible and secure digital identity for users. In addition, ENS can also open new opportunities for developers and entrepreneurs to create ENS-based applications and services. Some examples of apps that already use ENS are Uniswap, MetaMask, OpenSea, and Etherscan.\n\nThe English, Chinese, Japanese, Arabic, and French versions are automatically generated by the AI. So there may still be inaccuracies in translating, please always see Indonesian as our main language. (system supported by DigitalSiber.id)"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQOWExZm1GaHZrVzg3VzNRZklCaWVVbzZldUpjR2NNY3o3eUt3SGpvR0hKaG41aTY0LXJXbFJ4NHJGM3VhclpaTnpGNnJUM29nTndvR0xxRmhOSm16VGlFYlZzVnBTeGxPUUMzeW5xcEZzSi1zb2RTT0RqM3BmSExEay10ck9paFZKZEln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin unveils Ethereum’s strategic focus for 2024 - - CoinMarket.News",
        "content": "Vitalik Buterin, the co-founder of Ethereum, has recently revealed the blockchain’s 2024 roadmap, indicating that it largely mirrors the plans set out in the previous year, with a few minor tweaks.\n\nIn a sequence of updates shared on the platform X (formerly known as Twitter), Buterin discussed Ethereum’s ongoing development, concentrating on six key areas: the Merge, the Surge, the Scourge, the Verge, the Purge, and the Splurge. Accompanying his explanation was a comprehensive chart detailing these components, along with annotations and diagrams.\n\nBy popular demand, an updated roadmap diagram for 2023! pic.twitter.com/oxo58A2KuG — vitalik.eth (@VitalikButerin) December 30, 2023\n\nThe focal point of the roadmap remains the Merge, a significant milestone achieved in September 2022, where Ethereum’s mainnet was successfully merged with the Beacon Chain, transitioning from a proof-of-work (PoW) to a proof-of-stake (PoS) consensus model. This shift has notably reduced the network’s energy consumption.\n\nButerin also emphasized advancements in Ethereum’s single-slot finality (SSF). SSF is increasingly seen as a straightforward solution for addressing several existing weaknesses in Ethereum’s PoS design. The concept of finality in blockchain refers to the assurance that once a block is added, reversing it would require burning a substantial portion of the total staked Ether.\n\nThis development aligns with Buterin’s broader vision of reviving the “cypherpunk” ethos within Ethereum, a movement emphasizing the use of encryption and privacy technologies to safeguard against government surveillance. Buterin lamented that Ethereum’s original vision as a decentralized platform for peer-to-peer messaging and file storage had been overshadowed by financial applications since 2017.\n\nHe remains hopeful, however, that the increasing mainstream adoption of technologies such as rollups, zero-knowledge proofs, account abstraction, and advanced privacy solutions will reinforce these cypherpunk values within the Ethereum ecosystem."
    }
]