[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOby05SXBRd240b1JzQ3JVR0tWN3RtUnVCVEZyWEhoWVp2eUliU2hDeUtzQ2dQcUVDZldrQzYwWjdSdnY3S2E1aS1GZ3ZLcjhETVZYNklkMXU3eDBVTGc3eHJrSkNkbzl0MVJBUFZzZFRKV2MxeEJIbHhMTWVuNnFYWnk0eVlkclFaQ2hwNlpqdlV5Qi1PcjZTdlhGVHVrODMwVVJFcVBGczVlOUg5bFpyLUJ4REJWdy1HZkpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "VanEck’s Ethereum Layer-2s Valuation Prediction by 2030 - VanEck",
        "content": "Please note that VanEck may have a position(s) in the digital asset(s) described below.\n\nIn this piece we:\n\nWe conclude that Ethereum Layer- 2 landscape is crowded with few winner-take-all characteristics for now.\n\nEvaluate Layer-2 blockchains through a lens of developer experience, user experience, & technical capability.\n\nShow assumptions behind our $1 trillion market cap base case valuation for Ethereum Layer-2s by 2030.\n\nLayer-2 Blockchains Overview\n\nEthereum's dominance in smart contracts faces a critical hurdle: scalability. While the network offers unparalleled security and decentralization, transaction fees and processing times soar when usage intensifies. To overcome this, Layer 2 solutions have emerged, and advancements like the recent fork EIP-4844 promise to unlock even greater scalability for these Ethereum offshoots. Here we analyze an array of Layer 2 solutions from the perspective of transaction pricing, developer experience, user experience, trust assumption, and ecosystem size.\n\nLayer-2 (L2) blockchains are connected networks that operate on top of a primary blockchain, like Ethereum, to increase its capacity for processing transactions. By handling transactions off the main blockchain and then settling them back on it, L2 solutions help to scale the blockchain's capabilities without compromising its security or decentralization.\n\nEthereum’s current capabilities are well-known to be inadequate for hosting all of the globe’s financial transactions. To be more precise, the world’s financial system will need to process more than Ethereum’s long-term limit of around 19.2 USDC or 6.8 Uniswap trades per second. However, this is a limitation by design because Ethereum’s stewards believe that censorship resistance is best achieved by making it inexpensive for anyone to run Ethereum nodes.\n\nThe result is that Ethereum limits its chain’s capabilities to cut down on networking requirements, data storage needs, and computer hardware demands of its nodes. This practically limits how many bytes of data Ethereum can process over a given period of time. As transactions on a blockchain are nothing more than pieces of data that the blockchain agrees are correct, the capabilities of a blockchain can be measured simply by how much useful data it can handle.\n\nSource: VanEck Research as of 3/15/2024.\n\nTo address these constraints, Ethereum's developers initially proposed a “sharding” solution, which involved splitting the blockchain into 64 smaller, interconnected sub-blockchains called “shards.” Each of these shards would process transactions within each’s own containerized child blockchains and then submit proofs of the activity to be reconciled by Ethereum’s parent blockchain. While this approach appeared promising, and some of its components debuted on Polkadot starting in 2020, Ethereum developers eventually discarded the sharding plan called Ethereum 2.0. This is because they believed it was technically infeasible and incapable of scaling to Ethereum’s vision of becoming a blockchain for billions of users.\n\nInstead, Ethereum's roadmap shifted towards leveraging Layer-2 (L2) blockchains. These L2 networks handle most transactions off the main Ethereum blockchain, only settling the highest-value transactions directly on it. This approach reduces the load on the main blockchain, allowing it to process more transactions efficiently. In this dynamic, Ethereum accrues value because the costs of these settlements must be paid in ETH; this strategy also reinforces the value of ETH as the true “oil” powering the entire ecosystem of connected chains.\n\nAt its core, Ethereum's primary challenge is its limited capacity to process, store, and compute data in the form of financial transactions. This bottleneck in data throughput is being addressed by offloading much of the data processing and computation to Layer-2 blockchains. As a result, Ethereum's development is now concentrated on enhancing its ability to integrate compressed transaction data from these L2 blockchains. But how exactly do these connected blockchains function, and what are their business models?\n\nEthereum Ecosystem Transactions vs. Ethereum Mainnet Market Share\n\nThe Ethereum Ecosystem is growing while Ethereum’s share is shrinking. Source: Artemis XYZ as of 3/22/2024. Not a recommendation to buy or sell any of the names mentioned herein. Past performance is no guarantee of future results.\n\nLayer-2s Role in Scaling Ethereum's Network\n\nLayer-2 (L2) blockchains enhance Ethereum's capabilities by aggregating multiple transactions into condensed bundles, known as \"roll-ups.” These “bundles” of transactions are posted by L2s to Ethereum at various intervals that are spaced apart to balance transaction demand, security, and cost. As such, Ethereum is becoming a “blockchain of blockchains.”\n\nEach L2 generally consists of its own series of smart contracts on Ethereum that keep track of L2 transaction history, facilitate data transfer between the L2 and Ethereum, run fault proof or zk verifier contract (more on this below), and function as an asset escrow between Ethereum and the L2. Very powerful computers called “sequencers” ingest and order all the transactions that occur on the L2 blockchains. This is more capable and cheaper than Ethereum because L2s run one very powerful server computer that simply intakes transactions and orders them. This dynamic allows L2s to process greater data throughput than Ethereum. By contrast, Ethereum transaction processing involves 100s of thousands of globally distributed validator nodes sending, interpreting, and agreeing upon transaction data. This takes a lot more time due to the Ethereum consensus process and involves duplicating the work of one computer on each of the 100s of thousands of Ethereum nodes. Logically, a single computer like a sequencer processing transaction is much cheaper and faster than a system of globally dispersed, less capable computers that need to collectively use gigabits of internet bandwidth to message and hundreds of thousands of CPUs to process blockchain transactions.\n\nTypes of Layer-2s: Optimistic Roll-Ups (ORUs) and Zero-Knowledge Roll-Ups (ZKUs)\n\nThere are two main types of L2s connected to Ethereum: optimistic roll-ups (ORUs) and zero-knowledge roll-ups (ZKUs). Both settle their ledger balances, or \"state,\" on Ethereum by sending a compressed version called a \"Merkle Root.\" ORUs also post a condensed batch of transaction data to allow for verification and traceability of ledger changes over time.\n\nSettlement in Layer-2 blockchains (L2s) can be compared to updating a baseball game's scoreboard inning by inning, with the transaction data serving as the detailed play-by-play. For optimistic roll-ups (ORUs), they operate on the principle of optimism, meaning they are presumed to be accurate unless proven otherwise. If an entity, such as a high-frequency trading firm or a mathematically adept researcher, identifies an incorrect or faulty Merkle root, they can submit a fraud attestation, known as a fault-proof, to Ethereum. Entities monitoring ORUs for fraud have a seven-day window, referred to as a \"challenge period,\" to detect any fraudulent activity following a state update. Once this period concludes, the transactions within the ORU are deemed final. If a fault-proof successfully demonstrates fraud, the smart contract overseeing the ORU's state will revert all transactions to the state before the fraud commenced. The challenge period extends for seven days, after which each batch of transactions is irrevocably finalized.\n\nAt the time of writing, of the forty-six L2s we track through l2beat, only four chains have fraud proofs live. Two of those four are under the umbrella of Arbitrum, which boasts the highest total value locked (TVL) of any L2 at $4.31B and only allows fraud proofs from a whitelisted group of entities.\n\nThe most popular ORUs are Arbitrum, Blast, Optimism, Manta, Metis, Mantle, and Base.\n\nTotal Value Locked (TVL) vs. Annualized Revenues Optimistic Roll-Ups (ORUs)\n\nSource: Defillama, TokenTerminal as of 3/12/2024. Not a recommendation to buy or sell any of the names mentioned herein. Past performance is no guarantee of future results.\n\nA zero-knowledge roll-up (ZKU) operates similarly to an ORU, with one key difference. While ORUs submit both transaction data Merkle roots and state Merkle roots to Ethereum, ZKUs only send a zero-knowledge proof of the transaction data. This is because ZKUs do not operate under the assumption that the submitted state roots are correct. Instead, once the proof is submitted to Ethereum, a smart contract verifies the authenticity of the ZKU's transaction bundle.\n\nAs a result, ZKUs do not have fault proofs because proofs are generated with each state update. Unlike ORUs, ZKU transaction data is considered final once the proof is accepted on Ethereum, ensuring immediate finality and eliminating the need for a challenge period.\n\nThe most important ZKUs are currently Starkware, zkSync, zkScroll, Linea and *c zkEVM\n\nThe base economics of ZKUs and ORUs are very similar to those of L1 blockchains. Both types of roll-ups make money when users create activity on their chains and pay fees in ETH to Ethereum. Currently, all L2s price their transactions in ETH because that is the token needed to settle transaction data to Ethereum.\n\nLayer-2s Revenue Models\n\nRegardless of the process, it is important to understand that transaction ordering has value and that blockchains can make money by selling the rights to transaction ordering. This diagram illustrates how three different transaction sequencing models can create different revenue streams.\n\nSource: VanEck Research as of 3/25/2024. Explanation: Assume that TX2 is a high value transaction, buying $1M of a token on an L2. In FIFO, everyone pays the sequencer the same amount. In Priority Ordering, TX2 pays the sequencer to be first. In Auctioning Specific Slots, TX3 and TX4 pay extra to be ahead of and behind TX2.\n\nLayer-2s Transaction Sequencing: Priority, FIFO, and Auctioning\n\nL2s charge users a fee for transaction inclusion in each block. This is composed of a base fee and a priority fee. Some L2s charge priority fees, like Optimism. Priority fees give users the ability to be first in line at the top of the block of transactions. In the last 6 months, the top 10 L2s on Ethereum made $232M in revenues from user transactions alone. This ability to “cut the line” by paying priority fees benefits users engaging in time-sensitive activities, such as arbitrage trading.\n\nArbitrum adopts a first-in-first-out (FIFO) sequencing approach to transactions as they arrive. In certain cases, users may prefer their transactions to follow specific others on the block. A common strategy, known as \"back-running,\" involves positioning a transaction right after a significant trade to exploit price discrepancies across decentralized exchanges (DEXs) for arbitrage opportunities. More malicious transaction ordering techniques, such as \"sandwich attacks,\" involve strategically placing buy orders immediately before a user's planned trade and sell orders immediately after. This manipulation drives up the price of the desired token just before the user's transaction executes, forcing them to purchase at a disadvantageous, inflated price.\n\nOn Ethereum, ordering is monetized by a software addition added to Ethereum’s validator software. This software, called Flashbots, allows for validators to auction off the right to order transactions (and insert their own) to outside entities. This auction generates \"maximal extractable value\" (MEV), adding to the validators' and stakers' yields. While L2s have the potential to monetize MEV by auctioning off block ordering rights, no L2 has officially done so yet. However, trading firms may already be positioning their servers close to L2 servers, akin to practices in equity and commodities exchanges.\n\nLooking forward, many L2s plan to decentralize their sequencer set, which may involve staking tokens — possibly ETH from an Eigenlayer DA or from each roll-up’s native token. The sequencer decentralization could unlock new revenue streams from MEV. To contextualize, Ethereum's MEV take rate on DEX volume averages around 4 basis points (bps), while other blockchains like Polygon and Solana have rates of 0.4bps and 3.5bps, respectively. These rates likely understate the full scope of MEV due to the challenges in tracking and the incentives to conceal profits. By estimating MEV take rates against DEX volumes, if Arbitrum's MEV was captured at a rate of 3.0bps, it would amount to $58.9 million — a significant 57% of Arbitrum's fee-only revenue.\n\nArbitrum Revenues with 3bps of MEV on DEX Volumes\n\nSource: Artemis XYZ as of 3/20/2024. Not a recommendation to buy or sell any of the names mentioned herein. Past performance is no guarantee of future results.\n\nLayer-2s On-Chain Cost Structures\n\nLayer-2s (L2) primarily incur costs through Ethereum gas fees as they regularly post transaction data, settlements, and proofs to Ethereum. But zero-knowledge roll-ups (ZKUs) and optimistic roll-ups (ORUs) differ in their cost structures. While both update their states on the L1, ORUs have to pay onerous on-chain data costs while ZKUs must expend money proof generations and verification. Regardless, the consequence of the dependence on Ethereum is that the L2s input cost is subject to the volatility of Ethereum blockspace. For the most part, this cost difference is passed on to the user. However, the margins that L2s earn are quite volatile as a result.\n\nPrior to EIP-4844, L2s posted both settlement data and proofs to Ethereum as single transactions in the “message field” of each transaction structure called “call data.” This was a “hack” to utilize one component of Ethereum’s standard transaction format for the purpose of holding compressed L2 data. Though this is novel, it is very expensive. For example, for the month of February, Optimism paid $5.7M, Arbitrum paid $7.2M, and Scroll paid $6.7M for posting call data to Ethereum.\n\nSource: VanEck Research, Celestia as of 3/14/2024.\n\nThe cost components for ZKUs are inherently higher compared to ORUs because ZKUs submit both zero-knowledge proofs and call data to Ethereum. While ORUs may also involve proof costs, these are generally outsourced to third parties who challenge the state if needed, and therefore they do not heavily influence ORUs' base costs. The verification of ZKUs’ zero-knowledge proofs on Ethereum can be extremely costly. Despite Ethereum's optimization efforts, such as native op codes to streamline zk-proof verification, the expenses remain significant—for example, Scroll's ZKU incurred $1.1 million in proofing fees in just the first 13 days of March.\n\nAs a result of these high proving costs, the average profit margin for ORUs over the last six months stands at 26.7%, contrasting with 21% for ZKUs. Logically, a roll-up could send more transactions in fewer batches to decrease variable batch posting expenses. Infrequent batch posting, however, could also come as a result of less transaction throughput happening on the L2s. Regardless, L2 batch post frequency to Ethereum is a profitability lever an L2 can pull, but one that comes at the expense of user experience. In practice, L2s decide batch posting as a calculus of how many transactions they can fit into a block, Ethereum L1 gas prices, and each L2 incoming flow of transactions.\n\nL2 Batches Per Day vs. Ethereum Settlement Costs\n\nSource: Dune @niftytable, Etherscan as of 3/14/2024. Not a recommendation to buy or sell any of the names mentioned herein. Past performance is no guarantee of future results.\n\nTechnically, L2s can post more expansive understandings of what occurs on L2s besides the simple “scoreboard” settlements. Price competition amongst L2s to serve users the cheapest transactions cause L2s to often choose the most economical data to post. Often, this means just posting “state differences” for ZKUs, and for ORUs, it means posting highly compressed transaction data. Curiously, though ZKUs do not technically have to post full transaction data, some still do so. While Starknet and zkSync only post “state differences,” Linea, Polygon, and Scroll post full transaction data. This is done because it may be challenging for things like explorers and wallets to track blockchains without the transaction data. Another possibility is that posting full transaction data allows more transparency so that anyone can run a node to track a ZKU. ZKUs may also be open to opening up a prover to anyone in the future, and posting full transaction data to Ethereum allows ZKUs to “decentralize” their blockchains at the point of the “provers.”\n\nA cost reduction that many L2s currently make is to improve the efficiency of their compression. For example, on February 13th, Linea deployed a new compression scheme that increased compression on the chain by a factor of 10x, moving from around 500 bytes per transaction to the mid-50s. Other L2s, both ORUs and ZKUs, had an average transaction size on Ethereum of 300 bytes for 2024. While compressing transactions may save on data costs to the L2, it reduces its potential due to the time it takes to compress transactions.\n\nL2 On Chain Margins by Month\n\nSource: Dune @niftytable, Artemis XYZ as of 3/13/2024. Not a recommendation to buy or sell any of the names mentioned herein. Past performance is no guarantee of future results.\n\nEIP-4844’s Answer to L2 Data Costs: Blob Space\n\nOn March 13, 2024, Ethereum passed the Dencun upgrade, which had a handful of important changes, the most significant of which was the creation of what is called “Blob Space.” Prior to this upgrade, the main challenge for Layer-2s was the prohibitive cost associated with posting transaction data to Ethereum. Recognizing this, Ethereum’s solution was the strategic creation of a specialized data layer, colloquially known as Blob Space, designed exclusively for L2 data postings.\n\nThis newly established layer offers a targeted transaction environment tailored to receiving data from L2 networks. Blob Space's innovative aspect is its transient data handling—data blobs posted here are retained for only four weeks before deletion, significantly reducing Ethereum's data overhead. Consequently, L2s have the option to bypass the main Ethereum layer and directly post to Blob Space.\n\nThe Blob Space layer of Ethereum has its own gas prices that abide by the same rule set as Ethereum’s regular execution layer. The result is that transactions from L2s to publish data no longer have to compete with regular Ethereum transactions for blockspace. The dedicated transaction layer is also designed to price the cost of data much cheaper than posting to Ethereum as call data. At the time of writing, the Data Blobs have reduced gas usage charges to L2s by (-96%).\n\nL2 Data Publishing Costs to Ethereum (ETH)\n\nSource: Dune @niftytable, Artemis XYZ as of 3/19/2024. Not a recommendation to buy or sell any of the names mentioned herein. Past performance is no guarantee of future results.\n\nLayer-2s Off-Chain Cost Structures\n\nThe first part of the off-chain cost expense for Layer-2s (L2s) are the sequencers they use for ordering transactions. This is basically just a high-end server that sits in a data center. For most L2s, the foundation or business entity behind that L2 pays for the cost of the sequencer. In the grand scheme of things, the costs of running the sequencers themselves are minor at around $1000 to $2000 in equipment and perhaps another $3000 to 5000 in manpower per month. This cost is consistent for both Optimistic Roll-Ups (ORUs) and Zero-Knowledge Roll-Ups (ZKUs).\n\nA lesser discussed but significant cost element for ZKUs involves the operation of provers. Unlike sequencers that produce the state root, the provers are responsible for creating the zk-proof that undergoes verification on the Ethereum network. This computational process usually takes place on cloud computing platforms like AWS.\n\nAccording to the decentralized zk prover project Gevulot, the costs of the proof will run between “10-20% of the cost of verification on Ethereum.” Additionally, these costs scale with the amount of transactions that are being generated by each L2s. ZKUs are faced with a balancing act between costs and user experience, with the option to reduce the frequency of proofs posted to Ethereum as a potential cost-saving measure. Through a process known as recursion, ZKU provers can consolidate several proofs into a single submission, which, while increasing off-chain computational demands, can optimize the economics by mitigating the costly proof verifications conducted on Ethereum.\n\nAt the time of writing, all ZKUs run their own provers and directly pay for the costs of proof generation. Over time, however, many intend to decentralize proof generation.\n\nEvaluating Layer-2s Across 5 Key Areas\n\nIn our analysis of key Layer-2s, we use five principal variables to measure potential success or failure:\n\nTransaction pricing – the cost to users of transacting Developer experience – the ease of building products and applications User experience – the simplicity of depositing, withdrawing, and transacting Trust Assumptions - liveness and safety assumptions Ecosystem size – how many interesting things there are to do\n\n1. Layer-2s Transaction Pricing\n\nThe root of transaction pricing differentiation comes from a combination of data compression, data posting efficiency, L2 scale, proving costs (for ZKUs), and, most interestingly, the margin each L2 takes. L2s could also time their postings to Ethereum based upon gas prices, but in practice, we have not found empirical evidence to support this possibility. This is likely due to the general difficulties of predicting future Ethereum gas prices.\n\nThe main difference in pricing economics between ZKUs and ORUs is that ZKUs have higher fixed costs than ORUs. This is because ZKUs must pay for proof generation off Ethereum and proof verification on Ethereum. Proof generation/verification is a large, static cost that does not increase significantly as more transactions are covered by each proof. By contrast, ORUs must post full transaction data to Ethereum. Though ORUs employ different compression mechanisms to cut down on data costs, posting to Ethereum is very expensive. Because more transactions on an ORU means more data is to be committed to Ethereum, the costs of posts to Ethereum are increased. However, with the EIP-4844, the costs of posting data to Ethereum have been reduced significantly and these savings have resulted in cheaper transaction pricing for ORUs. Likewise, ORUs also have the option of placing transaction data on even cheaper data availability blockchains like Celestia, EigenDA, and Avail. Currently, Manta Pacific and Aevo post transaction data to Celestia.\n\nIn 2024, the cheapest chains by average transaction cost were Mantle ($0.17), zkSync ($0.21), and Starknet ($0.25). Each chain was able to edge out its competition on pricing using different techniques. Mantle, an ORU, is able to keep transactions cheap because it accepts lower than the average margin (19.9%), uses its own data availability (Mantle DA) for full transaction batch posting, and updates its state root updates to Ethereum, the second least frequently at every 20.7 minutes. zkSync, a ZKU, was able to price transactions inexpensively due to the high volume of transactions (94.9M), the highest of any L2, that made its proving system highly economical. Meanwhile, the ZKU chain Starknet settled to Ethereum the least often of any of the top 10 L2s, once every 57.8 minutes, while also posting only state differences in place of full transaction data. These two-cost savings resulted in the least amount of data per transaction being settled to Ethereum. Curiously, we estimate that Starknet lost -$0.09 per transaction through March 13, 2024.\n\nCompetitive Differentiation of L2s\n\nData for 2024. Source: Dune @niftytable, Artemis XYZ as of 3/13/2024. Not a recommendation to buy or sell any of the names mentioned herein. Past performance is no guarantee of future results.\n\n2. Layer-2s Developer Experience\n\nDeveloper experience is another important point of competitive differentiation for Layer-2s. The root understanding of making the developer experience easiest was to implement EVM compatibility. This means that smart contract code, tooling, and developer libraries could be ported over directly from Ethereum to be used on the L2. This is believed to give each L2 an advantage because of Ethereum’s large network of developers. Currently, the vast majority of L2s are EVM-compatible. However, ZKUs often have subtle differences that developers must adhere to due to the limitations of zero-knowledge proofs.\n\nSome developers have also argued that adherence to EVM compatibility is a disadvantage because EVM places significant limitations on blockchain capabilities while boxing out developers who are more familiar with other computer languages. For example, Starknet smart contracts are written in a language called Cairo, which is more efficient for the zero-knowledge scaling of Starknet. Of course, this comes at the tradeoff where anyone deploying to Starknet must learn the complexities of Cairo. Movement Labs is another L2 developer who is allowing smart contracts to be written using the Move language which appeals to developers who know want to learn Move. And for those who are more familiar with the programming language of Solana called Rust, Eclipse is building a Layer-2 blockchain that runs in a Solana Virtual Machine. This is even expanding to other languages like Web Assembly, as Fluent has created a general-purpose L2 which supports WASM.\n\n3. Layer-2s User Experience\n\nUser experience is another plank by which Layer-2s compete with each other. The most basic component of this is onboarding assets and removing assets from an L2. For the most part, onboarding is not significantly differentiated between L2s, with the exception that some Centralized Exchanges (CEXs) allow for native assets to be moved to each L2. For example, Kraken allows users to withdraw USDC to Arbitrum and Optimism, whereas Coinbase allows USDC to be ported to Optimism and Base.\n\nFinality—the point at which transactions on an L2 become irreversible—marks a significant divergence in the user experience between Optimistic Roll-Ups (ORUs) and Zero-Knowledge Roll-Ups (ZKUs). For ORUs, finality occurs after the fraud challenge period ends, while for ZKUs, finality occurs once a state root and its proof have been posted to Ethereum. One consequence of finality differences is withdrawals off of an L2. For an ORU, 7 days must pass before a user can move his or her funds back to Ethereum. For a ZKU, this same process can take as little as an hour, and this depends on how frequently the ZKU posts settlements and proofs, as well as each chain’s safety system. While zkSync posts proofs every 6 minutes and state updates every hour, users must have a 24-hour wait period before assets can be bridged to Ethereum due to zkSync’s safety modules.\n\nCurrent Throughput and Latency\n\nSource: VanEck Research as of 3/19/2024. Not a recommendation to buy or sell any of the names mentioned herein. Past performance is no guarantee of future results.\n\nWhen users interact with L2s, familiar tools and interfaces are paramount. The adoption of familiar wallets and blockchain explorers from Ethereum to L2s greatly enhances user comfort. This seamlessness is pivotal, as most L2s employ analogous experiences to Ethereum, ensuring a minimal learning curve for those moving across platforms. In the realm of quantifiable user experience metrics, latency and throughput stand out. Latency refers to the time it takes for a transaction to be acknowledged by the network after submission, while throughput measures the network's capacity to handle transactions per second.\n\nThe slowest block time, or Round-Trip Time (RTT)—the duration for a user's transaction to reach the sequencer and for the confirmation to be received back—typically defines an L2's latency. Arbitrum, for instance, boasts the potential for extremely low latency at 0.25 seconds, though actual latency may vary based on geographical factors and the user's proximity to the sequencer, which is speculated to be located in a Silicon Valley data center.\n\nzkSync is noted for having the highest theoretical throughput, capable of processing up to 434 swap transactions per second. However, both latency and throughput are adjustable parameters within L2 networks.\n\nThe current bottlenecks for ZKUs are the speed at which their provers can handle incoming transactions, while ORUs are constrained by the efficiency of their transaction data compression and the rate at which Ethereum can absorb this data. At present, L2s voluntarily limit their throughput in alignment with Ethereum's capacity. If an L2 were to use Ethereum’s block space fully—considering Ethereum's current data cap of about 937.5kb per block plus an additional 375kb from three data blobs—this could theoretically expand to approximately 1.3 MB per block, or 110kb per second.\n\nFor a specific L2 like zkSync, which averages 62 bytes per transaction, fully exploiting Ethereum block space could potentially surge to 1764 transactions per second. In contrast, an ORU like Arbitrum, with an average of 255 bytes per transaction, could reach a processing rate of 429 transactions per second under the same conditions.\n\nFurther increases in throughput could be achieved by integrating a Data Availability blockchain such as Celestia. However, this approach raises concerns about compromising user safety, as alternative blockchains may not offer the same level of security assurances as Ethereum. The choice to expand throughput in this manner is a delicate one, requiring a balance between improved performance and the inherent safety that Ethereum's robustness provides.\n\n4. Layer-2s Trust Assumptions\n\nSource: VanEck Research, l2beat as of 3/19/2024. Past performance is no guarantee of future results.\n\nThere are substantial differences in the assurance of safety and liveness that L2s offer users. Safety refers to the blockchain’s properties to ensure that only an account owner can access his/her assets, while liveness refers to the safeguards in place to make sure assets can be utilized. As L2s rest upon a single sequencer who both orders a block and “proposes” it to the L1 (Ethereum) for settlement, the sequencer failure is the chief concern for L2 users. This is because each L2 currently operates a single sequencer, and if it fails, that L2 cannot process transactions. While assets cannot be stolen in the event of an outage, they also cannot be accessed by users until that outage is resolved. At the same time, if a malicious entity is able to take over a sequencer, it is possible they could mint fraudulent transactions to take the assets off an L2. The current point of weakness of all L2s is they each operate only one sequencer and that sequencer is usually centrally operated by the foundation behind the L2.\n\nL2 builders realize the issues posed by sequencer failure or takeover, and some implement novel safety valves. These differ depending on the L2 and its safety. To complicate matters, some of these safety measures open up the possibility for other attack areas. Some of the guard rails created to protect users include allowing users, under certain conditions, to remove assets, submit transactions for the L2 blockchain by using the L1 host, or even propose L2 blocks. Mostly, these conditions occur when there is a clear failure somewhere in the L2 system.\n\nSome L2s are developing frameworks where anyone can be a sequencer as well as allowing for multiple sequencers who each take a turn sequencing. This would be accompanied by people running the sequencers to put up an economic bond (most likely each L2 native token) to create penalties for cheaters. Companies like Espresso, Astria, and Fairblock are examples of projects that are building software for decentralized sequencers. Currently, the L2 Metis is furthest along in pioneering decentralized sequencers on its L2. Metis’s community has recently passed a governance vote that creates the framework for decentralizing its sequencer and allowing for multiple sequencers to exist.\n\nThe next point of trust assumption variation, one we discuss above, is referred to as “data availability.” While ZKUs provide proof that state updates are correct, ORUs provide evidence to allow anyone to prove that a state update is incorrect. In both cases, however, it is important to understand where the data comes from to generate proofs for either ZKUs or ORUs. Ideally, this data would be readily “available” on the L1 (Ethereum) so that anyone could verify the underlying data that generates proof. Blockchains such as Immutable X and Metis, keep full transaction data on other locations. Though ZKUs do not need to post full transaction data, chains like Linea and Polygon zkEVM do, while Starknet and zkSync simply post state differences. Additionally, L2s post the data to Ethereum, while others post it to dedicated data availability blockchains like Celestia. Posting data on other chains arguably makes an L2 less safe than Ethereum because it introduces new trust assumptions.\n\nAnother interesting dynamic for ORUs is that, as it stands, almost none of them allow for fraud-proof. This means that anyone using them is subject to censorship (transactions not going through) by the sequencer. The exception to this is Arbitrum, which allows fraud proofs. But even in Arbitrum’s case, only white-listed entities can submit fraud proofs. ZKUs, on the other hand, rely upon the prover (a different entity from the sequencer) posting proof. In the event that the ZKUs prover fails, some chains allow users to submit their own proofs (just do zero-knowledge math!) for transactions to be included on the L2.\n\nRegardless, Layer-2s have many issues with respect to their trust assumptions. However, they currently have hundreds of thousands of daily active users, so it would seem until there is a major issue, no one will care. To simplify our views on the set of safeguards L2s have in place, we rank them from most risky to least risky and find Arbitrum to be the current, although still inadequate, gold standard.\n\n5. Layer-2s Ecosystem Size\n\nBridged TVL of L2s\n\nSource: Dune @21co as of 3/19/2024. Not a recommendation to buy or sell any of the names mentioned herein. Past performance is no guarantee of future results.\n\nThe most important competitive factor of L2s is the ecosystem that each L2 has created. Blockchain is a marketplace of services and digital commodities. The more useful things to do on a blockchain, the more value it will accrue through user transactions, demand for its native token, and network effect. Unfortunately, the metrics that measure blockchain activity do not always properly translate into the value of that blockchain’s ecosystem. Applying Goodhart’s law contends that once a metric becomes important in crypto, there is a higher chance that the metrics become manipulated. This rule becomes even more ironclad when we consider airdrop farmers (see our third paragraph from our January Monthly for an explanation) who are generating meaningless activity to receive a free airdrop of token value.\n\nGenerally, what matters are users who are willing to bring value to a blockchain to engage in meaningful activity to generate fees. In that respect, Arbitrum, Optimism, and Blast have shown they have ecosystems that matter to users as those users have bridged $16.3B, $7.85B, and $2.43B to each respectfully. For the most part, Layer-2s have generated user interest and activity through airdrops of their native tokens. Optimism, for example, has given away nearly 25% of its current floating supply to users in the form of airdrops for activity. Arbitrum has given away over $1.84B in tokens to individuals who have used Arbitrum. Blast has leveraged this concept even further to attract bridged value on the premise that there may be an airdrop of tokens from Blast itself, as well as teams who are building on Blast. Conceptually, Layer-2s compete by giving away, for free, tokens whose value grows as each L2 network grows.\n\nFully Diluted Value (FDV)/Revenue and Market Capitalization (MC)/Revenue\n\nSource: Artemis XYZ as of 3/21/2024. Not a recommendation to buy or sell any of the names mentioned herein. Past performance is no guarantee of future results.\n\nBy measure of the trailing twelve months (TTM) revenue to fully diluted valuation (FDV) multiples, each L2’s multiple exceeds Ethereum’s by a fair margin. However, this dynamic changes if we alter the multiple to being based upon floating token supply rather than fully diluted value. This is an odd disconnect that relates to the release schedule of L2 coins – most L2 projects have only released a fraction of their supply. Realistically, we see L2s trading more on speculation of long-term value accrual rather than current revenue dynamics. We attribute this dynamic to the potential for substantially more future revenues to occur on L2s than on Ethereum.\n\nWe expect L2 revenues to exceed Ethereum’s because Ethereum cannot match the transaction throughput or user experience of L2s. We also increasingly see a state where the general-purpose roll-ups market is consolidated by a few major players. This is due to the network effect of both on chain application composability and shared value. It is also attributed to roll-up frameworks, like the OP Stack or Arbitrum Orbit, becoming dominant and the OP/ARB token accruing value from other L2 or even Layer-3s (blockchains that submit state to the L2s). It is also clear that most roll-ups will eventually move towards the zero-knowledge framework (ZKU) due to its many advantages.\n\nLong-term, we still believe that Ethereum blockspace will be expensive, and one result may be that many L2s consolidate proofs to a unified proving layer that “recursively” combines all proofs of its layer constituents. This may be particularly true in the case of application and sector-specific roll-ups. An example of what a concept may look like is Polygon’s Aggregation. Conceptionally, something like an “Agg Layer” may also vastly improve user experience because it would be more economical to post proofs and state roots often enough to allow for bridging across L2s and Ethereum in seconds rather than hours.\n\nAccordingly, we see cutthroat competition amongst L2s where the network effect is the only moat. As a result, we are generally bearish on the long-term value prospects for the majority of L2 tokens. The top 7 tokens for L2 collectively already have $40B of FDV, and there are many strong projects that intend to launch over the medium term. This means there is potentially $100B more in FDV in L2 tokens coming to market over the next 12-18 months. It seems a bridge too far for the crypto market to absorb even limited amounts of that supply without massive discounts. Additionally, while there are reasons to believe that some L2 tokens will become valuable, the pathways to value accrual are harder to project than they are for other crypto sectors. This is particularly the case since L2 tokens are not even the base money in their own ecosystems.\n\nBeyond the dominance of a few roll-ups among general-purpose L2s, we forecast a future of thousands of use-case-specific roll-ups. These L2 will be segmented by sector, application, or function. Businesses will likely build roll-ups explicitly as their own revenue and/or cost centers like building an asset management Layer-2 chain. Other types of chains may be specifically geared towards hosting a whole sector, such as a roll-up that hosts a social media network, as well as applications that want to build products and services for that social media network.\n\nEthereum Layer-2s Valuation Prediction by 2030\n\nWe find our 2030 valuation for the L2 space by applying an FCF terminal multiple to our expectations of future cash flows. We estimate the revenues that feed these cash flows by:\n\nTransactions Revenues (inclusion of transactions on a blockchain) Estimating the revenue TAM of end markets that could utilize public blockchains Calculating the amount of TAM that will actually use public blockchains Forecasting the Ethereum ecosystem’s market share public blockchains Applying take rates on end market revenues that utilize Ethereum’s ecosystem for settlement and transactions Splitting the transaction value between Ethereum and L2s MEV (ordering of transactions on blockchain) Estimating the value of assets including currency, securities, and digital assets that will be secured by Ethereum’s ecosystem Project DEX volume on Ethereum’s ecosystem by applying an asset turnover estimate to our forecasts for the hosted asset value of the Ethereum ecosystem Multiplying DEX volumes by an MEV take rate to arrive at total MEV value Splitting the value between Ethereum and its L2s\n\nL2 Valuation - Base Case Ethereum Ecosystem Smart Contract Market Share 60% L2 Economics Estimated Revenue 2030 ($M) $48,659 Global Tax Rate on Crypto 15% Sequencer Cut 1% Value to Tokenholders in 2030 ($M) $40,947 FCF Terminal Multiple 25 L2 FDV 2030 ($M) $1,023,681 L2 Projections Transaction Value on L2 90% Ecosystem TVL Layer 2 90% L2 Token MEV Capture (Split to L2) 100% L2 Transaction Capture (split to L2) 66% MEV Revenue MEV LT Take Rate on DEX Volume 0.02% LT L2DEX Volume/TVL Ratio 12 MEV Value Accrual to Token 95% Crypto Terminal Market Share Base Finance, Banking, Payments 5% Metaverse, Social and Gaming 20% Infrastructure 10% Ethereum Ecosystem Value Capture of End Market Revenue Finance, Banking, Payments 3% Metaverse, Social and Gaming 10% Infrastructure 5%\n\nSource: VanEck Research as of 3/21/2024. Past performance is no guarantee of future results. The information, valuation scenarios, and price targets in this blog are not intended as financial advice or any call to action, a recommendation to buy or sell, or as a projection of how Layer-2s will perform in the future. Actual future performance of Layer-2s is unknown, and may differ significantly from the hypothetical results depicted here. There may be risks or other factors not accounted for in the scenarios presented that may impede the performance. These are solely the results of a simulation based on our research, and are for illustrative purposes only. Please conduct your own research and draw your own conclusions.\n\nLinks to third party websites are provided as a convenience and the inclusion of such links does not imply any endorsement, approval, investigation, verification or monitoring by us of any content or information contained within or accessible from the linked sites. By clicking on the link to a non-VanEck webpage, you acknowledge that you are entering a third-party website subject to its own terms and conditions. VanEck disclaims responsibility for content, legality of access or suitability of the third-party websites.\n\nTo receive more Digital Assets insights, sign up in our subscription center."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBPQjlnRWt5bnM3NHV3Y0FZSXkzX040b3JpZG4yMVZ2c1JaVkp6RnZRd09TVlZ5eThTdHNzaEJqZmNrVmgyLU1TcDRtbjRJTnFFUmcxN2hXLTRfdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "What Is Blast on Ethereum? A Beginner’s Guide - Unchained",
        "content": "Blast is a new Ethereum layer 2 that introduces the concept of native yield for ETH and stablecoins.\n\nBlast is a new Ethereum layer 2 network that has made waves after introducing the concept of native yield. Unlike other layer 2 solutions, Blast users can earn yield paid in crypto simply by having certain tokens in their wallets.\n\nRead on to learn about Blast, how it works, and what it is bringing to Ethereum.\n\nWhat Is Blast on Ethereum?\n\nBlast is an EVM-compatible Ethereum layer 2 platform that offers native yield for ether and stablecoins. It operates as an optimistic rollup solution to tackle scalability issues on Ethereum by increasing the network’s capacity for more transactions at lower costs.\n\nBlast’s testnet went live in January 2024, and its mainnet launched in February. The platform, founded by Tieshun Pacman Roquerre (the creator of NFT marketplace Blur), has surpassed $1 billion in total value locked at the time of writing.\n\nThe project is different from other Ethereum layer 2 solutions as it offers native yields for both ETH and stablecoins.\n\nHow Does Blast Work?\n\nBlast yield income for decentralized finance (DeFi) users comes from the concept of Ethereum staking. Ethereum staking is a process on the Ethereum network whereby users can temporarily lock tokens to validate transactions.\n\nTraditionally, managing staking requires individual attention from users. However, Blast simplifies this process by handling staking on behalf of its users within its ecosystem, making it an L2 platform with native yield.\n\nWhen assets are bridged to the Ethereum mainchain within Blast’s network, they are automatically staked, initiating the interest-earning process. Blast’s smart contracts facilitate the collection of this interest, which is automatically redistributed to users in the form of ether (ETH) and stablecoins.\n\nHow Does Blast Offer Yield?\n\nBlast offers a 4% interest rate for ETH and a 5% interest rate for stablecoins like USDT, USDC, and DAI deposited on the network. These interest rates are compounded, meaning they apply to the balance over time rather than the initial deposit.\n\nThe native yield feature is powered by rebasing tokens and is based on the Risk-free Interest Rate (RFR) yield structure.\n\nThe 4% yield on Ethereum is sourced through liquid staking on the Ethereum network. After the merge, the proof-of-stake (PoS) on the Ethereum network offers a 4% APR on staked ETH. Blast utilizes this feature through partnerships with platforms like Lido, leveraging staked user assets for yield generation.\n\nSimilarly, stablecoins bridged to Blast are routed to T-bill protocols, such as MakerDAO, where they generate yields. Blast channels them to MakerDAO’s T-bill protocol, and users receive USDB on Blast. USDB accumulates stablecoin profits over time at a 5% APR, and users can redeem the asset for USDC when they bridge back from Blast.\n\nWhat Does Blast Bring to the Ethereum Ecosystem?\n\nBlast’s main aim is to enhance transaction efficiency on the Ethereum network. The layer 2 solution operates on Ethereum but doesn’t rely on the full processing power of the main chain. The move ensures that transactions remain reliable and decentralized while enhancing scalability.\n\nThe L2 also tackles asset depreciation by providing users with a “risk-free” interest rate, regardless of the coin’s value. By providing both ETH and T-Bill yields, Blast ensures users receive benefits similar to those on the mainchain but adds optimistic rollup services and other layer 2 network scaling solutions.\n\nCompared to Ethereum’s core network, which can only process roughly 15 transactions per second, Blast can process thousands of transactions per second by grouping them together. Thus, transactions can be confirmed more quickly, resulting in a more responsive and seamless user experience.\n\nThe Blast Airdrop\n\nTo participate in the airdrop, users need to obtain an invitation link from their peers through a referral. Users can then register on the airdrop page to claim their sign-up reward. Registered participants can unlock additional rewards by bridging assets to the platform or inviting other users.\n\nNotably, airdrop points are granted based on the value of assets bridged and the number of users successfully referred.\n\nWhile the bridge to Blast is operational, participants in the airdrop campaign can only redeem their accumulated airdrop points beginning May 2024. Part of the airdrop is designated for Season 3 of Blur participants.\n\nFurthermore, part of the airdrop is set aside for developers, particularly winners of the Big Bang contest and mainnet dApps. Developers can reallocate their airdrop points to users, thus enhancing liquidity and expanding the user base.\n\nChallenges and Controversies Associated With Blast\n\nThe crypto community has raised some questions regarding the project’s operations and the validity of its promises.\n\nBlast’s holding contract for deposited assets is safeguarded by a multi-signature mechanism involving five participants. At least three of these participants must consent to approve any withdrawal request. However, the identities of these five participants remain undisclosed, as the project founder operates under a Twitter pseudonym. Furthermore, the criterion for signature approval remains unclear.\n\nFurthermore, questions have been raised regarding the rebase structure and the native yield arrangement. While Blast developers and project partners have strongly supported the project, comments on the rebase token design suggest differing opinions on its feasibility and efficiency.\n\nThe network’s security has also recently become an issue. Munchables, a GameFi platform operating on Blast, disclosed recently that it experienced a security breach resulting in a loss of $62 million. Additionally, an associated vault on Juice Finance avoided a $25 million loss due to a typographical error.\n\nHowever, unlike other hacks, the hacker lacked leverage due to Blast’s multiple centralized components, which eliminated any chance for the attacker to attempt to launder the stolen funds. Eventually, the attacker relinquished control of the private keys.\n\nConclusion\n\nBlast has gained traction, achieving a total value lock (TVL) exceeding $1 billion. The network aims to transform the crypto and gaming industries by providing a layer 2 solution with native yield.\n\nHowever, the project is still in its early stages and has much to prove, including liquidity efficiency and native yield arrangement over time."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBOcVliN2N4OHBLZWstam9mcXd1bXdKTU1JWFF5Y2NWQzdySWpCZHF6VGlaR29La2NJMjloRElPMERQZ2FKME1GSEZRUGtXSTB2cHZ0ZzZ6VFhnUzFPYjRpRHN2emFJMkNNQ0ZzMHIzM2FzSURr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Picasso connects Ethereum to Cosmos IBC - Blockworks",
        "content": "Interoperability and staking hub Picasso Network has successfully integrated the Inter-Blockchain Communication (IBC) Protocol with Ethereum.\n\nThis means that Ethereum can now transfer assets and data natively with the Cosmos Hub, Polkadot and Kusama via IBC. According to Picasso, more chains will be connected in the near future, including Solana.\n\nMost bridging protocols today use the lock and mint or lock and burn method to transfer across blockchains, which can pose a security risk. Other blockchains introduce trust assumptions by introducing third parties who oversee these transactions. For this reason, native bridging is often considered the most secure way for two separate blockchains to transact with each other.\n\nRead more: Rethinking the crypto bridge after year of hacks\n\nIBC originated in the Cosmos ecosystem and enables native bridging of tokens, messages and accounts. To bring IBC to Ethereum, the Picasso team made changes to IBC and created an IBC stack on Ethereum.\n\nAccording to Picasso, there are two light clients involved in the Ethereum and IBC connection. These relayers are responsible for transferring IBC packets between Ethereum and connected chains.\n\n“As the first team to successfully connect Cosmos to Ethereum via IBC, we have achieved a pioneering breakthrough in crosschain interoperability, fulfilling the biggest milestone of our promise we made in 2021 to bring the highest level of security to bridging,” Henry Love, the executive director of the underlying organizational behind Picasso, Composable Foundation, said in a statement reviewed by Blockworks.\n\nRead more: Interoperability isn’t just a buzzword\n\nOsmosis, one of the largest decentralized exchanges in the Cosmos ecosystem, will serve as the primary destination for Ethereum assets and liquidity within the Cosmos ecosystem.\n\n“The shared vision is to allow for a unified and secure crosschain DeFi ecosystem, and connecting Cosmos with Ethereum is both a significant technical milestone and a UX and functionality improvement for users,” Aaron Kong, a growth and strategy contributor at Osmosis, said.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE8yVzktOTRXSklVc3NWSEFaazhSOHQtX21EQnZaaVdMRTJCX0RjM1pGLUp0c1ZyZEJnZm52WW9GbGphMGdhbnZjYmdLdnhRRnJ1UzJQQXFXeDg3cVdESjI3TmtWTWpVRzQ0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "What Is Ethereum Restaking? - Ledger",
        "content": "What Is Ethereum Restaking?\n\nBy Ola Kalejaye\n\nBeginner\n\nSHARE\n\nKEY TAKEAWAYS: — Ethereum restaking is a novel concept that aims to extend the cryptoeconomic security of Ethereum to new protocols while compounding rewards for stakers.\n\n\n\n— The process involves using staked Ether or Liquid Staking Tokens to simultaneously stake on another Ethereum protocol, which some commentators warn could ultimately compromise the base network’s resilience.\n\n\n\n— EigenLayer, the protocol that introduced restaking, sees it as a way to supercharge innovation in the Ethereum ecosystem by establishing pooled decentralized security.\n\nAs the heart of all blockchain networks, the importance of consensus mechanisms can’t be overstated. In the case of the world’s second-largest cryptocurrency, Ethereum, its proof-of-stake consensus model is a crucial part of its security and function. At present, the Ethereum network is shored up by nearly 1 million network validators and over 31 million staked Ether, lending it formidable security.\n\nOf course, creating a network of validators even a fraction of the size of Ethereum’s is a challenging and costly task. This serves as a major roadblock for new and emerging protocols in the ecosystem, stifling what might otherwise be promising innovations.\n\nBut what if there was a way to leverage Ethereum’s established security for new projects being built on the network? Could that unlock a whole new level of progress for the ecosystem as a whole?\n\nThat’s the thinking behind Ethereum restaking, a concept that wants to share Ethereum’s validator network for the benefit of new protocols, stakers, and the Ethereum community at large.\n\nBut just what is ETH restaking? How does it work, and are there any risks when it comes to restaking your ETH? In this article, Ledger Academy will walk you through all of that and more.\n\nEthereum Staking and Restaking: Explained\n\nTo understand restaking, let’s take a step back and look at what staking is and how it works on the Ethereum network.\n\nHow Does Ethereum Staking Work?\n\nEthereum staking is the basis for the network’s proof-of-stake consensus model. One way to look at staking is as a collateral system that helps keep Ethereum secure.\n\nIf someone wants to act as an Ethereum validator, they must first put up a stake of (at least) 32 ETH. In return for processing transactions, they receive staking rewards. Conversely, if the validator acts dishonestly or does anything that could harm the network, they may lose their staked ETH via a process called slashing.\n\nWhat is Ethereum Restaking?\n\nAs the name implies, Ethereum restaking is the process of taking ETH that has already been staked on Ethereum and using it to simultaneously secure other decentralized protocols. As with normal staking, restaking earns users staking rewards from the protocol(s) they help to secure.\n\nWhile earning extra rewards is a major incentive for restaking, it isn’t the main reason for the concept. The larger idea behind restaking is so that less developed protocols can take advantage of Ethereum’s robust community of network validators: something that is costly and resource-intensive to do otherwise.\n\nNotably, the restaking mechanism did not come about as the result of an Ethereum Improvement Proposal (EIP) or the Ethereum Roadmap. Rather, it was designed by a third-party protocol, EigenLayer.\n\nEigenLayer: The Origin of ETH Restaking\n\nFounded in 2021, EigenLayer is an Ethereum middleware platform, which simply means that it sits between the Layer 1 network and other applications, allowing them to interact. As of yet, EigenLayer is the only decentralized protocol that offers ETH restaking.\n\nEigenLayer deploys Ethereum smart contracts that allow stakers to restake their ETH on compatible protocols. The platform also acts as a staking marketplace, allowing the three main parties involved—stakers, network validators, and protocols—to find each other.\n\nSince its initial launch in June 2023, EigenLayer has enjoyed massive growth, becoming one of the largest blockchain protocols out there. Over $10 billion worth of ETH has been restaked through EigenLayer, giving it a higher total value locked (TVL) than major DeFi platforms such as Aave, Rocket Pool, and Uniswap.\n\nEigenLayer’s rapid ascent speaks to an obvious demand for restaking and the added rewards that it brings users. But how exactly do users earn these rewards? To understand fully, let’s dive into how Ethereum restaking works\n\nHow Does Restaking ETH Work?\n\nCurrently, EigenLayer is the only option you have to restake your ETH. So let’s explore how this project approaches the mechanism.\n\nSmart Contracts: EigenPod\n\nRestaking on EigenLayer allows its smart contracts to place additional slashing conditions on your staked ETH. This is how EigenLayer extends Ethereum’s security to the protocols In its ecosystem, which it calls Actively Validated Services (AVSs). If a restaking validator doesn’t perform their duties for their AVS, they are subject to having their ETH stake slashed.\n\nThis happens through on-chain slashing contracts and specific smart contracts called EigenPods. You can think of these as an additional account that sits between a restaker’s wallet and their stake. Staking withdrawals and rewards all have to go through the EigenPod before going to a validator’s account, which gives EigenLayer the ability to enact penalties on validators who act poorly.\n\nNative Restaking vs. Liquid Restaking\n\nNative restaking follows a similar process to natively staking ETH, meaning that this option is only available to those willing to run (or already running) an Ethereum validator node. The only difference with native restaking is that an EigenPod becomes the withdrawal address for your stake.\n\nAs for liquid restaking, it’s important to first consider how liquid staking works.\n\nSimilarly to native staking, liquid staking involves locking tokens up in a smart contract. The key difference, however, is that the liquid staking platform then gives you liquid staking tokens (LSTs) in return. You can then use these LSTs as you would any other token on DeFi applications. Liquid restaking, therefore, is when users deposit LSTs into the EigenLayer contracts.\n\nEigenLayer currently supports staking for 12 LSTs, including popular options like Rocket Pool Ether (rETH), Lido Staked Ether (stETH), and Coinbase Staked Ether (cbETH).\n\nSignificantly, some platforms expand liquid restaking utility even further. For example, the protocols Renzo and EtherFi both serve as liquid restaking platforms for EigenLayer. These protocols accept users’ LSTs and give them Liquid Restaking/Receipt Tokens (LRTs) in return.\n\nSeveral liquid restaking platforms have emerged recently, looking to expand restaking utility even further. Similarly to liquid staking, users restake their LSTs with these platforms and receive Liquid Restaking/Receipt Tokens (LRTs) in return.\n\nDelegation\n\nOnce you have successfully staked your ETH or deposited your LSTs, you then have to delegate your stake. The entities that you delegate to – the ones directly helping to run Actively Validated Services on EigenLayer – are called operators.\n\nSimilarly to staking ETH, there are two options here. You can either act as an operator and self-delegate, or you can delegate your stake to an existing operator. While simply delegating your stake to an operator is the simplest option, self-delegation gives you more control and responsibility. Importantly, stakers can not dictate to operators what AVS they operate.\n\nWhat Are the Benefits of Restaking ETH?\n\nMore Rewards for ETH Stakers\n\nThe clearest benefit of restaking Ether is that it compounds rewards for stakers. While the exact rate of staking rewards fluctuates over time and varies depending on the staking platform, ETH stakers can expect an annual percentage yield of roughly 3%. In other words, you would earn around 3% of the amount you stake over one year.\n\nBy restaking, you can supplement your ETH staking rewards with rewards from multiple other protocols. Of course, the rate of rewards will depend on the specific AVS that your staked ETH is going towards.\n\nLower Costs for Startup Protocols\n\nThe other major benefit of ETH restaking is how it lowers costs for new protocols being built on Ethereum. To explain, before the arrival of restaking, new protocols would have to go through the costly process of developing their own validator networks. Thanks to restaking, new protocols can now take advantage of Ethereum’s well-developed validator network. This concept, where decentralized protocols can share validator-powered security, is known as pooled security.\n\nAvoids Layer 2 Restrictions\n\nDue to the high costs associated with launching a new protocol on Ethereum, projects previously went to Layer 2 blockchains as a solution. While these networks can lower costs for new protocols, they also come with some drawbacks.\n\nThe design of some Layer 2 chains can lead to certain constraints on protocol architecture such as customization options and the kinds of transactions a protocol can access. Staying and building on Ethereum and using the pooled security that restaking brings means that protocols are freer to build the architecture that best suits their needs, without constraints.\n\nBesides being good for the individual protocols, this is also a major benefit to the Ethereum ecosystem as a whole. The more protocols that can be built on Layer 1, the more innovation can happen without liquidity siphoning off to other chains.\n\nWhat Are the Risks of Restaking?\n\nIncreases The Risk of Slashing\n\nAs previously mentioned, slashing is a vital component of proof-of-stake systems that helps to keep participants honest. That being said, the nature of slashing means that it can also have negative consequences for people even when they’re not doing any explicit harm to the network.\n\nFor example, many ETH stakers do not act as network validators themselves, meaning that they simply delegate their stake to a validator. If their delegated validator behaved poorly, these stakers could still stand to lose their stake to slashing.\n\nSlashing can also be a risk even for validators who are acting honestly. To sum up briefly, because validators can get a slashing penalty if their node goes offline, many validators set up backup rigs. However, if the network detects the same validator keys coming from two different servers, it also punishes this with slashing (to prevent double-spending).\n\nThat’s all to say that, no matter how it is done, staking always comes with some level of slashing risk. Therefore by restaking, you are necessarily increasing the risk that you could become subject to slashing.\n\nEffect on ETH Liquidity\n\nAlthough restaking arguably works to keep more ETH within the ecosystem, you must remember that staked ETH is not available. Not to mention that even when you unstake your restaked ETH, you will likely have to wait longer than you would otherwise to withdraw it.\n\nCentralization Concerns\n\nIf more restaking protocols like EigenLayer entice enough people with the promise of higher staking rewards, this could lead to fewer independent stakers, and more people staking via such protocols. This effectively causes staking to become more centralized over time.\n\nConcerns Around LRTs\n\nAs previously mentioned, the growth of restaking has brought about a new class of instruments: liquid restaking tokens (LRTs). As these tokens mimic the surge in popularity of LSTs, it’s important to be aware of the risks they carry.\n\nFor one thing, there’s the convoluted nature of LRTs. After all, an LRT is a token representing a staked token, which is itself a representation of a staked token. This added complexity raises questions on exactly how LRT providers will distribute losses and gains.\n\nAdd onto this the newness of the asset class, and there are likely to be some hiccups as platforms look to hook new users with promises of large yields and unproven tokenomics.\n\nPotential Effect on Ethereum’s Social Consensus\n\nFinally, some believe that using Ethereum’s validator network as the basis of pooled security can have a destabilizing effect on the base network. One such critic is none other than Ethereum co-founder, Vitalik Buterin.\n\nIn a May 2023 blog post, Buterin examines the growing trend of protocols leveraging Ethereum’s validator network and argues that certain use cases can introduce high systemic risks to the ecosystem. Specifically, Buterin warns that protocols relying on Ethereum’s social consensus could be a slippery slope.\n\nEthereum’s social consensus refers to the large global community of Ethereum developers and other users, who are constantly monitoring the network. This social consensus is vital for the health of the network, as the community can always act to secure the network if its cryptoeconomic consensus fails due to a bug or attack.\n\nButerin’s concern is that the people building protocols could begin to view hard forks as a way of bailing them out if anything goes wrong. Ultimately, he goes on to say that as long as projects only seek to use Ethereum’s validator set, and not its social consensus, they remain low risk. Notably, EigenLayer founder, Sreeram Kannan, agrees with Buterin’s conclusions, reiterating that an Ethereum fork should never be viewed as a potential solution for a protocol’s issues.\n\nHow To Restake ETH on EigenLayer\n\nThere are two ways to use EigenLayer to restake Ether: native restaking and liquid restaking.\n\nHow to initiate Native restaking on EigenLayer\n\nHere’s how you can natively restake ETH on EigenLayer:\n\nConnect your wallet to the EigenLayer App, ensuring you are connected to the Ethereum mainnet. Click “Create EigenPod” If you are successful, you will see the EigenPod address come up on the right of your screen. Now that you have your Eigen Pod address, you can deposit your 32 ETH stake to the Beacon Chain just as you normally would to stake ETH. The key step here is that you must set the EigenPod address as the withdrawal credentials for your staking rewards. Once you deposit your stake, it takes about four hours to finalize. After that, you’re free to choose an operator to delegate your stake to.\n\nHow to initiate Liquid restaking on EigenLayer\n\nIf you’re looking to get involved in liquid staking you can take the following steps to deposit your LSTs into EigenLayer.\n\nRemember, you can easily exchange ETH for LSTs through Stader Labs or Lido directly from Ledger Live.\n\nConnect your wallet to the EigenLayer app, ensuring you are connected to the Ethereum mainnet. Select the LST you want to restake from the list. Enter the amount of LSTs you want to restake and click “Deposit”. If it’s your first time depositing an LST you’ll need to set a token approval in order to restake. After confirming the token approval, you can confirm the deposit transaction. If the transaction is successful, you’ll see your deposit in your “Restaked balance” on the app.\n\nThe Future of Ethereum Restaking and Pooled Blockchain Security\n\nAll in all, Ethereum restaking is a thoroughly exciting proposition that has brought the concept of pooled security to the forefront of blockchain innovation. Not only can it increase the benefits of staking Ethereum, but it also creates exciting opportunities for up-and-coming blockchain protocols.\n\nAnd if you’re ready to jump into the world of Ethereum staking and staking rewards then look no further than Ledger! Staking Ether on Ledger Live couldn’t be easier. When paired with the power of self-custody unlocked by Ledger hardware wallets, you’ll have everything to take on the world of Ethereum staking.\n\nSo what are you waiting for? Find the Ledger device that’s right for you and start enjoying the freedom of secure self-custody."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPVnJ6dF9RWkNIQ1BrOWh4VDJFRkhOVl9HYU9vWTN4bDk2WFVzTXVoblVQOU5zQmIweWQ1RVhZbjRQdVVhMlpwTGwwZjAwTHpWb3k3YnFlUWVSVEFfYnY2NTlteGRvVHRaa1pIWXRuZkNxNXZmcEpCU19UQmFuM2NzeHNJajVnanExbzY4SlcwZEdpVDd5YmJ3ZVFiVm5sdG9Fc19jdk5R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Digital Graffiti Gums Up Ethereum’s Latest Update - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQNnFHc2ZJNjJrTmo2Q1Y5bzBpWHFvVFlOUG9SRFpaMmFERE5GYjQ5OFV3MkRuREZESWRfbjVLYm0xVE92TVVVZzNzMlpuMF9rdE1ZRUlHVDZnXzN1ZUlnY1hkZk9YR3NqTGVFRDRSS0dHZTM3TWJvRFhGTldnYmV0QnlzVFl2RU9SaWhtNDd0STMtN2Z6OGpENmRJcS1ZU0FwY0FFMjEzWmw2Zy1kWGhpTkZ6ZlAxUmvSAbwBQVVfeXFMTk1ZWWpabjJ0MGJ0N1JBVVRlTUtIdWI4VUxvTkhabFFMTXFaeVBjX2Q5UUczOTZzb2NFVnpFcFJlai1oNGZ1cldIcXZNTUJmc3ZMYzc3WjRJdUwzdHBZNC0zbUdoUFQ2bElGN0Zuc3pLWURoYWNwUTVNbm5MeldRUlNPVlBUTlRVQkFVSmhuS3VhbnBRMUExUHVKRlFXYlFscF9JMVpzaGlUY0NlNTg1MEJ0V2J5cWl2Yjg1QWk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Layer 2s Could Rocket to $1T Base Valuation by 2030, VanEck Says - CoinDesk",
        "content": "Transaction Pricing: The cost to users for transacting on L2 networks is a critical factor for attracting users. Differentiation in transaction pricing stems from factors such as data compression, scale, proving costs, and profit margins.\n\nDeveloper Experience: Ethereum Virtual Machine compatibility is paramount for L2 networks to attract developers, ensuring seamless porting of smart contracts and tooling from Ethereum.\n\nUser Experience: The speed of onboarding assets and withdrawal processes ultimately shapes the user experience.\n\nTrust Assumptions: Building trust around data availability on an L2 and steps in place to prevent exploits and hacks."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9vX25Ya051LU5NZ2FyUnJVSHdhY2NCY3B2bFhJWXZqV3NmamlyRnZ2cU0wNjc4MTNHTEtDa0tyaWF3RHJieEgzdGh2M0IwUFllc3h3bjFHdW4yRnVoeV9MTHV1ZUU2SHpOeG5xQXExSXHSAXhBVV95cUxQUHJDNjRoMVNfS3Q2ZXFvaGFCcFNkUE1ZX1ctdUtnQTBQSEFad2hQTDdlSWQ2SEh4ak9qcXRBenU2NW93b3FWbW9IRTZyal96NC1Sdko4YVRXdU1SVDZhelVUVVNPTHFoemJTRmllNFRQRWxvVU0ybTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Can Still Avoid Being Labeled a Security, Says JP Morgan - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWhether Ethereum (ETH) is a security or commodity has been a hot topic for some time now. But banking giant JP Morgan’s analysts say that it could avoid being designated as a security due to the increased decentralization of the project.\n\nThe firm issued a report Wednesday highlighting a drop in the amount of Ethereum being staked through one of the largest staking projects in the industry.\n\n“In another positive for the Ethereum network, the share of Lido in staked ETH has decreased further from around one third a year ago to around a quarter at the moment,” the report said. “This should reduce concerns about concentration in the Ethereum network, thus raising the chance that Ethereum will avoid being designated as security in the future.”\n\nAD\n\nAD\n\nIn the crypto world, staking is when users pledge cryptocurrency to the network to keep it running. Ethereum requires staking because it now runs on a proof-of-stake blockchain—which uses validators instead of miners to secure the network.\n\nSome raised concerns that ETH was becoming more centralized as a result of its transition to proof of stake because centralized entities like Lido, Coinbase, Kraken, and Binance were where most of the staking was being done.\n\nJP Morgan noted that the Securities and Exchange Commission (SEC) had previously acknowledged that tokens on a sufficiently decentralized network are no longer securities because there is no “controlling group.”\n\nThe SEC’s position on Ethereum as a security is important as it currently weighs multiple applications for a U.S. spot Ethereum exchange-traded product. The SEC has gone after many crypto companies it deems are breaking laws for selling unregistered securities. The federal regulator has opened a public comment period on proposals from three major players looking to enter the space.\n\nThe price of Ethereum now stands at $3,418, per CoinGecko data, up nearly 3% over the past 24 hours.\n\nAD\n\nAD\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPa3BfUG9kN25lVEpsSC1BemgwNE5xVlhra1c4LTJQWm1uM0swMVlTeTVudk12S0RPbEt1VDBobDlqT0xCbDF6MlhGUTZqa0thZ2Y4aXJFTk9PMEQ4S01mWkcxd1g0dk90eHJ5amJDQTFDTVRoR1BUWWJ0ZGNkY2NvQlozbElwd3lxaFhxb2lHOU8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Mastering Crypto Investing: A Guide to Ethereum (ETH), Solana (SOL) and Furrever Token (FURR)in the Face of Market Turbulence - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, April 03, 2024 (GLOBE NEWSWIRE) -- In a world where cryptocurrencies represent not just a form of currency but a burgeoning ecosystem of innovation and community, Ethereum (ETH), Solana (SOL), and Furrever Token (FURR) stand as beacons of the varied paths digital currencies can take. As ETH and SOL navigate through the choppy waters of market volatility and technical resistances, FURR emerges with a promise of novelty and community-centric appeal, charting a course towards a different kind of success. This juxtaposition of the established giants against an up-and-coming contender like FURR highlights the dynamic and ever-changing nature of the crypto market, illustrating the diversity of strategies and outcomes within this digital frontier.\n\nEthereum's Struggle: Failing to Break $3,650 Resistance Amid Market Volatility\n\nEthereum (ETH) navigates a stormy sea in today’s unpredictable crypto market, feeling the ripple effects of Bitcoin's recent downturn. Efforts to surpass the formidable $3,650 resistance barrier have yet to bear fruit, stirring anxieties within the investment community.\n\nAfter a stern rebuff at the $3,650 milestone, Ethereum's valuation took a steep dive, breaching successive supports at $3,550, then $3,500, and $3,450, before stabilizing around the pivotal $3,320 mark. Despite a flicker of resilience, with values inching above $3,360, the path to recovery is fraught with hurdles, notably staying above $3,500 and the critical 100-hour Simple Moving Average.\n\nImmediate resistance looms at $3,400, with a more daunting challenge at $3,420, just shy of the trendline. Should Ethereum conquer the $3,450 resistance, a surge towards $3,720 might be on the horizon, pending a decisive breach of $3,650. Yet, ambitions of reaching $3,880 hang in balance, contingent on overcoming these obstacles.\n\nThe immediate future for Ethereum is laced with uncertainty. Failure to breach the $3,420 mark could precipitate a further descent, with initial support pegged at $3,320. Dropping below this threshold could target lower supports at $3,250 and, more critically, at $3,220. With technical indicators like the hourly MACD signaling waning momentum and the RSI stuck below 50, the outlook leans bearish. Nonetheless, surmounting the $3,420 hurdle could ignite a recovery, offering a glimmer of hope amidst the gloom.\n\nSolana's Market Dynamics: A 9% Dip Contrasted with $4.6 Billion TVL Growth and Investor Optimism\n\nSolana (SOL) finds itself at a critical juncture, facing a 9% decrease in its trading value, now hovering around $179. Despite this dip, the ecosystem around Solana remains vibrant, evidenced by a remarkable increase in total value locked (TVL) in its decentralized applications (dApps), exceeding $4.6 billion. This boost, driven largely by the meme coin craze, marks a significant leap in the platform's adoption, hinting at a bright future for SOL's pricing trends.\n\nThe premium on the Grayscale Solana Trust (GSOL) showcases an enduring optimism among institutional investors towards SOL, reflecting a strong conviction in the long-term viability and expansion of the Solana ecosystem.\n\nYet, SOL faces challenges in overcoming the $197 resistance level, with its price oscillating around $184. Although it has seen some upward movement, sustaining gains above $197 remains a challenge, pointing to immediate hurdles in price stability.\n\nSOL’s price movement is influenced by a combination of factors, including significant transactions, technical analyses, and market sentiment. Notable large-scale transfers to Coinbase, amounting to more than 800,000 SOL, suggest potential market pressure that could lead to selling. Technical indicators like the Relative Strength Index (RSI) and Money Flow Index (MFI) indicate a slowdown in purchasing momentum, possibly foreshadowing a price drop. Furthermore, a decline in derivatives market interest hints at a temporary softening in SOL’s market strength.\n\nDespite these short-term challenges, the underlying strength of Solana's ecosystem and the continued interest from investors suggest resilience and the possibility of a recovery in SOL’s value. As the market conditions evolve, investors are encouraged to consider these dynamics carefully while navigating Solana's fluctuating landscape.\n\nEnthralling the Digital Economy: Furrever Token's Pre-Launch Success with $614K and a Vibrant Cat-Themed Community\n\nAmidst the ongoing fluctuations that have challenged stalwarts like Bitcoin (BTC) and Ethereum (ETH), the Furrever Token (FURR) makes a remarkable entry into the cryptocurrency arena, bringing with it a wave of novelty and enthusiasm. In a time when the crypto giants are facing instability, FURR carves out its niche with an innovative and delightful approach centered on cat motifs, offering a refreshing oasis in the digital currency landscape.\n\nFurrever Token is not merely a means for transactions; it embodies a vision aimed at infusing the cryptocurrency ecosystem with positive vibes and a sense of unity. Leveraging adorable cat-themed designs, from stickers to emojis and beyond, Furrever Token breaks away from the conventional blockchain project mold, crafting an immersive and joyful experience for its community. This initiative does more than attract financial interest; it cultivates a spirit of fellowship and shared delight among its expanding circle of supporters.\n\nThe carefully planned tokenomics of Furrever Token is at the heart of its lofty aspirations, featuring a total supply of about 9 billion tokens, a significant fraction of which was reserved for its presale. This approach is integral to FURR's mission to guarantee broad distribution and facilitate investor access, all while upholding stringent standards of openness and security, including conducting smart contract audits and securing team tokens to affirm the project's commitment to durability and trust.\n\nDemonstrating considerable promise and drawing investor attention during its presale, Furrever Token has successfully gathered over $610,000, signaling a robust interest from the market. With its pricing poised for growth, Furrever Token is set on delivering more than just economic benefits; it is nurturing an active, inclusive community.\n\nWith sights set on its imminent launch on decentralized exchanges such as PancakeSwap, the excitement around Furrever Token continues to mount. This upcoming phase is expected to not only broaden FURR's horizons but also enhance community interaction, driven by genuine engagement and careful moderation.\n\nThe rise of Furrever Token reflects the shifting paradigms of the cryptocurrency world, presenting an inviting and warmhearted alternative amid the unpredictable swings of the market's giants. Marrying captivating themes with a solid foundation and a clear vision for a contented community, Furrever Token stands out as a distinguished and optimistic contender in the realm of digital currencies. On the verge of its launch, Furrever Token is ready to soar in the crypto domain, captivating hearts and minds with its distinct allure and promising prospects for growth.\n\nWrapping Up\n\nThe stories of ETH, SOL, and FURR within the cryptocurrency market are tales of persistence, innovation, and community. They reflect the multifaceted nature of the crypto world, where success can be measured not just in price gains but in the strength of ecosystems, the loyalty of communities, and the ability to weather the market's inherent volatility. As each token carves its path within the digital economy, they collectively underscore the breadth of possibilities that cryptocurrencies offer, from financial instruments to platforms of community engagement and innovation. In this evolving landscape, the future of crypto remains not just as a testament to technological advancement but as a reflection of the diverse values and visions that drive the crypto community forward.\n\n\n\nDiscover the Most Exclusive Presale Opportunity of 2024 Now:\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBxWlhXblVZRjlOUzE2bW92QmpwN093NUc5TXd0aGR5Vk1KRmEwVHVkMDhlN0kxQm13QlJmU0hWZExRMkIyaVlsNWhqcmxkeU1pM19md1N6UTZQNXdVUFZTYjlVNHFocWwwZjhYUUNtell3bGFZbVo2VkF30gF_QVVfeXFMUGVTNmVqVVNaYWhfTnVMbkszOE00emJ3bk1uVUJtY25qbVg2RC12Q0JOeEZCOXoxVWNUQk1qY25VS0FZcm92em9wY2UyRXRBeUxmeWtFeFhZRVpwaGpqU0xGVU1pQVJyMTB1Zml4OTNaOFJzaDB0cHhyMjRjM3hudw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ethereum restaking sparks risk concerns: Coinbase - Forkast News",
        "content": "Ethereum restaking protocols have recently surged, locking in nearly US$13 billion in total value and raising concerns about the potential risks they pose to the network’s stability.\n\nAnalysts from Coinbase have highlighted the dangers associated with these protocols, which offer users additional rewards through liquid restaking tokens (LRTs) but also compound risks and incentivize higher risk behavior for greater yields.\n\nDespite these issues, restaking is anticipated to become integral to Ethereum’s new services, providing significant incentives for validators.\n\nThe restaking process, especially through the Eigenlayer protocol, allows users to stake derivative tokens and earn LRTs, which can be restaked for more rewards. This practice can result in funds being repeatedly allocated to similar validators, increasing both yield and risk. The market’s enthusiasm for restaking has sparked debate, with Ethereum developers cautioning against the potential for excessive leverage.\n\nProtocols like Etherfi, Renzo, Kelp, and Puffer have seen a surge in deposits, with Etherfi leading at over US$3.2 billion in total value locked.\n\nThe growth in TVL is largely due to users utilizing EigenLayer to keep access to their funds while enhancing the network’s economic security.\n\nEigenLayer’s framework permits the deposit and restaking of ether from various liquid staking tokens, with the aim of securing third-party protocols.\n\nThe increase in TVL is driven by the capability to restake liquid-staking tokens on EigenLayer, which seeks to bolster the security of other networks such as rollups, oracles, and data availability platforms.\n\nAlthough the opportunity for direct restaking deposits on EigenLayer was temporarily available, LRT protocols continue to welcome ether deposits, restaking them on behalf of users and issuing derivative tokens."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPNUQ2STR0TzlydDUydjZGMTYyMDNuNER6V00tajFrRkhjeGsyQm1TSEtOVjVWbHZ1TC00T0EzSk5lVUUxRndSSlhRZWRLc3BmUmRCLXBHNU1zNHRMWXp6RXpRUEpjd0N3X0xUYy1uUlVaVzBZLVhGNV9GSWFUN3ZpVF9nckF6TWM4TlU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "SEC opens request for comments on 3 spot Ethereum ETFs - CryptoSlate",
        "content": "The SEC has opened comments on Grayscale, Fidelity, and Bitwise‘s applications to launch spot Ethereum exchange-traded funds (ETFs).\n\nThe notices apply to proposed rule changes through which two exchanges — Cboe BZX and NYSE Arca — aim to list and trade shares of the three funds.\n\nComments are open for 21 days following publication in the federal register.\n\nThis phase is a routine procedure in the approval process for ETFs, mirroring the approach taken with spot Bitcoin ETF applications, which previously encouraged feedback from US citizens and organizations.\n\nMarket correlation\n\nEach notice discusses matters that are expected to influence the SEC when it comes time to approve or reject the proposed spot Ethereum ETFs.\n\nMost importantly, the notices discuss correlations between ETH futures and ETH spot markets and whether the spot ETH market is of a significant size related to the futures ETH market. The correlation is relevant because the SEC has previously approved futures ETH ETFs.\n\nNYSE Arca and Grayscale cited an analysis by Coinbase that demonstrates the correlation and shows that fraud and manipulation are unlikely in the spot ETH market. The two companies also said that the Investment Company Act of 1940 does not offer relevant protections that should lead to the denial of certain spot crypto ETFs, contrary to the SEC’s claims.\n\nCboe and Fidelity asserted that their proposal and analysis prove that the spot ETH market is of relevant size. NYSE Arca and Bitwise cited their analysis to that end.\n\nThe notices also seek comment on other issues such as custodianship of funds, creation and redemption models, and sponsor’s fees. Requests for comments are routine and do not indicate whether a fund is likely to gain approval.\n\nEthereum ETFs\n\nThe call for comments arrives after a history of postponed decisions by the SEC regarding spot Ethereum ETFs. The involvement of high-profile fund managers such as Grayscale, Fidelity, and Bitwise emphasizes the significance and growing interest in cryptocurrency-based financial products among traditional investment firms.\n\nThis initiative by the three fund managers aims to establish a spot ETH ETF, enabling investors to purchase shares that reflect the price of Ethereum. Following the SEC’s approval of 11 Bitcoin ETFs in January, which have since seen substantial inflows and popularity, there is a strong push to secure similar regulatory green lights for Ethereum-based products.\n\nNotably, Coinbase held discussions with the SEC last week concerning Grayscale’s Ethereum ETF proposition. Grayscale aims to transform its existing Ethereum Trust into a spot ETH ETF, a move that Coinbase publicly supported in a recent presentation to the regulator.\n\nThe push for Ethereum ETFs comes amid varying market sentiments. While the SEC’s approval of spot Bitcoin ETFs marked a significant milestone, analysts remain divided on the prospects for Ethereum ETFs.\n\nSome speculate that the SEC might delay its approval to create a temporal separation between Bitcoin and Ethereum products. Despite this, entities like Standard Chartered have expressed optimism, anticipating SEC approval by May.\n\nMentioned in this article"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPS0FjSkxTYjYwNUY0U1FaTlJ1dURTRUNEaEhZZjhlOE44aEhocGNSaXlweXJYWUNUaS15ZHA4Q1JIS1NWNnZ4T0ZWb2lOQ01Fb0pKVHY3Y09qY3ZabC01dkczMnhqRXZHU1lDMzY1WHhsWDNWU1ljYTVScFFidnJPOVpGamU2YlVVQ2swbk5WTEdaa29SMUJ4RHN3bUhieEVSdjAxN2pwQ3BMMGNSajh2OE54UW1TbDd6eDhjeXB5SEVHbTdadTFfNkN1a9IB0AFBVV95cUxPRFMtNmt2NFVwaUlXeURaTktNdFphN3BCSzBaVTROTmo2QzBpLTIxcDVEcU9UM1ltU1J1NEp4Zjc0bHFiT2t5eDR4eFAtdDBKbzVsaDFTWW1SUk42Njl2MXc5LVFwT1JteXZIaW0yUm11TGZNSTVqTFVJWGZoZW9HMTRCNFpIdWpGUW1hMURVWlc3ajdRLVZOWDM5VTV6S0l3YkRSZzFJOHdYWHpUcThnOW5BLURRX0w0ZVpZYlhfLUNJQmM3T1ZTbGtSUkZaQjhf?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Analyst Unveils ‘Most Brutal Scenario for Ethereum’ (ETH), Warns Bitcoin (BTC) Could Witness More Losses - The Daily Hodl",
        "content": "A crypto strategist is issuing a warning on Ethereum, saying that ETH is now in the midst of a major correction.\n\nPseudonymous analyst Ali Martinez tells his 56,500 followers on the social media platform X that Ethereum is now bearish after breaking below support at $3,400.\n\nThe trader shares a chart suggesting that ETH may witness an over 14% decline from current levels after confirming a bear pennant breakdown.\n\n“The most brutal scenario for Ethereum right now is breaching the $3,400 support level. Such a move could confirm a bear pennant formation on the daily chart, potentially triggering a major correction for ETH down to $2,800.”\n\nA bear pennant is a technical pattern indicating the continuation of downward price action.\n\nLooking at on-chain data, Martinez says that the $2,850 level may offer support for Ethereum as it is the price area where 1.99 million addresses collectively bought a total of 1.64 million ETH.\n\n“Ethereum dropping below $3,460 is a problem for the bulls! Given the lack of support, it increases the chances for a further ETH correction toward $2,850 or lower.”\n\nAt time of writing, Ethereum is trading for $3,284, down over 6% in the last 24 hours.\n\nLooking at Bitcoin (BTC), the trader says that the crypto king will likely see more downside moves if it starts trading below the 200 exponential moving average (EMA) on the four-hour chart.\n\n“The 200 EMA on the Bitcoin four-hour chart has been formidable support. Since early February, it has prevented BTC from dropping further.\n\nFor this reason, I’m paying close attention to this level because if it holds, it guarantees a rebound, but if it breaks as it did in mid-January, it could lead to more losses for BTC.”\n\nAt time of writing, Bitcoin is trading for $65,592 while the 200 EMA on the four-hour chart is hovering at $65,549.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNR1hnU2pFSUlMSlpiYWhQejJ3UHlyMzYyM2dOTk5UbGstSEpFMzVrT2YxMVV5Nzc1X3dKUjU5bUwxS3dfcmZaNjl2OGs0amFIT3JpdGVUTVN1ZjhvcktoM2phSVZVTjJINGxYaUk5eXVHWEp1OVR5SV8yRC1kV1ZKeA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH-USD) ETFs Could Be on the Horizon - TipRanks",
        "content": "Ethereum (ETH-USD) finds itself at a pivotal juncture, with the Securities and Exchange Commission (SEC) taking significant steps that could shape the future of cryptocurrency investments. The focus on Ethereum ETFs underscores the growing interest and potential for broader acceptance within the investment community.\n\nSEC Seeks Public Insight\n\nThe SEC has initiated a 21-day comment period for Ethereum ETF applications from industry heavyweights Grayscale, Fidelity, and Bitwise. Critical in the evaluation process, this step aims to gauge public sentiment and concerns regarding these proposed investment vehicles. The call for public comments is a procedural formality and a vital part of ensuring that the introduction of Ethereum ETFs aligns with investor interests and market integrity.\n\nWith the May 23 deadline for a final decision on VanEck’s Ethereum ETF application approaching, not many in the crypto space expect it to be approved. Recent SEC actions, including inquiries into the Ethereum Foundation, have cast a shadow of uncertainty over the immediate prospects of Ethereum ETFs. Analysts, while hopeful, prepare for the possibility of a delay beyond the May deadline.\n\nA Strategic Pause for Ethereum?\n\nDespite prevailing doubts about a timely approval, not all industry voices view potential delays as a setback. Matt Hougan, Bitwise’s Chief Investment Officer, presents an intriguing perspective, suggesting that a more gradual integration of Ethereum-based products could benefit the traditional finance (TradFi) sector. Allowing the market to acclimate to Bitcoin ETFs before introducing Ethereum offerings might pave the way for a smoother transition and broader acceptance.\n\nOn the trading front, Ethereum’s price dynamics offer a mixed picture. The cryptocurrency has declined nearly 12% this week, yet it remains above the March lows near $3,050. Traders are closely monitoring the $2,850 support level, aware that regulatory developments could trigger significant market movements.\n\nDon’t let crypto give you a run for your money. Track coin prices here"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPNGI3aDZNdUp3SnFkb0twdnVuRVFRbzZJSjhRekh3MEFNczMzOFNfcmlBeVlEeHdFcnYwM2tNZ2gtZGh3X2lfUWVzdV9NNDlCVTdMaTdwSGtobklYaWl5aFJNQWFSVGhLZHh1LXhleVYzSl9mbzVFZ2xNRWZrX2xuMFFYMWczS3NpNFZqcVBUVkFVZ1h5Sm5DQXRlcFZUenY4MmZGWXF3Vm5NRllBVmlTU01DbGU4cnJETWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Why the Ethereum Community Is Up in Arms Against a Proposal to Change the Monetary Policy - Unchained",
        "content": "Ethereum researchers claim that a high staking ratio is bad for the network as well as for ETH as an asset. They’re proposing a solution, but is it worth the cost?\n\nA significant discussion to reevaluate Ethereum’s token issuance model has stirred debate over the future of ETH staking economics.\n\nAs Ethereum sees an upward trend in ETH staking, projections suggest this could lead to a majority of ETH being locked in staking contracts, prompting concerns over the network’s future dynamics. In response, Ethereum Foundation researchers Ansgar Dietrichs and Caspar Schwarz-Schilling have introduced a proposal to tweak Ethereum’s issuance policy to maintain a balanced staking ratio, aiming to prevent potential negative effects such as inflationary pressures on non-stakers and centralization risks.\n\nHowever, this solution has sparked a contentious debate within the Ethereum community, with some members voicing strong opposition against altering the monetary policy in a way they believe could undermine Ethereum’s foundational principles and its appeal to institutional investors.\n\nAs James Spediacci tweeted, “It almost seems like a coordinated attack on Ethereum that a few people are suggesting adjusting the ETH issuance curve again and changing the monetary policy when the SEC currently has Ethereum under a microscope.”\n\nThe Amount of Staked ETH Has Been on the Rise\n\nSince Ethereum’s transition from Proof of Work to Proof of Stake 18 months ago, known as “The Merge,” the dynamics of ETH staking have shifted dramatically. Currently, about 31 million ETH, roughly 26% of the total supply, are staked. This figure has been on an upward trajectory, from 11% at the time of the Merge and 15% at the time of the Shapella upgrade, which enabled the withdrawal of staked ETH from the Beacon Chain in April 2023.\n\nThere are several drivers behind the progressive increase in staking, including the overall improvement in the network’s security and stability, innovations like liquid staking providers that lower the barrier to entry for staking, and the enticement of additional rewards. Notably, these additional rewards include those from Maximal Extractable Value (MEV), as well as opportunities for airdrop farming, which add to the attractiveness of staking beyond the primary consensus layer rewards.\n\nStaking Demand Will Continue to Increase\n\nThe staking ratio is set to increase in the upcoming months and years, as highlighted in a blog post by Mike Neuder from the Ethereum Foundation, due to five reasons:\n\nAppreciating ETH Price: An increasing ETH price makes staking more attractive due to higher USD-denominated yields.\n\nRestaking Demand: Platforms like EigenLayer are driving interest in restaked ETH , with the potential for airdrops adding to the appeal.\n\nInterest Rates: Lower interest rates could shift institutional capital towards staking for better yields.\n\nLiquid Staking Tokens (LST)/Liquid Restaking Tokens (LRT): These tokens lower the barrier to staking and are expected to attract significant capital inflows.\n\nStaked ETH ETFs: The possibility of Ethereum-based ETFs, which include staking in their model, could introduce a substantial new audience to staking.\n\nWhy a High Staking Ratio Might Be Bad\n\nHowever, the prospect of a continually increasing staking ratio raises several concerns.\n\n“We argue that high staking ratio regimes come with negative externalities that affect ETH holders, (solo) stakers, as well as the protocol itself,” they wrote in the proposal.\n\nDietrichs and Schwarz-Schilling’s analysis points out potential issues with nearly all ETH being staked, particularly with a significant portion being locked in LSTs such as Lido’s stETH, Coinbase’s cbETH, or Rocket Pool’s rETH. According to the authors, a scenario where the staking ratio approaches 100% is troubling for several reasons:\n\nReal staking yield will diminish: As the staking rate approaches 100%, real yields from staking could drop to zero. Although rewards from the protocol continue, the total supply of ETH increases at the same rate, effectively nullifying real gains for stakers.\n\nETH will become “expensive” money: High staking rates could make holding ETH costly due to increased inflationary pressure on non-stakers. When lots of ETH is staked, people who don’t stake see the amount of their ETH decrease proportionally compared to those who do stake. This could undermine ETH’s role as a cost-effective and trustless asset on the Ethereum network.\n\nThreat to ETH’s status as default currency: The expensive nature of holding ETH might challenge its position as the default currency of Ethereum, leading to friction in transactions and a shift towards alternative tokens or protocols. People might start using other tokens that give them rewards, like Lido’s stETH, for daily use. This means ETH might not be the main currency people use on Ethereum anymore.\n\nRisk of centralization and “too big to fail” entities: A few dominant staking tokens like Lido, which currently has 30% of all staked ETH, could amass excessive influence over Ethereum’s underlying protocol, posing risks to the network’s decentralization and governance. So, if there’s a smart contract vulnerability in Lido’s cost, and they represent the majority of the network, in theory, they could fork the chain to avoid their losses.\n\nThe Proposal\n\nTo mitigate these risks, on February 21, Ansgar and Caspar proposed a recalibration of Ethereum’s issuance curve, which involves a shift towards Stake Ratio Targeting, a nuanced approach that aims for a balanced staking ratio instead of a fixed quantity of staked ETH.\n\nThe proposed change aims to decrease the incentive for new staking inflows by introducing a revised formula for calculating staking rewards. The current issuance curve, defined by a parameterized inverse square root function, doesn’t cap rewards in a way that prevents an excessive total staking ratio.\n\nThe new formula intends to address this by adjusting rewards to discourage staking beyond a certain threshold, thus aiming to stabilize the staking ratio and ensure network security without inviting negative externalities. While the curve might not need to turn negative abruptly to be effective, a gradual approach towards zero rewards past a certain staking level could suffice to target a suitable staking range. For example, under the current issuance curve, at 80 million ETH staked, the nominal yield would be 2%, whereas under a possible revised curve, the same amount of ETH staked could yield 1%.\n\nNevertheless, the authors don’t explicitly say what the ideal staking ratio should be. “It is inherently hard to objectively reason about it and needs to be discussed more broadly in the community,” they wrote.\n\nDietrichs and Schwarz-Schilling’s proposal, premised on the assumptions that most ETH will eventually be staked, predominantly through Liquid Staking Tokens (LSTs) and Liquid Restaking Tokens (LRTs), is fundamentally about steering the network towards an inevitable future under controlled terms. They argue that as staking becomes increasingly prevalent, the staking rewards will naturally diminish under the current issuance curve.\n\nBy proposing a change in the issuance curve now, while the staking ratio is still relatively low, they aim to adjust the incentives in a way that preempts the potential negative outcomes of an excessively high staking ratio. This proactive approach seeks to maintain the balance and health of the Ethereum ecosystem by ensuring that the transition towards higher staking ratios does not compromise the network’s security, dilute ETH holders unnecessarily, or disadvantage solo stakers.\n\nNegative Community Reaction\n\nWhile the Ethereum Foundation researchers intended to initiate a discussion, the community was up in arms, with the majority signaling that this was not a good idea for Ethereum to pursue.\n\nEric.eth, a co-author of one of Ethereum’s most important improvement proposals (EIP-1559), is against changing the curve. “Seeing some growing discussion from researchers and others in the community about tweaking the PoS issuance curve. The general disregard for how hard we’ve worked for a decade establishing ETH being money is concerning. I’ll fight this idea with anything I have,” he wrote on X.\n\nHis comments echo some critics who say that frequent changes in monetary policy erode confidence among users and investors, distancing Ethereum from the “hard money” characteristic and “credible neutrality” that underpin its value proposition, in contrast to the perceived stability of Bitcoin.\n\nGnosis co-founder Martin Köppelmann pointed out that changing the issuance curve “does not fundamentally improve Ethereum – it just shifts incentives from one group to another,” while Jon Charbonneau, founder of DBA, said that “these tweaks try to solve an unsolvable problem of fundamental tradeoffs in PoS.”\n\nAdditionally, altering the issuance curve could dilute Ethereum’s attractiveness as a yield-generating asset for ETFs and institutional investors whose interest in Ethereum is based on its existing “yield” narrative. Similarly, projects built on Ethereum might suffer due to the shift in expectations around monetary policy stability.\n\nRegulatory Risks?\n\nAnother community member pointed out that, in the midst of the Securities and Exchange Commission investigation of the EF, this move is not smart, as it would imply that the Foundation indeed runs managerial efforts over Ethereum. This is significant because it is one of the prongs of the Howey Test, and the SEC could use it to argue that ETH is a security.\n\nI love and respect EF researchers. We would not be where we are without their precious work and they'll keep on being very valuable. But goddamnit, sometimes, they can't read the room! pic.twitter.com/Lcau6VWpAE — Jrag.eth (@JimmyRagosa) April 1, 2024\n\nDebate to Continue?\n\nResearcher Emmanuel Awoski criticized those who wouldn’t even engage in a conversation about the issuance curve. He wrote, “Today is a good day to start calling out the trend of anti-intellectualism that’s slowly permeating the discourse around the issuance curve change. Not only are memes like this distasteful, they also represent how low we’ve fallen as a community. Now, EF researchers are getting mocked by people who haven’t spent their days/nights obsessing about solving hard problems. People whose sole contribution to crypto has been ‘I’ll pour money into some protocol and wait for the numbers to go up’.”\n\nBut negative sentiment has so far seemed to prevail. Ryan Berckmans countered saying that “it’s not anti intellectualism to point out (in meme form or otherwise) that for all its laudable technical rigor, the issuance modification proposal fails to demonstrate an understanding of basic key facets of the change management environment.”\n\nUpdate, Monday, April 3, 04:15 pm ET: An earlier version of this article mistakenly displayed the name of Caspar Schwarz-Schilling as Caspar Schwarz. Unchained regrets the error."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPTEUxbjZybzNVYWgzSEVoTE9uMTZOSEowYlY4OUltV0xESXN3MmZXZHdTREktMG4wSHBTY0N1bzgxTlp2dmhSelZIQ1VnejdOdVB3NUhqWG5sMEZfcHdFYW9jeHdlUVV0OS1xY2lPSk9naDc4RUNxbTVPZTlBT2lTTVJtVnpaVU9uZktxTWJNV1pZN19qZzZVQzdWYVVlb3lfZHhodTZUSm9aUmoyNDBGNk5aTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "VanEck predicts Ethereum Layer-2’s collective market cap will climb to $1 trillion by 2030 - CryptoSlate",
        "content": "VanEck believes that Ethereum‘s Layer-2 protocols will hit a collective $1 trillion market capitalization by 2030, according to a new research report published on April 3.\n\nThe prediction was revealed in a detailed analysis led by VanEck senior investment analyst Patrick Bush and head of digital research Matthew Sigel.\n\nVanEck’s forecast of a $1 trillion market cap for Ethereum Layer-2s by 2030 reflects a belief in the technology’s potential to significantly enhance blockchain scalability and efficiency, marking a notable shift in the landscape of digital assets and their underlying technologies.\n\nSolving scalability\n\nThe investment firm’s analysis assessed the burgeoning Layer-2 ecosystem across several critical dimensions: transaction pricing, developer experience, user experience, trust assumptions, and ecosystem size.\n\nAccording to the report, Layer-2 technologies, specifically Optimistic Roll-Ups and Zero-Knowledge Roll-Ups, are solving Ethereum’s biggest challenge — scalability.\n\nThese solutions aim to expand Ethereum’s capacity for transaction processing without compromising its core attributes of security and decentralization. The analysis points to the EIP-4844 upgrade as a key development, introducing “Blob Space” to reduce data posting costs significantly, thereby benefiting Layer-2 operations financially.\n\nAccording to the report, the cost reductions enabled by EIP-4844 are pivotal for improving Layer-2 profit margins.\n\nThe report also explored the revenue models of Layer-2 solutions, emphasizing transaction sequencing as a primary source of income. It examined both on-chain and off-chain cost structures, particularly noting the expensive proof mechanisms that Zero-Knowledge Roll-Ups employ.\n\nTVL\n\nIn evaluating the competitive landscape, the study predicts that by 2030, Layer-2s will capture a significant portion of transaction value and Total Value Locked (TVL) within the Ethereum ecosystem.\n\nThis growth is partly attributed to the potential of Maximal Extractable Value (MEV) to augment Layer-2 revenues. VanEck’s analysis suggests a future where Layer-2 platforms may offer competitive advantages over Ethereum in specific market segments.\n\nHowever, the report maintains a neutral tone regarding the speculative nature of the crypto market and the uncertain future of Layer-2 token valuations. It anticipates the emergence of numerous use-case-specific Layer-2 roll-ups, indicating a broader application of blockchain technology beyond finance to sectors like gaming, social media, and infrastructure.\n\nVanEck’s analysis presents a compelling vision of the future, one where Ethereum Layer-2s evolve from nascent technologies to central cogs in the global blockchain ecosystem."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQT2hEWGRFRGo4YTJ5RW45M3lnNzlaRTZ3LThtTHEyYTFWblctYS1Va3BKd3JFTjZJZ1NGYzNXZzFsUXlhdGlSZzZTVVJpRWZxY0J5WUJqT0YwaXNmVjJyOExmWWp6Q3E2SjVJUU5HRDdxd0dRWnhweWtzM0EwWHVfdmtiNzZoakt3RFA0OEM1RGFINmNQRXEzRjVUYkJVcDZKWEFnWU92dkRvdUlYVHJTVThadDdTb2I0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ripple Announces Stablecoin On XRP Ledger And Ethereum - Benzinga",
        "content": "Payment protocol Ripple XRP/USD on Thursday announced its entry into the stablecoin market with a U.S. dollar-pegged token.\n\nWhat Happened: Ripple’s stablecoin aims to set a new standard in the stablecoin ecosystem by ensuring a 1:1 peg to the U.S. dollar, underpinned by substantial U.S. dollar deposits, short-term U.S. government treasuries and other cash equivalents, according to a press release.\n\nThis move positions Ripple directly against industry leaders Tether USDT/USD and Circle USDC/USD, vying for a share of the rapidly growing $150 billion stablecoin market, projected to reach $2.8 trillion by 2028.\n\nThese reserves will undergo third-party audits, with Ripple committing to monthly attestations to uphold transparency and trust.\n\nBrad Garlinghouse, CEO of Ripple, described the launch as “a natural step for Ripple to continue bridging the gap between traditional finance and crypto.”\n\nThe introduction of the stablecoin is not only seen as a strategic move for Ripple but also as a potential boon for the XRP Ledger community, promising to enhance use cases, liquidity, and opportunities for both developers and users.\n\nAlso Read: Bitcoin Spot ETFs Notch $113M Net Inflows On Wednesday, Grayscale Outflows Continue\n\nAt its inception, the stablecoin will be accessible on the XRP Ledger and Ethereum ETH/USD blockchains, with Ripple outlining plans for future expansion across other blockchains and decentralized finance protocols.\n\nMonica Long, Ripple President, emphasized the pivotal role the stablecoin will play in unlocking new institutional and DeFi use cases, further driving adoption and fostering a dynamic ecosystem around the XRP Ledger.\n\nThis strategic move by Ripple comes at a time when the stablecoin market is projected to experience exponential growth, with forecasts suggesting it could exceed $2.8 trillion by 2028.\n\nRipple’s entry into this competitive landscape is anticipated to be a significant discussion point at Benzinga’s upcoming Future of Digital Assets conference on Nov. 19.\n\nRead Next: Is Shiba Inu About To Get Dethroned? The Rise Of PEPE Coin\n\nImage: Shutterstock"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBDdmJZc24wTldJX000Y1hKSUFoLWtkbjIzS2RFSVVqWGFYLV84UWFjTEw3VUU4WFhXOFhDdm9HWTREcVlPeUNmS01hMU1ZTGpPZTJBb3J1ZHRveUVhYm9nbTVfMndEcmNFYm8w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ripple to debut a dollar-pegged stablecoin on XRP Ledger and Ethereum this year - Crypto Briefing",
        "content": "Ripple aims to tap into the growth potential and niche opportunities within the stablecoin market.\n\nShare this article\n\nRipple plans to issue a stablecoin tied to the US dollar, which will be 100% backed by USD deposits, short-term US bonds, and other cash equivalents. Expected to debut later this year, Ripple’s stablecoin will be deployed on the XRP Ledger and the Ethereum blockchain, with plans to extend to other blockchains and DeFi platforms, Ripple said on its website.\n\nTo ensure transparency and address potential concerns about reserve quality, Ripple will publish monthly attestations of its stablecoin reserves. Additionally, these reserves will be audited by a reputable third-party accounting firm. Specific details regarding the chosen firm have not yet been disclosed.\n\nBrad Garlinghouse, Ripple CEO, explained that the launch is to address the growing demand for stablecoin with a compliant and trusted solution and drive development and use cases within the XRPL ecosystem.\n\n“Institutions entering this space are finding success by partnering with compliant, crypto-native players and Ripple’s track record and resiliency speaks for itself, as we launch new products and acquire companies through multiple market cycles. This move is also monumental for the XRP Ledger community, driving more use cases, liquidity and opportunities for developers and users,” said Garlinghouse.\n\nRipple claims its stablecoin offers a unique combination of features tailored for enterprise use, regulatory compliance, and a thriving developer ecosystem. The firm seeks to fill a gap in the market for institutions seeking stablecoin integration for large-scale payments.\n\nA lucrative market\n\nStablecoins are an integral part of the crypto ecosystem. According to data from the Federal Reserves, over 80% of trading volume on major centralized crypto exchanges in 2022 involved stablecoins. This popularity can be attributed to their role as a frictionless on-chain intermediary. Unlike converting to traditional fiat currency, stablecoins allow traders to quickly move between positions without leaving the crypto ecosystem.\n\nWith a value of around $150 billion, Ripple CTO David Schwartz expects the stablecoin market to reach over $2 trillion by 2028. Currently, the market is dominated by Tether’s USDT and Circle’s USDC. However, Schwartz sees opportunities for niche players to carve out their space.\n\n“We think it will be over $2 trillion by 2028, and there’s only two market leaders. We don’t think it’s a winner-take-all-all ecosystem, particularly on the DeFi side,” said Schwartz.\n\nThe stablecoin market is not just sizable, it’s highly profitable. Leading stablecoin issuer Tether recently reported a nearly $3 billion in quarterly profits last year, with $1 billion coming from US bonds. Last month, Tether hit a $100 billion market cap; this level of growth puts Tether in the same league as established giants like British oil and gas giant BP and Shopify in terms of market capitalization."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPZWF6X1QtTzJidHJ2dDd3STdjbXh5TUJkTjdKM0JxOUNYTmlIaWpBcHJpMGE4RVZNYllMSjFPWmxkTnRzWTFjVXRFWFZjRW5zc2JpTERmNzluUDRoejVYRWw0WHBKOElWa2sxYzdWdUkyZmtyUWo0OUV2Nmt4U2xoTHhlZ2h3QTNjNDFRZGh3WVk5U0lPRnhPWGdVV0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Picasso Network Integrates with Ethereum via IBC Protocol - Crypto Times",
        "content": "Based on a medium post, Picasso Network is now entitled to Ethereum’s Inter-Blockchain Communication (IBC) protocol. It facilitates sending assets and data across Ethereum and all Cosmos network nodes, considerably increasing communication between separate blockchains.\n\n🎨 @Ethereum @IBCprotocol is live on https://t.co/AJSBStq1qm!\n\n\n\nWe're thrilled to announce the official mainnet launch, connecting Ethereum with @Cosmos and @Polkadot – and soon, @Solana. This milestone brings us closer to a universally interoperable and secure DeFi ecosystem.… pic.twitter.com/aS4hCwYHDh — Picasso 🎨 (@Picasso_Network) April 3, 2024\n\n“By connecting Ethereum with Cosmos through IBC and designating Osmosis as the primary liquidity hub, we are setting the stage for a new chapter in DeFi,” Henry Love, Composable Foundation Executive Director, stated.\n\nDeveloping this integration and a greater security level over the conventional bridge methods by creating a common platform to work together with Ethereum and Cosmos community members."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxONERoTmJJUmVCcmpwMWg3VXdTYjVYT3VjclFTTkRVN29ROXZZMTl3a0tTdjhzWVpVZkFGdXlkZ2Mwdk5sS09VZTczTVBId1hnZnlRUk0zQUlSOHlWTkJHRng3eWFSbFZmTUJDeGJqeE5scGNNeFRSMWw2SndIMklZYmdsY0dSZGZwM09hSHVaSUhPUFU3V3psc3NJd0ZZM1ZWbkZv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Unveiling The Dynamics Of ETH Value: Understanding Ethereum's Price Movements - FinanceFeeds",
        "content": "Understanding the value of Ethereum (ETH) is essential for anyone involved in the cryptocurrency market. As one of the leading digital assets, Ethereum’s price movements often attract significant attention from investors, traders, and enthusiasts alike. This article aims to provide insights into the dynamics of ETH value, exploring the factors that influence Ethereum’s price and offering strategies for interpreting and navigating its fluctuations effectively.\n\nDeciphering ETH Value\n\nThe value of Ethereum, like any other asset, is determined by supply and demand dynamics in the market. As a decentralized blockchain platform, Ethereum serves as the foundation for a wide range of decentralized applications (dApps) and smart contracts. Consequently, the demand for Ethereum is influenced by its utility as a platform for building and deploying decentralized solutions.\n\nFactors Influencing Ethereum’s Price\n\nSeveral factors can influence the price of Ethereum, including market sentiment, technological developments, regulatory news, and macroeconomic trends. Positive developments such as the successful implementation of Ethereum upgrades (e.g., Ethereum 2.0), increased adoption of decentralized finance (DeFi) applications, and institutional interest in Ethereum can drive up demand and, consequently, ETH value. Conversely, negative news events, security breaches, or regulatory uncertainty may lead to price declines.\n\nMarket Trends and Analysis\n\nAnalyzing market trends and conducting technical analysis can provide valuable insights into Ethereum’s price movements. Technical indicators such as price charts, trading volume, and moving averages can help traders and investors identify patterns and potential price trends. Additionally, monitoring on-chain data, including Ethereum’s network activity and transaction volume, can offer insights into the underlying fundamentals driving ETH value.\n\nStrategies for Interpreting ETH Value\n\nFor investors and traders, understanding Ethereum’s value is essential for making informed decisions. Dollar-cost averaging, which involves regularly purchasing Ethereum over time regardless of price fluctuations, is a common strategy for long-term investors seeking to accumulate ETH. Short-term traders may employ technical analysis and trend-following strategies to capitalize on short-term price movements.\n\nLong-Term Outlook\n\nDespite short-term price fluctuations, many analysts and investors remain optimistic about Ethereum’s long-term prospects. As the leading platform for decentralized applications and smart contracts, Ethereum is well-positioned to benefit from the continued growth of the decentralized finance (DeFi) sector, as well as emerging trends such as non-fungible tokens (NFTs) and decentralized autonomous organizations (DAOs). Additionally, ongoing upgrades aimed at improving scalability and efficiency, such as Ethereum 2.0, may further enhance Ethereum’s value proposition over time.\n\nConclusion: Navigating the Dynamics of ETH Value\n\nIn conclusion, understanding Ethereum’s value requires a multifaceted approach that considers both fundamental factors and market dynamics. By staying informed about developments in the Ethereum ecosystem, conducting thorough analysis, and employing sound investment strategies, individuals can navigate the volatile world of ETH value with confidence. Whether you’re a long-term investor or a short-term trader, understanding Ethereum’s value is essential for success in the cryptocurrency market."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOSnFXWUJoSEZ3WVRLYzVvLTlPdlBORWwtQ0FqY25WbGt4MVpzZGhrYm9Ebk8wSU1OUlI5NmVWZHR6REx2LXBrX1M3aHEwNjI0VnVBaVBQeUQ2NGx3dUJJS1JXdW9SZzQtaDFXX0R0d2NYZ2U4Qmc2dEJfWGRvV0c1a1h3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Is Ethereum’s (ETH-USD) Black Swan Event Incoming? - TipRanks",
        "content": "A major black swan event for Ethereum (ETH-USD) and the broader cryptocurrency market, sometimes referred to as ETHgate, may be coming up. Steven Nerayoff, a former ETH advisor turned whistleblower, hints at groundbreaking disclosures set to be released sometime today (April 3, 2024).\n\nUnderstanding ETHgate\n\nETHgate centers around allegations from Steven Nerayoff, a former Ethereum advisor, who claims to reveal fraud and corruption from the project’s inception, particularly focusing on preferential regulatory treatment. The controversy gained traction after Nerayoff released a recording from 2015 featuring a conversation with Ethereum co-founder Vitalik Buterin, in which he suggested a drastic restructuring of Ethereum’s leadership and financial practices.\n\nDespite his allegations suggesting serious legal and ethical breaches within Ethereum, including comparisons to major financial scandals, the evidence has yet to substantiate these claims fully. Critics point to Nerayoff’s history, including a charge of criminal extortion in 2019, to question his motives.\n\nNerayoff’s sweeping allegations accuse Ethereum luminaries, such as Vitalik Buterin and Joe Lubin, of orchestrating extensive fraud, intellectual property theft, and conspiracy with U.S. officials. Further deepening the intrigue are claims of the Chinese Communist Party’s (CCP) involvement in Ethereum and implicating the Ethereum Foundation in the 2016 Gatecoin hack.\n\nImminent Revelations about Widespread Corruption\n\nFast-forward to today, and his recent post on X teases imminent revelations about widespread corruption. He suggests that despite attempts by powerful entities to suppress their findings by targeting him, they have uncovered far-reaching malfeasance. He indicates that these disclosures, starting today, will fundamentally alter historical perceptions and change the crypto world as we know it.\n\nDon’t let crypto give you a run for your money. Track coin prices here"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi9gFBVV95cUxNTGkxVjNDemZEZGtrQXFoNlZ6RzNyRDRwZTZKS21EMzlkZXpoUkFrdDNMTVdUMjNVVFhtSV9vVGp3NVNJZWN6QkVlYy1IMVZzb1h2aU9SWWE0SVJ2WHlpT29PV1NhRDZNZFN2Y0tpVjBVOENaTXFPMllURlRld2NITnU0Rml2NXg0eXUtN1RoSEs3MGxxdnpzSDByQjNmdXRwNzIzRGR5WHozUVN5QkRzMzFkdmtDRmRneUtIZUpJaWRUM3ByaHFHWkk0NmdOQjFfSUs3SWtjMFhJYVBqY1J2X1VidnNIcUppcmZlUDFzdTZjZmQ0S1HSAfsBQVVfeXFMTmNsNzdVbU9seFh4aHVGOU02RF8yaTh6UEw5VnhxTTM0bDRqSmVMQ1BjUXpjS1dzOURXM21GNE9DTTlSZ3BwZndmcGZHTmJiTnpUTmt5emE3eDJkTk1SakpldFVHSE9qU2xlTlA2SFRyak5CX1JWWXUtMjhiZWpnNnp6anQ4UUlsQjRWQ1lpVklQbklQX2R3RUNKWWVaNlF3UHFGSk1EcnpVby0xRHE2clRLX1VVSkp4Ri1fZUM5b1VGWTlOcklBNk94RkRzdFV3Q0VmYUc2cE9LajJBNmVZYWUzV19XZjRpZnAwT05fYmFYZElfOWtmR2cxWmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Ethereum shows slow movements following criticism of issuance curve article by developer - FXStreet",
        "content": "Bitcoin dominance is the ratio of Bitcoin's market capitalization to the total market capitalization of all cryptocurrencies combined. It provides a clear picture of Bitcoin’s interest among investors. A high BTC dominance typically happens before and during a bull run, in which investors resort to investing in relatively stable and high market capitalization cryptocurrency like Bitcoin. A drop in BTC dominance usually means that investors are moving their capital and/or profits to altcoins in a quest for higher returns, which usually triggers an explosion of altcoin rallies.\n\nStablecoins are cryptocurrencies designed to have a stable price, with their value backed by a reserve of the asset it represents. To achieve this, the value of any one stablecoin is pegged to a commodity or financial instrument, such as the US Dollar (USD), with its supply regulated by an algorithm or demand. The main goal of stablecoins is to provide an on/off-ramp for investors willing to trade and invest in cryptocurrencies. Stablecoins also allow investors to store value since cryptocurrencies, in general, are subject to volatility.\n\nAltcoins are any cryptocurrency apart from Bitcoin, but some also regard Ethereum as a non-altcoin because it is from these two cryptocurrencies that forking happens. If this is true, then Litecoin is the first altcoin, forked from the Bitcoin protocol and, therefore, an “improved” version of it.\n\nBitcoin is the largest cryptocurrency by market capitalization, a virtual currency designed to serve as money. This form of payment cannot be controlled by any one person, group, or entity, which eliminates the need for third-party participation during financial transactions.\n\nEthereum (ETH) has seen over $84 million in liquidations in the past 24 hours. As ETH price cools off, several interesting factors are playing out within its ecosystem:\n\nEthereum's price has been consolidating on Wednesday following its recent crash. The recent price movement follows Coinbase analysts raising concerns about \"hidden risks\" in restaking protocols and criticism labeled at the Ethereum Foundation after an article recommending adjustments to the ETH issuance curve.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPZjk4eHFPU1Z2aGRUQWJnbjNHUlp5R2xMVXo2WGNBZHlVdFg3Mk5WYWdvUVNxYUk5QXYxaWlBUVBzX3p2OFFQQ2ZxNUFnT1ZLaTVuS0VaM2dFMWNlQnNqMXllOFpTdlVNYmFUaHRjQzJILVRoeDE2RU56bFVuMlo2a29QZnVQajI3eFJtREZvdC1ONUhiNVhpZVRmeVLSAaIBQVVfeXFMTzFuMmRxREk1aTdYa2FyOEtNa0N2enBtY0VCOU1iQUN5N00zUWk5c0xfb00wYWQzb3psemRPeWJEX1lZZTNoNmwwY0lrSk9oYnhaWEp0RVBFZUd5OV9xUXJnMWFLNlIyT0RZTDBMOWtpQUNUM2lWdDRER3dGQ0gxWmRxZ2doVzU3Zjk3VkctYUItdC1OWWsxREJjb3VESk5WLWFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: Can ETH Still Hit $4,000 Pre-Bitcoin Halving? - CoinGape",
        "content": "The crypto market is gradually flipping bullish after a dismal start on Monday characterized by drastic losses after major altcoins tumbled. ETH, the token powering the most prominent smart contracts ecosystem, dropped to test $3,200 support, contributing to the generally bearish crypto market. Considering the current Ethereum price forecast, as it dodders at $33,379, the path of least resistance is gradually flipping upwards, aiming for highs above $4,000.\n\nBulls Wake Up In Tandem With The Soaring DeFi TVL\n\nThe volatility experienced by Ethereum has not significantly affected the decentralized finance (DeFi) sector within the ecosystem. A minor dip from the yearly high of approximately $58 billion eased to $47 billion, hinting at positive sentiment in the market.\n\nadvertisement\n\nAccording to data graphically highlighted by Defi Llama, the total value locked (TVL) in the sector has recovered to slightly above $50 billion, underscoring growing interest in the long-term fundamental outlook.\n\nOften investors prefer to participate in securing the network while in the process earning more coins instead of selling at the earliest sign of profit. Should the value of ETH locked in smart contracts continue to surge, it would be prudent to look forward to further price increases this week and this month in general.\n\nEthereum Price Forecast: Assessing Mid-Week Bullish Comeback\n\nEthereum price is slowly making its way to the $3,500 barrier, but first, it must confirm the validity of the support provided by the 20-day Exponential Moving Average (EMA) at $3,364.\n\nBacking the ongoing bullish push is a buy signal from the Moving Average Convergence Divergence (MACD) indicator. Buying pressure is bound to surge behind the token as the MACD rises into the positive region. The forming green histograms also validate the bullish thesis.\n\nConservative traders are likely to wait until Ethereum price tops the yellow band and the descending trendline resistance – marking the second confirmation of the uptrend.\n\nWith Bitcoin halving on the immediate horizon, interest in major altcoins could start to increase exponentially. Although the event is pertinent to BTC, the bullish sentiment associated with it tends to prop the entire crypto market to rally, with some tokens hitting new all-time highs.\n\nHowever, the IOMAP by IntoTheBlock realistically places a realistic resistance at $3,435 where 1.85 million addresses purchased 4.17 million ETH. Before rising above this level, some holders may choose to offload at their respective break-even points, thus creating selling pressure.\n\nOn the bright side, breaking above this hurdle could drastically change the technical outlook propping Ethereum for a bigger breakout ahead of the Bitcoin halving.\n\nDeclines could intensify if Ethereum price respects the seller congestion at $3,450, and possibly trigger a sell-off back to $3,200 and $3,000. If investors sell around the halving, it would be too early to rule out losses as far as $2,930.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxOLWp2QzhwaGY1VDlZSlpIbjc2Z2t3Y3ByNDZjVFB6WTdSdl9zV1l3VFJnems2MkluTG9TWVcxLTJxQ0F3TGNzQkNXeXFiY000UFpxblhVZWxleXJaclc1UHNtQ1d2ZmRUdmk1bFhtNlgxelVvdklKbGRuQ2l4T0NkeHloTnljVWozLTAxZGxKVEhpWEplZjdwbDY3UjlvMEhvdGVMa016ZUdkeW56Mms3bWlkQXJCWUVoRW92WVlxNE1vdTRyVDV1THlVYWxCcXkzVGhxTUVla9IB3AFBVV95cUxNMnJxbGM4d1NzQ2hmRkN4UlBfY2xSWmxtSDU3VFpUc2wtbGFHRUxJSFVURHFmdkgyQTJyOU1vcFlMLTI0d3ZzUUMwM09BLTRqcDhxdzR2MEludFRUT051OE1HY29RQkMzZldmYU5DWmktN1Z1UVBhckVzUk5xandrYk9haUtqSnpDN3plcWhvNFpENnhyZjM5MmdIOXc2STRJSklzWXVKaExSMUZaNUNvbkEyMVVIb0VWTFo5NXdIdl9BN0dwQzcxRmczQk43aWZfYTdRdVlWbDlYbHV1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "New Ethereum-Based Altcoin Just Listed on Binance To Explode Over 800%, Predicts BitMEX Founder Arthur Hayes - The Daily Hodl",
        "content": "BitMEX founder Arthur Hayes is predicting one new decentralized finance (DeFi) altcoin project will take off on a massive rally once the broader crypto market resumes an uptrend.\n\nHayes is predicting that Ethena (ENA), a governance token launched by Ethena Labs for the project’s DeFi protocol, could soar more than 817% from the current value.\n\nHayes is one of the investors in the project along with investment giant Franklin Templeton, digital asset manager Galaxy Digital and Binance Labs.\n\n“Congrats Ethena Labs on a successful TGE (Token Generation Event). If this is what ENA is worth [when] the market is puking, imagine how high it will go once we resume up only! ENA = $10. It’s just math yo.”\n\nENA is trading for $1.09 at time of writing, up more than 25% in the last 24 hours.\n\nThe Ethena Labs project also includes the yield-earning “synthetic dollar” token USDe. The project aims to create a stable and scalable form of money in the crypto space without relying on traditional banking systems.\n\nA number of crypto exchanges have listed the token for trading, including the world’s top exchange Binance. Ahead of the listing, ENA became Binance’s 50th project added to its Launchpool platform, which lets users stake coins to farm new assets.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQd1ZiV2hrLWNxNlVzaEVJblFmMGlPS3U5WWpfeEw3dGpkdnlNSlNQMGdaQkEtWm5lclYxdjhGRUFnMVBiblBjUERSRE9tRzY4N3ZobG5aa3JsM2huZkx2U1UzcE1OeG92Ykl3RVZ3OVc3dHU1SjBGZy1ncmJlNUc5Uml6NEdtT25tX3lSVVY5OE5WUUdXbkRzQXZ0eDFqNFdxX1dn0gGoAUFVX3lxTE9MVm5pTTdETFRwZVFKbjZkRUZoZjg3bklXUVg0NEMzcFJmd1F4REVmdUFoVllUU294aFR6S08taHVpR2NmS09IM3FpcUpkUzFNSUxleVNueVpvdUVublppSFNrc0pFejlwS2NFX1ZsbENZRDlleXo1MFdyNi1xMmhvNlFrNGhUc3VqOTBLaGQxMjE1YkFjRWZNY1U0dmxPZ2pEX1d0amFKaA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "US Gov Moves $40M Bitcoin & Ethereum Seized In 2022, Will It Disrupt Price Recovery? - CoinGape",
        "content": "The US government has been observed transferring $40 million worth of Bitcoin (BTC) and Ethereum (ETH) on Thursday, April 4. This crypto reserve was seized from two Estonian citizens back in 2022. This move comes amidst a turbulent period for the leading cryptocurrency as the Bitcoin price just managed to rebound above $67,000.\n\nUS Gov Makes Massive Bitcoin & Ethereum Transfer\n\nThe seized Bitcoin and Ethereum, now in the possession of US authorities, holds the potential to impact the crypto market dynamics significantly. According to Arkham Intelligence, the US government made two subsequent transfers today for BTC and ETH, respectively. The first transfer was of 4,567 ETH worth $15.21 million.\n\nadvertisement\n\nIn addition, the authorities transferred 374 BTC worth $24.80 million to an unknown wallet. With the market eagerly watching the US government’s next steps, speculation is rife regarding the potential impact on the Bitcoin and Ethereum price.\n\nIt is estimated that the eventual sale of the seized crypto reserve by the US government could exert downward pressure on the Bitcoin and Ethereum price. The influx of such a substantial amount of Bitcoin into the market may trigger selling pressure, expediting the current dip in prices.\n\nEarlier, late Tuesday morning, a wallet associated with the US government transferred a massive 30,175 Bitcoin. Considering the Bitcoin price of around $65,000 at the time, this transaction amounts to approximately worth $2 billion.\n\nThe last confirmed instance of the government selling Bitcoin dates back to March 2023. During this event, they sold 9,861 coins for $216 million. This sale followed the government’s seizure of around 50,000 Bitcoin linked to the Silk Road website in late 2022.\n\nAmong the recent transfers, approximately 2,000 Bitcoin were sent to a wallet identified by Arkham Intelligence as belonging to the crypto exchange Coinbase. The remaining Bitcoin was transferred to a wallet flagged by Arkham as being owned by the government.\n\nAlso Read: Bitcoin Short-Term Investors Lose $5.2B Amid BTC Price Crash\n\nBTC & ETH Price Rebound\n\nAfter plummeting over 11% from the recent high of $73,750.07, Bitcoin has recovered significantly. As of writing, BTC price was $67,534.94, gaining 2.58%. Meanwhile, the market cap for BTC stood at $1.32 billion. In contrast, the trading volume plunged 20.20% to $30.11 billion.\n\nHowever, if the recent US government Bitcoin and Ethereum transfer is made for a selloff, the rebound could be short-lived. In addition, Michaël van de Poppe predicted that the Bitcoin consolidation will continue and there’s not much upside as of now. On the contrary, he expects a surge in altcoin prices, which could benefit Ethereum despite the potential selloff.\n\nAt press time, the ETH price was up by 1.35% to $3,374.15 with a market cap of $404.99 billion. Whilst, the trading volume for Ethereum slumped 24.82% to $13.12 billion in the last 24 hours.\n\nAlso Read: Ethereum L2s May Outshine Main Blockchain, VanEck Reports\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQMlprWTYyVmhOdlFva1puNnM1X3JCdkJ1MlRyM1daQlhsVHlxMFdsSkEtMHdnNlN1UGN2NFpuelNfOWtTdDJiaDNSeUI1T1hyaWRsNVFZQUpYMUwyVE5XYVhoZ2gzR09RRDd1eWIyVmpyWFV6MGFtVWVlODVDclRxMnZMTzVlbHRwSXBELXpYTXZvTHY3NDdIN3hmQUh3d1BSVWpN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "VanEck Forecasts Ethereum Layer 2 at $1T Market Cap by 2030 - Crypto Times",
        "content": "A leading global investment firm, VanEck, predicts Ethereum’s Layer 2 scaling networks will achieve a $1 trillion market cap in six years.\n\nOur Ethereum L2 Valuation Prediction by 2030 piece dropped, highlighting a base case of $1T.https://t.co/83meXWiaje pic.twitter.com/BJRS2YTNBV — VanEck (@vaneck_us) April 3, 2024\n\nThese networks, designed for specific use cases, aim to overcome Ethereum’s limitations in processing and storing data. Currently, there are 46 Ethereum layer 2 networks with a total value locked of $38.97 billion, with Arbitrum being the largest at $18 billion.\n\nDespite Ethereum’s dominance in smart contracts, scalability remains a hurdle, leading to high fees during peak usage. Ethereum’s recent Dencun update aims to reduce layer 2 transaction fees with features like “Blobs.”\n\nAnalysts foresee higher revenues on layer 2 networks than on Ethereum’s base network due to better transaction throughput and user experience. However, they express caution about the long-term value of most layer 2 tokens due to intense competition.\n\nVan Eck predicts a future with thousands of specialized layer 2 networks alongside a few major general-purpose chains, driven by the network effect. Many roll-ups are expected to adopt the zero-knowledge framework for its advantages."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQN0JjRWdVc3JxbXd0ejNaWW5ZR1dpZU8yRlRXMXBJbzQwMG04Q3dFamVkNGN5QjRDYi04QXZRVHBsSy1Mcy1ybzk5UGJpN2VHZlNqVkRRR240S09oRHBiSXlNTVA4Vjc2MUQ2M3pRSTdMMFF2bFFldnFUT3ZVTFN3YTFKMURVVVE1LVhwVTh3aW90VHIwekVhU3ZyVlhQOXRWM3REQWpmTnJFZVFwSkHSAbMBQVVfeXFMTVJPaE9oMGxSRDczV3dVOVJvNURBb05pbkhRU2NXaTVnNDJuRzNhaUZyXy1PaEhSWUxZU0E1SFZTeFZESGpNZHdqaG5QY1BZRk04UHYzeVNaMVZ4Y1Z3VHZzYlNocVYxUDBjdWZjbXZLb1NCOXlOajJzWDlCcUk2Y2hnNWs1a2xFTmtBQXBVTjVTTV9adllxaVVSY252UkNMX3FpTEZSZUJZUElEejV1d1dORzA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Will Bitcoin Halving Lead to $100,000? Ethereum (ETH) on Verge of Reversal, Mysterious Solana Price Performance - U.Today",
        "content": "Advertisement\n\nBitcoin's next halving event is the main fuel for the discussion about its future price, with most people anticipating $100,000.\n\nThe chart shows Bitcoin is currently experiencing fluctuations. If we follow past patterns, Bitcoin might show strong growth after the halving. But, it is also possible that this growth will not be as great as before, considering the market's capitalization and the presence of institutional funds.\n\nRight now, Bitcoin is trading around $65,493. It is important to look at the support level at $63,600. This is like a safety net – if the price does not fall below this, Bitcoin could start the bullish reversal again. The next support level is down at $47,474, which could come into play if the price drops further.\n\nFor Bitcoin's price to reach $100,000, it would need to break past several resistance levels. The first big challenge is around $68,000. If it can stay above this, Bitcoin may continue to rise and possibly reach new highs.\n\nAdvertisement\n\nWhat does this mean for the future? After the halving, Bitcoin could go up in price, maybe even reaching $100,000. However, it might not happen quickly or as strongly as some people hope. It is important to remember that other factors can influence Bitcoin's price and that previous price performance is not a guarantee of a bullish future.\n\nWill Ethereum reverse?\n\nEthereum is showing signs that it might be about to change its direction after a period of falling prices. The chart indicates that Ethereum is now close to the 50-day Exponential Moving Average. This could be a sign that a reversal, where the price starts to go up again, might happen soon.\n\nWhen we look at the specific numbers on the chart, the 50 EMA is right near the price level of $3,300. If Ethereum's price can stay above this line, it is a good hint that the price could start rising. On the other hand, if the price falls below 50 EMA, it could be the continuation of a descending price trend.\n\nRight now, Ethereum's price is hovering around $3,324.9. The next big resistance level is at $3,500. If the price of Ethereum can go past this point, it could be the start of a climb back up to even higher levels.\n\nIn general, the market is doing okay, so there might not be too much to worry about right now despite the correction we are seeing. However, Ethereum's growth factors for now are mostly layer 2s and the potential approval of an Ethereum ETF, which will most likely be the only major capital injection Ether will see during this market cycle.\n\nSolana's weird behavior\n\nSolana's price moves have been quite mysterious lately. After breaking out of a pattern known as a symmetrical triangle, which often leads to a price rally, we saw a few days of gains. But then, surprisingly, the price did not enter a bull trend. Instead, we saw a bearish reversal, where the price started to fall again, which was not the most expected show out there.\n\nOn the chart, Solana's price had risen above the triangle formation, reaching up to about $210. However, instead of continuing upward, it faced resistance and could not maintain the momentum. The price has fallen back to around $180.59, leaving many traders with losses and a lot of questions.\n\nLooking closer, we can identify the key support level at $148.48, which is a price that could potentially stop further drops and help turn things around. If the price falls below this level, the next support is way down at $129.67, showing that there is quite a bit of room for a potential downside.\n\nOn the other hand, if Solana's price can find some strength and start to go up again, the key resistance level to watch is around $213 – a price from the previous breakthrough."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPR3dyVm5DX1BYdEJTZEpXV004eFJEUVpaaEpUNG9yUXBrc3BCdjhMamFxb3hrQ1lNeDdGT2pQZEFKb1R3QU5pSXN0VGRyY1FwRUFRaFhxRHgtTld6TDdJRXBYNmtzQzlwQmtJT09DSUtEUm9NMGRWQk0tZzFXSTBTQks0M0ZkYzVZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ethereum - Modification of monetary policy underway - Cointribune EN",
        "content": "Thu 04 Apr 2024 ▪ 6 min read ▪ by Nicolas T.\n\nThe Ethereum Foundation once again wants to change Ethereum’s monetary policy. The reason behind this is the growing number of validators…\n\nMonetary Policy Change during the Electra Fork?\n\nIn response to Vitalik’s proposal to establish a maximum limit on the number of validators, Mike Neuder is advocating for a reduction in the issuance of new Ether awarded to validators instead.\n\n“We believe that modifying the reward issuance curve should be seriously considered for the Electra fork,” declared a researcher from the Ethereum Foundation in an article published on March 30th.\n\nSome are already opposing it, arguing that such changes to Ethereum’s monetary policy would undermine trust in the Ethereum network.\n\nEric.eth, co-author of a significant Ethereum Improvement Proposal (EIP-1559, about transaction fee calculation), stated:\n\n“I see more and more researchers considering changing the pace of ETH issuance. The general contempt for the efforts we’ve put in over a decade to make ETH a currency is disturbing. I will fight this idea with all my strength.”\n\nSeeing some growing discussion from researchers and others in the community about tweaking the PoS issuance curve.\n\n\n\nThe general disregard for how hard we've worked for a decade establishing ETH being money is concerning.\n\n\n\nI'll fight this idea with anything I have. — eric.eth (@econoar) March 30, 2024\n\nHis comments echo those who believe that frequent changes to monetary policy erode the confidence of users and investors. For them, such instability does not align with Ethereum’s slogan of “Ultra Sound Money.”\n\nIn this context, don’t miss our article comparing the issuance rates of ETH and bitcoins: Bitcoin vs Ethereum. We wrote in it:\n\n“Ethereum’s monetary supply depends on two parameters. ETH is created via rewards paid to validators. The more validators there are, the faster the quantity of ETH increases. This system is called ‘staking.’\n\nThe monetary creation is more or less offset by the destruction of a part of the transaction fees (‘burn’). The increase in the number of transactions causes an exponential increase in transaction fees, and thus the number of ETH destroyed.”\n\nFrom PoW to PoS\n\nBlock rewards have decreased several times throughout Ethereum’s history. They were at 5 ETH at its launch in 2015. They fell to 3 ETH following the Byzantium fork in 2017. And then to 2 ETH from 2019 onwards.\n\nEverything changed with the transition to Proof of Stake in 2022. Rewards are now issued at a rate of 166 times the square root of the sum of ETH staked. This formula means that the pace of new ETH creation increases as staking increases.\n\nSamuel Haig explains in this article that one million ETH staked generates rewards of 166,000 ETH per year. If 100 million ETH are staked, the annual issuance rises to 1.66 million ETH.\n\nCurrently, roughly 31 million ETH have been staked, amounting to about 26% of all ETH in circulation. However, for Mike Neuder, another researcher at the Ethereum Foundation, staking is expected to increase further in the coming years.\n\nKnowing that ETH staked are ETH that are no longer in circulation. It’s that much ETH that will no longer generate transaction fees. In other words, the increase in the number of validators triggers a vicious cycle:\n\nIncreased ETH awarded to validators and reduced ETH ‘burn’.\n\nIt looks quite like the concept of Proof of Stake is turning into a fiasco…\n\nThe Problems with a Growing Number of Validators\n\nFor developers @adietrichs and @casparschwa, the turn of events is concerning for several reasons:\n\n-Decrease in the actual yield of staking: “The actual yields tend to zero as the staking nears 100% of ETH in circulation.”\n\nIndeed, if everyone stakes their ETH, no one gains. The rewards are negated by the inflationary effect.\n\n-Expropriation of users: “Staking close to 100% would greatly increase the inflationary pressure on users,”.\n\nAnd naturally so. The more validators receiving more ETH, the higher the inflation. These newly issued ETH dilute the value of the common user’s ETH.\n\n-Centralization: “Several staking tokens like Lido (which currently holds 30% of all staked ETH) could exert excessive influence over the Ethereum protocol. This poses risks to the network’s decentralization and governance,”.\n\nIn summary, now that Staking is no longer the exclusive preserve of a minority of profiteers, the rules change… It is now necessary to reduce the incentive to become a validator. The idea is that rewards should trend towards zero beyond a certain level of staking.\n\nThe yield is currently 2.65% per year for validators. At 80 million ETH staked, this yield would drop to 2%. It would only be 1% with the new formula that some Ethereum Foundation researchers propose.\n\nThus, eighteen months after The Merge, we find out that Ethereum, not having any real utility, will have more and more validators and fewer and fewer transactions.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMi8gFBVV95cUxQaWI0UV91di1MUFRreE9PQmZQQ0lYQkpiYVo1b1FtRFJRVzVPZXBSSWs0cW1lM0lkS0JCZXNyUm9rbFpGYTJHcmdPTW9HM3JWczVqQ0p5cWNiSldSZWFZaEcxODNUamJJS1BlVmJiWTZydEZwV1hvNGVQUXJjdEp4VjhmUmxyRV8wdDR6TTlhU0owNHBNX1JCTm1paVVqSjNZeUhaUHRHS25KUjROT1pRYWZZaW54R083ZG5mbUpYcTRvY3YtVzFfWlBJa2t5cGhidHBuX1B6MTNNbkpOYTQzeTBOSXNHN1BWTlV6WS0xUjZ5QdIB9wFBVV95cUxPQm9mRnFxRTlYaHR4dTZ5ZDdEcll5VEV0U1dXUXFuNl82S2lsMzhlNWlGVkdhNVNxWm5qYUNlMG9GRklBYzBsdnB2WVFKSDVubklHZWhfcktNa293SDJQNC1uUVZ1emNTUWw3MS1SSVZRVmNrTXlhUUpQSXNSMHVMd193d0RfekRwbWlNemN4bGdDbnpxWXFuVjNRbmtpWnIwX1Z1b1BqNDAxcFllYnJiV3R6OFZ4allFZlNGWUZ2aUx6c09jSjRmaUo2cDdrbEZNVkZRcHE4ckNYUDJFaGhta3EwUjRBMkItTWJuNVRPNkpMdVYzVHdz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Cryptocurrency Price on April 3: Bitcoin falls below $66,300; Ethereum, XRP shed up to 2% - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nMajor crypto tokens traded mixed with a negative bias on Wednesday. Bitcoin, Ethereum, BNB, XRP, Dogecoin , Cardano, and Toncoin were trading in the red, while Solana, Shiba Inu, Chainlink, Internet Computer, Litecoin, and NEAR Protocol were trading in the green.At 11:30 a.m., Bitcoin was trading 0.6% lower at $66,290 after a dip to the $64,500 region, while Ethereum was down 1.8% at $3,302.Meanwhile, the decline in the crypto market was also influenced by recent U.S. economic data, particularly strong manufacturing and labor market readings, which have raised the possibility that the Fed might postpone rate cuts.\"Bitcoin slipping below $65,000, marking its lowest point since March 24th, comes amidst a Dollar index surge fueled by robust U.S. factory data,\" said Edul Patel, CEO of Mudrex.\"Bitcoin's ability to maintain levels above $65,000 is crucial to mitigate further declines, with a breach possibly leading to a descent towards $63,500. Conversely, surpassing the $68,000 threshold could pave the way for Bitcoin to target the $71,000 resistance zone,\" Edul added.Meanwhile, CoinDCX Research Team, said, \"In the past 24 hours, the crypto market experienced a downturn without a clear catalyst. Factors such as BTC ETF outflows and a large transfer of seized BTC by the US government contributed to the decline.\"The global cryptocurrency market cap fell 0.36% to around $2.5 trillion in the last 24 hours.The total volume in DeFi is currently $12.06 billion, 9.66% of the total crypto market 24-hour volume. The volume of all stablecoins is now $116.84 billion, which is 93.54% of the total crypto market 24-hour volume, as per data available on CoinMarketCap.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, fell to $1.3 trillion. Bitcoin's dominance is currently 52.15%, according to CoinMarketCap. BTC volume in the last 24 hours fell 10.3% to $46.7 billion.\"Bitcoin's technical indicators reflect current market conditions. The hourly MACD shows a loss of momentum within the bearish zone. BTC/USD's hourly RSI has dipped below the pivotal 50 level, indicating a potential downtrend. Major support levels are identified at $65,200 and $64,500, while notable resistance levels stand at $66,000, $67,200, and $67,950. Traders are closely monitoring these levels for potential market movements,\" said Rajagopal Menon, Vice President WazirX."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi0gJBVV95cUxORGpTaE9NM205Q25sTFZWa0wxT25LT0d4RW9RV0lnTjViVlAyeHhENnQ3Qk1CaldBc3J6UFhnTlVXRjVGNEV0Y2xobm9VN0cwSlFtam9xN2NOLTBjcHhzZFFxcV9ycXRPT1dFME83enB2U3JLYy1Ha21TeTJwMV9feENZOVkzS2dEem1PYzM2cEtrNndpbTkwRmRQNjQtMEY4R0I5RzR3Y01QTHlid2FWTWNFSkdOTzI3YXFMQVdwdncxcUI4RVB4ekRneWJ0c1VTXzQzREVVSUZ4dVFSQUlXdzZWWUVnbU5CdHNXWUU5UHExaFpxV3dteWxSY0N6RnBUT290TlluNENaS0JEOTh4NmpkQjVFanlLTE9odThhaUk5aWdybzdVaXBHT3lSYnR1OHIxWjNUVUVJcVVCSHZPaWZaNE5ybmRhNTI1aDV2OVBfUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Grayscale® Digital Large Cap Fund, Grayscale® DeFi Fund, and Grayscale® Smart Contract Platform Ex-Ethereum Fund Announce Rebalancing of Funds for First Quarter 2024 - GlobeNewswire",
        "content": "STAMFORD, Conn., April 04, 2024 (GLOBE NEWSWIRE) -- Grayscale Investments® , the world’s largest crypto asset manager*, and manager of Grayscale® Digital Large Cap Fund ( OTCQX: GDLC ) (Digital Large Cap Fund), Grayscale® DeFi Fund ( OTCQB: DEFG ) (DeFi Fund), and Grayscale® Smart Contract Platform Ex-Ethereum Fund (GSCPxE Fund), today announced the updated Fund Component weightings for each product in connection with their respective first quarter 2024 reviews.\n\n\n\nIn accordance with the CoinDesk Large Cap Select Index methodology, Grayscale has adjusted GDLC’s portfolio by selling Cardano (ADA), and using the cash proceeds to purchase existing Fund Components in proportion to their respective weightings. As a result of the rebalancing, Cardano (ADA) has been removed from GDLC. At the end of the day on April 3, 2024, GDLC’s Fund Components were a basket of the following assets and weightings.**\n\nBitcoin (BTC), 70.96%\n\nEthereum (ETH), 21.84%\n\nSolana (SOL), 4.52%\n\nXRP, 1.73%\n\nAvalanche (AVAX) 0.95%\n\n\n\nNo new tokens were added or removed from DeFi Fund. At the end of the day on April 3, 2024, DEFG’s Fund Components were a basket of the following assets and weightings.**\n\nUniswap (UNI), 48.74%\n\nMakerDAO (MKR), 20.41%\n\nLido (LDO), 13.17%\n\nAave (AAVE), 9.99%\n\nSynthetix (SNX), 7.69%\n\n\n\nIn accordance with the CoinDesk Smart Contract Platform Select ex ETH Index, Grayscale has adjusted GSCPxE’s portfolio by selling Cosmos (ATOM), and using the cash proceeds to purchase existing Fund Components in proportion to their respective weightings. As a result of the rebalancing, Cosmos (ATOM) was removed from GSCPxE. At the end of the day on April 3, 2024, GSCPxE’s Fund Components were a basket of the following assets and weightings.**\n\nSolana (SOL), 58.41%\n\nCardano (ADA), 14.56%\n\nAvalanche (AVAX), 12.25%\n\nPolkadot (DOT), 8.53%\n\nPolygon (MATIC), 6.25%\n\n\n\nNeither GDLC, nor DEFG, nor GSCPxE Fund generate any income, and all regularly distribute Fund Components to pay for ongoing expenses. Therefore, the amount of Fund Components represented by shares of each fund gradually decreases over time.\n\nFor more information, please visit grayscale.com .\n\nThis press release is not an offer to sell or the solicitation of an offer to buy any security in any jurisdiction where such an offer or solicitation would be illegal, nor shall there be any sale of any security in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of that jurisdiction.\n\n*Largest by AUM as of April 4, 2024\n\n**The compositions of the GDLC, DEFG and GSCPxE Fund are evaluated on a quarterly basis to remove existing Fund Components or to include new Fund Components, in accordance with the index methodologies established by the Index Provider. Holdings and weightings of each Fund are subject to change. Investors cannot directly invest in an index.\n\nAbout Grayscale® Digital Large Cap Fund\n\nDigital Large Cap Fund seeks to provide investors with exposure to large-cap coverage of the digital asset market through a market cap-weighted portfolio designed to track the CoinDesk Large Cap Select Index. Digital Large Cap Fund holds the largest and most liquid digital assets that meet certain trading and custody requirements and are classified in the CoinDesk Digital Asset Classification Standard (DACS); the weightings of each Fund Component change daily and are published around 4:00 p.m. NY-time. Additional information on the Index methodology can be found at: https://www.coindesk.com/indices/dlcs/ .\n\nDigital Large Cap Fund’s investment objective is for its Shares to reflect the value of Fund Components held by the Digital Large Cap Fund, less its expenses and other liabilities. To date, the Digital Large Cap Fund has not met its investment objective and the Shares quoted on OTCQX have not reflected the value of Fund Components held by the Digital Large Cap Fund, less the Digital Large Cap Fund's expenses and other liabilities, but instead have traded at both premiums and discounts to such value, with variations that have at times been substantial.\n\nAbout Grayscale® DeFi Fund\n\nDeFi Fund seeks to provide investors with exposure to a selection of industry-leading decentralized finance platforms through a market cap-weighted portfolio designed to track the CoinDesk DeFi Select Index. DeFi Fund holds the largest and most liquid digital assets that meet certain trading and custody requirements and are classified in the DeFi sector defined by CoinDesk Digital Asset Classification Standard (DACS); the weightings of each Fund Component change daily and are published around 4:00 p.m. NY-time. Additional information on the CoinDesk DeFi Select Index methodology can be found at: https://www.coindesk.com/indices/dfx/ .\n\nDeFi Fund’s investment objective is for its Shares to reflect the value of Fund Components held by the DeFi Fund, less its expenses and other liabilities. To date, the DeFi Fund has not met its investment objective and the Shares quoted on OTCQB have not reflected the value of Fund Components held by the DeFi Fund, less the DeFi Fund's expenses and other liabilities, but instead have traded at both premiums and discounts to such value, with variations that have at times been substantial.\n\nAbout Grayscale® Smart Contract Platform Ex-Ethereum Fund\n\nGSCPxE Fund seeks to provide investors with exposure to a selection of industry-leading Smart Contract Platforms through a market cap-weighted portfolio designed to track the CoinDesk Smart Contract Platform Select Ex ETH Index. GSCPxE Fund holds the largest and most liquid digital assets, excluding ETH, that meet certain trading and custody requirements, and are classified in the Smart Contract Platform sector defined by CoinDesk Digital Asset Classification Standard (DACS); the weightings of each Fund Component change daily and are published around 4:00 p.m. NY-time. Additional information on the CoinDesk Smart Contract Platform Select Ex ETH Index methodology can be found at: https://www.coindesk.com/indices/scpxx/ .\n\nGrayscale intends to attempt to have shares of this new product quoted on a secondary market. However, there is no guarantee this will be successful. Although the shares of certain products have been approved for trading on a secondary market, investors in this product should not assume that the shares will ever obtain such an approval due to a variety of factors, including questions regulators such as the SEC, FINRA or other regulatory bodies may have regarding the product. As a result, shareholders of this product should be prepared to bear the risk of investment in the shares indefinitely.\n\nAbout Grayscale Investments®\n\nGrayscale enables investors to access the digital economy through a family of regulated and future-forward investment products. Founded in 2013, Grayscale has a proven track record and deep expertise as the world’s largest crypto asset manager. Investors, advisors, and allocators turn to Grayscale for single asset, diversified, and thematic exposure. Grayscale products are distributed by Grayscale Securities, LLC (Member FINRA/SIPC)."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNaHBRNjE0aHhBOExPNDhScFFBLVNzZmFaX29XZUdhS25FOW5hOGZZQ3htaDZTRE15MXExS2FsU01hZmR0WDNPNUxGaXhoSEx4RlU4X2xxZEtJM04xZWhmb1BxX3d2MF82em5QTmh1dEpWMEFtbXV0MjRnUEZzNDJuZXFlY0VlRlJfM2xj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "ETH/USD: Navigating The Volatile World Of Ethereum Trading - FinanceFeeds",
        "content": "In the rapidly evolving landscape of cryptocurrency,the ETH/USD trading pair stands as a critical indicator of market trends and investor sentiment towards Ethereum, the blockchain platform known for its smart contract functionality and as the birthplace of decentralized applications (dApps). Trading Ethereum against the US dollar, the world’s primary reserve currency, provides a fascinating glimpse into the interplay between digital innovation and traditional financial systems, reflecting broader economic trends and the growing acceptance of cryptocurrencies.\n\nEthereum’s native token, Ether (ETH), has experienced significant price fluctuations since its inception, driven by factors such as technological advancements, regulatory changes, and shifts in investor sentiment. These dynamics make the ETH/USD pair a focal point for traders and investors seeking to capitalize on the volatility of the crypto market. Understanding the factors that influence the value of Ether in relation to the US dollar is crucial for anyone looking to engage in trading or investing in Ethereum.\n\nThe value of ETH in USD terms is influenced by several key factors. Technological developments within the Ethereum ecosystem, such as upgrades to the platform’s scalability and efficiency, can have a significant impact on Ether’s price. For instance, the transition to Ethereum 2.0, which aims to improve the network’s scalability through the introduction of proof-of-stake consensus, has been closely watched by the market for its potential to enhance Ethereum’s utility and, consequently, the value of ETH.\n\nRegulatory news also plays a pivotal role in the ETH/USD price dynamics. Announcements regarding the regulation of cryptocurrencies in major economies can lead to significant price movements, as investors adjust their expectations based on the potential for increased adoption or regulatory hurdles. Furthermore, the overall sentiment in the cryptocurrency market, influenced by factors such as Bitcoin’s performance and broader economic indicators, can lead to fluctuations in the ETH/USD trading pair.\n\nFor traders and investors, keeping a close eye on these factors is essential for making informed decisions. Many turn to technical analysis, using charts and historical data to identify trends and predict future movements in the ETH/USD pair. Additionally, fundamental analysis, which involves evaluating Ethereum’s underlying technology and its adoption across different sectors, can provide insights into the long-term prospects of ETH.\n\nDespite the opportunities, trading ETH/USD comes with risks. The cryptocurrency market is known for its volatility, with prices capable of making dramatic swings in a short period. This environment requires a well-thought-out strategy, risk management techniques, and, importantly, an understanding that not all movements can be predicted.\n\nIn conclusion, the ETH/USD trading pair offers a window into the dynamic world of cryptocurrency, reflecting the ongoing evolution of Ethereum and its interaction with traditional financial systems. For those interested in the future of finance and technology, keeping an eye on the ETH/USD pair can provide valuable insights into the challenges and opportunities that lie ahead in the digital currency space. As Ethereum continues to develop and find new applications, the ETH/USD pair will undoubtedly remain a key barometer of the cryptocurrency market’s health and investor sentiment."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPWDFNcDFZb0pUMXFLLWtpemIxakRPQk9MSlhmRkNyN2J1MVBiaVNUNFByTE5TbTlabll3ZmVpS1MzQVlkZ1FyM2lib0FfanRvdjJIbC14N3FmbDZrbDFTbEdzZXZzOENETDJscmxrSDZxX2tiZU4wN1VwVG5uWUNHNnVIaGdnM1ZhQloyQXB5eTVjc0NjTzZ2cENxYk9sMHpXbVl0QVR2THZyYk9kMWhkSzUyUlhtMXY4ZDNIS1RKU0M0bnN6WnVDY2ctMEt2ZkZIVkRfWNIB2gFBVV95cUxNRXU0d19JS3E4TUltYklpUDVkaE52SUc3UmNMVTNqUnp5YVE3QkthNmJ1ZHdZVkl2a3ZkVGJtdjJsVGZyUjZSMUk1NVZnZjdjWk5jdjJuU1gtRXZTeDVoaGpKVVF4ZXdPbUhGWDU1Z0x0VGZZUGdhV0xmcG5nLXUwTmFZb1ZXdlBnaFdKZVAtWGwzYldOMDNnQzBtbHZfTTlEX0tZNV82bFd6VVVrbmRhVExBRVN0aFJpMGZFX25hZEdrM2hFaEg4NjRERXRyVmZjTkZ5Q21GTlhsdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ethereum continues consolidating as Q1 results show massive growth for the largest altcoin - FXStreet",
        "content": "Ethereum's network Q1 financial report shows that it tripled its earnings quarter-on-quarter to around $370 million.\n\nBitcoiner argues about ETH's security status as Bloomberg analyst James Seyffart labels it as a commodity.\n\nVanEck expects Ethereum Layer 2 chains to accrue more revenue than the main Ethereum chain by 2030.\n\nEthereum (ETH) sustained its consolidating movement for the second day on Thursday, trading above $3,300 after crashing earlier in the week. While this may signify indecisiveness among bulls and bears, its Q1 results show steady growth across various sectors even as community members debate on its commodity status.\n\nRead more: Ethereum drops further as Bitcoin’s decline, uncertainty over ETF weigh\n\nDaily digest market movers: L2s, Q1 earnings, ETH commodity status\n\nEthereum has been one of the most trending cryptocurrencies in the past few weeks. Despite expectations that anticipation for Bitcoin's halving would be the main subject of discussion, the SEC's decision on Ethereum ETFs and the recent crackdown on Ethereum Foundation appears to have taken center stage in the crypto community. That said, here's a quick breakdown of the latest happenings surrounding the largest altcoin:\n\nIn a report released on Wednesday, global asset manager VanEck analysts expect Ethereum Layer 2 networks to accrue more revenue than its main chain. They sighted data from crypto analysis firm Artemis XYZ, showing the increasing growth of the underlying Ethereum ecosystem against its Mainnet declining market share. L2s offer superior throughput and user experience, especially with the Dencun upgrade on March 13, which introduced Blob space – a data layer for L2 that reduces data overhead and gas fees – noted VanEck analysts.\n\nThe analysts further predicted that Ethereum L2s may be worth more than $1 trillion by 2030, considering several application, sector, or function-specific Layer 2s may emerge – like an asset management L2 or rollups that host a social media sector. They noted that these L2s reinforce \"the value of ETH as the true ‘oil’ powering the entire ecosystem of connected chains.”\n\nEthereum's Q1 financial report, released on Wednesday by Coin98 Analytics, showed significant growth in revenue and earnings. Ethereum's revenue grew nearly 84.6% quarter-on-quarter (QoQ) to reach $1.035 billion, and earnings reached $369.11 million, a 198.8% QoQ change. Much of this increase is attributed to the spike in gas fees before the Dencun upgrade. Other metrics from the report include 107 million transactions conducted with 9.7 million new addresses in Q1.\n\nFollowing ETH Q1 results was Cory Klippsten, CEO of Bitcoin financial service firm Swan.com, arguing in an X post on Wednesday that Ethereum was a security when it launched. He claimed the SEC didn't want to get in the way of another agency when it allowed the CME to start trading ETH futures ETF.\n\nHowever, Bloomberg analyst James Seyffart, who was tagged in the post, responded by stating that the ETH futures ETF was registered as \"commodities futures, not securities futures.\"\n\nIf the SEC wanted to come out and call Eth a security, they should not have approved the listing of #Ethereum futures ETFs which rely on these contracts. To go back and change that would likely mean the delisting and closing of CME ETH futures AND the ETH futures ETFs. Thus why… — James Seyffart (@JSeyff) April 3, 2024\n\nJames Seyffart also said in another X post that the SEC asking for public comments on spot Ethereum ETF filings is a normal procedure and \"not ‘bullish’ in any capacity for Ethereum ETFs.\"\n\nAlso read: Ethereum drops further as Bitcoin’s decline, uncertainty over ETF weigh\n\nTechnical analysis: Indecisiveness persists\n\nTraders are exercising more caution as Ethereum's price continues its horizontal move for a second consecutive day. This indicates reduced bullish sentiments for the largest altcoin.\n\nETH/USDT 1-hour chart\n\nRead more: Ethereum consolidates above $3,500 as Bitwise CIO says ETF delay would be positive\n\nIf Bitcoin’s price shows signs of recovery, ETH could resume an upward move to break past the $3,493 level, which is the high from April 2. . Further up, next resistances are at $3,517, $3,570, and $3,655, which also align with recent swing highs seen in the past few days.\n\nHowever, this thesis would be invalidated if ETH moves below the $3,204 support level, the low from April 2.\n\nThe SEC's decision on the May 23 deadline to respond to VanEck spot Ethereum ETF filings is expected to have a major effect on prices."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9uRzFXWmpLZjJXYTR6dTlVOW1ueC1FSFZicUtQZlVXOW5TdkZQYlVnMEJXOVlUc2pQNnNzR3psRUdPQWhURXpGTGx4V2VVd3pVZ2Znb0YzTG94MVJXZk1DWnU4eTMyNUxOM0lpMWIwMGdRc3A1bU1WM1NGRVRoZ9IBgwFBVV95cUxNaVcxaTBKaU9OTUl4MDR2cjNtVVkybFlLM0gtWjc4SU9yOV9HS3pLSEcxa3NycFpsaFo4Rk4tMENESDlmcmVudUNhaEFZMC1wMG9GRnlXVjdIODBiMkhuZWhvLTNJZDRGV3dyZjhSTk9qZUFESVUyS3RoR1JkSUl0VnNSOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Insider Teases 'Earth-Shattering' Reveal Tomorrow - Bitcoinist",
        "content": "Steven Nerayoff, a former advisor to Ethereum and now better known als “ETH insider or whistleblower”, has taken to X (formerly Twitter) to announce that the long wait for his potentially massive revelations is finally over tomorrow. Nerayoff, who has been at the center of various controversies and legal battles, made a dramatic statement on X, suggesting the unveiling of information that could potentially alter the public’s perception of the ETH ecosystem and its founders.\n\nNerayoff stated, “THE TIME HAS COME FOR THE EARTH-SHATTERING REVELATIONS OF FORMERLY UNTOUCHABLE POWERS: […] The most powerful forces on the planet sought to suppress us by maliciously targeting me, thinking it would silence us all. Despite their extreme power and vast resources, we emerged victorious […] The world is about to learn what we’ve pieced together starting tomorrow. Get ready: The perception of yesterday will be drastically altered. The world as we know it is about to change.”\n\nTHE TIME HAS COME FOR THE EARTH-SHATTERING REVELATIONS OF FORMERLY UNTOUCHABLE POWERS: The battle has been long, but it's a testament to how far we have come from where we started. The most powerful forces on the planet sought to suppress us by maliciously targeting me, thinking… pic.twitter.com/CvGkzkFhFg — Steven Nerayoff (@StevenNerayoff) April 3, 2024\n\nThe Ethereum Insider’s Big Reveal: What To Expect\n\nNerayoff has made several serious allegations against Vitalik Buterin, Joe Lubin, and the Ethereum Foundation, painting a complex picture of supposed misconduct and fraud within the ETH ecosystem. These allegations span various aspects of Ethereum’s development and operations, including fraudulent ICOs, personal misconduct, and collusion with corrupt officials.\n\nMisconduct and Fraud Allegations: Nerayoff accuses Buterin and Lubin of orchestrating a wide-ranging fraud within Ethereum, alleging their involvement in issuing fraudulent ICOs to fleece investors. He claims this activity was the main business model for Lubin’s company, ConsenSys, early on. Nerayoff asserts that the fraudulent activities surrounding ETH are far more significant than those in the FTX case, referring to Ethereum as “the fraudulent elephant in the room.”​\n\nIntellectual Property and Inventions Theft: Nerayoff claims that Buterin copied his ideas, including the concept of issuing utility tokens via ICOs. He argues that Buterin has not contributed any significant inventions to the network and attributes the network’s failure to scale to Buterin’s actions​​.\n\nAccusations of Collusion with US Officials: Furthermore, Nerayoff alleges that Buterin and Lubin colluded with corrupt US government officials, including SEC Chairman Gary Gensler and former SEC Chairperson Jay Clayton. He implies that these relationships aka “ETH Gate” gave ETH an unfair advantage in the crypto space​.\n\nCharacter Assassination and Reputation Damage: Nerayoff also accuses Buterin and his father of attempting to ruin his reputation by falsely accusing him of extorting an Ethereum ICO. This claim extends to suggesting that ETH’s founders have previously tried to frame him​ ​.\n\nCCP Involvement: According to Nerayoff, the Chinese Communist Party (CCP) holds a substantial stake in Ethereum, which he and TruthLabs claim jeopardizes the entire cryptocurrency world. TruthLabs suggest that Chinese entities close to the CCP control nearly 80% of mined ETH, raising alarms about the potential for centralized control over the Ethereum network.\n\nEthereum Foundation’s Connection to the Gatecoin Hack: TruthLabs and Steven Nerayoff have presented evidence suggesting the Ethereum Foundation’s connection to the 2016 Gatecoin hack, where 185,000 ETH were stolen. This investigation highlighted transactions from the foundation to wallets directly involved in the hack, raising serious questions about the Foundation’s role and motivations during this period.\n\nIt’s important to note that these allegations are part of an ongoing dispute and have not been substantiated with concrete evidence in the public domain thus far. The situation is complex, with Nerayoff positioning himself as a whistleblower intent on exposing what he perceives as deep-rooted issues within the Ethereum ecosystem. Tomorrow the world will find out what Nerayoff can really prove.\n\nAt press time, ETH traded at $3,309.\n\nFeatured image from YouTube, chart from TradingView.com"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE12UGRRd3FYa0VMV25vcDZCYWhna3FJWUtNa3dWTVpxTUFmc1ZVazY0Vmhxa0RsaldmTTR5aFNfUmwtUWxZbWxsQ29RMHpid3BuUDF1bnJmQ01fVFBHOUc3TE5SZm43V0JKOFBoZWROWnNkSGF4VmsxMHk2eDl1OEXSAYcBQVVfeXFMTUpqNzF1UDdDcXdONGRmTi1Ld1REYzJRbmlhQ0otTmZ6UWpHaG1TOW9FSWp4elVCNnlDSXhpYTNEY1BaVU80ZWV1ZXlMUmtnQlcxRmQxZ1VSc240TFFwUlNnM19aYzJjMGd0YkNzanJOYVRRNlMzZ2U5QnhRc256QS1yZ2RidWNv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ripple to Launch USD-Backed Stablecoin on Ethereum and XRP Ledger - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFintech firm Ripple announced Thursday that it plans to launch its own stablecoin pegged to the U.S. dollar across the Ethereum and XRP Ledger blockchains.\n\nSet to roll out later this year, an as-yet-unnamed crypto stablecoin will be fully backed by U.S. dollars, short-term U.S. government treasuries, and “other cash equivalents,” according to a release. Ripple says it will provide monthly attestations of its holdings that back the stablecoin, which will be audited by a third-party accounting firm.\n\nRipple Chief Technology Officer David Schwartz told Decrypt that the firm believes the current $150 billion stablecoin market is poised to explode in the coming years to become a multi-trillion-dollar market. They see a clear opportunity in that space.\n\n“We think we're uniquely positioned to have a competitive entry in that market,” he said. “We have our presence both on the institutional side with our payments product, and on the XRP Ledger side, we have some entry into the DeFi section of the space. Those are kind of the two big buckets in which stablecoins are being used today.”\n\nAD\n\nAD\n\nIt’s a space currently dominated by Tether (USDT) and USDC, both of which Ripple—the XRP-powered crypto payments platform and enterprise blockchain provider—has been watching closely for years.\n\n“We have a strong balance sheet. We’ve been around for a very long time,” Schwartz explained. “We have fantastic compliance—we've been doing compliance for payments for almost eight years now. We have an impressive suite of licenses.”\n\nSchwartz said that Ripple decided that there “has to be a U.S. jurisdictional nexus” around its stablecoin and added that the “easier thing to do would be kind of like what Tether did.” Tether is based in the British Virgin Islands.\n\nBut Ripple hopes to see a day when U.S. customers can “deposit a stablecoin at your bank,” and merge the enterprise and retail use cases with the traditional finance sphere.\n\nAD\n\nAD\n\nWhy launch a stablecoin now? Schwartz said the idea had been tossed around at Ripple for some time, jokingly at first. He recalled conversations like, ”It would make our life easier. It's a license to print money, you know—but not seriously.”\n\nBut the more they simmered on the idea, he told Decrypt, the more it really made sense. Some of the reasons included demand from emerging markets that may not have great access to dollarized assets, and interest from enterprise firms in stablecoin adoption. Schwartz said that Ripple has been speaking with customers that don’t use existing stablecoins, and asking why that is.\n\nHe added that there “aren’t a lot of great stablecoins on the XRP Ledger,” and as Ripple supports expanding use cases on the chain—such as an automated market maker (AMM) feature on the horizon—Schwartz said that there was a need for another prominent asset on the chain besides XRP itself.\n\n“You can't make a market between one asset, right?” he said. “The more great assets, the more compelling the trading.”\n\nRipple’s upcoming stablecoin will debut across Ethereum and XRP Ledger, but the firm expects to expand it to additional blockchains over time as it sees demand and use cases. In fact, Schwartz said part of why it’s being announced well before the expected rollout is so that Ripple can survey engagement and see where potential next opportunities are.\n\n“We have some ideas of where we think we're going to be successful, and what's going to be our next direction,” he said. “But obviously, it's going to be very subject to adjustment based on how this resonates in the market.”\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOelZOWU01ZmhlYWdzWXB5VExEVE5ZVjMxOTJ5cE43bThac1VGZnc2YTQzUnh5VEZnYkhvb3JJd3JhWTRhbWxXd09tYThjeVdFVmxMSEExSkRxOXVfZGI0RHpJbndld1RTVnpBRnk3Q3hUdnpCbFJpQlN2OVBUNzljOUxkTXdpajJLdHBWMGVR0gGTAUFVX3lxTE1kVjludi1OZVFTWDNjd2lZeDQzVHdTNmpyV1A3T2Rva2Fad3VzdlJFMmVRb25ib0RiNUpLcTd4RzJFdGdpVDJyak12WFRzWVJhWnpOb2dnU2dqNHBHNXF3eG5hX0FVQ0lEZFZ0NmVSeGZ2czhfc05DMVBfQUdlRWRQcTVqXzNyQ29yU1RXcGp5Nmdnbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Ethereum, tokenized RWAs will became part of capital markets if… - AMBCrypto News",
        "content": "RWA is still in the early stages, but the BlackRock move could increase momentum.\n\nSecuritize founder believes that mainstream adoption is feasible if RWA hit $1 trillion mark.\n\nCarlos Domingo, Securitize’s founder and CEO, has reiterated that tokenized real-world assets (RWA) will gain momentum if they reach the $1 trillion milestone.\n\nDomingo, whose firm handles BlackRock’s tokenized BUIDL Fund tokens redemptions and placement, emphasized that;\n\n“For tokenized real-world assets, I think we’re in the early stages—like what crypto was before. Even if you add stablecoins, we’re still not at the $200B/$300B mark.”\n\nHe added,\n\n\n\n“As an industry, I think once we hit the $1 trillion mark of real-world assets on-chain, that’s when this becomes an important part of capital markets and financial services.”\n\nHowever, the RWA segment could hit the $1 trillion milestone in the next 2-5 years. Especially as momentum picks up after BlackRock’s foray with its Ethereum [ETH]-based BUIDL Fund.\n\n\n\nBeyond BUIDL Fund and tokenized US treasuries\n\nAfter its impact on spot Bitcoin [BTC] ETFs, market watchers have keenly tracked BlackRock’s digital asset strategy.\n\nThe move into tokenized real-world assets (RWA) through its Ethereum-based BUIDL (BlackRock USD Institutional Digital Liquidity) Fund has heated up tokenized US treasuries.\n\n\n\nThe overall tokenized US treasuries hit the $1 billion mark shortly after BUIDL’s debut, per Dune Analytics data.\n\nAccording to Domingo, with stablecoins’ total market cap of around $152 billion, adding $1 billion of tokenized US treasuries still makes the RWA less attractive to some players.\n\nHowever, Domingo highlighted that credit will be the next target in the tokenization pipeline after US treasuries and securities.\n\n\n\n“Tokenized cash is number one. Then, tokenized treasuries and money market funds. But, then credit is the next one with less liquidity but higher yield.”\n\nOndo Finance echoed a similar sentiment, noting that tokenizing a fraction of the US money market fund can tip the RWA sector to surpass even the BTC market cap.\n\nCiting a recent Cumberland report, Ondo highlighted,\n\n“Money market fund AUM at the beginning of 2023 was around $8.4T” and if 1.5% of that issuance were to move on-chain, it would be larger than the current market cap of stablecoins. If 7.5% of it moved on-chain, it would be larger than Bitcoin.”\n\nTo put it differently, tokenizing about 10% of money market fund AUM (assets under management) is enough to rival BTC.\n\nIf BlackRock’s RWA move through BUIDL Fund attracts more players, the $1 trillion mark could be fast-tracked."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOajJnNkdFRFotdzRhV3Rhc1pHMUgxbTZjbi1QV1ZwVzlYdU5CNXBZQ1VPcnFuNTRJMVdrWXBVMExXRWJwTGo2QnJTWjN3TGVZWDk1VzB0RVlnd2hlYUwyZXpCOFJZVDVnWExwblZqSHY3NS1Ec0JzeXBhenhmbWNnLUFxVkJMTFgwZkpn0gGQAUFVX3lxTE1HTlpsVGprSExKb0N3dGlSbFE3WUd1Q21BdTVxTmYxbUQ3RlA5WXdIMXY0NDF3OW52S0FVazVEOWdpR1pSclNGMnlERzQzZl9MLUpfVkFiTjdwaHJQaUJiLTFfal9XNnRjSXB1TFllTE14Wlo3R2ZoRXV0cTRGT205Qld6aThEUnlOWTh5SmRaTw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ethereum ETF’s status – Here’s why this isn’t ‘bullish in any capacity’ - AMBCrypto News",
        "content": "US SEC seeks comments on ETH ETF applications for Grayscale, Bitwise and Bitwise.\n\nAnalyst maintains low odds of May approval, calls the comments “standard procedure.”\n\nOn the 3rd of April 2024, the U.S. Securities and Exchange Commission (SEC) opened a public comments period for Ethereum [ETH] ETF filing amendments tied to Bitwise, Fidelity and Grayscale.\n\nThe public comment period will run for 21 days. This development has excited some crypto users, who term the development a “giga bullish” scenario for ETH.\n\nUnfortunately, one of the industry analysts has poured cold water on it. James Seyffart, a Bloomberg ETF analyst, called the public comment window “standard procedure.”\n\n\n\n“Asking for public comments on a 19b-4 is standard procedure. Every single 19b-4 ETF filing goes through the same process (whether approved or denied). It’s not “bullish” in any capacity for Ethereum ETFs.”\n\nETH ETF: May approval dilemma\n\nAsked whether BlackRock will be able to pull approval for its spot in Ethereum ETF, Seyffart said,\n\n\n\n“Good question. I’d assume they wouldn’t withdraw, but I wouldn’t put it past Larry to pull a rabbit out of a hat, either. Haha. We are low odds—but not zero for a reason.”\n\nThat’s an outright dilemma for May approval.\n\nHowever, Sam Enzer, partner at Cahill Gordon and Reindel, claims that the SEC could reject approval in May due to the risk of market manipulation.\n\n“I think the SEC, at least in the first instance, will deny or reject the applications. I think they’ll rely on similar arguments that there is a risk of market manipulation, that they need more surveillance.”\n\nAdditionally, Enzer highlighted that ETH staking could be one of the biggest concerns for the SEC.\n\nAmidst the May approval dilemma, ETH has slumped 9% on weekly charts, dropping from $3645 to $3200, partly because of Bitcoin’s [BTC] massive drawdown.\n\nShould the bearish overhangs from the current unfavorable macro front persist, ETH bears could extend the drop to a $3000 psychological level."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNUkJXS1VUS0NZZTdhSVJxUThYWTdzMGhzbkRWRUFKYzRNbDJiTW1hZ3phclo1bUl5MVR3SWFZZTdMOTJSWDl2S1oxRV9TbkVuSkRRLWtsak51YUxMYXRVUlYzOVFENHVOMF9RUDJfUmJIaUVVbm5BWG02clR0WDFkOURyZTI2TGxoY1RUUUFB0gGTAUFVX3lxTE9nZ2ZDa3lIM0xEQ3JDODdjakhmVFdqXzBrd2VBbHdqVFFPWXU0VnF6VGVSNXNDZEx3dVE4MUpJanp6aHpzZ1QwUXFyQ0dzZWxyek5xdzh5YXAwa1lkREF2UGZBdW5jVTVhRDFmSDVrUWhad3g5ZDMtOU9KLTJWREFKUjR4d2x6LTJuNUxxR05RSUh4aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Ethereum holders, forget hitting $4K; Will ETH’s price hold on to $3K? - AMBCrypto News",
        "content": "Ethereum could see its market structure flipped bearishly upon a descent below $3050.\n\nThe momentum and selling pressure were rising steadily and could force more losses.\n\nThe past 24 hours saw a strong wave of selling pressure. Bitcoin [BTC] and Ethereum [ETH] noted losses of 7%-8% each, and a deeper drop appeared likely. The $3.5k level was a key short-term support for ETH.\n\nCrypto analyst Ali Martinez noted that a bear pennant formation was brewing. If it came to fruition, a drop to $2.8k could be on the cards. Will the bears fulfill this prediction?\n\nThe bear pennant or the demand zone- who will win this round?\n\nAMBCrypto highlighted the pennant formation in white. Based on the length of the flagpole, a drop to $2.6k could commence. The $2.8k-$2.9k was a region where ETH consolidated in February before its push beyond $3k.\n\nHence, it could serve as support on the way down and repulse the bears. The $3.1k region was also a lower timeframe bullish order block which saw a significant reaction from the price earlier this month.\n\nThe trading volume has decreased over the past two weeks as Ethereum formed a bearish pattern. The break beneath the rising trendline confirmed the pattern was playing out. A fall below $3056 will flip the market structure bearishly on the 12-hour chart.\n\nEthereum was undervalued, but should you rush to buy it now?\n\nAMBCrypto’s analysis of some of Ethereum’s on-chain metrics noted positive findings for investors. The 30-day MVRV ratio has been below zero since 18th March, showing an undervalued asset.\n\nYet, the mean coin age, which had trended downward since the 9th of February, began to trend higher.\n\nTogether, it was a strong buy signal. However, this signal is not a short-term one. Risk management needs to be formulated based on technical analysis as well, and at press time, the bears have the advantage.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nComparing the network growth in March to January, it showed that an increasing number of new addresses were created on the network.\n\nThe total Open Interest fell alongside the price to indicate short-term bearish sentiment. However, the evidence at hand showed that a drop to $3.1k or $2.6k would still present a buying opportunity for long-term holders."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE1UYWJORkJYUDlFR1JZTnBEa0JiZmJRMmEwbndRSEkyN29wcTRzUmdTV0xteDkzRFhOSGFYNHdCTXp2MkphcHB4azJLUkxOTEpDTGFGVS1xOGNXQ0FIR3NaazlxcjZyeXU4U2tUYkNTaWJIZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Why Ripple Is Launching a Stablecoin - Investopedia",
        "content": "Key Takeaways Blockchain technology company Ripple on Thursday announced a plan to issue a U.S. dollar-backed stablecoin on the XRP Ledger and Ethereum networks.\n\nStablecoins operate at the center of the emerging decentralized finance (DeFi) sector, and this new stablecoin issuance is intended to attract new users and liquidity to XRP Ledger.\n\nCurrently, Tether USD is by far the largest stablecoin when measured by market capitalization, with more than $100 billion worth of tokens in circulation.\n\nBlockchain technology company Ripple said Thursday that it plans to launch a U.S. dollar-denominated stablecoin in an effort to bridge the gap between cryptocurrency and traditional finance and to generate more uses and liquidity for the XRP Ledger blockchain.\n\nRipple's new stablecoin will be issued on both the XRP Ledger and Ethereum networks at first, and the main goal is to drive more liquidity, developers, and users to XRP Ledger, which is the native blockchain of the digital asset XRP. It joins the growing stablecoin market, in which crypto tokens are pegged 1:1 to the U.S. dollar and are backed by U.S. dollar deposits, short-term U.S. Treasurys, and other cash equivalents.\n\nThe Ripple stablecoin is also expected to be launched on additional blockchains over time. “This is a natural step for Ripple to continue bridging the gap between traditional finance and crypto,” Ripple CEO Brad Garlinghouse said in a statement.\n\nRipple continues to deal with a lawsuit from the Securities and Exchange Commission (SEC) regarding the legal classification of XRP as a security.\n\nDeFi Is Built on Stablecoins\n\nAs a massive holder of XRP, Ripple has an incentive to bring more financial activity to XRP Ledger. And it's no secret that the decentralized finance (DeFi) sector is mostly built on stablecoins on various blockchains.\n\nFor example, six of the top 10 trading pairs ranked by seven-day trading volume on the version of DeFi exchange Uniswap that exists on Ethereum involved at least one stablecoin as of Thursday. Additionally, three of the top five borrowed assets on the Ethereum version of open-source liquidity protocol Aave are stablecoins.\n\nWrapped Bitcoin, which is a token backed by Bitcoin that's held by digital asset custody provider BitGo in a manner similar to a stablecoin, is also a top asset used in these DeFi apps.\n\nWay To Attract More Users to XRP Ledger\n\nWith so much concentration of DeFi activity in stablecoins, Ripple said it sees the issuance of its own stablecoin as a way to attract users to the XRP Ledger ecosystem.\n\n“The XRP Ledger’s native capabilities, including a decentralized exchange and automated market maker, were built to utilize XRP as the bridge asset,\" Ripple President Monica Long said. \"Bringing a trusted stablecoin onto XRPL will drive more adoption and development, contributing to a vibrant ecosystem.”\n\n\n\nTether (USDT) is the current juggernaut of the stablecoin market, with a total value of just over $106 billion in circulation on various blockchains as of Thursday, according to data from CoinMarketCap. The only other noteworthy stablecoin offering in terms of size is USD Coin, which had a total market cap of just under $33 billion as of Thursday afternoon."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQTjdvdkRXQW42RjJIRkZ0RlFBcVhMYVNmYjNEb2tQbU9RMmphUUNWWTB4Ry1nSmtlcDFGbFFhdVlwTFZYeUdiRDc2QjR6SWI5VEJUZEVtY0ZJOXFRZzFRbzJ3UHRfM3FKMkd3VDNsUmRmcEFWNXVfZV9YSHM4WjFsYXlzYUxadXB5XzBCY2Z3LVIxUEdsaU5BWVFOSHR2cFlfY0ZUbTJyeTJuNDdQMmtGSjR5NWgtVTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "VanEck’s opinion on Ethereum’s layer-2: evaluation of 1 trillion dollars by 2030 - The Cryptonomist",
        "content": "Recently, the prestigious investment company VanEck has published its vision regarding the medium-term future of Ethereum’s layer-2, now on the lips of all users of the decentralized world.\n\nThe hedge fund predicts a bright future for this sector niche, which could reach a valuation of 1,000 billion dollars by 2030.\n\nAt the same time, however, a parallel failure of many solutions that will not be able to emerge in the midst of fierce competition is expected.\n\nBelow all the details.\n\nVaneck on Ethereum’s layer-2: bullish even if many will disappear\n\nThe US Fund Manager VanEck, recently involved in the loud request for an ETH spot ETF to the SEC, has just revealed a contrasting medium-term view on the future of Ethereum’s layer-2 solutions.\n\nAccording to studies by the well-known investment company, the sector could experience growth of up to $1 trillion by 2030 in a context where blockchain is able to overcome the scalability limits currently affecting it.\n\nEthereum Layer-2 market cap hitting $1 trillion by 2030\n\n\n\nCiting scalability solutions like Optimistic and Zk Roll-Ups.\n\n\n\n-According to a new research report published by VanEck on April 3. 👇#Ethereum #EthereumETF #Bitcoin pic.twitter.com/2ksarqs4pb — Bitinning (@bitinning) April 4, 2024\n\nSpecifically, VanEck analysts Patrick Bush and Matthew Sigel estimate that Ethereum will eventually capture 60% of the market share across all public decentralized networks, establishing itself as the most widely used cryptographic network in the world.\n\nCurrently, the Ethereum layer-2 market is worth 39 billion dollars, with Arbitrum, Optimism, and Base leading the ranking:\n\nOn one hand, VanEck shows a predominantly bullish trend for this niche of the Ethereum universe, on the other hand, it believes that the competition in the sector will make several projects obsolete.\n\nOn the long-term prospects of many of these second-level networks, the company actually considers them “generally bearish“, with a good portion of them destined to disappear.\n\nVanEck has predicted that out of the 46 L2 chains currently on the market, despite the positive outlook that will attract new investments, the emergence of dozens of other competitors will lead to the failure of many of these.\n\nAs shown by the data from L2Beat, the top 3 layer-2 solutions on Ethereum alone capture about $29.3 billion, more than 70% of the total TVL of the sector.\n\nSigel and Bush also believe that the tokens of these infrastructures have a still too high unlocked supply, potentially harmful to the market due to a too aggressive dilution.\n\nHere is what the analysts reported verbatim:\n\n“The first 7 tokens for L2 collectively already have a $40 billion FDV and there are many strong projects planning to launch in the medium term. This means that there is potentially an additional $100 billion in FDV in L2 tokens that will enter the market in the next 12-18 months. It seems like a bridge too far for the cryptocurrency market to absorb even limited amounts of such supply without huge discounts.”\n\nIn such a scenario, only the most innovative solutions capable of obtaining a constant flow of active users and on-chain volumes will be able to survive and benefit from the growth of the Ethereum world.\n\nThe Outlook of the Ethereum World: The Most Promising L2 Solutions\n\nWhile the Ethereum layer-2 sector shows more and more signs of congestion, significant of excessive competition, the best solutions are preparing to attract the next phase of mass adoption.\n\nAt this moment, the safest L2s to bet on for the future are the top 3 networks Arbitrum, Optimism, and Base which form a separate market thanks to their much higher valuation compared to other contenders.\n\nBase in particular could have a preferential adoption channel in the future, being supported by the large cryptocurrency exchange Coinbase which boasts a sum of about 7 million monthly active users.\n\nFollowing are other layer-2 solutions that likely have a chance to establish themselves in this world of sharks: Blast, Starknet, ZkSync Era, Zora, Scroll, Linea, Fraxtal, Mantle, and Mode Network.\n\nAmong those who can rely on luxury backers, such as Consensys for Linea or Matter Labs for zkSync, and among those with innovative infrastructural features like Fraxtal and Mode, all these solutions could play a crucial role in the future of Ethereum.\n\nMany other networks, on the other hand, which generally have a TVL lower than 100 million dollars, may struggle to find their ideal role.\n\nAs layer-2 solutions, these blockchains serve solely as an alternative channel to reduce the workload on the Ethereum mainnet, helping the main network in terms of scalability.\n\nThe most requested qualities, in addition to the presence of a rich ecosystem of opportunities guaranteed by important backers, are therefore those of fast transaction execution and competitive commission costs.\n\nOnly the best will survive this race for cryptographic efficiency.\n\nSpeaking of fees, we emphasize how the recent Dencun update has allowed for a significant reduction in fees on L2."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNMk5iZUxaQkFLdDlhTGpZMkQtVWwzSXpiMjRzX3pCNUEyWENrS3hDUzM0OXREUmw2ejhkNlhzNUl5TTExZXpVQ2ZiazU2WldxUEl1SGliZjVCNXo0STkyX1NxLWtNbElCMnY1Z20yQUhPNVkweTBwaUNUVG9WVTRCOHNqc0QwYjV6M3NUbnFPRFdVMFE0SjZwLVd6aEhjNXNGWXlJT2t4SGVSSU5SOGZlUlU1Y1hxTEJ1VG5OSEp1QWTSAcYBQVVfeXFMT21ZRTFJaEpucllNMkhqQTA5T2EzZy15QWQ4T2wyLWNjTDJQcEJPdmdmT1NJN0oxWTNCaU1sckZYdnJDMU40Mk1UNmdiV0pQVnhhZkt1U3pJZjNpNkQ5em40WV9ZWTI3U3FEbFpsYndsQUM2cjV0Zmw1VmFOckhTQXdmY016bm43UTdCY241cFp1a2sxNlZYT2R2SmY5QzN1RUNxQmVEYzA1aGVGMkg2NHdlNzlHdWZsdGZSWFRtajYtNUJqZFR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ethereum L2 tokens to hit $1T market cap by 2030: Van Eck analysts - Forbes India",
        "content": "\n\n\n\nCrypto is expecting a significant bull run, with the total crypto market cap at over $2.5 trillion as of April 4, 2024. Bitcoin has a big share here, at about $1.302 trillion, breaking into the top 10 assets in the world by market capitalisation and taking the ninth spot.\n\n\n\nExperts have been issuing optimistic forecasts in the long term across all sectors of the crypto economy, including a recent prediction from Van Eck analysts: they expect Ethereum layer 2 tokens to hit $1 trillion in market capitalisation by 2030.\n\n\n\nTo elaborate on this: said Van Eck analysts were bearish on these L2 tokens owing to tight competition, but they do see Ethereum layer 2 scaling networks reaching $1 trillion in market cap and being made up of many use case-specific chains by 2030.\n\n\n\nAs Van Eck’s Patrick Bush- senior digital assets investment analyst, and Matthew Sigel- digital assets research head, stated, these layer 2 blockchains are all about solving for the primary challenge Ethereum faces, which is “limited capacity to process, store, and compute data.” They expect Ethereum to expand to about 60 percent of the market share throughout all public blockchains, and the estimation of the volume of assets harboured on Ethereum based on this prediction amounts to the $1 trillion amount they have mentioned.\n\n\n\nNotably, Ethereum’s scalability challenges have long been highlighted by the crypto community, especially as Ethereum situated itself at the heart of DeFi with its smart contract functionality. As the aforementioned Van Eck analysts stated, “Ethereum’s dominance in smart contracts faces a critical hurdle: scalability…. While the network offers unparalleled security and decentralisation, transaction fees and processing times soar when usage intensifies.”\n\n\n\nThe proof of stake transition is expected to take care of a part of these challenges in the coming years, but layer 2 protocols to share the burden are expected to remain as relevant as ever.\n\n\n\nThe recent Dencun upgrade for Ethereum in March brought down layer 2 transaction fees through data-saving features called ‘Blobs’, which shows the network is putting thought into making layer 2 data processing more efficient. As institutional interest grows in Ethereum, the blockchain seemingly has an upward trajectory ahead.\n\n\n\nShashank is the founder of yMedia. He ventured into crypto in 2013 and is an ETH maximalist.\n\nTwitter: @bhardwajshash\n\n\n\n"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1nR2VQWTJZT3ltN0lGbU54UEZZNUt3VDR6ejVBWU1ieGxzd05yc1R2N2s2dk51alhDY3Vzd1dDUUFSYWtxNWs5ZEw5MnR2dHNBbUxVOUNMcTZWdHA4aGxoblFwMFNoWFpFREc0a2dOMHQ2d0FPM3fSAXtBVV95cUxOd21YQ2k5RzZ5REFjZWZCZFhOMjFSRklsa1kzTTVmd2RsU29CQnR6Vi1NUDdPaWJTelRwWnJoU0Vidk10YUhWc19wWTBqUVdKMkdOSjZ5b2lFRjFFMWE4aFE2ZWtsU19oTVB4bk5GdnJEcUZ1OFY2UEpBNjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Ethereum leads NFT sales with a slight uptick - Forkast News",
        "content": "Ethereum rose to the top position in the non-fungible tokens (NFT) market with sales reaching US$10 million, marking a 0.14% increase over the last 24 hours to 12 p.m. ET Tuesday.\n\nEthereum leads the NFT market in all-time sales volume, which stands at US$43.45 billion, according to data from CryptoSlam.\n\nBitcoin, ranking second on Tuesday, experienced a decline in sales by 17.39%, totaling US$8.15 million to drop out of the top spot.\n\nBitcoin has reached US$3 billion in all-time sales, ranking it fourth in the market, and is quickly catching up to Ronin’s US$4.26 billion for third place. Ronin added US$2.4 billion to its total in March.\n\nMeanwhile, Bitcoin increased its total by over US$1.1 billion in the first three months of 2024, including a half-billion-dollar boost last month.\n\nSolana, in third place, reported a significant sales increase of 43.13%, reaching US$7.57 million.\n\nSolana’s all-time sales volume is US$5.32 billion, securing the second spot in the historical rankings.\n\nThe fourth-ranked blockchain over the past day, Mythos, saw a decrease in sales by 8.39%, with a total of US$1.12 million. Its wash sales, however, increased by 56.47%, which did not significantly affect its overall sales performance.\n\nDMarket, NFTs and in-game items on Mythos, could not replicate yesterday’s success, when it led all NFT collections in sales volume.\n\nDMarket sales dropped 10.8% on Tuesday to US$1.07 million."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPQVFOMlEzMzEzMFI5SVkxMTd3NEROU3RrbmhTY0U3TjNKcGlGNFNrbzZtQ0pIQ0tINk1xQmdyMEpvMDhjM19JVHhRc1V6dFhvUTd6VS1pV20zZ3hsOG0yVmxDUlBLN1d1SmpyeTNRQ0xBaTBvT2JpS1pseHpvaW1pTnZ3NFJ4WHdwdFpmb2h1cktYYmdpSnYwQ0FtejVfS1ZpZE00d19seTk4MkJDc2xzVU9uZWdKMFF1cW4taVF5RDRlOTlmNm9ZeU9Zb3JkU3FuRUt5UElMNWR1OUot0gHiAUFVX3lxTE9Gclg1SENNb0JYLWxjcENDRmR4ZF80TzFGMXpKTkZoMmhnVUw1aGpuNXBselpNZjBVbVp2aHVveG5uSU9oYThqalhIMnMzZFh5QXFpVmV0YmVMXzN1RWEyTmhoR203eTRzNzdpN0dnN1F5b0IwSkdOVjA0WV9PN2N6SGVhaVJhWGxTcnFkRUR0RG5HY3pUczRXbEN3QnRBLTFEWFp4STcyQV9xMmFaNGxxNXFBemljc215UlFhRmVDWlNPVGFDQkRSX3YwTk1zQVlTaDllOTZUWHdfd2U3TU9KYmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "How does the SEC view the Spot Ethereum ETF applications? - FXStreet",
        "content": "The Securities and Exchange Commission asked for public comments on three Spot Ethereum ETF applications.\n\nComments on the Fidelity Ethereum Fund, Grayscale Ethereum Trust and Bitwise Ethereum Trust are due in 21 days.\n\nBloomberg ETF analyst Eric Balchunas says the odds of a Spot ETH ETF approval by May 2024 are a pessimistic 25%.\n\nUS financial regulator Securities and Exchange Commission (SEC) is taking steps towards its decision on a Spot Ethereum (ETH) Exchange-Traded Fund (ETF) by calling for public comments on three applications.\n\nA recent filing shows the SEC called interested parties to comment on the Fidelity Ethereum Fund, Grayscale Ethereum Trust and Bitwise Ethereum Trust. The SEC had previously asked public commenters to explain if they agree with Fidelity, BlackRock, Cboe and Nasdaq that arguments made in favor of the recently approved spot Bitcoin ETFs support Ethereum ETF.\n\nSpot Ethereum ETF filings get SEC attention\n\nWhile Bloomberg’s ETF analyst, Eric Balchunas, places the odds of a Spot Ethereum ETF at a pessimistic 25%, the SEC has taken necessary steps and called for public comment on three applications, according to a filing dated April 2, 2024.\n\nRe Eth ETF approval, we are holding the line at 25% odds altho tbh it is a very pessimistic 25%. The lack of engagement seems to be purposeful vs procrastination. No positive signs/intel anywhere you look. Personally hope they do approve it but it just ain't looking good. https://t.co/nuBdCDE18L — Eric Balchunas (@EricBalchunas) March 25, 2024\n\nEthereum holders' sentiment has likely dampened as analysts share dismal odds of an approval by May 2024. Crypto expert Vijay Boyapati critiques the need for a product like a Spot ETH ETF and argues that owners are unlikely to get staking yield on their Ethereum holdings and this makes it less attractive for investors.\n\nOne of the big disadvantages of Ethereum ETFs (which seem very unlikely to be approved) is that owners are unlikely to get staking yield.\n\n\n\nAnd if you don't get that yield, your holdings are essentially being inflated away relative to everyone else who does. — Vijay Boyapati (@real_vijay) April 2, 2024\n\nIn a recent interview with Forbes Crypto, Bitwise CIO Matt Hougan said that the asset management industry is too focused on Bitcoin, with the upcoming halving event. This takes away the necessary attention needed by an Ethereum ETF product to thrive.\n\nPolymarket, a decentralized prediction market platform, places the odds of an Ethereum ETF approval by May 31 at 19% on Wednesday. Odds have consistently declined throughout March 2024.\n\nEthereum ETF approval odds on Polymarket\n\nAt the time of writing, ETH price is $3,304, up nearly 1% on the day."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5CSWxKYkxqNU5UbzF3SjA4X0lKdkx5dUs5NkV1SWE2RmdaLUV4Ymh4X1EzZVN4OElUX21BSldFYTRneUFhbkRqeFN2UWw0YU5lVGRjM3VUUHlJbzBFM2NZNWZFQmJmdGp3dDlQM3NfZ1RZcVJQWUxoSXNWMUZKUdIBgwFBVV95cUxPb2ZEWjZKeXB2ZjctdEo1OTlRNjR1cy1OZ1M3d1VZMGVvd3hLaElBcUJmbE5fWF9DY2c1SjN1U3B3UlJBV3A4VU9jeUtGNnlGanlOZE5Vb3dHQVEtZnNwb2pzWmR2dTN6XzNNNDBQX3FnM1JpYXM1STFJbng0VG4xTi15OA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ethereum: How L2 activity helped its fees remain steady - AMBCrypto News",
        "content": "L2 scaling recently saw an all-time high.\n\nEthereum’s overall fee was over 13.4 million.\n\nThe Ethereum [ETH] Layer 2 (L2) ecosystem has been expanding, with a recent surge in the number of transactions per second (TPS).\n\nNotably, within the L2 space, Base has emerged with particularly impressive performance metrics.\n\nEthereum L2 registers more scale\n\nBased on information from L2 Beat, Ethereum scaling experienced a notable increase at the beginning of April, reaching a new peak on the 2nd of April.\n\nAMBCrypto’s look at the Layer 2 data indicated a surge in the transaction count, surpassing 156 transactions and marking a record high.\n\nThe scaling metric rose to approximately 11.2, indicating it handled more transactions than the Ethereum mainchain.\n\nAs of press time, the transactions per second (TPS) had slightly decreased to around 147, but the scaling trend has remained upward. Presently, the scaling figure stands at about 11.3.\n\nBase dominates Ethereum L2 space\n\nBased on data from IntoTheBlock, Base has established itself as a prominent Ethereum Layer 2 (L2) solution, which is evident from recent statistics.\n\nIt boasted approximately 890,000 active addresses, indicating the highest number of active addresses among L2 platforms.\n\nAdditionally, its transaction volume surpassed $1.6 billion, three times greater than its nearest competitor, Optimism [OP]. On the 2nd of April, the network processed 2.6 million transactions.\n\nHowever, when considering Total Value Locked (TVL) and Transactions Per Second (TPS), data from L2 Beat revealed that Base lagged behind other L2 networks.\n\nEthereum fees remain low\n\nDespite the increased activity witnessed on its Layer 2 (L2) solution, Ethereum’s fees have remained relatively low. As of the time of writing, the total fee was over $13.4 million.\n\nAMBCrypto’s analysis of the fee trend indicated an overall decline over the past few weeks.\n\nThis decline commenced around the 13th of March, coinciding with a significant network upgrade and contributing to lower gas prices on L2 networks.\n\nETH was trading at around $3,301 at the time of writing, experiencing a less than 1% decrease.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThe daily timeframe chart analysis revealed that the king of altcoins was among the few assets that closed the previous trading session with a profit.\n\nThe altcoin concluded trading on the 3rd of April with a price increase of over 1%."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQVGpsMnl0WHp2UUhQTFpXNkxtd2Nld2dxa1RocmJ2ZE9iYTRNOWwwVU1qWEJCclRST05kS1B6YkFnNG9tcGFOaThIeDFRVGRvRWdacWQxaTNiajF0RG9JWml0YTVZUk9GRVJHMGxkQjVQY1NqU1hUNlp1UWdiQXRtUk85b0hPQlN5NjJoelVn0gGTAUFVX3lxTE8wV3RJOHFEanlSbXVobTgzWHJ3WDBsSEUyYV92dmwwWVZEeG9HaXNQeE82eDJKWFNsZW9NaFMxY2Z6aGZvRFc3M3R6MzIyTGE1UEFrVE5ub05iQTRxcWlnYzFZVjJlYk9RSkFoTXMxcnhJdnFqVmU1NUlHeGd5YmMzZDdYLWtkY3F0cnBadHd6MTgxQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum racing to ‘a billion at 2x speed of Internet’ on this front - AMBCrypto News",
        "content": "Global crypto users crossed the 500 million mark at the end of 2023.\n\nBitcoin maximalist Raulo Pal believes the number of users could hit 1 billion by 2025.\n\nAfter an impressive 60% rally in Q1 2024, Bitcoin [BTC] had a slight setback at the start of Q2. It dropped over 5%, slipping from $71K to $64.5K before attempting to reclaim $66K.\n\nAmidst the drawdown, Raulo Pal, a Bitcoin maximalist, reminded his X (formerly Twitter) followers that the crypto’s adoption rate could reach 1 billion users by 2025.\n\n“On days like today, just remember that crypto is still being adopted at twice the speed of the internet and should reach something like 1 billion users by the end of 2025.”\n\nCurrent crypto adoption rates\n\nA 2023 report by Crypto.com exchange showed that global crypto users crossed the 500 million mark and hit 580M by December 2023.\n\n“Global cryptocurrency owners increased by 34% in 2023, rising from 432 million in January to 580 million in December.”\n\n\n\nOver the same period, Ethereum [ETH] owners surged from 89 million to 124 million. The report cited liquid staking for the growth. On the global scope, ETH owners constituted 21% of users.\n\nOn the other hand, BTC owners increased from 222M to 296M and accounted for 51% of global users. The growth was linked to spot BTC ETFs and Bitcoin Ordinals.\n\nBut, as per data from the digital currency payment platform Triple-A, there were around 420 million crypto users in 2023, with more than half (268M) coming from Asia.\n\nHowever, the Chainalysis Global Crypto Adoption Index report noted that most crypto adoption occurred in low and middle-income (LMI) countries in Asia and Africa in 2023.\n\nLMI accounts for about 40% of the world’s population, which tipped Chainalysis to highlight that;\n\n“If LMI countries are the future, then the data indicates that crypto is going to be a big part of that future.”\n\nThat said, an explosive surge to 1 billion crypto users by 2025 could be a big deal for digital assets."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE1mSkJjVDlBdE5va0tCam1wRVNrQUl0T05iVVNzSER6Q1Utb21vcEt5ZXJUNDZMSVZWdjdETWpKNlliajBBWHJUOWdDXzM1dV9TdDFuS0p5d1d5UU5qR0JhaUtvOGJwYk9PVEHSAW9BVV95cUxObjk5TG1UdmxjTlMzdklNdUdaY0ctWGRtbVpmSjRRMFlCOVRkVHpsWDF0SUlncVBvSngxazl6bmpnZjVWUHBTSm1JWks2NlJKczU0cEs4aXFRRFZpQmtxRjgtakpoUXk0bkR3aTVjZm8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Protocol Village: Cosmos-Based Picasso Network Claims to Enable First IBC-Ethereum Connection - CoinDesk",
        "content": "March 28: Edgeless Foundation unveiled the Edgeless Network, describing it in a blog post as \"the first ever crypto ecosystem without application layer fees, powered by Arbitrum Nitro.\" According to the post: \"By using Arbitrum Nitro, Edgeless has the freedom to fully customize its L2 infrastructure and with EigenLayer data availability, to keep gas fees extremely low on the network (less than $0.01 on average). Edgeless is then able to share these sequencer fees with developers so that they get a direct share of the economic value they bring to the network. In addition to this, Edgeless uses ezETH by Renzo as the baseline liquidity yield bearing asset and a stablecoin created by Stable to give back yield earned on bridged assets to developers who build on the Edgeless Ecosystem.\""
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOcnZBblVZU3g1ODdpN29yd012TGlGYTlMZmVxLWlVVFFvQk5TTWtpYlFSd1FUX014bW9WOTJPVFBIWmEwMEI5N2UtTl9tOU9GbW4yZzFNZUthRlBhRzhHM3Fsdmltc0RCR3Ewbm5wUVpoNVktNmZ1d1g2TDNTNV9MR09URk1fSWFMNmQ4Y3ctaFRKb01UU1lnaHlPdXLSAaIBQVVfeXFMT0ppUTlUUWI3dlhrRk53Q2YzUGRRci1RdGJKTmVTVGktRmtacHZvYVh2TjN6RDFYYVgwVXRrUmQ2SlpNbWx6dm4wLXdVQjFtUmVLai1zRm1rRFlwdUdYSk1IdTNiOUxKY2pVNTNlUzV2aVpUbVpJR2MyX3BGWk1ubEdEVUJZdWMwUFQ0ekN6NE5LeGpmbDFoRTA0VUI0STFsSVpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s new ATH, BlockDAG’s 20,000x projections outshine WAX’s AWS alliance - AMBCrypto News",
        "content": "Ethereum has continued to break new ground, reaching unprecedented heights and securing its spot as a cornerstone in cryptocurrency. Meanwhile, a new contender is making waves: BlockDAG, with its audacious promise of a 20,000x return on investment, is turning heads and setting the stage for a potential market shake-up. This remarkable projection is particularly striking against the backdrop of WAX’s strategic collaboration with Amazon Web Services, showing the diverse and dynamic nature of the crypto investment scene.\n\nAs Ethereum reinforces its legacy, BlockDAG’s bold ambitions are catching the fancy of investors, offering a tantalizing glimpse into the future of cryptocurrency growth and profitability.\n\nEthereum Hits ATH in Addresses: What’s Next for ETH Price?\n\nEthereum (ETH) is showing signs of a strong recovery, bouncing back from its March lows of $3,000 to trade at $3,615. The surge in the number of Ethereum addresses with non-zero balances to an all-time high of 118.23K indicates heightened investor activity.\n\nWith whale transactions on the rise and the ETH price maintaining support above $3,550, there is potential for further upward momentum.\n\nWAX’s Web 3 Partnership with AWS\n\nWAX has joined forces with Amazon Web Services (AWS) to integrate its blockchain tools into the Amazon Managed Blockchain (AMB), streamlining the development of blockchain-based games and applications. This collaboration allows developers to deploy WAX blockchain nodes directly from the AWS console, simplifying the development process for both the WAX mainnet and testnet.\n\nBy providing fast and reliable blockchain infrastructure, including WAX Blockchain nodes for real-time interactions and data queries, this partnership aims to facilitate the creation of Web3 gaming experiences.\n\nBlockDAG’s Presale Bull Run Positions it Among Top Crypto Investments\n\nBlockDAG Network stands out for its exceptional transaction speed, achieving 10,000 to 15,000 transaction confirmations per second (TPS), surpassing traditional blockchains like Bitcoin and Ethereum. In addition to its speed advantage, BlockDAG’s Explorer platform offers a comprehensive search tool for real-time network data, allowing users to track transaction histories, inspect public wallet addresses, review smart contracts, and view network nodes, ensuring transparency within the BlockDAG ecosystem.\n\nBlockDAG’s presale has sold over 6.4 billion coins, raising approximately $12.7 million. Currently in its sixth presale batch, BDAG coins are priced at $0.0035 each, with a listing price set at $0.05. This translates to a remarkable ROI potential at launch. Analysts are bullish about BlockDAG’s future, projecting a staggering 20,000x growth by 2025 following the mainnet launch.\n\nThe Last Call\n\nEthereum’s resurgence and WAX’s partnership with AWS mark pivotal moments in the crypto world, but BlockDAG steals the spotlight with its unmatched transaction speed and impressive presale achievements. As industry analysts predict a jaw-dropping 20,000x growth for BlockDAG by 2025, this emerging powerhouse is quickly becoming the focal point for savvy investors.\n\nIts promise of rapid expansion and innovation positions BlockDAG not just as another player in the crypto market, but as a potential leader, offering a unique and potentially lucrative investment avenue that stands out amidst the buzz of other significant crypto developments.\n\nJoin the BlockDAG Presale now, as it is set to create a major shift that will reshape cryptocurrency.\n\nInvest In BlockDAG\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\nDisclaimer: This is a paid post and should not be treated as news/advice."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPV1lVNmlZNjYxRE5tSnlqZURJZnkwaE9Hbks3RzVra3E4VERYMEt3b211SmZfcnRZZWZSYTJBaVJ6M19tUHhRUnJacWJobldnbl85eXF5NWJDNDdYemtHU3J3MjF1dXd0S0hNRWtVbzhJTzZUY3N1WW5iTkVkc1l1OFJQY0RVSTVmQ3lr0gGQAUFVX3lxTE44eDZSdnlicTZBVW91dnlCVUhLa0ZlX2NlRW5DMXNRam5TR3R1N2hJLTJqNWl2SXAyZXpWanl3aW5PVzFJbmcxZDV4N193VVA4S3dxMkYyOXNpMlItOWpLbS1sY0VQV0pxNDJ2azUyZGxCMXVmcHRheGV6X0RnMDhoRVktdXA4N0UteUhuV3hHbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Is Solana EVM Compatible and What Does It Actually Mean? - AMBCrypto Blog",
        "content": "Solana (SOL), a rapidly growing blockchain platform, has been turning heads in the crypto industry because of its remarkable scalability and transaction speed. However, one aspect that has grabbed particular attention is Solana’s compatibility with Ethereum Virtual Machine (EVM). If you also want to know whether Solana is EVM compatible, then keep reading.\n\nThis exhaustive piece explores what Solana EVM compatibility means, its advantages, and practical applications.\n\nUnderstanding EVM\n\nThe EVM is the runtime environment for executing smart contracts on the Ethereum blockchain. It is a decentralized computer featuring a sandboxed environment, meaning that it operates independently of the host computer system.\n\nThe EVM allows for the deployment and execution of arbitrary algorithms in a series of opcodes. Moreover, it provides the backbone for the decentralized apps (dApps) that are the hallmark of the Ethereum network.\n\nIn simpler terms, the EVM serves as a large, global, decentralized computer. Each smart contract is like a “program” that runs on this computer. Every Ethereum node runs its own EVM instance. This ensures that all computations are performed consistently. Consequently, the state of the blockchain remains synchronized across all nodes.\n\nWhy would you only learn about blockchains when you could be building one? Get started today.\n\nSolana and EVM: A compatible match\n\nThe Solana EVM serves as a bridge, letting dApps and transactions designed for the Ethereum network run seamlessly on the Solana blockchain as well. This compatibility layer means that Ethereum developers can transition their dApps to Solana without modifying any code.\n\nBuilt on the high-speed Solana blockchain, which can handle as many as 65,000 transactions per second, the Solana EVM offers far greater speed and scalability compared to Ethereum’s 15 transactions per second.\n\nWhy is Solana’s user activity plunging lower? Find out today.\n\nEVM compatibility: A game changer for Solana\n\nEVM compatibility is a significant breakthrough for Solana. This interoperability is a much-needed step towards addressing one of the biggest challenges that the crypto industry faces today.\n\nEVM compatibility brings about time savings, reduces knowledge transfer costs, and cuts back on development requirements. It attracts users, talent, and innovation from the Ethereum ecosystem to other blockchain platforms.\n\nThe boons of Solana EVM\n\nSolana EVM offers various benefits, including:\n\nEfficient scaling: Thanks to the Solana network, Web 3 developers can enjoy low gas fees and high throughput. This is due to its parallel processing (Sealevel) and unique innovations like Proof-of-History. The mechanism enables 400ms block times.\n\nIntegration with Solana ecosystem: Ethereum developers and creators have the opportunity to leverage Solana’s robust ecosystem. This includes its developer community, decentralized finance (DeFi) platforms, and non-fungible token (NFT) marketplaces. They can either migrate to or expand their applications with the use of Solana EVM.\n\nUsing familiar tools: EVM developers can continue using tools that they are already comfortable with. These include tools like MetaMask, Truffle, and Waffle, ensuring a seamless developer experience.\n\nAdapting smart contracts easily: Existing Ethereum dApps can be ported over to Solana Programs (i.e., Solana smart contracts) without any reconfiguration of the underlying smart contracts.\n\nDemocratizing access: Lastly, by using a Solana EVM, the users, talent, and innovation of the Ethereum ecosystem can easily adapt to projects on both blockchains.\n\nThe force behind Solana EVM\n\nNeon Labs is the company that developed the first EVM on Solana. The Neon EVM is a cross-chain solution that allows dApp developers to leverage the benefits of Solana to expand their services, offering new products like arbitrage or high-frequency trading, growing their user base, and reducing costs where possible, including gas fees.\n\nIts ERC-20/SPL wrapper is an implementation of the ERC-20 interface for SPL tokens that ensures Solana applications interact with Neon EVM contracts.\n\nGetting started with Neon EVM\n\nTo kickstart your journey with Neon EVM, the fastest route is to set up MetaMask and link it to the NeonEVM devnet either via Chainlist or by manual configuration. Developers eager to delve deeper can consult the Neon EVM documentation for further insights, and they can acquire test NEON tokens by utilizing either the NeonFaucet website or its API.\n\nThe future of blockchain with Solana EVM\n\nThe emphasis on EVM compatibility is poised to catalyze a new wave of multi-chain applications, strengthen network collaboration, and elevate the user experience as the focus shifts toward more scalable solutions. As the landscape evolves, the union of Solana and Ethereum ecosystems via EVM compatibility offers an intriguing glimpse into the future of blockchain tech. For developers keen on harnessing Solana’s capabilities, the timing couldn’t be better to delve into this cutting-edge platform and discover its vast potential.\n\nConclusion\n\nTo sum it up, Solana being EVM compatible signifies a significant leap in the blockchain ecosystem. It brings together the robustness of Ethereum with the efficiency of Solana.\n\nAs the crypto industry strives to resolve its scalability and interoperability issues, the advent of Solana EVM might just be the solution it needs. The future of blockchain technology looks promising with such innovative approaches. Lastly, it’s exciting to see what’s next on the horizon."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOTlJLSHFnajNzUmNrYTJWX0J3dWxJbEdFUUtNZzhFR0RUamhlT0FPUXhRakVObnJpTWhXaTNITV80Y0Y3S3BJa0hWWUVtY0NuMVZHTFJQWFkzV05YNWdCMUpzeXkyeWZFWjR5S3llRmpCUURmVEwyX2VjV3JkcFJ3Q19QSnF2YTBrcWV0dFg1emd6RUFQYjlPam9uR1VieDZGcmx5OEpBUkw0SEtEYXVuVzhxRWVJUdIBuwFBVV95cUxNSjNQeUVZMmdmQkgxYUZYZlFLTzhZclpSSGI2cUpiWnQ1TWNDNnpjWFVGS1h1TUFSSzE2b0VnWUZQazVYS3ptY2JZbFZlQmVnN0xzRjZSc251ajM0aGRJWVpOeVlzYXBtZ1BrYmZLVDZDbE83VDVFYVVEMjQ2VkFzRDBGMk5FaWJRckFFU09GSnRjdHdob1BBWjl1VVVkSUdyQ1QtR3NyZmlXYXM4V015ZXdTN1JBQW9qTnFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "$930,000,000,000 Asset Manager DWS Launches ETCs for Bitcoin and Ethereum in Germany - Crypto News Flash",
        "content": "DWS collaborates with Galaxy Digital to launch cost-efficient Exchange Traded Commodities (ETCs) for Bitcoin and Ethereum, providing seamless integration into investment portfolios.\n\nThe new ETCs, listed on the Deutsche Börse, are physically backed and stored in secure, offline ‘Cold Storage,’ offering investors a transparent and liquid investment option in the digital asset space.\n\nIn a groundbreaking move that signals the increasing acceptance of cryptocurrencies as a legitimate asset class, DWS, Deutsche Bank’s investment arm, has partnered with Galaxy Digital, a leader in digital assets and blockchain technology. This strategic alliance has given rise to the introduction of two new Exchange Traded Commodities (ETCs) focused on Bitcoin and Ethereum, the two largest cryptocurrencies by market capitalization. This initiative marks a significant milestone in bridging the gap between traditional financial markets and the burgeoning world of digital assets.\n\n🚀 Breaking: $930,000,000,000 asset manager DWS teams up with Galaxy to launch new Xtrackers ETCs, offering investors hassle-free access to #Bitcoin and #Ethereum markets in Germany! 🌐💰 DWS, in collaboration with Galaxy Digital Holdings Ltd., has unveiled two groundbreaking… pic.twitter.com/2uFtGdquoi — Marcel Knobloch aka Collin Brown (@CollinBrownXRP) April 4, 2024\n\nInnovative Access to Leading Digital Assets\n\nThe inception of Xtrackers Galaxy Physical Bitcoin ETCs and Xtrackers Galaxy Physical Ethereum ETCs offers investors an unprecedented opportunity to participate in the price movements of these digital giants. Listed on the Deutsche Börse, these ETCs are designed to provide investors with a transparent, liquid, and cost-efficient means to incorporate Bitcoin and Ethereum into their investment portfolios.\n\nSince the first Bitcoin transaction in 2009, digital assets have transformed from a niche technological innovation to a globally recognized investment category. With a combined market capitalization exceeding $1.7 trillion, the significance of Bitcoin and Ethereum can no longer be overlooked by investors and asset managers.\n\nDigital assets have evolved from a technological innovation to a globally recognized class of investment. With a market cap surpassing $1.7 trillion, Bitcoin and Ethereum are too significant to ignore,\n\nstated Manfred Bauer, Global Head of Product Division at DWS.\n\nA Synergy of Tradition and Innovation\n\nThe newly launched Xtrackers Digital Asset ETCs embody a fusion of traditional financial mechanisms and innovative digital asset services. State Street plays a crucial role as the issuing, paying, and administration agent, while MSCI provides the reference prices for Bitcoin and Ethereum. These ETCs are physically backed, utilizing cryptocurrency depots Zodia and Coinbase for secure storage in segregated offline vaults, known as ‘Cold Storage.’ This method ensures that cryptocurrency keys are stored away from online threats, enhancing the security of investors’ assets.\n\nMoreover, the annual product fee for both the Xtrackers Galaxy Physical Bitcoin ETC Securities and the Xtrackers Galaxy Physical Ethereum ETC Securities is set at a cost-efficient 0.35 percent. This pricing strategy reflects DWS’s commitment to providing investors with an affordable entry point into the dynamic and potentially lucrative world of digital assets.\n\nThe collaboration between DWS and Galaxy Digital, and the launch of these innovative ETCs, underscore the growing convergence of traditional finance and digital currencies. By offering a secure, transparent, and liquid investment vehicle for Bitcoin and Ethereum, DWS and Galaxy are paving the way for broader acceptance and integration of cryptocurrencies into mainstream investment strategies."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNQUtDS2ZDTC1ZdjZ2elFfa0FRY1RweDZVQkEyd1VYMWprWjBCS2YwSVd1OUtuQlFLNG5YOFAyS1NoSGRpcmg3RGV2aEtQZXJqMldQd0FmLUZoWF93eDU0U055NTA5ejJEWm9qSm4zZUZxLXBsamc1Tk9ydTc3RUNMYjFiMVc2ZWVHTmZfS1hn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Restaking: The New Double-Edged Revolution of Ethereum - Cointribune EN",
        "content": "Wed 03 Apr 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nRestaking is a new evolution of staking in decentralized finance (DeFi). This new form of staking allows users to reuse their already staked cryptos to secure other protocols and decentralized products. This emerging trend offers not only opportunities but also presents significant risks for Ethereum.\n\nThe Crypto Opportunities of Restaking for Ethereum\n\nThe crypto exchange Coinbase has recently spoken about the practice of restaking. It believes that this emerging trend around staking presents significant opportunities for Ethereum. The position of this market within decentralized finance (DeFi) is evident.\n\nIndeed, restaking currently constitutes the second-largest market in decentralized finance (DeFi). This growth is marked by the expansion of crypto protocols such as EigenLayer.\n\nThis protocol has established itself as the second-largest within DeFi with a total value locked (TVL) of $12.4 billion, by allowing validators to secure actively validated services (AVS) through restaking their ethers.\n\nIt is clear that liquid restaking platforms are emerging as a key element in the evolution of the Ethereum ecosystem. Yet, amidst this growth, concerns arise about the risks associated with restaking and its impact on the network.\n\nEthereum Could Face 'Hidden Risks' From Ballooning Restaking Market: Coinbase https://t.co/UJ4m2kH8PK — ghostz (@ghostz_crypto) April 2, 2024 Restaking offers Ethereum new opportunities while raising concerns about the stability of the network\n\nThe Risks Not To Be Ignored\n\nCoinbase raises concerns about the risks associated with restaking, particularly from a financial and security standpoint. The company believes that the opaque nature of some restaking strategies and the potential disruptions of underlying assets pose challenges.\n\nOne notable concern highlighted by Coinbase is the risk that stakers may rush towards platforms offering the highest rewards. Such potential behavior could have implications for the stability of Ethereum.\n\nIndeed, the rush towards more lucrative staking platforms could encourage excessive restaking, which would increase complexity and potential vulnerabilities within the network.\n\nFurthermore, Coinbase points out the difficulty of evaluating risk-adjusted rewards in the evolving landscape of restaking. Hence the need for transparency and due diligence on the part of all stakeholders. Despite these challenges, the exchange recognizes the transformative potential and innovation of restaking for the Ethereum ecosystem.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPMFVIczhTZnhhSmtSQ1FLLWNLaDdGcXE2N01tTFJJU1RScUJNVEI1MWMyOHFkU2Y2VFJ2WmpSYzR4NXpWa1M1QzJiclFlalc3dVZJWEFqUl9ncTR2d2F4ckNpVWNsMUZKWlZPdUoyclgxQ2RkTkplQ1RCaUdGeEZHVU9CclEtckp1b2l5MjhWS2RCd9IBlwFBVV95cUxQSWdDNVY1dE1vWUZpcXJaYXY5RDBlQlJzZTJOaHJXTjRxWEt1d05wMW9DQ05mSWY3S3RGLTREcFFaZ0ZwQnk3dndRc01vUmRLdm50ekJmVmxhQlNPWTZfYlNRZGt0aU9KcmFRVkRnSXlKaThFX0hudWQxNUp2YXZOeFprdmlsQTFhZDZvc0E0cDJxZ2NUbWNV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Solana, Ethereum – How demand panned out for all three - AMBCrypto News",
        "content": "Year-to-date inflows went into digital asset funds reached $13.13 billion.\n\nBitcoin, Solana were high on demand, while Ethereum saw outflows.\n\nDigital asset funds were back to winning ways last week, spearheaded by strong investments into the newly-launched Bitcoin [BTC] spot ETFs in the U.S.\n\nStrong recovery\n\nAs per data shared by James Butterfill, Head of Research at crypto asset management firm CoinShares, about $862 million in net inflows was recorded across institutional crypto products\n\nThis was a sharp rebound from the $942 million in outflows seen a week earlier.\n\nThe latest capital infusion propelled year-to-date (YTD) inflows to $13.13 billion. For context, this was nearly 25% higher than the total inflows recorded in 2021 — the year of the crypto market’s last bull run.\n\nDuring the week, the total assets under management (AuM) swelled to $98 billion, marking an increase of 11% from the week before.\n\nAUM is an important performance gradient of a fund. The higher the value of AuM, the more investments it tends to attract. AUM depends on the inflows and the market value of the underlying asset.\n\nLast month, the AUM hit $100 billion for the first time in history, as Bitcoin smashed to its all-time high (ATH) of $73,000. However, subsequent price correction caused the AUM to drop to current levels.\n\nBitcoin remains institutions’ favorite\n\nOn expected lines, Bitcoin-linked funds led the charge, pocketing $865 million in inflows last week. With this, total inflows since the beginning of the year rose to an impressive $12.8 billion.\n\nThe surge could be attributed to strong demand for U.S.-based spot Bitcoin ETFs, which attracted $860 million in inflows last week.\n\nRobust inflows into new ETFs led by BlackRock’s IBIT helped offset outflows from incumbent issuer Grayscale’s GBTC, which has been bleeding since transitioning to an ETF.\n\nEthereum loses, Solana gains\n\nOn the other hand, funds tied to second-largest cryptocurrency Ethereum [ETH] saw outflows worth $19 million last week. The bearish sentiment likely flowed from lower chances of an ETH ETF approval.\n\nSolana-based investment products witnessed inflows of $6 million last week, spurred by impressive price performance of the native asset SOL."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOZ2ZlVVdHbzlyUFJvWGJfNlNBa09RUHRPbkdvRUhRWC1uV2VORHhNTGl1U2RBbHh6bnU5WDI5bm5McW9wcHQ0allwRlhpbHBXTV9YaWszT3pfaDZ4aTNqLUtZMGRaRmJQWERMOHFRb0NVWDZYQUJmZ3NhUk1rM0ZzaXYzRy1kd3dXNmFkOVBtM3NuM2dOSzJ3WUpHX05mZzlGZUxuQi1PenVscnVVOGg3MXZXRmthUnNzN0FaX0RXUHZkUGIyVDhqbjgyYTRmYVlnckZDSmZtVlBmVXhzQTVZNW1tMUlpLVg3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "CHUCK Meme Coin That Aims To 'Make Ethereum Great Again' Skyrockets 25,800% Hours After Launch, Leaving Dogecoin, Shiba Inu In The Dust - Benzinga",
        "content": "A new meme coin, CHUCK CHUCK/USD, built on Ethereum ETH/USD, surged 25,800% in value only hours after its launch on Tuesday, eclipsing the performance of top meme cryptocurrencies like Dogecoin DOGE/USD and Shiba Inu SHIB/USD.\n\nWhat Happened: Data from Dexscreener shows CHUCK with a market capitalization of $4.16 million, with liquidity reported at $488,100. The circulating supply of CHUCK tokens stands at 42 billion, with a total holder count of 361 individuals.\n\nAt the time of writing, DOGE and SHIB were up 2-4% in the last 24 hours.\n\nThe trading volume for CHUCK in the last 24 hours has reached over $6.62 million.\n\nThe official website for CHUCK describes the meme coin as “the strongest of all memes. Dogs, frogs, cats, and shady players—your time is over! CHUCK is here to save the meme-fest and claim his top spot in the meme hierarchy.\"\n\nMoreover, the website clarifies that the meme coin has no formal association with the martial artist and actor Carlos Ray “Chuck” Norris Jr. or his representatives. The site notes that ‘CHUCK’ is: \"Inspired by the legendary internet saga surrounding Chuck Norris, created by fans to celebrate the spirit of his character.\"\n\nSee More: Best Cryptocurrency Scanners\n\nWhy It Matters: CHUCK differentiates itself by launching on the Ethereum network, unlike many other meme coins that have found a home on the Solana blockchain, carrying the slogan: \"Make Ethereum Great Again.\"\n\nThe Solana blockchain is well-known for its promise to deliver faster and more cost-efficient transactions than its competitors, such as Ethereum.\n\nIt has become a platform for hosting meme coins like dogwifhat WIF/USD, Bonk BONK/USD, and Book of meme BOME/USD. These tokens primarily derive their value from their viral appeal on the internet. However, the meme coin trend has boosted Solana with increased activity and liquidity, it has also exposed some of the network’s technical issues, leaving investors and several traders disappointed.\n\nCHUCK's launch on ETH is due to its extensive and vibrant community of users and developers, which lays a perfect foundation for the growth of meme coins and leads to strong collective support for these assets.\n\nMoreover, as a time-tested blockchain, Ethereum ensures a trustworthy and robust framework for conducting meme coin transactions—a vital aspect for attracting investments and maintaining the continuity of these initiatives.\n\nIt is worth noting that some of the top meme coins, Such as FLOKI, SHIB, and PEPE, are Ethereum-based.\n\nPrice Action: At the time of writing, CHUCK was trading at $0.0001006.\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQMGlPWXIyMHRUNFVuNXY0VzRvY1NIM01ZY2NSdkN6OXkzV0VaU3NCb201YmJycURObmZFbzlrdDRhME92bERDRnVvRlJ6d1gtYm92aGZ2NG1POWRZVUpIWW9JdVFQMzN4MHpkTDVDejM2UGR2Z1N3eGFBMnNUZUdDQ01kNzNSNUV2RHfSAY8BQVVfeXFMTUJNNnZEQ01YWm85UnluZ0VRR2ptRTVQcGppZEh2d041eENXa2Q1cjhIN2NoMXRyZG9hd3Q1ZjRpZTZYVDVhcmg2UE53OFllTjg0cEpQdkJuTXkzLVVYUGNsRzNNaEoxOEVleDlBZUVvTzVBLUV6LVFxSzM4NE1MeTM1UGxXWkNlYkFVZUQ1SE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "VanEck’s Ethereum Layer-2 Prediction: $1 Trillion by 2030 - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nVanEck, the global investment manager, has recently released its $1 trillion base case for Ethereum’s Layer-2 (L2) solutions by 2030. The L2 solutions are expected to surpass the main blockchain in revenue generation for addressing scalability issues.\n\nTechnologies like ZKUs (zero-knowledge roll-ups) and ORUs (optimistic roll-ups) are to process transactions off the main blockchain. This would enable L2s to outperform Ethereum’s main blockchain.\n\nSource: VanEck\n\nRole of Airdrop in Ethereum L2 Solutions Success\n\nDespite the optimism about L2s, VanEck has cautioned about most L2 tokens, stating that they are not the primary currency within the cryptocurrency ecosystem. Some notable L2 solutions that are recognized for their success due to successful ecosystems and strategic airdrops are Arbritrum, Blast, and Optimism.\n\nAccording to DefiLlama data, Arbitrum ranks fifth in total value locked ($3.17 billion), Blast sixth ($1.3 billion), and Optimism eleventh ($952.69 million).\n\nThe criteria for evaluating the success of L2 are costs of the transaction, user experience, assumptions of trust, the size of the ecosystem, and of course, the developer experience.\n\nEthereum co-founder Vitalik Buterin also revisits the layer-3 (L3) solutions concept. He emphasized the importance of different layers serving distinct purposes for effective layering.\n\nAlso Check Out The : GBTC Outflows Drop to $75 Million, Ahead of Bitcoin Halving\n\nHow will Ethereum L2 Solve Scalibility?\n\nThe VanEck report highlights the EIP-4844 upgrade, which would “Blob Space” to reduce data posting costs significantly, thereby benefiting L2 operations financially.\n\nVarious revenue models of L2 solutions are explored as well. It has been identified that transaction sequencing would be the primary source of income along with on-chain and off-chain cost structures.\n\nTotal Value Locked (TVL) within Ethereum Ecosystem\n\nBy 2030, a significant transaction value portion and TVL of L2s are expected to be captured. This would be partly driven by Maximal Extractable Value or MEV’s potential in augmenting revenues.\n\nVanEck foresees a much broader application of blockchain technology that will be beyond finance. It will include gaming, social media, and infrastructure, denoting a future with L2s becoming the central components of the global blockchain ecosystem."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQWGQ3ODd6WThhSU9EUlk3aGMtanpxMktVZWlTNGJlYjN3ZEFNOXI4X0RJc0FoTVZsU0lNeWpMb2VNaTUzX09RYWxVazkxeW1rT0JLbTFwakpBbzhlMFNhQUFDWWFTYng0QzJXZlZrMlBCU3ZrVGpSVWFndkdycHp6Q2hOY3NyOTktQUNIN09zeDFSUjRzM3l3SU5tZ3dhVGRUZUhuTjhzdnlCWm9TVVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, XRP Price Prediction For 2024: Here’s What to Expect - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nStory Highlights Crypto analyst Credible predicts a bull run for Ethereum (ETH) with a potential surge past $10,000, fueled by Bitcoin's expected growth.\n\nXRP is also forecasted for a significant rise, possibly reaching above $10, despite a short-term dip.\n\nWhile Bitcoin might experience sideways movement initially, Credible anticipates a breakout and long-term growth.\n\nForecasts hold significant sway in the crypto world, especially when they come from a respected analyst like Credible. Recently, Credible shared his ambitious predictions for Ethereum (ETH), Bitcoin (BTC), and XRP, sparking renewed optimism among investors.\n\nHere’s a breakdown of what he had to say.\n\nA Bright Future for Ethereum\n\nEthereum enthusiasts have reason to cheer as Credible paints an encouraging picture of the altcoin’s trajectory. According to his analysis, Ethereum is set for a remarkable surge, potentially surpassing $10,000 and even reaching $20,000 during the ongoing bull market. This optimism is rooted in Credible’s expectations for Bitcoin’s performance, suggesting BTC could double from its previous all-time high of $69,000.\n\n$10,000+ minimum. I think theres a chance we can come up on a peak/blow off top near 20k.\n\n\n\nIt's pretty simple- I think $BTC can realistically 2x from our last high at 69k- which means most alts will do multiples of that.\n\n\n\nFor $ETH, a 3-4x of prior ATH puts us at 15-20k. https://t.co/LfH6WyNtFY — CrediBULL Crypto (@CredibleCrypto) March 31, 2024\n\nRead More: Big Move Ahead? Reports Hint at $2 Billion Bitcoin Sell-Off by US Government\n\nEncouraged by this bullish sentiment, Credible foresees significant growth for most altcoins, including Ethereum. A projected 3-4x increase from its previous peak could propel Ethereum into the $15,000-$20,000 range. Despite a recent dip in Ethereum’s price to $3,484, reflecting a modest decline of over 3% in the last 24 hours, Credible remains steadfast in his long-term outlook for the cryptocurrency.\n\nI made a mistake here. I was looking at fully diluted valuation for XRP.\n\n\n\nReality is at current circulating supply a 10k ETH is equivalent to a $20+ $XRP.\n\n\n\nSo if you think $10 is impossible for XRP but 10k ETH is realistic for ETH you need to check your bias real quick.\n\n\n\nBoth… https://t.co/IPsElR7xBx — CrediBULL Crypto (@CredibleCrypto) March 31, 2024\n\nA Surge Incoming?\n\nShifting focus to XRP, Credible anticipates a potential breakthrough, suggesting XRP could surpass the $10 mark. He points to XRP’s past achievement of surpassing Ethereum’s market cap in a previous market cycle, indicating the possibility of significant gains for the altcoin.\n\nWith XRP currently trading at $0.614, Credible’s forecast underscores the resilience of XRP, despite occasional setbacks, and hints at imminent new highs.\n\n$BTC probs going to continue ranging for a few more days at least. Bids now capping price on the downside (or attempting to) the same way asks were capping upside earlier. OI is building up though so we should get some nice volatility once we break out of this range. pic.twitter.com/zIF3DjlfES — CrediBULL Crypto (@CredibleCrypto) March 29, 2024\n\nBitcoin is Building Momentum!\n\nAll eyes are on Bitcoin’s next move, especially with the looming halving event. While initial projections speculated a surge beyond $80,000 before the halving and even higher figures afterward, Bitcoin’s price trajectory has been less predictable. However, Credible remains optimistic about the cryptocurrency’s long-term prospects, despite potential short-term fluctuations.\n\nIn the near term, Credible suggests Bitcoin may continue to trade sideways for a brief period. He notes a consolidation of bids, indicating potential support levels, coupled with a buildup of open interest, hinting at imminent volatility once the market breaks out of its current range.\n\nWith Bitcoin currently trading at $68,508, investors eagerly await clarity on the market’s direction.\n\nThis Might Interest You: Top 10 Altcoins for Biggest Returns in 2024\n\nMarket Pullback Soon?\n\nExploring the recent market pullback, Kristian Haralampiev, Nexo’s Structured Products Lead, attributes the downturn to profit-taking by investors capitalizing on peak market conditions. Haralampiev highlights increased cryptocurrency volumes flowing into exchanges, particularly from short-term traders enjoying profits, as per data from Glassnode.\n\nDespite the unexpected pullback amidst expectations of Bitcoin scaling new heights, both Credible and Haralampiev view it as an opportune moment for latecomers to enter the market ahead of the next Bitcoin halving event."
    }
]