[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBSRi1wbllzS0FaRGkyV1ZzbkhQTml2SDY5R2ZZRHcwWlNQWHFhbzJiYV85SVFkLVlObHpQc3dkbXFvcU5tYWhsNFp3V0pKSUxzdy1ZNkdOVHBwVnhrX3dpTjVpQzFkSzZFTVVONEdpZGlEWEcyTHN6WDFRUm85UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Enterprise Ethereum Alliance (EEA): Meaning, Examples, and Membership - Investopedia",
        "content": "What Is the Enterprise Ethereum Alliance (EEA) ?\n\nThe Enterprise Ethereum Alliance (EEA), launched in February 2017, brings together various start-ups, Fortune 500 companies, technology vendors, academics, and Ethereum subject matter experts to work on Ethereum as an enterprise-grade technology.\n\nKey Takeaways The Enterprise Ethereum Alliance (EEA) \"...is a member-led industry organization whose objective is to drive the use of Ethereum blockchain technology as an open standard to empower enterprises.\"\n\nThe EEA's mission is to deliver an open, standards-based architecture and specification to accelerate the adoption of Enterprise Ethereum.\n\nThe EEA provides its members a community and access to educational material and various technical and media resources.\n\nHow the Enterprise Ethereum Alliance (EEA) Works\n\nAlthough many technology giants and businesses had been supporting Ethereum via Cloud services and working towards its adoption, most efforts towards its scalability, privacy, and interoperability remained scattered until the Enterprise Ethereum Alliance came into being.\n\nThe alliance aims to build, promote, and support Ethereum blockchain technology best practices, standards, and a reference architecture capable of handling real-world applications and usage.\n\nLaunched in 2015, Ethereum is a blockchain-based, decentralized software platform that enables smart contracts and Distributed Applications (dApps) to be built and run without downtime, fraud, control, or interference from a third party.\n\nEthereum is not just a platform but also a Turing complete programming language running on a blockchain that helps developers build and publish distributed applications.\n\nThe potential applications of Ethereum are wide-ranging, and this has attracted several enterprises to explore the technology. Ether, the cryptographic token used on the Ethereum platform, is the second most popular cryptocurrency in terms of market capitalization, with an aggregate market cap of around $456 billion as of May 2024.\n\nEEA Efforts\n\nRecently, member companies (and others) have initiated and worked on multiple pilot projects covering areas such as supply chain provenance tracking, inter-bank payments, reference data, securities settlement, and many others.\n\nHowever, real-world enterprise use calls for collaborative efforts to build architectures allowing permissioned and public Ethereum networks. The formation of EEA is an important step in this direction.\n\nThe EAA also provides education and training for members. The organization publishes newsletters, videos, and webinars as part of its public service mission.\n\nEEA Membership\n\nThe board members of the Enterprise Ethereum Alliance included Accenture, BlockApps, ConsenSys, Ethereum Foundation, EY, J.P. Morgan, Microsoft, and Santander.\n\nAccording to the EEA website, there are over 100 associate and organizational members of EEA. Associate members are represented by the Blockchain Research Institute, Hyperledger, and SAE ITC. Social impact partners include the Blockchain for Social Impact Coalition and the Decentralized Identity Foundation.\n\nThe members of EEA represent varied businesses from every region of the world, including technology, banking, government, healthcare, energy, pharmaceuticals, marketing, and insurance.\n\nWith a focus on solving the real-world challenges of deploying Ethereum at an enterprise scale, the Enterprise Ethereum Alliance is an important initiative in the adoption of blockchain and decentralization.\n\nEEA Benefits\n\nOrganizations that join the EEA get to leverage Ethereum technology in their business operations. It also exposes them to over 20,000 Ethereum community members. Members can network, establish partnerships, and showcase technology within the largest Ethereum ecosystem.\n\nEEA membership provides market opportunities through branding, speaking, and advertising, and facilitates building solutions on globally trusted EEA standards. The EEA also offers speaking and advertising opportunities at events, RFP inclusion, and prominent placement in the Ethereum Ecosystem stack.\n\nEEA membership also drives industry adoption by contributing to best practices and utilizing EEA resources to design enterprise-level solutions. Members participate in working groups to address Ethereum challenges, vote on technical developments, and access the EEA Testnet for testing. EEA even offers certification to ensure solutions meet industry standards and interoperability requirements.\n\nFinally, EEA members can join interest groups, access member service discounts, and use EEA branding. Members can access the global developer community of 3,000+ contributors and 15+ user groups across 25 industries and six continents to enhance collaboration. To gain access, EEA provides a password-protected member collaboration site.\n\nWhat Is the Ethereum Enterprise Alliance? The EEA is an organization that collaborates to promote the Ethereum ecosystem for business uses.\n\nWho Are the Partners of the Enterprise Ethereum Alliance? There are over 100 member organizations partnered with the EEA. Notable members you may recognize are Ernst & Young, FedEx, Microsoft, and VMWare.\n\nWhat Are the Main Objectives of the Enterprise Ethereum Alliance? The alliance is a group of organizations interested in using the Ethereum blockchain and ecosystem to deliver business solutions.\n\nThe Bottom Line\n\nThe Enterprise Ethereum Alliance (EEA) is an industry-led organization. Its objective is to promote using the Ethereum blockchain to empower enterprises. The EEA works to deliver an open, standards-based architecture created to accelerate the adoption of Enterprise Ethereum in the business world."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPS2JtYjVqeTFEQUloLXBEMFMtZ3F5cEZUN29VLXdPd1Y4cXNiT2NYMl82MzJwaVBKNUpST0VpY1ZMYmwtN1ljMl9sRGtCVTMyRmdJdGVrZjFxM0EzMG9WanVVSFJucml1amxVcWp0QnlRbTgyOENUQkxOcC0zajVDcDRaYk5uclJYRmZVdmVYUndEZVRYZ0c0QTFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "US SEC Approves Spot Ethereum ETFs: Crypto's Momentum Grows - FinTech Magazine",
        "content": "In what is being called a surprising move, the US Securities and Exchange Commission (SEC) has approved the sale of spot Ether Exchange-Traded Funds (ETFs).\n\nThe approval comes after the SEC combined proposals from the Nasdaq, NYSE and CBOE exchanges, which asked for changes to existing rules so that Ethereum Exchange-Traded Products (ETPs) and ETFs are allowed.\n\nThe SEC’s approval of spot Ether ETFs follows the approval of Bitcoin ETFs and ETPs in January this year after a lengthy process, but one which saw Bitcoin’s price rise to an all-time high.\n\nDespite the law change being granted for the trade of spot Ether ETFs, trading will not immediately begin. Issuers first need the SEC to approve individual ETF registration statements with details of investor disclosures.\n\nIt is not yet clear how long the SEC’s approval process might take.\n\nEthereum ETFs: Industry reaction\n\nThe swift approval of spot Ether ETFs comes as a surprise to many in the industry, given the SEC’s historic hostility towards crypto and the lengthy process it took for spot Bitcoin ETFs to be approved."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNMXJkZ3RvMTkxVVNSYVNwUlVyRXQ0S3hmZWdtcUg2MXRtYzVqN2dSbVVDVGQ4bDdUVk8xN3hOSWw0N1dVR01Gc0x1SHJ3LUxNUm9zMHBMNU9YVVNkcmJDWFQ0dF9IM1BlNVQ4aGtzRnVOVXkwbVc5MkF5MUN6Z2hWZm5qZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Future Outlook - The Cryptonomist",
        "content": "The analysis of the price of Ethereum (ETH) is a recent and central topic in the world of cryptocurrencies, with experts actively discussing the future market dynamics.\n\nRecent developments have captured the attention of investors: the possibility that the price of Ethereum reaches 4,500 dollars before the approval of ETH ETFs and the future implications of the approvals of spot Ether ETFs.\n\nEthereum: short-term price outlook and the analysis of the impact of the ETF\n\nArthur Cheong, founder of DeFiance Capital, has suggested that the price of Ethereum could reach 4,500 dollars before the approval of ETH ETFs. This prediction is based on a combination of technical and fundamental factors. In particular, Cheong highlights the growing adoption of Ethereum in the decentralized finance (DeFi) and non-fungible token (NFT) sectors, which are driving the demand for the cryptocurrency.\n\nFurthermore, the continuous improvement of Ethereum’s infrastructure, such as the “Ethereum 2.0” upgrade, promises to solve scalability issues and reduce transaction fees. These developments could further strengthen Ethereum’s position as the leading platform for decentralized applications.\n\nL’approvazione degli ETF spot Ether da parte della SEC statunitense rappresenta una svolta significativa per il mercato delle criptovalute. Secondo esperti come Bill Hughes di Consensys, questa mossa è un’ammissione implicita che Ethereum è considerato un bene commodity.\n\nThe adoption of ETF on Ethereum could make the cryptocurrency more accessible to traditional investors, increasing liquidity and stabilizing prices.\n\nEric Balchunas, analista di Bloomberg, prevede che il lancio degli ETF su Ethereum seguirà uno schema simile a quello degli ETF su Bitcoin, con una competizione intensa tra gli emittenti. Tuttavia, Balchunas nota che gli ETF su Ethereum potrebbero generare un volume inferiore rispetto a quelli su Bitcoin, stimando una raccolta totale di circa 1-2 miliardi di dollari nelle prime settimane.\n\nMatthew Sigel di VanEck, uno degli emittenti di ETF, highlights the importance of presenting Ethereum as an asset with intrinsic value, especially to tech and equity investors.\n\nSigel believes that many of these investors are not yet aware of the potential of Ethereum and its ecosystem of decentralized applications.\n\nGlobal competition and regulatory outlook\n\nYat Siu, co-founder of Animoca Brands, observes that the approval of ETFs on Ethereum in the United States could stimulate other jurisdictions to follow suit.\n\nCountries like the Regno Unito, Singapore, Giappone, and Emirati Arabi Uniti might be incentivized to introduce their own crypto-based ETFs to avoid falling behind in the global competition.\n\nSiu emphasizes that this competition could lead to interesting developments and a change in sentiment in the United States towards greater acceptance and regulation of cryptocurrencies.\n\nTuttavia, la trasparenza delle normative rimane una preoccupazione, come evidenziato da Hughes, che critica la SEC per la mancanza di chiarezza sulle implicazioni delle sue decisioni.\n\nThe analysis of Ethereum’s price and its future prospects are influenced by a series of interconnected factors. The forecast of a short-term price increase up to 4,500 dollars reflects the optimism about the growing adoption and technological improvements of Ethereum.\n\nAt the same time, the approval of Ethereum ETFs could represent a breakthrough for traditional investors’ accessibility to the cryptocurrency market, further stabilizing the price.\n\nThe global competition for the introduction of cryptocurrency ETFs and regulatory developments will continue to play a crucial role in determining the future of Ethereum.\n\nInvestors and market observers will need to closely monitor these developments to adapt their investment strategies in a rapidly changing environment."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5RUC1PdXkzTndncXEzam4xbHdsRFFyaUVITzJKSjM1M240Rl9CbGl5bXk3MW4yWHltSFlWdzBRcHNmcXZBdWk4emJHQ2FYN20xcXZnUWdxMnIyaUJOUmRaWFVrOVA5eEVDRWZRX21HSkJVVEZKZDg1R09R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs approved, Reps pass FIT21 bill, Bitcoin reclaims $71k | Weekly Recap - crypto.news",
        "content": "Sign up for crypto news and market insights\n\nGet crypto market analysis and curated news delivered right to your inbox every week.\n\nEmail\n\nYou have successfully joined our subscriber list."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE8tcG9BQjAydUE2YlJ0aGdCTXQ5Z2YxaUdyR3V6YXNRd0k1Z0JiUnE3YlE3QldUZ3JYWlVCVEdmUWZJOWZ2d3JDaWJOTmJ1YzlWLTBXVXhSemI5SFk5aTZyYXhmZDQ2cjNSRlFYYzhHUmNQYU12ZnZibjFDONIBgAFBVV95cUxPQnY2MVVVR1VoVmxpSlY2OWlESGJmQlNDY0F0MmVTajdQaVh5UVNZWHJ2a0hjbVhoMHgxRVV3UG9JRk9RSkwxT1piUDZpeFNjZll3X1pmcjFvTlc0bVJfUkRzeWZoc1dBWVpxLTd6c25RVi1abFc1c050OW9CVGxMVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Hits $3,900. Will It Reach $4,500 Before ETFs? - U.Today",
        "content": "Arthur Cheong, founder and CEO of Defiance Capital, has predicted that the price of Ethereum (ETH) could potentially hit $4,500 even before the launch of spot ETFs.\n\nAdvertisement\n\nAt press time, Ether is trading at $3,885 after adding 3.6% over the past 24 hours, according to CoinGecko data.\n\nAs reported by U.Today , the SEC greenlit 19b-4s listing requests from a slew of Ethereum ETF issuers last week in a stunning U-turn. Prior to that, leading ETF industry analysts as well as major banking players of the likes of Standard Chartered claimed that these products were unlikely to be approved.\n\nAdvertisement\n\nAfter the news about imminent ETF approval broke on social media, the Ether price entered a major uptrend, surging from $3,600 to $3,900 in a span of just three days.\n\nWeakening momentum\n\nDespite the major bullish catalyst, the leading altcoin has so far failed to gain a footing above the $4,000 level. It is also down 19.8% from its all-time high.\n\nAccording to 100eyes Crypto Scanner, the Ethereum price has seen bullish divergence on the hourly time frame. This bearish pattern occurs when an asset manages to make new highs, but the Relative Strength Index (RSI) records slower highs. Based on this particular chart, it is clear that Ethereum is currently experiencing weakening momentum despite the substantial price increase. The RSI recorded a lower high in the 65-70 range after Ether surged to $3,900, which is the main horizontal resistance level.\n\nIf the bearish divergence ends up playing out, the price of the chief altcoin could experience a pullback from the current level. However, it is also likely that Ether will be able to break above $3,900 if the volume is strong enough."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQMGZIbHhxRjcyYlJoZThUakpkMm9yZXpZaGlINnVKUG5Md3JrdmxROVNzZzBsU05qNUJUOE5KdEFOVkViYjhmdDRGdTViajBGa2pEM1VvUVBmOHVxNWtjOE9EWGlNcG4xbmVoM2tid0U4bE8ydk5MM0dmU1JuN2JrRkRRSmxMUzRVZHN3UEpRSTA3cU1aWUpuWUp3SFVHUkJjd3hFSzExSzFIWHBjYXdCQWh3U2NDcHpBWmEyblo0SdIBxAFBVV95cUxOQmpKOGZlYXJSZEVkc3ZidVViQUUzX0FRMUFMWmsyYlFXLThkUjRJSHUxUFlUUUdhNVpBSUVPZ0pIb3Y2a3cyV2hxcktvcTlBZEstYmt4TkMxR0JEOEl1MWo1bm80b0dHampZUTZKOEF4bmQwMWc3SDdGaWJ2WEI1QU9UOHdJSzltOWRvcHBfdW9hTVJHaF9aZlZHTUJBNW9aT0c4SWE4VndpUXJWWW1KbU5DMmxiQmd1VDd4MWJvZklwaW5Z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Ethereum Meme Coins PEPE, MOG Hit Lifetime Highs on Ether ETF Filing Approvals - CoinDesk",
        "content": "Several Solana-based meme coin tokens surged from December to March as the network’s SOL tokens took off – contributing to ecosystem growth and garnering attention. Also in December, the Avalanche Foundation, a non-profit organization that maintains the Avalanche blockchain, said it would invest in meme tokens built on the network in recognition of the online culture and memetic value that such tokens can drive among investors."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE1FMjV1SGZxWWFtU0Q2TlZfMGlxY2E0QVJDQmpLRlZyQ3huTlFydmRXQ3YtWGxOeEdTOVJpWHVOc1dOdzBmdUxsajJ2azd4LTFzMFBFSzRTcGl3OUVEUEh6V2ZUd3JCV2dBdGgw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ethereum devs set Pectra upgrade for Q1 2025 - Crypto Briefing",
        "content": "The upgrade will replace EIP-3074 with EIP-7702, proposed previously by Ethereum developers, including Vitalik Buterin.\n\nShare this article\n\nEthereum’s anticipated Pectra upgrade is now scheduled for release by the end of Q1 2025, according to recent updates from Ethereum developers. Pectra is the next major milestone on Ethereum’s development roadmap, following the Dencun upgrade which was successfully deployed in March.\n\nSome more up to date thoughts the next hard fork after Cancun, Pectra (Prague + Electra):\n\n* Ship Pectra by end of Q1 2025.\n\n* Include PeerDAS for Rollups to scale.\n\n* Include EOF for improving the EVM on both L1 and L2. Longer doc inside.\n\nExcited for the conversation to continue. https://t.co/lNwYg0I4vj pic.twitter.com/80dJfALaSv — Georgios Konstantopoulos (@gakonst) May 23, 2024\n\nThe decision comes after Ethereum developers evaluated multiple timeline scenarios. The team has opted against a rushed release before Devcon in November 2024, favoring a more cautious approach that allows for the inclusion of additional, impactful user features.\n\n“We are observing that this is also what happened with Cancun, so being realistic, my vote would be to aim to ship Prague in Q1 2025. With today’s scope, delaying Prague seems to have marginal impact on users and allows us to consider expanding the scope to include more impactful features for users,” Ethereum developers noted in a document.\n\nDevcon is the largest developer summit in the Asia Pacific region. This year, the event will take place in Bangkok, Thailand, from November 12-15, aiming to bring together developers, technology leaders, and dev-tool companies to learn, discuss, and debate the key opportunities and challenges in the developer ecosystem.\n\nAvoiding releasing the Pectra upgrade before/during Devcon will allow the developer team to effectively monitor the execution of Pectra.\n\nDuring the deployment of Dencun on the Goerli testnet in January, Ethereum developers encountered difficulties achieving consensus within the expected timeframe. The issue was then resolved, allowing the Goerli testnet to finally reach consensus.\n\nIn addition to the upgrade timeline, the focus is on improvements in the consensus layer scope and execution layer scope. Developers aim to integrate PeerDAS into Pectra to enhance Ethereum’s Data Availability capacity ahead of the Osaka upgrade, as noted in the document.\n\nEthereum’s Osaka upgrade is a future hard fork that is expected to include features that were previously considered for the Pectra upgrade but have been postponed. Specifically, the Osaka upgrade is likely to include the implementation of Verkle Tree, a new data structure designed to enhance Ethereum’s scalability and decentralization.\n\nDevelopers also considered the inclusion of EOF to improve smart contract security and developer experience, as well as other enhancements like replacing EIP-3074 with EIP-7702 for better account abstraction compatibility, and patching EIP-2935.\n\n“We need to decide on EIP7702 on ACDE, and if so, implement it as a replacement for EIP-3074. We think it makes sense to do so as it’s a more native-AA compatible solution because of the new transaction type vs an opcode,” Ethereum developers wrote.\n\nEIP-7702 is a new transaction type proposed by a group of prominent Ethereum developers, including Vitalik Buterin, earlier this month. The proposal is expected to bring similar benefits to EIP-3074 while addressing its potential risks."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNOHY0SVZhOTg3N2I5ZE9Rb3FQWjF4UG9kenhmeHVfSnVpVmJfR0QxYTVCYnlTSGFQdlprbUp6NnRHem1FdHdVV2w2SGczQzA1NEtGTVl2NGVpbzRfMmdDX01BWjVvbGFkZGJhR3BYMlc4MDZpZzVCdUJzRjA3TG92S0JFM2s0U0JXVVprOGxtLVd4REhKZ2Y5RkFxdkc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Heads toward $5k: Whales Inject $2 Billion Within 5-Days of ETF Approval - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPbHNxcDFJNDhSZ1dJSjJPaEZiYzZzcGZBRU9kU2xRSDhfa2x6VXdCRy16ODE1dENyS0JRdTQzMVBNNHlGMk5vX2Z5Vl9faDVMU0JrekJneU43eUZYSUhfZUhSUmZZM2ZqNjk3bFVrLU8wUXMwQmxNZ3dpS0FJNDBwUDYwZ0E5VklSR3lwNXpDZHdVZE1zeGtV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Ethereum Moving Closer to $4,000, New All-Time High Soon? - Crypto Times",
        "content": "Ether (ETH) is nearing the $4,000 mark. This rise comes amid speculation that a recent ETF approval might spark a significant price rally. It is now only around 25% away from crossing its all-time-high.\n\n\n\nAt the time of writing, Ethereum was trading at around $3,922. Its trading volume has increased by 79.91%, reaching $17.95 billion. Its market capitalization is now approximately $470.41 billion.\n\nETH/USD, 24hrs Price chart, Source: CoinMarketCap\n\nArthur Cheong, the founder of DeFiance Capital, suggested in a May 26 post on X that ETH might even hit $4,500 before the actual launch of spot ETFs.\n\n4.5k before spot ETF go live for trading imo. — Arthur (@Arthur_0x) May 26, 2024\n\nAlso, crypto analyst Rekt Capital says Ethereum (ETH) must end the week above $3,956 to possibly reach over $4,000.\n\nHistorically, Bitcoin experienced a similar trajectory, soaring over 70% to new highs within two months following its ETF approvals. If Ether follows this pattern, it could reach new peaks around $6,000 by the end of July, as it has now got approval for the ETF.\n\nEthereum’s Layer-2 networks are also experiencing robust financial activity, with the total value locked approaching a record high of $47 billion. With a market cap of $469 billion, both crypto investors and major Ethereum stakeholders are optimistic about the potential surge in institutional investments following recent ETF approvals.\n\nWill Ethereum cross its all time high after ETH ETF goes live?"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQT0c5UVRZLXU0WVJYNFRTWnVmOGFRT1U3ZlN6OFRud3g1U1haN0VmWGQ0cE51U3F2WEEtUmwyUW5ZOVk5WUdsd3BLVDU1aUpURURTczRCYjJmVjluYWtYTm5oakw5ZTVhd0RXRmdKd3k5U3lQSjBtbHg1R3lDWjk0dVdNZzR5ZkFzdHlJRjRMcmxyZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Crypto Highlights: Bitcoin Price Volatility, Ethereum ETF Hopes, and Furrever Token's $1.2M Presale Finale - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, May 27, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency market is constantly evolving, with significant developments influencing investor sentiment and market dynamics. Recently, Bitcoin has faced potential price risks, Ethereum has generated buzz with ETF speculations, and Furrever Token is nearing the end of its successful $1.2 million presale. Here's an in-depth look at these key events and their potential impacts on the market.\n\nBitcoin Faces Price Drop Risks\n\nBitcoin (BTC), the leading cryptocurrency by market capitalization, is currently experiencing potential price risks that have raised concerns among investors. A significant factor contributing to these fears is the activity of long-term holders. According to a recent analysis by analysts, these holders, who have amassed significant quantities of Bitcoin over time, are showing signs of profit-taking. This behavior often precedes a price drop, as large sell-offs can create downward pressure on Bitcoin's price.\n\nThe data suggests that long-term holders have been moving their BTC to exchanges, indicating a potential intent to sell. This trend, if it continues, could lead to increased volatility and a further decline in Bitcoin's price. Additionally, macroeconomic factors, such as regulatory developments and changes in investor sentiment, are also playing a role in the current market dynamics.\n\nDespite these concerns, Bitcoin's long-term fundamentals remain strong. Institutional adoption is growing, with major companies and financial institutions recognizing Bitcoin's potential as a store of value and a hedge against inflation. The integration of Bitcoin into traditional financial systems and its increasing acceptance as a legitimate asset class provides a solid foundation for its future growth.\n\nEthereum ETF Hopes Stir Optimism\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, has generated significant buzz with the potential approval of a spot Ethereum Exchange-Traded Fund (ETF). This development could mark a pivotal moment for Ethereum and the broader cryptocurrency market. A recent report by a trusted source highlights that industry experts, including Michael Saylor of MicroStrategy, believe that a spot Ethereum ETF could be beneficial for the entire crypto market, including Bitcoin.\n\nThe approval of a spot Ethereum ETF would provide institutional investors with a regulated and easily accessible vehicle to gain exposure to Ethereum. This could lead to increased demand and potentially drive up the price of ETH. Furthermore, an Ethereum ETF would signify a broader acceptance of cryptocurrencies by traditional financial markets, paving the way for further innovation and adoption.\n\nStory continues\n\nThe U.S. Securities and Exchange Commission (SEC) has been cautious in its approach to approving cryptocurrency ETFs, citing concerns about market manipulation and investor protection. However, the growing interest from institutional investors and the increasing pressure from the crypto industry could eventually lead to a favorable decision.\n\nThe anticipation of an Ethereum ETF has already had a positive impact on market sentiment. Investors are hopeful that this development will bring more legitimacy to Ethereum and attract a new wave of capital into the market. As the industry awaits the SEC's decision, the potential approval of a spot Ethereum ETF remains a key factor to watch.\n\n\n\n\n\nFurrever Token’s $1.2 Million Presale Nears to an End\n\nWhile Bitcoin and Ethereum navigate their respective challenges and opportunities, Furrever Token (FURR) is making waves with its unique approach to the crypto market. Furrever Token aims to create a heartwarming ecosystem centered around adorable cat imagery, offering a refreshing contrast to the often serious and technical world of blockchain projects.\n\nThe Furrever Token presale has been a resounding success, raising over $1.2 million as it nears its end. This achievement highlights the strong interest and support from the crypto community. Built on the BNB-20 blockchain, Furrever Token has a total supply of around 9 billion tokens. Of these, 65% are available during the presale, 25% are allocated for decentralized exchanges (DEXs), and 10% are reserved for the team, with a one-year lock on these tokens.\n\nFurrever Token's appeal lies in its blend of fun and innovation. The project integrates cute cat-themed stickers, emojis, and visuals, transforming everyday interactions into delightful experiences. Community engagement is a cornerstone of the Furrever ecosystem, with regular challenges and events that encourage users to share their love for cuteness. Future surprises, featuring exclusive cat content, are also planned to keep the community engaged and entertained.\n\nSecurity and compliance are paramount for Furrever Token. The project’s smart contract has been audited by Securi Lab, ensuring a secure and reliable platform for users. The team, while not doxxed, has shown commitment to the project's longevity by locking their tokens for a year. The organic growth of the Furrever Token community, with nearly 4,000 active members on Telegram, further underscores its legitimacy and potential.\n\nAs the presale nears its end, now is the ideal time to invest in Furrever Token. The combination of a strong community, innovative approach, high return rates, and robust tokenomics makes Furrever Token a standout option for those looking to capitalize on emerging trends in the cryptocurrency market. With its unique blend of cuteness and substantial growth potential, Furrever Token presents a compelling investment opportunity.\n\nIn conclusion, while Bitcoin faces price risks and Ethereum generates optimism with ETF speculations, Furrever Token's successful presale and engaging community offer a unique and promising investment avenue. The dynamic nature of the cryptocurrency market continues to offer opportunities for those willing to explore beyond the mainstream and invest in projects with distinctive value propositions.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nJoin $20,000 Furrever Token Giveaway\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPcmRKU2toSU1NQzBveGNhdnlIZ3JoRkxDcjFqbGhjSGFpQjhvU21DVDFleVlwaEgxaXEwUlEwTXd4SjVsN2xnYkhZQUYtOFJCZUZXNXkyUU9HQWFvWGNwU1VuXzBWUFVCMXpobl9ZOTJXcDVvN3RndjljZUJSVE9IaHpnNXZhTXVCZjFPb3dUemZ3LTZadkFSM05tTTZhSFVMcm9xNWQ3bDZtbFRJXy1xSFdFb3NJWnBlYmh4czNuQmdGZmtXaFJDQ0liS1daQdIB0wFBVV95cUxPeG5ELUFUNEpGVWNSLWRhczBRNXhMSmE1YWRYelZPdDNUT0tkcTQ4SGpLRFJpWnc4ZEhibnJldzZEbG5Dem9NcWZiSUIwaDFreU1hMm5zZ3JBNzNzU1dLd0MxVlpseDUwYjU5WlhPSHh0N2tZSDZ0cEliVDlDNWg4WjJiQ3JYbmFlQXlVSUttMXNlNjBQUWZlRml2MVdQbU9FZlhNVXN6QjlxTmNhbWZtWVdsYzlDUlQ0MTJ3NXVaaGozVHZYYWxVUE50Q1A5RDctaEFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Whale Spends $24,700,000 on Ethereum Altcoins After SEC Approves Listing of Spot ETH ETF: On-Chain Data - The Daily Hodl",
        "content": "A crypto whale was spotted over the weekend scooping up massive amounts of altcoins from the Ethereum ecosystem following the listing approval spot ETH exchange-traded funds (ETFs) from the U.S. Securities and Exchange Commission (SEC).\n\nFirst reported by blockchain tracking firm Lookonchain, a whale with a series of wallets bought Ethereum just above the $3,000 mark just before news of a likely ETH ETF approval surfaced.\n\nShortly after the ETFs got a green light from the SEC, the whale began to accumulate Ethereum-based altcoins, such as Lido (LDO), Uniswap (UNI), Aave (AAVE), Ethereum Name Service (ENS) and Fraxshare (FXS).\n\n“Before the ETH ETFs news, a whale spent 26.67 million USDT to buy 8,733 ETH at $3,054.56 and has an unrealized profit of ~$6 million.\n\nAfter the SEC approved form 19b-4 for ETH ETFs, the whale bought $24.7 million worth of Ethereum ecosystem tokens and has an unrealized profit of ~$1.1 million.\n\nHe deposited 19.75 million USDT to Binance and withdrew 4.04 million LDO ($9.3 million), 684,364 UNI ($6.7 million), 52,623 AAVE ($5.4 million), 82,041 ENS ($2 million) and 250,969 FXS ($1.25 million) from Binance.”\n\nLookonchain also spotted a whale on the Solana (SOL) network rotating their core holdings further out the risk curve, opting for Dogecoin (DOGE) rival dogwifhat (WIF).\n\n“A whale spent 17,966 SOL ($2.98 million) to buy 953,177 WIF at $3.13 in the past 5 hours, causing the price of WIF to increase by ~7%.\n\nThis whale previously spent 1 million USDC to buy 355,417 WIF at $2.81 on May 21st and then sold it at $3.07 for 1.09 million USDC on May 22, making $90,000.”\n\nAt time of writing, WIF is trading at $2.99.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE5kRDJFZGs4NGdvR2w0MXdSTWRfLVBZWGtMZDQ3ejJBVTRqRzlCYWdCWHNDSl80WkVuNzJGT2R6Nm5iLTRSUkc1SGxoOVJGY29SOG9ab3NRaDFFNFJmTW9GVHNGNnFEcTdzTHFFZUtZSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "How Green Is Ethereum? - Investopedia",
        "content": "Ethereum's update in September 2022 was called the Merge. Developers integrated the long-anticipated transition to proof-of-stake in this update (among other issues) significantly reducing the blockchain's energy requirement. The new Ethereum chain, which was called Ethereum 2.0 until the Ethereum Foundation requested that it not be, reduced energy use and promised faster transactions and lower gas fees. Read on to discover how green Ethereum is and learn about its plans that may be even more environmentally friendly.\n\n\n\nKey Takeaways The Ethereum blockchain upgrade was called the Merge.\n\nThe upgrade enhanced the network and reduced energy consumption.\n\nIts proof-of-stake validation mechanism is more environmentally friendly than proof-of-work mechanisms.\n\nGas fees fell after the Merge (not because of it), but they aren't as low as from 2017 to 2020.\n\nThe Merge set the stage for further scalability enhancements to the Ethereum Virtual Machine.\n\nEthereum and Energy Use\n\nEthereum is a software platform that is open to anyone. It is commonly associated with ether (ETH), a cryptocurrency that is bought and sold by investors. Ethereum can be used by anyone for different reasons, including banking and finance, network and application building, and peer-to-peer financial networking without the need for middlemen.\n\nEthereum was created in 2013 and launched two years later by Vitalik Buterin. It is among the most well-known names in the cryptocurrency markets, coming in as the second-largest by market capitalization after Bitcoin. As of May 27, 2024, Ethereum's market cap was $466.67 billion. But, Ethereum mining is no longer possible after the move from the proof-of-work (PoW) model to proof-of-stake (PoS). Proof-of-stake reduced the blockchain's energy use by more than 99%.\n\nPoS differs from PoW in that it is not a network-wide competitive process of encrypting information through a hashing algorithm. PoS still uses a hashing algorithm and verifies transactions through a consensus layer, but the validators are randomly chosen by the network based on the amount of ether they have staked. Staking means offering ether as collateral to become a network validator so the participant can earn ether rewards.\n\nSelecting one semi-trusted validator to hash the information in a block and verify it uses far less energy than a competition. So, Ethereum is much more green in terms of energy consumption than it used to be.\n\nWere Ethereum Gas Fees Reduced?\n\nTransaction fees rose on the Ethereum network in 2020 because of increased network activity. At the time, the transactions of originators who offered the most in fees were placed in front of those who paid less. This created a fee war of sorts, with users trying to get their transactions validated quicker and miners charging more for prime validation spots.\n\nAn earlier attempt to fix rising costs tried to remove the transaction auction mentality from the network by imposing a base fee and a priority fee. The priority fee is similar to a tip to validators for them to choose to process one transaction instead of another. This was ineffective at lowering transaction fees because users still increased their tips to get transactions approved faster.\n\nEthereum is on its way to becoming a greener blockchain and network. Future upgrades are expected to make it more efficient, scalable, and less costly.\n\n\n\nEthereum Transaction Speeds\n\nThe Merge, which was an upgrade to the Ethereum blockchain to a different version set the stage for future upgrades. Many people called the upgrade Ethereum 2.0, It was the most significant update to the system. Although it didn't improve transaction speeds at the time or even a few years later, future upgrades will introduce improvements in network speed and scalability.\n\nIs Ethereum Green?\n\nAccording to the Ethereum Foundation, the blockchain and network consume 0.0026 terawatt-hours per year (TWh/yr). This translates to the equivalent of 870 tonnes of carbon dioxide. Compare this to Bitcoin's 149 TWh/yr and global data centers' 190 TWh/yr. Ethereum also consumes less energy than video gaming in the U.S. (34 TWh/yr) and less than Google (19 TWh/yr).\n\nThe University of Cambridge's Judge Business School researched the energy sources for the Ethereum network after the Merge. According to its findings, 48% of Ethereum's energy comes from sustainable sources like wind power, nuclear power, and other renewables. The remaining 52% is powered by natural gas (30%), coal (19%), and oil (3%).\n\nAccording to similar reports, Ethereum is greener than it was before switching to PoS. However, there are many more upgrades planned that have the potential to make it even more efficient and eco-friendly.\n\nThe Securities and Exchange Commission (SEC) approved the listing of eight new spot Ether exchange-traded funds (ETFs) in May 2024. Trading will take place on the NYSE, Nasdaq, and CBOE BZX. There is no initial trading date as of yet, as the SEC is still working on final approvals. The move follows the approval of spot Bitcoin ETFs, which began trading in January 2024—three years after Bitcoin futures ETFs were launched.\n\nThe Green Future of Ethereum\n\nEthereum has plans for upgrades to bring a new concept to the blockchain, which is expected to allow it to scale and increase transaction processing speeds. In March 2024, the Dencun Upgrade was released.\n\nThis upgrade introduced proto-danksharding, a process where second-layer rollup providers can send Binary Objects (also known as blobs) to the Ethereum main chain. Blobs are much cheaper to send than rollups, so transaction fees are expected to drop when full danksharding is released.\n\nThe full upgrade to danksharding is expected to allow Ethereum to scale up to more than 100,000 transactions per second and be cheaper, both of which will contribute to its greenness.\n\nFuture upgrades will address issues regarding:\n\nCensorship resistance\n\nDecentralization\n\nProtocol risks from Maximal Extractable Value\n\nBlock verification\n\nComputational costs\n\nMaximal Extractable Value is the maximum amount of value a validator or miner can get from a block in excess of the block reward and usual fees.\n\nThe lesser the blockchain costs, the more decentralized it becomes and the more efficient it will be. However, there are concerns whether decentralized applications built on Ethereum will consume more energy. Ethereum has positioned itself as the platform of choice for Web3 development.\n\nWeb3 is a concept of restructuring the backend of the internet, where control of people's information, data, and digital creations are returned to them. Many steps must be taken and hurdles overcome before blockchain technology can be used to create the new internet infrastructure conceived by developers.\n\nIf Ethereum is the platform used to create applications for this emerging and in-development restructuring, its eco-friendlier network might not be as environmentally friendly. However, it could be even more so—there is no way to tell.\n\n\n\nDoes Ethereum Use Energy? Yes, Ethereum uses energy. It is a blockchain, a distributed ledger secured by cryptography, which requires energy to run and use.\n\nIs Ethereum Environmentally Friendly? Ethereum's carbon footprint is much less than it was before September 2022 but it still uses energy. Nearly half of its network is located in developed areas that use sustainable energy sources. About 30% of the remaining half is powered by natural gas, 10% by coal, and 3% by oil.\n\nHow Much Energy Did Ethereum Use Before the Merge? According to data from the University of Cambridge's Sustainability Index, Ethereum used about 21.41 THh of electricity per year and released 10.26 million tons of carbon dioxide.\n\nThe Bottom Line\n\nFor Ethereum, the evolution to a better-performing, more accessible network has begun. Continued updates promise to cut back on emissions and make the network more energy-efficient while improving speeds and cutting transaction costs. However, Ethereum has much ground to cover to get to the levels of efficiency it wants, both in speed and environmental friendliness."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE9JZ3lTc3djQ1NsUm80dy1oUDVIWU5tMjMxWFNUaUNNR0k0ZGlNRTFVa2lkcEhoNVVrRkFPSjJ3RDlSXzhqVDMxdGJ4YnhtU0tHa3A3V1BGWGVPS1ZuOXB6VzBkUXBvRjAwTE1QS3RR0gFzQVVfeXFMTWVSY2lwaXByTnlZZnVvYnd2YXNEU2JXeUREdDlYYmhkdnVpUDZWbXd6YjJsYjk1Nk5OT2syNmJULUVEMjdhMWV1c0FPNmo2M2xKRjU1X0NqU0lVZVc0NlBtTUJPUzVqdU9JaElzbU1kN0pnSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Two Major Ethereum (ETH) Price Targets Revealed - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum is finally showing what it is capable of after rumors of the preapproval of the Ethereum ETF have spread around the crypto circle. For now, the price is getting ready for a swing toward or above $4,000, but its true strength is yet to be shown.\n\nAdvertisement\n\nEthereum has been seen in an uptrend that recently broke through $3,900. Currently, ETH is trading around $3,898, showing a gain of 1.92%, and the upsurge is supported well by swift trading volumes.\n\nThe technical indicators are aligning to suggest further upward movement. The 50-day EMA stands near $3,225, while the 100-day EMA lies close to $3,175. Both moving averages have provided strong support and confirmed the current trend. In addition, the RSI is at 72, which means that, at the moment, ETH is slightly overbought. Yet, this is not critical and, therefore, in case of a minor overheating, the asset can continue to grow a bit higher.\n\nTwo major price targets have emerged for Ethereum:\n\nAdvertisement\n\nthe immediate level now seems to be that psychological $4,000. Anything lower would imply the prevalent bearish sentiment confirmed at the moment. This will most probably see buyers join in and push the price even higher or, in other words, liquidate some substantial amount of short orders.\n\nAs for the liquidation heatmap: at the time, there was a huge cumulative long liquidation leverage all the way down to $3,200, meaning there were $3 billion worth of longs open — theoretically meaning there might be a massive sell-off in the case of liquidation. More than $1 billion in short orders get closed if the price of the second-biggest cryptocurrency on the market surges, causing a squeeze and sending bears away."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQRWdTeVJjNTRtY1BJOTNJTGlfaVRGVG1jSWNpckFHcllJZEszUXkxRDIxZGlPWUFuWWVnS01nTk15N1RaSzlQbGdnNHF4QzRJVHdHMWg5a0F6NE5nM18wM1pJRnhGdm13RUFoTjlvdi1GTVkwdnM3RkYtQVhDZEdvb2JtQWpfT0NXVWZn0gGTAUFVX3lxTE9oNUJlZlJOSU9oY05zMVhvQU9zZFNJaUdYaWFVbExHbldTeTY4Y1pJSkw5SlAzZVhlT3Y4OURxUEFNS1BnS1laY2VQRFhEcXRRekRkRk5sUGgwZkpoWTA2MnE3N1lYSFc3RS0yVGFZRVRpNlZWMHZnbExRaGtUcV9zRFBNdnlXNFR1ZkhBVVU3WXEwRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Bitcoin Over $70K Amid Argentina Legal Tender Talks, Ethereum Flirts with $4K - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMost of the top 100 tokens are in the green as Bitcoin jumps 2.5% and slips past $70,000 while Ethereum flirts with $4,000. The price of BTC is $70,136 while the price of ETH is $3,934 as of writing, according to CoinGecko data.\n\nThis comes as Argentina opens discussions with El Salvador’s Digital Assets Commission on their experience using Bitcoin as legal tender.\n\n“El Salvador has established itself as a global leader not only in the use of Bitcoin but also in the broader realm of digital assets,” Roberto E. Silva, president of Argentina’s National Securities Commission, said in a blog post. “We aim to strengthen our ties with El Salvador and are exploring potential collaboration agreements.”\n\nEl Slavador made headlines in 2021 when it became the first country in the world to make Bitcoin legal tender, leading to a surge in tourism and going on Bitcoin spending sprees. Now Argentina, with their new eccentric leader Javier Milei, is looking to explore Bitcoin as legal tender too.\n\nAD\n\nAD\n\nAccording to WorldoMeters, Argentina is the 22nd largest country by GDP with a population of over 45 million people. While the meeting happened on May 23, the news didn’t spread until today as Bitcoin climbs 2.5% over the $70,000 threshold.\n\nIn turn, there’s been a whopping $28 million of liquidations—$23 million of them being short positions. Meanwhile, $17 million of short Ethereum positions have been liquidated, according to CoinGlass.\n\nThis is because Ethereum has seen similar gains of 3.8%, putting it within touching distance of the $4,000 mark. On Thursday, the U.S. Securities and Exchange Commission (SEC) made a landmark approval of spot Ethereum ETFs, effectively green-lighting Ethereum trading on Wall Street.\n\nOver the coming hours and days the price remained largely unchanged, even dropping 4% at one point. But now, as anticipation for volume from the ETFs grows, the second largest cryptocurrency is starting to see gains.\n\nAD\n\nAD\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxObFV1XzdWWXJhTkZReWhiRml2N3RKd2J1eWxJVFpkWlpvanlnaHNYTFEyYXBEbkxlTjFDeFhZbEJGaDFFMnRwYktvWEIxSC1kWjNWOExTT2xCdDA5TmJWSnZ6SXZ3b2VyblhLUjUwMWRrYUFqVnh3Y2MyVjhIZlI2NmxDckxJckhrUWVOTl9fNGjSAZYBQVVfeXFMTm1hdUtIaEx0dzIycTduWmgyM3FUTm9qSmFVeTlhTXV1QzRZcE41c0ZzZHlLbE1VeFMzcDQ0c2J2QmV3cFdnRHN0bVFYYzE0bENZc1J3RHI2Uk5YaU9HSEQyOTR6WXJYR2E3eVh2aUVNUlRwdG9OWWxIR1NDZTdDQk1TT1VSUVhrcU1yVGZTVkxNa2lyZ293?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ethereum and Bitcoin Correlation: Will Ether Price Pick Up Pace? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAfter the SEC approved Ethereum ETFs on Thursday, March 23, Ether has yet to show signs of growth. For Bitcoin, it took almost a month after the ETF approval before the price could set on a massive bull run, reaching an all-time-high of $73,738.00 on March 14.\n\nIn September 2022, Ethereum moved to proof of stake (PoS), a set of interconnected upgrades that made Ethereum more secure and sustainable. Proof of stake substitutes computational power with staking (making it less energy-intensive) and replaces miners with validators, who stake their cryptocurrency holdings to activate the ability to create new blocks.\n\nThe growing popularity of Ether dApps prompts traders to diversify their portfolios. A closer look at the BTC/ETH correlation could hint the possibility of the Ethereum price finally picking up the pace.\n\nAdvertisement\n\nBTC/ETH correlation coefficient\n\nThe BTC/ETH correlation refers to the price relationship between Bitcoin (BTC) and Ethereum (ETH), typically expressed in terms of BTC. For example, if Bitcoin is priced at $60,000 and Ethereum at $3,000, the ratio is 0.05, meaning it costs 0.05 BTC to buy one ETH. If ETH's price increases faster than BTC's, the ratio rises, indicating it costs more BTC to buy ETH.\n\nAnother measure of this relationship is the correlation coefficient, ranging from -1 to 1. A coefficient of 1 indicates that BTC and ETH move in the same direction, -1 indicates they move in opposite directions, and 0 signifies no correlation. For instance, during periods of negative correlation, if BTC's price rises, ETH's price would fall, and vice versa.\n\nThus, the BTC/ETH correlation shows the price relationship between the two assets, while the correlation coefficient measures how their prices move relative to each other. Both metrics are crucial for efficiently trading the BTC/ETH correlation.\n\nHistoric correlation\n\nHistorical data shows that Ethereum tends to be priced higher during bull markets. For instance, ETH was priced above 0.05 BTC during the bull runs of 2018 and 2021. After 2021, the 0.05 BTC level has consistently served as a strong support region. Conversely, the 0.08 BTC level has acted as significant resistance on three separate occasions.\n\nDuring the BTC bull run, the correlation had been steadily growing, peaking on March 14, when the BTC price reached an ATH.\n\nThe graph indicates that Ethereum outperforms Bitcoin in bull markets and underperforms in bear markets. While past performance does not guarantee future results, it provides valuable insights for making more informed decisions.\n\nA recent Coinbase report shows that the correlation between Bitcoin (BTC) and Ethereum (ETH) has been declining since early 2023, particularly after Ethereum's Shanghai (Shapella) hard fork on April 12, which enabled staked ether withdrawals. This change has reduced the 40-day rolling correlation from 0.95 to 0.82.\n\nHistorically, BTC and ETH have moved together, but factors such as the rising adoption of Ethereum-based decentralized applications (dApps), the popularity of non-fungible tokens (NFTs) and Ethereum's shift to a proof-of-stake (PoS) consensus mechanism are driving the divergence.\n\nEthereum ETFs expectations\n\nAccording to IntoTheBlock's research, 95% of current ETH positions are now profitable, with its price increasing by 30% over the past seven days. This level of profitability has not been observed since November 2021, when ETH prices soared to an all-time high.\n\nThere is minimal resistance to the volume of ETH purchased at prices higher than current levels. Specifically, 3.57 million ETH were bought in the price range of $3,800 to $4,800, compared to 53.54 million ETH purchased between $2,160 and $2,650.\n\nETH whales have also begun to make significant moves, following the increased odds of ETF approval. On Tuesday the 21st, ETH recorded an on-chain trading volume of $15.98 billion, marking the highest volume recorded since June 13, 2022.\n\nOf the $15.98 billion in trading volume recorded, $14.33 billion came from transactions exceeding $100,000, typically conducted by whales. This represents 90% of the total traded volume for this day. This trend could be expected to accelerate now that the ETFs have indeed been approved.\n\nThe approval of the ETH ETFs marks a significant milestone in cryptocurrency acceptance, likely influencing increased activity among ETH whales as reflected by recent large-volume transactions. The shifting landscape, underscored by substantial on-chain trading volumes, suggests a growing institutional and investor confidence in Ethereum."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNSnl3WHdpME9Wa01IVDZaRUVjVkVmNHBPUFhGaUNnWFJLcG9Vbmw3WE5mY0I0UU5pNFk3aHlzQWcwR3JfazFFOWQxd0tpNWNmc3JQV3JUa05HcHFlbEdJdEdILUhpbTdleDBWU2g4NEZnRXY2Wm9naU9IdnVIRG5GZk4zQmnSAYoBQVVfeXFMTmNpRllSYkY2Ml9pYlpHZ1B6bUdQX1JiQXVmdGpOdlVlWVVBVEhVMnMzalJvamdzSjRkWS1tMkVfeEFHc0YxVTJQRndJTjdCZ0N4cVQ0Tk9NbzZOa09CRHY3eEhmMHhfa2Vyb1RxaFZWY2RSZDlES2RTX19uZHdpNXpuRVFBWjM3THhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Rally Imminent? Analyst Predicts New All-Time High - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum (ETH) is showing strong signs of an imminent rally, potentially reaching new all-time highs. This optimistic outlook was highlighted by prominent crypto analyst Jelle, who recently tweeted that ETH has broken out from the falling wedge and flipped its key areas into support. He mentioned that Ethereum is now pushing for $4,000 before potentially reaching a new all-time high.\n\nAs of the latest data, Ethereum is priced at $3,904, reflecting a 2.66% increase in the past 24 hours. More impressively, the cryptocurrency has surged by 25.69% over the last 30 days. This robust performance has been accompanied by a significant rise in trading volume, which has jumped by 73.17% in the past day, reaching $18,148,744,905.\n\nFactors driving Ethereum's surge\n\nSeveral factors are contributing to Ethereum's recent price surge and the optimistic predictions for its future. Key among them is the recent regulatory development in the United States. On Thursday, the Securities and Exchange Commission (SEC) approved applications for the listing of eight spot Ethereum exchange-traded funds (ETFs). While further approvals are necessary before these ETFs can be traded, this move is seen as a positive step toward the broader adoption of ETH on the financial markets.\n\nThe approval of spot Ethereum ETFs is expected to attract significant institutional investment, providing a new avenue for both retail and institutional investors to gain exposure to Ethereum. This development is likely to increase demand and liquidity on the market, supporting the upward price momentum.\n\nAdvertisement\n\nTechnical analysis supports bullish outlook\n\nMoreover, Jelle's analysis points to a strong technical foundation for Ethereum's current rally. The breakout from the falling wedge pattern is a bullish signal, indicating a reversal of the previous downtrend. The ability to flip key resistance areas into support further strengthens the case for continued upward movement .\n\nIn technical analysis, a falling wedge is a bullish reversal pattern that occurs when the price makes lower highs and lower lows within a converging downtrend. The breakout from this pattern suggests that the selling pressure is waning, and buyers are gaining control. Additionally, the flipping of resistance levels into support indicates strong buying interest at higher price levels, providing a solid base for further gains."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNdWZDcTg0LU02WVZMb3U5QVY1SmRhNV81QnZFQUt2cmpGeWdhNlNTOTM2dHNvaFpGQ0ZJMmdpOUg5alFtVFhMYVFQTjhxNDhxeTFMNlcwTGJkUExGRXZicENwVDZCa0RyNDQxWFExOFFic2s1am5idmJFYXI5dk9Dc2hzX05rVF9MTmUyRlMzNm5yTUMzUkxDMEp5Y3Fsdk85QURlV3l6bkVMdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Comparing smart contracts across different blockchains from Ethereum to Solana - CryptoSlate",
        "content": "The crypto industry has several unique approaches to smart contract execution and decentralized applications (DApps). These innovations are driven by the need for scalability, security, and efficiency, allowing developers to build increasingly sophisticated applications. Yet, what is so different between the smart contracts on different blockchains? Which is the smartest smart contract platform?\n\nTuring completeness is a key aspect of smart contracts. Turing completeness is a concept from computational theory that refers to a system’s ability to perform any computation given enough time and resources. It is named after the British mathematician and logician Alan Turing, who developed the concept in the context of the theoretical Turing machine.\n\nAmong the leading blockchain platforms, Ethereum, Internet Computer (ICP), Polkadot, Cardano, and Solana stand out for their distinct strategies in leveraging Turing completeness and smart contracts. This article explores how each platform addresses the challenges and opportunities in the blockchain space, highlighting their specific capabilities and contributions to the decentralized ecosystem.\n\nEthereum Smart Contracts\n\nThe Ethereum Virtual Machine (EVM) stands as a cornerstone of the Ethereum network, a decentralized platform enabling the execution of smart contracts and decentralized applications (DApps). The EVM is a stack-based virtual machine designed specifically for Ethereum, facilitating the computation of state changes after each new block addition. Its Turing completeness allows for executing any computation given sufficient resources, making Ethereum capable of supporting complex smart contracts and DApps. This capability, however, necessitates a gas mechanism to measure and manage the computational effort required for each operation. Gas prevents infinite loops and ensures network stability by requiring users to specify a gas limit for their transactions, halting any that exceed this limit.\n\nSmart contract development on Ethereum primarily uses Solidity, a statically typed, contract-oriented, high-level programming language influenced by C++, Python, and JavaScript. Solidity supports inheritance, libraries, and complex user-defined types, enabling developers to write smart contracts that implement intricate business logic and generate a chain of transaction records on the blockchain. Compiled into EVM bytecode, Solidity code is deployed to the Ethereum blockchain, where the EVM executes it to perform the specified operations.\n\nSecurity is paramount in Ethereum smart contracts, given their immutable nature and the significant value they often control. Common vulnerabilities include reentrancy attacks, integer overflows, and improper use of delegatecall. High-profile incidents like the DAO hack and Parity wallet issues highlight the importance of secure coding practices.\n\nDespite its theoretical Turing completeness, the EVM faces practical limitations due to the gas mechanism. Gas limits curtail infinite loops and excessively complex computations, ensuring the network remains functional and efficient. This practical constraint is crucial for maintaining network stability, though it limits the complexity of operations that can be executed.\n\nEthereum’s Turing completeness has enabled a wide range of applications, including fungible (ERC-20) and non-fungible (ERC-721) tokens, DeFi platforms, decentralized exchanges, and decentralized autonomous organizations (DAOs). These capabilities have fostered a thriving ecosystem of DApps and services. Additionally, EVM compatibility allows developers to port their DApps and tokens to other EVM-compatible chains like Polygon and Avalanche, enhancing interoperability and expanding the ecosystem.\n\nEthereum’s pioneering role in blockchain technology drives innovation and adoption in the decentralized application space. Its Turing completeness, coupled with the flexibility and security measures of the EVM, positions Ethereum as a leading platform for developing and deploying smart contracts and DApps.\n\nThe Internet Computer Protocol Smart Contracts & Canisters\n\nThe Internet Computer (ICP), developed by the DFINITY Foundation, introduces a novel approach to decentralized applications (DApps) and services through its unique architecture. At the core of ICP are canister smart contracts, which combine code and state, allowing for sophisticated computation and data storage. These canisters are Turing complete, enabling the execution of any computation given sufficient resources. This capability supports the development of complex DApps entirely on-chain, offering a scalable and efficient platform.\n\nOne of ICP’s standout features is its reverse gas model. Unlike traditional blockchains, where users pay transaction fees, ICP developers pre-pay for computational resources by converting ICP tokens into cycles. These cycles, which are stable and pegged to the Special Drawing Rights (SDR), cover the costs of computation, storage, and bandwidth. This model eliminates the need for end users to hold tokens or pay gas fees, simplifying the user experience and enabling developers to implement their own tokenomics and monetization strategies.\n\nICP’s interoperability extends to other blockchains, notably through its direct interaction with the Bitcoin network. Features like Threshold ECDSA and the Bitcoin adapter enable canisters to securely hold, receive, and send BTC. Furthermore, ICP has introduced an API that allows its smart contracts to communicate with any Ethereum Virtual Machine (EVM) chain, facilitating cross-chain liquidity and integration with other blockchain ecosystems.\n\nSecurity and scalability are paramount for ICP. Chain-key cryptography ensures the security and integrity of smart contracts through secure key management and digital signatures. ICP’s architecture supports horizontal scaling by adding new subnets, allowing for the deployment of an unlimited number of canisters and storing vast amounts of data. This scalability is essential for large-scale applications, ensuring the platform can grow to meet increasing demands.\n\nPractical considerations for developers include managing the cycle balance of their canisters to ensure continuous operation. Tools like CycleOps automate this process, making it easier to maintain and top up canisters as needed. The stable cost of cycles also makes ICP an attractive platform for building cost-effective and scalable DApps, providing predictable and manageable expenses for developers.\n\nICP supports various applications, from simple, smart contracts to complex multi-canister projects. Decentralized social media platforms like DSCVR, decentralized email services like Dmail, and various DeFi applications exemplify the diversity of use cases on ICP. The platform’s aim to provide a decentralized alternative to traditional cloud services emphasizes its potential to revolutionize how applications are built and operated, offering security, scalability, and user-friendly experiences.\n\nThe Internet Computer’s approach to smart contracts, leveraging Turing completeness, a reverse gas model, and robust interoperability features, positions it as a powerful platform for the next generation of decentralized applications and services. Its emphasis on security, scalability, and cost efficiency further enhances its appeal, making it a significant player in the evolving blockchain landscape.\n\nPolkadot Smart Contracts on Parachains\n\nPolkadot is designed to enable interoperability among various blockchains through its unique architecture. The network’s core comprises the relay chain and parachains, each playing a distinct role in maintaining the system’s functionality and scalability. The relay chain serves as the central hub, providing shared security, consensus, and interoperability, while the parachains are independent blockchains tailored for specific use cases, supporting a diverse range of decentralized applications (DApps).\n\nAs a layer 0 protocol, the relay chain does not natively support smart contracts but facilitates the coordination and security of connected parachains. These parachains can communicate with each other and external blockchains via bridges, enabling seamless asset and data transfers across different networks. This interoperability is a key feature of Polkadot, fostering a cohesive ecosystem where various blockchains can operate together.\n\nPolkadot supports smart contracts through several environments, notably ink! and Ethereum Virtual Machine (EVM) compatibility. Ink! is a Rust-based language explicitly designed for the Polkadot ecosystem, allowing developers to write efficient and secure WebAssembly (Wasm) smart contracts. Polkadot also supports Ethereum-compatible smart contracts via the EVM pallet, enabling developers to port their existing Ethereum DApps to Polkadot with minimal modifications.\n\nParachains like Moonbeam and Astar Network exemplify Polkadot’s versatile smart contract capabilities. Moonbeam is an Ethereum-compatible parachain that supports Solidity smart contracts, allowing developers to utilize familiar Ethereum tools and libraries. Astar Network supports EVM and Wasm smart contracts, offering true interoperability with cross-consensus messaging (XCM) and cross-virtual machine (XVM) capabilities. Phala Network, another notable parachain, provides Turing-complete smart contracts with enhanced privacy and security through Trusted Execution Environments (TEEs) and Phat Contracts for off-chain computation.\n\nThe Substrate framework underpins Polkadot’s development, providing a modular toolkit for building blockchains and parachains. Substrate supports multiple programming languages, including Rust, Go, and C++, offering developers flexibility. Polkadot’s testnets, such as Kusama and Rococo, provide real-world environments for testing and optimizing smart contracts before deployment on the mainnet.\n\nSecurity in Polkadot is bolstered by its shared security model, where the relay chain ensures the collective security of all connected parachains. This shared security mechanism is critical for maintaining the integrity and trustworthiness of the network. Comprehensive security audits, both manual and automated, are integral to Polkadot’s approach, with tools and services from firms like ImmuneBytes and Hacken helping to identify and mitigate potential vulnerabilities.\n\nPolkadot’s use cases span various sectors, with DeFi being a prominent area. Projects like Acala Network offer DeFi products, including decentralized exchanges (DEXs), staking, and stablecoins, leveraging EVM and Substrate-based smart contracts. Phala Network’s privacy-preserving smart contracts enable secure DeFi applications, such as confidential trading and data management.\n\nCross-chain interoperability is a hallmark of Polkadot, supported by various bridge solutions that connect with external blockchains like Ethereum and Bitcoin. These bridges facilitate cross-chain asset transfers, expanding the reach and utility of the Polkadot ecosystem. Additionally, Polkadot supports gaming and non-fungible token (NFT) applications through parachains like Astar Network, providing a versatile platform for innovative gaming experiences and digital asset management.\n\nPolkadot’s architecture, combining the relay chain and parachains, creates a robust and scalable environment for developing Turing-complete smart contracts. Its support for multiple smart contract languages and environments and a strong emphasis on interoperability and security position Polkadot as a leading platform for the next generation of decentralized applications.\n\nCardano Smart Contracts\n\nCardano, a blockchain platform known for its research-driven approach, offers a unique environment for developing smart contracts. Unlike Ethereum, which relies on a single Turing-complete language, Cardano employs a dual-language approach to balance flexibility and security. This includes Plutus, a Turing-complete language, and Marlowe, a non-Turing-complete domain-specific language (DSL) tailored for financial contracts.\n\nBased on Haskell, Plutus allows developers to write complex and expressive smart contracts. Its features include higher-order functions, lazy evaluation, and immutable data structures, hallmarks of functional programming. Plutus contracts consist of on-chain code that runs on the Cardano blockchain and off-chain code that operates on the user’s machine, helping to manage computational resources efficiently. Using Haskell’s strong type system and formal verification capabilities ensures the correctness and security of smart contracts, reducing the risk of vulnerabilities.\n\nMarlowe, in contrast, is designed specifically for financial agreements and is non-Turing-complete. This design choice guarantees termination, meaning contracts will always complete their execution, avoiding issues like infinite loops. Marlowe’s simplicity and safety make it accessible to users without programming experience. It supports visual programming and traditional coding through the Marlowe Playground, a sandbox environment for developing, simulating, and testing contracts.\n\nSecurity is a critical focus for Cardano, with formal verification and thorough code audits emphasized to identify and fix vulnerabilities before deployment. The Extended Unspent Transaction Output (EUTxO) model used by Cardano ensures that transactions are deterministic and predictable, enhancing security by simplifying transaction validation and reducing the risk of unexpected outcomes. Additionally, Cardano treats tokens as native assets, simplifying token transactions and minimizing the risk of smart contract exploits.\n\nDeveloping smart contracts on Cardano requires familiarity with Haskell for Plutus and an understanding of Marlowe for financial contracts. Educational resources like the IOG Academy provide learning paths for developers and financial professionals. Tools like the Marlowe Playground and the Plutus development environment aid in simulating and testing contracts before deployment, ensuring they function as intended.\n\nCardano’s approach to scalability includes Hydra and Mithril, solutions designed to enhance throughput and reduce overhead. These technologies make the platform suitable for large-scale applications. Cardano’s proof-of-stake (PoS) consensus mechanism, Ouroboros, is energy-efficient and scalable, addressing the limitations of older blockchain networks.\n\nBy combining Turing-complete and non-Turing-complete languages, Cardano aims to offer a robust and secure environment for developing decentralized applications. Its emphasis on formal verification, security, and scalability positions it as a strong competitor in blockchain, capable of supporting a wide range of innovative and secure applications.\n\nSolana Smart Contracts\n\nSolana is engineered to support decentralized applications (DApps) and smart contracts with a focus on speed, scalability, and low transaction costs. The Solana Virtual Machine (SVM) plays a central role in achieving these goals by providing the execution environment for Solana’s smart contracts. Designed to handle high transaction throughput and low latency, the SVM ensures efficient processing, leveraging Turing completeness to enable any computation given sufficient resources.\n\nThe SVM’s Turing completeness allows developers to create complex and versatile smart contracts on the Solana blockchain. Solana’s unique architecture, including the Sealevel parallel execution engine, significantly enhances the network’s throughput and efficiency by processing multiple transactions simultaneously. This parallel execution capability is crucial for maintaining the high performance that distinguishes Solana from other blockchain platforms.\n\nSmart contract development on Solana primarily uses Rust and C, chosen for their performance and safety features, which are critical for developing secure and efficient contracts. The Anchor framework further simplifies this process by providing tools and libraries that streamline development and ensure best practices. To set up the development environment, developers install the Solana Command-Line Interface (CLI) and Rust, essential for deploying and managing smart contracts on the network.\n\nSolana’s Proof of History (PoH) consensus mechanism is a key innovation that timestamps transactions to create a verifiable order of events. This reduces the time required to reach consensus and enhances network speed and efficiency. Combined with other architectural innovations, PoH allows Solana to process over 50,000 transactions per second, making it one of the fastest blockchain platforms.\n\nUnlike traditional EVM-based blockchains, Solana’s smart contracts are stateless, meaning the contract logic is separated from the state, which is stored in external accounts. This separation enhances security and scalability by isolating the contract code from the data it interacts with. Solana’s account model allows for program reusability, enabling developers to create new tokens or applications by interacting with existing programs, reducing the need to redeploy smart contracts, and lowering costs.\n\nSecurity remains a priority in Solana’s ecosystem. Common vulnerabilities include account management errors, arithmetic errors, and potential reentrancy attacks. Comprehensive security audits, combining manual code reviews and automated testing tools, are employed to identify and mitigate these risks. The Solana community actively audits and secures smart contracts, fostering a collaborative environment focused on enhancing security.\n\nGaming applications on Solana benefit from its speed and scalability, allowing for fast and reliable transaction processing essential for immersive and interactive experiences. Additionally, Solana supports various Web3 projects, enabling decentralized social networks, content platforms, and other applications that leverage blockchain technology for enhanced security and user control.\n\nSolana’s unique approach to smart contracts, leveraging Turing completeness, stateless architecture, and innovative consensus mechanisms, positions it as a leading platform for decentralized applications. Its focus on speed, scalability, and low costs makes it an attractive choice for developers and users, driving its adoption and fostering a dynamic ecosystem.\n\nSmart Contract Conclusions\n\nIn conclusion, the diversity in approaches to Turing completeness and smart contract execution across platforms like Ethereum, ICP, Polkadot, Cardano, and Solana showcases the innovation within the blockchain ecosystem.\n\nEach platform offers unique strengths—whether it’s Ethereum’s extensive DApp ecosystem, ICP’s user-friendly model, Polkadot’s interoperability, Cardano’s focus on security, or Solana’s unmatched speed and scalability. These differences provide developers with a rich selection of tools and environments to build the next generation of decentralized applications, driving the evolution and adoption of blockchain technology across various industries.\n\nThere’s no ‘best’ blockchain for smart contracts – each has its benefits, and ultimately, network effects and adoption are what will showcase the strengths of each chain. A multichain future is now all but certain, with many blockchains serving different parts of the global economy.\n\nDisclaimer: CryptoSlate has received a grant from the Polkadot Foundation to produce content about the Polkadot ecosystem. While the Foundation supports our coverage, we maintain full editorial independence and control over the content we publish.\n\nMentioned in this article"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNM1ZlVzJBaUVyeC0wVVlMUFM0emFSX00tbk9zQXEtSHVDWmRoTkh4U2w5c0lwbENIZjFmaVVPaTgtNWhvS0Z1SnlweFNaaEx6Vk9rV2hWWnZJbnNxZWtDc1Rra3l0MVpjSUl2a09leDZGd1RUUUVHT0RLanJualNxd0RSTG9CU0lTeTlqWF93MVYtTHRMLUdJ0gGfAUFVX3lxTFBERjVUekY3ejl4c1RkTWRwUXRENXVoTlJENFBsQTRwUkQ1TUQ4WENKZVFOVm9yNnhLX0MzV2xmUDJpMUNMZWtJQVNabXd2MFFpLUVpa0RsOTg0bUk1NUFGMzZveUdzRG9kV2lucG9tTzlITTYyQmtCaHl4WnpPMUJPejI0eXhaMmJVR0k3M0VDQ0VjV3pxa1BXVDdVRHR5VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "ETF Approval Changes Everything, Says Ethereum Co-Founder Joe Lubin - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFew weeks in crypto’s short history have seen as much progress as this one. In Washington, D.C., a sudden confluence of bipartisan support aligned behind a crypto regulation bill on Wednesday, followed the next day by the stunning eleventh-hour approval of spot Ethereum ETFs by the U.S. Securities and Exchange Commission (SEC).\n\nTo Ethereum co-founder and Consensys CEO Joe Lubin, both events—particularly the SEC’s about-face on Ethereum—represent a seismic shift in how crypto is treated in America, and will be moving forward.\n\n“I think this is a game changer,” the entrepreneur told Decrypt in an exclusive interview.\n\nAD\n\nAD\n\nConsensys, the $7 billion Ethereum software company founded by Lubin, is currently ensnared in multiple legal battles with the SEC over crypto’s legal status. (Disclosure: Consensys is one of 22 investors in Decrypt.) But Lubin believes this week’s events may have proved that crypto has graduated to a higher status within the American power apparatus—upending the calculus for such battles.\n\n“My guess is that this is now an extremely important political issue,” he said. “And that overrides.”\n\n“If you want to get elected, you’re probably going to either need to have the blockchain decentralized protocol ecosystem on your side,” Lubin continued. “Or at least you don’t want them to hate you.”\n\nOn today’s SEC ruling: While Consensys welcomes today’s decision to approve ETH Spot ETFs as a step in the right direction, this seemingly last minute approval is yet another example of the SEC’s troublesome ad hoc approach to digital assets. No other industry, market, or… — Consensys (@Consensys) May 23, 2024\n\nAs Lubin sees it, the SEC’s decision to approve spot ETH ETFs was undeniably a last-minute political decision, potentially put in motion by a request—or demand—from the White House itself.\n\nAD\n\nAD\n\nThat political pressure, multiple crypto lobbyists in Washington previously told Decrypt, likely stemmed from a series of election-related developments last week.\n\nSEC leadership likely feels no different about crypto than it did a week ago—the silence from the agency has been deafening—but political pressures may have now thrown a wrench in its aggressive, ongoing legal crusade against top American crypto firms like Consensys.\n\nLubin isn’t letting down his guard just yet, however.\n\n“We have to stay vigilant,” he said. “We can't assume that we’re not going to be attacked again.”\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPUHN2MTJPbnIyUmxzUXRfNTVPY1pYdmtKMWI4d3FHNUNKb01jQUdTN2dlN2VOOERIelJuR2U2RGlKUndZYUlWcjc0eXp1M2s5RnlEWG9lcjRZSnRCMnAyVl9pNnV1X1U4UzVGZlBuOE96b1E3eE83b3RTSlR3aWdXUkRGSjc0MTRoRWZhTVhfdEIyTEJWOTFFRHdQdXJibmIyaGx1V0xpVThGUdIBrwFBVV95cUxQY3kzTHBSWi13a2JJanZoNy1NUUdCbnhHNGdHM25EZUY0ZXFQbFpnbUcwcEtNV1ZxaExSdkFDTGtnZVc3eS1YZVVCbDZmMk0ya18zT0tTOVpVMTVuMl8xdEJmRDc0MUxSd1dvcFhrdGJJY3ZhTmtxeDU2bDFLM1h0ZkhuVklaZjlwcFVVRHNqUzZvTmVRWDA1azJCNnhNVGI1cWVjSDlMSjlOeWo1YkM4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Bitcoin cracks US$70,000, Ethereum nears US$4,000; JENNER, PEPE and memecoins drive markets - Forkast News",
        "content": "Bitcoin broke US$70,000 on Monday as Ether inches closer to US$4,000 for the first time since March, according to CoinGecko data.\n\nThe market was still abuzz after the U.S. Securities and Exchange Commission’s (SEC) gave a tentative nod to spot Ethereum exchange-traded funds (ETFs) last week.\n\nBut memecoins stole the show on Monday, as media personality Caitlyn Jenner’s new cryptocurrency recorded over US$200 million in 24-hour trading volume since launching.\n\nThe embracement of the industry by a mainstream celebrity fueled a memecoin rally. It pushed Pepe by another 5.5% on Monday, adding to a seven-day 77% rally, CoinGecko data shows.\n\nJenner’s cryptocurrency launch has been riddled with controversies, causing market watchers to question the project’s legitimacy.\n\nSocial media users debated whether Jenner’s video confirmations were generated by artificial intelligence.\n\nIt appears that the project is backed by Jenner.\n\nSophia Hutchins, Jenner’s manager, joined an X Spaces talk session to confirm their involvement with the project.\n\nHowever, social media users have brought to light that the project may be linked to Sahil Arora, an alleged scammer best known for his activities on the Avalanche chain.\n\nArora, who is followed by Hutchins on Instagram, boasts his connections by frequently posting pictures taken with celebrities on social media.\n\nSo far, Jenner has not confirmed nor denied Arora’s involvement with the project, while Arora has reportedly claimed credit."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQelNlLThQY3ZIemtqckNPNk9YZl9iMkE1aDZIdjJYTHRGbVh4R0lYYkN5MXZ1TVFZb0E4ZGJNYlBKOGVkaFNQWWpkdGpmVWZYUWxIQmdkN1d1M1h4RkYybENZUFBNMkZZU1dqOHBwOEdBd1BITzdaS1VwMjZSQkZVWjNaRXlDMTBvbTFB0gGTAUFVX3lxTFB1OG1ldm1RRHY2N2Nzb0VnZnVzb1JOa0ZadEFVeHBCWl9pdkJkWkVfaXcxM3pWTUNaN2t6MnZLQWZJUzhXQWZkTHo5Z0NWY1lBYTktOVJidHVxMV8yVXZKclR0cFMyRXRhRUxxdmdVaVNIeFdNTmJja3NfbnJudFU5Mm1DUTRfQ25UME55RDNibFlnaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Chainlink Booms Amid Swift Payments Update, Ethereum ETF Rush - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWith U.S. financial markets on hold for Memorial Day, the long holiday weekend has meant a relatively quiet start to the week for most crypto markets—but one digital asset is booming: Chainlink (LINK).\n\nThe 14th biggest cryptocurrency by market cap, LINK is Monday's best performer out of the top 40 coins. CoinGecko data shows that it has risen more than 10% in the past day, and is now trading for $18.75.\n\nLINK is the native token of Chainlink, an oracle project built on Ethereum that's designed to get information in and out of a blockchain—and between chains—securely.\n\nThe surge is likely the result of LINK holders and supporters feeling bullish on the news dropping that Chainlink would be co-presenting with international payments platform Swift at this week's Consensys conference in Austin, Texas.\n\nAD\n\nAD\n\n15,000+ people from 100+ countries are attending @consensus2024. We are excited to be on the ground with multiple events and experiences, including a @SergeyNazarov keynote and a fireside chat with Swift. Plan your schedule around everything Chainlink ⬇️https://t.co/pmL1CgeoJZ pic.twitter.com/WwSqUJsg2H — Chainlink (@chainlink) May 27, 2024\n\nThe collaboration, which bore its first fruits last fall, is one that Chainlink has said proved that \"existing infrastructure can merge with the new world of blockchains.\"\n\nChainlink project co-founder Sergey Nazarov, meanwhile, also expressed broad optimism for Ethereum and all digital assets over the weekend, following the historic approval of Ethereum exchange-traded funds (ETFs), saying that it's “really just the beginning.”\n\n“Just like many systems and protocols initially list Bitcoin and ETH and then eventually list a multitude of other tokens, that is really the trajectory that we're on,” he said. \"It is a sign of a very clear trend that not only Bitcoin, not only ETH, but many other tokens out in the world will end up getting their own ETFs at some point, allowing the larger global capital markets to interact with that financial product.”\n\nAD\n\nAD\n\nChainlink has been on a roll lately, yesterday touting the progress its network has made across nine different blockchains, including Ethereum, Arbitrum, Polygon, and Base.\n\nEarlier this month, DTCC—the biggest settlement and clearinghouse in the U.S.—announced that it used Chainlink's cross-chain interoperability protocol with Wall Street giants JP Morgan and BNY Mellon as part of a tokenization pilot. That pilot, dubbed Smart NAV, allowed Wall Street institutions to make mutual fund data available on public networks.\n\nFinally, crypto investment firm 21Shares today featured Chainlink in its latest weekly research newsletter, saying it is “revolutionizing the realm of tokenization” and crediting it with enabling “over $10 trillion in transactions to more than 2000 projects over 22 separate networks.”\n\nThe collaboration between DTCC and @Chainlink is revolutionizing the realm of tokenization! With Smart NAV, fund data can be sent across any blockchain, empowering investors with quicker, dynamic, and historical data. Check out our Weekly Wrap for more:https://t.co/7FKo463sR5 pic.twitter.com/5mgBBgIPWR — 21Shares (@21Shares) May 27, 2024\n\nDespite the renewed interest in the Chainlink protocol, however, LINK still has a long way to go—a more than 64% climb—before it hits its historic 2021 all-time high of $52.70.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE1Ua2lTaWlway1XdHJuN2V0aDBrQWsyTFZYeHgtM3g5d1I0ckItbFRXSDlRcUJnYVZTQ2JDczA5dWNsSktqdWJHNTVhTGI2R0xxVWFUUndodW5KTUlhTEJZSm1hcjlIYzAtUV9ib1hVNNIBdEFVX3lxTE9fVXlyZUdGZ3JzODB3LVF5bzFJOE00dEhhZFktTk81b215SGM0RHJxY0ZWM25IdWxmTWd3MDdGNGtfazVDLTMtdmEzeXdmZjNnTWlFZ0cyUnJZeENTaW9QYUMtSFhsQ2Eya3ZlTGtTZVc5QXZN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 08:05:52 GMT",
        "title": "Bitcoin Evangelist Saylor Warms Up to Ethereum - U.Today",
        "content": "During a recent appearance on the \"What Bitcoin Did\" podcast, MicroStrategy co-founder Michael Saylor spoke positively about Ethereum exchange-traded funds, predicting that they will help accelerate institutional adoption.\n\nAdvertisement\n\nMainstream investors might be willing to allocate a higher percentage of their portfolios (from 5% to 10%) instead of just 1% now that view crypto as a broader asset class. Saylor is convinced that Bitcoin is going to account for up to 70% of that allocation as the leader of the crypto asset class.\n\n\"In fact, it might be better for Bitcoin because we are politically much more powerful…supported by the entire cryptocurrency industry…They obviously have a lot of political power, a lot of users, and they serve as another line of defense for Bitcoin,\" he said.\n\nAdvertisement\n\nIn a stunning U-turn, several 19b-4s listing requests filed by Ethereum ETF issuers were approved earlier this week. Just days before that, the U.S. Securities and Exchange Commission was predicted to reject them due to the lack of engagement, political pressure, and the uncertainty surrounding the legal status of the underlying Ether token.\n\nBloomberg ETF expert James Seyffart believes that Ethereum ETFs will be able to reach roughly 25% of the demand for the Bitcoin ETFs that went live in January. For now, it is unclear when these Ethereum ETFs will actually start trading since the SEC also has to approve corresponding S-1 registration statements.\n\nSaylor has now changed his tune after previously predicting that Ethereum would never be accepted by Wall Street since it is very \"clear\" that the flagship altcoin is a security. He claimed that Bitcoin was the only \"institutional grade crypto asset.\""
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNZFNmbnZvcjVlS0NURlQ0TERtUUx6aUF1SzhUYVljWWt2X1BxQ1hPZTVGN0lGNExLRm5XcDJGak1UYk5pVjgyYUduMlRXeEhCVVVqeGx6Q0lKY0NuNjVndnFCQU9PT2YtOTF3SklwRkpxRmRCTk04MnBnTUVPamcyZFJZeUFLZFRO0gGOAUFVX3lxTE9xWGg0WHQycWVSWGZMOUxVYTNZOXppbWw5R0xMVmpIMXRaNjFZNXRENHpLQVJyXzNCZWhQUFQ4WmMwUzQwZ1hicGlrREJpOXl0RDJ3REdkOUZsX1VrUlBPdnVnY0YwNlJyMS1oTFptMkNuWHVSX0huOTNPb0NOT2x6WnRZVERPeHpPMmdXN2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Michael Saylor Says Ethereum ETF Is Good for Bitcoin, Here's Reason - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nMichael Saylor, the Bitcoin bull chairman of MicroStrategy Inc, has unexpectedly made a bullish statement regarding spot Ethereum ETFs. Eight spot Ethereum ETF applications were greenlit by the United States Securities and Exchange Commission (SEC) last week.\n\nAdvertisement\n\nFrom criticism to growing supporter\n\nEarlier in May, Michael Saylor expressed strong criticism of Ethereum and other cryptocurrencies below the \"Bitcoin stack.\" According to Michael Saylor, these digital currencies are investment contracts, adding that assets like Ethereum will never be wrapped in spot Ethereum ETFs.\n\nThree weeks after he made this statement, spot Ethereum ETFs were approved by the U.S. SEC; however, trading is yet to commence. In a recent interview with Beagle, the host of \"What Bitcoin Did,\" Saylor said Ethereum ETFs and any other product tracking most crypto is not bad after all.\n\nIn his interview post Ethereum ETF approval, Michael Saylor completely reframes his narrative to say that the Ethereum ETF approval is a GOOD thing for Bitcoin because it makes the entire asset class bigger and thus more money can flow into Bitcoin. 😂 pic.twitter.com/TxSduvRp9C — Autism Capital 🧩 (@AutismCapital) May 26, 2024\n\nHe said that with other related products, more investors will make their way into the broader crypto market. According to him, this will help validate Bitcoin as the dominant asset in the industry.\n\nMichael Saylor earned a lot of criticism for his earlier statement, with the likes of Charles Hoskinson slamming him for what he perceived as an unhealthy view of the industry. Already, the change in stance is being called out, seeing the failed prediction that has already come to pass.\n\nPlace of Spot Ethereum ETF\n\nThe process leading up to the spot Ethereum ETF approval brought with it a lot of speculation. Now that the approval has been secured, there is still the unspoken question of whether Ethereum is a security or not.\n\nMichael Saylor has remained a major backer of Bitcoin since August 2020 with a consistent accumulation to date. While it remains uncertain whether he would be betting on Ethereum, the industry seeks to see how Wall Street accepts the new ETF, which is yet to start trading."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPOUlfcE9VSE1Gd1ItbndabGltazNONktzcXJzWjZydy1BWmROV2JBLVNtdURFLW1TbEtuQmEzTEJOS0I4bUNUX1laU2FyRnB3WVQwSTQwMXBRMkV6bndUUmlGU19nTFhkX3JOeUIybzB2STY3ZER0TmNOdGdhZk5zYnV2bHpWeUNDTFJGcl9yQUQzZzVqZWUxdXNaSkZRSUx5RWFKOE9mcmlqVmFBX0Qtc1FhdUp2aTBXSGtWa1pkY2hkSlY2YkpsS2liQVFTNWNKSU5ycUVxazdUM3FJ0gHiAUFVX3lxTE1iMzhwV1poMy1oOGFrbTdrWXAxSWp6dG1ORUhwcHFPRmFUWWwzZzF4bXZDRXkzZHVGUGc3MHNiRzRnMVR2N0U5eVVoRjFrellPWFFQNF9VdTJCLU1aU1Q0NDdnTTM5Z19XWkdKSDZZY2pDdnBXb0d2WGxISjZ3LU1fSk1OaGUzbTVQOGtYNmFqazdEbkpodlEzcS1ra0prWVdGWUxZRGhfLVlOYlpKbHZGX0VMSTdyVmRVSnR1YTJJQWNGcnIwRnVVTUQ2d3FkQW1TOThkQkE2RTh3MmJYYnlHTWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Top Trader Predicts Ethereum Will Massively Outperform Bitcoin, Says One ‘Golden Child’ Memecoin Set To Go Higher - The Daily Hodl",
        "content": "A widely followed trader says that Ethereum (ETH) is about to vastly outrun Bitcoin (BTC) and is predicting one memecoin will rally hard.\n\nPseudonymous trader Bluntz tells his 259,000 followers on the social media platform X that he’s got his eye on the two-week chart of the Ethereum versus Bitcoin (ETH/BTC) pair.\n\nThe trader says that ETH/BTC is just days away from printing a rare bullish divergence, hinting at an outperformance of Ethereum over Bitcoin. A bullish divergence may indicate reversal areas amid rising momentum even though the price moves down or sideways.\n\nBluntz targets the 0.1 BTC level ($6,907), which is nearly 95% above current levels of ETH/BTC.\n\n“Only eight days to go until ETH/BTC prints the first two-week bullish divergence since *checks notes*…. never.\n\n0.1 [BTC] is obviously the target but we either undershoot or overshoot the f..k out of that.”\n\nOutside of Ethereum, Bluntz is also bullish on the frog-themed memecoin Pepe (PEPE) – which he says is the best-looking major coin of its sector.\n\nHe says Pepe will be the “golden child” of memecoins while ETH/BTC bottoms out and regains traction.\n\n“Look like PEPE was the best-looking meme of the majors after all.\n\nWith ETH/BTC likely bottomed (in my opinion), I think it will continue to be the golden child meme moving forward and likely goes higher than many are expecting possible but at the end of the day we’re all speculating here.”\n\nAt time of writing, PEPE is worth $0.000015.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Swill Klitch"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQeVBpYkh4T1pJaVl1ckljTkE3VTFNdk9RSGJHd1I3RjYzME5Mc3lZMFhjNDdqdHBKZHg2dlkzbGdBVnpZaHNzeGRjLTdQX3NjdTZXQ0NkSjM5UFh1V3FSZEhqc01RSjV4STkzaEZndHhRN1dDTXh0U0ptT2hEWVZZYTZ3UVU3cHo1dDJNYVdsQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ultimate Investment Guide: Furrever Token Set to Achieve Bitcoin and Ethereum-Level ROI in 2024 - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, May 26, 2024 (GLOBE NEWSWIRE) --\n\nBitcoin (BTC) has fallen below $68,000, trading at $67,183 with a 3% decrease in the last 24 hours, raising concerns of a potential downtrend. Meanwhile, Ethereum (ETH) remains stagnant at $3,800 despite the approval of eight spot Ethereum ETFs, showing no significant uptrend. On the other hand, Furrever Token (FURR) captivates investors with its promising presale, nearing $1.1 million raised, and potential for a 1500% increase in value post-launch.\n\nBTC Falls Below $68,000 – Will the Decline Persist?\n\nInvestors and traders are especially showing new interest to Bitcoin strategies now that its current position and price fluctuations are driving this new found wave. Bitcoin which was trading at $/$67,183 began to decrease by 3. 3% in the last 24 hours, has a transaction volume of 36$, a monthly volatility of 4%, a monthly average price of 350$ and a Year to date return of 19%. 7 billion.\n\nAnalyzing the global market, it is possible to say playing a Capstone project budget of $1. 2.3 Q It is worth mentioning that bitcoin remains the most valuable coin in the market of cryptocurrencies with the worth of more than 3 trillion. Bitcoin (BTC/USD) is down 3% to 67,183 from its price earlier today. While analyzing the overall price fluctuations of this token, users are going to observe that in the last 24 hours 3% price swing indicates a bearish trend. Yet, these figures $68,263, especially emphasizing the pivot point belong to the direction of the current increase trend.\n\nThe 50-day Exponential Moving Average (EMA) is located at $68,615, which forms a resistance level near the pivot point. Technically, Bitcoin is trading below the pivot point, indicating a potential downtrend. As an entry strategy, selling below $68,263, targeting a take profit level of $66,357 and setting the stop loss at $70,029 could be recommended. This strategy can enable investors to take advantage of possible further declines while managing risk.\n\nHow Did Ethereum Price React After Approval: Has the Expected Rise Come?\n\nFollowing the approval of eight spot Ethereum ETFs by the SEC last night, ETH price remained stagnant at $3,800 and showed no signs of a significant uptrend. Despite this, ETH experienced a significant increase of over 30% last week. Investors are currently taking a cautious stance and are watching to see if this development will result in a “news sell” event.\n\nAhead of the US SEC announcing its Ethereum ETF approval decision, ETH price witnessed some sharp fluctuations. In the tense hours before official approval, ETH initially fell to $3,500 during the traditional US market close. It later approached $3,900 after initial unconfirmed reports emerged pointing to confirmation, and ultimately settled above $3,800 after confirmation. In the midst of these huge price swings, it turned out that a whale made a staggering sale of 7,900 ETH worth $29 million.\n\nStory continues\n\nDuring the turbulent period, liquidation of leveraged crypto derivatives positions reached over $350 million throughout the day, the highest figure since May 1, according to CoinGlass data. The majority of these liquidated positions were long positions anticipating price increases and totaled approximately $250 million. This shows that traders who had overextended themselves with leverage were surprised by the sudden price drop. Among those affected, ETH traders bore the brunt, with $132 million in liquidations.\n\nApproval of spot Ethereum ETFs could bring inflows of more than $500 million, as analysts estimate. However, it may take some time for this to happen and the uptrend to begin. Some on-chain indicators suggest that Ethereum could form a base above $4,000 and continue to rise to $5,000-6,000 by August this year. While the approval of Bitcoin ETFs has led to strong institutional inflows, it will be interesting to see whether the ETH ETF launch will lead to greater institutional adoption.\n\n\n\n\n\nFurrever Token: The Upcoming Game-Changer in Meme Coins\n\nFurrever Token is poised to capitalize on the growing interest in meme coins with its charming cat-themed imagery. Currently in the final phase of its presale, the token has already raised over $1.1 million, aiming to reach $1.9 million before its official launch on PancakeSwap. The potential for a 1500% increase in value post-launch positions Furrever Token as a highly attractive investment. Early presale participants, with tokens priced at $0.000648, stand to benefit significantly from this anticipated growth.\n\nFurrever Token's engaging approach, featuring cat-themed stickers, visuals, and community challenges, promotes a vibrant community. Additionally, the project's commitment to security and transparency, evidenced by its audited smart contract and a one-year lock on team tokens, reassures investors about its long-term prospects. With nearly 4,000 active members in its Telegram channel, Furrever Token demonstrates robust community support and engagement.\n\nAs the presale concludes, now is an opportune time for investors to get involved with the Furrever Token community and potentially secure significant returns.\n\nVisit furrevertoken.com to secure your tokens and join this exciting venture. Investors interested in this opportunity are advised to contact only the official support at support@furrevertoken.com to avoid potential scams.\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nJoin $20,000 Furrever Token Giveaway\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOZW00TFR3Tk92VDZRY0ZfWEU1bmpDU2F4UG9HS1R6Z0Z3QS10MDdDWHJBUThXeU14cUtDVWJUYVA3VHkwdGxsblNHUngxQWF0VndLM1BKZU12NVhkSnpmdGI2YUl4MEg1eTlsc09WSUFHajY3T2lhSWFwR1RfcVNrbVhrY191UUJBOVpiSUtxMDJZWXNkTERB0gGcAUFVX3lxTFBtUXNsbTQtdkdKZ1gtVnR3Rl9ZaG1hQnJhQ0x6R0k5VTdhcnRza19LWVprc3g0c19meVVFZWlDVVRMWW9yWE5TaU5zOG1DVk9GY0tTMzhLSkZsaGlMa3doSDhJazJxNGJwV2Nmd1I0N2JGaTBVTzJORWpiV1FwLUpNazJkSlVGUWw0NGEtVVMtS1BuM01VYnhCQm5taQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Bullish Outlook: Could We See New All-Time High? - CoinGape",
        "content": "After a 25% hike the previous week, the Ethereum price surged to the month-high of $3937 just hours ago. The second biggest cryptocurrency, Ethereum, is bullish, with constant gains, pushing its market cap to $467.8 Billion. Moreover, the number of transactions and network activity has surged by multiple folds, bringing the trading volume to $17.8 Billion after 65% gains. However, this is just the beginning for ETH price as the various analyses and predictions talk of the price surpassing any previous record.\n\nadvertisement\n\nThe effect of Ethereum’s bullish outlook isn’t limited to itself only, as the entire crypto ecosystem is affected positively. The total value locked (TVL) in the decentralized finance (DeFi) has surged to $117 Billion, a new two-year high record. More importantly, 60% of the locked value is of Ethereum. Moreover, the Ethereum layer2 blockchains are also in its highest TVL zone, which comes to around $47 Billion.\n\nSo, what’s backing this price rally, and how high Ethereum price can go after this? Let us discuss that in this blog.\n\nFactors Backing The Ethereum Price Surge\n\nEthereum’s price began to rise right after the Bloomsberg analyst predicted Ethereum ETF approval, and then once they got approved, the price went crazy. Even without the beginning of the ETH ETF transaction, the hype has surfed to the roof. The hype is understandable by Kavita Gupta, the Delta Blockchain Fund General Partner, denoting Ethereum as Digital Oil. This statement comes after an interviewer asked Kavita what Bitcoin is called Digital Gold and what’s Ethereum for her.\n\nEthereum ETF approval is much bigger than Bitcoin ETF as Ethereum is not just cryptocurrency, it is the creator in the crypto industry, which will boost the Ethereum ETF higher than Bitcoin’s. Many analysts have claimed Ethereum might surge above $11K by the year’s end and even higher the next, solely because of the Ethereum ETF popularity.\n\nCan Ethereum Surge To An ATH?\n\nEthereum’s hype has directly hinted at its rally to the ATH target of $4,891.70. Confirming the same, Arthur Cheong, the CEO of Defiance Capital, has predicted the ETH price to hit $4500 before the trading goes live for the Ethereum ETF.\n\n4.5k before spot ETF go live for trading imo. — Arthur (@Arthur_0x) May 26, 2024\n\nAs the trading volume is the favorable factor for the price surge along with many other bullish indicators, ETH price might hit a new ATH soon. However, if Ethereum fails to break the resistance between $3900 & $4000, the price can decline. Regardless, the analytics for now talk of Ethereum price to hit $4500 before finding its way to $4891.70 and higher.\n\nNot only this, it is clear that Ethereum follows the price trajectory of Bitcoin. Based on that Ethereum may rise as high as $6000 in the next two months, just the way Bitcoin did. Moreover, the top crypto personalities are looking forward to Michael Saylor, the MicroStrategy founder, investing in Ethereum next. It will be another milestone, as Microstrategy boosts the Bitcoin price, and the same might happen for Ethereum.\n\nContinue Reading 4 Top Altcoins To Rally This Week\n\nPooja Khardia With a deep-seated passion for reading and five years of experience in content writing, Pooja is now focused on crafting trending content about cryptocurrency market. As a dedicated crypto journalist, Pooja is constantly seeking out trending topics and informative statistics to create compelling pieces for crypto enthusiasts. Staying abreast of the latest trends and advancements in the field is an integral part of her daily routine, fueling a commitment to delivering timely and insightful coverage\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQRlZnU0xOZnY3UnRXM2xRMG5vODlXemMxRHptRU9Va2ljTVlhaHdMdFc0VnVreGhCdGFQNGs1RTBHaEQxRjZ5MTRhTDhuUnRyd01fbU91X05IOFV3c3hBTWNoOG9WVjEwb1dTUGVHTWRucjZYRk9BM1liZzgtbFlLOF9mWDgtdjlJQkJwRmdhY3BlZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "3 cryptos à surveiller après l'approbation des ETFs Ethereum ! - Cointribune EN",
        "content": "Mon 27 May 2024 ▪ 6 min read ▪ by Luc Jose A.\n\nThe recent approval of Ethereum ETFs by the United States Securities and Exchange Commission (SEC) paves the way for broader institutional adoption and increased exposure of digital assets to traditional investors. Since the successful introduction of Bitcoin ETFs earlier this year, eyes have been on Ethereum, the second-largest crypto by market capitalization. Now that Ethereum ETFs have received the green light, the market is buzzing, anticipating a new wave of massive investments. This new investment opportunity could transform market dynamics and provide significant benefits not only to Ethereum but also to several other cryptos closely linked to its ecosystem. In this article, we will explore the three cryptos best positioned to benefit from this approval of Ethereum ETFs.\n\nEthereum (ETH)\n\nEthereum, the second-largest crypto by market capitalization, has already seen a dramatic rise since the beginning of the year and even in recent days. Currently, the price of ETH is around USD 3,801.94, with a market capitalization of nearly 456 billion dollars and a 24-hour trading volume exceeding 10 billion dollars. Despite this impressive growth, the recent approval of Ethereum ETFs by the SEC opens the door to an even more significant increase in Ethereum’s value.\n\nThe approval of ETFs means that institutional investors, who were previously hesitant to enter the crypto market due to its complexity and perceived risks, can now invest in Ethereum through traditional and regulated financial channels. This will significantly increase the potential demand for ETH. The legitimacy brought by SEC approval will enhance investor confidence in Ethereum, thereby stimulating interest and purchase of ETH.\n\nThe influx of new capital into Ethereum through ETFs will also improve market liquidity. Better liquidity means that transactions can be executed more quickly and with less volatility, which is attractive to large investors. This increase in liquidity can stabilize Ethereum’s price in the short term while creating a solid foundation for continued growth.\n\nPolygon (MATIC)\n\nPolygon is a layer 2 scaling solution for Ethereum. Currently, the price of the Polygon crypto is around USD 0.7225 with a market capitalization of 7.15 billion dollars and a 24-hour trading volume of nearly 175 million dollars. Polygon has already demonstrated notable growth as a scaling platform, attracting the attention of blockchain developers and users.\n\nThe recent approval of Ethereum ETFs by the SEC has the potential to catalyze a new wave of adoption and use of Ethereum. As demand for Ethereum increases, scaling solutions become crucial to manage the growing volume of transactions on the network. Polygon, as the main layer 2 solution for Ethereum, is particularly well-positioned to benefit from this dynamic.\n\nPolygon improves Ethereum’s scalability by enabling faster and cheaper transactions, which is essential to maintaining the Ethereum network’s efficiency in the face of growing demand. With the expected influx of capital following ETF approval, Ethereum users will seek ways to reduce transaction costs and improve transaction speed, thereby increasing demand for Polygon.\n\nMoreover, Polygon benefits from its compatibility with the Ethereum blockchain, allowing developers to easily deploy decentralized applications (dApps) and DeFi projects on its platform. This compatibility already attracts a multitude of projects, and the increased interest in Ethereum due to ETFs could strengthen this trend, attracting even more developers and users to Polygon.\n\nUniswap (UNI)\n\nUniswap, the leading decentralized trading platform (DEX) on Ethereum, plays a crucial role in the DeFi ecosystem by allowing users to trade cryptos directly without going through a centralized exchange. Currently, the price of its crypto UNI is USD 11.40, with a market capitalization of 6.83 billion dollars and a 24-hour trading volume of nearly 473 million dollars.\n\nWith the recent approval of Ethereum ETFs by the SEC, Uniswap is in an advantageous position to benefit from the influx of capital and increased interest in Ethereum. ETFs make buying Ethereum more accessible to institutional investors, which should increase demand for ETH. This increase in demand will also lead to an increase in transactions on Ethereum, which directly benefits decentralized trading platforms like Uniswap.\n\nAs the most popular decentralized trading platform, Uniswap is likely to see a significant increase in trading volumes. The higher the trading volumes, the better the liquidity on Uniswap, making trades more efficient and attractive to investors. This could lead to an increase in the value of the UNI crypto, used for governance and liquidity rewards on the platform.\n\nWith the approval of Ethereum ETFs, Ethereum, Polygon, and Uniswap are three cryptos particularly well-positioned to benefit from this influx of capital and increased interest in the Ethereum ecosystem. However, the crypto market is extremely volatile, and prices can fluctuate unpredictably. Nothing is very certain!\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxOcHh4TzYtS2dnQTF5MkF6bnpTUDZGa2VDTGt2c01ETnJ5SEJ0NHlRUmU5N0dicWg5bVE5WHIzWDE3MHFSbDZfZzBLMG8zQVl2M1FfSzFkcHJFR3NHeElrRVdncTQyTHdUajAzb3lyQUQ3YUJmWnN0VlhWSWU5NFZuZERjcUdJX3dLOHRETFhKQkh2eVlZVldxQ0hTYnZyMHBvSnJCRjRxMVRiaURHRTBNMGFVU1c1S1FDSE5TZjNqM3M2c1FRVDZSdkZmRW1Yakh6VXZVZVYzdTRieGVtbWkyNnFWdnhMQdIB6wFBVV95cUxQY1BQNVBfNVFMay1hQXk2RGN4alBGSGlXZkxSODFhbGxUUnVucUhUeVF2M1ZKcVRFVmJPUWI5Y1dLdmduQ2V1X21xZ0Z3X0QxSFd3cVB5clZVcW5mdTdjSG94Q21QcGlQbUVjTVpudkNFQTZUVUx3WFctQUF1OUNVSWNrYTlyS281RUdDMGhhZU5aYXplclpBYVdCQnBXbDNvSlZvSHpLYkhrTndmNHBZMGlFMXdMejNtV1ZSNlBSQlluYTQ0bXFWX2hUNzZDb20tQ1NZcU1PQWxSb3NaTDNHU3NfRmcwOWFtYkRz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "MicroStrategy's Michael Saylor sees Ethereum ETFs as an open door for broader crypto adoption - Forbes India",
        "content": "\n\n\n\nMicroStrategy's Chair, Michael Saylor, views the SEC's approval of a spot Ethereum ETF as a positive development for Bitcoin. He anticipates this move will draw more institutional investors into the crypto market.\n\n\n\nIn early May, Saylor expressed concerns about the SEC potentially taking action against significant alternative crypto assets (altcoins). This raised worries within the crypto community that the SEC might classify Ethereum ETF and other altcoins as securities, leading to stricter regulations and potential limitations on trading these assets.\n\n\n\nIn a surprising turn of events, the SEC's approval of all spot Ethereum ETFs differed from earlier expectations. Michael Saylor has adjusted his previous stance and now welcomes the SEC's decision.\n\n\n\nFollowing the SEC's approval of several spot Ethereum ETFs in late May, Saylor expressed his belief that this development could be even more beneficial for Bitcoin. He suggested that the broader recognition of crypto as an asset class, facilitated by the ETFs, would strengthen Bitcoin's position within the industry due to its established presence. He further indicated that these ETFs might act as a stabilising factor for Bitcoin in the regulatory landscape.\n\n\n\nSaylor further emphasised that the SEC's decision could accelerate institutional investors' adoption of crypto assets. This could lead to a potential allocation of 5-10% of their investment portfolios towards cryptocurrencies. Within this allocation, he projects Bitcoin to capture a significant share, potentially around 60-70 percent, due to its established position in the market. He explained this by suggesting that previously hesitant investors might now view crypto as a legitimate asset class due to the existence of ETFs. Saylor anticipated that these investors would likely diversify their crypto assets holdings. Still, Bitcoin, as the established leader in the space, would likely receive the largest share of their crypto assets allocations.\n\n\n\nSaylor elaborated that just two weeks prior to the SEC's decision, the expectation was that Bitcoin would be the sole cryptocurrency offered as a security through a spot ETF by Wall Street institutions, effectively solidifying its position as the only legitimate crypto asset class.\n\n\n\nShashank is the founder of yMedia. He ventured into crypto in 2013 and is an ETH maximalist.\n\nTwitter: @bhardwajshash\n\n\n\n\n\n"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPYngzeWNLX3ljODdYUHlXa3F5a0hiOFBDWVhIWTdYaDA5a3ZzWFpTNUY1dmJQSFFubGROOWJoQ3ZybzdyTDBsd2NlM2dpSkRncnZlaDFwZHpUekZhUGhYR2g3NkFUWmsxMDl0aGpJOGd5Rl83NWJSNlJPRVpyZmNRVzhJQi1jYjRFRnVvcHdEQlFCY0ZtM3hmWmVBT1NyRk95RmM2VFJyQ3VwQ2hERngtM0xwZGQ1MW9ack5TWWJhMzFRb3VKbzZNQXBjV0pwWFQ3dHZlQkI1THYtOUNJWkhpU0xXSjJkemR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approved, Elon Musk Mourns Kabosu's Death, Trump Embraces Crypto Donations And More: Top Cryptocurrency Updates - Benzinga",
        "content": "The week in the world of cryptocurrencies was nothing short of eventful. From the SEC’s approval of Ethereum ETFs to Elon Musk‘s tribute to the Shiba Inu behind Dogecoin, the crypto market was abuzz with activity. Here’s a quick recap of the top stories that shaped the crypto landscape over the weekend.\n\nSEC Greenlights Ethereum ETFs\n\nIn a move that could potentially attract mainstream investors to the crypto market, the Securities and Exchange Commission (SEC) has given its approval for spot Ethereum ETH/USD ETFs. This decision marks a significant step forward in the integration of cryptocurrencies into the traditional financial system. Read the full article here.\n\nTop Trader Swaps Bitcoin for Altcoins\n\nA prominent trader has decided to ditch Bitcoin BTC/USD in favor of altcoins, citing the potential breakout of ‘Dogecoin Killer’ Shiba Inu as one of the reasons. This shift in preference underscores the growing interest in altcoins among traders. Read the full article here.\n\nSee Also: Was Cathie Wood Right About Crypto As An Issue In 2024 White House Race? ‘You Can’t Be On The Wrong Side\n\nElon Musk Pays Tribute to Kabosu\n\nTech mogul Elon Musk paid tribute to Kabosu, the Shiba Inu that inspired his favorite cryptocurrency, Dogecoin DOGE/USD. Musk’s tribute has sparked reactions from the crypto community, further highlighting the cultural impact of cryptocurrencies. Read the full article here.\n\nTrump Embraces Crypto Donations\n\nFormer President Donald Trump has announced that he will be accepting cryptocurrency donations in Bitcoin, Ethereum, Shiba Inu SHIB/USD, Dogecoin, and more. This move signals the growing acceptance of cryptocurrencies in political fundraising. Read the full article here.\n\nMichael Saylor’s BTC Price Forecast\n\nMichael Saylor, CEO of MicroStrategy Inc., has stated that the price of Bitcoin is still less than $0.08M, suggesting that the leading cryptocurrency is on the verge of reaching a new all-time high. Read the full article here.\n\nRead Next: Bitcoin, Ethereum, Dogecoin On A Knife’s Edge As ETF Decision Looms: ‘Weak Weak Weak’ Market, Says Trader\n\nPhoto via Shutterstock\n\nThis story was generated using Benzinga Neuro and edited by Navdeep Yadav."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNdXRoUjVLb1otcXpGRnZIbnI4Mm1DOHlWSWhTb3ZydHROem9Qa1FZWS1KZm00T3NVRE1VNEpFcHdBWm4zZVI5NW1nc2tRTGo3MlhoVXVmNGpSSl9pLXM0cjlKbEgwNjhWbW9KMGlINW1GWV9iTWh5T2ZJWm9VZlpTb3ZoNklmamRoX01zYUFLZGRobkdQemZEUtIBngFBVV95cUxQc3RLajlQU29QOW9sRTV0WmpXM2tiR3JZMDh4SWtIc0ZfTnk1Z1g5OGhYdjhrNDFzMXdGbUdEbUxTaDZBUU1DY0V4d25NOWQtMXZlTmFjcEczUHhLaERJNmFoQ09hVjNLWGM5NDJKQlZQVl91bzBWSUprMVUzUHQySWxuUFcwNVpmWGU4Qll6Q2xoU3F0VUtKSnprQzRDUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Surges 5% Moving Closer to $4,000, New All-Time High Soon? - CoinGape",
        "content": "Ahead of the imminent launch of spot Ether ETFs within the next two months, Ethereum bulls are reasserting their dominance. Over the past 24 hours, the Ethereum (ETH) price has surged by 5%, reaching $3,957, accompanied by a market cap of $469 billion. Additionally, Ethereum’s daily trading volumes have witnessed a remarkable increase, soaring by 68% to nearly $17 billion.\n\nEthereum (ETH) Price Eyes Breakout Above $4,000\n\nRekt Capital, a prominent crypto analyst, stated that Ethereum (ETH) requires a weekly close above $3956 to move into the $4000+ range. Currently, ETH is forming a lower high, but it has spent significant time around the $2791 level, historically a precursor to an upside movement back to approximately $4000.\n\nadvertisement\n\nRekt Capital emphasized that a weekly close above the orange box level is inevitable and will confirm that the bulls have regained momentum. The analyst’s observations highlight the critical thresholds ETH must surpass to continue its bullish trajectory.\n\nSoon after the news of the spot Ether ETF last week, the ETH price consolidated for a while before resuming the recent uptrend. On the weekly chart, Ethereum poses a healthy 27% gain suggesting a solid uptrend going ahead.\n\nETH Price to Reach $4,500 Before ETF Goes Live\n\nArthur, the founder of DeFiance Capital, predicts that Ethereum (ETH) will reach $4,500 before the commencement of spot ETH ETF trading. Supporting this optimistic outlook, a survey by WuBlockchain within the Chinese community reveals that 58% of respondents believe ETH can surge to $10,000 or more in the current market cycle.\n\n4.5k before spot ETF go live for trading imo. — Arthur (@Arthur_0x) May 26, 2024\n\nCrypto investors widely anticipate significant institutional demand for Ethereum (ETH) in the coming weeks. In anticipation of this influx, large Ethereum investors have been making substantial purchases since the ETF approval announcement.\n\nA Santiment chart reveals real-time changes in the balances of ETH coins held by the top 1,000 largest wallets. On May 19, these top investors collectively held 76.01 million ETH. Following the news from Bloomberg analysts on May 20 about the SEC’s impending approval of ETH ETFs, these “whales” increased their buying activity. As of May 26, the top 1,000 Ethereum wallets now hold 76.52 million ETH, indicating an acquisition of 510,000 ETH in just five days.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNalVJbG9JOVo4UjJ5WnhjaG5hcjRYaENHU2Q2bTlXU0FaMl9ZNmEwLUpOWEdfbWh5MW5wakNYblhDQnZrLWxrZXlrblBTYzFTOEM4Rk5vcGFiUlV4NUt3ZGtmVFR4ZDVEYkRvcHFkUHQ1cGk0NmxHRmZRR21vLWhqdlVXRGk0MVhwZ1dSVzlsaU_SAZYBQVVfeXFMTmRsOE5mb3JNM2d6MGprZEJORGlUbG9MQ2FubUNvdE9DT3hNNVVra2ZScFBuNmRSXzQzSFlrZUwzaThmY2FuNG5QRVRNRTZYeTZDTDdlZXVHM1VRcXhIbi1sODJfalIzS1lqU2ZDYXFyWUFTdnlEZW8tdGYyQ2NsZGxLUWZ0Y09JSzBIYVg0QVdLbGV4bWN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Michael Saylor: Ethereum ETFs ‘may be better for Bitcoin,’ here’s why - AMBCrypto News",
        "content": "Michael Saylor makes a U-turn on ETH after ETF approvals.\n\nThe executive said that the approval will further legitimize crypto assets.\n\nMicroStrategy founder and CEO Michael Saylor has changed his ‘no second best to Bitcoin’ rhetoric after the Ethereum ETF’s approval.\n\nCommenting on the approvals, Saylor underscored the update as ‘good for crypto asset class’ but ‘better’ for Bitcoin [BTC].\n\n‘Is this good for Bitcoin or not? It’s good for Bitcoin. In fact, it may be better for Bitcoin because we’re politically much more powerful, supported by the entire crypto industry.’\n\nThe ‘politically more powerful’ phrase may refer to the current political changes triggered by crypto regulations, the passage of the US CBDC ban, and the FIT21 Act.\n\nMichael Saylor added that the ETH ETF approval will further legitimize the crypto asset class.\n\nMichael Saylor warm ups to ETH\n\nContrary to the above relative warm-up to ETH ETF approval, Saylor has always been a Bitcoin maxi and a critic of altcoins.\n\nAbout two weeks ago, the executive believed that Bitcoin would be the only approved crypto asset with a spot ETF and backing of Wall Street and TradFi.\n\nThe executive expected the SEC to reject the ETH ETFs. Here, it can be argued that Saylor changed his strict stance against other crypto assets after the ETH ETF approvals.\n\nHowever, his emphasis that BTC could benefit more from the ETH ETF adds to the divergent views on the topic.\n\nSome industry analysts, like Jim Bianco and Quinn Thompson, have reiterated that ETH ETF could draw inflows from spot BTC ETFs.\n\nAs a result, the ETH ETF launch could be negative to BTC. In fact, Bianco projected that ETH could even flip BTC before the next halving.\n\nHowever, Bitwise CIO Matt Hougan downplayed the ‘threat’ and mentioned that ETH ETF will hit billions but won’t match BTC.\n\nIn the meantime, the recent positive regulatory relief and ETH ETF approvals saw BTC ETFs record positive net inflows last week.\n\nAccording to AMBCrypto’s look at Soso Value’s data, the investment products saw a total of $819.5 million last week.\n\nIt remains to be seen whether these BTC ETF flows will be affected by ETH ETFs when they launch and start trading."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxQeTNLdFd5OUdGTnpSSlYtZE9kcTN1RDRaU3laaVpFZXd1ZTdqTmo3dTVWNWtmNWNoVldmMlQ2cGJsLTZHYWtMbDdmWGxSM05JZ1RsUXJYOWVmVy1pZHZLb25OZzFiRl9HYy1BQjRQeVJFVkFPT3JmOHJKbC03VmJ0TkxhSDVoODRlSHpUMnJuSExWSE5WMWV4N3U3V2RsWFROcUh4TS1kT01SU290Ymt6eWhLQWl5REJQT1R1YzJ2NUZmalV0NnplM1NFQjBXWTBoMlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Analysis and forecasts of the price of Bitcoin and Ethereum: the king in the presence of the queen - The Cryptonomist",
        "content": "Let’s see in this article how the top 2 cryptocurrencies in the market, Bitcoin and Ethereum, are moving, and their price predictions.\n\nSembra che in questa fase sia Ethereum la vera protagonista delle borse crittografiche, con l’attenzione degli investitori che è canalizzata attorno alla questione ETF spot ETH, mentre Bitcoin segue i rialzi della regina.\n\nWhat are the short and medium-term forecasts? Are we about to attack new historical highs in both assets?\n\nAll the details below.\n\nAnalysis and forecasts of the crypto market price: Bitcoin supported by the news of Ethereum ETFs\n\nOn this Monday, May 27th, Bitcoin records a price of 68,500 dollars, slightly down by 1% compared to the last 24 hours but up by about 9% in the last 30 days.\n\nThe king of the crypto market has managed to bounce back very well from the recent retracement, thanks especially to the news that involved the issue of Ethereum spot ETFs on Wall Street, approved officially on May 23 by the Securities and Exchange Commission.\n\nBTC reports a market capitalization of 1.4 trillion dollars, volumes in the last 24 hours equal to 18.8 billion dollars, and dominance at 52.5%.\n\nI prezzi si trovano ben al di sopra dell’EMA 50 daily con un RSI14 a 57 punti, in un pausa dalla foga delle speculazioni, in attesa che la domanda torni a spingere riportando la moneta sopra i 70.000 dollari ed oltre.\n\nThe prices are well above the EMA 50 daily with an RSI14 at 57 points, in a pause from the frenzy of speculations, waiting for the demand to push the currency back above 70,000 dollars and beyond.\n\nThe short-term forecasts indicate a strong probability of a continuation of the lateral trend, with the quotations likely oscillating within the trading range of 61,000-71,500 dollars in the coming days.\n\nIn any case, it seems more likely that, should the market take a clear direction shortly, the path will be that of the bull.\n\nWe remind you that today the US stock market is closed on the occasion of “Memorial Day”, therefore we might witness relatively reduced volatility during these hours.\n\nDaily chart of Bitcoin price (BTC/USD), Coinbase market\n\nBitcoin is supported by the enthusiasm of the crypto market for Ethereum spot ETFs, which is monopolizing the attention of investors.\n\nSince Bloomberg analysts increased the approval estimates of this investment instrument on May 20, BTC has grown by about 3%, even reaching the resistance of 71,500 dollars before a slight price drop.\n\nRegarding this event so disruptive for the future of Ethereum and many other tokens developed within it, Michael Saylor expressed his enthusiasm about how all this could have a positively implicit impact also for Bitcoin.\n\nDespite always declaring himself against Ethereum, this time he stated in a recent interview that the approval of exchange-traded funds on ETH “makes the entire asset class bigger and therefore more money can flow into Bitcoin.”\n\nIn his interview post Ethereum ETF approval, Michael Saylor completely reframes his narrative to say that the Ethereum ETF approval is a GOOD thing for Bitcoin because it makes the entire asset class bigger and thus more money can flow into Bitcoin. 😂 pic.twitter.com/TxSduvRp9C — Autism Capital 🧩 (@AutismCapital) May 26, 2024\n\nIn the meantime, however, Bitcoin ETFs also continue to churn out encouraging numbers with funds on Wall Street that have recorded so far inflow of 13.68 billion dollars.\n\nAs a positive note, we highlight that Grayscale seems to have interrupted the trend of sales that characterized the recent price declines of the asset, while Fidelity, BlackRock, and Ark continue to increase their market share by adding satoshi to their respective holdings.\n\nIn particular BlackRock with its IBIT is about to match the numbers of Grayscale and its GBTC fund, having come to hold over 280,000 BTC for a value of almost 20 billion dollars.\n\nBlackrock's $IBIT now has nearly $20B worth of #Bitcoin sitting in it.\n\n\n\nThis is at basically the same level as Grayscale's $GBTC and will likely be far ahead by the end of the year. https://t.co/J8NZsBWoVo pic.twitter.com/H60VceqkwV — Daan Crypto Trades (@DaanCrypto) May 27, 2024\n\nETH Price Prediction: attack on 4,000 dollars\n\nAs mentioned, at this moment the true protagonist of the price evolution in the crypto market is Ethereum, which graphically seems to be in a much better position compared to the king Bitcoin.\n\nWith a clearly bullish pattern, the quotations are currently at 3,917 dollars, up by 3.2% in the last 24 hours and by 25.6% in the last 30 days.\n\nThe market capitalization is equal to 470 billion dollars, with volumes in the last 24 hours of 18 billion dollars and a dominance of 18.3%.\n\nSince May 20, the day when the ETF narrative became decidedly hotter, the coin has surged by 27%, suddenly changing the sentiment of investors who until then were much more negative about short-term price forecasts.\n\nNow Ethereum is on the road to break 4,000 dollars and attack the local high located in the 40,091 dollars area, to then aim for the ATH above 5,000 dollars.\n\nIn the short term, downward movements are not excluded, with prices that could easily return to 3,500 dollars, while still remaining in a positive momentum.\n\nL’RSI14 è appena entrato in zona iper comprata a 72,5 punti con un open interest ai massimi storici a circa 13 miliardi di dollari, come testimonianza della forza dell’asset e dell’attenzione degli investitori per le speculazioni.\n\nSembra che in questa fase in cui Ethereum viene acclamato dalla folla, con le previsioni che indicano un futuro radioso per la seconda criptovaluta del mercato, i bitcoiners maxi stanno cambiando le loro rigide prospettive.\n\nGente del calibro di Jack Mallers, CEO e fondatore di Strike, che in precedenza aveva definitivo Ethereum come una “roba schifosa” ora la definisce come una “tecnologia” pur mantenendo la preferenza verso Bitcoin come forma di riserva di valore mondiale.\n\nJACK MALLERS: When I call Ethereum a piece of crap, maybe I’m being a bit aggressive but I think it’s distinctly different from #Bitcoin– I think #Bitcoin can be the world reserve asset, Ethereum is a technology. pic.twitter.com/xHNAHwAN4H — Bitcoin News (@BitcoinNewsCom) May 22, 2024\n\nWe remain waiting to discover when the SEC will approve the S-1 documents for the issuers of the ETH exchange-traded funds (it is now only a matter of time) to be able to make further assessments on the state of the asset market.\n\nIf the listing were to have the same effect recorded on Bitcoin for the launch of BTC ETFs, we could expect weak price action in the first two weeks, followed by a price pump in the following months with quotations that could soar up to 8,000 dollars by the end of 2024.\n\nIn a context like this, even the altcoin would benefit from fertile ground to fuel speculations and the influx of new resources into the market."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNemw2R1dFekpXWXJmd29IeWVJOHlIMEVSR2ZhaEsyRXM1RkdWZXRfNjBRYV9UNmo0SWhEWWI2SnVnSkdUMnlSSVgtUjNhYk1RTUM4Zl9JUGpGZ1dBZmdLZFJTeFlBLUlVRGZEQWptdkZPSFJ4Nk9uc0d5clFELXJ5SE05dWc5eFJPeE94dmM2a2Zacnhp?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Pourquoi Michael Saylor pense que les ETF Ethereum renforceront le Bitcoin - Cointribune EN",
        "content": "Mon 27 May 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nMichael Saylor, known for his status as a Bitcoin evangelist, recently surprised the crypto community by adopting a favorable stance towards Ethereum-based ETFs. This former Ethereum skeptic has not only revised his judgment but also predicted that this new asset class could accelerate institutional adoption of cryptos.\n\nMichael Saylor paves the way for Ethereum ETFs\n\nDuring a recent appearance on the podcast “What Bitcoin Did,” Michael Saylor, co-founder of MicroStrategy and major Bitcoin evangelist, expressed unexpected support for Ethereum-based exchange-traded funds (ETFs). “In fact, this could be better for Bitcoin, as we are politically much more powerful… supported by the entire cryptocurrency industry“, he stated. Saylor explained that traditional investors might now be more inclined to allocate a larger portion of their portfolios to crypto assets, from the current 1% to potentially 5% or 10%.\n\nThis statement marks a striking contrast with Saylor’s previous positions, where he had categorically rejected the idea that Ethereum could be accepted by Wall Street. According to him, Bitcoin was the institutional-grade crypto. However, the recent reversal by the SEC, which has approved several Ethereum ETF listing applications, seems to have changed Saylor’s perspective. This approval, considered unlikely just a few days ago, paves the way for increased institutional adoption of Ethereum ETFs and could redefine the cryptocurrency investment landscape.\n\nTowards a new era of institutional investments in cryptos?\n\nMichael Saylor’s adoption of Ethereum ETFs could mark a decisive turning point for the crypto market. Indeed, his support could encourage other institutional investors to diversify their portfolios beyond Bitcoin. This dynamic could bolster the perception of Bitcoin as the asset of choice within a broader crypto asset class.\n\nThis change in position from one of the most ardent Bitcoin proponents also raises questions about the future coexistence and complementarity of different cryptos in institutional portfolios. If Bitcoin remains the primary asset, the growing acceptance of Ethereum and other altcoins could lead to a reevaluation of investment strategies. In conclusion, Saylor’s support for Ethereum ETFs could well be the catalyst for a new era of institutional investment in cryptos and profoundly transform the financial landscape.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE4xTU5yd21OdlNweW9EV2hMaE1EVFl2R09UU2VPQkZLWGw2SWJhcUJ4dDlGRE1EejhkUHlyd3dnZ2xKYU9ZOG1XYnA3UUhHRnJ3QWRQaDdTSmhiTm1tMW0tVHBPekpvN3BDQnZLcmpUUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Crypto: Is Ethereum Catching Up? - Cointribune EN",
        "content": "Mon 27 May 2024 ▪ 7 min read ▪ by Laetitia B.\n\nEach bull run in the past has gone through different phases stimulated by a capital rotation. In general, bitcoin is often the leader of the bull run and the favorite in the early phases. Following Ethereum’s weaker performance compared to bitcoin, we will look at the factors favorable to a capital rotation towards Ethereum.\n\nThe Principle of Asset Rotation\n\nIn traditional finance, there are several types of asset rotations. This can involve a sectoral rotation (technology, industrial, financial, health…) or a rotation of asset types (bonds, stocks, commodities, forex…). Capitals move according to the context and the economy. The rotation can come from profit-taking after a significant performance to move into another sector or a less valued type of asset while following the economic context. This is often the case between cyclical and defensive sectors, for example.\n\nLet’s also take an example over a very long-term horizon, that is to say over several decades, we can see this cyclical rotation between commodities and the S&P500 index in the graph below:\n\nThis type of graph highlights that in the coming years, performances in commodities should be more advantageous than in the S&P500.\n\nThe Different Phases in Crypto\n\nWhen we look at the cryptocurrency market, there are several phases in terms of rotation, whether it is between bitcoin, Ethereum, large caps, and altcoins. And generally, this comes from a progressive rotation.\n\nPhase 1: Bitcoin is the leader, the store of value in the crypto market. It is the oldest and most democratized in the cryptocurrency sphere. It is on bitcoin that the first capital inflows arrive at the beginning of a bull market. Since 2024, bitcoin has been available in spot ETF form, which is an advantage to stimulate demand. And in parallel, when the demand is stimulated, it increases the capital inflows. During phase 1, bitcoin tends to outperform Ethereum. And it is only when Ethereum starts to approach bitcoin’s performance that phase 2 is near. We can possibly see this rotation with the example below which highlights the ETC/BTC ratio:\n\nPhase 2: Ethereum, which is the number 2 cryptocurrency in the crypto sphere, outperforms bitcoin. This can be seen in the graph below with the 2021 bull run.\n\nPhase 3: It is the turn of large capitalizations (Doge, LTC, XRP…) to outperform bitcoin.\n\nPhase 4: The altcoin season begins when there is a large capital rotation. That is to say, the money invested in bitcoin at the beginning of the bull run moves to other cryptocurrencies, small and mid-capitalizations, or even memes. During the altcoin season, we see a reduction in bitcoin dominance. Here is a graph that highlights this:\n\nTo better illustrate this in general terms, here is the chronology below:\n\nThe Economic Environment and Different Phases in Cryptocurrency Markets\n\nThe evolution of cryptocurrency is quite cyclical, just like the economy. That is to say, we find cycles of growth and cycles of decline. Like any riskier asset class, it evolves according to a favorable and accommodating context. A favorable context can be defined in several ways. For example, when growth rebounds, we have an acceleration of growth, which is a favorable environment for cryptocurrencies. Consumer sentiment is positive and this encourages capital inflows. Conversely, when we face an economic slowdown, it is often represented by a bear market in cryptocurrencies. Each cycle often averages one and a half to two years, just like economic cycles. Therefore, if we add up a bull market and a bear market, it represents 4 years, just like the halving process:\n\nAnother positive element for performance is also liquidity. When liquidity is abundant, cryptocurrencies thrive. For example, injections of liquidity during COVID led to more capital circulating in the markets. Financial conditions were highly relaxed. Therefore, more money in circulation to buy the same good implies a price increase.\n\nRegarding liquidity in the current situation, we can see the graph below highlighting the evolution of liquidity and bitcoin:\n\nRemaining in the same context, that is, liquidity, we can also see favorable seasons (summer and fall being the best):\n\nThe Delay of Ethereum Explained by Several Factors\n\nAs mentioned earlier, Ethereum is often delayed compared to bitcoin during the first months of a bull run. This is mainly because capital first flows into bitcoin, the store of value. As for Ethereum, it is no longer the only one well-positioned as it is closely followed by Solana. This also implies competition. That said, like bitcoin, Ethereum should benefit from more incoming flows since the approval of ETFs is official. Such products imply more potential to attract new investors, whether for tax reasons (introduction of the product into tax-advantaged accounts) or simply because an ETF is an easily accessible product (no need to open multiple brokerage accounts) and is inexpensive. This is why approval would be a good catalyst for catching up with bitcoin. Therefore, there are several arguments that align for Ethereum’s outperformance, such as a favorable context, new available products, and the phase timeline (as indicated above).\n\nBitcoin or Ethereum, Which to Choose?\n\nBitcoin and Ethereum have different strengths that can help diversify a crypto portfolio. One of bitcoin’s peculiarities is that it has a limited supply of 21 million, and its production is halved every 4 years. This can be seen as a safe haven, especially in countries suffering from hyperinflation. Ethereum also has certain peculiarities, such as the fact that it can be used to host other cryptos and decentralized applications.\n\nThe more adoption and democratization continue with the same dynamic, the more we will face new products as approvals will be increasingly easier. For example, we could have an ETF that brings together bitcoin and Ethereum to simplify the choice. This opens many possibilities in terms of capital.\n\nConclusion\n\nWe can conclude that the capital rotation system is cyclical and that Ethereum has several reasons to take the lead and outperform bitcoin for the rest of the cycle. One of the major catalysts for this would be, like bitcoin, ETF approval. This will improve liquidity in the coming months.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOdTc5U1ZjUDZqTWJBUEhLc212b1FweUtIUC1Ka05tQUx1aHZZdDZkNndqUTJDUnZnV2JCNFBfaUZpSUpZOEQyZk9uNFpZSVRDNEh5WjRhSGdJTTh4bGdlYWowZUJnMllkYzlOMG95Rk4tWERzVC1aWEh5UXdRX2VpU0pHdHctcVhKYi1uYk1YeFR2bkN5bE5DV2NiNHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Michael Saylor: Ethereum ETFs Approval Will Benefit Bitcoin - ihodl.com",
        "content": "According to Michael Saylor, founder of MicroStrategy, the recent approval of spot Ethereum ETFs by the SEC is only beneficial for Bitcoin.\n\nIn a recent interview with Peter McCormack, Bitcoin podcaster, on the What Bitcoin Did podcast, Saylor stated that the approval will strengthen Bitcoin's position because the entire crypto sector will now have stronger political support.\n\nSaylor has further explained that ETFs serve as an additional line of defense for Bitcoin and will help accelerate its institutional adoption.\n\nHe has added that this will also legitimize the crypto asset as an asset class and attract more mainstream investors, ultimately benefiting Bitcoin, which remains the industry leader."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQcmxJT1BhNm1Wdlp5ektPR3RSZUZfS21YdmF2cFN2RG9VVUZZdTVDMmhNLW81Z0ZaVTgzY3E4cTgxZVFIVDM3dEFRMzV1QTJEZFZKTlk2ZjdhczJCNU44Q0k2SWhlYnI0UWFaVlZiejdaMFVWZjBFTnhTTjVZY3Y1TkdEOFjSAYoBQVVfeXFMTlRpUkNTM3NodDhWdUVHUDZaeU0xS3d5VnJubzVycGJodFlORTdHRFBfTmI3d0VoYWt6aURNT3duUUJCZVhGSlF2WUZQOUFKYVNzS1diOFlORnNXQ2RSOFM4NHY4RnZURF9QRzRVWHhCYm94WlRsbERub3RCOElpaURlMnExaW5xNjV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "What’s behind Ethereum’s bull run? Whales, ETF approval, and… - AMBCrypto News",
        "content": "Ethereum whales have become more active recently.\n\nETH is attempting to establish the $3,600 range as its support.\n\nAnalysis revealed that before the Ethereum [ETH] ETF was approved, a particular whale address made bold moves by acquiring more ETH at a specific price level.\n\nAs a result, this address saw a significant unrealized profit. Additionally, further analysis showed a similar pattern among other whale addresses in the lead-up to the ETF approval.\n\nWhale acquires Ethereum and ecosystem tokens\n\nAn analysis by Lookonchain revealed that a particular whale wallet anticipated the approval of the Ethereum spot ETF and made a substantial purchase of ETH.\n\nThe data indicated that the whale acquired 8,733 ETH at approximately $3,054.56, totaling around $26.67 million. As a result, the whale wallet now holds approximately $6 million in unrealized profit.\n\nFollowing the approval of Form 19b-4 by the Securities and Exchange Commission (SEC), the whale proceeded to purchase other tokens within the Ethereum ecosystem, amounting to $24.7 million.\n\nAmong these tokens is the Lido DAO [LDO] token, which represents the platform with the highest volume of ETH stakes. The unrealized profit for these ecosystem tokens in the wallet stands at around $1 million.\n\nEthereum whale activities increase\n\nAMBCrypto’s analysis of Ethereum addresses holding 10,000 or more ETH revealed a significant movement in recent days.\n\nAccording to data from Glassnode, there had been declines in the number of such addresses before a trend reversal around the 19th of May.\n\nThe chart illustrated an increase in the number of addresses from around 997 to approximately 1,006 at the time of writing.\n\nFurther examination showed that the number of addresses holding $100,000 or more worth of ETH also experienced a notable surge.\n\nIn the same period, this figure rose from around 117,500 to over 140,000 as of the current writing.\n\nStaked ETH sees a slight decline\n\nAMBCrypto’s look at the total Ethereum staked indicated a brief decline, followed by an uptick around 20th May.\n\nAccording to the chart, it increased to over 32.5 million ETH from around 32.3 million ETH during this period. As of press time, the total ETH staked stood at around 32.56 million, with a slight decline observed.\n\nAlso, the current staked volume represented approximately 27.1% of the total Ethereum supply.\n\nEthereum maintains a bull run\n\nAs of press time, Ethereum was trading at approximately $3,790, reflecting an increase of over 1%. Analysis of the daily time frame chart indicated its efforts to sustain the $3,700 price range since it rose to that level.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe current trend suggested Ethereum’s attempt to establish the $3,600 range as its support.\n\nThe Relative Strength Index (RSI) showed Ethereum slightly below the overbought zone. This suggested a strong bullish trend but also implied the possibility of a decline, even amidst another potential bull run."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPVFYzOXlyS0MwdHRqcU9SWlhGY2RQSlBxSFNjdXRKWUF6TVZ6TmxtbkpKMUR0UjlEanh5VHhFUG5rWmpSN3VnamktdXFYOHlpRVZmQnYzSFp2UXpkTFlaT25LVHRUQXpvM3NWSVJWX3JwYVVzT3VaTnJoWnEwdUV1T09hcU5lQmVEVklXZ2JicWN4XzhLR1gxMTRjZm95SGplam1iNTZPUEFaNWRyYlozWERsanAwM1hiNE1lcVRsV0F0UdIBwgFBVV95cUxPVFYzOXlyS0MwdHRqcU9SWlhGY2RQSlBxSFNjdXRKWUF6TVZ6TmxtbkpKMUR0UjlEanh5VHhFUG5rWmpSN3VnamktdXFYOHlpRVZmQnYzSFp2UXpkTFlaT25LVHRUQXpvM3NWSVJWX3JwYVVzT3VaTnJoWnEwdUV1T09hcU5lQmVEVklXZ2JicWN4XzhLR1gxMTRjZm95SGplam1iNTZPUEFaNWRyYlozWERsanAwM1hiNE1lcVRsV0F0UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Hyped Boost Altcoin Sector, Is A Solana ETF And Ripple (XRP) ETF Coming? - Blockchain News",
        "content": "Ethereum ETF has crypto investors considering potential applications for Solana ETF and Ripple Labs XRP ETF.\n\nInvestors are speculating about the Ethereum ETF’s approval and its implications. The news has renewed interest in other altcoins, as investors expect the Solana ETF and XRP ETF to be next in line for approval.\n\nHowever, while interest in a potential Solana ETF and an XRP ETF is high, investors are also watching RCO Finance (RCOF), a new crypto project offering investors various traditional and digital investment options. RCOF could change the crypto trading landscape for good.\n\nRCO Finance (RCOF) could be a better option for Solana (SOL) and Ripple (XRP) investors, who would still have to contend with market volatility in the long run.\n\nEthereum ETF Hype Market Performance\n\nThe Ethereum ETF is one of the most important events in the crypto space. It opens up the cryptocurrency ecosystem to institutional adoption and increases the chance that a potential Solana ETF and Ripple Labs XRP ETF will be launched.\n\nNews of Ethereum ETF’s approval has already affected the market. The hype behind Ethereum ETF has driven the price of ETH by 1.50% to around $3,805 in the last 24 hours.\n\nInvestors expect the upward trajectory to continue and the coin to break into $4,000 in the coming days.\n\nWith an increased market capitalization and trading volume of $452.70 billion and $32 billion, the interest in Ethereum ETF can potentially push the coin past its previous all-time high to $5,000 later in the year.\n\nAs the situation develops, crypto traders expect Ripple, an owner of XRP, to apply for an XRP ETF following the success of 13 Bitcoin (BTC) ETF applications in January.\n\nThe hope is to boost the value of XRP with the hype, legality, and liquidity that a potential ETF can bring. Other altcoins could also be in the mix for a future application similar to Ethereum ETF, with investors mooting a Solana ETF.\n\nHowever, if crypto traders are simply looking to improve the price of their assets and portfolios, RCO Finance’s (RCOF) crypto trading platform offers far easier ways to improve portfolio performance and increase profits.\n\nRCO Finance (RCOF) to Protect Portfolio Values in Uncertain Times\n\nAs news of Ethereum ETF saturates the market, holders of RCOF could see their chances of improving profits rise significantly. RCO Finance is in its presale stage, and even then, it promises investors a potential 1000% profit.\n\nThis platform helps users improve their profit margins by lowering transaction costs, offering opportunities to earn passive income, and offering interest on presale tokens. Investors never need to go through the troubles of a Solana ETF or Ripple XRP ETF.\n\nThe platform’s main selling points could make it the perfect investment vehicle for crypto traders to bridge the gap between the cryptocurrency market and the traditional investment market. The platform can also serve as a safe zone from volatility, which is common in crypto.\n\nWhy Crypto Investors Should Consider RCO Finance (RCOF) Ahead of a Potential Ripple and Solana ETF\n\nRCO Finance (RCOF) is a crypto trading platform that allows users to exchange digital assets for traditional investment options such as stocks, bonds, real estate, etc.\n\nAmid speculations around a potential XRP ETF and Solana ETF application, XRP and Solana (SOL) investors can easily diversify their portfolios using the profitable options provided by RCO Finance (RCOF).\n\nThe investment options provided in this platform could improve users’ portfolios and profit margins more than any potential XRP ETF or Solana ETF could.\n\nThis crypto trading platform also offers an AI trading tool that uses advanced machine learning to analyze market trends and identify potential investment opportunities. The tool can also assist users in making trades when offline.\n\nHowever, if you would rather not risk your funds, investors can earn passive income by providing liquidity pools through the platform’s automated market-making (AMM) option.\n\nRCO Finance’s (RCOF) crypto trading platform leverages blockchain technology to provide a secure trading platform for all users. Blockchain protocols will also verify and authorize transactions on RCO Finance (RCOF) to prevent fraud and fund loss.\n\nThe RCO Finance (RCOF) token has passed its audit and is currently in the first stage of its presale. The coin is available for $0.0127 per coin. When this token enters its second presale stage, crypto traders can make more than 1,000% ROI.\n\nFor more information about the RCO Finance Presale:\n\nVisit RCO Finance Presale\n\nJoin The RCO Finance Community"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOOWpUM0dNVmdCTXRvS2V3bG9rMkI0VUJIMy1RTUozbkFWbVVhd1luZ3JneWFtQ2tkLWNZS3I1Y1pCUFhWTGxIaUdFbDIxZTNfQXAxcEI0dTF5bGxkUkkwWnpsclRmQmkzdWlXX0VVMEo4UlpGNk8yWDNOZXhqSUtnVDVUVDhqbEk3MG5GUW5IMmxCSklDcFhZZU5HVWpJejRrN0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Unexpected Reaction After Green Light for Ethereum ETF - finews.asia",
        "content": "After much hesitation, the US Securities and Exchange Commission has approved applications for Ethereum spot ETFs from prominent asset managers. This marks a significant milestone for the crypto industry.\n\nJust a few days ago, many analysts did not anticipate such a decision, as the SEC had not discussed the applications with the involved parties. Then came the surprise overnight on Friday. All eight applicants received approval from the US Securities and Exchange Commission to enable Ether-linked ETF trading: Grayscale, Bitwise, BlackRock, Fidelity, VanEck, Ark/21Shares, Franklin Templeton, and Invesco Galaxy.\n\nThis could pave the way for trading such products later this year. But before trading can begin, providers must still clarify the details with regulatory authorities. An authorized S-1 filing, a comprehensive document containing information about the company's finances and risk profile, as well as the securities it plans to offer, will be necessary for this.\n\nUnexpected Market Reactions\n\nThis could be a reason why the price of Ether dropped by almost 6 percent after rising by 20 percent earlier in the week. However, most of the top 100 cryptocurrencies are also currently experiencing price losses.\n\nBig Brother Bitcoin\n\nThis is the SEC's second decision on exchange-traded products (ETPs) in the cryptocurrency space. After a long legal battle, the SEC approved Bitcoin ETFs and ETPs in January 2024. According to BTC-ECHO, over $13 billion has flowed into Bitcoin-based ETFs in the last four months.\n\nWill the Ether ETFs be able to mirror Bitcoin ETFs? Investors and market participants will be watching this closely."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNSmpERnlsXy1EbW5DR2FDc2JCZGFoT2RhZlFQTk1zY3ppaEV6dzZ0cHhVVklROVFCZUdJbExXZE9pN2hpcE5fWkNyYVpvcXk1cTlwbUVkUW5VT0xtemQ0bjVjSG5oeUFKTXFWWTBxZTZCcklDWm5xVGpnS2xZX0o1S0FOZlZkTnBrUWlweTFtc01LVktBRkZ0Ry1pVWpvY0FXcFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Under Bitcoin's shadow: A survey of Ethereum ETFs in Canada | 2024-05-27 | Investing News - Stockhouse Publishing",
        "content": "After approving spot ETFs for Bitcoin, the largest cryptocurrency, in January, and watching them rake in almost US$60 billion in assets, the U.S. Securities and Exchange Commission has approved the CBOE, Nasdaq and NYSE exchanges to trade in ETFs tracking Ethereum, Bitcoin’s only real competitor\n\nNine issuers are looking to bring Ethereum ETFs to market, including VanEck, ARK Investments/21Shares and BlackRock\n\nEthereum’s native currency, ETH, has gained 115.19 per cent year-over-year, and 1,552.35 per cent since 2019, last trading at C$5,363.76 per token\n\nAfter approving spot ETFs for Bitcoin, the largest cryptocurrency, in January, and watching them rake in almost US$60 billion in assets, the U.S. Securities and Exchange Commission (SEC) has approved the CBOE, Nasdaq and NYSE exchanges to trade in ETFs tracking Ethereum, Bitcoin’s only real competitor.\n\nEthereum is a blockchain network that enables parties to do business with one another through smart contracts, which are agreements that execute based on agreed-upon criteria without the need for a middleman. The network is host to some of the largest and most well-known projects in the cryptocurrency space, including UniSwap, Curve, Chainlink and Decentraland. Ethereum’s native currency, ETH, has gained 115.19 per cent year-over-year and 1,552.35 per cent since 2019, last trading at C$5,363.76 per token, granting it a market capitalization of about C$650 billion, almost three times less than Bitcoin’s C$1.9 trillion.\n\nWhile financial institutions still need to have individual fund registrations approved before trading in Ethereum ETFs can begin – nine applications are under consideration including VanEck, ARK Investments/21Shares and BlackRock – the SEC’s open-mindedness towards crypto in 2024 is in stark contrast to its historical skepticism towards the speculative asset class, opening an increasing number of investors up to the idea of holding an allocation. Canadians, for their part, have had access to Bitcoin and Ethereum ETFs since 2021, and benefit from products from reputable providers to gain exposure.\n\nWith eyes on catching short-term gains tied to individual fund approvals by the SEC, as well as aligning yourself with crypto’s potential for outsized long-term returns, let’s break down how Canada’s Ethereum ETFs stack up against one another.\n\nThe 3iQ Ether Staking ETF\n\nTicker: ETHQ.\n\nNet asset value: C$72.6 million.\n\nManagement expense ratio: 1.56%.\n\nDifferentiator: Unitholders can earn yield through Ethereum staking, which involves locking up investments in ETH to help to run the network. The fund was also first to market with staking capabilities.\n\nCI Galaxy Ethereum ETF\n\nTicker: ETHX.B.\n\nAssets under management: C$654.7 million.\n\nManagement expense ratio: 0.4%.\n\nDifferentiator: Galaxy is one of the pre-eminent crypto players across capital markets, asset management and infrastructure solutions.\n\nEvolve Ether ETF\n\nTicker: ETHR.\n\nAssets under management: C$91.8 million.\n\nManagement expense ratio: 0.75%.\n\nDifferentiator: The fund is the first in the world to offer exposure to the Ethereum network in the form of an ETF.\n\nFidelity Advantage Ether ETF Fund\n\nTicker: FETH.\n\nAssets under management: C$19.2 million.\n\nManagement expense ratio: 0.95%.\n\nDifferentiator: Besides being one of the world’s most well-respected financial institutions with more than 75 years of history and more than 50 million individual clients, Fidelity is also a crypto pioneer, having entered the industry all the way back in 2014.\n\nPurpose Ether ETF\n\nTicker: ETHH.\n\nAssets under management: C$478.7 million.\n\nManagement expense ratio: Up to 1.5%.\n\nDifferentiator: Investors who open a position in ETHH have the option to complement this exposure with the Purpose Ether Yield ETF (TSX:ETHY), which writes covered calls and currently pays out an annual yield of more than 9 per cent. Unlike ETHQ, whose yield is reflected in unit price appreciation, ETHY pays its distributions in cash.\n\nWhether you’re a novice or an enthusiast, cryptocurrencies remain a new and volatile asset class with a little more than 15 years of market history, hardly enough for investors to expect reliable capital appreciation, despite the multitude of crypto millionaires who attract many retail participants into the space. This is why it’s essential to have a plan for any dollars you intend to allocate, ensuring that you minimize avoidable regret through awareness of the range of possible outcomes.\n\nIf you’re interested in finding out whether crypto suits your investment needs, check out last year’s “How to invest in cryptocurrency.”\n\nJoin the discussion: Find out what everybody’s saying about Bitcoin, Ethereum and other cryptocurrencies on Stockhouse’s Blockchain and Cryptocurrency Bullboard, and check out the rest of Stockhouse’s stock forums and message boards.\n\nThe material provided in this article is for information only and should not be treated as investment advice. For full disclaimer information, please click here.\n\n(Top photo: Adobe Stock)"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOWU5NcW9lajBpZXN3QnZVNFZwRHZsSFF6alpfQTdGREVpQjltODdsZUN6MEhJMElZMnY2aC00d0JYb0lLUWNFNUJ6bGhZdzFWN1QzeFhJVzQ2VFIyM24zUFpzclc5ekQ5Z3lkbXo0bEhsQkhDd2xVMUJsVWloMi1uaEt5NlZxM3NLZmlr0gGQAUFVX3lxTE5ndUlqMElITjktVXBBSDhrcEtGWC1ZNTJMMkhGQW1oeTEwTDV5R0ZXU2U1ZHBvZGtlc1Rhc05mS2VkazNSRWpObUMxZ0ZrY3dlOUdCQmYtR3RhUG9BcG5FRXZkOTlsa2dZOFpyOGJoZUN6b09Ebm9Bc1RzbThjNGd6NHNDbmRfbG9UVDZYUi1mMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "How Solana’s NFT market surpassed Ethereum’s – A 30-day snapshot - AMBCrypto News",
        "content": "Solana’s NFT buyers and sellers remained higher than those of Ethereum\n\nSOL’s price gained bullish momentum, but the trend might change\n\nSolana [SOL] has once again dominated its competitors like Ethereum [ETH] in the NFT space over the past month. Now, while this seems optimistic at first glance, there might just be more to the story. Let’s have a look at how both of these NFT giants fared against each other.\n\nSolana beats Ethereum\n\nCoin98 recently shared a tweet underlining the latest datasets from the NFT ecosystem. According to the same, Solana is now ranked #1 on the list of blockchains in terms of the most NFTs created in the last 30 days. Apart from Solana, Polygon and Base also made it to the top three on the same list.\n\nHere, what is also worth mentioning is that Ethereum took the 10th spot on the list. While 32 million NFTs were created on Solana, only 1 million NFTs were created on Ethereum. This gave SOL a whopping lead of 31 million.\n\nAMBCrypto’s analysis of DappRadar’s data revealed that STEPN, SMB Gen2, and Mad Lads were the top NFT collections on Solana last month. Oddly enough, y00ts and DeGods, two projects that recently migrated to Solana, couldn’t make it to the top 5.\n\nWhile the aforementioned datasets imply one thing, a look at the bigger picture might imply something different entirely. For instance, AMBCrypto’s analysis of CryptoSlam’s data revealed that while Solana’s monthly NFT sales volume was merely $99 million, Ethereum’s sales volume stood at $193 million.\n\nNonetheless, Solana’s number of NFT buyers and sellers remained significantly higher than that of Ethereum.\n\nSOL turns bullish\n\nWhile Solana’s performance in the NFT space remained positive, SOL’s price action once again turned bullish. According to CoinMarketCap, SOL’s price surged by over 2.5% in the last 24 hours. At the time of writing, the token was trading at $169.30 with a market capitalization of over $76 billion.\n\nThanks to the latest price uptick, the token’s weighted sentiment hiked too. This meant that bullish sentiment around the token was dominant in the market. Additionally, its social volume also appreciated on the charts, highlighting SOL’s popularity.\n\nHowever, this trend might not last as a key derivatives market indicator flashed bearish signals at press time. Coinglass’ data revealed that Solana’s long/short ratio fell over the last 24 hours.\n\nRead Solana’s [SOL] Price Prediction 2024-25\n\nHere, a low ratio is a sign of bearish sentiment, where there is more interest in selling or shorting assets."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQUEhjcE9oNXFsVkJGeHdQN19mRTF0cmJPMkFuYzRVSzNqclBoRW0yRjVvbEYwcHUwU2dRcE5TWkxVVjNmVmQxdjVHVTVxdThGQXpfTzJLczRBckt4MlpfTkt2eXktb3Z1eHN2OGN5QVlsVTMtbjBfc2xiSkdkM0I2WG1pYm5lQdIBiwFBVV95cUxPT2dTRXZGMTctdFZEekhJZ2tSeXFvcEdYSG1weWNscHVFb1ZZbEFsalRJNGlhcVZpYlNrZ1M4QjFOTDN6WnB4SkJ0NUNWa05fR3ZOcUttZ0Q1MnJpb2dKcVpFTzVTbGZSMVBaX05qY1BoZE9LV0IwdjRpMktldmFJZHk0WVRSMG1nczRv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval helps ONDO soar to $1.33 ATH: $2 next? - AMBCrypto News",
        "content": "ONDO Finance hits a new all-time high of $1.33, driven by Ethereum ETF hype.\n\nWith recent stability around $1.27, ONDO aims for $2 if it breaks the $1.32 resistance.\n\nThere is an unfamiliar entrant into the crypto market rally.\n\nTaking the markets and community by surprise, Pantera Capital’s Ondo Finance [ONDO] has broken an all-time high of $1.33 as the Ethereum [ETH] ETF hype rages on, making it one of the best-performing cryptos.\n\nONDO: These are some key levels\n\nThe ONDO/USDT pair has shown some interesting movements over the last five days.\n\nStarting from a base of around $1.17, the token experienced a sharp increase in trading activity, pushing its price to a peak of $1.33 around three hours ago.\n\nThis upward movement was followed by typical volatility, with prices retracting slightly and then attempting to stabilize near the $1.30 mark before a subsequent pullback to the $1.27 level.\n\nONDO’s trading volume has remained relatively steady, with a notable rise coinciding with the price surge, meaning there has been an increase in buyer interest during that period.\n\nAs the price hovers around $1.27 at press time, the market appears to be consolidating after the recent spike. Traders might be assessing the sustainability of the recent gains before committing to further positions.\n\nThe $1.27 level could also serve as a new support if ONDO maintains its foothold, or it might see further dips if the selling pressure increases.\n\nIf ONDO rebounds from its current level and breaks through the resistance at $1.32, it could set the stage for an upward trend towards $1.5 and even $2.\n\nRealistic or not, here’s ONDO’s market cap in ETH terms\n\nThe potential for ONDO to achieve a $2 valuation is quite strong, but it’s important to recognize that various factors beyond technical analysis influence crypto prices.\n\nThough we are right at the edge of what might be the greatest crypto bull run ever, the market remains incredibly volatile. Proceed with caution. Always DYOR!"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPc09CNG1rdWdUSGgxa3NoS1ZMdFVUa3BRX0IzUHhQVFo1S2dzQVo0MTYyb3JrSlc1Z1lvNnJwWkpMQ082V2xvRkZzeUlkcHpfUVpzYmEyR2ZTU0s1RFFsRjUtMkp0VkFTVGtJWEo3ZENTcl9ub2ZCUFhBcXRaamQyVjl1czEtOUNIYXp2Z0RuUEjSAZYBQVVfeXFMT3ZIWHJiaW9aNW5hZFp0WndCNlVMSU95V2FkTEprZ2piaXE5MWpPTFFndmdsYmstS3U5V09hcl93d3VXdVQxNnZ2Z2twV0VOOHhNMC1nQTQwUzlfWkZrdTdHWHppRS1xTFJlZ3JmVEpUbjJ5Mmt3OUk5elJWdFpWQnl2YXJFczZqbWE5RENGNmduSnJIbTV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Decoding Ethereum L2 Starknet’s price rise: Did ETH help STRK rise? - AMBCrypto News",
        "content": "STRK’s price resisted a major decline after millions of tokens went into exchanges.\n\nIndicators suggested that the value could drop amid falling volume and rising volatility.\n\nTwo of the largest Starknet [STRK] holders might have put the price at risk of a decline, but data showed that STRK seems to be holding on well.\n\nOn the 25th of May, AMBCrypto discovered through Spot On Chain that Tenoe, a Three Arrows Capital (3AC) liquidator, deposited 2.18 million STRK into Binance.\n\nHow ETH secured STRK’s Freedom\n\nLarge exchange deposits like this are supposed to precede a price decrease. But the Starknet token did not budge.\n\nAt press time, the price of the cryptocurrency was $1.25, representing a 4.06% increase in the last 24 hours.\n\nBefore Teneo’s deposit, Ethereum’s [ETH] co-founder Vitalik Buterin claimed his 845,000 STRK airdrop, worth $1.07 million. This action affected the token’s value as it dropped by 6%.\n\nHowever, it seemed that Starknet did not react the same way because of the U.S. SEC’s approval of Ethereum spot ETFs. Before the confirmation and afterward, ETH, including native tokens of Layer-2 projects under its blockchain, pumped.\n\nFor the uninitiated, Starknet is one of the notable Ethereum L2s.\n\nAs such, it seemed that the bullish sentiment around the ecosystem was the major reason the latest sale did not send STRK plunging.\n\nWhere is next? $1.06 or $1.50?\n\nFurthermore, AMBCrypto looked at the Weighted Sentiment around Starknet. At press time, the metric had surged to 4.293. Weighted Sentiment measures the positive/negative commentary about a cryptocurrency.\n\nTherefore, the reading implied that for every negative mention of STRK, there were four more supporting a bullish cause. Should the sentiment remain optimistic, the price of the token might continue to rise.\n\nIn a highly bullish case, the value of the STRK might hit $1.80. However, a return to the bearish phase could cause STRK to move to $1.06.\n\nHowever, the bullish price prediction might be invalidated according to signals from the volume. As of this writing, STRK’s volume was $127.90 million.\n\nThis was a notable decline from the figure on 24 May. Volume can be a sign of interest in a token and market strength. Therefore, increasing volume is viewed as a healthy metric for price.\n\nThus, Starknet’s declining volume while the price rises suggests the upswing might not last. Validation of this forecast could bring the token’s price down, and the slide to $1.06 could come to pass.\n\nMeanwhile, volatility around the cryptocurrency increased, suggesting notable price fluctuations.\n\nBut the reading, according to Santiment, showed that it might not be enough to spur a move that saw STRK move past $1.50 some weeks ago.\n\nRealistic or not, here’s STRK’s market cap in ETH terms\n\nRegardless of the signals on-chain, market participants might need to keep an eye on ETH.\n\nIf the prediction that ETH might hit a new high comes to pass, STRK might follow in the same direction. But if the altcoin fails to rally, its beta might also struggle."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQYnFhQ0NUdERWOVp4TWJJenlOU05RclRWVjItZllXX21UYk1zQTRVVnNiWmh6aEItbXVtc0hsZXZNZmFTRW42TXdVTVRpeEFZbUhIVWJTU09HZjhQNzZBMnFfeENySWhwdkpBN0lHcUtZam5tMms0OFBsV1VnNGNLcFJfV1B3blZ5TmhVenp30gGTAUFVX3lxTE14OTJoeXNvRGFjbUR0ejN3VUtTakV5dmhZNXBhYTluRE5sdDBpcUhkdXI2QUpYWldMbExENEVhNmJ1Z045OW1wMTdidzdiMGNudHZUZmw3eXBpZ0o4NkN5RG9uZS00ZnRGUmFtVElrNHFmbWlDVTY0SW5mRTNYMEtuR0pSRVFRZm9GOHhNQ0k5LWY3aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "10,000 New Users Join Ethereum Layer-2 Arbitrum Last Week, ARB Price Eyes $2 - CoinGape",
        "content": "As Ethereum (ETH), the world’s second-largest cryptocurrency, rallies to $4,000, its Layer-2 platforms are also experiencing similar momentum. Arbitrum, a prominent Layer-2 platform, has seen a 5% increase, pushing its price past $1.25. Additionally, Arbitrum’s daily trading volumes have surged by 113%, reaching $840 million.\n\n10,000 New Users Join Arbitrum Over the Last Week\n\nBased on the data showcased in the chart above, there were 1.5 million individual wallets holding ARB tokens as of the beginning of the week starting on May 20. As of the latest update on May 25, this number has climbed to 1.51 million ARB wallets.\n\nadvertisement\n\nThis suggests that approximately 10,000 new users have joined the Arbitrum network within the span of this week. As these fresh participants engage in transactions, the increasing demand for ARB tokens may catalyze further price fluctuations.\n\nMoreover, with the anticipation of Ethereum ETF inflows on the horizon, a significant portion of the 1.51 million ARB investors are likely to retain their assets, expecting favorable outcomes from the influx of funds into the Ethereum L2 ecosystem.\n\nThe resultant reduction in sell-pressure coupled with the rising demand from new adopters could propel Arbitrum’s price to advance towards the next significant milestone at $1.50.\n\nARB Price Action\n\nArbitrum (ARB) has been striving to surpass the overhead resistance of $1.27 in recent days, but the bears have managed to maintain their position.\n\nA minor positive for the bulls is that they have successfully prevented the price from falling below the 20-day EMA ($1.11). This increases the likelihood of a breakthrough above the resistance. Should this occur, the ARB/USDT pair is expected to gain momentum, potentially rising to $1.60 and eventually reaching $1.75.\n\nHowever, this optimistic outlook will be invalidated in the near term if the price declines sharply and falls below $1.10, which could drag the price down to the strong support around $0.90.\n\nThe Arbitrum price has been moving in tandem with Ethereu, Similar to ETH, ARB has also clocked 28% over the past week. Earlier this year in January 2024, the ARB price touched an all-time high of $2.4.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPYXpFczNVVmh0SlBhQno5V3FOQVBYNl9HcVdCNTlRRUJpT1ZseDk3VnBIUHFyODBudG9EMTdpV29qaVNLc2NXZnlTNjNnNkdNaENGbXI4RllOX0hQcFFySGhWNVBiajI0RFBISzByTmhaLUxpLUZ6cWU3cHdvMG5oM2o1S2ZrZnNPWWY0MkdOcko2U01oYmg0LTFfUHV3bFZ0REdNazBsZWlxd9IBrwFBVV95cUxNQzRZWFMwWWtVTW9wT1hNb3ctT1FEYUJpbWJOaF9Hdmp3a3k4Rm51QUtra1JPZkpCN1NRT1lJci1hZ2NUelo4MGRXalpRQUI1aDN6clNzMENBTmJtbGM0OFZ6OHFrQ0Y2R2g2SWlVX0FjNzZ4Zkh4VUw2dHV2Y051aDRlcEpQZXhUWUtXTm4yV0dnYno2VFZtUTdvS3doYmQxekhzd2xiM0w4M2xMNUhv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ethereum Shifts Gears: Breaks Key Resistance, New All-Time Highs Next - NewsBTC",
        "content": "Ethereum (ETH) is currently at the forefront of an impending market surge, as indicated by a significant technical breakout. According to crypto analyst Jelle, Ethereum has recently emerged from a bearish pattern particularly breaking out from the “falling wedge” and flipping key resistance into support zones.\n\nJelle reveals that Ethereum is currently pushing for the $4,000 mark which makes the possibility of reaching new heights seems more tangible. This movement marks a significant turnaround from previous trends, setting the stage for potentially record-breaking price levels.\n\nRelated Reading\n\nEthereum Bullish Turn: Analyst Highlight Positive Bias In ETH Options Across All Expiries 4 months ago\n\nThe Bullish Shift: Ethereum Breakout from a Falling Wedge Explained\n\nJelle’s recent observations come during a period of strong performance for Ethereum, with the cryptocurrency showing a 30% increase in value over the past week alone.\n\nEthereum stands at $3,951 at the time of writing, having climbed an additional 2.5% in just 24 hours. This notable uptrend underscores the growing investor confidence and market momentum that could drive Ethereum’s value to new records.\n\nNotably, a falling wedge pattern in technical analysis is a signal that often precedes a bullish market reversal. Characterized by converging trend lines that meet at a downward slope, this pattern typically concludes with a breakout to the upside as buying pressure overcomes selling momentum.\n\n$ETH broke out from the falling wedge, then flipped key areas into support & now pushes for $4,000. New highs, and new all-time highs are next. Higher. pic.twitter.com/pjrk8X2FYA — Jelle (@CryptoJelleNL) May 27, 2024\n\nEthereum’s recent breakout from this pattern signifies a potential reversal of its prior downtrend and transforms previous resistance levels into new supports, laying a foundational bullish sentiment.\n\nThis technical progression is critical as it indicates a shift from bearish to bullish sentiment, suggesting that Ethereum might recover from its previous lows and embark on a sustained upward trajectory.\n\nAnalysts like Jelle see this as a precursor to more aggressive buying behavior, potentially propelling the asset toward unprecedented price levels.\n\nBroader Market Sentiments And Predictions\n\nThe positive outlook for Ethereum isn’t isolated. Notable crypto analyst Defi Mochi predicts that the ETH price could soar to between $9,500 and $12,000.\n\nAccording to Mochi, this projection is based on a combination of factors, including increasing political support for cryptocurrencies and the fact that Bitcoin has yet to reclaim its all-time high.\n\nWith that said my realistic target for $ETH is approximately in the $9.5k to $12k range. Given\n\n◆ increased political support for crypto\n\n◆$BTC being barely at previous ATHs\n\n◆ increased adoption of $ETH by institutions I Think none of us are bullish enough on Ultrasound Money. — Defi_Mochi (@defi_mochi) May 26, 2024\n\nInstitutional investors’ adoption of Ethereum is also a critical factor in the prediction. As more institutions integrate ETH into their portfolios, their market dynamics are expected to stabilize further, attracting more significant investment flows.\n\nRelated Reading\n\nArthur, the founder of DeFiance Capital, aligns with this bullish sentiment, forecasting that Ethereum could reach $4,500 shortly.\n\nFeatured image created with DALL·E, Chart from TradingView"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNbEdlSG9SN2YzUzhCdEg5eXB2STUzUDh0dUpmcEtuTWNOemhmM2t6Qzh2YTU0Z3R2bjlKZ1N4TWFQbUhOVFBRaHkxcEZXV3FXRlA5ZFFlNm80S2x1azVtSWRZMlEtZ0pjeGt5S204TXJuaUpmd01qaDhnN05aV3BKbFh6ckl5a0hEb3hQZTlsMGU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 May 2024 07:00:00 GMT",
        "title": "Mog Coin (MOG): The Rise of Ethereum’s “Internet’s First Culture Coin” - Blockonomi",
        "content": "The Ethereum ecosystem has been buzzing this weekend as two meme coins, PEPE and MOG, have surged to record highs. This surge in value comes on the heels of the approval of ether (ETH) exchange-traded fund (ETF) filings in the United States, which has sparked renewed optimism for the second-largest cryptocurrency.\n\nTLDR\n\nPEPE and MOG reached new all-time highs, driven by optimism surrounding the approval of ether ETF filings in the U.S.\n\nTraders are treating these meme coins as beta bets, a way to gain exposure to Ethereum through related tokens.\n\nTrading volumes and open interest for PEPE and MOG futures have increased significantly, indicating new money entering the market.\n\nDespite the surge, the long-to-short ratio for PEPE suggests that many traders are betting against further price rises.\n\nMog Coin, launched in July 2023, has gained traction as the “internet’s first culture coin” and has seen a 75% increase in the past week.\n\nTraders are increasingly viewing these meme coins as beta bets, a way to gain exposure to Ethereum by investing in related tokens. PEPE, a frog-themed token, jumped 11% in the past 24 hours, while MOG, a cat-themed token, skyrocketed by 45% over the same period.\n\nThe trading volumes for PEPE across spot and futures markets hit an impressive $1.8 billion, significantly higher than the usual range of $400-600 million.\n\nThe surge in these meme coins comes as Ethereum itself has risen nearly 5%, outpacing the gains of other major cryptocurrencies. Bitcoin (BTC), in contrast, shed 1% during the same time frame.\n\nFutures data for PEPE and MOG reveals that open interest in these instruments has increased substantially. PEPE’s open interest rose from $550 million last week to $720 million, while MOG’s open interest climbed from $5 million to $8.3 million. This rise in open interest is generally considered a sign of new money entering the market, which could lead to further price volatility.\n\nHowever, not all traders are convinced that the rally in these meme coins will continue. The long-to-short ratio for PEPE is currently skewed in favor of bears at 54%, indicating that many traders are betting against further price increases.\n\nMog Coin, launched in July 2023, Known as the “internet’s first culture coin,” Mog Coin started as a fun meme among friends but quickly gained traction.\n\nThe token’s name, “Mog,” is derived from “AMOG,” signifying an alpha male group, while its brand symbol, the joycat, represents community adaptiveness and a carefree attitude.\n\nOver the past week, Mog Coin has risen 75% and currently trades at $0.0000009066 with a market capitalization of $355 million. The token has a maximum supply of 420 trillion, with 93% already in circulation."
    }
]