[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE9mdTFjTC0wOENRbWR4WnYyaEIxVTFKYVc4dHIxVno2NGtmVFE2eWduYWFSZ2V5MExpdmxkbjVLTl9GZVRwd0VpbDhIZ3hJVFV5c2VqUW9ZNTQ3eWdoYUtpMFRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs start trading Tuesday. Here’s what you need to know. - Fortune",
        "content": "New spot ETFs for Ethereum—which will let investors purchase the second most popular cryptocurrency in the form of stocks— are expected to begin trading on Tuesday, July 23. The Securities and Exchange Commission has green lit at least three funds to enter the market that day, sources told Reuters, although it’s believed that a total of eight Ethereum ETFs will launch simultaneously.\n\nThe instruments follow in the footsteps of the eleven trading spot Bitcoin ETFs. Having accumulated over $54 billion in assets under management since launching in January, Bitcoin has soared 47% this year. Here’s all you need to know about their Ethereum counterparts.\n\nWhat is a spot Ether ETF?\n\nEther is the native cryptocurrency of the Ethereum blockchain. Despite the SEC’s reservations, Ether is legally considered to be a commodity, but the corresponding ETFs will be securities.\n\nETFs first came to market in 1993. The funds pool together a basket of securities, such as a handful of different energy stocks, and the price aligns with the indexes that it tracks. They are listed on exchanges and can be traded during market hours, thus operating like stocks.\n\nSpot Ether ETFs will track the spot—or current—price of Ether. The products give investors access to the underlying crypto without the need to own a crypto wallet. The ETFs will be set up as grantor trusts, meaning investors will own a share of the Ether held by the trust.\n\nWho issues them and what are the fees?\n\nEight asset managers are proposing to offer Ethereum ETFs: BlackRock, Ark Invest/21Shares, VanEck, Grayscale, Fidelity, Bitwise, Franklin Templeton and Invesco/Galaxy Digital. Each instrument will be near-identical, so the fees charged to investors are competitive. For now, we know that Franklin Templeton will charge 0.19%, VanEck at 0.20%, and Invesco and Galaxy Digital will charge a 0.25% fee for its jointly filed ETF.\n\nThe full list of fees will be revealed when the final registration statements, or S-1s, are submitted to the SEC. This will be on Tuesday, if trading begins for all eight.\n\nWhere can I access them?\n\nThey will be listed on the Nasdaq, Chicago Board Options Exchange (CBOE) and New York Stock Exchange.\n\nWhy would someone buy an Ethereum ETF?\n\nBitcoin and Ether tokens represent units of ownership—and thus value—of an underlying blockchain. Beyond that, they are very different.\n\nWhereas Bitcoin may be a long-term hedge against inflation, Ethereum is closer to a tech investment. The blockchain’s main premise is “to remove the intermediary and allow for 24/7 uptime in financial services, such as trading and lending, in addition to tokenization, digital collectibles, and digital identity,” Vetle Lunde, senior analyst at K33 Research, told Fortune.\n\nWhile for now crypto markets are tightly correlated, this may not always be the case, he adds. So, Ether ETFs allow investors to diversify which corners of the crypto economy they want to invest in.\n\nWill their popularity match the spot Bitcoin ETFs?\n\nDemand for the funds will be 20% that of the spot Bitcoin ETFs, James Seyffart, Bloomberg’s ETF analyst, told Fortune. This prediction is because the market capitalization of Ether is about one-third of the size of Bitcoin. Plus, he adds, the ETFs will lack a key benefit of holding Ether: Investors will not be allowed to stake, which generates yields. But, even at this smaller size, they would be “extremely successful” by any ETF launch standard, says Seyffart. Similarly, K33 Research predicts that during the first six months of trading, inflows will be $4 billion—a quarter of the spot Bitcoin ETFs.\n\nWhen judging their success, it’s key to evaluate performance after six months of trading, rather than simply on “game day” and the initial weeks, Leah Wald, CEO and president of Cyberpunk Holdings Inc., told Fortune. Launching in summer, they’re coming to market when trading is typically “more muted,” she points out. Plus, success should also be judged on volume and spread, rather than simply inflows, as the health of these metrics foreground AUM growth down the line, she adds, as investors feel safe allocating dollars into these new securities.\n\nWho will be investing in them?\n\nInstitutional investors, such as hedge funds, pension funds, banks and endowments. Retail investors will also access them, either by buying them directly, or through portfolio allocations via wealth advisors. The latter group will likely dominate the first six months of trading, as the Q1 13Fs for the spot Bitcoin ETFs reveal that over 80% of total AUM was from non-professional investors.\n\nHow will the ETFs impact the crypto market?\n\nIf K33’s prediction of $4 billion in inflows over six months is accurate, at current prices, this would mean 1% of Ether in circulation would be absorbed by the ETFs by the end of the year. This absorption is “well positioned” to strengthen Ether’s price in the second half of the year, says Lunde.\n\nThe inflows would also be bullish for the wider market, history suggests. The fresh capital flowing into Bitcoin via the ETFs have boosted the crypto market cap by 46% in 2024, according to K33. Lunde anticipates the products “could further expand the broad market strength” as they enable sidelined capital to enter the market. Plus, Bitcoin ETF investors have “have proven to handle volatility with grace, and flows have been solid even during deep corrections,” says Lunde, suggesting ETFs can open up the market to new investors committed to the long-term.\n\nLastly, as BlackRock, a behemoth of traditional finance, is issuing one of the funds, this shows the firm is diving deeper into crypto. This grants the industry a “solid and well-needed stamp of approval,” he says."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQYWlZWnF4T2NpQW1wQk9PSm80NEhpTExCTTBUQkEwMmpZbk9tM01TUjNDdjBEUUVKSkRGSlVCUHZ1ZVVFbjB1azdSZzR1SWsyTFlmcmtOcmUybHhXb193c29HRlVENXY2WXRKUVlXck12bndjc0xsc2VVUTNZR3JIcnY2cFUwZ2xHakw5b3dVUVhuQ2hidzZkOUNEbE83elF0NHpHTHhwb0w1Rmp1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Bitwise predicts Ethereum ETFs will trigger 50% surge to new all-time high over $5k - CryptoSlate",
        "content": "Bitwise CIO Matt Hougan predicts that the upcoming spot Ethereum ETFs will drive the digital asset’s value to new all-time highs, surpassing $5,000.\n\nIn a June 16 note to investors, Hougan wrote:\n\n“By year-end, I’m confident the new highs will be in. And if flows are stronger than many market commentators expect, the price could be much higher still.”\n\nHowever, Hougan mentioned that ETH’s price might not rise immediately after the ETFs launch next week because “money may flow out of the $11 billion Grayscale Ethereum Trust (ETHE) after it converts to an ETP.”\n\nStill, Hougan emphasized that spot ETFs usually generate new demand for commodities like ETH. He referenced the launch of similar products for Bitcoin, which led to a price increase of around 25% since January 11 and about 110% since October 2023, when the market began anticipating their approval.\n\nWhy ETH could reach a new high\n\nHougan outlined three structural reasons why the inflows into spot ETH ETFs will have a more significant impact than they did for BTC.\n\nFirst, he claimed ETH’s short-term inflation rate is 0%, unlike Bitcoin’s 1.7% when its ETFs began trading. This means BTC needed “$16 billion of Bitcoin buying per year just to tread water.” With ETH, the situation differs as “people using Ethereum-based applications—everything from stablecoins to tokenized funds—consume ETH as well.”\n\nHougan highlighted the correlation between “the amount of ETH being consumed” and network activity, noting it presents “another lever of organic demand working in [ETF] investors’ favor.”\n\nFurthermore, Hougan pointed out that Ethereum’s price does not have to deal with the threat of “miners’ selling” because its stakers do not need to sell before making profits. ETH stakers are investors who have locked up a certain amount of their coins to help the network operate smoothly.\n\nHe wrote:\n\n“A key difference between Bitcoin mining and Ethereum staking is that staking does not have significant direct costs. As a result, Ethereum stakers are not forced to sell the ETH they produce. Even if Ethereum’s inflation rate rises above 0%, I do not expect significant selling pressure from stakers.”\n\nAdditionally, Hougan pointed out that approximately 40% of the Ethereum supply is locked in staking and smart contracts, making it unavailable for sale.\n\nSo, Hougan reiterated his prediction that ETH ETF assets under management could reach $15 billion within their first 18 months of trading and concluded that:\n\n“ETH is currently trading at ~$3,400, just 29% below its all-time high. If the ETPs are as successful as I expect—and given the dynamics above—it’s hard to imagine ETH not challenging its old record.”\n\n[Editor’s Note:\n\nData from ultrasound money shows that Ethereum’s inflation rate is now above zero percentage, coming in at 0.466% over the past 24 hours and 0.595% over the past 30 days. However, since The Merge it has recorded a negative 0.136% inflation due to ETH being burned through transaction fees, making it deflationary over 1 year and 306 days.\n\nHougan’s argument regarding Ethereum’s inflation ultimately relies on the network’s consumption. High transaction numbers lead to high amounts of ETH burned and, thus, lower inflation. Yet, the surge in layer-2 usage due to lower fees has resulted in fewer mainnet transactions over the past few months, thus pushing Ethereum back into inflationary territory.]\n\nMentioned in this article"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNV3RGU28xS2JVWWFPRnlCNTM0T1dMVnVURlNWZG50enpHZDdJdTVlQm5yMklLaG5fYkJmVDJER1VhTlZtdVZuLXNyeXN4QVR4SThSSW9JRXB3dEtIbm4tWXNZUHV0UWhPVGo3LTQ2dXFBVnNDU3FSMnE0anRwTkNOMW1PM2RlUC1BTWdXcXh5Mm00VWlVYVNWZURVTWXSAaIBQVVfeXFMTkRVY09LZ1lyLU5aYldEZHhGYlRfR2xGNFp1RDZBMjRRTG9XTDMxNjZ5TGtrV08yYzZGSXNhUnlIa0VkeHRobFFTZDYtOG81c2owSTRDY3l4Z3pONnlpZThwQzZDSlp6aUc4X2c4X2NKWThRbWFpWGlnQ0VfZkhsS1F2bjdYaUN1b204NlNJSEJtZzBpTXVtcXB5aTR1X0pfMVR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum co-founder warns against voting only on 'pro-crypto,' a day after a16z founders support Trump - CNBC",
        "content": "Ethereum co-creator Vitalik Buterin on Wednesday cautioned against voting for political candidates based solely on whether they have adopted a \"pro-crypto\" stance.\n\n\"The game of politics is much more complicated than just 'who wins the next election', and there are a lot of levers that your words and actions affect,\" Buterin wrote in a blog post that warned even Putin and the Russian government had \"expressed willingness to become 'open to crypto.'\"\n\nButerin's post comes as Donald Trump, who has positioned himself as the pro-crypto candidate for president, rallies members of his party at the Republican National Convention in Milwaukee, and a day after venture capitalists Marc Andreessen and Ben Horowitz told employees of Andreessen Horowitz (a16z) that they plan to make significant donations to political action committees supporting Donald Trump's campaign.\n\nIn an episode of \"The Ben & Marc Show,\" which features the a16z co-founders, Horowitz said that the Joe Biden administration, in the form of the U.S. Securities and Exchange Commission and the Federal Deposit Insurance Corporation, has \"fought\" them every step of the way by \"using very nefarious means.\"\n\n\"They've sued I think over 30 of our companies,\" added Horowitz. \"They're losing almost all these lawsuits, but the problem is that when you're a startup you don't have the money to fight the U.S. government and so they're kind of nuking the industry in that way.\"\n\nFairshake, a super PAC backed by crypto's top companies, is now one of the top-spending PACs in this election cycle. Of the $160 million in total contributions it has raised, 94% can be traced back to just four companies: Ripple, Andreesen Horowitz, Coinbase and Jump Crypto.\n\n\"There is a particular style of being 'crypto-friendly' that is common to authoritarian governments, that is worth being wary of. The best example of this is, predictably, modern Russia,\" added Buterin, a Russia-born coder who built ethereum in his late teens.\n\nTesla chief Elon Musk and venture capitalist Peter Thiel, as well as crypto leaders like Tyler and Cameron Winklevoss have also endorsed Trump.\n\nIn early June in San Francisco, technologists, crypto executives, and venture capitalists paid up to $300,000 per ticket to join a Trump fundraiser that ultimately raised more than $12 million.\n\n\"In particular, by publicly giving the impression that you support 'pro-crypto' candidates just because they are 'pro-crypto', you are helping to create an incentive gradient where politicians come to understand that all they need to get your support is to support 'crypto,'\" continued Buterin, who is known for periodically posting longer essays opining on existential threats to the ecosystem writ large.\n\nButerin did not single out any names in his post of either political candidates, or of those opting to support them.\n\nTrump — who launched his latest non-fungible token collection on the solana blockchain in April — has been making increasingly bullish comments on crypto.\n\nHe is accepting digital currency donations and has pledged to defend the rights of those who choose to self-custody their coins, meaning that they don't rely on a centralized entity like Coinbase to hold their tokens and instead, do it themselves in personal crypto wallets, which are sometimes outside the reach of the Internal Revenue Service. Trump also vowed at the Libertarian National Convention in Washington in May to keep Sen. Elizabeth Warren, D-Mass., and \"her goons\" away from bitcoin holders.\n\nMeanwhile, following a meeting with bitcoiners at Mar-a-Lago with about a dozen mining executives who pledged cash and votes to him, Trump declared that all future bitcoin will be minted in the U.S., should he return to the White House.\n\nOn Monday, the Republican presidential nominee added Ohio Senator JD Vance to his ticket as vice president — a move viewed by many as a net win for the crypto sector. Vance has advocated for looser regulation of crypto and disclosed in 2022 that he personally holds bitcoin .\n\nIt comes in stark contrast to the Joe Biden White House, which has been seen as hard on crypto. Under President Biden, the SEC has dialed up actions on the sector, and even in the absence of hard-and-fast rules from Congress, the U.S. has proven to be one of the most active enforcers of penalties and legal enforcements against crypto companies.\n\nThe angrier the crypto industry got at the SEC for arresting and prosecuting them, the more people like Vance saw a chance to stake out a position on the opposite side of a crypto-skeptical Biden administration.\n\nHowever, the perception that Biden is anti-crypto and Trump is pro-crypto has some Biden allies concerned enough to take their case directly to senior White House officials.\n\nTrump is set to headline the Bitcoin 2024 conference in Nashville, Tennessee on July 27."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9lQ2Q3UTVDVUFnaThJcDl1Mm9uUUhZbkJxQVRzSS1zMW9RQXVDeDEtdzBJNWlvcXYzRkEyUzVXWGFBcGpBTkZhTmxYRTBqQmhzM3B2TFNINUFkcFlyVlhUS0JEdFBZZ1pNazFNeTNoMW14YTFx0gF8QVVfeXFMTWt6by1jQUZ1NEFTWExzQmViNXA2b3U5cE9LNUgxQ2haelNva2NtWkhZSHJNQ2hqSzBDYzFNeXZkeVZBWkhFYjc4bUM1ZTZPSXNscllmbFhRR1N3LW1zZFFHYWRrdFNBckNZZ0k4VHlfTjhla2N5VHBvV1VITg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Ethereum Mini ETF Gets Green Light From the SEC - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Securities and Exchange Commission has approved crypto asset manager Grayscale's mini Ethereum exchange-traded fund (ETF).\n\nThe green light came on Wednesday, along with approval for asset manager ProShares' Ethereum ETF.\n\nThe SEC had unexpectedly said yes in May to proposals from Grayscale and a long list of other asset managers to launch spot Ethereum ETFs.\n\nGrayscale's initial proposal was to convert its longstanding Grayscale Ethereum Trust into a spot Ethereum ETF. That crypto fund currently operates like a closed-end fund, where it is harder to redeem shares.\n\nAD\n\nAD\n\nIt then filed for its mini trust, which would be seeded with assets currently backing the bigger ETF.\n\nBloomberg Intelligence ETF analyst James Seyffart said on X (aka Twitter) that the mini fund “should help alleviate some of the likely Grayscale outflows” anticipated from the conversion of the larger fund.\n\n“Grayscale is excited to share that the SEC has approved Grayscale Ethereum Mini Trust's Form 19b-4,” Grayscale said in a statement to Decrypt. “The Grayscale team continues to engage constructively with SEC staff, as we seek full regulatory approval for U.S. spot Ethereum ETPs, and we will share more information, as appropriate.”\n\nSeyffart predicted that the fund would now likely start trading alongside the other products next week. Sources on Monday confirmed to Decrypt that the Ethereum ETFs would likely start trading on July 23.\n\nAD\n\nAD\n\nIn a landmark moment for the crypto industry last year, a judge sided with the firm in a lawsuit, agreeing with the firm that Wall Street’s biggest regulator lacked a coherent explanation for denying its proposed conversion to a Bitcoin ETF after years of denials.\n\nThe ruling paved the way for the SEC to give the green light to spot Bitcoin ETFs.\n\nIn January, the SEC approved Grayscale's proposal to convert its Bitcoin Trust into a Bitcoin ETF. Grayscale also has a mini Bitcoin ETF with lower fees than its flagship Bitcoin product.\n\nThe fees for the forthcoming Ethereum mini ETF have not been disclosed.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPVTMtcmRZczMxX3VrRkNLTEMtSXJ6TDhEcm9GM0JZMGVUSGtPWWRvbXdnSDZwR3pVR3ZPdW0zbWl5Tjd1Q3FVOUVzdzBpdnJSRGxTajU2Z1ZuNVZlYTN1eGZ1ZHMyVHktTG9YMzNvRDdFNk8xbFVJVEJjTjlMc21PREFseUpPOEIwRGZOODRPYzBTcVBCZHplVVNoM2d3VEpZbGVnN1J3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Could Outperform Bitcoin with Upcoming ETF Launch: Kaiko - Crypto Times",
        "content": "A new report from Kaiko suggests that Ethereum (ETH) might perform better than Bitcoin (BTC) once Ethereum exchange-traded funds (ETFs) launch in the United States.\n\nThe report focuses on the ETH to BTC Price Ratio, a key metric that measures the amount of Bitcoin required to purchase one Ethereum.\n\nRight now, this ratio stands at 0.05, marking an increase from the 0.045 before the Securities and Exchange Commission (SEC) approved spot Ether ETFs. This increase hints that Ethereum is getting stronger compared to Bitcoin.\n\nThe report also points out Ethereum’s low market depth. Market depth tells how easy it is to buy or sell an asset without causing big price changes. Low market depth means that large trades could cause bigger price swings, potentially helping Ethereum’s price to rise.\n\nAnother important factor is the Ethereum Exchange Reserve, which tracks how much Ether is available to buy on exchanges. According to the report, this reserve is at its lowest in years, which could mean a supply shortage is coming. As institutional investors try to fill their new Ethereum ETFs, this low supply could push prices much higher.\n\nAdditionally, the launch of spot Ethereum ETFs is generating considerable anticipation in the cryptocurrency space. According to Bloomberg’s analyst James Seyffart, the SEC has requested applicants to submit amended S-1 forms by July 16, potentially setting the stage for a July 23 launch date."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNTmtfUEpZSnBoTllmdmFlR1BtRG9VbWFoZUstQnJGcDVlOTE3d0QyYlIyczNVMDZuaF9XT0NPS1JqUVE3NW84ZU5vWmJHcUlrbnRYUXRRQnVmekhWNlloLURzMVVYa09vbFh6LUZKUzR3MUtCRVR4SXRZNWlqaDNBVlNPRy1xOXhjRW1ndmJDUzRRaU5uSGRTUWVpNUcwNXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Fees for Spot Ethereum ETF 10 Times Higher Than Competition - Unchained",
        "content": "Grayscale will charge a 2.5% fee for its main spot ether ETF, which will be converted from the Grayscale Ethereum Trust (ETHE).\n\nAs spot Ethereum exchange-traded fund (ETF) issuers gear up for a potential launch day next week, one issuer is employing a vastly different strategy than the rest.\n\nCrypto investment manager Grayscale Investments revealed in a filing that it plans to leave fees at 2.5% after converting its Grayscale Ethereum Trust (ETHE) into a spot ether ETF. This means that fees on ETHE will be 10 times higher than the eight other ETFs (except for ProShares, which is yet to disclose fees on its Ethereum ETF).\n\nGrayscale is rolling out another spot ether-based fund – the Grayscale Ethereum Mini Trust (ETH) – which it will seed with 10% of ETHE’s assets as soon as it launches. Based on ETHE’s current AUM, that equates to over $1 billion worth of liquidity for the Ethereum Mini Trust.\n\nGrayscale revealed that it will charge 0.25% fee, with an initial fee of 0.12% for the first 12 months or until the fund reaches $2 billion in assets under management (AUM) for the mini trust. Still, with other issuers charging similarly competitive fees, it remains to be seen whether this will work in their favor.\n\nBlackRock and Fidelity plan to charge a 0.25% sponsor fee on their funds, with BlackRock charging an initial fee of just 0.12% for the first $2.5 billion or 12 months, and Fidelity waiving the entire sponsor fee until the end of the year.\n\nBitwise and 21Shares will charge a fee of 0.20% and 0.21% respectively, but waive this amount entirely for the first six months or until the fund’s AUM hits $500 million.\n\nVanEck will also charge a 0.21% fee, with a fee waiver period of 12 months or until the first $1.5 billion in assets, and Franklin Templeton will charge a 0.19% fee, waiving the amount until the first $10 billion in assets or Jan. 31, 2025. Invesco Galaxy will charge 0.25% fee and will not include a fee waiver.\n\n“I’m not sure what Grayscale’s strategy is here. Feels like they started with the right idea, then it got botched somewhere along the way,” said Scott Johnsson, a general partner at Van Buren Capital.\n\n“Investors selling ETHE are probably not going to be charitable with your mid-price mini option after you stick them with a 10x fee and force them to realize gains.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPa0hVVXVzbEl6YnkzOW1IeGpBN3BuWVJBYU9Ma251Qi1yNkRydTlMTkhob1FTX2NMYkZVMFFnUDJSMXV1N2VWbjVEeENBamZMaFl5Q3I0dmo4WW9zQUV2Z0ZjMGpJb2lQMHNNOTFaWEdQQTJqZW9BWFRlMkdJMUdzcmdnUmp5YUp2VkV1SmVpWDc0WXd4eDRfZ240WDV4OXNHNTRqMzlIWEZKM3d5Z0JxWHk4d2NQYVhsYmZwZl9VNnVTVmgxem1FSHF2LUlMcWF3WkRVMUZEbGdmZ3p4QlNYa1BCR25sc1hy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Insights into the price fluctuations of the cryptocurrency ethereum - St. Louis Post-Dispatch",
        "content": "Lee Enterprises newsroom and editorial were not involved in the creation of this content.\n\nEthereum is considered the second most popular cryptocurrency after Bitcoin. Ethereum's price has had its share of highs and lows. Why does its price change so much, and how can investors navigate these ups and downs?\n\nA Bit of Background - What Is Ethereum?\n\nEthereum is not just a digital currency. It is a platform that allows developers to build and run applications without a central authority (like a bank or the government). This makes it different from Bitcoin, primarily a digital form of money.\n\nThe currency used on this network is called Ether (ETH). Since its launch in 2015, Ethereum has become the backbone of many innovative technologies, including decentralized finance (DeFi) and digital collectibles known as non-fungible tokens (NFTs).\n\nEthereum's Price History\n\nEthereum's price has seen its share of highs and lows. When it first launched, Ether was priced at about $0.30. By early 2018, during intense interest in cryptocurrencies, its price skyrocketed to around $1,400. However, this boom was followed by a severe crash, which brought the price down to around $80 by the end of the year.\n\nDespite these fluctuations, Ethereum has shown resilience. In 2021, it reached new heights, surpassing $4,000, likely due to the rising popularity of DeFi and NFTs. These technologies primarily rely on the Ethereum network, which results in an increased demand for Ether.\n\nWhy Does Ethereum's Price Fluctuate So Much?\n\nSeveral factors contribute to Ethereum's price fluctuations:\n\nMarket Sentiment: Like the stock market, cryptocurrency prices are heavily influenced by people's thoughts and feelings. Joyous news, such as a big company starting to use Ethereum, can drive the price up. Negative news, like a hack or stricter regulations, can cause the price to drop.\n\nLike the stock market, cryptocurrency prices are heavily influenced by people's thoughts and feelings. Joyous news, such as a big company starting to use Ethereum, can drive the price up. Negative news, like a hack or stricter regulations, can cause the price to drop. Technological Developments: Ethereum is constantly being updated and improved. Progress or delays in these updates can also affect Ether's price.\n\nEthereum is constantly being updated and improved. Progress or delays in these updates can also affect Ether's price. Network Usage: The more people who use Ethereum for transactions, smart contracts, and applications, the higher the demand and price of Ether will typically be.\n\nThe more people who use Ethereum for transactions, smart contracts, and applications, the higher the demand and price of Ether will typically be. Competition: Other cryptocurrencies like Binance Smart Chain, Cardano, and Solana offer similar features to Ethereum but often with lower fees and faster transactions. This competition can influence Ethereum's market share and price.\n\nNavigating the Ups and Downs\n\nFor those considering investing in Ethereum, below are a few tips to navigate its price volatility:\n\nThink Long Term: If you believe in Ethereum's future potential, holding onto your investment through its ups and downs might be a good strategy.\n\nIf you believe in Ethereum's future potential, holding onto your investment through its ups and downs might be a good strategy. Stay Informed: Keep yourself updated on news and developments related to Ethereum. Understanding what's happening in the market can help you make better investment decisions.\n\nKeep yourself updated on news and developments related to Ethereum. Understanding what's happening in the market can help you make better investment decisions. Use Risk Management Tools: To protect yourself from significant losses, consider using tools like stop-loss orders, which automatically sell your investment if the price drops to a certain point.\n\nEthereum's price volatility can seem intimidating. However, understanding the factors that drive its price changes and adopting a thoughtful investment approach can help investors best navigate its ups and downs.\n\nThis information is intended for educational purposes only and is not to be used as investment advice. As with all investments, there is risk, and the past performance of a particular asset class does not guarantee any future performance. Any claims, recommendations or errors are the contributor’s own, and the reader is responsible for evaluating all information contained herein."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxORTk1Vl9tblZwV0JhUXV4Yk1odGFkbWgtQ1N4TGllOExhQVdUYk9jTHVnSmRQdWQtVDlwRERPbnJGNkhaaVgtRFY4aEpGN2huWXl1U2ZGUHN0T3ZWVmE2TVFHS0VpN1hSYkdOZGlDcVlNTS16Qkh2N0dHSzFIb09JbGNfVWw3dmREeVlsYU8teUctUkpGUzVmX2l4RWw1ZWg5TEVkcjNoMWVRRXIzbTlEUzdJQXFiOHR6X0l6bmVHME5ELXJXSS02VGFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum co-founder's warning against 'pro-crypto' candidates: 'Are they in it for the right reasons?' - TechCrunch",
        "content": "Vitalik Buterin, the co-founder of Ethereum, issued a warning on Wednesday against choosing a candidate purely based on whether they claim to be “pro-crypto.” In a blog post, Buterin said it’s more important to scrutinize a candidate’s broader policies to ensure they support cryptocurrency’s underlying goals, including internationalism and protection for private communications.\n\n“If a politician is pro-crypto, the key question to ask is: Are they in it for the right reasons?,” wrote Buterin. “Do they have a vision of how technology and politics and the economy should go in the 21st century that aligns with yours?”\n\nThough Buterin does not mention any politicians or crypto investors by name, his comments come just one day after Marc Andreessen and Ben Horowitz threw their support behind former President Donald Trump in the 2024 Presidential election. The founders of Andreessen Horowitz noted on their podcast yesterday that Trump’s crypto regulation plan is “a flat-out blanket endorsement of the entire space.” The influential venture capitalists join the ranks of other notable Silicon Valley players, including Elon Musk, who endorsed Trump in the last week.\n\nFurther, Ethereum’s co-founder made the case that signaling you broadly support any “pro-crypto” candidates could incentivize politicians to promote the cause in bad faith. Buterin notes that authoritarian leaders, particularly in Russia, have claimed to support crypto in an effort to consolidate power.\n\n“It doesn’t matter if they also support banning encrypted messaging, if they are a power-seeking narcissist, or if they push for bills that make it even harder for your Chinese or Indian friend to attend the next crypto conference — all that politicians have to do is make sure it’s easy for you to trade coins,” said Buterin.\n\nThe co-founder of Ethereum suggested to look into a “crypto-friendly” politician’s views on crypto five years ago. He says this can serve as a guide for whether the politician may reverse their position five years in the future.\n\nNotably, former President Trump starkly opposed decentralized tokens five years ago. In a tweet from July 2019, Trump said he’s “not a fan of Bitcoin and other Cryptocurrencies, which are not money.” In a follow-up tweet, he said “we have only one real currency in the USA,” referring to the United States dollar.\n\nBut in May, Trump completed a total flip-flop on his stance regarding cryptocurrencies, becoming the first major presidential candidate to accept bitcoin donations. The Wall Street Journal reports that Trump’s crypto fundraising efforts have collected $3 million worth of donations in the second quarter."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQTy1lWk1Mak5IOEVlTEpzbFdydHNLTmZFSS1Wd0M3MUt4QzIwcmxaWlFVUzBjeG9BZmRGS09MUFBtNXlDX2gxcnpoeWJ4TXdjdzFZa3dIX0ZZYURfOUM3TlA0VlY1cWwxNFBvX09GUDYyR1VWdlBoXzRCMGlUOVhtb3ZCMVRodW9HN1hRSVNVZHNBVWtvRVoyWmlRLU5jQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Bitwise CIO lists three reasons why Ethereum will hit record after ETF launch - DLNews",
        "content": "Ethereum ETFs’ launch will catapult its price to new heights, expert says.\n\nThe cryptocurrency’s staking feature plays a key role in its prices.\n\nBitwise CIO expects $15 billion in inflows over the next 18 months.\n\nWith spot Ether exchange-traded products set to hit markets next Tuesday, one expert says Ethereum will hit a new all-time high soon after.\n\nMatt Hougan, Bitwise’s chief investment officer, said there are three reasons why Ethereum will rise above $5,000 after the ETFs start trading.\n\nUnlike Bitcoin, Ethereum’s slow supply growth, lack of miners, and staking will pay serious dividends and enable the new ETFs to outperform Bitcoin funds, Hougan said in a new investor note.\n\nHe has previously estimated that investors will pour $15 billion into spot Ethereum ETFs in their first 18 months of trading.\n\nEthereum supply slows\n\nMost cryptocurrencies are inflationary, meaning more are created and sold on the market over time.\n\nBitcoin does this, but the amount that will ever exist is capped at 21 million.\n\nEthereum is also inflationary, but a technical feature that slows this process was added three years ago.\n\nThe burn feature destroys a small portion of Ether with every transaction.\n\nJoin the community to get our latest stories and updates\n\nWhen people swap, trade, or lend on the Ethereum network more frequently, more Ether can be destroyed than produced.\n\nAccording to data from Etherscan, the net amount of Ether hitting the market has been nearly zero as of September 2022.\n\nThe network produces an equal amount of Ether as the burn feature destroys.\n\nThe total supply growth of Ethereum since 2015. Source: Etherscan. The total supply growth of Ethereum since 2015. Source: Etherscan. (Etherscan/Etherscan)\n\nHougan said this slowed growth and the launch of a new demand source will increase Ethereum’s price.\n\nThere’s less Ethereum on the market, and with the launch of Ethereum ETFs, many Wall Street firms will start buying it for their products.\n\nMore demand translates to higher prices.\n\nMiners aren’t stakers\n\nBitcoin mining is an industry that demands enormous resources, from electricity costs to high-end machines. Miners regularly sell the Bitcoin they mine to pay these costs.\n\nThis isn’t the case with Ethereum stakers.\n\nEthereum operates a proof-of-stake consensus algorithm. This means it doesn’t require an industrial-grade mining operation to keep it secure.\n\nInstead, users must lock up 32 Ether, which is worth roughly $111,000 today, and become validators who secure the network.\n\nValidators are paid in newly created Ethereum to prevent fraudulent transactions on the network.\n\nRunning a validator is far less expensive than running a profitable mining outfit. This means there is less need to sell Ethereum to continue operating.\n\n“In the short term, there is simply less forced selling each day in Ethereum than in Bitcoin,” said Hougan.\n\nStaked and off the market\n\nMore than 33 million Ether are staked today, nearly 28% of the entire cryptocurrency’s supply, according to a Dune dashboard by analyst Hildobby.\n\nMore importantly, says Hougan, this is Ether that’s not moving soon either, as they are locked up for a set period, meaning it cannot be withdrawn or sold.\n\n“Currently, 28% of all ETH is staked, meaning it is effectively off the market,” Hougan said\n\nThe combination of low inflation, fewer sellers in Ether stakers, and millions of Ether off the market make the proposition of an ETH ETF especially bullish, said Hougan.\n\n“If the ETPs are as successful as I expect — and given the dynamics above — it’s hard to imagine ETH not challenging its old record.”\n\nCrypto market movers\n\nBitcoin is up 3% over the past 24 hours to trade at $65,000.\n\nEthereum is up 1.8% to $3,476.\n\nWhat we’re reading\n\nLiam Kelly is a DeFi correspondent at DL News. Got a tip? Email at liam@dlnews.com."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPcWtRYjVaTHJ6OXhfbnNVQlNhRFZSZ3ZNd0UzTHcxUFdhUFFqQ1BCZnVhalg4WjdPTEVTbWVhMEdpaTJGS2ZWZFdfdW80Q1lqdDJaem9NeFB0Mkd4U3ZhMmdBVUxPWXFrSjd5Vk1fRGJubkNIRkRybDVpMWFaQ21EWnUzOU1KRm45VjY2RnpOZ0FuRUdMV2RGZHJGODJoOTF2T3l2SVBRTVhTY1Z5VEg4OXoyWG5KS19sV0V3d1Q1VldBUzRfRW5tdUJ3LVBqanF6?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Bitwise CIO Matt Hougan: Ethereum To $5,000 In 2024 And $15B In ETF Inflows - Benzinga",
        "content": "Matt Hougan, Chief Investment Officer at Bitwise Asset Management, has outlined three key reasons why he believes Ethereum ETH/USD will reach a new all-time high following the launch of spot Ethereum Exchange-Traded Products (ETPs).\n\nWhat Happened: Hougan predicts that by year-end, Ethereum’s price will surpass its previous record of $5,000, driven primarily by ETP inflows.\n\nHe bases this forecast on three structural factors that differentiate Ethereum from Bitcoin BTC/USD:\n\nEthereum’s Lower Short-Term Inflation Rate: Unlike Bitcoin, which had a 1.7% inflation rate when its ETPs launched, Ethereum currently has a 0% inflation rate. This balance between new ETH creation and consumption through network activity creates a favorable supply-demand dynamic for price appreciation. Reduced Selling Pressure from Validators: Ethereum’s proof-of-stake system doesn’t require validators to sell ETH to cover operational costs, unlike Bitcoin miners who often need to sell newly mined coins. This results in less forced selling pressure on the Ethereum market. Significant Portion of ETH Supply Locked: Approximately 28% of all ETH is currently staked and unavailable for sale. An additional 13% is locked in decentralized finance smart contracts. With about 40% of the total supply off the market, there’s potential for increased scarcity and price pressure.\n\nAlso Read: Donald Trump Comments On Crypto Pivot: ‘If We Don’t Do It, China Will’\n\nHougan anticipates that new Ethereum ETPs will attract around $15 billion in assets over their first 18 months.\n\nGiven these factors and Ethereum’s current price of approximately $3,400 (about 29% below its all-time high), he finds it difficult to imagine ETH not challenging its previous record.\n\nWhile Hougan expects some initial market choppiness due to potential outflows from the Grayscale Ethereum Trust ETHE as it converts to an ETP, he remains confident in his bullish outlook for Ethereum by the end of the year.\n\nThis bullish outlook for Ethereum comes at a pivotal time for the cryptocurrency industry, as market participants eagerly await regulatory clarity and potential ETF approvals.\n\nInvestors and industry leaders will have the opportunity to delve deeper into these topics and explore their implications at Benzinga’s Future of Digital Assets conference on Nov. 19.\n\nRead Next:\n\nImage: Shutterstock"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQWE1kUmk3MXN2ZENoanRIYkJfdXhmRGRsSUpYWk9XUFh2MnJ3ak82cGllQXRzMGRPX1F4NE5fTmFfZVhZckx0eTJJSGNWWW5aaDFlQnJicDJVVHhBUFQ5YnV5NGd0MDl1alMybS0yUlVsWWE5UThGbTl2SXBGNUFWbnRrVW9fWTNvMEhnbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "SEC Issues Final Instructions for Ethereum ETFs, Targeting July 23 Launch - Yahoo Finance",
        "content": "SEC Issues Final Instructions for Ethereum ETFs, Targeting July 23 Launch\n\nThe United States Securities and Exchange Commission (SEC) has reportedly requested the final submissions of Form S-1 from asset managers by July 16, according to Bloomberg analyst Eric Balchunas, the SEC. These final submissions must detail the fees issuers plan to charge for their crypto funds. As the market anticipates the launch of these Ether ETFs, Ethereum (ETH) has seen a surge in the past 24 hours, gaining 3.69%. It is currently trading at $3,458.\n\nThis move follows the SEC’s approval on May 23 of issuers' 19-b forms, which proposed rule changes to permit crypto-based investment vehicles. Now, asset managers require approval for their initial securities registration S-1 forms. The SEC is reportedly targeting to launch the new ETFs on July 23.\n\nSeveral leading financial institutions, including BlackRock, Grayscale, Fidelity, ARK 21Shares, Invesco Galaxy, VanEck, Hashdex, and Franklin Templeton, are in the race to secure approval and launch their Ether ETFs. Addressing regulatory concerns, some issuers have decided to exclude staking from their Ether ETF plans. This decision aligns with the SEC’s focus on ensuring these new investment products meet regulatory standards.\n\nFees for these Ether ETFs will vary among the different issuers. Invesco and Galaxy have set their management fees at 0.25%, which is slightly higher than those of VanEck and Franklin Templeton, who have disclosed fees of 0.20% and 0.19%, respectively. These fees are notably lower than the 2.50% management fees currently charged by Grayscale’s Ethereum Trust. Although Grayscale has announced plans to launch a new spot Ether ETF, it has yet to disclose the associated fees."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNbHNBY3A5ckdYWkFxRHFUSXZnZ3dUdUVxdWNseGhHbUsyVU1ST2p4X0FSaWhoYkhTZDhaZWE5NEJydld6QUIxTnZWczM5YVlMOTRMcGZ4UGRfbHN4Tm9oXzl3SDZLd0ptNk1jS1QyQXpWajd3YUVING15TWlYd19DSDFUTkw2OG5JWEhNVE5TTjZQQUhJV2o1aHdYd3lRekZFZUJ3QlNTNmg2aWhM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Bit Digital ‘thrilled’ by Ethereum ETFs but highlights their lack of staking features - CryptoSlate",
        "content": "Bit Digital expressed optimism around spot Ethereum (ETH) ETFs’ upcoming launch but drew attention to the funds’ lack of staking on July 16.\n\nThe company said it is “thrilled for the increased normalization and adoption” around Ethereum and the technology’s potential to reshape the financial system. Bit Digital also asserted that the ETFs could be a significant price catalyst for ETH in future months.\n\nHowever, Bit Digital drew attention to the funds’ limitations, noting:\n\n“It is important to note that the ETH ETFs won’t be able to stake and benefit from ETH’s full potential.”\n\nBit Digital referred to its website, which identifies the firm as the only publicly traded Bitcoin miner that stakes Ethereum. The company spends BTC mining rewards on ETH, which it stakes. It then redeploys ETH staking rewards to add sustainable Bitcoin miners, concluding the cycle.\n\nBit Digital also states that it is among the largest ETH holders of any Nasdaq-listed company, holding over 29,000 ETH ($100.4 million).\n\nThe company said its BTBT shares provide “exposure to the smart contract economy.”\n\nETF applicants dropped staking\n\nSeveral spot ETH ETF applicants attempted to accommodate ETH staking to their proposals around February. They intended to treat staking rewards as income for the fund.\n\nHowever, applicants removed staking plans from their applications to reportedly meet the SEC’s expected approval requirements around May. Spot ETH ETFs have since gained initial approval without allowances for staking.\n\nBloomberg ETF analyst Eric Balchans believes the SEC will grant issuers permission to launch the funds on July 22, allowing the funds to begin trading on July 23.\n\nMentioned in this article"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1WdXlxbjRmekEwaENMSkdCZ1BMdjlkTVI3Q0ZvQnVvNjhCUHRkV3NlUl9sVm5McDNZNG81R0NGLUp1WlJ5c24tZW9Jd2QxOXNtYkZsb1lyc2phQzU4QTByOHRHMXVQQl9DOUFocG9zU196TXVpa1dyNGR5NXN3NzTSAYcBQVVfeXFMT0FrS2xZd3UxWTAtSTEtbm9Jd2dzZXBrekZqZ2o5bW5FY2hqbnlwWm5qSjE3SzZuYU0zaEtiVnExMXFfQ0F0NXVub0poeEJlQ2dmTzhPcWMtUms5cGdrZ0dycFlZS0d5ZXBlRlpMSHVxbDliM1pvSkExOVcxLTBsbFQ4N053eXB3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Staking Near All-Time High as ETFs Loom and Rewards Rise - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe amount of Ethereum that’s currently staked within the network is near an all-time high as rewards for locking up ETH are on the rise—and just days before spot Ethereum ETFs are expected to begin trading in the United States.\n\nMore than 33.2 million Ethereum tokens (worth roughly $114 billion) were staked as of publication time, representing about 28% of the total ETH supply, Coinbase’s data shows. The growth in the total value of staked ETH coincides with a nearly 5% increase in the estimated reward rate for staking ETH over the past month.\n\nStaking Ethereum is the process by which ETH is locked up for a specified period of time to secure the proof-of-stake network. In exchange for locking up their tokens, ETH holders earn rewards from the network. The current estimated reward rate of Ethereum is 2.60%, according to Coinbase. That’s up from a 2.48% reward rate last month.\n\nEthereum staking has been on a steady rise, breaking the 30 million ETH mark back in February and hitting an all-time high mark above 33.4 million on July 12, per on-chain data curated by Dune.\n\nAD\n\nAD\n\nWhile staking rewards have drawn many Ethereum holders to lock up their tokens, the massive amount of staked ETH has drawn centralization concerns, given how much being staked to the likes of Lido—which commands 29% of all staked ETH—as well as Coinbase and others.\n\nEthereum is trading at $3,425, down 1% in the past 24 hours.\n\nEthereum ETFs near\n\nEthereum holders’ growing interest in staking also comes as investors expect a swath of spot Ethereum ETFs to receive final approval to launch in the U.S. this month.\n\nAs Decrypt previously reported, spot Ethereum ETFs are likely to get a green light from the U.S. Securities and Exchange Commission to begin trading on July 23, according to sources familiar with the matter. That’s just seven months after their Bitcoin equivalents clinched approval to begin trading.\n\nAD\n\nAD\n\nHowever, when spot Ethereum ETFs do launch, inflows could be modest, some analysts predict. A recent research report from Citi shows that spot ETH ETFs in the U.S. could receive just 30% to 35% of the net inflows their spot bitcoin counterparts received, with distribution skewed to the downside.\n\nStill, a rush of investor dollars into funds holding the token could be a boon for ETH holders. Bitwise Chief Investment Officer Matt Hougan said Wednesday that ETH's price could hit $5,000—a new all-time high—following the expected launches of several spot Ethereum ETFs later this month.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOd2FCd3pmNWRmRGR6TGxZR0dTRDh4MmFOdlEtVlV1UHAxTEJWbjl2eFFLTWlPZFJPT1ZQS2h1S1pZamZvSHpEQ0d6Skw2Q0VRM0VMdnVOcXFjT0lld0V1YlNfM1dKRVVhVm9sZlQtUXpvRUdESVh3QmZ1VFVLaXZyVXVJVHc3QnIwMEJEaThkLUpaTTBCamM3dWZIWkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "How Ethereum group plans to preempt restraining crypto laws with new handbook - DLNews",
        "content": "The Enterprise Ethereum Alliance has released its first DeFi Risk Assessment Guidelines.\n\nThe guidelines are intended to help DeFi protocols meet regulatory requirements and inform regulators.\n\nIndustry group the Enterprise Ethereum Alliance wants to prevent new crypto laws that stifle innovation with a new handbook.\n\nIts DeFi Risk Assessment Guidelines is an in-depth handbook detailing the risks involved in working with DeFi, and how to assess, manage, account for and mitigate them.\n\nSuch guidelines are needed due to regulatory ambiguity and a general lack of accounting standards and guidance for DeFi in laws like the EU’s Markets in Crypto-Assets regulations, the EEA says.\n\n“There are no specifics on what security reporting requirements are expected from the project to be compliant,” Dyma Budorin, co-chair of the EEA’s DRAMA working group and CEO of blockchain security firm Hacken, told DL News.\n\nThe guidelines will enable DeFi protocols to take a proactive approach to compliance, while also helping regulators draft regulation that doesn’t stifle innovation.\n\nThe initiative comes as regulators and politicians have put pressure on the industry with the threat of anti-crypto laws, tax loophole cuts, and a barrage of enforcement actions against industry heavyweights.\n\nThe guidelines in action\n\nThe EEA guidelines cover seven main DeFi risks and contain sections on how to assess and address such risks.\n\nThese include software-based threats such as smart contract exploits or maximal extractable value, as well as more general considerations such as compliance and legal risks.\n\nJoin the community to get our latest stories and updates\n\nThere’s also an extensive list of defined terms to help the uninitiated make sense of DeFi-specific jargon.\n\nRegulators in the UAE and the EU are already using the EEA’s guidelines, according to Budorin.\n\nNot just for crypto natives\n\nThe EEA’s board is composed of crypto natives like Consensys’ Joe Lubin and the Ethereum Foundation’s Aya Miyaguchi, as well as members from non-crypto native companies, including senior employees from JP Morgan, Santander, and Microsoft.\n\nThe EEA said its guidelines will be relevant to both such non-crypto firms and regulators.\n\nBudorin said they’re also important for financial institutions assessing investment risks.\n\n“They don’t know what DeFi risks are, and that’s why they don’t step into DeFi,” he said. “DeFi protocols that plan to cooperate with old money can use the DeFi Risk Assessment Guidelines as best practice references.”\n\nThe guidelines come as DeFi adoption among major traditional finance firms heats up.\n\nGlobal asset manager BlackRock this year launched its first tokenised fund on Ethereum.\n\nSeveral other firms, including JP Morgan, Goldman Sachs, and HSBC, are also continuing their experimentation with DeFi through tokenisation.\n\nTim Craig is a DeFi Correspondent at DL News. Got a tip? Email him at tim@dlnews.com."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE56aFBseG1mTnVuN2VFaFRsREFMNV9IQURzR0lsc0J5bjZSblBOY3AxMU9FdzMwMUNCRHNSVGltaDdmc1V4OXNZVVByODctLXlCYnRUbl9PVVcxeV9YSEloYkg4ZUdBUDh6Zm1qenNTTlRZVkxPelVRN1hn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "U.S. Spot Ethereum ETFs May See Modest Inflows Compared to Bitcoin, Citi Reports - Yahoo Finance",
        "content": "U.S. Spot Ethereum ETFs May See Modest Inflows Compared to Bitcoin, Citi Reports\n\nSpot Ethereum (ETH) exchange-traded funds (ETFs) in the U.S. could experience net inflows at just 30%-35% of the levels seen by spot Bitcoin (BTC) ETFs, according to a research report by Citi. This projection translates to a range of $4.7 billion to $5.4 billion in net inflows over a six-month period. The Citi analysts noted that these figures might be overestimated as both the inflows and ether’s return beta relative to such flows could be lower than anticipated.\n\nSpot Ethereum ETFs are set to become tradable in the U.S. next week after receiving approval from the Securities and Exchange Commission (SEC) earlier this year. However, Citi analysts suggest that while Ethereum offers potential long-term diversification benefits due to its broader set of use cases, these advantages are not yet fully realized.\n\nCiti also highlighted that the lack of staking options in Ethereum spot ETFs might contribute to lower-than-expected inflows. Furthermore, Bitcoin’s first-mover advantage has already secured billions in inflows and strong performance before Ethereum’s ETF approval in May.\n\nDespite these cautious forecasts, Citi’s report noted that the timing of the spot Ethereum ETF launches coincides with an increasingly dovish stance from the Federal Reserve, which may signal lower interest rates, a stronger equity market, and a weaker U.S. dollar. Such a macroeconomic environment could prove beneficial for the broader crypto market."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMipwJBVV95cUxNS0puODdtWkhoc1BqWkRQc2REdlVYSnpCWGFIbGVkZFZKY0o4dk1KTkQ4dUtOWGdPVlJQRS0tS0JZb3JiRU9DVGJMR3hOanFOM2hzYU5MZkxrUGVSLWdlbVZ1dG1Rc1hwSkp4QkU1Y2JSVnoyYXpHM19LU19uUnVJczh2a09ucjgyaWYyaUxCdW54eWR0anRMXzVkRksxb01JZ2FtdFFPVjh0emhaOGxadVlwcTEtMUQ4MmdpV05YOTNNUklNdWEwWnZWVmFYSkhzdUhUX1NHUnU1SzVFTk94ZUJwbXRIVC1YMU00ZGR4RHBsa0FTTGhWT1ljZWpORVlyY2hDODFVSHRqNUc1cUJTNENweXB2b2pydlljWWlsOHU5dk1LX1h3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Investments® Provides Update Related to Upcoming - GlobeNewswire",
        "content": "STAMFORD, Conn., July 17, 2024 (GLOBE NEWSWIRE) -- Grayscale Investments®, the world’s largest crypto asset manager*, offering more than 20 crypto investment products, previously announced that it has set a record date of July 18, 2024 (the “Record Date”) for the initial creation and distribution of shares of Grayscale Ethereum Mini Trust (the “ETH Trust”) to shareholders of Grayscale Ethereum Trust (Ticker: ETHE) (“ETHE”) (referred to as the “Initial Distribution”). Grayscale intends to list the ETH Trust on NYSE Arca, subject to required regulatory approvals, under the ticker symbol “ETH.” See that press release here.\n\n\n\nToday Grayscale is confirming that from and after July 18, 2024, anyone who purchases ETHE shares will not be entitled to receive ETH shares in the Initial Distribution.\n\nAdditionally, Grayscale currently expects the Distribution Date to be July 23, 2024, following (i) the filing and effectiveness of the ETH Trust’s registration statement on Form 8-A to register the ETH Shares under the Exchange Act, (ii) the effectiveness of the ETH Trust’s registration statement on Form S-1 (Registration No. 333-278878) under the Securities Act, and (iii) the ETH Shares having been approved for listing on NYSE Arca. No assurance can be given that the Initial Distribution will occur on Grayscale’s anticipated timeline, and Grayscale will update the market to the extent its expectations change.\n\n\n\nRecord Date July 18, 2024 Ratio of ETHE Shares: ETH Shares 1:1 % of Ether held by ETHE contributed to the ETH Trust 10% Anticipated Distribution Date July 23, 2024\n\n*By AUM as of 7/15/2024\n\nNO OFFER OR SOLICITATION\n\nThis communication is for informational purposes, solely in your capacity as a shareholder of ETHE, and does not constitute an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such jurisdiction. No shareholder approval of the Initial Distribution is required by applicable law, and we are not seeking ETHE shareholder approval.\n\nFORWARD-LOOKING STATEMENTS\n\nCertain of the statements contained herein may be statements of future expectations and other forward-looking statements that are based on Grayscale’s views and assumptions and involve known and unknown risks and uncertainties that could cause actual events to differ materially from those expressed or implied in such statements. Grayscale assumes no obligation to update any forward-looking statements contained herein and you should not place undue reliance on such statements, which speak only as of the date hereof. Although Grayscale has taken reasonable care to ensure that the information contained herein is accurate, no representation or warranty (including liability towards third parties), expressed or implied, is made by Grayscale as to its accuracy, reliability, or completeness. You should not make any investment decisions based on these forward-looking statements. No assurance can be given that the Initial Distribution will occur on Grayscale’s anticipated timeline, or at all.\n\nIMPORTANCE OF OBTAINING PROFESSIONAL TAX ADVICE\n\nThis communication is not intended as, and does not constitute, tax advice. As further discussed in the section of the Preliminary Information Statement filed by ETHE entitled “Material U.S. Federal Income Tax Consequences of the Initial Distribution,” the U.S. federal income tax consequences of the Initial Distribution are complex, subject to uncertainty in certain respects and may be affected by circumstances specific to a beneficial owner of ETHE Shares. Any beneficial owner of ETHE Shares who receives ETH Shares in the Initial Distribution, and any intermediary holding ETHE Shares or ETH Shares, should consult their own tax advisor regarding the U.S. federal income tax consequences of the Initial Distribution, including the proper allocation of existing tax basis between ETHE Shares and ETH Shares. Please refer to the Preliminary Information Statement filed by ETHE for more information, including other U.S. federal income tax considerations relating to the Initial Distribution and ownership of the ETH Shares.\n\nADDITIONAL INFORMATION AND WHERE TO FIND IT\n\nA definitive information statement on Schedule 14C will be furnished to ETHE shareholders on or after the Record Date for the purpose of informing ETHE shareholders of the Initial Distribution, in substantial compliance with Regulation 14C of the Exchange Act. The information statement will describe the Grayscale Ethereum Mini Trust, risks of owning shares of the Grayscale Ethereum Mini Trust and other details regarding the Initial Distribution, and will be made available on our website at www.grayscale.com/documents#regulatoryfilings. ETHE shareholders will not need to pay any consideration, exchange or surrender existing ETHE Shares, or take any other action to receive shares of the Grayscale Ethereum Mini Trust in connection with the Initial Distribution.\n\nETHE is not a fund registered under the Investment Company Act of 1940 and is not subject to regulation under the Investment Company Act of 1940, unlike most mutual funds or ETFs.\n\nGrayscale Ethereum Trust and Grayscale Ethereum Mini Trust Risk Disclosures:\n\nAn investment in the Grayscale Ethereum Trust or Grayscale Ethereum Mini Trust may be deemed speculative and is not intended as a complete investment program. An investment in ETHE or the Grayscale Ethereum Mini Trust should be considered by persons financially able to maintain their investment and who can bear the risk of total loss associated with an investment in ETHE or the Grayscale Ethereum Mini Trust. Extreme volatility of trading prices that many digital assets, including Ether, have experienced in recent periods and may continue to experience, could have a material adverse effect on the value of ETHE and the Grayscale Ethereum Mini Trust and the shares of each trust could lose all or substantially all of their value. Digital assets represent a new and rapidly evolving industry. The value of ETHE and the Grayscale Ethereum Mini Trust depends on the acceptance of the digital assets, the capabilities and development of blockchain technologies and the fundamental investment characteristics of the digital asset. Digital asset networks are developed by a diverse set of contributors and the perception that certain high-profile contributors will no longer contribute to the network could have an adverse effect on the market price of the related digital asset. Digital assets may have concentrated ownership and large sales or distributions by holders of such digital assets could have an adverse effect on the market price of such digital assets. The value of ETHE and the Grayscale Ethereum Mini Trust relate directly to the value of the underlying digital asset, the value of which may be highly volatile and subject to fluctuations due to a number of factors.\n\nA registration statement related to Grayscale Ethereum Mini Trust has been filed with the SEC but has not yet become effective. An investment in the Grayscale Ethereum Mini Trust cannot be made, nor money accepted, until the registration statement is effective. An investor should consider the investment objectives, risks, and charges and expenses of the Grayscale Ethereum Mini Trust carefully before investing. A preliminary prospectus which contains information about Grayscale Ethereum Mini Trust may be obtained by emailing info@grayscale.com. The information in the preliminary prospectus is not complete and may be changed. The final prospectus should be read carefully before investing, and when available may be obtained from the same source. This communication is not an offer to sell shares and is not soliciting an offer to buy shares in any state where the offer or sale is not permitted.\n\nGrayscale Investments, LLC is the Sponsor of Grayscale Ethereum Trust and Grayscale Ethereum Mini Trust.\n\nAbout Grayscale Investments®\n\nGrayscale enables investors to access the digital economy through a family of regulated and future-forward investment products. Founded in 2013, Grayscale has a proven track record and deep expertise as the world’s largest crypto asset manager. Investors, advisors, and allocators turn to Grayscale for single-asset, diversified, and thematic exposure. Certain Grayscale products are distributed by Grayscale Securities, LLC (Member FINRA/SIPC) and certain products are managed by Grayscale Advisors, LLC.\n\nMedia Contact\n\nJennifer Rosenthal\n\npress@grayscale.com"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5qeUFlRTA1c3hLblFPRzhmNm9QVG9BckxUOXEteEo5c080ZG4xOVF0cTFnREpwTHRWeDRWUGNJREdwQkhoWlFqNkhKQmxlZkFZR2JfVmZmM2I0MlRQLXYwODY1ZWdvTm04dFFyRUd1dTJ3WGt0V3hERzRfZEdsbnfSAYcBQVVfeXFMTkVXenNHN2laSExEOUExdEhWZjczaExxa3NJX0g5R2laUUhxcnItSm1TTWhGd1M0ZkZGQTNteXkwbkNSSloxLWJwdnY0MzZ2YWlaTnNnT0NJak9UQUN4UUpoTC1WZEx6bmZHTWhRVGljU1k0QVdsQXhIaVFSUzRqZVc4Qm8tVVRF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Will Hit $5,000 After ETFs Launch, Predicts Bitwise Exec - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMatt Hougan, chief investment officer at Bitwise Asset Management, forecasted on Wednesday that the price of Ethereum could surge past $5,000 following the launch of Ethereum ETFs.\n\n\"[ETF] inflows will push prices to all-time highs, above $5,000,\" he declared. “By year-end, I’m confident the new highs will be in.”\n\nHougan's prediction is grounded in the belief that ETF inflows will significantly impact Ethereum's price by creating new sources of demand—similar to what was observed with Bitcoin after its funds launched. But it will take some time.\n\n“I think the first few weeks could be choppy, as money may flow out of the $11 billion Grayscale Ethereum Trust (ETHE) after it converts” to an ETF, he wrote.\n\nAD\n\nAD\n\nThe primary driver for this anticipated price surge is the interplay between supply and demand, he said. ETFs introduce new demand without altering Ethereum's underlying supply fundamentals. Hougan noted that Bitcoin ETFs have purchased 263,965 BTC since their January launch, compared to 129,181 BTC produced by miners, resulting in a substantial price increase.\n\nHougan outlines three key reasons why Ethereum might see an even greater impact from ETF inflows than Bitcoin.\n\nFirst, Ethereum's inflation rate has been 0% over the past year, meaning the supply of ETH has remained constant at 120 million. This contrasts with Bitcoin's 1.7% inflation rate at the time its ETFs launched. Hougan said Ethereum-based stablecoins and tokenized funds support the equilibrium between ETH creation and consumption, leading to price appreciation.\n\nSecondly, Hougan pointed to staker dynamics. Unlike Bitcoin miners who need to sell their mined BTC to cover operational costs, Ethereum stakers are not under the same pressure. “There is simply less forced selling each day in Ethereum than in Bitcoin,” Hougan noted.\n\nAD\n\nAD\n\nFinally, he noted that a substantial portion of ETH is staked or locked in decentralized finance (DeFi) contracts. “Currently, 28% of all ETH is staked, meaning it is effectively off the market,” he wrote.\n\nHougan said he expects Ethereum ETFs to attract $15 billion in new assets over the first 18 months, a significant influx that could drive ETH from its current trading price of approximately $3,400 to new heights.\n\nWith ETH trading at around $3,400—just 29% below its all-time high—Hougan concluded that the introduction of ETFs and the resulting demand dynamics make it likely that Ethereum will challenge and surpass its previous records."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNcVJPRVJkUVdXejRDcHNGRmlFbGRZRnJKM3NtOWRfNnRfeGhRYnRGaS1UcEZsRDBNZ3lWS3QyRGdnd1pVbWhxT3NnNkc0d2VqOGZHb29GeGlfMGNySnFqQTlwLWpKdzNmVGhKZE5jR2ZXSTE5d3pYenlhMloyU3c1dNIBhgFBVV95cUxPSW02ZTFTWTEzTTFqc1Y5QmRPUlhWSV85ZUpSV3U5TXIyc3BGdkdkYUxabUx2YnFwS21wQ1FkdnRvTzBnNnlUa1ZqZGQ3VTM5aGp1dUs3eWNMeXY5bDhtQkNvWWozM2RtS2laZnZUdmlFbEV2TUNxcVMtZFl5TV9wVE50d19kdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin: There's Too Much Investment - U.Today",
        "content": "In an unexpected manner, Vitalik Buterin has criticized overextended investment practices, particularly investments in infrastructure that does not really need it. However, his line of thought could be a double-edged sword.\n\nAdvertisement\n\nAccording to Buterin's viewpoint, a lot of investors are lured to high-risk high-reward situations (the casino) but attempt to rationalize their bets by funding infrastructure that indirectly gains from these speculative endeavors.\n\nAlthough this may be true for some market segments, it is important to think about the arguments' wider implications. Vitalik's perspective may be criticized for being a little limited. Infrastructure spending frequently results in more significant technological breakthroughs and innovation, even when it is not directly tied to speculative markets.\n\nFor example, beyond the original speculative investment blockchain infrastructure, improvements can benefit a wide range of applications. These can include developments in supply chain logistics, public governance systems and even decentralized finance. Furthermore, a lot of interest and money are frequently brought into the market by so-called casino investments, which supply the money needed for new ventures and start-ups.\n\nAdvertisement\n\nThis capital inflow may result in innovations that would not have been feasible in an environment where investment was more cautious. The delicate balance between risk and innovation should not be overlooked as writing off high-risk investments could stifle the boldness and creativity that propel the sector forward. Buterin's criticism is not wholly without merit, though.\n\nInstances of excessive speculation resulting in bubbles that can have disastrous consequences when they burst have been observed on the cryptocurrency market on multiple occasions. This volatility has the potential to erode investor confidence in the technology and result in sizable losses. For the ecosystem to remain healthy over time, it is crucial that investments are made carefully and sustainably."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQOXNmUE55am56YURlZ21uWU93eldMRGNLY0NzSlZ6X2R5emV1TXBMRFY3UDlRSkJVNU1nOVIyRHZwcDJfQ0hfVnFkaDB5eXBhcDhXTTBQVDkzSEdTNXhSUW5HOTlXTThnU0liNUQwMHVxOHo0U3F6UDhfUFpLaWMyT0VPQTFBQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "'Ethereum Killer' Solana Could Soar To $174, Says Popular Crypto Analyst After Identifying This Bullish Pattern - Yahoo Finance",
        "content": "'Ethereum Killer' Solana Could Soar To $174, Says Popular Crypto Analyst After Identifying This Bullish Pattern\n\nInfluential cryptocurrency analyst Ali Martinez predicts a bullish run for Solana (CRYPTO: SOL), often touted as an ‘Ethereum (CRYPTO: ETH) killer,' amid growing market optimism around the digital asset.\n\nWhat Happened: On Monday, Martinez posted his optimistic prediction for Solana on X, formerly Twitter. He noted the formation of a “W” pattern in Solana’s chart, which prompted him to forecast a rise to $174.\n\n\n\n\n\n#Solana appears to be forming a W pattern, which suggests $SOL will surge toward $174! pic.twitter.com/OxXODWi1yA — Ali (@ali_charts) July 15, 2024\n\nAlso called a double bottom pattern in technical analysis, the “W” pattern typically occurs at the end of an extended bearish trend and signals a bullish reversal.\n\nSOL was last seen at around $174 more than six weeks ago in May. If Martinez’s prognosis comes true, it would mean a 13% bounce from its prevailing price.\n\nSee Also: Want to trade futures? Discover why 25 million chose this Chicago Bulls sponsor.\n\nWhy It Matters: Solana’s bullish market sentiment was supported by noted analysts in the cryptocurrency space. Syncracy Capital's Daniel Cheung predicted that the coin could reach 50% of Ethereum’s (CRYPTO: ETH) market valuation, while another trader, Eugene Ng Ah Sio, expressed confidence that it would become the market’s favorite.\n\nEarlier, VanEck and 21Shares filed S-1 registration forms with the SEC for a Solana ETF, marking a significant step towards opening up the world’s third-largest speculative cryptocurrency to mainstream investors.\n\nRead Next:\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\n1 in 4 Americans own a share of Bitcoin according to NASDAQ, how many people got started through this free crypto faucet?\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article 'Ethereum Killer' Solana Could Soar To $174, Says Popular Crypto Analyst After Identifying This Bullish Pattern originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQdU1kbTJsamFhdUgwY1BrTEFpQzJJXzNuc2VvZFhZOHU0WUVuR1JmZkk5OTMyRndXY2F0T3BJcEJhX29ON0NFX3pCYTZvOEJpQkNhMmhZWUVDZTRlbzhidEhMQnN1QW5nY2FzSnZDbDZuQ2pEM19IZnJ1V3RGbVhOZFV0Q2NFODZEX3Roc0lScnd6eW9hTHRvRzEySThKVWFheHJCZlRR0gGrAUFVX3lxTE1WY01CTGRfODRZX3NUTzlrdTQ3Q3NoSXc3Qm1GWkNGeUhJTmpHMG5CSkJ5cncwX1o0enFSN3BxdjNGaFV6RkJiLS1YOGlnMmRoRlNuVFVwWjFJdmJyRGFYTms0Y3FzWkdDdmRPTW1RX3pLQ2hWNVhZcktXYUF3NElDdDZCSUowVUdQYnZnTmNRR2V6SGNKTzJHZW5RMF9NV0ZnV2N5MVQ4WUktQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "In Likely Precursor to Ether ETF Approval, Most Applicants Have Submitted Their Final Forms - CoinDesk",
        "content": "In Likely Precursor to Ether ETF Approval, Most Applicants Have Submitted Their Final Forms\n\nThe forms show what issuers plan to charge customers, with Grayscale at the high end at 2.5%, while competitors including BlackRock and Fidelity pick 0.25% or lower.\n\nElection 2024 coverage presented by Stand with crypto"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQc29nak9sREwzTkNIck9fU2NFQmVZVUhYVHA0WTdVT0NlRWZqS1RjUmhHMDBzcHNmMzRaMXdIaUM3MEVVTWUxYnQ2UDZucWl4eEY5aGlxakpjVHNIcDBPbFRoNG9TQzQ5WFpNUDg1UUZBX2F6Nnl5SU8wS3VjdzhUdnFqYlVrWHphMm93REFPVFZQV2w1TnNFa1hyb0FLWkRQYlJOWlFIRXB2U3d4X09NOFcxa1A3YWdHdXpJazR30gHDAUFVX3lxTFBWTGdWT1kxaDlfZlFieFFQUHNzOFdDR3BCRHdRYnJPRDJsVVRvTmZCc3J6MVMyTm5hMmUtTWUyWF9lVl9IZXRzX0NrZlg5bVNvbjlIamk3UTFiOWloNW1XSE1zYzAwUGlyNjh6ODItWTFmQU1EaElyUVcyWXlIUm52QUx0R2RqX2dXQi1tcTFZejg5clBobkQtUHRNX0U1VkVlaTBtcElqWkJXTnBNSlRZZEtfOFd6Sm53aERoUkVMcGZqMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Primed To Outperform Bitcoin Following Launch of Spot ETH ETFs: Kaiko Analytics - The Daily Hodl",
        "content": "Ethereum is likely gearing up to outrun Bitcoin (BTC) after the launch of spot ETH exchange-traded funds (ETFs), according to analytics firm Kaiko.\n\nIn a new report, Kaiko says the “mood in crypto markets is much changed” since May when the U.S. Securities and Exchange Commission (SEC) approved spot Ethereum ETFs.\n\n“The mood in crypto markets is much changed from May, when the SEC approved spot ETH ETFs. Nearly two months on the new products have yet to begin trading, and ETH has fallen nearly 20% in the intervening period. That pullback doesn’t tell the whole story though, under the hood things appear to be primed for spot ETF launches.\n\nThe ETH to BTC, which measures the relative performance of the two assets, remains elevated around 0.05. This is significantly higher than pre-approval levels of near 0.045. A stronger ratio suggests ETH could continue to outperform relative to BTC following ETF launches.”\n\nAccording to Bloomberg ETF expert Eric Balchunas, the ETH ETF will launch on July 23rd.\n\nWhile the analytics firm notes the possibility that ETH could keep running higher against BTC, widely followed crypto analyst Benjamin Cowen says that the ETF launch won’t give Ethereum the boost that the market expects.\n\nIn a recent video update, Cowen said that Fed monetary policy is a larger driver of the price of ETH than the ETF and previous bullish narratives about Ethereum in the last several years.\n\n“I ultimately don’t think the spot ETF for ETH will necessarily keep the ETH/Bitcoin valuation from staying at relatively low levels… There’s been so many narratives that have been given out over the last few years as to why the ETH/Bitcoin valuation would never go to even the current levels that it’s at… In 2022 when ETH/Bitcoin was at .08 BTC, if you had told them that it was going to go down into the mid-.04s BTC by 2024 they would have laughed at you…\n\nWe have these narratives about the transition from proof-of-work to proof-of-stake on this deflationary mechanism theoretically causing the Ethereum/Bitcoin valuation to ‘hold up well’ and that didn’t play out. And so it sort of gave us a glimpse into the idea that, hey, maybe this is more about monetary policy than it is about anything else.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOeldMUmR6Mk54Z1pRWmlsY0ZCdWFfS2ZUeUZySElnanAtOVR6UmlYTDdiN0VKMUxUclpVQ2dIX05YaDhKQndlMGJPeUhybl9jazkybmpoWVBwMHFkdVFyT24wajc4M3NidThnUGFKQTBaVGtFUkJiYktGZ3BVVHV4SUtxbmw5eFJlZGZMcEZ6Q0syTHdmUWIycEprb2lGUmxJYzdhWg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Here’s the $700M Signal Driving ETH to $4k - The Crypto Basic",
        "content": "Ethereum price topped out at $3,517 on Wednesday, July 17, 2024, marking a 25% rebound over the last 12 days of trading; on-chain data shows increased staking on the ETH 2.0 network could be a key bullish catalyst.\n\nEthereum Price Spikes 25% Ahead of Expected ETF Launch on July 23\n\nThe anticipation surrounding the potential launch of an Ethereum ETF on July 23 has been a significant driver behind Ethereum’s recent price surge.\n\nFurther buoyed by the dovish macroeconomic indices in the recent Non-Farm Payrolls and Consumer Price Index (CPI) data, market sentiment surrounding ETH has turned overwhelmingly positive as investors look forward to increased institutional participation and Fed Rate cuts in H2 2024.\n\n- Advertisement -\n\nThe chart above shows how ETH price fell to a 100-day low of $2,815, during the market crash on July 5. But since the dovish NFP data, bulls traders entered a buying frenzy over the weekend pushing Ethereum price back above the $3,000 level.\n\nHowever, on Monday, July 15, the Ethereum ETF’s impending launch on July 23 hit the newsreels. The bullish headwinds from the anticipated ETF inflows have put the Ethereum price rally into second gear this week.\n\nAt the time of writing on July 17, Ethereum’s price had broken above the $3,517 area, up 25% from the historic lows recorded on July 5. With the Ethereum ETF launch date still nearly a week away, speculators are betting on further upside toward the $4,000 range.\n\nEthereum ETH 2.0 Stakers have Deposited $700M in 7 Days\n\nAnother vital catalyst that has boosted the Ethereum price action in the last few days is the increased staking deposits lumped up by ETH investors. Since the Bloomberg analysts highlighted July 23 as a possible launch date, investors have increased the spate of deposits into the ETH 2.0 beacon chain staking contracts.\n\nThe chart below tracks the official data from Ethereum blockchain network, showing the daily changes in the number ETH coins deposited within the ETH 2.0 beacon chain contracts. Increased staking often occurs during periods where investors consider the effective yield more profitable than other alternatives, or when they are increasingly confident of the project’s growth trajectory.\n\n- Advertisement -\n\nAs of July 10, investors staked a total of 32,919,270 ETH in the Ethereum 2.0 staking contract. But following back-to-back dovish NFP and CPI macroeconomic reports, as well as the announced ETH ETF launch data, Ethereum investors have reacted by increasing their staking deposits.\n\nAt the time of writing, the total staked funds have now reached 33,124,709 ETH, reflecting an increase of 205,439 ETH within the last seven days. Increased staking during a market uptrend is interpreted as a bullish signal for a number of reasons.\n\nFirstly it signals that despite Ethereum prices climbing towards monthly-time frame peaks, majority investors are looking to staked more funds, and hold out for future gains rather than sell now. This decline in sell-side pressure could encourage indecisive new entrants to buy-in on the ETH rally in the days ahead.\n\nMore so, when the newly-staked 205,439 ETH is valued at the current prices, it means that investors effectively removed over $711 million worth of liquidity from the short-term market supply.\n\nIn essence, if investors keep cutting down selling pressure by adding more to the $700 Ethereum 2.0 staking deposits, ETH price is likely to advance further toward $4,000 as demand rises ahead of the ETF launch date slated for July 23.\n\nIn summary, the combination of heightened anticipation for an Ethereum ETF and the substantial increase in ETH 2.0 staking deposits are driving Ethereum’s price toward new highs."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQa1g0ak9IVDBjenMyUkc3V28wX2kweGNqeVlJZm53N0RVQlhMS2tXQS1iOENKbHQxMURJYlR5dk8tdEV5ZnNGblp0MVlzSVFVU2hCWGJTS05ZNThVTVhEOUtuVFdzU1pidmdKYW9ld2JBRHc4Q3FISlJNd2FfTHhLbU12UkNJQUNUT1VNTVlYVXJiOWVKY0FHRUV4cDhvT0RuQ0hDcdIBqgFBVV95cUxOdnBCVGI0cGlSVDZ0dFlIYVZzUmx6YkdCWUNqZFNwN2pmQ3otbzIzNGJlMG81ZzUzX0lqdk16UjlkSWUtNWxoekVpQmdHejRXMmotOUNFUzVXTHhLZVJZcUlucXdQNVB6SHBSRFRsaktUUEVhNHFrM1pkcndZRi1lTzZZWU96ZThla0NabloyZDJQaFowaTRoQW5Eei1URDN5N25idG5DNGZCdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ava Protocol Revolutionizes Web3 with Mainnet Launch on Ethereum - CoinTrust",
        "content": "Ava Protocol, a project focused on Web3 infrastructure, has announced the launch of its mainnet on Ethereum as an EigenLayer Actively Validated Service (AVS) designed for smart contract automation. This development enables developers to easily incorporate Ava Protocol’s advanced transaction automation, privacy features, composability, and cost-efficiency into their decentralized applications (dapps) and projects, ensuring wide compatibility across the Ethereum Virtual Machine (EVM) ecosystem.\n\nAva Protocol introduces an event-driven activation model that simplifies complex on-chain operations. It triggers autonomous “super-transactions” based on predefined conditions such as time, price, and smart contract updates. This innovative approach reduces friction for both developers and end-users by automating smart contracts with the simplicity akin to Stripe’s services. Super-transactions, which do not require custom code, allow developers to implement them effortlessly, thus lowering a significant barrier to Web3 adoption.\n\nUnleashing New Capabilities with EigenLayer AVS\n\nThe launch of Ava Protocol as an AVS on EigenLayer brings new capabilities to developers that transcend the limitations of the EVM’s design. AVSs offer features beyond what is directly possible on Ethereum and other EVM-based chains. Ava Protocol realizes the vision of a new event-driven activation service outlined in the EigenLayer whitepaper, providing on-chain automation with strong execution guarantees for time-sensitive transactions and multi-step processes. This functionality supports scheduling future and recurring payments, stop-loss and limit orders, streaming rewards, dynamic NFT minting, and more, making it an adaptable tool for a variety of dapps.\n\nChris Li, the Founder of Ava Protocol, emphasized that with the support of partners and the community, they have reached a crucial milestone in their mission to deliver automated super-transactions on Ethereum. He pointed out that the mainnet launch of Ava Protocol would unlock new use cases for autonomous transactions that power smart contracts, showcasing the versatility of EigenLayer’s AVS technology while addressing critical Web3 automation challenges.\n\nLaunch and Validation\n\nAva Protocol is among the first 15 projects to launch an AVS, initiating its active validation with pooled security from Ethereum validators through EigenLayer’s innovative restaking mechanism. The protocol is going live with 20 EigenLayer operators sourced from the top 100 EigenLayer operators by Total Value Locked (TVL), including EigenYields, InfraSingularity, Kukis Global, Coinage, and Staking4All.\n\nAlex from EigenYields, a leading operator running actively validated services for EigenLayer, expressed optimism about the potential of Ava Protocol’s automated super-transactions and the opportunity to provide a secure and resilient foundation for this innovative technology. He noted that this aligns with their mission to maximize value for delegators by advancing the Ethereum ecosystem.\n\nSam Shev, Head of Marketing at Ava Protocol, highlighted the excitement of bringing Ava Protocol’s technology to a live environment for the first time and observing what the community will build using super-transactions. He acknowledged the support from EigenLayer operators in establishing a strong foundation for Ava Protocol’s future endeavors.\n\nSuccessful Testnet and Future Plans\n\nThe mainnet launch of Ava Protocol follows a successful testnet phase, which saw the participation of 10,000 wallets and generated over 1,000 automated transactions daily. Ava Protocol plans to publish a detailed roadmap of AP token incentives for initial operators soon.\n\nConclusion\n\nAva Protocol’s mainnet launch on Ethereum as an EigenLayer AVS marks a significant advancement in the Web3 landscape. By providing seamless smart contract automation, enhanced security, and innovative transaction capabilities, Ava Protocol is set to transform the way developers build and deploy dapps. The support from EigenLayer operators and the broader community ensures a robust foundation for this pioneering technology, promising exciting developments and new use cases in the decentralized ecosystem."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQdERSVllSOVRFRTl2QkpRV21hSjVRZmgzS1V0bkw4VkFXMFhvTG9qdjJLSS04UkFDWGcxdlpNODY3aTRsQlUySldCZGd4cWl2R2ZObFNfSHVZSVpFamRTcXVXeGNzVlhEY09HRXhJWFBrVjBNZDB6VTM5Y0NRRWQwR0lJR1FSVzNEYU9CMGRqbnh4Q1ZuNllQZFZ3R19DR03SAaQBQVVfeXFMTVg5NjN5SVFHV3YzZTM3Z1RqWVFVWjZiOHpOMFNuLU1jbFBDdWxqUjY1OFVJellsZHh4V09XaGdmeFB0YWJwN2VBLVZXUHBUWEt2Z0dFSy1tS3JKUk9NSkNEM3U3dlRyZTgzQzNGR2N0c0puSEhlZUdLV1ZocE5zTm11YzE3X2QzalFuN0JxclhLTU9MelpYYlVLOWFsNDNqRGpnM3g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Is XRP Ready for $0.7? Shiba Inu (SHIB) on Verge of $0.00002, Ethereum (ETH) Reversal Halted - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nXRP's 30% rally placed the asset at the forefront of the bull market, with the potential to break even higher, potentially hitting this year's high of $0.7, but numerous factors should align for it.\n\nOver the last few days, XRP has demonstrated remarkable strength, breaking through major resistance levels and drawing interest from the cryptocurrency community. With many speculating as to whether the momentum can push XRP even closer to $0.7, the rally has brought the cryptocurrency very close to a critical threshold.\n\nNumerous signs point to the possibility that XRP will keep rising. First, there has been a noticeable surge in trading volume for the asset, which suggests that investors are actively participating in it. As more market participants join the rally, this spike in volume frequently precedes subsequent price increases.\n\nFurthermore, technical research reveals that XRP has overcome a number of resistance levels and converted them into support. The previous thresholds at the $0.52 and $0.54 levels are now serving as support, giving the next leg up a strong foundation. Major cryptocurrencies like Ethereum and Bitcoin are also seeing gains, and the market's attitude toward cryptocurrencies is currently positive overall. This general bullishness on the market makes it easier for XRP to profit from the upward momentum.\n\nAdvertisement\n\nShiba Inu regains important positions\n\nShiba Inu is getting closer to the $0.00002 price threshold, which could be the next move for the asset since it is already trading close to the month's high. The main issue with the asset right now, though, is the lack of momentum.\n\nWith steady ascents toward the $0.00002 mark, SHIB has demonstrated a comeback in the last few days. This level poses a major psychological obstacle for investors and traders. Crossing above this barrier might open the door for more gains and possibly spark a bigger rally. Technical indicators show that SHIB has overcome a resistance level of 100 EMA.\n\nThe asset is currently up against the 200 EMA resistance, though, and it could be a major obstacle. Additionally, the Relative Strength Index (RSI) is getting closer to the overbought area, indicating that the current rally may be flagging. Even with the improvement, the trading volume is still low when compared to earlier spikes.\n\nThere is reason for concern because this weak trading activity suggests that there may not be enough market interest to sustain the current price movement. A spike in volume would be required to give SHIB the necessary momentum to continue on its upward trajectory.\n\nEthereum stops\n\nEthereum has hit the 50 EMA resistance level and now might retrace below key values like $3,300. Luckily, we saw a volume surge, which could be a sign of an upcoming reversal.\n\nEthereum experienced a setback after its recent rally brought it close to the 50 EMA resistance level. At $3,300, a critical support level, the asset is presently having difficulty holding its position. The 50 EMA presents a significant challenge because, if not decisively broken, it frequently functions as a barrier that can stop upward momentum. The increase in trading volume is one aspect of Ethereum's current market activity that is positive.\n\nStronger interest and participation from traders are frequently indicated by increased volume, and this can result in more persistent price movements. The increase may suggest that buyers are entering the market, which could lead to a reversal.\n\nWe might witness a further retracement of the asset, possibly testing lower support levels like $3,200, or even $3,000. This could happen if the asset is unable to hold its position above $3,300. Further, worth keeping an eye on is the Relative Strength Index, which can reveal if an asset is overbought or oversold and offer insights into potential future price movements."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNVmZ6TUNpeGNWNlpxaEt4SzI3akJKTndhLTZYZ2dNYlJROTd0bHNNX0RJMzktNE1JV3hSSUtyZndNenRKTkNGZTlkMVhZSjUyVFJmc3V4WWxiejdpcGZmNUpGSDNtajRHYkRTNTlqLTRyVDNwd2tTZXRSOFAzRVpLQlI4WkxDVEpjNjUzRlJGRE8zZk9ra3lZYzdQX0ViSVJBMm14eU52OWFDU1JwTGNiQlpSWGJhVjF5SHkwedIBwgFBVV95cUxQc3hWRDFCTTJOWnZVcGt2ekxUN1dzbTZQQWg0NXZvVGFJRHN5TTVLVmFkanY5UXdCU1BpZ1B0MHgzbFdJTFV5ck9XQ0E5MzlxYXNPVnNJcHRhbHdxUzNBZmNfRk9tX3AzOVI2bXNmdFRvc1lfTmdtUlRNdHhLVnhKTVBkRTQ5NEtXMHNMUHZoUklUQnh6blk0TFQ3a2FPd0V0YWotN2lMUGVBNk9xUnBGQkU2RW1yQVRKcmFTOExXZlQydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum set for new all-time high: Peter Brandt, Bitwise - FXStreet",
        "content": "Ethereum ETFs will push ETH to a new all-time high above $5,000, says Bitwise.\n\nCiti predicts ETH ETFs will attract around $5 billion in net inflows within six months of launch.\n\nPeter Brandt suggests ETH could rally 60% if it makes a key move.\n\nEthereum (ETH) is up nearly 2% on Tuesday following predictions from Bitwise chief investment officer (CIO) Matt Hougan that ETH ETFs could help push ETH to a new all-time high above $5,000. Other predictions from Citi Bank and trader Peter Brandt also align with Hougan's position.\n\nDaily digest market movers: Ethereum ETFs deciding factor for new all-time high\n\nBitwise CIO Matt Hougan predicted that inflows across Ethereum ETFs will boost ETH's price to a new all-time high above $5,000.\n\n\"By year-end, I'm confident the new highs will be in. And if flows are stronger than many market commentators expect, the price could be much higher still,\" said Hougan in a recent memo to investors.\n\nHougan believes ETH ETFs will have a bigger impact on ETH's price than Bitcoin (BTC) ETFs had on BTC due to the new demand that ETFs bring to commodities without altering their fundamentals. BTC has seen a 110% rise since October, when Bloomberg announced the SEC would likely approve Bitcoin ETFs.\n\nBitcoin’s Returns since January 2023\n\nHe compared Bitcoin's previous 1.7% inflation rate to Ethereum's, which has hovered from negative to 0% in the past year. ETH has maintained such a deflationary status since the implementation of Ethereum Improvement Proposal 1559 (EIP-1559), which reduces the amount of ETH in circulation upon every transaction on the Mainnet.\n\n\"Significant new demand meets 0% new supply? I like that math. And if activity on Ethereum ticks up, so does the amount of ETH being consumed. That's another lever of organic demand working in investors' favor,\" stated Hougan.\n\nHougan also highlighted how the lower economic cost of Ethereum's consensus mechanism reduces the selling pressure on ETH, unlike that of Bitcoin miners, who have to sell a portion of their holdings to cover up costs.\n\nLastly, he mentioned how increased staking and ETH usage in DeFi protocols have already removed over 40% of ETH off the market.\n\nHougan believes these factors, combined with his earlier predictions of ETH ETFs raking in $15 billion in the first 18 months of launch, primes Ethereum for a new all-time high.\n\nMeanwhile, banking giant Citi predicted in a research report last week that Ethereum ETFs could see up to 30%-35% of the flows seen in Bitcoin ETFs. That would give an equivalent of about $4.7 billion to $5.4 billion of net inflows, noted Citi analysts.\n\nThe Securities & Exchange Commission (SEC) will likely greenlight ETH ETFs for trading next Tuesday. This follows updates from Bloomberg analyst Eric Balchunas and Reuters, which claimed sources told them the regulator asked issuers to submit their final S-1 drafts this week in preparation for a Tuesday, July 23 launch.\n\nETH technical analysis: Could Ethereum rally 60% to $5,627?\n\nEthereum is trading around $3,460 on Tuesday, up over 2% on the day. In the past 24 hours, ETH witnessed over $45 million in liquidations, with shorts leading the line at $25.36 million and longs at $19.92 million in liquidations.\n\nETH's options open interest has risen 13% in the past 24 hours to $6.66 billion. Open interest is the total amount of unsettled contracts in a derivatives market. An increase in options OI combined with price growth indicates a potential for more upside in a market. As a result option traders could be expecting higher ETH price and are reacting accordingly.\n\nThis aligns with a recent prediction from popular trader and analyst Peter Brandt.\n\nBrandt predicted that ETH could see a new all-time high soon after finding support at around $2,800, the lower boundary of a four-month plus rectangle, \"which was a retest of the Feb completion of a horn bottom.\" If ETH can complete a move to the rectangle's upside of $4,093, Brandt suggests that it could set a new all-time high at $5,627.\n\nETH/USDT Weekly chart\n\nIn the short term, if ETH rises above $3,502, over $34.8 million worth of short positions will be liquidated from the market."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPR3RVVEh5M3NHN1BSamgtSHprREtRdFhWZ1E0eUoxWHRaVzkwZE11bEJPNzJHSWlrd3MyOXRDN0hmVlotODJGWjJqWktHcmV3MDFIbHJHc0tUajZuTTEyQUpDUWhnd2ZKU3pRZmdGbGRHTnhfcVlpeHdPOGNNOE5wUFh5OExWQ0lOaVEtY3NUUVhQREZ3c2FWME9mN0IwZUZLRllTdDV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "The launch of Ethereum ETFs: the news from the community - The Cryptonomist",
        "content": "The crypto world is buzzing with news, July 23, 2024, will mark a crucial date for Ethereum (ETH) investors: on this date, in fact, the launch of several exchange-traded funds (ETFs) on ethereum in the United States is expected, an eagerly awaited move that could lead to a significant turning point for the cryptocurrency market.\n\nThe Securities and Exchange Commission (SEC) of the United States recently responded to the issuers regarding the final approvals for these ETFs, granting preliminary approval for at least three of the eight proposed.\n\nThe launch of Ethereum ETFs: the news from the community\n\nThe ETFs on ether cash represent a significant innovation for the US financial market. The issuers of these ETFs have worked closely with the SEC to ensure\n\nthat their registration statements become effective, thus allowing the ETFs to start trading smoothly. This intense collaboration was necessary to meet the strict regulatory requirements and to gain the necessary trust from the regulatory authorities.\n\nThe introduction of ETFs on cash ether could have a significant impact on the cryptocurrency market. ETFs represent an accessible and regulated investment tool that allows investors to gain exposure to cryptocurrencies without having to purchase them directly.\n\nThis could lead to an increase in the demand for ether, as institutional and retail investors look for safe and regulated ways to enter the bull market of cryptocurrencies.\n\nAccording to analyst John Smith, the preliminary approval by the SEC for ether ETFs is a positive signal indicating a growing recognition and acceptance of cryptocurrencies by regulatory authorities.\n\n“This move could pave the way for further financial products based on cryptocurrencies in the future, further contributing to legitimizing the cryptocurrency sector as a whole,” said Smith.\n\nWith at least three of the eight proposed ETFs on ether already preliminarily approved, the competition among issuers is becoming fierce.\n\nAmong the main contenders are high-profile financial companies such as VanEck, ProShares, and WisdomTree, all with extensive experience in managing ETFs on other asset classes. The competition between these financial giants could lead to significant innovation in the design of ether ETFs, with the goal of attracting a wide range of investors.\n\nThe regulatory challenges\n\nDespite the preliminary approval, the issuers of cash ether ETFs still face several regulatory challenges. The SEC, in fact, has expressed concerns regarding the volatility of the cryptocurrency market and the possibility of market manipulation. For this reason, the issuers must demonstrate that their products are designed to mitigate these risks and protect investors.\n\nJulie Anderson, expert in financial regulation, emphasized the importance of this verification process.\n\n“The SEC is trying to balance innovation with investor protection. Issuers must demonstrate transparency and solidity in their proposals to obtain final approval,” said Anderson.\n\nIf everything goes according to plan, the launch of cash-settled ether ETFs on July 23 could mark the beginning of a new era for the cryptocurrency market. Investors will finally have access to a regulated instrument to invest in Ether, which could lead to an increase in confidence in the cryptocurrency market and greater participation from institutional investors.\n\nFurthermore, the success of ETFs on ether could pave the way for the approval of other financial products based on cryptocurrencies, such as ETFs on other cryptocurrencies or on diversified cryptocurrency portfolios. This could further expand investment opportunities in the cryptocurrency sector and help stabilize the market in the long term.\n\nConclusion\n\nThe preliminary approval of cash ether ETFs by the SEC represents an important step towards the integration of cryptocurrencies into traditional financial markets.\n\nThe launch scheduled for July 23, 2024, is awaited with great interest by investors and industry operators, as it could mark a significant turning point for the cryptocurrency market.\n\nHowever, it remains to be seen how the issuers will overcome the regulatory challenges and if they will manage to obtain the final approval from the SEC. In any case, the attention of the financial world will surely be focused on this historic event, which could open new perspectives for investment in cryptocurrencies."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBFMlc5M0RlNlF4ZS1neWxEUVcxNktQUGxnQkdpaEhwUWdDMG9PS2ZYTmhoWlg2R0tYLXNtYmM4cUVCTkRrTjk2em9mTXlQZXJiTlZRQU53UFNwdFJxblEyQVctaGRwcXZYdGlrWEVQeVZSdkZfTm1MeNIBfkFVX3lxTE0wei1sWTV0azZGV0JMckRNbTUtdWV1VDkxcXRzNURnZW8ycTNucHhXaXV6d2FlZXVJdGV0QjZTZlhwU295WmowcExoOWtuTnAyZjRVQThrRm91b1Q4WERvTzdQMlVIOTFqbk5qVVpBcWtfQ3Z5eVVmR2xzbm5GQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Bull Run Sustained, Bad News: Speculators Are In - Bitcoinist",
        "content": "Like Bitcoin and top altcoins, including Solana, Ethereum is holding steady. At the time of writing, it is trading above the local support at $3,300 and floating higher, targeting $3,700.\n\nSpeculators Flowing To ETH As Bulls Set Sight On $3,700\n\nThe leg up is fueled by multiple market-related factors, mainly the anticipated launch of spot Ethereum ETFs in the next few days. As seen from the daily chart, news of the United States Securities and Exchange Commission (SEC) fast-tracking the approval of 19b-4 forms sparked a wave of demand from May 20.\n\nHowever, speculators are permeating the scene even as prices remain steady and uptrend. CryptoQuant data shows that the estimated leverage ratio has risen in the past few trading days.\n\nWith this reading ticking higher, the ETH scene receives more leveraged traders keen more on profiting from price volatility rather than benefiting from what ETH as a digital asset presents.\n\nAccording to CryptoQuant, the estimated leverage ratio stood at 0.347 on July 16 before rising to 0.354 on July 17. The expansion suggests that traders are increasingly borrowing funds on perpetual trading platforms like Binance and OKX, hoping to make a killing if ETH bulls push prices above $3,700.\n\nAs prices rally, the estimated leverage ratio will likely climb even higher. The local top is at 0.358, as recorded on July 14. The all-time leverage ratio was at 0.392, registered in early July 2024.\n\nEyes On Spot Ethereum ETFs: Will It Be A Success?\n\nEthereum traders are confident that prices will rise, even breaching all-time highs, once spot ETH ETFs are launched. The latest reports show that the derivative product will launch early next week, allowing institutional investors to gain exposure.\n\nThe United States SEC has given the green light to three issuers to launch. However, it is expected that all spot Ethereum ETF applicants whose 19b-4 forms have been approved will be permitted to launch simultaneously.\n\nConfidence is high that spot Ethereum ETFs will follow the success of their spot Bitcoin ETFs. According to SosoValue, all spot Bitcoin ETF issuers manage over $53 billion of BTC as of July 18.\n\nEven so, though highly anticipated and likely to positively impact prices, the product will see a different level of demand than when spot Bitcoin ETFs launched.\n\nAnalysts pin this to Ethereum’s lower market cap and the United States SEC’s decision not to allow spot ETF issuers to stake ETH. By staking, issuers would receive rewards on behalf of their clients.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOSklYZmpsZmFnZDdHYXR3VjZ4R3dGZWxsd3AxelprWDJiSzdXY1g4SWM3cmFyUGdST0RESjBsT214WjFIRlYyT3RBdjBRb0dac2YtVW1ZVHhwbHdfa2otQWZLMHQweXhzOVNfZW9hVGR2SmxWVWI3ZjJRMEJEeUd6R285T2pKT2hGZ05Ga1MxbGE1Nm9DX2h5WWdCZFJzT2RkNG9qaE5fZHhlYjFBcmF5Z2lXUjQ4alJ0N3dscm93?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Eyes $4k Rebound ahead of July 23 - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQa2RNakI1V2trRDU5UGRTZ1JtYklJQ3ZrWU5vLWlTU3RBeW1XSVVnX0RidV9LalltdjhBSThXSnNOM1Z4bWNwSXAxdVhBVXhnQU5jRllKTWZoMnJwTVpJRHVvWFdsWTd5Tkl6eU9sVjNyWlFSSHAtYlB0X1Z1X3J4c3lFSG9wa0nSAY8BQVVfeXFMUHNZelJiU3h4SGhVTzRWbU5NTW5WaHFSQVJsU1l2V2lyY0ExU0pseU14WFA3SU8yb2c2SlZleEVmb0p5RWVZWXc3Nnhuc3lLSHJPN2p2d3hJd3JtMGRpZzZqUUtoZzVQTlFqTHRMVy1sSlhualJhSTJoR3docC11X2RTeS12YVJ5VEtLU3AyOUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Creator Vitalik Buterin Rattles Industry After Warning of Pro-Crypto Candidates - Decrypt",
        "content": "In brief Ethereum co-founder Vitalik Buterin wrote a post warning voters from supporting \"pro-crypto\" candidates that may be making superficial promises.\n\nButerin's post received a range of reactions, with one outspoken crypto startup CEO calling him \"politically naive.\"\n\nRepublicans and presidential candidate Donald Trump have increasingly embraced crypto during the 2024 election cycle.\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA blog post published by Ethereum co-founder Vitalik Buterin Wednesday urged prospective voters not to support political candidates simply because they call themselves pro-crypto.\n\nThe post elicited a wide range of reactions from crypto industry figureheads, and didn’t sit well with some of the industry’s more conservative voices—particularly Messari CEO Ryan Selkis, an increasingly vocal backer of former President Donald Trump.\n\n“Vitalik is an idealist, not a realist. He is one of the more politically naive people I have read and/or interacted with in crypto,” Selkis told Decrypt. “Moreover he’s Canadian, and he’s given thinly veiled permission to vote for the most provably authoritarian and anti-tech president in American history because he’s intellectually overconfident but politically weak.”\n\nSelkis co-founded the crypto market intelligence firm Messari in 2017. Over the past few years, he’s emerged as a political heavyweight within the crypto industry, coordinating efforts to fund a crypto-friendly political action committee, while railing against the Securities and Exchange Commission (SEC) on Twitter (aka X) for what advocates say is a regulatory war on crypto.\n\nAD\n\nAD\n\nAgainst choosing your political allegiances based on who is \"pro-crypto\"https://t.co/rEbRjZYtFB — vitalik.eth (@VitalikButerin) July 17, 2024\n\nIn his blog post, titled “Against choosing your political allegiances based on who is ‘pro-crypto,’” Buterin emphasized that supporting crypto isn’t limited to the regulatory treatment of cryptocurrencies or blockchain tech.\n\nHe argued that a politician’s stance on issues like privacy, internationalism, and even immigration are part of the larger “cypherpunk” picture—and that a candidate simply claiming they’re “pro-crypto” to get more votes isn’t a very meaningful embrace of those values.\n\n“It doesn't matter if they also support banning encrypted messaging, if they are a power-seeking narcissist, or if they push for bills that make it even harder for your Chinese or Indian friend to attend the next crypto conference,” Buterin wrote of a presiding political dialogue in the U.S. “All that politicians have to do is make sure it's easy for you to trade coins.”\n\nAD\n\nAD\n\nJake Chervinsky, the chief legal officer at venture capital firm Variant Fund, replied on Twitter that Buterin’s post had “solid points,” but that some readers were likely to draw a conclusion that Buterin himself did not explicitly state.\n\n“Too many people will read the headline as ‘Vote Biden!’ and miss the rest,” Chervinsky wrote.\n\nAnother headline for this could have been \"Don't sacrifice your cypherpunk ethos for a particular 'pro-crypto' politician or policy proposal.\" I entirely agree with that principle. Politicians will come and go. Privacy, speech, and the rule of law must be preserved. https://t.co/QrrBwoDNGu — Peter Van Valkenburgh (@valkenburgh) July 17, 2024\n\nPeter Van Valkenburgh, the director of research at Coin Center, a non-profit focused on crypto policy issues, recommended an alternative headline for Buterin’s post.\n\n\"Don't sacrifice your cypherpunk ethos for a particular 'pro-crypto' politician or policy proposal,” Van Valkenburgh suggested on Twitter. “Politicians will come and go. Privacy, speech, and the rule of law must be preserved.”\n\nIncentives aligned?\n\nCastle Island Ventures partner Nic Carter wrote that crypto already aligns with his “libertarian/conservative values,” and that it only makes sense that Republicans would embrace it. He also argued that Trump has surrounded himself with politicians that are “authentically pro-crypto,” such as his vice presidential pick Sen. J.D. Vance (R-OH) and the one-time presidential candidate Vivek Ramaswamy.\n\nButerin did not immediately respond to a request for comment from Decrypt.\n\nOn Twitter, Selkis has described November’s coming choice between President Joe Biden and Trump as an existential moment for crypto. On Wednesday, he wrote his “political allegiances [are] based on who is mentally competent to be commander-in-chief.”\n\nAD\n\nAD\n\n“I also like Trump's evolution on crypto,” the CEO added.\n\nIt's also worth noting that Vitalik's political commentary is meaningless to me, and should be to you as well if your primary focus is American politics. He is a Canadian and Russian. I humbly suggest that he fix those governments first, and stay out of American politics. — Ryan Selkis (d/acc) 🇺🇸 (@twobitidiot) July 17, 2024\n\nIndeed the former president has changed his tune on crypto since saying Bitcoin “seems like a scam” in 2021. Accepting crypto donations now while defending the industry, Trump is set to be a headline speaker at next week’s Bitcoin conference in Nashville, Tennessee.\n\nFollowing the failed assassination attempt against Trump by Thomas Matthew Crooks during a Pennsylvania rally Saturday, Selkis’ comments drew mixed reactions. “The Civil War for the country started today,” Selkis wrote, prior to posting, “Praying for peace. Preparing for war.”\n\nWithout explicitly naming any politician, Buterin wrote that a politician’s thoughts on crypto years ago are a relevant gauge for future expectations. How a politician acts when supporting freedom and supporting corporations are at odds with each other is telling too, he wrote.\n\nEmphasizing the importance of decentralization among crypto pioneers like Satoshi Nakamoto, Buterin reprised a quote from the pseudonymous creator of Bitcoin. He described Nakamoto’s response to someone doubting cryptography’s ability to solve political problems as a rare statement on the subject, and an early lesson that informed crypto’s core values.\n\n“We can win a major battle in the arms race and gain a new territory of freedom,” Satoshi wrote of peer-to-peer networks. “Governments are good at cutting off the heads of centrally controlled networks like Napster, but pure [peer-to-peer] networks like Gnutella and Tor seem to be holding their own.”\n\n“Thank you for writing this,” Linda Xie, the co-founder of Bountycaster, a bounty service for the decentralized social media network Farcaster, wrote on Twitter. Previously, she posted, “I'm not a single-issue voter on crypto and won't support someone just because they are pro-crypto.”\n\nAD\n\nAD\n\nFollowing Buterin’s blog post, Selkis wagered that Buterin wouldn’t debate him because it would reveal “how little he understands politics outside of textbooks.” Still, Selkis pondered whether Buterin could present himself one day as “a debate equal.”\n\nEdited by Andrew Hayward"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQZWZrcHJMUHhTanZiZE56anlFbW4wYm1hdzRBRVZlN2JNOFFkMXNNUWdVOW5qMTFVVTQxenZrdEdYMWtkQldSOGc5cFlqRmFfaUtrTzFtbmFDODFoSDJpd0NyOFhZQ2ZDWnRaR1Jna2pMRTh4blB6c1JLLUI4QUI0VWNmVS1ocEtjS2ZGckplaFN4UF9zM3dHcHhuLUtOZ3FGb0Nha1JIUmZ2cDlNN0pJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Breaking: Bloomberg Analyst Announces Ethereum ETF Potential Launch Date - Crypto Times",
        "content": "A recent tweet shared by Bloomberg’s analyst James Seyffart on July 15th suggests that the U.S. Securities and Exchange Commission (SEC) may be close to approving spot Ethereum Exchange-Traded Funds (ETFs).\n\nAccording to Seyffart, the SEC has requested that ETF issuers submit their final S-1 registration statements by Wednesday, with an effective date set for the following Monday.\n\nLooks like launch date for the #Ethereum ETFs will be next week on Tuesday July 23rd https://t.co/fm8RW6AvTJ — James Seyffart (@JSeyff) July 15, 2024\n\nThis timeline points to a possible launch date of Tuesday, July 23. The timing also coincides with The Bitcoin Conference in Nashville, an event expected to draw significant attention to the cryptocurrency sector.\n\nThe approval process for spot Ethereum ETFs has involved several stages. Previously, the SEC asked for updates on the necessary 19b-4 forms, which are crucial for trading new ETFs on stock exchanges. These forms are essential for implementing the ETFs, especially considering the regulator’s review cycle has undergone multiple changes and extensions in recent months.\n\nIf approved, spot Ethereum ETFs would follow a similar introduction of spot Bitcoin ETFs in the U.S. market. This progression indicates a growing acceptance of cryptocurrency-based investment products by regulatory bodies, despite previous concerns about market manipulation and investor protection.\n\nEthereum, as the second-largest crypto by market capitalization, has long been viewed as a strong candidate for ETF approval.\n\nWhile the cryptocurrency space remains optimistic about the potential approval, it’s important to note that last-minute changes or delays are still possible. The SEC’s decision will likely have significant implications for both the cryptocurrency market and traditional finance sectors."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNOHVxT1RlV3dDZXZWRElOX2VrSWdwQTdCcFFGSmc1R3N5SDgtWnNYWlVIQ0pIQy1vcmxnakhDWkZZV196c0hoXzhsaGdxMGJjOHVLcVl6N2FqYlk4MTdmczlXOEpCTGFWLUxaZVBSUGtESlNvSlRlLTZfMFlpbnRoZlBlUWxXc213bDFVRzFIdkNuX3lpeDdiWWdTaFBBR211OWRaby1LUFZucDZ1cEhHUkc1ZWVtOWZsZnhybVZDYkhUS0JaVEFoYXRoVEtkT3Y2dElVa0cwdTbSAd4BQVVfeXFMTzB2eEdzdkRpcmd6M1JzemU0RTdhejZpd0pMenNDQmZOT2U2OEtnOUJGQ3R5d1VSRXJEWFhySk9qTWpQY2wyQ25SS2lESWdsYmhSSHh4UUpPZU5uWnpvWVJPcUxaeVdMUlhDZEtEVEFDVXNPRHZZQmJkX2lMLU9QQ0JGcTUtVWp3LUlKT0ZVWHdXX0ZaX3FpVEd0eHlFLUwwcVFNLTRoVmVseFQyWkJJLWd6VFg5SGpBdEdla0xpS1l5ZWVkaE1Xem1BMy16TVZjYWFWdG5ycVZYZk5NNUp3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs to launch next Tuesday. Here’s why ETH's price could be set to explode - FXStreet",
        "content": "SEC preparing Ethereum ETFs to launch next week Tuesday after asking issuers to return final S-1s, says Bloomberg analyst.\n\nEthereum investment products raked in $72 million in inflows, its highest level since March.\n\nEthereum could set a new yearly high in the coming weeks after ETH ETF approval.\n\nEthereum is up more than 7% on Monday following updates from Bloomberg analysts that the Securities & Exchange Commission (SEC) would potentially greenlight spot ETH ETFs to launch next week Tuesday. The increased inflows across global Ethereum investment products also align with the new development, as traditional investors seem to be preparing for a potential rally ahead of the launch.\n\nDaily digest market movers: Why ETH ETFs could perform well\n\nIn an X post on Monday, Bloomberg analyst Eric Balchunas said that the SEC plans to launch Ethereum ETFs on July 23 (next Tuesday) after responding to issuers today. Balchunas highlighted that the SEC asked issuers to submit their final S-1s with fees included on Wednesday before the launch can take place.\n\nThis may be highly bullish for the entire crypto market, considering the Bitcoin conference will be taking place next week, and US presidential candidate Donald Trump is listed among the speakers.\n\nUpdate: Nate's instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided no unforeseeable last min issues of course! https://t.co/D21FD9Qf94 — Eric Balchunas (@EricBalchunas) July 15, 2024\n\nReuters also reported that three industry sources confirmed that the SEC gave \"preliminary approval\" to at least three issuers to launch their spot ETH ETF products next Tuesday, provided they submit their updated S-1s before the week runs out.\n\nEight issuers, including Grayscale, Fidelity, BlackRock, 21Shares, VanEck, Bitwise, Franklin Templeton and Invesco, will potentially launch their spot ETH ETFs on the same day.\n\nThe SEC approved issuers' ETH ETF 19b-4 filings last week but needs to greenlight their S-1 registration statements before the products can begin trading. Issuers submitted their updated S-1s with the SEC last week after the agency made light comments on them.\n\nMeanwhile, traditional investors are turning bullish on Ethereum as the ETH ETF launch draws closer. This is evidenced in the recent weekly performance of global Ethereum ETFs, which witnessed inflows of about $72 million, its highest level since the market rally in March, according to data from CoinShares.\n\nWhile some analysts have predicted that ETH ETFs may underperform, the recent growth across international Ethereum ETFs suggests otherwise. Additionally, most bullish investors speculate that ETH's low circulating supply due to locked ETH in staking protocols would allow the ETF inflows to spark a significant surge in ETH's price.\n\nEthereum CME open interest (OI) has also been growing faster than other derivatives exchanges, indicating a growing appetite among US investors for the largest altcoin.\n\nETH technical analysis: Ethereum could see a new yearly high\n\nEthereum is trading around $3,430 on Monday, up over 7% on the day. ETH's rise follows a general recovery across the crypto market after crypto investors reacted positively to presidential candidate Donald Trump's escape from gunshots during a rally in Pennsylvania.\n\nAs a result, over $23.31 million worth of ETH short positions were liquidated whereas long liquidations significantly reduced to $3.86 million in the past 24 hours.\n\nETH's Long/Short Ratio, at 1.04, also shows the shift in market sentiment. The Long/Short Ratio estimates the total number of longs versus shorts in the market. A ratio above 1 suggests bulls are in control, and vice versa if it is below 1.\n\nETH/USDT 4-hour chart\n\nThe recent change in market sentiment, combined with the potential approval of spot ETH ETFs on Tuesday, could propel ETH above the $3,974 to $4,093 resistance to set a new yearly high. On the downside, the $3,200 price level could serve as key support.\n\nIn the long term, trader @CryptoYoddha predicted that Ethereum could reach $13,654 in 2025 as its consolidation over the past few weeks suggests potential for higher growth.\n\nETH All-time chart"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQWU5SR3hEYUlHYi1zeXdCR0FFRmlyZDZucGhvUF9Xc0N0WUhXWm42TmhkQUx2Rm5Wd25iYm5tM1FNSXhKTEFuOHpya1NCczBJbkRSRWFQU2JPTVBfWkFFRHB5aGY1TnE5UWVGeFZtUDJ4eDA3M2FTc0VOTlp4amxySVBfUUdXb21iNGFMU3Z3aHRMTGvSAZgBQVVfeXFMTU1xYXlkVXlUU3lwOFBCQWxiNGh2UEthak5hWUM4dUNSYU4wbk0zQ1dEeGdBamJMSFE0OFhqQUp5YkhybE1kSnFzWGZxck4yVmhxOUFaZUNWem5qLUk3MUtfQUExYlQ4cEFrcm1FMmp4TVFONnJsRnNIb0llWWVoWWRNcnNINmtIWUlWZE9kX0pUZnhKNnRlMUM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Legendary Trader Peter Brandt Issues Extra-Bullish Ethereum Price Outlook - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nVeteran trader Peter Brandt, regarded by many as a legendary figure on the financial markets since the 1970s, has sparked a wave of optimism in the Ethereum (ETH) community with his latest analysis. Brandt, known for his expertise in technical analysis, identified bullish chart patterns suggesting a potential price surge for the leading altcoin.\n\nAdvertisement\n\nThus, Brandt pointed to a \"four-month rectangle\" on the Ethereum price chart. This technical indicator suggests a period of consolidation, where the price has been trading within a defined range. In his view, this consolidation could be a precursor to a breakout, potentially propelling the price of ETH up north.\n\nFurther bolstering his bullish outlook, Brandt identified a bullish \"horn bottom\" pattern. Explained simply, a horn bottom is a reversal pattern where the price dips down twice but fails to break a key support level, forming a hornlike shape. This pattern is often seen as a sign of accumulating buying pressure and a potential price increase.\n\nAdvertisement\n\nA perspective on $ETH\n\nSupport was found at lower boundary of 4+ month rectangle, which was a retest of the Feb completion of a horn bottom\n\nTarget, pending upside completion, is 5600+ pic.twitter.com/EThcM61KpW — Peter Brandt (@PeterLBrandt) July 15, 2024\n\nTo illustrate his analysis, Brandt reportedly shared a price chart highlighting the identified patterns and his target price for ETH. This target sits comfortably above $5,600, a significant jump from current levels.\n\nBrandt's bullish call coincides with exciting developments surrounding a potential Ethereum ETF. Industry experts suggest the SEC might grant preliminary approval to several proposals by next Tuesday, July 23.\n\nAn ETF would allow investors to gain exposure to Ethereum through a traditional investment vehicle, potentially attracting new capital and boosting the price."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNU3NZZ0FHN0ZUMnlNN0JiRTI0ejJEZGcxMUNmei11NjFwMllzYzRsUU1UT0VnYzhuMjBXV3VKSFp6LWJXaTc5TlIzdGFUVnJsOHdoYkw4RUNSVExDNFM3eXd6VWY0bi1nZUxhbFYtZHJWZkxiMGptODU4UjI3NFpublpRVUJ2N2FBMmhmdXRjNWlJOHZhanE2Wlh5TFNwdTl1cGdMMXBfMTZBaUFhclMwSUtpV2UyLTk0UjktaWM2Nzd4dGNpRTU3UHpYUGM0ZEJhY0EtU05PZUTSAd4BQVVfeXFMT2YzRS1Ia2h5VHF3UzJhbi1RV2VwNXhJajNBXzBkMUtxNGNiYkFYanJ1WGFJT3VOUXNiMTBJQmhFSkNWRFJEdDI0MGtZb0sxSVNfYTFrenFxamROYjk2MlZLX2loNHZOd1p5eldNbUw1UVZoZTNkNEY3SzFfdGcxaThra044UVBvSTNjb2c0MExjYnlkUEp2RmJrUldLLWtVQWI1Tk9NcHdkck5NRFZWSFdQQXpnNzNlRlRMZnQ0WDNDa1RBTXBZbkh6OGJLYllPekhYYVJOQ0dLa0VvY01n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Three Issuers Recieve Preliminary Approval from SEC for Spot Ethereum ETF Launches - Forbes India",
        "content": "\n\n\n\nThe United States Securities and Exchange Commission (SEC) has reportedly granted preliminary approval to at least three of the eight prominent crypto asset companies seeking to launch spot-based Ethereum exchange-traded funds (ETFs). The Ether ETFs are set to begin trading next Tuesday, July 23, marking a significant development in the crypto world and a major step forward in the ongoing efforts to bring Ethereum ETFs to the U.S. market.\n\n\n\nAccording to various reports, the SEC has provided the initial approval for BlackRock, VanEck, and Franklin Templeton. This initial approval sets the stage for the potential launch of the first-ever spot-based Ethereum ETFs in the United States. Fidelity, ARK 21Shares, Grayscale, Bitwise, and Invesco Galaxy are also in line to launch their Ether products soon, further expanding the crypto market.\n\n\n\nUpon final approval, these spot ETFs would provide investors with a regulated and potentially profitable way to gain exposure to Ethereum without directly owning the crypto. Ethereum is the second largest cryptocurrency in the global market after Bitcoin, making it a promising investment option.\n\n\n\nBitwise’s chief compliance officer, Katherine Dowling, noted that they have observed a decrease in the number of issues raised by the SEC during the amended S-1 filing process, implying that the applications are nearing the final steps of the approval process. Bitwise’s chief investment officer, Matt Hougan, also speculated that spot Ethereum ETFs could potentially attract up to ₹1,500 crores within the initial year of trading. SEC’s approval of several Bitcoin futures ETFs in 2021 has seen substantial growth and acceptance since its launch.\n\n\n\nETH is trading around ₹2,83,900, down by 2.56 percent over the last 24 hours. The likely approval of Ethereum ETFs would allow them to be listed on major exchanges, including Nasdaq, the New York Stock Exchange, and the Chicago Board Options Exchange. This move could open up a broader range of investment opportunities, further driving its adoption in the global market.\n\n\n\nHowever, it is crucial to note that preliminary approval does not guarantee final consent. The SEC still needs to make a final decision on whether to approve the ETFs based on public demands and several regulations.\n\n\n\nShashank is the founder of yMedia. He ventured into crypto in 2013 and is an ETH maximalist. Twitter: @bhardwajshash\n\n\n\n"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE1ONS1kMFM0dUtRTkhkRC1YeDhYWHpTWnlDT3MtQ1pwRWJkaEd0b2RiTFZRM05GcDZ5dG1rUkZ1RTFGNTRRclc1MTdack9DWUZzOUdIcUt4Zm5QTVF1SkdrQ2VfUTJPZjdqMVBteDF0VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "How Will Ethereum Evolve In 2025? - Jumpstart Media",
        "content": "Ethereum is a leading cryptocurrency prized for its versatility and innovation, though traders should be mindful of potential price volatility.\n\nThe cryptocurrency world, although a relatively new player in the realm of trading and investment, has nonetheless made a significant impact with its unique features. Operating on decentralized networks called blockchains, cryptocurrencies have introduced a new way of thinking about technology. While the practical applications of this system might not always seem as immediately obvious as the buzzworthy technologies like artificial intelligence (AI) and the metaverse, blockchain is nonetheless a core component of a significant tech revolution—one that is reshaping the economy and tech sector entirely.\n\nDespite its origins in the crypto space, blockchain technology is expected to evolve beyond its current scope, promising to revolutionize payment systems and financial infrastructures. An ideal future might see a hybrid model that integrates traditional financial mechanisms with blockchain’s novel features to enhance transactional efficiency and security.\n\nBlockchain facilitates direct asset transfers without the need for third-party oversight, but its decentralized nature also introduces volatility and price fluctuations. These aspects have deterred some potential traders and led others to minimize their transactions to avoid significant losses. For blockchain to be viable for daily transactions, it must advance to be both safer and compliant with established market standards.\n\nBeyond the financial industry, researchers believe blockchain can also be transformative for other industries by enhancing market efficiency and transparency. It simplifies global supply chains by reducing errors, improves tracking, ensures secure record-keeping and even enables personalized loyalty programs, to name a few. While challenges such as scalability and interoperability remain, ongoing advancements are expected to address these hurdles.\n\nIn the context of cryptocurrencies, one of their major draws is their independence from any central authority. This autonomy is particularly appealing to investors who value anonymity and security, as no institution or individual can seize their digital assets on the blockchain—except in criminal cases, of course. This feature is crucial in regions plagued by significant inflation, currency devaluation or authoritarian regimes.\n\nAdmittedly, the prices of cryptocurrencies are inherently volatile and unpredictable due to their decentralized nature. Therefore, investors must be well-prepared and adopt sophisticated strategies to grow their portfolios. For those invested in Ethereum (ETH), understanding the Ethereum price prediction for 2025 is vital for crafting a long-term investment plan that aims to maximize gains and minimize losses.\n\nEthereum’s role and innovations\n\nEthereum is the second-largest cryptocurrency in the world, trailing only behind Bitcoin. Unlike Bitcoin, ETH is not just used for trading. Ethereum is celebrated for its innovation and ingenuity, even outside of the crypto community. The Ethereum network has facilitated the rise of non-fungible tokens (NFTs) and the concepts of decentralized finance (DeFi) and decentralized applications (DApps).\n\nOperating as an open-source network, Ethereum incorporates smart contract functionality that is pivotal for DeFi. It is continuously upgraded and maintained by teams of validators, who are compensated with Ethereum tokens for their efforts. Without their assistance, transactions wouldn’t move on the system. These tokens, often referred to as gas fees, incentivize the community to keep the network secure and efficient. Unfortunately, the rising popularity of cryptocurrencies has led to increased demand and higher gas fees, which can make Ethereum less accessible to some investors.\n\nDespite high gas fees, many believe that Ethereum’s robust and secure system justifies the cost. The platform’s high security and continuous upgrades make it one of the most reliable blockchain systems worldwide.\n\nMarket trends and price action\n\n2022 has been a difficult year for Ethereum as it navigated through a bear market and the subsequent crypto winter. In 2023, much effort went towards consolidation, as there’s no way to build and achieve growth without having a firm foundation first. Nonetheless, the prices ultimately remained relatively low.\n\nHowever, by the beginning of 2024, Ethereum’s value started to climb as a result of the approval of Bitcoin exchange-traded funds (ETFs). This had long been anticipated by market participants for around a decade and was expected to have far-reaching effects on the market.\n\nThis approval helped Bitcoin reach new all-time highs, while altcoins like Ethereum managed to break through some key resistance levels. As of June 26, Ethereum has stabilized at the US$3,400 mark, with projections estimating continued growth throughout the rest of the year. The general consensus among experts is that Ethereum could get to US$20,500 by the end of the decade. This ambitious goal reflects confidence in Ethereum’s unique model and scalability solutions that continue to attract investors.\n\nLooking ahead to 2025\n\nFor cryptocurrency investors, both the short-term and long-term outlooks are crucial. Common forecasts suggest that Ethereum will hit US$5,000 by December of this year before climbing even higher in 2025. The much anticipated official approval of Ethereum-backed ETFs is expected to significantly influence this growth, though investors should stay alert to potential market corrections.\n\nBy 2025, ETH might reach a new peak at US$6,500, with its price likely oscillating between US$4,500 and US$5,500 on average. These fluctuations present opportunities to buy more and strategically expand your asset portfolio. Generally speaking, while the market’s direction in 2025 remains uncertain, an upswing could significantly enhance Ethereum’s price potential, whereas a bearish trend could lead to modest pullbacks.\n\nIn the ever-evolving world of cryptocurrency, staying informed and adaptable is key to achieving a positive outcome.\n\nAlso read:\n\nHeader Image from Unsplash"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNM19yay15QjdDRy1mZmQ4YlVOUEJQZ29manZxNmR4b1pGaXB6aE1SN3l2ZEk2TXBNM1BTSU1fVHlNd2d0QlR4dTRmT2FxN3BvNXIzM3kzWTc4QTVwUVFJdklmMFh3aG0xNUVxSERqWjhFM3JnTnR4UUdQSThOQjBnR1NGX1nSAYoBQVVfeXFMUDRjRTlkaWtVbTdpRWltMEdIUkw0QmNRcTU5OXF2TzNHNnFlS3d2ZU5FVlpreGdKQXpfQXBCVzNPdXpyUmlsTUlPNUpka0lNLWh3b2FPUGhvNHhhTzlnNWU2TDBTb0RTZ3dQNlhoSGQ5Y3N4Y3ZQQS01LURrWU8xNDRyUVZ2VkhfbU9R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum climbs 8%: A profitable week for THESE investors - AMBCrypto News",
        "content": "ETH short-term holders see profit.\n\nETH has broken resistance for the first time in weeks.\n\nEthereum [ETH] has been highlighted as one of the standout performers over the past week, with its market capitalization increasing by over 14%.\n\nAdditionally, the seven-day Market Value to Realized Value (MVRV) ratio indicated that buyers who entered the market during this period now hold their investments profitably.\n\nEthereum shows attractive trends\n\nAnalysis of data from Santiment indicated that investors who purchased Ethereum during its recent dip are now seeing substantial returns. The data revealed that ETH and several other assets experienced a significant increase in market capitalization.\n\nSpecifically, ETH’s market cap grew by over 14%, enhancing its value for holders. This increase underscored the profitability for those who bought in at lower prices.\n\nIt also highlights its attractiveness as an investment during volatile market phases.\n\nHow ETH trended\n\nAnalysis of Ethereum on a daily timeframe, as reported by AMBCrypto, showed a marked uptrend on 15th July.\n\nThe price of ETH increased by 8%, moving from approximately $3,246 to close at around $3,485. This surge pushed its price just above its short-moving average (yellow line), which had previously acted as a resistance level.\n\nThe breakthrough above this short-moving average is significant as it indicates Ethereum was able to overcome immediate resistance, suggesting a potential for further gains.\n\nHowever, as of the latest observations, it was trading with a nearly 3% decline at around $3,380.\n\nAlthough it remained slightly above the yellow line, a continued decline could push it back below this pivotal resistance-turned-support level. The ongoing trading activity near this critical juncture will determine its short-term price trajectory.\n\nShort-term holders see profit\n\nThe analysis of Ethereum’s seven-day Market Value to Realized Value (MVRV) ratio indicated that short-term holders are realizing significant profits.\n\nAccording to the data from Santiment, the MVRV ratio was around 5.6% as of this writing. This ratio, however, has seen a decline from over 9% noted on 15th July, coinciding with a downturn in ETH’s price.\n\nDespite this recent decline, the MVRV ratio remained profitable for holders. This indicates that those who invested more recently are still profiting even with the price pullback.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nThe MVRV ratio initially moved into the profit zone around 9th July and continued to rise until the recent drop. This movement suggests a generally bullish sentiment among recent buyers.\n\nHowever, the current downturn warrants monitoring to gauge the potential for sustained profitability or further corrections."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1ZX3lEMVYzZjRGTUVFU1lXV05LYjg0WWtfRE82bzVTZmZENTRQdkttWGR1UFUzZ0lhYVVDME5IeGk3YjR3SnVwVGtBYllqR3ZYRVNrS29nRVQxMDRUVVNJVjVXWXU5Q09YeVhLQmZCQWFnTGdDNE9J0gF8QVVfeXFMTjJEU2UxS1o5anY4cWEzUERBbGZKcDAzZ21fUXBtdWhpYU40eVNkS1lOa1dyWF9Cd1pIdXF3SWVsandNZ29ya3V1WEpYbl95UmV4dUExUWNaaDRJNk9tM0ZzUklDSTRIUEtKdzFUSHJiY0RiZHRVOHZhVXZjSA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Will Ethereum upstage Bitcoin post ETF launch? - AMBCrypto News",
        "content": "Market trends favor Ethereum as ETF launch nears.\n\nThe report showed a changing landscape in spot trading volume, options, Futures, and perpetual contracts.\n\nCryptocurrency markets have experienced high volatility over the last two months. Market preferences are shifting, especially since the SEC approved Ethereum [ETH] spot ETFs in May.\n\nWith the anticipated launch of ETH spot ETFs, investors are getting increasingly optimistic.\n\nAlthough ETH ETFs have yet to start trading, a report by Kaiko and a joint report from Block Scholes and Bybit showed changing market preferences.\n\nA change in trends\n\nAccording to the recently released report by Block Scholes and Bybit, there has been a massive landscape shift in spot trading volumes, futures, options, and perpetual contracts.\n\nThe report posited that Ethereum enjoyed a better volatility premium over Bitcoin [BTC]. This mainly arose from increased address activity and a positive market sentiment shift towards ETH.\n\nEthereum gains ground over Bitcoin\n\nThe ETH to BTC ratio has sustained a positive value of 0.05 since the approval of spot ETFs. This ratio is considerably higher than pre-approval levels of around 0.045.\n\nThe higher ratio shows that when the ETH spot ETFs start to trade, it will continue to outperform BTC.\n\nOverall market sentiment\n\nETH has gained more than BTC in multiple areas since the approval of ETH spot ETFs in May.\n\nAlthough the crypto market has experienced high volatility over the past two months, ETH Futures have shown more resilience and quicker recovery than Bitcoin’s Open Interest.\n\nETH’s faster recovery for its future suggested a rising positive sentiment, with many investors confident in its future.\n\nETH’s trading volume has been sustained within the same range since May. According to Kaiko, ETH’s liquidity has been sustained with 1% depth and a consistent range of $250M.\n\nThe ETF approval seems to have changed the trend after dipping below $200M and reversed the trend after SEC’s approval. Therefore, the ETF anticipation has played a critical role in improving liquidity.\n\nAdditionally, ETH perpetual contracts have experienced increased trading volume. The increase showed that investors were willing to pay a premium to hold long positions, which showed confidence in crypto’s future potential.\n\nAs reported by Kaiko, Implied Volatility surged over the past seven days. For instance, ETH options set to expire this Friday surged from 53% on the 13th of July to 62% at press time.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe surge in these contracts implied that investors were paying short positions to protect themselves against price hikes in the short run.\n\nThis market sentiment shows considerable optimism over ETH’s future, especially with upcoming ETFs this week."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNRS1rRmU4VTdYVFEtOUVSbFlQR2lKVmJ4eklvYkZsNlZUM1pfeENoMW1QNmR4b1hDOGpuMkw3RXZlMFFjTlRRZ2hKNnA2RW9wYVIySUdCV0dxMW9MSW5OTlRLWjNkaWh1aUt4M19iN2hlU1Y4SkpzaHN3QlotcV85LTR2QVBQczk0c3ZnS012bVY1SkZYRnZnZUdQXzYyS2gybUJzMWN6UDlwODBKVHd6OVNodmtoOWx5bmtSTzh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Cardano (ADA) Price Surges 40% as $240M TVL and Ethereum ETFs Emerge Bullish Catalysts - The Crypto Basic",
        "content": "Cardano (ADA) has experienced a significant price surge, trading at $0.44, up 40% over the last ten days, fueled by several internal and external factors that are generating renewed investor interest and optimism.\n\nCardano Price Crosses $0.45 First Time in 10-Days\n\nAfter having dropped to historic lows on Friday July 5, a positive shift in the US macroeconomic environment has provided a favorable backdrop for ADA’s recent rebound phase. Positive Non-Farm Payroll (NFP) and Consumer Price Index (CPI) data have bolstered investor confidence in the economic outlook, supporting the overall cryptocurrency market.\n\nFurthermore, the anticipation of Ethereum ETFs expected to launch soon has spilled over into the altcoin market, including Cardano, as investors look for promising opportunities beyond Bitcoin and Ethereum​​.\n\n- Advertisement -\n\nThe chart above shows how ADA price had slid to a 2024 bottom of $0.32 on July 5. But following the recent dovish macroeconomic reports, bulls have returned to the ADA markets with intensity.\n\nOn Tuesday July 16, ADA price briefly retested the $0.45 territory, marking 40% rebound over the last 10 days of trading. While Cardano price uptrend has mirrored the broader crypto market, on-chain data shows some internal bullish catalysts are also in play.\n\nCardano TVL Hits $240 Million Amid Market Rally\n\nOne of the key drivers of this price increase is the growing Total Value Locked (TVL) within Cardano’s decentralized finance (DeFi) ecosystem. According to DeFiLlama, TVL has risen dramatically, starting the year under 200 million ADA and now exceeding 682 million ADA.\n\nProjects like the collateralized debt protocol Indigo and the decentralized exchange Minswap have both surpassed $50 million in TVL, reflecting robust adoption and engagement​​.\n\nValued at the current prices, the total value of assets deposited on the Cardano blockchain network has now crossed $240 million for the first time in 3-weeks. Typically, an increase in TVL is often considered a major bullish signal for the native token for a few reasons.\n\n- Advertisement -\n\nFirstly, Cardano’s TVL surge is a prime indicator that daily active addresses and transaction volumes have risen, indicating strong network engagement. Secondly, it also indicates cooling selling pressure as more tokens are being locked up. This declining market supply could further accelerate ADA price rally, if the bulls remain in the driving seat.\n\nCardano Price Forecast: $0.50 Target in Sight\n\nCardano (ADA) has seen a notable bullish trend, trading at $0.43 after a 40% increase over the last 11 days. This upward momentum is reflected in the strong performance of key technical indicators, suggesting that the cryptocurrency could soon test the $0.50 resistance level.\n\nThe daily chart shows a robust uptrend as ADA has managed to climb from a recent low of $0.31 to its current price, supported by a positive Accumulation/Distribution Line (ADL).\n\nThis indicator suggests a steady inflow of capital into ADA, highlighting growing investor confidence. The Parabolic SAR (Stop and Reverse) dots are well below the current price, indicating a sustained upward trend and providing a near-term support level around $0.35.\n\nThe Relative Strength Index (RSI) is also in a favorable position, currently at 56.36, which is just below the overbought territory. This suggests that there is still room for further price appreciation before ADA becomes overextended. The recent price action has seen ADA consolidate its gains around the $0.43 mark, creating a strong base for a potential breakout.\n\nIf ADA manages to clear the immediate resistance at $0.45, the next target would be $0.50. Beyond this level, the Fibonacci extension tool points to a potential rally towards $0.55, which could be a significant milestone for Cardano. Conversely, if the price retraces, strong support is likely to be found at $0.40 and $0.35, ensuring that any pullbacks are quickly contained."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQMGxQMWpQNDMzbFhwMVFMRGtxakJvaE1hZnVHaFhkTDN3TThCRnB0dzN2Z0RLZ3h3MXViRXI2VXNxRUFrbks5M05najNES0V0cldoTVNKdklBZWpkaUNJRndUWUVQYTFRTjBmbzB0cUN3RVdDc202SjlpY3F1a0pSUldrMNIBiAFBVV95cUxNQWtkZTdjWVgwTUpXYkpZSUJoWTlicElBbEdyNHgtWXptYy15ZXo1eXdBQmM1bGNPOVh5UG9JV01Zdnhmd2FTOE0xSTdFVzcxSzVER25BS01EMzdHdE05cWZIdXVhR0hNQTByNjlnRFF3bjJndlN1N0tDbDFLblZCNVlQSUtYUFo3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF on the horizon? What market trends suggest - AMBCrypto News",
        "content": "We could see an ETH approval this week.\n\nThe approval news is based on the confidence of observers in the space.\n\nThe recent prediction of an imminent approval for an Ethereum [ETH] ETF has sparked excitement in the market, resulting in one of Ethereum’s most impressive price runs in weeks.\n\nInterestingly, despite this dynamic activity, social activity surrounding Ethereum has remained relatively calm.\n\nIs an Ethereum ETF imminent?\n\nNate Geraci’s recent speculation about the approval of an Ethereum ETF this week, while not based on specific regulatory indications, highlighted an optimistic outlook fueled by broader industry movements.\n\nHis confidence seemed to be bolstered by the recent actions of several ETF issuers, such as VanEck and 21Shares, who submitted amended registrations in the past week, in the hope of securing the SEC’s approval to list spot Ether ETFs.\n\nThis strategic move by these issuers is part of a trend where institutions are quick to follow up on the positive regulatory momentum created by the approval of a Bitcoin [BTC] ETF.\n\nGeraci’s belief reflected a broader sentiment in the crypto community that the regulatory environment was ripe for another ETF approval.\n\nAll trends look normal\n\nDespite the significant anticipation surrounding the potential approval of an Ethereum ETF, its social metrics have remained relatively stable.\n\nAccording AMBCrypto’s analysis of the Social Dominance via Santiment, its highest point in the last two weeks was about 11%. Thus, of all crypto-related conversations during that period, Ethereum was part of 11%.\n\nAs of this writing, its Social Dominance had slightly decreased to approximately 9.4%, having dropped from just over 10% the previous day.\n\nAdditionally, the Social Volume—an indicator of the total number of mentions or posts about Ethereum across various social platforms—has not shown any significant spikes.\n\nThe press time Social Volume was at around 380.\n\nPrices react to ETF approval news\n\nAMBCrypto’s look at Ethereum on a daily time frame chart highlighted a building momentum in its price.\n\nAfter a significant downturn, ETH has begun to rebound, with a notable uptrend in progress. As of the latest data, it was trading up by approximately $3.7, reaching around $3,360.\n\nThis marked its highest price point in almost two weeks and positioned it near its short moving average (yellow line).\n\nThe yellow line had acted as a resistance level at around $3,400 and $3,500 over the past two weeks.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe potential approval of an Ethereum ETF could be a pivotal factor in ETH breaking through these resistance levels.\n\nIf the ETF is approved, it could significantly boost investor confidence and increase institutional participation, potentially driving the price to reclaim its all-time high (ATH)."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPSWJsUlRqSi00WWYxd1RqQ0NCUElsaHpiNW1mUjhmRzZualNDNFNYWDMxOU9wWGNodTdSTV9ZOGctOU1NOWYzbDhaYXI3X0xqcHdIWnZhcnIwT01TbHdtcjd1Wk5HRERZZm9JVEVibnhDSkY5TUloUjRfaHlzWktLTXgtZUM1bGEzMHBCbnZJaWxsbmdMNGFsWGcxbE5hNURuYUpSdlNYaUFOOHcyRW1qVGdMVTVjbGdtMFg40gHAAUFVX3lxTE1oSkN5aGRlT0JiaVF4bl93RzllOFRqX0c5MXRLWE9oTDFMZ0ZJVkZMRHpzczNKXzdTU0VJWVNoNmF0T094ZkVBRnRHTUNoWXgzVzNSbE1LdWdfMnZBZm12Ty1Ua2phNER6N2hFWDdJVGZIZllhSDFDUElqT2hTUmVaUFZPZU9nU3V2a1ZsREZoX2RMbFpOWkwxTmJRdnpLYmlpeXhaU0pxTGZnMFcwNkxTbk45VjlpZWlFV1lRZEhybw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Targets $4,500 As SEC Gives ETH ETF Preliminary Approvals - CoinGape",
        "content": "Ethereum price increased by 2.3% in the last 24 hours to trade at $3,411 during American trading hours. The price increase of Ethereum comes as the SEC gives “preliminary approval” to at least three of eight spot ETH ETF issuers to begin trading next Tuesday. Will this set center stage for ETH price to soar past $4,000?\n\nEthereum Price Eyes $4,000 As Next Stop Before New Highs\n\nThe ETH price reached a low of $2,811 in the recent market-wide downturn, but since Bitcoin began its recovery, Ethereum’s price has been surging. On the 4-hour chart, Ethereum flashed a double bottom, which finished forming when the asset hit $3,484. What remains to be seen is whether the ETH price will break above this temporary resistance or if the bears will prevail and retest $3,300.\n\nadvertisement\n\nEthereum’s price action is trending above the 21-day, 50-day, and 200-day simple moving averages (SMA), confirming a bullish uptrend.\n\nThe Chaikin money flow (CMF) is at 0.04 and heading upwards, signaling that buying pressure is increasing on the asset. The relative strength index (RSI) has also crossed above the midpoint and is trending at 59.37 and upwards. This indicates that Ethereum’s bullish momentum is rising, and the asset is in an uptrend. Furthermore, the moving average convergence divergence (MACD) just made a bullish cross, confirming the ETH’s price action reversal from bearish to bullish.\n\nEthereum price prediction hints at the possibility of further upside movement for the asset to $4,500 and beyond. However, the ETH price may have to conquer potential resistance points around $3,570 and $3,800. On the flip side, Ethereum may find support around $3,350 if the bears prevail, which coincides with the 21-day and 50-day SMAs.\n\nHow Far will ETH ETFs Push Ethereum Price?\n\nThe main spark for Ethereum price recovery can be attributed to the preliminary approval of the Spot ETH ETFs from three issuers. According to Eric Balchunas, an ETF expert at Bloomberg, trading is expected to begin on July 23. Market analysts speculate the inflows could be more significant.\n\nUpdate: Nate's instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided no unforeseeable last min issues of course! https://t.co/D21FD9Qf94 — Eric Balchunas (@EricBalchunas) July 15, 2024\n\nInterestingly, the ETH ETF trading will begin right before the Bitcoin 2024 conference in Nashville, slated for July 25-27. Market participants speculate that the price of ETH could upstage BTC, forcing the former to be discussed in the latter’s conference.\n\nAccording to Coinalyze, ETH aggregated open interest increased by 1.5% across exchanges, with perpetuals taking the largest share of the inflows.\n\nBottom Line\n\nEthereum price surged past $3,450 as preliminary approvals for ETH ETFs sparked optimism in the market. This positive regulatory development is fueling expectations of a potential parabolic rally. The price of ETH may extend gains to $4,000 and beyond as it eyes new all-time highs.\n\nFrequently Asked Questions (FAQs) 1. What is ETH ETF? An ETH ETF, or Ethereum Exchange-Traded Fund, is a type of investment fund that tracks the price of Ethereum (ETH) and trades on traditional stock exchanges, much like shares of a company. It allows investors to gain exposure to Ethereum's price movements without directly purchasing and holding the cryptocurrency. 2. Which Issuers have been given preliminary apporval of ETH ETF? U.S. Securities and Exchange Commission (SEC) has given ETH ETF preliminary approvals to BlackRock, Franklin Templeton and VanEck. 3. Can ETH hit $4,000? Yes, Ethereum price predictions suggest that ETH will hit $4,000 soon on its way to breaking it ATH.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxPSDRvdnRycGs0UmQtNVV4ZHFYWGpwaVdvd2RyUG82bXd6RDhEblkzLWJScjduc2kwU1diRWZiWnFqaU5TYWF5ZEh2c0pkWGhnOHlkd0NmT1pOUWpubmlacHgzTXM0Vy1HTjBPZEdLejZBSnU5R2d2Q1hMTG9wTVFsbU9iSHVhWk5pSUdJNVBROVdxbkowU2lxdUFKMkhMcGxwRDYyVi1yeDZRWXNXYVFfOE4teG5pUU40UHlvY29GM1doLURlSWhJTk5nR1JDNm1GanJSNU9vQnZmdXprdU9UTmhOSnoxRS14OUFVdtIB8gFBVV95cUxNWjZwN0lYa1dvZlM4V3diS3hua2JmMHktYnlqbXloYi1xOVRlM25vbE9pY3RnSjRzampfa2tmNGhRZ2tMMWVSVFJxZ1FtdEF6bHNoczZkcFUwTUdxaElIcFNVZzRPM0pnWTBIbHFFMmtjcHR5QjNWbU9PU1dUOTd1MUtkb0V1WlBadXk5blNsanpHUE9HajFoblVkRWRMM0k1MHU2ZjBOVGVUNFVoVGI3YVMtV3pNQkZRbEdKMTkxNDA4VlF5UXVWRGNnUHNvY3U0LXNFU0NWODE3aFc2Ykhvc2U5OThFTHFCOTVLMzVSeF9hdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin jumps 3% to hit $65,000 level; Ethereum, Altcoin XRP surge 11%; here's what analysts say | Stock Market News - Mint",
        "content": "Bitcoin prices (BTC) surged over 3 per cent on Wednesday, reaching $65,758 at 12pm (India). BTC has experienced high traction among investors due to increased inflows and positive sentiments following an assassination attempt on US presidential candidate Donald Trump, which has significantly increased the odds of the former president winning the upcoming election.\n\nMajor altcoins have also benefited from BTC's rise. Ethereum (ETH), BNB, Tether, XRP (11%), Dogecoin, Cardano, Tron, Avalanche, and Shiba Inu have seen gains of up to 11% during this period. Conversely, Toncoin was among the losers, declining by over 1%.\n\n“Bitcoin has stayed strong despite the large sell off by German government. Mt. Gox settlements have started flowing to customers. This will not be a mass sell off like the German government exercise but people are still being cautious. These have been multi billion dollar sell events and yet, Bitcoin continues to hold strong. It’s good to see such liquidity in BTC, it has helped build more confidence amongst the market participants. We’re in the maturing market phase for Bitcoin. It is going through a cycle where we get to see how it reacts to large sell off events. It has proven to do well until now!,” said Nischal Shetty, CoFounder, Shardeum.\n\nOn Monday, lifetime net inflows into these ETFs exceeded $16 billion, with market bulls now aiming for the $71,500 level. Despite Mt. Gox's decision to move 91,755 BTC valued at $5.8 billion, BTC remained stable above the $65K mark, unaffected by the development.\n\nAccording to CoinSwitch Markets Desk, spot Bitcoin ETFs have attracted over $16 billion in inflows since their launch in January, with $300 million added earlier this week alone. The funds, primarily BlackRock's iShares Bitcoin Trust and Fidelity's Wise Origin Bitcoin Fund, have seen consistent inflows despite fluctuations in Bitcoin prices, highlighting strong investor demand for regulated Bitcoin exposure.\n\nThe top mover of the day remained worldcoin’s WLD (+20%), the Sam Altman related token’s long bearish run ended."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPNldXVDVGTjloOVNyZ0ZITjd1dFlrWUpjUVhrdllLenB4WHRpLUlFWktKTnRVV2NKYXRTMDQ2blF5XzdCQm81Q0ZJcW9rTmNrWmJTM1ctRlRCSVF5SmFVRS03NTBwMkxyY3ZBTV82TUdvTWd5V0llT24zdUpfSVlaTURzRTA4ZW5ZU3NWTkcxdU53QVhjTTFXc1kxMGJja3REYUJLUE03WmZvU2t6V3BTaWdEdG5JQTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Launch of Ethereum ETFs Announced, Crypto Rebounds Over 20%! Analysis from July 17, 2024 - Cointribune EN",
        "content": "Wed 17 Jul 2024 ▪ 6 min read ▪ by Family Trading ▪\n\nAfter reaching the lower part of its range, Ethereum rebounded by nearly 22%. Let’s examine together the future outlook for ETH.\n\nSituation of Ethereum (ETH) Price\n\nAfter reaching the lower part of its range around $2,900, a zone mentioned in the bearish hypothesis of the analysis of June 26, Ethereum attracted buying interest allowing it to rebound by more than 22%. In less than two weeks, the crypto price regained $3,500. It seems that this increase was accelerated by the announcement of the launch of Ethereum spot ETFs. Now, ETH has stabilized around its resistance. The most significant value zones are located on both sides of the crypto: below the current price, one can note $3,065. Above, one can identify the $3,800 zone.\n\nA value zone is a price range rich in volumes that can act as a key level for investors.\n\nAt the time of writing this text, the price of Ethereum is trading just below $3,500. The latest fluctuations of ETH show a short-term bearish trend on the verge of being reversed, which could thus signal a continuation of the medium and long-term bullish trend of the crypto. These statements can be supported by the fact that Ethereum has managed to reposition itself above the 200-day moving average. Unsurprisingly, the dynamics of Ethereum have resumed with more fervor, as evidenced by its price and oscillators. All these elements undeniably demonstrate a resurgence of buying interest in Ethereum.\n\n\n\nETH/USD Chart (1D)\n\nThe current technical analysis was carried out in collaboration with Elie FT, an investor and passionate trader in the cryptocurrency market, now an instructor at Family Trading, a community of thousands of proprietary traders active since 2017. There, you will find Lives, educational content, and mutual support around financial markets in a professional and friendly atmosphere.\n\nFocus on Derivatives (ETHUSDT)\n\nThe open interest in perpetual contracts on Ethereum seems to have followed the trajectory of its underlying asset’s price. This indicates an increase in speculative activity on ETH. Considering Ethereum’s recent rise, the predominantly seller liquidations, as well as a positive funding rate, the optimism surrounding Ethereum is evident. One can naturally conclude that this interest in ETH/USDT contracts is mostly buying-oriented, thus reinforcing the conviction of continuing the bullish momentum of the cryptocurrency.\n\nOpen Interest / Liquidations & Funding rate ETH/USDT\n\nThe liquidation heatmap of ETH/USDT over three months reveals that the previously identified liquidation zone at $2,850 has been reached and likely sparked buying interest. Now, the most prominent liquidation zones are mainly above the current price of Ethereum. Notable are the zones between $3,500 and $3,600, and just above, between $3,650 and $3,750. Higher, the most significant zone is at $3,900. Below the current price, $3,000 can still be noted. Approaching these levels could trigger massive orders, increasing the risk of a period of heightened volatility for Ethereum. These zones, therefore, represent crucial points of interest for investors.\n\nETH/USDT Liquidation Heatmap (3 months)\n\nHypotheses for Ethereum (ETH) Price\n\nIf the price of Ethereum stays above $3,065, one could anticipate a continuation of the bullish trend leading to a break above $3,500. The next resistance to consider would then be around $3,700 or even $3,800. If the bullish movement continues, it could reach $4,000 or even $4,100. At this point, this would represent an increase of more than 18%.\n\nIf the price of Ethereum fails to stay above $3,065, one could foresee a return around $2,900. The next support to take into account, if the bearish movement continues, would be around $2,800. Lower, the support at $2,720 can be noted. At this point, this would represent a decrease of about 21%.\n\nConclusion\n\nAfter reintegrating the lower part of its range, Ethereum demonstrated a significant rebound. The crypto’s buying interest thus seems to have strengthened, supported by recent announcements and a medium to long-term bullish trend that seems to be continuing. Therefore, optimism seems to dominate regarding the cryptocurrency’s future. However, it will be crucial to closely observe the price reaction to various key levels to confirm or refute current hypotheses. It is also important to remain vigilant against potential “fake outs” and market “squeezes” in each scenario. Lastly, let us remember that these analyses are based solely on technical criteria and that cryptocurrency prices can also change rapidly based on more fundamental factors.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQeXFhVlE2aURQMTBkcDZuZVZ1aG5wRkMyRmxHeldiLWVOM09wU09fVjhMTFRuNzN4LU54NE9aQUhoZDNmeGktd3lCZnM5SkVoLXdUdDlHckxKX1pQWVYtR0VPZ3IyREh1aFRrY0VsQkllU2NfUmRIemluRWJFZVI0MkpTU2ZEMC1J0gGOAUFVX3lxTE03ZTY0U2xIOVlBOTNTQ3B6c182QkdrejJrNklkajV5QjcydjU1ZnVTaW9lTVFJakM4aTZMYmVlWFR1aHFmekVCYzNoc1RyZHFPaF96MTZZTjJjcmg1UXA4eDZ0YndYbTdBNk85TTMydlFNRy0wdWtyMmVGVlBLX29vSmxyRFFhWWJYMDlDSWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Super Bullish Ethereum Price Prediction by Peter Brandt - CryptoPotato",
        "content": "Ethereum’s price has risen almost 10% in the past seven days. It is currently trading slightly below the important $3,400 mark.\n\nThis uptick is in line with the rest of the market, which is currently experiencing considerable bullish momentum following the correction that took place last week.\n\nThe price has dipped a bit in the past few hours after briefly touching $3.5K on Binance.\n\nThat said, one of the most popular prop traders with 50 years of experience, Peter Brandt, has recently commented on the ETH price, outlining the possibility of a considerable surge.\n\nIn a tweet from earlier today, Brandt shared his “perspective” on ETH, saying that “support was found at the lower boundary of 4+ month rectangle, which was a retest of the Feb completion of a horn bottom.”\n\nNow, a a horn bottom pattern in technical analysis is referred to price action identified by two downward spikes embracing a tiny middle candle, followed by a sharp rally.\n\nHere is Brandt’s chart:\n\nThe interesting bit is that he said that the target for this pattern’s resolution is above $5,600. If it happens, this would mean an increase of around 64% for ETH."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPcHhKRUg3WVk0ZGxabEp6VExBRldBeEl1b040SUVjZWJlVmZva3FELWpQWUttM3VtQV8xLUExM1NpZWtLM0dFeDRoUXZZcUtyN1o4X0szMjVZQ3IxUFNtRERaRGNyeVh4Rld6U0Fsb3IxNkpFUUZjY3cwbTkxY1JZb1RnVU9qU2p6X0FQUVdTWEZCVnh5dW1CejMxOGNnS1VDLXFiZ2tqcHQySFQ2cXlxQTUwREVDaV9wTnhOWnJON2hTNF9zZzlYVGREN05kZnprd3dnTURR0gHbAUFVX3lxTE9yZXFqaHZTUE9DcUlUc0lXNXBVTUtpZy1FMXo1TnJ0YklwNGY3RkxycFh2N3ZtVC05QnZiQS1ISG9rOTZZNlNBMDI1VHZMcFhUTEU0SHBQT1BmUlR1SnJtLXljSlF1ejNYbGlBRE82Y3hfdnlOMjNGOFRMRGhrU3M0QXFydEdQMWkzOVRMSFkybmJPYVFySFhJRFNMMEhvVS0zN0RsNlJtMGQzcEh1MFFGNkFrNHkya2tVYzcyMUN2cTUwLUVSbTdOZldTWTI0SzVnbUszOWdJM2taOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin, as Other Crypto Leaders Line Up Behind Trump, Argues Against Picking Candidates Just Because They Like Crypto - CoinDesk",
        "content": "Vitalik Buterin, as Other Crypto Leaders Line Up Behind Trump, Argues Against Picking Candidates Just Because They Like Crypto\n\nThe comments from Buterin, widely viewed as Ethereum's intellectual leader, stand in stark contrast to the strongly pro-Trump rhetoric from other well-known crypto figures.\n\nBy Margaux Nijkerk Jul 17, 2024 at 6:43 p.m. UTC"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNT0RkcFhJdk1uTmNhOHR1T1c4RTJuVWhjYm1MdVB1cEtJSlYzekJEWXVvcHV5b19rQ1BtYnNhR0otRGNxQXJqbzdtUUhCREtkZFRiTzRuR0tiNWh6Q3ZxMGI1eDkyTExOYmRFTzdyT0ZQMUY1TVEzb3Z3Q3JDdUI3Nno0SFlNNFpYaFNoTzFzRWYzMFRKMXlFSkd3UDVtSm5mRmlBdGhaalhEWk1kRUw40gG0AUFVX3lxTE9XZlVLQ0RnMVEyY0xIOGdGZTJDNUVCbThkZXFIOWFQZXVuUHRpZlE0Qk5ENnBxS2x3Yk4xbHE0T3FMYXVVcE45Q1JYUVBtR3F3THBCQ25IdExLb1IxdnJsb1RFVHhYQjdpNl9FcFlKUDZxVGVwV2FmMWJVaDBxWGd5R1hHSlBaNmtxZWNkSmdfTWR0amhvYVJpOFUtUmlBMlZUM2t3VHFJS2drV3lpTXU5QWpaRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Performs Fundamental $3,500 Breakthrough, Bitcoin (BTC) to Easily Reach $65,000, Will XRP Finally Break This Major Resistance? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum has secured a move above the $3,500 resistance level and might finally gain enough momentum for a move above $4,000 in the future. Unfortunately, however, the second-biggest asset on the market will have to face a fierce 50 EMA resistance level ahead.\n\nEthereum has demonstrated significant bullish momentum, breaking through significant resistance levels, and is currently trading at $3,358. The way the price is moving indicates that ETH has found strong support, and the bullish trend is further supported by the convergence of important moving averages.\n\nWith the recent surge, ETH has surpassed the 50 EMA at $3,312.70, paving the way for a possible run toward the next major resistance level at $3,467. Ethereum's price has been rising steadily since it hit a low of $3,091, as can be seen in the daily chart. As the RSI is currently at 55, there is still an opportunity for an increase in price before the asset is overbought.\n\nThe bullish outlook is further supported by the rising trading volume, which indicates that investors are becoming more interested and involved compared to last week.\n\nAdvertisement\n\nBitcoin aiming at $65,000?\n\nBitcoin might be on its way to $65,000 as the asset broke above $60,000 as soon as the selling winded down on the market, with large players like the German government running out of BTC to sell and pushing the market down.\n\nRight now, Bitcoin is trading at $62,894, a significant increase of around 3%. A reduction in selling pressure and a change in market sentiment have propelled this upward momentum.\n\nThe bullish view has been strengthened by Bitcoin's ability to breach multiple significant resistance levels as a result of the recent price surge. As it approaches the 50 EMA at $64,027, the daily chart displays Bitcoin comfortably above the 100 EMA at $62,580. The psychological $65,000 mark represents the next big obstacle that needs to be overcome in order to open the door to more gains.\n\nThe positive price action has also been aided by a decrease in selling pressure from major holders like the German government. This bullish narrative is also supported by on-chain data. Large transactions and overall transaction volume have noticeably increased, suggesting increased interest and activity in Bitcoin.\n\nSince more people are participating in the market and making purchases and sales, this increase in activity frequently occurs before significant price movements. But one must exercise caution at all times. Despite the bullish trend at the moment, Bitcoin needs to keep moving forward and convincingly break through the $65,000 barrier. The upward trajectory could be stopped by any large losses or increased pressure to sell.\n\nXRP hits 200 EMA\n\nXRP reached the 200 EMA resistance level after its impressive 18% price surge. The likelihood of the breakthrough is more than real, however, only time will tell how long it will take for us to witness a move above $0.52 on XRP.\n\nXRP has increased by 18% over the past day to trade at $0.5297. With the recent spike, XRP is getting closer to breaking through the crucial 200 EMA resistance level, which is currently at $0.5294. As XRP has always exhibited strength when it breaks through this resistance level, it may indicate a major bullish trend.\n\nThe daily chart indicates that XRP has overcome other significant moving average, such as the 100 EMA at $0.4870 and the 50 EMA at $0.5073. The positive outlook for XRP is influenced by a number of factors. First of all, there has been a general uptrend in market sentiment, with several cryptocurrencies seeing gains.\n\nAdditionally, investor confidence has increased due to recent partnerships and developments involving Ripple, the company that created XRP. But caution is still necessary. The 200 EMA resistance level has historically been difficult to overcome, and if XRP is unable to maintain its current momentum, there is always a chance that prices will retrace.\n\nTo determine the strength of the current uptrend, traders and investors should keep a close eye on volume and price movement. The bullish case for XRP is further supported by on-chain data, which demonstrates a significant increase in transaction volume and activity. Further gains and possibly higher price targets could result from a breakthrough above the $0.52 level, if the buying pressure persists and XRP can sustain its momentum."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPS25NUjV6cFB3MGhDb3JfR3dfTnZLRzR3ek1zQ2NjVEtCemxOZGVpRDhOME0tRlIwdzdpNldSX1gxMWVTV1VFTnJVVHFLZjBxZmRmUUJQdE1FblZuejNZcjFEZzBPLWlaSGMzLVgwdjZpYnlQM2k2MTdfWjFkR21wa3F4Z2RpR2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum ETFs Could Be Approved This Week - Cointribune EN",
        "content": "Tue 16 Jul 2024 ▪ 3 min read ▪ by Eddy S.\n\nThe ETF analyst, Nate Geraci, recently expressed his optimism regarding the imminent approval of Ethereum ETFs. According to him, there is no valid reason for these ETFs not to be launched this week. This statement has sparked significant interest within the crypto community, eagerly awaiting this new milestone for Ethereum.\n\nLaunch of Ethereum ETFs this week?\n\nGeraci, president of The ETF Store, shared his predictions on social media. He states: “Welcome to ETF launch week… I don’t know anything specific, but I don’t see any valid reason for further delay at this point. Issuers are ready for launch.” This statement reflects the growing confidence among industry experts regarding the imminent launch of spot Ethereum ETFs.\n\nThis launch of Ethereum ETFs could have a significant impact on the crypto market. Analysts, including Matt Hougan of Bitwise Asset Management, have pointed out that the minimal changes to recent ETF filings are a positive sign. This indicates that the approval process is on the right track and could materialize very soon.\n\nThe ETH crypto responds positively to this anticipation!\n\nIn the last 24 hours, the price of ETH climbed by 3.24%, reaching $3,347 at the time of writing this article. This increase is largely attributed to the anticipation of the imminent launch of Ethereum ETFs, which could further propel the value of this crypto. Analysts believe that the launch of these ETFs will attract massive institutional investments, thus increasing the demand and value of Ethereum.\n\nAs the launch date approaches, all eyes are on the SEC and the ETF issuers. The crypto community hopes that this week will mark a decisive milestone for Ethereum and open new opportunities for investors.\n\nNate Geraci’s optimism regarding the imminent approval of Ethereum ETFs reflects growing confidence in the crypto sector. If his predictions come true, this could mark a major turning point for Ethereum and the cryptocurrency market as a whole.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNX3VJVU4wUnJvcDd6N0lZU0lDWWZTT1RIaUNrdkFidTFnSHVzRlhPNDZGWjFXeDFyTnY3dk03YWtSNFVHeEZqaW9wb2FmeEdJanZta3dnSEhlR1NLWGxhcXZuQ0NfRldYd2czSXlmYzRWSnVKQnVndWJuS2hSb2JCT0U0enNDQW5QUXM4NVRCY0EwVkVnTWdjLTVIOTZ6Q1VfaG84ajYtLW1JRkMxSWMyQdIBtgFBVV95cUxPRHp3d2pGUU9KQVBGUHdFX2dCVGhhZzRsMHl0d1R0NlZ0OFZQU0JyUHBPUGlXTDBvcFdYbWtGVTVQZlhzQTJ1dVVnWmwxYUFkX2RPRTlhWkpJNE9EWVpUVldJYXpJSEtiNlZSSk0zbkU0LWN6cVc3YWxMR3BiU2xfMlNHNmVYeGtRVVVTc2xRdUNvTHVlODRFSmpoNlptUUZTdTVEM3JQU21La1RkRGZUajZGemNrQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Here’s How ETH Could Surge Above $5,000 in 2024 After Ethereum ETP Approvals: Bitwise CIO - CryptoPotato",
        "content": "Bitwise Asset Management’s Chief Investment Officer has predicted that the introduction of Ethereum Exchange-Traded Products (ETPs) will drive ether (ETH) prices to new all-time highs above $5,000 by the end of the year.\n\nThe CIO suggests that ETP flows could have a bigger impact on Ethereum than they did on Bitcoin.\n\nThe Road to Ethereum’s New All-Time-High\n\nAccording to Matt Hougan, with ETPs projected to attract $15 billion in new assets over the next 18 months and ETH currently trading at around $3,400, only 29% below its all-time high, the conditions are just right for a price rally.\n\nThe anticipated price surge for Ethereum depends on fundamental supply and demand principles. While ETPs do not alter the underlying fundamentals of ETH, they introduce new demand sources. This dynamic was observed with BTC following the launch of spot Bitcoin ETFs in January.\n\nSince then, these financial vehicles have gotten more than twice the amount of Bitcoin that miners have produced, leading to a notable price increase. Bitcoin has risen approximately 25% since the ETP launch and over 110% since the market began factoring in the possible products in October 2023.\n\nHowever, Matt warned that the first few weeks after the ETP launch might experience some volatility. This could happen because the $11 billion Grayscale Ethereum Trust (ETHE) is switching to an ETP, which might cause short-term selling. Despite this, the CIO is confident that by the end of the year, ETH will hit new record highs, with even greater gains possible if more money flows in than expected.\n\nEthereum’s ETP Gains Might Be Bigger Than Bitcoins\n\nSeveral factors suggest that Ethereum could experience even higher gains from ETP inflows than Bitcoin. When Bitcoin ETPs launched, the asset’s inflation rate stood at 1.7%, requiring $16 billion of annual BTC purchases to maintain equilibrium.\n\nEthereum’s inflation rate over the past year has been 0%, with the ETH supply remaining at 120 million. This equilibrium is due to the consumption of ETH by various Ethereum-based applications, which balances out the daily creation of new ETH. With new demand meeting zero new supply, the potential for price appreciation is high. Additionally, increased activity on the Ethereum network would further increase organic demand for ETH.\n\nAnother advantage of Ethereum is its “proof of stake” consensus mechanism. Unlike Bitcoin miners, who often need to sell their newly mined BTC to cover operational costs, Ethereum stakers do not face high direct costs and are not compelled to sell their rewards. This reduces the daily forced selling pressure on ETH, creating a more favorable supply-demand balance.\n\nCurrently, 28% of all ETH is staked and thus locked in contracts for a set period, making it unavailable for sale. An additional 13% is locked in decentralized finance smart contracts, reducing the available supply. About 40% of ETH is effectively off the market, which could amplify the impact of new demand from ETP inflows."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxPX2NudTJpNm5WVG9oNGZIOXRoZjd0R2k0S2IwRndjSDVEdmZIbE5rVWtXdk0yNFotTEZSX0pWeGtOdEdyRXBaSlhUa3FyV21kZEd0a3hvaUpuOHdfTHNSWjF2M183QnJ2RGZDWnVpbVZLRjczaFhHcGZQZ0pVR1lucWtCRmQ2dmw2QWJKLWJsVm9ySkIySTJablhSeENwallOcTZscWVVWGdOV1ZOa1hMQlVEeElsaXlaT1h4ZmRjZzhEUjFfWm9nN3VhZUlDck0xRlHSAdcBQVVfeXFMUG5QOWpWaHZCQUl2dkNKZkVEMmpjaE1UY3JyUHdGSkxJNlA2UlRDc0ExNFlDRjRna3N2MGVOV0dBczBhVGdkR2diNlZDaXRaVm9LVDZXZlNIMWZIVy12bUhfMzVXbG9QQ2VrcmFrTW5JSXphTHIxcVJ5VUFNZUdIX0UwZDg5ajlxQ0NEWW1OX3RPY01Mb1ZhU21SRGRoRlY3SG0xOWMzZHJfbFNYeEFmcjl4cTZhYVZuQm0xVTBTbUZJOVJvUDlrY3B5dFlGRFNHclZQZF9MTlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin surpasses $65,000 mark - FXStreet",
        "content": "Bitcoin price closes above the daily resistance level of $64,900, signaling a bullish move.\n\nEthereum price bulls take $3,240 threshold, indicating a transition to an upward bias.\n\nRipple price breaches the daily resistance level of $0.574, signaling a potential bullish trend on the horizon.\n\nBitcoin (BTC) closes above the daily resistance level of $64,900, with Ethereum (ETH) and Ripple (XRP) subsequently breaking through their resistance levels, indicating an emerging bullish trend.\n\nBitcoin price action signals bullish trends ahead\n\nBitcoin price surged above a descending trendline last Sunday, marking a 7% rally over the following two days and achieving a close above the daily resistance level of $64,913 by Tuesday. As of today, BTC is trading slightly up by 1.1% at $65,622 on Wednesday. Such a strong upward momentum often precedes a retracement, presenting a potential buying opportunity for investors on the sidelines.\n\nSideline buyers seeking opportunities can consider positions between the $59,200 and $57,800 levels, where the previously broken trendline resistance now serves as support. However, should BTC sustain its bullish momentum, it may advance by 2.5% from its current trading price of $65,622 to test the weekly resistance of around $67,209.\n\nOn the daily chart, the Relative Strength Index (RSI) is currently above the neutral level of 50, and the Awesome Oscillator (AO) has also flipped above its neutral level of zero. These momentum indicators strongly indicate bullish dominance.\n\nFurthermore, surpassing the $67,209 level could allow an additional 7% rise to retest its daily high of $71,997 from June 7.\n\nBTC/USDT daily chart\n\nConversely, if BTC closes below $56,405 and forms a lower low in the daily timeframe, it may signal persistent bearish sentiment. This scenario could trigger a 7.5% decline in Bitcoin's price, targeting a revisit of its daily support at $52,266.\n\nEthereum price shows potential for a rally\n\nEthereum price broke above the $3,240 level on Sunday and rallied 7.36% in the next two days. It is 1% up at $3,486 on Wednesday at the time of writing.\n\nIf the $3,240 level holds as support and ETH closes above the $3,524 level, it could increase 6%, targeting a retest of its daily high from June 9 at $3,721.\n\nThe Relative Strength Index (RSI) on the daily chart is trading above the neutral level of 50, and the Awesome Oscillator (AO) is on its way to doing the same. If bulls are indeed making a comeback, then both momentum indicators must maintain their positions above their respective mean levels. Such a development would add a tailwind to the recovery rally.\n\nETH/USDT daily chart\n\nOn the other hand, if Ethereum's daily candlestick closes below $2,817, forming a lower low in the daily timeframe, it may signal persistent bearish sentiment. This scenario could trigger a 7% decline in Ethereum's price, targeting a revisit of its daily support at $2,621.\n\nRipple price eyes a bullish move\n\nRipple price broke above the daily resistance level of $0.574 on Tuesday and is currently 1% up at $0.585 on Wednesday.\n\nIf XRP holds above the $0.574 level, it could rally 12% to retest its daily high from April 9 at $0.643.\n\nOn the daily chart, the Relative Strength Index (RSI) and the Awesome Oscillator (AO) are currently positioned above their critical thresholds of 50 and zero, respectively. These momentum indicators strongly indicate bullish dominance.\n\nXRP/USDT daily chart\n\nHowever, if Ripple's daily candlestick closes below $0.413, it indicates sustained bearish sentiment, forming a lower low in the daily timeframe. Such a scenario could lead to a 16% decline in Ripple's price, targeting a revisit of its low from March 12 at $0.347."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxNdVlDMXVPUE81VGdYcjFIYVZNSFcyOFBNVzY5aWlWMXJvdlpUWkkwLVZZb3l1NVhrYTNwYklXeFY1UmFidGctTUlpQW1vbVR6UzdLcTVoa3pvWUJQd1ZiV0NjWTZLWGh1VFZseEthcUViQkRrYnFRZHJvZ3NEMmZ6Rk9nLXdVRWhLSDBRR2ZsaHZqcWd5VTZxRWNXaTdYcnBrdlkwVWpaTTN3VVBZTHl4d3NjbGI3Y09ORzFVNTI3cUEydjFNVUVZVU1DbWg4bV80YmxOY3ZJQzcyc0M2bF9RS3lRZC1SUUoxQUFITNIB8gFBVV95cUxOd3pPOEo1OVhLc2ZaaWhKTHZ5czM0T0pQTU5EVU84QVp1WVlCcnlsQzdnMVBBVFdsNVZic1AtSFItX2RHdW5lQmNJRzZXZThGUkFEVk1UaTd2LUtXdnRzV0lnYnRYTWU3dF92Y19nWExyc2FKSFVkUGowdUpRWlBOTkoxbEFGVUpWZ2xTdjFUS1pCVHBRN3poWjRxZEZvN0Vvbmd1d2FTMDJIdHg4M3JJRmczZWtmbEVOUHl2RWY1bDJHeGNRV3NVVWU1OTRnVUZjWTg4dm9yM01TMTZCblA2THpBY3VrRW9fNmV4SFdrdTgyQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum, Solana, and XRP rally with Bitcoin after Donald Trump incident and ETF hype - FXStreet",
        "content": "Crypto tokens added nearly 4% to market capitalization, pushing it to $2.52 trillion as traders digest news of the shooting at Donald Trump’s rally.\n\nSpot Ethereum ETF approval is expected this week, fueling the anticipation of Ether token holders and crypto traders.\n\nBitcoin sustains above $65,000 as Ethereum, Solana, and XRP extend gains on Wednesday.\n\nCrypto market capitalization increased nearly 4% in the last 24 hours and climbed to $2.522 trillion on Wednesday, as seen on CoinGecko. Almost all cryptocurrencies ranked in the top 10 assets by market capitalization have rallied in that period.\n\nBitcoin’s gains have likely catalyzed rallies in Ethereum, Solana, and XRP, among other assets. At the time of writing, Bitcoin trades at $65,260, and Ethereum, Solana, and XRP extend recent gains.\n\nAdditionally, Spot Ethereum ETF approval is anticipated this week, and this is likely the other key market mover for the assets.\n\nEthereum, Solana, and XRP rally amidst ETF hype, Donald Trump rally incident\n\nETF experts and analysts believe that a Spot Ethereum ETF approval is likely this week. As anticipation brews, Ether holders and traders expect gains, and the sentiment is positive, as seen on cryptoeq.io.\n\nEric Balchunas, Senior ETF analyst at Bloomberg, believes that the US Securities & Exchange Commission (SEC) will likely approve the ETF by Thursday, July 18.\n\nWe don't have a new over/under launch date yet because we haven't heard what the SEC's game plan is. Hope to hear soon. But if you forced me gun to head style to give my best guess for date I'd go with July 18th. — Eric Balchunas (@EricBalchunas) July 8, 2024\n\nCrypto traders are likely digesting the news of the events that unfolded at former US President and candidate Donald Trump’s rally on Saturday, as the shooting was followed by a rally in crypto prices. Analysts at on-chain data tracker Santiment attributed this to traders anticipating Trump’s win in the November 2024 Presidential elections and his pro-crypto stance.\n\nFormer US President Trump is scheduled to deliver a speech at a Bitcoin Conference later this month, on July 27. The Presidential candidate is expected to deliver his speech in Tennessee, in person, despite injuries sustained at the shooting.\n\nIn the last 24 hours, Ethereum, Solana and XRP extended gains by 3.2%, 4.1% and 12% respectively, per CoinGecko data. The three assets have positive returns for the last seven days period.\n\nBitcoin, Ethereum, Solana and XRP extend gains\n\nAt the time of writing, Ethereum trades at $3,488, hitting a new two-week high at $3,517 previously on the day, while XRP touched a three-month high at $0.6188."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOa1JMT2pUZko5SzRwMENWLTh0THdYUHRzUmIwcGI5Zjc1cGVUUUlsQ3phNDVfd01oVFVyekZ2U1dyek9qYU1RZ1FMa2FQOXdEa21LWllTeTJlazNPaTE2ZWotU1U4c3p5NXkwdE5ITFNRQkJWN3BFYzRSN1Z6ZGNfU18xdDRPa0xMUWlHQ21XWdIBlAFBVV95cUxPM1pUdVF3YXhiWUpuTzhlc2lzcUJabFl3OEVDbXRma2RTMGJENXVBci1ySmVZQnF0MDlPbi1FSGY4UG5FS1dtMy1JV3dLZjJBZUZ3LVBqS3J6Z0F3YTBwVm9pOW9iUTZ4aDNWaGtBNHQ4ZEc4c2RGajhDcHp2X09pMTVFSHZabFA4YmtLVUpDMERqNUJ6?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Breaking: 21Shares Reveals Spot Ethereum ETF Fee In Updated S-1 Filing - CoinGape",
        "content": "21Shares filed an amended S-1 form for its Spot Ethereum ETF (CETH) on Wednesday, July 17. It discloses key details about the Trust’s operations and fees. The filing revealed the sponsor fee to be charged once the ETF starts trading. In addition, details on a 6-month fee waiver were included.\n\n21Shares Submits Updated S-1 For Spot Ethereum ETF\n\nAccording to the SEC filing, 21Shares Core Ethereum Trust (CETH), will pay a unitary sponsor fee equivalent to 0.21% of its Ethereum (ETH) holdings. The competitive fee is in line with market expectations. Previously, VanEck’s 0.20% fee sparked speculations of lower fees by other issuers.\n\nadvertisement\n\nInterestingly, 21Shares has proposed to waive the entire sponsor fee. This waiver will stand for a six-month period after the listing of their Ethereum ETF. However, the fee waiver can also be removed when the Trust’s assets reach $500 million, whichever milestone is achieved earlier. This waiver strategy aims to attract investors by reducing operational costs during the Trust’s initial growth phase.\n\nEarlier, Bitwise offered a similar fee waiver, however, the firm is yet to announce the sponsor fee details. In addition, Invesco Galaxy also disclosed 0.25% fee in a July 9 filing. Hence, the latest revelation by 21Shares places it second in the list of competitive fee for Spot Ethereum ETFs.\n\nMoreover, the amended S-1 filing underscores 21Shares’ proactive approach in structuring its ETF to appeal to potential investors in the crypto market. Also, the latest development is in line with the potential Ether ETF launch date set for July 23.\n\nEarlier, Bloomberg reported that July 17 will see the final round of S-1 amendments with fee details. Hence, the 21Shares’ filing proves that right. Moreover, Senior Bloomberg ETF analyst, Eric Balchunas, believes that the launch should take place next Tuesday if there aren’t any last minute mishaps.\n\nAlso Read: Breaking: Ethereum ETF Staking Open For Reconsideration – SEC Commissioner\n\nWhat’s Next In Line?\n\nMoreover, reports indicate that the SEC has preliminarily approved at least four issuers. This sets the stage for imminent developments pending final procedural checks. Key stages leading up to this include the SEC’s request for updates on critical 19b-4 forms. Thereafter, the historic May 23 approval of the 19-b4 filings for the eight applicants, including BlackRock, VanEck, 21Shares, Grayscale, and others.\n\nAs 21Shares was the first one to file an updated S-1 for its Ethereum ETF application for the last round of amendments, other issuers were expected to follow suit. Hence, the other seven issuers also filed the amended S-1 forms. BlackRock revealed a fee of 0.25% while Franklin Templeton announced the lowest fee of 0.19%. However, Grayscale doubled down on charging the highest fee of 2.50% despite the Bitcoin ETF fiasco.\n\nFurthermore, the much-awaited Spot Ethereum ETF launch comes amid significant crypto events such as The Bitcoin Conference in Nashville, slated for Tuesday, July 23. Moreover, speculations swirl around heightened market attention towards these ETFs products as Donald Trump will attend the conference. Hence, the timeline makes sense as it will lead to a major hype around the launch as well as the conference.\n\nAlso Read: Ethereum ICO Wallets Deposit 3,631 ETH into Kraken Ahead of Ether ETF Approval\n\nKritika Mehta Kritika boasts over 2 years of experience in the financial news sector. Currently working as a crypto journalist at Coingape, she has consistently shown a knack for blockchain technology and cryptocurrencies. Kritika combines insightful analysis with a deep understanding of market trends. With a keen interest in technical analysis, she brings a nuanced perspective to her reporting, exploring the intersection of finance, technology, and emerging trends in the crypto space.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNNTlNN19rVTdKbU5oRHlLMzNDVU16V0NpTTNFdWxCZFdYUGhzWlFFTmZEczQ0TzNVZVh4eXVNWlVpak85QWplT0tzLTltaUdObk5lRE1QMUt5UmpiQk8yTGxmNlVvcFlud0lLeXg5RGwzcWc0QWI3UmlYWUJ6YnYzWC1lc3h0OGEzMktiaUdvRmcwR1VOTTI4QWQwam4tb1ZyUi0xeDVkOTBrdFFyXy1CMUJQZUIxZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Spikes 10% in 7 Days: Spot ETF Hopes Spurs Buyers Aiming For $3,700 - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum, more like Bitcoin, is also exploding, looking at price action in the daily chart. The liftoff is primarily due to shifting sentiment among traders. The United States SEC is also increasing expectations that they will approve all spot ETH ETF applications this week. This confidence is fueling the uptrend, confirming the breakout pattern over the weekend. As bulls pour in, prices are tracking higher—a huge development for ETH.\n\nAt press time, Ethereum is outperforming Bitcoin, looking at the performance over the past day and week. For now, ETH is up 1% in 24 hours and an impressive 11% in the past week. Moreover, there is an uptick in trading volume, pointing to interest from traders. For now, the average trading volume in 24 hours rose to over $18 billion. Once the spot ETF goes live in the next few days, it is likely that engagement will rapidly swell, fanning the upside momentum.\n\nThe following Ethereum news developments are trending today:\n\nEyes are on the United States SEC and whether they will accelerate their approval of spot ETFs in the coming days. There is speculation that the regulator will allow these derivatives to trade on July 23. With this product, analysts expect ETH to attract billions, just like spot Bitcoin ETFs did.\n\nETH continues to outperform BTC ahead of the spot ETF launch. This trend could continue in the coming days, cementing the coin’s position in crypto and narrowing its valuation gap with the world’s most valuable coin.\n\nEthereum Price Analysis\n\nETH/USD is firmly in an uptrend, gaining 11% in one week.\n\nWith prices trading above the $3,300, buyers are back in the equation.\n\nAs things stand, Ethereum buyers can choose to ride the uptrend, loading on every attempt lower with immediate targets at $3,700.\n\nNotice that ETH is within a bullish breakout, overcoming the dynamic resistance line set by the 20-day moving average. At the same time, all losses of July 4 and 5 have been reversed.\n\nWith the uptrend defined, traders can look at $3,700 and $3,900 as the immediate targets.\n\nAny unexpected dump below $3,300 cancels out this outlook."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPd0pjRHdybjlyenlRWm9rM3JHaF9nR0UwWFlVWkgtNndQeVFvbnBsWkNaZGhZYU85TFNLaE1uOW9RVEVrOTBfSDJaSENPc0tSNXZEZ0tFcVRTRG1YbzBpMGw1VkY3eURKd2RmM0tHZ1JDdkR4aW1fajc0dUlPSHZFWmlqM2FpOWFoMVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) at $3.4K and Solana (SOL) Prices Correct - The Cryptonomist",
        "content": "SPONSORED POST*\n\nTL; DR\n\nEthereum (ETH) surges above $3,400 as market sentiment improves\n\nSolana (SOL) retreats to $155 despite analysts predicting a move to $200.\n\nClandeno (CLD) is tipped to outperform the market with 40X gains after listing.\n\nEnthusiasm has returned to the crypto market after the failed assassination attempt on former U.S. President Donald Trump. This caused major cryptocurrencies to hit key price levels. Ethereum (ETH) surpassed $3,400 while Solana (SOL) marched towards the $160 mark.\n\nThis market excitement has spilled to Clandeno (CLD), a new blockchain-based e-commerce platform. Analysts laud Clandeno (CLD) as the best new cryptocurrency to buy during its live ICO. Ethereum (ETH) and Solana (SOL) investors are partially booking profits to buy CLD tokens in anticipation of the predicted 40X surge.\n\nWill Ethereum (ETH), Solana (SOL) and Clandeno (CLD) turn out to be the best altcoins to invest in? Let’s find out.\n\nEthereum (ETH) Smashes $3,400\n\nEthereum (ETH), the second largest cryptocurrency with a market cap of nearly $410 billion, was one of the biggest gainers in the past few days. Trading at $3,395 at press time, Ethereum (ETH) is up 10% in the past week. Ethereum (ETH) is taking a breather after reaching a high of $3,490 on July 16.\n\nInvestors are optimistic that Ethereum (ETH) could soon reach $4,000 as ETH spot ETFs are rumored to start trading on July 23. This will be a major win for Ethereum (ETH) and new cryptocurrencies such as Clandeno (CLD). Clandeno (CLD) is tipped for massive growth, while Ethereum (ETH) can only register modest gains for its holders.\n\nSolana (SOL) Corrects After Reaching $160\n\nSolana (SOL) jumped from $134.17 on July 12 to $160 on July 16. This marked a 19.2% jump. However, Solana (SOL) has surrendered its gains, retreating to $155.17 at press time. Analysts have come in full force, predicting that Solana (SOL) is headed to the $200 price level.\n\nSolana (SOL) is one of the best-performing assets over the last year, surging 454%. Expert analysts claim that Solana (SOL) has limited growth potential. Bullish analysts are predicting a move to $80,000 for Bitcoin. New cryptocurrencies such as Clandeno (CLD) will see huge gains when leading cryptos surge.\n\nAs Solana (SOL) corrects, investors are leaning towards Clandeno’s (CLD) live ICO.\n\nClandeno (CLD) is Set for 40X Growth\n\nClandeno (CLD) is set to transform the e-commerce industry by offering launching an innovative blockchain-based online marketplace. The new e-commerce platform will focus on addressing several challenges affecting the industry. Clandeno (CLD) will have unmatched transaction efficiency, improved security and decentralized governance.\n\nApart from its user-centric approach, Clandeno (CLD) is focused on delivering a great investor experience. This starts with launching CLD, a native token with several utilities within the Clandeno (CLD) ecosystem. With a total supply of only 525 million CLD tokens, investors are guaranteed price appreciation. The Clandeno (CLD) team will lock the liquidity pool for 20 years and team tokens for 2.5 years.\n\nInvestors are flocking to buy CLD tokens during the initial coin offering because Clandeno (CLD) is poised for 40X growth. Clandeno (CLD) has a practical utility and a growing community of investors to see an exponential price surge during the crypto bull run.\n\n\n\nTo find out more about the Clandeno presale, visit their website here.\n\n*This article was paid for. Cryptonomist did not write the article or test the platform."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOVm9nUTNBUXMwMjVOYUxkaGs1R2pTalRsckhGLVZFTW5WV3d5SlotSlIweF92THlQaWxKdjA4UUR3R2ZKN2w5U29aa3VKcGNYRm1qUDRvX0poRXFMVkVKYlhzZmRXUjVhRlVNelNRVWtIWnFVSnJBMDZQWGpmQ2RxQXJfWDZtdHJueXVsNXU0RE9pZmh4LTh3c3pVdUdQX1ZtMlVfclc2QjN6bVZIajJtcWF30gG_AUFVX3lxTE03anJKaWYxdXMzNE8xVXNPeTZ5LUdKeXAyVFFfbG81N281cTFzYmRTRDVrNVdrdnpsdV9rQW1QbVdkMWlZUGZUUmN4NkpJbTZneDlJNHN0dVpJVm90N1I5VHlJdUtzcC1EdXhqaVlDY0ZZVzBzMjFicEZQT2ZaSHJWOUpLMjJTOUFPbkFsZHdvQjh6V212OUc5bFFzZnRGY2cwTXBxa0FNX2d0WXZnQzI3R1JJT1dEVWhQYTM3UmNF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Cardano And Ethereum Price Prediction: Is A Run To $0.6 And $8,000 Possible? - Outlook India",
        "content": "As the first decentralized solution for this market, investors are capitalizing on its first-mover advantages for massive profits. Moreover, ETFSwap (ETFS) is set for beta launch following the completion of team KYC by reputable blockchain security firm SolidProof. Following the team audit, SolidProof has verified project ownership and the identity of each team member, adding more credence to the emerging platform."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNZDNVZG11aTdyZVJnbDVtU2x5UHRvNHQ2dGlQRjFucllEUVdBM3FCVmZvZG94VDhIclA1d2tjRjdSSXdmTS1UYzd3WU94ZlZobnpFYndQZGxhZDNUSmtBNnVWVnpzOC1ZcHZGeEM3cTQyRlhSWjVLWjdQZXlVbmhTM2dpX3BnYmhPN3NOVFhXSmRUd9IBlwFBVV95cUxNeGdmMXNHYkxEdEtadmlhVzFaSjVnVUxTa0Z4a1FOVWdFOExsRXlaajBzWE1tT3VGc3JaNTI2TTR0LXE5eUFnWUNrbnhVbjZZRWxYVS1ibElXYm41T1ZDeUNURGRjZDJWRTczUTZjUUcwWDc5NENZRE1va29yQmNsakZyTXRFVkhISVc1NXhjSGNCTHU5a21n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Breaking: Bloomberg Analyst Announces Spot Ethereum ETF Launch Date - CoinGape",
        "content": "Despite the increased excitement and legal processes, Bloomberg’s ETF analyst James Seyffart has shared fresh information regarding the likely timeframe for the launch of spot Ethereum ETFs in the United States.\n\nThe introduction of these financial products has been highly anticipated and shows a step forward toward furthering the adoption of cryptocurrency investment vehicles among institutional and retail investors.\n\nadvertisement\n\nSpot Ethereum ETF Launch Date Set For Tuesday\n\nThe U.S. Securities and Exchange Commission (SEC) has hinted that the final approval for the spot Ethereum ETFs could be granted as soon as next week. New information presented by Bloomberg’s Eric Balchunas indicates that the issuers have been requested to file their last S-1 registration statements, including associated fees, by Wednesday with a request for effectiveness for the following Monday.\n\nConcurrently, this preparation is in line with a possible launch on Tuesday, July 23, during significant cryptocurrency events such as The Bitcoin Conference in Nashville which Donald Trump is expected to attend. This timing is sensible because the launch is strategic and attempting to coincide with increased consumer focus.\n\nLooks like launch date for the #Ethereum ETFs will be next week on Tuesday July 23rd https://t.co/fm8RW6AvTJ — James Seyffart (@JSeyff) July 15, 2024\n\nThe previous stages included the SEC asking for updates on the appropriate 19b-4 forms, critical in trading new ETFs on stock exchanges. These forms are essential for the actual implementation of the ETFs given that the regulator’s normal review cycle has been through several changes and prolongations in the recent past.\n\nDespite some earlier setbacks, the market is still hopeful for the upcoming decision, primarily because of the positive political changes and the growing institutional interest in cryptocurrencies.\n\nEthereum (ETH) Price\n\nFollowing the announcement, Ethereum price jumped by more than 7% according to the price at the time of writing this article to stand at $3,433. The hype around Ethereum ETFs is clearly reflected in the crypto asset’s market performance with ETH’s price increasing by 14% over the last week, and 77% in the past year as of CoinMarketCap.\n\nThis has been largely due to increased expectation that these ETFs will be approved soon and once approved, they are expected to mobilize a lot of funds. Analyst Michael Van de Pope has moreover suggested that owing to the new ETFs, Ethereum may outperform even Bitcoin in the market.\n\nThe ongoing interest from financial advisors and institutional investors shows the high demand for regulated crypto investment products. Estimations are that these ETFs could attract between 0. 75% and 1% of Ethereum’s circulating supply in new investments within the first five months of its operations, stressing the possibility of great market expansion.\n\nRead Also: Donald Trump Picks Crypto-Friendly Sen J.D Vance as VP Candidate\n\nKelvin Munene Murithi Kelvin is a distinguished writer with expertise in crypto and finance, holding a Bachelor's degree in Actuarial Science. Known for his incisive analysis and insightful content, he possesses a strong command of English and excels in conducting thorough research and delivering timely cryptocurrency market updates.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNWTdLeFZGbVdyY00xUDZKTHpTMmp5bEw2Nk1Ec1ZzYm9JV25Ha1R3elhDaTI0TjFXckRZSFpDSERNVHJlb2ZrQ09FT05ycHU5ejEyVnVnd1ZzaFowdUpTR2drZFMyb1Vxd0F2SjhUSm95Z19lQTJlc3JiZ2J3U1R3Y2djdGtUeUHSAYwBQVVfeXFMTVlsOVhwdm5MYmVUSlNEYjRoQ3dCY1FqaVNFTUZhdHpkcWI1dnlLWkhyM2JEdTVNNUdpdFd5d1BJWVZlNFdCeFlGWGdlSVd3OHBsUHgyYU1jNDFJdXdOYUZ4Ni1zMTVDVkFVM3RGMlRLOTRBdEZpRlg5ZHlqdS1fWEFwT1U4MnFfSnFtT04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum To Outperform Bitcoin After Spot Ether ETF Launch: Kaiko - CoinGape",
        "content": "Institutional crypto market data provider Kaiko has projected Ethereum to outperform Bitcoin (BTC) after the launch of spot ETFs in the United States. The market anticipates the launch of spot Ethereum products with bulls projecting new market highs amid institutional inflows recorded pre-launch. ETH is down from the approvals of 19b-4 for several issues by the Securities and Exchange Commission (SEC).\n\nEthereum Growth to Surpass Bitcoin\n\nA recent report from Kaiko opines that Ethereum ETFs may push the assets above Bitcoin. The firm cited the Ether-Bitcoin price ratio amid recent fluctuations due to macro and industry factors. The price ratio of the asset relative to Bitcoin stands at 0.05 from 0.045 after the approval of 19b-4 by the SEC. A ratio shows the value of Ethereum is getting bigger than the market leader.\n\nadvertisement\n\n“The ETH to BTC, which measures the relative performance of the two assets, remains elevated around 0.05. This is significantly higher than pre-approval levels of nearly 0.045. A stronger ratio suggests ETH could continue to outperform relative to BTC following ETF launches.”\n\nIn the last two months, ETH price has plummeted 20% initial frenzy with the SEC approval. While a pullback is linked to macro factors, spot Ethereum ETFs are poised to draw in institutional flows to the market. Traditional investors have become attracted to the altcoin leader because of its smart contract functionality and the number of decentralized applications (DApps) in the ecosystem. Last year. Wealth managers picked the asset with the most growth trajectory.\n\nETH Price Hits $3500 Ahead Spot ETF Debut\n\nThis year, spot crypto ETFs have dominated market spaces with billions pouring in from investors. The approval of spot Bitcoin ETFs on Jan 11 opened the gates for renewed market optimism on the heels of a new window for institutional investments. The successes of Bitcoin products drew investors to Ethereum as crypto prices jumped to new highs. The trading of ETH products expected this summer and related optimism led to issuers filing for Solana ETFs.\n\nETH price jumped over 2% in the past 24 hours, with the price currently trading at $3,415. The 24-hour low and high are $3,330 and $3,498, respectively. Furthermore, the trading volume has increased by 50% in the last 24 hours, indicating a rise in interest among traders.\n\nAlso Read: Coinbase v SEC: Coinbase Refines Subpoena For SEC Chair Gensler\n\nDavid Pokima David is a finance news contributor with 4 years of experience in Blockchain Technology and Cryptocurrencies. He is interested in learning about emerging technologies and has an eye for breaking news. Staying updated with trends, David reported in several niches including regulation, partnerships, crypto assets, stocks, NFTs, etc. Away from the financial markets, David goes cycling and horse riding.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOWHBHZHJxWnZmWm4tMzdaTkpFOGxaYnlEQkplZ0lxLU1keU1DbXYxTEgwQ21JNm9TbDVvYTlycXlBUG9KelpXREl5b3k2R1lobEVtT19DY2xFUWNDdTJWb2EwQkxSN2Q5bGxKdXhFMjlHZXlQUGY1aHpIcEZkRlFxZU9PX3cza2ExaXRlZDBHVUlhaHVlcWxGWUFB0gGfAUFVX3lxTE5CLVpHNkhUYzVTdldOTWpGMVZrZWxFMGpKeGUzNDNqVVcwUVJEU2NuOHF2UU1qR2F0emZVeFUtdkI4RlFqYjlMUzl2dU5DSVFobnBPcnZieUZlWnZJd1ExVjNCaVQxVzdYbEI0S3E5b1JQVjYta1c2Mm44N2d3dlNEa2xJS3drbnBTWWswVkl6Qm1TSFdVU25tc2hNdDV2TQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF launch date confirmed? As ETH clears $3400, what happens next - AMBCrypto News",
        "content": "Spot Ethereum ETFs will potentially begin trading next Tuesday.\n\nThe SEC is in the process of gathering final drafts from prospective spot Ethereum ETF issuers.\n\nEthereum [ETH] rose past $3400 earlier today, posting an intraday high of $3,498 on CoinMarketCap before the momentum waned. The leading altcoin was trading at $3,445 at the time of writing – up 3.64% in the last 24 hours.\n\nThough ETH bounced back from its trip below $3,000 last week and was trading 12.8% higher in the last seven days at press time, it remained down 13.2% from its high on the 11th of March.\n\nThe latest gains come hot on the heels of reports of an imminent approval of a U.S. spot Ethereum exchange-traded fund (ETF) next week.\n\nSpot Ethereum ETF Update\n\nETF market commentator Nate Geraci firmly predicted earlier this week that the US Securities and Exchange Commission (SEC) would approve the resubmitted registration statements soon.\n\nIn a Sunday post on X (formerly Twitter), Geraci wrote,\n\n“Welcome to spot [ETH] ETF approval week. I’m calling it. Don’t know anything specific, just can’t come up [without] good reason for any further delay at this point. Issuers ready for launch.”\n\nBloomberg ETF analyst Eric Balchunas seconded Geraci in a separate post, adding that only an unforeseeable last-minute setback could delay the launch. He acknowledged,\n\n“Nate’s instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a Tuesday 7/23 Launch.”\n\nSeparately, a report from Reuters, dating the 15th of July, cited three sources indicating that the SEC would likely greenlight the applications of at least three issuers — BlackRock, VanEck, and Franklin Templeton — to begin trading “next Monday.”\n\nThis final approval milestone will depend on the issuers submitting final documents before the end of the week, according to the sources in the know.\n\nMarket anticipation\n\nThough the specific approval date remains unclear at the moment, excitement has been building up in the market in the last few weeks since the SEC approved applicants’ forms 19b-4 in May.\n\nIn June, the US SEC delivered feedback on the filed S-1 forms, highlighting areas needing review.\n\nLast week, the securities regulator asked the eight asset managers seeking approval for their spot Ethereum ETFs to submit amended S-1 registration statements.\n\nThe approval of a spot Ethereum ETF is expected to significantly impact the Ethereum market and the broader crypto industry.\n\nThe ETF offerings, which are tied to the spot price of Ether, provide investors with a new avenue to gain exposure to the altcoin through a regulated financial product.\n\nMost market analysts have predicted that the Ether ETFs could attract investment flows from institutional investors, potentially replicating the inflow of spot Bitcoin ETFs observed in the first half of the year.\n\nU.S.-spot Bitcoin ETFs have drawn in $16.12 billion in inflows since their launch earlier this year, data from Farside’s Bitcoin ETF flow table shows.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nWorth noting is the fact that the predicted launch date coincides with the week of the 2024 Bitcoin conference at Nashville.\n\nThe conference, set for the 25th to the 27th of July, will feature prominent speakers, including MicroStrategy executive chairman Michael Saylor, ARK founder Cathie Wood, independent U.S. Presidential candidate Robert Kennedy Jr, and Republican U.S. presidential candidate Donald Trump."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOOXgzbjZzci01RFZyZHR4a1BzdVVacmQwZFJrMmlzekpkSlJZUEFpVTRoamloMExHTFdrTU01UUdFaUxhV0hab1cwTFJjdWhWeC10elhCaG9sSVBKZWlQZUNMc0pramp0MWhtSDVnNkx2SVdNNUhLcjhGSVFJNEFRMkhEUdIBiAFBVV95cUxPZzdCWVo3Yk1DaVdVMWhxTThFUUpRWnRPRzZReFJUOHFrZHJLTHVxdHBQQmF3a18zQnlaei1ZdGFueTN4RjVqOTFoQ2VoYUhmNndoQVJXMzE3VThlWnNoTlhCQzBFaURXUE9ibjdTZGYtbGF0NzMtQ3A2dkFqemZzSEkxdnNjdklq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "3 Altcoins To Sell Should Ethereum Tag $5,000 Post ETF Approval - CoinGape",
        "content": "Three Ethereum ETF operators received preliminary approvals earlier in the week as Bloomberg analyst Eric Balchunas predicted trading to start next week. The news coincided with a general bullish wave in the cryptocurrency market as Bitcoin jumped above $65,000. As the market recovers following last week’s sell-off, investors may want to pay attention to altcoins to sell if Ethereum rallies to $5,000 after spot ETFs begin trading.\n\n1. Altcoins To Sell – XRP (XRP)\n\nXRP is the native coin for the XRP Ledger, a blockchain designed to help financial institutions streamline cross-border payments using a fast and cost-effective network. Ripple Labs is the company behind XRP and XRPL. It has onboarded multiple banking institutions so far and continues its crusade to onboard more.\n\nadvertisement\n\nThe price of XRP is trading around $0.5457, a 25.7% increase in the last 7 days. XRP price is displaying signs of a breakout that the entire crypto market has long awaited. Since the onset of the Ripple-SEC lawsuit in December 2020, the asset’s price has been suppressed below the $1 cent level.\n\nThe Ripple network saw a surge in adoption following news that the CME Group would launch new daily price reference rates and real-time indices for XRP and ICP beginning July 29, 2024.\n\nConsequently, whales rush to buy the crypto asset, with one big player buying 38 million XRP ($20 million).\n\nThis comes as the Ripple-SEC lawsuit shows signs of ending. Following the recent settlement between Terraform Labs (TFL) and the SEC, Ripple appealed to the court to have its penalty reduced. Subsequently, the penalty was reduced to less than $120 million. Along the same lines, the SEC dropped its investigation into Ethereum, after which 19-4b ETFs were approved. The exact process could unfold for Ripple and XRP.\n\n2. MAGA (TRUMP)\n\nMAGA is among the many Trump altcoins that mushroomed when the former American president announced his bid to vie for the November 2024 elections. The crypto project also markets itself as a charity, donating proceeds of the 1% on-chain tax on buys, sells, and transfers to veterans and Child trafficking prevention services in the United States. As of July 15, MAGA has donated $1.7 million to these causes.\n\nTRUMP is the native token of the MAGA community, and its price jumped nearly 50% from $6.34 to $$8.03 over the weekend after an assassination attempt on Donald Trump. The price of TRUMP had been rising gradually in anticipation of the upcoming Bitcoin 2024 conference in Nashville, in which the former president was slated to deliver a 30-minute speech. Following the attempt on his life, Trump has affirmed that he will still show up to the conference.\n\nAnalysis by Lookonchain and Arkham Intelligence discovered that Gigantic Rebirth’s (GCR) address, tagged “GCR Address 1,” still holds over 936,000 TRUMP tokens and has a profit of over $6.5 million.\n\nAnother address tagged \"GCR: Address 1\" still holds 936,279 $TRUMP($7.23M) and has not sold it, with a profit of more than $6.5M!https://t.co/qGFbpGAuJW pic.twitter.com/16LpqJX61e — Lookonchain (@lookonchain) July 15, 2024\n\nThis indicates that whales are still holding this altcoin. After winning the debate and escaping assassination, his odds of winning the elections may have just gone up, and with them, the price of TRUMP.\n\n3. Altcoins To Sell – Chainlink (LINK)\n\nChainlink is the glue that holds the majority of DeFi protocols together. Developed by Sergey Nazarov, Chainlink is a universal platform for blockchain builders and decentralized financial institutions. The main product of the Chainlink oracle network is the Cross-Chain Interoperability Protocol (CCIP), which allows the secure and reliable transmission of data and its value between different blockchain networks. As an oracle network, Chainlink’s services enable smart contracts to communicate securely with real-world data and services outside the blockchain network. This may impact real-world assets (RWA), DeFi, AI, and even DePIN sectors.\n\nLookonchain just spotted a whale who has secretly accumulated 12.75 million LINK ($167 million) across 93 different wallets in less than one month. Such a massive investment is a bullish signal for the crypto asset.\n\nIt seems that a mysterious whale/institution is accumulating $LINK! We noticed 93 fresh wallets withdrawing 12.75M $LINK($167M) from #Binance since June 24!https://t.co/SkqA1r0F1N pic.twitter.com/AJR4fT36VG — Lookonchain (@lookonchain) July 14, 2024\n\nChainlink price is up 2.5% in the last 24 hours to trade at $14.10. Chainlink price prediction shows strong support around $12.8, which may hold up the price if market conditions turn bearish. However, before that happens LINK is one of the altcoins to sell as you wait for the perfect entry position.\n\nLINK’s relative strength index (RSI) just crossed above the mid-point, confirming a bullish uptrend and increasing buy momentum. The moving average convergence divergence (MACD) indicator also spotted a bullish cross-over, confirming a LINK bullish reversal.\n\nConclusion\n\nWhile Ethereum’s price potentially hitting $5,000 post-ETF approval might seem like an exciting opportunity, it may also signify a good moment to reassess your altcoin holdings. As Ethereum gains momentum, some altcoins might struggle to maintain their value or relevance. XRP, LINK, and MAGA represent some altcoins to sell, allowing you to consolidate gains and potentially reinvest in more promising or stable assets.\n\nFrequently Asked Questions (FAQs) 1. Who are crypto whales? In cryptocurrency, \"whales\" refer to individuals or entities that hold a large amount of a particular cryptocurrency. These holders can significantly influence the market due to the sheer volume of their holdings. 2. What are altcoins? Altcoins, short for \"alternative coins,\" refer to any cryptocurrency other than Bitcoin including Ethereum. 3. Is Ethereum a good buy? Yes, Ethereum is a good buy. Analysts predict the Ethereum price will surpass its all time high when ETH ETFs launch.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPYnFMYUVBdm5CekFpLUZxbU5XMHFRMHg2djZJc2ZOYnpaLS0tNzFreEEzZFo5elgwT1dOc3dkUFNyOEF6NUh6TzFJbWk3ak5ISjRtSGpsYmQtbmMxT3IxY0xyRW1jTEstelhCLU92X2cxZldMenBGYlNmSlZWOWpxVE80bmFQenZQWnAyaWY1YmQ1M2VLVzVvQ0ZlMXNhNE53OEt2NENTN0hkOVlCVGt2aG5jaERLSFEzcHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs to begin trading on July 23 after US SEC gives preliminary approval - Nairametrics",
        "content": "The much-awaited spot Ethereum Exchange Traded Funds (ETFs) are set to begin trading by July 23 after the United States Securities and Exchange Commission (SEC) under Gary Gensler gave preliminary approval to some of the proposed issuers of the Ethereum ETF.\n\nThe United States SEC gave preliminary approval to three out of the eight asset managers who are proposing to issue Ethereum ETFs to their clients.\n\nThe three asset managers include Blackrock, VanEck, and Franklin Templeton and the approval hinges on applicants submitting final offering documents to regulators before the end of this week.\n\nAll eight Ethereum ETF issuers are expected to launch simultaneously according to credible sources.\n\nThe other Ethereum Etf issuers Fidelity, ARK 21Shares, Grayscale, Bitwise, and Invesco Galaxy are also expected to receive their preliminary approval from the US SEC ahead of next week’s proposed date of trading.\n\nEric Balchunas, Senior Bloomberg ETF Analyst confirmed the July 23 trading date with a post on X stating that he can confirm that the SEC has asked all issuers to submit their final S-1 fillings on Wednesday ahead of a July 23 launch.\n\n“Update: Nate’s instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided with no unforeseeable last-minute issues of course!” Eric tweeted.\n\nNairametrics earlier reported that Bitwise’s Chief Investment Officer Matt Hougan predicted that the Ethereum ETFs could attract up to $15 billion in net inflows in the first 18 months of trading pulling a similar feat to what Bitcoin ETFs launched in January achieved.\n\nMatt Hougan also expects the S-1 fillings of the issuers to be approved next week on Monday after trading hours. This will prepare it for the launch of trading the next day which is July 23.\n\nIf the S-1 fillings by the issuers are approved the spot Ether ETFs by the issuers are expected to be listed on the Nasdaq, New York Stock Exchange, and Chicago Board Options Exchange.\n\nThe Ethereum ETF is the second crypto asset to have an exchange-traded fund in the United States after Bitcoin ETFs were launched in January.\n\nThere has been speculation about a potential Solana ETF this year after Ethereum ETFs have launched.\n\nWhat to Know\n\nAn S-1 filing is a registration statement that a company files with the Securities and Exchange Commission (SEC) when it wants to go public and issue shares on a stock exchange. The form is also known as the “registration form” because it registers the company with the SEC.\n\nThe United States SEC has completed the first phase of the Ethereum ETF approval which is the approval of the 19b-4 files by the SEC in May."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNMlFYT3BEX2lrdW9BbFpoa256MXcyWXV2aXVOd0h5MEVhQXBUVHp5TjJGdjFjWEhVNXJqbjlXaS1udXA1OTdaWXNBd0d1QU9kMkZ1OENES00tS2JFOFI5bGc3NGJEX3hPNFZmQkM3eG95MmpfQnZiOHpVTzJSTVRtalVYMGhZRmNXenNCc0gwdjhRMzh3TmdHQ1dJb1BxRkY3aDd4c01tM0tzeDduei04LXlCV20zRG95dGhsb1V4eHdEQVVtMVFJYzVuNjJWRTRMVHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Solana 'No Longer In Ethereum's Shadow, SOL Could Outperform ETH,' Says Expert - Benzinga",
        "content": "Solana SOL/USD is well-positioned against Ethereum ETH/USD, according to the analysis of a prominent industry expert.\n\nWhat Happened: According to Coin Bureau CEO and co-founder Nic, Solana is already outperforming Ethereum. Comparing the two blockchains, Solana started the year with fewer tokens but has since overtaken Ethereum since its ecosystem has seen 65% more token listings in the first half of the year.\n\nWill Solana outperform Ethereum?\n\n\n\nHere are 3 charts from the recent CMC H1 report that show how it is already doing so 👇 — Nic (@nicrypto) July 15, 2024\n\nThis leads to more users and more active addresses on Solana, which has the most daily active addresses of any Layer-1 blockchain. Ethereum, in comparison, ranks fourth.\n\nSolana is “the home of NFTs” and leads in unique wallets, buyers and transactions, while Bitcoin and Ethereum lead in terms of volume.\n\nNic points to the meme coin madness driving Solana usage and awareness. \"The higher the returns, the more users they draw. It’s a degen cycle and Solana is top here,\" Nic concludes and thinks, \"Solana is no longer in Ethereum’s shadow.\"\n\nAlso Read: Solana Up 7% And Could Get To 50% Of Ethereum’s Valuation As ‘Most Liquid Election Proxy In Crypto,’ Trader Says\n\nWhy It Matters: Crypto chart analyst Ali Martinez sees bullish short-term price action coming for SOL:\n\n#Solana appears to be forming a W pattern, which suggests $SOL will surge toward $174! pic.twitter.com/OxXODWi1yA — Ali (@ali_charts) July 15, 2024\n\nA ‘W chart pattern' is formed when an asset’s price drops and then rises again before dropping once more and rising for a second time. A double bottom with a W shape signals bullish price momentum.\n\nAnother crypto trader recently confirmed a breakout for Solana, with yet another trader seeing Solana making a new all-time high later followed by a rally in ecosystem-related tokens.\n\nPrice Action: In the past 24 hours, SOL is up 3%, taking its weekly gains to 10.7%.\n\nWhat’s Next: The influence of Bitcoin as an institutional asset class is expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next:\n\nThis content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nImage: Shutterstock"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOaU1sTlM0d29nVHpOWmN5VERPTEJVelotOXlKREt6XzctOEJMTDZILWN0UnYxb24waVh6UF9ONWN4RmNtS2pPVDNFWFpWMGF3NWk2TjlWVlNWZGtaSEEzRHRVU3lSS3RTNUlFVUx1aXUwcUpDaFlSb3RTbk8wOTVXR1FsNVEzX0YySmVjQldnWjlrUk1MX0VIM1h4cXpEMnZFVEdNTEhMTjhDRGdfQ1R6UV9GT25GLU1kNE5rd1dkbWE2dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Here's how Bitcoin, Ethereum, Solana, and other tokens are performing today - NewsBytes",
        "content": "Summarize Simplifying... In short Cryptocurrency prices are on the move with BNB, XRP, Cardano, Dogecoin, and others seeing significant gains.\n\nThe top gainers of the day include Pepe, dogwifhat, FLOKI, Brett (Based), and MANTRA, while TRON, Polkadot, Starknet, Stacks, and Immutable experienced losses.\n\nThe global crypto market cap stands at $2.38 trillion, marking a 6.34% increase over the last day. Was a long read? Making it simpler... Next Article Next Article\n\nCompared to last week, Bitcoin is up nearly 12%\n\nCryptocurrency prices: Check today's rates of Bitcoin, Ethereum, Dogecoin, Polygon\n\nBy Mudit Dube 11:18 am Jul 16, 202411:18 am\n\nWhat's the story Bitcoin has climbed 2.13% in the past 24 hours to trade at $64,053.52. Compared to last week, it is 11.80% up. The second most popular token, Ethereum, has gained 3.36% from yesterday and is trading at $3,443.60. From previous week, it is up 12.36%. The market capitalization of Bitcoin and Ethereum is now at $1,258 billion and $414 billion, respectively.\n\nAltcoins\n\nHow have other prominent cryptocurrencies performed today?\n\nBNB is trading at $575.98, up 3.99% from yesterday and 11.89% up from last week. XRP's price today is $0.55 after moving up 3.82% in the last 24 hours. Compared to last week, it is 26.94% up. Cardano and Dogecoin are trading at $0.44 (up 2.13%) and $0.11 (up 5.09%), respectively.\n\nOther tokens\n\nSolana's price has increased by 11.06% since last week\n\nSolana, Polka Dot, Shiba Inu, and Polygon are currently trading at $156.75 (up 3.01%), $6.39 (down 1.57%), $0.000011 (up 7.26%), and $0.55 (up 0.77%), respectively. Looking at the weekly chart, Solana is 11.06% up while Polka Dot has moved up by 7.16%. In the last seven days, Shiba Inu has gained 18.03% of its value whereas Polygon is 8.81% up.\n\nData\n\nTop 5 gainers of the day\n\nBased on the 24 hourly movement, the top gainers are Pepe, dogwifhat, FLOKI, Brett (Based), and MANTRA. They are trading at $0.000011 (up 26.82%), $2.21 (up 24.46%), $0.00011 (up 23.89%), $0.11 (up 19.06%), and $1.29 (up 17.33%), respectively.\n\nData\n\nCheck out today's top 5 losers\n\nThe biggest losers of the day are TRON, Polkadot, Starknet, Stacks, and Immutable. They are trading at $0.11 (down 2.02%), $6.41 (down 1.41%), $0.66 (down 1.40%), $1.85 (down 1.36%), and $1.46 (down 1.24%), respectively.\n\nDeFi\n\nTake a look at today's leading DeFi tokens\n\nDeFi or decentralized finance is an umbrella term for global, peer-to-peer financial services on public blockchains. Avalanche, Chainlink, Dai, Uniswap, and Internet Computer are some of the popular DeFi tokens. They are currently trading at $27.43 (up 2.65%), $14.32 (up 4.52%), $0.99 (down 0.03%), $8.42 (down 0.21%), and $9.67 (up 10.11%), respectively.\n\nNFT\n\nHere are the top 5 NFT tokens for today\n\nNon-fungible tokens (NFTs) are cryptocurrencies that lack the attribute of fungibility, which means they cannot be exchanged for one another like other tokens. Internet Computer, Artificial Superintelligence Alliance, Stacks, Render, and Immutable are some of the prominent NFT tokens. They are currently trading at $9.76 (up 10.86%), $1.38 (up 7.21%), $1.87 (down 0.44%), $6.62 (up 2.67%), and $1.47 (down 0.49%), respectively.\n\nMarket outlook\n\nTotal cryptocurrency market capitalization\n\nThe current global crypto market cap is $2.38 trillion, a 6.34% increase over the last day. The total crypto market volume over the last 24 hours is $85.5 billion, which marks a 60.85% increase. Last month, the global crypto market cap was $2.42 trillion, compared to $2.31 trillion three months ago."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE5jU2dWTjZzRFN3VUgtbEFuQzNsUTlIWDVWa2xpZWk3bENMeFlqZmFwTG9yZGM0a3lXTWFyV3k4a3YzcENJWG1SN29Ya2hadVY5TklfZDhRTnFFVFdnYWN1cmJqUGxoeEUteXdYWnFaWGRrZ9IBd0FVX3lxTFA1bk1LcU9nQi13bFJsU29mTDMycUtKVzRHN1g1eUR3cEdMSDVYeTRldjF5TDBHcGhoSXFobllCNVNjdHVpTmRiWE1hd1R5WlhfMnFOQ19lTjB6ZXBOOFpBU003SjN0ZGZ3R3RKTHRLZDM4NW5zeC13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 03:32:46 GMT",
        "title": "Ethereum Faces $3,500 Hurdle: What’s Next for the Altcoin Giant? - NewsBTC",
        "content": "Ethereum price remained stable above the $3,400 resistance zone. ETH again tested $3,500 and seems to be struggling to continue higher.\n\nEthereum is holding gains and struggling near the $3,500 zone.\n\nThe price is trading above $3,400 and the 100-hourly Simple Moving Average.\n\nThere is a key bullish trend line forming with support at $3,350 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to rise if it clears the $3,500 and $3,550 resistance levels.\n\nEthereum Price Faces Key Hurdle, Can It Continue Higher?\n\nEthereum price remained in a bullish zone above the $3,350 resistance zone. ETH even climbed above the $3,400 resistance to move further into a positive zone. However, the price seems to be facing strong resistance near the $3,500 zone, unlike Bitcoin which surpassed $65,000.\n\nA high was formed at $3,515 and the price is now consolidating gains. The price corrected a few points and tested the 23.6% Fib retracement level of the upward wave from the $3,350 swing low to the $3,515 high.\n\nEthereum is now trading above $3,400 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support at $3,350 on the hourly chart of ETH/USD. On the upside, the price is facing resistance near the $3,500 level.\n\nThe first major resistance is near the $3,520 level. The next major hurdle is near the $3,550 level. A close above the $3,550 level might send Ether toward the $3,650 resistance.\n\nThe next key resistance is near $3,740. An upside break above the $3,740 resistance might send the price higher toward the $3,800 resistance zone in the coming days.\n\nAre Dips Supported In ETH?\n\nIf Ethereum fails to clear the $3,500 resistance, it could start a downside correction. Initial support on the downside is near $3,420 and the 61.8% Fib retracement level of the upward wave from the $3,350 swing low to the $3,515 high.\n\nThe first major support sits near the $3,350 zone and the trend line. A clear move below the $3,350 support might push the price toward $3,320. Any more losses might send the price toward the $3,250 support level in the near term. The next key support sits at $3,220.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $3,350\n\nMajor Resistance Level – $3,500"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE93Y0E1blM3WlpJbXRNdnh5WDRqY3ZXSmt0MWVLOWsxdUd0aVRJeXNLd2JRWGNvUEI0TTVrZ1plMlROSTJCaTJqM3BPZTlOTFBmN0VXcHFyV3JEcXNSUWVUNkg5bmVOVUJ3YVdjSFFCTdIBdEFVX3lxTE1hcmtZU2ZXV0F6OVJzWEtiQ0lVVFlJd1o1WFFiTHRFZHp2WVdfOVFGSl9HNDFYeS1famdSUWZjcENLaTRuaXF0dm9lWXNZZ1RkMGVvbFZza3NzLWhPRUFFSFF3dnY2QTVBcXdsYVNJekVTM0h6?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 12:02:27 GMT",
        "title": "Why Is The Ethereum Price Up Today? - NewsBTC",
        "content": "Ethereum (ETH) is up in the last 24 hours. This is thanks to a recent development suggesting that the Spot Ethereum ETFs are set to launch anytime soon. These funds are expected to positively impact ETH’s price, with the second-largest crypto token poised to reach new highs.\n\nWhy ETH Is Up Today\n\nEthereum experienced a price surge following Bloomberg analyst Eric Balchunas’ revelation that the Spot Ethereum ETFs could begin trading by July 23. Balchunas mentioned in an X (formerly Twitter) post that the US Securities and Exchange Commission (SEC) has gotten back to the fund issuers and asked them to submit their final S-1 filings by July 22.\n\nRelated Reading\n\nThe SEC also asked them to request effectiveness on July 22 so they can launch on July 23. Therefore, the Spot Ethereum ETFs should launch by next week, provided there are no “unforeseeable” last-minute issues, as noted by Balchunas. The launch of the Spot Ethereum ETFs is undoubtedly bullish for ETH, giving the amount of new money set to flow into its ecosystem through these funds.\n\nCrypto research firm K33 predicted that these Spot Ethereum ETFs could attract as much as $4.8 billion in their first five months of trading. In line with this, crypto analysts predict that Ethereum could record massive gains thanks to these inflows. Crypto analyst Linda recently predicted that the crypto token could rise to as high as $4,000 soon enough.\n\nOther analysts, like Altcoin Sherpa, have also predicted that ETH will hit $4,000 soon. Meanwhile, crypto analyst and trader Tyler Durden has provided a more bullish prediction for ETH, stating that the crypto token will rise to $10,000 “just the way the chips have fallen.”\n\nThe crypto analyst alluded to the Spot Ethereum ETFs as what will spark such a parabolic move for Ethereum. He claimed that institutional investors had put so much effort into ensuring that the Spot Ethereum ETFs were approved and that they would ensure that they made money from these funds while pumping ETH’s price.\n\nWhat The Spot Ethereum ETFs Mean For Altcoins\n\nThe Spot Ethereum ETFs launch is also expected to spark massive moves for other altcoins and is likely to kickstart the altcoin season. Crypto analyst Crypto Rover advised market participants to prepare accordingly, boldly asserting that altcoin season will start once the Spot Ethereum ETFs begin trading.\n\nRelated Reading\n\nWhy Is The Ethereum Price Up Today? 2 months ago\n\nFrom a technical perspective, crypto analyst Titan of Crypto mentioned that altcoins are ready to make major moves to the upside as Bitcoin’s dominance drops. Crypto analyst Mikybull Crypto also stated that the macro short-term correction for altcoins is about to end, meaning that the Spot Ethereum ETFs could be the catalyst that sparks a bullish reversal.\n\nAt the time of writing, ETH is trading at around $3,300, up in the last 24 hours, according to data from CoinMarketCap.\n\nFeatured image created with Dall.E, chart from Tradingview.com"
    }
]