[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxONkkxbXE3SzVrQng3SXdaNTdsYS1yWmdQSHF3WXpyczJYbi16dldXc09wdXhfcUYyZWJXM04xNEctVHFHMkd0SDlubHdVa0RFQ3lPWnZudXVTS1JHVWNtOUU3NXN1NVdoVUNzd3hlbzF0cGRRdHAtZnlZQ0lneGlhTFVXQlN4RHZyc09FSEV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "The SEC has Ethereum in its crosshairs. But does the agency think Ether is a security? - Fortune",
        "content": "For weeks, speculation has mounted that the Securities and Exchange Commission is preparing to cross the crypto Rubicon and declare Ethereum, the second-largest cryptocurrency, a security. As the deadline looms for a decision on spot Ether ETFs, the move seems like the last option for an agency seemingly determined to find reasons to reject crypto products, even though prior, high-ranking staffers had argued that Ether was a commodity and out of its wheelhouse. The implications would be catastrophic for the broader crypto industry, with even mainstays like Fidelity offering trading services for Ether.\n\nConfirmation appeared to come last Thursday when Consensys—an early developer for Ethereum, and the company behind the popular MetaMask wallet—filed a lawsuit against the SEC, revealing it had received a Wells Notice and had been the subject of a yearlong investigation into Ethereum’s security status. And then, on Monday, Consensys refiled its complaint, unredacting certain sections that had hinted the SEC officially believed Ether to be a security. The smoking gun, it turned out, was a formal order opening an investigation, signed by enforcement director Gurbir Grewal in April 2023, into the possible offers and sales of “certain securities, including, but not limited to ETH.”\n\nThe long-awaited proof was explosive. SEC Chair Gary Gensler has refused to take a stance on Ether’s security status, including under questioning by House Financial Services Committee Chair Patrick McHenry (R-N.C.) just a few days after the secret formal order, as well as when I interviewed him last November. Despite that lack of clarity, the SEC allowed the launch of Ether futures ETFs last October, which implies a view that Ether is not an unregistered security. Furthermore, despite launching a number of lawsuits against crypto companies since April 2023, the agency has never named Ether to be a security in its complaints. Predictably, the revelation drew rage from the crypto industry and beyond, with McHenry tweeting that Gensler “knowingly misled Congress.”\n\nThe whole situation seemed strange, even by the bizarro standards of the SEC versus crypto war, where reality is often obscured behind layers of bluster and exaggeration. Why would the SEC privately take such an incendiary stance, and share it with one of its main targets, while publicly contradicting itself?\n\nPart of the confusion stems from the significance of a formal order, which, according to the SEC’s enforcement manual, commission staff draft to be reviewed by the enforcement director and serves as the necessary first step to an investigation that empowers staff to subpoena witnesses and take evidence. As Lowenstein Sandler partner Christopher Gerold confirmed, formal orders are not “conclusory,” meaning they do not represent legal conclusions. That, instead, would come as part of a Wells Notice, which informs potential defendants of the end of an investigation.\n\nIn other words, just because the formal order seemed to indicate the SEC’s view that ETH is a security at the beginning of an investigation does not make it the agency’s official stance. That would also provide a more generous explanation as to why Gensler did not take a stance on ETH’s status back in April 2023—it was at the onset of the investigation, with the agency deciding whether it would diverge from the view of earlier commissions. And according to a person familiar with the issue, the Wells Notice received by Consensys this April included no language about ETH being a security.\n\nOf course, that could change if and when the SEC files its lawsuit against Consensys, which will focus on MetaMask’s status as an unregistered broker-dealer, as well as its staking products. The complaint could very well name ETH to be one of the unregistered securities offered by MetaMask. And, as Duke Financial Economics Center lecturing fellow Lee Reiners told me, all indications point to the SEC naming ETH as an unregistered security as a rationale for rejecting Ether ETFs.\n\nStill, contrary to popular opinion amid the crypto industry, the agency has not yet taken the stance. “It’s premature and inaccurate to claim that the SEC has decided anything at this point,” Reiners said. But don’t be surprised if we finally get an answer in the next few weeks.\n\nLeo Schwartz\n\nleo.schwartz@fortune.com\n\n@leomschwartz\n\nDECENTRALIZED NEWS\n\nBinance founder and former CEO Changpeng “CZ” Zhao was sentenced to four months in federal prison on Tuesday for money laundering violations, despite prosecutors requesting 36 months. (Fortune)\n\nNew York Department of Financial Services superintendent Adrienne Harris played a key role in convincing Senate Majority Leader Chuck Schumer (D-N.Y.) to support stablecoin legislation. (Politico)\n\nBlackRock led a $47 million strategic round into Securitize, the blockchain firm that helped launch its tokenized fund, BUIDL. (Fortune)\n\nArgentines are recruiting friends and strangers to sign up for the eye-scanning crypto startup Worldcoin and earn cryptocurrency. (Rest of World)\n\nProsecutors charged early crypto advocate Roger “Bitcoin Jesus” Ver with mail fraud and tax evasion charges. (Fortune)\n\nMEME O’ THE MOMENT\n\nThe jokes write themselves:"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOSW9oYURZbXlhalhsbDQ3dkt3UjBRMDY5am13cjlaRl9LcVNPbi11R0V0V0VJYTAzX2dVNFUxYjZudE41WHVnMFlGS2c1RmNobEZvbnB1RFY5am1ZTFlpUGFsYU5IdFJfdUtQcjBPT3l6c09HaXhodGloeGdfQzVXRmV6ZGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Who Holds The Most Ethereum (ETH)? How Coinbase, Grayscale, Robinhood And Binance Stack Up - Yahoo Finance",
        "content": "Who Holds The Most Ethereum (ETH)? How Coinbase, Grayscale, Robinhood And Binance Stack Up\n\nOne of the most interesting aspects of blockchain is that everything is public. All transactions, wallets and portfolios are entirely accessible to anyone, allowing for an unprecedented amount of insight into a financial asset class.\n\nThe uses of the data can range from monitoring overall trading activity and flows to seeing what the largest wallets and firms are doing with their positions. Arkham Intelligence is a blockchain analytics platform particularly interested in the second application. It cross-references financial disclosures by firms and individuals with on-chain activity to match up entities with specific wallet addresses.\n\nDon't Miss:\n\nDogecoin millionaires are increasing — investors with $1M+ in DOGE revealed!\n\nAccording to Cathie Wood, holding 6 Ethereum (ETH) could make you a millionaire, here’s why it can be true.\n\nWith Arkham's insights, anyone can see how the largest entities in crypto are trading. One interesting application is looking at the largest firms in the space.\n\nCoinbase, one of the largest crypto companies in the world, operates a centralized exchange, wallet service and a layer-2 called Base. Coinbase's portfolio is worth nearly $80 billion. The wallet is composed almost entirely of Ethereum (ETH) and Bitcoin (BTC). The firm holds over 900,000 BTC, currently worth over $55 billion. It also holds over 6.6 million ETH worth roughly $20 billion.\n\nWhile Coinbase operates as a crypto custodian, Grayscale is a crypto asset manager. It creates a handful of funds and ETFs that allow investors to access crypto products. In January, it was one of the first companies to offer a spot Bitcoin exchange-traded fund (ETF) converted from a previously released futures ETF. Grayscale's portfolio has more than 99% of its value in ETH and BTC. It owns 303,050 BTC worth $18.6 billion and 2.98 million ETH worth $9 billion. Grayscale holds $27.6 billion in crypto assets.\n\nTrending: 1 in 4 Americans own a share of Bitcoin according to NASDAQ, how much would $10 get you today?\n\nWhile it is mostly known for its equity platform, Robinhood began offering crypto several years ago. The crypto platform offers a handful of the most popular tokens, but the portfolio is mostly invested in ETH, BTC and Shiba Inu (SHIB). The wallet has 140,000 BTC worth $8.6 billion, 1.5 million ETH worth $4.7 billion and 42.5 trillion SHIB worth $1 billion.\n\nAs the largest crypto exchange in the world, it is no surprise that Binance (BNB) has the largest portfolio, worth over $200 billion. It holds 165 million BNB worth $94 billion, 640,000 BTC worth $40 billion, $27.2 billion worth of Tether (USDT) and 4.4 million ETH worth $13.2 billion.\n\nStory continues\n\nCoinbase has the largest ETH holding on the list. Its $20 billion of ETH is more than 5% of the total supply. The four firms hold a combined 15.5 million ETH, which is roughly 12.7% of the supply.\n\nWhile this may make it seem like the supply of ETH is heavily concentrated among a few entities, Coinbase, Robinhood and Binance hold assets for their customers. The portion of the supply held by these firms is under the discretion of the millions of people who hold ETH on these brokerages.\n\nRead Next:\n\nBitcoin has jumped another 45% already this year – how much would you need to get started today?\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Who Holds The Most Ethereum (ETH)? How Coinbase, Grayscale, Robinhood And Binance Stack Up originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOcE5EUFdaVGVoSU9xbUhucDhHQXhUeFdGbXF2VEtEb2xIX09tSlZnSTBkLVN5Q2pFMjdYX2ZNVUxKdlVoQ2lJdEd3YmN3ZXhvbUVrcUVRTHduZVVXZWthOVlJT0hNOFRrN2YyWXRSYlR6Y1B1ZmNDTjlaWkZFbnlTMnBMbDhxTnBzaTFWQVlqR2FKcFczTXdUc3dSYWo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum has burnt $12.7bn since the London hard fork. But that may be slowing down - DLNews",
        "content": "It's been 1,000 days since Ethereum first started burning transaction fees.\n\nBut the mechanism, which offsets new tokens issued on the network, is slowing down.\n\nMore efficient transactions, an explosion of activity on layer 2 networks, and the recent Dencun upgrade have all helped reduce the amount of Ether the network burns.\n\nWith the implementation of an upgrade known as EIP-1559 as part of the London hard fork in August 2021, Ethereum became the first blockchain to start burning a portion of the fees users spend on transactions.\n\nThat was 1,000 days ago.\n\nThe move, the blockchain’s faithful hoped, would help counterbalance the issuance of new Ether tokens on the network, creating a more sustainable monetary policy.\n\nAnd it worked. Over the following 1,000 days, Ethereum users have burnt some 4.3 million Ether, worth over $12.7 billion just by using the network.\n\nWhen Etherum slashed Ether emissions by switching to a proof-of-stake consensus mechanism in September 2022, the network became deflationary — meaning more Ether was, on average, burned by the network than new Ether was issued.\n\nBut in recent months the rate at which Ethereum is burning tokens is slowing.\n\nA combination of more efficient transactions, an explosion of activity on layer 2 networks, and the recent Dencun upgrade have all helped reduce transaction fees — and thus the amount of Ether the network burns.\n\nThe lower fees are great for users. But if Ethereum can’t attract enough activity to offset the drop, it could easily lose its deflationary status, potentially throwing its economic model into question.\n\nJoin the community to get our latest stories and updates\n\nWhy is the burn slowing?\n\nWhen Ethereum users transact on the network they must pay a fee denominated in Ether.\n\nThis fee is made up of two parts: a so-called base fee charged by the network, and a priority fee, paid to block builders as an incentive to get the transaction processed faster. Ethereum burns base fees, and gives priority fees to those processing transactions.\n\nWhen activity on Ethereum increases, the network automatically raises the base fee users must pay.\n\nThe average base fee on Ethereum must stay above 23 gwei these days to ensure the network burns enough Ether from transaction fees to keep it deflationary. Gwei is a measurement for small amounts of Ether.\n\nOver the past 1,000 days, gas fees have averaged 41 gwei. If this trend continues, Ethereum’s supply is set to shrink by 0.76% over the coming year.\n\nBut there’s reason to believe it might not.\n\nEthereum’s March 13 Dencun upgrade introduced a new feature that cut the fees Ethereum layer 2s needed to pay to submit transactions to the main Ethereum network by as much as 98%.\n\nSince Dencun, Ethereum’s transaction fees have fallen from an average of 58 gwei on March 13, to just 7 gwei on May 2.\n\nAdditionally, more users are making the jump from Ethereum to layer 2 networks — separate blockchains built on top of Ethereum that rely on it for security.\n\nAfter hitting an all-time high of over 11 million weekly transactions in 2021, transactions on Ethereum have slowly declined to around 8 million per week at the end of March.\n\nAt the same time, weekly transactions on Arbitrum and Optimism, the two biggest layer 2s, have soared to a combined 18.5 million.\n\nWith fewer users transacting on Ethereum, the demand for transactions — and thus fees paid on the network — is falling.\n\nIncreasing gas efficiency\n\nCode improvements that reduce the amount of data smart contracts on Ethereum need to handle, should also reduce fees in the coming months.\n\nFor example, decentralised exchange Uniswap, the most frequently used Ethereum DeFi protocol which users have spent over $1.4 billion in fees transacting on, has included several optimisations for its upcoming Uniswap v4 version.\n\nV4 is expected to improve gas efficiency between swaps and liquidity operations, as well as reduce the cost of creating new liquidity pools by 99%.\n\nFuture versions of other top Ethereum protocols will likely also optimise for transaction fees.\n\nTim Craig is a DeFi Correspondent at DL News. Got a tip? Email him at tim@dlnews.com."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE8zakJvNmZXVmR5Nks5QlU0dndqeFVaSmdRTEt1dGk5MTVWMDFzejczUUlTeDBuVktkRGxVeWtyd2hpc3ZKYkRfRkVBeUlJU2FDdTI1OTBBZzFWNjB4VVZhU095TXpQM2dxYXdEdVdfYVrSAXhBVV95cUxObllKSmhRVkQzbnhpTTl5bG9kMFdWZVduMTlMYURkWUZpdzZ3dm5NSUgzYmswRkhFcThQWXhVT3QtRzVreFZ1eEhjVlFqRnF0QVNfWU9URGdCZEJpOFpVYkRzUU5sMUJ2SU9nQ09UTFZiSWo4YnVUdm0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "If the SEC Thinks Ethereum Is a Security, Are ETH ETFs Doomed? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWill the SEC approve an Ethereum ETF this year?\n\nOptimism among market participants is fading—and now that the SEC’s stance on Ethereum as a security has been made public, those hopes may have been shot down for good.\n\n“If this SEC approves a spot Ethereum ETF before the election, I will eat my HODL hat,” Matthew Sigel, head of digital assets research at Van Eck, an Ethereum ETF applicant, told Decrypt.\n\nThat’s because of a lawsuit filed last week by Ethereum software company Consensys against the SEC, which revealed that the Commission believes Ethereum (ETH) to be an unregistered security—and that the SEC has, for the last year, pursued investigations on that basis. Consensys wants a court to declare Ethereum as a non-security, preempting any forthcoming charges from the SEC. (Disclosure: Consensys is one of 22 investors in Decrypt.)\n\nAD\n\nAD\n\nTo be clear, the SEC has yet to bring charges against Consensys, or anyone else, that formally allege Ethereum is a security. But the revelations in the Ethereum giant’s lawsuit have already had far-reaching implications, with top Washington lawmakers accusing SEC Chair Gary Gensler of lying to Congress last year about the agency’s position on ETH.\n\nWhile the long-term impact of SEC’s investigations into Ethereum plays out, in the more immediate term this means spot Ethereum ETFs likely aren’t happening—at least, not without another legal fight.\n\nSpot market Ethereum ETFs would allow Wall Street firms and investors to gain indirect exposure to ETH without having to deal with crypto exchanges or wallets. After a decade of denials from the SEC, spot Bitcoin ETFs finally gained approval for trading in the U.S. market in January—but only after Grayscale, one of the biggest digital asset managers in crypto, successfully sued the SEC to make it happen.\n\nStill, after Bitcoin ETFs got the green light, analysts assumed spot ETH ETFs were right behind, with approval likely by summer. Now analysts and ETF issuers on Wall Street aren’t so sure.\n\nAD\n\nAD\n\nEthereum ETF applicants are expected to hear back from the SEC regarding approval by May 23. By last month, analysts were already cooling on the prospect that these initial filings would gain approval; this week’s news has only further convinced experts that ETH ETF applications have a ways to go.\n\nEric Balchunas, Bloomberg’s senior ETF analyst, opined on Twitter this week that the SEC’s now-evident position on ETH’s security status likely means spot ETH ETFs aren’t coming to Wall Street any time soon. And that’s because ETFs based on commodities and securities operate on different rules, he said.\n\nYes dif rules, 33 act for commodities — Eric Balchunas (@EricBalchunas) April 29, 2024\n\nIt doesn’t appear, though, that the SEC’s apparent hostility towards Ethereum has spooked would-be ETH ETF issuers—at least not yet. A spokesperson for crypto fund manager 21Shares, the first-ever Ethereum ETF applicant in the U.S., told Decrypt that the firm remains committed to seeing its petition approved.\n\nVan Eck, a more traditional Wall Street investment firm, remains all-in as well.\n\nThe company’s digital assets research chief Matthew Sigel believes the product will be approved “in time.”\n\nBut he emphasized that Van Eck’s experience bringing crypto to Wall Street has never been without conflict. This week’s news constituted just one additional bump in a road the firm always expected to be long and winding.\n\n“This has been war since January of 2022, it's been a war for the entire Biden tenure,” he said. “Part of our investment thesis for this asset class is that it will continue to win the bigger battles in the courts over time.”\n\nAD\n\nAD"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOYTV5a09lVmh6MFVndDZtQWNpc3Zmbk5lZ0w2TVNRSHFYRTZuTHE1SnFoNEwzX3ViQVhjNHpTRUxPanp2SUhRdzFYaUx6MWNxU01rQURQTzlDY1lhRl85cFRkclhwR3MtQkxZeDdsbnFBQmFaU1VFaVRMUTRSdDRnZXNiRTdSaDZKNWx0dVlzZWhPQTc0NG9ERGlrTl9FbW11cldBV3BSUDdoeEhzOVd6TmpKN21hSE9HcmdrNUg5SGIyRUo2QTA00gHMAUFVX3lxTE93NzdJT1lxeHA4WmpxaE01aGhJWVZRaEJkTFlOOHNjX05TTVUyT2IyVnVvS2dmOUUzY0VPNTBoZjlFbkVxREJQXzJGRVdxdFdCWWl5RTQzSE50Z2ppT09KMHNvcXNSM2tUa21WRTlKRDBHNXFEODFvWWJWckRPNW84V242d1dyckhhSlZRVGUzT0JFUkY2bnhqb3JvSmt0Y2JVemZkajAyMTE1bnRIb015N2JiNVo5WWphbDlDbWtPeVpoRmRHMkEyc3g0Rg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Bitcoin's Ethereum-Style Programmability Could Come in 12 Months, Rootstock Founder Says - CoinDesk",
        "content": "Linus's release of BitVM last year has been widely cited by Bitcoin developers as a breakthrough for the 15-year-old blockchain since it theoretically would facilitate the development of programmable layer-2 networks similar to those that are being used in the Ethereum blockchain ecosystem to make transactions cheaper and faster. Key to the project's promise is that BitVM would require no changes to the underlying Bitcoin code – seen as crucial due to the blockchain's decentralized governance, often lacking consensus among developers over major upgrades."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNUGxpd3J0WGpKZjd0emZnMmJ0WWpRdFFjaEJzbHFnd3FrLVZQTS1qNFhxdlRLLUQ1T2JCX21mVWRiVEsxd2ZNbjJnUk9aaEwyaEZNRy1uSXBFR3k3QWVIRGZweEE3Yi1KV1NBWkFLV0Iyd0pFV2RmWVBNV2ZySDRSWEk4aERFZzlSeEVEeFUxbktlUG9QdThiSUxCZ0M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum Whales Invest another $18M as ETH Price Dips Below $3k - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOTTVHcnZPVTUzLXM2S2I1QlR6eTB1X25TUlAtSDMwX1BnTV93cG1Uc3MwU3NORHlCWlZ4SERSTGxtaUNjX0hpZTU1YXZJdThabldLdm13LVJVQ1RpbU5BVWRtZ1pHVGltOU9KQ2MtSUswN2Y5TkxJOVdYREwxVEtmZDhIV2ZOWGtSaWRYOFlxRkRJdjZ5c01z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Surged Today - The Motley Fool",
        "content": "Risk assets across the board got a boost from the Fed, with these three tokens seeing market-beating upside.\n\nThe cryptocurrency sector is getting a nice boost today from yesterday's commentary from Federal Reserve Chairman Jerome Powell. The market received a jolt from Powell's commentary in a press release; he suggested the direction of the next Fed move will most likely be lower. The market had previously priced in some chance of an interest rate hike, which appears to be off the table, at least for now.\n\nWith a more accommodative monetary policy environment likely ahead, risk assets across the curve saw a big boost over the past 24 hours. Of course, the further out on the risk curve investors go, the more protracted this move can be. For top cryptos Bitcoin (BTC -3.28%), Ethereum (ETH -2.30%), and Dogecoin (DOGE -7.20%), it's meant a 24-hour move of 3.8%, 2.2%, and 4%, respectively, as of 4 p.m. ET Thursday.\n\nAdditionally, there are some token-specific factors at play with these three tokens that investors appear to be pricing in today. Let's dive into what's moving these closely watched digital assets.\n\nThe rally continues\n\nSince hitting a new all-time high right around the time of its most recent halving, Bitcoin's rally has faltered. Expectations for a potential continuation of this fall had taken hold because of economic factors that could affect the world's largest cryptocurrency.\n\nBut with interest rate hikes seemingly off the table, analysts have grown increasingly bullish on Bitcoin over the near and medium term. Lower interest rates should bring the U.S. dollar down, inflating the price of various commodities and goods that act as stores of value. For those who buy into this thesis for Bitcoin, that's a great thing. Indeed, yesterday's press conference likely had the greatest impact on Bitcoin for this very reason.\n\nEthereum's status as a commodity or store of value of sorts is also debatable. In second position in terms of market capitalization in this sector, Ethereum should benefit from a similar trend of capital flowing into cryptocurrencies that Bitcoin investors have benefited from. That's because the market is still expecting the Securities and Exchange Commission to approve spot Ethereum ETFs at some point (though some suggest it's possible the SEC could still deem this asset a security), which should improve the supply and demand dynamics around this token. As Ethereum has shifted to a proof-of-stake protocol and taken on some deflationary measures for its token, there's a strong bull case building in the market that the same drivers that took Bitcoin on its run to record highs could be in play for Ethereum this year.\n\nDogecoin remains among the most speculative crypto assets out there, meaning it's a top choice for traders and investors looking to play short-term price swings in the market. It's no surprise that Dogecoin has seen a more pronounced move than its larger peers, for this reason alone. However, large liquidation data tied to a previous decline in these three tokens in recent days could also play a part in today's rally. Investors appear to have been looking for any reason to load up on risk and put capital to work on this dip. This recent macro catalyst appears to have provided the needed push.\n\nIs this rally poised to continue?\n\nToday's move needs to be put into context. Bitcoin declined to a low of around $58,000 per token yesterday, and while it's moving toward the $60,000 mark at the time of writing, that's still well off its all-time high of around $73,000 hit earlier this year. So, there's certainly both upside and downside potential in the near term, as this token did gap up quite quickly in short order.\n\nOther cryptocurrencies like Ethereum and Dogecoin tend to follow Bitcoin's lead, so I'd say this is the token most investors should be focused on right now. I'm of the view that if a number of bullish catalysts materialize in the coming days, it's entirely possible Bitcoin could make another run at a new high, and Ethereum and Dogecoin could follow. It's just a question of whether this specific macro catalyst can be amplified by some additional news. Right now, there's not much on my radar, so I'm going to sit out this recent pop."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQYVE4bjNXWlo3T1lWSEJIT29lNlpROTZULW1IMmU2TXdCTUZkdWR3N2pONUpmbWpxYWhicFlNQ0RNYlg2c1VLVGlsYkQ4a2RlSVNPcXVPZlhxWDlsdWd5SG9nSnNGc0VTSHpUNy1QZjJDZE5nUFZVc2RaOHJXMHdPcFdIeldPRFli0gGOAUFVX3lxTE13cjIyeEFhbjZGUmlfeTlvNVVWVm5WV2pTcjBDLUJVbG9QYjRoUkplOXRaRkZwNkpVWTVLS2pYREZGRlJRQTQyNzZXdk1IaXdVMjRJLU1IR3lQRzVjcUl5M0x0b3pWZEpJX3FaT0p1SGJTQmllREJkaVdtOVVDelhYSmlaN0NJSjZpY2ttT0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Takes Hit as Major Holder Allegedly Cashes Out - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe cryptocurrency market witnessed a significant downturn this week as Ethereum (ETH) faced a substantial drop of over 9.6% since the week began, marking its lowest values since mid-February. Currently priced at $2,950 per ETH, Tuesday saw the bulk of this decline, culminating in a weekly low of $2,817.\n\nAdvertisement\n\nETH to USD by CoinMarketCap\n\nAmid this turbulence, attention has been drawn to a suspected Ethereum Foundation address, \"0xd7,\" which reportedly sold 100 ETH for 291,267 DAI via the Cow Protocol today.\n\nThis transaction was followed by a transfer of the acquired DAI to another Ethereum Foundation address, \"0x9e.\" Notably, this suspected Ethereum Foundation address has been consistently exchanging ETH for DAI through the Cow Protocol in recent times.\n\nAdvertisement\n\nHow solid is that foundation?\n\nThe Ethereum Foundation is a nonprofit organization dedicated to the advancement of Ethereum and related technologies. According to reports from Arkham, the known accounts of the Foundation currently boast 310,867 ETH, valued at $915.15 million.\n\nExcluding exchanges and select projects, the foundation stands as one of the largest altcoin holders, with assets estimated to exceed $1 billion, encompassing holdings in WETH.E worth $91.87 million, along with 329,239 DAI — some of which arrived in foundation addresses today.\n\nThe revelation of one of the foundation's key holders offloading a portion of their ETH holdings has sparked speculation regarding its potential impact on Ethereum's future trajectory. The implications of such actions on the price of main altcoin remain uncertain, leaving investors and enthusiasts with unanswered questions."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOVnNwSmdXbjg0Y1hGN3VXYTV0NHFpQnU4eDRlcDN5UFBtb0laUW1XNlMxZ3U3RGZ3c3pocjlSODRCWTVnVnBzLURqQ0tkVng2bVJ0N0o2aWc3YVd1eEk3SFk3NDhxV1IwNF9qZnFnZk5iaktib0JzMWF6N2F5QjNWeElFeFh2bGhuQnZwQ1lFVk5sZzF1TEVXUTlLNTJnSktjc2xsLThHVTDSAbABQVVfeXFMUHk0Tzl0dV9WVnNEUVV4V2pHd2trTURoczFXcUpaMjdvYnh5X25ydk1MSFNHMTFsVXpPM0VqWkk2dUs2Tk1yYUtRSmgtTlJ6NndNcktyRVFrbGpwWTZvVFp0YUNTNHBDbnNqelNjUWZvY0NMdlM0TGlWZ3p5eHhQemN3SUVFcDhUbkJ0OGx2Mk1SOG9LUkF3RVhRNEVsMC14OTNvSjA5Nmk3ZTQtM0VrZV8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Bitcoin Crashes to $57,000 and Ethereum Slips Below $3,000 Hours Before Fed Meeting - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn the hours leading up to the next Federal Reserve meeting, investor pessimism has hit Bitcoin and Ethereum hard.\n\nAt the time of writing, BTC has dropped 7.6% and ETH is down 6% over the past 24 hours. The Bitcoin price is hovering around $57,000, while the Ethereum price is stuck at just under $2,900, according to data from CoinGecko.\n\nThe volatility has been hellish for derivatives traders. In the past 24 hours, $457 million worth of crypto futures positions have been liquidated, according to CoinGlass. And no big surprise, $392 million of those were long contracts.\n\nTraders opening futures contracts are essentially placing bets on future price action. To be long on an asset is to bet the price will go up. And to be short on it is to bet it'll go down.\n\nAD\n\nAD\n\nAnd it's not just blue chips like Bitcoin and Ethereum that have been impacted. Sagging prices have been widespread throughout the market. In fact, out of the whole top 100 cryptocurrencies by market capitalization on CoinGecko, just a few assets have escaped the sea of red, barring stablecoins that have managed to maintain their pegs, such as Tether (USDT) and Circle's USDC.\n\nThe U.S. Federal Open Markets Committee will publish its interest rate decision at 2 p.m. Eastern Time today, with Fed Chair Jerome Powell scheduled to speak at a press conference at 2:30 p.m.. Back in February, investors seemed certain that May would be the month that the FOMC finally cut interest rates—which is usually a bullish sign for risk assets like Bitcoin.\n\nThat's because lowered interest rates usually coax traders out of U.S. Treasuries to chase gains in riskier assets, like equities and crypto assets.\n\nThe Fed's key interest rate currently stands at a high of 5.25% to 5.5% and has been unchanged since July 2023 as the central bank aims to curb inflation. Policymakers have been keeping a close eye on inflation, which is currently 3.5%, in hopes to get it closer to 2% before considering rate reductions. But that's becoming a distant hope, as last month inflation increased to the highest it's been since September.\n\nAD\n\nAD\n\nTraders had a small jolt of hope in March, when the Swiss Central Bank announced it was cutting interest rates. “For some months now, inflation has been back below 2% and thus in the range the SNB equates with price stability,” the central bank wrote in its decision at the time. But it seems the sentiment in Switzerland hasn't spread to other major central banks.\n\nJust a month ago, traders seemed certain that the Fed might lower interest rates in June, according to the CME Fed Watch tool. But sentiment has soured. Traders don't expect to see the Fed ease interest rates until December—and even then it's just a 75% majority that seem to feel that way."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA1UnRFNnZ2eWpudzhwTVRoekZ5eWxiNlJKRGpBSGpyOW5UalhuMDR0TjJCZktONXRqU0t0M1BVOVZKa0JsYkd0emNDcXY1NmpVRFVRZUVzT2dFRzBDZXJYOFV2anFtelF2SFhxcjl1QVNNUHhDRjhDcjRwMXk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Feels Good Man: $BRETT Leads the Memecoin Charge on Coinbase Ethereum Layer 2 (L2) Blockchain Base - Yahoo Finance",
        "content": "Based Brett\n\nThe top memecoin and top ten coin overall on Base increases approaches $500 million in market cap, forecast for the rest of the year is even more bullish\n\nDUBAI, May 02, 2024 (GLOBE NEWSWIRE) -- Popular memecoin $BRETT continues to gather momentum in 2024 as the most popular memecoin and top ten most popular overall on Coinbase Ethereum Layer 2 (L2) blockchain Base, and now approaches $500 million in market cap. With continued community support and positive secondary indicators like crypto ETF approvals, futures trading for flagship memecoin Dogecoin on Coinbase Derivatives, and the anticipation of Bitcoin pricing eventually reaching 100,000 USD, $BRETT’s growth picture remains bullish.\n\n\n\n“We are seeing in real time how memes are not just an easy and funny way to share information on the internet, but to create almost immediate wealth by harnessing the power of these memes,” said $BRETT trader Crash. “This is the culmination of the grassroots financial movement of the past decade, from Bitcoin to r/WallStreetBets to now $BRETT, allowing people to escape the economic drudgery of living in The Matrix.”\n\nBase is Coinbase’s L2 built on OP Stack in collaboration with Optimism. Coinbase recently released new smart wallet technology built on Base, with $BRETT quickly becoming the most popular memecoin available for purchase there. Coinbase continues to be ambitious in its promotion of Base and the memecoins sold there, with plans to onboard over 1 billion users to the chain. Community response memecoins like $BRETT are also an easy way to boost early liquidity for the developers of new platforms on Base.\n\n\n\n\n\n\n\n$BRETT is one of the original characters of the Boy’s Club written by Matt Furie, the creator of the famous cartoon that has also inspired the popular Pepe meme and popular $PEPE memecoin. $BRETT involves a fixed total supply of 1 billion tokens, with a 6% transaction tax distributed to liquidity pools and burned tokens, aiming to reduce the overall supply and potentially increase the value over time.\n\n$BRETT continues to hold strong amid recent sideways market movement for memecoins. Even while most memecoins are down 50 percent, $BRETT has seen only about a 30 percent decrease.\n\nTo learn more, check out BRETT at:\n\nTg: https://t.me/basedbrett\n\nX: https://twitter.com/basedbrett\n\nWebsite: https://www.basedbrett.com/\n\nAbout $BRETT\n\nCheck out BRETT at:\n\nTg: https://t.me/basedbrett\n\nX: https://twitter.com/basedbrett\n\nWebsite: https://www.basedbrett.com/\n\n\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency & securities.\n\nStory continues\n\nCONTACT: Xenia von Wedel president TransformGroup 415-340-2792 brett (at) transformgroup.com\n\n\n\n"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNWTJFQTBxRTdzSmtQNkRIRnNTVG9aTXQtMC10Z1pBM0lQQTlETTlaM2s5VlV2SUw3MFpFMGJHNHZSUlpLLUx5eXhfOXc0SGNLTm9Lb1FVcU1uNHRnWjlzWXpHM05aSFZMZjQyYWl0RmFOX1RWQ2VURFZYMDFZXzJPTWlheFdZU1RHQl84OFN6OHVMZHFsbXhSWWYtQTc3czZxeHVrVHd1a2pveDJrZHVETGtrbFllbzhaRmV1aEZqYXVUR0lHWHlxRdIBzgFBVV95cUxPQWxONkk3ODNwZFNnTS1qRDkzZENfU1pfX3BLT1NCYXNPMzI1YlJYZFdTMG96bHVnTXppQ0gzVVJiaUd6bVV1OWFSX3RrVTdRc1VfMGpQQ19fbHNsR2VtaTJoa0RFN3ZaajVrTU1PSXJPdmFnNm1KMk52RjlFam93c24taTZ4ajRDb1lqWk1mWnZRS1ZZZHJERHBxRzQ3ejJLVkRjZHE3WXE4TlFvQTREN29oQ2R0b19yZTR0dk90bUNvcldORUx1YnZleC0wUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Restaking 'Gold Rush' Spreads to Solana From Ethereum, With Jito and Others Joining In - CoinDesk",
        "content": "Restaking 'Gold Rush' Spreads to Solana From Ethereum, With Jito and Others Joining In\n\nThe race is on to build a dominant restaking protocol for Solana.\n\nBy Danny Nelson May 1, 2024 at 12:01 p.m. UTC"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOWEw0X3NraUpwRnh5V28xUUVSbENiVFhkVGFFbUFhRXItNDRKOENHMkNMUWowVWN1a3k4Zl9UREwwMUtuTG8zOEwwMkhtbkVsOU9mV3JPQVFJTjZJZFdQcjFXRnJsZ2hydGRFaDc4RWYwTzEzOHdTM0NjQTJIQ1ZMVGxxd3BIRFhrYUFZbFdtYllwTFdlUmFscGNYdUlhc0dESUh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Why Hong Kong’s disappointing Bitcoin and Ethereum ETF launch was actually a huge success - DLNews",
        "content": "Six Bitcoin and Ethereum spot exchange-traded funds debuted in Hong Kong on Tuesday, drawing mixed reactions.\n\nWhile analysts hailed the launch as a great success, some traders criticised the funds’ low trading volumes.\n\nIt’s all relative\n\nThe Hong Kong Bitcoin and Ethereum spot ETFs processed roughly $12.7 million in trading volume on their first day, per Bloomberg data — numbers which Singapore-based crypto trading firm QCP Capital called “terribly disappointing.”\n\nThe numbers may indicate institutional crypto interest is concentrated in the US while Asian interest is more private wealth focused and natively dominated, QCP said, further attributing Bitcoin’s 8% drop to the poor numbers.\n\nBut Bloomberg Intelligence ETF analysts James Seyffart and Eric Balchunas said that the volumes had to be understood within the wider context of Hong Kong’s market size.\n\n“If you localise numbers, this was big,” Balchunas said.\n\nChinaAMC’s Bitcoin ETF alone is already the sixth most successful ETF launched in Hong Kong in the past three years, out of 82 different ETFs.\n\nThe crux of the question: the Hong Kong ETF market is worth roughly $50 billion, which makes it 168 times smaller than its US counterpart, according to Balchunas.\n\nJoin the community to get our latest stories and updates\n\nAdjusting for market size, it’s as if the Hong Kong ETFs processed the equivalent of $1.6 billion in trading volume, whereas the US Bitcoin ETFs saw $4.6 billion in trading.\n\nIn other words, the Bitcoin and Ethereum ETFs were almost as popular on that day in Hong Kong than they were in the US — it’s simply that the pool of demand is much smaller.\n\nInvestors shouldn’t therefore expect them to have the same market-moving impact as the US ETFs, but that doesn’t make them a disappointment.\n\n“By any reasonable relative measure for the launch of these ETFs — they were a massive success for the Hong Kong market,” Seyffart said.\n\nIt will take a few days to properly measure inflows, Seyffart and Balchunas said, because the full data isn’t available yet.\n\nBut ChinaAMC’s fund vacuumed $141 million worth of Bitcoin on its first day, some of it from its seeding process.\n\nCrypto market movers\n\nBitcoin is down 5% over the past 24 hours to trade at $58,100.\n\nEthereum dropped 2.8% to $2,900.\n\nWhat we’re reading\n\nTom Carreras is a markets correspondent at DL News. Got a tip about Bitcoin ETFs? Reach out at tcarreras@dlnews.com."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPbkgtTTJNRGw2Y0tvcktBWWFZZ1ZSclhmNjZSY0VxZFQ5QWxnY2UyNktKTmZDaEppSHdaOWlHSlpuNDJrMmhJYXo0LTNoekNzdEZOYXhfdDNVWTZ1em9hUFNfUVk0RnB5VmFWM1I5cEI3SWd6OHAwcnJpU1M4UDR4LWFIWVlCVk5pT0JKQ2pKZFFnX1I1VTVmbk5qeHHSAaQBQVVfeXFMTkoycVNwQS1Lb3pCMFJNZ2J3Y3otWXdsby1LT25LamQwYXJFeV9RcFdSX3VvYWswQ1pfZFZmR28zb1JDNkZySGt5OXFJRENoMi0wUm82cFhMUUMtbU8wM0ZPOS1HQmtlY3V3NDNvSGQzQjdvZlFpN0pReVYtWnZYeTZhdWFMWG5qN2VqSXhyZzVJSF9OdWRDSkc3bTVOWTZhSlIxY0Q?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Trade Sideways as Fed Leaves Interest Rates Untouched - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Federal Reserve Wednesday elected to keep its key interest rate steady as the central bank’s focus on fighting inflation compounded pain in the crypto market.\n\nIn his typically cautious tone, Federal Reserve Chairman Jerome Powell told reporters that the fight to get inflation to 2% was difficult but added that he thought it was “unlikely that the next policy rate move will be a hike.”\n\n“I’d say it’s unlikely,” he said, but warned that it was “likely to take longer for us to gain confidence that we are on a sustainable path to 2% inflation.”\n\nHe would not reveal to reporters when there would be a rate cut.\n\nAD\n\nAD\n\n“The committee does not expect it will be appropriate to reduce the target range until it has gained greater confidence that inflation is moving sustainably toward 2%,” Powell added in a prepared statement.\n\nAs of this writing, Bitcoin and Ethereum had fallen 4.6% and 1.3% over the past day to $57,600 and $2,945, respectively, according to CoinGecko. Meanwhile, the S&P 500 and tech-heavy Nasdaq had fallen slightly throughout the trading day.\n\nBut while the daily shift is broadly downward, both Bitcoin and Ethereum have marked slight increases over the past hour, including ahead of and since the rate announcement. Bitcoin is up 1% over the past hour, while Ethereum has perked up by 2% during the same span.\n\nSigns of stubborn inflation have lent traders pause, as fears boiled over last month that the Fed could be forced to keep interest rates higher for longer than anticipated. Those jitters were elevated recently by a stronger-than-expected rise in inflation and growth in wages in the first quarter.\n\nAD\n\nAD\n\nShifting rate expectations are driving Bitcoin’s price more as spot Bitcoin ETFs see pittering inflows, CoinShares’ Head of Research James Butterfill told Decrypt Monday. For Ethereum, the pressure comes as a court battle over its regulatory status in the U.S. continues to come to light.\n\nInflation has fallen steadily from multi-decade highs in 2022, but it remains above the Fed’s target of 2% annually. When inflation clocked in at 3.5% in the 12 months through March, a lack of change compared to the previous month’s release caused crypto markets to shudder immediately.\n\nThe Fed has kept its benchmark interest rate at a target range of between 5.25% and 5.5% since July of last year, pushing forward for months with the highest rates in more than 23 years.\n\nHigher interest rates, which can slow the economy through increased borrowing costs, are generally bad news for risk assets like stocks and crypto. That’s because the payout on cash reserves and U.S. Treasuries becomes relatively more attractive as rates move and stay higher.\n\nThough the Fed in March had penciled in three quarter-percentage point cuts for 2024, traders have grown less hopeful. According to the CME’s FedWatch Tool, financial market participants may see only one rate cute—or zero—by year’s end.\n\nAs rate cut expectations inched further out in April, Bitcoin notched its worst month since November 2022. Coming off all-time highs in March, Bitcoin fell 14% throughout the month to around $60,000.\n\nIn April, Powell said that inflation hasn’t come down as quickly as policymakers expected, suggesting rate cuts could still be far out. Yet the Fed chair signaled interest rates, where they currently are, could also be sufficient to get the job done too.\n\n“The recent data have clearly not given us greater confidence, and instead indicate that it’s likely to take longer than expected to achieve that confidence,” he said. “That said, we think policy is well positioned to handle the risks that we face.”\n\nAD\n\nAD\n\nEdited by Andrew Hayward with additional reporting by Mathew Di Salvo."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPbG1Jak9aTktjMUdickIxM0lLVkkyVW1wSWpNVC1QTF80Smszb2JjLWtlYVRWdVN1cWtRQ21qdnEtTW5QUnFOWXp6UklsdUo5aEJYWGoyOHk2UXJTOWR5eXJSOFBsU0pqanY3cFZZUUtGRkZXWnJRejNUbHR1SGYySS1ZY1FfZXlSNkZ4ZlNOcUpmVFd4NUVHZVVGY9IBowFBVV95cUxNeW1WeElzalkxRWlnOXU4Y3lMZTBWaFlhTHlxZC1EdTl1SVN4eWpGb1NBNDZiNmRxbVlxWlBoNEZvd20yeGNFUjZoZFA3RzVDb1VocjZfU0VDVWNfUjBIMU04SzhTM0lUTlFyM0xHV19YRkRmeEZRMnVyRmtBbjdyMjVVTFR2Ni1LRTJPX2lEU0V5bmRlQjFBQkFpcTVxTVVfc0c0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Rebound as Interest Rates Remain Unchanged in US - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum have rebounded after starting yesterday morning nearly 10% lower than they were on Tuesday.\n\nAt the time of writing, the Bitcoin price is around $57,700 after having made a 0.5% recovery in the past 24 hours. And the Ethereum price, after climbing 2.3% in the past day, is now trading for just below $3,000, according to CoinGecko data.\n\nBut the damage has still been done. Per CoinGlass, the past 24 hours saw another $193 million worth of crypto futures contracts liquidated, adding to the $300 million worth of liquidations seen earlier this week.\n\nEconomist and trader Alex Krüger explained that this current cycle feels so different for traders because it's largely been driven by interest in spot Bitcoin ETFs, which only just started trading in January this year.\n\nAD\n\nAD\n\n\"There has been barely any new retail coming into crypto,\" he wrote on Twitter. \"It's been mostly ETF buyers and previous cycle participants redeploying and going out the risk curve.\"\n\nAnalysts mostly attributed crashing crypto prices to fear in the market over certainty among investors that the Federal Open Markets Committee—which sets monetary policy and controls U.S. federal interest rates—would not lower rates. Then the Fed did exactly what the majority of investors thought it'd do by keeping interest rates unchanged, and crypto assets traded sideways.\n\nSome thoughts on the current crypto cycle #1 The crypto cycle has been almost entirely driven by the bitcoin ETF. #2 ETH has been a major disappointment, but it has performed well overall for stakers and airdrop farmers. #3 Solana established itself as the chain of choice for… — Alex Krüger (@krugermacro) May 1, 2024\n\nDuring a press conference yesterday, Federal Reserve Chair Jerome Powell told reporters that the fight to get inflation to 2% has been difficult, but added that he thought it was “unlikely that the next policy rate move will be a hike.”\n\nAD\n\nAD\n\n“I’d say it’s unlikely,” he said, but warned that it was “likely to take longer for us to gain confidence that we are on a sustainable path to 2% inflation.”\n\nBut even President Joe Biden has been optimistic that the Fed will still lower rates this year. \"I do stand by my prediction that before the year is out, there'll be a rate cut,\" he said during a press conference in Japan last month. \"This may delay it a month or so, I'm not sure of that.\"\n\nHe was referring to the hotter-than-expected March inflation report that had just been released at the time."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPV2U1eWJiUEE3WTdWbHRvbGFiQVhYZjNhSEJNWkVVXzJhbU5Qb0VNcjh6OGZZX1IwWHRRa21kQ1ZIZmhXNTMwU3p5a2pnLWNPMWxITGxHQ19nQ0VadTFZNUFoZEtmcU5UTU54Y0RiTEpxSE9rT3dieFBkMVZlb3N1R3BkQjNWLXPSAY8BQVVfeXFMTmRuVUZSUUFNQm9SRHFRYm5FMFJhRlhWYldSNGl2bUMxOHp3dWVsNVVNODl4TE5yWnp0cmJDRHFITFlONkxROVZZbkktWlNpVW9mS2ViSmREQ0I2dEgzemk0MEFCRDZ3a0JNU2ZqVWVrMnpjVjZ0MHBIX18xOGhQeW12OV9KQWJ4MDRZQndWU0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "How Ethereum Founder Vitalik Buterin Keeps His Crypto Safe - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum founder Vitalik Buterin is advising people to \"decentralize your own security,\" after weighing in on a Twitter discussion about using cold wallets.\n\nTo prove his point, Buterin said that he keeps 90% of his crypto funds in a mutisig Safe wallet.\n\n\"M-of-N, some keys held by you (but not enough to block recovery), the rest held by other people you trust,\" he wrote. \"Don't reveal who those other people are, even to each other.\"\n\nThe \"m-of-n\" Buterin referred to describes one of the ways multisig, or multi-signature, wallets can be set up. The first variable refers to minimum number of signatures required to sign a contract, therefore spending or transferring funds from the wallet. The second variable refers to the total number of possible signatories that exist for the wallet.\n\nAD\n\nAD\n\nThe conversation started after a developer and research, who goes by the pseudonym 0xkofi on Twitter, urged crypto traders to think about how devastating it would be to lose all their funds and avoid it by investing in cold storage.\n\nThe above is why I use a multisig (@safe) for >90% of my personal funds 🙂 M-of-N, some keys held by you (but not enough to block recovery), the rest held by other people you trust. Don't reveal who those other people are, even to each other. Decentralize your own security. — vitalik.eth (@VitalikButerin) May 1, 2024\n\n\"Your hardware wallet will be your fortress of solitude,\" Kofi wrote. \"It will allow you to sleep peacefully at night. It will protect you so that you can survive this game long enough to win.\"\n\nBut not everyone is sold on that being the right way to protect their personal crypto stash. Peter Watts, Uneven Labs CEO and the founder of Reservoir, a developer platform for launching NFT collections, highlighted the risks involved in relying on hardware wallets.\n\nAD\n\nAD\n\n\"When using a hardware wallet, the biggest risk becomes yourself,\" he wrote, adding that someone might find a stashed private seed phrase, or a user could secure it so well that they can't retrieve it themselves.\n\nThat's when Buterin chimed in to describe how he makes sure that he isn't the single point of failure for the security of his cold storage wallet.\n\nPeople often think of @safe wallets as a team only solution. While this might have been true in early 2020, the user base has since evolved significantly. Today, individuals make up more than 99% of @safe users, including notable ones like @VitalikButerin and @punk6529 https://t.co/EyZuKpF2xa — Daniel (@danftz) May 1, 2024\n\nAlthough Safe (formerly Gnosis Safe) multisig wallets have often been treated as a product to help DAOs and other groups manage shared treasuries, there's a lot of individuals who use them in a similar way to Buterin.\n\n\"Today, individuals make up more than 99% of Safe users, including notable ones like Vitalik Buterin and Punk6529,\" wrote a SafeDAO contributor and delegate known as Daniel on Twitter.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQZGc1d01uaVJkWk1ySHJsRTA3LU10S1RoQmlyd3I2T2hXd09JMjNNVUZ2ckRkdEktMVBZQjIxczdlRlNKT3JRVnB5WGt3SzVMaW9NcElBOEJqYTBobGN4R0NuX1VBalh4UHY1UlNNTkx0WXk0bDlNVXY1dGtqZkU2QmlldVVkZExXV1Q0bWozOUE2aERD0gGaAUFVX3lxTE5pNGF0MHUtZlVmZ255T2haWTNLWmRSQmlESWhGODM0R18wQnprSmtiZGI4RjFqVkw2TDNzVjQydFhGM1JzOThoMWN4RUt0MkR3cnhkeEpvN3F6QlRTcEJ2d3FMU2MwSll6M3JQSHB3Yk5NaTJ5Tk5sTWszZmdmTUVRb2R4bmZYQzZYMEVSRVFyS21nanFIa2RzTHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Dormant Ethereum Whale Awakens After 8.8 Years, Here's How Much ETH They Hold - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nProminent cryptocurrency tracker Whale Alert has published a post on the X platform about a recently awakened crypto whale. This wallet contains millions worth of Ethereum.\n\nThis premined whale had spent almost nine years in dormancy – this means since 2015, the year that followed the end of the Ethereum initial coin offering (ICO).\n\nThe reactivated wallet contains almost 2,000 ETH worth $5,876,786.\n\n💤 A dormant pre-mine address containing 1,969 #ETH (5,876,786 USD) has just been activated after 8.8 years!https://t.co/MzyVVkMhIc — Whale Alert (@whale_alert) May 2, 2024\n\nEthereum Foundation dumps ICO ETH\n\nPrior to this awakening, an ancient wallet that belongs to the Ethereum Foundation was reactivated after nine years. The wallet transferred a massive 2,000 ETH evaluated at approximately $6.5 million. This money put into it during the period of the Ethereum ICO was moved to a new blockchain address.\n\nAdvertisement\n\nIn the past, the market has reacted negatively when the Ethereum Foundation has released large amounts of Ethereum. This is not the only sale made by this prominent entity observed by market participants this week. Earlier today, it was reported that another wallet linked to the foundation sold 100 ETH for 291,267 DAI via the Cow Protocol.\n\nEthereum whale activity soars high\n\nThis awakening of an ancient whale took place after the overall activity of Ethereum whales demonstrated the largest growth in addresses over the past year. Approximately 139,560 new ETH wallets were created on a single day – April 29, according to cryptocurrency trader and analyst Ali Martinez.\n\nEarlier this week, the second-largest cryptocurrency saw a tremendous decline of 12.16%, falling from $3,243 to the $2,960 zone. It was followed by a small rebound of 3.87%. This discount provided a great opportunity to buy the dip, and traders immediately took advantage of this, setting up almost 140,000 new wallets, expanding the network.\n\nProminent crypto analyst Michael van de Poppe has just tweeted that he expects Ethereum may go down to the $2,500 zone “for the most optimal play.” However, he does not believe that crypto markets are likely to be in for such a heavy correction. “Most of the downside is already in,” he added."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOa3UxNnJEQXlKMUx5YXlzVkxkOFk2X2c4ejlJcExyTnF2Wl9FZVpJbWVhRzQxOFNpbS12ZUhIVm1mY3Q2TktsZ2phYVRpNWRVRHRxRkZSNHkwUHpCdnY2c1p5Tk0yeDJaUDBHWGhaZFhleV84YS1aRjk2UE96eHJ2QVZ5WEhLX2dE0gGQAUFVX3lxTE02VGpGUlJLUEV4TTZuLUlGb2xFMU43aFFHVDFvczVpTHVmVnlUemV0em5YYjhwa2tTMHVMUzVhcENjUjlrOWZQdjNfcFlwU1AzOFVLenlvblBqYVF1V2p4QmlrM0RkeE1UcU5MQVp6VHdyS0t3RkNQY3Q1WHRzZDlfU3JWeW5SSmlTYmxpcmsxSA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Redstone Network Launches to Power Fully On-Chain Ethereum Games - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nRedstone, a new Ethereum scaling network designed for fully on-chain games and “autonomous worlds,” launched its mainnet today—with a number of early games already available for play.\n\nDeveloped by Ethereum startup Lattice, Redstone was built via Optimism’s OP Stack scaling tech. But it’s much more than a rebranded riff on the layer-2 tech that also powers networks like Base and Zora—Redstone has been significantly retooled for the needs and demands of video games, particularly those that use blockchain for much more than asset ownership.\n\n“We've had core developers come along and make really cool contributions to the OP Stack,” Optimism co-founder Ben Jones told Decrypt’s GG. “This is the first [network] that’s not just tweaking dials a little bit.”\n\nMany crypto or “Web3” games utilize technologies like NFTs for unique user-owned items or cryptocurrencies for decentralized economies. But fully on-chain or autonomous games also put their game logic or rules on-chain, working within the capabilities but also limitations of the decentralized technology to power playable games.\n\nAD\n\nAD\n\n🔴🪨Today, we’re announcing Redstone, a super cost-effective L2 for onchain games, worlds, and other ambitious applications.@redstonexyz is a Plasma-inspired Alt-DA chain, built on the OP Stack.https://t.co/Rqnnhu5bmu — Lattice (@latticexyz) November 15, 2023\n\n“Most of the time, when you fully embrace the medium or the system you're building to, you tend to get more interesting results—and sometimes better harmonization—just purely from a product development perspective,” Lattice co-founder and CEO Justin Glibert told Decrypt’s GG.\n\nGlibert says his team has embraced this model of building entirely on Ethereum, a “computer that had to be multiplayer out of necessity, and not out of choice.” Following early experimental games like Dark Forest, zkDungeon, and OPCraft that his team created or helped build on other chains, they’ve designed Redstone to better suit such games—and it’s open to the public.\n\n🏁🔴🪨 Coming soon to Redstone Mainnet: @DFArchon. DF Archon is building DF Ares, community-run rounds of the beloved onchain game Dark Forest. They bring new flavor and new plugins to the classic DF gameplay! Get ready for May 1st. https://t.co/9Dn5e51hRj pic.twitter.com/A0nuusqhjw — Redstone Chain (@redstonexyz) April 23, 2024\n\nAD\n\nAD\n\nCertainly, crypto games can be built on layer-1 networks, as well as general-purpose layer-2 scaling networks. But fully on-chain games can be held back by the way those networks are typically designed. Games need low latency speeds, for example—and with such a constant flow of player inputs, they need to cut down on the friction of interacting with a blockchain.\n\nRedstone is built for just that, and it also features the first implementation of Plasma Mode, an alternative data availability protocol co-developed by Lattice and OP Labs. Plasma Mode allows for increased transaction throughput via an off-chain data availability provider, but also includes a permissionless Ethereum layer-1 feature that lets any user challenge suspicious inputs.\n\nIn short, Plasma Mode picks different kinds of design trade-offs to power games and other high-throughput decentralized apps, but also includes an on-chain capability to challenge potential threats. It’s inspired by the Plasma concept that Ethereum founder Vitalik Buterin co-authored back in 2017 (and recently shined a fresh light on), and will be available throughout the OP Stack going forward.\n\nThat’s paired with MUD, Lattice’s engine for on-chain Ethereum games. It’s being used by the studio’s own Sky Strife, a tactical strategy game in the vein of Nintendo’s classic Advance Wars that’s available to play today. Other Redstone launch games also use MUD, plus EVE Online developer CCP Games is using the engine for its Project Awakening game—though Glibert said that CCP has yet to choose a network for that project.\n\nAlong with Sky Strife, the initial lineup of Redstone games includes titles like Biomes, a Minecraft-like sandbox game; DF Ares, a community-driven revival of Dark Forest; and Downstream, which has been described both as an “infinitely moddable MMO” and the “world's first post-singularity civilization simulator.”\n\nA screenshot from Sky Strife. Image: Lattice\n\nOne of the more distinctive games on the launch list is DEAR, a game by ARPA that sounds like a cross between an abstract art project, a virtual pet simulator, and a crypto-fied social experiment. Or as an ARPA representative described it, “DEAR is a digital creature that transforms under the collective behavior of all players—a tug of war between two factions, whether you feed or abuse the creature.”\n\n“Experimental” is a fair term to describe most of what’s happening around Redstone and fully on-chain games. Some of the early games look far from mass-market in aesthetic and are built around new and unfamiliar concepts.\n\nThere are various benefits to being fully on-chain, Glibert said, such as the ability to easily deploy modifications to games and create new business models around existing games. Fully on-chain games (FOCGs) can’t be shut down or erased from existence like some Web2 games, while autonomous worlds (AWs) could yield new kinds of play mechanics and experiences.\n\nAD\n\nAD\n\nThis onchain game introduces an interplay of LOVE and HATE, with a PVP twist. DEAR gamer, DEAR is a creature that inhabits a dark, digital forest, with cellular components woven into smart contracts. DEAR exhibits purposeful behaviour and mimics essential human interactions,… pic.twitter.com/gRw2c5ucHc — ggQuest (@gg_quest_gg) April 24, 2024\n\nWhether there’s a business here, however, remains to be seen.\n\n“Most of the studios out there that have raised capital to build on-chain games—nobody knows if it's actually going to be a valuable market,” said Glibert. “I would say most of the people that are doing this seriously, they also don't know if there's actually a mature-enough business model today to do it.”\n\nBut they’re still building, attempting to push the edges of what’s possible on-chain.\n\n“There is a lot of noise of ‘how to monetize’ before a FOCG actually takes shape,” ARPA co-founder and CTO Majorknight told Decrypt’s GG. “Rushed monetization is the killer of innovation. At best, it creates one-hit-wonders like the play-to-earn games we have seen and doesn't have anything to do with making FOCGs, or improving the infrastructure.”\n\n“The world's first Post Singularity Civilisation Simulator”??? WTF is @DownstreamGame 👇 --- Downstream will launch on @redstonexyz mainnet on May 1st, together with the first @gg_quest_gg experiences --- ⚔️ Gameplay Downstream is an onchain world made up of hexagonal tiles… pic.twitter.com/hLcVmI92No — ggQuest (@gg_quest_gg) April 18, 2024\n\nMajorknight described the Lattice team as a team of “young, talented, and driven people who focus on building the infrastructure” for such games, further praising them for attempting to empower new types of on-chain games.\n\n“The original vision of FOCGs is to utilize risk-free and creative scenarios to test the possibility of new blockchain applications and push the boundary of the infrastructure, similar to the relationship between games and simulations in science/engineering and between games and GPUs,” they added. “Who else to collaborate with if not the team who coined the term FOCG/AWs and established this vision beyond the short-sighted monetization?”\n\nAD\n\nAD\n\nEdited by Stephen Graves"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFA4OFQ2dU5GZmlRMDJtUzZ6MFZIdG1MNTdDZVFNeHVjQ1NUcEtaYTdRdVVEREFfVm1sTFBmTk5mc0hLMzl4dHlBRnJFRGZPQTdXRHFnTlZ4Q3ZDS3U1TEU0R2p2V0NpUDkteG9NRl9NbHFuWEd0OFZScDBPX2lUd9IBgwFBVV95cUxPb2ttMHpJUVh2Vk9xLTVIVzVTYkwwMzgtY1ZYdjEta1BzZzNkUTIwekpOallqZ3AtZnhROFd2NVBxa0RpZkk5VlQyUTMyeGZPUkwtX2x0c1BCYU9LaEpWV180YkdQYjhPdTY2QnB5VFBNUVhzM2hraFJnRTVtZTF3NmJIdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Ethereum Price: Whale Dumps $6M ETH Amid Crypto Crash - CoinGape",
        "content": "Ethereum, the second-largest cryptocurrency by market cap in the last 24 hours, underwent a significant price drop of approximately 7.8%. This sharp decline has raised alarms among investors, particularly against the backdrop of widespread turbulence in the Ethereum market. The sudden downturn has prompted a thorough investigation into the factors driving this decline.\n\nEthereum Price Plunge Amid Whale Activity\n\nOf particular significance is the occurrence of a significant whale 0x035 offloading event involving 1,767 ETH, valued at approximately $5.4 million, which was transferred to the leading exchange Upbit. This substantial movement of Ethereum tokens by a single entity has further fueled bearish sentiments within the market, exacerbating uncertainties surrounding Ethereum’s future price trajectory.\n\nadvertisement\n\nMoreover, data from on-chain trackers has shed light on the substantial whale activity surrounding Ethereum, particularly within the past few hours leading up to the price plunge. The transfer of 1,767 ETH to Upbit a centralized exchanges (CEX) shows the scale of whale involvement in Ethereum’s market dynamics. Notably, Whale Alert’s data confirms the magnitude of this transaction, emphasizing the significant value transferred to Upbit.\n\nThese recent developments, marked by Ethereum selloffs and heightened whale activity, have intensified concerns among investors regarding Ethereum’s short-term outlook. The phenomenon of whales capitalizing on profit opportunities amid the absence of a post-halving rally has further contributed to the prevailing sentiment of caution within the Ethereum community. Additionally, regulatory uncertainties surrounding Ethereum’s classification as a security have added an additional layer of apprehension, amplifying the overall market volatility and reinforcing the need for vigilance among market participants.\n\nAlso Read: Possible Outcomes of FOMC Meeting, How Would Bitcoin And Crypto Market React?\n\nEthereum Market Analysis and Insights\n\nAgainst the backdrop of Ethereum’s recent price decline and heightened market volatility, a comprehensive analysis of its current market dynamics offers valuable insights into its ongoing performance and future prospects. At present, Ethereum’s price stands at $2,904, reflecting a significant 7.8% decrease over the past 24 hours, indicative of the mixed sentiments prevailing within the market.\n\nFurther examination of derivatives data reveals an 8.30% decrease in ETH’s open interest and it is currently valued at $7.6 Billion. This decline in open interest highlights the evolving nature of Ethereum’s market dynamics and the potential impact on investor sentiment and trading activity.\n\nDespite these challenges, TRON founder Justin Sun’s accumulation of significant amounts of ETH signals confidence in Ethereum’s future potential and may serve as a catalyst for renewed investor interest in the token.\n\nMoreover, Ethereum’s median gas fee has reached its lowest point in three years, standing at 6.43 gwei as of April 27. This notable decline in gas prices offers potential relief for users, particularly amidst ongoing concerns regarding high transaction fees on the Ethereum network.\n\nAlso Read: Bitcoin ETF Outflows Jump to $161 Million Ahead of FOMC\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQX0JGR0trYklPT0hjZDJ2amZQOUdVOGpEaUtkUUZ1dnlXMXNhSFM1aXd1QTB4ZVpMR1B5WmZDc0lkb29MallCdUE4bHpsMUhfNlV6MnVoMEg0OU9lZUx6Z1U2a1Nvck5hZVc5ZFhILTBHWWIxcmE1VExyaE1HNnlMbk5QVkxLaXRBYlp3V0JmcnFfMzFyV2Nj0gGcAUFVX3lxTE9PT2R4TmpKMmszVmVyWWpBYmxEODFjeFdDV293X09wOGtDMWU2ajE0NDA2ai1qLUFiTWNLRkRKX01tdmhBM3JOU2lIZXpodzgxMlZWWW1fVjlKOGNWV2hwaTZzLV8wcVU5OWN6cVE0OEtGMzZUQk1EUEZ4NGVQOW1WRk9NN3Zyd1RCWFFzSDFRQnNQWHNrYjRJeTdTcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "What Historical Trends Hint for Ethereum Price Behavior in May? - CoinGape",
        "content": "Amid the broader market correction, the Ethereum coin witnessed a three-day losing streak with its price falling from $3286 to $2888 accounting for 12%. The recent fall backed by increasing volume hints at the sellers’ conviction to lead the asset value lower as BTC goes Sub-60K. However, an analysis of the daily chart shows the correction still holds above a healthy retracement level and keeps the bullish pattern intact for a potential reversal.\n\n\n\nAlso Read: Vitalik Buterin Warns Against Hardware Wallets, Proffers Alternative\n\nadvertisement\n\nEthereum’s Falling Wedge Hints a Silver Lining in the Bearish Cloud\n\nIn the past seven weeks, the Ethereum price has shown a textbook example of a downtrend with new lower highs and lows in the daily chart. This price swing connected with downsloping trendlines reveals a falling wedge pattern which is a bullish continuation setup often spotted in an established uptrend.\n\nUnder the influence of this pattern, the ETH price plunged from a $4084 high to its current trading price of $2899, registering a 30% fall. If the broader market selling persists, this altcoin may fall another 6% to hit a lower trendline at $2700.\n\nThe aforementioned level coinciding with the 50% retracement level and 200-day EMA slope created a high demand zone for buyers to counterattack. The renewed demand pressure at $2700 will indicate an initiate sign of local bottom formation.\n\nHowever, the buyers would need an upside breakout from the wedge pattern to develop a renewed recovery trend.\n\nAlso Read: ETH Futures ETF Issuers Stay Positive on SEC Approval Despite Feud\n\nHistorical Returns Hints Ethereum Price Recovery In May\n\nEthereum’s historical performance in May shows significant volatility with a mixture of substantial gains and losses over the years. So far In May 2024, the asset saw a modest decrease of -3.79%, while in 2023 a slight increase of +0.16%. Notably, May 2022 experienced a sharp decline of -28.84%.\n\nIn contrast, May 2017 and 2019 saw impressive surges of +161.43% and +56.65% respectively, highlighting the potential for high returns despite overall instability. Furthermore, the ETH price witnessed losses in years like 2018 and 2021, which posted -13.96% and -2.31% respectively.\n\nHowever, the average gain of +23.66% suggests a higher potential for Ethereum to rebound and keep a bullish outlook this month.\n\nTechnical Indicator\n\nAverage Directional Index: The ADX slope uptick near 23% indicates the sellers are gaining momentum for a prolonged downfall.\n\nExponential Moving Average: The ETH price trading above the 200-day EMA slope accentuates the broader market sentiment remains positive.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxPVjFGY3ZCeGFzT2ZSVWxnVnJoTHByUVZyd2I2SFJYSGM2Mng4Z1pUVThDTFFPWkVGaDVXQURJMjk3UWhreWZDQy14VWRpWFdOWWFwM01kQlcwZzYyc09PT1pVamdyU0dUWWl2bEZIamdqSFFlV1F4a2x6UV9oMUxCd2tVYWpSajlRT2RNMEdURHpjNl9tX180Y0xZYng4aEktSG5hMlZibUNHQW9qbW8yNWxUR1QwZ1pnZUJRSnFoeFRybWxqamxlbnFBdGJmQ1o5RDB0WEd4YlJGblFLczFqNDRvdHR4bzNlMFFLdFVMVk1lMkhsWmo2Yjh30gH_AUFVX3lxTE8tbmlhT0d3MUFOQWg2Y28wZVI1RmI3SVY5SjRPUXlTUkJrLVhKMFhQYmFQQXRJM0VET1lUUjdnd19GS1p4MEstVEFuVld1Ul9temN5Y0UwR01WdTY2Z3d2b1FGMzJfakZTemlVUG0yTkYya1RYaFBPaUFmTnY4XzNuTmpsUFM3cWNXOFVidGdPODlyQ2REUG93S3BEakxYY01XMFh5M0hTeGJheG1hZTEwTlF1cjdPcDNKM3FBaUt6czZhWEJIQ0YwUGw0MW9PM0sweGprN2hzaDYzY05WT2d2R19VanNtSU9QSlA3WTV3eENyZGVYVDZoWFZWcU82dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Altcoins to pump once BTC bottoms out, slow grind up for now - FXStreet",
        "content": "Bitcoin price reclaiming above $59,200 would hint that BTC has already bottomed out, setting the tone for a run north.\n\nEthereum price holding above $2,900 keeps a bullish reversal pattern viable despite falling momentum.\n\nRipple price coils up for a move north as XRP bulls defend $0.5000\n\nBitcoin (BTC) price slipped below $60,000 on Wednesday as markets tried to front-run the Federal Open Market Committee (FOMC) meeting.\n\nIn the mid-April meeting, the Fed alleged new uncertainty concerning whether it could cut rates later this year because of inflation data from the previous quarter. This had markets anticipate a rate hike, causing Bitcoin price to dump, going as low as the $56K range.\n\nIn a surprising twist on Wednesday, however, the Fed decided to keep rates unchanged, with the improved sentiment sending BTC back into the $58,000 range.\n\nThe sentiment has extended to Ethereum (ETH) and Ripple (XRP) prices as they continue to hold above key support levels.\n\nAlso Read: Relief wave on altcoins likely as Bitcoin price shows a $5,000 range\n\nKey level to watch as Bitcoin price slowly grinds up\n\nBitcoin price drop on Wednesday saw it draw close to testing the Bull Market Support Band at $55,831. However, dovish news from the FOMC may have turned around fortunes as the BTC price is slowly grinding up. If the bulls can manage to haul BTC back above the $59,200 level, it could solidify the recovery, effectively meaning that BTC has bottomed out at $56,552.\n\nIn the meantime, Bitcoin price remains in the woods amid falling momentum and growing bearish sentiment, as shown by the Relative Strength Index (RSI) and the Awesome Oscillator (AO) momentum indicators.\n\nIf the Bull Market Support band fails to hold as support, Bitcoin price could extend the fall toward the $52,000 threshold, or in a dire case, test the $50,000 psychological level.\n\nBTC/USDT 1-week chart\n\nConversely, with the RSI holding well above the mean level of 50, and the AO still in positive territory, all hope is not lost for BTC bulls. And while a flip of $59,200 into support would solidify a recovery rally, the bearish thesis will only be invalidated once BTC breaks and closes above $72,000.\n\nAlso Read: Bitcoin price reclaims $59K as Fed leaves rates unchanged\n\nEthereum price still flirts with 25% upside potential\n\nEthereum price is consolidating within a falling wedge pattern. This bullish pattern will be executed after a decisive breakout above the upper trendline in the one-day timeframe.\n\nThe target objective for this pattern is a 25% move toward $4,250, determined by measuring the height of the wedge and superimposing it at the expected breakout point. The descending wedge pattern remains viable, given that the Ethereum price continues to hold above $2,900 in the 12-hour timeframe.\n\nETH/USDT 12-hour chart\n\nOn the other hand, with the lower highs of the RSI, the bears could have their way, sending Ethereum price below the $2,900 buyer congestion level. Such a move would not only negate the bullish reversal pattern but also encourage more sell orders.\n\nTraders looking to open long positions for ETH should wait for the RSI to reclaim above 50 mean level, a move that could be accompanied by a bounce of Ethereum price above the lower boundary of the pattern. A 12-hour candlestick close above $3,212 would provide a good entry.\n\nAlso Read: Ethereum attempts recovery from dip amid unchanged interest rates and accusations leveled at SEC Chair\n\nRipple price defends against further downside\n\nRipple price could pivot around $0.4952, marked by the 50% Fibonacci placeholder, as XRP bulls show commitment to defend the $0.5000 threshold. The RSI has managed to record higher lows in the one-day timeframe, which points to growing bullish momentum.\n\nIncreased buying pressure could see the XRP price bounce with the prospect of reclaiming the $0.5715 peak of the range. In a highly bullish case, the gains could be seen in the rippling price foray above $0.6000, which is almost 17% above current levels.\n\nXRP/USDT 1-day chart\n\nOn the flip side, if the 50% Fibonacci placeholder fails to hold as a support, the Ripple price could drop. A candlestick close below $0.4782 would produce a lower low, hinting at a possible trend reversal.\n\nSpooked holders would then pull the trigger, sending Ripple price below the $0.4500, or in a dire case, roll over to $0.4188. This would mean a fall of nearly 20% below current levels.\n\nAlso Read: XRP sustains above $0.50 as traders digest news of Ripple XRP Ledger entry in the Japanese market."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQOVZkelNTNXpDT2JjSTZuYnk2OF85QngzeXBQMXBfWnB0OEJ2Nlp0S2pwMlZOaWphYU9BQTVBYUtHSkZ1NVRITFRsVFhLbUhuTHV3MktVVW9sM0JCaVl5WnpBVkVUZFhsc0hxM2ExMDRDaVlZOEgzUnM1UmRrNWRGcl9pZFpoN3RrYmZPMEwxTVFaa1BreXZr0gGcAUFVX3lxTE9HYnNVenNJR0dmdTd4QlczV1g0ZlhCczBnaFZuS19oYXNyQlh3c2xHTFZ3dTh3VUpZWnBsNjEzSGgwT2FyS1hsYzJHNUtwTVMxS0c1WENfdXBfWDFwLS1uS0FwM2V3M3JkLXlneHFWMExYQmlQamFnRnJzUGpBaHdzQzFPWGVsTEFoalJEcXh2V2xHbDFGVXZ1WXh5TA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum: Exchange inflows spikes - FXStreet",
        "content": "During significant pullbacks in cryptocurrencies, there is often a fear of further weakness in specific coins, leading to increased transactions from private wallets to exchanges. This trend is particularly evident when inflows to exchanges spike, a sign that pessimism may be reaching late stages in the current market cycle. For example, with Ethereum, we're seeing exactly this pattern: as the price declines, exchange flows have notably increased on the spot market, indicating that traders are concerned about potential further drops.\n\nThis scenario, however, could signal a potential turning point. Market sentiment often shifts from pessimism to optimism and vice versa, and when sentiment reaches an extreme, it's wise to be on the lookout for a possible reversal. Currently, it seems Ethereum might stabilize in the coming days or perhaps into next week.\n\nHowever, it's interesting to note the contrast with Bitcoin. Exchange inflows for Bitcoin haven't reached the same extremes, suggesting that investors may have more confidence in Bitcoin’s long-term stability compared to altcoins. This disparity could indicate that investors believe the altcoin season might be over, preferring to hold Bitcoin for the longer term.\n\nGet Full Access To Our Premium Elliott Wave Analysis For 14 Days. Click here."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPSzZGV0RQVVIwT3RlVFEyT2djS1l3NmsyNDFoRm5ra1FFVEowcTFBWWFfc0JvZXByRUNDSTZ6Y19HcFlMNEdFM2dEZjMyU2V3dW5lZ0ZJT29Tdl9ubjdSWHduMnBHUklZZFBmaDY2d2V6WEFkRHlQYno2d1kyYU41UEFjT3F1MVl6RTZmb2QzOHd5RE94WlFfYmU2enh5SE9pTk5QRA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum Records 267K New Wallets, the Highest in Nearly 2 Years - The Crypto Basic",
        "content": "Despite the ongoing price dip, Ethereum sees record wallet growth with 267K new addresses on April 28 and 29, the highest since October 2022.\n\nEthereum has witnessed a significant spike in new wallets hosted on the network, marking a notable resurgence in interest amidst a general market downturn.\n\nAccording to data shared by Santiment, a blockchain analytics firm, nearly 267,000 new Ethereum wallets were set up on April 28 and 29. This is the largest two-day increase observed since early October 2022, suggesting a robust expansion of the Ethereum network. This growth occurs in contrast to Ethereum’s recent price dip.\n\n📈 #Ethereum saw a milestone as April came to an end. 266.6K new wallets were created on April 28th and 29th, the highest 2-day stretch of network growth since October 8th and 9th, 2022. It is a strong that $ETH continues expanding despite dipping prices. https://t.co/SN6xqc3JXV pic.twitter.com/KDcjhY30y5 — Santiment (@santimentfeed) May 1, 2024\n\n- Advertisement -\n\nDespite the economic uncertainties and fluctuating market conditions, Ethereum continues to attract a diverse array of users. This surge in new wallets could potentially be linked to ongoing developments, such as improvements in scalability and security through its continued upgrades.\n\nAnother analysis by CoinMarketCap reveals an uneven spread of Ethereum across different addresses. The vast majority of Ethereum addresses, approximately 97.49%, hold between $0 and $1,000 worth of the cryptocurrency.\n\nOnly a small fraction, 2.40%, hold between $1,000 and $100,000, with the remaining 0.10% of addresses holding over $100,000 in Ethereum. This data indicates that while a few hold large amounts of Ethereum, most users possess relatively small balances.\n\nWhale Movements and Influence\n\nDespite their limited numbers, Ethereum whales control a substantial portion of the total holdings. According to data from Clank, a whale tracking platform, whales hold about 40.75% of Ethereum’s total circulating supply. These large holders play a role in Ethereum’s market dynamics, capable of influencing price movements significantly.\n\n- Advertisement -\n\nClank’s data further shows that the average holdings of these whales amount to 9,839,698 ETH, valued at $3.66 million. This sizable influence is also evident in the “Whale of the Day” transaction within Binance, where an internal transfer of over $45 million worth of Ethereum occurred.\n\nHolding Patterns Among Ethereum Investors\n\nThe holding time for Ethereum varies significantly among different addresses. According to the latest data, a large majority, 74.43%, are long-term holders, which reflects a strong confidence in the potential future value of Ethereum.\n\nMedium-term holders, or “Cruisers,” make up 21.31%, while only a small percentage, 4.26%, are classified as “Traders” who hold their positions for shorter durations.\n\nDespite a price decline of 3.80% over the last week, Ethereum is still performing relatively well compared to the broader cryptocurrency market, which saw an average decline of 8.80%. As of today, the price of ETH stands at $2,992, with a total market capitalization of $355.6 billion."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQTnAyV01OSFZBcTdCYVBLdlNDdThvMDFSa19YODBBdktCVWVucWFvWUlRcWhPZDVKQTIwMU5iMDhpQVlhbUt0MnpNeXRYcVREa1hsT0VIMDZ5VWw3cEJ4QUtzVi1mU3ZSOFIzOTBubG50U3loeEFRN21fQjllRXJIYnNzQkdnWWd3SEHSAY8BQVVfeXFMT1Q2QlBfSVpsTWxzYTA5cjE3OUREYnNlZ2dNSEQzMzlKLWU2NlJtT0hBaE11YzdaVFBiQWNJY2pYelVTbklEMThOaF8waVFFVHhMeU1aWmFudjEzeUs1NVpmU1pCUVVvZDhmVHhrVGR0TU5nN0ZkX1loM0lpeFFXNURZdlo3eGNuS0xDRDFmSWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Ethereum price’s $3360 rejection – Blame profit-taking or… - AMBCrypto News",
        "content": "Ethereum saw two sizeable waves of profit-taking in the past month that projected doubts about an upcoming rally.\n\nThe ETH whales have added to their stash, with retail being keen to sell.\n\nEthereum [ETH] saw a rejection from the $3360 resistance level over the weekend. This outlined short-term bearish sentiment.\n\nIn other news, the latest Dencun upgrade was a success, helping L2 solutions reach low gas fees.\n\nThe next target for the developers is called Prague. Even though hopeful news was breaking, on-chain metrics showed a lack of faith from market participants.\n\nThe clues from the Ethereum supply distribution\n\nAMBCrypto’s analysis of the supply distribution showed that almost every wallet holding anywhere from 1 to 100k ETH has been selling in recent months.\n\nThe micro wallets with under 0.1 Ethereum were the ones buying, hopeful of a rally after Bitcoin’s [BTC] halving.\n\nIn the past, when the 100k-1 million token holder cohort was added to their stash, it came during a market rally. Sometimes it preceded a major retracement, like it did in mid-January.\n\nThe second half of April saw this cohort quiet down, neither adding to nor selling their supply.\n\nThe 1 million- 10 million cohort saw a sharp uptick in early March. Since then, they too have been quiet. Together, it showed that the large participants expected bullish sentiment in the coming months.\n\nA sharp spike in the 100k- 1 million holders’ supply could be useful for traders to mark local tops and imminent retracements.\n\nDoes fear still rule the market?\n\nThe network realized profit/loss (NRPL) grows during periods of swift price appreciation as profits pile up. The first two weeks of March saw strong price rallies alongside NRPL spikes.\n\nThis indicated profit-taking activity.\n\nHowever, the NRPL has trended downward since then. It saw occasional spikes, such as in late March and mid-April, each smaller than the last.\n\nThis showed participants were keen on booking profits even though the price was just above the $3k support zone.\n\nIt indicated a lack of faith, which is part of the extended retracement Ethereum has witnessed in the past two months.\n\nOn the other hand, the mean dollar invested age (MDIA) has trended strongly higher in the past month. This metric shows that the asset is in an accumulation phase once again.\n\nIt fell sharply during the rally to indicate holders were realizing profits en masse.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nIn the past month, the HOLDer sentiment has been stronger than the collective urge to book profits.\n\nIn conclusion, the metrics showed both fear and hope were present in the market, but long-term investors have more reason to hold on than to sell."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOOVNLQzhuZlg1ellQOUUtTGtJZ1M4d3VEdXpsUmxJMTJzQVp6Yi1GSE5qWFJrNEJtOXdQeUFrUjFJN3JwWUVYYk9PT09yOEVnZ190NV9nT3REX3I2R3VlaW5BUG9GSXQtZ2s2SC10S2R0WTBFVHdJbzdMRFA5N0VPc3FUR0tIVk9USGFxNNIBkgFBVV95cUxQSEZUMnhrWXVqTjNYOUdvMGdqUG1EYXdqTDBMODA5Yl83NHlMVWlQNnQ0bnB0U0M2SmV2TlhJeW9TcUJ6MFRuaE1fdW9lVFhIaGNSdWFVYXJhOWV1M0pZeHlDZmU1Ukc1TzVfSmFoNlhHajdPMzZzMHN6MDdTc1Y3eFJzd2FGaV9nd0lhUjlPUFdydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum a ‘major disappointment’ – Expert delivers harsh verdict! - AMBCrypto News",
        "content": "Analysts predict peak cycle for Bitcoin and Ethereum amid regulatory uncertainty.\n\nRegulatory debates and SEC allegations intensify negative sentiment toward Ethereum.\n\nAs Bitcoin [BTC], the leading cryptocurrency, dips below the $60,000 threshold, analysts suggest that BTC may have reached its peak for this cycle.\n\nEthereum [ETH] seems to be mirroring the movements of Bitcoin, as both cryptocurrencies are currently experiencing a downward trend.\n\nCommenting on the uniqueness of this crypto cycle, crypto veteran Alex Krüger said,\n\n“The crypto cycle has been almost entirely driven by the bitcoin ETF.”\n\nHe further added,\n\n“ETH has been a major disappointment, but it has performed well overall for stakers and airdrop farmers.”\n\nWhy is Ethereum losing its limelight?\n\nUndoubtedly, Bitcoin achieved remarkable performance by reaching new record highs in this cycle. However, Ethereum’s position has declined, falling below Solana in terms of product-market fit and retail trader popularity.\n\nThis raises a question: Can Ethereum’s price plummet to $2500 within the next 7 days?\n\nWell, to answer this, AMBcrytpo analyzed the liquidation levels for ETH.\n\nAccording to the analysis, the Ethereum market has a cluster of liquidation levels between $2640 and $2750, attracting traders due to high liquidity. Additionally, this price range aligns with a bullish order block observed at the range highs, further reinforcing its significance.\n\nThis underlines that Ethereum’s price is expected to decline to this liquidity pocket before a potential reversal.\n\nThe concerns surround ETH’s classification as a security\n\nMoreover, the ongoing debate surrounding whether ETH is a security has intensified negative investor sentiment toward Ethereum.\n\nAmidst these metrics, a new development also took place wherein Rep. Patrick McHenry, the chairman of the House Financial Services Committee noted,\n\n“New court filings indicate that @SECGov Chair Gary Gensler knowingly misled Congress when pressed on the classification of #ETH at a @FinancialCmte hearing to conduct oversight of his agency.”\n\nThis highlights the increasing uncertainty surrounding Ethereum’s regulatory status and its impact on investor sentiment.\n\nEchoing similar sentiments, @TheDustyBC, a content creator, took to X (Formerly Twitter) and said,\n\n“Ethereum not being kind on the feelings today.”\n\nWay forward\n\nHowever, now with the hawkish stance at the Federal Open Market Committee (FOMC) meeting on the 1st of May. And, the Hong Kong ETFs being a major disappointment, the execs are still waiting for the tables to turn. Needless to say, Krüger claims,"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNYXFhVkZDamItdFE4d19kRGdBQkJhTWlmSVFhU3RJZHhtMEJaTjNQVVhkTWJJSGQxOFlVX096MHNYTGNmdV8xY3JRYzc2bTIxTjAwRWtDdFdrT1hGcVBHdlRyVFhCVUVxWWlkSks1Y0NIaVFUQmpfc3hmMloyWnM3SHJiUFhRUnloOExLMWpBd0MxU3pDZ21aM9IBngFBVV95cUxNc1Zma2NPYjZtZ2IxcW5HcEZhRUZDZ1MwTlBjUlNqRDlVV3RWX1lmUVVKV3VXQ1ltbGR3Z3BHLXRMZUVQRXZrNE5WYWo5NHNpVlBqNWQwZnNLVkhsbmNzdHBFY2V1U1pQUDA3VVBweENqbk9xZE9SQ1FoSTRwT0sweUNsRXQwVG13S0h5b19YcDA4MENtaTJ0WTVIWGhRdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Ethereum’s price below 3K! How long should you wait before the next rally? - AMBCrypto News",
        "content": "ETH’s price dropped under $3000 on the 30th of April.\n\nThe decline will likely continue if bearish momentum climbs.\n\nEthereum’s [ETH] brief decline below $3000 during the trading session on the 30th of April led to a spike in its social activity, Santiment noted in a post on X (formerly Twitter).\n\n🗣️ #Bitcoin and #Ethereum are seeing significantly higher discussion compared to other assets today. Traders have showed a sizable amount of fear with $BTC dropping as low as $59.5K and $ETH as low as $2.9K today. Counter traders have used these signs as a great #buythedip… pic.twitter.com/6pRAFHidcD — Santiment (@santimentfeed) April 30, 2024\n\nAccording to the on-chain data provider, at the time of press, the altcoin ranked second in terms of social discussion after Bitcoin [BTC].\n\nBetween the 29th and the 30th of April, ETH’s social dominance skyrocketed by 150% as the chatter involving the coin across Telegram, Reddit, X, and 4Chan increased.\n\nTo rise or fall?\n\nGenerally, when an asset’s price decline is followed by a surge in social activity, it often signals an impending price correction.\n\nHowever, a look at the coin’s price movements on a daily chart suggested that ETH might not be poised for any significant rebound in the short term. Its price may even witness further downside.\n\nReadings from the coin’s Fibonacci Retracement levels showed that ETH’s decline below $3000 marked a breach of an important support level, which it had formed at $3145 over the past few weeks.\n\nExchanging hands at $2,899 at press time, the likelihood of a further decline remains high as demand for the leading altcoin continues to plummet among market participants.\n\nFor example, ETH’s key momentum indicators were positioned below their respective center lines at the time of press. Its Relative Strength Index (RSI) was 45.31, while its Money Flow Index (MFI) was 40.50.\n\nAt these values, the indicators signaled a preference for coin distribution over accumulation.\n\nFurther, the coin’s MACD line (blue) rested below its signal line (orange) and approached the zero line at press time.\n\nWhen an asset’s MACD line rests below its signal line, it indicates a rise in bearish momentum. This means that the asset’s price could be in a downtrend or that it is expected to experience downward pressure soon.\n\nTraders often interpret it as a potential sell signal.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nIf bearish momentum climbs, ETH’s next price point might be $2867.\n\nHowever, if the bulls increase their demand and are able to initiate a price rally, the coin might correct its movement, reclaim support at $3145, and rally toward $3300."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQQlFIZWpxeVZISl94X3IxeFU1M2lpaUhyOGN3a0lLRDNRbTVGaU5NY2Qybi1JUVlRX1VWU1ZTeTdKYS1YRjNPVHFYRWVGUFJkM3FTZW1KODhuXzZmMmlmNElQYnRnVXVScUhfRllxcEhuUlFieWJfLVdLQzQxSWhEczViblpTSHZweHY4U185aWxxNDJRUnNoNUJCTmV5N1hXNnpBVlBoYl_SAa4BQVVfeXFMT0pLOXNYN0FleEx1MVV3TzU0QXRFV3RVcDRXVmI5VWpHcVM3aWNkY1VXVDJMU1Q4ellsVGxVX1MtQllHc0tjVnVvMUhHZ0IwbjhsUThxQ0xueUI3ZnF2OE5ldkZFYS1yNWNNOWpSaV9xb2JyZlZrS0xSWUVMYlByOE1hN0xoYmtEc1ViNUgxQkQ1VVd5RlFnNWQ3M3FjVTNKTTBHbnpRWE5yeTVwNVln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 2: Bitcoin At $57K, Ethereum Continues Decline, Solana Recovers - CoinGape",
        "content": "The top crypto prices today witnessed continued declines as the Bitcoin (BTC) price plunged to the $57,000 level. In addition, the Ethereum (ETH) price geared up for a dip below the $2,900 mark, losing hold on a crucial level. However, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) rebounded significantly, defying the bearish turn.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price plunged by 4.43% reaching $57,419.91 at the time of writing on Thursday, May 2. On the other hand, it’s trading volume soared 30.72% to $49.54 billion in the last 24 hours. Whilst, the crypto’s market capitalization slipped to $1.13 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price lost 2.86% to $2,912.84 at press time with a market valuation of $355.33 billion. Whilst, ETH saw its trading volume surge 12.01%, reaching $20.16 billion.\n\n3. Solana Price\n\nThe Solana price rebounded and inched closer to the the $130 mark today. The Solana price gained 2.75%, settling at $129.31. In addition, SOL witnessed a 19.65% surge in trade volume to $4.16 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price surged past the $0.51 level. The XRP price recorded a gain of 1.75%, reaching $0.5113. On the other hand, XRP’s trading volume spiked 30.32% to $1.78 billion.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price was up 0.66% to $0.4445 today. Whilst, ADA recorded a hike of 28.11% in its 24-hour trading volume, settling at $533.30 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price slipped 5.41% to $0.125 while its rival, Shiba Inu price was down by 1.98% and traded at $0.00002168.\n\nAlso Read: Crypto Market Recovery? US Treasury Announces $125M Refunding, Buyback Plan\n\nTop Crypto Gainers Today\n\nAxelar (AXL): The Axelar crypto surged 8.11% and traded at $1.17.\n\nThe Axelar crypto surged 8.11% and traded at $1.17. Polkadot (DOT): The DOT crypto price rallied 5.22% to $6.86.\n\nThe DOT crypto price rallied 5.22% to $6.86. EOS (EOS): The EOS crypto price was up 3.33% and was valued at $0.7813.\n\nThe EOS crypto price was up 3.33% and was valued at $0.7813. Optimism (OP): The TRX crypto price rose 2.97% to $2.66.\n\nTop Crypto Losers Today\n\nHelium (HNT): The HNT price plummeted 7.84% to $4.95.\n\nThe HNT price plummeted 7.84% to $4.95. Toncoin (TON): The Toncoin price plunged 6.60% to $4.72.\n\nThe Toncoin price plunged 6.60% to $4.72. Cronos (CRO): The CRO crypto slumped 6.28% to $0.1233.\n\nThe CRO crypto slumped 6.28% to $0.1233. Sei (SEI): The Sei price witnessed a dip of $0.5098 to 6.02%.\n\nDespite the bearish turn, Solana, Dogwifhat, and Pepe made it to the top gainers list today. However, millions worth of crypto liquidations were noted in the past 24 hours, which could have expedited the latest crash for BTC and ETH. According to Coinglass, Bitcoin alone witnessed $145.55 million liquidations in the last 24 hours. Out of this, $109.13 million has been attributed to longs.\n\nAlso Read: 3 Trending Altcoins To Buy Making You Rich In 2024 Bull Run\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNaDBwYW9tdW90cDdfcDIxVWdhbzBHRFNvUWxuWU9CMUM5NTR1d0NsenRrRXdEZ2Jfb2ZKeThkUzlxdE1nVUZ6QzJrU0ozb1F1Nk1VWXJNU0p6LTNnaXc4S0tuSzBsT0dBN2lwdnZzczZtMGlfeFBtdHlSNzhwWHByQTFWWHcxV2h1cFpNZUIwcHrSAZYBQVVfeXFMT2NlZHRiRGl3cEVKT251YnB6Q0pDU2U0djVRSVBqZ2tDRFVUUkRXOVZEQ1hlM25xU0UwZ0s1YW1DTG90bkltZkx6OU5yY2lsTmxFVGY1UE9yWHJSRWJtSWszMTk2d3RTU1RUTXNZTng5UUhRa3dFMjRKNENaVmJJT3ByNzU2ajFCc2ZRQ2JISlJwOWREQktB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Why Ethereum’s price can spiral towards $2500 over the next 7 days - AMBCrypto News",
        "content": "Ethereum flipped its 1-day market structure bearishly.\n\nThe former range highs were the next support region of interest.\n\nEthereum [ETH] saw a wave of selling activity as profit-taking arose amidst fear. The downtrend was persistent in April and the selling volume was growing.\n\nThe indicators were bearish on the one-day timeframe.\n\nThe disappointment from the Hong Kong ETFs’ volume on the first day outlined the sentiment toward ETH and crypto. The Open Interest also fell lower to suggest speculators were more guarded.\n\nThe bullish order block above $2500 next\n\nThe higher timeframe trend of Ethereum flipped bearishly after it dropped below the $2906 swing low. If the daily session closes below this level, the price would very likely head toward the next support zone at $2600.\n\nThis region also has confluence with the former range highs that ETH traded within a few months ago. The RSI on the 1-day timeframe has been below neutral 50 for most of April, highlighting consistent downward momentum.\n\nThe OBV also slipped below a support level recently and retested it as resistance. Ethereum is likely to register sizeable losses before reaching the next notable level on the indicator.\n\nThe hunt for liquidity could see ETH go south\n\nThe closest cluster of liquidation levels for ETH was downward. The $2640-$2750 region presented an attractive pocket of liquidity.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIt also has confluence with the bullish order block highlighted at the range highs.\n\nIt is expected that ETH will descend to this liquidity pocket before a reversal. Chances of a reversal before that were slim, since these liquidation levels act as magnetic zones to the price.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNMHcyaWM4cktXWWY4c3JSLVhjNFA1YTJBRXJFRXhFbklOcWR2TWp2cFVqSWpFVEdoMnJFMVVqMW1xcVdFcjNfQmx3bk5IYk5KNjVwTlNmQWEzUEFtZ0NucGZYN3BfaHJfd2doZTNWVnJnc3g4T2lld3FsU1RkTEptWFpBOEdEbHRFY0dabGVvdUVRTXR3VVM1aGQtbmZNTEVpVHlF0gGoAUFVX3lxTE1yS3g3ZVpwMmRGeWJGM1ZiVldkZ2Vld1Z5dHBRX0ZuTld1eC1sbjFvNTVMQldIZnVUakpmdkhuVFhQWnNzaDQ2eFktRVF5YVgzQXkzb0JBQnRBMnp2TlpDc1l1STMwNzFNRXQ3RnZMLTM4UnhuYmZNTDlLbnRtUVJLd2J1OWJSZUVkWjNZVmJabUxDWW1GaDRZMWRRckNFMTE2UUFLaXNaNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 1: Bitcoin & Ethereum Crash 5%, Cosmos Gleams Amid Market Dip - CoinGape",
        "content": "The top crypto prices today crashed heavily as the Bitcoin (BTC) price plunged to the $60,000 level despite the recent Hong Kong ETF launch. In addition, the Ethereum (ETH) price plummeted below the $3,000 mark, losing hold on a crucial level. Moreover, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) plunged notably, mirroring the bearish trend.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price crashed by 5.13% reaching $60,191.06 at the time of writing on Wednesday, May 1. On the other hand, it’s trading volume spiked 41.71% to $37.91 billion in the last 24 hours. Whilst, the crypto’s market capitalization slipped to $1.18 trillion.\n\n2. Ethereum Price\n\nThe Ethereum price tumbled 5.46% to $2,999.10 at press time with a market valuation of $365.74 billion. Whilst, ETH saw its trading volume surge 29.66%, reaching $17.99 billion.\n\n3. Solana Price\n\nThe Solana price extended below the $130 mark today. The Solana price lost 7.06%, settling at $126.06. In contrast, SOL witnessed a 42.20% surge in trade volume to $3.48 billion in the last 24 hours.\n\n4. DarkLume (DLUME)\n\nDarkLume is a gamified socioeconomic system that runs in a virtual world. It offers a distinct blend of fantasy and social interaction. DarkLume enables users to become citizens of virtual countries by participating in recreational activities. It serves as a platform for interaction in a dynamic social ecosystem. To reinvent luxury living and entertainment in the digital age, catering solely to the needs and preferences of modern societies.\n\nThe token is currently running a presale for 40000000000 DLUME tokens. It has already raised $25,033 at $0.0005. The next price is expected to be $0.00060, while the listing price might be $0.0015. These price estimates are entirely situational and subject to change as presale activity increases.\n\n5. XRP Price\n\nWhilst, the XRP price inched closer to drop below the $0.50 level amid the broader market crash. The XRP price recorded a slump of 2.66%, reaching $0.5026. On the other hand, XRP’s trading volume soared 24.41% to $1.36 billion.\n\n6. Cardano Price\n\nMeanwhile, the Cardano crypto price slipped 2.96% to $0.442 today. Whilst, ADA recorded a hike of 40.13% in its 24-hour trading volume, settling at $416.32 million.\n\n7. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price crashed by 7.29% to $0.1324 while its rival, Shiba Inu price tumbled 7.57% and traded at $0.00002215.\n\nAlso Read: How Will Bitcoin Price React To FOMC Meeting?\n\nTop Crypto Gainers Today\n\nCosmos (ATM): The Cosmos crypto surged 5.43% and traded at $8.56.\n\nThe Cosmos crypto surged 5.43% and traded at $8.56. Optimism (OP): The OP crypto price rallied 2.52% to $2.58.\n\nThe OP crypto price rallied 2.52% to $2.58. Starknet (STRK): The Starknet crypto price was up 2.22% and was valued at $1.24.\n\nThe Starknet crypto price was up 2.22% and was valued at $1.24. Tron (TRX): The TRX crypto price rose 0.45% to $0.1201.\n\nTop Crypto Losers Today\n\nArweave (AR): The AR price plummeted 17.25% to $29.74.\n\nThe AR price plummeted 17.25% to $29.74. Stacks (STX): The STX price plunged 15.01% to $2.04.\n\nThe STX price plunged 15.01% to $2.04. Sei (SEI): The Sei price witnessed a dip of 11.75% to $0.542.\n\nThe Sei price witnessed a dip of 11.75% to $0.542. Lido DAO (LDO): The LDO crypto slumped 11.43% to $1.90.\n\nDue to the sudden bearish trend, none other crypto made it to the top gainers list. Moreover, millions worth of crypto liquidations were noted in the past 24 hours, which could have catalyzed the latest crash. According to Coinglass, Bitcoin alone witnessed $107.64 million liquidations in the last 24 hours. Out of this $93.26 million has been attributed to longs.\n\nAlso Read: Here’s Why Pepe Coin Price Sees a 20% Breakout Rally in May\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNSUc3cTdTTnNvcVFpM1YyU0FPY2lPSFpyWFpEUE1pNHVDM2xJa2RVTjZMUmhOMmluUmVtb3hEREsxNmcyWjQzN2g2c3lZWmhXNjVvaGUxOTdNZDZ2Q2ZJYlRUQUM3Vk1BdzJOUzdLYVJZQkJ5dVZxbTI3THEzUnY2QURnbUN4S3Q2QkdndtIBkgFBVV95cUxQZmtLMngwZ01WQWdLNTNfOXY5VlpZdXc2c2lLZkU5eElqY3pLcWR6aXJ6UDdDNF9VVU0wUm40aG5qY1FOLXItOGpILVhVWElPREpyZExES1J0NzhzeWdHbkRjTjRaSFRiMXR1NXczUVU1NnY5SVd5VTlReWpZajlxbWFFbzExZzZKczlwaEczQkQ3QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum dips, but demand rises: What’s driving investors to ETH? - AMBCrypto News",
        "content": "ETH saw the biggest 2-day stretch of network expansion since October 2022.\n\nThe addresses holding between 0 and 0.1 units of ETH increased significantly.\n\nEthereum [ETH] continued to fall freely, sinking below $3,000 in the last 24 hours following a 3% drop, data from CoinMarketCap showed. The second-largest cryptocurrency was trading at $2,914 at press time, reflecting a 13.34% discount over the month.\n\nThe negative price action, however, did not appear to limit demand for the asset.\n\nUnfazed users continue to snap ETH\n\nAccording to on-chain analytics firm Santiment, Ethereum saw a sharp increase in new users joining the network. About 266.6k new wallets were created on the 28th of April and 29th, the biggest 2-day stretch of network expansion since October 2022.\n\nNetwork expansion is one of the primary measures for determining if a cryptocurrency is gaining or losing traction. The onboarding of new users indicated confidence in ETH’s long-term potential, ignoring short-term blips.\n\nRetail users enter ETH market\n\nOn further scrutiny, it came to light that retail users were jumping on the bandwagon. The addresses holding between 0 and 0.1 units of ETH increased significantly while the prices plunged, as per AMBCrypto’s analysis of Santiment’s data.\n\nInterestingly, the cohorts holding more than 1 ETH were selling off, as evident in the drop in their ETH reserves.\n\nThe aforementioned findings suggested that retail interest was strong for ETH and healthy inflows from this segment could contribute to a relief rally in the days ahead.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIs staking the driving force?\n\nMany of these retail customers buying ETH might be lured by the yields offered by ETH staking services.\n\nThe total ETH staked soared to 44.24 million as of this writing, forming 36% of ETH’s total circulating supply, AMBCrypto noted using Glassnode data.\n\nAt the same time, the supply of ETH on exchanges continued to shrink, falling to 12.79 million as of this writing, about 10% of total ETH coins in circulation."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPY21xaXZPaHh3ZkpGelJ3b0pyTm5BTFhBempWUHdqWW81QkliR3dtME1zbW5qTnNyRkZXYXJoeENDUGJMU3ZoNjJ1YlNSbDg2R1VLQ2h1cGNneVp6OElDR0IycXNTRHZsUzNvVnVsOFo0OThrM0tJOWJ0eTRYMElFY3VuRzdyTTQwdUNMbFBMV25FM19OSUZCSdIBngFBVV95cUxNQnZCS3FsNGtTZTRyczROc1JyaXJIZGpUNk1oNVQ5WHNmdVVJSGpkZHNpUDZTLTJTZDc1X0ZibU1MSmJscWJUYmRZeXV0RklZS0RwTVpobUVNcmlRcDZpT2hIOG9xRkIyN3F1ajhZMXJkZ3o2N0VWNFpuemhrV3ktZVZYeWgyeWRzM0tnRDY2eUtMMnBXR0ZSOFFwVjhrdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Why is Bitcoin dropping and why are Ethereum, altcoins taking BTC’s lead? - AMBCrypto News",
        "content": "Bitcoin was trading 16% below its ATH recorded in March.\n\nFurther downsides could be potentially dangerous for the broader market.\n\nBitcoin [BTC] sank below $60,000 during U.S. trading hours Tuesday, extending a string of losses in what has been one of the worst months for the cryptocurrency market in recent memory.\n\nBloody April\n\nThe world’s largest digital asset was down nearly 5% in the 24-hour period, data from CoinMarketCap showed. It ended April at a 14.5% monthly discount.\n\nAs of this writing, it was hovering over $58,000, down 16% from its all-time high (ATH) recorded in March.\n\nThe slump rippled across the market, causing other coins to trade in the red.\n\nMore than $36o million worth of positions were liquidated in the last 24 hours, with longs accounting for 85% of the total, AMBCrypto noted using Coinglass’ data.\n\nAbout $107 million in Bitcoin liquidations was observed in the 24-hour period.\n\nWhat is causing negativity?\n\nThe sell-offs followed the lackluster debut of the newly-listed spot ETFs in Hong Kong. They recorded just about $11 million in trading volume on the first day, according to data from Hong Kong Stock Exchange.\n\nThis was a fraction of what U.S.-based spot ETFs clocked in their debut in January.\n\nU.S. spot ETFs were not exactly having a great time either, as they saw net outflows of $161 million on Tuesday, the fifth straight day of outflows, AMBCrypto examined using SoSo Value data.\n\nMoreover, expectations of the U.S. Federal Reserve keeping the interest rates steady in the upcoming FOMC meeting in light of hotter-than-expected inflation data was also prompting traders to take out their capital from riskier investments.\n\nIs your portfolio green? Check out the BTC Profit Calculator\n\nWhat to expect next?\n\nShivam Thakral, CEO of Indian cryptocurrency exchange BuyUcoin talked about the significance of Bitcoin’s current price levels in a statement shared with AMBCrypto.\n\n“Bitcoin was retesting the crucial support zone of $58,000-$60,000. This zone holds significant importance for the short-term prospects of altcoins. If it is lost, altcoins could potentially suffer further downsides.”\n\nThe increasing FUD might help in a creating a local bottom. While reacting to the crypto market’s greedy state, popular technical analyst Ali Martinez said that more fear was needed for a sustained rebound."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNRG5xR3pJeVFwbF8wWUhrZFBNVG4ySENnazQ2NVhfSGhGUC0yQ0RMVFF1SHViWlV4a1lQaE1mT1BKc3oyTUhLUzctSVhPdnctYWtVMmdIV3FnSHdYcGdSMjNKOEtLeEFwZEhTR3ZhS1JSUzljNmIyNGx5eFRNYTRMY1A2OEhSbEdOelpaTS1B0gGTAUFVX3lxTE1fVkstY1ZiWjlUTVVJNnVpWnd1MmFMWHhuU1ZSQjlkVjFRRExKSzFGVTZZQU1pdWRQby1HMDl0N3c3dmRBWk82Y1JqdTBHaGZ5VVVadV9TdVhNMUlPc2NrNmI5eHZSVGpwZFZLZ2ZZV2VKb09uSjRUUDZPNmV5dnU3RV9SUHo3cFY2YmJFMjlETkxaYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Ethereum: Hong Kong spot ETFs fail to impress, what next for ETH? - AMBCrypto News",
        "content": "ETH was down 3.2% in the 24-hour period at press time.\n\nDerivatives market has been bearish on the coin for the last 2-3 days.\n\nWorld’s second-largest cryptocurrency Ethereum [ETH] trended lower since the listing of first-ever crypto spot exchange-traded funds (ETFs) in Hong Kong.\n\nAccording to CoinMarketCap, ETH rose to $3,250 shortly before the funds started trading on the Hong Kong Stock Exchange (HKEX) – the city’s bourse.\n\nHowever, the stiff resistance pushed the digital currency back, causing it to fall to $3,020 as of this writing, a 3.2% drop in the 24-hour period.\n\nWell-known technical analyst and trader Ali Martinez had talked about the significance of $3,200 as an important resistance level for ETH recently.\n\nAs many as 2.43 million addresses had acquired 5.14 million ETH at this level. Hence, overcoming this “brick wall” was critical for a sustained rally.\n\nSpot ETFs start on a dull note\n\nThree spot Ether ETFs, along with three Bitcoin [BTC] spot ETFs, debuted in Hong Kong, a city which has been vying to project itself as the next crypto hub.\n\nHowever, the shares of all the three ETFs tied to ETH closed lower, according to AMBCrypto’s analysis of HKEX data, as trading volumes failed to pick up. This, in turn, might have influenced sentiment towards the cryptocurrency, causing it to drop.\n\nSpeculative market bets against ETH’s rise\n\nAs ETH dipped in the spot market, ripples were felt in the derivatives sector as well. The Open Interest (OI) in ETH futures plunged 4.5% in the last 24 hours, as per AMBCrypto’s analysis of Coinglass’ data.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIt looked as if the derivatives market had sensed a poor opening day for Hong Kong Ether ETFs. The number of traders shorting the crypto against those who were taking long positions has been rising in the last 2-3 days, as per Longs/Shorts Ratio.\n\nAs of this writing, nearly 53% of participants were bearish on the coin."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNaGthQ0RaVEtKazBqUVd1VG4tNENmRExlZDFOUURmcnpMeF82VnNYSzk1ZS1yRWtJTU4yNTlFSjVTZ0pqMFdLTU5ucmdralBzbEpfM1I4QkFnUU8tZjdpbzcwM0N4bW0wWkhhcVBiVVFxb3k3VWRVemhJeC1Vc0F0dDlGQWZ0d2JUX3piMm5R0gGTAUFVX3lxTE9sMkl3Zmt1WV96OHRMOUFCbC05d2tMS3VxRlNIaU1XbWJkeVNOWkZRUmNLRGRCZTBENDhNTS1hdFJVeUViX2JSR2t5eUwzYURsWFd6QWRTRk9qV05KYkhXUmVJcEx1emR6Q2V6SWo5VWdVSWpKOFRERWRPc0V1UWF6dEw3MEZ4d3hpLVAzYkJLS0ctaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Solana loses 10% in 24 hours, but ‘beats’ Bitcoin, Ethereum in THIS key area - AMBCrypto News",
        "content": "Funds attracted inflows despite SOL’s bearish price action.\n\nThe prospect of improving network health might have driven investors towards SOL.\n\nDigital asset funds tied to Solana [SOL] SAW healthy demand last week, as investors’ appetite for the fifth-largest cryptocurrency took a healthy turn.\n\nSolana sees a shift in sentiment\n\nAccording to the latest report by crypto asset management firm CoinShares, Solana-based crypto products attracted more than $4 million in inflows last week.\n\nThis was a sharp turnaround from the $300,000 in net outflows recorded in the week prior.\n\nThe recent inflow boost came even as blue-chip assets like Bitcoin [BTC] and Ethereum [ETH] witnessed heavy outflows, totaling $423 million and $38 million respectively.\n\nInterestingly, demand for SOL-linked funds surged despite a bearish price action, which saw the crypto tumble 16% over the week, AMBCrypto noted using CoinMarketCap data. At press time, in just 24 hours, SOL’s price was down by over 10% on the charts.\n\nIn fact, the price decline resulted in a slight drop in total assets under management (AUM) from last week, from $1.15 billion to $1.14 billion.\n\nWas this the reason?\n\nWhile it is difficult to pinpoint the bullish catalyst propelling investors toward Solana goods, the possibility of reduced network congestion could be a credible cause.\n\nSolana developers have been shipping release after release to alleviate transaction failures and congestion on the network, issues that have contributed significantly to the FUD around the coin.\n\nThe latest one to go out was the v1.18.12, which was currently being validated in the test environment.\n\nThe Solana community hoped that these improvements would finally resolve the ongoing troubles with the blockchain, which has been strained to its limits due to an explosion in meme coin trading.\n\nRead Solana’s [SOL] Price Prediction 2024-25\n\nThe latest blow\n\nWith Bitcoin crashing below $60,000, the downtrend has persisted on SOL’s charts, with the altcoin down 10% in 24 hours.\n\nThe latest drop appeared to be part of the broader market bloodbath, fueled by lackluster performance of newly-listed spot crypto ETFs in Hong Kong."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPU0xaUzd0bllDX2VJVFN5QzV6ZVE1UmNoaUlqdmNDRDRRRm51NDdXWi1ic2ttWXJkbTNwdlYxbzhnWEpTbExURWd2SWhGNVRIUXlNOFNoV2hNSUFsM3NwcmtQMDRUZmhEeFdGMnMyV0FyQkwzV0twY01DNElFZHJ2VGZtbWg4c0JOYU1GYXo3WXpid9IBlwFBVV95cUxOX1ktMHI1c3AxVzhHazBiaERwbzQwdTF4VTJLcTlfOUhIX0kxbzlhS0tEWnRZcWlwS0V4VzBac2ZMbFBSaDFfRmtBSTRlOE9naVVpZ0dxWmVHajVZdzd4V3lQUUpUeDM2cy1Oam1xMnIwdVVJZWJOYlNSTGxIb2M0ZG0xU3NiSnVwRjB5US1LczNPdTZ5cGFJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "April 2024 Report – BTCFi dominance, Ethereum’s fall, and May forecast - AMBCrypto News",
        "content": "Runes on Bitcoin’s blockchain can save traders from massive losses in the coming months.\n\nStaking on the Ethereum blockchain is on the rise, raising concerns about its future as “money.”\n\nAhead of the FOMC meeting (Federal Open Market Committee) of May 2024, the crypto-market saw a significant decline. Bitcoin dropped to $56,494 – A level last seen on 28 February 2024. Market sentiment skewed towards the side of fear as investors rebalanced their portfolios in expectation of no rate cuts.\n\nBitcoin’s MVRV Ratio (7-D) fell to -8.099%, at press time. On average, Bitcoin holders were underwater. It suggested that the market value was significantly lower than the price at which most acquired BTC.\n\nIt could also be taken as a sign of undervaluation. According to AMBCrypto’s market report for the month of April, Bitcoin will continue its downward journey for the majority of trading sessions in May.\n\nHowever, the report discusses three factors (Related to BTCFi, Options ETF, and Solana) that could reverse the king coin’s trajectory. Investments through BTC ETFs will have a bigger impact on price, compared to the fed rate cut anticipation or geopolitical strains.\n\nSince 24 April, BTC ETF outflows have been outweighing the inflows. On 30 April, a $161 million outflow was registered – The highest in the last three days.\n\nAMBCrypto’s report throws light on a fresh perspective though – It reveals numerous institutions are seeking approval for Bitcoin ETFs. If these ETFs are green-lit in May, it could lead to a significant hike in demand, potentially driving the price north.\n\nBitcoin’s savior – Runes\n\nThe rise of DeFi on the Bitcoin blockchain could save traders from registering massive losses in the coming months (AMBCrypto’s report dives into its full details).\n\nInterestingly, the 7-day moving average of Bitcoin’s market cap to transaction fee ratio fell below that of Ethereum. It highlighted a huge surge in activity on the Bitcoin network since the launch of the Runes protocol. Basically, this ratio indicates how much money is flowing into a cryptocurrency relative to the transaction fees being paid.\n\nAltcoins’ performance in April\n\nFollowing Bitcoin’s footsteps, the price of other cryptocurrencies also fluctuated by a significant degree. April was a volatile month for most altcoins. The broader market witnessed a downturn due to geopolitical tensions and inflation fears. However, some sectors thrived, like gaming tokens.\n\nAs per AMBCrypto’s report, Ethereum’s dominance has been challenged by Solana, whose DeFi market share has been surging steadily. Meanwhile, an Ethereum ETF is still pending SEC approval, and staking on the Ethereum blockchain is on the rise, raising concerns about its future as “money.”\n\nTake a look at AMBCrypto’s Market Analysis – April 2024 Edition\n\nDive into April’s market trends, valuable data, and exclusive insights to help yourself navigate through May’s market movements.\n\nThe report delves deep into key topics like –\n\nRising popularity of DeFi on Bitcoin\n\nAmerica’s love for memecoins\n\nFall in USDT’s dominance\n\nSolana’s TVL masterstroke\n\nNFT market’s recovery\n\nMarket forecast for May\n\nYou can also download the full report here."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQLXp4ZURVWXYzc1lwbU5udkkwMmZiaU92dEJ1WjlxNW1zdUlNUzQ2cWNmTkc1dE92Q0ZkLTNlcGRpa1VPRnNSX0NmQXNTVUdSTUV2Qi0xQnBCZ1dvZUZaSTAzbHZ3Rnk0Sm9CeV9xeHJoaUN6Si0yNGZTemxiaS1xemNB0gGHAUFVX3lxTE5ycDF3aFFFdzhpRTZId0x2R3FKWi1aYzFKdi0wZDFRUERxR0RxTzdTN1RmbTJHNTZmeEFmdFlFekVuZG05WmNwN04yQ2dNVUxqSDlWQ2xubnI1Uk9CQ3U1TGhDV3Y3RTgyOGJmQTJIZXd0LU5NYzhsVlpiV2s2NFJkOWtpTkg2TQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "What Next For Bitcoin (BTC) and Ethereum (ETH) Price? - Coinpedia Fintech News",
        "content": "Fun-loving and cheerful, a passionate blockchain and crypto writer who knows no boundary…connect if you share the same passion. With 10+ years of writing experience, I am a Crypto Journalist by chance, exploring, and learning all the dynamics of the sci-fi action-filled crypto world. Currently, focusing on cryptocurrency news and price data. With a passion for research and challenging my capabilities, I am slowly getting into the crypto arena to bring new insights every day.\n\nAnalyst Davinci, in his latest video, discussed the potential impact of Bitcoin roll-ups on the cryptocurrency’s value, suggesting a remarkable tenfold increase. While historically associated with Ethereum, rollups may soon revolutionize Bitcoin’s transaction capacity and functionality, according to a team of crypto developers.\n\nThe analyst observed that Bitcoin is struggling to break free from its current situation on the charts. Despite attempting to rally again, he anticipated this might be its last push before a potential breakdown. He noted it could mark a critical moment if Bitcoin drops back to or below $60,000.\n\nWhile there’s a chance of a bounce from that level, he suggested considering a short position. Assessing the risk-reward ratio, he highlighted the potential for a downward move, possibly reaching down to the red line. This presented an opportunity for a profitable short trade on Bitcoin, which he recommended considering if it was missed earlier.\n\nWhat’s Next for Ethereum?\n\nLooking at Ethereum’s chart, it keeps trying to go up but keeps getting stopped by a price level that used to be its support. It’s acting as tough resistance, making it hard for Ethereum to climb higher. If Ethereum drops below $3200, it could be in big trouble, possibly falling even more.\n\nAnalyzing where Ethereum might go next, it looks like $2500 could be a significant target for its price to drop. This means Ethereum might have a rough patch ahead. However, Ethereum and Bitcoin are expected to do well in the long run, regardless of challenges from regulators like the SEC and governments.\n\n“You cannot stop a technology whose time has come,” he declared confidently, assuring his audience of brighter days ahead in the world of crypto.\n\nAlso Check Out : Here’s When Bitcoin (BTC) Price Will Initiate a Fresh Rally"
    }
]